{
  "Raichu": {"sets": {"Sleeper": {}}},
  "Nidoqueen": {"sets": {"Sleeper": {}}},
  "Nidoking": {"sets": {"Lovely Kiss": {}, "Amnesia": {}}},
  "Clefable": {"sets": {"Amnesia": {}}},
  "Persian": {"sets": {"Standard": {}}},
  "Golduck": {"sets": {"Amnesia": {}}},
  "Alakazam": {
    "overview": "<p>Alakazam received some serious upgrades in Tradebacks OU, gaining the elemental punches to give it coverage outside of Seismic Toss. However, its usual roles remain: Alakazam is a strong lead, revenge killer, and paralysis support guru thanks to its exceptional Speed—allowing it to outrun even Persian—a trait which also gives it a fantastic critical hit rate. Indeed, Alakazam's offense allows it to close out end games very quickly if left unparalyzed. With effectively no weaknesses thanks to its typing, Alakazam has notable defensive utility; it can switch into Pokemon like Chansey and opposing Psychic-types like Starmie, Hypno, and opposing Alakazam. These traits culminate to form a strong, multi-faceted threat that can be used at any stage of the game with few truly losing matchups.</p> <p>However, Alakazam is not flawless, as its physical bulk is very poor. If paralyzed, while it's an amazing sleep blocker thereafter, it's also very vulnerable to Pokemon like Snorlax, Tauros, and Persian, which eat it alive. Furthermore, Psychic's PP only goes so far, and this is what defines Alakazam: it must be used conservatively. Alakazam has a very difficult time breaking past the mandatory Chansey without a mix of full paralysis, critical hits, and Special drops, and even if it succeeds, it's not going to sweep thereafter. Alakazam also finds itself cancelled out by opposing Psychic-types, which, similar to Chansey, often goad it into prolonged interactions that leave it with little attacking PP thereafter.</p>",
    "comments": "<h3>Other Options</h3> <p>Alakazam's movepool is deeper than it seems, making customization very possible. Generally, Psychic and Recover should never be dropped, as they are the roots of its power and longevity. Sets using two of Seismic Toss, Thunder Punch, and Ice Punch are possible if dropping Thunder Wave, but this significantly reduces its threat level against Pokemon like Tauros, which become capable of trading hits with it once the set is revealed. All things considered, Alakazam's single coverage moveslot is the most droppable, and anything further than that is ill-advised.</p> <p>Barrier is a significant upgrade to the classic Reflect Alakazam set from regular RBY OU, letting Alakazam stack Defense buffs and reapply the Speed drop from Thunder Wave paralysis. These traits make it a lot stronger against Pokemon like Snorlax long-term, and because it can reapply the paralysis Speed drop, its own paralysis-absorbing antics are far more effective. However, all of this comes with a crucial caveat: it has to drop its coverage, leaving it with just 16 attacking PP in Psychic, which is generally undesirable in a metagame with high bulk and lots of recovery. If its checks are removed, though, Barrier Alakazam can spark endgame scenarios that are very difficult for opponents to dig out of.</p> <p>Counter gives Alakazam more utility against opposing Seismic Toss Alakazam, severely damaging it if it lands. It also has utility against Pokemon like Snorlax, which can't OHKO Alakazam without extremely strong attacks like Hyper Beam. Outside of this, bringing in Alakazam after a Pokemon like Tauros has KOed something to threaten paralysis and instead go for Counter allows it to severely damage a switch-in, possibly even landing a free KO.</p> <h3>Checks and Counters</h3> <p><strong>Physical Attackers</strong>: Alakazam's low physical bulk makes it highly vulnerable to physical attacks if paralyzed. Tauros, Persian, Rhydon, and Snorlax all mortally threaten it on this front, especially if switching in on a recovery turn. If Alakazam has taken even minor damage, all of these Pokemon are capable of threatening it with a KO.</p> <p><strong>Psychic-types</strong>: Because it relies on Psychic, Alakazam tends to find itself in awkward situations against opposing Psychic-types, with them often cancelling each other out. While its elemental punches can allow it to specialize in defeating Starmie or Exeggutor quickly, it can still find itself walled due to the hole in its coverage, and prolonged interactions involving Seismic Toss can result in it being taken out by repeated full paralysis. Surf variants of Starmie can be particularly dicey, with critical hits dealing massive damage. Plus, if the opposing team has more than one Psychic-type, or a Chansey to go with it, the opponent can mitigate Special drops from Psychic by switching between them.</p> <p><strong>Chansey</strong>: Chansey is a royal pain for Alakazam, healing off any damage Alakazam dishes out thanks to its monstrous special bulk and access to Soft-Boiled. In lead situations, Chansey also likes to switch in on turn 1 to take paralysis and put Alakazam to sleep. However, even with just Psychic, Alakazam can force its way through with a mix of critical hits, Special drops, and repeated full paralysis, albeit with a significant hit to its attacking PP.</p> <p><strong>Exeggutor</strong>: Exeggutor resists Psychic and is often willing to take paralysis if it means putting Alakazam to sleep. If Alakazam isn't running Seismic Toss or Ice Punch, Exeggutor also shrugs off any damage taken, giving it more opportunities to incapacitate Alakazam.</p> <p><strong>Slowbro</strong>: Slowbro would love nothing more than to trade a Thunder Wave with Alakazam, set up Amnesia to reapply the Speed drop from paralysis to become faster, and than just blow past and deal massive damage to the opposing team. If Alakazam has Thunder Punch, it can often win out short-term with a 3HKO or win out later with critical hits. Seismic Toss also works for forcing Slowbro to use Rest, which leaves it open for a stronger attacker to come in and force Slowbro out.</p>",
    "sets": {
      "Standard": {
        "description": "<h4>Set Description</h4> <p>Alakazam's Psychic is nothing to scoff at, dealing massive damage to anything that doesn't resist it, with Alakazam's high critical hit rate and Psychic's chance for a Special drop frequently able to turn 3HKO ranges into 2HKOs frequently. Psychic can potentially 2HKO Rhydon, Persian, and even Tauros if either occurs. Alakazam's Speed makes its Thunder Wave largely uncontested in many instances, forcing slower Pokemon like Starmie and Gengar out if they wish to remain threatening later. Recover's 32 PP gives Alakazam excellent longevity, ensuring it can remain offensively threatening for long periods of time.</p> <p>The choice of coverage for Alakazam in Tradebacks OU requires a good bit of forethought. Seismic Toss remains its most consistent option: its fixed damage and the low HP of opposing Alakazam and Starmie mean it should win most interactions against foes that resist Psychic. It also makes Exeggutor far more inclined to use Explosion if even one connects, as it lacks recovery. Ice Punch functions similarly, improving Alakazam's matchups against Exeggutor, Rhydon, Zapdos, and Dragonite. It can also let Alakazam fish for freeze against Chansey, though it's unreliable against it due to the possibility of Alakazam being overwhelmed by repeated full paralysis and Seismic Toss. Thunder Punch allows Alakazam to be far stronger against Starmie, 2HKOing it with even a tiny bit of prior chip damage. It also improves Alakazam's matchups against Lapras, Cloyster, Articuno, and the niche Vapeoreon. However, if running the new elemental punches, Alakazam will always lose to something unless it drops its trusty Thunder Wave: running Psychic + Thunder Punch means it loses to Exeggutor, while Psychic + Ice Punch means it loses to Starmie and gets set up on by Slowbro and Vaporeon. Simply put, these moves improve its consistency in some matchups but forfeit others, so they should be used in cases where a less consistent but more potent Alakazam is affordable.</p> <p>Alakazam makes for a strong lead, as it can paralyze virtually any target before they can make a move, something notably effective when paired with physical sleepers like Snorlax and Persian, which can break through paralyzed Psychic-types and Chansey. Gengar and Persian tend to be forced out; if it isn't for the Thunder Wave, it's for Alakazam's devastating Psychic. In some situations it can force out opposing Starmie, which might want to avoid getting paralyzed. This is usually to Chansey, which absorbs Thunder Wave well and can threaten with Sing thereafter. If faced with a sleep lead like Jynx, Alakazam is content with taking sleep, as it can wake up against opposing Psychic-types like Exeggutor, Hypno, and non-Seismic Toss Alakazam. Against sleep lead Alakazam has a positive matchup against, such as Gengar and Persian, Alakazam is best off using Thunder Wave and pressuring the switch-in or double switching into a sleeper. Chansey is also relatively easy to wake up on if it lacks Seismic Toss. Given its speed and power, Alakazam is also usable in the back as a strong late-game cleaner. The elemental punches let Alakazam excel here so long as its teammates remove its checks. Starmie makes for a strong partner here, making use of the coverage Alakazam lacks to form a concentrated offensive core with a strong backbone. In the case Alakazam is used in the back, it should avoid paralysis in most situations, but adapting Alakazam's role to the situation at hand is essential for succeeding with it.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 535530, "username": "Gangsta Spongebob"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 43049, "username": "Torchic"}, {"user_id": 583793, "username": "Sabelette"}]}, {"name": "Grammar checked by", "members": [{"user_id": 583793, "username": "Sabelette"}]}]}
  },
  "Victreebel": {"sets": {"Wrap": {}, "Swords Dance": {}}},
  "Tentacruel": {"sets": {"Wrap": {}}},
  "Golem": {"sets": {"Standard": {}}},
  "Rapidash": {"sets": {"Sleeper": {}}},
  "Slowbro": {"sets": {"Standard": {}}},
  "Cloyster": {"sets": {"Standard": {}}},
  "Gengar": {
    "overview": "<p>Gengar makes a name for itself in Tradebacks as the second fastest sleep inducer behind Persian, giving it a prominent role in the lead metagame, as it threatens every slower sleep-inducing lead in the game. Gengar is also the only relevant Ghost-type, letting it wall Persian after Sleep Clause has been activated, and pivot into strong Normal-type attacks from Snorlax and Tauros to let teammates such as Cloyster, Zapdos, and Snorlax come in more easily. Its typing also lets it catch Explosion from Cloyster, Exeggutor, Snorlax, and opposing Gengar. Its high Special allows it to deal solid damage with Thunderbolt and Ice Punch, and access to Explosion allows it to threaten walls and bulky foes like Chansey and Exeggutor. In addition, its 21.48% critical hit rate makes these offensive tools all the more dangerous.</p> <p>However, Gengar’s Poison typing, mediocre bulk, shaky accuracy with Hypnosis, and lower Speed relative to its threats all prove to be significant flaws that make Gengar somewhat unreliable. Its Poison-type allows Earthquake users and STAB Psychic users to greatly threaten it. Gengar also has reliability concerns as a sleeper, as its frailty combined with Hypnosis's 60% accuracy means it may fail to put a foe to sleep before it is KOed or forced to use Explosion. Tradebacks OU also features more strategies involving early paralysis spreading compared to OU. This also frustrates it, as Gengar's base 110 Speed is one of its greatest strengths, letting it outspeed otherwise much more threatening Pokemon such as Snorlax and Exeggutor.</p>",
    "sets": {
      "Standard": {
        "description": "<h4>Set Description</h4> <p>Hypnosis is necessary to facilitate Gengar’s role as a sleep inducer. Thunderbolt is Gengar’s primary attack, allowing it to put immense pressure on the Water-types of the tier. Explosion, despite coming off of a poor base 65 Attack stat, still manages to let Gengar remove or cripple threatening foes. It is used to break physically frail Pokemon, such as Jynx and Alakazam, who are usually OHKOed, as well as Chansey with prior chip damage. It can also gain momentum on slower threats such as Snorlax, Exeggutor, and Slowbro, as Snorlax and Slowbro cannot set up or Rest off damage if Gengar uses Explosion, instantly ending the turn. The remaining move is mostly a choice between Ice Punch and Night Shade. Ice Punch can flip matchups against Rhydon and Zapdos while scaring Exeggutor with a 2HKO if one hit is a critical hit or with Ice Punch followed by Explosion, and Ice Punch also threatens to freeze most switch-ins. Night Shade deals consistent damage to everything, mainly hitting Alakazam, which takes minimal damage from Gengar's other moves.</p> <p>Gengar’s unreliability in securing sleep makes a second sleeper strongly recommended, with Sing Chansey and Exeggutor as the most common partners. Gengar can also pair alongside a Snorlax with Lovely Kiss and use Explosion, then Snorlax can put something to sleep after the opponent has sacrificed their sleeping Pokemon. Gengar is most commonly run as a lead. If it can land Hypnosis, it can then be used to pressure Water-types and wall Physical Attackers lacking Earthquake, or it can be used as a sacrifice to the opposing sleep inducer. If Gengar cannot put something to sleep before being forced out, the backup sleep inducer can try to induce sleep later. Gengar's best opportunity to switch in to try to land Hypnosis is against Snorlax. It can either try to switch into an expected Body Slam or against a Snorlax confirmed to not be carrying Earthquake, which is more common than in OU. It can also switch into non-Amnesia Persian variants after a teammate has been put to sleep and get more chances at securing sleep.</p> <p>Psychic is a possible other option for Gengar's moveset as a strong Thunderbolt alternative with the ability to fish for Special drops. It 3HKOes opposing Gengar while hitting Chansey and Snorlax harder, but this leaves Gengar walled by Starmie and Alakazam. Confuse Ray can be used to prevent Chansey from healing and to generally increase the opportunities for luck. Counter can be used to catch switches if Gengar is brought in against something it forces out—for example, Gengar can utilize Counter's damage storing mechanics after a strong Normal-type hit or Explosion KO to inflict massive damage.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 605413, "username": "Tree69420"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 400664, "username": "Stories"}, {"user_id": 491544, "username": "Shellnuts"}, {"user_id": 583793, "username": "Sabelette"}]}, {"name": "Grammar checked by", "members": [{"user_id": 583793, "username": "Sabelette"}]}]}
  },
  "Hypno": {"sets": {"Amnesia": {}}},
  "Kingler": {"sets": {"Swords Dance": {}}},
  "Exeggutor": {"sets": {"Standard": {}}},
  "Rhydon": {"sets": {"Standard": {}}},
  "Chansey": {"sets": {"Reflect": {}, "BoltBeam": {}, "Counter": {}}},
  "Seaking": {
    "overview": "<p>With the addition of Swords Dance into its movepool, Seaking manages to function as a competent setup sweeper. With STAB Surf as an added bonus, it also blasts through common Hyper Beam switch-ins, such as Rhydon. Agility distinguishes Seaking from its competing Swords Dance users, as, even when paralyzed, it still poses a threat to sweep if the opposing team has been damaged. Once set up, Seaking can be a difficult Pokemon to stop, KOing frailer Pokemon such as Persian and Jolteon from over 75% HP with Hyper Beam. Seaking is decently sturdy as well, surviving two hits from Starmie's Thunderbolt and Alakazam's Thunder Punch a significant majority of the time, giving it more opportunities to set up than Kingler.</p> <p>However, Seaking has to use both Swords Dance and Agility to pose any threat to the opposition. With only Surf and a single physical attack in its attacking moveset due to this—most likely Hyper Beam or the middling Double-Edge—Seaking is not surpassingly rewarding either, struggling to break through bulky Pokemon like Reflect Chansey. It's also completely incapable of breaking through the common Gengar and is struck with Thunderbolt in return; the improved coverage of staples like Thunder Punch for Alakazam and Hypno does not help its case either. Seaking is rarely seen in Tradebacks OU by account of its committal nature and unexceptional reward, normally finding itself competing with Kingler, which, while lacking Agility, has far better damage output for the effort put in.</p>",
    "sets": {
      "Double Dance": {
        "description": "<p>Swords Dance raises Seaking's Attack to acceptable levels, letting Hyper Beam land guaranteed OHKOs against Jynx and Alakazam, while Agility allows it to outrun the unboosted metagame and ignore the Speed drop from paralysis. A +2 Hyper Beam can also KO Pokemon such as Persian, Rapidash, Chansey, Jolteon, and Hypno if around 20% damage has been dealt prior. At +4, Seaking can OHKO Chansey, Hypno, Starmie, and even Tauros a third of the time. Surf covers Rock-types such as Rhydon, as well as dealing around 25% to Gengar, while also serving as an attack without a drawback.</p> <p>Seaking's movepool is barren but does have other options worth exploring; generally, it should always use a Double Dance set, or it's outclassed by Pokemon like Kingler. Blizzard is a plausible alternative to Surf for the freeze chance and 3HKOing Exeggutor and Zapdos, but the damage is otherwise unimpressive and it fails to OHKO Rhydon. Double-Edge, while having less drawback than Hyper Beam, is weak enough to largely diminish Seaking's threat level once set up. Hydro Pump may seem enticing, but it isn't compatible with the event-only Swords Dance, defeating its purpose.</p> <p>Seaking should commit to boosting only when it is possible to sweep. +4 Attack is needed to OHKO most Pokemon in the tier, and +2 Speed is needed to avoid being revenge killed by faster unparalyzed Pokemon. This amount of setup is daunting, but achievable. Seaking's bulk can withstand two hits from almost everything besides Razor Leaf or very strong Thunderbolts. Taking paralysis is also normally inconsequential in the process; thanks to its setup-heavy nature, Seaking is efficient as reapplying foes' Speed drops from paralysis if an opposing team has been riddled with it. Once Gengar, Electric-types, and Razor Leaf users are eliminated or confirmed to be absent, and extra-bulky Pokemon like Snorlax have taken a little damage, a single free turn can be all the opening Seaking needs to complete the three turns of setup needed to sweep. Against slower teams, Swords Dance can be all that's necessary to break through slower, bulkier Pokemon in Hypno, Chansey, and non-Reflect Snorlax variants. To achieve optimal conditions for a sweep, Seaking should be paired with consistent sleepers such as Jynx and Exeggutor, and Reflect Snorlax to check opposing Snorlax. Seaking is overwhelmed by Gengar, Zapdos, Jolteon, and Electabuzz, so Jolteon can be a helpful partner to safely switch into their attacks, while Seaking in turn can check Ground-types like Rhydon in a pinch for Jolteon. Rhydon, Chansey, and Alakazam can also check these Pokemon by comfortably switching into Thunderbolt, though, depending on the coverage of those Seaking checks, these partners might struggle to consistently switch in.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 236353, "username": "Plague von Karma"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 233818, "username": "Enigami"}, {"user_id": 43049, "username": "Torchic"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}]}
  },
  "Starmie": {"sets": {"Standard": {}}},
  "Mr. Mime": {"sets": {"Hypnosis": {}}},
  "Jynx": {
    "overview": "<p>Jynx's role remains virtually unchanged from its job in standard OU play—using Lovely Kiss on Psychic-type leads, absorbing or blocking sleep for its own team, and fishing for a freeze if given the chance. What changes, however, is the relevance of that role. Jynx remains just as capable at inducing sleep, but teams that utilize sleep-inducing physical attackers make it much harder for Jynx to absorb sleep. Jynx's horrendous physical bulk lets Pokemon like Persian and Snorlax pulverize it after Jynx is paralyzed, preventing it from being an effective sleep blocker. Jynx also struggles to remove paralysis via Rest against these teams, as using it allows every physical attacker free entry. This essentially means that against teams that employ physical sleep inducers, Jynx's only use will be to induce sleep early and to potentially annoy Pokemon like Chansey, without ever getting the chance to block or absorb sleep for its teammates. Jynx also performs horribly against sleep leads that outspeed it, such as Gengar and Persian. Hypno also competes with Jynx as a Psychic-type sleep inducer, which trades out accuracy on its sleep move for access to Thunder Wave and Amnesia, which makes it much deadlier later in the game. Fortunately, though, Jynx still manages to perform well against teams that still use traditional methods of inducing sleep, like Sing Chansey or non-Double-Edge Exeggutor. This relegates Jynx to being a more matchup-specific Pokemon rather than one of the most consistent leads in the tier.</p>",
    "sets": {
      "Sleep Lead": {
        "description": "<p>Jynx is still the fastest Pokemon with access to a 75% accurate sleep move, despite the new sleep inducers added in Tradebacks. This makes Lovely Kiss completely mandatory for Jynx to have any relevant niche. STAB Blizzard is incredibly powerful, usually forcing Alakazam to use Recover if it switches in on it and dealing significant damage to most other Pokemon, notably OHKOing Rhydon and 2HKOing Exeggutor, Zapdos, and Persian. Ice Beam can be used for a marginal increase in odds to freeze the opponent, but the decrease in power is very noticeable in nearly every matchup. Psychic is a good tool to hit Pokemon that would normally resist Jynx's Ice-type STAB, like Cloyster and Vaporeon, as well as to fish for Special drops on paralyzed Pokemon. The last slot is the most flexible, but Jynx generally wants to run Rest. While the potential risk for using it is increased, its still just as good against teams with traditional sleep inducers.</p> <p>Unlike most other Pokemon, Jynx gains almost nothing of significance in its Tradebacks moveset. The only somewhat relevant new option is Petal Dance, which can allow Jynx to 3HKO Starmie 60% of the time. With a critical hit, Jynx can potentially eviscerate a Starmie expecting a free switch in. However, Jynx will be locked into Petal Dance for 3-4 turns, meaning that if Petal Dance doesn't get the KO, Jynx becomes a sitting duck. Beyond that, Jynx can use Counter to improve its matchup against Normal-types and to deal a chunk of damage to special walls as Normal-types switch out. It can also use Seismic Toss to deal consistent damage to Slowbro and Starmie, both of which resist its STAB options.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 593464, "username": "Teh"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 583793, "username": "Sabelette"}]}, {"name": "Grammar checked by", "members": [{"user_id": 583793, "username": "Sabelette"}]}]}
  },
  "Electabuzz": {"sets": {"Offensive": {}}},
  "Tauros": {"sets": {"The Bull": {}}},
  "Gyarados": {"sets": {"Standard": {}}},
  "Lapras": {"sets": {"Standard": {}}},
  "Vaporeon": {
    "overview": "<p>Vaporeon finds a niche in Tradebacks OU as it gains Growth, which allows it to boost its already high Special even higher. Once boosted, Surf mows down most foes with little issue, 2HKOing foes such as Tauros and Persian at +1 and 2HKOing even bulky foes such as Snorlax and Zapdos at +2. This, combined with Acid Armor to patch up its lacking base 60 Defense, lets Vaporeon be a great wall not only specially, but also physically; at just +2 Defense, Snorlax's Body Slam becomes a 6HKO. Vaporeon has much higher base Special compared to the other notable Water-type setup sweeper, Slowbro, dealing good damage with Surf even without any Growth boosts. Vaporeon's higher base Special also allows it to tank special hits much easier; Starmie or Chansey only 4HKO with Thunderbolt. This higher base Special also allows Vaporeon to live a critical hit Thunderbolt from Starmie and Chansey with relative ease, taking just 63.4% maximum from a Starmie Thunderbolt critical hit. Vaporeon's large amount of boosting moves also lets it reapply a paralyzed foe's Speed drop up to nine times, while Slowbro can only reapply a paralyzed foe's Speed drop three times.</p> <p>However, Vaporeon is in stark competition with Slowbro for the role of bulky Water-type, and Slowbro has Amnesia, better physical bulk, and Thunder Wave. Vaporeon also shares Slowbro's issues of having to rely on Rest for recovery and takes a lot more turns than Slowbro to set up, making it quite exploitable. However, once Vaporeon gets the ball rolling, it's hard to stop it, with a +5 Surf mowing over even Water-resistant foes. It also can tank one critical hit Thunderbolt from Starmie, Chansey, or Gengar, which Slowbro can't do due to its worse special bulk. Vaporeon is also noticeably faster than Slowbro, outspeeding the likes of Snorlax, Chansey, Exeggutor, and Rhydon, although it's still not fast enough to outspeed most common foes.</p>",
    "sets": {
      "Growth": {
        "description": "<h4>Set Description</h4> <p>Growth raises Vaporeon's Special even higher, allowing it to increase its special bulk and the power of its STAB Surf. Surf 2HKOes Tauros, Persian, and often Jolteon at +1, though bulkier foes, such as Snorlax, Zapdos, and Hypno require two Growth boosts to 2HKO. Acid Armor lets Vaporeon boost up its measly base 60 Defense, taking paltry damage at +2 from even the strongest physical attacks; it's 6HKOed at +2 by Snorlax's Body Slam, and 7HKOed by Tauros's Body Slam, allowing Vaporeon to shrug off the damage and use Rest with ease, although Tauros's high critical hit rate makes using Rest in front of it risky, as Vaporeon takes 52.9% minimum from a critical hit Body Slam. Acid Armor also has 61PP, which, in combination with Growth, gives Vaporeon a staggering 122PP at its disposal without cutting into Surf and Rest PP, letting it PP stall any foe with ease. Rest lets Vaporeon heal off any stray hits it may take while setting up. Acid Armor can be dropped within reason, as it isn't always needed for Vaporeon to be an effective sweeper. Ice Beam hits Grass and Flying-types for super effective damage, and at +1 Vaporeon is heavily favored to 2HKO Zapdos and Exeggutor. Body Slam allows Vaporeon to paralyze non-Normal-types, but it deals very little damage. Hydro Pump hits much harder than Surf, notably 2HKOing Tauros and Persian unboosted and 2HKOing Snorlax, Alakazam, and Gengar at +1. However, it's often unreliable due to its low accuracy and PP. Substitute can be used to protect Vaporeon from stray critical hits and grant safety when using Rest, as a +1 Vaporeon's Substitute is not broken by Starmie or Chansey's Thunderbolt; Gengar's Thunderbolt is also not favored to break it.</p> <p>Vaporeon should be used on a team with good paralysis support, as it lacks any meaningful way to paralyze Starmie, Alakazam, and Chansey, which might otherwise pose issues to it. Vaporeon can also use Growth and Acid Armor to reapply the speed drop from paralysis, letting it outspeed a paralyzed Starmie or Alakazam even if paralyzed itself. Vaporeon needs physical attacking support to help break through special walls like Chansey and Starmie, so it benefits from partners like a Lovely Kiss or all-out attacking Snorlax, as well as Explosion users such as Exeggutor and Golem, as they can neutralize foes that may cause Vaporeon issues with Explosion or status.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 625260, "username": "NotVeryCake"}, {"user_id": 520967, "username": "pac"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 583793, "username": "Sabelette"}]}, {"name": "Grammar checked by", "members": [{"user_id": 583793, "username": "Sabelette"}]}]}
  },
  "Jolteon": {
    "overview": "<p>Jolteon stands out as one of the few Pokemon able to stop Zapdos's rampage, resisting its STAB moves while having the capacity to beat it one-on-one. Tradebacks gifts it Growth, making it a threatening setup sweeper as well. Otherwise, Jolteon remains largely the same: having the highest Speed just behind Electrode also gives it one of the highest critical hit rates in the game, standing at 25.39%, which distinguishes it as a strong special attacker. Crucially, this means it outruns tier king Tauros while threatening it with Thunder Wave, a trait shared with only Alakazam, Starmie, and the unviable Electrode. Thus, Jolteon will frequently get off uncontested paralysis that forces predictable plays out of the opponent, taking back momentum very quickly. Finally, Jolteon possesses useful physical coverage in Double Kick and Pin Missile, which gives it the potential to specialize in the matchup against Chansey or Exeggutor.</p> <p>However, much like Zapdos, Jolteon is also countered by Rhydon, which means teams featuring Jolteon will often come across similar weaknesses. Being weak to Ground also doesn't bode well for it, as it means Pokemon like Tauros can exploit it if it gets paralyzed, which frequently happens in the matchups Jolteon comes across. Jolteon is frail in general, taking significant damage from Body Slam. Its damage output outside of Thunderbolt is also quite meager and reliant on its critical hit rate, which makes Jolteon quite inconsistent. While Growth is a useful tool that can patch up Jolteon's power issues, it gives Jolteon four-moveslot syndrome, as it's forced to drop Rest and forfeit its ability to be a Zapdos answer as well as making it deathly afraid of Thunder Wave.</p>",
    "comments": "<h3>Other Options</h3> <p>Rest or Growth is usually Jolteon's most expendable move, though this forfeits either a consistent Chansey matchup or sweeping potential. Pin Missile is an inconsistent option to cover Exeggutor, but a lack of STAB, bad accuracy, and high damage variance mean that it can often fail and lead to a paralyzed or KOed Jolteon. If leading Jolteon, Pin Missile is recommended to ensure it doesn't let Exeggutor in early. Agility can be used to ignore the Speed drop from paralysis, but using Rest and switching out usually does the job fine in conventional game states. Body Slam helps Jolteon more consistently contest Exeggutor while spreading paralysis and damage at once, but its damage is pitiful. Thunder is a niche option to use alongside Thunderbolt, and it can OHKO Cloyster and 2HKO Alakazam and Snorlax at +1, but its unreliable accuracy makes it dubious.</p> <h3>Checks and Counters</h3> <p><strong>Exeggutor</strong>: Exeggutor dislikes facing Pin Missile, but without it, Jolteon can't fight Exeggutor at all, as it resists Thunderbolt and Double Kick. In return, Exeggutor can threaten Jolteon with STAB Psychic, Sleep Powder, and Stun Spore.</p> <p><strong>Rhydon</strong>: A Rhydon at full HP is the bane of Jolteon's existence, threatening an OHKO with Earthquake. However, Rhydon can't switch in repeatedly, as Double Kick deals 15.4% minimum and up to 33.8% on a critical hit. Once Rhydon is below half HP it is very uncomfortable having to switch in again.</p> <p><strong>Snorlax</strong>: Snorlax is a strong check to Jolteon if its running Earthquake, which 2HKOes, and even Body Slam threatens Jolteon with a 3HKO and paralysis. In return, unboosted Jolteon can only 4HKO Snorlax without critical hits. At +1 Jolteon falls just short of 2HKOing Snorlax from full, but it has decent odds of breaking through when factoring critical hits, and it can consistently beat Snorlax if it's under 90% HP.</p> <p><strong>Paralysis</strong>: Jolteon is a fragile, fast Pokemon, which makes it one of the Pokemon most debilitated by paralysis. Rest can remove the status, but Jolteon still needs to switch out to remove the Speed drop. Pokemon like Alakazam, Chansey, Zapdos, and Stun Spore Exeggutor all force non-Rest Jolteon out and majorly inconvenience Rest Jolteon. Starmie and Slowbro can also threaten paralysis if they're healthy and Jolteon hasn't set up Growth yet. However, Growth Jolteon can stay faster than its foes by reapplying the paralysis Speed drop.</p>",
    "sets": {
      "Standard": {
        "description": "<h4>Set Description</h4> <p>Thunderbolt is Jolteon's bread-and-butter, 2HKOing Pokemon like Cloyster, Starmie, Slowbro, and Lapras. Double Kick primarily targets Chansey, 4HKOing it; Jolteon is favored to break through with critical hits and it will eventually PP stall Soft-Boiled. Double Kick also targets Rhydon, chipping it moderately on entry and essentially preventing it from switching in when below 50% HP due to the risk of a critical hit. Thunder Wave lets Jolteon threaten Pokemon like Tauros and Persian, forcing them out and setting up a sweep for its teammates. Rest lets it consistently counter Zapdos and gives it a long-term advantage against Chansey. Chansey struggles to beat Jolteon even with Seismic Toss because two critical hits or repeated full paralysis are all Jolteon needs to beat it with Double Kick. However, Jolteon tends to let Tauros and other heavy hitters in once it uses Rest, so Jolteon requires careful play and use of double switches to prevent free entry for these threats. An alternative over Rest is Growth, which lets Jolteon assume the role of a setup sweeper. At +1, Jolteon 2HKOes foes like Persian and Tauros and OHKOes Water-types. However, this means losing out on Rest, which forfeits Jolteon's ability to switch into Zapdos and Chansey.</p> <p>If running Rest, Jolteon can remain hidden until either Zapdos reveals itself or a need to break through Chansey emerges. Jolteon finds entry routes on Zapdos and Chansey quite easily, particularly when they are disincentivized to click Thunder Wave, and it otherwise doesn't mind coming in via double switches. Alternatively, Jolteon can be used as a lead, aiming to paralyze whatever is in front of it and force the opponent to make a difficult decision out of the gate. This is especially effective support to physically attacking sleepers like Lovely Kiss Snorlax, as they greatly appreciate paralysis on Psychic-types and Chansey. However, Jolteon dislikes getting paralyzed early itself, and sleep leads can potentially disable it for the rest of the game. Rest Jolteon is best used on teams that are weak to Zapdos, namely those that stack Water-types. Thus, Cloyster, Starmie, and Slowbro all make valid partners. In return, they help stifle Rhydon's attempts to stop Jolteon. If running Growth, Jolteon shouldn't be used as a switch-in to Zapdos and Chansey and should reveal itself when a sweeping route has been established. Given that Chansey, Exeggutor, and Alakazam all pose issues for Jolteon, it enjoys support from sleepers like Lovely Kiss Snorlax, especially if it's running Growth. Exeggutor is also an excellent partner to Jolteon, being one of the most consistent Rhydon switch-ins in the game while also helping to break through the opposing team with Sleep Powder and Explosion.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 236353, "username": "Plague von Karma"}, {"user_id": 535530, "username": "Gangsta Spongebob"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 43049, "username": "Torchic"}, {"user_id": 583793, "username": "Sabelette"}, {"user_id": 491544, "username": "Shellnuts"}]}, {"name": "Grammar checked by", "members": [{"user_id": 583793, "username": "Sabelette"}]}]}
  },
  "Porygon": {"sets": {"Bulky Support": {}}},
  "Aerodactyl": {"sets": {"Mixed Attacker": {}}},
  "Snorlax": {
    "overview": "<p>Snorlax is the single most centralizing and defining Pokemon in the tier; the addition of a reliable sleep move to its already wide movepool pushes it to even further heights than before, as nothing can reliably block its Lovely Kiss with paralysis. Nothing switches into Snorlax with complete safety; even Pokemon that resist or are immune to its STAB moves, such as Rhydon and Gengar, are at the mercy of one of its many coverage moves. Snorlax is also incredibly bulky, being one of the few Pokemon that can take a hit from the likes of Tauros and Starmie and hit back even harder with a powerful STAB Body Slam or Hyper Beam; it can also use its STAB Self-Destruct, which demolishes non-resistant foes. Snorlax is on nearly every single serious team and cannot afford to be dropped.</p> <p>However, Snorlax has an abysmal base 30 Speed, tying it with Slowbro for slowest Pokemon in the tier. Its reliance on Rest for recovery makes it exploitable and easily forced out by Pokemon with high critical hit rates such as Alakazam, Starmie, and Tauros. This poor base Speed also saddles Snorlax with a measly 5.86% critical hit rate. That isn't Snorlax's only issue though, as while it has many different options to cover a wide array of matchups, it has to either give up longevity or coverage to do so, meaning there is always something to exploit no matter what set Snorlax runs.</p>",
    "comments": "<h3>Other Options</h3> <p>Ice Punch can be used over Ice Beam on Amnesia sets, as it has more PP, which allows Snorlax to stick around for even longer and take more chances to attempt to freeze a foe; however, it is weaker than Ice Beam. Ice Punch can also be used on Reflect sets, as it can freeze opposing Reflect Snorlax and Reflect Chansey and also 3HKOes Rhydon; however, it does negligible damage to even neutral targets. A set consisting of three attacks + Rest can be used to give Snorlax the extra utility of a third attacking move over Reflect while still being able to last longer, but it is difficult to wake Snorlax up without Reflect, as many Pokemon threaten to KO it while it's asleep. A set consisting of two attacks, Lovely Kiss, and Rest can also be used to let Snorlax threaten sleep and preserve itself without falling short in the coverage department. Thunderbolt can be used on Amnesia sets, with a +4 Thunderbolt OHKOing Cloyster and being favored to OHKO Starmie. However, it's generally preferred to run another move, as it doesn't do much else; Body Slam, Self-Destruct, and Snorlax's various utility options all tend to be more useful. Thunderbolt can also replace Amnesia Snorlax's Ice-type move, as Amnesia Snorlax doesn't need the Ice-type coverage to have a decent matchup against most foes. However, this is generally inadvisable, since Snorlax is then walled by Rhydon and Golem. Amnesia can be used in conjunction with Reflect to wall foes both physically and specially. However, this leaves Snorlax with only one attacking move. Headbutt can be used against paralyzed foes to attempt to paraflinch them, but it is unreliable and weaker than Body Slam.</p> <h3>Checks and Counters</h3> <p><strong>Snorlax</strong>: Snorlax is on every competitive team, meaning it will usually end up facing itself. The most important factor in the matchup is whether Sleep Clause has been activated for either side, as Lovely Kiss Snorlax threatens to instantly remove its opposition. A paralyzed Lovely Kiss Snorlax can switch into a Snorlax using Lovely Kiss to deny sleep and threaten it in return. If neither Snorlax threatens Lovely Kiss, Reflect Snorlax can switch into offensive Snorlax sets bar Amnesia and beat them quite comfortably when healthy. If Reflect Snorlax is paralyzed, it struggles to consistently switch into opposing Snorlax, as the chance to lose a turn to full paralysis can cost the game. Amnesia Snorlax can catch a Reflect Snorlax off-guard (RH) and threaten it with boosted special attacks.</p> <p><strong>Cloyster</strong>: Cloyster switches into Snorlax's Body Slam relatively safely thanks to its staggering base 180 Defense; it also walls most variants of Amnesia Snorlax thanks to its 4x resistance to Ice. Cloyster is also able to tank Snorlax's Self-Destruct decently, as it only does 75.5% maximum. Cloyster 4HKOes Snorlax with Blizzard and can chip it with Clamp. Cloyster can also use Explosion on Snorlax if it's weakened to put Snorlax into KO range of a revenge killer, doing 60% minimum. However, Cloyster must be wary of Lovely Kiss as well as Body Slam paralysis. Cloyster is particularly wary of Hyper Beam Snorlax, as if it is paralyzed by Body Slam, it is at serious risk of being put into Hyper Beam's KO range.</p> <p><strong>Slowbro</strong>: Slowbro switches into Snorlax's Body Slam with relative ease, as it is 4HKOed most of the time and threatens Snorlax with paralysis and Amnesia-boosted Surf. Slowbro can also set up Reflect to become even better at tanking Snorlax's hits. However, Slowbro can quickly get worn down into Hyper Beam's KO range and fears Lovely Kiss.</p> <p><strong>Special Attackers</strong>: While there aren't many special attackers that enjoy taking a Body Slam, many special attackers, such as Alakazam, Starmie, Exeggutor, and Zapdos, can 3HKO Snorlax with their STAB attacks, applying significant pressure. This is especially true if Snorlax has used Rest, often forcing it out while it's still asleep.</p> <p><strong>Gengar</strong>: Gengar walls non-Amnesia Snorlax without Earthquake, although Gengar risks getting frozen if Snorlax has an Ice-type move. Gengar is a great Lovely Kiss absorber, as even if it's asleep, it can freely attempt to wake up in front of Snorlax without Earthquake.</p> <p><strong>Porygon</strong>: The passive and unassuming Porygon finds a niche in completely stonewalling non-Amnesia variants of Snorlax once Sleep Clause is activated, as it is 3HKOed by Body Slam and stalls Snorlax out of attacking PP with Recover. Snorlax can OHKO it with Self-Destruct, but trading Snorlax for Porygon is an awful trade for the Snorlax user in most circumstances. Even if Sleep Clause is not activated, Porygon's generally low value makes it a good choice to absorb sleep.</p> <p><strong>Chansey</strong>: Unparalyzed Chansey switches into Snorlax and sets up Reflect once Sleep Clause is active, while Counter Chansey can OHKO Snorlax by correctly predicting Body Slam. If Chansey is paralyzed, it finds it much harder to reliably check Snorlax, as unparalyzed Snorlax now outspeeds it, and the full paralysis chance makes it unreliable even against paralyzed Snorlax. Once it's paralyzed, Chansey is also extremely susceptible to Hyper Beam, even if Snorlax is paralyzed. Snorlax can also choose to use Self-Destruct to OHKO Chansey without Reflect set up to enable its special attacking teammates.</p> <p><strong>Rock-types</strong>: Rock-types wall Snorlax lacking coverage, as they take negligible damage from Snorlax's STAB attacks. Rock-types without Rest are, however, prone to getting worn down over time and hamstrung by Body Slam paralysis.</p> <p><strong>Persian</strong>: Persian can switch into a Snorlax that has used Rest and put it under major pressure, as two Slashes followed by either a critical hit Body Slam or Body Slam and another Slash KO Snorlax. Persian can also threaten Snorlax and its teammates with Hypnosis.</p>",
    "sets": {
      "Offensive Sleeper": {
        "description": "<h4>Set Description</h4> <p>This is the defining set of RBY Tradebacks, combining utility and raw power in a way that completely restructures the rest of the metagame. With just two moves, Body Slam and Lovely Kiss, Snorlax exerts a tremendous amount of pressure on the opposing team the moment it hits the field, threatening to deal significant damage to most of the tier and incapacitating anything that attempts to check it with Lovely Kiss before continuing on its rampage. Earthquake is Snorlax’s best coverage option, dealing heavy damage to Rhydon and Gengar—two of the few Pokemon not threatened by its Body Slam—and allowing Snorlax to scout for Counter on Chansey and opposing Snorlax while still doing serviceable damage. Hyper Beam is the other common choice, allowing Snorlax to threaten KOs against many common Pokemon, such as Chansey, Persian, Tauros, Exeggutor, and Hypno, after only one or two hits. Self-Destruct rounds out this moveset, allowing Snorlax to threaten extreme damage while low on health or when its team needs it to force immediate progress. It OHKOes physically frail foes such as Chansey, Starmie, and Alakazam and does heavy damage to even physically bulky threats, doing a minimum of 72.2% to Slowbro and 64% to Cloyster. However, Snorlax is usually forced to use Self-Destruct rather early due to its awful base Speed.</p> <p>This set single-handedly influences the tier in numerous ways, making the tier faster paced compared to standard OU. With this Snorlax set, it is far less risky for teams to focus on spreading paralysis early, since its physical moves let it reliably push sleep past common sleep blockers, such as Alakazam, Chansey, and Starmie This set makes Snorlax extremely difficult to check because it can rely on allies to paralyze physically frail foes, and it can then put the physically defensive foes that would otherwise withstand its attacks to sleep. After Snorlax has put a foe to sleep, it still is extremely threatening and can continue battering away at the enemy team due to its raw damage output.</p> <p>Despite these upsides, this Snorlax set requires team support due to its lack of defensive utility. Without any form of recovery, Snorlax is not able to reliably switch into physical attackers throughout the game, necessitating it be paired with teammates such as Starmie and Cloyster, which can help cover these roles traditionally filled by Snorlax. This set’s lack of recovery also makes Snorlax vulnerable to getting worn down, as it is often forced to take a hit before it can land an attack or Lovely Kiss due to its poor base Speed. Snorlax benefits greatly from teammates that can spread paralysis, such as Chansey, Alakazam, Starmie, Zapdos, and Exeggutor, which alleviate some of this pressure. This Snorlax set also works well on fast-paced hyper offensive teams that attempt to mow down the foe with multiple Explosion users.</p>"
      },
      "Mixed Attacker (Amnesia)": {
        "description": "<h4>Set Description</h4> <p>Amnesia can not only let Snorlax perform as a threatening mixed attacker, but it can also give it a decent defensive profile depending on the moves it uses, allowing it to either play the role of wallbreaker or a less immediately threatening but longer-lasting mixed attacker. The offensive variant uses Blizzard and either Lovely Kiss or Self-Destruct to mow down foes quickly. +2 Blizzard OHKOes Rhydon and Golem, 2HKOes Zapdos, Persian, and Exeggutor, and has a 76.2% chance to 2HKO Tauros. It also 3HKOes Gengar and opposing Snorlax, which allows it to break through opposing Reflect Snorlax. Lovely Kiss allows Snorlax to put a foe it might otherwise struggle against, such as Cloyster or Starmie, to sleep; it also gives Snorlax a good opportunity to set up Amnesia, which it may otherwise struggle to do. Self-Destruct lets it KO or heavily damage a foe once it has been worn down, and it also gives Snorlax a good way to free itself from dire situations. The more defensive variant forgoes Blizzard for Ice Beam and runs Rest in place of Lovely Kiss or Self-Destruct. Ice Beam is much weaker than Blizzard; at +2 it 3HKOes Tauros, Exeggutor, and Zapdos and 4HKOes opposing Snorlax, but it allows Snorlax to stick around for longer and attempt to freeze a foe.</p> <p>Amnesia Snorlax requires paralysis support to make significant progress for its team, as foes such as Chansey and Starmie may thwart it if they are left unparalyzed. Body Slam is also usually not sufficient enough to handle a healthy Cloyster. Offensive Amnesia Snorlax should try to switch in on either a Pokemon using a recovery move or an attack that will deal minimal damage, as it needs to be at or near full HP to pressure the opposing team. Defensive Amnesia Snorlax should attempt to do the same, but it can afford to switch into a stray special attack from the likes of a paralyzed Starmie or Exeggutor if need be. The defensive set can also attempt to get past the likes of Starmie and Reflect Chansey by freezing them.</p>"
      },
      "Reflect": {
        "description": "<h4>Set Description</h4> <p>Reflect lets Snorlax take full advantage of its good physical bulk, allowing it to shrug off hits from the likes of Tauros, Rhydon, and opposing Snorlax while still being offensively threatening itself. The fourth move on Reflect sets can change depending on what coverage is required for Snorlax's team. Earthquake 2HKOes Gengar and Jolteon, 3HKOes Rhydon, and scouts for Counter on Chansey and opposing Snorlax, although it lacks the offensive power of Hyper Beam or Self-Destruct. Hyper Beam is Snorlax's best move against chipped foes; it also allows it to feasibly beat Cloyster and Slowbro one-on-one, but Hyper Beam leaves Snorlax walled by Rock-types and Gengar and has a limited amount of PP. Self-Destruct allows Snorlax to remove or heavily damage a foe after it has fulfilled its role as a wall. It is also a good option to KO a foe in an emergency, and it makes Reflect Snorlax less reliant on its teammates to force progress, although it shares similar issues to Hyper Beam. Lovely Kiss allows Reflect Snorlax to push sleep past paralyzed Chansey, Alakazam, and Starmie to remove foes it may have trouble breaking otherwise, such as Cloyster. However, it leaves Snorlax with only Body Slam as an attacking move, giving it limited PP to threaten things and leaving it walled by Rock-types and Gengar.</p> <p>Reflect allows Snorlax to be a durable check to the tier's best physically offensive threats. Reflect is crucial to Snorlax's longevity, as it allows it to reliably use Rest to heal off damage and paralysis; without Reflect, Snorlax's bulk is not good enough to reliably wake up. Reflect Snorlax is one of the tier's best switch-ins to most opposing Snorlax sets if an ally has already been put to sleep. It's also a decent switch-in to Tauros, though Tauros's high critical hit rate makes any switch-in somewhat unsafe. Snorlax has to utilize its HP carefully to balance its role as an offensive powerhouse with its use as a durable physical tank that can last throughout the game. While it doesn't love getting paralyzed, it is much more willing to take it than sets lacking Rest, as it can reliably cure itself at a later point in the game; Snorlax also still pressures the vast majority of the tier even when it's paralyzed.</p>"
      },
      "PhysLax (All-Out Attacker)": {
        "description": "<h4>Set Description</h4> <p>Snorlax's good bulk and amazing Attack allow it to function well as an all-out physical attacker, being able to go one-on-one against nearly every single foe with the combination of Body Slam, Hyper Beam, Earthquake, and Self-Destruct. Hyper Beam threatens KOs against many common threats after only one or two hits, such as Chansey, Persian, Tauros, Exeggutor, and Hypno. Earthquake is Snorlax’s best coverage option, threatening heavy damage on Rock-types and Gengar, which aren't threatened by its STAB moves. Earthquake also has the advantage of being able to scout for Counter on Chansey and opposing Snorlax, with Earthquake still putting Chansey into Hyper Beam KO range. Earthquake or Hyper Beam can be dropped in favor of Counter to catch opposing Snorlax and Tauros off guard—landing Counter against Tauros's Body Slam leaves it in Hyper Beam range, and landing Counter on opposing Snorlax's Body Slam deals at least 48.4% to it. Once Snorlax is low on HP, it can use Self-Destruct to punch another hole in the opposing team; physically frail threats such as Chansey, Starmie, and Alakazam are OHKOed and even physically bulky threats such as Cloyster and Slowbro take heavy damage.</p> <p>PhysLax, much like Lovely Kiss Snorlax, is on a timer to get things done due to its lack of recovery and poor Speed. It also needs to play around the threat of paralysis, losing much of its offensive pressure and struggling to break many foes without using Self-Destruct if it takes paralysis. PhysLax can be used on teams that already have a reliable sleeper, such as Exeggutor or Jynx, that also want the extra utility of an additional attack. To make full use of PhysLax, it's vital to know when to preserve it and when to sacrifice it with Self-Destruct; it usually wants to use Self-Destruct when it's either backed into a corner or relatively low on HP. This Snorlax set greatly enjoys heavy paralysis support, so Pokemon such as Starmie, Chansey, and Exeggutor make great teammates to it. This set also pairs well with other Explosion users, such as Exeggutor and Golem, on fast-paced hyper offense teams that aim to overwhelm the opponent. Starmie and Cloyster make good partners to this set, as it lacks defensive utility; without recovery, Snorlax is not able to reliably switch into physical attackers throughout the game, which Starmie and Cloyster can do well in Snorlax's place. This set’s lack of recovery also makes it prone to getting worn down quickly and being forced to use Self-Destruct quite early, as it is often forced to take a hit before it can land an attack due to its poor base Speed.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 625260, "username": "NotVeryCake"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 491544, "username": "Shellnuts"}, {"user_id": 540559, "username": "gastlies"}, {"user_id": 583793, "username": "Sabelette"}]}, {"name": "Grammar checked by", "members": [{"user_id": 649096, "username": "a blue banana"}, {"user_id": 555379, "username": "Tbolt"}, {"user_id": 583793, "username": "Sabelette"}]}]}
  },
  "Articuno": {"sets": {"Sweeper": {}}},
  "Zapdos": {"sets": {"Agility": {}}},
  "Moltres": {"sets": {"AgiliSpin": {}}},
  "Dragonite": {"sets": {"Wrap": {}}}
}