{
  "Clefable": {"sets": {"STABmons": {}}},
  "Persian": {"sets": {"STABmons": {}}},
  "Poliwrath": {"sets": {"STABmons": {}}},
  "Alakazam": {"sets": {"STABmons": {}}},
  "Tentacruel": {"sets": {"STABmons": {}}},
  "Golem": {"sets": {"STABmons": {}}},
  "Dodrio": {"sets": {"STABmons": {}}},
  "Cloyster": {"sets": {"STABmons": {}}},
  "Haunter": {
    "overview": "<p>Despite Haunter being inferior to its evolution, Gengar, in every meaningful way, it holds the smallest of niches thanks to their shared Ghost typing. Haunter can switch into Explosion freely and wall attackers that only use Normal-type attacks. Gengar is better at this, but having Haunter as a backup lets players use Gengar more aggressively and bait and punish an Explosion after Gengar faints. However, most of the time teams don't want two Pokemon that perform essentially the same role and vastly prefer just keeping Gengar around. Additionally, Haunter is very underpowered for STABmons; it struggles to deal meaningful damage to the metagame's plethora of Normal- and Psychic-types, leaving it as a gimmick.</p>",
    "sets": {
      "Backup Ghost": {
        "description": "<h4>Set Description</h4> <p>Hypnosis lets Haunter put a foe to sleep, circumventing its mediocre power, particularly against slower foes such as Exeggutor and Kangaskhan. Thunderbolt, coming off Haunter's good Special, can threaten Water- and Flying-types, such as Starmie and Aerodactyl. Night Shade threatens consistent damage against foes, notably 4HKOing Exeggutor. Despite Haunter's low Attack, Explosion is its strongest move against most foes, letting it do around 50% to targets like Tauros and Exeggutor.</p> <p>Haunter should always be used alongside Gengar, since Gengar is strictly better. Gengar should always be revealed first, as Haunter being revealed will tell the opponent you have Gengar anyway. With Haunter around, Gengar can be used to switch into Normal-types and use Explosion more comfortably. Once Gengar faints, the opponent may reveal a mono-Normal attacker, letting the player use Haunter to wall it. Many Normal-types, like Slash Tauros, drop Earthquake in favor of Glare to help against faster foes and opposing Normal-types, making Haunter a usable partner to Pokemon like Kangaskhan, Starmie, and one's own Tauros. Haunter can wall Exeggutor if it drops Psychic, letting it support Pokemon such as Starmie and Vaporeon. The opponent will also likely use Explosion less carefully with Gengar out of the picture, letting the player gain a lead if they trick the opponent into sacrificing an important Pokemon like Tauros or Exeggutor for nothing. Haunter struggles heavily against Normal-types that run Earthquake, such as Tauros and Kangaskhan, as well as Psychic-types, such as Starmie, Exeggutor, and especially Alakazam. One's own Tauros, Kangaskhan, Starmie, and Exeggutor can check and trade hits with their opposing counterparts, and Explosion users such as Clefable and Dodrio can remove them as well. Since Haunter and Gengar both run Hypnosis, it is recommended to pressure the opponent to sacrifice their slept Pokemon before sending out Haunter, so that it can put another foe to sleep.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 535530, "username": "Gangsta Spongebob"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 233818, "username": "Enigami"}, {"user_id": 530877, "username": "Volk"}]}, {"name": "Grammar checked by", "members": [{"user_id": 583793, "username": "Sabelette"}]}]}
  },
  "Gengar": {"sets": {"STABmons": {}}},
  "Exeggutor": {"sets": {"STABmons": {}}},
  "Rhydon": {"sets": {"STABmons": {}}},
  "Chansey": {"sets": {"STABmons": {}}},
  "Kangaskhan": {"sets": {"STABmons": {}}},
  "Starmie": {"sets": {"STABmons": {}}},
  "Jynx": {"sets": {"STABmons": {}}},
  "Tauros": {"sets": {"STABmons": {}}},
  "Gyarados": {"sets": {"STABmons": {}}},
  "Vaporeon": {"sets": {"STABmons": {}}},
  "Jolteon": {
    "overview": "<p>Jolteon is a powerful pick in STABmons thanks to its lightning fast base 130 Speed, which lets it get the jump on all relevant threats and gifts it a sky high 25.39% critical hit rate. This is complimented by it gaining powerful new coverage moves in Super Fang and Explosion to make it the fastest relevant Explosion user. It also has access to a powerful STAB Thunderbolt, which 2HKOes the omnipresent Starmie and 3HKOes many other foes, such as Tauros and Kangaskhan. Its ability to spread paralysis with Thunder Wave is nearly unmatched thanks to its Speed. Jolteon also benefits immensely from the decreased relevance of Ground-types in STABmons, as they threaten to wall it.</p> <p>However. Jolteon is held back by its poor physical bulk, being 2HKOed by most common physical attacks, as well as its Explosion being relatively weak, dealing just over 50% to bulkier foes such as Tauros, Clefable, and Kangaskhan. Jolteon tends to get outpaced in damage, as it can only 3HKO most foes with Thunderbolt. The prevalence of paralysis also doesn't do it any favors, as once it becomes paralyzed, it becomes far less threatening and loses its most valuable trait.</p>",
    "comments": "<h3>Other Options</h3> <p>Recover can be used in place of Super Fang or Explosion to attempt to fish for full paralysis against relatively weaker attacks, such as Clefable's Slash and Exeggutor's Razor Leaf. However, this is unreliable, and the situations where Jolteon is better off using Recover than just attacking are extremely niche.</p> <h3>Checks and Counters</h3> <p><strong>Golem and Rhydon</strong>: Golem and Rhydon are immune to Jolteon's Thunderbolt and Thunder Wave and threaten to OHKO it in return with STAB Earthquake. They also absorb its Explosion extremely well. However, they have to be wary of Super Fang putting them into KO range of a switch-in or revenge killer, such as Tauros and Kangaskhan's Earthquake after two hits with Super Fang.</p> <p><strong>Exeggutor</strong>: Exeggutor resists Thunderbolt and only takes a maximum of 62% from Jolteon's Explosion, and it threatens Sleep Powder and a 3HKO from Razor Leaf. However, Exeggutor has to be wary of Super Fang putting it into Explosion KO range, and critical hit Explosion OHKOes it.</p> <p><strong>Paralysis</strong>: If Jolteon becomes paralyzed, it becomes much less threatening, as its high base Speed is its best trait. It is also much easier to revenge kill if it becomes paralyzed.</p> <p><strong>Gengar</strong>: While Gengar does not take most of Jolteon's attacks well, as it hates paralysis and is 4HKOed by Thunderbolt, it can switch into and absorb Jolteon's Explosion.</p> <p><strong>Physical Attackers</strong>: Most physical attackers, such as Tauros, Snorlax, and Clefable, 2HKO Jolteon with Slash while only being 3HKOed or 4HKOed in return by Thunderbolt. These physical attackers are also physically bulky, meaning they take Jolteon's Explosion quite well.</p>",
    "sets": {
      "Fast Attacker": {
        "description": "<h4>Set Description</h4> <p>Thunderbolt is Jolteon's primary STAB move, 2HKOing Electric-weak foes, such as Starmie, Vaporeon, Dodrio, Aerodactyl, and Cloyster with a 20.8% chance to 2HKO Kangaskhan as well. It also 3HKOes Tauros and Jynx, 3HKOes Clefable 69.4% of the time, and 4HKOes many bulkier foes, such as Snorlax, Gengar, Alakazam, and Zapdos. Thunder Wave allows it to spread paralysis across the opposing team, with its high base Speed allowing it to get the jump on any unboosted foe. Super Fang is Jolteon's best option against many full HP foes, such as Exeggutor, Zapdos, and Snorlax, and it makes Jolteon's best switch-ins—such as Golem and Exeggutor—think twice about switching in. However, unlike Thunderbolt, it can miss and cannot score critical hits, making it unreliable at times. Explosion is a powerful tool, OHKOing Jynx and Alakazam 66.7% of the time and doing 72.9% minimum to Chansey. It also does serviceable damage to physically bulkier foes, doing 52.6% minimum to Exeggutor and 54.9% minimum to Tauros. Explosion is also useful for finishing off foes weakened by moves such as Super Fang and Thunderbolt, or it can put a foe into revenge kill range. With Jolteon being the fastest viable Pokemon, it has a lot of leeway in its ability to weaken or paralyze a foe before using Explosion.</p> <p>Jolteon can be used as a lead, a mid-game progress maker, or a late-game cleaner. Its most notable position is in the lead slot, as it can take advantage of its high base Speed, Thunder Wave, and Explosion to be able to threaten all relevant leads, paralyzing lead Gengar and cutting the accuracy of its Hypnosis down to a mere 45% while also threatening other common leads, such as Jynx and Alakazam, with paralysis and Explosion. As a mid-game progress maker, Jolteon uses Thunder Wave and good coverage to revenge kill and force trades with important threats such as Gengar, Clefable, Kangaskhan, and Tauros. Jolteon as a cleaner uses its high base Speed and powerful STAB to pick off weakened foes at the end of a game, beating out other common late-game cleaners such as Starmie. In this case, Jolteon should be kept hidden until the end of the game, as it is much more effective at cleaning if the opponent is caught off guard. It should also be kept hidden until Exeggutor and Ground-types have been eliminated, as these foes pose massive issues for it. All of these Jolteon sets work extremely well when paired with other Explosion users, such as Kangaskhan and Exeggutor, as they can either carry on momentum that Jolteon generates early- and mid-game, or they can remove barriers to Jolteon cleaning, such as Kangaskhan, Exeggutor, and Tauros. Lead Jolteon and mid-game progress maker Jolteon's main utility lies in outspeeding and paralyzing at least one foe, and then threatening foes with strong attacks and Explosion.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 625260, "username": "NotVeryCake"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 535530, "username": "Gangsta Spongebob"}, {"user_id": 540559, "username": "gastlies"}]}, {"name": "Grammar checked by", "members": [{"user_id": 583793, "username": "Sabelette"}]}]}
  },
  "Omastar": {"sets": {"STABmons": {}}},
  "Kabutops": {"sets": {"STABmons": {}}},
  "Aerodactyl": {"sets": {"STABmons": {}}},
  "Snorlax": {"sets": {"STABmons 1": {}, "STABmons 2": {}}},
  "Zapdos": {"sets": {"STABmons": {}}},
  "Dragonite": {"sets": {"STABmons": {}}}
}