{
  "Butterfree": {
    "overview": "<p>Despite its access to the powerful \"Double Powder\" combination, Butterfree has no place in PU. Its mediocre offenses and lack of decent STAB attacks mean it does pitiful damage despite its access to the excellent Psychic. It's overwhelmed by most physical attackers and 2HKOed by the plethora of Fire Blast, Blizzard, and Thunderbolt users thanks to its awful Bug / Flying typing. Additionally, while less common, Rock Slide from threats like Graveler easily OHKOes Butterfree. As a fast sleeper, it's completely outclassed by Gastly, which has a much better offensive presence and Speed tier. As a dual status spreader, Butterfree is outclassed by Drowzee, which does more damage and has fantastic defensive utility. Even fringe sleepers like Vileplume and Weepinbell still have more of a use thanks to their niche defensive utility. It is not advised to use Butterfree if your goal is to win.</p>",
    "sets": {
      "Double Powder": {
        "description": "<p>Sleep Powder and Stun Spore let Butterfree spread status quite effectively. Psychic is Butterfree's most powerful attack, and it's serviceable against some threats like Nidoqueen and Machamp. Mega Drain serves as coverage against Omanyte and Graveler, though Butterfree will still lose versus the latter unless it's weakened beforehand. Alternatively, Psywave lets Butterfree deal decent but inconsistent damage to Psychic-types.</p> <p>Butterfree struggles the most against Fire-types and Fearow, so checks to them like Omanyte and Graveler make good partners. This is particularly important if Butterfree is used as a lead, as these threats are themselves common leads. While most slower threats don't want to face Butterfree before Sleep Powder is used, afterwards Drowzee serves as a strong check that doesn't mind its attacks or paralysis, so wallbreakers like Pinsir and Fearow help out considerably. Butterfree is best used to put a foe to sleep as quickly as possible and then try to spread paralysis before being knocked out. Butterfree can notably switch into slower Earthquake users like Machamp and Graveler and then put them to sleep. However, it must be wary of their other attacks, most of which hit Butterfree super effectively or can paralyze it.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 535530, "username": "Gangsta Spongebob"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 583793, "username": "Sabelette"}]}, {"name": "Grammar checked by", "members": [{"user_id": 583793, "username": "Sabelette"}]}]}
  },
  "Beedrill": {
    "overview": "<p>Beedrill is thoroughly outclassed in RBY PU. At first glance, Twineedle seems usable and its boosting moves look promising, but Beedrill's incredibly poor stats prevent it from contributing to a victory. It is outsped by premier attackers including every viable Fire-type, Abra, Nidoqueen, Pinsir, and Fearow, all of which OHKO it or come extremely close. Beedrill can only effectively contribute by setting up with Swords Dance and Agility, which is nearly impossible to pull off since even the weakest foes 3HKO it. One would think Twineedle gives it a niche against Psychic-types, but Beedrill flops even against the incredibly frail Abra, OHKOing it a mere 25.6% of the time. Meanwhile, Abra OHKOes Beedrill 72% of the time, before accounting for critical hits, and is faster. Beedrill outspeeds Drowzee but isn't even guaranteed to 2HKO it, and Drowzee has a small chance to OHKO back. The ubiquity of Fire-types does Beedrill no favors, as it deals pitiful damage to them and they outspeed and OHKO it, leaving it few chances to even find entry, let alone progress. In short, Pinsir and Fearow are better attackers than Beedrill on any team.</p>",
    "sets": {"Double Dance": {"description": "<p>Agility and Swords Dance boost Beedrill's stats to respectable levels; should it manage both, it may actually manage to contribute, but this relies on the opponent misplaying. Twineedle has a small chance to OHKO Abra and may 2HKO Drowzee, but it is ineffective against Fire-types, Pinsir, and Fearow. +2 Hyper Beam deals decent damage to most targets but will rarely break through the opposing team; any fully-evolved Pokemon easily survives it. Beedrill can run Mega Drain to hit Omanyte and Graveler, but it 3HKOes at best and both foes still easily defeat it. Beedrill's best hope is for its teammates to spread sleep and paralysis, hopefully also chipping down its many checks. If Beedrill can use Swords Dance once or twice safely and faster foes are paralyzed, it may manage a sweep, or at least heavy damage.</p>"}},
    "credits": {"writtenBy": [{"user_id": 583793, "username": "Sabelette"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 540559, "username": "gastlies"}]}, {"name": "Grammar checked by", "members": [{"user_id": 383911, "username": "YashGreninja"}, {"user_id": 517429, "username": "Adeleine"}]}]}
  },
  "Pidgeot": {
    "overview": "<p>Pidgeot is completely outclassed by Fearow, as its better bulk is completely overshadowed by Fearow's higher Attack, Speed, and access to Drill Peck. Pidgeot falls into all the same pitfalls as Fearow, including a losing matchup against Rock-types, a difficult BoltBeam weakness, and a fear of paralysis. The lack of Drill Peck leaves Pidgeot with a much worse matchup against Pinsir and Gastly, which it struggles to threaten. As a result, Pidgeot should never be used on any serious team.</p>",
    "sets": {
      "Standard": {
        "description": "<p>Double-Edge and Hyper Beam serve as powerful STAB attacks coming off of Pidgeot's high Attack, seriously threatening neutral targets such as Staryu, Drowzee, and Dragonair. Sky Attack is Pidgeot's strongest option against Gastly and Pinsir; it has a 64.1% chance to OHKO Gastly, and it also does at least 78.6% to Pinsir. Agility lets Pidgeot boost its Speed and reapply paralysis, notably aiding its role as an endgame cleaner. Alternatively, Toxic lets Pidgeot weaken Rock-types. Mirror Move is also an option in the last slot, potentially letting Pidgeot copy something useful like Earthquake or Swords Dance.</p> <p>Since Pidgeot is outclassed, it can only be justified if brought alongside Fearow. They share Rock-type counters like Omanyte and Graveler, so Porygon is a mandatory partner. Rapidash and Arcanine also give this duo trouble, so Omanyte works well in countering them. Given that Gastly easily switches into Pidgeot and forces it to use Sky Attack, checks to it like Drowzee and Abra are essential. Pidgeot hates being paralyzed, so it's best used either as an endgame cleaner, when all opposing paralysis spreaders have been weakened or KOed, or as a midgame wallbreaker, willing to sacrifice itself to aid another cleaner.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 535530, "username": "Gangsta Spongebob"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 583793, "username": "Sabelette"}]}, {"name": "Grammar checked by", "members": [{"user_id": 583793, "username": "Sabelette"}]}]}
  },
  "Fearow": {
    "overview": "<p>Fearow's combination of sky-high Attack, Normal-type STAB, and excellent Speed makes it the premier offensive threat in the tier as well as perhaps the single most dominant Pokemon overall. It blasts opponents with powerful attacks early- and mid-game, and if it's left healthy it can easily clean up a weakened team. It has an excellent Speed stat that makes it faster than every Pokemon except Rapidash and Scyther while also giving it a fantastic 19.5% critical hit rate. Since most switch-ins will take two attacks from Fearow before being able to strike back, they have to be healthy enough to survive not only Double-Edge, but also a follow up Hyper Beam, making Fearow very hard to switch in to. Additionally, the chance for a critical hit means an otherwise decent check, such as Nidoqueen or Arcanine, can be forced out quickly.</p> <p>Despite Fearow's overwhelming positive qualities, its frailty and fear of paralysis prevent it from effortlessly blasting through teams. Although its Flying typing offers a nice immunity to Ground-type moves, it doesn’t have any other notable resistances and is weak to moves such as Blizzard and Thunderbolt from extremely common Pokemon, such as Nidoqueen and Seaking. Fearow's notable lack of Body Slam means it has to rely on the mediocre Double-Edge as its Normal-type STAB move, and the move's recoil further hinders Fearow's longevity, notably putting it in 2HKO range of Fire Blast from Rapidash and Arcanine and OHKO range of Scyther's Hyper Beam at +2. Fearow's frailty makes it very reliant on its Speed, forcing it to run away from Thunder Wave users it would normally beat, such as Drowzee and Staryu. Fearow is completely walled by Graveler and to a lesser extent Omanyte. Both Rock-types resist Fearow’s STAB combination and are capable of hitting it back with super effective damage. However, Graveler and Omanyte are easily exploitable thanks to Porygon, which can switch into all of their moves and hit them super effectively, alleviating Fearow's worst matchups. Fearow's strengths heavily outweigh its weaknesses; it is an elite Pokemon, and it should almost never be dropped when building a team.</p>",
    "comments": "<h3>Other Options</h3> <p>Double-Edge, Drill Peck, and Hyper Beam are all integral to Fearow's success, so Agility should be dropped if another move is to be used. Substitute is a move that takes advantage of players' tendencies to sacrifice weakened Pokemon to Fearow. If Fearow uses Substitute on a turn where the opponent switches in a sacrifice, Fearow can KO it the next turn and still have the Substitute. A critical flaw with Substitute is that it does not protect Fearow from paralysis, so it should only be used if all Thunder Wave users are already KOed or in KO range for Fearow. Mirror Move can be used to punish Nidoqueen’s Blizzard by copying the move and hitting it back with super effective damage, but Fearow’s low Special means it actually does less damage than Hyper Beam, and Nidoqueen can use the safer but weaker Thunderbolt or just switch out to render Mirror Move useless. Mirror Move can also be used to let Fearow switch into Nidoqueen and even Graveler’s Earthquakes, then hit them super effectively with Earthquake the next turn. Toxic can be used on a predicted Graveler or Omanyte switch-in to wear it down over the course of a game, making it easier for Fearow to break through. However, the damage from poison is very low, and a wrong prediction could accidentally make an opposing Pokemon immune to paralysis.</p> <h3>Checks and Counters</h3> <p><strong>Rock-types</strong>: Graveler and Omanyte can switch into Fearow and take its hits well. Graveler takes a maximum of 17.2% from Double-Edge, while Omanyte takes a maximum of 21.9%. Graveler’s Rock Slide and Omanyte’s Blizzard both do massive damage to Fearow, 2HKOing it. Graveler in particular is extremely deadly if it switches into a predicted Hyper Beam from Fearow, since it can use Rock Slide on the recharge turn and leave Fearow in an uncomfortable prediction situation; stay in and risk another Rock Slide, or switch out and risk the switch-in taking massive damage from Counter.</p> <p><strong>Paralysis</strong>: Fearow hates being paralyzed, since high Speed is one of its most important assets. Although this can be alleviated with Agility, Fearow still hates the chance for full paralysis due to its frailty, and the turn to set up Agility makes it vulnerable. This means Fearow has to run from Pokemon it would otherwise easily beat. Dragonair and Porygon in particular can 2HKO Fearow with Blizzard. However, since most paralysis spreaders are frail, Fearow can KO them with Hyper Beam if they’ve taken a bit of chip damage, and a critical hit Hyper Beam OHKOes every Thunder Wave user outright.</p> <p><strong>Magneton</strong>: Magneton has a 64.1% chance to OHKO Fearow with Thunderbolt, and Fearow cannot KO it with Double-Edge + Hyper Beam without a critical hit. Double-Edge's recoil also guarantees that Thunderbolt will KO. Magneton can also paralyze Fearow to stop an Agility sweep or to hedge its bets in case of a poor damage roll, and many teams are vulnerable to Magneton once their Ground-type falls. Magneton also easily switches into Drill Peck, letting it pivot into Fearow as it targets a low-HP foe or Gastly.</p> <p><strong>Fire-types</strong>: Although Rapidash is too frail to switch into Fearow, it is a fantastic revenge killer. It outspeeds Fearow and has a 36.3% chance to 2HKO with Fire Blast; this becomes guaranteed after factoring in Double-Edge recoil. Fire Blast can also burn Fearow, effectively rendering it useless. Arcanine is slower than Fearow but is bulky enough to always survive a Double-Edge followed up by Hyper Beam and does the same amount of damage as Rapidash.</p> <p><strong>Scyther</strong>: Although it loses one-on-one and cannot switch into Fearow, Scyther is one of only two Pokemon that outspeed Fearow, allowing it to revenge kill Fearow at low HP. Scyther can also attempt to revenge kill Fearow at high HP, but it requires a turn to set up Swords Dance, leaving it vulnerable to an OHKO from a critical hit Drill Peck.</p> <p><strong>Ground-types</strong>: Nidoqueen is able to survive Double-Edge followed by Hyper Beam and hit Fearow super effectively with Blizzard, winning one-on-one. It is also risky for Fearow to try to fish for a critical hit Hyper Beam on the second turn, since if it fails, Nidoqueen can set up a Substitute and KO Fearow as it recharges, now having a Substitute up against whatever comes after Fearow. Although Nidoqueen loses to Fearow one-on-one if it has to switch in, Blizzard will do enough damage to put Fearow in KO range for both Rapidash's Fire Blast and Scyther's Slash. Nidoqueen also likes to use Thunderbolt sometimes to prevent Seaking and Staryu from switching into Blizzard and prevent Fearow from using Mirror Move. Sandslash survives two Double-Edges followed by Hyper Beam, and it 2HKOes with Rock Slide after factoring in Double-Edge recoil.</p>",
    "sets": {
      "Offensive": {
        "description": "<h4>Set Description</h4> <p>Double-Edge and Drill Peck are Fearow’s STAB options. Double-Edge is the more powerful of the two, but reckless use will quickly rack up heavy recoil damage. Drill Peck is slightly weaker, but it lacks recoil and 2HKOes Scyther, Pinsir, and Machamp. This is useful since the chance for a critical hit discourages the former to set up Swords Dance in front of Fearow, and the latter two are among the most physically bulky Pokemon in the tier. Drill Peck also cleanly 2HKOes Gastly, which would otherwise wall Fearow. Fearow’s Hyper Beam is extremely powerful, dealing a minimum of 73.3% to Drowzee and 81.7% to Staryu, making it an excellent Pokemon to finish off these physically frail foes after minimal chip damage. Hyper Beam also does a lot against bulkier Pokemon, dealing a minimum of 42.8% to Nidoqueen and 53.9% to Seaking. Two Double-Edges followed by Hyper Beam is guaranteed to KO every non-resistant Pokemon in the tier aside from Sandslash, and physically frail Pokemon are put into Hyper Beam range after just one Double-Edge. A critical hit Double-Edge puts almost every Pokemon into Hyper Beam KO range, and a critical hit Hyper Beam will OHKO most of the tier outright, making switching into a predicted Hyper Beam very risky. Agility allows Fearow to outspeed Rapidash and Scyther, making it much harder to revenge kill, and negates the Speed drop from paralysis. Agility is most useful late-game when Fearow is ready to sweep a weakened team.</p> <p>Fearow is best saved for the mid- and late-game, once its teammates have weakened foes enough for Fearow to OHKO them. However, Fearow can still make use of its revenge killing prowess early-game. Since Fearow is frail and hates paralysis, getting it safely on the field takes some effort. One way Fearow can get in is by switching into a predicted Earthquake from Nidoqueen. This is risky and should only be done once Nidoqueen is in KO range for Double-Edge into Hyper Beam, but the reward of getting Fearow in safely is often worth it. Another way to get Fearow in is through partial trapping moves from teammates such as Rapidash and Dragonair.</p> <p>Once Fearow is on the field, it is very hard to stop. The most common ways to deal with Fearow are to either switch in a Rock-type or sacrifice a Pokemon and revenge kill it with Rapidash, Scyther, or Magneton. Nidoqueen can also be an effective revenge killer if it is at high enough HP. It should be no surprise then that Seaking is an excellent teammate for Fearow, since it has an excellent matchup against all of the aforementioned Pokemon except for Magneton. Additionally, Staryu and Porygon can help with the Rock-types, while Omanyte and Arcanine can switch into Rapidash. The Water-types can also switch into Nidoqueen’s Blizzard in dire situations, with a healthy Staryu even beating Nidoqueen one-on-one after switching into Blizzard. Rapidash is an excellent teammate that can use Fire Spin to get opposing Pokemon into Fearow’s Hyper Beam range and give Fearow a free switch, which is extremely helpful considering Fearow's frailty. It can also help Fearow wear down shared checks in Graveler and Omanyte and potentially burn them with Fire Blast. Pinsir is also a good teammate thanks to its powerful Slash that lowers foes such as Dragonair and Seaking into Fearow's Hyper Beam range. Ironically, Omanyte is also a good teammate thanks to its ability to switch into a Rapidash or Arcanine that tries to revenge kill Fearow. Although they are hard to fit on a team, Vileplume and Weepinbell threaten both Graveler and Omanyte with 4x super effective damage, making them great checks to Fearow’s main walls. They can also try to paralyze a Rapidash or Arcanine that switches into them with Stun Spore, making them much easier for Fearow to handle later.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 540559, "username": "gastlies"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 535530, "username": "Gangsta Spongebob"}, {"user_id": 583793, "username": "Sabelette"}]}, {"name": "Grammar checked by", "members": [{"user_id": 583793, "username": "Sabelette"}]}]}
  },
  "Arbok": {
    "overview": "<p>Access to Glare and Wrap combined with its solid base 80 Speed gives Arbok the smallest of niches in PU. It can outspeed and Wrap metagame staples like Nidoqueen and Porygon. Against faster foes, Arbok can use Glare to paralyze them and continue using Wrap. However, this is where Arbok's positive traits end. Its terrible Poison typing gives it no notable resistances, weaknesses to common Ground- and Psychic-type attacks, and no useful STAB moves. Combined with its mediocre bulk and Attack, this leaves Arbok struggling to dish out damage while taking significant damage from most threats in return. Arbok's Speed isn't that great either, as common foes like Rapidash, Arcanine, and Fearow outpace it—teams typically have no shortage of Pokemon that outspeed Arbok. If Arbok finds itself on the receiving end of paralysis, it's practically dead weight to it's team. Arbok is also very unreliable—Wrap is only as accurate as Fire Blast, while Glare is even worse at 74.6%. Even if it can get in against a slower threat, Arbok may just miss twice and get KOed without accomplishing anything. Thus, despite its useful tools, players should generally avoid using Arbok.</p>",
    "comments": "<h3>Other Options</h3> <p>Mega Drain can be used as coverage against Graveler, but it only has a 40.7% chance to 2HKO. Body Slam may seem like a means to attack while inflicting paralysis, but Arbok always prefers Glare's higher paralysis odds or Hyper Beam's damage. Rock Slide may seem like good coverage against Fearow and Pinsir, but Arbok always prefers to use Glare or Wrap against them, and Hyper Beam does similar amounts of damage to them.</p> <h3>Checks and Counters</h3> <p><strong>Paralysis</strong>: Once paralyzed, Arbok is completely useless, as it can no longer outspeed and Wrap unparalyzed foes, and the chance of full paralysis means it can't reliably use Wrap against paralyzed targets. While Arbok outspeeds every viable Thunder Wave user besides Abra and Staryu, it still risks being paralyzed if Wrap misses or if it switches into Thunder Wave users.</p> <p><strong>Faster Attackers</strong>: Fearow and Pinsir outspeed Arbok; the former has high odds to KO it with Double-Edge + Hyper Beam, while the latter has a 26.3% chance to 2HKO with Slash. Rapidash and Arcanine also outspeed Arbok and have a 32.1% chance to 2HKO it with Fire Blast, which is accompanied by a 30% burn chance and a high critical hit rate. All of these threats must be wary of Glare, but Arbok's low damage output gives them the opportunity to KO it if it misses Wrap once or twice.</p> <p><strong>Ground-types</strong>: While Nidoqueen, Sandslash, and Graveler are outsped by Arbok, Earthquake 2HKOes it. Arbok is likely to miss Wrap before it can get them into KO range due to their physical bulk and Arbok's poor damage output.</p>",
    "sets": {
      "Wrap": {
        "description": "<h4>Set Description</h4> <p>The combination of Wrap and Glare is Arbok's primary draw, as the former immobilizes slower foes, letting it pivot around them or chip them down, while the latter lets it spread paralysis, making more foes vulnerable to its Wrap. While spammable, these moves have low accuracy, and Wrap may give sleeping targets free turns to wake. Earthquake hits Gastly and Rock-types for super effective damage and serves as coverage against top threats like Nidoqueen and Rapidash. Hyper Beam is Arbok's strongest attack against targets that are not weak to Earthquake, serving as a decently powerful finisher against foes like Pinsir and Machamp.</p> <p>Since Arbok is useless when paralyzed, its worst matchups are against faster Thunder Wave users, namely Abra and Staryu. Abra also 2HKOes Arbok with Psychic and is rarely OHKOed by Arbok's Hyper Beam. Drowzee is an excellent partner for its ability to check these threats and has the added benefit of spreading paralysis of its own. Arbok isn't completely helpless against faster threats, as it can try to tank a hit and retaliate with paralysis, but it still often loses due to Glare's low accuracy and the possibility of critical hits or secondary effects like burn. It's also easily overwhelmed by multiple faster opponents. Fearow, Rapidash, and Arcanine all give Arbok a good deal of trouble, so Omanyte is an essential partner for its ability to check all of them. These same fast wallbreakers help Arbok against Pinsir, which outspeeds and does huge damage to it. Other paralysis spreaders like Dragonair and the aforementioned Drowzee also work well in hamstringing these faster threats for Arbok. Using Arbok with multiple Thunder Wave users has the added benefit of making it easier for powerful wallbreakers like Nidoqueen and Fearow to break past their checks.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 535530, "username": "Gangsta Spongebob"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 583793, "username": "Sabelette"}, {"user_id": 96315, "username": "phoopes"}]}, {"name": "Grammar checked by", "members": [{"user_id": 583793, "username": "Sabelette"}]}]}
  },
  "Sandslash": {
    "overview": "<p>Sandslash falls into a strange spot in RBY PU. Since Nidoqueen is mandatory, it can be difficult to envision where Sandslash fits on a team, but its excellent Attack, physical bulk, and superior typing give it a distinct role and matchup spread. While Sandslash isn't a replacement for Nidoqueen, it can check foes that take advantage of Nidoqueen's lower damage output or hit it super effectively due to its terrible Poison typing, like Porygon, Machamp, Abra, and Drowzee. The Porygon matchup is especially notable, as Sandslash will always bring Porygon down to low HP at worst and will often win outright, but Sandslash's ability to check physical attackers and Psychic-types is invaluable too. Sandslash's superior bulk also allows it to fight Fearow more effectively, as Fearow can only 4HKO it, making Sandslash the best Fearow check outside of Rock-types. It's also a dangerous setup sweeper—one free turn can allow it to set up and use its QuakeSlide coverage to tear through the opposing team.</p> <p>Sandslash's main flaws are its mediocre Speed and Special. It unfortunately struggles against Nidoqueen and Pinsir due to the Speed disadvantage, and many Water-types, such as Staryu and Seaking, also outrun it and threaten painful super effective attacks. Its Attack, while excellent, falls just short of some crucial benchmarks like 2HKOing Fearow, Porygon, and Dragonair, so a sweep is extremely unlikely without immense paralysis support and multiple turns of setup. That said, Sandslash does not need to set up to be effective, and its combination of wallbreaking potential and ability to punish passivity with Swords Dance can create harrowing guessing games for the opponent.</p>",
    "comments": "<h3>Other Options</h3> <p>Sandslash generally lacks other move choices. Body Slam can be used instead of Substitute to fish for paralysis, but it deals relatively poor damage. Hyper Beam initially seems appealing, but Ground-resistant foes like Pinsir and Fearow are weak to Rock Slide anyway, so Sandslash has no reason to take this risk.</p> <h3>Checks and Counters</h3> <p><strong>Water-types</strong>: Sandslash is outsped by Staryu, Seaking, and the rare Poliwag, which all nearly OHKO it and can survive an Earthquake. Seaking can even set up Agility in front of Sandslash and still win the matchup. Staryu and Poliwag are frail, however, and cannot switch into a healthy Sandslash and win. While Omanyte cannot beat Sandslash one-on-one, it still deals heavy damage and can easily put Sandslash in range of any revenge killer.</p> <p><strong>Nidoqueen</strong>: Nidoqueen outspeeds and 2HKOes Sandslash, which cannot OHKO Nidoqueen without a critical hit. Sandslash is capable of winning the matchup if it sets up Substitute or Swords Dance, however.</p> <p><strong>Dragonair</strong>: Dragonair outspeeds Sandslash and can chip it into range of other threats quickly with Wrap; two or three cycles of Wrap is generally enough to put it in range of Water-types, and a few more cycles put it in range of various Blizzard users, including Dragonair itself. Wrap also allows Dragonair to incentivize a set-up Sandslash to switch out to preserve its health, frustrating its attempt to make progress.</p> <p><strong>Grass-types</strong>: Vileplume can narrowly defeat Sandslash with Mega Drain, but Sandslash actually wins one-on-one if it uses Swords Dance rather than immediately attacking. Weepinbell has a tiny chance to OHKO Sandslash with Razor Leaf, but Sandslash is faster and 2HKOes it with Earthquake 87.2% of the time. Both are able to put Sandslash to sleep or paralyze it, and this allows Weepinbell to use Wrap to chip Sandslash into range of its attacks; Sandslash detests paralysis, as even if it manages to beat these foes, it becomes useless for the rest of the match.</p> <p><strong>Faster Foes</strong>: Sandslash struggles with most faster foes, as it only tenuously wins these matchups and is vulnerable to critical hits or burns. Arcanine and Rapidash both have a 38.2% chance to 2HKO Sandslash, which is exacerbated by their high critical hit chances and Fire Blast's burn chance. Magmar fares better with a 76.2% chance to 2HKO Sandslash, but Sandslash has a 43.6% chance to OHKO it in return; while this is a little better for Sandslash, it's still favorable for Magmar overall. Pinsir has a 53% chance to 3HKO Sandslash with Slash, and it can potentially use Bind or Hyper Beam to boost its odds; Sandslash can only 3HKO it in return with Rock Slide. Fearow cannot 3HKO Sandslash outright, but its excellent critical hit rate gives it passable odds to get lucky and win anyway, since Sandslash can only 3HKO it.</p>",
    "sets": {
      "Swords Dance": {
        "description": "<h4>Set Description</h4> <p>Earthquake is Sandslash's main attacking option, as the only Pokemon that don't mind it—Fearow and Pinsir—are vulnerable to Rock Slide. After a Swords Dance, Sandslash deals immense damage, notably OHKOing every Fire- and Rock-type as well as Nidoqueen, Staryu, and Drowzee; in fact, Sandslash 2HKOes every single Pokemon in the tier after a boost. Swords Dance also helps in some rare scenarios by reapplying Speed and Attack drops from paralysis and burn, respectively, as well as cancelling out burn on Sandslash if it happens to get burned. Substitute helps to facilitate setup and exploit switches or full paralysis, permitting Sandslash to use Swords Dance or begin attacking; since Sandslash is immune to Thunder Wave, and common sleep inducers like Drowzee and Gastly lose to it if they miss a single time, it becomes extremely difficult to stop once safely behind a Substitute. If Sandslash is able to set up both Swords Dance and Substitute, it becomes nearly impossible to stop.</p> <p>Sandslash generally functions as a mid-game attacker, exploiting Thunder Wave attempts from Drowzee, Abra, and Porygon to find entry then following up with Earthquake. Sandslash reliably beats both Psychic-types one-on-one, and Porygon cannot afford to trade hits with Sandslash, as its best case scenario still leaves it too chipped to avoid a revenge kill. Since Pinsir is rare and Fearow cannot beat Sandslash one-on-one, it can afford to simply use Earthquake and expect to make decent progress. Sandslash can also duel Fearow late-game to clear the way for teammates to finish the game. Sandslash therefore benefits from teammates that can spread paralysis and incentivize opposing Thunder Wave, such as Staryu and Porygon. It also appreciates allies that can chip down faster checks for it; Nidoqueen and Seaking, for example, can help to weaken Fearow and Fire-types for Sandslash to finish off later. Dragonair is notable for its combination of Thunder Wave and Wrap, which can paralyze checks on entry then grant Sandslash a free switch-in.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 583793, "username": "Sabelette"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 535530, "username": "Gangsta Spongebob"}, {"user_id": 530877, "username": "Volk"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Nidoqueen": {
    "overview": "<p>Nidoqueen is a staple of PU and is considered mandatory on the vast majority of teams. Its high bulk, good offensive stats, and phenomenal coverage make it the best progress maker in the tier. Since Nidoqueen can 2HKO the majority of the metagame, getting it onto the field unscathed will almost always force the opponent to sacrifice a Pokemon or risk their switch-in taking massive damage, which usually leads to that switch-in losing anyways. Furthermore, Nidoqueen's immunity to Thunder Wave makes it very difficult to cripple without attacking directly. As a result, Nidoqueen is potent at capitalizing on double switches into slower Pokemon, especially those reliant on paralysis like Drowzee and Dragonair, as Nidoqueen usually beats them one-on-one and dissuades them from switching out. These traits also make it effective at removing paralyzed foes. Additionally, Nidoqueen is an excellent check to some of the tier's best offensive threats; it avoids a 2HKO from Fire Blast users and Pinsir and Scyther's Slash and also isn't KOed by Double Edge + Hyper Beam from Fearow, while it can 2HKO them back with super effective moves.</p> <p>However, while Nidoqueen's Speed tier defines PU, for this reason teams typically have no shortage of Pokemon that can outspeed it, leading to it being easily revenge killed. Nidoqueen's typing is far from ideal; as great as its Ground typing is, it has weaknesses to common attacks like Surf and Blizzard, while its useless Poison typing gives it weaknesses to Psychic and Earthquake. Nidoqueen's offensive presence isn't flawless either, as it can't 2HKO Porygon, which can heal off the damage with Recover, though it must be wary of critical hits. Despite its immunity to Thunder Wave, every relevant Thunder Wave user can hit it super effectively, limiting the utility of this trait. In spite of its limitations, Nidoqueen's ability to check so much of PU defines team compositions, and every team needs multiple checks to it to be competitive.</p>",
    "comments": "<h3>Other Options</h3> <p>Surf OHKOes Graveler, though it has little use elsewhere. Body Slam can fish for paralysis, but Nidoqueen prefers raw damage over an inconsistent paralysis chance. Counter may seem useful for its ability punish foes that use Normal-type attacks, but since Nidoqueen already 2HKOes most foes, it doesn't allow any faster KOs. Nidoqueen's high physical bulk also means Counter will deal less damage compared to other users of the move. However, Counter can punish certain Pokemon after they get a KO, like Fearow, as even when they switch out, Nidoqueen can still use Counter to deal massive damage to the switch-in. Tail Whip can be used to allow Nidoqueen to 2HKO Porygon with Earthquake. While Nidoqueen will likely lose one-on-one if Porygon immediately uses Blizzard, Nidoqueen is favored to win if Porygon uses another move, such as Recover. However, Tail Whip has no use against any other Pokemon in PU, and Porygon can always switch out if it has a teammate that can tank an Earthquake. Initially, Rock Slide may seem like a useful coverage option, but Nidoqueen's Earthquake, Blizzard, and Fire Blast already 2HKO foes that are weak to Rock, leaving it only useful against irrelevant Pokemon like Butterfree. Submission may seem like an option to target Porygon, but it's only marginally stronger than Earthquake with the downsides of terrible accuracy and recoil, and it still fails to 2HKO, rendering it completely useless.</p> <h3>Checks and Counters</h3> <p><strong>Porygon</strong>: None of Nidoqueen's attacks 2HKO Porygon, and it can heal off the damage with Recover and threaten Nidoqueen back with Ice-type coverage. However, it must be wary of critical hits, and Porygon loses its ability to consistently check Nidoqueen once paralyzed. Nidoqueen rarely runs Tail Whip, which lets Earthquake 2HKO Porygon, though Porygon is still favored to wint one-on-one when at high health.</p> <p><strong>Water-types</strong>: While it's outsped, Seaking is only 3HKOed by Earthquake and Thunderbolt, and it can 2HKO Nidoqueen with Surf. It can even set up Agility and still win one-on-one. Staryu outspeeds Nidoqueen and can 2HKO with Surf, though Earthquake and Thunderbolt 2HKO back, so Nidoqueen wins if Staryu gets paralyzed.</p> <p><strong>Burn</strong>: Given that Nidoqueen is often tasked with checking Fire-types, it's very susceptible to burns from Fire Blast. Once burned, Nidoqueen is unable to beat them and other foes that it relies on Earthquake to break through, like Omanyte and Drowzee. While these matchups were shaky before, a burned Nidoqueen has no hope of breaking through Porygon and Machamp. If it lacks Thunderbolt, a burned Nidoqueen also has no effective means to make a lasting impact against Staryu, and it struggles to deal significant damage to other Water-types, like Seaking and Slowpoke.</p> <p><strong>Revenge Killers</strong>: Abra outspeeds and 2HKOes Nidoqueen with Psychic, while Nidoqueen only has a 12.8% chance to OHKO back with Earthquake. While they usually lose one-on-one, faster foes like Rapidash, Arcanine, Magmar, Fearow, and Pinsir can outspeed and revenge kill a weakened Nidoqueen. Pinsir is notable as while it loses one-on-one, it can easily switch into Earthquake.</p> <p><strong>Machamp</strong>: Nidoqueen 4HKOes Machamp, while it can 2HKO with Earthquake, forcing a teammate to switch into Machamp's powerful Body Slam or Earthquake. However, due to its lack of recovery, Machamp cannot check Nidoqueen long-term.</p> <p><strong>Sleep Inducers</strong>: Poliwag and Gastly outspeed Nidoqueen and can put it to sleep with Hypnosis. Poliwag can then use Nidoqueen as setup fodder with Amnesia or 2HKO with Hydro Pump, while Gastly can 2HKO Nidoqueen with Psychic. However, their abysmal bulk and reliance on an inaccurate move mean Nidoqueen can get past them with some luck, as it 2HKOes the former and OHKOes the latter. While slower, bulkier sleepers like Vileplume and Weepinbell can easily tank a hit and attempt to put Nidoqueen to sleep with Sleep Powder; Vileplume is notably not 2HKOed by any of Nidoqueen's attacks.</p>",
    "sets": {
      "The Queen": {
        "description": "<h4>Set Description</h4> <p>This set gives Nidoqueen perfect coverage, allowing it to deal significant damage to any foe. Earthquake is Nidoqueen's strongest attack against neutral targets, and it's incredibly safe to use, since nothing resists Earthquake without also taking super effective damage from one of Nidoqueen's coverage moves. Additionally, it 2HKOes prominent foes like Rapidash, Arcanine, and opposing Nidoqueen. Blizzard 2HKOes every Flying- and Ground-type besides Nidoqueen itself. Thunderbolt hits Water-types super effectively—it 2HKOes the rare Slowpoke, but it doesn't do significantly more damage than Earthquake to foes like Staryu and Seaking. It's best used to ease prediction, as opponents may try to switch in Fearow or Scyther to take an Earthquake aimed at their Water-type, or if Nidoqueen is burned, as without Thunderbolt it would struggle to damage Water-types. It also helps against the rare Mirror Move Fearow, as a copied Blizzard does significant damage to Nidoqueen. Substitute  eases prediction against foes switching out, and it can exploit attempted sacrifices, which commonly happen once Nidoqueen gets in. However, it's advised not to recklessly use Substitute, as it can cut into Nidoqueen's bulk and make it lose some matchups. For example, setting up a single Substitute leaves Nidoqueen with a 74.2% chance to be 2HKOed by Rapidash and Arcanine's Fire Blast. After losing two Substitutes, it is OHKOed by Nidoqueen's Earthquake. Fire Blast is used to 2HKO Pinsir, which is one the few viable Pokemon that doesn't mind Earthquake or Blizzard. It also lets Nidoqueen fish for burns, which can punish physical attackers like Machamp and Fearow trying to switch in.</p> <p>Nidoqueen should be used on almost every team. It's often used as a mid-game progress maker, as it's fantastic at breaking down the opponent's defenses, priming a cleaner like Fearow or Seaking for an endgame sweep. While it's rarely a team's best option, it can also check offensive threats like Rapidash, Arcanine, Fearow, and Scyther. It can switch into them after they get a KO and force them to stay in as it revenge kills them, eliminating a major threat to its team. Thunder Wave users, like Staryu and Drowzee, are the most effective form of support for Nidoqueen; paralysis mitigates Nidoqueen's mediocre Speed and ruins its single consistent long-term check: Porygon. Machamp is another Pokemon that can consistently switch in and beat Nidoqueen, but it lacks recovery and cannot repeatedly switch in. While Nidoqueen isn't helpless against it, a check like Fearow or Pinsir can handle Machamp. Staryu and Seaking pose issues to Nidoqueen thanks to their Water STAB, so checks to them, like Drowzee for the former and one's own Staryu for the latter, work well. Nidoqueen is a strong lead, being among the few Pokemon that can beat Arcanine one-on-one while not being easy to switch into. However, it tends to take significant damage taking on Arcanine, often losing to critical hits or burns.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 593464, "username": "Teh"}, {"user_id": 535530, "username": "Gangsta Spongebob"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 583793, "username": "Sabelette"}, {"user_id": 540559, "username": "gastlies"}]}, {"name": "Grammar checked by", "members": [{"user_id": 583793, "username": "Sabelette"}, {"user_id": 423085, "username": "Deezcastforms"}]}]}
  },
  "Golbat": {
    "overview": "<p>Clearly winging it, Golbat doesn't have even the slightest hope of taking flight in PU. Right off the bat, outside of its above-average Speed, all of its stats are below-average to bad. It lacks any powerful attacks or utility options, usually failing to draw blood from its target. In fact, it's completely unable to sink its fangs into Gastly due to its lack of coverage. Its typing is also very subpar, leaving it battered in the face of common Ice-, Psychic-, and Electric-type attacks. While its Speed and access to Confuse Ray are quite solid, the only thing blood curdling about this vampire bat is how terrible it is.</p>",
    "sets": {"Standard": {"description": "<p>Confuse Ray can give Golbat extra turns, though it's quite unreliable. Screech is the most useful form of utility Golbat has, and it slightly abates its low attacking power. Double-Edge is Golbat's primary means of battering its opponent. Hyper Beam can be used over Screech or Double-Edge as Golbat's most powerful attack. Mega Drain lets Golbat leech health off its target but is only useful as coverage against Rock-types, such as Graveler and Omanyte. While Golbat already does about as much damage as a vampire in the sun, Gastly completely stonewalls Golbat, so checks to it such as Drowzee and Abra make good partners.</p>"}},
    "credits": {"writtenBy": [{"user_id": 535530, "username": "Gangsta Spongebob"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 583793, "username": "Sabelette"}]}, {"name": "Grammar checked by", "members": [{"user_id": 583793, "username": "Sabelette"}]}]}
  },
  "Vileplume": {
    "overview": "<p>Vileplume's good bulk, resistance to Water- and Electric-type coverage, and access to Sleep Powder and Stun Spore let it find a comfortable spot in the PU metagame as a bulky status spreader, threatening tier staples such as Staryu and Nidoqueen with a debilitating status condition. Its Grass typing allows it to switch into and check Seaking lacking Blizzard and wall Staryu lacking Psychic or Blizzard, which is a common sight, as Surf + Thunderbolt Staryu is the most common set. Its bulk is good enough to avoid a 2HKO from super effective coverage moves, such as from Nidoqueen, Gastly, Seaking, and Staryu. Vileplume isn't too bad off in the damage department either, having access to the combination of Swords Dance and Hyper Beam to boost its already respectable Attack and get switch-ins into range of popular revenge killers such as Fearow and Staryu.</p> <p>However, Vileplume is weighed down by weaknesses to common foes such as Fearow, Fire-types, and Drowzee, being outsped by the first two and 2HKOed by all three. Its matchups versus Arcanine and Fearow are particularly poor, as they can shake off the Speed drop from paralysis with Agility and take paltry damage from all of Vileplumes unboosted attacks, with even +2 Hyper Beam only 2HKOing them both. It's also completely unable to meaningfully damage Gastly, which outspeeds it and can either put it to sleep with Hypnosis or 3HKO it with Psychic. Vileplume's Speed is also incredibly mediocre, only outspeeding Drowzee, Graveler, Omanyte, and unboosted Porygon. This, in tandem with its weaknesses to many common attacking types, makes it hard for Vileplume to effectively attack despite its good bulk.</p>",
    "comments": "<h3>Other Options</h3> <p>Mega Drain can be used in place of Stun Spore to OHKO Graveler 53.8% of the time and 2HKO the uncommon Omanyte, which otherwise wall Vileplume. It also 3HKOes Staryu and 4HKOes Seaking. However, the cost of giving up Stun Spore makes Mega Drain generally unadvised. Body Slam can be used in place of Stun Spore or Hyper Beam, as it can still spread paralysis and does not risk a recharge turn. However, this is less consistent than Stun Spore and far less damaging than Hyper Beam, and Vileplume doesn't usually get enough turns on the field to make the most out of the lack of recharge. Body Slam also can't paralyze Normal-types, which is awful for Vileplume, as they can set up Agility while Vileplume can do next to nothing in return. A set consisting of dual status, Body Slam, and Mega Drain can be used, but this is generally ill-advised, as it lacks firepower and does pitiful damage to Fire-types and Fearow, though they despise status. Weepinbell outclasses Vileplume as an attacker with Grass STAB thanks to its access to Razor Leaf.</p> <h3>Checks and Counters</h3> <p><strong>Gastly</strong>: Although Gastly hates getting statused, it completely walls Vileplume, as it's immune to Hyper Beam. Gastly can comfortably 3HKO it with Psychic in return or retaliate with Hypnosis.</p> <p><strong>Fire-types</strong>: Rapidash, Arcanine, and Magmar 2HKO Vileplume with Fire Blast, with Rapidash being able to chip it down with Fire Spin into Fire Blast KO range if need be. Vileplume only usually ends up getting one +2 Hyper Beam versus them before going down. However, Rapidash and Magmar are hamstrung by paralysis, and Arcanine also dislikes it.</p> <p><strong>Fearow</strong>: Fearow 2HKOes Vileplume with Drill Peck and can use Agility to set up on Vileplume and cancel out the Speed drop from paralysis. Vileplume's only way of dealing any meaningful damage back is through a +2 Hyper Beam. Fearow has to set up Agility on the turn before it KOes Vileplume or Vileplume can reapply its Speed drop. However, this ruins Fearow as a revenge killer later, forcing it to stay in and trade versus foes such as Nidoqueen or Arcanine.</p> <p><strong>Psychic-types</strong>: Drowzee and the uncommon Abra both cleanly 2HKO Vileplume with Psychic; the former takes paralysis decently well, and the latter outspeeds it. However, Abra is ruined by paralysis and is almost OHKOed by an unboosted Hyper Beam, and Drowzee is vulnerable to being put to sleep because of Vileplume's higher Speed.</p> <p><strong>Ice- and Psychic-type Coverage</strong>: Pokemon sporting Ice-type coverage, such as Nidoqueen, Blizzard variants of Seaking and Staryu, and Dragonair can 3HKO Vileplume, though all of these foes must be wary of status moves. Staryu with Psychic also rarely 3HKOes Vileplume and can potentially drop its Special to guarantee the 3HKO.</p>",
    "sets": {
      "Bulky Status Spreader": {
        "description": "<h4>Set Description</h4> <p>Dual status is Vileplume's bread and butter combo, letting it induce sleep on an opposing Pokemon with Sleep Powder then paralyze the switch-in with Stun Spore for a powerful one-two punch. Vileplume can either use Swords Dance in front of a sleeping foe or Stun Spore immediately to predict an incoming foe, as the threat of Swords Dance is usually enough to force a sleeping Pokemon out. +2 Hyper Beam does good damage to all Pokemon barring Gastly and Rock-types, letting Vileplume get foes into range of a strong revenge killer such as Fearow, Nidoqueen, or Staryu. Swords Dance also has the benefit of reapplying the foe's Speed drop from paralysis, letting paralyzed Vileplume outspeed faster paralyzed foes and preventing the foe from using Agility to ignore the Speed drop.</p> <p>Vileplume needs support to handle Fearow, Fire-types, and Graveler effectively. Rock-types such as Graveler and Omanyte make good partners with Vileplume, as they can both wall Fearow, with the latter also walling Fire-types. However, this combination is extremely weak to Nidoqueen and Blizzard users. Blizzard Seaking also makes a great partner to Vileplume, as Vileplume can switch into Surf + Thunderbolt Staryu and incapacitate it with status, letting Seaking sweep unhindered later on, and Seaking helps handle Fire and Rock-types. Vileplume also makes a good partner to Staryu, as it can paralyze faster Pokemon that could give Staryu issues, such as Fearow and Arcanine. It also gets many Pokemon into Staryu's KO range with +2 Hyper Beam. Vileplume can use its status spreading capabilities to support and clear the way for wallbreakers and cleaners such as Nidoqueen and Fearow. Vileplume also helps support slower wallbreakers, such as Graveler.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 625260, "username": "NotVeryCake"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 535530, "username": "Gangsta Spongebob"}, {"user_id": 540559, "username": "gastlies"}]}, {"name": "Grammar checked by", "members": [{"user_id": 583793, "username": "Sabelette"}]}]}
  },
  "Parasect": {
    "overview": "<p>Parasect is the only fully-evolved Pokemon in RBY with access to Spore, giving it the most consistent Double Powder combination in the game. It also has access to Swords Dance to boost its damage output with Hyper Beam, which can be effective with paralysis support from its teammates. Defensively, Parasect has resistances to Ground, Water, and Electric, meaning it can situationally switch in on Pokemon like Machamp, Seaking, and Staryu. Parasect is also generally unfazed by paralysis, making it a decent early-game status absorber. With these strengths, combined with RBY's brutal sleep mechanics, one would be forgiven for thinking Parasect can work in RBY PU.</p> <p>However, Parasect is entirely outclassed by other sleepers such as Gastly, which has some Speed to back up its Hypnosis, or Drowzee, which has a better typing. This combined with many teams choosing not to use a sleeper at all makes Parasect not worth using. In addition, Parasect's stats are all-around mediocre; its Speed is tied for the lowest among all fully evolved Pokemon. Its terrible typing also makes it very easy to OHKO. This especially applies in RBY PU, a tier filled with powerful Fire-types, such as Rapidash and Arcanine, to prey on its 4x Fire weakness, and other Pokemon like Fearow and Nidoqueen feast on its poor defensive typing as well. Unfortunately, Parasect's positive traits aren't nearly enough to give it a niche in the tier; it should not see use on any serious competitive team.</p>",
    "sets": {
      "Setup Sleeper": {
        "description": "<p>Parasect's game plan is simple: put something to sleep with Spore, then cripple something else with Stun Spore as soon as possible. After this, it can come back late-game when the opposing team is paralyzed and weakened and go on the offensive. Swords Dance reapplies an opposing Pokemon's Speed drop from paralysis, which helps if Parasect has been used to absorb paralysis itself. Hyper Beam is surprisingly powerful at +2, OHKOing Drowzee and Staryu; it can also KO Dragonair, Fearow, and Porygon if they have taken even slight chip damage. Body Slam is a suitable alternative to either of these moves for reliability and the ability to spread more paralysis, letting Parasect serve a more supportive role.</p> <p>If you must use Parasect, it's best used on teams that hinge on a strong late-game sweeper such as Fearow or Pinsir. Its entire existence hinges on Spore, so the move should never be dropped. While Slash may seem enticing for immediate power, it only lands a critical hit 46.88% of the time because of Parasect’s horrendous Speed, making it unviable. STAB Mega Drain lets Parasect 2HKO Omanyte and Graveler while regaining some HP, but its utility outside of this is questionable. Toxic can be used over Stun Spore to incapacitate partial trapping users such as Dragonair and Rapidash, but whether Parasect gets the opportunity to do this without being KOed or forced out the next turn is another matter.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 509438, "username": "Ctown6"}, {"user_id": 96315, "username": "phoopes"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 535530, "username": "Gangsta Spongebob"}]}, {"name": "Grammar checked by", "members": [{"user_id": 583793, "username": "Sabelette"}]}]}
  },
  "Primeape": {
    "overview": "<p>High base Attack and Speed combined with solid offensive tools grant Primeape a decent offensive presence. It's capable of threatening just about everything in the tier with either super effective coverage or Body Slam paralysis. Additionally, it's one of the few Pokemon that can reliably 2HKO Porygon with its STAB Submission. However, its bulk is quite poor, so the majority of the tier can 2HKO or 3HKO it. It's also very weak to paralysis, limiting its ability to actually break though defensive pieces like Porygon. To make matters worse, Primeape's offensive presence has major flaws. Body Slam's paralysis chance is often not enough to justify using a Pokemon that deals little damage to common bulky threats like Nidoqueen and Machamp. Its Speed, while fast, fails against the omnipresent Rapidash and Fearow. While it can force paralysis on some important Pokemon and sometimes even get a KO, teams typically prefer offensive threats with higher reward, and thus it's recommended that players avoid using Primeape.</p>",
    "comments": "<h3>Other Options</h3> <p>Since Body Slam is still quite threatening to Fire-types, Thunderbolt can be used over Rock Slide. It still 3HKOes Fearow and is Primeape's strongest attack against Slowpoke. Against other Water-types, Thunderbolt and Submission deal similar damage, but Thunderbolt lacks recoil and has much better accuracy. However, Primeape struggles to damage Pinsir without Rock Slide. Low Kick can flinch past some bulky threats when combined with paralysis support, but this strategy is very inconsistent and Low Kick has little use otherwise. Counter can 2HKO some would-be checks like Pinsir and Machamp, but it is very prediction-reliant and has little use against most other threats.</p> <h3>Checks and Counters</h3> <p><strong>Fearow</strong>: Fearow is immune to paralysis from Body Slam and can outspeed and 2HKO Primeape with Drill Peck. However, it has a 16.2% chance to be 2HKOed by Rock Slide.</p> <p><strong>Rapidash</strong>: Rapidash outspeeds Primeape and has a 55.2% chance to 2HKO it with Fire Blast, which also threatens to burn it. In return, Primeape can only 3HKO with Rock Slide. However, Rapidash must watch out for a Body Slam paralysis.</p> <p><strong>Bulky threats</strong>: Machamp is only 4HKOed by Submission and takes less than 40% from Hyper Beam, and it can 3HKO Primeape with its Submission or Earthquake. Nidoqueen can 2HKO Primeape with Earthquake, and Primeape's Body Slam is only a 5HKO in return; Hyper Beam deals less than 40% to Nidoqueen.</p> <p><strong>Gastly</strong>: Gastly is immune to or takes minimal damage form all of Primeape's attacks barring Rock Slide, which can only 3HKO it, while Gastly can 2HKO with Psychic.</p> <p><strong>Paralysis</strong>: The vast majority of the tier has little issue breaking through Primeape's low defenses once its Speed is gone. Common Thunder Wave users like Dragonair and Drowzee easily tank two hits from Primeape and paralyze it back. While Porygon does not want to lose over half its health from Submission, it can also take a hit and paralyze Primeape in a pinch.</p>",
    "sets": {
      "All-out Attacker": {
        "description": "<h4>Set Description</h4> <p>Submission serves as Primeape's main STAB attack and lets it 2HKO some defensive Pokemon like Porygon, Omanyte and Graveler. Body Slam is Primeape's most spammable attack and lets it fish for paralysis against switch-ins. Hyper Beam is Primeape's most powerful attack, letting it finish off weakened threats that are out of range of its other attacks, such as Dragonair and Drowzee below half HP and Nidoqueen and Machamp below 40%. It also lets Primeape OHKO Abra. Rock Slide hits Fire-types, Pinsir, and Fearow for super effective damage, usually 3HKOing them.</p> <p>Rapidash and Fearow outspeed Primeape and can easily overwhelm it, so Omanyte is a great partner for its ability to switch into them. Gastly can also pivot into all of Primeape's attacks barring Rock Slide and win the one-on-one with Psychic, which makes Abra and Drowzee good partners. Drowzee has the added benefit of switching into Thunder Wave users fairly well, which helps Primeape avoid getting paralyzed. Primeape struggles to break though Nidoqueen and Machamp; your own Machamp and Fearow, respectively, can be used to handle those dangerous threats.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 535530, "username": "Gangsta Spongebob"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 583793, "username": "Sabelette"}, {"user_id": 96315, "username": "phoopes"}]}, {"name": "Grammar checked by", "members": [{"user_id": 583793, "username": "Sabelette"}]}]}
  },
  "Arcanine": {
    "overview": "<p>Arcanine's immense base stat total provides it with huge bulk, excellent Speed, and respectable power, making it a contender for the best Pokemon in PU and capable of fulfilling nearly every role a team could ever want. It is only outsped by Rapidash, Scyther, and Fearow, and its access to the incredibly spammable Fire Blast and Body Slam combined with a high critical hit rate makes it exceptionally difficult to switch into and reliably beat one-on-one. Arcanine notably dominates the lead metagame, and while most opposing leads are specifically chosen for their good matchup against Arcanine, they still often lose due to critical hits and status from Fire Blast and Body Slam. Arcanine is equally effective in the back, acting as a fantastic revenge killer, mid-game progress maker, and late-game sweeper. Arcanine does have competition from other Fire-types like Rapidash and Magmar, though its great balance of stats make it the premier choice out of the three, especially since its higher bulk means it's less troubled by Fire Blast misses. However, Arcanine's dominance means that every viable team has some plan to deal with it. Arcanine simply has no way to break through the uncommon Omanyte, which has the typing and bulk to stonewall it. Even without Omanyte, teams typically have no shortage of Water- and Ground-types to deal with Arcanine; notably, Nidoqueen and Seaking are on almost every team, and Staryu is extremely common as well. Arcanine's sheer excellence makes it an instant inclusion on a majority of teams, but it can only do one role at a time and needs its teammates to handle inevitable poor matchups it will face in a game.</p>",
    "comments": "<h3>Other Options</h3> <p>Arcanine's attacking moves are pivotal to its success, so dropping Agility or Reflect is the preferred course of action. Arcanine can exploit switches it forces to set up Substitute, which can sometimes give it an extra hit against foes such as Seaking, Nidoqueen, and Machamp, often flipping the matchup. Magmar notably cannot break Arcanine's Substitute without Seismic Toss or Hyper Beam. However, it doesn't meaningfully help against Omanyte in any way nor guard against Thunder Wave, and guessing wrong will do nothing but deprive Arcanine of longevity. Flamethrower can be used alongside Fire Blast in situations where Arcanine prefers the higher accuracy, and it mitigates the risk of Fire Blast being PP stalled, though generally Arcanine gets more use from other moves and PU's fast pace means PP stalling is a rare sight. Arcanine can drop Hyper Beam in favor of Rest alongside Reflect to allow it to wall foes such as itself and Rapidash. However, it is extremely passive while asleep, and it is easily overwhelmed by foes such as Nidoqueen, Staryu, and Omanyte or even set up on by Pokemon like Scyther and Seaking. Toxic initially seems like a good option to break through Omanyte, but without a partial trapping move Arcanine has no effective means to rack up damage.</p> <h3>Checks and Counters</h3> <p><strong>Omanyte</strong>: Omanyte is Arcanine's worst matchup, as it takes minimal damage from all of Arcanine's attacks, absorbs burn and paralysis well, and can 2HKO Arcanine back with Surf. Graveler is only 4HKOed by Fire Blast and 2HKOes back with Earthquake. However, it must be wary of being burned by Fire Blast.</p> <p><strong>Seaking</strong>: Arcanine has very low odds to 3HKO Seaking with a combination of Body Slam and Hyper Beam, while Seaking can set up Agility and 2HKO Arcanine back. However, it dislikes Body Slam paralysis even if it can eliminate the Speed drop with Agility, and Arcanine's high critical hit rate can let it come out on top.</p> <p><strong>Ground-types</strong>: Nidoqueen is only 3HKOed by Fire Blast, and Sandslash is only 2HKOed 32.8% of the time; they both can 2HKO Arcanine with Earthquake, and Sandslash OHKOes it after a Swords Dance. However, both Ground-types lose one-on-one if Arcanine is able to get up Reflect at full health, and they also must be wary of a burn, making these matchups more even than they'd initially seem.</p> <p><strong>Paralysis</strong>: Arcanine is reliant on its Speed to defeat foes such as Staryu and Drowzee, and thus it loses once it's paralyzed. Arcanine normally can still deal significant damage to checks like Nidoqueen and Seaking, if not win outright with burn or paralysis, but this is usually denied to it when it's outsped. Arcanine can remove the Speed drop with Agility, but it must use a turn to set it up every time it switches in, and a single turn of full paralysis can ruin Arcanine.</p>",
    "sets": {
      "Bulky Attacker": {
        "description": "<h4>Set Description</h4> <p>Fire Blast is Arcanine's strongest attack against most of the tier, and its burn chance potentially ruins checks like Nidoqueen and Machamp. Body Slam lets Arcanine spread paralysis and provides a spammable option against Fire-resistant Pokemon like Staryu, Rapidash, Dragonair, and opposing Arcanine. Hyper Beam is used as a powerful finisher to KO Fire-resistant foes and physically frail threats such as Staryu and Drowzee; it notably OHKOes the rare Abra. Agility negates the Speed drop from paralysis, which Arcanine will often take checking opposing Arcanine and other paralysis spreaders, and in some situations Arcanine can use it to be a late-game cleaner, allowing it to outspeed Fearow, Rapidash, Scyther, and opposing Arcanine. Arcanine can notably freely set up Agility on burned physical attackers like Nidoqueen, since this reapplies the Attack drop from burn. Alternatively, by using Reflect to augment its physical bulk, Arcanine can improve the matchup against opposing Fire-types and Nidoqueen. Notably, if it can set up Reflect without taking damage against Nidoqueen and Machamp, it flips the matchup and is now favored to win regardless of burn.</p> <p>Arcanine should be included on the vast majority of teams as a lead, mid-game wallbreaker, or late-game cleaner. Arcanine is PU's most common lead; even if faced with a lead that can 2HKO it, such as Nidoqueen, it's best off spamming Fire Blast to aim for a burn or at least to weaken them into revenge killing range. Lead Porygon can take on Arcanine by spamming Recover to PP stall Fire Blast and slowly beat it one-on-one. Arcanine is usually best off switching out against it. Oftentimes Arcanine will end up facing another Arcanine; usually both Arcanines will spam Body Slam until one gets paralyzed—in which case it'll use Agility if it has it —before one finishes off the other with Hyper Beam. In this case, Reflect variants are favored to win, though generally the winner ends up paralyzed and in KO range regardless. If used mid-game, Arcanine should typically revenge kill a weakened foe like Nidoqueen and Machamp or trade hits with foes like Fearow and opposing Arcanine. If used as a late-game cleaner, it needs Omanyte, Seaking, and opposing Arcanine severely weakened and faster foes like Fearow, Rapidash, and Scyther paralyzed or KOed.</p> <p>No matter Arcanine's role, it tends to invite Omanyte in. Teammates that can take advantage of Omanyte, such as Water-types, Porygon, Gastly, Vileplume, and Drowzee, make great partners. Given that Omanyte's switch ins are very telegraphed, double switching into these Pokemon is the best way to punish its use while keeping Arcanine's team healthy. Seaking is a very troublesome matchup, and the aforementioned Vileplume, Staryu, and one's own Seaking considerably help against it. Omanyte can be paired with Arcanine, allowing it to avoid having to trade with an opposing Arcanine. Omanyte can also thwart revenge killing attempts by Fearow, Scyther, and Rapidash. Paralysis spreaders such as Dragonair and Drowzee can cripple these faster threats, making it easy for Arcanine to finish them off. Arcanine pairs nicely with Rapidash, as one can weaken their shared checks for the other, though both are walled by Omanyte. Magmar is another option—while it's not as fast, it can perform a similar role while also threatening Omanyte.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 535530, "username": "Gangsta Spongebob"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 540559, "username": "gastlies"}, {"user_id": 583793, "username": "Sabelette"}]}, {"name": "Grammar checked by", "members": [{"user_id": 583793, "username": "Sabelette"}]}]}
  },
  "Poliwag": {
    "overview": "<p>Poliwag's blistering base 90 Speed and access to Hypnosis make it the fastest sleeper in the tier. Once it puts something to sleep, it can turn into a dangerous sweeper thanks to Amnesia. However, Poliwag's awful bulk leaves it completely reliant on landing Hypnosis to find any opportunities to set up, rendering it horribly inconsistent. To make matters worse, Poliwag struggles to OHKO targets weak to its Surf at +2, incentivizing further inconsistency by using Hydro Pump to reach these crucial damage rolls. Its Speed, while great, is still worse than several common threats, such as Fearow, Rapidash, and Arcanine. When choosing a sleeper, teams usually prefer the better offensive and defensive utility from Gastly and Drowzee, and Seaking is usually preferred as a Water-type setup sweeper. Thus, Poliwag should be used with extreme caution due to its reward often being lower than its risk.</p>",
    "comments": "<h3>Other Options</h3> <p>Blizzard can be used over Psychic, exchanging the ability to break through Water-types and fish for Special drops to instead hit Fearow and Dragonair for super effective damage and reach higher damage ranges against Grass-types. However, even at +2 Blizzard fails to OHKO Fearow and Dragonair, and Fearow is 2HKOed by +2 Surf anyway.</p> <h3>Checks and Counters</h3> <p><strong>Fearow</strong>: Fearow outspeeds Poliwag and has a 33.3% chance to OHKO it using Hyper Beam, while it can't even OHKO Fearow with +2 Hydro Pump or Blizzard.</p> <p><strong>Water-types</strong>: Barring Special drops, Seaking isn't even 3HKOed by +2 Psychic, and it can KO Poliwag with a combination of Double-Edge and Hyper Beam. Staryu struggles to deal damage to a boosted Poliwag without critical hits and is 3HKOed by +2 Psychic, but it can cripple Poliwag with Thunder Wave. While rare, Slowpoke resists all of Poliwag's attacks, can paralyze it with Thunder Wave, and can use it as setup fodder for its own Amnesia. However, given that they're all slower, these threats must watch out for Hypnosis.</p> <p><strong>Fire-types</strong>: Arcanine can outspeed and 2HKO Poliwag with Body Slam and Hyper Beam, though a +2 Hydro Pump has a 66.7% chance to OHKO it. While +2 Hydro Pump always OHKOes them, Rapidash and Magmar can also outspeed and KO Poliwag using a combination of Body Slam and Hyper Beam. Besides winning the one-on-one, all of these Fire-types can easily revenge kill a weakened Poliwag. However, these Pokemon struggle to switch in due to their weakness to Water.</p> <p><strong>Weepinbell</strong>: Though rare, Weepinbell can easily tank a +2 Psychic or Blizzard and OHKO Poliwag regardless of boosts using Razor Leaf.</p> <p><strong>Paralysis</strong>: Poliwag's paltry initial power leaves it vulnerable to paralysis spreaders like Abra, Vileplume, Dragonair, Drowzee, and Porygon once Sleep Clause is in effect. Once paralyzed, it is easily overwhelmed by most foes due to its low bulk.</p>",
    "sets": {
      "Amnesia Sweeper": {
        "description": "<h4>Set Description</h4> <p>Hypnosis lets Poliwag put a foe to sleep and provides an opening to use Amnesia, which lets it 2HKO most foes and avoid a 2HKO from Thunderbolt and other special attacks. The choice between Hydro Pump and Surf is a matter of power versus consistency; Poliwag is already reliant on a very inaccurate move, further complicating this choice. While both Surf and Hydro Pump 2HKO most neutral targets, like Pinsir, some threats that are 2HKOed by a +2 Hydro Pump, such as Machamp and Porygon, either avoid or have extremely low odds to be 2HKOed by a +2 Surf. Additionally, a +2 Surf is incapable of OHKOing Nidoqueen and Arcanine and has extremely low odds of OHKOing Rapidash, while +2 Hydro Pump has high odds to OHKO the former pair and will always OHKO the latter. Psychic is Poliwag's best attack against Water-types, like Staryu and Seaking; while Hydro Pump does similar amounts of damage, Psychic's higher accuracy and chance for a Special drop give it solid odds to 2HKO the former and 3HKO the latter at +2. It also helps against Grass-types, as after an Amnesia boost it has decent odds to 2HKO Vileplume, and it will always 2HKO Weepinbell.</p> <p>Poliwag is an effective lead due to its high Speed and access to a sleep-inducing move, though it can also be used as an endgame cleaner. Fearow, Rapidash, and Arcanine are common threats that Poliwag loses to quite badly; Omanyte is a great partner, as it switches into all three of them. Paralysis is a great way to handle these faster threats, so Poliwag also appreciates support from Thunder Wave users like Dragonair and Porygon. Fearow, Rapidash, and Arcanine themselves make great partners, as they can trade hits with each other and eliminate the status spreaders that give Poliwag trouble.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 535530, "username": "Gangsta Spongebob"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 583793, "username": "Sabelette"}, {"user_id": 540559, "username": "gastlies"}]}, {"name": "Grammar checked by", "members": [{"user_id": 583793, "username": "Sabelette"}]}]}
  },
  "Abra": {
    "overview": "<p>While Abra may initially seem like one of PU's top threats due to its massive Special, high Speed, excellent Psychic typing, and access to Thunder Wave, the tier is extremely hostile to it, and it's barely viable as a result. Abra is held back by its horrendous physical bulk; while it can outpace every common threat except Scyther, Fearow, Rapidash, and Arcanine, each of these Pokemon can easily OHKO Abra and they are all extremely common. While not as bad of a matchup, slower physical attackers like Pinsir can also beat Abra one-on-one even if they have to take a hit or paralysis first. Teams with Abra can use Rock-types to check faster foes, but they are exploitable, walled by Porygon, and better suited supporting other Pokemon. To make matters worse, despite Abra's higher Special, the Fire-types actually do more damage due to Fire Blast having a higher base power than Psychic. Despite its access to Thunder Wave, Abra's frailty means it fears paralysis more than just about every other Pokemon in PU. Porygon once again greatly harms Abra's viability, as teams are often reliant on spreading paralysis to cripple it, with Abra often getting caught in the crossfire. One notable paralysis spreader is Drowzee, another common foe that both checks Abra and turns it into a liability by threatening to spread status to its teammates. While Drowzee cannot match Abra's Speed and power, it typically outclasses Abra as a Psychic-type paralysis spreader.</p> <p>However, Abra isn't a lost cause, as its aforementioned positive traits do have some use in this metagame. It's extremely hard to switch into if the opponent doesn't have Drowzee or Slowpoke, and the Rock-types can still fulfill their defensive roles even if Porygon walls them. These traits also give it a good matchup against Porygon itself, with Abra able to threaten it with paralysis and its powerful Psychic. However, losing to so much of the metagame makes Abra reliant on excessive amounts of support, and most of the time another Pokemon can do Abra's job with more self-sufficiency.</p>",
    "comments": "<h3>Other Options</h3> <p>Reflect looks like an enticing option to increase Abra's physical bulk, notably letting it dodge OHKOs from the plethora of Hyper Beam users. However, Abra's lack of reliable recovery and the need for a free turn to set it up makes Reflect difficult to use, especially when many Hyper Beam users outspeed Abra. Additionally, Reflect is useless against Pinsir due to Slash, and it can often be useless against Rapidash and Fearow due to their high critical hit rates.</p> <h3>Checks and Counters</h3> <p><strong>Psychic-types</strong>: Drowzee and Slowpoke resist Psychic and are only 4HKOed by Seismic Toss. Both can paralyze Abra with Thunder Wave, and in return they don't mind Abra's Thunder Wave that much. Drowzee can also 3HKO Abra with Seismic Toss. As a result, both Pokemon can switch into Abra with ease and force it to sacrifice itself or make a teammate risk taking status or a powerful attack.</p> <p><strong>Faster Threats</strong>: Scyther, Fearow, Arcanine, Magmar, and Rapidash outspeed Abra; the former three always OHKO with Hyper Beam, and the latter two have a very high chance to OHKO with their own Hyper Beam. Fearow also has a 51.3% chance to OHKO with Double-Edge, and Scyther has a 74.4% chance to OHKO Abra with Slash. However, these threats have difficulty switching into Psychic and hate getting paralyzed.</p> <p><strong>Physical Attackers</strong>: While it's outsped and dislikes being paralyzed, Pinsir is only 3HKOed by Psychic and OHKOes back with Slash. Sandslash is immune to Thunder Wave, 3HKOed by Psychic, and OHKOes Abra with Earthquake 92.3% of the time. Abra outspeeds and 2HKOes Machamp and Graveler, but they can also tank a hit in a pinch and retaliate; the former OHKOes Abra with Hyper Beam, and the latter has a 76.9% chance to OHKO with Earthquake.</p> <p><strong>Thunder Wave Users</strong>: Thunder Wave users such as Staryu, Porygon, and Dragonair can cripple Abra and leave it helpless against every physical attacker in the tier. However, they struggle to tank Abra's Psychic and hate being paralyzed themselves.</p>",
    "sets": {
      "Special Attacker": {
        "description": "<h4>Set Description</h4> <p>Psychic serves as Abra's primary attack, and it's very spammable thanks to Abra's high Special and how few Pokemon resist it. Seismic Toss is Abra's strongest attack against Drowzee, opposing Abra, and the rare Slowpoke. Thunder Wave lets Abra spread paralysis, though it should be used carefully given that the majority of the tier either has a strong physical attack or their own Thunder Wave; many are also more threatened by Abra's Psychic. Thunder Wave is best used when Abra forces something out or when sacrificing Abra is worth paralyzing something back, such as against Porygon. Substitute is another tool to let Abra exploit switches, but it still leaves Abra vulnerable to paralysis. Counter can be used instead to punish foes using physical attacks like Body Slam to predict Abra switching out, but Hyper Beam will often OHKO Abra even at full health.</p> <p>Rock-types, such as Omanyte and Graveler, are near-mandatory partners due to their ability to check Scyther, Rapidash, Arcanine, Fearow, and Magmar, as these threats outspeed and usually OHKO Abra. Notably, the Rock-types force mind games where the faster threat must decide between using Hyper Beam to OHKO Abra before it can cripple them or using another attack against the incoming Rock-type to avoid having to recharge. However, Fearow and Scyther can bypass this to some extent, since they have attacks besides Hyper Beam that can OHKO Abra. The former three threats also make great partners, as they can trade hits with their opposing counterparts and overwhelm slower paralysis spreaders for Abra. Partners that can that can switch into Thunder Wave users, like Nidoqueen and Sandslash, are also very useful. Drowzee deserves a special mention, as it can switch into and beat most other Thunder Wave users, trade with itself, and even cripple some faster offensive threats in a pinch.</p> <p>Abra is typically used as a wallbreaker or cleaner. If used as a wallbreaker, Abra is best used to KO or weaken defensive checks to support endgame cleaners, such as Fearow and Pinsir. Abra can also use Thunder Wave to cripple defensive Pokemon, notably preventing Staryu from stonewalling Seaking and stopping Porygon from checking Nidoqueen. Beyond the threat of paralysis, Abra remains threatening to Recover users, since Psychic can accumulate Special drops and eventually break past them. If used as a cleaner, Abra needs the opposing team sufficiently weakened and opposing Rapidash, Arcanine, Magmar, and Fearow paralyzed or KOed. In either role, Abra struggles to break past Drowzee and Slowpoke, and Porygon can paralyze it and wall the Rock-types, so support from physical wallbreakers, such as Fearow and Pinsir, is necessary.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 535530, "username": "Gangsta Spongebob"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 583793, "username": "Sabelette"}, {"user_id": 540559, "username": "gastlies"}]}, {"name": "Grammar checked by", "members": [{"user_id": 583793, "username": "Sabelette"}]}]}
  },
  "Machamp": {
    "overview": "<p>Machamp is a decent blanket check and progress maker in RBY PU due to its decent bulk, base 130 Attack, and decent coverage. It can switch into Nidoqueen, Graveler, and Omanyte and threaten them out with super effective damage, while they threaten Machamp much less in return. Notably, Machamp reliably 2HKOes Nidoqueen with Earthquake while avoiding a 3HKO in return. Although Graveler and Omanyte threaten a 3HKO on Machamp, both are slower and 2HKOed by Earthquake. Machamp's bulk allows it to go toe-to-toe with Pokemon such as Staryu and Porygon, and Machamp can also stop late-game cleaners like Seaking and Scyther with its impressive bulk and Body Slam paralysis chance. Once on the field, Machamp is difficult to force out, as its checks, barring Fearow, cannot switch in safely. While Machamp is outpaced by much of the metagame, its base 55 Speed still gets the job done against noteworthy Pokemon such as Drowzee, Graveler, and Porygon.</p> <p>However, Machamp's Speed is its defining flaw. If given free entry, fast attackers like Fearow can easily force out Machamp with Drill Peck, and if Machamp is at low health, Pokemon like Gastly, Rapidash, Nidoqueen, and Staryu can KO it. While Machamp can switch into a lot of the metagame with its bulk, it can only afford to do so once per game since it gets worn down easily. Even small amounts of chip damage render Machamp incapable of switching into threats, so Machamp tends to get sacrificed for momentum after its first entrance. Similarly, while Machamp's typing means some foes, like Nidoqueen and Arcanine, cannot touch it for super effective damage, its Fighting typing gives it few relevant resistances while giving it a crippling weakness to Drill Peck and Psychic. Machamp's low Speed and role as a switch-in also means that it is often on the receiving end of a burn from Fire Blast or a critical hit from faster foes. Machamp's coverage, while decent, is somewhat prediction-reliant. Earthquake, Rock Slide, Body Slam, and Submission all give free entry to much of the metagame, allowing the opponent to dance around Machamp's coverage and maneuver in something with a better matchup. Pokemon like Gastly and Nidoqueen are only threatened by Machamp's Earthquake, which Fearow can take advantage of. Fearow greatly affects how Machamp is played, as Fearow gaining entry is disastrous due to its one-sided matchup on Machamp. Once Fearow is on the field, the Machamp player is often forced to sacrifice a Pokemon due to Fearow's immense offensive presence. Otherwise-decent moves like Body Slam and Earthquake become risky to use due to the threat of Fearow switching in.</p>",
    "comments": "<h3>Other Options</h3> <p>Low Kick is an option to 2HKO Porygon and Omanyte while carrying a 30% chance to flinch. However, Low Kick is still inaccurate and its Base Power is so low that in many situations it is better to use Body Slam for more power. Low Kick also does not deal enough damage to allow Machamp to KO Fearow with Hyper Beam afterward. Fire Blast is another option, but since its main targets, Pinsir and Vileplume, are uncommon, it is not worth using. Fire Blast can also fish for a burn on Fearow, but in most situations it is better to do as much damage as possible with Hyper Beam or Rock Slide.</p> <h3>Checks and Counters</h3> <p><strong>Fearow</strong>: Fearow is by far the biggest reason not to use Machamp. Fearow is so offensively potent that giving it free entry often guarantees losing a Pokemon. Fearow takes little from Body Slam, is immune to Body Slam paralysis, and is immune to Earthquake, while Fearow's Drill Peck is a likely 2HKO on Machamp. Fearow also has a high critical hit rate, meaning it is not rare to see it OHKO Machamp with Drill Peck. For the Machamp user to defeat a Fearow, Machamp needs to hit Fearow with Submission or Rock Slide as it switches in, avoid being OHKOed by a critical hit Drill Peck, and then land a Hyper Beam or Rock Slide. This is a favorable trade for Machamp, but a single miss or critical hit can flip this interaction on its head, and Machamp loses much of its defensive value after taking one Drill Peck.</p> <p><strong>Revenge Killers</strong>: Once at low health, there is no shortage of revenge killers that can come in and finish off Machamp, such as Nidoqueen, Arcanine, Gastly, and Fearow. If Machamp is paralyzed, Drowzee and Graveler can also come in and KO it.</p> <p><strong>Burns</strong>: Despite hitting them super effectively with Earthquake, Machamp must be wary of Rapidash and Arcanine since they have a 30% chance to inflict a burn with Fire Blast, which ruins Machamp.</p> <p><strong>Sleepers</strong>: Machamp cannot 2HKO Vileplume, and Vileplume can safely switch in and use Sleep Powder, even if Machamp is carrying Fire Blast. Gastly can switch into a Submission or Body Slam and use Hypnosis or deal significant damage with Psychic. Drowzee loses one-on-one, but a single Psychic allows Machamp to be easily revenge killed.</p>",
    "sets": {
      "Bulky Attacker": {
        "description": "<h4>Set Description</h4> <p>Earthquake 2HKOes Nidoqueen, Graveler, Rapidash, and Arcanine, and they are incapable of 2HKOing in return. It deals significant enough damage to deter Drowzee and Staryu from switching in. Machamp can OHKO Gastly with Earthquake while surviving even a critical hit Psychic. Body Slam is a midground option that can paralyze Staryu or Seaking. Hyper Beam can finish off foes like Drowzee, Staryu, and Dragonair. Also, Fearow is usually KOed by Hyper Beam after taking a Submission or Rock Slide beforehand. Submission primarily hits Porygon for huge damage and is a decent midground option against Graveler and Omanyte to deny Fearow a free switch-in due to the fear of a subsequent Hyper Beam. However, Submission has a dreadful 80% accuracy, and recoil often puts Machamp in range of a Fearow Drill Peck. Lastly, Rock Slide mainly is used to 2HKO Fearow and OHKO Scyther 25% of the time. However, dropping any of Machamp's moves for Rock Slide is not advised due to how important each of its other moves are.</p> <p>Machamp is best used as a switch-in to Nidoqueen, Graveler, and Omanyte. All of them are terrified by Earthquake, and the Rock-types can be hit with Submission, which deters Fearow from switching in. Machamp can also come in on Porygon and threaten it for upwards of 78%. Once in, Machamp is best used as a mid-game progress maker by throwing out powerful attacks and leveraging Machmap's impressive bulk. Very little can safely switch into Machamp bar Fearow, which means that Omanyte and Graveler, which can switch into Fearow, are great partners to Machamp. In return, Machamp can switch into Nidoqueen's Earthquake for Omanyte and Graveler. However, it may be worthwhile to sacrifice a Pokemon to give Machamp free entry against Nidoqueen in order to minimize the chances of a critical hit or freeze. Bar switching Rock-types in on Fearow, it is discouraged to switch Machamp out of the field because once weakened, Machamp has a hard time coming back in without sacrificing another Pokemon. Machamp can also switch into Staryu's Thunder Wave or Surf directed at Graveler, since it does not mind paralysis as much as its teammates, as its slow Speed means it doesn't lose too many important matchups once paralyzed; paralysis also insulates Machamp from getting burned. However, a paralyzed Machamp is slower and more afraid of Graveler and Drowzee, as they can usually beat Machamp one-on-one. Paralysis also makes Submission even less likely to hit.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 624543, "username": "Wanted in 49 States"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 535530, "username": "Gangsta Spongebob"}, {"user_id": 540559, "username": "gastlies"}]}, {"name": "Grammar checked by", "members": [{"user_id": 583793, "username": "Sabelette"}]}]}
  },
  "Weepinbell": {
    "overview": "<p>Thanks to its access to the \"Double Powder\" combination, Weepinbell threatens the entire tier with reliable enough status. Its ability to spread paralysis also pairs nicely with Wrap. While its Speed is poor, it still outpaces notable foes like Drowzee, Porygon, Omanyte, and Graveler; the latter two are OHKOed by Weepinbell's Razor Leaf. However, besides these useful applications, Weepinbell has few other positives to it.</p> <p>While it can eke out some defensive utility using its Water and Electric resistances against Seaking and some Staryu, Weepinbell is a huge defensive liability owing to its bad bulk and typing. Its awful Fire, Flying, Psychic, and Ice weaknesses mean it gets demolished by common threats like Rapidash, Arcanine, Fearow, Gastly, and Nidoqueen. Its poor Speed adds to its woes, usually leaving it outsped and forced to take a hit before doing anything. To make matters worse, while its Razor Leaf destroys threats weak to it, it doesn't do enough damage to save it against neutral targets like Nidoqueen, and it struggles to deal notable damage to Grass-resistant Pokemon like Rapidash, Pinsir, Gastly, and Fearow.</p> <p>Weepinbell also has heavy competition from other status spreaders. Drowzee may be slower, but its Thunder Wave is more reliable and its Psychic-typing grants it both a better offensive and defensive presence. While Vileplume is even less offensively threatening than Weepinbell, its enormous bulk lets it spread status more effectively. Thus, despite the fact that Weepinbell is almost impossible to reliably check without taking status, it offers little else, and thus other status spreaders should be considered before it.</p>",
    "comments": "<h3>Other Options</h3> <p>Swords Dance combined with Double-Edge makes Weepinbell much more threatening, but its offensive prowess is still subpar, and Weepinbell has to give up valuable utility to fit those moves.</p> <h3>Checks and Counters</h3> <p><strong>Fire-types</strong>: Rapidash, Arcanine, and Magmar take minimal damage from Weepinbell's Razor Leaf and can 2HKO it with Fire Blast. Rapidash and the rare Flareon can even chip Weepinbell with Fire Spin, only needing one or two hits to get it into KO range.</p> <p><strong>Faster Attackers</strong>: Abra outspeeds Weepinbell and 2HKOes it with Psychic while also threatening it with Thunder Wave. Nidoqueen outspeeds and almost always 2HKOes Weepinbell with Blizzard or Fire Blast and is only 3HKOed by Razor Leaf.</p> <p><strong>Grass-resistant Foes</strong>: While Gastly almost never 2HKOes Weepinbell with Psychic, it resists Razor Leaf and is immune to Wrap, letting it stonewall Weepinbell. Fearow outspeeds and 2HKOes Weepinbell with Drill Peck while taking negligible damage from Razor Leaf. Pinsir resists Razor Leaf and outspeeds and 2HKOes Weepinbell with Slash.</p>",
    "sets": {
      "Double Powder": {
        "description": "<h4>Set Description</h4> <p>Sleep Powder and Stun Spore let Weepinbell spread sleep and paralysis. Wrap lets Weepinbell pivot around and wear down slower threats, such as Porygon, Drowzee, and paralyzed foes. Stun Spore and Wrap form a potent combination if Weepinbell can remain unparalyzed. Razor Leaf is Weepinbell's primary STAB attack and notably lets it OHKO Staryu, Graveler, and Omanyte, as well as the rarer Slowpoke and Poliwag. Razor Leaf also 2HKOes other Grass-weak targets, like Seaking.</p> <p>Weepinbell has horrible matchups against Fire-types and Fearow, so Omanyte is an essential partner for its ability to switch into them. In return, Weepinbell can status Porygon, which otherwise would stonewall Omanyte. Gastly and Abra also give Weepinbell a good deal of trouble, so Drowzee is useful for its ability to check them. Pinsir can 2HKO Weepinbell with its powerful Slash, so Fire-types and Fearow make good teammates to help Weepinbell handle it. Nidoqueen is another problematic matchup, but it can be checked by Machamp and Porygon.</p> <p>Weepinbell's most potent tool is Sleep Powder, so it's often best that players try to get Weepinbell on the field as quickly as possible to get an early lead. It must be wary of using Wrap recklessly, as it can let opposing players burn sleep turns with little risk. While threats like Rapidash and Gastly despise Weepinbell's status, it can't threaten them otherwise, so it's reliant on its team to get past these threats. Weepinbell hates getting paralyzed, as it renders its Wrap useless and leaves it outsped by Drowzee and Omanyte, though in some instances it's worth it, such as if Weepinbell trades paralysis with Porygon.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 535530, "username": "Gangsta Spongebob"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 583793, "username": "Sabelette"}, {"user_id": 96315, "username": "phoopes"}]}, {"name": "Grammar checked by", "members": [{"user_id": 583793, "username": "Sabelette"}]}]}
  },
  "Graveler": {
    "overview": "<p>Graveler cements a role in the tier thanks to its high physical bulk and Rock typing, which make it a near-perfect counter to the ubiquitous Fearow as well as the less common but still deadly Scyther. A healthy Graveler can effortlessly switch into all of their attacks, taking a maximum of 17.8% from Scyther's Slash, 17.2% from Fearow's Double-Edge, and 25.8% from Fearow's normally devastating Hyper Beam. Graveler’s role in the tier isn’t strictly defensive, though. STAB Earthquake and Rock Slide give Graveler perfect coverage, and thanks to its high Attack, it is able to 2HKO many foes.</p> <p>Graveler is held back by its poor Speed and special bulk. It only outspeeds the rare Slowpoke and Speed ties Omanyte. These traits make it very difficult for Graveler to handle special attackers. It is notably outsped and walled by Porygon, which can switch into Graveler and threaten it with Blizzard. Graveler is OHKOed by Surf from Seaking, Staryu, and Dragonair, and it has a 40.7% chance to be 2HKOed by Drowzee's Psychic. This special frailty is exacerbated by Graveler’s fear of burn. Despite Graveler's resistance to Fire, it cannot switch into Rapidash or Arcanine's Fire Blast effectively. This weakness gives it competition with Omanyte, as the latter is able to switch into the Fire-types much more reliably. However, Graveler is much harder to switch into, since Seaking, Staryu, and Gastly are all very common Pokemon that take little damage from Omanyte's STAB moves. Additionally, Graveler's greater physical bulk makes it much more reliable against Fearow, as Omanyte can be ruined by a critical hit. Graveler also has Counter which can force Fearow into an uncomfortable prediction game, as well as Explosion, which can dent a bulky opponent, such as Porygon or Machamp. Overall, Graveler makes an excellent check to the ubiquitous Fearow, but its flaws make it difficult to fit on most teams.</p>",
    "comments": "<h3>Other Options</h3> <p>Due to the perfect coverage of Earthquake and Rock Slide and the sheer power of Explosion, Counter or Substitute should be dropped when considered other options on Graveler. Body Slam can be used to fish for paralysis on a predicted Seaking or Staryu switch, but the extra damage from Earthquake generally makes it the better option. Rest can be used for longevity against Fearow, but a sleeping Graveler is extremely easy to switch into, meaning Rest should be reserved for specific endgames, and is generally not recommended.</p> <h3>Checks and Counters</h3> <p><strong>Water-type Attacks:</strong> Seaking and Staryu both outspeed Graveler and are able to easily OHKO it with Surf. Earthquake 3HKOes Seaking and 2HKOes Staryu, but Staryu can use Recover later to heal off the damage. Although Slowpoke is slower than Graveler, it is also able to OHKO it with Surf. Additionally, Nidoqueen and Dragonair can run Surf to land a surprise OHKO on Graveler.</p> <p><strong>Earthquake Users:</strong> Earthquake users, such as Machamp and Sandslash, 2HKO Graveler with Earthquake while taking little damage in return. Even with an Earthquake weakness of its own, Nidoqueen beats Graveler one-on-one since it's faster.</p> <p><strong>Porygon:</strong> Graveler is one of the few Pokemon Porygon outspeeds, and Graveler is unable to threaten an unparalyzed Porygon at all without using Explosion. Porygon can use Recover to heal off the damage from Graveler's attacks, and it 2HKOes Graveler with Blizzard. Graveler's terrible critical hit rate makes breaking through Porygon with critical hits extremely unlikely.</p> <p><strong>Special Attackers:</strong> Although they cannot switch in, special attackers such as Dragonair and Drowzee outspeed and deal heavy damage to Graveler, often forcing it out.</p> <p><strong>Burn:</strong> Graveler hates being burned, so it has to watch out from Fire Blast from Pokemon it would normally beat, such as Rapidash and Arcanine. They can also freely set up Agility on a burned Graveler, since using Agility will reapply the Attack drop from burn, making Graveler do feeble damage. Graveler struggles to switch into Fire-types as a result, but it is good at revenge killing them, especially once they're paralyzed.</p> <p><strong>Grass-types:</strong> Vileplume and the rare Weepinbell can switch into Graveler and easily KO it. Graveler has an 80.9% chance to 2HKO Weepinbell with Earthquake but Weepinbell OHKOes Graveler with Razor Leaf. Vileplume 2HKOes Graveler with Mega Drain but is bulkier, being 3HKOed by Earthquake. However, Graveler walls Vileplume sets lacking Mega Drain.</p>",
    "sets": {
      "Tank": {
        "description": "<h4>Set Description</h4> <p>Earthquake is Graveler’s strongest move. It easily 2HKOes every Pokemon weak to Ground, including the bulky Arcanine and Nidoqueen, as well as physically frail Pokemon, such as Staryu and Drowzee. Rock Slide hits Scyther, Fearow, and Pinsir, OHKOing the former and 2HKOing the latter two. Counter is used alongside Rock Slide in order to punish Fearow's Hyper Beam; the interaction begins with Graveler switching into Fearow's Hyper Beam and using Rock Slide as Fearow recharges. If Fearow switches out, Graveler can use Counter, which then uses the damage from its own Rock Slide in damage calculation, and OHKO whatever switches in. This leaves Fearow in an uncomfortable prediction situation; stay in and risk another Rock Slide, or switch out and risk a teammate getting KOed by Counter. Substitute can be used instead to ease prediction after Graveler switches into Fearow, as it no longer has to decide whether to use Rock Slide on Fearow or use Earthquake to catch whatever switches in. Explosion deals monstrous damage to any foe that isn’t resistant or immune to Normal. Notably, it has a chance to OHKO Porygon, which otherwise walls Graveler. However, Explosion must be used with caution, as once Graveler explodes, its team will have more trouble checking Fearow.</p> <p>When using Graveler, it is important to keep it healthy until the opposing Fearow is KOed. Since Graveler is forced out by Seaking and Staryu, Pokemon that can switch into them, such as Seaking and Staryu for the former, or Drowzee and Vileplume for the latter, are good teammates. The latter three in particular complement Graveler well since Fearow often revenge kills them, giving Graveler free entry. However, it is important to note that Drowzee and Vileplume are quite slow, so it is important to remedy the Speed issue with faster teammates. Two good teammates for this are Rapidash and Arcanine, since they can also function as secondary checks to Fearow, allowing Graveler to use Explosion more freely. They can also fish for Body Slam paralysis on opposing Fire-types and Seaking, making them much worse at checking Graveler.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 540559, "username": "gastlies"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 535530, "username": "Gangsta Spongebob"}, {"user_id": 583793, "username": "Sabelette"}]}, {"name": "Grammar checked by", "members": [{"user_id": 583793, "username": "Sabelette"}]}]}
  },
  "Rapidash": {
    "overview": "<p>Rapidash's blazing fast Speed gives it an extremely important role in the tier; it is one of only two Pokemon that outspeed Fearow. This in conjunction with a powerful Fire Blast makes Rapidash incredible at revenge killing PU's most dangerous offensive threat, and it is often responsible for stopping what would otherwise be a Fearow sweep. Rapidash does more than check Fearow though; it is a fantastic lead thanks to its ability to fire off powerful attacks and threaten both paralysis and burn. Rapidash also has an excellent offensive profile; its Fire Blast 3HKOes every non-resistant Pokemon, while Body Slam and Hyper Beam coming off a strong base 100 Attack stat threaten every Fire-resistant Pokemon except Graveler and Omanyte. Rapidash's aforementioned fantastic Speed also means it has an incredibly high critical hit rate, and it is a fantastic Fire Spin user.</p> <p>Rapidash's main weakness lies in its frailty. Although it is fantastic at revenge killing Fearow, it does not like switching in, since Double-Edge followed up by Hyper Beam is very likely to KO it. Rapidash's frailty is also exacerbated by Fire Blast's 84.4% accuracy, since one miss could result in Rapidash taking a ton of damage in return. Fire is also not the best defensive typing in PU, since it's weak to Earthquake from Nidoqueen and Machamp as well as Surf from Water-types. One Water-type in particular, Omanyte, completely walls Rapidash and forces it out. Rapidash also hates paralysis, since its high Speed is a huge part in what makes it so powerful. It also faces competition from Arcanine, which does not outspeed Fearow but is much bulkier. Despite these flaws, Rapidash's high Speed gives it a unique role in the tier that no other Pokemon can replicate, and this combined with its strong offensive profile make it one of the most important and dominant Pokemon in PU.</p>",
    "comments": "<h3>Other Options</h3> <p>Toxic can be used in conjunction with Fire Spin to increase the amount of damage each turn, but the unreliability of Fire Spin, the paralysis immunity Toxic provides, and the need to drop one of Rapidash's other moves make Toxic a move that is not recommended on Rapidash. Agility is an option to negate the Speed drop from paralysis, but since Rapidash is already the fastest Pokemon in the tier it doesn't have much other use. Reflect can be used to increase Rapidash's physical bulk, but it is largely outclassed by Arcanine in this role.</p> <h3>Checks and Counters</h3> <p><strong>Water-types:</strong> Omanyte is without a doubt Rapidash's biggest counter. Fire Blast and Body Slam do a maximum of 12.8% and 13.1% to Omanyte, while its Surf easily 2HKOes Rapidash. Rapidash's best method of handling Omanyte without team support is to burn it with Fire Blast as it switches in, then chip its HP with Fire Spin, using the 6.25% each turn from burn as its main source of damage. Seaking and the rare Slowpoke are able to switch into Rapidash and 2HKO with Surf as well, although their lack of a Normal resistance means they can be worn down by Body Slam and Hyper Beam. Although Staryu beats Rapidash one-on-one barring paralysis from Body Slam, its physical frailty gives it a much harder time switching in compared to other Water-types, as Hyper Beam can KO it from 68.8%.</p> <p><strong>Paralysis:</strong> Since Rapidash is reliant on its Speed, paralysis is devastating. Because of this, Rapidash is often forced out by Pokemon it would otherwise beat, such as Drowzee and Dragonair. Rapidash also has to watch out for Body Slam from opposing Fire-types, and it often ends up trading Body Slam paralysis with them.</p> <p><strong>Earthquake Users:</strong> Although they all have trouble switching in and fear burn, Nidoqueen, Machamp, Graveler, and Sandslash are all able to 2HKO Rapidash with Earthquake. In return, Rapidash 3HKOes Nidoqueen and Machamp, 4HKOes Graveler, and has a 38.2% chance to 2HKO Sandslash. Since all of these Pokemon are slow and fear burn, they prefer to deal with Rapidash once its paralyzed.</p> <p><strong>Fire-types:</strong> Rapidash can switch into itself pretty well and trade attacks with the opposing Rapidash, and the winner will likely be paralyzed or at low HP. Arcanine with Reflect and Rest completely walls Rapidash barring critical hits, and even Arcanine without Rest still generally beats Rapidash thanks to its much greater physical bulk, boosted further by Reflect. Magmar often runs Counter, forcing Rapidash to use Fire Blast against it rather than Body Slam. Even if Magmar is not running Counter, simply the threat of the move will force Rapidash to predict. However, Rapidash generally beats Magmar if its already been confirmed to not carry Counter, although Magmar is still able to paralyze Rapidash with Body Slam.</p>",
    "sets": {
      "Offensive": {
        "description": "<h4>Set Description</h4> <p>Fire Blast is Rapidash's strongest move, most notably having a 36.3% chance to 2HKO Fearow. Although these odds seem low, keep in mind Fearow is almost never at full HP due to Double-Edge recoil, meaning Fire Blast will almost always 2HKO also when factoring in Fire Blast's chance to burn and high critical hit rate. Fire Blast's chance to burn also lets Rapidash put up a fight against Earthquake users, such as Nidoqueen and Machamp. Body Slam is a way for Rapidash to fish for paralysis, and it in conjunction with Hyper Beam threatens every Fire-resistant Pokemon except for Graveler and Omanyte. For example, two Body Slams followed up by Hyper Beam can KO Dragonair, which is otherwise 5HKOed by Fire Blast. Fire Spin complements Rapidash's high Speed, but it is important not to use the move recklessly, as it is very inaccurate, and one miss could result in Rapidash taking paralysis or getting hit by a strong attack, neither of which it appreciates. Because of this, Fire Spin is generally recommended only as a pivoting move or when Rapidash is in a pinch. Fire Spin is also good in conjunction with burn from Fire Blast, as it can deal massive chip damage to foes such as Porygon and Omanyte. Rapidash can replace Fire Spin with Stomp to exploit paralysis, as a paralyzed Pokemon getting hit by Stomp has a 47.5% chance to either flinch or get fully paralyzed. Although this is notably less than Fire Spin's 69.5% accuracy, Stomp is much stronger, and unlike Fire Spin, which does nothing if it misses, Stomp still does damage if it doesn't flinch.</p> <p>Rapidash is a crucial part of the lead metagame in PU. It's typically seen as a lead on teams that have a secondary check to Fearow, such as Omanyte and Arcanine, since having a backup Fearow check allows Rapidash to play more recklessly early. Since most common leads resist Fire, such as opposing Fire-types or Dragonair, Rapidash most often uses Body Slam, with Magmar being a notable exception—Rapidash should scout for Counter first. Rapidash can also use Fire Spin to pivot and give an ally a free switch, but this is risky due to the move's poor accuracy. Rapidash handles more unconventional leads, such as Fearow, Abra, and Pinsir quite well. It even does decently against Nidoqueen thanks to Fire Blast's burn chance.</p> <p>Rapidash's unique Speed tier and immense firepower mean it can fit into almost any kind of team. Since Rapidash is completely walled by Omanyte, Porygon is an amazing teammate—it can repeatedly switch in to Omanyte, Recover off damage from its attacks, and threaten it with Thunderbolt. Porygon and Drowzee are great paralysis absorbers and spreaders, meaning they can switch into Thunder Wave for Rapidash and then proceed to spread their own paralysis in return. Arcanine and Magmar are also good teammates, as they can work together overpower shared checks, such as opposing Fire- and Water-types. Arcanine is great at fighting off opposing Fire-types, while Magmar is notably the only Fire-type that can threaten Omanyte. Rapidash can be used as a lead and weaken these foes early, making it easier for another Fire-type to clean up later. Gastly is also a notable teammate, since it can switch into Omanyte fairly well and threaten it with Thunderbolt. It also forces Fearow to use Drill Peck against it, allowing Rapidash to switch directly into Fearow in dire situations, since it is much more likely to survive Hyper Beam after Drill Peck as opposed to Double-Edge.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 540559, "username": "gastlies"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 535530, "username": "Gangsta Spongebob"}, {"user_id": 583793, "username": "Sabelette"}]}, {"name": "Grammar checked by", "members": [{"user_id": 583793, "username": "Sabelette"}]}]}
  },
  "Slowpoke": {
    "overview": "<p>While its stats are mediocre, Slowpoke is blessed with excellent tools that help mitigate this issue and make it a potent offensive threat in PU. Its initially terrible Special can be boosted with Amnesia, turning it into a devastating wallbreaker that can be very hard to KO. While Slowpoke's Speed is the worst in the game, Slowpoke can actually outspeed many foes due to its access to Thunder Wave and a boosting move. Slowpoke's excellent Water / Psychic typing grants neutral coverage against every foe except itself and lets it hit common threats like Nidoqueen and Rapidash for super effective damage. However, Slowpoke's awful base Special and Speed force it to spend multiple turns setting up, providing time for foes to break through or wear it down. This makes Slowpoke an all-or-nothing Pokemon: it often gets only one opportunity per game to set up, and it will rarely sweep due to how much damage it takes in the process. However, when played correctly, Slowpoke can smash through or cripple key pieces of the opposing team, paving the way for a teammate to clean late-game.</p>",
    "comments": "<h3>Other Options</h3> <p>Rest or Reflect can be used over either of Slowpoke's attacking moves. The former increases Slowpoke's longevity, making it easier for it to potentially sweep teams. However, Slowpoke's average physical bulk still leaves it 3HKOed by common foes like Fearow and Nidoqueen. The latter makes it much harder for physical attackers to break through it, but damage can still accumulate quickly over time, and many common physical attackers can bypass this boost through critical hits, such as Fearow and Pinsir. Additionally, only having one attacking move can leave Slowpoke walled by either Psychic-types, like Abra and Drowzee, or Water-types, like Staryu and Seaking. Ice-type moves may initially seem useable, since they target Grass-types and Dragonair, foes Slowpoke has huge trouble with. However, Psychic already hits every viable Grass-type for super effective damage, and if it can land an attack, Thunder Wave is more than enough to ruin Dragonair. Additionally, relying on Ice / Water coverage results in Slowpoke being walled by Water-types, while Ice / Psychic coverage is strictly worse against Psychic- and Fire-types than Slowpoke's STAB combination.</p> <h3>Checks and Counters</h3> <p><strong>Sleep Inducers</strong>: Every unparalyzed sleep user can outspeed Slowpoke and put it to sleep. Notably, Drowzee and Vileplume don't mind paralysis or Slowpoke's unboosted attacks that much, and thus are likely to eventually land sleep. However, other sleepers such as Gastly dislike Slowpoke's attacks and Thunder Wave, letting Slowpoke get past them if it gets lucky.</p> <p><strong>Thunderbolt Users</strong>: Nidoqueen, Gastly, Staryu, and Dragonair can 2HKO Slowpoke with Thunderbolt. However, these foes must be wary of taking Slowpoke's boosted attacks, and all but Nidoqueen hate Thunder Wave.</p> <p><strong>Physical Wallbreakers</strong>: Fearow and Pinsir can easily overwhelm Slowpoke while it's setting up. However, they are liable to take paralysis and significant damage while doing so, and thus they prefer only coming in against Slowpoke to revenge kill it.</p> <p><strong>Weepinbell</strong>: Weepinbell outspeeds Slowpoke, and its Razor Leaf has a 53.8% chance to OHKO with a critical hit. Weepinbell can also easily put Slowpoke into guaranteed KO range using Wrap, and it isn't OHKOed by a +2 Psychic.</p> <p><strong>Partial Trapping</strong>: Every unparalyzed Pokemon with a partial trapping move can outspeed, pivot around, and wear Slowpoke down into KO range. However, many of these, such as Pinsir and Rapidash, rely on very inaccurate partial trapping moves, and thus they need unreasonable amounts of luck to get Slowpoke into KO range from full. Wrap users and Dragonair in particular threaten Slowpoke the most due to Wrap having the highest accuracy out of any partial trapping move.</p>",
    "sets": {
      "Amnesia": {
        "description": "<h4>Set Description</h4> <p>Thunder Wave lets Slowpoke spread paralysis, making its terrible Speed matter less while also aiding its teammates. Amnesia boosts Slowpoke's Special, letting it both hit very hard and take special attacks much better. It also reapplies the Speed drop from paralysis, letting Slowpoke outspeed foes even when it's paralyzed. Psychic and Surf are Slowpoke's two main STAB attacks. The former is more spammable due to its chance to lower the target's Special, while the latter hits opposing Psychic-types for neutral damage and hits Fire- and Ground-types like Rapidash and Graveler super effectively.</p> <p>Slowpoke is best paired with speedy and powerful wallbreakers like Fearow and Pinsir, as it can cripple or KO crucial parts of the opposing team, making it easier for them to sweep. Slowpoke can easily set up on Omanyte, making it an excellent partner to Rapidash and Arcanine. Slowpoke enjoys fellow paralysis spreaders like Abra and Staryu, as they let it skip having to paralyze its foe while setting up, and combined they force more paralysis on the opposing team. Slowpoke can be used as a lead, beating or crippling offensive Fire-type leads, like Rapidash, Arcanine, and Magmar. However, Slowpoke loses quite badly to sleep leads, and it's vulnerable to Dragonair's Wrap. Alternatively, it can be used in the back and enter after a threat like Rapidash or Staryu lacking Thunderbolt gets a KO, forcing the opponent into a difficult situation where they must either sacrifice an important Pokemon or give Slowpoke a free turn.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 535530, "username": "Gangsta Spongebob"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 583793, "username": "Sabelette"}, {"user_id": 96315, "username": "phoopes"}]}, {"name": "Grammar checked by", "members": [{"user_id": 583793, "username": "Sabelette"}]}]}
  },
  "Magneton": {
    "overview": "<p>As the only fully-evolved Electric-type in PU, Magneton has a very unique role—it is the only Pokemon that is able to consistently beat both Fearow and Seaking one-on-one, two of the tier's most dangerous offensive threats. Magneton isn't just relegated to facing these two Pokemon, though; it also beats Staryu and Scyther with ease, and it has a decent matchup against the tier's Fire-types thanks to its access to Thunder Wave and massive base 120 Special. Magneton is also quite bulky; it is overwhelmingly favored to survive Fearow's Double-Edge into Hyper Beam barring critical hits and always survives Scyther's +2 Hyper Beam. On the special side, it is only 4HKOed by Surf from Seaking and Staryu, and 3HKOed by Fire Blast from the Fire-types.</p> <p>Despite all these upsides, Magneton has one critical flaw that prevents it from being one of the top threats in the metagame—it is useless against Nidoqueen. Magneton's movepool is limited to Electric-type moves and Normal-type moves coming off of a measly base 60 Attack, leaving it helpless against Nidoqueen. Nidoqueen can even set up a Substitute against Magneton, as its Hyper Beam only has a 46.2% chance to break the Substitute. This matchup means that Magneton is extremely exploitable if the opponent still has a healthy Nidoqueen, as Nidoqueen coming in for free and forcing Magneton out can be devastating. However, Nidoqueen is used as a lead somewhat often, and not every team carries Nidoqueen, meaning it isn't difficult for Magneton to avoid this matchup. Magneton also faces similar issues versus the less common Graveler, which also effortlessly switches into Magneton and forces it out. Additionally, although Magneton has many favorable matchups, it generally cannot take advantage of all of them in one game, as its low Speed and lack of reliable recovery means it will be worn down over the course a match. For example, if Magneton switches into Seaking's Surf, then takes another Surf as it KOes Seaking, it is now in range for of Fearow's Hyper Beam. Overall, Magneton has many positive traits that make it a solid Pokemon worth using in PU, but its Nidoqueen matchup keeps it from being a top threat.</p>",
    "comments": "<h3>Other Options</h3> <p>Double-Edge can be used to force damage on Nidoqueen without the recharge turn of Hyper Beam, but it is often better to just use Screech or switch out if you anticipate a Nidoqueen coming in. Magneton can run a set of Reflect + Rest to try to wall Fearow and overall give it more longevity, but Fearow's high critical hit rate make this unreliable.</p> <h3>Checks and Counters</h3> <p><strong>Ground-types</strong>: Graveler and especially Nidoqueen are by far Magneton's biggest issues. Magneton is helpless against them and allows them to safely set up a Substitute and force it out. Nidoqueen is also faster than Magneton. Both of these Pokemon are also hard to switch into, and considering how fast-paced PU is, this momentum sink could be disastrous. The rare Sandslash can also switch into Magneton and set up Swords Dance for free.</p> <p><strong>Faster Attackers</strong>: Since Magneton is slow, it can slowly get worn down by faster attackers, even if it beats them one-on-one. Even though Magneton can beat Fearow, Seaking, Scyther, and Staryu, it typically cannot take on all of them in one game, as they will all hit Magneton with damage that it won't be able to heal off. Fire-types make effective revenge killers as well, especially if Magneton is weakened.</p> <p><strong>Vileplume</strong>: The rare Vileplume resists Thunderbolt, taking a maximum of 19.5% while also not taking much from Magneton's Normal-type moves thanks to its high bulk and Magneton's low Attack. This means Vileplume can safely switch into Magneton and use Sleep Powder. Even if Sleep Clause is active, Vileplume is free to set up Swords Dance on Magneton, having a 71.8% chance to OHKO it at +4 Attack.</p>",
    "sets": {
      "Special Attacker": {
        "description": "<h4>Set Description</h4> <p>Thunderbolt is Magneton's most consistent move. It 2HKOes Seaking, OHKOes Staryu, and has a 64.1% to OHKO Fearow and a 79.5% chance to OHKO Scyther. The move also 3HKOes most neutral targets, such as Arcanine and Porygon. Thunder Wave allows Magneton to spread paralysis against faster foes such as Fearow, Fire-types, and boosted Seaking. Hyper Beam is used primarily to finish off a low HP Nidoqueen; for example, it is put into Magneton's Hyper Beam range after taking a Double-Edge followed up by a Hyper Beam from Fearow. Magneton's fourth move is more flexible. Screech is used to catch Nidoqueen on a switch. If Nidoqueen switches into Magneton as it uses Screech, Hyper Beam now does a minimum of 44.9%. However, Magneton still has to take an Earthquake from Nidoqueen in this case. Another option is switching to Fearow on Nidoqueen's Earthquake to threaten a 2HKO with Double-Edge. Thunder has a 64.1% chance to OHKO Seaking, which is an effective 44.5% chance factoring in the move's accuracy. Although these odds are low, it can be useful in certain endgames to preserve Magneton's health to check another foe, such as Fearow, or if Magneton is in OHKO range for Surf. However, in most cases it is safer to go for the guaranteed 2HKO from Thunderbolt. Thunder can also be useful against Gastly, Abra, and Porygon. Thunderbolt has a low chance to 2HKO the former two, while Thunderbolt followed up by Thunder is guaranteed on both. Thunderbolt never 2HKOes Porygon outside of a critical hit, while Thunderbolt followed up by Thunder has an 80.6% chance to KO.</p> <p>It is important to try to not reveal Magneton until the opponent's Ground-type, most commonly Nidoqueen, is KOed or heavily weakened. If Magneton is revealed too early, the opponent will be inclined to preserve their Ground-type to wall it. Gameplans revolving around Magneton often rely on using Fearow and Fire-types to lure in opposing Ground-types and trade hits with them, facilitating Magneton later on. Because of this, Fearow and Fire-types are great teammates for Magneton. Lead Arcanine can trade hits with opposing Nidoqueen lead to wear it down in the first few turns of a battle. Magneton can switch into Water-types fairly safely, but it is riskier to switch into Fearow. One common way of getting Magneton in on Fearow is by switching Gastly into a predicted Normal-type move, then switching Magneton in as Fearow uses Drill Peck on Gastly, making Gastly an important teammate. Magneton generally lets one play more aggressively with their Gastly as they can switch into Magneton as Fearow revenge kills it. Once Magneton is on the field, it should paralyze the foe then attack it; if the opponent's Nidoqueen is still alive, Magneton can facilitate a double switch to a teammate like Staryu, or it can use Screech as Nidoqueen comes in, then go to Fearow on Earthquake, leaving Nidoqueen in 2HKO range. If Nidoqueen uses Substitute as Magneton switches out, Fearow can break the Substitute then OHKO it with Hyper Beam the next turn, since it does a minimum of 85.3%.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 540559, "username": "gastlies"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 535530, "username": "Gangsta Spongebob"}, {"user_id": 583793, "username": "Sabelette"}]}, {"name": "Grammar checked by", "members": [{"user_id": 583793, "username": "Sabelette"}]}]}
  },
  "Farfetch’d": {
    "overview": "<p>Farfetch'd is like a far weaker Fearow and has no reasonable niche in PU. Its main upside over Fearow is access to STAB Slash, which does slightly more damage to neutral targets than Fearow's Double-Edge and lacks recoil; however, Fearow has Drill Peck, Hyper Beam, and significantly better stats to more than compensate. Farfetch'd OHKOes Abra without needing to risk Hyper Beam, unlike Fearow, but Pinsir's Slash is actually stronger and achieves the same; also, Pinsir is not walled by Rock-types and has much better stats. Farfetch'd also has Body Slam and Swords Dance, which other Flying-types lack, but it will rarely have the time to even set up Agility, let alone a second move. Farfetch'd's poor Speed and bulk make it difficult for it to contribute; attackers like Nidoqueen, Pinsir, Fearow, and all Fire-types outspeed and 2HKO it. Therefore, just about any team is better served by Fearow or Pinsir instead.</p>",
    "sets": {"Double Dance": {"description": "<p>Slash is the only tangible benefit to Farfetch'd, OHKOing Abra and dealing decent damage to neutral targets. Agility allows it to outspeed foes and perhaps sweep a heavily weakened team, but Slash fails to 2HKO most fully-evolved foes, making this difficult. Swords Dance can potentially boost another move to be stronger than Slash, but unless the opponent is catatonic, they will likely not grant Farfetch'd multiple turns to set up. Body Slam can fish for paralysis, while Double-Edge is Farfetch'd's strongest attack at +2. As far as other options, Farfetch'd lacks the time to set up with Substitute and Sand Attack, and its movepool is otherwise barren.</p>"}},
    "credits": {"writtenBy": [{"user_id": 583793, "username": "Sabelette"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 540559, "username": "gastlies"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}]}
  },
  "Muk": {
    "overview": "<p>Muk possesses a couple useful traits, including solid bulk, good elemental coverage, and the tier's most powerful Explosion. However, it is held back by its Poison typing, which grants it no useful resistances alongside weaknesses to the common Earthquake and Psychic, and low Speed, which means it'll almost always move last. To make matters worse, it is dominated by Gastly, which is only 4HKOed by Fire Blast and is immune to Explosion. While teams lacking Gastly may have some trouble playing around it, Muk is too easy to overwhelm with common threats like Nidoqueen, and thus it's recommended that players avoid using this Pokemon.</p>",
    "sets": {
      "Mixed Attacker": {
        "description": "<p>Body Slam lets Muk threaten switch-ins with paralysis, making it a decent midground option with its okay power, while also dealing decent damage to physically frail Pokemon such as Abra and Staryu. Thunderbolt hits Water-types and Fearow for super effective damage, notably letting Muk beat Omanyte. Fire Blast 2HKOes Pinsir while threatening Grass-types such as Vileplume and potentially burning physical attackers. It is also Muk's strongest attack against Gastly. Alternatively, Hyper Beam lets Muk OHKO Abra, meaning it need not use Explosion to KO Abra. Explosion is Muk's most powerful attack, OHKOing common threats like Fearow and Rapidash, and it deals a minimum of 72% to Nidoqueen. It also has an 84.6% chance to OHKO Porygon, which is important, since Porygon otherwise stonewalls Muk. However, it must be used carefully, as opposing Gastly, Omanyte, and Graveler can easily switch in and sponge the attack. Alternatively, the opposing player can sacrifice a weakened foe, which stops Muk from removing a crucial piece of their team.</p> <p>Mega Drain is an option to threaten Graveler, though it only 2HKOing 40.7% of the time means Muk still risks losing one-on-one. It also lets Muk beat Omanyte if it forgoes Thunderbolt. Acid Armor can let Muk survive more hits from physical attackers, especially if it uses it while they switch in, though Fearow can easily bypass Muk's boosts with its high critical hit rate, and Pinsir's Slash will always do so.</p> <p>Given that it can switch into all of Muk's moves, even Explosion, Gastly is Muk's worst enemy. Thus, Abra and Drowzee are recommended partners. Drowzee has the added benefit of checking opposing Abra, which also gives Muk a considerable amount of trouble. Graveler doesn't fear anything from Muk besides Mega Drain, so Porygon is a good partner. Earthquake users in Machamp and Nidoqueen can outspeed and 2HKO Muk, so checks to them, like Fearow for the former and one's own Machamp for the latter, can be good to handle these threats for Muk.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 535530, "username": "Gangsta Spongebob"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 583793, "username": "Sabelette"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}]}
  },
  "Gastly": {
    "overview": "<p>Gastly holds a niche in PU as the second fastest sleeper in the tier, only behind the niche Poliwag. Gastly remains threatening even after using Hypnosis thanks to its high Special and combination of Psychic + Thunderbolt, which has perfect coverage and hits top threats such as Fearow and Nidoqueen super effectively. These traits make Gastly a fantastic lead, since it can put most opposing leads to sleep and then threaten switch-ins with powerful attacks. Gastly can also switch into Normal-type moves, such as Rapidash's Hyper Beam and most of Pinsir's attacks, without taking damage, something no other Pokemon in the tier can do. However, despite its unique defensive utility, Gastly's defensive profile is quite poor due to its stats and Poison typing. Its terrible physical bulk allows most neutral physical attacks such as Fearow's Drill Peck to 2HKO it, while Gastly's low HP leaves it very vulnerable to fixed-damage moves such as Pinsir's Seismic Toss. Additionally, its terrible Ground- and Psychic-type weaknesses leave it OHKOed and 2HKOed, respectively, by every common Earthquake and Psychic in the tier. These issues are compounded by Gastly's reliance on the inaccurate Hypnosis, as a miss could mean Gastly faints without doing anything.</p>",
    "comments": "<h3>Other Options</h3> <p>Night Shade can be used as a midground option to deal consistent damage to Gastly's switch-ins, though the utility of Gastly's other attacking moves is generally superior. Mega Drain 2HKOes Graveler, though Gastly still loses the one-on-one. Confuse Ray can be used in conjunction with paralysis support to let Gastly defeat foes it otherwise can't, such as Drowzee.</p> <h3>Checks and Counters</h3> <p><strong>Psychic-types</strong>: Both Abra and Drowzee can 2HKO Gastly with Psychic or ruin it with Thunder Wave. The former outspeeds Gastly and is only 3HKOed by Night Shade, while the latter is only 4HKOed. However, both must watch out for Explosion, which OHKOes Abra and does a minimum of 67% to Drowzee. Due to it being outsped, Drowzee must be wary of Hypnosis.</p> <p><strong>Faster Attackers</strong>: Fearow, Rapidash, Arcanine, and Pinsir all outspeed Gastly. Fearow 2HKOes Gastly and is only 2HKOed back by Thunderbolt, while Rapidash, Arcanine, and Pinsir 3HKO Gastly and are only 4HKOed by Night Shade. Rapidash can also use Fire Spin to chip Gastly into KO range, and both Fire Spin and Pinsir's Bind can be used to pivot around Gastly. However, Rapidash and Pinsir must be wary of Hypnosis, as they often give Gastly numerous opportunities to try to put them to sleep.</p> <p><strong>Earthquake Users</strong>: Even if Gastly can hit them super effectively, Pokemon such as Nidoqueen, Machamp, and Graveler can easily tank a hit and OHKO Gastly in return with Earthquake. However, there is no Earthquake user in PU that is faster than Gastly, so they must be wary of Hypnosis.</p>",
    "sets": {
      "Sleeper": {
        "description": "<h4>Set Description</h4> <p>Hypnosis is Gastly's primary draw, making it an effective sleeper thanks to its good Speed. Psychic hits Fighting- and Poison-types such as Machamp and Nidoqueen super effectively, and its high chance to drop the target's Special makes it Gastly's most spammable attack. Thunderbolt deals super effective damage to Fearow and Water-types, such as Staryu and Seaking. Explosion lets Gastly sacrifice itself to OHKO Abra, deal at least 67.4% to Drowzee, and deal at least 51.6% to Porygon. While it does little damage to most other foes due to Gastly's low base Attack, it has the added benefit of automatically ending the turn.</p> <p>Gastly tends to get overwhelmed by faster threats, so it appreciates partners that can switch into them. Omanyte and Graveler check Rapidash, Fearow, and Arcanine, while Drowzee can handle Abra. Gastly is also checked by Graveler and Drowzee and thus enjoys the support of wallbreakers such as Seaking and Pinsir. Gastly's combination of high Special and immunity to Body Slam makes it the best switch-in to Omanyte, making it a great partner to Rapidash and Fearow.</p> <p>Gastly can be used as a lead, as no Pokemon can both outspeed and reliably OHKO it, almost always giving it at least one opportunity to use Hypnosis. However, given Hypnosis's poor accuracy, it prefers to switch out against leads that can outspeed and 2HKO it, such as Fearow and Abra. Gastly can also be used in the back to pivot into common Normal-type attacks such as Rapidash's Hyper Beam and Pinsir's Slash thanks to its Ghost typing. Once on the field, it can attempt to put its target to sleep with Hypnosis or pick it off if it's weakened. Gastly's typing also lets it absorb Explosions.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 535530, "username": "Gangsta Spongebob"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 540559, "username": "gastlies"}, {"user_id": 583793, "username": "Sabelette"}]}, {"name": "Grammar checked by", "members": [{"user_id": 583793, "username": "Sabelette"}, {"user_id": 168392, "username": "P Squared"}]}]}
  },
  "Onix": {
    "overview": "<p>At first glance, Onix's enormous base 160 Defense, Rock typing, and access to useful moves like Bind and Explosion may give the impression that it's usable. After all, it can switch in to stonewall Fearow, a top threat, and fire off attacks. However, Onix is rendered completely unviable by its terrible stats. Having an Attack stat lower than Oddish means that Onix does pitiful damage and struggles to break through anything, even targets that are weak to its STAB moves. Bind is already an unreliable option due to its terrible accuracy, but it suffers further due to Onix's mediocre Speed, which notably leaves it outsped by Nidoqueen. Onix's huge Defense is held back by its atrocious base HP and weakness to Earthquake, which makes it lose to most physical attackers regardless. Its special bulk fares even worse, as its low HP, even worse Special, and weaknesses to Water, Grass, and Ice make it lose to nearly every special attacker in the tier. Notably, Nidoqueen's Blizzard OHKOes it 97.4% of the time. While Onix does stop Fearow in its tracks, it should not be used on any serious team on account of it losing to pretty much every other relevant threat in PU.</p>",
    "sets": {"Bind Pivot": {"description": "<p>Bind lets Onix pivot out of opposing switch-ins and slower threats. Toxic pairs well with Bind in wearing down foes. Alternatively, Body Slam can be used to spread paralysis. Earthquake is Onix's primary STAB attack, though it's weak due to Onix's terrible Attack stat. Explosion lets Onix sacrifice itself to deal heavy damage to its target, but it should be used sparingly, as it still doesn't OHKO the majority of the tier, and Onix's primary goal is to stay alive to wall Fearow. Onix works best supporting Pokemon that dislike facing Fearow, such as Pinsir and Abra. Checks to Water- and Grass-types, such as Staryu and Drowzee, work well in helping Onix's with its worst matchups. Paralysis support works well to enable Onix's Bind.</p>"}},
    "credits": {"writtenBy": [{"user_id": 535530, "username": "Gangsta Spongebob"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 583793, "username": "Sabelette"}]}, {"name": "Grammar checked by", "members": [{"user_id": 583793, "username": "Sabelette"}]}]}
  },
  "Drowzee": {
    "overview": "<p>Drowzee's high Special, Psychic typing, and access to excellent utility options in Thunder Wave and Hypnosis make it an effective support Pokemon. Its combination of good special bulk and not minding paralysis too much let it switch into a plethora of special attackers, like Staryu and Porygon, which are some of the best defensive Pokemon in PU. Once on the field, its dual status threatens offensive and defensive Pokemon alike while dissuading other foes from switching in. The ability to cripple and KO top defensive Pokemon makes Drowzee phenomenal at enabling wallbreakers and sweepers like Nidoqueen and Seaking. While it does not like facing offensive foes one-on-one, when Drowzee is at full health it typically forces out common threats like Rapidash, as they are ruined by paralysis. Drowzee isn't passive either—its STAB Psychic hits most targets very hard, notably dissuading Ground-types like Nidoqueen and Graveler from trying to absorb its Thunder Wave.</p> <p>Drowzee's biggest flaw is its poor physical bulk: physical wallbreakers like Fearow, Pinsir, and Nidoqueen generally have no issue 2HKOing Drowzee, even if they have to take significant damage or paralysis in the process. Drowzee's Speed is another issue, as it only naturally outspeeds Omanyte, Graveler, Porygon, and the rare Slowpoke. Drowzee is thus reliant on its foe being paralyzed to avoid getting overwhelmed and revenge killed, though this is often not an option due to how frequently Drowzee is forced to take paralysis itself. Drowzee's Speed also limits the utility of Hypnosis, as while it can potentially let Drowzee beat just about every offensive check one-on-one, it usually only gets one or two opportunities to fire it off.</p>",
    "comments": "<h3>Other Options</h3> <p>Given that Seismic Toss is only used for the mirror matchup and rare Psychic-type foes, it is the preferred move for Drowzee to drop. Counter can punish Normal-type attackers like Fearow and Pinsir, generally KOing them in the process, but their attacks deal so much damage that the slightest chip will often put Drowzee into KO range. Counter still has utility against opposing Drowzee and Abra, as it can counter their Seismic Toss to deal significant damage back.</p> <h3>Checks and Counters</h3> <p><strong>Fearow</strong>: Fearow's Double-Edge almost always 2HKOes Drowzee, while its Hyper Beam does 73.3% minimum. While Fearow doesn't enjoy being paralyzed by Drowzee, it can use Agility to negate its Speed drop.</p> <p><strong>Arcanine</strong>: Arcanine can 3HKO Drowzee with Fire Blast and Body Slam while only being 4HKOed by Psychic, barring Special drops. While it doesn't enjoy paralysis, it isn't completely ruined, and many Arcanine carry Rest, which can potentially erase any progress Drowzee makes.</p> <p><strong>Pinsir</strong>: Pinsir outspeeds Drowzee and 2HKOes it with Slash while only being 3HKOed by Psychic, barring Special drops. It does dislike paralysis, however.</p> <p><strong>Scyther</strong>: Scyther 2HKOes Drowzee with Slash and OHKO it with a +2 Hyper Beam while it can only 3HKO back with Psychic. However, Scyther is ruined by paralysis.</p> <p><strong>Ground-types</strong>: Sandslash outspeeds Drowzee, is immune to Thunder Wave, is only 3HKOed by Psychic, and 2HKOes it with Earthquake—OHKOing after Swords Dance—making it one of Drowzee's worst makchups. While Nidoqueen is 2HKOed by Psychic, it can switch into Thunder Wave and outspeed and 2HKO Drowzee with Earthquake.</p> <p><strong>Faster Sleepers</strong>: While rare, Vileplume and Weepinbell outspeed Drowzee and can put it to sleep with their reliable Sleep Powder, though they must watch out for Drowzee's STAB Psychic, which 2HKOes them. Gastly and the rare Poliwag dislike their odds against Drowzee due to their frailty, though in a pinch they can use Hypnosis to try to put Drowzee to sleep; Gastly can also use Explosion, which does a minimum of 67.4%.</p> <p><strong>Partial Trapping Users</strong>: Drowzee's awful Speed leaves it vulnerable to partial trapping users such as Rapidash, Dragonair, and Pinsir, which can wear it down and pivot around it. However, Thunder Wave ruins most of these Pokemon, and generally partial trapping moves will miss before Drowzee is put into KO range.</p> <p><strong>Opposing Drowzee</strong>: Given its resistance to Psychic and it not minding Thunder Wave that much, Drowzee can switch into itself fairly well and proceed to weaken itself in the mirror match, leaving the surviving Drowzee easy pickings for the loser's teammates.</p>",
    "sets": {
      "Bulky Support": {
        "description": "<h4>Set Description</h4> <p>Thunder Wave is the key to Drowzee's success: it cripples every foe that isn't Ground-type, ruining offensive and defensive threats like Rapidash and Porygon. Thunder Wave pairs excellently with Drowzee's STAB Psychic, which provides fantastic neutral coverage; it also 2HKOes Nidoqueen, the most common Ground-type, and has a 40.7% chance to 2HKO Graveler. Psychic's chance for a Special drop is quite significant, as it can turn 3HKOes, such as against Omanyte, into 2HKOes, and it prevents Recover users like Staryu and Porygon from trying to PP stall it. Hypnosis is Drowzee's wild card—it dissuades every unstatused foe from switching in and can let Drowzee win otherwise unwinnable matchups against Pokemon like Fearow and Pinsir, but its terrible accuracy makes it extremely unreliable; one or two misses lead to Drowzee being KOed without doing anything. Generally, Drowzee should stick to using Thunder Wave and Psychic to make progress and only use Hypnosis when it forces something out or when its other moves simply won't be enough, such as against Rest Arcanine or Agility Fearow when no switch-ins are available. Seismic Toss targets opposing Psychic-types, notably 4HKOing opposing Drowzee and 3HKOing and 4HKOing the rare Abra and Slowpoke, respectively.</p> <p>Drowzee is best used to support offensive Pokemon like Nidoqueen, Seaking, Machamp, and Sandslash by crippling their checks. Its ability to dominate Porygon is crucial, as very few Pokemon check it while not being easily checked by something else. Drowzee struggles the most against offensive threats that have ways around paralysis, like Fearow with Agility and Arcanine with Rest. Switch-ins to them, like Graveler for the former and Omanyte for the latter, are good partners; Omanyte has the added benefit of countering Rapidash, which despises paralysis but generally beats Drowzee one-on-one. Fearow, Rapidash, and Arcanine are themselves good partners, as alongside their ability to trade with each other they can also handle Pinsir, which easily breaks through Drowzee due to its powerful Slash. Despite its weakness to Psychic, Nidoqueen can switch into Thunder Wave and beat Drowzee one-on-one, so checks to it like Porygon and Machamp work well. Fellow paralysis spreaders like the aforementioned Porygon and Staryu also make good partners, as together they maximize the paralysis spread to enable their offensive teammates. Drowzee is a solid check to opposing Psychic-types, as it's reliably able to trade with itself and beat the rare Abra and Slowpoke. In a pinch it can check Gastly, though it must be wary of Explosion, which does around 70%.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 487308, "username": "BT89"}, {"user_id": 535530, "username": "Gangsta Spongebob"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 540559, "username": "gastlies"}, {"user_id": 583793, "username": "Sabelette"}]}, {"name": "Grammar checked by", "members": [{"user_id": 583793, "username": "Sabelette"}]}]}
  },
  "Marowak": {
    "overview": "<p>Marowak has fringe viability as a result of being mostly outclassed by Sandslash, which has higher stats in everything except Defense, and even that's still equal. Marowak does have access to unique options in Fire Blast, Blizzard, and Counter, which can help against threats such as Pinsir and Fearow, but in general Sandslash's access to Swords Dance and Rock Slide is more useful. Sandslash itself isn't even that good as a result of its mediocre Speed and special bulk, so Marowak has little hope in this tier.</p>",
    "sets": {"Standard": {"description": "<p>Earthquake is a decently powerful STAB attack coming off of Marowak's usable base 80 Attack. Body Slam lets Marowak spread paralysis. Blizzard has a 72.2% chance to 2HKO Fearow and can 3HKO Grass-types such as Vileplume. Fire Blast has a 99.1% chance to 2HKO Pinsir and also hits Grass-types. Counter can be used over either elemental attack to help Marowak surprise and potentially KO certain threats such as Fearow and Pinsir, as Counter tends to deal over 50% to them.</p> <p>Given that Marowak is outclassed by Sandslash, one of the only ways to justify using it as a wallbreaker is alongside Sandslash, though such teams need numerous checks to Water-types, such as Staryu and Drowzee, to not immediately fall apart. Otherwise, the only reason to use Marowak would be its slightly better Pinsir and Fearow matchups due to its unique coverage. Marowak enjoys paralysis support, as this eliminates one of its biggest issues, its awful Speed.</p>"}},
    "credits": {"writtenBy": [{"user_id": 535530, "username": "Gangsta Spongebob"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 583793, "username": "Sabelette"}]}, {"name": "Grammar checked by", "members": [{"user_id": 583793, "username": "Sabelette"}]}]}
  },
  "Hitmonlee": {
    "overview": "<p>Hitmonlee is a Pokemon that should never see the light of day in RBY PU despite a few strong points. Its base 120 Attack and the unique STAB move High Jump Kick seem appealing, as High Jump Kick 2HKOes physically bulky Pokemon like Porygon, Omanyte, and Graveler; at +1, it's guaranteed to OHKO the first two and has a chance to OHKO Graveler. It also outspeeds some of the tier's offensive threats, such as Nidoqueen and Pinsir. However, it just has too many flaws to really make use of its unique traits.</p> <p>Firstly, all of Hitmonlee's attacking moves are either Normal- or Fighting-type. This makes it difficult for Hitmonlee to damage many foes, but this is especially problematic against Gastly, which is immune to all of Hitmonlee's moves besides Seismic Toss. Hitmonlee's Base 87 Speed falls short compared to offensive threats such as Fearow and Rapidash, which 2HKO it, or Abra, which OHKOes with Psychic. Therefore, Hitmonlee needs extensive paralysis support to work, and it's just not worth it when other Pokemon like Machamp get more mileage out of such a strategy. Finally, its paper-thin defenses mean it has little chance of surviving any interactions, especially against foes that resist High Jump Kick, since Hitmonlee cannot win unboosted. Pretty much the entire metagame can OHKO or 2HKO Hitmonlee regardless of whether or not they can hit it super effectively, so Hitmonlee is best left on the sidelines.</p>",
    "sets": {"Meditate Attacker": {"description": "<p>High Jump Kick is Hitmonlee's most powerful attack and 2HKOes Pokemon that Hitmonlee outspeeds such as Porygon, Omanyte, and Graveler. One Meditate boost turns the aforementioned 2HKOs into possible or guaranteed OHKOs. Body Slam provides some much-needed coverage and consistency, allowing Hitmonlee to dent switch-ins and spread paralysis without support from teammates. For Hitmonlee's final moveslot, Seismic Toss is the best option, as it lets Hitmonlee actually damage Gastly. As far as other options go, Mega Kick deals higher damage than Body Slam, but comes at the cost of lower accuracy and the paralysis chance that makes Body Slam so valuable. Counter can allow Hitmonlee to net a surprise KO against something like Pinsir's Slash, but is generally unreliable and will only work once due to Hitmonlee's pitiful defenses.</p>"}},
    "credits": {"writtenBy": [{"user_id": 96315, "username": "phoopes"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 535530, "username": "Gangsta Spongebob"}]}, {"name": "Grammar checked by", "members": [{"user_id": 583793, "username": "Sabelette"}]}]}
  },
  "Hitmonchan": {
    "overview": "<p>Hitmonchan has the honor of being the worst fully evolved Fighting-type in a generation where most Fighting-types are terrible. Hitmonchan is an awful Pokemon with almost no redeeming qualities; it's much weaker than other physical attackers such as Fearow, Pinsir, and Machamp, and it lacks the Speed of Fearow and the bulk of the latter two to make any meaningful progress. Outspeeding and 2HKOing Porygon with Submission seems nice, but it is completely outclassed in this role by Machamp. Hitmonchan isn't even guaranteed to beat Porygon one-on-one, since Porygon can paralyze it and use Recover to heal the damage from Submission. Although Hitmonchan can KO Porygon if it hits enough Submissions in a row, the move's terrible accuracy along with the chance for full paralysis makes this unlikely to happen. Since Hitmonchan struggles to beat even the Fighting-weak Porygon, it should be no surprise that most of Hitmonchan's other matchups are awful too. Its terrible Special means it cannot effectively utilize its coverage at all, and it's so specially frail that Drowzee and Abra OHKO it with Psychic; additionally, it's 2HKOed by every Fire-type, Water-type, and Gastly. Agility seems like it's a redeeming quality, as no other Fighting-type has this move, but it does not make up for all of Hitmonchan's downsides. Despite not being a Fighting-type, Seaking outclasses Hitmonchan as a late-game Agility sweeper thanks to its bulk and decent Special.</p>",
    "sets": {
      "Agility... Sweeper?": {
        "description": "<p>Agility is the only reason you'd use Hitmonchan in the first place, since without Agility you might as well just use a better Fighting-type. Submission is Hitmonchan's strongest move, 3HKOing neutral targets such as Fearow, Dragonair, Rapidash, and Seaking, and it has a chance to 2HKO frailer Pokemon such as Staryu and the Fighting-weak Porygon. However, almost all of these Pokemon are still capable of beating Hitmonchan one-on-one. Submission fails to 3HKO bulkier foes such as Arcanine, Machamp, and Nidoqueen. Body Slam hits Nidoqueen and Pinsir for neutral damage and can be used to fish for paralysis. Hitmonchan's fourth move is more flexible. Counter lets Hitmonchan beat Pinsir, but it's very unlikely that any other Pokemon will use a Normal- or Fighting-type move on it. Seismic Toss lets Hitmonchan hit Gastly, which otherwise walls Hitmonchan, and it's also Hitmonchan's strongest move against Nidoqueen. Ice Punch is another option to fish for freeze, but it comes off of Hitmonchan's abysmal base 35 Special.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 540559, "username": "gastlies"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 583793, "username": "Sabelette"}]}, {"name": "Grammar checked by", "members": [{"user_id": 583793, "username": "Sabelette"}]}]}
  },
  "Lickitung": {
    "overview": "<p>In the first generation of Pokemon, Normal-types aren't to be taken lightly thanks to powerful STAB moves such as Body Slam, Double-Edge, and the infamous Hyper Beam. Even all the way down in RBY PU, Lickitung exists to prove that not all Normal-types are created equal, falling far short of Fearow and Porygon. Lickitung initially looks promising with its access to STAB Hyper Beam and Swords Dance, amazing coverage options, and potential to spread paralysis with Body Slam. However, it falls short everywhere else due to its absolutely horrendous stats. Its atrocious Speed makes it slower than almost every relevant Pokemon, and is 3HKOed or 4HKOed by the majority of the tier. Lickitung can theoretically win one-on-one against physically frail Pokemon like Staryu and Gastly, but the damage taken in return leaves Lickitung easily revenge killed. Furthermore, Lickitung is almost entirely outclassed by Pinsir, which boasts much higher Attack, Defense, and Speed; in fact, Pinsir's Normal-type attacks hit harder than Lickitung's. Lickitung's only niche is its ability to sweep with Swords Dance, which is something Pinsir can do better. For these reasons, Lickitung remains a terrible Pokemon in RBY PU, and it shouldn't be used unless you're looking to torture yourself.</p>",
    "sets": {"Swords Dance": {"description": "<p>After a Swords Dance, Lickitung is able to OHKO or 2HKO the entire tier with the combination of Body Slam, Earthquake, and Hyper Beam. Body Slam is Lickitung's safest move; it deals decent damage to neutral targets, and paralysis helps mitigate Lickitung's horrendous Speed. Earthquake is its best option against Omanyte and Gastly, which would otherwise wall it, and the plethora of Fire- and Poison-types in the tier, all of which it OHKOes or 2HKOes at +2. Hyper Beam is Lickitung's most powerful move, and does 60% at minimum to every neutral target in the tier after a Swords Dance. If you must use Lickitung, it is absolutely imperative that its teammates spread paralysis as much as possible before revealing it. Teammates such as Porygon, Staryu, and Dragonair can be very useful as they can spread status without much trouble.</p>"}},
    "credits": {"writtenBy": [{"user_id": 593464, "username": "Teh"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 583793, "username": "Sabelette"}]}, {"name": "Grammar checked by", "members": [{"user_id": 583793, "username": "Sabelette"}]}]}
  },
  "Weezing": {
    "overview": "<p>Despite its solid bulk, decent coverage, and access to Explosion, Weezing struggles to find a place in PU. Its Poison typing grants weaknesses to common Ground- and Psychic-type attacks and lacks useful resistances. Its low Speed and average attacking stats make it very easy to overwhelm, often forcing it to use Explosion early. While its Explosion is difficult to switch into, it's severely held back by Weezing's difficulty in threatening Gastly and Graveler, which can effortlessly switch in and absorb any of Weezing's attacks. To make matters worse, Weezing is largely outclassed by Muk. Weezing's higher physical bulk and Speed are generally less useful than Muk's higher Attack, which allows it to threaten KOs against more foes. Notably, Muk's Explosion is guaranteed to OHKO Fearow and Dragonair, while Weezing's is just a range; Muk also has higher odds to OHKO Porygon and Rapidash. Muk itself is on the verge of unviability, so being a generally worse Pokemon makes Weezing have an even harder time.</p>",
    "sets": {"Mixed Attacker": {"description": "<p>Fire Blast 2HKOes Pinsir, 3HKOes Vileplume, and threatens burn on physical attackers, like Machamp and Nidoqueen. It is also generally Weezing's most spammable attack. Thunderbolt lets Weezing hit Water- and Flying-types super effectively, notably 2HKOing Staryu and Fearow. Hyper Beam lets it finish off weakened threats and has a 48.7% chance to OHKO Abra. Explosion is the primary reason to use Weezing—it has a chance to OHKO common checks like Rapidash, Dragonair, and Porygon and does a minimum of 64.4% to Nidoqueen.</p> <p>Weezing is walled by Gastly and Graveler, so checks to them, such as Abra and Drowzee for the former, and Porygon for the latter, are appreciated. Nidoqueen is another troublesome matchup, so Machamp is a useful partner. Weezing faces heavy competition from Muk, so to justify using it you must utilize its few advantages, notably its better Speed in the Machamp matchup.</p>"}},
    "credits": {"writtenBy": [{"user_id": 535530, "username": "Gangsta Spongebob"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 540559, "username": "gastlies"}]}, {"name": "Grammar checked by", "members": [{"user_id": 583793, "username": "Sabelette"}]}]}
  },
  "Horsea": {
    "overview": "<p>Horsea holds a micro-niche in PU as a second, weaker Seaking, acting as an Agility sweeper that threatens many top Pokemon, such as Fearow, Arcanine, and Nidoqueen, with a 2HKO from either Surf or Blizzard. Horsea also has access to Smokescreen, which makes it much harder for Seaking to reliably set up Agility in front of Horsea and sweep. However, Horsea is much frailer and weaker than Seaking, notably being 2HKOed by Slash from Scyther and Pinsir and Thunderbolt from every relevant user. It is also always KOed by Fearow's Double-Edge into Hyper Beam, and it is 3HKOed by Seaking's Double-Edge and Drowzee's Psychic. This frailty makes it much harder for Horsea to set up Agility compared to Seaking, which has enough bulk to reliably set up and sweep. Horsea's Speed is also poor before it sets up, only outspeeding the likes of Drowzee, Vileplume, and Porygon. Being entirely worse than Seaking means it must not be used as a replacement to Seaking, but as a partner to it. The combination of Horsea and Seaking stacks weaknesses to Staryu and Gastly; Staryu is especially problematic as even Double-Edge Seaking struggles to beat healthy Staryu without a critical hit and Horsea is completely useless into Staryu unless it manages to freeze it. Horsea's flaws massively outweigh its short list of benefits, and as a result Horsea should not be used in nearly any serious game.</p>",
    "sets": {
      "Agility Sweeper": {
        "description": "<h4>Set Description</h4> <p>Surf is Horsea's strongest move, 2HKOing Nidoqueen and Fire-types and doing decent damage to neutral targets. Surf gets many Pokemon, such as Nidoqueen, into KO range of a strong revenge killer, such as Fearow or Scyther. Blizzard 2HKOes Fearow, Dragonair, and Scyther and 3HKOes Vileplume. It can also let Horsea get a lucky freeze on the likes of Staryu or Seaking if desperate. Agility lets Horsea outspeed everything and win many matchups it would otherwise lose, such as against Fearow, Nidoqueen, and Scyther, though it's hard to find setup opportunities. Smokescreen lets Horsea prevent Seaking from using Horsea as setup fodder. Smokescreen can also be used when desperate, as it can let Horsea win poor matchups with enough luck or force a switch. Hydro Pump can be used in place of Surf, as it is much more powerful, notably 3HKOing Drowzee, Porygon, and Machamp.</p> <p>Horsea cannot be used as a replacement to Seaking; it has to be used alongside it, as Seaking entirely outclasses it. Horsea needs support to be able to deal with Staryu, so Pokemon such as Vileplume and Drowzee make good partners, as they can switch in and incapacitate Staryu with status moves. Seaking should be used early- to mid-game to break and chip down foes for Horsea to KO in the late game. Seaking fainting will likely cause the opponent to value their Staryu less, which will make them more likely to let it take paralysis or faint, making it easier for Horsea to clean. Staryu also makes a good partner to Horsea, as it can remove Seaking, which would otherwise threaten to set up and sweep in front of Horsea. Pokemon with high Special also give Horsea trouble, such as Gastly and Drowzee, so Pokemon that can handle them, such as Drowzee and Arcanine, make good partners for Horsea.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 625260, "username": "NotVeryCake"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 540559, "username": "gastlies"}, {"user_id": 535530, "username": "Gangsta Spongebob"}]}, {"name": "Grammar checked by", "members": [{"user_id": 583793, "username": "Sabelette"}]}]}
  },
  "Seaking": {
    "overview": "<p>Seaking’s high attacking stats and access to STAB Surf make it one of the most fearsome mixed attackers in the tier. It can function as a mid-game wallbreaker as well as use Agility to become a deadly late-game cleaner. Seaking's bulk is also fantastic; it can comfortably avoid 2HKOs from Nidoqueen, Pinsir, and Fearow. Seaking’s Water typing gives it very few weaknesses, only really having to worry about non-STAB Thunderbolt from Nidoqueen, Dragonair, Staryu, Porygon, and Gastly. However, Seaking is almost completely walled by an unparalyzed Staryu, which resists Surf, can paralyze Seaking with Thunder Wave, and can use Recover to heal off the damage from Seaking’s Normal-type moves while wearing it down. Seaking also faces similar issues versus Porygon, although its lack of a Water resistance means Seaking can beat Porygon if it gets a critical hit. Although Staryu doesn't outclass Seaking, which still boasts better attacking stats and bulk, it gives Seaking some competition thanks to its higher Speed and better movepool. Seaking is quite slow, requiring Agility to outspeed key threats such as Nidoqueen, Rapidash, Arcanine, and Fearow, while Staryu outspeeds Nidoqueen naturally. Although Seaking is bulky, it lacks reliable recovery, meaning it can be overwhelmed by the strong physical attackers in the tier. Despite these weaknesses, Seaking is still a formidable Pokemon, and its fearsome offensive presence should not be ignored when building a team.</p>",
    "comments": "<h3>Other Options</h3> <p>Other options are not reccomended on Seaking. Rest is an option to give Seaking longevity, but the offensive nature of the tier makes it very difficult for Seaking to find an opportunity to wake up, and Staryu’s access to Recover makes it a much better Water-type for this role. Tail Whip and Mimic can be used as anti-Staryu options. Two uses of Tail Whip gets Staryu into Hyper Beam OHKO range, and Mimic can potentially copy Thunder Wave, Recover, or a coverage move from Staryu.</p> <h3>Checks and Counters</h3> <p><strong>Water-Types</strong>: Staryu is without a doubt Seaking’s biggest counter. An unparalyzed Staryu can switch into Seaking then use Recover until it KOes itself from Double-Edge recoil. If Seaking uses Hyper Beam or Agility, Staryu can then paralyze it safely and continue to use Recover until it fully paralyzes. Seaking is also able to switch into itself well, and the face-off will typically result in the winning Seaking being at low enough HP that something can revenge kill it, although it will probably be able to fire off one more attack before being KOed if it set up Agility. The rare Slowpoke is also able to switch into Seaking and paralyze it, which generally forces it out. Slowpoke is also able to hit it neutrally with Psychic and reapply the paralysis Speed drop with Amnesia.</p> <p><strong>Gastly</strong>: Gastly outspeeds Seaking, is immune to its Normal-type moves, and can threaten threaten Seaking with Thunderbolt or Hypnosis. However, it is harder for Gastly to switch into Seaking at +2, as a critical hit Surf into Surf KOes Gastly.</p> <p><strong>Porygon</strong>: Porygon is able to threaten paralysis while using Recover to heal off any damage it takes. Porygon does have to watch out for critical hits though, as a critical hit Surf into Hyper Beam is guaranteed to KO Porygon.</p> <p><strong>Dragonair</strong>: Seaking without Blizzard is helpless against Dragonair, and even if Seaking is running Blizzard it’s still outsped and can be wrapped. Dragonair is also one of the few Thunderbolt users in the tier, which Seaking does not appreciate.</p> <p><strong>Fearow and Pinsir:</strong> Although neither can switch into Seaking, Pinsir and Fearow both beat Seaking one-on-one; Fearow does, however, usually lose against Blizzard Seaking. Even if they lose the one-on-one fight, they’ll have chipped Seaking enough that something else can revenge kill it.</p> <p><strong>Vileplume and Weepinbell:</strong> Vileplume and the rare Weepinbell are able to switch into a Seaking lacking Blizzard and inflict it with either paralysis or sleep. Weepinbell also has Razor Leaf, which 2HKOes Seaking.</p>",
    "sets": {
      "Agility": {
        "description": "<h4>Set Description</h4> <p>Surf is Seaking’s strongest move and can 3HKO almost every non-resistant Pokemon in the tier. Surf notably 2HKOes Nidoqueen, Rapidash, and Arcanine, and it also puts nearly every Pokemon into KO range for either Fearow’s Hyper Beam or Drill Peck; the few exceptions such as Pinsir and Machamp are not good switch-ins to Seaking. Agility gives Seaking a form of speed control, allowing it to outspeed faster threats such as Nidoqueen and Arcanine, and it lets Seaking clean up a weakened team late-game. Hyper Beam is used to pick off physically-frail foes such as Drowzee and Staryu. Seaking can also fish for a critical hit Hyper Beam OHKO on Staryu. Blizzard is able to secure a 2HKO on Fearow and Dragonair and a 3HKO on Vileplume. Without Blizzard, Seaking loses one-on-one to the former and is walled by the latter two. Double-Edge can be used instead for opposing Staryu, as Double-Edge followed up by Hyper Beam can KO Staryu, making it hard for a paralyzed Staryu to switch in to Seaking.</p> <p>Seaking’s best teammate is Fearow, since Seaking is able to punish Fearow’s two biggest checks—Graveler and Omanyte—with a strong Surf. In return, Fearow heavily threatens Staryu, outspeeding it and 2HKOing with Double-Edge or OHKOing with Hyper Beam after the slightest bit of chip damage. Pinsir also appreciates Seaking breaking through the Rock-types, which enables it to wreak havoc with Slash. Seaking is also able to check Rapidash and Arcanine, Pokemon that Pinsir heavily struggles against. Ironically, Staryu and Porygon are also great teammates for Seaking, since they can trade paralysis with opposing Staryu and Porygon and potentially chip them to make them easier for Seaking to deal with. Dragonair is a notable teammate that can switch into Thunderbolt as well as spread paralysis, easing the burden of Seaking’s low Speed. Dragonair can also form a double Agility core with Seaking, allowing the pair to set up and sweep late-game. Lastly, Graveler is a great teammate for Seaking to fall back on if it’s being overwhelmed by Fearow and Pinsir, while Seaking can help Graveler fend off Rapidash and Arcanine.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 540559, "username": "gastlies"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 583793, "username": "Sabelette"}, {"user_id": 593464, "username": "Teh"}]}, {"name": "Grammar checked by", "members": [{"user_id": 583793, "username": "Sabelette"}, {"user_id": 384270, "username": "autumn"}]}]}
  },
  "Staryu": {
    "overview": "<p>Staryu's phenomenal movepool—complete with fantastic coverage, Recover, and most importantly, Thunder Wave—and good Speed make it a dangerous offensive threat and elite paralysis spreader. Its Water-type STAB moves and Speed dissuade Ground-types like Nidoqueen from switching into it, making its Thunder Wave extremely hard to deny. Staryu isn't just limited to spreading paralysis either—STAB Surf and great coverage let it hit most of the tier for neutral damage, and it can hit notable foes like Arcanine, Rapidash, Fearow, and the aforementioned Nidoqueen super effectively. Despite its extreme frailty, Staryu's access to Recover makes it PU's best answer to Seaking, as its typing and Recover wall it completely bar critical hits as long as it's unparalyzed.</p> <p>However, it is essential that players don't overestimate Staryu's defensive capabilities—barring Seaking, just about every common foe can reliably paralyze or 2HKO Staryu, if not both, making it very difficult for it to use Recover outside of when it faces Seaking. Once paralyzed, Staryu loses one-on-one to most foes, especially if it's weakened beforehand. Even Seaking can break through Staryu, as Double-Edge into Hyper Beam has a 54.3% chance to KO. Magneton also threatens Staryu immensely, as it OHKOes Staryu and is only 4HKOed in return by Surf. Staryu's offensive presence isn't perfect either, as while only a handful of Pokemon outspeed it, these include common foes like Fearow, which can KO Staryu after the slightest chip damage, and Rapidash, Arcanine, and Magmar, which can paralyze Staryu with Body Slam and KO it with Hyper Beam. Slower paralysis spreaders also give Staryu considerable trouble, as while they dislike paralysis, Dragonair can wall Staryu depending on its chosen coverage, Porygon can trade Thunder Wave with Staryu, as it is only 3HKOed by Surf 16.4% of the time and threatens Staryu in return with its coverage, and Drowzee can easily switch into Staryu and threaten it and its team with STAB Psychic and dual status. Staryu also has difficulty fitting all of the moves it wants. Alongside the obligatory STAB Surf and Thunder Wave, it has to choose between Thunderbolt and Psychic as well as Recover and Blizzard, leaving it unable to wall Seaking or threaten foes like Grass-types and Dragonair depending on its choice of coverage.</p>",
    "comments": "<h3>Other Options</h3> <p>Hydro Pump can be used to hit higher damage ranges, notably 3HKOing Drowzee and Gastly, as well as having a chance to 3HKO Magneton, though it fails to KO most other foes faster than Surf and is much less reliable due to its shaky accuracy.</p> <h3>Checks and Counters</h3> <p><strong>Paralysis</strong>: Given that Staryu is 2HKOed by much of the tier, once paralyzed, it's easy to take out. Even foes that can't 2HKO Staryu, like Seaking, can overwhelm it after one turn of full paralysis. Body Slam users like Rapidash and Arcanine can fish for paralysis while dealing solid damage, while Thunder Wave users like Porygon, Abra, and opposing Staryu can use Thunder Wave. However, these foes tend to hate taking paralysis themselves and usually dislike Staryu's STAB and coverage options. Dragonair also has access to Thunder Wave and is more than happy to exchange paralysis with Staryu, as it resists Surf + Thunderbolt and can use Agility. Slowpoke can switch into and threaten paralysis on Staryu lacking Thunderbolt, although it is rare and incredibly weak otherwise. Drowzee deserves a special mention, as it minds neither paralysis nor Staryu's attacks that much, only being 4HKOed by Surf, while it threatens Staryu and its team with not only Thunder Wave but also Hypnosis and a strong STAB Psychic.</p> <p><strong>Faster Pokemon</strong>: Fearow's Double-Edge 2HKOes Staryu, and its Hyper Beam does a minimum of 81.7%. While Fearow dislikes Thunder Wave, it can negate the Speed drop by using Agility, and it's only reliably 2HKOed by Staryu's Blizzard. Although it cannot set up Swords Dance on Staryu, a +2 Scyther OHKOes it with Hyper Beam. Alongside threatening paralysis with Body Slam, Rapidash, Arcanine, and Magmar outspeed Staryu and can KO it from around 60% using Hyper Beam. Abra outspeeds Staryu and threatens paralysis with Thunder Wave and a 2HKO with Psychic, though it generally despises taking paralysis.</p> <p><strong>Magneton</strong>: Magneton OHKOes Staryu with Thunderbolt and is only 4HKOed in return by Surf. Magneton is also incredibly hard to switch into barring Ground-types, as it threatens paralysis and a strong STAB Thunderbolt on Staryu's teammates.</p> <p><strong>Gastly</strong>: Gastly 2HKOes Staryu with Thunderbolt and is only 3HKOed 75.3% of the time by Surf. It also threatens to sleep Staryu and its teammates with Hypnosis.</p> <p><strong>Grass-types</strong>: Grass-types like Vileplume and the uncommon Weepinbell resist Surf and Thunderbolt and threaten Staryu with Sleep Powder and Stun Spore. Vileplume's enormous bulk leaves it only 3HKOed by Blizzard and generally 4HKOed by Psychic, while Weepinbell outright OHKOes Staryu with Razor Leaf.</p> <p><strong>Pinsir</strong>: While Pinsir dislikes taking paralysis, it 2HKOes Staryu with Slash and is only 3HKOed by Surf, meaning it comfortably beats it one-on-one.</p> <p><strong>Machamp</strong>: Staryu can only 4HKO Machamp without Psychic, and Psychic still only 3HKOes it. In return, Machamp 2HKOes with Submission and has a 69.6% chance to 2HKO with Earthquake, and its combination of Body Slam into Submission has high odds to KO Staryu while also threatening paralysis; Machamp dislikes paralysis, though it can still function regardless.</p>",
    "sets": {
      "Special Attacker": {
        "description": "<h4>Set Description</h4> <p>Thunder Wave is critical to Staryu's success, letting it spread paralysis to cripple foes like Rapidash, Porygon, and opposing Staryu. It pairs excellently with STAB Surf discouraging Ground-types from switching in; Surf 2HKOes Nidoqueen and OHKOes Graveler, and since Staryu outspeeds them, it wins one-on-one even if they switch into Thunder Wave. Surf also 2HKOes Fire-types like Rapidash, Arcanine, and Magmar. Thunderbolt is Staryu's primary means of targeting opposing Water-types, notably 2HKOing opposing Staryu and 3HKOing Omanyte and Seaking, limiting the former's opportunities to paralyze Staryu and the latter pair's chances to fish for a critical hit; Thunderbolt also hits Fearow harder than most of Staryu's options, with a 25.6% chance to 2HKO. Psychic is an alternative, notably 3HKOing Gastly and Machamp. Its chance to drop the target's Special makes it threatening against most foes, acting as a strong midground option against Vileplume, as well as opposing Water-types and the rare Weepinbell. Recover lets Staryu effectively check Seaking, as it is a very safe option to use against it. However, it is risky to spam, as many threats like Rapidash and Arcanine can use it to fish for paralysis against Staryu, and using it predictably can allow free entry to foes like Fearow. Blizzard is a potential alternative if Staryu is paired with other Pokemon that can handle Seaking, such as Gastly and one's own Seaking, as it 2HKOes Fearow and Dragonair and 3HKOes Vileplume. It can also let Staryu fish for a freeze, though Staryu is generally better off paralyzing its targets.</p> <p>Staryu is PU's premier answer to Seaking; Seaking's Double-Edge fails to 2HKO and slowly wears Seaking down, and Hyper Beam only deals slightly over 50% and gives Staryu a free turn. If Seaking doesn't use Agility, Staryu outspeeds it, so it can spam Recover as Double-Edge's recoil brings Seaking into KO range. If Seaking uses Agility as Staryu uses Recover or switches in, Staryu can then paralyze it with Thunder Wave, forcing Seaking to use another Agility and giving Staryu potential free turns due to full paralysis. If Seaking is confirmed to not have Double-Edge, it is safe for Staryu to attack it instead of spamming Recover. A healthy Staryu only has to be afraid of Seaking getting a critical hit with Hyper Beam, which OHKOes it.</p> <p>Staryu's excellent matchup against Seaking makes it a good partner to teammates weak to Seaking, like Rapidash, Nidoqueen, and Arcanine. However, it cannot do this when it's paralyzed, and thus it enjoys teammates that can switch into Thunder Wave users, such as Drowzee, Magneton, and Nidoqueen. Ground-types such as Nidoqueen and Graveler make great partners for Staryu, as they wall Magneton, which otherwise gives Staryu great trouble, while also appreciating the paralysis Staryu spreads. Staryu also appreciates being partnered with strong physical wallbreakers like Fearow and Pinsir, which are especially adept at removing Drowzee, which otherwise switches into and threatens Staryu with Hypnosis and STAB Psychic with relatively little risk. While Staryu hates paralysis, in some instances it is necessary to be paralyzed, such as trading Thunder Wave with Porygon to enable Nidoqueen or exchanging paralysis with opposing Staryu to enable Seaking. Once paralyzed, Staryu loses virtually all of its defensive utility and is easily overwhelmed, but if it's at full health, it can still be threatening, as it's difficult to OHKO; it also stonewalls Omanyte, since the only thing it threatens Staryu with is paralysis. Staryu is dominated by Fearow, Rapidash, and Arcanine, as they outspeed and can KO a weakened Staryu, so Rock-types like Graveler for the first and Omanyte for all three work well as partners. Staryu also appreciates Rock-type teammates because it has poor matchups against Arcanine, Rapidash, and Magmar, which it can't switch into well and typicallloses one-on-one to.</p> <p>Staryu can be used at multiple points throughout a game, and its role changes depending on when it is used. It can be used early- and mid-game to revenge kill slower foes such as Nidoqueen; however, this puts it in a position to be revenge killed itself by faster foes such as Fearow and Arcanine, especially if it gets chipped. This means it cannot effectively check Seaking later on in the game. Staryu can be saved throughout the game and avoid getting chipped to effectively check Seaking, although this may exacerbate a team's weaknesses to Fearow and Magneton later on if Staryu's team lacks a healthy check to them.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 625260, "username": "NotVeryCake"}, {"user_id": 543866, "username": "5Dots"}, {"user_id": 535530, "username": "Gangsta Spongebob"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 583793, "username": "Sabelette"}, {"user_id": 540559, "username": "gastlies"}]}, {"name": "Grammar checked by", "members": [{"user_id": 583793, "username": "Sabelette"}, {"user_id": 470115, "username": "SolarBeam"}]}]}
  },
  "Scyther": {
    "overview": "<p>Scyther's incredible Speed—tied with Rapidash for the fastest in the tier—makes it one of only two Pokemon that outspeeds the ubiquitous Fearow, giving it a near-unique ability to revenge kill it. Scyther's excellent Speed is complemented by a fantastic Attack stat and access to Slash. It can further increase its attacking prowess with the combination of Swords Dance and Hyper Beam; with just one boost, it's capable of outright OHKOing many of the tier's frailer Pokemon, such as Staryu and Drowzee. With two boosts, it becomes near-unstoppable, as its high Speed also makes it extremely difficult to revenge kill. However, Scyther is held back by its terrible coverage and a subpar typing. Scyther's offensive movepool is limited to Normal-type moves and the extremely weak Wing Attack, meaning it is completely walled by Graveler and Omanyte, and it also has trouble breaking through Gastly unboosted. Although Scyther's typing gifts it with a handy immunity to Ground-type moves, every Earthquake user has a move that hits it super effectively. Scyther is also weak to the common Fire-type moves in the tier; notably, Rapidash and Arcanine have a 61.5% chance to OHKO it with Fire Blast. Lastly, Scyther's power falls just short of some crucial damage thresholds. For example, Scyther's Hyper Beam at +2 Attack is unable to OHKO Arcanine, Magneton, and Seaking, and it can only OHKO Fearow 30.8% of the time; additionally, Slash followed by a +2 Hyper Beam isn't a guaranteed KO on Nidoqueen. Scyther also faces competition from Pinsir; although they have different roles on a team, they are often incompatible due to their shared weaknesses, most notably to the common Fire Blast. Scyther boasts higher Speed, while Pinsir has higher physical bulk and power, allowing it to get the damage thresholds that Scyther barely misses out on.</p>",
    "comments": "<h3>Other Options</h3> <p>If Scyther pursues other options, Wing Attack should be dropped, although it is usually not recommended due to completely losing the Gastly matchup. Scyther's most common other option is Agility; it can be used to negate the Speed drop from paralysis. This increases the pool of Pokemon that Scyther can set up on, adding foes such as Staryu, Drowzee, and Vileplume to its list of options. This can also be used to win certain endgames that Scyther would otherwise lose by taking paralysis. However, the chance for full paralysis reduces Hyper Beam's accuracy to an effective 67.1%, and considering Scyther typically has to hit multiple Hyper Beams in a row, this sweep can be halted by one unfortunate miss or full paralysis. In addition, Agility can be used to outpace other Agility users, such as Seaking, Dragonair, and Porygon, while also allowing Scyther to not worry about speed ties against opposing Scyther or Rapidash.</p> <p>Substitute can be used to punish switches, such as a weakened Fearow switching out of a predicted Slash, but Scyther can still be paralyzed behind a Substitute. Double-Edge can be used as a midground between Slash and Hyper Beam but it is only useful in highly specific situations and is generally not recommended.</p> <h3>Checks and Counters</h3> <p><strong>Rock-types</strong>: Graveler and Omanyte can switch into all of Scyther's attacks and wall it. The former takes up to 17.8% from Slash and OHKOes with Rock Slide, while the latter takes up to 22.7% from Slash and 2HKOes with Blizzard. Graveler can also freely set up Substitute on Scyther, making it very tricky to switch into.</p> <p><strong>Gastly</strong>: Gastly is completely immune to Slash and Hyper Beam, and it 2HKOes Scyther with Thunderbolt. Scyther has to rely on the weak Wing Attack to hit Gastly, which does very little when unboosted. However, the move 2HKOes at +2 Attack, meaning Gastly has to hit Hypnosis if it switches into Scyther as it uses Swords Dance, but it can use Thunderbolt instead to get Scyther into KO range for a teammate. Even at +4 Attack, Scyther fails to OHKO Gastly most of the time.</p> <p><strong>Fire-types</strong>: Arcanine and Rapidash have a 61.5% chance to OHKO Scyther with Fire Blast; Arcanine always survives a +2 Hyper Beam and Rapidash survives 84.6% of the time. Magmar has higher odds to OHKO Scyther with an 82.1% chance, but Scyther also has an 82.1% chance to OHKO Magmar at +2 Attack, meaning Magmar is better suited for checking an unboosted Scyther.</p> <p><strong>Magneton</strong>: Magneton has a 79.5% chance to OHKO Scyther with Thunderbolt and always survives +2 Hyper Beam, making it an effective switch-in. It also threatens Thunder Wave to stop Scyther from sweeping even if it manages to survive a hit.</p> <p><strong>Paralysis</strong>: Since Scyther is heavily reliant on its Speed, it must avoid paralysis, especially if it lacks Agility. A paralyzed Scyther is very easy to revenge kill due to its poor bulk and weakness-laden typing. Because of this, it should switch out of Thunder Wave users such as Staryu and Drowzee unless it can KO them. Thunder Wave variants of Porygon are overwhelmingly favored to survive a +2 Hyper Beam, and they cleanly 2HKO Scyther with Blizzard. Vileplume's bulk also lets it survive a +2 Hyper Beam from full HP, although it has to rely on the less accurate Stun Spore.</p> <p><strong>Ground-types</strong>: Nidoqueen and Sandslash are bulky enough to beat Scyther one-on-one. They both easily survive a +2 Hyper Beam and 2HKO Scyther in return. However, Scyther can pair up with other physical attackers checked by them, such as Fearow, to break through, overwhelming these checks with offensive power.</p>",
    "sets": {
      "Swords Dance Sweeper": {
        "description": "<h4>Set Description</h4> <p>Scyther boasts the deadly combination of Swords Dance and Hyper Beam, which allows it to set up and sweep an opposing team. Scyther needs to set up on Pokemon that are unable to paralyze or OHKO it, such as Fearow, Nidoqueen, Pinsir, Machamp, unboosted Seaking, and Gastly. Unfortunately, Scyther fails to KO many of these foes at +2 Attack, meaning they must be weakened first. As such, setting up with Scyther often requires baiting one of these Pokemon in, dealing enough damage to put it in KO range of Scyther's +2 Hyper Beam, and then allowing your own Pokemon to faint so Scyther may enter the field safely. At this point, Scyther can use Swords Dance, take a hit, and potentially sweep. Arguably the most important Pokemon that Scyther can set up on Fearow, since its high Speed makes it otherwise difficult to check offensively. However, Scyther must be wary of an OHKO from Fearow's Drill Peck on a critical hit.</p> <p>Slash is a very good option for Scyther if it is unable to find a turn to set up. It can KO frailer Pokemon such as Drowzee and Staryu from 51% and 56.6%, respectively. Most importantly, it does a minimum of 41.1% to Fearow, which is enough to KO Fearow after Nidoqueen or Seaking's Blizzard, and it is favored to KO after Gastly's Thunderbolt. This gives Scyther a safer option to revenge kill Fearow without risking the OHKO from a critical hit Drill Peck. Wing Attack allows Scyther to hit Gastly, notably 2HKOing it at +2 Attack. This means if Gastly switches into Scyther as it sets up Swords Dance, it has to land Hypnosis in order to beat Scyther. If Sleep Clause is already active, the odds become even better for Scyther, as Gastly has to fish for either a critical hit or paralysis from Thunderbolt.</p> <p>Scyther fits best on fast offensive teams that appreciate its Speed and ability to revenge kill Fearow. Seaking is a good teammate that can switch into Fire-types and Graveler. Seaking's Blizzard also gets Fearow into KO range for Scyther's Slash. Porygon can switch into Graveler and Omanyte to wall them and set up Agility. Porygon's Psychic also gets Gastly into KO range for Scyther's Wing Attack at +2. Sleepers such as Gastly, Drowzee, and Vileplume can help Scyther find setup opportunities on sleeping Pokemon. Fire-type allies can trade with opposing Fire-types and Gastly to ease pressure for Scyther. Scyther also fits well on hyper offensive teams that sacrifice utility Pokemon in favor of damage output, as it benefits a lot more from foes being at low HP than from them being paralyzed. As a result, Pokemon such as Nidoqueen, Rapidash, Arcanine, Pinsir, and Machamp are good teammates. It is possible to drop Nidoqueen on these teams as well, since teams lacking Nidoqueen generally focus on stacking Pokemon with high Speed, and Scyther can alleviate the Fearow weakness that a team lacking Nidoqueen often suffers.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 540559, "username": "gastlies"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 535530, "username": "Gangsta Spongebob"}, {"user_id": 530877, "username": "Volk"}]}, {"name": "Grammar checked by", "members": [{"user_id": 583793, "username": "Sabelette"}]}]}
  },
  "Magmar": {
    "overview": "<p>At first glance, Magmar appears to be outclassed by Arcanine and Rapidash. The former is much bulkier, and the latter crucially outspeeds Fearow. However, Magmar has a unique niche thanks to its diverse movepool, making it a good lead. Moves like Psychic, Confuse Ray, and Counter help Magmar defeat leads such as Gastly and opposing Fire-types. However leads with Thunder Wave, such as Dragonair and Staryu, generally force Magmar out due to its fear of paralysis. Staryu is especially nasty since it has a strong STAB Surf to hit Magmar with.</p> <p>Although Magmar is most commonly seen as a lead, it can also be used in the back as a Fire-type that's not walled by Omanyte, using either Seismic Toss or Psychic to defeat it. Psychic also allows Magmar to break through Porygon with special drops. Despite these positives, Magmar is typically not worth using over Arcanine's strong defensive profile or Rapidash's amazing Speed. Magmar has a much worse matchup against Fearow, the most dangerous Pokemon in the tier, as well as opposing Fire-types if Magmar lacks Counter. Overall, Magmar is a fantastic lead thanks to its diverse toolkit and excellent matchups against common leads, but Rapidash and Arcanine keep it from being one of the top threats in the metagame.</p>",
    "comments": "<h3>Other Options</h3> <p>Hyper Beam is a powerful move that deals over 50% to frail Pokemon such as Drowzee and Staryu while also OHKOing Abra, but it is hard to fit. Submission is Magmar's strongest move against Omanyte, but it has little other use since Fire Blast does around the same amount of damage to Graveler and Porygon, and the more consistent Psychic and Seismic Toss are generally preferred as anti-Omanyte options.</p> <h3>Checks and Counters</h3> <p><strong>Rock-types</strong>: Although Magmar has a better matchup compared to other Fire-types, Graveler and Omanyte are still both capable of 2HKOing Magmar. Magmar only 3HKOes Omanyte with Seismic Toss and has a very slim chance to 3HKO Graveler with Psychic barring Special drops.</p> <p><strong>Paralysis</strong>: Magmar hates being paralyzed since it's frail and relies on outspeeding the foe to use Confuse Ray effectively. Because of this, Magmar has trouble against leads with Thunder Wave, such as Staryu, Dragonair, and Drowzee.</p> <p><strong>Water-types</strong>: Seaking, Slowpoke, and the aforementioned Omanyte can switch into Magmar and beat it one-on-one. Staryu is too frail to switch in, but it beats Magmar one-on-one, making it a good revenge killer. Magmar is capable of pushing through these threats if it gets lucky with Confuse Ray, although this strategy is unreliable.</p> <p><strong>Ground-types</strong>: Although it struggles to switch in to a healthy Magmar, Nidoqueen is capable of KOing Magmar with Earthquake after some chip damage. Magmar's Fire Blast only 3HKOes Nidoqueen, although Nidoqueen must fear burn. Fire blast is likely to 2HKO Sandslash, but its Earthquake has a 43.6% chance to OHKO Magmar.</p> <p><strong>Fearow</strong>: Magmar lacks the bulk of Arcanine and the Speed of Rapidash to handle Fearow, which outspeeds Magmar and easily KOes it with Double-Edge followed by Hyper Beam. However, Magmar is capable of burning Fearow with Fire Blast.</p> <p><strong>Opposing Fire-types</strong>: If not running Counter, Magmar is unable to defeat Rapidash and Arcanine due to their greater bulk and Speed. Rapidash and Arcanine are unlikely to attack Magmar with Normal-type moves right away in order to scout for Counter, but once Magmar is confirmed to not have it, these Fire-types easily defeat Magmar.</p>",
    "sets": {
      "Swagmar": {
        "description": "<h4>Set Description</h4> <p>Fire Blast is Magmar's strongest move, dealing significant damage to any neutral target. Body Slam allows Magmar to fish for paralysis, and parafusion makes dealing with Magmar extremely difficult. Confuse Ray is also a fantastic option against opposing Gastly and Drowzee leads, reducing the accuracy of Hypnosis to a measly 29.9%. Seismic Toss is a decent alternative to Confuse Ray when not leading Magmar, allowing Magmar to 3HKO Omanyte while also doing more damage to opposing Fire-types, Water-types, Graveler, and Dragonair. Counter is used to deal with opposing Fire-types, since they risk Counter if they use their more effective Normal-type moves. Even if Magmar is not running Counter, simply the threat of the move will force prediction. If Magmar does drop Counter, Psychic is a good alternative that is more accurate while dealing the same amount of damage as Fire Blast to Psychic-weak or Fire-resistant Pokemon, such as Dragonair or Gastly. Psychic's chance of a Special drop is also useful in some cases, such as allowing Magmar to break Porygon; it also gives Magmar a slim chance to 2HKO Nidoqueen if the first one drops its Special.</p> <p>Since Magmar is used primarily as a lead, it can fit on almost any kind of team. Rapidash and Arcanine are good teammates since Magmar can weaken their shared checks such as Staryu and Omanyte early-game, making them easier to handle later. Since Magmar has a worse matchup against Fearow compared to the other Fire-types, teammates that check Fearow, such as Rock-types and Sandslash, are good teammates. Paralysis spreaders are also great teammates, since they help Magmar break through Fire-types and make Confuse Ray even more infuriating to deal with. Dragonair in particular is a fantastic teammate since it can switch into Pokemon like Seaking that force Magmar out. It can then use Thunder Wave and Wrap to pivot back into Magmar. In return, Magmar can defeat Gastly, one of Dragonair's biggest counters, early-game. Porygon can switch in to Graveler and Omanyte, which generally force Magmar out, especially if it's not running Psychic or Seismic Toss. Pokemon such as Drowzee that can switch into opposing Thunder Wave leads are also good teammates.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 540559, "username": "gastlies"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 535530, "username": "Gangsta Spongebob"}, {"user_id": 583793, "username": "Sabelette"}]}, {"name": "Grammar checked by", "members": [{"user_id": 583793, "username": "Sabelette"}]}]}
  },
  "Pinsir": {
    "overview": "<p>Pinsir's gargantuan Attack stat and Slash makes it among PU's most powerful wallbreakers. Slash at minimum 3HKOes every neutral target and 2HKOes some notable foes like Drowzee and Staryu. Thanks to its access to Seismic Toss and Submission, Pinsir lacks any true walls, unlike other offensive threats like Fearow and Seaking. Once on the field, it is an instantly threatening force that virtually no foe can safely switch into; even Pokemon that can switch into Slash and win one-on-one, like Fearow, Rapidash, and Arcanine, hate having to take so much damage from Pinsir's Slash. Pinsir is also among the few Pokemon in PU that can 2HKO Porygon without a critical hit thanks to Submission. Pinsir's Speed is also quite good, only being outsped by Rapidash, Arcanine, Fearow, and the rare Abra and Magmar. Tying with Staryu, it outspeeds every other viable Pokemon, which includes important foes like Nidoqueen, Drowzee, and Porygon.</p> <p>However, Pinsir struggles in a metagame so hostile to it. Pinsir's typing leaves a lot to be desired, as its good physical bulk and useful Ground resistance are overshadowed by its terrible weaknesses to Fire and Flying. Rapidash, Arcanine, and Fearow all outspeed it and beat it one-on-one, with the former two able to outright OHKO it. Even Pinsir's one good resistance is shaky, as many Earthquake users, like Nidoqueen and Graveler, carry super effective STAB moves or coverage moves that can 2HKO it. Pinsir's main niche as an unwallable wallbreaker is less effective than it would seem at first glance. While all three of Rapidash, Arcanine, and Fearow are walled by Omanyte, and Fearow is walled by Graveler, both Rock-types are themselves walled by Porygon, making those poor matchups almost unpunishable. Pinsir is itself reliant on Rock-types to not get easily revenge killed by the aforementioned trio, so it's often a liability. Additionally, while Pinsir does have the tools to threaten every Pokemon in the metagame, the moves it relies on to target Gastly and Rock-types can only 3HKO them and most other targets, making it possible to pivot in a check to Pinsir with good prediction. Pinsir's plethora of poor matchups makes it hard to justify on teams when one could simply use another offensive threat that requires less support, though its impact on the metagame canot be ignored when a near mandatory Pokemon, Nidoqueen, often carries Fire Blast solely for it.</p>",
    "comments": "<h3>Other Options</h3> <p>Body Slam can be used to spread paralysis, but Pinsir generally makes more progress using its standard set. Swords Dance is an enticing option, as the sheer power of a boosted Hyper Beam can OHKO nearly every non-Rock- or Ghost-type, KOing even extremely bulky neutral targets like Arcanine and Nidoqueen after the slightest chip damage. Additionally, a +2 Hyper Beam has a 71.8% chance to OHKO Porygon, and a +2 Submission will always do so. Pinsir can notably take advantage of Porygon to set up, as while it risks taking Thunder Wave, few Pokemon can switch into Pinsir's boosted attacks. However, using Swords Dance and Hyper Beam means Pinsir must give up Bind and one of its coverage moves, leaving it unable to threaten certain foes. Pinsir being so easy to force out is another factor that limits the utility of Swords Dance, as it's extremely easy to revenge kill and foes like Rapidash and Arcanine can switch into it as it uses the move.</p> <h3>Checks and Counters</h3> <p><strong>Fire Blast Users</strong>: Rapidash and Arcanine outspeed Pinsir and have a 79.5% chance to OHKO it with Fire Blast, while its Slash only rarely 2HKOes Rapidash and 3HKOes Arcanine. Magmar is almost always 2HKOed by Slash, but it outspeeds and OHKOes Pinsir with its Fire Blast. Nidoqueen 2HKOes Pinsir with Fire Blast, while Slash only 3HKOes back, but Nidoqueen being slower means it needs to be in pristine condition and possibly deal with Bind to win one-on-one.</p> <p><strong>Fearow</strong>: Fearow outspeeds Pinsir and has a 96.8% chance to 2HKO with Drill Peck, while Slash only has a 30.7% chance to 2HKO back. However, it is a tenuous check, since it can generally only switch into Pinsir once.</p> <p><strong>Gastly</strong>: Seismic Toss only 3HKOes Gastly, and it is immune to all of Pinsir's other moves, so it can effortlessly switch in and put Pinsir to sleep with Hypnosis. However, once Sleep Clause is active, Gastly loses one-on-one and will usually need to pivot into in a faster threat, which is predictable.</p> <p><strong>Rock-types</strong>: Pinsir's Submission only 3HKOes Graveler, and its Rock Slide has an 87.6% chance to 2HKO back, which becomes 100% after Submission's recoil. Omanyte loses one-on-one, but it can easily force Pinsir to use Submission or Seismic Toss, allowing it to pivot in a faster threat.</p> <p><strong>Paralysis</strong>: Once paralyzed by threats such as Staryu and Drowzee, Pinsir is easy to overwhelm. Threats that normally lose due to being outsped, such as Seaking and Omanyte, now easily beat Pinsir. Dragonair can also use Wrap to bring Pinsir into KO range. Tenuous checks to Pinsir, such as Nidoqueen, Machamp, and Graveler, find themselves more comfortably able to overwhelm it.</p>",
    "sets": {
      "All-Out Attacker": {
        "description": "<h4>Set Description</h4> <p>Slash is Pinsir's most spammable attack, 2HKOing or 3HKOing most foes. Submission is Pinsir's strongest attack against Porygon, Omanyte, and Graveler, 2HKOing the former two and 3HKOing the latter. Seismic Toss hits Gastly, which is immune to all of Pinsir's other moves. Seismic Toss also lets Pinsir cover switches, as it still deals decent damage to Rock-types, notably 3HKOing Omanyte. It also puts many targets that are 3HKOed by Slash in 2HKO range, such as Machamp and Nidoqueen, and puts Staryu in OHKO range. Bind allows Pinsir to chip foes into KO range and pivot around slower threats. However, given its terrible accuracy, Bind should only be used when necessary.</p> <p>Pinsir can be used as a wallbreaker or a cleaner for its team. When used as a wallbreaker, it's excellent at removing or weakening crucial defensive pieces such as Porygon, Drowzee, and Staryu. This helps speedy offensive threats, such as Rapidash and Fearow, in sweeping late-game. While Pinsir loses one-on-one against Nidoqueen at full health, in a pinch it can switch into Earthquake and tank one Fire Blast, letting it land Slash twice to leave its foe easy to revenge kill. If used as a cleaner, it enjoys the support of wallbreakers such as Nidoqueen and Fearow to weaken defensive Pokemon. Thunder Wave support from teammates such as Staryu, Porygon, and Drowzee is crucial to pave the way for Pinsir's sweep. Pinsir need to be unparalyzed for it to clean, making allies that can switch into Thunder Wave, like Drowzee and Nidoqueen, good partners. Pinsir is easily handled by Rapidash, Arcanine, and Fearow, which outspeed and threaten it with their STAB attacks. Therefore, Omanyte and Graveler are essential for preventing Pinsir from being easily revenge killed. Pinsir struggles against Rock-types and Gastly, which force it to use its weak coverage moves. Thus, Water-types such as Seaking and Staryu for the former, and Psychic-types such as Abra and Drowzee for the latter, are appreciated. Porygon walls Rock-types, at best Graveler can trade using Explosion, making it a good teammate.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 535530, "username": "Gangsta Spongebob"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 583793, "username": "Sabelette"}, {"user_id": 540559, "username": "gastlies"}]}, {"name": "Grammar checked by", "members": [{"user_id": 583793, "username": "Sabelette"}]}]}
  },
  "Ditto": {
    "overview": "<p>The novelty of Ditto being the only non-Uber that has access to Transform quickly wears thin when it's the only move it can learn. Ditto's awful base stats are a massive hindrance—it's outsped by the majority of the tier and has subpar bulk, so it generally takes heavy damage before being able to do anything. To add insult to injury, even after using Transform Ditto retains its terrible base HP and low critical hit rate, and it uses its subpar original stats when calculating critical hits it deals and receives. Transform copying stat boosts is almost completely irrelevant in PU, as the tier has few viable setup sweepers. Ditto is a fun gimmick, but if you have the slightest interest in winning, you should never use it.</p>",
    "sets": {"Transformer": {"description": "<p>Transform is the only move Ditto can learn. It copies all of the target's stats except HP, as well as all of their stat changes. It leaves Ditto with 5 PP in every move, which isn't a huge issue in a tier as offensive as PU, but leaves Ditto easy to PP stall by threats such as Porygon. Ditto appreciates its targets being paralyzed, as then it can transform without taking a hit, which likewise means it should avoid getting paralyzed as much as possible.</p>"}},
    "credits": {"writtenBy": [{"user_id": 535530, "username": "Gangsta Spongebob"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 583793, "username": "Sabelette"}]}, {"name": "Grammar checked by", "members": [{"user_id": 583793, "username": "Sabelette"}]}]}
  },
  "Flareon": {
    "overview": "<p>Despite possessing the highest BST in PU, Flareon is beyond outclassed. While Rapidash, Arcanine, and Magmar have much lower attacking stats, their excellent Speed improves their matchups across the board. Flareon's bad base 65 Speed, meanwhile, leaves it outsped by most of the metagame, including key threats like Nidoqueen. Even if it can still win against foes like Abra and Pinsir, having to take an extra hit means it gets worn down quickly and revenge killed by faster threats. Flareon often fails to outdamage faster Fire-types, as their higher Speed lets them launch more attacks against the opposing team. They also have traits that offer more game-to-game utility than Flareon's sheer damage. Rapidash outspeeds Fearow, Arcanine has excellent bulk, and Magmar has a diverse movepool, which notably can let it threaten Omanyte, something no other Fire-type can do.</p> <p>Thus, you can only justify using Flareon alongside another Fire-type and heavy paralysis support. With proper support Flareon is a usable wallbreaker, as besides Omanyte, no Pokemon can safely switch into all of its attacks. Notably, it's among the few Pokemon that can reliably 2HKO Porygon. However, most of the time another duo of Fire-types will make more progress with less support, and thus Flareon should rarely see play.</p>",
    "comments": "<h3>Other Options</h3> <p>Toxic can be used alongside Fire Spin to let Flareon wear down Omanyte, but this means Flareon must give up Hyper Beam. Reflect can be used over Fire Spin to improve Flareon's matchups against many physical attackers, but its low Speed hampers this. Nidoqueen still 2HKOes Flareon unless it can use Reflect before Nidoqueen can land the first Earthquake, while Fearow's high critical hit rate and Pinsir's Slash can bypass Reflect's Defense boost. While weak, Quick Attack can be used to pick off physically frail foes, like Staryu and Abra.</p> <h3>Checks and Counters</h3> <p><strong>Water-types</strong>: Omanyte's unique typing lets it take minimal damage from all of Flareon's attacks barring the rare Toxic plus Fire Spin combo, making it Flareon's hardest counter. Seaking outspeeds Flareon and 2HKOes it with Surf and is 3HKOed by Body Slam in return, though Seaking must be wary of Body Slam paralysis.</p> <p><strong>Arcanine</strong>: Arcanine's higher Speed and physical bulk let it outdamage Flareon one-on-one, especially if it's carrying Reflect.</p> <p><strong>Ground-types</strong>: Nidoqueen outspeeds and 2HKOes Flareon with Earthquake, while Flareon's Fire Blast only 2HKOes 3% of the time. Flareon outspeeds Graveler and 3HKOes it with Fire Blast, but it has a 17.9% chance to OHKO Flareon with Earthquake. The rarer Sandslash speed ties Flareon and has a 33.3% chance to OHKO Flareon with Earthquake.</p> <p><strong>Fearow</strong>: Fearow outspeeds and 2HKOes Flareon with Double-Edge + Hyper Beam while only being 2HKOed by Fire Blast in return. While Fearow fears a burn, it is notably immune to Body Slam paralysis cannot be KOed by the combination of Body Slam and Fire Blast.</p> <p><strong>Faster Threats</strong>: While they usually lose to Flareon one-on-one, faster threats like Staryu and Pinsir can easily revenge kill Flareon due to their higher Speed.</p>",
    "sets": {
      "Mixed Attacker": {
        "description": "<h4>Set Description</h4> <p>Fire Blast can 2HKO most neutral targets and threatens to burn physical attackers. Body Slam lets Flareon fish for paralysis and hits most Fire-resistant switch-ins hard, including Arcanine, Staryu, and Dragonair. Hyper Beam is actually weaker than Fire Blast against most neutral foes, but it OHKOes Abra and serves as a powerful finisher against physically-frail Pokemon, like Drowzee, and Fire-resistant foes, barring Omanyte. Fire Spin lets Flareon wear down and pivot against slower Pokemon, though its terrible accuracy means it should be used sparingly.</p> <p>Given that the other Fire-types often do Flareon's job better, it's best used alongside Rapidash or Arcanine as a slower but more powerful wallbreaker. Omanyte is the one wall Flareon has no hope of breaking through, so checks to it like Porygon and Gastly are essential partners. Paralysis support is also crucial for letting Flareon overwhelm its foes, so Thunder Wave users like Staryu, Drowzee, and the aforementioned Porygon are important.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 535530, "username": "Gangsta Spongebob"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 583793, "username": "Sabelette"}, {"user_id": 540559, "username": "gastlies"}]}, {"name": "Grammar checked by", "members": [{"user_id": 583793, "username": "Sabelette"}]}]}
  },
  "Porygon": {
    "overview": "<p>Porygon's decent bulk and almost-unique access to Recover give it a unique role in the tier. Very few Pokemon 2HKO it, allowing Porygon to switch in and slowly chip away at foes such as Arcanine and Seaking while using Recover to heal any damage it takes. Porygon also has a wide movepool; in addition to the aforementioned Recover, it has a plethora of coverage moves that threaten much of the tier for super effective damage, and two forms of speed control: Agility and Thunder Wave. Although Porygon's initial Speed is low, it is fast enough to outspeed Graveler and Omanyte, making it an excellent switch in to the Rock-types, which is especially useful since Graveler is tough to switch into otherwise. Porygon's Normal typing also give it an immunity to paralysis from Body Slam, so the Rock-types can't even fish for paralysis against it. This trait is also useful against foes such as Arcanine and Rapidash. Porygon can be played in two main ways; its longevity can allow it to slowly sweep a team with Agility, or it can be used as a wall, using Thunder Wave to spread paralysis throughout an opposing team.</p> <p>Despite seeming excellent on paper, Porygon has several flaws that prevent it from being among the top threats in the metagame. Its Speed is very slow, which means if it switches into an attack, it will get hit twice before being able to act. This generally forces Porygon to use Recover right after switching in, making it quite easy to switch into. In addition, Porygon is very weak to critical hits. For example, although Porygon is 3HKOed by Seaking's Surf, if it switches into a critical hit Surf, Hyper Beam is a guaranteed KO. This also hinders Porygon's ability to switch into Nidoqueen; although it only takes a maximum of 42.3% from Earthquake, it can easily be ruined if it gets critically hit on the switch. Porygon's ability to switch into Omanyte is not unique, as top threats in Gastly, Seaking, and Staryu can all switch into it as well, and Porygon must be wary of Graveler's Explosion. For these reasons, Porygon is often brought in after a teammate is KOed, getting a free Thunder Wave or Agility in retaliation. However, Porygon's paralysis-spreading abilities aren't as useful as they seem, since the ubiquitous Nidoqueen is immune to Thunder Wave, and other top threats such as Arcanine, Fearow, and Seaking can all use Agility to alleviate the Speed drop. PU is also generally just a fast-paced tier where teammates such as Fearow, Seaking, and Arcanine appreciate foes being chipped more than paralyzed. Porygon itself is very vulnerable to paralysis, since one full paralysis on a Recover turn can be enough for a foe to KO it.</p>",
    "comments": "<h3>Other Options</h3> <p>Agility Porygon can use Blizzard over Psychic, as the move does more damage to Nidoqueen, Fire-types, and Fearow, but the move has less PP and only 4HKOes Gastly, giving it more chances to fish for a Hypnosis hit or a Special drop from Psychic. Tri Attack on support Porygon is an alternative to Double-Edge that lacks recoil, but the greater power of Double-Edge makes it the preferred option. Porygon can use Reflect to become near-unbreakable on the physical side, but it is very hard to fit and doesn't help with Porygon's vulnerability to critical hits. Porygon can also run a set consisting of Sharpen, Recover, Hyper Beam, and Agility, but this set requires several turns of setup and is completely walled by Gastly, and it also struggles to break though Water-types.</p> <h3>Checks and Counters</h3> <p><strong>Paralysis</strong>: A paralyzed Porygon is much easier to KO due to full paralysis preventing recovery. A paralyzed Porygon can't even switch into Omanyte and Graveler effectively anymore, since the Rock-types now outspeed it and 3HKO it. Although Agility Porygon seems to alleviate the Speed issue, full paralysis is still a major problem for it, and other Agility users can reapply the Speed drop from paralysis, making Porygon slow again.</p> <p><strong>Critical Hits</strong>: Many Pokemon in the tier, such as Nidoqueen, Fire-types, and Seaking, outspeed and 3HKO Porygon, and this becomes a 2HKO if they get a critical hit. This means Porygon is always taking a risk when it switches in, since a critical hit will put it in KO range for a subsequent attack, immediately forcing the user to sacrifice it or switch out. Once Porygon does switch in, there is still the risk of a critical hit every turn, forcing Porygon to use Recover more often than it wants to in order to mitigate the risk, making it passive.</p> <p><strong>Psychic-types</strong>: Drowzee outspeeds Porygon and almost always 3HKOes it with Psychic. Drowzee also has Hypnosis and Thunder Wave to threaten Porygon with status, and it doesn't mind Thunder Wave from Porygon that much. Porygon 3HKOes Drowzee with Double-Edge, but if it drops the move, then Blizzard is only a 4HKO. Porygon lacking Double-Edge also struggles against Abra, since Blizzard 4HKOes while Abra outspeeds and 3HKOes in return with Psychic, although it is ruined by Thunder Wave.</p> <p><strong>Fighting-type Coverage</strong>: Although it doesn't appreciate getting hit by Thunder Wave, Machamp easily 2HKOes Porygon with both Submission and Low Kick, while it is only 4HKOed by Blizzard and Double-Edge and 3HKOed by Psychic. Similarly, Pinsir also 2HKOes Porygon with Submission. However, it is important to note that once paralyzed, Submission's chance of landing becomes a pathetic 59.8% and Low Kick is unlikely to connect enough times in a row to break through, so Porygon can beat these foes with luck.</p> <p><strong>Explosion</strong>: Although Porygon otherwise walls Graveler, it can break through Porygon with Explosion; it has a 43.6% chance to OHKO Porygon, and Porygon's low Speed means it can be revenge killed easily if it survives Explosion. However, it is important to note that once Graveler explodes, Fearow becomes much more deadly, so in some cases it would be wise to invite Graveler's Explosion to enable Fearow. Gastly's Explosion is also dangerous, although its much lower Attack means Explosion will only do a maximum of 60.9%. However, since Gastly is faster, it will end the turn the moment it uses Explosion, preventing Porygon from using Recover. This leaves it in KO range of common attacks such as Nidoqueen's Earthquake and Arcanine's Fire Blast, forcing the Porygon to either sacrifice itself or switch out at low HP, hindering its ability to switch in later.</p> <p><strong>Partial Trapping</strong>: Since it is slow, Porygon is vulnerable to partial trapping. Dragonair can use Wrap on Porygon and switch in a teammate such as Nidoqueen to force it out, or it can just stay in and wear down Porygon's HP. Although inconsistent, Rapidash's Fire Spin is able to get Porygon into Fire Blast's 2HKO range, since Fire Blast barely misses out on a 2HKO otherwise. It can also let Rapidash pivot out in a pinch.</p>",
    "sets": {
      "Agility": {
        "description": "<h4>Set Description</h4> <p>This set aims to use Agility to alleviate Porygon's low Speed, letting it act as an effective lead that threatens to slowly sweep a team. At +2 Speed, Porygon is faster than every unboosted foe. When Porygon is faster than its foe, it is able to attack whenever it's at high HP, since if it is hit by a critical hit, it will still be able to use Recover to heal off the damage. Psychic hits almost the entire tier for neutral damage and hits Nidoqueen and Gastly super-effectively. Thunder Wave is most common in the lead slot, as it allows Porygon to spread paralysis early and deal with opposing Agility users, which can otherwise boost to outspeed Porygon. Porygon can also reapply the Speed drop from paralysis with its own Agility. However, limiting Porygon to one attacking move can give it serious coverage and PP issues, especially against Drowzee and the rare Abra. This means that if Porygon is used in the back for a sweeping role, it should choose another attacking move. Thunderbolt complements Psychic very well, as it hits Fearow, Seaking, Scyther, and Staryu super-effectively. Porygon can equip Double-Edge to break through the Psychic-types, (AH) but the matchup is still quite poor, and Thunderbolt is a better option against more relevant threats.</p> <p>If Porygon carries Thunder Wave, it is more useful early-game and can even be a viable lead. It can use Thunder Wave immediately on the common Arcanine lead and set up Agility thereafter. Against lead Nidoqueen, it can just set up Agility turn 1 then stall out Earthquake PP with Recover. Porygon generally forces in the opponent's Thunder Wave user, most commonly Staryu, allowing Porygon to trade paralysis with it. Sometimes, Gastly can come in instead to attempt to inflict sleep, but Hypnosis's shaky 60% accuracy makes this strategy risky, and Gastly becomes a lot worse once paralyzed. This benefits teammates like Seaking and Nidoqueen, which can deal with Staryu and Gastly once they're paralyzed.</p> <p>If Porygon is using a set that lacks Thunder Wave, it should be reserved for late-game. Despite negating the Speed drop with Agility, this set still hates paralysis, since full paralysis can prevent crucial turns where Porygon has to use Recover. As a result, it is important to KO or weaken paralysis spreaders such as Staryu, Drowzee, and Vileplume beforehand. Once these threats are accounted for, Porygon should ideally enter the field after a teammate is KOed, since directly switching into an attack leaves it very vulnerable to a critical hit. At this point, Porygon is free to set up Agility and try to sweep. Once Porygon sets up, it should only attack when it is near or at full HP, since it is generally KOed by a critical hit if it's any weaker. For example, a critical hit Earthquake from Nidoqueen can do up to 81.9%. Because of this, Porygon should try to stall Nidoqueen's Earthquake PP then attack once the move's PP is fully depleted. Porygon also faces issues from a trio of very common Agility users in Fearow, Arcanine, and Seaking. They can all use Agility themselves to outspeed even a boosted Porygon; in fact, at +2 Speed, Fearow and Arcanine outspeed even a +4 Porygon. Because of this, it is generally recommended that Porygon attacks these foes right away before they have the chance to set up. However, this issue is alleviated if Porygon carries Thunder Wave.</p> <p>Porygon's best teammates are ones that can weaken Thunder Wave users to enable it late-game. Fearow, Scyther, Arcanine, and Rapidash are great teammates since they do heavy damage to all Thunder Wave users; for example, Fearow's Hyper Beam does up to 86.3% on Drowzee and 96.1% on Staryu. Drowzee is also a good teammate since it can trade Thunder Waves with opposing Drowzee and Staryu. Porygon works well alongside other Agility users such as Seaking and Dragonair, as they can work together to wear down checks and sweep a team. Porygon also appreciates the support of teammates that can check the trio of Agility users. Staryu and Gastly check Seaking, while Nidoqueen can take on Fearow and Arcanine while preventing them from switching out safely. If Porygon is used as a lead, Seaking and Nidoqueen are fantastic teammates that can take advantage of the paralysis that Porygon spreads early-game.</p>"
      },
      "Support": {
        "description": "<h4>Set Description</h4> <p>This set takes advantage of Thunder Wave and Recover to spread paralysis and wall foes. Porygon paralyzes a foe with Thunder Wave then uses Recover to heal the damage it takes until its foe is fully paralyzed, giving Porygon an opening to attack. Psychic has the best neutral coverage against most of the tier, most notably hitting Gastly super effectively, while Thunderbolt hits top threats such as Fearow, Seaking, and Staryu for super effective damage. Double-Edge is an alternative that hits Drowzee and Abra notably harder, while Blizzard does more to Nidoqueen and Fearow than Thunderbolt, although it gives Porygon a harder time against Water-types.</p> <p>It is not recommended to switch Porygon directly into an attack from faster Pokemon such as Nidoqueen and Arcanine, as it leaves Porygon vulnerable to critical hits. The easiest Pokemon for Porygon to switch into are Graveler and Omanyte, as Porygon outspeeds them, allowing it to act before it gets hit a second time. Once Porygon enters the field, it should paralyze the foe and use Recover until the foe is fully paralyzed, then proceed to attack. There are several things to watch out for, though. Agility users can simply use Agility to outspeed Porygon, and Fearow and Arcanine in particular are likely to break through Porygon with critical hits. However, Psychic's chance for a Special drop can re-apply the Speed drop from Paralysis, making the Agility users slower than Porygon once again. Porygon itself hates taking paralysis, since it no longer outspeeds paralyzed foes, and one full paralysis on a Recover turn can be fatal for it. However, in certain scenarios it is worth trading Paralysis with a foe, such as paralyzing an opposing Staryu to enable one's Seaking.</p> <p>Since Porygon walls Graveler and Omanyte while unparalyzed, Pokemon that are forced out by the Rock-types, such as Fearow, Scyther, Rapidash, and Arcanine, are great teammates. They also have great matchups against Thunder Wave users, such as Drowzee and Staryu, making it harder for the opponent to paralyze Porygon. Seaking appreciates Porygon's ability to trade paralysis with opposing Staryu, which walls Seaking while unparalyzed, allowing Porygon to enable a Seaking sweep. Porygon also appreciates other Thunder Wave users to make it easier for Porygon to switch into foes.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 540559, "username": "gastlies"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 535530, "username": "Gangsta Spongebob"}, {"user_id": 583793, "username": "Sabelette"}]}, {"name": "Grammar checked by", "members": [{"user_id": 583793, "username": "Sabelette"}]}]}
  },
  "Omanyte": {
    "overview": "<p>Omanyte's combination of solid bulk and a Rock / Water typing perfectly counters Rapidash and Arcanine, denying them meaningful progress, and also makes it an effective switch-in to Fearow and Scyther. As these Pokemon are incredibly common offensive threats, Omanyte will almost always have several opportunities to stop a powerful progress-maker in its tracks and then make its own progress. However, while few Pokemon enjoy switching into Omanyte's decently powerful Surf and Blizzard or risking Body Slam paralysis, choosing the wrong move for its switch-in—such as Surf for Seaking or Body Slam for Gastly—leaves it in a bad position. Most of these foes can also switch into Omanyte's attacks at least once and still beat it one-on-one. Omanyte also has an especially hard counter in Porygon, as Omanyte cannot 2HKO or paralyze it while Porygon can heal off the damage with Recover. Omanyte's terrible Speed makes it loses the one-on-one to a variety of metagame threats, such as Nidoqueen and Drowzee, which can force a powerful attack or status condition on one of Omanyte's teammate as it's forced out. Omanyte's low HP also leaves it extremely vulnerable to fixed-damage moves, which 3HKO it. Additionally, its switch-ins are very predictable, making it exploitable with double switching. Pokemon checked by Omanyte have ways to mitigate its effectiveness, as Fearow's sheer power and critical hit rate can quickly wear it down, while Rapidash can use Fire Spin to switch out if its team lacks a decent Omanyte switch-in. Effective use of Omanyte requires a team that can handle its shortcomings and careful management of its HP, and despite walling some top threats, players should consider other options before using Omanyte.</p>",
    "comments": "<h3>Other Options</h3> <p>Hydro Pump is much stronger than Surf, notably having around a 47% chance to 2HKO Gastly, a 59% chance to 2HKO Abra, an 83% chance to 2HKO opposing Omanyte, and an 85% chance to OHKO the rare Sandslash, feats Surf can never achieve without a critical hit. Hydro Pump's extra damage against Drowzee leaves it always in range of Machamp's Hyper Beam or two Seismic Tosses, and it gives Rapidash's Hyper Beam and Pinsir's Slash favorable odds to KO Drowzee as well. However, Hydro Pump's poor accuracy makes it quite unreliable, with Surf usually being preferred over its inconsistent counterpart.</p> <h3>Checks and Counters</h3> <p><strong>Porygon</strong>: Porygon outspeeds Omanyte, isn't 2HKOed by Surf or Blizzard, is immune to Body Slam paralysis, and can heal off damage with Recover, making it Omanyte's worst matchup.</p> <p><strong>Water-types</strong>: While they all dislike paralysis, none of Omanyte's attacks do significant damage to any of the tier's Water-types, whereas they can easily overwhelm it with their STAB moves in return. Staryu can wall Omanyte indefinitely as a result of its access to Recover, while Seaking can set up Agility to negate the Speed drop from paralysis. The rarer Slowpoke and Poliwag can use Omanyte as setup fodder for Amnesia freely.</p> <p><strong>Gastly</strong>: Gastly is uniquely immune to Body Slam while only being 3HKOed by Surf, affording it numerous opportunities to switch in and threaten Omanyte with its higher Speed, Hypnosis, and a 2HKO with Thunderbolt.</p> <p><strong>Drowzee</strong>: Drowzee can outspeed and put Omanyte to sleep with Hypnosis and can usually win the one-on-one with Psychic if sleep isn't available.</p> <p><strong>Earthquake Users</strong>: Machamp outspeeds and 2HKOes Omanyte with Earthquake while only being 3HKOed by Surf in return. While they cannot switch in, Ground-types such as Nidoqueen and the rare Sandslash outspeed and 2HKO Omanyte with Earthquake while only being 2HKOed in return, allowing them to easily win the one-on-one or pick off a weakened Omanyte.</p> <p><strong>Grass-types</strong>: While rare and vulnerable to Blizzard, Weepinbell and Vileplume serve as effective Omanyte checks. Both outspeed it; the former OHKOes Omanyte with Razor Leaf, while the sheer bulk of the latter allows it to reliably 2HKO Omanyte with Mega Drain. Both threats can also put Omanyte to sleep with Sleep Powder.</p>",
    "sets": {
      "Standard": {
        "description": "<h4>Set Description</h4> <p>Surf is a decently strong attack that 3HKOes most neutral targets and 2HKOes some notable foes like Rapidash, Arcanine, and Nidoqueen. Blizzard serves as coverage against Fearow, Scyther, Dragonair, and the rare Grass-type such as Vileplume. Body Slam lets Omanyte fish for paralysis on all of its switch-ins barring Gastly and Porygon, allowing Omanyte to still make some progress against Water-types such as Staryu and Seaking. Rest is Omanyte's only form of recovery, but it's unreliable due to the number of turns it leaves Omanyte helpless and thus is best used to secure late-game victories against Rapidash, Arcanine, and Fearow.</p> <p>Omanyte partners well with many offensive Pokemon that are outsped by Rapidash, Arcanine, Scyther, and Fearow, such as Pinsir and Machamp. Ironically enough, Rapidash, Arcanine, Scyther, and Fearow also appreciate Omanyte's support, as it secures their mirror matchups and protects Fearow and Arcanine from being revenge killed. In return, these wallbreakers and sweepers can power through defensive Pokemon such as Staryu, Porygon, and Drowzee, which Omanyte can't break past on its own. These threats can also check foes that give Omanyte trouble, such as Machamp handling Nidoqueen and Rapidash handling Pinsir. On the defensive end, Staryu is a great partner for its ability to eternally wall Seaking, which otherwise can use Omanyte as setup fodder. Drowzee, while not as iron-clad, is capable of checking special attackers, such as Gastly, Abra, and Staryu, which give Omanyte trouble. Paralysis support from these Pokemon also goes a long way in helping Omanyte's team break through Porygon for it.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 535530, "username": "Gangsta Spongebob"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 593464, "username": "Teh"}, {"user_id": 583793, "username": "Sabelette"}]}, {"name": "Grammar checked by", "members": [{"user_id": 583793, "username": "Sabelette"}, {"user_id": 384270, "username": "autumn"}]}]}
  },
  "Dragonair": {
    "overview": "<p>Dragonair is one of the premier support Pokemon in RBY PU thanks to its access to Thunder Wave and Wrap, useful defensive typing, and diverse coverage. It is also the only viable user of the controversial \"AgiliWrap\" combination, which, while inconsistent, is able to spread chip damage onto the opposing team and bring foes into 2HKO or even OHKO range for Dragonair's teammates. Its base 70 Speed is relatively mediocre, but this still puts it ahead of threats like Seaking, Drowzee, and Porygon, and its Dragon typing helps it fend off Rapidash, Arcanine, and Staryu, which rarely runs Blizzard. In fact, both Rapidash and Arcanine have a mere 0.3% chance to 4HKO Dragonair with Fire Blast and only 3HKO it with Normal-type attacks; Staryu's Surf is a 6HKO, and Psychic is a 5HKO. Thanks to either Thunder Wave or Agility, Dragonair can outpace faster threats and use Wrap to force them to switch out. Its damage output is nothing to scoff at, either—not only does Wrap deal upwards of 4% per hit to most targets, but Blizzard 2HKOes Fearow and has a very slim chance to 2HKO Nidoqueen, while Thunderbolt easily 2HKOes Staryu. All of these factors combine to make Dragonair a difficult threat to handle, as the few faster Pokemon that can 2HKO it have difficulty finding safe entry, often fear paralysis, and usually take massive damage from Dragonair's coverage moves.</p> <p>Dragonair's weaknesses are typical of a non-fully evolved Pokemon in PU; it's relatively frail, fearing 2HKOs from Blizzard users, Pinsir, and Fearow, and this frailty is on full display once it's paralyzed and unable to use Wrap effectively. Its Speed falls short of some critical targets like Pinsir, Fearow, Rapidash, Arcanine, and notably Nidoqueen, so it's quickly worn down and easily revenge killed. It also has difficulty spreading paralysis without taking it in return from various faster Thunder Wave users, and Nidoqueen can switch into Wrap or a predicted Thunder Wave for a relatively safe entry. Dragonair's typing is useful defensively but useless offensively, so it's unable to deal significant damage to neutral targets without Wrap, and its 85% accuracy means it's bound to miss sooner or later. Moves that might alleviate this, like Hyper Beam, are hard to fit without giving up other matchups; Dragonair already struggles with the Wrap-immune Gastly and wants to avoid being walled by Omanyte and Graveler.</p>",
    "comments": "<h3>Other Options</h3> <p>Dragonair has a plethora of niche options. Hyper Beam has a 20% chance to OHKO Abra and also deals approximately 50% to Staryu and Drowzee; it's also not bad against Fire-types, dealing over 36% to Rapidash. This is particularly useful for AgiliWrap Dragonair, as it already relies on its allies to remove threats that might stonewall Hyper Beam, like Rock-types and Gastly, but it requires giving up valuable coverage and leaves Dragonair walled by either Graveler or Omanyte. Surf is Dragonair's best option against Fire-types, and it also OHKOes Graveler, but this requires giving up Blizzard's extra damage against Nidoqueen and Fearow and leaves it walled by opposing Dragonair. Fire Blast 2HKOes Pinsir but provides little else; burns can provide extra chip damage when using Wrap, but it's less consistent than other moves. Toxic seems like a useful option to combine with Wrap, but Dragonair lacks the bulk and Speed to spread and exploit it; poisoning foes also renders them immune to Thunder Wave, limiting Dragonair's utility against fast Pokemon like Arcanine and Rapidash.</p> <h3>Checks and Counters</h3> <p><strong>Gastly</strong>: Gastly outspeeds Dragonair, can put it to sleep with Hypnosis, and is immune to Wrap. Dragonair can only 4HKO it with Blizzard, while Gastly 4HKOes Dragonair with Psychic. A Special drop makes the matchup even worse, letting Gastly KO it even faster and reducing Dragonair's damage to pitiful levels. Since Gastly can function as a lead or remain in the back, it causes headaches for all variants of Dragonair.</p> <p><strong>Paralysis</strong>: Paralysis both exposes Dragonair's frailty, since it can no longer outspeed most foes and use Wrap, and removes its consistency, causing Wrap to fail about 36% of the time. Agility may cancel the Speed drop, but most Pokemon can wait for an inevitable full paralysis and punish accordingly.</p> <p><strong>Blizzard Users</strong>: Every Blizzard user can 2HKO Dragonair, and most outspeed it. Nidoqueen is the classic Dragonair check, as it's faster and immune to Thunder Wave, and it packs a lethal Blizzard. Staryu can use Blizzard and also has Thunder Wave to prevent Wrap shenanigans. Seaking and Omanyte are slower than Dragonair, but they can punish a Wrap miss as well.</p> <p><strong>Fast Physical Attackers</strong>: Fearow and Pinsir are both able to 2HKO Dragonair, easily revenge killing it after any chip or punishing Wrap misses, but they fear Thunder Wave.</p> <p><strong>Burn</strong>: A burn puts Dragonair on a timer and reduces its damage output with Wrap. This is less of an issue for support Dragonair, which can still contribute with Thunder Wave, but it robs AgiliWrap Dragonair of its main asset.</p>",
    "sets": {
      "Support": {
        "description": "<h4>Set Description</h4> <p>Dragonair can provide excellent utility for its team with Thunder Wave, which lets it hamstring Recover users as well as fast attackers like Fearow, Pinsir, and Rapidash. Until its set is revealed, it's difficult for the opponent to switch valuable targets like Rapidash out before they take paralysis due to fear of an Agility set, making it easy to spread paralysis early-game. Once the foe is paralyzed, Dragonair can use Wrap to wear it down or force it out. Wrap also allows Dragonair to lock down foes it naturally outspeeds, like Drowzee, and prevent them from making progress. Blizzard and Thunderbolt are Dragonair's best options to cover as many foes as possible. Blizzard 2HKOes Fearow, Graveler, and Sandslash and has a minuscule chance to 2HKO Nidoqueen, but this is shored up if it repeatedly switches into Wrap. Thunderbolt, meanwhile, 2HKOes Staryu, rarely 2HKOes Omanyte, and 3HKOes Seaking. Most targets that are not weak to BoltBeam coverage are either slower than Dragonair, like Machamp, or fear paralysis, like Fire-types and Pinsir.</p> <p>This set is often used as a lead, as it outspeeds Drowzee and can force it out with Wrap, and it handily beats Fire-types with Thunder Wave + Wrap. In this role, Dragonair seeks to paralyze a foe then force it out with Wrap, accumulating chip damage on the paralyzed foe and the opposing switch-in, which is likely to be the omnipresent Nidoqueen. From here, Dragonair has the advantage on pivoting to stay ahead in the game. Support Dragonair benefits from slower teammates that exploit paralysis, like Nidoqueen, Machamp, and Sandslash, which can heavily punish paralyzed foes with their perfect coverage and appreciate free switch-ins granted by Wrap. As a lead, Dragonair struggles against Gastly, banking on a 40% chance for Hypnosis to miss so it can land Thunder Wave. Pokemon like Drowzee can check Gastly after a teammate has been put to sleep.</p>"
      },
      "AgiliWrap": {
        "description": "<h4>Set Description</h4> <p>Dragonair becomes a terror after setting up Agility, as it outspeeds the entire unboosted metagame and wears foes down with Wrap. Against teams lacking Gastly, Wrap can easily deal upwards of 100% total damage spread across several foes. Even after using up all of its Wrap PP, Dragonair's coverage with Blizzard and Thunderbolt allows it to 2HKO or 3HKO most of the metagame; chip damage from Wrap makes a lot of these matchups even better. For example, without Agility, Dragonair loses to Nidoqueen, which outspeeds and 2HKOes it. However, Dragonair deals a minimum of 88% to Nidoqueen with two Blizzards, so Dragonair beats it easily after setting up Agility and chipping it with a few hits from Wrap. If Dragonair misses Wrap against a heavily weakened foe, it essentially gets to throw out an attack for free as the foe switches out, racking up more damage while preserving Wrap PP. This is especially relevant against foes like Fearow, Seaking, and Staryu, all of which take heavy damage from Wrap and one of Dragonair's other attacks.</p> <p>This Dragonair set is exclusively used in the mid- and late-game, usually seeking to enter after a foe lacking a paralysis move, such as Fearow or Pinsir, lands a KO. Dragonair also can attempt to set up in front of Fire-types, as their only recourse is to try for a 30% burn or paralysis chance. This allows it to set up Agility at the cost of admittedly heavy chip damage, after which it can spam Wrap to chip down the enemy team. A miss against a healthy foe can thus be devastating, as Dragonair is often in OHKO range of powerful foes like Fearow and Nidoqueen after setting up. However, if the opponent chooses to stay in on Wrap, their Pokemon will take far more chip damage per Wrap use, and if they choose to switch after each Wrap, Dragonair will need to miss twice, a mere 2.25% chance. That said, foes like Gastly, Graveler, and Omanyte can cause issues for Dragonair. Dragonair is forced to switch out or simply duel Gastly; fighting it is tricky, as they mutually 4HKO each other, but Gastly has the superior critical hit rate and a chance for a Special drop from Psychic, clinching the matchup. Gastly can also use Explosion at low health to trade with Dragonair, which is usually a favorable trade for Gastly after it has put a foe to sleep. Teammates that can fend off Gastly, like Drowzee, Sandslash, and Abra, can help to remove it before Dragonair sets up; Magmar is also a great lead to counter Gastly lead. Graveler and Omanyte can riskily reduce Wrap chip by wasting PP for minimal damage, but both have to fear Dragonair's special coverage. This set also benefits from fast allies that can clean up a chipped team, like Fearow, Pinsir, and Rapidash.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 583793, "username": "Sabelette"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 535530, "username": "Gangsta Spongebob"}, {"user_id": 540559, "username": "gastlies"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  }
}