{
  "Charizard": {
    "overview": "<p>Charizard is among the best Fire-types in RBY NU and a near-staple in the tier, allowing numerous offensive team styles to function. Possessing the coveted combination of 100 base Speed and Fire Spin, Charizard is not only one of the fastest Pokemon in the tier, but also an effective pivot and lead, making it difficult to pin down. It also has many offensive options to choose from, including but not limited to STAB Fire Blast, Earthquake, Slash, and Body Slam, giving it unpredictable coverage that makes it difficult to switch into; additionally, it can use Swords Dance to further boost its wallbreaking capabilities. Charizard's Flying typing also comes in handy, letting it switch in on Earthquake from the likes of Nidoking, Golem, or the rare Sandslash to gain momentum with Fire Spin thereafter; in Nidoking's case, it can even deal big damage with its own Earthquake.</p> <p>Despite its highs, Charizard has trouble breaking past Water-types without already having a boost due to its weaknesses to Water and Ice, often forcing it to use Fire Spin and pivot to a teammate. Similarly, its weakness to Rock Slide makes Ground-types like Golem and Nidoking noteworthy adversaries, and Fire Spin's inaccuracy can make it unsafe to attempt pivoting out against them. Finally, Charizard is incapacitated by paralysis, losing almost all of its offensive presence. It also competes with other Fire-types like Moltres, Rapidash, and Ninetales, though they are often seen alongside it.</p> ",
    "sets": [
      {
        "name": "Fire Spin Pivot",
        "description": "<p>Charizard's defining set uses its blazing Speed and Fire Spin to choke out slower teams, either whittling down their HP until its teammates can clean up or pivoting out from its checks. Because viable Pokemon that Speed tie or outspeed Charizard are limited to Electrode, Fearow, Ninetales, Rapidash, and itself, in many scenarios, Fire Spin is limited only by its own inconsistency. STAB Fire Blast hits extremely hard, guaranteeing an OHKO on Exeggcute and Pinsir while dealing massive damage to anything else. For example, it 2HKOes Fearow and Sandslash, and even a single turn of burn or critical hit can greatly extend this range to Pokemon like Mr. Mime and Nidoking. Earthquake covers most opposing Fire-types, Nidoking, Kabutops, and Golem, 3HKOing most and being boosted by Swords Dance.</p> <p>While the aforementioned moves define the set, Charizard's last moveslot defines its role. Slash allows Charizard to be a consistent revenge killer, providing unresisted coverage alongside Earthquake by hitting Moltres and opposing Charizard for neutral damage. It also deals more damage to neutral targets than Earthquake, such as Seadra. Swords Dance boosts Earthquake's damage enough that it can 2HKO Golem and Mr. Mime, as well as sometimes OHKOing Ninetales. Finally, Toxic has Charizard function as a check to opposing wrappers, such as Dragonair, Rapidash, and Ninetales, as well as making it easier to chip down walls like Golem and Blastoise with Fire Spin. Checking wrappers bolsters its lead viability given the presence of opposing Fire Spin leads like Rapidash and Ninetales.</p> <p>This set can run Counter to be more effective against Body Slam users, as well as providing a point of entry against a predicted Hyper Beam to KO the foe next turn. Furthermore, it does massive damage against opposing Slash Charizard. This can give you massive momentum, as your Counter Charizard is poised to win the matchup thereafter. Body Slam is also viable over Slash to let Charizard support its teammates with paralysis while gaining a more solid midground option, but the damage leaves much to be desired.</p> <p>Fire Spin Charizard can be used on a wide variety of offensive teams thanks to its incredible coverage and Speed. It's an effective lead, possessing the coverage and fast Fire Spin necessary to ensure early-game momentum against other leads like Poliwhirl and Mr. Mime. However, Rapidash can be problematic and compete for the lead slot due to being faster with its own Fire Spin. Charizard's better long-term presence means the two are about equally good leads. If not used as a lead, Charizard is best brought in aggressively, such as against weakened Pokemon or a predicted Earthquake. Charizard's Fire Spin can be used to apply pressure through chip damage against the opposing team, especially if a Pokemon has been poisoned, allowing Charizard to swiftly whittle them down and KO with its powerful coverage. If using Swords Dance, Charizard should only set up if a sweep is assured or if it helps break down a Pokemon asleep from Rest like Blastoise. It is also valid to use Swords Dance if both Charizard and an opposing Pokemon are paralyzed, as it reapplies the foe's Speed drop and may let Charizard win out, but these situations are rare and ideally avoided.</p> "
      },
      {
        "name": "Swords Dance Sweeper",
        "description": "<p>This set goes all-in on late-game Swords Dance sweeping, allowing Charizard to use its unresisted coverage in Earthquake and Hyper Beam to run over weakened teams and cleave open defensive cores. +2 Earthquake can 2HKO Golem and Mr. Mime, while a +2 Hyper Beam KOes even defensive staples like Arcanine and Blastoise from over half HP. +2 Earthquake + Hyper Beam can sometimes KO Pokemon like Seadra and Clefable.</p> <p>The final move used should determine Swords Dance Charizard's role throughout a game. Fire Spin is a fine option to let it pivot out of unfavorable matchups or chip foes into range for Hyper Beam. +2 Mega Kick is viable for KOing Blastoise, Moltres, and opposing Charizard in tandem with Hyper Beam. It should be used sparingly, though, as a miss can lead to a significant loss in momentum. Alternatively, Fire Blast can be used to dispatch Exeggcute, which otherwise takes a hit from the set and threatens it in return with paralysis or sleep.</p> <p>Swords Dance Charizard is one of the best checks to Rest users in RBY NU, being an effective way to consistently break through common defensive cores like Arcanine or Moltres alongside Blastoise. This set also profits from the way players conventionally react to Fire Spin users: Toxic arguably benefits it, preventing paralysis and thus allowing Charizard to be used more liberally against Pokemon like Exeggcute and Mr. Mime. Thanks to these traits, it's best to use Swords Dance Charizard on aggressive teams featuring sleepers like Venomoth, as well as Fire Spin pivots such as Rapidash or Ninetales, which can help Charizard find opportunities to set up and sweep. Pairing it with a Water-type attacker like Seadra is also helpful, providing a two-pronged physical and special offense. Plus, Seadra ensures Pokemon like Golem—which fare well against this set—can't come in for free. Seadra and Blastoise can reliably get opposing Blastoise to use Rest in prolonged interactions, which opens up its team to Charizard's setup.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 520967, "username": "pac"}, {"user_id": 231074, "username": "S1nn0hC0nfirm3d"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 236353, "username": "May"}]}
  },
  "Blastoise": {
    "overview": "<p>Blastoise is one of the most centralizing and defensively potent Pokemon in RBY NU. Its role in checking several of the tier's primary offensive threats, such as Seadra, Golem, Moltres, Arcanine, Charizard, and opposing Blastoise, is essential for the majority of teams to function. In addition, it is especially notable for absorbing Fire Spin from Rapidash, Ninetales, and the aforementioned Charizard, punishing misses extremely effectively. Blastoise is also a legitimate offensive threat, with its combination of STAB Water-type attacks and Ice-type coverage being hard for much of the tier to take reliably, being resisted only by Water-types.</p> <p>However, Blastoise's mediocre Speed leaves it outrun by numerous offensive threats like Mr. Mime, Electrode, Nidoking, Kabutops, and all viable Fire Spin users. Electrode and Mr. Mime are especially problematic, with their powerful Thunderbolts often forcing Blastoise to switch out and lose momentum. In addition, it struggles to break through opposing Blastoise, meaning that the opponent will usually have a very safe switch-in to Blastoise.Blastoise's reliance on Rest can let strong attackers such as Charizard, Nidoking, Pinsir, and Fearow exploit it, especially since its Speed makes it hard to threaten foes after waking up. This lets dangerous Swords Dance users like Charizard, Kabutops, Kingler, and Pinsir set up for free. Finally, Porygon hard counters Blastoise due to its immunity to Body Slam paralysis, Recover, Thunder Wave, and ability to either 3HKO Blastoise with Thunderbolt or whittle it down with Psychic.</p> ",
    "sets": [
      {
        "name": "Bulky Attacker",
        "description": "<p>Surf 2HKOes notable Ground- and Fire-types like Nidoking, Charizard, Arcanine, Ninetales, and Rapidash, while Golem is OHKOed. Alternatively, Hydro Pump sacrifices accuracy for power, securing a 2HKO on Moltres, a possible 2HKO versus Kabutops, and a guaranteed 3HKO against Clefable. Ice Beam grants Blastoise unresisted coverage, except versus opposing Water-types. Most notably, it always 2HKOes Exeggcute and helps break through opposing Blastoise more easily due to freeze. As another option, Blizzard sacrifices PP and a bit of accuracy for more damage, notably confirming the 2HKOs on Dragonair and the niche Weepinbell. Body Slam spreads paralysis, punishing switch-ins while mitigating Blastoise's mediocre Speed, while also dealing solid damage to opposing Water-types like Seadra and Poliwhirl. Alternatively, Toxic is the best response to partial trapping from the likes of Pinsir and Dragonair. In addition to this, if  the opponent has already slept a teammate, Toxic acts as an effective stop to Amnesia Poliwhirl, forcing it out due to chip damage before it can set up and break through Blastoise. A poisoned Poliwhirl—or other target—is also less effective at absorbing partial-trapping moves, letting teammates like Rapidash, Ninetales, Pinsir, and Dragonair chip it much more. Finally, Rest complements Blastoise's bulk with the longevity and status healing to consistently switch into Fire-types, opposing Blastoise, and Seadra. Rest is best used versus the aforementioned Fire- and Water-types, as they are largely unable to immediately threaten Blastoise—outside of Charizard, which typically switches out due to the threat of STAB Surf, paralysis, or Toxic.</p> <p>Blastoise has a few other possible options, though they are rare due to the valued consistency of the main set. Seismic Toss is the most enticing, being Blastoise's strongest attack versus opposing Blastoise, consistently 4HKOing it. If it's used on the turn the opposing Blastoise uses Rest, then your Blastoise is poised to KO if it wins a Speed tie on the foe's wakeup turn. Reflect or Withdraw boosts Blastoise's already fantastic Defense, with a +2 Blastoise taking less than 43% from even a +2 Kingler's Hyper Beam. Reflect gives a large boost immediately, but Withdraw has higher potential long-term, including in regards to PP stall. However, both fail to solve Blastoise's susceptibility to Thunderbolt, thus letting potent special attackers like Electrode and Mr. Mime switch in freely. Slash users such as Charizard, Kabutops, and Pinsir also ignore both moves. Earthquake is Blastoise's strongest attack versus Electrode and the rare Gastly, 2HKOing the former and having a 59% chance to OHKO the latter. Lastly, Counter allows Blastoise to switch in on potent physical attackers like Raticate and Charizard and deal vast sums of damage. It is also relevant versus Fire-type mixed attackers like Charizard and Arcanine, letting Blastoise switch into their Normal-type attacks to force them out and nail any switch-ins. However, most of the best targets for Counter have options to avoid it like Drill Peck or Thunderbolt. In addition, using it removes the surprise factor, which often leaves it useless after the first attempt.</p> <p>Blastoise should be preserved throughout the early- and mid-game, as it can consistently halt momentum from the foe's primary offensive threats like Moltres and Seadra. In addition to this, losing Blastoise can make it much trickier to contest opposing Blastoise, as it will check many of your own threats. Due to this, the Blastoise mirror match will happen quite frequently and will often influence the course of an entire game. Blastoise can either fish for freeze with Ice Beam or eventually force a Rest with Body Slam or Toxic.</p> <p>Blastoise pairs well with Pokemon that can prevent matchups with opposing Blastoise, such as Electrode and Mr. Mime, which both 2HKO with Thunderbolt with minor chip damage. While niche, Gastly is surprisingly notable for this role as well, freely pivoting in on Body Slam while threatening a 2HKO with Thunderbolt after minor chip damage. Blastoise also pairs well with Fire- and Ground-types like Arcanine, Golem, and Moltres due to it effectively handling opposing Blastoise, Kabutops, Seadra, and Poliwhirl, which they can struggle with. Fire-types also decrease the pressure on Blastoise to constantly switch into the likes of Moltres. If paired with multiple Fire Spin users, Toxic Blastoise is preferred, as Toxic helps them more consistently check Water- and Fire-types. Blastoise also finds its way onto teams with multiple other Water-types like Kabutops and Poliwhirl, which makes teams incredibly strong defensively versus offensive teams that wield multiple Fire-types, as well as keeping good matchups versus other teams with multiple Water-types. This dichotomy of Fire-types and Water-types drives offense in RBY NU, although Electrode and Mr. Mime can exploit it offensively. Golem is especially notable as a Blastoise partner due to this, since it completely stonewalls Electrode, which Blastoise despises, while checking Mr. Mime. Alternatively, Exeggcute also checks Electrode and Mr. Mime, though it doesn't completely negate Electrode in the same way that Golem does. Other options for the role of checking Mr. Mime include Drowzee, Clefable, Arcanine, and Ninetales. In addition, Blastoise synergises with offensive Pokemon susceptible to Golem like Fearow, Electrode, and Scyther, checking Golem for them to wreak havoc more consistently. Finally, Blastoise pairs well with Porygon, as it hard counters opposing Blastoise and therefore decreases the defensive pressure on Blastoise, letting it focus on performing other duties like checking Fire-types. In addition to this, Conversion Porygon checks Mr. Mime, which threatens Blastoise with hefty damage.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 236353, "username": "May"}, {"user_id": 530877, "username": "Volk"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 520967, "username": "pac"}]}
  },
  "Butterfree": {
    "overview": "<p>Butterfree is the only Pokemon in RBY to both have access to the coveted \"Double Powder\" combination and an immunity to Earthquake. This lets it come in on Earthquakes from the likes of Golem and Sleep Powder. After fulfilling its primary role of sleep, Butterfree can theoretically apply pressure with Stun Spore and Psychic.</p> <p>However, Butterfree finds extremely stiff competition in Venomoth and Exeggcute. The former outspeeds Nidoking and Pinsir and Speed ties Mr. Mime. The latter has more defensive utility as a check to Electrode, Venomoth, and Mr. Mime. Additionally, Butterfree's offensive presence is lackluster due to its lack of STAB moves as well as mediocre offensive stats. It also has a bad defensive typing, with crippling weaknesses to common Fire-, Electric-, Ice-, and especially Rock-type attacks, notably being OHKOed by Moltres's Fire Blast. This limits Butterfree’s utility greatly, rendering it generally useless after it puts something to sleep.</p> ",
    "sets": [
      {
        "name": "Double Powder",
        "description": "<p>Crippling foes with Sleep Powder is Butterfree's primary reason to be used. Stun Spore pairs with Sleep Powder well, allowing Butterfree to threaten status even after inflicting sleep, and it is one of the most reliable ways to spread paralysis, as it hits the Ground-types that would normally render Thunder Wave ineffective. Psychic pressures slower Poison-type Pokemon such as a paralyzed Nidoking and Venomoth. Psywave is Butterfree's strongest neutral attack against Psychic-types and specially bulky Pokemon like Mr. Mime, Drowzee, Abra, and Moltres. However, it is a wildly inconsistent move due to its awful accuracy of 79.03%, as well as its varying damage output.</p> <p>Butterfree's small movepool leaves few other options. Mega Drain is its strongest option versus Rock-types such as Golem and Kabutops. However, it is generally not worth it in most matchups. Toxic makes it less vulnerable to Wrappers such as Dragonair and Pinsir. Hyper Beam is Butterfree's strongest physical attack, allowing it to deal decent damage to opposing Psychic-types more consistently than Psywave.</p> <p>Butterfree can function as a sleep lead or mid-game utility Pokemon with Sleep Powder, putting something that it can take a hit from, such as Seadra, to sleep. After inflicting status, Butterfree is relegated to absorbing status as fodder. It struggles against Fire-types such as Charizard, Moltres, and Rapidash, meaning that Water- and Rock-types are exceptional teammates. Blastoise and Golem are great examples, taking both Fire- and Rock-type moves with ease. Nidoking is another good partner, as it can take out the aforementioned Fire- as well as Rock-type Pokemon with Rock Slide and Earthquake, and it's able to check Electrode due to its Ground typing.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 520967, "username": "pac"}, {"user_id": 236353, "username": "May"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 487308, "username": "BT89"}]}
  },
  "Beedrill": {
    "overview": "<p>With the best ways to super effectively hit Psychic-types in the game, STAB Twineedle and Pin Missile, Beedrill seems like it would be a worthwhile choice. It can operate as a late-game sweeper once opposing bulky Pokemon have been taken out or the opposing team is weakened. Once it has set up Swords Dance and Agility, it is able to 2HKO threats such as Nidoqueen and Venomoth, even OHKOing Mr. Mime and Exeggcute after a Swords Dance boost.</p> <p>However, Beedrill has some horrid flaws that cannot be overlooked. Mainly, its stat spread is outright terrible, with its horrid defenses alongside five weaknesses leaving it unable to take hits from common threats. It's slow and unable to hit very hard without setting up, which it usually cannot do due to it being 2HKOed by most of the metagame. Because of this frailty, it is forced to set up on a foe that is unable to attack for two turns, such as one that's frozen or sleeping. It also has a terrible offensive movepool, only getting Bug-type STAB moves, the ubiquitous Hyper Beam, and nothing else. Because of this poor coverage, it gets walled by many Pokemon and gets destroyed in return. Overall, Beedrill is a horrible Pokemon in the RBY NU metagame and usually has no impact on a serious game. Many other Pokemon — such as Pinsir and Kingler — can take better advantage of the support it requires.</p> ",
    "sets": [
      {
        "name": "Double Dance",
        "description": "<p>Agility allows for Beedrill to outspeed most viable Pokemon and shake off paralysis’s Speed drop. Swords Dance is necessary for Beedrill to be able to sweep weakened teams. Getting both moves off is hugely important for this set to function. Twineedle is able to do severe damage to notable threats after a Swords Dance, most importantly OHKOing Mr. Mime and Exeggcute. Hyper Beam lets Beedrill finish off frail Pokemon, such as Primeape, Rapidash, and Electrode.</p> <p>While Beedrill has a very small movepool, it still has a few other options it can use somewhat effectively. Toxic is Beedrill's most consistent way to check Fire Spin users such as Charizard and Rapidash, which happen to often switch in on it due to their threat of STAB Fire Blasts. Mega Drain stops Golem and Kabutops from completely walling Beedrill, wielding chances to 3HKO both of them while also being Beedrill's most reliable form of recovery. Pin Missile is a less consistent but potentially deadlier alternative to Twinneedle, notably having a chance to OHKO Exeggcute unboosted.</p> <p>Beedrill often has trouble reliably setting up often, so sleepers like Poliwhirl and Exeggcute are great for it. Bulky Pokemon like Golem and Kabutops that resist Bug need to be weakened or knocked out if Beedrill hopes to sweep. Thus, Water- and Electric-types like Blastoise, Kabutops, and Electrode can be effective partners.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Earlier version by", "members": [{"user_id": 19, "username": "Hipmonlee"}]}, {"name": "Quality checked by", "members": [{"user_id": 236353, "username": "May"}, {"user_id": 505149, "username": "Sevi 7"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 487308, "username": "BT89"}]}
  },
  "Pidgeot": {
    "overview": "<p>Pidgeot is thoroughly outclassed by Fearow in RBY NU, except in the bulk department. Pidgeot has worse Speed and offensive stats plus a barren movepool lacking in reliable Flying STAB, making it unable to distinguish itself offensively. Furthermore, with bulky offensive Flying-types like Moltres in the tier, it struggles to actualize defensive roles as well. Ergo, Pidgeot should not be used on any competitive RBY NU team, and Pokemon like Fearow, Moltres, and Charizard should be looked to first.</p> ",
    "sets": [
      {
        "name": "Agility Sweeper",
        "description": "<p>This is the best that Pidgeot can muster with its horrid movepool. Double-Edge and Hyper Beam act as its STAB options, 2HKOing Pokemon like Raticate, Dragonair, Venomoth, Fearow, and Rapidash if used in sequence. Mirror Move gives Pidgeot some slight flexibility, allowing it to potentially use moves like Earthquake after switching in, but it won't help Pidgeot against Pokemon that don't use moves they're weak to, like Charizard and Rapidash. Agility allows Pidgeot to ignore the Speed drop from paralysis and outspeed the unboosted metagame, giving it a shot at a late-game sweep.</p> <p>Pidgeot doesn't have much in the way of customization due to its barren movepool. Toxic is a valid alternative to Agility for thwarting wrappers like Charizard, Dragonair, and Rapidash, making them take more damage than they deal. Sky Attack is an unwieldy but serviceable STAB option that can deal major damage, but it often just ends up letting Golem in. Finally, Substitute can be used to relieve prediction with bonus Mirror Move synergy, letting Pidgeot scout for a potential move to copy. Pidgeot is best used on teams that already include Fearow to develop a Normal attacking core, as otherwise, it has no niche in the tier whatsoever.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Earlier version by", "members": [{"user_id": 34, "username": "Lesm46"}]}, {"name": "Quality checked by", "members": [{"user_id": 530877, "username": "Volk"}, {"user_id": 265630, "username": "Amaranth"}, {"user_id": 520967, "username": "pac"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}, {"user_id": 33374, "username": "Muk"}]}], "writtenBy": [{"user_id": 236353, "username": "May"}]}
  },
  "Raticate": {"sets": [{"name": "Super Fang"}]},
  "Fearow": {"sets": [{"name": "Physical Attacker"}]},
  "Arbok": {
    "overview": "<p>Arbok distinguishes itself from other fellow Poison-types by paralyzing Ground-types, like Nidoking and Golem, thanks to its unique access to Glare. It also is one of the few Pokemon in the metagame to utilize Wrap, which allows it to whittle down foes and pivot to teammates. These moves, combined with its immunity to Toxic, let Arbok fit alongside other wrappers like Pinsir and Charizard for paralysis support and defensive synergy. Lastly, Arbok has good coverage options in Earthquake and Body Slam, which can make it difficult for Pokemon like Mr. Mime to switch in.</p> <p>Unfortunately, Arbok still fares terribly in the current metagame. Although its base 80 Speed is fast for a Wrap user, it still falls short of a multitude of top-tier threats, such as Nidoking, Mr. Mime, and Charizard. Despite its defensive typing letting it pivot into Toxic, which cripples other wrappers, it is abysmal overall: Arbok not only fails to resist notable offensive types, but is also quite vulnerable to a multitude of popular Ground- and Psychic-types like Golem, Exeggcute, and Mr. Mime. Although Arbok boasts higher Speed, Defense, and Attack than Dragonair, the latter’s Agility, Thunder Wave, and superior typing mean it will usually be the better choice. Lastly, Arbok’s meager bulk means it will be 2HKOed by most super effective and even neutral hits, like Mr. Mime’s Psychic, Golem’s Earthquake, and even Moltres’s Fire Blast.</p> ",
    "sets": [
      {
        "name": "Glare + Wrap",
        "description": "<p>Glare enables Arbok to be self-supportive and uniquely paralyzes Ground-types that otherwise check it, like Golem and Nidoking. Wrap racks up chip damage while letting Arbok pivot into teammates like Blastoise and Exeggcute. Earthquake is Arbok’s main attack, providing coverage against Ground-, Fire-, and Rock-types like Golem, Rapidash, and Ninetales. Body Slam is its most reliable attack and makes it annoying to switch into, while Rock Slide can 2HKO Moltres and Charizard, providing unresisted coverage alongside Earthquake.</p> <p>Arbok has a few other move choices. Toxic deters Fire Spin users and Dragonair from using it as setup fodder. Hyper Beam is Arbok’s strongest move and can finish off weakened foes, though its mediocre Attack stat prevents it from making full use of the move. Arbok pairs well with wrappers like Dragonair, Moltres, and Rapidash, working together to whittle down foes like Mr. Mime and opposing Ground-types. Pokemon that can stomach Psychic- and Ground-type attacks, such as Exeggcute and Blastoise, are also appreciated so Arbok can paralyze foes throughout a match. Arbok’s paralysis support against Nidoking enables Kingler and Kabutops to wallbreak or clean up more easily.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 236353, "username": "May"}, {"user_id": 520967, "username": "pac"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 543866, "username": "5Dots"}]}
  },
  "Sandslash": {
    "overview": "<p>Sandslash is able to carve out a solid niche in NU as the only fully evolved Ground-type that possesses Swords Dance and a neutrality to Earthquake. Thanks to its immunity to Thunder Wave, Sandslash can switch in more easily than other Swords Dance users, like Kingler and Pinsir, by predicting Thunder Wave from Pokemon like Electrode, Drowzee, and Mr. Mime. It further benefits from the coveted Earthquake + Rock Slide combination, alongside other key offensive moves like Substitute and Body Slam. Its Speed tier is also serviceable enough to outspeed key staples like Golem, Clefable, and Porygon. Lastly, Sandslash possesses good physical bulk, allowing it to combat physical attackers like Golem effectively. With paralysis support from Pokemon like Mr. Mime and Clefable, Sandslash can ravage the opposing team late-game.</p> <p>However, while having some use, Sandslash's Speed tier is still poor: the relevant Water-types of the tier, such as Kingler, Blastoise, Seadra, and Kabutops, will outspeed it, threatening significant damage before it can set up with Swords Dance. Ergo, they must be removed, severely weakened, or crippled for Sandslash to be effective. This usually causes it to rely on paralysis support, which many teams cannot afford to easily provide. Although Sandslash is immune to Thunder Wave, paralysis from Body Slam, Stun Spore, or Glare cripples its chances to sweep late-game, exposing its poor special bulk and cutting into what Speed it does have. Lastly, it faces heavy competition as a Ground-type from Nidoking and Golem: the former has a much more flexible movepool, better Speed, and a Toxic immunity, while the latter has access to STAB Rock Slide, an important resistance to Fire, more immediate power, and Explosion.</p> ",
    "sets": [
      {
        "name": "Swords Dance",
        "description": "<p>Swords Dance is Sandslash's calling card, driving its Attack stat to terrifying levels. At +2, it can threaten OHKOs on Pokemon like Electrode, Mr. Mime, and Nidoking with Earthquake. Rock Slide complements Earthquake, providing unresisted coverage and securing OHKOs on Charizard and Moltres after a boost; it also hits Pinsir and Fearow hard. Body Slam discourages switch-ins from Poliwhirl and Blastoise, potentially paralyzing them. Alternatively, Substitute can exploit predicted switches and grants Sandslash more opportunities to set up, especially given its immunity to Thunder Wave.</p> <p>Sandslash has a surprisingly interesting movepool, making it quite customizable. Slash gives Sandslash immediate power and tears through Pokemon relying on Reflect, such as Abra and rare variants of Mr. Mime, Clefable, and Wigglytuff. Toxic prevents partial trappers like AgiliWrap Dragonair, Charizard, Moltres, and Rapidash from pinning it down. Submission is its best option against Clefable, Porygon, and Wigglytuff; however, the recoil, shaky accuracy, and lower damage than Earthquake against neutral targets make it a niche option at best. Hyper Beam is Sandslash's best move against Exeggcute and matches Earthquake’s power but fails to notably hit other targets.</p> <p>As a result of its typing and good physical bulk, Sandslash can pivot in against Electrode and Golem as well as Pokemon running Rest, such as Moltres and Blastoise, which let it also break holes in the opposition with Swords Dance. Since they let Sandslash set up, sleeping Pokemon are effectively left on the sidelines until it is eliminated. Pokemon carrying Thunderbolt, like Clefable, that can deter Water-types like Seadra and Blastoise from staying in allows Sandslash to set up more easily. Chip damage from Fire Spin users like Moltres, Rapidash, and Charizard, as well as Wrap from Dragonair, is also appreciated to help secure OHKOs after a Swords Dance, which makes Sandslash more difficult to deal with over the course of a game. Lastly, paralysis support from the likes of Electrode and Mr. Mime allows Sandslash to not only have more setup opportunities, but also to fish for full paralysis with Substitute and become even more lethal.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 520967, "username": "pac"}, {"user_id": 236353, "username": "May"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 543866, "username": "5Dots"}]}
  },
  "Nidoqueen": {"sets": [{"name": "Mixed Attacker"}]},
  "Nidoking": {
    "overview": "<p>Nidoking is one of the most potent offensive threats in RBY NU, wielding the best coverage in the tier as well as a powerful and nearly unique typing which grants it a meaty STAB Earthquake and immunities to both Toxic and Electric-type attacks. These attributes allow it to block Toxic and Thunder Wave for partial trappers such as Charizard, Moltres, and Pinsir. These partial trappers also grant it numerous entry points through pivoting, and Nidoking can maintain offensive momentum when status users threaten them. Its frequent super effective hits and completely unresisted coverage, with both the coveted BlizzBolt and QuakeSlide combinations, makes it extremely threatening as both a mid-game wallbreaker and a late-game sweeper, especially when provided with adequate paralysis support.</p> <p>Despite this, Nidoking’s typing leaves it susceptible to numerous notable offensive threats such as Mr. Mime's Psychic, Clefable's Blizzard, Blastoise's Surf, and Charizard's Earthquake. All of these Pokemon are common Toxic and Thunder Wave users, making it risky to use Nidoking to defend partial-trapping teammates from status. These weaknesses make it hard for Nidoking to consistently switch in outside of the aforementioned scenarios. Its Speed contributes to this difficulty, leaving it outrun by many Pokemon that threaten it, such as Charizard, Mr. Mime, Venomoth, and Poliwhirl. Nidoking also relies on super effective hits to deal adequate damage, so it struggles with Normal-types such as Clefable and Porygon because it only has the poor Submission to target them.</p> ",
    "sets": [
      {
        "name": "Mixed Attacker",
        "description": "<p>Thunderbolt provides Nidoking coverage against Flying- and Water-types such as Charizard, Blastoise, and Fearow. When paired with Thunderbolt, Blizzard grants Nidoking unresisted coverage with just two moves, hitting Pokemon such as Charizard, Golem, Moltres, Exeggcute, and Dragonair. Rock Slide hits Flying-types like Charizard and Moltres harder than Thunderbolt and can target Pinsir and Venomoth. Finally, since Nidoking often has overlapping coverage in its moves, Substitute can be used to ease prediction versus foes such as Golem. This also allows Nidoking to more reliably fish for paralysis with Thunderbolt.</p> <p>Nidoking's wide movepool means it has multiple other options. Submission can be used to land an easier 2HKO on Raticate than with Earthquake and 3HKO Clefable. However, the accuracy and recoil damage, due to Nidoking's fragility, make it difficult to afford using. Toxic allows Nidoking to check wrappers such as Charizard, Moltres, Rapidash, Ninetales, and Pinsir, causing them to take more damage than they deal. Fire Blast can target Pinsir and Exeggcute while also having a chance to 2HKO Venomoth. However, Blizzard and Rock Slide are more accurate and give better general coverage. Body Slam gives Nidoking some self-sufficiency, letting it spread paralysis and become even more difficult to switch into. However, it is generally better to pair Nidoking with paralysis spreaders like Mr. Mime, Clefable, and Venomoth. Thunder does the most damage possible versus Water-types such as Blastoise and Seadra, having a chance to 2HKO both of them, but the poor accuracy poses a high risk due to its middling bulk. Counter allows Nidoking to punish moves like Hyper Beam and Body Slam from the likes of Kingler, Pinsir, and Clefable and threaten a KO in return. However, Kingler and Clefable are able to punish Counter attempts with Crabhammer and Blizzard, respectively, making it a risk. Surf can land an OHKO versus Golem while still hitting the abundance of Fire-types in the tier, but Blizzard and Rock Slide generally outclass it due to Surf failing to hit other targets.</p> <p>Nidoking operates as a powerful offensive Pokemon mid- and late-game, breaking through common Pokemon such as Golem, Kabutops, Mr. Mime, Blastoise, and opposing Nidoking. Nidoking often struggles to reliably get in, meaning Pokemon that allows for more openings make for great teammates. Paralysis support from Mr. Mime and Clefable is beneficial, as it patches up Nidoking’s middling Speed tier, allows it to switch in with more ease, and helps Substitute variants set up and serve as wincons. Early-game paralysis interactions against opposing Mr. Mime and Clefable can be crucial in allowing Nidoking to wallbreak with more ease. Partial trappers such as Charizard, Moltres, Ninetales, Rapidash, and Pinsir allow Nidoking multiple opportunities to enter and break a hole into the opposing team, pivoting with partial-trapping moves while spurring Thunder Wave and Toxic uses, which Nidoking can switch into on its own. However, Nidoking is unable to stand up to Thunder Wave and Toxic users like Mr. Mime, Clefable, and Blastoise, making this role somewhat questionable. Nidoking's immunity to Electric makes it a great partner for Water-types such as Blastoise, Kabutops, and Seadra. In return, they provide crucial switch-ins to Ice- and Water-type attacks. Exeggcute makes for a good partner due to checking Mr. Mime, which otherwise overwhelms Nidoking.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 236353, "username": "May"}, {"user_id": 165529, "username": "Ika Ika Musume"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 487308, "username": "BT89"}]}
  },
  "Clefable": {"sets": [{"name": "Bulky Support"}]},
  "Ninetales": {"sets": [{"name": "Fire Spin"}]},
  "Wigglytuff": {"sets": [{"name": "Counter"}]},
  "Golbat": {
    "overview": "<p>Golbat, just like in Cerulean Cave, is not going to be doing much more than annoying your opponent most of the time. It is a terrible Pokemon due to its bad movepool, mediocre stats, and weak typing. Golbat has a few main gimmicks that let it somewhat stand out from other Pokemon. Uniquely, Golbat is the only Pokemon that is immune to both Toxic and Earthquake, giving it a small defensive niche due to its ability to support teammates that dislike taking Toxic, such as Rapidash and Dragonair, as well as its ability to pivot around Earthquake users such as Charizard and Golem. In addition, it is the only Flying-type to also have access to Confuse Ray, and it has access to Screech. Golbat's other utilities, such as its decent speed tier, are made inferior since better Pokemon have these same traits, such as Charizard and Venomoth. Golbat should never be considered for a competitive NU team.</p> ",
    "sets": [
      {
        "name": "Utility Screech",
        "description": "<p>This set aims to make the best of the effects that Golbat can inflict on the foe. Screech allows Double-Edge to do more damage and threaten a potential KO on an already weakened Pokemon. However, the issue with Screech is that the foe can simply switch out, vastly decreasing Golbat's damage output. However, having to switch bothers boosted Pokemon like Kingler and Pinsir. In addition to this, Screech helps to encourage predictable switching and reapplying paralysis Speed drops. Confuse Ray provides Golbat opportunities to use Screech, especially in situations against paralyzed Pokemon, and increases its damage alongside Screech. Confuse Ray is also useful in disrupting wrappers and setup sweepers. Mega Drain allows Golbat to not be walled by the relevant Rock-types, landing a 3HKO on Golem and Kabutops.</p> <p>Due to Golbat's extremely shallow movepool, it does not have very many other options. Substitute can be used to reduce the need for prediction, allowing Golbat to scout and potentially even get more opportunities to use moves such as Confuse Ray and Screech. Hyper Beam instead of Double-Edge also profits off of the extra damage that Screech provides, although the opposing Pokemon can simply switch out and force Golbat to recharge. However, a previously-setup Substitute can improve this situation by leaving it invulnerable during the recharge turn. Finally, Toxic can be used to interrupt partial trapping from the likes of Dragonair and Moltres more consistently than Confuse Ray. If paired with your own wrappers, Toxic allows you to rack up large amounts of damage quickly without the need to setup Screech like Confuse Ray has.</p> <p>If Golbat is to be used, it should be utilized for its unique pivoting capabilities. For this reason, pairing it with Fire Spin users like Rapidash and Ninetales is beneficial, as they dislike the chip damage that Toxic inflicts. Golbat can also synergize well with physical attackers like Golem and Fearow, as its access to Screech can potentially help boost their offensive potential. Golem is especially notable, as a poisoned Golem loses defensive utility versus partial trappers, and it helps to solve Golbat's susceptibility to Electrode and tier-king Mr. Mime.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 236353, "username": "May"}, {"user_id": 96315, "username": "phoopes"}, {"user_id": 520967, "username": "pac"}, {"user_id": 233818, "username": "Enigami"}, {"user_id": 530877, "username": "Volk"}]}, {"name": "Grammar checked by", "members": [{"user_id": 241023, "username": "Kris"}, {"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 520967, "username": "pac"}]}
  },
  "Vileplume": {"sets": [{"name": "Double Powder"}, {"name": "Swords Dance"}]},
  "Parasect": {
    "overview": "<p>Parasect is the only Pokemon in RBY with access to Spore, giving it the most consistent Double Powder combination in the game alongside Stun Spore. It also has access to Swords Dance to boost its damage output with Hyper Beam, which can be effective with paralysis support from its teammates, allowing it to threaten crippled teams. Defensively, Parasect has resistances to Ground, Water, and Electric, meaning it can situationally switch in on Pokemon like Electrode and Golem. Parasect is also generally unfazed by paralysis, making it a decent early-game absorber of the status to prevent it from spreading later. With these strengths, combined with RBY's brutal sleep mechanics, one would be forgiven for thinking Parasect can work in RBY NU.</p> <p>However, Parasect is entirely outclassed by Venomoth, which has the Speed to back up its Sleep Powder, as well as a better defensive typing. Parasect's stats are all-around mediocre; its Speed is tied for the lowest among all fully evolved Pokemon alongside Snorlax and Slowbro. This, combined with its horrendous typing, makes it very easy to OHKO. This especially applies in RBY NU, a tier filled with powerful Fire-types such as Charizard and Rapidash to prey on its 4x Fire weakness, as well as other Pokemon like Fearow and Nidoking that can feast on its other weaknesses. Unfortunately, Parasect's positive traits aren't nearly enough to give it a niche in the tier; ergo, it should not see use on any serious competitive team.</p> ",
    "sets": [
      {
        "name": "Setup Sleeper",
        "description": "<p>Parasect's game plan is simple: put something to sleep with Spore, then cripple something else with Stun Spore as soon as possible. After this, it can come back in late-game when the opposing team is paralyzed and weakened and go on the offensive. Swords Dance has the added benefit of reapplying an opposing Pokemon's Speed drop from paralysis, which helps if Parasect has been used to absorb paralysis itself. Hyper Beam is surprisingly powerful at +2, with a chance to OHKO Mr. Mime and Raticate; it can also KO Venomoth, Dragonair, Fearow, Electrode, and Porygon if they have taken even slight chip damage. However, Body Slam is a suitable alternative to either of these moves for reliability and the ability to spread more paralysis, making Parasect serve a more supportive role.</p> <p>If you must use Parasect, then, considering its strengths as a paralysis absorber and sleeper, it's best used on teams that hinge on a strong late-game sweeper such as Moltres, Kingler, or Pinsir. Its entire existence hinges on Spore, so the move should never be dropped. While Slash may seem enticing for immediate power, it only lands a critical hit 46.88% of the time because of Parasect’s horrendous Speed stat, making it unviable. STAB Mega Drain lets Parasect 3HKO Golem and Kabutops while regaining some HP, but its utility outside of this is questionable. Toxic can be used over Stun Spore to incapacitate Dragonair and Fire Spin users like Rapidash, Moltres, and Charizard, but whether Parasect gets the opportunity to do this without being KOed or forced out the next turn is another matter.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Earlier version by", "members": [{"user_id": 19, "username": "Hipmonlee"}]}, {"name": "Quality checked by", "members": [{"user_id": 96315, "username": "phoopes"}, {"user_id": 236353, "username": "May"}, {"user_id": 468904, "username": "SBPC"}]}, {"name": "Grammar checked by", "members": [{"user_id": 241023, "username": "Kris"}, {"user_id": 33374, "username": "Muk"}]}], "writtenBy": [{"user_id": 509438, "username": "Ctown6"}]}
  },
  "Venomoth": {
    "overview": "<p>Venomoth finds a niche as one of the best status spreaders in the tier. Access to the valuable “Double Powder” combination of Sleep Powder and Stun Spore allows Venomoth to effectively support its teammates through status. Its Speed tier is incredibly valuable, outpacing top tier picks such as Nidoking and Speed tying Mr. Mime. Venomoth’s typing grants it defensive utility as a Toxic absorber, which can be huge for partial trappers such as Charizard, Rapidash, Ninetales, Moltres, Pinsir, and Dragonair. This lets it act as both a great lead and mid-game utility Pokemon, capable of facilitating its teammates' offensive pressure with status.</p> <p>However, Venomoth's defensive utility is limited, as its typing leaves it vulnerable to common attacks such as Psychic, Fire Spin, and Fire Blast. Venomoth also has middling offensive power due to its lack of a STAB option and mediocre offensive stats. It is also physically frail, being 2HKOed by super effective attacks from relevant physical attackers such as Nidoking, Golem, and Fearow. Despite this, Venomoth is relevant in the tier due to its niche as arguably the best sleeper in RBY NU.</p> ",
    "sets": [
      {
        "name": "Double Powder",
        "description": "<p>This sets aims to primarily spread status, first by putting a foe to sleep and then threatening switch-ins with an attack or paralysis. Stun Spore works excellently with Sleep Powder, allowing Venomoth to cripple many fast offensive Pokemon like Charizard and Fearow. Psychic is a good coverage option for hitting Nidoking and opposing Venomoth super effectively, as well as hitting a majority of the tier for neutral damage. Mega Drain can 2HKO Golem and Kabutops after minor chip damage. However, Double-Edge is a viable alternative option to target switch-ins with low Defense like Mr. Mime, Exeggcute, and Drowzee, which can take Venomoth's other coverage options.</p> <p>Venomoth has little variation outside of the standard set. Toxic can be ran as a way to check partial trappers such as Charizard, Moltres, Pinsir, Dragonair, and Rapidash. Hyper Beam can be used as a last-ditch attack when Venomoth is low on HP to deal as much damage as possible to a foe, notably OHKOing Mr. Mime around 40% HP. However, it makes Venomoth even more vulnerable to Rock-types such as Golem.</p> <p>Venomoth can serve the role of a lead exceptionally well, as it has enough bulk to survive at least one super effective hit from Fire-type leads such as Charizard and Rapidash and cripple them with Sleep Powder. Venomoth also has worth as a mid-game utility Pokemon, coming in on a Pokemon that has just used Rest such as Blastoise and crippling the resting Pokemon once it wakes up or a switch-in with either Sleep Powder or Stun Spore. Venomoth is vulnerable to Fire Spin leads such as Charizard and Rapidash, making teammates that can take them on for Venomoth are ideal. Blastoise provides great utility by absorbing Fire Spin and taking Rock-type moves from Golem and Nidoking. Golem also makes a good partner, being able to take attacks from the aforementioned Fire-types and make good use of Venomoth's paralysis. Partial trappers such as Charizard, Moltres, Rapidash, Ninetales, and Pinsir benefit from Venomoth absorbing Toxic and crippling foes with Stun Spore, allowing them to use Fire Spin or Bind with more ease.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 236353, "username": "May"}, {"user_id": 520967, "username": "pac"}]}, {"name": "Grammar checked by", "members": [{"user_id": 449990, "username": "DC"}]}], "writtenBy": [{"user_id": 487308, "username": "BT89"}]}
  },
  "Primeape": {
    "overview": "<p>Primeape stands out thanks to its valuable offensive typing and great offensive movepool, with access to relevant moves such as Rock Slide, Thunderbolt, and STAB Submission. This coverage allows Primeape to succeed far more consistently than any of the other Fighting-types available. Its damage output is also impressive, allowing it to 2HKO or 3HKO the vast majority of Pokemon in the tier, including notable threats such as Clefable and Moltres. Perhaps most importantly, its great Speed stat allows it to outspeed notable fast Pokemon such as Moltres and Mr. Mime. The attached 18.55% critical hit rate further boosts its offensive potency. This rate is especially important versus defensive Pokemon such as Golem and Blastoise, as a singular critical hit Submission or Thunderbolt will turn a 3HKO into a 2HKO. Clefable, Charizard, Moltres, and Kabutops are all OHKOed by either a critical hit Submission or Rock Slide.</p> <p>While Primeape is incredibly strong, its frailness and Psychic weakness allow for little defensive utility, with it losing to common Pokemon like Mr. Mime. Also, while its Speed is impressive, it's not quite enough to stop Fire Spin users such as Charizard and Ninetales from taking advantage of it. Primeape's reliance on its Speed also causes paralysis to cripple it, meaning Pokemon like Mr. Mime, Exeggcute, and Electrode force it out. Other physical attackers, such as Raticate and Charizard, typically provide more defensive utility for equally comparable power.</p> ",
    "sets": [
      {
        "name": "All-out Attacker",
        "description": "<p>Submission is Primeape's primary attacking move, 2HKOing Clefable and Wigglytuff, as well as Golem with minor chip damage. However, a Counter from Clefable or Wigglytuff will punish it, so scouting their movesets prior is recommended. Body Slam grants Primeape some measure of self-sufficiency by spreading paralysis to support it. It also acts as a way to discourage switch-ins, as Pokemon like Charizard and Nidoking hate paralysis; Charizard is also liable to be KOed by Rock Slide thereafter. Rock Slide also lets Primeape punish the plethora of other viable Fire-types, 2HKOing Moltres (RC) as well as Ninetales, Arcanine, and Rapidash after some chip damage. Hyper Beam is Primeape's strongest attack, allowing it to revenge kill from high percentages. In addition, Hyper Beam prevents Rest Exeggcute from walling Primeape, with two Body Slams into critical hit Hyper Beam being a guaranteed KO. Alternatively, Thunderbolt is Primeape's strongest option against Blastoise, Seadra, and Kingler, 2HKOing the latter 91.5% of the time.</p> <p>Primeape is decently customizable due to its sizeable movepool. Thunder is a guaranteed 3HKO on Blastoise and Seadra, while with Thunderbolt this is only a chance. However, Thunder's poor accuracy leaves it as a niche option. Low Kick is a decent alternative to Submission, forgoing power for a chance to flinch the foe. This allows it to occasionally brute force through foes at high health without taking damage in the process. Counter can be used to heavily damage physical attackers such as Pinsir and Raticate, but it requires some level of prediction in order to be effective. Primeape can use Toxic to check AgiliWrap Dragonair and Fire Spin users, as they will take more damage from Toxic than it will deal with Wrap. Finally, Mega Kick deals high damage to some of Primeape's most notable checks, pairing with Hyper Beam to secure KOs on Nidoking, Mr. Mime, and Exeggcute. However, Mega Kick's mediocre accuracy leaves much to be desired.</p> <p>Primeape fits well on teams with multiple Flying- and Bug-types such as Charizard, Moltres, Pinsir, and Venomoth, as it resists Rock Slide while also threatening opposing Fire-types that check them. Primeape is also great at absorbing Toxic, due to its dislike of paralysis, which lets it protect Fire Spin Charizard and Moltres. It also pairs especially well with dedicated checks to Mr. Mime. Once Mr. Mime is sizably chipped, Primeape can outspeed and revenge kill it, removing one of its biggest roadblocks in the process. Notable Mr. Mime checks include Clefable, Exeggcute, Drowzee, and even your own Mr. Mime. Primeape is most successful when used as a mid-game wallbreaker, as most of its coveted targets like Clefable, Moltres, and Kingler come into play then. Punishing these Pokemon grants openings for its teammates to sweep later on.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 236353, "username": "May"}, {"user_id": 233818, "username": "Enigami"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 520967, "username": "pac"}]}
  },
  "Arcanine": {"sets": [{"name": "Bulky Mixed Attacker"}]},
  "Poliwhirl": {"sets": [{"name": "Sleeper"}]},
  "Abra": {
    "overview": "<p>Abra wields the strongest Psychic in NU, as well as possessing an impressive Speed stat. This makes it one of the tier's most potent special attackers and revenge killers, threatening notable Pokemon like Nidoking, Venomoth, Raticate, and Pinsir. The aforementioned Speed stat lets it compete with the tier's offensive threats, notably outspeeding Nidoking and Pinsir while Speed tying Moltres, Mr. Mime, and Poliwhirl. It's also one of the fastest users of Thunder Wave in the tier, often forcing out fast threats like Charizard and Electrode that dislike paralysis.</p> <p>However, Abra is comically frail, being 2HKOed or OHKOed by nearly every physical move in the tier, even from coverage moves like Blastoise's Body Slam and Charizard's Earthquake. It also lacks a reliable recovery option to compensate for this, making it very hard to switch in, even against the Pokemon that it's supposed to threaten. Its coverage is also limited to Seismic Toss, so it struggles versus Psychic-types like Exeggcute and the ubiquitous Mr. Mime. Mr. Mime also mostly outclasses Abra, having better coverage as well as physical bulk, with only a slightly weaker Psychic.</p> ",
    "sets": [
      {
        "name": "Special Attacker",
        "description": "<p>Psychic deals incredible damage to many of the tier's biggest threats, notably 2HKOing Nidoking, Venomoth, and Raticate, while having chances to 3HKO defensive staples such as Blastoise, Arcanine, and Porygon. Thunder Wave cripples faster Pokemon such as Charizard and Electrode. Seismic Toss is Abra's best attack versus Psychic-types like Mr. Mime, Exeggcute, and Drowzee. Reflect lets Abra take less damage from physical attacks, notably making Nidoking's Earthquake only a possible 2HKO.</p> <p>Abra's very small movepool leaves it with few other options. Toxic is the most consistent check to the wrappers in the tier, such as Rapidash, Ninetales, and Dragonair. Substitute can be used in order to ease prediction and let Abra take more hits. Abra's astounding frailty means that Counter will deal incredible damage if landed, but it's hard to find situations to both survive the attack and prefer Counter to other attacks, outside of Mr. Mime's Seismic Toss.</p> <p>Abra is typically used alongside Mr. Mime as a generally inferior but still potent version of it. The two often contribute to paralysis spam, supporting sweepers like Kingler and Nidoking. Abra's struggles versus Mr. Mime and Exeggcute make checks to those Pokemon vital, so it synergises well with Clefable as well as your own Mr. Mime.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 236353, "username": "May"}, {"user_id": 233818, "username": "Enigami"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 520967, "username": "pac"}]}
  },
  "Machamp": {
    "overview": "<p>Machamp boasts the highest Attack stat in the tier, only contested by Flareon and Kingler. This is bolstered by its near-perfect coverage with options such as Rock Slide and Earthquake and STAB Fighting-type moves to threaten Rock- and Normal-type Pokemon, such as Golem and Clefable. This lets it perform well with paralysis support, especially with Low Kick, letting it outspeed a good portion of the tier. It also has some niche defensive utility, as its Rock resistance gives it synergy with Fire-types such as Charizard and Moltres.</p> <p>However, while Machamp does hit quite hard, it lacks broad defensive utility due to its few resistances and a devastating Psychic weakness. Machamp’s poor Special stat leaves it vulnerable to special attackers like Poliwhirl, Moltres, the elusive Abra, and the ubiquitous Mr. Mime. In addition to this, its poor Speed requires major paralysis support as to not get overwhelmed by the aforementioned special attackers. The Speed issue means Machamp is equally afraid of being paralyzed, as it needs to be able to outspeed opposing Pokemon to pose a threat. All partial trappers in the tier also outspeed and take advantage of it. As if this wasn’t enough, Machamp faces stiff competition with Primeape and Golem, the former boasting Thunderbolt and a much higher Speed tier, and the latter having STAB on Machamp’s coverage options and making better use of the paralysis support needed for Machamp to work. Overall, Machamp is a very high-risk Pokemon with moderate reward, so it's not recommended for use on most competitive teams; physical attackers such as Golem, Pinsir, and Kingler take better advantage of the support Machamp needs.</p> ",
    "sets": [
      {
        "name": "All-Out Attacker",
        "description": "<p>Submission is a strong STAB option, landing a 2HKO on the likes of Golem and Clefable. Alternatively, Low Kick can bully paralyzed Pokemon with flinches at the cost of losing a 2HKO on the aforementioned Golem and Clefable. Earthquake is a nice general coverage option, hitting Fire-types such as Rapidash, Ninetales, and Arcanine. Body Slam lets Machamp become somewhat self-sufficient by spreading paralysis on its own, making switching into it risky. Rock Slide grants Machamp perfect coverage, letting it hit Flying-types such as Fearow, Charizard, and Moltres. However, Hyper Beam is Machamp’s strongest attack, allowing it to pose more of a threat late-game against paralyzed and weakened foes.</p> <p>Toxic is Machamp’s best bet against partial trappers such as Charizard, Dragonair, Moltres, and Pinsir, as, otherwise, Machamp is more or less fodder. Fire Blast 2HKOes Exeggcute and threatens a burn on physical attackers such as Raticate, Fearow, and Primeape. Counter is a usable option, as Machamp's stat spread compliments this move greatly, allowing it to switch in on predicted Hyper Beams from Pokemon like Pinsir, Kabutops, and Kingler before KOing them outright. It can also deter Body Slam from users like Arcanine and Clefable. Using Machamp on a team means that paralysis support is a must-have. Due to this, Pokemon such as Clefable, Mr. Mime, and Electrode make for great partners. The former two are able to switch into Psychic-type attacks aimed at Machamp from the likes of Drowzee, Abra, and Mr. Mime, and the latter more or less guarantees something gets paralyzed due to its great Speed tier. It is best to use Machamp late-game, after the opposing team has been paralyzed.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 236353, "username": "May"}, {"user_id": 520967, "username": "pac"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 487308, "username": "BT89"}]}
  },
  "Golem": {
    "overview": "<p>Although Golem has fallen far from its esteemed status in OU, it has cemented a place as one of NU’s fiercest wallbreakers. Offensively, it provides unresisted STAB QuakeSlide coverage that is backed by a superb Attack stat to deter powerful Fire-types like Charizard, Moltres, and Rapidash. This makes Golem quite tough to switch into, as many relevant Pokemon are 2HKOed or 3HKOed by its STAB attacks. Defensively, its typing and rock-solid physical bulk allow it to be an excellent switch-in to select attackers like Ninetales, Fearow, and Electrode, easily able to force progress against them. Golem is also a great switch-in to paralysis-inducing moves thanks to its immunity to Thunder Wave and how little damage it takes from any Body Slam. It possesses the nuclear Explosion, which inflicts massive damage even against the bulkiest Pokemon: bulky Pokemon like Blastoise and Clefable are taken out with minimal chip damage, while threats like Mr. Mime, Dragonair, and Poliwhirl are outright OHKOed. Lastly, when paired with other Water- and Rock-types, like Blastoise and Kabutops, Golem can easily PP stall Fire Spin users and withstand their assaults.</p> <p>While Golem’s typing is a blessing in a Fire- and Electric-infested meta, it is also a curse: its typing leaves it weak to numerous offensive threats like Seadra, Poliwhirl, and Kingler. Despite Golem possessing a resistance to Normal-type moves, it cannot switch into Pokemon like Raticate and Clefable; the former possesses Super Fang to halve Golem’s HP, while both possess a Blizzard that can 2HKO it, causing it to use Explosion much earlier than one would like. Golem also possesses one of the worst Speed tiers in the entire meta, only being able to outpace Pokemon like Porygon, Drowzee, and Exeggcute. Without paralysis support, Golem will likely have to stomach an attack before being able to move, with the possible addition of damage taken when switching in. Toxic’s prominence to check dangerous Fire Spin users also adversely affects Golem, which hinders its ability to check the aforementioned attackers.</p> ",
    "sets": [
      {
        "name": "Explosion",
        "description": "<p>Explosion is Golem’s primary perk, always OHKOing physically frail Pokemon like Mr. Mime, Raticate, Dragonair, and Poliwhirl. With minor chip damage, Explosion can also take out bulkier Pokemon such as Blastoise, Clefable, and Exeggcute. In order to fully utilize the move, scouting an opponent’s team with leads like Venomoth and Poliwhirl, as well as building up Fire Spin chip damage from the likes of Charizard and Rapidash, is mandatory to secure KOs. A Golem inflicted with status may be taken advantage of by bulky Pokemon like Blastoise and Clefable, forcing it to use Explosion earlier. The opponent may also try to send out their sleeping or frozen Pokemon, causing the trade to be less favorable. Earthquake 2HKOes opposing Golem, Nidoking, and Arcanine. Rock Slide complements Earthquake, OHKOing Charizard as well as having a 92.3% chance OHKO Moltres. Rock Slide also 2HKOes Fearow, Pinsir, and Venomoth. Substitute capitalizes on Golem forcing out Pokemon like Electrode, Fearow, and Rapidash, enabling it to safely fire off a powerful Earthquake or Rock Slide. Body Slam, on the other hand, allows Golem to be more self-sufficient and attempt to generate paralysis support for its team, most notably against Poliwhirl and Blastoise switching in.</p> <p>Golem has a few other options to consider, but they are all difficult to justify because they compromise its offense. Toxic further cements its excellent matchup against Fire Spin users like Charizard, Ninetales, and Rapidash, causing them to take more damage than they deal when using it. Toxic also forces bulky Pokemon like Blastoise and Moltres to use Rest sooner, enabling Golem and its teammates to exert more offensive pressure. If Golem has sustained too much damage, Rest can restore Golem to full HP; when walling Fire-types, this allows it to burn sleep turns. However, Earthquake Charizard can be problematic, and a passive Golem can give free switch-in opportunities to Water-types like Seadra and Kabutops. Fire Blast 2HKOes Exeggcute and deals more damage than any of its other moves do to it. The move also carries a nice chance to burn physical attackers like opposing Golem and Pinsir.</p> <p>Golem’s sheer power and capability to lure in and take out checks with Explosion best leave it as a mid-game wallbreaker, but its defensive utility should not be discounted. Offensive Pokemon like Mr. Mime, Nidoking, and Raticate do not appreciate being worn down with Fire Spin damage; as such, they enjoy Golem’s ability to easily wall Fire Spin users with its high bulk and great defensive typing. Water-types, such as Seadra, also pair nicely, as they appreciate Golem being able to use its high physical bulk and Electric immunity to pivot in against Electrode, as well as predicted Thunder Waves from the likes of Mr. Mime and Drowzee. In return, Seadra can find opportunities to sweep with Agility after Golem has removed or severely weakened status inducers and Electrode. Golem also enjoys pairing up with Kabutops to minimize Fire Spin damage from the likes of Moltres, Ninetales, and Rapidash, leaving them more vulnerable to missing and taking massive damage for it. Golem also enjoys the synergy with Flying-types, as they possess an immunity to Ground-type moves; conversely, Flying-types appreciate the Electric immunity Golem brings. To determine the value of Golem throughout the game, scouting is recommended to check how many Pokemon it can wall. If the opposing team has multiple healthy Fire-types, it should remain as healthy as possible to avoid getting worn down quickly. Using Explosion too quickly may result in opposing Fire-types being able to exert much more offensive pressure. However, if there are multiple Water-types and Pokemon that possess super effective coverage moves, Golem may be forced to use Explosion earlier to mitigate the damage done to other teammates.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 236353, "username": "May"}, {"user_id": 520967, "username": "pac"}, {"user_id": 233818, "username": "Enigami"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}]}], "writtenBy": [{"user_id": 543866, "username": "5Dots"}]}
  },
  "Rapidash": {
    "overview": "<p>Despite the infamous reputation of Fire-types in RBY, Rapidash cements a niche as one of the best leads in the RBY NU metagame. It separates itself from other Fire Spin leads with its excellent Speed which gives it a menacing 20.5% critical hit rate and lets it use Toxic to check other partial trapping leads. Fire Spin also makes it work with other partial trapping users such as Moltres, Ninetales, and Charizard. Rapidash can land 2HKOs with a critical hit Fire Blast on notable threats such as Mr. Mime and Clefable. It can use chip damage done with Fire Spin in tandem with Fire Blast and Hyper Beam to become a cleaner. Rapidash is also one of the best pivots in the tier, with access to Fire Spin allowing it to safely pivot out of poor lead matchups into a safer check. For example, if Rapidash faces a Poliwhirl lead, it can pivot out into a teammate like Electrode or Clefable to take care of Poliwhirl for it.</p> <p>Despite these upsides, Rapidash's typing hinders it greatly, as it is forced out by the Water-types of the tier, such as Blastoise, Kabutops, and Poliwhirl. Its movepool is limited to Fire- and Normal-type attacks, meaning that it struggles to threaten the likes of Golem and said Water-types. Rapidash is also very susceptible to chip damage and greatly dislikes paralysis. Nonetheless, Rapidash is a solid Pokemon in the tier.</p> ",
    "sets": [
      {
        "name": "Fire Spin Pivot",
        "description": "<p>Fire Spin is Rapidash’s main asset, wearing down foes and giving it a great opportunity to pivot around poor matchups in the opening. Rapidash is one of the fastest Pokemon in the tier, and it can take out a worn down opponent with Fire Blast or Hyper Beam. Fire Blast can OHKO Pinsir and Exeggcute, 2HKO Nidoking after a critical hit, and can burn an opponent, which can be useful for forcing a Rest from the likes of Blastoise or crippling physical attackers like Kingler and Golem. Toxic can cripple other Fire Spin or Wrap users such as Moltres, Dragonair, and Ninetales, as it outdamages a foe's Fire Spin or Wrap. Toxic, in tandem with Fire Spin from either Rapidash or a teammate, can create a deadly combination that drains the HP of foes quickly while forcing Rest from counters such as Kabutops and Blastoise. Hyper Beam can finish off worn down checks such as Blastoise and Charizard. Body Slam is a good option over Hyper Beam, as it allows Rapidash to spread paralysis to switch-ins such as Blastoise and Kabutops.</p> <p>Rapidash’s limited movepool means that there is not much room for variation. Agility is a decent option, as it lets Rapidash outspeed the entire tier and can also alleviate paralysis from foes such as Mr. Mime, Clefable, and Electrode. It also allows Rapidash to have an uncontested Fire Spin, which further enhances its ability to clean late game. However, it is hard for Rapidash to set up against a majority of the tier, and it faces competition from Moltres in this role. Stomp can be used alongside Body Slam for a solid combo of paralysis and flinch. Rapidash likes to have counterplay to Water- and Rock- types like Blastoise and Golem, which can easily stonewall it, making Pokemon like Blastoise, Electrode, and Mr. Mime solid teammates.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 468904, "username": "SBPC"}, {"user_id": 520967, "username": "pac"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 487308, "username": "BT89"}]}
  },
  "Slowpoke": {
    "overview": "<p>Slowpoke can differentiate itself from Poliwhirl as an Amnesia sweeper with Thunder Wave to spread paralysis and higher Defense—although its horrid Speed tier makes paralysis especially a necessity and not a luxury. Its Speed tier also makes it a solid Thunder Wave absorber, since it does not mind a Speed drop. It can find setup opportunities on Pokemon it can threaten out with paralysis, or resist the attacks of, which includes Arcanine and Poliwhirl. After an Amnesia, it can deal good damage against Fire-types such as Moltres and Charizard and wall special attackers like Mr. Mime and Porygon. Slowpoke is also a check to opposing Water-types, most importantly Poliwhirl, as, after Sleep Clause has activated, there is little it can do to Slowpoke.</p> <p>However, Slowpoke’s bulk is quite mediocre, with its physical bulk being average and its special bulk being poor without any boosts. Even at +6 Special, Slowpoke gets ruined by a critical hit Thunderbolt from the likes of Electrode and Mr. Mime. Because of this, it can be taken advantage of while using Rest, which also makes it lose to physical attackers and setup sweepers like Nidoking, Clefable, Charizard, and Kabutops. Slowpoke also faces issues with its abysmal Speed tier; it is very easy to revenge kill and fails as a lead, unable to beat sleep inducers like Venomoth and Poliwhirl, vulnerable to partial trapping users like Dragonair and Pinsir, and targeted by Explosion users like Golem.</p> ",
    "sets": [
      {
        "name": "Amnesia",
        "description": "<h1>Set Description</h1> <p>Surf is Slowpoke’s best STAB option, offering great offensive coverage that lets it hit the likes of Charizard, Mr. Mime, and Nidoking effectively. Rest allows Slowpoke to continue its sweep by recovering hits taken while setting up, especially thanks to its increased special bulk due to Amnesia. Thunder Wave allows Slowpoke to outspeed and cripple Pokemon that can threaten it.</p> <p>Slowpoke has a very solid movepool, leaving a good amount of options to choose from. Psychic can be used over Surf, as, even though it is weaker against neutral targets, it sports a 30% special drop rate. It also hits Venomoth super effectively, as well as gaining a neutral hit on Water-types such as Blastoise and Kabutops. Blizzard allows Slowpoke to hit Exeggcute super effectively, as well as still hitting Moltres and Charizard. It also allows Slowpoke to fish for a freeze, which can be useful in a pinch. Ice Beam, although weaker than Blizzard, is more reliable. Fire Blast can deal good damage to Grass- and Bug-types, having a 28.2% chance of OHKOing the likes of Pinsir after an Amnesia. Toxic over Thunder Wave or Rest helps Slowpoke against partial trapping users such as Dragonair and Pinsir. Earthquake over either of those moves allows Slowpoke to deal good damage to Electrode. However, it serves little purpose outside this.</p> <p>Slowpoke is vulnerable to most Electric-type coverage within the tier, so having an Electric-immune teammate helps greatly. Nidoking and Golem are prime examples of this. Nidoking can switch into Electric-type moves from threats such as Electrode while taking out Pokemon that can force out Slowpoke like Clefable. Golem can switch into moves such as Mr. Mime's Thunderbolt and, after minor damage, KO with Explosion and let Slowpoke in for a sweep. Mr. Mime deserves a special mention, as it is all-around useful and can break through Water-type Pokemon such as Blastoise and Kabutops. Poliwhirl can be used alongside Slowpoke, as Slowpoke spreading paralysis opens Poliwhirl up to sweep late-game. Partial trappers such as Pinsir and Moltres provide a great form of chip damage to facilitate a late-game sweep with Slowpoke. Sleep support from Venomoth or Clefable gives Slowpoke reliable turns to set up against its foes.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 520967, "username": "pac"}, {"user_id": 468904, "username": "SBPC"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 487308, "username": "BT89"}]}
  },
  "Magneton": {
    "overview": "<p>Due to its high Special and Electric typing, Magneton wields the most powerful Electric-type attacks in the tier. Notably, it is able to OHKO Poliwhirl, Kingler, and Fearow while having a chance to OHKO on Blastoise, Charizard, and Seadra. In addition, Thunder Wave lets it cripple the offensive potential of major offensive threats such as Mr. Mime and Arcanine. Also, Magneton's defensive stats are enough to allow it to switch in on many of these offensive Pokemon.</p> <p>However, its pitiful movepool and terrible Attack leave it nearly helpless against Ground-types like Nidoking and Golem, which happen to be some of the most common Pokemon in the tier. Its largest issue is its subpar Speed, which lowers its effectiveness at handling targets such as Moltres and Mr. Mime, as well as hampering its ability to safely use Rest. It also leaves it prey to partial-trapping users such as Dragonair and Rapidash. Finally, it faces stiff competition with Electrode, which is much faster and has access to better utility and coverage moves such as Screech and Explosion.</p> ",
    "sets": [{"name": "Offensive", "description": "<p>Thunder Wave is essential, as it helps make up for Magneton's low Speed and cripples Wrap users. Thunder is Magneton's main offensive tool, allowing it to OHKO notable Pokemon like Poliwhirl and Blastoise. Thunder is used because Thunderbolt misses the OHKO on notable Pokemon such as Blastoise. Double-Edge is used to deal damage to Ground-types, mainly Nidoking. Magneton can wake up from Rest with opportunities like switching into Fire Spin.</p> <p>Thunderbolt can be used instead of Rest for its favorable accuracy. Flash is usable and can help losing matchups, but it's unreliable. Toxic over Double-Edge makes the Golem matchup better while worsening the Nidoking matchup. Substitute can be run alongside Toxic or other moves like Flash and Supersonic, although these latter options are unlikely to succeed unless the target is already paralyzed.</p> "}],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 236353, "username": "May"}, {"user_id": 93615, "username": "phoopes"}, {"user_id": 505149, "username": "Sevi 7"}, {"user_id": 520967, "username": "pac"}, {"user_id": 231074, "username": "S1nn0hC0nfirm3d"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}, {"user_id": 517423, "username": "Finland"}]}], "writtenBy": [{"user_id": 520967, "username": "pac"}]}
  },
  "Farfetch’d": {
    "overview": "<p>Farfetch'd is the only Flying-type Pokemon with access to STAB Slash, which, while extremely powerful on its own, falls flat when considering the duckling's awful stats. Furthermore, Pinsir has the role of being a Slash user heavily locked down due to its superior bulk and Speed. Farfetch'd has zero coverage to its name and no reliable Flying STAB moves, which comes together to make it little more than food for better Pokemon to feast on. Because of these traits, Farfetch'd is strictly outclassed by other Flying-types, such as Fearow and even Pidgeot, and should never be used on any competitive RBY NU team.</p> ",
    "sets": [
      {
        "name": "Double Dance",
        "description": "<p>This is the best Farfetch'd can offer with its horrendous movepool. Body Slam allows Farfetch'd to support itself with paralysis and can be boosted by Swords Dance. Slash makes Farfetch'd much less reliant on Attack boosts, being what's effectively a 140-Base Power STAB move that ignores Reflect. However, it also ignores Attack boosts, putting a cap on its potential damage output. Swords Dance and Agility are near-mandatory for Farfetch'd to pose a threat, allowing it to make up for its horrid stats while alleviating the Attack and Speed drops from burn and paralysis, respectively. This setup potential also makes Farfetch'd much better at punishing opposing Pokemon using Rest. Toxic is a good alternative to Swords Dance or Agility for punishing Golem and Dragonair switching in, preventing the latter from pulling off a Wrap sweep.</p> <p>Farfetch'd has a barren movepool, giving it no truly viable options. If you must customize Farfetch'd, Sand Attack can disrupt partial trapping attempts, but Toxic is better as a more permanent solution. Alternatively, Mimic is valid to potentially get a useful move, but whether Farfetch'd survives to use it is a different ballgame.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Earlier version by", "members": [{"user_id": 19, "username": "Hipmonlee"}]}, {"name": "Quality checked by", "members": [{"user_id": 96315, "username": "phoopes"}, {"user_id": 265630, "username": "Amaranth"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 236353, "username": "May"}]}
  },
  "Muk": {
    "overview": "<p>Muk has a few things going for it in NU. It has a very high HP stat, a decent movepool with wide coverage, and good Attack stat that gives it the second strongest Explosion in the tier. Muk's coverage allows it to pick and choose which foes it wants to check, allowing it to provide decent support to any team that needs it. However, its poor typing and low Speed make it susceptible to notable offensive threats such as Nidoking and Mr. Mime, which both 2HKO it. When it comes to Explosion users in NU, there is Golem, which is much stronger, has better STAB moves, is physically bulkier, and resists Fire. However, Muk has a niche over Golem thanks to its coverage, slightly better Speed, much better special bulk, and lack of weaknesses to Water and Ice.</p> ",
    "sets": [
      {
        "name": "Physical Attacker",
        "description": "<p>Sludge is Muk's strongest attack that does not have a drawback, and it has the added chance of poisoning foes to push them into KO range. Alternatively, Body Slam is a decently strong attack that can hit Poison-resistant Pokemon somewhat hard, such as the aforementioned Nidoking, while also threatening switch-ins with paralysis. Sludge can support Wrap and Fire Spin cores by increasing passive damage over time, while Body Slam can support slow powerhouses such as Kingler and Golem. Thunderbolt hits certain Water- and Flying-types, such as Blastoise and Charizard, harder than other moves. Mega Drain hits the Explosion-resistant Golem and Kabutops as hard as possible, 3HKOing both, while also giving longevity. Finally, Explosion is Muk's best asset, dealing massive damage to anything that does not resist it and KOing many threats after some chip damage. It also gives a free switch into a frail sweeper such as Raticate or Rapidash when used, as well as making sure paralysis does not completely disable Muk.</p> <p>Hyper Beam can allow Muk to pick off weakened Pokemon that would otherwise live another attack. Fire Blast hits Venomoth, Vileplume, and Weepinbell hard, with a small chance to 2HKO Weepinbell. It also comes with a nice 30.1% chance to burn, allowing Muk to cripple physical attackers that switch in and nullify Wrap users.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 236353, "username": "May"}, {"user_id": 96315, "username": "phoopes"}, {"user_id": 233818, "username": "Enigami"}]}, {"name": "Grammar checked by", "members": [{"user_id": 241023, "username": "Kris"}, {"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 473639, "username": "LTG"}]}
  },
  "Gastly": {
    "overview": "<p>Gastly is one of the strongest pivots in the metagame due to its typing granting it complete immunity to numerous valuable offensive tools such as Body Slam, Hyper Beam, Slash, and Toxic. It's also one of the faster users of a sleep-inducing move in Hypnosis, which is incredibly important due to nearly every competitive team trying to spread sleep in some form. Its Ghost typing is also completely unique in the tier, allowing it to check Pinsir and Raticate; PP stall Wrap and Bind users such as Dragonair, Pinsir, and the niche Weepinbell; and pivot around the various Body Slams of the tier from the likes of Blastoise and Clefable.</p> <p>However, Gastly has some flaws that make it struggle to succeed consistently in the meta. Its typing faces issues defensively, being weak to common moves such as Psychic and Earthquake and giving it poor matchups versus numerous top-tier threats like Charizard, Nidoking, and the ubiquitous Mr. Mime. Gastly's Speed is also just not enough, leaving it outsped by all of the aforementioned threats, as well as the more notable sleepers in Venomoth and Poliwhirl. Finally, its bulk is generally quite poor, leaving it obliterated by key offensive threats like Charizard, Rapidash, and Mr. Mime once it has taken mild chip damage.</p> ",
    "sets": [
      {
        "name": "Hypnosis",
        "description": "<p>Hypnosis is one of Gastly's main selling points, as it's just fast enough to outspeed and threaten Golem, Clefable, and Exeggcute with sleep. Thunderbolt is Gastly's main attacking move, wielding chances to 3HKO or 2HKO notable Water- and Flying-types like Kabutops, Blastoise, Seadra, and Charizard. Mega Drain is Gastly's strongest move versus Golem and Kabutops, with chances to 2HKO both and recovering health in the process. Night Shade is used for consistent damage, though Psychic can be used over it or Mega Drain as a midground option that threatens Special drops and a 2HKO on Nidoking.</p> <p>Gastly's pitifully small movepool leaves little else to utilize. Explosion is the most enticing option, allowing Gastly to bring in teammates safely while dealing decent damage towards neutral threats, potentially KOing Mr. Mime after a singular Night Shade. Thunder is Gastly's strongest attack versus Blastoise, Seadra, Charizard, and Poliwhirl, 2HKOing all of them. However, its poor accuracy makes it an inconsistent option. Toxic is Gastly's most consistent check to Fire Spin users, most notably Rapidash, Charizard, and Moltres. Confuse Ray can achieve similar results as Toxic, but Toxic is a much more permanent solution to the issue and leaves Confuse Ray mostly outclassed.</p> <p>Gastly's weakness to Psychic make checks to Mr. Mime a necessity, so pairing it with Pokemon like Clefable, Porygon, and your own Mr. Mime is important. Its ability to deal good damage versus Water- and Rock-types such as Blastoise, Kabutops, and Golem makes Fire-types like Charizard, Moltres, and Rapidash potentially solid teammates, as they appreciate the support. Charizard is an especially good teammate, as it is a soft check to Nidoking and obliterates Exeggcute, both of which Gastly can struggle with. In addition to this, Gastly is a fantastic partner for Pokemon that fear paralysis from Body Slam such as Pinsir and Kingler. Gastly's access to Hypnosis also creates openings for Agility users like Dragonair and Moltres to make use of AgiliWrap strategies.</p> <p>Gastly comes in for free on opposing Poison- and Normal-type moves, most notably Toxic, Body Slam, Slash, and Wrap. This makes it one of the more effective switch-ins for Kabutops and Blastoise, as it is only 3HKOed by the former's Hydro Pump and is immune to its Slash, while the latter typically wields either Toxic or Body Slam and fails to 3HKO Gastly with Surf. This makes it an effective mid-game pivot, as its role as one of the safest switch-ins towards these Pokemon allows you to safely bring in Pokemon like Electrode that would normally fear Body Slam or force the opposing foe out with threat of a powerful coverage move or Hypnosis.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 236353, "username": "May"}, {"user_id": 468904, "username": "SBPC"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}]}], "writtenBy": [{"user_id": 520967, "username": "pac"}]}
  },
  "Onix": {
    "overview": "<p>Despite its imposing appearance, Onix has the second-lowest Attack stat of all fully evolved Pokemon, only beating Chansey. This causes even the mighty STAB Earthquake to deal middling damage to even Ground-weak threats, only dealing up to 48.9% to Kabutops. However, Onix is the only user of a partial trapping move that has an immunity to Thunder Wave. On top of this, it's also the fastest Rock / Ground type Pokemon, notably outspeeding Clefable. While this is excellent on paper, Onix must rely on the woefully inconsistent Bind and lacks the stats to do anything else. Outside of access to Bind, it's strictly outclassed by Golem, which has much higher stats overall. As if this wasn't enough, as a partial trapper, Onix competes with more viable Pokemon like Moltres, Dragonair, and Rapidash. Ergo, Onix should not be used on a competitive RBY NU team.</p> ",
    "sets": [{"name": "Bind Pivot", "description": "<p>Rock Slide and Earthquake give Onix the necessary coverage to hit every Pokemon in the tier, and the latter 2HKOes Electrode. However, Toxic is usable over Rock Slide to boost net damage output with Bind. Explosion deals large damage to multiple Pokemon such as Poliwhirl and Mr. Mime, and gives the opportunity for a teammate to switch in for free; this also ensures Onix can maintain value if paralyzed, which otherwise incapacitates it. If paired with Toxic users like Blastoise, then Onix can quickly pile on damage with Bind, which can work especially well in tandem with other partial trappers like Moltres.</p> "}],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 96315, "username": "phoopes"}, {"user_id": 265630, "username": "Amaranth"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 236353, "username": "May"}]}
  },
  "Drowzee": {"sets": [{"name": "Standard"}]},
  "Kingler": {
    "overview": "<p>Swords Dance Kingler is the strongest wallbreaker and a potent sweeper in RBY NU. At +2, Hyper Beam can OHKO threats like Mr. Mime, Rapidash, and Poliwhirl. Additionally, Body Slam followed by Hyper Beam will KO any Normal-neutral foe in the tier. Rock-types are washed away by Crabhammer, a very powerful STAB move that will almost always score a critical hit. Crabhammer easily OHKOes Golem and 2HKOes Kabutops. Kingler also has decent physical bulk, avoiding 2HKOs from some strong physical attacks such as Golem's Earthquake and opposing +2 Kingler's Body Slam. This allows Kingler to emergency check such threats.</p> <p>However, Kingler is very slow for RBY NU, outsped by a myriad of prominent offensive threats in the tier. This means it requires extensive paralysis support from teammates to safely sweep and is ruined by getting paralyzed itself. Also, while Crabhammer's sheer power makes up for Kingler's low Special offensively, even neutral special attacks such as Mr. Mime's Psychic 2HKO it. Kingler's weakness to Electric means it is forced out by certain threats such as Thunderbolt Nidoking and Clefable.</p> ",
    "comments": "<h1>Other Options</h1> <p>Kingler should generally not run any other moves than the four listed in the set. It can attempt to run Stomp over Body Slam to flinch foes, but Stomp is much weaker than Body Slam and makes Kingler even more reliant on its team to spread paralysis. Blizzard may sound decent, but it does not actually hit anything harder than Kingler's Normal-type moves due to Kingler's low Special. Substitute might sound enticing; however, while Kingler may have decent physical bulk, it is once again held back by its bad Special, which causes Substitute to usually be a waste. Also, Substitute does not address Kingler's crippling weakness to Thunder Wave.</p> <h1>Checks and Counters</h1> <p><strong>Electric-type Attacks</strong>: Electrode, Nidoking, and Mr. Mime outspeed Kingler and can 2HKO it with Thunderbolt, with Electrode even having a chance to OHKO, further bolstered by its high critical hit rate. Magneton, while slower than Kingler, can almost always take a boosted Hyper Beam from full health and will always OHKO Kingler in return. Clefable is slower than Kingler and takes heavy damage from boosted Body Slam, but it can threaten to 2HKO Kingler.</p> <p><strong>Paralysis: Thunder Wave users such as Clefable and Mr. Mime can dash any chance of Kingler sweeping late-game. Getting paralyzed means Kingler can no longer outspeed some of the slowest Pokemon in RBY NU or outspeed faster paralyzed foes.</p> <p><strong>Faster Special Attackers</strong>: Kingler's poor Special means even moderately strong special attacks like Mr. Mime's Psychic 2HKO it. Even Moltres's Fire Blast, which Kingler resists, will always 3HKO it. Its low Speed exacerbates this issue, as it can't outspeed most of the threats that threaten to KO it.</p> <p><strong>Burns: All the Fire Blast users in NU mean that Kingler, as a Water-type, will inevitably switch into a few of them. However, Fire Blast's 30.1% chance to burn can greatly hinder Kingler's sweeping prowess if it gets unlucky, forcing Kingler to use Swords Dance to negate the burn Attack drop. However, a burned Kingler can still use Crabhammer unhindered.</p> ",
    "sets": [
      {
        "name": "The Cringe Crab (Swords Dance)",
        "description": "<h1>Set Description</h1> <p>Swords Dance boosts Kingler's already great Attack to dizzying heights, allowing it to deal extreme damage to most foes. It also allows Kingler to reapply paralysis Speed drops to outspeed foes in certain situations where it otherwise could not. Body Slam is a very powerful attack after a boost, and threatens switch-ins with paralysis, which helps Kingler sweep and support its team. Hyper Beam is an outstanding finishing move, dealing massive damage to almost anything and outright OHKOing frailer foes at +2. Crabhammer allows Kingler to hit Rock-types very hard. Crabhammer OHKOing Golem and slamming Kabutops is particularly fantastic.</p> <p>Kingler's low Speed means it highly appreciates paralysis support from teammates such as Mr. Mime and Clefable. Kingler also appreciates teammates that can switch into Thunder Wave and Thunderbolt, such as Golem and Nidoking. Early-game, Kingler can wallbreak with Crabhammer and spread paralysis with Body Slam. If Kingler is saved for late-game, it can easily sweep a weakened and paralyzed team with Swords Dance-boosted attacks.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 520967, "username": "pac"}, {"user_id": 468904, "username": "SBPC"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}, {"user_id": 331519, "username": "CryoGyro"}]}], "writtenBy": [{"user_id": 473639, "username": "LTG"}]}
  },
  "Electrode": {
    "overview": "<p>Electrode is the premier Electric-type in RBY NU, wielding a completely unrivaled Speed tier and access to exquisite utility moves like Explosion and Thunder Wave. In a tier dominated by many Flying- and Water-types, its typing is a major boon offensively, allowing it to threaten a vast portion of the tier with its STAB Thunderbolt. Its high Speed also grants it an enormous critical hit rate of 27.34%, providing it with unpredictable bursts of extreme offensive pressure with both Thunderbolt and Explosion that can pave the way to potential sweeps. In addition, this high Speed allows it to uniquely outspeed every wrapper in the tier, lending it important utility versus the large variety of relevant Fire Spin users such as Charizard and Rapidash.</p> <p>However, while Electrode can be an offensive powerhouse in certain matchups, it has terrible coverage, causing it to struggle against many of the tier's top threats like Golem, Nidoking, and Exeggcute and often forcing it to either switch out or self-KO with Explosion. Its reliance on its Speed also causes it to be threatened out by potential paralysis from key Pokemon like Mr. Mime, Clefable, and the aforementioned Exeggcute. In addition to this, its bulk is mediocre, being 2HKOed by Charizard's Earthquake and Moltres's Fire Blast, meaning that it can struggle to switch in on the Pokemon it's intended to threaten. This forces it to often rely on predictions in order to switch in, making Electrode somewhat inconsistent compared to other top threats. While these come together to make Electrode a very high-risk Pokemon, it has the potential to obliterate opposing teams in certain matchups with proper positioning, granting it a sizable niche in the metagame.</p> ",
    "sets": [
      {
        "name": "Fast Attacker",
        "description": "<h1>Set Description</h1> <p>Thunder Wave is incredible utility, further enhanced by Electrode's fantastic Speed stat that leaves it almost completely uncontested. It allows Electrode to cripple offensive threats like Raticate and Rapidash and support its slower teammates such as Golem and Kingler. Thunderbolt is Electrode's primary offensive tool, threatening a 2HKO on Blastoise, Seadra, Kabutops, Charizard, Poliwhirl, and the occasional Fearow. Explosion allows Electrode to deal massive damage to many Pokemon, dishing upwards of 52% to even its notable checks like Nidoking and Exeggcute. A critical hit Explosion, or an Explosion on a Pokemon that has been inflicted with Screech, can OHKO the majority of the tier, giving Electrode a powerful tool that can potentially force switches with prediction. Alternatively to Screech, Toxic can be used as the most consistent check to wrappers such as Rapidash, Ninetales, and the rare Dragonair. Toxic's ability to spread poison also lets Electrode support its teammates that use Fire Spin, Bind, or Wrap, increasing the chip damage they provide over time.</p> <p>While Electrode's movepool is nothing extraordinary, it has several other viable options. Generally, Electrode's fourth move is the least utilized, so it is the most likely to be replaced with another option. Take Down can be used due to its ability to allow Electrode to punish Nidoking for repeatedly switching in, 6HKOing it. While this would normally seem to be a miniscule amount, Nidoking's lack of reliable recovery makes this somewhat practical, and the small amounts of chip damage can become important in practice. For instance, a critical hit Take Down into Explosion is a KO versus Nidoking after minor chip damage. Thunder allows Electrode to guarantee an OHKO on Poliwhirl, making it especially useful in the lead slot to combat Poliwhirl leads that normally threaten Electrode with Hypnosis. In addition to this, it 2HKOes Moltres instead of 3HKOing it. However, Thunder's poor accuracy relegates this as a potent but inconsistent option. Hyper Beam can be used to deal decent damage to Electric-resistant foes without having to sacrifice Electrode with Explosion, dealing between 46.5% and 54.7% to Nidoking after Screech has been used.</p> <p>Electrode's struggles versus Ground-types causes them to switch in semi-consistently, allowing for its teammates to make bold predictions in order to punish this. Kingler is a great example of this, forcing out Golem with a guaranteed OHKO with Crabhammer while using the opportunity to freely set up with Swords Dance. Alternatively, Seadra can force out both Golem and Nidoking while setting up Agility instead. Electrode's ability to combat Water-types like Blastoise, Poliwhirl, and the aforementioned Seadra lets it be utilized alongside Fire-types such as Charizard, Moltres, and Rapidash. These Fire-types are also able to punish Grass-types like Exeggcute and the niche Weepinbell that may attempt to switch in and check Electrode. In addition to this, Charizard and Moltres are able to come in on Earthquakes that threaten Electrode, thereafter pivoting out with Fire Spin to result in a complete loss of momentum from the opponent.</p> <p>As an alternative to how it's normally used, Electrode can be used as a lead, acting as a counter to opposing Fire Spin and Poliwhirl leads. However, Electrode leads are countered very well by Venomoth. Electrode can be a difficult Pokemon to use, as it often relies purely on prediction to make progress. This especially applies to Explosion, as using it at the wrong time can often result in a wasted Pokemon due to it possibly exploding into a Kabutops or Golem, which will take minuscule damage. You should usually use Explosion when the opponent cannot be sure of its usage, such as when you have used Screech. If the opponent stays in, they potentially take disastrous damage from Explosion. If they switch out into a Pokemon such as Golem, this risks being predicted with a Water-type like Seadra being sent out. Pokemon like Mr. Mime, Clefable, and Nidoking are fantastic targets to hit with Explosion, typically leading the way for a sweep from the likes of Charizard and Raticate.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 236353, "username": "May"}, {"user_id": 233818, "username": "Enigami"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}]}], "writtenBy": [{"user_id": 520967, "username": "pac"}]}
  },
  "Exeggcute": {
    "overview": "<p>What Exeggcute lacks in stats, it makes up for in status moves and typing, utilizing its key Psychic and Electric resistances to spread sleep and paralysis. Its typing does come with drawbacks, however, making it extremely vulnerable to the plentiful Fire- and Ice-type attacks in the tier. Even though it resists Earthquake, its very low Speed and lack of viable Grass-type STAB moves makes Golem only fear status, and its low Special and Ice weakness make it an extremely unreliable switch-in to Nidoking. Its physical bulk, while passable, is insufficient to avoid OHKOs from Kingler's and Pinsir's +2 Hyper Beams, making its team more vulnerable to being swept by them. Additionally, its low offensive stats leave it rather passive after it spreads status.</p> <p>Despite these faults, Exeggcute is a contender in RBY NU. It is one of the few Pokemon available that can inflict sleep. It can switch into, status and wear down the opponent's Mr. Mime without exposing your own Mr. Mime to paralysis, keeping it healthy so it can run rampant later in the match. Its resistance to Mr. Mime's, Electrode's, and Venomoth's primary attacks, and it taking paralysis without much worry, makes it good support for teams otherwise vulnerable to these Pokemon. Water-types in particular have good synergy with Exeggcute, covering for its weakness to Fire and Ice while Exeggcute in turn covers their Electric weakness. Powerhouses below base 90 Speed like Nidoking and Pinsir enjoy Exeggcute as a relatively safe means to escape heavy damage or paralysis from Mr. Mime, Electrode, or Venomoth, as well as inflicting status that they can take advantage of to blow apart the opposing team. And while Exeggcute can't fight Ground- and Water-types one on one, its resistances to their STAB attacks let it bait their weaker coverage moves to more safely switch in teammates.</p> ",
    "comments": "<h1>Other Options</h1> <p>Psywave ignores stats and typing and can deal up to 150 damage, which can heavily pressure Psychic-types that are otherwise only concerned about Exeggcute's status moves. However, its shaky 79.03% accuracy and highly variable damage make it unreliable and usually not worth using. Toxic is an alternative means of crippling partial trappers such as Moltres and Charizard attempting to switch in, impairing their partial-trapping moves with continual poison damage. Double-Edge could be used to pressure Mr. Mime slightly more heavily than Psychic; however, Exeggcute's dismal Attack stat only threatens a 5HKO and the move weakens Exeggcute with recoil damage. Alternatively, Egg Bomb avoids recoil damage at the cost of a poor 74.7% accuracy. Solar Beam is Exeggcute's only Grass-type attack, and it threatens Kingler, Kabutops, and Golem with a OHKO and inflicts massive damage on Blastoise and Seadra. However, since the opponent can simply switch out during its charge turn, Solar Beam is only possibly useful late-game when they might lack healthy teammates or Grass-resistant Pokemon to tank it.</p> <h1>Checks and Counters</h1> <p><strong>Bulky Water-types: Defensive Water-types like Blastoise are faster than Exeggcute, aren't threatened much by its Psychic or Explosion, aren't affected heavily by paralysis, shred Exeggcute with Ice-type attacks, and have a decent chance of waking up later in the match if they take Sleep Powder.</p> <p><strong>Fire-types</strong>: All fully-evolved Fire-types outspeed and OHKO Exeggcute with Fire Blast, and they are either 5HKOed or 4HKOed by Exeggcute's weak Psychic. Due to their Speed and Fire Spin resistance, they also stand a good chance to wake up if they take Sleep Powder, making them decent sleep absorbers. Stun Spore on the switch heavily cripples them, though.</p> <p><strong>Clefable and Wigglytuff</strong>: Both Clefable and Wigglytuff outspeed and 2HKO Exeggcute with Blizzard, and if they don't have that, they can 3HKO with two Body Slams followed by Hyper Beam. They are already slower than most of the tier and thus aren't crippled much by paralysis, and Psychic only 5HKOs them, letting them bully Exeggcute without much issue once Sleep Powder isn't an option.</p> <p><strong>Unevolved Psychic-types</strong>: Exeggcute and Drowzee can easily use each other to get in and spread status once sleep can no longer affect them. However, Exeggcute will struggle to break other Exeggcute with Rest without Psywave or attempting to trade with Explosion, Drowzee needs luck with Special drops or full paralysis to break through Rest Exeggcute, and Explosion Exeggcute can trade with Drowzee after some chip damage.</p> <p><strong>Fearow, Raticate, and Nidoking: In a pinch, these fast offensive Pokemon 2HKO Exeggcute to win one-on-one, but all are severely crippled by paralysis and Nidoking especially does not take Psychic well. They are very effective at punishing Rest Exeggcute, taking advantage of its sleeping turns to switch in safely and blow holes in its team if Exeggcute doesn't let itself be KOed.</p> ",
    "sets": [
      {
        "name": "Support",
        "description": "<h1>Set Description</h1> <p>Exeggcute's primary goal is to get in and put something to sleep with Sleep Powder as soon as it can, then attempt to spread paralysis with Stun Spore to support its team. Teammates shouldn't paralyze Pokemon Exeggcute struggles to handle like Fire-types before Exeggcute gets in and puts a foe to sleep. Psychic is Exeggcute's STAB move and hits most Pokemon in the tier for neutral damage. Psychic's 33.2% chance of reducing Special helps Exeggcute to overcome its passiveness, preventing most Pokemon from safely using it to recover with Rest or burn sleep turns. For example, Blastoise and Seadra can't trap Exeggcute in a Rest loop at -1 Special and can no longer reliably 2HKO it with Blizzard. Special drops can also create opportunities to spread status. At -1 Special, even the nuclear Fire Blasts from Moltres can't OHKO Exeggcute from full health without a critical hit, giving a healthy Exeggcute the option to boldly stay in on Fire-types and cripple them with status without falling to Fire Blast.</p> <p>Rest gives Exeggcute longevity against Mr. Mime and Electrode, letting it continually frustrate their attempts to make progress and provide a safe switch for Pokemon vulnerable to them. However, due to its low bulk and common weaknesses, it invites sweepers like Nidoking and Raticate in to throw out devastating attacks while it is asleep. Explosion is a more aggressive option over Rest, trading the ability to continually wall Mr. Mime and Electrode for taking out over two thirds of Mr. Mime's maximum HP, leaving it in KO range of Seismic Toss or any decently powerful attack. Explosion also takes out about half the maximum HP of everything else that isn't Mr. Mime or a Rock-type, heavily weakening one of the opponent's Pokemon once Exeggcute has done its job spreading status and is no longer needed.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 236353, "username": "May"}, {"user_id": 520967, "username": "pac"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 233818, "username": "Enigami"}]}
  },
  "Marowak": {
    "overview": "<p>Marowak is completely outclassed by Sandslash, as well as other Ground-types such as Nidoking and Golem, meaning it should never be considered for any serious team. Its stats are poor, with all stats equal to or lower than Sandslash's. Although Marowak does have Blizzard and Counter, Sandslash's Swords Dance and Rock Slide are far more valuable, especially considering Marowak's mediocre Attack. It also has weaknesses to common attacking types like Water and Ice, and it loses to a lot of common Pokemon in the metagame, notably Poliwhirl and Kingler, which destroy it. Generally, Marowak should never be considered for a competitive RBY NU team.</p> ",
    "sets": [{"name": "Counter", "description": "<p>This is Marowak's best set with its terrible movepool. Earthquake is a needed STAB move and provides solid coverage for Pokemon like Nidoking and Rapidash. Body Slam can paralyze foes to help Marowak with its abysmal Speed. Counter can counter Normal-type attacks from Pokemon such as Pinsir and Raticate, and it works well due to Marowak's lack of a Normal resistance. Finally, Blizzard can 2HKO Exeggcute.</p> "}],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 236353, "username": "May"}, {"user_id": 96315, "username": "phoopes"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 508601, "username": "Holly"}]}
  },
  "Hitmonlee": {
    "overview": "<p>Hitmonlee is a Pokemon that rarely sees the light of day in competitive RBY NU play, though it does have a few strong points. Its base 120 Attack and the unique STAB move High Jump Kick seem appealing, as High Jump Kick 2HKOs physically bulky Pokemon like Clefable, Wigglytuff, Kabutops, Golem, and Porygon. Its Speed also makes it faster than some of the tier's other offensive threats, such as Nidoking and Pinsir. However, it just has too many flaws to really make use of its unique traits.</p> <p>Firstly, all of Hitmonlee's attacking moves are either Normal-type or Fighting-type. This lack of coverage makes it difficult for Hitmonlee to damage a lot of Pokemon outside of those weak to High Jump Kick. This goes especially for Gastly, which is immune to all of Hitmonlee's competitively viable moves besides Seismic Toss. Next, its Speed is only base 87, meaning it falls short when compared to other offensive threats in the tier such as Mr. Mime, Poliwhirl, and Charizard. Therefore, Hitmonlee needs extensive paralysis support to work, and it's just not worth it when other Pokemon like Golem get more mileage out of such a strategy. Finally, its paper-thin defenses mean it has little chance of surviving any interactions. This is especially true against common Flying-, Psychic-, and Poison-type Pokemon, since they resist High Jump Kick. Pretty much the entire metagame can OHKO or 2HKO Hitmonlee regardless of whether or not they can hit it super effectively. For these reasons, Hitmonlee is best left on the sidelines and not used on your team.</p> ",
    "sets": [
      {
        "name": "Meditate Attacker",
        "description": "<p>High Jump Kick is Hitmonlee's most powerful attack, and is good for 2HKOing Pokemon that Hitmonlee outspeeds such as Clefable, Wigglytuff, and Porygon. One Meditate boost turns the aforementioned 2HKOs into likely or guaranteed OHKOs, and changes a potential 2HKO on Golem into a guarantee. Body Slam is used for some much-needed coverage and consistency, allowing Hitmonlee to deny switch-ins and spread paralysis without support from teammates. For Hitmonlee's final moveslot, there are a few options. Counter can net some surprise KOs from Normal-type attacks like Charizard's Slash, or even a teammate's Explosion in the niche scenario where Hitmonlee is brought in right afterward to deal massive damage to a potential switch-in. Seismic Toss lets Hitmonlee actually damage Gastly and force it to use Explosion earlier. Mega Kick deals higher damage than Body Slam to the many Pokemon that resist Fighting-type attacks in the NU metagame, but comes at the cost of lower accuracy.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 236353, "username": "May"}, {"user_id": 530877, "username": "Volk"}, {"user_id": 520967, "username": "pac"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}, {"user_id": 33374, "username": "Muk"}]}], "writtenBy": [{"user_id": 96315, "username": "phoopes"}]}
  },
  "Hitmonchan": {
    "overview": "<p>On paper, Hitmonchan seems to be a solid Pokemon. It can pose a threat late-game with Agility, nabbing a 2HKO with Submission on the likes of Clefable and Wigglytuff, and can also fish for freezes with Ice Punch. However, Hitmonchan is among the worst fully-evolved Pokemon in RBY, due to its extremely bad Special, mediocre Defense, weakness to Psychic, and lack of any real offense. It struggles to make any progress versus Poliwhirl, Mr. Mime, Charizard, and Moltres and is 2HKOed by the many special attackers of the tier while not dealing much damage in return. It is also completely outclassed by other similarly unviable Fighting-types in RBY NU, such as Machamp, and should never be considered for any serious team. Many other physical threats such as Fearow and Pinsir are much better options for a team.</p> ",
    "sets": [
      {
        "name": "Physical Attacker",
        "description": "<p>Submission is the best STAB move Hitmonchan has, and can 2HKO Pokemon such as Clefable. Body Slam can spread paralysis onto Pokemon such as Nidoking, making Hitmonchan more self-sufficient. Agility can help if Hitmonchan is paralyzed, giving it its Speed back and letting it pose a late game threat. Counter allows Hitmonchan to deter use of Body Slam from the likes of Clefable, but Ice Punch can be used instead to damage Exeggcute or try to freeze opposing Pokemon.</p> <p>Hitmonchan has a few other options; Seismic Toss deals the most possible damage to Nidoking. Alternatively, Toxic can stop AgiliWrap Dragonair and hinder Fire Spin users such as Rapidash, as Toxic's damage outdamages their partial trapping moves. Mimic could be used to fish for an opposing Pokémon’s move. However, many Pokemon easily exploit Mimic by using special moves Hitmonchan does miserable damage with, making it inconsistent. While Fire Punch and Thunder Punch may seem enticing, Hitmonchan's Special is awful, making them almost unusable. Pokemon that can deal with special attackers, such as Clefable, generally make good partners for Hitmonchan.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 265630, "username": "Amaranth"}, {"user_id": 96315, "username": "phoopes"}, {"user_id": 487308, "username": "BT89"}, {"user_id": 520967, "username": "pac"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 508601, "username": "Holly"}]}
  },
  "Lickitung": {
    "overview": "<p>In the first generation of Pokemon, Normal-types aren't to be taken lightly, due to boasting powerful STAB moves such as Body Slam, Hyper Beam, and Double-Edge. Even in RBY NU, given the presence of Fearow, Raticate, and Porygon, Lickitung exists to prove that not all Normal-types are created equal. Lickitung looks promising with its access to STAB Wrap and Swords Dance, amazing coverage options, and potential to spread paralysis with Body Slam. However, it falls short literally everywhere else due to its absolutely horrendous stats. For these reasons, Lickitung remains a terrible Pokemon in RBY NU, and it shouldn't be used unless you're looking to torture yourself.</p> ",
    "sets": [
      {
        "name": "Swords Dance",
        "description": "<p>If you're going to experience the torture of using Lickitung, it's best to utilize its most unique trait: STAB Wrap. However, Lickitung's Wrap is still very weak, barely passing 4% on most neutral targets before boosting; after a boost, however, it has the damage output to surpass Dragonair's critical hit-boosted Wrap, averaging around 8% on neutral targets. Paralysis support is absolutely paramount to even give this thing the time of day due to its atrocious base 30 Speed. Teammates such as Mr. Mime, Venomoth, and Porygon can be very useful in that regard, as they can spread status without much trouble. Earthquake allows Lickitung to hit Kabutops and Golem with super effective damage, but, due to Lickitung's poor stats, it's still only a 2HKO on either after a Swords Dance. Lickitung can use Body Slam repeatedly in order to spread its own paralysis, but it's still walled effectively by most bulky Pokemon if it doesn't manage to get a paralysis off, and it can be removed incredibly easily by most special attackers due to its pitiful Special stat.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 236353, "username": "May"}, {"user_id": 96315, "username": "phoopes"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 468904, "username": "SBPC"}]}
  },
  "Weezing": {
    "overview": "<p>At first glance, you wouldn't expect a Pokemon like Weezing to be so underwhelming. When you factor in its great bulk—as well as a solid offensive movepool featuring moves like Thunderbolt, Fire Blast, and Explosion—it does initially look quite serviceable. It's even one of only two Pokemon in the game with access to Sludge, giving it a decent Poison-type STAB move that lets it spread poison efficiently. Sludge can cripple a variety of wrappers such as Dragonair, Rapidash, and Pinsir, the latter of which is hit super effectively. Its Poison typing also helps guard your team against this, letting it switch in on Toxic to protect your own wrappers.</p> <p>However, that's all the good things one can say about Weezing. Weezing's Speed and typing are awful; this means that most, if not all, of the metagame's big threats such as Mr. Mime, Nidoking, and Golem can answer it, possessing super effective coverage to invalidate its bulk while often being able to switch in comfortably. Ergo, Weezing is often a momentum sink. To add on to this, better Poison-types like Venomoth, Nidoking, and even Muk make it very hard for Weezing to find a spot on any competitive RBY NU team.</p> ",
    "sets": [
      {
        "name": "Explosion",
        "description": "<p>This is the best Weezing can muster; its movepool is deceptively shallow. Weezing has among the strongest Explosions in the tier, only being beaten out by Muk and Golem, allowing it to OHKO Mr. Mime, Rapidash, and Electrode, though the latter two aren't guaranteed. The combination of Fire Blast and Thunderbolt lets Weezing hit almost the entire tier for at least neutral damage; Fire Blast is of particular note for giving Weezing an answer to Exeggcute, while Thunderbolt 2HKOes Poliwhirl and Flying-types like Fearow. The last moveslot is largely subjective; Hyper Beam KOes Mr. Mime and Raticate from around half HP, while Sludge is more reliable while coming with a very high poison chance.</p> <p>While its movepool is tiny, Weezing can be customized to some degree. Thunder can be used for a boost in power at the cost of consistency, letting Weezing 2HKO Blastoise, Charizard, Kabutops, and Seadra. While Weezing is efficient at spreading status thanks to Fire Blast and Sludge, Toxic is a valid option to consistently prevent wrappers like Dragonair, Rapidash, and Charizard from taking over games. Finally, Rest can theoretically give more bang for your buck with Weezing's bulk, but its defensive typing makes it difficult to actually wake up. Weezing is best used on offensive teams that can benefit from the holes its Explosion tears in teams; thus, Pokemon like Moltres and Kingler make good partners. Additionally, a Pokemon that can remove Golem such as Blastoise or Seadra can help; otherwise, Weezing tends to let it in for free. Even when Weezing benefits teams, Muk is often superior for its access to Body Slam and a stronger Explosion.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 236353, "username": "May"}, {"user_id": 265630, "username": "Amaranth"}, {"user_id": 520967, "username": "pac"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 531694, "username": "Branwen Uchiha"}]}
  },
  "Seadra": {
    "overview": "<p>Seadra is an excellent offensive threat in RBY NU, possessing Agility to distinguish itself as a late-game cleaner that isn't completely ruined by paralysis. Seadra's high Special and combination of Water- and Ice-type coverage, while not unique, let it batter teams when coupled with Agility. Seadra isn't just a solid offensive pick either: it can form a great defensive core with Pokemon like Blastoise as well, guarding against the myriad of Fire-types in the tier, most notably Charizard, thanks to their mixed bulk. Thus, Seadra fits very well on teams that demand a late-game sweeper that doubles as a defensive pivot.</p> <p>However, while Seadra is a good defensive Water-type, it is also checked excellently by them, struggling to break past them because of its shallow offensive movepool. Seadra's Speed, while it can boosted by Agility, is a bit mediocre, surpassed by common Pokemon such as Fire Spin users like Charizard, Rapidash, and Ninetales. Ergo, while it can stop Fire Spin users in their tracks, it can't do much about them pivoting into a check like Electrode.</p> ",
    "sets": [
      {
        "name": "Agility Sweeper",
        "description": "<p>The combination of Surf and Blizzard gives Seadra coverage resisted only by opposing Water-types; Surf 2HKOes Fire-types like Arcanine, Charizard, and Ninetales, while Blizzard 2HKOes Exeggcute and Fearow. Hydro Pump can be used over Surf to score a 2HKO on Moltres and sometimes Mr. Mime, though inconsistency can be its downfall. Rest or Toxic can be used to improve matchups against wrappers, especially if running Hydro Pump; Rest gives Seadra a great matchup against Fire Spin users in combination with Agility and gives it significant longevity, while Toxic can more definitively stop wrappers like Dragonair, Moltres, and Charizard. However, Hydro Pump can be used here instead to close out the aforementioned 2HKOs while keeping Surf's reliability. Finally, Agility lets Seadra sweep late-game and remove the Speed drop from paralysis.</p> <p>Despite having a very shallow movepool, Seadra can be customized a bit. Hyper Beam can KO Mr. Mime from a minimum of 38.1%, dealing more damage than Surf, while also dealing more damage to Water-types than Hydro Pump. However, its utility outside of this is questionable at best and Hydro Pump tends to be more effective in practice. Double-Edge can be used for these targets and lacks a recharge turn, but it deals less damage than Hydro Pump against Water-types, so it isn't recommended. Ice Beam can be used alongside Rest to fish for a freeze, though Pokemon like Blastoise often do this more effectively. Seadra's unique access to Smokescreen as a Water-type is arguably useful to combat AgiliWrap Dragonair and AgiliSpin Moltres or Rapidash, but Toxic is often superior for putting a permanent, consistent stop to their antics.</p> <p>Seadra is best used on teams that appreciate multiple Water-types; thus, Pokemon like Blastoise and Kabutops make good partners. It also appreciates Exeggcute as a partner for walling Mr. Mime and having Sleep Powder, the latter of which helps Seadra more easily set up Agility. Additionally, Exeggcute appreciates Seadra's presence for combatting Fire-types like Moltres that severely threaten it. Similarly, Nidoking struggles against Charizard while helping Seadra's Electric weakness. Seadra can be used mid- and late-game as either a defensive pivot or a cleaner, gating off the tier's Fire-types and eventually swinging for victory. It's best to set up Agility as late as possible once its checks and counters have been removed, as Seadra is otherwise easily walled by a Water-type switch-in.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 520967, "username": "pac"}, {"user_id": 233818, "username": "Enigami"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 236353, "username": "May"}]}
  },
  "Seaking": {"sets": [{"name": "Agility + 3 Attacks"}, {"name": "Agility + Rest"}]},
  "Mr. Mime": {
    "overview": "<p>Mr. Mime is the most dominant Pokemon in RBY NU, functioning as the tier's premier special attacker, with its great typing, high Speed, and unresisted coverage making it versatile and hard to consistently check. Said high Speed lets it take advantage of its coverage extremely effectively, outspeeding or Speed tying every threat that it hits super effectively besides Charizard, Fearow, and the niche Primeape. Thunderbolt lets Mr. Mime check key Water-types like Seadra, Kabutops, and especially Blastoise, an incredibly valuable role. It is also one of the fastest paralysis spreaders in the tier, forcing out numerous offensive threats such as Electrode and Fearow and crippling Fire Spin users for missing. Nearly every competitive team uses Mr. Mime, partially because it is one of the few reliable checks to itself.</p> <p>While Mr. Mime is an incredibly good Pokemon, its terrible Defense makes it decently frail, being 2HKOed by some of the Pokemon it's supposed to threaten offensively, such as Moltres and Kabutops. Due to this, it's incredibly reliant on its Speed stat to stay relevant throughout the battle. This means Thunder Wave users such as Clefable and Porygon usually force it out. In addition, it comes out incapacitated from the Mr. Mime mirror match and is forced out by other Psychic-types like Exeggcute and Drowzee. Its Speed, while impressive, still leaves it susceptible to notable Fire Spin users like Charizard, Rapidash, and Ninetales. While it doesn't take heavy damage from Fire Spin, it usually lacks recovery to mitigate the chip damage. Also, outspeeding Mr. Mime lets the Fire Spin users pivot to a revenge killer that can exploit its poor Defense like Fearow. It especially struggles with Rapidash, Ninetales, and Moltres, being unable to deal notable damage without Psychic Special drops and taking hefty damage from Fire Blast.</p> ",
    "comments": "<h1>Other Options</h1> <p>Mr. Mime has few truly relevant other options, as its main set is the most consistent across the board and leaves little room for other moves. Rest is the most common option; it can be used over Seismic Toss to grant Mr. Mime more longevity against Psychic-types and Clefable. It is especially relevant versus Exeggcute, which becomes unable to threaten it outside of Explosion. While Mr. Mime's frailty gives it few chances to wake up normally, the high frequency of Fire Spin users and opposing Mr. Mime allows it to come in and burn sleep turns somewhat reliably. Barrier allows Mr. Mime to somewhat mitigate its frailty, turning normally threatening moves like Kingler's Body Slam from a guaranteed 3HKO to a possible 5HKO. It also gives it a safety net against +2 Hyper Beam from Pokemon like Pinsir, Kingler, and Kabutops, which otherwise threaten Mr. Mime with a potential OHKO. Counter can deal heavy damage to a physical attacker such as Raticate or Pinsir given Mr. Mime's physical frailty. Notably, Mr. Mime will likely force out Raticate right away with the threat of paralysis, allowing Counter to deal massive damage to the switch-in. Solar Beam is Mr. Mime's strongest attack versus Golem, but the charge turn leaves it open to exploitation. Flash could be used to inconsistently drop accuracy, but the move is mostly outclassed by Thunder Wave, which effectively achieves the same thing except against Ground-types.</p> <h1>Checks and Counters</h1> <p><strong>Psychic-types: Exeggcute is one of the best dedicated checks to Mr. Mime, resisting both Psychic and Thunderbolt while threatening it in return with paralysis or sleep. However, unless Exeggcute is running the rare Double-Edge or sacrifices itself with Explosion, it can struggle to damage Mr. Mime, only inflicting a possible 7HKO with Psychic. Drowzee, while rare, threatens Mr. Mime with Thunder Wave, Hypnosis, or a 3HKO from Seismic Toss. Mr. Mime's Seismic Toss only 4HKOes, leaving Drowzee relatively safe.</p> <p><strong>Clefable: Clefable is only 4HKOed by Mr. Mime's Psychic. It can also retaliate with paralysis, sleep, and heavy damage, with Body Slam followed by Hyper Beam KOing after minor chip damage. However, a Special drop from Psychic leaves Clefable KOed by Psychic, vastly worsening the matchup.</p> <p><strong>Revenge Killers</strong>: Mr. Mime's frailty means faster offensive threats often force it out, most of which are Fire-types. Arcanine and Ninetales are only 4HKOed by Psychic while threatening 2HKOs back with Fire Blast and Hyper Beam. While Moltres does not outspeed Mr. Mime, it is only 3HKOed by Thunderbolt 47.1% of the time, granting it an opportunity to set up Agility while threatening a 2HKO with Fire Blast in return. While it cannot switch in due to paralysis, Charizard is a notable example, outspeeding Mr. Mime to use Fire Spin effectively and threatening a 3HKO with both Fire Blast and Slash. While they also typically cannot switch in due to the threat of paralysis, other revenge killers such as Fearow, Electrode, and Raticate also outspeed Mr. Mime and threaten it with severe damage or paralysis.</p> <p><strong>Paralysis: Paralysis removes one of Mr. Mime's primary strengths in its Speed. This lets Pokemon it normally forces out like Nidoking and Blastoise overrun it with heavy damage. Paralysis from opposing Mr. Mime also makes navigating the mirror matchup tricky. A paralyzed Mr. Mime can make late-game scenarios much more inconsistent, such as not having fast Electric-type coverage to threaten a Kabutops that is standing in the way of Moltres.</p> <p><strong>Golem: Golem threatens a 2HKO with Earthquake, as well as Earthquake following Body Slam. Its ability to avoid a Psychic 2HKO and safely come in on attempted Thunder Wave and Thunderbolt from Mr. Mime accentuates this danger.</p> ",
    "sets": [
      {
        "name": "Offensive Utility",
        "description": "<h1>Set Description</h1> <p>Psychic threatens to 2HKO Nidoking, Venomoth, and Raticate, and 3HKO many notable Pokemon like Electrode, Rapidash, and Golem. Special drops and critical hits make it even more difficult to switch into consistently. Thunderbolt is Mr. Mime's strongest option against NU's many Water- and Flying-types, including Blastoise, Seadra, Poliwhirl, Charizard, Moltres, and Kabutops, 2HKOing or 3HKOing all of them. Thunder Wave cripples Wrap users, revenge killers like Charizard and Arcanine, and other Mr. Mime, making Mr. Mime a check to itself; you should think carefully before trading paralysis with the opponent's Mr. Mime, however. Seismic Toss is Mr. Mime's best attack against Psychic-types like Exeggcute, Drowzee, Abra, and itself.</p> <p>Threatening Water-types makes Mr. Mime suited to partner with Fire-types like Ninetales and Rapidash. Thunder Wave lets it support sweepers like Golem and Nidoking, crippling roadblocks like Poliwhirl and Seadra. Mr. Mime also appreciates these Ground-types for switching into opposing Mr. Mime's Thunder Wave. Mr. Mime also appreciates dedicated checks to itself like Clefable and Exeggcute, as opposing Mr. Mime is one of its greatest roadblocks. Mr. Mime can struggle versus faster Fire-types, so Blastoise is appreciated in order to check them and help absorb Fire Spin.</p> <p>Mr. Mime excels as a wallbreaker and sweeper. One of Mr. Mime's biggest strengths is its excellence against Pokemon like Nidoking and Blastoise, which other sweepers like Electrode and Kingler can struggle to handle consistently. Mr. Mime also has excellent utility in the earlier parts of the game, spreading paralysis and helping to check opposing Mr. Mime.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 236353, "username": "May"}, {"user_id": 231074, "username": "S1nn0hC0nfirm3d"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}, {"user_id": 331519, "username": "CyroGyro"}]}], "writtenBy": [{"user_id": 520967, "username": "pac"}]}
  },
  "Scyther": {
    "overview": "<p>Scyther has an array of applicable offensive tools in the NU metagame. Slash bypasses Pokemon relying on Reflect, such as Abra and some Clefable variants, while Swords Dance and Hyper Beam make it tough for Normal-neutral Pokemon to switch into. Scyther is also one of the fastest unboosted Pokemon in the metagame; it ties for the second-fastest Pokemon in the tier with Rapidash and has a superb critical hit ratio of 20.5%. Its already terrific Speed can be bolstered with Agility, meaning it cannot be pinned down by partial trappers and opposing Agility users like Dragonair and Moltres either. With adequate paralysis support and good prediction, Scyther can theoretically be used as a powerful late-game cleaner.</p> <p>However, Scyther has too many flaws to warrant a spot on most teams. Its low bulk and horrid defensive typing render many attackers able to 2HKO or even OHKO it. These include notable Pokemon such as Blastoise, Nidoking, Golem, and Kingler. Scyther's reliance on Speed means that even with Agility, it is severely debilitated by paralysis compared to other sweepers. It also has a barren movepool: besides the miserably weak Wing Attack, it only possesses Normal-type attacks, meaning Rock-types like Golem and Kabutops can easily switch in and make progress against it. Other fast sweepers, such as Mr. Mime and Electrode, can provide more offensive presence throughout matches, as they sport better coverage moves and provide utility with status moves like Thunder Wave. While Scyther can be used to lure its counters and grant switch-in opportunities for its teammates like Blastoise and Kingler, this tends to be prediction-reliant and inconsistent.</p> ",
    "sets": [
      {
        "name": "Double Dance",
        "description": "<p>Swords Dance makes Scyther's Hyper Beam one of the most threatening moves in the tier, always or possibly OHKOing Pokemon like Mr. Mime, Electrode, and Rapidash at +2. Agility allows it to outspeed the entire unboosted metagame, notably including Electrode and Rapidash, which usually threaten it out with super effective moves. If Scyther is paralyzed, Agility can also remove the Speed drop. Slash is its primary attacking move, almost always scoring a critical hit and punishing foes for switching into predicted Swords Dance, 3HKOing foes like Charizard, Poliwhirl, and Ninetales. Unfortunately, it does not get a power boost with Swords Dance.</p> <p>Scyther's shallow movepool leaves it with few other options. Agility is the most replaceable, as Scyther is already fast and does not need the additional Speed most of the time. Toxic discourages AgiliWrap Dragonair and Fire Spin users like Moltres, Charizard, and Rapidash from setting up on it. Unlike Slash, Double-Edge gets the power boost from Swords Dance and can be utilized if Slash's immediate power is not desired. Wing Attack can be used to damage Gastly, but not only is Gastly rare, Wing Attack also has lower damage than Slash even against super effective targets. Substitute can be used to ease prediction, rack up poison and burn damage, and fish for full paralysis and misses, such as against Fire-types like Charizard, Ninetales, and Moltres.</p> <p>As Scyther struggles to make headway against Rock-types like Kabutops and Golem, Grass-types like Exeggcute and Weepinbell are useful teammates. Scyther is also vulnerable to Fire-types like Ninetales, Rapidash, and Moltres, so Water-types like Kabutops and Blastoise to withstand Fire- and Rock-type attacks are also appreciated. Scyther can function as a lure for Rock-type Pokemon, which makes it easier for its partners like Blastoise and Kingler to predict an attack. Sleep inducers such as Poliwhirl and Venomoth can cripple Scyther’s counters and can facilitate setup opportunities. In turn, Scyther can come in on predicted Rest from Pokemon like Poliwhirl and Blastoise, enabling it to more easily break through the opposition.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 520967, "username": "pac"}, {"user_id": 236353, "username": "May"}]}, {"name": "Grammar checked by", "members": [{"user_id": 331519, "username": "CryoGyro"}]}], "writtenBy": [{"user_id": 543866, "username": "5Dots"}]}
  },
  "Magmar": {
    "overview": "<p>Magmar stands out as an interesting Fire-type in RBY NU, trading the typical access to Fire Spin for an incredible movepool. With a multitude of fantastic attacks like Psychic, Submission, and Fire Blast, as well as many useful utility moves such as Body Slam and Counter, Magmar has a potential move to fit nearly every situation. This large movepool also makes it hard to predict, with the opponent forced to make tough decisions if not every move has been revealed. Its typing grants it some defensive utility versus the other Fire-types such as Moltres and Ninetales, as well as being fantastic offensively versus Grass- and Bug-types like Exeggcute, Venomoth, and Pinsir.</p> <p>However, Magmar is one of many Fire-types in the tier and is unfortunately mostly outclassed by more popular picks such as Arcanine, Charizard, and Ninetales. Lacking Fire Spin is unfavorable, as it's incredibly useful to freely pivot out from checks like Blastoise and maintain momentum. Arcanine also lacks Fire Spin, but it features much more favorable bulk. Magmar's movepool grants it better matchups versus the likes of Kabutops, but its middling stats still hold it back, and it often can't fit everything it needs to function consistently. Magmar is also physically frail, making Ground- and Rock-type Pokemon like Nidoking and Golem especially frightening foes to face.</p> ",
    "sets": [
      {
        "name": "Mixed Attacker",
        "description": "<p>Fire Blast is Magmar's strongest STAB move and has a useful 30.1% chance to burn, making potential checks like Kabutops less inclined to switch in. Seismic Toss is a decent neutral option, dealing consistent 4HKOes to bulky Pokemon such as Blastoise and Moltres. Submission most notably 3HKOes Kabutops, a Pokemon that many Fire-types like Arcanine can struggle with, while also 2HKOing Raticate and 3HKOing Clefable and Porygon. Psychic is able to 3HKO Nidoking and the rare Nidoqueen, which can be improved by Special drops. It also grants it a potential role as an effective Moltres check, threatening Special drops while taking little damage from Fire Blast. In addition to this, if Kabutops and Nidoking take a singular Special drop, Magmar can win the interaction cleanly. Body Slam makes use of Magmar's surprisingly decent Attack and can threaten paralysis against Pokemon like Mr. Mime, and Submission and Psychic nail resistant Pokemon like Golem.</p> <p>Magmar's wide movepool makes it pretty customizable. Counter can heavily punish Raticate, Clefable, and Pinsir for using their primary attacking moves, as well as any Pokemon using Body Slam as coverage. Hyper Beam is a viable alternative to Body Slam, letting Magmar more convincingly beat physically frail Pokemon—like Mr. Mime from a minimum of 48.4%. However, against some bulky threats like Blastoise and Moltres, it doesn't deal vastly more damage than Seismic Toss. Toxic firmly prevents Dragonair from sweeping with AgiliWrap if it attempts to use Magmar as setup fodder, as well as checking other wrappers such as Rapidash and Ninetales. Toxic can also be used to support wrapper teammates, increasing their net damage output when using their partial-trapping moves. Finally, Smokescreen possibly allows Magmar to beat Pokemon it otherwise would not, such as AgiliWrap sweepers. In addition to this, Smokescreen can reapply the foe's Speed drops from paralysis.</p> <p>Magmar is best used on teams that want the offensive threat of a second Fire-type alongside Charizard, but don't want the inconsistency versus Kabutops that Fire-types like Arcanine and Moltres can cause. Having multiple Fire-types can cause the team to struggle offensively versus other Water-types like Seadra and Blastoise, so checks to these such as your own Blastoise, Mr. Mime, and Electrode are appreciated. Blastoise is an especially good choice, as it also helps versus Golem, which Magmar can merely 4HKO with Seismic Toss and Psychic—while being OHKOed by Earthquake in return.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Earlier version by", "members": [{"user_id": 508601, "username": "Holly"}]}, {"name": "Quality Checked by", "members": [{"user_id": 236353, "username": "May"}, {"user_id": 96315, "username": "phoopes"}, {"user_id": 520967, "username": "pac"}]}, {"name": "Grammar Checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 520967, "username": "pac"}]}
  },
  "Pinsir": {
    "overview": "<p>Pinsir is a frightening Swords Dance sweeper in RBY NU, possessing one of the highest power levels in the tier in the tier alongside Bind and Slash. Once set up, Pinsir goes on a rampage, quickly chipping down Pokemon with Bind before letting loose one of the strongest Hyper Beams in the game. Pokemon like Mr. Mime, Dragonair, Venomoth, Exeggcute, and Poliwhirl are even threatened with outright OHKOs at +2, while Blastoise and Clefable need minimal Bind chip damage to OHKO as well. Pinsir is by no means slow either, tying Nidoking and Seadra and getting the jump on Blastoise and Kabutops. When forming a core with wrappers such as Rapidash, Moltres, and Charizard, Pinsir can add some much-needed physical attacking prowess. With paralysis support from the likes of Mr. Mime, Venomoth, and Porygon, Pinsir can also sweep past otherwise faster checks like Charizard and Moltres.</p> <p>However, Pinsir's movepool is extremely shallow, making it linear and open to very simple counterplay, such as switching in Golem or even just having Counter. With the high viability of Fire-types in RBY NU, Pinsir's low Special also comes back to haunt it, leaving it OHKOed by even Charizard's Fire Blast and limiting setup opportunities against special attackers like Seadra. This special frailty means Pinsir is best used on teams populated by Water-types such as Blastoise and Kabutops, the latter with which actually competes heavily with it. That competition further extends to Kingler, which possesses similar qualities to Pinsir while having reliable counterplay to Rock-types in Crabhammer, as well as other Pokemon like Sandslash. However, it fares well alongside these Swords Dance users, and Bind can be enough for it to distinguish itself over them. Worse still, Pinsir's Speed, while good, is still not quite desirable; Fire-types revenge kill it, as do Venomoth, Fearow, and tier-king Mr. Mime. Its suboptimal Speed also makes paralysis even worse, exposing its fragility and making it very difficult to clean up even paralyzed teams. Regardless, Pinsir functions as an effective wallbreaker or sweeper, supporting top-tier Pokemon like Charizard very well in the metagame.</p> ",
    "comments": "<h1>Other Options</h1> <p>Pinsir can drop Bind for more offensive flexibility, but this makes it more of a momentum sink, forcing Pinsir to manually switch out against slower Pokemon if threatened with paralysis or heavy damage. Ergo, many teams have to use a deliberate game plan centered around strictly late-game usage for these sets to work. However, sets like Swords Dance / Hyper Beam / Body Slam / Submission provide Pinsir with alternative midground options once successfully switched in, more effectively contesting common switch-ins like Golem and Charizard.</p> <p>In terms of niche move choices, Pinsir has few that are justifiable because of its terrible movepool. Toxic is feasible for incapacitating Fire Spin users as they switch in, such as Charizard, Ninetales, and Moltres, but Body Slam is normally enough of a deterrent. However, it does come with the added bonus of piling chip damage on Rock-types when used alongside Bind. Seismic Toss is all Pinsir can muster for the very rare Gastly, but Bind can at least secure a safe pivot, and Seismic Toss is rarely helpful.</p> <h1>Checks and Counters</h1> <p><strong>Fire-types: All Fire-types in RBY NU, with the exception of Flareon, outspeed and mortally threaten Pinsir with Fire Blast and Fire Spin, namely Charizard, Ninetales, Rapidash, Arcanine, Moltres, and the rare Magmar. Even if Pinsir survives a Fire Blast from Rapidash or Magmar, it is still at risk of being burned and instantly fainting. However, if the Fire-types are paralyzed, Pinsir poses a serious threat, as a +2 Hyper Beam will KO any of them if they have taken minor damage prior.</p> <p><strong>Rock-types: If Pinsir lacks Submission, it can hardly scratch Rock-types like Golem and Kabutops, immediately losing momentum and having to pivot with Bind. If it does have Submission, however, Pinsir is capable of dealing massive damage, 2HKOing them at +2.</p> <p><strong>Paralysis: Pinsir needs foe paralysis to outspeed the faster threats of RBY NU and therefore despises taking it itself; ergo, faster paralysis users such as tier-king Mr. MIme, Venomoth, Electrode, and the rare Abra can force Pinsir out after it gets a KO. Clefable, Wigglytuff, and Porygon are also capable of absorbing hits from an unboosted Pinsir and paralyzing it in return. Body Slam is also common on a myriad of Pokemon, most commonly Clefable, Wigglytuff, Kingler, and some Blastoise variants, which can pose further risk. While Pinsir can threaten Clefable and Wigglytuff with Submission, it will take high recoil damage in the process, with the latter costing around a third of its health at +2. While Swords Dance can reapply the paralysis Speed drop on foes to help if Pinsir has been paralyzed, this is unreliable and leaves it open to attack.</p> <p><strong>Counter Users: Pinsir is the sole fully-evolved Pokemon that has no damaging moves that can circumvent Counter. This means that Pokemon such as Charizard, Blastoise, Poliwhirl, Clefable, and Wigglytuff can all pose a mortal risk to Pinsir by existing. This also makes Hyper Beam use somewhat risky, as a Counter user can switch in, stomach the hit, and hit Pinsir with Counter next turn for the KO. Pinsir can use Bind to bring Counter users down to Hyper Beam range and KO them, but this isn't always mathematically probable. Using Swords Dance to bait out an early Counter and KO the following turn is also possible, but very risky, especially against paralysis users Clefable and Wigglytuff. Consequently, Pinsir teams must scout for Counter early into a game.</p> <p><strong>Gastly: While rare, Gastly completely walls Pinsir. To even damage it, Pinsir requires Seismic Toss, which it cannot afford, and the only other attack that has any effect is Bind, which doesn't damage it but allows Pinsir to pivot into a check safely. In turn, Gastly can use Hypnosis uncontested or 4HKO Pinsir with Thunderbolt.</p> ",
    "sets": [
      {
        "name": "Swords Dance + Bind",
        "description": "<p>Swords Dance is Pinsir's claim to fame, allowing it to rapidly chip down teams with Bind before blasting them away with Hyper Beam. Swords Dance also ensures paralysis doesn't immediately ruin Pinsir, allowing it to reapply a foe's paralysis Speed drop and keep the momentum in its favor. For example, against a paralyzed Mr. Mime—a common sight after Mr. Mime have a mirror match—Pinsir can enter and set up, remaining faster despite Thunder Wave, and OHKO Mr. Mime with Hyper Beam the next turn. Pinsir's third moveslot is flexible; Slash provides immediate power for safer revenge killing than Hyper Beam, while the weaker Body Slam makes Pinsir more self-sufficient, spreading paralysis and being boosted by Swords Dance. Body Slam also strongly deters Fire Spin users such as Ninetales and Charizard, which otherwise switch in on Pinsir easily. Finally, Submission OHKOes Porygon and 2HKOes Kabutops and Golem at +2, which Pinsir otherwise struggles to break through, although the steep drop in consistency is a pain for it to deal with.</p> <p>Pinsir functions best late-game when it's not at risk of being paralyzed during its sweep. It's also strongly recommended to paralyze Fire-types like Charizard, Ninetales, and Moltres with teammates like Mr. Mime and Clefable; otherwise, Pinsir is easily revenge killed. Kabutops checks Charizard and can KO it outright while quadruply resisting Fire Spin, and it forms a strong physical attacking core with Pinsir that has decent defensive integrity. If not running Submission, Golem and Kabutops should also be removed, with Water-types like Blastoise being great against the former, as Pinsir has issues breaking through them. Pinsir can find switch-in opportunities against Rest users like Blastoise with Rest giving free turns for Pinsir to set up. Outside of this, Pinsir is a great switch-in to Earthquake from the likes of Pokemon like Nidoking; in this case, it can Speed tie Nidoking and either deal serious damage with Slash or gain momentum with Bind. Pinsir works well with fellow wrappers such as Charizard, sometimes alongside other Fire-types like Ninetales, as Pinsir can threaten Golem with Submission while having a wrapping move itself and a Ground resistance for pivoting.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 231074, "username": "S1nn0hC0nfirm3d"}, {"user_id": 520967, "username": "pac"}, {"user_id": 530877, "username": "Volk"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 236353, "username": "May"}]}
  },
  "Ditto": {
    "overview": "<p>Ditto's only move is Transform, which makes it unique as the only non-Uber Pokemon that can learn it in RBY. Transform allows Ditto to change into the opposing Pokemon, enabling it to use its foe's moves—though with just 5 PP each—and copying all of the defending Pokemon's stats except for HP. However, since Ditto's Speed is rather bad, it usually takes a hit before using Transform, and with that bad HP stat, it may not be able to pull anything off. This relegates Ditto to mostly being a novelty Pokemon.</p> ",
    "sets": [
      {
        "name": "Transformer",
        "description": "<p>Transform is unaffected by accuracy and copies the foe's stat boosts, but unfortunately, Ditto only ends up with 5 PP on each move. However, if it switches out and then back in, Ditto will get 5 more PP of each move. This makes Ditto useful in a situation where a Pokemon is not doing a lot of damage, or it can be brought in for a chance to get off a free Transform, such as when an opponent's Pokemon is asleep or frozen. That's about it for Ditto, though; if you start PP stalling an Amnesia user such as Poliwhirl, you could steal its stat boosts at a point where it has less PP left than Ditto by switching to Ditto as it uses Rest, muscle past it, and sweep. There are lots of extremely circumstantial situations like that, but unfortunately, Ditto is not of a great deal of use generally.</p> <p>Also, it is interesting to note that Ditto keeps its poor native critical hit rate of 9.37% after it uses Transform and that any Attack, Defense, and Special changes due to Transform are ignored because critical hits use a Pokemon's original stats; as a result, this will severely lower Ditto's damage output. For the most part, anything in the RBY NU metagame will beat Ditto. It really can't take a hit with base 48 stats across the board.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 96315, "username": "phoopes"}, {"user_id": 236353, "username": "May"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "Lumari"}]}], "writtenBy": [{"user_id": 19, "username": "Hipmonlee"}]}
  },
  "Flareon": {
    "overview": "<p>With its powerful Fire Blast, enormous Attack stat, and great pivoting move in Fire Spin, Flareon is a destructive powerhouse. Its Attack stat is the highest in the tier, only tied with Kingler and the largely unviable Machamp. It also possesses a superb Special stat, with only Moltres and the rare Magneton beating it out. These stats make Flareon a menacing offensive threat, as well as a fantastic Fire Spin absorber from the numerous dangerous Fire-types of the tier, such as Moltres, Rapidash, and Ninetales. If paired with paralysis support, Flareon is capable of posing a significant threat to opposing teams.</p> <p>However, Flareon suffers from having low HP and Defense stats, struggling to withstand even neutral physical hits such as Kingler’s Body Slam and Kabutops's Slash. To make matters worse, it is the slowest Fire-type in the tier, being outpaced by numerous common threats such as Blastoise, Kabutops, and Nidoking, which need to be paralyzed for Flareon to have an impact. Sustaining paralysis itself cuts into what little Speed Flareon has, leaving it outsped by Clefable and Porygon. Flareon also faces massive competition from other Fire-types: Moltres possesses superior bulk, Charizard has better coverage, and Rapidash sports an amazing Speed stat. Lastly, despite its fantastic Attack stat, Flareon struggles to break through opposing Fire-, Rock-, and Water-types like Moltres, Golem, and Kabutops due to it lacking viable coverage besides Normal-type moves. Flareon is therefore a very rare sight in the metagame and is not recommended for most competitive NU teams.</p> ",
    "sets": [
      {
        "name": "Mixed Fire Spin",
        "description": "<p>Fire Spin racks up chip damage and allows Flareon to pivot to its teammates safely. Fire Blast OHKOes Exeggcute and Pinsir, 2HKOes Fearow, Venomoth, and Raticate, and potentially burns switch-ins like Kabutops and Golem. Hyper Beam is Flareon’s strongest physical attack, KOing Drowzee and Mr. Mime with some prior chip damage. Body Slam makes Flareon more difficult to switch into, spreading paralysis— this also enables Flareon to pivot out safely with Fire Spin.</p> <p>Flareon has a few other options to consider. Toxic cripples wrappers such as Dragonair and Rapidash. Quick Attack enables Flareon to finish off sufficently weakened foes and makes up for its low Speed stat. Tail Whip can discourage its counters from easily switching in, notably reapplying paralysis Speed drops on opposing Pokemon. Flareon appreciates paralysis support from the likes of Clefable and Mr. Mime, which gives it an easier time muscling through opposing Fire-types like Charizard, Ninetales, and Rapidash, as well as Water-types like Poliwhirl and Blastoise. Flareon also enjoys the chip damage other Fire Spin users, like Charizard, Rapidash, and Moltres, deal.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 520967, "username": "pac"}, {"user_id": 236353, "username": "May"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 543866, "username": "5Dots"}]}
  },
  "Porygon": {"sets": [{"name": "Standard"}, {"name": "Conversion"}]},
  "Kabutops": {
    "overview": "<p>Kabutops is a potent offensive Pokemon in RBY NU, featuring both Slash and Swords Dance to supplement its already strong Attack stat. The latter gives Kabutops the feared Swords Dance + Hyper Beam combination, allowing it to force its way through defensive staples like Arcanine and Blastoise, notably outspeeding the latter. With STAB Surf or Hydro Pump to supplement this, similarly to Kingler, Kabutops isn't hindered by Rock-type switch-ins. Unlike Kingler, however, Kabutops exchanges raw power for an excellent typing that leaves it undeterred by moves like Fire Spin, Fire Blast, Hyper Beam, and Explosion, giving it ample switch-in opportunities. This typing also opens the way for defensive sets, giving teams a much-needed backbone against the powerful offensive threats of the tier without squandering its own offensive potential.</p> <p>Unfortunately, Kabutops's typing comes back to bite it against Electric- and Ground-type attacks, which are reasonably common in RBY NU. This leaves it severely threatened by Mr. Mime, Electrode, and Nidoking and even reasonably checked by Earthquake Charizard and Golem. Kabutops's Speed is also just a bit below what would be desirable, letting offensive titan Nidoking outspeed it; this Speed also leaves it easily worn down alongside chip damage from Toxic. Its Special is also below average, worsening its Electric weakness and leaving its own special attacks noticeably weaker than those of its Water-type brethren. Naturally, this gives it fierce competition with other Water-types like Blastoise, Kingler, Seadra, and Poliwhirl.</p> ",
    "sets": [
      {
        "name": "Swords Dance",
        "description": "<p>Swords Dance Kabutops functions as a strong wallbreaker and late-game sweeper, exploiting Rest users in the tier like Blastoise, Arcanine, and Seadra with ease in combination with Hyper Beam. Its +2 Hyper Beam is very strong, OHKOing Mr. Mime and Raticate, as well as giving chances to OHKO Dragonair, Venomoth, Fearow, Electrode, Rapidash, and Porygon. Furthermore, +2 Hyper Beam can deal over 65% to Blastoise, one of the most important defensive Pokemon in the tier. If coming in on a predicted Rest, Kabutops is poised to either get a free Swords Dance boost or attack a potential switch-in with Body Slam or Slash. Between the two, Body Slam spreads paralysis while being boosted by Swords Dance, while Slash reduces reliance on Swords Dance but isn't boosted by it. Surf OHKOes Golem, 2HKOes Nidoking, and 3HKOes the rare Gastly, ensuring that foes don't exploit its Normal-type attacks.</p> <p>Kabutops shouldn't use Swords Dance immediately; it's best to score damage from Body Slam or Slash first and only use Swords Dance to close out the game, or if breaking through a wall is imperative at the time. Despite being a Swords Dance user, Kabutops can be useful throughout the game primarily thanks to its typing, as it exploits early-game Fire Spin from Pokemon like Charizard, Rapidash, Moltres, and Ninetales well. It often forces these Pokemon out, especially if they lack Toxic or Earthquake, which they need to hope to make progress against it. It's worth noting that Kabutops isn't too afraid of being burned, as Swords Dance boosts negate the Attack drop and Slash outright ignores them thanks to RBY critical hit mechanics; this resilience, coupled with its typing, makes it one of the best blockades against teams featuring multiple Fire-types. However, the passive damage does leave Kabutops easily worn down, especially because its mediocre Speed makes it susceptible to Fire Spin users.</p> <p>Outside of the given moves, Kabutops can be diversified a bit. Blizzard deals only a bit less damage than Surf but covers Exeggcute and Fearow, the former of which can sometimes be an obstacle to a sweep. However, losing super effective coverage for Fire-types and worsening the damage on Golem often makes it a less-than-stellar option. Submission is plausible coverage for Clefable, Wigglytuff, Porygon, and Raticate, but without recovery, the recoil damage often leaves Kabutops easily worn down. Conversion Porygon notably walls Kabutops if it lacks Submission, so the move can be justified on teams weak to it. Hydro Pump gives Kabutops a shot at 2HKOing Moltres and has higher damage across the board, but this utility rarely merits the accuracy drop.</p> <p>Swords Dance Kabutops fits best on teams that need a wallbreaker but can't afford the loss in defensive integrity that other users like Kingler, Pinsir, and Sandslash may cause. Fellow Water-type Pokemon like Blastoise, Seadra, and Poliwhirl appreciate the openings Kabutops can bring by removing opposing Water-types, making them very strong partners. Pinsir also appreciates the openings Kabutops can present while resisting Earthquake, giving the two strong offensive synergy. Nidoking makes a fine partner, switching in on Toxic, Thunder Wave, and Thunderbolt for free while not losing momentum, all moves that mortally threaten Kabutops.</p> "
      },
      {
        "name": "Rest",
        "description": "<p>Rest Kabutops gets the most mileage out of its nearly unique defensive typing, making it the strongest anti-Fire Spin Pokemon. Any combination of Slash, Body Slam, and Submission fills its physical attacking moveslots, with each giving it various perks; Slash gives the set much better offensive potential, Body Slam gives ample opportunity to spread paralysis thanks to Rest, and Submission lets Kabutops 2HKO Porygon, ensuring it isn't walled. Slash is particularly notable for this set, as it 3HKOes defensive behemoth Blastoise over a third of the time, forcing it to try and Rest stall or switch out. Surf provides the coverage to OHKO Golem and 2HKO Nidoking and Sandslash, all of which otherwise threaten Rest Kabutops.</p> <p>This variant sees more liberal use throughout the game than Swords Dance Kabutops, as Rest means it can heal off any damage accrued through sources like Fire Spin, Toxic, and switching in on resisted attacks. Furthermore, this set isn't opposed to taking paralysis, as it can often use Rest and successfully wake up multiple times a game. This resilience, especially given the abundance of Fire-type Pokemon and Normal-type attacks in RBY NU, makes it more of a defensive pivot for some teams. If running Body Slam, it should be used frequently, as its high paralysis chance makes switching into Kabutops very difficult; if it paralyzes a switch-in, Kabutops will frequently win the interaction outright.</p> <p>Rest Kabutops works best on teams that lack a defensive backbone, especially thriving against opposing Kabutops and teams spamming Fire-types. Ergo, it can work well alongside Venomoth, a Pokemon normally countered by lead Fire-types such as Charizard and Ninetales. Moltres also appreciates the presence of Rest Kabutops, providing pivoting potential and defensive synergy in return given its Ground immunity and high Special. Nidoking is a strong offensive partner, as it can switch in on Electric-type attacks and Toxic while threatening most of the tier with its own super effective damage thereafter.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 520967, "username": "pac"}, {"user_id": 233818, "username": "Enigami"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 236353, "username": "May"}]}
  },
  "Moltres": {"sets": [{"name": "Rest"}, {"name": "Agility"}]},
  "Dragonair": {"sets": [{"name": "Agility + Wrap"}]}
}