{
  "Raichu": {"sets": [{"name": "Offensive"}]},
  "Sandslash": {"sets": [{"name": "Swords Dance"}]},
  "Persian": {
    "overview": "<p>Persian profits immensely from the Substitute mechanics in Stadium OU, which give it a degree of safety against the threat of Thunder Wave. With the strongest Slash in the game in addition to special coverage in Bubble Beam and Thunderbolt, Persian is well-equipped for dealing with Pokemon like weakened Tauros, Cloyster, Rhydon, and Reflect Chansey. Persian is also extremely fast, outrunning Tauros and boasting a 19% critical hit rate, giving it strong revenge killing utility and notable volatility. Because of this, when paired with Tauros, Persian forms a strong Normal-type attacking core that can be difficult for teams to stop.</p> <p>However, Persian should never be used over Tauros—only alongside it—and for good reason: its power is simply inferior. While Slash itself is very strong, Persian itself isn't, making it still struggle against bulkier Pokemon like Snorlax. Persian's special coverage deals middling damage to most targets, meaning it is very reliant on Slash; Tauros possesses Earthquake and Blizzard, allowing it to muscle past Gengar and Exeggutor, respectively. In fact, seeing Gengar in Team Preview often makes Persian dead weight for a majority of the game, forcing its teammates to remove it before it can make any progress. Like many fast Pokemon in the tier, Persian is ruined by paralysis as well, leading to it being forced out if it can't KO Thunder Wave users before they paralyze it. Paralysis also exposes its awful fragilty: critical hits from tier staples like Tauros, Alakazam, and Rhydon can outright OHKO it. Persian also competes with Kangaskhan as a \"second Tauros\", the latter possessing 101 HP Substitutes and superior bulk to better contest Chansey and Snorlax, as well as Earthquake to fight Gengar. However, Persian's Speed and Slash access give it much better qualities as a revenge killer, providing it with a strong niche in the metagame.</p> ",
    "sets": [
      {
        "name": "Substitute Attacker",
        "description": "<p>Slash is Persian's main outlet for damage, having a 99% critical hit rate to effectively ignore Reflect; it also 2HKOes Alakazam, preventing it from using Substitute if it's already used it once. Bubble Beam allows Persian to 2HKO Rhydon, which otherwise counters it. Common switch-ins to Bubble Beam—such as Alakazam and Starmie—can also have their Speed dropped switching in, which can potentially let Persian threaten them head-on. Thunderbolt lets Persian attempt to 3HKO Cloyster and Slowbro, the latter of which is also particularly vulnerable to critical hits if it tries to set up Amnesia. However, it should be noted that Thunderbolt deals less damage to Starmie than Slash without a critical hit. Finally, Substitute can be used against resting Pokemon like Exeggutor and Slowbro for free, guarding against status and poising Persian to get serious damage in. It can similarly be used against paralyzed Alakazam, Chansey, or Starmie to fish for full paralysis—especially on predicted Recover uses—foes which Persian can muscle past from there.</p> <p>Persian performs best as an expendable mid-game revenge killer, but thanks to Substitute, it can also be a successful late-game cleaner. Once a Pokemon is forced to use Recover, use Rest, or otherwise end up in KO range, Persian can usually come in and profit immensely so long as its checks have been removed. Late-game Persian also has a minor advantage against Substitute Tauros, which put themselves into Slash 2HKO range when using it, so there is value in holding it back to the point where a Tauros mirror would otherwise be appropriate. In terms of other moveset options, Body Slam can be used to let Persian scout while spreading paralysis, though giving up either Bubble Beam or Thunderbolt is often necessary, making Persian more easily checked. Thunder can be used instead of Thunderbolt for a guaranteed 2HKO on Cloyster, as well as dealing more damage to Starmie than Slash, but its consistency gives Persian its own trouble. While Hyper Beam can be used to squeeze 2HKOs on Chansey and Starmie alongside Slash, the forced recharge makes it a far cry from regular RBY and thus generally not recommended.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 509438, "username": "Ctown6"}, {"user_id": 431020, "username": "Oiseau Bleu"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 236353, "username": "Plague von Karma"}]}
  },
  "Alakazam": {"sets": [{"name": "Standard"}]},
  "Victreebel": {"sets": [{"name": "Swords Dance + Wrap"}]},
  "Golem": {"sets": [{"name": "Explosion"}]},
  "Slowbro": {"sets": [{"name": "TobyBro"}]},
  "Cloyster": {"sets": [{"name": "Physical Wall"}]},
  "Gengar": {"sets": [{"name": "Standard"}]},
  "Hypno": {"sets": [{"name": "Counter"}]},
  "Kingler": {"sets": [{"name": "Swords Dance"}]},
  "Exeggutor": {"sets": [{"name": "Rest"}]},
  "Rhydon": {"sets": [{"name": "Substitute"}]},
  "Chansey": {"sets": [{"name": "Reflect"}, {"name": "BoltBeam"}, {"name": "Substitute"}]},
  "Kangaskhan": {"sets": [{"name": "Substitute Attacker"}]},
  "Starmie": {"sets": [{"name": "Standard"}]},
  "Jynx": {"sets": [{"name": "Lovely Kiss"}]},
  "Tauros": {"sets": [{"name": "Standard"}]},
  "Lapras": {"sets": [{"name": "Confuse Ray"}]},
  "Jolteon": {"sets": [{"name": "Standard"}, {"name": "Focus Energy"}]},
  "Flareon": {"sets": [{"name": "Focus Energy"}]},
  "Porygon": {"sets": [{"name": "Physical Wall"}]},
  "Kabutops": {"sets": [{"name": "Rest"}]},
  "Snorlax": {"sets": [{"name": "Reflect"}, {"name": "Amnesia"}]},
  "Articuno": {"sets": [{"name": "Special Attacker"}]},
  "Zapdos": {"sets": [{"name": "Mixed Attacker"}]},
  "Moltres": {"sets": [{"name": "AgiliSpin"}]},
  "Dragonite": {"sets": [{"name": "AgiliWrap"}]}
}