{
  "Persian": {"sets": [{"name": "Slash"}]},
  "Alakazam": {"sets": [{"name": "Standard"}]},
  "Victreebel": {"sets": [{"name": "Wrap"}]},
  "Golem": {"sets": [{"name": "Explosion"}]},
  "Slowbro": {
    "overview": "<p>In a time where Mewtwo ravaged the RBY Ubers landscape and players desperately searched for a good check to it, Slowbro came to answer the call. Slowbro's Amnesia set, known as \"TobyBro\" and first created by Wintermute in the early 2000s, is the best check to non-Thunderbolt Mewtwo in the tier while being a very strong Pokemon in its own right. Amnesia, along with a great typing and excellent bulk, gives Slowbro immense sweeping potential. A boosted Surf is capable of OHKOing or 2HKOing almost everything in the tier, and even resistant foes are 3HKOed. Amnesia also helps Slowbro patch up its Electric weakness, since Special is used for both offense and defense. Slowbro can even use Thunder Wave to fix its miserable Speed, and it can also reapply the foe's Speed drops from paralysis by using Amnesia.</p> <p>However, Slowbro will take very heavy damage from a critical hit Thunderbolt regardless of boosts, forcing it to use Rest earlier, and many Electric-type Pokemon have very high critical hit rates courtesy of their high Speed. Slowbro's abysmal Speed, while mitigated by Thunder Wave, can give it trouble as it tries to boost against faster threats while also necessitating some amount of paralysis support from teammates. Slowbro is also very one-dimensional and predictable; however, it will always be one of the most dangerous sweepers, no matter how much the opponent might know it is coming.</p> ",
    "comments": "<h1>Other Options</h1> <p>Slowbro has the option of forgoing Thunder Wave to run any one of the following options. Withdraw is a very strong option to bolster Slowbro's Defense and allow it to take Explosions, removing a prime option for dealing with it. Withdraw also allows Slowbro to reapply paralysis Speed drops more easily. Its massive 61 PP, combined with Rest, allows Slowbro to PP stall almost any Pokemon it needs to, such as opposing Thunder Wave Slowbro. The Defense boost also lets Slowbro counter Snorlax and Mew, which would otherwise be able to hit Slowbro for decent damage. However, Withdraw Slowbro can be very passive, and teams can take advantage of that with faster threats that Slowbro cannot outspeed without Thunder Wave. Reflect is also an option, as an instant +2 in Defense can be crucial in certain situations, such as Snorlax and Tauros needing instant walling as opposed to permitting multiple turns of setup. However, lower PP, an inability to reapply Speed drops, and an inability to boost past +2 make Reflect less desirable.</p> <p>Slowbro can also run two attacks, Surf and either Ice Beam or Psychic. Ice Beam prevents Exeggutor from checking Slowbro and can freeze Mewtwo, Chansey, and opposing Slowbro. On the other hand, Psychic allows Slowbro to hit Lapras and pressure Mewtwo, Starmie, and Light Screen Chansey with Special drops. However, running two attacks makes Slowbro more reliant on paralysis support from teammates to be able to outspeed and threaten certain Pokemon like Tauros and Mew. Two attacks Slowbro also gets PP stalled by Thunder Wave Slowbro. Toxic is a niche option to win mirrors against Withdraw Slowbro, since using Rest does not reset the bad poison timer. Also, Toxic can allow Slowbro to effectively pressure and even remove Light Screen Chansey, which otherwise walls it.</p> <h1>Checks and Counters</h1> <p><strong>Electric-types: Zapdos, Jolteon, and Electrode all carry Thunderbolt, which can stop Slowbro from setting up easily. All three of these Pokemon also have good critical hit rates, and a critical hit Thunderbolt from any of them will OHKO Slowbro outright. However, none of them can switch into a boosted attack, and all three are devastated by paralysis.</p> <p><strong>Electric-type coverage: Non-Electric types like Starmie, Gengar, and Mewtwo can all run Thunderbolt to pressure Slowbro. All three have good critical hit rates, and a critical Thunderbolt can ruin Slowbro. Chansey can also run Thunderbolt, but it is less common; it also has a mediocre critical hit rate, meaning it struggles to pressure Slowbro after it has set up.</p> <p><strong>Water-resistant Pokemon: Exeggutor and Lapras avoid the 2HKO from +6 Surf and can put Slowbro to sleep with Sleep Powder and Sing, respectively. Lapras also carries Thunderbolt and can deal heavy damage with a critical hit. However, +6 Ice Beam OHKOes Exeggutor, while +2 Ice Beam 2HKOes it, and +4 Psychic 2HKOes Lapras, meaning you must scout for these moves before using these Pokemon to check Slowbro. In a similar vein, Victreebel and Cloyster avoid the OHKO from +6 Surf and can remove Slowbro with Wrap + Razor Leaf or Clamp + Explosion, respectively. However, a single miss of their partial trapping moves can spell doom for either.</p> <p><strong>Light Screen Chansey: Slowbro cannot 3HKO Chansey after Light Screen with +6 Surf, and it will eventually PP stall Slowbro. However, Slowbro can win the interaction if it gets lucky with a few paralysis turns. Slowbro carrying Toxic also does not fear Light Screen Chansey.</p> <p><strong>Slowbro</strong>: Depending on the set, Slowbro can be checked by its other sets. Thunder Wave beats two attacks sets, Withdraw beats any set besides Toxic, and Toxic always beats every other set.</p> ",
    "sets": [
      {
        "name": "TobyBro (Amnesia)",
        "description": "<h1>Set Description</h1> <p>Surf is very strong after a few Amnesia boosts, achieving things like a high chance to 2HKO Chansey at +6 and 2HKOs on Mew, Mewtwo, and Snorlax at +4. Amnesia is what makes this set threatening, letting Slowbro become very bulky and very powerful. Thunder Wave allows Slowbro to patch up its awful Speed and more effectively threaten faster Pokemon. This is amplified by the threat of Amnesia reapplying paralysis Speed drops. Slowbro can also use paralysis to have a chance at beating its checks, like Light Screen Chansey and Starmie. Rest allows Slowbro to stick around for much longer and ensures that a single critical hit cannot end its sweep. It also protects Slowbro from chip damage, which is likely to accumulate while switching in and boosting with Amnesia. However, a sleeping Slowbro is very easy to take advantage of, and many opponents will use it as a chance to switch in their Explosion user or Thunderbolt Mewtwo.</p> <p>When using Slowbro, it is very important to scout your opponent's team for Electric-type coverage, especially Thunderbolt on Chansey or Mewtwo. However, Chansey very rarely uses Thunderbolt in Ubers, meaning it is usually safe to set up against. Slowbro is very good at setting up against and paralyzing Mewtwo, as it takes very little damage from Mewtwo's attacks even after it has boosted, unless Mewtwo reveals Thunderbolt or gets a critical hit. Either can force Slowbro to repeatedly use Rest and allow Mewtwo to win the interaction with some luck. Slowbro itself is a very good paralysis absorber, since its pitiful Speed means it is not affected much by it. Amnesia reapplying paralysis Speed drops means even a paralyzed Slowbro can outspeed most foes after a few uses of the move. The most common way to remove Slowbro is with Explosion, so users such as Snorlax, Golem, Mew, Exeggutor, and Gengar should be watched carefully. Slowbro should be used with a good absorber of the move, such as Jynx, Rhydon, or your own Golem or Gengar. Absorbing Explosion with these Pokemon requires good prediction on when the foe is about to use the move to switch them in at the right time. Predicting wrong can result in Slowbro getting KOed or the opponent gaining momentum. Alternatively, you can choose to not reveal your Slowbro until later in the game, after the rest of your team has already dealt with opposing Explosion users.</p> <p>Slowbro especially appreciates Rhydon and Golem as Explosion absorbers, since they are immune to the Electric-type moves that give Slowbro so much trouble. However, Rhydon and Slowbro are both very slow, so using them together requires extra care. If your chosen strategy is to deal with Explosion users before revealing Slowbro, other Pokemon that attract the move such as Chansey, Mew, and Mewtwo can be used. Slowbro can struggle to beat certain checks such as Exeggutor and Lapras, so Pokemon that can deal with them, such as BoltBeam Chansey, are appreciated.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 394051, "username": "Caetano93"}, {"user_id": 431020, "username": "Oiseau Bleu"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}, {"user_id": 33374, "username": "Muk"}]}], "writtenBy": [{"user_id": 473639, "username": "LTG"}]}
  },
  "Cloyster": {"sets": [{"name": "Clamp"}]},
  "Gengar": {"sets": [{"name": "Sleeper"}]},
  "Hypno": {"sets": [{"name": "Sleeper"}]},
  "Electrode": {"sets": [{"name": "Explosion"}]},
  "Exeggutor": {"sets": [{"name": "Sleeper"}]},
  "Rhydon": {"sets": [{"name": "Standard"}]},
  "Chansey": {"sets": [{"name": "Light Screen"}, {"name": "Sing"}]},
  "Starmie": {"sets": [{"name": "Special Attacker"}]},
  "Jynx": {
    "overview": "<p>Jynx is a good sleeper in the RBY Ubers metagame, able to immediately pressure opposing teams with the fastest Lovely Kiss in the game. It has very powerful STAB moves in Blizzard and Psychic that give it good coverage to hit Rhydon, Exeggutor, and Zapdos for good damage while pressuring Chansey with Special drops. Jynx has decent Speed and a decent Special stat to back up its Lovely Kiss and strong STAB moves. Being an Ice-type even allows it to pivot into and wall Ice Beam Chansey, Mewtwo, and Slowbro before they set up with Amnesia.</p> <p>However, Jynx has very low Defense, taking heavy damage from most physical attacks. It is slower than several notable Pokemon such as Tauros, Gengar, Zapdos, and Mew. Jynx can also end up as setup bait for Slowbro, Mew, and the dangerous Mewtwo after it has put something to sleep and gotten its freeze, requiring very careful use after landing both statuses. Overall, Jynx finds its role as a strong sleep- and freeze-inducing lead with good matchups against standard Psychic-type leads.</p> ",
    "comments": "<h1>Other Options</h1> <p>Jynx’s last moveslot has a few options available to it. One option is Ice Beam, which has more PP and therefore more opportunities to freeze than Blizzard alone. Another option is Seismic Toss, which allows Jynx to pressure threats it wouldn't otherwise be able to deal with, like Slowbro and Mewtwo after Amnesia. Body Slam can spread paralysis, but its inconsistency and Jynx's very low Attack stat make this mostly not worth it. Mimic is a gimmick that can give Jynx useful moves such as Recover, Thunder Wave, and Amnesia but is very matchup- and luck-based. Jynx has the option of dropping Psychic to run two other moves and potentially catch something off guard at the cost of not being able to pressure Chansey. An interesting option is running 7 DVs in Defense to OHKO Tauros with Counter after getting hit by Body Slam. However, this significantly hurts Jynx, as it already somewhat lacks longevity, and it can also be useless if the opponent is careful and uses Earthquake.</p> <h1>Checks and Counters</h1> <p><strong>Slowbro: Slowbro sets up on Jynx, takes minimal damage from Psychic and Blizzard, can heal Seismic Toss damage, and doesn’t care about Body Slam paralysis. However, it does fear a freeze. A Slowbro that is asleep from Rest can be chipped by Seismic Toss into the range of a teammate’s Explosion. Keep in mind that Slowbro with only Ice Beam must be at +6 to even 3HKO Jynx.</p> <p><strong>Starmie</strong>: While less common, Starmie always walls Jynx's coverage and heals the little damage it may take. It can also effectively absorb Jynx's Lovely Kiss and use Thunder Wave to cripple Jynx. However, too many Psychic Special drops can force it out.</p> <p><strong>Gengar</strong>: Gengar is a very common lead, is faster than Jynx, and carries Hypnosis. It can also use Explosion to OHKO Jynx, which can put Jynx's team at a big disadvantage if there is no backup sleeper. However, Hypnosis's chance to miss means Gengar should fear possibly being put to sleep itself or taking big damage from Psychic.</p> <p><strong>Paralysis</strong>: Pokemon that can use Thunder Wave such as Mew, Jolteon, and Alakazam can severely cripple Jynx, as it has very little use without the option of a fast Lovely Kiss.</p> <p><strong>Chansey: Chansey takes minimal damage from any of Jynx's moves and forces it out with Seismic Toss. It can also put Jynx to sleep with Sing or paralyze it with Thunder Wave. However, Jynx can freeze Chansey or drop its Special, forcing it out. Also, if Ice Beam is Chansey's only attacking move, Jynx can wall it and use Rest to heal damage.</p> <p><strong>Mewtwo</strong>: Mewtwo sets up on Jynx as long as it does not get frozen. Mewtwo can also use Thunder Wave to cripple Jynx. However, Jynx has a chance to beat Mewtwo if it gets fully paralyzed for a few turns before it sets up, or if Jynx lands some critical hits.</p> <p><strong>Tauros</strong>: Lead Tauros versus lead Jynx is a gamble for both sides. Tauros is able to fish for Body Slam paralysis, a critical hit Body Slam that OHKOes 66% of the time, or Stomp flinches. On the other hand, if Tauros fails to get any of those, Jynx can try to put it to sleep, use Counter, or use Blizzard for heavy damage. However, Tauros can also use Earthquake on the first turn to avoid Counter and guarantee a KO with Hyper Beam on the next turn. Also, Tauros is able to come in later in the game and finish off a weakened Jynx with little issues.</p> ",
    "sets": [
      {
        "name": "Sleep Lead",
        "description": "<h1>Set Description</h1> <p>Lovely Kiss is Jynx's best move, allowing it to likely disable one of the opponent's Pokemon for most of the game. Blizzard and Psychic hit the majority of the tier for solid damage. Psychic also has a chance to lower the foe's Special, helping Jynx deal a little bit more damage with subsequent attacks. Counter allows Jynx to fire off massive damage after taking a Normal-type move, usually Body Slam from Tauros, Snorlax, or Mew. However, it is very prediction reliant, as all three run Earthquake and can use it to avoid damage from Counter. Rest helps Jynx stall Chansey, eliminating an obstacle for your own Mewtwo, as well as increasing Jynx's overall longevity. One must be aware that many physical attackers and setup sweepers can take advantage of a sleeping Jynx, so Rest must be used carefully.</p> <p>Jynx sometimes gets an early-game freeze before it can try to freeze Mewtwo, so Light Screen Chansey is a premier teammate, as it provides one of the tier’s best checks to Mewtwo. Light Screen allows Chansey to avoid the 3HKO from Mewtwo's Psychic and paralyze it with Thunder Wave. Another good option is Flash Chansey to PP stall opposing Mewtwo if Jynx is running Rest. Jynx is great both with and against Explosion. Teammates with Explosion such as Gengar, Mew, and Exeggutor, or Snorlax with Self-Destruct, appreciate Jynx chipping the opposing team into their range. Also, Jynx should be used to take Explosion or as sleep fodder after it has inflicted its status effects to prevent Mewtwo and Slowbro from using it as setup fodder.</p> <p>Teammates that can check Mew are very helpful, as Mew can come in against Jynx and set up for free with Swords Dance, especially if Jynx has used Rest. The best check to Mew is Mew itself; Transform Mew is a very solid counter to opposing Swords Dance Mew, as it can easily turn the opponent's strategy against them. Gengar is another good teammate that completely counters mono-Body Slam Mew. Rhydon and Golem are other good checks to mono-Normal Mew and can support Jynx by absorbing other Normal- and Electric-type attacks, both of which can be problematic for it. Rhydon is stronger and bulkier than Golem and can help pressure the opposing team more immediately. However, both Jynx and Rhydon are somewhat slow for the Ubers metagame, and Amnesia users can use them as setup fodder. Golem, while weaker and frailer than Rhydon, is slightly faster and has Explosion as a one-time nuke, which can take out almost anything on the opposing team and applies immense constant pressure.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 394051, "username": "Caetano93"}, {"user_id": 505149, "username": "Sevi 7"}]}, {"name": "Grammar checked by", "members": [{"user_id": 262594, "username": "Milak"}, {"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 473639, "username": "LTG"}]}
  },
  "Tauros": {"sets": [{"name": "Standard"}]},
  "Lapras": {"sets": [{"name": "Special Attacker"}]},
  "Jolteon": {"sets": [{"name": "Paralysis Lead"}]},
  "Snorlax": {"sets": [{"name": "Physical Attacker"}, {"name": "Reflect"}]},
  "Articuno": {
    "overview": "<p>Articuno’s Blizzard is the strongest attack in RBY that is not Explosion or Hyper Beam. It can even outdamage Mewtwo’s mighty Psychic against neutral targets if both are unboosted. Articuno specializes in tearing huge holes in opposing teams, achieving things like 3HKOs on Mew and Snorlax, 2HKOs on Tauros, Exeggutor, and Zapdos, and clean OHKOs on Rhydon and Golem. Blizzard is very easy to spam, as even resistant Pokemon usually take noticeable damage. The move also comes with a nice chance to freeze and disable a foe for the rest of the game. Articuno also is decently bulky and can take a few strong attacks. For example, Tauros's Body Slam usually takes less than a quarter of its health, assuming it does not get a critical hit.</p> <p>However, Articuno's movepool is abysmal, with almost exclusively Ice- and Normal-type moves to choose from. The latter come off of its mediocre Attack stat, leaving it unable to deal with certain bulky Pokemon like Cloyster and Starmie. Articuno is also rather slow, requiring paralysis support or an Agility in order to function effectively against faster Pokemon. Articuno's low Speed also prevents it from functioning as a good lead, as it is outsped by common leads like Gengar, Jynx, and Starmie. These weaknesses can make Articuno hard to fit on teams at times. Still, Articuno's devastating Blizzard will reward you handsomely for the compensation it needs.</p> ",
    "comments": "<h1>Other Options</h1> <p>Articuno’s barren movepool leaves it with very few other options to choose from. Sky Attack is a decent option, being Articuno’s only Flying-type STAB move and very powerful in its own right. It can be used over Articuno’s Normal-type coverage, dealing huge damage to Chansey and more damage to Mewtwo. However, its two-turn nature makes it less reliable and harder to use than other moves, and Blizzard does more damage to Mewtwo over two turns. Another option is Ice Beam to save precious Blizzard PP in certain situations. Alongside Rest, it can be used to fish for a freeze, with about an 85% chance to get one with all of its PP used. However, Ice Beam Articuno is completely walled by Jynx and Chansey, since it must drop its Normal-type coverage.</p> <p>Articuno can also utilize Reflect, alongside Rest, to become a good tank that easily staves off hits from Tauros, Mew, and Snorlax. Reflect Articuno's main goal is to freeze a foe, so it should run Ice Beam to maximize that chance. If Articuno uses Reflect, it will likely forgo Agility. This means that, while not completely ruined by paralysis, Reflect Articuno is threatened more by it, since it is forced to use Rest and switch out to negate the Speed drop.</p> <h1>Checks and Counters</h1> <p><strong>Ice-resistant Pokemon: Cloyster completely walls Articuno, since it is 4x resistant to Ice, can't be frozen, and has huge Defense to make Hyper Beam deal next to no damage. Similarly, Lapras takes almost zero damage from Blizzard, can't be frozen, and threatens Articuno with Thunderbolt; however, it must watch out for Hyper Beam if it's at low health. Slowbro can easily set up Amnesia on Articuno but fears a stray freeze or critical hits from Blizzard. Starmie can hit Articuno hard with Thunderbolt and heal from Blizzard damage with Recover, but it too must be wary of a freeze.</p> <p><strong>Chansey: While Chansey must be somewhat healthy to switch in on Articuno carrying Hyper Beam, it takes relatively little damage from Blizzard and can scare Articuno away with Thunderbolt or Thunder Wave + Seismic Toss. However, Chansey must be cautious to not be frozen in the process. Although rare, Articuno can use Sky Attack on a predicted switch to do massive damage the next turn; however, Chansey will likely just heal the damage off.</p> <p><strong>Jolteon and Zapdos</strong>: Jolteon outspeeds Articuno and will almost always 2HKO with Thunderbolt. Articuno also barely misses the 2HKO with Blizzard, meaning it needs a critical hit or a freeze to win one-on-one. Zapdos, albeit weak to Ice, outspeeds Articuno and threatens to 2HKO it with Thunderbolt while narrowly surviving one Blizzard. Jolteon and Zapdos can also paralyze an Agility-boosted Articuno with Thunder Wave to negate its Speed boost.</p> <p><strong>Mewtwo</strong>: None of Articuno’s attacks hit Mewtwo very hard after it has used Amnesia, except a critical hit Blizzard, and Mewtwo has Recover to heal off any damage it does take. Even unorthodox Mewtwo sets can take at least two Blizzards, allowing Mewtwo to use Thunder Wave on Articuno followed by heavy-hitting moves like Psychic, Thunderbolt, and Self-Destruct.</p> <p><strong>Explosion</strong>: Mew, Gengar, and Snorlax, among others, can finish off a weakened Articuno with their powerful Explosions even after Articuno has set up with Agility. However, an Articuno using Reflect does not fear them.</p> ",
    "sets": [
      {
        "name": "Bulky Attacker",
        "description": "<h1>Set Description</h1> <p>Blizzard will hit most everything harder than any other move in the game can, so Articuno will use it the most by far. Hyper Beam gives Articuno better odds to defeat Chansey, as Blizzard + Hyper Beam deals a minimum of 59% of damage to it, while also dealing massive damage to Jynx. Double-Edge can be used if Articuno wants to avoid Hyper Beam recharge mind games, but the recoil damage can easily put it into KO range of other threats. Rest allows Articuno to stick around for much longer and fire off more Blizzards. Agility lets Articuno outspeed the entire unboosted metagame and ignore the Speed drop from paralysis. It also makes Articuno less reliant on team paralysis support.</p> <p>Articuno is best used early-game to rip holes into the opposing team with the sheer power of Blizzard, as even Water-types are afraid of switching into Blizzard because of its freeze chance. Switch Articuno in against weaker attacks, such as Chansey's attacks bar Thunderbolt, or on a predicted Earthquake from opposing Mew, Snorlax, or Tauros. It can also switch in against Earthquake from Rhydon or Golem, but it must be very careful, as Rock Slide from either can OHKO Articuno. However, if it manages to come in on their Earthquakes, Articuno will either OHKO them or force them out and do massive damage to something else. Articuno can also be used to absorb paralysis, since it can use Rest later to heal itself or use Agility to negate the Speed drop. Once Articuno is on the field, it should use Blizzard as often as it can and do as much damage to opposing teams as possible.</p> <p>Articuno greatly appreciates paralysis support from teammates such as Exeggutor, Mew, and Zapdos. This allows it to be less reliant on Agility, letting it start doing damage faster and more consistently. However, one must be careful when using Thunder Wave, as a Water-type switching into it becomes immune to freeze, meaning Articuno cannot threaten it at all. Tauros can capitalize on holes Articuno makes in the opponent’s team while supporting it by dealing with opposing Chansey, Starmie, and Jynx. It can also spread paralysis with Body Slam to assist Articuno. Articuno appreciates teammates that can deal with Slowbro, which it is helpless against most of the time. Zapdos, Jolteon, and Thunderbolt Mewtwo can use critical Thunderbolts to bypass Amnesia boosts and do huge damage to Slowbro, while Cloyster, Starmie, Lapras, and Light Screen Chansey wall Slowbro even after it has gained boosts. Light Screen Chansey can also check Amnesia Mewtwo, which Articuno struggles to damage after it has set up. Teams with Articuno tend to be weak to Electric-types, so a check to them like Rhydon, Golem, or Jolteon is appreciated.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 394051, "username": "Caetano93"}, {"user_id": 441093, "username": "64 Squares"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}, {"user_id": 33374, "username": "Muk"}]}], "writtenBy": [{"user_id": 473639, "username": "LTG"}]}
  },
  "Zapdos": {"sets": [{"name": "Agility"}, {"name": "Reflect"}]},
  "Dragonite": {"sets": [{"name": "Agility + Wrap"}]},
  "Mewtwo": {
    "overview": "<p>Feast your eyes on the most destructive Pokemon in any tier in history. Not one stat Mewtwo has can be called bad or even average, including the highest Special in the game and a tie with Aerodactyl and Jolteon for second-highest Speed. It's not just an offensive juggernaut: Mewtwo's bulk is absolutely titanic, stomaching even blows from the mighty Snorlax and Tauros. Its Psychic typing comes into this as well, giving it effectively no type-based weaknesses to exploit. Because of these qualities, taking Mewtwo down often requires a concentrated effort from multiple Pokemon. As if that wasn't enough, it has a plethora of fantastic moves, such as Amnesia, Recover, STAB Psychic, Self-Destruct, and more. If given even a single turn of breathing room, Mewtwo can immediately take over a game. There is no true way to defeat Mewtwo head-on other than sending in your own, statusing it, or getting plain lucky. Thus, many RBY Ubers games are decided by a Mewtwo mirror match. Mewtwo was designed to be the world's strongest Pokemon, and Game Freak certainly succeeded: Mewtwo has zero inarguable flaws and is an automatic pick on any RBY Ubers team that aims to win.</p> <p>Mewtwo's only arguable flaws stem from it being quite literally too powerful for a Game Boy to process. A maximum DV and EV Mewtwo can end up overflowing its Special if it's boosted to +4 or higher and subsequently sustains a Special drop, minimizing its Special and leaving it effortless to KO. Similarly, Mewtwo's Speed gives it a very high critical hit rate—25.39%—which, combined with the fact that critical hits ignore the attacker's offensive boosts, means that +3 or higher Mewtwo will sometimes deal less damage than expected. Finally, while Mewtwo is incredible, it will always have some check it has trouble beating outside of brute force, as it often only has two moveslots available after Amnesia and Recover. However, brute force remains a fine option in a tight spot because Mewtwo is an utter juggernaut.</p> ",
    "comments": "<h1>Other Options</h1> <p>To prevent Mewtwo's Special from overflowing, 8 EVs and 13 DVs in Special can make the stat 341 on any given Mewtwo set, which amounts to 1023 at +4, albeit capped at 999 in practice. This is known as the \"SafeTwo\" spread, pioneered by Enigami. Doing this, however, severely cuts into Mewtwo's bulk, making critical hits from special attacks deal noticeably higher damage. Thus, using this spread depends on whether your Mewtwo set aims for short-term reward or maximum mileage throughout a game.</p> <p>If a move is good in RBY, there is a good chance that Mewtwo learns it. Customizing Mewtwo usually consists of patching up offensive holes in a team while ensuring it doesn't leave itself open to its checks; in other words, without compromising its power level or making it more situational. Generally, Mewtwo's only free moveslot is one of its two attacking ones, as Amnesia and Recover are pivotal to its success.</p> <p>Rest is an interesting choice over Recover, especially on Barrier + Amnesia sets, which generally aim to last as long as possible, as it stalls for three turns at the cost of 1 PP, effectively amounting to 48 PP. It also comes with erasing the Speed drop from paralysis when switching out, though this can make Mewtwo somewhat difficult to wake up later if it hasn't woken up prior to switching; this is because Mewtwo regularly attracts self-KO move users like Snorlax and Golem, which it can't contest when asleep. Even worse, Swords Dance Mew can often set up and break through Mewtwo right away if not chipped or paralyzed, so it's recommended to incapacitate it with a teammate first. Rest also notably removes Mewtwo's paralysis, and paralysis arguably helps with PP stalling more, as it ensures it doesn't remain passive for extended periods of time.</p> <p>Mewtwo can potentially make use of the strong elemental attacks of RBY—Fire Blast, Blizzard, and Thunder—but they come with significant PP issues. Mewtwo mirrors often result in both losing a very large amount of PP, and putting your own at such a deficit right away frequently results in a loss. Additionally, each comes with its own disadvantage from a status perspective: Fire Blast's burn chance means it can thaw frozen Pokemon, while Blizzard and Thunder have less overall chance to inflict status because of their lower PP. Because Mewtwo often needs the superior status chances, the increased damage output is often just not worth it. This is to say nothing of the accuracy issues, which decrease the consistency of the one Pokemon that you can't afford to be inconsistent. However, the increased damage still leaves them situationally acceptable on teams able to PP stall Mewtwo without using their own Mewtwo; for example, +2 Blizzard or Fire Blast can OHKO Exeggutor, and an unboosted Thunder KOes Cloyster with even minor chip damage.</p> <p>Mewtwo's Attack is very usable, which makes Body Slam and Hyper Beam seem enticing. Body Slam can allow Mewtwo to spread paralysis while dealing physical damage, but compared to everything else Mewtwo can dish out, it's generally unimpressive. Hyper Beam is particularly interesting, as Mewtwo can then KO Chansey from a minimum of 44.6%. Against Mewtwo, a critical hit deals slightly more damage than Self-Destruct. Thus, it can be used as a substitute for BooM2 sets to try and get opposing Mewtwo in range for a critical hit or regular Hyper Beam instead of Self-Destruct. However, against any non-Psychic resistant Pokemon, including Chansey, the damage dealt is almost the same as +4 Psychic. Further, Psychic comes with the bonuses of not requiring a recharge, Special drops to further increase damage, and more attacking PP. Ergo, the only non-opposing Mewtwo reason to use Hyper Beam is for a better Light Screen Chansey matchup, which, while common, isn't omnipresent. If you're looking for a physical option, Submission is often the superior choice for hitting Chansey harder than Hyper Beam and having a significant PP advantage for Mewtwo.</p> <p>Mewtwo has fantastic physical bulk, making Counter appear viable. However, Counter is often best placed on Chansey, a Pokemon with higher potential damage that often draws physical attackers like Snorlax in more consistently. Mewtwo has little opportunity to use the attack, as it's often faced with opposing Mewtwo or Chansey before it even gets the chance to use it. Ergo, should these matchups come down to PP stalling, there is a very high chance that Counter will be revealed by force, ruining the gimmick entirely.</p> <p>BooM2 sets can arguably run Seismic Toss to make KOing opposing Mewtwo with Self-Destruct easier, making it a much more effective lure. However, fitting this into the set is extremely difficult and worsens its matchups against essentially anything other than Mewtwo, which it can't often afford. It's also possible to drop Amnesia entirely on these types of sets to add more coverage options or secure a slot for Recover, but this has seen little success.</p> <h1>Checks and Counters</h1> <p><strong>Mewtwo: Mewtwo is arguably the best check to itself. The combination of Amnesia and Recover means your standard Amnesia set has a lot of trouble breaking through, requiring three critical hits in a row with Thunderbolt or Ice Beam to get the KO. Using Self-Destruct is one way to attempt to break through an opposing Mewtwo, but this requires sacrificing your own, and even then you only OHKO with a critical hit. This means even using Self-Destruct requires you to have the team support and setup necessary to finish Mewtwo off. Another option is having enough PP to successfully stall Mewtwo out; Submission is a great way to accomplish this, thanks to the 48 PP it offers. However, it oftentimes simply comes down to which Mewtwo will be frozen first, as getting a freeze often leaves nothing left to handle a boosted Mewtwo.</p> <p><strong>Freezing</strong>: Thanks to freeze being the virtual equivalent of a KO, freezing Mewtwo is often the best way to deal with it. Common Pokemon like Jynx, Starmie, Slowbro, and Chansey run Ice Beam or Blizzard, which both carry a 10.1% freeze chance. Additionally, these Pokemon are typically able to take a hit from even a boosted Mewtwo, meaning every turn spent against them carries a degree of risk. Managing to freeze the opponent's Mewtwo is a way to gain massive momentum, freeing up your own Mewtwo or Slowbro to wreak havoc with their biggest check out of the way.</p> <p><strong>Light Screen Chansey: As a testament to just how powerful Mewtwo is, the phenomenal special wall Chansey must run Light Screen to truly be a check. However, it's one of the most consistent Mewtwo checks in the game. A Mewtwo boosted to the 999 cap only possesses a 17.4% chance to 4HKO with Psychic through Light Screen. With Ice Beam and Thunderbolt, it's only a possible 6HKO. Chansey is one of the most consistent methods of overflowing a +6 Mewtwo's Special as well, using Psychic's Special drop chance and subsequently forcing a switch. Additionally, Chansey often has a significant PP advantage. This means Chansey can wall Mewtwo and force it to burn precious PP while healing off the damage it deals. However, even Chansey isn't safe. Psychic's 33.2% Special drop can degrade Light Screen and make Chansey much more vulnerable, making it arguably a temporary solution. Submission also 2HKOes it 86.7% of the time, making for a great anti-Chansey measure. Chansey is also a magnet for freeze attempts, which can be either a sigh of relief for your own Mewtwo or a catastrophic situation depending on your team's defensive integrity and Mewtwo set.</p> <p><strong>Mew</strong>: Mew has some interesting tricks that can allow it to check, set up on, or otherwise handle Mewtwo. With paralysis support and Swords Dance, it can set up to +4 Attack and then 2HKO with Earthquake while virtually never being 3HKOed in return by 999 Special Ice Beam or Thunderbolt. At +6, Mew is capable of OHKOing Mewtwo with Hyper Beam. Alternatively, some Mew variants simply opt to use Swords Dance and then Explosion to erase Mewtwo from the battle without any doubt. Defensively, Mew can use Transform to copy Mewtwo's stats and moves. Transform leaves Mew vulnerable for a turn, but the player gains crucial information about the opposing Mewtwo's set, walls it completely, and gains 5 PP for each move it holds. This 5 PP resets each time Mew uses Transform, meaning it is able to PP stall the opposing Mewtwo. It's not like Transform Mew only has the opposing Mewtwo's attacks either, as it can run other options to cripple it prior. These include Thunder Wave, Explosion to take a big chunk out of its health, Reflect to increase defensive integrity while transformed, and Soft-Boiled to stay healthy. Unless Mewtwo lands multiple critical hits or inflicts status, Mew is able to come in and check it somewhat consistently. However, Mew is far from an ironclad Mewtwo check; without paralysis support, Mewtwo is able to muscle through Mew on most occasions through brute force, as well as often ruining it completely with an untimely freeze.</p> <p><strong>PP Stall</strong>: Stalling Mewtwo out of PP is another way to deal with it, usually attempted with your own Mewtwo or Light Screen Chansey. Once it runs out of attacking PP, it's little more than a status absorber. However, accomplishing this is much easier said than done. With its monstrous Special, critical hit rate, and coverage, PP stall can sometimes be in vain, as crucial team members can fall to a freeze or massive damage. If Mewtwo lacks Thunderbolt, Slowbro is able to stand in its way, stalling PP while setting up its own brutal sweep. Thanks to its own Amnesia and Rest, Slowbro has a good chance to win one-on-one as well.</p> <p><strong>Paralysis</strong>: Paralyzing Mewtwo can open opportunities for powerful Pokemon such as Snorlax, Tauros, Mew, Golem, and Rhydon. Getting in on a paralyzed Mewtwo and being able to fire off big hits or threaten Explosion or Self-Destruct often forces it out. However, paralyzing Mewtwo can actually benefit it, as it can now no longer be frozen or put to sleep, and skipping turns with paralysis lets Mewtwo PP stall more effectively. Generally, Mewtwo despises being paralyzed early on, as it loses momentum against Mew, Snorlax, and Mewtwo specifically tailored to break through opposing Mewtwo. However, later on, when Mew and Snorlax have likely been taken out, Mewtwo tends to appreciate paralysis more. If you have the tools on your team to take advantage of a paralyzed Mewtwo early on, then it is absolutely worth it, as finding a way to break the opposing Mewtwo without risking your own is a key way to win consistently in RBY Ubers.</p> <p><strong>Slowbro: Slowbro is a fairly notorious check to non-Thunderbolt Mewtwo, being able to set up freely or even PP stall it if all goes well. The only risk to Slowbro in this scenario is a freeze from Ice Beam, which can be somewhat made up for with Rest preventing further status. Slowbro can also muscle past non-Thunderbolt Mewtwo through Thunder Wave and +6 Surf, which will eventually 4HKO a +6 Mewtwo and deal mortal damage otherwise. However, if Mewtwo has Thunderbolt, Slowbro will be 3HKOed even at +6 if Mewtwo is also at +6.</p> <p><strong>Self-KO Moves</strong>: The sheer power of Self-Destruct and Explosion makes them common methods of dispatching Mewtwo, primarily because it's often the highest-value Pokemon on its team and normally the most threatening. These strategies are at their most potent when Mewtwo is paralyzed, as it ends up becoming slower than the strongest users of self-KO moves in the game, namely Snorlax and Golem. While not even a STAB Self-Destruct from Snorlax will OHKO Mewtwo, it will often leave it in a position to be revenge killed by Pokemon like Tauros. Snorlax can also use Body Slam and then Self-Destruct, which is a guaranteed KO. Self-Destruct Mewtwo sets are often expressly made to trade against opposing Mewtwo too, and it's often paired with deadly sweepers like Slowbro, which become significantly more threatening with Mewtwo off the table. While their Explosions are quite weak, Gengar and Electrode also tend to Explode against Mewtwo, coming very close to OHKOing it on a critical hit.</p> ",
    "sets": [
      {
        "name": "Standard",
        "description": "<h1>Set Description</h1> <p>Mewtwo's defining set makes full use of the incredible Amnesia. With its astronomical Special, Amnesia leaves it almost impossible to switch into until it's scouted and just as hard to KO with special moves. A Mewtwo boosted up to the maximum of 999 Special can only fall to three or more critical hit special attacks. This tremendous bulk and Recover allow Mewtwo to stay healthy while hammering away. However, after these two mandatory moves, Mewtwo's coverage is impressive and has multiple viable options, making it a multifaceted threat able to plow through just about everything. The coverage options you choose will largely decide what your Mewtwo's primary role is.</p> <p>Mewtwo's STAB Psychic is one of the scariest no-drawback moves in the game. A 33.2% chance to drop Special as an added bonus can allow Mewtwo to muscle through something like Light Screen Chansey. The Special drops can also be used to reapply the Speed drop from paralysis, allowing paralyzed Mewtwo to outspeed an opposing paralyzed Mewtwo or incapacitate it for something else to handle; because of this, a paralyzed Mewtwo isn't out of the game just yet. Finally, Psychic has a significant benefit in causing an opposing +4 Mewtwo's Special to overflow if it doesn't have a \"SafeTwo\" stat spread, which consists of 13 DVs and 8 EVs in Special to ensure it starts at 341. Unfortunately, with the bevy of Psychic-types in Ubers, Mewtwo's targets are often resistant and thus take Psychic decently before striking back. Common examples include Exeggutor, Slowbro, Mew, and opposing Mewtwo.</p> <p>Slotting in Thunderbolt gives Mewtwo some unique coverage possibilities while bringing its PP up to 104. Mewtwo is now able to easily beat Slowbro; if both boost to the 999 cap, Mewtwo still 3HKOes with Thunderbolt, and that's to say nothing of its 25.39% chance to OHKO with a critical hit. Thunderbolt also gives Mewtwo access to paralysis. While the odds are slim, this can help Mewtwo and teammates immensely against opposing Mewtwo and Chansey. You're statistically likely to get at least one instance of paralysis from Thunderbolt's full PP, so it's fair to fish for it. On the downside, using it in the third moveslot means Mewtwo lets Exeggutor in for free, as it's only 3HKOed by a 999 Special Psychic from full HP; it can then use this opportunity to spread status or use Explosion. You also lose out on the potential to freeze by forgoing Ice Beam, which can really hurt against Chansey, Mew, and opposing Mewtwo. Also, paralyzed Mewtwo can inadvertently allow Rhydon a free switch should it use Thunderbolt or Recover, which puts it in a very difficult spot, as Rhydon can fish for Substitute on full paralysis and 3HKO with Earthquake from there.</p> <p>Ice Beam slots in nicely alongside Psychic, and the biggest reason is the 10.1% freeze chance. While the coverage is nice to help deal with Exeggutor, Ice Beam's primary draw is to freeze opposing Mewtwo, or less ideally, one of its major checks, like Chansey. This can open up the entire game and oftentimes win it outright. However, Slowbro is able to soak up this set's hits and use Amnesia, Thunder Wave, and Rest to have a good chance to beat Mewtwo head-on. Additionally, while Starmie doesn't pose much of a threat offensively, it can also paralyze Mewtwo or attempt to freeze it; it can take at least one hit from a Mewtwo with this coverage boosted up to 999. Opponents must be careful though, as +4 Psychic will 2HKO Starmie. Another drawback to this set is the mere 96 total PP, which can often become crucial when battling against other Mewtwo and trying to break down Chansey. This makes freezing the wrong Pokemon possibly quite deadly, as opposing Mewtwo tend to win from there through PP stall. When using Psychic + Ice Beam, it's best to avoid paralyzing the opposing Mewtwo in favor of winning by PP stall or freezing it.</p> <p>Even without a STAB option, Mewtwo still threatens the entire metagame with BoltBeam coverage. Instead of using its STAB Psychic, it can combine the coverage and benefits of Ice Beam and Thunderbolt while reaching 104 PP. While lacking Psychic means it no longer KOes the powerful and Self-Destruct-using Snorlax after some chip damage, the coverage allows Mewtwo to deal with almost everything else. It gains the advantage against both Slowbro and Exeggutor while bearing a 10.1% freeze chance for opposing Mewtwo, Mew, or Chansey. Since it handles almost the entire metagame besides these three Pokemon and Snorlax, it can blow the game wide open by freezing one of them. One drawback to this set is that, if your opponent has both Chansey and Mewtwo active, it will only be able to take out one while being walled by the other because of relying on a freeze. However, you can use Thunderbolt to attempt paralysis, meaning Mewtwo isn't completely shut down and can still help its team against these threats. Boosted up to 999, Mewtwo is able to OHKO Slowbro, Exeggutor, Tauros, and Starmie to name a few, making this combination a Swiss Army knife that is very difficult to deal with.</p> <p>A unique option that Mewtwo can run is Submission. First, Submission holds a whopping 48 PP, bringing the total to 128 if using Ice Beam, or 136 if using Thunderbolt. This lets Mewtwo win PP wars against opposing Mewtwo consistently while having the advantage against Chansey. One must be careful of getting frozen though. Submission destroys Light Screen Chansey, one of Mewtwo's most common adversaries, without risking PP stall. Submission Mewtwo has an 86.7% chance to 2HKO, and with its high critical hit ratio it has a decent chance to OHKO. The primary drawback of this set is only running one special coverage option. Running Thunderbolt is the most common, as this allows Mewtwo to beat all of its most common checks, these being Chansey via Submission, Slowbro via Thunderbolt, and opposing Mewtwo via PP stall. However, this set struggles against Exeggutor and Rhydon, often allowing Explosion or status from the former and giving a free switch in to the latter. Ice Beam can be chosen over Thunderbolt to alleviate this, making the set weak to Slowbro but gaining the advantage against Exeggutor and Rhydon. Having a freeze chance is never bad either. Psychic, on the other hand, should not be chosen here; alongside Submission, it simply leaves Mewtwo vulnerable against too many common Psychic-types.</p> "
      },
      {
        "name": "BooM2 (Self-Destruct)",
        "description": "<h1>Set Description</h1> <p>By bluffing the standard set with Amnesia and your chosen coverage option, this Mewtwo can lure in the opposing Mewtwo, occasionally paralyze it with Thunder Wave, and then use Self-Destruct after some chip damage. Self-Destruct also comes with the bonus of beating set-up Slowbro, which is otherwise a common check to the set.</p> <p>Self-Destruct will KO opposing Mewtwo from 52.2% minimum, which means two uses of +2 Thunderbolt will set it up. It's recommended to run Thunderbolt, as well as paralysis support, to make it harder for the opposing Mewtwo to heal its way out of Self-Destruct range with Recover. Other options tend to only make this set worse, as matching up worse against Slowbro usually forces Mewtwo to use Self-Destruct. The normally ubiquitous Recover can be dropped for Thunder Wave, which guarantees that Mewtwo can use Self-Destruct before the opposing one can heal out of KO range. Naturally, this also means Mewtwo itself should avoid getting paralyzed whenever possible, or it becomes very difficult to succeed.</p> <p>This set carries inherent risks, as Self-Destruct is naturally inconsistent: it being absorbed by Gengar or Rhydon can be a game loss, and less common Mewtwo sets using Flash or even Barrier match up extremely well against it. However, it remains viable for the sheer reward the trade can provide. If supported by Seismic Toss Chansey, the set can be more consistent at securing trades, as two uses of Seismic Toss can also put opposing Mewtwo in KO range.</p> "
      },
      {
        "name": "Staller",
        "description": "<h1>Set Description</h1> <p>Mewtwo can focus on stalling, which can be approached in two ways: Flash or Barrier. While they play differently in practice, the aim is very similar, that being stonewalling opposing Mewtwo. Because of the long-term role of these sets, the \"SafeTwo\" Special stat is highly recommended; the given spread gives Mewtwo a Special stat of 341, which ensures that it hits 1023 Special at +4, meaning that a Special drop does not trigger an overflow. Mewtwo's attacking option on this type of set largely depends on the rest of the team, and it only has one, so care should be taken. Thunderbolt hits Mew and Slowbro while giving Mewtwo the best PP advantage; however, Rhydon becomes extremely threatening, especially if running Flash. Alternatively, Ice Beam lets Mewtwo muscle past Exeggutor and Rhydon, as well as providing the option of freezing the opposing Mewtwo, possibly cutting off the Flash interaction early. STAB Psychic can serve as a generic option on Barrier sets, being the strongest attack Mewtwo has and also giving it the best shot of beating Snorlax before it paralyzes with Body Slam or uses Self-Destruct.</p> <p>The Flash approach aims to gain the most advantage in the Mewtwo mirror match without making a trade, so it should be kept in waiting until that opportunity arises. It works most effectively against Ice Beam Mewtwo, as Flash can decrease the opposing Mewtwo's chance of freezing your own while also giving a PP advantage against all standard sets, totaling to 112 PP with Psychic or Ice Beam, or 120 if running Thunderbolt. This forces the opponent to either switch out and risk losing a Pokemon or stay in and inevitably lose if enough accuracy drops set in. Attacking the opposing Mewtwo is generally unnecessary; stalling its attacking PP is all you need, leaving yourself with a fully boosted Mewtwo to wreak havoc thereafter. This set isn't wholly opposed to being paralyzed—skipping turns is arguably beneficial once the accuracy drops have piled on, though paralysis does drastically decrease its consistency prior to that.</p> <p>The combination of Barrier and Amnesia can be used instead to turn Mewtwo into a sweeper that also has a large PP advantage against opposing Mewtwo, which can be 112 PP with Recover added on, not factoring in offensive options. This alone is enough to PP stall any standard Mewtwo set, allowing you to end up with a fully boosted Mewtwo by the time they run out. It is strongly recommended to get this Mewtwo paralyzed as soon as possible, as this further improves its PP stalling capabilities and ensures it cannot get frozen later. With the assistance of Barrier, exploding on Mewtwo becomes an impossibility without something like Swords Dance + Explosion Mew, which forces the opposing team to PP stall it themselves. Even the mighty Snorlax, with the strongest physical move in STAB Self-Destruct, rarely hits for even a quarter of +6 Barrier Mewtwo's health. This set works especially well against Self-Destruct Mewtwo sets, as they cannot afford a PP war and lose the ability to KO it from half HP due to the Defense boost. While still vulnerable to critical hits, Mewtwo is very difficult to KO after boosting both Defense and Special, often surviving for astonishing periods of time.</p> <p>The main drawback to stall-centric Mewtwo sets is that they often require some momentum to function; Flash usually takes multiple hits to begin making your own Mewtwo difficult to hit, and Barrier sets add more turns of setup time. Ergo, any unfortunate luck during these sequences is often devastating, and making your own Mewtwo less consistent must be for good reason. Additionally, because of the aforementioned lack of coverage and specialized nature, stall-centric Mewtwo sets often end up being weaker to Pokemon other than opposing Mewtwo. Depending on the offensive option of choice, Mewtwo can become weak to any of Chansey, Exeggutor, Slowbro, and Transform Mew. Slowbro is the most notable if not running Thunderbolt, being able to accumulate a sizable PP advantage through Rest while having high enough damage output to muscle past with repeated full paralysis. If running Thunderbolt, though, Light Screen Chansey becomes a big threat if not paralyzed, possessing a PP advantage and enough bulk to shrug off what Mewtwo throws at it. Regardless of offensive option and Mewtwo's sheer power, though, Barrier Mewtwo often has limited attacking PP to punish switch stalling, which is worsened when paralyzed. Ergo, teams using this set should make up for its shortcomings. Explosion Mew, Golem, and Self-Destruct Snorlax make fine choices, often making it easier to break through Chansey and Slowbro. Zapdos or Jolteon can also be effective—especially the latter, which tends to have a more consistent Chansey matchup and has a high critical hit rate to break through Slowbro. Slowbro is also an excellent partner, profiting greatly from a Thunderbolt Mewtwo being incapacitated to set up and sweep later.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 431020, "username": "Oiseau Bleu"}, {"user_id": 233818, "username": "Enigami"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}, {"user_id": 331519, "username": "CryoGyro"}]}], "writtenBy": [{"user_id": 236353, "username": "May"}, {"user_id": 509438, "username": "Ctown6"}]}
  },
  "Mew": {
    "overview": "<p>Mew is recommended to feature on all of your RBY Ubers teams and is one of only two Uber Pokemon—Pokemon banned from standard first generation play dating back to the earliest Nintendo sponsored tournaments. The mythical Pokemon may learn every TM, but it is uncommon in high-level play to see it without Swords Dance. Mew is the tier's premier physical sweeper; its base 100 stats all around let it outspeed Jynx and Speed tie with Zapdos, have an unboosted Attack stat equivalent to Tauros, and have bulk rivaling Snorlax's. Additionally, Soft-Boiled can capitalize on Mew's impressive bulk and Reflect can enhance it, which also makes Mew one of the top physical walls in the tier; conversely, it can sacrifice itself with Explosion to hopefully take another high-value Pokemon down with it. As a Special sweeper, it is outclassed by its clone, Mewtwo, which has Amnesia and a far superior Special stat, as well as by Amnesia Slowbro. Also, Mew's wallbreaking tool, STAB Psychic, is weaker than Alakazam's and Exeggutor's Psychics due to their higher Special stats.</p> ",
    "comments": "<h1>Other Options</h1> <p>Mega Kick and Double-Edge are single-turn attacks more powerful than Body Slam, but, in addition to their respective poor accuracy and recoil, they lack Body Slam's paralysis chance. Ice Beam or Blizzard used with Reflect threatens to freeze opposing Mew, and both inflict more damage onto Exeggutor, Golem, Rhydon, and Zapdos before Swords Dance boosts, but both force Mew to give up offensive potential.</p> <p>A couple of consecutive Seismic Toss used without reply can get paralyzed Mew not behind Reflect in Explosion's KO range.</p> <h1>Checks and Counters</h1> <p><strong>Status: Since Mew has to set up before inflicting heavy damage, even Pokemon with somewhat weak defenses can paralyze it with Thunder Wave before switching out the following turn. Like any Pokemon, Mew doesn't appreciate the sleep status either.</p> <p><strong>Opposing Mew</strong>: Any Mew set with both Reflect and Soft-Boiled is a good Mew answer. Thunder Wave paralyzes Mew, and Swords Dance combined with Explosion can take both Mew out of the picture. Swords Dance-boosted attacks also attempt to KO the other Mew.</p> <p><strong>Gengar</strong>: Mew without Earthquake generally lacks the means to deal any damage to Gengar, usually firing off a Thunder Wave at most.</p> <p><strong>Snorlax</strong>: Reflect Snorlax is particularly effective against Mew lacking Earthquake, as +6 Body Slam is only a 4HKO against Snorlax behind Reflect. Snorlax can use Rest to recover health and is immune to Body Slam paralysis. It can paralyze Mew with its own Body Slam, though, and can deal at least 74% damage with Self-Destruct—assuming Mew doesn't have Reflect's boost.</p> <p><strong>Rhydon and Golem</strong>: Both Rhydon and Golem can exploit Mew lacking Earthquake. Rhydon's Substitutes aren't broken by even a +6 Body Slam most of the time. In return, Rhydon is extremely likely to 3HKO with Earthquake, assuming Mew doesn't have Reflect up. Golem lacks the same power and bulk as Rhydon but can threaten with a 64% or more damage Explosion. Explosion's usage can be predictable though, and Golem finds Reflect Mew extremely tough to break down. Rhydon manages to dismantle Body Slam variants with Leer or stall with Substitute and Rest.</p> <p><strong>Articuno</strong>: Although considered to have low viability, Articuno makes for a solid check to the typical Mew; it is immune to Earthquake, and unboosted Body Slam from Mew isn't even a guaranteed 6HKO. Blizzard 3HKOes Mew in return. Articuno can also run Reflect; unlike Snorlax, it isn't immune to Body Slam paralysis, though.</p> <p><strong>Cloyster</strong>: Cloyster functions similarly to Articuno, except for it not being immune to Earthquake. It notably suffers from a less-powerful Blizzard but instead has an improved Defense stat.</p> <p><strong>Zapdos</strong>: Mew is only a match for Reflect Zapdos when fully boosted. In the meantime, Zapdos can deal a minimum of 30% damage with Thunderbolt, forcing Mew to recover, while threatening possible critical hits. Mew recovering, especially from critical hits, gives extra opportunities for Thunderbolt's 10.2% chance of inflicting paralysis—assuming Mew isn't already paralyzed.</p> <p><strong>Exeggutor</strong>: Exeggutor is resistant to Earthquake and is usually only 6HKOed by Mew's Body Slam without boosts. It threatens Mew out with potential Stun Spore and Sleep Powder. It can also do 58% damage minimum to Mew with Explosion if Reflect is not up.</p> <p><strong>Slowbro</strong>: Slowbro can paralyze Mew with Thunder Wave or set up Reflect or Withdraw with paralysis support. Slowbro's Surf has a small chance of 2HKOing at +2 Special.</p> <p><strong>Tauros</strong>: Tauros, which is faster than Mew when not paralyzed, can take it out with enough critical hits or full paralysis triggerings. Tauros benefits from its immunity to Body Slam paralysis, though the matchup slowly reverses as Swords Dance Mew gains its Attack boosts.</p> <p><strong>Mewtwo</strong>: If necessary, Mewtwo can 2HKO Mew on average at +2 Special. Mew, on the other hand, only 3HKOes at +2 Attack unless it possesses Hyper Beam.</p> ",
    "sets": [
      {
        "name": "Traditional Sweeper",
        "description": "<h1>Set Description</h1> <p>Mew's traditional aim is to set up with Swords Dance, recover from any damage via Soft-Boiled, and then attempt to sweep with its two attacks. Earthquake is generally Mew's most damaging attack, OHKOing Gengar and 2HKOing Golem and Rhydon at +2 Attack. Body Slam hits Zapdos and Exeggutor neutrally, albeit being initially weak; it also aims to paralyze targets including opposing Mew, using paralysis and damage to pressure it to recover or use Explosion. At +6 Attack, Body Slam has guaranteed 2HKOs on every Pokemon that isn't Cloyster, behind Reflect or Defense boosts, or a Rock- or Ghost-type. Hyper Beam provides a more powerful move to finish off targets besides Golem, Rhydon, or Gengar, but additional paralysis support and care to avoid being exploited by Transform Mew are advised. Another downside of Hyper Beam is the risk that +4 or +6 Attack Hyper Beam is weakened by one of Mew's 19.5% likely critical hits, which can cost it the KO and force Mew to recharge. Soft-Boiled is the choice for longevity, but often Explosion can be useful to cancel out an opposing Mew in an advantageous position.</p> "
      },
      {
        "name": "GGMew (Reflect Sweeper)",
        "description": "<h1>Set Description</h1> <p>This set discovered by Golden Gyarados simultaneously performs well against opposing Mew and sets up to sweep. Thanks to Reflect, it can't be KOed by another Mew outside of a +4 Explosion—given no status, enough PP, and consistent recovery. The downside is having to choose between Body Slam or Earthquake; however, when you consider the viable Pokemon in the tier, your opponent will probably have at most two Pokemon that your chosen move cannot hit neutrally or super effectively. Body Slam is the slightly preferred choice due to it hitting Exeggutor and Zapdos, which are collectively considered more viable than Gengar and Rhydon. It also has 8 more PP, and Gengar and Rhydon can be baited into weakening themselves fighting Mew's teammates prior to revealing the set. Earthquake is usually more effective as a counter-team option because, like the traditional sweeper set, opting out of Body Slam for Earthquake means it is best to search for paralysis support. Soft-Boiled is recommended to take advantage of Reflect more.</p> "
      },
      {
        "name": "Explosive Lure",
        "description": "<h1>Set Description</h1> <p>This set exists to nullify an opposing Mew. Once your Mew has landed a Thunder Wave, the opposing Mew is slowed down and vulnerable to full paralysis. Next, boost with Swords Dance so that, on any following turn, Mew is ready to take it down with Explosion. If the opposing Mew uses Reflect, boost your Mew's Attack stat all the way up to +6 if you can in order to guarantee an OHKO with Explosion. Alternatively, you can chip the opposing Mew with Body Slam or Earthquake before delivering a +4 Explosion. With enough paralysis luck, your Mew may be able to KO the opposing Mew and save its Explosion for another Pokemon. Reflect can be used in this set to stall needing to use Explosion, although, since Mew's only attack will be Explosion, it relies on your opponent not playing around it and either giving away a less valuable Pokemon or sending in Gengar, Golem, or Rhydon. This set can also function as an emergency Mewtwo check; it is only 2HKOed by 999 Special Mewtwo, so Mew can reliably paralyze Mewtwo, and it does a minimum of 63% damage with an unboosted Explosion.</p> "
      },
      {
        "name": "Lutrew / PaRaSiTe Mew (Transform)",
        "description": "<h1>Set Description</h1> <p>This set was made specifically to counter traditional Mew, especially the Hyper Beam variant, and greatly departs from the traditional sweeper set. Once in against opposing Mew, use Thunder Wave and Reflect first as it sets up Swords Dance, use Soft-Boiled if needed to stay healthy, and, finally, use Transform. This sequence makes your Mew into the traditional sweeper set with the bonus of Reflect protection and an opposing Mew that can become fully paralyzed. If you make your Mew transform before its target reaches +6, it can use Swords Dance again to both boost itself and lower its target's Speed under paralysis. The Reflect sweeper set, unfortunately, ruins it plans, stalling it out by taking advantage of Transform's 5 PP. This set will also result in a stalemate with fellow Transform Mew, possibly resulting in an endless battle. Worse yet, its lack of offensive threat means the opponent can easily switch to another Pokemon.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 394051, "username": "Caetano93"}, {"user_id": 431020, "username": "Oiseau Bleu"}]}, {"name": "Grammar checked by", "members": [{"user_id": 241023, "username": "Kris"}, {"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 8157, "username": "Lutra"}]}
  }
}