{
  "Persian": {"sets": [{"name": "Slash"}]},
  "Alakazam": {"sets": [{"name": "Standard"}]},
  "Victreebel": {"sets": [{"name": "Wrap"}]},
  "Golem": {"sets": [{"name": "Explosion"}]},
  "Slowbro": {"sets": [{"name": "TobyBro"}]},
  "Cloyster": {"sets": [{"name": "Clamp"}]},
  "Gengar": {"sets": [{"name": "Sleeper"}]},
  "Hypno": {"sets": [{"name": "Sleeper"}]},
  "Electrode": {"sets": [{"name": "Explosion"}]},
  "Exeggutor": {"sets": [{"name": "Sleeper"}]},
  "Rhydon": {"sets": [{"name": "Standard"}]},
  "Chansey": {"sets": [{"name": "Light Screen"}, {"name": "Sing"}]},
  "Starmie": {"sets": [{"name": "Special Attacker"}]},
  "Jynx": {
    "overview": "<p>Jynx is a good sleeper in the RBY Ubers metagame, able to immediately pressure opposing teams with the fastest Lovely Kiss in the game. It has very powerful STAB moves in Blizzard and Psychic that give it good coverage to hit Rhydon, Exeggutor, and Zapdos for good damage while pressuring Chansey with Special drops. Jynx has decent Speed and a decent Special stat to back up its Lovely Kiss and strong STAB moves. Being an Ice-type even allows it to pivot into and wall Ice Beam Chansey, Mewtwo, and Slowbro before they set up with Amnesia.</p> <p>However, Jynx has very low Defense, taking heavy damage from most physical attacks. It is slower than several notable Pokemon such as Tauros, Gengar, Zapdos, and Mew. Jynx can also end up as setup bait for Slowbro, Mew, and the dangerous Mewtwo after it has put something to sleep and gotten its freeze, requiring very careful use after landing both statuses. Overall, Jynx finds its role as a strong sleep- and freeze-inducing lead with good matchups against standard Psychic-type leads.</p> ",
    "comments": "<h1>Other Options</h1> <p>Jynx’s last moveslot has a few options available to it. One option is Ice Beam, which has more PP and therefore more opportunities to freeze than Blizzard alone. Another option is Seismic Toss, which allows Jynx to pressure threats it wouldn't otherwise be able to deal with, like Slowbro and Mewtwo after Amnesia. Body Slam can spread paralysis, but its inconsistency and Jynx's very low Attack stat make this mostly not worth it. Mimic is a gimmick that can give Jynx useful moves such as Recover, Thunder Wave, and Amnesia but is very matchup- and luck-based. Jynx has the option of dropping Psychic to run two other moves and potentially catch something off guard at the cost of not being able to pressure Chansey. An interesting option is running 7 DVs in Defense to OHKO Tauros with Counter after getting hit by Body Slam. However, this significantly hurts Jynx, as it already somewhat lacks longevity, and it can also be useless if the opponent is careful and uses Earthquake.</p> <h1>Checks and Counters</h1> <p><strong>Slowbro: Slowbro sets up on Jynx, takes minimal damage from Psychic and Blizzard, can heal Seismic Toss damage, and doesn’t care about Body Slam paralysis. However, it does fear a freeze. A Slowbro that is asleep from Rest can be chipped by Seismic Toss into the range of a teammate’s Explosion. Keep in mind that Slowbro with only Ice Beam must be at +6 to even 3HKO Jynx.</p> <p><strong>Starmie</strong>: While less common, Starmie always walls Jynx's coverage and heals the little damage it may take. It can also effectively absorb Jynx's Lovely Kiss and use Thunder Wave to cripple Jynx. However, too many Psychic Special drops can force it out.</p> <p><strong>Gengar</strong>: Gengar is a very common lead, is faster than Jynx, and carries Hypnosis. It can also use Explosion to OHKO Jynx, which can put Jynx's team at a big disadvantage if there is no backup sleeper. However, Hypnosis's chance to miss means Gengar should fear possibly being put to sleep itself or taking big damage from Psychic.</p> <p><strong>Paralysis</strong>: Pokemon that can use Thunder Wave such as Mew, Jolteon, and Alakazam can severely cripple Jynx, as it has very little use without the option of a fast Lovely Kiss.</p> <p><strong>Chansey: Chansey takes minimal damage from any of Jynx's moves and forces it out with Seismic Toss. It can also put Jynx to sleep with Sing or paralyze it with Thunder Wave. However, Jynx can freeze Chansey or drop its Special, forcing it out. Also, if Ice Beam is Chansey's only attacking move, Jynx can wall it and use Rest to heal damage.</p> <p><strong>Mewtwo</strong>: Mewtwo sets up on Jynx as long as it does not get frozen. Mewtwo can also use Thunder Wave to cripple Jynx. However, Jynx has a chance to beat Mewtwo if it gets fully paralyzed for a few turns before it sets up, or if Jynx lands some critical hits.</p> <p><strong>Tauros</strong>: Lead Tauros versus lead Jynx is a gamble for both sides. Tauros is able to fish for Body Slam paralysis, a critical hit Body Slam that OHKOes 66% of the time, or Stomp flinches. On the other hand, if Tauros fails to get any of those, Jynx can try to put it to sleep, use Counter, or use Blizzard for heavy damage. However, Tauros can also use Earthquake on the first turn to avoid Counter and guarantee a KO with Hyper Beam on the next turn. Also, Tauros is able to come in later in the game and finish off a weakened Jynx with little issues.</p> ",
    "sets": [
      {
        "name": "Sleep Lead",
        "description": "<h1>Set Description</h1> <p>Lovely Kiss is Jynx's best move, allowing it to likely disable one of the opponent's Pokemon for most of the game. Blizzard and Psychic hit the majority of the tier for solid damage. Psychic also has a chance to lower the foe's Special, helping Jynx deal a little bit more damage with subsequent attacks. Counter allows Jynx to fire off massive damage after taking a Normal-type move, usually Body Slam from Tauros, Snorlax, or Mew. However, it is very prediction reliant, as all three run Earthquake and can use it to avoid damage from Counter. Rest helps Jynx stall Chansey, eliminating an obstacle for your own Mewtwo, as well as increasing Jynx's overall longevity. One must be aware that many physical attackers and setup sweepers can take advantage of a sleeping Jynx, so Rest must be used carefully.</p> <p>Jynx sometimes gets an early-game freeze before it can try to freeze Mewtwo, so Light Screen Chansey is a premier teammate, as it provides one of the tier’s best checks to Mewtwo. Light Screen allows Chansey to avoid the 3HKO from Mewtwo's Psychic and paralyze it with Thunder Wave. Another good option is Flash Chansey to PP stall opposing Mewtwo if Jynx is running Rest. Jynx is great both with and against Explosion. Teammates with Explosion such as Gengar, Mew, and Exeggutor, or Snorlax with Self-Destruct, appreciate Jynx chipping the opposing team into their range. Also, Jynx should be used to take Explosion or as sleep fodder after it has inflicted its status effects to prevent Mewtwo and Slowbro from using it as setup fodder.</p> <p>Teammates that can check Mew are very helpful, as Mew can come in against Jynx and set up for free with Swords Dance, especially if Jynx has used Rest. The best check to Mew is Mew itself; Transform Mew is a very solid counter to opposing Swords Dance Mew, as it can easily turn the opponent's strategy against them. Gengar is another good teammate that completely counters mono-Body Slam Mew. Rhydon and Golem are other good checks to mono-Normal Mew and can support Jynx by absorbing other Normal- and Electric-type attacks, both of which can be problematic for it. Rhydon is stronger and bulkier than Golem and can help pressure the opposing team more immediately. However, both Jynx and Rhydon are somewhat slow for the Ubers metagame, and Amnesia users can use them as setup fodder. Golem, while weaker and frailer than Rhydon, is slightly faster and has Explosion as a one-time nuke, which can take out almost anything on the opposing team and applies immense constant pressure.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 394051, "username": "Caetano93"}, {"user_id": 505149, "username": "Sevi 7"}]}, {"name": "Grammar checked by", "members": [{"user_id": 262594, "username": "Milak"}, {"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 473639, "username": "LTG"}]}
  },
  "Tauros": {"sets": [{"name": "Standard"}]},
  "Lapras": {"sets": [{"name": "Special Attacker"}]},
  "Jolteon": {"sets": [{"name": "Paralysis Lead"}]},
  "Snorlax": {"sets": [{"name": "Physical Attacker"}, {"name": "Reflect"}]},
  "Articuno": {
    "overview": "<p>Articuno’s Blizzard is the strongest attack in RBY that is not Explosion or Hyper Beam. It can even outdamage Mewtwo’s mighty Psychic against neutral targets if both are unboosted. Articuno specializes in tearing huge holes in opposing teams, achieving things like 3HKOs on Mew and Snorlax, 2HKOs on Tauros, Exeggutor, and Zapdos, and clean OHKOs on Rhydon and Golem. Blizzard is very easy to spam, as even resistant Pokemon usually take noticeable damage. The move also comes with a nice chance to freeze and disable a foe for the rest of the game. Articuno also is decently bulky and can take a few strong attacks. For example, Tauros's Body Slam usually takes less than a quarter of its health, assuming it does not get a critical hit.</p> <p>However, Articuno's movepool is abysmal, with almost exclusively Ice- and Normal-type moves to choose from. The latter come off of its mediocre Attack stat, leaving it unable to deal with certain bulky Pokemon like Cloyster and Starmie. Articuno is also rather slow, requiring paralysis support or an Agility in order to function effectively against faster Pokemon. Articuno's low Speed also prevents it from functioning as a good lead, as it is outsped by common leads like Gengar, Jynx, and Starmie. These weaknesses can make Articuno hard to fit on teams at times. Still, Articuno's devastating Blizzard will reward you handsomely for the compensation it needs.</p> ",
    "comments": "<h1>Other Options</h1> <p>Articuno’s barren movepool leaves it with very few other options to choose from. Sky Attack is a decent option, being Articuno’s only Flying-type STAB move and very powerful in its own right. It can be used over Articuno’s Normal-type coverage, dealing huge damage to Chansey and more damage to Mewtwo. However, its two-turn nature makes it less reliable and harder to use than other moves, and Blizzard does more damage to Mewtwo over two turns. Another option is Ice Beam to save precious Blizzard PP in certain situations. Alongside Rest, it can be used to fish for a freeze, with about an 85% chance to get one with all of its PP used. However, Ice Beam Articuno is completely walled by Jynx and Chansey, since it must drop its Normal-type coverage.</p> <p>Articuno can also utilize Reflect, alongside Rest, to become a good tank that easily staves off hits from Tauros, Mew, and Snorlax. Reflect Articuno's main goal is to freeze a foe, so it should run Ice Beam to maximize that chance. If Articuno uses Reflect, it will likely forgo Agility. This means that, while not completely ruined by paralysis, Reflect Articuno is threatened more by it, since it is forced to use Rest to negate the Speed drop.</p> <h1>Checks and Counters</h1> <p><strong>Ice-resistant Pokemon: Cloyster completely walls Articuno, since it is 4x resistant to Ice, can't be frozen, and has huge Defense to make Hyper Beam deal next to no damage. Similarly, Lapras takes almost zero damage from Blizzard, can't be frozen, and threatens Articuno with Thunderbolt; however, it must watch out for Hyper Beam if it's at low health. Slowbro can easily set up Amnesia on Articuno but fears a stray freeze or critical hits from Blizzard. Starmie can hit Articuno hard with Thunderbolt and heal from Blizzard damage with Recover, but it too must be wary of a freeze.</p> <p><strong>Chansey: While Chansey must be somewhat healthy to switch in on Articuno carrying Hyper Beam, it takes relatively little damage from Blizzard and can scare Articuno away with Thunderbolt or Thunder Wave + Seismic Toss. However, Chansey must be cautious to not be frozen in the process. Although rare, Articuno can use Sky Attack on a predicted switch to do massive damage the next turn; however, Chansey will likely just heal the damage off.</p> <p><strong>Jolteon and Zapdos</strong>: Jolteon outspeeds Articuno and will almost always 2HKO with Thunderbolt. Articuno also barely misses the 2HKO with Blizzard, meaning it needs a critical hit or a freeze to win one-on-one. Zapdos, albeit weak to Ice, outspeeds Articuno and threatens to 2HKO it with Thunderbolt while narrowly surviving one Blizzard. Jolteon and Zapdos can also paralyze an Agility-boosted Articuno with Thunder Wave to negate its Speed boost.</p> <p><strong>Mewtwo</strong>: None of Articuno’s attacks hit Mewtwo very hard after it has used Amnesia, except a critical hit Blizzard, and Mewtwo has Recover to heal off any damage it does take. Even unorthodox Mewtwo sets can take at least two Blizzards, allowing Mewtwo to use Thunder Wave on Articuno followed by heavy-hitting moves like Psychic, Thunderbolt, and Self-Destruct.</p> <p><strong>Explosion</strong>: Mew, Gengar, and Snorlax, among others, can finish off a weakened Articuno with their powerful Explosions even after Articuno has set up with Agility. However, an Articuno using Reflect does not fear them.</p> ",
    "sets": [
      {
        "name": "Bulky Attacker",
        "description": "<h1>Set Description</h1> <p>Blizzard will hit most everything harder than any other move in the game can, so Articuno will use it the most by far. Hyper Beam gives Articuno better odds to defeat Chansey, as Blizzard + Hyper Beam deals a minimum of 59% of damage to it, while also dealing massive damage to Jynx. Double-Edge can be used if Articuno wants to avoid Hyper Beam recharge mind games, but the recoil damage can easily put it into KO range of other threats. Rest allows Articuno to stick around for much longer and fire off more Blizzards. Agility lets Articuno outspeed the entire unboosted metagame and ignore the Speed drop from paralysis. It also makes Articuno less reliant on team paralysis support.</p> <p>Articuno is best used early-game to rip holes into the opposing team with the sheer power of Blizzard, as even Water-types are afraid of switching into Blizzard because of its freeze chance. Switch Articuno in against weaker attacks, such as Chansey's attacks bar Thunderbolt, or on a predicted Earthquake from opposing Mew, Snorlax, or Tauros. It can also switch in against Earthquake from Rhydon or Golem, but it must be very careful, as Rock Slide from either can OHKO Articuno. However, if it manages to come in on their Earthquakes, Articuno will either OHKO them or force them out and do massive damage to something else. Articuno can also be used to absorb paralysis, since it can use Rest later to heal itself or use Agility to negate the Speed drop. Once Articuno is on the field, it should use Blizzard as often as it can and do as much damage to opposing teams as possible.</p> <p>Articuno greatly appreciates paralysis support from teammates such as Exeggutor, Mew, and Zapdos. This allows it to be less reliant on Agility, letting it start doing damage faster and more consistently. However, one must be careful when using Thunder Wave, as a Water-type switching into it becomes immune to freeze, meaning Articuno cannot threaten it at all. Tauros can capitalize on holes Articuno makes in the opponent’s team while supporting it by dealing with opposing Chansey, Starmie, and Jynx. It can also spread paralysis with Body Slam to assist Articuno. Articuno appreciates teammates that can deal with Slowbro, which it is helpless against most of the time. Zapdos, Jolteon, and Thunderbolt Mewtwo can use critical Thunderbolts to bypass Amnesia boosts and do huge damage to Slowbro, while Cloyster, Starmie, Lapras, and Light Screen Chansey wall Slowbro even after it has gained boosts. Light Screen Chansey can also check Amnesia Mewtwo, which Articuno struggles to damage after it has set up. Teams with Articuno tend to be weak to Electric-types, so a check to them like Rhydon, Golem, or Jolteon is appreciated.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 394051, "username": "Caetano93"}, {"user_id": 441093, "username": "64 Squares"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}, {"user_id": 33374, "username": "Muk"}]}], "writtenBy": [{"user_id": 473639, "username": "LTG"}]}
  },
  "Zapdos": {"sets": [{"name": "Agility"}, {"name": "Reflect"}]},
  "Dragonite": {"sets": [{"name": "Agility + Wrap"}]},
  "Mewtwo": {
    "overview": "<p>RBY Mewtwo is the single most powerful Pokemon in any generation. Nothing even comes close to the raw destructive power of this thing. That's all there is to be said about the joy that enters the heart of a 6-year-old when they capture the Uber and can truly call themselves a Pokemon Master.</p> ",
    "comments": "<h1>Other Options</h1> <p>Mewtwo does have other options, but most of them aren't worth it. Counter can surprise a Normal-type trying to take advantage of its \"weak\" Defense. Fire Blast is an alternate special attack and can burn quite often. Reflect ups Mewtwo's Defense. Self-Destruct is funny, and should generally go over Recover if you use it.</p> <p>Substitute is decent in link battles, but it's godly in Stadium because it blocks status changes; paired with Recover or Rest, Psychic, and Amnesia, it makes Mewtwo even more unstoppable than it already is. As you are most likely not playing Stadium, and the other options stated here aren't particularly great compared to the movesets above, it's better to stick with those sets, as they'll work, and very well.</p> <h1>Checks and Counters</h1> <p>Nope. Nothing can fully counter a Mewtwo; some can make it think twice, though. Chansey is probably the best counter. Light Screen Chansey, more specifically, can stall it and aim for a freeze. However, Mewtwo has a high critical hit rate and Amnesia on its side. What's more, it could backfire on you; Mewtwo can set up easily against Chansey, and will get to 999 Special after two Amnesia boosts. If it gets past Chansey, you can say goodbye to your whole team. Mewtwo will also be aiming for the freeze on your Chansey with Ice Beam / Blizzard, or just spamming Psychic for a Special fall.</p> <p>The Psychic / Blizzard model is stopped cold, as far as resistances go, by Slowbro, and, to an extent, Starmie, but they can't touch Mewtwo either. Also, watch out for Snorlax with Self-Destruct.</p> <p>If you ever face a Mewtwo, paralyze it at all costs, unless you have a Mewtwo, Slowbro, or Chansey of your own, and want to play dice with their Mewtwo by going for a freeze. This cannot be stressed enough--a Mewtwo that is not paralyzed will tear apart your whole team. You CAN stop a paralyzed one with some luck and one sacrifice if your opponent is stupid enough not to switch out. A fresh Mewtwo will destroy every single one of your Pokemon after setting up, and you won't be able to do anything about it. And, well, if Mewtwo has Rest and your opponent is skilled... good luck.</p> <p>Physical blows are where Mewtwo is most vulnerable (although it's not weak on that side, with defensive capabilities about halfway between Tauros and Slowbro), but with an Amnesia, Mewtwo can devastate all of the physical attackers that it is weak to.</p> ",
    "sets": [
      {
        "name": "Amnesia",
        "description": "<p>Mewtwo is absolutely the most ferocious Pokemon that exists in RBY. Amnesia increases its already ridiculously high Special to incredible extents, allowing Mewtwo to wreak devastation on just about anything. After one or two Amnesia boosts, Mewtwo is set to sweep: Psychic will be its main move and rends almost everything that doesn't resist it to shreds, while Blizzard hits the Psychic-type Pokemon such as Exeggutor that would otherwise have a chance against Mewtwo. Ice Beam is a more reliable option for Mewtwo and is the basic power versus accuracy argument. Blizzard does more damage per turn, factoring in accuracy, but with its low PP, it's not as reliable of a move to go for the freeze against enemy Mewtwo. Thunderbolt is an option over Psychic, as games in which Mewtwo are allowed are centered around countering it, meaning one will see even more Starmie and Slowbro, as they resist Psychic and the Ice-type move. Psychic is still the generally better choice, however. Recover heals Mewtwo quickly, but leaves it open to status such as paralysis; that's where Rest comes in and wipes any status off. Essentially, this Mewtwo set is the most powerful thing in Pokemon history.</p> "
      },
      {"name": "All-Out Attacker", "description": "<p>This set eschews the massive power that Amnesia affords for more versatility. Psychic and Blizzard work the same way as in the previous set. The new additions are Thunderbolt and Submission: Thunderbolt smashes Slowbro and Starmie, which resist both Psychic and Ice-type attacks, while Submission breaks down Chansey.</p> "},
      {"name": "Physical Attacker", "description": "<p>One should not forget that Mewtwo also has a base 110 Attack, which to put into perspective, is identical to that of Snorlax and more than that of Tauros. Submission destroys Normal-type Pokemon and Hyper Beam is a massively powerful attack to use against lower health Pokemon. Psychic is still here for reliability against many Pokemon; wasting Mewtwo's most powerful attack and that magnificent base 154 Special would be a shame.</p> "},
      {"name": "Defensive", "description": "<p>Mewtwo can also be defensive. Barrier patches up Mewtwo's one \"weak\" spot, its base 90 Defense, and makes fainting Mewtwo incredibly difficult outside of a critical hit. Thunder Wave is always helpful to spread paralysis, one of the most powerful conditions in RBY. Recover is an obvious choice to prolong Mewtwo's survival even more.</p> "}
    ]
  },
  "Mew": {
    "overview": "<p>Mew is recommended to feature on all of your RBY Ubers teams and is one of only two Uber Pokemon—Pokemon banned from standard first generation play dating back to the earliest Nintendo sponsored tournaments. The mythical Pokemon may learn every TM, but it is uncommon in high-level play to see it without Swords Dance. Mew is the tier's premier physical sweeper; its base 100 stats all around let it outspeed Jynx and Speed tie with Zapdos, have an unboosted Attack stat equivalent to Tauros, and have bulk rivaling Snorlax's. Additionally, Soft-Boiled can capitalize on Mew's impressive bulk and Reflect can enhance it, which also makes Mew one of the top physical walls in the tier; conversely, it can sacrifice itself with Explosion to hopefully take another high-value Pokemon down with it. As a Special sweeper, it is outclassed by its clone, Mewtwo, which has Amnesia and a far superior Special stat, as well as by Amnesia Slowbro. Also, Mew's wallbreaking tool, STAB Psychic, is weaker than Alakazam's and Exeggutor's Psychics due to their higher Special stats.</p> ",
    "comments": "<h1>Other Options</h1> <p>Mega Kick and Double-Edge are single-turn attacks more powerful than Body Slam, but, in addition to their respective poor accuracy and recoil, they lack Body Slam's paralysis chance. Ice Beam or Blizzard used with Reflect threatens to freeze opposing Mew, and both inflict more damage onto Exeggutor, Golem, Rhydon, and Zapdos before Swords Dance boosts, but both force Mew to give up offensive potential.</p> <p>A couple of consecutive Seismic Toss used without reply can get paralyzed Mew not behind Reflect in Explosion's KO range.</p> <h1>Checks and Counters</h1> <p><strong>Status: Since Mew has to set up before inflicting heavy damage, even Pokemon with somewhat weak defenses can paralyze it with Thunder Wave before switching out the following turn. Like any Pokemon, Mew doesn't appreciate the sleep status either.</p> <p><strong>Opposing Mew</strong>: Any Mew set with both Reflect and Soft-Boiled is a good Mew answer. Thunder Wave paralyzes Mew, and Swords Dance combined with Explosion can take both Mew out of the picture. Swords Dance-boosted attacks also attempt to KO the other Mew.</p> <p><strong>Gengar</strong>: Mew without Earthquake generally lacks the means to deal any damage to Gengar, usually firing off a Thunder Wave at most.</p> <p><strong>Snorlax</strong>: Reflect Snorlax is particularly effective against Mew lacking Earthquake, as +6 Body Slam is only a 4HKO against Snorlax behind Reflect. Snorlax can use Rest to recover health and is immune to Body Slam paralysis. It can paralyze Mew with its own Body Slam, though, and can deal at least 74% damage with Self-Destruct—assuming Mew doesn't have Reflect's boost.</p> <p><strong>Rhydon and Golem</strong>: Both Rhydon and Golem can exploit Mew lacking Earthquake. Rhydon's Substitutes aren't broken by even a +6 Body Slam most of the time. In return, Rhydon is extremely likely to 3HKO with Earthquake, assuming Mew doesn't have Reflect up. Golem lacks the same power and bulk as Rhydon but can threaten with a 64% or more damage Explosion. Explosion's usage can be predictable though, and Golem finds Reflect Mew extremely tough to break down. Rhydon manages to dismantle Body Slam variants with Leer or stall with Substitute and Rest.</p> <p><strong>Articuno</strong>: Although considered to have low viability, Articuno makes for a solid check to the typical Mew; it is immune to Earthquake, and unboosted Body Slam from Mew isn't even a guaranteed 6HKO. Blizzard 3HKOes Mew in return. Articuno can also run Reflect; unlike Snorlax, it isn't immune to Body Slam paralysis, though.</p> <p><strong>Cloyster</strong>: Cloyster functions similarly to Articuno, except for it not being immune to Earthquake. It notably suffers from a less-powerful Blizzard but instead has an improved Defense stat.</p> <p><strong>Zapdos</strong>: Mew is only a match for Reflect Zapdos when fully boosted. In the meantime, Zapdos can deal a minimum of 30% damage with Thunderbolt, forcing Mew to recover, while threatening possible critical hits. Mew recovering, especially from critical hits, gives extra opportunities for Thunderbolt's 10.2% chance of inflicting paralysis—assuming Mew isn't already paralyzed.</p> <p><strong>Exeggutor</strong>: Exeggutor is resistant to Earthquake and is usually only 6HKOed by Mew's Body Slam without boosts. It threatens Mew out with potential Stun Spore and Sleep Powder. It can also do 58% damage minimum to Mew with Explosion if Reflect is not up.</p> <p><strong>Slowbro</strong>: Slowbro can paralyze Mew with Thunder Wave or set up Reflect or Withdraw with paralysis support. Slowbro's Surf has a small chance of 2HKOing at +2 Special.</p> <p><strong>Tauros</strong>: Tauros, which is faster than Mew when not paralyzed, can take it out with enough critical hits or full paralysis triggerings. Tauros benefits from its immunity to Body Slam paralysis, though the matchup slowly reverses as Swords Dance Mew gains its Attack boosts.</p> <p><strong>Mewtwo</strong>: If necessary, Mewtwo can 2HKO Mew on average at +2 Special. Mew, on the other hand, only 3HKOes at +2 Attack unless it possesses Hyper Beam.</p> ",
    "sets": [
      {
        "name": "Traditional Sweeper",
        "description": "<h1>Set Description</h1> <p>Mew's traditional aim is to set up with Swords Dance, recover from any damage via Soft-Boiled, and then attempt to sweep with its two attacks. Earthquake is generally Mew's most damaging attack, OHKOing Gengar and 2HKOing Golem and Rhydon at +2 Attack. Body Slam hits Zapdos and Exeggutor neutrally, albeit being initially weak; it also aims to paralyze targets including opposing Mew, using paralysis and damage to pressure it to recover or use Explosion. At +6 Attack, Body Slam has guaranteed 2HKOs on every Pokemon that isn't Cloyster, behind Reflect or Defense boosts, or a Rock- or Ghost-type. Hyper Beam provides a more powerful move to finish off targets besides Golem, Rhydon, or Gengar, but additional paralysis support and care to avoid being exploited by Transform Mew are advised. Another downside of Hyper Beam is the risk that +4 or +6 Attack Hyper Beam is weakened by one of Mew's 19.5% likely critical hits, which can cost it the KO and force Mew to recharge. Soft-Boiled is the choice for longevity, but often Explosion can be useful to cancel out an opposing Mew in an advantageous position.</p> "
      },
      {
        "name": "GGMew (Reflect Sweeper)",
        "description": "<h1>Set Description</h1> <p>This set discovered by Golden Gyarados simultaneously performs well against opposing Mew and sets up to sweep. Thanks to Reflect, it can't be KOed by another Mew outside of a +4 Explosion—given no status, enough PP, and consistent recovery. The downside is having to choose between Body Slam or Earthquake; however, when you consider the viable Pokemon in the tier, your opponent will probably have at most two Pokemon that your chosen move cannot hit neutrally or super effectively. Body Slam is the slightly preferred choice due to it hitting Exeggutor and Zapdos, which are collectively considered more viable than Gengar and Rhydon. It also has 8 more PP, and Gengar and Rhydon can be baited into weakening themselves fighting Mew's teammates prior to revealing the set. Earthquake is usually more effective as a counter-team option because, like the traditional sweeper set, opting out of Body Slam for Earthquake means it is best to search for paralysis support. Soft-Boiled is recommended to take advantage of Reflect more.</p> "
      },
      {
        "name": "Explosive Lure",
        "description": "<h1>Set Description</h1> <p>This set exists to nullify an opposing Mew. Once your Mew has landed a Thunder Wave, the opposing Mew is slowed down and vulnerable to full paralysis. Next, boost with Swords Dance so that, on any following turn, Mew is ready to take it down with Explosion. If the opposing Mew uses Reflect, boost your Mew's Attack stat all the way up to +6 if you can in order to guarantee an OHKO with Explosion. Alternatively, you can chip the opposing Mew with Body Slam or Earthquake before delivering a +4 Explosion. With enough paralysis luck, your Mew may be able to KO the opposing Mew and save its Explosion for another Pokemon. Reflect can be used in this set to stall needing to use Explosion, although, since Mew's only attack will be Explosion, it relies on your opponent not playing around it and either giving away a less valuable Pokemon or sending in Gengar, Golem, or Rhydon. This set can also function as an emergency Mewtwo check; it is only 2HKOed by 999 Special Mewtwo, so Mew can reliably paralyze Mewtwo, and it does a minimum of 63% damage with an unboosted Explosion.</p> "
      },
      {
        "name": "Lutrew / PaRaSiTe Mew (Transform)",
        "description": "<h1>Set Description</h1> <p>This set was made specifically to counter traditional Mew, especially the Hyper Beam variant, and greatly departs from the traditional sweeper set. Once in against opposing Mew, use Thunder Wave and Reflect first as it sets up Swords Dance, use Soft-Boiled if needed to stay healthy, and, finally, use Transform. This sequence makes your Mew into the traditional sweeper set with the bonus of Reflect protection and an opposing Mew that can become fully paralyzed. If you make your Mew transform before its target reaches +6, it can use Swords Dance again to both boost itself and lower its target's Speed under paralysis. The Reflect sweeper set, unfortunately, ruins it plans, stalling it out by taking advantage of Transform's 5 PP. This set will also result in a stalemate with fellow Transform Mew, possibly resulting in an endless battle. Worse yet, its lack of offensive threat means the opponent can easily switch to another Pokemon.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 394051, "username": "Caetano93"}, {"user_id": 431020, "username": "Oiseau Bleu"}]}, {"name": "Grammar checked by", "members": [{"user_id": 241023, "username": "Kris"}, {"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 8157, "username": "Lutra"}]}
  }
}