{
  "Clefable": {"sets": {"STABmons": {}}},
  "Persian": {"sets": {"STABmons": {}}},
  "Poliwrath": {"sets": {"STABmons": {}}},
  "Alakazam": {"sets": {"STABmons": {}}},
  "Tentacruel": {"sets": {"STABmons": {}}},
  "Golem": {"sets": {"STABmons": {}}},
  "Dodrio": {"sets": {"STABmons": {}}},
  "Cloyster": {"sets": {"STABmons": {}}},
  "Haunter": {
    "overview": "<p>Despite Haunter being inferior to its evolution, Gengar, in every meaningful way, it holds the smallest of niches thanks to their shared Ghost typing. Haunter can switch into Explosion freely and wall attackers that only use Normal-type attacks. Gengar is better at this, but having Haunter as a backup lets players use Gengar more aggressively and bait and punish an Explosion after Gengar faints. However, most of the time teams don't want two Pokemon that perform essentially the same role and vastly prefer just keeping Gengar around. Additionally, Haunter is very underpowered for STABmons; it struggles to deal meaningful damage to the metagame's plethora of Normal- and Psychic-types, leaving it as a gimmick.</p>",
    "sets": {
      "Backup Ghost": {
        "description": "<h4>Set Description</h4> <p>Hypnosis lets Haunter put a foe to sleep, circumventing its mediocre power, particularly against slower foes such as Exeggutor and Kangaskhan. Thunderbolt, coming off Haunter's good Special, can threaten Water- and Flying-types, such as Starmie and Aerodactyl. Night Shade threatens consistent damage against foes, notably 4HKOing Exeggutor. Despite Haunter's low Attack, Explosion is its strongest move against most foes, letting it do around 50% to targets like Tauros and Exeggutor.</p> <p>Haunter should always be used alongside Gengar, since Gengar is strictly better. Gengar should always be revealed first, as Haunter being revealed will tell the opponent you have Gengar anyway. With Haunter around, Gengar can be used to switch into Normal-types and use Explosion more comfortably. Once Gengar faints, the opponent may reveal a mono-Normal attacker, letting the player use Haunter to wall it. Many Normal-types, like Slash Tauros, drop Earthquake in favor of Glare to help against faster foes and opposing Normal-types, making Haunter a usable partner to Pokemon like Kangaskhan, Starmie, and one's own Tauros. Haunter can wall Exeggutor if it drops Psychic, letting it support Pokemon such as Starmie and Vaporeon. The opponent will also likely use Explosion less carefully with Gengar out of the picture, letting the player gain a lead if they trick the opponent into sacrificing an important Pokemon like Tauros or Exeggutor for nothing. Haunter struggles heavily against Normal-types that run Earthquake, such as Tauros and Kangaskhan, as well as Psychic-types, such as Starmie, Exeggutor, and especially Alakazam. One's own Tauros, Kangaskhan, Starmie, and Exeggutor can check and trade hits with their opposing counterparts, and Explosion users such as Clefable and Dodrio can remove them as well. Since Haunter and Gengar both run Hypnosis, it is recommended to pressure the opponent to sacrifice their slept Pokemon before sending out Haunter, so that it can put another foe to sleep.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 535530, "username": "Gangsta Spongebob"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 233818, "username": "Enigami"}, {"user_id": 530877, "username": "Volk"}]}, {"name": "Grammar checked by", "members": [{"user_id": 583793, "username": "Sabelette"}]}]}
  },
  "Gengar": {"sets": {"STABmons": {}}},
  "Exeggutor": {"sets": {"STABmons": {}}},
  "Rhydon": {"sets": {"STABmons": {}}},
  "Chansey": {"sets": {"STABmons": {}}},
  "Kangaskhan": {"sets": {"STABmons": {}}},
  "Starmie": {"sets": {"STABmons": {}}},
  "Jynx": {"sets": {"STABmons": {}}},
  "Tauros": {"sets": {"STABmons": {}}},
  "Gyarados": {"sets": {"STABmons": {}}},
  "Vaporeon": {"sets": {"STABmons": {}}},
  "Jolteon": {"sets": {"STABmons": {}}},
  "Omastar": {"sets": {"STABmons": {}}},
  "Kabutops": {"sets": {"STABmons": {}}},
  "Aerodactyl": {"sets": {"STABmons": {}}},
  "Snorlax": {"sets": {"STABmons 1": {}, "STABmons 2": {}}},
  "Zapdos": {"sets": {"STABmons": {}}},
  "Dragonite": {"sets": {"STABmons": {}}}
}