{
  "Venusaur": {"sets": {"SubSeed": {}}, "credits": {"writtenBy": [], "teams": [{"name": "Set(s) by", "members": [{"user_id": 298753, "username": "Elo Bandit"}]}]}},
  "Persian": {"sets": {"Slash": {}}},
  "Golduck": {"sets": {"Amnesia Attacker": {}}, "credits": {"writtenBy": [], "teams": [{"name": "Set(s) by", "members": [{"user_id": 298753, "username": "Elo Bandit"}]}]}},
  "Primeape": {"sets": {"Physical Attacker": {}}, "credits": {"writtenBy": [], "teams": [{"name": "Set(s) by", "members": [{"user_id": 298753, "username": "Elo Bandit"}]}]}},
  "Poliwrath": {"sets": {"Mixed Attacker": {}}, "credits": {"writtenBy": [], "teams": [{"name": "Set(s) by", "members": [{"user_id": 298753, "username": "Elo Bandit"}]}]}},
  "Alakazam": {"sets": {"Psychic Stallbreaker": {}}, "credits": {"writtenBy": [], "teams": [{"name": "Set(s) by", "members": [{"user_id": 298753, "username": "Elo Bandit"}]}]}},
  "Machamp": {"sets": {"All-Out Attacker": {}}},
  "Golem": {"sets": {"Rest 3 Attacks": {}}, "credits": {"writtenBy": [], "teams": [{"name": "Set(s) by", "members": [{"user_id": 298753, "username": "Elo Bandit"}]}]}},
  "Slowbro": {"sets": {"Stall": {}}, "credits": {"writtenBy": [], "teams": [{"name": "Set(s) by", "members": [{"user_id": 298753, "username": "Elo Bandit"}]}]}},
  "Cloyster": {"sets": {"Standard": {}}},
  "Gengar": {"sets": {"Rest": {}}, "credits": {"writtenBy": [], "teams": [{"name": "Set(s) by", "members": [{"user_id": 298753, "username": "Elo Bandit"}]}]}},
  "Electrode": {"sets": {"Screech + Hyper Beam": {}}},
  "Exeggutor": {"sets": {"SubSeed": {}}, "credits": {"writtenBy": [], "teams": [{"name": "Set(s) by", "members": [{"user_id": 298753, "username": "Elo Bandit"}]}]}},
  "Hitmonlee": {
    "overview": "<p>Despite its pitiful defenses and typing, Hitmonlee finds itself as a niche but quite useful Pokemon in RBY 1v1, thanks to its strong Attack, respectable Speed, and incredibly important matchup against Snorlax, the best Pokemon in the tier.</p>",
    "comments": "<h3>Other Options</h3> <p>Counter can potentially be used to improve odds in Normal- and Fighting-type matchups like Machamp, opposing Hitmonlee, and Persian.</p> <h3>Checks and Counters</h3> <p><strong>Tauros</strong>: Tauros is faster than Hitmonlee and can find easy 2HKOs with Body Slam and Hyper Beam.</p> <p><strong>Rhydon</strong>: While Hitmonlee can attempt to flinch it with Rolling Kick, it is not very likely, and Rhydon’s Earthquake is a 2HKO. Hitmonlee’s Rolling Kick is a 3HKO, and High Jump Kick has a very low chance to 2HKO Rhydon, so the matchup is in Rhydon's favor.</p> <p><strong>Pokemon Hitmonlee Cannot Hit Super Effectively</strong>: Hitmonlee matches up really poorly against every strong special attacker due to its abysmal bulk, and without any super effective damage, Hitmonlee struggles to break through them. It particuarly struggles against Pokemon with Psychic- and Flying-type moves like Alakazam, Starmie, Exeggutor, Slowbro, Jynx, Gengar and Zapdos.</p>",
    "sets": {
      "Offensive": {
        "description": "<h4>Set Description</h4> <p>High Jump Kick is one of Hitmonlee's signature moves and its strongest Fighting-type STAB move, letting it hit Snorlax, Kabutops, Chansey, and Lapras for massive damage. Jump Kick, while not as strong, is slightly more accurate, which helps with securing KOs after a High Jump Kick, especially against Snorlax. Rolling Kick allows Hitmonlee to attempt to flinch its way through slower Pokemon like Rhydon. Both Meditate and Substitute are used to punish a Counter from Chansey or Snorlax, Meditate is preferred for Reflect Chansey, while Substitute helps more against Snorlax.</p> <p>The main draw of Hitmonlee is how amazing it is against Snorlax and Chansey, two of the best Pokemon in the tier. Because of this, it is best to run teammates that don't like facing Snorlax and Chansey such as Alakazam, Jolteon, Zapdos, Rhydon, Snorlax, and Tauros. These Pokemon can help Hitmonlee in return by beating any threats that might do well against it such as the many Psychic-type Pokemon in the tier.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 563650, "username": "bern"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 520168, "username": "Murm"}, {"user_id": 298753, "username": "Elo Bandit"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528485, "username": "DerpySuX"}, {"user_id": 384270, "username": "autumn"}]}]}
  },
  "Rhydon": {"sets": {"Standard": {}}, "credits": {"writtenBy": [], "teams": [{"name": "Set(s) by", "members": [{"user_id": 298753, "username": "Elo Bandit"}]}]}},
  "Chansey": {"sets": {"The Egg": {}}, "credits": {"writtenBy": [], "teams": [{"name": "Set(s) by", "members": [{"user_id": 298753, "username": "Elo Bandit"}]}]}},
  "Starmie": {
    "overview": "<p>Starmie is an incredibly powerful Pokemon in RBY 1v1, arguably being the best Psychic-type in the tier thanks to its wonderful movepool, which includes its access to Recover, high Speed and Special stats, solid bulk, an Ice resistance, and amazing matchups against other top-ranked Pokemon.</p>",
    "comments": "<h3>Other Options</h3> <p>It's possible to run three attacks without Recover, and though doing so ruins Starmie's longevity against more important Pokemon like Chansey, it does maximize its potential matchup spread.</p> <h3>Checks and Counters</h3> <p><strong>Electric-type Coverage</strong>: Starmie struggles against Electric-type coverage, such as Thunderbolt and Thunder, from Zapdos, Snorlax, Chansey, and Jolteon.</p> <p><strong>Alakazam</strong>: Alakazam is capable of outspeeding and using Toxic on Starmie to stall it out with Recover spam. On top of this, any chance of freezing Alakazam is completely thwarted by Substitute. Even if Starmie were to run Rest, the Special drops from Alakazam's Psychic make it unlikely for it to find a win.</p>",
    "sets": {
      "Psychic-type Attacker": {
        "description": "<h4>Set Description</h4> <p>Psychic hits Machamp, Hitmonlee, Gengar, and Venusaur super effectively and deals solid damage to neutral targets like Tauros and Snorlax, and its chance to drop a foe's Special can break down special walls like Articuno if Starmie doesn't have Thunderbolt. Ice Beam is preferred over Blizzard due to its higher PP and higher accuracy, and it still deals with important threats like Rhydon and Exeggutor. Despite not having a chance to freeze, Thunderbolt assists in matchups against Lapras, Slowbro, Articuno, and opposing Starmie. Recover helps in the long run against Chansey, Tauros, and Jynx thanks to potential Special drops from Psychic. Finally, Reflect can stall the likes of Snorlax and Tauros as long as Snorlax doesn't carry Thunderbolt and Tauros doesn't get lucky with critical hits.</p> <p>Starmie's combination of Reflect and Recover makes it one of the best physical walls in the game on top of its solid typing, good bulk, and great Speed. Starmie and Snorlax are an amazing core, with both of them dealing with each other's weaknesses quite nicely. Snorlax handles Electric-type Pokemon like Zapdos and Jolteon, while Starmie can take care of physical attackers like Hitmonlee. Other partners that Starmie appreciates having are Tauros and Chansey, with Tauros being an incredible physical wallbreaker that can handle threats like Jolteon and Chansey being the best special wall in the tier and dealing with Thunderbolt Snorlax.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 563650, "username": "bern"}], "teams": [{"name": "Set(s) by", "members": [{"user_id": 298753, "username": "Elo Bandit"}]}, {"name": "Quality checked by", "members": [{"user_id": 298753, "username": "Elo Bandit"}, {"user_id": 520168, "username": "Murm"}]}, {"name": "Grammar checked by", "members": [{"user_id": 452572, "username": "missangelic"}, {"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Jynx": {
    "overview": "<p>Jynx carves out a niche in RBY 1v1 thanks to its STAB move combination, unique resistances, and immunity to freeze. Jynx can defeat important threats like Chansey and Articuno and still attempt to freeze other threats like Starmie, Alakazam, and Snorlax, which would usually counter it. What holds Jynx back are its low HP and Defense stats, which prevent it from survivng longer on the field without its trademark move, Lovely Kiss. Jynx's attacks are quite good in certain matchups, but other Psychic-type Pokemon have better traits, like Alakazam's great Speed, Starmie's outstanding bulk, and Exeggutor's combination of Leech Seed and Toxic, leaving Jynx as a niche but viable Pokemon in the metagame.</p>",
    "sets": {
      "Offensive": {
        "description": "<p>STAB Blizzard is Jynx's main selling point, mainly OHKOing Rhydon and 2HKOing Zapdos and Exeggutor while also being able to freeze a Pokemon, though it's usually used for the damage. Ice Beam is used for better accuracy, higher PP, and more chances to fish for a freeze while still 2HKOing threats like Sandslash. Psychic is another great STAB move that lets it hit Gengar, Machamp, and Hitmonlee for super effective damage. The chance of lowering Special really comes in handy against opposing Jynx and Lapras. Finally, Rest is Jynx's last move because it improves reliability against the previous matchups, allowing Jynx to win without fear of counterplay or Toxic poison.</p> <p>Jynx is usually found on teams where its weaknesses to the multiple Psychic- and Normal-types in the tier are cancelled out. Pokemon like Tauros and Snorlax appreciate its consistency into Articuno and Chansey, while being able to beat its many weaknesses to Starmie, Slowbro, and Tauros. Alakazam and Chansey are also great partners for Jynx, as they can defeat opposing threats like Jolteon and Starmie, while Jynx reliably beats Rhydon and Hitmonlee for them.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 563650, "username": "bern"}], "teams": [{"name": "Set(s) by", "members": [{"user_id": 298753, "username": "Elo Bandit"}]}, {"name": "Quality checked by", "members": [{"user_id": 298753, "username": "Elo Bandit"}, {"user_id": 520168, "username": "Murm"}]}, {"name": "Grammar checked by", "members": [{"user_id": 567354, "username": "Lustre"}]}]}
  },
  "Electabuzz": {"sets": {"Mixed Attacker": {}}, "credits": {"writtenBy": [], "teams": [{"name": "Set(s) by", "members": [{"user_id": 298753, "username": "Elo Bandit"}]}]}},
  "Tauros": {"sets": {"The Bull": {}}, "credits": {"writtenBy": [], "teams": [{"name": "Set(s) by", "members": [{"user_id": 298753, "username": "Elo Bandit"}]}]}},
  "Lapras": {"sets": {"Special Attacker": {}}, "credits": {"writtenBy": [], "teams": [{"name": "Set(s) by", "members": [{"user_id": 298753, "username": "Elo Bandit"}]}]}},
  "Jolteon": {"sets": {"Critical Attacker": {}}, "credits": {"writtenBy": [], "teams": [{"name": "Set(s) by", "members": [{"user_id": 298753, "username": "Elo Bandit"}]}]}},
  "Snorlax": {"sets": {"Amnesia Attacker": {}}, "credits": {"writtenBy": [], "teams": [{"name": "Set(s) by", "members": [{"user_id": 298753, "username": "Elo Bandit"}]}]}},
  "Articuno": {
    "overview": "<p>Thanks to one of the highest Special stats in the game along with the most powerful special move, Articuno is a decent offensive threat. Articuno's bulk helps it against physical attackers like Tauros and Snorlax as well as some special attackers like Chansey, letting it spam its Ice-type moves to land a freeze and end the game. Thanks to its Ice typing Articuno is immune to freeze, and this combined with its solid bulk and great power allows it to match up well into many bulky foes. However, Articuno's movepool is very limited with only Ice- and Normal-type moves to choose from, leaving it unable to deal with foes that resist its STAB Ice-type moves.</p>",
    "comments": "<h3>Other Options</h3> <p>Articuno's movepool isn't very large, and it is usually limited to the four listed moves. Hyper Beam is the only move worth considering as an alternative, but it's only useful against Jynx, which is frail to physical attacks and resists Articuno's Ice moves.</p> <h3>Checks and Counters</h3> <p><strong>Amnesia</strong>: Snorlax and Slowbro can set up Amnesia, tank a few hits from Articuno, and eventually 2HKO Articuno at +6. However, they have to be wary of getting frozen.</p> <p><strong>Electric moves</strong>: Electric-type Pokemon such as Jolteon and Zapdos, and Pokemon with strong electric coverage, like Starmie and Gengar, hit Articuno really hard while bulking Blizzard.</p> <p><strong>Ice-types</strong>: Lapras and Jynx don't take much damage from Articuno, and they are able to hit it hard in return. Thanks to their Ice typing, they are immune to freeze, so Articuno really struggles against them.</p>",
    "sets": {
      "Reflect + Rest": {
        "description": "<h4>Set Description</h4> <p>Blizzard is Articuno's main STAB attack, threatening foes weak to it like Rhydon and dealing good damage to neutral targets like Tauros. Ice Beam is a weaker alternative than Blizzard, but it is viable thanks to its higher PP and better accuracy, letting Articuno fish for a freeze against bulky targets like Chansey. Reflect is useful against targets like physical Snorlax, and it's one of the few solid moves that is included in Articuno's movepool. Rest keeps Articuno healthy against bulky Pokemon like Chansey and Snorlax without Thunderbolt, giving it more chances to fish for a freeze.</p> <p>Articuno should be paired with Pokemon such as Snorlax and Tauros that can handle foes unbothered by Articuno's Ice-type attacks, such as Jynx, Slowbro, and Lapras. Rhydon is a good option, as it can take on troublesome Electric-type foes, such as Zapdos and Jolteon. Jolteon is another solid choice that is able to threaten bulky Water-type Pokemon, such as Lapras and Starmie. Jolteon can also handle Zapdos for Articuno well. Alakazam is another solid partner that can handle Starmie, Lapras, Jolteon, Jynx, and Chansey carrying Thunderbolt.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 564420, "username": "Lialiabeast"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 520168, "username": "Murm"}, {"user_id": 298753, "username": "Elo Bandit"}]}, {"name": "Grammar checked by", "members": [{"user_id": 583793, "username": "Sabelette"}]}]}
  },
  "Zapdos": {
    "overview": "<p>Zapdos is a powerful threat in the metagame due to its high stats and access to strong STAB attacks in Thunderbolt and Drill Peck. With one of the highest Special stats around and a solid Attack stat to go along with it, Zapdos can threaten both physical and special damage. Its bulk is also quite good, allowing it to take hits from strong attackers like Tauros and Alakazam.</p>",
    "comments": "<h3>Other Options</h3> <p>Zapdos can run a stall set with the combination of Toxic, Reflect, and Rest, which can beat non-Rest Rhydon. However, this severely weakens Zapdos's matchups against Tauros and Exeggutor, so it is rarely run. Light Screen is also a novel option to improve Zapdos's matchup against certain special attackers, though it is only relevant if it can threaten to KO them through their recovery moves.</p> <h3>Checks and Counters</h3> <p><strong>Electric-types</strong>: Jolteon and Raichu resist both Electric and Flying and can hit Zapdos hard with a neutral Thunderbolt and Thunder.</p> <p><strong>Ice-type Moves</strong>: Special attackers like Chansey and Jynx can hit Zapdos hard with Ice Beam or Blizzard. Snorlax can utilize Amnesia along with those attacks to have an alright matchup.</p> <p><strong>Rhydon</strong>: Rhydon is immune to Zapdos's Electric moves, takes minimal damage from Drill Peck, and can hit it hard in return with a super effective Rock Slide. Stall Zapdos can try to use Toxic to beat Rhydon, but Rhydon can still win the matchup if it is carrying Rest.</p>",
    "sets": {
      "Offensive": {
        "description": "<h4>Set Description</h4> <p>Thunderbolt is Zapdos's main STAB attack, significantly threatening Pokemon weak to it like Starmie, Slowbro, and Articuno while still doing significant damage to neutral targets like Tauros and Snorlax. Drill Peck helps against Exeggutor and Venusaur that resist Electric while hitting Gengar and Alakazam harder than Thunderbolt due to their lower Defense stats. Thunder is a useful tool alongside Thunderbolt if Zapdos needs the extra damage to score a KO. This is relevant especially against Tauros, as Thunderbolt into Thunder can KO Tauros before it can KO Zapdos. It also helps in the mirror matchup and further improves the Snorlax matchup. Zapdos's last move is dedicated to a useful status move; Thunder Wave is a useful tool for increasing the odds against Tauros, along with turning the Alakazam matchup into a winning one. Reflect is another solid option and improves Zapdos's odds against non-Blizzard Snorlax.</p> <p>Zapdos likes pairing with Pokemon like Blizzard Snorlax and Tauros that can take on Pokemon like Rhydon and Jolteon, which resist Zapdos's STAB attacks, and in return, Zapdos can defeat common Normal-type counters like Slowbro, Starmie, and opposing Tauros. Articuno is able to handle non-Thunderbolt variants of Snorlax and Chansey, along with improving the Tauros matchup, while Zapdos helps its fellow bird by handling Alakazam, Starmie, and opposing Articuno. Exeggutor helps Zapdos by beating Chansey and Snorlax, and it appreciates Zapdos taking on Alakazam and Starmie.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 520168, "username": "Murm"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 530877, "username": "Volk"}, {"user_id": 298753, "username": "Elo Bandit"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Moltres": {"sets": {"Mixed Attacker": {}}, "credits": {"writtenBy": [], "teams": [{"name": "Set(s) by", "members": [{"user_id": 298753, "username": "Elo Bandit"}]}]}}
}