{
  "Venusaur": {
    "overview": "<p>Venusaur is faster than Exeggutor, which is nice. Razor Leaf hits most OU Pokemon pretty hard, like Starmie, Rhydon, Golem, Slowbro, and Tauros. Overall a pretty good Pokemon; it should put something to sleep and do some damage before fainting.</p> ",
    "comments": "<h1>Other Options</h1> <p>Hyper Beam can always work with Swords Dance; you can put it over Sleep Powder if you've got plenty of other sleep users, or over Razor Leaf if you think you can wear down Golem and Rhydon with something else and finish them with Swords Dance-boosted Hyper Beam. Growth works in conjunction with Mega Drain, but it's not really recommended.</p> <h1>Checks and Counters</h1> <p>Gengar, Exeggutor, Zapdos, Moltres, and Articuno are the best counters, as Venusaur really can't do much to them at all and is forced to switch out. Gengar and Exeggutor are especially good counters since Gengar is either resistant or immune to anything Venusaur will use and Exeggutor doesn't mind paralysis too much, and will fire back with a very powerful Psychic. The legendary birds, once in, will be able to scare off Venusaur, but do not want to be switched into a paralyzing Body Slam. Alakazam and Jynx can switch in on a predicted Razor Leaf, but must be slightly more careful of Hyper Beam or Body Slam. Venusaur also takes a good amount of damage from a Rhydon using Earthquake, so try not to switch him into it often.</p> ",
    "sets": [{"name": "Sleep Powder", "description": "<p>As it is faster than the Exeggutor lead, it can get an early Sleep Powder in and paralyze the next Pokemon with Body Slam. After a Swords Dance, it nearly 2HKOs Chansey with Body Slam. Razor Leaf is almost an OHKO on Starmie thanks to its critical hit rate. If the opponent lets their Exeggutor sleep and they don't have a Gengar, they may have trouble on their hands, as Venusaur can deal a good amount of damage to most Pokemon on a standard RBY team.</p> "}]
  },
  "Arbok": {
    "overview": "<p>Arbok is mostly outclassed by Victreebel in RBY OU in its only viable role as a Wrap user. Middling stats, being crippled by any status, lacking a viable Poison-type STAB move, and an awful typing for the metagame all make it difficult for Arbok to function. At best, Arbok is a mediocre addition to RBY OU Wrap teams.</p> ",
    "sets": [{"name": "Wrapper", "description": "<p>If Arbok is to be used at all, it should be using this set alongside Thunder Wave Dragonite and Stun Spore Victreebel in the hopes of overwhelming the opponent with Wrap and paralysis. Glare and Wrap are essential, allowing Arbok to paralyze faster threats and use Wrap to wear them down or safely switch out to a teammate. Earthquake 2HKOes Gengar, preventing it from PP stalling Wrap. Hyper Beam finishes off weakened threats. Rock Slide, Double-Edge, and Acid are weaker but lower-risk alternatives to Hyper Beam to hit Pokemon that resist Earthquake.</p> "}],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 265630, "username": "Amaranth"}, {"user_id": 424525, "username": "FriendOfMrGolem120"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 233818, "username": "Enigami"}]}
  },
  "Sandslash": {
    "overview": "<p>It's better than most give it credit for. Sandslash is generally less effective than Golem or Rhydon in its own right, but it beats them both one-on-one and is the only one of the three to outspeed Exeggutor. The trade-off is that Sandslash is the least offensive of the three, requiring a Swords Dance boost before it can really threaten your opponent, and the lack of Rock typing makes it a worse counter to Dodrio and Zapdos. Nonetheless, Sandslash is worthy of consideration for any OU team.</p> ",
    "comments": "<h1>Other Options</h1> <p>Mimic is a fun and viable option. You can use Slash if you are concerned about Sandslash's durability for setting up. Sand-Attack could work well together with Slash, Earthquake, and Substitute.</p> <h1>Checks and Counters</h1> <p>Starmie, Slowbro, Venusaur, Exeggutor, and Tauros all have sufficient Defense to switch in against Sandslash and threaten it with a 2HKO. Exeggutor is an especially good counter since it is resistant to Sandslash's main attack, Earthquake. Pokemon like Cloyster, Dragonite, and Lapras do well even with the weakness to Rock, since Sandslash doesn't get STAB on its Rock Slide.</p> ",
    "sets": [
      {
        "name": "Swords Dance",
        "description": "<p>Sandslash is a Ground-type that can Swords Dance and beat a slightly injured Exeggutor. It comes in when you think a low Defense Pokemon is going to use Recover (Alakazam or Chansey) and it sweeps.</p> <p>The problem with Sandslash, as opposed to other Ground / Rock types like Rhydon or Golem, is that it isn't a Rock-type, which decreases what it can achieve; it doesn't even have a great Attack stat. This makes Swords Dance a necessity, since Sandslash does not 2HKO Chansey or Starmie without it, but this, in turn, makes setting up tricky. Since it will also inevitably have problems against Starmie, Body Slam is there to paralyze it while it switches in, and also possibly wear down Exeggutor for Hyper Beam to be able to OHKO. Substitute is a possibility for when the opponent is fully paralyzed. Rock Slide is, of course, to hit the rare Flying- and Bug-types hard, which can be a huge pain if you are just trying to Body Slam them to death.</p> "
      }
    ]
  },
  "Nidoking": {
    "overview": "<p>The better of the two Nidos, Nidoking has good Attack and decent Special, so it can make its awesome movepool work better. However, it's hard to switch in Nidoking in RBY OU, because its typing leaves it with weaknesses against moves like Earthquake, Blizzard, and Psychic. If you do switch it in and predict well though, it can do some damage because it has so many options.</p> ",
    "comments": "<h1>Other Options</h1> <p>Surf can be used against Rhydon and Golem. Ice Beam can work as an alternative to Blizzard if you're feeling unlucky or you want more PP. Rock Slide can work against Flying-types, especially against Moltres, Articuno, and Charizard.</p> <h1>Checks and Counters</h1> <p>Alakazam and other Psychics are at the top of Nidoking's counter list, even though they should all beware when switching in. Starmie and Slowbro wouldn't want to switch into a Thunderbolt, much like how Exeggutor wouldn't want to switch into a Blizzard. Other Water-types such as Lapras and Vaporeon counter Nidoking well too since they have enough HP to handle Nidoking's attacks and then fire back with STAB Blizzards and Surfs, respectively.</p> ",
    "sets": [{"name": "Mixed Attacker", "description": "<p>Unlike most Ground-types, Nidoking can use special attacks well; it also has less Attack and Defense than most Ground-types. To use the set best, try to predict what your opponent will switch into Nidoking and damage it with a super effective attack. Nidoking can cover some of its weaknesses with Blizzard for Exeggutor, Thunderbolt or Thunder for Starmie, and Body Slam for Alakazam. Thunder on Nidoking isn't a bad idea because it's a 2HKO on Starmie and a 3HKO on Slowbro.</p> "}]
  },
  "Clefable": {
    "overview": "<p>Clefable is a decent, unpredictable utility Pokemon, but it's not particularly good at anything. Its Normal-type STAB attacks hurt the omnipresent Psychic-types in RBY, and while it can't beat most of them one-on-one, it can still damage them heavily and shuffle Pokemon around with moves like Thunder Wave and Sing.</p> ",
    "comments": "<h1>Other Options</h1> <p>Mimic is useful to copy a foe's Recover, but it has little use outside of this, as Clefable has a good enough movepool already. Reflect and Light Screen can help raise your team's defenses. Submission hurts Normal-types if you need Clefable to do that, but it's inaccurate and shorten's Clefable's time on the battlefield.</p> <h1>Checks and Counters</h1> <p>Clefable can't do much to Gengar outside of paralyzing it, and Gengar can hit back with Thunderbolt and Seismic Toss. Snorlax doesn't particularly care about paralysis, and it can hit Clefable with a powerful Body Slam. Clefable's Special is poor, so Zapdos, Articuno, and Moltres are able to use their high Special to tank Clefable's moves and then outspeed and KO it; they do fear Thunderbolt and Blizzard, however. Chansey and Alakazam can try to defeat Clefable in an emergency, but they dislike Body Slam; it doesn't do <strong>that much damage to them, but Body Slam followed by Hyper Beam will KO Alakazam and inflict a great deal of damage to Chansey.</p> ",
    "sets": [
      {"name": "Offensive", "description": "<p>Body Slam is always a useful attack for its chance to inflict paralysis, and with the STAB boost, it has the potential to hurt some physically frail Pokemon such as Chansey. Blizzard destroys the Rock / Ground types that attempt to wall Clefable, such as Golem and Rhydon, and is a good attack in general in RBY. Hyper Beam is an extremely powerful move to pick off a weakened Pokemon when other attacks can't. Thunderbolt can hit some Water-types, such as Starmie and Slowbro, moderately hard, while Thunder Wave is a more reliable move than Body Slam for spreading paralysis. The fourth moveslot is the most flexible, as Thunderbolt or Thunder Wave can be replaced by any of the myriad of options Clefable has if you would like to cover a different set of threats.</p> "},
      {"name": "Status Inducer", "description": "<p>This set attempts to distribute status problems effectively. Thunder Wave is the most reliable paralysis-inducing move and is especially effective alongside Blizzard to hit the Ground-types that are immune to Electric-type moves. Sing can be used to induce sleep, but its 54.7% accuracy leaves something to be desired. Alternatively, Counter can bounce back physical attacks, particularly the very common Body Slam, to inflict some good damage off Clefable's decent HP. Thunderbolt complements Blizzard well for type coverage by hitting the Water-types that resist Ice-type attacks. On the other hand, Thunder can sometimes OHKO Gyarados and 2HKO Starmie, but it has low accuracy.</p> "}
    ],
    "credits": {"teams": [], "writtenBy": [{"user_id": 19, "username": "Hipmonlee"}]}
  },
  "Persian": {
    "overview": "<p>Persian carves out a niche in RBY OU with access to the strongest STAB Slash in the game, allowing it to constantly fire off an effectively 140-Base Power STAB move that ignores Reflect. It's not limited to just Slash either; Persian's special coverage, bolstered by its 22.46% critical hit rate, means that it isn't simply countered by typical Normal-type answers like Rhydon and Cloyster. This lets it pressure cores reliant on Snorlax and Cloyster as their physical checks. Persian's great Speed also allows it to outrun Tauros and tie with Starmie, which makes it an effective revenge killer. When paired with the tier-king Tauros, Persian can form a powerful sweeping core that can be very difficult to stop late-game.</p> <p>However, Persian should never be considered a replacement for the rampaging bull, and this is partly why it's never seen true OU prominence. Persian is very reliant on its Speed and, ergo, very weak to paralysis—moreso than Tauros—exposing its meager bulk and making revenge killing very difficult. Due to this weakness, Persian is often forced out by Thunder Wave users like Alakazam. As a result, Persian regularly mandates multiple Pokemon to fall back on while offering little to no defensive utility in return. Additionally, Persian is reliant on Slash to a fault, dealing middling damage using anything else. Because of these factors, Persian is by no means a standard in RBY OU, but it is nonetheless a viable pick for more offensive teams.</p> ",
    "comments": "<h1>Other Options</h1> <p>Persian's fourth moveslot is fairly expendable, but its movepool is far from impressive. Body Slam allows Persian to scout while spreading paralysis for its teammates, though the damage isn't impressive. However, it's more consistent than Hyper Beam while dealing significantly more damage than Slash if it lands a critical hit, making Persian more effective at getting past Reflect Snorlax. Alternatively, Screech can be used alongside Hyper Beam to OHKO Pokemon like Starmie, creating mind games to encourage switches. It also gives Persian a very helpful way of checking for Counter from Chansey and Snorlax, potentially getting it off for free. Thunder 2HKOes Cloyster and deals more damage to Starmie, but its consistency leaves much to be desired.</p> <h1>Checks and Counters</h1> <p><strong>Gengar: Persian can't fight Gengar at all, possessing only its special coverage to have even a hope in doing so. Even Thunder only has a vague chance to 5HKO it, so Persian is often forced out while giving Gengar free rein to use an uncontested Hypnosis or force damage onto your team. Ideally, Gengar should be accounted for and dispatched before even revealing Persian.</p> <p><strong>Paralysis</strong>: Persian can't handle paralysis, which makes its bulk much more apparent and easier to exploit. Worse still, being paralyzed completely diminishes Persian's potential to revenge kill, making it little more than food for opposing Snorlax and Tauros. Many Pokemon, like Exeggutor and Lapras, possess strong attacks that can even 2HKO it with little consequence when it's paralyzed.</p> <p><strong>Starmie: Starmie is capable of stomaching Slash + Hyper Beam while Speed tying Persian, which, on top of its access to Thunder Wave, makes it very capable of downing the cat. Persian is capable of winning against a paralyzed Starmie, but it will often rely on full paralysis to win from full HP.</p> <p><strong>Snorlax</strong>: Snorlax is capable of 2HKOing Persian with Body Slam if it's taken any prior damage, and Snorlax possesses the bulk necessary to stomach three hits of Slash. However, if Snorlax isn't healthy or is using Rest, Persian can use Snorlax as an opportunity to switch in and threaten to deal serious damage. If Reflect Snorlax attempts to stall Persian with continued uses of Rest, Persian does have a 6.5% chance to 3HKO with Slash, which can be realized in continued interactions.</p> <p><strong>Exeggutor</strong>: With its fantastic bulk, Exeggutor can win against Persian one-on-one, threatening with Sleep Powder, Stun Spore, or a 2HKO from Psychic. However, it will take massive damage in the process, often being forced to use Explosion much sooner than usual.</p> <p><strong>Rhydon</strong>: While 2HKOed by Bubble Beam, Rhydon is capable of threatening Persian, as it can 2HKO Persian with Earthquake while resisting Slash. Due to it effectively forcing Persian to use Bubble Beam, it can pivot to a specially bulky Pokemon like Alakazam to switch in with relative impunity unless a Speed drop occurs. Ergo, defeating Rhydon with Bubble Beam can actually be quite difficult, so Bubble Beam should be seen as a way to encourage it to switch out and force Slash damage onto the opposing team.</p> ",
    "sets": [
      {
        "name": "Slash",
        "description": "<h1>Set Description</h1> <p>Slash is the main reason Persian is viable, effectively ignoring Reflect thanks to its near-guaranteed critical hit rate. Hyper Beam allows Persian to KO Pokemon like Starmie, Victreebel, and Chansey after using Slash. It's perfectly valid to use Hyper Beam as a last stand in a tight spot as well, which, with the critical hit rate considered, can even flip the situation on its head. Thunderbolt gives Persian a fighting chance against Slowbro and Cloyster, 3HKOing them. Bubble Beam allows Persian to 2HKO Rhydon, and the Speed drop chance can occasionally prove useful against faster switch-ins like Alakazam and Jolteon, which are then put into an awkward position.</p> <p>Persian is very straightforward and should ideally be used as a mid-game revenge killer, often as a more expendable Tauros. However, Persian should never be revealed until Gengar is accounted for, so as to not give it an opportunity to switch in and fire off an uncontested Hypnosis. Remember that Persian is faster than Tauros, which gives it the potential to duel the king of RBY OU. In a similar vein, Persian is also an excellent late-game cleaner when the opposing team has been paralyzed and most Pokemon will ideally be in Slash range.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 265630, "username": "Amaranth"}, {"user_id": 51373, "username": "Nails"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}, {"user_id": 388157, "username": "A Cake Wearing A Hat"}]}], "writtenBy": [{"user_id": 236353, "username": "Plague von Karma"}]}
  },
  "Poliwrath": {
    "overview": "<p>People pick Slowbro over Poliwrath because they think that being a Fighting-type means that Poliwrath is unusable. Honestly, its secondary type only serves to get STAB on its Submission, with double the damage against Normal-types and a decent Attack stat of 268. Fighting-types are weak to Psychic and Flying, but an Amnesia on the switch helps with its weakness to Psychic, and not many Pokemon have Flying-type moves. Its amazing physical defenses almost rival Slowbro's, and Slowbro can't score a sleep or outspeed many Pokemon that attempt to explode on it without paralyzing them first. One overlooked option on Poliwrath is to use Rest, which can work out really well when your opponent expects you to use another move in its stead. If you get up a couple of Amnesias first, your opponent will be hard-pressed to KO Poliwrath if you have it.</p> ",
    "comments": "<h1>Other Options</h1> <p>Body Slam is, as always, a nice move that can inflict paralysis on any Pokemon that switches in. Psychic may find use against Gengar in OU. Hydro Pump may provide Poliwrath with a needed boost in damage, but runs out of PP very quickly, and it's not really needed if you're using Amnesia. Counter is also an excellent option, as you can switch Poliwrath in on a Tauros Hyper Beam—which takes off just under half Poliwrath's health—and Counter on the recharge to OHKO Tauros. Seismic Toss can help with Starmie, Alakazam, and other Psychic-types.</p> <h1>Checks and Counters</h1> <p>Starmie is probably the best counter, as it resists Poliwrath's attacks and so can easily stall it out until it scores a critical hit with Thunderbolt. Alakazam takes off almost half of its HP with Psychic, even after one Amnesia, and it can also use Thunder Wave or Seismic Toss. Jolteon and Zapdos have the powerful STAB Thunderbolt and will critical hit Poliwrath quite frequently; Jolteon especially may critical hit immediately, and Zapdos has Drill Peck to take off a little under half Poliwrath's health (but doesn't like Blizzard). Dodrio also employs Drill Peck to easily 2HKO Poliwrath, and may score a critical hit on the first use. Venusaur and Victreebel will do major damage with Razor Leaf, though Poliwrath ties with the latter in Speed and does major damage to each with Blizzard. Gengar is immune to Submission, has excellent Special for defense and offense, and can hit Poliwrath with Thunderbolt, Psychic, or Explosion, but Poliwrath can do quite a bit to Gengar as well; in any case, watch out for it. Counter Chansey can be very difficult to out-predict, as well. Overall, Poliwrath is safe against very few opponents, but not many opponents are safe against it either! Swords Dance Kingler is an underrated Poliwrath counter, as it can switch in and set up Swords Dance while resisting Surf and Blizzard, takes minimal damage from Submission, and can paralyze Poliwrath with Body Slam.</p> ",
    "sets": [{"name": "Amnesia", "description": "<p>Ideally you should take care of Starmie or Alakazam before you try to play this, since it's very unlikely that Poliwrath will beat those, unless it can sleep them. To set this up, try to Amnesia on the switch from the Pokemon you just slept with Hypnosis; Poliwrath is faster than Exeggutor, Chansey, Golem, and Rhydon, and has a move that will do major damage to each of those, so it's not too difficult to pull that off. Use Blizzard if you fear Dodrio, Zapdos, or Razor Leaf users; after Amnesia, it can OHKO Dodrio and 2HKO Zapdos, Venusaur, and Victreebel. Submission will 3HKO Snorlax and 2HKO all the other Normal-type standards. Just watch out for Counter!</p> "}]
  },
  "Alakazam": {
    "overview": "<p>In a generation where Psychic-type attacks are only resisted by the same type, and because its only weakness may as well not exist, it's not surprising that Alakazam is an incredible threat in RBY OU. Alakazam is most commonly seen in the lead slot due to possessing excellent Speed and access to Thunder Wave; it outspeeds every Pokemon that has access to a sleep move, allowing it to immediately cripple them with paralysis. It also has the strongest Psychic in OU by virtue of its excellent Special and as such can heavily pressure its most common checks. This Special stat also makes it a decent sponge for opposing moves like Psychic, though its HP limits this slightly. It is also good at absorbing sleep, since it resists Exeggutor's Psychic. Unlike Starmie, Alakazam doesn't have a weakness to Thunderbolt, which can come in handy for absorbing sleep from the likes of Gengar and Lapras. Alakazam can also prove to be very effective outside the lead slot, maintaining excellent utility against various threats and potentially turning into a dangerous sweeper if its most common checks have been removed. However, it can be difficult to consistently keep Alakazam safe from paralysis; if paralyzed, Alakazam often finds its low Defense being exploited by strong physical attackers such as Snorlax, Rhydon, and Tauros. It's also very reliant on its Psychic, which means it is difficult to break past Chansey. Overall, Alakazam is a regular presence in RBY OU and one of the best Psychic-types available, but its extreme vulnerability to strong physical attacks and paralysis keeps it firmly below the top of the pyramid.</p> ",
    "comments": "<h1>Other Options</h1> <p>Thunder Wave, Psychic, and Recover should never be dropped. Though the last move is somewhat flexible, Alakazam's movepool is very shallow, so it should generally stick to the options mentioned. Counter has some utility when forcing out threats after the opponent KOed one of your Pokemon with a hard-hitting Normal-type attack from high health, such as Explosion, Self-Destruct, or Hyper Beam. This can be used to force damage against whatever switches in or even outright KO it. It also has situational use in Alakazam mirrors, as countering Seismic Toss can leave the opposing Alakazam severely weakened.</p> <h1>Checks and Counters</h1> <p><strong>Physical Attackers</strong>: Strong physical attackers such as Tauros, Snorlax, and Rhydon can hit Alakazam through its weak Defense and KO it, especially if it's paralyzed. They should try to switch in on Recover, though, as Psychic will do a big chunk of damage to all of them. Snorlax deserves a special mention for early-game, as it's crippled way less by paralysis and Psychic damage than the other Pokemon mentioned. Rhydon can also switch in on Thunder Wave.</p> <p><strong>Psychic-types: Almost all Psychic-types can check Alakazam, although most of them can be broken through with paralysis and Special drops. Although it generally should not come out early-game, Slowbro is particularly dangerous, as it can set up on Alakazam safely and heal its paralysis with Rest. Starmie and opposing Alakazam can also take Alakazam's Psychic and Seismic Toss and threaten it in return with their own attacks and paralysis, but these matchups can swing either way with repeated full paralysis or Special drops from either side. Surf variants of Starmie are especially dangerous, as they can deal heavy damage to Alakazam. Jynx can be used to check Alakazam in an emergency, but it is passive when doing so, vulnerable to critical hits, and better used for other tasks.</p> <p><strong>Chansey: Alakazam is a special attacker, and like all special attackers, Chansey makes a decent check. Chansey can attempt to paralyze Alakazam and pressure with Seismic Toss and to a lesser extent Ice Beam and Thunderbolt. This can force Alakazam to heal with Recover, allowing the opponent to switch into a physical threat. However, due to Psychic's secondary effect, paralysis, and Alakazam's high critical hit rate, Chansey will eventually be forced to either use Soft-Boiled or switch out. Should it get unlucky with full paralysis when trying to use Soft-Boiled, it can even be KOed. It's common to see Chansey switch in on a lead Alakazam and take a Thunder Wave to block sleep later. It can then attempt to put Alakazam to sleep with Sing on the next turn. Chansey can also attempt to fish for a freeze with Ice Beam if Alakazam isn't paralyzed, though this is risky.</p> <p><strong>Exeggutor</strong>: Exeggutor can switch into Alakazam on Turn 1 to immediately try to put it to sleep. However, the opponent would need to be content taking paralysis and getting hit by at least one Seismic Toss, which reduces the longevity of Exeggutor. This makes it much worse at checking Rhydon later in the game. If you try to prevent Alakazam from being paralyzed by switching to Chansey, the opponent gains a huge advantage, as Exeggutor can outspeed Chansey and put it to sleep. In general, though, Exeggutor checks Alakazam well. However, it struggles to pressure Alakazam enough before getting worn down by Seismic Toss, often forcing it to use Explosion.</p> ",
    "sets": [
      {
        "name": "Standard",
        "description": "<h1>Set Description</h1> <p>Alakazam is one of the best leads in RBY OU. Since it's the fastest lead that regularly sees use, it's almost guaranteed to be able to immediately cripple something from the start of the game, be it through paralysis or serious damage with Psychic. This means Alakazam is great for pressuring opposing leads. Against other Alakazam, one generally wants to paralyze it and try to get a physical attacker like Snorlax in on a predicted Recover. However, be careful to not leave the field too damaged, as Exeggutor can have Double-Edge or Hyper Beam to pressure Alakazam. Generally, you don't want to switch out at less than 80% in order for Alakazam to avoid the 2HKO from Exeggutor's Double-Edge most of the time. Gengar leads generally switch out against Alakazam due to the threat of a 2HKO from Psychic as well as an OHKO with a critical hit. Starmie should generally be approached the same way as an opposing Alakazam. However, one must be wary of Chansey when using Thunder Wave early on; its extreme bulk turns it into a phenomenal sleep blocker when paralyzed. As a result, it becomes very difficult to put anything to sleep until the now-paralyzed Chansey is KOed.</p> <p>A lead Alakazam's role, besides crippling the opposing lead, is mostly to absorb sleep. If used in this fashion, Alakazam should absolutely be running Seismic Toss. This allows Alakazam to hit Starmie and Exeggutor rather than waste Psychic's PP. Lead Alakazam can also be used to absorb paralysis from those who propagate it, such as Chansey, Starmie, and other Alakazam. This especially goes for Chansey without Seismic Toss. It's also effective against Starmie without Surf or Psychic, the latter of which can force Alakazam out after a few Special drops. Alakazam also tends to attract physical attackers like Snorlax, Tauros, and Rhydon on a forced Recover turn. If you can correctly predict the switch, you might be able to sneak in a Thunder Wave or Psychic on them. Moreover, due to Alakazam being one of the few pure special attackers that can force Chansey out, it is also an efficient paralysis spreader that can be used as such throughout the course of the battle.</p> <p>In some situations, you might still resort to using non-lead Alakazam as if it were in the lead slot to check or pressure opposing Pokemon such as Chansey and Starmie. It can also be used to function as a sweeper late-game. This strategy revolves around keeping Alakazam hidden, then attempting to clean up once its checks have been removed. Reflect can be used on sweeper Alakazam to give it a much-needed Defense boost, but it also means Alakazam will only have Psychic to attack with. In addition, Reflect Alakazam can still be taken care of through paralysis, critical hits from Tauros and Zapdos, and Explosion. Explosion is especially pressing if paralyzed, as even if Reflect Alakazam survives, it's still easily revenge killed by threats such as Tauros. However, Seismic Toss remains very usable in this context for beating Starmie and other Psychic-types more consistently.</p> <p>When using Alakazam as a sweeper, the rest of the team should work on removing Alakazam's checks before it's revealed. These checks include special sponges such as Starmie, Alakazam, and Chansey. Pokemon that resist Psychic, such as Slowbro and Exeggutor, are also important to remove. For maintaining maximum sweeping potential, Alakazam should also try to avoid paralysis as much as possible, as its Speed is the reason it's able to compete with other late-game sweepers for a team slot. Ideally, Tauros should also be put in range of Psychic to avoid its high critical hit rate and Body Slam's paralysis chance. Fortunately, that can easily be accomplished through a Tauros mirror, a common scenario in RBY OU battles, since two Body Slams will leave the opponent's Tauros in said range.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Earlier versions by", "members": [{"user_id": 380, "username": "Redwall"}, {"user_id": 42885, "username": "Crystal_"}]}, {"name": "Quality checked by", "members": [{"user_id": 265630, "username": "Amaranth"}, {"user_id": 424525, "username": "FriendOfMrGolem120"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Estronic"}, {"user_id": 388157, "username": "A Cake Wearing A Hat"}]}], "writtenBy": [{"user_id": 123746, "username": "Sceptross"}, {"user_id": 236353, "username": "Plague von Karma"}]}
  },
  "Machamp": {
    "overview": "<p>With STAB Fighting-type haymakers at its disposal, Machamp can look enticing to the average player. Being as fast as Exeggutor ensures it edges out and 2HKOes Chansey with even Low Kick, which many Pokemon simply cannot achieve. Similarly, Machamp has the potential to give Tauros and Snorlax trouble, albeit to a lesser extent due to a deathly fear of paralysis. It's also got some fair physical bulk and a handy resistance to Rock Slide, allowing it to switch into and threaten Rhydon. This boils down to solidifying Machamp as a straightforward attacker that benefits strongly from paralysis support.</p> <p>Machamp's main problem is that while nearly every team includes the \"Big 3\" Normal-types — which Machamp can excel against in a flat one-on-one — a Psychic-type usually isn't far behind them. Machamp simply can't deal with Psychic-types, often failing to muster even a 2HKO on most and taking massive damage in return. Ergo, while Machamp hits like a freight train, it offers little defensive utility, which often opens gaping holes in its team. Additionally, Machamp despises paralysis, as what little Speed it has is what ensures it can threaten the Normal-types it wants to go after. When looking for a Pokemon to pummel paralyzed teams, Rhydon is often a better choice, possessing much greater defensive utility, immunity to Thunder Wave, and generally superior STAB moves. Machamp is thus a rare sight in RBY OU and generally isn't recommended.</p> ",
    "sets": [
      {
        "name": "Wallbreaker",
        "description": "<p>STAB Low Kick may seem unassuming, but its 30.1% flinch rate in RBY makes Machamp excellent at bullying paralyzed Pokemon, making up for its mediocre defensive stats. Thanks to this, Machamp can potentially 2HKO a paralyzed Chansey — a very common sight in RBY OU — before it can muster a response. Alternatively, Submission can be used for more power, allowing Machamp to 2HKO Snorlax, Rhydon, and Tauros, albeit at the cost of significant recoil. Body Slam lets Machamp be a little more self-sufficient, paralyzing potential switch-ins to turn the tables on them. Hyper Beam is Machamp's strongest Normal-type attack, allowing it to KO Pokemon that otherwise shrug off its STAB move. Alakazam is a noteworthy target, as it can end up being 2HKOed switching in if it's paralyzed by Body Slam first. Finally, Earthquake ensures Machamp isn't completely helpless against Gengar, 2HKOing it and Jolteon.</p> <p>Machamp has a wide offensive movepool, allowing it to fine-tune itself to fit a team. Using both Submission and Low Kick can let Machamp 2HKO Tauros, allowing it to more cleanly win a one-on-one interaction. Fire Blast deals up to 34.6% to Exeggutor with a high burn rate that can ruin its Explosion. Counter can be effective with Machamp's stat line, allowing it to switch in on a Hyper Beam and score a guaranteed OHKO on Pokemon like Tauros and Snorlax. This also applies when switching into Snorlax's Body Slam and Chansey's Seismic Toss; both Pokemon will often switch out in response, allowing Machamp to severely damage the switch-in. Since Machamp struggles a bit against Reflect Chansey, Karate Chop can be a serviceable option, being what's effectively a 100-Base Power Normal-type move that ignores Reflect thanks to its near-guaranteed critical hit rate. Unfortunately, Machamp's Speed leaves Karate Chop short of the 99.6% cap, making it a tad inconsistent. Finally, Rock Slide can be used for better matchups against Articuno and Zapdos, but it falls short of 2HKOing the latter, which makes it questionable.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 233818, "username": "Enigami"}, {"user_id": 265630, "username": "Amaranth"}]}, {"name": "Grammar checked by", "members": [{"user_id": 33374, "username": "Muk"}]}], "writtenBy": [{"user_id": 236353, "username": "Plague von Karma"}]}
  },
  "Victreebel": {
    "overview": "<p>Victreebel's access to the unique combination of Wrap and Sleep Powder allows it to whittle down slower foes as well as cripple faster ones giving it great sweeping potential. With the rare Razor Leaf, it can be very difficult to switch into, especially because a would-be counter could get paralyzed by Stun Spore and subsequently dispatched by Wrap. Victreebel's Speed also makes it a reliable sleep inducer, as it outruns Lapras and Exeggutor. It can also Speed tie Cloyster while outpacing Chansey, Snorlax, and Rhydon.</p> <p>However, Psychic and Blizzard are extremely common moves in the metagame, and most staples that use either will 2HKO Victreebel at minimum. This, in addition to its middling Speed, makes Victreebel a difficult Pokemon to get mileage out of. It mandates paralysis support to reach its full potential while providing little to no defensive utility in return. Its mediocre Speed also makes paralysis particularly devastating, almost completely erasing its threat potential. Victreebel is also walled by Gengar, as its coverage is almost completely restricted to Normal- and Grass-type attacks. Overall, despite being solid on paper, Victreebel tends to struggle in practice.</p> ",
    "comments": "<h1>Other Options</h1> <p>Victreebel can use Swords Dance alongside Hyper Beam as a surprise set to become an even more threatening late-game sweeper. Victreebel's +2 Hyper Beam is nothing to scoff at; it OHKOes Alakazam on the switch in and even has a small chance to OHKO Chansey. Such power often forces a foe out, which can allow Victreebel to sneak in some status. Swords Dance can, alternatively, be used on the Wrap set to boost its net damage output, but it is very hard to justify over the conventional options. On the whole, Swords Dance is very difficult to fit on a set, since losing Wrap or a powder move makes Victreebel very specialized and more reliant on the opponent losing to it on the spot. Body Slam can be used to give Victreebel an option to threaten both sleeping and unstatused Pokemon at the same time, alleviating the burden of prediction, but the opportunity cost of running it above other moves is generally too high to be worth it.</p> <h1>Checks and Counters</h1> <p><strong>Faster Pokemon: Victreebel has major issues dealing with faster threats due to its poor defensive typing and stats. Many of the fast threats in RBY OU, such as Alakazam and Jynx, deal serious damage to it, and Victreebel can't do much back on its own. Faster threats will try to absorb the hits from Wrap, wait for it to end, and then force Victreebel out with their powerful STAB moves. Situationally, however, such matchups can sway in Victreebel's favor. For instance, Starmie can try to paralyze Victreebel and get OHKOed by Razor Leaf in return. Tauros can attempt to wait out Wrap, but Stun Spore will leave it seriously crippled and unable to sweep.</p> <p><strong>Gengar: Gengar is immune to Hyper Beam as well as Wrap's damage, and it resists Razor Leaf, leaving Victreebel with little in the way of options for defeating it. To make matters worse, Gengar threatens to put it to sleep with Hypnosis, which can end up dooming Victreebel due to its fragility. All Victreebel can do is status it or switch out. Wrap can be used to immobilize it on the switch in, though, allowing Victreebel to switch out to another Pokemon safely.</p> <p><strong>Paralysis</strong>: Paralysis almost completely nullifies Victreebel's potential. All foes suddenly become faster than it, which means it can no longer use Wrap safely. Full paralysis is very dangerous as well, putting the odds of hitting Wrap in the first place around a mere 66%. Many fast threats, such as Alakazam and Starmie, threaten to paralyze Victreebel before it can even move. Even slower threats, such as Chansey, can paralyze Victreebel if Wrap ever misses.</p> ",
    "sets": [
      {
        "name": "Wrapper",
        "description": "<h1>Set Description</h1> <p>The rare Sleep Powder gives Victreebel among the most consistent sleep options in the game, putting a potential counter out of commission for what's likely the rest of the game. Wrap's extreme power in RBY OU should be emphasized, especially because Victreebel is among its best users; it prevents foes from attacking, wears down teams, and lets its user uniquely pivot out of any check for free by immobilizing it for a turn. Its imperfect accuracy, though, means Victreebel is always vulnerable to a counterattack after an unfortunate miss. Razor Leaf acts as a very strong STAB attack that not all teams are necessarily prepared for. Stun Spore lets Victreebel spread its own paralysis without support from teammates, which can be crucial when a faster Pokemon such as Zapdos attempts to switch in. It can also be used should Tauros come in after Victreebel lands a KO, but this risks immense damage or even Body Slam paralysis. Given the threat level of Tauros, though, it can be worth the risk. Hyper Beam can be used instead of Stun Spore to finish off foes more quickly to minimize the cumulative risk of Wrap misses.</p> <p>It should be noted that bringing in Victreebel is quite difficult, as almost every threat in the metagame has a move that hits it for super effective damage, and if they don't, they likely have a way to paralyze it. Due to this, Victreebel is generally restricted to coming in on passive Pokemon, such as those that have used Rest. However, smart double switching is also a good way to get Victreebel into the game early. It's best to use Victreebel after the most natural Wrap answers, mainly common fast Pokemon such as Alakazam, Jolteon, and Zapdos, have been crippled with paralysis. This makes it very difficult for the opponent to fight back against Wrap without a smart switch-in or an unfortunate miss. Wrap can also be used to punish paralyzed foes trying to switch in on Sleep Powder; this can even lead to the paralyzed Pokemon being KOed outright. However, bulkier foes that aren't threatened too much by Razor Leaf can absorb Wrap and subsequently pivot into a faster threat, such as Starmie. This strategy keeps Victreebel from actually KOing a paralyzed Pokemon or putting a non-paralyzed one to sleep unless it is used with excellent prediction.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 265630, "username": "Amaranth"}, {"user_id": 424525, "username": "FriendOfMrGolem120"}]}, {"name": "Grammar checked by", "members": [{"user_id": 388157, "username": "A Cake Wearing A Hat"}, {"user_id": 232216, "username": "The Dutch Plumberjack"}]}], "writtenBy": [{"user_id": 236353, "username": "Plague von Karma"}, {"user_id": 239454, "username": "Aaronboyer"}]}
  },
  "Golem": {
    "overview": "<p>Golem was once in high competition with Rhydon over which Rock-type was the superior choice for teams. In the current metagame, the decision goes over to Rhydon with its higher damage output and a better matchup against Chansey, as Rhydon has a guaranteed 2HKO against Chansey without a Reflect up, while Golem is unlikely to 2HKO. Rhydon also has 103 HP Substitutes, which means it has a good chance to beat a paralyzed Reflect + Seismic Toss Chansey, whereas Golem does not. Golem, however, still manages to carve itself a niche with its access to Explosion, which is the second strongest attack in the game behind Snorlax's Self-Destruct. Explosion does massive amounts of damage to the majority of the metagame, and Golem has Earthquake for the Pokemon that resist it. This makes Golem likely to be able to trade with threats or at least severely weaken them to the point of being easily revenged killed. Golem's ability to outpace Rhydon gives it an advantage against teams using Rhydon, as it has a good matchup against them, and Golem can find its way in against Rhydon if you can predict a Rock Slide. This can be risky, however, as Rhydon 2HKOes Golem with Earthquake. Golem, just like Rhydon, offers a hard counter to the two most common Electric-types in the tier, Zapdos and Jolteon, as they do not have any coverage that touches Golem.</p> ",
    "comments": "<h1>Other Options</h1> <p>Fire Blast can be used over Body Slam, as it hits Exeggutor harder than Rock Slide and has a chance to burn it, weakening Exeggutor's Explosion. It also can burn and severely cripple Pokemon like Tauros and Snorlax. It has to be careful of burning Starmie or Chansey, however, as that would prevent them from being inflicted with more devastating status like sleep, paralysis, or freeze. It also will cure any frozen target it hits from freeze. Substitute can make prediction easier and can help fish for paralysis, but Golem has trouble fitting it in on its moveset, and it is done better by Rhydon due to it having 404 HP, which will prevent its Substitutes from being broken with one Seismic Toss.</p> <h1>Checks and Counters</h1> <p><strong>Exeggutor: Exeggutor can switch in and survive any move Golem can muster and retaliate with a powerful Psychic or a 4x super effective Mega Drain. It can also choose to go for a status-inducing move such as Sleep Powder or Stun Spore.</p> <p><strong>Tauros</strong>: While Tauros does not like taking damage from Golem, it does force you to make decisions like using Explosion or switching, as Blizzard can 2HKO or OHKO with a critical hit. Tauros can also easily finish off a weakened Golem.</p> <p><strong>Water-types</strong>: Starmie can only be OHKOed by Explosion, which is not a guarantee, and it can recover any other damage inflicted. It does, however, have to be wary of paralysis from Body Slam. Slowbro can be taken out by an Earthquake into an Explosion, but this is not guaranteed, and Slowbro gets a clean KO with Surf.</p> <p><strong>Ice-types: While they do not like to switch into a Rock Slide, Articuno, Lapras, and Cloyster can all outpace Golem and proceed to go for Blizzard or, in Cloyster's case, Clamp.</p> ",
    "sets": [
      {
        "name": "Tank",
        "description": "<h1>Set Description</h1> <p>Earthquake and Rock Slide are powerful STAB moves unresisted together by any Pokemon in the metagame. Earthquake hits Jolteon and opposing Rock-types for massive damage. Rock Slide hits Flying-types like Zapdos and Articuno that are immune to Earthquake. Explosion is useful for inflicting massive damage to most of the metagame barring Gengar and opposing Golem and Rhydon, but this comes at the cost of Golem itself. Body Slam is useful to fish for paralysis and can be used to help Golem's matchup against Starmie, as a paralyzed Starmie is much easier to deal with. Otherwise, Starmie could just use Recover to heal off any damage inflicted to it or go for Blizzard, which will OHKO on a critical hit. Paralyzing Exeggutor also benefits Golem.</p> <p>When using Golem, it is wise to scout the opponent a bit and see how Golem can be used to the greatest effect. It may not be good to use Explosion too early, as the opponent could potentially have an unrevealed Zapdos in their team. If enough turns have passed and you are sure Golem is not needed for any defensive utility, it should be considered for an optimal time to use Explosion to open a hole for your team. Golem can also be used on very aggressive Explosion-heavy teams. These types of teams, however, have yet to proven effective in top play.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 424525, "username": "FriendOfMrGolem120"}, {"user_id": 265630, "username": "Amaranth"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Estronic"}, {"user_id": 232216, "username": "The Dutch Plumberjack"}]}], "writtenBy": [{"user_id": 273347, "username": "ShuckleDeath"}]}
  },
  "Slowbro": {
    "overview": "<p>Amnesia Slowbro has gone down in history as one of the most famous and well-known sets in the world of competitive Pokemon. Generally known as Tobybro, Amnesia Slowbro is a moveset that combines both simplicity and efficiency. The RBY version of Amnesia is arguably the best stat-boosting move of all time, raising the Special stat by two stages. It quickly powers up Slowbro's Special moves, while covering its main defensive weakness: Electric-type attacks. Having one of the best physical defense stats in the game and learning Thunder Wave to make up for its awful Speed greatly helps make Slowbro more threatening as well.</p> <p>However, Slowbro is also a bit of an all-or-nothing Pokemon and requires some luck, which are the main reasons why it's often an overlooked Pokemon. Without setting up, Slowbro is basically a useless Pokemon; it can't Recover to work as a wall for a long time, and offensively, it lacks Explosion or a sleep move, unlike other specially based Pokemon. On the other hand, if Slowbro sets up, it's meant never to switch out, so the user is inevitably taking some risks; Electric-type moves fail to get past a +6 Slowbro normally, but with a critical hit, a non-STAB Thunderbolt will nearly OHKO Slowbro while a STAB Thunderbolt will OHKO outright. With critical hit rates being much higher in RBY than in later generations, it's not really \"bad luck\" when Slowbro ultimately ends up falling to a critical hit Thunderbolt. To a lesser extent, this can also be applied to the physical side, potentially turning 4HKOs into 3HKOs, letting a physical sweeper get past Rest. However, while it's true that Slowbro depends on quite a bit on luck, it also requires a good deal of skill, and Slowbro can be one of the most dangerous Pokemon in the first generation, being the best Amnesia user in RBY after Mewtwo.</p> ",
    "comments": "<h1>Other Options</h1> <p>Ice Beam is another attacking move Slowbro can use. Its biggest upside is hitting Grass-types and Zapdos for super effective damage, including Exeggutor and Victreebel. Ice Beam will often surprise Exeggutor, OHKOing it at +6. At the very least, it will force Exeggutor to use Explosion earlier, making it more predictable. Meanwhile, Zapdos is 2HKOed by a +2 Ice Beam and OHKOed when Slowbro is at +6. Ice Beam's freeze chance might also save you in a pinch and could make a difference against another Slowbro or Amnesia Snorlax. Ice Beam, however, should only be used over Thunder Wave, because the STAB move is necessary to 2HKO Chansey and Starmie. Withdraw has the same goal as Reflect, with the difference that it can maximize Slowbro's Defense, but requires two turns to reach Reflect's potential. Reflect will generally turn out to be more useful and safer. Withdraw's high PP will let Slowbro outstall other Slowbro, however. Counter can surprise common Slowbro switch-ins like Starmie if you switch into a Body Slam from a physical attacker and scare it out, or if you predict a Hyper Beam. Counter has hardly any other uses other than these though because Slowbro generally only takes physical attacks when it's asleep, excluding Explosion. Disable is a funny option that can prevent some Pokemon from Thunderbolting Slowbro for some time, but it's very unreliable and shouldn't really be used.</p> <p>Slowbro can also be used as a lead with a set of Thunder Wave, Amnesia, Surf, and Fire Blast or Blizzard. This set is incredibly vulnerable to sleep leads such as Jynx, Exeggutor, Gengar, and Sing Chansey; however, when it finds itself against other Thunder Wave leads, namely Alakazam and Starmie, its ability to boost up with Amnesia and pump out damage with +2 coverage moves is remarkable. It still struggles in doing significant damage if the opponent has Thunderbolt Chansey or Starmie anywhere on their team, and due to its lack of recovery it is incredibly easy to wear down and incredibly vulnerable to full paralysis, so this set is not recommended.</p> <h1>Checks and Counters</h1> <p><strong>Electric-type coverage: The higher the user's critical hit ratio and the number of turns it can resist Slowbro's Surf, the better. Starmie is a good choice, having a very high Speed and thus a high critical hit ratio, while also resisting all of Slowbro's moves. It's not a surefire counter though, and in case Starmie prevails, it won't like having to eat a Thunder Wave. Gengar makes a good choice too, having a high critical hit ratio and being able to Explode for around 50% damage when it's about to be KOed. However, it doesn't resist Surf and is weak to Psychic. Zapdos and Jolteon have the luxury of getting STAB in their Electric-type attacks; even when Slowbro is at +6, their Thunderbolts will still do significant damage. They also have a high critical hit ratio, but like Gengar, they don't resist Surf, and, unlike Gengar, can't Explode.</p> <p><strong>Explosion users: Explosion makes a very viable choice for taking Slowbro down when you have no other option. No user can OHKO a healthy Slowbro, but many put it in the KO range of Tauros's Hyper Beam or Rhydon's Earthquake. Pokemon with Explosion or Self-Destruct include Exeggutor, Snorlax, Golem, Cloyster, and Gengar, although Gengar's Explosion is weaker. A Resting Slowbro that gets Exploded on is pretty much a dead Slowbro.</p> <p><strong>Strong Physical Attackers: Amnesia Snorlax will often defeat Slowbro, as its Body Slam is an almost guaranteed 4HKO while Slowbro's Surf only manages a 5HKO when both are at +6. Due to the Speed tie, a 4HKO could turn into a 3HKO, depending on who goes first the turn Slowbro uses Rest. If Snorlax is packing Thunderbolt instead, it will fare even better, 3HKOing Slowbro after both have set up. As far as the physical side goes, Rhydon makes a surprisingly viable option, although risky as well; it has to switch in when Slowbro uses Rest, and then try to 3HKO it with its STAB Earthquake, which will happen around 75-80% of the time. Tauros needs a critical hit Body Slam to get the chance to 3HKO it after finishing it off with a Hyper Beam. If Tauros gets paralyzed, though, you can pretty much forget about beating Slowbro. Snorlax's critical hit ratio is much smaller than Tauros's, but its Body Slam is almost a guaranteed 4HKO, and has an easier chance if Body Slam paralyzes Slowbro. For instance, if Snorlax moves first while Slowbro tries to use Rest, but moves last on the previous turn that Slowbro Rested, Snorlax beats Slowbro with only Body Slam. Both Tauros and physical Snorlax should really be careful when trying to counter Slowbro and should generally only be sent in when Slowbro is sleeping because they will otherwise fall to previously-boosted Surfs more often than not. If Slowbro's set contains Reflect, though, trying to counter it with physical attacks becomes impractical unless you are willing to sacrifice at least two Exploders. In this case, however, any unparalyzed Thunderbolt user becomes a much more effective check, including the slow ones, such as Chansey and Lapras, which, despite their low critical hit rate, will get more chances to fish for it, as it's much more likely that Slowbro is forced to Rest more often. Chansey and especially Starmie will get the chance to keep using their recovery move until Slowbro gets fully paralyzed, which is when they get the chance to use Thunderbolt. Starmie is much better at doing this because Recover outlasts Surf in terms of PP.</p> <p><strong>Razor Leaf users: Victreebel and Venusaur are known for having a guaranteed critical hit in their STAB signature move, Razor Leaf. They won't like switching into a Thunder Wave, and could be surprised and OHKOed by a boosted STAB Psychic, but, otherwise, either of the Grass-types can KO Slowbro when it is below 70% or 2HKO it while it is Resting.</p> <p><strong>Light Screen users: Starmie or Chansey packing Light Screen will completely counter Slowbro unless they get really unlucky with full paralysis. Light Screen is never seen on them, however, as it has no use outside of walling Slowbro.</p> <p><strong>Pressure</strong>: It's worth noting that Slowbro, as a Rest user, is one of those Pokemon that should be attacked whenever given the chance, because when it's Resting, you can apply a much higher and more effective variety of tactics to try to take it down. Exeggutor's Mega Drain and Alakazam and Jynx's Seismic Toss, for instance, may not do enough to kill Slowbro, but will cause some decent damage on it before being forced to switch out, which will force it to Rest earlier than desired.</p> ",
    "sets": [
      {
        "name": "Tobybro",
        "description": "<p>Everybody knows the set, but this doesn't make it less dangerous. Amnesia boosts Slowbro's decent Special, being able to reach the maximum 999 after three Amnesia boosts, letting Slowbro 2HKO Chansey with its STAB Surf at +6. Amnesia, like all boosting moves, also has the great side effect of further reducing the speed of paralyzed enemies, allowing Slowbro to muscle through paralyzed would-be walls a lot more easily. When playing Slowbro, it's really useful to know some significant damage rolls or otherwise have a damage calculator handy. As said, Slowbro has a good chance of 2HKOing Chansey but must be at +6. The same can be said about Starmie, although a base 999 Special STAB Surf is a guaranteed 2HKO. On the other hand, Starmie is much more of a problem for Slowbro due to having a much higher critical hit ratio. Beating Tauros is about using Amnesia once and then 2HKOing it with Surf, although a +4 Slowbro stands a good chance of OHKOing Tauros. Snorlax, however, requires Slowbro to use Amnesia twice to get the 2HKO; a +6 Surf almost never OHKOes Snorlax. Zapdos also requires two Amnesia boosts, while Jolteon, like Tauros, is 2HKOed by a +2 Surf. Gengar will fall to two +2 Surfs half of the time, so it's generally advised to only use Amnesia once. Exeggutor and Lapras are 3HKOed by a +6 Surf; boosting either twice or three times is the way to go. All these calculations have been made considering that the opposition is at full health, so they may vary depending on the health of the opponent as well as on the situation of the battle itself.</p> <p>Having said that, using Thunder Wave first is almost always a good idea. Slowbro is tied with Snorlax as the slowest Pokemon in the game, so paralyzing Snorlax is also a good idea to guarantee Slowbro is faster than it or to fish for full paralysis. Against common Slowbro switch-ins, such as Starmie, Gengar, or Electric-types, Thunder Wave will have to be used as they switch in, so that you can get a boost before they are able to attack. However, it's generally advised to switch Slowbro back after paralyzing the switch-in to get the chance to move two consecutive times the next time they switch in. This way, you can maximize your chances of KOing said check before they are able to score a deadly critical hit Thunderbolt. Even if Starmie or Chansey paralyze Slowbro back in order to outspeed again, using Thunder Wave yourself first was the best move, because the chances of beating an unparalyzed Chansey and especially Starmie are slim, as they can just keep using Recover or Soft-Boiled until Slowbro gets fully paralyzed and they get a chance to use Thunderbolt. An unparalyzed Starmie can also attempt to PP stall Slowbro out of Surfs as well.</p> <p>Rest is perfectly suited for Slowbro. During the setup, Slowbro generally takes some residual damage and gets paralyzed, but Rest can keep Slowbro healthy and free of status. After maximizing its Special, no special attack can get past Slowbro's Rest without a critical hit, and due to Slowbro's great Defense and lack of exploitable physical weaknesses, it's going to be hard to beat Slowbro from the physical side without Explosion. Tauros, for example, needs a critical hit Body Slam and Hyper Beam to 3HKO Slowbro, which is the only way it has to get past Rest; furthermore, if Tauros gets paralyzed, its chances of beating Slowbro become very small. Snorlax, meanwhile, will generally have to resort to Self-Destruct to take Slowbro down. Rhydon has the luxury of being able to 3HKO Slowbro with its powerful STAB Earthquake most of the time, but will have to switch into the predicted Rest and is OHKOed by even a +0 Surf. As said, Explosion makes a good way to eliminate Slowbro, but an Explosion might not even guarantee that a full health Slowbro goes down or gets revenge killed easily due to Slowbro's already mentioned great Defense. Exeggutor's Explosion, for instance, will only hit Slowbro for around 60%. Lowering Slowbro to around 80% or forcing it to Rest first is the safest way to ensure that one Explosion is enough to let a physical attacker, such as Tauros, Golem, Rhydon, or Persian, to revenge kill it safely.</p> <p>Psychic is a STAB alternative to Surf, and trades 5 extra power for a 30% chance of scoring a Special fall. As far as type effectiveness is concerned, Psychic gains a neutral hit against Lapras and Cloyster and a super effective hit against Gengar and Victreebel, three of which are effective Slowbro checks, but loses the neutral hit against Alakazam as well as the ability to OHKO Golem and Rhydon at +0, needing two Amnesia boosts to OHKO them. Seismic Toss Alakazam, in particular, will have the opportunity to force you to Rest before Slowbro is able to get past it. Psychic's lower PP could also be a problem against users of recovery moves, especially considering that, without Surf, Alakazam will also require more time to take down. It could also be an issue if your opponent keeps using Recover or Soft-Boiled and gets lucky with full paralysis. Having 8 fewer PP could also be significant in an odd Slowbro war.</p> <p>Reflect is a possible alternative to Thunder Wave, as it doesn't change the general concept of the set, but changes the way it works in some way and some of its counters. The first thing to notice is the loss of Thunder Wave, which will be problematic in several match-ups. Unless you can paralyze Starmie with another Pokemon, it will hard counter Slowbro. Other specially based Pokemon, such as Chansey, Lapras, Gengar, and Electric-types will also become more problematic if you can't paralyze them; they will have a higher chance of scoring a critical hit Thunderbolt, as they will move first and avoid possible full paralysis. Lastly, Victreebel and Venusaur will have nothing to worry about a Slowbro lacking Thunder Wave unless its attacking move is Psychic. Letting Victreebel in for free could get especially problematic if it's packing Wrap.</p> <p>The reward of using Reflect comes from the physical side. It almost ensures that none of Snorlax, Golem, and Rhydon will have a chance to take Slowbro down due to their low critical hit rate. Tauros will have a lot of difficulties too, needing two critical hit Body Slams to beat Slowbro while it Rests. Reflect is also great for weakening Explosions, which is one of the most common and \"safe\" ways of getting rid of Slowbro; even Snorlax's Self-Destruct will only manage around 40% damage. Reflect makes double Explosions necessary to lower Slowbro to the point where it can be revenge killed, which, for the opponent, involves sacrificing at least two Pokemon.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 53302, "username": "Jorgen"}, {"user_id": 21345, "username": "M Dragon"}, {"user_id": 19, "username": "Hipmonlee"}]}, {"name": "Grammar checked by", "members": [{"user_id": 40064, "username": "NixHex"}, {"user_id": 108993, "username": "Jellicent"}]}], "writtenBy": [{"user_id": 42885, "username": "Crystal_"}]}
  },
  "Dodrio": {
    "overview": "<p>Being extremely fast and hitting as hard as Snorlax, Dodrio can be a frightening foe in RBY OU, acting as a strong revenge killer and late-game sweeper. Its offensive prowess is no joke, with Body Slam + Hyper Beam 2HKOing many Pokemon in the tier, including Chansey and Starmie. With STAB Drill Peck under its belt, Dodrio has the potential to even OHKO Exeggutor with a critical hit, as well as play around Counter users like Chansey. When used alongside Tauros, Dodrio is very capable of tearing holes in the opposing team that can leave it ripe for exploitation from its teammates.</p> <p>However, Dodrio is by no means a standard, and there are many reasons why. For starters, it is extremely frail, struggling to even stomach neutral hits and being OHKOed by Zapdos, Articuno, and even Cloyster. This fragility, combined with paralysis incapacitating it, makes it very difficult to utilize outside of late-game scenarios, which many teams will struggle to facilitate. Furthermore, similar to Zapdos, Dodrio is completely hopeless against Rhydon, getting effortlessly stonewalled. Finally, like many Normal-type attackers, Dodrio is strictly outclassed by Tauros, which possesses superior coverage and Speed; ergo, Dodrio must be used alongside it. Overall, while it has merit, Dodrio's flaws make it difficult to recommend for conventional RBY OU teams.</p> ",
    "sets": [
      {
        "name": "Agility Sweeper",
        "description": "<p>Dodrio is fairly straightforward, aiming to simply deal as much damage as possible while not sustaining damage or paralysis itself. Body Slam makes Dodrio extremely difficult to switch into, with the paralysis chance ruining faster Pokemon like Alakazam and Starmie while leaving them wide open to a KO the following turn. Drill Peck allows Dodrio to duel Gengar and Exeggutor far more effectively; it also does not enable Counter, which lets Dodrio scout users like Chansey while not losing any offensive pressure. Hyper Beam can potentially OHKO Jynx and Alakazam, as well as secure 2HKOs on Chansey and Starmie in tandem with Body Slam. With critical hit Hyper Beam, Dodrio can 2HKO any Pokemon in the tier barring Rhydon after a Body Slam. Finally, Agility allows Dodrio to outrun the entire unboosted metagame, giving it a more secure late-game sweep, while bypassing the Speed drop from paralysis.</p> <p>Dodrio's movepool is quite barren, but it has some niche options worth exploring. While it doesn't protect from status in RBY, Substitute is a viable choice to scout for free turns, such as the opponent switching or full paralysis, allowing Dodrio to stomach harder hits than it otherwise could. However, Substitute's HP cost makes Dodrio much easier to revenge kill later, cutting into its already poor bulk. Mimic is a serviceable option, giving Dodrio a potential coverage move like Earthquake to better handle Rhydon, but is extremely unreliable.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 233818, "username": "Enigami"}, {"user_id": 265630, "username": "Amaranth"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 236353, "username": "Plague von Karma"}]}
  },
  "Cloyster": {
    "overview": "<p>Cloyster is a Pokemon with coverage limited to STAB moves and Normal-type attacks, yet despite this, it has access to one of the most diverse toolsets in RBY OU. Through the use of Clamp, Cloyster can provide free switches to its teammates while also walling some of the most prominent physical threats, such as Snorlax, particularly those running Reflect, and Tauros. It possesses a reasonably powerful Blizzard, with the ability to threaten freeze on special walls, and has the option of using Explosion on Starmie to set up a Rhydon or Tauros sweep. Its part-Ice typing gives it immunity to freeze and STAB on Blizzard, at the expense of being weaker to Rock Slide. However, Cloyster has some drawbacks that stop it from being one of the top threats of RBY OU. Firstly, not being a Normal-type means it can be paralyzed by Body Slam, unlike Chansey or Snorlax. Secondly, Clamp's subpar accuracy could prove deadly to Cloyster's pretensions, especially if it's paralyzed. Lastly, it needs to rely on Rest as means of recovery, which means it's going to remain completely passive for three turns whenever it wants to recover HP.</p> ",
    "comments": "<h1>Other Options</h1> <p>The options listed give Cloyster the best tools to perform its roles effectively, so other options should generally not be considered. Reflect could be used in place of Clamp or Explosion to wall Normal-types even more reliably, but Cloyster loses on one of its key supporting roles when doing so and the extra bulk is generally not needed. Ice Beam is an option, though the drop in power is noticeable; most notably, Snorlax is 4HKOed instead of 3HKOed with Blizzard, but the added PP can come in handy in longer games where neither player manages to break the opponent. Toxic, when combined with Clamp, can allow Cloyster to wear down the special walls that usually threaten it with higher degrees of efficiency; however, it's difficult to justify making space for it when all of Cloyster's default moves are so valuable. Paralysis is generally very efficient at enabling Clamp chains and already present on virtually every RBY team anyway.</p> <h1>Checks and Counters</h1> <p><strong>Water-types: Starmie is the premier Cloyster counter; it takes virtually no damage from Clamp or Blizzard and is able to Recover any damage done effortlessly. It can also cripple Cloyster with Thunder Wave or do heavy damage to it with Thunderbolt or Psychic. However, it must watch out for Explosion, as it can be KOed if not at full health. Lapras or an opposing Cloyster can also completely shrug off Cloyster's attacks, and the former can threaten a powerful Thunderbolt or even Sing. It should be noted that if these Water-types are paralyzed they struggle considerably more, as Cloyster will now be faster, allowing it to use Clamp and switch out safely, with the only danger being the unlikely case of a Clamp miss coupled with lack of full paralysis.</p> <p><strong>Special Walls: Chansey and Alakazam can also shrug off Blizzard relatively easily thanks to their high Special bulk and easy, accessible recovery; however, if they are paralyzed, Cloyster has the option to partial trap them with Clamp to deny their recovery and switch out freely. They are also very vulnerable to Explosion, meaning that they have to tread carefully when attempting to take on Cloyster.</p> <p><strong>Electric types: Electric-types such as Jolteon and Zapdos outspeed and 2HKO Cloyster. They must be wary of switching in, though, as Blizzard threatens significant damage, especially to Zapdos.</p> <p><strong>Slowbro: Slowbro can switch in on Cloyster with impunity, cripple it with Thunder Wave, and start setting up on it. If it's carrying Reflect, it's even worse, as Cloyster does a measly 30% to it with Explosion after Reflect has been set up. Slowbro is even more dangerous for Cloyster if it's packing Psychic; a +4 Psychic is already more than 50% likely to OHKO Cloyster. Thus, Cloyster is forced to use Clamp and then switch out as soon as Slowbro enters the field. This is risky and predictable due to the low accuracy and imminent threat that Slowbro poses.</p> <p><strong>Thunderbolt Tauros</strong>: If Tauros chooses to run the rare Thunderbolt instead of the standard Earthquake, it can lure in Cloyster and seriously cripple it, especially if Cloyster is already caught in Rest cycles or suffers a critical hit.</p> <p><strong>Victreebel</strong>: Victreebel Speed ties with Cloyster and can do at least 85% damage with Razor Leaf. However, it's a shaky check at best, as it's also 2HKOed by Cloyster's Blizzard.</p> <p><strong>Gengar</strong>: Though it does not particularly enjoy switching into Blizzards, Gengar does not suffer Clamp much, outspeeds Cloyster, and threatens a 2HKO with Thunderbolt. It is also able to completely nullify Explosion, though this is reliant on prediction.</p> <p><strong>Jynx</strong>: Jynx enjoys switching into Cloyster's attacks and threatening it with Psychic. It is faster, making it a good switch-in to Clamp, and can use Cloyster's weaker attacks to its advantage to wake up after a Rest.</p> ",
    "sets": [
      {
        "name": "Standard",
        "description": "<p>This is Cloyster's best set and the one you should expect when you see it. Clamp provides a free switch to another teammate. It also does respectable amounts of damage due to having a higher Base Power than similar moves such as Wrap as well as being boosted by STAB. Blizzard is Cloyster's best attacking option, a powerful STAB move that only Ice-resistant Pokemon such as Starmie and Lapras or special walls such as Chansey and Alakazam can handle; it also has a possibility of scoring a freeze. Explosion allows Cloyster to act as a wallbreaker once its support capabilities are no longer needed, blowing up on a Pokemon such as Starmie or Chansey and allowing a sweeper to perform its job more easily. For the third move, Rest is the the most common option by far, as it allows Cloyster to perform its walling duties much more easily. However, Hyper Beam can also be used if the team favors the possibility of doing extra damage to Chansey. It is also the best option on dedicated Wrap teams, since they can't afford to lose any momentum, but those teams tend to be inconsistent and are thus rarely seen.</p> <p>Cloyster provides unique utility to RBY teams in that it provides the user with a sturdy Tauros answer, something that very few other Pokemon in the tier can do. Therefore, despite being an excellent Pokemon to lure in and KO walls like Starmie and Chansey through Explosion, it is often best to preserve Cloyster for the later stages, until the opposing Tauros has been crippled enough for Cloyster's defensive prowess to be superfluous. However, Cloyster is not simply a late-game Tauros answer; its positive matchup against Snorlax also gives it plenty of positional utility in the early stages, especially when combined with Clamp to gain free and safe switches. Managing Cloyster's health demands making many tricky decisions: switching in on Snorlax or using Explosion on Chansey early on may seem like great propositions, but they will weaken your team against the opponent's Tauros, so it is necessary to think about your long-term plans whenever you expose Cloyster to danger.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 424525, "username": "FriendOfMrGolem120"}, {"user_id": 51373, "username": "Nails"}]}, {"name": "Grammar checked by", "members": [{"user_id": 297659, "username": "deetah"}, {"user_id": 232216, "username": "The Dutch Plumberjack"}]}], "writtenBy": [{"user_id": 123746, "username": "Sceptross"}, {"user_id": 265630, "username": "Amaranth"}]}
  },
  "Gengar": {
    "overview": "<p>At first glance, Gengar appears to be a dangerous special sweeper thanks to its high Special Attack and Speed. However, Gengar's main role is to directly switch into Normal-type attacks like Body Slam, Hyper Beam, and Explosion as well as hard wall Wrap users and Persian because of its rare Ghost typing. It is also the fastest sleep inducer in the game with Hypnosis and can hit everything in the metagame for neutral damage thanks to Night Shade. From there, it can chip the foe with consistent damage or dent defensive switch-ins with Explosion. While all of these attributes are extremely appealing, keep in mind that Gengar has its fair share of shortcomings. For example, Hypnosis has shaky accuracy, so if it misses, it leaves Gengar open to attacks or being afflicted with status itself. Despite its great Ghost typing making it immune to Normal-type attacks, Gengar's secondary Poison typing leaves it weak to common coverage moves like Earthquake and Psychic, which most Pokemon in OU carry. Gengar also lacks a useful STAB move to nail Pokemon it should be able to hit for super effective damage such as Alakazam, Exeggutor, and Jynx. Its rather weak defenses and defensive typing on top of Hypnosis's shaky accuracy force Gengar to have slight competition with Exeggutor and Jynx as a sleep inducer, but Gengar is much faster than both of them and not as vulnerable to Blizzard and Explosion.</p> ",
    "comments": "<h1>Other Options</h1> <p>Mega Drain can be used to 2HKO Rhydon and Golem after Gengar puts them to sleep. Keep in mind that this only works if Gengar lands a Hypnosis or on a predicted switch, as Earthquake from these two will OHKO Gengar, and Mega Drain has little utility outside of this role. Confuse Ray can make Gengar more annoying to deal with, especially against paralyzed foes like Alakazam. Counter seems like an odd choice, since Gengar is already immune to Normal-type attacks. However, if Gengar comes in after your opponent uses Explosion, and if you can predict the opponent bringing something in that Gengar forces out, Counter will heavily dent something on the switch. Submission can be used to deal more damage to Chansey, especially after it has been put to sleep. Seismic Toss is an alternative to Night Shade, as it has 8 more PP at the cost of leaving Gengar susceptible to Counter. Hyper Beam is a decent option to pressure a paralyzed Alakazam or Jynx, as Gengar can really only use Explosion successfully on these Pokemon. Psychic can be used to get Special drops to reduce the Speed of paralyzed foes even further and allow paralyzed Pokemon of yours to outspeed them. It could also be decent against Rest variants of Snorlax trying to stall Gengar. In both instances, however, Thunderbolt usually does enough damage to these Pokemon.</p> <h1>Checks and Counters</h1> <p><strong>Psychic-type Pokemon: Alakazam is one of the best ways to stop Gengar, as it is faster, can cripple Gengar with Thunder Wave, and can use Psychic to always 2HKO Gengar. Alakazam does have to be cautious if Gengar uses Explosion, as it has a chance to OHKO Alakazam. Exeggutor can thwart Gengar thanks to its own Sleep Powder and Psychic. Jynx can also be an issue; Gengar does outspeed it, but Jynx can inflict heavy damage if Gengar misses Hypnosis, meaning it may need to use Explosion to do anything to Jynx.</p> <p><strong>Chansey: Chansey can force Gengar out because it usually carries Thunder Wave to paralyze it and can take any attack from Gengar barring Explosion on a critical hit. A healthy Chansey does have to be cautious of Hypnosis, however.</p> <p><strong>Rhydon and Golem</strong>: Rhydon and Golem threaten Gengar because they are immune to Thunderbolt, resist Explosion, and can OHKO it with Earthquake.</p> <p><strong>Paralysis</strong>: Even though it's immune to Body Slam, Gengar absolutely does not want to be paralyzed by Thunder Wave. Starmie, Zapdos, and Jolteon are some of the Pokemon that can carry the move.</p> <p><strong>Tauros: Tauros Speed ties with Gengar and can 2HKO it with Earthquake. However, Tauros has no form of recovery and generally doesn't like switching into attacks.</p> <p><strong>Snorlax</strong>: Snorlax takes very little damage from Gengar's Thunderbolt, and Earthquake threatens to 2HKO in return.</p> ",
    "sets": [
      {
        "name": "Sleep Inducer",
        "description": "<h1>Set Description</h1> <p>Hypnosis is Gengar's status move of choice, as it can cripple foes with sleep. Night Shade hits every single Pokemon in the metagame for 100 damage, providing important chip damage on Pokemon like Exeggutor, Rhydon, and Chansey. Thunderbolt is used mainly to hit Water-types such as Starmie, Slowbro, and Lapras for a decent amount of damage while doing the most damage to Snorlax and Tauros outside of Explosion. Explosion should primarily be used against Pokemon that Gengar can have issues beating, such as Alakazam and Chansey. It also can dent Exeggutor, Snorlax, and Tauros.</p> <p>Gengar can be used as a lead for its positive matchup against the relatively uncommon slower sleepers such as Jynx, Exeggutor, and Chansey, but it does have shaky matchups against faster Thunder Wave leads like Alakazam and Starmie, as it really dislikes being paralyzed. Gengar can also directly switch into and counter Wrap users such as Victreebel and Dragonite without Thunder Wave, making them much less annoying. Once a foe is asleep, Gengar can switch out to a teammate that can better handle the sleeping threat, or it can proceed to chip the foe down with Night Shade. Gengar should try to stay healthy throughout the match so it can take on Normal-types much more easily. If Gengar's health is low, it can be a good idea to use Explosion, as this move does considerable damage to anything that doesn't resist it and has a chance to OHKO Alakazam. Explosion can also severely dent a threat that Gengar's team may struggle with, making it much easier to deal with. Gengar can also function as a solo sweeper, as Thunderbolt has decent neutral coverage and can break certain sleep absorbers such as Starmie. Gengar's Hypnosis will bait paralyzed Alakazam and Chansey in, so using Explosion is a good way to get rid of them. This way, another sleeper in the back won't have to worry about a paralyzed foe blocking their sleep-inducing move.</p> <p>Gengar can fit on a myriad of teams thanks to its unique attributes, but that doesn't mean that it can sweep entire teams without support. Running an extra sleep inducer such as Exeggutor or Jynx is unorthodox, but it can be beneficial. Exeggutor can also help stomach incoming Earthquake, and both of them can take Psychic aimed at Gengar.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 265630, "username": "Amaranth"}, {"user_id": 424525, "username": "FriendOfMrGolem120"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "The Dutch Plumberjack"}, {"user_id": 336073, "username": "Rabia"}]}], "writtenBy": [{"user_id": 239732, "username": "JustoonSmitts"}]}
  },
  "Hypno": {"sets": [{"name": "Sleeper"}]},
  "Kingler": {
    "overview": "<p>Kingler is the strongest Pokemon with access to the combination of Swords Dance and Hyper Beam, possessing a dizzying base 130 Attack. This gives Kingler cataclysmic wallbreaking potential, outright OHKOing Chansey given the chance. It also has exclusive access to Crabhammer, which will nearly always land a critical hit, largely making up for its mediocre Special. Kingler isn't exactly slow relative to RBY OU either, being just above Cloyster and Victreebel. This means it isn't completely reliant on paralysis support and is very capable of mowing down teams without it. Overall, while an uncommon threat, Kingler is very capable of running over weakened teams if given a mere turn to set up. Even if it doesn't get a full sweep, the holes Kingler can tear in a team can be more than enough for its teammates to finish the job.</p> <p>So why isn't Kingler often seen on the big stage, fighting tooth and nail with Kanto's finest? Kingler's sweeping prospects are swiftly put down by paralysis, and this weakness often forces it out, causing it to forfeit any Swords Dance boosts it may have gained beforehand. Kingler's special bulk is also a pressing issue, with even neutral hits like Alakazam's Psychic 2HKOing it. Furthermore, its weakness to Electric-type attacks makes Pokemon like Starmie a royal pain, often causing it to be KOed even at around 75%. These factors make it deceptively difficult to find an opening for Kingler to sweep, and it therefore requires an experienced player to be successful.</p> ",
    "comments": "<h1>Other Options</h1> <p>Generally, Kingler should never drop any move other than Body Slam, and even this is very difficult to justify. Stomp is a potential choice, allowing Kingler to take a paraflinch approach, but it mandates far more team support to work, which teams can't always afford.</p> <h1>Checks and Counters</h1> <p><strong>Gengar</strong>: While Kingler can deal sizable chip to Gengar with Crabhammer to prevent it from repeatedly switching in, Gengar KOes Kingler with Thunderbolt if it has taken any amount of damage. Furthermore, Gengar has ample opportunity to switch in on Kingler's Normal-type attacks and force sleep on the player's team, as it's immune to them.</p> <p><strong>Electric-types</strong>: Zapdos can switch into Hyper Beam or Crabhammer and subsequently OHKO Kingler with Thunderbolt; for Kingler to win, Zapdos has to have been chipped and paralyzed prior, and even then, it requires a +2 Hyper Beam. Much of the same applies to Jolteon, although it is OHKOed by a +2 Hyper Beam and takes very high damage from Body Slam. Furthermore, if Jolteon is asleep, it is nothing more than setup fodder for Kingler.</p> <p><strong>Paralysis: Kingler is thoroughly debilitated by paralysis, as it can no longer mow down paralyzed teams and its poor special bulk becomes much more apparent. The threat of paralysis can make setting up with Kingler quite difficult, as it's very possible for Kingler to be paralyzed on the turn that it attempts Swords Dance. Pokemon like Exeggutor and Zapdos can easily switch in and threaten it with their paralysis-inducing moves, forcing Kingler out if it can't KO them first. Paralysis from Body Slam can be a particularly depressing experience for any Kingler player, especially when attempting to wrestle down Pokemon like Snorlax and Tauros, so this warrants consideration in prolonged interactions. Pokemon like Lapras and Victreebel become much better Kingler checks if it's paralyzed, as they can outspeed and KO it with super effective hits without fear of Hyper Beam. Reflect Chansey can also be problematic, as it effectively invalidates Kingler's Swords Dance boost and threatens it with Thunder Wave.</p> <p><strong>Faster Special Attackers: Kingler is extremely frail specially, which makes many special attackers suitable Kingler checks, especially when attempting to revenge kill it. Switching these Pokemon in on a Swords Dance can put Kingler into a fairly awkward position as well. Alakazam and Starmie can paralyze Kingler while threatening it with 2HKOs from their strong special attacks. In fact, even Tauros and Chansey can adapt with Thunderbolt to 2HKO Kingler. However, few of these Pokemon want to actually be attacked by Kingler themselves; if they are paralyzed and Kingler has set up, with the exception of Tauros and sometimes Starmie, these Pokemon can be OHKOed by +2 Hyper Beam.</p> <p><strong>Physically Bulky Foes: While a +2 Hyper Beam from Kingler is strong, there are Pokemon that can handle it surprisingly well while paralyzing it in return. Slowbro can switch in and paralyze Kingler and doesn't mind stomaching a +2 Hyper Beam if it means stopping a sweep. However, a +2 Body Slam followed up by Hyper Beam has good odds to KO Slowbro. Lapras can easily take a Hyper Beam from Kingler while threatening with Thunderbolt afterward. Exeggutor can also take most hits Kingler can throw at it and threaten with status or a 2HKO from Psychic, though it can take massive damage in the process—or even get KOed if it has taken prior damage—if Kingler has boosted with Swords Dance. Finally, if push comes to shove, Cloyster can switch in and use Explosion, though it can't do anything else lest it become setup fodder.</p> ",
    "sets": [
      {
        "name": "Swords Dance",
        "description": "<h1>Set Description</h1> <p>Swords Dance is Kingler's claim to fame, allowing it to boost its Attack and wreak havoc. Using it also allows Kingler to reapply a foe's Speed drop from paralysis, which helps if Kingler has been paralyzed itself. +2 Hyper Beam can OHKO Chansey, Jynx, Jolteon, and Alakazam. It can also OHKO Starmie and Victreebel 30.8% and 56.4% of the time, respectively. The rest of the tier isn't far behind, with foes often crumbling if even a third of their HP has been chipped off. Body Slam lets Kingler deny switch-ins by the threat of paralysis, allowing it to be more self-sufficient rather than mandating team support; if a Pokemon is paralyzed on the switch after Kingler has boosted, a +2 Hyper Beam will likely follow for the KO. Crabhammer allows Kingler to OHKO Rhydon and 3HKO Gengar, the latter of which is immune to Kingler's other attacks, making Crabhammer valuable to prevent it from repeatedly switching in. It also allows Kingler to 3HKO Snorlax 87.2% of the time, allowing it to muscle past Reflect sets. It should be noted that Crabhammer isn't just some better Slash, though; it has some very unfortunate accuracy issues, and a single miss will most likely be Kingler's undoing.</p> <p>Kingler should be kept until late-game when the opposing team has been weakened or riddled with paralysis. This gives it the best chance of setting up successfully and serving as a wincon. If an entire team has been paralyzed, Kingler will happily take a hit if it means blowing the opposition away. Finding an opportunity to set up can be difficult, though; the best way is to punish a Pokemon using Rest, such as Snorlax or Jolteon. However, simply exploiting weakened, paralyzed Pokemon also gives a worthy payoff. Kingler should ideally be paired with an Electric-type like Zapdos or Jolteon, as they can beat Kingler's primary counters in opposing Electric-types, Starmie, and Slowbro. More offensively, an Electric-type is also a perfect way to lure Rhydon in for Kingler to either set up on or cleave through, which can instantly mean a win with its Electric-type ally in the back.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 123746, "username": "Sceptross"}, {"user_id": 265630, "username": "Amaranth"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}, {"user_id": 240732, "username": "Estronic"}]}], "writtenBy": [{"user_id": 236353, "username": "Plague von Karma"}]}
  },
  "Exeggutor": {
    "overview": "<p>Once widely considered to be the fourth best Pokemon in the RBY metagame as well as the best sleeper available, Exeggutor has recently suffered a drop in reputation and viability, though it remains a popular choice. A combination of Explosion, Sleep Powder, and Psychic, in addition to unique typing and solid base stats, makes it an easy pick for a large number of RBY teams. Despite the unfortunate Ice weakness, its resistance to Ground-type attacks makes it one of the most reliable Rhydon switch-ins; it is also the most reliable answer to the uncommon but threatening Slowbro. A combination of defensive utility and wallbreaking power earns Exeggutor a spot on many RBY teams; however, teams that already feature other sleepers may find it redundant, and its inability to recover damage can make it undesirable to some teams.</p> ",
    "comments": "<h1>Other Options</h1> <p>Exeggutor has a large movepool that can allow it to fill different roles, but none of the following options has seen high-level success in in any combination. Exeggutor can use Rest to get consistent value out of its strong Psychic and Stun Spore, as well as consistently check opposing Exeggutor, Rhydon, Alakazam, Jolteon without Pin Missile, and Blizzard-less Starmie variants throughout a game. However, this often invites in offensive behemoths like Tauros for free, which makes it very difficult to justify over conventional, standard sets. Alternatively, Egg Bomb hits as hard as Double-Edge and has no recoil, but its low accuracy makes it a generally inferior choice. Finally, Exeggutor has access to decent defensive and utility moves such as Reflect, Toxic, Leech Seed, and even Mimic, but these are often seen as strictly suboptimal.</p> <h1>Checks and Counters</h1> <p><strong>Starmie, Alakazam, and Jynx: These Pokemon are often on the receiving end of a turn 1 Thunder Wave, which makes them solid switch-ins to Sleep Powder, although they must watch out for aggressive predictions from the Exeggutor user. Although they are not fully reliable in all situations, they are often the best available option to safely switch in on Exeggutor, and should be able to threaten it with Thunder Wave or Blizzard while keeping themselves healthy to answer it repeatedly thanks to Recover or Rest.</p> <p><strong>Chansey</strong>: Exeggutor simply has no ways to consistently get through Chansey outside of Sleep Powder and Explosion, which come with their obvious limitations. A paralyzed Chansey leaves Exeggutor with no options other than to Explode, pray for multiple full paralysis + Special drops with Psychic, or switch out.</p> <p><strong>Exeggutor</strong>: Exeggutor can't really harm each other much, and unless one of the Exeggutor is able to land Sleep Powder on the other, this one-on-one matchup most often ends with one of the Exeggutor Exploding on the other to trade evenly.</p> <p><strong>Lapras and Zapdos</strong>: Although they are by no means switch-ins, Lapras and Zapdos threaten a 2HKO with Blizzard and Drill Peck respectively, while Lapras also outspeeds Exeggutor and is able to threaten it with Sing, which means that either of these Pokemon find themselves in a one-on-one against Exeggutor they are generally favored.</p> ",
    "sets": [
      {
        "name": "Sleeper",
        "description": "<p>Sleep Powder is an extremely threatening move, as incredibly dangerous Pokemon such as Tauros can switch on a sleeping Pokemon with little risk and cause havoc; counterplay to Exeggutor is often centered around absorbing it and containing its effects. Psychic is a powerful attack that threatens significant damage to anything other than special sponges, and is Exeggutor's main weapon against threats such as Snorlax. Explosion is an incredibly useful move that allows Exeggutor to bring something down with it and can create incredibly favorable situations if used correctly; however, the user must be careful of its Explosion being too predictable, as there are a number of ways to neutralize it, such as with Rock- or Ghost-type Pokemon, or sacrificing a Pokemon already affected by a strong status condition such as sleep or freeze. The fourth slot is the most contentious, as none of the four moves listed clearly outshine the other options. Double-Edge is a strong attack capable of breaking down paralyzed Jynx or Alakazam with minimal previous damage, an excellent tool to have at your disposal because both of these Pokemon commonly switch in on Exeggutor to absorb its Sleep Powder. Stun Spore allows Exeggutor to continue to cripple potential answers even after Sleep Clause is activated; this is especially useful when facing teams with multiple special sponges. Despite Mega Drain's pitiful Base Power, it ends up being Exeggutor's best tool against Starmie, and while the move is otherwise relatively useless, Starmie is another very common answer to Exeggutor, so Mega Drain has its merits. Finally, Hyper Beam is capable of sniping Starmie, Alakazam, Jynx, and even Chansey if they have taken sufficient damage before attempting to switch in into Exeggutor, but it is entirely useless if they have not, and it can have terrible drawbacks if predicted correctly by the opponent; nevertheless, its utility against every common special sponge should not be underestimated.</p> <p>Thanks to this set, Exeggutor is able to answer tier titans such as Chansey and Snorlax and apply huge amounts of pressure on the opponent's team. While its lack of recovery and susceptibility to status makes it a fairly difficult piece to maneuver with, the options in its toolbox make it a difficult threat to answer. Exeggutor players should try to damage or KO paralyzed opposing Pokemon that are able to block Sleep Powder in order to clear the way for it, as landing a Sleep Powder is often game-changing. The easiest and most common ways to find opportunities to send Exeggutor out on the field are on a predicted Chansey using Soft-Boiled or Snorlax using Rest; the former will have to respect the Sleep Powder threat and switch out, while the latter is not only scared of the sleep threat, but also vulnerable to Psychic itself. Once Exeggutor is on the field, the threat that Sleep Powder poses generates strong momentum for the player using it, but it must be followed up by strong predictions to progress the game favorably; using Sleep Powder on an incoming paralyzed Pokemon is simply a wasted turn, but so is Double-Edge on a Snorlax. The stress of prediction can be eased by sending Exeggutor on the field before paralyzing any foes, such as by leading with it. Although landing Sleep Powder this way is much easier, it is also less rewarding due to having to absorb early pressure, status, or damage on Exeggutor.</p> <p>The last detail to touch on is the usage of Explosion. Although most players are tempted to keep Explosion as a tool to get value out of a low health Exeggutor, one should try to recognize when such a line of play might be too greedy. For example, in situations where Exeggutor would not be able to make much progress at all even with a full health bar, it can be advantageous to use Explosion earlier on, when it is harder to predict and therefore more likely to hit the intended target. However, you should be careful of your matchup against Rhydon when choosing to get rid of your Exeggutor early, as it can be very dangerous to get rid of your sturdiest defensive answer to it. It's also possible to use Explosion to get rid of a Sleep Powder answer for a secondary sleeper on your team, most commonly Lapras, but this is a last resort option only in most cases.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Earlier versions by", "members": [{"user_id": 42885, "username": "Crystal_"}, {"user_id": 142, "username": "Mr.E"}]}, {"name": "Quality checked by", "members": [{"user_id": 263906, "username": "Zokuru"}, {"user_id": 108993, "username": "Jellicent"}]}, {"name": "Grammar checked by", "members": [{"user_id": 331519, "username": "CryoGyro"}, {"user_id": 53214, "username": "JockeMS"}]}], "writtenBy": [{"user_id": 265630, "username": "Amaranth"}]}
  },
  "Rhydon": {
    "overview": "<p>Rhydon possesses a very important place in RBY OU thanks to a fairly unique typing and formidable Attack stat; moreover, its Earthquake is the most powerful physical attack in the game without a drawback. Rhydon's typing gives it a good amount of defensive utility, such as switching in to force and punish Hyper Beam recharges, taking Explosions, staving off Thunder Wave, and stonewalling Zapdos and Jolteon. Thanks to the immense Attack stat it has, Rhydon can hit very high damage ranges, the most notable one being a guaranteed 2HKO on Chansey. It's also capable of KOing Tauros after two Body Slams from other Tauros. This power makes it very difficult to switch into, with would-be checks such as Exeggutor taking surprising damage. While initially slow, Rhydon is also a very scary foe for paralyzed teams to fight, often folding to it outright by virtue of its immense power. Naturally, this also means it appreciates paralysis support from teammates such as Chansey. It can still outspeed Slowbro and Snorlax, however, allowing it to force damage on non-Reflect variants of the two.</p> <p>Golem has competed with Rhydon for a place on teams for many years. This is primarily due to the fact that it has the second strongest Explosion in the game, only beaten by Snorlax, along with higher Speed to win against Rhydon specifically. However, its low HP leaves it without access to 101-HP Substitutes. This makes it significantly worse against Chansey, as they will break against its Seismic Toss. It also has little reward for the increased Speed, only gaining the ability to outrun Rhydon. The lower damage output also causes Golem to lose out on some very valuable ranges, notably losing to the aforementioned Reflect Chansey more often than not, which Rhydon excels against. Due to these factors, Rhydon is generally favored over Golem in the metagame.</p> ",
    "comments": "<h1>Other Options</h1> <p>Out of all of Rhydon's moves, the most replaceable would be Rock Slide. This is because the coverage provided by it is rather specific, while the other moves add key utility that is pivotal to Rhydon's success. When dropping Rock Slide, be wary of the fact that Earthquake is a 4HKO on Cloyster and a 3HKO on Lapras, and you'll have a much harder time versus Moltres and Articuno, though the two legendary birds are not that common. Should these qualities be useful, however, Body Slam can be dropped instead. In this case, though, Rhydon can't set up paralysis for itself, causing it to become much more reliant on teammates. This makes matchups against threats such as Starmie noticeably worse.</p> <p>Rest can be used to give Rhydon more longevity, but it's hard to wake up due to being 2HKOed by Tauros. It's generally used on more defensive teams to better handle Zapdos and Jolteon throughout a game, but it does have uses outside of this. Rest can be extremely helpful against Reflect Chansey, enabling Rhydon to be more aggressive and burn free Rest turns behind Substitute. It also helps against Snorlax without coverage, as Rhydon despises being paralyzed by Snorlax on switch-in. Another option to consider is Leer; this allows Rhydon to beat Reflect Chansey much more reliably and gives it a way to get past Reflect Snorlax. However, these Pokemon can switch out to get rid of the Defense drops. This also gives faster Pokemon the opportunity to switch in on the Leer while taking no damage, which can give the opponent opportunities to play around Rhydon's usual sweeping. When spamming Earthquake, on the other hand, a critical hit would ruin Reflect Chansey and Snorlax, and switching out would still likely force damage on whatever comes in. Counter can be used to more heavily punish Hyper Beam and Explosion usage, flipping the situation on the opponent. Bringing in Rhydon after an opponent's Explosion and using Counter after forcing their switch-in out can usually lead to a free KO. While gimmicky, Bubble Beam could be used for other Rhydon or Golem, which can lead to a Speed drop, guaranteeing a KO with Earthquake. It can also allow Rhydon to move first against Exeggutor on switch-in, which can allow Rhydon to situationally win the interaction should it be worn down.</p> <h1>Checks and Counters</h1> <p><strong>Exeggutor: Exeggutor is the best check for Rhydon in the game. It resists Earthquake and doesn't take much damage from Rock Slide, which is only a 4HKO. However, it must watch out for Body Slam. In fact, most variants of Rhydon will use Body Slam expecting an Exeggutor switch-in if it's still healthy. A paralyzed Exeggutor won't be able to reliably check Rhydon anymore, as two Rock Slides will deal upwards of 55% of damage to it.</p> <p><strong>Tauros</strong>: Tauros is only 3HKOed by Earthquake and can 2HKO Rhydon with Blizzard in return, which, when combined with Tauros's absurdly high critical hit rate and the chance of freeze, means that Rhydon is almost always forced out, and even if it doesn't switch out, there's a respectable chance that it does absolutely nothing in return. However, Tauros doesn't appreciate being damaged, especially if the Tauros on Rhydon's team is still at full HP. Rhydon will usually be forced out after KOing a Pokemon due to this, which gives Tauros ample opportunity to start exerting its sweeping prowess.</p> <p><strong>Cloyster</strong>: Cloyster is only 4HKOed by Earthquake and 3HKOed by Rock Slide, and it can OHKO a third of the time in return with Blizzard. It even packs Clamp for denying a free move to Rhydon when it's staying behind a Substitute, as Clamp will always break the Substitute and render Rhydon immobile in the process.</p> <p><strong>Starmie and Chansey</strong>: These two Pokemon are able to switch in on Rhydon and duel it, but only if they are not paralyzed, and Chansey requires Reflect. Chansey is 2HKOed by Earthquake, and Starmie, while very rarely 2HKOed by Earthquake, can be paralyzed by Body Slam on the switch or on a predicted Recover, turning the tides in Rhydon's favor. The paralysis factor makes these matchups extremely variable.</p> <p><strong>Victreebel</strong>: Victreebel outspeeds and OHKOes Rhydon with Razor Leaf. However, it takes a huge chunk of damage from Earthquake, with a likely roll to 2HKO.</p> <p><strong>Slowbro</strong>: Slowbro threatens to OHKO Rhydon with Surf, and with Reflect, it can effortlessly set up Amnesia against it. Thunder Wave can also be used on a switch prediction to worsen the situation. However, it does take significant damage coming in, making it a check at best.</p> <p><strong>Lapras and Jynx</strong>: These Pokemon can OHKO Rhydon with their Ice-type moves, but they struggle to switch in because of the threat of Rock Slide, as it will almost always 2HKO Lapras and always OHKO Jynx. Paralyzing them also turns these two Ice-type Pokemon into prey for Rhydon to feast on.</p> <p><strong>Golem</strong>: Golem outspeeds Rhydon and 2HKOes it with Earthquake. However, Rhydon also 2HKOes Golem with its own Earthquake, meaning Golem cannot switch in at all.</p> <p><strong>Reflect Snorlax</strong>: While Rhydon is only 3HKOed by Earthquake and Ice Beam, it struggles heavily when actually KOing Snorlax without critical hits if Reflect is active. Earthquake can deal up to 38% before Reflect goes up, but after that, the damage is negligible at best. Reflect Snorlax does give Rhydon a good amount of opportunities to fish for critical hits, so this matchup can be quite volatile. Snorlax also has issues switching in, making it a check at best.</p> ",
    "sets": [
      {
        "name": "Standard",
        "description": "<h1>Set Description</h1> <p>This is the set one should expect when seeing Rhydon. Rhydon's Earthquake is the strongest physical move in the game with no drawbacks, hitting anything that doesn't resist it extremely hard. Rock Slide is mostly used for Zapdos and hitting Pokemon such as Exeggutor, Cloyster, and Lapras harder. Body Slam is extremely valuable for Rhydon's success, as it allows Rhydon to generate its own paralysis support against the likes of Exeggutor, Starmie, Alakazam, and Lapras. Substitute is a complex move on Rhydon's moveset and one that is generally hard for inexperienced players to understand the true potential of, but it can single-handedly win games; its ability to create a 103-HP Substitute means that they can't be broken by Seismic Toss Chansey, which gives Rhydon the edge in the one-on-one against it. This also means that Rhydon can create Substitutes versus Pokemon that can't significantly damage it, such as Zapdos and Jolteon, giving it a free hit against whatever comes in afterwards, which can either instantly mean a win for the Rhydon user or dealing a huge chunk of damage to a replacement like Tauros. Substitute is also extremely helpful against paralyzed Starmie, giving Rhydon time to fish for full paralysis to stay in. Rhydon can then go for the uncommon 2HKO with Earthquake or even a possible OHKO with a critical hit. Should Starmie be paralyzed by Body Slam switching in, Rhydon is in a very good position to go for this.</p> <p>Despite being slow, it's very hard to switch into Rhydon if you lack Exeggutor, making it one of the key reasons for Exeggutor's success in RBY OU. It's an absolute nightmare for players to deal with Rhydon if they have a paralyzed team, as Rhydon will easily rampage through it. It's a very viable strategy in RBY OU to build a team around Rhydon, providing it with the paralysis support it needs to clean up the mess. Its key immunity to Electric-type moves, namely Thunder Wave, means that it's very hard to reliably paralyze Rhydon and also gives it switch-in opportunities on Pokemon such as Alakazam and Chansey. It is also the premier counter to Zapdos and Jolteon, two Pokemon that can be very dangerous in its absence—especially Zapdos—due to the few Electric-resistant Pokemon in RBY OU. Rhydon also resists Normal-type moves, which means it can switch into a predicted Explosion or Hyper Beam.</p> <p>Despite all of the advantages, Rhydon is heavily reliant on opposing Pokemon being paralyzed to get in safely. It has very poor Special; this and its typing can make it easy prey for almost every special attacker in the tier. As a result, Rhydon tends to struggle one-on-one against non-paralyzed threats, notably Tauros, Starmie, and Exeggutor.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 265630, "username": "Amaranth"}, {"user_id": 424525, "username": "FriendOfMrGolem120"}]}, {"name": "Grammar checked by", "members": [{"user_id": 241023, "username": "Kris"}, {"user_id": 240732, "username": "Estronic"}]}], "writtenBy": [{"user_id": 236353, "username": "Plague von Karma"}, {"user_id": 123746, "username": "Sceptross"}]}
  },
  "Chansey": {
    "overview": "<p>Chansey is a staple in the RBY metagame, present on nearly 100% of competitive teams. The reason for its extreme popularity mostly lies in its gargantuan special bulk neutralizing Psychic-types, an otherwise incredibly difficult task without using Psychic-types of your own, as well as its ability to completely wall other special attackers like Lapras. It does not perform as well against physical attackers, however; strong hits from the likes of Snorlax and Rhydon can threaten an easy 2HKO, so Chansey must be wary of these threats whenever entering the field, although it does possess tools to ease these matchups despite its generally innocuous offensive presence. Nonetheless, Chansey is somewhat of a requirement in any RBY team due to the risks you would take against Psychic-types without it.</p> ",
    "comments": "<h1>Other Options</h1> <p>While it is generally recommended to stick to the above combinations, Chansey is free to mix and match its options, with the only mandatory move being Soft-Boiled. Sets such as Counter + Sing or Thunder Wave + Seismic Toss, Reflect + Ice Beam + Thunderbolt, and Seismic Toss + Ice Beam + Thunder Wave can all perform admirably on the right team, so if you want to rebalance certain matchups for your team, feel free to explore different, less conventional ways to combine Chansey's best moves.</p> <p>Defense Curl is an option over Reflect in the typical Reflect set. Boosting Chansey's Defense past +2 usually makes little difference, but its 64 PP allow you to win PP wars against opposing Reflect Chansey and Snorlax handily as well as significantly increase Chansey's odds in a PP stall against Alakazam and Starmie, which is a useful advantage in its own right; however, Reflect's one-turn setup is significantly better when Chansey switches in on Snorlax, so it's generally preferred.</p> <p>Toxic is another curveball that synergizes well with partial trappers such as Cloyster, Moltres, or Victreebel, as the damage quickly stacks up on targets that would otherwise be able to endure their hits, such as opposing Chansey; also, a Chansey carrying Toxic should beat any Chansey that isn't carrying Ice Beam in the long run due to the damage from the poison.</p> <h1>Checks and Counters</h1> <p><strong>Snorlax: Snorlax's Body Slam 3HKOes Chansey, forcing it to keep using Soft-Boiled in most situations; as Body Slam's 24 PP outlasts Soft-Boiled's 16, Chansey cannot afford to outstall the attacks, especially when you also factor in the odds of critical hits as well as the potential Hyper Beam from Snorlax. Even when Chansey is carrying Reflect, a Snorlax with Rest is often not even forced to switch out, as it has really good odds of breaking through eventually between critical hits and PP count. The best option for Chansey is to force Snorlax to use Rest and then switch out to something that can threaten it while it's sleeping. While this is not an awful short-term scenario for the Chansey player, as the Snorlax will need some free turns to wake up, Snorlax can easily find those turns whenever Chansey hits the field again, putting it in yet another situation where it is bound to lose if it doesn't switch out. If the Snorlax carries Ice Beam, it can also attempt to freeze Chansey, and in the worst case for Snorlax, it can trade with Chansey by using Self-Destruct.</p> <p><strong>Alakazam and Starmie</strong>: Chansey has no way to significantly damage Alakazam, and while it won't be doing much damage back, it can win the PP war thanks to Recover's massive 32 PP unless it gets fully paralyzed several times in a row. Alakazam can also simply fire off Psychic until Chansey's Special drops low enough that it's forced to switch out, but Psychic's limited 16 PP means this can generally only happen two or three times per game. Starmie functions very similarly, as long as the Chansey doesn't have Thunderbolt.</p> <p><strong>Sleepers</strong>: Chansey will be healing up a lot throughout the game. If you can send a sleep move user such as Exeggutor out on a predicted Soft-Boiled, Chansey will have to respect the threat of Sleep Powder and switch out.</p> <p><strong>Chansey: Depending on the sets, Chansey can be an excellent Chansey counter. Ice Beam threatens to freeze any unparalyzed Chansey, while a paralyzed Reflect Chansey is going to PP stall most other Chansey with ease. Sing Chansey can also surprise the opponent's Chansey and land a sleep on it, and even if it misses, Sing will remain threatening and have to be respected with a switch.</p> <p><strong>Explosion Lures</strong>: Exeggutor, Cloyster, and Gengar can usually manage to get Chansey on the field to sponge one of their powerful special attacks and catch it with an Explosion to take it out. This is especially viable for teams running a Pokemon such as Lapras or Psychic-less Starmie, which are otherwise completely walled by Chansey.</p> <p><strong>Rhydon: While Rhydon has to respect the Ice Beam threat, its Earthquake achieves a guaranteed 2HKO, so it can sometimes accept taking the Ice Beam damage in exchange for a KO on Chansey. It's even better against Chansey sets that don't run Ice Beam, as it can create Substitutes with enough HP to tank two Seismic Tosses and use Earthquake freely. Both of these situations only really favor Rhydon if the Chansey is paralyzed, however, so make sure to set up its status properly before attempting to win with Rhydon.</p> <p><strong>Slowbro</strong>: If Chansey is not running Thunderbolt, Slowbro can freely get Amnesia boosts on it, periodically heal any damage with Rest, and eventually KO via the STAB move of choice as soon as Chansey gets fully paralyzed. Chansey should generally switch out of Slowbro whenever possible, as it can get very threatening very quickly otherwise.</p> <p><strong>Jolteon</strong>: If Jolteon carries Rest, it is able to repeatedly shrug off Chansey's attempts at damage until Double Kick critical hits and paralysis manages to take Chansey down. This leaves Jolteon very vulnerable during its Rest turns, so you should be careful when attempting this.</p> <p><strong>Tauros</strong>: If all else fails, Tauros can come in on a paralyzed Chansey and take it out with Body Slam followed by Hyper Beam, but Tauros really hates being paralyzed, so you should only use this option as a last resort.</p> ",
    "sets": [
      {
        "name": "Reflect",
        "description": "<h1>Set Description</h1> <p>Reflect halves the damage received from physical attacks, patching up Chansey's biggest weakness. Soft-Boiled is a necessity to allow Chansey to check threats and stay healthy throughout the game. Thunder Wave is necessary to punish any Tauros that may attempt to ruin your fun by negating Reflect with a critical hit; it's also generally strong utility and one of the most threatening tools in Chansey's arsenal. Seismic Toss is the preferred move to deal damage, as it hits for a consistent 100 HP, but Ice Beam, while resisted by many Pokemon, still threatens a deadly freeze on everything other than Ice-types. If you choose to rely on Ice Beam as your only attacking move, you will have to be careful not to paralyze Pokemon such as Starmie, as Chansey loses all offensive pressure against it without the possibility to freeze it.</p> <p>Reflect Chansey is one of the best early- and mid-game pivots, while also retaining good enough one-on-one matchups to remain a threat in the later stages of the game. This set's biggest selling point is the ability to switch into Snorlax's Body Slam without having to fear paralysis, allowing it to always set up Reflect, heal off all the damage with Soft-Boiled, and then safely chip away at the opposition via Seismic Toss. An important decision is going to present itself often when playing Reflect Chansey: letting it take a Thunder Wave will make it immune to freezes, allowing it to take on Ice Beam Chansey and win the PP war as well as making it a reliable answer to Exeggutor since it won't have to fear Sleep Powder anymore; however, this will make Chansey much less effective at switching in on Snorlax, and other threats such as Rhydon will also have a much better time against it. Managing the status of your Reflect Chansey is extremely important, and making the right decisions can often swing the tides of the game in your favor. It should be mentioned that a paralyzed Reflect Chansey will also have much more trouble facing Psychic-types due to the 30% chance of dropping its Special via Psychic; it is relatively easy for one of them to accumulate two or more drops and force it to switch out, thus removing Reflect and significantly weakening its effectiveness against physical threats for the rest of the game, unless it is given the free turns to set it up again.</p> "
      },
      {
        "name": "BoltBeam",
        "description": "<h1>Set Description</h1> <p>BoltBeam coverage allows Chansey to put pressure on a large part of the metagame. Thunderbolt threatens Water-type Pokemon such as Starmie and Lapras, while Ice Beam threatens to freeze opposing Chansey and deals heavy damage to other common threats such as Rhydon, Exeggutor, and Zapdos. Soft-Boiled is necessary to remain healthy throughout the game, and Thunder Wave is Chansey's main weapon to cripple threats like Tauros and hinder anything else that tries to beat Chansey one-on-one.</p> <p>BoltBeam Chansey will always have to be careful maneuvering around Snorlax, as it doesn't have the tools to face Snorlax one-on-one; this is especially true for Snorlax that carry Rest. BoltBeam Chansey often wants to get paralyzed so it can avoid freezes and sleep, but this makes the Snorlax matchup even worse, and since it's such a threatening Pokemon to begin with, you may want to be careful with accepting Thunder Wave on your Chansey. Another tough matchup is Alakazam, which can easily sponge all of Chansey's attacks and retaliate with repeated Psychic that will eventually cause multiple Special drops and force Chansey off the field; even if Alakazam runs out of Psychic PP, it can often win an all-out PP stall. However, BoltBeam Chansey has a much happier time against the other common Psychic users due to super effective coverage on both Starmie and Exeggutor. Ice Beam also allows Chansey to win against non-Ice Beam Chansey thanks to the freeze chance, so long as the opposing Chansey isn't paralyzed — when it is, this matchup turns around, as Ice Beam's relatively low 16 PP will usually cause BoltBeam Chansey to lose the PP war.</p> "
      },
      {
        "name": "Sing",
        "description": "<h1>Set Description</h1> <p>Sing is one of the premier Chansey sets. Although the high risk of missing may appear dangerous, Chansey is unlikely to take much punishment in return from any special attacker, so it is a common and successful strategy to simply switch Sing Chansey on a Pokemon like Starmie very early on and put it to sleep immediately. As Soft-Boiled is mandatory, using Sing leaves two moveslots open, usually to be filled with one attacking move and one utility move. The most common attacking move is Ice Beam, as the freeze threat is quite potent against most special attackers, which cannot harm Chansey all that much. However, running Ice Beam as your only damaging move leaves Chansey entirely toothless against Ice-types such as Jynx, Cloyster, and Lapras, so you may want to opt for Seismic Toss instead. As for the utility move, Thunder Wave is handy to cripple various threats, most notably physical attackers that pose an urgent threat to Chansey but really dislike being paralyzed, such as Tauros. Counter, on the other hand, is a specific tool to take care of Snorlax. Due to Chansey's gigantic HP stat, it will OHKO Snorlax after taking a single Body Slam, which is Snorlax's go-to STAB move and main way to damage Chansey. Once Counter is revealed, Snorlax can use moves that Counter can't reply to, such as Earthquake and Ice Beam, and then switch out to a more appropriate check; this means that it is of vital importance for Chansey to land its Counter the first time it uses it, as getting any mileage out of it in the rest of the game is going to be quite unlikely.</p> <p>Sing Chansey's dream scenario is to switch in on a Turn 1 Thunder Wave, allowing it to neutralize incoming sleep moves for the rest of the game, and immediately firing off Sing to achieve what is essentially a full Pokemon advantage due to RBY's notorious sleep mechanics. This threat means Sing Chansey is a strong antimeta pick, as it is commonplace for leads such as Starmie and Alakazam to want to use Thunder Wave in the first turn of the game. However, this strategy is very well known, especially at higher levels of play, so expecting opponents to use Thunder Wave on the first turn may result in heartbreak. Should these types of mindgames not appeal to you, it is also possible to hide Chansey's Sing until later in the game, attempting to bluff a different set and catch a more valuable target than you otherwise would have; however, this is largely reliant on hitting your very first Sing, which is only a 55% chance, as the surprise factor will be blown afterwards.</p> <p>It should be mentioned that Sing Chansey can also function as a lead; although its matchup against faster sleepers such as Gengar, Jynx, and Exeggutor is abysmal, it is able to comfortably land a Sing when facing common leads such as Alakazam and Starmie.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Earlier versions by", "members": [{"user_id": 42885, "username": "Crystal_"}]}, {"name": "Quality checked by", "members": [{"user_id": 263906, "username": "Zokuru"}, {"user_id": 51373, "username": "Nails"}]}, {"name": "Grammar checked by", "members": [{"user_id": 331519, "username": "CryoGyro"}, {"user_id": 53214, "username": "JockeMS"}, {"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 265630, "username": "Amaranth"}]}
  },
  "Kangaskhan": {
    "overview": "<p>Kangaskhan is often labelled as a \"second Tauros\", and while Tauros is usually a better Normal-type attacker, Kangaskhan is not unusable and this label belies how differently it can act in practice. Kangaskhan is much more expendable during a game, fulfilling tasks that are normally too risky for the king of RBY OU. When compared with Tauros, Kangaskhan has some unique moves that make it more effective for this role as well, although they can be difficult to fit onto a set. For instance, Counter helps it oppose Normal-type attackers, and Mega Kick 2HKOes Chansey. Furthermore, Kangaskhan has formidable defensive bulk, which makes it more effective at switching into Body Slam, which cannot paralyze it.</p> <p>However, Kangakhan's hefty Normal-type competition does make it redundant on most teams. It has awful Special, completely failing to take strong neutral hits from Pokemon like Alakazam, Starmie, and Zapdos. Consequently, it's very challenging to switch Kangaskhan in against a lot of the tier, as one wrong move can mean significant damage; it often requires a double switch. Worse still, its Speed is just below what would be desirable to sweep, which makes it very reliant on extensive paralysis support to face these strong, fast special attackers. Overall, while Kangaskhan is not a replacement for Tauros by any stretch of the imagination, it retains a small niche when used alongside it, forming a strong wallbreaking core.</p> ",
    "comments": "<h1>Other Options</h1> <p>Kangaskhan's fourth moveslot is the most flexible, and it has a movepool to make use of it. Substitute is an interesting option to relieve prediction because Kangaskhan's HP gives it 103 HP Substitutes, just like Rhydon. This makes Kangaskhan a difficult adversary for Chansey, forcing it to use Seismic Toss twice to break its Substitute. However, Kangaskhan is vulnerable to paralysis throughout these interactions due to Substitute not blocking status in RBY, so it should only be attempted if Chansey is already paralyzed as well. Mega Kick is a valid option for 2HKOing Chansey, Starmie, and Tauros, but it can be difficult to fit into a set, and a miss often leads to Kangaskhan's demise. Rock Slide is another tempting option, allowing Kangaskhan to 2HKO Articuno and Jynx as well as 3HKO Zapdos 47.1% of the time, but it is very matchup-reliant. Thunderbolt is another valid option strictly for beating Cloyster, with two hits putting it in KO range for Hyper Beam. Alternatively, Thunder can 2HKO it after Body Slam.</p> <p>Kangaskhan is capable of using Counter to check Snorlax and Tauros, making them liable to KO themselves if they use Body Slam. Counter also lets Kangaskhan switch in on Hyper Beam, take it very well, and KO the user while it recharges. However, Kangaskhan's exploitable Special makes it deceptively difficult to find situations where Counter can be used. For instance, Kangaskhan is one of the few Pokemon where it's optimal for Tauros to use Blizzard instead of Body Slam before using Hyper Beam. Kangaskhan even takes relatively high damage from Ice Beam Snorlax. With the two most relevant targets for Kangaskhan's Counter being fully capable of scouting for it, it requires patience to pull off.</p> <h1>Checks and Counters</h1> <p><strong>Strong Special Attacks: The main reason Kangaskhan doesn't see much high-level usage is because of how awful its Special is. Many Pokemon in RBY OU, including Cloyster, Exeggutor, Starmie, Alakazam, and more, will 2HKO it with their STAB moves. However, few of these Pokemon appreciate switching into Body Slam, as getting paralyzed or critically hit could let Kangaskhan subsequently blast them away with Hyper Beam. Bulkier special attackers like Slowbro and Lapras don't mind Hyper Beam much, though, and can often muscle past Kangaskhan with their STAB moves. Zapdos deserves a special mention for being immune to Earthquake and threatening a 2HKO with Thunderbolt.</p> <p><strong>Paralysis: While Kangaskhan loves facing paralyzed Pokemon, this also means it wants to avoid paralysis itself. Ergo, Kangaskhan will often find itself being forced out by paralysis inducers like Jolteon, Zapdos, Alakazam, and Chansey, at least if it can't KO them first. If Kangaskhan is paralyzed, it becomes significantly more vulnerable to 2HKOs from special attackers like Exeggutor and Lapras. Ideally, Kangaskhan should only get paralyzed if it's a do-or-die situation.</p> <p><strong>Tauros Checks: Due to the dominance of Tauros in RBY OU, the tier is already well-equipped for dealing with Kangaskhan. Cloyster has amazing physical bulk, which makes it difficult for Kangaskhan to break past. Even Thunder is only a 3HKO, while Cloyster has an 84.7% chance to 2HKO in return with Blizzard and can recover the damage with Rest. However, Cloyster dislikes switching into Body Slam due to the potential paralysis making it difficult for it to utilize Clamp later on. To Kangaskhan's credit, it's capable of breaking past Cloyster with Thunderbolt or Thunder, although this isn't reliable. Slowbro possesses the physical bulk to trade blows with Kangaskhan, effortlessly paralyze it with Thunder Wave, and get Amnesia boosts on it. However, a Hyper Beam from Kangaskhan will KO it from 44.2% on a maximum damage roll, so it can be a high-variance matchup. Reflect Snorlax is another thorn in Kangaskhan's side, shrugging off anything thrown at it and forcing Kangaskhan out. Kangaskhan can try to use Counter on Body Slam, but this is somewhat predictable. Exeggutor can stomach most attacks from Kangaskhan and 2HKO with Psychic in return. Finally, Starmie is faster than Kangaskhan, can paralyze it, and 2HKOes with its special move of choice.</p> ",
    "sets": [
      {
        "name": "Wallbreaker",
        "description": "<h1>Set Description</h1> <p>Body Slam is Kangaskhan's main STAB move, spreading paralysis and ensuring that nothing can switch in for free. A STAB Hyper Beam from Kangaskhan should never be underestimated, KOing most Pokemon from around 65%, including Chansey and Jolteon. Plus, it can KO Alakazam if it's taken minimal chip damage. Earthquake 2HKOes Gengar and Jolteon, but it also helps with scouting for Counter users like Chansey and Snorlax. Surf prevents Rhydon from walling Kangaskhan, 2HKOing it. It should be noted that Kangaskhan takes middling damage from Rhydon's Body Slam and can't be paralyzed by it, making it a very valuable point of entry.</p> <p>Despite Kangaskhan's \"second Tauros\" title, it should not be forgotten that it is both a mid-game utility attacker—think Snorlax—and a capable revenge killer, particularly against paralyzed teams. Once Kangaskhan has safely entered the field, it's challenging to switch into due to its coverage and the threat of paralysis from Body Slam, so scouting with the latter should be its main aim. Kangaskhan is very capable of scouting for Counter users thanks to its coverage, so it's good to be patient and settle for Earthquake against Pokemon that carry it, such as Chansey. Remember that Kangaskhan is extremely specially frail, so it should ideally only fight special attackers if they are paralyzed. Even then, it will rely heavily on being eased in through double switches and Explosions, but it can use Counter to exploit its own teammates' Explosions.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 265630, "username": "Amaranth"}, {"user_id": 233818, "username": "Enigami"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}, {"user_id": 331519, "username": "CryoGyro"}]}], "writtenBy": [{"user_id": 236353, "username": "Plague von Karma"}]}
  },
  "Starmie": {
    "overview": "<p>Starmie is one of the most common Pokemon in RBY OU thanks to its Psychic typing and access to Recover and Thunder Wave. Starmie's physical bulk allows it to be a defensive check to virtually every Pokemon lacking an Electric-type attack and take two hits from almost any physical attacker. Additionally, its access to many special attacks such as Blizzard, Psychic, and Thunderbolt turns it into an offensive threat versus anything without instant recovery. Although Starmie naturally outspeeds many common Pokemon, most notably Tauros, oftentimes a paralyzed Starmie functions well in its defensive role due to its ability to block sleep-inducing moves from almost anything, while the ability to paralyze any non-Ground-type Pokemon via Thunder Wave makes it difficult to pressure offensively even then. Among the Recover and Soft-Boiled users in OU, Starmie also possesses a special defensive utility, as it's the only one of them to not be forced out immediately by Snorlax when paralyzed and is able to fight back against it offensively as well when running a STAB move. Those traits make Starmie usable in pretty much any state of the game, turning it into a very flexible Pokemon and easy addition to most RBY OU teams.</p> ",
    "comments": "<h1>Other Options</h1> <p>Ice Beam is an option over Blizzard for the increased PP if Starmie tries to fish for freezes on opposing Alakazam or Chansey lacking Thunderbolt. Hyper Beam is an option to surprise weakened Chansey or Alakazam, but Starmie loses a lot of potential if you drop a move for it. Hydro Pump is an option on a late-game Starmie, as it can 2HKO Tauros and generally do decent damage to anything that does not resist it, especially with a critical hit. If you are dedicated to using Starmie's coverage for a sweeping attempt, Hydro Pump can be used over Thunder Wave to form a strong combination of STAB power and coverage alongside Blizzard and Thunderbolt. Starmie also has access to Reflect and the rare Light Screen. However, it will struggle to fit those moves onto its moveset most of the time.</p> <h1>Checks and Counters</h1> <p><strong>Chansey: Chansey is the number one counter to Starmie, as Starmie realistically cannot beat it with any of its movesets, especially when Chansey is paralyzed. In return, Chansey beats Starmie by paralyzing it and beating it down with Thunderbolt, which Starmie will almost certainly fail to outstall with Recover due to full paralysis and critical hit chance. Alternatively, a Chansey lacking Thunderbolt can attempt to freeze an unparalyzed Starmie, as it runs little risk of losing by doing that. However, in order for Chansey to reliably beat a paralyzed Starmie, it needs to run Thunderbolt, since Seismic Toss's PP does not surpass Recover's massive 32 PP, meaning Starmie can outstall variants without Thunderbolt. It's also worth noting that an unparalyzed Chansey runs the risk of getting frozen by Starmie's Ice-type attacks, especially if it cannot threaten with Thunderbolt.</p> <p><strong>Alakazam</strong>: Alakazam has little to fear from Starmie as well. Although it does not possess any super effective move to hit Starmie with, its higher Speed and Special mean Alakazam can trade paralysis against Starmie and proceed to damage it with Seismic Toss or go for Special drops with its own, vastly stronger Psychic. The best Starmie can do is try to freeze an unparalyzed Alakazam or paralyze it and go for Special drops of its own in order to gain the Speed advantage and make Blizzard do more damage. Recover's massive PP leaves Starmie outstalled relatively quickly with that approach, though, since Alakazam can switch out to something like Chansey to relieve the Special drops. Additionally, while Surf can help Starmie in the Alakazam matchup, it usually still is not enough to beat it, since it only 4HKOes. The possibility of critical hits combined with multiple full paralysis turns on Alakazam, however, does give Starmie a fighting chance.</p> <p><strong>Snorlax</strong>: Even though Starmie is relatively bulky for a Pokemon with instant recovery, it still takes a good chunk from Snorlax's Body Slam. Alongside Starmie's relative trouble to deal great damage to Snorlax plus Snorlax frequently running Rest to heal damage and sometimes carrying Hyper Beam, this makes it a solid check to Starmie. If nothing else, Snorlax's Body Slam is another tool to paralyze Starmie, which generally makes it easier to handle. However, Snorlax has to be careful versus Starmie carrying a STAB move, especially Psychic, since one Special drop means it can no longer reliably Rest stall even a paralyzed Starmie. Another tool Snorlax has to dispose of Starmie is Amnesia. Since Amnesia Snorlax frequently only carries Blizzard and Body Slam as attacking moves, it still does not reliably beat Starmie, but outspeeding Starmie thanks to the additional Speed drop caused by using Amnesia when both are paralyzed surely helps break it with Body Slam. However, Amnesia does not protect Snorlax from Starmie's high critical hit chance, meaning Starmie can even break through Amnesia Snorlax with two consecutive Psychic critical hits or a potential freeze from an Ice-type attack.</p> <p><strong>Jolteon and Zapdos</strong>: Starmie struggles to stay in against Electric-type STAB moves from Jolteon and Zapdos or trade a Thunder Wave with them, since it cannot attempt to Recover off the damage they inflict piece by piece. Jolteon is definitely the best offensive check to Starmie. It does not like paralysis very much, but since it is one of the rare Pokemon that naturally outspeed Starmie, it can afford to take Starmie on even when paralyzed. Starmie can at best 4HKO Jolteon with Psychic, while Jolteon outspeeds and 2HKOes it. Zapdos does not fare as brilliantly against Starmie as Jolteon does due to being weak to Blizzard and not naturally outspeeding it, but it still does beat Starmie one-on-one, though it greatly appreciates it being paralyzed beforehand. Note that both Zapdos and Jolteon have a high critical hit rate thanks to their high Speed. One critical hit Thunderbolt from them will easily OHKO Starmie.</p> <p><strong>Grass-type Attacks</strong>: Razor Leaf from Victreebel does upwards of 73% to Starmie, meaning that Victreebel does not need to hit many Wraps to put a paralyzed Starmie in range of being KOed by Razor Leaf. If Sleep Clause is already active, Starmie absolutely needs to be paralyzed for Victreebel to beat it, though, since Starmie 2HKOes Victreebel with either Psychic or Blizzard. Mega Drain on Exeggutor is another option to pressure paralyzed Starmie trying to block Sleep Powder, since it 3HKOes Starmie and 2HKOes it after a Special drop from Psychic.</p> <p><strong>Electric-type Attacks: Other non-STAB Electric-type attacks coming from the likes of Gengar, Lapras, and opposing Starmie will put enormous pressure on Starmie, potentially taking it down with a single untimely full paralysis or critical hit.</p> ",
    "sets": [
      {
        "name": "Special Attacker",
        "description": "<h1>Set Description</h1> <p>Recover and Thunder Wave alongside Starmie's incredible Speed turn Starmie into a very sturdy Pokemon that possesses the ability to paralyze the foe and outspeed it after, even when paralyzed itself, and proceed to recover its health, since most attacks do not deal 50% to it. This makes Starmie tough to break and is why this move combination allows Starmie, despite its high Speed, to take paralysis even early on in the game and avoid being crippled by it as much as most other Pokemon. In fact, a paralyzed Starmie is very good at blocking sleep-inducing moves from common sleepers like Exeggutor and Sing Chansey lacking Thunderbolt.</p> <p>Starmie's traits do not end at its defensive role, however. In its last two moveslots, Starmie is able to run a variety of powerful special attacks, which can be chosen to hit almost every Pokemon in the tier except Chansey super effectively or at least decently hard. In that context it is worth noting that, due to its high Speed, Starmie has a very high chance of 22.46% to score a critical hit, which frequently enables Starmie to successfully knock out opposing Pokemon by shooting for critical hits.</p> <p>Blizzard most notably hits Exeggutor, Zapdos, and Rhydon, as well as Victreebel and Dragonite. It is chosen over Ice Beam due to having more power while only being 10% less accurate. In addition to the coverage Blizzard provides, another reason to use it lies in its chance to score a freeze on opposing Pokemon such as Chansey and Alakazam or just about any Pokemon if you're desperate. Moves that typically go alongside Blizzard are Psychic and Thunderbolt.</p> <p>Psychic is Starmie's best option to hit Pokemon like Gengar and the Normal-types, thanks to gaining STAB. This is especially important against Snorlax, as a Starmie without STAB moves struggles quite a bit to really hurt it. Another important feature of Psychic is the chance to score Special drops, which can help force switches and thus spread paralysis on the opposing team. This is especially noteworthy against Chansey, especially those running Reflect, since enough Special drops can force it out even when it has already set up a Reflect, which Starmie will otherwise fail to achieve. It can be useful against Alakazam as well, albeit not as consistently, since Alakazam itself can cause Starmie's Special to drop. It is worth mentioning however, that the Blizzard + Psychic set does have some issues with running out of PP rather quickly against opposing Recover users and will not be able to hurt opposing Starmie and Slowbro.</p> <p>Thunderbolt is used to hit opposing Water-types super effectively, including Lapras, Cloyster, and especially opposing Starmie and Slowbro. Being able to threaten other Starmie, especially when they lack Thunderbolt themselves, and beating Slowbro with a critical hit are the biggest selling points for Thunderbolt. Additionally, Thunderbolt is Starmie's only super effective move against Articuno, which itself doesn't really threaten Starmie much but can be annoying to actually knock out. If Thunderbolt is chosen alongside Blizzard, it should be noted that Starmie will struggle to properly threaten Gengar and Snorlax, as the latter can usually Rest stall Starmie, especially if it is paralyzed.</p> <p>Either move can be run alongside Blizzard whether or not Starmie is used as a lead, though as a lead Starmie usually prefers Psychic, as it's usually more useful for early-game purposes; Thunderbolt's coverage alongside Blizzard is appreciated if Starmie is kept for late-game, when opposing Pokemon like Chansey and Snorlax are taken care of otherwise.</p> <p>Psychic and Thunderbolt can be used on the same set if you want to retain the power versus Starmie and Slowbro and the ability to threaten Snorlax, which can be very dangerous for teams that have to rely on either of those Pokemon to fend off Starmie if Chansey is taken out already. Not being able to do much versus Exeggutor, especially when facing it as a lead, plus being unable to hit Rhydon super effectively can be annoying, but neither of them really likes going up against Starmie, since Psychic still does a lot to Rhydon, and Exeggutor usually cannot do much back if it lacks Mega Drain and Starmie cannot be put to sleep anymore. Exeggutor will be paralyzed and receive permanent chip damage in the process of trying to beat Starmie. However, Starmie cannot beat it without giving it multiple chances to fish for Special drops, which might force Starmie out and give Exeggutor the opportunity to put a switch-in to sleep. Additionally, Exeggutor has plenty of time to go for its Explosion, meaning Starmie will likely only trade with Exeggutor. Furthermore, not running Blizzard means you miss out on hitting especially the rare Dragonite super effectively, which then does not have to fear being outright KOed by Starmie and may be able to try its luck with setting up Agility on a weakened team.</p> <p>Another STAB option Starmie has is Surf. However, Water-type moves do not provide much in terms of coverage in the RBY OU metagame, since Fire-types are basically nonexistent and will be unable to beat Starmie anyway, and the ones you might meet such as Moltres are already hit super effectively by Blizzard. Nevertheless, Surf is used to OHKO Rhydon, hitting it by surprise, and it's Starmie's best option against Alakazam and Jynx, giving it a chance to take them down with some luck. It is worth noting that even with Surf, Starmie does not necessarily beat Alakazam; it will force it to Recover more frequently, though, and thus create turns to gain momentum by switching in a physical attacker on a Recover. Like Psychic, Surf also serves as a stronger STAB move against neutral targets such as Snorlax. The lack of a Special drop chance, however, makes it the inferior choice for that purpose. Usually the move to go alongside Surf is Thunderbolt, since Blizzard and Psychic are somewhat redundant with Surf. Since Surf and Thunderbolt both have 24 PP, this Starmie set is best suited for drawn-out games that include PP stalling. It must be noted that with Thunderbolt and Surf, Starmie is walled by Victreebel and Exeggutor, the latter of which has a good chance to force Starmie out due to its high Special and Psychic dropping Starmie's Special, giving Exeggutor opportunities to use Sleep Powder on a switch-in. Additionally, Starmie can no longer hurt opposing Zapdos and Dragonite. Pairing Surf with Blizzard is possible to avoid these issues, but the inability to hit opposing Water-types makes this less desirable.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Earlier version by", "members": [{"user_id": 42885, "username": "Crystal_"}]}, {"name": "Quality checked by", "members": [{"user_id": 265630, "username": "Amaranth"}]}, {"name": "Grammar checked by", "members": [{"user_id": 297659, "username": "deetah"}, {"user_id": 232216, "username": "The Dutch Plumberjack"}]}], "writtenBy": [{"user_id": 254408, "username": "Lusch"}]}
  },
  "Jynx": {
    "overview": "<p>Jynx has a lot of unique features that differentiate it from other Psychic-types such as Alakazam and Starmie. For one, Jynx is the second fastest sleep inducer after the unreliable Gengar, making it a fantastic potential lead option that can incapacitate its checks by making them fall asleep. STAB Blizzard also allows Jynx to win the matchup versus Pokemon such as Exeggutor, Rhydon, and Zapdos. This is all in addition to the standard expectations of a fantastic Psychic-type: access to the powerful STAB Psychic and a high Special stat. Jynx also has its faults, though. Despite its key resistances to Ice- and Psychic-type attacks, Jynx can become easily trampled over by physical attacks, namely from Normal-types such as Tauros and Snorlax, due to its pitiful HP and Defense stats. While its key resistances to Blizzard and Psychic may say otherwise, the main way Jynx provides defensive utility is being the switch-in for predicted sleep-inducing moves. Additionally, nearly all teams run at least two solid checks to Jynx between Chansey and either Starmie or Alakazam, sometimes both. Due to the omnipresence of these checks, their access to Thunder Wave and reliable recovery, and Jynx's susceptibility to paralysis and being worn down over time, Jynx's role is undermined. Jynx can use Rest to restore its health and alleviate its paralysis, burning off sleep turns against Pokemon that can't do much back to it like a paralyzed BoltBeam Starmie. However, doing so opens itself up to a slew of physical attackers such as Tauros and Snorlax that can freely switch into it while it's asleep.</p> ",
    "comments": "<h1>Other Options</h1> <p>As previously stated, Jynx's most useless move is Rest, and therefore if one wishes to use one of these other options, it should usually replace Rest. Ice Beam can be used over Blizzard to give Jynx more PP on its Ice-type STAB option. Running Ice Beam can also come in handy in long, drawn-out games to secure a freeze against one of the opponent's Pokemon, although the drop in power is noticeable. A healthy Jynx can use Counter to improve its matchup against Tauros and Snorlax; it is situational, and Jynx has to be at a sizable amount of health for this strategy to be pulled off, although it can also be used after taking damage from a previous turn and the foe switching out. Mimic can be utilized to potentially copy an important utility or coverage move such as Thunder Wave, Soft-Boiled, Recover, or Thunderbolt from one of Jynx's switch-ins such as Chansey or Starmie. However, forfeiting Rest for only a chance to copy a useful coverage move is somewhat risky and still leaves Jynx prone to being paralyzed. Body Slam can be utilized to fish for paralysis against incoming switch-ins like Alakazam, although it is not guaranteed, cannot paralyze Chansey and Snorlax, and is fired off of Jynx's exceedingly below-average Attack stat.</p> <h1>Checks and Counters</h1> <p><strong>Gengar: While Gengar cannot switch in safely on Jynx whatsoever, it can put Jynx out of commission from the very beginning of the game with Hypnosis. Gengar is also faster than Jynx and can threaten to use Explosion at any time.</p> <p><strong>Starmie, Chansey, and Alakazam</strong>: Starmie, Chansey, and Alakazam can sponge all of Jynx's attacks, paralyze it with Thunder Wave, and restore their health with Soft-Boiled or Recover, acting as some of the most consistent Jynx checks after one of their teammates has been put to sleep. Although they are all susceptible to being frozen with Blizzard, they can whittle Jynx down and force it to use Rest early, limiting the number of chances Jynx has of freezing something.</p> <p><strong>Normal-types</strong>: Tauros and Snorlax can take advantage of Jynx's low HP and Defense and love switching into it after it uses Rest, forcing in a teammate to take the incoming Body Slam. Tauros can also pick up the KO against Jynx with Hyper Beam with a little prior damage.</p> <p><strong>Bulky Water-types</strong>: Slowbro, like Starmie, resists Jynx's dual STAB combination of Ice and Psychic and can use Jynx as a setup opportunity to boost with Amnesia and Rest off all the damage it has taken. Lapras is another great example of an offensive check to Jynx despite its lack of reliable recovery due to its 4x resistance to Blizzard and access to Body Slam, although one of its teammates will need to have already been put to sleep. The Jynx user may also decide to trade damage off against Lapras with the end goal of revenge killing it later with another teammate such as Tauros or Alakazam. Getting too much damage off on these Pokemon after Jynx puts something to sleep will often lead to the defensive core of a team crumbling.</p> ",
    "sets": [
      {
        "name": "Lead Sleeper",
        "description": "<h1>Set Description</h1> <p>Jynx's primary goal is to use Lovely Kiss and incapacitate the foe's lead such as Starmie or Alakazam. Blizzard is Jynx's strongest STAB option against certain Psychic-types such as Alakazam and nails Pokemon such as Zapdos and Exeggutor. It can also be used to fish for a potential freeze while scouting which of the opponent's Pokemon has a sleep-inducing move. Psychic rounds out Jynx's coverage, receives STAB, and hits Pokemon such as Gengar and Lapras. It also has the potential to lower a foe's Special stat, which can come in handy to more convincingly win matchups versus special attackers, notably an opposing paralyzed Chansey. Rest provides Jynx with a way of restoring its health and alleviating paralysis. While Jynx doesn't have too many opportunities to use Rest due to its lackluster physical bulk, it can use Rest and burn sleep turns on more passive foes such as Chansey, Alakazam, and Exeggutor lacking Double-Edge. Burning off sleep turns is not always easy, however, as generally speaking most teams pack anywhere from two to three solid checks to Jynx, leaving it liable to exploitation. Jynx is primarily used as a lead due to its above-average Speed tier and access to a fairly accurate sleep-inducing move. However, Jynx can also be used mid-game due to its high Special and fantastic offensive dual STAB combination of Blizzard and Psychic. Note that removing statused Pokemon such as paralyzed Alakazam and Chansey from play allows for Jynx to more freely use Lovely Kiss. The ideal way to utilize Jynx is to put one check to sleep with Lovely Kiss, potentially freeze one of Jynx's remaining checks, and then switch it into potential sleep inducers.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Earlier version by", "members": [{"user_id": 53, "username": "Jackal"}, {"user_id": 6227, "username": "CaptKirby"}, {"user_id": 524, "username": "evan"}]}, {"name": "Quality checked by", "members": [{"user_id": 265630, "username": "Amaranth"}, {"user_id": 51373, "username": "Nails"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "The Dutch Plumberjack"}, {"user_id": 336073, "username": "Rabia"}]}], "writtenBy": [{"user_id": 239454, "username": "Aaronboyer"}]}
  },
  "Pinsir": {
    "overview": "<p>Pinsir is the sole viable Bug-type in RBY OU thanks to an amazing Attack stat that can be further boosted by Swords Dance, allowing it to let loose nuclear Hyper Beams while trapping with Bind. A +2 Pinsir is nothing to be trifled with, capable of beating Snorlax outright with Submission and possessing a Hyper Beam that can OHKO the physically frailer Pokemon in the tier, including Jolteon, Chansey, Jynx, Alakazam, and Victreebel. Additionally, Pinsir has the strongest non-STAB Slash in the game, hitting nearly as hard as Persian right out of the gate. This makes it one of the few physical attackers that can contest Reflect users like Snorlax and Chansey, the latter of which it can 2HKO. Pinsir's typing gives it surprising defensive utility as well, resisting Earthquake and not being hit super effectively by Thunderbolt, giving it use over other Swords Dance users like Kingler. Pinsir is by no means slow relative to OU either, outpacing Victreebel and Cloyster, and, with paralysis support, it can absolutely mow down even the faster Pokemon in the tier, acting as a surprisingly strong late-game sweeper.</p> <p>However, like all RBY Bug-types, Pinsir suffers from some severe downsides. While powerful, Pinsir cannot hit Gengar without Seismic Toss, possessing strictly Normal- and Fighting-type attacks in its offensive movepool. Ergo, Gengar can effortlessly switch in and let out a completely uncontested Hypnosis while Pinsir is forced to switch out or pivot out with Bind. Pinsir also suffers from a bit of four moveslot syndrome, demanding Swords Dance and Hyper Beam while having to pick between Slash, Submission, and Bind for its last two slots, all of which can significantly affect its matchups. Worse still, Pinsir is very reliant on its Speed to sweep, as being outsped exposes its noticeably mediocre special bulk, leading to it getting forced out by paralysis inducers such as Alakazam, Starmie, and full HP Chansey. These flaws make Pinsir a rare sight in RBY OU, but a serviceable pick nonetheless.</p> ",
    "comments": "<h1>Other Options</h1> <p>While a highly contested slot, Pinsir's fourth moveslot is the most flexible. If a team absolutely needs another Pokemon to hit Gengar, Seismic Toss is a suitable option, allowing Pinsir to punish its attempts to switch in. After two strikes, Gengar often becomes much more inclined to Explode, making it a bit more predictable. However, fitting Seismic Toss always brings severe opportunity cost, causing Pinsir to lose out on Submission's fantastic damage against Normal-types or Bind's utility.</p> <h1>Checks and Counters</h1> <p><strong>Gengar: Pinsir can't even touch Gengar without Seismic Toss, possessing no alternatives to hit it. Worse still, Gengar's Thunderbolt is a guaranteed 3HKO, dealing up to 41.4% per hit, or it can fire off a completely uncontested Hypnosis. However, Bind can immobilize Gengar while allowing Pinsir to bring in a teammate such as Alakazam for free, which does add a degree of risk.</p> <p><strong>Paralysis: Paralysis rains on Pinsir's parade, exposing its severely lacking special bulk and making it near-incapable of running over the opposing team. There is counterplay if Pinsir's foe is paralyzed as well, though, as Pinsir can attempt to use Swords Dance to reapply the Speed drop and continue whaling on them. Pokemon like Exeggutor and Lapras become much more threatening when Pinsir is paralyzed, utilizing their powerful special attacks to 2HKO it. As a result, Pokemon like Alakazam and Starmie will often force Pinsir out by the threat of paralysis alone unless it's in a situation where paralysis doesn't matter. This also makes Body Slam paralysis from Pokemon like Tauros, Snorlax, and Rhydon particularly annoying, as Pinsir can't often stomach more than two hits from any given Pokemon.</p> <p><strong>Strong Special Attackers: Pinsir's special bulk of 65/55 is awful; even Jolteon's Thunderbolt and Starmie's Surf have a high chance to 2HKO it. As a result, Pinsir is very frequently forced out by special attackers unless it can KO them first, such as if they're paralyzed or chipped. However, Pinsir does often have the chance to attack them once, which can situationally be all it needs in endgame scenarios.</p> <p><strong>Physically Bulky Foes: Pokemon like Rhydon, Cloyster, and Slowbro put large amounts of pressure on Pinsir—especially if it's paralyzed—while being able to stomach its hefty physical blows. These Pokemon can also strike back with equally devastating attacks; in Rhydon's case, Rock Slide can deal upwards of 80% in a single hit, which can be a KO if Pinsir even tries to respond with Submission.</p> <p><strong>Counter Users: If Pinsir can't KO Chansey outright, Counter Chansey will OHKO Pinsir if it uses any of its offensive attacks bar Bind. This can also apply to more niche Counter users, such as Snorlax, Alakazam, and Kangaskhan. However, if Pinsir has Bind, it has a solid way to counter-play the strategy, immobilizing the Counter users and chipping them into Hyper Beam range.</p> ",
    "sets": [
      {
        "name": "Swords Dance",
        "description": "<h1>Set Description</h1> <p>Swords Dance and Hyper Beam are Pinsir's bread and butter, allowing it to swiftly end games if its team can successfully chip and paralyze the opposing team. It should be noted that Swords Dance reapplies the paralysis Speed drop to paralyzed foes, so if Pinsir itself is paralyzed, it isn't game over just yet. This effect also applies to paralyzed Pokemon attempting to switch in, making doing so extremely risky.</p> <p>Pinsir's last two moveslots largely depend on what its user wants. For the third moveslot, Slash gives Pinsir immediate power and provides a better matchup against Reflect users, while Body Slam lets Pinsir spread its own paralysis, making it more self-sufficient. For the fourth slot, Submission, while unreliable and giving Pinsir significant blowback for its use, is an amazing way to dispatch Cloyster, Chansey, and Snorlax at +2, dealing well over 50% to each of them. In fact, after two boosts, Pinsir can outright OHKO non-Reflect Snorlax. Alternatively, Bind can occupy either the third or fourth moveslot, letting Pinsir pivot into its teammates to gain a better position while also dealing serious chip damage. This works especially well against paralyzed teams, forcing them to switch around to PP stall it while often taking around 7% each time if Pinsir has picked up even a single boost, which rapidly adds up over the course of the move.</p> <p>While this is all well and good on paper, using Pinsir in practice is fairly difficult. It's best to keep it to endgame scenarios, when the opposing team has likely been thoroughly paralyzed. However, it's perfectly fair to switch it in on a Chansey's Soft-Boiled turn or a Snorlax's Rest or Earthquake, both options that Pinsir doesn't really care about. Similarly, Recover turns from paralyzed Alakazam and Starmie are good opportunities for Pinsir to sneak in and force damage on the opposing team; if either of these Pokemon experience full paralysis when attempting to respond, they could absolutely be KOed the following turn. Fellow partial trapping pivots and Explosions are other good switch-in chances. Picking up a boost with Pinsir is also quite difficult, though Pinsir is not against taking a hit to set up if it means winning the game there and then. Punishing a Snorlax Rest with Pinsir is among the best ways to get a boost with impunity, often forcing Snorlax out lest it is KOed from there. Pinsir works best on teams that have multiple paralysis inducers, one of which will likely be the ubiquitous Chansey. Jolteon synergizes very well with Pinsir, appreciating Pinsir's Ground resistance and ability to 2HKO Rhydon with +2 Submission.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 265630, "username": "Amaranth"}, {"user_id": 233818, "username": "Enigami"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 236353, "username": "Plague von Karma"}]}
  },
  "Tauros": {
    "overview": "<p>Tauros is the most iconic Pokemon in RBY OU, and its presence has been shaping the tier for as long as it has existed. Tauros is undoubtedly the strongest offensive threat in the tier, thanks to its powerful Body Slams and Hyper Beams paired with the coverage moves to hit any Pokemon that resists its STABs. This is further enhanced by its high Speed, and therefore high critical hit rate, as well as serviceable bulk. This makes switching into Tauros a very arduous prospect for most teams, as potential checks like Starmie have to fear a sizable chance of paralysis or critical hit from Body Slam. Other Pokemon with the theoretical physical bulk, such as Snorlax, Cloyster, or Slowbro, can only shrug off Tauros's hits via Rest, leaving them in an exploitable state. Overall, although some special attackers can trade blows advantageously with Tauros, and it has to be very wary of paralysis, its sheer offensive prowess makes it an automatic inclusion on a vast majority of RBY teams.</p> ",
    "comments": "<h1>Other Options</h1> <p>Thunderbolt and Thunder can be used to damage Cloyster, which, despite being relatively uncommon, is one of the sturdiest Tauros switch-ins available. Thunder manages to 2HKO it but has to deal with much lower accuracy, while Thunderbolt misses out on that damage range but is generally far more reliable.</p> <p>Stomp has a 30% flinch chance, and while definitely unreliable, it can be used to bring opposing Pokemon into KO range with no damage traded back with some luck. This is an especially appealing option if the enemy Pokemon is already paralyzed, which further increases the chances of it not managing to attack.</p> <p>Double-Edge's 100 Base Power can be used to safely snipe out KOs that Body Slam cannot reach while not having to rely on Hyper Beam; the recoil is a generally unpleasant side effect, but it can be used to your advantage, as whenever a Pokemon faints from recoil the turn ends immediately. This mechanic can occasionally be used to damage an opponent and prevent them from healing back up.</p> <h1>Checks and Counters</h1> <p><strong>Status: Tauros's below average bulk is difficult to exploit because it is usually faster and strong enough to KO the foe before they can strike back. Paralysis and sleep are both very common in the RBY metagame, and they can shut down this element of Tauros's gameplay, making it much easier to deal with.</p> <p><strong>Exeggutor</strong>: While Exeggutor lacks recovery, and therefore cannot repeatedly switch in on Tauros, simply having Exeggutor in the back will often dissuade Tauros players from clicking Hyper Beam, as Exeggutor could switch in, tank the Hyper Beam, and land a Sleep Powder or a Stun Spore on Tauros during the recharge turn, effectively putting it out of commission for the rest of the game.</p> <p><strong>Starmie</strong>: Starmie is the only Pokemon with access to Recover that can survive a Body Slam followed by a Hyper Beam, which makes it an obvious candidate for a reliable switch-in on Tauros throughout the game; however, Body Slam can ruin its day with decent frequency due to the chance of paralysis. Regardless, Starmie outspeeds Tauros and can even threaten it with Thunder Wave, which makes a healthy Starmie one of the best Tauros answers available.</p> <p><strong>Cloyster and Lapras</strong>: These Pokemon possess great bulk and access to a powerful Blizzard that is generally enough to scare Tauros away. Lapras's Blizzard is stronger and has a chance to 2HKO, while Cloyster takes Body Slams better and more commonly runs Rest to heal the damage back up. As a side note, Articuno also possesses 2HKO potential via Blizzard, but it's significantly frailer and generally less viable than both Cloyster and Lapras.</p> <p><strong>Slowbro: Slowbro is part of the small list of Pokemon that are guaranteed to survive a critical hit Hyper Beam from full HP, making it an appealing option to switch in on a predicted Hyper Beam in order to guarantee landing a Thunder Wave on the recharge turn. It does not mind a Body Slam either, but it can be hard for it to use Rest and wake up unpunished.</p> <p><strong>Snorlax</strong>: Tauros's much slower and bulkier counterpart is a good asset when trying to answer an opposing Tauros, as its natural bulk will often at least guarantee that some damage gets traded back, and if it carries Self-Destruct, it can somewhat reliably trade one-for-one if your opponent chooses to leave Tauros on the field.</p> <p><strong>Gengar</strong>: Although mauled by Earthquake, Gengar can switch in on Normal-type attacks from Tauros at no cost and threaten it with Hypnosis. Although the exchange is somewhat likely to end very poorly, between Hypnosis's miss chance and Earthquake's critical chance, the Tauros user is generally expected to keep it away from danger if possible, which means Gengar can somewhat reliably be used to prevent Tauros from making any progress as long as it doesn't get hit with an Earthquake on a predicted switch in. Gengar is also the best check to Tauros without Earthquake.</p> <p><strong>Jolteon and Alakazam</strong>: Although they definitely do not want to pick a full one-on-one against Tauros or ever switch in on it, Alakazam and Jolteon deserve a mention as they can outspeed and revenge kill a weakened Tauros, which is a fairly rare quality.</p> ",
    "sets": [
      {
        "name": "The Bull",
        "description": "<h1>Set Description</h1> <p>Tauros's combination of Body Slam and Hyper Beam makes it an incredibly difficult threat to switch into, as a majority of Pokemon only need to receive minimal chip damage before being unable to tank a Body Slam followed by a Hyper Beam, and some are KOed by this sequence even from full health. Body Slam's paralysis chance on some of the most common Tauros switch-ins such as Starmie and Exeggutor is yet another addition to Tauros's already threatening arsenal. Blizzard is Tauros's best attack to threaten Rhydon and Golem, the two OU-viable Rock-types that would otherwise be able to switch in on its Body Slam, and force them to face the threat of being 2HKOed (or being OHKOed on a critical hit). Earthquake is the preferred move in the last slot, as it gives Tauros a tool to hit Gengar, which otherwise walls it, as well as a way to play around Counter Chansey, although Tauros still risks taking a Thunder Wave in a direct one-on-one situation. Additionally, it can finish off a weakened Rhydon or Golem with greater accuracy than Blizzard. Earthquake also gives Tauros a safe move to hit both Chansey and Rock-types, which elimates the need to predict a switch with Body Slam or Blizzard in certain situations. However, given the generally low usage of Gengar and Counter Chansey, it is reasonable to cut Earthquake in favor of Fire Blast; while this move does not hit any targets for extra damage, it does carry a 30% burn chance that can give Tauros an upper hand in a one-on-one matchup with opposing Tauros.</p> <p>Tauros is such a potent tool to break the opposition down that it is generally preferred to keep it as healthy as possible throughout the game while also trying to get it on the field as often as possible; this is a tricky balance to achieve that often sets apart new players from experienced ones. Great opportunities to switch it in can be found against Pokemon that are asleep, on a predicted switch, or on a recovery move that will leave the opponent's active Pokemon in KO range for Tauros. Quite frequently, Tauros will be able to clean up teams that have appropriately been crippled with status or weakened beforehand thanks to its extremely strong Hyper Beam; this is one of the most common win conditions in RBY, and as such, your game plan should generally account for the possibility of an end-game Tauros sweep. This means you should capitalize on opportunities to set up a Tauros sweep while trying to reduce your opponent's chances to do the same thing. The biggest obstacle in these plans is often the fact that both Tauros are kept as healthy as possible and always able to try a last-resort mirror, even when the rest of the team has fallen apart; this is one of the many reasons for keeping your own Tauros safe.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Earlier versions by", "members": [{"user_id": 42885, "username": "Crystal_"}]}, {"name": "Quality checked by", "members": [{"user_id": 108993, "username": "Jellicent"}, {"user_id": 424525, "username": "FriendOfMrGolem120"}]}, {"name": "Grammar checked by", "members": [{"user_id": 53214, "username": "JockeMS"}, {"user_id": 232216, "username": "The Dutch Plumberjack"}]}], "writtenBy": [{"user_id": 265630, "username": "Amaranth"}]}
  },
  "Gyarados": {
    "overview": "<p>If Gyarados didn't learn Thunderbolt it'd probably be somewhere along with the likes of Flareon and other great Pokemon that are ignored because of their poor movepools; but it does, and that makes it a solid Pokemon. Basically, Gyarados has a neat enough Attack that it can do major damage, and a diverse movepool that boosts the value of a very nice Special stat. Just watch out for other Pokemon with Thunderbolt; the weakness to such a common move certainly hurts it in the OU environment, but it's still a usable Pokemon.</p> ",
    "comments": "<h1>Other Options</h1> <p>Ice Beam works if you prefer accuracy and Thunder or Hydro Pump if you don't. Fire Blast is up there, but Gyarados already hits just about everything quite hard. The only things you'll be missing out on hurting super effectively are Bug-types, which are not that much of a threat. Substitute and Mimic should always be mentioned even though they're usually too situational. Leer can be handy sometimes for forcing switches or putting something like Chansey or a paralyzed Tauros in Hyper Beam range, but don't expect too much of it.</p> <h1>Checks and Counters</h1> <p>Starmie, Lapras, and Gengar have Thunderbolt and will use it from their good Special stats, which spells doom for Gyarados, who is four times weak to the move. Gengar, in addition, isn't affected by Gyarados's Normal attacks. Also, since Gyarados doesn't get STAB on its most useful attacks, a high HP Pokemon like Clefable or Snorlax would be able to handle it more often than not.</p> ",
    "sets": [{"name": "Mixed Attacker", "description": "<h1>Moves</h1> <p>Gyarados has one the highest overall stats of all Pokemon, but people brush it off because of its 4x weakness to Electric-type attacks. Thunderbolt hurts Starmie on the switch and Blizzard hurts Exeggutor a little. Gyarados's Body Slam and Hyper Beam are quite powerful too. Surf can OHKO Rhydon and Golem, but Blizzard is generally better because it also threatens Grass-types and has better type coverage.</p> "}]
  },
  "Lapras": {
    "overview": "<p>Lapras is a potent special attacker backed up by solid bulk and a good variety of coverage and utility moves, such as access to Blizzard and Sing. While it faces strong competition from other Pokemon with similar coverage, such as Starmie, its combination of power and bulk, as well as access to Sing, gives Lapras a unique set of qualities that give it an important niche in the metagame. Access to STAB Blizzard, as well as Thunderbolt, enables it to hit almost every Pokemon in the game for at least neutral damage, making it quite difficult to switch into. Its Speed is just enough to get by Chansey as well, allowing it to potentially put it to sleep one-on-one. It also has a positive matchup against Tauros and Snorlax, two of the strongest Pokemon in the metagame, which can be crucial in many instances.</p> <p>However, Lapras is bogged down by some flaws. Lapras's typing leaves it with a weakness to Thunderbolt and neutrality to Psychic, which often makes it easy to wear down with Pokemon like Starmie and Alakazam running around. It also struggles mightily against Chansey if it can't put it to sleep, which stonewalls it with its incredible bulk. Regardless, Lapras holds a niche in RBY OU, and it sees success on quite a few teams.</p> ",
    "comments": "<h1>Other Options</h1> <p>Ice Beam is an alternative STAB option to use in place of Blizzard, but the lack of power is really noticeable and generally not worth the extra accuracy and PP. Rest and Reflect can be used in conjunction to give Lapras much appreciated survivability to answer threats such as Tauros more reliably throughout the game, but the set is easy to pressure via powerful special attacks, particularly Psychic- or Electric-type ones, and the lack of offensive pressure makes it a risky and generally undesirable pick.</p> <h1>Checks and Counters</h1> <p><strong>Chansey: Lapras struggles immensely in attempting to break through Chansey. It can easily Soft-Boiled away any damage taken and force Lapras out with the threat of Thunder Wave. Lapras may attempt to put it to sleep with Sing, but the move is inaccurate, somewhat predictable, and completely useless against a paralyzed Chansey.</p> <p><strong>Zapdos and Jolteon</strong>: While Lapras's Blizzard respectively 2HKOes and 3HKOes these Pokemon, team structures that include Lapras generally leave themselves very vulnerable to Electric-type attacks, which Zapdos and Jolteon can easily exploit and punish with powerful Thunderbolts. It may even be preferable to sacrifice Lapras in a one-on-one scenario just to get some chip damage on Zapdos in particular, but the same cannot be said for Jolteon, which should nearly always have the upper hand against Lapras and only fears a potential Body Slam paralysis.</p> <p><strong>Starmie and Alakazam</strong>: If they are not paralyzed, these two Pokemon can tank any hit Lapras throws at them and Recover off the damage easily while threatening it with Thunder Wave. All Lapras needs to turn the tides on them is paralysis and some correct predictions.</p> <p><strong>Amnesia Snorlax</strong>: Although it takes a while to get going and has to worry about Sing, Snorlax doesn't take much damage from any of Lapras's attacks after one or two Amnesia boosts and can retaliate with Body Slam. Although it is unlikely Amnesia Snorlax would be used as a switch-in, it dominates one-on-one.</p> ",
    "sets": [
      {
        "name": "Standard",
        "description": "<p>Blizzard is Lapras's most powerful attack, allowing it to deal heavy damage to anything that doesn't possess either huge special bulk or a resistance to Ice. Thunderbolt allows Lapras to hit Water-types, giving it the ability to muscle through paralyzed Starmie, which would otherwise be a poor matchup. In the third slot, Hyper Beam is Lapras's best bet to finish off Pokemon with a high Special but low Defense, such as Chansey and Alakazam, which are otherwise good answers to Lapras; however, Body Slam may be preferred, as it gives Lapras the ability to somewhat reliably paralyze opposing Starmie. The last slot is usually Sing, a move that provides great utility and scares off Pokemon that would otherwise function as great Lapras answers, with Chansey usually being the main target. Its low accuracy can be unfortunate, as Lapras doesn't have easy ways to shrug off any status or damage that may come its way, so misses can be particularly devastating. If the sleep move is not necessary, you may opt to run Confuse Ray instead, which is Lapras's best shot at powering through paralyzed special walls.</p> <p>When using Lapras, you should first figure out a plan to take care of Chansey, as it can shrug off Blizzard quite easily. Snorlax's Self-Destruct and Exeggutor's Explosion are usually the best ways to achieve this, as your opponent should be able to preserve their Chansey quite easily by simply switching out if you try to defeat it via repeated Ice Beams, PP stalling, or strong physical attacks. However, it is still possible for Lapras to pressure Chansey via Sing, so if you cannot find an opportunity to threaten it via Explosion, you can still rely on Sing to get the job done. Non-paralyzed Starmie and Alakazam are both answers to Lapras as well, threatening to shut it down with Thunder Wave, as they are simply able to use Recover until Lapras is fully paralyzed. If running Body Slam, you should attempt to predict their entrance and hit them with it; should you manage to paralyze them, Lapras will outspeed them and be much harder to stop. Lapras has great potential to create significant advantages between access to Sing and strong matchups against very popular Pokemon such as Tauros, Snorlax, and Rhydon, but its checks must be taken care of before it can have any impact on the game.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 263906, "username": "Zokuru"}]}, {"name": "Grammar checked by", "members": [{"user_id": 40064, "username": "NixHex"}, {"user_id": 231476, "username": "Fireflame479"}]}], "writtenBy": [{"user_id": 265630, "username": "Amaranth"}]}
  },
  "Jolteon": {
    "overview": "<p>Jolteon's high Speed and Special stats and critical hit rate make its Thunderbolt a big threat. Because of this, Jolteon is able to outpace the whole metagame and is one of the few Pokemon that can revenge kill a weakened Tauros. It is also a good lead because of its ability to force a lead Starmie to switch out with Thunderbolt and paralyze other leads like Alakazam, Exeggutor, and Jynx with Thunder Wave. Jolteon also has an important defensive niche that allows it to be one of the few Pokemon to take on Zapdos comfortably due to resisting both of its STAB options as well as put pressure on Water-types like Slowbro and Cloyster with Thunderbolt. While Pokemon like Chansey, Exeggutor, and Alakazam can take Jolteon's Thunderbolt, it can cripple these Pokemon with Thunder Wave. However, outside of its STAB move, Jolteon does not have any other good attacking moves, as it only has two good options in Pin Missile and Double Kick, which fail to do major damage outside of a potential critical hit even on super effective targets like Exeggutor and Chansey due to Jolteon's low Attack stat. Furthermore, Jolteon is unable to deal with Ground-types like Rhydon and Golem, as it cannot do any good damage to them with any of its attacks and gets OHKOed by Earthquake.</p> ",
    "comments": "<h1>Other Options</h1> <p>Jolteon can run Agility to get its Speed back if it gets paralyzed; however, it will have to give up Rest or Pin Missile in order to run it, which makes it lose the ability to hit Exeggutor more effectively or get HP back on passive Pokemon. Thunder is a more powerful move that allows Jolteon to OHKO Cloyster and Tauros on a critical hit; however, the miss chance and lower PP make it hard to justify using it over Thunderbolt or over Rest or Pin Missile. Body Slam can be run over Rest or Pin Missile to try to paralyze Rhydon and Golem as they switch in; however, it is redundant otherwise, as Thunder Wave is able to paralyze Pokemon like Alakazam and Exeggutor as is.</p> <h1>Checks and Counters</h1> <p><strong>Rhydon and Golem: Both Rhydon and Golem wall Jolteon, as they're immune to Thunderbolt and Double Kick fails to do any major damage to them, while they OHKO it back with Earthquake.</p> <p><strong>Snorlax</strong>: Though it needs to be wary of potential critical Thunderbolts, Snorlax is relatively happy to switch into Thunder Wave, can tank a Thunderbolt, and threatens Jolteon immensely with any of Body Slam, Earthquake, or Hyper Beam.</p> <p><strong>Exeggutor and Victreebel</strong>: Without Pin Missile, Jolteon cannot take care of Grass-types, as Thunderbolt fails to do a lot of damage to them.</p> <p><strong>Paralysis</strong>: Without Rest, Jolteon cannot get rid of paralysis, which hinders it from sweeping late-game and makes it easy for any offensive Pokemon to take care of it by exposing its frailty. Jolteon wins a full one-on-one against Thunder Wave users such as Chansey, Starmie, and Zapdos, but they can simply paralyze it and switch out; Alakazam can even attempt to beat Jolteon by itself.</p> ",
    "sets": [
      {
        "name": "Offensive",
        "description": "<h1>Set Description</h1> <p>Thunder Wave allows Jolteon to cripple its defensive checks such as Alakazam, Chansey, and Exeggutor that commonly come in on its Thunderbolt. It is also good to use against Tauros, as it is no longer a threat once it's paralyzed. Thunderbolt takes care of Water-types like Starmie and Slowbro and can do a lot of damage to Pokemon that don't resist it if Jolteon lands a critical hit. Double Kick scares out Chansey because it is 2HKOed on a critical hit. Double Kick also allows Jolteon to have a way to get damage on Ground-types like Rhydon and Golem as a last resort, though Jolteon should switch out if it predicts them to switch in to help keep damage off of itself and its teammates. Rest allows Jolteon to get HP back and cure itself of paralysis, which is useful against Pokemon like Chansey, Starmie, and Zapdos; however, outside of these Pokemon, Jolteon will find it hard to use Rest, as the move is more useful late-game, and putting Jolteon to sleep allows Tauros to come in safety. Pin Missile gives Jolteon a way to deal with Grass-types such as Exeggutor, as it will deal major damage if it lands a critical hit on them. If Jolteon is being used as a lead, the best move to start the game is Thunder Wave in order to slow down opposing leads like Jynx, Exeggutor, and Alakazam; however, Jolteon must be careful, as this can lead to it being put to sleep with Lovely Kiss or Sleep Powder or paralyzed from Thunder Wave or Stun Spore. Because of its poor bulk, the best way to have Jolteon come in safely is against Pokemon like Chansey, on a predicted switch, or when a Pokemon faints. Jolteon should be saved to use late-game because of its Speed, as it can pick off most weakened Pokemon with Thunderbolt. Jolteon will need Pokemon like Exeggutor and Starmie on the team because it struggles against common Ground-types like Rhydon and Golem. Pokemon that can also help with Snorlax and Tauros like Cloyster and Exeggutor are needed.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 327320, "username": "Aliss"}, {"user_id": 265630, "username": "Amaranth"}]}, {"name": "Grammar checked by", "members": [{"user_id": 297659, "username": "deetah"}, {"user_id": 232216, "username": "The Dutch Plumberjack"}]}], "writtenBy": [{"user_id": 393488, "username": "Yami"}]}
  },
  "Flareon": {
    "overview": "<p>Flareon in RBY OU faces heavy competition from the bulkier and faster Moltres as a Fire-type mixed attacker. Its notably higher Attack stat paired with Body Slam pressures Chansey and Starmie more heavily than Moltres can, but it is crippled more by paralysis and fares notably worse against physical attackers like Snorlax and Tauros. Flareon is reliant on good prediction and some luck to be effective, making it a risky option not recommended for most RBY OU teams.</p> ",
    "sets": [
      {
        "name": "Mixed Attacker",
        "description": "<p>Fire Blast is Flareon's strongest attack, though its 30.1% burn chance is a double-edged sword, as physical attackers are crippled but Pokemon with instant recovery benefit from burn blocking other status. Body Slam pressures special walls and Starmie and also threatens to paralyze non-Normal-types, while Hyper Beam provides power to finish them off once they are weakened enough.</p> <p>Fire Spin helps Flareon to safely switch out against or wear down slower opponents. Tail Whip or Leer is an alternative option to help Flareon break through its counters. Starmie and Chansey are KOed by Body Slam followed by Hyper Beam at -1 Defense, either forcing them out or KOing them if they stay in. Additionally, when a paralyzed or burned Pokemon suffers a stat drop, the stat reduction from the Pokemon's status is applied again, for example causing a faster paralyzed Pokemon like Starmie to become slower than paralyzed Flareon after having its Defense reduced.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 265630, "username": "Amaranth"}, {"user_id": 424525, "username": "FriendOfMrGolem120"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 233818, "username": "Enigami"}]}
  },
  "Porygon": {"sets": [{"name": "Bulky Special Attacker"}]},
  "Omastar": {"sets": [{"name": "Tank"}]},
  "Snorlax": {
    "overview": "<p>Snorlax is a centerpiece of the RBY OU metagame. It is present on almost every team due to its incredible strength, bulk, and versatility, in spite of its terrible Speed. Thanks to Reflect, Snorlax can upgrade its physical bulk to truly remarkable levels and begin firing powerful Body Slams with little concern about incoming hits. Defensive answers to its Body Slam do exist, but Snorlax has access to a plethora of options to threaten them, such as Earthquake to get around Gengar and Counter users, or Ice Beam to freeze Pokemon which try to fight Snorlax's Reflect with their own. Furthermore, Snorlax can even opt to give up a traditional Reflect set and catch opponents off-guard by using less common moves such as Amnesia or Counter, which can allow it to bypass some common answers, and it even has access to the strongest Self-Destruct in the game, giving it the ability to eliminate almost any Pokemon if necessary, with only Gengar and Rhydon being able to comfortably absorb it.</p> <p>Despite all these positive qualities, Snorlax comes with two inherent flaws: the lowest Speed in the metagame, only tied with Slowbro, and a lack of recovery outside of Rest. This means that once Snorlax is put to sleep it is possible for many special attackers in the tier to threaten it with their STABs: Psychic from the likes of Exeggutor, Starmie, Alakazam, and even Jynx can rapidly snowball out of control due to the high chance of Special drops, and other strong attacks such as STAB Thunderbolt from Zapdos or STAB Blizzard from any of the Ice-types in the tier can also ensure Snorlax is punished for its Rest turns. Nevertheless, Snorlax is one of the biggest offensive threats and one of the hardest Pokemon to KO at the same time, and its set can be tailored to cover any desirable match ups effectively, which means it's usually hard to find reasons not to run Snorlax on your team.</p> ",
    "comments": "<h1>Other Options</h1> <p>Snorlax can drop Body Slam entirely to run an Ice Beam / Reflect / Amnesia / Rest set that simply aims to soak up damage and spam Ice Beam until it manages to freeze a foe, but it generally needs to be on very specific types of teams to function, is completely helpless against Ice-types, and needs some luck to break through paralyzed Starmie and Chansey, as Ice Beam's limited PP means so Snorlax cannot fish for consecutive paralysis for long.</p> <p>Surf is the best option available to Snorlax to hit Rhydon and Golem, but given that most Snorlax sets run either Reflect or an Ice-type attack, if not both, the situations where Surf is useful are rare.</p> <p>Harden is sometimes preferred over Reflect for the higher PP count and ability to reapply the Speed drop on paralyzed foes, but it is considerably weaker at answering physical attackers, which is usually the primary duty of Reflect Snorlax.</p> <p>Another unusual set is Body Slam / Amnesia / Thunderbolt / Self-Destruct or Rest: given that Starmie and Cloyster are common switch-ins once Amnesia is revealed and that Thunderbolt is a very, very uncommon attack on Snorlax, this set can attempt to lure them in and cripple them with a strong super-effective attack. Self-Destruct is preferred in the final slot as an emergency option that allows Snorlax to bail out of unsuccessful lure attempts with an even trade, but it is possible to use Rest instead in an attempt to preserve Snorlax as a long-term defensive answer. On this set, it is also possible to use Blizzard instead of Body Slam to avoid being completely walled by Rhydon, though it makes Snorlax much weaker against Chansey and Alakazam, so it is usually not preferred.</p> <p>Body Slam / Reflect / Rest sets can afford a few more options in the fourth moveslot. Toxic can allow partial trappers such as Cloyster, Moltres, Victreebel, and Dragonite to be significantly more dangerous, as any poisoned Pokemon attempting to stall out their PP will run out of HP much more quickly, and Snorlax is particularly good at luring in optimal Toxic targets such as Reflect Chansey. Another move that can fill that slot is Amnesia, making Snorlax incredibly difficult to threaten via special attacks alone but ultimately leaving it relatively powerless, with Body Slam as its only attack. Counter is also viable, as after Reflect has been revealed, opponents will most likely stop playing around Counter, giving you some opportunities to net surprise KOs with it.</p> <p>Other Normal-type attacks such as Mega Kick and Double-Edge are rarely seen due to their drawbacks and overall lack of usefulness when Body Slam is such a reliable move and Hyper Beam is a much stronger one, but the ability to repeatedly hit with a greater Base Power can occasionally come in handy.</p> <h1>Checks and Counters</h1> <p><strong>Reflect Users: Reflect users, particularly Chansey and opposing Snorlax, can switch in on Body Slam and neutralize the damage output from Snorlax fairly efficiently. They are by far the most reliable defensive answers to Snorlax, and a vast majority of RBY teams are forced to include one of the two, if not both, to check it.</p> <p><strong>Gengar</strong>: Gengar deserves a special mention due to its unique Ghost typing, which allows it to wall all Snorlax sets that lack Earthquake and use Snorlax as an opportunity to threaten either status with Hypnosis or damage with Thunderbolt. It is especially useful against Snorlax sets that only run Normal-type attacks, but it also performs well against any set that lacks Earthquake or Amnesia (unless Snorlax gets a lucky freeze with Ice Beam).</p> <p><strong>Cloyster and Slowbro</strong>: Cloyster and Slowbro are the next best options to switch into Body Slam. Their high defensive stats allow them to come out of the one-on-one matchup on top, but their reliance on Rest to stay healthy and failure to pose a significant immediate threat mean they aren't always the most reliable answers to Snorlax. Slowbro is especially notable, as it can use a sleeping Snorlax as a golden opportunity to set up Amnesia; however, Cloyster has better physical bulk, allowing it to avoid a 4HKO from Body Slam, as well as the ability to use Explosion in case things start to go wrong after paralysis from Body Slam.</p> <p><strong>Other Special Attackers</strong>: Although there aren't many special attackers that enjoy taking a Body Slam to the face, many of them are powerful enough to 3HKO Snorlax, which means they can exert a lot of pressure over it, especially when it's forced to use Rest and sit still for a few turns. Starmie, Lapras, Exeggutor, and Zapdos are some good examples of Pokemon that can force Snorlax out with their strong STAB attacks.</p> <p><strong>Porygon: Although Porygon's base stats are pitiful, it has access to a very specific set of qualities that make it just good enough to handle Snorlax: it is faster, it is immune to Body Slam's paralysis due to its typing, and Recover's 32 PP allow it to outstall Body Slam's 24 PP. Snorlax's only hopes of breaking down Porygon usually rest on the possibility of landing either a critical hit with Body Slam or a freeze with Ice Beam; however, Porygon is very weak, and it is incredibly easy for the Snorlax player to simply switch out.</p> <p><strong>Rock-types Carrying Rest</strong>: Another very specific countermeasure, Rock-types carrying Rest are generally able to outstall any Snorlax variant that isn't carrying the specific coverage for them. As long as the Rock-type has Rest to stall out repeated Body Slams, there are quite a few of them that can win the one-on-one matchup: non-Earthquake Snorlax will be unable to break through Omastar and Kabutops, non-Ice Beam Snorlax will struggle to wear down Aerodactyl, and even Rhydon can beat a Snorlax in the long run if Snorlax is only carrying Normal-type moves.</p> ",
    "sets": [
      {
        "name": "Reflect",
        "description": "<h1>Set Description</h1> <p>Snorlax's Body Slam is one of the most difficult attacks to switch into in the tier due to its sheer power, its paralysis chance, and the relative lack of Normal-type switch-ins in the tier. Reflect allows Snorlax to take on physical attackers, most importantly opposing Snorlax, much more comfortably. Rest gives Snorlax the ability to remain healthy throughout the game. A lot of moves can fit in the last moveslot. The most common one is Ice Beam, as it allows Snorlax to potentially freeze opposing Reflect users, which can otherwise neutralize its Body Slam; however, this leaves Snorlax unable to threaten large amounts of damage in one turn, which means its matchup against many important Pokemon such as Exeggutor, Zapdos, Cloyster, and Lapras goes from bad to worse, and even its ability to power through a paralyzed Starmie or Chansey goes down significantly. Self-Destruct allows Snorlax to function as a wallbreaker if needed, as well as a defensive piece thanks to Reflect and Rest if preferred, while Hyper Beam provides some of Self-Destruct's wallbreaking power without you having to sacrifice your Snorlax for it; however, a Snorlax that is only carrying Normal-type attacks will struggle against Rock-types and will be entirely unable to damage Ghost-types. Lastly, although Earthquake doesn't provide the freeze threat of Ice Beam or the immediate power of the other moves, it allows Snorlax to beat Gengar and Counter Chansey, two Pokemon that, albeit rare, are usually specifically devised to beat it.</p> <p>Using Reflect Snorlax is particularly nuanced due to having to balance Snorlax as both an offensive and defensive tool. If used too aggressively, it might take a KO but subsequently struggle to find turns to heal back up with Rest, making it a trade that is not always worth taking. On the other hand, if used too passively, it will invite too much offensive pressure and eventually collapse without achieving much of anything. Optimal usage of Reflect Snorlax requires careful analysis of the game state as well as appropriate prediction, but when properly managed, it is incredibly potent, as the special attackers that can threaten it lack either recovery or physical bulk, meaning that teams will generally resort to various stalling tactics to force Snorlax to use Rest first and then pressure it during its sleep turns. Reflect Snorlax is at its best early-game when the opponent has one or more paralyzed Pokemon to take advantage of, most commonly Alakazam and Chansey, and when its teammates can offer the necessary defensive cover against special attackers, but it is no slouch late-game either, as it can trade one-for-one with most Pokemon and has an important positive matchup against Tauros.</p> "
      },
      {
        "name": "Physical Attacker",
        "description": "<h1>Set Description</h1> <p>This moveset is fairly straightforward: maximize offensive prowess to wallbreak as well as possible. Body Slam is the go-to attack to inflict damage, and combined with Hyper Beam, it makes Snorlax particularly dangerous and hard to switch into, especially for paralyzed foes. Self-Destruct is an incredibly potent move to take down an extra Pokemon with Snorlax's last breath or even to take opposing Pokemon by surprise earlier on if the situation calls for it. The last moveslot is a toss-up: Earthquake allows Snorlax to play around Counter Chansey much more comfortably, as well as hitting Gengar and threatening Rhydon, but it can be dropped in favor of Counter, a tool that allows this Snorlax set to muscle through an opponent's Reflect Snorlax with correct prediction. Counter may also be used in conjunction with Earthquake and in place of Hyper Beam; the lack of Hyper Beam is quite noticeable, as it makes Snorlax much less threatening as a wallbreaker, but Earthquake offers unique coverage that could be worth keeping for specific matchups.</p> <p>The absence of recovery on this Snorlax set makes it far riskier to utilize, as it can only take a few hits before being forced to use Self-Destruct. Therefore, this Snorlax set needs to be considered as a tool to accelerate the game and little else, as its defensive capabilities are very limited. This often just means using an early-game Self-Destruct on the opponent's Reflect user to remove them from the situation before they get a chance to set up Reflect. It must be noted that this is a one-for-one trade, which is not always advantageous, but it is often the best that can be achieved with this set, as it is often endlessly walled by Reflect users otherwise; recognizing when to be greedy and when to accept a simple Self-Destruct trade is key to achieving good results with this Snorlax set.</p> "
      },
      {
        "name": "Mixed Attacker",
        "description": "<h1>Set Description</h1> <p>Body Slam is the main attack to create pressure on the opposition and hopefully bait in Reflect Snorlax, which this set can take advantage of thanks to the combination of Amnesia and Blizzard. The last move defines the type of game you want to play with this set: Self-Destruct means hard and fast wallbreaking, as Snorlax simply doesn't have the durability to set up Amnesia multiple times throughout the game, while Rest gives Snorlax those opportunities to set up but leaves it notably vulnerable to Tauros. Ice Beam is an option over Blizzard for the higher PP, which is especially relevant on Rest sets, but Blizzard's considerably greater damage output is generally preferred.</p> <p>This set is quite dangerous to play against due to how difficult it is to answer if your Chansey is paralyzed. Nearly every other common Pokemon is threatened by either Body Slam or a boosted Blizzard, with Water-types like Starmie and Lapras being the best answers defensively but struggling to deal significant damage in return thanks to the Special boost. However, a healthy Chansey usually has no issues switching in and walling this Snorlax variant until it's forced to use Rest, which, in turn, leaves it vulnerable against Tauros. The conditions for this set to excel are difficult to set up, but when they are achieved, this Snorlax set can decide games on its own.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Earlier versions by", "members": [{"user_id": 42885, "username": "Crystal_"}, {"user_id": 43880, "username": "Alan"}]}, {"name": "Quality checked by", "members": [{"user_id": 254408, "username": "Lusch"}, {"user_id": 424525, "username": "FriendOfMrGolem120"}]}, {"name": "Grammar checked by", "members": [{"user_id": 175616, "username": "Empress"}, {"user_id": 232216, "username": "The Dutch Plumberjack"}]}], "writtenBy": [{"user_id": 265630, "username": "Amaranth"}]}
  },
  "Articuno": {
    "overview": "<p>Boasting one of the highest Special stats in the game along with the most powerful special move in OU, Blizzard, there's no denying that Articuno is a powerhouse. OHKOing Golem and Rhydon and 2HKOing Exeggutor are feats few Pokemon can muster, but Blizzard allows Articuno to do just that. It can force switches and deal heavy damage throughout the match, softening up your opponent's team and possibly causing a freeze. It can even make for a very nice end-game sweeper by boosting its mediocre base 85 Speed with Agility and blasting away with its STAB Blizzard, potentially getting a freeze in the process.</p> <p>Why isn't Articuno more common, then? Again, its Speed stat is frustratingly low, as it is not able to outspeed Pokemon like Tauros and Alakazam without a boost, while both are capable of paralyzing Articuno. It is walled to kingdom come by the many OU Pokemon that resist Blizzard, namely Lapras, Starmie, Cloyster, and to an extent, Slowbro, as well as Chansey with its massive 250/105 Special bulk. Its movepool is shallow as well, as it leaves Articuno relying on mediocre Ice / Normal coverage, the latter of which runs off its so-so Attack stat. Other Ice-types such as Lapras and Cloyster are generally preferred, due to access to helpful moves such as Thunderbolt and Explosion respectively. However, they can never dream of matching the raw power of Articuno's Blizzard. All-in-all, if you are looking to unleash a nasty surprise on your opponent, don't overlook Articuno.</p> ",
    "comments": "<h1>Other Options</h1> <p>With Articuno's barren yet focused movepool, there are very few other options it can run. Mimic is probably the best unlisted option, as if Articuno gets lucky enough to copy Thunderbolt from Starmie, it will always 2HKO back. Reflect is another option to help Articuno absorb Body Slam from Snorlax and even Rock Slide from Golem and Rhydon should it find itself paralyzed against them. It also helps Articuno win against Tauros, who needs Body Slam critical hits to win. However, it is typically only useful when your opponent's special walls are gone, as they don't care at all whether Reflect is up.</p> <h1>Checks and Counters</h1> <p><strong>Water-types: Although Articuno's Blizzard is a frosty nuke and no Pokemon enjoys a freeze, there are quite a few solid counters to it. Lapras and Cloyster are some of the best Articuno counters, as they 4x resist Blizzard and can wear it down with any of their attacks. Starmie has to worry about the freeze chance, but can otherwise shrug off all of Articuno's attacks with Recover and threaten it back with any attack of its choosing. Cloyster also 4x resists Blizzard and has a ton of physical bulk, allowing it to absorb any physical attacks that Articuno might be running, then threaten either Articuno or a switch-in with Clamp, Blizzard, or Explosion. Slowbro is also a decent Pokemon to send out against Articuno one-on-one because it can paralyze it with Thunder Wave, but switching in is not recommended because it takes about 50% from two Blizzards before it even has a chance to move.</p> <p><strong>Special walls: Chansey is as good a special wall as ever, shrugging off attacks with Soft-Boiled and firing back with Thunderbolt or Seismic Toss. It also takes 37.9 - 44.6% from Hyper Beam, so it has little hope in getting the chance to use Soft-Boiled if its health is low. Alakazam can also use Thunder Wave, Recover off any damage, and spam Psychic until Articuno eventually faints, but it is 3HKOed by Blizzard, meaning it needs to be weary of switching in if paralyzed or weakened.</p> <p><strong>Electric-types: Though they are far from solid defensive checks to Articuno, Zapdos and Jolteon naturally outspeed it and can 2HKO it with Thunderbolt, which makes them effective offensive options to take it down if no more defensive options are available.</p> ",
    "sets": [
      {
        "name": "Standard",
        "description": "<p>The best way to get Articuno on the field is to switch it in when you predict that your opponent will switch in Exeggutor; if it has lost over 33% of its health already, Blizzard is a guaranteed KO. It can also switch in on a predicted Earthquake from Snorlax or Tauros, dealing heavy damage with Blizzard and hopefully causing a freeze. Rhydon and Golem are a bit harder to switch in on, as Rock Slide will KO Articuno, but if you are fortunate enough to switch in on Earthquake, Blizzard will OHKO either. Double-Edge does chip damage to Lapras, who laughs at a 4x resisted Blizzard, as well as Starmie. Don't use Double-Edge against Chansey though, as it only does 5% more than Blizzard, causes recoil, and does not have a freeze chance. Don't use Agility until the late-game, when the remains of your opponent's team are within KO range. Finally, Hyper Beam is there to finish off weakened Chansey and Alakazam.</p> <p>Ice Beam is a viable alternative over Double-Edge for a 99.6% accurate STAB, but it is significantly weaker than Blizzard and further weakens Articuno against Lapras and Starmie. Rest is great for recovering from status, allowing Articuno to act as a status sponge throughout the battle until you need it again. Another interesting option Articuno has is Sky Attack, which is its most powerful physical attack, possessing a huge 210 Base Power after STAB. With a critical hit, it is guaranteed to OHKO Chansey and has a 52% chance to OHKO Starmie; without a critical hit, it has a 46% chance to OHKO Alakazam, who would normally be 3HKOed by Blizzard. However, it forces you to lose an entire turn and is difficult to find a slot for.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Earlier version by", "members": [{"user_id": 19, "username": "Hipmonlee"}]}, {"name": "Quality checked by", "members": [{"user_id": 42885, "username": "Crystal_"}, {"user_id": 53302, "username": "Jorgen"}]}, {"name": "Grammar checked by", "members": [{"user_id": 159055, "username": "relaunched"}, {"user_id": 77748, "username": "Jukain"}]}], "writtenBy": [{"user_id": 40064, "username": "NixHex"}]}
  },
  "Zapdos": {
    "overview": "<p>Zapdos is without a doubt the best Electric-type in the metagame thanks to its high stats and two powerful moves in Thunderbolt and Drill Peck. It is an incredible late-game sweeper, being a mixed attacker on top of having access to Agility. However, Rhydon and Golem hinder Zapdos's effectiveness. While they do take slight chip damage from Drill Peck, they can't be hit by any of Zapdos's other moves and must be dealt with by the rest of the team. Due to this, Zapdos generally requires minor support to work effectively in all matchups, keeping it from being considered one of the best Pokemon in the metagame.</p> ",
    "comments": "<h1>Other Options</h1> <p>Rest is an option for Zapdos to get some HP back, but you'll rarely ever get the chance to use it. Generally, Zapdos should be attacking or use Thunder Wave anyway; there's not a lot of room to put it on the set, as you lose out on either a pivotal attack, the ability to consistently paralyze opposing Pokemon, or the ability to pull off a late-game sweep. Thunder is usable to OHKO Starmie and to 2HKO Tauros and Slowbro, but it is not as used due to its poor accuracy. Toxic is a nice option in order to pressure the Rock-types, but this is generally not worth using over other moves. Final options for Zapdos are Reflect and Light Screen. Generally you would choose one over the other and replace Agility. Having Reflect or Light Screen up mid-game can be incredibly useful; however, due to Zapdos's lack of recovery without Rest, which is already noted to be unreliable, this option is generally not favored. The combination of Rest and Reflect can also be good at letting Zapdos check the Rock-type Pokemon that it usually loses to, but it risks taking a potential critical hit from Rock Slide.</p> <h1>Checks and Counters</h1> <p><strong>Ground-types: The Ground-types of the metagame, Rhydon and Golem, are Zapdos's biggest threats to deal with. They soak up any attack Zapdos has to offer, which forces you to play around them before Zapdos can be effective. One can scout early-game for these Pokemon, but if you spend the whole game trying to play around them, you may find yourself in a pickle by late-game.</p> <p><strong>Electric-types: Electric-types like Jolteon can also make good checks to Zapdos, although unlike the above Ground-types, they are susceptible to Thunder Wave. Jolteon would preferably use Rest to better check Zapdos, but ones without Rest work as well. Zapdos itself gets a special mention because it can come in on a Drill Peck to create an even matchup. Despite this, it is still worse than Jolteon as a check, as it is neutral to Thunderbolt damage which should be noted is unable to paralyze Electric-types making it a bit harder for Zapdos to switch in.</p> <p><strong>Chansey: Chansey can act as a good check to Zapdos thanks to its high Special Defense and access to Reflect, but it is generally unfavorable as a check due to the tendency of Drill Peck landing a critical hit.</p> ",
    "sets": [
      {
        "name": "Mixed Attacker",
        "description": "<h1>Set Description</h1> <p>Thunderbolt and Drill Peck are Zapdos's STAB moves. Zapdos hits most targets for strong damage, comfortably 3HKOing Tauros and threatening 3HKOs on Snorlax and Alakazam. However, it should be noted that Thunderbolt cannot paralyze other Electric-types. Drill Peck hits two of the main Pokemon that tank Thunderbolt, Exeggutor and Chansey. Exeggutor is sometimes 2HKOed by Drill Peck, and while Chansey can take two Drill Pecks comfortably, it tends to lose to repeated Drill Pecks, as it can't hit Zapdos very hard, and a single critical hit or full paralysis tends to end the fight in Zapdos's favor. However, Chansey does have access to Reflect to increase its chances of winning the matchup. Thunder Wave is used to paralyze Pokemon such as Tauros and Chansey to give openings for Zapdos to sweep late-game or get a chance to prevent recovery to get an extra turn of damage. Agility can be used on a free turn to allow Zapdos to outspeed faster threats like Alakazam and Tauros. It can also be used to remove the Speed drop from paralysis, which can allow Zapdos to sweep through Pokemon that would otherwise revenge kill it.</p> <p>In general, you want to keep Zapdos as healthy as possible throughout the match in order to give it sweeping potential. However, this doesn't mean that you should keep it in the back the whole game, as it has a lot of potential to be useful in the early- and mid-game stages. For example, Zapdos can take advantage of sleeping Pokemon such as Snorlax as long as it comes in on the turn the Pokemon uses Rest. One should try to use Zapdos to spread status through Thunder Wave. This is especially helpful to do on a Pokemon like Chansey, which can be prevented from recovering through status, allowing Zapdos to potentially 3HKO with Drill Peck. Early-game, be sure to scout for the Ground-types of the tier, Rhydon and Golem. Do this with Pokemon like Exeggutor, Tauros, Cloyster, and Lapras, which can pressure them through super effective or status moves. Tauros is probably the best example there, as it has a great matchup versus Exeggutor, Snorlax, Chansey, and Tauros, as well as being a great late-game cleaner on top of that. You could also lure them out with Zapdos itself, which can be done fairly early on, putting you at an information advantage. Whether or not you manage to find a Rock-type, though, you should keep Rock-type checks like Exeggutor and Lapras healthy so they better check them if they come out later in the match. Don't use Agility unless most Pokemon on the opposing team are weakened enough for Zapdos to sweep. To give a reference frame, you should probably wait until Pokemon like Snorlax and Chansey have about a third of their health left. However, if they Rest, you can take advantage of them earlier.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 327320, "username": "Aliss"}, {"user_id": 263906, "username": "Zokuru"}]}, {"name": "Grammar checked by", "members": [{"user_id": 53214, "username": "JockeMS"}, {"user_id": 232216, "username": "The Dutch Plumberjack"}]}], "writtenBy": [{"user_id": 322194, "username": "Yoshi"}]}
  },
  "Moltres": {
    "overview": "<p>Moltres stands out as the strongest special attacker in RBY OU, tied with Articuno. It shares a lot of strengths and weaknesses with the other legendary bird: Moltres can also 2HKO Tauros and threaten Snorlax significantly while nailing Exeggutor and having Agility to clean up late-game. However, it too has a hard time breaking through very common special walls such as Starmie and Chansey, which holds it back tremendously. Should these walls be incapacitated or removed, Moltres can wreak havoc and make great use of its titanic Special stat.</p> <p>Due to these shared traits with Articuno, it is worth analyzing where they differ to understand which fits your team best. Moltres has access to Fire Spin in tandem with higher Attack, giving it a stronger Hyper Beam. These two qualities allow Moltres to muscle through checks like Starmie and Chansey more effectively than Articuno, especially when these Pokemon have been paralyzed and chipped beforehand. Moltres also possesses no hard walls: while Articuno really struggles against Lapras and Cloyster, there aren't any Pokemon that shut down Moltres quite so hard. However, Moltres's lower physical bulk and a weakness to Ice make it considerably easier to take down. Additionally, the type chart is unkind to Fire-type attacks in RBY, making Moltres considerably weaker in various matchups compared to Articuno, such as Zapdos and especially Rhydon. Furthermore, Fire Spin's accuracy makes it very unreliable; Fire Blast also suffers from this problem to a lesser degree. Overall, Moltres is a phenomenal late-game threat, despite being niche overall, as the ability to beat Tauros one-on-one is of crucial importance; while supporting it can be difficult, this Pokemon remains a sweeping threat that can tear down passive builds.</p> ",
    "comments": "<h1>Other Options</h1> <p>Moltres possesses a few other viable moves, but they are all hard to justify in most cases. Double-Edge gives it a strong move to hit Chansey on the switch, and to a lesser extent Starmie, which might make its job of taking down these checks a little easier, though you will usually be content to source your extra damage from an additional Fire Spin. Sky Attack hits for over 50% on both Starmie and Chansey, threatening to OHKO on a critical hit, but it requires good prediction to get away with the charge turn. Toxic allows Moltres to functionally empower its own Fire Spin without needing to land a Fire Blast burn, which helps with working around Chansey as long as Moltres can chain enough Fire Spins without missing.</p> <h1>Checks and Counters</h1> <p><strong>Water-types: Starmie and Slowbro stop Moltres dead in its tracks thanks to their great special bulk and lack of concern for burns, which allows them to switch into Fire Blast frequently. Starmie is particularly brutal, being faster and threatening hefty damage with any of Blizzard, Thunderbolt, or Surf, or even paralysis from Thunder Wave. Slowbro can use Moltres as setup fodder after paralyzing it, usually forcing it to try and pivot out with Fire Spin as to not give it a free Amnesia boost, though it needs to be wary when burned, as Fire Spin chains can rapidly rack up sufficient residual damage for Moltres to KO it.</p> <p><strong>Chansey: Chansey can put a hard stop to Moltres thanks to its gargantuan Special bulk; however, Moltres outspeeds it and can therefore stop it from recovering with Fire Spin. Therefore, it can muscle through Chansey with some luck, especially with a Fire Blast burn alongside Fire Spin, as Hyper Beam hits for over 40%. However, this can be quite risky for Moltres, as a miss lets Chansey cripple its late-game with Thunder Wave.</p> <p><strong>Jolteon and Zapdos</strong>: While neither is particularly willing to take a Fire Blast, both Jolteon and Zapdos outspeed Moltres while 2HKOing it with STAB Thunderbolt. However, Moltres can beat a chipped or resting Jolteon, having a good shot at 2HKOing it with Fire Blast + Hyper Beam.</p> <p><strong>Rhydon</strong>: While it looks enticing to switch Rhydon in on Fire Blast, its pathetic Special makes it take surprisingly high damage; there is even a chance of a 3HKO. Additionally, being burned is an utter death sentence for Rhydon, making it little more than fodder in the long run. However, Rhydon is otherwise one of the better Moltres checks, absorbing Hyper Beam well and PP stalling Fire Spin better than most OU staples, all while having an OHKO against it in Rock Slide; if it drops Rock Slide in favor of Rest, it gives up the OHKO, but it gains the ability to heal off the burns and can stall Moltres out of Fire Blasts, which is just as good.</p> ",
    "sets": [
      {
        "name": "Standard",
        "description": "<h1>Set Description</h1> <p>Fire Blast is the main draw to Moltres. It threatens significant damage to a majority of the tier, including notable 2HKOs on Tauros, Exeggutor, and Cloyster, and has a nice 30.1% burn chance that forces sturdier physical attackers such as Snorlax and Rhydon to tread very carefully around Moltres. However, much like most special attackers in RBY OU, it must contend with the existence of Chansey and Starmie. These two Pokemon can comfortably heal off all damage taken by Fire Blast, and due to Fire Blast only having 8 PP, Moltres usually doesn't want to waste any on Pokemon that can just shrug it off; furthermore, landing a burn on these Pokemon can sometimes be counterproductive, as it removes the option of paralyzing them. Moltres packs a relatively powerful Hyper Beam to help it deal with special walls, thankfully; in tandem with a Fire Blast, it can hit both Chansey and Starmie for over 60% of their HP over two turns, meaning that, if such walls have been weakened, it stands a good chance of finishing the job. Agility is extremely helpful to ignore the Speed drop from paralysis and gain the upper hand on other fast late-game Pokemon such as Tauros and Zapdos; it is especially powerful in combination with Fire Spin, as a fast partial trapping move completely shuts down the opponent's ability to attack as long as it doesn't miss. Fire Spin excels when the opposition has been statused; it has great synergy with paralysis, which enables Moltres to move faster than any foe even without setting up Agility, and with burn, as repeatedly stopping the foe from moving racks up burn damage.</p> <p>Moltres's specialty is cleanup. If you are running Moltres, you ought to spend the early-game trying to cripple, chip, and potentially even remove the opposing Chansey and Starmie. Moltres is very unconventional in that it doesn't synergize particularly well with the two most powerful statuses in RBY, freeze and sleep. Fire Blast will thaw frozen opponents, and Fire Spin provides sleeping enemies with opportunities to wake while only taking minimal damage per turn. This means Moltres needs a very deliberate plan early-game and beyond to weaken checks and make your opponent play into your hand, especially against Starmie. Many teams are willing to let Starmie absorb sleep early-game, which is great for other Pokemon that struggle with it, like Articuno and Slowbro, but Moltres's resisted Fire Spin is the perfect opportunity for Starmie to burn sleep turns. You might want to try luring your opponent into letting you sleep a different Pokemon, even forgoing sleep altogether if you are feeling creative, or hoping sleeping Starmie falls victim to players' willingness to sacrifice sleeping Pokemon. Similarly, it won't be much use gambling your early-game trying to freeze a Chansey.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 424525, "username": "FriendOfMrGolem120"}, {"user_id": 233818, "username": "Enigami"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}, {"user_id": 301217, "username": "Bandkrook"}]}], "writtenBy": [{"user_id": 265630, "username": "Amaranth"}, {"user_id": 236353, "username": "Plague von Karma"}]}
  },
  "Dragonite": {
    "overview": "<p>It's got a wide attacking movepool. It's tied with Mew for the second-highest Base Stat Total in the game. It's the only fully-evolved Dragon-type in RBY, a type that sounds legendary on its own and that resists the STAB attacks of all three starter Pokemon. It's the final Pokemon used by Lance, the fourth member of the Elite Four. Clearly, Dragonite was intended to be some sort of legendary behemoth, the boss Pokemon to end all boss Pokemon, at least until the player found Mewtwo. However, in competitive usage, Dragonite is more likely to elicit groans and grimaces of irritation rather than the intended screams and wide eyes of terror. This is because Dragonite's power in OU does not derive from Hyper Beam, its massive base 134 Attack, its typing, or its diverse Special movepool. Rather, it's because of an annoying little move that its lowly first-stage evolution, Dratini, knows from the start: Wrap.</p> <p>Wrap's mechanics differ drastically in RBY compared to later generations; the move has a mere 15 Base Power, but it prevents the opposing Pokemon from making a move while the Wrap user is locked into this move for 2-5 turns. Furthermore, the immobilized opponent cannot attack even during the turn the Wrap user switches out, providing a safe entry for another Pokemon. However, unlike in other generations, the opponent might switch out the Pokemon that is incapacitated by Wrap. Dragonite is the best Wrap user in RBY because it, unlike any other RBY Wrapper, also has access to Agility to make it faster than any other Pokemon in the game. If Dragonite gets lucky and hits all of its Wraps, it can totally sweep a team without the opponent even being able to move. This sounds broken, and indeed, some RBY players play with bans on Wrap and all other moves like it (Bind, Clamp, Fire Spin) because of their potential. However, Dragonite might always miss a Wrap or two, leaving it vulnerable to getting paralyzed or shellacked by an Ice-type move. It is this unreliability that prevents Dragonite from being considered a staple of RBY OU when Wrap is allowed. When Wrap is not allowed, Dragonite is barely worth mentioning in OU due to its lack of STAB, mediocre Speed, and disastrous 4x weakness to the ubiquitous Ice Beam and Blizzard.</p> ",
    "comments": "<h1>Other Options</h1> <p>Dragonite makes good use of Thunderbolt to hit Cloyster hard and dish out decent damage against Lapras on the switch in, both of which can scare Dragonite out with the threat of an OHKO with Blizzard. Thunder Wave can be useful against switch-ins that are typically difficult to paralyze, such as Gengar and Starmie, that Dragonite is bound to see. Body Slam blends damage with paralysis chance if you don't want to give up an attacking move for paralysis. Double-Edge is slightly stronger than Body Slam at the cost of not being able to paralyze and causing recoil damage. As finisher moves, both options have an advantage over Hyper Beam by not having to recharge if the opposing Pokemon is not KOed; the lower Base Power makes these moves unfavorable choices, however.</p> <h1>Checks and Counters</h1> <p>Gengar is the chief check as it's immune to Wrap and takes a pittance from any of Dragonite's other options. It doesn't really accomplish much against Dragonite, though, but will generally outlast non-Blizzard Dragonite one-on-one in a battle between unSTAB-boosted special attacks. Powerful Blizzard users, such as Lapras, Cloyster, Articuno, and, to an extent, Jynx, can all scare Dragonite out with the threat of an OHKO. The former three are very physically bulky and will be able to take several hits before dying, which makes it all the more likely that Wrap will miss at some point. Exeggutor and especially Slowbro are also very bulky and can threaten Dragonite with paralysis, but apart from that, they won't generally be able to handle Dragonite on their own. Chansey and Starmie are resilient with their instant recovery and usually carry Ice moves that can 2HKO Dragonite. These two can also paralyze Dragonite with Thunder Wave and force it to risk full paralysis in addition to Wrap misses. Note that Dragonite can use Agility again to completely ignore the Speed reduction from paralysis and resume being faster than all of your Pokemon. On the other hand, however, as full paralysis can also occur in the middle of a Wrap sequence, paralysis will severely limit Dragonite's potential. Its often even advised to go for the guaranteed paralysis with Thunder Wave instead of using an unSTAB-boosted Ice-type attack that will not OHKO.</p> <p>Any Pokemon that has enough health to take Dragonite's Hyper Beam can switch in to this predicted finishing move to cripple or KO Dragonite. When the opposing Pokemon is in KO range from Hyper Beam, the Dragonite user is likely to use it instead of Wrap, to avoid the possibility of an untimely Wrap miss. Punishing a predicted Hyper Beam could give you the possibility of paralyzing or KOing Dragonite. However, proper prediction is required as Dragonite could continue using Wrap, which by itself still has a high success rate against the weakened opponent. Pokemon that resist Normal-type moves, such as Golem and Rhydon, might even be surprised by Surf, which will OHKO them.</p> <p>It's important to note that, if given the chance, using the turn Dragonite uses Agility to cripple it is crucial. Even if you can only land one move that won't do much to Dragonite, such as Body Slam or Psychic, it may still be very rewarding later on, as it will increase the chances of any Ice-type move OHKOing Dragonite. In addition, Body Slam might also score paralysis, which will often ruins Dragonite's ability to effectively sweep.</p> <p>If all else fails, you can try to stall it out of Wrap PP if you can count carefully to 32. Wrap is very weak and locks Dragonite into Wrap if it chooses to stay in, regardless of whether you choose to switch or stay in yourself. Thus, you can repeatedly switch out to force Dragonite to use more turns which read \"Dragonite used Wrap!\" and that therefore cost PP as opposed to the \"Its attack continues!\" turns that do not use PP. However, if you miscount and switch out after Dragonite has used its last Wrap PP, Dragonite will still be forced to use Wrap PP, but instead of forcing Dragonite to use Struggle, RBY glitches and rolls Wrap's PP counter up to 63 to allow it to use Wrap again, thereby rendering your stall for naught. This strategy works much more effectively if you have Golem or Rhydon on your team, as otherwise you will have to sacrifice at least one Pokemon before Wrap runs out of PP.</p> ",
    "sets": [
      {
        "name": "AgiliWrap",
        "description": "<p>Here it is, possibly the most annoying set in all of Pokemon history. It's more than just annoying, however; it's absolutely deadly if luck is on your side. Agility boosts Dragonite's Speed above that of any unboosted Pokemon in the game. It then proceeds to take advantage of Wrap's debilitating mechanics by repeatedly using the move to render any switch-in unable to move, while slowly whittling away at the opposing Pokemon's health. Wrap can even be used to immobilize Gengar, which is immune to Normal-type moves, although Gengar is unlike other Wrap victims in that it does not take damage while incapacitated by Wrap. It is, however, not easy to find a good moment to use Agility, due to the prevalence of Ice-type and paralysis-inducing moves in RBY. Switching into the occasional sleeping or frozen Pokemon lets Dragonite set up Agility safely, however. Otherwise, slow Pokemon such as Golem, Rhydon, Snorlax, and Exeggutor that lack Stun Spore are good options to switch in and set up on. Taking a hit from them, however, means that Dragonite is now OHKOed by unSTAB-boosted Ice-type attacks.</p> <p>Once the opponent's Pokemon has been worn down to low enough health, Dragonite can use one of its other two attacking moves to secure the KO. Hyper Beam is generally the best option, as it is the strongest attack in Dragonite's movepool. Dragonite will usually be able to avoid Hyper Beam's incapacitating side effect as Wrap is meant to first put Pokemon in Hyper Beam's OHKO range. It lacks STAB, but comes from a base 134 Attack stat. Surf is the preferred option in the last slot as it guarantees an OHKO on the Rock / Ground types Golem and Rhydon. Blizzard can be used in its place to heavily damage Golem and Rhydon, but also to give Dragonite its best direct attack to use against Gengar. It also works as an alternative finishing move for Pokemon such as Zapdos and Exeggutor and, unlike Hyper Beam, does not force Dragonite to recharge if it does not OHKO.</p> <p>Dragonite is generally saved for a sweep and, as such, appreciates support from teammates that can spread paralysis directly. Not only does paralysis make Dragonite faster than the opponent without it having to use Agility, but a full paralysis might also save Dragonite if Wrap misses. Alakazam, Chansey, Starmie, Exeggutor, Slowbro, and Zapdos are all Pokemon that can perform that role excellently. The former options can tank hits from many threats as well, while the latter two provide more offensive pressure. The choices should depend on how offensive you want your team to be, although it should be noted that Alakazam and Slowbro are generally the best options to spread paralysis.</p> <p>In addition, Dragonite is able to do more than merely sweep with Wrap; if it gets in on a predicted switch to a slow Pokemon, such as Exeggutor, Snorlax, or Chansey, or on a predicted Earthquake from Rhydon or Golem, it can use Wrap against whatever your opponent might decide to switch in. Dragonite can then switch out to a counter, which is guaranteed to take no damage from the switch-in thanks to Wrap's immobilization effect. Dragonite's ability to act as a pivot makes it a decent mid-game partner for heavy-hitters such as Snorlax and Rhydon to let them switch in on paralyzed foes with impunity. Moreover, as Wrap can still immobilize Gengar, hard-hitters such as Snorlax, Rhydon, Golem, and Tauros also synergize well with Dragonite in this regard. If Gengar switches into Wrap, you can immediately go to a powerful sweeper without taking damage thanks to Wrap's mechanics. Earthquake will generally scare Gengar out, giving Dragonite the possibility of punishing whatever your opponent switches in.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 95, "username": "Pocket"}, {"user_id": 15210, "username": "Earthworm"}, {"user_id": 19, "username": "Hipmonlee"}]}, {"name": "Grammar checked by", "members": [{"user_id": 40064, "username": "NixHex"}, {"user_id": 45515, "username": "SkullCandy"}]}], "writtenBy": [{"user_id": 42885, "username": "Crystal_"}, {"user_id": 53302, "username": "Jorgen"}]}
  }
}