{
  "Raichu": {"sets": [{"name": "Sleeper"}]},
  "Nidoqueen": {"sets": [{"name": "Sleeper"}]},
  "Nidoking": {"sets": [{"name": "Lovely Kiss"}, {"name": "Amnesia"}]},
  "Clefable": {"sets": [{"name": "Amnesia"}]},
  "Persian": {"sets": [{"name": "Standard"}]},
  "Golduck": {"sets": [{"name": "Amnesia"}]},
  "Alakazam": {"sets": [{"name": "Standard"}]},
  "Victreebel": {"sets": [{"name": "Wrap"}, {"name": "Swords Dance"}]},
  "Tentacruel": {"sets": [{"name": "Wrap"}]},
  "Golem": {"sets": [{"name": "Standard"}]},
  "Rapidash": {"sets": [{"name": "Sleeper"}]},
  "Slowbro": {"sets": [{"name": "Standard"}]},
  "Cloyster": {"sets": [{"name": "Standard"}]},
  "Gengar": {"sets": [{"name": "Offensive"}, {"name": "Support"}]},
  "Hypno": {"sets": [{"name": "Amnesia"}]},
  "Kingler": {"sets": [{"name": "Swords Dance"}]},
  "Exeggutor": {"sets": [{"name": "Standard"}]},
  "Rhydon": {"sets": [{"name": "Standard"}]},
  "Chansey": {"sets": [{"name": "Reflect"}, {"name": "BoltBeam"}, {"name": "Counter"}]},
  "Seaking": {
    "overview": "<p>With the addition of Swords Dance into its movepool, Seaking manages to function as a competent setup sweeper. With STAB Surf as an added bonus, it also blasts through common Hyper Beam switch-ins, such as Rhydon. Agility distinguishes Seaking from its competing Swords Dance users, as, even when paralyzed, it still poses a threat to sweep if the opposing team has been damaged. Once set up, Seaking can be a difficult Pokemon to stop, KOing frailer Pokemon such as Persian and Jolteon from over 75% HP with Hyper Beam. Seaking is decently sturdy as well, surviving two hits from Starmie's Thunderbolt and Alakazam's Thunder Punch a significant majority of the time, giving it more opportunities to set up than Kingler.</p> <p>However, Seaking has to use both Swords Dance and Agility to pose any threat to the opposition. With only Surf and a single physical attack in its attacking moveset due to this—most likely Hyper Beam or the middling Double-Edge—Seaking is not surpassingly rewarding either, struggling to break through bulky Pokemon like Reflect Chansey. It's also completely incapable of breaking through the common Gengar and is struck with Thunderbolt in return; the improved coverage of staples like Thunder Punch for Alakazam and Hypno does not help its case either. Seaking is rarely seen in Tradebacks OU by account of its committal nature and unexceptional reward, normally finding itself competing with Kingler, which, while lacking Agility, has far better damage output for the effort put in.</p> ",
    "sets": [
      {
        "name": "Double Dance",
        "description": "<p>Swords Dance raises Seaking's Attack to acceptable levels, letting Hyper Beam land guaranteed OHKOs against Jynx and Alakazam, while Agility allows it to outrun the unboosted metagame and ignore the Speed drop from paralysis. A +2 Hyper Beam can also KO Pokemon such as Persian, Rapidash, Chansey, Jolteon, and Hypno if around 20% damage has been dealt prior. At +4, Seaking can OHKO Chansey, Hypno, Starmie, and even Tauros a third of the time. Surf covers Rock-types such as Rhydon, as well as dealing around 25% to Gengar, while also serving as an attack without a drawback.</p> <p>Seaking's movepool is barren but does have other options worth exploring; generally, it should always use a Double Dance set, or it's outclassed by Pokemon like Kingler. Blizzard is a plausible alternative to Surf for the freeze chance and 3HKOing Exeggutor and Zapdos, but the damage is otherwise unimpressive and it fails to OHKO Rhydon. Double-Edge, while having less drawback than Hyper Beam, is weak enough to largely diminish Seaking's threat level once set up. Hydro Pump may seem enticing, but it isn't compatible with the event-only Swords Dance, defeating its purpose.</p> <p>Seaking should commit to boosting only when it is possible to sweep. +4 Attack is needed to OHKO most Pokemon in the tier, and +2 Speed is needed to avoid being revenge killed by faster unparalyzed Pokemon. This amount of setup is daunting, but achievable. Seaking's bulk can withstand two hits from almost everything besides Razor Leaf or very strong Thunderbolts. Taking paralysis is also normally inconsequential in the process; thanks to its setup-heavy nature, Seaking is efficient as reapplying foes' Speed drops from paralysis if an opposing team has been riddled with it. Once Gengar, Electric-types, and Razor Leaf users are eliminated or confirmed to be absent, and extra-bulky Pokemon like Snorlax have taken a little damage, a single free turn can be all the opening Seaking needs to complete the three turns of setup needed to sweep. Against slower teams, Swords Dance can be all that's necessary to break through slower, bulkier Pokemon in Hypno, Chansey, and non-Reflect Snorlax variants. To achieve optimal conditions for a sweep, Seaking should be paired with consistent sleepers such as Jynx and Exeggutor, and Reflect Snorlax to check opposing Snorlax. Seaking is overwhelmed by Gengar, Zapdos, Jolteon, and Electabuzz, so Jolteon can be a helpful partner to safely switch into their attacks, while Seaking in turn can check Ground-types like Rhydon in a pinch for Jolteon. Rhydon, Chansey, and Alakazam can also check these Pokemon by comfortably switching into Thunderbolt, though, depending on the coverage of those Seaking checks, these partners might struggle to consistently switch in.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Plague von Karma", "user_id": 236353}], "teams": [{"name": "Quality checked by", "members": [{"username": "Enigami", "user_id": 233818}, {"username": "Torchic", "user_id": 43049}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Starmie": {"sets": [{"name": "Standard"}]},
  "Mr. Mime": {"sets": [{"name": "Hypnosis"}]},
  "Jynx": {"sets": [{"name": "Standard"}]},
  "Electabuzz": {"sets": [{"name": "Offensive"}]},
  "Tauros": {"sets": [{"name": "The Bull"}]},
  "Gyarados": {"sets": [{"name": "Standard"}]},
  "Lapras": {"sets": [{"name": "Standard"}]},
  "Vaporeon": {"sets": [{"name": "Growth"}]},
  "Jolteon": {"sets": [{"name": "Standard Rest"}, {"name": "Growth"}]},
  "Porygon": {"sets": [{"name": "Bulky Support"}]},
  "Aerodactyl": {"sets": [{"name": "Mixed Attacker"}]},
  "Snorlax": {"sets": [{"name": "Sleeper"}, {"name": "Reflect"}, {"name": "Amnesia"}]},
  "Articuno": {"sets": [{"name": "Sweeper"}]},
  "Zapdos": {"sets": [{"name": "Agility"}]},
  "Moltres": {"sets": [{"name": "AgiliSpin"}]},
  "Dragonite": {"sets": [{"name": "Wrap"}]}
}