{
  "Raichu": {"sets": [{"name": "Offensive"}]},
  "Sandslash": {"sets": [{"name": "Swords Dance"}]},
  "Nidoking": {
    "overview": "<p>Nidoking manages to find a niche in the Stadium OU metagame as a mixed sweeper thanks to Focus Energy. The move boosts its critical hit rate to a fearsome 62%, which, alongside its perfect coverage and decent attacking stats to back them up, allows it to deal huge damage. In addition, Nidoking has a solid Speed tier that enables it to outpace everything up to Articuno. Its typing isn't entirely without merit, either, as it walls Jolteon and grants it an important immunity to Thunder Wave, a trait that is unique among viable Focus Energy users.</p> <p>Nidoking has its drawbacks, though. Its horrid defensive typing burdens it with weaknesses to Psychic, Ice, and Ground and leaves it without a resistance to Flying, making it a shakier Zapdos check than Rhydon and Golem. To make matters worse, it's outsped by metagame staples such as Alakazam, Starmie, and Tauros, all of which 2HKO Nidoking. This fragility makes paralysis support a necessity to get the most out of Nidoking. On that note, while Nidoking itself is immune to Thunder Wave, it still hates paralysis and can be crippled by Body Slam or Stun Spore. Additionally, Nidoking is unreliable, as it requires setup and, even after setting up, scoring a critical hit is inconsistent. Nevertheless, with the proper support, it can be an effective addition to a team.</p> ",
    "sets": [
      {
        "name": "Focus Energy Sweeper",
        "description": "<p>Focus Energy significantly boosts Nidoking's critical hit rate, making it very difficult to switch into. Earthquake is Nidoking's most powerful attack; it needs just one critical hit to OHKO Alakazam and 2HKO Starmie and Chansey. Nidoking 2HKOes Tauros and Snorlax as well if it scores two critical hits, but it only has a 38.4% chance to do so. Blizzard is necessary in the third moveslot, as it gives Nidoking the best shot at muscling through Rest Exeggutor before it can retaliate. It has other uses besides this; a critical hit is guaranteed to OHKO Rhydon and Golem and will usually let Nidoking 2HKO Zapdos, and it has a small freeze chance, letting it KO Pokemon it normally would not be able to as a last resort. Finally, with a single critical hit, Thunderbolt 2HKOes Slowbro and OHKOes the rare Cloyster after a little chip damage.</p> <p>For Nidoking to fulfill its role effectively, it should be kept away from damage and status whenever possible, and faster Pokemon such as Alakazam and Starmie should be paralyzed before it attempts to set up for a sweep. This is easier said than done due to Team Preview, meaning your opponent will know that you have Nidoking on your team and will try to keep these Pokemon as healthy as is feasible so they can keep it in check. Getting Nidoking on the field is not a simple task either due to its horrific defensive typing allowing it to be hit for super effective damage by most metagame staples, but it still has some decent opportunities to switch in and set up with Focus Energy. The most obvious would be the aforementioned Jolteon, which is unable to do anything meaningful to it. Once again, though, your opponent will be aware of Nidoking and will be able to prepare for it by switching out. Another good chance to switch in is on a predicted Rest from Pokemon like Exeggutor. There is also an element of risk here, as most Rest users can predict the switch and deal major damage with their coverage moves, preventing Nidoking from setting up.</p> <p>Slowbro and Starmie are good partners for Nidoking, as they resist Ice, Psychic, and Water and provide paralysis support for it. Slowbro in particular is adept at drawing in enemy Starmie to paralyze it. In return, Nidoking can protect them from Electric-type moves. Exeggutor is another Pokemon that can spread paralysis, but it differentiates itself from Slowbro and Starmie with a handy resistance to Ground that can make the Rhydon matchup easier.</p> <p>Thanks to its immense movepool, Nidoking has plenty of room for customization. Substitute can be used in order to protect it from status and critical hits, but it can be difficult to set up alongside Focus Energy, and it puts Nidoking in OHKO range of Rhydon, Alakazam, and Exeggutor. Ice Beam is a more accurate alternative to Blizzard, but it requires an additional critical hit to 2HKO Exeggutor and almost never OHKOes Rhydon and Golem even with a critical hit. Thunder has poor accuracy, but it can be used instead of Thunderbolt; the greater power allows a critical hit to OHKO Cloyster and KO Starmie and Slowbro after minimal chip damage. Body Slam can paralyze switch-ins like Starmie. Rock Slide OHKOes the rare Articuno and Moltres with a critical hit, but Nidoking is OHKOed and 2HKOed by their Blizzard and Fire Blast and requires paralysis support to reliably outspeed them. Surf reliably KOes Rhydon and Golem without needing a critical hit if they are not at full health and has perfect accuracy, but it is inferior to Blizzard otherwise.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 509438, "username": "Ctown6"}, {"user_id": 431020, "username": "Oiseau Bleu"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Estronic"}]}], "writtenBy": [{"user_id": 535276, "username": "Mikon"}]}
  },
  "Persian": {
    "overview": "<p>Persian profits immensely from the Substitute mechanics in Stadium OU, which give it a degree of safety against the threat of Thunder Wave. With the strongest Slash in the game in addition to special coverage in Bubble Beam and Thunderbolt, Persian is well-equipped for dealing with Pokemon like weakened Tauros, Cloyster, Rhydon, and Reflect Chansey. Persian is also extremely fast, outrunning Tauros and boasting a 19% critical hit rate, giving it strong revenge killing utility and notable volatility. Because of this, when paired with Tauros, Persian forms a strong Normal-type attacking core that can be difficult for teams to stop.</p> <p>However, Persian should never be used over Tauros—only alongside it—and for good reason: its power is simply inferior. While Slash itself is very strong, Persian itself isn't, making it still struggle against bulkier Pokemon like Snorlax. Persian's special coverage deals middling damage to most targets, meaning it is very reliant on Slash; Tauros possesses Earthquake and Blizzard, allowing it to muscle past Gengar and Exeggutor, respectively. In fact, seeing Gengar in Team Preview often makes Persian dead weight for a majority of the game, forcing its teammates to remove it before it can make any progress. Like many fast Pokemon in the tier, Persian is ruined by paralysis as well, leading to it being forced out if it can't KO Thunder Wave users before they paralyze it. Paralysis also exposes its awful fragilty: critical hits from tier staples like Tauros, Alakazam, and Rhydon can outright OHKO it. Persian also competes with Kangaskhan as a \"second Tauros\", the latter possessing 101 HP Substitutes and superior bulk to better contest Chansey and Snorlax, as well as Earthquake to fight Gengar. However, Persian's Speed and Slash access give it much better qualities as a revenge killer, providing it with a strong niche in the metagame.</p> ",
    "sets": [
      {
        "name": "Substitute Attacker",
        "description": "<p>Slash is Persian's main outlet for damage, having a 99% critical hit rate to effectively ignore Reflect; it also 2HKOes Alakazam, preventing it from using Substitute if it's already used it once. Bubble Beam allows Persian to 2HKO Rhydon, which otherwise counters it. Common switch-ins to Bubble Beam—such as Alakazam and Starmie—can also have their Speed dropped switching in, which can potentially let Persian threaten them head-on. Thunderbolt lets Persian attempt to 3HKO Cloyster and Slowbro, the latter of which is also particularly vulnerable to critical hits if it tries to set up Amnesia. However, it should be noted that Thunderbolt deals less damage to Starmie than Slash without a critical hit. Finally, Substitute can be used against resting Pokemon like Exeggutor and Slowbro for free, guarding against status and poising Persian to get serious damage in. It can similarly be used against paralyzed Alakazam, Chansey, or Starmie to fish for full paralysis—especially on predicted Recover uses—foes which Persian can muscle past from there.</p> <p>Persian performs best as an expendable mid-game revenge killer, but thanks to Substitute, it can also be a successful late-game cleaner. Once a Pokemon is forced to use Recover, use Rest, or otherwise end up in KO range, Persian can usually come in and profit immensely so long as its checks have been removed. Late-game Persian also has a minor advantage against Substitute Tauros, which put themselves into Slash 2HKO range when using it, so there is value in holding it back to the point where a Tauros mirror would otherwise be appropriate. In terms of other moveset options, Body Slam can be used to let Persian scout while spreading paralysis, though giving up either Bubble Beam or Thunderbolt is often necessary, making Persian more easily checked. Thunder can be used instead of Thunderbolt for a guaranteed 2HKO on Cloyster, as well as dealing more damage to Starmie than Slash, but its consistency gives Persian its own trouble. While Hyper Beam can be used to squeeze 2HKOs on Chansey and Starmie alongside Slash, the forced recharge makes it a far cry from regular RBY and thus generally not recommended.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 509438, "username": "Ctown6"}, {"user_id": 431020, "username": "Oiseau Bleu"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 236353, "username": "Plague von Karma"}]}
  },
  "Alakazam": {"sets": [{"name": "Standard"}]},
  "Victreebel": {"sets": [{"name": "Swords Dance + Wrap"}]},
  "Golem": {
    "overview": "<p>While in heavy competition with Rhydon for a spot on a team, Golem has merit for its access to Explosion, letting it blow holes in opposing teams for its allies to exploit. Golem's higher Speed compared to Rhydon also pays dividends in Stadium, giving it a 12% critical hit rate that helps it break through opposing Reflect Snorlax and Chansey. These traits make Golem a fair pick on teams weak to Rhydon that need a consistent way to beat bulkier Pokemon like the aforementioned Normal-types, as well as Slowbro and Rest Exeggutor. When provided with paralysis support, Golem is a serious threat, dealing massive damage with its STAB moves while still maintaining the threat of Explosion, often securing the late-game for its team as a result.</p> <p>However, Golem's Explosion and Speed are all it has over Rhydon. Rhydon has superior overall bulk, 103 HP Substitutes to consistently beat Seismic Toss Chansey, and a better Attack stat that gives it more consistent KO ranges. Because of this, on top of Snorlax having a superior self-KO move in STAB Self-Destruct, Golem is very hard to fit onto teams. Golem still has Rhydon's flaws as well: it's very slow and specially frail, making it take mortal damage against special attackers like Starmie, Alakazam, and Lapras, forcing it to use Explosion earlier than one would expect. Its slowness also causes it to lose one-on-one matchups surprisingly frequently, such as against Tauros and Exeggutor. Like Rhydon’s, while Golem's defensive typing does provide a useful Electric immunity for combatting Zapdos and Jolteon, it also gives massive weaknesses to Ice- and Water-type coverage from Pokemon like Chansey and Snorlax, making it very difficult for Golem to successfully enter battle and do its job. These problems make Golem a rare sight in Stadium OU, but it’s still a serviceable pick for teams that need a better Rhydon matchup in addition to an Explosion user.</p> ",
    "sets": [
      {
        "name": "Explosion",
        "description": "<p>The combination of Rock Slide and Earthquake lets Golem hit the entire tier for at least neutral damage. Rock Slide particularly hits Exeggutor for neutral damage, ensuring it can't repeatedly switch in, lest it be forced to use Rest early. It also hits Flying-types like Articuno and Zapdos for heavy damage, forcing them out and letting Golem scout with Body Slam. Earthquake has the potential to OHKO Gengar and Jolteon while serving as its strongest attack without a drawback. Body Slam serves as a midground option, letting Golem spread paralysis for itself while punishing potential switch-ins. Explosion allows Golem to trade with an important Pokemon; note, however, that it doesn't let Golem survive breaking a Substitute, unlike in regular RBY. This means that scouting the target for Substitute or paralyzing it is recommended.</p> <p>Stadium's Team Preview benefits Golem’s Explosion, as you will always know whether the opponent has a Zapdos, Jolteon, or Gengar on their team. If Zapdos or Jolteon is present, it's best to hold back the Explosion until late-game, where Golem can check them more effectively. Still, remember that Golem struggles to actually get in to check them, as it can be somewhat predictable. Similarly, in Gengar's case, saving Explosion until it’s used its own Explosion or otherwise been crippled is recommended, or it can be used to nullify Explosion completely. Rhydon poses a risk for similar reasons, but it struggles to switch in due to the threat of Earthquake, though it's notable regardless. If none of these Pokemon are present, Explosion can be used much earlier to KO important mid-game Pokemon like Snorlax and Chansey. It's also perfectly viable to use it as an emergency check to Slowbro if it's picked up too many Amnesia boosts.</p> <p>Golem has room for customization to further differentiate itself from Rhydon, but this is often a misguided effort, as it has to drop Body Slam or Rock Slide, opening it up to exploitation. Defense Curl or Harden can be used to make Golem more consistently check Snorlax, but this still loses to Amnesia variants. Fire Blast is a somewhat viable option for hitting Exeggutor and burning switch-ins, but this can backfire against Pokemon that prefer being burned, such as Starmie and Chansey. Substitute can potentially be used to guard against status and get more hits in, but Rhydon does this better by a long shot and it makes Golem inclined to use Explosion earlier, so it's not recommended.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 509438, "username": "Ctown6"}, {"user_id": 431020, "username": "Oiseau Bleu"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 236353, "username": "Plague von Karma"}]}
  },
  "Slowbro": {"sets": [{"name": "TobyBro"}]},
  "Cloyster": {"sets": [{"name": "Physical Wall"}]},
  "Gengar": {"sets": [{"name": "Standard"}]},
  "Hypno": {"sets": [{"name": "Counter"}]},
  "Kingler": {"sets": [{"name": "Swords Dance"}]},
  "Exeggutor": {
    "overview": "<p>Despite the nerfs sleep suffered in Stadium, Exeggutor is a staple in the Stadium OU metagame because of its great bulk and unique typing. Useful resistances to Ground, Psychic, and Electric allow it to wall a myriad of common threats and make use of Rest to remain healthy long-term. Its longevity allows it to support its team throughout the game by spreading paralysis with Stun Spore and threatening foes with its powerful STAB Psychic backed up by its impressive Special. Exeggutor's access to Explosion also provides it with wallbreaking utility.</p> <p>Exeggutor is saddled with a weakness to the common Ice-type moves in the metagame, most of which will reliably 3HKO it. Its subpar Speed generally forces it to take a hit before it is able to move, allowing it to be worn down more easily. While Exeggutor can use Rest effectively, it makes it passive for two turns and gives opportunities for Pokemon that can threaten it to switch in. Exeggutor also has little offensive coverage, meaning that, if it chooses to drop Explosion, it can be walled itself.</p> ",
    "sets": [
      {
        "name": "Rest",
        "description": "<p>Psychic deals considerable damage to anything that is not Psychic-type and does not have massive special bulk, and it comes with a respectable 33% chance to drop the target's Special stat. Stun Spore cripples threats, but note that it is blocked by Substitute. Double-Edge is an incredibly useful move that can pressure Chansey, Alakazam, and their Substitutes, which is ideal, as its recoil damage doesn't apply when it scores a KO or breaks a Substitute. Breaking their Substitutes prevents them from setting up Substitute again and gives Exeggutor an opportunity to land Stun Spore when they're forced to recover. Furthermore, Double-Edge also deals more damage to enemy Exeggutor than Psychic can, allowing it to wear it down and force its Rest more quickly. Pressuring other Exeggutor and Chansey into using their recovery moves lets you switch out to a teammate that can threaten them. Explosion can be run over Double-Edge to let Exeggutor trade for a Pokemon on the opposing team and allow a teammate to switch in. However, it is risky, because Rhydon is common and takes little damage from it, and Explosion KOes Exeggutor when it hits a Substitute in Stadium. Finally, Rest heals Exeggutor and wipes off paralysis and the Speed loss that comes with it, keeping enemy Exeggutor, Alakazam, Rhydon, Jolteon, Snorlax, and others in check long term. Be aware that using Rest gives offensive threats like Starmie, Zapdos, and Snorlax an opportunity to switch in and apply pressure.</p> <p>Exeggutor makes a potent lead choice in Stadium OU to status common leads like other Exeggutor, Chansey, and Snorlax and scout for Substitute on Alakazam with Double-Edge. In addition, leads that can threaten Exeggutor like Jynx are rare in Stadium OU. Later on, care should be taken if Exeggutor is paralyzed; though it can remove the status with Rest, Pokemon like Snorlax and Rhydon have an easier time putting pressure on Exeggutor, especially if they are behind a Substitute, as it will then not be able to paralyze them. Exeggutor should generally stick to the moves listed above, but it does have other options. Sleep Powder puts a foe to sleep, but it's a shadow of its former self in Stadium; it cannot hit Pokemon behind a Substitute, sleep is limited to 0-3 turns, and Rest is counted under Sleep Clause, making it useless if one of the opponent's Pokemon is sleeping from Rest. Mega Drain hits Starmie, Slowbro, and Rhydon while letting Exeggutor recover some HP in the process. Unfortunately, it is blocked by Substitute and does little damage to most other Pokemon. Egg Bomb is an alternative to Double-Edge that never causes recoil damage, but it's held back by its shaky accuracy. Hyper Beam has a surprise factor and will KO Chansey at 40%, but it's undesirable, as Exeggutor will always have to recharge after using it in Stadium.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 509438, "username": "Ctown6"}, {"user_id": 431020, "username": "Oiseau Bleu"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 535276, "username": "Mikon"}]}
  },
  "Rhydon": {
    "overview": "<p>Rhydon’s massive Attack, STAB Earthquake, 103 HP Substitutes, and Electric immunity give it a powerful role within the Stadium OU metagame. Like in RBY OU, it blanks Zapdos and Jolteon, but it gains more depth in its ability to handle other threats with paralysis support from its team. Its Substitutes can survive a Seismic Toss, which Chansey commonly runs due to its 32 PP and ability to break weaker Substitutes. Additionally, Stadium's Substitute offers Rhydon added utility, most notably blocking Exeggutor’s Stun Spore, and while allowing it to throw off strong attacks or attempt a Body Slam paralysis with little to no drawbacks. Rest is also used by many Pokemon in Stadium, including, Exeggutor, Snorlax, Slowbro, and Cloyster; this further helps Rhydon get on the field and get up a Substitute without risking damage or a status ailment. Rhydon’s defensive typing—while not great—allows it to also be a Thunder Wave and Explosion absorber.</p> <p>Unfortunately, Rhydon is slower than all OU Pokemon besides Snorlax and Slowbro. Despite its Normal resistance, its poor defensive typing and Special allow common Pokemon such as Chansey, Tauros, and Starmie to outspeed and 2HKO with Ice Beam or Blizzard, which they very commonly carry. This means Rhydon absolutely requires paralysis support to be effective, and while this may seem high-maintenance, with proper team support Rhydon is capable of busting massive holes mid-game or cleaning up late-game.</p> <p>Rhydon also competes with Golem, which has access to Explosion—and is slightly faster than Rhydon, at base 45 — meaning it wins one-on-one with its own Earthquake. However, what Golem lacks is the ability to create Substitutes that survive Seismic Toss. This makes Golem’s gameplan very prediction reliant because wallbreaking and cleaning up is much less safe. Rhydon also has the edge offensively, as its higher Attack allows it to meet better KO ranges against common Pokemon in the metagame. Finally, while Golem does outspeed Rhydon, they effectively share the same Speed tier, being outsped by Chansey and thus both requiring paralysis support. For these reasons, Rhydon is preferred on most competitive teams.</p> ",
    "sets": [
      {
        "name": "Standard",
        "description": "<p>Rhydon looks to capitalize on its opportunities and massive Attack stat with its standard Substitute set. Its Earthquake is the strongest physical attack in the game with no drawbacks. It can easily enter the field against Zapdos and Jolteon, as these threats fail to threaten Rhydon with significant damage or status, with it taking less than 20% from the super effective Double Kick seen on Jolteon. If Chansey is revealed to only have Seismic Toss for attacks, it can also act as a point of entry. However, it's still best to not switch into Seismic Toss, as you can switch in on a predicted Thunder Wave or Soft-Boiled for free, keeping Rhydon healthy to create Subsitutes and stay out of range of Starmie’s and Tauros’s Blizzard. Once it gets in, it can get a Substitute up for free—usually forcing a switch—to attack accordingly. Common checks in Starmie and Exeggutor risk Body Slam paralysis as they break your Substitute, which can help tremendously long term, although Exeggutor commonly runs Rest and can remove the paralysis if it manages to get it off. Not only does your team appreciate these checks being paralyzed, but next time they will be unable to beat Rhydon behind a Substitute one-on-one, as Body Slam chip damage means Earthquake 2HKOes Starmie and Rock Slide 3HKOes Exeggutor.</p> <p>It’s important to note just how devastatingly strong Rhydon is. For reference, with Earthquake it OHKOes Jolteon and the rare Gengar, 2HKOes Alakazam, Chansey, Rhydon, and the uncommon Persian and Golem, has a small chance to 2HKO Starmie, and 3HKOes Tauros and Snorlax. It’s also worth noting These are some of the most common Pokemon in the metagame. Also, if Tauros uses Substitute it will be in 2HKO range, meaning it can no longer switch into Rhydon behind a Substitute. With Rock Slide, it OHKOes Jynx and Articuno, 2HKOes Zapdos, and 3HKOes Cloyster. However, it still loses to all the threats listed above in a one-on-one situation where Rhydon doesn’t have a Substitute and the opposing Pokemon isn’t paralyzed, aside from Zapdos, Jolteon, and Gengar. Additionally, these Pokemon potentially 2HKOing or even OHKOing Rhydon means you must be very careful, as a stray critical hit or mistake is enough to put Rhydon down.</p> <p>Stadium's Team Preview is a double-edged sword for Rhydon. Knowing if your opponent has Zapdos or Jolteon is important to using Rhydon’s defensive utility most effectively. However, your opponent can plan around Rhydon, meaning a “free switch” can turn bad if your opponent double switches to a Rhydon check such as Starmie or Exeggutor.</p> <p>Rhydon is capable of fitting Rest, and it is no gimmick. With so many Pokemon often using Rest themselves or paralyzed, Rhydon can usually find a time to use Rest. It also completely walls Seismic Toss Chansey and Snorlax if it lacks Ice Beam, Blizzard, or Earthquake, using Rest to stay healthy in the face of these threats. If Rhydon happens to be behind a Substitute, you gain an extra turn at the minimum to wake up. If you do decide to run Rest, it will most likely be over Rock Slide, but Body Slam is also an option. Replacing Rock Slide gives Rhydon a worse Exeggutor matchup, as it only 5HKOes with Body Slam. However, Earthquake hits enough of your key targets, and Body Slam paralysis is very valuable to punish switch-ins and gain better one-on-one matchups. Leer and Tail Whip are plausible to negate Reflect, which Snorlax and Chansey often use. This isn’t reliable or necessary, as you’d drop a more consistent option in Body Slam, Rock Slide, or Rest.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 535276, "username": "Mikon"}, {"user_id": 431020, "username": "Oiseau Bleu"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 509438, "username": "Ctown6"}]}
  },
  "Chansey": {"sets": [{"name": "Reflect"}, {"name": "BoltBeam"}, {"name": "Substitute"}]},
  "Kangaskhan": {"sets": [{"name": "Substitute Attacker"}]},
  "Starmie": {"sets": [{"name": "Standard"}]},
  "Jynx": {"sets": [{"name": "Lovely Kiss"}]},
  "Tauros": {"sets": [{"name": "Standard"}]},
  "Lapras": {"sets": [{"name": "Confuse Ray"}]},
  "Jolteon": {"sets": [{"name": "Standard"}, {"name": "Focus Energy"}]},
  "Flareon": {
    "overview": "<p>Flareon experiences a stark shift from its original role in cartridge RBY, now functioning as a Focus Energy user in Stadium OU. Once boosted, Flareon becomes extremely threatening, with even Fire-resistant Pokemon like Slowbro and Starmie taking over 40% if Fire Blast lands a critical hit thereafter. It's not just a strong special attacker either; Flareon has a solid base 130 Attack stat to support it against Pokemon like Chansey, which it can 2HKO with consecutive critical hit Body Slams. If an opposing team has been paralyzed, Flareon can savagely rip into it with some of the strongest mixed offense available.</p> <p>However, that's about all Flareon can offer: its firepower is no joke, but it's terrible on the defensive, taking serious damage from any attack, having zero defensive utility in its typing, and lacking reliable recovery. Its Speed also leaves a bit to be desired, with it being narrowly outrun by Cloyster, often meaning it requires paralysis support to be effective; this also makes it terrified of receiving paralysis itself. Because it demands paralysis support and offers little defensive utility, Flareon is difficult to build around. Additionally, it has no consistent methods of handling Water-types like Starmie and Slowbro, forcing it out and giving these two powerhouses significant momentum. Furthermore, Flareon is extremely inconsistent, relying on consecutive critical hits to KO Pokemon, which tend to only happen around a third of the time at best even after Focus Energy. Ergo, Flareon is a rare sight in the metagame.</p> ",
    "sets": [
      {
        "name": "Focus Energy Wallbreaker",
        "description": "<p>Boasting a 58% critical hit rate when Focus Energy is used, Flareon can deal massive damage to anything it hits with critical hit Fire Blast, even possessing chances to OHKO Cloyster, Exeggutor, and Tauros. In fact, even Rhydon can take up to 60% while being outsped, though that KO is extremely risky to go for. The burn chance is also very helpful, crippling Pokemon like Snorlax and Tauros while also aiding in KO ranges; however, landing a burn against Pokemon like Starmie, Alakazam, and Chansey can make it significantly harder to beat them in the long run. Body Slam complements Fire Blast well, making Flareon more self-sufficient with paralysis while 2HKOing Chansey and Starmie with consecutive critical hits; however, it's recommended to use Substitute first in this scenario to avoid paralysis. A single critical hit can also put Alakazam into sub-25% range, meaning it cannot use Substitute thereafter; this also puts it in range for Quick Attack to KO. Quick Attack can be used to pick off Pokemon that barely survive Flareon's attacks, or that alternatively have used Substitute to the point they're left with 1 HP. However, Flareon can use Substitute itself for additional safety against paralysis users like Chansey and Exeggutor. It's worth attempting to set up Substitute against paralyzed Pokemon to try and get it for free with full paralysis. However, this is inconsistent, as setting up both Substitute and Focus Energy naturally means giving the opponent free turns, meaning the turns spent can be for naught.</p> <p>Flareon has minor potential to be customized further; generally, the fourth moveslot is used. Double-Edge is a valid option, providing a good option to finish off limping Pokemon or pressure Substitute users while avoiding recoil. Additionally, a critical hit Double-Edge can KO Alakazam if it's taken minor damage or used Substitute. Flamethrower is also a fair option as an accurate Fire Blast alternative with far more PP, but the drop in damage is significant. While Hyper Beam's downsides are poor, a critical hit can OHKO Chansey, Jolteon, and Alakazam while KOing Starmie if it's taken even minute damage, though the recharge turn usually leads to Flareon taking paralysis right after.</p> <p>Flareon is best used late-game when the opposing team has likely been paralyzed, though it can also be used to punish a Snorlax or Exeggutor asleep from Rest, which are decently common sights in the Stadium OU metagame. From there, Flareon can set up Focus Energy with impunity and start firing off potentially nuclear blows at the opposing team. While its consistency is poor, the reward often means removing crucial parts of the opposing team, which Flareon's teammates should greatly appreciate. Flareon works best alongside Pokemon that can consistently land paralysis on the opposing team, such as Starmie, Alakazam, and Chansey. Because it struggles to break past Slowbro, Starmie, and the rare Kabutops, it's recommended to use it alongside consistent checks to them, such as Thunderbolt Chansey alongside Exeggutor.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 509438, "username": "Ctown6"}, {"user_id": 535276, "username": "Mikon"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 236353, "username": "Plague von Karma"}]}
  },
  "Porygon": {"sets": [{"name": "Physical Wall"}]},
  "Kabutops": {"sets": [{"name": "Rest"}]},
  "Snorlax": {"sets": [{"name": "Reflect"}, {"name": "Amnesia"}]},
  "Articuno": {
    "overview": "<p>Articuno possesses the most powerful unboosted special attack in the game in its Blizzard, giving it offensive prowess rivaled only by the less consistent Moltres. This alone grants Articuno a strong niche in the tier, outspeeding and 2HKOing the mighty Exeggutor. This offense is backed by a reasonable 15% critical hit rate, with critical hit Blizzard OHKOing even Tauros. With Agility, Articuno can function as a late-game sweeper that is very difficult to stop when the stage is set. This is because it isn't just a strong offensive threat: it's also quite bulky, winning against Tauros one-on-one, or even Zapdos if at +2 Speed. Because of the increased presence of Rest Exeggutor, there are many opportunities for Articuno to switch in and turn the game on its head with nuclear damage output.</p> <p>However, Articuno has some deep pitfalls that make it difficult to use in Stadium OU. Team Preview is a massive hit to its viability, removing all surprise factor that helps set up for a sweep in cartridge play. Articuno only has Normal-type coverage and a poor Attack stat to use it with, so Pokemon like Chansey and Starmie, as well as the rarer Lapras and Cloyster, tend to wall it out. Additionally, its valuable Speed, while high relative to OU, means paralysis inducers force it out, which is worsened by Agility not negating the paralysis Speed drop, unlike standard play. It can use Rest to get rid of it, but this isn't ideal. Due to these flaws, Articuno can be seen as very linear, but its immense power is nothing to sneeze at.</p> ",
    "sets": [
      {
        "name": "Special Attacker",
        "description": "<p>Articuno's Blizzard is the main reason it sees play, OHKOing Rhydon, Golem, and the rare Nidoking; it also 2HKOes a majority of the tier, notably Exeggutor, Tauros, Zapdos, Persian, Kangaskhan, and Alakazam after using Substitute once. The freeze chance also cannot be ignored, giving Articuno a degree of volatility that means even consistent checks like Chansey aren't safe. Double-Edge allows Articuno to consistently pressure Substitute without losing valuable PP against users such as Chansey and Alakazam. It also pressures Blizzard-resistant Pokemon like Starmie and Lapras. Rest is crucial for allowing Articuno to make use of its bulk, giving it staying power against Snorlax and Tauros while removing the Speed drop from paralysis.</p> <p>The third moveslot defines how Articuno will act for its team. Ice Beam acts as a weaker alternative to Blizzard with more PP while still finishing off Exeggutor, ensuring a sustained assault; it can also let Articuno fish for a freeze against big targets like Chansey. Reflect is a viable third option for a bulky approach, stonewalling Pokemon like Snorlax and Tauros without much effort; they require two critical hit Body Slams to stop it from repeatedly using Rest if Reflect is active. Reflect doesn't protect Articuno from Persian, though, and it's threatened with a 3HKO from Slash. Agility lets Articuno take a late-game sweeping approach, which, combined with Rest, can be difficult for weakened teams to stop.</p> <p>Articuno cannot break through bulky Water-types, so it's best to cut your losses and have its teammates deal with them. Articuno is often used alongside Thunderbolt Chansey, Zapdos, or Jolteon, forming a two-pronged special offense that can be difficult for teams to counter; Jolteon also appreciates Articuno's Ground immunity. Additionally, Pokemon like Tauros and the ubiquitous Snorlax, which can muscle past physically frail Pokemon like Alakazam, are also of great assistance; Self-Destruct Snorlax also tends to help against Pokemon like Slowbro. Rhydon warrants consideration for reducing the holes opened up by Articuno's weaknesses to Electric and Rock. Gengar shuts down Persian offensively, has good Speed, and has access to Thunderbolt, all of which highly benefit Articuno; Gengar's Explosion also puts Chansey in KO range for Articuno's Double-Edge. Articuno functions best late-game when its bulky Water-type checks have been removed, though Team Preview often makes the opponent less inclined to use them, which frequently means aggressive double switching is necessary to force them in earlier than usual. Articuno can function as a mid-game tank if the opponent lacks a good check. If using Agility and intending to sweep, it's best to bring Articuno in upon a forced Rest from Pokemon like Exeggutor, letting it set up and attempt to muscle past. Articuno can arguably run Hyper Beam alongside Double-Edge despite the drawbacks, namely to finish off Starmie and Chansey from a minimum of 33.4% and 37.9%, respectively. However, it is somewhat difficult to fit into its moveset and comes at severe opportunity cost outside of these matchups.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 509438, "username": "Ctown6"}, {"user_id": 535276, "username": "Mikon"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 236353, "username": "May"}]}
  },
  "Zapdos": {"sets": [{"name": "Mixed Attacker"}]},
  "Moltres": {"sets": [{"name": "AgiliSpin"}]},
  "Dragonite": {"sets": [{"name": "AgiliWrap"}]}
}