{
  "Venusaur": {"sets": {"Swords Dance Sleeper": {}}},
  "Charizard": {
    "outdated": true,
    "overview": "<p>Fire-types may be disappointing in RBY on the whole, but Charizard completely warps NU around it thanks to its incredibly threatening combination of Swords Dance, base 100 Speed, and Earthquake coverage. It may not be on every team, but every team needs overlapping Charizard checks to avoid getting obliterated if it ever finds a free turn. Terrifyingly, this is not the extent of Charizard's power. It also makes an excellent lead, mixed attacker, and revenge killer, packing options like Fire Blast, Slash, and Counter to cover a variety of situations. Charizard crucially outspeeds Venomoth, serving as the most consistent way to block its entry and prevent it from putting something to sleep, and Mr. Mime, allowing it to revenge kill effectively. It also exploits Fire-type opposition like Moltres, which cannot do much to stop it from setting up Swords Dance and tearing through the enemy team. Earthquake is the real clincher, though; Earthquake hits many would-be Charizard checks well, helping it break through Kabutops and Nidoking and giving it a chance against Golem.</p> <p>For all these upsides, Charizard is still held back by its lack of physical STAB, mediocre Attack stat, and horrible defensive typing. It's terrifying once it sets up Swords Dance against a worn-down team, but without STAB and with only base 84 Attack, it cannot OHKO most foes at +2. In fact, +2 Hyper Beam only has a 31% chance to OHKO the frail Mr. Mime, so it heavily relies on team support to wear foes down into range. Its weaknesses to Water, Ice, Electric, and Rock allow most foes to hit it super effectively, and its bulk is not good enough to compensate—every prominent Pokemon in NU can 2HKO it except for Wigglytuff, Raticate, and Charizard, and Golem outright OHKOes it with Rock Slide. Additionally, paralysis completely ruins its ability to sweep and revenge kill; it becomes a great sleep blocker when paralyzed but has to hope to switch in safely on Venomoth, which can backfire if it lands a critical hit or Special drop with Psychic.</p>",
    "comments": "<h4>Other Options</h4> <p>Charizard can mix and match moves between sets with ease; just about any set can utilize moves like Counter, Slash, and Hyper Beam to secure damage ranges or exploit specific matchups. Counter can, for example, heavily punish opposing Charizard for attacking at +2 or using Slash, and it can allow Charizard to switch into and return a +2 Hyper Beam from Charizard, Kabutops, or Kingler. It can even use Counter on Clefable's Hyper Beam to leave it in range of Fire Blast or Hyper Beam, or it can come in to revenge kill Raticate and use Counter to catch whatever it switches out to. This can be especially devious if Charizard takes paralysis, lulling the opponent into expecting it to switch out. Reflect can be run with Swords Dance to win an arms race with opposing Swords Dance Charizard, blocking even a +6 Hyper Beam. Toxic appears viable with Fire Spin at first, but this is an incredibly inconsistent strategy that leaves Charizard with poor coverage; a single miss usually results in Charizard getting KOed after blessing opposing Pokemon with an easy way to block sleep and paralysis.</p> <h4>Checks and Counters</h4> <p><strong>Paralysis</strong>: Once paralyzed, Charizard is limited to sleep blocking and revenge killing paralyzed foes. This is a major problem for Charizard due to its plethora of common weaknesses, mediocre bulk, and inability to KO anything at full HP even after using Swords Dance. If Charizard does take paralysis, its best move is to sleep block Venomoth a few times to delay the opponent from landing sleep, hopefully giving its own team a chance to put something to sleep first. Paralysis often comes at a cost as well, as Mr. Mime, Clefable, and Wigglytuff all take massive damage from Fire Blast.</p> <p><strong>Water-types</strong>: Charizard has a difficult time with Water-types. For starters, they all 2HKO Charizard with their choice of STAB move, but they each have other advantages as well. The ubiquitous Blastoise 2HKOes Charizard and usually survives even +2 Earthquake into Hyper Beam, and it threatens a brutal Counter against Hyper Beam or as Charizard switches out after using Slash or Body Slam. Kingler's impressive physical bulk nearly matches Blastoise's, and it's guaranteed to KO Charizard with Body Slam followed by Crabhammer, letting it fish for paralysis before dealing the coup de grace. Crabhammer also hits Charizard for at least 77%, letting Kingler secure a KO after minor chip from teammates. Both Blastoise and Kingler also survive a +4 Hyper Beam, so Charizard cannot try to reach +4 against them to sweep if they're at full health. Seadra is not quite as bulky, but it has Agility to set up a countersweep, and its Hydro Pump deals a minimum of 78%, allowing it to snipe Charizard similarly to Kingler. Kabutops is the odd one out, as its Earthquake weakness hampers its matchup and makes it a poor check; if Charizard uses Swords Dance or Earthquake as it switches in, it easily wins one-on-one, potentially even setting up a second Swords Dance in front of it before KOing it, but Kabutops can still check a weakened Charizard.</p> <p><strong>Golem</strong>: Golem is only rarely 3HKOed by Earthquake and OHKOes Charizard with Rock Slide, allowing it to switch into even a set-up Charizard and drive it out easily. Golem has a major issue, though; if it gets burned, it becomes setup bait for Charizard, which can use Swords Dance to reapply the burn Attack drop and cut Golem's damage to pathetic levels. After a single reapplication, Rock Slide deals a laughable maximum of 34%, letting Charizard easily continue boosting in front of its hapless foe.</p> <p><strong>Electrode</strong>: Electrode outspeeds and 2HKOes Charizard, and its 27.3% critical hit rate makes it especially terrifying. However, Charizard 2HKOes back with Earthquake, so if Electrode switches into an Earthquake or Swords Dance, it cannot win without a critical hit or luck with paralysis. Electrode can also use Thunder Wave to stop a Charizard sweep, usually suffering an OHKO immediately after</p> <p><strong>Clefable</strong>: Clefable is bulky enough to switch into Charizard and paralyze it in an emergency, even surviving a +2 Hyper Beam comfortably; a +4 Hyper Beam has a 33% chance to OHKO, and the potential for a critical hit lowers these odds further. After paralyzing it, Blizzard 2HKOes Charizard consistently, allowing Clefable to outright win the matchup rather than just weaken it.</p> <p><strong>Charizard</strong>: Charizard can be its own worst enemy. In a Charizard mirror match, either Charizard can potentially run away with the game by boosting to +4 or even +6, so luck can swing the game heavily—Body Slam paralysis, Hyper Beam misses, and Speed tie luck can allow one Charizard to KO the other while taking minimal damage, which can then allow it to take another KO or even end the game in a mid- to late-game scenario.</p>",
    "sets": {
      "Mixed Attacker Lead": {
        "description": "<h5>Set Description</h5> <p>Charizard is a strong lead that can trade blows well with any typical lead. Fire Blast 3HKOes Mr. Mime and Clefable, and Blastoise—the typical Charizard check—has difficulty switching in early without allowing Venomoth in freely to put something to sleep. Earthquake is Charizard's strongest physical move without drawbacks and provides solid damage into everything except Charizard and Moltres, crucially nearly 2HKOing Kabutops and Nidoking and dealing significant damage to Golem. Body Slam lets Charizard fish for paralysis against Mr. Mime and still 3HKO it by following up with Fire Blast, and it can also paralyze opposing Charizard. It also gives Charizard a chance to hamstring switch-ins like Blastoise and Seadra, but Charizard can instead choose Slash for consistent high damage, notably 4HKOing Blastoise, 3HKOing Mr. Mime without risking a Fire Blast miss, and dealing more damage to Seadra than Charizard's other options. Charizard's fourth moveslot is flexible. Counter helps it against an opposing Charizard lead, allowing it to return Body Slam or Slash for massive damage, especially against Swords Dance Charizard, which tends to attack with Body Slam after boosting to +2. It can also use Slash; Body Slam twice followed by Slash twice usually 4HKOes Charizard while providing good odds to paralyze it, and Body Slam followed by Slash twice efficiently 3HKOes Mr. Mime. Fire Spin is a rarer but still dangerous option, allowing Charizard to pivot around its checks, albeit inconsistently. It notably also wears down Nidoking and Mr. Mime into 2HKO range quickly, potentially allowing Charizard to turn around a desperate game with a little luck if it's able to avoid paralysis until late-game.</p> <p>This Charizard set can be played in two main ways. It can either trade hits and take down the opposing lead, sacrificing itself to remove a crucial threat like Mr. Mime, or it can land one hit, take paralysis, and flee, which allows it to perpetually block sleep from Venomoth. Usually, Charizard will simply take the trade to remove Mr. Mime, freeing up its teammates, like Venomoth and Mr. Mime, to exploit this. Since Charizard often wins this matchup, it gets KOed after the opposing lead, allowing its team to take advantage of the opposing revenge killer—for example, by sending Venomoth in against slower foes. This also frees up Mr. Mime to deal immense damage later with less fear of taking paralysis. Taking paralysis to sleep block instead enables more methodical play, but it does come with drawbacks; it requires Charizard to switch a teammate into a scary threat, potentially making for a very poor trade, and paralyzed Charizard's switch-ins are fairly predictable and punishable with smart double switching or attacking. Still, blocking sleep can potentially enable much more aggressive play from slower teammates like Clefable, Blastoise, and Golem. If Charizard escapes the lead matchup unparalyzed, it can use its Speed and coverage to effectively revenge kill most foes later on or to chip foes down and pivot with Fire Spin. In the Charizard versus Charizard matchup, Body Slam is the usual choice to weaken and hopefully paralyze it; however, a Swords Dance Charizard can take advantage of this 70% of the time, so switching out to Blastoise is a reasonable move to ensure it can't set up. However, this invites Venomoth in, so double switching back to Charizard afterward may be the correct choice to gain an advantage. Against more unorthodox leads like Wigglytuff and Clefable, Charizard often has no choice but to trade hits, as nothing switches into them well; unfortunately, these are often worse trades for Charizard than other matchups.</p> <p>Charizard has a few notable options for teammates beyond obvious choices like Mr. Mime, Clefable, Venomoth, and Blastoise. Exeggcute can take advantage of opposing lead Mr. Mime, switching into Thunder Wave before putting it to sleep and acting as a passable sleep blocker against Venomoth. Electrode can deal immense damage if Charizard takes out Mr. Mime, cleaning up the opposing Charizard and Blastoise late-game. Raticate provides another fast option to help clean up or wallbreak, especially if the lead matchup is Charizard versus Charizard, leaving both paralyzed or KOed; Raticate crucially outspeeds Mr. Mime, allowing Charizard to wallbreak recklessly without giving up the ability to revenge kill Mr. Mime. Seadra is a great teammate, as Charizard baits in and weakens Blastoise for it, freeing it up to sweep with Agility.</p>"
      },
      "Swords Dance Lead": {
        "description": "<h5>Set Description</h5> <p>Charizard can use a somewhat greedy Swords Dance set as a lead to attempt to exploit an opposing Charizard lead without Swords Dance, boosting in front of it once or twice to possibly end the game before it begins. At +2, Body Slam followed by Hyper Beam KOes Charizard, allowing it to boost and attempt to win the matchup while remaining unparalyzed and moderately healthy. Even without Hyper Beam, Body Slamstill enables it to deal massive damage and makes it difficult to switch into. Fire Blast is the usual last move to avoid losing to Venomoth, and it's Charizard's best move against Clefable and deals solid damage to Mr. Mime; however, Charizard may opt for the riskier Hyper Beam to secure the aforementioned 2HKO on Charizard and to potentially deal massive damage after winning the lead matchup.</p> <p>If Charizard is able to reach +4, it can OHKO most foes with Hyper Beam, even nearly OHKOing Blastoise, allowing it to trade hits incredibly favorably and open up the game for its teammates. This is especially effective against opposing Charizard sets that lack Body Slam or are too quick to use Counter; Slash is a mere 4HKO, easily allowing Charizard to get to +4 and eviscerate the opposing team, and Counter can be predicted by simply continuing to boost. An opposing Charizard with Body Slam, however, is highly likely to paralyze Charizard before it can set up a sweep, having a 51% chance to paralyze it in two attempts and often getting three attempts. The opponent can also immediately switch to Blastoise, which prevents this strategy from gaining traction, but this can be punished by double switching to Venomoth.</p> <p>This set is entirely sacrificial in nature, seeking to break holes in the opposing team and set its teammates up for success. It heavily relies on landing the Charizard versus Charizard lead matchup; it struggles into Mr. Mime if lacking Fire Blast, usually switching out to an allied Mr. Mime to play the mirror match and remove this threat or switching into Exeggcute to soften the matchup and secure sleep early. Unless the team has an Exeggcute, this means accepting paralysis on Mr. Mime for free, which can immediately create problems. In this case, Charizard acts as a late-game sweeper, seeking an opportunity to return later and set up. Clefable and Wigglytuff are also poor matchups for Swords Dance Charizard, with Clefable especially being difficult; if Charizard has Fire Blast, it can stay in and attack twice, failing to KO Clefable but dealing heavy damage. In rare cases, Charizard may take out the opposing lead but take paralysis in the process, allowing it be act as a sleep blocker against Venomoth later in the match. This is generally more effective if Charizard has Fire Blast. If Hyper Beam Charizard gets the correct lead matchup, it will ideally set up and take out the opposing Charizard then deal upwards of 50% to the next Pokemon to fight it, usually Blastoise or another Water-type, creating holes for allies like Mr. Mime to exploit.</p> <p>Exeggcute is an effective teammate to improve Charizard's matchup against Mr. Mime and avoid losing too much momentum. Since Hyper Beam Charizard ideally removes Charizard and Blastoise, powerful attackers like Nidoking, Moltres, and Kabutops thrive after a successful lead matchup; Moltres also Speed ties Venomoth, acting as a soft check to prevent it from landing Sleep Powder. Seadra benefits if the opponent sends Blastoise in immediately against Charizard as it uses Swords Dance; in this case, Charizard can simply use Body Slam and Hyper Beam to leave Blastoise at about 10% HP, which allows Seadra to finish it off, check the opposing Charizard, and sweep late-game. Venomoth is likely the least bad switch-in to a lead Clefable, as it still has decent odds to land Sleep Powder even as it inevitably takes Thunder Wave, potentially bailing Charizard out of an absolutely horrendous lead matchup. Fire Blast Charizard has a better matchup spread as a lead, so it may appreciate teammates like Kingler that can sweep in its stead and appreciate it removing or weakening Mr. Mime.</p>"
      },
      "Swords Dance Sweeper": {
        "description": "<h5>Set Description</h5> <p>The classic NU Charizard set is the late-game sweeper, lurking in the back and seeking an opportunity to set up and sweep. Earthquake and Hyper Beam provide perfect coverage: Earthquake handles Nidoking and Rock-types and also deals heavy damage when Hyper Beam would cause a recharge; it also has better accuracy. Hyper Beam provides the most physical damage possible, having a chance to OHKO Mr. Mime at +2 and KOing common neutral foes at +4, barring Blastoise, Kingler, and Clefable. Once these foes are chipped, Charizard can look for an opportunity to revenge kill a heavily weakened foe and instead use Swords Dance on a predicted switch, allowing it to sweep. Ideally, Charizard wants to reach +4, as it is unlikely to clear through the opposing team without taking paralysis otherwise, but this requires weakening Thunder Wave users enough to ensure they won't switch in and weakening Blastoise enough to KO it with +4 Hyper Beam, which luckily only requires about 20% in damage. This is easily dealt by Fire Blast or Earthquake, and even Body Slam makes for a favorable roll to KO it later. Charizard can choose from several options for its final move. Fire Blast provides coverage for Venomoth without needing a boost and is Charizard's most damaging option against most neutral targets, like Mr. Mime, Clefable, and Raticate. Body Slam grants a safe midground option to hit Charizard and Moltres or to fish for paralysis. Fire Spin can bring Nidoking and Mr. Mime into range of a +2 attack after just one or two hits, and it's capable of securing chip damage to save a desperate game against other foes as well.</p> <p>When acting as a late-game sweeper, Charizard relies heavily on setting up a favorable revenge kill that allows it to boost. For example, if Charizard can revenge kill an Exeggcute, Ninetales, or Moltres, it can easily set up Swords Dance as they exit or land an ineffectual attack, and it may even be able to boost again if the opposing check is, for example, a Water-type, which cannot OHKO Charizard without a critical hit nor paralyze it consistently. However, most Pokemon pack Body Slam, so Charizard is always under threat of a sweep-stopping paralysis from foes like Blastoise, Ninetales, and Kingler. Charizard may have to settle for one KO and heavy damage on another foe, which is usually enough to allow its team to win the game. Charizard can also attempt to sweep at +2, allowing it to set up much more consistently; for this to work it needs to first scout for opposing Rock-types, and it needs bulky checks like Blastoise and Clefable weakened into range of +2 Hyper Beam or Earthquake. Electrode can also completely stop a Charizard sweep with Thunder Wave, so it needs to be handled at any cost if Charizard is to sweep.</p> <p>Charizard appreciates teammates that facilitate good entry points for it to sweep. Sleep inducers like Venomoth and Exeggcute can create an early opportunity by putting a foe to sleep, though Charizard is not really equipped to sweep against Pokemon at full HP. These Pokemon can also spread paralysis to help Charizard out later by giving it a chance to get a second boost in front of a paralyzed foe. Explosion users like Exeggcute and Golem can remove key targets for Charizard or do something even more devious; by using Explosion into a target they will not KO, they can facilitate Charizard's entry against a foe that cannot stop it from setting up. For example, Exeggcute can use Explosion against a target it's just put to sleep, giving Charizard a free boost against a sleeping foe. Fast attackers with good coverage like Nidoking, Raticate, and Kabutops can help spread damage through the enemy team, allowing Charizard to clean up chipped foes later. Moltres can force in typical Charizard checks like Blastoise and Kabutops, allowing it to soften them up for Charizard to finish off later; two hits with Fire Blast puts Blastoise in range of +2 Hyper Beam, and a single Fire Blast on Kabutops gives Charizard a chance to OHKO it with +2 Earthquake.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 583793, "username": "Sabelette"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 375193, "username": "MrSoup"}, {"user_id": 486979, "username": "juoean"}]}, {"name": "Grammar checked by", "members": [{"user_id": 168392, "username": "P Squared"}, {"user_id": 384270, "username": "autumn"}]}]}
  },
  "Blastoise": {
    "outdated": true,
    "overview": "<p>Mr. Mime and Clefable define RBY NU, but Blastoise is the glue that holds it together. Blastoise is the catch-all check to Fire- and Water-types and the main line of defense against an early Charizard sweep. It's also one of the few Pokemon able to take a hit from Golem, forcing it out immediately with Surf. Blastoise's offense cannot be discounted due to the lack of recovery in NU; even checks like Mr. Mime, Clefable, and Electrode hate taking a Surf as they enter, and many switch-ins fear Body Slam paralysis too. Blastoise often ends up serving as a check to itself, since switching in against it is so difficult. Nothing but Electrode can 2HKO Blastoise without a critical hit, allowing it to trade hits effectively with almost any foe, and the threat of Counter makes it difficult for foes to unleash Hyper Beam with impunity, lest Blastoise switch in and punish them.</p> <p>Blastoise's biggest flaw is its mediocre Speed, which leaves it open to Venomoth entering to put it to sleep. Blastoise is so critical that allowing this is often game-losing, but switching out gives Venomoth even more momentum; this interaction makes it extremely hard to use Blastoise early-game. Even with sleep off the table, Mr. Mime, Nidoking, and Kabutops all outspeed it and will invariably damage it heavily should it stay and fight. Blastoise also struggles to check Kingler and Kabutops; while it easily weakens both into KO range of allies like Charizard or Mr. Mime, losing Blastoise early in the process can make Charizard or Moltres a major threat. Also, once Blastoise has lost roughly 45% of its HP, it's no longer an effective switch-in to unparalyzed Charizard, which can use Swords Dance as it enters and OHKO it with Hyper Beam from this range. Further, Blastoise usually draws opposing Blastoise in, and they tend to trade with each other. Blastoise thus only gets one or two switch-in opportunities per game, but the opponent will pay a price to remove it for their sweepers.</p>",
    "comments": "<h4>Other Options</h4> <p>Blastoise has a plethora of niche options that can substitute for Counter or its fourth move. Toxic is a potential response to Charizard's or Moltres's Fire Spin and can also help to defeat opposing Blastoise without risking Counter. Rest allows Blastoise to eternally wall Ninetales and Seadra and can assist in Toxic stalling opposing Blastoise, but using it allows Mr. Mime and Swords Dance users free entry. Rest is best used to secure endgames against foes lacking setup, rather than as a mid-game defensive play. Blastoise may also consider Hydro Pump, sacrificing accuracy for power. It 2HKOes Moltres, possibly 2HKOes Kabutops, and 3HKOes Clefable. Ice Beam over Blizzard guarantees a 2HKO against Exeggcute without risking a miss chance, but it gives worse damage against other targets. Earthquake is Blastoise's strongest attack versus Electrode and the extremely rare Gastly, 2HKOing the former and having a 59% chance to OHKO the latter. Finally, Bubble Beam can drop the Speed of Nidoking or Charizard, and it doesn't forfeit the 2HKO if Surf follows it up, potentially allowing Blastoise to fish for an even better situation with no downside. In an emergency, it may stop Charizard from setting up and sweeping late-game.</p> <h4>Checks and Counters</h4> <p><strong>Thunderbolt Users</strong>: Nearly all teams contain a Mr. Mime, which outspeeds Blastoise and 3HKOes it with Thunderbolt if it can switch in safely. Clefable, while slower, has superior bulk, switches safely into Body Slam, and threatens a Thunderbolt 3HKO or Thunder Wave. Electrode's STAB Thunderbolt is a 2HKO with a high critical hit rate, forcing Blastoise out. However, Mr. Mime and Electrode fear Body Slam paralysis and are generally frail, so they're usually only able to revenge kill.</p> <p><strong>Venomoth</strong>: Venomoth outspeeds Blastoise and can easily enter after a KO or switch into Surf. Blastoise is often a team's defensive centerpiece and cannot afford to take sleep early-game, which gives Venomoth a free sleep attempt as Blastoise switches out, compensating for Sleep Powder's shaky accuracy.</p> <p><strong>Blastoise</strong>: Blastoise will often trade hits with its opposing counterpart, which is often a team's only reliable Blastoise switch-in, resulting in one Blastoise being KOed and the other being severely weakened in most cases. Smart prediction with Counter may result in one Blastoise still having significant health left, but in most cases the winning Blastoise can be revenge killed by nearly any foe.</p> <p><strong>Kingler and Kabutops</strong>: Both Water-type Swords Dance users are middling checks to Blastoise, removing it but ensuring their own demise shortly after. However, a trade often suits them, as Blastoise is usually more valuable. Kingler is just bulky enough to use Swords Dance in front of Blastoise and KO or severely weaken it, often leaving a team with no further check to Charizard. Similarly, Kabutops can win the one-on-one fight or weaken Blastoise into KO range of other threats.</p>",
    "sets": {
      "Bulky Attacker": {
        "description": "<h5>Set Description</h5> <p>Surf OHKOes Golem, 2HKOes Charizard, Ninetales, and Nidoking, and deals excellent damage to non-resistant foes. Seismic Toss enables Blastoise to duel opposing Blastoise and Seadra, 4HKOing both. Counter plays off of this interaction and deals 55.4% to opposing Blastoise after a Seismic Toss. It also lets Blastoise send back Charizard's or Kabutops's Slash twice over, heavily punishing anything they switch into, and Counter can return massive damage after switching into Hyper Beam from Kingler, Raticate, or Clefable. Raticate also must fear a Counter on Super Fang, usually forcing it to use Thunderbolt instead. Blastoise's final moveslot is more flexible. Body Slam can potentially hobble Mr. Mime or Electrode as they switch in, or it can gain an advantage versus opposing Blastoise without risking a massive Counter. Blizzard is also a possibility, notably 2HKOing Exeggcute and the occasional Fearow while potentially freezing other foes.</p> <p>Blastoise is a mainstay of every viable NU team, often forcing opposing Blastoise to trade for it, as few Pokemon can switch into it well. It can function well alongside other Water-types like Kabutops and Kingler, which can assist in fending off opposing Blastoise and Charizard. Golem is a notably good teammate for Blastoise, as it safely switches into Electric-type attacks, can exploit paralysis spread by Body Slam, and helps Blastoise check Charizard. Alternatively, Exeggcute can check Electrode and Mr. Mime after they force Blastoise out, utilizing the opportunity to land Sleep Powder. Electrode can pair surprisingly well with Blastoise, allowing it to play more aggressively, as Electrode can stop opposing Blastoise and Charizard late-game.</p> <p>Blastoise should only be sparsely used early-game, as opponents can easily send in Venomoth to get a free sleep attempt against it. Once Sleep Clause is in effect, it can come in to stop Fire-types and Golem in their tracks and force a response. This will usually lead to a Blastoise mirror match that removes both from the game or leaves them too weakened to check anything; should the opponent send in Mr. Mime or Clefable instead, Blastoise can happily hit them with Surf on entry, and then it can switch out to blockade Charizard later. If Blastoise gets in on a Slash from Charizard, the opponent also must consider the risk of a massive Counter against their switch-in. If Blastoise remains healthy late-game, it can stop an attempted sweep by Charizard, Moltres, or Seadra and secure victory.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 583793, "username": "Sabelette"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 593847, "username": "nicole7735"}, {"user_id": 486979, "username": "juoean"}, {"user_id": 236353, "username": "Plague von Karma"}, {"user_id": 530877, "username": "Volk"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}]}
  },
  "Raticate": {
    "outdated": true,
    "overview": "<p>Raticate acts as a fast revenge killer and wallbreaker in RBY NU, with Super Fang, Normal-type STAB moves, and immense coverage allowing it to 2HKO or 3HKO most of the tier. Raticate is one of the fastest available Pokemon, outspeeding Mr. Mime and Venomoth while only being outsped by Charizard, Ninetales, and the rare Electrode. Raticate's diverse coverage threatens Pokemon like Golem and Kabutops, and its sheer Speed allows it to threaten revenge kills against foes like Mr. Mime and Blastoise. Thanks to Super Fang combined with Hyper Beam or a coverage move, Raticate 2HKOes Pokemon like Venomoth, Mr. Mime, Golem, and even potentially Charizard. This can allow it to sweep or help enable sweepers like Charizard, Kabutops, and Kingler. STAB Body Slam deals excellent damage and is incredibly difficult to switch into, as opponents have to fear Super Fang obliterating their bulky Rock- or Normal-types. Raticate's main issues are its horrid bulk, fear of Counter, and near inability to function if paralyzed.</p>",
    "comments": "<h4>Other Options</h4> <p>Raticate has abundant coverage but lacks the stats to back it up; however, it may be customized to check threats that the rest of its team cannot safely handle. Thunder guarantees a 2HKO on Kingler but misses crucial ranges against other Water-types and is usually not better than simply hoping for a critical hit. Blizzard deals heavy damage to Fearow, Exeggcute, and Nidoking, usually 2HKOing the first two and 3HKOing Nidoking while potentially freezing; it also still deals heavy damage to Golem but usually misses the 2HKO.</p> <h4>Checks and Counters</h4> <p><strong>Charizard and Ninetales</strong>: Charizard and Ninetales outspeed Raticate and 2HKO it with Fire Blast, though missing might get them 2HKOed. Fire Blast's burn chance also threatens to leave Raticate ineffectual.</p> <p><strong>Paralysis</strong>: Raticate cannot bully its foes when it is slower than them, and its frailty shines through when it has to take hits before dealing them; the vast majority of NU 2HKOes it.</p> <p><strong>Counter</strong>: Because Raticate relies on Hyper Beam and often uses Super Fang, Counter will usually threaten a retaliatory KO. Furthermore, if a Counter user switches in on Raticate and forces it out, the Raticate user risks massive damage to their switch-in. Potential Counter users include Charizard, Clefable, Wigglytuff, Blastoise, and Primeape, with Blastoise in particular nearly always carrying it. Raticate can potentially exploit Counter attempts with Thunderbolt, however, especially against Charizard and Blastoise.</p>",
    "sets": {
      "All-out Attacker": {
        "description": "<h5>Set Description</h5> <p>Hyper Beam is the only required move, as it finishes off dangerous foes such as Clefable, Venomoth, and Mr. Mime from 44%, 56%, and 65% HP. Raticate then chooses from three of four moves. Body Slam's paralysis chance makes Raticate difficult to switch into in general, and Body Slam + Hyper Beam also KOes Mr. Mime, allowing Raticate to fish for paralysis to maintain its Speed advantage while still 2HKOing it easily. Super Fang is a common component of Raticate's strategy, making switches incredibly risky even for Rock-types, Clefable, and Wigglytuff. The Super Fang + Hyper Beam combination notably 2HKOes Mr. Mime, Venomoth, and Exeggcute, sometimes 2HKOes Charizard and Nidoking, and rarely can even 2HKO Clefable. Even if Super Fang Raticate can't get the KO, its teammates probably will. Bubble Beam is the ideal coverage move, 2HKOing Golem. Thunderbolt 3HKOes Kabutops and Kingler, and Thunderbolt twice followed by Hyper Beam is enough to defeat Blastoise while avoiding a lethal Counter.</p> <p>Raticate's strategy is simple: revenge kill weakened, slower foes where possible and look for safe opportunities to get in on valuable targets lacking Thunder Wave. Once in, Raticate can use Super Fang to leave the foe in KO range of Hyper Beam or Bubble Beam, or it can use Body Slam to deal heavy damage and punish switches. It can also potentially revenge kill one foe and then take paralysis in order to damage Mr. Mime or Clefable. Raticate baits switches due to its reliance on KOing with Hyper Beam, meaning Body Slam and Super Fang can punish pivots. Due to Raticate's low bulk, switching in is quite difficult; it can benefit from Fire Spin users if you are willing to risk a miss, or it can come in after an ally puts a foe to sleep. Raticate is ideally used on highly offensive teams that seek to leave the opposing team weakened and open to a fast attacker, whether that's Raticate itself or a teammate such as Mr. Mime or Charizard. Helpful teammates for Raticate include Golem, which can switch into Thunder Wave and help check Charizard, and paralysis spreaders like Mr. Mime and Clefable, which let Raticate defeat bulky foes such as Blastoise and opposing Clefable.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 583793, "username": "Sabelette"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 400664, "username": "Stories"}, {"user_id": 593847, "username": "nicole7735"}, {"user_id": 375193, "username": "MrSoup"}]}, {"name": "Grammar checked by", "members": [{"user_id": 331519, "username": "CryoGyro"}, {"user_id": 168392, "username": "P Squared"}]}]}
  },
  "Fearow": {
    "outdated": true,
    "overview": "<p>Fearow boasts a myriad of highly coveted attributes that only it can proudly claim in NU. With a blistering base 100 base speed, Fearow speed ties with Charizard and Ninetales while outpacing tier staples like Mr. Mime, Venomoth, and Nidoking. The relatively high critical hit chance provided by its Speed. coupled with STAB Hyper Beam makes Fearow a phenomenal cleaner against weakened teams, and can even further boost its Speed with Agility for insurance against faster foes and to bypass the Speed drop from paralysis. Fearow is a great late-game cleaner and revenge killer due to its great Speed and powerful STAB moves, but due to its terrible bulk, it generally cannot afford to trade blows with anything it cannot KO. Fearow's defensive typing is quite double-edged, pun intended, and while a Ground immunity is great, Fearow's weakness to the ever-present BoltBeam coverage becomes quite a liability. Fearow is also completely walled by Rock-types, meaning it requires heavy support to guarantee it can fulfill its duty as a sweeper, while other fast cleaners like Charizard and Raticate can create holes in the opposing team for themselves, making them much more self-sufficient.</p>",
    "sets": {
      "All-Out Attacker": {
        "description": "<p>Drill Peck can be used to easily 2HKO Sleep Powder users Venomoth and Exeggcute without taking recoil damage and also bypasses Counter, although it is significantly weaker than Fearow's other STAB options against other targets. Agility allows Fearow to clean up against the few Pokemon faster than it, and also avoid the speed tie with Charizard and Ninetales while outspeeding Electrode or to negate a Paralysis Speed drop. Mirror Move has niche applications that one may find game-to-game, copying Earthquake from a weakened Golem or Nidoking to pick it off, for example.</p> <p>Because of Fearow's ability to sweep so well, Pokemon that often force trades like Mr. Mime, Clefable, and Nidoking are great partners, as even if they can't take something out themselves, they always end up leaving the opponent at low HP—perfect for Fearow to prey on. Pokemon that can force damage on Golem and Kabutops, which are hard checks to Fearow, also make for great teammates. Super Fang Raticate, that carry either Blizzard or Bubble Beam for Golem and Thunderbolt for Kabutops can very effectively weaken the respective check for Fearow, making it a perfect teammate. Swords Dance Earthquake Charizard can also take huge chunks of HP off these Rock-types. Having these additional faster Pokemon often means the opponent's speed control beyond paralysis can easily be overwhelmed. In matchups without opposing Rock-types, Fearow's unresisted STAB moves can be used to its heart's content, 2HKOing other metagame staples like Mr. Mime, Clefable, and Venomoth and opening up holes in defensive Pokemon like Kingler and Blastoise, although it must be wary of Counter from the latter. Weakening these bulky Water-types and forcing the opponent to reveal their Rock-type early if they have one is incredibly valuable for teammates like Charizard.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 400664, "username": "Stories"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 583793, "username": "Sabelette"}, {"user_id": 486979, "username": "juoean"}]}, {"name": "Grammar checked by", "members": [{"user_id": 109385, "username": "aurora"}]}]}
  },
  "Arbok": {
    "outdated": true,
    "overview": "<p>Arbok's access to Glare and Wrap creates a small niche for it in NU. It's a faster Wrap user than Dragonair, outspeeding key targets like Blastoise and Kingler, and while Glare is less accurate than Thunder Wave, it's also able to paralyze Ground-types, allowing Arbok to outspeed Nidoking. Arbok's coverage is decent—while it lacks STAB options, it has QuakeSlide coverage to hit the entire tier well. This is, unfortunately, where the positives end; Arbok's stats are mediocre, its defensive typing is incredibly detrimental, and it lacks consistency thanks to its inaccurate moves. Base 80 Speed falls short of many key threats, like Mr. Mime, Venomoth, Charizard, and Nidoking. Arbok's mediocre bulk and Poison typing leaves it 2HKOed by all of these Pokemon and more, and non-STAB moves coming off a mediocre base 85 Attack fails to threaten them enough in return. This leaves Arbok reliant on landing Glare so it can use Wrap to chip down and pivot around these foes, a strategy with low consistency that is easily ruined by paralysis, misses, and critical hits. Its main competition, Dragonair, may be slower, but it has a better movepool, Agility to easily set up and outspeed all foes, and several useful resistances, so Arbok is generally considered a terrible option for most teams.</p>",
    "sets": {
      "Wrap": {
        "description": "<p>Glare acts as a poor man's Thunder Wave against most foes, but it does allow Arbok to paralyze Golem and, more notably, Nidoking. Wrap lets Arbok chip down and force out slower foes like Clefable and Blastoise, and it also lets Arbok immobilize paralyzed foes. This ensures the opponent must send in an unparalyzed Pokemon and risk taking a Glare to make consistent progress, unless they intend to wait for a Wrap miss. Wrap's control lets Arbok safely pivot in threatening allies if it does not want to attempt to land Glare against the opponent's switch-in. Earthquake provides useful coverage and is Arbok's strongest move without drawbacks, hitting foes like Nidoking, Golem, and Ninetales super effectively. Rock Slide provides a 4x effective attack to finish Charizard and Moltres, but Arbok can use Hyper Beam for a stronger finisher against neutral targets like Mr. Mime and Clefable.</p> <p>Arbok can be used as part of a partial trapping core alongside teammates like Dragonair, Charizard, and Moltres, spreading paralysis or poison and wearing foes down without allowing them to move, but this is an inconsistent strategy. It appreciates support from status spreaders like Mr. Mime, Clefable, and Exeggcute; Exeggcute notably resists both of Arbok's relevant weaknesses, allowing it to act as a pivot or blockade Mr. Mime. Arbok also does well in supporting teammates that need paralysis support to function well, like Kabutops, Golem, and Kingler; it can paralyze and chip down foes and then pivot these threats in freely.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 583793, "username": "Sabelette"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 400664, "username": "Stories"}, {"user_id": 375193, "username": "MrSoup"}]}, {"name": "Grammar checked by", "members": [{"user_id": 168392, "username": "P Squared"}]}]}
  },
  "Sandslash": {
    "outdated": true,
    "overview": "<p>Sandslash is able to carve out a small niche in NU as the only fully evolved Ground-type that possesses Swords Dance and a neutrality to Earthquake. Thanks to its immunity to Thunder Wave, Sandslash can switch in more easily than other Swords Dance users, like Kingler and Pinsir, by predicting Thunder Wave from Pokemon like Electrode, Drowzee, and Mr. Mime. It further benefits from the coveted Earthquake + Rock Slide combination, alongside other key offensive moves like Substitute and Body Slam. Its Speed tier is also serviceable enough to outspeed key staples like Golem, Clefable, and Porygon. Lastly, Sandslash possesses good physical bulk, allowing it to combat physical attackers like Golem effectively. With paralysis support from Pokemon like Mr. Mime and Clefable, Sandslash can ravage the opposing team late-game.</p> <p>However, while having some use, Sandslash's Speed tier is still poor: the relevant Water-types of the tier, such as Kingler, Blastoise, Seadra, and Kabutops, will outspeed it, threatening significant damage before it can set up with Swords Dance. Ergo, they must be removed, severely weakened, or crippled for Sandslash to be effective. This usually causes it to rely on paralysis support, which many teams cannot afford to easily provide. Although Sandslash is immune to Thunder Wave, paralysis from Body Slam, Stun Spore, or Glare cripples its chances to sweep late-game, exposing its poor special bulk and cutting into what Speed it does have. Lastly, it faces heavy competition as a Ground-type from Nidoking and Golem: the former has a much more flexible movepool, better Speed, and a Toxic immunity, while the latter has access to STAB Rock Slide, an important resistance to Fire, more immediate power, and Explosion.</p>",
    "sets": {
      "Swords Dance": {
        "description": "<p>Swords Dance is Sandslash's calling card, driving its Attack stat to terrifying levels. At +2, it can threaten OHKOs on Pokemon like Electrode, Mr. Mime, and Nidoking with Earthquake. Rock Slide complements Earthquake, providing unresisted coverage and securing OHKOs on Charizard and Moltres after a boost; it also hits Pinsir and Fearow hard. Body Slam discourages switch-ins from Poliwhirl and Blastoise, potentially paralyzing them. Alternatively, Substitute can exploit predicted switches and grants Sandslash more opportunities to set up, especially given its immunity to Thunder Wave.</p> <p>Sandslash has a surprisingly interesting movepool, making it quite customizable. Slash gives Sandslash immediate power and tears through Pokemon relying on Reflect, such as Abra and rare variants of Mr. Mime, Clefable, and Wigglytuff. Toxic prevents partial trappers like AgiliWrap Dragonair, Charizard, Moltres, and Rapidash from pinning it down. Submission is its best option against Clefable, Porygon, and Wigglytuff; however, the recoil, shaky accuracy, and lower damage than Earthquake against neutral targets make it a niche option at best. Hyper Beam is Sandslash's best move against Exeggcute and matches Earthquake’s power but fails to notably hit other targets.</p> <p>As a result of its typing and good physical bulk, Sandslash can pivot in against Electrode and Golem as well as Pokemon running Rest, such as Moltres and Blastoise, which let it also break holes in the opposition with Swords Dance. Since they let Sandslash set up, sleeping Pokemon are effectively left on the sidelines until it is eliminated. Pokemon carrying Thunderbolt, like Clefable, that can deter Water-types like Seadra and Blastoise from staying in allows Sandslash to set up more easily. Chip damage from Fire Spin users like Moltres, Rapidash, and Charizard, as well as Wrap from Dragonair, is also appreciated to help secure OHKOs after a Swords Dance, which makes Sandslash more difficult to deal with over the course of a game. Lastly, paralysis support from the likes of Electrode and Mr. Mime allows Sandslash to not only have more setup opportunities, but also to fish for full paralysis with Substitute and become even more lethal.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 543866, "username": "5Dots"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 520967, "username": "pac"}, {"user_id": 236353, "username": "Plague von Karma"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}]}
  },
  "Nidoqueen": {
    "outdated": true,
    "overview": "<p>Although Nidoqueen sports colorful coverage choices and a valued Electric immunity, it's entirely overshadowed by its cousin Nidoking. This is due to Nidoking's higher Attack and Speed, which enables it to outspeed Kabutops and Blastoise, unlike Nidoqueen. While Nidoqueen does have higher defenses, giving it a better matchup over Pokemon like Raticate and the rare Fearow, this is where its benefits end. It still maintains Nidoking's flaws and fails to offer anything truly unique over it other than those specific matchups. Worse, Nidoqueen's lower Attack stat means that it struggles more to achieve benchmarks Nidoking reaches, like 2HKOing Mr. Mime, 3HKOing Clefable, and 3HKOing Wigglytuff. While Nidoqueen can be run alongside Nidoking, such builds are very niche and tend to be more exploitable.</p>",
    "sets": {
      "All-Out Attacker": {
        "description": "<p>Earthquake 2HKOes Pokemon like Kabutops and Nidoking and functions as Nidoqueen's strongest move in general. Thunderbolt targets Water-types like Blastoise and Kingler while still hitting Flying-types like Moltres and Fearow super effectively. Rock Slide 2HKOes Moltres and Charizard and covers Venomoth. Blizzard 2HKOes Golem and Exeggcute while still maintaining coverage against the aforementioned Flying-types. Nidoqueen's wide movepool includes options like Body Slam, Counter, and Fire Blast, though they are hard to fit over its main moves because Nidoqueen is already strapped for moveslots and needs them to achieve those benchmarks.</p> <p>Due to Nidoqueen being outclassed by Nidoking, it is best paired alongside it, working together to overwhelm their respective checks and counters. Nidoqueen should ideally be used early- to mid-game as a wallbreaker that enables Nidoking to clean up later on. However, it should be noted that Nidoqueen is limited by its lower Speed in comparison, failing to outpace threats like Blastoise and Kabutops. Much like Nidoking, Nidoqueen would ideally be paired with paralysis spreaders like Mr. Mime, Clefable, and Venomoth. With paralysis support, Nidoqueen can outspeed Pokemon like Kabutops and Mr. Mime. Water-types, like Blastoise and Kingler, can switch into opposing Fire- and Water-type attacks, preserving Nidoqueen's longevity. In turn, they can bait Electric-type attacks and Electrode, giving Nidoqueen safer entry points.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 543866, "username": "5Dots"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 583793, "username": "Sabelette"}]}, {"name": "Grammar checked by", "members": [{"user_id": 583793, "username": "Sabelette"}]}]}
  },
  "Nidoking": {
    "outdated": true,
    "overview": "<p>Nidoking is the most diverse threat in RBY NU and boasts several key strengths that differentiate it from other mid-game attackers. Nidoking has the best coverage in the tier and boasts super effective coverage for nearly every foe, as well as STAB Earthquake for powerful neutral damage. Its Electric immunity grants it entry against opposing Thunder Wave and Thunderbolt users, blessing Nidoking with a variety of effective entry points. For example, one's own Mr. Mime or Clefable often baits in and paralyzes their opposing counterpart, after which Nidoking can switch into the predicted Thunder Wave and threaten them heavily. This immunity additionally makes Nidoking a hard counter to Electrode, helping to protect teams from a surprise sweep and exploiting Electrode for free turns. Nidoking can clean up endgames against the tier's various Water-types and Golem due to its superior Speed, 2HKOing Kingler, Kabutops, and Golem before they are able to 2HKO back.</p> <p>Despite these advantages, Nidoking's typing is a double-edged sword and its Speed leaves it vulnerable to Mr. Mime and Venomoth. Nidoking's Poison typing adds weaknesses to Psychic and Earthquake, making nearly all of Nidoking's matchups risky for both sides, as every top Pokemon in NU has at least one super effective attack against it. Nidoking competes with Golem for a teamslot, in particular missing out on Golem's superior typing. Golem's Rock typing grants it useful Normal and Fire resistances as well as STAB on Rock Slide, whereas Nidoking misses the OHKO against Charizard. Also, Nidoking will leave even victorious fights at low HP, and this is where its imperfect Speed becomes noticeable, as Mr. Mime, Venomoth, and all Fire-types can revenge kill it with ease. Venomoth especially punishes an early Nidoking entry, as it is only 3HKOed by Earthquake, allowing it to switch in, gain massive momentum with Sleep Powder, and then threaten Stun Spore on the switch.</p>",
    "comments": "<h4>Other Options</h4> <p>Nidoking's other options all end up surprisingly lacking. Substitute initially looks appealing, but Nidoking's lower bulk means that after using Substitute twice, it is in OHKO range of most of the tier, unlike Golem. Body Slam can potentially paralyze, but this is unreliable and it deals poor damage compared to every other option. Thunder's power allows it to rarely secure 2HKOs that Thunderbolt misses, but the odds are extremely low; its best feat is a 42% chance to 2HKO Seadra after considering accuracy. Overall, the loss in consistency often leaves Nidoking in a far worse position than simply using Thunderbolt. Fire Blast seems like it could cover Venomoth, but it only has a 40% chance to 2HKO and otherwise provides very little. Finally, Submission to hit Clefable is useless, as it has only slightly more power than Earthquake with far worse accuracy. Any of these options create exploitable holes in Nidoking's coverage and should not be considered.</p> <h4>Checks and Counters</h4> <p><strong>Venomoth</strong>: Venomoth is perhaps the premier Nidoking check, easily landing sleep in retaliation if Nidoking secures an early-game KO. Venomoth also outspeeds and 3HKOes Nidoking while being one of the few Pokemon to be only 3HKOed back, allowing Venomoth to stop Nidoking even late-game. Nidoking also essentially cannot switch into Venomoth, as Stun Spore leaves it ineffective and Double-Edge often leaves it in range of a Psychic 2HKO.</p> <p><strong>Mr. Mime</strong>: Mr. Mime outspeeds and 2HKOes Nidoking, which can't OHKO back. Mr. Mime cannot switch in, but unparalyzed Mr. Mime easily revenge kills Nidoking and is difficult to switch into itself, shifting the momentum from Nidoking's team with a successful entry. Nidoking should not revenge kill early-game due to the threat of Mr. Mime revenge killing it, even when facing Venomoth-less teams.</p> <p><strong>Clefable</strong>: Clefable is slower than Nidoking, but Blizzard 2HKOes and Nidoking can only 3HKO. Also, Body Slam can paralyze Nidoking as it tries to enter, hamstringing it permanently.</p> <p><strong>Seadra and Blastoise</strong>: Both Seadra and Blastoise are 3HKOed by Thunderbolt while 2HKOing in return. Seadra notably Speed ties Nidoking and can set up Agility to ensure it can use another attack after KOing Nidoking. Blastoise can check Nidoking in a pinch, though its utility as a check to other Pokemon means it will rarely want to take this fight. It also cannot switch in and win, as it is slower than Nidoking.</p> <p><strong>Faster Pokemon</strong>: A number of fast Pokemon can check Nidoking given its propensity for taking heavy damage when trading hits. Charizard and Moltres can switch into Earthquake and outspeed Nidoking, with Moltres even 2HKOing it with Fire Blast. Charizard normally needs mild chip damage or a critical hit in order to win one-on-one, but it can also win with a Fire Spin or two, though this is an uncommon set. Raticate has a 51% chance to 2HKO with Super Fang + Hyper Beam, while Nidoking only has a 23.5% chance to 2HKO with Earthquake, and after a mere 8% chip damage, the 2HKO becomes guaranteed. Ninetales and Fearow can defeat Nidoking after approximately 15-20% chip damage as well.</p>",
    "sets": {
      "Mixed Attacker": {
        "description": "<h5>Set Description</h5> <p>Earthquake is Nidoking's strongest move, particularly against Mr. Mime, Clefable, and Kabutops, as well as an effective midground option to cover most switches. Thunderbolt covers the Water-types of the tier, 3HKOing Blastoise and Seadra and 2HKOing the others, while also dealing decent damage to Charizard or Moltres. Blizzard 2HKOes Golem and Exeggcute while also covering Flying-type switches, acting as a generally safe midground option. Rock Slide provides a 2HKO against Charizard and Moltres, both of which are too bulky for Blizzard or Thunderbolt to 2HKO; Charizard is KOed by either Blizzard or Thunderbolt followed by Rock Slide, while Moltres generally requires two Rock Slides to 2HKO. While the overlapping coverage may seem like overkill, Nidoking can at worst 3HKO every single Pokemon in NU with this set, and the overlapping coverage usually makes it near-impossible to safely switch into Nidoking.</p> <p>Utilizing Nidoking effectively requires an awareness of how and when to get it into battle, as well as knowing how to utilize midground options to cover switches without giving up KOs. Nidoking can effectively enter battle when opposing Mr. Mime or Clefable is likely to use Thunder Wave or Thunderbolt. As these Pokemon often trade hits with their opposing counterparts, only to be revenge killed after, it is important to set up mismatched situations: for example, getting your own Mr. Mime in on Blastoise to incentivize the opponent to switch their Mr. Mime or Clefable into paralysis. This allows you to switch Nidoking into their retaliatory Thunder Wave. Nidoking can also enter to revenge kill targets such as Water-types, Golem, and Clefable regardless of whether they're paralyzed, especially later in the game when sleep is no longer a concern. Once Nidoking enters battle, the opponent is pressured to either sacrifice their current Pokemon to chip Nidoking or to try to find a relatively safe switch, such as getting Mr. Mime in against a special attack or Charizard in against Earthquake. For example, Nidoking can 2HKO Kabutops with either two Earthquakes or Thunderbolt + Earthquake; the former provides safe entry to Charizard, while Thunderbolt allows Mr. Mime in to force Nidoking out. Knowing Nidoking's KO ranges and the opponent's switch options allows it to heavily punish desperate switches while still securing KOs if the foe stays in.</p> <p>Nidoking partners well with Mr. Mime, as mentioned, and other paralysis spreaders such as Clefable and Venomoth work the same way. Besides baiting opposing Thunder Wave, they also slow foes down for Nidoking. Exeggcute can also create mismatches by checking Mr. Mime, and it may even paralyze an additional foe as Mr. Mime switches out or use Explosion to grant Nidoking a perfect entry point. It also pairs well with Water-types such as the ubiquitous Blastoise, which baits Electric-type moves late-game and helps to chip down bulkier foes, such as Blastoise and Charizard, for Nidoking to later remove; in return, Nidoking helps to insulate Water-types from a potential Electrode sweep and finish KOs for them. Blastoise and Kingler also often find opportunities to catch switches with Body Slam, potentially paralyzing more opponents.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 583793, "username": "Sabelette"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 236353, "username": "Plague von Karma"}, {"user_id": 165529, "username": "Ika Ika Musume"}, {"user_id": 593847, "username": "nicole7735"}, {"user_id": 530877, "username": "Volk"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}]}
  },
  "Wigglytuff": {
    "outdated": true,
    "overview": "<p>Wigglytuff is entirely outclassed by Clefable in NU. However, Clefable is one of the best Pokemon available, and Wigglytuff can do many of the same things, so Wigglytuff can be used alongside it as a second, more limited Clefable. Compared to Clefable, Wigglytuff has equally strong STAB moves and similar utility in Thunder Wave but slightly less bulk and very weak coverage moves due to its poor Special stat. In particular, Wigglytuff can be used as a response to the opposing Clefable, or in some cases as a response to Mr. Mime, allowing your own Clefable to be used for other things rather than being locked into a Clefable mirror. However, devoting a slot to Wigglytuff comes at a significant cost, since NU is an extremely centralized metagame. Using Wigglytuff leaves you with an overall slower team and generally means forgoing either Charizard or a different late-game sweeper, such as Seadra, Raticate, Electrode, or Kingler. Wigglytuff performs quite consistently when it is used, but the limitations it imposes on teambuilding are not always worth it.</p>",
    "comments": "<h4>Other Options</h4> <p>Bubble Beam provides a guaranteed 2HKO on Golem and a 33% Speed drop chance, but dropping Body Slam for Bubble Beam leaves Wigglytuff without a good move to threaten Nidoking; dropping Seismic Toss for Bubble Beam leaves Wigglytuff walled by Kabutops. Counter can potentially deal massive damage; however, Wigglytuff's opportunities to use Counter are typically limited to specific Pokemon such as Raticate, Wigglytuff, and rare targets like Primeape and Pinsir. Clefable does more damage to it with Blizzard than Body Slam anyway, and Wigglytuff does not force many switches. Thunderbolt can be used to avoid Blastoise’s Counter, 3HKO Kabutops, and rarely 2HKO Kingler; however, if Kabutops switches into either Body Slam or Hyper Beam, then Seismic Toss will 3HKO it, making it comparable to Thunderbolt. Wigglytuff is also not too threatened by Blastoise’s Counter due to its high HP stat, taking less than 50% from a Counter on Seismic Toss. Sing is a potential option, but it is not a very good one due to its 55% accuracy and Wigglytuff’s abysmal Speed. However, since Wigglytuff can be effective enough with just Thunder Wave, Seismic Toss, and Hyper Beam, Sing can be used in the fourth moveslot for niche matchups, such as against opposing Wigglytuff, and as a desperation play in an otherwise losing game.</p> <h4>Checks and Counters</h4> <p><strong>Ground-types</strong>: Nidoking can switch into Wigglytuff's Thunder Wave and usually defeat it, outspeeding and 3HKOing it with Earthquake while avoiding a 2HKO from any combination of moves. However, Nidoking does not want to switch into Body Slam or Blizzard. Conversely, Golem has little to fear from a Body Slam + Seismic Toss Wigglytuff and can similarly switch into its Thunder Wave, but it risks losing the Speed tie and being 2HKOed by Blizzard.</p> <p><strong>Fire-types</strong>: Wigglytuff is 3HKOed by any STAB Fire Blast, aside from Moltres's which usually 2HKOes. A burn also makes Wigglytuff unable to use its STAB Hyper Beam effectively. However, Fire-types generally hate being paralyzed by Thunder Wave.</p> <p><strong>Rock-types</strong>: Kabutops can switch into Hyper Beam and take advantage of the recharge turn to either boost with Swords Dance or simply KO a weakened Wigglytuff, depending on the situation. Golem can also switch into Hyper Beam and either set up a Substitute or attack with Earthquake.</p> <p><strong>Sleep</strong>: Because of its poor Speed, Wigglytuff can be vulnerable to Pokemon with sleep-inducing moves, such as Venomoth or even Sing Clefable. However, sleep inducers do not want to switch into Thunder Wave, and Venomoth does not want to switch into Body Slam.</p>",
    "sets": {
      "Bulky Support": {
        "description": "<p>Thunder Wave should always be used to help compensate for Wigglytuff's poor Speed and to ensure Charizard cannot set up in front of it, as Wigglytuff cannot 2HKO it. It is also generally useful due to the fast pace of matches, and it gives a bulky Pokemon, such as Wigglytuff itself, extra chances to get an advantage from full paralysis. STAB Hyper Beam is by far Wigglytuff’s most powerful move; it has a decent chance to KO Mr. Mime after a Body Slam or Seismic Toss, it is generally a good option against weakened foes, and it is a good final attack right before Wigglytuff is KOed. Seismic Toss is Wigglytuff’s most spammable move, 3HKOing Mr. Mime and 4HKOing everything other than opposing Wigglytuff. Due to Wigglytuff’s middling Attack, poor Special, and low critical hit rate, alternative moves aside from Hyper Beam rarely deal significantly more damage anyway. Seismic Toss also helps to ensure Wigglytuff does not become useless if burned.</p> <p>Body Slam is often the preferred fourth move, enabling Wigglytuff to threaten Nidoking with paralysis and providing a second spammable move alongside Seismic Toss, making Wigglytuff less predictable. In particular, being able to use Body Slam to threaten paralysis rather than depending on Thunder Wave makes it more difficult for Nidoking to switch in for free. On the other hand, using a Body Slam + Seismic Toss set makes the Golem matchup difficult, since Golem is immune to Thunder Wave, Speed ties Wigglytuff, and avoids a 3HKO from Seismic Toss even after a Body Slam. Blizzard is Wigglytuff’s best coverage option for Golem without compromising the Nidoking matchup; it 2HKOes Golem about half the time, and it also deals 38% minimum to Nidoking, leaving it in range of Blastoise’s Surf or Mr. Mime’s Psychic. However, note that Blizzard does minimal damage against neutral targets due to Wigglytuff’s poor Special, so it leaves Wigglytuff very reliant on Seismic Toss.</p> <p>Wigglytuff can be used as a lead, since it has a very favorable matchup against Mr. Mime and an acceptable matchup against Charizard while preventing Venomoth from switching in safely due to Thunder Wave and STAB Body Slam. Alternatively, Clefable can be used in the lead slot for its ability to 2HKO Charizard with Blizzard and similarly favorable Mr. Mime matchup, and it can also use Psychic to threaten Venomoth; in this case, Wigglytuff should be used to provide the team with a bulky Thunder Wave user and Clefable check. Outside of the lead, Wigglytuff is typically best used as a Clefable switch-in, after which it can paralyze it with Thunder Wave and trade hits with Seismic Toss or Body Slam. Wigglytuff can also switch into a predicted Seismic Toss or Thunder Wave from Mr. Mime, but Wigglytuff does not want to switch into Mr. Mime's Psychic, as it can be 2HKOed with one critical hit.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 486979, "username": "juoean"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 236353, "username": "Plague von Karma"}, {"user_id": 583793, "username": "Sabelette"}, {"user_id": 530877, "username": "Volk"}]}, {"name": "Grammar checked by", "members": [{"user_id": 583793, "username": "Sabelette"}]}]}
  },
  "Venomoth": {
    "outdated": true,
    "overview": "<p>Venomoth is the fastest and most dangerous sleeper in NU. It can quickly remove one foe from play with Sleep Powder, which also forces the opponent to switch into Stun Spore, generating a massive early advantage. Venomoth single-handedly prevents early-game usage of slower Pokemon, as critical threats like Blastoise and Clefable cannot afford to be put to sleep. Venomoth can function as a lead, but it more often serves to punish opponents for over-utilizing slower Pokemon before Sleep Clause takes effect. Its Speed tier also allows it to trade hits with Nidoking or Mr. Mime after it lands its status moves, and while its Psychic is not particularly strong, it can still dent foes heavily with a critical hit or Special drop.</p> <p>Venomoth's biggest weakness is its sheer lack of offense—it has no STAB options and relies heavily on Special drops to deal passable damage, so it struggles to break through paralyzed foes—which it cannot put to sleep—and especially flounders against Fire-types. Double-Edge helps to cover Mr. Mime, but it deals just a bit less damage than needed to truly give Venomoth a chance one-on-one.Venomoth's mediocre typing and bulk limit it defensively, as the tier's various Fire-types, Mr. Mime, and Fearow all outspeed or Speed tie it and force it out; Golem's Rock Slide is also a major threat. However, the sheer power of sleep and paralysis ensure a strong niche for Venomoth.</p>",
    "comments": "<h4>Other Options</h4> <p>Hyper Beam can be used to finish off Mr. Mime at the cost of either Psychic’s coverage or the ability to combat a healthy Mr. Mime. In particular, Mr. Mime always falls to Hyper Beam after two Seismic Tosses, whereas Double-Edge has a mere 23% chance to KO here. Thus, Hyper Beam is an option for insurance on teams leading Mr. Mime. Hyper Beam also deals more damage than Psychic to most foes, allowing Venomoth to sometimes secure a surprise KO on Clefable, Blastoise, or even Charizard after wearing them down.</p> <h4>Checks and Counters</h4> <p><strong>Fire-types</strong>: Venomoth is outsped and 2HKOed by Charizard and Ninetales, both of which also have a high chance to critically hit it. Moltres only Speed ties Venomoth, but its nuclear Fire Blast OHKOes Venomoth, which deals piddling amounts of damage back. All Fire-types are also effective sleep blockers when paralyzed, forcing Venomoth to slowly wear them down before it can land sleep.</p> <p><strong>Mr. Mime</strong>: While Mr. Mime fears sleep, it 2HKOes Venomoth and has a high critical hit chance, giving it multiple paths to victory. Paralyzed Mr. Mime blocks sleep moderately effectively, as Double-Edge is only a 4HKO.</p> <p><strong>Fearow</strong>: Fearow is a rare sight, but it outspeeds and 2HKOes Venomoth, just like the Fire-types. It is significantly easier to wear down with Psychic, but it can potentially set up Agility in front of Venomoth and deal heavy damage as it switches out.</p> <p><strong>Exeggcute</strong>: Once Sleep Clause is in effect, Exeggcute easily stops Venomoth. It takes very little damage from Venomoth's attacks and does not mind paralysis, retaliating with Psychic for a 30% likely 2HKO. Exeggcute can easily fish for sleep or paralysis against Venomoth or switch-ins as well.</p> <p><strong>Golem</strong>: Golem's Rock Slide deals upward of 70% to Venomoth, and Body Slam followed by Rock Slide has a high chance to KO, making it risky for Venomoth to switch in. Mega Drain Venomoth can deal heavy damage to Golem, but it still loses one-on-one unless Golem has been chipped. Golem can also use Explosion to even up a losing matchup.</p>",
    "sets": {
      "Double Powder": {
        "description": "<h5>Set Description</h5> <p>Venomoth's main use is to land sleep, then fish for paralysis as the opponent inevitably switches out, since keeping a slower Pokemon in to try to wake up achieves nothing. Stun Spore helps to keep out dangerous threats like Charizard, Moltres, and Fearow, usually forcing the foe to switch in Clefable or Mr. Mime after Sleep Powder lands, accepting paralysis. Psychic is Venomoth's best attack against most foes, scoring a 3HKO on Nidoking and opposing Venomoth, and it threatens repeated Special drops against Water-types and other switch-ins. Double-Edge is primarily for Mr. Mime, either to fight it directly after landing paralysis, or to punish an already-paralyzed Mr. Mime switching in to block sleep. Double-Edge deals about as much damage as Psychic against most switch-ins, though, so it can also be used as a midground option. As an alternative to Double-Edge, Mega Drain nearly 2HKOes both Golem and Kabutops, only needing slight chip damage to guarantee it. However, it is useless versus everything else.</p> <p>Venomoth can act as a lead, matching up well versus any slower lead and having decent odds to put Mr. Mime to sleep, but is forced out by Charizard or Ninetales due to the risk of a critical hit or Sleep Powder miss. In most games, it will instead switch in after a few turns to take advantage of a slower foe like Blastoise. Once in, it lands sleep and follows up with Stun Spore until something is paralyzed; if there is a preexisting paralyzed foe, Venomoth may opt to simply attack in case said foe switches in, returning later to land sleep. After landing sleep and paralysis, Venomoth can either stay in and trade hits until it drops or switch out after paralyzing the foe. Trading hits is advisable if the opponent uses Clefable to absorb Stun Spore, as Venomoth can often weaken it severely with Psychic before going down. Venomoth can also be saved to fight Rock-types with Mega Drain, to sacrifice to sleep later, or to prevent the opponent from ever sacrificing their slept Pokemon—this would let Venomoth land a second sleep. Venomoth pairs well with allies that bait in Water-types, as these are its easiest entry point; for example, leading Charizard or Ninetales often forces Blastoise in, as does using Golem early. Slower allies such as Kingler and Golem particularly appreciate Venomoth's paralysis support, as does Nidoking. Mega Drain Venomoth also works well with allies that normally falter in front of Rock-types, such as Moltres and Ninetales.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 583793, "username": "Sabelette"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 236353, "username": "Plague von Karma"}, {"user_id": 520967, "username": "pac"}, {"user_id": 96315, "username": "phoopes"}, {"user_id": 486979, "username": "juoean"}]}, {"name": "Grammar checked by", "members": [{"user_id": 449990, "username": "DC"}, {"user_id": 517429, "username": "Adeleine"}]}]}
  },
  "Golduck": {"sets": {"Amnesia": {}}},
  "Primeape": {
    "outdated": true,
    "overview": "<p>Primeape stands out thanks to its valuable offensive typing and great offensive movepool, with access to relevant moves such as Rock Slide, Thunderbolt, and STAB Submission. This coverage allows Primeape to succeed far more consistently than any of the other Fighting-types available. Its damage output is also impressive, allowing it to 2HKO or 3HKO the vast majority of Pokemon in the tier, including notable threats such as Clefable and Moltres. Perhaps most importantly, its great Speed stat allows it to outspeed notable fast Pokemon such as Moltres and Mr. Mime. The attached 18.55% critical hit rate further boosts its offensive potency. This rate is especially important versus defensive Pokemon such as Golem and Blastoise, as a singular critical hit Submission or Thunderbolt will turn a 3HKO into a 2HKO. Clefable, Charizard, Moltres, and Kabutops are all OHKOed by either a critical hit Submission or Rock Slide.</p> <p>While Primeape is incredibly strong, its frailness and Psychic weakness allow for little defensive utility, with it losing to common Pokemon like Mr. Mime. Also, while its Speed is impressive, it's not quite enough to stop Fire Spin users such as Charizard and Ninetales from taking advantage of it. Primeape's reliance on its Speed also causes paralysis to cripple it, meaning Pokemon like Mr. Mime, Exeggcute, and Electrode force it out. Other physical attackers, such as Raticate and Charizard, typically provide more defensive utility for equally comparable power.</p>",
    "sets": {
      "All-out Attacker": {
        "description": "<p>Submission is Primeape's primary attacking move, 2HKOing Clefable and Wigglytuff, as well as Golem with minor chip damage. However, a Counter from Clefable or Wigglytuff will punish it, so scouting their movesets prior is recommended. Body Slam grants Primeape some measure of self-sufficiency by spreading paralysis to support it. It also acts as a way to discourage switch-ins, as Pokemon like Charizard and Nidoking hate paralysis; Charizard is also liable to be KOed by Rock Slide thereafter. Rock Slide also lets Primeape punish the plethora of other viable Fire-types, 2HKOing Moltres as well as Ninetales, Arcanine, and Rapidash after some chip damage. Hyper Beam is Primeape's strongest attack, allowing it to revenge kill from high percentages. In addition, Hyper Beam prevents Rest Exeggcute from walling Primeape, with two Body Slams into critical hit Hyper Beam being a guaranteed KO. Alternatively, Thunderbolt is Primeape's strongest option against Blastoise, Seadra, and Kingler, 2HKOing the latter 91.5% of the time.</p> <p>Primeape is decently customizable due to its sizeable movepool. Thunder is a guaranteed 3HKO on Blastoise and Seadra, while with Thunderbolt this is only a chance. However, Thunder's poor accuracy leaves it as a niche option. Low Kick is a decent alternative to Submission, forgoing power for a chance to flinch the foe. This allows it to occasionally brute force through foes at high health without taking damage in the process. Counter can be used to heavily damage physical attackers such as Pinsir and Raticate, but it requires some level of prediction in order to be effective. Primeape can use Toxic to check AgiliWrap Dragonair and Fire Spin users, as they will take more damage from Toxic than it will deal with Wrap. Finally, Mega Kick deals high damage to some of Primeape's most notable checks, pairing with Hyper Beam to secure KOs on Nidoking, Mr. Mime, and Exeggcute. However, Mega Kick's mediocre accuracy leaves much to be desired.</p> <p>Primeape fits well on teams with multiple Flying- and Bug-types such as Charizard, Moltres, Pinsir, and Venomoth, as it resists Rock Slide while also threatening opposing Fire-types that check them. Primeape is also great at absorbing Toxic, due to its dislike of paralysis, which lets it protect Fire Spin Charizard and Moltres. It also pairs especially well with dedicated checks to Mr. Mime. Once Mr. Mime is sizably chipped, Primeape can outspeed and revenge kill it, removing one of its biggest roadblocks in the process. Notable Mr. Mime checks include Clefable, Exeggcute, Drowzee, and even your own Mr. Mime. Primeape is most successful when used as a mid-game wallbreaker, as most of its coveted targets like Clefable, Moltres, and Kingler come into play then. Punishing these Pokemon grants openings for its teammates to sweep later on.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 520967, "username": "pac"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 236353, "username": "Plague von Karma"}, {"user_id": 233818, "username": "Enigami"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}]}
  },
  "Arcanine": {
    "outdated": true,
    "overview": "<p>Arcanine is a fringe pick in NU as a defensive Fire-type that trades hits efficiently thanks to a very high Attack stat backed by Body Slam access. Being the best physical Fire-type is a big perk for the fiery dog, leaving a dent in anything that doesn't resist its coverage. Its Speed is just barely enough to work, outrunning Pokemon like Venomoth and Mr. Mime, which also makes it a fair anti-lead and revenge killer. Arcanine's bulk is nothing to scoff at, even taking a +2 Earthquake from Charizard, actualizing its utility as a defensive Fire-type. It also has a fantastic Moltres matchup, stonewalling the terrifying Legendary Bird while threatening anything attempting to switch in with a meaty Body Slam. Arcanine can usually deal heavy damage before going down and, when paired with Water-types like Blastoise, can form a decent defensive core to combat the offense-laden RBY NU.</p> <p>However, metagame shifts have not been kind to the Legendary Pokemon: tier staples like Charizard, Kabutops, and Golem tear into it, as Arcanine only has Fire- and Normal-type moves for coverage, and these Pokemon are frequent offensive presences. While it can theoretically use Toxic to punish them, this is hardly a substitute for direct damage, and lacking Fire Spin to pile on chip damage or escape bad matchups worsens the issue. Without Venusaur as a reliable target for it to switch into, as well as Moltres becoming less favored, Arcanine's regular lines of play have diminished. As a defensive Fire-type, it also has issues distinguishing itself from Rest Moltres outside of its admittedly crucial Body Slam access; while Moltres lacks it, it has more overall bulk, Fire Spin access, and generally inconsequential weaknesses, notably not being hit by Earthquake. Furthermore, while Arcanine's Charizard matchup is functional, it's just that: even minor chip damage, which it will sustain, can drastically worsen it. Due to a mix of these factors, Arcanine has fallen off significantly. The volatile nature of the tier is just a bit too much for Arcanine teams in general, leading to them being a rare sight in the modern metagame.</p>",
    "comments": "<h4>Other Options</h4> <p>Arcanine's movepool is workable, but replacing any move often harms more than it helps due to its highly specific matchup spread. Agility can be used to make Arcanine into a mixed late-game sweeper, with its great Attack stat and Body Slam access making it more reliable than Agility + Fire Spin Moltres. However, with its limited coverage, setting the stage for Agility Arcanine can be difficult, and not having Fire Spin means it needs foes to be put in KO range for it to be consistent.</p> <p>Toxic can be used on lead Arcanine sets to poison potential Fire Spin leads, particularly Charizard and Ninetales, as well as give it something to catch Kabutops and Golem switching in. However, Charizard and Ninetales perform this role better due to their higher Speed and access to Fire Spin. Reflect can be used to further this role and mitigate Arcanine's Earthquake weakness, but the abundance of Swords Dance and Slash users that ignore this makes the utility limited. Leer can be used on paralysis-intensive teams to drop Defense while reapplying the foe's paralysis Speed drop, often forcing the opponent to switch it out, but this is especially niche.</p> <h4>Checks and Counters</h4> <p><strong>Rock-types</strong>: Arcanine has nothing to contest Rock-types outside of hoping for a Fire Blast burn, leaving it countered by Golem and Kabutops, which 2HKO it with Earthquake and Surf, respectively. Kabutops is also excellent at making use of a resting Arcanine, as it often uses Swords Dance to threaten a sweep.</p> <p><strong>Water-types</strong>: Arcanine takes massive damage from Water-type attacks, which all 2HKO Arcanine, making Pokemon like Blastoise, Seadra, and Kingler threatening. Kingler strongly dislikes taking paralysis from Body Slam or burn from Fire Blast but can still 2HKO Arcanine.</p> <p><strong>Charizard</strong>: Charizard can 3HKO Arcanine with Earthquake, which becomes a 2HKO if it's taken even minor damage. Swords Dance allows Charizard to exploit Arcanine if it uses Rest; in fact, Charizard coming in on a predicted Rest can end the game on the spot. A healthy Arcanine can mortally threaten Charizard with Body Slam paralysis, though, so this matchup can be volatile.</p> <p><strong>Setup Sweepers</strong>: Once Arcanine uses Rest, it's left vulnerable to exploitation, and most setup sweepers have super effective coverage against it. Kingler, Kabutops, Sandslash, and Seadra are all capable of 2HKOing Arcanine after setting up.</p>",
    "sets": {
      "Defensive": {
        "description": "<h5>Set Description</h5> <p>STAB Fire Blast lets Arcanine deal significant damage to Venomoth while serving as its best attack against neutral targets like Nidoking. Body Slam lets Arcanine fish for paralysis as a midground option while denting Fire-resistant foes such as Blastoise and Charizard. Backed by Hyper Beam, Arcanine can 2HKO Mr. Mime if it's taken minimal damage and quickly finish off Fire-resistant Pokemon. Rest should rarely be used but bolsters Arcanine's defensive role, ensuring it can reliably stonewall Moltres, which can't outspeed and chip it down with Toxic + Fire Spin without Agility, and also gives Arcanine a chance to potentially recover in front of a paralyzed foe. However, waking it up can be difficult outside of switching into Fire Spin or weak attackers like Venomoth.</p> <p>Arcanine can be used as an anti-lead, possessing just enough Speed and power to function. Critical hit Fire Blast OHKOes Venomoth, and Body Slam paralysis against any of Charizard, Mr. Mime, and even rare sights like Primeape can be game-defining. Arcanine's bulk allows it to duel lead Charizard quite well, as usage of Earthquake potentially means taking a hit it can't afford so early into a game. It should be remembered that Arcanine is not 2HKOed by Earthquake. However, Arcanine doesn't always need to be a lead, as it can be a strong mid-game presence thanks to the reliability that its bulk, power, and Body Slam access provide. Its Speed is just right for a revenge killer role as well, crucially outrunning base 90 Speed Pokemon like Mr. Mime that are otherwise quite difficult to bring down when they have the advantage. Teams that use Arcanine primarily use it alongside Blastoise, providing a useful defensive backbone against Charizard. Offensively, Arcanine can potentially allow Mr. Mime to flourish by fending off opposing Mr. Mime and Clefable. Using Arcanine takes up a valuable team slot for a second Fire-type, however; there is very little reason to drop Charizard for Arcanine, and thus teams must find ways to check Water- and Rock-types in spite of this increased weakness.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 236353, "username": "Plague von Karma"}, {"user_id": 583793, "username": "Sabelette"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 491544, "username": "Shellnuts"}, {"user_id": 96315, "username": "phoopes"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Poliwhirl": {"sets": {"Amnesia": {}, "Offensive": {}}},
  "Poliwrath": {"sets": {"Amnesia": {}, "Bulky Sleeper": {}}},
  "Abra": {
    "outdated": true,
    "overview": "<p>Abra narrowly edges out Mr. Mime as the strongest Psychic-type special attacker in NU, and its base 90 Speed allows it to Speed tie with Mr. Mime, Moltres, and Venomoth and outspeed much of the tier. This makes it one of the tier's most potent special attackers and revenge killers, threatening notable Pokemon like Nidoking, Venomoth, and Kingler. Thunder Wave lets Abra crucially force out faster threats like Charizard and Electrode, as Charizard can only OHKO it 20% of the time with Hyper Beam and does not want to take paralysis for this chance. Abra can also occasionally turn its physical frailty to its advantage, sending back a near-lethal attack from Clefable or Charizard for immense damage with Counter.</p> <p>Abra's frailty cannot be overstated, however. Abra is so unfathomably frail that even stray coverage moves like Blastoise's Body Slam and Venomoth's Double-Edge easily 2HKO it; stronger moves, like Kingler, Clefable, and Raticate's Hyper Beam and Kabutops's Slash, are guaranteed to OHKO it. This means it essentially cannot switch into anything and will usually be forced out immediately after any revenge kill. It especially fears Raticate, which easily OHKOes it and is impossible to safely switch into. If Abra faces down a Raticate, it becomes a liability and likely has to be sacrificed. Abra also lacks recovery, so it cannot effectively switch into and check Mr. Mime despite resisting Psychic.</p>",
    "sets": {
      "Special Attacker": {
        "description": "<p>Psychic 2HKOes Psychic-weak foes like Nidoking and Venomoth and 3HKOes most neutral targets bar Moltres. Thunder Wave allows Abra to force out faster foes like Charizard and Electrode as long as it's fully healthy; even slight chip damage gives Charizard an easy OHKO with Hyper Beam, Slash, or even Earthquake. Seismic Toss is Abra's best option against Mr. Mime and helps to 4HKO Exeggcute after using Psychic twice to fish for critical hits or Special drops, which can sometimes allow Psychic to 3HKO it. Counter lets Abra exploit opposing predictions, as the opponent may be reluctant to use Hyper Beam against it, fearing a Rock-type; if Abra manages to catch a Body Slam or similar from a foe predicting this, it can return massive but usually nonlethal damage. Notably, however, it is guaranteed to OHKO Charizard by returning Slash and Kingler by returning Body Slam. Substitute is a rare option Abra may use to fish for paralysis or attempt to catch a foe switching out, allowing it to stay in and continue to fight, potentially even paralyzing the switch-in and fishing for another Substitute.</p> <p>Abra should always be used alongside Mr. Mime, as Mr. Mime is nearly a strict upgrade. Teams can use them in tandem to spread paralysis and deal massive, near-unresisted damage with Psychic. Such teams are very physically frail, and Abra benefits from an ally like Golem that can absorb physical attacks and especially Hyper Beam attempts before firing back. Abra also enjoys allies that really want Mr. Mime out of the way, like Kingler, which can also switch into Charizard for it. Abra can work well as a lead, trading paralysis and using Seismic Toss against Mr. Mime or paralyzing Charizard and landing one more hit in the vast majority of cases. This frees up allies like Mr. Mime, Charizard, and Blastoise to trade hits with other threats or clean up later. Abra can be used outside of being the lead, in which case it appreciates support from teammates that can spread paralysis, such as Venomoth and Clefable, as well as assistance in checking faster threats, such as from Golem, which checks Charizard and Electrode. Abra is hard to fit in this role, however, and often requires giving up Pokemon like Charizard or using an excessively frail team that can be punished by threats like Golem and Electrode.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 583793, "username": "Sabelette"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 375193, "username": "MrSoup"}, {"user_id": 96315, "username": "phoopes"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Machamp": {
    "outdated": true,
    "overview": "<p>Machamp is the embodiment of a tank in NU, capable of taking a wide array of attacks while attempting to hit back harder. Machamp's Fighting STAB makes it capable of threatening top-tier Pokemon like Clefable, Golem, and Kabutops, and it has complementary coverage in Rock Slide for Charizard and Venomoth. Machamp also has a powerful Hyper Beam, coming off the highest Attack stat in the tier, even KOing one of the tier's few Fighting-resistant Pokemon, Mr. Mime, after Body Slam. Although Machamp has high Attack and solid bulk, its poor Speed often means it mandates heavy paralysis support, lest it be easily outsped and revenge KOed by several common Pokemon. Machamp's reliance on the inaccurate Submission as a STAB move also can make it inconsistent at its role.</p>",
    "sets": {
      "All-Out Attacker": {
        "description": "<p>Submission makes Machamp the best offensive check to Clefable, easily 2HKOing it along with Golem, Kabutops, and Wigglytuff, and it has high odds to OHKO Raticate. Rock Slide nails common Fighting-resistant foes, 2HKOing Charizard, Moltres, and Venomoth. Earthquake hits Nidoking, which resists both Submission and Rock Slide, and also hits the rare Gastly while generally being a solid, high Base Power neutral attack against a majority of the tier. Body Slam lets Machamp spread paralysis itself and Hyper Beam can be used to trade against a chipped Mr. Mime, but otherwise Machamp's coverage moves are often stronger against the rest of the tier. Substitute allows Machamp to capitalize on the switches it often forces through its offensive presence, especially against paralyzed foes,</p> <p>Thunder Wave leads like Mr. Mime and Clefable are great partners for Machamp to start a game off with, spreading the yellow magic early. Stun Spore Venomoth and bulky Body Slam users like Blastoise and Charizard also aid Machamp in this regard. Machamp also helps Charizard by switching into—and beating—Rock-types like Golem and Kabutops, while Charizard outspeeds and threatens Fighting-resistant foes like Exeggcute, Mr. Mime, and Venomoth. Machamp's damage output can generate opportunities for faster Pokemon like Electrode and the aforementioned Charizard to clean up late game. Electrode in particular can assist Machamp with Thunder Wave while also appreciating Machamp's positive matchup against Golem and ability to effectively weaken Nidoking with Earthquake.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 400664, "username": "Stories"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 583793, "username": "Sabelette"}, {"user_id": 375193, "username": "MrSoup"}]}, {"name": "Grammar checked by", "members": [{"user_id": 168392, "username": "P Squared"}]}]}
  },
  "Rapidash": {
    "outdated": true,
    "overview": "<p>Rapidash finds a niche in NU thanks to its Speed and the inconsistent but infamous Fire Spin. Crucially outspeeding important Pokemon like Mr. Mime, Venomoth, Raticate, and Charizard, Rapidash generally relies on Fire Blast, Body Slam, and Toxic to spread status before using Fire Spin to chip down foes into range of its other moves. It also can clean up late game or revenge kill; its base 100 Attack makes it more effective at taking out physically frail foes like Mr. Mime compared to Charizard. Fire Spin can enable pivoting to escape dangerous checks and set up favorable matchups, and it's an effective way to gain momentum if Rapidash gets in against something that is likely to switch out, like Venomoth or Exeggcute. Rapidash can also team up with Charizard, Ninetales, and Moltres to add even more chances to land Fire Spin and status moves to wear down foes.</p> <p>Of course, Toxic + Fire Spin is a strategy with extremely shaky accuracy, and Rapidash's poor bulk does it no favors; it's 2HKOed by all Water-types and even rarely OHKOed by Seadra's Hydro Pump and Kingler's Crabhammer. Charizard's Earthquake also 2HKOes it, and Pokemon like Mr. Mime and Clefable can paralyze it, rendering it useless, so Rapidash has very few chances to attack or use Toxic without facing decimation in return. Kabutops also puts a stop to Fire Spin-reliant strategies in a hurry; Rapidash has no way to break through it other than applying burn or poison and hoping for extreme luck with Fire Spin. Golem is also difficult for Rapidash to break, Electrode is fast enough to force it out with the threat of Thunder Wave, and other Thunder Wave users can easily exploit Fire Spin misses, so Rapidash has multiple weaknesses against most teams. Poisoning the foe can also be problematic, as rendering dangerous foes like Charizard and Mr. Mime immune to paralysis may let them sweep. As a result, Rapidash is not recommended on the vast majority of teams.</p>",
    "sets": {
      "Fire Spinner": {
        "description": "<p>Rapidash's Speed combined with Fire Spin is the main reason to use it over better Pokemon like Ninetales and Moltres, and it serves to rack up chip damage, pivot out of bad matchups, and amplify status spread to the enemy team, forcing them to take as much as 10% per switch-in if poisoned or burned. Fire Blast is Rapidash's main attack, 3HKOing most non-resistant foes like Mr. Mime, Clefable, and Nidoking and 2HKOing frailer threats like Raticate and Venomoth. With a little chip damage from Fire Spin, these 3HKOs become 2HKOs, such as against Mr. Mime. Rapidash's base 100 Attack allows it to use Body Slam to decent effect, potentially paralyzing foes while dealing passable damage. Hyper Beam is a strong finisher against Mr. Mime in particular, dealing a minimum of 49.4% to it. Toxic can be used over the physical moves, but this is an inconsistent strategy and Rapidash will rarely manage to spread Toxic without taking paralysis or massive damage in return. If it's landed safely, it allows Rapidash to secure extra chip damage on each Fire Spin.</p> <p>Rapidash appreciates help from teammates that can spread status, like Mr. Mime, Venomoth, and Clefable, to buy it a little additional safety and give it chances to get in. It also likes bulky allies like Blastoise that can spread Toxic and other Fire-types to burn foes with Fire Blast and use their own Fire Spin to capitalize. Charizard is also good to capitalize on this chip damage; it comes just short of OHKOing many foes with a +2 Hyper Beam or Earthquake, so a little chip can set it up perfectly. Additional Fire-types also help to overwhelm common checks like Blastoise and Golem, which otherwise will inevitably manage to break through.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 583793, "username": "Sabelette"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 375193, "username": "MrSoup"}, {"user_id": 400664, "username": "Stories"}]}, {"name": "Grammar checked by", "members": [{"user_id": 168392, "username": "P Squared"}]}]}
  },
  "Slowpoke": {
    "outdated": true,
    "overview": "<p>Slowpoke can differentiate itself from Poliwhirl as an Amnesia sweeper with Thunder Wave to spread paralysis and higher Defense—although its horrid Speed tier makes paralysis especially a necessity and not a luxury. Its Speed tier also makes it a solid Thunder Wave absorber, since it does not mind a Speed drop. It can find setup opportunities on Pokemon it can threaten out with paralysis, or resist the attacks of, which includes Arcanine and Poliwhirl. After an Amnesia, it can deal good damage against Fire-types such as Moltres and Charizard and wall special attackers like Mr. Mime and Porygon. Slowpoke is also a check to opposing Water-types, most importantly Poliwhirl, as, after Sleep Clause has activated, there is little it can do to Slowpoke.</p> <p>However, Slowpoke’s bulk is quite mediocre, with its physical bulk being average and its special bulk being poor without any boosts. Even at +6 Special, Slowpoke gets ruined by a critical hit Thunderbolt from the likes of Electrode and Mr. Mime. Because of this, it can be taken advantage of while using Rest, which also makes it lose to physical attackers and setup sweepers like Nidoking, Clefable, Charizard, and Kabutops. Slowpoke also faces issues with its abysmal Speed tier; it is very easy to revenge kill and fails as a lead, unable to beat sleep inducers like Venomoth and Poliwhirl, vulnerable to partial trapping users like Dragonair and Pinsir, and targeted by Explosion users like Golem.</p>",
    "sets": {
      "Amnesia": {
        "description": "<h5>Set Description</h5> <p>Surf is Slowpoke’s best STAB option, offering great offensive coverage that lets it hit the likes of Charizard, Mr. Mime, and Nidoking effectively. Rest allows Slowpoke to continue its sweep by recovering hits taken while setting up, especially thanks to its increased special bulk due to Amnesia. Thunder Wave allows Slowpoke to outspeed and cripple Pokemon that can threaten it.</p> <p>Slowpoke has a very solid movepool, leaving a good amount of options to choose from. Psychic can be used over Surf, as, even though it is weaker against neutral targets, it sports a 30% special drop rate. It also hits Venomoth super effectively, as well as gaining a neutral hit on Water-types such as Blastoise and Kabutops. Blizzard allows Slowpoke to hit Exeggcute super effectively, as well as still hitting Moltres and Charizard. It also allows Slowpoke to fish for a freeze, which can be useful in a pinch. Ice Beam, although weaker than Blizzard, is more reliable. Fire Blast can deal good damage to Grass- and Bug-types, having a 28.2% chance of OHKOing the likes of Pinsir after an Amnesia. Toxic over Thunder Wave or Rest helps Slowpoke against partial trapping users such as Dragonair and Pinsir. Earthquake over either of those moves allows Slowpoke to deal good damage to Electrode. However, it serves little purpose outside this.</p> <p>Slowpoke is vulnerable to most Electric-type coverage within the tier, so having an Electric-immune teammate helps greatly. Nidoking and Golem are prime examples of this. Nidoking can switch into Electric-type moves from threats such as Electrode while taking out Pokemon that can force out Slowpoke like Clefable. Golem can switch into moves such as Mr. Mime's Thunderbolt and, after minor damage, KO with Explosion and let Slowpoke in for a sweep. Mr. Mime deserves a special mention, as it is all-around useful and can break through Water-type Pokemon such as Blastoise and Kabutops. Poliwhirl can be used alongside Slowpoke, as Slowpoke spreading paralysis opens Poliwhirl up to sweep late-game. Partial trappers such as Pinsir and Moltres provide a great form of chip damage to facilitate a late-game sweep with Slowpoke. Sleep support from Venomoth or Clefable gives Slowpoke reliable turns to set up against its foes.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 487308, "username": "BT89"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 520967, "username": "pac"}, {"user_id": 468904, "username": "SBPC"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}]}
  },
  "Magneton": {
    "outdated": true,
    "overview": "<p>Magneton is the hardest-hitting Electric-type in NU, competing with Electrode for a team slot. Magneton brings a number of advantages over its faster competition; firstly, it deals devastating damage, OHKOing Kingler outright with Thunderbolt and having rolls to OHKO every Water- or Flying-type foe with Thunder. Even neutral targets dislike facing Magneton due to its solid bulk and high damage; tier staples like Clefable and Mr. Mime face a 3HKO, and Magneton can even 2HKO it sometimes with Thunderbolt + Thunder. Charizard fares poorly with a mere 14.7% chance to 2HKO Magneton and a 2.6% chance to OHKO it with a critical hit. Even Moltres, the strongest special attacker in the entire game, can only 2HKO Magneton 20% of the time, and it faces a guaranteed 2HKO in return. Magneton has Thunder Wave as well, allowing it to hobble fast foes like Mr. Mime and Raticate that might otherwise deal with it decently.</p> <p>Of course, Magneton cannot do anything to harm Ground-types, a major matchup flaw that holds it back from prominence. Additionally, despite Magneton's superior offense and bulk, Electrode is generally better regarded than Magneton. Compared to Electrode, Magneton is much slower, failing to outspeed relevant targets like Blastoise, Kingler, Mr. Mime, Raticate, and Charizard, among others. Electrode's Speed and massive critical hit chance often allow it to avoid damage that Magneton cannot, and this critical hit chance also allows it to clean teams off the back of a critical hit OHKO or two. Explosion is also relevant for taking out frail targets like Mr. Mime or dealing significant damage to Nidoking; while both Electric-types are unable to harm Golem, Magneton additionally can't touch Nidoking. Despite this, Magneton can deal a lot of damage against foes like Clefable and Mr. Mime in situations where Electrode might balk at taking paralysis.</p>",
    "sets": {
      "Offensive": {
        "description": "<p>Thunder Wave allows Magneton to hamstring faster foes like Mr. Mime and Blastoise before dealing huge damage. Thunderbolt outright OHKOes Kingler, is a roll to OHKO Kabutops and Fearow, and 2HKOes Flying- and Water-type foes. Thunder, meanwhile, is a roll to OHKO most of these foes barring Moltres. Magneton is actually capable of utilizing Reflect + Rest due to its bulk and ability to spread paralysis, allowing it to potentially stall paralyzed foes like Clefable and Blastoise to recover HP without allowing Swords Dance sweepers safe entry. Since Magneton using Rest will often come by surprise, and the viable Swords Dance users are weak to Thunderbolt, it can usually get away with one Rest against a paralyzed foe. Using Rest without Reflect may allow Magneton to stall an endgame scenario assuming setup sweepers have been dealt with, while Reflect by itself can fend off Clefable, but Magneton will usually want Rest if it has Reflect. Double-Edge is a weak move that can have niche utility in chipping Nidoking for allies to finish off. Toxic is a niche option against Golem when combined with partial trapping from allies like Charizard that can help to wear it down more quickly, but this is inconsistent at best.</p> <p>Magneton can operate best by looking for chances to get in against Clefable, Wigglytuff, and Blastoise to spread paralysis and deal damage. It also exploits paralyzed Water- and Flying-types, forcing the opponent to choose between sacrificing their Pokemon or switching into a painful Thunderbolt. Magneton pairs well with allies that can cover for its horrid matchup into Ground-types, like Seadra and Blastoise. It also aids allies that benefit from paralysis, like Nidoking, Golem, and Kingler. Like most Pokemon, Magneton also enjoys support from Venomoth to remove its checks with Sleep Powder and weaken other foes with Stun Spore; this is particularly nice for Magneton due to its uniquely unwinnable matchups. Venomoth can also run Mega Drain to help weaken or outright defeat Golem, freeing up Magneton to go on the offensive.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 583793, "username": "Sabelette"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 400664, "username": "Stories"}, {"user_id": 375193, "username": "MrSoup"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Gastly": {
    "outdated": true,
    "overview": "<p>Gastly is one of the strongest pivots in the metagame due to its typing granting it complete immunity to numerous valuable offensive tools such as Body Slam, Hyper Beam, Slash, and Toxic. It's also one of the faster users of a sleep-inducing move in Hypnosis, which is incredibly important due to nearly every competitive team trying to spread sleep in some form. Its Ghost typing is also completely unique in the tier, allowing it to check Pinsir and Raticate; PP stall Wrap and Bind users such as Dragonair, Pinsir, and the niche Weepinbell; and pivot around the various Body Slams of the tier from the likes of Blastoise and Clefable.</p> <p>However, Gastly has some flaws that make it struggle to succeed consistently in the meta. Its typing faces issues defensively, being weak to common moves such as Psychic and Earthquake and giving it poor matchups versus numerous top-tier threats like Charizard, Nidoking, and the ubiquitous Mr. Mime. Gastly's Speed is also just not enough, leaving it outsped by all of the aforementioned threats, as well as the more notable sleepers in Venomoth and Poliwhirl. Finally, its bulk is generally quite poor, leaving it obliterated by key offensive threats like Charizard, Rapidash, and Mr. Mime once it has taken mild chip damage.</p>",
    "sets": {
      "Hypnosis": {
        "description": "<p>Hypnosis is one of Gastly's main selling points, as it's just fast enough to outspeed and threaten Golem, Clefable, and Exeggcute with sleep. Thunderbolt is Gastly's main attacking move, wielding chances to 3HKO or 2HKO notable Water- and Flying-types like Kabutops, Blastoise, Seadra, and Charizard. Mega Drain is Gastly's strongest move versus Golem and Kabutops, with chances to 2HKO both and recovering health in the process. Night Shade is used for consistent damage, though Psychic can be used over it or Mega Drain as a midground option that threatens Special drops and a 2HKO on Nidoking.</p> <p>Gastly's pitifully small movepool leaves little else to utilize. Explosion is the most enticing option, allowing Gastly to bring in teammates safely while dealing decent damage towards neutral threats, potentially KOing Mr. Mime after a singular Night Shade. Thunder is Gastly's strongest attack versus Blastoise, Seadra, Charizard, and Poliwhirl, 2HKOing all of them. However, its poor accuracy makes it an inconsistent option. Toxic is Gastly's most consistent check to Fire Spin users, most notably Rapidash, Charizard, and Moltres. Confuse Ray can achieve similar results as Toxic, but Toxic is a much more permanent solution to the issue and leaves Confuse Ray mostly outclassed.</p> <p>Gastly's weakness to Psychic make checks to Mr. Mime a necessity, so pairing it with Pokemon like Clefable, Porygon, and your own Mr. Mime is important. Its ability to deal good damage versus Water- and Rock-types such as Blastoise, Kabutops, and Golem makes Fire-types like Charizard, Moltres, and Rapidash potentially solid teammates, as they appreciate the support. Charizard is an especially good teammate, as it is a soft check to Nidoking and obliterates Exeggcute, both of which Gastly can struggle with. In addition to this, Gastly is a fantastic partner for Pokemon that fear paralysis from Body Slam such as Pinsir and Kingler. Gastly's access to Hypnosis also creates openings for Agility users like Dragonair and Moltres to make use of AgiliWrap strategies.</p> <p>Gastly comes in for free on opposing Poison- and Normal-type moves, most notably Toxic, Body Slam, Slash, and Wrap. This makes it one of the more effective switch-ins for Kabutops and Blastoise, as it is only 3HKOed by the former's Hydro Pump and is immune to its Slash, while the latter typically wields either Toxic or Body Slam and fails to 3HKO Gastly with Surf. This makes it an effective mid-game pivot, as its role as one of the safest switch-ins towards these Pokemon allows you to safely bring in Pokemon like Electrode that would normally fear Body Slam or force the opposing foe out with threat of a powerful coverage move or Hypnosis.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 520967, "username": "pac"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 236353, "username": "Plague von Karma"}, {"user_id": 468904, "username": "SBPC"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}]}]}
  },
  "Drowzee": {"sets": {"Standard": {}}},
  "Kingler": {
    "outdated": true,
    "overview": "<p>Swords Dance Kingler is the strongest wallbreaker and a potent sweeper in RBY NU. At +2, Hyper Beam can OHKO much of the tier, including threats like Mr. Mime, Raticate, and Venomoth, and nearly KO anything except Rock-types. Additionally, Body Slam followed by Hyper Beam will KO any Normal-neutral foe at +2. Rock-types are washed away by Crabhammer, a powerful STAB move that will almost always score a critical hit. It easily OHKOes Golem and 2HKOes Kabutops, coming just short of OHKOing Charizard and Ninetales. Kingler also has decent physical bulk, avoiding 2HKOs from some strong physical attacks such as Golem's Earthquake and opposing +2 Kingler's Body Slam. Due to its power and bulk, Kingler often forces switches and can fish for paralysis with Body Slam as opponents react to a potential Swords Dance sweep.</p> <p>However, Kingler is very slow for RBY NU, outsped by a myriad of prominent offensive threats. This means it requires extensive paralysis support from teammates to safely sweep and is ruined by getting paralyzed itself; this threat is compounded by Crabhammer's and Hyper Beam's middling accuracy. Also, even neutral special attacks such as Mr. Mime's Psychic 2HKO it. Kingler's weakness to Electric means it is forced out by Thunderbolt users such as Mr. Mime, Clefable, Nidoking, and Electrode, and even Fire Blast is a major threat to it.</p>",
    "sets": {
      "The Cringe Crab (Swords Dance)": {
        "description": "<h5>Set Description</h5> <p>Swords Dance defines Kingler's sweep and can reapply paralysis Speed reduction in situations where it needs to set up on a Thunder Wave or Body Slam user. Body Slam is a very powerful attack after a boost and threatens switch-ins with paralysis, which helps Kingler sweep and support its team. Hyper Beam is an outstanding finishing move, dealing massive damage to almost anything and outright OHKOing frailer foes at +2. Crabhammer hits Rock-types, complementing Kingler's physical damage output, and removes Fire-types after mild chip or Body Slam.</p> <p>Kingler's low Speed means it highly appreciates paralysis support from teammates such as Mr. Mime and Clefable. Kingler also appreciates teammates that can switch into Thunder Wave and Thunderbolt, such as Golem and Nidoking. Early-game, Kingler can wallbreak with Crabhammer and spread paralysis with Body Slam. It appreciates opportunities to enter the field against Charizard, Golem, and Blastoise, preferably as a revenge killer rather than switching into attacks, then using Body Slam, Crabhammer, or Swords Dance to remove one or two major threats, paving the way for its allies to sweep. If Kingler is saved for late-game, when the opponent's team is weakened and paralyzed, and sent in to revenge kill a foe lacking paralysis, it can easily use Swords Dance to sweep. Whether wallbreaking or sweeping, Kingler will want to stay and fight until it drops unless it has a safe switch and is still healthy. Kingler users should note the state of the opponent's team and whether significant checks like Mr. Mime remain healthy to decide whether to set up or use its raw power.</p> <h5>Other Options</h5> <p>Kingler should generally not run any other moves than the four listed in the set. Stomp is much weaker than Body Slam and makes Kingler even more reliant on its team to spread paralysis. Blizzard only hits the relatively niche Exeggcute effectively, 2HKOing it but giving up far more relevant moves. Similarly, Surf's accuracy may sound appealing, as it still OHKOes Golem, but this makes Kingler unable to stop Fire-types and Kabutops. Substitute is held back by Kingler's bad Special, and does not address Kingler's weakness to Thunder Wave.</p> <h5>Checks and Counters</h5> <p><strong>Electric-type Attacks</strong>: Electrode, Nidoking, and Mr. Mime outspeed Kingler and can 2HKO it with Thunderbolt, with Electrode even having a chance to OHKO bolstered by its high critical hit rate. Clefable is slower than Kingler and takes heavy damage from boosted Body Slam, but it can paralyze and 2HKO Kingler and does not fear Body Slam paralysis.</p> <p><strong>Paralysis</strong>: Thunder Wave users such as Clefable and Mr. Mime can dash any chance of Kingler sweeping late-game. Getting paralyzed means Kingler can no longer outspeed some of the slowest Pokemon in RBY NU or outspeed faster paralyzed foes.</p> <p><strong>Faster Special Attackers</strong>: Kingler's poor Special means even moderately strong special attacks like Mr. Mime's Psychic 2HKO it. Even Moltres's Fire Blast, which Kingler resists, will always 3HKO it. Its low Speed exacerbates this issue, as it can't outspeed most of the threats that threaten to KO it.</p> <p><strong>Burn</strong>: Kingler, as a Water-type, may eventually need to switch into Fire Blast, which has a 30.1% chance to burn. A burned Kingler must use Swords Dance to negate the Attack drop but can at least use Crabhammer unhindered.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 473639, "username": "LTG"}, {"user_id": 583793, "username": "Sabelette"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 520967, "username": "pac"}, {"user_id": 468904, "username": "SBPC"}, {"user_id": 375193, "username": "MrSoup"}, {"user_id": 486979, "username": "juoean"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}, {"user_id": 331519, "username": "CryoGyro"}]}]}
  },
  "Exeggcute": {
    "outdated": true,
    "overview": "<p>What Exeggcute lacks in stats, it makes up for in status moves and typing, utilizing its key Psychic and Electric resistances to spread sleep and paralysis. It is one of the few Pokemon available that can inflict sleep consistently. It can switch into, status, and wear down the opponent's Mr. Mime without exposing your own Mr. Mime to paralysis, keeping it healthy so it can run rampant later in the match. Its resistance to Mr. Mime's, Electrode's, and Venomoth's primary attacks makes it good support for teams otherwise vulnerable to these foes, and it minds paralysis less than most Pokemon. It also packs Explosion to heavily damage a foe on the way out and grant free entry to a deadly attacker or setup sweeper, allowing for clever positioning to set up a nice endgame sweep.</p> <p>Exeggcute's typing does, however, make it extremely vulnerable to the plentiful Fire- and Ice-type attacks in the tier. Even though it resists Earthquake, its very low Speed and lack of Grass-type STAB moves make it a mediocre Golem check, and its low Special and Ice weakness make it an extremely unreliable switch-in to Nidoking. Its physical bulk, while passable, is insufficient to avoid OHKOs from Kingler's and Pinsir's +2 Hyper Beams, leaving it unable to stop their sweeps with Stun Spore. Additionally, its low offensive stats leave it rather passive after it spreads status, and it will almost certainly get paralyzed as it tries to put something to sleep, which leaves it with an inconsistent 56% chance to actually land its status moves thereafter. Nonetheless, Exeggcute is a considerable thorn in the side of almost any NU team given the sheer prevalence of Mr. Mime and Venomoth.</p>",
    "comments": "<h4>Other Options</h4> <p>Rest gives Exeggcute longevity against Mr. Mime and Electrode, letting it continually frustrate their attempts to make progress and provide a safe switch for Pokemon vulnerable to them. However, due to its low bulk and common weaknesses, it invites sweepers like Nidoking and Raticate and Swords Dance users like Kingler and Kabutops in, letting them throw out devastating attacks while it is asleep. It also must fear repeated Special drops from Mr. Mime, which will eventually force a switch. Double-Edge could be used to pressure Mr. Mime slightly more heavily than Psychic; however, it only threatens a 5HKO with Exeggcute's dismal Attack stat, and the move weakens Exeggcute with recoil damage. Alternatively, Egg Bomb avoids recoil damage at the cost of a poor 74.7% accuracy. Solar Beam is Exeggcute's only Grass-type attack—it threatens Kingler, Kabutops, and Golem with an OHKO and inflicts massive damage on Blastoise and Seadra. However, since the opponent can simply switch out during its charge turn, Solar Beam is only possibly useful late-game, when they might lack healthy Grass-resistant Pokemon to tank it.</p> <h4>Checks and Counters</h4> <p><strong>Bulky Water-types</strong>: Blastoise and Seadra are faster than Exeggcute, aren't threatened much by its Psychic or Explosion, aren't affected heavily by paralysis, and shred Exeggcute with Ice-type attacks. Blastoise's Seismic Toss followed by Blizzard has an 82% chance to KO, making it nearly impossible for Exeggcute to switch in or bait an attack to pivot in a teammate.</p> <p><strong>Fire-types</strong>: All fully-evolved Fire-types outspeed and OHKO Exeggcute with Fire Blast, and they are either 5HKOed or 4HKOed by Exeggcute's weak Psychic. Stun Spore on the switch takes their greatest asset away, though.</p> <p><strong>Clefable and Wigglytuff</strong>: Both Clefable and Wigglytuff outspeed and 2HKO Exeggcute with Blizzard, and if they don't have that, they can 3HKO with two Body Slams followed by Hyper Beam. They are already slower than most of the tier and thus aren't harmed much by paralysis, and Psychic only 5HKOes them, letting them bully Exeggcute once Sleep Powder isn't an option.</p> <p><strong>Fearow, Raticate, and Nidoking</strong>: In a pinch, these fast offensive Pokemon 2HKO Exeggcute to win one-on-one, but all are severely hampered by paralysis, and Nidoking especially does not take Psychic well. They are very effective at punishing Rest Exeggcute, taking advantage of its sleeping turns to switch in safely and blow holes in its team.</p>",
    "sets": {
      "Support": {
        "description": "<h5>Set Description</h5> <p>Exeggcute's primary goal is to get in and put something to sleep as soon as it can, and then it attempts to spread paralysis to support its team. Teammates shouldn't paralyze Pokemon Exeggcute struggles to handle, like Fire-types, before Exeggcute gets in and puts a foe to sleep. Psychic is Exeggcute's best attacking option and hits most Pokemon in the tier for neutral damage. Psychic's 33.2% chance of reducing Special helps Exeggcute to overcome its passiveness, breaking down even bulky foes when combined with paralysis. A Special drop also provides defensive benefits, such as preventing Blastoise and Seadra from 2HKOing Exeggcute with Blizzard and reducing even Moltres's nuclear Fire Blast to a 2HKO, giving a healthy Exeggcute the option to boldly stay in on Fire-types and debilitate them with status. Explosion allows Exeggcute to take out over two-thirds of Mr. Mime's HP, leaving it in KO range for most allies, or to deal around 50% to most foes while granting an ally free entry. This allows Exeggcute to grab momentumwhen it's about to faint anyway and potentially set up an ally's sweep.</p> <p>Water-types in particular have good synergy with Exeggcute, covering for its weakness to Fire and Ice, while Exeggcute in turn covers their Electric weaknesses. Kingler and Kabutops also benefit from Exeggcute's relatively weak Explosion, which can grant them a safe moment to set up Swords Dance against a weakened foe. Powerhouses below base 90 Speed, like Nidoking and Kingler, enjoy Exeggcute as a relatively safe switch-in to escape heavy damage or paralysis from Mr. Mime, Electrode, or Venomoth, and it can inflict status to help them blow apart the opposing team. While Exeggcute can't fight Ground- and Water-types one-on-one, its resistances to their STAB attacks let it bait out their weaker coverage moves, letting teammates switch in more safely.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 233818, "username": "Enigami"}, {"user_id": 583793, "username": "Sabelette"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 236353, "username": "Plague von Karma"}, {"user_id": 520967, "username": "pac"}, {"user_id": 96315, "username": "phoopes"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}]}
  },
  "Seadra": {
    "outdated": true,
    "overview": "<p>Seadra is a potent attacker and late-game Agility sweeper in RBY NU that also happens to match up well against many \"Big 5\"—Mr. Mime, Clefable, Blastoise, Charizard, and Venomoth—structures, as these teams often use Nidoking, Golem, or Kabutops as their sixth Pokemon, all of which lose to Seadra. Seadra Speed ties Nidoking and outruns much of the tier, giving it solid matchups against most slower foes, and it can bypass paralysis with Agility to help against foes like Clefable and Wigglytuff. It's also one of the best Pokemon against a late-game Charizard sweep, as it survives a +2 Hyper Beam with ease. Seadra's passable bulk and high Special let it duel much of the tier and relieve some pressure from Blastoise, which is often stretched thin checking opposing Blastoise and Charizard. Thus, it can serve as a mid-game attacker and pivot to free up Blastoise—assuming the opposing Blastoise is put to sleep or otherwise handled—or it can act as a late-game cleaner, allowing players to use Blastoise heavily early-game and follow up with Seadra to close out the game.</p> <p>However, Seadra struggles horribly against the ubiquitous Blastoise, which it can only 5HKO with the inaccurate Hydro Pump, and Kingler, which it rarely 3HKOes with Hydro Pump or 4HKOes with Surf, but Kingler can easily set up Swords Dance and retaliate for massive damage. Seadra's Speed is great, but it's still outsped by Mr. Mime, Raticate, and Electrode, all of which usually beat it one-on-one; Venomoth also outspeeds it and can put it to sleep. While Seadra easily beats many foes one-on-one, it cannot switch into them; Nidoking and Kabutops beat Seadra if it has to switch into them, and Golem deals a big chunk of damage with Earthquake as well.</p>",
    "comments": "<h4>Other Options</h4> <p>Seadra has few notable other options. Toxic can help it damage Blastoise, but unless it lands Toxic as Blastoise switches in, this is relatively ineffective; also, since Toxic turns to normal poison after switching out, the foe may be able to preserve Blastoise and send something else to finish off Seadra after a Seismic Toss or two. Smokescreen allows Seadra to fish for misses and can be combined with Toxic, but this is extremely luck-based and unlikely to work. Hyper Beam deals slightly more damage than Surf to Mr. Mime, but it's rarely worth the moveslot over Hydro Pump, which outdamages both moves without the drawback. It also can finish off Blastoise, but it deals a minimum of 23%, so it's only a little better than Hydro Pump. Blizzard is the best move to drop for Hyper Beam, as Exeggcute and Fearow are rare.</p> <h4>Checks and Counters</h4> <p><strong>Blastoise</strong>: Blastoise completely shuts down Seadra, which does almost no damage to it. Worse still, Seismic Toss 4HKOes Seadra, 3HKOing it after slight chip damage, so Blastoise easily wins the matchup and is difficult to switch into. Blastoise can also safely fish for Body Slam paralysis twice and still 4HKO Seadra, so switching becomes even less safe.</p> <p><strong>Electrode</strong>: Electrode outspeeds Seadra and 2HKOes it, and its massive critical hit rate only skews the matchup further. Seadra can only rarely 2HKO Electrode with Hydro Pump, so even a healthy Seadra with Agility set up will usually lose.</p> <p><strong>Thunderbolt Users</strong>: Mr. Mime and Clefable both can beat or, at worst, heavily damage Seadra; Mr. Mime outspeeds and tenuously 2HKOes it with Thunderbolt, while Clefable is slower and 3HKOes it. However, Seadra has poor odds to 2HKO Mr. Mime with Hydro Pump and will usually need to hit Hydro Pump at least twice followed by a Surf to 3HKO Clefable. Clefable is a weaker check, as Seadra is faster and has better odds to win the matchup, but any chip damage puts the matchup squarely in Clefable's favor.</p> <p><strong>Venomoth</strong>: Venomoth outspeeds Seadra and can put it to sleep, preventing it from making much progress early-game. Seadra can only 3HKO Venomoth, so it's unlikely to avoid sleep.</p> <p><strong>Kingler</strong>: Kingler usually stops Seadra but is unable to switch into it. Kingler can set up on Seadra and KO it with +2 Body Slam followed by Hyper Beam, while Seadra can only 4HKO Kingler with Surf or 3HKO it with Hydro Pump 37% of the time, which is effectively a mere 19% chance after accounting for accuracy.</p>",
    "sets": {
      "Agility Sweeper": {
        "description": "<h5>Set Description</h5> <p>Surf and Blizzard hit all targets except opposing Water-types— Surf 2HKOes Charizard, Ninetales, Nidoking, and Raticate, and it rarely 2HKOes Moltres, while Blizzard 2HKOes Exeggcute and Fearow. Hydro Pump 2HKOes Kabutops and gives Seadra the extra damage needed to KO Moltres after a Surf; it also gives it a chance to 2HKO Mr. Mime and Electrode and helps secure the 3HKO on Venomoth. Agility allows Seadra to shrug off paralysis and outspeed threats like Mr. Mime, Nidoking, and Charizard; if Seadra sets it up before securing a KO, it can land an extra hit or two before going down. Agility also enables it to sweep late-game against weakened teams after setting up against foes like Nidoking and Golem or against Fire-types.</p> <p>Seadra's typical gameplan is to wait for Blastoise to be removed, often by trading one's own Blastoise for it, then looking for an opportunity to get in against a slower foe and take it out. Against foes it cleanly 2HKOes, it can often set up Agility, allowing it to not only defeat the foe in front of it but also land an extra hit against revenge killers like Electrode, Mr. Mime, and Charizard. Similarly, it can be saved to clean up late-game, setting up Agility in front of a weakened foe and then tearing through its chipped opposition. If faster threats have been paralyzed, Seadra can win outright without setup; a paralyzed Charizard is no threat to it, and a paralyzed Mr. Mime will often fail to 2HKO it.</p> <p>Seadra is best used alongside other Water-types, like Blastoise and Kingler, to help overwhelm opposing Thunderbolt users and check Charizard. It exploits Ground-type Pokemon that are often used to protect their teammates from an Electrode sweep and should be used on teams looking for extra insurance against these threats, since Blastoise has a hard time with Nidoking and is already overtasked with checking opposing Charizard and Blastoise. Most teams with Seadra are extremely weak to Electrode, as they usually have Charizard and Blastoise as well. Charizard can be dropped for a Ground-type to cover this weakness. Seadra also easily pivots into Blizzard from Clefable or Nidoking and duels them, helping to protect Ground-type allies. Blastoise completely walls Seadra, so teams that can overwhelm Blastoise with attackers like Electrode, Nidoking, and Kingler help to enable it. Sleep inducers, like Venomoth and Exeggcute, can help to remove checks like Blastoise and Mr. Mime and spread paralysis to further enable Seadra.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 583793, "username": "Sabelette"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 520967, "username": "pac"}, {"user_id": 233818, "username": "Enigami"}, {"user_id": 375193, "username": "MrSoup"}, {"user_id": 593847, "username": "nicole7735"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}, {"user_id": 384270, "username": "autumn"}]}]}
  },
  "Mr. Mime": {
    "outdated": true,
    "overview": "<p>Mr. Mime is the best Psychic-type in RBY NU. Its excellent Speed, STAB Psychic, and lack of weaknesses let it work as a lead, wallbreaker, or cleaner, and most teams will have issues checking it with anything other than their own Mr. Mime. Thunder Wave and Thunderbolt grant it the utility and coverage to take on almost any foe, especially given the prevalence of fast foes as well as Water- and Flying-types. It also makes an excellent revenge killer, as few foes outpace it and it is difficult to switch into. Mr. Mime easily beats Blastoise and Venomoth one-on-one, ruins Charizard with Thunder Wave and heavy damage, and even scares Clefable with a critical hit or Special drop. Every single team benefits from Mr. Mime's damage output and Thunder Wave support, so it should never go unused.</p> <p>That said, Mr. Mime has several weaknesses, including its horrendous physical bulk, vulnerability to Seismic Toss, and difficulty breaking past NU's other Psychic-type, Exeggcute. Many Pokemon, such as Kabutops, Moltres, and Golem, 2HKO Mr. Mime, so it becomes incredibly vulnerable once paralyzed, and Seismic Toss 3HKOes it. Since Mr. Mime is so difficult to check, teams lacking Exeggcute will usually send their own Mr. Mime to trade Thunder Wave, ensuring that at least an ally can finish it off. Clefable, Electrode, and rare niche picks like Porygon, Abra, and Drowzee can also force this trade or force it out. Additionally, while Mr. Mime's Speed is nothing to scoff at, it's still a bit slower than Raticate, Charizard, and Ninetales, so they can beat it one-on-one.</p>",
    "comments": "<h4>Other Options</h4> <p>Mr. Mime lacks many other options. Counter is the main option of note, as this turns its physical frailty into a dubious boon, sending back strong attacks like Slash, Super Fang, and Body Slam for massive damage and dealing 70% to opposing Mr. Mime after Seismic Toss. This has several problems though; it is difficult to fit, usually replacing Seismic Toss, and Counter + Thunderbolt fails to KO Mr. Mime. Using Counter on Super Fang cannot KO Raticate, which is also faster and could use Body Slam instead. Slash seems like a good opportunity for Counter, but Charizard may use Fire Blast and often does not run Slash in the first place, while Kabutops is 2HKOed by Thunderbolt and only rarely OHKOed by Counter. Barrier can be used as a tricky move to take Hyper Beam from slower foes like Clefable, Kabutops, and Kingler, but this is very prediction-reliant and many foes have ways around it, such as strong special attacks; it also costs a moveslot that Mr. Mime really cannot afford. Attempting to set it up in advance is fairly pointless, as the opponent can exploit missing coverage once they see it.</p> <h4>Checks and Counters</h4> <p><strong>Psychic-types</strong>: Exeggcute's viability hinges on its ability to reliably check Mr. Mime. It's at worst 4HKOed barring critical hits and Special drops, and it threatens sleep and paralysis in return. It can potentially use Explosion to allow a threat like Charizard in freely. Rare options like Drowzee and Abra absorb Mr. Mime's attacks well and threaten status and a 3HKO with Seismic Toss; Drowzee fares better due to its superior bulk, but Abra is capable of hamstringing and chipping Mr. Mime as well. Mr. Mime commonly checks itself as well, coming in after a KO to paralyze and trade hits.</p> <p><strong>Paralysis</strong>: Once Mr. Mime is paralyzed, Pokemon like Golem, Kabutops, Nidoking, and Kingler can crush it. Even special attackers like Blastoise and Seadra handily beat a paralyzed Mr. Mime, and it struggles to switch in against anything but Venomoth. However, its ability to block sleep is very valuable and provides an early-game opportunity to land more damage or paralysis.</p> <p><strong>Clefable</strong>: Clefable is bulky enough to duel Mr. Mime, but a single Special drop vastly worsens this matchup. Thunder Wave permanently reduces Mr. Mime's threat, or Clefable can opt to 3HKO it with Body Slam and potentially paralyze it along the way. Hyper Beam sets fare relatively well against Mr. Mime, often KOing it after Body Slam.</p> <p><strong>Revenge Killers</strong>: Mr. Mime lacks recovery and often takes heavy damage in early- to mid-game fights, leaving it vulnerable to revenge killers like Charizard, Ninetales, and Raticate. Raticate is especially difficult to switch into, but all of these Pokemon also keep Venomoth out, preserving momentum regardless of whether Mr. Mime stays or switches out. Electrode, Fearow, and the rare Arcanine are also effective revenge killers and can beat Mr. Mime one-on-one if necessary.</p> <p><strong>Golem</strong>: Golem is a very tenuous check to Mr. Mime, relying on finding free entry against an Electric-type move. It 2HKOes Mr. Mime with Earthquake, but Mr. Mime 2HKOes Golem given an immediate Special drop or one critical hit, so the odds actually favor Mr. Mime if it is unparalyzed. However, paralysis makes Golem a much safer check, and Explosion OHKOes Mr. Mime, a generally advantageous trade for the Golem user.</p> <p><strong>Moltres</strong>: Moltres Speed ties Mr. Mime and 2HKOes it, while Thunderbolt only 3HKOes it 47% of the time before accounting for critical hits. Moltres can therefore tenuously revenge kill Mr. Mime or, after checks like Kabutops and Golem are removed, take paralysis to set up Agility, defeat Mr. Mime, and proceed to deal heavy damage. This is risky, however, as paralysis reduces Fire Blast's already shaky consistency.</p>",
    "sets": {
      "Standard": {
        "description": "<h5>Set Description</h5> <p>Psychic 2HKOes Venomoth and Nidoking—its 33% Special drop chance and Mr. Mime's 17.6% critical hit chance often allow it to 2HKO or 3HKO even bulky foes. It's also a spammable option that dents almost any foe, and it puts Charizard and Blastoise in range of a 2HKO from Thunderbolt or a potential OHKO after a critical hit or Special drop. Thunderbolt covers the tier's many Water- and Flying-types, 3HKOing bulkier ones like Blastoise and Charizard and 2HKOing the frailer Kabutops and Kingler. Seismic Toss primarily covers opposing Mr. Mime, 3HKOing it, but it also 3HKOes Abra and 4HKOes Exeggcute. Thunder Wave shuts down fast sweepers and wallbreakers like Charizard and Mr. Mime and maintains a Speed advantage against slower Thunder Wave users; with a Psychic drop reapplying the Speed drop, even paralyzed Charizard, Moltres, and Ninetales become slower than paralyzed Mr. Mime.</p> <p>Mr. Mime makes an excellent mid-game wallbreaker or late-game cleaner. In both roles, it benefits from allies that can help to remove Thunder Wave users so it can simply attack without fear of paralysis. Wigglytuff can weaken Clefable, Exeggcute shuts down opposing Mr. Mime, and Raticate is a fearsome wallbreaker that can revenge kill Clefable and Mr. Mime effectively. Nidoking benefits heavily from any paralysis Mr. Mime manages to spread, letting it revenge kill opposing Mr. Mime, Charizard, and Raticate. As a wallbreaker, Mr. Mime can help clear the way for teammates like Charizard, Moltres, and Seadra to sweep by removing troublesome Water-types and Thunder Wave users. Defensively, it has difficulty with powerful physical attackers like Golem, so bulky allies like Blastoise and Kingler can help protect it.</p> <p>Mr. Mime is often used as a lead, threatening opposing leads with paralysis and preventing frustrating scenarios like an early Charizard sweep. In this role, it may sometimes opt to take paralysis and switch out, returning later to blockade Venomoth's sleep attempts and retaliate with Thunder Wave or a powerful attack. This is somewhat risky, so lead Mr. Mime heavily appreciates slower, hard-hitting allies like Golem and Kabutops for opposing leads like Charizard and Mr. Mime; in return, it can protect them from Venomoth putting them to sleep in retaliation. However, usually lead Mr. Mime will stay in, use Thunder Wave, and simply attack until it is KOed, enabling a teammate to revenge kill or letting Venomoth attempt Sleep Powder. In this role, it needs very little support, and the rest of the team can simply focus on enabling Charizard or another sweeper. Mr. Mime is somewhat unhappy to see Venomoth as the opposing lead, as Venomoth may win the Speed tie, and Mr. Mime can only OHKO it with a critical hit. Overall, Venomoth is favored to land Sleep Powder in this matchup, removing a major threat, but Mr. Mime has a chance to simply obliterate it or dodge Sleep Powder and gain a massive advantage.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 583793, "username": "Sabelette"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 236353, "username": "Plague von Karma"}, {"user_id": 231074, "username": "S1nn0hC0nfirm3d"}, {"user_id": 375193, "username": "MrSoup"}, {"user_id": 593847, "username": "nicole7735"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}, {"user_id": 331519, "username": "CryoGyro"}, {"user_id": 384270, "username": "autumn"}]}]}
  },
  "Scyther": {
    "outdated": true,
    "overview": "<p>Scyther has an array of applicable offensive tools in the NU metagame. Slash bypasses Pokemon relying on Reflect, such as Abra and some Clefable variants, while Swords Dance and Hyper Beam make it tough for Normal-neutral Pokemon to switch into. Scyther is also one of the fastest unboosted Pokemon in the metagame; it ties for the second-fastest Pokemon in the tier with Rapidash and has a superb critical hit ratio of 20.5%. Its already terrific Speed can be bolstered with Agility, meaning it cannot be pinned down by partial trappers and opposing Agility users like Dragonair and Moltres either. With adequate paralysis support and good prediction, Scyther can theoretically be used as a powerful late-game cleaner.</p> <p>However, Scyther has too many flaws to warrant a spot on most teams. Its low bulk and horrid defensive typing render many attackers able to 2HKO or even OHKO it. These include notable Pokemon such as Blastoise, Nidoking, Golem, and Kingler. Scyther's reliance on Speed means that even with Agility, it is severely debilitated by paralysis compared to other sweepers. It also has a barren movepool: besides the miserably weak Wing Attack, it only possesses Normal-type attacks, meaning Rock-types like Golem and Kabutops can easily switch in and make progress against it. Other fast sweepers, such as Mr. Mime and Electrode, can provide more offensive presence throughout matches, as they sport better coverage moves and provide utility with status moves like Thunder Wave. While Scyther can be used to lure its counters and grant switch-in opportunities for its teammates like Blastoise and Kingler, this tends to be prediction-reliant and inconsistent.</p>",
    "sets": {
      "Double Dance": {
        "description": "<p>Swords Dance makes Scyther's Hyper Beam one of the most threatening moves in the tier, always or possibly OHKOing Pokemon like Mr. Mime, Electrode, and Rapidash at +2. Agility allows it to outspeed the entire unboosted metagame, notably including Electrode and Rapidash, which usually threaten it out with super effective moves. If Scyther is paralyzed, Agility can also remove the Speed drop. Slash is its primary attacking move, almost always scoring a critical hit and punishing foes for switching into predicted Swords Dance, 3HKOing foes like Charizard, Poliwhirl, and Ninetales. Unfortunately, it does not get a power boost with Swords Dance.</p> <p>Scyther's shallow movepool leaves it with few other options. Agility is the most replaceable, as Scyther is already fast and does not need the additional Speed most of the time. Toxic discourages AgiliWrap Dragonair and Fire Spin users like Moltres, Charizard, and Rapidash from setting up on it. Unlike Slash, Double-Edge gets the power boost from Swords Dance and can be utilized if Slash's immediate power is not desired. Wing Attack can be used to damage Gastly, but not only is Gastly rare, Wing Attack also has lower damage than Slash even against super effective targets. Substitute can be used to ease prediction, rack up poison and burn damage, and fish for full paralysis and misses, such as against Fire-types like Charizard, Ninetales, and Moltres.</p> <p>As Scyther struggles to make headway against Rock-types like Kabutops and Golem, Grass-types like Exeggcute and Weepinbell are useful teammates. Scyther is also vulnerable to Fire-types like Ninetales, Rapidash, and Moltres, so Water-types like Kabutops and Blastoise to withstand Fire- and Rock-type attacks are also appreciated. Scyther can function as a lure for Rock-type Pokemon, which makes it easier for its partners like Blastoise and Kingler to predict an attack. Sleep inducers such as Poliwhirl and Venomoth can cripple Scyther’s counters and can facilitate setup opportunities. In turn, Scyther can come in on predicted Rest from Pokemon like Poliwhirl and Blastoise, enabling it to more easily break through the opposition.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 543866, "username": "5Dots"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 520967, "username": "pac"}, {"user_id": 236353, "username": "Plague von Karma"}]}, {"name": "Grammar checked by", "members": [{"user_id": 331519, "username": "CryoGyro"}]}]}
  },
  "Pinsir": {
    "outdated": true,
    "overview": "<p>Pinsir is a frightening Swords Dance sweeper in RBY NU, possessing one of the highest power levels in the tier in the tier alongside Bind and Slash. Once set up, Pinsir goes on a rampage, quickly chipping down Pokemon with Bind before letting loose one of the strongest Hyper Beams in the game. Pokemon like Mr. Mime, Dragonair, Venomoth, Exeggcute, and Poliwhirl are even threatened with outright OHKOs at +2, while Blastoise and Clefable need minimal Bind chip damage to OHKO as well. Pinsir is by no means slow either, tying Nidoking and Seadra and getting the jump on Blastoise and Kabutops. When forming a core with wrappers such as Rapidash, Moltres, and Charizard, Pinsir can add some much-needed physical attacking prowess. With paralysis support from the likes of Mr. Mime, Venomoth, and Porygon, Pinsir can also sweep past otherwise faster checks like Charizard and Moltres.</p> <p>However, Pinsir's movepool is extremely shallow, making it linear and open to very simple counterplay, such as switching in Golem or even just having Counter. With the high viability of Fire-types in RBY NU, Pinsir's low Special also comes back to haunt it, leaving it OHKOed by even Charizard's Fire Blast and limiting setup opportunities against special attackers like Seadra. This special frailty means Pinsir is best used on teams populated by Water-types such as Blastoise and Kabutops, the latter with which actually competes heavily with it. That competition further extends to Kingler, which possesses similar qualities to Pinsir while having reliable counterplay to Rock-types in Crabhammer, as well as other Pokemon like Sandslash. However, it fares well alongside these Swords Dance users, and Bind can be enough for it to distinguish itself over them. Worse still, Pinsir's Speed, while good, is still not quite desirable; Fire-types revenge kill it, as do Venomoth, Fearow, and tier-king Mr. Mime. Its suboptimal Speed also makes paralysis even worse, exposing its fragility and making it very difficult to clean up even paralyzed teams. Regardless, Pinsir functions as an effective wallbreaker or sweeper, supporting top-tier Pokemon like Charizard very well in the metagame.</p>",
    "comments": "<h4>Other Options</h4> <p>Pinsir can drop Bind for more offensive flexibility, but this makes it more of a momentum sink, forcing Pinsir to manually switch out against slower Pokemon if threatened with paralysis or heavy damage. Ergo, many teams have to use a deliberate game plan centered around strictly late-game usage for these sets to work. However, sets like Swords Dance / Hyper Beam / Body Slam / Submission provide Pinsir with alternative midground options once successfully switched in, more effectively contesting common switch-ins like Golem and Charizard.</p> <p>In terms of niche move choices, Pinsir has few that are justifiable because of its terrible movepool. Toxic is feasible for incapacitating Fire Spin users as they switch in, such as Charizard, Ninetales, and Moltres, but Body Slam is normally enough of a deterrent. However, it does come with the added bonus of piling chip damage on Rock-types when used alongside Bind. Seismic Toss is all Pinsir can muster for the very rare Gastly, but Bind can at least secure a safe pivot, and Seismic Toss is rarely helpful.</p> <h4>Checks and Counters</h4> <p><strong>Fire-types</strong>: All Fire-types in RBY NU, with the exception of Flareon, outspeed and mortally threaten Pinsir with Fire Blast and Fire Spin, namely Charizard, Ninetales, Rapidash, Arcanine, Moltres, and the rare Magmar. Even if Pinsir survives a Fire Blast from Rapidash or Magmar, it is still at risk of being burned and instantly fainting. However, if the Fire-types are paralyzed, Pinsir poses a serious threat, as a +2 Hyper Beam will KO any of them if they have taken minor damage prior.</p> <p><strong>Rock-types</strong>: If Pinsir lacks Submission, it can hardly scratch Rock-types like Golem and Kabutops, immediately losing momentum and having to pivot with Bind. If it does have Submission, however, Pinsir is capable of dealing massive damage, 2HKOing them at +2.</p> <p><strong>Paralysis</strong>: Pinsir needs foe paralysis to outspeed the faster threats of RBY NU and therefore despises taking it itself; ergo, faster paralysis users such as tier-king Mr. MIme, Venomoth, Electrode, and the rare Abra can force Pinsir out after it gets a KO. Clefable, Wigglytuff, and Porygon are also capable of absorbing hits from an unboosted Pinsir and paralyzing it in return. Body Slam is also common on a myriad of Pokemon, most commonly Clefable, Wigglytuff, Kingler, and some Blastoise variants, which can pose further risk. While Pinsir can threaten Clefable and Wigglytuff with Submission, it will take high recoil damage in the process, with the latter costing around a third of its health at +2. While Swords Dance can reapply the paralysis Speed drop on foes to help if Pinsir has been paralyzed, this is unreliable and leaves it open to attack.</p> <p><strong>Counter Users</strong>: Pinsir is the sole fully-evolved Pokemon that has no damaging moves that can circumvent Counter. This means that Pokemon such as Charizard, Blastoise, Poliwhirl, Clefable, and Wigglytuff can all pose a mortal risk to Pinsir by existing. This also makes Hyper Beam use somewhat risky, as a Counter user can switch in, stomach the hit, and hit Pinsir with Counter next turn for the KO. Pinsir can use Bind to bring Counter users down to Hyper Beam range and KO them, but this isn't always mathematically probable. Using Swords Dance to bait out an early Counter and KO the following turn is also possible, but very risky, especially against paralysis users Clefable and Wigglytuff. Consequently, Pinsir teams must scout for Counter early into a game.</p> <p><strong>Gastly</strong>: While rare, Gastly completely walls Pinsir. To even damage it, Pinsir requires Seismic Toss, which it cannot afford, and the only other attack that has any effect is Bind, which doesn't damage it but allows Pinsir to pivot into a check safely. In turn, Gastly can use Hypnosis uncontested or 4HKO Pinsir with Thunderbolt.</p>",
    "sets": {
      "Swords Dance + Bind": {
        "description": "<p>Swords Dance is Pinsir's claim to fame, allowing it to rapidly chip down teams with Bind before blasting them away with Hyper Beam. Swords Dance also ensures paralysis doesn't immediately ruin Pinsir, allowing it to reapply a foe's paralysis Speed drop and keep the momentum in its favor. For example, against a paralyzed Mr. Mime—a common sight after Mr. Mime have a mirror match—Pinsir can enter and set up, remaining faster despite Thunder Wave, and OHKO Mr. Mime with Hyper Beam the next turn. Pinsir's third moveslot is flexible; Slash provides immediate power for safer revenge killing than Hyper Beam, while the weaker Body Slam makes Pinsir more self-sufficient, spreading paralysis and being boosted by Swords Dance. Body Slam also strongly deters Fire Spin users such as Ninetales and Charizard, which otherwise switch in on Pinsir easily. Finally, Submission OHKOes Porygon and 2HKOes Kabutops and Golem at +2, which Pinsir otherwise struggles to break through, although the steep drop in consistency is a pain for it to deal with.</p> <p>Pinsir functions best late-game when it's not at risk of being paralyzed during its sweep. It's also strongly recommended to paralyze Fire-types like Charizard, Ninetales, and Moltres with teammates like Mr. Mime and Clefable; otherwise, Pinsir is easily revenge killed. Kabutops checks Charizard and can KO it outright while quadruply resisting Fire Spin, and it forms a strong physical attacking core with Pinsir that has decent defensive integrity. If not running Submission, Golem and Kabutops should also be removed, with Water-types like Blastoise being great against the former, as Pinsir has issues breaking through them. Pinsir can find switch-in opportunities against Rest users like Blastoise with Rest giving free turns for Pinsir to set up. Outside of this, Pinsir is a great switch-in to Earthquake from the likes of Pokemon like Nidoking; in this case, it can Speed tie Nidoking and either deal serious damage with Slash or gain momentum with Bind. Pinsir works well with fellow wrappers such as Charizard, sometimes alongside other Fire-types like Ninetales, as Pinsir can threaten Golem with Submission while having a wrapping move itself and a Ground resistance for pivoting.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 236353, "username": "Plague von Karma"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 231074, "username": "S1nn0hC0nfirm3d"}, {"user_id": 520967, "username": "pac"}, {"user_id": 530877, "username": "Volk"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}]}
  },
  "Porygon": {"sets": {"Standard": {}, "Conversion": {}}},
  "Kabutops": {
    "outdated": true,
    "overview": "<p>Kabutops serves as a powerful physical attacker and defensive check to Fire-types in RBY NU. Its Slash deals heavy damage to most foes, 3HKOing all but the bulkiest Pokemon and notably 2HKOing Mr. Mime. The few that resist it, like Golem, cannot handle STAB Surf, making it very difficult to check Kabutops once it finds entry. Kabutops completely shrugs off burn with Slash, making it by far the most reliable answer to Moltres and Ninetales as well as a tenuous Charizard check. It can also sweep; Swords Dance allows Kabutops to tear through most foes, and it can even set up in front of certain threats, like Blastoise and Moltres. Compared to the other Water-type Swords Dance user, Kingler, Kabutops has less raw power but more switch-in opportunities; its partial Rock typing allows it to catch an opposing Hyper Beam or Explosion and gives it a 4x resistance to Fire, allowing it to effortlessly blockade Moltres and Ninetales. It's also slightly faster, outspeeding Blastoise. In exchange, it loses some defensive utility against Water-types and has difficulty checking Golem, as it cannot switch in safely.</p> <p>However, Kabutops is a weaker Charizard check than any other Water-type due to its Earthquake weakness; Charizard comes just short of 2HKOing it, so even slight chip allows Charizard to win. Kabutops is just barely too slow to beat threats like Nidoking and Seadra, which win one-on-one thanks to Kabutops's Rock typing. This is also a problem against the slower Kingler, which can 2HKO it with Crabhammer. As with other Water-types, Kabutops piles onto a team's Electrode weakness and takes up the team slot usually reserved for a Ground-type. As the metagame has shifted away from Fire Spin, and threats like Moltres and Ninetales have fallen off, Kabutops has struggled to maintain the dominance it once had, but it is still a fearsome mid-game attacker that is difficult to answer when given the first strike.</p>",
    "comments": "<h4>Other Options</h4> <p>Body Slam deals less immediate damage than Slash, but it hits harder after a boost or can be used to fish for paralysis against switch-ins. This is usually less useful than the immediate damage from Slash on most teams, but Water-type spam teams can benefit from it spreading paralysis for allies like Kingler and Seadra. This also lets Kabutops fish for a lucky paralysis in unwinnable endgames against a Mr. Mime or Charizard. Hydro Pump has a solid chance to 2HKO Moltres, but this is unnecessary, since Moltres struggles against Kabutops regardless. Kabutops often does not get a chance to set up with Swords Dance, however, so it can be dropped to have Hydro Pump for rare cases where the extra damage secures a KO on foes like Charizard and Nidoking. Rest can be used to eternally wall Fire-types aside from Charizard, but this is incredibly exploitable by opposing Swords Dance users as well as attackers like Nidoking and Mr. Mime. Blizzard 2HKOes Exeggcute and Fearow, but this is usually a non-issue; Exeggcute is 3HKOed by Slash, making it risky for it to switch in, and Fearow is walled by Kabutops anyway. As with Hydro Pump, this is best substituted over Swords Dance if used. Toxic can be used to prevent Fire Spin shenanigans, since Kabutops can take Fire Spin repeatedly until the foe misses, but this is usually overkill compared to simply hitting them with Surf.</p> <h4>Checks and Counters</h4> <p><strong>Fast Attackers</strong>: Mr. Mime and Electrode outspeed and 2HKO Kabutops, and their high critical hit rates are an additional headache. Nidoking and Seadra also outspeed it; these matchups are mutual 2HKOs and 3HKOs, respectively. Raticate loses one-on-one most times but can fish for a critical hit with Thunderbolt; the odds are relatively high, and even if it fails, it will inflict heavy damage. However, all of these checks have difficulty switching in, as Slash 2HKOes or 3HKOes them all.</p> <p><strong>Venomoth</strong>: Venomoth can easily put a stop to any shenanigans with Sleep Powder, and it can switch in relatively safely if Kabutops comes in early-game. Slash does have a small chance to 2HKO Venomoth, so Kabutops can occasionally get away with a Slash + Hyper Beam combination should Venomoth miss with Sleep Powder.</p> <p><strong>Clefable</strong>: Clefable, while slower, is bulky enough to paralyze Kabutops and finish it off with Thunderbolt. This is a relatively wasteful use of it, however, so it's a last resort.</p> <p><strong>Kingler</strong>: Kingler's Crabhammer 2HKOes Kabutops, and it only 3HKOes in return with Slash. However, Kingler cannot switch in and win, and it may give Kabutops a free setup opportunity. Crabhammer can also miss, immediately losing the matchup.</p> <p><strong>Charizard</strong>: Charizard's Earthquake comes just short of 2HKOing Kabutops, which means Charizard actually has several paths to win and can even potentially set up in front of Kabutops. A critical hit guarantees the 2HKO on Kabutops, as does slight chip damage; any stray hit from Charizard's allies will do it, as will two Fire Blasts. Charizard also wins if it uses Swords Dance or Earthquake as Kabutops switches in; should Kabutops switch into a Swords Dance, Charizard can use it again, take a hit, and then OHKO Kabutops, potentially sweeping afterward, as very little can survive a +4 Hyper Beam.</p>",
    "sets": {
      "Swords Dance": {
        "description": "<p>Slash 2HKOes frail foes like Mr. Mime and Raticate and 3HKOing everything else of note. Swords Dance and Hyper Beam give it a stronger option to sweep late-game; at +2, Kabutops OHKOes the aforementioned Pokemon and has decent odds to OHKO Venomoth and Electrode, so it can become quite the threat if given a free turn. +2 Hyper Beam also deals massive damage to Clefable, Blastoise, and Kingler, allowing Kabutops to soften these threats for teammates before going down or outright KO them if chipped. Surf mostly serves to cover Golem, Nidoking, and opposing Kabutops, but it also matters against Charizard, as Slash is only a 3HKO.</p> <p>Kabutops functions best as a mid-game wallbreaker or late-game sweeper. As a wallbreaker, Kabutops looks to find entry against slower foes and either tear through them with Slash or set up with Swords Dance and deal as much damage as possible before going down. It excels in this role against paralyzed Mr. Mime and Raticate, especially if they're chipped heavily, and it can also trade hits with Blastoise. Moltres and Ninetales are ideal entry points, of course, and Kabutops may also be able to riskily enter against Charizard; it also can switch into a predicted Hyper Beam from Charizard, Clefable, or Raticate and punish them heavily. Once in, Kabutops exploits the fact that switching into its Slash is nearly impossible; only opposing Kabutops and the incredibly rare Gastly can switch in well, as physically bulky Pokemon like Clefable and Kingler cannot win one-on-one if they take a hit on entry. Exeggcute can switch in once and attempt to paralyze it or put it to sleep, but it's 3HKOed even if it switches into Surf, so a single miss leaves it in severe peril.</p> <p>As a late-game sweeper, Kabutops looks for endgames in which it can set up Swords Dance and cleave through the enemy team with Hyper Beam. This usually requires faster foes like Charizard, Mr. Mime, and Nidoking to be chipped or paralyzed; once this happens, Kabutops merely needs a chance to set up without getting paralyzed. This is often difficult to achieve, as Kabutops's best setup targets tend to trade hits and get KOed early- or mid-game. Thus, it may choose to skip setting up even late-game and just attack with Slash or Surf to try to close out a game. Kabutops should be played more defensively if the opponent reveals a Moltres, Ninetales, or Fire Spin Charizard, as it freely enters against both Fire Blast and Fire Spin. However, it can be worn down over time, especially if the foe connects with Fire Spin to freely escape.</p> <p>Kabutops typically fits as the sixth Pokemon on a \"Big 5\" team—that is, Clefable, Mr. Mime, Blastoise, Charizard, and Venomoth—but it can also be used as part of a \"Water-type spam\" core, with Seadra or Kingler substituting for Charizard, or on structures using a Ground-type over Charizard to provide support against Electrode. As part of a \"Big 5\" team, it benefits from paralysis spread by Venomoth, Mr. Mime, and Clefable, all of which can also soften up foes for Kabutops to later sweep through. Seadra appreciates Kabutops's ability to remove Blastoise for it, opening the way for an Agility sweep. Ground-types easily switch into Thunderbolts and Thunder Waves aimed at Kabutops. Pinsir is a rare but interesting option, as Pinsir's Earthquake resistance covers for Kabutops, which easily switches into Fire Blast for Pinsir. However, this structure is extremely vulnerable to Charizard, especially if it simply uses Swords Dance in front of Pinsir.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 583793, "username": "Sabelette"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 520967, "username": "pac"}, {"user_id": 233818, "username": "Enigami"}, {"user_id": 375193, "username": "MrSoup"}, {"user_id": 593847, "username": "nicole7735"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}, {"user_id": 384270, "username": "autumn"}]}]}
  },
  "Aerodactyl": {"sets": {"Offensive": {}, "Defensive": {}}},
  "Moltres": {
    "outdated": true,
    "overview": "<p>Moltres is a fearsome threat in RBY NU, with significant bulk, the tier's most powerful special attack in Fire Blast, and a decent Speed tier that ties Mr. Mime, Poliwhirl, and Venomoth. Moltres 2HKOes notable threats such as Mr. Mime and Nidoking, OHKOes Venomoth 74% of the time, and OHKOes Exeggcute, and it deals a significant chunk to most resistant switch-ins such as Golem and Water-types—barring Kabutops—while threatening to burn them. Fire Spin allows Moltres to chip down and pivot around its checks, Hyper Beam finishes off Fire-resistant threats, and various utility moves such as Reflect, Toxic, and Agility enable it to take on different roles, walling certain threats or sweeping late-game. Defensively, it brings Earthquake immunity and enough bulk to avoid a 3HKO from neutral attacks; even Charizard's Slash is a 4HKO, leaving Swords Dance-less sets unable to break Moltres.</p> <p>Despite its legendary status, Moltres suffers from the ubiquity of the pedestrian Fire / Flying type in Charizard, which can set up on standard Moltres freely. It's also hindered by the prevalence of teams stacking Fire- and Water-types, which leave it with few opportunities to truly unleash its Fire Blast. Fire / Flying is a flawed type combination, suffering greatly against Rock Slide and carrying common weakness; even if Moltres often avoids 2HKOs from Blizzard, Thunderbolt, and Surf, it'd rather not be weak to them at all. Fire Blast and Hyper Beam are Moltres's only real, strong attack options; both are just inaccurate enough to make it inconsistent and punishable. Utilizing Moltres means running a second Fire / Flying type alongside Charizard in a metagame full of Water- and Rock-types, and one where super effective moves abound. Despite this, its sheer stat total gives it a place on many teams as a terrifying damage dealer, bulky roadblock, or endgame sweeper.</p>",
    "comments": "<h4>Other Options</h4> <p>Moltres generally lacks other move options. Although Fire Blast can't be dropped, one can combine its other moves in varying ways to meet different threats, such as running Hyper Beam on a Rest set. Double-Edge is an option, providing far more PP than Fire Blast or Hyper Beam, but fails to outdamage Fire Blast even on Fire-resistant targets, while Sky Attack's charge time is easy to maneuver around.</p> <h4>Checks and Counters</h4> <p><strong>Charizard</strong>: Charizard outspeeds Moltres and sets up Swords Dance freely, taking little from Fire Blast or Hyper Beam while 4HKOing with Slash or boosting up and KOing with +6 Hyper Beam. Moltres has counterplay in the form of Toxic + Reflect, which allows it to tank any Charizard set. Toxic whittles Charizard down, but running Toxic sacrifices valuable utility elsewhere and renders Charizard immune to paralysis, allowing it to simply switch out and return later.</p> <p><strong>Kabutops</strong>: Fire Blast might as well be Ember to Kabutops, and it resists Hyper Beam too, rendering Moltres entirely ineffective. It threatens to set up Swords Dance or retaliate with a number of 3HKO options, including Surf, Blizzard, Slash, and Hyper Beam, and it essentially ignores burn. While Moltres outspeeds it and can use Fire Spin to pivot out, a miss will be punished to the tune of 30-40% of Moltres's HP.</p> <p><strong>Golem</strong>: Golem takes Fire Blast easily, only having a 14% chance to be 3HKOed, and threatens to OHKO in return with Rock Slide 92% of the time. However, a burn significantly hampers Golem, so it must carefully consider the risk, especially if other options such as Water-types are available. If Moltres manages to apply burn, it can even freely set up Agility to reapply the burn Attack drop, making Golem's Rock Slide barely 4HKO.</p> <p><strong>Bulky Water-types</strong>: Blastoise takes Fire Blast well; Moltres needs to land three Fire Blasts and Hyper Beam to 4HKO, potentially missing in the process, while Blastoise is able to 3HKO with Surf. Less specially bulky options like Seadra and Kingler can check Moltres in a pinch, being 4HKOed and 3HKOed by Fire Blast while 2HKOing with their STAB options in return. However, they want to come in against a weakened Moltres due to their lower Speed and relative frailty. Poliwhirl takes quite a bit from Fire Blast normally, being 3HKOed like most other Water-types, but threatens the moves Hypnosis and Amnesia; this allows it to barricade Moltres almost as well as Kabutops while threatening significantly more damage in return, dealing minimum 77% with Hydro Pump at +2. Moltres gains little from winning the Speed tie.</p> <p><strong>Paralysis</strong>: A paralyzed Moltres becomes much easier to handle, outsped by its checks and less likely to land already inconsistent moves such as Fire Blast. Paralysis also creates many revenge killers such as Nidoking, Clefable, and Mr. Mime. While Moltres often runs Agility and can counteract the Speed loss, this does not prevent full paralysis from inhibiting its reliability.</p> <p><strong>Arcanine</strong>: While uncommon in the modern metagame, Arcanine is uniquely able to wall Moltres. Not only does it outrun Moltres, but it also shrugs off any move and can retaliate with Body Slam and Hyper Beam, targeting Moltres's weaker Defense and threatening paralysis. However, Rest Moltres sets can engage in a stall war with Arcanine, and Toxic sets often win in the long term as well.</p>",
    "sets": {
      "Offensive": {
        "description": "<h5>Set Description</h5> <p>This set leans on Moltres's huge damage output. Because NU tends to be fast-paced and lacking in recovery, nothing but Kabutops switches fearlessly into Fire Blast. A single hit leaves a number of foes in precarious positions. It puts Mr. Mime in KO range for Charizard's Hyper Beam and usually its Fire Blast, leaves Golem unable to safely switch into Charizard's Earthquake or Mr. Mime's Psychic, and leaves Poliwhirl in range of Mr. Mime's Thunderbolt, to name a few examples. Hyper Beam lets Moltres finish off Water-types after repeatedly taking Fire Blast, notably dealing 42% minimum to Poliwhirl and 35% minimum to Seadra; this damage can add consistency in securing KOs and allows a 3HKO on Seadra if Fire Blast burns. Fire Spin lets Moltres pivot out of threats such as Golem and Water-types and can provide crucial chip damage on a foe that is just out of Fire Blast range.</p> <p>The final moveslot allows Moltres to either threaten a sweep and shrug off paralysis via Agility, or create a headache for Charizard with Toxic; it can use Toxic plus Fire Spin to force Charizard to switch out rather than setting up, though this combination has dubious accuracy. Agility Moltres can also easily be saved for a late-game sweep, with teammates removing threats that can trade with or beat Moltres such as Water-types and Charizard. Then, Moltres can set up and potentially end the game, utilizing Fire Spin if necessary to earn crucial chip damage, though this is always risky.</p> <p>Moltres benefits from teammates that can cover its weaknesses; Blastoise matches up well against Fire- and Water-types, and Golem comes in on Fire-types that would otherwise exploit Moltres's poor coverage. Electrode is an offbeat option to exploit Water-types but leaves the team especially Golem-weak. Moltres also benefits from Mr. Mime and Clefable, which should be on every team, as both can typically remove key threats such as themselves or Kabutops.</p>"
      },
      "Defensive": {
        "description": "<h5>Set Description</h5> <p>Defensive Moltres can annoy and weaken various threats that handle its offensive set well. Toxic wears down foes hoping to set up such as Charizard and Kabutops, especially in combination with Fire Spin, which wastes their turns as Toxic damage ramps up. However, remember that Toxic has 84.4% accuracy and Fire Spin has a horrid 69.5% accuracy, and this fast-paced metagame heavily punishes misses. Even without Toxic, Fire Spin still allows Moltres to harass burned foes or pivot out of threats. If running Toxic, Reflect is an option to stall out Charizard; Slash is only a 4HKO, and Hyper Beam does not 2HKO until Charizard boosts to +6. This means that Charizard has to spend several turns setting up followed by several turns to KO, usually forcing Charizard to switch out instead. This does not work against Kabutops, as Surf is a guaranteed 3HKO. Reflect additionally has utility in slowing down Nidoking and Raticate if set up in advance, though Nidoking can still 3HKO with Blizzard and Raticate can break through with Super Fang and critical hit Body Slam or Hyper Beam. Rest, of course, provides Moltres with recovery, though it is hard to wake Moltres up against most of the tier; it can attempt to do so against Charizard without Swords Dance, Clefable without Blizzard, Venomoth, Moltres, and the occasional Ninetales and Porygon, and it can switch in on Charizard's Earthquake, Fire Spin, and various Thunder Wave users.</p> <p>Moltres can enable double switches to catch foes as they attempt to switch into its Rest, getting Kabutops or Blastoise against Golem or Charizard. Reflect sets additionally benefit from setting up a Moltres versus Charizard endgame, surprising the opponent with an unexpectedly bulky Moltres as Toxic racks up damage; to this end, allies that are effective at trading one-for-one such as Nidoking, Golem, and Blastoise are beneficial.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 583793, "username": "Sabelette"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 96315, "username": "phoopes"}, {"user_id": 236353, "username": "Plague von Karma"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}, {"user_id": 331519, "username": "CryoGyro"}]}]}
  },
  "Dragonair": {
    "outdated": true,
    "overview": "<p>Dragonair is a niche threat in NU buoyed by a single, oft-maligned move: Wrap. Combined with Agility and Thunder Wave, Dragonair has the speed control necessary to spam Wrap, wearing down an entire team for allies like Charizard, Mr. Mime, and Raticate to finish off. It can also use Wrap to bully the opponent into accepting paralysis on more Pokemon, chipping down paralyzed foes that try to block Thunder Wave. It supplements this with excellent coverage to finish off weakened foes if they switch in as Wrap misses, forcing the opponent to accept a KO or switch into moves like Blizzard and Thunderbolt. While Dragonair is relatively frail, it does have an excellent defensive typing. It resists the tier's many Fire-, Water, and Electric-type attacks, and only Clefable, Nidoking, and Seadra typically run Ice-type coverage, though Blastoise sometimes does as well.</p> <p>Dragonair is, however, held back by its relatively poor Speed, need for a setup turn to paralyze the foe or use Agility, and Wrap's tenuous accuracy. Its Speed falls short of threats like Nidoking and Seadra, which both run Blizzard and can 2HKO it; additionally, if not using Agility, Dragonair is incapable of outspeeding Nidoking to use Wrap on it without paralysis support from allies. Opposing paralysis spreaders like Mr. Mime and Venomoth outspeed Dragonair, and Dragonair is also slower than Kingler and Blastoise, which can attempt to paralyze it with Body Slam, as well as Kabutops, which can deal huge damage with Slash. Dragonair has difficulty finding a setup turn for Agility, often relying on dodging Body Slam paralysis or accepting heavy damage and a chance for a critical hit from Blizzard users to set up, leaving it in OHKO range should it miss a single Wrap. Paralysis is also terrible for Dragonair even if it uses Agility, as this reduces Wrap's already shaky success rate to a downright awful 63.75%, ensuring it will fall shortly after. At its best, Dragonair can spread paralysis to multiple foes or chip the opposing team for massive damage, allowing allies to clean up, but it needs to dodge a lot of bad luck to contribute adequately.</p>",
    "sets": {
      "Wrap": {
        "description": "<p>Wrap is essential for Dragonair to control the enemy team, forcing paralyzed foes, as well as Clefable and Exeggcute out to avoid retaliation. If using Thunder Wave, Wrap allows Dragonair to force the opponent to send in an unparalyzed Pokemon, giving Dragonair the option to chip it, paralyze it, or pivot to an ally safely. With Agility, Wrap becomes the ultimate chip-spreading tool, forcing the opponent to hope for Wrap to miss at the right time to punish with paralysis or Blizzard. Dragonair's last two moves are typically Blizzard and Thunderbolt to provide coverage, allowing it to finish off chipped foes or exploit Wrap misses against targets at low HP; Blizzard ensures it can hit Golem and Nidoking, while Thunderbolt hits Water-types and particularly Kabutops, which otherwise can absorb Wrap well. However, other options are possible, such as Hyper Beam to more effectively finish off neutral targets, such as Mr. Mime, Clefable, and Venomoth, or using Agility and Thunder Wave in tandem, giving Dragonair flexibility in its speed control at the cost of coverage.</p> <p>Dragonair benefits from teammates that can spread status, like Mr. Mime, Clefable, and Venomoth, as these allow it to use Wrap without any setup. Venomoth is especially notable, since Sleep Powder provides a safe switch-in for Dragonair, and the opponent may not immediately switch after taking sleep due to fear of Stun Spore. This allows Dragonair to fish for Thunder Wave on an incoming foe or simply set up Agility and begin accruing chip damage. Electrode can help to spread paralysis and create an opening with Explosion, or it can clean up after Dragonair, but using both creates a large weakness to Nidoking. Dragonair's chip damage is ideal for allowing fast allies like Charizard, Raticate, and Nidoking to clean; Charizard falls just short of KOing many foes with +2 Hyper Beam, and Wrap easily bridges that gap, whereas Raticate needs no setup to repeatedly fire off a powerful STAB Hyper Beam, taking out many foes from about 50% of their HP. Nidoking lacks the power of the other two options but makes up for it in excellent coverage, tearing through weakened and paralyzed teams easily.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 583793, "username": "Sabelette"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 530877, "username": "Volk"}, {"user_id": 375193, "username": "MrSoup"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}, {"user_id": 384270, "username": "autumn"}]}]}
  }
}