{
  "Sandslash": {"sets": [{"name": "Swords Dance"}]},
  "Nidoqueen": {"sets": [{"name": "Mixed Attacker"}]},
  "Rapidash": {"sets": [{"name": "Fire Spin Pivot"}]},
  "Gastly": {
    "overview": "<p>Gastly holds a niche in PU as the second fastest sleeper in the tier, only behind the niche Poliwag. Gastly remains threatening even after using Hypnosis thanks to its high Special and combination of Psychic + Thunderbolt, which has perfect coverage and hits top threats such as Fearow and Nidoqueen super effectively. These traits make Gastly a fantastic lead, since it can put most opposing leads to sleep and then threaten switch-ins with powerful attacks. Gastly can also switch into Normal-type moves, such as Rapidash's Hyper Beam and most of Pinsir's attacks, without taking damage, something no other Pokemon in the tier can do. However, despite its unique defensive utility, Gastly's defensive profile is quite poor due to its stats and Poison typing. Its terrible physical bulk allows most neutral physical attacks such as Fearow's Drill Peck to 2HKO it, while Gastly's low HP leaves it very vulnerable to fixed-damage moves such as Pinsir's Seismic Toss. Additionally, its terrible Ground- and Psychic-type weaknesses leave it OHKOed and 2HKOed, respectively, by every common Earthquake and Psychic in the tier. These issues are compounded by Gastly's reliance on the inaccurate Hypnosis, as a miss could mean Gastly faints without doing anything.</p> ",
    "comments": "<h1>Other Options</h1> <p>Night Shade and Explosion can be used together by dropping Psychic or Thunderbolt, though this leaves Gastly with difficulty threatening either Nidoqueen and Machamp or Water-types and Fearow. Mega Drain 2HKOes Graveler, though Gastly still loses the one-on-one. Confuse Ray can be used in conjunction with paralysis support to let Gastly defeat foes it otherwise can't, such as Drowzee.</p> <h1>Checks and Counters</h1> <p><strong>Psychic-types: Both Abra and Drowzee can 2HKO Gastly with Psychic or ruin it with Thunder Wave. The former outspeeds Gastly and is only 3HKOed by Night Shade, while the latter is only 4HKOed. However, both must watch out for Explosion, which OHKOes Abra and does a minimum of 67% to Drowzee. Due to it being outsped, Drowzee must be wary of Hypnosis.</p> <p><strong>Faster Attackers: Fearow, Rapidash, Arcanine, and Pinsir all outspeed Gastly. Fearow 2HKOes Gastly and is only 2HKOed back by Thunderbolt, while Rapidash, Arcanine, and Pinsir 3HKO Gastly and are only 4HKOed by Night Shade. Rapidash can also use Fire Spin to chip Gastly into KO range, and both Fire Spin and Pinsir's Bind can be used to pivot around Gastly. However, Rapidash and Pinsir must be wary of Hypnosis, as they often give Gastly numerous opportunities to try to put them to sleep.</p> <p><strong>Earthquake Users: Even if Gastly can hit them super effectively, Pokemon such as Nidoqueen, Machamp, and Graveler can easily tank a hit and OHKO Gastly in return with Earthquake. However, there is no Earthquake user in PU that is faster than Gastly, so they must be wary of Hypnosis.</p> ",
    "sets": [
      {
        "name": "Sleeper",
        "description": "<h1>Set Description</h1> <p>Hypnosis is Gastly's primary draw, making it an effective sleeper thanks to its good Speed. Psychic hits Fighting- and Poison-types such as Machamp and Nidoqueen super effectively, and its high chance to drop the target's Special makes it Gastly's most spammable attack. Thunderbolt deals super effective damage to Fearow and Water-types, such as Staryu and Seaking. Night Shade is a good midground option because many of Gastly's switch-ins have low base HP, and it's Gastly's strongest attack against Abra and Drowzee barring Explosion. Alternatively, Explosion lets Gastly sacrifice itself to OHKO Abra or deal at least 67% to Drowzee, though it has minimal use against most other threats besides automatically ending the turn due to Gastly's abysmal base 35 Attack.</p> <p>Gastly tends to get overwhelmed by faster threats, so it appreciates partners that can switch into them. Omanyte and Graveler check Rapidash, Fearow, and Arcanine, while Drowzee can handle Abra. Gastly is also checked by Graveler and Drowzee and thus enjoys the support of wallbreakers such as Seaking and Pinsir. Gastly's combination of high Special and immunity to Body Slam makes it the best switch-in to Omanyte, making it a great partner to Rapidash and Fearow.</p> <p>Gastly can be used as a lead, as no Pokemon can both outspeed and reliably OHKO it, almost always giving it at least one opportunity to use Hypnosis. However, given Hypnosis's poor accuracy, it prefers to switch out against leads that can outspeed and 2HKO it, such as Fearow and Abra. Gastly can also be used in the back to pivot into common Normal-type attacks such as Rapidash's Hyper Beam and Pinsir's Slash thanks to its Ghost typing. Once on the field, it can attempt to put its target to sleep with Hypnosis or pick it off if it's weakened. Gastly's typing also lets it absorb Explosions.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 540559, "username": "Gastlies"}, {"user_id": 583793, "username": "Sabelette"}]}, {"name": "Grammar checked by", "members": [{"user_id": 583793, "username": "Sabelette"}, {"user_id": 168392, "username": "P Squared"}]}], "writtenBy": [{"user_id": 535530, "username": "Gangsta Spongebob"}]}
  },
  "Drowzee": {"sets": [{"name": "Bulky Support"}]},
  "Seaking": {
    "overview": "<p>Seaking’s high attacking stats and access to STAB Surf make it one of the most fearsome mixed attackers in the tier. It can function as a mid-game wallbreaker as well as use Agility to become a deadly late-game cleaner. Seaking's bulk is also fantastic; it can comfortably avoid 2HKOs from Nidoqueen, Pinsir, and Fearow. Seaking’s Water typing gives it very few weaknesses, only really having to worry about non-STAB Thunderbolt from Nidoqueen, Dragonair, Staryu, and Gastly. However, Seaking is almost completely walled by an unparalyzed Staryu, which resists Surf, can paralyze Seaking with Thunder Wave, and can use Recover to heal off the damage from Seaking’s Normal-type moves while wearing it down. Although Staryu doesn't outclass Seaking, which still boasts better attacking stats and bulk, it is generally seen as the preferred Water-type thanks to its higher Speed and better movepool. Seaking is quite slow, requiring Agility to outspeed key threats such as Nidoqueen, Rapidash, Pinsir, and Fearow, while Staryu outspeeds Nidoqueen naturally. Although Seaking is bulky, it lacks reliable recovery, meaning it can be overwhelmed by the strong physical attackers in the tier. Despite these weaknesses, Seaking is still a formidable Pokemon, and its fearsome offensive presence should not be ignored when building a team.</p> ",
    "comments": "<h1>Other Options</h1> <p>Blizzard is able to secure a 2HKO on Fearow, Dragonair, and the rare Grass-types, which Seaking’s standard set is unable to do. However Surf hits everything else harder, and Blizzard generally isn't preferred over Seaking's Normal-type moves. The remainder of Seaking's options are much more niche. Rest is an option to give Seaking longevity, but the offensive nature of the tier makes it very difficult for Seaking to find an opportunity to wake up, and Staryu’s access to Recover makes it a much better Water-type for this role. Tail Whip and Mimic can be used as anti-Staryu options. Two Tail Whips get Staryu into Hyper Beam OHKO range, and Mimic can potentially copy Thunder Wave, Recover, or a coverage move from Staryu. However, both of these options are inconsistent and are generally not recommended.</p> <h1>Checks and Counters</h1> <p><strong>Staryu: Staryu is without a doubt Seaking’s biggest counter. An unparalyzed Staryu can switch into Seaking then use Recover until it KOes itself from Double-Edge recoil. If Seaking uses Hyper Beam or Agility, Staryu can then paralyze it safely and continue to use Recover until it fully paralyzes.</p> <p><strong>Dragonair</strong>: Seaking without Blizzard is helpless against Dragonair, and even if Seaking is running Blizzard it’s still outsped and can be wrapped. Dragonair is also one of the few Thunderbolt users in the tier, which Seaking does not appreciate.</p> <p><strong>Fearow and Pinsir:</strong> Although neither can switch into Seaking, Pinsir and Fearow both beat Seaking one-on-one; Fearow does, however, usually lose against Blizzard Seaking. Even if they lose the one-on-one fight, they’ll have chipped Seaking enough that something else can revenge kill it.</p> <p><strong>Opposing Seaking</strong>: Seaking is able to switch into itself well, and the face-off will typically result in the winning Seaking being at low enough HP that something can revenge kill it, although it will probably be able to fire off one more attack before being KOed if it set up Agility.</p> <p><strong>Slowpoke</strong>: Although rare, Slowpoke is able to switch into Seaking and paralyze it, which generally forces it out. Slowpoke is also able to hit it neutrally with Psychic and reapply the paralysis Speed drop with Amnesia.</p> <p><strong>Vileplume and Weepinbell:</strong> The rare Vileplume and Weepinbell are able to switch into a Seaking lacking Blizzard and inflict it with either paralysis or sleep. Weepinbell also has Razor Leaf, which 2HKOes Seaking.</p> ",
    "sets": [
      {
        "name": "Agility",
        "description": "<h1>Set Description</h1> <p>Surf is Seaking’s strongest move and can 3HKO almost every non-resistant Pokemon in the tier. Surf importantly 2HKOes Nidoqueen, the best Pokemon in the tier, and it also puts nearly every Pokemon into KO range for either Fearow’s Hyper Beam or Drill Peck; the few exceptions such as Pinsir and Machamp are not good switch-ins to Seaking. Double-Edge comes off a respectable base 92 Attack stat, and it gives Seaking perfect neutral coverage along with doing more damage than Surf against physically frail Pokemon, such as Abra and Drowzee. Hyper Beam lets Seaking finish off foes, impressively KOing Drowzee from 49.5% and Staryu from 55.1%. Agility gives Seaking a form of speed control, allowing it to outspeed faster threats such as Nidoqueen and Rapidash, and it lets Seaking clean up a weakened team late-game.</p> <p>Seaking’s best teammate is Fearow, since Seaking is able to punish Fearow’s two biggest checks—Graveler and Omanyte—with a strong Surf. In return, Fearow heavily threatens Staryu, outspeeding it and 2HKOing with Double-Edge or OHKOing with Hyper Beam after the slightest bit of chip damage. Pinsir also appreciates Seaking breaking through the Rock-types, which enables it to wreak havoc with Slash. Seaking is also able to check Rapidash, a Pokemon that Pinsir heavily struggles against. Ironically, Staryu is also a great teammate for Seaking, since it can trade paralysis with opposing Staryu and potentially chip it to make it easier for Seaking to deal with. Dragonair is a notable teammate that can switch into opposing Thunderbolt as well as spread paralysis, easing the burden of Seaking’s low Speed. Lastly, Graveler is a great teammate for Seaking to fall back on if it’s being overwhelmed by Fearow and Pinsir, while Seaking can help Graveler fend off Rapidash.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 583473, "username": "Adamxer"}, {"user_id": 593464, "username": "TehTayTeh"}]}, {"name": "Grammar checked by", "members": [{"user_id": 583473, "username": "Adamxer"}, {"user_id": 384270, "username": "autumn"}]}], "writtenBy": [{"user_id": 540559, "username": "Gastlies"}]}
  },
  "Omanyte": {
    "overview": "<p>Omanyte's combination of solid bulk and a Rock / Water typing perfectly counters Rapidash and Arcanine, denying them meaningful progress, and also makes it an effective switch-in to Fearow. As Rapidash and Fearow are incredibly common offensive threats, Omanyte will almost always have several opportunities to stop a powerful progress-maker in its tracks and then make its own progress. Few Pokemon enjoy switching into Omanyte's decently powerful Surf and Blizzard or risking Body Slam paralysis. However, Omanyte's offensive presence has flaws, as choosing the wrong move for its switch-in—such as Surf for Seaking or Body Slam for Gastly—leaves it in a bad position. Omanyte's terrible Speed makes it loses the one-on-one to a variety of metagame threats, such as Nidoqueen and Drowzee, which can force a powerful attack or status condition on one of Omanyte's teammate as it's forced out. Omanyte's low HP also leaves it extremely vulnerable to fixed-damage moves, which 3HKO it. Additionally, its switch-ins are very predictable, making it exploitable with double switching. Pokemon checked by Omanyte have ways to mitigate its effectiveness, as Fearow's sheer power and critical hit rate can quickly wear it down, while Rapidash can use Fire Spin to switch out if its team lacks a decent Omanyte switch-in. Effective use of Omanyte requires a team that can handle its shortcomings and careful management of its HP, but when played optimally, it can turn dangerous offensive threats into non-issues.</p> ",
    "comments": "<h1>Other Options</h1> <p>Hydro Pump is much stronger than Surf, notably having around a 47% chance to 2HKO Gastly, a 59% chance to 2HKO Abra, an 83% chance to 2HKO opposing Omanyte, and an 85% chance to OHKO the rare Sandslash, feats Surf can never achieve without a critical hit. Hydro Pump's extra damage against Drowzee leaves it always in range of Machamp's Hyper Beam or two Seismic Tosses, and it gives Rapidash's Hyper Beam and Pinsir's Slash favorable odds to KO Drowzee as well. However, Hydro Pump's poor accuracy makes it quite unreliable, with Surf usually being preferred over its inconsistent counterpart.</p> <h1>Checks and Counters</h1> <p><strong>Water-types: While they all dislike paralysis, none of Omanyte's attacks do significant damage to any of the tier's Water-types, whereas they can easily overwhelm it with their STAB moves in return. Staryu can wall Omanyte indefinitely as a result of its access to Recover, while Seaking can set up Agility to negate the Speed drop from paralysis. The rarer Slowpoke and Poliwag can use Omanyte as setup fodder for Amnesia freely.</p> <p><strong>Gastly: Gastly is uniquely immune to Body Slam while only being 3HKOed by Surf, affording it numerous opportunities to switch in and threaten Omanyte with its higher Speed, Hypnosis, and a 2HKO with Thunderbolt.</p> <p><strong>Drowzee</strong>: Drowzee can outspeed and put Omanyte to sleep with Hypnosis and can usually win the one-on-one with Psychic if sleep isn't available.</p> <p><strong>Earthquake Users</strong>: Machamp outspeeds and 2HKOes Omanyte with Earthquake while only being 3HKOed by Surf in return. While they cannot switch in, Ground-types such as Nidoqueen and the rare Sandslash outspeed and 2HKO Omanyte with Earthquake while only being 2HKOed in return, allowing them to easily win the one-on-one or pick off a weakened Omanyte.</p> <p><strong>Grass-types: While rare and vulnerable to Blizzard, Weepinbell and Vileplume serve as effective Omanyte checks. Both outspeed it; the former OHKOes Omanyte with Razor Leaf, while the sheer bulk of the latter allows it to reliably 2HKO Omanyte with Mega Drain. Both threats can also put Omanyte to sleep with Sleep Powder.</p> ",
    "sets": [
      {
        "name": "Standard",
        "description": "<h1>Set Description</h1> <p>Surf is a decently strong attack that 3HKOes most neutral targets. Blizzard serves as coverage against Fearow, Dragonair, and the rare Grass-type such as Vileplume. Body Slam lets Omanyte fish for paralysis on all of its switch-ins barring Gastly, allowing Omanyte to still make some progress against Water-types such as Staryu and Seaking. Rest is Omanyte's only form of recovery, but it is unreliable due to the number of turns it leaves Omanyte helpless and thus is best used to secure late-game victories against Rapidash, Arcanine, and Fearow.</p> <p>Omanyte partners well with many offensive Pokemon that are outsped by Rapidash, such as Pinsir and Machamp. Ironically enough, Rapidash and Fearow also appreciate Omanyte's support, as it secures their mirror matchups and protects Fearow from opposing Rapidash. In return, these wallbreakers and sweepers can power through defensive Pokemon such as Staryu and Drowzee, which Omanyte can't break past on its own. These threats can also check foes that give Omanyte trouble, such as Machamp handling Nidoqueen and Rapidash handling Pinsir. On the defensive end, Staryu is a great partner for its ability to eternally wall Seaking, which otherwise can use Omanyte as setup fodder. Drowzee, while not as iron-clad, is capable of checking special attackers, such as Gastly, Abra, and Staryu, which give Omanyte trouble.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 593464, "username": "TehTayTeh"}, {"user_id": 583793, "username": "Sabelette"}]}, {"name": "Grammar checked by", "members": [{"user_id": 583793, "username": "Sabelette"}, {"user_id": 384270, "username": "autumn"}]}], "writtenBy": [{"user_id": 535530, "username": "Gangsta Spongebob"}]}
  },
  "Dragonair": {"sets": [{"name": "AgiliWrap"}]}
}