{
  "Pidgeot": {
    "overview": "<p>Pidgeot is completely outclassed by Fearow, as its better bulk is completely overshadowed by Fearow's higher Attack, Speed, and access to Drill Peck. Pidgeot falls into all the same pitfalls as Fearow, including a losing matchup against Rock-types, a difficult BoltBeam weakness, and a fear of paralysis. The lack of Drill Peck leaves Pidgeot with a much worse matchup against Pinsir and Gastly, which it struggles to hit. As a result, Pidgeot should never be used on any serious team.</p> ",
    "sets": [
      {
        "name": "Standard",
        "description": "<p>Double-Edge and Hyper Beam serve as powerful STAB attacks coming off of Pidgeot's high Attack, seriously threatening neutral targets such as Staryu, Drowzee, and Dragonair. Sky Attack is Pidgeot's strongest attack against Gastly; it has a 64.1% chance to OHKO, and it also does at least 78.6% to Pinsir. Agility lets Pidgeot boost its Speed and reapply paralysis, notably aiding its role as an endgame cleaner. Alternatively, Toxic lets Pidgeot weaken Rock-types. Mirror Move is also an option in the last slot, potentially letting Pidgeot copy something useful like Earthquake or Swords Dance.</p> <p>Since Pidgeot is outclassed, it can only be justified if brought alongside Fearow. They share Rock-type counters like Omanyte and Graveler, so Porygon is a useful partner. Rapidash and Arcanine also gives this duo trouble, so Omanyte works well in countering them. Given that Gastly easily switches into Pidgeot and forces it to use Sky Attack, checks to it like Drowzee and Abra are essential. Pidgeot hates being paralyzed, so it's best used either as an endgame cleaner when all opposing paralysis spreaders have been weakened or KOed or as a midgame wallbreaker willing to sacrifice itself to aid another cleaner.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Gangsta Spongebob", "user_id": 535530}], "teams": [{"name": "Quality checked by", "members": [{"username": "Sabelette", "user_id": 583793}]}, {"name": "Grammar checked by", "members": [{"username": "Sabelette", "user_id": 583793}]}]}
  },
  "Sandslash": {"sets": [{"name": "Swords Dance"}]},
  "Nidoqueen": {"sets": [{"name": "Mixed Attacker"}]},
  "Golbat": {
    "overview": "<p>Clearly winging it, Golbat doesn't have even the slightest hope of taking flight in PU. Right off the bat, outside of its above-average Speed, all of its stats are below-average to bad. It lacks any powerful attacks or utility options, usually failing to draw blood from its target. In fact, it's completely unable to sink its fangs into Gastly due to its lack of coverage. Its typing is also very subpar, leaving it battered in the face of common Ice-, Psychic-, and Electric-type attacks. While its Speed and access to Confuse Ray are quite solid, the only thing blood curdling about this vampire bat is how terrible it is.</p> ",
    "sets": [{"name": "Standard", "description": "<p>Confuse Ray can give Golbat extra turns, though it's quite unreliable. Screech is the most useful form of utility Golbat has, and it slightly abates its low attacking power. Double-Edge is Golbat's primary means of battering its opponent. Hyper Beam can be used over Screech or Double-Edge as Golbat's most powerful attack. Mega Drain lets Golbat leech health off its target but is only useful as coverage against Rock-types, such as Graveler and Omanyte. While Golbat already does about as much damage as a vampire in the sun, Gastly completely stonewalls Golbat, so checks to it such as Drowzee and Abra make good partners.</p> "}],
    "credits": {"writtenBy": [{"username": "Gangsta Spongebob", "user_id": 535530}], "teams": [{"name": "Quality checked by", "members": [{"username": "Sabelette", "user_id": 583793}]}, {"name": "Grammar checked by", "members": [{"username": "Sabelette", "user_id": 583793}]}]}
  },
  "Parasect": {
    "overview": "<p>Parasect is the only fully-evolved Pokemon in RBY with access to Spore, giving it the most consistent Double Powder combination in the game. It also has access to Swords Dance to boost its damage output with Hyper Beam, which can be effective with paralysis support from its teammates. Defensively, Parasect has resistances to Ground, Water, and Electric, meaning it can situationally switch in on Pokemon like Machamp, Seaking, and Staryu. Parasect is also generally unfazed by paralysis, making it a decent early-game status absorber. With these strengths, combined with RBY's brutal sleep mechanics, one would be forgiven for thinking Parasect can work in RBY PU.</p> <p>However, Parasect is entirely outclassed by other sleepers such as Gastly, which has some Speed to back up its Hypnosis, or Drowzee, which has a better typing. This combined with many teams choosing not to use a sleeper at all makes Parasect not worth using. In addition, Parasect's stats are all-around mediocre; its Speed is tied for the lowest among all fully evolved Pokemon. Its terrible typing also makes it very easy to OHKO. This especially applies in RBY PU, a tier filled with powerful Fire-types, such as Rapidash and Arcanine, to prey on its 4x Fire weakness, and other Pokemon like Fearow and Nidoqueen feast on its poor defensive typing as well. Unfortunately, Parasect's positive traits aren't nearly enough to give it a niche in the tier; it should not see use on any serious competitive team.</p> ",
    "sets": [
      {
        "name": "Setup Sleeper",
        "description": "<p>Parasect's game plan is simple: put something to sleep with Spore, then cripple something else with Stun Spore as soon as possible. After this, it can come back late-game when the opposing team is paralyzed and weakened and go on the offensive. Swords Dance reapplies an opposing Pokemon's Speed drop from paralysis, which helps if Parasect has been used to absorb paralysis itself. Hyper Beam is surprisingly powerful at +2, OHKOing Drowzee and Staryu; it can also KO Dragonair, Fearow, and Porygon if they have taken even slight chip damage. Body Slam is a suitable alternative to either of these moves for reliability and the ability to spread more paralysis, letting Parasect serve a more supportive role.</p> <p>If you must use Parasect, it's best used on teams that hinge on a strong late-game sweeper such as Fearow or Pinsir. Its entire existence hinges on Spore, so the move should never be dropped. While Slash may seem enticing for immediate power, it only lands a critical hit 46.88% of the time because of Parasect’s horrendous Speed, making it unviable. STAB Mega Drain lets Parasect 2HKO Omanyte and Graveler while regaining some HP, but its utility outside of this is questionable. Toxic can be used over Stun Spore to incapacitate partial trapping users such as Dragonair and Rapidash, but whether Parasect gets the opportunity to do this without being KOed or forced out the next turn is another matter.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Ctown6", "user_id": 509438}, {"username": "phoopes", "user_id": 96315}], "teams": [{"name": "Quality checked by", "members": [{"username": "Gangsta Spongebob", "user_id": 535530}]}, {"name": "Grammar checked by", "members": [{"username": "Sabelette", "user_id": 583793}]}]}
  },
  "Rapidash": {"sets": [{"name": "Fire Spin Pivot"}]},
  "Gastly": {
    "overview": "<p>Gastly holds a niche in PU as the second fastest sleeper in the tier, only behind the niche Poliwag. Gastly remains threatening even after using Hypnosis thanks to its high Special and combination of Psychic + Thunderbolt, which has perfect coverage and hits top threats such as Fearow and Nidoqueen super effectively. These traits make Gastly a fantastic lead, since it can put most opposing leads to sleep and then threaten switch-ins with powerful attacks. Gastly can also switch into Normal-type moves, such as Rapidash's Hyper Beam and most of Pinsir's attacks, without taking damage, something no other Pokemon in the tier can do. However, despite its unique defensive utility, Gastly's defensive profile is quite poor due to its stats and Poison typing. Its terrible physical bulk allows most neutral physical attacks such as Fearow's Drill Peck to 2HKO it, while Gastly's low HP leaves it very vulnerable to fixed-damage moves such as Pinsir's Seismic Toss. Additionally, its terrible Ground- and Psychic-type weaknesses leave it OHKOed and 2HKOed, respectively, by every common Earthquake and Psychic in the tier. These issues are compounded by Gastly's reliance on the inaccurate Hypnosis, as a miss could mean Gastly faints without doing anything.</p> ",
    "comments": "<h1>Other Options</h1> <p>Night Shade and Explosion can be used together by dropping Psychic or Thunderbolt, though this leaves Gastly with difficulty threatening either Nidoqueen and Machamp or Water-types and Fearow. Mega Drain 2HKOes Graveler, though Gastly still loses the one-on-one. Confuse Ray can be used in conjunction with paralysis support to let Gastly defeat foes it otherwise can't, such as Drowzee.</p> <h1>Checks and Counters</h1> <p><strong>Psychic-types: Both Abra and Drowzee can 2HKO Gastly with Psychic or ruin it with Thunder Wave. The former outspeeds Gastly and is only 3HKOed by Night Shade, while the latter is only 4HKOed. However, both must watch out for Explosion, which OHKOes Abra and does a minimum of 67% to Drowzee. Due to it being outsped, Drowzee must be wary of Hypnosis.</p> <p><strong>Faster Attackers: Fearow, Rapidash, Arcanine, and Pinsir all outspeed Gastly. Fearow 2HKOes Gastly and is only 2HKOed back by Thunderbolt, while Rapidash, Arcanine, and Pinsir 3HKO Gastly and are only 4HKOed by Night Shade. Rapidash can also use Fire Spin to chip Gastly into KO range, and both Fire Spin and Pinsir's Bind can be used to pivot around Gastly. However, Rapidash and Pinsir must be wary of Hypnosis, as they often give Gastly numerous opportunities to try to put them to sleep.</p> <p><strong>Earthquake Users: Even if Gastly can hit them super effectively, Pokemon such as Nidoqueen, Machamp, and Graveler can easily tank a hit and OHKO Gastly in return with Earthquake. However, there is no Earthquake user in PU that is faster than Gastly, so they must be wary of Hypnosis.</p> ",
    "sets": [
      {
        "name": "Sleeper",
        "description": "<h1>Set Description</h1> <p>Hypnosis is Gastly's primary draw, making it an effective sleeper thanks to its good Speed. Psychic hits Fighting- and Poison-types such as Machamp and Nidoqueen super effectively, and its high chance to drop the target's Special makes it Gastly's most spammable attack. Thunderbolt deals super effective damage to Fearow and Water-types, such as Staryu and Seaking. Night Shade is a good midground option because many of Gastly's switch-ins have low base HP, and it's Gastly's strongest attack against Abra and Drowzee barring Explosion. Alternatively, Explosion lets Gastly sacrifice itself to OHKO Abra or deal at least 67% to Drowzee, though it has minimal use against most other threats besides automatically ending the turn due to Gastly's abysmal base 35 Attack.</p> <p>Gastly tends to get overwhelmed by faster threats, so it appreciates partners that can switch into them. Omanyte and Graveler check Rapidash, Fearow, and Arcanine, while Drowzee can handle Abra. Gastly is also checked by Graveler and Drowzee and thus enjoys the support of wallbreakers such as Seaking and Pinsir. Gastly's combination of high Special and immunity to Body Slam makes it the best switch-in to Omanyte, making it a great partner to Rapidash and Fearow.</p> <p>Gastly can be used as a lead, as no Pokemon can both outspeed and reliably OHKO it, almost always giving it at least one opportunity to use Hypnosis. However, given Hypnosis's poor accuracy, it prefers to switch out against leads that can outspeed and 2HKO it, such as Fearow and Abra. Gastly can also be used in the back to pivot into common Normal-type attacks such as Rapidash's Hyper Beam and Pinsir's Slash thanks to its Ghost typing. Once on the field, it can attempt to put its target to sleep with Hypnosis or pick it off if it's weakened. Gastly's typing also lets it absorb Explosions.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Gangsta Spongebob", "user_id": 535530}], "teams": [{"name": "Quality checked by", "members": [{"username": "Gastlies", "user_id": 540559}, {"username": "Sabelette", "user_id": 583793}]}, {"name": "Grammar checked by", "members": [{"username": "Sabelette", "user_id": 583793}, {"username": "P Squared", "user_id": 168392}]}]}
  },
  "Onix": {
    "overview": "<p>At first glance, Onix's enormous base 160 Defense, Rock typing, and access to useful moves like Bind and Explosion may give the impression that it's usable. After all, it can switch in to stonewall Fearow, a top threat, and fire off attacks. However, Onix is rendered completely unviable by its terrible stats. Having an Attack stat lower than Oddish means that Onix does pitiful damage and struggles to break through anything, even targets that are weak to its STAB moves. Bind is already an unreliable option due to its terrible accuracy, but it suffers further due to Onix's mediocre Speed, which notably leaves it outsped by Nidoqueen. Onix's huge Defense is held back by its atrocious base HP and weakness to Earthquake, which makes it lose to most physical attackers regardless. Its special bulk fares even worse, as its low HP, even worse Special, and weaknesses to Water, Grass, and Ice make it lose to nearly every special attacker in the tier. Notably, Nidoqueen's Blizzard OHKOes it 97.4% of the time. While Onix does stop Fearow in its tracks, it should not be used on any serious team on account of it losing to pretty much every other relevant threat in PU.</p> ",
    "sets": [{"name": "Bind Pivot", "description": "<p>Bind lets Onix pivot out of opposing switch-ins and slower threats. Toxic pairs well with Bind in wearing down foes. Alternatively, Body Slam can be used to spread paralysis. Earthquake is Onix's primary STAB attack, though it's weak due to Onix's terrible Attack stat. Explosion lets Onix sacrifice itself to deal heavy damage to its target, but it should be used sparingly, as it still doesn't OHKO the majority of the tier, and Onix's primary goal is to stay alive to wall Fearow. Onix works best supporting Pokemon that dislike facing Fearow, such as Pinsir and Abra. Checks to Water- and Grass-types, such as Staryu and Drowzee, work well in helping Onix's with its worst matchups. Paralysis support works well to enable Onix's Bind.</p> "}],
    "credits": {"writtenBy": [{"username": "Gangsta Spongebob", "user_id": 535530}], "teams": [{"name": "Quality checked by", "members": [{"username": "Sabelette", "user_id": 583793}]}, {"name": "Grammar checked by", "members": [{"username": "Sabelette", "user_id": 583793}]}]}
  },
  "Drowzee": {"sets": [{"name": "Bulky Support"}]},
  "Marowak": {
    "overview": "<p>Marowak is completely unviable as a result of being outclassed by Sandslash, which has higher stats in everything except Defense, and even that's still equal. Marowak does have access to unique options in Fire Blast, Blizzard, and Counter, which can help against threats such as Pinsir and Fearow, but in general Sandslash's access to Swords Dance and Rock Slide is much more useful. Sandslash itself isn't even that good as a result of its mediocre Speed and special bulk, so Marowak has absolutely no hope in this tier.</p> ",
    "sets": [
      {"name": "Standard", "description": "<p>Earthquake is a decently powerful STAB attack coming off of Marowak's usable base 80 Attack. Body Slam lets Marowak spread paralysis. Blizzard has a 72.2% chance to 2HKO Fearow and can 3HKO Grass-types such as Vileplume. Fire Blast has a 99.1% chance to 2HKO Pinsir and also hits Grass-types. Counter can be used over either elemental attack to help Marowak surprise and potentially KO certain threats such as Fearow and Pinsir, as Counter tends to deal over 50% to them.</p> <p>Given that Marowak is outclassed by Sandslash, one of the only ways to justify using it as a wallbreaker is alongside Sandslash, though such teams need numerous checks to Water-types, such as Staryu and Drowzee, to not immediately fall apart. Otherwise, the only reason to use Marowak would be its slightly better Pinsir and Fearow matchups due to its unique coverage. Marowak enjoys paralysis support, as this eliminates one of its biggest issues, its awful Speed.</p> "}
    ],
    "credits": {"writtenBy": [{"username": "Gangsta Spongebob", "user_id": 535530}], "teams": [{"name": "Quality checked by", "members": [{"username": "Sabelette", "user_id": 583793}]}, {"name": "Grammar checked by", "members": [{"username": "Sabelette", "user_id": 583793}]}]}
  },
  "Hitmonlee": {
    "overview": "<p>Hitmonlee is a Pokemon that should never see the light of day in RBY PU despite a few strong points. Its base 120 Attack and the unique STAB move High Jump Kick seem appealing, as High Jump Kick 2HKOes physically bulky Pokemon like Porygon, Omanyte, and Graveler; at +1, it's guaranteed to OHKO the first two and has a chance to OHKO Graveler. It also outspeeds some of the tier's offensive threats, such as Nidoqueen and Pinsir. However, it just has too many flaws to really make use of its unique traits.</p> <p>Firstly, all of Hitmonlee's attacking moves are either Normal- or Fighting-type. This makes it difficult for Hitmonlee to damage many foes, but this is especially problematic against Gastly, which is immune to all of Hitmonlee's moves besides Seismic Toss. Hitmonlee's Base 87 Speed falls short compared to offensive threats such as Fearow and Rapidash, which 2HKO it, or Abra, which OHKOes with Psychic. Therefore, Hitmonlee needs extensive paralysis support to work, and it's just not worth it when other Pokemon like Machamp get more mileage out of such a strategy. Finally, its paper-thin defenses mean it has little chance of surviving any interactions[B], [/B]especially against foes that resist High Jump Kick, since Hitmonlee cannot win unboosted. Pretty much the entire metagame can OHKO or 2HKO Hitmonlee regardless of whether or not they can hit it super effectively, so Hitmonlee is best left on the sidelines.</p> ",
    "sets": [{"name": "Meditate Attacker", "description": "<p>High Jump Kick is Hitmonlee's most powerful attack and 2HKOes Pokemon that Hitmonlee outspeeds such as Porygon, Omanyte, and Graveler. One Meditate boost turns the aforementioned 2HKOs into possible or guaranteed OHKOs. Body Slam provides some much-needed coverage and consistency, allowing Hitmonlee to dent switch-ins and spread paralysis without support from teammates. For Hitmonlee's final moveslot, Seismic Toss is the best option, as it lets Hitmonlee actually damage Gastly. As far as other options go, Mega Kick deals higher damage than Body Slam, but comes at the cost of lower accuracy and the paralysis chance that makes Body Slam so valuable. Counter can allow Hitmonlee to net a surprise KO against something like Pinsir's Slash, but is generally unreliable and will only work once due to Hitmonlee's pitiful defenses.</p> "}],
    "credits": {"writtenBy": [{"username": "phoopes", "user_id": 96315}], "teams": [{"name": "Quality checked by", "members": [{"username": "Gangsta Spongebob", "user_id": 535530}]}, {"name": "Grammar checked by", "members": [{"username": "Sabelette", "user_id": 583793}]}]}
  },
  "Lickitung": {
    "overview": "<p>In the first generation of Pokemon, Normal-types aren't to be taken lightly thanks to powerful STAB moves such as Body Slam, Double-Edge, and the infamous Hyper Beam. Even all the way down in RBY PU, Lickitung exists to prove that not all Normal-types are created equal, falling far short of Fearow and Porygon. Lickitung initially looks promising with its access to STAB Hyper Beam and Swords Dance, amazing coverage options, and potential to spread paralysis with Body Slam. However, it falls short everywhere else due to its absolutely horrendous stats. Its atrocious Speed makes it slower than almost every relevant Pokemon, and is 3HKOed or 4HKOed by the majority of the tier. Lickitung can theoretically win one-on-one against physically frail Pokemon like Staryu and Gastly, but the damage taken in return leaves Lickitung easily revenge killed. Furthermore, Lickitung is almost entirely outclassed by Pinsir, which boasts much higher Attack, Defense, and Speed; in fact, Pinsir's Normal-type attacks hit harder than Lickitung's. Lickitung's only niche is its ability to sweep with Swords Dance, which is something Pinsir can do better. For these reasons, Lickitung remains a terrible Pokemon in RBY PU, and it shouldn't be used unless you're looking to torture yourself.</p> ",
    "sets": [{"name": "Swords Dance", "description": "<p>After a Swords Dance, Lickitung is able to OHKO or 2HKO the entire tier with the combination of Body Slam, Earthquake, and Hyper Beam. Body Slam is Lickitung's safest move; it deals decent damage to neutral targets, and paralysis helps mitigate Lickitung's horrendous Speed. Earthquake is its best option against Omanyte and Gastly, which would otherwise wall it, and the plethora of Fire- and Poison-types in the tier, all of which it OHKOes or 2HKOes at +2. Hyper Beam is Lickitung's most powerful move, and does 60% at minimum to every neutral target in the tier after a Swords Dance. If you must use Lickitung, it is absolutely imperative that its teammates spread paralysis as much as possible before revealing it. Teammates such as Porygon, Staryu, and Dragonair can be very useful as they can spread status without much trouble.</p> "}],
    "credits": {"writtenBy": [{"username": "TehTayTeh", "user_id": 593464}], "teams": [{"name": "Previous version by", "members": [{"username": "SBPC", "user_id": 468904}]}, {"name": "Quality checked by", "members": [{"username": "Sabelette", "user_id": 583793}]}, {"name": "Grammar checked by", "members": [{"username": "Sabelette", "user_id": 583793}]}]}
  },
  "Seaking": {
    "overview": "<p>Seaking’s high attacking stats and access to STAB Surf make it one of the most fearsome mixed attackers in the tier. It can function as a mid-game wallbreaker as well as use Agility to become a deadly late-game cleaner. Seaking's bulk is also fantastic; it can comfortably avoid 2HKOs from Nidoqueen, Pinsir, and Fearow. Seaking’s Water typing gives it very few weaknesses, only really having to worry about non-STAB Thunderbolt from Nidoqueen, Dragonair, Staryu, and Gastly. However, Seaking is almost completely walled by an unparalyzed Staryu, which resists Surf, can paralyze Seaking with Thunder Wave, and can use Recover to heal off the damage from Seaking’s Normal-type moves while wearing it down. Although Staryu doesn't outclass Seaking, which still boasts better attacking stats and bulk, it is generally seen as the preferred Water-type thanks to its higher Speed and better movepool. Seaking is quite slow, requiring Agility to outspeed key threats such as Nidoqueen, Rapidash, Pinsir, and Fearow, while Staryu outspeeds Nidoqueen naturally. Although Seaking is bulky, it lacks reliable recovery, meaning it can be overwhelmed by the strong physical attackers in the tier. Despite these weaknesses, Seaking is still a formidable Pokemon, and its fearsome offensive presence should not be ignored when building a team.</p> ",
    "comments": "<h1>Other Options</h1> <p>Blizzard is able to secure a 2HKO on Fearow, Dragonair, and the rare Grass-types, which Seaking’s standard set is unable to do. However Surf hits everything else harder, and Blizzard generally isn't preferred over Seaking's Normal-type moves. The remainder of Seaking's options are much more niche. Rest is an option to give Seaking longevity, but the offensive nature of the tier makes it very difficult for Seaking to find an opportunity to wake up, and Staryu’s access to Recover makes it a much better Water-type for this role. Tail Whip and Mimic can be used as anti-Staryu options. Two Tail Whips get Staryu into Hyper Beam OHKO range, and Mimic can potentially copy Thunder Wave, Recover, or a coverage move from Staryu. However, both of these options are inconsistent and are generally not recommended.</p> <h1>Checks and Counters</h1> <p><strong>Staryu: Staryu is without a doubt Seaking’s biggest counter. An unparalyzed Staryu can switch into Seaking then use Recover until it KOes itself from Double-Edge recoil. If Seaking uses Hyper Beam or Agility, Staryu can then paralyze it safely and continue to use Recover until it fully paralyzes.</p> <p><strong>Dragonair</strong>: Seaking without Blizzard is helpless against Dragonair, and even if Seaking is running Blizzard it’s still outsped and can be wrapped. Dragonair is also one of the few Thunderbolt users in the tier, which Seaking does not appreciate.</p> <p><strong>Fearow and Pinsir:</strong> Although neither can switch into Seaking, Pinsir and Fearow both beat Seaking one-on-one; Fearow does, however, usually lose against Blizzard Seaking. Even if they lose the one-on-one fight, they’ll have chipped Seaking enough that something else can revenge kill it.</p> <p><strong>Opposing Seaking</strong>: Seaking is able to switch into itself well, and the face-off will typically result in the winning Seaking being at low enough HP that something can revenge kill it, although it will probably be able to fire off one more attack before being KOed if it set up Agility.</p> <p><strong>Slowpoke</strong>: Although rare, Slowpoke is able to switch into Seaking and paralyze it, which generally forces it out. Slowpoke is also able to hit it neutrally with Psychic and reapply the paralysis Speed drop with Amnesia.</p> <p><strong>Vileplume and Weepinbell:</strong> The rare Vileplume and Weepinbell are able to switch into a Seaking lacking Blizzard and inflict it with either paralysis or sleep. Weepinbell also has Razor Leaf, which 2HKOes Seaking.</p> ",
    "sets": [
      {
        "name": "Agility",
        "description": "<h1>Set Description</h1> <p>Surf is Seaking’s strongest move and can 3HKO almost every non-resistant Pokemon in the tier. Surf importantly 2HKOes Nidoqueen, the best Pokemon in the tier, and it also puts nearly every Pokemon into KO range for either Fearow’s Hyper Beam or Drill Peck; the few exceptions such as Pinsir and Machamp are not good switch-ins to Seaking. Double-Edge comes off a respectable base 92 Attack stat, and it gives Seaking perfect neutral coverage along with doing more damage than Surf against physically frail Pokemon, such as Abra and Drowzee. Hyper Beam lets Seaking finish off foes, impressively KOing Drowzee from 49.5% and Staryu from 55.1%. Agility gives Seaking a form of speed control, allowing it to outspeed faster threats such as Nidoqueen and Rapidash, and it lets Seaking clean up a weakened team late-game.</p> <p>Seaking’s best teammate is Fearow, since Seaking is able to punish Fearow’s two biggest checks—Graveler and Omanyte—with a strong Surf. In return, Fearow heavily threatens Staryu, outspeeding it and 2HKOing with Double-Edge or OHKOing with Hyper Beam after the slightest bit of chip damage. Pinsir also appreciates Seaking breaking through the Rock-types, which enables it to wreak havoc with Slash. Seaking is also able to check Rapidash, a Pokemon that Pinsir heavily struggles against. Ironically, Staryu is also a great teammate for Seaking, since it can trade paralysis with opposing Staryu and potentially chip it to make it easier for Seaking to deal with. Dragonair is a notable teammate that can switch into opposing Thunderbolt as well as spread paralysis, easing the burden of Seaking’s low Speed. Lastly, Graveler is a great teammate for Seaking to fall back on if it’s being overwhelmed by Fearow and Pinsir, while Seaking can help Graveler fend off Rapidash.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Gastlies", "user_id": 540559}], "teams": [{"name": "Quality checked by", "members": [{"username": "Adamxer", "user_id": 583473}, {"username": "TehTayTeh", "user_id": 593464}]}, {"name": "Grammar checked by", "members": [{"username": "Adamxer", "user_id": 583473}, {"username": "autumn", "user_id": 384270}]}]}
  },
  "Scyther": {
    "overview": "<p>Initially, Scyther's blistering fast base 105 Speed—tied for the fastest in the tier—excellent base 110 Attack, and access to powerful tools like Swords Dance and Hyper Beam may make it seem like it has a place in PU. However, Scyther is held back by its horrendous coverage, which is limited to Normal-type attacks and Wing Attack, denying it any effective means to get past Rock-types and Gastly. Additionally, its terrible typing and low Special allow the tier's many Fire-types to often OHKO it outright, while its BoltBeam weakness dooms it against common threats like Nidoqueen and Dragonair. Despite its lower Speed, Pinsir is preferred as a Bug-type attacker due to its better coverage, while Fearow better fills the role of a speedy physical attacker. While it looks quite solid at first glance, it advised that you avoid using Scyther.</p> ",
    "sets": [{"name": "Standard", "description": "<p>Swords Dance boosts Scyther's Hyper Beam, letting it cleave past weakened teams and OHKO or 2HKO every Pokemon that isn't resistant or immune to Normal. While Slash doesn't have its power boosted by Sword Dance, it serves as a powerful and spammable attack with its near 100% critical hit rate. Wing Attack lets Scyther deal some damage to Gastly, and it can 2HKO at +2. Toxic can be used over Wing Attack to give Scyther some way to harm Rock-types.</p> <p>Scyther is stonewalled by Omanyte and Graveler, so Porygon is an essential partner in walling these threats. Even with Wing Attack, Gastly is a nuisance, so checks to it like Drowzee and Abra are appreciated. Rapidash and Arcanine give Scyther trouble, so Omanyte is useful in stopping these threats. Offensive threats like Machamp are appreciated for their ability to force damage on bulky threats like Nidoqueen, allowing Scyther to clean late-game.</p> "}],
    "credits": {"writtenBy": [{"username": "Gangsta Spongebob", "user_id": 535530}], "teams": [{"name": "Quality checked by", "members": [{"username": "Sabelette", "user_id": 583793}]}, {"name": "Grammar checked by", "members": [{"username": "Sabelette", "user_id": 583793}]}]}
  },
  "Ditto": {
    "overview": "<p>The novelty of Ditto being the only non-Uber that has access to Transform quickly wears thin when it's the only move it can learn. Ditto's awful base stats are a massive hindrance—it's outsped by the majority of the tier and has subpar bulk, so it generally takes heavy damage before being able to do anything. To add insult to injury, even after using Transform Ditto retains its terrible base HP and low critical hit rate and it uses its subpar original stats when calculating critical hits it deals and receives. Transform copying stat boosts is almost completely irrelevant in PU, as the tier has few viable setup sweepers. Ditto is a fun gimmick, but if you have the slightest interest in winning, you should never use it.</p> ",
    "sets": [{"name": "Transformer", "description": "<p>Transform is the only move Ditto can learn. It copies all of the target's stats except HP, as well as all of their stat changes. It leaves Ditto with 5 PP in every move, which isn't a huge issue in a tier as offensive as PU, but leaves Ditto easy to PP stall by threats such as Porygon. Ditto appreciates its targets being paralyzed, as then it can transform without taking a hit, which likewise means it should avoid getting paralyzed as much as possible.</p> "}],
    "credits": {"writtenBy": [{"username": "Gangsta Spongebob", "user_id": 535530}], "teams": [{"name": "Quality checked by", "members": [{"username": "Sabelette", "user_id": 583793}]}, {"name": "Grammar checked by", "members": [{"username": "Sabelette", "user_id": 583793}]}]}
  },
  "Omanyte": {
    "overview": "<p>Omanyte's combination of solid bulk and a Rock / Water typing perfectly counters Rapidash and Arcanine, denying them meaningful progress, and also makes it an effective switch-in to Fearow. As Rapidash and Fearow are incredibly common offensive threats, Omanyte will almost always have several opportunities to stop a powerful progress-maker in its tracks and then make its own progress. Few Pokemon enjoy switching into Omanyte's decently powerful Surf and Blizzard or risking Body Slam paralysis. However, Omanyte's offensive presence has flaws, as choosing the wrong move for its switch-in—such as Surf for Seaking or Body Slam for Gastly—leaves it in a bad position. Omanyte's terrible Speed makes it loses the one-on-one to a variety of metagame threats, such as Nidoqueen and Drowzee, which can force a powerful attack or status condition on one of Omanyte's teammate as it's forced out. Omanyte's low HP also leaves it extremely vulnerable to fixed-damage moves, which 3HKO it. Additionally, its switch-ins are very predictable, making it exploitable with double switching. Pokemon checked by Omanyte have ways to mitigate its effectiveness, as Fearow's sheer power and critical hit rate can quickly wear it down, while Rapidash can use Fire Spin to switch out if its team lacks a decent Omanyte switch-in. Effective use of Omanyte requires a team that can handle its shortcomings and careful management of its HP, but when played optimally, it can turn dangerous offensive threats into non-issues.</p> ",
    "comments": "<h1>Other Options</h1> <p>Hydro Pump is much stronger than Surf, notably having around a 47% chance to 2HKO Gastly, a 59% chance to 2HKO Abra, an 83% chance to 2HKO opposing Omanyte, and an 85% chance to OHKO the rare Sandslash, feats Surf can never achieve without a critical hit. Hydro Pump's extra damage against Drowzee leaves it always in range of Machamp's Hyper Beam or two Seismic Tosses, and it gives Rapidash's Hyper Beam and Pinsir's Slash favorable odds to KO Drowzee as well. However, Hydro Pump's poor accuracy makes it quite unreliable, with Surf usually being preferred over its inconsistent counterpart.</p> <h1>Checks and Counters</h1> <p><strong>Water-types: While they all dislike paralysis, none of Omanyte's attacks do significant damage to any of the tier's Water-types, whereas they can easily overwhelm it with their STAB moves in return. Staryu can wall Omanyte indefinitely as a result of its access to Recover, while Seaking can set up Agility to negate the Speed drop from paralysis. The rarer Slowpoke and Poliwag can use Omanyte as setup fodder for Amnesia freely.</p> <p><strong>Gastly: Gastly is uniquely immune to Body Slam while only being 3HKOed by Surf, affording it numerous opportunities to switch in and threaten Omanyte with its higher Speed, Hypnosis, and a 2HKO with Thunderbolt.</p> <p><strong>Drowzee</strong>: Drowzee can outspeed and put Omanyte to sleep with Hypnosis and can usually win the one-on-one with Psychic if sleep isn't available.</p> <p><strong>Earthquake Users</strong>: Machamp outspeeds and 2HKOes Omanyte with Earthquake while only being 3HKOed by Surf in return. While they cannot switch in, Ground-types such as Nidoqueen and the rare Sandslash outspeed and 2HKO Omanyte with Earthquake while only being 2HKOed in return, allowing them to easily win the one-on-one or pick off a weakened Omanyte.</p> <p><strong>Grass-types: While rare and vulnerable to Blizzard, Weepinbell and Vileplume serve as effective Omanyte checks. Both outspeed it; the former OHKOes Omanyte with Razor Leaf, while the sheer bulk of the latter allows it to reliably 2HKO Omanyte with Mega Drain. Both threats can also put Omanyte to sleep with Sleep Powder.</p> ",
    "sets": [
      {
        "name": "Standard",
        "description": "<h1>Set Description</h1> <p>Surf is a decently strong attack that 3HKOes most neutral targets. Blizzard serves as coverage against Fearow, Dragonair, and the rare Grass-type such as Vileplume. Body Slam lets Omanyte fish for paralysis on all of its switch-ins barring Gastly, allowing Omanyte to still make some progress against Water-types such as Staryu and Seaking. Rest is Omanyte's only form of recovery, but it is unreliable due to the number of turns it leaves Omanyte helpless and thus is best used to secure late-game victories against Rapidash, Arcanine, and Fearow.</p> <p>Omanyte partners well with many offensive Pokemon that are outsped by Rapidash, such as Pinsir and Machamp. Ironically enough, Rapidash and Fearow also appreciate Omanyte's support, as it secures their mirror matchups and protects Fearow from opposing Rapidash. In return, these wallbreakers and sweepers can power through defensive Pokemon such as Staryu and Drowzee, which Omanyte can't break past on its own. These threats can also check foes that give Omanyte trouble, such as Machamp handling Nidoqueen and Rapidash handling Pinsir. On the defensive end, Staryu is a great partner for its ability to eternally wall Seaking, which otherwise can use Omanyte as setup fodder. Drowzee, while not as iron-clad, is capable of checking special attackers, such as Gastly, Abra, and Staryu, which give Omanyte trouble.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Gangsta Spongebob", "user_id": 535530}], "teams": [{"name": "Quality checked by", "members": [{"username": "TehTayTeh", "user_id": 593464}, {"username": "Sabelette", "user_id": 583793}]}, {"name": "Grammar checked by", "members": [{"username": "Sabelette", "user_id": 583793}, {"username": "autumn", "user_id": 384270}]}]}
  },
  "Dragonair": {"sets": [{"name": "AgiliWrap"}]}
}