{
  "Sandslash": {"sets": [{"name": "Swords Dance"}]},
  "Nidoqueen": {"sets": [{"name": "Mixed Attacker"}]},
  "Rapidash": {"sets": [{"name": "Fire Spin Pivot"}]},
  "Drowzee": {"sets": [{"name": "Bulky Support"}]},
  "Seaking": {"sets": [{"name": "Offensive Agility"}]},
  "Omanyte": {
    "overview": "<p>Omanyte's combination of solid bulk and a Rock / Water typing perfectly counters Rapidash and Arcanine, denying them meaningful progress, and also makes it an effective switch-in to Fearow. As Rapidash and Fearow are incredibly common offensive threats, Omanyte will almost always have several opportunities to stop a powerful progress-maker in its tracks and then make its own progress. Few Pokemon enjoy switching into Omanyte's decently powerful Surf and Blizzard or risking Body Slam paralysis. However, Omanyte's offensive presence has flaws, as choosing the wrong move for its switch-in—such as Surf for Seaking or Body Slam for Gastly—leaves it in a bad position. Omanyte's terrible Speed makes it loses the one-on-one to a variety of metagame threats, such as Nidoqueen and Drowzee, which can force a powerful attack or status condition on one of Omanyte's teammate as it's forced out. Omanyte's low HP also leaves it extremely vulnerable to fixed-damage moves, which 3HKO it. Additionally, its switch-ins are very predictable, making it exploitable with double switching. Pokemon checked by Omanyte have ways to mitigate its effectiveness, as Fearow's sheer power and critical hit rate can quickly wear it down, while Rapidash can use Fire Spin to switch out if its team lacks a decent Omanyte switch-in. Effective use of Omanyte requires a team that can handle its shortcomings and careful management of its HP, but when played optimally, it can turn dangerous offensive threats into non-issues.</p> ",
    "comments": "<h1>Other Options</h1> <p>Hydro Pump is much stronger than Surf, notably having around a 47% chance to 2HKO Gastly, a 59% chance to 2HKO Abra, an 83% chance to 2HKO opposing Omanyte, and an 85% chance to OHKO the rare Sandslash, feats Surf can never achieve without a critical hit. Hydro Pump's extra damage against Drowzee leaves it always in range of Machamp's Hyper Beam or two Seismic Tosses, and it gives Rapidash's Hyper Beam and Pinsir's Slash favorable odds to KO Drowzee as well. However, Hydro Pump's poor accuracy makes it quite unreliable, with Surf usually being preferred over its inconsistent counterpart.</p> <h1>Checks and Counters</h1> <p><strong>Water-types: While they all dislike paralysis, none of Omanyte's attacks do significant damage to any of the tier's Water-types, whereas they can easily overwhelm it with their STAB moves in return. Staryu can wall Omanyte indefinitely as a result of its access to Recover, while Seaking can set up Agility to negate the Speed drop from paralysis. The rarer Slowpoke and Poliwag can use Omanyte as setup fodder for Amnesia freely.</p> <p><strong>Gastly: Gastly is uniquely immune to Body Slam while only being 3HKOed by Surf, affording it numerous opportunities to switch in and threaten Omanyte with its higher Speed, Hypnosis, and a 2HKO with Thunderbolt.</p> <p><strong>Drowzee</strong>: Drowzee can outspeed and put Omanyte to sleep with Hypnosis and can usually win the one-on-one with Psychic if sleep isn't available.</p> <p><strong>Earthquake Users</strong>: Machamp outspeeds and 2HKOes Omanyte with Earthquake while only being 3HKOed by Surf in return. While they cannot switch in, Ground-types such as Nidoqueen and the rare Sandslash outspeed and 2HKO Omanyte with Earthquake while only being 2HKOed in return, allowing them to easily win the one-on-one or pick off a weakened Omanyte.</p> <p><strong>Grass-types: While rare and vulnerable to Blizzard, Weepinbell and Vileplume serve as effective Omanyte checks. Both outspeed it; the former OHKOes Omanyte with Razor Leaf, while the sheer bulk of the latter allows it to reliably 2HKO Omanyte with Mega Drain. Both threats can also put Omanyte to sleep with Sleep Powder.</p> ",
    "sets": [
      {
        "name": "Standard",
        "description": "<h1>Set Description</h1> <p>Surf is a decently strong attack that 3HKOes most neutral targets. Blizzard serves as coverage against Fearow, Dragonair, and the rare Grass-type such as Vileplume. Body Slam lets Omanyte fish for paralysis on all of its switch-ins barring Gastly, allowing Omanyte to still make some progress against Water-types such as Staryu and Seaking. Rest is Omanyte's only form of recovery, but it is unreliable due to the number of turns it leaves Omanyte helpless and thus is best used to secure late-game victories against Rapidash, Arcanine, and Fearow.</p> <p>Omanyte partners well with many offensive Pokemon that are outsped by Rapidash, such as Pinsir and Machamp. Ironically enough, Rapidash and Fearow also appreciate Omanyte's support, as it secures their mirror matchups and protects Fearow from opposing Rapidash. In return, these wallbreakers and sweepers can power through defensive Pokemon such as Staryu and Drowzee, which Omanyte can't break past on its own. These threats can also check foes that give Omanyte trouble, such as Machamp handling Nidoqueen and Rapidash handling Pinsir. On the defensive end, Staryu is a great partner for its ability to eternally wall Seaking, which otherwise can use Omanyte as setup fodder. Drowzee, while not as iron-clad, is capable of checking special attackers, such as Gastly, Abra, and Staryu, which give Omanyte trouble.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 593464, "username": "TehTayTeh"}, {"user_id": 583793, "username": "Sabelette"}]}, {"name": "Grammar checked by", "members": [{"user_id": 583793, "username": "Sabelette"}, {"user_id": 384270, "username": "autumn"}]}], "writtenBy": [{"user_id": 535530, "username": "Gangsta Spongebob"}]}
  },
  "Dragonair": {"sets": [{"name": "AgiliWrap"}]}
}