{
  "Charizard": {
    "overview": "<p>Charizard is among the best Fire-types in RBY NU and a near-staple in the tier, allowing numerous offensive team styles to function. Possessing the coveted combination of 100 base Speed and Fire Spin, Charizard is not only one of the fastest Pokemon in the tier, but also an effective pivot and lead, making it difficult to pin down. It also has many offensive options to choose from, including but not limited to STAB Fire Blast, Earthquake, Slash, and Body Slam, giving it unpredictable coverage that makes it difficult to switch into; additionally, it can use Swords Dance to further boost its wallbreaking capabilities. Charizard's Flying typing also comes in handy, letting it switch in on Earthquake from the likes of Nidoking, Golem, or the rare Sandslash to gain momentum with Fire Spin thereafter; in Nidoking's case, it can even deal big damage with its own Earthquake.</p> <p>Despite its highs, Charizard has trouble breaking past Water-types without already having a boost due to its weaknesses to Water and Ice, often forcing it to use Fire Spin and pivot to a teammate. Similarly, its weakness to Rock Slide makes Ground-types like Golem and Nidoking noteworthy adversaries, and Fire Spin's inaccuracy can make it unsafe to attempt pivoting out against them. Finally, Charizard is incapacitated by paralysis, losing almost all of its offensive presence. It also competes with other Fire-types like Moltres, Rapidash, and Ninetales, though they are often seen alongside it.</p> ",
    "sets": [
      {
        "name": "Fire Spin Pivot",
        "description": "<p>Charizard's defining set uses its blazing Speed and Fire Spin to choke out slower teams, either whittling down their HP until its teammates can clean up or pivoting out from its checks. Because viable Pokemon that Speed tie or outspeed Charizard are limited to Electrode, Fearow, Ninetales, Rapidash, and itself, in many scenarios, Fire Spin is limited only by its own inconsistency. STAB Fire Blast hits extremely hard, guaranteeing an OHKO on Exeggcute and Pinsir while dealing massive damage to anything else. For example, it 2HKOes Fearow and Sandslash, and even a single turn of burn or critical hit can greatly extend this range to Pokemon like Mr. Mime and Nidoking. Earthquake covers most opposing Fire-types, Nidoking, Kabutops, and Golem, 3HKOing most and being boosted by Swords Dance.</p> <p>While the aforementioned moves define the set, Charizard's last moveslot defines its role. Slash allows Charizard to be a consistent revenge killer, providing unresisted coverage alongside Earthquake by hitting Moltres and opposing Charizard for neutral damage. It also deals more damage to neutral targets than Earthquake, such as Seadra. Swords Dance boosts Earthquake's damage enough that it can 2HKO Golem and Mr. Mime, as well as sometimes OHKOing Ninetales. Finally, Toxic has Charizard function as a check to opposing wrappers, such as Dragonair, Rapidash, and Ninetales, as well as making it easier to chip down walls like Golem and Blastoise with Fire Spin. Checking wrappers bolsters its lead viability given the presence of opposing Fire Spin leads like Rapidash and Ninetales.</p> <p>This set can run Counter to be more effective against Body Slam users, as well as providing a point of entry against a predicted Hyper Beam to KO the foe next turn. Furthermore, it does massive damage against opposing Slash Charizard. This can give you massive momentum, as your Counter Charizard is poised to win the matchup thereafter. Body Slam is also viable over Slash to let Charizard support its teammates with paralysis while gaining a more solid midground option, but the damage leaves much to be desired.</p> <p>Fire Spin Charizard can be used on a wide variety of offensive teams thanks to its incredible coverage and Speed. It's an effective lead, possessing the coverage and fast Fire Spin necessary to ensure early-game momentum against other leads like Poliwhirl and Mr. Mime. However, Rapidash can be problematic and compete for the lead slot due to being faster with its own Fire Spin. Charizard's better long-term presence means the two are about equally good leads. If not used as a lead, Charizard is best brought in aggressively, such as against weakened Pokemon or a predicted Earthquake. Charizard's Fire Spin can be used to apply pressure through chip damage against the opposing team, especially if a Pokemon has been poisoned, allowing Charizard to swiftly whittle them down and KO with its powerful coverage. If using Swords Dance, Charizard should only set up if a sweep is assured or if it helps break down a Pokemon asleep from Rest like Blastoise. It is also valid to use Swords Dance if both Charizard and an opposing Pokemon are paralyzed, as it reapplies the foe's Speed drop and may let Charizard win out, but these situations are rare and ideally avoided.</p> "
      },
      {
        "name": "Swords Dance Sweeper",
        "description": "<p>This set goes all-in on late-game Swords Dance sweeping, allowing Charizard to use its unresisted coverage in Earthquake and Hyper Beam to run over weakened teams and cleave open defensive cores. +2 Earthquake can 2HKO Golem and Mr. Mime, while a +2 Hyper Beam KOes even defensive staples like Arcanine and Blastoise from over half HP. +2 Earthquake + Hyper Beam can sometimes KO Pokemon like Seadra and Clefable.</p> <p>The final move used should determine Swords Dance Charizard's role throughout a game. Fire Spin is a fine option to let it pivot out of unfavorable matchups or chip foes into range for Hyper Beam. +2 Mega Kick is viable for KOing Blastoise, Moltres, and opposing Charizard in tandem with Hyper Beam. It should be used sparingly, though, as a miss can lead to a significant loss in momentum. Alternatively, Fire Blast can be used to dispatch Exeggcute, which otherwise takes a hit from the set and threatens it in return with paralysis or sleep.</p> <p>Swords Dance Charizard is one of the best checks to Rest users in RBY NU, being an effective way to consistently break through common defensive cores like Arcanine or Moltres alongside Blastoise. This set also profits from the way players conventionally react to Fire Spin users: Toxic arguably benefits it, preventing paralysis and thus allowing Charizard to be used more liberally against Pokemon like Exeggcute and Mr. Mime. Thanks to these traits, it's best to use Swords Dance Charizard on aggressive teams featuring sleepers like Venomoth, as well as Fire Spin pivots such as Rapidash or Ninetales, which can help Charizard find opportunities to set up and sweep. Pairing it with a Water-type attacker like Seadra is also helpful, providing a two-pronged physical and special offense. Plus, Seadra ensures Pokemon like Golem—which fare well against this set—can't come in for free. Seadra and Blastoise can reliably get opposing Blastoise to use Rest in prolonged interactions, which opens up its team to Charizard's setup.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Plague von Karma", "user_id": 236353}], "teams": [{"name": "Quality checked by", "members": [{"username": "pac", "user_id": 520967}, {"username": "S1nn0hC0nfirm3d", "user_id": 231074}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Blastoise": {
    "overview": "<p>Mr. Mime and Clefable define RBY NU, but Blastoise is the glue that holds it together. Blastoise is the catch-all check to Fire- and Water-types and the main line of defense against an early Charizard sweep. It's also one of the few Pokemon able to take a hit from Golem, forcing it out immediately with Surf. Blastoise's offense cannot be discounted due to the lack of recovery in NU; even checks like Mr. Mime, Clefable, and Electrode hate taking a Surf as they enter, and many switch-ins fear Body Slam paralysis too. Blastoise often ends up serving as a check to itself, since switching in against it is so difficult. Nothing but Electrode can 2HKO Blastoise without a critical hit, allowing it to trade hits effectively with almost any foe, and the threat of Counter makes it difficult for foes to unleash Hyper Beam with impunity, lest Blastoise switch in and punish them.</p> <p>Blastoise's biggest flaw is its mediocre Speed, which leaves it open to Venomoth entering to put it to sleep. Blastoise is so critical that allowing this is often game-losing, but switching out gives Venomoth even more momentum; this interaction makes it extremely hard to use Blastoise early-game. Even with sleep off the table, Mr. Mime, Nidoking, and Kabutops all outspeed it and will invariably damage it heavily should it stay and fight. Blastoise also struggles to check Kingler and Kabutops; while it easily weakens both into KO range of allies like Charizard or Mr. Mime, losing Blastoise early in the process can make Charizard or Moltres a major threat. Also, once Blastoise has lost roughly 45% of its HP, it's no longer an effective switch-in to unparalyzed Charizard, which can use Swords Dance as it enters and OHKO it with Hyper Beam from this range. Further, Blastoise usually draws opposing Blastoise in, and they tend to trade with each other. Blastoise thus only gets one or two switch-in opportunities per game, but the opponent will pay a price to remove it for their sweepers.</p> ",
    "comments": "<h1>Other Options</h1> <p>Blastoise has a plethora of niche options that can substitute for Counter or its fourth move. Toxic is a potential response to Charizard's or Moltres's Fire Spin and can also help to defeat opposing Blastoise without risking Counter. Rest allows Blastoise to eternally wall Ninetales and Seadra and can assist in Toxic stalling opposing Blastoise, but using it allows Mr. Mime and Swords Dance users free entry. Rest is best used to secure endgames against foes lacking setup, rather than as a mid-game defensive play. Blastoise may also consider Hydro Pump, sacrificing accuracy for power. It 2HKOes Moltres, possibly 2HKOes Kabutops, and 3HKOes Clefable. Ice Beam over Blizzard guarantees a 2HKO against Exeggcute without risking a miss chance, but it gives worse damage against other targets. Earthquake is Blastoise's strongest attack versus Electrode and the extremely rare Gastly, 2HKOing the former and having a 59% chance to OHKO the latter. Finally, Bubble Beam can drop the Speed of Nidoking or Charizard, and it doesn't forfeit the 2HKO if Surf follows it up, potentially allowing Blastoise to fish for an even better situation with no downside. In an emergency, it may stop Charizard from setting up and sweeping late-game.</p> <h1>Checks and Counters</h1> <p><strong>Thunderbolt Users: Nearly all teams contain a Mr. Mime, which outspeeds Blastoise and 3HKOes it with Thunderbolt if it can switch in safely. Clefable, while slower, has superior bulk, switches safely into Body Slam, and threatens a Thunderbolt 3HKO or Thunder Wave. Electrode's STAB Thunderbolt is a 2HKO with a high critical hit rate, forcing Blastoise out. However, Mr. Mime and Electrode fear Body Slam paralysis and are generally frail, so they're usually only able to revenge kill.</p> <p><strong>Venomoth</strong>: Venomoth outspeeds Blastoise and can easily enter after a KO or switch into Surf. Blastoise is often a team's defensive centerpiece and cannot afford to take sleep early-game, which gives Venomoth a free sleep attempt as Blastoise switches out, compensating for Sleep Powder's shaky accuracy.</p> <p><strong>Blastoise</strong>: Blastoise will often trade hits with its opposing counterpart, which is often a team's only reliable Blastoise switch-in, resulting in one Blastoise being KOed and the other being severely weakened in most cases. Smart prediction with Counter may result in one Blastoise still having significant health left, but in most cases the winning Blastoise can be revenge killed by nearly any foe.</p> <p><strong>Kingler and Kabutops</strong>: Both Water-type Swords Dance users are middling checks to Blastoise, removing it but ensuring their own demise shortly after. However, a trade often suits them, as Blastoise is usually more valuable. Kingler is just bulky enough to use Swords Dance in front of Blastoise and KO or severely weaken it, often leaving a team with no further check to Charizard. Similarly, Kabutops can win the one-on-one fight or weaken Blastoise into KO range of other threats.</p> ",
    "sets": [
      {
        "name": "Bulky Attacker",
        "description": "<h1>Set Description</h1> <p>Surf OHKOes Golem, 2HKOes Charizard, Ninetales, and Nidoking, and deals excellent damage to non-resistant foes. Seismic Toss enables Blastoise to duel opposing Blastoise and Seadra, 4HKOing both. Counter plays off of this interaction and deals 55.4% to opposing Blastoise after a Seismic Toss. It also lets Blastoise send back Charizard's or Kabutops's Slash twice over, heavily punishing anything they switch into, and Counter can return massive damage after switching into Hyper Beam from Kingler, Raticate, or Clefable. Raticate also must fear a Counter on Super Fang, usually forcing it to use Thunderbolt instead. Blastoise's final moveslot is more flexible. Body Slam can potentially hobble Mr. Mime or Electrode as they switch in, or it can gain an advantage versus opposing Blastoise without risking a massive Counter. Blizzard is also a possibility, notably 2HKOing Exeggcute and the occasional Fearow while potentially freezing other foes.</p> <p>Blastoise is a mainstay of every viable NU team, often forcing opposing Blastoise to trade for it, as few Pokemon can switch into it well. It can function well alongside other Water-types like Kabutops and Kingler, which can assist in fending off opposing Blastoise and Charizard. Golem is a notably good teammate for Blastoise, as it safely switches into Electric-type attacks, can exploit paralysis spread by Body Slam, and helps Blastoise check Charizard. Alternatively, Exeggcute can check Electrode and Mr. Mime after they force Blastoise out, utilizing the opportunity to land Sleep Powder. Electrode can pair surprisingly well with Blastoise, allowing it to play more aggressively, as Electrode can stop opposing Blastoise and Charizard late-game.</p> <p>Blastoise should only be sparsely used early-game, as opponents can easily send in Venomoth to get a free sleep attempt against it. Once Sleep Clause is in effect, it can come in to stop Fire-types and Golem in their tracks and force a response. This will usually lead to a Blastoise mirror match that removes both from the game or leaves them too weakened to check anything; should the opponent send in Mr. Mime or Clefable instead, Blastoise can happily hit them with Surf on entry, and then it can switch out to blockade Charizard later. If Blastoise gets in on a Slash from Charizard, the opponent also must consider the risk of a massive Counter against their switch-in. If Blastoise remains healthy late-game, it can stop an attempted sweep by Charizard, Moltres, or Seadra and secure victory.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Sabelette", "user_id": 583793}], "teams": [{"name": "Previous version by", "members": [{"username": "pac", "user_id": 520967}]}, {"name": "Quality checked by", "members": [{"username": "nicole7735", "user_id": 593847}, {"username": "juoean", "user_id": 486979}, {"username": "Plague von Karma", "user_id": 236353}, {"username": "Volk", "user_id": 530877}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Raticate": {
    "overview": "<p>Raticate acts as a fast revenge killer and wallbreaker in RBY NU, with Super Fang, Normal-type STAB moves, and immense coverage allowing it to 2HKO or 3HKO most of the tier. Raticate is one of the fastest available Pokemon, outspeeding Mr. Mime and Venomoth while only being outsped by Charizard, Ninetales, and the rare Electrode. Raticate's diverse coverage threatens Pokemon like Golem and Kabutops, and its sheer Speed allows it to threaten revenge kills against foes like Mr. Mime and Blastoise. Thanks to Super Fang combined with Hyper Beam or a coverage move, Raticate 2HKOes Pokemon like Venomoth, Mr. Mime, Golem, and even potentially Charizard. This can allow it to sweep or help enable sweepers like Charizard, Kabutops, and Kingler. STAB Body Slam deals excellent damage and is incredibly difficult to switch into, as opponents have to fear Super Fang obliterating their bulky Rock- or Normal-types. Raticate's main issues are its horrid bulk, fear of Counter, and near inability to function if paralyzed.</p> ",
    "comments": "<h1>Other Options</h1> <p>Raticate has abundant coverage but lacks the stats to back it up; however, it may be customized to check threats that the rest of its team cannot safely handle. Thunder guarantees a 2HKO on Kingler but misses crucial ranges against other Water-types and is usually not better than simply hoping for a critical hit. Blizzard deals heavy damage to Fearow, Exeggcute, and Nidoking, usually 2HKOing the first two and 3HKOing Nidoking while potentially freezing; it also still deals heavy damage to Golem but usually misses the 2HKO.</p> <h1>Checks and Counters</h1> <p><strong>Charizard and Ninetales: Charizard and Ninetales outspeed Raticate and 2HKO it with Fire Blast, though missing might get them 2HKOed. Fire Blast's burn chance also threatens to leave Raticate ineffectual.</p> <p><strong>Paralysis</strong>: Raticate cannot bully its foes when it is slower than them, and its frailty shines through when it has to take hits before dealing them; the vast majority of NU 2HKOes it.</p> <p><strong>Counter</strong>: Because Raticate relies on Hyper Beam and often uses Super Fang, Counter will usually threaten a retaliatory KO. Furthermore, if a Counter user switches in on Raticate and forces it out, the Raticate user risks massive damage to their switch-in. Potential Counter users include Charizard, Clefable, Wigglytuff, Blastoise, and Primeape, with Blastoise in particular nearly always carrying it. Raticate can potentially exploit Counter attempts with Thunderbolt, however, especially against Charizard and Blastoise.</p> ",
    "sets": [
      {
        "name": "All-out Attacker",
        "description": "<h1>Set Description</h1> <p>Hyper Beam is the only required move, as it finishes off dangerous foes such as Clefable, Venomoth, and Mr. Mime from 44%, 56%, and 65% HP. Raticate then chooses from three of four moves. Body Slam's paralysis chance makes Raticate difficult to switch into in general, and Body Slam + Hyper Beam also KOes Mr. Mime, allowing Raticate to fish for paralysis to maintain its Speed advantage while still 2HKOing it easily. Super Fang is a common component of Raticate's strategy, making switches incredibly risky even for Rock-types, Clefable, and Wigglytuff. The Super Fang + Hyper Beam combination notably 2HKOes Mr. Mime, Venomoth, and Exeggcute, sometimes 2HKOes Charizard and Nidoking, and rarely can even 2HKO Clefable. Even if Super Fang Raticate can't get the KO, its teammates probably will. Bubble Beam is the ideal coverage move, 2HKOing Golem. Thunderbolt 3HKOes Kabutops and Kingler, and Thunderbolt twice followed by Hyper Beam is enough to defeat Blastoise while avoiding a lethal Counter.</p> <p>Raticate's strategy is simple: revenge kill weakened, slower foes where possible and look for safe opportunities to get in on valuable targets lacking Thunder Wave. Once in, Raticate can use Super Fang to leave the foe in KO range of Hyper Beam or Bubble Beam, or it can use Body Slam to deal heavy damage and punish switches. It can also potentially revenge kill one foe and then take paralysis in order to damage Mr. Mime or Clefable. Raticate baits switches due to its reliance on KOing with Hyper Beam, meaning Body Slam and Super Fang can punish pivots. Due to Raticate's low bulk, switching in is quite difficult; it can benefit from Fire Spin users if you are willing to risk a miss, or it can come in after an ally puts a foe to sleep. Raticate is ideally used on highly offensive teams that seek to leave the opposing team weakened and open to a fast attacker, whether that's Raticate itself or a teammate such as Mr. Mime or Charizard. Helpful teammates for Raticate include Golem, which can switch into Thunder Wave and help check Charizard, and paralysis spreaders like Mr. Mime and Clefable, which let Raticate defeat bulky foes such as Blastoise and opposing Clefable.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Sabelette", "user_id": 583793}], "teams": [{"name": "Quality checked by", "members": [{"username": "Togkey", "user_id": 400664}, {"username": "nicole7735", "user_id": 593847}, {"username": "MrSoup", "user_id": 375193}]}, {"name": "Grammar checked by", "members": [{"username": "CryoGyro", "user_id": 331519}, {"username": "P Squared", "user_id": 168392}]}]}
  },
  "Fearow": {
    "overview": "<p>Fearow boasts a myriad of highly coveted attributes that only it can proudly claim in NU. With a blistering base 100 base speed, Fearow speed ties with Charizard and Ninetales while outpacing tier staples like Mr. Mime, Venomoth, and Nidoking. The relatively high critical hit chance provided by its Speed. coupled with STAB Hyper Beam makes Fearow a phenomenal cleaner against weakened teams, and can even further boost its Speed with Agility for insurance against faster foes and to bypass the Speed drop from paralysis. Fearow is a great late-game cleaner and revenge killer due to its great Speed and powerful STAB moves, but due to its terrible bulk, it generally cannot afford to trade blows with anything it cannot KO. Fearow's defensive typing is quite double-edged, pun intended, and while a Ground immunity is great, Fearow's weakness to the ever-present BoltBeam coverage becomes quite a liability. Fearow is also completely walled by Rock-types, meaning it requires heavy support to guarantee it can fulfill its duty as a sweeper, while other fast cleaners like Charizard and Raticate can create holes in the opposing team for themselves, making them much more self-sufficient.</p> ",
    "sets": [
      {
        "name": "All-Out Attacker",
        "description": "<p>Drill Peck can be used to easily 2HKO Sleep Powder users Venomoth and Exeggcute without taking recoil damage and also bypasses Counter, although it is significantly weaker than Fearow's other STAB options against other targets. Agility allows Fearow to clean up against the few Pokemon faster than it, and also avoid the speed tie with Charizard and Ninetales while outspeeding Electrode or to negate a Paralysis Speed drop. Mirror Move has niche applications that one may find game-to-game, copying Earthquake from a weakened Golem or Nidoking to pick it off, for example.</p> <p>Because of Fearow's ability to sweep so well, Pokemon that often force trades like Mr. Mime, Clefable, and Nidoking are great partners, as even if they can't take something out themselves, they always end up leaving the opponent at low HP—perfect for Fearow to prey on. Pokemon that can force damage on Golem and Kabutops, which are hard checks to Fearow, also make for great teammates. Super Fang Raticate, that carry either Blizzard or Bubble Beam for Golem and Thunderbolt for Kabutops can very effectively weaken the respective check for Fearow, making it a perfect teammate. Swords Dance Earthquake Charizard can also take huge chunks of HP off these Rock-types. Having these additional faster Pokemon often means the opponent's speed control beyond paralysis can easily be overwhelmed. In matchups without opposing Rock-types, Fearow's unresisted STAB moves can be used to its heart's content, 2HKOing other metagame staples like Mr. Mime, Clefable, and Venomoth and opening up holes in defensive Pokemon like Kingler and Blastoise, although it must be wary of Counter from the latter. Weakening these bulky Water-types and forcing the opponent to reveal their Rock-type early if they have one is incredibly valuable for teammates like Charizard.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Togkey", "user_id": 400664}], "teams": [{"name": "Quality checked by", "members": [{"username": "Sabelette", "user_id": 583793}, {"username": "juoean", "user_id": 486979}]}, {"name": "Grammar checked by", "members": [{"username": "aurora", "user_id": 109385}]}]}
  },
  "Arbok": {
    "overview": "<p>Arbok distinguishes itself from other fellow Poison-types by paralyzing Ground-types, like Nidoking and Golem, thanks to its unique access to Glare. It also is one of the few Pokemon in the metagame to utilize Wrap, which allows it to whittle down foes and pivot to teammates. These moves, combined with its immunity to Toxic, let Arbok fit alongside other wrappers like Pinsir and Charizard for paralysis support and defensive synergy. Lastly, Arbok has good coverage options in Earthquake and Body Slam, which can make it difficult for Pokemon like Mr. Mime to switch in.</p> <p>Unfortunately, Arbok still fares terribly in the current metagame. Although its base 80 Speed is fast for a Wrap user, it still falls short of a multitude of top-tier threats, such as Nidoking, Mr. Mime, and Charizard. Despite its defensive typing letting it pivot into Toxic, which cripples other wrappers, it is abysmal overall: Arbok not only fails to resist notable offensive types, but is also quite vulnerable to a multitude of popular Ground- and Psychic-types like Golem, Exeggcute, and Mr. Mime. Although Arbok boasts higher Speed, Defense, and Attack than Dragonair, the latter’s Agility, Thunder Wave, and superior typing mean it will usually be the better choice. Lastly, Arbok’s meager bulk means it will be 2HKOed by most super effective and even neutral hits, like Mr. Mime’s Psychic, Golem’s Earthquake, and even Moltres’s Fire Blast.</p> ",
    "sets": [
      {
        "name": "Glare + Wrap",
        "description": "<p>Glare enables Arbok to be self-supportive and uniquely paralyzes Ground-types that otherwise check it, like Golem and Nidoking. Wrap racks up chip damage while letting Arbok pivot into teammates like Blastoise and Exeggcute. Earthquake is Arbok’s main attack, providing coverage against Ground-, Fire-, and Rock-types like Golem, Rapidash, and Ninetales. Body Slam is its most reliable attack and makes it annoying to switch into, while Rock Slide can 2HKO Moltres and Charizard, providing unresisted coverage alongside Earthquake.</p> <p>Arbok has a few other move choices. Toxic deters Fire Spin users and Dragonair from using it as setup fodder. Hyper Beam is Arbok’s strongest move and can finish off weakened foes, though its mediocre Attack stat prevents it from making full use of the move. Arbok pairs well with wrappers like Dragonair, Moltres, and Rapidash, working together to whittle down foes like Mr. Mime and opposing Ground-types. Pokemon that can stomach Psychic- and Ground-type attacks, such as Exeggcute and Blastoise, are also appreciated so Arbok can paralyze foes throughout a match. Arbok’s paralysis support against Nidoking enables Kingler and Kabutops to wallbreak or clean up more easily.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "5Dots", "user_id": 543866}], "teams": [{"name": "Quality checked by", "members": [{"username": "Plague von Karma", "user_id": 236353}, {"username": "pac", "user_id": 520967}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Sandslash": {
    "overview": "<p>Sandslash is able to carve out a small niche in NU as the only fully evolved Ground-type that possesses Swords Dance and a neutrality to Earthquake. Thanks to its immunity to Thunder Wave, Sandslash can switch in more easily than other Swords Dance users, like Kingler and Pinsir, by predicting Thunder Wave from Pokemon like Electrode, Drowzee, and Mr. Mime. It further benefits from the coveted Earthquake + Rock Slide combination, alongside other key offensive moves like Substitute and Body Slam. Its Speed tier is also serviceable enough to outspeed key staples like Golem, Clefable, and Porygon. Lastly, Sandslash possesses good physical bulk, allowing it to combat physical attackers like Golem effectively. With paralysis support from Pokemon like Mr. Mime and Clefable, Sandslash can ravage the opposing team late-game.</p> <p>However, while having some use, Sandslash's Speed tier is still poor: the relevant Water-types of the tier, such as Kingler, Blastoise, Seadra, and Kabutops, will outspeed it, threatening significant damage before it can set up with Swords Dance. Ergo, they must be removed, severely weakened, or crippled for Sandslash to be effective. This usually causes it to rely on paralysis support, which many teams cannot afford to easily provide. Although Sandslash is immune to Thunder Wave, paralysis from Body Slam, Stun Spore, or Glare cripples its chances to sweep late-game, exposing its poor special bulk and cutting into what Speed it does have. Lastly, it faces heavy competition as a Ground-type from Nidoking and Golem: the former has a much more flexible movepool, better Speed, and a Toxic immunity, while the latter has access to STAB Rock Slide, an important resistance to Fire, more immediate power, and Explosion.</p> ",
    "sets": [
      {
        "name": "Swords Dance",
        "description": "<p>Swords Dance is Sandslash's calling card, driving its Attack stat to terrifying levels. At +2, it can threaten OHKOs on Pokemon like Electrode, Mr. Mime, and Nidoking with Earthquake. Rock Slide complements Earthquake, providing unresisted coverage and securing OHKOs on Charizard and Moltres after a boost; it also hits Pinsir and Fearow hard. Body Slam discourages switch-ins from Poliwhirl and Blastoise, potentially paralyzing them. Alternatively, Substitute can exploit predicted switches and grants Sandslash more opportunities to set up, especially given its immunity to Thunder Wave.</p> <p>Sandslash has a surprisingly interesting movepool, making it quite customizable. Slash gives Sandslash immediate power and tears through Pokemon relying on Reflect, such as Abra and rare variants of Mr. Mime, Clefable, and Wigglytuff. Toxic prevents partial trappers like AgiliWrap Dragonair, Charizard, Moltres, and Rapidash from pinning it down. Submission is its best option against Clefable, Porygon, and Wigglytuff; however, the recoil, shaky accuracy, and lower damage than Earthquake against neutral targets make it a niche option at best. Hyper Beam is Sandslash's best move against Exeggcute and matches Earthquake’s power but fails to notably hit other targets.</p> <p>As a result of its typing and good physical bulk, Sandslash can pivot in against Electrode and Golem as well as Pokemon running Rest, such as Moltres and Blastoise, which let it also break holes in the opposition with Swords Dance. Since they let Sandslash set up, sleeping Pokemon are effectively left on the sidelines until it is eliminated. Pokemon carrying Thunderbolt, like Clefable, that can deter Water-types like Seadra and Blastoise from staying in allows Sandslash to set up more easily. Chip damage from Fire Spin users like Moltres, Rapidash, and Charizard, as well as Wrap from Dragonair, is also appreciated to help secure OHKOs after a Swords Dance, which makes Sandslash more difficult to deal with over the course of a game. Lastly, paralysis support from the likes of Electrode and Mr. Mime allows Sandslash to not only have more setup opportunities, but also to fish for full paralysis with Substitute and become even more lethal.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "5Dots", "user_id": 543866}], "teams": [{"name": "Quality checked by", "members": [{"username": "pac", "user_id": 520967}, {"username": "Plague von Karma", "user_id": 236353}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Nidoqueen": {"sets": [{"name": "Mixed Attacker"}]},
  "Nidoking": {
    "overview": "<p>Nidoking is the most diverse threat in RBY NU and boasts several key strengths that differentiate it from other mid-game attackers. Nidoking has the best coverage in the tier and boasts super effective coverage for nearly every foe, as well as STAB Earthquake for powerful neutral damage. Its Electric immunity grants it entry against opposing Thunder Wave and Thunderbolt users, blessing Nidoking with a variety of effective entry points. For example, one's own Mr. Mime or Clefable often baits in and paralyzes their opposing counterpart, after which Nidoking can switch into the predicted Thunder Wave and threaten them heavily. This immunity additionally makes Nidoking a hard counter to Electrode, helping to protect teams from a surprise sweep and exploiting Electrode for free turns. Nidoking can clean up endgames against the tier's various Water-types and Golem due to its superior Speed, 2HKOing Kingler, Kabutops, and Golem before they are able to 2HKO back.</p> <p>Despite these advantages, Nidoking's typing is a double-edged sword and its Speed leaves it vulnerable to Mr. Mime and Venomoth. Nidoking's Poison typing adds weaknesses to Psychic and Earthquake, making nearly all of Nidoking's matchups risky for both sides, as every top Pokemon in NU has at least one super effective attack against it. Nidoking competes with Golem for a teamslot, in particular missing out on Golem's superior typing. Golem's Rock typing grants it useful Normal and Fire resistances as well as STAB on Rock Slide, whereas Nidoking misses the OHKO against Charizard. Also, Nidoking will leave even victorious fights at low HP, and this is where its imperfect Speed becomes noticeable, as Mr. Mime, Venomoth, and all Fire-types can revenge kill it with ease. Venomoth especially punishes an early Nidoking entry, as it is only 3HKOed by Earthquake, allowing it to switch in, gain massive momentum with Sleep Powder, and then threaten Stun Spore on the switch.</p> ",
    "comments": "<h1>Other Options</h1> <p>Nidoking's other options all end up surprisingly lacking. Substitute initially looks appealing, but Nidoking's lower bulk means that after using Substitute twice, it is in OHKO range of most of the tier, unlike Golem. Body Slam can potentially paralyze, but this is unreliable and it deals poor damage compared to every other option. Thunder's power allows it to rarely secure 2HKOs that Thunderbolt misses, but the odds are extremely low; its best feat is a 42% chance to 2HKO Seadra after considering accuracy. Overall, the loss in consistency often leaves Nidoking in a far worse position than simply using Thunderbolt. Fire Blast seems like it could cover Venomoth, but it only has a 40% chance to 2HKO and otherwise provides very little. Finally, Submission to hit Clefable is useless, as it has only slightly more power than Earthquake with far worse accuracy. Any of these options create exploitable holes in Nidoking's coverage and should not be considered.</p> <h1>Checks and Counters</h1> <p><strong>Venomoth: Venomoth is perhaps the premier Nidoking check, easily landing sleep in retaliation if Nidoking secures an early-game KO. Venomoth also outspeeds and 3HKOes Nidoking while being one of the few Pokemon to be only 3HKOed back, allowing Venomoth to stop Nidoking even late-game. Nidoking also essentially cannot switch into Venomoth, as Stun Spore leaves it ineffective and Double-Edge often leaves it in range of a Psychic 2HKO.</p> <p><strong>Mr. Mime</strong>: Mr. Mime outspeeds and 2HKOes Nidoking, which can't OHKO back. Mr. Mime cannot switch in, but unparalyzed Mr. Mime easily revenge kills Nidoking and is difficult to switch into itself, shifting the momentum from Nidoking's team with a successful entry. Nidoking should not revenge kill early-game due to the threat of Mr. Mime revenge killing it, even when facing Venomoth-less teams.</p> <p><strong>Clefable</strong>: Clefable is slower than Nidoking, but Blizzard 2HKOes and Nidoking can only 3HKO. Also, Body Slam can paralyze Nidoking as it tries to enter, hamstringing it permanently.</p> <p><strong>Seadra and Blastoise</strong>: Both Seadra and Blastoise are 3HKOed by Thunderbolt while 2HKOing in return. Seadra notably Speed ties Nidoking and can set up Agility to ensure it can use another attack after KOing Nidoking. Blastoise can check Nidoking in a pinch, though its utility as a check to other Pokemon means it will rarely want to take this fight. It also cannot switch in and win, as it is slower than Nidoking.</p> <p><strong>Faster Pokemon</strong>: A number of fast Pokemon can check Nidoking given its propensity for taking heavy damage when trading hits. Charizard and Moltres can switch into Earthquake and outspeed Nidoking, with Moltres even 2HKOing it with Fire Blast. Charizard normally needs mild chip damage or a critical hit in order to win one-on-one, but it can also win with a Fire Spin or two, though this is an uncommon set. Raticate has a 51% chance to 2HKO with Super Fang + Hyper Beam, while Nidoking only has a 23.5% chance to 2HKO with Earthquake, and after a mere 8% chip damage, the 2HKO becomes guaranteed. Ninetales and Fearow can defeat Nidoking after approximately 15-20% chip damage as well.</p> ",
    "sets": [
      {
        "name": "Mixed Attacker",
        "description": "<h1>Set Description</h1> <p>Earthquake is Nidoking's strongest move, particularly against Mr. Mime, Clefable, and Kabutops, as well as an effective midground option to cover most switches. Thunderbolt covers the Water-types of the tier, 3HKOing Blastoise and Seadra and 2HKOing the others, while also dealing decent damage to Charizard or Moltres. Blizzard 2HKOes Golem and Exeggcute while also covering Flying-type switches, acting as a generally safe midground option. Rock Slide provides a 2HKO against Charizard and Moltres, both of which are too bulky for Blizzard or Thunderbolt to 2HKO; Charizard is KOed by either Blizzard or Thunderbolt followed by Rock Slide, while Moltres generally requires two Rock Slides to 2HKO. While the overlapping coverage may seem like overkill, Nidoking can at worst 3HKO every single Pokemon in NU with this set, and the overlapping coverage usually makes it near-impossible to safely switch into Nidoking.</p> <p>Utilizing Nidoking effectively requires an awareness of how and when to get it into battle, as well as knowing how to utilize midground options to cover switches without giving up KOs. Nidoking can effectively enter battle when opposing Mr. Mime or Clefable is likely to use Thunder Wave or Thunderbolt. As these Pokemon often trade hits with their opposing counterparts, only to be revenge killed after, it is important to set up mismatched situations: for example, getting your own Mr. Mime in on Blastoise to incentivize the opponent to switch their Mr. Mime or Clefable into paralysis. This allows you to switch Nidoking into their retaliatory Thunder Wave. Nidoking can also enter to revenge kill targets such as Water-types, Golem, and Clefable regardless of whether they're paralyzed, especially later in the game when sleep is no longer a concern. Once Nidoking enters battle, the opponent is pressured to either sacrifice their current Pokemon to chip Nidoking or to try to find a relatively safe switch, such as getting Mr. Mime in against a special attack or Charizard in against Earthquake. For example, Nidoking can 2HKO Kabutops with either two Earthquakes or Thunderbolt + Earthquake; the former provides safe entry to Charizard, while Thunderbolt allows Mr. Mime in to force Nidoking out. Knowing Nidoking's KO ranges and the opponent's switch options allows it to heavily punish desperate switches while still securing KOs if the foe stays in.</p> <p>Nidoking partners well with Mr. Mime, as mentioned, and other paralysis spreaders such as Clefable and Venomoth work the same way. Besides baiting opposing Thunder Wave, they also slow foes down for Nidoking. Exeggcute can also create mismatches by checking Mr. Mime, and it may even paralyze an additional foe as Mr. Mime switches out or use Explosion to grant Nidoking a perfect entry point. It also pairs well with Water-types such as the ubiquitous Blastoise, which baits Electric-type moves late-game and helps to chip down bulkier foes, such as Blastoise and Charizard, for Nidoking to later remove; in return, Nidoking helps to insulate Water-types from a potential Electrode sweep and finish KOs for them. Blastoise and Kingler also often find opportunities to catch switches with Body Slam, potentially paralyzing more opponents.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Sabelette", "user_id": 583793}], "teams": [{"name": "Earlier version by", "members": [{"username": "BT89", "user_id": 487308}]}, {"name": "Quality checked by", "members": [{"username": "Plague von Karma", "user_id": 236353}, {"username": "Ika Ika Musume", "user_id": 165529}, {"username": "nicole7735", "user_id": 593847}, {"username": "Volk", "user_id": 530877}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Clefable": {
    "overview": "<p>Thanks to its great bulk, excellent utility movepool, and solid attacking stats, Clefable cements itself as perhaps the most central Pokemon in NU. Its access to Thunder Wave and Body Slam enables it to be an excellent paralysis inducer, allowing teammates like Charizard, Mr. Mime, Nidoking, and Kabutops to rack up damage to help clean or wallbreak. Diverse coverage including Thunderbolt, Blizzard, and Hyper Beam makes Clefable difficult to switch into and allows it to break through both high-Special foes like Mr. Mime and physical walls like Golem. Clefable also has moves such as Sing and Counter as surprise options to ensure it is never truly predictable. Clefable's defensive typing also prevents it from being paralyzed with Body Slam, allowing it to switch into opposing Clefable as well as certain Charizard, Blastoise, and even Kingler sets.</p> <p>Despite these upsides, Clefable's lack of resistances and low Speed allow it to be worn down quickly and can make it difficult to switch in against faster foes. Clefable is only able to outpace Golem, Exeggcute, Wigglytuff, and the rare Porygon. It is a popular revenge target for Venomoth to put to sleep, and as it is one of the central defensive pieces of the tier, its loss often makes for a difficult game. It also has difficulty fitting every move it wants, having to sacrifice utility or coverage to fit Hyper Beam to improve the Mr. Mime matchup.</p> ",
    "comments": "<h1>Other Options</h1> <p>Clefable can drop Thunder Wave for Hyper Beam if you wish to use Clefable purely for damage and do not need to enable teammates via paralysis, but this often gives up critical utility for minor gain. Sing allows Clefable to utilize its bulk to attempt to put a foe to sleep; however, with no reliable recovery, this is a risky way to compress roles and free a slot for another Pokemon and may result in losing Clefable for little to no value. Due to Clefable’s low Speed and Sing’s poor accuracy, it will often get paralyzed and struggle to land sleep moves. Psychic is an interesting option, 3HKOing Venomoth and allowing Clefable to reapply paralysis Speed drops against it and opposing Clefable, but this covers fewer matchups than most other options. Counter allows Clefable to improve its matchup against opposing Clefable, Raticate, and Wigglytuff, but opposing Clefable can use Blizzard for nearly equivalent damage while avoiding retaliation; it can also be used to switch into a Hyper Beam from Charizard or Kingler before returning lethal damage. Fire Blast 2HKOes Venomoth and Pinsir, but this is extremely niche due to Fire Blast's poor accuracy and Pinsir's rarity.</p> <h1>Checks and Counters</h1> <p><strong>Clefable: The most typical check to Clefable is one's own Clefable, as it is a difficult foe to switch into for most of the tier. Barring multiple full paralysis turns or critical hits, the typical outcome of this scenario is that one Clefable is KOed while the other is left low enough to be revenge killed by most foes.</p> <p><strong>Fire-types</strong>: Although Clefable is bulky, it is quite vulnerable to being whittled down by Fire Spin. Pokemon like Moltres, Charizard, and Ninetales can take on Clefable well, with Moltres nearly 2HKOing Clefable with Fire Blast. However, none of the Fire-types enjoy getting paralyzed themselves and may not wish to risk the matchup.</p> <p><strong>Sleep: Venomoth outspeeds Clefable and can easily enter after a KO, forcing the Clefable player to give up a Pokemon in retaliation. Clefable rarely wants to take sleep moves, and switching is even less ideal, forcing hard decisions.</p> <p><strong>Normal-types</strong>: Wigglytuff can reliably trade with Clefable, leaving one's own Clefable healthy to check other threats. It can also use Counter to return massive damage should Clefable hit it with Body Slam or Hyper Beam. Raticate falls just short of 2HKOing with Super Fang + Hyper Beam, with only a 20% chance to succeed, but still trades well with Clefable or can use Super Fang before allowing a teammate to finish it off.</p> <p><strong>Rock-types</strong>: Hyper Beam Clefable often leaves itself open to one of Kabutops or Golem by dropping either Thunderbolt or Blizzard, allowing these foes to freely set up or attack as it is forced out.</p> ",
    "sets": [
      {
        "name": "Bulky Support",
        "description": "<h1>Set Description</h1> <p>Body Slam and Thunder Wave are central to Clefable's utility in NU. Body Slam deters many switch-ins with the threat of paralysis and deals excellent damage. Thunder Wave intimidates Swords Dance users, punishes Fire Spin misses, and slows fast foes to allow other attackers, such as Kabutops, Kingler, and Nidoking, to punish foes that would otherwise outspeed and KO them, such as Mr. Mime. Blizzard and Thunderbolt provide coverage, threatening 2HKOs and 3HKOs against most of the tier. While both cover the Flying-types of the tier, Charizard and Moltres, Blizzard additionally covers Golem, Nidoking, and Exeggcute, while Thunderbolt provides coverage against Blastoise, Kabutops, and Kingler. Hyper Beam provides a good finishing move against opposing Clefable and is its strongest move against neutral targets like Mr. Mime.</p> <p>Clefable often utilizes Hyper Beam in place of one of its attacking moves, as Body Slam + Hyper Beam usually results in a 2HKO against Mr. Mime and provides high damage against opposing Normal-types such as Clefable, Raticate, and Wigglytuff. Regardless of which move is dropped, however, Clefable suffers in coverage, choosing between losing the consistency of Body Slam, sacrificing its matchup against Water-types by giving up Thunderbolt, or being fully walled by Golem if surrendering Blizzard. Blizzard gives away the least matchups and is thus the safest pick for a typical team, but any move can be dropped depending on its allies' coverage.</p> <p>Clefable is a mainstay of most teams as both the most effective answer to opposing Clefable and as a strong attacker and status spreader after opposing sleep is out of the picture, helping offensive teammates like Charizard and Mr. Mime clean up later in the game by softening the opposing team. A healthy Clefable can also beat nearly any foe one-on-one late-game, and so preserving it should often be a consideration as well. Even with its great bulk, Clefable is still vulnerable to being worn down by Fire Spin chip damage and taking hits as it switches in, and it is often strained by the demands placed on it as one of the few bulky Pokemon in the tier; bulky Water- and Rock-types like Blastoise, Kabutops, and Golem can relieve some defensive pressure and increase its longevity. Clefable can act as a paralysis absorber against Mr. Mime and opposing Clefable but should not be entirely relied on to tank hits.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Sabelette", "user_id": 583793}, {"username": "5Dots", "user_id": 543866}], "teams": [{"name": "Quality checked by", "members": [{"username": "phoopes", "user_id": 96315}, {"username": "nicole7735", "user_id": 593847}]}, {"name": "Grammar checked by", "members": [{"username": "autumn", "user_id": 384270}]}]}
  },
  "Ninetales": {
    "overview": "<p>Although Ninetales is an uncommon lead in RBY NU, it crucially outspeeds Mr. Mime and keeps Venomoth out of the battle. Along with its straightforward assets in Speed and STAB Fire Blast, it has Confuse Ray to harass most other leads and Fire Spin to pivot or chip away at slower Pokemon in a pinch. Its special bulk allows it to go toe-to-toe with Mr. Mime, Clefable, and the rare Electrode, and the threat of Body Slam paralysis makes it difficult for these foes to switch out. Ninetales lacks Charizard's dreaded weaknesses to Thunderbolt and Blizzard, allowing it to better face special attackers and ensuring its lead advantage against Mr. Mime. Using Blastoise to check Ninetales will quickly leave it too worn down to check other threats, and it may even be subject to Fire Spin if burned.</p> <p>Unfortunately, Ninetales is held back by a variety of weaknesses. Though pure Fire is a type with advantages, it leaves Ninetales weak to Charizard's Earthquake. Ninetales lacks a consistent way to stop Charizard and Kabutops from setting up, being forced to switch or fish for paralysis and confusion against deadly foes that can easily KO it or set up with Swords Dance. As Charizard is a common lead, leading Ninetales can immediately put a team on the back foot. Kabutops, Blastoise, and Seadra are capable of switching into Ninetales, albeit at risk of burn or paralysis, and Ninetales's poor coverage leaves it helpless once they do. Confuse Ray and Fire Spin are unreliable at best; they may fully prevent a foe from acting or do absolutely nothing, and they become borderline useless when Ninetales is paralyzed. Ninetales's reliance on luck is baked into all its options, but even moderate luck allows it to frustrate opponents and spread enough damage to enable its teammates.</p> ",
    "comments": "<h1>Other Options</h1> <p>Ninetales's other options are limited in utility. Hyper Beam can provide the extra bit of damage needed to finish off Charizard and Blastoise but does little in most matchups. Toxic can replace Body Slam for use in conjunction with Fire Spin, but this is worsened by Ninetales's inability to consistently trap Charizard and may end up simply blocking more impactful status conditions. Rest looks appealing at first, potentially using parafusion as a chance to heal, but it provides free setup turns for Swords Dance users and free entry for threats like Golem and Nidoking. Substitute may also look interesting to take advantage of Confuse Ray, but Ninetales simply cannot afford the moveslot, and Substitute fails to block Thunder Wave anyway.</p> <h1>Checks and Counters</h1> <p><strong>Charizard: Charizard Speed ties and 2HKOes Ninetales with Earthquake 15% of the time even before accounting for its high critical hit rate. While Charizard fears paralysis, Ninetales's Body Slam is an unreliable way to inflict it and risks losing the game to a Swords Dance set.</p> <p><strong>Rock-types</strong>: Kabutops is practically immune to Ninetales's attacks—Fire Blast is an 8HKO—and burns do almost nothing to hinder it, forcing Ninetales to switch out or gamble on Fire Spin and Confuse Ray. Golem fears receiving a burn, but it is only 4HKOed by Fire Blast and can nearly OHKO in return if not burned.</p> <p><strong>Water-types: Aside from Kingler, which risks a 3HKO from Fire Blast, all Water-types serve as effective Ninetales checks. Blastoise is only 5HKOed by Fire Blast and can 2HKO in return with Surf or make a safe prediction with Body Slam or Seismic Toss due to its bulk. Seadra, similarly, is almost never 4HKOed by Fire Blast, 2HKOing with Surf in return.</p> <p><strong>Paralysis: A paralyzed Ninetales finds itself outsped and heavily damaged by most foes and unable to use Confuse Ray and Fire Spin effectively. Fire Blast becomes even less accurate, leaving Ninetales with little to do but hope to land one or two more hits before being KOed.</p> ",
    "sets": [
      {
        "name": "Lead Attacker",
        "description": "<h1>Set Description</h1> <p>Fire Blast is Ninetales's primary damaging move, nearly OHKOing Venomoth and dealing good damage to neutral targets—it 2HKOes Mr. Mime and Electrode fairly often and 3HKOes Clefable and Nidoking. Body Slam can paralyze Fire- and Water-types as they switch in and is also a solid option against Mr. Mime. Confuse Ray can be used independently or with paralysis to harass slower foes and is a passable, low-risk option to cover switches. Fire Spin can be used to pivot or to chip down foes that can otherwise take Fire Blast.</p> <p>Ninetales generally only fits onto teams as a lead, as Moltres's sheer power and bulk make it more effective as a mid-game wallbreaker. Ninetales seeks to chip down and inflict status onto multiple foes if possible, creating opportunities for teammates such as Charizard, Mr. Mime, and Swords Dance users to sweep later. Good teammates for Ninetales include Water-type Swords Dance users such as Kingler and Kabutops to help check the ubiquitous Blastoise. Ninetales also benefits from status spreaders disabling checks and enabling parafusion. Venomoth can put Water-types to sleep and fish for paralysis as the opponent switches, while Mr. Mime and Clefable can spread paralysis with Thunder Wave. If Ninetales survives the early game, it can return later to take advantage of paralyzed foes or even sweep with Fire Blast. Charizard and Ninetales share checks and are usually the fastest Pokemon in a game, so they may overwhelm opposing Water-, Fire-, and Rock-types.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Sabelette", "user_id": 583793}], "teams": [{"name": "Quality checked by", "members": [{"username": "nicole7735", "user_id": 593847}, {"username": "MrSoup", "user_id": 375193}]}, {"name": "Grammar checked by", "members": [{"username": "CryoGyro", "user_id": 331519}, {"username": "P Squared", "user_id": 168392}]}]}
  },
  "Wigglytuff": {
    "overview": "<p>Wigglytuff is entirely outclassed by Clefable in NU. However, Clefable is one of the best Pokemon available, and Wigglytuff can do many of the same things, so Wigglytuff can be used alongside it as a second, more limited Clefable. Compared to Clefable, Wigglytuff has equally strong STAB moves and similar utility in Thunder Wave but slightly less bulk and very weak coverage moves due to its poor Special stat. In particular, Wigglytuff can be used as a response to the opposing Clefable, or in some cases as a response to Mr. Mime, allowing your own Clefable to be used for other things rather than being locked into a Clefable mirror. However, devoting a slot to Wigglytuff comes at a significant cost, since NU is an extremely centralized metagame. Using Wigglytuff leaves you with an overall slower team and generally means forgoing either Charizard or a different late-game sweeper, such as Seadra, Raticate, Electrode, or Kingler. Wigglytuff performs quite consistently when it is used, but the limitations it imposes on teambuilding are not always worth it.</p> ",
    "comments": "<h1>Other Options</h1> <p>Bubble Beam provides a guaranteed 2HKO on Golem and a 33% Speed drop chance, but dropping Body Slam for Bubble Beam leaves Wigglytuff without a good move to threaten Nidoking; dropping Seismic Toss for Bubble Beam leaves Wigglytuff walled by Kabutops. Counter can potentially deal massive damage; however, Wigglytuff's opportunities to use Counter are typically limited to specific Pokemon such as Raticate, Wigglytuff, and rare targets like Primeape and Pinsir. Clefable does more damage to it with Blizzard than Body Slam anyway, and Wigglytuff does not force many switches. Thunderbolt can be used to avoid Blastoise’s Counter, 3HKO Kabutops, and rarely 2HKO Kingler; however, if Kabutops switches into either Body Slam or Hyper Beam, then Seismic Toss will 3HKO it, making it comparable to Thunderbolt. Wigglytuff is also not too threatened by Blastoise’s Counter due to its high HP stat, taking less than 50% from a Counter on Seismic Toss. Sing is a potential option, but it is not a very good one due to its 55% accuracy and Wigglytuff’s abysmal Speed. However, since Wigglytuff can be effective enough with just Thunder Wave, Seismic Toss, and Hyper Beam, Sing can be used in the fourth moveslot for niche matchups, such as against opposing Wigglytuff, and as a desperation play in an otherwise losing game.</p> <h1>Checks and Counters</h1> <p><strong>Ground-types: Nidoking can switch into Wigglytuff's Thunder Wave and usually defeat it, outspeeding and 3HKOing it with Earthquake while avoiding a 2HKO from any combination of moves. However, Nidoking does not want to switch into Body Slam or Blizzard. Conversely, Golem has little to fear from a Body Slam + Seismic Toss Wigglytuff and can similarly switch into its Thunder Wave, but it risks losing the Speed tie and being 2HKOed by Blizzard.</p> <p><strong>Fire-types</strong>: Wigglytuff is 3HKOed by any STAB Fire Blast, aside from Moltres's which usually 2HKOes. A burn also makes Wigglytuff unable to use its STAB Hyper Beam effectively. However, Fire-types generally hate being paralyzed by Thunder Wave.</p> <p><strong>Rock-types: Kabutops can switch into Hyper Beam and take advantage of the recharge turn to either boost with Swords Dance or simply KO a weakened Wigglytuff, depending on the situation. Golem can also switch into Hyper Beam and either set up a Substitute or attack with Earthquake.</p> <p><strong>Sleep</strong>: Because of its poor Speed, Wigglytuff can be vulnerable to Pokemon with sleep-inducing moves, such as Venomoth or even Sing Clefable. However, sleep inducers do not want to switch into Thunder Wave, and Venomoth does not want to switch into Body Slam.</p> ",
    "sets": [
      {
        "name": "Bulky Support",
        "description": "<p>Thunder Wave should always be used to help compensate for Wigglytuff's poor Speed and to ensure Charizard cannot set up in front of it, as Wigglytuff cannot 2HKO it. It is also generally useful due to the fast pace of matches, and it gives a bulky Pokemon, such as Wigglytuff itself, extra chances to get an advantage from full paralysis. STAB Hyper Beam is by far Wigglytuff’s most powerful move; it has a decent chance to KO Mr. Mime after a Body Slam or Seismic Toss, it is generally a good option against weakened foes, and it is a good final attack right before Wigglytuff is KOed. Seismic Toss is Wigglytuff’s most spammable move, 3HKOing Mr. Mime and 4HKOing everything other than opposing Wigglytuff. Due to Wigglytuff’s middling Attack, poor Special, and low critical hit rate, alternative moves aside from Hyper Beam rarely deal significantly more damage anyway. Seismic Toss also helps to ensure Wigglytuff does not become useless if burned.</p> <p>Body Slam is often the preferred fourth move, enabling Wigglytuff to threaten Nidoking with paralysis and providing a second spammable move alongside Seismic Toss, making Wigglytuff less predictable. In particular, being able to use Body Slam to threaten paralysis rather than depending on Thunder Wave makes it more difficult for Nidoking to switch in for free. On the other hand, using a Body Slam + Seismic Toss set makes the Golem matchup difficult, since Golem is immune to Thunder Wave, Speed ties Wigglytuff, and avoids a 3HKO from Seismic Toss even after a Body Slam. Blizzard is Wigglytuff’s best coverage option for Golem without compromising the Nidoking matchup; it 2HKOes Golem about half the time, and it also deals 38% minimum to Nidoking, leaving it in range of Blastoise’s Surf or Mr. Mime’s Psychic. However, note that Blizzard does minimal damage against neutral targets due to Wigglytuff’s poor Special, so it leaves Wigglytuff very reliant on Seismic Toss.</p> <p>Wigglytuff can be used as a lead, since it has a very favorable matchup against Mr. Mime and an acceptable matchup against Charizard while preventing Venomoth from switching in safely due to Thunder Wave and STAB Body Slam. Alternatively, Clefable can be used in the lead slot for its ability to 2HKO Charizard with Blizzard and similarly favorable Mr. Mime matchup, and it can also use Psychic to threaten Venomoth; in this case, Wigglytuff should be used to provide the team with a bulky Thunder Wave user and Clefable check. Outside of the lead, Wigglytuff is typically best used as a Clefable switch-in, after which it can paralyze it with Thunder Wave and trade hits with Seismic Toss or Body Slam. Wigglytuff can also switch into a predicted Seismic Toss or Thunder Wave from Mr. Mime, but Wigglytuff does not want to switch into Mr. Mime's Psychic, as it can be 2HKOed with one critical hit.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "juoean", "user_id": 486979}], "teams": [{"name": "Quality checked by", "members": [{"username": "Plague von Karma", "user_id": 236353}, {"username": "Sabelette", "user_id": 583793}, {"username": "Volk", "user_id": 530877}]}, {"name": "Grammar checked by", "members": [{"username": "Sabelette", "user_id": 583793}]}]}
  },
  "Venomoth": {
    "overview": "<p>Venomoth is the fastest and most dangerous sleeper in NU. It can quickly remove one foe from play with Sleep Powder, which also forces the opponent to switch into Stun Spore, generating a massive early advantage. Venomoth single-handedly prevents early-game usage of slower Pokemon, as critical threats like Blastoise and Clefable cannot afford to be put to sleep. Venomoth can function as a lead, but it more often serves to punish opponents for over-utilizing slower Pokemon before Sleep Clause takes effect. Its Speed tier also allows it to trade hits with Nidoking or Mr. Mime after it lands its status moves, and while its Psychic is not particularly strong, it can still dent foes heavily with a critical hit or Special drop.</p> <p>Venomoth's biggest weakness is its sheer lack of offense—it has no STAB options and relies heavily on Special drops to deal passable damage, so it struggles to break through paralyzed foes—which it cannot put to sleep—and especially flounders against Fire-types. Double-Edge helps to cover Mr. Mime, but it deals just a bit less damage than needed to truly give Venomoth a chance one-on-one.Venomoth's mediocre typing and bulk limit it defensively, as the tier's various Fire-types, Mr. Mime, and Fearow all outspeed or Speed tie it and force it out; Golem's Rock Slide is also a major threat. However, the sheer power of sleep and paralysis ensure a strong niche for Venomoth.</p> ",
    "comments": "<h1>Other Options</h1> <p>Hyper Beam can be used to finish off Mr. Mime at the cost of either Psychic’s coverage or the ability to combat a healthy Mr. Mime. In particular, Mr. Mime always falls to Hyper Beam after two Seismic Tosses, whereas Double-Edge has a mere 23% chance to KO here. Thus, Hyper Beam is an option for insurance on teams leading Mr. Mime. Hyper Beam also deals more damage than Psychic to most foes, allowing Venomoth to sometimes secure a surprise KO on Clefable, Blastoise, or even Charizard after wearing them down.</p> <h1>Checks and Counters</h1> <p><strong>Fire-types: Venomoth is outsped and 2HKOed by Charizard and Ninetales, both of which also have a high chance to critically hit it. Moltres only Speed ties Venomoth, but its nuclear Fire Blast OHKOes Venomoth, which deals piddling amounts of damage back. All Fire-types are also effective sleep blockers when paralyzed, forcing Venomoth to slowly wear them down before it can land sleep.</p> <p><strong>Mr. Mime: While Mr. Mime fears sleep, it 2HKOes Venomoth and has a high critical hit chance, giving it multiple paths to victory. Paralyzed Mr. Mime blocks sleep moderately effectively, as Double-Edge is only a 4HKO.</p> <p><strong>Fearow</strong>: Fearow is a rare sight, but it outspeeds and 2HKOes Venomoth, just like the Fire-types. It is significantly easier to wear down with Psychic, but it can potentially set up Agility in front of Venomoth and deal heavy damage as it switches out.</p> <p><strong>Exeggcute</strong>: Once Sleep Clause is in effect, Exeggcute easily stops Venomoth. It takes very little damage from Venomoth's attacks and does not mind paralysis, retaliating with Psychic for a 30% likely 2HKO. Exeggcute can easily fish for sleep or paralysis against Venomoth or switch-ins as well.</p> <p><strong>Golem</strong>: Golem's Rock Slide deals upward of 70% to Venomoth, and Body Slam followed by Rock Slide has a high chance to KO, making it risky for Venomoth to switch in. Mega Drain Venomoth can deal heavy damage to Golem, but it still loses one-on-one unless Golem has been chipped. Golem can also use Explosion to even up a losing matchup.</p> ",
    "sets": [
      {
        "name": "Double Powder",
        "description": "<h1>Set Description</h1> <p>Venomoth's main use is to land sleep, then fish for paralysis as the opponent inevitably switches out, since keeping a slower Pokemon in to try to wake up achieves nothing. Stun Spore helps to keep out dangerous threats like Charizard, Moltres, and Fearow, usually forcing the foe to switch in Clefable or Mr. Mime after Sleep Powder lands, accepting paralysis. Psychic is Venomoth's best attack against most foes, scoring a 3HKO on Nidoking and opposing Venomoth, and it threatens repeated Special drops against Water-types and other switch-ins. Double-Edge is primarily for Mr. Mime, either to fight it directly after landing paralysis, or to punish an already-paralyzed Mr. Mime switching in to block sleep. Double-Edge deals about as much damage as Psychic against most switch-ins, though, so it can also be used as a midground option. As an alternative to Double-Edge, Mega Drain nearly 2HKOes both Golem and Kabutops, only needing slight chip damage to guarantee it. However, it is useless versus everything else.</p> <p>Venomoth can act as a lead, matching up well versus any slower lead and having decent odds to put Mr. Mime to sleep, but is forced out by Charizard or Ninetales due to the risk of a critical hit or Sleep Powder miss. In most games, it will instead switch in after a few turns to take advantage of a slower foe like Blastoise. Once in, it lands sleep and follows up with Stun Spore until something is paralyzed; if there is a preexisting paralyzed foe, Venomoth may opt to simply attack in case said foe switches in, returning later to land sleep. After landing sleep and paralysis, Venomoth can either stay in and trade hits until it drops or switch out after paralyzing the foe. Trading hits is advisable if the opponent uses Clefable to absorb Stun Spore, as Venomoth can often weaken it severely with Psychic before going down. Venomoth can also be saved to fight Rock-types with Mega Drain, to sacrifice to sleep later, or to prevent the opponent from ever sacrificing their slept Pokemon—this would let Venomoth land a second sleep. Venomoth pairs well with allies that bait in Water-types, as these are its easiest entry point; for example, leading Charizard or Ninetales often forces Blastoise in, as does using Golem early. Slower allies such as Kingler and Golem particularly appreciate Venomoth's paralysis support, as does Nidoking. Mega Drain Venomoth also works well with allies that normally falter in front of Rock-types, such as Moltres and Ninetales.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Sabelette", "user_id": 583793}], "teams": [{"name": "Previous version by", "members": [{"username": "BT89", "user_id": 487308}]}, {"name": "Quality checked by", "members": [{"username": "Plague von Karma", "user_id": 236353}, {"username": "pac", "user_id": 520967}, {"username": "phoopes", "user_id": 96315}, {"username": "juoean", "user_id": 486979}]}, {"name": "Grammar checked by", "members": [{"username": "DC", "user_id": 449990}, {"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Primeape": {
    "overview": "<p>Primeape stands out thanks to its valuable offensive typing and great offensive movepool, with access to relevant moves such as Rock Slide, Thunderbolt, and STAB Submission. This coverage allows Primeape to succeed far more consistently than any of the other Fighting-types available. Its damage output is also impressive, allowing it to 2HKO or 3HKO the vast majority of Pokemon in the tier, including notable threats such as Clefable and Moltres. Perhaps most importantly, its great Speed stat allows it to outspeed notable fast Pokemon such as Moltres and Mr. Mime. The attached 18.55% critical hit rate further boosts its offensive potency. This rate is especially important versus defensive Pokemon such as Golem and Blastoise, as a singular critical hit Submission or Thunderbolt will turn a 3HKO into a 2HKO. Clefable, Charizard, Moltres, and Kabutops are all OHKOed by either a critical hit Submission or Rock Slide.</p> <p>While Primeape is incredibly strong, its frailness and Psychic weakness allow for little defensive utility, with it losing to common Pokemon like Mr. Mime. Also, while its Speed is impressive, it's not quite enough to stop Fire Spin users such as Charizard and Ninetales from taking advantage of it. Primeape's reliance on its Speed also causes paralysis to cripple it, meaning Pokemon like Mr. Mime, Exeggcute, and Electrode force it out. Other physical attackers, such as Raticate and Charizard, typically provide more defensive utility for equally comparable power.</p> ",
    "sets": [
      {
        "name": "All-out Attacker",
        "description": "<p>Submission is Primeape's primary attacking move, 2HKOing Clefable and Wigglytuff, as well as Golem with minor chip damage. However, a Counter from Clefable or Wigglytuff will punish it, so scouting their movesets prior is recommended. Body Slam grants Primeape some measure of self-sufficiency by spreading paralysis to support it. It also acts as a way to discourage switch-ins, as Pokemon like Charizard and Nidoking hate paralysis; Charizard is also liable to be KOed by Rock Slide thereafter. Rock Slide also lets Primeape punish the plethora of other viable Fire-types, 2HKOing Moltres as well as Ninetales, Arcanine, and Rapidash after some chip damage. Hyper Beam is Primeape's strongest attack, allowing it to revenge kill from high percentages. In addition, Hyper Beam prevents Rest Exeggcute from walling Primeape, with two Body Slams into critical hit Hyper Beam being a guaranteed KO. Alternatively, Thunderbolt is Primeape's strongest option against Blastoise, Seadra, and Kingler, 2HKOing the latter 91.5% of the time.</p> <p>Primeape is decently customizable due to its sizeable movepool. Thunder is a guaranteed 3HKO on Blastoise and Seadra, while with Thunderbolt this is only a chance. However, Thunder's poor accuracy leaves it as a niche option. Low Kick is a decent alternative to Submission, forgoing power for a chance to flinch the foe. This allows it to occasionally brute force through foes at high health without taking damage in the process. Counter can be used to heavily damage physical attackers such as Pinsir and Raticate, but it requires some level of prediction in order to be effective. Primeape can use Toxic to check AgiliWrap Dragonair and Fire Spin users, as they will take more damage from Toxic than it will deal with Wrap. Finally, Mega Kick deals high damage to some of Primeape's most notable checks, pairing with Hyper Beam to secure KOs on Nidoking, Mr. Mime, and Exeggcute. However, Mega Kick's mediocre accuracy leaves much to be desired.</p> <p>Primeape fits well on teams with multiple Flying- and Bug-types such as Charizard, Moltres, Pinsir, and Venomoth, as it resists Rock Slide while also threatening opposing Fire-types that check them. Primeape is also great at absorbing Toxic, due to its dislike of paralysis, which lets it protect Fire Spin Charizard and Moltres. It also pairs especially well with dedicated checks to Mr. Mime. Once Mr. Mime is sizably chipped, Primeape can outspeed and revenge kill it, removing one of its biggest roadblocks in the process. Notable Mr. Mime checks include Clefable, Exeggcute, Drowzee, and even your own Mr. Mime. Primeape is most successful when used as a mid-game wallbreaker, as most of its coveted targets like Clefable, Moltres, and Kingler come into play then. Punishing these Pokemon grants openings for its teammates to sweep later on.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "pac", "user_id": 520967}], "teams": [{"name": "Quality checked by", "members": [{"username": "Plague von Karma", "user_id": 236353}, {"username": "Enigami", "user_id": 233818}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Arcanine": {
    "overview": "<p>Arcanine is a fringe pick in NU as a defensive Fire-type that trades hits efficiently thanks to a very high Attack stat backed by Body Slam access. Being the best physical Fire-type is a big perk for the fiery dog, leaving a dent in anything that doesn't resist its coverage. Its Speed is just barely enough to work, outrunning Pokemon like Venomoth and Mr. Mime, which also makes it a fair anti-lead and revenge killer. Arcanine's bulk is nothing to scoff at, even taking a +2 Earthquake from Charizard, actualizing its utility as a defensive Fire-type. It also has a fantastic Moltres matchup, stonewalling the terrifying Legendary Bird while threatening anything attempting to switch in with a meaty Body Slam. Arcanine can usually deal heavy damage before going down and, when paired with Water-types like Blastoise, can form a decent defensive core to combat the offense-laden RBY NU.</p> <p>However, metagame shifts have not been kind to the Legendary Pokemon: tier staples like Charizard, Kabutops, and Golem tear into it, as Arcanine only has Fire- and Normal-type moves for coverage, and these Pokemon are frequent offensive presences. While it can theoretically use Toxic to punish them, this is hardly a substitute for direct damage, and lacking Fire Spin to pile on chip damage or escape bad matchups worsens the issue. Without Venusaur as a reliable target for it to switch into, as well as Moltres becoming less favored, Arcanine's regular lines of play have diminished. As a defensive Fire-type, it also has issues distinguishing itself from Rest Moltres outside of its admittedly crucial Body Slam access; while Moltres lacks it, it has more overall bulk, Fire Spin access, and generally inconsequential weaknesses, notably not being hit by Earthquake. Furthermore, while Arcanine's Charizard matchup is functional, it's just that: even minor chip damage, which it will sustain, can drastically worsen it. Due to a mix of these factors, Arcanine has fallen off significantly. The volatile nature of the tier is just a bit too much for Arcanine teams in general, leading to them being a rare sight in the modern metagame.</p> ",
    "comments": "<h1>Other Options</h1> <p>Arcanine's movepool is workable, but replacing any move often harms more than it helps due to its highly specific matchup spread. Agility can be used to make Arcanine into a mixed late-game sweeper, with its great Attack stat and Body Slam access making it more reliable than Agility + Fire Spin Moltres. However, with its limited coverage, setting the stage for Agility Arcanine can be difficult, and not having Fire Spin means it needs foes to be put in KO range for it to be consistent.</p> <p>Toxic can be used on lead Arcanine sets to poison potential Fire Spin leads, particularly Charizard and Ninetales, as well as give it something to catch Kabutops and Golem switching in. However, Charizard and Ninetales perform this role better due to their higher Speed and access to Fire Spin. Reflect can be used to further this role and mitigate Arcanine's Earthquake weakness, but the abundance of Swords Dance and Slash users that ignore this makes the utility limited. Leer can be used on paralysis-intensive teams to drop Defense while reapplying the foe's paralysis Speed drop, often forcing the opponent to switch it out, but this is especially niche.</p> <h1>Checks and Counters</h1> <p><strong>Rock-types: Arcanine has nothing to contest Rock-types outside of hoping for a Fire Blast burn, leaving it countered by Golem and Kabutops, which 2HKO it with Earthquake and Surf, respectively. Kabutops is also excellent at making use of a resting Arcanine, as it often uses Swords Dance to threaten a sweep.</p> <p><strong>Water-types</strong>: Arcanine takes massive damage from Water-type attacks, which all 2HKO Arcanine, making Pokemon like Blastoise, Seadra, and Kingler threatening. Kingler strongly dislikes taking paralysis from Body Slam or burn from Fire Blast but can still 2HKO Arcanine.</p> <p><strong>Charizard: Charizard can 3HKO Arcanine with Earthquake, which becomes a 2HKO if it's taken even minor damage. Swords Dance allows Charizard to exploit Arcanine if it uses Rest; in fact, Charizard coming in on a predicted Rest can end the game on the spot. A healthy Arcanine can mortally threaten Charizard with Body Slam paralysis, though, so this matchup can be volatile.</p> <p><strong>Setup Sweepers</strong>: Once Arcanine uses Rest, it's left vulnerable to exploitation, and most setup sweepers have super effective coverage against it. Kingler, Kabutops, Sandslash, and Seadra are all capable of 2HKOing Arcanine after setting up.</p> ",
    "sets": [
      {
        "name": "Defensive",
        "description": "<h1>Set Description</h1> <p>STAB Fire Blast lets Arcanine deal significant damage to Venomoth while serving as its best attack against neutral targets like Nidoking. Body Slam lets Arcanine fish for paralysis as a midground option while denting Fire-resistant foes such as Blastoise and Charizard. Backed by Hyper Beam, Arcanine can 2HKO Mr. Mime if it's taken minimal damage and quickly finish off Fire-resistant Pokemon. Rest should rarely be used but bolsters Arcanine's defensive role, ensuring it can reliably stonewall Moltres, which can't outspeed and chip it down with Toxic + Fire Spin without Agility, and also gives Arcanine a chance to potentially recover in front of a paralyzed foe. However, waking it up can be difficult outside of switching into Fire Spin or weak attackers like Venomoth.</p> <p>Arcanine can be used as an anti-lead, possessing just enough Speed and power to function. Critical hit Fire Blast OHKOes Venomoth, and Body Slam paralysis against any of Charizard, Mr. Mime, and even rare sights like Primeape can be game-defining. Arcanine's bulk allows it to duel lead Charizard quite well, as usage of Earthquake potentially means taking a hit it can't afford so early into a game. It should be remembered that Arcanine is not 2HKOed by Earthquake. However, Arcanine doesn't always need to be a lead, as it can be a strong mid-game presence thanks to the reliability that its bulk, power, and Body Slam access provide. Its Speed is just right for a revenge killer role as well, crucially outrunning base 90 Speed Pokemon like Mr. Mime that are otherwise quite difficult to bring down when they have the advantage. Teams that use Arcanine primarily use it alongside Blastoise, providing a useful defensive backbone against Charizard. Offensively, Arcanine can potentially allow Mr. Mime to flourish by fending off opposing Mr. Mime and Clefable. Using Arcanine takes up a valuable team slot for a second Fire-type, however; there is very little reason to drop Charizard for Arcanine, and thus teams must find ways to check Water- and Rock-types in spite of this increased weakness.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Plague von Karma", "user_id": 236353}, {"username": "Sabelette", "user_id": 583793}], "teams": [{"name": "Quality checked by", "members": [{"username": "Shellnuts", "user_id": 491544}, {"username": "phoopes", "user_id": 96315}]}, {"name": "Grammar checked by", "members": [{"username": "autumn", "user_id": 384270}]}]}
  },
  "Abra": {
    "overview": "<p>Abra wields the strongest Psychic in NU, as well as possessing an impressive Speed stat. This makes it one of the tier's most potent special attackers and revenge killers, threatening notable Pokemon like Nidoking, Venomoth, Raticate, and Pinsir. The aforementioned Speed stat lets it compete with the tier's offensive threats, notably outspeeding Nidoking and Pinsir while Speed tying Moltres, Mr. Mime, and Poliwhirl. It's also one of the fastest users of Thunder Wave in the tier, often forcing out fast threats like Charizard and Electrode that dislike paralysis.</p> <p>However, Abra is comically frail, being 2HKOed or OHKOed by nearly every physical move in the tier, even from coverage moves like Blastoise's Body Slam and Charizard's Earthquake. It also lacks a reliable recovery option to compensate for this, making it very hard to switch in, even against the Pokemon that it's supposed to threaten. Its coverage is also limited to Seismic Toss, so it struggles versus Psychic-types like Exeggcute and the ubiquitous Mr. Mime. Mr. Mime also mostly outclasses Abra, having better coverage as well as physical bulk, with only a slightly weaker Psychic.</p> ",
    "sets": [
      {
        "name": "Special Attacker",
        "description": "<p>Psychic deals incredible damage to many of the tier's biggest threats, notably 2HKOing Nidoking, Venomoth, and Raticate, while having chances to 3HKO defensive staples such as Blastoise, Arcanine, and Porygon. Thunder Wave cripples faster Pokemon such as Charizard and Electrode. Seismic Toss is Abra's best attack versus Psychic-types like Mr. Mime, Exeggcute, and Drowzee. Reflect lets Abra take less damage from physical attacks, notably making Nidoking's Earthquake only a possible 2HKO.</p> <p>Abra's very small movepool leaves it with few other options. Toxic is the most consistent check to the wrappers in the tier, such as Rapidash, Ninetales, and Dragonair. Substitute can be used in order to ease prediction and let Abra take more hits. Abra's astounding frailty means that Counter will deal incredible damage if landed, but it's hard to find situations to both survive the attack and prefer Counter to other attacks, outside of Mr. Mime's Seismic Toss.</p> <p>Abra is typically used alongside Mr. Mime as a generally inferior but still potent version of it. The two often contribute to paralysis spam, supporting sweepers like Kingler and Nidoking. Abra's struggles versus Mr. Mime and Exeggcute make checks to those Pokemon vital, so it synergises well with Clefable as well as your own Mr. Mime.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "pac", "user_id": 520967}], "teams": [{"name": "Quality checked by", "members": [{"username": "Plague von Karma", "user_id": 236353}, {"username": "Enigami", "user_id": 233818}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Machamp": {
    "overview": "<p>Machamp boasts the highest Attack stat in the tier, only contested by Flareon and Kingler. This is bolstered by its near-perfect coverage with options such as Rock Slide and Earthquake and STAB Fighting-type moves to threaten Rock- and Normal-type Pokemon, such as Golem and Clefable. This lets it perform well with paralysis support, especially with Low Kick, letting it outspeed a good portion of the tier. It also has some niche defensive utility, as its Rock resistance gives it synergy with Fire-types such as Charizard and Moltres.</p> <p>However, while Machamp does hit quite hard, it lacks broad defensive utility due to its few resistances and a devastating Psychic weakness. Machamp’s poor Special stat leaves it vulnerable to special attackers like Poliwhirl, Moltres, the elusive Abra, and the ubiquitous Mr. Mime. In addition to this, its poor Speed requires major paralysis support as to not get overwhelmed by the aforementioned special attackers. The Speed issue means Machamp is equally afraid of being paralyzed, as it needs to be able to outspeed opposing Pokemon to pose a threat. All partial trappers in the tier also outspeed and take advantage of it. As if this wasn’t enough, Machamp faces stiff competition with Primeape and Golem, the former boasting Thunderbolt and a much higher Speed tier, and the latter having STAB on Machamp’s coverage options and making better use of the paralysis support needed for Machamp to work. Overall, Machamp is a very high-risk Pokemon with moderate reward, so it's not recommended for use on most competitive teams; physical attackers such as Golem, Pinsir, and Kingler take better advantage of the support Machamp needs.</p> ",
    "sets": [
      {
        "name": "All-Out Attacker",
        "description": "<p>Submission is a strong STAB option, landing a 2HKO on the likes of Golem and Clefable. Alternatively, Low Kick can bully paralyzed Pokemon with flinches at the cost of losing a 2HKO on the aforementioned Golem and Clefable. Earthquake is a nice general coverage option, hitting Fire-types such as Rapidash, Ninetales, and Arcanine. Body Slam lets Machamp become somewhat self-sufficient by spreading paralysis on its own, making switching into it risky. Rock Slide grants Machamp perfect coverage, letting it hit Flying-types such as Fearow, Charizard, and Moltres. However, Hyper Beam is Machamp’s strongest attack, allowing it to pose more of a threat late-game against paralyzed and weakened foes.</p> <p>Toxic is Machamp’s best bet against partial trappers such as Charizard, Dragonair, Moltres, and Pinsir, as, otherwise, Machamp is more or less fodder. Fire Blast 2HKOes Exeggcute and threatens a burn on physical attackers such as Raticate, Fearow, and Primeape. Counter is a usable option, as Machamp's stat spread compliments this move greatly, allowing it to switch in on predicted Hyper Beams from Pokemon like Pinsir, Kabutops, and Kingler before KOing them outright. It can also deter Body Slam from users like Arcanine and Clefable. Using Machamp on a team means that paralysis support is a must-have. Due to this, Pokemon such as Clefable, Mr. Mime, and Electrode make for great partners. The former two are able to switch into Psychic-type attacks aimed at Machamp from the likes of Drowzee, Abra, and Mr. Mime, and the latter more or less guarantees something gets paralyzed due to its great Speed tier. It is best to use Machamp late-game, after the opposing team has been paralyzed.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "BT89", "user_id": 487308}], "teams": [{"name": "Quality checked by", "members": [{"username": "Plague von Karma", "user_id": 236353}, {"username": "pac", "user_id": 520967}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Golem": {
    "overview": "<p>Tumbling down from its peak as an OU staple, Golem finds a solid role in NU as one of the bulkiest and hardest-hitting attackers. QuakeSlide coming off an incredible base 110 Attack threatens the entire tier, deters omnipresent threats like Charizard, Mr. Mime, and Venomoth, and makes Golem painful to switch into, even for bulky checks like Blastoise. In fact, Golem outright OHKOes both Charizard and Moltres, a feat no other Pokemon can manage without a critical hit. Explosion makes it a persistent threat, as even checks like Blastoise and Clefable barely survive it. Perhaps even more notable is its defensive profile—Electric immunity grants it opportunities to switch in against Mr. Mime, Clefable, and Electrode, while its Rock typing allows it to catch careless foes using Hyper Beam and retaliate for massive damage. Its absurd base 130 Defense lets it shrug off Charizard's Earthquake before rocking its world in return; even a +4 Earthquake fails to OHKO Golem, letting it stonewall even the most unstoppable sweep. Even better is the Electrode matchup—Golem fully invalidates it.</p> <p>Golem's 4x Water weakness erodes its formidable defenses, though, as every single Water-type in the tier outspeeds and OHKOes it. Its poor Speed makes it difficult to use against most unparalyzed foes—if it takes a critical hit on entry from Mr. Mime or Charizard, it is almost certainly doomed. Coverage moves from Clefable, Raticate, and Nidoking 2HKO it, limiting its chances to switch in. One would think Golem could at least switch into Fire-types safely, but a burn reduces Rock Slide to an avalanche of pebbles; worse yet, Swords Dance reapplies the Attack drop, granting Charizard free setup. This rocky matchup spread limits Golem to mostly switching into Thunderbolt and Thunder Wave.</p> ",
    "comments": "<h1>Other Options</h1> <p>Golem lacks viable options outside of the above set. Toxic can prevent opposing Fire Spin users from chipping it down, but Golem already OHKOes the most relevant ones should they miss a single time. Fire Blast 2HKOes Exeggcute but has very little utility otherwise. Counter is an extremely niche option; Golem can use this to OHKO Raticate if it uses Super Fang, but this plan is extremely dangerous, since Raticate is likely to have Bubble Beam. Golem can also come in after Charizard KOes its ally with a Normal-type attack, using Counter as Charizard switches out, but this is only notable when using Counter against a critical hit—primarily from Slash—or a +2 Hyper Beam.</p> <h1>Checks and Counters</h1> <p><strong>Water-types: Every single Water-type outspeeds and OHKOes Golem. Golem's only recourse is to paralyze them with Body Slam as they switch in or wear them down; none of them can repeatedly switch into its powerful Earthquake, and paralyzed Water-types lose after a little chip damage, since Earthquake can 2HKO them from about 70%. Kabutops is a worse check than the other Water-types and is unable to switch into Earthquake.</p> <p><strong>Burn: A burned Golem is almost worse than useless; opposing Swords Dance users can reapply its burn while setting up, and it becomes easy to switch into even for frail foes. In particular, Charizard exploits it heavily, setting up a game-ending sweep against the hapless boulder. Moltres can similarly use Agility to reduce Rock Slide to a paltry 25% damage, then retaliate with Fire Spin to wear Golem down. Explosion deals minimal damage after a reapplied burn, so Golem is often better off switching out if this happens; it can be saved to chip down a paralyzed Mr. Mime, Clefable, or Venomoth later or used as a sacrifice for momentum.</p> <p><strong>Faster Attackers: Golem loses against just about any Pokemon that packs a Water- or Ice-type coverage move, unless it is paralyzed. Clefable outspeeds and 2HKOes Golem with Blizzard, and it is only 3HKOed in return. Golem can fish for full paralysis with Substitute against a paralyzed Clefable, or it can use Explosion to remove it, which is usually a beneficial trade for the Golem user given Clefable's value, but the risk of a Blizzard critical hit makes this dubious. Raticate 2HKOes Golem with Bubble Beam and easily covers any switch-in with Super Fang. Thus, Golem cannot beat it one-on-one, cannot switch into it, and opens up a teammate to heavy damage by switching out. Golem does 2HKO with Earthquake, so a paralyzed Raticate is far less of an issue; Golem can defeat it and then land Explosion on something else later. Nidoking cannot switch into Golem, since they mutually 2HKO, but Nidoking wins one-on-one with Blizzard handily.</p> <p><strong>Venomoth: While Venomoth fears both Earthquake and Rock Slide, it easily comes in after a KO or as Golem sets up Substitute and threatens to put it to sleep. Venomoth can also run Mega Drain, which just barely misses the 2HKO but heavily wears Golem down. Golem cannot switch in well even after Sleep Clause takes effect, as Stun Spore and Psychic remain threatening.</p> ",
    "sets": [
      {
        "name": "Bulky Attacker",
        "description": "<h1>Set Description</h1> <p>Earthquake deals immense damage against most foes, 3HKOing at worst, and it 2HKOes Mr. Mime, Nidoking, Raticate, Kabutops, and Ninetales. Rock Slide OHKOes Charizard and Moltres and comes just short of OHKOing Venomoth. Explosion OHKOes frail Pokemon like Mr. Mime and Raticate, and it deals massive damage to Clefable and Blastoise, KOing them after mild chip damage. Substitute eases prediction and allows Golem to fish for full paralysis against paralyzed foes; it can easily set up Substitute in front of Electrode or Fearow. Alternatively, Body Slam can paralyze Water-type switch-ins; since Golem's Earthquake 3HKOes them all, they cannot switch in again later if paralyzed, since Golem will outspeed and finish them off. Golem's primary advantages over its main competitor, Nidoking, include its vastly superior typing and bulk, which make it a far more effective check to Charizard, Mr. Mime, and Venomoth. However, its lower Speed and 4x Water weakness make Nidoking the superior choice against Clefable, Exeggcute, and every Water-type. This Speed gap makes Golem far more reliant on paralysis, and it needs allies that can switch into Ice- and Water-type attacks, such as Blastoise and Seadra; Nidoking operates far more independently but brings little defensive value.</p> <p>Golem can seek out lopsided matchups and find entry against Thunder Wave users mid-game, or it can be saved to revenge kill paralyzed targets and threaten Explosion. Golem desperately does not want to take damage on entry; a lot of theoretically-good matchups become quite poor with a critical hit or Special drop. For example, Mr. Mime only 3HKOes Golem normally, but with its nearly 50% odds of a critical hit or Special drop, it has a fair chance to 2HKO instead. Similarly, taking a Fire Blast on entry is essentially a 30% chance to turn Golem into a paperweight, and a Charizard Earthquake might deal over 60% if it critically hits. Therefore, Golem benefits from teams that spread paralysis and, most importantly, force the opponent to switch into paralysis-inflicting moves. For example, Blastoise can use Body Slam against Charizard, potentially catching it switching out and paralyzing an incoming Blastoise or Mr. Mime, and Venomoth forces the opponent to switch into Stun Spore after it puts something to sleep. Exeggcute, for example, checks Mr. Mime, spreads paralysis, and enables allied Mr. Mime to spread paralysis and bait Thunder Wave. When the opponent's hapless Thunder Wave user tries to retaliate, Golem comes in to block Thunder Wave and fire off powerful attacks. This is notably far less effective against Clefable unless it is chipped significantly; Clefable's bulk allows it to take hits from Golem, and Blizzard 2HKOes normally but also has about a 20% chance to critically hit or freeze.</p> <p>Alternatively, Golem can work as a late-game cleaner on fast teams with many paralysis options; Venomoth and Body Slam Charizard, for example, can help spread enough paralysis for Golem to tear through the enemy team and finish the game. Water-types make good teammates as well; Golem covers their Electric weaknesses, and in return they help to check opposing Water-types and solidify the matchup against Fire-types. In particular, Blastoise and Kingler can use Body Slam to hamstring targets for Golem and force the opponent into guessing games when they'd like to use Thunderbolt. If the opponent predicts incorrectly, they will often end up losing a Pokemon for minimal gain; Kingler is especially dangerous, as a single mistake may allow it to set up Swords Dance and inflict incredible damage. Golem does struggle late-game against many foes often saved for a sweep, like Kingler, Nidoking, and Seadra, so using it in this role requires careful scouting and team support.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Sabelette", "user_id": 583793}], "teams": [{"name": "Previous version by", "members": [{"username": "5Dots", "user_id": 543866}]}, {"name": "Quality checked by", "members": [{"username": "Plague von Karma", "user_id": 236353}, {"username": "pac", "user_id": 520967}, {"username": "Enigami", "user_id": 233818}, {"username": "Togkey", "user_id": 400664}, {"username": "juoean", "user_id": 486979}, {"username": "phoopes", "user_id": 96315}]}, {"name": "Grammar checked by", "members": [{"username": "Rabia", "user_id": 336073}, {"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Rapidash": {
    "overview": "<p>Despite the infamous reputation of Fire-types in RBY, Rapidash cements a niche as one of the best leads in the RBY NU metagame. It separates itself from other Fire Spin leads with its excellent Speed which gives it a menacing 20.5% critical hit rate and lets it use Toxic to check other partial trapping leads. Fire Spin also makes it work with other partial trapping users such as Moltres, Ninetales, and Charizard. Rapidash can land 2HKOs with a critical hit Fire Blast on notable threats such as Mr. Mime and Clefable. It can use chip damage done with Fire Spin in tandem with Fire Blast and Hyper Beam to become a cleaner. Rapidash is also one of the best pivots in the tier, with access to Fire Spin allowing it to safely pivot out of poor lead matchups into a safer check. For example, if Rapidash faces a Poliwhirl lead, it can pivot out into a teammate like Electrode or Clefable to take care of Poliwhirl for it.</p> <p>Despite these upsides, Rapidash's typing hinders it greatly, as it is forced out by the Water-types of the tier, such as Blastoise, Kabutops, and Poliwhirl. Its movepool is limited to Fire- and Normal-type attacks, meaning that it struggles to threaten the likes of Golem and said Water-types. Rapidash is also very susceptible to chip damage and greatly dislikes paralysis. Nonetheless, Rapidash is a solid Pokemon in the tier.</p> ",
    "sets": [
      {
        "name": "Fire Spin Pivot",
        "description": "<p>Fire Spin is Rapidash’s main asset, wearing down foes and giving it a great opportunity to pivot around poor matchups in the opening. Rapidash is one of the fastest Pokemon in the tier, and it can take out a worn down opponent with Fire Blast or Hyper Beam. Fire Blast can OHKO Pinsir and Exeggcute, 2HKO Nidoking after a critical hit, and can burn an opponent, which can be useful for forcing a Rest from the likes of Blastoise or crippling physical attackers like Kingler and Golem. Toxic can cripple other Fire Spin or Wrap users such as Moltres, Dragonair, and Ninetales, as it outdamages a foe's Fire Spin or Wrap. Toxic, in tandem with Fire Spin from either Rapidash or a teammate, can create a deadly combination that drains the HP of foes quickly while forcing Rest from counters such as Kabutops and Blastoise. Hyper Beam can finish off worn down checks such as Blastoise and Charizard. Body Slam is a good option over Hyper Beam, as it allows Rapidash to spread paralysis to switch-ins such as Blastoise and Kabutops.</p> <p>Rapidash’s limited movepool means that there is not much room for variation. Agility is a decent option, as it lets Rapidash outspeed the entire tier and can also alleviate paralysis from foes such as Mr. Mime, Clefable, and Electrode. It also allows Rapidash to have an uncontested Fire Spin, which further enhances its ability to clean late game. However, it is hard for Rapidash to set up against a majority of the tier, and it faces competition from Moltres in this role. Stomp can be used alongside Body Slam for a solid combo of paralysis and flinch. Rapidash likes to have counterplay to Water- and Rock- types like Blastoise and Golem, which can easily stonewall it, making Pokemon like Blastoise, Electrode, and Mr. Mime solid teammates.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "BT89", "user_id": 487308}], "teams": [{"name": "Quality checked by", "members": [{"username": "SBPC", "user_id": 468904}, {"username": "pac", "user_id": 520967}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Slowpoke": {
    "overview": "<p>Slowpoke can differentiate itself from Poliwhirl as an Amnesia sweeper with Thunder Wave to spread paralysis and higher Defense—although its horrid Speed tier makes paralysis especially a necessity and not a luxury. Its Speed tier also makes it a solid Thunder Wave absorber, since it does not mind a Speed drop. It can find setup opportunities on Pokemon it can threaten out with paralysis, or resist the attacks of, which includes Arcanine and Poliwhirl. After an Amnesia, it can deal good damage against Fire-types such as Moltres and Charizard and wall special attackers like Mr. Mime and Porygon. Slowpoke is also a check to opposing Water-types, most importantly Poliwhirl, as, after Sleep Clause has activated, there is little it can do to Slowpoke.</p> <p>However, Slowpoke’s bulk is quite mediocre, with its physical bulk being average and its special bulk being poor without any boosts. Even at +6 Special, Slowpoke gets ruined by a critical hit Thunderbolt from the likes of Electrode and Mr. Mime. Because of this, it can be taken advantage of while using Rest, which also makes it lose to physical attackers and setup sweepers like Nidoking, Clefable, Charizard, and Kabutops. Slowpoke also faces issues with its abysmal Speed tier; it is very easy to revenge kill and fails as a lead, unable to beat sleep inducers like Venomoth and Poliwhirl, vulnerable to partial trapping users like Dragonair and Pinsir, and targeted by Explosion users like Golem.</p> ",
    "sets": [
      {
        "name": "Amnesia",
        "description": "<h1>Set Description</h1> <p>Surf is Slowpoke’s best STAB option, offering great offensive coverage that lets it hit the likes of Charizard, Mr. Mime, and Nidoking effectively. Rest allows Slowpoke to continue its sweep by recovering hits taken while setting up, especially thanks to its increased special bulk due to Amnesia. Thunder Wave allows Slowpoke to outspeed and cripple Pokemon that can threaten it.</p> <p>Slowpoke has a very solid movepool, leaving a good amount of options to choose from. Psychic can be used over Surf, as, even though it is weaker against neutral targets, it sports a 30% special drop rate. It also hits Venomoth super effectively, as well as gaining a neutral hit on Water-types such as Blastoise and Kabutops. Blizzard allows Slowpoke to hit Exeggcute super effectively, as well as still hitting Moltres and Charizard. It also allows Slowpoke to fish for a freeze, which can be useful in a pinch. Ice Beam, although weaker than Blizzard, is more reliable. Fire Blast can deal good damage to Grass- and Bug-types, having a 28.2% chance of OHKOing the likes of Pinsir after an Amnesia. Toxic over Thunder Wave or Rest helps Slowpoke against partial trapping users such as Dragonair and Pinsir. Earthquake over either of those moves allows Slowpoke to deal good damage to Electrode. However, it serves little purpose outside this.</p> <p>Slowpoke is vulnerable to most Electric-type coverage within the tier, so having an Electric-immune teammate helps greatly. Nidoking and Golem are prime examples of this. Nidoking can switch into Electric-type moves from threats such as Electrode while taking out Pokemon that can force out Slowpoke like Clefable. Golem can switch into moves such as Mr. Mime's Thunderbolt and, after minor damage, KO with Explosion and let Slowpoke in for a sweep. Mr. Mime deserves a special mention, as it is all-around useful and can break through Water-type Pokemon such as Blastoise and Kabutops. Poliwhirl can be used alongside Slowpoke, as Slowpoke spreading paralysis opens Poliwhirl up to sweep late-game. Partial trappers such as Pinsir and Moltres provide a great form of chip damage to facilitate a late-game sweep with Slowpoke. Sleep support from Venomoth or Clefable gives Slowpoke reliable turns to set up against its foes.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "BT89", "user_id": 487308}], "teams": [{"name": "Quality checked by", "members": [{"username": "pac", "user_id": 520967}, {"username": "SBPC", "user_id": 468904}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Magneton": {
    "overview": "<p>Due to its high Special and Electric typing, Magneton wields the most powerful Electric-type attacks in the tier. Notably, it is able to OHKO Poliwhirl, Kingler, and Fearow while having a chance to OHKO on Blastoise, Charizard, and Seadra. In addition, Thunder Wave lets it cripple the offensive potential of major offensive threats such as Mr. Mime and Arcanine. Also, Magneton's defensive stats are enough to allow it to switch in on many of these offensive Pokemon.</p> <p>However, its pitiful movepool and terrible Attack leave it nearly helpless against Ground-types like Nidoking and Golem, which happen to be some of the most common Pokemon in the tier. Its largest issue is its subpar Speed, which lowers its effectiveness at handling targets such as Moltres and Mr. Mime, as well as hampering its ability to safely use Rest. It also leaves it prey to partial-trapping users such as Dragonair and Rapidash. Finally, it faces stiff competition with Electrode, which is much faster and has access to better utility and coverage moves such as Screech and Explosion.</p> ",
    "sets": [{"name": "Offensive", "description": "<p>Thunder Wave is essential, as it helps make up for Magneton's low Speed and cripples Wrap users. Thunder is Magneton's main offensive tool, allowing it to OHKO notable Pokemon like Poliwhirl and Blastoise. Thunder is used because Thunderbolt misses the OHKO on notable Pokemon such as Blastoise. Double-Edge is used to deal damage to Ground-types, mainly Nidoking. Magneton can wake up from Rest with opportunities like switching into Fire Spin.</p> <p>Thunderbolt can be used instead of Rest for its favorable accuracy. Flash is usable and can help losing matchups, but it's unreliable. Toxic over Double-Edge makes the Golem matchup better while worsening the Nidoking matchup. Substitute can be run alongside Toxic or other moves like Flash and Supersonic, although these latter options are unlikely to succeed unless the target is already paralyzed.</p> "}],
    "credits": {"writtenBy": [{"username": "pac", "user_id": 520967}], "teams": [{"name": "Quality checked by", "members": [{"username": "Plague von Karma", "user_id": 236353}, {"username": "kapali95", "user_id": 93615}, {"username": "Sevi 7", "user_id": 505149}, {"username": "pac", "user_id": 520967}, {"username": "S1nn0hC0nfirm3d", "user_id": 231074}]}, {"name": "Grammar checked by", "members": [{"username": "Astra", "user_id": 240732}, {"username": "uptopzhr", "user_id": 517423}]}]}
  },
  "Gastly": {
    "overview": "<p>Gastly is one of the strongest pivots in the metagame due to its typing granting it complete immunity to numerous valuable offensive tools such as Body Slam, Hyper Beam, Slash, and Toxic. It's also one of the faster users of a sleep-inducing move in Hypnosis, which is incredibly important due to nearly every competitive team trying to spread sleep in some form. Its Ghost typing is also completely unique in the tier, allowing it to check Pinsir and Raticate; PP stall Wrap and Bind users such as Dragonair, Pinsir, and the niche Weepinbell; and pivot around the various Body Slams of the tier from the likes of Blastoise and Clefable.</p> <p>However, Gastly has some flaws that make it struggle to succeed consistently in the meta. Its typing faces issues defensively, being weak to common moves such as Psychic and Earthquake and giving it poor matchups versus numerous top-tier threats like Charizard, Nidoking, and the ubiquitous Mr. Mime. Gastly's Speed is also just not enough, leaving it outsped by all of the aforementioned threats, as well as the more notable sleepers in Venomoth and Poliwhirl. Finally, its bulk is generally quite poor, leaving it obliterated by key offensive threats like Charizard, Rapidash, and Mr. Mime once it has taken mild chip damage.</p> ",
    "sets": [
      {
        "name": "Hypnosis",
        "description": "<p>Hypnosis is one of Gastly's main selling points, as it's just fast enough to outspeed and threaten Golem, Clefable, and Exeggcute with sleep. Thunderbolt is Gastly's main attacking move, wielding chances to 3HKO or 2HKO notable Water- and Flying-types like Kabutops, Blastoise, Seadra, and Charizard. Mega Drain is Gastly's strongest move versus Golem and Kabutops, with chances to 2HKO both and recovering health in the process. Night Shade is used for consistent damage, though Psychic can be used over it or Mega Drain as a midground option that threatens Special drops and a 2HKO on Nidoking.</p> <p>Gastly's pitifully small movepool leaves little else to utilize. Explosion is the most enticing option, allowing Gastly to bring in teammates safely while dealing decent damage towards neutral threats, potentially KOing Mr. Mime after a singular Night Shade. Thunder is Gastly's strongest attack versus Blastoise, Seadra, Charizard, and Poliwhirl, 2HKOing all of them. However, its poor accuracy makes it an inconsistent option. Toxic is Gastly's most consistent check to Fire Spin users, most notably Rapidash, Charizard, and Moltres. Confuse Ray can achieve similar results as Toxic, but Toxic is a much more permanent solution to the issue and leaves Confuse Ray mostly outclassed.</p> <p>Gastly's weakness to Psychic make checks to Mr. Mime a necessity, so pairing it with Pokemon like Clefable, Porygon, and your own Mr. Mime is important. Its ability to deal good damage versus Water- and Rock-types such as Blastoise, Kabutops, and Golem makes Fire-types like Charizard, Moltres, and Rapidash potentially solid teammates, as they appreciate the support. Charizard is an especially good teammate, as it is a soft check to Nidoking and obliterates Exeggcute, both of which Gastly can struggle with. In addition to this, Gastly is a fantastic partner for Pokemon that fear paralysis from Body Slam such as Pinsir and Kingler. Gastly's access to Hypnosis also creates openings for Agility users like Dragonair and Moltres to make use of AgiliWrap strategies.</p> <p>Gastly comes in for free on opposing Poison- and Normal-type moves, most notably Toxic, Body Slam, Slash, and Wrap. This makes it one of the more effective switch-ins for Kabutops and Blastoise, as it is only 3HKOed by the former's Hydro Pump and is immune to its Slash, while the latter typically wields either Toxic or Body Slam and fails to 3HKO Gastly with Surf. This makes it an effective mid-game pivot, as its role as one of the safest switch-ins towards these Pokemon allows you to safely bring in Pokemon like Electrode that would normally fear Body Slam or force the opposing foe out with threat of a powerful coverage move or Hypnosis.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "pac", "user_id": 520967}], "teams": [{"name": "Quality checked by", "members": [{"username": "Plague von Karma", "user_id": 236353}, {"username": "SBPC", "user_id": 468904}]}, {"name": "Grammar checked by", "members": [{"username": "Rabia", "user_id": 336073}]}]}
  },
  "Drowzee": {"sets": [{"name": "Standard"}]},
  "Kingler": {
    "overview": "<p>Swords Dance Kingler is the strongest wallbreaker and a potent sweeper in RBY NU. At +2, Hyper Beam can OHKO much of the tier, including threats like Mr. Mime, Raticate, and Venomoth, and nearly KO anything except Rock-types. Additionally, Body Slam followed by Hyper Beam will KO any Normal-neutral foe at +2. Rock-types are washed away by Crabhammer, a powerful STAB move that will almost always score a critical hit. It easily OHKOes Golem and 2HKOes Kabutops, coming just short of OHKOing Charizard and Ninetales. Kingler also has decent physical bulk, avoiding 2HKOs from some strong physical attacks such as Golem's Earthquake and opposing +2 Kingler's Body Slam. Due to its power and bulk, Kingler often forces switches and can fish for paralysis with Body Slam as opponents react to a potential Swords Dance sweep.</p> <p>However, Kingler is very slow for RBY NU, outsped by a myriad of prominent offensive threats. This means it requires extensive paralysis support from teammates to safely sweep and is ruined by getting paralyzed itself; this threat is compounded by Crabhammer's and Hyper Beam's middling accuracy. Also, even neutral special attacks such as Mr. Mime's Psychic 2HKO it. Kingler's weakness to Electric means it is forced out by Thunderbolt users such as Mr. Mime, Clefable, Nidoking, and Electrode, and even Fire Blast is a major threat to it.</p> ",
    "sets": [
      {
        "name": "The Cringe Crab (Swords Dance)",
        "description": "<h1>Set Description</h1> <p>Swords Dance defines Kingler's sweep and can reapply paralysis Speed reduction in situations where it needs to set up on a Thunder Wave or Body Slam user. Body Slam is a very powerful attack after a boost and threatens switch-ins with paralysis, which helps Kingler sweep and support its team. Hyper Beam is an outstanding finishing move, dealing massive damage to almost anything and outright OHKOing frailer foes at +2. Crabhammer hits Rock-types, complementing Kingler's physical damage output, and removes Fire-types after mild chip or Body Slam.</p> <p>Kingler's low Speed means it highly appreciates paralysis support from teammates such as Mr. Mime and Clefable. Kingler also appreciates teammates that can switch into Thunder Wave and Thunderbolt, such as Golem and Nidoking. Early-game, Kingler can wallbreak with Crabhammer and spread paralysis with Body Slam. It appreciates opportunities to enter the field against Charizard, Golem, and Blastoise, preferably as a revenge killer rather than switching into attacks, then using Body Slam, Crabhammer, or Swords Dance to remove one or two major threats, paving the way for its allies to sweep. If Kingler is saved for late-game, when the opponent's team is weakened and paralyzed, and sent in to revenge kill a foe lacking paralysis, it can easily use Swords Dance to sweep. Whether wallbreaking or sweeping, Kingler will want to stay and fight until it drops unless it has a safe switch and is still healthy. Kingler users should note the state of the opponent's team and whether significant checks like Mr. Mime remain healthy to decide whether to set up or use its raw power.</p> <h1>Other Options</h1> <p>Kingler should generally not run any other moves than the four listed in the set. Stomp is much weaker than Body Slam and makes Kingler even more reliant on its team to spread paralysis. Blizzard only hits the relatively niche Exeggcute effectively, 2HKOing it but giving up far more relevant moves. Similarly, Surf's accuracy may sound appealing, as it still OHKOes Golem, but this makes Kingler unable to stop Fire-types and Kabutops. Substitute is held back by Kingler's bad Special, and does not address Kingler's weakness to Thunder Wave.</p> <h1>Checks and Counters</h1> <p><strong>Electric-type Attacks: Electrode, Nidoking, and Mr. Mime outspeed Kingler and can 2HKO it with Thunderbolt, with Electrode even having a chance to OHKO bolstered by its high critical hit rate. Clefable is slower than Kingler and takes heavy damage from boosted Body Slam, but it can paralyze and 2HKO Kingler and does not fear Body Slam paralysis.</p> <p><strong>Paralysis: Thunder Wave users such as Clefable and Mr. Mime can dash any chance of Kingler sweeping late-game. Getting paralyzed means Kingler can no longer outspeed some of the slowest Pokemon in RBY NU or outspeed faster paralyzed foes.</p> <p><strong>Faster Special Attackers</strong>: Kingler's poor Special means even moderately strong special attacks like Mr. Mime's Psychic 2HKO it. Even Moltres's Fire Blast, which Kingler resists, will always 3HKO it. Its low Speed exacerbates this issue, as it can't outspeed most of the threats that threaten to KO it.</p> <p><strong>Burn: Kingler, as a Water-type, may eventually need to switch into Fire Blast, which has a 30.1% chance to burn. A burned Kingler must use Swords Dance to negate the Attack drop but can at least use Crabhammer unhindered.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "LTG", "user_id": 473639}, {"username": "Sabelette", "user_id": 583793}], "teams": [{"name": "Quality checked by", "members": [{"username": "pac", "user_id": 520967}, {"username": "SBPC", "user_id": 468904}, {"username": "MrSoup", "user_id": 375193}, {"username": "juoean", "user_id": 486979}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}, {"username": "CryoGyro", "user_id": 331519}]}]}
  },
  "Electrode": {
    "overview": "<p>Electrode is the best Electric-type in RBY NU due to its incredible Speed and access to Explosion. Electrode 2HKOes every single Water- and Flying- type except Moltres, and its absurd 27.34% critical hit rate allows it to often 2HKO Moltres and neutral targets like Mr. Mime and Clefable. This combined with Thunder Wave and Explosion makes it an extreme pain for many NU teams, as the most common team structures contain Charizard, Blastoise, and often a third Electric-weak Pokemon like Kabutops or Kingler. Players are forced to run Ground-types to avoid an Electrode sweep. While Electrode can have incredible matchups, others are horrendous; Electrode is walled by Ground-types and has difficulty breaking past the uncommon Exeggcute. It also becomes near-useless once paralyzed, as it loses its defining Speed advantage and has its frailty exposed. Electrode is usually limited to late-game cleanup due to its poor bulk and need to have Ground-types addressed. Electrode can create some of the most polarizing and difficult matchups in NU, either destroying the opposition with critical hit Thunderbolt or getting stopped in its tracks by a Ground-type.</p> ",
    "comments": "<h1>Other Options</h1> <p>Electrode has little else to offer. Take Down can be used to chip Nidoking on entry but is effectively a worse Screech in this role. Hyper Beam can potentially finish weakened foes but lacks the power to meaningfully contribute to a victory. Toxic damage is too slow to help against Ground-types, even with Substitute.</p> <h1>Checks and Counters</h1> <p><strong>Ground-types: Golem is the hardest counter to Electrode, blocking all of its moves effectively and getting free turns to set up Substitute or attack. Nidoking blocks Electric-type moves and threatens heavy damage but takes over 50% from Explosion and risks an OHKO from critical hit Explosion.</p> <p><strong>Paralysis: A paralyzed Electrode is quickly forced to use Explosion. Many threats, like Mr. Mime, Charizard, and Moltres, are capable of beating it one-on-one or forcing an immediate Explosion once it's paralyzed.</p> <p><strong>Exeggcute: Thunderbolt is a tenuous 5HKO against Exeggcute, which can put Electrode to sleep or paralyze it. Electrode's Explosion deals a maximum of 68%, failing to even leave it KOed by Seismic Toss.</p> <p><strong>Ninetales</strong>: Ninetales is only 4HKOed by Thunderbolt and has a 64% chance to 2HKO Electrode with Fire Blast.</p> ",
    "sets": [
      {
        "name": "Fast Attacker",
        "description": "<h1>Set Description</h1> <p>Thunderbolt 2HKOes Charizard and every Water-type while 3HKOing the remainder of the tier barring Exeggcute, Ninetales, and Ground-types. Thunder Wave hamstrings other paralysis spreaders like Mr. Mime and Clefable, maintaining Electrode's Speed advantage. Explosion deals heavy damage to many foes, falling just short of OHKOing frail Pokemon like Mr. Mime and Raticate and respectably hitting bulky foes like Clefable and Nidoking for half or more of their HP. A critical hit Explosion is near-guaranteed to KO these Pokemon and create holes for Electrode's teammates. Electrode can choose from Thunder or Screech. Thunder can get more KOs—for example, Thunderbolt + Thunder 2HKOes Raticate, and Thunder can KO targets like Blastoise from 69% rather than 55%, opening up risky options in difficult games. Screech lets Explosion OHKO Nidoking.</p> <p>Electrode pairs well with teammates that can cover its Ground-type weakness such as Blastoise, Kingler, and Venomoth. The Water-types punish Golem, and Venomoth creates breathing room with sleep. Mega Drain Venomoth is a rare option that can take out a Golem by surprise. Raticate and Charizard are powerful wallbreakers that often force Golem in earlier than the opponent would like. Since so few Pokemon want to switch into Electrode, you can double switch to a Water-type to take advantage of typical answers, like Ground-types and Ninetales. Once the opponent's team has been revealed, Electrode can serve as a targeted assassin, taking out a key target like Mr. Mime to enable its allies, or it can be reserved to sweep weakened, unprepared teams lacking Ground-types. It can also sacrificially stop a Charizard sweep with Thunder Wave in an emergency.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Sabelette", "user_id": 583793}], "teams": [{"name": "Previous version by", "members": [{"username": "pac", "user_id": 520967}]}, {"name": "Quality checked by", "members": [{"username": "Plague von Karma", "user_id": 236353}, {"username": "Enigami", "user_id": 233818}, {"username": "Togkey", "user_id": 400664}, {"username": "nicole7735", "user_id": 593847}, {"username": "MrSoup", "user_id": 375193}]}, {"name": "Grammar checked by", "members": [{"username": "Rabia", "user_id": 336073}, {"username": "CryoGyro", "user_id": 331519}, {"username": "autumn", "user_id": 384270}]}]}
  },
  "Exeggcute": {
    "overview": "<p>What Exeggcute lacks in stats, it makes up for in status moves and typing, utilizing its key Psychic and Electric resistances to spread sleep and paralysis. It is one of the few Pokemon available that can inflict sleep consistently. It can switch into, status, and wear down the opponent's Mr. Mime without exposing your own Mr. Mime to paralysis, keeping it healthy so it can run rampant later in the match. Its resistance to Mr. Mime's, Electrode's, and Venomoth's primary attacks makes it good support for teams otherwise vulnerable to these foes, and it minds paralysis less than most Pokemon. It also packs Explosion to heavily damage a foe on the way out and grant free entry to a deadly attacker or setup sweeper, allowing for clever positioning to set up a nice endgame sweep.</p> <p>Exeggcute's typing does, however, make it extremely vulnerable to the plentiful Fire- and Ice-type attacks in the tier. Even though it resists Earthquake, its very low Speed and lack of Grass-type STAB moves make it a mediocre Golem check, and its low Special and Ice weakness make it an extremely unreliable switch-in to Nidoking. Its physical bulk, while passable, is insufficient to avoid OHKOs from Kingler's and Pinsir's +2 Hyper Beams, leaving it unable to stop their sweeps with Stun Spore. Additionally, its low offensive stats leave it rather passive after it spreads status, and it will almost certainly get paralyzed as it tries to put something to sleep, which leaves it with an inconsistent 56% chance to actually land its status moves thereafter. Nonetheless, Exeggcute is a considerable thorn in the side of almost any NU team given the sheer prevalence of Mr. Mime and Venomoth.</p> ",
    "comments": "<h1>Other Options</h1> <p>Rest gives Exeggcute longevity against Mr. Mime and Electrode, letting it continually frustrate their attempts to make progress and provide a safe switch for Pokemon vulnerable to them. However, due to its low bulk and common weaknesses, it invites sweepers like Nidoking and Raticate and Swords Dance users like Kingler and Kabutops in, letting them throw out devastating attacks while it is asleep. It also must fear repeated Special drops from Mr. Mime, which will eventually force a switch. Double-Edge could be used to pressure Mr. Mime slightly more heavily than Psychic; however, it only threatens a 5HKO with Exeggcute's dismal Attack stat, and the move weakens Exeggcute with recoil damage. Alternatively, Egg Bomb avoids recoil damage at the cost of a poor 74.7% accuracy. Solar Beam is Exeggcute's only Grass-type attack—it threatens Kingler, Kabutops, and Golem with an OHKO and inflicts massive damage on Blastoise and Seadra. However, since the opponent can simply switch out during its charge turn, Solar Beam is only possibly useful late-game, when they might lack healthy Grass-resistant Pokemon to tank it.</p> <h1>Checks and Counters</h1> <p><strong>Bulky Water-types: Blastoise and Seadra are faster than Exeggcute, aren't threatened much by its Psychic or Explosion, aren't affected heavily by paralysis, and shred Exeggcute with Ice-type attacks. Blastoise's Seismic Toss followed by Blizzard has an 82% chance to KO, making it nearly impossible for Exeggcute to switch in or bait an attack to pivot in a teammate.</p> <p><strong>Fire-types</strong>: All fully-evolved Fire-types outspeed and OHKO Exeggcute with Fire Blast, and they are either 5HKOed or 4HKOed by Exeggcute's weak Psychic. Stun Spore on the switch takes their greatest asset away, though.</p> <p><strong>Clefable and Wigglytuff</strong>: Both Clefable and Wigglytuff outspeed and 2HKO Exeggcute with Blizzard, and if they don't have that, they can 3HKO with two Body Slams followed by Hyper Beam. They are already slower than most of the tier and thus aren't harmed much by paralysis, and Psychic only 5HKOes them, letting them bully Exeggcute once Sleep Powder isn't an option.</p> <p><strong>Fearow, Raticate, and Nidoking</strong>: In a pinch, these fast offensive Pokemon 2HKO Exeggcute to win one-on-one, but all are severely hampered by paralysis, and Nidoking especially does not take Psychic well. They are very effective at punishing Rest Exeggcute, taking advantage of its sleeping turns to switch in safely and blow holes in its team.</p> ",
    "sets": [
      {
        "name": "Support",
        "description": "<h1>Set Description</h1> <p>Exeggcute's primary goal is to get in and put something to sleep as soon as it can, and then it attempts to spread paralysis to support its team. Teammates shouldn't paralyze Pokemon Exeggcute struggles to handle, like Fire-types, before Exeggcute gets in and puts a foe to sleep. Psychic is Exeggcute's best attacking option and hits most Pokemon in the tier for neutral damage. Psychic's 33.2% chance of reducing Special helps Exeggcute to overcome its passiveness, breaking down even bulky foes when combined with paralysis. A Special drop also provides defensive benefits, such as preventing Blastoise and Seadra from 2HKOing Exeggcute with Blizzard and reducing even Moltres's nuclear Fire Blast to a 2HKO, giving a healthy Exeggcute the option to boldly stay in on Fire-types and debilitate them with status. Explosion allows Exeggcute to take out over two-thirds of Mr. Mime's HP, leaving it in KO range for most allies, or to deal around 50% to most foes while granting an ally free entry. This allows Exeggcute to grab momentumwhen it's about to faint anyway and potentially set up an ally's sweep.</p> <p>Water-types in particular have good synergy with Exeggcute, covering for its weakness to Fire and Ice, while Exeggcute in turn covers their Electric weaknesses. Kingler and Kabutops also benefit from Exeggcute's relatively weak Explosion, which can grant them a safe moment to set up Swords Dance against a weakened foe. Powerhouses below base 90 Speed, like Nidoking and Kingler, enjoy Exeggcute as a relatively safe switch-in to escape heavy damage or paralysis from Mr. Mime, Electrode, or Venomoth, and it can inflict status to help them blow apart the opposing team. While Exeggcute can't fight Ground- and Water-types one-on-one, its resistances to their STAB attacks let it bait out their weaker coverage moves, letting teammates switch in more safely.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Enigami", "user_id": 233818}, {"username": "Sabelette", "user_id": 583793}], "teams": [{"name": "Quality checked by", "members": [{"username": "Plague von Karma", "user_id": 236353}, {"username": "pac", "user_id": 520967}, {"username": "phoopes", "user_id": 96315}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Seadra": {
    "overview": "<p>Seadra is an excellent offensive threat in RBY NU, possessing Agility to distinguish itself as a late-game cleaner that isn't completely ruined by paralysis. Seadra's high Special and combination of Water- and Ice-type coverage, while not unique, let it batter teams when coupled with Agility. Seadra isn't just a solid offensive pick either: it can form a great defensive core with Pokemon like Blastoise as well, guarding against the myriad of Fire-types in the tier, most notably Charizard, thanks to their mixed bulk. Thus, Seadra fits very well on teams that demand a late-game sweeper that doubles as a defensive pivot.</p> <p>However, while Seadra is a good defensive Water-type, it is also checked excellently by them, struggling to break past Pokemon like Blastoise and Poliwhirl because of its shallow offensive movepool. Seadra's Speed, while it can boosted by Agility, is a bit mediocre, surpassed by common Pokemon such as Fire Spin users like Charizard, Rapidash, and Ninetales. Ergo, while it can stop Fire Spin users in their tracks, it can't do much about them pivoting into a check like Electrode.</p> ",
    "sets": [
      {
        "name": "Agility Sweeper",
        "description": "<p>The combination of Surf and Blizzard gives Seadra coverage resisted only by opposing Water-types; Surf 2HKOes Fire-types like Arcanine, Charizard, and Ninetales, while Blizzard 2HKOes Exeggcute and Fearow. Hydro Pump can be used over Surf to score a 2HKO on Moltres and sometimes Mr. Mime, though inconsistency can be its downfall. Rest or Toxic can be used to improve matchups against wrappers, especially if running Hydro Pump; Rest gives Seadra a great matchup against Fire Spin users in combination with Agility and gives it significant longevity, while Toxic can more definitively stop wrappers like Dragonair, Moltres, and Charizard. However, Hydro Pump can be used here instead to close out the aforementioned 2HKOs while keeping Surf's reliability. Finally, Agility lets Seadra sweep late-game and remove the Speed drop from paralysis.</p> <p>Despite having a very shallow movepool, Seadra can be customized a bit. Hyper Beam can KO Mr. Mime from a minimum of 38.1%, dealing more damage than Surf, while also dealing more damage to Water-types than Hydro Pump. However, its utility outside of this is questionable at best and Hydro Pump tends to be more effective in practice. Double-Edge can be used for these targets and lacks a recharge turn, but it deals less damage than Hydro Pump against Water-types, so it isn't recommended. Ice Beam can be used alongside Rest to fish for a freeze, though Pokemon like Blastoise often do this more effectively. Seadra's unique access to Smokescreen as a Water-type is arguably useful to combat AgiliWrap Dragonair and AgiliSpin Moltres or Rapidash, but Toxic is often superior for putting a permanent, consistent stop to their antics.</p> <p>Seadra is best used on teams that appreciate multiple Water-types; thus, Pokemon like Blastoise and Kabutops make good partners. It also appreciates Exeggcute as a partner for walling Mr. Mime and having Sleep Powder, the latter of which helps Seadra more easily set up Agility. Additionally, Exeggcute appreciates Seadra's presence for combatting Fire-types like Moltres that severely threaten it. Similarly, Nidoking struggles against Charizard while helping Seadra's Electric weakness. Seadra can be used mid- and late-game as either a defensive pivot or a cleaner, gating off the tier's Fire-types and eventually swinging for victory. It's best to set up Agility as late as possible once its checks and counters have been removed, as Seadra is otherwise easily walled by a Water-type switch-in.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Plague von Karma", "user_id": 236353}], "teams": [{"name": "Quality checked by", "members": [{"username": "pac", "user_id": 520967}, {"username": "Enigami", "user_id": 233818}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Mr. Mime": {
    "overview": "<p>Mr. Mime is the most dominant Pokemon in RBY NU, functioning as the tier's premier special attacker, with its great typing, high Speed, and unresisted coverage making it versatile and hard to consistently check. Said high Speed lets it take advantage of its coverage extremely effectively, outspeeding or Speed tying every threat that it hits super effectively besides Charizard, Fearow, and the niche Primeape. Thunderbolt lets Mr. Mime check key Water-types like Seadra, Kabutops, and especially Blastoise, an incredibly valuable role. It is also one of the fastest paralysis spreaders in the tier, forcing out numerous offensive threats such as Electrode and Fearow and crippling Fire Spin users for missing. Nearly every competitive team uses Mr. Mime, partially because it is one of the few reliable checks to itself.</p> <p>While Mr. Mime is an incredibly good Pokemon, its terrible Defense makes it decently frail, being 2HKOed by some of the Pokemon it's supposed to threaten offensively, such as Moltres and Kabutops. Due to this, it's incredibly reliant on its Speed stat to stay relevant throughout the battle. This means Thunder Wave users such as Clefable and Porygon usually force it out. In addition, it comes out incapacitated from the Mr. Mime mirror match and is forced out by other Psychic-types like Exeggcute and Drowzee. Its Speed, while impressive, still leaves it susceptible to notable Fire Spin users like Charizard, Rapidash, and Ninetales. While it doesn't take heavy damage from Fire Spin, it usually lacks recovery to mitigate the chip damage. Also, outspeeding Mr. Mime lets the Fire Spin users pivot to a revenge killer that can exploit its poor Defense like Fearow. It especially struggles with Rapidash, Ninetales, and Moltres, being unable to deal notable damage without Psychic Special drops and taking hefty damage from Fire Blast.</p> ",
    "comments": "<h1>Other Options</h1> <p>Mr. Mime has few truly relevant other options, as its main set is the most consistent across the board and leaves little room for other moves. Rest is the most common option; it can be used over Seismic Toss to grant Mr. Mime more longevity against Psychic-types and Clefable. It is especially relevant versus Exeggcute, which becomes unable to threaten it outside of Explosion. While Mr. Mime's frailty gives it few chances to wake up normally, the high frequency of Fire Spin users and opposing Mr. Mime allows it to come in and burn sleep turns somewhat reliably. Barrier allows Mr. Mime to somewhat mitigate its frailty, turning normally threatening moves like Kingler's Body Slam from a guaranteed 3HKO to a possible 5HKO. It also gives it a safety net against +2 Hyper Beam from Pokemon like Pinsir, Kingler, and Kabutops, which otherwise threaten Mr. Mime with a potential OHKO. Counter can deal heavy damage to a physical attacker such as Raticate or Pinsir given Mr. Mime's physical frailty. Notably, Mr. Mime will likely force out Raticate right away with the threat of paralysis, allowing Counter to deal massive damage to the switch-in. Solar Beam is Mr. Mime's strongest attack versus Golem, but the charge turn leaves it open to exploitation. Flash could be used to inconsistently drop accuracy, but the move is mostly outclassed by Thunder Wave, which effectively achieves the same thing except against Ground-types.</p> <h1>Checks and Counters</h1> <p><strong>Psychic-types: Exeggcute is one of the best dedicated checks to Mr. Mime, resisting both Psychic and Thunderbolt while threatening it in return with paralysis or sleep. However, unless Exeggcute is running the rare Double-Edge or sacrifices itself with Explosion, it can struggle to damage Mr. Mime, only inflicting a possible 7HKO with Psychic. Drowzee, while rare, threatens Mr. Mime with Thunder Wave, Hypnosis, or a 3HKO from Seismic Toss. Mr. Mime's Seismic Toss only 4HKOes, leaving Drowzee relatively safe.</p> <p><strong>Clefable: Clefable is only 4HKOed by Mr. Mime's Psychic. It can also retaliate with paralysis, sleep, and heavy damage, with Body Slam followed by Hyper Beam KOing after minor chip damage. However, a Special drop from Psychic leaves Clefable KOed by Psychic, vastly worsening the matchup.</p> <p><strong>Revenge Killers</strong>: Mr. Mime's frailty means faster offensive threats often force it out, most of which are Fire-types. Arcanine and Ninetales are only 4HKOed by Psychic while threatening 2HKOs back with Fire Blast and Hyper Beam. While Moltres does not outspeed Mr. Mime, it is only 3HKOed by Thunderbolt 47.1% of the time, granting it an opportunity to set up Agility while threatening a 2HKO with Fire Blast in return. While it cannot switch in due to paralysis, Charizard is a notable example, outspeeding Mr. Mime to use Fire Spin effectively and threatening a 3HKO with both Fire Blast and Slash. While they also typically cannot switch in due to the threat of paralysis, other revenge killers such as Fearow, Electrode, and Raticate also outspeed Mr. Mime and threaten it with severe damage or paralysis.</p> <p><strong>Paralysis: Paralysis removes one of Mr. Mime's primary strengths in its Speed. This lets Pokemon it normally forces out like Nidoking and Blastoise overrun it with heavy damage. Paralysis from opposing Mr. Mime also makes navigating the mirror matchup tricky. A paralyzed Mr. Mime can make late-game scenarios much more inconsistent, such as not having fast Electric-type coverage to threaten a Kabutops that is standing in the way of Moltres.</p> <p><strong>Golem: Golem threatens a 2HKO with Earthquake, as well as Earthquake following Body Slam. Its ability to avoid a Psychic 2HKO and safely come in on attempted Thunder Wave and Thunderbolt from Mr. Mime accentuates this danger.</p> ",
    "sets": [
      {
        "name": "Offensive Utility",
        "description": "<h1>Set Description</h1> <p>Psychic threatens to 2HKO Nidoking, Venomoth, and Raticate, and 3HKO many notable Pokemon like Electrode, Rapidash, and Golem. Special drops and critical hits make it even more difficult to switch into consistently. Thunderbolt is Mr. Mime's strongest option against NU's many Water- and Flying-types, including Blastoise, Seadra, Poliwhirl, Charizard, Moltres, and Kabutops, 2HKOing or 3HKOing all of them. Thunder Wave cripples Wrap users, revenge killers like Charizard and Arcanine, and other Mr. Mime, making Mr. Mime a check to itself; you should think carefully before trading paralysis with the opponent's Mr. Mime, however. Seismic Toss is Mr. Mime's best attack against Psychic-types like Exeggcute, Drowzee, Abra, and itself.</p> <p>Threatening Water-types makes Mr. Mime suited to partner with Fire-types like Ninetales and Rapidash. Thunder Wave lets it support sweepers like Golem and Nidoking, crippling roadblocks like Poliwhirl and Seadra. Mr. Mime also appreciates these Ground-types for switching into opposing Mr. Mime's Thunder Wave. Mr. Mime also appreciates dedicated checks to itself like Clefable and Exeggcute, as opposing Mr. Mime is one of its greatest roadblocks. Mr. Mime can struggle versus faster Fire-types, so Blastoise is appreciated in order to check them and help absorb Fire Spin.</p> <p>Mr. Mime excels as a wallbreaker and sweeper. One of Mr. Mime's biggest strengths is its excellence against Pokemon like Nidoking and Blastoise, which other sweepers like Electrode and Kingler can struggle to handle consistently. Mr. Mime also has excellent utility in the earlier parts of the game, spreading paralysis and helping to check opposing Mr. Mime.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "pac", "user_id": 520967}], "teams": [{"name": "Quality checked by", "members": [{"username": "Plague von Karma", "user_id": 236353}, {"username": "S1nn0hC0nfirm3d", "user_id": 231074}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}, {"username": "CryoGyro", "user_id": 331519}]}]}
  },
  "Scyther": {
    "overview": "<p>Scyther has an array of applicable offensive tools in the NU metagame. Slash bypasses Pokemon relying on Reflect, such as Abra and some Clefable variants, while Swords Dance and Hyper Beam make it tough for Normal-neutral Pokemon to switch into. Scyther is also one of the fastest unboosted Pokemon in the metagame; it ties for the second-fastest Pokemon in the tier with Rapidash and has a superb critical hit ratio of 20.5%. Its already terrific Speed can be bolstered with Agility, meaning it cannot be pinned down by partial trappers and opposing Agility users like Dragonair and Moltres either. With adequate paralysis support and good prediction, Scyther can theoretically be used as a powerful late-game cleaner.</p> <p>However, Scyther has too many flaws to warrant a spot on most teams. Its low bulk and horrid defensive typing render many attackers able to 2HKO or even OHKO it. These include notable Pokemon such as Blastoise, Nidoking, Golem, and Kingler. Scyther's reliance on Speed means that even with Agility, it is severely debilitated by paralysis compared to other sweepers. It also has a barren movepool: besides the miserably weak Wing Attack, it only possesses Normal-type attacks, meaning Rock-types like Golem and Kabutops can easily switch in and make progress against it. Other fast sweepers, such as Mr. Mime and Electrode, can provide more offensive presence throughout matches, as they sport better coverage moves and provide utility with status moves like Thunder Wave. While Scyther can be used to lure its counters and grant switch-in opportunities for its teammates like Blastoise and Kingler, this tends to be prediction-reliant and inconsistent.</p> ",
    "sets": [
      {
        "name": "Double Dance",
        "description": "<p>Swords Dance makes Scyther's Hyper Beam one of the most threatening moves in the tier, always or possibly OHKOing Pokemon like Mr. Mime, Electrode, and Rapidash at +2. Agility allows it to outspeed the entire unboosted metagame, notably including Electrode and Rapidash, which usually threaten it out with super effective moves. If Scyther is paralyzed, Agility can also remove the Speed drop. Slash is its primary attacking move, almost always scoring a critical hit and punishing foes for switching into predicted Swords Dance, 3HKOing foes like Charizard, Poliwhirl, and Ninetales. Unfortunately, it does not get a power boost with Swords Dance.</p> <p>Scyther's shallow movepool leaves it with few other options. Agility is the most replaceable, as Scyther is already fast and does not need the additional Speed most of the time. Toxic discourages AgiliWrap Dragonair and Fire Spin users like Moltres, Charizard, and Rapidash from setting up on it. Unlike Slash, Double-Edge gets the power boost from Swords Dance and can be utilized if Slash's immediate power is not desired. Wing Attack can be used to damage Gastly, but not only is Gastly rare, Wing Attack also has lower damage than Slash even against super effective targets. Substitute can be used to ease prediction, rack up poison and burn damage, and fish for full paralysis and misses, such as against Fire-types like Charizard, Ninetales, and Moltres.</p> <p>As Scyther struggles to make headway against Rock-types like Kabutops and Golem, Grass-types like Exeggcute and Weepinbell are useful teammates. Scyther is also vulnerable to Fire-types like Ninetales, Rapidash, and Moltres, so Water-types like Kabutops and Blastoise to withstand Fire- and Rock-type attacks are also appreciated. Scyther can function as a lure for Rock-type Pokemon, which makes it easier for its partners like Blastoise and Kingler to predict an attack. Sleep inducers such as Poliwhirl and Venomoth can cripple Scyther’s counters and can facilitate setup opportunities. In turn, Scyther can come in on predicted Rest from Pokemon like Poliwhirl and Blastoise, enabling it to more easily break through the opposition.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "5Dots", "user_id": 543866}], "teams": [{"name": "Quality checked by", "members": [{"username": "pac", "user_id": 520967}, {"username": "Plague von Karma", "user_id": 236353}]}, {"name": "Grammar checked by", "members": [{"username": "CryoGyro", "user_id": 331519}]}]}
  },
  "Magmar": {
    "overview": "<p>Magmar stands out as an interesting Fire-type in RBY NU, trading the typical access to Fire Spin for an incredible movepool. With a multitude of fantastic attacks like Psychic, Submission, and Fire Blast, as well as many useful utility moves such as Body Slam and Counter, Magmar has a potential move to fit nearly every situation. This large movepool also makes it hard to predict, with the opponent forced to make tough decisions if not every move has been revealed. Its typing grants it some defensive utility versus the other Fire-types such as Moltres and Ninetales, as well as being fantastic offensively versus Grass- and Bug-types like Exeggcute, Venomoth, and Pinsir.</p> <p>However, Magmar is one of many Fire-types in the tier and is unfortunately mostly outclassed by more popular picks such as Arcanine, Charizard, and Ninetales. Lacking Fire Spin is unfavorable, as it's incredibly useful to freely pivot out from checks like Blastoise and maintain momentum. Arcanine also lacks Fire Spin, but it features much more favorable bulk. Magmar's movepool grants it better matchups versus the likes of Kabutops, but its middling stats still hold it back, and it often can't fit everything it needs to function consistently. Magmar is also physically frail, making Ground- and Rock-type Pokemon like Nidoking and Golem especially frightening foes to face.</p> ",
    "sets": [
      {
        "name": "Mixed Attacker",
        "description": "<p>Fire Blast is Magmar's strongest STAB move and has a useful 30.1% chance to burn, making potential checks like Kabutops less inclined to switch in. Seismic Toss is a decent neutral option, dealing consistent 4HKOes to bulky Pokemon such as Blastoise and Moltres. Submission most notably 3HKOes Kabutops, a Pokemon that many Fire-types like Arcanine can struggle with, while also 2HKOing Raticate and 3HKOing Clefable and Porygon. Psychic is able to 3HKO Nidoking and the rare Nidoqueen, which can be improved by Special drops. It also grants it a potential role as an effective Moltres check, threatening Special drops while taking little damage from Fire Blast. In addition to this, if Kabutops and Nidoking take a singular Special drop, Magmar can win the interaction cleanly. Body Slam makes use of Magmar's surprisingly decent Attack and can threaten paralysis against Pokemon like Mr. Mime, and Submission and Psychic nail resistant Pokemon like Golem.</p> <p>Magmar's wide movepool makes it pretty customizable. Counter can heavily punish Raticate, Clefable, and Pinsir for using their primary attacking moves, as well as any Pokemon using Body Slam as coverage. Hyper Beam is a viable alternative to Body Slam, letting Magmar more convincingly beat physically frail Pokemon—like Mr. Mime from a minimum of 48.4%. However, against some bulky threats like Blastoise and Moltres, it doesn't deal vastly more damage than Seismic Toss. Toxic firmly prevents Dragonair from sweeping with AgiliWrap if it attempts to use Magmar as setup fodder, as well as checking other wrappers such as Rapidash and Ninetales. Toxic can also be used to support wrapper teammates, increasing their net damage output when using their partial-trapping moves. Finally, Smokescreen possibly allows Magmar to beat Pokemon it otherwise would not, such as AgiliWrap sweepers. In addition to this, Smokescreen can reapply the foe's Speed drops from paralysis.</p> <p>Magmar is best used on teams that want the offensive threat of a second Fire-type alongside Charizard, but don't want the inconsistency versus Kabutops that Fire-types like Arcanine and Moltres can cause. Having multiple Fire-types can cause the team to struggle offensively versus other Water-types like Seadra and Blastoise, so checks to these such as your own Blastoise, Mr. Mime, and Electrode are appreciated. Blastoise is an especially good choice, as it also helps versus Golem, which Magmar can merely 4HKO with Seismic Toss and Psychic—while being OHKOed by Earthquake in return.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "pac", "user_id": 520967}], "teams": [{"name": "Earlier version by", "members": [{"username": "holly", "user_id": 508601}]}, {"name": "Quality Checked by", "members": [{"username": "Plague von Karma", "user_id": 236353}, {"username": "phoopes", "user_id": 96315}, {"username": "pac", "user_id": 520967}]}, {"name": "Grammar Checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Pinsir": {
    "overview": "<p>Pinsir is a frightening Swords Dance sweeper in RBY NU, possessing one of the highest power levels in the tier in the tier alongside Bind and Slash. Once set up, Pinsir goes on a rampage, quickly chipping down Pokemon with Bind before letting loose one of the strongest Hyper Beams in the game. Pokemon like Mr. Mime, Dragonair, Venomoth, Exeggcute, and Poliwhirl are even threatened with outright OHKOs at +2, while Blastoise and Clefable need minimal Bind chip damage to OHKO as well. Pinsir is by no means slow either, tying Nidoking and Seadra and getting the jump on Blastoise and Kabutops. When forming a core with wrappers such as Rapidash, Moltres, and Charizard, Pinsir can add some much-needed physical attacking prowess. With paralysis support from the likes of Mr. Mime, Venomoth, and Porygon, Pinsir can also sweep past otherwise faster checks like Charizard and Moltres.</p> <p>However, Pinsir's movepool is extremely shallow, making it linear and open to very simple counterplay, such as switching in Golem or even just having Counter. With the high viability of Fire-types in RBY NU, Pinsir's low Special also comes back to haunt it, leaving it OHKOed by even Charizard's Fire Blast and limiting setup opportunities against special attackers like Seadra. This special frailty means Pinsir is best used on teams populated by Water-types such as Blastoise and Kabutops, the latter with which actually competes heavily with it. That competition further extends to Kingler, which possesses similar qualities to Pinsir while having reliable counterplay to Rock-types in Crabhammer, as well as other Pokemon like Sandslash. However, it fares well alongside these Swords Dance users, and Bind can be enough for it to distinguish itself over them. Worse still, Pinsir's Speed, while good, is still not quite desirable; Fire-types revenge kill it, as do Venomoth, Fearow, and tier-king Mr. Mime. Its suboptimal Speed also makes paralysis even worse, exposing its fragility and making it very difficult to clean up even paralyzed teams. Regardless, Pinsir functions as an effective wallbreaker or sweeper, supporting top-tier Pokemon like Charizard very well in the metagame.</p> ",
    "comments": "<h1>Other Options</h1> <p>Pinsir can drop Bind for more offensive flexibility, but this makes it more of a momentum sink, forcing Pinsir to manually switch out against slower Pokemon if threatened with paralysis or heavy damage. Ergo, many teams have to use a deliberate game plan centered around strictly late-game usage for these sets to work. However, sets like Swords Dance / Hyper Beam / Body Slam / Submission provide Pinsir with alternative midground options once successfully switched in, more effectively contesting common switch-ins like Golem and Charizard.</p> <p>In terms of niche move choices, Pinsir has few that are justifiable because of its terrible movepool. Toxic is feasible for incapacitating Fire Spin users as they switch in, such as Charizard, Ninetales, and Moltres, but Body Slam is normally enough of a deterrent. However, it does come with the added bonus of piling chip damage on Rock-types when used alongside Bind. Seismic Toss is all Pinsir can muster for the very rare Gastly, but Bind can at least secure a safe pivot, and Seismic Toss is rarely helpful.</p> <h1>Checks and Counters</h1> <p><strong>Fire-types: All Fire-types in RBY NU, with the exception of Flareon, outspeed and mortally threaten Pinsir with Fire Blast and Fire Spin, namely Charizard, Ninetales, Rapidash, Arcanine, Moltres, and the rare Magmar. Even if Pinsir survives a Fire Blast from Rapidash or Magmar, it is still at risk of being burned and instantly fainting. However, if the Fire-types are paralyzed, Pinsir poses a serious threat, as a +2 Hyper Beam will KO any of them if they have taken minor damage prior.</p> <p><strong>Rock-types: If Pinsir lacks Submission, it can hardly scratch Rock-types like Golem and Kabutops, immediately losing momentum and having to pivot with Bind. If it does have Submission, however, Pinsir is capable of dealing massive damage, 2HKOing them at +2.</p> <p><strong>Paralysis: Pinsir needs foe paralysis to outspeed the faster threats of RBY NU and therefore despises taking it itself; ergo, faster paralysis users such as tier-king Mr. MIme, Venomoth, Electrode, and the rare Abra can force Pinsir out after it gets a KO. Clefable, Wigglytuff, and Porygon are also capable of absorbing hits from an unboosted Pinsir and paralyzing it in return. Body Slam is also common on a myriad of Pokemon, most commonly Clefable, Wigglytuff, Kingler, and some Blastoise variants, which can pose further risk. While Pinsir can threaten Clefable and Wigglytuff with Submission, it will take high recoil damage in the process, with the latter costing around a third of its health at +2. While Swords Dance can reapply the paralysis Speed drop on foes to help if Pinsir has been paralyzed, this is unreliable and leaves it open to attack.</p> <p><strong>Counter Users: Pinsir is the sole fully-evolved Pokemon that has no damaging moves that can circumvent Counter. This means that Pokemon such as Charizard, Blastoise, Poliwhirl, Clefable, and Wigglytuff can all pose a mortal risk to Pinsir by existing. This also makes Hyper Beam use somewhat risky, as a Counter user can switch in, stomach the hit, and hit Pinsir with Counter next turn for the KO. Pinsir can use Bind to bring Counter users down to Hyper Beam range and KO them, but this isn't always mathematically probable. Using Swords Dance to bait out an early Counter and KO the following turn is also possible, but very risky, especially against paralysis users Clefable and Wigglytuff. Consequently, Pinsir teams must scout for Counter early into a game.</p> <p><strong>Gastly: While rare, Gastly completely walls Pinsir. To even damage it, Pinsir requires Seismic Toss, which it cannot afford, and the only other attack that has any effect is Bind, which doesn't damage it but allows Pinsir to pivot into a check safely. In turn, Gastly can use Hypnosis uncontested or 4HKO Pinsir with Thunderbolt.</p> ",
    "sets": [
      {
        "name": "Swords Dance + Bind",
        "description": "<p>Swords Dance is Pinsir's claim to fame, allowing it to rapidly chip down teams with Bind before blasting them away with Hyper Beam. Swords Dance also ensures paralysis doesn't immediately ruin Pinsir, allowing it to reapply a foe's paralysis Speed drop and keep the momentum in its favor. For example, against a paralyzed Mr. Mime—a common sight after Mr. Mime have a mirror match—Pinsir can enter and set up, remaining faster despite Thunder Wave, and OHKO Mr. Mime with Hyper Beam the next turn. Pinsir's third moveslot is flexible; Slash provides immediate power for safer revenge killing than Hyper Beam, while the weaker Body Slam makes Pinsir more self-sufficient, spreading paralysis and being boosted by Swords Dance. Body Slam also strongly deters Fire Spin users such as Ninetales and Charizard, which otherwise switch in on Pinsir easily. Finally, Submission OHKOes Porygon and 2HKOes Kabutops and Golem at +2, which Pinsir otherwise struggles to break through, although the steep drop in consistency is a pain for it to deal with.</p> <p>Pinsir functions best late-game when it's not at risk of being paralyzed during its sweep. It's also strongly recommended to paralyze Fire-types like Charizard, Ninetales, and Moltres with teammates like Mr. Mime and Clefable; otherwise, Pinsir is easily revenge killed. Kabutops checks Charizard and can KO it outright while quadruply resisting Fire Spin, and it forms a strong physical attacking core with Pinsir that has decent defensive integrity. If not running Submission, Golem and Kabutops should also be removed, with Water-types like Blastoise being great against the former, as Pinsir has issues breaking through them. Pinsir can find switch-in opportunities against Rest users like Blastoise with Rest giving free turns for Pinsir to set up. Outside of this, Pinsir is a great switch-in to Earthquake from the likes of Pokemon like Nidoking; in this case, it can Speed tie Nidoking and either deal serious damage with Slash or gain momentum with Bind. Pinsir works well with fellow wrappers such as Charizard, sometimes alongside other Fire-types like Ninetales, as Pinsir can threaten Golem with Submission while having a wrapping move itself and a Ground resistance for pivoting.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Plague von Karma", "user_id": 236353}], "teams": [{"name": "Quality checked by", "members": [{"username": "S1nn0hC0nfirm3d", "user_id": 231074}, {"username": "pac", "user_id": 520967}, {"username": "Volk", "user_id": 530877}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Flareon": {
    "overview": "<p>With its powerful Fire Blast, enormous Attack stat, and great pivoting move in Fire Spin, Flareon is a destructive powerhouse. Its Attack stat is the highest in the tier, only tied with Kingler and the largely unviable Machamp. It also possesses a superb Special stat, with only Moltres and the rare Magneton beating it out. These stats make Flareon a menacing offensive threat, as well as a fantastic Fire Spin absorber from the numerous dangerous Fire-types of the tier, such as Moltres, Rapidash, and Ninetales. If paired with paralysis support, Flareon is capable of posing a significant threat to opposing teams.</p> <p>However, Flareon suffers from having low HP and Defense stats, struggling to withstand even neutral physical hits such as Kingler’s Body Slam and Kabutops's Slash. To make matters worse, it is the slowest Fire-type in the tier, being outpaced by numerous common threats such as Blastoise, Kabutops, and Nidoking, which need to be paralyzed for Flareon to have an impact. Sustaining paralysis itself cuts into what little Speed Flareon has, leaving it outsped by Clefable and Porygon. Flareon also faces massive competition from other Fire-types: Moltres possesses superior bulk, Charizard has better coverage, and Rapidash sports an amazing Speed stat. Lastly, despite its fantastic Attack stat, Flareon struggles to break through opposing Fire-, Rock-, and Water-types like Moltres, Golem, and Kabutops due to it lacking viable coverage besides Normal-type moves. Flareon is therefore a very rare sight in the metagame and is not recommended for most competitive NU teams.</p> ",
    "sets": [
      {
        "name": "Mixed Fire Spin",
        "description": "<p>Fire Spin racks up chip damage and allows Flareon to pivot to its teammates safely. Fire Blast OHKOes Exeggcute and Pinsir, 2HKOes Fearow, Venomoth, and Raticate, and potentially burns switch-ins like Kabutops and Golem. Hyper Beam is Flareon’s strongest physical attack, KOing Drowzee and Mr. Mime with some prior chip damage. Body Slam makes Flareon more difficult to switch into, spreading paralysis— this also enables Flareon to pivot out safely with Fire Spin.</p> <p>Flareon has a few other options to consider. Toxic cripples wrappers such as Dragonair and Rapidash. Quick Attack enables Flareon to finish off sufficently weakened foes and makes up for its low Speed stat. Tail Whip can discourage its counters from easily switching in, notably reapplying paralysis Speed drops on opposing Pokemon. Flareon appreciates paralysis support from the likes of Clefable and Mr. Mime, which gives it an easier time muscling through opposing Fire-types like Charizard, Ninetales, and Rapidash, as well as Water-types like Poliwhirl and Blastoise. Flareon also enjoys the chip damage other Fire Spin users, like Charizard, Rapidash, and Moltres, deal.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "5Dots", "user_id": 543866}], "teams": [{"name": "Quality checked by", "members": [{"username": "pac", "user_id": 520967}, {"username": "Plague von Karma", "user_id": 236353}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Porygon": {"sets": [{"name": "Standard"}, {"name": "Conversion"}]},
  "Kabutops": {
    "overview": "<p>Kabutops is a potent offensive Pokemon in RBY NU, featuring both Slash and Swords Dance to supplement its already strong Attack stat. The latter gives Kabutops the feared Swords Dance + Hyper Beam combination, allowing it to force its way through defensive staples like Arcanine and Blastoise, notably outspeeding the latter. With STAB Surf or Hydro Pump to supplement this, similarly to Kingler, Kabutops isn't hindered by Rock-type switch-ins. Unlike Kingler, however, Kabutops exchanges raw power for an excellent typing that leaves it undeterred by moves like Fire Spin, Fire Blast, Hyper Beam, and Explosion, giving it ample switch-in opportunities. This typing also opens the way for defensive sets, giving teams a much-needed backbone against the powerful offensive threats of the tier without squandering its own offensive potential.</p> <p>Unfortunately, Kabutops's typing comes back to bite it against Electric- and Ground-type attacks, which are reasonably common in RBY NU. This leaves it severely threatened by Mr. Mime, Electrode, and Nidoking and even reasonably checked by Earthquake Charizard and Golem. Kabutops's Speed is also just a bit below what would be desirable, letting offensive titan Nidoking outspeed it; this Speed also leaves it easily worn down alongside chip damage from Toxic. Its Special is also below average, worsening its Electric weakness and leaving its own special attacks noticeably weaker than those of its Water-type brethren. Naturally, this gives it fierce competition with other Water-types like Blastoise, Kingler, Seadra, and Poliwhirl.</p> ",
    "sets": [
      {
        "name": "Swords Dance",
        "description": "<p>Swords Dance Kabutops functions as a strong wallbreaker and late-game sweeper, exploiting Rest users in the tier like Blastoise, Arcanine, and Seadra with ease in combination with Hyper Beam. Its +2 Hyper Beam is very strong, OHKOing Mr. Mime and Raticate, as well as giving chances to OHKO Dragonair, Venomoth, Fearow, Electrode, Rapidash, and Porygon. Furthermore, +2 Hyper Beam can deal over 65% to Blastoise, one of the most important defensive Pokemon in the tier. If coming in on a predicted Rest, Kabutops is poised to either get a free Swords Dance boost or attack a potential switch-in with Body Slam or Slash. Between the two, Body Slam spreads paralysis while being boosted by Swords Dance, while Slash reduces reliance on Swords Dance but isn't boosted by it. Surf OHKOes Golem, 2HKOes Nidoking, and 3HKOes the rare Gastly, ensuring that foes don't exploit its Normal-type attacks.</p> <p>Kabutops shouldn't use Swords Dance immediately; it's best to score damage from Body Slam or Slash first and only use Swords Dance to close out the game, or if breaking through a wall is imperative at the time. Despite being a Swords Dance user, Kabutops can be useful throughout the game primarily thanks to its typing, as it exploits early-game Fire Spin from Pokemon like Charizard, Rapidash, Moltres, and Ninetales well. It often forces these Pokemon out, especially if they lack Toxic or Earthquake, which they need to hope to make progress against it. It's worth noting that Kabutops isn't too afraid of being burned, as Swords Dance boosts negate the Attack drop and Slash outright ignores them thanks to RBY critical hit mechanics; this resilience, coupled with its typing, makes it one of the best blockades against teams featuring multiple Fire-types. However, the passive damage does leave Kabutops easily worn down, especially because its mediocre Speed makes it susceptible to Fire Spin users.</p> <p>Outside of the given moves, Kabutops can be diversified a bit. Blizzard deals only a bit less damage than Surf but covers Exeggcute and Fearow, the former of which can sometimes be an obstacle to a sweep. However, losing super effective coverage for Fire-types and worsening the damage on Golem often makes it a less-than-stellar option. Submission is plausible coverage for Clefable, Wigglytuff, Porygon, and Raticate, but without recovery, the recoil damage often leaves Kabutops easily worn down. Conversion Porygon notably walls Kabutops if it lacks Submission, so the move can be justified on teams weak to it. Hydro Pump gives Kabutops a shot at 2HKOing Moltres and has higher damage across the board, but this utility rarely merits the accuracy drop.</p> <p>Swords Dance Kabutops fits best on teams that need a wallbreaker but can't afford the loss in defensive integrity that other users like Kingler, Pinsir, and Sandslash may cause. Fellow Water-type Pokemon like Blastoise, Seadra, and Poliwhirl appreciate the openings Kabutops can bring by removing opposing Water-types, making them very strong partners. Pinsir also appreciates the openings Kabutops can present while resisting Earthquake, giving the two strong offensive synergy. Nidoking makes a fine partner, switching in on Toxic, Thunder Wave, and Thunderbolt for free while not losing momentum, all moves that mortally threaten Kabutops.</p> "
      },
      {
        "name": "Rest",
        "description": "<p>Rest Kabutops gets the most mileage out of its nearly unique defensive typing, making it the strongest anti-Fire Spin Pokemon. Any combination of Slash, Body Slam, and Submission fills its physical attacking moveslots, with each giving it various perks; Slash gives the set much better offensive potential, Body Slam gives ample opportunity to spread paralysis thanks to Rest, and Submission lets Kabutops 2HKO Porygon, ensuring it isn't walled. Slash is particularly notable for this set, as it 3HKOes defensive behemoth Blastoise over a third of the time, forcing it to try and Rest stall or switch out. Surf provides the coverage to OHKO Golem and 2HKO Nidoking and Sandslash, all of which otherwise threaten Rest Kabutops.</p> <p>This variant sees more liberal use throughout the game than Swords Dance Kabutops, as Rest means it can heal off any damage accrued through sources like Fire Spin, Toxic, and switching in on resisted attacks. Furthermore, this set isn't opposed to taking paralysis, as it can often use Rest and successfully wake up multiple times a game. This resilience, especially given the abundance of Fire-type Pokemon and Normal-type attacks in RBY NU, makes it more of a defensive pivot for some teams. If running Body Slam, it should be used frequently, as its high paralysis chance makes switching into Kabutops very difficult; if it paralyzes a switch-in, Kabutops will frequently win the interaction outright.</p> <p>Rest Kabutops works best on teams that lack a defensive backbone, especially thriving against opposing Kabutops and teams spamming Fire-types. Ergo, it can work well alongside Venomoth, a Pokemon normally countered by lead Fire-types such as Charizard and Ninetales. Moltres also appreciates the presence of Rest Kabutops, providing pivoting potential and defensive synergy in return given its Ground immunity and high Special. Nidoking is a strong offensive partner, as it can switch in on Electric-type attacks and Toxic while threatening most of the tier with its own super effective damage thereafter.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Plague von Karma", "user_id": 236353}], "teams": [{"name": "Quality checked by", "members": [{"username": "pac", "user_id": 520967}, {"username": "Enigami", "user_id": 233818}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Moltres": {
    "overview": "<p>Moltres is a fearsome threat in RBY NU, with significant bulk, the tier's most powerful special attack in Fire Blast, and a decent Speed tier that ties Mr. Mime, Poliwhirl, and Venomoth. Moltres 2HKOes notable threats such as Mr. Mime and Nidoking, OHKOes Venomoth 74% of the time, and OHKOes Exeggcute, and it deals a significant chunk to most resistant switch-ins such as Golem and Water-types—barring Kabutops—while threatening to burn them. Fire Spin allows Moltres to chip down and pivot around its checks, Hyper Beam finishes off Fire-resistant threats, and various utility moves such as Reflect, Toxic, and Agility enable it to take on different roles, walling certain threats or sweeping late-game. Defensively, it brings Earthquake immunity and enough bulk to avoid a 3HKO from neutral attacks; even Charizard's Slash is a 4HKO, leaving Swords Dance-less sets unable to break Moltres.</p> <p>Despite its legendary status, Moltres suffers from the ubiquity of the pedestrian Fire / Flying type in Charizard, which can set up on standard Moltres freely. It's also hindered by the prevalence of teams stacking Fire- and Water-types, which leave it with few opportunities to truly unleash its Fire Blast. Fire / Flying is a flawed type combination, suffering greatly against Rock Slide and carrying common weakness; even if Moltres often avoids 2HKOs from Blizzard, Thunderbolt, and Surf, it'd rather not be weak to them at all. Fire Blast and Hyper Beam are Moltres's only real, strong attack options; both are just inaccurate enough to make it inconsistent and punishable. Utilizing Moltres means running a second Fire / Flying type alongside Charizard in a metagame full of Water- and Rock-types, and one where super effective moves abound. Despite this, its sheer stat total gives it a place on many teams as a terrifying damage dealer, bulky roadblock, or endgame sweeper.</p> ",
    "comments": "<h1>Other Options</h1> <p>Moltres generally lacks other move options. Although Fire Blast can't be dropped, one can combine its other moves in varying ways to meet different threats, such as running Hyper Beam on a Rest set. Double-Edge is an option, providing far more PP than Fire Blast or Hyper Beam, but fails to outdamage Fire Blast even on Fire-resistant targets, while Sky Attack's charge time is easy to maneuver around.</p> <h1>Checks and Counters</h1> <p><strong>Charizard</strong>: Charizard outspeeds Moltres and sets up Swords Dance freely, taking little from Fire Blast or Hyper Beam while 4HKOing with Slash or boosting up and KOing with +6 Hyper Beam. Moltres has counterplay in the form of Toxic + Reflect, which allows it to tank any Charizard set. Toxic whittles Charizard down, but running Toxic sacrifices valuable utility elsewhere and renders Charizard immune to paralysis, allowing it to simply switch out and return later.</p> <p><strong>Kabutops</strong>: Fire Blast might as well be Ember to Kabutops, and it resists Hyper Beam too, rendering Moltres entirely ineffective. It threatens to set up Swords Dance or retaliate with a number of 3HKO options, including Surf, Blizzard, Slash, and Hyper Beam, and it essentially ignores burn. While Moltres outspeeds it and can use Fire Spin to pivot out, a miss will be punished to the tune of 30-40% of Moltres's HP.</p> <p><strong>Golem</strong>: Golem takes Fire Blast easily, only having a 14% chance to be 3HKOed, and threatens to OHKO in return with Rock Slide 92% of the time. However, a burn significantly hampers Golem, so it must carefully consider the risk, especially if other options such as Water-types are available. If Moltres manages to apply burn, it can even freely set up Agility to reapply the burn Attack drop, making Golem's Rock Slide barely 4HKO.</p> <p><strong>Bulky Water-types</strong>: Blastoise takes Fire Blast well; Moltres needs to land three Fire Blasts and Hyper Beam to 4HKO, potentially missing in the process, while Blastoise is able to 3HKO with Surf. Less specially bulky options like Seadra and Kingler can check Moltres in a pinch, being 4HKOed and 3HKOed by Fire Blast while 2HKOing with their STAB options in return. However, they want to come in against a weakened Moltres due to their lower Speed and relative frailty. Poliwhirl takes quite a bit from Fire Blast normally, being 3HKOed like most other Water-types, but threatens the moves Hypnosis and Amnesia; this allows it to barricade Moltres almost as well as Kabutops while threatening significantly more damage in return, dealing minimum 77% with Hydro Pump at +2. Moltres gains little from winning the Speed tie.</p> <p><strong>Paralysis: A paralyzed Moltres becomes much easier to handle, outsped by its checks and less likely to land already inconsistent moves such as Fire Blast. Paralysis also creates many revenge killers such as Nidoking, Clefable, and Mr. Mime. While Moltres often runs Agility and can counteract the Speed loss, this does not prevent full paralysis from inhibiting its reliability.</p> <p><strong>Arcanine: While uncommon in the modern metagame, Arcanine is uniquely able to wall Moltres. Not only does it outrun Moltres, but it also shrugs off any move and can retaliate with Body Slam and Hyper Beam, targeting Moltres's weaker Defense and threatening paralysis. However, Rest Moltres sets can engage in a stall war with Arcanine, and Toxic sets often win in the long term as well.</p> ",
    "sets": [
      {
        "name": "Offensive",
        "description": "<h1>Set Description</h1> <p>This set leans on Moltres's huge damage output. Because NU tends to be fast-paced and lacking in recovery, nothing but Kabutops switches fearlessly into Fire Blast. A single hit leaves a number of foes in precarious positions. It puts Mr. Mime in KO range for Charizard's Hyper Beam and usually its Fire Blast, leaves Golem unable to safely switch into Charizard's Earthquake or Mr. Mime's Psychic, and leaves Poliwhirl in range of Mr. Mime's Thunderbolt, to name a few examples. Hyper Beam lets Moltres finish off Water-types after repeatedly taking Fire Blast, notably dealing 42% minimum to Poliwhirl and 35% minimum to Seadra; this damage can add consistency in securing KOs and allows a 3HKO on Seadra if Fire Blast burns. Fire Spin lets Moltres pivot out of threats such as Golem and Water-types and can provide crucial chip damage on a foe that is just out of Fire Blast range.</p> <p>The final moveslot allows Moltres to either threaten a sweep and shrug off paralysis via Agility, or create a headache for Charizard with Toxic; it can use Toxic plus Fire Spin to force Charizard to switch out rather than setting up, though this combination has dubious accuracy. Agility Moltres can also easily be saved for a late-game sweep, with teammates removing threats that can trade with or beat Moltres such as Water-types and Charizard. Then, Moltres can set up and potentially end the game, utilizing Fire Spin if necessary to earn crucial chip damage, though this is always risky.</p> <p>Moltres benefits from teammates that can cover its weaknesses; Blastoise matches up well against Fire- and Water-types, and Golem comes in on Fire-types that would otherwise exploit Moltres's poor coverage. Electrode is an offbeat option to exploit Water-types but leaves the team especially Golem-weak. Moltres also benefits from Mr. Mime and Clefable, which should be on every team, as both can typically remove key threats such as themselves or Kabutops.</p> "
      },
      {
        "name": "Defensive",
        "description": "<h1>Set Description</h1> <p>Defensive Moltres can annoy and weaken various threats that handle its offensive set well. Toxic wears down foes hoping to set up such as Charizard and Kabutops, especially in combination with Fire Spin, which wastes their turns as Toxic damage ramps up. However, remember that Toxic has 84.4% accuracy and Fire Spin has a horrid 69.5% accuracy, and this fast-paced metagame heavily punishes misses. Even without Toxic, Fire Spin still allows Moltres to harass burned foes or pivot out of threats. If running Toxic, Reflect is an option to stall out Charizard; Slash is only a 4HKO, and Hyper Beam does not 2HKO until Charizard boosts to +6. This means that Charizard has to spend several turns setting up followed by several turns to KO, usually forcing Charizard to switch out instead. This does not work against Kabutops, as Surf is a guaranteed 3HKO. Reflect additionally has utility in slowing down Nidoking and Raticate if set up in advance, though Nidoking can still 3HKO with Blizzard and Raticate can break through with Super Fang and critical hit Body Slam or Hyper Beam. Rest, of course, provides Moltres with recovery, though it is hard to wake Moltres up against most of the tier; it can attempt to do so against Charizard without Swords Dance, Clefable without Blizzard, Venomoth, Moltres, and the occasional Ninetales and Porygon, and it can switch in on Charizard's Earthquake, Fire Spin, and various Thunder Wave users.</p> <p>Moltres can enable double switches to catch foes as they attempt to switch into its Rest, getting Kabutops or Blastoise against Golem or Charizard. Reflect sets additionally benefit from setting up a Moltres versus Charizard endgame, surprising the opponent with an unexpectedly bulky Moltres as Toxic racks up damage; to this end, allies that are effective at trading one-for-one such as Nidoking, Golem, and Blastoise are beneficial.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Sabelette", "user_id": 583793}], "teams": [{"name": "Quality checked by", "members": [{"username": "phoopes", "user_id": 96315}, {"username": "Plague von Karma", "user_id": 236353}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}, {"username": "CryoGyro", "user_id": 331519}]}]}
  },
  "Dragonair": {"sets": [{"name": "Agility + Wrap"}]}
}