{
  "Raichu": {"sets": {"Sleeper": {}}},
  "Nidoqueen": {"sets": {"Sleeper": {}}},
  "Nidoking": {"sets": {"Lovely Kiss": {}, "Amnesia": {}}},
  "Clefable": {"sets": {"Amnesia": {}}},
  "Persian": {"sets": {"Standard": {}}},
  "Golduck": {"sets": {"Amnesia": {}}},
  "Alakazam": {"sets": {"Standard": {}}},
  "Victreebel": {"sets": {"Wrap": {}, "Swords Dance": {}}},
  "Tentacruel": {"sets": {"Wrap": {}}},
  "Golem": {"sets": {"Standard": {}}},
  "Rapidash": {"sets": {"Sleeper": {}}},
  "Slowbro": {"sets": {"Standard": {}}},
  "Cloyster": {"sets": {"Standard": {}}},
  "Gengar": {
    "overview": "<p>Gengar makes a name for itself in Tradebacks as the second fastest sleep inducer behind Persian, giving it a prominent role in the lead metagame, as it threatens every slower sleep-inducing lead in the game. Gengar is also the only relevant Ghost-type, letting it wall Persian after Sleep Clause has been activated, and pivot into strong Normal-type attacks from Snorlax and Tauros to let teammates such as Cloyster, Zapdos, and Snorlax come in more easily. Its typing also lets it catch Explosion from Cloyster, Exeggutor, Snorlax, and opposing Gengar. Its high Special allows it to deal solid damage with Thunderbolt and Ice Punch, and access to Explosion allows it to threaten walls and bulky foes like Chansey and Exeggutor. In addition, its 21.48% critical hit rate makes these offensive tools all the more dangerous.</p> <p>However, Gengar’s Poison typing, mediocre bulk, shaky accuracy with Hypnosis, and lower Speed relative to its threats all prove to be significant flaws that make Gengar somewhat unreliable. Its Poison-type allows Earthquake users and STAB Psychic users to greatly threaten it. Gengar also has reliability concerns as a sleeper, as its frailty combined with Hypnosis's 60% accuracy means it may fail to put a foe to sleep before it is KOed or forced to use Explosion. Tradebacks OU also features more strategies involving early paralysis spreading compared to OU. This also frustrates it, as Gengar's base 110 Speed is one of its greatest strengths, letting it outspeed otherwise much more threatening Pokemon such as Snorlax and Exeggutor.</p>",
    "sets": {
      "Standard": {
        "description": "<h1>Set Description</h1> <p>Hypnosis is necessary to facilitate Gengar’s role as a sleep inducer. Thunderbolt is Gengar’s primary attack, allowing it to put immense pressure on the Water-types of the tier. Explosion, despite coming off of a poor base 65 Attack stat, still manages to let Gengar remove or cripple threatening foes. It is used to break physically frail Pokemon, such as Jynx and Alakazam, who are usually OHKOed, as well as Chansey with prior chip damage. It can also gain momentum on slower threats such as Snorlax, Exeggutor, and Slowbro, as Snorlax and Slowbro cannot set up or Rest off damage if Gengar uses Explosion, instantly ending the turn. The remaining move is mostly a choice between Ice Punch and Night Shade. Ice Punch can flip matchups against Rhydon and Zapdos while scaring Exeggutor with a 2HKO if one hit is a critical hit or with Ice Punch followed by Explosion, and Ice Punch also threatens to freeze most switch-ins. Night Shade deals consistent damage to everything, mainly hitting Alakazam, which takes minimal damage from Gengar's other moves.</p> <p>Gengar’s unreliability in securing sleep makes a second sleeper strongly recommended, with Sing Chansey and Exeggutor as the most common partners. Gengar can also pair alongside a Snorlax with Lovely Kiss and use Explosion, then Snorlax can put something to sleep after the opponent has sacrificed their sleeping Pokemon. Gengar is most commonly run as a lead. If it can land Hypnosis, it can then be used to pressure Water-types and wall Physical Attackers lacking Earthquake, or it can be used as a sacrifice to the opposing sleep inducer. If Gengar cannot put something to sleep before being forced out, the backup sleep inducer can try to induce sleep later. Gengar's best opportunity to switch in to try to land Hypnosis is against Snorlax. It can either try to switch into an expected Body Slam or against a Snorlax confirmed to not be carrying Earthquake, which is more common than in OU. It can also switch into non-Amnesia Persian variants after a teammate has been put to sleep and get more chances at securing sleep.</p> <p>Psychic is a possible other option for Gengar's moveset as a strong Thunderbolt alternative with the ability to fish for Special drops. It 3HKOes opposing Gengar while hitting Chansey and Snorlax harder, but this leaves Gengar walled by Starmie and Alakazam. Confuse Ray can be used to prevent Chansey from healing and to generally increase the opportunities for luck. Counter can be used to catch switches if Gengar is brought in against something it forces out—for example, Gengar can utilize Counter's damage storing mechanics after a strong Normal-type hit or Explosion KO to inflict massive damage.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Tree69420", "user_id": 605413}], "teams": [{"name": "Quality checked by", "members": [{"username": "Stories", "user_id": 400664}, {"username": "Shellnuts", "user_id": 491544}, {"username": "Sabelette", "user_id": 583793}]}, {"name": "Grammar checked by", "members": [{"username": "Sabelette", "user_id": 583793}]}]}
  },
  "Hypno": {"sets": {"Amnesia": {}}},
  "Kingler": {"sets": {"Swords Dance": {}}},
  "Exeggutor": {"sets": {"Standard": {}}},
  "Rhydon": {"sets": {"Standard": {}}},
  "Chansey": {"sets": {"Reflect": {}, "BoltBeam": {}, "Counter": {}}},
  "Seaking": {
    "overview": "<p>With the addition of Swords Dance into its movepool, Seaking manages to function as a competent setup sweeper. With STAB Surf as an added bonus, it also blasts through common Hyper Beam switch-ins, such as Rhydon. Agility distinguishes Seaking from its competing Swords Dance users, as, even when paralyzed, it still poses a threat to sweep if the opposing team has been damaged. Once set up, Seaking can be a difficult Pokemon to stop, KOing frailer Pokemon such as Persian and Jolteon from over 75% HP with Hyper Beam. Seaking is decently sturdy as well, surviving two hits from Starmie's Thunderbolt and Alakazam's Thunder Punch a significant majority of the time, giving it more opportunities to set up than Kingler.</p> <p>However, Seaking has to use both Swords Dance and Agility to pose any threat to the opposition. With only Surf and a single physical attack in its attacking moveset due to this—most likely Hyper Beam or the middling Double-Edge—Seaking is not surpassingly rewarding either, struggling to break through bulky Pokemon like Reflect Chansey. It's also completely incapable of breaking through the common Gengar and is struck with Thunderbolt in return; the improved coverage of staples like Thunder Punch for Alakazam and Hypno does not help its case either. Seaking is rarely seen in Tradebacks OU by account of its committal nature and unexceptional reward, normally finding itself competing with Kingler, which, while lacking Agility, has far better damage output for the effort put in.</p>",
    "sets": {
      "Double Dance": {
        "description": "<p>Swords Dance raises Seaking's Attack to acceptable levels, letting Hyper Beam land guaranteed OHKOs against Jynx and Alakazam, while Agility allows it to outrun the unboosted metagame and ignore the Speed drop from paralysis. A +2 Hyper Beam can also KO Pokemon such as Persian, Rapidash, Chansey, Jolteon, and Hypno if around 20% damage has been dealt prior. At +4, Seaking can OHKO Chansey, Hypno, Starmie, and even Tauros a third of the time. Surf covers Rock-types such as Rhydon, as well as dealing around 25% to Gengar, while also serving as an attack without a drawback.</p> <p>Seaking's movepool is barren but does have other options worth exploring; generally, it should always use a Double Dance set, or it's outclassed by Pokemon like Kingler. Blizzard is a plausible alternative to Surf for the freeze chance and 3HKOing Exeggutor and Zapdos, but the damage is otherwise unimpressive and it fails to OHKO Rhydon. Double-Edge, while having less drawback than Hyper Beam, is weak enough to largely diminish Seaking's threat level once set up. Hydro Pump may seem enticing, but it isn't compatible with the event-only Swords Dance, defeating its purpose.</p> <p>Seaking should commit to boosting only when it is possible to sweep. +4 Attack is needed to OHKO most Pokemon in the tier, and +2 Speed is needed to avoid being revenge killed by faster unparalyzed Pokemon. This amount of setup is daunting, but achievable. Seaking's bulk can withstand two hits from almost everything besides Razor Leaf or very strong Thunderbolts. Taking paralysis is also normally inconsequential in the process; thanks to its setup-heavy nature, Seaking is efficient as reapplying foes' Speed drops from paralysis if an opposing team has been riddled with it. Once Gengar, Electric-types, and Razor Leaf users are eliminated or confirmed to be absent, and extra-bulky Pokemon like Snorlax have taken a little damage, a single free turn can be all the opening Seaking needs to complete the three turns of setup needed to sweep. Against slower teams, Swords Dance can be all that's necessary to break through slower, bulkier Pokemon in Hypno, Chansey, and non-Reflect Snorlax variants. To achieve optimal conditions for a sweep, Seaking should be paired with consistent sleepers such as Jynx and Exeggutor, and Reflect Snorlax to check opposing Snorlax. Seaking is overwhelmed by Gengar, Zapdos, Jolteon, and Electabuzz, so Jolteon can be a helpful partner to safely switch into their attacks, while Seaking in turn can check Ground-types like Rhydon in a pinch for Jolteon. Rhydon, Chansey, and Alakazam can also check these Pokemon by comfortably switching into Thunderbolt, though, depending on the coverage of those Seaking checks, these partners might struggle to consistently switch in.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Plague von Karma", "user_id": 236353}], "teams": [{"name": "Quality checked by", "members": [{"username": "Enigami", "user_id": 233818}, {"username": "Torchic", "user_id": 43049}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Starmie": {"sets": {"Standard": {}}},
  "Mr. Mime": {"sets": {"Hypnosis": {}}},
  "Jynx": {"sets": {"Standard": {}}},
  "Electabuzz": {"sets": {"Offensive": {}}},
  "Tauros": {"sets": {"The Bull": {}}},
  "Gyarados": {"sets": {"Standard": {}}},
  "Lapras": {"sets": {"Standard": {}}},
  "Vaporeon": {"sets": {"Growth": {}}},
  "Jolteon": {
    "overview": "<p>Jolteon stands out as one of the few Pokemon able to stop Zapdos's rampage, resisting its STAB moves while having the capacity to beat it one-on-one. Tradebacks gifts it Growth, making it a threatening setup sweeper as well. Otherwise, Jolteon remains largely the same: having the highest Speed just behind Electrode also gives it one of the highest critical hit rates in the game, standing at 25.39%, which distinguishes it as a strong special attacker. Crucially, this means it outruns tier king Tauros while threatening it with Thunder Wave, a trait shared with only Alakazam, Starmie, and the unviable Electrode. Thus, Jolteon will frequently get off uncontested paralysis that forces predictable plays out of the opponent, taking back momentum very quickly. Finally, Jolteon possesses useful physical coverage in Double Kick and Pin Missile, which gives it the potential to specialize in the matchup against Chansey or Exeggutor.</p> <p>However, much like Zapdos, Jolteon is also countered by Rhydon, which means teams featuring Jolteon will often come across similar weaknesses. Being weak to Ground also doesn't bode well for it, as it means Pokemon like Tauros can exploit it if it gets paralyzed, which frequently happens in the matchups Jolteon comes across. Jolteon is frail in general, taking significant damage from Body Slam. Its damage output outside of Thunderbolt is also quite meager and reliant on its critical hit rate, which makes Jolteon quite inconsistent. While Growth is a useful tool that can patch up Jolteon's power issues, it gives Jolteon four-moveslot syndrome, as it's forced to drop Rest and forfeit its ability to be a Zapdos answer as well as making it deathly afraid of Thunder Wave.</p>",
    "comments": "<h1>Other Options</h1> <p>Rest or Growth is usually Jolteon's most expendable move, though this forfeits either a consistent Chansey matchup or sweeping potential. Pin Missile is an inconsistent option to cover Exeggutor, but a lack of STAB, bad accuracy, and high damage variance mean that it can often fail and lead to a paralyzed or KOed Jolteon. If leading Jolteon, Pin Missile is recommended to ensure it doesn't let Exeggutor in early. Agility can be used to ignore the Speed drop from paralysis, but using Rest and switching out usually does the job fine in conventional game states. Body Slam helps Jolteon more consistently contest Exeggutor while spreading paralysis and damage at once, but its damage is pitiful. Thunder is a niche option to use alongside Thunderbolt, and it can OHKO Cloyster and 2HKO Alakazam and Snorlax at +1, but its unreliable accuracy makes it dubious.</p> <h1>Checks and Counters</h1> <p><strong>Exeggutor</strong>: Exeggutor dislikes facing Pin Missile, but without it, Jolteon can't fight Exeggutor at all, as it resists Thunderbolt and Double Kick. In return, Exeggutor can threaten Jolteon with STAB Psychic, Sleep Powder, and Stun Spore.</p> <p><strong>Rhydon</strong>: A Rhydon at full HP is the bane of Jolteon's existence, threatening an OHKO with Earthquake. However, Rhydon can't switch in repeatedly, as Double Kick deals 15.4% minimum and up to 33.8% on a critical hit. Once Rhydon is below half HP it is very uncomfortable having to switch in again.</p> <p><strong>Snorlax</strong>: Snorlax is a strong check to Jolteon if its running Earthquake, which 2HKOes, and even Body Slam threatens Jolteon with a 3HKO and paralysis. In return, unboosted Jolteon can only 4HKO Snorlax without critical hits. At +1 Jolteon falls just short of 2HKOing Snorlax from full, but it has decent odds of breaking through when factoring critical hits, and it can consistently beat Snorlax if it's under 90% HP.</p> <p><strong>Paralysis</strong>: Jolteon is a fragile, fast Pokemon, which makes it one of the Pokemon most debilitated by paralysis. Rest can remove the status, but Jolteon still needs to switch out to remove the Speed drop. Pokemon like Alakazam, Chansey, Zapdos, and Stun Spore Exeggutor all force non-Rest Jolteon out and majorly inconvenience Rest Jolteon. Starmie and Slowbro can also threaten paralysis if they're healthy and Jolteon hasn't set up Growth yet. However, Growth Jolteon can stay faster than its foes by reapplying the paralysis Speed drop.</p>",
    "sets": {
      "Standard": {
        "description": "<h1>Set Description</h1> <p>Thunderbolt is Jolteon's bread-and-butter, 2HKOing Pokemon like Cloyster, Starmie, Slowbro, and Lapras. Double Kick primarily targets Chansey, 4HKOing it; Jolteon is favored to break through with critical hits and it will eventually PP stall Soft-Boiled. Double Kick also targets Rhydon, chipping it moderately on entry and essentially preventing it from switching in when below 50% HP due to the risk of a critical hit. Thunder Wave lets Jolteon threaten Pokemon like Tauros and Persian, forcing them out and setting up a sweep for its teammates. Rest lets it consistently counter Zapdos and gives it a long-term advantage against Chansey. Chansey struggles to beat Jolteon even with Seismic Toss because two critical hits or repeated full paralysis are all Jolteon needs to beat it with Double Kick. However, Jolteon tends to let Tauros and other heavy hitters in once it uses Rest, so Jolteon requires careful play and use of double switches to prevent free entry for these threats. An alternative over Rest is Growth, which lets Jolteon assume the role of a setup sweeper. At +1, Jolteon 2HKOes foes like Persian and Tauros and OHKOes Water-types. However, this means losing out on Rest, which forfeits Jolteon's ability to switch into Zapdos and Chansey.</p> <p>If running Rest, Jolteon can remain hidden until either Zapdos reveals itself or a need to break through Chansey emerges. Jolteon finds entry routes on Zapdos and Chansey quite easily, particularly when they are disincentivized to click Thunder Wave, and it otherwise doesn't mind coming in via double switches. Alternatively, Jolteon can be used as a lead, aiming to paralyze whatever is in front of it and force the opponent to make a difficult decision out of the gate. This is especially effective support to physically attacking sleepers like Lovely Kiss Snorlax, as they greatly appreciate paralysis on Psychic-types and Chansey. However, Jolteon dislikes getting paralyzed early itself, and sleep leads can potentially disable it for the rest of the game. Rest Jolteon is best used on teams that are weak to Zapdos, namely those that stack Water-types. Thus, Cloyster, Starmie, and Slowbro all make valid partners. In return, they help stifle Rhydon's attempts to stop Jolteon. If running Growth, Jolteon shouldn't be used as a switch-in to Zapdos and Chansey and should reveal itself when a sweeping route has been established. Given that Chansey, Exeggutor, and Alakazam all pose issues for Jolteon, it enjoys support from sleepers like Lovely Kiss Snorlax, especially if it's running Growth. Exeggutor is also an excellent partner to Jolteon, being one of the most consistent Rhydon switch-ins in the game while also helping to break through the opposing team with Sleep Powder and Explosion.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Plague von Karma", "user_id": 236353}, {"username": "Gangsta Spongebob", "user_id": 535530}], "teams": [{"name": "Quality checked by", "members": [{"username": "Torchic", "user_id": 43049}, {"username": "Sabelette", "user_id": 583793}, {"username": "Shellnuts", "user_id": 491544}]}, {"name": "Grammar checked by", "members": [{"username": "Sabelette", "user_id": 583793}]}]}
  },
  "Porygon": {"sets": {"Bulky Support": {}}},
  "Aerodactyl": {"sets": {"Mixed Attacker": {}}},
  "Snorlax": {"sets": {"Sleeper": {}, "Reflect": {}, "Amnesia": {}}},
  "Articuno": {"sets": {"Sweeper": {}}},
  "Zapdos": {"sets": {"Agility": {}}},
  "Moltres": {"sets": {"AgiliSpin": {}}},
  "Dragonite": {"sets": {"Wrap": {}}}
}