{
  "Blastoise": {
    "overview": "<p>The poster child of Pokemon Blue has the stats and typing to make it the most reliable spinner in GSC UU. Blastoise's Speed tier, respectable Special Attack, and bulk mean that it is a viable answer to several of the tier's threats, most notably the omnipresent Nidoqueen. Access to Rapid Spin in a tier where such a trait is rare also boosts Blastoise's viability. It faces competition from Qwilfish and Omastar, two other viable bulky Water-types, but its access to Rapid Spin and its lack of a weakness to Ground differentiates it from its peers.</p>",
    "comments": "<h1>Other Options</h1> <p>Ice Beam can be used to surprise Jumpluff with a heavy hit and even has a chance to freeze on all non-Ice-type targets, though sacrificing a moveslot for this can be difficult, as Blastoise will struggle to perform its usual roles if any of its moves are replaced. However, you could forgo Rapid Spin, as Ice Beam and Surf give you perfect Sleep Talks against the likes of Nidoqueen and Sandslash. Toxic can be used to surprise Bellossom and Jumpluff, two checks to Blastoise that find it difficult to deal with status inflictions. Zap Cannon can be used to catch Pokemon that do not appreciate paralysis off guard, such as Scyther and Qwilfish, while also being a generally hard-hitting Electric-type attack, though the lack of PP and the accuracy of the move mean it is not much more than a gimmick. Reflect strengthens Blastoise against physical threats such as Granbull. Haze can stop the likes of Ancient Power Kabutops, Belly Drum Quagsire, and Growth Politoed from sweeping. Mirror Coat can be used to catch a Pokemon using an Electric-type attack by surprise. Counter can be used to take advantage of boosted Granbull and Scyther that may try to punch through Blastoise. Finally, Earthquake allows Blastoise to hit Electric-types and Qwilfish for super effective damage, but it is not usually used, as Blastoise with Sleep Talk has good long-term odds against Qwilfish, and the damage done by Surf can rack up over time against Electric-types.</p> <h1>Checks and Counters</h1> <p><strong>Electric-types</strong>: All Electric-types offensively pressure Blastoise with a hard-hitting Thunder, and aggressive play from these Pokemon with Spikes down can pressure it by forcing it to switch and take residual damage. However, Magneton, Pikachu, and Electabuzz cannot switch into Blastoise easily, as Surf 3HKOes the former and hinders the latter two because they are not Pokemon that typically use Rest. These Pokemon should also be careful of the rare Mirror Coat.</p> <p><strong>Chansey and Hypno</strong>: Chansey and Hypno can stalemate Blastoise with their high special bulk and set up Light Screen for teammates that would usually find difficulty in beating it one-on-one, like Granbull. They can also paralyze it with Thunder Wave and, in Chansey's case, damage it with Present. Blastoise can, however, take this as an opportunity to remove Spikes.</p> <p><strong>Setup Physical Attackers</strong>: Granbull safely 2HKOes Blastoise after a Curse, Victreebel walls Blastoise and can set up with Swords Dance, and Scyther threatens to Baton Pass an Attack boost to an ally along with being able to deal some decent damage itself.</p> <p><strong>Water-types that resist Water</strong>: Slowbro and Slowking wall Blastoise and, while Blastoise does have more PP thanks to Rapid Spin, can aim for Special Defense drops with Psychic or even to try to take it out with a critical hit, which Blastoise cannot reciprocate. Lanturn safely comes in and counters Blastoise, scaring it out with the threat of a STAB Thunder. If Blastoise does not have Roar, Politoed can set up with Growth or Belly Drum.</p> <p><strong>Grass-types</strong>: Grass-types like Victreebel, Jumpluff, and Bellossom check Blastoise well and can exploit the free turn generated by Blastoise's inability to do any meaningful damage to them. Victreebel can set up with Swords Dance, Jumpluff can use Encore on Blastoise and turn it into setup fodder, and Bellossom can deal a chunk of damage with Hidden Power Grass.</p>",
    "sets": {
      "Spinstoise (Rapid Spin)": {
        "description": "<h1>Set Description</h1> <p>Blastoise is highly regarded as the best spinner in the tier. Its ability to beat Qwilfish one-on-one with the longevity gained from Rest means that it can remove Spikes reliably in the long term. However, Curse Qwilfish or a well-timed critical hit can give it some trouble. Although Haunter can spinblock Blastoise, it does not appreciate a hard-hitting Surf that has a chance to 2HKO. Blastoise's Speed and respectably powerful Surf make it a viable counter to the Ground-types of the tier—even Thunder Nidoqueen. It also hits Pokemon with low Special Defense reasonably hard, like Granbull and Kabutops. Sleep Talk makes Blastoise less passive when asleep and lets it use Rapid Spin—mainly on Qwilfish—while asleep. Sleep Talk also allows Blastoise to play around status inducers and gives it better odds against Sandslash and Lovely Kiss Nidoqueen. Roar can be used instead as an emergency button against some of the setup Pokemon like Scyther and Granbull, but it means that Blastoise should be supported by a Heal Bell user like Granbull or Chansey to reduce the drawbacks of Rest without Sleep Talk.</p> <h1>Team Options</h1> <p>As the tier's best spinner and due to the defensive utility it offers, Blastoise finds relevance in making defensive teams work. Rapid Spin support reinforces the resilience of walls such as Slowbro and Hypno, greatly improving their performance as Nidoqueen checks. It also works well with sweepers that are difficult to wall in the long term, such as Belly Drum Quagsire, Growth or Belly Drum Politoed, and Swords Dance Pinsir. These can all work as standalone sweepers on defensive teams and use its teammates' defensive utility to wait for an opportunity to set up. Pokemon that can stomach hard-hitting Electric-type attacks, such as Nidoqueen, Ampharos, and Chansey, make good partners for Blastoise because they take away the burden of one of its weaknesses. All of these appreciate the removal of Spikes that Blastoise offers.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Diophantine", "user_id": 370164}], "teams": [{"name": "Quality checked by", "members": [{"username": "Earthworm", "user_id": 15210}, {"username": "Century Express", "user_id": 234737}]}, {"name": "Grammar checked by", "members": [{"username": "Rabia", "user_id": 336073}, {"username": "Astra", "user_id": 240732}]}]}
  },
  "Pikachu": {
    "overview": "<p>Pikachu is the mascot of Pokemon and glass cannons alike. With Light Ball, few Pokemon on traditional offense teams are able to reliably switch into it. It threatens the tier's numerous Water- and Flying-types, and, unlike other Electric-types like Ampharos, it has Surf to 2HKO Ground-types like Nidoqueen and Piloswine. Pikachu's Speed is quite good too, surpassing threats such as Qwilfish, Kabutops, and Gyarados while tying with Mr. Mime. As a result, Pikachu is one of the scariest Pokemon to give free turns, possibly only being outdone in this regard by the dominant Scyther. However, its atrocious bulk leaves it taking heavy damage from almost every attack and OHKOed by any STAB Earthquake. While Pikachu is very powerful, it can fail to significantly damage threats like Hypno, Chansey, and Ampharos, which can threaten it in return. It faces competition from other, more reliable Electric-types such as Electabuzz, which has much better bulk and Speed. Pikachu‘s reliance on Light Ball also means Thief completely ruins it, and, while its Speed is good, it's slower than threats like Dodrio, Scyther, and Haunter. Pikachu is inconsistent, but it is still capable of destroying teams.</p>",
    "comments": "<h1>Other Options</h1> <p>Encore is a very useful option for stopping setup sweepers and providing useful utility in general with Pikachu's good Speed, but it is unfortunately illegal with both Surf and Substitute. Pikachu can change its Hidden Power type, with Hidden Power Fire hitting Magneton hard and Hidden Power Grass OHKOing Quagsire, but these are usually less useful than Hidden Power Ice due to lower DVs and losing out on heavy damage against Gligar and Jumpluff. Thunder Wave can be used to spread paralysis, but Pikachu should largely be used to attack, and you're better off using a better paralysis spreader such as Jumpluff or Hypno. Pikachu can run Attract over Swagger; it should change its gender to female, since most Pokemon are male for higher Attack DVs. Unfortunately, this makes Attract fail against Nidoqueen and Chansey.</p> <h1>Checks and Counters</h1> <p><strong>Ampharos</strong>: Ampharos completely walls Pikachu thanks to its resistance to Thunder and great bulk, and it's also able to set up Light Screen for its teammates to switch into Pikachu more easily. It also runs RestTalk most of the time, meaning Sing won't do much to it.</p> <p><strong>Specially Bulky Pokemon</strong>: Chansey's huge special bulk makes it a very reliable Pikachu answer, and it can threaten Pikachu with Present. Chansey does have to be careful of a potential Sing, though. Hypno has a low chance of being 3HKOed by Pikachu's Thunderbolt, and it can either set up Light Screen or cripple Pikachu with Thunder Wave. Hypno is potentially 2HKOed by Thunder after Spikes, though, and Pikachu can break through variants without RestTalk.</p> <p><strong>Ground-types</strong>: Quagsire solidly checks Pikachu as long as it's not running the uncommon Hidden Power Grass, since Quagsire is a Ground-type not weak to Surf and OHKOes Pikachu in return. However, it is crippled by Sing. Nidoqueen, Sandslash, and Piloswine are also able to pivot in and OHKO Pikachu with Earthquake, but they are all 2HKOed by Surf. Generally, Ground-types don't have the longevity to check Pikachu long term with Spikes up.</p> <p><strong>Grass-types</strong>: Bellossom, Vileplume, and Victreebel resist Thunder and Surf and can threaten Pikachu with status and their attacks, but they are shaky checks due to their weakness to Hidden Power Ice. Jumpluff can ruin Pikachu with paralysis or sleep and use Encore to disrupt it before and after it uses Substitute, but it's hit very hard in return and is less consistent at switching in than other Grass-types.</p> <p><strong>Thief</strong>: Pikachu relies entirely on Light Ball to be viable, so Thief from Pokemon such as Mr. Mime, Scyther, and Electabuzz invalidates it.</p> <p><strong>Faster Pokemon</strong>: Pokemon such as Dodrio, Scyther, and Haunter don't want to switch into Pikachu, but they make effective revenge killers. Dodrio almost OHKOes Pikachu with Double-Edge, Scyther deals heavy damage with Hidden Power Ground, and Haunter can hit hard with Psychic while also threatening an OHKO with Explosion, or Destiny Bond if Pikachu is behind a Substitute. Electrode and Electabuzz resist Pikachu's Electric-type attacks and threaten it in return, with Electrode notably being able to set up Light Screen and threaten an OHKO with Explosion.</p>",
    "sets": {
      "Substitute": {
        "description": "<h1>Set Description</h1> <p>Substitute makes use of Pikachu's good Speed and punishes foes for using Sleep Talk or trying to pivot around Pikachu's attacks. Thunderbolt gives consistent damage and threatens Flying- and Water-types such as Scyther, Slowbro, Slowking, Blastoise, and Qwilfish. Alternatively, Thunder is incredibly powerful and has a chance to OHKO Slowbro, 2HKO Mr. Mime, and even 2HKO Hypno after Spikes, but its lower accuracy combined with Pikachu's fragility makes it quite risky. Surf crucially 2HKOes the very common Nidoqueen as well as Piloswine and Sandslash, three usually big roadblocks for Electric-types. Hidden Power Ice hits Grass-types such as Bellossom, Victreebel, and Vileplume, which otherwise wall Pikachu. Swagger synergizes very well with Substitute and other status conditions from teammates, letting Pikachu potentially break through certain foes it normally struggles to. Sing is also an option, and it can be game changing if it hits a foe such as Chansey or Quagsire, but it does have very poor accuracy. Pikachu is tough to switch in, often requiring carefully switching in on double switches or non-attacking moves.</p> <h1>Team Options</h1> <p>Pikachu is generally tough to fit onto teams due to its flaws and inability to break through certain foes. Its best fit is on offensive teams. Nidoqueen is a very good partner for Pikachu, as it can switch into and threaten most of Pikachu's usual checks such as Chansey and Ampharos, while Pikachu can threaten Water-types that trouble Nidoqueen. Spikes support from Qwilfish is also very useful, maximizing the pressure Pikachu exerts. Other powerful offensive Pokemon such as Scyther, Mr. Mime, and Haunter work with Pikachu to overwhelm opponents and fit well on offensive teams. In addition, Mr. Mime can cripple one of Pikachu's answers with Thief or Hypnosis, while Haunter can remove one of Pikachu's checks with Explosion. Rapid Spin support from Blastoise or Graveler is useful for removing Spikes, seeing as Pikachu can't hold Leftovers and will get worn down quickly by Substitute. Light Screen and Reflect support brings Pikachu into battle more easily, so Pokemon such as Hypno work well with it. Pikachu's bulk means it's not a good option for switching into STAB Surf from Water-types, so Pokemon that can come in and threaten them such as Mr. Mime, Ampharos, and Bellossom make good choices.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "dawnbuster", "user_id": 508601}], "teams": [{"name": "Quality checked by", "members": [{"username": "speedy55", "user_id": 12510}, {"username": "Century Express", "user_id": 234737}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}, {"username": "CryoGyro", "user_id": 331519}]}]}
  },
  "Nidoqueen": {
    "overview": "<p>Nidoqueen is the most dominant and centralizing Pokemon in GSC UU. It has an excellent typing and bulk; the former reduces the viability of the Electric types in the tier—such as Ampharos—while also granting immunity to both Toxic and Thunder Wave, and the latter allows it to pose a threat throughout the game with natural longevity. Nidoqueen’s movepool allows it to pack its own countermeasures for its supposed checks, and the ease of keeping Spikes on the field means that it is able to apply pressure to opposing teams fairly easily. Nidoqueen is most certainly the most commonly seen Pokemon, fitting on any playstyle with little or no drawback to using it.</p>",
    "comments": "<h1>Other Options</h1> <p>Thief is an option, but Nidoqueen generally gets more utility out of Lovely Kiss or Moonlight and the type-coverage moves, and Thief is also usable on other Pokemon such as Haunter and Electabuzz. An all-out attacking set is also a possibility with Ice Beam, Earthquake, Fire Blast, and Thunder, but again, the opportunity cost of missing out on Lovely Kiss or Moonlight is quite high. Roar is also an option, as Nidoqueen forces a lot of switches and can really rack up chip damage with Spikes support. Counter is incompatible with Moonlight but can be another option for luring in and punishing physical attacks such as Hidden Power Ground from Scyther and Return from Granbull.</p> <h1>Checks and Counters</h1> <p>There is not one counter to Nidoqueen, and it requires good teambuilding skills and outplaying to get around; however, there are some decent measures to it. Bulky RestTalk users such as Slowbro, Slowking, Granbull, and Blastoise all switch in and can threaten Nidoqueen while being able to restore any damage with Rest. Inflicting Nidoqueen with status such as sleep or paralysis are viable threats to it from Pokemon such as Jumpluff and Haunter. Gligar can take on Nidoqueen lacking Ice Beam, and Bellossom and Pinsir have a good matchup against non-Fire Blast variants but must watch out for Lovely Kiss. Qwilfish outspeeds and can 2HKO with Hydro Pump, but it cannot switch in and must risk sacrificing a lot of its HP one-on-one. Psychic-types such as Mr. Mime and Hypno also threaten Nidoqueen with both status and hard-hitting Psychic attacks. Lastly, bulky Ground-types such as Piloswine (against non-Fire Blast variants) and Quagsire can switch in and threaten Nidoqueen themselves.</p>",
    "sets": {
      "The Queen of UU (3 attacks)": {
        "description": "<h1>Set Description</h1> <p>Earthquake is Nidoqueen's necessary STAB attack, which allows it to be the threat that it is. Thunder is also necessary to nail the bulky Water-type pair of Slowbro and Slowking and is also very handy with its 30% chance to paralyze a Pokemon that is not a Ground-type (provided it hits). Nidoqueen's next coverage move allows it to punch through more checks and has a useful chance to either freeze or burn. Ice Beam hits Jumpluff and Gligar like a truck, whereas Fire Blast is useful for dealing even more damage to Bellossom and is a better option for winning against Scyther one-on-one—another dominant Pokemon in this tier. Lovely Kiss and Moonlight are not legally compatible with each other on Nidoqueen, so one must choose which utility option to run. Lovely Kiss is more commonly seen on hyper offense teams, as Nidoqueen can then spread status for itself or its teammates to plow through teams, whereas Moonlight is usually on other playstyles, as it improves Nidoqueen's longevity to allow the user to make some risky plays with the safety net of being able to recover.</p> <h1>Team Options</h1> <p>As said earlier, Nidoqueen is the most splashable Pokemon in the tier, so it is a useful teammate with any other Pokemon. There are certainly other Pokemon that, when paired with it, increase Nidoqueen's ability to dominate including Baton Passers such as Girafarig and Scyther that can pass on +2 Special Defense, Speed, and Attack boosts to prepare for a Nidoqueen sweep. Spikes support from Qwilfish is incredibly useful, as it allows Nidoqueen to punish the opponent for switching in, for example, their Slowbro to attempt to eat up an expected Earthquake. Of course, countermeasures for Psychic- and Water-types should be included when teambuilding, so Thief users and Electric-types are great at pressuring these such Pokemon. Psychic-types themselves are also good teammates for Nidoqueen, so Slowbro and the like are commonly seen paired with it because they cover the aforementioned weaknesses.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Diophantine", "user_id": 370164}], "teams": [{"name": "Quality checked by", "members": [{"username": "Earthworm", "user_id": 15210}, {"username": "Lavos", "user_id": 129513}]}, {"name": "Grammar checked by", "members": [{"username": "Astra", "user_id": 240732}, {"username": "Eien", "user_id": 100418}]}]}
  },
  "Wigglytuff": {"sets": {"Granbullytuff (Curse + RestTalk)": {}}},
  "Vileplume": {"sets": {"Defensive": {}}},
  "Victreebel": {"sets": {"Swords Dance": {}}},
  "Mr. Mime": {
    "overview": "<p>When looking for a fast lead that beats other common leads and can inflict status, one would be hard pressed to find a better choice than Mr. Mime. Access to a wide variety of status and disruption moves makes Mr. Mime one of the best utility Pokemon in the tier. It doesn't clown around offensively, either—its scarcely resisted STAB Psychic is complemented by a powerful Thunder that threatens common Water-types and offers near-perfect coverage. Unfortunately, Mr. Mime's low Defense and HP stats mean that it can't stick around to trade hits with many physical attackers, but its high Speed, terrific ability to disrupt foes, and respectable damage output solidify its status as one of GSC UU's best special attackers.</p>",
    "comments": "<h1>Other Options</h1> <p>Fire Punch is a decent coverage option for Magneton, which is the only Pokemon in the tier that resists both Psychic and Thunder. Mr. Mime's high Speed and solid damage output mean that it can make good use of Swagger alongside Substitute, especially if the foe has been paralyzed beforehand. This can potentially allow Mr. Mime to get past Pokemon it would otherwise have almost no chance to break through, although it is an option that can be risky to use against physical attackers. Counter is another option that Mr. Mime can use to deal surprising amounts of damage to Pokemon such as Scyther, Granbull, and Piloswine, although it requires Mr. Mime to take a heavy physical hit and relies on surprising the opponent to work. Nightmare can be used to help Mr. Mime break through bulky RestTalk users that it can't 3HKO such as Ampharos and Hypno, although it has limited use cases when compared with other options overall. Ice Punch allows Mr. Mime to 2HKO Jumpluff and Gligar, although it has limited use outside of hitting those two Pokemon hard, and Mr. Mime is not lacking in ways to deal with them. Meditate or even Curse could theoretically be used alongside Baton Pass, but with Swords Dance + Baton Pass Scyther available, it is difficult to justify using Mr. Mime for this role. Flash could be used to further disrupt a paralyzed foe, but it has unreliable accuracy and is largely inferior to Mr. Mime's other options for disruption like Encore and Swagger.</p> <h1>Checks and Counters</h1> <p><strong>Specially Bulky Pokemon</strong>: Pokemon with high Special Defense and HP such as Hypno, Ampharos, Chansey, and Lanturn take little damage from any of Mr. Mime's attacks and also tend not to mind the status effects Mr. Mime can inflict on them. Ampharos threatens Mr. Mime with its powerful Thunder, Hypno can inflict status on it and gradually wear it down, Chansey can threaten it with Present or status moves, and Lanturn can wear it down with its STAB attacks. However, Mr. Mime can lock them into an undesirable move with Encore, steal their Leftovers with Thief, or set up Reflect or Light Screen for a teammate against them.</p> <p><strong>Magneton</strong>: Magneton is the only Pokemon in GSC UU that resists both Psychic and Thunder. Its STAB Thunder comes close to 2HKOing Mr. Mime, and its RestTalk set has little fear of status. However, Mr. Mime occasionally uses Fire Punch, which comes close to 2HKOing Magneton.</p> <p><strong>Bellossom</strong>: Bellossom makes for a decent check to Mr. Mime, taking relatively little from its attacks and threatening it with status. However, it doesn't like getting paralyzed or put to sleep, can struggle to break Mr. Mime's Substitute, and is at risk of losing or being forced to switch if it gets locked into a move by Encore or gets fully paralyzed.</p> <p><strong>Bulky Phazers</strong>: Pokemon such as Piloswine, Arcanine, and Blastoise make for decent answers to Baton Pass Mr. Mime, as they can take a hit from it and remove any boosts or Substitute safely with Roar. Piloswine also threatens Mr. Mime with its STAB Earthquake and Arcanine can trade hits decently with Fire Blast or Crunch. However, they can be worn down quickly if they repeatedly switch into Mr. Mime's Psychic.</p> <p><strong>Physical Attackers</strong>: Mr. Mime is terrible at taking strong physical attacks. Pokemon such as Granbull and Piloswine aren't afraid of Thunder Wave, can take a hit from Mr. Mime, and can 2HKO it in return, although they can be quickly worn down by Psychic if Spikes are up. Other physical attackers such as Dodrio, Scyther, Pinsir, and Sandslash take heavy damage on the switch and fear status, but they can all 2HKO Mr. Mime with their powerful STAB attacks.</p> <p><strong>Encore Users</strong>: Pokemon such as opposing Mr. Mime, Jumpluff, and Kadabra make for decent checks to Baton Pass Mr. Mime, since they can lock it or its recipient into an undesirable move with Encore and take relatively low damage from its attacks. However, they fear status from Mr. Mime and Encore will fail if the last move used was Baton Pass, so in some scenarios they can be played around.</p>",
    "sets": {
      "Disruptor": {
        "description": "<h1>Set Description</h1> <p>This set works well as a lead, getting its team off on the right foot by inflicting status on the opposing Pokemon or else directly attacking foes it has a type advantage against, such as Nidoqueen and Qwilfish. Spreading Thunder Wave is helpful for both Mr. Mime and its teammates, crippling offensive threats and bulkier Pokemon alike. Ground-types, which are immune to Thunder Wave, take hefty damage from Mr. Mime's powerful STAB Psychic. Slowbro and Slowking, two common Pokemon that resist Psychic and don't mind Thunder Wave too much, are dealt with handily by Thunder. Mr. Mime's fourth moveslot can be customized to suit one's team. One of the most useful moves is Encore, which is effective at handling the many Pokemon in the tier that attempt to set up Attack boosts thanks to Mr. Mime's high Speed and can also work as a method of creating opportunities for a teammate to switch in. It works well with Thunder Wave against Scyther, which cannot afford to risk setting up in front of Mr. Mime due to the possibility of getting paralyzed and outsped and hit by Encore the following turn. Other options Mr. Mime can use include Light Screen and Reflect, which can be useful at setting up opportunities for other sweepers. Thief is another option that can be used without an item to make some of Mr. Mime's safer counters like Hypno and Chansey a lot less durable by stealing their Leftovers. Substitute has good synergy with Mr. Mime's status moves and can protect Mr. Mime from the foe's attempts to inflict status. Lastly, although it has poor accuracy, Hypnosis can be used over Thunder Wave—or even in the fourth slot for double status—to potentially cripple an opposing Pokemon with sleep, which can be devastating if it lands on a target that doesn't have Sleep Talk.</p> <h1>Team Options</h1> <p>Mr. Mime tends to be best suited for offensive teams and strategies due to its stat distribution. Electric-types such as Ampharos and Magneton are often used to check Mr. Mime, so Nidoqueen can make for a good teammate. Scyther also works well because it can make good use of the opportunities Mr. Mime creates with its support moves and can hit Pokemon like Hypno and Chansey hard. Mr. Mime can sacrifice itself to lock various attackers into moves a teammate resists with Encore, for example locking Granbull into Return for Swords Dance Kabutops or Piloswine into Earthquake for Scyther or Pinsir. Using setup sweepers with useful resistances is therefore a good idea. Another strategy that can be used is to bring Mr. Mime with Thief to take the Leftovers of the opponent's check to Mr. Mime and using a Kadabra as a secondary special attacker to finish the crippled foe off. Haunter is a great choice with Mr. Mime, as it checks mono-attacking Granbull and has several checks in common with Mr. Mime, allowing it to lure in a Mr. Mime check and eliminate it with Explosion. Finally, Qwilfish's Spikes are very handy in ensuring Mr. Mime's Psychic can pose a threat to Pokemon it hits neutrally like Ampharos and Granbull.</p>"
      },
      "Baton Pass": {
        "description": "<h1>Set Description</h1> <p>Mr. Mime's wide array of support moves makes it one of the tier's premier Baton Pass users. Although it cannot boost its Speed, it is very good at creating opportunities for its teammates. Thunder Wave is excellent for slowing down the foe and also synergizes with Substitute to buy free turns for Mr. Mime or a teammate. When equipped with a Miracle Berry, especially if it has been passed Speed boosts from Pokemon like Girafarig, Mr. Mime can come in on a status move, set up a Substitute to block the second attempt, and lock the opposing Pokemon into the ineffective status move with Encore. Encore can also be used to get a teammate the free turn it needs to set up and sweep. For example, a Slowbro locked into Surf may provide the opportunity for Politoed to set up Belly Drum, or an Electabuzz locked into Thunder might allow Quagsire to set up. Barrier allows Mr. Mime to supplement its low Defense and reduce the damage taken from Pokemon like Nidoqueen and Granbull, which can be crucial to finding an opportunity for a Belly Drum user to set up. Hypnosis can also be used to take care of any out-of-control threat, although it relies on very shaky accuracy. In order to deter phazers, it is important to have an attacking move. Psychic hits all phazers for decent damage and offers good general coverage, whereas Thunder's coverage is not as good but hits some Haze and Roar users, such as Omastar and Blastoise, harder than Psychic.</p> <h1>Team Options</h1> <p>Baton Pass Mr. Mime makes for an excellent addition to a Baton Pass chain. It is important that Mr. Mime is passed a Speed boost if being used on a Baton Pass chain due to Pokemon like opposing Mr. Mime, Kadabra, and Jumpluff, which otherwise threaten to outspeed it and lock it into a move with Encore. Girafarig is perhaps the best Speed passer in the tier, having few relevant weaknesses and access to Amnesia, as well as threatening coverage moves for Haze and Roar users. Another option is Scyther, although it poses less of a threat to Haze and Roar users if it does not set up Swords Dance before setting up a Speed boost. A third option is the rare Ariados, which has the unique quality of being able to Baton Pass Spider Web along with its Speed boost and can use Protect and Disable to block strong attacks and phazing moves. Spider Web Ariados, in particular, works well with Mr. Mime's Encore. In terms of recipients, Quagsire is the best Belly Drum user in the tier and is typically seen as the recipient of choice, although Poliwrath and Politoed have the advantage of access to Lovely Kiss alongside Belly Drum and lack an exploitable 4x type weakness. Quagsire's powerful STAB Earthquake is the most important factor that separates it from the others, as it allows Quagsire to OHKO almost any Pokemon that doesn't resist it after a Belly Drum. Pokemon that can set up dual screens for the Baton Pass chain are also welcome additions; the most commonly chosen option for this is Electrode, which can use Explosion to guarantee safe entry for the first Pokemon in the Baton Pass chain. Haunter is another common choice, as it checks Curse Granbull, which can be tricky to deal with for Baton Pass teams, and it can attempt to trade itself for a threatening foe with its Explosion.</p> <p>Baton Pass Mr. Mime does not have to be used on a dedicated Baton Pass team; it can work as a standalone Baton Pass user and simply pass Substitute or Barrier to Pokemon that appreciate it. Flimsy but powerful Pokemon such as Dodrio, Sandslash, Haunter, and Pikachu appreciate the protection and safe entry that Mr. Mime's Substitute passing affords them. Barrier is most appreciated by receivers that use other boosting moves such as Growth + Amnesia Politoed, but it can also be of use to Pokemon with good special bulk like Ampharos in helping to overcome their usual checks.</p>"
      },
      "RestTalk": {
        "description": "<h1>Set Description</h1> <p>Despite its mediocre physical bulk, Mr. Mime can make for a decent RestTalk user with its decent Special Defense, solid coverage, and ability to threaten common Pokemon like Nidoqueen and Slowbro. Psychic and Thunder are both necessary, as they allow it to pose a substantial threat to much of the metagame, with a few notable exceptions in Magneton, Chansey, and Hypno. This Mr. Mime set has much more flexibility in terms of what it can switch into, since it fears status a lot less. Its decent special bulk alongside RestTalk makes it possible for it to check many Psychic-types such as opposing Mr. Mime, Slowbro, Slowking, and Kadabra, despite many of them utilizing status moves. It should avoid coming in on Nidoqueen's Earthquake, but it can switch into Nidoqueen's other attacks without too much to fear and threaten a 2HKO with Psychic while only being 3HKOed by Earthquake in return. However, Mr. Mime should still try to avoid picking fights with powerful physical attackers such as Granbull, Dodrio, Scyther, Pinsir, and Piloswine unless absolutely necessary.</p> <h1>Team Options</h1> <p>RestTalk Mr. Mime can fit on both more offensively inclined teams and more balanced teams. Offensive teams value its ability to absorb status while still having solid damage output, and balanced teams appreciate that it provides defensive support without introducing passivity to the lineup. While it provides a degree of defensive support, RestTalk Mr. Mime is not reliable at holding back powerful Pokemon such as Ampharos, nor can it handle strong physical attackers. It is therefore a good idea to bring Nidoqueen, Piloswine, or Quagsire, as these Pokemon can typically withstand attacks from Electric-types. Ground- and Rock-types such as Piloswine, Sandslash, and Kabutops can be effective at handling Scyther, which is a major threat to Mr. Mime. Rock-, Steel-, and Ghost-types such as Omastar, Magneton, and Haunter are also very much appreciated as teammates due to Mr. Mime struggling against Granbull and Dodrio. Jumpluff is a fantastic catch-all for setup sweepers that may look to take advantage of Mr. Mime's lack of control while it is asleep. Mr. Mime's offensive presence can be bolstered by Spikes support from Qwilfish, which can help it get past bulkier foes.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Earthworm", "user_id": 15210}], "teams": [{"name": "Quality checked by", "members": [{"username": "Diophantine", "user_id": 370164}, {"username": "Century Express", "user_id": 234737}]}, {"name": "Grammar checked by", "members": [{"username": "deetah", "user_id": 297659}, {"username": "Lumari", "user_id": 232216}]}]}
  },
  "Feraligatr": {"sets": {"Offensive": {}}},
  "Ampharos": {
    "overview": "<p>Ampharos is an all-round solid Pokemon in GSC UU. Its bulk and typing allow it to sponge attacks from much of the tier, its powerful Thunders force many switches with the threat of heavy damage and paralysis, and it has several utility options that allow it to support its teammates. Ampharos is one of the few Pokemon that can safely switch into and create momentum against the likes of Slowbro and Slowking thanks to its great Special bulk. In addition, Ampharos is one of the biggest threats to many of the commonly seen Water-types of the tier such as Politoed and Gyarados. However, the most commonly seen Pokemon in the tier, Nidoqueen, completely dominates Ampharos, which can turn it into a liability at times. Nonetheless, this wholesome lighthouse keeper remains a threat to be considered, and it is very rare for a player not to gain any utility from having it on the team.</p>",
    "comments": "<h1>Other Options</h1> <p>It should be noted that if Sleep Talk is dropped, Ampharos loses some of its longevity as well as its ability to absorb status which is one of the reasons why Ampharos is so valuable. Furthermore, Nidoqueen counters Ampharos no matter the set. Thunder Wave can be seen as another option for a more consistent way to spread paralysis. Hidden Power Grass can be used to deal heavy damage to Quagsire, and Fire Punch can be used to hit Magneton and Piloswine for super effective damage. Body Slam is an option to fish for a paralysis to punish incoming Ground-type Pokemon that think they can switch in without risk. If Nidoqueen can be eliminated somehow, an all-out offensive set becomes more viable, which might use Dynamic Punch to hit Chansey alongside additional coverage moves.</p> <h1>Checks and Counters</h1> <p><strong>Nidoqueen</strong>: If Nidoqueen has Moonlight, it fears almost nothing from Ampharos, easily tanking its Hidden Power Ice on the switch and being under such negligible threat from Ampharos that it is free to toss out any coverage move it has to hit the predicted switch-in with little consequence if it guesses wrong. Its STAB Earthquake is a safe 2HKO against Ampharos, and the best Ampharos can hope to do in return is to set up a screen for a teammate to try to stop it.</p> <p><strong>Other Ground-types</strong>: Ground-type Pokemon are able to switch in on and threaten Ampharos with a powerful Earthquake, provided they avoid the coverage moves that would put a dent in them. Piloswine and Quagsire can also use Ampharos as a setup opportunity, though the latter must be careful of Hidden Power Grass. Gligar, Sandslash, and Graveler can also take advantage of Ampharos if it doesn't have coverage moves to hit them super effectively.</p> <p><strong>Opposing Ampharos</strong>: Opposing Ampharos can take advantage of an Ampharos that does not have a screen to set up a screen of their own or try to PP stall it.</p> <p><strong>Chansey</strong>: Chansey easily shrugs off any of Ampharos's special attacks and can set up a screen, threaten it with Present or Curse-boosted Double-Edge, or cure its team's status inflictions with Heal Bell.</p> <p><strong>Grass-types</strong>: Bellossom and Vileplume can switch into Ampharos not carrying Hidden Power Ice or Fire Punch and threaten it with a Leech Seed to force it out and spread status. However, these Pokemon do not possess an Electric immunity and thus run the risk of being paralyzed when they are thrown into Ampharos.</p>",
    "sets": {
      "Heart of the Lighthouse (Sleep Talk)": {
        "description": "<h1>Set Description</h1> <p>The combination of Ampharos's offensive and defensive presence, coupled with it only needing one attacking move to pose a threat, means that it is a great candidate to use RestTalk. Thunder is the obligatory Electric-type attack and has a 30% chance to inflict paralysis, provided it hits. Thunderbolt can be used instead for greater accuracy in exchange for less power and paralysis probability. As Nidoqueen is omnipresent in the tier, it is necessary for Ampharos to have a second move that is guaranteed to gain some utility if Nidoqueen inevitably switches in. The most commonly seen moves that fit this criteria are dual screens and Hidden Power Ice. The screens make pivoting around Nidoqueen much easier, while Hidden Power Ice chips it down. Light Screen allows Ampharos to take on powerful special attackers like Mr. Mime and Politoed more reliably, while Reflect improves its matchup against Granbull. Hidden Power Ice is also useful coverage to chip Grass-type Pokemon as they switch in and deals a considerable chunk of damage to Gligar. RestTalk grants Ampharos longevity so that it can sponge hits and dish out attacks more consistently while also reducing the disadvantages caused by status inflictions.</p> <h1>Team Options</h1> <p>Ampharos's weakness to Earthquake means that Pokemon that are not weak to Ground and can pivot around Nidoqueen such as Granbull, Blastoise, Bellossom, Gligar, and Slowbro make suitable partners for it. Granbull is particularly well suited to pairing up with Ampharos, as none of Nidoqueen's possible attacks can 3HKO it. Offensive Pokemon such as Scyther, Dodrio, and Pinsir appreciate the protection that Light Screen offers, as they become a lot more difficult to check. Slowbro especially enjoys Light Screen being set up, as it allows Slowbro to safely come in on Nidoqueen without fear of being defeated by a Thunder on the predicted switch.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Diophantine", "user_id": 370164}], "teams": [{"name": "Quality checked by", "members": [{"username": "Earthworm", "user_id": 15210}, {"username": "Century Express", "user_id": 234737}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}, {"username": "Rabia", "user_id": 336073}]}]}
  },
  "Bellossom": {
    "overview": "<p>In a metagame full of Water-, Ground-, and Psychic-types, Bellossom's mono-Grass typing, ample defensive stats, and access to a wide variety of support moves allow it to twirl its way into a niche of its own. It stands out by checking a wide array of threats that have very few reliable answers, such as Electabuzz, Nidoqueen, Slowbro, and Quagsire. It is also an awkward Pokemon to switch into owing to its access to Stun Spore and Sleep Powder, and it can force switches with Leech Seed or Swords Dance to spread these status afflictions to more foes. This strong ability to spread status helps cement Bellossom's status as one of the premier support Pokemon in the tier. However, while it performs well as a supporter, Bellossom is lacking in both good STAB attacks and coverage attacks, and thus its damage dealing ability is quite limited. Furthermore, being a Pokemon that relies on instant recovery, it is particularly susceptible to status, a weakness that very often leads to its downfall.</p>",
    "comments": "<h1>Other Options</h1> <p>Bellossom can make reasonably good use of Reflect to help its teammates switch into powerful physical attacks or set up without fearing a strong response from a physical attacker. However, supporting its teammates with paralysis or sleep tends to be the more effective option. Giga Drain can be considered as a STAB option alongside Leech Seed or Hidden Power Ice, but it is fairly weak, only has 8 PP, and can leave Bellossom helpless against foes such as Substitute Sandslash. Bellossom can also drop its recovery move to fit in an additional coverage or support move, but this should only be done on fast-paced teams because it will sharply reduce Bellossom's longevity.</p> <h1>Checks and Counters</h1> <p><strong>Granbull and Chansey</strong>: Granbull and Chansey take little from Bellossom's STAB attacks and can undo all of Bellossom's hard work spreading status with Heal Bell. Chansey needs to beware of Sleep Powder and Swords Dance variants, but it has access to Present and a wide array of status moves with which it can cripple Bellossom. Granbull also poses a significant threat to Bellossom with its powerful Return, dealing up to 50% unboosted, and Curse variants are even more dangerous, although they can potentially be forced out with Leech Seed.</p> <p><strong>Magneton and Ampharos</strong>: Magneton and Ampharos, particularly RestTalk variants given they are less concerned about status, are difficult for Bellossom to deal with. Magneton resists most of Bellossom's attacks, outspeeds it, and threatens it with Hidden Power Ice or Hidden Power Fire, but it becomes a less reliable answer if Bellossom has Hidden Power Fire or Hidden Power Ground. Ampharos similarly outspeeds Bellossom and beats it in the long run with Hidden Power Ice or Fire Punch. Both Magneton and Ampharos can also typically fish for paralysis against Bellossom with Thunder if they are lacking Thunder Wave. Magneton also runs Substitute occasionally, which allows it to block status from Bellossom.</p> <p><strong>Poison-types</strong>: While Qwilfish despises paralysis and should be wary of Sleep Powder, it can use Bellossom as an opportunity to set up Spikes and can force it out with the threat of STAB Sludge Bomb. Other Poison-types such as Crobat, Victreebel, and Haunter also pose a threat to Bellossom, the former two with their super effective STAB attacks and Haunter with Explosion. Haunter is particularly good against mono-attacking variants of the Swords Dance set. However, all of these Pokemon are very much dependent on their Speed to perform their roles effectively and must be prepared to sacrifice this if they are considering switching into Bellossom.</p> <p><strong>Hypno</strong>: While Hypno struggles to take Bellossom down, with RestTalk it can easily absorb Bellossom's status inflictions and potentially inflict status with Thunder Wave or run Bellossom out of recovery PP. However, it must also beware of being used as setup fodder when affected by Leech Seed or against Swords Dance Bellossom variants.</p> <p><strong>Scyther and Pinsir</strong>: Scyther and Pinsir have powerful STAB attacks that hit Bellossom super effectively. They both typically struggle with status but still pose a significant threat to Bellossom while paralyzed, potentially OHKOing it after boosting their attack with Swords Dance. RestTalk Pinsir is particularly problematic, as it can use Bellossom as setup fodder.</p> <p><strong>Dodrio</strong>: Dodrio typically doesn't have many opportunities to switch in freely throughout a game, but Bellossom is one of the few Pokemon Dodrio can switch into without taking a hefty chunk of damage. It does risk getting paralyzed or put to sleep, but RestTalk variants won't mind too much. Once it has come in, any STAB attack will deal hefty damage to Bellossom that it won't be able to withstand for long.</p> <p><strong>Status and Secondary Effects</strong>: Unlike many other defensive Pokemon, Bellossom cannot cure itself of status, which makes it particularly susceptible to moves like Thunder Wave and Stun Spore. Pokemon like Slowking with Thunder Wave can cripple Bellossom despite the typing disadvantage. In addition, Bellossom is commonly depended upon to switch into Pokemon like Nidoqueen and Electabuzz that can deal a chunk of damage to it but fail to 2HKO it. It commonly switches into moves like Thunder, Psychic, Fire Blast, Ice Beam, and Ice Punch, all of which have secondary effects that can make Bellossom unable to fulfill its usual defensive roles if they activate. Moreover, if Bellossom takes too much damage on the switch, it will often have to spend the next turn recovering, which can provide another opportunity to Pokemon wielding these moves to fish for secondary effects that will allow them to bypass Bellossom.</p> <p><strong>Fire-types</strong>: While Fire-types are fairly uncommon in the metagame, Pokemon like Arcanine and Magmar deal upwards of 70% to Bellossom with STAB Fire Blast, although they must beware of status moves.</p>",
    "sets": {
      "Standard Supporter": {
        "description": "<h1>Set Description</h1> <p>Bellossom aims to spread status and force switches with this set. With adequate defensive stats and useful typing, Bellossom has no trouble finding opportunities to switch in, from which point it can spread paralysis with Stun Spore or put something to sleep with Sleep Powder. Leech Seed is a solid option for Bellossom, as it forces most foes to retreat, which can allow Bellossom to target additional foes with Stun Spore. Should resilient foes such as Hypno aim to prevent Bellossom from spreading status by staying in, they make for easy opportunities for Bellossom's teammates to set up boosts. Bellossom has a couple of alternatives for its STAB attack; Hidden Power Grass is perfectly accurate and has a decent Base Power but requires Bellossom to sacrifice HP DVs, whereas Razor Leaf is a weaker option that is not obtainable on the same set as Leech Seed but has no major drawback. If Bellossom uses Razor Leaf, this frees up Hidden Power to be used as a coverage attack. Hidden Power Ice or Hidden Power Fire can be used to hit foes such as Scyther, Dodrio, Magneton, and opposing Grass-types that would wall Leech Seed Bellossom, such as Jumpluff and Victreebel, super effectively. Scyther is particularly dangerous due to its access to Swords Dance and Baton Pass, so these options can be useful to deter it. The choice between the two comes down to a couple of factors; Hidden Power Fire hits the more common Magneton hard but requires the sacrifice of a substantial amount of HP due to DV requirements, whereas Hidden Power Ice can threaten Dodrio. However, even hitting super effectively, Bellossom's damage output is rather underwhelming, so Leech Seed is the preferred option. Moonlight is a strong recovery option with no major drawback that provides Bellossom with a moveslot advantage over RestTalk users such as Hypno and Slowking.</p> <h1>Team Options</h1> <p>Bellossom makes for an excellent support Pokemon to a wide variety of offensive Pokemon. Setup sweepers such as Pinsir, Curse Granbull, Sandslash, and Quagsire can strongly benefit from having their checks paralyzed before they attempt to set up. Pokemon that can effectively use Substitute such as Pikachu, Mr. Mime, and Sandslash also become more threatening if foes have been paralyzed by Bellossom. Defensively, Bellossom finds it helpful for Granbull to be safely checked, so Omastar, Haunter, and Magneton make for useful teammates. Omastar in particular has solid defensive synergy with Bellossom, as Bellossom can handle some of the Electric-types, bulky Water-types, and Ground-type attacks that often target it. As Bellossom lacks Rest to cure status effects, Heal Bell Granbull can be a very useful teammate. Granbull also relieves Bellossom against a potential Fire Blast Nidoqueen, which comes quite close to 2HKOing Bellossom and is therefore dangerous to deal with. Blastoise is another teammate that is useful in this regard while also providing Rapid Spin support. Furthermore, Blastoise easily withstands the tier's few special STAB attacks that hit Bellossom super effectively, such as Piloswine's Ice-type moves and STAB attacks from Fire-types, giving the pair great synergy. If Bellossom can paralyze Qwilfish, not only will sweepers like Pinsir and Sandslash have a much easier time, but Blastoise will also find it easier to keep Spikes off the field and keep Qwilfish under pressure to stop it from firing off attacks. Ideally, Bellossom does not want to have to deal with Electric-types that often sport Ice- or Fire-type coverage; Ground-types that can shrug off Ice- and Fire-type attacks such as Nidoqueen, Quagsire, and Piloswine can assist with patching this weakness. As Scyther and Pinsir are dangerous sweepers and threaten an OHKO on Bellossom after a Swords Dance, it is useful to have Flying-types such as Crobat, Gligar, Gyarados, and Scyther to help deal with them; Crobat reliably prevents Scyther from passing Swords Dance boosts; Gligar checks both adequately and, alongside Bellossom, makes for a combination that can take on most Nidoqueen reliably, as it can wall Fire Blast variants safely; Gyarados threatens both with STAB Hidden Power Flying and has access to Roar to prevent Scyther from passing boosts; and Scyther makes for a decent Pinsir check and can help finish off a weakened, paralyzed opposing Scyther safely. Finally, as Bellossom can force switches effectively, Spikes from Qwilfish can be useful to punish foes switching in.</p>"
      },
      "Swords Dance": {
        "description": "<h1>Set Description</h1> <p>The goals of this set are two-fold: spread paralysis to foes beyond just passive RestTalk users and turn Bellossom into a damage-dealing threat rather than relegating it to a purely supportive role. With Swords Dance to boost its attack, Bellossom can topple some of its usual status absorber checks like Hypno and Ampharos, as, despite their impressive bulk, they cannot withstand boosted physical attacks for long. This buys Bellossom an opportunity to either attempt to take something down with its physical move of choice or land crippling paralysis on a more desirable target with Stun Spore. Return is the standard attacking option and comes without any drawback, although Double-Edge grants Bellossom enough power that it can cleanly 2HKO Scyther and Dodrio after using Swords Dance, albeit at the cost of taking recoil. Crafty opponents will realize that this physical threat comes at the cost of possible coverage attacks and potentially wall Bellossom with Omastar, Haunter, or Magneton. While the standard choice for a fourth move is to take advantage of Bellossom's healing moves like Moonlight, which allows Bellossom to play a defensive role alongside its offensive strategy, an alternative option is to forgo reliable healing and take a more offensive route by choosing Giga Drain, which allows it to remain effective against Slowbro and Slowking and OHKO or come close to OHKOing Omastar, Kabutops, and Graveler. Another alternative is Hidden Power Ground, which allows it to OHKO Magneton all of the time and Haunter about half of the time after a Swords Dance boost. Should this more offensive route be chosen, Bellossom will require a much greater amount of support from its teammates and will not reliably be able to check foes like Electabuzz and Nidoqueen as it usually can. In contrast, with Moonlight and Stun Spore, Bellossom retains much of its usual defensive efficacy and makes for an excellent supporter, especially for Normal-types such as Granbull, Dodrio, and Lickitung. Whereas more passive sets such as those with Leech Seed are well suited to reactive play, this set benefits more from playing aggressively to force reactive play from opponents, which will lead to Bellossom being in a better position to spread status without risking taking heavy hits from foes such as Qwilfish and Scyther.</p> <h1>Team Options</h1> <p>Swords Dance Bellossom makes for a great addition to a paralysis-based offensive team. Its knack for spreading paralysis to Normal-resistant Pokemon makes Pokemon like Hidden Power Ground Granbull and Dodrio even more difficult to deal with. Other foes that Swords Dance Bellossom tends to be able to target with Stun Spore include Qwilfish, Scyther, and Nidoqueen. Setup sweepers such as Kabutops, Pinsir, Victreebel, and Politoed greatly appreciate these Pokemon being paralyzed, as their sweeps are often cut short by these foes. Teammates that generally appreciate paralysis, such as Belly Drum Quagsire, Belly Drum Politoed, Substitute Pikachu, Substitute Sandslash, and Substitute Mr. Mime, are also good choices for teammates. As Bellossom struggles to beat Curse Granbull due to it accruing Defense boosts, teammates such as Haunter and Magneton also make for sensible choices. Omastar can also be solid choice for this purpose despite its tendency to feature more often on defensive teams, as it is capable of running a more offensive set with Thief or Ancient Power to increase its threat level. As Swords Dance Bellossom often lacks Grass-type STAB attacks, assistance in taking on Ground-types such as Piloswine, Nidoqueen, and Sandslash is appreciated; bulky Water-types such as Slowbro and Blastoise make for good choices in this regard and can also double as status absorbers. Despite being known primarily for their defensive prowess, these bulky Water-types also have substantial damage output that is enough to scare out many offensive Pokemon that Bellossom has inflicted with paralysis.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Earthworm", "user_id": 15210}], "teams": [{"name": "Quality checked by", "members": [{"username": "Century Express", "user_id": 234737}, {"username": "Diophantine", "user_id": 370164}]}, {"name": "Grammar checked by", "members": [{"username": "Rabia", "user_id": 336073}, {"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Jumpluff": {
    "overview": "<p>Jumpluff is one of the best support Pokemon in UU, since it is one of the fastest Pokemon in the tier and carries a lot of utility moves. Its access to Encore lets it stop many of the setup sweepers in the tier, like Scyther and Quagsire. Its useful typing also makes it an awesome pivot against a variety of threatening Pokemon. However, its lack of offensive options means that it can be quite passive, and its mediocre bulk means that it cannot take many hits without being forced to use Synthesis, so it can be forced out with some offensive pressure.</p>",
    "comments": "<h1>Other Options</h1> <p>Jumpluff can run a RestTalk set, which lets it shrug off status ailments more easily. However, if it uses such a set, it will have a hard time using the proper move at the right moment, making its utility less reliable; it also wants to have the other utility moves over Rest and Sleep Talk. Another option Jumpluff could use is Toxic, which would help it take down Bellossom and force some RestTalk users to use Rest earlier.</p> <h1>Checks and Counters</h1> <p><strong>Status-Inflicting Moves</strong>: Jumpluff dislikes any status whatsoever due to the fact that losing its Speed or being asleep pretty much nullifies its usefulness. Therefore, any unexpected moves that can inflict status on it will make it really hard for it to get back in action, unless you're running a Heal Bell user.</p> <p><strong>RestTalk Users</strong>: Outside of Leech Seed, Jumpluff cannot do much to RestTalk users, since it cannot use Encore to lock them into Sleep Talk and isn't going to do much damage to them if it has Hidden Power Flying. Blastoise in particular can be really annoying, since it can also remove Spikes and nullify the offensive pressure that Jumpluff can create with them. Other examples are Slowbro, Slowking, Hypno, Ampharos, Magneton, and Arcanine. RestTalk users still need to be careful, though, since they can be paralyzed or hit with Encore, the latter making them unable to use Rest.</p> <p><strong>Offensive Pressure</strong>: Offensive Pokemon like Nidoqueen, Scyther, Dodrio, and Granbull are dangerous for Jumpluff to switch into or stay in against due to their hard-hitting attacks. However, they must be willing to risk being paralyzed or hit by Sleep Powder if they stay in on Jumpluff, especially if they don't have RestTalk or Heal Bell support. Jumpluff can also reduce its risk when switching into dangerous physical attackers by using Reflect.</p> <p><strong>Ice-type Coverage Moves</strong>: A lot of Pokemon run Ice-type coverage moves to cover common Ground- and Flying-type Pokemon in the tier. Because of that, Jumpluff needs to be careful of Pokemon like Nidoqueen, Piloswine, Electabuzz, and Magneton.</p> <p><strong>Qwilfish</strong>: Qwilfish can inflict heavy damage and poison on Jumpluff with its STAB Sludge Bomb. However, if it has not yet set up Spikes, it should beware of Sleep Powder preventing it from laying them down. In addition, Qwilfish's ability to check many setup sweepers with Haze will be severely impaired if it gets paralyzed by Stun Spore.</p>",
    "sets": {
      "Utility": {
        "description": "<h1>Set Description</h1> <p>Stun Spore is one of the main selling points of Jumpluff, since it helps shut down and threaten a lot of Pokemon that don't like being crippled with status, like Scyther, Nidoqueen, Electabuzz, and Kadabra. Jumpluff's access to Encore, combined with its high Speed, allows it to check a significant portion of the setup sweepers in the tier. One especially notable target is Scyther, which is notoriously difficult to check due to its high Speed and access to Baton Pass. An unboosted Scyther is relatively weak, so Jumpluff can take advantage of this by outspeeding it and locking it into Swords Dance before it can strike Jumpluff down. Even if Scyther anticipates Jumpluff's entry and uses Wing Attack, it is still at risk of being hit by one of Jumpluff's status moves, the threat of which can potentially give Jumpluff the opportunity it needs to recover with Synthesis. Synthesis is also useful to allow Jumpluff to better check defensive Pokemon such as RestTalk Slowbro, which would otherwise be able to wear it down over time. Jumpluff can take advantage of this by using Encore to lock these Pokemon into a move that one of its teammates resists for an easy opportunity to switch in. Leech Seed can be used over or alongside Synthesis, as it forces a lot of switches and lets you get Jumpluff's teammates onto the field more easily, on top of chipping down other Pokemon, especially bulky RestTalk users like Slowbro or Slowking. However, using it over Synthesis reduces its longevity and effectiveness against Scyther. Sleep Powder forces a Pokemon to be used as sleep fodder, provoking more switches and giving your team more momentum; it also works as an effective emergency option if Jumpluff is in a pinch. Reflect lets Jumpluff switch into physical attackers and shut them down more safely with Encore or Stun Spore while staying healthy with Synthesis; it can also be taken advantage of by Jumpluff's teammates. Hidden Power Flying is a nice option to hit Scyther, Bellossom, and Pinsir super effectively so you are able to chip them down, punish the low HP Pokemon that try to recover on Jumpluff, or wear down Pokemon that don't threaten it.</p> <h1>Team Options</h1> <p>Spikes support from Pokemon like Qwilfish is crucial for Jumpluff, allowing it to wear down the opposing team by forcing switches. Without Spikes support, Jumpluff fails to do anything against bulkier teams, which can repeatedly switch between their RestTalk users and waste its utility. Bulky Pokemon like Slowbro, Hypno, and Ampharos can be used as status absorbers, take hits for Jumpluff and spread more status alongside it. Nidoqueen, Granbull, Pinsir, and Quagsire appreciate Jumpluff spreading paralysis as it allows them to outspeed Pokemon they wouldn't be able to otherwise. Thief users like Mr. Mime, Kadabra, and Haunter can steal foes' Leftovers, making them easier to wear down. Jumpluff also appreciates Heal Bell support from Pokemon like Granbull and Chansey so it can be healed of any status ailments when necessary.</p>"
      }
    },
    "credits": {"writtenBy": [], "teams": [{"name": "Quality checked by", "members": [{"username": "Diophantine", "user_id": 370164}, {"username": "Earthworm", "user_id": 15210}]}, {"name": "Grammar checked by", "members": [{"username": "deetah", "user_id": 297659}, {"username": "Empress", "user_id": 175616}]}]}
  },
  "Granbull": {
    "overview": "<p>Granbull's bite is assuredly worse than its bark. Its powerful STAB Frustration comes off a great Attack stat, and its lack of relevant weaknesses allows it to take on a wide variety of foes. These qualities are so useful that it can arguably be considered on par with GSC UU's monarch, Nidoqueen, in terms of overall effectiveness. The tier's relative dearth of Pokemon that resist Normal plays fantastically to Granbull's advantage, enabling it to be highly effective as a mono-attacker. While the most prominent Granbull strategy is to take advantage of its Curse RestTalk set, which dominates against all but a few of the tier's Pokemon, it is the possibility that Granbull could be running a set that can surprise KO some of its better checks that really pushes its threat level over the edge. Its relatively wide movepool also gives it the potential to run a more team-supportive set with Heal Bell and to experiment with other, less predictable options such as Lovely Kiss and Dynamic Punch. In terms of flaws, Granbull's lacking Special Defense stat means that it can struggle to take on powerful special attackers, especially those that run 120-Base Power STAB attacks, such as Ampharos, Magneton, Omastar, and Arcanine, as these can threaten a potential 2HKO. Furthermore, although Granbull is favored against most Pokemon with its mono-attacking Curse set, it can invite dangerous Pokemon such as Haunter and Omastar in for free, which causes some inflexibility when team building with it. Moreover, its lack of resistances and low Speed can leave it in positions where it may be unable to find an opportunity to switch in and recover its health safely.</p>",
    "comments": "<h1>Other Options</h1> <p>Roar is a viable option that gives Granbull a tool against foes that might boost their stats alongside it, such as Kabutops, opposing Granbull, and Shuckle. However, it generally comes at the expense of a better option such as a coverage move. Granbull can be an effective anti-lead with Dynamic Punch and Shadow Ball as alternative high-powered options to Hidden Power Ground that deal extra damage to opposing Granbull, Haunter, Rock-types, and Psychic-types. Lovely Kiss can also be used to make Granbull even more difficult to handle. However, despite its coverage, Granbull can still struggle with certain physically bulky foes, and its low Speed hurts the effectiveness of such a low-durability set. Hyper Beam is a very powerful weapon that can unexpectedly OHKO foes at +1 Attack, but it has obvious drawbacks in the recharge turn and the cost of a moveslot. Present can be used alongside Frustration to potentially deal heavy damage to certain targets such as Slowbro, Blastoise, and Omastar. However, Granbull will still struggle to deal with Haunter and Magneton unless it also has Hidden Power Ground, which means it must either sacrifice the longevity of RestTalk or be walled by similar foes to the otherwise superior Curse set. Furthermore, Present can be highly unreliable in terms of damage output. Zap Cannon can be used to turn Granbull into a paralysis spreader, which could help it get past certain foes or make them easier to handle for its teammates. However, this can decrease Granbull's effectiveness in taking on Ground-types, opposing Granbull, and Magneton.</p> <h1>Checks and Counters</h1> <p><strong>Rock-types</strong>: Omastar is the tier's premier counter to Granbull, convincingly 3HKOing with Surf and potentially 2HKOing with Hydro Pump. A RestTalk set has great odds to beat nearly any Granbull set, even if Granbull has boosted Attack. Furthermore, its excellent Special Attack, coverage options, and Thief allow it to threaten just about anything that the opponent may switch to. However, it does need to be careful of variants with Thunder or the combination of Lovely Kiss, Curse, and Hidden Power Ground, especially if paired with Light Screen support. An even more reliable answer is Shuckle, which can wall nearly any Granbull set indefinitely but lacks the offensive presence of Omastar. Healthy Kabutops has a fighting chance against mono-attacking Granbull variants with its somewhat powerful Hydro Pump or Swords Dance-boosted Submission but should otherwise generally steer clear of taking Granbull on. Graveler can have issues fitting moves with which to reliably beat Granbull, but Explosion is generally enough to stop a Granbull that only has one Curse boost by knocking it into KO range of a teammate.</p> <p><strong>Haunter</strong>: Haunter is an excellent answer to mono-attacking Granbull, and it has the tools to threaten both Granbull and its teammates. In addition, Destiny Bond can allow it to trade for Granbull variants that have Hidden Power Ground, and Hypnosis can be used out of caution when the set is unknown. However, if Haunter is the sole answer to Granbull, one should take care not to use Explosion against another foe if Granbull will be difficult to deal with later without Haunter. This consideration can restrict Haunter's offensive potential substantially.</p> <p><strong>Magneton</strong>: Magneton is an excellent counter to mono-attacking Granbull, taking advantage of it by setting up Reflect, setting up Substitute, or simply chipping away at Granbull or its teammates with its powerful special attacks. However, Magneton must be very careful to avoid getting OHKOed by a boosted Hidden Power Ground from Granbull.</p> <p><strong>Bulky Special Attackers</strong>: Slowbro is one of the few Pokemon that does not resist Normal that can claim any kind of reliability against Granbull due to its formidable physical bulk, powerful STAB attacks, and efficacy as a RestTalk user. It avoids not only a 3HKO from unboosted Frustration but also a 2HKO from +1 Frustration. However, Granbull does outspeed it and can occasionally have Thunder, which 3HKOes it. Pokemon that can hit a boosted Granbull very hard from the special side as well as take a hit from unboosted Granbull, such as Ampharos and Arcanine, can switch into Granbull and threaten it with enough damage that it may be forced to switch out. However, these are far from reliable answers, as they rely on moves with imperfect accuracy for a chance at a 2HKO and cannot be assured of a 2HKO without prior chip damage. These special attackers, as well as other less powerful ones such as Blastoise, Reflect Hypno, and Feraligatr, can sometimes be sufficient to deal with non-boosting Granbull variants.</p>",
    "sets": {
      "Curse RestTalk": {
        "description": "<h1>Set Description</h1> <p>Curse RestTalk Granbull is one of the most polarizing forces in GSC UU. It combines power and resilience and can use Curse to rapidly boost both to levels that almost cannot be dealt with. On top of this, Granbull also deals well with some of the most prominent metagame forces, such as Nidoqueen and Hypno, thanks to its lack of weaknesses other than Fighting. This means it typically has ample opportunities to switch in throughout a game. Furthermore, thanks to its high physical stats, it dominates other more passive Curse users such as Hypno and Chansey, as well as rarer Curse users such as Wigglytuff and Vileplume. Opposing Granbull also struggle to deal with a Curse RestTalk Granbull, especially if they lack Curse, although Granbull should typically avoid switching into another healthy Granbull. Teams without one of the few Pokemon that resist Normal risk being quickly overwhelmed by a Curse RestTalk Granbull, as it can trade hits favorably with nearly any other Pokemon and can reliably sustain itself with RestTalk. However, teams that do have one of the few reliable answers can sometimes take advantage of Granbull entering the field to launch attacks freely at its teammates as it is forced to retreat. These answers often double as powerful special attackers, such as Omastar, Magneton, and Haunter.</p> <h1>Team Options</h1> <p>The most crucial Pokemon to handle as a mono-attacking Curse Granbull are its counters, which include Omastar, Magneton, Haunter, and occasionally Graveler. Electric-types such as Ampharos and Electabuzz can be very useful in this regard. Ampharos has the bulk to easily take on any of the special attacking foes with ease, and it can also provide Light Screen support to allow Granbull an opportunity to actually threaten Magneton, which is slightly less reliable than the other two special attacking counters. Electabuzz is a huge threat to many teams, as it has access to super effective coverage for Nidoqueen as well as Fighting-type coverage for Chansey and Magneton. On top of this, Pursuit can be used to weaken or outright remove foes that cause mono-attacking Curse Granbull issues, such as Slowbro and Haunter. However, Electabuzz lacks the bulk of Ampharos, so it is a good idea to back it up with a specially bulky teammate such as Hypno or Slowking. Granbull being a solid answer to Nidoqueen also helps the Electric-types out, as they often invite it in. Ground-types such as Nidoqueen, Piloswine, and Quagsire are also solid choices for dealing with Magneton and Haunter. Granbull also benefits from having teammates that can lure in and KO Magneton and Haunter. Normal-types such as Dodrio and Lickitung and Grass-types like Swords Dance Victreebel, Vileplume, and Bellossom can potentially catch them out with Ground-type coverage. Blastoise can wear down Haunter that attempt to block its Rapid Spin. Lastly, Granbull can also benefit from paralysis spreading to help it deal with powerful special attackers such as Slowbro, Ampharos, Arcanine, and Mr. Mime. Thunder Wave Hypno and Slowking are some of the best options for spreading paralysis to these foes. Grass-types such as Bellossom and Vileplume can also paralyze various foes with Stun Spore.</p>"
      },
      "Cleric RestTalk": {
        "description": "<h1>Set Description</h1> <p>Among Granbull's numerous options is one of the most valuable support moves in the game, Heal Bell. Granbull hits quite hard with its unboosted Frustration against nearly everything that doesn't resist it, and Heal Bell is an excellent support option that allows its teammates to play more recklessly against status inducers. For example, teammates such as Nidoqueen and Scyther can more freely make assaults against Grass- and Psychic-types that often sacrifice their health to cripple them with paralysis in return. Furthermore, threats that struggle to fit recovery, such as Belly Drum Quagsire and boosting Politoed variants, can potentially use Rest in their fourth moveslot to assist them in setting up multiple times in a game. However, this Granbull set struggles more than others against bulky RestTalk users such as Slowbro and opposing Granbull, and its lower threat level can allow foes that would normally have to switch out against it to pose a threat. Furthermore, as a mono-attacker, it suffers from similar flaws to Curse RestTalk Granbull against Rock-, Steel-, and Ghost-types, and in particular, it can provide Kabutops with a setup opportunity that Curse Granbull would not provide as easily. Moreover, having Heal Bell in a moveslot can be more of a curse than a blessing when considering that it has nearly no effect in many circumstances and therefore reduces the usefulness of RestTalk. While it can wake Granbull up early, the more turns Granbull spends not attacking or recovering health, the more turns the foe has to land a game-changing critical hit.</p> <h1>Team Options</h1> <p>As this Granbull set only has a single attacking move and is therefore easily forced out by Pokemon that resist it, Pokemon that can deal with its counters are highly recommended. Haunter and Omastar both dominate Granbull, but they can be mostly neutralized by teammates such as Hypno, Ampharos, and Slowking. Magneton can similarly be checked by Nidoqueen, Ampharos, and Piloswine. Common offensive threats such as Nidoqueen and Scyther can be more bold when facing Pokemon that threaten to inflict status against them when supported by Granbull's Heal Bell. Similarly, Belly Drum and Growth users such as Quagsire and Politoed can potentially run Rest without Sleep Talk with the intention of waking them up at full health with Heal Bell. This same strategy can also be used with Curse users and Swords Dance users, potentially giving them an opportunity to run a useful coverage attack without sacrificing as much by dropping Sleep Talk. Finally, Rest Blastoise can take advantage of cleric Granbull to give it an extra advantage against Qwilfish as it tries to keep Spikes off the field by either dropping Sleep Talk for a coverage move or reducing the turns it needs to spend using Sleep Talk.</p>"
      },
      "Coverage Attacker": {
        "description": "<h1>Set Description</h1> <p>While mono-attacking Granbull sets must sometimes patiently wait for their counters to be chipped down or otherwise removed before they can really let loose, such counters are almost non-existent for this set. Frustration is mandatory as Granbull's powerful STAB attack, 3HKOing a significant portion of the metagame. Hidden Power Ground is similarly important, as it 2HKOes Magneton and Haunter, two Pokemon that very commonly switch into Granbull. Hidden Power Ground can also be used to chip away at Graveler and Omastar, which are two of Granbull's sturdier checks. For its last two moveslots, Granbull can elect to use Curse to boost its attacking power and make it more sturdy against physical attackers such as opposing Granbull, Nidoqueen, and Scyther, as well as against Explosion users such as Electrode. If Curse is used before revealing its moveset, Granbull can also potentially surprise OHKO Magneton and Haunter with +1 Hidden Power Ground, although it only has just under 50% chance to OHKO the latter. As an alternative to Curse, Thunder can be used to threaten Omastar, which takes relatively low damage even from +1 Hidden Power Ground. In addition to threatening a 2HKO on Omastar with Spikes support, Thunder also instantly threatens a 2HKO and paralysis on Qwilfish, Gyarados, and Kabutops and a 3HKO on Slowbro, whereas variants without Thunder must use Curse first to achieve these benchmarks. However, without Curse to boost its Attack, Granbull risks being worn down and beaten by RestTalk users, especially those that are faster such as Hypno, Ampharos, and Blastoise. By boosting its Attack, 3HKOs against these foes become 2HKOs, which makes Granbull much more reliable at taking them down.</p> <p>Granbull has several good options for the final moveslot. The most obvious choice is Lovely Kiss, which grants it a potent weapon with which it can incapacitate many Pokemon that may switch into it, such as Qwilfish, Haunter, and Shuckle. Lovely Kiss can be used offensively, against Granbull's checks, or defensively, against opposing sweepers that are difficult to control, such as Scyther. It can also be used as a way to deal with Baton Pass users, such as Girafarig, or their recipients, such as Quagsire. However, Pokemon such as RestTalk Omastar, Blastoise, and Slowbro may be able to beat Granbull even when it has put them to sleep. An alternative to Lovely Kiss is Protect, which has good synergy with Curse. This will allow Granbull to gain additional Leftovers recovery at crucial times, which could lead to an additional KO. Protect can also be used to scout for moves such as Explosion and Destiny Bond. Finally, Thunder may be used alongside Curse to maximize Granbull's coverage without sacrificing its ability to boost, which can help it deal with nearly all of its checks effectively.</p> <h1>Team Options</h1> <p>Granbull benefits tremendously from Light Screen and paralysis support. Electrode, Mr. Mime, Hypno, Ampharos, and Chansey are all great options for providing this support. Electrode can also provide offensive momentum with Explosion, whereas Ampharos and Chansey tend to be chosen as part of a defensive core. Depending on the approach taken, Granbull can work on an offensive team that relies on keeping up momentum or can be used on a team that stalls out the opposing team until a good opportunity for Granbull can be found. On offensive teams, Granbull will typically want to run Lovely Kiss to maximize the number of foes it can get past without switching out, whereas on more defensive teams, it may want to consider running Protect in tandem with a spinner to gradually regain health after it takes a foe down. Offensive teams will want to run teammates such as Scyther, Pinsir, and Dodrio, whereas defensive teams might choose Blastoise. Spikes support can help Granbull secure KOs on foes such as Haunter and Omastar, so Qwilfish is a worthy consideration for a teammate. As Granbull can surprise KO Magneton and Haunter, it can be effective to run a second Normal-type with Curse such as Wigglytuff or Chansey to overload the opponent's answers to Curse users. Similarly, Dodrio and Lickitung can potentially benefit from these surprise KOs, as their powerful STAB attacks will no longer be met with resistances. Granbull is also a good Baton Pass recipient and is capable of making good use of both Speed and Attack boosts, so teammates such as Girafarig and Scyther can also perform well with it.</p>"
      },
      "Coverage RestTalk": {
        "description": "<h1>Set Description</h1> <p>Granbull's mono-attacking sets have good durability with RestTalk but often find themselves walled and taken advantage of by Pokemon that resist Normal. This set aims to solve that problem without losing too much durability. Normal + Ground coverage is unresisted in GSC UU, and Granbull's STAB Frustration is among the strongest physical attacks in the tier. Hidden Power Ground always 2HKOes Magneton and Haunter and does decent damage to Graveler and Omastar. It should be noted that using Hidden Power Ground reduces Granbull's HP by 16 due to DV requirements, which makes it slightly less bulky than mono-attacking variants. This set really shines when it becomes the recipient of Attack boosts from Scyther, which can make it almost impossible to deal with defensively.</p> <h1>Team Options</h1> <p>This Granbull set lacks the means to boost its damage output, which can result in poor matchups against bulky special attackers in particular. Scyther is an obvious partner, as it can pass Attack boosts to Granbull, making it almost impossible to wall. Light Screen support from Ampharos can also help both Scyther and Granbull while simultaneously aiding against special attackers. Hypno is a valid alternative to Ampharos that can play a similar role. Bulky Water-types like Slowbro, Blastoise, Omastar, Gyarados, and Feraligatr are also helpful for taking on Ground-types and opposing Granbull. Slowbro can check most physical attackers other than Scyther and Pinsir adequately, Blastoise is an excellent check to Nidoqueen and provides Rapid Spin support, Omastar is one of the best answers to Granbull in the tier and can check Hidden Power Bug Scyther, Gyarados checks Scyther and can function as an alternative Baton Pass recipient, and Feraligatr is a solid all-around Water-type that can also function as a decent Baton Pass recipient.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Earthworm", "user_id": 15210}], "teams": [{"name": "Quality checked by", "members": [{"username": "Century Express", "user_id": 234737}, {"username": "Diophantine", "user_id": 370164}]}, {"name": "Grammar checked by", "members": [{"username": "Rabia", "user_id": 336073}]}]}
  },
  "Electrode": {
    "overview": "<p>Electrode finds a role in UU as a solid support Pokemon. Its distinguishing attributes are its uncontested Speed tier and access to Explosion, an uncommon and valuable move. It can set up screens to help offensive Pokemon and then use Explosion to deal heavy damage and maintain momentum. Explosion is further complemented by its Electric-type attacks, which scare off most Pokemon that resist Explosion and draw in useful targets such as Hypno, Nidoqueen, and Ampharos. However, Electrode's offensive stats are rather poor, meaning that it generally has to use Explosion to do any major damage, and even Explosion fails to KO bulkier foes. Given that it usually uses Explosion early on to give its teammates as many turns behind its dual screens as possible, it is fairly predictable, so opponents may be able to anticipate when it will use Explosion and switch to Haunter or Omastar to negate it.</p>",
    "comments": "<h1>Other Options</h1> <p>Screech can be used to boost the power of Explosion. A different Hidden Power type such as Grass, Water, or Ground can be used to target Quagsire, Graveler, or Magneton, respectively. Pink Bow can be used over Miracle Berry for a stronger Explosion on Pokemon such as Hypno and Nidoqueen.</p> <h1>Checks and Counters</h1> <p><strong>Magneton</strong>: Magneton is one of the best counters to Electrode, as it resists both Explosion and Electric-type moves, leaving Electrode completely walled. It can also deal with Electrode’s common teammates such as Girafarig reasonably well.</p> <p><strong>Grass-types</strong>: Vileplume and Victreebel can put Electrode to sleep if it has already used its Miracle Berry, which is essentially a death sentence for such a flimsy Pokemon. Electrode can deal massive damage to them with Explosion before they can put it to sleep, but they have the bulk to survive and can threaten Electrode's teammates with status afterwards.</p> <p><strong>Ground-types</strong>: Ground-types can take advantage of Electrode if it lacks Hidden Power Ice. Sandslash can set up Substitute on a predicted Reflect to block Explosion and use Electrode as setup fodder. Sandslash's use of Substitute also dissuades screens, something few other Pokemon are capable of. Nidoqueen, Piloswine, and Gligar dislike taking Explosion, but they can threaten Electrode heavily with Earthquake.</p> <p><strong>Other Normal-resistant Pokemon</strong>: Haunter's unique Ghost typing lets it punish Electrode’s Explosion. Omastar takes very little from Explosion and can use Rest to heal any damage taken. Electrode can use Thunder Wave or Thunder to threaten them, so they should only be brought in on a predicted Explosion. Graveler is immune to Electrode's STAB attacks, resists Explosion, and comes close to OHKOing it with Earthquake.</p>",
    "sets": {
      "Support": {
        "description": "<h1>Set Description</h1> <p>This set's main goal is to support its teammates by setting up dual screens and doing massive damage with Explosion. It can hit many notable targets, such as Nidoqueen, Hypno, and Ampharos. Removing or crippling these foes enables fast attackers such as Scyther, Mr. Mime, and Electabuzz. It also immediately ends the turn, allowing free entry for a teammate with a favorable matchup. Electrode can force its way to a good position by outspeeding the foe, setting up the appropriate screen, surviving an attack or two, and, finally, using Explosion. Hidden Power Ice lets Electrode hit Ground-type Pokemon without needing to use Explosion. It is also useful for chipping Nidoqueen into range of an Explosion KO. Thunder Wave is a generally solid option, as it allows Electrode to further cripple the foe, making it even harder for them to respond when its teammate comes in to set up. Electric STAB in Thunderbolt or Thunder allows Electrode to act as a somewhat reliable check to Scyther and hit Haunter and Omastar, which may try to absorb its Explosion. Electrode can also go without any STAB moves, as Thunder Wave is a sufficient deterrent for Haunter and Scyther. However, this leaves Electrode more vulnerable to Omastar. Miracle Berry gives Electrode a safe opportunity to set up screens against Thunder Wave users like Mr. Mime and Hypno without being outsped by Ground-types like Nidoqueen afterwards.</p> <h1>Team Options</h1> <p>Electrode best fits on more offensively oriented teams. Baton Pass users such as Girafarig and Ariados appreciate Electrode's dual screens support in helping them set up Agility boosts or Spider Web. Setup sweepers such as Scyther, Quagsire, and Pinsir also make good use of screens support. A secondary Electric-type such as Electabuzz or Pikachu can take advantage of Electrode's Explosion weakening checks such as Ampharos, Hypno, and Nidoqueen. Psychic-types such as Mr. Mime and Hypno appreciate Electrode's Explosion taking out Pokemon that would otherwise threaten them such as Ampharos and opposing Hypno.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "BT89", "user_id": 487308}], "teams": [{"name": "Quality checked by", "members": [{"username": "HSA", "user_id": 34051}, {"username": "Earthworm", "user_id": 15210}]}, {"name": "Grammar checked by", "members": [{"username": "CryoGyro", "user_id": 331519}, {"username": "dex", "user_id": 277988}]}]}
  },
  "Ariados": {
    "comments": "<h1>Other Options</h1> <p>You could try out Giga Drain for Rock / Ground-types, but unless it's a 4x weakness it won't do too much.</p> <h1>Opinion</h1> <p>Ariados is just not that great of a Pokemon. The Bug / Poison thing has been done a million times, and even though it gets a cool and potentially useful novelty move, it is really slow, doesn't hit hard, and has common weaknesses.</p>",
    "sets": {"Baton Pass Trapper": {"description": "<p>This works a little differently than the other trapping set. More than likely, a pseudo-hazer is going to switch in to Ariados, so Spider Web them. Then, Protect as they Roar or Whirlwind. Now, they'll probably Whirlwind again, so use Disable! If successful, the Pokemon won't be able to pseudo-haze you away, leaving you free to Baton Pass out to the appropriate counter. Smeargle does this a lot better, however, since Ariados is so very slow and has various weaknesses.</p>"}, "Physical Attacker": {"description": "<p>If you're intent on using Ariados to attack, this is probably your best bet. Screech on whatever switches in, then attack with whatever will do the most damage. Quite honestly, the last move can be whatever you want it to be; it could be fun for Ariados to take an opponent's item to the grave.</p>"}}
  },
  "Qwilfish": {
    "overview": "<p>Qwilfish fills two crucial niches in GSC UU—it is the best Spiker and has a fast Haze. It has just enough power behind its STAB attacks that it can occasionally pose a realistic threat to opposing teams, especially because it outspeeds and 2HKOes Nidoqueen, which is arguably the best Pokemon in the tier. Its typing is both a blessing and a curse; its immunity to Toxic and resistance to Water make it difficult for spinners to wear it down, but its weaknesses to common types such as Psychic and Ground and middling defenses can leave it struggling to find opportunities to lay Spikes down in the first place.</p>",
    "comments": "<h1>Other Options</h1> <p>Qwilfish can use Hidden Power Ground to hit opposing Qwilfish harder and make it a more plausible recipient for Attack boosts from Baton Pass Scyther. However, it must sacrifice some of its bulk to do so due to DV requirements. Qwilfish's decent Speed also makes it possible for it to use Swagger somewhat effectively, which can give it a chance at breaking through some foes it might otherwise be very unlikely to, such as Slowbro. However, Haze is typically more useful and reliable than either of these options. Rest can also be used to give Qwilfish some extra longevity against Pokemon that are unable to hit it hard like Blastoise, Slowbro without Psychic, and opposing Qwilfish. However, Rest should only be used alongside a very solid defensive lineup due to the free turns it provides to the opposing team. Sleep Talk can also be used alongside Rest with Spikes and Haze or a STAB attack, but while this increases Qwilfish's durability, it must be noted that important coverage is being given up, which may result in it being used as setup fodder.</p> <h1>Checks and Counters</h1> <p><strong>Slowbro</strong>: Slowbro easily switches into any of Qwilfish's attacks and can deal massive damage to it with Psychic. It can also shrug off a potential poison infliction from Sludge Bomb with Rest.</p> <p><strong>Opposing Qwilfish</strong>: Opposing Qwilfish can take advantage of your own Qwilfish to set up Spikes, as it resists both STAB attacks. To avoid damage to more valuable members of the team, opposing Qwilfish can also choose to slowly wear your Qwilfish down with its STAB attacks before finishing it off with a teammate.</p> <p><strong>Psychic-types</strong>: Pokemon such as Mr. Mime and Kadabra outspeed and deal massive damage to Qwilfish with their STAB Psychic, although they don't want to switch into Sludge Bomb. Other Psychic-types such as Hypno and Slowking are not quite as good at fighting Qwilfish due to getting outsped and having lower Defense than Slowbro, but they can hit it hard with STAB Psychic and will usually beat it one-on-one. Girafarig is also notable because it is a Baton Pass user that threatens Qwilfish with Psychic and Thunder, meaning Qwilfish can find it difficult to use Haze to stop it from passing boosts.</p> <p><strong>Electric-types</strong>: Ampharos, Magneton, and Lanturn make for decent answers to Qwilfish, although if they are hit on their weaker defensive stat on the switch, they will take a large chunk of damage. Electabuzz outspeeds Qwilfish but does not enjoy getting hit by it on the switch. Ampharos, Magneton, and Electabuzz all OHKO Qwilfish with Thunder, while Lanturn does 93% at minimum.</p> <p><strong>Blastoise</strong>: With a RestTalk + Rapid Spin set, Blastoise has the defenses and typing to outlast Qwilfish and keep its Spikes off the field as long as it avoids a critical hit from Sludge Bomb at the wrong moment. Blastoise will struggle to keep Curse Qwilfish’s Spikes off the field, however. It can also try to take Qwilfish by surprise with Zap Cannon, although replacing any of Blastoise's moves will reduce its ability to consistently remove Spikes.</p> <p><strong>Haunter</strong>: Haunter outspeeds Qwilfish, takes negligible damage from Sludge Bomb, and threatens to 2HKO Qwilfish with Psychic and Thunder. It doesn't like taking Hydro Pump, though.</p>",
    "sets": {
      "Spiker": {
        "description": "<h1>Set Description</h1> <p>Spikes is what separates Qwilfish from GSC UU's plethora of other Water-type Pokemon and provides constant extra damage, which can prove crucial to securing KOs; notably, Nidoqueen gains a chance at 2HKOing Slowbro with Thunder with Spikes up. Once Qwilfish has put Spikes down, unless there is a spinner on the opposing team, it very often becomes the go-to choice when fodder is needed for taking a status move or strong hit, as its main purpose has been served. That is not to say that it is useless other than for setting Spikes—far from it. Sludge Bomb is a surprisingly powerful attack, especially with its 30% chance to inflict poison. It is handy for threatening Grass-types like Jumpluff and Bellossom and is also good for hitting other Water-types and neutral targets. Hydro Pump is key for hitting the many Ground-types in the metagame hard, especially Nidoqueen, which Qwilfish can beat one-on-one. Haze makes Qwilfish a solid check to all kinds of setup sweepers. Qwilfish has high Speed relative to most of the tier, so it can outspeed and erase the boosts of Pokemon like Granbull, Kabutops, Victreebel, Quagsire, and Politoed. It also Speed ties with Pinsir, another dangerous Swords Dance user. Curse is an alternative that gives Qwilfish the ability to boost Sludge Bomb's power against targets like Blastoise, which may try to outlast Qwilfish to keep its Spikes off the field. It can also be useful against Pokemon like Scyther and Pinsir, which can struggle to beat Qwilfish once it has a Curse boost. However, a boosted Qwilfish will still lose to many common Pokemon, including Curse Granbull, Slowbro, and Haunter. Nidoqueen's matchup against Qwilfish also improves if it uses Curse due to its reduced Speed.</p> <h1>Team Options</h1> <p>Qwilfish has such great utility with Spikes and Haze that it can be used on almost any kind of team. The extra damage granted by its Spikes can be taken advantage of most by offensive Pokemon, particularly those with immediate power and good coverage like Nidoqueen, Electabuzz, Mr. Mime, Gyarados, and Dodrio. Pokemon that can force switches with Roar, Whirlwind, or Swagger such as Piloswine, Gyarados, Dodrio, and Arcanine also make good use of the extra damage from Spikes. While not strictly necessary, Belly Drum users such as Quagsire, Politoed, and Poliwrath appreciate the additional chip damage Qwilfish's Spikes provides; notably, Quagsire's +6 Earthquake becomes much more likely to OHKO Slowbro with Spikes on the field. Many defensive teams also opt to add Spikes to their team to ensure they have a reliable source of long-term damage, especially those with more passive Pokemon like Chansey, Blastoise, and Bellossom. Leech Seed Jumpluff and Bellossom are great at forcing switches, so Qwilfish's Spikes makes it an important teammate. Jumpluff has particularly good synergy with Curse Qwilfish, which can better keep Spikes up against Blastoise, whereas Jumpluff's Encore compensates for Qwilfish's lack of Haze. Qwilfish can struggle to find early-game opportunities to lay Spikes down against Psychic-type leads such as Mr. Mime and Slowking, so leads such as Electrode, Scyther, and Pinsir can be used to force them out and get Qwilfish in on a less dangerous foe. Finally, Haunter can be useful alongside Haze Qwilfish as a spinblocker to help ensure Qwilfish's Spikes can be kept on the field when facing Blastoise.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Earthworm", "user_id": 15210}], "teams": [{"name": "Quality checked by", "members": [{"username": "Diophantine", "user_id": 370164}, {"username": "alive", "user_id": 18969}]}, {"name": "Grammar checked by", "members": [{"username": "Empress", "user_id": 175616}, {"username": "Rabia", "user_id": 336073}]}]}
  },
  "Sandslash": {
    "overview": "<p>With Swords Dance, high Attack, and STAB Earthquake, Sandslash is one of the most simple yet dangerous sweepers in GSC UU. Its +2 Earthquake is capable of 2HKOing almost everything in the tier, even bulky Pokemon such as Blastoise and Slowbro. Its Ground typing and great Defense also allow it to come into common Pokemon such as Ampharos and Scyther. Unfortunately, it is on the slow side, lacks reliable recovery, and doesn't have very good Special Defense, meaning it requires careful play or support from teammates.</p>",
    "comments": "<h1>Other Options</h1> <p>If Sandslash wishes to spread its own paralysis, Body Slam is an option over Substitute, although generally teammates should provide paralysis support due to Sandslash's frailty and Body Slam's unreliability. Protect is an option over Substitute for maintaining health and avoiding certain KOs. Counter is an odd option that can be useful against Scyther and its Swords Dance + Baton Pass recipients, as well as Granbull. It should be noted that Sandslash has access to Rapid Spin, but its illegality with Swords Dance, combined with Sandslash generally being outclassed in this role by Blastoise and Graveler, makes it a mediocre option.</p> <h1>Checks and Counters</h1> <p><strong>Bellossom and Jumpluff</strong>: Bellossom resists Earthquake and is bulky enough to avoid the 2HKO from Rock Slide while 2HKOing Sandslash with its STAB moves. However, it should watch out for Hidden Power Bug. Jumpluff can switch into Earthquake, Substitute, and Swords Dance and lock Sandslash into those undesirable moves with Encore or status it. A healthy Jumpluff especially is one of the best Sandslash answers.</p> <p><strong>Water-types</strong>: RestTalk Bulky Water-types, especially Blastoise and Slowbro, match up well against Sandslash due to their ability to threaten 2HKOs against it. Blastoise can also remove its boosts with Haze. However, Sandslash can break through them if they are paralyzed. Feraligatr and Gyarados also work as more offensive Sandslash checks, as Gyarados is immune to Earthquake and both threaten a 2HKO with Hydro Pump, but both have less longevity and have trouble fitting Rest.</p> <p><strong>Gligar</strong>: Gligar is one of the best Sandslash answers due to its Earthquake immunity and neutrality to Rock Slide, as well as good physical bulk and Counter to fend off boosted Rock Slides. Gligar also outspeeds Sandslash and almost always breaks its Substitute with Earthquake.</p>",
    "sets": {
      "Swords Dance": {
        "description": "<h1>Set Description</h1> <p>Earthquake is Sandslash's best STAB move and can hit Pokemon such as Nidoqueen, Ampharos, and Haunter for super effective damage. Rock Slide is mandatory for hitting Flying-types, such as Scyther, Dodrio, Gyarados, and Jumpluff, while also hitting Pinsir. Swords Dance lets Sandslash 2HKO almost the entire metagame after a single boost, notably including Slowbro and Granbull. Lastly, Substitute works especially well with paralysis support, letting Sandslash fish for full paralysis. It also works well against foes that might try to pivot around Sandslash's attacks, as well as Counter Gligar and Toxic Crobat. Substitute also improves Sandslash's odds of breaking through Water-types using Sleep Talk. Alternatively, Hidden Power Bug hits Bellossom, which otherwise is a great answer to Sandslash, but it is limited beyond that.</p> <h1>Team Options</h1> <p>Paralysis support is incredibly useful due to Sandslash's low Speed and benefit from a potential free setup turn, meaning Pokemon such as Jumpluff, Mr. Mime, and Hypno pair well with Sandslash. Jumpluff and Mr. Mime can both use Encore to let Sandslash switch in for free, and Hypno can support it with Light Screen and Reflect. Other setup sweepers such as Scyther, Pinsir, and Kabutops can be paired alongside Sandslash for an offensive assault that can be tough to wall for defensive teams, especially when supported by screens. Slowking, Chansey, and Hypno are useful teammates due to their good special bulk and ability to take Water-type attacks aimed at Sandslash. They also reinforce its strengths; Hypno and Slowking provide more consistency against Nidoqueen, and Chansey does the same against Electric-types. Scyther can support Sandslash by passing Swords Dance or Agility to it with Baton Pass. Electrode supports Sandslash well, as it can spread paralysis, set up screens, and use Explosion to provide Sandslash a free switch in. Bellossom can spread paralysis for Sandslash, sponge Water-type attacks, and notably lure in and paralyze Qwilfish. Ampharos can support Sandslash with screens or Thunder Wave and also switch into Water-types. Ampharos also lures in Nidoqueen, which can give Sandslash a setup opportunity if Nidoqueen lacks Lovely Kiss. Finally, Spikes support from Qwilfish maximizes the pressure that Sandslash exerts. Curse Qwilfish can also make progress against Blastoise if it tries to spin away Spikes.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "dawnbuster", "user_id": 508601}], "teams": [{"name": "Quality checked by", "members": [{"username": "Century Express", "user_id": 234737}, {"username": "Earthworm", "user_id": 15210}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}, {"username": "Muk", "user_id": 33374}]}]}
  },
  "Persian": {"sets": {"Sub Swagger": {}}},
  "Poliwhirl": {"sets": {"Belly Drum Sweeper": {}}},
  "Kadabra": {
    "overview": "<p>Sporting high Speed, good coverage, and exceptional Special Attack, Kadabra is a fierce offensive threat in GSC UU and a tough Pokemon to switch into for most offensive teams. Kadabra is best played aggressively, brought in on double switches or a predicted Rest or Psychic from a foe such as Slowbro. It also threatens many common Pokemon such as Nidoqueen, Haunter, and Qwilfish with its strong Psychic and can keep itself healthy throughout a game with Recover. Its Speed is also excellent, outpacing naturally fast Pokemon such as Haunter, Dodrio, and Mr. Mime while only being outsped by Jumpluff and Electrode and Speed tying with Scyther. Access to useful moves such as Encore and Thunder Wave also lets it support its team well. However, Kadabra's defensive stats are pitiful, leaving it 2HKOed by a lot of Pokemon in the tier, and it loses much of its effectiveness when paralyzed. Furthermore, it faces competition from other Psychic-types such as Mr Mime and Hypno, which generally bring more utility to teams and are more consistent due to their wider movepools and greater bulk.</p>",
    "comments": "<h1>Other Options</h1> <p>Fire Punch can be used to 2HKO Magneton and deal more damage to Pokemon such as Pinsir and Bellossom, but its use beyond that is limited. With Kadabra's frailty, it can make good use of Counter, which allows it to get a surprise KO on foes such as Piloswine and Granbull. Thief can cripple a bulky Pokemon such as Hypno or Ampharos that attempts to switch into Kadabra. Hidden Power Dark can be used alongside Fire Punch and Psychic; these three moves hit every viable Pokemon in the metagame for neutral damage, although this makes Kadabra worse off against Slowbro due to its low chance to 3HKO with Hidden Power Dark. Substitute can be used to exploit Thunder's low accuracy from Pokemon such as Magneton and Lanturn and lets Kadabra safely avoid potential status inflictions from non-Seismic Toss Hypno.</p> <h1>Checks and Counters</h1> <p><strong>Opposing Psychic-types</strong>: Hypno takes negligible damage from anything Kadabra can use against it and can cripple it with Thunder Wave or set up Light Screen for its teammates. Mr. Mime threatens Kadabra with paralysis and a 3HKO from Thunder while not being hurt much in return, although Mr. Mime fears Thunder Wave from Kadabra. Slowking is only 4HKOed by Thunder Punch and can hit Kadabra hard and Thunder Wave variants can cripple Kadabra. RestTalk Psychic-types are also a significant challenge for Kadabra to deal with, especially since Encore fails against Sleep Talk. However, all of these Pokemon dislike Thief Kadabra and can be forced out by Encore Kadabra if it switches in on a resisted attack or recovery move, or when the foe uses Substitute.</p> <p><strong>Specially Bulky Pokemon</strong>: Ampharos and Lanturn are only 4HKOed by Psychic and can hit Kadabra very hard in return with Thunder. Bellossom is similarly 4HKOed and can cripple Kadabra with Stun Spore while keeping itself healthy with Moonlight. Chansey takes pitiful damage from Kadabra and can threaten it with Present or paralysis from Zap Cannon, although it can be forced out by Encore.</p> <p><strong>Fast Pokemon</strong>: Jumpluff outspeeds Kadabra and can lock it into an undesirable move with Encore or cripple it with Stun Spore, although variants without Synthesis can be worn down by Psychic and Jumpluff greatly fears paralysis from Thunder Wave or Thunder Punch. Electrode is faster, can set up Light Screen, and can threaten Kadabra with Explosion. Lastly, Scyther and Electabuzz Speed tie with Kadabra and can hit it very hard; Electabuzz can even Pursuit trap Kadabra and Scyther can OHKO with Hidden Power Bug, although they are both 3HKOed by Psychic.</p> <p><strong>Magneton</strong>: Magneton resists Psychic and Thunder Punch and deals heavy damage with Thunder, although it must watch for Fire Punch, which can 2HKO.</p> <p><strong>Physical Attackers</strong>: Although they cannot switch in safely due to their middling Special Defense stats, physical attackers such as Granbull, Piloswine, and Pinsir pose a significant threat to Kadabra if they switch in as it uses Encore or Recover. Granbull comes close to OHKOing with unboosted Frustration, Piloswine deals over 70% with Earthquake, and Pinsir OHKOes with unboosted Hidden Power Bug.</p>",
    "sets": {
      "Utility Attacker": {
        "description": "<h1>Set Description</h1> <p>This set takes advantage of Kadabra's high Speed and Special Attack to make it an offensive threat with crucial utility in Encore or Thunder Wave. STAB Psychic 3HKOes a significant proportion of foes that don't resist it. Thunder Punch is important for hitting Slowbro and Slowking, which otherwise completely wall Kadabra. The extra power is also appreciated against other bulky Water-types such as Blastoise, Gyarados, and Politoed, which are not 3HKOed by Psychic. Recover gives Kadabra greater longevity when battling threats such as Slowbro. Encore can lock a foe into an undesirable move, such as Rest for passive Pokemon or a boosting move for setup Pokemon. However, this is very risky due to Kadabra's frailty, especially against Scyther, with which Kadabra Speed ties. Encore can also help immensely against Baton Pass teams, since Kadabra's fast Encore lets it disrupt the momentum of Mr. Mime. Alternatively, Thunder Wave can support slower wallbreaking teammates such as Sandslash and Granbull and cripple foes such as Jumpluff, Scyther, Electabuzz, Bellossom, Hypno, and Chansey.</p> <h1>Team Options</h1> <p>Spikes support from Qwilfish is crucial for maximizing pressure from Kadabra. Nidoqueen pairs well with Kadabra, since bulky Electric-types like Magneton and Ampharos are reliable switch-ins to Kadabra, and Nidoqueen can switch into them easily while maintaining offensive momentum. Pokemon that can check Dodrio, Scyther, and Pinsir, such as Fire Blast Nidoqueen and Haunter, can help Kadabra with its defensive issues. Setup sweepers such as Scyther, Granbull, Pinsir, and Kabutops can take advantage of Encore from Kadabra to acquire a risk-free opportunity to switch in; ideal scenarios include locking Chansey into Soft-Boiled and locking Hypno into Light Screen. Haunter is a good partner for Kadabra, as the two have the same Psychic- and Electric-type coverage and similar checks, meaning Haunter can cripple them with Thief, Hypnosis, Explosion, or Destiny Bond. Mr. Mime can be used as a secondary offensive Psychic-type that supports Kadabra with Thunder Wave, Encore, Thief, Hypnosis, or a passed Substitute. Pokemon that can take advantage of Hypno, such as Granbull, Hidden Power Bug Scyther and Pinsir, and specially bulky RestTalkers such as Ampharos are appreciated. Finally, secondary checks to Slowbro and Slowking such as Electabuzz work well, since Kadabra generally doesn't want to be stuck using Recover versus their Surfs; this can give them a free opportunity to switch out, and Kadabra is vulnerable to critical hits.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "dawnbuster", "user_id": 508601}], "teams": [{"name": "Quality checked by", "members": [{"username": "Century Express", "user_id": 234737}, {"username": "Diophantine", "user_id": 370164}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}, {"username": "P Squared", "user_id": 168392}]}]}
  },
  "Graveler": {"sets": {"SpinSplode": {}}},
  "Slowbro": {
    "overview": "<p>Slowbro is one of the most powerful Pokemon in GSC UU. Its bulk and typing allow it to switch in and sponge attacks, while its base 100 Special Attack means that it can fire off powerful hits too. Access to Thunder Wave limits what even Pokemon with super effective moves can safely do against it. These factors mean that Slowbro can both offensively and defensively check many of the Pokemon in GSC UU. It can stick around for a long time with Rest and Sleep Talk, which allow its presence to be felt for most of the games that it is used in while also being able to absorb status-inducing moves for its teammates. When constructing teams and while playing games, one must always consider how to threaten an opposing Slowbro.</p>",
    "comments": "<h1>Other Options</h1> <p>Generally speaking, Slowbro's standard options are too great to pass up; however, with the right team support, certain moves can be dropped. Instead of Thunder Wave, Zap Cannon can be used to help against opposing Slowbro and provide paralysis support for teammates. There are other coverage moves such as Fire Blast and Ice Beam that can be used to surprise Grass-type Pokemon that are not weak to Psychic and also to allow Slowbro to hit Scyther harder. If Slowbro drops Sleep Talk, Swagger can be used alongside Thunder Wave to increase the chances of putting offensive Pokemon out of commission, while Counter may be used to take advantage of some boosted physical attackers that may think they can break past Slowbro, such as Granbull. However, these options are quite gimmicky, as Counter will likely only fool your opponent once and leave Slowbro weakened, and Swagger runs the risk of the opposing Pokemon not hitting itself in confusion. Additionally, either of these moves would most likely replace Sleep Talk, so Slowbro's ability to absorb status would be reduced. Reflect means that Slowbro has a better time against Granbull and non-Hidden Power Bug Scyther and can provide good general team support. Belly Drum makes for an interesting option, but there are more viable users of this move in the tier. Finally, Toxic can also be used in order to force other Slowbro to use Rest.</p> <h1>Checks and Counters</h1> <p><strong>Electric-types</strong>: All Electric-types can pressure Slowbro offensively with a hard hitting Thunder or Thunderbolt, and aggressive play from these Pokemon with Spikes support can pressure Slowbro by forcing it to switch and take residual damage. Electabuzz can Pursuit trap Slowbro too, which applies even more pressure to it. However, Magneton and Electabuzz can have trouble switching into Slowbro as Surf 3HKOes both, and Electabuzz especially does not appreciate the risk of paralysis.</p> <p><strong>Nidoqueen</strong>: While Nidoqueen loses to Slowbro one-on-one, if Slowbro tries to switch in, Nidoqueen can punish it by predicting the switch and using Thunder, which has a chance to 2HKO Slowbro with Spikes damage and can also inflict paralysis.</p> <p><strong>Opposing Slowbro, Slowking, and Chansey</strong>: Opposing Slowbro and Slowking can force a stall war with Slowbro, while Chansey can threaten Slowbro with Present and set up Light Screen for its teammates that would usually find difficulty in beating it one-on-one like Granbull. In the common Slowbro versus Slowbro or Slowking matchup, the aim is typically to waste the foe's PP until they no longer want to risk using any more, or else the Pokemon becomes useless. This can generate potential free switches once the opponent begins to conserve Sleep Talk's PP. Thunder Wave also puts PP wars in your favor and makes it much more difficult for the opposing Slowbro or Slowking to check their usual threats.</p> <p><strong>Swords Dance-boosted Physical Attackers</strong>: While Granbull finds difficulty taking on Slowbro by itself, if it recieves an Attack boost from Scyther, it can punch through Slowbro with its Return. Pinsir and Scyther can also force Slowbro out with the threat of a boosted Hidden Power Bug.</p> <p><strong>Water-types</strong>: Lanturn is perhaps the best Slowbro counter in the game, fearing nothing from it and threatening it with STAB Thunder. Gyarados can threaten to 3HKO Slowbro with Thunder but should avoid coming in on Psychic or Thunder Wave. RestTalk Blastoise and Politoed are bulky enough to avoid the 3HKO from Psychic, but both will be forced out by Special Defense drops or potentially KOed by a critical hit, and they don't pose an immediate threat back to Slowbro.</p> <p><strong>Grass-types</strong>: Grass-types not weak to Psychic like Jumpluff and Bellossom check Slowbro well in the short term, provided that they avoid Thunder Wave.</p> <p><strong>Psychic-types</strong>: Psychic-types such as Hypno and Mr. Mime can beat or outlast Slowbro one-on-one. Hypno can come in on Slowbro, set up Light Screen and shrug off hits with Rest, and Mr. Mime can hit it with a powerful Thunder.</p>",
    "sets": {
      "Sleep Talking Sponge (Sleep Talk)": {
        "description": "<h1>Set Description</h1> <p>Slowbro can maintain its offensive and defensive presence with only its STAB attacks, which makes it a great candidate for a Sleep Talk user. Psychic offers a chance to drop the foe's Special Defense while Surf has a slightly higher Base Power; together, these two moves hit the entire tier neutrally save for opposing Slowbro and Slowking. Rest and Sleep Talk grant Slowbro longevity so that it can sponge hits and dish out attacks more consistently while also reducing the disadvantages caused by status ailments. Thunder Wave can be used as an alternative to one of Slowbro's STAB attacks, as it offers support for Slowbro's teammates and threatens to cripple sweepers such as Scyther. However, because Thunder Wave does nothing against Nidoqueen, it can sometimes be a liability when selected by Sleep Talk, reducing Slowbro's consistency. Slowbro will also have a harder time threatening Poison-types such as Qwilfish if it drops Psychic or Psychic-types such as Mr. Mime if it drops Surf.</p> <p>If Slowbro is running dual STAB attacks, it has a favorable matchup against both Nidoqueen and Granbull. Nidoqueen is unlikely to 2HKO Slowbro with Thunder after Spikes, and Sleep Talk is guaranteed to pull a useful attack against it. Granbull fails to 3HKO Slowbro before using Curse and fails to 2HKO after a Curse, whereas Slowbro reliably 3HKOes Granbull in return with its STAB attacks. Dodrio, opposing Slowbro, and Slowking are also some notable Pokemon that Slowbro checks along with Ground-types like Sandslash and Piloswine. Scyther, however, is not checked by Slowbro, as it can Baton Pass Attack boosts to Granbull, allowing it to 2HKO Slowbro.</p> <h1>Team Options</h1> <p>Slowbro’s ability to sponge hits and still have some firepower of its own mean that it can fit on most playstyles, so it has many viable team options; however, there are certain Pokemon that can help Slowbro be a more dominant presence. Pokemon that can switch into Electric-type Pokemon, such as Nidoqueen, Ampharos, Bellossom, and Quagsire, are great partners for Slowbro. Pokemon that can pressure opposing Slowbro and Slowking, such as Nidoqueen, Ampharos, and a boosted Granbull, pair well with Slowbro, as those two foes wall it. Many of these Pokemon also function well in tandem with Slowbro's ability to spread paralysis. Finally, Slowbro is also a great partner for the rare Growth + Baton Pass Flareon, as a Special Attack boost lets Slowbro exert more offensive pressure.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Diophantine", "user_id": 370164}], "teams": [{"name": "Quality checked by", "members": [{"username": "Earthworm", "user_id": 15210}, {"username": "Jorgen", "user_id": 53302}]}, {"name": "Grammar checked by", "members": [{"username": "Astra", "user_id": 240732}, {"username": "Empress", "user_id": 175616}]}]}
  },
  "Magneton": {"sets": {"Rest Talk Magneton": {}}},
  "Dewgong": {"sets": {"Rest Talk": {}}},
  "Haunter": {
    "overview": "<p>Haunter is one of the stronger offensive threats in GSC UU, with very good Special Attack, great coverage options in Psychic and Thunder, and access to rare moves like Thief and Explosion that let it circumvent some of its checks. It has enough Speed to outpace all of the bulkier Pokemon commonly seen, as well as being able to use its Ghost typing to check the threatening Granbull. However, there are a number of shortcomings that stop it from being a more consistent wallbreaker. Its pitiful bulk leaves it either 2HKOed or 3HKOed by most neutral hits, and common Ground- and Psychic-types like Nidoqueen, Piloswine, and Slowbro threaten to OHKO it with their super effective STAB moves. It also often needs to use Explosion in order to break other teams and give partners opportunities to make progress, leading to Haunter being somewhat difficult to use to its full potential. Lastly, while its Speed tier of 95 is solid, it is outsped by numerous other offensive Pokemon including Scyther, Dodrio, Electabuzz, and Kadabra, the last of which can OHKO it.</p>",
    "comments": "<h1>Other Options</h1> <p>Destiny Bond is an alternative to Explosion that doesn't KO Haunter immediately if you predict incorrectly, but it is relatively easy to play against once it has been revealed and can give opposing walls like Chansey free turns to recover. It can also be run over Hypnosis or Thief if you want to take greater advantage of Haunter's ability to force trades. Haze can be useful as an emergency button versus sweepers that get out of hand, while Perish Song can also be used to force them out and win last Pokemon scenarios. Mean Look can be used in conjunction with Explosion, Perish Song, or Destiny Bond in order to give Haunter a way to trap and KO a foe, but it has to give up the utility of a status move or Thief to do so. Haunter also has other niche coverage options. Shadow Ball provides a way to hit the frailer Psychic-types like Kadabra and Mr. Mime even off Haunter's pitiful Attack stat, Giga Drain hits Omastar and Quagsire, while Hidden Power Ice nails Jumpluff and Gligar.</p> <h1>Checks and Counters</h1> <p><strong>Electric-types</strong>: Ampharos is one of the sturdiest switch-ins to Haunter, taking little from Psychic and Thunder and being able to either set Light Screen or threaten Haunter with its own Thunder. Magneton may be less sturdy than Ampharos overall, but it resists both Psychic and Explosion, making it one of the safest switch-ins to Haunter overall. Electabuzz has a little bit more trouble switching in, but it does have the advantange of being faster and 2HKOing Haunter while also being able to trap it with Pursuit. Lanturn is another solid option that can safely come in and threaten it with its STAB moves or Thunder Wave.</p> <p><strong>Psychic-types</strong>: Most Psychic-types can safely switch into Haunter at least once barring Explosion, with Hypno being the best choice for something with longevity. Kadabra with Recover doesn't fear anything except paralysis from Thunder, and Mr. Mime can force Haunter out as well, but both do have to be careful about the rare Shadow Ball. Slowking very slightly risks a 2HKO from Thunder but can otherwise come in and threaten an OHKO. Explosion can deter most of these switch-ins, but it comes at the cost of Haunter's life.</p> <p><strong>Ground-types</strong>: Some of the tier's Ground-types can make an effective Haunter check, with Piloswine being the bulkiest option available. It is also commonly carrying Sleep Talk, which makes Hypnosis less of an issue for it. Quagsire can force Haunter out and threaten to set up a Belly Drum. Nidoqueen has to fear Psychic, but it can come in on Thunder when healthy and forces the player to make predictions.</p> <p><strong>Bellossom and Jumpluff</strong>: Bellossom and Jumpluff have both the bulk and recovery to switch into Haunter consistently. Both can paralyze it or put it to sleep, while Jumpluff's higher Speed lets it use Encore against Haunter to prevent Explosion as well. However, they must both be wary of Hypnosis and paralysis from Thunder, which can prevent them from effectively doing their job.</p> <p><strong>Faster Threats</strong>: While Haunter is by no means slow, there are still a good number of potential revenge killers it won't be able to take more than one hit from. Scyther and Dodrio both 2HKO it, but they fear paralysis from Thunder and can only deal with an already weakened Haunter. The less common Electrode resists Thunder while 2HKOing Haunter in return.</p> <p><strong>Chansey</strong>: Chansey can sit on basically everything Haunter has and even takes an Explosion from full health. It can then proceed to either support its team or threaten Haunter with Thunder Wave. However, Chansey usually can't KO Haunter itself, as Haunter is immune to Present and Seismic Toss; furthermore, Chansey must be wary of being put to sleep with Hypnosis and used as setup bait by one of Haunter's teammates.</p>",
    "sets": {
      "Offensive Utility": {
        "description": "<h1>Set Description</h1> <p>Haunter is blessed with a myriad of useful attacks to make up for its lackluster offensive typing. Psychic is crucial for being Haunter's strongest option versus Nidoqueen, potentially 2HKOing it with Spikes damage or a Special Defense drop. Thunder hits most of the tier's Water- and Flying-types hard, including Slowbro, Slowking, Scyther, Dodrio, and Gyarados. It can also inflict paralysis on some bulkier switch-ins like Hypno and Chansey. Haunter can make a very effective lead, with both Thief and Hypnosis crippling the foe early. It matches up against Qwilfish well, usually scaring it out from staying in to set up Spikes, and you can either put something to sleep or get an early-game Thief off on your opponent's Haunter switch-in. Thief is a great way for Haunter to support its team by taking Leftovers from one of the opposing tanks, with the aforementioned Hypno, Chansey, and Slowbro all being great targets for this. However, Hypnosis helps more when facing offensive teams and gives Haunter more free turns to attack. It also makes it risky for Haunter checks without Sleep Talk to switch in, which reduces the number of counters it has to a handful of Pokemon. Explosion is a way to get some more value out of Haunter if it either can't break through the opposing team or is low on health, threatening to OHKO Chansey and Hypno after Spikes damage while also doing big damage to Nidoqueen and Ampharos. It can also be used as an emergency button versus threats that have gotten out of hand like Swords Dance Pinsir and Victreebel. However, if Haunter is being depended on as a stop to Curse Granbull, it is wise to preserve it.</p> <h1>Team Options</h1> <p>Spikes are the best thing to help Haunter break opposing teams, so Qwilfish is an almost mandatory partner. Once Qwilfish sets up Spikes, Haunter can block Rapid Spin for it in return. While Blastoise, the most common spinner, has a small chance to 2HKO Haunter, it is slower and threatened by both Thunder and Explosion, letting Haunter switch into it safely at least once if it is healthy. Baton Pass teams are well equipped to enjoy Haunter's utility as well, as it can use its unique attributes to keep Spikes up, put something to sleep with Hypnosis, and use Explosion to give free setup opportunities. Pokemon that can take advantage of bulky Psychic-types like Scyther and Pinsir can potentially get free turns of setup after Haunter forces said Psychic-types to Rest. Haunter commonly runs the same offensive coverage as Mr. Mime and can lure in Pokemon that would also wall Mr. Mime to eliminate them with Explosion. Many strong Pokemon like Nidoqueen and Granbull appreciate Haunter stealing Leftovers or using Explosion on checks they have in common like Hypno, Magneton, and Slowking. Other fast offensive threats like Electabuzz and Dodrio will appreciate Haunter's early-game wallbreaking to help them clean weakened teams.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Sage", "user_id": 192277}], "teams": [{"name": "Quality checked by", "members": [{"username": "Earthworm", "user_id": 15210}, {"username": "Diophantine", "user_id": 370164}]}, {"name": "Grammar checked by", "members": [{"username": "deetah", "user_id": 297659}, {"username": "Lumari", "user_id": 232216}]}]}
  },
  "Hypno": {
    "overview": "<p>Hypno is perfectly equipped for the role of supporter with a vast array of status moves, screens, and disruptive options at its disposal. Its great Special Defense stat also allows it to perform the role of special wall, and its pure Psychic typing leaves it with few exploitable weaknesses and a useful resistance to Psychic. However, while its attacking options leave little to be desired, it has relatively low attacking stats, meaning that one must be patient when trying to actually KO Pokemon with Hypno as opposed to crippling them for a teammate.</p>",
    "comments": "<h1>Other Options</h1> <p>Hypno has no shortage of options and can utilize many of them effectively; in particular, the third and fourth moves on the supporter set are quite flexible. It learns all three of the elemental punches, and they are all at least somewhat useful. Fire Punch hits Magneton for respectable damage and also hits Pokemon like Scyther, Pinsir, and Bellossom a bit harder than Psychic. Ice Punch maintains this super effective coverage against Scyther and Bellossom and also hits Jumpluff and Gligar hard. On top of this, it has a low chance to freeze the foe, which can be useful for breaking stalemates against opposing special walls. Thunder Punch can be used to do a bit more damage to Slowbro. However, it should be noted that all of these moves have low-Base Power, and Hypno has relatively low Special Attack, so keep expectations low when using them. Hypno learns both Swagger and Flash, which are particularly effective when combined with paralysis. Reducing the foe's chance to attack will force the opponent to switch or risk allowing a more dangerous Pokemon free setup. This forced switch will give Hypno an opportunity to paralyze an additional Pokemon. When used in conjunction with Hypnosis, Nightmare can also be used in a somewhat similar manner to try to force the opponent to take status with something other than a status absorber. Disable can also be used to eliminate an attack from the foe's options, but has poor accuracy and requires the foe to have used the attack previously.</p> <p>Some additional status moves Hypno has at its disposal are Zap Cannon and Toxic. Both of these are great when they aren't expected, but they are a little unreliable due to accuracy and how common status absorbers are. Counter is also an option that works when the opponent does not see it coming. It has the potential to surprise KO major threats like Scyther, Granbull, and Kabutops, but it requires Hypno to take a heavy hit in exchange and can very easily backfire.</p> <h1>Checks and Counters</h1> <p><strong>Scyther and Pinsir</strong>: Scyther and Pinsir can use their powerful STAB Hidden Power Bug to quickly eliminate Hypno, although neither wants to take status.</p> <p><strong>Granbull</strong>: Curse Granbull can take anything Hypno can throw at it and easily overcome it with powerful STAB attacks. Heal Bell Granbull can also cure any status Hypno has inflicted.</p> <p><strong>Chansey</strong>: Chansey can take any of Hypno's usual attacks barring Hypnosis and cure its team of status afflictions with Heal Bell. It can also threaten Hypno with Present.</p> <p><strong>RestTalk Users</strong>: Hypno has no way to threaten RestTalk users such as Slowbro, Slowking, Ampharos, Blastoise, and opposing Hypno, and they can attempt to PP stall it. However, supporter Hypno can take advantage of their passivity to set up an opportunity for a teammate, and Curse Hypno will beat them in the long run barring Ampharos, which can potentially beat Hypno with its powerful Thunders.</p> <p><strong>Bulky Ground-types</strong>: Bulky Ground-types like Piloswine and Quagsire are immune to Thunder Wave and can beat Hypno with their STAB Earthquake, although if they lack Rest, they can easily get worn down if Spikes are up, and they are vulnerable to Hypnosis if they lack Sleep Talk.</p> <p><strong>Other Strong Physical Attackers</strong>: Strong physical attackers can target Hypno's middling Defense stat and overcome it with their STAB attacks. Sandslash can switch into Thunder Wave and set up Swords Dance, and +2 Earthquake will easily 2HKO Hypno. Dodrio can do a huge amount of damage to Hypno with STAB Double-Edge, potentially 2HKOing if it has Pink Bow. If it has RestTalk, it is also in a better position to take status from Hypno.</p> <p><strong>Omastar, Magneton, and Haunter</strong>: Curse RestTalk Hypno struggles to get past these three Pokemon, doing no damage at all to Haunter, failing to 4HKO Omastar with +6 Body Slam, and potentially getting 3HKOed by Magneton's Thunder. Other Hypno variants will have a good matchup against Omastar and Haunter but may struggle to contain Magneton.</p>",
    "sets": {
      "Supporter": {
        "description": "<h1>Set Description</h1> <p>Hypno is highly effective at setting up opportunities for its team with this set. Thunder Wave is very useful for slowing down the enemy team and reducing their chances of attacking. The opponent will usually try to contain the spread of paralysis to a few Pokemon, usually RestTalk users. Once they are paralyzed, Hypno can proceed to set up a screen and then switch out to a Pokemon that will then often have an easy setup opportunity. Hypnosis can also be used to disrupt Ground-type Pokemon that might think they can switch into Thunder Wave; however, it is less effective against RestTalk users than Thunder Wave. Psychic is the preferred attacking option in most cases, especially alongside Thunder Wave, to prevent Nidoqueen from coming in freely. However, having Psychic as Hypno's sole attacking option leaves it without an option for hitting opposing Psychic-type Pokemon such as Mr. Mime and Girafarig, which can cause problems through their use of Baton Pass. Thus, Seismic Toss can be used to stop them from taking too much advantage of Hypno. Rest is the usual fourth move so that a weakened Hypno can recover its health, and Hypno's screens and paralysis can assist in ensuring it can then wake up again.</p> <h1>Team Options</h1> <p>As a supporter, Hypno is an excellent choice for teams that have at least a couple of setup sweepers, such as Scyther, Pinsir, Sandslash, Kabutops, and Victreebel. It can also work with Pokemon like Growth or Belly Drum Politoed, Curse Granbull, and Gyarados. Hypno's paralysis support can be taken advantage of by Substitute users such as Sandslash and Pikachu and can also work effectively with Swagger users, including Pokemon like Gyarados and Dodrio. Finally, Baton Pass users like Girafarig can take advantage of Hypno's screens and paralysis support to find opportunities to set up and get recipients like Quagsire and Poliwrath in safely.</p>"
      },
      "Sleep Talking Wall": {
        "description": "<h1>Set Description</h1> <p>Hypno is one of the most resilient Pokemon in the tier, and its lack of relevant weaknesses and solid neutral coverage make it an ideal status absorber and RestTalk user. Psychic is used to ensure it can hit Haunter and so that Nidoqueen can't simply spam Earthquake against it, and Seismic Toss is typically chosen for its stable and consistent damage output. Thunder Wave can be chosen over Seismic Toss to make Hypno more of an immediate threat to Pokemon like Scyther and Jumpluff, but it comes at the cost of coverage against Pokemon like Mr. Mime and Magneton. This set is difficult to take down without using Explosion or setting up a physical attacker, and it is great at chipping sweepers down as they switch in. It makes a fantastic check to Pokemon that can otherwise be difficult to check due to their coverage, such as Electabuzz, Mr. Mime, Gyarados, and opposing RestTalk users like Slowbro and Slowking.</p> <h1>Team Options</h1> <p>The main draw to using Hypno for this role over Slowbro or Slowking is its lack of an Electric weakness, so it works best on teams that need an answer to threats like Mr. Mime, Kadabra, and Electabuzz. It is much worse off against Granbull and slightly worse off against Nidoqueen than Slowbro, so it is a good idea to pair it with solid answers to these; Omastar, Haunter, and Magneton are good checks to Granbull, while Gligar and RestTalk Granbull can handle Nidoqueen. Jumpluff is a good teammate for its ability to counter setup with Encore and spread status, particularly against Bug-types such as Scyther and Pinsir that may try to take advantage of Hypno's relatively low damage output. In general, most kinds of teams enjoy Hypno's presence due to the widespread use of status moves in the metagame and Hypno's ability to absorb them for its team.</p>"
      },
      "Curse Sleep Talk": {
        "description": "<h1>Set Description</h1> <p>This set takes advantage of Hypno's high Special Defense to boost up with Curse and attempt to sweep the opposing team. Early-game, Hypno is unlikely to find an opportunity to set up due to the likely presence of Pokemon like Curse Granbull, Omastar, and Haunter on the opposing team. However, later in the game, as the opposing team gets worn down, the opponent may not have any remaining options to deal with this set, as it has relatively few reliable counters. Body Slam is the best attacking option because it can be used throughout the game to potentially paralyze any Pokemon that might try to take advantage of Hypno's low initial damage output. One of the key benefits of using this set is that Hypno will eventually beat enemy RestTalk users such as Slowbro and opposing Hypno through Curse. Against these and many other foes, Hypno can also do a reasonable job of its usual roles of special wall and status absorber despite not having a reliable source of damage. Additionally, Nidoqueen can struggle to wear it down because it is difficult to force out once it has Defense boosts, especially with RestTalk keeping it healthy.</p> <h1>Team Options</h1> <p>This Hypno set is relatively easy to wall and beat with the right Pokemon, such as Omastar, which is not even 4HKOed by +6 Attack Hypno. It is therefore a good idea to ensure other offensive measures are present on one's team, such as Spikes from Qwilfish, which can help to wear down Pokemon that have an advantage over Hypno, such as Piloswine. Of absolutely critical importance is that this set is accompanied by a reliable answer to Curse Granbull, which easily sets up against this set and will virtually always beat it. Omastar is the most reliable Granbull counter, but Haunter and Magneton will also suffice. Hypno will also require support to deal with Bug-types such as Scyther and Pinsir, especially if they have Hidden Power Bug; Jumpluff and Gyarados are useful choices in this regard. Fire Blast Nidoqueen can also cover Hidden Power Bug variants of these two reasonably well, as they cannot have Hidden Power Ground on the same set. Defensive Electric-types such as Ampharos and Magneton can potentially threaten Hypno with their very powerful Thunders, so it is also a good idea to use Hypno alongside Ground-types such as Nidoqueen and Piloswine.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Earthworm", "user_id": 15210}], "teams": [{"name": "Quality checked by", "members": [{"username": "Diophantine", "user_id": 370164}, {"username": "Century Express", "user_id": 234737}]}, {"name": "Grammar checked by", "members": [{"username": "Oglemi", "user_id": 40358}, {"username": "Rabia", "user_id": 336073}]}]}
  },
  "Chansey": {"sets": {"Defensive Cleric": {}}},
  "Scyther": {
    "overview": "<p>Scyther is one of the most threatening Pokemon in the GSC UnderUsed metagame. It is almost unmatched in terms of Speed, with the only notable Pokemon that outspeed it being Jumpluff, Crobat, and Electrode. It can pass Swords Dance or Agility boosts to its teammates before the opponent has a chance to properly react, and it also functions very effectively as a standalone sweeper thanks to its high Attack. Of the few viable Haze users and phazers available, an even lower number can take on a Swords Dance-boosted Scyther reliably. The only thing that prevents Scyther from being completely unstoppable is its limited attacking movepool—the strongest STAB attacks it can use are Hidden Power Flying and Hidden Power Bug, and using these means it can't use Hidden Power Ground.</p>",
    "comments": "<h1>Other Options</h1> <p>If Scyther has Hidden Power Ground, it is a reasonable choice to use Light Screen over Baton Pass, which will make dealing with Scyther even harder than usual for Pokemon like Slowbro and Nidoqueen and can also be used to assist a teammate like Sandslash in setting up if Scyther can't do much on its own. Hyper Beam can also be used over Baton Pass as a surprise move to deal a huge amount of damage to an unsuspecting foe, potentially KOing it from a range well outside what Scyther is normally capable of. Scyther is also deceptively bulky and is somewhat likely to survive a follow-up attack on the recharge turn if the opposing team lacks a Rock-type move. Scyther can use Agility with Baton Pass to pass Speed boosts to sweepers like Quagsire, Sandslash, Victreebel, and Politoed. However, it must drop either Swords Dance or a coverage move, which is likely to heavily impact its overall effectiveness and decrease its ability to take on Haze users and phazers. Scyther can try to use a RestTalk set with Swords Dance and an attacking move, but no matter which attack it chooses, it will be nearly certain to encounter foes that wall it completely. Scyther can also drop its item and use Thief in its fourth moveslot, potentially crippling one of its checks by taking its Leftovers.</p> <h1>Checks and Counters</h1> <p><strong>Ground-types</strong>: Piloswine is one of the most reliable Scyther answers. It threatens Scyther with either a STAB Ice-type attack or a Rock-type attack and can use Roar to phaze it or Curse to ready itself for taking on the Baton Pass recipient if it expects Scyther to pass its boosts away. However, +2 Hidden Power Bug can potentially 2HKO after Spikes damage. Sandslash and Quagsire also 2HKO Scyther with their Rock-type moves, whereas Scyther needs Hidden Power Bug and Spikes support to threaten a 2HKO in return. Gligar is merely 3HKOed by +2 Wing Attack, but it can only 3HKO in return with its own Wing Attack. However, if Scyther attacks it, Gligar can retaliate with Counter, so Scyther will rarely want to risk attempting to take Gligar on.</p> <p><strong>Gyarados</strong>: Gyarados can 2HKO Scyther with Hidden Power Flying or 3HKO with Thunder and also gets Roar to phaze it if it attempts to use Baton Pass. In return, a +2 Scyther can only manage a 3HKO with Wing Attack.</p> <p><strong>Jumpluff</strong>: As it outspeeds Scyther, Jumpluff can switch in on a predicted Swords Dance and use Encore to stop Scyther from attacking it or passing its boost away. Alternatively, it can use Sleep Powder or Stun Spore to cripple Scyther. If Scyther anticipates Jumpluff's entry and uses Wing Attack, it is still at risk of being hit by a status move, meaning Jumpluff may be able to safely heal off the damage with Synthesis as Scyther switches to avoid the status. Jumpluff can also run Hidden Power Flying as a means of damaging Scyther that try to take it on or to revenge kill a low health Scyther.</p> <p><strong>Crobat</strong>: Crobat is the only true counter to Scyther, having higher Speed and access to Haze to remove any boosts, as well as being able to hit it super effectively with STAB Wing Attack or Hidden Power Flying. As Crobat can remove any boosts Scyther has before it can attack, Wing Attack can only muster a possible 5HKO against Crobat, while Crobat easily 3HKOes in return with its own Wing Attack. However, Crobat's effectiveness outside of countering Scyther tends to be quite limited, so it is not particularly common.</p> <p><strong>Kabutops and Graveler</strong>: Kabutops survives a +2 Hidden Power Ground and OHKOes Scyther in return with Ancient Power. However, it has no way to prevent Scyther from using Baton Pass, so this must be taken into account. Graveler survives a +2 Hidden Power Ground and OHKOes Scyther in return with Hidden Power Rock or Rock Slide. It can also use Explosion to attempt to take out Scyther or its Baton Pass recipient in one hit.</p> <p><strong>Hard-hitting Physically Bulky Pokemon</strong>: Pokemon such as Curse Granbull, Slowbro, and Omastar don't reliably counter Scyther, but if they are healthy and Scyther lacks a coverage move that hits them super effectively, they pose a threat to both Scyther and many of the Pokemon that Scyther may be intending to pass its boosts to. Granbull's simultaneous Attack and Defense boosting makes it difficult for any common recipient to deal with it; Slowbro is incredibly physically bulky, does solid damage with its STAB attacks, and may have Thunder Wave to cripple Scyther; and Omastar has a hard-hitting Surf that may be paired with Ice Beam, Haze, or even Ancient Power to hit Scyther hard or erase its boosts as it tries to pass them. However, it must be kept in mind that Scyther 2HKOes Slowbro with +2 Hidden Power Bug and 2HKOes Omastar with +2 Hidden Power Ground.</p> <p><strong>Electric-types</strong>: Ampharos survives +2 Hidden Power Ground and can OHKO Scyther in return with Thunder. Electabuzz Speed ties with Scyther and has a chance to OHKO Hidden Power Ground variants with Thunder due to the reduced HP DV; however, it is almost impossible for it to OHKO Hidden Power Bug Scyther, and +2 Hidden Power Ground can also OHKO Electabuzz, being particularly likely to do so after Spikes damage. Magneton is easily OHKOed by +2 Hidden Power Ground, but it survives unboosted Hidden Power Ground and OHKOes in return with Thunder. It is also one of the most reliable counters to Hidden Power Bug Scyther, although it must beware of Ground-type Baton Pass recipients. Electrode outspeeds Scyther and 2HKOes it with Thunderbolt, while Scyther requires a high damage roll to OHKO after Spikes with +2 Hidden Power Ground. Electrode can also paralyze Scyther with Thunder Wave or use Explosion to bring it to low health.</p> <p><strong>Nidoqueen</strong>: Scyther's Swords Dance-boosted Hidden Power Ground can 2HKO Nidoqueen, but Nidoqueen can hit it with Lovely Kiss to incapacitate it before it can finish Nidoqueen off. Hidden Power Ground Scyther is likely to be 2HKOed by Thunder or Fire Blast from Nidoqueen and risks getting paralyzed by Thunder, whereas Hidden Power Bug Scyther is less likely to be 2HKOed but also fails to 2HKO Nidoqueen due to lacking a super effective attack.</p>",
    "sets": {
      "Swords Dance": {
        "description": "<h1>Set Description</h1> <p>Swords Dance rapidly increases Scyther's already high Attack, transforming it from a relatively weak attacker into a menacing threat. Wing Attack is a low-Base Power but reliable STAB attack that is preferred over other options such as Return due to its ability to land super effective damage on Grass-types like Jumpluff and Bellossom as well as opposing Scyther and Pinsir. Against neutral targets, Wing Attack is marginally weaker than Return, but hitting the aforementioned targets hard is very important. Hidden Power Ground is the preferred coverage move, offering perfect coverage alongside Wing Attack and hitting common Poison-, Electric-, and Rock-types including Nidoqueen, Qwilfish, Haunter, Ampharos, Magneton, Electabuzz, Omastar, and Kabutops for 2HKOs or better after a Swords Dance boost. The alternative is Hidden Power Bug, which can be chosen to deal massive damage to the tier's numerous strong Psychic-type Pokemon, including Slowbro, Hypno, Mr. Mime, and Kadabra, while also offering a small boost in power against neutral targets like Granbull and Piloswine. However, choosing Hidden Power Bug means Scyther will be unable to hit Magneton and will miss out on numerous 2HKOs listed above. When matched up against such foes and in many other cases, Scyther's best choice may be to Baton Pass its boosts to a teammate such as Nidoqueen, Dodrio, Granbull, Gyarados, Quagsire, or Kabutops. These Pokemon can greatly benefit from the additional Attack boost, which may allow them to break past their usual checks. Baton Pass is also great for scouting what Pokemon the opponent might switch into Scyther and reacting accordingly, since it will usually go first due to Scyther's Speed if the foe stays in and will go after the switch if it doesn't.</p> <h1>Team Options</h1> <p>Nidoqueen makes for a good teammate for Scyther thanks to the pair's good typing synergy—Scyther is immune to Ground and makes for an excellent pivot with Baton Pass, whereas Nidoqueen easily takes any Rock- and Electric-type moves aimed at Scyther. Furthermore, Nidoqueen benefits from being passed one or more Swords Dance boosts, which can allow it to get past its usual checks like Granbull and Slowbro. Many Pokemon will try to make Scyther easier to handle by paralyzing it with Thunder Wave or Stun Spore, so it can be helpful to use a Pokemon that can take status moves well such as RestTalk Slowbro or RestTalk Hypno, both of which also happen to serve as decent Nidoqueen checks. Other Hypno sets also make for great status spreaders and supporters in general thanks to Hypno's access to Light Screen, Thunder Wave, and Hypnosis. Ampharos is another option for Light Screen support; it can also draw in Ground-types such as Nidoqueen as it sets up the screen, which can give Scyther an opportunity to come in on Earthquake. Granbull, particularly a variant with a coverage move, stands to benefit greatly as a Swords Dance recipient, as almost no Pokemon can take boosted attacks from it for long. Dodrio is likewise an enormous threat when passed a Swords Dance boost, especially considering it outspeeds Qwilfish, one of the tier's most prevalent Haze users. Quagsire and Piloswine are other good Swords Dance receivers that double as Electric-type checks. Gyarados and Kabutops can also become much more challenging to take on once passed Attack boosts from Scyther. Pokemon with Explosion such as Haunter and Electrode can be useful for their ability to break through or weaken some of Scyther's checks, such as Nidoqueen, Piloswine, Sandslash, and Quagsire; they can also support it with screens and status moves. Mr. Mime and Jumpluff are also great at easing setup for Scyther with their status moves and access to screens, and they can also use Encore to lock foes into moves that Scyther can easily switch into. Lastly, Spikes damage can help Scyther to secure some crucial KOs, such as against Electabuzz and Kadabra, so Qwilfish is a useful teammate.</p>"
      },
      "All-Out-Attacker": {}
    },
    "credits": {"writtenBy": [{"username": "Earthworm", "user_id": 15210}], "teams": [{"name": "Quality checked by", "members": [{"username": "Diophantine", "user_id": 370164}, {"username": "Century Express", "user_id": 234737}]}, {"name": "Grammar checked by", "members": [{"username": "Empress", "user_id": 175616}, {"username": "Lumari", "user_id": 232216}]}]}
  },
  "Electabuzz": {
    "overview": "<p>Electabuzz boasts a great Speed stat, respectable offensive stats, and a useful movepool to complement them. Its powerful Electric-type attacks together with coverage options from several other types allow it to force a lot of switches. Electabuzz requires no setup in order to deal a lot of damage, which sets it apart from many other offensive Pokemon in terms of generating offensive pressure. However, due to its lack of bulk, Electabuzz is somewhat of a glass cannon. Its Speed means that it is a viable revenge killer for offensive threats such as Dodrio, Kabutops, and Gyarados, which the other Electric-type Pokemon in the tier underspeed. This black and yellow beast is best played with aggression to shock foes with its offensive prowess.</p>",
    "comments": "<h1>Other Options</h1> <p>Electabuzz can run RestTalk with Thunder and Psychic to give it some longevity, which it sorely lacks. However, this will leave it easily walled by Pokemon like Bellossom, Chansey, Magneton, and Piloswine, which Electabuzz can usually afford to cover in its other moveslots. Toxic can be used to wear down these Pokemon, forcing some Pokemon like Quagsire and Gligar to use Rest or depleting Heal Bell PP on Granbull and Chansey. Thief allows Electabuzz to steal Leftovers from Pokemon that normally check it quite well like Hypno and Bellossom, which helps to eliminate them more easily later on, but this means that Electabuzz must either sacrifice Pursuit or some coverage options for a one-time usage move. Counter allows Electabuzz to surprise KO some physical attackers like Granbull, but its frailty means that it has difficulty in doing this consistently in a tier where Earthquake is very common. It is also incompatible with Cross Chop and Pursuit. Fire Punch, replacing Ice Punch, lets Electabuzz hit Magneton for super effective damage while doing the same to the Grass-types, though it does considerably less to Jumpluff and Gligar. Reflect and Light Screen can be used to support teammates and allow Electabuzz to partially overcome its lack of bulk, but there are several more viable users of these moves in the tier, and using them comes with the opportunity cost of some offensive pressure, which is Electabuzz's biggest selling point. Thunder Wave gives Electabuzz a more reliable method of spreading paralysis, but it is not a common choice because many Pokemon that will try to switch into Electabuzz are Ground-types, and using it also means that coverage is sacrificed.</p> <h1>Checks and Counters</h1> <p><strong>Ground-types</strong>: Piloswine, Nidoqueen, and Quagsire all reliably switch into Electabuzz and threaten it immediately with powerful Earthquakes. However, Piloswine must be careful of Cross Chop, which can 3HKO it, Nidoqueen is forced to recover if hit by Psychic on the switch and thus gives the Electabuzz a free turn, and Quagsire is 2HKOed by Hidden Power Grass. Sandslash and Graveler can also serve as checks, although they fear Electabuzz's coverage attacks due to their low Special Defense.</p> <p><strong>Specially Bulky Pokemon</strong>: Pokemon with good special bulk, particularly those that resist Electric like Ampharos and Bellossom, wall Electabuzz and can wear it down or inflict status on it. Electabuzz's best chance of breaking through these checks is with status, such as an Ice Punch freeze, Thunder paralysis with timely activations, or the rare Toxic. Hypno, Chansey, and Lanturn can also serve as effective Electabuzz checks with their bulk and access to status moves, but Hypno and Lanturn can be 3HKOed by Thunder after Spikes, and Chansey is 2HKOed by Cross Chop if Electabuzz has it. Shuckle can also wall Electabuzz and either PP stall it or poison it with Toxic.</p> <p><strong>Status Moves</strong>: Electabuzz rarely runs Rest and depends heavily on its high Speed, so it dislikes being statused. Slowbro, Slowking, and Ampharos can catch Electabuzz off guard with a Thunder Wave, and Jumpluff can paralyze it with Stun Spore. Mr. Mime, Haunter, and Hypno can force it to sleep with Hypnosis.</p> <p><strong>Magneton</strong>: Magneton is not a consistent answer against Cross Chop or Fire Punch variants of Electabuzz, but it is a great check otherwise thanks to its resistance to Electric, Ice, and Psychic-type attacks.</p> <p><strong>Hitting It On the Switch</strong>: Due to its frailty, Electabuzz is worn down easily by most STAB attacks. Attacking Electabuzz as you anticipate it coming in is an effective method of curbing the damage it can inflict on your team.</p>",
    "sets": {
      "All-out Attacker": {
        "description": "<h1>Set Description</h1> <p>Thunder and Thunderbolt are the obligatory STAB attacks that allow Electabuzz to scare most of the Water-type Pokemon in the tier, such as Slowbro, Qwilfish, and Omastar, and most of the Flying-types, such as Scyther, Dodrio, and Crobat. Psychic is Electabuzz's strongest attack to hit Nidoqueen and deals around 40% to it—with Spikes support, this is enough damage to force Nidoqueen to recover with Moonlight. This allows Electabuzz to aim for a Special Defense drop or switch out to gain a free turn for some momentum. It is noteworthy that Electabuzz avoids an OHKO from Nidoqueen too. Psychic also allows Electabuzz to reliably 2HKO Haunter without having to take the risk with Thunder's accuracy. Ice Punch can be used to hit Grass-types like Jumpluff and Bellossom for super effective damage while also dealing a heavy blow to Gligar, and a chance to freeze should never be scoffed at. Pursuit allows Electabuzz to trap Haunter and Slowbro, weakening them for sweepers that struggle against them like Granbull, Sandslash, and Kabutops. Alternatively, Cross Chop can be used to 2HKO Chansey and Magneton and also hits Piloswine hard. Hidden Power Grass can catch Quagsire off guard and still hit Piloswine. It is important to keep in mind that Cross Chop and Pursuit are incompatible with each other.</p> <h1>Team Options</h1> <p>Electabuzz's aggressive nature and ability to force switches means that Qwilfish, which provides Spikes support, makes a great partner for it. As Electabuzz tends to allow Ground-types like Nidoqueen and Quagsire to switch in, it is wise to pair Electabuzz with Pokemon that can shrug off Earthquake such as Bellossom, Slowbro, and Gligar. Electabuzz's ability to Pursuit trap Slowbro and Haunter effectively means that Granbull, which is usually checked by these Pokemon, can run rampant on enemy teams. Having a secondary answer to Water-types, like Bellossom or Jumpluff, is wise, as Electabuzz's frailty means it cannot switch into Surfs consistently.</p>"
      },
      "RestTalk": {
        "description": "<h1>Set Description</h1> <p>Thunderbolt's accuracy is more valuable than the power behind Thunder with Electabuzz electing to play the long game, especially when it comes to checking foes like Gyarados. With Rest, Electabuzz has ample opportunities to trap foes like Haunter with Pursuit. However, it has to be cautious of Hypnosis when trying to recover. Psychic is an alternative to get more chip damage on Ground-types like Nidoqueen and Piloswine and 2HKO Haunter. Despite typically being offensive, Electabuzz can Rest on a solid amount of foes and appreciates nullifying ailments like Hypnosis from Mr. Mime and Stun Spore from Bellossom and Jumpluff.</p> <h1>Team Options</h1> <p>RestTalk Electabuzz is best suited for stall teams that complement Electabuzz's longevity and appreciate it being able to both trap Haunter and counter Gyarados. Partners like Blastoise and Hypno cover the Ground-types like Piloswine and Nidoqueen that Electabuzz cannot handle as easily without its usual coverage. Heal Bell support from Chansey to wake it early can be useful, and Chansey can sponge hits from stronger special attackers like Mr. Mime and Magneton. Shuckle makes for an excellent partner to deal with Nidoqueen and physical attackers like Granbull that can often gain free turns off of Electabuzz. Granbull itself is a nice partner, as it can be an additional Nidoqueen answer and win the game once Electabuzz traps Haunter. Crobat can deal with the Grass-types that Electabuzz cannot touch. It also stops Scyther from passing Sword Dance boosts and is a more consistent answer than Electabuzz. In return, Electabuzz traps Slowbro.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "avarice", "user_id": 346653}], "teams": [{"name": "Quality checked by", "members": [{"username": "Earthworm", "user_id": 15210}, {"username": "Century Express", "user_id": 234737}, {"username": "Estarossa", "user_id": 461329}, {"username": "Mystras", "user_id": 530118}]}, {"name": "Grammar checked by", "members": [{"username": "deetah", "user_id": 297659}, {"username": "Astra", "user_id": 240732}, {"username": "Sabelette", "user_id": 583793}]}]}
  },
  "Pinsir": {
    "overview": "<p>Pinsir has one of the highest Attack stats of any Swords Dance user in GSC UU. Its STAB Hidden Power Bug threatens common Pokemon such as Bellossom, Slowbro, Slowking, Hypno, and Mr. Mime. It has relatively few weaknesses, notably lacking the problematic weakness to Electric that its biggest competition Scyther has, and its above average Speed also lets it outrun Pokemon such as Nidoqueen, Kabutops, Victreebel, and Politoed. However, Pinsir can be difficult to switch in because of its low HP and Special Defense in a metagame with numerous special threats. Moreover, Pinsir is absolutely stonewalled by Haunter unless it runs the rare Hidden Power Ground and struggles with other common Pokemon such as Fire Blast Nidoqueen, Qwilfish, and Scyther. Lastly, Pinsir faces huge competition from one of the best Pokemon in the tier in Scyther, which is faster, immune to Spikes, has better special bulk, and can do more for its team because of Baton Pass.</p>",
    "comments": "<h1>Other Options</h1> <p>Hidden Power Ground is Pinsir's most viable other option; alongside a Normal-type attack, it gives Pinsir perfect neutral coverage in only two moves and lets it beat Haunter and Nidoqueen more easily, but losing Hidden Power Bug leaves Pinsir worse off against Psychic-types like Slowbro, Hypno, and Mr. Mime. Pinsir can use Rest alongside Mint Berry in order to bring it back to full health and get rid of status. Alternatively, Substitute can potentially be used to block attempts to inflict status on Pinsir and take advantage of Pokemon that are unable to move due to sleep or paralysis. Miracle Berry is an option, although the lack of Leftovers with Pinsir's bad special bulk make it a niche option. Lastly, Pinsir can run a set with Endure and Flail that has sweeping potential when Pinsir is partnered with a Pokemon that can pass Speed to it, but it is next to worthless otherwise.</p> <h1>Checks and Counters</h1> <p><strong>Haunter</strong>: Haunter is the best Pinsir check because it 4x resists Hidden Power Bug and is completely immune to Submission and Double-Edge. A Pinsir switching out lets Haunter use Hypnosis on anything that comes in or hit hard with Thunder or Psychic. However, if Pinsir is running Hidden Power Ground, then it can beat Haunter unless it hits Hypnosis or is carrying Destiny Bond, which can force a trade.</p> <p><strong>Nidoqueen</strong>: If Nidoqueen is running Fire Blast, then it will beat Pinsir in a one-on-one matchup, although it takes big damage from Hidden Power Ground or Double-Edge after a Swords Dance. In addition, Lovely Kiss is able to disrupt offensive Pinsir's momentum—although this is limited to non-Sleep Talk sets—and Moonlight gives decent longevity against RestTalk variants, but it hates getting paralyzed by Body Slam.</p> <p><strong>Qwilfish</strong>: Qwilfish has good Defense, and Haze lets it get rid of any boosts Pinsir has obtained. It also has a chance to 3HKO with Hydro Pump and can put down Spikes when Pinsir switches out. However, Pinsir can deal massive damage to Qwilfish if it manages to win the Speed tie.</p> <p><strong>Scyther</strong>: Scyther outspeeds Pinsir and 3HKOes with Wing Attack; this can also be brought to a 2HKO if Pinsir takes recoil from Double-Edge. If Scyther finds itself against an unboosted Pinsir, it can generally set up Swords Dance freely. However, Scyther must beware of being paralyzed when switching in, and it can potentially lose to Pinsir if it switches into a full health Pinsir that just used Swords Dance.</p> <p><strong>Jumpluff</strong>: Jumpluff dominates offensive Pinsir because it is not 2HKOed unless Pinsir sets up and can easily lock Pinsir into Swords Dance. It can also cripple Pinsir with Sleep Powder or Stun Spore. Some Jumpluff carry Hidden Power Flying, making it an even worse matchup. However, Jumpluff falls flat against RestTalk variants, since Encore fails against called moves from Sleep Talk, and Jumpluff is crippled by paralysis from Body Slam from either Pinsir variant.</p> <p><strong>Crobat</strong>: Crobat is a very reliable Pinsir check because of its access to Haze, letting it remove any of Pinsir's boosts. It can also take a few Double-Edges because of its decent bulk and 3HKO Pinsir in return with Hidden Power Flying or Wing Attack. However, Crobat hates being paralyzed by Body Slam.</p> <p><strong>Rock- and Steel-types</strong>: Omastar, Kabutops, and Magneton all are unreliable when dealing with the offensive set because of Submission, but they all dominate the RestTalk set because of their Body Slam resistance and ability to hit Pinsir very hard, although Kabutops hates being paralyzed by Body Slam.</p> <p><strong>Fire-types</strong>: While all the Fire-types are rare, they dominate Pinsir one-on-one. Magmar and Arcanine are able to outspeed and OHKO Pinsir and can reliably switch into Hidden Power Bug. Flareon is also able to OHKO Pinsir, but it is hit rather hard by Double-Edge and is slower.</p>",
    "sets": {
      "Swords Dance": {
        "description": "<h1>Set Description</h1> <p>Pinsir is a powerful wallbreaker in a metagame where its STAB Hidden Power Bug is highly appreciated due to a lot of top threats being Psychic-types, and it can also hit Bug-resistant foes hard with its coverage moves. Double-Edge is Pinsir's most powerful move, notably 2HKOing Nidoqueen after a single Swords Dance. Two alternative options for Double-Edge are Return and Body Slam. The former has more power than Body Slam and retains the ability to 2HKO Nidoqueen if Spikes are up, while the latter doesn't hit as hard but effectively threatens the Pokemon that are often used to check Pinsir, such as Scyther, Jumpluff, and Crobat with paralysis. Submission targets Magneton, Kabutops, and Omastar, which can take both of the other attacking moves, and having a powerful move for Granbull is very handy. Pinsir sets up best against Pokemon it scares out such as Slowbro, Slowking, Hypno, and Chansey, although it must watch for status.</p> <h1>Team Options</h1> <p>Pinsir struggles with Qwilfish, Scyther, and especially Haunter, so Pursuit Electabuzz makes a great partner, as it threatens the former two and traps Haunter. Pinsir's great attacking power after a Swords Dance means the opponent will often have to sacrifice a Pokemon to take it down, which can let powerful attackers such as Nidoqueen and Curse Granbull clean up late-game. Gligar, although a niche Pokemon, is a good Pinsir partner because Pinsir has a good matchup against Ice Beam Nidoqueen variants, while Gligar checks Fire Blast Nidoqueen variants. Blastoise works well alongside Pinsir to spin entry hazards away, making setting up easier and offsetting recoil. Screen setters such as Chansey, Hypno, and Electrode can ease Pinsir's setup and make it harder to handle. Paralysis support is very useful for helping Pinsir beat faster Pokemon without taking too many hits. Pinsir is also great when stacked alongside other setup sweepers such as Scyther and Sandslash to overwhelm the opponent's defensive Pokemon when given screen support.</p>"
      },
      "RestTalk": {
        "description": "<h1>Set Description</h1> <p>This set is designed to take advantage of Pinsir's decent defenses and typing to set up on more passive Pokemon such as Hypno and Chansey without having to worry too much about status. This set also lets Pinsir beat Ice Beam variants of Nidoqueen, as it doesn't care about Lovely Kiss and doesn't take too much from Nidoqueen's attacks, letting it beat Nidoqueen in the long run. The point of running Body Slam on this set is to provide neutral damage output on Scyther and Nidoqueen and to paralyze Pokemon that tend to revenge kill Pinsir such as Dodrio, Crobat, and Jumpluff.</p> <h1>Team Options</h1> <p>Since this Pinsir set is walled by any Normal-resistant Pokemon, it is wise to pair it with Spikes so its counters are slowly worn down. As with the Swords Dance set, Pursuit Electabuzz makes a great partner for this set, as it forces Kabutops and Omastar out and Pursuit traps Haunter. Light Screen support from Electrode, Ampharos, or Hypno is nice for preventing Pinsir from being too overwhelmed by special threats. Granbull makes for an excellent partner, as Pinsir can take on Granbull's role of as a status absorber, allowing Granbull to run a more offensive set. Granbull will then be able to lure in Pinsir counters such as Magneton and Haunter and surprise KO them with Hidden Power Ground.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "dawnbuster", "user_id": 508601}], "teams": [{"name": "Quality checked by", "members": [{"username": "Earthworm", "user_id": 15210}, {"username": "Century Express", "user_id": 234737}]}, {"name": "Grammar checked by", "members": [{"username": "Rabia", "user_id": 336073}, {"username": "Astra", "user_id": 240732}]}]}
  },
  "Gyarados": {
    "overview": "<p>Gyarados has several traits that make it a solid choice in GSC UU: an unusual typing that grants it useful STAB attacks and resistances, the uncommon combination of high Attack and high Special Defense, and a unique and varied movepool. Its immunity to Spikes and Earthquake is great in a metagame where Ground-types such as Nidoqueen and Piloswine are common, and its resistance to Water alongside its access to Thunder makes it a solid check to the tier's prominent Water-types such as Slowbro and Blastoise. Moreover, its coverage and bulk make it an adequate check to Scyther and allow it to do just enough damage to the tier's bulkier foes that it can sometimes be difficult to deal with. What prevents Gyarados from being a top-tier Pokemon is its crippling weakness to Electric-type attacks, which are sadly a very common sight in the tier. Its low Special Attack stat also means that it has trouble breaking through bulkier Pokemon like Granbull and Slowking. Furthermore, if it lacks Rest or Heal Bell support, then paralysis is highly problematic, as once paralyzed it has very low chances of beating Moonlight Nidoqueen, one of the most common Pokemon in the tier.</p>",
    "comments": "<h1>Other Options</h1> <p>Zap Cannon can be used in place of Thunder to increase the odds of landing paralysis on checks such as Mr. Mime and Kadabra, although its low accuracy makes it a much less effective tool against the tier's bulky Water-types, so the trade-off is generally not worth it. Substitute can be used in place of Hidden Power Ground to improve Gyarados's matchup against Electric-types that rely on Thunder and take advantage of or block paralysis. Swagger is an option that can be used in combination with Substitute to help Gyarados break past bulky foes like Hypno and Blastoise, but its lack of consistency generally means it isn't worth it unless paralysis can be spread beforehand. Gyarados could use Surf over Hydro Pump, but it misses a crucial guaranteed 2HKO on Nidoqueen so is generally not worth it.</p> <h1>Checks and Counters</h1> <p><strong>Electric-types</strong>: Electric-types such as Electabuzz, Ampharos, Lanturn, and Magneton can OHKO Gyarados with their STAB Electric-type attacks. Gyarados can hit them for a 3HKO on the switch with Hidden Power Ground, however. Magneton also risks a potential OHKO from Hidden Power Ground variants.</p> <p><strong>Psychic-types</strong>: Most Psychic-types have a favorable matchup against Gyarados thanks to their access to Electric-type moves and lack of weaknesses to Gyarados's attacks. Hypno is very difficult for Gyarados to get past and can wear it down, inflict status on it, or set up a screen. Unlike Slowbro, Slowking is not 3HKOed by Thunder and can therefore take Gyarados on and wear it down with STAB Psychic or paralyze it. Mr. Mime and Kadabra take heavy damage from Double-Edge and Hidden Power Flying but threaten Gyarados with their Electric-type coverage.</p> <p><strong>Grass-types</strong>: Jumpluff and Bellossom wall Gyarados if it lacks Hidden Power Flying and can inflict status on it and wear it down with Leech Seed. However, they are both 2HKOed by Hidden Power Flying if Gyarados has it.</p> <p><strong>Normal-types</strong>: Granbull and bulkier Normal-types like Lickitung lack weaknesses to Gyarados's attacks and are bulky enough that Gyarados fails to reliably 3HKO them. Granbull immediately threatens Gyarados back with its powerful STAB Return and can potentially stall Gyarados out of Hydro Pump with RestTalk; however, it does risk a 3HKO from Gyarados, especially if Spikes are up. Chansey can also take Gyarados on somewhat decently thanks to Soft-Boiled, although if it lacks Toxic and Counter, it may run out of Soft-Boiled PP before it can take Gyarados down. If Gyarados lacks Hidden Power Flying, the high recoil from Double-Edge will at least make Gyarados think twice about trying to take Chansey down.</p>",
    "sets": {
      "All-out Offensive": {
        "description": "<h1>Set Description</h1> <p>This set aims to take full advantage of Gyarados's offensive stats and movepool. Once Gyarados has been brought in on a predicted Earthquake or resisted attack such as Surf from Slowbro or Blastoise, it can fire off the attack that its trainer believes will deal the most damage to the Pokemon it will face that turn—Hydro Pump hits Nidoqueen for a 2HKO and scares out most other Ground-types, Thunder hits most Water-types fairly hard and can inflict paralysis, Double-Edge does solid neutral damage off Gyarados's impressive Attack stat, and Hidden Power Ground is the most powerful option against Electric-types such as Magneton and Electabuzz while also hitting Haunter hard on the switch. Very few Pokemon can handle this combination of attacks for long, with the notable exception of Grass-types. Hidden Power Flying is a STAB attack that can be used as an alternative, 2HKOing not only the aforementioned Grass-types but also Scyther and Pinsir, two dangerous Swords Dance users. However, dropping Hidden Power Ground leaves Gyarados without an option to 2HKO Magneton and also causes it to miss 3HKOs on Ampharos and Lanturn. Lastly, if a phazer is absent from your lineup, Gyarados makes for a solid Roar user that can threaten Scyther and potentially disrupt Speed passing attempts from Girafarig.</p> <h1>Team Options</h1> <p>This Gyarados set functions best on bulky offensive teams that run Nidoqueen for its typing synergy and Pokemon that can absorb status and hits like Hypno and Slowking. Spikes help both Gyarados and Nidoqueen punish the switches they force more effectively, so Qwilfish is also a desirable teammate. As Gyarados and Nidoqueen can both struggle to deal with Curse RestTalk Granbull and Spikes are of great importance to this kind of team's success, Haunter makes for another solid choice with its immunity to Rapid Spin and Return. It also has great offensive synergy with Gyarados, as its Explosion can be used to take down Gyarados checks like Ampharos and Hypno. Gyarados also makes for a decent recipient of Scyther's Swords Dance boosts, as it can take many special hits quite well, unlike other physical attackers.</p>"
      },
      "Rest": {
        "description": "<h1>Set Description</h1> <p>Rest Gyarados aims to take advantage of its high Special Defense and Spikes immunity to become a more reliable long-term check to bulky Water- and Psychic-types such as Slowbro and Hypno, two Pokemon that can be difficult for offensive teams to switch into due to their access to status moves and scarcely resisted STAB attacks. Hydro Pump is necessary to 2HKO Nidoqueen and threaten Granbull. Hidden Power Flying is the preferred secondary attack to allow Gyarados to deal with top threat Scyther more consistently. However, Thunder can also be used as a less effective option against Scyther while maintaining a KO threat on Blastoise and Slowbro, both of which could otherwise safely attempt to PP stall Gyarados. Double-Edge can be chosen as an option that doesn't sacrifice coverage against Lanturn and Ampharos, but with the set's defensive incline, generally these Pokemon are better dealt with by switching out or using Roar as they enter the field. Roar is a strong option that can be used to both offensively pressure opposing teams with Spikes up and to phaze stat-boosting foes. Alternatively, Gyarados can utilize Sleep Talk to reduce its downtime while asleep and give it the ability to absorb sleep effectively, although this limits its offensive potential. It should also be noted that other Water-types such as Slowking and Slowbro tend to make for better RestTalk users, as they fare better against Nidoqueen and Granbull and are less crippled by Thunder Wave. However, Gyarados has the advantage of Spikes immunity and a better matchup against Scyther.</p> <h1>Team Options</h1> <p>This Gyarados set requires support against Electric-types like Ampharos, so Ground-types such Nidoqueen and Piloswine are welcome teammates. Hypno and Ampharos are other useful choices that can easily stomach the Psychic- and Electric-type coverage that many of Gyarados's checks rely on. Chansey can be a useful teammate with Heal Bell, particularly if Gyarados lacks Sleep Talk. Qwilfish is handy for Spikes, which allow Gyarados to pose a greater offensive threat. It is a good idea to use Gyarados alongside a Pokemon that resists Normal, as Granbull and Dodrio have powerful STAB attacks that Gyarados cannot withstand for long, even with Rest. Magneton is a good check to mono-attacking Granbull and also checks Psychic-types. Despite its overlapping weakness to Electric, Omastar is one of the safest checks to the two Normal-type powerhouses.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Earthworm", "user_id": 15210}], "teams": [{"name": "Quality checked by", "members": [{"username": "Diophantine", "user_id": 370164}, {"username": "Century Express", "user_id": 234737}]}, {"name": "Grammar checked by", "members": [{"username": "Rabia", "user_id": 336073}]}]}
  },
  "Flareon": {"sets": {"Growth Pass": {}}},
  "Omastar": {
    "overview": "<p>Omastar sports an unfortunate weakness to Ground in a metagame with numerous strong Ground-types and lacks the key resistance to Water that other bulky Water-types have. However, what sets it apart is its resistance to Normal and Flying. Granbull is an incredibly powerful threat in GSC UU, and Omastar is the best counter to it by far. Omastar's STAB Surf, solid coverage, and high Special Attack allow it to put a solid dent in almost any foe, an advantage it has over competing Normal-resistant Pokemon such as Magneton, which struggles to hit Ground- and Electric-types hard. However, outside of countering Granbull and Dodrio and checking Scyther without Hidden Power Ground, Omastar's favorable matchups are few and far between, so it can sometimes feel like dead weight if the opponent chooses not to bring them.</p>",
    "comments": "<h1>Other Options</h1> <p>Hydro Pump is an alternative to Surf that offers even more power, potentially 2HKOing Granbull, Kabutops, and Pinsir, but is much riskier due to its lower accuracy and low PP. Dropping Leftovers and running Thief over Rest trades longevity for greater offensive presence by allowing Omastar to permanently deprive a foe of its passive recovery. Omastar can also use Reflect to boost its Defense against Pokemon like Scyther and help out Pokemon like Electabuzz and Mr. Mime, since they fear powerful physical attacks. Omastar can run Haze to allow it to check Baton Pass users such as Scyther and Girafarig, although most Baton Pass users can threaten Omastar, so it is important to time its use for the moment when it is most impactful. Toxic can be used to put some pressure on Pokemon like Chansey, Slowking, and Lanturn and force them to use Rest or use up Heal Bell PP while also threatening offensive Pokemon with permanent status. Ancient Power can be used to give Omastar sweeping potential if it is lucky enough to activate its secondary effect, and it also allows Omastar to 2HKO Scyther.</p> <h1>Checks and Counters</h1> <p><strong>Bulky Water-types</strong>: Lanturn and Slowking are the most difficult Pokemon for Omastar to overcome. Their resistance to Water and high Special Defense prevent Omastar from dealing significant damage to them, and they can target Omastar's low Special Defense with their STAB attacks to quickly knock it out. Other bulky Water-types such as Slowbro, Blastoise, and Politoed also have the advantage over Omastar, although unlike Slowking and Lanturn, Hidden Power Electric can 3HKO them after Spikes, so they aren't completely safe against it.</p> <p><strong>Electric-types</strong>: Ampharos Speed ties with Omastar, OHKOes with Thunder, and cannot be 3HKOed in return by Omastar's Surf, even after Spikes damage. Ampharos can also set up Light Screen to assist its team in handling a likely Nidoqueen switch as well as Omastar itself. Electabuzz and Magneton pose a similar threat to Omastar offensively, but both take heavy damage from Omastar's STAB attacks, so they cannot safely check it in the long term.</p> <p><strong>Grass-types</strong>: Bellossom, Victreebel, and Vileplume can safely counter Omastar that lack Ice Beam, but as the move deals upwards of 40% to them, they must be cautious of being hit by it on the switch, especially if they have been paralyzed beforehand. In return, they can OHKO most of the time with Giga Drain or Hidden Power Grass and can threaten to inflict status should Omastar switch out. Jumpluff can also safely check Omastar that lack Ice Beam, but there is a substantial chance it will be OHKOed by Ice Beam if it is caught by surprise.</p> <p><strong>Special Attackers</strong>: Special attackers like Mr. Mime, Electabuzz, and Electrode can take a hit or two from Omastar and deal heavy damage in return with their Electric-type attacks. Kadabra, Haunter, and Pikachu also threaten Omastar, but their lack of bulk means that they should avoid switching into Omastar's Surf or Hydro Pump—there is even a small chance of Pikachu being outright OHKOed by the latter.</p> <p><strong>Chansey</strong>: Chansey can easily force a stalemate with Omastar, as it takes next to no damage from any of its attacks. If Chansey has Present, it also poses a significant threat to Omastar due to its secondary type being Water. If Chansey has Light Screen, it can also allow a more dangerous teammate to switch in and set up.</p>",
    "sets": {
      "Normal-resistant Special Attacker": {
        "description": "<h1>Set Description</h1> <p>Omastar's STAB Surf deals massive damage to almost all physical attackers, easily 3HKOing Granbull and coming close enough to a 2HKO that Granbull can find it difficult to perform its usual role of checking Nidoqueen if it takes a Surf. Ice Beam deals a lot of damage to Grass- and Flying-types, 2HKOing Scyther most of the time and sometimes 2HKOing Bellossom after Spikes. Another option is Hidden Power Electric, which hits opposing Water-types that resist Surf quite hard, barring Lanturn and Slowking. Lastly, Omastar enhances its longevity by using Rest, which it can pair with Sleep Talk to remain a threat while asleep and become even harder for Curse Granbull to break, even if it has Lovely Kiss.</p> <h1>Team Options</h1> <p>Omastar's weakness to Electric and the pressure it can put on Granbull make Nidoqueen a good partner. The two Pokemon greatly appreciate extra damage from Spikes to help them pressure bulky foes, so Qwilfish makes for another solid choice of teammate. As Omastar is disadvantaged against other bulky Water-types and is afraid of Bellossom, bulky status absorbers such as Hypno, Lanturn, and Ampharos, as well as Pokemon that can cure status like Chansey and Granbull, make for useful teammates. Bellossom and Jumpluff can help out against Ground-types, which can use STAB Earthquake to inflict heavy damage on Omastar along with many Pokemon it is often paired with.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Earthworm", "user_id": 15210}], "teams": [{"name": "Quality checked by", "members": [{"username": "Century Express", "user_id": 234737}, {"username": "Diophantine", "user_id": 370164}]}, {"name": "Grammar checked by", "members": [{"username": "Rabia", "user_id": 336073}, {"username": "Oglemi", "user_id": 40358}]}]}
  },
  "Kabutops": {
    "overview": "<p>Consistent with its terrifying appearance, Kabutops is a unique and dangerous sweeper. With Swords Dance boosting its already high Attack, it can quickly become a terror to deal with, and the looming possibility of an Ancient Power boost can cause opponents to dread confrontations with this freakish fossil. Unfortunately, the fact that Kabutops runs such a move in its standard set should allow one to infer that Kabutops is lacking in the movepool department; notably, it lacks access to Rock Slide and Earthquake. Kabutops also has rather low HP and Special Defense stats, meaning it must move with care to ensure that it has enough HP left after setting up to take one or two foes down with it. Moreover, while its typing and decent Speed stat grant it winning matchups against all three of Nidoqueen, Granbull, and Scyther, it is far from a reliable response to any of these Pokemon. Instead, it is best played aggressively and, ideally, with screen support to maximize its opportunity to break through the opponent's defenses.</p>",
    "comments": "<h1>Other Options</h1> <p>Hidden Power Rock can be chosen over Ancient Power for its extra power, but the difference in damage is not all that big, Kabutops must sacrifice a chunk of HP to use it due to DV requirements, and using it means that Kabutops can't use Hidden Power Ground; also, Ancient Power's secondary effect is very useful when it activates. Kabutops can use Surf over Hydro Pump, but it would then miss out on the critical unboosted 2HKO on Nidoqueen. Hidden Power Bug is another alternative that can 2HKO both Slowbro and Bellossom at +2 Attack, although it has worse general coverage and thus can be difficult to fit on a set. Giga Drain is a decent surprise option for hitting Quagsire, Omastar, and opposing Kabutops, although it fails to 2HKO Quagsire consistently. Kabutops learns Rapid Spin, but the move is illegal with Swords Dance, which means that Kabutops essentially loses all of its damage-dealing potential if it uses it. Similarly, Flail is not available with Swords Dance, which severely limits the move's viability.</p> <h1>Checks and Counters</h1> <p><strong>Grass-types</strong>: Bellossom, Victreebel, and Vileplume counter Kabutops as long as they have a Grass-type STAB attack. Not only do they potentially OHKO Kabutops, but Kabutops also fails to come close to OHKOing any of them after a Swords Dance boost, and the Grass-types all have instant recovery to avoid being worn down. However, Jumpluff is usually 2HKOed by Ancient Power and is therefore a shaky check, despite having access to Encore.</p> <p><strong>Electric-types</strong>: Electabuzz and Ampharos make for solid answers to Kabutops, easily OHKOing it with Thunder. Both of them also avoid the 2HKO from Hidden Power Ground, although Electabuzz misses the OHKO on Kabutops if it has Thunderbolt and is usually OHKOed by +2 Hidden Power Ground after Spikes. Magneton takes more than 75% from unboosted Hidden Power Ground and should avoid switching into Kabutops, although it usually can survive a +2 Submission. Lanturn can survive a +2 Hidden Power Ground easily, but it can only OHKO Kabutops in return a third of the time, even with Thunder. Although less common, Electrode usually OHKOes Kabutops with Thunder and is rarely OHKOed by +2 Hidden Power Ground. Pikachu easily OHKOes Kabutops with Thunderbolt, but it cannot switch into it safely.</p> <p><strong>Bulky Water-types</strong>: Slowbro deals almost half of Kabutops's health with STAB Surf and is only 3HKOed by +2 Ancient Power around 20% of the time. Slowking also has a solid matchup against Kabutops thanks to RestTalk and its powerful STAB attacks, despite having lower Defense than Slowbro. However, if Kabutops boosts to +4, it reliably 2HKOes Slowking and has good odds to 2HKO Slowbro. Blastoise fares worse, losing to Kabutops if it switches in on Swords Dance most of the time. However, its STAB Surf can still weaken Kabutops significantly before it goes down. Lastly, Quagsire is the most reliable Water-type check of them all thanks to its resistance to Rock and ability to 2HKO Kabutops with Earthquake. However, it is 2HKOed by +2 Double-Edge should Kabutops have it.</p> <p><strong>Mr. Mime and Kadabra</strong>: These two Psychic-types outspeed Kabutops and have numerous ways to deal with it. Kadabra can lock Kabutops into Swords Dance with Encore and hit it hard with Psychic or Thunder Punch. Mr. Mime not only has Encore but also has Hypnosis and Thunder to threaten Kabutops. However, Kabutops can potentially 2HKO Kadabra if it catches it with Ancient Power or Double-Edge on the switch and also hits Mr. Mime fairly hard with its unboosted attacks.</p> <p><strong>Qwilfish</strong>: Qwilfish outspeeds Kabutops and can nullify its boosts with Haze. It also hits Kabutops fairly hard with Hydro Pump, so even if Qwilfish doesn't finish the job itself, it can weaken Kabutops for a teammate to finish it off safely.</p>",
    "sets": {
      "Swords Dance Sweeper": {
        "description": "<h1>Set Description</h1> <p>Kabutops primarily functions as a wallbreaker and sweeper, and its access to Swords Dance allows it to fulfill this role admirably despite its lack of high-Base Power STAB attacks. Kabutops can hit some foes reasonably hard before using Swords Dance, but to break through GSC UU's bulkier foes such as Slowbro and Blastoise, it will need to boost to +2 or even +4 Attack. Once boosted, there are virtually no foes that can reliably put a stop to its deadly mix of physical coverage and STAB Hydro Pump. Its primary physical STAB attack, Ancient Power, is surprisingly powerful, OHKOing Scyther when unboosted and 2HKOing a wide variety of foes that do not resist it after a boost. Kabutops can also realistically sweep an entire opposing team if it manages to acquire the fabled Ancient Power boost, which allows it to survive various attacks, boosts both its physical and special attacks, and allows it to outspeed literally all unboosted foes. Hidden Power Ground allows Kabutops to deal substantial damage to Electric-types such as Magneton and Ampharos as well as Qwilfish, one of the most common Pokemon in the tier and one whose high Speed, deceptively solid bulk, and access to Haze make it difficult for Kabutops to achieve a sweep. Alternatively, Kabutops can use Submission to maximize its chances against Granbull while still dealing decent damage to Magneton and hitting Rock-types such as Omastar and opposing Kabutops for heavy damage. Hydro Pump is recommended as the fourth attack, as it allows Kabutops to 2HKO Nidoqueen without the need to boost its Attack, a trait that is highly valuable. However, Double-Edge can also be used in this slot and is Kabutops's strongest available physical attack aside from Hyper Beam. Without Double-Edge, Kabutops notably fails to 2HKO Quagsire, Blastoise, and Slowking after reaching +2 Attack, although only Quagsire 2HKOes it in return with its standard set.</p> <h1>Team Options</h1> <p>Kabutops is a great addition to a team that can make use of an offensive sweeper. It provides little defensive utility, as even with its resistance to Normal, it performs inconsistently against Curse Granbull due to Hydro Pump's imperfect accuracy and Granbull's tendency to run RestTalk. For a more consistent approach to taking on Granbull, Haunter makes for a useful teammate and doubles as a Pokemon that can use Explosion to take down problematic foes like Electabuzz, Ampharos, and Bellossom for Kabutops. Similarly, while a healthy Kabutops can survive a +2 Hidden Power Ground from Scyther, Scyther's access to Baton Pass can foil Kabutops's attempts at threatening it and leave it to fend against a boosted foe that can OHKO it. Therefore, while Kabutops's somewhat useful defensive typing should be taken into consideration, it is Kabutops's offensive prowess that should primarily influence your teambuilding decisions. As one of the best wallbreakers in the tier, Kabutops appreciates being paired with other sweepers such as Pinsir, Scyther, and Sandslash that can take advantage of bulky foes having been weakened or else weaken them for Kabutops. Scyther deserves a special mention due to its ability to pass Swords Dance boosts to Kabutops, although the two of them share a common weakness to Electric, so the support of Ground-types such as Nidoqueen, Piloswine, Quagsire, and Sandslash is also welcome. Hypno and Bellossom are two potential teammates that can provide helpful paralysis, sleep, and screen support to Kabutops and its fellow sweepers. Kabutops particularly benefits from Qwilfish being paralyzed before it attempts a sweep, and Bellossom is great at drawing Qwilfish in for the purpose of paralyzing it. As Kabutops has somewhat respectable bulk for a sweeper and a fairly uncommon 4x weakness, it can also make fantastic use of screen support to mitigate its weaknesses to Ground and Electric. In addition to Hypno and Bellossom, Mr. Mime can also provide this support and potentially create opportunities for Kabutops to switch in with Encore, but it lacks the bulk of other supporters mentioned.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Earthworm", "user_id": 15210}], "teams": [{"name": "Quality checked by", "members": [{"username": "Century Express", "user_id": 234737}, {"username": "Diophantine", "user_id": 370164}]}, {"name": "Grammar checked by", "members": [{"username": "Empress", "user_id": 175616}, {"username": "deetah", "user_id": 297659}]}]}
  },
  "Crobat": {
    "overview": "<p>Crobat is a lesser-seen Pokemon in GSC UU, suffering from its lack of a strong STAB attack, shallow movepool, and poor typing that leaves it weak to common attacking types such as Electric and Psychic. However, it possesses a few defensive quirks that can't be replicated by any other Pokemon in the tier. Most notably, Crobat is the absolute best counter to GSC UU's most threatening sweeper in Scyther thanks to its base 130 Speed, access to Haze, and lack of a weakness to any of its attacks. It can also check other dangerous Pokemon in the tier such as Victreebel and Swords Dance Bellossom, and it notably is able to outspeed Quagsire that had an Agility boost passed to it, preventing a Belly Drum sweep. These niches give it a role on defensive teams. However, some of the most prominent Pokemon in GSC UU can switch into Crobat and threaten it easily, such as Nidoqueen, Slowbro, and Granbull.</p>",
    "comments": "<h1>Other Options</h1> <p>Crobat can run Sleep Talk over Thief to absorb sleep and be harder to take advantage of when sleeping, with Rest + Sleep Talk also making it a better check to Victreebel and Body Slam variants of Pinsir, but the utility provided by Thief or Toxic is hard to pass up. Giga Drain is an unexpected option for hitting Pokemon such as Kabutops, Omastar, Quagsire, and Graveler hard. Protect can be used to PP stall and slowly recover with Leftovers. Lastly, Crobat can try a set with Screech, Substitute, Mean Look, and Swagger that can be very annoying, taking advantage of Screech's Defense drop and Swagger's Attack boost to make foes hit themselves for big damage while they can't switch, although this set is quite luck reliant and requires Crobat to find opportunities to set up.</p> <h1>Checks and Counters</h1> <p><strong>Psychic-types</strong>: Psychic-types such as Mr. Mime, Slowking, Slowbro, and Hypno are all capable of threatening Crobat while not being hurt too much in return from Wing Attack. All of them are also able to threaten paralysis. However, all of them dislike Thief.</p> <p><strong>Pokemon with Electric-type Moves</strong>: Ampharos is not hurt too badly by Hidden Power Ground, and it can set up screens for its teammates or threaten Crobat greatly with Thunder. Nidoqueen threatens a potential 2HKO and paralysis with Thunder and can heal off damage with Moonlight or grab momentum with Lovely Kiss. Gyarados and Lanturn threaten Crobat with Thunder and take little from its attacks. Magneton and Pikachu are able to potentially OHKO Crobat with Thunder, but they both have to watch out for Hidden Power Ground, and Pikachu hates Thief.</p> <p><strong>Strong Attackers</strong>: Pokemon such as Dodrio, Piloswine, and Granbull can take advantage of Crobat's passivity to switch in and threaten it; Dodrio and Granbull are able to 3HKO with Double-Edge or Return, respectively, and Piloswine threatens with Ice Beam, Ancient Power, or Roar to force Spikes damage onto Crobat's teammates.</p> <p><strong>Rock-types</strong>: Omastar, Kabutops, and Graveler all threaten Crobat with super effective damage and don't take much damage from Hidden Power Ground. Graveler can come in against Crobat to use Rapid Spin and Kabutops can set up a Swords Dance. However, these Pokemon should be careful of Giga Drain, and they fear Toxic if they're not running Rest.</p> <p><strong>Status</strong>: Status moves from Grass-types such as Bellossom and Vileplume force Crobat to use Rest or have a teammate remove the status with Heal Bell. If Crobat is asleep or paralyzed, Pokemon such as Scyther have a chance of breaking through it.</p>",
    "sets": {
      "Haze": {
        "description": "<h1>Set Description</h1> <p>This set takes advantage of Crobat's high Speed and access to Haze to let it check dangerous setup sweepers. Haze is one of Crobat's best attributes, removing boosts from Pokemon such as Scyther, Pinsir, and Sandslash. Wing Attack is Crobat's most reliable source of damage and can 3HKO Scyther, Victreebel, Pinsir, and Bellossom. Thief can hurt the longevity of bulky Pokemon such as Ampharos, Hypno, and Nidoqueen that might try to switch in and threaten Crobat. Alternatively, Toxic has synergy with Spikes and can force a bulky Pokemon to use Rest. Confuse Ray has synergy with Crobat's high Speed and is its best way of making progress against bulkier Pokemon. Hidden Power Ground deals more damage to Pokemon such as Nidoqueen, Electabuzz, and Magneton on the switch, and it has synergy with Toxic because it hits most Toxic-immune Pokemon. Lastly, Rest is helpful for keeping Crobat healthy throughout a game; it's most useful when paired with a teammate that has Heal Bell, although Rest can let Scyther actually break through Crobat while it's asleep.</p> <h1>Team Options</h1> <p>Crobat is best used on defensive teams for its ability to check dangerous threats. Heal Bell support from Chansey or Granbull can remove sleep from Rest or paralysis that Crobat may have sustained. Pokemon that can deal with Electric-type moves such as Nidoqueen, Piloswine, and Hypno can be useful teammates when dealing with Pokemon such as Electabuzz and Pikachu. Hypno appreciates Crobat countering Scyther and is also useful for combating Psychic-types and providing Light Screen or Reflect support. Spikes support from Qwilfish is useful for chipping opposing Pokemon and has synergy with Crobat's Thief. Magneton and Ampharos help against Electric-types such as Electabuzz and Pikachu and can take on bulky Water-types such as Slowbro and Slowking. Blastoise is also found on defensive teams and can deal with Pokemon that can threaten Crobat, such as Omastar and Nidoqueen, while also being a decent check to Kabutops.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "dawnbuster", "user_id": 508601}], "teams": [{"name": "Quality checked by", "members": [{"username": "Earthworm", "user_id": 15210}, {"username": "Century Express", "user_id": 234737}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}, {"username": "P Squared", "user_id": 168392}]}]}
  },
  "Lanturn": {
    "overview": "<p>Lanturn is blessed with unique and valuable typing in a metagame full of Water-types. Its resistance to Water and Ice alongside its access to powerful STAB Electric-type moves makes it uniquely well positioned to take on common foes like Slowbro, Slowking, and Blastoise, and the threat of STAB Surf deters the usual checks to Electric-types, such as Nidoqueen and Piloswine. Its high HP, decent Special Defense, and lack of weaknesses to specially offensive types aside from Grass allow it to feasibly take on almost any special attacker, including powerful Psychic-types like Mr. Mime and Kadabra if needed. However, its weakness to Ground prevents it from switching into Ground-types despite being a bulky Water-type, and its middling Special Attack stat means it can struggle to threaten bulkier foes that are not weak to its attacks, such as Quagsire, Ampharos, and Hypno. Furthermore, Grass-types like Bellossom and Victreebel resist both of its usual attacks and can force Lanturn into a purely defensive role, in which it does not excel.</p>",
    "comments": "<h1>Other Options</h1> <p>Lanturn has access to several useful support options, including Thunder Wave, Light Screen, Toxic, and Confuse Ray. It is a viable option to drop Rest, Sleep Talk, or both and use some of these support options, although this limits the number of times Lanturn can take hits from Pokemon such as Slowbro and Mr. Mime and also makes it highly susceptible to status. Thunderbolt and Hydro Pump are options, but Thunder is preferred to Thunderbolt for its extra power and high chance of inflicting paralysis, and Hydro Pump is much less reliable than Surf, as its low accuracy allows Nidoqueen to potentially fish for a miss or attempt to run Lanturn out of PP by using Moonlight repeatedly. Ice Beam is available to target Bellossom and Jumpluff, although this is generally worse than the longevity offered by RestTalk.</p> <h1>Checks and Counters</h1> <p><strong>Grass-types</strong>: Bellossom, Victreebel, and Vileplume can all switch into Lanturn safely, although they are crippled by the potential paralysis from its Thunder. Once they have gotten in, they can threaten Lanturn with STAB attacks, boost their offensive stats with Swords Dance or Growth, or inflict status on Lanturn's teammates as they try to switch in.</p> <p><strong>Special Walls</strong>: Chansey, Hypno, and Ampharos take minimal damage from Lanturn's attacks and can force it out with the threat of powerful attacks, such as Chansey's Present and Ampharos's Thunder, or, in the absence of these options, set up Light Screen for a teammate, cripple Lanturn with status, or PP stall it. Chansey can also cure its teammates of paralysis that Lanturn may have inflicted.</p> <p><strong>Quagsire</strong>: Quagsire is the only viable Ground-type that is not weak to Surf. It can therefore switch into Lanturn relatively safely and threaten a 2HKO with its super effective STAB Earthquake. However, its Special Defense is not great, so it should be wary of switching into Surf too many times, especially if Spikes are up.</p> <p><strong>Nidoqueen</strong>: Nidoqueen is not a safe response to Lanturn, as Lanturn barely manages an average of 54% damage with Surf. However, if Lanturn is paralyzed or if a healthy Nidoqueen switches into any move other than Surf, Nidoqueen will have a significant advantage, as it can 2HKO Lanturn with its faster STAB Earthquake and potentially heal off any damage traded as Lanturn is forced to retreat.</p>",
    "sets": {
      "RestTalk": {
        "description": "<h1>Set Description</h1> <p>This is the most straightforward and reliable set for Lanturn. Thunder is the preferred Electric-type STAB attack, as its high base damage compensates for Lanturn's fairly low Special Attack, and its high paralysis chance poses a threat even to more resilient foes. Surf is Lanturn's most consistent attack and does just enough damage to Nidoqueen that it cannot recover enough health with Moonlight and Leftovers to stay out of 2HKO range, meaning if Lanturn connects with Surf on the switch, the standard Moonlight Nidoqueen will be forced to switch out or risk fainting. Rest gives Lanturn the ability to switch into many special attacks with ease without having to worry too much about getting worn down. Sleep Talk is particularly useful for keeping up Lanturn's threat level while it is asleep and therefore acts as a deterrent to dangerous foes like Nidoqueen, Scyther, and Granbull.</p> <p>Lanturn typically switches into one of the many Water-types in the tier, forcing them out with the threat of Thunder. From there, you are free to guess what the opponent might switch into and choose the appropriate move. Lanturn is quite an awkward Pokemon to switch into if the opponent does not have a special wall like Hypno, Chansey, or Ampharos due to its high power STAB attacks, good coverage, and the threat of paralysis from Thunder. It is one of very few Pokemon that is capable of safely taking repeated hits from the likes of Slowbro while threatening it in return and also having enough damage output to threaten Nidoqueen. However, due to it having a weakness to Ground, it cannot fulfill the same generic physical wall role that the other bulky Water-types in the tier can, nor can it safely check Nidoqueen despite being able to discourage it from switching in.</p> <h1>Team Options</h1> <p>While Lanturn has a clear niche with clear advantages, it can be difficult to fit onto a team, as while it performs admirably as a special wall, it does not compare to Hypno or Chansey in this regard, nor does it do everything one might want their bulky Water-type to do. Lanturn strongly benefits from additional measures to handle Nidoqueen; some options fit for this purpose include Granbull, the combination of Gligar and Piloswine, and other bulkier Water-types such as Quagsire and Slowking. Lanturn can have a difficult time dealing with the raw power of other Electric-types such as Ampharos and Electabuzz, so Ground-types such as Nidoqueen and Piloswine make for good teammates. These Ground-types also tend to draw in the Water-types that Lanturn can capitalize on. While Lanturn has enough power to threaten Granbull and can take a hit or two in return, it is wise to use a more reliable option to deal with Curse Granbull. Haunter and Magneton are two options that deal with mono-attacking Granbull reliably. Grass-types such as Bellossom are enormous problems for Lanturn; they are most safely dealt with by using another Rest user that is not weak to Grass, such as Hypno, Mr. Mime, or Pinsir. However, Qwilfish can also deal with Bellossom in the short term and provides Spikes that Lanturn and its team can take advantage of.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Earthworm", "user_id": 15210}], "teams": [{"name": "Quality checked by", "members": [{"username": "Century Express", "user_id": 234737}, {"username": "Diophantine", "user_id": 370164}]}, {"name": "Grammar checked by", "members": [{"username": "Rabia", "user_id": 336073}, {"username": "Astra", "user_id": 240732}]}]}
  },
  "Sudowoodo": {"sets": {"Curse + Self-Destruct": {}}},
  "Politoed": {"sets": {"Growth Sweeper": {}}},
  "Quagsire": {
    "overview": "<p>Quagsire is one of the best recipients of a Speed or Special Defense boost from Baton Pass in GSC UU. Getting either boost allows it to set up Belly Drum more easily against many foes and become a fearsome offensive threat that can sweep teams on the spot. Quagsire's great typing gives it only a single weakness to Grass and an Electric immunity without the usual weakness to Ice or Water. Quagsire also fits outside of Baton Pass teams, as it can do well as a Belly Drum sweeper with paralysis support. However, Quagsire struggles against Haze users due to its terrible Speed, even being outsped at +2 by Haze Crobat. Quagsire also lacks many resistances, meaning that some of the most common attacks of the tier, such as Nidoqueen's Earthquake, Hypno's Psychic, and Blastoise's Surf, do enough damage to discourage it from setting up. Due to its low Speed and reliance on Belly Drum for power, it is easy to revenge kill if it has not received a Speed boost. Quagsire's defensive utility is also questionable, as it cannot run RestTalk without sacrificing coverage or a boosting move, and it is outclassed as a mixed RestTalk user by Piloswine, which sports a superior STAB combination and higher Attack.</p>",
    "comments": "<h1>Other Options</h1> <p>Rest allows Quagsire to extend its longevity on its own. Heal Bell support from Pokemon such as Chansey and Granbull can let it pull off multiple Belly Drums in one match. However, Rest is more or less wasted on Baton Pass-oriented teams, where Quagsire is meant to go all out on sweeping. Curse can also be run over Belly Drum to maintain HP while still getting an offensive boost, and it also offers a bulk boost. However, it does not give Quagsire the immediate power it needs to sweep, and it can be difficult to break through bulky foes such as Slowbro before being forced to use Rest. Ice Beam and Surf allow Quagsire to threaten foes such as Piloswine and Jumpluff without having to set up. However, Quagsire is generally outclassed by Piloswine in this role.</p> <h1>Checks and Counters</h1> <p><strong>Haze Users</strong>: Haze can be a huge issue for Quagsire, as it removes the boosts that make Quagsire so powerful. Crobat can outspeed Quagsire at +2 and can switch in safely to use Haze. Qwilfish and Omastar, although taking major damage from Earthquake, outspeed a Quagsire without any Speed boosts and can stop a sweep with Haze.</p> <p><strong>Encore Users</strong>: Encore users such as Jumpluff, Mr. Mime, and Kadabra can come in on an unboosted Quagsire or a Baton Pass teammate and ruin Quagsire's sweep by forcing either one out. Shuckle gets a special mention, as it can survive any hit from +6 Quagsire and lock it into a move, which is generally enough to end a sweep.</p> <p><strong>Granbull</strong>: Curse variants of Granbull can use Curse on the turn that an Agility-boosted Quagsire uses Belly Drum, survive an Earthquake, and KO it back with Return. However, Granbull cannot beat Quagsire if it switches in on the turn Quagsire uses Belly Drum.</p> <p><strong>Slowbro</strong>: Slowbro can take most of Quagsire's hits, even tanking a +6 Earthquake around 90% of the time, and deal a significant amount of damage back with Surf, revenge killing after chip damage in tandem with Belly Drum recoil.</p> <p><strong>Gligar</strong>: Gligar stands up to any attack +6 Quagsire throws at it and can use Counter to OHKO in return.</p> <p><strong>Electrode</strong>: Electrode can outspeed Quagsire, even at +2, and revenge kill it with Explosion.</p> <p><strong>Grass-type Coverage</strong>: Quagsire's 4x weakness to Grass-type moves, as well as its somewhat below average Special Defense stat, means that it is vulnerable to most Grass-type coverage. Electabuzz can surprise Quagsire with Hidden Power Grass and KO it after a Belly Drum. Bellossom can OHKO Quagsire with its Hidden Power Grass. However, it has to watch out for Sludge Bomb sets.</p>",
    "sets": {
      "Belly Drum": {
        "description": "<h1>Set Description</h1> <p>This set works best as a Baton Pass recipient, utilizing boosts to set up with Belly Drum and more consistently sweep. It can also work outside of Baton Pass teams as a bulky setup sweeper that appreciates Heal Bell and paralysis support. Belly Drum is Quagsire's biggest asset, allowing it to do massive damage. Earthquake's STAB and high-Base Power make it a fantastic attack for a Belly Drum user, as it allows Quagsire to deal much more damage both before and after boosting than competing Belly Drum users such as Politoed and Poliwrath. It can threaten Pokemon such as Qwilfish, Nidoqueen, and Haunter significantly even before Belly Drum. After a Belly Drum, Quagsire has a small chance to OHKO even Slowbro, one of the most physically bulky Pokemon available. Hidden Power Rock targets Flying-types that otherwise wall Quagsire such as Scyther, Crobat, and Jumpluff, as well as Pinsir. Sludge Bomb gives coverage for the likes of Bellossom, which otherwise walls Quagsire. Alternatively, Amnesia allows Quagsire to set up on Hypno and Slowbro more reliably and can make Quagsire much more difficult to finish off. It is especially useful when Quagsire is forced to use Belly Drum when under 50% health. Finally, Protect is a solid option, as it allows Quagsire more Leftovers recovery and a way to block Explosion from the likes of Electrode and Haunter. However, remember that dropping Sludge Bomb for these options leaves Quagsire totally walled by Bellossom.</p> <h1>Team Options</h1> <p>A Baton Pass user is a great option if you plan on running Quagsire. Girafarig can pass a crucial Speed boost with Agility as well as defensive boosts with Amnesia or Curse, which can make it easier to set up. Scyther can supply Speed and Attack boosts, which immediately enhances Quagsire's offensive power. However, Scyther's lack of immediate power leaves it more susceptible to Haze users. Mr. Mime is another useful Baton Pass teammate, as it can threaten Haze users, set up with Barrier, induce paralysis, and lock foes into setup moves with Encore. Politoed and Poliwrath are other good Baton Pass recipients that can assist Quagsire by using Lovely Kiss on Haze users such as Qwilfish, preventing them from ruining a potential sweep. Hypno is also a good teammate, as it can spread paralysis to Quagsire's checks and potentially absorb status. Jumpluff and Bellossom can also spread paralysis. Granbull appreciates the paralysis support that is often paired with Quagsire and can use Lovely Kiss on checks such as Haze Qwilfish.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "BT89", "user_id": 487308}], "teams": [{"name": "Quality checked by", "members": [{"username": "dawnbuster", "user_id": 508601}, {"username": "Earthworm", "user_id": 15210}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}, {"username": "Rabia", "user_id": 336073}]}]}
  },
  "Slowking": {
    "overview": "<p>Slowking is a very well-rounded Pokemon with a solid typing, strong STAB attacks, and access to Thunder Wave. The reason Slowking isn't at the very top of GSC UU in terms of viability is that it competes with Slowbro, which is almost identical to Slowking, except Slowbro has higher Defense, whereas Slowking has higher Special Defense. Unfortunately for Slowking, Defense tends to be more valuable, meaning it can be hard to justify using it. However, Slowking does offer some perks against special attackers and notably Nidoqueen, the most commonly seen Pokemon in the tier.</p>",
    "comments": "<h1>Other Options</h1> <p>Slowking has access to a few other coverage attacks such as Zap Cannon, Fire Blast, and Ice Beam, which can be used to threaten Slowbro, Scyther, Pinsir, Jumpluff, and Bellossom, all of which may try to take advantage of Slowking. However, it is difficult to fit these alongside its existing moves without sacrificing other important coverage. Slowking also has access to Reflect, which can be used to shore up its Defense and support its teammates. Swagger can be used alongside Thunder Wave and dual STAB attacks to give Slowking a chance at getting past specially bulky foes, although this leaves it susceptible to status and without any recovery. A final gimmick is Belly Drum, which can be used with Earthquake, a STAB attack, and a Normal-type move alongside paralysis support to take advantage of the opponent responding to Slowking with their own Slowbro or Slowking. However, using this set leaves Slowking unable to perform its usual roles as effectively.</p> <h1>Checks and Counters</h1> <p><strong>Special Tanks and Bulky Water-types</strong>: Opposing Slowking, Hypno, Chansey, and Lanturn are specially bulky Pokemon that can either neutralize or beat Slowking as well as absorb status from Thunder Wave adequately. Chansey can threaten Slowking if it has Present, and Lanturn can beat it with STAB Thunder; however Thunder Wave is a bigger threat to them than the others because of Heal Bell's limited PP and the possible threat of a Moonlight Nidoqueen teammate paired with Slowking. Slowbro and Blastoise can also take Slowking's attacks well and don't mind status too much due to RestTalk, although Special Defense drops and critical hits threaten Blastoise, and the rare Zap Cannon may put them in a precarious position if it lands. If Slowbro or Slowking is being depended on for handling Slowking, the one carrying Thunder Wave will have the advantage in a PP war, despite full paralysis resulting in some PP being saved.</p> <p><strong>Electric-types</strong>: Ampharos is a fantastic answer to Slowking with its powerful STAB Thunder and commonly uses RestTalk, which improves its ability to take Thunder Wave. Electabuzz and Magneton can threaten Slowking with STAB Thunder too, but they lack the defenses to take repeated hits, fear Thunder Wave, and need to be aware of Slowking's potential to trade hits—unlike Slowbro, Slowking can afford to take a Thunder and not be put out of commission for the rest of the game.</p> <p><strong>Grass-types</strong>: Bellossom and Jumpluff make great checks to Slowking that lack Thunder Wave. Jumpluff depends heavily on its high Speed and therefore cannot risk taking Thunder Wave, but while Bellossom dislikes paralysis due to normally lacking Rest, it can shoulder the burden of paralysis for its team and still function reasonably well, especially in terms of pressuring Slowking. As Slowking sometimes drops Psychic for Thunder Wave, Victreebel and Vileplume can occasionally be used as checks, though they are significantly impaired by paralysis.</p> <p><strong>Physical Attackers</strong>: Slowking's Defense is not as high as Slowbro's, so it fears hard-hitting physical attackers like Dodrio, Granbull, Scyther, and Pinsir. Unlike Slowbro, Slowking will typically lose to Granbull when switching in due to being 3HKOed by unboosted Return and 2HKOed by +1 Return. Slowking also particularly fears Hidden Power Bug variants of Scyther and Pinsir, which can deal massive amounts of damage boosted or unboosted.</p>",
    "sets": {
      "Special Tank": {
        "description": "<h1>Set Description</h1> <p>Slowking can take on a significant portion of the metagame one-on-one with this set. While it doesn't take physical hits fantastically unlike its main competition, Slowbro, Slowking can somewhat make up for this with its ability to take powerful special attacks, such as Thunder from Mr. Mime and Haunter, and retaliate with debilitating paralysis. This increased ability to take risks with the opponent's special and mixed attackers makes Slowking less predictable than Slowbro and makes it more effective at using Thunder Wave against the dangerous special attackers in the tier. Slowking's STAB attacks provide excellent coverage; should Slowking use both Surf and Psychic, the only Pokemon that resist both attacks are Slowbro and Slowking. However, as Slowking often has Thunder Wave, it will often drop a STAB attack. RestTalk allows Slowking to remain healthy and threaten physical attackers that may be eager to come in and hit it on its weaker side while it is asleep. This combination also makes it one of the tier's best status absorbers. If Slowking reveals dual STAB attacks, it is more likely to see Scyther switching in on an anticipated Rest turn, since without Thunder Wave, the worst that can happen is taking a hit. If Slowking has Thunder Wave, Scyther is taking a much greater risk switching in, but Pokemon like Qwilfish will switch in if it lacks Psychic, and Ground- and Psychic-types like Sandslash and Girafarig become far more dangerous without Surf. Sleep Talk can be dropped to run both STAB attacks alongside Thunder Wave, but this decreases Slowking's flexibility and resilience.</p> <p>In addition to competing with Slowbro, Slowking also competes with Blastoise and Hypno. Blastoise lacks a resistance to Psychic and access to Thunder Wave but outspeeds Nidoqueen and Sandslash and has access to Rapid Spin and Roar. Hypno is almost equal to Slowking in terms of special bulk and has better utility options, but it is quite a bit worse off in terms of physical bulk as well as Special Attack, making it a much worse Nidoqueen check. However, its lack of a weakness to Electric makes it a better blanket check to special attackers. Slowking's decent physical bulk and high Special Attack mean it is somewhat capable of taking on physical threats like Granbull and Dodrio if it needs to, although Slowbro is far better suited to this, which arguably leaves Slowking in the awkward position of \"jack of all trades, master of none.\" Nevertheless, its solid utility alongside its excellent ability to switch into Nidoqueen safely—Slowking is not even consistently 3HKOed by Nidoqueen's Thunder, whereas there is a small chance of Slowbro getting 2HKOed after Spikes—makes it a worthy consideration for one's team.</p> <h1>Team Options</h1> <p>Slowking's well-rounded abilities lend it to supporting more offensive and balanced teams as a kind of anchor that can help take on the behemoth tanks of the tier like Nidoqueen and Slowbro while punishing the opponent's attempts to go on the offensive with Thunder Wave. Therefore, it will often find itself on teams with offensive Pokemon like Scyther, Pinsir, Sandslash, and Kabutops. Nidoqueen and Piloswine are obvious choices for teammates owing to their immunity to Thunder from the likes of Ampharos and Magneton; they also offer the ability to take on Scyther reasonably well, with Nidoqueen being particularly well suited for taking on the Hidden Power Bug variants Slowking fears most. Haunter and Magneton also make good partners for Slowking due to their ability to take on mono-attacking Granbull. Qwilfish is a good choice for a teammate for its access to Spikes, ability to function as a check to Pinsir, and ability to threaten Bellossom with Sludge Bomb. Grass-types like Bellossom and Jumpluff can help to spread paralysis and sleep beyond the opponent's designated status absorber by forcing switches with Leech Seed and Encore, which can help to set up slower sweepers like Pinsir and Sandslash. Jumpluff also serves as a check to Scyther and Pinsir, which often try to set up against Slowking. Victreebel and Vileplume can also help to spread status with Slowking by forcing switches with Leech Seed or the threat of setting up with Swords Dance, although their weakness to Psychic can make it more difficult to find opportunities to do so. Lastly, Slowking can be used alongside other bulky Water-types such as Omastar, Slowbro, and Blastoise to offer redundant defensive coverage and take advantage of their resilience and power to outlast foes. This works because most Pokemon with powerful attacks that hit them super effectively can be checked fairly safely by Pokemon like Nidoqueen, Chansey, Hypno, Jumpluff, and Bellossom.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Earthworm", "user_id": 15210}], "teams": [{"name": "Quality checked by", "members": [{"username": "Century Express", "user_id": 234737}, {"username": "Diophantine", "user_id": 370164}]}, {"name": "Grammar checked by", "members": [{"username": "Rabia", "user_id": 336073}, {"username": "Oglemi", "user_id": 40358}]}]}
  },
  "Girafarig": {
    "overview": "<p><strong>NOTE - This analysis is outdated as of October 2022 Agility Pass Ban. This set is the most up to date option you could run on Girafarig.</strong></p>",
    "comments": "<h1>Other Options</h1> <p>Girafarig has a fairly wide and useful movepool, so many things can work. Curse can be used instead of Amnesia to boost physically oriented teammates using coverage or recovery moves over setup. However, the Speed drop is usually less than ideal, and other Baton Pass users tend to be better at passing Attack and Defense boosts. Girafarig can also run a mixed offensive set with its other coverage options, such as Earthquake, which can nail Magneton unexpectedly and deal more damage to Electric-types in general. Thief is a solid option on such a set, as it hinders bulky, Leftovers-reliant foes such as Hypno.</p> <h1>Checks and Counters</h1> <p><strong>Physical Attackers</strong>: Girafarig's mediocre defenses and lack of Barrier leave it open to physical threats overcoming it. Curse + RestTalk Granbull can withstand Psychic and deal with common Baton Pass recipients while hitting back hard with Return. Quagsire and Piloswine can hit Girafarig hard with Earthquake and use Curse to give Baton Pass recipients difficulty. Piloswine is even able to use Roar. Girafarig is also vulnerable to Bug-types. Scyther and Pinsir are able to 2HKO it with Hidden Power Bug.</p> <p><strong>Magneton</strong>: Magneton resists Girafarig's standard coverage and can hit back hard with STAB Thunder, set up a Substitute, or use Reflect to assist against potential Baton Pass recipients. Although they are less common, Hidden Power Grass variants can also threaten Quagsire, one of the most common recipients of Girafarig's boosts. However, with some deft maneuvering, Girafarig can get around Magneton with Amnesia, Baton Passing to a Ground- or Grass-type at the right moment, or even with Earthquake.</p> <p><strong>Jumpluff</strong>: Jumpluff is a serious annoyance to Baton Pass chains. Its fast Encore can lock Girafarig into a boosting move, forcing it out as Jumpluff inflicts status on its team. Jumpluff can also use Encore as a Speed-boosted recipient attempts to set up for a sweep, foiling even a recipient equipped with Miracle Berry. However, Jumpluff can do nothing if a boosted Girafarig passes to a Miracle Berry Poliwrath or Politoed, as at +2 Speed, they can outspeed and put it to sleep before setting up.</p> <p><strong>Other Psychic-types</strong>: Hypno is easily able to tank hits from Girafarig and set up with Curse, the Defense boosts from which could nullify an attempted Belly Drum sweep. Mr. Mime is able to lock Girafarig and its recipients into a setup move with Encore.</p> <p><strong>Explosion</strong>: Girafarig is severely lacking in methods to deal with Explosion users. It cannot learn Substitute and there are very few Baton Pass users or recipients that resist Normal-type moves. Electrode can set up screens for its team before it explodes, since it can take multiple hits from Psychic. Haunter can put Girafarig to sleep before using Explosion, although there is a small chance that Psychic will OHKO Haunter in return if it misses or Girafarig has Miracle Berry. Graveler with Leftovers will almost always survive two hits from Psychic despite its horrid special bulk, and its Explosion will KO almost anything that does not resist it.</p> <p><strong>Haze</strong>: Although it can threaten a majority of them, Haze users can still pose a major threat to Girafarig if it has been crippled. Omastar, Blastoise, and Qwilfish are notable examples, although they all have to watch out for Thunder.</p>",
    "sets": {
      "Amnesia + Baton Pass": {"description": "<h1>Outdated Analysis</h1> <h1>Overview</h1> <p>Girafarig holds its niche in UU mainly as a Baton Pass user that can threaten Haze users, phazers, and status inducers with its respectable 90 base Special Attack. With its solid Special Attack and offensive movepool, it can also force Pokemon weak to its moves to retreat, creating more setup opportunities. It stands out among Baton Pass users as the only one able to pass Amnesia boosts, which makes it a decent support Pokemon that can give its setup sweeper teammates a boost in bulk or Speed. Girafarig has to be used with care, however, as its frailty leaves it susceptible to hard-hitting Pokemon, such as Piloswine and Granbull.</p>"},
      "Agility + Baton Pass [Outdated]": {
        "description": "<h1>Set Description</h1> <p>This set passes Speed and Special Defense boosts for a teammate to sweep. Agility is the best thing it can pass, since very few Pokemon can outspeed +2 sweepers. It can also pass an Amnesia boost so teammates can set up on special attackers; for example, +2 Special Defense Belly Drum Quagsire can set up on Slowking, which fails to do more than 50% with two uses of Surf. The last moveslot should be able to deter Haze users, phazers, and status inducers. Psychic is usually preferred due to it having high odds to 2HKO Nidoqueen and consistently deterring phazers such as Piloswine. Thunder is a worthwhile option due to the high number of Flying- and Water-types in the tier, including phazer Gyarados, although Ground-types are threatening if Girafarig forgoes Psychic. Dropping Amnesia to maximize coverage against phazers is a valid option.</p> <h1>Team Options</h1> <p>Quagsire makes for a great teammate, as Speed boosts allow Quagsire to power through things more efficiently with its deadly combination of Belly Drum and STAB Earthquake. Additionally, it lacks ways to effectively deal with Haze users and phazers prior to setting up. Poliwrath is another common choice for a Speed boost recipient, as it has Lovely Kiss + Belly Drum, which allows it to better deal with Haze users, phazers, and status inducers that might have switched in as Girafarig used Baton Pass. Politoed also gets these benefits while having higher Special Defense and no weakness to Psychic- and Flying-type attacks. It has lower Defense and Attack than Poliwrath, but still reaches close to 999 Attack at +6. Swords Dance Bellossom and Vileplume can use passed boosts to set up more reliably, although they can struggle against Haze users if they lack Sleep Powder. Pikachu makes for a solid receiver, since with a Growth passer such as Flareon, it can become an immensely strong threat. Explosion users such as Electrode and Haunter are great for taking down big threats, such as Granbull and Nidoqueen, while also providing screens and Thief support. Mr. Mime offers Baton Pass for keeping momentum as well as amazing utility with moves such as Encore, Thunder Wave, and Barrier.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "BT89", "user_id": 487308}], "teams": [{"name": "Quality checked by", "members": [{"username": "Earthworm", "user_id": 15210}]}, {"name": "Grammar checked by", "members": [{"username": "CryoGyro", "user_id": 331519}, {"username": "Muk", "user_id": 33374}]}]}
  },
  "Gligar": {"sets": {"The G-Word (Offensive Thief)": {}}},
  "Shuckle": {"sets": {"Defensive": {}}},
  "Piloswine": {"sets": {"The P-Word (RestTalk)": {}}}
}