{
  "Pidgeot": {
    "sets": {
      "Reflect": {
        "description": "<p>Although it's generally worse than Fearow, Pidgeot has the unique niche of being one of the best long-term answers to RestTalk Stantler and Dugtrio, giving it a strong place on balance and some offense teams. Pidgeot is faster than Stantler, immune to Earthquake, can set up Reflect to take minimal damage from Return, keeps itself healthy with Rest and Sleep Talk, and easily 3HKOes with Double-Edge. Double-Edge can also 3HKO several other common Pokemon like Xatu and Octillery and does solid chip damage to Weezing and Dewgong. While Dugtrio is faster than Pidgeot and can break through it with Substitute and Screech, it has to rely on Pidgeot not calling Double-Edge, since it is 2HKOed by Double-Edge and Rock Slide is only a 4HKO in return. Reflect also helps Pidgeot's teammates handle common switch-ins to it such as Graveler and Sudowoodo, and it can make Pidgeot a decent emergency switch-in to Fearow.</p> <p>Fearow is the single biggest reason to not use Pidgeot, as it's much faster and stronger and has Drill Peck. Importantly, Pidgeot is an ineffective check to Primeape because it’s slower and can only 3HKO, whereas Fearow outspeeds and threatens to 2HKO it. Without Drill Peck, Pidgeot also can’t 2HKO Pineco, though it can set up Reflect on a predicted use of Explosion. The fact that Pidgeot only runs one attacking move also means it's liable to call non-damaging moves when using Sleep Talk.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "BeeOrSomething", "user_id": 583728}], "teams": [{"name": "Quality checked by", "members": [{"username": "dawnbuster", "user_id": 508601}]}, {"name": "Grammar checked by", "members": [{"username": "StupidFlandrs48", "user_id": 633500}, {"username": "Tbolt", "user_id": 555379}]}]}
  },
  "Wigglytuff": {
    "sets": {
      "Paralysis-spreading Tank": {
        "description": "<p>Wigglytuff is an all-around great Pokemon in NU. With solid defensive stats and a fantastic movepool including moves such as the coveted Thunder Wave, it's a Pokemon that can fit on many teams. Wigglytuff checks many of the stronger attackers in the tier such as Xatu, Dugtrio, and Octillery with its great bulk, and it can cripple Pokemon that can otherwise hurt it, such as Primeape, with paralysis on the switch, meaning it can be a difficult Pokemon to play around. While it is walled by Rock-types and can be overwhelmed by setup sweepers such as Kingler and Stantler, this pink blob should always be considered for defensive and balanced teams alike.</p> <p>The choice of STAB attack comes down to if Wigglytuff wants to support its team or have better offensive use. Double-Edge can 3HKO a lot of common Pokemon in the tier, such as Primeape, Ninetales, and Rapidash, and the recoil is largely offset by Wigglytuff's huge HP stat. Body Slam can spread paralysis while also dealing damage to common Wigglytuff switch-ins, most notably Primeape. Body Slam variants are also much better against fast Pokemon such as Dugtrio due to the paralysis chance and not having to deal with recoil from Double-Edge. Thunder 2HKOes Xatu and Kingler, making it a decent check to these two Pokemon. Rest and Sleep Talk make it a great sleep absorber and give it good longevity.</p> <p>Wigglytuff fits best on defensive and balanced teams and works very well as a lead Pokemon, since it can absorb sleep from common leads such as Stantler. Poison-types such as Weezing and Gloom can help with Wigglytuff's weakness to Fighting-types. Weezing also appreciates Wigglytuff's ability to switch in and check Xatu. Slower Pokemon that appreciate paralysis such as Flareon, Graveler, and Kingler pair well with Body Slam variants. Users of Light Screen and Reflect such as Azumarill can make its job switching in easier; this can also be further supported with a spinner to remove Spikes, such as Pineco. Checks to Magnemite such as Pupitar, Ninetales, and Hitmonlee are also useful teammates.</p>"
      },
      "CurseTuff": {
        "description": "<p>One of the most dangerous Pokemon in the tier, Curse Wigglytuff can potentially sweep teams with the right matchup. Wigglytuff's great special bulk and lack of any special weaknesses make it extremely difficult to stop after a single Curse boost. The choice of STAB attack depends on if Wigglytuff wants more power or a chance to inflict paralysis to support its sweep. Sleep Talk is the more consistent option in the third moveslot, making it less of a sitting duck when asleep and hugely helping against Hypnosis users such as Rapidash and Stantler, although Thunder Wave's synergy with Curse is useful, and paralysis can help out Wigglytuff's teammates. Most paralyzed foes are unable to check a Curse-boosted Wigglytuff, so the combination can be difficult to deal with in the absence of Pokemon immune to Thunder Wave, like Graveler and Pupitar.</p> <p>Water-types such as Kingler and Octillery do well as teammates due to their ability to switch in and destroy Rock-types such as Sudowoodo and Graveler. Troublesome Haze users such as Weezing and Arbok can stop Wigglytuff's sweep, so teammates such as Weezing and Gloom can be used to paralyze or remove them with Explosion. Spikes support from Pineco can go a long way in helping Wigglytuff break through Poison- and Rock-types. Poison-types such as Gloom and Weezing also make good partners because they can threaten Primeape, which can potentially remove Wigglytuff despite its boosts with a critical hit Cross Chop. Houndour could also be paired with Wigglytuff to prevent it from being walled by Gastly, although Gastly is a fairly uncommon Pokemon.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "dawnbuster", "user_id": 508601}], "teams": [{"name": "Quality checked by", "members": [{"username": "FNH", "user_id": 245982}, {"username": "Earthworm", "user_id": 15210}]}, {"name": "Grammar checked by", "members": [{"username": "Rabia", "user_id": 336073}]}]}
  },
  "Azumarill": {
    "sets": {
      "Miracle Bunny (RestTalk)": {
        "description": "<p>Azumarill is a defining Pokemon in GSC NU and easily one of the best defensive Pokemon available thanks to the roles it can perform. With great bulk both physically and specially alongside access to Light Screen, it is an excellent check to the many Fire-types in GSC NU such as Rapidash and Magmar while also being one of the best checks to Dugtrio. It can also safely switch into the best Pokemon in the tier, Xatu, and set Light Screen for its teammates or threaten a 3HKO with Ice Beam. Because of this, it naturally finds itself on defensive teams very commonly. However, it is not without flaws. Azumarill is susceptible to Thief from Pokemon that can lure it in such as Magmar and Dugtrio, which hurts its survivability. Moreover, its relatively low offensive presence can let Pokemon such as Primeape, Kingler, and Lickitung set up on it and threaten it.</p> <p>Surf is mandatory to threaten Fire- and Ground-types. For Azumarill's second move, Light Screen is preferred a lot of the time for its ability to enable key Pokemon such as Kingler to set up more easily as well as letting Azumarill's teammates switch into special attackers more easily; however, Ice Beam crucially lets it defeat Xatu and Fearow in a one-on-one matchup, while Light Screen variants are more susceptible to getting KOed by critical hits against these threats. Ice Beam also hits the dangerous Gloom, which sets up for free against the Light Screen variant, quite hard. Finally, Rest and Sleep Talk give excellent longevity and let it absorb sleep moves from the likes of Rapidash and Stantler. Azumarill pairs exceptionally well with other defensive Pokemon, most notably Gloom and Ninetales. These three form a fierce defensive core that is capable of covering each other's weaknesses exceptionally well, such as Azumarill checking Dugtrio for Ninetales, Gloom checking Primeape for Azumarill, and Ninetales checking Xatu for Gloom and enjoying Light Screen support. Spikes support from Pineco helps Azumarill in longer games and can make its Surf have a more lasting impact against threats such as Primeape. Kingler appreciates Azumarill variants carrying Light Screen, which lets it set up with Swords Dance and trade hits much more easily against Pokemon such as Hidden Power Grass Ninetales, Octillery, and Xatu. Xatu itself pairs well with Azumarill, as it checks some of Azumarill's biggest threats in Kingler and Hitmonlee and can use Haze to eliminate their boosts.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "dawnbuster", "user_id": 508601}], "teams": [{"name": "Quality checked by", "members": [{"username": "FNH", "user_id": 245982}, {"username": "Earthworm", "user_id": 15210}]}, {"name": "Grammar checked by", "members": [{"username": "Astra", "user_id": 240732}]}]}
  },
  "Hitmonlee": {
    "sets": {
      "RestTalk": {
        "description": "<p>Hitmonlee possesses two very useful qualities that give it a great niche in GSC NU: high Special Defense and high Attack. In combination with RestTalk, they allow it to reliably check special attackers that cannot use physical attacks effectively, such as Dewgong, Chinchou, and Ninetales. The fact that these Pokemon are all very common defensive options means Hitmonlee is granted a large number of opportunities to switch in and either hit something hard or fish for paralysis with Body Slam. Its high Attack and STAB Fighting-type moves also allow it to check Normal- and Rock-types, and it can 2HKO the majority of these with High Jump Kick. If a more offensive approach is desired, Hitmonlee can replace Body Slam for Hidden Power Rock, which can hit Flying- and Bug-types hard. The scarcity of viable Psychic-types makes this the preferred option over Hidden Power Ghost, and the primary target of Hidden Power, Xatu, happens to be weak to both. However, RestTalk Xatu, especially the Drill Peck variant, is still very difficult for Hitmonlee to deal with if healthy, so paralyzing it for a teammate tends to be the more effective approach.</p> <p>Hitmonlee's ability to spread paralysis to an opposing team's checks to Fighting-types gives it great offensive synergy with setup sweepers like Kingler, Primeape, and Lickitung. Removing Xatu outright can also sometimes leave an opposing team without any good response to Hitmonlee. One way to achieve this is to Pursuit trap Xatu with Houndour. If Hitmonlee paralyzes Xatu with Body Slam, it becomes particularly vulnerable to a Houndour with Crunch and Pursuit. Furthermore, Houndour can use Counter to dispatch of a Xatu that tries to fight it with Drill Peck. However, Hitmonlee is not entirely without downsides—Pineco sets up Spikes against it relatively freely and can be difficult to safely deal with. It is a good idea to have a plan in place to try to ensure that Pineco is at least unable to take something down with Explosion after setting up Spikes. Pokemon that resist Normal, such as Sudowoodo, Graveler, and Pupitar, are helpful in this regard. Opposing physical sweepers like Kingler and Primeape also have an advantage over Hitmonlee, so checks to these such as Xatu and Weezing make for desirable teammates.</p>"
      },
      "Setup Sweeper": {
        "description": "<p>Hitmonlee can attempt to sweep an opposing team by boosting its already high Attack and then using its strong coverage to overpower foes. Meditate is the best standalone option, as it does not lower Hitmonlee's Speed. However, if Hitmonlee is receiving Speed boosts from a Baton Passer, then Curse can be used to increase both its bulk and damage without sacrificing its Speed advantage. Hidden Power Rock is used to target the nearly omnipresent Xatu, and Double-Edge gives Hitmonlee the most damage possible against Poison-types like Weezing, Arbok, and Gloom. Hitmonlee can also sacrifice a small amount of power against Xatu and other Flying- and Bug-types by running Double-Edge over Hidden Power Rock, which frees up the last slot for Hitmonlee to use a utility move such as Body Slam for paralysis, Rapid Spin to remove Spikes, or Mach Punch for priority. However, this leaves Hitmonlee without any move to hit the rare Gastly, leaving it dependent on teammates with Pursuit such as Houndour.</p> <p>Hitmonlee is generally inferior to Primeape when it comes to the role of setup sweeper due to Primeape's higher Speed and its access to Cross Chop and Rock Slide. Hitmonlee's main advantages over Primeape are its ability to hit Poison-types slightly harder with its neutral attacks and its superior special bulk. This arguably makes Hitmonlee a better receiver of Speed boosts than Primeape, so it is worth considering Baton Passers with Agility, such as Ledian, Farfetch'd, and Ariados, as potential teammates. Hitmonlee is also more suitable to switch into weaker special attacks for its team, whereas Primeape prefers to remain at near full health for as long as it can. It's important to bring a reliable method of handling Xatu when using Hitmonlee, so Pokemon like Ninetales, Mantine, and Magnemite make for useful teammates. Primeape also has a huge advantage over Hitmonlee when the two face off thanks to its potential Cross Chop critical hit OHKO, so Pokemon such as Xatu, Weezing, and Gloom are useful to put the enraged monkey in its place; the latter of the three can also help spread paralysis.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Earthworm", "user_id": 15210}], "teams": [{"name": "Quality checked by", "members": [{"username": "dawnbuster", "user_id": 508601}, {"username": "FNH", "user_id": 245982}]}, {"name": "Grammar checked by", "members": [{"username": "Rabia", "user_id": 336073}]}]}
  },
  "Dugtrio": {
    "sets": {
      "Substitute Attacker": {
        "description": "<p>Boasting the best Speed in the tier, a not-too-shabby base Attack of 80, and a decent movepool, Dugtrio is a serious threat. Its access to a solid STAB move in Earthquake, coupled with its high Speed, means that only Pokemon that can withstand two hits can switch into it safely. Rock Slide as Dugtrio's first coverage move is a necessity. In a tier dominated by Xatu, the capability to hit Flying-types for solid damage is essential for Dugtrio to properly function and threaten foes. The combination of Earthquake + Rock Slide allows Dugtrio to hit everything in the tier for neutral or super effective damage. Screech allows Dugtrio to prevent opponents from stalling it out by constantly dropping their Defense, which can be useful against bulky RestTalk users and Curse users, especially in conjunction with Spikes support and Substitute. Substitute grants the ability to dish out free hits safely when set up on one of the many switches Dugtrio forces. It also gives Dugtrio the opportunity to safely fish for Hidden Power Electric or Rest pulled from Sleep Talk by Octillery and Xatu, allowing it to severely punish them for trying to check Dugtrio when asleep through Screech. It also crucially reduces the need for Dugtrio to guess which Pokemon will switch in or whether the foe will switch at all and forces the opponent to attack Dugtrio directly in fear of giving it free turns.</p> <p>While Dugtrio is the fastest Pokemon in the tier, its base 80 Attack is a far cry from the Attack stats of behemoths like Kingler. To highlight its lack of power, Dugtrio fails to OHKO Ninetales and Rapidash from full health. Furthermore, Weezing and Sudowoodo only take about 54% from Dugtrio's super effective STAB Earthquake. To help bring these Pokemon into Dugtrio's KO range, pairing it with Pineco is essential to making it thrive, as Spikes help wear down roadblocks to Dugtrio such as Octillery and Dewgong and help push its attacks over the line when Dugtrio might otherwise barely miss out on 2HKOes or OHKOes. Powerful attackers such as Kingler, Fearow, and Rapidash are all good teammates given that all three are capable of weakening foes with their powerful hits, which further makes Dugtrio's job easier. Sudowoodo can lure in Water- and Grass-types Dugtrio has trouble with and remove them with Self-Destruct. Chinchou is a great partner to complement Dugtrio's defensive shortcomings, as it can take opposing Surfs and Ice Beams, which Dugtrio is weak to, and hit back with its strong STAB Thunder.</p> <p>The biggest flaw to Dugtrio is its lack of raw power and generally poor bulk, so Pokemon that can take advantage of these deficits make for good checks. Bulky Normal-types such as Wigglytuff and Dunsparce take 30% from Dugtrio's Earthquake on average while hitting back with STAB Normal attacks such as Body Slam, Return, and Double-Edge for between 40% and 67%. Xatu can force Dugtrio out despite its faster super effective Rock Slide if Dugtrio isn't healthy and behind a Substitute. Water-types in general are the best answers to Dugtrio. Octillery takes 31-37% from Earthquake while threatening to OHKO back. Dewgong only takes 28-33% from STAB Earthquake while doing 75-88.6% with STAB Surf and Ice Beam in return. Physically bulky attackers like Kingler can potentially set up a Swords Dance boost against Dugtrio without too much to fear.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "FNH", "user_id": 245982}], "teams": [{"name": "Quality checked by", "members": [{"username": "dawnbuster", "user_id": 508601}, {"username": "Earthworm", "user_id": 15210}]}, {"name": "Grammar checked by", "members": [{"username": "dhelmise", "user_id": 241023}]}]}
  },
  "Farfetch’d": {
    "sets": {
      "Baton Pass": {
        "description": "<p>Farfetch'd is one of the most dangerous Pokemon in GSC NU when given an opportunity. Agility with Baton Pass is an extremely powerful combination that allows Farfetch'd to pass Speed boosts to huge threats such as Cubone, Machoke, Kingler, and Stantler. These recipients are more than capable of sweeping entire teams if they aren't carefully prepared for. Due to the sheer power of this strategy, most teams will have a Haze user such as Xatu or Weezing that they will use to thwart this strategy. However, unlike other Baton Passers, Farfetch'd comes equipped with STAB Return, which can be used to chip away at these Haze users to get them to the point where they have no choice but to allow you to pass your chosen stat or else be KOed. Swords Dance further amplifies the danger posed by Farfetch'd and can be used to preserve the more valuable HP of the recipient, which would otherwise need to spend a turn setting up an Attack boost, in exchange for taking a hit with Farfetch'd.</p> <p>Apart from the aforementioned recipients, Pokemon such as Hitmonlee, Primeape, and Flareon can also make for adequate recipients. Flareon can also set up additional Growth or Curse boosts to pass along with the Speed boosts from Farfetch'd. Pokemon that can spread paralysis and set up screens, such as Voltorb, Flaaffy, and Bayleef, are also essential teammates for giving Farfetch'd the best possible chance at passing boosts to a teammate. Explosion users are also useful, as they can create a chance for Farfetch'd to enter the battlefield without having to take a hit. Voltorb is great for this purpose and compresses the role of screens user and Explosion user into a single team slot. Weezing and Gastly are also capable of performing this role; Weezing can handle opposing setup attempts adequately with its access to Haze and Explosion, whereas Gastly can null Explosions aimed at preventing Farfetch'd from passing boosts.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Earthworm", "user_id": 15210}], "teams": [{"name": "Quality checked by", "members": [{"username": "dawnbuster", "user_id": 508601}, {"username": "Sevi 7", "user_id": 505149}]}, {"name": "Grammar checked by", "members": [{"username": "Rabia", "user_id": 336073}]}]}
  },
  "Weezing": {
    "sets": {
      "Mixed Attacking Tank": {
        "description": "<p>Weezing is among the tier's most viable tanks, as its naturally high bulk and access to powerful moves such as Sludge Bomb, Fire Blast, and Thunder make it an unpredictable threat that is hard to deal with. Furthermore, its access to Explosion makes it a literal time bomb, granting it the ability to take down threats with it that might be otherwise unable to defend against or to target its own checks to open up the opponent's defenses for its teammates. Its Poison typing is a blessing and a curse, as Weezing can take advantage of the common presence of Fighting-types like Primeape and Hitmonlee, but it is extremely susceptible to the top threat Xatu's STAB Psychic. Weezing's primary STAB move in Sludge Bomb has a high chance of inflicting poison, which can punish many checks that try to switch into it, such as Xatu, Dugtrio, and Sudowoodo, by setting them on a timer. Thunder similarly has a high chance of inflicting paralysis, which makes Weezing even harder to switch into safely. On top of this, it lands a guaranteed 2HKO on Xatu and also hits bulky Water-types hard.</p> <p>The last move depends on whichever benefit the player would like to have: greater coverage, the ability to stop opposing Pokemon from setting up, or longevity. Fire Blast threatens to KO Pineco from full and becomes guaranteed with any slight chip, preventing it from safely setting up Spikes. Fire Blast also lands an OHKO on Magnemite and does massive damage to Gloom, which can otherwise freely paralyze Weezing with Stun Spore or repeatedly use Curse and force Weezing to sacrifice itself with Explosion to take Gloom out. The combination of Sludge Bomb and Thunder tends to leave Weezing open for Ground- and Rock-types such as Dugtrio and Sudowoodo to come in and threaten it with Earthquake, so Weezing can opt for Hidden Power Water, which hits both for significant damage and OHKOes Graveler, but it comes at the cost of some bulk due to DV requirements. Haze nullifies any attempt at setting up and can shut down a potential sweep from any setup sweeper, such as Wigglytuff, Dunsparce, or Meditate Primeape. Lastly, not having any instant recovery moves can leave Weezing in a difficult spot when repeatedly switching into attacks, especially with Spikes down. Thus, Pain Split is a viable option, since it is the only instant recovery move that Weezing learns and can help to prolong the period of time before it is forced to use Explosion.</p> <p>Some of the Pokemon that benefit the most from having Weezing as a teammate are those that like to have Xatu removed by Explosion, such as Primeape, Hitmonlee, and other Xatu. Primeape, in turn, can threaten the majority of the slower, more defensive Pokemon that Weezing struggles to deal with, such as Pupitar and Sudowoodo. Primeape also threatens Normal-types, especially ones that give Weezing a hard time like Stantler and Wigglytuff, with Stantler having Earthquake and Wigglytuff being able to Curse up and force Weezing to explode on it rather than a different Pokemon like Xatu.  Defensive Pokemon such as Dewgong and Sudowoodo fear the presence of Primeape on the opposing team and benefit greatly from Weezing's solid matchup against it. Dewgong is also a phenomenal switch into Xatu, taking little from its attacks and hitting back hard with Ice Beam while staying healthy with RestTalk. Water- and Grass-types like Octillery or Gloom with a Grass move can threaten Ground- and Rock-types like Dugtrio and Sudowoodo, which are otherwise solid switch-ins to Weezing as if they avoid poison from Sludge Bomb they can comfortably take Fire Blast and Thunder.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "cherryb0ng", "user_id": 421511}], "teams": [{"name": "Quality checked by", "members": [{"username": "Earthworm", "user_id": 15210}, {"username": "dawnbuster", "user_id": 508601}]}, {"name": "Grammar checked by", "members": [{"username": "deetah", "user_id": 297659}]}]}
  },
  "Fearow": {
    "sets": {
      "RestTalk": {
        "description": "<p>Fearow is a very simple yet solid Pokemon and one of GSC NU's hardest hitters, thanks to its great Attack and a high-Base Power STAB move in Double-Edge. It notably obtains crucial 2HKOs on common Pokemon, such as Primeape, Magmar, and Dugtrio and can be a major threat to teams lacking a Normal-resistant Pokemon such as Sudowoodo or Graveler. Fearow also has excellent Speed, letting it outspeed Xatu and Primeape, two of the tier's most important Pokemon, which can be extremely useful for offensive teams that may struggle with these threats. Its decent bulk alongside an immunity to Spikes means it is able to come in more easily than one might think, as Pokemon such as Xatu fail to 2HKO it without Double-Edge recoil. However, Fearow has a poor matchup against the tier's Normal-resistant Pokemon such as Sudowoodo, Shuckle, Magnemite, and Graveler, meaning it can be a liability at times, as well as struggling against Weezing, one of the most common Pokemon in the tier.</p> <p>Double-Edge is Fearow's strongest STAB and deals solid damage to Pokemon that don't resist it. Drill Peck lets Fearow 2HKO Primeape, Hitmonlee, and Gloom. Alternatively, Hidden Power Ground is an option to OHKO Magnemite, 2HKO Magcargo, and chip Sudowoodo, Graveler, and Pupitar on the switch, although replacing Drill Peck will make Fearow less effective against most foes when using Sleep Talk. Lastly, Rest and Sleep Talk give Fearow much improved longevity when switching into Pokemon such as Xatu while also meaning it can rid itself of crippling paralysis from Pokemon such as Gloom.</p> <p>Fearow is most at home on offensive teams and naturally pairs well with many of the tier's other offensive Pokemon. Spikes from Pineco are useful for exerting more pressure on Pokemon such as Dewgong and Weezing when they switch into Fearow. Dugtrio and Primeape are excellent partners, as they can switch into the Rock- and Steel-types that threaten Fearow, while Fearow can deal well with Gloom for Primeape and Xatu for Dugtrio. Likewise, Octillery is a good answer to Rock-types and can also check Water-types such as Dewgong, if running Hidden Power Electric, as well as Dugtrio. Hidden Power Grass Weezing is able to lure in Graveler and Pupitar and can use Explosion on Dewgong, which is a problematic Pokemon for Fearow. Faster Pokemon, such as Persian and Rapidash, can also be annoying for Fearow, so pairing it with a Pokemon like Octillery or Sudowoodo to deal with these threats is a good idea.</p>"
      },
      "Three Attacks": {
        "description": "<p>This set trades the better longevity of RestTalk Fearow for more moveslots, and this Fearow set has a better shot against the tier's Normal-resistant Pokemon. This set provides less team support than the standard RestTalk Fearow and fits onto different kinds of teams, usually ones with paralysis support or other Normal-type Curse users. Fearow can fit Hidden Power Ground much more easily on this set, which lets it OHKO Magnemite while chipping Rock-types like Sudowoodo for decent damage. Fearow can also run Substitute, letting it ease prediction and dodge status like Gloom's Stun Spore. Curse is also an option, as it notably gives Fearow a chance to defeat Graveler and Sudowoodo one-on-one if they switch in. Fearow also outspeeds Pokemon below base 45 Speed after a Curse, such as Graveler, Sudowoodo, Gloom, Octillery, and Wigglytuff. Double-Edge is the preferred STAB move due to its power, which helps to wear down bulky Pokemon such as Weezing and Dewgong, but Return is a fine option for avoiding recoil. Drill Peck notably 2HKOes Pineco and lets Fearow hit Primeape and Gloom harder. Paralysis support is useful with this set, pairing well with Substitute due to the potential full paralysis chance as well as with Curse due to its Speed drop. Pokemon such as Dragonair and Gloom are good at providing this support.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "dawnbuster", "user_id": 508601}], "teams": [{"name": "Quality checked by", "members": [{"username": "cherryb0ng", "user_id": 421511}, {"username": "Siatam", "user_id": 175539}]}, {"name": "Grammar checked by", "members": [{"username": "Milak", "user_id": 262594}]}]}
  },
  "Ninetales": {
    "sets": {
      "RestTalk": {
        "description": "<p>Ninetales is a phenomenal Pokemon in GSC NU thanks to its excellent defensive and offensive capabilities. Its typing and great Special Defense make it one of the best answers to dangerous special attackers such as Xatu, Magmar, Flareon, and Magnemite, which means it fits very well on more defensive teams, pairing very well with bulky Water-types such as Dewgong and Chinchou as well as with Gloom. Ninetales also walls dangerous Sunny Day teams, which can give most teams trouble with their sheer offensive power. Additionally, it is one of the fastest Pokemon in the tier, notably outpacing fast Pokemon such as Xatu, Primeape, and Magmar while hitting a majority of the tier for solid damage with Flamethrower. However, it struggles a lot with the various bulky Water-types in the tier, such as Dewgong, Octillery, and Azumarill. Its physical bulk can also be rather lacking against stronger physical attackers such as Dugtrio and Primeape. Flamethrower is vastly preferred over Fire Blast due to its better PP and accuracy. Toxic cripples any foe lacking Rest, which includes a lot of the special and physical attackers that Ninetales checks, and forces Pokemon with Rest to use it. Hidden Power Grass can be used instead so Ninetales is not helpless against Water- and Rock-types that have Rest. Reflect can also be used to shore up Ninetales's weaker physical bulk and provide offensive teammates with a setup opportunity. Finally, Rest and Sleep Talk give it incredible longevity, which lets it check threats such as Xatu, Gloom, and Magmar throughout a battle.</p> <p>Bulky Water-types are Ninetales's best partners. Together they form an incredibly potent defensive combo that walls a significant portion of the tier, as Ninetales beats Grass- and Electric-types while Water-types such as Chinchou and Azumarill beat opposing Water-types. However, this pairing gives free setup to one of the most dangerous threats in the tier in Kingler, so Xatu is an essential addition. Gloom and Hitmonlee pair well with Ninetales because it dominates Xatu, which troubles them. In return, Hitmonlee and Gloom check the Water-types that Ninetales struggles against. Pineco fits well on the defensive teams that Ninetales commonly finds itself on, and it can rapidly stack up residual damage when used in tandem with Toxic spread by Ninetales. Pineco can also remove Spikes, which makes it easier for Ninetales to check Xatu.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "dawnbuster", "user_id": 508601}], "teams": [{"name": "Quality checked by", "members": [{"username": "FNH", "user_id": 245982}, {"username": "Earthworm", "user_id": 15210}]}, {"name": "Grammar checked by", "members": [{"username": "Rabia", "user_id": 336073}]}]}
  },
  "Gloom": {
    "sets": {
      "Status-spreading Defensive Pivot": {
        "description": "<p>Gloom is a fantastic Pokemon in GSC NU due to its ability to play several important roles effectively. Its Grass typing allows it to handle Water-types that commonly run Water- + Electric-type coverage, such as Chinchou and RestTalk Octillery. In doing so, it also provides the user with an excellent opportunity to spread paralysis. The threat of boosting its STAB Sludge Bomb with Curse or Swords Dance can easily force the foe to flee to a counter such as Xatu, a critical target that can be crippled with paralysis from Stun Spore as it switches in. Once paralyzed, if the opponent fails to respect Gloom, it can at times even muster enough power to sweep a crippled team. Sludge Bomb's high chance to inflict poison is also useful for its potential to cripple Pokemon like Magmar and Flareon and can potentially force Xatu to use Rest. On top of this, Gloom also makes for an excellent check to Primeape, one of the tier's most threatening attackers. Even Primeape that run coverage moves for Poison-types usually elect to use Hidden Power Ground to hit Weezing, which Gloom conveniently takes neutral damage from. It is particularly effective at this role with Curse, which can allow it to take on Meditate variants more safely. To allow Gloom to better deal with foes such as Substitute Graveler and Dugtrio, Hidden Power Grass is also a viable option over boosting moves.</p> <p>However, Gloom has some glaring flaws. It is fairly passive and weak before it boosts its stats, which means that Pineco can easily switch in to lay Spikes against it. For this reason, it is advised to use a Pokemon that can withstand Pineco's Explosion alongside Gloom, such as Sudowoodo. RestTalk users such as Ninetales and Xatu can potentially switch into Gloom to regain their health when weakened without having to fear paralysis too much. If not paired with a bulky Water-type like Dewgong, Octillery, or Azumarill, it can struggle against Water-types that have Ice Beam as a coverage move. Furthermore, while Gloom makes for a fantastic Chinchou check, should it become afflicted by paralysis from Thunder or Thunder Wave, it will become a much shakier check to Primeape. One of Gloom's biggest problems is that it struggles with Magnemite, which can be a huge pain to deal with due to the lack of viable Pokemon that can handle a powerful Electric-type attack that is paired with Hidden Power Ice coverage. However, Gloom can adapt to this by using Hidden Power Ground to surprise Magnemite and take it down unexpectedly. This also doubles as a coverage move for Poison-types such as Weezing, Arbok, and the rare Gastly, and it hits Fire-types slightly harder than Sludge Bomb. As Hidden Power Ground is difficult to fit on a set without dropping Moonlight, an alternative solution to the Magnemite problem is to use a sturdy Fire-type such as Ninetales to take on the cyclopean magnet. Pokemon that can take advantage of Gloom's ability to spread paralysis, such as Swords Dance Kingler, Curse Sudowoodo, Curse Stantler, Substitute Primeape, and Graveler, also make for good teammates.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Earthworm", "user_id": 15210}], "teams": [{"name": "Quality checked by", "members": [{"username": "dawnbuster", "user_id": 508601}, {"username": "cherryb0ng", "user_id": 421511}]}, {"name": "Grammar checked by", "members": [{"username": "Rabia", "user_id": 336073}]}]}
  },
  "Primeape": {
    "overview": "<p>Primeape is one of the most dangerous physical attackers in the metagame. Boasting an astronomical Attack stat, a great Speed stat that ties it with Xatu, and a powerful STAB Cross Chop backed up by solid coverage, Primeape makes for a great choice for wallbreaking or cleaning on many teams. Furthermore, that same Cross Chop comes with the coveted trait of being super effective against the common and dominant Normal-types, potentially OHKOing threats like Stantler, Persian, and Porygon and dealing massive damage to Wigglytuff; it also takes a heavy chunk out of Dewgong, Sudowoodo, and Graveler. Cross Chop even has a potentially game-breaking increased critical hit rate that can slice right through a Wigglytuff or Porygon that has used Curse several times. However, Primeape has some very debilitating issues. Move accuracy is its biggest problem, turning what would otherwise be KOs from Primeape's Cross Chop or Thunder into potentially unreliable tools. Primeape is also plagued by the presence of Xatu, Fearow, and Weezing, three of the best and most common Pokemon in the tier, which are all great answers to it. Primeape is also quite frail, having difficulty switching into its targets repeatedly, so it can be difficult to find entry for it. Primeape is also easily revenge killed by Fearow and Xatu after some chip damage.</p>",
    "comments": "<h1>Other Options</h1> <p>Rock Slide can be used instead of Double-Edge on the Substitute set to hit Xatu and Fearow for close to 50% and Pineco for a 3HKO while being far more accurate than Thunder. It also hits just as hard against Fire-types as Cross Chop while being more accurate. However, it comes at the cost of having to use Cross Chop rather than Double-Edge against low health targets like Octillery, which can result in a miss. Without Double-Edge, Primeape is also completely walled by Gloom and has to repeatedly use Thunder to attempt to hit Weezing for meaningful chip damage. Counter can be used over Double-Edge on the Substitute set in order to surprise threats like Weezing, Dugtrio, and, if healthy enough to survive a Drill Peck, Fearow with heavy damage or even a KO; however, it comes at the cost of another move like Double-Edge and is ineffective against Xatu. Using Counter unsuccessfully will also remove all surprise factor and cause it to become significantly less useful. Thief can be used over Substiute or Double-Edge to steal Leftovers from Weezing, Gloom, or Xatu. A combination of Rest and Mint Berry can even be used alongside Thief to give Primeape a one-time full heal and then proceed to take Leftovers away from one of its walls. However, this comes at the cost of Double-Edge or Substitute, which reduces reliability, and RestTalk is often a better version of Mint Berry + Rest + Thief, as it does not require this setup process and gives Primeape the ability to continually heal throughout a game. Meditate can be used over Thunder on the Substitute set to boost Primeape’s Attack even further, letting it deal heavy damage to Weezing in short succession; however, it struggles against Xatu and will be KOed quickly, so it should be used alongside Houndour or a Pokemon that can take advantage of a chipped Weezing such as Hidden Power Rock Kingler. Protect allows Primeape to gain additional Leftovers recovery and potentially block an Explosion from the likes of Graveler and Pineco, though it compromises coverage further or means Primeape has to forgo Substitute. Screech can be used to force Spikes damage on the foe and break past Weezing and Gloom with an effectively +2 boosted Double-Edge with enough chip damage, though it comes at the cost of a moveslot, takes a turn to use, and has a 15% chance to miss.</p> <h1>Checks and Counters</h1> <p><strong>Poison-types</strong>: Weezing’s phenomenal bulk means it takes less than 30% from Primeape's Thunder and Double-Edge, the former of which can miss and the latter of which can grant relatively free entry to Xatu. Leftovers combined with Primeape often not wanting to stay in once Weezing has switched in means Weezing is able to heal off a lot of the damage it takes in the process, and Weezing can use Primeape’s presence to gain entry and fire off its own powerful attacks. Gloom takes far more damage from Double-Edge, but it has Moonlight to keep itself healthy enough to handle Primeape throughout the battle and has Stun Spore to paralyze Primeape. However, both Weezing and Gloom can slowly be worn down by Primeape over time, especially with Spikes on the field, and both hate paralysis from Thunder. Weezing and Gloom are also often tasked to handle other threats, such as Fearow and Octillery, respectively. While Gloom has Moonlight, it only has 8 PP, which can run out in longer games when it is tasked with repeatedly switching into Primeape and other threats like Octillery.</p> <p><strong>Flying-types</strong>: Xatu possesses a 4x resistance to Cross Chop and can hit Primeape for upwards of 80% with STAB Psychic. Fearow, meanwhile, does not resist Cross Chop but outspeeds Primeape and easily 2HKOes it with Drill Peck. Both Xatu and Fearow also run RestTalk to keep themselves healthy and stay able to handle Primeape throughout a game. However, Primeape’s Thunder is favored to 2HKO both Fearow and Hidden Power Electric Xatu, and if Thunder lands and paralyzes them as they switch in, Primeape can use Thunder again or use Rock Slide and easily knock them out; Primeape can also win the Speed tie against Xatu. Substitute also ensures Primeape gets an opportunity to land a Thunder instead of using Cross Chop as Xatu comes in. Despite this, Thunder still has a relatively high chance to miss and can result in Primeape doing nothing against Xatu and Fearow.</p> <p><strong>Pineco</strong>: Pineco resists Cross Chop, almost always avoids a 3HKO from Double-Edge, and is only 3HKOed by the inaccurate Thunder and Rock Slide. In return, it can use Primeape to set up Spikes or use Rapid Spin to clear away the Primeape trainer's Spikes. However, Primeape can freely set up a Substitute that Pineco typically has no way to break other than by sacrificing itself with Explosion, although it will still likely mean that Pineco can use both Spikes and Rapid Spin relatively easily.</p> <p><strong>Status</strong>: If Primeape is not running RestTalk, poison from Weezing and Gloom’s Sludge Bomb and Ninetales’s Toxic is incredibly limiting for Primeape’s staying power. Paralysis from Magnemite and Chinchou’s Thunder, Wigglytuff’s Body Slam, and Porygon’s Thunder Wave is also incredibly detrimental, especially because these Pokemon are all prime candidates for Primeape to come in on and threaten out, since Primeape needs its high Speed stat intact to make up for its frailty and take advantage of its great Attack stat and superb coverage.</p>",
    "sets": {
      "RestTalk": {
        "description": "<h1>Set Description</h1> <p>RestTalk improves Primeape's longevity significantly, giving it more freedom to switch into Pokemon like Dewgong, Stantler, Porygon, and Chinchou, as a Primeape without RestTalk wants to preserve its health for late in the game and cannot afford to be paralyzed by Chinchou's Thunder or Porygon's Thunder Wave. Thunder provides the best possible coverage alongside Cross Chop, having the ability to 2HKO Xatu and Fearow and potentially paralyze Weezing, helping Primeape pose a serious threat even when facing its checks; it can also fish for paralysis against Gloom and Exeggcute, which otherwise wall this set. Thunder additionally retains the ability to hit Octillery and Dewgong hard and has a small chance to threaten Curse Porygon with paralysis while Primeape is sleeping, providing additional reliability when using Sleep Talk.</p> <h1>Team Options</h1> <p>RestTalk Primeape works best on teams that want Primeape's powerful Fighting-type offense but need to better handle threats like Dewgong, Chinchou, and Porygon, such as on the popular Xatu + Dugtrio Spikes teams, which tend to struggle against these threats. RestTalk Primeape also works well on Graveler + Gloom teams, as it appreciates Graveler shutting down Pineco and checking Weezing as well as Gloom spreading paralysis; in return, Primeape can switch into Dewgong and Porygon for the two. Ninetales is a perfect defensive partner, as it struggles with Dewgong, Chinchou, and Rock-types like Sudowoodo, which Primeape can check. In returm, Ninetales provides a reliable switch into Weezing and Gloom for Primeape. Pineco is a solid option for a teammate, as its Spikes down Weezing and Gloom.</p>"
      },
      "Substitute Attacker": {
        "description": "<h1>Set Description</h1> <p>Cross Chop is Primeape’s strongest choice of STAB move and comes with an increased critical hit rate, letting it come close to if not outright OHKOing most Pokemon that do not resist it. Thunder is Primeape’s strongest option to hit Xatu and Fearow, and the 30% paralysis rate can be ruinous to them as well as Gloom and Weezing, provided the move hits. Double-Edge is a generally powerful neutral move to use against Gloom and Weezing or for the 100% accuracy against a low health target; it's also useful for preserving Cross Chop PP. Substitute allows Primeape to safely scout switch-ins and force the foe to attack it, reducing prediction in scenarios where Primeape needs to decide whether to use Cross Chop to hit the Pokemon in front of it, like Stantler, or use Thunder to hit an incoming Xatu. Substitute also allows Primeape to block Explosion and Toxic from Pineco which cannot otherwise threaten Primeape, or block Explosion from a Graveler or weakened Weezing trying to trade with it.</p> <h1>Team Options</h1> <p>Pineco is a great partner for Primeape, setting up Spikes to help wear down opposing Weezing and Gloom throughout a game and helping Primeape break through them. Weezing can lure in Xatu and opposing Weezing and damage them by using Thunder on the switch or using Explosion to trade and clear the way for Primeape. Ninetales can wall Weezing, Gloom, and Xatu, and if Weezing chooses to use Explosion to eliminate Ninetales, then it means it will not be present to handle Primeape. In return, Primeape can switch into Sudowoodo and Dewgong for Ninetales and threaten them out. Sudowoodo and Graveler wall Fearow, take advantage of Pineco, are solid switch-ins to Weezing that lack Hidden Power Water, and can use Self-Destruct and Explosion, respectively, to take out a bulky threat like Octillery or Xatu. Dewgong walls Xatu and Gloom and in a pinch can switch into Fearow, threatening to deal heavy damage to all three with Ice Beam. Xatu can switch into Gloom, and to an extent Weezing, and force them out. Both Xatu and Dewgong, along with other special attackers like Chinchou and BoltBeam Porygon, appreciate Primeape being able to severely threaten Wigglytuff; Chinchou and Porygon can also spread paralysis for Primeape. Xatu and other powerful wallbreakers like Stantler and Dugtrio are also very effective at spreading damage and weakening the opposing team for Primeape to clean late-game, especially with Spikes up.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "BeeOrSomething", "user_id": 583728}], "teams": [{"name": "Quality checked by", "members": [{"username": "MrSoup", "user_id": 375193}, {"username": "juoean", "user_id": 486979}]}, {"name": "Grammar checked by", "members": [{"username": "StupidFlandrs48", "user_id": 633500}, {"username": "autumn", "user_id": 384270}]}]}
  },
  "Rapidash": {
    "sets": {
      "Offensive": {
        "description": "<p>With incredible Speed and offensive prowess, Rapidash is a top tier Pokemon in GSC NU. Using Rapidash as a lead capitalizes on its offense and Hypnosis, which can turn the tables against slower leads such as Stantler, but it alternatively can stay in the back as an attacker. Fire Blast is the STAB move of choice, potentially 3HKOing even Wigglytuff, easily 3HKOing Xatu, and OHKOing Magnemite and Pineco. Flamethrower is another option that offers better accuracy and more PP. However, the loss of power means that it can no longer reliably break through foes such as Xatu and Wigglytuff. Double-Edge is Rapidash's usual secondary attack, helping it hit Fire-types that typically wall it. Body Slam trades power for paralysis support, which can help slower Pokemon such as Graveler. Substitute can be used to block predicted status moves from foes such as Rapidash, Ninetales, Dunsparce, and Dragonair. Sunny Day and Hidden Power Grass are also viable, as Sunny Day can be utilized to power up Fire-type moves so that they 2HKO bulky foes like Wigglytuff and even flip the matchup against Dewgong into Rapidash's favor, while Hidden Power Grass deals solid damage to Rock-types that resist Fire- and Normal-type attacks.</p> <p>Despite Rapidash's excellent power, Octillery and Azumarill are able to consistently come in on it with little to fear. Grass-types like Exeggcute and Gloom make great partners for their ability to sponge Water- and Ground-type attacks. Chinchou makes for an excellent partner by resisting common Water- and Ice-type attacks from Water-type Pokemon. Ninetales is also problematic and capable of walling Rapidash. Something that can deal with Ninetales and Sudowoodo, such as Dewgong, Chinchou, or Octillery, is recommended as well. Ninetales does struggle against Substitute variants of Rapidash, though, as it generally only runs STAB Flamethrower as an attack, which can't break Rapidash's Substitute. Primeape is also good to threaten Rock-types and help break through Water-types.</p>"
      },
      "RestTalk": {"description": "<p>This set blends Rapidash's offensive capabilities with the longevity provided by RestTalk. The combination of Fire Blast and Double-Edge gives Rapidash two high-Base Power moves that have solid coverage, while giving it guaranteed good Sleep Talk rolls against threats such as Xatu. Hidden Power Grass is useful for chipping Water- and Rock-types. Body Slam is also viable, trading damage for paralysis support. With its very high Speed and consistent damage output, Rapidash has a great matchup against most Fire-types and fast Pokemon in the tier, most notably Xatu. On top of this, using RestTalk allows it to switch into foes that threaten to induce status, such as Gloom, with less hesitation.</p>"}
    },
    "credits": {"writtenBy": [{"username": "FNH", "user_id": 245982}, {"username": "dawnbuster", "user_id": 508601}], "teams": [{"name": "Quality checked by", "members": [{"username": "Sevi 7", "user_id": 505149}, {"username": "cherryb0ng", "user_id": 421511}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Magnemite": {
    "overview": "<p>Due to Magnemite's amazing Steel typing, high Special Attack, and difficult-to-resist STAB Thunder, it can make for an excellent long-term defensive answer to Xatu and Fearow that's capable of repeatedly switching in on them to fire off attacks, battering away at the opposing team. On the surface, Magnemite may seem difficult to justify over its fellow Electric-type, Chinchou, which is much faster, has STAB-boosted Surf, and resists Water, allowing it to switch into Octillery and Dewgong unlike Magnemite with its low Special Defense. The primary reason for Magnemite's use is that it is arguably one of the best answers to Xatu and Fearow, two of the strongest and most dangerous offensive forces in the tier; it also answers Persian remarkably well. However, Magnemite is plagued by common Pokemon that take advantage of its weaknesses, such as Ninetales, Rapidash, Dugtrio, and Primeape. Magnemite isn't completely helpless against these threats, though, as Thunder paralysis is extremely crippling and Dugtrio does not want to repeatedly switch into Magnemite in fear of Hidden Power Ice. However, Magnemite has some severely crippling and unavoidable issues, namely Thunder's poor 70% accuracy and often being forced into predicting what the right move to use is, such as whether to use Thunder on the Octillery right in front of it or Hidden Power Ice to hit the Dugtrio that may come in.</p>",
    "comments": "<h1>Other Options</h1> <p>Thunderbolt is an option over Thunder to more reliably check threats like Stantler and Kingler that can take advantage of a miss, but it makes Magnemite weaker against Wigglytuff, and the lower power and paralysis chance are undesirable. Reflect can be used over Hidden Power Ice to assist with a team's ability to switch into threats that take advantage of Magnemite, like Dugtrio and Stantler; however, Magnemite completely loses out on the ability to harm foes like Dugtrio and Gloom that resist Electric, and Reflect generally does very little when called by Sleep Talk.</p> <h1>Checks and Counters</h1> <p><strong>Ground-types</strong>: Ground-types such as Dugtrio punish Magnemite for using Thunder and can come in freely to scare it out and deal damage. Dugtrio also packs Substitute, which uses the turn given to hide behind cover and ease prediction; however, Dugtrio takes quite a lot of damage from Hidden Power Ice and does not want to repeatedly come in, especially with Spikes on the field or when the opponent has a healthy Octillery or Dewgong to handle it. Due to the way Magnemite can often be forced into using Hidden Power Ice to not let Ground-types in for free, other Pokemon can use that to come in and threaten Magnemite, improving on a team's ability to play around Magnemite. Pupitar and Graveler can also handle Magnemite, though Pupitar is generally niche and uncommon, while Graveler is slower than Magnemite and has even worse Special Defense than Dugtrio.</p> <p><strong>Fire-types</strong>: Ninetales counters Magnemite, as it is bulky to the point where it can almost avoid a 3HKO from Thunder, is faster, packs Rest and often Sleep Talk to heal off any damage or paralysis, and has STAB Flamethrower to melt Magnemite; however, Ninetales can still be afraid of switching straight into a Thunder with Spikes up, as if it gets paralyzed, it may be in range of another Thunder. Rapidash is a very similar story, though it has less bulk, instead being more offensively dangerous to compensate and even directly taking advantage of opposing Ninetales attempting to switch into Magnemite to fire off a strong Double-Edge and potentially overwhelm the opponent’s answers to Rapidash, primarily Octillery and Dewgong. Magmar and Flareon do not pack recovery moves, so they are less eager to switch into Thunder but are much more offensively dangerous than either Rapidash or Ninetales.</p> <p><strong>Super Effective Moves</strong>: Primeape and Hitmonlee are able to come in easily on Hidden Power Ice and outspeed and OHKO Magnemite with Cross Chop and High Jump Kick. Primeape can even use Substitute to take advantage of the free turn given by Magnemite switching out. Meanwhile, Hitmonlee has RestTalk to heal off any damage or paralysis. However, Primeape is 2HKOed by Thunder and utterly despises paralysis, while Hitmonlee can easily be chipped into 2HKO range of Thunder and also doesn't enjoy paralysis. Weezing has easy entry on Hidden Power Ice and can tank a Thunder or two—bar if it is paralyzed—and is both faster and often uses Fire Blast for Magnemite, though coming in on it repeatedly wears Weezing down quickly, especially if it eats a Thunder, and Weezing is often forced into choosing the right move on the switch in fear of giving free entry to Xatu or Dugtrio. Stantler has Earthquake to deal with Magnemite, is faster, and almost always uses Light Screen + Curse or RestTalk to improve on its longevity and threat level, though it takes massive damage from Thunder on the switch and, if paralyzed, may fall to a second Thunder. Kingler, and occasionally other Pokemon like Gloom, can use Hidden Power Ground to deal with Magnemite. Kingler even runs Substitute often, which takes advantage of any Rest, Hidden Power Ice, or Thunder miss pulled by Sleep Talk, and it is much faster than Magnemite and learns Swords Dance to become a major threat to boot. However, Kingler cannot switch directly into Magnemite in fear of being OHKOed by Thunder.</p>",
    "sets": {
      "RestTalk": {
        "description": "<h1>Set Description</h1> <p>Thunder is preferred to Thunderbolt to hit switch-ins harder; it 2HKOes Rapidash and Stantler after Spikes, hits Octillery and other Electric-weak targets for a potential OHKO, more reliably paralyzes foes, and is capable of 3HKOing bulky Normal-types like Wigglytuff. Hidden Power Ice is the best coverage option Magnemite has to hit Pokemon that resist Electric such as Dugtrio, Graveler, and Gloom, and it also provides a second way to hit Flying-type Pokemon with perfect accuracy or while using Sleep Talk. RestTalk keeps Magnemite healthy throughout the course of a game to take advantage of its useful defensive typing, primarily making it a strong long-term check to Xatu, Fearow, and Persian that can consistently use them as an opportunity to fire off Thunder.</p> <h1>Team Options</h1> <p>Magnemite's favorite partner is Xatu, which can cover for Pokemon that can threaten Magnemite, including Weezing, Primeape, and Dugtrio; in return, Magnemite can defeat Wigglytuff, Fearow, and Porygon. Magnemite adores Pineco's Spikes because its main answers, Dugtrio, Rapidash, and Ninetales, all take damage from Spikes, wearing them down and making it easier for Magnemite to muscle through them over time, especially with paralysis from Thunder. Both Graveler and Pineco can use Rapid Spin to clear opposing Spikes so that Magnemite doesn't take damage itself. Ninetales and Rapidash take on Fire-types like opposing Ninetales and Magmar as well as other Magnemite, which Magnemite can struggle with. Magnemite appreciates Rapidash especially, as it can severely threaten Ninetales and forces Water-types like Octillery and Dewgong to use Rest often, giving Magnemite a potential free entry to fire off an attack. Octillery and Dewgong are also prime candidates for partnering with Magnemite, being roadblocks for Dugtrio and acting as better checks to other Octillery and Dewgong than Magnemite, as it does not resist Water and thus takes significant damage from Surf. Weezing and Fearow both handle Primeape and Hitmonlee and assist with pressuring Stantler. Fearow also forces Octillery and Dewgong to use Rest more often, providing entry points for Magnemite, similarly to Rapidash. Primeape and Hitmonlee themselves also enjoy Magnemite's presence, as it can cover for their weaknesses to Xatu and Fearow while in return threatening Stantler. Hitmonlee additionally deals with Octillery, Dewgong, and Chinchou well. Dugtrio also synergizes well with Magnemite, threatening Fire-types like Rapidash and Ninetales and appreciating its ability to take on Xatu and pressure Octillery.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "BeeOrSomething", "user_id": 583728}], "teams": [{"name": "Quality checked by", "members": [{"username": "Stories", "user_id": 400664}, {"username": "Estarossa", "user_id": 461329}]}, {"name": "Grammar checked by", "members": [{"username": "Rose", "user_id": 511181}, {"username": "UT", "user_id": 523866}]}]}
  },
  "Dewgong": {
    "sets": {
      "RestTalk": {
        "description": "<p>With solid special bulk, an excellent STAB combination, and good utility moves, Dewgong is an excellent tank in NU. Its dual STAB combination of Surf and Ice Beam keeps a large chunk of the metagame at bay, dealing at least neutral damage to all Pokemon that aren't Water-types while threatening passive Water-types with an Ice Beam freeze. It also hits a wide variety of common threats super effectively, including Xatu, Magmar, Rapidash, Pupitar, Dugtrio, and Gloom. Dewgong is one of the most solid answers to Xatu, the top threat of NU, as it is only 5HKOed by Psychic and threatens a 2HKO against Xatu with Ice Beam, which most specially bulky Pokemon cannot hope to achieve. The combination of Rest and Sleep Talk gives it longevity, the ability to absorb status, and a chance to damage any check that might try to take advantage of its sleep turns to switch in. Dewgong can also run Hidden Power Electric or Hidden Power Grass to deter Water-types. The former deals a heavy blow to Mantine, while the latter chips the threatening Chinchou. However, while they are useful against Kingler and its low Special Defense, they are typically inferior to the standard attacks, as bulkier Water-types like Dewgong and Azumarill just shrug them off regardless, and losing a STAB move makes Dewgong a liability against either Fire- or Grass-types.</p> <p>Dewgong and Gloom synergize with each other very well; while Gloom can deal with threatening Pokemon Dewgong can't handle such as Primeape, Hitmonlee, and Chinchou, Dewgong is able to threaten Xatu and opposing Fire-types that can 2HKO or OHKO Gloom. Its ability to switch into Xatu makes Dewgong a good supporting Pokemon for Fighting-types like Primeape, a very dangerous sweeper that typically wants to avoid Xatu. Dewgong requires support in the form of an offensive presence towards the Pokemon that tend to take advantage of it. Xatu's STAB Psychic functions as a deterrent for Water-types like the threatening Kingler that can endure Dewgong's STAB moves and set up with Substitute and Swords Dance. Dewgong's moveset and defensive traits won't quite cut it on their own to stop the metagame's physical Normal-types from running over a team. Stantler and Fearow have a high damage output and outspeed Dewgong, while Lickitung, Dunsparce, and Wigglytuff can withstand a few attacks and slowly set up with Swords Dance or Curse. It's only natural that Normal-resistant Pokemon can come to its aid. Sudowoodo can take a few hits from Stantler and non-Belly Drum Lickitung and threaten to remove them with Self-Destruct. Shuckle is another valid option due to its phenomenal defenses and typing, which let it sit in on anything that Normal-types may throw at it and stall them out. One of Dewgong's key flaws is its weakness to Rock-type attacks, so it can be effective to pair Dewgong with another Water-type, such as Kingler or Octillery.</p>"
      },
      "Toxic Support": {
        "description": "<p>GSC NU's fast-paced metagame can sometimes leave Dewgong with RestTalk lagging behind: Curse Normal-types can set up in its face, Kingler easily takes advantage of it, and even Fire-types can set up Sunny Day in its face to take reduced damage from an already fairly weak Surf. Nevertheless, Dewgong can make use of its bulk and unique movepool to punish some of its more audacious foes. Many of the Pokemon that can take advantage of Dewgong, such as Primeape, Kingler, Sneasel, and Sunny Day Magmar, despise getting poisoned. Ice Beam as the chosen STAB move allows Dewgong to threaten Xatu and Gloom while using Toxic to put pressure on most everything else. Protect lengthens Dewgong's lifespan and has good synergy with Toxic while also granting the player a chance to scout moves. Certain variants of Toxic Dewgong may include Surf as a means to threaten Magnemite and RestTalk Sudowoodo, which can otherwise take advantage of Dewgong. Encore is used to punish setup Pokemon and other foes that think they can take advantage of Dewgong, such as Kingler, Wigglytuff, and Sunny Day Fire-types. Dewgong can even switch into Surf from Chinchou and prevent it from using Thunder on the next turn thanks to its higher Speed stat. Rest can work even without Sleep Talk, as Dewgong can withstand a few hits from foes such as Xatu and Octillery. This makes Dewgong a bit less susceptible to status, but sleep makes it easier to take advantage of, so Protect is preferred in most circumstances.</p> <p>Of all the support Pokemon that Dewgong likes to pair with, Gloom is definitely one of the better options. Gloom is immune to Toxic and resists all STAB moves from two of the biggest threats to Dewgong, Primeape and Chinchou. Gloom and Dewgong form a very solid defensive core to counterbalance the common Xatu + Fire- and Fighting-type offensive archetypes, and an even greater synergy forms when Ninetales is added to the mix. Ninetales is a specially bulky Pokemon that can help defend against Xatu if Dewgong is low on health, hinders Sunny Day teams by virtue of its typing, and has Roar to shut down any Baton Pass users that may switch into Gloom, such as Flareon and Ledian. Since Dewgong's lack of Surf can make it weak to opposing Rock-types and incapable of threatening Magnemite, the only Steel-type in the tier with access to a powerful Thunder, Pupitar can be effective to initially check these threats. Weezing is another solid teammate that can take on Primeape and has Haze to prevent setup sweepers from breaking through the defensive core. It has solid offensive coverage in Fire Blast and Thunder and can take potential threats down with Explosion. Other Pokemon that like Dewgong's support are Hitmonlee and Xatu. Dewgong can handle Xatu for Hitmonlee, which can remove Spikes with Rapid Spin and also take on Chinchou for it. Xatu benefits from Dewgong defending against faster Pokemon like Dugtrio and Rapidash, while it can use its STAB Psychic to threaten Fighting-types like Hitmonlee and Primeape, dangerous threats such as Kingler, and Weezing, which might use Explosion to remove Dewgong. Pineco grants offensive utility with Spikes to a team that might rely too heavily on stalling out the opponent. Reflect also allows Pineco to support its team against the aforementioned Fighting-types, and Rapid Spin can keep Dewgong from being worn down by Spikes.</p>"
      },
      "Growth Pass Recipient": {
        "description": "<h1>Set Description</h1> <p>Dewgong is one of the scariest Growth recipients in the tier, since it is extremely bulky and fast enough to outspeed threats to it such as Weezing and Chinchou. It is able to 2HKO or 3HKO every Pokemon in the tier at +1 Special Attack, with the exception of other Dewgong, which still cannot deal significant damage back unless they run Toxic. Ice Beam threatens to OHKO common Pokemon such as Xatu, Fearow, and Gloom after a boost. Ice Beam also makes sure Dewgong cannot be answered by Grass-types like Stun Spore Gloom and Tangela. Surf, meanwhile, is important so that Dewgong is not answered by Fire-types like Ninetales and Magmar, as if it chose to run a set with Ice Beam, Hidden Power Grass, and RestTalk, Dewgong would fail to do meaningful damage to them, and the Growth pass attempt would be wasted. Hidden Power Grass hits opposing Water-types like Octillery and other Dewgong; while it has worse DV requirements than Hidden Power Electric, Hidden Power Electric cannot hit Chinchou super effectively. After a boost, Dewgong is favored to 2HKO Chinchou and is guaranteed to 3HKO Octillery with Hidden Power Grass, and although it only has a miniscule chance to 3HKO other Dewgong, RestTalk Dewgong cannot do meaningful damage back and will fall to an eventual high roll or critical hit. However, Toxic + Encore sets can shut down even a boosted Dewgong fairly easily. Flareon can also potentially pull off using Growth twice before executing a Baton Pass to Dewgong, in which case all Pokemon that only get 3HKOed by a +1 Dewgong will now be 2HKOed. Protect is crucial for blocking a use of Explosion by Weezing or Pineco that attempt to take down Dewgong before it can do any more damage. Protect also allows Dewgong to freely gain additional Leftovers recovery and is a large part of making Dewgong so frustrating to take down, with it seemingly staying alive for so long and causing so much havoc despite taking several hard hits.</p> <h1>Team Options</h1> <p>Aside from the mandatory Growth + Baton Pass Flareon, Weezing makes for a strong partner, as Primeape and Hitmonlee aren't 2HKOed by a +1 Dewgong and outspeed it to 2HKO back with Cross Chop and High Jump Kick, respectively. Primeape even has an increased chance to land an OHKO on Dewgong due to Cross Chop’s boosted critical hit rate. Weezing hard counters the Fighting-types and uses them to fire off attacks, and it can make for a short-term Fearow switch-in or a lure for potential threats to Growth pass like Dugtrio, Ninetales, and Wigglytuff, being able to eliminate them with Explosion. Xatu also helps out with the Fighting-types and complements Dewgong nicely, as it is the main recipient of Growth when encountering a team with a Fighting-type thanks to its Speed and STAB Psychic, while Dewgong is the main choice of Growth recipient into most other teams, especially ones with Fearow. Lead dual screens Dragonair makes starting off the game with a Flareon setup and using Baton Pass to pass Growth to to Dewgong safely much easier, allowing Dewgong to act as a wallbreaker early-game. Curse Wigglytuff and Stantler are effective choices on a Growth pass team to take advantage of the huge holes broken in the opposing team by a boosted Dewgong before it goes down, often being able to overwhelm the opponent and clean up the rest of the game. They are also able to switch into Chinchou and, to a lesser extent, Magnemite, which would otherwise be problematic for Growth pass teams because they usually forgo an Electric-resistant Pokemon.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "cherryb0ng", "user_id": 421511}, {"username": "BeeOrSomething", "user_id": 583728}], "teams": [{"name": "Quality checked by", "members": [{"username": "Earthworm", "user_id": 15210}, {"username": "MrSoup", "user_id": 375193}, {"username": "dawnbuster", "user_id": 508601}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}, {"username": "Tbolt", "user_id": 555379}, {"username": "autumn", "user_id": 384270}]}]}
  },
  "Kingler": {
    "sets": {
      "King Krab (RestTalk)": {
        "description": "<p>Kingler's bread-and-butter set. Swords Dance boosts Kingler's already absurd base 130 Attack to levels otherwise scarcely seen in GSC NU, allowing it to become a terrifying threat with few counters. Traditional wisdom would suggest that a mono-attacking Swords Dance user would be easily walled, but the lack of Ghost- and Steel-types available in GSC NU and the threat of a possible Surf prior to its full set being revealed allow Kingler to pull it off quite effectively. Frustration is an adequately high-powered attack that deals more than enough damage to most foes after using Swords Dance. Double-Edge brings greater power but at the cost of having to use Rest earlier. Moreover, the recoil can turn uncertain 2HKOs from faster Pokemon such as Xatu into guaranteed 2HKOs. However, a major benefit to Double-Edge is that it always OHKOes Chinchou after using Swords Dance, whereas Frustration only does 10% of the time. RestTalk allows Kingler to take strong hits from foes such as weakened Xatu and Magmar in exchange for KOing them and recovering its health later on against a more passive foe. It also allows Kingler to wall foes such as Stantler and Hitmonlee should such a need arise.</p> <p>Spikes support for Kingler is useful, helping it break through opposing Pokemon that can threaten to KO back such as Chinchou. Pineco is a useful partner to lay Spikes and help keep them off the field and can also threaten Xatu with Explosion. Rock-types such as Pupitar, Graveler, Corsola, and Sudowoodo take little damage from mono-attacking Kingler and typically have Curse or at least Self-Destruct or Explosion to take it down. However, until Kingler's moveset is revealed, these Pokemon are very risky Kingler checks, which can play to its advantage. Fast and powerful special attackers such as Xatu and Magmar can prey on Kingler's poor Special Defense and give it trouble. Xatu also has access to Haze, which can halt a potential sweep from Kingler. Magnemite is very capable of checking mono-attacking Kingler with its STAB Thunder and doesn't take much in return from Frustration, although it must be wary of Hidden Power Ground sets, so it will rarely be the first port of call when responding to Kingler. Weezing can give Kingler trouble with its excellent defenses and access to Thunder and Explosion.</p>"
      },
      "Substitute Krab": {
        "description": "<p>Kingler is one of the best Pokemon in the tier at taking advantage of passive Pokemon like RestTalk Azumarill and RestTalk Ninetales. However, if it lacks coverage attacks, it is easily walled by Pokemon that resist Normal, such as Sudowoodo, Magnemite, and Shuckle. This set looks to alleviate this problem by adding a coverage move. Frustration is its primary attack, capable of hitting everything that isn't a Rock-, Steel-, or Ghost-type very hard. Double-Edge can be used over Frustration for more immediate power but at the expense of the recoil potentially reducing Kingler's ability to execute a full sweep. Body Slam is another option that turns Kingler into more of a self-supporting sweeper and team player, but the power drop is quite significant—+2 Double-Edge is a guaranteed OHKO against Chinchou, whereas +2 Body Slam never OHKOes. It should also be noted that without RestTalk, Kingler can struggle to find safe opportunities to switch in, meaning that it might struggle to find a second opportunity to set up and sweep after landing a Body Slam paralysis. Hidden Power Ground is the preferred coverage attack, and it allows Kingler to hit Magnemite, which would otherwise wall it, while still hitting most Rock-types for super effective damage. However, Surf is also a valid option, hitting Shuckle super effectively and significantly threatening most other Rock-types without having to boost its Attack. Despite Kingler's pathetic Special Attack, its Surf is still capable of 2HKOing Sudowoodo and OHKOing Rock / Ground types such as Pupitar. Swords Dance is used to boost Kingler's already high Attack, helping it power through foes. Substitute is utilized to prevent status from being inflicted on Kingler and to block Explosion from foes such as Pineco. It also punishes switches, can be used to fish for Thunder misses from Pokemon such as Magnemite, Weezing, and Chinchou, and takes advantage of sleeping, frozen, and paralyzed Pokemon. Finding an opportunity to put up a Substitute can swing the matchup against Xatu and Magmar, which outspeed and 2HKO Kingler.</p> <p>Should Kingler run Surf, teammates that can take advantage of Corsola, such as Exeggcute and Chinchou, or Pokemon that can lure it, such as Hidden Power Grass Fearow, Hidden Power Grass Flareon, and Hidden Power Grass Pineco, are good teammates. Xatu is still a threat, so Pokemon that can inflict paralysis against it, such as Gloom, Body Slam Hitmonlee, Thunder Primeape, and Thunder Wave Wigglytuff, make for good teammates. The primary threats to Kingler in general are special attackers looking to exploit its lackluster Special Defense stat. Ninetales pairs well here, as it can stall Xatu out and is a great special tank in general. Chinchou and Magnemite are both problematic to the Surf variant, as they can each take a +2 Frustration and OHKO in return with STAB Thunder. Teammates that can deal with both Magnemite and Chinchou, such as Hitmonlee, are helpful for Kingler. Lastly, this set offers great wallbreaking potential, so speedy offensive Pokemon that can capitalize on weakened foes such as Rapidash, Fearow, and Dugtrio make for good teammates.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "FNH", "user_id": 245982}], "teams": [{"name": "Quality checked by", "members": [{"username": "dawnbuster", "user_id": 508601}, {"username": "Earthworm", "user_id": 15210}]}, {"name": "Grammar checked by", "members": [{"username": "Rabia", "user_id": 336073}]}]}
  },
  "Exeggcute": {"sets": {"Boom Utility": {}}},
  "Cubone": {
    "sets": {
      "Agility Recipient": {
        "description": "<p>Cubone looks useless on paper with its absolutely awful stats, but it has a solid niche thanks to Thick Club doubling its Attack. As a result, Cubone is arguably the best and most dangerous recipient of Baton Passed Agility boosts, capable of OHKOing almost everything in the metagame after it uses Swords Dance. By receiving an Agility boost from Ledian, Farfetch'd, or the less common Ariados, Cubone can very easily end games when it gains +2 Attack and +2 Speed. It also has decent physical bulk, giving it a few opportunities to set up against strong physical attackers like Stantler as well as letting it avoid having its Substitute broken by any resisted Rock- and Poison-type attacks and notably giving it a 49% chance to survive Pineco's Explosion. Cubone is next to worthless outside of its incredible Attack, though, being very slow while also having poor longevity because it is frail and can't hold Leftovers. In addition, its +2 Earthquake fails to OHKO certain Water-types like Azumarill, Kingler, and Dewgong, and other bulky Pokemon like Wigglytuff also have a chance of surviving.</p> <p>Earthquake is Cubone's best STAB attack and threatens to OHKO the numerous Poison-, Rock-, and Fire-types in GSC NU. Rock Slide is also mandatory to hit Flying-types like Xatu and Fearow as well as other threats like Pineco. Swords Dance rapidly boosts Cubone's Attack, turning it into a near unwallable threat at +2. It should be noted that due to how overflow mechanics work in GSC, Cubone should never use Swords Dance more than once, as its Attack stat will overflow and it will do very little damage. Substitute is generally preferred for Cubone's last move, as it lets it dodge status moves such as Gloom's Stun Spore and avoid taking heavy damage from Explosion. Hidden Power Bug is also an option to hit Grass-types such as Exeggcute, Bayleef, and Tangela, but these Pokemon are uncommon in GSC NU, leaving Substitute as the preferred option.</p> <p>Cubone should virtually only be used on Agility + Baton Pass teams, as it is incredibly slow, quite frail, and outclassed by other Pokemon that exploit paralysis like Kingler. Pokemon that can pass Agility are close to mandatory partners for Cubone, and the traditional choices for this role are Farfetch'd and Ledian. Farfetch'd can notably save Cubone a turn, as it can pass Swords Dance to Cubone itself, while Ledian can also pass Barrier or set up Light Screen to help Cubone set up. Ariados is another less common Baton Pass user that can also trap a foe with Spider Web. It is worth noting that Dugtrio is the only Pokemon in GSC NU able to outspeed Cubone at +2 Speed, though it is only capable of 3HKOing it. Spikes support from Pineco is another way of supporting Cubone, as the chip damage notably gives it a chance to OHKO Azumarill and almost guarantees an OHKO on Dewgong, Lickitung, and Dunsparce.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "dawnbuster", "user_id": 508601}], "teams": [{"name": "Quality checked by", "members": [{"username": "Earthworm", "user_id": 15210}, {"username": "Siatam", "user_id": 175539}]}, {"name": "Grammar checked by", "members": [{"username": "SolarBeam", "user_id": 470115}]}]}
  },
  "Magmar": {
    "sets": {
      "Special Sweeper": {
        "description": "<p>Magmar is one of the best offensive Pokemon in GSC NU. It can be difficult to wall without Ninetales due to its excellent coverage, letting it hit a lot of the tier quite hard. Magmar also brings decent defensive utility to its team thanks to its usable Special Defense, which means Magmar is notably only 4HKOed by Xatu's Psychic. Magmar is also quite fast for the tier, outpacing threats like Kingler and Hitmonlee. However, Magmar does face competition from other Fire-types that bring more to a team; Ninetales brings huge defensive potential, and Rapidash is an incredibly fast lead with Hypnosis. Magmar's STAB Fire Blast threatens to 2HKO a large portion of the tier, notably Xatu, and can be powered up even more with Charcoal. Thunder Punch damages Water-types such as Octillery and Kingler quite a lot and gives Magmar coverage for Flying-types that won't miss unlike Fire Blast. Hidden Power Grass can be used instead, as it OHKOes Graveler, can 2HKO Sudoowodo with Spikes up and additional minor chip damage, and can reduce prediction between deciding to use Thunder Punch to hit Octillery or Fire Blast to hit Dugtrio while barely being weaker than Thunder Punch against Octillery; however, it comes at the cost of significantly reducing Magmar's DVs and losing out on Thunder Punch's ability to hit Flying-types with perfect accuracy. Cross Chop heavily threatens Dewgong, damages Wigglytuff and Dunsparce harder than Fire Blast, and has a chance to land a critical hit through the Normal-types' Curse boosts. Lastly, Sunny Day powers up Magmar's Fire Blast to a staggering degree, notably 2HKOing even the incredibly bulky Dewgong while lowering the power of Water moves and reducing the accuracy of Thunders aimed at Magmar, even allowing Magmar to become a solid answer to Dewgong if it can gain entry on a usage of Ice Beam or Rest. Hidden Power Ground can be used instead to hit opposing Fire-types hard while also 2HKOing Chinchou after Spikes damage, though it still cannot 3HKO the faster and RestTalk-using Ninetales without Spikes. Thief can also be chosen in order to weaken bulky Pokemon like Octillery, Ninetales, and Xatu, making it easier for Magmar itself to wallbreak later in the game while also supporting teammates, though it makes it significantly harder to switch Magmar into battle with Spikes up due to lack of Leftovers before using Thief.</p> <p>Magmar pairs well with Water-types, most notably Chinchou, which beats the Water- and Fire-types that can beat Magmar one-on-one; in return, Magmar beats the Grass-types that wall Chinchou. Pokemon with Explosion or Self-Destruct such as Weezing and Sudowoodo can try to take out bulky Water- and Fire-types that give Magmar trouble. Magmar also pairs well with other fast offensive Pokemon such as Fearow, Xatu, and Primeape to overwhelm the opponent's defensive core with Spikes down, as they can force the defensive Pokemon to switch around and take chip damage, which can leave the opponent's team weakened enough to be cleaned up. Finally, Magmar makes for a very good recipient of Baton Pass, especially Growth passes from Flareon.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "dawnbuster", "user_id": 508601}], "teams": [{"name": "Quality checked by", "members": [{"username": "Earthworm", "user_id": 15210}, {"username": "FNH", "user_id": 245982}]}, {"name": "Grammar checked by", "members": [{"username": "deetah", "user_id": 297659}]}]}
  },
  "Flareon": {
    "overview": "<p>Flareon makes its name as by far the best Pokemon that learns both Growth and Baton Pass in NU, becoming a powerful support piece for facilitating strong special attackers. Flareon also has incredible attacking stats itself, allowing it to function as a powerful wallbreaker, whether it be with Growth sets or mixed sets. Flareon also has an amazing Special Defense stat and a resistance to Fire, allowing it to check Pokemon such as Xatu, Magnemite, and Ninetales when using a RestTalk set. However, Flareon is very frail physically and is weak to Rock, Ground, and Water, all very common attacking types; strong STAB Normal-type attacks and Weezing's Sludge Bomb also deal significant damage. Flareon is also quite slow, sitting at only base 65 Speed, leaving it susceptible to being revenge killed by a variety of threats like Stantler, Dugtrio, and Dewgong. Flareon can also be difficult to justify putting on teams, as Pokemon like Magmar, Weezing, and Stantler often tend to be better choices for the purpose of wallbreaking without dedicated team support, while Ninetales and Rapidash are usually preferred as RestTalk Fire-types for their much higher Speed stat and better physical bulk allowing them to check threats like Weezing.</p>",
    "comments": "<h1>Other Options</h1> <p>An all-out attacking set with Fire Blast, Double-Edge, Hidden Power Ground or Hidden Power Water, and Baton Pass or Protect can be used to give Flareon maximum immediate coverage and additional utility for pivoting or additional Leftovers recovery. However, RestTalk tends to outclass this set because, while it cannot immediately force significant damage unto Rock-types like Graveler and Sudowoodo, it is significantly sturdier in the long term and is much more resilient to status. Substitute can be used on the Growth Pass set to block status and give a temporary wall to whatever Flareon chooses to Baton Pass to, but it comes at the cost of coverage and can be difficult to pull off successfully.</p> <h1>Checks and Counters</h1> <p><strong>Water-types</strong>: Octillery takes little damage from Fire Blast and has a chance to dodge a 3HKO from both Double-Edge and Hidden Power Grass, especially if it has Ice Beam rather than Hidden Power Electric, always uses RestTalk to significantly improve its longevity, and hits back hard with an incredibly powerful 105 base Special Attack STAB Surf. However, it is slower than Flareon and is 3HKOed by Double-Edge while not OHKOing in return with Surf, even after Flareon takes recoil damage, so it is very quickly forced to use Rest if switching into Double-Edge; it also means that if Flareon uses Growth as Octillery switches in, it can safely Baton Pass the Growth boost out to something not weak to Water, such as Dewgong. Dewgong itself outspeeds and can either 2HKO Flareon with Surf or use Encore on Flareon's use of Growth, forcing it to switch out, though it takes significantly more damage from Fire Blast due to its part Ice typing. Chinchou also outspeeds Flareon and hits it hard, but its Special Attack stat is so low that Surf cannot 2HKO even Hidden Power Grass variants of Flareon from full health, and Chinchou takes massive damage from all of Double-Edge, Hidden Power Ground, and Hidden Power Grass.</p> <p><strong>Dugtrio</strong>: Dugtrio is much faster than Flareon and can hit it with Earthquake for upwards of 90% of its health or use Flareon switching out of battle to set up a Substitute. However, Dugtrio is slammed by Flareon, being 2HKOed by most of its moves, and thus cannot switch directly into it more than once unless on a predicted use of Growth or Protect. The Reflect that Growth Pass Flareon is often paired with also prevents Dugtrio from beating it, though Dugtrio can still use Screech, which will even carry over when Flareon uses Baton Pass.</p> <p><strong>Rock-types</strong>: Sudowoodo resists both Fire and Normal and is bulky enough both physically and specially to where the occasional Hidden Power Ground cannot 3HKO without Spikes, and Flareon needs to use Growth to 2HKO with Hidden Power Grass. Sudowoodo meanwhile can boost up with Curse, hit Flareon hard with either Rock Slide or Earthquake, and even use Self-Destruct, preventing any safe usage of Baton Pass. Graveler and Pupitar are much rarer and take signficantly more damage from Hidden Power Grass, with Graveler even being OHKOed without any boosts, but they are sufficient answers to Flareon sets without Hidden Power Grass, especially since Graveler has Explosion, and Pupitar has Screech to disrupt any Growth Pass antics.</p> <p><strong>Faster Physical Attackers</strong>: Stantler, Fearow, Persian, Primeape, Hitmonlee, and Kingler all outspeed and hit Flareon incredibly hard with their STAB moves or super effective coverage. Rapidash uses Double-Edge and Magmar occasionally uses Hidden Power Ground, both of which also deal significant damage to Flareon. However, none of these Pokemon want to switch into Flareon in fear of Fire Blast or Double-Edge, and Flareon can also use Baton Pass as they switch in.</p> <p><strong>Status</strong>: If not running RestTalk, poison is quite harmful, as Flareon wants to preserve its health as much as possible to be able to come into battle multiple times and take hits from faster Pokemon before attacking. Paralysis is also ruinous, as Flareon needs to be able to outspeed as much as possible, and any full paralysis is extremely detrimental, as Flareon needs to be spending the turns it gets doing something productive, especially if attempting to execute a Growth Pass. Sleep, while much rarer, flat out puts Flareon out of commission. All three status effects are also often dished out by prime targets for Flareon's entry, such as Ninetales's Toxic, Gloom's Stun Spore, Sludge Bomb, or even Sleep Powder, and Magnemite's Thunder, making it risky to try to switch into them when not running RestTalk.</p>",
    "sets": {
      "Growth Pass": {
        "description": "<h1>Set Description</h1> <p>Fire Blast is chosen over Flamethrower to give Flareon more use mid-game when it cannot set up a Growth safely, since Fire Blast can 2HKO important targets, such as Xatu and Stantler, that Flamethrower cannot. Hidden Power Grass targets Octillery and Rock-types such as Sudowoodo and Graveler, but Double-Edge allows Flareon to threaten Ninetales—which uses Roar sometimes to counter Baton Pass—and also out-damages Hidden Power Grass against Octillery and Chinchou before a Growth boost. It also does not significantly lower Flareon's DVs like Hidden Power Grass does. However, it comes at the cost of not being able to significantly damage Rock-types like Graveler in the short term. Flareon should aim to use Baton Pass after using Growth once or twice and give those boosts to powerful special attackers early-game to break holes, then re-entering the battle again later on to launch powerful Fire Blasts or even execute a second Growth Pass.</p> <h1>Team Options</h1> <p>The prime candidate for receiving a Growth Pass from Flareon is Dewgong, specifically the 3 attacks + Protect variant. This set is extremely efficient at shredding through multiple pokemon on the opponent’s team, as it has perfect coverage, and Dewgong is difficult to take down quickly due to it being so bulky and having Protect to gain extra recovery from Leftovers. However, it lacks the damage to be able to function effectively without a Growth Pass from Flareon. Dual screens Dragonair is another valuable partner, facilitating a much easier setup early-game while preventing the common Pineco lead from safely using Spikes. Xatu is also an amazing Growth recipient, gaining the power it needs to 2HKO targets such as Octillery and 3HKO bulkier walls like Wigglytuff while also not being vulnerable to Fighting-types like Dewgong is. Hidden Power Electric Octillery also makes for a fantastic Growth recipient, as Octillery is able to grab many 2HKOs when at +1, and it can even 3HKO Dewgong. Magmar can also work as a solid Growth recipient with its incredibly powerful Fire Blasts and superb coverage, though it can be difficult to successfully pass to, as it shares the same weaknesses as Flareon. Wigglytuff can even be a fine Growth recipient due to its great bulk and incredible array of coverage, including Ice Beam, Thunder, and Fire Blast.</p>"
      },
      "RestTalk": {
        "description": "<h1>Set Description</h1> <p>Fire Blast is essential over Flamethrower, as this set wants all the power it can get without Growth. Double-Edge is Flareon's strongest neutral physical move, primarily being able to 3HKO Octillery and Ninetales. RestTalk grants Flareon great longevity, making it a solid check to Xatu and letting it counter Ninetales, other Flareon that lack a physical attack, Magnemite, and Magmar without Hidden Power Ground, letting Flareon effortlessly use them to fire off attacks. RestTalk also significantly reduces Flareon's vulnerability to status, no longer being afraid of paralysis from Magnemite's Thunder, Gloom's Stun Spore, or Toxic poison from Ninetales and Pineco. RestTalk also allows Flareon to fully utilize the high power of Double-Edge without fearing its recoil damage.</p> <h1>Team Options</h1> <p>Pineco is RestTalk Flareon's favorite partner, setting Spikes to wear down Rock-types like Sudowoodo and giving threats like Octillery, Dewgong, and Stantler a much more difficult time switching into Flareon. Octillery is another very important partner, taking on the Sudowoodo, Dugtrio, and Graveler that would otherwise use Flareon to their advantage, as well as being able to duel other Octillery if it has Hidden Power Electric. Curse Porygon can accomplish similar feats as Octillery, switching into Sudowoodo and Graveler and appreciating Flareon's ability to handle Ninetales, Magnemite, and Gloom. Dugtrio assists with Sudowoodo and enjoys RestTalk Flareon's pairing with Pineco and efficiency at chipping Octillery and Dewgong. Xatu and Fearow can switch into Dugtrio's Earthquake and are good teammates of Flareon's for similar reasons to Dugtrio; Fearow, especially when paired with Toxic Pineco, makes for a great core with Flareon that repeatedly forces Sudowoodo and Graveler in and wears them down with repeated hits and Spikes or poison, respectively. Flareon can also be a decent switch-in to opposing Magnemite for Xatu and Fearow. Sudowoodo makes for a solid combo with Flareon, as it tends to use Self-Destruct on Octillery, Dewgong, or some other bulky wall like Wigglytuff, eliminating a potential stopgap to Flareon so that it can cause havoc easier; Sudowoodo also prevents Fearow and Persian from revenge killing Flareon and can Self-Destruct on Dugtrio. Weezing can accomplish similar feats, and Flareon can check Xatu and Ninetales for Weezing.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "BeeOrSomething", "user_id": 583728}], "teams": [{"name": "Quality checked by", "members": [{"username": "MrSoup", "user_id": 375193}, {"username": "juoean", "user_id": 486979}]}, {"name": "Grammar checked by", "members": [{"username": "Tea Guzzler", "user_id": 577920}, {"username": "ken", "user_id": 594478}]}]}
  },
  "Porygon": {
    "overview": "<p>In a landscape dominated by strong offensive Normal-types, Porygon appears outclassed and outgunned by all, especially by Wigglytuff, which is the default bulky, recovery-using Normal-type that blanket checks special attackers like Xatu, Dewgong, and Chinchou. However, Recover is a saving grace, being one of the best moves in Generation 2 and single-handedly making Porygon a legitimate pick. Recover's astonishing 32 PP makes Porygon far more resilient a wall than its stats would show, turning otherwise 3HKOs from unboosted attackers like Xatu, Octillery, and Graveler into attacks that never break past a healthy Porygon without critical hits. Recover also frees up a moveslot since Porygon does not have to use both Rest and Sleep Talk. Porygon additionally has a solid movepool outside of Recover, as well as a good Special Attack stat and the overall amazing Normal typing, allowing it to utilize Recover to the fullest. Porygon answers Xatu and Dewgong well, using Recover to heal off any damage while hitting them super effectively or setting up Curse in return. Porygon can also help to answer Dugtrio and Curse Stantler, 2HKOing the former with Double-Edge or Ice Beam and paralyzing the latter. It's additionally a prime candidate for spreading paralysis with Thunder Wave, using its solid bulk, Recover, and mere one weakness to slow down offensive threats and support slow but dangerous teammates, such as Kingler. However, Porygon still has plenty of flaws, the main ones being competition and vulnerability to status. Porygon has very low base stats when compared to other Normal-types like Fearow, Stantler, and Wigglytuff, all of which are much better than Porygon, primarily Wigglytuff as previously mentioned. Porygon is also the only recovery-using pure Normal-type that cannot effectively check Chinchou or Ninetales, as, although Recover is generally far better than RestTalk, it also means Porygon can't absorb status, so any Thunder paralysis or Toxic poison will effectively make Porygon useless; Sludge Bomb's poison rate also prevents Porygon from being a decent check to Weezing. Porygon is also incredibly slow; the only common Pokemon slower are Graveler, Sudowoodo, and Pineco, meaning Porygon is incredibly reliant on spreading paralysis and gets forced to repeatedly use Recover, instead of using an attacking move. This massively opens it up to critical hits, Ice Beam freezes, or Psychic Special Defense drops from the likes of Octillery, Dewgong, and Xatu on the switch or if they choose to stay in.</p>",
    "comments": "<h1>Other Options</h1> <p>Ice Beam can be used in place of Thunder Wave on the Curse set in order to let Porygon break past Pupitar, as well as immediately threatening Xatu and especially Dugtrio without worrying about taking recoil. However, this makes it significantly more difficult for Porygon to successfully set up with Curse, as the opposing Pokemon will likely always be faster. Thus, after using Double-Edge, it may be in KO range due to taking a strong special attack before moving, alongside Double-Edge recoil; lacking Thunder Wave also means Porygon can no longer support other slow teammates, like Octillery. Nightmare has potential over Thunder Wave on the BoltBeam set to reduce the safety in switching in an erstwhile wall, especially with Spikes on the field and some prior chip damage, primarily aiming for RestTalk Wigglytuff, Ninetales, Stantler, or Persian. Once again though, it means sacrificing the all-around great utility of Thunder Wave, and Nightmare will likely be useless if BoltBeam Porygon does not encounter one of these foes, as other Rest users like Xatu, Fearow, and Octillery lose to Porygon anyways; Thief also tends to be a superior option against these checks.</p> <h1>Checks and Counters</h1> <p><strong>Wigglytuff</strong>: Wigglytuff walls the BoltBeam set, not being weak to Thunder or Ice Beam, and Porygon's lack of STAB means it will not significantly damage Wigglytuff, even with Spikes on the field. Wigglytuff, meanwhile, can set up with Curse in its face, easily boosting quickly, breaking past Porygon, and potentially KOing even more Pokemon. However, Double-Edge and Return variants of Wigglytuff stalemate with Curse Porygon, though Body Slam variants can paralyze Porygon and break past it. Wigglytuff does not enjoy Thief Porygon stealing its Leftovers, though Thief also means Porygon will not be carrying Thunder Wave, and will have a more difficult time switching into battle if it has not used Thief yet. Wigglytuff can also be frozen by Ice Beam, though this is highly unreliable, and Wigglytuff will likely be asleep for a notable portion of the time it is in battle, preventing Ice Beam from freezing.</p> <p><strong>Ninetales</strong>: Ninetales with Toxic basically counters Porygon, easily walling BoltBeam variants with its massive Special Defense and lack of weakness to Electric or Ice, and it can essentially reduce Porygon to fodder with poison. Curse Porygon is not walled by Ninetales but hates poison so much that it is still deathly afraid of Ninetales. Ninetales also always carries Rest and commonly Sleep Talk to prevent Thunder Wave paralysis, and if it doesn't pack Sleep Talk, then it will be running Roar, which prevents Curse Porygon from even setting up in the first place. However, Ninetales without Toxic is walled by Porygon, though it still walls BoltBeam variants of Porygon back.</p> <p><strong>Magnemite</strong>: Magnemite is not weak to any of Thunder, Ice Beam, or Double-Edge and usually runs Thunder, which, if it lands, has a 30% chance to effectively end Porygon on the spot with paralysis. Magnemite also almost always uses Rest and Sleep Talk to heal off paralysis and remain an incredibly dangerous threat while sleeping, and Porygon giving it entry is not ideal. However, Magnemite despises Thief stealing its Leftovers because, with Spikes on the field and no passive healing, it is much more liable to being 3HKOed by Xatu and Fearow on the switch. Thus, it can fail to have any defensive value. While Magnemite can heal off paralysis with Rest, it still does not like being paralyzed; if it is at high health, it will likely have little reason to use Rest and thus can be susceptible to full paralysis, and also it will become slower than everything.</p> <p><strong>Fighting-type Attacks</strong>: Primeape and Hitmonlee come close to a flat-out OHKO on Porygon with their STAB attacks, and any minor chip damage, usually from Spikes, will push them over the line. They are not weak to either Thunder or Ice Beam, so RestTalk Hitmonlee hard walls BoltBeam Porygon, while Primeape can come in on a usage of Ice Beam or Recover and proceed to set up a free Substitute, blocking Thunder Wave and preventing the Porygon user from effectively switching around predicted moves. Primeape also occasionally runs RestTalk itself, which also lets it wall BoltBeam Porygon. It can even just critically hit right through any Defense boosts from Curse Porygon, as Cross Chop has a boosted critical hit rate of 25%. However, non-RestTalk Primeape despises Thunder Wave, and Hitmonlee does not enjoy paralysis before it uses Rest. Primeape using Cross Chop can also be exploited with a free switch to Xatu or Weezing, and Primeape may even eventually run out of its 8 PP; Cross Chop also has a 20% chance to miss, and both Primeape and Hitmonlee are 2HKOed by a Curse-boosted Double-Edge; they also cannot OHKO Porygon back if it is healthy. Additionally, while not a Fighting-type itself, Magmar has a high Attack stat and access to Cross Chop, which is a guaranteed OHKO on Porygon if it scores a critical hit, a 20% chance after accuracy; however, this is very risky for the Magmar user, as Magmar hates being paralyzed, and Cross Chop can easily miss or not land a critical hit.</p> <p><strong>Pineco</strong>: Pineco can switch into Porygon on a use of Recover, Ice Beam, or Curse, proceed to easily use Spikes, and then either poison Porygon with Toxic or eliminate it outright with Explosion. However, Thunder can 2HKO Pineco with even the slightest amount of chip, usually coming from Spikes. If Pineco is paralyzed by Thunder Wave or Thunder as it switches in, the Porygon user can switch to their own Pineco and proceed to spam Rapid Spin until the opponent's Pineco is fully paralyzed. Pineco then can freely use Spikes, proceed to use Rapid Spin until another full paralysis occurs or Toxic is used, then use Explosion and win the Spikes war by a mile.</p> <p><strong>Weezing</strong>: Weezing is faster than Porygon and does not take significant damage from Double-Edge or Thunder, in return fishing for poison from Sludge Bomb while doing solid damage or outright taking out Porygon with Explosion. However, Weezing taking Thunder Wave or having its Leftovers stolen by Thief, prefers to stay healthy to take hits from faster threats like Fearow and Primeape, and has defensive responsibilities beyond handling Porygon; using Explosion means sacrificing Weezing just to eliminate Porygon, which can leave its team vulnerable to Primeape if Porygon chooses to partner with it.</p> <p><strong>Rock-types</strong>: Sudowoodo can use Curse in front of Porygon, as it resists Double-Edge, is not weak to Thunder or Ice Beam, and has plenty of bulk. However, Sudowoodo does not enjoy taking Thunder Wave or having its Leftovers taken by Thief, and has to resort to sacrificing itself with Self-Destruct to take out Curse Porygon, as otherwise it won't do enough back to Porygon and will slowly get whittled down by Double-Edge and full paralysis turns. Even RestTalk Sudowoodo has to try and PP stall Porygon, which can even just result in Sudowoodo getting PP stalled itself. Graveler and Pupitar are immune to Thunder Wave, but Graveler cannot break past Porygon without well-timed critical hits or using Explosion on it due to being slower. Pupitar, meanwhile, is not 2HKOed by Ice Beam from full health, can easily break past Curse Porygon with Screech, and is faster; however, it cannot serve as an effective switch-in to Porygon with Ice Beam, unless it is comfortable trading most of its health to take a large chunk out of Porygon, though Porygon still might be able to heal off any damage later.</p>",
    "sets": {
      "BoltBeam": {
        "description": "<h1>Set Description</h1> <p>Thunder and Ice Beam are the best combination of special attacks to hit the highest number of common Pokemon for super effective damage, such as Xatu, Octillery, Dugtrio, Dewgong, Fearow, and Pupitar. Thunder Wave significantly reduces what can safely switch into and take advantage of Porygon, crippling targets like Magmar, Kingler, Flareon, Weezing, Stantler, and Primeape that lack RestTalk. Thunder Wave also is generally a great move to use into basically anything, as actually outspeeding foes allows Porygon to use its moves much more safely; the same speed control works great to support slow but powerful teammates, namely Kingler, Curse Stantler, Primeape, and Magmar, which appreciate threats like Xatu, Fearow, and Weezing being slowed down and potentially fully paralyzed. This particular Porygon set is a great threat to many Xatu + Dugtrio Spikes teams—one of the most common and dominant team structures in the tier—as the only Pokemon commonly used on them that can handle BoltBeam Porygon without being ruined by Thunder Wave is Wigglytuff, which is still not on a majority of them. Still, this potential to face Wigglytuff is the main reason why Thief is a good consideration; Wigglytuff's ability to take hits is significantly reduced without Leftovers, especially with Spikes on the field. Also, Porygon has good enough Special Attack and super effective coverage to gradually chip down threats that can answer a Porygon that lacks Thunder Wave, like Weezing, over the course of a game, which are also further being chipped by Spikes. However, Thief of course leaves Porygon without the all-round amazing utility of Thunder Wave, meaning it has to try and fish for paralysis with Thunder, a mere 21% chance factoring in accuracy; Thief can also only steal one item, and not having Leftovers when first attempting to switch in, especially with Spikes on the field, can make finding entry for Porygon more difficult.</p> <h1>Team Options</h1> <p>Weezing is the best partner for Porygon, appreciating Porygon's prowess in checking Xatu and Dugtrio while taking on Primeape and Hitmonlee itself, and it can use Explosion to eliminate a Wigglytuff or Ninetales that walls Porygon. Pineco is also a prime teammate for Porygon, as its Spikes wears down walls like Wigglytuff and Ninetales, which Porygon struggles with. Fearow and Xatu help to check Primeape, Hitmonlee, Gloom, and RestTalk Stantler while appreciating Porygon's ability to take on Dewgong and Graveler; Porygon can also steal the Leftovers from Wigglytuff or Sudowoodo, which helps Fearow and Xatu wallbreak. Rock-types like Sudowoodo and Graveler serve as effective answers to Pineco, Wigglytuff, and Weezing—bar if Weezing has Hidden Power Water—which can take advantage of Porygon, and Porygon can handle Dewgong and—if at high health—Octillery for them. Graveler also clears away Spikes with Rapid Spin, making entry for Porygon easier. Octillery itself is a great ally for Porygon, stopping Ninetales and Sudowoodo in their tracks, and Octillery and Porygon can help each other in checking Xatu, other Octillery, and Ground-types like Dugtrio and Graveler so that neither gets overwhelmed too quickly. Good wincons that take advantage of paralysis, such as Kingler, Curse + Light Screen Stantler, and Primeape, like having Thunder Wave Porygon around to facilitate setup and check Xatu. Thunder Wave also makes setup easier for Wigglytuff, as does Porygon checking Sudowoodo and Graveler for it, and Wigglytuff can answer Chinchou, unlike Porygon, which is afraid of Thunder paralysis. Ninetales also has great synergy with Porygon, as Porygon can switch into and threaten out Octillery, Dewgong, and Graveler, while Ninetales walls Weezing and is a great answer to Magnemite. Gloom also works well with Porygon, halting Primeape, Hitmonlee, Chinchou, and Octillery that lack Ice Beam, while Porygon can switch into Xatu and Dewgong for Gloom; the two also combine to form a potentially overwhelming, paralysis-spamming core, with Gloom having Stun Spore and Porygon having Thunder Wave.</p>"
      },
      "Curse": {
        "description": "<h1>Set Description</h1> <p>Curse Porygon may appear outclassed by other Curse Normal-types, mainly Wigglytuff and the rare Dunsparce, especially since they also have access to paralysis moves—Thunder Wave or Body Slam and Glare, respectively. Porygon often gets overshadowed by Wigglytuff, but it makes up for this in waves by having Recover, allowing it to find setup and switch-in opportunities far more easily; Recover only using one moveslot also means Porygon can fit both recovery and the valuable paralysis spreading of Thunder Wave, whereas Wigglytuff and Dunsparce solely miss Sleep Talk if using a paralysis move, as their best self-healing move is Rest—the exception being Body Slam Wigglytuff, which retains Sleep Talk but can't spread paralysis as reliably. Porygon also differentiates itself from these two by being able to actively switch into Sudowoodo and Graveler, boosting up with Curse and and using Recover to stay healthy, forcing them to use Self-Destruct or Explosion, respectively, to take Porygon out. The combination of Curse, Thunder Wave, and Recover is so notable because Thunder Wave means Porygon will outspeed foes despite lowering its own Speed with Curse, and any full paralysis will be a free turn where Porygon does not have to use Recover, letting it continue powering up with Curse or just launch a boosted Double-Edge. The recoil of Double-Edge is a negligible drawback compared to Return's lower power due to Recover, and Porygon needs as much power as it can get with such a low Attack stat. Curse also importantly makes Porygon a decent switch-in to Stantler if at full health, avoiding a 2HKO even with Spikes up and paralyzing Stantler with Thunder Wave, proceeding to boost up with Curse and beat Stantler. RestTalk Stantler cannot match Porygon's boosts and can just give Porygon ample setup opportunity while Curse + Light Screen Stantler hates being paralyzed.</p> <h1>Team Options</h1> <p>Solid teammates for Curse Porygon are Weezing, Xatu, and Fearow, which can all take on Primeape and Hitmonlee; Octillery shuts down Ninetales and Sudowoodo; Sudowoodo and especially Graveler help prevent Pineco, Wigglytuff, and Weezing from using Porygon to set up or launch attacks; Ninetales stops Weezing and Magnemite. Pokemon that enjoy Porygon's paralysis Xatu-checking capabilities, like Kingler and Primeape, make for good partners as well. Fearow, RestTalk Persian, Fire Blast Weezing, and Sunny Day Ninetales get a special mention as teammates, as they appreciate Porygon's ability to force Sudowoodo and Graveler to sacrifice themselves to beat it.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "BeeOrSomething", "user_id": 583728}], "teams": [{"name": "Quality checked by", "members": [{"username": "MrSoup", "user_id": 375193}, {"username": "juoean", "user_id": 486979}]}, {"name": "Grammar checked by", "members": [{"username": "Rose", "user_id": 511181}, {"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Dragonair": {
    "sets": {
      "Offensive Paralysis Spreader": {
        "description": "<p>Dragonair has a very unique place in GSC NU by virtue of its excellent movepool and completely exclusive Dragon typing. Its coverage is among the best in the tier, which allows it to punish teams that lack bulky Normal-types and spread paralysis to a variety of foes. Its Dragon typing also gives it useful resistances to Fire, Water, and Electric, letting it take on key metagame threats such as Rapidash, Magmar, and Magnemite. Dragonair works quite well as a lead, taking on Rapidash leads and spreading paralysis early in the game, while its coverage lets it act as an anti-lead against Pokemon like Pineco. Access to Light Screen and Reflect can also be useful for teams with setup Pokemon such as Farfetch'd and Lickitung. Unfortunately, Dragonair is not very bulky, so any strong attacker that can hit it neutrally can 3HKO it. Its low Special Attack also means that it struggles to break past foes that aren't weak to its coverage moves, such as Wigglytuff and Lickitung, and as such foes commonly use Rest, they aren't as afraid of Thunder Wave. While Dragonair resists Thunder from Pokemon like Chinchou and Magnemite, it doesn’t appreciate Thunder paralysis, and its lack of recovery leaves it susceptible to Toxic and being worn down by Spikes.</p> <p>Thunder Wave is very useful for crippling faster Pokemon such as Stantler and supporting slower teammates, while Thunderbolt or Thunder is useful for hitting Pokemon like Xatu, Kingler, Dewgong, and Octillery. The choice between Thunderbolt and Thunder comes down to consistency versus power. Surf hits Graveler, Pupitar, Dugtrio, and Fire-types quite hard, and Fire Blast hits Pineco, Magnemite, and Gloom. Thunder Wave in the first slot and Thunder in the last slot is the standard, but if not running Thunder Wave then one of Light Screen or Reflect is an option in the last slot. Screens support is very useful for powerful setup Pokemon such as Farfetch'd, Kingler, and Curse Stantler, as they lack the bulk to take strong hits otherwise.</p> <p>Dragonair fits quite well on offensive teams, especially those with slower wallbreakers such as Lickitung, Flareon, Graveler, and Kingler that appreciate paralysis support. Baton Pass teams highly appreciate Dragonair's excellent supporting capabilities with Light Screen, Reflect, and Thunder Wave, so it commonly appears on those teams. Another good way of using Dragonair is as a Growth pass recipient due to its excellent coverage and unique resistances, meaning Flareon is a good partner. Chinchou is a good partner for Dragonair, as Dragonair can struggle against Water-types such as Dewgong and Ice Beam Octillery, even if running Thunder. Hitmonlee and Primeape are good partners, as they threaten bulkier Normal-types that Dragonair struggles against such as Wigglytuff and Lickitung. Dragonair can also paralyze Gloom and Weezing to help the Fighting-types have a better shot getting past their checks.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "dawnbuster", "user_id": 508601}], "teams": [{"name": "Quality checked by", "members": [{"username": "cherryb0ng", "user_id": 421511}, {"username": "Earthworm", "user_id": 15210}]}, {"name": "Grammar checked by", "members": [{"username": "Muk", "user_id": 33374}]}]}
  },
  "Chinchou": {
    "sets": {
      "Chinchou Gang! (RestTalk)": {
        "description": "<p>As one of the few Electric-types in the tier, Chinchou holds an incredible niche as one of the best anti-metagame Pokemon. Thanks to its typing, Chinchou is a mainstay on defensive teams and is able to check many top metagame threats, including Dewgong, Rapidash, Ninetales, and Octillery. Chinchou's decent Special Defense and lack of a weakness to Ice or Electric alongside its resistance to Water give it enviable role compression and allow it to check Water-types that are otherwise nearly impossible to wall reliably. Because of this, Chinchou is easily one of the most splashable Pokemon in the GSC NU tier. On top of this, Chinchou's dual STAB attacks pair very well together, as Thunder smacks the common Water-types in the tier and threatens even Pokemon that resist it with paralysis, while its Water-type STAB options hit Ground-, Fire-, and Rock-types for heavy damage, although Grass-types as well as the semi-uncommon Dragonair resist both of Chinchou's STAB moves. Chinchou is also deceptively fast, outspeeding nearly all of the relevant Rock- and Ground-types that threaten it with Earthquake, bar Dugtrio. Rest and Sleep Talk give Chinchou good longevity and let it absorb Hypnosis from the likes of Rapidash and Persian. However, its low overall stats are a huge hindrance, as most physical attackers easily 2HKO Chinchou and it doesn't hit very hard against non-super effective targets.</p> <p>Chinchou's role of dominating bulky Water- and Fire-types greatly helps Pokemon that struggle with said threats; many top-tier offensive Pokemon such as Dugtrio, Xatu, and Fearow struggle to break past Dewgong in particular, so they greatly benefit from Chinchou's ability to wall and threaten it. Chinchou also greatly appreciates being paired with physically bulky Pokemon such as Weezing and Azumarill, since they can reliably switch into the common physical attackers that scare out Chinchou. Xatu is also one of Chinchou's best partners, since they can beat each other's checks—Xatu dominates the Grass-types such as Gloom that wall Chinchou, while Chinchou dominates Xatu's best check in Dewgong.</p>"
      },
      "Support": {"description": "<p>With access to the rare Thunder Wave as well as Light Screen, Chinchou should not be underestimated as a supporter. This set fits more so on Baton Pass and hyper offense teams, since Chinchou gives its teammates a temporary yet reliable switch into most special attackers and supports them well with paralysis and Light Screen. Without the obligation of devoting two moveslots to Rest and Sleep Talk, Chinchou also has room to run Ice Beam over one of its support moves to prevent itself from being walled by Grass-types such as Gloom. However, without the longevity provided by RestTalk, it cannot fight Fire-types as effectively in the long term.</p>"}
    },
    "credits": {"writtenBy": [{"username": "dawnbuster", "user_id": 508601}], "teams": [{"name": "Quality checked by", "members": [{"username": "Earthworm", "user_id": 15210}, {"username": "cherryb0ng", "user_id": 421511}]}, {"name": "Grammar checked by", "members": [{"username": "deetah", "user_id": 297659}]}]}
  },
  "Xatu": {
    "sets": {
      "King Xatu (RestTalk)": {
        "description": "<p>Xatu is the most dominant Pokemon in GSC NU, and it fits on almost every single team. With two of the highest Special Attack and Speed stats in the tier combined with a great STAB attack in Psychic, Xatu is the single most dangerous special attacker in the tier and can be difficult to switch into for weakened teams. Xatu is a great check to several of the best Pokemon in the tier, notably Primeape, Hitmonlee, and Kingler. It also takes advantage of Spikes, which makes it even more difficult to switch into and turns certain 4HKOs on Pokemon like Magmar and Lickitung into potential 3HKOs. Xatu's immunity to Spikes is also a big benefit that makes it tougher to wear down. RestTalk is a fantastic set for Xatu, since it lets it absorb status and stick around for the late-game, where it often acts as a cleaner. Psychic is a mandatory STAB move that hits a lot of the tier for good damage and can nab a lucky Special Defense drop on a foe like Dewgong, which makes it easier to pressure. Xatu's chosen coverage move is often team-dependent. Drill Peck is generally the most common and reliable, since it acts as a secondary STAB move and guarantees that Sleep Talk will call upon a useful move against Pokemon like Primeape. Even though Hidden Power Electric lowers Xatu's bulk slightly, it hits opposing Xatu the hardest, which gives it an edge in those matchups, as well as putting pressure on Dewgong switching in with Spikes down. Lastly, Night Shade is generally a reliable source of damage, but its main role is to shred through the incredibly bulky Shuckle, which some teams don't have a reliable way of breaking through.</p> <p>Xatu partners well offensively and defensively with several Pokemon. Xatu's arguable best partner is Chinchou, which can beat several of the best checks to it, such as Dewgong, Magmar, and Ninetales; in return Xatu can check most of the physical attackers that scare out Chinchou, such as Hitmonlee. Pineco is an important partner for Xatu, since it sets up the Spikes that Xatu takes advantage of and can somewhat check one of Xatu's best checks in Dugtrio. Primeape forms a fierce offensive combo with Xatu, wearing down the opponent's offensive core by beating each other's checks, such as Weezing for Primeape and Dewgong for Xatu. Xatu is one of the best Baton Pass recipients in the tier; most notably, Growth passes from Flareon turn Xatu into a near-unwallable menace. Bulky Water-types such as Dewgong and Azumarill are often the best ways to check Xatu, since they can stall it out despite fearing Special Defense drops, so Pokemon such as Chinchou and Hitmonlee that can beat them are often good partners. Magnemite and Sneasel are resistant or immune to Xatu's Psychic and can hit it hard with their respective STAB attacks; however, Sneasel cannot check Xatu effectively at all if it is paralyzed, since that way it is forced into burning Moonlight's PP much more quickly. Both of these Xatu checks are weak to Fighting and Fire, so Hitmonlee, Ninetales, and Primeape are useful teammates to threaten them with.</p>"
      },
      "Utility": {"description": "<p>Xatu can play the supporting role well with access to the rare Haze, which lets it effectively stop Baton Passers and setup sweepers such as Ledian, Farfetch'd, Kingler, and Lickitung. Xatu is also able to fit Thief on this set, which can really help out its offensive teammates if Xatu steals an item like Dewgong's Leftovers. Xatu can also run Rest and Mint Berry on the same set, which gives Xatu a chance to heal off all damage and status and also lets it use Thief after using the Mint Berry. This Xatu set does a bit better against bulkier teams when paired with other users of Thief and Spikes, which puts pressure on common bulky Pokemon such as Azumarill, Dewgong, and Ninetales.</p>"}
    },
    "credits": {"writtenBy": [{"username": "dawnbuster", "user_id": 508601}], "teams": [{"name": "Quality checked by", "members": [{"username": "Earthworm", "user_id": 15210}, {"username": "cherryb0ng", "user_id": 421511}]}, {"name": "Grammar checked by", "members": [{"username": "deetah", "user_id": 297659}]}]}
  },
  "Sudowoodo": {
    "sets": {
      "Offensive": {
        "description": "<p>As the only Rock-type without a secondary type in the metagame, Sudowoodo is one of the few Pokemon in GSC NU to resist Normal and not have a major exploitable weakness. This means that, unlike Curse Graveler, it is somewhat difficult to immediately force out. Its resistance to Normal and high Defense are very valuable in a metagame with numerous viable Normal-types, such as Wigglytuff, Fearow, and Lickitung, and common Explosion users such as Weezing and Pineco. Its high Attack and STAB Rock Slide allow it to threaten Xatu and common Fire-types with a 2HKO while avoiding a 2HKO in return. Earthquake provides essential coverage to target Pokemon that resist Rock, such as Primeape and Dugtrio, as well as Pokemon weak to Ground, such as Weezing, Chinchou, and Magnemite. Self-Destruct allows Sudowoodo to take something down with it once its defensive role is no longer required. This can let it take down big threats such as Primeape or crucial defensive pieces such as Gloom and Azumarill. Furthermore, a Normal-type with Curse boosts seeking to PP stall Sudowoodo will typically be unable to survive a 999 Attack Self-Destruct after some slight chip damage from Rock Slide, so Sudowoodo can act as a reliable answer to these, even without Rest.</p> <p>Sudowoodo can be a useful teammate to virtually any team thanks to its fantastic set of resistances. In addition to providing an essential resistance to Normal, Sudowoodo also makes for a great recipient of Speed and Attack boosts from Baton Passers such as Ledian and Farfetch'd since it has great coverage and can take at least one hit from almost anything. Sudowoodo has a hard time against bulky Water-types such as Octillery and Azumarill, so it is a good idea to pair it with at least one Pokemon that fares well against these, such as Chinchou. Self-Destruct can be used to pave the way for a teammate such as Magmar, which can struggle against these Water-types. Magmar and other Fire-types can also help Sudowoodo against Grass-types such as Exeggcute. Normal-types, which tend to invite Pineco in due to its high Defense, also greatly appreciate Sudowoodo's presence as a Pokemon that remains relatively healthy after taking a telegraphed Explosion, which can otherwise be difficult to handle in the absence of low health Pokemon to use as fodder.</p>"
      },
      "Defensive": {
        "description": "<p>Sudowoodo with Self-Destruct is often vulnerable to status and can struggle to deal with Curse Normal-types without blowing itself up. Furthermore, the Fire- and Poison-types Sudowoodo should be checking can sometimes run coverage moves that force it to use Self-Destruct earlier than it would like. This set attempts to remedy these vulnerabilities by using Rest to give Sudowoodo some longevity. Curse is a good option to ensure that Sudowoodo cannot be beaten by Curse Normal-types, but it comes at the expense of either Earthquake, which Sudowoodo needs to avoid being fodder for Primeape, or Sleep Talk, which is important to maximize both its offensive and defensive presence while it is asleep. If it is running Sleep Talk, Sudowoodo also performs excellently as an answer to Rapidash and Ninetales, which have access to Hypnosis.</p> <p>As Rest Sudowoodo inevitably sacrifices one of Curse, Earthquake, or Sleep Talk, it is highly likely to become setup fodder at some point in a game. Thus, reliable defensive measures, such as Haze Xatu and Gloom, are important to ensure that opposing setup sweepers are kept in check. As usual, it is also highly recommended to use suitable answers to Water-types, as they will easily force Sudowoodo out otherwise. Some such answers include Hitmonlee, Gloom, and Dewgong.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Earthworm", "user_id": 15210}], "teams": [{"name": "Quality checked by", "members": [{"username": "dawnbuster", "user_id": 508601}, {"username": "FNH", "user_id": 245982}]}, {"name": "Grammar checked by", "members": [{"username": "deetah", "user_id": 297659}]}]}
  },
  "Pineco": {
    "sets": {
      "Entry Hazard Setter": {
        "description": "<p>Pineco is the premier Spikes setter in GSC NU, a massively game changing asset that defines the ability to make progress and punish switches. While running Pineco may feel like playing 5 Pokemon against 6 at times, the advantage that Spikes brings is unparalleled and makes Pineco a Pokemon highly recommended for use on most teams, and this impact is typically lessened by the presence of Pineco on both sides.</p> <p>Pineco has the ability to compress Rapid Spin support into its own movepool. This should not be Pineco's priority in most matches compared to setting up Spikes, but is an option it can use if given a free turn. Explosion is a fantastic tool that lets Pineco apply pressure when given a free opportunity, prevent itself from being set up fodder to Substitute users like Dugtrio and Primeape, and threaten weakened Curse sweepers like Wigglytuff. Toxic is the go to 4th move on Pineco to put pressure on opposing Pineco and stop it from switching in and either forcing a mutually negative draw or an Explosion speed tie attempt, and also lets Pineco apply meaningful pressure to a range of switch-ins still like Xatu and Rapidash to force them to use Rest later. Reflect is an option to instead ease switch-ins against aforementioned Pokemon such as Dugtrio and Primeape without having to use Explosion. Hidden Powater Water is another option to make Pineco harder to spinblock for Graveler, although it will still be forced out in the short term and Pineco struggles to find more set up opportunities often.</p> <p>Pineco's item choice depends on its position in a team. Leftovers is the standard item to give it more longevity and lets it switch into Pokemon like Stantler slightly easier. Miracle Berry is a solid option in the lead slot, however, as it lets Pineco avoid being slept by lead Stantler and Persian carying Hypnosis, so that it can easily set up Spikes and threaten an Explosion. When not run in the lead slot, Pineco finds its opportunities to switch in typically against Pokemon such as Dugtrio, Stantler, and Wigglytuff, as well as the more uncommon passive Pokemon such as Porygon and Gloom. Pineco must be careful about getting too greedy with trying to Rapid Spin against Wigglytuff too if not paired with a counter such as Sudowoodo, however, as it will give it enough Curse boosts to easily negate Explosion, the same can happen when Pineco gets Paralysed trying to switch into Body Slam.</p> <p>Pineco is a near mandatory fit on all non-stall teams due to the influence Spikes have over GSC NU. Pineco intrinsically pairs best with offensive Pokemon that appreciate having their switch-ins worn down. Xatu and Fearow are a prime example of this, as their checks such as Chinchou, Octillery, Dewgong, and Weezing find it harder to reliably switch in constantly. Other Pokemon such as Fearow and Octillery also appreciate having checks such as Dewgong and Chinchou worn down more. Dugtrio also appreciates Spikes wearing down Octillery and Dewgong and can set up on Rapidash and Ninetales that try to take Pineco out. More defensively orientated offensive threats such as Dewgong, Rapidash, and Magnemite can still make full use of Spikes to become less easily answered by Pokemon such as Octillery and Dugtrio, and can find lots of opportunities to wear down these Pokemon with their ability to check POkemon such as Xatu. Graveler is a unique teammate that can pair very well with Pineco on specific teams, as it ensures that one team has an enormous advantage in the hazards matchup by removing Spikes on Graveler's side while ensuring Spikes on the other. This is a potent advantage but Graveler can force more specific team structures in the process by stacking weaknesses to Pokemon like Xatu and Octillery, but in return provides one of the best Fearow answers. Sweepers such as Stantler and Wigglytuff appreciate the Spikes support to better break through checks like Weezing and Octillery.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Estarossa", "user_id": 461329}], "teams": []}
  },
  "Dunsparce": {
    "sets": {"RestTalk": {"description": "<p>Dunsparce's good stats make it an individually solid Pokemon, but despite this, it is almost never worth using. Dunsparce serves the same role as Wigglytuff, yet it is wholly outclassed by it. Dunsparce lacks Body Slam and Double-Edge, forcing it to use Return, which has neither the paralysis chance of Body Slam nor the power of Double-Edge. Dunsparce also has marginally lower Special Defense, which makes its matchup against Octillery worse. Dunsparce does have slightly better Defense, which makes handling Fearow and Stantler easier before using Curse, but the difference is largely negligible. If used, a Curse set with RestTalk will be the most consistent way to get value out of Dunsparce, providing a win condition and a check to Chinchou, Dewgong, and Xatu.</p>"}},
    "credits": {"writtenBy": [{"username": "BeeOrSomething", "user_id": 583728}], "teams": [{"name": "Quality checked by", "members": [{"username": "dawnbuster", "user_id": 508601}]}, {"name": "Grammar checked by", "members": [{"username": "StupidFlandrs48", "user_id": 633500}, {"username": "Tbolt", "user_id": 555379}]}]}
  },
  "Shuckle": {
    "sets": {
      "Rollout": {
        "description": "<p>Shuckle is by far the bulkiest Pokemon available in GSC NU and offers its team a crucial resistance to Normal. Its amazing defenses allow it to act as an answer to virtually any Pokemon that can't boost or hit it super effectively, including major threats like Xatu, Fearow, Weezing, and Stantler. With Defense Curl-boosted Rollout, it can also pose a legitimate threat despite its abysmal Attack. As Rollout locks Shuckle in and prevents it from switching out, it is important to make sure that foes are unable to take it down with STAB Water attacks, so Toxic can be used to force a situation where the foe will need to use Rest or switch out, which can allow Shuckle the opportunity to get rolling. Defense Curl is chosen over Curse because of its high PP count, which allows Shuckle to reliably PP stall Normal-type foes without having to lock itself into Rollout.</p> <p>One should not bring in Shuckle expecting to be able to immediately sweep, however. Almost all teams have significant threats to it, and in the absence of a measure to eliminate them, Water-types such as Octillery and Dewgong with Rest will be a major long-term pain for Shuckle. Indeed, in some circumstances, Shuckle should expect never to be able to sweep. Nevertheless, Shuckle is exceptionally good at taking attacks for the purpose of PP stalling. To allow it to do this for as long as possible, having a spinner is very helpful, and Spikes will also help Shuckle's team by preventing foes from simply switching to conserve PP. Therefore, Pineco is an excellent partner, and it can even use Explosion to remove Water-types. Rock-types such as Sudowoodo, Graveler, and Pupitar pose a threat to Shuckle with their STAB Rock attacks, especially if they have Curse to boost their Attack. Additionally, Fire-types with Sunny Day or Growth, such as Magmar and Flareon, can boost the power of Fire Blast to a level that can 3HKO Shuckle. To address these threats, it is crucial to pair Shuckle with a Water-type; some examples of good choices include Octillery, Azumarill, and Chinchou. When paired with Reflect and Light Screen users such as Pineco and Azumarill, it should be noted that a Shuckle with maximum defensive stats will have its defenses roll over behind screens, leaving it incredibly vulnerable. Ninetales is useful as a teammate for dealing with Fire-types, and it can also deal with powerful special attackers such as Xatu and Magnemite decently if Shuckle is not in a position to do so. Fighting-types with Meditate such as Primeape and Hitmonlee threaten Shuckle if they catch it at a lower health point without Defense boosts. Pokemon that resist Fighting, such as Xatu, Gloom, Exeggcute, Weezing, and Arbok, make for useful partners to deal with these threats.</p>"
      },
      "Defensive Pivot": {
        "description": "<p>With this set, Shuckle is able to generate opportunities for teammates by locking foes into moves with Encore and spreading poison with Toxic. It retains its ability to switch into a wide variety of threats, and it can better deal with certain foes that set up boosts, such as Kingler and Primeape, thanks to Encore, although it still isn't entirely safe from them. Rest and Sleep Talk allow Shuckle to continue to dissuade foes from setting up or taking advantage of it, with minimal downtime.</p> <p>Water-types such as Octillery and Chinchou are crucial teammates for Shuckle, as they can handle the majority of foes that threaten it, including Octillery, Sudowoodo, and Sunny Day Magmar. It is important to control entry hazards as much as possible when using this set to prevent the opponent from switching to stop Shuckle from being effective. Teammates that work best when they have free turns, such as Kingler, Primeape, Flareon, Magnemite, and Graveler, make for good partners for Encore Shuckle.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Earthworm", "user_id": 15210}], "teams": [{"name": "Quality checked by", "members": [{"username": "dawnbuster", "user_id": 508601}, {"username": "cherryb0ng", "user_id": 421511}]}, {"name": "Grammar checked by", "members": [{"username": "Muk", "user_id": 33374}]}]}
  },
  "Sneasel": {
    "sets": {
      "Defensive": {
        "description": "<p>Sneasel holds two incredibly valuable defensive niches in GSC NU—it is one of the few Pokemon with instant recovery in the tier, and it is one of the only three Dark-types. The latter grants it a valuable immunity to the main STAB move of the best Pokemon in the tier, Xatu, although Sneasel should still watch for Drill Peck. Sneasel fits very well on Spikes teams thanks to Toxic forcing numerous switches; this compounding chip damage is complemented by Sneasel's incredible Speed, being tied for the second highest in the tier behind Dugtrio, and decent Attack stat, which lets it revenge kill a lot of low health dangerous sweepers such as Primeape. Sneasel fares well against the numerous RestTalk users in the tier such as Dewgong, Xatu, Chinchou, and Azumarill thanks to its decent Special Defense, and Nightmare if it chooses to run a more offensive set. However, Sneasel is quite frail on the physical side, which means almost every physical attacker can 3HKO or 2HKO it. Sneasel is also almost worthless if it is paralyzed, since it is forced to burn through Moonlight's 8 PP much more quickly and loses its ability to outspeed anything. Return is Sneasel's most reliable source of damage, although it lacks STAB. Moonlight is Sneasel's most valuable tool, giving it excellent longevity, and Sneasel has plenty of opportunities to regain HP thanks to its Speed. Toxic is used to cripple Fire- or Fighting-types that lack Rest and tend to switch into Sneasel, such as Magmar and Primeape. Moonlight and Toxic in particular pair very well on Sneasel, since it can use Moonlight until the opposition is worn down due to Toxic. For Sneasel's last move, Dynamic Punch lets Sneasel 3HKO Rock-types and 2HKO the dangerous Magnemite. Alternatively, Thief fits well on Sneasel, since a lot of Pokemon that Sneasel lures in, such as Weezing and Primeape, greatly dislike having their Leftovers stolen.</p> <p>Pokemon that struggle with Xatu and to a lesser extent, Dewgong, are often the best partners for Sneasel. Weezing in particular pairs incredibly well with it, resisting Fighting and having incredible physical bulk to sponge physical attackers that threaten Sneasel. Fighting-types such as Primeape, Hitmonlee, and Hitmonchan synergize well with Sneasel, as Sneasel checks their worst enemy in Xatu. Pineco and its Spikes are excellent support for Sneasel since Toxic very often forces switches; in return, Pineco with Reflect checks Dugtrio and Primeape. With Sneasel's weakness to Fire-types, it appreciates teammates that check Fire-types well, such as Dewgong, Azumarill, and Ninetales.</p>"
      },
      "Offensive Nightmare": {"description": "<p>This set fits well on more offensive teams, since they sometimes lack a reliable switch-in to Xatu. Sneasel can Toxic a foe such as Dewgong or Azumarill, forcing them to use Rest, which enables Sneasel to heavily pressure them with Nighmare while chipping them even further with Return. Moonlight gives Sneasel greater longevity, and works well due to Sneasel taking heavy damage from most RestTalk users that it checks. Primeape pairs well with this Sneasel variant, since Sneasel forcing foes to use Rest gives it a chance to switch in. Offensive teams also sometimes lack Pokemon that can break through Dewgong, which Sneasel does very well.</p>"}
    },
    "credits": {"writtenBy": [{"username": "dawnbuster", "user_id": 508601}], "teams": [{"name": "Quality checked by", "members": [{"username": "Earthworm", "user_id": 15210}, {"username": "Sevi 7", "user_id": 505149}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Octillery": {
    "overview": "<p>Boasting the highest Special Attack stat in the tier, a fantastic typing of pure Water, STAB Surf that hits several common Pokemon such as Dugtrio, Ninetales, Graveler, and Rapidash for super effective damage while 3HKOing most neutral targets; RestTalk for longevity; and the complementary coverage of Hidden Power Electric or Ice Beam, Octillery makes for a phenomenal choice on many teams. However, while Octillery is amazing, it is not flawless. Octillery is quite slow, being outsped by most offensive threats such as Weezing, Stantler, and Xatu. Additionally, while Octillery is generally bulky enough to handle Pokemon it needs to with RestTalk such as Rapidash and Dugtrio, it can be 3HKOed by strong unresisted STAB moves such as Stantler’s Frustration and Fearow's Double-Edge or a sufficiently strong coverage move, and it can very easily be pushed into 3HKO range of attacks such as Xatu's Psychic by the ubiquitous Spikes. Octillery also has issues with coverage, as with Ice Beam, it is walled by opposing Octillery and Dewgong, while with Hidden Power Electric, it cannot touch Grass-types like Gloom and Exeggcute. Octillery also suffers minor competition with Dewgong, which in exchange for a much weaker Surf, the inability to effectively utilize Hidden Power Electric, and weaknesses to Rock and Fighting along with a lack of a resistance to Fire, provides much more speed and bulk than Octillery and a stronger Ice Beam, resulting in a a significantly superior matchup into Xatu and Fearow. Dewgong also has access to Encore, providing an additional niche that Octillery doesn’t have. However, Octillery's greater power, which lets it 3HKO Stantler and sometimes Wigglytuff, and its better/more practical defensive utility and pure Water typing making it a much better check to Magmar, Sudowoodo, and Sunny Day Ninetales often make it the superior choice on teams.</p>",
    "comments": "<h1>Other Options</h1> <p>Octillery can use Hidden Power Grass to hit Chinchou super effectively and have a second move to hit Ground-types like Dugtrio while using Sleep Talk, similar to Ice Beam, while retaining a super effective hit on opposing Octillery and Dewgong. However, Hidden Power Grass significantly reduces Octillery's DVs, making it a worse check to threats like Xatu and Magmar, and unlike Hidden Power Electric and Ice Beam, it cannot hit Xatu and Fearow for meaningful damage when Octillery is using Sleep Talk. Octillery can forgo Sleep Talk in favor of Amnesia to make it in theory much sturdier against threats like Xatu, opposing Octillery, and Magmar, but it means Octillery is constantly being pressured to use Rest due to a lack of having Sleep Talk, and Amnesia does not prevent Octillery from taking significant damage from strong physical hits like Stantler's Frustration, Fearow's Double-Edge, and Primeape's Cross Chop. Octillery can use Surf / Ice Beam / Hidden Power Grass / Protect as a Growth recipient, similar to Dewgong. However, Dewgong tends to be the far superior choice because it is significantly faster and bulkier. RestTalk Octillery with Hidden Power Electric will also often be a superior Growth recipient. Octillery can choose to use a set consisting of Curse, Return, Amnesia, and Rest to take advantage of its high Attack stat and solid typing. However, it has difficulty switching into attacks without Sleep Talk, is slow, can be overwhelmed by Spikes, strong moves, and Explosion; and it tends to be outclassed by Curse Wigglytuff and Porygon.</p> <h1>Checks and Counters</h1> <p><strong>Chinchou</strong>: Chinchou counters Octillery—bar a freeze from Ice Beam—as it resists Surf and Ice Beam, takes little from Hidden Power Electric, is faster, and 2HKOes Octillery with Thunder.</p> <p><strong>Bulky Water-types</strong>: Hidden Power Electric Octillery is the most common check to other Octillery, as it resists Surf and can 3HKO with Hidden Power Electric, quickly forcing the opponent to use Rest or switch their Octillery out. Dewgong cannot do significant damage to Octillery, having to fish for an Ice Beam freeze to do anything to it, but it is not 3HKOed by Hidden Power Electric without a critical hit, can PP stall Ice Beam Octillery, and is faster. Additionally, if Dewgong has Toxic and Encore, it can directly beat Octillery at the cost of potentially being worn down by Hidden Power Electric long-term.</p> <p><strong>Hitmonlee</strong>: Hitmonlee avoids a 3HKO from Surf, outspeeding and 3HKOing back with High Jump Kick while having Rest and Sleep Talk to keep itself alive. However, it can be pushed into range of a 3HKO from Surf by Spikes or a miss from High Jump Kick.</p> <p><strong>Grass-types</strong>: Gloom and other Grass-types are reliable answers to Hidden Power Electric Octillery, keeping themselves healthy throughout a battle with Synthesis and 3HKOing with STAB Grass moves or, in the case of Gloom, Curse-boosted Sludge Bombs. However, they take significant damage from Ice Beam and are generally poor offensively.</p> <p><strong>Porygon</strong>: Porygon avoids a 2HKO from Surf and can repeatedly use Recover to bring itself back to full health. It additionally has Thunder Wave to slow down and potentially fully paralyze Octillery. Porygon can then use the paralyzed Octillery to boost up with Curse or fire off Thunders. However, Porygon is slower than Octillery and only barely manages to dodge a 2HKO from full health, so if there are Spikes on the field or Porygon has taken chip damage, it is not an effective switch-in to Octillery. Porygon also gives Octillery many chances to critically hit it while attempting to boost with Curse.</p> <p><strong>Strong Attackers</strong>: While not reliable switch-ins, Octillery can be directly beaten by threats like Weezing, Primeape, and Stantler, and it has significantly more trouble answering Xatu if it has Hidden Power Electric and Spikes are on the field.</p>",
    "sets": {
      "RestTalk": {
        "description": "<h1>Set Description</h1> <p>Surf and RestTalk are essential to Octillery's core function as a powerful Water-type with solid longevity. Hidden Power Electric most importantly hits other Octillery for a 3HKO and potentially 3HKOes Dewgong with a critical hit. At the very least, it consistently forces Dewgong to use Rest, providing entry for threats like Primeape and Stantler. Hidden Power Electric also retains the ability to hit Xatu and Fearow hard while using Sleep Talk, which Hidden Power Grass cannot do. Ice Beam leaves Octillery walled by other Octillery, but means it is no longer blocked from making progress by Gloom or other Grass-types and hits Xatu and Fearow much harder than Surf or Hidden Power Electric. It also prevents Dugtrio from having a two-thirds chance to not be hit by Octillery when it is asleep, making trying to fish for a non-damaging move to safely use Substitute and Screech much riskier, does not reduce Octillery's DVs, making answering Xatu much easier, and has a potentially crucial chance to freeze on any given usage, which over time can potentially shut down checks like Chinchou and other Hidden Power Electric Octillery. While Ice Beam seems to have much larger upside than Hidden Power Electric, giving free entry to opposing Octillery tends to be disastrous for many teams, so ideally it should be used alongside another Pokemon that can answer opposing Octillery.</p> <h1>Team Options</h1> <p>Pineco is a great partner for Octillery, as its Spikes make switching in Pokemon like Stantler and Wigglytuff that are neutral to Surf and can threaten Octillery much more punishing. Chinchou and Hitmonlee make running Ice Beam on Octillery a lot more forgiving, as they are great checks to other Octillery and appreciate it having a second move to hit Dugtrio and not losing bulk from Hidden Power Electric's DV requirements. Chinchou and Hitmonlee also answer Dewgong, which counters Ice Beam Octillery and can freely fish for freezes with its own Ice Beam. Xatu and Fearow are great answers to Hitmonlee and Grass-types like Gloom and Exeggcute that answer Hidden Power Electric Octillery while also helping Octillery not get overwhelmed by Dugtrio. Fearow, in addition to Wigglytuff, appreciates Octillery forcing Sudowoodo and Graveler to sacrifice themselves with Self-Destruct and Explosion, respectively, to break through it. This can result in a scenario where Sudowoodo is forced to choose between repeatedly coming into Fearow and Wigglytuff but giving up relatively free entry to Octillery or using Self-Destruct on Octillery but leaving its team vulnerable to Fearow and Wigglytuff. Octillery-weak Pokemon like Ninetales, Dugtrio, and Graveler enjoy having a Hidden Power Electric Octillery of their own to switch into other Octillery. All three of these Pokemon can also check Weezing, with Graveler also checking Fearow and spinning away Spikes for Octillery, while Ninetales helps build a sturdier defensive force against Xatu and Magmar. Rapidash also makes for a solid partner, as while its lesser bulk makes it a worse check to Weezing and Hidden Power Ground Magmar than Ninetales, it is much better at forcing damage on Chinchou and is a great answer to Sunny Day Ninetales. Porygon and Magmar are countered by Ninetales, so Octillery is a natural fit alongside them. Gloom and other Grass-types also like Octillery for the same reason, and aid in the Octillery mirror matchup too.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "BeeOrSomething", "user_id": 583728}], "teams": [{"name": "Quality checked by", "members": [{"username": "Estarossa", "user_id": 461329}, {"username": "Stories", "user_id": 400664}]}, {"name": "Grammar checked by", "members": [{"username": "Rabia", "user_id": 336073}]}]}
  },
  "Delibird": {"sets": {"Spikes": {}}},
  "Houndour": {
    "overview": "<p>Houndour has one purpose—to trap and eliminate Xatu with Pursuit. Since it is immune to Xatu's nearly unresisted STAB Psychic, takes little from Hidden Power Ice or Electric, and has a solid Special Attack, Houndour can consistently clear the way for teammates that are otherwise walled or annoyed by Xatu's presence, such as Primeape, Hitmonlee, Kingler, Gloom, and Weezing. Houndour's Fire Blast is also quite strong, being as strong as Rapidash, and it's faster than Pokemon like Weezing and Gloom, so even after it removes Xatu, it might still be able to force damage on the opponent's valuable defensive pieces. However, after removing Xatu, Houndour often does little else and is usually sacrificed for a free switch, as it is extremely frail, is relatively slow, is walled by other Fire-types, and takes heavy damage from Water-type moves, with Octillery even OHKOing it with Surf. Houndour often makes for defensively flawed teams, since it so often does very little compared to an otherwise better Pokemon once it is done trapping Xatu. This is not even to mention that some teams do not even use Xatu, in which case it can feel like playing a five versus six matchup. Houndour also struggles heavily against Pokemon like Dewgong and Stantler, further limiting what it can do beyond trapping Xatu.</p>",
    "comments": "<h1>Other Options</h1> <p>Houndour can use Thief to steal Leftovers from an opposing Xatu before it escapes Pursuit or from whatever Pokemon is switching into Houndour, and this is additionally useful for when the opponent is not using Xatu. However, it consumes a turn that Houndour may rather spend using a different attack, and, in the case of Xatu switching out, means Houndour is losing surprise factor and the opponent's Xatu still remains instead of taking heavy damage from Pursuit.</p> <h1>Checks and Counters</h1> <p><strong>Fire-types</strong>: Flareon, Ninetales, Magmar, and Rapidash all have very high Special Defense while resisting Houndour's Fire Blast, so they are able to wall Houndour and take it down. Magmar, Rapidash, and mixed Flareon are able to quickly KO Houndour with their physical attacks, though Rapidash and Flareon should be wary of Counter if Houndour has not used Sunny Day. Flareon can also take advantage of Houndour to set up Growth boosts and pass them out to a powerful special attacker like Dewgong with Baton Pass.</p> <p><strong>Strong Physical Attackers</strong>: Fast and powerful attackers like Primeape, Stantler, Fearow, Hitmonlee, and Kingler can outspeed Houndour and easily 2HKO or even OHKO it, and, in the case of Kingler, use it to boost with Swords Dance. Porygon is outsped by Houndour, but it has access to Thunder Wave and Recover and can easily shrug off its attacks and boost up with Curse or wear Houndour down with Thunder. Stantler and Fearow do need to be careful of Counter if Houndour has not revealed Sunny Day, though, as if at full health, Houndour can take one attack and retaliate with an OHKO from Counter, though Stantler's Earthquake has a chance to OHKO it.</p> <p><strong>Water-types</strong>: Octillery, Dewgong, and Chinchou take little from Fire Blast and Crunch and do massive damage with STAB Surf, with Octillery even OHKOing it from full health. Dewgong and Chinchou are also both faster than Houndour. However, Houndour can use Sunny Day in front of Octillery or before it comes into the battle and deal heavy damage with Solar Beam, and if Houndour has set up sun before Chinchou enters the battle, it will lose to a healthy Houndour.</p> <p><strong>Dugtrio</strong>: Dugtrio outspeeds Houndour and OHKOes it with Earthquake. Dugtrio can also switch into Crunch if needed or take advantage of Houndour using Pursuit to get a free switch. Dugtrio also has Substitute and Screech to take advantage of a potential switch from Houndour. However, Dugtrio takes heavy damage from Fire Blast, and, if using Substitute too carelessly, can lose HP unnecessarily when the trainer may just want to sacrifice Houndour.</p>",
    "sets": {
      "Pursuit": {
        "description": "<h1>Set Description</h1> <p>Pursuit allows Houndour to trap and KO Xatu, one of the most common foes and one that takes advantage of Pokemon like Hitmonlee and Gloom. Houndour is the only Dark-type Pokemon in the tier that learns Pursuit; while other Pokemon do learn it, Houndour is the only effective user. Often, after Houndour has switched into the opposing Xatu and removed it, it has accomplished its goal and can be used as sacrifice fodder to get one of its teammates in safely. Fire Blast is the main choice of a Fire-type STAB move to do as much damage as possible before Houndour goes down, and crucially lower Xatu into Pursuit range in the absence of Crunch since Pursuit cannot 3HKO. Sunny Day allows Houndour to power up its Fire Blast and seriously threaten both Xatu and whatever may switch in, such as a Stantler or Fearow. Sunny Day also reduces the damage of opposing Surf and allows Houndour to use Solar Beam. Solar Beam 2HKOes Octillery and OHKOes Graveler and Pupitar, allowing Houndour to potentially clean through a slow team if preserved. Against teams with a Fire-type of their own, such as Ninetales, where even sun-boosted Fire Blasts won't accomplish much, Houndour should prioritize trapping Xatu and being relegated to a sacrifice rather than attempting to break holes with Sunny Day. With Crunch, Houndour 2HKOes Xatu, preventing situations where Houndour loses to Xatu because it has taken prior chip damage, misses Fire Blast into Xatu, or gets critically hit by Xatu's Hidden Power Electric, though it comes at the cost of dropping Solar Beam. Counter is often used over Sunny Day in conjunction with Crunch, since without Solar Beam, Sunny Day becomes less useful. Counter mainly allows Houndour to take advantage of its ability to take one neutral physical hit if at high health, such as a Fearow Double-Edge, and retaliate back with a surprise KO. Houndour can also surprise greedy Stantler that come in to revenge kill Houndour with a KO from Counter if they use Return instead of Earthquake in an attempt to not let in Xatu or Fearow freely. Additionally, Houndour can switch into Weezing on a revenge kill or a double switch and force damage on it with Fire Blast or Pursuit, helping to weaken it for a Primeape or Hitmonlee that Houndour may be partnering with.</p> <h1>Team Options</h1> <p>Body Slam Hitmonlee is a prime partner for Houndour, as Xatu otherwise walls it. Hitmonlee is also a solid answer to Octillery, Dewgong, and Chinchou, all of which can switch into Houndour and take advantage of it. Ice Beam Octillery is also a fine choice alongside; while it isn't particularly wanting of Xatu's removal, it works well alongside Hitmonlee to answer opposing Water-types that beat Ice Beam Octillery while also covering Dugtrio and Fire-types like Magmar and Rapidash well for Hitmonlee and Houndour. Gloom, additionally, is walled by Xatu, so Houndour is a natural partner. Gloom can also take on Hidden Power Electric Octillery, Chinchou, and Primeape, all of which threaten Houndour, without being worried about an opposing Xatu blocking it from making progress with Stun Spore or Sludge Bomb. Primeape and Weezing are capable of breaking past Xatu on the switch-in with Thunder; however, Xatu is still an annoyance and can revenge kill both easily, so it can be worth using Houndour alongside them. Using Houndour can also allow Primeape to drop Thunder and instead use a move like Meditate or Thief on Substitute sets or Double-Edge on RestTalk sets. Hidden Power Ground Kingler's biggest enemy is Xatu, so Houndour works well with it, too. Stantler also appreciates Xatu being gone so the opponent has a harder time switching into or revenge killing it. Graveler can be a good partner for Houndour, as while the two don't particularly synergize well beyond Xatu sometimes being annoying for Graveler, many Pokemon that struggle with Xatu, such as Hitmonlee, Gloom, and Kingler, also naturally struggle with Pineco and Fearow.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "BeeOrSomething", "user_id": 583728}], "teams": [{"name": "Quality checked by", "members": [{"username": "MrSoup", "user_id": 375193}, {"username": "dawnbuster", "user_id": 508601}]}, {"name": "Grammar checked by", "members": [{"username": "Tbolt", "user_id": 555379}, {"username": "autumn", "user_id": 384270}]}]}
  },
  "Stantler": {
    "sets": {
      "Offensive Support": {
        "description": "<p>Stantler is quite the threatening Pokemon thanks to its solid offensive stats and a variety of support moves including Hypnosis, Light Screen, and Reflect. In addition, unlike most other Normal-types in GSC NU, it is quite strong even when unboosted and has crucial coverage in Earthquake to actually threaten Rock- and Steel-types. Stantler is a defining member of the lead metagame, able to effectively put something to sleep before dishing out damage with its powerful Return. Stantler is also quite fast for the tier, outspeeding Pokemon such as Kingler, Weezing, Chinchou, and Dewgong. However, Stantler has a poor matchup against the most common Pokemon in the tier, Xatu, and also struggles with other top-tier Pokemon such as Primeape. Furthermore, while its defensive stats are passable, they are far from amazing, which can make it difficult to switch in throughout a battle. Return is a mandatory STAB move that hits a vast majority of the tier for a 3HKO. Earthquake complements Return well, hitting the common Rock-types such as Sudowoodo and Pupitar for decent damage and OHKOing Magnemite and the rare Gastly. Hypnosis is another valuable tool in Stantler's moveset, as it can shut down Stantler's checks temporarily as well as stop slower setup sweepers. Thief's ability to make defensive Pokemon such as Azumarill and Dewgong much easier to break through by stealing their Leftovers makes it invaluable for Stantler's offensive teammates. On teams with setup sweepers such as Kingler and Primeape, Stantler can run Light Screen or Reflect over its other supporting moves to make their time setting up much easier, especially Light Screen in Kingler's case. Finally, when paired with a Agility + Baton Pass user such as Farfetch'd, Stantler can run Curse to boost its Attack, turning it into a powerful sweeper while retaining +1 Speed after one use.</p> <p>Stantler best fits on offensive teams, starting the game off well by potentially sleeping a slower lead such as Wigglytuff or Pineco and later stealing valuable Leftovers from bulky Pokemon that could give its team trouble. Weezing is one of Stantler's best partners, as it greatly helps Stantler with its weakness to Fighting-types, while Stantler can support Weezing well with Thief and Hypnosis. Anti-Xatu Pokemon such as Ninetales and Dewgong also assist Stantler with its poor matchup against the Psychic bird; Dewgong in particular enjoys Stantler's ability to blow through Chinchou with Earthquake. Finally, setup sweepers that can have a hard time setting up, such as Kingler and Primeape, benefit from Stantler's ability to shut one check down and provide Light Screen and Reflect support.</p>"
      },
      "RestTalk": {
        "description": "<p>With this set, Stantler becomes an incredibly solid anti-lead with better longevity than a dedicated lead set. Its ability to stay in on Thunder Wave variants of Wigglytuff, opposing Stantler leads, and Rapidash can be invaluable for teams lacking switch-ins for those Pokemon. Stantler is also able to switch in throughout the game much better thanks to said longevity. Return and Earthquake hit everything in GSC NU for neutral damage, making them the best options for RestTalk Stantler to still keep its solid offensive prowess.</p> <p>Unfortunately, RestTalk Xatu has an excellent matchup against Stantler because Return cannot 2HKO it and Xatu outspeeds and reliably 3HKOes in return with Psychic or Drill Peck. One way to improve Stantler's chances is to pair it with a Light Screen user such as Azumarill, which also doubles as a check to fast and powerful Fire-types and some Water-types, or Ivysaur, which also checks Chinchou and Primeape. While these Pokemon are passive, RestTalk Stantler can compensate for this with its high-Base Power attacks, perfect coverage, and good longevity behind a screen.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "dawnbuster", "user_id": 508601}], "teams": [{"name": "Quality checked by", "members": [{"username": "Earthworm", "user_id": 15210}, {"username": "cherryb0ng", "user_id": 421511}]}, {"name": "Grammar checked by", "members": [{"username": "Rabia", "user_id": 336073}]}]}
  },
  "Pupitar": {
    "sets": {
      "Magistr (Standard)": {
        "description": "<p>Pupitar stands in the middle between Sudowoodo and Graveler in GSC NU's competition for the much desired resistance to Normal, with the only other choices being the frail Magnemite and the incredibly mediocre Gastly. What sets Pupitar apart from its exploding rock companions is Ancient Power, which has a 10% chance to boost every single stat bar accuracy and evasiveness and can make Pupitar a deadly cleaner when Water-types are removed. Forcing the opponent to switch out as Pupitar tries for an Ancient Power boost is where it shines the most. Sure, it's a 10% chance, but it's a 10% chance to give a power boost to the unresisted dual STAB combination of Rock Slide and Earthquake.</p> <p>Screech Pupitar is a solid answer to Curse Wigglytuff and Porygon while also giving it much better odds to break through Hidden Power Electric Octillery with Spikes up. Although it can be unreliable at times—and very luck dependent—even without boosts, Pupitar has a great time against some of the great staples in the tier, such as non-Sunny Day and Giga Drain Xatu variants, even having a chance of surviving three STAB Psychics; Weezing; the aforementioned dreaded Curse Normal-types; Magnemite; and Pineco. Unfortunately, Water-types and Hidden Power Grass-wielding Fire-types are quite troublesome for the rock worm, but that's when its teammates come in. Defensively, Chinchou and Azumarill can handle both kinds of foes reliably, and offensively, options such as Substitute Explosion Graveler can be used to take out Water-types before Pupitar is even revealed. Hitmonlee can also pair well with Pupitar to handle Dewgong and Chinchou, while Pupitar can switch into Psychic or Drill Peck aimed at Hitmonlee from Xatu. Pupitar can also get worn down fast by repeated hits from Fearow and Wigglytuff over the course of a game, especially with Spikes on the field.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "freezingpop87", "user_id": 523268}], "teams": [{"name": "Quality checked by", "members": [{"username": "Earthworm", "user_id": 15210}, {"username": "dawnbuster", "user_id": 508601}]}, {"name": "Grammar checked by", "members": [{"username": "Rabia", "user_id": 336073}]}]}
  }
}