{
  "Mewtwo": {
    "overview": "<p>Mewtwo's incredible stats and deep movepool grant it tremendous versatility and power. Its ridiculously high Speed, solid defenses, and access to Recover and Barrier make it one of the sturdiest checks to physical attackers that lack phazing moves, such as Mew and Earthquake Lugia. Offensively, its monstrous Special Attack, amazing coverage, and status moves allow it to threaten broad swathes of the metagame. Nothing is entirely safe from Mewtwo, though it may need to sacrifice itself with Self-Destruct to consistently eliminate the foe. Unlike most other threats of its magnitude in GSC, Mewtwo requires no setup before it can start blasting away. Mewtwo's flaws are few and far between, but the most exploitable is perhaps its lack of ways to deal with status. Paralysis is a death sentence for Mewtwo, which puts it in an awkward situation against foes with Thunder, Body Slam, or Thunder Wave. However, Self-Destruct gives Mewtwo a way to salvage even poor situations. Mewtwo is so difficult to handle that, oftentimes, players must resort to controlling it through Self-Destruct or Explosion, as a trade is usually preferable to continually enduring its attacks or being perpetually walled.</p> ",
    "comments": "<h1>Other Options</h1> <p>Instead of relying on Thunder to inflict paralysis, Mewtwo can instantly paralyze its foes with Thunder Wave. This is particularly useful when combined with Dynamic Punch and setup sweeper teammates such as Belly Drum Snorlax, Marowak, Curse Tyranitar, and Swords Dance Mew. However, it comes at the cost of coverage and the most likely target of Thunder Wave, opposing Mewtwo, can potentially trade itself with Mewtwo with Self-Destruct to avoid the disadvantage of being paralyzed. Mewtwo can use Curse along with Submission or Dynamic Punch to deal serious damage to specially bulky foes such as Snorlax, Blissey, Umbreon, and Tyranitar. It can also potentially use Shadow Ball to hit Psychic-types such as Mewtwo, Mew, Lugia, and Celebi for boosted damage. However, using Curse and physical attacks makes it difficult to retain sufficient special coverage; for example, without Thunder, Mewtwo will struggle to deal with Forretress, Ho-Oh, and Cloyster, and without Ice Beam, it will struggle against Zapdos and Steelix. Even if Mewtwo uses Curse, a physical attack, and two special attacks, it will need to forgo Recover and Self-Destruct. Curse Mewtwo therefore requires specific circumstances and extensive support in order to be most effective. Mewtwo's ample pool of HP makes it a capable user of Counter, which can catch foes such as Swords Dance Mew and Curse Snorlax and instantly KO or deal massive damage to them. On top of this, its high Speed and access to Self-Destruct and Recover mean that it won't be entirely useless after executing this strategy. However, Counter is a higher risk strategy than simply dealing with these foes using Barrier or Self-Destruct, as it relies in part on surprise.</p> <h1>Checks and Counters</h1> <p><strong>Snorlax: Although it must be wary of Self-Destruct and Dynamic Punch, Snorlax can dominate most Mewtwo sets with its common sets. Its massive special bulk allows it to easily withstand Mewtwo's special attacks, allowing it to set up with Curse or cripple Mewtwo with Body Slam paralysis before setting up with Belly Drum. Lovely Kiss also gives it a way to bypass even Barrier Mewtwo.</p> <p><strong>Mew and Mewtwo</strong>: Mew and Mewtwo are both very bulky, which allows them to withstand numerous attacks from opposing Mewtwo before potentially healing the damage with Soft-Boiled or Recover. With a small amount of chip damage, they can also reliably OHKO it with Explosion or Self-Destruct. Mew can set up with Swords Dance to boost its Shadow Ball or Earthquake and then deal heavy damage to Mewtwo. However, Mewtwo will often have Barrier or Self-Destruct to neutralize the threat from Mew, and it can potentially inflict status with Toxic, Thunder, or Thunder Wave, so it must be dealt with cautiously. Generally, a clash between these titans of the tier tends to end in an exchange of status inflictions or a trade via Explosion or Self-Destruct.</p> <p><strong>Electric-types</strong>: Raikou tends to be one of the safest checks to Mewtwo, as Mewtwo often drops Psychic for other moves with better super effective coverage and Ice Beam is only a 5HKO against it. In return, Raikou threatens Mewtwo with crippling paralysis from Thunder, which can allow teammates such as Curse Snorlax to fight Mewtwo with less risk of being suddenly KOed by Self-Destruct or getting walled by Barrier. Zapdos is weak to the common Ice Beam, but in the absence of Ice Beam and Psychic, Zapdos also does well against it thanks to its powerful Thunder and access to Thunder Wave. Jolteon should generally avoid switching into Mewtwo before scouting, but it can fight against Barrier variants adequately thanks to Speed tying with Mewtwo and having Growth to boost its Special Attack. Jolteon's +1 Thunder is a 2HKO on Mewtwo, whereas Mewtwo's Flamethrower or Ice Beam is a 4HKO against Jolteon.</p> <p><strong>Dark-types: Umbreon is one of the best at neutralizing Mewtwo thanks to its formidable bulk and solid defensive typing. While it is lacking in powerful direct damage options, it can chip away at Mewtwo with Toxic and Pursuit, put it in an awkward position with Charm, and threaten to trap it with Mean Look. Curse Tyranitar is one of the biggest problems for Barrier Mewtwo, as it commonly runs both Roar and Rest to negate the effects of Barrier and Toxic. Specially, Tyranitar has a powerful super effective STAB Crunch alongside Pursuit, which can put Mewtwo that lack Fighting-type coverage in an awkward position. While Crunch does not 2HKO Mewtwo, it deals enough so that Mewtwo is under serious threat from potential Special Defense drops and critical hits, even with Recover. Tyranitar also resists Self-Destruct, which means that, unlike with most foes, Mewtwo is unlikely to be able to achieve a trade. Unlike most Pokemon that resist Normal, Tyranitar also has good special bulk, which allows it to take coverage attacks from Mewtwo that other Normal-resistant Pokemon are afraid of. However, Dark-types need to be cautious around Mewtwo sets that have Fighting-type coverage moves, especially Tyranitar with its 4x weakness.</p> <p><strong>Heracross</strong>: Heracross has decent special bulk and access to STAB Megahorn, the only unboosted attack in the game that can reliably 2HKO Mewtwo aside from Self-Destruct and Explosion. If Mewtwo lacks Psychic- and Fire-type coverage, Heracross has a good matchup against it and will generally be able to force Mewtwo to switch out or trade with Self-Destruct.</p> <p><strong>Blissey</strong>: Blissey can take on variants of Mewtwo that lack Dynamic Punch reasonably safely, as even Submission fails to 2HKO it. It can undo the status spreading that Mewtwo has done with Heal Bell and even pose a significant threat to it with Present or Toxic. However, as with most Mewtwo checks, it must be wary of Self-Destruct.</p> <p><strong>Vaporeon</strong>: RestTalk + Growth Vaporeon or Growth + Baton Pass Vaporeon can take advantage of Mewtwo sets that lack Thunder, such as the common Flamethrower + Toxic + Barrier set. However, it is risky to take Mewtwo on with Vaporeon before its set is revealed.</p> <p><strong>Shuckle</strong>: Shuckle is a fairly reliable answer to Mewtwo variants that lack Psychic, as none of its other attacks can reliably 4HKO it. It threatens Mewtwo with Toxic and can PP stall it without risking being KOed by Self-Destruct.</p> <p><strong>Quagsire</strong>: Quagsire can switch into Thunder and Flamethrower, which are Mewtwo's most commonly used attacks, and take next to no damage. It can then either attempt to stall Mewtwo with a RestTalk set or, if Mewtwo is paralyzed, set up with Belly Drum. However, it is 4HKOed by Ice Beam, which leaves it vulnerable to critical hits or confusion from Dynamic Punch, and it is easily 3HKOed by Psychic.</p> ",
    "sets": [
      {
        "name": "Recover",
        "description": "<h1>Set Description</h1> <p>Mewtwo's extremely high Speed and 32 PP of Recover let it use Barrier to wall any physical attackers that lack phazing moves and disruptive secondary effect chances on their attacks, such as Swords Dance Mew, Earthquake Lugia, and certain Curse Snorlax and Mewtwo variants. Even a +6 Shadow Ball critical hit from Mew will only deal up to 70.3% to +6 Mewtwo, and because Mewtwo outspeeds and has Recover and Leftovers, Mew must land four consecutive critical hits to take a full health Mewtwo down. Mewtwo's effectiveness as a physical wall is compounded by the fact that many Explosion and Self-Destruct users only OHKO it some of the time—only Golem and Snorlax always OHKO—and if Mewtwo survives other foes' Explosions, it can restore its health with its fast Recover. However, Mewtwo is not a flawless physical wall—even without the less common Self-Destruct, Snorlax can pierce Mewtwo's defenses with Lovely Kiss and potentially use Body Slam, Mew can use Thunder Wave or potentially allow a teammate to sweep by removing Mewtwo with Explosion, and Curse phazers such as Tyranitar, Lugia, and Ho-Oh can remove its Defense boosts after accruing boosts. However, Swords Dance Mew is a massive threat, and Barrier Mewtwo is one of the safest ways to reliably handle it. In addition to walling foes, Mewtwo threatens its foes in return with its remaining two moveslots. The combination of Toxic and Flamethrower is an excellent way to ensure Mewtwo can pose some threat to a majority of foes, as Pokemon immune to Toxic generally take heavy damage from Flamethrower. Toxic also has the advantage of dealing sustained damage while Mewtwo does its stall routine. Ice Beam can be used over Toxic so that Mewtwo can threaten Zapdos, which is one of the most common RestTalk users in the metagame, and it also lets Mewtwo possibly freeze foes. Flamethrower can be replaced by Thunder, which has great coverage alongside Ice Beam, allows Mewtwo to hit foes such as Ho-Oh and Starmie, and threatens to paralyze foes such as Mewtwo, Mew, and Lugia. Another alternative is Psychic, which hits bulky foes such as Snorlax and Raikou for heavy damage and is an especially powerful option with Growth boosts from Baton Pass. When combined with Barrier, Growth boosts can turn Mewtwo into a near-invincible powerhouse; however, Psychic can also be used alongside BoltBeam coverage to retain heavy damage against foes such as Ho-Oh and Forretress.</p> <p>Mewtwo can also take a more offensive approach by running other attacking moves instead of Barrier. Self-Destruct retains some efficacy in dealing with Mew and can break through opposing status absorbers, such as Rest Snorlax. It is also somewhat unexpected alongside Recover, which could allow Mewtwo to grab a surprise KO against an unsuspecting foe. Dynamic Punch is a good option for dealing with Dark-types such as Umbreon and Tyranitar while also providing a chance to break through Snorlax and Blissey without relying on Self-Destruct. However, it should be noted that Dynamic Punch sets with Recover over Self-Destruct may lack the firepower to deal with opposing Mewtwo and Mew.</p> <h1>Team Options</h1> <p>Recover Mewtwo is exceptionally susceptible to status, so status absorbers and clerics are critical to its success. Rest Snorlax is a great general tank and can take a beating from most Pokemon that could paralyze Mewtwo with Thunder or target it with other moves that may inflict status. Blissey can likewise take virtually any special attack and offers Heal Bell support, which can allow Mewtwo to accept a degree of risk, such as fighting a Pokemon that uses Thunder, Body Slam, or Thunder Wave. Rest Jolteon can take potentially-paralyzing hits from Electric-types and threaten a sweep with Growth boosts. Baton Pass Jolteon can likewise threaten a sweep by passing boosts to Mewtwo or its teammates, which is especially effective if Mewtwo has multiple attacking moves. Spikes and Rapid Spin support is also recommended in order to go toe to toe with defensive teams; Forretress and Cloyster both make for excellent Spikes users and can also use Rapid Spin if the team requires it, whereas Golem can provide additional defense against Snorlax and pivot into Electric-type attacks aimed at Mewtwo alongside its Rapid Spin support. Measures against Curse + Whirlwind Lugia and Ho-Oh such as Zapdos and Raikou are a necessity. Both of these Electric-types provide a lot of offensive presence and defensive utility; offensively, they offer high damage output and a paralysis threat with STAB Thunder, as well as the potential to run Roar or Whirlwind with Spikes support to rack up passive damage against bulky foes. Defensively, both are effective as RestTalk users and perform very well against Lugia, one of the most important threats to deal with. An alternative to the Electric-types is Crunch Tyranitar, which offers both heavy damage against Lugia and other Psychic-types as well as a useful resistance to Normal-type moves such as Explosion and Snorlax's STAB attacks.</p> "
      },
      {
        "name": "All-out Attacker",
        "description": "<h1>Set Description</h1> <p>As an all-out attacker, Mewtwo focuses on maximizing coverage while holding the threat of a sudden Self-Destruct over the foe's head. Thunder is essential to threaten Cloyster with an OHKO, as well as threatening Lugia, Ho-Oh, Mew, and Mewtwo with heavy damage and paralysis. Ice Beam is the best choice for its second move, as it threatens a 2HKO on Zapdos and Golem while also providing the possibility of a game-changing freeze. This BoltBeam coverage is best complemented with a Fighting-type move for Snorlax, Tyranitar, Umbreon, and Blissey. Dynamic Punch is an inconsistent but extremely dangerous option thanks to its accompanying confusion, which substantially increases Mewtwo's chances of getting past Snorlax without having to use Self-Destruct. The presence of Self-Destruct on the set also offers a way to recoup lost ground if Dynamic Punch fails to connect. Submission is weaker and comes with recoil, but its reliability gives it some appeal, and it still hits the aforementioned targets for substantial damage. Psychic is a solid alternative to Ice Beam, as it hits all of Snorlax, Zapdos, and Raikou for solid damage while threatening to drop Special Defense. This solid neutral damage on key foes also allows Mewtwo to run Fire Blast for the OHKO on Forretress, 2HKO on Celebi, and more reliable damage against Mew and opposing Mewtwo. Self-Destruct is a key weapon in Mewtwo's arsenal, allowing it to instantly remove nearly any foe after one prior hit. This can be used to deal with Swords Dance Mew, opposing Mewtwo, and Snorlax, potentially putting a teammate such as Zapdos or Jolteon into a position to sweep.</p> <h1>Team Options</h1> <p>Mewtwo is very commonly paired with Mew, as the two are excellent at breaking apart defensive cores with Self-Destruct and Explosion. If Mewtwo succeeds in taking down a specially bulky foe such as Snorlax, Blissey, or Raikou, this may allow a threat such as Growth Jolteon or Zapdos to wreak havoc with STAB Thunder. Jolteon can also potentially send its Special Attack boosts to Mewtwo with Baton Pass, making it nigh unstoppable. Mewtwo also appreciates Spikes support from Pokemon such as Forretress and Cloyster, as this helps it break through bulky foes such as Snorlax and Umbreon more easily. To potentially avoid having to trade such a valuable offensive weapon for its doppelganger on the opposing team, one can aim to status the opposing Mewtwo and then take it down with teammates such as Crunch + Pursuit Tyranitar, Explosion Steelix, Curse Lugia, Swords Dance Mew, and Curse Snorlax. In case Curse Snorlax gets out of hand against Mewtwo, it is useful to have at least one Normal-resistant phazer such as Steelix, Tyranitar, or Golem, or a Normal-resistant Defense booster such as Curse Skarmory, Reflect or Curse Forretress, or Defense Curl Shuckle.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Earthworm", "user_id": 15210}], "teams": [{"name": "Quality checked by", "members": [{"username": "Isa", "user_id": 168574}, {"username": "M Dragon", "user_id": 21345}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}, {"username": "deetah", "user_id": 297659}]}]}
  },
  "Mew": {
    "overview": "<p>Mew is probably the best Uber due to Swords Dance and the movepool that allows it to do anything it wants. It's best used as a physical sweeper since most physical walls and the other Ubers have a physical weakness that Mew can exploit.</p> ",
    "comments": "<h1>Other Options</h1> <p>If Shadow Ball or Rock Slide doesn't appeal to you, Mew has just about every special attack under the sun to use to counter whatever you want to. Mew can also use Swords Dance with Earthquake or Explosion. There's also a myriad of other good moves available--some examples are Curse, Counter, and Thunder Wave. It's also possible to make any other combination of these, but in general the physical sweeper set is the most effective overall.</p> <h1>Checks and Counters</h1> <p>There really isn't a sure-fire Mew counter, and that's why its Uber. Your best bet is probably Heracross, since he resists Submission and most Mew don't have Psychic or Fire Blast. If Mew doesn't have Psychic or Earthquake, then Muk stands to be a good counter too.</p> ",
    "sets": [{"name": "Swords Dance", "description": "<p>Set up with Swords Dance and hit everything with the attack that will do the most damage. Submission will work wonders on most opponents. Shadow Ball is there for the Psychic-types that are prominent in the Uber metagame, and Rock Slide will take apart the Flying-type Ubers.</p> "}]
  },
  "Tyranitar": {
    "overview": "<p>Blessed with excellent stats all around, a unique typing, and an insane movepool, Tyranitar is one of the best Pokemon in GSC Ubers. Its ability to check very important Pokemon in the metagame, such as Snorlax, Mewtwo, Lugia, and Ho-Oh, coupled with key attributes like resisting Normal, having access to Curse and Roar, and having few special weaknesses means that Tyranitar fits perfectly on all kinds of teams from offense to stall. The rarity of effective checks to Tyranitar like Machamp and Nidoking in the metagame also means that Tyranitar usually feels less threatened to switch out once it starts boosting with Curse.</p> <p>However, Tyranitar often finds itself using Roar in conjunction with Spikes support as a way of making progress through teams, as the lack of a powerful STAB move means that it can't fully exploit its gargantuan base Attack stat and thus struggles with the bulky nature of the metagame. Furthermore, many teams are prepared for Tyranitar and have answers to it, such as Celebi, Golem, and Steelix, all of which greatly threaten Tyranitar, meaning a Curse Tyranitar sweep should only be considered when all of its checks are weakened or removed. Lastly, the relevance of Growth + Baton Pass Pokemon like Jolteon and Vaporeon in the tier hurts Tyranitar's ability to reliably check Pokemon it's supposed to, like Mewtwo.</p> ",
    "comments": "<h1>Other Options</h1> <p>Screech can be used on Curse sets as an alternative to Roar, which potentially enables Tyranitar to beat Barrier Mewtwo and Curse Snorlax one-on-one. However, it is less reliable than Roar due to its low accuracy, and running Screech means that Tyranitar can't scout for threatening foes and chip them with Spikes support. Surf can also be used over one of Rest or Roar to hit Rhydon and Golem trying to take advantage of Tyranitar staying in on them. Lastly, either Hidden Power Bug or Earthquake can be used over one of Rest or Roar as well; Hidden Power Bug is Tyranitar's strongest available move that 2HKOes Celebi, while Earthquake OHKOes Jolteon at +1 and does good damage to opposing Tyranitar without offering much outside of that.</p> <p>On the 3 Attacks set, Pursuit can be an option over either Flamethrower or Surf to trap Pokemon like Mewtwo and, in particular, Gengar. However, Pursuit is an extremely weak move, and, unless Tyranitar drops the foe's Special Defense with Crunch, the Pokemon it's supposed to trap will usually stay in on it, rendering Pursuit useless. It's also worth noting that a boosted Pursuit deals the same amount of damage that a regular Crunch does. Lastly, Gengar is not a common enough Pokemon to justify running Pursuit, making Tyranitar be better off using other moves.</p> <p>An all-out attacker set with Rock Slide, Crunch, Flamethrower and one of Dynamic Punch or Surf is also an option to maximize Tyranitar's wallbreaking capabilities. However, it's a set that is very reliant on its teammates, as without Roar and Rest, Tyranitar can't effectively do its main role of checking Snorlax throughout a game.</p> <h1>Checks and Counters</h1> <p><strong>Ground-types: Ground-type Pokemon like Rhydon and Golem can immediately threaten to 2HKO Tyranitar with their Earthquake. Both Pokemon are OHKOed by Surf, however. Steelix gets a special mention, as it resists both of Tyranitar's STAB moves, can use Curse alongside Tyranitar to deny Roar attempts, and can hit back with a super effective Earthquake. However, it must be careful of Surf and Flamethrower. Marowak doesn't mind any attacks from Tyranitar aside from Crunch and Surf while threatening to OHKO Tyranitar with Earthquake.</p> <p><strong>Celebi: Celebi is one of the best answers to Tyranitar, as it can comfortably recover all health lost and hit back hard with a super effective Hidden Power Grass, forcing Tyranitar to use Rest or forcing it out. It should be careful of Fire Blast and Crunch variants, however, as they can potentially deal more damage to Celebi than it can recover if the respective secondary effects of their moves trigger.</p> <p><strong>Bulky Water-types</strong>: Pokemon like Vaporeon and Suicune don't mind any of Tyranitar's attacks and can proceed to hit hard back with Surf. Quagsire can use Haze to reset all of Tyranitar's Curse boosts and takes very little from Rock Slide, Crunch, and its coverage options. While it doesn't like switching into Tyranitar directly, Cloyster functions as one of the best Tyranitar checks in the tier thanks to its ability to immediately threaten to 3HKO it with Surf due to its superior Speed.</p> <p><strong>Giga Drain Exeggutor: Exeggutor can switch into Rock Slide and heal back the damage with Giga Drain; it should be careful of Crunch and Fire Blast variants, however.</p> <p><strong>Status</strong>: Pokemon like Snorlax and Exeggutor can switch into Curse Tyranitar and put it to sleep for up to six turns with Lovely Kiss and Sleep Powder, respectively, allowing Pokemon like Cloyster to come in on it for free. Toxic from Mewtwo and Forretress can eventually force Tyranitar to use Rest, leaving it similarly vulnerable.</p> <p><strong>Umbreon: Umbreon denies Curse Tyranitar's sweep attempts thanks to Charm and its good bulk. It also takes little to no damage from any of Tyranitar's coverage attacks.</p> <p><strong>Bulky Pokemon with Recovery</strong>: Pokemon like Soft-Boiled Mew and Recover Mewtwo are especially annoying to Tyranitar, as thanks to their good natural bulk, they can scout what set Tyranitar is running to pivot their teammates in accordingly.</p> <p><strong>Fighting-type Coverage: Pokemon like Mewtwo and Mew often run moves like Submission to immediately threaten Tyranitar with a 2HKO. Mew in particular can boost with Swords Dance and turn the 2HKO into an OHKO. Albeit rare, Machamp can KO Tyranitar even through Curse boosts thanks to Cross Chop and easily switches into it, as it resists both of its STAB attacks and is naturally bulky.</p> <p><strong>Heracross: Heracross takes a decent chunk from Rock Slide but can scare Tyranitar off with its STAB Megahorn and heal itself with Rest; it must be careful of Fire Blast, however.</p> ",
    "sets": [
      {
        "name": "CurseTar",
        "description": "<h1>Set Description</h1> <p>This is Tyranitar's most popular set thanks to its good role compression: checking Snorlax, Mewtwo without a Fighting-type move, and Lugia is invaluable for many teams. Curse lets Tyranitar comfortably wall non-Earthquake variants of Snorlax while making it a potential wincon. Rock Slide is Tyranitar's attacking move of choice, as there are no Pokemon immune to Rock-type attacks. Roar phazes Curse Snorlax and Barrier Mewtwo, making this Tyranitar set the most reliable check to them in the tier. Roar also prevents Tyranitar from being phazed by opposing Tyranitar while asleep. Rest gives this set necessary longevity, as without it, Tyranitar gets worn down too quickly, preventing it from properly checking Snorlax and Mewtwo; Rest also lets Tyranitar PP stall variants of Mewtwo without a Fighting-type move. Lowering Tyranitar's Speed EVs to 204 allows it to win the Curse war against opposing Curse Tyranitar and Lugia while Speed tying with Exeggutor: this also underspeeds -1 Speed Lugia and opposing Tyranitar at neutral Speed, which allows Tyranitar to not get phazed by them. Other phazers like Whirlwind Zapdos and Ho-Oh are also discouraged from phazing Tyranitar due to their critical weakness to Rock Slide.</p> <h1>Team Options</h1> <p>Even after a Curse boost, Mew will still threaten to break through Tyranitar with a boosted Submission. Therefore, checks to it such as Barrier Mewtwo and Curse Skarmory are good teammates. Cloyster can set Spikes for Tyranitar and help it against Ground-types such as Steelix, Golem, and Rhydon. Snorlax can form a double Curse combination with Tyranitar, as they both share the same checks and counters and so can work together to wear them down. Zapdos defeats Earthquake variants of Lugia for Tyranitar and scares out Cloyster; Tyranitar switches into Snorlax and Mewtwo in return.</p> "
      },
      {
        "name": "Roar + 3 Attacks",
        "description": "<h1>Set Description</h1> <p>Tyranitar's large movepool and high attacking stats let it lure and remove checks to itself and its teammates. Even on a specially oriented set, Rock Slide is mandatory, as without it, Tyranitar would not be able to check key Pokemon like Zapdos and Ho-Oh. Roar phazes Curse Snorlax and lets Tyranitar scout for threats while potentially chipping them with Spikes support. Crunch hits Mewtwo and Celebi, two of the best checks to Tyranitar, for super effective damage; it also has the added benefit of being able to drop the foe's Special Defense, which can be useful in one-on-one scenarios against non-Earthquake variants of Snorlax and Lugia. Flamethrower is commonly chosen on the last slot to hit important targets like Forretress, Skarmory, and the rare Heracross for super effective damage. Surf can be used instead to hit Ground-types like Rhydon and Golem while hitting opposing Tyranitar decently hard. It's worth mentioning that both Flamethrower and Surf hit Steelix, a Pokemon that would otherwise wall both of Tyranitar's STAB moves.</p> <p>Fire Blast is another option over Flamethrower, as it can reach some benchmarks that Flamethrower can't. For example, Fire Blast gets a guaranteed 2HKO on Steelix that Flamethrower misses out on. Fire Blast also pressures Heracross harder, as it now has a chance of being 2HKOed.</p> <h1>Team Options</h1> <p>Offensive teams appreciate Tyranitar's wide coverage being able to lure Steelix, Forretress, and Skarmory. Given that Curse Snorlax can potentially break through Tyranitar, more offensive ways of handling it are important. Thus, teammates such as Explosion Cloyster, Mewtwo, Exeggutor, and Mew are needed. Jolteon and Vaporeon are other good offensive teammates, as they can use Growth and Baton Pass to allow Tyranitar to wallbreak a lot easier. Tyranitar checks Snorlax for them in return. However, Tyranitar is only a temporary check to Snorlax due to it not being able to break through Curse sets in a one-on-one scenario. Additionally, Tyranitar's usefulness is decreased if Snorlax is running Earthquake. As such, checks to Earthquake variants of Snorlax, such as Barrier Mewtwo and Curse Lugia, are recommended. Mono-attacker Snorlax appreciates Tyranitar's ability to cook Steel-types like Skamory, Forretress, and Steelix with Flamethrower, while it switches into Zapdos for Tyranitar in return.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "corvere", "user_id": 306317}], "teams": [{"name": "Quality checked by", "members": [{"username": "Isa", "user_id": 168574}, {"username": "Mr.378", "user_id": 5541}]}, {"name": "Grammar checked by", "members": [{"username": "Clas", "user_id": 545372}, {"username": "aurora", "user_id": 109385}, {"username": "Dawn of Ares", "user_id": 467437}]}]}
  },
  "Lugia": {
    "overview": "<p>Lugia can be a nice wildcard in Uber battles. It would have been fantastic if it could set up dual screens with those amazing defenses in GSC, but oh well. It still tanks hits perfectly, and hits hard as well.</p> ",
    "comments": "<h1>Other Options</h1> <p>Psych Up + Whirlwind can be a fun combo if your opponent is trying to set up Curse against Lugia. Other than that, the other moves just depend on what you really want to beat. It learns a plethora of great special attacks like Thunder, Thunderbolt, Hydro Pump, Psychic, and Ice Beam.</p> <h1>Checks and Counters</h1> <p>Zapdos and Skarmory seem to be the only viable counters. Aerodactyl can be to some extent (assuming it is the Curse set), as well as some Pokemon with Curse and Roar.</p> ",
    "sets": [{"name": "Curse", "description": "<p>Lugia is really more defense-oriented than Ho-Oh, but can be made offensive, as evidenced by the moveset above. Despite having 3 fairly common special weaknesses, its high HP and Special Defense allow it to be a godly Curse user. It can conceivably beat CurseLax with a couple critical hits with Aeroblast. This set has its problems, however. First, Skarmory and Zapdos completely nullify this. Second, Aeroblast's low PP hurt it as well, so it's best to only let loose once Lugia has a fair amount of Curses under its belt.</p> "}]
  },
  "Ho-Oh": {
    "overview": "<p>To be honest, Ho-Oh's probably the worst GSC Uber, but that's not really saying a lot. Ho-Oh's main problem is the fact that there are only four moveslots. Otherwise, it would probably be the best Uber. Ho-Oh has great stats, but so do all the Ubers, so it's best as a cleaner if you can get Blissey or Skarmory out the way.</p> ",
    "comments": "<h1>Other Options</h1> <p>Ho-Oh can use Sunny Day and Solar Beam in conjunction with Sacred Fire, but Ho-Oh will just end up being walled by Blissey.</p> <h1>Checks and Counters</h1> <p>If Ho-Oh doesn't have Hidden Power Fighting or Curse, Blissey can stall it out, but not without suffering a possible burn. Most of the other Ubers can handle it since it doesn't really have anything that can force a switch, and it's not great at sweeping. If Ho-Oh has Shadow Ball instead of Earthquake, Tyranitar and Rhydon can handle it with little to no trouble, though they despise being burned by Sacred Fire.</p> ",
    "sets": [
      {"name": "Standard Sweeper", "description": "<p>This is the general cleaning set. Fire and Electric covers most special weaknesses, and the 50% burn chance of Sacred Fire is awesome. The last move is up to you--Earthquake is generally the better move. However, you might also want to try Shadow Ball--it's super effective against the Psychic-types (Mew, Mewtwo, Lugia, and Celebi) and has a chance of lowering the Special Defense of threats like Suicune.</p> "},
      {"name": "Curse", "description": "<p>One of the most basic sets in the book can catch people completely off guard. Return is awfully generic, but it's neutral to most Pokemon in the Uber metagame save for Skarmory. There are multiple choices for the last slot. Whirlwind is probably your best bet and is used to avoid being phazed (and at the same time to phaze other Uber Curse users), Sacred Fire is used to nail two of the main Uber phazers (Skarmory, Celebi) and burn Tyranitar and Rhydon, and Shadow Ball blasts away those annoying Psychic-types.</p> "}
    ]
  },
  "Celebi": {
    "overview": "<p>Celebi has great stats, and resistances to three of the most popular attack types in the game is never bad (Water / Electric / Ground). One thing Celebi doesn't get its due credit for is being able to stall out the average Snorlax and force it to Rest without taking much damage thanks to Leech Seed. It also learns Heal Bell, which is one of the most valuable moves for a stall team, and is still useful for others.</p> ",
    "comments": "<h1>Other Options</h1> <p>Perish Song can act as a phazing move. Celebi can just stall with Recover until the three rounds are up. It pulls the Perish Song job very well with its good defenses. It also allows a stall team to not worry about a last-Pokemon Curse sweep. Giga Drain is a good move but frankly it isn't advisable. Celebi already has a recovery move, and unlike Exeggutor, Celebi is more defensive and should be played as such. An interesting option you could try is Curse coupled with Baton Pass, but it might leave you in a bind when Houndoom shows up.</p> <h1>Checks and Counters</h1> <p>Houndoom and Tyranitar are really the only Pokemon that will take it down with certainty. Espeon can set up Substitute and Growth before passing to a teammate with Flamethrower. Zapdos has a chance to stop it with Drill Peck. Jynx has a good chance too, thanks to the double threat of STAB Ice Beam and Lovely Kiss, and its low HP means Celebi won't regain much with Leech Seed. If Celebi is paralyzed, Heracross and Pinsir make good counters. Charizard may be able to set up a Belly Drum on Celebi, or just nail it with STAB Fire Blast. Really though, Celebi can be hard to take out.</p> ",
    "sets": [{"name": "Standard", "description": "<p>This is a support set and pretty much all that Celebi has going for it in GSC. Heal Bell helps the rest of the team, Recover helps Celebi itself, Psychic gets STAB and uses Celebi's good Special Attack, and Leech Seed can force switches.</p> "}]
  }
}