{
  "Wigglytuff": {
    "sets": [
      {
        "name": "Paralysis-spreading Tank",
        "description": "<p>Wigglytuff is an all-around great Pokemon in NU. With solid defensive stats and a fantastic movepool including moves such as the coveted Thunder Wave, it's a Pokemon that can fit on many teams. Wigglytuff checks many of the stronger attackers in the tier such as Xatu, Dugtrio, and Octillery with its great bulk, and it can cripple Pokemon that can otherwise hurt it, such as Primeape, with paralysis on the switch, meaning it can be a difficult Pokemon to play around. While it is walled by Rock-types and can be overwhelmed by setup sweepers such as Kingler and Stantler, this pink blob should always be considered for defensive and balanced teams alike.</p> <p>The choice of STAB attack comes down to if Wigglytuff wants to support its team or have better offensive use. Double-Edge can 3HKO a lot of common Pokemon in the tier, such as Primeape, Ninetales, and Rapidash, and the recoil is largely offset by Wigglytuff's huge HP stat. Body Slam can spread paralysis while also dealing damage to common Wigglytuff switch-ins, most notably Primeape. Body Slam variants are also much better against fast Pokemon such as Dugtrio due to the paralysis chance and not having to deal with recoil from Double-Edge. Thunder 2HKOes Xatu and Kingler, making it a decent check to these two Pokemon. Rest and Sleep Talk make it a great sleep absorber and give it good longevity.</p> <p>Wigglytuff fits best on defensive and balanced teams and works very well as a lead Pokemon, since it can absorb sleep from common leads such as Stantler. Poison-types such as Weezing and Gloom can help with Wigglytuff's weakness to Fighting-types. Weezing also appreciates Wigglytuff's ability to switch in and check Xatu. Slower Pokemon that appreciate paralysis such as Flareon, Graveler, and Kingler pair well with Body Slam variants. Users of Light Screen and Reflect such as Azumarill can make its job switching in easier; this can also be further supported with a spinner to remove Spikes, such as Pineco. Checks to Magnemite such as Pupitar, Ninetales, and Hitmonlee are also useful teammates.</p> "
      },
      {
        "name": "CurseTuff",
        "description": "<p>One of the most dangerous Pokemon in the tier, Curse Wigglytuff can potentially sweep teams with the right matchup. Wigglytuff's great special bulk and lack of any special weaknesses make it extremely difficult to stop after a single Curse boost. The choice of STAB attack depends on if Wigglytuff wants more power or a chance to inflict paralysis to support its sweep. Sleep Talk is the more consistent option in the third moveslot, making it less of a sitting duck when asleep and hugely helping against Hypnosis users such as Rapidash and Stantler, although Thunder Wave's synergy with Curse is useful, and paralysis can help out Wigglytuff's teammates. Most paralyzed foes are unable to check a Curse-boosted Wigglytuff, so the combination can be difficult to deal with in the absence of Pokemon immune to Thunder Wave, like Graveler and Pupitar.</p> <p>Water-types such as Kingler and Octillery do well as teammates due to their ability to switch in and destroy Rock-types such as Sudowoodo and Graveler. Troublesome Haze users such as Weezing and Arbok can stop Wigglytuff's sweep, so teammates such as Weezing and Gloom can be used to paralyze or remove them with Explosion. Spikes support from Pineco can go a long way in helping Wigglytuff break through Poison- and Rock-types. Poison-types such as Gloom and Weezing also make good partners because they can threaten Primeape, which can potentially remove Wigglytuff despite its boosts with a critical hit Cross Chop. Houndour could also be paired with Wigglytuff to prevent it from being walled by Gastly, although Gastly is a fairly uncommon Pokemon.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "holly", "user_id": 508601}], "teams": [{"name": "Quality checked by", "members": [{"username": "FNH", "user_id": 245982}, {"username": "Earthworm", "user_id": 15210}]}, {"name": "Grammar checked by", "members": [{"username": "Rabia", "user_id": 336073}]}]}
  },
  "Azumarill": {
    "sets": [
      {
        "name": "Miracle Bunny (RestTalk)",
        "description": "<p>Azumarill is a defining Pokemon in GSC NU and easily one of the best defensive Pokemon available thanks to the roles it can perform. With great bulk both physically and specially alongside access to Light Screen, it is an excellent check to the many Fire-types in GSC NU such as Rapidash and Magmar while also being one of the best checks to Dugtrio. It can also safely switch into the best Pokemon in the tier, Xatu, and set Light Screen for its teammates or threaten a 3HKO with Ice Beam. Because of this, it naturally finds itself on defensive teams very commonly. However, it is not without flaws. Azumarill is susceptible to Thief from Pokemon that can lure it in such as Magmar and Dugtrio, which hurts its survivability. Moreover, its relatively low offensive presence can let Pokemon such as Primeape, Kingler, and Lickitung set up on it and threaten it.</p> <p>Surf is mandatory to threaten Fire- and Ground-types. For Azumarill's second move, Light Screen is preferred a lot of the time for its ability to enable key Pokemon such as Kingler to set up more easily as well as letting Azumarill's teammates switch into special attackers more easily; however, Ice Beam crucially lets it defeat Xatu and Fearow in a one-on-one matchup, while Light Screen variants are more susceptible to getting KOed by critical hits against these threats. Ice Beam also hits the dangerous Gloom, which sets up for free against the Light Screen variant, quite hard. Finally, Rest and Sleep Talk give excellent longevity and let it absorb sleep moves from the likes of Rapidash and Stantler. Azumarill pairs exceptionally well with other defensive Pokemon, most notably Gloom and Ninetales. These three form a fierce defensive core that is capable of covering each other's weaknesses exceptionally well, such as Azumarill checking Dugtrio for Ninetales, Gloom checking Primeape for Azumarill, and Ninetales checking Xatu for Gloom and enjoying Light Screen support. Spikes support from Pineco helps Azumarill in longer games and can make its Surf have a more lasting impact against threats such as Primeape. Kingler appreciates Azumarill variants carrying Light Screen, which lets it set up with Swords Dance and trade hits much more easily against Pokemon such as Hidden Power Grass Ninetales, Octillery, and Xatu. Xatu itself pairs well with Azumarill, as it checks some of Azumarill's biggest threats in Kingler and Hitmonlee and can use Haze to eliminate their boosts.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "holly", "user_id": 508601}], "teams": [{"name": "Quality checked by", "members": [{"username": "FNH", "user_id": 245982}, {"username": "Earthworm", "user_id": 15210}]}, {"name": "Grammar checked by", "members": [{"username": "Astra", "user_id": 240732}]}]}
  },
  "Hitmonlee": {
    "sets": [
      {
        "name": "RestTalk",
        "description": "<p>Hitmonlee possesses two very useful qualities that give it a great niche in GSC NU: high Special Defense and high Attack. In combination with RestTalk, they allow it to reliably check special attackers that cannot use physical attacks effectively, such as Dewgong, Chinchou, and Ninetales. The fact that these Pokemon are all very common defensive options means Hitmonlee is granted a large number of opportunities to switch in and either hit something hard or fish for paralysis with Body Slam. Its high Attack and STAB Fighting-type moves also allow it to check Normal- and Rock-types, and it can 2HKO the majority of these with High Jump Kick. If a more offensive approach is desired, Hitmonlee can replace Body Slam for Hidden Power Rock, which can hit Flying- and Bug-types hard. The scarcity of viable Psychic-types makes this the preferred option over Hidden Power Ghost, and the primary target of Hidden Power, Xatu, happens to be weak to both. However, RestTalk Xatu, especially the Drill Peck variant, is still very difficult for Hitmonlee to deal with if healthy, so paralyzing it for a teammate tends to be the more effective approach.</p> <p>Hitmonlee's ability to spread paralysis to an opposing team's checks to Fighting-types gives it great offensive synergy with setup sweepers like Kingler, Primeape, and Lickitung. Removing Xatu outright can also sometimes leave an opposing team without any good response to Hitmonlee. One way to achieve this is to Pursuit trap Xatu with Houndour. If Hitmonlee paralyzes Xatu with Body Slam, it becomes particularly vulnerable to a Houndour with Crunch and Pursuit. Furthermore, Houndour can use Counter to dispatch of a Xatu that tries to fight it with Drill Peck. However, Hitmonlee is not entirely without downsides—Pineco sets up Spikes against it relatively freely and can be difficult to safely deal with. It is a good idea to have a plan in place to try to ensure that Pineco is at least unable to take something down with Explosion after setting up Spikes. Pokemon that resist Normal, such as Sudowoodo, Graveler, and Pupitar, are helpful in this regard. Opposing physical sweepers like Kingler and Primeape also have an advantage over Hitmonlee, so checks to these such as Xatu and Weezing make for desirable teammates.</p> "
      },
      {
        "name": "Setup Sweeper",
        "description": "<p>Hitmonlee can attempt to sweep an opposing team by boosting its already high Attack and then using its strong coverage to overpower foes. Meditate is the best standalone option, as it does not lower Hitmonlee's Speed. However, if Hitmonlee is receiving Speed boosts from a Baton Passer, then Curse can be used to increase both its bulk and damage without sacrificing its Speed advantage. Hidden Power Rock is used to target the nearly omnipresent Xatu, and Double-Edge gives Hitmonlee the most damage possible against Poison-types like Weezing, Arbok, and Gloom. Hitmonlee can also sacrifice a small amount of power against Xatu and other Flying- and Bug-types by running Double-Edge over Hidden Power Rock, which frees up the last slot for Hitmonlee to use a utility move such as Body Slam for paralysis, Rapid Spin to remove Spikes, or Mach Punch for priority. However, this leaves Hitmonlee without any move to hit the rare Gastly, leaving it dependent on teammates with Pursuit such as Houndour.</p> <p>Hitmonlee is generally inferior to Primeape when it comes to the role of setup sweeper due to Primeape's higher Speed and its access to Cross Chop and Rock Slide. Hitmonlee's main advantages over Primeape are its ability to hit Poison-types slightly harder with its neutral attacks and its superior special bulk. This arguably makes Hitmonlee a better receiver of Speed boosts than Primeape, so it is worth considering Baton Passers with Agility, such as Ledian, Farfetch'd, and Ariados, as potential teammates. Hitmonlee is also more suitable to switch into weaker special attacks for its team, whereas Primeape prefers to remain at near full health for as long as it can. It's important to bring a reliable method of handling Xatu when using Hitmonlee, so Pokemon like Ninetales, Mantine, and Magnemite make for useful teammates. Primeape also has a huge advantage over Hitmonlee when the two face off thanks to its potential Cross Chop critical hit OHKO, so Pokemon such as Xatu, Weezing, and Gloom are useful to put the enraged monkey in its place; the latter of the three can also help spread paralysis.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Earthworm", "user_id": 15210}], "teams": [{"name": "Quality checked by", "members": [{"username": "holly", "user_id": 508601}, {"username": "FNH", "user_id": 245982}]}, {"name": "Grammar checked by", "members": [{"username": "Rabia", "user_id": 336073}]}]}
  },
  "Dugtrio": {
    "sets": [
      {
        "name": "Substitute Attacker",
        "description": "<p>Boasting the best Speed in the tier, a not-too-shabby base Attack of 80, and a decent movepool, Dugtrio is a serious threat. Its access to a solid STAB move in Earthquake, coupled with its high Speed, means that only Pokemon that can withstand two hits can switch into it safely. Rock Slide as Dugtrio's first coverage move is a necessity. In a tier dominated by Xatu, the capability to hit Flying-types for solid damage is essential for Dugtrio to properly function and threaten foes. The combination of Earthquake + Rock Slide allows Dugtrio to hit everything in the tier for neutral or super effective damage. Sludge Bomb as Dugtrio's third attack grants it with the ability to hit Grass-types, such as Exeggcute, which otherwise have little to fear from it. Thief can be used over Sludge Bomb to rob bulky foes of crucial passive recovery in Leftovers. Alternatively, Screech allows Dugtrio to prevent opponents from stalling it out by constantly dropping their Defense, which can be useful against bulky RestTalk users and Curse users and has synergy with Spikes. Substitute grants the ability to dish out free hits safely when set up on one of the many switches Dugtrio forces. It allows Dugtrio to power through foes that would otherwise deal heavy damage in return such as Xatu and Exeggcute and reduces the need for Dugtrio to guess which Pokemon will switch in or whether the foe will switch at all.</p> <p>While Dugtrio is the fastest Pokemon in the tier, its base 80 Attack is a far cry from the Attack stats of behemoths like Kingler. To highlight its lack of power, Dugtrio fails to OHKO Ninetales and Rapidash from full health. Furthermore, Weezing and Sudowoodo only take about 54% from Dugtrio's super effective STAB Earthquake. To help bring these Pokemon into Dugtrio's KO range, pairing it with a Spiker such as Pineco is an excellent option. Powerful attackers such as Kingler, Fearow, and Rapidash are all good teammates given that all three are capable of weakening foes with their powerful hits, which further makes Dugtrio's job easier. Sudowoodo can lure in Water- and Grass-types Dugtrio has trouble with and remove them with Self-Destruct. Chinchou is a great partner to complement Dugtrio's defensive shortcomings, as it can take opposing Surfs and Ice Beams, which Dugtrio is weak to, and hit back with its strong STAB Thunder.</p> <p>The biggest flaw to Dugtrio is its lack of raw power and generally poor bulk, so Pokemon that can take advantage of these deficits make for good checks. Bulky Normal-types such as Wigglytuff and Dunsparce take 30% from Dugtrio's Earthquake on average while hitting back with STAB Normal attacks such as Body Slam, Return, and Double-Edge for between 40% and 67%. Xatu can force Dugtrio out despite its faster super effective Rock Slide if Dugtrio isn't healthy and behind a Substitute. Water-types in general are the best answers to Dugtrio. Octillery takes 31-37% from Earthquake while threatening to OHKO back. Dewgong only takes 28-33% from STAB Earthquake while doing 75-88.6% with STAB Surf and Ice Beam in return. Physically bulky attackers like Kingler can potentially set up a Swords Dance boost against Dugtrio without too much to fear. Chinchou is probably the only viable Water-type in the tier that fears Dugtrio.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "FNH", "user_id": 245982}], "teams": [{"name": "Quality checked by", "members": [{"username": "holly", "user_id": 508601}, {"username": "Earthworm", "user_id": 15210}]}, {"name": "Grammar checked by", "members": [{"username": "Kris", "user_id": 241023}]}]}
  },
  "Farfetch’d": {
    "sets": [
      {
        "name": "Baton Pass",
        "description": "<p>Farfetch'd is one of the most dangerous Pokemon in GSC NU when given an opportunity. Agility with Baton Pass is an extremely powerful combination that allows Farfetch'd to pass Speed boosts to huge threats such as Cubone, Machoke, Kingler, and Stantler. These recipients are more than capable of sweeping entire teams if they aren't carefully prepared for. Due to the sheer power of this strategy, most teams will have a Haze user such as Xatu or Weezing that they will use to thwart this strategy. However, unlike other Baton Passers, Farfetch'd comes equipped with STAB Return, which can be used to chip away at these Haze users to get them to the point where they have no choice but to allow you to pass your chosen stat or else be KOed. Swords Dance further amplifies the danger posed by Farfetch'd and can be used to preserve the more valuable HP of the recipient, which would otherwise need to spend a turn setting up an Attack boost, in exchange for taking a hit with Farfetch'd.</p> <p>Apart from the aforementioned recipients, Pokemon such as Hitmonlee, Primeape, and Flareon can also make for adequate recipients. Flareon can also set up additional Growth or Curse boosts to pass along with the Speed boosts from Farfetch'd. Pokemon that can spread paralysis and set up screens, such as Voltorb, Flaaffy, and Bayleef, are also essential teammates for giving Farfetch'd the best possible chance at passing boosts to a teammate. Explosion users are also useful, as they can create a chance for Farfetch'd to enter the battlefield without having to take a hit. Voltorb is great for this purpose and compresses the role of screens user and Explosion user into a single team slot. Weezing and Gastly are also capable of performing this role; Weezing can handle opposing setup attempts adequately with its access to Haze and Explosion, whereas Gastly can null Explosions aimed at preventing Farfetch'd from passing boosts.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Earthworm", "user_id": 15210}], "teams": [{"name": "Quality checked by", "members": [{"username": "holly", "user_id": 508601}, {"username": "Sevi 7", "user_id": 505149}]}, {"name": "Grammar checked by", "members": [{"username": "Rabia", "user_id": 336073}]}]}
  },
  "Weezing": {
    "sets": [
      {
        "name": "Mixed Attacking Tank",
        "description": "<p>Weezing is among the tier's most viable tanks, as its naturally high bulk and access to powerful moves such as Sludge Bomb, Fire Blast, and Thunder make it an unpredictable threat that is hard to deal with. Furthermore, its access to Explosion makes it a literal time bomb, granting it the ability to take down threats with it that might be otherwise unable to defend against or to target its own checks to open up the opponent's defenses for its teammates. Its Poison typing is a blessing and a curse, as Weezing can take advantage of the common presence of Fighting-types like Primeape and Hitmonlee, but it is extremely susceptible to the top threat Xatu's STAB Psychic. Weezing's primary STAB move in Sludge Bomb has a high chance of inflicting poison, which can punish many checks that try to switch into it, such as Xatu, Dugtrio, and Sudowoodo, by setting them on a timer. Thunder similarly has a high chance of inflicting paralysis, which makes Weezing even harder to switch into safely. On top of this, it lands a guaranteed 2HKO on Xatu and also hits bulky Water-types hard.</p> <p>The last move depends on whichever benefit the player would like to have: greater coverage, the ability to stop opposing Pokemon from setting up, or longevity. Fire Blast threatens to KO Pineco from full and becomes guaranteed with any slight chip, preventing it from safely setting up Spikes. Fire Blast also lands an OHKO on Magnemite and does massive damage to Gloom, which can otherwise freely paralyze Weezing with Stun Spore or repeatedly use Curse and force Weezing to sacrifice itself with Explosion to take Gloom out. The combination of Sludge Bomb and Thunder tends to leave Weezing open for Ground- and Rock-types such as Dugtrio and Sudowoodo to come in and threaten it with Earthquake, so Weezing can opt for Hidden Power Water, which hits both for significant damage and OHKOes Graveler, but it comes at the cost of some bulk due to DV requirements. Haze nullifies any attempt at setting up and can shut down a potential sweep from any setup sweeper, such as Wigglytuff, Dunsparce, or Meditate Primeape. Lastly, not having any instant recovery moves can leave Weezing in a difficult spot when repeatedly switching into attacks, especially with Spikes down. Thus, Pain Split is a viable option, since it is the only instant recovery move that Weezing learns and can help to prolong the period of time before it is forced to use Explosion.</p> <p>Some of the Pokemon that benefit the most from having Weezing as a teammate are those that like to have Xatu removed by Explosion, such as Primeape, Hitmonlee, and other Xatu. Primeape, in turn, can threaten the majority of the slower, more defensive Pokemon that Weezing struggles to deal with, such as Pupitar and Sudowoodo. Primeape also threatens Normal-types, especially ones that give Weezing a hard time like Stantler and Wigglytuff, with Stantler having Earthquake and Wigglytuff being able to Curse up and force Weezing to explode on it rather than a different Pokemon like Xatu.  Defensive Pokemon such as Dewgong and Sudowoodo fear the presence of Primeape on the opposing team and benefit greatly from Weezing's solid matchup against it. Dewgong is also a phenomenal switch into Xatu, taking little from its attacks and hitting back hard with Ice Beam while staying healthy with RestTalk. Water- and Grass-types like Octillery or Gloom with a Grass move can threaten Ground- and Rock-types like Dugtrio and Sudowoodo, which are otherwise solid switch-ins to Weezing as if they avoid poison from Sludge Bomb they can comfortably take Fire Blast and Thunder.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "cherryb0ng", "user_id": 421511}], "teams": [{"name": "Quality checked by", "members": [{"username": "Earthworm", "user_id": 15210}, {"username": "holly", "user_id": 508601}]}, {"name": "Grammar checked by", "members": [{"username": "deetah", "user_id": 297659}]}]}
  },
  "Fearow": {
    "sets": [
      {
        "name": "RestTalk",
        "description": "<p>Fearow is a very simple yet solid Pokemon and one of GSC NU's hardest hitters, thanks to its great Attack and a high-Base Power STAB move in Double-Edge. It notably obtains crucial 2HKOs on common Pokemon, such as Primeape, Magmar, and Dugtrio and can be a major threat to teams lacking a Normal-resistant Pokemon such as Sudowoodo or Graveler. Fearow also has excellent Speed, letting it outspeed Xatu and Primeape, two of the tier's most important Pokemon, which can be extremely useful for offensive teams that may struggle with these threats. Its decent bulk alongside an immunity to Spikes means it is able to come in more easily than one might think, as Pokemon such as Xatu fail to 2HKO it without Double-Edge recoil. However, Fearow has a poor matchup against the tier's Normal-resistant Pokemon such as Sudowoodo, Shuckle, Magnemite, and Graveler, meaning it can be a liability at times, as well as struggling against Weezing, one of the most common Pokemon in the tier.</p> <p>Double-Edge is Fearow's strongest STAB and deals solid damage to Pokemon that don't resist it. Drill Peck lets Fearow 2HKO Primeape, Hitmonlee, and Gloom. Alternatively, Hidden Power Ground is an option to OHKO Magnemite, 2HKO Magcargo, and chip Sudowoodo, Graveler, and Pupitar on the switch, although replacing Drill Peck will make Fearow less effective against most foes when using Sleep Talk. Lastly, Rest and Sleep Talk give Fearow much improved longevity when switching into Pokemon such as Xatu while also meaning it can rid itself of crippling paralysis from Pokemon such as Gloom.</p> <p>Fearow is most at home on offensive teams and naturally pairs well with many of the tier's other offensive Pokemon. Spikes from Pineco are useful for exerting more pressure on Pokemon such as Dewgong and Weezing when they switch into Fearow. Dugtrio and Primeape are excellent partners, as they can switch into the Rock- and Steel-types that threaten Fearow, while Fearow can deal well with Gloom for Primeape and Xatu for Dugtrio. Likewise, Octillery is a good answer to Rock-types and can also check Water-types such as Dewgong, if running Hidden Power Electric, as well as Dugtrio. Hidden Power Grass Weezing is able to lure in Graveler and Pupitar and can use Explosion on Dewgong, which is a problematic Pokemon for Fearow. Faster Pokemon, such as Persian and Rapidash, can also be annoying for Fearow, so pairing it with a Pokemon like Octillery or Sudowoodo to deal with these threats is a good idea.</p> "
      },
      {
        "name": "Three Attacks",
        "description": "<p>This set trades the better longevity of RestTalk Fearow for more moveslots, and this Fearow set has a better shot against the tier's Normal-resistant Pokemon. This set provides less team support than the standard RestTalk Fearow and fits onto different kinds of teams, usually ones with paralysis support or other Normal-type Curse users. Fearow can fit Hidden Power Ground much more easily on this set, which lets it OHKO Magnemite while chipping Rock-types like Sudowoodo for decent damage. Fearow can also run Substitute, letting it ease prediction and dodge status like Gloom's Stun Spore. Curse is also an option, as it notably gives Fearow a chance to defeat Graveler and Sudowoodo one-on-one if they switch in. Fearow also outspeeds Pokemon below base 45 Speed after a Curse, such as Graveler, Sudowoodo, Gloom, Octillery, and Wigglytuff. Double-Edge is the preferred STAB move due to its power, which helps to wear down bulky Pokemon such as Weezing and Dewgong, but Return is a fine option for avoiding recoil. Drill Peck notably 2HKOes Pineco and lets Fearow hit Primeape and Gloom harder. Paralysis support is useful with this set, pairing well with Substitute due to the potential full paralysis chance as well as with Curse due to its Speed drop. Pokemon such as Dragonair and Gloom are good at providing this support.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "holly", "user_id": 508601}], "teams": [{"name": "Quality checked by", "members": [{"username": "cherryb0ng", "user_id": 421511}, {"username": "Siatam", "user_id": 175539}]}, {"name": "Grammar checked by", "members": [{"username": "Milak", "user_id": 262594}]}]}
  },
  "Ninetales": {
    "sets": [
      {
        "name": "RestTalk",
        "description": "<p>Ninetales is a phenomenal Pokemon in GSC NU thanks to its excellent defensive and offensive capabilities. Its typing and great Special Defense make it one of the best answers to dangerous special attackers such as Xatu, Magmar, Flareon, and Magnemite, which means it fits very well on more defensive teams, pairing very well with bulky Water-types such as Dewgong and Chinchou as well as with Gloom. Ninetales also walls dangerous Sunny Day teams, which can give most teams trouble with their sheer offensive power. Additionally, it is one of the fastest Pokemon in the tier, notably outpacing fast Pokemon such as Xatu, Primeape, and Magmar while hitting a majority of the tier for solid damage with Flamethrower. However, it struggles a lot with the various bulky Water-types in the tier, such as Dewgong, Octillery, and Azumarill. Its physical bulk can also be rather lacking against stronger physical attackers such as Dugtrio and Primeape. Flamethrower is vastly preferred over Fire Blast due to its better PP and accuracy. Toxic cripples any foe lacking Rest, which includes a lot of the special and physical attackers that Ninetales checks, and forces Pokemon with Rest to use it. Hidden Power Grass can be used instead so Ninetales is not helpless against Water- and Rock-types that have Rest. Reflect can also be used to shore up Ninetales's weaker physical bulk and provide offensive teammates with a setup opportunity. Finally, Rest and Sleep Talk give it incredible longevity, which lets it check threats such as Xatu, Gloom, and Magmar throughout a battle.</p> <p>Bulky Water-types are Ninetales's best partners. Together they form an incredibly potent defensive combo that walls a significant portion of the tier, as Ninetales beats Grass- and Electric-types while Water-types such as Chinchou and Azumarill beat opposing Water-types. However, this pairing gives free setup to one of the most dangerous threats in the tier in Kingler, so Xatu is an essential addition. Gloom and Hitmonlee pair well with Ninetales because it dominates Xatu, which troubles them. In return, Hitmonlee and Gloom check the Water-types that Ninetales struggles against. Pineco fits well on the defensive teams that Ninetales commonly finds itself on, and it can rapidly stack up residual damage when used in tandem with Toxic spread by Ninetales. Pineco can also remove Spikes, which makes it easier for Ninetales to check Xatu.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "holly", "user_id": 508601}], "teams": [{"name": "Quality checked by", "members": [{"username": "FNH", "user_id": 245982}, {"username": "Earthworm", "user_id": 15210}]}, {"name": "Grammar checked by", "members": [{"username": "Rabia", "user_id": 336073}]}]}
  },
  "Gloom": {
    "sets": [
      {
        "name": "Status-spreading Defensive Pivot",
        "description": "<p>Gloom is a fantastic Pokemon in GSC NU due to its ability to play several important roles effectively. Its Grass typing allows it to handle Water-types that commonly run Water- + Electric-type coverage, such as Chinchou and RestTalk Octillery. In doing so, it also provides the user with an excellent opportunity to spread paralysis. The threat of boosting its STAB Sludge Bomb with Curse or Swords Dance can easily force the foe to flee to a counter such as Xatu, a critical target that can be crippled with paralysis from Stun Spore as it switches in. Once paralyzed, if the opponent fails to respect Gloom, it can at times even muster enough power to sweep a crippled team. Sludge Bomb's high chance to inflict poison is also useful for its potential to cripple Pokemon like Magmar and Flareon and can potentially force Xatu to use Rest. On top of this, Gloom also makes for an excellent check to Primeape, one of the tier's most threatening attackers. Even Primeape that run coverage moves for Poison-types usually elect to use Hidden Power Ground to hit Weezing, which Gloom conveniently takes neutral damage from. It is particularly effective at this role with Curse, which can allow it to take on Meditate variants more safely. To allow Gloom to better deal with foes such as Substitute Graveler and Dugtrio, Hidden Power Grass is also a viable option over boosting moves.</p> <p>However, Gloom has some glaring flaws. It is fairly passive and weak before it boosts its stats, which means that Pineco can easily switch in to lay Spikes against it. For this reason, it is advised to use a Pokemon that can withstand Pineco's Explosion alongside Gloom, such as Sudowoodo. RestTalk users such as Ninetales and Xatu can potentially switch into Gloom to regain their health when weakened without having to fear paralysis too much. If not paired with a bulky Water-type like Dewgong, Octillery, or Azumarill, it can struggle against Water-types that have Ice Beam as a coverage move. Furthermore, while Gloom makes for a fantastic Chinchou check, should it become afflicted by paralysis from Thunder or Thunder Wave, it will become a much shakier check to Primeape. One of Gloom's biggest problems is that it struggles with Magnemite, which can be a huge pain to deal with due to the lack of viable Pokemon that can handle a powerful Electric-type attack that is paired with Hidden Power Ice coverage. However, Gloom can adapt to this by using Hidden Power Ground to surprise Magnemite and take it down unexpectedly. This also doubles as a coverage move for Poison-types such as Weezing, Arbok, and the rare Gastly, and it hits Fire-types slightly harder than Sludge Bomb. As Hidden Power Ground is difficult to fit on a set without dropping Moonlight, an alternative solution to the Magnemite problem is to use a sturdy Fire-type such as Ninetales to take on the cyclopean magnet. Pokemon that can take advantage of Gloom's ability to spread paralysis, such as Swords Dance Kingler, Curse Sudowoodo, Curse Stantler, Substitute Primeape, and Graveler, also make for good teammates.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Earthworm", "user_id": 15210}], "teams": [{"name": "Quality checked by", "members": [{"username": "holly", "user_id": 508601}, {"username": "cherryb0ng", "user_id": 421511}]}, {"name": "Grammar checked by", "members": [{"username": "Rabia", "user_id": 336073}]}]}
  },
  "Primeape": {
    "sets": [
      {
        "name": "Physical Sweeper",
        "description": "<p>With Meditate, Primeape can raise its sweeping potential to near unwallable levels. Cross Chop is Primeape's default STAB move, as it not only hits nearly everything for neutral damage, but it also has high odds to score a critical hit, making switching into it even more difficult. Rock Slide is mandatory, as it not only gives crucial coverage against Xatu, but its flinch chance can potentially be game-changing, especially with Primeape's Speed tie with Xatu. Finally, Primeape can either choose a coverage move to run or Substitute; the latter allows it to take advantage of low-accuracy moves and paralyzed foes, avoid status moves, and create opportunities to use Meditate safely. Thunder allows it to hit Xatu harder and can inflict paralysis to avoid the Speed tie, but it also comes with worse accuracy than Rock Slide, while Hidden Power Ground hits Weezing and Arbok. Double-Edge can be utilized as well for a strong neutral attack to hit Pokemon such as Gloom. However, since Primeape's frailty is often exposed as its biggest weakness, Substitute is most often the recommended choice.</p> <p>Since Primeape is the most popular and dangerous sweeper in the GSC NU tier, it is a natural fit on offensive and balanced teams. That said, it does struggle against other top-tier threats, namely Xatu and Weezing. Dewgong, Magnemite, and Ninetales are excellent partners for their ability to ward off Xatu. Sudowoodo is a particularly excellent partner, as it not only takes on Weezing for Primeape, but also has Self-Destruct to make Primeape's sweep much easier. Even if Primeape cannot fully sweep, it can still leave the opponent's team battered for late-game cleaners like Dugtrio, Kingler, and Magmar.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Gamer1234556", "user_id": 515642}, {"username": "FNH", "user_id": 245982}], "teams": [{"name": "Quality checked by", "members": [{"username": "Earthworm", "user_id": 15210}, {"username": "holly", "user_id": 508601}]}, {"name": "Grammar checked by", "members": [{"username": "deetah", "user_id": 297659}]}]}
  },
  "Rapidash": {
    "sets": [
      {
        "name": "Offensive",
        "description": "<p>With incredible Speed and offensive prowess, Rapidash is a top tier Pokemon in GSC NU. Using Rapidash as a lead capitalizes on its offense and Hypnosis, which can turn the tables against slower leads such as Stantler, but it alternatively can stay in the back as an attacker. Fire Blast is the STAB move of choice, potentially 3HKOing even Wigglytuff, easily 3HKOing Xatu, and OHKOing Magnemite and Pineco. Flamethrower is another option that offers better accuracy and more PP. However, the loss of power means that it can no longer reliably break through foes such as Xatu and Wigglytuff. Double-Edge is Rapidash's usual secondary attack, helping it hit Fire-types that typically wall it. Body Slam trades power for paralysis support, which can help slower Pokemon such as Graveler. Substitute can be used to block predicted status moves from foes such as Rapidash, Ninetales, Dunsparce, and Dragonair. Sunny Day and Hidden Power Grass are also viable, as Sunny Day can be utilized to power up Fire-type moves so that they 2HKO bulky foes like Wigglytuff and even flip the matchup against Dewgong into Rapidash's favor, while Hidden Power Grass deals solid damage to Rock-types that resist Fire- and Normal-type attacks.</p> <p>Despite Rapidash's excellent power, Octillery and Azumarill are able to consistently come in on it with little to fear. Grass-types like Exeggcute and Gloom make great partners for their ability to sponge Water- and Ground-type attacks. Chinchou makes for an excellent partner by resisting common Water- and Ice-type attacks from Water-type Pokemon. Ninetales is also problematic and capable of walling Rapidash. Something that can deal with Ninetales and Sudowoodo, such as Dewgong, Chinchou, or Octillery, is recommended as well. Ninetales does struggle against Substitute variants of Rapidash, though, as it generally only runs STAB Flamethrower as an attack, which can't break Rapidash's Substitute. Primeape is also good to threaten Rock-types and help break through Water-types.</p> "
      },
      {"name": "RestTalk", "description": "<p>This set blends Rapidash's offensive capabilities with the longevity provided by RestTalk. The combination of Fire Blast and Double-Edge gives Rapidash two high-Base Power moves that have solid coverage, while giving it guaranteed good Sleep Talk rolls against threats such as Xatu. Hidden Power Grass is useful for chipping Water- and Rock-types. Body Slam is also viable, trading damage for paralysis support. With its very high Speed and consistent damage output, Rapidash has a great matchup against most Fire-types and fast Pokemon in the tier, most notably Xatu. On top of this, using RestTalk allows it to switch into foes that threaten to induce status, such as Gloom, with less hesitation.</p> "}
    ],
    "credits": {"writtenBy": [{"username": "FNH", "user_id": 245982}, {"username": "holly", "user_id": 508601}], "teams": [{"name": "Quality checked by", "members": [{"username": "Sevi 7", "user_id": 505149}, {"username": "cherryb0ng", "user_id": 421511}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Magnemite": {
    "overview": "<p>Due to Magnemite's amazing Steel typing, high Special Attack, and difficult-to-resist STAB Thunder, it can make for an excellent long-term defensive answer to Xatu and Fearow that's capable of repeatedly switching in on them to fire off attacks, battering away at the opposing team. On the surface, Magnemite may seem difficult to justify over its fellow Electric-type, Chinchou, which is much faster, has STAB-boosted Surf, and resists Water, allowing it to switch into Octillery and Dewgong unlike Magnemite with its low Special Defense. The primary reason for Magnemite's use is that it is arguably one of the best answers to Xatu and Fearow, two of the strongest and most dangerous offensive forces in the tier; it also answers Persian remarkably well. However, Magnemite is plagued by common Pokemon that take advantage of its weaknesses, such as Ninetales, Rapidash, Dugtrio, and Primeape. Magnemite isn't completely helpless against these threats, though, as Thunder paralysis is extremely crippling and Dugtrio does not want to repeatedly switch into Magnemite in fear of Hidden Power Ice. However, Magnemite has some severely crippling and unavoidable issues, namely Thunder's poor 70% accuracy and often being forced into predicting what the right move to use is, such as whether to use Thunder on the Octillery right in front of it or Hidden Power Ice to hit the Dugtrio that may come in.</p> ",
    "comments": "<h1>Other Options</h1> <p>Thunderbolt is an option over Thunder to more reliably check threats like Stantler and Kingler that can take advantage of a miss, but it makes Magnemite weaker against Wigglytuff, and the lower power and paralysis chance are undesirable. Reflect can be used over Hidden Power Ice to assist with a team's ability to switch into threats that take advantage of Magnemite, like Dugtrio and Stantler; however, Magnemite completely loses out on the ability to harm foes like Dugtrio and Gloom that resist Electric, and Reflect generally does very little when called by Sleep Talk.</p> <h1>Checks and Counters</h1> <p><strong>Ground-types: Ground-types such as Dugtrio punish Magnemite for using Thunder and can come in freely to scare it out and deal damage. Dugtrio also packs Substitute, which uses the turn given to hide behind cover and ease prediction; however, Dugtrio takes quite a lot of damage from Hidden Power Ice and does not want to repeatedly come in, especially with Spikes on the field or when the opponent has a healthy Octillery or Dewgong to handle it. Due to the way Magnemite can often be forced into using Hidden Power Ice to not let Ground-types in for free, other Pokemon can use that to come in and threaten Magnemite, improving on a team's ability to play around Magnemite. Pupitar and Graveler can also handle Magnemite, though Pupitar is generally niche and uncommon, while Graveler is slower than Magnemite and has even worse Special Defense than Dugtrio.</p> <p><strong>Fire-types: Ninetales counters Magnemite, as it is bulky to the point where it can almost avoid a 3HKO from Thunder, is faster, packs Rest and often Sleep Talk to heal off any damage or paralysis, and has STAB Flamethrower to melt Magnemite; however, Ninetales can still be afraid of switching straight into a Thunder with Spikes up, as if it gets paralyzed, it may be in range of another Thunder. Rapidash is a very similar story, though it has less bulk, instead being more offensively dangerous to compensate and even directly taking advantage of opposing Ninetales attempting to switch into Magnemite to fire off a strong Double-Edge and potentially overwhelm the opponent’s answers to Rapidash, primarily Octillery and Dewgong. Magmar and Flareon do not pack recovery moves, so they are less eager to switch into Thunder but are much more offensively dangerous than either Rapidash or Ninetales.</p> <p><strong>Super Effective Moves: Primeape and Hitmonlee are able to come in easily on Hidden Power Ice and outspeed and OHKO Magnemite with Cross Chop and High Jump Kick. Primeape can even use Substitute to take advantage of the free turn given by Magnemite switching out. Meanwhile, Hitmonlee has RestTalk to heal off any damage or paralysis. However, Primeape is 2HKOed by Thunder and utterly despises paralysis, while Hitmonlee can easily be chipped into 2HKO range of Thunder and also doesn't enjoy paralysis. Weezing has easy entry on Hidden Power Ice and can tank a Thunder or two—bar if it is paralyzed—and is both faster and often uses Fire Blast for Magnemite, though coming in on it repeatedly wears Weezing down quickly, especially if it eats a Thunder, and Weezing is often forced into choosing the right move on the switch in fear of giving free entry to Xatu or Dugtrio. Stantler has Earthquake to deal with Magnemite, is faster, and almost always uses Light Screen + Curse or RestTalk to improve on its longevity and threat level, though it takes massive damage from Thunder on the switch and, if paralyzed, may fall to a second Thunder. Kingler, and occasionally other Pokemon like Gloom, can use Hidden Power Ground to deal with Magnemite. Kingler even runs Substitute often, which takes advantage of any Rest, Hidden Power Ice, or Thunder miss pulled by Sleep Talk, and it is much faster than Magnemite and learns Swords Dance to become a major threat to boot. However, Kingler cannot switch directly into Magnemite in fear of being OHKOed by Thunder.</p> ",
    "sets": [
      {
        "name": "RestTalk",
        "description": "<h1>Set Description</h1> <p>Thunder is preferred to Thunderbolt to hit switch-ins harder; it 2HKOes Rapidash and Stantler after Spikes, hits Octillery and other Electric-weak targets for a potential OHKO, more reliably paralyzes foes, and is capable of 3HKOing bulky Normal-types like Wigglytuff. Hidden Power Ice is the best coverage option Magnemite has to hit Pokemon that resist Electric such as Dugtrio, Graveler, and Gloom, and it also provides a second way to hit Flying-type Pokemon with perfect accuracy or while using Sleep Talk. RestTalk keeps Magnemite healthy throughout the course of a game to take advantage of its useful defensive typing, primarily making it a strong long-term check to Xatu, Fearow, and Persian that can consistently use them as an opportunity to fire off Thunder.</p> <h1>Team Options</h1> <p>Magnemite's favorite partner is Xatu, which can cover for Pokemon that can threaten Magnemite, including Weezing, Primeape, and Dugtrio; in return, Magnemite can defeat Wigglytuff, Fearow, and Porygon. Magnemite adores Pineco's Spikes because its main answers, Dugtrio, Rapidash, and Ninetales, all take damage from Spikes, wearing them down and making it easier for Magnemite to muscle through them over time, especially with paralysis from Thunder. Both Graveler and Pineco can use Rapid Spin to clear opposing Spikes so that Magnemite doesn't take damage itself. Ninetales and Rapidash take on Fire-types like opposing Ninetales and Magmar as well as other Magnemite, which Magnemite can struggle with. Magnemite appreciates Rapidash especially, as it can severely threaten Ninetales and forces Water-types like Octillery and Dewgong to use Rest often, giving Magnemite a potential free entry to fire off an attack. Octillery and Dewgong are also prime candidates for partnering with Magnemite, being roadblocks for Dugtrio and acting as better checks to other Octillery and Dewgong than Magnemite, as it does not resist Water and thus takes significant damage from Surf. Weezing and Fearow both handle Primeape and Hitmonlee and assist with pressuring Stantler. Fearow also forces Octillery and Dewgong to use Rest more often, providing entry points for Magnemite, similarly to Rapidash. Primeape and Hitmonlee themselves also enjoy Magnemite's presence, as it can cover for their weaknesses to Xatu and Fearow while in return threatening Stantler. Hitmonlee additionally deals with Octillery, Dewgong, and Chinchou well. Dugtrio also synergizes well with Magnemite, threatening Fire-types like Rapidash and Ninetales and appreciating its ability to take on Xatu and pressure Octillery.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "BeeOrSomething", "user_id": 583728}], "teams": [{"name": "Quality checked by", "members": [{"username": "Togkey", "user_id": 400664}, {"username": "Estarossa", "user_id": 461329}]}, {"name": "Grammar checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}, {"username": "UT", "user_id": 523866}]}]}
  },
  "Dewgong": {
    "sets": [
      {
        "name": "RestTalk",
        "description": "<p>With solid special bulk, an excellent STAB combination, and good utility moves, Dewgong is an excellent tank in NU. Its dual STAB combination of Surf and Ice Beam keeps a large chunk of the metagame at bay, dealing at least neutral damage to all Pokemon that aren't Water-types while threatening passive Water-types with an Ice Beam freeze. It also hits a wide variety of common threats super effectively, including Xatu, Magmar, Rapidash, Pupitar, Dugtrio, and Gloom. Dewgong is one of the most solid answers to Xatu, the top threat of NU, as it is only 5HKOed by Psychic and threatens a 2HKO against Xatu with Ice Beam, which most specially bulky Pokemon cannot hope to achieve. The combination of Rest and Sleep Talk gives it longevity, the ability to absorb status, and a chance to damage any check that might try to take advantage of its sleep turns to switch in. Dewgong can also run Hidden Power Electric or Hidden Power Grass to deter Water-types. The former deals a heavy blow to Mantine, while the latter chips the threatening Chinchou. However, while they are useful against Kingler and its low Special Defense, they are typically inferior to the standard attacks, as bulkier Water-types like Dewgong and Azumarill just shrug them off regardless, and losing a STAB move makes Dewgong a liability against either Fire- or Grass-types.</p> <p>Dewgong and Gloom synergize with each other very well; while Gloom can deal with threatening Pokemon Dewgong can't handle such as Primeape, Hitmonlee, and Chinchou, Dewgong is able to threaten Xatu and opposing Fire-types that can 2HKO or OHKO Gloom. Its ability to switch into Xatu makes Dewgong a good supporting Pokemon for Fighting-types like Primeape, a very dangerous sweeper that typically wants to avoid Xatu. Dewgong requires support in the form of an offensive presence towards the Pokemon that tend to take advantage of it. Xatu's STAB Psychic functions as a deterrent for Water-types like the threatening Kingler that can endure Dewgong's STAB moves and set up with Substitute and Swords Dance. Dewgong's moveset and defensive traits won't quite cut it on their own to stop the metagame's physical Normal-types from running over a team. Stantler and Fearow have a high damage output and outspeed Dewgong, while Lickitung, Dunsparce, and Wigglytuff can withstand a few attacks and slowly set up with Swords Dance or Curse. It's only natural that Normal-resistant Pokemon can come to its aid. Sudowoodo can take a few hits from Stantler and non-Belly Drum Lickitung and threaten to remove them with Self-Destruct. Shuckle is another valid option due to its phenomenal defenses and typing, which let it sit in on anything that Normal-types may throw at it and stall them out. One of Dewgong's key flaws is its weakness to Rock-type attacks, so it can be effective to pair Dewgong with another Water-type, such as Kingler or Octillery.</p> "
      },
      {
        "name": "Toxic Support",
        "description": "<p>GSC NU's fast-paced metagame can sometimes leave Dewgong with RestTalk lagging behind: Curse Normal-types can set up in its face, Kingler easily takes advantage of it, and even Fire-types can set up Sunny Day in its face to take reduced damage from an already fairly weak Surf. Nevertheless, Dewgong can make use of its bulk and unique movepool to punish some of its more audacious foes. Many of the Pokemon that can take advantage of Dewgong, such as Primeape, Kingler, Sneasel, and Sunny Day Magmar, despise getting poisoned. Ice Beam as the chosen STAB move allows Dewgong to threaten Xatu and Gloom while using Toxic to put pressure on most everything else. Protect lengthens Dewgong's lifespan and has good synergy with Toxic while also granting the player a chance to scout moves. Certain variants of Toxic Dewgong may include Surf as a means to threaten Magnemite and RestTalk Sudowoodo, which can otherwise take advantage of Dewgong. Encore is used to punish setup Pokemon and other foes that think they can take advantage of Dewgong, such as Kingler, Wigglytuff, and Sunny Day Fire-types. Dewgong can even switch into Surf from Chinchou and prevent it from using Thunder on the next turn thanks to its higher Speed stat. Rest can work even without Sleep Talk, as Dewgong can withstand a few hits from foes such as Xatu and Octillery. This makes Dewgong a bit less susceptible to status, but sleep makes it easier to take advantage of, so Protect is preferred in most circumstances.</p> <p>Of all the support Pokemon that Dewgong likes to pair with, Gloom is definitely one of the better options. Gloom is immune to Toxic and resists all STAB moves from two of the biggest threats to Dewgong, Primeape and Chinchou. Gloom and Dewgong form a very solid defensive core to counterbalance the common Xatu + Fire- and Fighting-type offensive archetypes, and an even greater synergy forms when Ninetales is added to the mix. Ninetales is a specially bulky Pokemon that can help defend against Xatu if Dewgong is low on health, hinders Sunny Day teams by virtue of its typing, and has Roar to shut down any Baton Pass users that may switch into Gloom, such as Flareon and Ledian. Since Dewgong's lack of Surf can make it weak to opposing Rock-types and incapable of threatening Magnemite, the only Steel-type in the tier with access to a powerful Thunder, Pupitar can be effective to initially check these threats. Weezing is another solid teammate that can take on Primeape and has Haze to prevent setup sweepers from breaking through the defensive core. It has solid offensive coverage in Fire Blast and Thunder and can take potential threats down with Explosion. Other Pokemon that like Dewgong's support are Hitmonlee and Xatu. Dewgong can handle Xatu for Hitmonlee, which can remove Spikes with Rapid Spin and also take on Chinchou for it. Xatu benefits from Dewgong defending against faster Pokemon like Dugtrio and Rapidash, while it can use its STAB Psychic to threaten Fighting-types like Hitmonlee and Primeape, dangerous threats such as Kingler, and Weezing, which might use Explosion to remove Dewgong. Pineco grants offensive utility with Spikes to a team that might rely too heavily on stalling out the opponent. Reflect also allows Pineco to support its team against the aforementioned Fighting-types, and Rapid Spin can keep Dewgong from being worn down by Spikes.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "cherryb0ng", "user_id": 421511}], "teams": [{"name": "Quality checked by", "members": [{"username": "holly", "user_id": 508601}, {"username": "Earthworm", "user_id": 15210}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Kingler": {
    "sets": [
      {
        "name": "King Krab (RestTalk)",
        "description": "<p>Kingler's bread-and-butter set. Swords Dance boosts Kingler's already absurd base 130 Attack to levels otherwise scarcely seen in GSC NU, allowing it to become a terrifying threat with few counters. Traditional wisdom would suggest that a mono-attacking Swords Dance user would be easily walled, but the lack of Ghost- and Steel-types available in GSC NU and the threat of a possible Surf prior to its full set being revealed allow Kingler to pull it off quite effectively. Frustration is an adequately high-powered attack that deals more than enough damage to most foes after using Swords Dance. Double-Edge brings greater power but at the cost of having to use Rest earlier. Moreover, the recoil can turn uncertain 2HKOs from faster Pokemon such as Xatu into guaranteed 2HKOs. However, a major benefit to Double-Edge is that it always OHKOes Chinchou after using Swords Dance, whereas Frustration only does 10% of the time. RestTalk allows Kingler to take strong hits from foes such as weakened Xatu and Magmar in exchange for KOing them and recovering its health later on against a more passive foe. It also allows Kingler to wall foes such as Stantler and Hitmonlee should such a need arise.</p> <p>Spikes support for Kingler is useful, helping it break through opposing Pokemon that can threaten to KO back such as Chinchou. Pineco is a useful partner to lay Spikes and help keep them off the field and can also threaten Xatu with Explosion. Rock-types such as Pupitar, Graveler, Corsola, and Sudowoodo take little damage from mono-attacking Kingler and typically have Curse or at least Self-Destruct or Explosion to take it down. However, until Kingler's moveset is revealed, these Pokemon are very risky Kingler checks, which can play to its advantage. Fast and powerful special attackers such as Xatu and Magmar can prey on Kingler's poor Special Defense and give it trouble. Xatu also has access to Haze, which can halt a potential sweep from Kingler. Magnemite is very capable of checking mono-attacking Kingler with its STAB Thunder and doesn't take much in return from Frustration, although it must be wary of Hidden Power Ground sets, so it will rarely be the first port of call when responding to Kingler. Weezing can give Kingler trouble with its excellent defenses and access to Thunder and Explosion.</p> "
      },
      {
        "name": "Substitute Krab",
        "description": "<p>Kingler is one of the best Pokemon in the tier at taking advantage of passive Pokemon like RestTalk Azumarill and RestTalk Ninetales. However, if it lacks coverage attacks, it is easily walled by Pokemon that resist Normal, such as Sudowoodo, Magnemite, and Shuckle. This set looks to alleviate this problem by adding a coverage move. Frustration is its primary attack, capable of hitting everything that isn't a Rock-, Steel-, or Ghost-type very hard. Double-Edge can be used over Frustration for more immediate power but at the expense of the recoil potentially reducing Kingler's ability to execute a full sweep. Body Slam is another option that turns Kingler into more of a self-supporting sweeper and team player, but the power drop is quite significant—+2 Double-Edge is a guaranteed OHKO against Chinchou, whereas +2 Body Slam never OHKOes. It should also be noted that without RestTalk, Kingler can struggle to find safe opportunities to switch in, meaning that it might struggle to find a second opportunity to set up and sweep after landing a Body Slam paralysis. Hidden Power Ground is the preferred coverage attack, and it allows Kingler to hit Magnemite, which would otherwise wall it, while still hitting most Rock-types for super effective damage. However, Surf is also a valid option, hitting Shuckle super effectively and significantly threatening most other Rock-types without having to boost its Attack. Despite Kingler's pathetic Special Attack, its Surf is still capable of 2HKOing Sudowoodo and OHKOing Rock / Ground types such as Pupitar. Swords Dance is used to boost Kingler's already high Attack, helping it power through foes. Substitute is utilized to prevent status from being inflicted on Kingler and to block Explosion from foes such as Pineco. It also punishes switches, can be used to fish for Thunder misses from Pokemon such as Magnemite, Weezing, and Chinchou, and takes advantage of sleeping, frozen, and paralyzed Pokemon. Finding an opportunity to put up a Substitute can swing the matchup against Xatu and Magmar, which outspeed and 2HKO Kingler.</p> <p>Should Kingler run Surf, teammates that can take advantage of Corsola, such as Exeggcute and Chinchou, or Pokemon that can lure it, such as Hidden Power Grass Fearow, Hidden Power Grass Flareon, and Hidden Power Grass Pineco, are good teammates. Xatu is still a threat, so Pokemon that can inflict paralysis against it, such as Gloom, Body Slam Hitmonlee, Thunder Primeape, and Thunder Wave Wigglytuff, make for good teammates. The primary threats to Kingler in general are special attackers looking to exploit its lackluster Special Defense stat. Ninetales pairs well here, as it can stall Xatu out and is a great special tank in general. Chinchou and Magnemite are both problematic to the Surf variant, as they can each take a +2 Frustration and OHKO in return with STAB Thunder. Teammates that can deal with both Magnemite and Chinchou, such as Hitmonlee, are helpful for Kingler. Lastly, this set offers great wallbreaking potential, so speedy offensive Pokemon that can capitalize on weakened foes such as Rapidash, Fearow, and Dugtrio make for good teammates.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "FNH", "user_id": 245982}], "teams": [{"name": "Quality checked by", "members": [{"username": "holly", "user_id": 508601}, {"username": "Earthworm", "user_id": 15210}]}, {"name": "Grammar checked by", "members": [{"username": "Rabia", "user_id": 336073}]}]}
  },
  "Magmar": {
    "sets": [
      {
        "name": "Special Sweeper",
        "description": "<p>Magmar is one of the best offensive Pokemon in GSC NU. It can be difficult to wall without Ninetales due to its excellent coverage, letting it hit a lot of the tier quite hard. Magmar also brings decent defensive utility to its team thanks to its usable Special Defense, which means Magmar is notably only 4HKOed by Xatu's Psychic. Magmar is also quite fast for the tier, outpacing threats like Kingler and Hitmonlee. However, Magmar does face competition from other Fire-types that bring more to a team; Ninetales brings huge defensive potential, and Rapidash is an incredibly fast lead with Hypnosis. Magmar's STAB Fire Blast threatens to 2HKO a large portion of the tier, notably Xatu, and can be powered up even more with Charcoal. Thunder Punch damages Water-types such as Azumarill, Kingler, and Mantine quite a lot and gives Magmar coverage for Flying-types without having to risk a Fire Blast miss. Alternatively, Magmar can run Thief over Thunder Punch on more offensive teams to help out its hard-hitting teammates by stealing valuable Leftovers from bulky Pokemon such as Dewgong. Hidden Power Grass is generally preferred over Cross Chop, since it hits Rock-types such as Sudowoodo, Pupitar, and Graveler hard; however, Cross Chop heavily threatens Dewgong, damages Wigglytuff and Dunsparce harder than Fire Blast, and has a chance to land a critical hit through the Normal-types' Curse boosts. Hidden Power Ground hits opposing Fire-types hard while also 2HKOing Chinchou after Spikes damage. Lastly, Sunny Day powers up Magmar's Fire Blast to a staggering degree, notably 2HKOing even the incredibly bulky Dewgong and lowering the power of Water moves aimed at Magmar. Sunny Day is best used alongside other offensive Fire-types such as Rapidash and Flareon.</p> <p>Magmar pairs well with Water-types, most notably Chinchou, which beats the Water- and Fire-types that can beat Magmar one-on-one; in return, Magmar beats the Grass-types that wall Chinchou. Pokemon with Explosion or Self-Destruct such as Weezing and Sudowoodo can try to take out bulky Water- and Fire-types that give Magmar trouble. Magmar also pairs well with other fast offensive Pokemon such as Fearow, Xatu, and Primeape to overwhelm the opponent's defensive core with Spikes down, as they can force the defensive Pokemon to switch around and take chip damage, which can leave the opponent's team weakened enough to be cleaned up. Finally, Magmar makes for a very good recipient of Baton Pass, especially Growth passes from Flareon.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "holly", "user_id": 508601}], "teams": [{"name": "Quality checked by", "members": [{"username": "Earthworm", "user_id": 15210}, {"username": "FNH", "user_id": 245982}]}, {"name": "Grammar checked by", "members": [{"username": "deetah", "user_id": 297659}]}]}
  },
  "Porygon": {
    "sets": [
      {
        "name": "Defensive Duck",
        "description": "<p>Porygon is a very simple Pokemon in its role as a paralysis spreading Normal-type. The combination of Thunder Wave, Double-Edge, and Curse lets Porygon beat a surprisingly wide variety of threats while it keeps itself healthy with its 32 PP Recover. A lack of weaknesses and decent Special Defense let Porygon potentially sweep through teams lacking a Rock-type or Gastly. However, Porygon is very susceptible to status, and it faces competition from Dunsparce, which is bulkier and has a higher Attack stat. Double-Edge 2HKOes many common defensive Pokemon after a Curse boost, such as Xatu, Chinchou, Ninetales, and Hitmonlee. Thunder Wave pairs well with Curse and Recover, slowing down opposing Pokemon so Porygon can outspeed them even after a few Speed drops from Curse. Recover is Porygon's main draw, giving it excellent longevity, and its ability to use Recover against a paralyzed Pokemon until it gets fully paralyzed is incredibly useful. Curse turns Porygon into a threatening sweeper and makes it difficult to take down for any physical attacker. If Porygon wishes to be more immediately threatening to Flying-types such as Xatu, it can run Ice Beam over Curse. This also prevents it from being walled by Graveler and non-Rest Sudowoodo.</p> <p>Slower wallbreakers such as Kingler, Weezing, Graveler, and Cubone greatly appreciate Porygon's reliability at spreading paralysis. Primeape can break through the Rock-types that Porygon struggles with while also appreciating paralysis support, especially if Porygon manages to paralyze Xatu. Although a niche Pokemon, Snubbull can remove any status conditions inflicted on Porygon with Heal Bell. Xatu is a useful teammate for checking Fighting-types, particularly Primeape, which can OHKO Porygon through its Curse boosts with a critical hit Cross Chop. Ninetales checks Xatu well and can switch into status moves aimed at Porygon. Finally, Houndour can easily remove the only Ghost-type in the tier, Gastly, and greatly benefits from Xatu being paralyzed, which lets it Pursuit trap Xatu much more reliably.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "holly", "user_id": 508601}], "teams": [{"name": "Quality checked by", "members": [{"username": "Earthworm", "user_id": 15210}, {"username": "Sevi 7", "user_id": 505149}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Dragonair": {
    "sets": [
      {
        "name": "Offensive Paralysis Spreader",
        "description": "<p>Dragonair has a very unique place in GSC NU by virtue of its excellent movepool and completely exclusive Dragon typing. Its coverage is among the best in the tier, which allows it to punish teams that lack bulky Normal-types and spread paralysis to a variety of foes. Its Dragon typing also gives it useful resistances to Fire, Water, and Electric, letting it take on key metagame threats such as Rapidash, Magmar, and Magnemite. Dragonair works quite well as a lead, taking on Rapidash leads and spreading paralysis early in the game, while its coverage lets it act as an anti-lead against Pokemon like Pineco. Access to Light Screen and Reflect can also be useful for teams with setup Pokemon such as Farfetch'd and Lickitung. Unfortunately, Dragonair is not very bulky, so any strong attacker that can hit it neutrally can 3HKO it. Its low Special Attack also means that it struggles to break past foes that aren't weak to its coverage moves, such as Wigglytuff and Lickitung, and as such foes commonly use Rest, they aren't as afraid of Thunder Wave. While Dragonair resists Thunder from Pokemon like Chinchou and Magnemite, it doesn’t appreciate Thunder paralysis, and its lack of recovery leaves it susceptible to Toxic and being worn down by Spikes.</p> <p>Thunder Wave is very useful for crippling faster Pokemon such as Stantler and supporting slower teammates, while Thunderbolt or Thunder is useful for hitting Pokemon like Xatu, Kingler, Dewgong, and Octillery. The choice between Thunderbolt and Thunder comes down to consistency versus power. Surf hits Graveler, Pupitar, Dugtrio, and Fire-types quite hard, and Fire Blast hits Pineco, Magnemite, and Gloom. Thunder Wave in the first slot and Thunder in the last slot is the standard, but if not running Thunder Wave then one of Light Screen or Reflect is an option in the last slot. Screens support is very useful for powerful setup Pokemon such as Farfetch'd, Kingler, and Curse Stantler, as they lack the bulk to take strong hits otherwise.</p> <p>Dragonair fits quite well on offensive teams, especially those with slower wallbreakers such as Lickitung, Flareon, Graveler, and Kingler that appreciate paralysis support. Baton Pass teams highly appreciate Dragonair's excellent supporting capabilities with Light Screen, Reflect, and Thunder Wave, so it commonly appears on those teams. Another good way of using Dragonair is as a Growth pass recipient due to its excellent coverage and unique resistances, meaning Flareon is a good partner. Chinchou is a good partner for Dragonair, as Dragonair can struggle against Water-types such as Dewgong and Ice Beam Octillery, even if running Thunder. Hitmonlee and Primeape are good partners, as they threaten bulkier Normal-types that Dragonair struggles against such as Wigglytuff and Lickitung. Dragonair can also paralyze Gloom and Weezing to help the Fighting-types have a better shot getting past their checks.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "holly", "user_id": 508601}], "teams": [{"name": "Quality checked by", "members": [{"username": "cherryb0ng", "user_id": 421511}, {"username": "Earthworm", "user_id": 15210}]}, {"name": "Grammar checked by", "members": [{"username": "Muk", "user_id": 33374}]}]}
  },
  "Chinchou": {
    "sets": [
      {
        "name": "Chinchou Gang! (RestTalk)",
        "description": "<p>As one of the few Electric-types in the tier, Chinchou holds an incredible niche as one of the best anti-metagame Pokemon. Thanks to its typing, Chinchou is a mainstay on defensive teams and is able to check many top metagame threats, including Dewgong, Rapidash, Ninetales, and Octillery. Chinchou's decent Special Defense and lack of a weakness to Ice or Electric alongside its resistance to Water give it enviable role compression and allow it to check Water-types that are otherwise nearly impossible to wall reliably. Because of this, Chinchou is easily one of the most splashable Pokemon in the GSC NU tier. On top of this, Chinchou's dual STAB attacks pair very well together, as Thunder smacks the common Water-types in the tier and threatens even Pokemon that resist it with paralysis, while its Water-type STAB options hit Ground-, Fire-, and Rock-types for heavy damage, although Grass-types as well as the semi-uncommon Dragonair resist both of Chinchou's STAB moves. Chinchou is also deceptively fast, outspeeding nearly all of the relevant Rock- and Ground-types that threaten it with Earthquake, bar Dugtrio. Rest and Sleep Talk give Chinchou good longevity and let it absorb Hypnosis from the likes of Rapidash and Persian. However, its low overall stats are a huge hindrance, as most physical attackers easily 2HKO Chinchou and it doesn't hit very hard against non-super effective targets.</p> <p>Chinchou's role of dominating bulky Water- and Fire-types greatly helps Pokemon that struggle with said threats; many top-tier offensive Pokemon such as Dugtrio, Xatu, and Fearow struggle to break past Dewgong in particular, so they greatly benefit from Chinchou's ability to wall and threaten it. Chinchou also greatly appreciates being paired with physically bulky Pokemon such as Weezing and Azumarill, since they can reliably switch into the common physical attackers that scare out Chinchou. Xatu is also one of Chinchou's best partners, since they can beat each other's checks—Xatu dominates the Grass-types such as Gloom that wall Chinchou, while Chinchou dominates Xatu's best check in Dewgong.</p> "
      },
      {"name": "Support", "description": "<p>With access to the rare Thunder Wave as well as Light Screen, Chinchou should not be underestimated as a supporter. This set fits more so on Baton Pass and hyper offense teams, since Chinchou gives its teammates a temporary yet reliable switch into most special attackers and supports them well with paralysis and Light Screen. Without the obligation of devoting two moveslots to Rest and Sleep Talk, Chinchou also has room to run Ice Beam over one of its support moves to prevent itself from being walled by Grass-types such as Gloom. However, without the longevity provided by RestTalk, it cannot fight Fire-types as effectively in the long term.</p> "}
    ],
    "credits": {"writtenBy": [{"username": "holly", "user_id": 508601}], "teams": [{"name": "Quality checked by", "members": [{"username": "Earthworm", "user_id": 15210}, {"username": "cherryb0ng", "user_id": 421511}]}, {"name": "Grammar checked by", "members": [{"username": "deetah", "user_id": 297659}]}]}
  },
  "Xatu": {
    "sets": [
      {
        "name": "King Xatu (RestTalk)",
        "description": "<p>Xatu is the most dominant Pokemon in GSC NU, and it fits on almost every single team. With two of the highest Special Attack and Speed stats in the tier combined with a great STAB attack in Psychic, Xatu is the single most dangerous special attacker in the tier and can be difficult to switch into for weakened teams. Xatu is a great check to several of the best Pokemon in the tier, notably Primeape, Hitmonlee, and Kingler. It also takes advantage of Spikes, which makes it even more difficult to switch into and turns certain 4HKOs on Pokemon like Magmar and Lickitung into potential 3HKOs. Xatu's immunity to Spikes is also a big benefit that makes it tougher to wear down. RestTalk is a fantastic set for Xatu, since it lets it absorb status and stick around for the late-game, where it often acts as a cleaner. Psychic is a mandatory STAB move that hits a lot of the tier for good damage and can nab a lucky Special Defense drop on a foe like Dewgong, which makes it easier to pressure. Xatu's chosen coverage move is often team-dependent. Drill Peck is generally the most common and reliable, since it acts as a secondary STAB move and guarantees that Sleep Talk will call upon a useful move against Pokemon like Primeape. Even though Hidden Power Electric lowers Xatu's bulk slightly, it hits opposing Xatu the hardest, which gives it an edge in those matchups, as well as putting pressure on Dewgong switching in with Spikes down. Lastly, Night Shade is generally a reliable source of damage, but its main role is to shred through the incredibly bulky Shuckle, which some teams don't have a reliable way of breaking through.</p> <p>Xatu partners well offensively and defensively with several Pokemon. Xatu's arguable best partner is Chinchou, which can beat several of the best checks to it, such as Dewgong, Magmar, and Ninetales; in return Xatu can check most of the physical attackers that scare out Chinchou, such as Hitmonlee. Pineco is an important partner for Xatu, since it sets up the Spikes that Xatu takes advantage of and can somewhat check one of Xatu's best checks in Dugtrio. Primeape forms a fierce offensive combo with Xatu, wearing down the opponent's offensive core by beating each other's checks, such as Weezing for Primeape and Dewgong for Xatu. Xatu is one of the best Baton Pass recipients in the tier; most notably, Growth passes from Flareon turn Xatu into a near-unwallable menace. Bulky Water-types such as Dewgong and Azumarill are often the best ways to check Xatu, since they can stall it out despite fearing Special Defense drops, so Pokemon such as Chinchou and Hitmonlee that can beat them are often good partners. Magnemite and Sneasel are resistant or immune to Xatu's Psychic and can hit it hard with their respective STAB attacks; however, Sneasel cannot check Xatu effectively at all if it is paralyzed, since that way it is forced into burning Moonlight's PP much more quickly. Both of these Xatu checks are weak to Fighting and Fire, so Hitmonlee, Ninetales, and Primeape are useful teammates to threaten them with.</p> "
      },
      {"name": "Utility", "description": "<p>Xatu can play the supporting role well with access to the rare Haze, which lets it effectively stop Baton Passers and setup sweepers such as Ledian, Farfetch'd, Kingler, and Lickitung. Xatu is also able to fit Thief on this set, which can really help out its offensive teammates if Xatu steals an item like Dewgong's Leftovers. Xatu can also run Rest and Mint Berry on the same set, which gives Xatu a chance to heal off all damage and status and also lets it use Thief after using the Mint Berry. This Xatu set does a bit better against bulkier teams when paired with other users of Thief and Spikes, which puts pressure on common bulky Pokemon such as Azumarill, Dewgong, and Ninetales.</p> "}
    ],
    "credits": {"writtenBy": [{"username": "holly", "user_id": 508601}], "teams": [{"name": "Quality checked by", "members": [{"username": "Earthworm", "user_id": 15210}, {"username": "cherryb0ng", "user_id": 421511}]}, {"name": "Grammar checked by", "members": [{"username": "deetah", "user_id": 297659}]}]}
  },
  "Sudowoodo": {
    "sets": [
      {
        "name": "Offensive",
        "description": "<p>As the only Rock-type without a secondary type in the metagame, Sudowoodo is one of the few Pokemon in GSC NU to resist Normal and not have a major exploitable weakness. This means that, unlike Curse Graveler, it is somewhat difficult to immediately force out. Its resistance to Normal and high Defense are very valuable in a metagame with numerous viable Normal-types, such as Wigglytuff, Fearow, and Lickitung, and common Explosion users such as Weezing and Pineco. Its high Attack and STAB Rock Slide allow it to threaten Xatu and common Fire-types with a 2HKO while avoiding a 2HKO in return. Earthquake provides essential coverage to target Pokemon that resist Rock, such as Primeape and Dugtrio, as well as Pokemon weak to Ground, such as Weezing, Chinchou, and Magnemite. Self-Destruct allows Sudowoodo to take something down with it once its defensive role is no longer required. This can let it take down big threats such as Primeape or crucial defensive pieces such as Gloom and Azumarill. Furthermore, a Normal-type with Curse boosts seeking to PP stall Sudowoodo will typically be unable to survive a 999 Attack Self-Destruct after some slight chip damage from Rock Slide, so Sudowoodo can act as a reliable answer to these, even without Rest.</p> <p>Sudowoodo can be a useful teammate to virtually any team thanks to its fantastic set of resistances. In addition to providing an essential resistance to Normal, Sudowoodo also makes for a great recipient of Speed and Attack boosts from Baton Passers such as Ledian and Farfetch'd since it has great coverage and can take at least one hit from almost anything. Sudowoodo has a hard time against bulky Water-types such as Octillery and Azumarill, so it is a good idea to pair it with at least one Pokemon that fares well against these, such as Chinchou. Self-Destruct can be used to pave the way for a teammate such as Magmar, which can struggle against these Water-types. Magmar and other Fire-types can also help Sudowoodo against Grass-types such as Exeggcute. Normal-types, which tend to invite Pineco in due to its high Defense, also greatly appreciate Sudowoodo's presence as a Pokemon that remains relatively healthy after taking a telegraphed Explosion, which can otherwise be difficult to handle in the absence of low health Pokemon to use as fodder.</p> "
      },
      {
        "name": "Defensive",
        "description": "<p>Sudowoodo with Self-Destruct is often vulnerable to status and can struggle to deal with Curse Normal-types without blowing itself up. Furthermore, the Fire- and Poison-types Sudowoodo should be checking can sometimes run coverage moves that force it to use Self-Destruct earlier than it would like. This set attempts to remedy these vulnerabilities by using Rest to give Sudowoodo some longevity. Curse is a good option to ensure that Sudowoodo cannot be beaten by Curse Normal-types, but it comes at the expense of either Earthquake, which Sudowoodo needs to avoid being fodder for Primeape, or Sleep Talk, which is important to maximize both its offensive and defensive presence while it is asleep. If it is running Sleep Talk, Sudowoodo also performs excellently as an answer to Rapidash and Ninetales, which have access to Hypnosis.</p> <p>As Rest Sudowoodo inevitably sacrifices one of Curse, Earthquake, or Sleep Talk, it is highly likely to become setup fodder at some point in a game. Thus, reliable defensive measures, such as Haze Xatu and Gloom, are important to ensure that opposing setup sweepers are kept in check. As usual, it is also highly recommended to use suitable answers to Water-types, as they will easily force Sudowoodo out otherwise. Some such answers include Hitmonlee, Gloom, and Dewgong.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Earthworm", "user_id": 15210}], "teams": [{"name": "Quality checked by", "members": [{"username": "holly", "user_id": 508601}, {"username": "FNH", "user_id": 245982}]}, {"name": "Grammar checked by", "members": [{"username": "deetah", "user_id": 297659}]}]}
  },
  "Pineco": {
    "sets": [
      {
        "name": "Entry Hazard Setter",
        "description": "<p>The choice of Pineco in a teamslot implies building a team around one of its major and potentially game changing assets: Spikes. Pineco is GSC NU's designated Spiker, a role it performs much more effectively than its only competition, Delibird. Though dedicating a teamslot to the green bagworm may often lead to situations of playing with five Pokemon against six, the metagame leaves plenty of room for offensive and defensive strategies that make this trade-off worthwhile.</p> <p>Pineco is an excellent lead, granted that the opposing lead isn't a Fire-type or Weezing, which has a 43% chance of OHKOing it with Fire Blast. In the lead position, Miracle Berry may be preferable so Pineco won't have to worry about being put to sleep by foes such as Stantler. Leftovers grants it somewhat greater longevity to challenge opposing Pineco in the long run, though its frailty makes it tough for this scenario to happen commonly. Pineco doesn't have significant bulk and can get OHKOed or 2HKOed by numerous attacks, including most special attacks. To lay its Spikes early on, it is best to switch it in on a resisted move, such as Dugtrio's Earthquake or Primeape's Cross Chop, as their respective coverage moves fail to 2HKO it. Explosion is Pineco's best option for offense. Opponents that fail to bring a Pokemon that can withstand Explosion may be forced to sacrifice a Pokemon to Pineco, and even Pokemon that resist Normal take heavy damage from it. Additionally, it allows Pineco to threaten any unsuspecting attacker when the opponent is expecting it to use Spikes, punching a hole in the opponent's defenses and granting the rest of the team momentum. Hidden Power Grass makes Pineco somewhat less of a setup bait for Substitute Dugtrio and can punish greedy Rapid Spin Graveler for 60-70%. Rapid Spin is Pineco's second utility move. Unlike its evolved OU counterpart, situations in which it gets to lay entry hazards and remove the ones on its side of the field are quite rare due to its frailty and low Speed. Toxic will punish anything that isn't a Poison- or Steel-type, which can be helpful to put the threatening Fire-types as well as opposing Spikes users on a timer. Alternatively, a player may choose to forgo Rapid Spin and instead use Reflect for screen support, which can buy Pineco and its team extra turns to set up against physical attackers.</p> <p>There are a great deal of Pokemon that threaten Pineco; Fire-types and Weezing can OHKO it with Fire Blast, Xatu can 2HKO Pineco with Psychic, and many Pokemon with STAB attacks that Pineco does not resist, such as Chinchou, Pupitar, Sudowoodo, and Magnemite, can also 2HKO it, although those that do not resist Normal must beware of an unexpected Explosion from Pineco. The teammates that benefit the most from Pineco's Spikes are fast offensive Pokemon such as Xatu, Rapidash, Magmar, Fearow, Primeape, and Dugtrio, as well as setup sweepers such as Swords Dance Kingler and Lickitung that like to see physical walls like Weezing get chipped down after repeatedly switching in. Rapidash and Xatu become much harder to wall with bulky Water-types like Dewgong and Azumarill when Spikes are up, and the same logic applies to many other defensive Pokemon. Explosion also automatically ends the turn, thus granting the opportunity for threatening sweepers like Kingler to come into battle unscathed.</p> <p>Pineco itself prefers having teammates that can effectively take care of Fire-types, Rock-types, and Xatu. Chinchou makes for a defensively synergistic teammate for Pineco, as the two are able to lure in and switch in on each other's threats. Pineco can take advantage of Chinchou checks like Hitmonlee and Gloom or seize the opportunity against a Dugtrio that is trying to revenge kill it, whereas Chinchou can sponge many attacks from special attackers and start its deadly dual STAB attack and RestTalk cycle. It's also worth noting that Chinchou's Thunder threatens many threats that are immune to Spikes, whereas Spikes reduces the longevity of Ground- and Grass-types that don't mind switching into Thunder. Defensive Toxic users such as Dewgong and Ninetales can take on Fire-types and Xatu for Pineco and rack up massive residual damage with poison and Spikes. A more offensive team can utilize Sudowoodo and Pupitar to switch into Fire-types. Their unresisted SlideQuake coverage becomes even more taxing to try and switch into with the presence of Pineco's Spikes.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "cherryb0ng", "user_id": 421511}], "teams": [{"name": "Quality checked by", "members": [{"username": "holly", "user_id": 508601}, {"username": "FNH", "user_id": 245982}, {"username": "Earthworm", "user_id": 15210}]}, {"name": "Grammar checked by", "members": [{"username": "deetah", "user_id": 297659}]}]}
  },
  "Dunsparce": {
    "sets": [
      {
        "name": "Glare + Curse",
        "description": "<p>This set takes advantage of Dunsparce's substantial bulk and Glare to almost inevitably leave the foe immobilized by paralysis as Dunsparce repeatedly heals with Rest, giving Dunsparce the opportunity to attack or set up with Curse from a healthy position. Dunsparce is often overlooked in favor of Wigglytuff, which boasts a superior movepool. However, Dunsparce can reliably paralyze Ground-types such as Graveler and Pupitar, which Wigglytuff can only accomplish by using Body Slam. This can be crucial in creating a favorable situation for a sweep, as Graveler and Pupitar are major problems for Curse Normal-types; Graveler can relatively freely remove Spikes with Rapid Spin or use Explosion against them, and Pupitar often runs Screech to deal with them.</p> <p>Dunsparce pairs very well with Pokemon that can take advantage of paralysis. Some of the most effective examples include Substitute Kingler and Primeape. Powerful Rock-types such as Sudowoodo, Graveler, and Pupitar can also take advantage of paralysis, especially if Pineco has put Spikes up. Teammates such as Kingler, Primeape, and Dugtrio are also useful for dealing with opposing Rock-types and Magnemite. This synergy is amplified by Dunsparce paralyzing these foes such that its teammates can set up with Substitute.</p> "
      },
      {
        "name": "Mixed Attacker",
        "description": "<p>This set attempts to make use of Dunsparce's access to Pursuit in order to trap Xatu and the occasional Gastly. Thunder 2HKOes Xatu and has a decent chance of inflicting paralysis, which can allow Dunsparce to finish it off with Pursuit if it flees. As a fourth move, Dunsparce can use Glare to paralyze anything other than Gastly. Hidden Power Water is another potential option to eliminate Graveler and deal heavy damage to Pupitar, two Pokemon that would otherwise entirely wall it. Rest is also an option, although Dunsparce is unlikely to find an opportunity to safely burn sleep turns, except against more passive teams.</p> <p>Teammates that especially appreciate Xatu being removed, such as Swords Dance or Belly Drum Lickitung, Kingler, Arbok, Hitmonlee, and Primeape, are good choices alongside this Dunsparce set. This Dunsparce set is particularly bad against Magnemite, so teammates such as Dugtrio, Pupitar, Ninetales, and Rapidash are recommended.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Earthworm", "user_id": 15210}], "teams": [{"name": "Quality checked by", "members": [{"username": "holly", "user_id": 508601}, {"username": "cherryb0ng", "user_id": 421511}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Shuckle": {
    "sets": [
      {
        "name": "Rollout",
        "description": "<p>Shuckle is by far the bulkiest Pokemon available in GSC NU and offers its team a crucial resistance to Normal. Its amazing defenses allow it to act as an answer to virtually any Pokemon that can't boost or hit it super effectively, including major threats like Xatu, Fearow, Weezing, and Stantler. With Defense Curl-boosted Rollout, it can also pose a legitimate threat despite its abysmal Attack. As Rollout locks Shuckle in and prevents it from switching out, it is important to make sure that foes are unable to take it down with STAB Water attacks, so Toxic can be used to force a situation where the foe will need to use Rest or switch out, which can allow Shuckle the opportunity to get rolling. Defense Curl is chosen over Curse because of its high PP count, which allows Shuckle to reliably PP stall Normal-type foes without having to lock itself into Rollout.</p> <p>One should not bring in Shuckle expecting to be able to immediately sweep, however. Almost all teams have significant threats to it, and in the absence of a measure to eliminate them, Water-types such as Octillery and Dewgong with Rest will be a major long-term pain for Shuckle. Indeed, in some circumstances, Shuckle should expect never to be able to sweep. Nevertheless, Shuckle is exceptionally good at taking attacks for the purpose of PP stalling. To allow it to do this for as long as possible, having a spinner is very helpful, and Spikes will also help Shuckle's team by preventing foes from simply switching to conserve PP. Therefore, Pineco is an excellent partner, and it can even use Explosion to remove Water-types. Rock-types such as Sudowoodo, Graveler, and Pupitar pose a threat to Shuckle with their STAB Rock attacks, especially if they have Curse to boost their Attack. Additionally, Fire-types with Sunny Day or Growth, such as Magmar and Flareon, can boost the power of Fire Blast to a level that can 3HKO Shuckle. To address these threats, it is crucial to pair Shuckle with a Water-type; some examples of good choices include Octillery, Azumarill, and Chinchou. When paired with Reflect and Light Screen users such as Pineco and Azumarill, it should be noted that a Shuckle with maximum defensive stats will have its defenses roll over behind screens, leaving it incredibly vulnerable. Ninetales is useful as a teammate for dealing with Fire-types, and it can also deal with powerful special attackers such as Xatu and Magnemite decently if Shuckle is not in a position to do so. Fighting-types with Meditate such as Primeape and Hitmonlee threaten Shuckle if they catch it at a lower health point without Defense boosts. Pokemon that resist Fighting, such as Xatu, Gloom, Exeggcute, Weezing, and Arbok, make for useful partners to deal with these threats.</p> "
      },
      {
        "name": "Defensive Pivot",
        "description": "<p>With this set, Shuckle is able to generate opportunities for teammates by locking foes into moves with Encore and spreading poison with Toxic. It retains its ability to switch into a wide variety of threats, and it can better deal with certain foes that set up boosts, such as Kingler and Primeape, thanks to Encore, although it still isn't entirely safe from them. Rest and Sleep Talk allow Shuckle to continue to dissuade foes from setting up or taking advantage of it, with minimal downtime.</p> <p>Water-types such as Octillery and Chinchou are crucial teammates for Shuckle, as they can handle the majority of foes that threaten it, including Octillery, Sudowoodo, and Sunny Day Magmar. It is important to control entry hazards as much as possible when using this set to prevent the opponent from switching to stop Shuckle from being effective. Teammates that work best when they have free turns, such as Kingler, Primeape, Flareon, Magnemite, and Graveler, make for good partners for Encore Shuckle.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Earthworm", "user_id": 15210}], "teams": [{"name": "Quality checked by", "members": [{"username": "holly", "user_id": 508601}, {"username": "cherryb0ng", "user_id": 421511}]}, {"name": "Grammar checked by", "members": [{"username": "Muk", "user_id": 33374}]}]}
  },
  "Sneasel": {
    "sets": [
      {
        "name": "Defensive",
        "description": "<p>Sneasel holds two incredibly valuable defensive niches in GSC NU—it is one of the few Pokemon with instant recovery in the tier, and it is one of the only three Dark-types. The latter grants it a valuable immunity to the main STAB move of the best Pokemon in the tier, Xatu, although Sneasel should still watch for Drill Peck. Sneasel fits very well on Spikes teams thanks to Toxic forcing numerous switches; this compounding chip damage is complemented by Sneasel's incredible Speed, being tied for the second highest in the tier behind Dugtrio, and decent Attack stat, which lets it revenge kill a lot of low health dangerous sweepers such as Primeape. Sneasel fares well against the numerous RestTalk users in the tier such as Dewgong, Xatu, Chinchou, and Azumarill thanks to its decent Special Defense, and Nightmare if it chooses to run a more offensive set. However, Sneasel is quite frail on the physical side, which means almost every physical attacker can 3HKO or 2HKO it. Sneasel is also almost worthless if it is paralyzed, since it is forced to burn through Moonlight's 8 PP much more quickly and loses its ability to outspeed anything. Return is Sneasel's most reliable source of damage, although it lacks STAB. Moonlight is Sneasel's most valuable tool, giving it excellent longevity, and Sneasel has plenty of opportunities to regain HP thanks to its Speed. Toxic is used to cripple Fire- or Fighting-types that lack Rest and tend to switch into Sneasel, such as Magmar and Primeape. Moonlight and Toxic in particular pair very well on Sneasel, since it can use Moonlight until the opposition is worn down due to Toxic. For Sneasel's last move, Dynamic Punch lets Sneasel 3HKO Rock-types and 2HKO the dangerous Magnemite. Alternatively, Thief fits well on Sneasel, since a lot of Pokemon that Sneasel lures in, such as Weezing and Primeape, greatly dislike having their Leftovers stolen.</p> <p>Pokemon that struggle with Xatu and to a lesser extent, Dewgong, are often the best partners for Sneasel. Weezing in particular pairs incredibly well with it, resisting Fighting and having incredible physical bulk to sponge physical attackers that threaten Sneasel. Fighting-types such as Primeape, Hitmonlee, and Hitmonchan synergize well with Sneasel, as Sneasel checks their worst enemy in Xatu. Pineco and its Spikes are excellent support for Sneasel since Toxic very often forces switches; in return, Pineco with Reflect checks Dugtrio and Primeape. With Sneasel's weakness to Fire-types, it appreciates teammates that check Fire-types well, such as Dewgong, Azumarill, and Ninetales.</p> "
      },
      {"name": "Offensive Nightmare", "description": "<p>This set fits well on more offensive teams, since they sometimes lack a reliable switch-in to Xatu. Sneasel can Toxic a foe such as Dewgong or Azumarill, forcing them to use Rest, which enables Sneasel to heavily pressure them with Nighmare while chipping them even further with Return. Moonlight gives Sneasel greater longevity, and works well due to Sneasel taking heavy damage from most RestTalk users that it checks. Primeape pairs well with this Sneasel variant, since Sneasel forcing foes to use Rest gives it a chance to switch in. Offensive teams also sometimes lack Pokemon that can break through Dewgong, which Sneasel does very well.</p> "}
    ],
    "credits": {"writtenBy": [{"username": "holly", "user_id": 508601}], "teams": [{"name": "Quality checked by", "members": [{"username": "Earthworm", "user_id": 15210}, {"username": "Sevi 7", "user_id": 505149}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Octillery": {
    "sets": [
      {
        "name": "RestTalk",
        "description": "<p>Octillery combines the typical defensive properties of being a Water-type with no secondary type with an unusually high Special Attack stat, making it difficult to trade hits with for many foes. Its STAB Surf is strong enough to reliably 3HKO metagame staples like Xatu and Weezing, and it can cover either opposing Water-types like Octillery and Dewgong with Hidden Power Electric or Grass-types like Gloom and Exeggcute with Ice Beam. Ice Beam is also strong enough to 2HKO Xatu, which makes it a valuable option to consider. RestTalk gives Octillery significant longevity and allows it to take on Rock- and Ground-types like Sudowoodo, Graveler, and Dugtrio, as well as Fire-types like Ninetales and Rapidash, with ease. As all of Octillery's attacking moves either 2HKO or 3HKO Xatu and Xatu very rarely 3HKOes it in return, Sleep Talk Octillery also makes for an excellent way to put pressure on the bird.</p> <p>Apart from the typical problem of being unable to cover both opposing Water-types and opposing Grass-types simultaneously while running RestTalk, Octillery has one incredibly annoying problem—Chinchou. Chinchou can deal with nearly any move that Octillery can throw at it easily, outspeeds it, and threatens massive damage and paralysis with its STAB Thunder. It is therefore critical for any team with Octillery to carry a reliable check to Chinchou, such as Gloom, RestTalk Hitmonlee, or Exeggcute.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Earthworm", "user_id": 15210}], "teams": [{"name": "Quality checked by", "members": [{"username": "FNH", "user_id": 245982}, {"username": "holly", "user_id": 508601}]}, {"name": "Grammar checked by", "members": [{"username": "deetah", "user_id": 297659}]}]}
  },
  "Houndour": {
    "sets": [
      {
        "name": "Pursuit",
        "description": "<p>Houndour is viable in GSC NU for one very simple reason: it traps and removes the tier's #1 threat in Xatu with Crunch + Pursuit after minimal chip damage. The removal of Xatu is hugely beneficial for one's team, especially for top-tier Pokemon such as Hitmonlee, Arbok, and Kingler that struggle with Xatu's prominence. Outside of this role, however, Houndour is very underwhelming, being very frail, slow, and walled by Fire- and Water-types. It's also not perfect at removing Xatu, since Drill Peck deals 46% to 54% back to Houndour, although Houndour can use Counter to deal significant damage back.</p> <p>Fire Blast is Houndour's main STAB move, useful for OHKOing Pineco and dealing heavy damage to Gloom and Magnemite. Crunch and Pursuit are necessary for removing Xatu, with Crunch followed by a Pursuit KOing it with minimal chip damage. Counter can deal huge damage back to Xatu if it attempts to fight back with Drill Peck and also works well with Houndour's fragility to generally threaten physical attackers, since almost every physical attacker 2HKOes it. Finally, Thief is a viable option over Counter to cripple a bulky Water- or Fire-type switching into Houndour.</p> <p>The teammates that benefit most from Houndour are the ones that appreciate the removal of Xatu. Arbok, Hitmonlee, Primeape, Kingler, Gloom, Stantler, and Weezing can all provide Houndour's needed chip damage as Xatu switches into them, and they all appreciate Xatu being removed. Moreover, teammates that can paralyze Drill Peck Xatu can let Houndour more reliably take it on by outspending it; these teammates include Glare Arbok and Dunsparce; Body Slam Hitmonlee, Kingler, and Lickitung; Stun Spore Gloom and Exeggcute; and Thunder Primeape and Weezing. Chinchou can help Houndour with its defensive issues, since it easily switches into the bulky Water-types that Houndour is unable to break through, while Houndour can threaten Grass-types for it.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "holly", "user_id": 508601}], "teams": [{"name": "Quality checked by", "members": [{"username": "Sevi 7", "user_id": 505149}, {"username": "Earthworm", "user_id": 15210}]}, {"name": "Grammar checked by", "members": [{"username": "Rabia", "user_id": 336073}]}]}
  },
  "Stantler": {
    "sets": [
      {
        "name": "Offensive Support",
        "description": "<p>Stantler is quite the threatening Pokemon thanks to its solid offensive stats and a variety of support moves including Hypnosis, Light Screen, and Reflect. In addition, unlike most other Normal-types in GSC NU, it is quite strong even when unboosted and has crucial coverage in Earthquake to actually threaten Rock- and Steel-types. Stantler is a defining member of the lead metagame, able to effectively put something to sleep before dishing out damage with its powerful Return. Stantler is also quite fast for the tier, outspeeding Pokemon such as Kingler, Weezing, Chinchou, and Dewgong. However, Stantler has a poor matchup against the most common Pokemon in the tier, Xatu, and also struggles with other top-tier Pokemon such as Primeape. Furthermore, while its defensive stats are passable, they are far from amazing, which can make it difficult to switch in throughout a battle. Return is a mandatory STAB move that hits a vast majority of the tier for a 3HKO. Earthquake complements Return well, hitting the common Rock-types such as Sudowoodo and Pupitar for decent damage and OHKOing Magnemite and the rare Gastly. Hypnosis is another valuable tool in Stantler's moveset, as it can shut down Stantler's checks temporarily as well as stop slower setup sweepers. Thief's ability to make defensive Pokemon such as Azumarill and Dewgong much easier to break through by stealing their Leftovers makes it invaluable for Stantler's offensive teammates. On teams with setup sweepers such as Kingler and Primeape, Stantler can run Light Screen or Reflect over its other supporting moves to make their time setting up much easier, especially Light Screen in Kingler's case. Finally, when paired with a Agility + Baton Pass user such as Farfetch'd, Stantler can run Curse to boost its Attack, turning it into a powerful sweeper while retaining +1 Speed after one use.</p> <p>Stantler best fits on offensive teams, starting the game off well by potentially sleeping a slower lead such as Wigglytuff or Pineco and later stealing valuable Leftovers from bulky Pokemon that could give its team trouble. Weezing is one of Stantler's best partners, as it greatly helps Stantler with its weakness to Fighting-types, while Stantler can support Weezing well with Thief and Hypnosis. Anti-Xatu Pokemon such as Ninetales and Dewgong also assist Stantler with its poor matchup against the Psychic bird; Dewgong in particular enjoys Stantler's ability to blow through Chinchou with Earthquake. Finally, setup sweepers that can have a hard time setting up, such as Kingler and Primeape, benefit from Stantler's ability to shut one check down and provide Light Screen and Reflect support.</p> "
      },
      {
        "name": "RestTalk",
        "description": "<p>With this set, Stantler becomes an incredibly solid anti-lead with better longevity than a dedicated lead set. Its ability to stay in on Thunder Wave variants of Wigglytuff, opposing Stantler leads, and Rapidash can be invaluable for teams lacking switch-ins for those Pokemon. Stantler is also able to switch in throughout the game much better thanks to said longevity. Return and Earthquake hit everything in GSC NU for neutral damage, making them the best options for RestTalk Stantler to still keep its solid offensive prowess.</p> <p>Unfortunately, RestTalk Xatu has an excellent matchup against Stantler because Return cannot 2HKO it and Xatu outspeeds and reliably 3HKOes in return with Psychic or Drill Peck. One way to improve Stantler's chances is to pair it with a Light Screen user such as Azumarill, which also doubles as a check to fast and powerful Fire-types and some Water-types, or Ivysaur, which also checks Chinchou and Primeape. While these Pokemon are passive, RestTalk Stantler can compensate for this with its high-Base Power attacks, perfect coverage, and good longevity behind a screen.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "holly", "user_id": 508601}], "teams": [{"name": "Quality checked by", "members": [{"username": "Earthworm", "user_id": 15210}, {"username": "cherryb0ng", "user_id": 421511}]}, {"name": "Grammar checked by", "members": [{"username": "Rabia", "user_id": 336073}]}]}
  },
  "Pupitar": {
    "sets": [
      {
        "name": "Magistr (Standard)",
        "description": "<p>Pupitar stands in the middle between Sudowoodo and Graveler in GSC NU's competition for the much desired resistance to Normal, with the only other choices being the frail Magnemite and the incredibly mediocre Gastly. What sets Pupitar apart from its exploding rock companions is Ancient Power, which has a 10% chance to boost every single stat bar accuracy and evasiveness and can make Pupitar a deadly cleaner when Water-types are removed. Forcing the opponent to switch out as Pupitar tries for an Ancient Power boost is where it shines the most. Sure, it's a 10% chance, but it's a 10% chance to give a power boost to the unresisted dual STAB combination of Rock Slide and Earthquake.</p> <p>RestTalk gives Pupitar great longevity, but it then loses to the Curse Normal-types of the tier, whereas Screech Pupitar otherwise deals with them very nicely. Although it can be unreliable at times—and very luck dependent—even without boosts, Pupitar has a great time against some of the great staples in the tier, such as non-Sunny Day and Giga Drain Xatu variants, even having a chance of surviving three STAB Psychics; Weezing; the aforementioned dreaded Curse Normal-types; Magnemite; and Pineco. Unfortunately, Water-types and Hidden Power Grass-wielding Fire-types are quite troublesome for the rock worm, but that's when its teammates come in. Defensively, Chinchou and Azumarill can handle both kinds of foes reliably, and offensively, options such as Substitute Explosion Graveler can be used to take out Water-types before Pupitar is even revealed. Hitmonlee can also pair well with Pupitar to handle Dewgong and Chinchou, while Pupitar can switch into Psychic or Drill Peck aimed at Hitmonlee from Xatu.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "freezingpop87", "user_id": 523268}], "teams": [{"name": "Quality checked by", "members": [{"username": "Earthworm", "user_id": 15210}, {"username": "holly", "user_id": 508601}]}, {"name": "Grammar checked by", "members": [{"username": "Rabia", "user_id": 336073}]}]}
  }
}