{
  "Mewtwo": {
    "overview": "<p>Mewtwo can't sweep fast, but it's good late-game. It's not as good as it is in RBY, but it's still Uber to the max. Mewtwo absolutely needs to have Submission--otherwise Blissey, Snorlax, and Tyranitar are going to wall it to hell and back.</p> ",
    "comments": "<h1>Other Options</h1> <p>Mewtwo can use Self-Destruct effectively. There's Ice Beam to run from that nice Special Attack stat too. If you're scared of status, such as Sacred Fire's burn, Mewtwo can use Rest. Mewtwo learns Thunder Wave, something that could be handy in the Uber metagame if your opponent doesn't have a cleric.</p> <h1>Checks and Counters</h1> <p>Umbreon can use Charm to stall out Mewtwo, but it can't take too many Submissions on the switch in. If you can paralyze Mewtwo and get lucky, Heracross has a chance to take it out. If it doesn't have Submission, any of the special walls can usually stall it out--Blissey, Umbreon, and Snorlax in particular.</p> ",
    "sets": [{"name": "Curse", "description": "<p>Curse bolsters Mewtwo's Attack and cushions its Defense. Let loose with Submission when you feel the timing is right. If your opponent tries to stop you with a physical wall or Ghost-type, counter it with the move of your choice. Thunderbolt has the best overall utility in the Uber metagame for the last slot. Shadow Ball is a possibility too, but it leaves Mewtwo kinda stuck against Skarmory and, to an extent, Lugia (since most of those have Curse). I know it seems like a crime not to use that 406 Special Attack, but in the Uber metagame, special attacks aren't going to do a lot to the likes of Ho-Oh and Lugia.</p> "}]
  },
  "Mew": {
    "overview": "<p>Mew is probably the best Uber due to Swords Dance and the movepool that allows it to do anything it wants. It's best used as a physical sweeper since most physical walls and the other Ubers have a physical weakness that Mew can exploit.</p> ",
    "comments": "<h1>Other Options</h1> <p>If Shadow Ball or Rock Slide doesn't appeal to you, Mew has just about every special attack under the sun to use to counter whatever you want to. Mew can also use Swords Dance with Earthquake or Explosion. There's also a myriad of other good moves available--some examples are Curse, Counter, and Thunder Wave. It's also possible to make any other combination of these, but in general the physical sweeper set is the most effective overall.</p> <h1>Checks and Counters</h1> <p>There really isn't a sure-fire Mew counter, and that's why its Uber. Your best bet is probably Heracross, since he resists Submission and most Mew don't have Psychic or Fire Blast. If Mew doesn't have Psychic or Earthquake, then Muk stands to be a good counter too.</p> ",
    "sets": [{"name": "Swords Dance", "description": "<p>Set up with Swords Dance and hit everything with the attack that will do the most damage. Submission will work wonders on most opponents. Shadow Ball is there for the Psychic-types that are prominent in the Uber metagame, and Rock Slide will take apart the Flying-type Ubers.</p> "}]
  },
  "Lugia": {
    "overview": "<p>Lugia can be a nice wildcard in Uber battles. It would have been fantastic if it could set up dual screens with those amazing defenses in GSC, but oh well. It still tanks hits perfectly, and hits hard as well.</p> ",
    "comments": "<h1>Other Options</h1> <p>Psych Up + Whirlwind can be a fun combo if your opponent is trying to set up Curse against Lugia. Other than that, the other moves just depend on what you really want to beat. It learns a plethora of great special attacks like Thunder, Thunderbolt, Hydro Pump, Psychic, and Ice Beam.</p> <h1>Checks and Counters</h1> <p>Zapdos and Skarmory seem to be the only viable counters. Aerodactyl can be to some extent (assuming it is the Curse set), as well as some Pokemon with Curse and Roar.</p> ",
    "sets": [{"name": "Curse", "description": "<p>Lugia is really more defense-oriented than Ho-Oh, but can be made offensive, as evidenced by the moveset above. Despite having 3 fairly common special weaknesses, its high HP and Special Defense allow it to be a godly Curse user. It can conceivably beat CurseLax with a couple critical hits with Aeroblast. This set has its problems, however. First, Skarmory and Zapdos completely nullify this. Second, Aeroblast's low PP hurt it as well, so it's best to only let loose once Lugia has a fair amount of Curses under its belt.</p> "}]
  },
  "Ho-Oh": {
    "overview": "<p>To be honest, Ho-Oh's probably the worst GSC Uber, but that's not really saying a lot. Ho-Oh's main problem is the fact that there are only four moveslots. Otherwise, it would probably be the best Uber. Ho-Oh has great stats, but so do all the Ubers, so it's best as a cleaner if you can get Blissey or Skarmory out the way.</p> ",
    "comments": "<h1>Other Options</h1> <p>Ho-Oh can use Sunny Day and Solar Beam in conjunction with Sacred Fire, but Ho-Oh will just end up being walled by Blissey.</p> <h1>Checks and Counters</h1> <p>If Ho-Oh doesn't have Hidden Power Fighting or Curse, Blissey can stall it out, but not without suffering a possible burn. Most of the other Ubers can handle it since it doesn't really have anything that can force a switch, and it's not great at sweeping. If Ho-Oh has Shadow Ball instead of Earthquake, Tyranitar and Rhydon can handle it with little to no trouble, though they despise being burned by Sacred Fire.</p> ",
    "sets": [
      {"name": "Standard Sweeper", "description": "<p>This is the general cleaning set. Fire and Electric covers most special weaknesses, and the 50% burn chance of Sacred Fire is awesome. The last move is up to you--Earthquake is generally the better move. However, you might also want to try Shadow Ball--it's super effective against the Psychic-types (Mew, Mewtwo, Lugia, and Celebi) and has a chance of lowering the Special Defense of threats like Suicune.</p> "},
      {"name": "Curse", "description": "<p>One of the most basic sets in the book can catch people completely off guard. Return is awfully generic, but it's neutral to most Pokemon in the Uber metagame save for Skarmory. There are multiple choices for the last slot. Whirlwind is probably your best bet and is used to avoid being phazed (and at the same time to phaze other Uber Curse users), Sacred Fire is used to nail two of the main Uber phazers (Skarmory, Celebi) and burn Tyranitar and Rhydon, and Shadow Ball blasts away those annoying Psychic-types.</p> "}
    ]
  },
  "Celebi": {
    "overview": "<p>Celebi has great stats, and resistances to three of the most popular attack types in the game is never bad (Water / Electric / Ground). One thing Celebi doesn't get its due credit for is being able to stall out the average Snorlax and force it to Rest without taking much damage thanks to Leech Seed. It also learns Heal Bell, which is one of the most valuable moves for a stall team, and is still useful for others.</p> ",
    "comments": "<h1>Other Options</h1> <p>Perish Song can act as a phazing move. Celebi can just stall with Recover until the three rounds are up. It pulls the Perish Song job very well with its good defenses. It also allows a stall team to not worry about a last-Pokemon Curse sweep. Giga Drain is a good move but frankly it isn't advisable. Celebi already has a recovery move, and unlike Exeggutor, Celebi is more defensive and should be played as such. An interesting option you could try is Curse coupled with Baton Pass, but it might leave you in a bind when Houndoom shows up.</p> <h1>Checks and Counters</h1> <p>Houndoom and Tyranitar are really the only Pokemon that will take it down with certainty. Espeon can set up Substitute and Growth before passing to a teammate with Flamethrower. Zapdos has a chance to stop it with Drill Peck. Jynx has a good chance too, thanks to the double threat of STAB Ice Beam and Lovely Kiss, and its low HP means Celebi won't regain much with Leech Seed. If Celebi is paralyzed, Heracross and Pinsir make good counters. Charizard may be able to set up a Belly Drum on Celebi, or just nail it with STAB Fire Blast. Really though, Celebi can be hard to take out.</p> ",
    "sets": [{"name": "Standard", "description": "<p>This is a support set and pretty much all that Celebi has going for it in GSC. Heal Bell helps the rest of the team, Recover helps Celebi itself, Psychic gets STAB and uses Celebi's good Special Attack, and Leech Seed can force switches.</p> "}]
  }
}