{
  "Snorlax": {
    "overview": "<p>Ever since the dawn of time, Snorlax has been one of the best and most threatening Pokemon in GSC. This holds true even in Ubers, where its absurd power, unpredictability, and hard-to-kill nature are second to none, granting Snorlax a spot on every single competitive Ubers team. Snorlax's sole presence warps the entire metagame around it, forcing teams to pack not only one but multiple answers for it while Snorlax simultaneously checks a wide array of very threatening Pokemon like Mewtwo, Zapdos, and Jolteon. Snorlax is one of the best progress makers in the format with its Curse set, relentlessly forcing its way through the opposition with absurd power and bulk alike, while also having other options like Belly Drum to annihilate defensive or paralyzed teams. Snorlax can do whatever its team needs it to do and does with unmatched game-to-game consistency.</p> <p>However, because of how metagame-warping Snorlax is, teams pack a lot of answers to it, such as Tyranitar, Golem, and Steelix; all three can phaze Snorlax with Roar, with Golem and Steelix even having access to Explosion to make a huge dent in Snorlax's HP. Other ways of dealing with Snorlax include Explosion from Pokemon like Mewtwo, Mew, and Gengar, all of which can KO Snorlax after some chip damage, although Snorlax can survive Explosion if it has enough Curse boosts. More defensive teams pack sturdy checks to Snorlax such as Barrier Mewtwo, Skarmory, and Lugia. Lastly, Snorlax doesn't commonly run Sleep Talk, meaning that once it's been forced to use Rest or put to sleep with Lovely Kiss or Sleep Powder, foes can use this opportunity to freely take advantage of it, as Snorlax won't have ways to punish them.</p>",
    "comments": "<h1>Other Options</h1> <p>Surf and Thunder are both options Snorlax can run on some of its sets. Surf hits Golem and Rhydon harder than any other move in Snorlax's arsenal while still dealing super effective damage to Steelix; however, Snorlax often prefers to run Earthquake over Surf, as Surf is very weak and doesn't hit anything other than the listed Pokemon. Earthquake also hits targets like Tyranitar and Gengar harder, two Pokemon which could wall Snorlax if it's running Surf. Thunder allows Snorlax to hit Skarmory with high chances of 2HKOing it while also KOing Cloyster after it has switched into Double-Edge. Furthermore, Thunder also gives Snorlax the ability to potentially spread paralysis to foes like Gengar. However, running Thunder means Snorlax is hopelessly walled by Rock- and Steel-type Pokemon like Tyranitar, Steelix, and Golem.</p> <p>Rollout is another option to run on Curselax sets, as it is one of the few moves that allows Snorlax to beat certain combinations of Pokemon such as Barrier Mewtwo + Skarmory. However, Rollout won't be useful most of the time because it needs multiple turns to ramp up in power, during which Snorlax can be threatened with powerful attacks or phazed. Running Rollout also leaves Snorlax helpless against Steelix.</p> <p>Lastly, Protect is an option Snorlax can run to recover HP and scout Explosion and Self-Destruct from Pokemon like Mewtwo, Mew, Cloyster, and opposing Snorlax. It's best used on Drumlax sets, as Snorlax will be at half HP after using Belly Drum. Furthermore, this also allows Snorlax to take advantage of Leftovers and Belly Drum when below 50% HP to boost its Attack to +2. However, it doesn't offer much else, meaning Snorlax would much prefer running other moves.</p> <h1>Checks and Counters</h1> <p><strong>Skarmory</strong>: By virtue of its incredible bulk, typing, and access to Curse, Rest, and Whirlwind, Skarmory is the best available counter to Snorlax and thus is one of the most common defensive answers to it, being a staple on more defensive teams. However, it must be careful of Flamethrower and Fire Blast, which 3HKO and 2HKO it, respectively, and Self-Destruct, which can either severely damage Skarmory for a teammate to finish off or outright OHKO it after some chip damage. Because of this, making sure Skarmory is not paralyzed is key to beat Snorlax one-on-one, as is having enough Curse boosts and HP to ensure Self-Destruct can't take it out.</p> <p><strong>Other Normal-resistant Phazers</strong>: Tyranitar, Golem, and Rhydon are more offensive Snorlax checks that can reliably phaze it, having enough physical bulk to not mind Earthquake too much; however, they all get 3HKOed on the switch and 2HKOed after a Curse boost. Steelix is another phazer that tanks a +1 Earthquake and can phaze Snorlax. Golem and Steelix also have access to Explosion, giving them a way of dealing critical damage to Snorlax for a teammate to take it out; however, this only works if Snorlax doesn't have too many Curse boosts, so all of the mentioned Pokemon would rather tank a hit and phaze Snorlax than use Explosion. Lastly, obscure Pokemon like Omastar can negate Snorlax's boosts with Haze, although it must be careful of Earthquake, as it 3HKOes Omastar unboosted and 2HKOes it at +2.</p> <p><strong>Mewtwo</strong>: Barrier Mewtwo will cause massive trouble for Snorlax, as it can comfortably stall its attacks out of PP while not minding critical hits too much because of Recover. Mewtwo must be careful of Lovely Kiss and Self-Destruct variants, however, as those two can overwhelm it fairly easily. Offensive variants of Mewtwo can potentially threaten Snorlax with Psychic while also threatening Snorlax with a devastating Dynamic Punch and Self-Destruct of its own, both of which severely dent Snorlax. Body Slam paralysis can annoy Mewtwo greatly, however, as getting fully paralyzed will mean it loses one-on-one against Snorlax. As such, it must be kept at relatively high HP.</p> <p><strong>Cloyster</strong>: Cloyster is one of the best offensive checks to Snorlax and is a Pokemon that will be switching into it across the early- to mid-game. Cloyster's raw bulk means it is only 4HKOed by an unboosted Double-Edge and 3HKOed by a +1 Double-Edge. Cloyster can thus set Spikes and force Snorlax to eventually use Rest with Toxic, giving away key momentum. However, one small adaptation Snorlax can make is to keep boosting with Curse in front of Cloyster, allowing it to potentially overwhelm it. The drawback of this is that, if Curse is used too much, Snorlax will be forced to use Rest to negate Toxic, meaning it must decide between boosting or attacking. Although very uncommon, Cloyster also needs to be careful of Thunder, as the move can KO it if it has already taken a Double-Edge from Snorlax.</p> <p><strong>Snorlax</strong>: Some Snorlax variants might have more trouble defeating others; for example, Body Slam variants of Snorlax will be troubled by Double-Edge variants, as Body Slam only 4HKOes Snorlax whilst Double-Edge 3HKOes it. Lovely Kiss variants will beat slower variants of Snorlax since it doesn't commonly run Sleep Talk, meaning that a sleeping Snorlax will be a punching bag for up to six turns. Lastly, Self-Destruct can either outright OHKO or severely damage most Snorlax variants, making it a good panic button in case the opposing Snorlax is getting out of hand with its Curse boosts.</p> <p><strong>Ghost-types</strong>: Gengar and Misdreavus are the only Pokemon in the game immune to Snorlax's STAB moves, giving them a special niche in checking Snorlax. Gengar can hit Snorlax with Destiny Bond, Explosion, and Ice Punch, the latter of which can even potentially inflict freeze, making it a good temporary hard stop to Snorlax. However, it must be careful of Earthquake, as Snorlax 2HKOes it while unboosted and OHKOes it at +1. Misdreavus can annoy Snorlax with the combination of Toxic, Protect, and Pain Split or Rest, PP stalling Monolax sets one-on-one and potentially forcing Curselax to use Rest. However, Misdreavus needs to be careful of Belly Drum variants, as those can OHKO it with Earthquake. Similarly, Misdreavus can succumb to Curselax if it allows too many Curse boosts.</p> <p><strong>Explosion and Self-Destruct Users</strong>: Explosion is one of the most common ways to offensively deal with Snorlax, as a faster Pokemon that uses Explosion will make the turn end and thus leave no room for Snorlax to heal the damage off. Common Explosion users include Mewtwo, Mew, Cloyster, Forretress, Gengar, Steelix, and Exeggutor. Snorlax itself can also use Self-Destruct to seriously dent opposing Snorlax, as the Snorlax mirror matchup is rather common, and Self-Destruct is not very common on Snorlax, meaning that hitting the opposing Snorlax with it is a viable way of keeping it in check.</p> <p><strong>Physically Bulky Pokemon</strong>: Umbreon is physically bulky enough to take on most Snorlax variants one-on-one with the combination of Growl, Toxic, and Rest. However, it must be careful of Belly Drum, Lovely Kiss, and Self-Destruct variants, as those can all overwhelm Umbreon either by boosting too much for Umbreon to negate, by putting it to sleep, or by outright OHKOing it. Miltank can negate Snorlax's Curse boosts with Growl and has access to Heal Bell to offset Lovely Kiss, although it must be careful of Belly Drum sets and Self-Destruct. Defense Curl Celebi works similarly to Miltank, being able to withstand Snorlax's attacks with Defense Curl while offsetting Lovely Kiss with Heal Bell, although it must be similarly careful about Belly Drum and Self-Destruct sets. Both Miltank and Celebi don't appreciate absorbing Lovely Kiss themselves either, so having another Pokemon that can absorb that for them before checking Snorlax is key. Lugia can comfortably sit on Snorlax, as Curse, Recover, and Whirlwind can beat every Snorlax variant one-on-one barring Self-Destruct. However, Lovely Kiss Snorlax can potentially break through Lugia, so making sure a different teammate is asleep first is key for Lugia.</p>",
    "sets": {
      "Monolax": {
        "description": "<h1>Set Description</h1> <p>Monolax combines consistency and power to be the standard Snorlax set in Ubers. Double-Edge is the default choice as Snorlax's STAB move. It is vastly preferred over the other options due to its high damage output against threats like Mewtwo, Zapdos, and Mew, Pokemon that Snorlax 3HKOes unboosted and 2HKOes at +1. Body Slam is the other option, allowing Snorlax to spread paralysis against common switch-ins to it, giving room for teammates like Mew and Marowak to benefit from it. However, it must be noted that Body Slam is an inferior option in terms of damage, missing the benchmarks that Double-Edge achieves; Body Slam Snorlax also cannot 3HKO opposing Snorlax in the mirror matchup and thus relies on paralyzing it to beat it, unlike Double-Edge, which consistently 3HKOes opposing Snorlax. Furthermore Body Slam versions of Snorlax are completely helpess against Tyranitar and are reliant on slower teammates that appreciate paralysis like Golem, Exeggutor, and Marowak to beat it, whereas Double-Edge variants can potentially overwhelm it with Lovely Kiss. Curse allows Snorlax to dish out powerful attacks, nearly 2HKOing common switch-ins to it, such as Cloyster, Celebi, and Mewtwo, at +1; Curse also makes Snorlax significantly bulkier, allowing it to tank hits more easily while also increasing Snorlax's firepower, forcing its opponent to react quickly to it before it gets out of hand, with common answers being phazing it or poisoning it with Toxic to force it to use Rest. Rest allows Snorlax to stay healthy and consistently check threatening Pokemon, like Zapdos and Mewtwo. Lastly, Lovely Kiss gives Snorlax a tool to put opposing Pokemon to sleep, potentially allowing it to power through its checks with boosted attacks. Snorlax has a very potent sleep-inducing role because common users of Sleep Talk in the format, like Zapdos, don't appreciate tanking Snorlax's hits, meaning that there are no good absorbers of Lovely Kiss and thus no good checks to it.</p> <p>Sleep Talk is an option over Lovely Kiss, sacrificing Snorlax's ability to induce sleep but giving it a massive advantage against very powerful attackers, like Zapdos and opposing Lovely Kiss Snorlax. Sleep Talk Snorlax is one of the very few Pokemon that can deal with an opposing Lovely Kiss Snorlax, as it can tank hits while benefitting from each and every one of the Sleep Talk rolls being favorable for it, either by getting stronger and bulkier with Curse, recovering HP with Rest, of by attacking.</p> <p>Monolax can be played both offensively and defensively, depending on what its team needs. Snorlax's attacks are tough for foes to tank without consistent walls, so one should try and scout what the opponent's main switch-in to Snorlax is, either by using Curse or by attacking. If the situation demands it, however, Snorlax should fearlessly use its other moves to counter-attack the threats it has in front of it; for example, against Growth + Baton Pass teams, Snorlax should utilize its superb bulk and access to Lovely Kiss to put a stop to the opposing Mewtwo that has been passed Growth for a teammate to phaze it afterwards.</p> <h1>Team Options</h1> <p>Snorlax is extremely flexible, being able to fit on all kinds of teams. Pokemon that can deal with the Rock- and Steel-types that annoy Monolax, like Celebi and Zapdos, respectively, are good teammates for it. Additionally, Explosion and Self-Destruct are also used to take down Snorlax, with every team having one or more Explosion users; because of this, Pokemon that can take these hits, like Steelix and Gengar, pair nicely with Snorlax on offensive teams. Tyranitar and Steelix are especially nice alongside Monolax, as they all share common checks in Barrier Mewtwo, Skarmory, and Cloyster, meaning that they can work together to take them down; Tyranitar additionally can potentially lure in checks to Monolax, like Skarmory and Forretress, and heavily damage them with Fire Blast. Other Pokemon that carry Fire-type moves, like Mewtwo and Exeggutor, are also good partners for Monolax, as they can help Snorlax by taking out checks to it like Steelix, and Exeggutor also helps against Tyranitar, Golem, Cloyster, and Gengar. Monolax appreciates Spikes support from Cloyster or Forretress because most of its checks are grounded. Pursuit users like Tyranitar and Houndoom are also good teammates, as Monolax appreciates Ghost-types like Gengar being taken down.</p>"
      },
      "Curselax": {
        "description": "<h1>Set Description</h1> <p>Curselax can bait and lure in checks to itself and hit them with super effective moves, where Monolax must land Lovely Kiss to beat them. This allows Snorlax to deal with common checks to itself without using up other team slots or hoping the opposing Pokemon stays asleep for long enough. Double-Edge is the preferred STAB option, as it 3HKOes Mewtwo, Zapdos, Mew, and Ho-Oh even when unboosted while giving Curselax a consistent high-damage move to use against opposing Snorlax. Body Slam is the other option if paralyzing checks to Snorlax, like Tyranitar, Steelix, Mewtwo, Cloyster, and Forretress, is preferred. The choice of coverage move depends on what Snorlax wants to beat, and what its team needs. Earthquake hits Tyranitar, Golem, and Steelix quite hard and works perfectly alongside Body Slam's chance of paralysis, as the aforementioned Pokemon will be slower than Curselax after paralysis; this allows Snorlax to outspeed and 2HKO Tyranitar and Golem while dealing up to 46% to Steelix at +1. Earthquake also targets Gengar, an otherwise hard counter to Snorlax, for devastating damage, 2HKOing it unboosted and OHKOing it at +1.</p> <p>One of Flamethrower or Fire Blast can be used over Earthquake in case Snorlax wants to lure in other Pokemon. Flamethrower allows Snorlax to deal critical damage to Forretress, a Pokemon that usually stays in on Snorlax to use either Spikes or Toxic; however, it barely stops short of OHKOing it. Flamethrower also hits Skarmory, one of the best counters to Snorlax, for a 3HKO and retains the super effective hit on Steelix. Fire Blast is a more powerful move that outright OHKOes Forretress and 2HKOes Skarmory and Steelix, but the low accuracy might be off-putting; Fire Blast also only has 8 PP, which makes it prone to getting PP stalled after it's been revealed. Furthermore, Forretress can be potentially taken down with the combination of Double-Edge and Flamethrower, rendering Fire Blast an inferior option. Overall, Fire-type coverage Curselax is better against defensive or stall teams due to these carrying one of Forretress or Skarmory to check Monolax, both of which get cooked by Fire-type coverage, while Earthquake Curselax is better against offensive teams due to them oftentimes having only Tyranitar and Cloyster as defensive Snorlax checks, both of which get heavily damaged by +1 Earthquake and Double-Edge, respectively.</p> <h1>Team Options</h1> <p>Curselax's best teammates depend on what coverage option it's running, although there are Pokemon that enjoy having any Curselax variant as a teammate. For example, Pokemon like Tyranitar and Mew are good teammates because they share common checks with Snorlax, namely Cloyster, Steelix, and Barrier Mewtwo. Earthquake Snorlax can take out Steelix with boosted attacks, while Tyranitar beats Barrier Mewtwo one-on-one with the combination of Curse, Roar, and Rest while also 3HKOing Cloyster with Rock Slide. Mew, on the other hand, can break through Snorlax's checks with either a booster Explosion or a boosted Earthquake. Ideally, Curselax will want to be paired with strong attackers or setup sweepers like Marowak, Mewtwo, and Jolteon that can double down on the offensive presence that Curselax offers. Cloyster and Forretress are also good teammates, as Curselax appreciates Spikes wearing down its checks. Both of them can also support Curselax via Toxic and Explosion. Rapid Spin support from Golem and Forretress is also appreciated, as Curselax might be troubled switching into Zapdos if Spikes are up; Golem's Electric immunity can also help with pivoting.</p>"
      },
      "Restless Snorlax": {
        "description": "<h1>Set Description</h1> <p>Snorlax can run more offensive moves over Rest, changing the dynamics of how it is played entirely. Unboosted Double-Edge 3HKOes Mewtwo, Mew, and Zapdos while giving Snorlax a consistently strong option against opposing Snorlax. Body Slam is an option if spreading paralysis on checks like Tyranitar, Steelix, Skarmory, and Golem is preferred; unfortunately, the drop in damage is very noticeable, as Snorlax cant 3HKO the aforementioned Pokemon and can no longer threaten opposing Snorlax in the mirror matchup. However, Snorlax can KO Skarmory and Lugia with Self-Destruct more easily if they switch into Body Slam and gets paralyzed. Curse Snorlax is both offensively threatening, as +1 Double-Edge can 2HKO Zapdos, Mew, and Mewtwo and also 2HKO Cloyster after chip damage, and defensively impenetrable. Belly Drum can be used instead if more immediate power is desired; +6 Snorlax can consistently OHKO the entire metagame aside from a few select Pokemon like Skarmory and Lugia, and even Lugia has a change of getting OHKOed by +6 Double-Edge. Earthquake hits Rock- and Steel-type checks like Tyranitar, Golem, Rhydon, and Steelix. It is worth noting that every listed check gets OHKOed by +6 Earthquake, so paralyzing them with Body Slam lets Snorlax take them down with ease. This allows Snorlax to play a supportive role by weakening checks to teammates such as offensive Mewtwo. Running Self-Destruct trades Rest's consistency and the ability to check Zapdos with the ability to annihilate even the bulkiest of Pokemon, like Skarmory and Lugia, after a boost. Snorlax can also lure and remove Zapdos and opposing Snorlax with Self-Destruct for its teammates. Lovely Kiss can be an option over Self-Destruct to give Snorlax a tool to put opposing Pokemon to sleep, potentially allowing it to power through its checks with boosted attacks.</p> <h1>Team Options</h1> <p>Restless Snorlax commonly sees itself on more offensive teams, as it cannot consistently switch into threats like Zapdos and wall them due to the lack of Rest. It should be used to wallbreaker, hopefully trading two-for-one against the opponent with Lovely Kiss and Self-Destruct. Pokemon like Jolteon, Vaporeon, Heracross, and Lugia are good partners for Self-Destruct Snorlax, as they benefit from Snorlax weakening their checks like Skarmory, Zapdos, and opposing Snorlax. Cloyster sets Spikes for Snorlax and provides its own Explosion to complement the offense. Other Pokemon with access to Self-Destruct or Explosion, like Mewtwo, Mew, Gengar, Steelix, Golem, and Exeggutor, are also good partners.</p>"
      },
      "DrumLax": {
        "description": "<h1>Set Description</h1> <p>Belly Drum provides Snorlax with the most immediate offensive power possible, giving it the possibility of destroying teams with very little effort. Body Slam is preferred over Double-Edge due to Double-Edge's recoil forcing Snorlax to use Rest more often and wasting turns. Body Slam spreads paralysis on faster foes like Mewtwo, Cloyster, and Tyranitar, leaving room for Snorlax to potentially overpower them later after Belly Drum. Return is an option over Body Slam if more damage is preferred; Return has chances to 3HKO Zapdos, one of the few Pokemon that can threaten Snorlax with Thunder. Lovely Kiss helps Snorlax beat Pokemon like Skarmory, which gives it trouble even at +6 Attack, and it can also deny Spikes from Cloyster and Forretress and phazing from Lugia, Tyranitar, and the aforementioned Skarmory. Earthquake can be used instead to give Snorlax an option to OHKO Rock- and Steel-types like Tyranitar and Golem and Steelix after one round of Spikes damage; Earthquake also allows Snorlax to hit counters like Gengar and Misdreavus. Lastly, Rest gives Snorlax much needed longevity and allows it to use Belly Drum again later in the battle.</p> <h1>Team Options</h1> <p>DrumLax fits on teams that can spread paralysis and need an immediately wallbreaker, meaning it can fit on both offensive and defensive teams. Offensive teams can support a DrumLax sweep with teammates like Thunder Wave Mew, Thunder Wave Mewtwo, Thunder Wave Zapdos, Tyranitar, and Cloyster; Tyranitar removes Steel- and Ghost-types that can annoy Snorlax if it is not running Earthquake with Fire Blast and crunch, respectively, while Cloyster sets Spikes for DrumLax to net certain KOs against Pokemon like Steelix. On more defensive builds, teammates like Barrier Mewtwo, Celebi, Lugia, and Skarmory can switch into threatening attacks for Snorlax. Paralysis spreaders like Starmie, Steelix, Blissey, and the rarer Miltank are also good teammates to help DrumLax overcome its middling Speed. Spinners like Forretress, Cloyster, and Golem are appreciate, since Spikes hurt DrumLax's ability to set up.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "corvere", "user_id": 306317}], "teams": [{"name": "Grammar checked by", "members": [{"username": "aurora", "user_id": 109385}, {"username": "DC", "user_id": 449990}, {"username": "autumn", "user_id": 384270}, {"username": "StupidFlandrs48", "user_id": 633500}]}]}
  },
  "Mewtwo": {
    "overview": "<p>Mewtwo's incredible stats and deep movepool grant it tremendous versatility and power. Its ridiculously high Speed, solid defenses, and access to Recover and Barrier make it one of the sturdiest checks to physical attackers that lack phazing moves, such as Mew and Earthquake Lugia. Offensively, its monstrous Special Attack, amazing coverage, and status moves allow it to threaten broad swathes of the metagame. Nothing is entirely safe from Mewtwo, though it may need to sacrifice itself with Self-Destruct to consistently eliminate the foe. Unlike most other threats of its magnitude in GSC, Mewtwo requires no setup before it can start blasting away. Mewtwo's flaws are few and far between, but the most exploitable is perhaps its lack of ways to deal with status. Paralysis is a death sentence for Mewtwo, which puts it in an awkward situation against foes with Thunder, Body Slam, or Thunder Wave. However, Self-Destruct gives Mewtwo a way to salvage even poor situations. Mewtwo is so difficult to handle that, oftentimes, players must resort to controlling it through Self-Destruct or Explosion, as a trade is usually preferable to continually enduring its attacks or being perpetually walled.</p>",
    "comments": "<h1>Other Options</h1> <p>Instead of relying on Thunder to inflict paralysis, Mewtwo can instantly paralyze its foes with Thunder Wave. This is particularly useful when combined with Dynamic Punch and setup sweeper teammates such as Belly Drum Snorlax, Marowak, Curse Tyranitar, and Swords Dance Mew. However, it comes at the cost of coverage and the most likely target of Thunder Wave, opposing Mewtwo, can potentially trade itself with Mewtwo with Self-Destruct to avoid the disadvantage of being paralyzed. Mewtwo can use Curse along with Submission or Dynamic Punch to deal serious damage to specially bulky foes such as Snorlax, Blissey, Umbreon, and Tyranitar. It can also potentially use Shadow Ball to hit Psychic-types such as Mewtwo, Mew, Lugia, and Celebi for boosted damage. However, using Curse and physical attacks makes it difficult to retain sufficient special coverage; for example, without Thunder, Mewtwo will struggle to deal with Forretress, Ho-Oh, and Cloyster, and without Ice Beam, it will struggle against Zapdos and Steelix. Even if Mewtwo uses Curse, a physical attack, and two special attacks, it will need to forgo Recover and Self-Destruct. Curse Mewtwo therefore requires specific circumstances and extensive support in order to be most effective. Mewtwo's ample pool of HP makes it a capable user of Counter, which can catch foes such as Swords Dance Mew and Curse Snorlax and instantly KO or deal massive damage to them. On top of this, its high Speed and access to Self-Destruct and Recover mean that it won't be entirely useless after executing this strategy. However, Counter is a higher risk strategy than simply dealing with these foes using Barrier or Self-Destruct, as it relies in part on surprise.</p> <h1>Checks and Counters</h1> <p><strong>Snorlax</strong>: Although it must be wary of Self-Destruct and Dynamic Punch, Snorlax can dominate most Mewtwo sets with its common sets. Its massive special bulk allows it to easily withstand Mewtwo's special attacks, allowing it to set up with Curse or cripple Mewtwo with Body Slam paralysis before setting up with Belly Drum. Lovely Kiss also gives it a way to bypass even Barrier Mewtwo.</p> <p><strong>Mew and Mewtwo</strong>: Mew and Mewtwo are both very bulky, which allows them to withstand numerous attacks from opposing Mewtwo before potentially healing the damage with Soft-Boiled or Recover. With a small amount of chip damage, they can also reliably OHKO it with Explosion or Self-Destruct. Mew can set up with Swords Dance to boost its Shadow Ball or Earthquake and then deal heavy damage to Mewtwo. However, Mewtwo will often have Barrier or Self-Destruct to neutralize the threat from Mew, and it can potentially inflict status with Toxic, Thunder, or Thunder Wave, so it must be dealt with cautiously. Generally, a clash between these titans of the tier tends to end in an exchange of status inflictions or a trade via Explosion or Self-Destruct.</p> <p><strong>Electric-types</strong>: Raikou tends to be one of the safest checks to Mewtwo, as Mewtwo often drops Psychic for other moves with better super effective coverage and Ice Beam is only a 5HKO against it. In return, Raikou threatens Mewtwo with crippling paralysis from Thunder, which can allow teammates such as Curse Snorlax to fight Mewtwo with less risk of being suddenly KOed by Self-Destruct or getting walled by Barrier. Zapdos is weak to the common Ice Beam, but in the absence of Ice Beam and Psychic, Zapdos also does well against it thanks to its powerful Thunder and access to Thunder Wave. Jolteon should generally avoid switching into Mewtwo before scouting, but it can fight against Barrier variants adequately thanks to Speed tying with Mewtwo and having Growth to boost its Special Attack. Jolteon's +1 Thunder is a 2HKO on Mewtwo, whereas Mewtwo's Flamethrower or Ice Beam is a 4HKO against Jolteon.</p> <p><strong>Dark-types</strong>: Umbreon is one of the best at neutralizing Mewtwo thanks to its formidable bulk and solid defensive typing. While it is lacking in powerful direct damage options, it can chip away at Mewtwo with Toxic and Pursuit, put it in an awkward position with Charm, and threaten to trap it with Mean Look. Curse Tyranitar is one of the biggest problems for Barrier Mewtwo, as it commonly runs both Roar and Rest to negate the effects of Barrier and Toxic. Specially, Tyranitar has a powerful super effective STAB Crunch alongside Pursuit, which can put Mewtwo that lack Fighting-type coverage in an awkward position. While Crunch does not 2HKO Mewtwo, it deals enough so that Mewtwo is under serious threat from potential Special Defense drops and critical hits, even with Recover. Tyranitar also resists Self-Destruct, which means that, unlike with most foes, Mewtwo is unlikely to be able to achieve a trade. Unlike most Pokemon that resist Normal, Tyranitar also has good special bulk, which allows it to take coverage attacks from Mewtwo that other Normal-resistant Pokemon are afraid of. However, Dark-types need to be cautious around Mewtwo sets that have Fighting-type coverage moves, especially Tyranitar with its 4x weakness.</p> <p><strong>Heracross</strong>: Heracross has decent special bulk and access to STAB Megahorn, the only unboosted attack in the game that can reliably 2HKO Mewtwo aside from Self-Destruct and Explosion. If Mewtwo lacks Psychic- and Fire-type coverage, Heracross has a good matchup against it and will generally be able to force Mewtwo to switch out or trade with Self-Destruct.</p> <p><strong>Blissey</strong>: Blissey can take on variants of Mewtwo that lack Dynamic Punch reasonably safely, as even Submission fails to 2HKO it. It can undo the status spreading that Mewtwo has done with Heal Bell and even pose a significant threat to it with Present or Toxic. However, as with most Mewtwo checks, it must be wary of Self-Destruct.</p> <p><strong>Vaporeon</strong>: RestTalk + Growth Vaporeon or Growth + Baton Pass Vaporeon can take advantage of Mewtwo sets that lack Thunder, such as the common Flamethrower + Toxic + Barrier set. However, it is risky to take Mewtwo on with Vaporeon before its set is revealed.</p> <p><strong>Shuckle</strong>: Shuckle is a fairly reliable answer to Mewtwo variants that lack Psychic, as none of its other attacks can reliably 4HKO it. It threatens Mewtwo with Toxic and can PP stall it without risking being KOed by Self-Destruct.</p> <p><strong>Quagsire</strong>: Quagsire can switch into Thunder and Flamethrower, which are Mewtwo's most commonly used attacks, and take next to no damage. It can then either attempt to stall Mewtwo with a RestTalk set or, if Mewtwo is paralyzed, set up with Belly Drum. However, it is 4HKOed by Ice Beam, which leaves it vulnerable to critical hits or confusion from Dynamic Punch, and it is easily 3HKOed by Psychic.</p>",
    "sets": {
      "Recover": {
        "description": "<h1>Set Description</h1> <p>Mewtwo's extremely high Speed and 32 PP of Recover let it use Barrier to wall any physical attackers that lack phazing moves and disruptive secondary effect chances on their attacks, such as Swords Dance Mew, Earthquake Lugia, and certain Curse Snorlax and Mewtwo variants. Even a +6 Shadow Ball critical hit from Mew will only deal up to 70.3% to +6 Mewtwo, and because Mewtwo outspeeds and has Recover and Leftovers, Mew must land four consecutive critical hits to take a full health Mewtwo down. Mewtwo's effectiveness as a physical wall is compounded by the fact that many Explosion and Self-Destruct users only OHKO it some of the time—only Golem and Snorlax always OHKO—and if Mewtwo survives other foes' Explosions, it can restore its health with its fast Recover. However, Mewtwo is not a flawless physical wall—even without the less common Self-Destruct, Snorlax can pierce Mewtwo's defenses with Lovely Kiss and potentially use Body Slam, Mew can use Thunder Wave or potentially allow a teammate to sweep by removing Mewtwo with Explosion, and Curse phazers such as Tyranitar, Lugia, and Ho-Oh can remove its Defense boosts after accruing boosts. However, Swords Dance Mew is a massive threat, and Barrier Mewtwo is one of the safest ways to reliably handle it. In addition to walling foes, Mewtwo threatens its foes in return with its remaining two moveslots. The combination of Toxic and Flamethrower is an excellent way to ensure Mewtwo can pose some threat to a majority of foes, as Pokemon immune to Toxic generally take heavy damage from Flamethrower. Toxic also has the advantage of dealing sustained damage while Mewtwo does its stall routine. Ice Beam can be used over Toxic so that Mewtwo can threaten Zapdos, which is one of the most common RestTalk users in the metagame, and it also lets Mewtwo possibly freeze foes. Flamethrower can be replaced by Thunder, which has great coverage alongside Ice Beam, allows Mewtwo to hit foes such as Ho-Oh and Starmie, and threatens to paralyze foes such as Mewtwo, Mew, and Lugia. Another alternative is Psychic, which hits bulky foes such as Snorlax and Raikou for heavy damage and is an especially powerful option with Growth boosts from Baton Pass. When combined with Barrier, Growth boosts can turn Mewtwo into a near-invincible powerhouse; however, Psychic can also be used alongside BoltBeam coverage to retain heavy damage against foes such as Ho-Oh and Forretress.</p> <p>Mewtwo can also take a more offensive approach by running other attacking moves instead of Barrier. Self-Destruct retains some efficacy in dealing with Mew and can break through opposing status absorbers, such as Rest Snorlax. It is also somewhat unexpected alongside Recover, which could allow Mewtwo to grab a surprise KO against an unsuspecting foe. Dynamic Punch is a good option for dealing with Dark-types such as Umbreon and Tyranitar while also providing a chance to break through Snorlax and Blissey without relying on Self-Destruct. However, it should be noted that Dynamic Punch sets with Recover over Self-Destruct may lack the firepower to deal with opposing Mewtwo and Mew.</p> <h1>Team Options</h1> <p>Recover Mewtwo is exceptionally susceptible to status, so status absorbers and clerics are critical to its success. Rest Snorlax is a great general tank and can take a beating from most Pokemon that could paralyze Mewtwo with Thunder or target it with other moves that may inflict status. Blissey can likewise take virtually any special attack and offers Heal Bell support, which can allow Mewtwo to accept a degree of risk, such as fighting a Pokemon that uses Thunder, Body Slam, or Thunder Wave. Rest Jolteon can take potentially-paralyzing hits from Electric-types and threaten a sweep with Growth boosts. Baton Pass Jolteon can likewise threaten a sweep by passing boosts to Mewtwo or its teammates, which is especially effective if Mewtwo has multiple attacking moves. Spikes and Rapid Spin support is also recommended in order to go toe to toe with defensive teams; Forretress and Cloyster both make for excellent Spikes users and can also use Rapid Spin if the team requires it, whereas Golem can provide additional defense against Snorlax and pivot into Electric-type attacks aimed at Mewtwo alongside its Rapid Spin support. Measures against Curse + Whirlwind Lugia and Ho-Oh such as Zapdos and Raikou are a necessity. Both of these Electric-types provide a lot of offensive presence and defensive utility; offensively, they offer high damage output and a paralysis threat with STAB Thunder, as well as the potential to run Roar or Whirlwind with Spikes support to rack up passive damage against bulky foes. Defensively, both are effective as RestTalk users and perform very well against Lugia, one of the most important threats to deal with. An alternative to the Electric-types is Crunch Tyranitar, which offers both heavy damage against Lugia and other Psychic-types as well as a useful resistance to Normal-type moves such as Explosion and Snorlax's STAB attacks.</p>"
      },
      "All-out Attacker": {
        "description": "<h1>Set Description</h1> <p>As an all-out attacker, Mewtwo focuses on maximizing coverage while holding the threat of a sudden Self-Destruct over the foe's head. Thunder is essential to threaten Cloyster with an OHKO, as well as threatening Lugia, Ho-Oh, Mew, and Mewtwo with heavy damage and paralysis. Ice Beam is the best choice for its second move, as it threatens a 2HKO on Zapdos and Golem while also providing the possibility of a game-changing freeze. This BoltBeam coverage is best complemented with a Fighting-type move for Snorlax, Tyranitar, Umbreon, and Blissey. Dynamic Punch is an inconsistent but extremely dangerous option thanks to its accompanying confusion, which substantially increases Mewtwo's chances of getting past Snorlax without having to use Self-Destruct. The presence of Self-Destruct on the set also offers a way to recoup lost ground if Dynamic Punch fails to connect. Submission is weaker and comes with recoil, but its reliability gives it some appeal, and it still hits the aforementioned targets for substantial damage. Psychic is a solid alternative to Ice Beam, as it hits all of Snorlax, Zapdos, and Raikou for solid damage while threatening to drop Special Defense. This solid neutral damage on key foes also allows Mewtwo to run Fire Blast for the OHKO on Forretress, 2HKO on Celebi, and more reliable damage against Mew and opposing Mewtwo. Self-Destruct is a key weapon in Mewtwo's arsenal, allowing it to instantly remove nearly any foe after one prior hit. This can be used to deal with Swords Dance Mew, opposing Mewtwo, and Snorlax, potentially putting a teammate such as Zapdos or Jolteon into a position to sweep.</p> <h1>Team Options</h1> <p>Mewtwo is very commonly paired with Mew, as the two are excellent at breaking apart defensive cores with Self-Destruct and Explosion. If Mewtwo succeeds in taking down a specially bulky foe such as Snorlax, Blissey, or Raikou, this may allow a threat such as Growth Jolteon or Zapdos to wreak havoc with STAB Thunder. Jolteon can also potentially send its Special Attack boosts to Mewtwo with Baton Pass, making it nigh unstoppable. Mewtwo also appreciates Spikes support from Pokemon such as Forretress and Cloyster, as this helps it break through bulky foes such as Snorlax and Umbreon more easily. To potentially avoid having to trade such a valuable offensive weapon for its doppelganger on the opposing team, one can aim to status the opposing Mewtwo and then take it down with teammates such as Crunch + Pursuit Tyranitar, Explosion Steelix, Curse Lugia, Swords Dance Mew, and Curse Snorlax. In case Curse Snorlax gets out of hand against Mewtwo, it is useful to have at least one Normal-resistant phazer such as Steelix, Tyranitar, or Golem, or a Normal-resistant Defense booster such as Curse Skarmory, Reflect or Curse Forretress, or Defense Curl Shuckle.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Earthworm", "user_id": 15210}], "teams": [{"name": "Quality checked by", "members": [{"username": "Isa", "user_id": 168574}, {"username": "M Dragon", "user_id": 21345}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}, {"username": "deetah", "user_id": 297659}]}]}
  },
  "Mew": {
    "overview": "<p>Mew is one of the most threatening Pokemon in GSC Ubers thanks to its insane versatility that lets it perform an important variety of offensive roles. As a lead, Mew matches up perfectly against common leads like Snorlax and Mewtwo, consistently beating them with the combination of Swords Dance, Thunder Wave, and Explosion, with Miracle Berry further helping Mew against them by providing a one-time status immunity that lets it set up freely. Mew's Explosion is one of the strongest attacks in the game, capable of potentially breaking through even the bulkiest of Pokemon, like Lugia, Skarmory, Barrier Mewtwo, and Tyranitar after a Swords Dance boost, making Mew one of the best offensive facilitators for teammates like Snorlax, Tyranitar, and offensive Mewtwo.</p> <p>When used in the back, Mew takes advantage of its good natural bulk to annoy offensive Mewtwo, Zapdos, and Gengar, matchups that can be further improved if Mew is running Soft-Boiled in its moveset. Mewtwo's Self-Destruct and Gengar's Explosion don't come close to OHKOing Mew, meaning that it can recover the damage done with Soft-Boiled or survive with enough HP to attack the next turn.</p> <p>However, Mew can be reliant on paralysis to effectively remove Barrier Mewtwo; Mewtwo's higher Speed allows it to reach +4 Defense as Mew uses Swords Dance once, thus making Explosion's chances to OHKO it lower and lower as Mewtwo racks up more boosts. Mew's Speed stat also leaves it outsped by Jolteon and the aforementioned Mewtwo, two Pokemon that can reliably revenge kill a low-HP Mew. Finally, Mew, while having access to an ocean of a movepool, cannot beat every check to itself with four moves, and thus, if it's not sacrificing itself with Explosion, it becomes much less threatening once its entire moveset has been revealed.</p>",
    "comments": "<h1>Other Options</h1> <p>Earthquake is an option for lead Mew to 2HKO Tyranitar and Golem at +2 without sacrificing itself; it also 3HKOes Steelix. Earthquake also allows Mew to hit otherwise annoying Pokemon for it like Gengar. However, Gengar already dislikes getting paralyzed with Thunder Wave, and Tyranitar and Golem already take heavy damage from Explosion. Earthquake also worsens Mew's matchup against Spikes users like Cloyster and Forretress. Lastly, using Explosion on the aforementioned Pokemon is usually Mew's task, rendering Earthquake mostly useless.</p> <p>Rock Slide 2HKOes Zapdos at +2 and it can help Mew get some Pokemon, like paralyzed Mewtwo and Heracross, into KO range by flinching them. However, it worsens Mew's matchup against Spikes users like Cloyster and Forretress. Cloyster gets 3HKOed at +2 and cripples Mew with Toxic or damages it with Surf or Explosion, with Forretress taking even less damage than Cloyster while doing the same.</p> <p>Shadow Ball is the last coverage option that lead Mew can use to hit Celebi, opposing Mew, and Mewtwo hard while not sacrificing itself with Explosion. However, Mew prefers running other moves and, like Earthquake and Rock Slide, it worsens Mew's matchup against Spikes users.</p> <p>Flamethrower can be used on the backline Mew set to OHKO Forretress and 2HKO Skarmory and Steelix. This is best used with a moveset of Swords Dance, Submission, and Shadow Ball for Mew to retain a powerful hit on Mewtwo. However, Barrier Mewtwo and Lugia will forever wall Mew if it is not running Explosion, as will other Pokemon like Zapdos, Ho-Oh, and Haze Quagsire. Similarly, Fire Blast is another option that Mew can run to improve its matchup against chipped foes like Steelix and Skarmory.</p> <p>Protect can be used on the backline Mew set as a way to get passive recovery and bait Explosion from foes like opposing Mew and Cloyster. This is best used on a set with Swords Dance, Earthquake, and Explosion as the other moves. Earthquake hits Pokemon like Tyranitar, Steelix, and Gengar that resist or are immune to Explosion. Similarly to Protect, Substitute is an option to not only bait Explosion but also block status from foes like Cloyster, which works best on teams that can fit a lot of paralysis support in the form of Thunder Wave Mewtwo, Thunder Wave Zapdos, and Body Slam Snorlax. Substitute works best on a set with Swords Dance, Earthquake, and Rock Slide with teammates that can deal with Barrier Mewtwo, Lugia, and Skarmory.</p> <p>A moveset of Flamethrower or Surf, Toxic, Soft-Boiled, and Explosion is an option for teams that want a bulky Pokemon that can act as a pseudo-wall to various Pokemon but cannot use Mewtwo because it is occupying another role, like being a Growth recipient. This set utilizes Mew's excellent natural bulk to be one of the most sturdy Mewtwo checks in Ubers, as it avoids a 3HKO from all of its attacks while also having a very strong Explosion to keep other threats like Zapdos, Jolteon, and the aforementioned Mewtwo in check.</p> <p>Hidden Power Bug is an option in the backline Mew set to hit Celebi and Tyranitar super effectively in one moveslot. This allows Mew to run coverage for other threats like Ho-Oh and Barrier Mewtwo in Rock Slide and Explosion, respectively.</p> <p>Lastly, Thief can be used to steal Leftovers from Steelix, Skarmory, Forretress and other physical walls like Lugia. Thief is also effective due to its surprise factor, and it can help trick the opponent by bluffing that Mew is using Miracle Berry as its item. However, it requires Mew to go into the game itemless.</p> <h1>Checks and Counters</h1> <p><strong>Mewtwo</strong>: Because of its access to Barrier and Recover alongside its higher Speed, Mewtwo is Mew's best check. Unless Mew has paralysis support in the form of Body Slam Snorlax, Thunder Wave Mewtwo, Thunder Wave Zapdos, or its own Thunder Wave, it cannot beat Mewtwo reliably. Offensive Mewtwo can survive every move from +2 Mew bar Explosion and deal decent damage back with Thunder. Lastly, Mewtwo can use Self-Destruct to deal massive damage to Mew, letting a teammate easily finish it off.</p> <p><strong>Zapdos</strong>: Zapdos is the best offensive check to Mew, being strong enough to 3HKO Mew with Thunder and bulky enough to avoid the 2HKO from an unboosted Rock Slide. Furthermore, Zapdos also completely walls any Mew that is not running Rock Slide, forcing it to use Explosion to take it out. However, Thunder misses can make this a tricky interaction, and Mew always has the option to use Explosion on Zapdos. Zapdos Speed tying with Mew also makes it harder for Zapdos to consistently beat it.</p> <p><strong>Heracross</strong>: Heracross is bulky enough to avoid the 2HKO from any boosted attack and 2HKO Mew back with Megahorn. Its access to Curse and Rest + Sleep Talk make it a decent answer even when asleep. However, Mew can beat Heracross with just one Rock Slide flinch. Explosion also OHKOes it.</p> <p><strong>Snorlax</strong>: Snorlax only gets 3HKOed by +2 Earthquake and Rock Slide and can use Lovely Kiss to put Mew to sleep and nullify its threat. However, Submission 2HKOes it at +2, while Explosion outright OHKOes it. Miracle Berry can also nullify Lovely Kiss.</p> <p><strong>Physically Bulky Pokemon</strong>: Lugia, Skarmory, and Umbreon are all Pokemon that naturally annoy Mew via either boosting their Defense or lowering Mew's Attack. Because of this, Mew's only way of dealing with these Pokemon is usually Explosion. However, Lugia can tank even a +6 Explosion with enough Defense boosts and has Recover to prevent Mew from taking advantage of it. Skarmory has only a 2% chance of getting OHKOed by Explosion, meaning that Mew needs to flinch it with a +2 Rock Slide to have a guaranteed KO with Explosion. Because of this, it is not very reliable. Umbreon is the most prone of the mentioned checks to lose to Mew, but its access to Charm, Moonlight, and Toxic can let it stall long enough for Mew to either faint or lose patience and use Explosion. Cloyster only gets 3HKOed by a +2 Rock Slide and can deal a minimum of 86% to Mew with Explosion. Steelix is bulky enough to use Curse even on a boosted Mew and can use Explosion itself to take Mew out.</p> <p><strong>Celebi</strong>: Celebi can be used as a good Mew check if pivoted properly, either by scouting if Mew is running Shadow Ball on its moveset or baiting Explosion and switching out to Pokemon that resist it.</p> <p><strong>Ho-Oh</strong>: Ho-Oh is bulky enough to survive an unboosted Rock Slide, meaning it can use Toxic on Mew or deal damage to it with Flamethrower while scouting and pivoting around to reveal Mew's moveset. However, a +2 Rock Slide and Explosion will outright OHKO Ho-Oh.</p> <p><strong>Quagsire</strong>: Quagsire annoys Mew with Toxic and Haze. Toxic is especially devastating for backline Mew, as its potential sweep will be compromised, and it will be forced to use Explosion more quickly.</p> <p><strong>Exeggutor</strong>: Exeggutor is bulky enough to avoid the OHKO from a boosted Shadow Ball, resists Earthquake, and can put Mew to sleep with Sleep Powder while having access to Explosion to put a huge dent in Mew's HP. However, it must be careful of Rock Slide flinches and Explosion.</p> <p><strong>Faster Pokemon</strong>: Jolteon can revenge kill a weakened Mew with its strong attacks, although it must be careful of Earthquake, as it 2HKOes Jolteon unboosted while Jolteon barely 3HKOes Mew in return. Other Pokemon like Gengar can take out Mew with Destiny Bond or Explosion, making them effective offensive checks.</p>",
    "sets": {
      "Lead Mew": {
        "description": "<h1>Set Description</h1> <p>Lead Mew is the most common Mew set due to its positive matchups against other common leads. Swords Dance gives Mew the ability to perform feats such as having a 76% chance to OHKO +1 Defense Lugia, having a 59% chance to OHKO +2 Defense Mewtwo with Explosion after one Swords Dance, and always OHKOing Tyranitar and Golem after two Swords Dances, making Mew one of the toughest Pokemon to switch into in Ubers, especially if its moveset has not yet been fully revealed. Thunder Wave helps Mew beat Barrier Mewtwo one-on-one, as one turn where Mewtwo gets fully paralyzed is enough for Mew to beat it with Explosion. Thunder Wave also helps Mew circumvent its Speed problem and allows it to always outspeed Pokemon like Gengar and Zapdos. Fire Blast OHKOes Forretress, an otherwise solid check to Mew, without having to sacrifice itself with Explosion; it also 2HKOes Skarmory, Steelix, and Exeggutor and 3HKOes Leftovers Cloyster while having very favorable chances to 2HKO Miracle Berry variants. The combination of Thunder Wave and Fire Blast gives Mew the best possible matchup against the majority of opposing leads. If these Pokemon are not an issue, and Mew instead wants to have a better matchup against offensive teams, it can run Thunder alongside Magnet to secure a near-guaranteed OHKO on Cloyster, denying the opponent's Spikes while still retaining the useful paralysis chance on Pokemon like Mewtwo and Gengar.</p> <p>Mew can also run Surf to OHKO Golem without needing to use Explosion, letting it be saved for another Pokemon like Mewtwo while retaining the 2HKO on Steelix; it is best used alongside Thunder to let Mew keep the ability to paralyze Mewtwo and beat it one-on-one.</p> <p>As for what item Mew can run, Miracle Berry is the standard for its one-time immunity against Lovely Kiss from Snorlax and Sleep Powder from Exeggutor while also helping Mew last a bit longer against Toxic Mewtwo variants. However, if Mew is running Thunder, Magnet can be considered as well.</p> <h1>Team Options</h1> <p>Potential teammates for Mew include Pokemon that can double down on the offensive prowess it provides, such as offensive Mewtwo. All-out attacker Mewtwo can, alongside Mew, break the opponent's team via coverage moves and a strong Self-Destruct that lets it beat foes such as Celebi and Ho-Oh that can annoy Mew depending on what moves it is running. Mew will usually be using Explosion on Pokemon like Snorlax, Zapdos, Tyranitar, Golem, and Mewtwo, so Pokemon that appreciate the mentioned threats being out of the picture, like Snorlax, Cloyster, Zapdos, Jolteon, and Vaporeon, also make for good teammates.</p>"
      },
      "Backline Mew": {
        "description": "<h1>Set Description</h1> <p>Mew can use its respectable bulk to be a good switch-in to all-out attacker Mewtwo and Gengar. Swords Dance allows Mew to dish out far more powerful attacks, giving it the ability to potentially 2HKO or 3HKO the majority of the metagame. Earthquake targets Rock- and Steel-type Pokemon like Tyranitar, Golem, Rhydon, and Steelix, 2HKOing the former three while 3HKOing the latter. Earthquake also targets other important Pokemon like Jolteon and Raikou. Another option Mew can run is Shadow Ball, as it provides a strong hit on Celebi, opposing Mew, and Mewtwo, 2HKOing all of them after a Swords Dance. However, Mewtwo can turn the tables on Mew if it is running Barrier. It is worth noting that both Earthquake and Shadow Ball hit Gengar super effectively. Rock Slide allows Mew to OHKO Ho-Oh, 2HKO Zapdos, and 3HKO Cloyster after a Swords Dance. Submission can be used if Mew wants to hit Snorlax harder without sacrificing itself with Explosion, as Curse Snorlax will eventually be bulky enough to withstand a boosted Earthquake without too many issues. A boosted Submission also OHKOes Tyranitar, something that Earthquake fails to do, which can be used to prevent Mew getting phazed by it; it also 2HKOes Umbreon. Lastly, Explosion is used in the last slot to enhance Mew's wallbreaking abilities. A boosted Explosion destroys even the bulkiest of physical walls like Barrier Mewtwo, Lugia, Umbreon, and even Skarmory. This, however, comes at the cost of Mew KOing itself and is a move that is usually telegraphed, so it can get pivoted around. Soft-Boiled is a more defensive option that Mew can run over Explosion to take advantage of its good defensive capabilities against offensive Mewtwo, Gengar, and potentially Zapdos. Unfortunately, running Soft-Boiled means that Mew will be unable to get past Barrier Mewtwo, Lugia, and Skarmory on its own and thus will need the help of its teammates. Mew can run almost any possible combination of moves desired and do it with high effectiveness. However, one combination advised against is Earthquake + Submission because it leaves Mew unable to get past Mewtwo, Zapdos, Celebi, Forretress, and opposing Mew.</p> <h1>Team Options</h1> <p>Mew appreciates Spikes weakening checks like Steelix, so both Cloyster and Forretress are good teammates. Cloyster in particular can hit both Steelix and Tyranitar with a strong Surf and use Explosion on a Pokemon like Snorlax or Celebi. Body Slam Snorlax can paralyze Mewtwo for Mew to have better chances of breaking through it without being forced to use Explosion. Tyranitar can beat Barrier Mewtwo and Lugia and weaken Cloyster for Mew, while Mew can weaken Steelix for Tyranitar and switch into offensive Mewtwo. Exeggutor can switch into Zapdos and threaten to heavily damage it, put something to sleep with Sleep Powder, and use its powerful Explosion and coverage to break past usual Mew checks like Mewtwo and the aforementioned Zapdos. Zapdos itself is a good teammate for Mew, as it commonly switches into Steelix and hits it hard with Hidden Power Water while forcing Steelix to use Explosion if it wants to hit back.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "corvere", "user_id": 306317}], "teams": [{"name": "Quality checked by", "members": [{"username": "Isa", "user_id": 168574}, {"username": "Mashing", "user_id": 537354}, {"username": "Conflict", "user_id": 37399}]}, {"name": "Grammar checked by", "members": [{"username": "aurora", "user_id": 109385}, {"username": "StupidFlandrs48", "user_id": 633500}]}]}
  },
  "Tyranitar": {
    "overview": "<p>Blessed with excellent stats all around, a unique typing, and an insane movepool, Tyranitar is one of the best Pokemon in GSC Ubers. Its ability to check very important Pokemon in the metagame, such as Snorlax, Mewtwo, Lugia, and Ho-Oh, coupled with key attributes like resisting Normal, having access to Curse and Roar, and having few special weaknesses means that Tyranitar fits perfectly on all kinds of teams from offense to stall. The rarity of effective checks to Tyranitar like Machamp and Nidoking in the metagame also means that Tyranitar usually feels less threatened to switch out once it starts boosting with Curse.</p> <p>However, Tyranitar often finds itself using Roar in conjunction with Spikes support as a way of making progress through teams, as the lack of a powerful STAB move means that it can't fully exploit its gargantuan base Attack stat and thus struggles with the bulky nature of the metagame. Furthermore, many teams are prepared for Tyranitar and have answers to it, such as Celebi, Golem, and Steelix, all of which greatly threaten Tyranitar, meaning a Curse Tyranitar sweep should only be considered when all of its checks are weakened or removed. Lastly, the relevance of Growth + Baton Pass Pokemon like Jolteon and Vaporeon in the tier hurts Tyranitar's ability to reliably check Pokemon it's supposed to, like Mewtwo.</p>",
    "comments": "<h1>Other Options</h1> <p>Screech can be used on Curse sets as an alternative to Roar, which potentially enables Tyranitar to beat Barrier Mewtwo and Curse Snorlax one-on-one. However, it is less reliable than Roar due to its low accuracy, and running Screech means that Tyranitar can't scout for threatening foes and chip them with Spikes support. Surf can also be used over one of Rest or Roar to hit Rhydon and Golem trying to take advantage of Tyranitar staying in on them. Lastly, either Hidden Power Bug or Earthquake can be used over one of Rest or Roar as well; Hidden Power Bug is Tyranitar's strongest available move that 2HKOes Celebi, while Earthquake OHKOes Jolteon at +1 and does good damage to opposing Tyranitar without offering much outside of that.</p> <p>On the 3 Attacks set, Pursuit can be an option over either Flamethrower or Surf to trap Pokemon like Mewtwo and, in particular, Gengar. However, Pursuit is an extremely weak move, and, unless Tyranitar drops the foe's Special Defense with Crunch, the Pokemon it's supposed to trap will usually stay in on it, rendering Pursuit useless. It's also worth noting that a boosted Pursuit deals the same amount of damage that a regular Crunch does. Lastly, Gengar is not a common enough Pokemon to justify running Pursuit, making Tyranitar be better off using other moves.</p> <p>An all-out attacker set with Rock Slide, Crunch, Flamethrower and one of Dynamic Punch or Surf is also an option to maximize Tyranitar's wallbreaking capabilities. However, it's a set that is very reliant on its teammates, as without Roar and Rest, Tyranitar can't effectively do its main role of checking Snorlax throughout a game.</p> <h1>Checks and Counters</h1> <p><strong>Ground-types</strong>: Ground-type Pokemon like Rhydon and Golem can immediately threaten to 2HKO Tyranitar with their Earthquake. Both Pokemon are OHKOed by Surf, however. Steelix gets a special mention, as it resists both of Tyranitar's STAB moves, can use Curse alongside Tyranitar to deny Roar attempts, and can hit back with a super effective Earthquake. However, it must be careful of Surf and Flamethrower. Marowak doesn't mind any attacks from Tyranitar aside from Crunch and Surf while threatening to OHKO Tyranitar with Earthquake.</p> <p><strong>Celebi</strong>: Celebi is one of the best answers to Tyranitar, as it can comfortably recover all health lost and hit back hard with a super effective Hidden Power Grass, forcing Tyranitar to use Rest or forcing it out. It should be careful of Fire Blast and Crunch variants, however, as they can potentially deal more damage to Celebi than it can recover if the respective secondary effects of their moves trigger.</p> <p><strong>Bulky Water-types</strong>: Pokemon like Vaporeon and Suicune don't mind any of Tyranitar's attacks and can proceed to hit hard back with Surf. Quagsire can use Haze to reset all of Tyranitar's Curse boosts and takes very little from Rock Slide, Crunch, and its coverage options. While it doesn't like switching into Tyranitar directly, Cloyster functions as one of the best Tyranitar checks in the tier thanks to its ability to immediately threaten to 3HKO it with Surf due to its superior Speed.</p> <p><strong>Giga Drain Exeggutor</strong>: Exeggutor can switch into Rock Slide and heal back the damage with Giga Drain; it should be careful of Crunch and Fire Blast variants, however.</p> <p><strong>Status</strong>: Pokemon like Snorlax and Exeggutor can switch into Curse Tyranitar and put it to sleep for up to six turns with Lovely Kiss and Sleep Powder, respectively, allowing Pokemon like Cloyster to come in on it for free. Toxic from Mewtwo and Forretress can eventually force Tyranitar to use Rest, leaving it similarly vulnerable.</p> <p><strong>Umbreon</strong>: Umbreon denies Curse Tyranitar's sweep attempts thanks to Charm and its good bulk. It also takes little to no damage from any of Tyranitar's coverage attacks.</p> <p><strong>Bulky Pokemon with Recovery</strong>: Pokemon like Soft-Boiled Mew and Recover Mewtwo are especially annoying to Tyranitar, as thanks to their good natural bulk, they can scout what set Tyranitar is running to pivot their teammates in accordingly.</p> <p><strong>Fighting-type Coverage</strong>: Pokemon like Mewtwo and Mew often run moves like Submission to immediately threaten Tyranitar with a 2HKO. Mew in particular can boost with Swords Dance and turn the 2HKO into an OHKO. Albeit rare, Machamp can KO Tyranitar even through Curse boosts thanks to Cross Chop and easily switches into it, as it resists both of its STAB attacks and is naturally bulky.</p> <p><strong>Heracross</strong>: Heracross takes a decent chunk from Rock Slide but can scare Tyranitar off with its STAB Megahorn and heal itself with Rest; it must be careful of Fire Blast, however.</p>",
    "sets": {
      "CurseTar": {
        "description": "<h1>Set Description</h1> <p>This is Tyranitar's most popular set thanks to its good role compression: checking Snorlax, Mewtwo without a Fighting-type move, and Lugia is invaluable for many teams. Curse lets Tyranitar comfortably wall non-Earthquake variants of Snorlax while making it a potential wincon. Rock Slide is Tyranitar's attacking move of choice, as there are no Pokemon immune to Rock-type attacks. Roar phazes Curse Snorlax and Barrier Mewtwo, making this Tyranitar set the most reliable check to them in the tier. Roar also prevents Tyranitar from being phazed by opposing Tyranitar while asleep. Rest gives this set necessary longevity, as without it, Tyranitar gets worn down too quickly, preventing it from properly checking Snorlax and Mewtwo; Rest also lets Tyranitar PP stall variants of Mewtwo without a Fighting-type move. Lowering Tyranitar's Speed EVs to 204 allows it to win the Curse war against opposing Curse Tyranitar and Lugia while Speed tying with Exeggutor: this also underspeeds -1 Speed Lugia and opposing Tyranitar at neutral Speed, which allows Tyranitar to not get phazed by them. Other phazers like Whirlwind Zapdos and Ho-Oh are also discouraged from phazing Tyranitar due to their critical weakness to Rock Slide.</p> <h1>Team Options</h1> <p>Even after a Curse boost, Mew will still threaten to break through Tyranitar with a boosted Submission. Therefore, checks to it such as Barrier Mewtwo and Curse Skarmory are good teammates. Cloyster can set Spikes for Tyranitar and help it against Ground-types such as Steelix, Golem, and Rhydon. Snorlax can form a double Curse combination with Tyranitar, as they both share the same checks and counters and so can work together to wear them down. Zapdos defeats Earthquake variants of Lugia for Tyranitar and scares out Cloyster; Tyranitar switches into Snorlax and Mewtwo in return.</p>"
      },
      "Roar + 3 Attacks": {
        "description": "<h1>Set Description</h1> <p>Tyranitar's large movepool and high attacking stats let it lure and remove checks to itself and its teammates. Even on a specially oriented set, Rock Slide is mandatory, as without it, Tyranitar would not be able to check key Pokemon like Zapdos and Ho-Oh. Roar phazes Curse Snorlax and lets Tyranitar scout for threats while potentially chipping them with Spikes support. Crunch hits Mewtwo and Celebi, two of the best checks to Tyranitar, for super effective damage; it also has the added benefit of being able to drop the foe's Special Defense, which can be useful in one-on-one scenarios against non-Earthquake variants of Snorlax and Lugia. Flamethrower is commonly chosen on the last slot to hit important targets like Forretress, Skarmory, and the rare Heracross for super effective damage. Surf can be used instead to hit Ground-types like Rhydon and Golem while hitting opposing Tyranitar decently hard. It's worth mentioning that both Flamethrower and Surf hit Steelix, a Pokemon that would otherwise wall both of Tyranitar's STAB moves.</p> <p>Fire Blast is another option over Flamethrower, as it can reach some benchmarks that Flamethrower can't. For example, Fire Blast gets a guaranteed 2HKO on Steelix that Flamethrower misses out on. Fire Blast also pressures Heracross harder, as it now has a chance of being 2HKOed.</p> <h1>Team Options</h1> <p>Offensive teams appreciate Tyranitar's wide coverage being able to lure Steelix, Forretress, and Skarmory. Given that Curse Snorlax can potentially break through Tyranitar, more offensive ways of handling it are important. Thus, teammates such as Explosion Cloyster, Mewtwo, Exeggutor, and Mew are needed. Jolteon and Vaporeon are other good offensive teammates, as they can use Growth and Baton Pass to allow Tyranitar to wallbreak a lot easier. Tyranitar checks Snorlax for them in return. However, Tyranitar is only a temporary check to Snorlax due to it not being able to break through Curse sets in a one-on-one scenario. Additionally, Tyranitar's usefulness is decreased if Snorlax is running Earthquake. As such, checks to Earthquake variants of Snorlax, such as Barrier Mewtwo and Curse Lugia, are recommended. Mono-attacker Snorlax appreciates Tyranitar's ability to cook Steel-types like Skamory, Forretress, and Steelix with Flamethrower, while it switches into Zapdos for Tyranitar in return.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "corvere", "user_id": 306317}], "teams": [{"name": "Quality checked by", "members": [{"username": "Isa", "user_id": 168574}, {"username": "Mr.378", "user_id": 5541}]}, {"name": "Grammar checked by", "members": [{"username": "Clas", "user_id": 545372}, {"username": "aurora", "user_id": 109385}, {"username": "Dawn of Ares", "user_id": 467437}]}]}
  },
  "Lugia": {
    "overview": "<p>By virtue of its behemoth bulk, access to Recover, and Flying typing which grants it a Spikes immunity, Lugia is the bulkiest Pokemon in GSC Ubers. 106 / 130 physical bulk allows Lugia to switch into almost every physical attacker and, paired with Curse and Whirlwind, beat them one-on-one. This makes Lugia a very valuable defensive piece for a lot of teams that can also work as a potential wincon. Its monstruous Special Defense also lets it avoid the 2HKO from every non-STAB Thunder, meaning only Pokemon like Zapdos and Jolteon can consistently 2HKO it with unboosted attacks. Lugia can even run moves like Surf and Toxic to turn the tables on Pokemon that usually give it trouble, like Golem, Steelix, and Rhydon, while supporting its team.</p> <p>However, Lugia struggles to deal meaningful damage until it gets going with Curse boosts. Furthermore, Lugia's strongest attack is Aeroblast, which has only 8 PP, so it can get stalled very easily by smart pivoting, restricting Lugia to only phazing foes until it can safely start attacking. Lastly, Lugia's inability to get past metagame beasts like Zapdos and Tyranitar limits its utility for the majority of the early- or mid-game to acting as a phazer and soft counter to physical attackers.</p>",
    "comments": "<h1>Other Options</h1> <p>Hydro Pump is an option on Curse sets over Whirlwind on Growth + Baton Pass teams. It allows Lugia to 3HKO Tyranitar, OHKO Golem, and 2HKO Marowak unboosted, and is not bothered by Curse, which means that Tyranitar can't boost its Defense to shrug the damage off. However, not having Whirlwind really hurts Lugia's late-game presence, as it can get phazed with relative ease. Hydro Pump also suffers from the same PP problem Aeroblast has, making it very hit-or-miss.</p> <p>Ice Beam is another option on Curse sets over Whirlwind to 3HKO Zapdos consistently, potentially 2HKO Golem and Rhydon, and threaten everything that switches into Lugia with a freeze. However, it doesn't do much outside of this, as Ice Beam is generally not a strong move, and not having Whirlwind means that Lugia can't be used to sweep until all enemy phazers are out of the picture.</p> <p>Mystery Berry is yet another option on Curse sets to help circumvent Lugia's PP problems, giving it more leeway to attack. However, not having Leftovers really hurts Lugia's ability to regularly switch into Pokemon, as now it is forced to use Recover more often.</p> <p>Lastly, support sets can run Thunderbolt over Surf to 2HKO Cloyster, as Cloyster commonly stays in on Lugia to inflict Toxic on it. However, not having Surf means that Pokemon like Golem, Rhydon, and Steelix now wall Lugia.</p> <p>Ice Beam is another option over Surf to pressure Zapdos with a 3HKO, threaten Golem and Rhydon with a potential 2HKO, and spread freeze. However, it doesn't offer much outside of this, and Lugia would much prefer running other options.</p> <h1>Checks and Counters</h1> <p><strong>Zapdos</strong>: Zapdos is one of the best counters to Lugia, as it fears nothing from it bar the rare Ice Beam and can 2HKO Lugia with STAB Thunder. Zapdos is also immune to Spikes, which means that Lugia can't wear it down via Whirlwind and Spikes damage. Lastly, Zapdos is bulky enough to withstand even a critical hit from Lugia and use Rest to heal all the damage done.</p> <p><strong>Electric-type Pokemon and Moves</strong>: Raikou resists Aeroblast and can 2HKO Lugia with Thunder but must be careful of Earthquake, as Lugia can potentially beat Raikou one-on-one if it has enough Curse boosts. Although it doesn't like switching directly into Lugia, Jolteon can force Lugia out with a Boosted Thunder. Pokemon that carry Thunder, such as Mewtwo, can also potentially threaten Lugia if paralysis triggers.</p> <p><strong>Rock- and Steel-type Pokemon</strong>: Tyranitar resists Aeroblast, has high enough bulk to ensure not even critical hits threaten it, can use Curse alongside Lugia, and can deny phazing attempts with Roar, making it one of the best checks to Lugia available. It must be careful of Earthquake, however, as the move has a chance to 2HKO it. Rhydon and Golem operate similarly to Tyranitar but are bulkier and thus not as afraid of Earthquake; they can even phaze a -1 Speed Lugia. Skarmory resists Aeroblast, can use Curse alongside Lugia, can deny phazing attempts with its own Whirlwind, and does not mind Earthquake thanks to its Flying typing. Lastly, Steelix is bulky enough for +1 Earthquake to not 2HKO it, can use Curse alongside Lugia to take even less damage, and can phaze Lugia with Roar.</p> <p><strong>Status Conditions</strong>: Paralysis, paired with very strong attackers like Marowak and Belly Drum Snorlax, can overwhelm Lugia very easily. Sleep-inducing moves from Snorlax and even Exeggutor can also ruin Lugia, as it doesn't commonly run Sleep Talk, so it can be a punching bag for up to six turns. Lastly, Toxic from the likes of Cloyster and Forretress is also annoying for Lugia, as it'll be forced to switch out eventually, losing all of its Curse boosts.</p> <p><strong>Physically Bulky Pokemon</strong>: Pokemon like Umbreon are sufficiently bulky to withstand even boosted attacks from Lugia. Umbreon can even negate any Curse boosts with Growl and cripple Lugia with Toxic. Other, more obscure Pokemon, like Miltank, can also deter Lugia's offense by denying Curse boosts with Growl and even potentially inflict a paralysis with Body Slam.</p> <p><strong>Haze Users</strong>: Quagsire can deny Lugia's Curse boosts with Haze, potentially stalling the PP out of Aeroblast in the process. Lugia will have to make the choice of attacking or not, as Quagsire lives a boosted Aeroblast and can heal all damage done with Rest. Other, more obscure Pokemon like Omastar can also use Haze to deny Lugia's sweep attempts, and Omastar does not care about critical hits because of its Rock typing, although it must be careful of Earthquake, as the move 2HKOes it at +1.</p>",
    "sets": {
      "Curse": {
        "description": "<h1>Set Description</h1> <p>This is Lugia's most consistent set. Curse and Whirlwind, coupled with its absurd bulk, allow it to check many threats with ease. It can easily switch into Vaporeon, Heracross, Snorlax, and Mew and phaze them with Whirlwind. Aeroblast is the only attacking move on this set, as there are no Pokemon immune to Flying-type attacks; its high critical chance can also overwhelm checks like Curse Snorlax and Barrier Mewtwo. Using Aeroblast and Whirlwind in concert turns Lugia into one of the most threatening late-game presences in Ubers.</p> <p>Earthquake is an option over Whirlwind, as Lugia commonly baits Tyranitar and other Pokemon weak to Ground, such as Steelix and Jolteon, into the field. However, not having Whirlwind means that Lugia is unable to beat Barrier variants of Mewtwo, a Pokemon that would otherwise be helpless against it, and is an infinitely worse late-game presence because Pokemon like Ho-Oh and opposing Lugia can phaze it.</p> <h1>Team Options</h1> <p>Lugia struggles heavily against Pokemon like Tyranitar, Golem, and Rhydon, all of which resist Aeroblast and can annoy Lugia with Roar. Because of this, Earthquake Snorlax is a good teammate, as it commonly lures them out while also checking other threatening Pokemon for Lugia, like Zapdos and Jolteon. Lugia, in return, can potentially beat Pokemon like Barrier Mewtwo for Snorlax. Pokemon that can lure in Electric-types like Zapdos and Raikou for Lugia, such as Exeggutor, Self-Destruct Mewtwo, and Self-Destruct Snorlax, are also good teammates. Cloyster and Forretress can lay down Spikes for Lugia, making its Whirlwind all the more threatening, and provide some offensive pressure with Toxic and Explosion. Cloyster additionally can threaten Tyranitar with its STAB Surf. On more defensive teams, Celebi is also a good partner for Lugia, as it can comfortably switch into the Electric-type Pokemon that annoy Lugia and use Heal Bell to ensure that status does not ruin Lugia.</p>"
      },
      "Supportive": {
        "description": "<h1>Set Description</h1> <p>This set trades Lugia's original approach of a Curse sweeper and turns it into a supporter for its team. Surf can OHKO Pokemon like Golem and Rhydon, 2HKO Marowak and Steelix, and potentially threaten Tyranitar. Toxic allows Lugia to put pressure on the enemy team by incurring crucial passive damage. This gives Lugia an option to put Pokemon like Zapdos, Tyranitar, and Cloyster on a timer. Cloyster will be pressured to use Explosion earlier after it's been poisoned, while Tyranitar and Zapdos will be forced to use Rest. Whirlwind lets Lugia phaze threatening Pokemon like Vaporeon, Snorlax, and Mew, as thanks to its massive bulk, it only fears Self-Destruct and Explosion from them.</p> <h1>Team Options</h1> <p>As this Lugia set doesn't carry ways to boost its Defense, physical attackers can overwhelm it. Additionally, Lugia can have trouble repeatedly switching into Pokemon like Snorlax, Marowak, Mew, and Mewtwo if it's paralyzed, so Pokemon like Barrier Mewtwo and Celebi are appreciated. Barrier Mewtwo can check threatening attackers alongside Lugia, while Celebi can provide Heal Bell support to ensure status does not ruin Lugia. Tyranitar can comfortably absorb Lovely Kiss from Snorlax and check Mewtwo without a Fighting-type coverage move; it can also potentially beat opposing Tyranitar one-on-one if it gets enough Curse boosts. In return, Lugia checks Pokemon like Mew and Earthquake Snorlax for Tyranitar.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "corvere", "user_id": 306317}], "teams": [{"name": "Quality checked by", "members": [{"username": "Mr.378", "user_id": 5541}, {"username": "Isa", "user_id": 168574}]}, {"name": "Grammar checked by", "members": [{"username": "dex", "user_id": 277988}, {"username": "Rose", "user_id": 511181}]}]}
  },
  "Ho-Oh": {
    "overview": "<p>Thanks to its astronomical bulk, 32 PP Recover, and good defensive typing, Ho-Oh makes for a very good wall capable of checking important Pokemon in the metagame like Mewtwo, Steelix, Gengar, Heracross, and non-Rock Slide Mew. It's also capable of phazing Pokemon like Curse Snorlax in a pinch thanks to its decent physical bulk. Access to Toxic helps Ho-Oh put Pokemon that would otherwise check it, like Tyranitar and Zapdos, on a timer. Ho-Oh also functions as a good lead on teams, as its massive bulk and the rarity of enemy leads that can threaten it such as Zapdos let it scout and gain information about the opposing team without much trouble while still applying some pressure itself thanks to its respectable Special Attack and Toxic.</p> <p>However, Ho-Oh is very susceptible to status moves like Lovely Kiss and Toxic, as they greatly hinder its ability to check the Pokemon it's supposed to check. A complete inability to get past Tyranitar means that Ho-Oh teams oftentimes find themselves having to deal with Roar + Spikes, which can wear Ho-Oh's team down quickly. Ho-Oh can also be lured out by Explosion from Mewtwo, Mew, and Gengar, all common users of the move and Pokemon Ho-Oh regularly switches into. The prevalence of Growth + Baton Pass Pokemon like Jolteon also hurts Ho-Oh's ability to check the Pokemon it's supposed to, like Mewtwo, as Ho-Oh can no longer switch into them if they have been a passed a Growth boost.</p>",
    "comments": "<h1>Other Options</h1> <p>Ho-Oh can run a set of Flamethrower, Recover, Earthquake, and one of Toxic or Whirlwind on teams that appreciate Ho-Oh baiting Tyranitar in and hitting it hard, potentially dealing enough damage for a teammate to finish it off. Earthquake also hits Jolteon hard, which, in conjunction with Whirlwind, can deny Growth + Baton Pass attempts, as Ho-Oh lives a +1 Thunder from full. However, running Earthquake means Ho-Oh needs to forgo one of Whirlwind or Toxic, potentially denying either the ability to phaze or the free turns Toxic can give. A set with Curse, Sacred Fire, Recover, and Return can be used, allowing Ho-Oh to become a potential late-game threat once Pokemon like Tyranitar are removed. Insane bulk coupled with Recover and Sacred Fire's chance to burn some phazers like Lugia and Tyranitar are some unique traits that Ho-Oh has over other Curse sweepers. However, Ho-Oh's early-game utility is then greatly reduced, with its damage output lacking even after a few Curse boosts due to a lack of physical STAB move. Furthermore, Ho-Oh also becomes unable to prevent phazing attempts due to the lack of Whirlwind on this set, making it only a late-game presence.</p> <h1>Checks and Counters</h1> <p><strong>Rock-types</strong>: Due to Ho-Oh's critical weakness to Rock, Rock-types naturally pose a big threat to it. Tyranitar is the best available counter to Ho-Oh, as it is capable of nullifying Toxic with Rest, negating Whirlwind with a slower Roar, and OHKOing Ho-Oh with Rock Slide while not minding Flamethrower. Rhydon is another Rock-type that can deal extreme damage to Ho-Oh, but it must be careful of Toxic, as it can quickly wear Rhydon down.</p> <p><strong>Electric-types and Coverage</strong>: Zapdos and Raikou both comfortably switch into Ho-Oh and scare it out thanks to their STAB Thunder; they also commonly run Rest, meaning that Toxic from Ho-Oh won't keep them down for long. Although it doesn't appreciate switching directly into Ho-Oh, Jolteon can boost its Special Attack with Growth and force it out. Electric-type coverage moves from Pokemon like Mewtwo and Gengar can also potentially scare Ho-Oh out.</p> <p><strong>Status and Explosion users</strong>: Paralysis, sleep, and poison all hinder Ho-Oh's ability to consistently check Pokemon it's supposed to check, like Mewtwo, non-Rock Slide Mew, Gengar, and weakened threats like Marowak. Even if not statused, Ho-Oh should still be careful of them, as Mewtwo, Mew, and Gengar can lure in and KO Ho-Oh with a well-timed Explosion. Other Pokemon like Snorlax, Cloyster, Steelix, Forretress, and Exeggutor can also use Explosion on Ho-Oh if it is paralyzed, so making sure Ho-Oh is not statused is key.</p> <p><strong>Water-types</strong>: Pokemon like Suicune and Quagsire don't care about anything Ho-Oh throws at them, as they commonly run Rest to shrug off any Toxic attempts and also resist Flamethrower. Starmie can come in on Ho-Oh and freely use Rapid Spin. These Pokemon can also hit Ho-Oh with a decently strong Surf. Vaporeon also scares out Ho-Oh thanks to Growth and Surf, as a +1 Vaporeon 2HKOes Ho-Oh.</p> <p><strong>Snorlax</strong>: Snorlax can comfortably switch into Ho-Oh and threaten to use it as setup fodder for Curse; it can also potentially use Love Kiss on Ho-Oh, rendering it useless for up to 6 turns. It should be careful of Toxic, however, as a Snorlax without Sleep Talk or Rest can be played around with relative ease.</p>",
    "sets": {
      "Standard Wall": {
        "description": "<h1>Set Description</h1> <p>Ho-Oh can be an annoyance to deal with, as there are no Pokemon in the game that can simultaneously deal with its respectable Special Attack stat, high-Base Power move in Flamethrower, and access to Toxic. Flamethrower is used over Sacred Fire because Sacred Fire only has 8 PP. Recover allows Ho-Oh to stay healthy throughout the game and consistently check threats like Mewtwo and Gengar. Whirlwind phazes Snorlax and Mew in a pinch while also phazing and threatening out Pokemon like Cloyster and Celebi, both of which can't do much to Ho-Oh. Ho-Oh has to be wary of the former's Explosion, though.</p> <p>Ho-Oh is a great soft check to many threats in GSC Ubers thanks to its insane bulk and 32 PP Recover, which give it and its team many ways of pivoting in and out of trouble. Being able to spread Toxic, deal damage with Flamethrower, and phaze with Whirlwind makes Ho-Oh a very irritable pressence for opposing teams to deal with.</p> <h1>Team Options</h1> <p>Ho-Oh is greatly hindered by status like paralysis, because getting fully paralyzed means Ho-Oh is no longer able to properly check Pokemon like Mewtwo and Gengar. Because of this, Heal Bell Celebi is one of the best possible teammates for Ho-Oh, as it helps against both status and counters to Ho-Oh like Tyranitar and Rest + Sleep Talk Zapdos. Ho-Oh, in return, checks very troublesome Pokemon for Celebi like Mewtwo and Heracross. While it has decent physical bulk and a good typing, Ho-Oh can still get overwhelmed by common physical attackers like Curse Snorlax. Because of this, having physically bulky Pokemon like Barrier Mewtwo and Skarmory is advised to give Ho-Oh and its team a strong defensive backbone. Barrier Mewtwo especially is a very good teammate for Ho-Oh, as it can check Pokemon that are very threatening to stall like Marowak. Secondary checks to Snorlax, like Forretress and Cloyster, are also good teammates, as they can also set Spikes that Ho-Oh can take advantage of with Whirlwind.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "corvere", "user_id": 306317}], "teams": [{"name": "Quality checked by", "members": [{"username": "Mr.378", "user_id": 5541}, {"username": "Isa", "user_id": 168574}]}, {"name": "Grammar checked by", "members": [{"username": "aurora", "user_id": 109385}, {"username": "UT", "user_id": 523866}]}]}
  },
  "Celebi": {
    "overview": "<p>Celebi has great stats, and resistances to three of the most popular attack types in the game is never bad (Water / Electric / Ground). One thing Celebi doesn't get its due credit for is being able to stall out the average Snorlax and force it to Rest without taking much damage thanks to Leech Seed. It also learns Heal Bell, which is one of the most valuable moves for a stall team, and is still useful for others.</p>",
    "comments": "<h1>Other Options</h1> <p>Perish Song can act as a phazing move. Celebi can just stall with Recover until the three rounds are up. It pulls the Perish Song job very well with its good defenses. It also allows a stall team to not worry about a last-Pokemon Curse sweep. Giga Drain is a good move but frankly it isn't advisable. Celebi already has a recovery move, and unlike Exeggutor, Celebi is more defensive and should be played as such. An interesting option you could try is Curse coupled with Baton Pass, but it might leave you in a bind when Houndoom shows up.</p> <h1>Checks and Counters</h1> <p>Houndoom and Tyranitar are really the only Pokemon that will take it down with certainty. Espeon can set up Substitute and Growth before passing to a teammate with Flamethrower. Zapdos has a chance to stop it with Drill Peck. Jynx has a good chance too, thanks to the double threat of STAB Ice Beam and Lovely Kiss, and its low HP means Celebi won't regain much with Leech Seed. If Celebi is paralyzed, Heracross and Pinsir make good counters. Charizard may be able to set up a Belly Drum on Celebi, or just nail it with STAB Fire Blast. Really though, Celebi can be hard to take out.</p>",
    "sets": {"Standard": {"description": "<p>This is a support set and pretty much all that Celebi has going for it in GSC. Heal Bell helps the rest of the team, Recover helps Celebi itself, Psychic gets STAB and uses Celebi's good Special Attack, and Leech Seed can force switches.</p>"}}
  }
}