{
  "Exeggutor": {
    "comments": "<h1>Other Options</h1> <p>Hidden Power Dark has been used in the Uber metagame for a while, but a lot of things still take nearly no damage from it as Ubers tend to have high Special Defense (Latios, Latias, and Kyogre, for example). Hidden Power Ice can be used in Ubers to hit Rayquaza. Wish is useful in any metagame.</p> ",
    "sets": [
      {"name": "Double Powder", "description": "<p>Only, and I mean ONLY use this set on a team containing Groudon. Drought will automatically trigger Chlorophyll and remove Solar Beam's charge up turn. Exeggutor is an excellent counter to an enemy Groudon, as long as it doesn't use Hidden Power Bug or a Fire move. Solar Beam is an easy OHKO on it, but don't use it too soon--you will swiftly be met by Kyogre, Rayquaza or some other Uber that walls you, so catch one with Sleep Powder, then paralyze the next with Stun Spore. Unless the sun is shining, Exeggutor is quite useless in Uber battles because almost everything but Groudon walls it, so don't be afraid to Explode. Psychic is not on this set because a lot of things resist it.</p> "},
      {"name": "SubSeed", "description": "<p>With Chlorophyll, Exeggutor outspeeds just about everything and can perform Sceptile's SubSeed technique quite well. Leech Seed your opponent, and keep using Substitute to drain its health down. This is very useful to drain Blissey's health and support the rest of the team.</p> "}
    ]
  },
  "Omastar": {
    "overview": "<p>Omastar is one of the premier rain sweepers in ADV Ubers, utilizing Swift Swim to outspeed most of the unboosted metagame in rain barring very fast Pokemon such as Ninjask and Deoxys-S, as well as Rayquaza with its unique Air Lock ability. Omastar exerts strong offensive pressure with its high Special Attack stat and punishes switches by laying down Spikes to wear down the opponent's team. Its Rock typing and high Defense also protects it from the premier revenge killer in the metagame, Deoxys-A, instead revenge killing it in rain. Offensive rain teams appreciate Omastar's wallbreaking ability and how it reliably forces progress through setting Spikes and using Thief to steal items, limiting the longevity of opposing teams. Omastar does suffer from having very low special bulk and weaknesses to common offensive types, meaning that many Pokemon it can't OHKO such as Latios, Mewtwo, and Groudon can easily take it out, neutering offensive potential from the teams Omastar finds itself on. It also faces some competition from Qwilfish, another Swift Swim user with access to Spikes and a useful tool in Self-Destruct.</p> ",
    "comments": "<h1>Other Options</h1> <p>Mystic Water and Toxic are both options Omastar can use instead of Thief, letting it hit harder and threaten poison on walls, respectively. The presence of Refresh Latios and Latias makes the latter much harder to pull off, though, with them threatening it out while no longer fearing losing an item. Protect Snorlax with Immunity can also take even Mystic Water-boosted hits while not fearing Toxic. A Modest nature can also be run to give Omastar more power while still outrunning maximum Speed neutral nature Deoxys-A, but no longer outspeeding maximum Speed positive nature Deoxys-A can be costly. A Petaya Berry set with Substitute can make Omastar a potent late-game sweeper, but it loses the utility of Thief or immediate damage from other options like Mystic Water.</p> <h1>Checks and Counters</h1> <p><strong>Kyogre: Kyogre—Omastar's best partner—is also one of its hardest walls. Hydro Pump does little damage even in rain, and Kyogre can threaten it with an OHKO from Surf or Hydro Pump, inflict paralysis with Thunder Wave, or heal off any damage Omastar does with Rest.</p> <p><strong>Blissey</strong>: Blissey easily survives multiple Hydro Pumps and can spread status or set up Light Screen to further wall Omastar. However, it hates having its Leftovers stolen by Thief and being worn down by Spikes as it switches in.</p> <p><strong>Rayquaza</strong>: Rayquaza can effectively disable Swift Swim with Air Lock, allowing it to outspeed Omastar and OHKO with Earthquake even in rain.</p> <p><strong>Bulky Revenge Killers</strong>: Omastar struggles to OHKO some very powerful but bulky Pokemon even in rain such as Mewtwo, the Lati twins, and Choice Band Snorlax or Metagross, meaning they can often force Omastar to switch out or sacrifice itself for some damage.</p> <p><strong>Groudon: Groudon setting sun makes Omastar essentially unviable, removing its revenge killing niche. Groudon can also easily outspeed Omastar in sun and OHKO it with Earthquake.</p> ",
    "sets": [
      {
        "name": "Spikes Setter",
        "description": "<h1>Set Description</h1> <p>Omastar functions best as a revenge killer and should be used very offensively, forcing switches against weakened or offensive Pokemon and threatening bulky ones with its item displacement ability and Spikes. Fast-paced rain teams love Spikes and Omastar's wallbreaking wearing down and threatening defensive Pokemon. When boosted by rain, Hydro Pump is an incredibly powerful STAB option, being used over weaker, more accurate Water-type moves to achieve feats such as possibly 2HKOing specially bulky Pokemon like Deoxys-D and Jirachi. Ice Beam is used for Dragon-types like Latios, Latias, and the rare defensive Salamence, as well as bulky Water-resistant Pokemon like Celebi, being strong and having a good amount of PP to fire off in a longer game. Thief is a very useful move that Omastar is one of the few users of, being able to remove Leftovers from Pokemon like Blissey and Snorlax while holding no item, as well as the very important Soul Dew from Latios and Latias. This deters a lot of Pokemon from switching into Omastar making Thief a very effective and important part of its success. A Timid nature with 252 Speed EVs is used to outrun maximum Speed Deoxys-A in rain.</p> <h1>Team Options</h1> <p>Due to it succeeding best on offensively-inclined rain teams, Omastar's best partners are ones that can take advantage of it setting Spikes and stealing items to chip down common threats. Kyogre is a mandatory partner, being the only way to set permanent rain for Omastar to thrive in. With an extensive movepool, it can also pressure Blissey, Latios, and Latias, which Omastar loves having chipped or removed from the game. Petaya Berry Deoxys-A is another potent rain attacker, using mixed wallbreaking power with Superpower to threaten checks to Omastar such as Blissey and Snorlax while heavily denting others like Latias with boosted Ice Beam. Snorlax serves as a bulky check to offensive Pokemon that Omastar can't break past unless chipped, such as the Lati twins and Mewtwo, while appreciating Spikes wearing down its own checks like Forretress and Metagross. With Spikes being such a crucial part of Omastar's gameplan, Gengar works as a solid offensive spinblocker to deter Forretress, which can live a Hydro Pump from Omastar in rain. Gengar also has access to Thief, enabling a double Thief core that can displace multiple important items from the opponent.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 306959, "username": "SuperEpicAmpharos"}, {"user_id": 273339, "username": "Lasen"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}], "writtenBy": [{"user_id": 511624, "username": "Fc"}]}
  },
  "Snorlax": {
    "overview": "<p>With its high bulk, strong Attack, and expansive movepool, Snorlax is one of the tier's most effective offensive and defensive Pokemon. Curse Snorlax is one of the most difficult Pokemon to check around, being difficult to KO, offensively threatening, and able to customize its set to defeat its potential counters. Defensively, Snorlax is one of the most important checks to Latios and Latias, and it soft checks a variety of other threats including Mewtwo, Deoxys-A, Jirachi, and Regice. Snorlax is also a highly effective wallbreaker, capable of forcing trades with Curse or with STAB Self-Destruct, which is stronger than every Explosion. Immunity and Thick Fat are both useful abilities on an already good defensive Pokemon, blocking one of the most prevalent ways of stalling Snorlax out or making it a highly effective Ice- and Fire-type sponge. However, Snorlax's unboosted physical bulk is not great, and many Pokemon run Fighting-type moves almost exclusively to take advantage of it. Snorlax is also very slow and has no options to rectify this weakness beyond spreading paralysis, meaning that once it is at low health, it is effectively KOed.</p> ",
    "comments": "<h1>Other Options</h1> <p>Snorlax has the bulk to utilize Counter, but it's a high-risk, high-reward choice. Toxic can seriously punish a few conventional Snorlax responses, but most of Snorlax's common switch-ins are immune to this move. Belly Drum boosts Snorlax's Attack to absurd levels and could be paired with Rest and a Chesto Berry for instant recovery, but Snorlax checks and potential revenge killers are very common, so this set is largely outclassed by those already discussed. Sunny Day is a very niche option that can be used to punish Kyogre.</p> <h1>Checks and Counters</h1> <p><strong>Ghost-types: Ghost-types such as Dusclops, Gengar, and Shedinja are immune to Snorlax's most spammable move, and potentially to its entire moveset. Beyond this, each of them also has potential tools to debilitate or defeat Snorlax.</p> <p><strong>Skarmory and Forretress: Skarmory and Forretress have high Defense, resist Snorlax's STAB moves, and are immune and neutral to Earthquake, respectively. They can proceed to set up Spikes, but they, especially Forretress, fear getting caught by Fire Blast in sun. Note Skarmory can also phaze Snorlax, while Forretress may be forced to check it via Explosion after boosts.</p> <p><strong>Other Steel-types and Regirock</strong>: Pokemon such as Metagross, Steelix, Registeel, and Regirock have high defenses, resistances to Snorlax's STAB moves, and the power to hit back hard with strong physical moves, but they fear coverage moves such as Earthquake, Focus Punch, or Fire Blast in sun.</p> <p><strong>Kyogre and Groudon: Although they dislike switching into Snorlax and may take heavy damage from its STAB attacks, Kyogre and Groudon have the sheer power to easily beat Snorlax one-on-one or break through its Curse set.</p> <p><strong>Defensive Lugia</strong>: Defensive Lugia has the bulk and longevity to pivot into Snorlax and set Reflect or threaten Curse sets with Whirlwind. However, defensive Lugia is also KOed by Self-Destruct, does not like getting hit by Toxic, and cannot threaten Snorlax if Snorlax is the last Pokemon available.</p> ",
    "sets": [
      {
        "name": "Offensive CurseLax",
        "description": "<p>Curse helps Snorlax cover its mediocre physical bulk while simultaneously building enough power to wallbreak or clean late-game. Body Slam for STAB is fairly strong, accurate, and has a high chance to paralyze foes, which can help teammates, allow Snorlax to actually outspeed a threat, or grant Snorlax even more turns to set up or heal. Return is also an option for additional power, which can especially help for muscling through Pokemon such as Groudon, Kyogre, Latios, Latias, and Mewtwo. Protect is a valuable move to increase Leftovers recovery and scout moves, especially from Choice Band users—which teammates can easily handle if they lock into a Fighting-type move—or Pokemon with Explosion or Self-Destruct such as Metagross, Forretress, and Mewtwo. Shadow Ball and Earthquake are both worthy coverage options to combat the Ghost-, Steel-, and Rock-types intent on countering Snorlax such as Metagross, Forretress, Jirachi, Steelix, Omastar, Dusclops, Gengar, Shedinja, Regirock, and Registeel. Shadow Ball is more common because Earthquake leaves Snorlax completely helpless against Gengar and Shedinja. Fire Blast is also notable, especially on sun teams, for blasting Skarmory and Forretress; two common Snorlax switch-ins that seek to lay Spikes. Self-Destruct sacrifices longevity and cleaning ability for maximum wallbreaking potential. Rest allows Snorlax to remove status and continue boosting against Pokemon that are unable to 4HKO it, which form a substantial portion of the tier after a Curse. Rest is most potent against stall teams, and it should typically be run alongside Shadow Ball; no Pokemon is immune to both Ghost and Normal, letting Rest Snorlax eventually break through all foes with enough boosts. Sleep Talk can be used alongside Rest to make the most of its sleep turns.</p> <p>252 Special Defense EVs with a Careful nature are important to minimize damage from Latios, Latias, and Mewtwo, and because Special Defense is the defensive stat Snorlax cannot increase via setup. 136 Defense EVs allow Snorlax to always avoid being 2HKOed by Groudon's Earthquake after one Curse. The remaining 120 HP EVs further increase Snorlax's overall bulk, but these can also be placed in Attack for additional damage output early on, which can be especially helpful when running Return. A more offensive EV spread of 104 HP / 152 Atk / 252 SpD can be justified on sets with Protect to supplement recovery, and it further increases Snorlax's wallbreaking potential against Kyogre, Latios, and Latias. Immunity or Thick Fat is utilized depending on team needs; Immunity prevents Toxic from debilitating Snorlax or forcing it to use Rest, while Thick Fat helps it tank attacks such as Latios's Ice Beam and Mewtwo's Fire Blast.</p> <p>CurseLax functions on a variety of teams and archetypes, and it can customize its movepool, EVs, and even ability to meet specific needs of a team. This particular set appreciates cleaners and sweepers that appreciate Snorlax's ability to pressure Groudon, Kyogre, Latios, Latias, and defensive Steel-types. Offensive CurseLax especially appreciates secondary and tertiary Latios and Latias checks, which relieve its pressure to check these threats while allowing it to wallbreak more aggressively. Therefore, Pokemon capable of taking Thunder such as Steelix, Shedinja, Blissey, Groudon, and Swampert, or Dragon Claw such as Metagross, Forretress, Jirachi, or Registeel, are good teammates. Pokemon that pressure Kyogre and Groudon can help Snorlax break through them, such as Mewtwo, Metagross, Ho-Oh, Steelix, and Rayquaza. Spikes support makes offensive CurseLax especially potent, as it wears down several of its major checks, so setters such as Forretress, Skarmory, Deoxys-D, Deoxys-S, Omastar, and Qwilfish are great choices. Trappers such as Magneton and Dugtrio that can remove Steel-types are natural offensive partners.</p> "
      },
      {
        "name": "Amnesia CurseLax",
        "description": "<p>Curse helps Snorlax cover its mediocre physical bulk while simultaneously building enough offensive power to clean. Amnesia makes it nearly impossible for special attackers to break through Snorlax, being especially helpful for Latios, Latias, Kyogre, and Mewtwo. Importantly, it also lets Snorlax continually threaten several Calm Mind users and use Rest less often. Rest allows Snorlax to remove paralysis and burns, and it keeps Snorlax a long-term threat against Pokemon that are unable to 4HKO it, which form a substantial portion of the tier once it has boosted its defenses. Body Slam for STAB is fairly strong, accurate, and has a high chance to paralyze foes, which can be exploited by teammates, allow Snorlax to actually outspeed a threat, or grant Snorlax even more turns to set up or heal. The EV spread allows Snorlax to check Latios, Latias, and bulky Ho-Oh long-term; it also performs especially well against Groudon and lets Snorlax weather Mewtwo Self-Destruct into Spell Tag Deoxys-A Superpower. Immunity is utilized to prevent Snorlax from needing to use Rest for Toxic.</p> <p>Like Curse Snorlax as a whole, Amnesia CurseLax is very customizable to a team's needs and fits on many archetypes. It still appreciates a secondary Latios and Latias check to relieve its pressure to check them, especially ones that can take Thunder such as Steelix, Shedinja, Blissey, Groudon, and Swampert, or Dragon Claw such as Metagross, Forretress, Jirachi, and Registeel. Pokemon that can pressure Kyogre and Groudon facilitate Snorlax cleaning through them, such as Mewtwo, Metagross, Ho-Oh, Steelix, and Rayquaza. Spikes support makes CurseLax especially potent, as it wears down several of its major checks, so setters such as Forretress, Skarmory, Deoxys-D, Deoxys-S, Omastar, and Qwilfish are great choices. Trappers such as Magneton and Dugtrio that can remove Steel-types are natural offensive partners.</p> "
      },
      {
        "name": "Choice Band",
        "description": "<p>A Choice Band brings insane power to the most powerful explosion move in the game, and it further boosts Snorlax's coverage options to potentially blow past conventional checks. Shadow Ball allows Snorlax to hit Gengar and Shedinja, which it could otherwise not touch, and also tackles Dusclops. Fire Blast can be used over Shadow Ball with sun support for hitting Skarmory and Forretress. Focus Punch is viable, as it's typically only used when the opponent is forced to switch, and it does major damage to most Normal-resistant foes. Earthquake also hits most Steel- and Rock-types hard, but it has overall lower power than Focus Punch and is potentially easier to exploit with immune foes. Body Slam is a strong and accurate STAB move with a high chance to paralyze foes, which can be exploited by other teammates, allow Snorlax to potentially outspeed a target it's hit, and make Snorlax more difficult to switch into. Alternatively, Return's additional power is great for blasting through many important Pokemon such as Groudon, Kyogre, Latios, Latias, Mewtwo, and Ho-Oh. STAB Self-Destruct with a Choice Band is absurdly powerful, OHKOing any Pokemon that does not resist it and even OHKOing some that do. Immunity allows Choice Band Snorlax to safely switch into Blissey and forces Pokemon such as Lugia and Skarmory to use moves other than Toxic. Thick Fat allows Snorlax to \"resist\" Ice Beam and Fire Blast, especially from the likes of Mewtwo. A Brave nature should be used if running Fire Blast.</p> <p>Choice Band Snorlax functions best on offense teams that have several other Latios and Latias checks, thereby allowing Snorlax to take a more offensive role, so offensive checks such as Metagross, Ho-Oh, Steelix, Regice, and Deoxys-A are great picks. Spikes support helps Choice Band Snorlax break through Steel-types, Groudon, Kyogre, and several other foes more easily, so setters such as Forretress, Skarmory, Deoxys-D, Deoxys-S, Omastar, and Qwilfish make good teammates. Trappers like Magneton and Dugtrio can remove Steel-types and serve as great offensive partners. Choice Band and mixed wallbreakers or cleaners such as Groudon, Deoxys-A, Mewtwo, Ho-Oh, Metagross, Rayquaza, and Heracross can help Snorlax to overload defensive cores, especially ones with opposing Groudon and Kyogre.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 306959, "username": "SuperEpicAmpharos"}, {"user_id": 127823, "username": "Inspirited"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}, {"user_id": 109385, "username": "Aurora"}]}], "writtenBy": [{"user_id": 222996, "username": "Minority"}]}
  },
  "Mewtwo": {
    "overview": "<p>Mewtwo is one of the fastest Pokemon in the Ubers metagame, with a practically unmatched base 130 Speed. It also possesses a Special Attack stat that even surpasses Kyogre, a movepool that covers almost every scenario, and the bulk to back it all up. Mewtwo's movepool is vast enough that it leaves the opponent always guessing what moveset it's running, with even physical sets also being an option. However, its Psychic typing leaves it susceptible to some of the metagame's biggest threats in Snorlax and Deoxys-A, which check it defensively and offensively, respectively. Moreover, Mewtwo often struggles to fit everything it wants in just four moves. While its potential is practically limitless, its sets are usually telegraphed based on just the item revealed. However, mind games can still be played with the opponent up until the final move is revealed.</p> ",
    "comments": "<h1>Other Options</h1> <p>A mixed set similar to the Bulk Up set carrying Ice Beam or Thunder instead will have a better matchup versus Lugia and Ho-Oh, but it both sacrifices bulk and worsens your matchup against Snorlax. Choice Band Mewtwo can be a powerful breaker that overwhelms its checks alongside other strong physical attackers, but it can only realistically fit on teams that aim to blow up on their competition, something that regular Mewtwo can already do while simultaneously breaking physical walls with its strong special attacks. Taunt is an option on the lead set to be able to take on Deoxys-D leads, but the utility Calm Mind provides is way more valuable in most cases, especially since Taunt only lasts for two turns in ADV. Hidden Power Rock on more physically inclined sets lets Mewtwo defeat Ho-Oh without relying on Thunder's low accuracy and weather, but it is extremely situational, as it only hits one specific threat that can be dealt with through Mewtwo's teammates.</p> <h1>Checks and Counters</h1> <p><strong>Snorlax: Snorlax is a great answer to Mewtwo sets not running Focus Punch, being able to take on the combination of any special attack followed up by Self-Destruct while threatening to 2HKO with either Shadow Ball or Return. Snorlax can also use Protect on a predicted Self-Destruct to save its HP. However, if it's more offensive rather than bulky, it has to be wary of Thunder's damage output and chance to paralyze.</p> <p><strong>Deoxys-D</strong>: Deoxys-D can stop Mewtwo from setting up with Taunt, slowly chip it with Night Shade, remove its item with Knock Off, and inflict it with status, but it has to be wary of sets running Shadow Ball.</p> <p><strong>Dusclops</strong>: Dusclops can switch in on Mewtwo's Self-Destruct while also having enough bulk to take on its special attacks and retaliate with Shadow Ball or keep its HP high with Pain Split. It has to be wary of sets running Taunt, though, as they tend to shut it down completely.</p> <p><strong>Ho-Oh</strong>: Ho-Oh is usually seen on sun teams and can rely on Thunder's low accuracy and its natural bulk to be able to take on any of Mewtwo's other moves while threatening it out with a strong physical attack. If Thunder does land, however, Ho-Oh will take a lot of damage, so it has to be extremely careful.</p> <p><strong>Revenge Killers</strong>: Weather sweepers like Exeggutor, Victreebel, and Omastar, Jolly Aerodactyl, and priority users in Rayquaza and Deoxys-A can all attack before Mewtwo and pick it off with their strong attacks if it's been sufficiently weakened. Deoxys-A in particular can always outspeed and threaten to OHKO Mewtwo with Shadow Ball. None of them can safely switch in, though, as they can be OHKOed by Mewtwo's attacks.</p> <p><strong>Heracross: Heracross can OHKO Mewtwo with Megahorn and either force it to switch out or use Self-Destruct, but it has to scout for the rare Fire Blast, which can easily OHKO it.</p> ",
    "sets": [
      {
        "name": "Boom Lead",
        "description": "<h1>Set Description</h1> <p>This set is designed to beat all of the common leads while also having staying power if you decide to keep it around for later use. Ice Beam and Thunder threaten Groudon and Kyogre, allowing your respective weather setter to set themselves up nicely while also paving the way for Mewtwo's teammates to sweep. Ice Beam also 2HKOes the common Latios lead, while Mewtwo isn't threatened by any move it runs, thus forcing it out early. It similarly pressures Latias leads, which are KOed by the combination of Ice Beam and Self-Destruct. Thunderbolt is an option over Thunder if you are scared of the low accuracy that Thunder has outside of rain. It also provides a consistent way to damage Ho-Oh in sun, a common switch-in, but it comes with the downside of worsening the Kyogre matchup. Self-Destruct allows Mewtwo to trade itself for one of the opponent's valuable team members, giving control of the game's momentum at any given time. This can be used to remove a foe like Blissey, which cannot survive the combination of a special attack followed up by Self-Destruct, or offensive Ho-Oh, or it can be used to severely chip a defensive wall that is problematic for the rest of your team. Due to the turn ending once Mewtwo uses Self-Destruct, the opponent cannot recover HP afterwards. Calm Mind allows Mewtwo to set up in front of the aforementioned Latios and Latias. Importantly, this allows Mewtwo to OHKO Kyogre and Groudon with Thunder and Ice Beam, respectively, and avoid the OHKO from any of their offensive moves. Mewtwo has to be wary of Hydro Pump variants of Kyogre, however, as it cannot survive a hit without a Calm Mind boost, but it also can't set up consistently in front of Kyogre because Surf variants can 2HKO regardless. Some Snorlax sets can be 3HKOed by +1 Thunder while Mewtwo avoids the 2HKO from Body Slam. Fire Blast can deal with the Steel-types that might want to try and switch in to take Self-Destruct, such as Jirachi and Metagross, as well as lead Heracross, which otherwise threatens Mewtwo into switching out or trading itself. Attack investment isn't necessary, seeing how Mewtwo's Attack stat is just large enough to get the KOs it is after with some prior chip. A Mild nature optimizes Mewtwo's lead matchup, avoiding the OHKO from physical attacks such as Groudon's Earthquake and Snorlax's Body Slam and special attacks such as from Latios and Latias. Lum Berry allows Mewtwo to act as a pseudo-status absorber, ignoring potential Thunder Waves from Kyogre and Groudon, as well as the secondary effects of Ice Beam, Thunder, and Body Slam. Mewtwo's base 130 Speed allows it to outspeed positive-natured base 110 Pokemon such as Lugia, Latios, and Latias with a neutral nature. A spread running 220 Speed EVs and 36 HP EVs lets Mewtwo take hits just a slight bit better while still outspeeding the same targets, but it comes at the cost of always losing the mirror matchup.</p> <h1>Team Options</h1> <p>Mewtwo can fit on pretty much every team and playstyle, but it's preferable on offense for its ability to effectively remove any threat with Self-Destruct or even act as a wallbreaker utilizing Calm Mind. Kyogre allows Mewtwo to hit perfectly accurate Thunders and appreciates Mewtwo weakening its checks in Latios, Latias, and Blissey. Similarly, Mewtwo enjoys Kyogre dealing with the Steel-types that it cannot always beat and Kyogre's ability to sponge hits from its checks such as Ho-Oh and Deoxys-A. Groudon can cover most of what Mewtwo cannot, being an effective check to Snorlax and Deoxys-A that also enjoys the Eon twins being either weakened or removed entirely. Offensive Groudon sets such as the SubSalac set can sweep the opposing team with more ease if its checks like Lugia and Ho-Oh have been damaged enough. Physical wallbreakers such as Choice Band Heracross and Metagross pair up well with Mewtwo, with Mewtwo exposing their checks' usually low Special Defense sets or trading its health with their own. Snorlax similarly enjoys Mewtwo being able to check Latios and Latias so that it can function more as a mid-game breaker rather than a wall. Deoxys-A shares a lot of checks with Mewtwo and can thus overwhelm with its strong physical moves once they've been weakened enough.</p> "
      },
      {
        "name": "Substitute + Bulk Up",
        "description": "<h1>Set Description</h1> <p>This set aims to lure in common switch-ins to the standard Mewtwo set and blow them back with a physical move. Substitute in tandem with 204 HP EVs allows Mewtwo to create Substitutes that can withstand a Seismic Toss from Blissey and Dusclops and lets Mewtwo fish for misses from inaccurate moves such as Heracross's Megahorn and Thunder outside of rain. Bulk Up allows Mewtwo to beat common physical walls such as Forretress and boost alongside Snorlax. Shadow Ball hits Latios and Latias for super effective damage and is Mewtwo's best move to spam, as it hits most of the metagame for at least neutral damage. Focus Punch pairs well with Substitute and has perfect coverage with Shadow Ball. Earthquake is an option to hit Steel-types such as Metagross and Jirachi harder than Focus Punch while also not requiring a Substitute or correct prediction to function, serving as a strong midground. 96 Speed EVs with a Jolly nature allow Mewtwo to hit 352 Speed, which is just enough to outpace maximum Speed Latios, Latias, and Lugia.</p> <h1>Team Options</h1> <p>Strong Normal-type attackers such as Snorlax and Slaking form a good pair with this Mewtwo set, as there is good offensive overlap. Mewtwo shares checks with them, so they all benefit from Steel-types such as Forretress being gradually chipped from their strong physical attacks. Mewtwo also significantly damages common answers to these Normal-types like Deoxys-D and Lugia. Kyogre pairs quite well, being able to switch into the physical attacks thrown Mewtwo's way while also dealing with the walls Mewtwo struggles to break such as Ho-Oh. Mewtwo can chip Latios, Latias, and Blissey in return, all of which are roadblocks for Kyogre. Groudon is a fantastic partner regardless of its set, with the defensive set being able to take on the physical attackers that Mewtwo can't switch into such as Deoxys-A and Ho-Oh, while the SubSalac set uses the Steel-types that Mewtwo invites in as setup opportunities. In return, Mewtwo removes opposing Psychic-types that often stop Groudon in its tracks such as the Eon twins, opposing Mewtwo, and Lugia. Magneton can remove the Steel-types that Mewtwo sometimes struggles to deal with such as Forretress and also spread paralysis with Thunder Wave so Mewtwo can set up Substitute more freely. Spikes from Deoxys-D, Skarmory, and Forretress is much appreciated, as Mewtwo forces multiple switches upon its set reveal. It also turns various 3HKOs into 2HKOs, such as Metagross switching into an Earthquake.</p> "
      },
      {
        "name": "Substitute + Calm Mind",
        "description": "<h1>Set Description</h1> <p>This set aims to utilize Mewtwo's demonstrably large Special Attack and good bulk to act as either a mid-game breaker or even a late-game setup sweeper. Thunder and Ice Beam have perfect coverage, only being mutually resisted by Magneton, which easily gets overwhelmed by this set. Thunderbolt is a safer option to deal with sun teams better, but the drop-off in power is immediately noticeable, with Ho-Oh and Forretress both avoiding the 2HKO from it. The HP EVs allow Mewtwo to create Substitutes that can withstand a Seismic Toss from Blissey and Night Shade from Deoxys-D. Substitute is utilized to avoid status moves and also scout for the foe's set, avoiding unfavorable trades such as Explosion from Metagross and Self-Destruct from Snorlax. 220 Speed EVs let Mewtwo outspeed positive-natured base 110 Pokemon such as Latios, Latias, and Lugia.</p> <h1>Team Options</h1> <p>Groudon is a good partner, as it provides sun support for Mewtwo so that it can't get frozen by Ice Beam. In return, Mewtwo can deal with Kyogre, Latios, and Latias, all of which are common switch-ins for Groudon. Moreover, Groudon can spread status with either Thunder Wave or Toxic and scare out common Mewtwo checks such as Steel-types and Snorlax. Physical variants of Deoxys-A can pick off weakened foes with its strong attacks or chip the opponent's Steel-types so that Mewtwo can more easily sweep in the later parts of the game. Ho-Oh is also a fantastic partner, being able to burn physical attackers with Sacred Fire, hinder them with Toxic, or deal a great deal of damage with Hidden Power Flying and Shadow Ball. Meanwhile, Mewtwo can stand up to physical walls that Ho-Oh is unable to immediately break, such as Groudon and Lugia. Mewtwo doesn't want to immediately take on the various Steel-types, so Forretress and Skarmory both chipping them gradually with Spikes support and also being a switch-in to their strong physical attacks makes them ideal partners for Mewtwo. Latios is a fantastic partner for this Mewtwo set because they both pressure Snorlax with their special attacks, making Snorlax struggle to cover both of them.</p> "
      },
      {
        "name": "StallTwo",
        "description": "<h1>Set Description</h1> <p>This set attempts to act as a stallbreaker, a job Mewtwo can fulfill rather well thanks to its great Speed tier and large support moveset. Taunt shuts down opposing walls in tandem with Pressure, easily PP stalling them. It also lets Mewtwo beat Pokemon that don't run any attacking moves, such as Lugia. Toxic can put bulky walls and powerful attackers on a timer alike. Flamethrower lets Mewtwo hit the Steel-types that Toxic doesn't affect while also dealing decent neutral damage if rain isn't up. Thunder can be used if you're opting to run rain, hitting Steel-types for a decent amount of damage, as well as Ho-Oh, which otherwise is unfazed by the rest of your set. The EVs provided allow Mewtwo to outrun positive-natured Latios, Latias, and Lugia while maximizing Mewtwo's special bulk. This allows Mewtwo to inflict them with Toxic effectively and use Taunt on them to stop them from recovering their HP or curing their status affliction with Refresh.</p> <h1>Team Options</h1> <p>Mewtwo is susceptible to getting functionally removed from the game if it gets frozen, so Groudon pairs nicely by setting sun, which also boosts up Mewtwo's damage output with Flamethrower. In return, Mewtwo can deal with the special attackers that wish to take advantage of Groudon. Cleric support in case Mewtwo gets statused is very beneficial, so Blissey and Celebi can both provide that while checking various breakers that Mewtwo cannot such as Calm Mind Kyogre and Curse Snorlax, respectively. Physically defensive Spikes setters such as Deoxys-D, Skarmory, and Forretress form a good pair with Mewtwo, as Mewtwo can take on the special attacks thrown their way while forcing switches while they take on the breakers Mewtwo invites in such as Snorlax. Ho-Oh fits on teams that feature this Mewtwo set quite well, being able to take on opposing Ho-Oh, which is a major threat to Mewtwo, while Mewtwo can take on the physical walls that Ho-Oh struggles with such as Deoxys-D and Blissey if not running Hidden Power Flying. Kyogre can take on Groudon and Ho-Oh, both of which can deal with Mewtwo to some extent, and give it a perfectly accurate Thunder.</p> "
      },
      {
        "name": "Calm Mind MonoAttacker",
        "description": "<h1>Set Description</h1> <p>This set aims to take over the game once the foes that threaten to OHKO Mewtwo are gone. Taunt, while lasting only for two turns, allows Mewtwo to beat phazers and opposing setup sweepers alike. This combination of moves allows Mewtwo to take on Blissey and defensive Lugia regardless of their sets. Ice Beam hits the greatest array of physical attackers for at least neutral damage, with notable exceptions being Steel-types and Thick Fat Snorlax. Psychic deals more damage to Ho-Oh and Snorlax but comes at the cost of dealing significantly less damage to the many Psychic-types of the metagame such as Latios, Latias, and Lugia while still being resisted by Steel-types, most of which are physical attackers and can thus break through Mewtwo. The given EV spread with a Timid nature always makes it faster than Latios, Latias, and Lugia while giving it as much physical bulk as possible to better take on physical attackers such as Groudon and Snorlax and survive a hit from Choice Band Deoxys-A.</p> <h1>Team Options</h1> <p>Groudon sets sun so that Mewtwo cannot be frozen and is thus less vulnerable to RNG while also scaring away Steel-types. In return, Mewtwo can deal with problematic physical walls such as Deoxys-D, Celebi, and Lugia, which can all be cumbersome for Groudon to bypass. Spikes makes Mewtwo's job of sweeping much easier by providing some nice passive damage. As a result, Deoxys-D, Skarmory, and Forretress can all make for great partners while also dealing with the Steel-types that otherwise make Mewtwo's job rather difficult. Mewtwo struggles to break past Steel-types, so teammates that can answer to their attacks such as Kyogre and Ho-Oh pair well with it. In return, Mewtwo can take on their checks such as Blissey and the Eon twins. Choice Band Deoxys-A can revenge kill Mewtwo if Mewtwo has taken any chip, so Pokemon that can remove Deoxys-A are appreciated. Pursuit users such as Metagross, Umbreon, and your own Deoxys-A force Deoxys-A out and remove it quite effectively. As this set is usually fit for bulkier teams, cleric support from the likes of Blissey or Celebi is appreciated. They can take Kyogre and Snorlax on, respectively, both of which stop Mewtwo short from sweeping.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 246168, "username": "Exiline"}, {"user_id": 306959, "username": "SuperEpicAmpharos"}]}, {"name": "Grammar checked by", "members": [{"user_id": 302985, "username": "lotiasite"}, {"user_id": 240732, "username": "Astra"}]}], "writtenBy": [{"user_id": 273339, "username": "Lasen"}]}
  },
  "Mew": {
    "overview": "<p>Mew's well-rounded stats and almost unmatched movepool mean it can fulfill almost any role its team requires it to. While its stats are nothing to scoff at, they're not particularly noteworthy either, leaving it in the shadow of at least one Pokemon in any given role it wishes to fill. Mewtwo in particular is a direct upgrade in most cases. However, one can use both on offensive teams because Species Clause bans just using two Mewtwo.</p> ",
    "comments": "<h1>Other Options</h1> <p>Rock Slide can be run on the Swords Dance set over Earthquake to beat Ho-Oh at the cost of hitting Steel-types. Soft-Boiled is another Swords Dance option so that Mew can get more boosts, but running coverage is usually better. An itemless set utilizing Thief is a neat idea to cripple Latias, Latios, Kyogre, and Groudon, but simply attacking is usually more useful. Ice Beam is a good way to chip Groudon, Latios, and Latias but means missing out on a lot of the utility that other moves provide. Hypnosis can take a Pokemon out of commission, but its horrible accuracy and direct competition with Thunder Wave mostly makes it undesirable.</p> <h1>Checks and Counters</h1> <p><strong>Ho-Oh: Mew's offensive stats are not good enough to break through Ho-Oh, which can avoid a 2HKO from Thunder and force Mew to use Explosion in quite a telegraphed manner. It cannot take on said Explosion if it's been chipped, however.</p> <p><strong>Snorlax</strong>: Snorlax has enough bulk to take on any special attack Mew throws its way and often runs Protect to scout for Explosion. However, a bad prediction can mean it gets OHKOed by Explosion.</p> <p><strong>Ghost-types</strong>: Albeit rare, Ghost-types such as Dusclops and Gengar can take on Mew's special attacks and ignore Explosion, but they do not appreciate being paralyzed.</p> <p><strong>Heracross: Heracross can outspeed Mew and OHKO it with Megahorn while dodging an OHKO from Fire Blast.</p> <p><strong>Sun Teams</strong>: Groudon can take any one hit from Mew, and the usual backbones of sun teams can easily handle Mew's moveset and have ways to sponge Explosion.</p> ",
    "sets": [
      {
        "name": "Lum Berry Explosion Lead",
        "description": "<h1>Set Description</h1> <p>This Mew can function as a potent anti-lead, having a good matchup against the majority of the metagame. Thunder Wave paralyzes common leads such as Kyogre, Latios, and Latias. With the Special Attack investment, Thunder 3HKOes Kyogre. Fire Blast puts Groudon in KO range of Explosion and beats Steel-types that might want to switch in to take the Explosion. Explosion removes anything that doesn't resist it, paving the way for sweepers such as Mewtwo and Deoxys-A. 80 Defense EVs avoid a 2HKO from standard Groudon and an OHKO from Deoxys-A's Shadow Ball, while 52 Special Defense EVs allow Mew to avoid being 2HKOed by Latios's Dragon Claw and OHKOed by offensive Kyogre's Hydro Pump. 20 Speed EVs allow Mew to outspeed Deoxys-D and most defensive Kyogre and Groudon. Lum Berry helps deal with paralysis from Thunder Wave, Thunder, and Body Slam. Taunt is an option to shut down Deoxys-D, Curse Snorlax, and Swords Dance Groudon without needing to use Explosion.</p> <h1>Team Options</h1> <p>Mew's sole purpose as a lead is to give Mewtwo-like utility while freeing you up to use Mewtwo in the back. They form a potent Explosion + Self-Destruct core that removes at least two foes. Even if Mewtwo isn't running Self-Destruct, it appreciates Mew overwhelming its checks. Offensive Normal-types such as Snorlax and Slaking greatly enjoy Mew beating Steel-types with Fire Blast or chipping them with Explosion. Groudon enjoys its checks in Latios, Latias, and Kyogre being paralyzed by Thunder Wave or Thunder, or even being OHKOed by Explosion, allowing it to win the weather war and use Earthquake more freely. Choice Band Deoxys-A also appreciates Mew using Fire Blast and Explosion against Steel-types and Explosion on Snorlax, as it can then lock itself into Extreme Speed or Shadow Ball.</p> "
      },
      {
        "name": "Swords Dance",
        "description": "<h1>Set Description</h1> <p>Swords Dance Mew is a decent wallbreaker. Shadow Ball hits very common Psychic-types like Latios, Latias, Lugia, and Deoxys-D. Explosion will assuredly blow away almost anything that doesn't resist Normal. Earthquake gives great coverage, taking care of most Steel-types that resist Shadow Ball. Brick Break is a reliable compromise that hits both the Steel-types like Forretress and Metagross and the Normal-types like Snorlax and Blissey at the cost of dealing less damage to the former. 220 Speed EVs with a Jolly nature allow Mew to outspeed Modest Latios, Modest Latias, and any Rayquaza. Lum Berry allows Mew to offensively check Snorlax, Latios, and Latias without fear of status.</p> <h1>Team Options</h1> <p>As this set is usually not seen in the lead slot, a Mewtwo lead can cover most of Mew's checks by overwhelming them with its powerful coverage, taking advantage of the significant overlap in their checks. Snorlax is a good partner, as Mew can weaken Steel-types and take on Ho-Oh for Snorlax while also forming a good pivot core that can take physical Deoxys-A's best moves in Superpower and Shadow Ball. Choice Band Heracross and Deoxys-A are amazing partners, sharing their checks with Mew in defensive Kyogre, Groudon, and Ho-Oh and overwhelming them so that one can sweep.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 306959, "username": "SuperEpicAmpharos"}, {"user_id": 246168, "username": "Exiline"}]}, {"name": "Grammar checked by", "members": [{"user_id": 331519, "username": "CryoGyro"}, {"user_id": 517429, "username": "Adeleine"}]}], "writtenBy": [{"user_id": 273339, "username": "Lasen"}]}
  },
  "Wobbuffet": {
    "overview": "<p>Due to its access to Shadow Tag, Wobbuffet stands as one of the main trappers in ADV Ubers, along with Magneton, Dugtrio, and Umbreon. Wobbuffet separates itself from the other trappers with its superior bulk and the ability to immediately trap any foe. Shadow Tag has no limitation on what can be trapped, which allows Wobbuffet to remove at least one opposing Pokemon in most games. In addition, Wobbuffet's access to Encore prevents it from becoming setup fodder. Encore in conjunction with Shadow Tag can provide teammates with valuable setup opportunities as well.</p> <p>However, Wobbuffet's utility in ADV Ubers is limited due to the overall lack of Choice Band users, as Pokemon that can utilize Choice Band often prefer other items. In addition, most Pokemon carry at least one non-damaging move, which forces Wobbuffet into mind games with Encore. Its passive nature is also exploited by some setup sweepers, meaning that one incorrect read can prove devastating. While Wobbuffet's bulk may ease predictions, its inability to hold Leftovers limits the number of hits it can take: Wobbuffet is banned from holding Leftovers, as Wobbuffet vs. Wobbuffet will always result in an unending battle due to ADV's Struggle mechanics.</p> ",
    "comments": "<h1>Other Options</h1> <p>With only eight available moves, Wobbuffet's other options are rather limited. Either Tickle or Charm can be used to prevent physical attackers from successfully setting up.</p> <p>Other than alterations to Speed investment, no other EV modification will prove very effective. Spreads with 252 HP EVs and either 252 Defense or 252 Special Defense EVs do not change any crucial 2HKOs into 3HKOs. Most boosted attacks from strong setup sweepers will 2HKO Wobbuffet regardless of its HP investment.</p> <h1>Checks and Counters</h1> <p>A key definition of a counter is having the ability to switch in and remove or force out a target Pokemon. By virtue of its ability in Shadow Tag, it may be said that Wobbuffet does not have any true counters. The best way to defeat it is by exploiting its passive moveset and low Speed.</p> <p><strong>Faster Pokemon</strong>: The easiest way to stop Wobbuffet is by utilizing a fast Taunt user. Taunt Mew and Mewtwo can bypass Encore and proceed to set up on Wobbuffet. Skarmory and Deoxys-D can similarly stop Encore and Safeguard to set up Spikes or use Toxic. Additionally, any faster Pokemon with the ability to poison or burn Wobbuffet will quickly neutralize it. However, be wary of becoming locked into a status move, as Wobbuffet can set up Safeguard and switch out into a dangerous setup sweeper.</p> <p><strong>Counter-trappers: Dugtrio and Umbreon can counter-trap Wobbuffet. However, Dugtrio must get around Counter to defeat it. Umbreon can trap Wobbuffet with Mean Look and use Baton Pass to bring in a setup sweeper, leaving Wobbuffet helpless as the foe sets up safely behind a Substitute.</p> <p><strong>Ghost-types: Ghost-type Pokemon with physical moves such as Gengar and Dusclops can attack Wobbuffet without the fear of retaliation from Counter due to their Fighting immunity. However, they must be wary of Destiny Bond.</p> <p><strong>Strong Setup Sweepers: Strong setup sweepers that can 2HKO Wobbuffet can force awkward predictions. Kyogre deserves a special mention due to its ability to 2HKO Wobbuffet with its rain-boosted attacks prior to any setup. Therefore, Wobbuffet must win a 50/50 with either Encore or Mirror Coat to get around Kyogre. The same holds true for any setup sweepers that boost as Wobbuffet switches in, given that they can 2HKO Wobbuffet after setting up.</p> <p><strong>Self-Destruct and Explosion users: Self-Destruct and Explosion from the likes of Metagross, Forretress, and Snorlax will OHKO Wobbuffet, or at least weaken it to the point that it is essentially out of the game.</p> ",
    "sets": [
      {
        "name": "Oh, no! It's Wobbuffet!",
        "description": "<h1>Set Description</h1> <p>Using Wobbuffet is simple. Lead with it or switch it in for a revenge KO. Given its good bulk, it can also directly switch into some attacks. Thereafter, Encore is usually the move of choice. If the opposing Pokemon is locked into a damaging move, use Counter or Mirror Coat accordingly. If the foe is locked into a status move, take the opportunity to freely switch into a setup sweeper. Safeguard is usually the preferred final move to protect Wobbuffet and other team members from status. This is especially useful for providing setup sweepers with a safe switch. Alternatively, Destiny Bond can be used to better deal with Pokemon that lack status moves. Against a foe that can 2HKO or 3HKO Wobbuffet, Destiny Bond can at least either punish further setup or force a trade.</p> <p>Wobbuffet is best at removing Choice item users. These include Deoxys-A, Ho-Oh, Rayquaza, Metagross, and, less frequently, Groudon, Snorlax, and Lugia. No single attack from these Pokemon can OHKO a full-health Wobbuffet without a critical hit, and Counter will easily KO back. Choice Band Heracross not locked into Megahorn can also be removed. Lum Berry is the preferred item to cure Wobbuffet of status once.</p> <h1>Team Options</h1> <p>Wobbuffet is a generalist when it comes to trapping. Unless an opposing Pokemon can outpace Wobbuffet and afflict it with poison or burn, it is a target for removal. In theory, Wobbuffet can support any Pokemon.</p> <p>Since most priority users hold Choice Band, Wobbuffet can give Salac Berry users like Groudon, Heracross, and Kyogre an opportunity to sweep. Removing the likes of Choice Band Deoxys-A and Ho-Oh can also increase the sweeping potential of Pokemon such as Mewtwo, Latios, and Latias.</p> <p>The combination of Encore and Shadow Tag also makes strong yet frail setup Pokemon good partners. Pokemon that usually have a difficult time finding setup opportunities can take advantage of Wobbuffet's ability to provide a safe setup turn. This makes Pokemon such as Belly Drum + Baton Pass Smeargle, Substitute Deoxys-A, and Dragon Dance Rayquaza good teammates. Choice Band Swellow can also be an interesting partner; simply lock a foe into a status move, switch Swellow in, and freely spam boosted Facade. A teammate with Roar and Whirlwind such as Kyogre, Groudon, and Ho-Oh can also be used as insurance to prevent foes locked into a setup move from becoming an issue.</p> "
      },
      {
        "name": "Blob-Removing Blob",
        "description": "<h1>Set Description</h1> <p>This set aims to remove most special walls besides Deoxys-D. Slower special walls are all susceptible to being trapped by this set. This includes common special walls such as Blissey and Snorlax. While Dugtrio can also fulfill this role, Wobbuffet's superior bulk gives it the ability to directly switch into these Pokemon. Lum Berry is the preferred item, as it cures Wobbuffet of status once. The given Speed EVs allow Wobbuffet to outpace most special walls, while the given Defense EVs allow Wobbuffet to take a +6 Body Slam from an uninvested Snorlax.</p> <p>Once in play, Wobbuffet can proceed to either use Safeguard against predicted status moves or use Encore to lock opposing Pokemon into both damaging and setup moves. Counter is preferred over Mirror Coat, as it allows Wobbuffett to damage Snorlax locked into a physical move. Destiny Bond ensures that Wobbuffet can secure trades, even against special attacking walls.</p> <p>Against Seismic Toss users, it is advisable to not use Encore until Wobbuffet is within 3HKO range. If a trapped Pokemon lacks any damaging moves, Wobbuffet will likely PP stall it due to Counter and Safeguard’s high PP. Wobbuffet can also defeat faster special walls, such as Jirachi, Ho-Oh, and Latias, if it manages to Encore a damaging move.</p> <h1>Team Options</h1> <p>Strong special attackers such as Latios, Latias, Mewtwo, and Kyogre make fine partners for this set, as Wobbuffet can pave the way for them to sweep with its ability to remove special walls from play. Any additional Pokemon that support this cause are desirable teammates. For example, Metagross can be used to remove offensive checks to Wobbuffet, such as Deoxys-A and Latios, as well as secondary special walls on stall teams.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 306959, "username": "SuperEpicAmpharos"}, {"user_id": 127823, "username": "Inspirited"}]}, {"name": "Grammar checked by", "members": [{"user_id": 109385, "username": "Aurora"}, {"user_id": 277988, "username": "dex"}]}], "writtenBy": [{"user_id": 382514, "username": "Noitu"}]}
  },
  "Forretress": {
    "sets": [{"name": "Support", "description": "<p>Forretress has a lot of useful resistances in Ubers, including Psychic, Ice, and Dragon as well as Toxic. Hidden Power Bug 2HKOes Latias, Latios, Mewtwo, and the like and OHKOes Deoxys-A. Forretress can set up Spikes and use Rapid Spin to get rid of Spikes set up by enemy Forretress and Deoxys-D. Counter lets it take a hit from the likes of Rayquaza, Groudon, and the rare Heracross and OHKO back. It also helps against physical Tyranitar. Hidden Power is also always countered, regardless of its type, so if you encounter a Hidden Power Fire Forretress, you can take the hit, survive with the Special Defense EVs (enemy Forretress needs near max Special Attack and sunlight to OHKO this Forretress spread), and OHKO it back, leaving the way clear for your Spikes to dominate. The given EVs ensure Forretress will always survive a +1 Special Attack Deoxys-A Thunder, so you're safe from anything but the rare Fire Punch on that end.</p> "}]
  },
  "Skarmory": {
    "overview": "<p>Skarmory's Flying typing makes it an even more effective check than other Steel-types to all the physical attackers such as Metagross and Snorlax that rely on Earthquake to hit Steel-types. This comes with the added bonus of being hit neutrally by Fighting and Rock, too, making it an effective check to Superpower Deoxys-A and Rock Slide Groudon and one of the sturdiest physical walls in the metagame. Skarmory's utility movepool allows it to fill multiple roles by offering Spikes support, phazing, and Taunt backed up by a decent Speed tier. However, Skarmory's Flying typing makes it even more susceptible to being trapped by Magneton than Forretress, and it takes neutral damage from Latios's, Latias's, and Mewtwo's Ice Beam. It also faces stiff competition from other defensive Steel-types due to lacking both Explosion and reliable recovery. Primarily, it competes with Forretress, which offers Rapid Spin support on top of Spikes, better base HP, and Explosion.</p> ",
    "comments": "<h1>Other Options</h1> <p>172 Special Attack EVs on the defensive set guarantee a Pursuit OHKO on Deoxys-A switching out without a layer of Spikes, but the investment leaves Skarmory frailer than it'd like to be. Hidden Power Fire on teams with sun support can 2HKO even specially defensive Forretress, but it's too reliant on sun being up, and rain makes it unusable. Counter allows Skarmory to absorb a strong hit such as boosted Groudon's Rock Slide or Metagross's Hidden Power Fire to KO them, but it's extremely situational.</p> <h1>Checks and Counters</h1> <p><strong>Magneton: Magneton can trap Skarmory and OHKO with Thunderbolt, but it must be wary of Hidden Power Ground.</p> <p><strong>Ho-Oh</strong>: Ho-Oh can use Sacred Fire to OHKO Skarmory and is immune to Spikes. It doesn't like being poisoned by Toxic, however.</p> <p><strong>Strong Special Attackers</strong>: Latios, Latias, Mewtwo, and Kyogre can all easily OHKO Skarmory with their coverage moves, or STAB moves in Kyogre's case.</p> <p><strong>Forretress: Forretress can set Spikes alongside Skarmory while also threatening to remove Spikes from its side of the field with Rapid Spin. Hidden Power Fire under sun will do a lot of damage to Forretress, though.</p> <p><strong>Fire- and Electric-type Coverage</strong>: Metagross, Snorlax, Deoxys-A, and Groudon can all run some form of Fire- or Electric-type coverage to KO Skarmory. Skarmory can scout for it with Protect, however.</p> ",
    "sets": [
      {
        "name": "Defensive Spikes",
        "description": "<h1>Set Description</h1> <p>Whirlwind helps rack up damage through Spikes and prevents Skarmory from being setup fodder for Heracross and Calm Mind wallbreakers such as Latias, Latios, and Kyogre. Toxic gives Skarmory another way to pressure its foes and puts the opponent's sweepers like Swords Dance Groudon and Calm Mind Kyogre on a timer. Taunt is an option to stop Forretress from setting Spikes, prevent last Pokemon Snorlax from setting up with Curse, and shut down Blissey's utility. Pursuit allows Skarmory to be an effective answer to Deoxys-A, with 100 Special Attack EVs guaranteeing an OHKO on it switching out after Spikes. Protect allows Skarmory to get more recovery from Leftovers while also letting it scout for a foe's Fire- or Electric-type coverage. A set utilizing Drill Peck with a spread of 252 HP / 4 Atk / 252 Def hits Blissey for a fair bit of a damage and puts Latios in range of +1 Kyogre's Ice Beam.</p> <p>Skarmory can set Spikes so that powerful wallbreakers such as Deoxys-A, Calm Mind Mewtwo, and Latios can run through their checks. Notably, Snorlax is put in 3HKO range by the latter two's unboosted Thunder after just one layer. Skarmory's extremely poor special bulk can be mitigated by walls such as Blissey and Snorlax, both being able to sponge hits from Latios and Latias. Blissey also provides an answer to Kyogre and appreciates how Skarmory can switch into Groudon and Deoxys-A and potentially remove the latter. Magneton and Dugtrio can both trap opposing Magneton, ensuring that Skarmory can check the opponent's physical wallbreakers. Groudon and Ho-Oh together can help Skarmory immensely, as Ho-Oh covers Skarmory's weakness to Fire, while Groudon's sun makes Thunder inaccurate.</p> "
      },
      {
        "name": "Magneton Lure",
        "description": "<h1>Set Description</h1> <p>This set attempts to lure in Magneton and KO it with Hidden Power Ground while also providing Spikes support. Whirlwind stops Skarmory from being complete setup fodder while stacking the damage from Spikes. Toxic can put foes on a timer, being extremely useful to catch a special attacker that wishes to switches into Skarmory like Kyogre or Calm Mind Latios. Taunt stops Forretress and Deoxys-D from setting their own Spikes while also limiting Blissey's utility. Maximum Speed with a Jolly nature ensures that Skarmory at worst Speed ties with opposing Magneton, with maximum Attack allowing for an OHKO on offensive variants and a 2HKO on bulkier ones.</p> <p>As this Skarmory doesn't invest in bulk, it is usually found on more offensive teams. Strong wallbreakers such as Deoxys-A, Calm Mind Latios, Mewtwo, and Choice Band Lugia appreciate their checks being chipped by Spikes and Magneton being gone. Groudon can take on some of the burden of checking physical attackers, as this Skarmory forgoes defensive investment, while also taking Electric-type attacks. Metagross can act as a secondary Steel-type, threatening Latios and Latias while also being able to lure Ho-Oh in and OHKO it with Rock Slide.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 127823, "username": "Inspirited"}, {"user_id": 306959, "username": "SuperEpicAmpharos"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}, {"user_id": 517429, "username": "Adeleine"}]}], "writtenBy": [{"user_id": 273339, "username": "Lasen"}]}
  },
  "Blissey": {
    "overview": "<p>Blissey is incredibly specially bulky and has no special weaknesses, making it a fantastic general purpose special wall. Its options for team support are also superb, as it possesses one of the most valuable support moves in the tier, Heal Bell, plus moves such as Wish and Toxic. Blissey's physical bulk is surprisingly acceptable, but it still leaves it weak to the strong physical attackers in the tier, such as Deoxys-A and Groudon.</p> <p>Unfortunately, its offensive presence is minimal, forcing it to rely on Toxic and Seismic Toss to pressure foes, which can't significantly threaten foes such as Snorlax and Metagross. This passivity has also given rise to specialist sets from special attackers that can beat it one-on-one by taking advantage of its reliance on Toxic to set up, such as Substitute + Calm Mind Mewtwo and Rest + Calm Mind Kyogre. Furthermore, it has a significant Spikes weakness and lets its users in easily. Finally, it faces competition as a check to Latios and Latias from Snorlax, which has much more offensive presence but somewhat less bulk and longevity.</p> <p>Blissey generally fits best on defensive or balance teams that can provide the significant support it needs and take advantage of the equally significant support it provides.</p> ",
    "comments": "<h1>Other Options</h1> <p>A Calm Mind / Thunder / Ice Beam / Soft-Boiled set with a Calm nature and a 4 Def / 252 SpA / 252 SpD spread is okay against other setup users and can threaten Steel-type switch-ins more effectively, but Blissey cannot threaten most of its switch-ins without Toxic and it offers significantly less team support without Heal Bell. Ice Beam or Thunder can be used over Seismic Toss to hit certain targets—either Groudon and Latios or Kyogre—more effectively, but generally not effectively enough, as Blissey cannot afford to invest in its somewhat weak Special Attack. Finally, Thunder Wave and Sing are status options over Toxic; they lose the important function of beating most setup sweepers but can still be useful. Thunder Wave can help teammates like Kyogre and Groudon fish for full paralysis.</p> <h1>Checks and Counters</h1> <p><strong>Status-Blocking Setup Sweepers: Despite Blissey's incredible special bulk, it will still lose to Substitute + Calm Mind Kyogre and Mewtwo, Rest + Calm Mind Kyogre, and Refresh + Calm Mind Latias; even Mewtwo without Substitute can use Self-Destruct to remove it and create a massive hole in Blissey's team.</p> <p><strong>Spikes Users: Forretress, Deoxys-D, and Skarmory can significantly impede Blissey's longevity by forcing it to take damage when switching in. All three of these can switch into Blissey, although Deoxys-D must be wary of taking Toxic on the switch.</p> <p><strong>Toxic-Immune Pokemon: Pokemon such as Metagross and Immunity Snorlax can freely switch in on any move but Seismic Toss and generally aren't significantly harmed by even that; they can hit Blissey hard on its weaker Defense or, in Snorlax's case, set up Curse.</p> <p><strong>Physical Attackers: Physical attackers such as Groudon, Ho-Oh, and Deoxys-A generally can't come in on Blissey easily for fear of Toxic, but they can threaten its weaker Defense significantly if they do.</p> <p><strong>Trappers: Wobbuffet and Dugtrio, though rather less common than the above, can generally remove Blissey very effectively—Wobbuffet by PP-stalling it and Dugtrio by hitting it with Earthquake.</p> ",
    "sets": [
      {
        "name": "Blissey",
        "description": "<h1>Set Description</h1> <p>Blissey's flagship set stonewalls most special attackers, including Kyogre, Mewtwo, Latios, and Latias; it cleanly beats any sets that don't have means to combat status, and it can even force Refresh Latios and Latias to use a move—Recover or Refresh—that a teammate such as Deoxys-A can switch in on to threaten them. Soft-Boiled combined with Natural Cure allows it to continue to take powerful special attacks indefinitely and be resilient to status. Toxic and Seismic Toss together can at least mildly threaten most foes. Heal Bell provides invaluable support to the team, but Wish is a usable alternative. The EVs provided maximize its mixed bulk; a Bold nature can be used over Calm to improve its matchup against physical attackers such as Ho-Oh and support Groudon, but the improved special bulk is generally more important.</p> <p>Instead of Seismic Toss, Light Screen can give a phazer, usually Lugia, a chance to beat setup by protecting it while it phazes, but it worsens Blissey's matchup against Steel-types. Snatch can defeat Latias and Latios by preventing them from removing Toxic with Refresh, as well as cushioning Blissey against Substitute + Calm Mind users by stealing Calm Mind from them. Other possibilities for the moveslot are Psych Up, which can boost its Special Defense alongside Calm Mind users similarly to Snatch, and Icy Wind, which can slow Latias down for Taunt + Toxic Deoxys-D to beat. Flamethrower or Fire Blast can be used instead of Seismic Toss on sun teams to hit Steel-types significantly harder at the cost of being worse against most other targets and being disruptable by Kyogre's rain. It is also possible to run a spread of 180 HP / 76 Def / 252 SpD to avoid being 2HKOed by Kyogre's Hydro Pump in rain even when switching in on a Calm Mind, although this will immensely reduce Blissey's ability to take physical hits.</p> <h1>Team Options</h1> <p>Blissey needs ironclad switch-ins to Metagross, Snorlax, Forretress, and Deoxys-A, some way to confront the specialized setup that can beat it, a spinner to remove the Spikes that plague it, some countermeasure to the physical attackers that can threaten it, and usually Spikes to help pressure its often Spikes-weak switch-ins to patch up its passivity. Forretress is almost always used alongside Blissey, being the tier's most viable user of Rapid Spin, a switch-in to Metagross, Snorlax, and Deoxys-A, a user of Spikes, and a means to beat Latias via Explosion. Lugia is also a common partner, checking Snorlax, Metagross, and nearly every other physical attacker that threatens Blissey out; it can also set up Reflect to cushion Blissey against physical attacks, including weaker Explosions, and it benefits greatly from Blissey's Heal Bell. Salamence can check Deoxys-A and Groudon and bolster Blissey's Heal Bell support with its own Wish support, and it enjoys said Heal Bell. Deoxys-D can threaten Latias and Latios more immediately with Knock Off and set up Spikes for Blissey, and it can in turn take advantage of Heal Bell. Metagross can check Snorlax and Deoxys-A and use Explosion to remove some of the specially offensive sets that can beat Blissey. Latias or Latios can be used to defeat Kyogre variants that Blissey cannot: Substitute + Calm Mind and Rest+Calm Mind. Groudon can help Blissey by setting up sun, significantly lowering Kyogre's damage output and preventing Blissey from being frozen. Ho-Oh benefits from Light Screen softening damage from Latias and Latios, allowing it to more freely hit them with Shadow Ball. Ho-Oh and Deoxys-A can take advantage of Blissey forcing Latias and Latios to use Recover or Refresh to freely switch in and threaten them.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 306959, "username": "SuperEpicAmpharos"}, {"user_id": 127823, "username": "Inspirited"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}, {"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 479200, "username": "Ajencis"}]}
  },
  "Lugia": {
    "overview": "<p>Lugia is a very versatile Pokemon in the ADV Ubers metagame, able to act as an offensive or defensive threat. Its great natural bulk, Pressure, and many good utility moves let it work incredibly well as a catch-all physical wall. Defensively, it fits best on stall teams to shut down many threatening physical wallbreakers such as Groudon and Rayquaza. Lugia also has strong attacks in Aeroblast and Earthquake, allowing it to act as a good wallbreaker with Choice Band and its workable Attack stat. However, Lugia's typing leaves it susceptible to many prevalent offensive types in the metagame such as Electric, Ice, and Ghost from strong attackers like Latios, Deoxys-A, and Kyogre. The defensive set's reliance on Whirlwind to make progress can also be a double-edged sword; it stops setup sweepers before the endgame but exposes Lugia to Substitute sweepers and Immunity Snorlax if they are the last Pokemon remaining.</p> ",
    "comments": "<h1>Other Options</h1> <p>Ice Beam can be used on either set to threaten Pokemon like Rayquaza and physically defensive Groudon, but its lack of power overall makes it somewhat situational. Recover can heal the Choice Band set on the switches it forces, but it's not a favorable move to be locked into. Toxic can similarly be used in the last moveslot, but it is a risky move to click early, as Steel-types are the traditional Lugia answer.</p> <h1>Checks and Counters</h1> <p><strong>Steel-types: Pokemon such as Forretress, Skarmory, Metagross, and Steelix are immune to everything defensive Lugia does aside from phazing them, and the former two can use it to set up Spikes. Many Steel-types also resist Choice Band Lugia's Aeroblast, but Earthquake can still threaten Metagross and Steelix. Skarmory completely walls Lugia and can threaten to use Toxic while also setting up Spikes.</p> <p><strong>Latios and Latias: Equipped with Refresh, Latios and Latias are completely unbothered by defensive Lugia and threaten it out with powerful Thunders or Ice Beams. Both Pokemon can also survive even a Choice Band Shadow Ball from Lugia without any defensive investment.</p> <p><strong>Aerodactyl</strong>: Aerodactyl outspeeds Lugia and does massive damage with its strong STAB Rock Slide that can flinch Lugia down. Its Rock typing also lets it pivot into Choice Band Lugia and offensively pressure it.</p> <p><strong>Special Wallbreakers</strong>: Strong Thunders from Deoxys-A, Mewtwo, and Kyogre can heavily chip Lugia and threaten paralysis, breaking through its massive bulk quite easily.</p> <p><strong>Status: Blissey, Skarmory, Ho-Oh, and opposing Lugia all commonly carry Toxic, which heavily limits Lugia's long-term defensive capabilities. Thunder Wave from Pokemon like Kyogre and Groudon does the same, letting Lugia get beat out by Rock Slide Groudon and Roar Kyogre, as well as others like Heracross.</p> <p><strong>Ho-Oh: Defensive Ho-Oh can tank even Choice Band Aeroblast and use Pressure to stall Lugia out of moves to threaten it. Ho-Oh also carries Toxic and Sacred Fire commonly, threatening Lugia with a very debilitating status.</p> <p><strong>Taunt</strong>: Fast Taunt users such as Deoxys-S, Gengar, and Mewtwo completely shut down defensive Lugia; however, they don't bother Choice Band sets.</p> ",
    "sets": [
      {
        "name": "Great Wall",
        "description": "<h1>Set Description</h1> <p>Reflect and Whirlwind let Lugia be an effective stop to physical wallbreakers like Groudon, Heracross, and Rayquaza, using Reflect on their attacking moves to take more hits and phazing setup variants that boost too high for even Reflect to handle. Toxic is the main way Lugia makes progress, alongside Whirlwind. Poisoning foes like Ho-Oh severely reduces their longevity, and residual damage from Whirlwind with Spikes makes up for Lugia running no attacking moves. 96 Speed EVs allow Lugia to outrun maximum Speed base 90s with a neutral nature such as Groudon and Kyogre, as well as important slower foes such as Adamant Heracross. Lugia can also afford to run less Speed in favor of a tankier set, with only 16 Speed EVs being needed to outrun and set up Reflect against a -1 Speed Snorlax if Lugia gets paralyzed.</p> <h1>Team Options</h1> <p>Lugia fits best on very bulky team structures that utilize its slow pace and walling abilities while defensively covering for its shortcomings. It has multiple exploitable weaknesses to common attacking types like Ghost, Electric, and Ice while also lacking any Special Defense investment. Blissey is a strong switch-in to special attackers like Kyogre, Latios, and Latias, can absorb status from Pokemon like defensive Ho-Oh, and can even provide Lugia with incredible Aromatherapy support. Blissey's Light Screen also lets Lugia take essentially any hit and respond with Toxic or Whirlwind, something important in the Calm Mind Kyogre matchup. Forretress is practically mandatory so Whirlwind can force progress with Spikes. It also provides a Ghost resistance to help against Pokemon like Choice Band Deoxys-A, which can overwhelm even Lugia. Deoxys-D is a good switch-in to most other strong special attacking Psychic-types like Latios and Latias, Mewtwo, and Petaya Berry Deoxys-A, which Lugia cannot handle itself. It also provides the crucial Spikes support Lugia wants and is another Pressure user, allowing for easier PP stalling against opposing defensive teams. Snorlax is one of the better pivots into Latios, Latias, and Mewtwo and has Immunity to cover for Lugia's terrible weakness to Toxic, making it a strong partner as well.</p> "
      },
      {
        "name": "Choice Band",
        "description": "<h1>Set Description</h1> <p>Choice Band Lugia is a strong and fast wallbreaker, using its good natural bulk to come onto the field multiple times per game. Aeroblast is a strong STAB move and is used most, breaking past most Pokemon that don't resist it. Shadow Ball is used to hit bulky Latias the hardest as well as dent opposing Lugia and Dusclops, which can Pressure stall Aeroblast. Earthquake is needed to threaten Metagross, and it also covers more niche Pokemon like Tyranitar and Steelix. Whirlwind can be a last-ditch effort against setup sweepers, using Lugia's massive natural bulk to stomach a hit and remove a threat like boosted Groudon in a pinch. The Speed EVs and a Jolly nature are needed to outspeed Modest Latias and Latios, and Lugia needs maximum Attack investment for power.</p> <h1>Team Options</h1> <p>Magneton is an excellent partner for Lugia, removing Steel-types like Forretress and Skarmory to let it more easily spam Aeroblast. Latios and Latias provide Lugia with a lot of support by switching into Kyogre, which can threaten Lugia with Thunder, as well as being offensive but sturdier Groudon checks in combination with Lugia soft checking it. Deoxys-A appreciates Lugia's ability to bait in and chip Steel-types like Forretress and Metagross, which can take a few hits from Deoxys-A, and Lugia benefits from Deoxys-A baiting in Skarmory, which Lugia can't break with any attack. Fire-type coverage on Pokemon like Snorlax and Metagross in sun is also good for baiting in and weakening Steel-types like Forretress and opposing Metagross.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 306959, "username": "SuperEpicAmpharos"}, {"user_id": 127823, "username": "Inspirited"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}, {"user_id": 33374, "username": "Muk"}]}], "writtenBy": [{"user_id": 511624, "username": "Fc"}]}
  },
  "Ho-Oh": {
    "overview": "<p>Ho-Oh is a seriously underrated Uber. 50% burn is nothing to play with. It is an extreme staller, as well, with Recover, 106 base HP, and 154 base Special Defense. The trick to Ho-Oh is to try and burn any physical attackers you can, and then use your massive Special Defense to keep you alive on that front. Unlike Lugia, who, with a Calm Mind set, likes some Defense EVs and tries to boost up in the face of physical attackers, Ho-Oh has the ability to severely cripple them. However, its mediocre Speed (tied with Kyogre, Groudon, and Deoxys-D as the slowest Uber) is what holds it back. It has trouble with the physical attackers, because they're likely faster and carry Rock Slide, and its weaknesses to Thunder, Thunderbolt, and Surf hurts its ability to wall special hits. Ho-Oh should always be used with Groudon. Kyogre is one of the most common Pokemon in Ubers, and you don't want Drizzle blocking your Sacred Fire. With Groudon, you can overwrite Drizzle with Drought to boost your Sacred Fire instead of weaken it. This also makes enemy Surfs be at half power, and Thunder gets 50% accuracy.</p> ",
    "comments": "<h1>Other Options</h1> <p>Whirlwind can make life hell for a lot of Pokemon, as it can Calm Mind and Whirlwind your Calm Mind's away. With Special Defense, you can even survive a hit or two from Kyogre. Safeguard + Recover owns Blissey. Reflect can help Ho-Oh take physical attacks better. Substitute is also of mention, since Ho-Oh can make 101 HP Substitutes for Deoxys-D and Blissey. Solar Beam has no charge up turns in the sun, but between Sacred Fire and Thunder(bolt), along with the threat of Kyogre or Rayquaza switching in and removing your sunlight, when are you going to use it?</p> <h1>EVs</h1> <p>Max Special Attack for the first set, max Attack for the Choice Band set.</p> <p>For a fast sweeper, you'll want to make it 306 Speed (252 EVs with a +Speed nature). This ties at worst with Groudon, who is very important to outrun. This also often makes it faster than Rayquaza, who also usually has Rock Slide. If you can go before either of them, you can OHKO Groudon, or burn Rayquaza, thus keeping you safe from their Rock Slides.</p> <p>Tankish versions need more Special Defense and HP, which isn't as bad as it sounds. Ho-Oh is tied for Speed with Deoxys-D, Groudon and Kyogre, making it the slowest uber. It's never going to outspeed Deoxys-A, Mewtwo, almost any Latios or Latias, and will rarely beat Lugia, no matter how much Speed it has. It's faster than Metagross, too, since Metagross usually just pumps HP and Defense in place of Speed. Since Deoxys-D never has more than 24 or so Speed EVs for Tyranitar (and even that's considered fast), Speed EVs are really just to beat out enemy Ho-Oh, Groudon, Kyogre, and Rayquaza. Rayquaza has a higher base Speed, and will sometimes go Jolly to give those Latias and Latios that only run 307 Speed a scare with Choice Band Hidden Power Bug / Hidden Power Ghost, and you can only tie with Kyogre and Groudon. For this reason, Speed EVs aren't essential. Instead, you could run a 252 HP, 252 Attack, 4 Special Defense spread, as outlined in the Choice Band set, to be able to take more hits from the Pokemon that are faster than you anyway, and just try burning physical attackers on the switch. Of course, if you have Substitute, you need at least 204 HP EVs for 404 HP, allowing 101 HP Substitutes, which are unbreakable by Night Shade and Seismic Toss.</p> <h1>Checks and Counters</h1> <p>Kyogre can come on Sacred Fire most any time, as burning isn't nearly as bad as any other status to it, and absolutely loves Solar Beam, because it makes Solar Beam charge. Latias and Latios resist Fire and Electric, and usually have an Electric move, themselves. Tyranitar resists Sacred Fire, and gets STAB Rock, but doesn't like to be burned. Rayquaza Air Locks Sunny Day and also resists Fire, but unless it's a pure special version, it has to beware of the burn, too. Blissey and Deoxys-D can Paralyze / Toxic non-Safeguarders or Substituters. All of these should watch out for the Choice Band version, especially low defense Blissey, except for Rayquaza, unless Ho-Oh has Hidden Power Rock, in which case even Rayquaza isn't safe.</p> ",
    "sets": [
      {"name": "Special Attacker", "description": "<p>Use in conjunction with Groudon for boosting Sacred Fire. Calm Mind up, burn everything in sight. Sacred Fire is what makes Ho-Oh so deadly; nothing can switch into this bird without fear of being burned. Thunder is nice to hit Kyogre, the most common switch into Ho-Oh, but Thunderbolt helps against enemy Ho-Oh, and does a bit more to Rayquaza (try and Burn it first, then you can survive even a Choice Band Rock Slide if you have a lot of HP EVs).</p> "},
      {"name": "Choice Band", "description": "<p>Ho-Oh's MASSIVE Attack, myriad physical moves, and Sacred Fire make it a decent Choice Bander. Hidden Power Flying is a safe move to use as it hits almost everything in the uber metagame with at least neutral damage except for Metagross and the rare Skarmory, both of which rarely switch in for fear of Sacred Fire. However, Shadow Ball hits more things super effective, and Earthquake has roughly the same power (5 less, with STAB) as Hidden Power Flying, so it would primarily be for when you can't decide between trying to hit Rayquaza or Kyogre, or something. Hidden Power Rock, however, allows you to OHKO enemy Ho-Oh, and possibly OHKO Rayquaza. Hidden Power Rock has more uses that aren't covered by your other moves better, but Hidden Power Flying is safer if you are having trouble predicting.</p> "}
    ]
  },
  "Shiftry": {"sets": [{"name": "Choice Band", "description": "<p>The EVs given are for if you do not have Hidden Power. If you do, you'll need 4 more Speed EVs at the cost of HP to make sure Shiftry is faster than +Speed Deoxys-A in the sun. Choice Band is helpful because Shiftry can only come in on a very limited number of Pokemon and needs to 2HKO the switch-in to survive.</p> "}, {"name": "Swords Dance", "description": "<p>If you feel you can set up with Shiftry, it learns Swords Dance, which is really helpful.</p> "}]},
  "Slaking": {
    "overview": "<p>Slaking boasts a fantastic Attack stat that puts even the Ubers metagame to shame. It has a good base 100 Speed stat too, allowing it to outspeed some key threats and force them out with its strong attacks. Unfortunately, Slaking's amazing power can only be tapped into every other turn due to its ability, Truant. Thus, Slaking has to rely heavily on proper predictions to punch through teams most effectively and is forced to use a Choice Band set, seeing how it's almost always forced to switch out after firing off just a single devastating attack regardless of its effectiveness. The opportunity cost of adding Slaking to a team is also extremely large, as it allows dangerous sweepers to come in for free every other turn. Moreover, due to how important role compression and momentum is in Ubers, you're often hard pressed to fit Slaking outside of extremely specific builds, and even then it's hard to justify the team slot it occupies.</p> ",
    "comments": "<h1>Other Options</h1> <p>An Adamant nature provides more firepower but comes at the cost of being outsped by neutral nature Latios and Latias, which can 2HKO Slaking with ease, as well as maximum Speed base 90 Speed foes such as Kyogre, which can OHKO with Hydro Pump or even Surf, so it's generally not preferred.</p> <h1>Checks and Counters</h1> <p><strong>Lugia: Lugia has enough bulk to stomach any hit Slaking throws its way and either recover the damage off or set up Reflect to take the next hit better.</p> <p><strong>Skarmory</strong>: Skarmory is capable of taking most hits from Slaking and setting up Spikes in front of it or phazing it with Whirlwind, but it must be wary of Focus Punch.</p> <p><strong>Ho-Oh</strong>: Defensive Ho-Oh can take any hit not named Hyper Beam and threaten to incapacitate Slaking with Sacred Fire, but it will still take a huge chunk from any Normal-type move Slaking opts to use.</p> <p><strong>Protect and Substitute Users</strong>: Truant will trigger even if the hit doesn't make direct contact, so Protect is a very easy way to both scout Slaking's move and telegraph a switch from its side. Substitute users like SubSalac Groudon, Kyogre, and Heracross all can take advantage of the free turn to set up their Substitute and can continuously do so in front of Slaking without being bothered much.</p> <p><strong>Ghost-types: Gengar and Dusclops can switch in on most of Slaking's attacks and take no damage due to being immune to Normal- and Fighting-type moves, but they both don't want to come in on a Shadow Ball.</p> <p><strong>Revenge Killers: Due to Truant, a lot of strong Pokemon can take advantage of the free turn to switch in without being scared to take a hit, namely Deoxys-A and Kyogre, which can both OHKO Slaking.</p> ",
    "sets": [
      {
        "name": "Choice Band",
        "description": "<h1>Set Description</h1> <p>Double-Edge is extremely strong and allows Slaking to grab important OHKOs on Pokemon such as Latios, maximum HP Latias, and lead Mewtwo. It also consistently 2HKOes defensive Groudon and Kyogre, whereas Slaking avoids a 2HKO and OHKO, respectively, from these foes. Shadow Ball provides coverage against rare Rock- and Ghost-types such as Regirock and Dusclops while also dealing larger amounts of damage to the plethora of Psychic-types that Ubers is riddled with. Notably, it has a good chance to OHKO maximum HP Latias, 2HKOes defensive Lugia, and deals good damage to Metagross. Focus Punch is the strongest move Slaking has to hit Steel-types, dealing more than 50% to Skarmory and Forretress and OHKOing Snorlax. Hyper Beam blows away the opponent's dedicated walls such as defensive Latias and Ho-Oh but prevents Slaking from switching out upon landing, making this a high-risk, high-reward move that is best utilized later in the game to pave the way for your cleaners. Earthquake is an option if you don't want to rely on Focus Punch's predictive nature but still wish to hit Steel-types like Metagross, Jirachi, and Forretress. The trade-off is being hard walled by Skarmory and Forretress. A Jolly nature is used to outspeed neutral nature Latios and Latias, common leads that are often extremely valuable.</p> <h1>Team Options</h1> <p>Magneton is, by and large, Slaking's best teammate and almost mandatory, being able to trap all the Steel-types that resist Slaking's Normal-type attacks and KO them or chip them to the point that they can no longer take its attacks. Slaking fits best on offensive builds due to its hit-and-run nature. It forms an excellent double-Normal core with Snorlax, with both of them sharing checks they can overwhelm with their strong STAB moves. Deoxys-A is another great partner, cleaning up teams after Slaking has sufficiently damaged its checks with Extreme Speed. It also patches up the weakness to Substitute users that Slaking enables on its Truant turns, namely Groudon, Kyogre, and Heracross. Because of how threatening opposing Deoxys-A can be to team structures utilizing Slaking as their wallbreaker, Pursuit Metagross is a way to mitigate the impact it will have against your team. Slaking's Special Defense leaves much to be desired, leaving it extremely vulnerable to an OHKO from Kyogre. Your own Kyogre, Latios, and Latias all answer it quite well without giving up any momentum. Spikes support from Forretress and Skarmory is also appreciated, chipping at Slaking's checks so that it can OHKO them.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 127823, "username": "Inspirited"}, {"user_id": 306959, "username": "SuperEpicAmpharos"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}, {"user_id": 449990, "username": "DC"}]}], "writtenBy": [{"user_id": 273339, "username": "Lasen"}]}
  },
  "Shedinja": {
    "overview": "<p>Shedinja is good only in the Uber environment. In the standard metagame 100% counters such as Tyranitar's Sand Stream and Spikes are used. In the Uber metagame, many things such as Kyogre and Latios lack the moves to hurt Shedinja, allowing it to deal lots of damage. However, with the fairly recent commonness of Spikes and Toxic on everything, even then Shedinja is risky. If you don't carry Rapid Spin and the ability to change the weather (either Rain Dance or Sunny Day... or Drizzle and Drought), don't use Shedinja. Shedinja is generally too risky to be your only counter to something, because of how easily things can stop it.</p> ",
    "comments": "<h1>Other Options</h1> <p>Confuse Ray and Toxic, mainly. These can be very annoying and can help wear down whatever your opponent switches in to counter Shedinja with.</p> <h1>EVs</h1> <p>Adamant with 252 in Attack and Speed. You won't need anything else.</p> <h1>Checks and Counters</h1> <p>Spikes, Sandstorm / Sand Stream and Toxic / Leech Seed are sure fire counters. Other than that, Fire, Rock, Flying, Ghost and Dark moves will kill Shedinja in one hit regardless of the move's Base Power. Pursuit on something bulky like Metagross is the best attack counter.</p> ",
    "sets": [
      {"name": "Protect", "description": "<p>Basically slug away with Shadow Ball and Hidden Power Bug, or Swords Dance if the opponent is foolish and tries to stat up himself. Protect is for checking movesets since unpredictable movesets will end Shedinja in one move, so something odd carrying Toxic will spell the end of your days. Spikes, Sandstorm and what not will also end Shedinja, so it's pretty risky to use. If you are afraid of going for the stat-upping variant, you can just pick Silver Wind and Hidden Power Rock, seeing as in Uber (where this is most commonly seen), it can hurt a lot of Pokemon. By all means watch out for Metagross.</p> "},
      {
        "name": "Choice Band",
        "description": "<p>This is the Choice Banding variant. It's a lot riskier than the Protect Shedinja, but you can hurt a lot more stuff with this moveset. It's up to you. If you want to take a big risk, you can net a big reward. Or you can also lose this baby much easier. Choice Band is a good choice for Shedinja because you have to play it like one, anyway. Just bring it in on stuff that can't hurt it, and hit their switch hard. You'll invariably switch out next turn, really, as if they switch, they switch to something that can damage Shedinja. Hidden Power Ground is for Metagross, Hidden Power Fighting is for Tyranitar. As Metagross is more common in ubers, that is a real option, but in standard, Tyranitar is the most common, and most obvious switch when they know you have Shedinja. Although Shedinja will die next turn, Hidden Power Fighting will do massive damage, if not deal a KO, so it's a kind of kamikaze move. Toxic is also used mostly for uber matches, so Shedinja can actually do something to guys like Groudon and Rayquaza. Aerial Ace is for fighters, meaning purely Heracross, really, so Sleep Talk is a good option, considering how few sleepers have a move that hits Shedinja.</p> "
      }
    ]
  },
  "Wynaut": {
    "overview": "<p>Access to Shadow Tag and a couple of supportive options make Wynaut seem somewhat usable in double Shadow Tag teams to double down on threats with Wobbuffet. Wynaut’s lower bulk allows it to punish weak hits harder than Wobbuffet, making it able to take down Latias and Latios. It is able to use Encore to lock a foe into an attack to ensure that it does not become setup fodder. However, Wynaut has a wide array of issues that come with using it on a team. Mainly, Wynaut is directly inferior to Wobbuffet, which can better fulfill the role of a trapper, due to its much better bulk allowing it to retaliate against stronger hits. Wynaut’s horrid bulk causes it to faint against many threats such as Groudon, Kyogre, Deoxys-A, Ho-Oh, and Rayquaza. In addition to this, double trapper teams as a whole are niche. Because of this, along with its extremely passive nature, it is quite reliant on reads to make any notable impact within a match. Wynaut also faces the issue of not being able to hold Leftovers to soften up any blows that it takes. Overall, Wynaut is a terrible Pokemon, and should never be considered for use on a serious team.</p> ",
    "sets": [{"name": "Why Not Use Wynaut? (Trapper)", "description": "<h1>Set Description</h1> <p>This set attempts to switch in and revenge kill an opposing threat by means of trapping them in. This EV spread lets Wynaut take hits from notable threats such as Latias, Jirachi, Gengar, and most Mewtwo variants to revenge kill them. Encore allows Wynaut to thwart many sweepers by locking them into an attacking move, allowing for Wynaut to take them down with either Counter or Mirror Coat. Since Wynaut has poor bulk, Destiny Bond is decently capable of bringing something down with it. Safeguard is a somewhat niche option but can be a beneficial one since it prevents the status that cripples Wynaut so heavily. However, it makes Wynaut less capable of taking on stronger hits due to the lack of Destiny Bond to support it.</p> "}],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 306959, "username": "SuperEpicAmpharos"}, {"user_id": 127823, "username": "Inspirited"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}], "writtenBy": [{"user_id": 487308, "username": "BT89"}]}
  },
  "Latias": {
    "overview": "<p>With Soul Dew, Latias is a versatile Pokemon offensively and defensively. Its typing, Levitate, and good Speed let it check Kyogre and Groudon, the strongest attackers in the tier, while avoiding Spikes damage. Latias can also answer many special attackers thanks to Soul Dew's Special Defense boost. Unfortunately for Latias, its typing leaves it weak to common Ice- and Ghost-type attacks. It also dislikes status, especially paralysis, even on sets with Refresh. Finally, Latias is often outclassed by Latios, which boasts a higher Special Attack stat to immediately pressure foes more. Nevertheless, Latias is a better Calm Mind sweeper and a more consistent check to aforementioned threats, as its bulk gives it more resilience to a critical hit or full paralysis turn. Generally, Latias is only worth a teamslot over Latios on bulky teams that need its long-term efficacy or a wincon.</p> ",
    "comments": "<h1>Other Options</h1> <p>Running Thunderbolt over Thunder on sun-based teams may seem appealing, but the loss of damage output against Ho-Oh and Kyogre is significant, generally causing Latias to lose the latter matchup while not meaningfully improving the former. Roar is an interesting option with a couple of purposes. On the Calm Mind set, it can be used to set up against an opposing Calm Mind user that would otherwise beat it and phaze the foe afterwards, gaining a significant advantage. On the BoltBeam set, it can be used as insurance against Calm Mind users that can set up to take on Latias. On both sets, Roar is also general insurance against setup Pokemon that can threaten the bulkier teams on which Latias naturally fits. Dropping a move for Roar is difficult, however; the most plausible option is Refresh, which will leave Latias much weaker against status from Groudon, Kyogre, and Blissey. Safeguard is an option over Refresh, but it's unable to prevent Latias from taking status while switching in, which broadly makes it a much less desirable option.</p> <h1>Checks and Counters</h1> <p><strong>Special Walls: Blissey's incredible special bulk can generally take on Latias indefinitely. However, the Calm Mind set can defeat most Blissey, although there are specialized Blissey sets that can beat this Latias set with Snatch, Psych Up, or Calm Mind. Even standard Blissey can force Latias to use Recover or Refresh, allowing an offensive answer such as Deoxys-A to switch in. Snorlax can take Latias's attacks and hit hard back with Shadow Ball or Body Slam, threaten a Body Slam paralysis, or even set up Curse. Deoxys-D can switch in and threaten to remove Soul Dew with Knock Off or set up Spikes. +6 Latias can overpower it even lacking Soul Dew, although a faster Deoxys-D with Taunt can prevent it from boosting. Ho-Oh's massive Special Defense and Recover allow it to take most of Latias's attacks comfortably and hit back hard with Shadow Ball; however, offensive Ho-Oh fears Thunder in rain, and defensive Ho-Oh may not be able to do sufficient damage to prevent a physically defensive Latias from setting up. Jirachi can usually beat Latias thanks to its bulk and resistances to Ice and Dragon. Jirachi can paralyze Latias with Body Slam, Thunder, or Thunder Wave, hit it hard with Shadow Ball, or set up on it with Calm Mind.</p> <p><strong>Offensive Checks: Deoxys-A can heavily damage Latias, but it will be OHKOed by any of Latias's attacks and cannot guarantee an OHKO on even non-physically defensive Latias without a Choice Band. Metagross can switch into Dragon Claw or Ice Beam and threaten to hit Latias hard or use Explosion. Heracross can also usually check Latias, surviving even a +1 Dragon Claw and threatening to KO it back with Megahorn given minimal chip damage.</p> <p><strong>Setup Sweepers: Calm Mind Kyogre will usually beat Calm Mind Latias one-on-one, and even Thunder Latias will be hard-pressed as it cannot 2HKO Kyogre if Latias switches in as Kyogre uses Calm Mind. Groudon can generate a free turn by forcing Latias to use Refresh as it switches into Thunder Wave multiple times, eventually resulting in a full paralysis, using the opportunity to set up a Swords Dance and then usually OHKO Latias with +2 Hidden Power Ghost.</p> <p><strong>Niche Checks</strong>: Umbreon can take a couple attacks from Latias, trap it with Mean Look, and pivot with Baton Pass to a counter; Regice can take multiple hits with its massive Special Defense stat and retaliate with Explosion or STAB Ice Beam; Registeel has incredible special bulk and a fantastic typing, using Latias to set up with Curse or removing it with Explosion; Steelix can switch into Dragon Claw and Thunder to hit Latias hard; and Shedinja takes no damage whatsoever from any of Latias's attacks barring the obscure Hidden Power Fire and retaliates with STAB Shadow Ball. None of these Pokemon are generally recommended, however.</p> ",
    "sets": [
      {
        "name": "BoltBeam",
        "description": "<h1>Set Description</h1> <p>This set primarily acts as a check to powerful Pokemon such as Groudon, Kyogre, and Latios. Refresh helps Latias consistently check threats, but Latias should still avoid status, as a full paralysis will severely hinder it. Recover lets Latias take multiple hits from super effective coverage moves, mainly Kyogre's Ice Beam and Groudon's Hidden Power Ghost. Thunder and Ice Beam hit Kyogre, Groudon, and Latios super effectively and almost the entire tier for at least neutral damage. 140 Speed EVs with a Timid nature let Latias outspeed Modest Latios and any unboosted Groudon or Kyogre. 252 HP leverages its advantage in bulk over Latios.</p> <p>Dragon Claw is an option over Ice Beam, trading power against Groudon for extra damage against Latios; this is best for teams that already have significant Groudon countermeasures. It is also possible to use Calm Mind over Refresh for Latias to double as a wincon, but this will hamper its matchup against Thunder Wave variants of Groudon and Kyogre, and Latias will still lose to Blissey. Dropping Refresh generally requires a Blissey on one's team to heal status and counter Thunder Wave Kyogre. Furthermore, if opting for Dragon Claw over Ice Beam, one can switch Latias's Special Attack and HP investments to use it as a lead. With this spread, Latias can 2HKO Mewtwo and has enough bulk to take two Ice Beams from Mewtwo, forcing it to use Self-Destruct. However, Calm Mind variants of Mewtwo can use Latias as setup fodder. Finally, a spread of 192 HP / 176 SpA / 140 Spe with a Timid nature retains the ability to survive Spell Tag Deoxys-A's Shadow Ball from full health and hits foes harder, but this spread particularly is often outclassed by Latios, which can survive the same hit with more offensive presence.</p> <p>This set's biggest flaw is that it suffers in comparison to Latios. Latios's significantly higher offensive presence pressures Groudon and Kyogre much more effectively, most notably securing the 2HKO on Kyogre even when switching in on its Calm Mind. As such, careful thought should be given if Latias's bulk is needed over Latios's power.</p> <h1>Team Options</h1> <p>Although a good check to Groudon and Kyogre, Latias should not be the sole check to either threat. If SubSalac Groudon can find a turn to set up, including from full paralysis, it can OHKO Latias with +2 Hidden Power Ghost. Therefore, another check to Groudon such as Lugia or Ho-Oh is necessary. Similarly, it is generally wise to have a backup check to opposing Kyogre, such as a Blissey or your own Kyogre with Thunder.</p> <p>Pokemon that commonly switch into Latias include Snorlax, Blissey, and Ho-Oh. The former two can generally be handled with a Steel-type that can set up Spikes, such as Skarmory or Forretress, or hit hard physically, such as Metagross. Ho-Oh is checked by physical walls that are not overly concerned with sun-boosted Sacred Fire or burn, such as a Lugia backed up by cleric Blissey or a physically defensive Ho-Oh of one's own.</p> "
      },
      {
        "name": "Calm Mind",
        "description": "<h1>Set Description</h1> <p>The set acts as a wincon that can beat Blissey with Recover, Refresh, and Calm Mind. Calm Mind allows Latias to overwhelm its defensive answers and clean a weakened team; Dragon Claw is a powerful STAB attack alongside it with few sturdy resistant foes. Refresh cleanses Toxic from Blissey and paralysis from Groudon's and Kyogre's Thunder Wave, and possibly Snorlax's Body Slam. Another option is using Reflect over Refresh, making this Latias much more effective at checking and setting up on physical attackers.  The given HP and Defense EVs complement Latias's extraordinary Special Defense, especially with Calm Mind, and help it take attacks from weaker physical attackers such as uninvested Ho-Oh. They also let Latias take Choice Band Deoxys-A's Shadow Ball from full health. The Speed investment is important to beat neutral base 90s, namely Kyogre and Groudon.</p> <p>252 HP / 116 Def / 140 Spe with a Timid nature lets Latias outspeed Modest Latios at the cost of being weaker to physical attackers. It is also possible to use a spread of 172 HP / 240 Def / 96 Spe, retaining the Bold nature, to still outspeed most Groudon and Kyogre while tanking Groudon's +2 Hidden Power Ghost, allowing it to act as a backup check to SubSalac Groudon; this will cut into Latias's special bulk noticeably, however.</p> <h1>Team Options</h1> <p>This set is somewhat self-sufficient, being able to beat most of Latias's defensive answers, namely Blissey, Ho-Oh without significant Attack investment, and some Snorlax lacking Curse and Shadow Ball. Although Latias can take a hit from Deoxys-A, it is prone to chip damage and cannot afford to spam Recover. Therefore, checks to these threats, often a Steel-type like Metagross or Forretress, are necessary. Pokemon like Groudon and Kyogre can check Steel-types that can use Latias as fodder, like Spikes Forretress, Calm Mind Jirachi, and Metagross. Furthermore, as this set is less effective at taking on opposing Groudon and Kyogre, other answers to those are important, such as a Lugia + Blissey core.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 306959, "username": "SuperEpicAmpharos"}, {"user_id": 127823, "username": "Inspirited"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}, {"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 479200, "username": "Ajencis"}]}
  },
  "Latios": {
    "overview": "<p>Latios is the premier check to Groudon and Kyogre, the two most threatening and important Pokemon in the tier, making it nigh impossible for teams to pass; unless they run Latias instead. Latios is also a top offensive threat itself; Soul Dew effectively gives it a Calm Mind boost, and it is faster than the majority of Pokemon in the tier. Its immunity to Ground and Spikes and resistances to Fighting and Electric are important defensive qualities, increasing Latios's versatility and capacity to come into play. Latios is especially potent with rain support, as its powerful Thunder either heavily damages many of its checks or inconveniences them with its high paralysis rate. Latios is, however, a victim of its own reputation and influence; its prevalence as a key threat forces many teams to explicitly prepare for Latios, denying its standard sets from making substantial progress against them, especially through the use of Blissey and sun. Also, Latios's poor physical bulk means the likes of Deoxys-A, Salac Berry Groudon, and Extreme Speed Rayquaza can revenge kill or sweep through it quite effectively. Latios is also vulnerable to losing Speed ties and Calm Mind wars in some late-game scenarios.</p> ",
    "comments": "<h1>Other Options</h1> <p>A Dragon Dance set with Hidden Power Fighting and coverage moves like Ice Beam, Thunder, Shadow Ball, and Earthquake salvage Latios's workable Attack stat to break through Blissey and Snorlax, its two most common and effective checks. The set requires maximum Attack investment with Soul Dew along with 156 Speed EVs, alongside support from strong Kyogre and Groudon checks. Substitute can be used to block incoming status and scout between several potential switch-ins to maximize damage. Mono-attack Latios with Calm Mind and Dragon Claw could potentially be used, but it is largely outclassed by Latias, which has better defensive stats. Toxic and Thunder Wave can disrupt a few of Latios's common responses, but they are mostly less useful than other utility or offensive moves. Latios could potentially utilize Protect to scout Choice Band users, which commonly target it, but it is otherwise a mostly useless move.</p> <h1>Checks and Counters</h1> <p><strong>Blissey: Except against Dragon Dance sets, Blissey is a common and fairly secure check to Latios, comfortably tanking Latios's attacks with its massive special bulk and forcing it out with Calm Mind + Ice Beam or Toxic + Seismic Toss. Latios can comfortably click Refresh or Recover before deciding how to punish Blissey with a switch; however, chip damage makes it easier to break through Latios with another Pokemon later. Further, Blissey may run moves such as Snatch and Light Screen to prevent Latios from doing this as well.</p> <p><strong>Snorlax</strong>: Although its special bulk isn't as solid as Blissey's, Snorlax is more than capable of tanking Latios's strongest attacks and threatening it with a powerful Body Slam.</p> <p><strong>Ho-Oh</strong>: While it gets hit hard by Thunder, Ho-Oh is a fairly effective Latios check in sun that can threaten Latios with status or powerful physical attacks such as Shadow Ball and Hidden Power Flying.</p> <p><strong>Steel-types</strong>: Metagross takes heavy damage from Thunder or Hidden Power Fire in sun, but it can switch into Dragon Claw and Ice Beam and can threaten Latios with its strong physical attacks. Similar to Metagross but less potent, Forretress can still force Latios out with the threat of Explosion, Hidden Power Bug, or freely setting or removing Spikes. More niche Steel-types like Jirachi, Steelix, Registeel, and Magneton can soft check Latios due to their resistances. Jirachi can set up with Calm Mind against Latios or use Wish to stall and smack it with Body Slam or Shadow Ball; Steelix is immune to Electric-type attacks and can hit back with strong physical moves; Registeel can set up with Amnesia or threaten Latios with Hidden Power Ghost and Explosion; and Magneton scares Latios out with status.</p> <p><strong>Deoxys-D: Although it takes some damage from Thunder and Dragon Claw, Deoxys-D is generally not worth trading Latios for, forcing Latios out and allowing Deoxys-D to set Spikes or punish the switch with Knock Off or status.</p> <p><strong>Regice</strong>: Regice has enough special bulk to tank a few of Latios's attacks and can hit back with Ice Beam or Explosion.</p> <p><strong>Shedinja</strong>: Shedinja is immune to most Latios, but it is KOed by Hidden Power Fire and Shadow Ball sets.</p> <p><strong>Swampert</strong>: Swampert has decent bulk, is immune to Thunder, and can hit Latios with a fairly strong Hidden Power Ghost.</p> <p><strong>Revenge Killers</strong>: Pokemon such as Deoxys-A, Mewtwo, Dragon Claw Latios and Latias, Choice Band Lugia, Choice Band Aerodactyl, and Salac Berry Heracross have the Speed and power to outspeed, or at very least Speed tie, and KO Latios.</p> ",
    "sets": [
      {
        "name": "Offensive Utility",
        "description": "<p>Recover is essential for allowing Latios to check Groudon and Kyogre throughout the game. Refresh allows Latios to remove paralysis and regain its important Speed advantage;Thunder Wave is commonly used by Groudon and Kyogre. Calm Mind can be used to help Latios break through several defensive Pokemon such as Metagross and Ho-Oh. Thunder hits Kyogre for maximum damage, and with rain support, it does well against Ho-Oh, Snorlax, and Steel-types. Thunderbolt is substantially weaker but still hits Kyogre fairly hard and allows Latios to maintain BoltBeam coverage when used on a sun team. Ice Beam hits Groudon hard and covers many foes with Thunder or Thunderbolt. Dragon Claw gives up some damage against Groudon, but it still hits opposing Latios, Latias, and Rayquaza while hitting Snorlax acceptably without having to rely on Thunder and rain. Maximum Special Attack EVs are essential for Latios to function as a strong check to Kyogre and Groudon; they are also important for dealing decent damage to Snorlax and Steel-types. 252 Speed EVs outspeed maximum Speed Rayquaza and Speed tie opposing Modest Latios or Latias. A Timid nature outspeeds Modest Latios and Latias and offensive Lugia, alongside a few other niche threats.</p> <p>This set is versatile, fitting on most team archetypes, and it requires no specific support. Because this set invites in Blissey, it is important for teams to have strong Blissey checks, such as Snorlax, Forretress, and Metagross. The same goes for Snorlax, making good switch-ins to Snorlax such as Forretress, Metagross, Skarmory, Lugia, Gengar, and Dusclops essential. Trappers such as Magneton, Dugtrio, Umbreon, and Wobbuffet are highly effective at disrupting, trapping, and potentially removing some of its checks. A cleric such as Blissey or Celebi can allow Latios to drop Refresh for Calm Mind, helping Latios check Kyogre and Groudon without sacrificing its sweeping potential.</p> "
      },
      {
        "name": "Pure Offense",
        "description": "<p>Pure offense Latios trades some consistency in checking Kyogre and Groudon for increased power. Calm Mind increases Latios's wallbreaking and cleaning potential, letting it tear apart any foe besides Blissey that is not faster than Latios. Hidden Power Fire instead lets Latios hit Shedinja and Steel-types such as Forretress, Metagross, and Jirachi hard under sun. An Electric-type attack is critical for hitting Kyogre, as well as Ho-Oh, Lugia, Skarmory, and Steel-types under rain. With Solar Beam and Dragon Claw, Latios maximizes damage output against Groudon and opposing Latios and Latias, so it has no need for Ice Beam.</p> <p>Because this set doesn't have great longevity against Kyogre and Groudon, it should be run on offensive teams with secondary Kyogre and Groudon checks such as Latias, Blissey, Lugia, and Kyogre. Blissey is one of the few Pokemon that comfortably checks this set, encouraging teammates that are good at punishing Blissey when it comes in such as Snorlax, Forretress, and Dugtrio. Mixed attackers that can bait Blissey into getting KOed by Self-Destruct or Explosion such as Mewtwo and Regice are also good partners. Spikes from the likes of Forretress, Skarmory, Deoxys-D, Omastar, or Qwilfish helps chip Steel-types and Snorlax for Latios to later sweep through. Weather sweepers such as Omastar, Qwilfish, Exeggutor, and Kabutops are great for covering Mewtwo, Deoxys-A, and Aerodactyl, which are some of the only Pokemon capable of revenge killing Latios.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 127823, "username": "Inspirited"}, {"user_id": 306959, "username": "SuperEpicAmpharos"}]}, {"name": "Grammar checked by", "members": [{"user_id": 277988, "username": "dex"}, {"user_id": 517429, "username": "Adeleine"}]}], "writtenBy": [{"user_id": 222996, "username": "Minority"}]}
  },
  "Kyogre": {
    "overview": "<p>Kyogre is a bastard and incredibly hard to take down. That massive Special Attack stat gives its STAB and rain-boosted Water-type moves a real kick.</p> ",
    "comments": "<h1>Other Options</h1> <p>Hidden Power Dark and Ancient Power are both for killing Shedinja. Safeguard is decent, but not really that great of an option for a sweeper like Kyogre. With Endure, it can take a Swords Danced Groudon Earthquake and then use the extra Speed from a Salac Berry to sweep the team with a Calm Minded, Rain Danced Surf.</p> <h1>EVs</h1> <p>Substitute versions need max HP. Otherwise, concentrate on Special Attack. If you really feel like it, with max HP and around 280 Defense, Kyogre can take a Swords Danced Groudon Earthquake. There are two main ways to do the Speed. If Kyogre is your lead, you'll most likely want to make it as slow as possible, perhaps even giving it a -Speed nature and 0 IVs. This is so that when you are up against starter Groudon, your weather can go after theirs, thus claiming priority, forcing a switch. Non-boosted Groudon will not OHKO Kyogre, while Kyogre OHKOes Groudon in the rain with any Water move. As Kyogre is already tied for slowest Uber (and all Pokemon used in Ubers slower than Kyogre are slower, regardless of EVs, for example, Blissey), Speed won't really change much. However, since a lot of people think this way, it's very easy to beat out enemy Kyogre, Groudon, a lot of Lugia, Adamant Rayquaza, and even some Latias and Latios.</p> <h1>Checks and Counters</h1> <p>Blissey with max Special Defense (unless it has Substitute or Rest), or Calm Mind / Psych Up + Thunder, Hidden Power Grass Ludicolo, Quagsire (especially for sets with only Thunder and Surf), Shedinja (beware of Spikes), Latias, Celebi (if it doesn't have Ice Beam), Lanturn with Toxic or Mimic.</p> <h1>Controlling the Weather</h1> <p><em>Leads</p> <p>In a match-up of Kyogre vs. Groudon, if both Pokemon are the first each battler sends out, the slower Pokemon will always control the weather. This is because the faster Pokemon's weather activates first, but is promptly overwritten by the slower Pokemon's.</p> <p><em>Switches</em></p> <p>If Kyogre switches into Groudon, or vice versa, the weather will change.</p> <p>If Kyogre and Groudon switch into each other at the same time, then the person who makes the decision last switches in their Pokemon last, thus dominating the skies. In matches where a person has a limited amount of time to move, this can cause the players to try and play chicken, waiting until the clock is as close to running out as they dare before punching in the move, and praying the connection doesn't lag.</p> <p><em>Rayquaza / Golduck</em></p> <p>If Rayquaza or Cloud Nine Golduck is out, it will report that the weather is still going strong. However, there will be no effect. Solar Beam takes 2 turns, Thunder has 70% accuracy, and no moves are boosted / weakened. If Kyogre or Groudon switch into Rayquaza, Air Lock will still be in play. Once Rayquaza leaves the field, the weather returns to normal.</p> ",
    "sets": [
      {
        "name": "Substitute + Calm Mind",
        "description": "<p>Substituting Kyogre. Thunder is nice for other Kyogre and paralysis, Ice Beam for Groudon (in the sun), Rayquaza, Grass-types, and primarily, Latias and Latios. Calm Mind boosts Kyogre's already amazing Special Defense and makes it nearly unbeatable by Electrics. Knowing that most physical sweepers are countered by Water Pokemon, you are going to have a tad of trouble killing this thing with a few Calm Minds under its belt. 101 HP Substitutes block Blissey and Deoxys-D while you Calm Mind up. It takes 3 Calm Minds to 2HKO Blissey, but watch out for Psych Up and Calm Mind on Blissey (only if it has Thunder).</p> <p>Kyogre is one of those Pokemon that has so much power that it can make use of stuff like the berries, unlike most Pokemon. After a Salac Berry and a few Calm Minds, Kyogre can be quite annoying... It's too slow to use Petaya effectively (the slowest Pokemon in Ubers, really, except for Metagross, Blissey, and Deoxys-D).</p> "
      },
      {"name": "Calm Mind + 3 Attacks", "description": "<p>The other main set. Without Substitute, you can have more diversity in attacking.</p> "},
      {"name": "Tank", "description": "<p>Rest keeps you safe from Toxic, paralysis, and other random forms of damage as you Calm Mind up for the sweep. With these EVs, you survive a Swords Dance Groudon Earthquake, and OHKO it in the rain without a Calm Mind. Just about the only thing that can stop this is another Kyogre with Calm Mind and Thunder, or Calm Mind Latias / Latios. Most other things fail to KO it after a Calm Mind. It easily beats any enemy Kyogre without Thunder or Rest, as well.</p> "},
      {"name": "Water Spout", "description": "<p>Water Spout is the overlooked move for Kyogre, and is often seen as amateur. Rest allows Kyogre to bring Water Spout back to full power, and Sleep Talk lets you do some damage while Sleeping, so you don't waste all of Water Spout's potential on those Resting turns. This Kyogre almost requires paralysis support, as Kyogre is slow, and taking hits is one thing you don't want to do. With paralysis, however, Kyogre can get in a hit before taking one, using a 150 power STAB rain boosted Water move. Water Spout does ~52% to Latios, letting Ice Beam finish it off. It can OHKO Groudon in the sun, and does 44% or so to most Uber Blissey, meaning that with a few layers of Spikes down or if they lack Special Defense, you 2HKO.</p> "},
      {
        "name": "Choice Band",
        "description": "<p>This set is surprisingly effective, unlike its counterpart, the special Groudon. The three most common counters to Kyogre are Blissey, Latias, and Latios. Hidden Power Ghost 2HKOs Latias and Latios, regardless of Calm Minds, and Brick Break 1-2HKOs Blissey. It's best to open with Surf or Ice Beam, usually, unless you know your opponent's team enough to predict what they'll switch to, as this set does benefit a lot from that turn or two of surprise. However, even once they know what kind of Kyogre you have, many teams have a dickens of a time countering it anyway. Unlike Groudon, Kyogre resists Ice Beam, which is far more common than Thunder, and, thanks to its superior Special Defense, takes less from Thunder than Groudon does from Ice Beam. Kyogre's typing also allows it to come in on things like Meteor Mash.</p> <p>Surf and Ice Beam are to stop certain Pokemon from walling you. Surf hits Groudon in the rain with an OHKO, while Ice Beam is stronger in the sun. Ice Beam will OHKO Rayquaza, Surf hits Skarmory and Metagross. Rock Slide can be used to hit Rayquaza if you're using Surf, as well as Ho-Oh, but Sleep Talk makes Kyogre a perfect Exeggutor counter, and eliminates another weapon from Blissey's arsenal (Sing). Earthquake can be used, as well, but it won't be hitting much, if anything, harder than your other moves, aside from the rare Lanturn.</p> "
      }
    ]
  },
  "Groudon": {
    "overview": "<p>Groudon is an excellent physical attacker with its base 150 Attack stat and STAB Earthquake. However, Ice Beam is quite possibly the most common attack in Ubers, and Groudon, being slow, has trouble switching into a lot of things. If you can take Lugia down, though, this makes a good stallbreaker. It can support Sunny Day-style teams with its ability, but Solar Beam isn't that good in Ubers, and Fire isn't particularly good, either. Still, nothing likes switching into its Earthquakes, and it can OHKO those things immune to them with a Choice Band attack for the most part.</p> ",
    "comments": "<h1>Other Options</h1> <p>Counter can be used to kill other Groudon and the common Choice Band Rayquaza, but Groudon and Rayquaza aren't really the most common switch-ins to Groudon. Groudon can use Substitute to block Knock Off and Toxic, as it cannot be broken by weaker physical attacks or Seismic Toss. Groudon can use Thunder Wave to paralyze Latias, Latios, and Lugia and then kill them with paralysis + flinch by pairing it with Rock Slide. Don't use Eruption; it's absolutely horrible.</p> <h1>EVs</h1> <p>For the Substitute versions, you will want 404 HP; it's nice for Blissey and Deoxys-D. Sweeping Groudon can have max Speed for the tie or win against Kyogre, which can help a lot. Another option is little-to-no Speed. Groudon is tied for slowest Uber in the game with Deoxys-D and Kyogre, and most Ubers like to hang out at 307 Speed, 1 above Groudon's maximum. If Groudon won't be beating them, why not just power up its Attack and defenses? You could run a very small amount of Speed to beat other Groudon and Kyogre that also have low Speed. For lead Groudon, you might want to be slower than lead Kyogre, so that your weather overwrites its, possibly even using Brave and lowering Speed IVs to 2 (with Hidden Power Bug) or 3 (With Hidden Power Ghost). Regardless of what you do, you will want a lot of Attack EVs unless you are running a stall set.</p> <h1>Checks and Counters</h1> <p>Latias and Latios are immune to Earthquake, resist Fire, survive everything Groudon can throw at them save Choice Band Hidden Power Bug or Ghost, and can OHKO with Ice Beam (but Groudon with Special Defense EVs survives and can go for the 2HKO). Flygon works, but is very specific and won't do much to almost anything else, and it still needs Solar Beam to do anything to Groudon. Lugia can take hits all day with a Reflect up and can just Toxic stall Groudon to death, or it can alternate between Calm Mind and Recover before killing with Ice Beam. Exeggutor survives everything but Hidden Power Bug, Fire Blast, and Overheat, and OHKOes Groudon with Solar Beam (watch out for a Rayquaza switch-in to defend against this). Kyogre somewhat... you won't want to switch Kyogre into a Groudon Earthquake. If Groudon is faster and has a Swords Dance on the switch, Kyogre will get OHKOed, unless Kyogre has 404 HP (252 EVs) and 276 Defense (240 EVs).</p> <h1>Controlling the Weather</h1> <p><em>Leads</p> <p>In a match-up of Kyogre vs. Groudon, if both Pokemon are the first each battler sends out, the slower Pokemon will always control the weather. This is because the faster Pokemon's weather activates first, but is promptly overwritten by the slower Pokemon's.</p> <p><em>Switches</em></p> <p>If Kyogre switches into Groudon or vice versa, the weather will change.</p> <p>If Kyogre and Groudon switch in at the same time, then the person who makes the decision last switches in their Pokemon last, thus dominating the skies. In matches where a person has a limited amount of time to move, this can cause the players to try and play chicken, waiting until the clock is as close to running out as they dare before punching in the move and praying the connection doesn't lag.</p> <p><em>Rayquaza / Golduck</em></p> <p>If Rayquaza or Cloud Nine Golduck is out, the game will report that the weather is still going strong. However, there will be no effect. Solar Beam takes two turns, Thunder has 70% accuracy, and no moves are boosted or weakened. If Kyogre or Groudon switch into Rayquaza, Air Lock will still be in play. Once Rayquaza leaves the field, the weather returns to normal.</p> ",
    "sets": [
      {
        "name": "Swords Dance",
        "description": "<p>Overheat is used to kill Skarmory and Forretress and can also be used to kill Exeggutor. It's used over Flamethrower and Fire Blast because Flamethrower fails to OHKO all but Forretress if Groudon doesn't have Special Attack EVs and Fire Blast has less accuracy. Fire Blast can be used to avoid the Special Attack drop, but you almost never need it for multiple Pokemon on the enemy's team. Use Hidden Power Ghost with Overheat and Hidden Power Bug with Rock Slide generally, although you can use Overheat with Rock Slide if you want. Hidden Power Ghost fails to OHKO Exeggutor on the switch in, though, so beware of that. Other than that, however, Hidden Power Ghost and Hidden Power Bug both hit Latias and Latios equally hard. Hidden Power Ghost also hits Lugia, so Rock Slide isn't as useful. Rock Slide hits Rayquaza, Lugia, and Ho-Oh. For a single physical supplementary attack, however, Hidden Power Ghost is usually used over Rock Slide and Hidden Power Bug because it hits Latias, Latios, and Lugia. Ho-Oh is much less common than Latias, Latios, and Lugia, three of the most common Ubers, so you get better coverage with Overheat than with Rock Slide.</p> "
      },
      {"name": "Choice Band", "description": "<p>Choice Band Groudon works really well. Hidden Power Bug and Hidden Power Ghost both hit Latias and Latios. Hidden Power Bug also OHKOes Exeggutor and Celebi however, while Hidden Power Ghost will not. Overheat really rampages through Skarmory, Forretress, and Exeggutor. This means Hidden Power Ghost eases up predicting the switch to Lugia and also does more to stuff like Rayquaza and Ho-Oh should you not predict them coming in.</p> "},
      {"name": "Substitute + Salac", "description": "<p>Groudon can come in on the likes of Blissey, set up a Substitute as the opponent switches, and then proceed to Swords Dance. Groudon can continue to Substitute until it gets the Salac Berry boost, allowing it to outspeed positive natured Deoxys-A. Earthquake gets STAB and hurts Forretress and Mewtwo after a Swords Dance or two, while Hidden Power Ghost hurts Lugia, Latias, and Latios.</p> <p>The 204 Speed EVs allow Groudon to outspeed Deoxys-A and normal Deoxys after the Salac Berry boost, and maximum Attack is obvious on a sweeper. 44 HP EVs mean the Salac boost comes on the third Substitute, and the additional 8 EVs are relegated to Special Defense.</p> "},
      {"name": "RestTalk", "description": "<p>Only use Roar with a few layers of Spikes down. Once you have these in place, you can send Groudon out versus something like Blissey and Roar as they go to Lugia. This will bring in anything but Lugia, which generally means something Groudon takes on fairly well. This set completely walls just about any Blissey, non-Calm Mind Lugia, and physical Deoxys-A. Toxic can be used to actually do something to Lugia, and then you can Rest off its Toxic and use Earthquake to keep Blissey from coming in and using Aromatherapy. The EVs given make Choice Band Metagross's Meteor Mash a 3HKO but still leave Groudon with some attacking power.</p> "}
    ]
  },
  "Rayquaza": {
    "overview": "<p>Rayquaza is nearly identical to Salamence. It shares the same type and similar stats--somewhat. Rayquaza has more Attack, and a hell of a lot more Special Attack for only a bit less Speed. This thing is Mr. Utility--it learns a lot of moves.</p> ",
    "comments": "<h1>Other Options</h1> <p>Rayquaza can produce 101+ HP Substitutes, so that alone should allow you to think of some ways to deal with Blissey and Deoxys-D, which both make appearances in the uber metagame rather often. Psych Up is great for snatching some Calm Minds, but just be sure that what you're taking from doesn't have Ice Beam. It's not on any regular moveset because most things DO possess Ice Beam (or Rock Slide if you're trying to grab Swords Dances from Groudon). Bulk Up can make it easier to take physical hits from Groudon, Metagross and Dragon Dance Rayquaza while setting up, and is best used with Extreme Speed.</p> <h1>EVs</h1> <p>Choice Bander set needs maximum Attack. You could go for 280 Speed, which beats Kyogre / Groudon without a +Speed nature. 308 is an option with Jolly to beat their absolute maximum. Or alternately, go for the spread listed under the Choice Band set. The Special Rayquaza needs no Attack EVs, even when using Brick Break, just go for 216 in Speed, 40 HP and the rest in Special Attack.</p> <h1>Checks and Counters</h1> <p>Special sweepers with Ice Beam. Rock Slide from Groudon can take on the less bulky Rayquaza, Latias and Latios can KO it, and survive most of its attacks, but has to be on its guard against Choice Banded or Dragon Danced Hidden Power Bug and Ghost. Skarmory completely walls Choice Banders without Overheat (and almost none have it). Lugia can set up a Reflect against it, Toxic it, and stall it out with Pressure and Recover, or just alternate Calm Mind and Recover until finally killing you with Ice Beam. Kyogre is a great counter, but Choice Banded Earthquake and Hidden Power Flying are a 2HKO, so it has to either outspeed it, or scare it into thinking it will outspeed it (won't work with Jolly Rayquaza). Alternately, a Kyogre with 252 HP EVs and 252 Defense EVs takes 49% max damage from Adamant Choice Banded Earthquake (and it also defeats Swords Dance Groudon), so it's not as bad as it sounds, as long as you pack Ice Beam.</p> ",
    "sets": [
      {
        "name": "Choice Band",
        "description": "<p>What you may have noticed right away is that this has Hidden Power Bug / Ghost over Hidden Power Flying. This is because nothing takes more in Ubers from Hidden Power Flying than it does from Hidden Power Bug/Earthquake (well, after STAB, Hidden Power Flying is 105, Earthquake is only 100, but they're practically the same), but Hidden Power Bug and Ghost are super effective against a whole lot of the Psychic-based uber metagame. Choice Banded Hidden Power Bug hurts. Don't believe me? Here are some numbers:</p> <p>Latias and Latios are OHKOed without Defense or HP EVs (standard). In fact, Latias needs 240 HP EVs to have guaranteed survival. Latios is even worse off. If it wants to be certain of surviving a single hit, it needs not only 252 HP EVs, but an additional 72 Defense EVs.</p> <p>Another major difference between this and the old standard (252 Attack / 252 Speed, Adamant) is how much bulkier this is. The main reason is Exeggutor. Rayquaza makes a good switch-in to Exeggutor, because its ability means that it blocks sunlight, so Solar Beam takes two turns, and Chlorophyll is nullified. This means that if you switch in on a Solar Beam, you are faster and can OHKO it, while it can't do anything. This puts a powerful foe out of commission. The EVs are to let it survive max damage Modest Exeggutor Hidden Power Ice in case they guess what you're up to. This will also survive Choice Band Adamant Groudon / Rayquaza Rock Slide every time and can take 2 Choice Banded Rayquaza Extreme Speeds.</p> <p>An alternate EV spread can be used to make your Rayquaza fast. If you give it Jolly and max Speed, it is faster than all Groudon and Kyogre and also beats the few Latias and Latios remaining that just put in 307 Speed. Obviously, you'd want to max Attack as well.</p> "
      },
      {"name": "Dragon Dance", "description": "<p>This set is extremely rare in Ubers, as it can be difficult to set up Rayquaza (Ice Beam is the most common move). If you can bring it out on stuff like Choice Banded Earthquakes or Deoxys-A, you can Dragon Dance as they switch to whatever. Mewtwo falls just short of being KOed, so smack it around with an Earthquake or something the first time it comes in and then save it for later. Extreme Speed is used for Deoxys-A (allowing you to kill them without a Dragon Dance, or run a lot less Speed), in which case you'll want Hidden Power Ghost for Lugia. Rock Slide hits Lugia a bit harder, but the real benefit is to get Ho-Oh on its 4x weakness and a possible OHKO on other Rayquaza. Earthquake hits stuff like Metagross, Kyogre, and Groudon who aren't weak to your other moves.</p> "},
      {"name": "Special Attacker", "description": "<p>Look familiar? This is like Salamence's special moveset, only with the addition of Thunderbolt. Surf is redundant, since Thunderbolt will kill Ho-Oh just as well, and Ice Beam takes care of Groudon. Crunch is for Psychic-types like Mewtwo and the Deoxys, while Dragon Claw makes good STAB and a nice choice for dealing with Latios / Latias switch-ins. Fire Blast can hurt Metagross a lot, while Brick Break owns Tyranitar and Blissey.</p> <p>Unlike Salamence's special set, this set is quite cool. It will kill almost any Groudon and enemy Rayquaza, and nearly 2HKO Kyogre. Dragon Claw is needed for the 2HKO on Latias, but Ice Beam will generally do the job against Latios (they can both skew these numbers by adding Special Defense EVs or HP).</p> "}
    ]
  },
  "Jirachi": {"sets": [{"name": "Calm Mind", "description": "<p>Jirachi has some great resistances to take advantage of in Ubers, as it is immune to Toxic and resists Dragon Claw and Ice Beam. It's one of the few usable Pokemon that resists Normal and Meteor Mash as well. Thunder takes advantage of Kyogre's rain with a 100% accurate move with a 60% chance of paralysis. Ice Punch hits Latios, Latias, Rayquaza, and Groudon hard. Psychic is not needed, as it's a very bad attack type in Ubers. This set easily beats Blissey and Deoxys-D, although Knock Off is a pain. Substitute can be used to block Knock Off and critical hits as you Calm Mind up, but Wish gives Jirachi more longevity and heals your whole team. If you ever find something you can't deal with, Jirachi can just use Thunder and most likely paralyze it, or if you're feeling really lucky or desperate, it can Ice Punch and hope for the 20% freeze. Jirachi can beat Kyogre if it gets a free Calm Mind, too.</p> "}]},
  "Deoxys": {
    "overview": "<p>The following analysis was produced many years ago and is currently being <a href=\"https://www.smogon.com/forums/threads/deoxys-n-uber-qc-0-2.3686233/\">revamped</a>. Information contained in the analysis may be misinformative with regard to the current ADV Ubers metagame.</p> <hr /> <p>Deoxys-A is generally the better pick between the two offensively based Deoxys formes as its Attack and Special Attack stats are far superior to that of this Deoxys.</p> ",
    "comments": "<h1>Other Options</h1> <p>There is virtually nothing else viable. Psycho Boost can be used, but it won't really hit anything harder than Deoxys's other moves.</p> <h1>EVs</h1> <p>360 Speed minimum, generally max. Max out Special Attack for the first set, Attack for the second. Don't even bother with defenses. This is from Deoxys-A, but basically it stands correct.</p> <h1>Checks and Counters</h1> <p>Just attack away at this thing. It has better defensive stats than Deoxys-A, but just like Deoxys-A, it can be taken down easily.</p> ",
    "sets": [{"name": "Special Sweeper", "description": "<p>You'll probably want Deoxys's HP to be divisible by four, in case of Tyranitar, so you can activate your Petaya at 1/4 instead of 1 HP. Unlike Deoxys-A, Calm Mind is a lot less of an option, because Deoxys doesn't force switches as well due to its lower Attack.</p> "}, {"name": "Choice Band", "description": "<p>Choice Band Deoxys basically fails in every regard compared to Deoxys-A, but if you want to still use this Deoxys forme, it can work, but to a lesser degree.</p> "}]
  },
  "Deoxys-Attack": {
    "overview": "<p>The following analysis was produced many years ago and is currently being <a href=\"https://www.smogon.com/forums/threads/deoxys-a-ubers-gp-0-2.3682126/\">revamped</a>. Information contained in the analysis may be misinformative with regard to the current ADV Ubers metagame.</p> <hr /> <p>The absolute best cleaner in the game. Absolute best. Nothing stops Deoxys-A.</p> ",
    "comments": "<h1>Other Options</h1> <p>Pursuit is a decent option, as most people's first reaction upon seeing Deoxys-A is to switch out to something like Metagross, Groudon, or Kyogre. There isn't really much else Deoxys-A can survive to do.</p> <h1>EVs</h1> <p>For a Choice Band user, max Attack and max Speed. For the Substitute set, max Special Attack and max Speed along with Mild is probably best. On either of them, a +Speed nature is also good because it beats out Exeggutor and other Deoxys-A (only with Extreme Speed, or it's pointless to beat out the other Deoxys-A, who will likely just Extreme Speed, and if they don't have Extreme Speed, they switch out). Considering the rarity of Timid Mewtwo (as it beats nothing that's used on 95% of teams that Modest doesn't), you could go down to 360 Speed and still beat out Modest Mewtwo to give you more EVs for a mixed sweeper set.</p> <p>Always use a Defense hindering nature if you're using two types of attacks. You obviously won't want to lower one of the attacking stats, and Deoxys-A needs all the Speed it can get. So it comes down to lowering Deoxys-A's Defense or Special Defense. There isn't a used physical attack that Deoxys-A will survive, regardless of nature, except maybe the rare Superpower from Deoxys-D. However, Deoxys-A can survive Pursuit (if it doesn't switch) from Metagross and Knock Off from Deoxys-D. If you'll notice, all of these are Dark attacks, meaning they run off the Special Attack stat. Knock Off does 29-34% to Deoxys-A, assuming Deoxys-D has no Special Attack EVs. This is almost always a 4HKO. It does 32-37% to a Deoxys-A with a Special Defense hindering nature, which is almost always a 3HKO. If Deoxys-A stays in on a Metagross with no Special Attack EVs and a Special Attack neutral nature, it can sometimes survive even with three layers of Spikes down and always with two layers down (72-84% damage). This is not the case for a Special Defense hindering nature Deoxys-A. Deoxys-A can also survive Lugia's Ice Beam by 5% at the least if its nature is neutral, but with a Special Defense hindering nature, Deoxys-A often dies. Even Psycho Boost Lugia doesn't have a guaranteed OHKO without Special Attack EVs (lots of Lugia don't have any, because of all the defense needed).</p> <h1>Checks and Counters</h1> <p>Deoxys-D can do a moderate job against non Shadow Ball ones, but really, wow. This thing has amazing Attack and Special Attack stats, and a great movepool to take advantage of those stats.</p> <p>Ninjask is faster than Deoxys-A if Ninjask is Jolly or if Deoxys-A isn't Hasty and can OHKO with any of its attacks. It can only come in on Superpower (Choice Banded is a 3HKO), Solar Beam, and Calm Mind, though. It can actually damage many other Ubers with that STAB Bug attack, so it's not entirely useless outside of stopping a Deoxys-A sweep. It is still at risk of dying to Extreme Speed, however. Dodrio and Swellow can kill Deoxys-A with Quick Attack; have a perfectly safe switch in on Shadow Ball, the most commonly used move on physical Deoxys-A; and can use Return or Double-Edge if Deoxys-A is Choice Banded, which seriously hurts most Pokemon. Arcanine can switch into anything Deoxys-A throws at it, save Psycho Boost, thanks to Intimidate, and use Extreme Speed, but it is really easy to switch out of. Rayquaza is probably the best counter, as the Choice Band user is the most common and a lot of people still haven't caught on to using Ice Beam as the last move, so it's a fairly safe switch-in. However, you have to beware of the Substitute / Ice Beam set, because it sets up a Substitute as you switch to Rayquaza, and then you have to switch out because of the Ice Beam threat. Pursuit Metagross can stop Deoxys-A after the initial kill with 100% safety (unless it has Thunder in the rain or Fire Punch in the sun and stays in) or can come in on anything from the Choice Band user but +Attack Superpower. With Spikes down, Choice Band Trapinch can come in after Deoxys-A kills something and use Quick Attack, unless it's using Choice Band Extreme Speed, in which case Trapinch dies even with max Defense.</p> ",
    "sets": [
      {
        "name": "Choice Band",
        "description": "<p>Shadow Ball and Superpower OHKO stuff like crazy. Shadow Ball should be your basic move because it hits so much of the Uber metagame super effective, and Superpower hits just about everything that resists Shadow Ball super effective as well as having massive power for stuff like Kyogre that is neutral to both. Extreme Speed can OHKO other Deoxys-A you might encounter as well as allowing you to finish off a wounded Rayquaza before it can Extreme Speed you. Rock Slide can go on there somewhere if you're afraid of Ho-Oh and want to try for a flinch against Lugia as well as hitting Rayquaza super effective. Ice Beam 2HKOes Groudon and OHKOes Rayquaza, which is very useful. Defensive Groudon can sometimes take two Psycho Boosts due to the Special Attack drop as well as the 90% accuracy (unless you invest a few Special Attack EVs, but why do that if there's a better option available?), and survives two Superpowers (you need to roll absolute max damage both times to 2HKO max HP Groudon, and some Groudon have Defense EVs). Ice Beam, on the other hand, will always 2HKO Groudon. Use Fire Punch with your own Groudon and Thunder with your own Kyogre to kill Skarmory, Forretress, and Metagross (especially Metagross, as Pursuit OHKOes Deoxys-A if it switches out).</p> "
      },
      {
        "name": "Special Sweeper",
        "description": "<p>Special sweeper Deoxys-A can actually deal huge damage with +1 Special Attack from Petaya. You'll generally want to make sure to make your HP divisible by four so that the Petaya will activate on the third Substitute, thus allowing Deoxys-A to withstand Tyranitar's Sand Stream for a few turns, but HP not divisible by four can let you scout for misses with the extra Substitute. Superpower is for the chance to OHKO Blissey (especially with how few Blissey even have any Defense EVs), and it definitely does enough to Blissey if she tries to switch into you (as you can attack from behind your Substitute).</p> <p>Because the Choice Band set is far more common and seen as more powerful, Deoxys-A is always assumed to be Choice Banded. There are a few things that can stop this Deoxys-A, but because your opponents will be acting on the assumption that it is Choice Banded first turn out, you have the element of surprise in your favor, which, when dealing with an attack stat over 500, is lethal.</p> "
      },
      {
        "name": "Sunny Day",
        "description": "<p>This really wreaks havoc in the Uber metagame. It looks strange, but really only a healthy Kyogre can stop it, along with the Extreme Speed users of course (Rayquaza in particular). The EVs are up to debate, though even if you maximize Special Attack, it needs the sun to be strong in order to do large amounts of damage to Metagross. Even then, it most likely won't be an OHKO, so you will want to dent it a little first--about 15-20% to be safe. Also note that a lot of Groudon are now running Special Defense, so Solar Beam won't OHKO either; be sure to wear it down as well. Extreme Speed is an option if you want to be able to hit Rayquaza for nominal damage and have a chance against other Deoxys-A. All those Attack EVs are necessary to ensure an OHKO on most Latios and Latias, which is also what the optional Spell Tag is for. It's best if you hold onto this sort of Deoxys-A until the end of the match because its value is in the diverse way it sweeps rather than the pure force of something like the Choice Band set.</p> "
      }
    ]
  },
  "Deoxys-Defense": {
    "overview": "<p>Deoxys-D takes hits like NOTHING and Recovers right in your face with Pressure.</p> ",
    "comments": "<h1>Other Options</h1> <p>Snatch is awesome for stopping 101 HP Substitute users. It also works well for catching Kyogre Calm Minds and tanking even better. Torment makes life hell for a whole lot of sweepers.</p> <p>Superpower helps against Blissey, as a lot of them think they can stay in and Toxic Deoxys-D and run little to no defense in Ubers; it also does a lot to Tyranitar. Ice Beam makes Deoxys-D counter Rayquaza even better. Extreme Speed makes it a poor man's counter to Ninjask, Flail users, and Deoxys-A (the Substitute + Petaya version in particular). Thunder is a decent option on the Calm Mind set to hit harder in rain.</p> <p>Reflect and Light Screen are always good moves on a tank like Deoxys-D.</p> <h1>EVs</h1> <p>Max HP always. Taunting versions without Agility will need a little bit of Speed EVs to be faster than enemy Deoxys-D. Otherwise, just pump those EVs into Defenses.</p> <h1>Checks and Counters</h1> <p>Blissey can Toxic Deoxys-D if it doesn't Taunt, Rest, or Aromatherapy, which puts an end to it. 101 HP Substitute Pokemon such as Kyogre and Groudon work if they can avoid a Toxic. However, if Deoxys-D sets down Spikes, you just make it run, possibly to Lugia, who will Whirlwind most counters away for Spikes damage. Taunt Mewtwo really gives it trouble. Latias and Latios with Safeguard or Refresh beat it one-on-one, but the threat of Knock Off keeps them at bay. Choice Band Metagross 2HKOes with Meteor Mash. Swellow and Heracross love that Toxic, and Heracross just destroys it regardless; same for Scizor.</p> ",
    "sets": [
      {"name": "Spiker", "description": "<p>Deoxys-D is the best Spiker in the game, hands down. It survives both physical and special hits, cannot be trapped by Magneton, and gives Dugtrio a run for its money. This is the standard Deoxys-D set.</p> "},
      {
        "name": "Agility",
        "description": "<p>Deoxys-D has 216 Speed without any EVs, which is plenty for Agility to work out fine. The premise behind this is that the most common counter to Deoxys-D is a Pokemon that makes 101 HP Substitutes and most everything is faster than it. Lots of times, it's possible to Toxic one enemy, say Rayquaza, but then if they switch out to something that makes 101 HP Substitutes, it's easy to catch you unaware, so you can't Toxic them on the switch. Another common occurrence is that after one enemy dies to Toxic, they'll send out a Substituting Pokemon or a Taunting Mewtwo, preventing Deoxys-D from doing anything useful. If you first Toxic whatever's out there, then Agility, problem solved. You're too fast to be Taunted, and if the enemy tries to hide behind a Substitute, you get in a Toxic first, so the Substitute only quickens its death. Many people don't even realize Deoxys-D has Agility, even once you use it, so they are extremely surprised when you kill their Rayquaza and Kyogre.</p> <p>This also allows you to do stuff like Knock Off Deoxys-A's Choice Band before it can use Shadow Ball (and Knock Off does over 30% to Deoxys-A).</p> <p>Taunt stops Blissey from ruining your fun with Aromatherapy and shuts down stallers like Toxic Lugia, Blissey, and other Deoxys-D. If Blissey tries to pull a fast one on you and use Icy Wind to cut you down to size, just use Agility again every once in a while, and the problem is solved.</p> "
      },
      {"name": "Cosmic Power", "description": "<p>This is a stalling, defensive set. It doesn't work nearly as well as others, especially not with the prevalence of Whirlwind Lugia and Aromatherapy Blissey. Rest is preferred over Recover to heal Toxic.</p> "},
      {"name": "Calm Mind", "description": "<p>Deoxys-D actually makes a decent Calm Mind user because it can take physical hits after setting up. You can either go for an option to damage Dark- and Steel-types or take the option of Taunting all recovery and status from Blissey, as well as phazing (primarily Lugia). Either works. Use Recover with Taunt, Rest with the elemental attacks. Psychic and Ice Beam both work as Deoxys-D's only attack, but always use Ice Beam with Thunder or Thunderbolt. Toxic is your only hope at beating other Calm Mind users, honestly. Save the surprise of Toxic if your opponent has Safeguard Latias or Latios, because when they see Calm Mind, they probably won't expect it.</p> "},
      {"name": "CounterCoat", "description": "<p>Taunt is used to force the enemy to attack, and then you Counter or Mirror Coat accordingly and Recover off damage. This only works with Spikes; otherwise, the opponent can just keep switching around.</p> "}
    ]
  },
  "Deoxys-Speed": {
    "overview": "<p>Probably the worst Uber. Offensive sets are either a poor man's Deoxys-A or a poor man's Mewtwo, and defensive sets wish they were Deoxys-D. At least it has Speed going for it.</p> ",
    "comments": "<h1>Other Options</h1> <p>Oh lordy, this Pokemon can do a lot. It can pull off Counter or Mirror Coat (best used with Recover). Deoxys-S gets Light Screen, Reflect, and Safeguard, and it has the Speed to use any of these. Substitute is an option for most Pokemon, but especially things with a lot of Speed, and this Pokemon is all about the Speed. Rock Slide works if you are lucky and want to flinch, as Deoxys-S is fast enough to flinch anything, and it hits both Ho-Oh and Rayquaza. Pursuit is available for other Psychic-types, especially Deoxys-A, but it needs to be used carefully, as some of those Pokemon can do some damage to Deoxys-S if they know it has Pursuit and stay in (you need 172 Special Attack EVs to have a chance to OHKO and 248 Special Attack EVs and a +Special Attack nature to always OHKO a Deoxys-A that stays in). Snatch always allows for some creativity, so don't be afraid to get creative with Deoxys-S.</p> <h1>EVs</h1> <p>For most sets, you'll want to get to 440 Speed to be faster than +Speed Deoxys-A, which requires 16 Speed EVs and a Speed boosting nature or 176 EVs and a neutral nature. Offensive sets should go for maxing the attacking stats, and defensive sets should max HP and then focus on the defenses.</p> <h1>Checks and Counters</h1> <p>The most reliable counter is probably Forretress. It can Rapid Spin away Spikes, is immune to Toxic, doesn't take much from physical attacks, doesn't take much from special attacks except Thunder and Fire Punch, and can easily 2HKO with STAB Hidden Power Bug. Tyranitar and Snorlax beat Deoxys-S that lack Superpower. Blissey can stop anything without Taunt or Superpower. Groudon with max HP is rarely 2HKOed by Ice Beam, and it can OHKO or 2HKO back with Earthquake (guaranteed OHKO if it is Choice Banded). Kyogre 2HKOes Deoxys-S with Surf even if it gets a Calm Mind in (it OHKOes otherwise), but it is 2HKOed by Thunder after Deoxys-S uses Calm Mind. It won't take much damage from anything else, however. Latias and Latios can Calm Mind up against any special attacker and easily beat it with their high Special Defense, but hate Knock Off variants. Ho-Oh beats any Deoxys-S that does not have Rock Slide.</p> ",
    "sets": [
      {"name": "Staller", "description": "<p>Toxic opponents, Taunt all forms of recovery and status, and toss in a few Knock Offs between Recovers and Taunts. Nothing is getting an Aromatherapy past this.</p> "},
      {"name": "Mixed Sweeper", "description": "<p>Unlike Deoxys-A, this can actually take special hits as it uses Calm Mind to set up. Superpower is to stop Blissey from blocking you. With these EVs, Deoxys-S will 2HKO a 4/252 Blissey 100% of the time, factoring in the Attack drop from Superpower, and it is just faster than a Hasty Deoxys-A, the fastest Pokemon you'll encounter in Ubers (except some Swift Swimmers). If you want Deoxys-S's special attacks to have a bit more power, you can switch to Mild, lower its Attack, and raise its Speed to 176 EVs.</p> "},
      {"name": "Choice Band", "description": "<p>Deoxys-S is not the strongest Choice Band user out there, but its fantastic Speed makes it a good choice. Nothing resists the combo of Superpower and Shadow Ball. Extreme Speed is solely to stop Choice Band Deoxys-A. Ice Beam beats Groudon and Rayquaza, but Fire Punch helps against Forretress and Metagross. Only use Fire Punch if you have Groudon. If you have Fire Punch, you might want to replace the Special Attack EVs with HP, but Ice Beam needs the Special Attack to damage its intended targets.</p> "},
      {"name": "Support", "description": "<p>This attempts to set up Spikes and Knock Off random items. Shadow Ball lets it finish off Latias and Latios and OHKO Deoxys-A.</p> "},
      {"name": "Taunt + Calm Mind", "description": "<p>This set has obvious weaknesses to Dark- and Psychic-types if you go with Psychic and is stopped cold by Kyogre if you use Ice Beam, but it beats Blissey and company one-on-one. Deoxys-S has the Speed to come in on some other Calm Mind users and win any Calm Mind war by Taunting any attempts by the enemy to Calm Mind. The only way this can backfire is if the enemy Calm Minds once while Deoxys-S switches in and is a Pokemon that has a strong non-Psychic attack to hurt Deoxys-S with, such as Latias, Latios, and Kyogre. Other than that, the fastest Taunt user in the game ruins a lot of stuff; try it out and have fun.</p> "}
    ]
  }
}