{
  "Snubbull": {"sets": {"Utility": {}}},
  "Ralts": {"sets": {"Utility": {}}},
  "Duskull": {"sets": {"Defensive": {}}},
  "Koffing": {"sets": {"Defensive": {}}},
  "Trapinch": {"sets": {"Offensive Trapper": {}}},
  "Diglett": {"sets": {"Specially Defensive Trapper": {}, "Offensive Trapper": {}}},
  "Meowth": {"sets": {"Lead": {}}},
  "Mankey": {"sets": {"Substitute + Reversal": {}}},
  "Abra": {"sets": {"Offensive Calm Mind": {}, "Bulky Calm Mind": {}}},
  "Machop": {"sets": {"Offensive": {}}},
  "Bellsprout": {"sets": {"Sunny Day Sweeper": {}}},
  "Ponyta": {"sets": {"Sunny Day": {}}},
  "Magnemite": {"sets": {"Offensive Utility": {}}},
  "Doduo": {"sets": {"Choice Band": {}}},
  "Gastly": {"sets": {"Mixed Offensive": {}}},
  "Onix": {"sets": {"All-Out Attacker": {}}},
  "Voltorb": {"sets": {"Offensive": {}}},
  "Exeggcute": {"sets": {"Sunny Day Sweeper": {}}},
  "Cubone": {"sets": {"Offensive": {}}},
  "Horsea": {"sets": {"Rain Sweeper": {}}},
  "Staryu": {"sets": {"All-Out Attacker": {}}},
  "Porygon": {"sets": {"Tank": {}}},
  "Chinchou": {"sets": {"Offensive": {}}},
  "Pineco": {"sets": {"Spikes": {}}},
  "Houndour": {"sets": {"Special Attacker": {}}},
  "Elekid": {
    "sets": {
      "Substitute + 3 Attacks": {
        "description": "<p>Elekid's incredible Speed, high Special Attack, and diverse offensive movepool make it adept at forcing switches, letting it take advantage of them by using Substitute. Alongside giving Elekid an extra hit, Substitute also lets it avoid getting paralyzed by slower foes such as Porygon. Ice Punch 2HKOes Ground-, Grass-, and Dragon-types such as Trapinch, Exeggcute, and Bagon, though Elekid usually needs its Special Attack boosted to beat the former type. Thief lets Elekid steal its foe's Sitrus Berry after using up its own item, notably preventing Porygon from healing using Recycle. Hidden Power Grass is an alternative, 2HKOing the only Pokemon in LC that resists both Thunderbolt and Ice Punch in Chinchou. It also puts mixed bulky attacker Wailmer into range of Thunderbolt while rarely triggering Sitrus Berry, allowing Elekid to generally beat it one-on-one if it survives the turn, which is possible if it's behind a Substitute. Sitrus Berry lets Elekid fully heal itself after being brought to low HP, notably allowing it to create more Substitutes. Petaya Berry is an alternative that pairs nicely with Substitute allowing Elekid to safely get itself to low HP, as the Special Attack boost makes Elekid extremely threatening; it becomes able to reliably OHKO foes such as Abra and Wailmer and gains high odds to do so against Chinchou. Static generally isn't very useful due to Elekid's frailty, but it can paralyze a foe like a Speed-boosted Bagon in a pinch.</p> <p>Elekid is effective at exploiting common threats such as Doduo and Staryu by setting up a Substitute as it forces them out, making it pair nicely with teammates vulnerable to them such as Wailmer and Cubone. Elekid can often force in Porygon, with Thief variants adept at ruining its longevity. Elekid struggles to take on Chinchou, especially if it isn't running Hidden Power Grass, making checks to it like Porygon good partners. Elekid's role somewhat varies depending on its item—with Sitrus Berry, it has more mid-game utility, able to stay healthy to repeatedly set up Substitute to keep on attacking the opposing team, while Petaya Berry makes it more of a dedicated cleaner that uses its sheer power to overwhelm its checks. However, Elekid must make sure the time is right for it to start its sweep with Petaya Berry, because even if it can overwhelm a check like Chinchou one-on-one, it can then potentially be revenge killed by a priority user like Doduo or possibly lose the Speed tie against Diglett. It's best for Quick Attack users to first reveal themselves and be eliminated before Elekid reveals itself to start its sweep. Elekid struggles with specially defensive Diglett, which Speed ties with Elekid and can OHKO with Earthquake while almost always surviving one Ice Punch. If Elekid is meant to be its team's cleaner, it's recommended that it is not revealed until opposing Diglett are eliminated by a teammate like Wailmer or Trapinch.</p>"
      },
      "SubPunch": {}
    },
    "credits": {"writtenBy": [{"username": "Gangsta Spongebob", "user_id": 535530}], "teams": [{"name": "Quality checked by", "members": [{"username": "grape tylenol", "user_id": 593128}, {"username": "Quinn", "user_id": 553008}]}, {"name": "Grammar checked by", "members": [{"username": "aurora", "user_id": 109385}]}]}
  },
  "Larvitar": {"sets": {"Dragon Dance": {}}},
  "Carvanha": {"sets": {"Offensive": {}}},
  "Wailmer": {"sets": {"Mixed Bulky Attacker": {}, "Specially Offensive": {}}},
  "Cacnea": {"sets": {"Offensive Spikes": {}, "Utility Spikes": {}}},
  "Baltoy": {"sets": {"All-Out Attacker": {}}},
  "Lileep": {"sets": {"Defensive": {}}},
  "Anorith": {"sets": {"Swords Dance": {}}},
  "Snorunt": {"sets": {"Spikes": {}}},
  "Bagon": {"sets": {"Dragon Dance": {}}}
}