{
  "Exeggutor": {
    "comments": "<h1>Other Options</h1> <p>Hidden Power Dark has been used in the Uber metagame for a while, but a lot of things still take nearly no damage from it as Ubers tend to have high Special Defense (Latios, Latias, and Kyogre, for example). Hidden Power Ice can be used in Ubers to hit Rayquaza. Wish is useful in any metagame.</p> ",
    "sets": [
      {"name": "Double Powder", "description": "<p>Only, and I mean ONLY use this set on a team containing Groudon. Drought will automatically trigger Chlorophyll and remove Solar Beam's charge up turn. Exeggutor is an excellent counter to an enemy Groudon, as long as it doesn't use Hidden Power Bug or a Fire move. Solar Beam is an easy OHKO on it, but don't use it too soon--you will swiftly be met by Kyogre, Rayquaza or some other Uber that walls you, so catch one with Sleep Powder, then paralyze the next with Stun Spore. Unless the sun is shining, Exeggutor is quite useless in Uber battles because almost everything but Groudon walls it, so don't be afraid to Explode. Psychic is not on this set because a lot of things resist it.</p> "},
      {"name": "SubSeed", "description": "<p>With Chlorophyll, Exeggutor outspeeds just about everything and can perform Sceptile's SubSeed technique quite well. Leech Seed your opponent, and keep using Substitute to drain its health down. This is very useful to drain Blissey's health and support the rest of the team.</p> "}
    ]
  },
  "Mewtwo": {
    "overview": "<p>The following analysis was produced many years ago and is currently being <a href=\"https://www.smogon.com/forums/threads/mewtwo-ubers-qc-2-2-gp-0-2.3682381/\">revamped</a>. Information contained in the analysis may be misinformative with regard to the current ADV Ubers metagame.</p> <hr /> <p>The best special sweeper in the game, most likely. Its Speed lets it outrun common foes like Latias, Latios, and Lugia. It OHKOes physical walls like Groudon with Ice Beam, drops Metagross with the threat of Flamethrower (or just uses Thunder(bolt)), and takes down Skarmory with a Fire or Electric move. It can use Substitute with 404 HP or more to stop most Blissey and Deoxys-D cold, or just use Taunt to beat it and just about any other Calm Mind user except a lucky Kyogre. This is the sole reason Choice Band Deoxys-A is on some teams.</p> ",
    "comments": "<h1>Other Options</h1> <p>Amnesia can outrace Calm Mind from other Pokemon. Barrier stops Groudon while you Calm Mind up. Reflect and Light Screen especially are fun to pseudo-pass; I did not make a set with them, however, as you should really use Lugia if you want to pseudo-pass. Snatch can grab Soft-Boiled from Blissey and Calm Mind from other Pokemon, so it's an OK move. Mewtwo has better choices though.</p> <h1>EVs</h1> <p>At least 330 Speed for the Uber metagame, although Mewtwo can hit Speeds much higher if you want, and 351 is advised for outrunning Latias, Latios, and Lugia. You'll want a good amount of Special Attack and Modest; however, if you use Substitute, put in 404 HP first. Attacking Mewtwo can put less in Special Attack and more in Attack.</p> <h1>Checks and Counters</h1> <p>Honestly, it depends on the set your opponent is running. There is no counter that will work 100% of the time against Mewtwo. Deoxys-D is a safe bet, Blissey might have troubles. Both of those are good at discovering Mewtwo's moveset without instantly dying, unlike Pokemon like Metagross, who can't risk a fire move. Once you know Mewtwo's set, it's not nearly as dangerous (but still very deadly). Deoxys-A can switch into any non-attacking move but Substitute (even Psychic from a non-Modest Mewtwo OHKOs) and OHKO with Shadow Ball, but it needs a Choice Band to do it. It can survive an unboosted Brick Break, but that is extremely rarely used. Choice Band Ho-Oh survives all of Mewtwo's attacks except maybe Self-Destruct, and can hit it hard with Choice Band Shadow Ball (potentially an OHKO), while Mewtwo's Thunderbolt is generally a 3HKO. At the very least, it can be used to scout out Mewtwo's set.</p> ",
    "sets": [
      {"name": "Substitute + Calm Mind", "description": "<p>It's quite easy to set up with that 101 HP Substitute. Ice Beam is generally a better option than Psychic because most Ubers are Psychic-type and Ice Beam hits about every physical attacker harder, while Calm Mind takes care of most special attackers, though Kyogre can be troublesome. Blissey doesn't have a chance at stopping you with this set, unless it has Psych Up / Calm Mind and Thunder, and even then, it's not guaranteed.</p> "},
      {"name": "Calm Mind + BoltBeam", "description": "<p>This set is more versatile but harder to set-up because of no support moves. However, it's pretty much required to bring in Tyranitar, Psych Up Blissey, or Snorlax in on this, because Lugia, Groudon, Rayquaza and Kyogre are all hit with super effective hits. If you use Thunder you will hit Kyogre harder, but risk getting in trouble against Ho-Oh, since Ho-Oh usually comes with Drought from Groudon. Lanturn can also beat this set with Toxic if you don't have Substitute, or can Mimic Calm Mind if you do.</p> "},
      {"name": "SubPunch", "description": "<p>With its large Substitutes Mewtwo can kick the crap out of Tyranitar and Blissey. Ice Beam hits Rayquaza and Groudon hard, while Flamethrower still hits Groudon for a lot of damage, but also stops Metagross, Skarmory, and Forretress. Thunderbolt (or Thunder) is for Lugia and Kyogre (who don't care about Focus Punch or Ice Beam, respectively), and also hits Metagross neutral. Shadow Ball hits any Pokemon with at least a neutral effective move when combined with Focus Punch and takes out Latias, Latios, and other Psychics.</p> "},
      {"name": "Bulk Up", "description": "<p>Nothing to laugh at here. With Bulk Up, he can tear up Lugia, other Mewtwo, Latias, and Latios pretty decently with Shadow Ball. Brick Break takes care of Blissey quite decently. Substitute and Bulk Up can screw over Groudon as long as you don't let it Swords Dance too much and sweep your team. Resistance to Psychic and access to Recover makes him a great switch in on a lot of other Psychics. The last two slots are up to personal preference, really. Recover and Taunt together make for an easy set-up because you won't get status-ed or pseudo-hazed, but with Shadow Ball as your sole attack you're more prone to Metagross, Tyranitar and especially Blissey, Slaking and Snorlax. Flamethrower kills Skarmory, but Taunt will royally screw him up anyway. It also hits Metagross super effectively and does 50% more damage to Groudon thanks to Drought.</p> "},
      {"name": "Choice Band", "description": "<p>Another physical Mewtwo, not much to explain here. Predict switches accordingly and you should have no trouble beating everything. Blend in Fire Blast or Flamethrower to hurt Groudon and Skarmory more, it will also do a number on Metagross. Self-Destruct is great on here as well, it should kill anything that doesn't resist it, with the exception of Groudon.</p> "},
      {"name": "Taunt", "description": "<p>Taunting Mewtwo can stop other Calm Minders, Lugia and Blissey cold. Calm Mind up against Latias, Latios, and the like and Taunt their attempts to Recover or Calm Mind with you. Pressure out their attacks with Recover. Calm Mind in Blissey's face as it can't do anything to your high HP with Seismic Toss. This is maybe my favorite set for Mewtwo as I love the move Taunt and Mewtwo can do a lot with it. Watch out for Tyranitar and Metagross.</p> "},
      {"name": "JAA Mewtwo", "description": "<p>This Mewtwo is designed for Journey Across America, the 2v2 official Pokemon USA Tournament. The Special Defense EVs are to make it survive Kingdra's Hydro Pump guaranteed (barring a CH, of course). Shadow Ball is to hit Ghosts, Ice Beam is for Groudon and Thunder(bolt) is useful for stuff like Kyogre. Self-Destruct when you're through. Be sure to pair this will an ally that knows Protect, or, even better, Endure. If your partner has Endure, then a great strategy is to send out a Pokemon that knows Fake Out (Obi used Jynx, skarm used Persian, and Aeolus used Sneasel). The ideal Pokemon to have Enduring is <a href=\"http://www.smogon.com/rs/pokemon/smeargle\">Smeargle</a> (set 3), as it has Spore and Endeavor. Read <a href=\"http://www.smogon.com/forums/showthread.php?t=11086\">this</a> for a more thorough explanation of the strategy.</p> "},
      {
        "name": "Stallbreaker",
        "description": "<p>This Mewtwo could outstall entire stall teams, if it weren't for Pressure slowly eating away at your Taunt PP. You'll want Substitute or Taunt on this Mewtwo for sure, unless you have an Aromatherapist, so you can block enemy Toxics. Only use Flamethrower with Groudon and Thunder with Kyogre. Thunderbolt and Psychic are options if you use neither of them. Let's say your set is Toxic, Substitute, Taunt, Flamethrower, and the enemy's team contains Skarmory, Blissey, and Lugia. You bring in Mewtwo on Skarmory Spikes, and it runs to Blissey, expecting BoltBeam. You Substitute on the switch (in case Skarmory thinks it's smart by staying in to Toxic, expecting Calm Mind). You Toxic it, but they don't care because they have Blissey with Aromatherapy and Natural Cure. You use Taunt. Continue until Blissey is in KO range for Flamethrower or switches to try and get rid of Toxic. Say they switch to Lugia. You have two options here. You can Toxic if you think they're going to use something like Ice Beam or Aeroblast or whatever, or Taunt Calm Mind or Whirlwind. With those Special Defense EVs, Lugia can't break your Substitute with any special move, except Hydro Pump in the Rain, and even then, it needs Special Attack EVs. Recover gains some longevity, but Substitute is nice to Toxic things like Groudon on the switch, and then Substitute down as they keep Earthquaking, until they're in KO range. It also blocks annoying things like Thunder / Ice Beam Blissey (especially Serene Grace), Knock Off, and Exeggutor / Deoxys-A coming in after a kill. It's possible to run both Recover and Substitute, an attacking move isn't needed, but is very useful.</p> <p>This set gains some effectiveness with Spikes, as it wears down things like Blissey faster, but they aren't needed. Wish helps out Recoverless Mewtwo.</p> "
      }
    ]
  },
  "Mew": {
    "overview": "<p>The following analysis was produced many years ago and is currently being <a href=\"https://www.smogon.com/forums/threads/mew-ubers-qc-1-2.3682376/\">revamped</a>. Information contained in the analysis may be misinformative with regard to the current ADV Ubers metagame.</p> <hr /> <p>A lot of things can be said about Mew. First, you just can't know what it will do. With 100 on every stat and a great movepool, Mew is unpredictable. And in ADV, a wrong move could turn the tables, so Mew is a very useful Pokemon. Second, a physical Mew can counter Skarmory, a special Mew can beat Blissey easily. And 100 on every stat makes it able to use mixed sets effectively, making it harder to counter. It doesn't die with 100 on defenses, HP, and Soft-Boiled. It often can't be phazed, and even the best walls can't block it. Of course, there's Mewtwo, which is way better than Mew in almost every way. If you're using Mew, be sure to take advantage of its unique movepool, because unless you're using one of those moves, Mewtwo can do just about anything Mew can do, but better. Mew can bluff Explosion sometimes, though, so a Calm Minder can work.</p> ",
    "comments": "<h1>Other Options</h1> <p>Mew's got the biggest movepool in the game besides Smeargle, so abuse it. Psychic is good only if it's your only attack, otherwise it's horrible. Too much stuff resists Psychic for it to be useful if you have room for two moves. Fake Out is OK for Pokemon that Substitute down to a berry, and can surprise Pokemon with Endure, as well as being very useful in 2v2. Torment is always cool to annoy Choice Banders and Pokemon that carry one attack to help stall them out. Roar can surprise Calm Minders.</p> <h1>EVs</h1> <p>If you're going to use Substitute, you'll want Max HP because of 101 HP Substitutes. Otherwise give the stat you are using (Attack for Physical Mews, Special Attack for special Mews, etc.) a ton of EVs, and generally shoot for 320 Speed to beat Latias and Latios, or 280 Speed to beat Adamant Groudon and Modest Kyogre.</p> <h1>Checks and Counters</h1> <p>Depends on the Mew set. Try to learn the set your opponent is using. Just directly attack it, because many Mew pack Taunt, but you can try to catch it off guard as well. Stuff that is faster than it and can hit hard do a decent job at countering Mew. Mew's biggest danger is its unpredictability. Once you know its set, its power greatly decreases.</p> ",
    "sets": [
      {"name": "Calm Mind + BoltBeam", "description": "<p>Calm Minding Mew. You might want to throw in Substitute somewhere, Mew has 404 HP as well, allowing it to make 101 HP Substitutes. This makes its Substitutes take two hits from Seismic Toss and Night Shade, often the only real damaging moves on Blissey and Deoxys-D. Mewtwo does this better.</p> "},
      {"name": "Taunt", "description": "<p>Taunt Mew. Mostly inferior to Mewtwo at this, especially since Mewtwo has the threat of Self-Destruct now, Mew can't even scare some things away like it could. If you're using this set, consider using Mewtwo instead. Only use Psychic if it's your only attack, Ice Beam can be paired with Thunderbolt or with Soft-Boiled. Psychic is good to hit everything decently, and is primarily for having a recovery move and for hitting Kyogre. Ice Beam hits all physical attackers in uber harder (Groudon, Metagross, Tyranitar, Rayquaza) as you boost Special Defense with Calm Mind to save yourself from that threat. Soft-Boiled is recommended over Boltbeam, but both work.</p> "},
      {"name": "Support", "description": "<p>A more defensive Mew, if your team needs Toxic support. You'll have problems with Blissey, so Snatch might be useful, but better switch out because of Toxic--or even let it Toxic you, Synchronize activates, then Snatch its Aromatherapy to heal yourself if you trust your prediction. It can be really hard to pull off, but with Snatch, Mew beats Blissey 100%. This works really well with Spikes, because a Toxic + Snatch Mew will force a few switches. Synchronize makes this Mew better than Mewtwo at this, because it can stop enemy stall teams cold. The last attack is to do some actual damage, primarily to break Substitutes. Ice Beam for Groudon, Latias, Latios, and Rayquaza, Thunder for Kyogre and Metagross in the rain, and Flamethrower for Forretress, Groudon, and Metagross in the sun. Flamethrower works best with an ally Groudon, to give Flamethrower pseudo-STAB.</p> "},
      {"name": "Swords Dance", "description": "<p>Physical Mew, kind of good because most ubers are Special based, kind of not because of lack of STAB and Mew's mediocre stats. Those with Soft-Boiled may want a more defensive spread.</p> "},
      {"name": "SubPunch + BoltBeam", "description": "<p>Use Substitute first unless you predict what your opponent is going to switch to, then attack with the correct moves. Nothing resists Focus Punch + Thunderbolt + Ice Beam except Shedinja. Focus Punch is actually decent in ubers, as it hits Blissey, the rare Snorlax, and the even rarer Regice super effectively, and since they have to devote most of their EVs to Special Defense, that's means less physical Defense. It also hits Lanturn neutral, which shows up on a few Rain teams. Again, Mew's Substitutes are unbreakable by most Blissey and Deoxys-D, so it has more of a use than just easing up prediction.</p> "},
      {"name": "Choice Band", "description": "<p>Explosion is one of the few things Mew can do and the other ubers can't, if this means something. Unfortunately, Mewtwo stole some of Mew's thunder by learning the move Self-Destruct in XD, which is a slightly weaker Explosion. Ice Beam hits Groudon and Rayquaza harder than any of your other moves, except Explosion. Overheat for Forretress, Groudon, and Skarmory. Focus Punch hits Kyogre harder than any of your other moves, as well as possibly OHKOing Blissey that don't invest in Defense EVs, and still does a bit to Groudon (but not as much as Overheat or Ice Beam).</p> "},
      {"name": "Special Attacker", "description": "<p>Pure special Mew, inferior to the Taunting counterpart. Only Lanturn resists Thunderbolt, Flamethrower, and Ice Beam. Use Hidden Power Dark over Flamethrower if you have a Kyogre, and use Thunderbolt over Thunder if you have Groudon.</p> "},
      {"name": "Hypnosis + Calm Mind", "description": "<p>You can mess foes up with Hypnosis, buying more time to Calm Mind and blocking more hits. A bit like Lugia, except with no Pressure, worse stats, and no Whirlwind. Hypnosis is cool, though.</p> "},
      {"name": "Transform", "description": "<p>Hypnotize one Pokemon to put it out of commission, set up a Reflect or a Light Screen to give yourself the advantage, then Transform into the enemy.</p> "}
    ]
  },
  "Wobbuffet": {
    "overview": "<p>The following analysis was produced many years ago and is currently being <a href=\"https://www.smogon.com/forums/threads/adv-ubers-wobbuffet-qc-2-2-gp-0-2.3682885/\">revamped</a>. Information contained in the analysis may be misinformative with regard to the current ADV Ubers metagame.</p> <hr /> <p>Wobbuffet is banned for two reasons. The first is that the generally accepted definition of a counter is that you can switch in a Pokemon and then defeat or scare off the enemy, and Wobbuffet prevents anything from switching in. The second is that Wobbuffet vs. Wobbuffet will not end if they are holding Leftovers, because Leftovers heals more than Wobbuffet can hit with Struggle. However, it can be a powerful Pokemon to set up a Belly Drum sweeper if you Encore a non-attacking move.</p> ",
    "comments": "<h1>Other Options</h1> <p>Destiny Bond has a very limited use on Wobbuffet. Wobbuffet is too slow to Destiny Bond on anything but Snorlax, so the main purpose would be to kill Dark Pokemon that are using special attacks or Ghost Pokemon using physical attacks. Tickle could be used to try and weaken an enemy's attack, to set up an unbreakable Substitute for a Bellyzard or something. Tickle also allows Wobbuffet vs. Wobbuffet to end, and it ends in the Tickle user's favor, just not in the way you might think. Tickle has less PP than Safeguard, so the Tickle user will run out of PP first, and thus die to Counter with Struggle. This is actually a good thing, because you still get a free turn vs. a Pokemon that is guaranteed to do nothing, unless you have 1 HP and don't kill it.</p> <h1>EVs</h1> <p>252 Defense, 252 Special Defense and Careful / Impish. You get better defenses this way than by adding HP. Even though you'll do slightly less damage with Counter and Mirror Coat, it's better to survive the hit and Counter than die and not Counter, and you'll still OHKO most heavy hitters, and 2HKO most of the rest.</p> <h1>Checks and Counters</h1> <p>By definition a counter has to be able to switch in, and nothing can switch in. However, notable mentions are Toxic Dugtrio / Gardevoir / Porygon2, as they trap the enemy Wobbuffet. An even better option is Calm Mind Gardevoir. Rather than simply killing Wobbuffet, the Gardevoir user can sacrifice a Pokemon, come in, Trace Shadow Tag (thus trapping Wobbuffet), and use Calm Mind 6 times. Your last move should be Substitute. Kill Wobbuffet with Ice Punch, and tell your opponent good luck, because they'll need it to stop 6x Calm Minded Gardevoir behind a Substitute. Sharpen / Agility Porygon2 works in the same manner.</p> <h1>Team Options</h1> <p>Wish makes Wobbuffet even cheaper. Wobbuffet's effectiveness increases exponentially with Pokemon that can set up. An old strategy that pops up every once in a while is that Wobbuffet Encores a Shadow Ball or set up move, switch to Smeargle, use Substitute, Belly Drum, and pass to Rayquaza / Medicham. Wobbuffet can also work with Perish Trappers in 2v2. You get the automatic Mean Look, so all your partner has to do is Perish Song, and maybe Torment while Wobbuffet Encores, making it unable to hit you with any attack other than Struggle.</p> ",
    "sets": [
      {
        "name": "Oh, no! It's Wobbuffet! (Standard)",
        "description": "<p>Switch it in or lead with it (you want this to take as little damage as possible before it's actually in, as taking damage is needed once it's there), and then Encore. If they attacked, you kill them. If they used a stat increasing move such as Calm Mind, take the free switch to any Pokemon you like and own them with it. If they use a status move, then Safeguard first, or, for loads of fun, pair with a Choice Band Facade Swellow; Encore status, switch to Swellow, OHKO everything. If they are using Choice Band, then you don't even need to bother with Encore. Though, if your opponent might be using Wobbuffet, don't use Choice Band, except maybe on Heracross. Use Lum Berry or Focus Band if you suspect your opponent is using a Wobbuffet too, as this will allow the Struggle war to end, so you can use this to switch to a Smeargle or whatever after they kill your Wobbuffet, and they'll have a completely useless Pokemon getting in the way. Some competitive events that allow Wobbuffet ban it from holding Leftovers to prevent Wobbuffet vs. Wobbuffet from lasting forever.</p> "
      }
    ]
  },
  "Forretress": {
    "sets": [{"name": "Support", "description": "<p>Forretress has a lot of useful resistances in Ubers, including Psychic, Ice, and Dragon as well as Toxic. Hidden Power Bug 2HKOes Latias, Latios, Mewtwo, and the like and OHKOes Deoxys-A. Forretress can set up Spikes and use Rapid Spin to get rid of Spikes set up by enemy Forretress and Deoxys-D. Counter lets it take a hit from the likes of Rayquaza, Groudon, and the rare Heracross and OHKO back. It also helps against physical Tyranitar. Hidden Power is also always countered, regardless of its type, so if you encounter a Hidden Power Fire Forretress, you can take the hit, survive with the Special Defense EVs (enemy Forretress needs near max Special Attack and sunlight to OHKO this Forretress spread), and OHKO it back, leaving the way clear for your Spikes to dominate. The given EVs ensure Forretress will always survive a +1 Special Attack Deoxys-A Thunder, so you're safe from anything but the rare Fire Punch on that end.</p> "}]
  },
  "Blissey": {
    "overview": "<p>The following analysis was produced many years ago and is currently being <a href=\"https://www.smogon.com/forums/threads/blissey-ubers-qc-0-2.3686247/\">revamped</a>. Information contained in the analysis may be misinformative with regard to the current ADV Ubers metagame.</p> <hr /> ",
    "comments": "<h1>EVs</h1> <p>You'll need max Special Defense and a Calm nature for Blissey in Ubers that don't raise their Special Defense via Calm Mind or Psych Up. For those Blissey, Calm alone probably adds enough, giving room for more Special Attack. Don't make the mistake a lot of people make and give Blissey no Defense EVs in Ubers; Blissey can still take a Rayquaza's Choice Banded Extreme Speed and use Ice Beam or Toxic.</p> ",
    "sets": [
      {"name": "Special Wall", "description": "<p>A common scenario for Blissey is to be up against a Latias. Latias used Safeguard, and suddenly Blissey's efforts are rather worthless. This is no longer the case. Latias used Safeguard, in comes Blissey. Blissey uses Icy Wind twice or thrice (depending on Latias's Speed), sets up a Light Screen, and then uses Toxic as Latias fails to Safeguard in time, because it has lost 2-3 Speed levels. Then Blissey can just Soft-Boiled stall and refresh Light Screen when necessary. This set also beats Taunt Mewtwo nicely.</p> "},
      {"name": "Psych Up", "description": "<p>Psych Up Blissey does a good job of countering most Calm Mind users (Kyogre in particular), and Wish helps teams a lot in general. Sometimes it just falls short of beating Recovering Ubers (especially Lugia), though, and it can have trouble with Pressure as well; therefore, you can use Serene Grace and hope for a lucky freeze or paralysis. Beware of Taunt. If you run into a Taunt Mewtwo, just keep using Thunder until it's paralyzed (Serene Grace helps here boosting it to a 60% chance of paralysis), and then you can use Psych Up.</p> "}
    ]
  },
  "Lugia": {
    "overview": "<p>Lugia is a very versatile Pokemon in the ADV Ubers metagame, able to act as an offensive or defensive threat. Its great natural bulk, Pressure, and many good utility moves let it work incredibly well as a catch-all physical wall. Defensively, it fits best on stall teams to shut down many threatening physical wallbreakers such as Groudon and Rayquaza. Lugia also has strong attacks in Aeroblast and Earthquake, allowing it to act as a good wallbreaker with Choice Band and its workable Attack stat. However, Lugia's typing leaves it susceptible to many prevalent offensive types in the metagame such as Electric, Ice, and Ghost from strong attackers like Latios, Deoxys-A, and Kyogre. The defensive set's reliance on Whirlwind to make progress can also be a double-edged sword; it stops setup sweepers before the endgame but exposes Lugia to Substitute sweepers and Immunity Snorlax if they are the last Pokemon remaining.</p> ",
    "comments": "<h1>Other Options</h1> <p>Ice Beam can be used on either set to threaten Pokemon like Rayquaza and physically defensive Groudon, but its lack of power overall makes it somewhat situational. Recover can heal the Choice Band set on the switches it forces, but it's not a favorable move to be locked into. Toxic can similarly be used in the last moveslot, but it is a risky move to click early, as Steel-types are the traditional Lugia answer.</p> <h1>Checks and Counters</h1> <p><strong>Steel-types: Pokemon such as Forretress, Skarmory, Metagross, and Steelix are immune to everything defensive Lugia does aside from phazing them, and the former two can use it to set up Spikes. Many Steel-types also resist Choice Band Lugia's Aeroblast, but Earthquake can still threaten Metagross and Steelix. Skarmory completely walls Lugia and can threaten to use Toxic while also setting up Spikes.</p> <p><strong>Latios and Latias: Equipped with Refresh, Latios and Latias are completely unbothered by defensive Lugia and threaten it out with powerful Thunders or Ice Beams. Both Pokemon can also survive even a Choice Band Shadow Ball from Lugia without any defensive investment.</p> <p><strong>Aerodactyl</strong>: Aerodactyl outspeeds Lugia and does massive damage with its strong STAB Rock Slide that can flinch Lugia down. Its Rock typing also lets it pivot into Choice Band Lugia and offensively pressure it.</p> <p><strong>Special Wallbreakers</strong>: Strong Thunders from Deoxys-A, Mewtwo, and Kyogre can heavily chip Lugia and threaten paralysis, breaking through its massive bulk quite easily.</p> <p><strong>Status: Blissey, Skarmory, Ho-Oh, and opposing Lugia all commonly carry Toxic, which heavily limits Lugia's long-term defensive capabilities. Thunder Wave from Pokemon like Kyogre and Groudon does the same, letting Lugia get beat out by Rock Slide Groudon and Roar Kyogre, as well as others like Heracross.</p> <p><strong>Ho-Oh: Defensive Ho-Oh can tank even Choice Band Aeroblast and use Pressure to stall Lugia out of moves to threaten it. Ho-Oh also carries Toxic and Sacred Fire commonly, threatening Lugia with a very debilitating status.</p> <p><strong>Taunt</strong>: Fast Taunt users such as Deoxys-S, Gengar, and Mewtwo completely shut down defensive Lugia; however, they don't bother Choice Band sets.</p> ",
    "sets": [
      {
        "name": "Physically Defensive",
        "description": "<h1>Set Description</h1> <p>Reflect and Whirlwind let Lugia be an effective stop to physical wallbreakers like Groudon, Heracross, and Rayquaza, using Reflect on their attacking moves to take more hits and phazing setup variants that boost too high for even Reflect to handle. Toxic is the main way Lugia makes progress, alongside Whirlwind. Poisoning foes like Ho-Oh severely reduces their longevity, and residual damage from Whirlwind with Spikes makes up for Lugia running no attacking moves. 96 Speed EVs allow Lugia to outrun maximum Speed base 90s with a neutral nature such as Groudon and Kyogre, as well as important slower foes such as Adamant Heracross. Lugia can also afford to run less Speed in favor of a tankier set, with only 16 Speed EVs being needed to outrun and set up Reflect against a -1 Speed Snorlax if Lugia gets paralyzed.</p> <h1>Team Options</h1> <p>Lugia fits best on very bulky team structures that utilize its slow pace and walling abilities while defensively covering for its shortcomings. It has multiple exploitable weaknesses to common attacking types like Ghost, Electric, and Ice while also lacking any Special Defense investment. Blissey is a strong switch-in to special attackers like Kyogre, Latios, and Latias, can absorb status from Pokemon like defensive Ho-Oh, and can even provide Lugia with incredible Aromatherapy support. Blissey's Light Screen also lets Lugia take essentially any hit and respond with Toxic or Whirlwind, something important in the Calm Mind Kyogre matchup. Forretress is practically mandatory so Whirlwind can force progress with Spikes. It also provides a Ghost resistance to help against Pokemon like Choice Band Deoxys-A, which can overwhelm even Lugia. Deoxys-D is a good switch-in to most other strong special attacking Psychic-types like Latios and Latias, Mewtwo, and Petaya Berry Deoxys-A, which Lugia cannot handle itself. It also provides the crucial Spikes support Lugia wants and is another Pressure user, allowing for easier PP stalling against opposing defensive teams. Snorlax is one of the better pivots into Latios, Latias, and Mewtwo and has Immunity to cover for Lugia's terrible weakness to Toxic, making it a strong partner as well.</p> "
      },
      {
        "name": "Choice Band",
        "description": "<h1>Set Description</h1> <p>Choice Band Lugia is a strong and fast wallbreaker, using its good natural bulk to come onto the field multiple times per game. Aeroblast is a strong STAB move and is used most, breaking past most Pokemon that don't resist it. Shadow Ball is used to hit bulky Latias the hardest as well as dent opposing Lugia and Dusclops, which can Pressure stall Aeroblast. Earthquake is needed to threaten Metagross, and it also covers more niche Pokemon like Tyranitar and Steelix. Whirlwind can be a last-ditch effort against setup sweepers, using Lugia's massive natural bulk to stomach a hit and remove a threat like boosted Groudon in a pinch. The Speed EVs and a Jolly nature are needed to outspeed Modest Latias and Latios, and Lugia needs maximum Attack investment for power.</p> <h1>Team Options</h1> <p>Magneton is an excellent partner for Lugia, removing Steel-types like Forretress and Skarmory to let it more easily spam Aeroblast. Latios and Latias provide Lugia with a lot of support by switching into Kyogre, which can threaten Lugia with Thunder, as well as being offensive but sturdier Groudon checks in combination with Lugia soft checking it. Deoxys-A appreciates Lugia's ability to bait in and chip Steel-types like Forretress and Metagross, which can take a few hits from Deoxys-A, and Lugia benefits from Deoxys-A baiting in Skarmory, which Lugia can't break with any attack. Fire-type coverage on Pokemon like Snorlax and Metagross in sun is also good for baiting in and weakening Steel-types like Forretress and opposing Metagross.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 306959, "username": "SuperEpicAmpharos"}, {"user_id": 127823, "username": "Inspirited"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}, {"user_id": 33374, "username": "Muk"}]}], "writtenBy": [{"user_id": 511624, "username": "Fc"}]}
  },
  "Ho-Oh": {
    "overview": "<p>Ho-Oh is a seriously underrated Uber. 50% burn is nothing to play with. It is an extreme staller, as well, with Recover, 106 base HP, and 154 base Special Defense. The trick to Ho-Oh is to try and burn any physical attackers you can, and then use your massive Special Defense to keep you alive on that front. Unlike Lugia, who, with a Calm Mind set, likes some Defense EVs and tries to boost up in the face of physical attackers, Ho-Oh has the ability to severely cripple them. However, its mediocre Speed (tied with Kyogre, Groudon, and Deoxys-D as the slowest Uber) is what holds it back. It has trouble with the physical attackers, because they're likely faster and carry Rock Slide, and its weaknesses to Thunder, Thunderbolt, and Surf hurts its ability to wall special hits. Ho-Oh should always be used with Groudon. Kyogre is one of the most common Pokemon in Ubers, and you don't want Drizzle blocking your Sacred Fire. With Groudon, you can overwrite Drizzle with Drought to boost your Sacred Fire instead of weaken it. This also makes enemy Surfs be at half power, and Thunder gets 50% accuracy.</p> ",
    "comments": "<h1>Other Options</h1> <p>Whirlwind can make life hell for a lot of Pokemon, as it can Calm Mind and Whirlwind your Calm Mind's away. With Special Defense, you can even survive a hit or two from Kyogre. Safeguard + Recover owns Blissey. Reflect can help Ho-Oh take physical attacks better. Substitute is also of mention, since Ho-Oh can make 101 HP Substitutes for Deoxys-D and Blissey. Solar Beam has no charge up turns in the sun, but between Sacred Fire and Thunder(bolt), along with the threat of Kyogre or Rayquaza switching in and removing your sunlight, when are you going to use it?</p> <h1>EVs</h1> <p>Max Special Attack for the first set, max Attack for the Choice Band set.</p> <p>For a fast sweeper, you'll want to make it 306 Speed (252 EVs with a +Speed nature). This ties at worst with Groudon, who is very important to outrun. This also often makes it faster than Rayquaza, who also usually has Rock Slide. If you can go before either of them, you can OHKO Groudon, or burn Rayquaza, thus keeping you safe from their Rock Slides.</p> <p>Tankish versions need more Special Defense and HP, which isn't as bad as it sounds. Ho-Oh is tied for Speed with Deoxys-D, Groudon and Kyogre, making it the slowest uber. It's never going to outspeed Deoxys-A, Mewtwo, almost any Latios or Latias, and will rarely beat Lugia, no matter how much Speed it has. It's faster than Metagross, too, since Metagross usually just pumps HP and Defense in place of Speed. Since Deoxys-D never has more than 24 or so Speed EVs for Tyranitar (and even that's considered fast), Speed EVs are really just to beat out enemy Ho-Oh, Groudon, Kyogre, and Rayquaza. Rayquaza has a higher base Speed, and will sometimes go Jolly to give those Latias and Latios that only run 307 Speed a scare with Choice Band Hidden Power Bug / Hidden Power Ghost, and you can only tie with Kyogre and Groudon. For this reason, Speed EVs aren't essential. Instead, you could run a 252 HP, 252 Attack, 4 Special Defense spread, as outlined in the Choice Band set, to be able to take more hits from the Pokemon that are faster than you anyway, and just try burning physical attackers on the switch. Of course, if you have Substitute, you need at least 204 HP EVs for 404 HP, allowing 101 HP Substitutes, which are unbreakable by Night Shade and Seismic Toss.</p> <h1>Checks and Counters</h1> <p>Kyogre can come on Sacred Fire most any time, as burning isn't nearly as bad as any other status to it, and absolutely loves Solar Beam, because it makes Solar Beam charge. Latias and Latios resist Fire and Electric, and usually have an Electric move, themselves. Tyranitar resists Sacred Fire, and gets STAB Rock, but doesn't like to be burned. Rayquaza Air Locks Sunny Day and also resists Fire, but unless it's a pure special version, it has to beware of the burn, too. Blissey and Deoxys-D can Paralyze / Toxic non-Safeguarders or Substituters. All of these should watch out for the Choice Band version, especially low defense Blissey, except for Rayquaza, unless Ho-Oh has Hidden Power Rock, in which case even Rayquaza isn't safe.</p> ",
    "sets": [
      {"name": "Special Attacker", "description": "<p>Use in conjunction with Groudon for boosting Sacred Fire. Calm Mind up, burn everything in sight. Sacred Fire is what makes Ho-Oh so deadly; nothing can switch into this bird without fear of being burned. Thunder is nice to hit Kyogre, the most common switch into Ho-Oh, but Thunderbolt helps against enemy Ho-Oh, and does a bit more to Rayquaza (try and Burn it first, then you can survive even a Choice Band Rock Slide if you have a lot of HP EVs).</p> "},
      {"name": "Choice Band", "description": "<p>Ho-Oh's MASSIVE Attack, myriad physical moves, and Sacred Fire make it a decent Choice Bander. Hidden Power Flying is a safe move to use as it hits almost everything in the uber metagame with at least neutral damage except for Metagross and the rare Skarmory, both of which rarely switch in for fear of Sacred Fire. However, Shadow Ball hits more things super effective, and Earthquake has roughly the same power (5 less, with STAB) as Hidden Power Flying, so it would primarily be for when you can't decide between trying to hit Rayquaza or Kyogre, or something. Hidden Power Rock, however, allows you to OHKO enemy Ho-Oh, and possibly OHKO Rayquaza. Hidden Power Rock has more uses that aren't covered by your other moves better, but Hidden Power Flying is safer if you are having trouble predicting.</p> "}
    ]
  },
  "Shiftry": {"sets": [{"name": "Choice Band", "description": "<p>The EVs given are for if you do not have Hidden Power. If you do, you'll need 4 more Speed EVs at the cost of HP to make sure Shiftry is faster than +Speed Deoxys-A in the sun. Choice Band is helpful because Shiftry can only come in on a very limited number of Pokemon and needs to 2HKO the switch-in to survive.</p> "}, {"name": "Swords Dance", "description": "<p>If you feel you can set up with Shiftry, it learns Swords Dance, which is really helpful.</p> "}]},
  "Shedinja": {
    "overview": "<p>Shedinja is good only in the Uber environment. In the standard metagame 100% counters such as Tyranitar's Sand Stream and Spikes are used. In the Uber metagame, many things such as Kyogre and Latios lack the moves to hurt Shedinja, allowing it to deal lots of damage. However, with the fairly recent commonness of Spikes and Toxic on everything, even then Shedinja is risky. If you don't carry Rapid Spin and the ability to change the weather (either Rain Dance or Sunny Day... or Drizzle and Drought), don't use Shedinja. Shedinja is generally too risky to be your only counter to something, because of how easily things can stop it.</p> ",
    "comments": "<h1>Other Options</h1> <p>Confuse Ray and Toxic, mainly. These can be very annoying and can help wear down whatever your opponent switches in to counter Shedinja with.</p> <h1>EVs</h1> <p>Adamant with 252 in Attack and Speed. You won't need anything else.</p> <h1>Checks and Counters</h1> <p>Spikes, Sandstorm / Sand Stream and Toxic / Leech Seed are sure fire counters. Other than that, Fire, Rock, Flying, Ghost and Dark moves will kill Shedinja in one hit regardless of the move's Base Power. Pursuit on something bulky like Metagross is the best attack counter.</p> ",
    "sets": [
      {"name": "Protect", "description": "<p>Basically slug away with Shadow Ball and Hidden Power Bug, or Swords Dance if the opponent is foolish and tries to stat up himself. Protect is for checking movesets since unpredictable movesets will end Shedinja in one move, so something odd carrying Toxic will spell the end of your days. Spikes, Sandstorm and what not will also end Shedinja, so it's pretty risky to use. If you are afraid of going for the stat-upping variant, you can just pick Silver Wind and Hidden Power Rock, seeing as in Uber (where this is most commonly seen), it can hurt a lot of Pokemon. By all means watch out for Metagross.</p> "},
      {
        "name": "Choice Band",
        "description": "<p>This is the Choice Banding variant. It's a lot riskier than the Protect Shedinja, but you can hurt a lot more stuff with this moveset. It's up to you. If you want to take a big risk, you can net a big reward. Or you can also lose this baby much easier. Choice Band is a good choice for Shedinja because you have to play it like one, anyway. Just bring it in on stuff that can't hurt it, and hit their switch hard. You'll invariably switch out next turn, really, as if they switch, they switch to something that can damage Shedinja. Hidden Power Ground is for Metagross, Hidden Power Fighting is for Tyranitar. As Metagross is more common in ubers, that is a real option, but in standard, Tyranitar is the most common, and most obvious switch when they know you have Shedinja. Although Shedinja will die next turn, Hidden Power Fighting will do massive damage, if not deal a KO, so it's a kind of kamikaze move. Toxic is also used mostly for uber matches, so Shedinja can actually do something to guys like Groudon and Rayquaza. Aerial Ace is for fighters, meaning purely Heracross, really, so Sleep Talk is a good option, considering how few sleepers have a move that hits Shedinja.</p> "
      }
    ]
  },
  "Latias": {
    "overview": "<p>The following analysis was produced many years ago and is currently being <a href=\"https://www.smogon.com/forums/threads/latias-ubers-qc-1-2.3682138/\">revamped</a>. Information contained in the analysis may be misinformative with regard to the current ADV Ubers metagame.</p> <hr /> <p>Latias is deadly with Soul Dew and awesome special stats right off the bat. Versatile, powerful, and unpredictable are words that describe Latias well. Latias is nice to use over Latios for that higher Special Defense stat (444 instead of 384 after Soul Dew, without EVs) in addition to more Defense (216 versus 196 without EVs).</p> ",
    "comments": "<h1>Other Options</h1> <p>Roar can let you take advantage of Spikes and phaze Calm Mind users and can work in tandem with Psych Up, which can steal Calm Minds from Kyogre and such. Latias can paralyze stuff with Thunder Wave.</p> <h1>EVs</h1> <p>307 is the minimum Speed Latias should generally run. Max Speed (without nature) is also useful, as it beats out Jolly Rayquaza. You will probably want lots of Special Attack. You'll generally want a Modest nature, but a Timid nature can also be used to get 320 Speed, just beating out Modest Latias, Modest Latios, and Jolly Rayquaza.</p> <h1>Checks and Counters</h1> <p>Blissey and Deoxys-D beat Latias without Safeguard / Substitute / Refresh. If Latias does have Safeguard, however, Blissey can set up a Light Screen and switch out to something that can now take those hits a bit better. Blissey and, to a lesser extent, Deoxys-D can also beat Latias with Psych Up / Calm Mind and Ice Beam, depending on who gets a critical hit first (but remember, the Ice Beam users also have the 20% / 10% freeze chance on their side). Alternately, Blissey with Icy Wind will also beat Safeguard Latias. Lanturn with Toxic beats Thunder / Ice Beam Latias, but loses easily to Safeguard / Dragon Claw. Snorlax can somewhat counter it (particularly Choice Band Snorlax), but has difficulties switching into those powerful special attacks. Shedinja stops Latias without Hidden Power Fire / Dark, and if your opponent wants an all-out sweeper set, they are much more likely to choose Latios for that, and thus will be less likely to have Hidden Power Fire / Hidden Power Dark on Latias. The problem with relying on Shedinja is that Spikes also spell its end. Metagross can take a few Dragon Claws and OHKO with Choice Banded Meteor Mash / Shadow Ball (provided Latias doesn't have max HP), but is 2HKOed by Thunder. Tyranitar can stack Special Defense to take a hit and set up, provided Latias hasn't gotten in a bunch of Calm Minds. Sand Stream also hurts Latias, who lacks Leftovers thanks to Soul Dew. Deoxys-A can come in on Recover, Calm Mind, or any other non-attacking move but Thunder Wave, and OHKO with Shadow Ball, but it needs a Choice Band to do it 100% of the time.</p> ",
    "sets": [
      {"name": "Standard", "description": "<p>Dragon Claw has no immunities, and with Safeguard + Recover + Calm Mind, nothing can really hurt Latias that much. This set stomps Blissey into small pieces. I wish I could suggest it on a lot of other Pokemon, but they only get STAB on a move like Psychic, which there are Pokemon immune to. Watch out for Metagross--that should be your only real worry. This set isn't seen nearly as much as some others, but with all the Toxic going around currently, it could make a comeback, especially since Metagross is less common due to the rise of Skarmory and Kyogre. Refresh lets Latias actually switch into those statuses, and it beats Icy Wind Blissey, but it doesn't block freeze and sleep and cannot be passed. It also works just that turn instead of lasting five.</p> "},
      {"name": "Calm Mind Sweeper", "description": "<p>The sweeper set for Latias has the ability to severely damage most of the Uber metagame and can wall most hits with Soul Dew. Ice Beam will usually OHKO Groudon and always OHKO Rayquaza, and the Electric moves are for Ho-Oh and Kyogre respectively.</p> "},
      {"name": "Support", "description": "<p>Latias is resistant to Water, Psychic, Electric, Fire and Grass, making it an ideal special sponge. It's also one of the better Substitute Kyogre counters in the game. It's faster than Kyogre thanks to its high Speed, can break its Substitute with Dragon Claw, and can Toxic it before it can set up another. Ice Beam is barely a 3HKO from most Kyogre (without a Light Screen up), so with Light Screen / lots of recovery, Kyogre will die to Toxic before Latias falls.</p> "}
    ]
  },
  "Latios": {
    "overview": "<p>The following analysis was produced many years ago and is currently being <a href=\"https://www.smogon.com/forums/threads/latios-ubers-gp-0-2.3682124/\">revamped</a>. Information contained in the analysis may be misinformative with regard to the current ADV Ubers metagame.</p> <hr /> <p>Latios is deadly with Soul Dew and awesome special stats from the bat. Versatile, powerful, and unpredictable are words that describe Latios well. Latios is nice to use over Latias for that slightly higher Special Attack stat (591 instead of 525 after Soul Dew).</p> ",
    "comments": "<h1>Other Options</h1> <p>Reflect and Light Screen are cool to pseudo-pass, but you won't find much room on poor Latios, and Latias is better suited to the support role. If you are going to pass anything, pass Light Screen. Roar is a nice option for pseudo-hazing and Spikes abuse on any set, really, but, once again, this is more suited to Latias's greater defensive abilities. Latios can use Substitute to block Knock Off and destroy most Deoxys-D and Blissey.</p> <h1>EVs</h1> <p>307 minimum Speed for Latios. Absolute max Speed is also useful, as it beats out Jolly Rayquaza. You will want lots of Special Attack.</p> <h1>Checks and Counters</h1> <p>Blissey and Deoxys-D beat Latios without Safeguard / Substitute / Refresh. If Latios does have Safeguard, however, Blissey can set up a Light Screen and switch out to something that can now take those hits a bit better. Blissey, and, to a lesser extent, Deoxys-D can also beat Latios with Psych Up / Calm Mind and Ice Beam, depending on who gets a Critical Hit first (but remember, the Ice Beamers also have the 20% / 10% Freeze chance on their side). Alternately, Blissey with Icy Wind will also beat Safeguard Latios. Lanturn with Toxic beats Thunder / Ice Beam Latios, but loses easily to Safeguard / Dragon Claw. Snorlax can somewhat counter it (particularly Choice Band Snorlax), but has difficulties switching into those powerful special attacks, so it works much better as a Latias counter, and even then, it's not particularly good. Shedinja stops Latios without Hidden Power Fire / Dark, but if your opponent wants an all-out sweeper set, they are much more likely to choose Latios for that, and thus will be more likely to have Hidden Power Fire / Hidden Power Dark. The problem with relying on Shedinja is that Spikes also spell an end for the cicada. Metagross can take a few Dragon Claws and OHKO with Choice Banded Meteor Mash / Shadow Ball, but is 2HKOed by Thunder. Tyranitar can stack Special Defense to take a hit and set up, provided Latios hasn't gotten in a bunch of Calm Minds. Sand Stream also hurts Latios, who lacks Leftovers thanks to Soul Dew. Deoxys-A can come in on Recover, Calm Mind, or any other non-attacking move but Thunder Wave, and OHKO with Shadow Ball, but it needs a Choice Band or Shadow Tag to do it 100% of the time, unless you have a ton of Defense EVs.</p> ",
    "sets": [
      {"name": "Standard", "description": "<p>Dragon Claw has no immunities, and with Safeguard + Recover + Calm Mind nothing can really hurt Latios that much. Stomps Blissey into small pieces. I wish I could suggest this set on a lot of other Pokemon, but they only get STAB on a move like Psychic which there are Pokemon immune to. Watch out for Metagross--that should be your only real worry. This set isn't seen nearly as much as the next, but with all the Toxic going around currently, this set could make a comeback, especially since Metagross is less common due to the rise of Skarmory and Kyogre. Refresh lets Latios actually switch into those statuses, and it beats Icy Wind Blissey, but it doesn't block Freeze and Sleep, and cannot be passed. It also works just that turn instead of lasting 5.</p> "},
      {"name": "Calm Mind Sweeper", "description": "<p>The sweeper set for Latios. Has the ability to severely damage most of the uber metagame and can wall most hits with Soul Dew. Ice Beam will usually OHKO Groudon and always KO Rayquaza, and the Electric moves are for Ho-Oh and Kyogre respectively. Dragon Claw is still useful here to hit enemy Latias and Latios harder, but Ice Beam general provides more coverage.</p> "},
      {"name": "Dragon Dance", "description": "<p>Obligatory mention of an anti-uber set. Dragon Danced Shadow Ball can mess up Mewtwo and other Latios or Latias pretty well, while Earthquake sends Metagross and Tyranitar back to the drawing board. While it is great as a surprise, the lack of STAB really hurts in the end and Groudon will kick your butt. Soul Dew is there for the Special Defense bonus, which helps for taking Ice Beams, however you cannot be blamed for going with Leftovers or Lum Berry. Ice Beam is another option over Earthquake or Recover, to hit Groudon and Rayquaza, who otherwise laugh at this Latios. Roar is a nice option on this to pseudo-haze Calm Minders and abuse Spikes and such.</p> "},
      {"name": "All-Out Attacker", "description": "<p>When your opponent expects a less versatile Latios, this will own him. Kyogre eats a Thunder, and you can OHKO Rayquaza and most Groudon with Ice Beam. Hidden Power Fire for a nasty hit on Metagross and Shedinja, or Hidden Power Dark to still hit Shedinja, but hit other Psychics a bit harder, too. Solar Beam is useful to OHKO those annoying Groudon that are EVed to survive Latios Ice Beam. If you use Solar Beam, use Dragon Claw to hit enemy Latias and Latios harder than Ice Beam ever could.</p> "}
    ]
  },
  "Kyogre": {
    "overview": "<p>Kyogre is a bastard and incredibly hard to take down. That massive Special Attack stat gives its STAB and rain-boosted Water-type moves a real kick.</p> ",
    "comments": "<h1>Other Options</h1> <p>Hidden Power Dark and Ancient Power are both for killing Shedinja. Safeguard is decent, but not really that great of an option for a sweeper like Kyogre. With Endure, it can take a Swords Danced Groudon Earthquake and then use the extra Speed from a Salac Berry to sweep the team with a Calm Minded, Rain Danced Surf.</p> <h1>EVs</h1> <p>Substitute versions need max HP. Otherwise, concentrate on Special Attack. If you really feel like it, with max HP and around 280 Defense, Kyogre can take a Swords Danced Groudon Earthquake. There are two main ways to do the Speed. If Kyogre is your lead, you'll most likely want to make it as slow as possible, perhaps even giving it a -Speed nature and 0 IVs. This is so that when you are up against starter Groudon, your weather can go after theirs, thus claiming priority, forcing a switch. Non-boosted Groudon will not OHKO Kyogre, while Kyogre OHKOes Groudon in the rain with any Water move. As Kyogre is already tied for slowest Uber (and all Pokemon used in Ubers slower than Kyogre are slower, regardless of EVs, for example, Blissey), Speed won't really change much. However, since a lot of people think this way, it's very easy to beat out enemy Kyogre, Groudon, a lot of Lugia, Adamant Rayquaza, and even some Latias and Latios.</p> <h1>Checks and Counters</h1> <p>Blissey with max Special Defense (unless it has Substitute or Rest), or Calm Mind / Psych Up + Thunder, Hidden Power Grass Ludicolo, Quagsire (especially for sets with only Thunder and Surf), Shedinja (beware of Spikes), Latias, Celebi (if it doesn't have Ice Beam), Lanturn with Toxic or Mimic.</p> <h1>Controlling the Weather</h1> <p><em>Leads</p> <p>In a match-up of Kyogre vs. Groudon, if both Pokemon are the first each battler sends out, the slower Pokemon will always control the weather. This is because the faster Pokemon's weather activates first, but is promptly overwritten by the slower Pokemon's.</p> <p><em>Switches</em></p> <p>If Kyogre switches into Groudon, or vice versa, the weather will change.</p> <p>If Kyogre and Groudon switch into each other at the same time, then the person who makes the decision last switches in their Pokemon last, thus dominating the skies. In matches where a person has a limited amount of time to move, this can cause the players to try and play chicken, waiting until the clock is as close to running out as they dare before punching in the move, and praying the connection doesn't lag.</p> <p><em>Rayquaza / Golduck</em></p> <p>If Rayquaza or Cloud Nine Golduck is out, it will report that the weather is still going strong. However, there will be no effect. Solar Beam takes 2 turns, Thunder has 70% accuracy, and no moves are boosted / weakened. If Kyogre or Groudon switch into Rayquaza, Air Lock will still be in play. Once Rayquaza leaves the field, the weather returns to normal.</p> ",
    "sets": [
      {
        "name": "Substitute + Calm Mind",
        "description": "<p>Substituting Kyogre. Thunder is nice for other Kyogre and paralysis, Ice Beam for Groudon (in the sun), Rayquaza, Grass-types, and primarily, Latias and Latios. Calm Mind boosts Kyogre's already amazing Special Defense and makes it nearly unbeatable by Electrics. Knowing that most physical sweepers are countered by Water Pokemon, you are going to have a tad of trouble killing this thing with a few Calm Minds under its belt. 101 HP Substitutes block Blissey and Deoxys-D while you Calm Mind up. It takes 3 Calm Minds to 2HKO Blissey, but watch out for Psych Up and Calm Mind on Blissey (only if it has Thunder).</p> <p>Kyogre is one of those Pokemon that has so much power that it can make use of stuff like the berries, unlike most Pokemon. After a Salac Berry and a few Calm Minds, Kyogre can be quite annoying... It's too slow to use Petaya effectively (the slowest Pokemon in Ubers, really, except for Metagross, Blissey, and Deoxys-D).</p> "
      },
      {"name": "Calm Mind + 3 Attacks", "description": "<p>The other main set. Without Substitute, you can have more diversity in attacking.</p> "},
      {"name": "Tank", "description": "<p>Rest keeps you safe from Toxic, paralysis, and other random forms of damage as you Calm Mind up for the sweep. With these EVs, you survive a Swords Dance Groudon Earthquake, and OHKO it in the rain without a Calm Mind. Just about the only thing that can stop this is another Kyogre with Calm Mind and Thunder, or Calm Mind Latias / Latios. Most other things fail to KO it after a Calm Mind. It easily beats any enemy Kyogre without Thunder or Rest, as well.</p> "},
      {"name": "Water Spout", "description": "<p>Water Spout is the overlooked move for Kyogre, and is often seen as amateur. Rest allows Kyogre to bring Water Spout back to full power, and Sleep Talk lets you do some damage while Sleeping, so you don't waste all of Water Spout's potential on those Resting turns. This Kyogre almost requires paralysis support, as Kyogre is slow, and taking hits is one thing you don't want to do. With paralysis, however, Kyogre can get in a hit before taking one, using a 150 power STAB rain boosted Water move. Water Spout does ~52% to Latios, letting Ice Beam finish it off. It can OHKO Groudon in the sun, and does 44% or so to most Uber Blissey, meaning that with a few layers of Spikes down or if they lack Special Defense, you 2HKO.</p> "},
      {
        "name": "Choice Band",
        "description": "<p>This set is surprisingly effective, unlike its counterpart, the special Groudon. The three most common counters to Kyogre are Blissey, Latias, and Latios. Hidden Power Ghost 2HKOs Latias and Latios, regardless of Calm Minds, and Brick Break 1-2HKOs Blissey. It's best to open with Surf or Ice Beam, usually, unless you know your opponent's team enough to predict what they'll switch to, as this set does benefit a lot from that turn or two of surprise. However, even once they know what kind of Kyogre you have, many teams have a dickens of a time countering it anyway. Unlike Groudon, Kyogre resists Ice Beam, which is far more common than Thunder, and, thanks to its superior Special Defense, takes less from Thunder than Groudon does from Ice Beam. Kyogre's typing also allows it to come in on things like Meteor Mash.</p> <p>Surf and Ice Beam are to stop certain Pokemon from walling you. Surf hits Groudon in the rain with an OHKO, while Ice Beam is stronger in the sun. Ice Beam will OHKO Rayquaza, Surf hits Skarmory and Metagross. Rock Slide can be used to hit Rayquaza if you're using Surf, as well as Ho-Oh, but Sleep Talk makes Kyogre a perfect Exeggutor counter, and eliminates another weapon from Blissey's arsenal (Sing). Earthquake can be used, as well, but it won't be hitting much, if anything, harder than your other moves, aside from the rare Lanturn.</p> "
      }
    ]
  },
  "Groudon": {
    "overview": "<p>Groudon is an excellent physical attacker with its base 150 Attack stat and STAB Earthquake. However, Ice Beam is quite possibly the most common attack in Ubers, and Groudon, being slow, has trouble switching into a lot of things. If you can take Lugia down, though, this makes a good stallbreaker. It can support Sunny Day-style teams with its ability, but Solar Beam isn't that good in Ubers, and Fire isn't particularly good, either. Still, nothing likes switching into its Earthquakes, and it can OHKO those things immune to them with a Choice Band attack for the most part.</p> ",
    "comments": "<h1>Other Options</h1> <p>Counter can be used to kill other Groudon and the common Choice Band Rayquaza, but Groudon and Rayquaza aren't really the most common switch-ins to Groudon. Groudon can use Substitute to block Knock Off and Toxic, as it cannot be broken by weaker physical attacks or Seismic Toss. Groudon can use Thunder Wave to paralyze Latias, Latios, and Lugia and then kill them with paralysis + flinch by pairing it with Rock Slide. Don't use Eruption; it's absolutely horrible.</p> <h1>EVs</h1> <p>For the Substitute versions, you will want 404 HP; it's nice for Blissey and Deoxys-D. Sweeping Groudon can have max Speed for the tie or win against Kyogre, which can help a lot. Another option is little-to-no Speed. Groudon is tied for slowest Uber in the game with Deoxys-D and Kyogre, and most Ubers like to hang out at 307 Speed, 1 above Groudon's maximum. If Groudon won't be beating them, why not just power up its Attack and defenses? You could run a very small amount of Speed to beat other Groudon and Kyogre that also have low Speed. For lead Groudon, you might want to be slower than lead Kyogre, so that your weather overwrites its, possibly even using Brave and lowering Speed IVs to 2 (with Hidden Power Bug) or 3 (With Hidden Power Ghost). Regardless of what you do, you will want a lot of Attack EVs unless you are running a stall set.</p> <h1>Checks and Counters</h1> <p>Latias and Latios are immune to Earthquake, resist Fire, survive everything Groudon can throw at them save Choice Band Hidden Power Bug or Ghost, and can OHKO with Ice Beam (but Groudon with Special Defense EVs survives and can go for the 2HKO). Flygon works, but is very specific and won't do much to almost anything else, and it still needs Solar Beam to do anything to Groudon. Lugia can take hits all day with a Reflect up and can just Toxic stall Groudon to death, or it can alternate between Calm Mind and Recover before killing with Ice Beam. Exeggutor survives everything but Hidden Power Bug, Fire Blast, and Overheat, and OHKOes Groudon with Solar Beam (watch out for a Rayquaza switch-in to defend against this). Kyogre somewhat... you won't want to switch Kyogre into a Groudon Earthquake. If Groudon is faster and has a Swords Dance on the switch, Kyogre will get OHKOed, unless Kyogre has 404 HP (252 EVs) and 276 Defense (240 EVs).</p> <h1>Controlling the Weather</h1> <p><em>Leads</p> <p>In a match-up of Kyogre vs. Groudon, if both Pokemon are the first each battler sends out, the slower Pokemon will always control the weather. This is because the faster Pokemon's weather activates first, but is promptly overwritten by the slower Pokemon's.</p> <p><em>Switches</em></p> <p>If Kyogre switches into Groudon or vice versa, the weather will change.</p> <p>If Kyogre and Groudon switch in at the same time, then the person who makes the decision last switches in their Pokemon last, thus dominating the skies. In matches where a person has a limited amount of time to move, this can cause the players to try and play chicken, waiting until the clock is as close to running out as they dare before punching in the move and praying the connection doesn't lag.</p> <p><em>Rayquaza / Golduck</em></p> <p>If Rayquaza or Cloud Nine Golduck is out, the game will report that the weather is still going strong. However, there will be no effect. Solar Beam takes two turns, Thunder has 70% accuracy, and no moves are boosted or weakened. If Kyogre or Groudon switch into Rayquaza, Air Lock will still be in play. Once Rayquaza leaves the field, the weather returns to normal.</p> ",
    "sets": [
      {
        "name": "Swords Dance",
        "description": "<p>Overheat is used to kill Skarmory and Forretress and can also be used to kill Exeggutor. It's used over Flamethrower and Fire Blast because Flamethrower fails to OHKO all but Forretress if Groudon doesn't have Special Attack EVs and Fire Blast has less accuracy. Fire Blast can be used to avoid the Special Attack drop, but you almost never need it for multiple Pokemon on the enemy's team. Use Hidden Power Ghost with Overheat and Hidden Power Bug with Rock Slide generally, although you can use Overheat with Rock Slide if you want. Hidden Power Ghost fails to OHKO Exeggutor on the switch in, though, so beware of that. Other than that, however, Hidden Power Ghost and Hidden Power Bug both hit Latias and Latios equally hard. Hidden Power Ghost also hits Lugia, so Rock Slide isn't as useful. Rock Slide hits Rayquaza, Lugia, and Ho-Oh. For a single physical supplementary attack, however, Hidden Power Ghost is usually used over Rock Slide and Hidden Power Bug because it hits Latias, Latios, and Lugia. Ho-Oh is much less common than Latias, Latios, and Lugia, three of the most common Ubers, so you get better coverage with Overheat than with Rock Slide.</p> "
      },
      {"name": "Choice Band", "description": "<p>Choice Band Groudon works really well. Hidden Power Bug and Hidden Power Ghost both hit Latias and Latios. Hidden Power Bug also OHKOes Exeggutor and Celebi however, while Hidden Power Ghost will not. Overheat really rampages through Skarmory, Forretress, and Exeggutor. This means Hidden Power Ghost eases up predicting the switch to Lugia and also does more to stuff like Rayquaza and Ho-Oh should you not predict them coming in.</p> "},
      {"name": "Substitute + Salac", "description": "<p>Groudon can come in on the likes of Blissey, set up a Substitute as the opponent switches, and then proceed to Swords Dance. Groudon can continue to Substitute until it gets the Salac Berry boost, allowing it to outspeed positive natured Deoxys-A. Earthquake gets STAB and hurts Forretress and Mewtwo after a Swords Dance or two, while Hidden Power Ghost hurts Lugia, Latias, and Latios.</p> <p>The 204 Speed EVs allow Groudon to outspeed Deoxys-A and normal Deoxys after the Salac Berry boost, and maximum Attack is obvious on a sweeper. 44 HP EVs mean the Salac boost comes on the third Substitute, and the additional 8 EVs are relegated to Special Defense.</p> "},
      {"name": "RestTalk", "description": "<p>Only use Roar with a few layers of Spikes down. Once you have these in place, you can send Groudon out versus something like Blissey and Roar as they go to Lugia. This will bring in anything but Lugia, which generally means something Groudon takes on fairly well. This set completely walls just about any Blissey, non-Calm Mind Lugia, and physical Deoxys-A. Toxic can be used to actually do something to Lugia, and then you can Rest off its Toxic and use Earthquake to keep Blissey from coming in and using Aromatherapy. The EVs given make Choice Band Metagross's Meteor Mash a 3HKO but still leave Groudon with some attacking power.</p> "}
    ]
  },
  "Rayquaza": {
    "overview": "<p>The following analysis was produced many years ago and is currently being <a href=\"https://www.smogon.com/forums/threads/rayquaza-ubers-wip.3682362/\">revamped</a>. Information contained in the analysis may be misinformative with regard to the current ADV Ubers metagame.</p> <hr /> <p>Rayquaza is nearly identical to Salamence. It shares the same type and similar stats--somewhat. Rayquaza has more Attack, and a hell of a lot more Special Attack for only a bit less Speed. This thing is Mr. Utility--it learns a lot of moves.</p> ",
    "comments": "<h1>Other Options</h1> <p>Rayquaza can produce 101+ HP Substitutes, so that alone should allow you to think of some ways to deal with Blissey and Deoxys-D, which both make appearances in the uber metagame rather often. Psych Up is great for snatching some Calm Minds, but just be sure that what you're taking from doesn't have Ice Beam. It's not on any regular moveset because most things DO possess Ice Beam (or Rock Slide if you're trying to grab Swords Dances from Groudon). Bulk Up can make it easier to take physical hits from Groudon, Metagross and Dragon Dance Rayquaza while setting up, and is best used with Extreme Speed.</p> <h1>EVs</h1> <p>Choice Bander set needs maximum Attack. You could go for 280 Speed, which beats Kyogre / Groudon without a +Speed nature. 308 is an option with Jolly to beat their absolute maximum. Or alternately, go for the spread listed under the Choice Band set. The Special Rayquaza needs no Attack EVs, even when using Brick Break, just go for 216 in Speed, 40 HP and the rest in Special Attack.</p> <h1>Checks and Counters</h1> <p>Special sweepers with Ice Beam. Rock Slide from Groudon can take on the less bulky Rayquaza, Latias and Latios can KO it, and survive most of its attacks, but has to be on its guard against Choice Banded or Dragon Danced Hidden Power Bug and Ghost. Skarmory completely walls Choice Banders without Overheat (and almost none have it). Lugia can set up a Reflect against it, Toxic it, and stall it out with Pressure and Recover, or just alternate Calm Mind and Recover until finally killing you with Ice Beam. Kyogre is a great counter, but Choice Banded Earthquake and Hidden Power Flying are a 2HKO, so it has to either outspeed it, or scare it into thinking it will outspeed it (won't work with Jolly Rayquaza). Alternately, a Kyogre with 252 HP EVs and 252 Defense EVs takes 49% max damage from Adamant Choice Banded Earthquake (and it also defeats Swords Dance Groudon), so it's not as bad as it sounds, as long as you pack Ice Beam.</p> ",
    "sets": [
      {
        "name": "Choice Band",
        "description": "<p>What you may have noticed right away is that this has Hidden Power Bug / Ghost over Hidden Power Flying. This is because nothing takes more in Ubers from Hidden Power Flying than it does from Hidden Power Bug/Earthquake (well, after STAB, Hidden Power Flying is 105, Earthquake is only 100, but they're practically the same), but Hidden Power Bug and Ghost are super effective against a whole lot of the Psychic-based uber metagame. Choice Banded Hidden Power Bug hurts. Don't believe me? Here are some numbers:</p> <p>Latias and Latios are OHKOed without Defense or HP EVs (standard). In fact, Latias needs 240 HP EVs to have guaranteed survival. Latios is even worse off. If it wants to be certain of surviving a single hit, it needs not only 252 HP EVs, but an additional 72 Defense EVs.</p> <p>Another major difference between this and the old standard (252 Attack / 252 Speed, Adamant) is how much bulkier this is. The main reason is Exeggutor. Rayquaza makes a good switch-in to Exeggutor, because its ability means that it blocks sunlight, so Solar Beam takes two turns, and Chlorophyll is nullified. This means that if you switch in on a Solar Beam, you are faster and can OHKO it, while it can't do anything. This puts a powerful foe out of commission. The EVs are to let it survive max damage Modest Exeggutor Hidden Power Ice in case they guess what you're up to. This will also survive Choice Band Adamant Groudon / Rayquaza Rock Slide every time and can take 2 Choice Banded Rayquaza Extreme Speeds.</p> <p>An alternate EV spread can be used to make your Rayquaza fast. If you give it Jolly and max Speed, it is faster than all Groudon and Kyogre and also beats the few Latias and Latios remaining that just put in 307 Speed. Obviously, you'd want to max Attack as well.</p> "
      },
      {"name": "Dragon Dance", "description": "<p>This set is extremely rare in Ubers, as it can be difficult to set up Rayquaza (Ice Beam is the most common move). If you can bring it out on stuff like Choice Banded Earthquakes or Deoxys-A, you can Dragon Dance as they switch to whatever. Mewtwo falls just short of being KOed, so smack it around with an Earthquake or something the first time it comes in and then save it for later. Extreme Speed is used for Deoxys-A (allowing you to kill them without a Dragon Dance, or run a lot less Speed), in which case you'll want Hidden Power Ghost for Lugia. Rock Slide hits Lugia a bit harder, but the real benefit is to get Ho-Oh on its 4x weakness and a possible OHKO on other Rayquaza. Earthquake hits stuff like Metagross, Kyogre, and Groudon who aren't weak to your other moves.</p> "},
      {"name": "Special Attacker", "description": "<p>Look familiar? This is like Salamence's special moveset, only with the addition of Thunderbolt. Surf is redundant, since Thunderbolt will kill Ho-Oh just as well, and Ice Beam takes care of Groudon. Crunch is for Psychic-types like Mewtwo and the Deoxys, while Dragon Claw makes good STAB and a nice choice for dealing with Latios / Latias switch-ins. Fire Blast can hurt Metagross a lot, while Brick Break owns Tyranitar and Blissey.</p> <p>Unlike Salamence's special set, this set is quite cool. It will kill almost any Groudon and enemy Rayquaza, and nearly 2HKO Kyogre. Dragon Claw is needed for the 2HKO on Latias, but Ice Beam will generally do the job against Latios (they can both skew these numbers by adding Special Defense EVs or HP).</p> "}
    ]
  },
  "Jirachi": {"sets": [{"name": "Calm Mind", "description": "<p>Jirachi has some great resistances to take advantage of in Ubers, as it is immune to Toxic and resists Dragon Claw and Ice Beam. It's one of the few usable Pokemon that resists Normal and Meteor Mash as well. Thunder takes advantage of Kyogre's rain with a 100% accurate move with a 60% chance of paralysis. Ice Punch hits Latios, Latias, Rayquaza, and Groudon hard. Psychic is not needed, as it's a very bad attack type in Ubers. This set easily beats Blissey and Deoxys-D, although Knock Off is a pain. Substitute can be used to block Knock Off and critical hits as you Calm Mind up, but Wish gives Jirachi more longevity and heals your whole team. If you ever find something you can't deal with, Jirachi can just use Thunder and most likely paralyze it, or if you're feeling really lucky or desperate, it can Ice Punch and hope for the 20% freeze. Jirachi can beat Kyogre if it gets a free Calm Mind, too.</p> "}]},
  "Deoxys": {
    "overview": "<p>The following analysis was produced many years ago and is currently being <a href=\"https://www.smogon.com/forums/threads/deoxys-n-uber-qc-0-2.3686233/\">revamped</a>. Information contained in the analysis may be misinformative with regard to the current ADV Ubers metagame.</p> <hr /> <p>Deoxys-A is generally the better pick between the two offensively based Deoxys formes as its Attack and Special Attack stats are far superior to that of this Deoxys.</p> ",
    "comments": "<h1>Other Options</h1> <p>There is virtually nothing else viable. Psycho Boost can be used, but it won't really hit anything harder than Deoxys's other moves.</p> <h1>EVs</h1> <p>360 Speed minimum, generally max. Max out Special Attack for the first set, Attack for the second. Don't even bother with defenses. This is from Deoxys-A, but basically it stands correct.</p> <h1>Checks and Counters</h1> <p>Just attack away at this thing. It has better defensive stats than Deoxys-A, but just like Deoxys-A, it can be taken down easily.</p> ",
    "sets": [{"name": "Special Sweeper", "description": "<p>You'll probably want Deoxys's HP to be divisible by four, in case of Tyranitar, so you can activate your Petaya at 1/4 instead of 1 HP. Unlike Deoxys-A, Calm Mind is a lot less of an option, because Deoxys doesn't force switches as well due to its lower Attack.</p> "}, {"name": "Choice Band", "description": "<p>Choice Band Deoxys basically fails in every regard compared to Deoxys-A, but if you want to still use this Deoxys forme, it can work, but to a lesser degree.</p> "}]
  },
  "Deoxys-Attack": {
    "overview": "<p>The following analysis was produced many years ago and is currently being <a href=\"https://www.smogon.com/forums/threads/deoxys-a-ubers-gp-0-2.3682126/\">revamped</a>. Information contained in the analysis may be misinformative with regard to the current ADV Ubers metagame.</p> <hr /> <p>The absolute best cleaner in the game. Absolute best. Nothing stops Deoxys-A.</p> ",
    "comments": "<h1>Other Options</h1> <p>Pursuit is a decent option, as most people's first reaction upon seeing Deoxys-A is to switch out to something like Metagross, Groudon, or Kyogre. There isn't really much else Deoxys-A can survive to do.</p> <h1>EVs</h1> <p>For a Choice Band user, max Attack and max Speed. For the Substitute set, max Special Attack and max Speed along with Mild is probably best. On either of them, a +Speed nature is also good because it beats out Exeggutor and other Deoxys-A (only with Extreme Speed, or it's pointless to beat out the other Deoxys-A, who will likely just Extreme Speed, and if they don't have Extreme Speed, they switch out). Considering the rarity of Timid Mewtwo (as it beats nothing that's used on 95% of teams that Modest doesn't), you could go down to 360 Speed and still beat out Modest Mewtwo to give you more EVs for a mixed sweeper set.</p> <p>Always use a Defense hindering nature if you're using two types of attacks. You obviously won't want to lower one of the attacking stats, and Deoxys-A needs all the Speed it can get. So it comes down to lowering Deoxys-A's Defense or Special Defense. There isn't a used physical attack that Deoxys-A will survive, regardless of nature, except maybe the rare Superpower from Deoxys-D. However, Deoxys-A can survive Pursuit (if it doesn't switch) from Metagross and Knock Off from Deoxys-D. If you'll notice, all of these are Dark attacks, meaning they run off the Special Attack stat. Knock Off does 29-34% to Deoxys-A, assuming Deoxys-D has no Special Attack EVs. This is almost always a 4HKO. It does 32-37% to a Deoxys-A with a Special Defense hindering nature, which is almost always a 3HKO. If Deoxys-A stays in on a Metagross with no Special Attack EVs and a Special Attack neutral nature, it can sometimes survive even with three layers of Spikes down and always with two layers down (72-84% damage). This is not the case for a Special Defense hindering nature Deoxys-A. Deoxys-A can also survive Lugia's Ice Beam by 5% at the least if its nature is neutral, but with a Special Defense hindering nature, Deoxys-A often dies. Even Psycho Boost Lugia doesn't have a guaranteed OHKO without Special Attack EVs (lots of Lugia don't have any, because of all the defense needed).</p> <h1>Checks and Counters</h1> <p>Deoxys-D can do a moderate job against non Shadow Ball ones, but really, wow. This thing has amazing Attack and Special Attack stats, and a great movepool to take advantage of those stats.</p> <p>Ninjask is faster than Deoxys-A if Ninjask is Jolly or if Deoxys-A isn't Hasty and can OHKO with any of its attacks. It can only come in on Superpower (Choice Banded is a 3HKO), Solar Beam, and Calm Mind, though. It can actually damage many other Ubers with that STAB Bug attack, so it's not entirely useless outside of stopping a Deoxys-A sweep. It is still at risk of dying to Extreme Speed, however. Dodrio and Swellow can kill Deoxys-A with Quick Attack; have a perfectly safe switch in on Shadow Ball, the most commonly used move on physical Deoxys-A; and can use Return or Double-Edge if Deoxys-A is Choice Banded, which seriously hurts most Pokemon. Arcanine can switch into anything Deoxys-A throws at it, save Psycho Boost, thanks to Intimidate, and use Extreme Speed, but it is really easy to switch out of. Rayquaza is probably the best counter, as the Choice Band user is the most common and a lot of people still haven't caught on to using Ice Beam as the last move, so it's a fairly safe switch-in. However, you have to beware of the Substitute / Ice Beam set, because it sets up a Substitute as you switch to Rayquaza, and then you have to switch out because of the Ice Beam threat. Pursuit Metagross can stop Deoxys-A after the initial kill with 100% safety (unless it has Thunder in the rain or Fire Punch in the sun and stays in) or can come in on anything from the Choice Band user but +Attack Superpower. With Spikes down, Choice Band Trapinch can come in after Deoxys-A kills something and use Quick Attack, unless it's using Choice Band Extreme Speed, in which case Trapinch dies even with max Defense.</p> ",
    "sets": [
      {
        "name": "Choice Band",
        "description": "<p>Shadow Ball and Superpower OHKO stuff like crazy. Shadow Ball should be your basic move because it hits so much of the Uber metagame super effective, and Superpower hits just about everything that resists Shadow Ball super effective as well as having massive power for stuff like Kyogre that is neutral to both. Extreme Speed can OHKO other Deoxys-A you might encounter as well as allowing you to finish off a wounded Rayquaza before it can Extreme Speed you. Rock Slide can go on there somewhere if you're afraid of Ho-Oh and want to try for a flinch against Lugia as well as hitting Rayquaza super effective. Ice Beam 2HKOes Groudon and OHKOes Rayquaza, which is very useful. Defensive Groudon can sometimes take two Psycho Boosts due to the Special Attack drop as well as the 90% accuracy (unless you invest a few Special Attack EVs, but why do that if there's a better option available?), and survives two Superpowers (you need to roll absolute max damage both times to 2HKO max HP Groudon, and some Groudon have Defense EVs). Ice Beam, on the other hand, will always 2HKO Groudon. Use Fire Punch with your own Groudon and Thunder with your own Kyogre to kill Skarmory, Forretress, and Metagross (especially Metagross, as Pursuit OHKOes Deoxys-A if it switches out).</p> "
      },
      {
        "name": "Special Sweeper",
        "description": "<p>Special sweeper Deoxys-A can actually deal huge damage with +1 Special Attack from Petaya. You'll generally want to make sure to make your HP divisible by four so that the Petaya will activate on the third Substitute, thus allowing Deoxys-A to withstand Tyranitar's Sand Stream for a few turns, but HP not divisible by four can let you scout for misses with the extra Substitute. Superpower is for the chance to OHKO Blissey (especially with how few Blissey even have any Defense EVs), and it definitely does enough to Blissey if she tries to switch into you (as you can attack from behind your Substitute).</p> <p>Because the Choice Band set is far more common and seen as more powerful, Deoxys-A is always assumed to be Choice Banded. There are a few things that can stop this Deoxys-A, but because your opponents will be acting on the assumption that it is Choice Banded first turn out, you have the element of surprise in your favor, which, when dealing with an attack stat over 500, is lethal.</p> "
      },
      {
        "name": "Sunny Day",
        "description": "<p>This really wreaks havoc in the Uber metagame. It looks strange, but really only a healthy Kyogre can stop it, along with the Extreme Speed users of course (Rayquaza in particular). The EVs are up to debate, though even if you maximize Special Attack, it needs the sun to be strong in order to do large amounts of damage to Metagross. Even then, it most likely won't be an OHKO, so you will want to dent it a little first--about 15-20% to be safe. Also note that a lot of Groudon are now running Special Defense, so Solar Beam won't OHKO either; be sure to wear it down as well. Extreme Speed is an option if you want to be able to hit Rayquaza for nominal damage and have a chance against other Deoxys-A. All those Attack EVs are necessary to ensure an OHKO on most Latios and Latias, which is also what the optional Spell Tag is for. It's best if you hold onto this sort of Deoxys-A until the end of the match because its value is in the diverse way it sweeps rather than the pure force of something like the Choice Band set.</p> "
      }
    ]
  },
  "Deoxys-Defense": {
    "overview": "<p>Deoxys-D takes hits like NOTHING and Recovers right in your face with Pressure.</p> ",
    "comments": "<h1>Other Options</h1> <p>Snatch is awesome for stopping 101 HP Substitute users. It also works well for catching Kyogre Calm Minds and tanking even better. Torment makes life hell for a whole lot of sweepers.</p> <p>Superpower helps against Blissey, as a lot of them think they can stay in and Toxic Deoxys-D and run little to no defense in Ubers; it also does a lot to Tyranitar. Ice Beam makes Deoxys-D counter Rayquaza even better. Extreme Speed makes it a poor man's counter to Ninjask, Flail users, and Deoxys-A (the Substitute + Petaya version in particular). Thunder is a decent option on the Calm Mind set to hit harder in rain.</p> <p>Reflect and Light Screen are always good moves on a tank like Deoxys-D.</p> <h1>EVs</h1> <p>Max HP always. Taunting versions without Agility will need a little bit of Speed EVs to be faster than enemy Deoxys-D. Otherwise, just pump those EVs into Defenses.</p> <h1>Checks and Counters</h1> <p>Blissey can Toxic Deoxys-D if it doesn't Taunt, Rest, or Aromatherapy, which puts an end to it. 101 HP Substitute Pokemon such as Kyogre and Groudon work if they can avoid a Toxic. However, if Deoxys-D sets down Spikes, you just make it run, possibly to Lugia, who will Whirlwind most counters away for Spikes damage. Taunt Mewtwo really gives it trouble. Latias and Latios with Safeguard or Refresh beat it one-on-one, but the threat of Knock Off keeps them at bay. Choice Band Metagross 2HKOes with Meteor Mash. Swellow and Heracross love that Toxic, and Heracross just destroys it regardless; same for Scizor.</p> ",
    "sets": [
      {"name": "Spiker", "description": "<p>Deoxys-D is the best Spiker in the game, hands down. It survives both physical and special hits, cannot be trapped by Magneton, and gives Dugtrio a run for its money. This is the standard Deoxys-D set.</p> "},
      {
        "name": "Agility",
        "description": "<p>Deoxys-D has 216 Speed without any EVs, which is plenty for Agility to work out fine. The premise behind this is that the most common counter to Deoxys-D is a Pokemon that makes 101 HP Substitutes and most everything is faster than it. Lots of times, it's possible to Toxic one enemy, say Rayquaza, but then if they switch out to something that makes 101 HP Substitutes, it's easy to catch you unaware, so you can't Toxic them on the switch. Another common occurrence is that after one enemy dies to Toxic, they'll send out a Substituting Pokemon or a Taunting Mewtwo, preventing Deoxys-D from doing anything useful. If you first Toxic whatever's out there, then Agility, problem solved. You're too fast to be Taunted, and if the enemy tries to hide behind a Substitute, you get in a Toxic first, so the Substitute only quickens its death. Many people don't even realize Deoxys-D has Agility, even once you use it, so they are extremely surprised when you kill their Rayquaza and Kyogre.</p> <p>This also allows you to do stuff like Knock Off Deoxys-A's Choice Band before it can use Shadow Ball (and Knock Off does over 30% to Deoxys-A).</p> <p>Taunt stops Blissey from ruining your fun with Aromatherapy and shuts down stallers like Toxic Lugia, Blissey, and other Deoxys-D. If Blissey tries to pull a fast one on you and use Icy Wind to cut you down to size, just use Agility again every once in a while, and the problem is solved.</p> "
      },
      {"name": "Cosmic Power", "description": "<p>This is a stalling, defensive set. It doesn't work nearly as well as others, especially not with the prevalence of Whirlwind Lugia and Aromatherapy Blissey. Rest is preferred over Recover to heal Toxic.</p> "},
      {"name": "Calm Mind", "description": "<p>Deoxys-D actually makes a decent Calm Mind user because it can take physical hits after setting up. You can either go for an option to damage Dark- and Steel-types or take the option of Taunting all recovery and status from Blissey, as well as phazing (primarily Lugia). Either works. Use Recover with Taunt, Rest with the elemental attacks. Psychic and Ice Beam both work as Deoxys-D's only attack, but always use Ice Beam with Thunder or Thunderbolt. Toxic is your only hope at beating other Calm Mind users, honestly. Save the surprise of Toxic if your opponent has Safeguard Latias or Latios, because when they see Calm Mind, they probably won't expect it.</p> "},
      {"name": "CounterCoat", "description": "<p>Taunt is used to force the enemy to attack, and then you Counter or Mirror Coat accordingly and Recover off damage. This only works with Spikes; otherwise, the opponent can just keep switching around.</p> "}
    ]
  },
  "Deoxys-Speed": {
    "overview": "<p>Probably the worst Uber. Offensive sets are either a poor man's Deoxys-A or a poor man's Mewtwo, and defensive sets wish they were Deoxys-D. At least it has Speed going for it.</p> ",
    "comments": "<h1>Other Options</h1> <p>Oh lordy, this Pokemon can do a lot. It can pull off Counter or Mirror Coat (best used with Recover). Deoxys-S gets Light Screen, Reflect, and Safeguard, and it has the Speed to use any of these. Substitute is an option for most Pokemon, but especially things with a lot of Speed, and this Pokemon is all about the Speed. Rock Slide works if you are lucky and want to flinch, as Deoxys-S is fast enough to flinch anything, and it hits both Ho-Oh and Rayquaza. Pursuit is available for other Psychic-types, especially Deoxys-A, but it needs to be used carefully, as some of those Pokemon can do some damage to Deoxys-S if they know it has Pursuit and stay in (you need 172 Special Attack EVs to have a chance to OHKO and 248 Special Attack EVs and a +Special Attack nature to always OHKO a Deoxys-A that stays in). Snatch always allows for some creativity, so don't be afraid to get creative with Deoxys-S.</p> <h1>EVs</h1> <p>For most sets, you'll want to get to 440 Speed to be faster than +Speed Deoxys-A, which requires 16 Speed EVs and a Speed boosting nature or 176 EVs and a neutral nature. Offensive sets should go for maxing the attacking stats, and defensive sets should max HP and then focus on the defenses.</p> <h1>Checks and Counters</h1> <p>The most reliable counter is probably Forretress. It can Rapid Spin away Spikes, is immune to Toxic, doesn't take much from physical attacks, doesn't take much from special attacks except Thunder and Fire Punch, and can easily 2HKO with STAB Hidden Power Bug. Tyranitar and Snorlax beat Deoxys-S that lack Superpower. Blissey can stop anything without Taunt or Superpower. Groudon with max HP is rarely 2HKOed by Ice Beam, and it can OHKO or 2HKO back with Earthquake (guaranteed OHKO if it is Choice Banded). Kyogre 2HKOes Deoxys-S with Surf even if it gets a Calm Mind in (it OHKOes otherwise), but it is 2HKOed by Thunder after Deoxys-S uses Calm Mind. It won't take much damage from anything else, however. Latias and Latios can Calm Mind up against any special attacker and easily beat it with their high Special Defense, but hate Knock Off variants. Ho-Oh beats any Deoxys-S that does not have Rock Slide.</p> ",
    "sets": [
      {"name": "Staller", "description": "<p>Toxic opponents, Taunt all forms of recovery and status, and toss in a few Knock Offs between Recovers and Taunts. Nothing is getting an Aromatherapy past this.</p> "},
      {"name": "Mixed Sweeper", "description": "<p>Unlike Deoxys-A, this can actually take special hits as it uses Calm Mind to set up. Superpower is to stop Blissey from blocking you. With these EVs, Deoxys-S will 2HKO a 4/252 Blissey 100% of the time, factoring in the Attack drop from Superpower, and it is just faster than a Hasty Deoxys-A, the fastest Pokemon you'll encounter in Ubers (except some Swift Swimmers). If you want Deoxys-S's special attacks to have a bit more power, you can switch to Mild, lower its Attack, and raise its Speed to 176 EVs.</p> "},
      {"name": "Choice Band", "description": "<p>Deoxys-S is not the strongest Choice Band user out there, but its fantastic Speed makes it a good choice. Nothing resists the combo of Superpower and Shadow Ball. Extreme Speed is solely to stop Choice Band Deoxys-A. Ice Beam beats Groudon and Rayquaza, but Fire Punch helps against Forretress and Metagross. Only use Fire Punch if you have Groudon. If you have Fire Punch, you might want to replace the Special Attack EVs with HP, but Ice Beam needs the Special Attack to damage its intended targets.</p> "},
      {"name": "Support", "description": "<p>This attempts to set up Spikes and Knock Off random items. Shadow Ball lets it finish off Latias and Latios and OHKO Deoxys-A.</p> "},
      {"name": "Taunt + Calm Mind", "description": "<p>This set has obvious weaknesses to Dark- and Psychic-types if you go with Psychic and is stopped cold by Kyogre if you use Ice Beam, but it beats Blissey and company one-on-one. Deoxys-S has the Speed to come in on some other Calm Mind users and win any Calm Mind war by Taunting any attempts by the enemy to Calm Mind. The only way this can backfire is if the enemy Calm Minds once while Deoxys-S switches in and is a Pokemon that has a strong non-Psychic attack to hurt Deoxys-S with, such as Latias, Latios, and Kyogre. Other than that, the fastest Taunt user in the game ruins a lot of stuff; try it out and have fun.</p> "}
    ]
  }
}