{
  "Butterfree": {
    "comments": "<h1>Other Options</h1> <p>Butterfree can opt to use Hidden Power Fire on its Petaya Berry set to prevent Magnemite from safely setting up Substitute, but this is not recommended due to giving up valuable coverage against Ground- and Water-types like Rhyhorn and Seaking.</p> <h1>Checks and Counters</h1> <p><strong>Magnemite: Magnemite resists Butterfree's damaging moves and can avoid Sleep Powder with its Substitute. Furthermore, Magnemite can cripple Butterfree with Thunder Wave which severely limits its opportunities to spread status.</p> <p><strong>Faster Attackers</strong>: Aipom, Elekid, Taillow, and Staryu are all able to outspeed and KO Butterfree. If another foe has been put to sleep, these Pokemon can switch in relatively easily if Butterfree lacks Stun Spore. Elekid in particular poses a threat, as it can absorb status once thanks to it commonly using Lum Berry. Choice Band users, namely, Aipom, Taillow, and Pidgeotto, can all OHKO Butterfree even with maximum HP investment.</p> <p><strong>Lum Berry Leads: Lum Berry leads such as Pineco and Growlithe can OHKO Butterfree if it tries to use Sleep Powder.</p> <p><strong>Special Walls: Both Delcatty and Lileep act as phenomenal Butterfree checks, as they take minimal damage from its attacks and possess threatening STAB moves, namely Body Slam and Rock Slide. Furthermore, thanks to its access to Heal Bell, Delcatty is able to limit Butterfree's usefulness. Dustox is able to wall Butterfree and remove it with Whirlwind, nullifying a boost from Petaya Berry. However, Butterfree can put special walls to sleep, which leaves them vulnerable to its teammates.</p> ",
    "sets": [
      {
        "name": "Lead",
        "description": "<p>Butterfree cements itself as one of the most reliable status users thanks to Compound Eyes-boosted Sleep Powder. Paired with its above-average Speed tier, it is a frightening lead, particularly versus slower leads like Snorunt, Cyndaquil, and Spoink. Sleep Powder's nigh-perfect accuracy allows Butterfree to put switch-ins or opposing leads to sleep, which makes them deadweight for most of the game. Psychic is Butterfree's strongest move, and thanks to the rarity of viable Dark- and Steel-types, it is almost drawback-free. Hidden Power Grass allows Butterfree to OHKO offensive Rhyhorn while also threatening Ground-types such as Cubone and Water-types like Seaking and Staryu. Giga Drain is an option to provide Butterfree a form of recovery that helps complement Morning Sun's low PP, though it also has low PP and is weaker. Morning Sun provides Butterfree with reliable recovery and allows it to keep itself healthy throughout the match. Butterfree can opt to use Stun Spore alongside Sleep Powder in order to neuter faster threats such as Aipom, Pidgeotto, Taillow, and Elekid. If Stun Spore is used over Morning Sun, Butterfree appreciates the limited recovery that Leftovers and Giga Drain provide.</p> <p>Butterfree fits best on offensive and balanced teams that appreciate the free turns that Sleep Powder provides. Pokemon that resist Fire-type moves, such as Spoink, Seaking, and Chinchou, pair up nicely with Butterfree. Chinchou is worth noting due to its additional resistances to Ice and Electric. Its access to Thunder Wave means Butterfree's team can also spread status more easily. Wallbreakers such as Aipom, Castform, and Elekid all appreciate the opportunity to switch in on sleeping Pokemon. Aipom can act as an offensive pivot for Butterfree, as it threatens Butterfree's checks with Double-Edge and Brick Break. Likewise, Castform is worth mentioning, as it can tank special moves from Butterfree's checks and deal heavy damage in return. Setup sweepers such as Croconaw, Growlithe, Cubone, and Spoink appreciate the setup opportunity that Sleep Powder and Stun Spore provides them. Rock- and Steel-types such as Rhyhorn, Aron, Magnemite, and Nosepass can switch into the STAB moves of faster physical attackers that threaten Butterfree such as Pidgeotto, Taillow, and Aipom.</p> "
      },
      {
        "name": "Substitute + Petaya Berry",
        "description": "<p>Butterfree's excellent Special Attack means it is able to function as a late-game cleaner. Substitute is primarily used to activate Petaya Berry to give Butterfree the boost it needs to clean. Sleep Powder provides Butterfree with more reliable setup opportunities while also providing status support. Psychic is Butterfree's strongest move and is almost always drawback-free thanks to the lack of prominent Pokemon that resist it. Giga Drain provides Butterfree with a form of recovery while also threatening Rhyhorn. Hidden Power Grass can be used over Giga Drain for its greater PP and stronger Base Power.</p> <p>Butterfree appreciates secondary status support, so Pokemon such as Chinchou, Magnemite, and Nosepass all make great partners. Rock-types like Nosepass and Rhyhorn are worth noting thanks to their ability to wall, cripple, and KO wallbreakers such as Choice Band Aipom if it is locked into its STAB moves. Nosepass can also trap and remove opposing Magnemite, another prominent Butterfree check. Pokemon that resist Fire-type moves such as Growlithe, Seaking, and Spoink all make good partners. Growlithe is able to act as a wallbreaker with Overheat making it a great partner. Additionally, wallbreakers such as Aipom, Pidgeotto, and Staryu can help weaken Pokemon that Butterfree may struggle with like Lileep, Delcatty, and Magnemite. Butterfree struggles with faster attackers like Elekid, Aipom, and Staryu, so Pokemon that can wall them such as bulky variants of Castform, Koffing, Dustox, and Lileep make great partners. Koffing is worth mentioning due to its access to Memento, which can give Butterfree an easy setup opportunity.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "BP", "user_id": 272450}], "teams": [{"name": "Quality checked by", "members": [{"username": "BeatsBlack", "user_id": 479897}, {"username": "Gangsta Spongebob", "user_id": 535530}]}, {"name": "Grammar checked by", "members": [{"username": "autumn", "user_id": 384270}]}]}
  },
  "Bayleef": {
    "comments": "<h1>Other Options</h1> <p>Bayleef can opt to become a set-up sweeper thanks to its access to Swords Dance, though is generally outclassed by other set-up sweepers due to its lackluster physical movepool and mediocre Attack. Reflect and Light Screen are options on offensive teams, though Bayleef is generally outclassed in this regard by Ledian. Moreover, dual screens is a fringe role due to the lack of effective Pokemon to take advantage of them. Thanks to its impressive bulk, Bayleef can opt to invest into Special Defense, though it faces stiff competition from both Dustox and Sunflora.</p> <h1>Checks and Counters</h1> <p><strong>Fire-types: Growlithe can be safely brought in on any of Bayleef's damaging moves thanks to Intimidate and OHKO it with its STAB move. Cyndaquil has an unfavorable range to OHKO, but is in return 2HKOed by Hidden Power Ground. Both can absorb a Toxic upon switch-in due to their tendency to hold a Lum Berry.</p> <p><strong>Flying-types: Delibird can 2HKO Bayleef with Ice Beam, while Pidgeotto and Taillow can 2HKO Bayleef with Aerial Ace with unfavorable ranges. Taillow is worth noting, as it can absorb a Toxic with Guts, allowing it to more easily 2HKO Bayleef.</p> <p><strong>Poison-types: Defensive Poison-types such as Koffing and Dustox can wall and status Bayleef. Offensive Poison-types such as Grimer and Nidorino can 2HKO Bayleef with their STAB moves. Grimer is worth noting, as it can use Bayleef as set-up fodder.</p> <p><strong>Toxic Users: Pokemon that commonly run Toxic such as Elekid and Lileep can severely limit Bayleef's effectiveness as a wall.</p> <p><strong>Seaking: Seaking's access to Megahorn allows it to 2HKO Bayleef. In return, Bayleef can only 3HKO Seaking with Hidden Power Grass.</p> ",
    "sets": [
      {
        "name": "Wall",
        "description": "<p>Bayleef's mono-Grass typing coupled with bulk that is comparable to Lileep make it an excellent contender for defensive roles. Hidden Power Grass allows Bayleef to threaten Ground- and Water-types such as Cubone, Rhyhorn, and Chinchou. Alternatively, Hidden Power Ground can be used to threaten Electric-types such as Elekid and Magnemite. However, Hidden Power Ground fails to break Cubone's Substitute and 2HKO Rhyhorn. Leech Seed allows Bayleef to punish Pokemon that may attempt to switch in such as Koffing and Dustox. Synthesis provides Bayleef with reliable recovery, allowing it to maintain its position as an effective wall for longer. Toxic prevents other walls, most notably Lileep, from taking advantage of Bayleef's passiveness. 34 Speed EVs allow Bayleef to outpace offensive Rhyhorn while maintaining its overall bulk.</p> <p>Bayleef excels on almost exclusively balance teams due to the competition it faces with Lileep. Pokemon that absorb Toxic such as Koffing, Grimer, and Staryu all pair well with Bayleef. Koffing is worth noting, as it can act as a secondary check to Aipom and a primary check to Rhyhorn, which would otherwise overwhelm Bayleef. Specially defensive Pokemon such as Castform and the previously mentioned Grimer pair well with Bayleef due to their ability to check Chinchou and Growlithe. Pokemon that can take Fire-type attacks such as Seaking, Chinchou, and Spoink make good partners. Physical wallbreakers such as Aipom, Cubone, and Delibird can all threaten Dustox, which otherwise takes advantage of Bayleef's passiveness. Bayleef pairs well with special wall breakers such as Elekid, Cyndaquil, and Staryu, as they can threaten Koffing.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "BP", "user_id": 272450}], "teams": [{"name": "Quality checked by", "members": [{"username": "Gangsta Spongebob", "user_id": 535530}, {"username": "sleid", "user_id": 601970}]}, {"name": "Grammar checked by", "members": [{"username": "Tea Guzzler", "user_id": 577920}]}]}
  },
  "Cyndaquil": {
    "comments": "<h1>Other Options</h1> <p>Hidden Power Water can be used over Hidden Power Grass to hit Fire-types such as Growlithe and opposing Cyndaquil, and it retains the ability to hit Rock-types such as Rhyhorn. However, it leaves Cyndaquil completely walled by Water-types such as Seaking, Chinchou, and Staryu. ChestoRest sets are also an option for longevity, but they are generally outclassed by the Lum Berry wallbreaker set.</p> <h1>Checks and Counters</h1> <p><strong>Priority Moves: Priority moves from Pidgeotto, Elekid, and Delibird can pick off Cyndaquil even after it activates its Salac Berry, thus shutting it down completely.</p> <p><strong>Water-types: Water-types such as Seaking and RestTalk Chinchou resist Cyndaquil's Fire Blast and do not fear Hidden Power Grass while OHKOing back with their STAB moves.</p> <p><strong>Spoink</strong>: Thanks to Thick Fat, Spoink functionally resists Fire Blast, and Hidden Power Grass does not threaten it, allowing it to use Cyndaquil as setup fodder with Calm Mind. However, it must be wary of Toxic.</p> <p><strong>Rock-types</strong>: Rock-types such as Nosepass resist Fire Blast, and Nosepass doesn't even fear Blaze, avoiding the 2HKO regardless. Nosepass also shrugs off Hidden Power Grass thanks to its immense special bulk. Lileep can also avoid a 2HKO from Fire Blast if Cyndaquil is not in Blaze range, and it can hit hard with Rock Slide or PP stall Fire Blast's 8 PP with Recover.</p> ",
    "sets": [
      {
        "name": "Lead",
        "description": "<p>Cyndaquil is one of the best leads in ADV ZU thanks to its immense power with Blaze and priority move in Quick Attack. These traits give Cyndaquil a great matchup versus leads such as Snorunt, which it completely denies entry hazards from. Endure allows Cyndaquil to activate Blaze and its Salac Berry, letting it outspeed every unboosted Pokemon. This allows Cyndaquil to beat leads that would otherwise outspeed and OHKO it, such as Aipom, although it must be careful of paralysis. Fire Blast threatens leads such as Snorunt with an OHKO and packs a huge punch with Blaze active, 2HKOing specially bulky Pokemon such as Delcatty and Grimer. It can even 2HKO some Fire-resistant Pokemon such as Staryu and Chinchou. Hidden Power Grass hits Water- and Rock-types that resist Fire Blast such as Seaking and Rhyhorn. Lastly, Quick Attack stops Snorunt from setting up Spikes and can also be used to pick off faster Pokemon, such as Elekid, at low HP.</p> <p>Cyndaquil fits very well on balance teams that are weak to Spikes due to its great matchup against Snorunt. Many Pokemon, such as Elekid, Castform, and Aipom, no longer worry about Spikes cutting into their bulk or putting them KO in range of priority moves. Cyndaquil's presence as a lead has seen several counter-leads emerge, such as Spoink and Seaking, both relatively bulky Pokemon that can set up on Cyndaquil — ; using Calm Mind and Rain Dance, respectively. As a result, Cyndaquil appreciates teammates such as Delcatty, tank Castform, and Lileep, which all check these two Pokemon. Lileep can also deal with common priority attackers such as Elekid and Pidgeotto, which shut down Cyndaquil, even with a Salac Berry boost, if they are not in KO range of Cyndaquil's Quick Attack. Shuppet also can shut down Band Pidgeotto and Tailow locked into Quick Attack, which can revenge kill Cyndaquil. Lastly, opposing Fire-types such as Growlithe and Numel can handle Cyndaquil lacking the rare Hidden Power Water, so partners such as Seaking and Chinchou may be ideal.</p> "
      },
      {
        "name": "Wallbreaker",
        "description": "<p>As a wallbreaker, Cyndaquil is very powerful with a great offensive typing, dismantling common defensive cores with Pokemon such as Dustox and Magnemite. Blaze lets Fire Blast comfortably 2HKO special walls such as Lileep and Delcatty, which it otherwise struggles with. Hidden Power Grass covers Water-types and Rock-types that resist Fire Blast such as Seaking, Nosepass, and Rhyhorn. Quick Attack can finish off low-HP faster Pokemon looking to revenge kill Cyndaquil, such as Elekid and Pidgeotto. Cyndaquil's fourth moveslot is quite flexible, with Toxic giving a much better matchup against Spoink, which would otherwise use Cyndaquil as setup fodder, while also being useful versus specially bulky Pokemon such as Lileep and tank Castform. Substitute can be used to scout switches and also to put Cyndaquil in Blaze range.</p> <p>Cyndaquil benefits greatly from Spikes via a lead like Snorunt or Pineco, which lets it 2HKO common special walls such as Delcatty with two layers, as well as specially defensive Lileep with a little chip damage. Additionally, physical wallbreakers are appreciated to deal with these special walls if Cyndaquil can't, such as Rhyhorn, Pidgeotto, and Aipom. Cleaners such as Elekid appreciate Cyndaquil wallbreaking for them. Elekid is also notable for threatening Water-types that can cause Cyndaquil trouble. Cyndaquil can also struggle versus Rock-types such as Nosepass. Additionally, Spoink walls Cyndaquil thanks to Thick Fat and can use it as setup fodder. Delcatty and tank Castform check these Water-types and Spoink quite well, with the latter also checking various Rock-types such as Lileep.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "plznostep", "user_id": 595639}], "teams": [{"name": "Quality checked by", "members": [{"username": "Gangsta Spongebob", "user_id": 535530}, {"username": "BP", "user_id": 272450}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Croconaw": {"sets": [{"name": "Swords Dance"}]},
  "Delcatty": {
    "comments": "<h1>Other Options</h1> <p>Delcatty has a large selection of options, but it is difficult to fit or justify them. Thunder Wave is a way to guarantee that Delcatty dishes out paralysis for teammates reliant on it like Rhyhorn and Cubone, as well as guaranteeing to paralyze the opposing Pokemon in an emergency, but Body Slam usually gets the job done over longer games, and running Thunder Wave means giving up either Body Slam or Heal Bell. Delcatty can make use of Sing alongside its good bulk for multiple chances to put an opponent to sleep, but this is very unreliable considering Sing's paltry accuracy. Sleep Talk could be used on its Calm Mind set to become less passive when asleep, but Delcatty would usually prefer the coverage of Thunderbolt.</p> <h1>Checks and Counters</h1> <p><strong>Shuppet: As the sole Ghost-type of the tier, Shuppet can easily switch into Body Slam and harass Delcatty's team with status and attacks. While Shuppet must be afraid of a Shadow Ball teched for it, scouting a Shadow Ball confirms that Delcatty is missing an important move.</p> <p><strong>Steel- and Rock-Types</strong>: Pokemon that resist Body Slam can pretty easily switch into Delcatty, such as Aron, Rhyhorn, and Magnemite. They must be wary of Body Slam's paralysis though, even if they don't mind the Speed drop. However, Hidden Power Grass and Calm Mind beat the Rock-types, so scouting Delcatty's moveset is important to handle it consistently.</p> <p><strong>Status: While it seems counter-intuitive that a Pokemon with Heal Bell is afraid of status, Delcatty only has 8 uses of it, so Delcatty cannot afford to repeatedly take status and heal it off. A burn or poison will severely impede Delcatty's ability to heal, since it takes two turns on the field to use and receive Wish, and a poorly timed full paralysis can lead to Delcatty fainting.</p> <p><strong>Offensive Pressure</strong>: Delcatty's lack of resistances and reliance on Wish or Rest for recovery means that it can be pressured exceptionally hard through repeatedly hitting it, smart double switches with Spikes up, and disruption tools like Taunt. Choice Band users such as Aipom, Delibird, and Pidgeotto can muscle their way through Delcatty, although they must respect paralysis.</p> <p><strong>Setup Sweepers: Setup sweepers with a Lum Berry, or those who are willing to risk paralysis, can use Delcatty as an opportunity to accrue boosts. Bagon can survive two Body Slams and Larvitar resists the move, although they are deathly afraid of Ice Beam and Hidden Power Grass respectively. Croconaw can tank even a Thunderbolt and set up a Swords Dance to threaten Delcatty with Brick Break or Return.</p> ",
    "sets": [
      {
        "name": "Defensive",
        "description": "<p>Thanks to great mixed bulk, an acceptable defensive typing, and an incredible suite of utility moves, Delcatty is a staple cleric of the tier and excellent choice for any team needing a solid backbone and support Pokemon. Wish differentiates Delcatty from other walls and other bulky Normal-types like Castform thanks to the amount of support it provides. Protect allows Delcatty to safely receive its own Wish, as well as accrue additional Leftovers recovery and scout the intentions of Choice Band users such as Aipom. Body Slam is a solid damaging move when bolstered by STAB and a 30% paralysis rate, which ensures that Delcatty isn't too passive when checking threats. Heal Bell allows Delcatty to remove status from itself and its teammates. This is particularly important if Delcatty is afflicted with Toxic, since it must spend 2 turns on the field to heal itself. Shadow Ball is an option to lure Shuppet, which would otherwise take advantage of Delcatty's passiveness. Hidden Power Grass hits Rhyhorn, which easily switches into Delcatty, but it can also hit the other Rock-types that don't mind Body Slam, such as Onix and Larvitar. However, Hidden Power Grass is easily ignored by Lileep, the most common Rock-type in the tier. Maximum HP and Special Defense with a Careful nature is used so Delcatty can reliably switch into special attackers, but a Sassy nature is preferred if Delcatty uses Hidden Power Grass.</p> <p>Delcatty is best used on defensive and balance teams that appreciate its ability to blanket check the many special attackers in the tier while also providing Wish and other utility. Lileep and Koffing are excellent physically defensive complements to Delcatty, checking many attackers that try to hit Delcatty on its frailer side, such as Aipom, Rhyhorn, and Pidgeotto. Lileep also particularly appreciates Heal Bell support, as Toxic is a very consistent way to break past Lileep and is splashed into the movesets of many Pokemon otherwise walled by Lileep. Wallbreakers are important on balance to help offset Delcatty's passivity. Rhyhorn is a more aggressive Normal-resistant Pokemon that becomes monstrously dangerous when supported by paralysis from Delcatty's Body Slam, and it can even come back for additional rounds of terror if restored by Wish and/or Heal Bell. Seaking and Castform are two great Pokemon that don't necessarily need support to wallbreak but appreciate Wish and cleric support for additional longevity. Other Pokemon with strong defensive qualities but no reliable recovery, such as Aron, Magnemite, and Chinchou, can stick around to fulfill their functions for much longer when they are kept alive by Wish. While the support Delcatty brings is unparalleled in the tier, it can be quite passive in the face of setup threats unafraid of Body Slam, such as Lum Berry users and Rock- and Steel-types using Substitute like Magnemite. Partnering Delcatty with good answers to these tactics, such as Koffing and Bayleef respectively, will make Delcatty much more reliable. Koffing is a terrific counter to offensive Rhyhorn and can use Explosion to check setup sweepers that might try to use Delcatty as an opportunity to run away with the game, such as Lum Berry Bagon. Bayleef's good mixed bulk allows it to duel Rock-types, Shuppet, and Magnemite that try to use Substitute against Delcatty, and either spread Toxic or chip away with Leech Seed.</p> "
      },
      {
        "name": "Calm Mind",
        "description": "<p>Delcatty can make use of Calm Mind to become an unexpected sweeper, boosting its special stats alongside full Defense investment in order to become a very bulky cleaner. Access to Thunderbolt and Ice Beam complete the legendary BoltBeam coverage, giving it the ability to hit a wide range of Pokemon super effectively, such as Bayleef, Lileep, and Seaking. Rest allows Delcatty to set up with impunity against walls reliant on status, such as Lileep and Dustox, allowing Delcatty to checkmate more passive teams if their phazer is KOed or Delcatty is the last Pokemon remaining.</p> <p>Calm Mind Delcatty is best used as a cleaner on balance teams, leveraging its bulk to slowly push through a weakened team, but appreciating the defensive backbone a balance team provides. Lileep is a great partner, blanket checking a huge portion of the metagame and spreading Toxic to soften the opposition. Wallbreakers like Aipom, Castform, and Seaking do an excellent job of removing or heavily damaging Pokemon that carry tools that can disrupt Delcatty's sweep. For example, Aipom can force big damage on Koffing, which carries Explosion, while Seaking can lure Whirlwind Dustox and threaten it with Hidden Power Rock. In the case that Delcatty comes up short late-game, other cleaners like Elekid and Horsea do a great job at picking up the pieces for Delcatty. Delcatty struggles into physical wallbreakers such as Aipom or Cubone that threaten to 2HKO or 3HKO Delcatty on the turn it Rests, so physically resilient Pokemon like Koffing, Lileep, and Bayleef are solid defensive partners for Delcatty.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Monai", "user_id": 482455}], "teams": [{"name": "Quality checked by", "members": [{"username": "Gangsta Spongebob", "user_id": 535530}, {"username": "BP", "user_id": 272450}]}, {"name": "Grammar checked by", "members": [{"username": "Tea Guzzler", "user_id": 577920}]}]}
  },
  "Castform": {
    "comments": "<h1>Other Options</h1> <p>A physical wallbreaker set utilizing Choice Band is an option, though this is largely outclassed by Choice Band Aipom. Toxic can be used to catch potential switch-ins off guard, such as Lileep; however, this means Castform has to forego Protect or one of its coverage options. Castform also has some set-specific options. Castform's Tank set may use Hidden Power Grass to OHKO Rhyhorn, but the coverage of Ice Beam is important to target Lileep. On Substitute mixed attacker Castform, Ice Beam can be used over Hidden Power Grass, as it still 2HKOes Rhyhorn while threatening Lileep with a 3HKO, though Hidden Power Grass OHKOing Rhyhorn is generally more useful.</p> <h1>Checks and Counters</h1> <p><strong>Status Users: Pokemon that run status such as Butterfree, Lileep, and Koffing can all severely limit Castform's effectiveness. Toxic discourages Castform from using Double-Edge or Protect and greatly reduces its opportunities to switch in. Will-O-Wisp does the same while also halving Castform's Attack, effectively voiding its capabilities as a mixed wallbreaker since it can no longer threaten special walls.</p> <p><strong>Magnemite: If Castform lacks Fire-type coverage it cannot threaten Magnemite, which can cripple Castform with a status move or 3HKO it with Thunderbolt.</p> <p><strong>Water-types</strong>: If Castform lacks Thunderbolt or Hidden Power Grass, it has a harder time dealing with Water-types, such as Seaking, Horsea, and Staryu. Staryu deserves a special mention, as it can slowly wear down Castform through its own recoil, healing off Double-Edge damage with Recover. Additionally, the lack of super effective coverage means Horsea can usually withstand at least one attack from Castform at full HP, which lets it fire off Hydro Pump multiple times.</p> <p><strong>Physical Wallbreakers: Pokemon such as Aipom, Taillow, and Pidgeotto outpace Castform and 2HKO it with their STAB moves. If it lacks Ice Beam or Hidden Power Grass, Castform is unable to threaten Rhyhorn. Cubone can KO Castform after the slightest amount of chip, while Castform can only 2HKO with Ice Beam and Double-Edge if Cubone is healthy.</p> ",
    "sets": [
      {
        "name": "Tank",
        "description": "<p>Castform cements itself as a meta-defining threat thanks to its exceptional stats—for the tier—and plethora of coverage moves. It excels as a specially defensive tank that can threaten a wide variety of Pokemon. Furthermore, Forecast makes Castform the most reliable answer to teams that use weather, letting it automatically resist a majority of their primary moves. Protect allows Castform to scout would-be revenge killers that use Choice Band, such as Aipom and Pidgeotto, while also netting recovery from Leftovers. Castform's STAB Double-Edge removes Pokemon that resist its coverage, such as Chinchou and Elekid, while threatening special walls such as Dustox, Delcatty, and Sunflora. Thunderbolt allows Castform to nail Water- and Flying-types such as Horsea, Seaking, and Pidgeotto. Ice Beam enables Castform to threaten Ground- and Grass-types such as Rhyhorn and physically defensive Lileep. Flamethrower is an option to threaten Magnemite, but it requires Castform to forgo Thunderbolt, which limits its effectiveness against rain teams. Castform's EVs allow it to outpace maximum Speed Rhyhorn while still maintaining enough Attack to threaten special attackers such as Growlithe, Elekid, and Seaking. Castform's Special Defense investment allows it to avoid 2HKOs by Seaking, Horsea, and Cyndaquil, and possibly Growlithe with favorable Fire Blast damage.</p> <p>Castform excels on balance and offensive teams that appreciate an answer to weather or a special sponge. Physical wallbreakers such as Aipom, Pidgeotto, and Taillow appreciate Castform's effectiveness against Elekid. Special attackers such as Growlithe, Elekid, and Staryu enjoy the pressure that Castform puts on special walls like Dustox and Delcatty with Double-Edge. Elekid pairs particularly well with Castform, as it is able to threaten physical wallbreakers such as Aipom and Pidgeotto. Due to its lack of reliable recovery, Castform preforms best with secondary defensive support from Pokemon such as Dustox, Delcatty, and Sunflora. Delcatty provides Castform with recovery in Wish while also keeping it safe from status thanks to Heal Bell. Physically defensive Pokemon such as Lileep, Koffing, and Magnemite prevent Castform from being revenge killed by Aipom, Pidgeotto, or Taillow. Koffing and Castform form a great core, as Koffing can cripple physical attackers with Will-O-Wisp, while Castform can tank special attacks for Koffing.</p> "
      },
      {
        "name": "Weather Boy",
        "description": "<p>Castform's exceptional bulk and special attack, fantastic special movepool, and ability in Forecast allow it to function as an excellent weather setter and wallbreaker. Under rain or sun its boosted STAB move 2HKOes nearly every viable special wall and OHKOes virtually every other neutral target. If it's using Rain Dance, Castform's only viable STAB move is Weather Ball, but if it's using Sunny Day, Castform may use Fire Blast instead, which is strong even outside of sun and still does more damage than Weather Ball in sun at the cost of imperfect accuracy. If it's using Rain Dance, Ice Beam is crucial for targeting Grass-types while also threatening Flying- and Ground-types outside of rain. When using Sunny Day, Solar Beam is used instead, as it OHKOes most Rock- and Water-types, which can usually tank a boosted Fire Blast and try to threaten Castform with their STAB moves and status. Castform's moveset is rounded off by Thunderbolt, which threatens opposing Water-types regardless of the weather and is Sunny Day Castform's strongest attack against Flash Fire Growlithe. Rain Dance has the option to instead use Thunder, which is even stronger at the cost of having shaky accuracy outside of rain, or Hidden Power Grass, which threatens Chinchou, a Pokemon that otherwise resists or is immune to all of Castform's attacks when used in rain. Mystic Water or Charcoal can be used to augment the power of Castform's STAB move, notably hitting special walls, such as Delcatty and Dustox, harder and 2HKOing the rare specially defensive Lileep. A Lum Berry can be used instead to prevent Castform from being crippled by status.</p> <p>Castform fits best on offensive teams looking for a powerful wallbreaker. Specifically, it is a fantastic option on dedicated weather teams, as it's among their best setters and one of their only answers to the other weather due to Forecast. On dedicated rain teams, Swift Swim users, such as Seaking and Horsea, and Rain setters, such as Voltorb, make great partners. On dedicated sun teams, Chlorophyll users, such as Exeggcute and Sunflora, and sun setters, such as Onix, are essential partners. On all types of offensive teams, fast physical threats such as Aipom and Taillow appreciate Castform's ability to break physical walls, while they in return can break through the remainder of the opposing team. Fast physical attackers are also Castform's biggest threat, as they can revenge kill it, so physical tanks and walls, such as Rhyhorn and Nosepass, also make great partners.</p> "
      },
      {
        "name": "Substitute Special Attacker",
        "description": "<p>Substitute special attacker Castform is a dangerous wallbreaker that takes advantage of Castform's ability to force switches to set up a Substitute and further its already immense wallbreaking power. Ice Beam threatens ZU's plethora of Grass-types, notably including Lileep. Thunderbolt, meanwhile, threatens the majority of Water-types while providing solid damage against the Steel- and Fire-types that resist Ice Beam. Both moves handle Flying-types such as Taillow and Pidgeotto. Hidden Power Grass rounds off Castform's coverage by threatening Chinchou while also preventing specially defensive Rhyhorn from attempting to tank a hit and retaliate. Alternatively, Fire Blast can be used to threaten Dustox and Magnemite, which otherwise wall this set.</p> <p>This set fits best on offensive and balance teams looking for a powerful and bulky special wallbreaker. Special walls that don't fear its coverage, such as Delcatty, wall it completely, so strong physical wallbreakers such as Aipom and Taillow make great partners, and Castform handles the physical walls they dislike in return. If it's running Fire Blast, Grass-types are important partners for their ability to break through Chinchou. Even if Castform is running Hidden Power Grass, it still appreciates their support. Psychic-types are notable partners for their ability to threaten specially defensive Poison-types like Dustox and Grimer, which Castform struggles to break through. Exeggcute is noteworthy for having both Grass- and Psychic-type STAB moves while also spreading sleep, which makes it easier for Castform to set up a Substitute. Fire-types like Cyndaquil and Growlithe pair well with Castform's coverage and break through Dustox and Magnemite for it, which is essential if it's running Hidden Power Grass. Physical walls and tanks, like Nosepass, Rhyhorn and Lileep, are also greatly appreciated, as faster physical wallbreakers, such as Choice Band Aipom, Pidgeotto, and Taillow, can easily revenge kill Castform, and the former can even survive all of Castform's attacks moves when at full HP. Finally, Forecast and Castform's good bulk make it the best weather answer, and this set's coverage often lets it handle weather sweepers for teams that would otherwise struggle with them.</p> "
      },
      {
        "name": "Substitute Mixed Attacker",
        "description": "<p>Substitute mixed attacker Castform is a potent wallbreaker that is capable of threatening both physical and special walls alike. Substitute uses Castform's ability to force switches to set up a Substitute and further its wallbreaking prowess. Return threatens common special walls such as Dustox and Delcatty with a 2HKO. Alternatively, Double-Edge can be used to increase Castform's damage at the cost of hurting its longevity. Flamethrower threatens Magnemite, Aron, and physically bulky Grass-types, such as Exeggcute and Bayleef. Hidden Power Grass threatens Rock-types, notably annihilating the exceptionally dangerous Rhyhorn. A Naughty nature allows Castform to increase the power of its STAB moves without compromising its Special Attack or Speed but it worsens Castform's matchups against special attackers like Elekid and Staryu. A Lonely nature can be used to check those threats, preserving those matchups at the cost of worsening Castform's matchups against physical attackers like Aipom and Taillow.</p> <p>Castform best fits on offensive and balance teams that appreciate it checking a wide range of Pokemon. Lileep is the one wall this set cannot threaten at all, and thus Toxic support from the likes of Dustox and Koffing is greatly appreciated. Fast physical attackers, such as Choice Band Aipom, Pidgeotto, and Taillow, can easily outspeed and revenge kill Castform if it's not behind a Substitute, and thus physically defensive Pokemon such as Lileep and Rhyhorn can help Castform fight off these threats. Special walls such as Dustox and Delcatty are also good partners if this Castform is using a Naughty nature, as it's easily put into range of faster special attackers such as Elekid and Staryu. Given this Castform's ability to break through special walls, additional special attackers such as Chinchou and Growlithe form potent offensive cores alongside it. Finally, Forecast lets this Castform check weather sweepers for its team, but it cannot be a team's sole weather check due to its lack of strong coverage, especially if it's running a Naughty nature.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "BP", "user_id": 272450}, {"username": "Gangsta Spongebob", "user_id": 535530}], "teams": [{"name": "Quality checked by", "members": [{"username": "Gangsta Spongebob", "user_id": 535530}, {"username": "BeatsBlack", "user_id": 479897}, {"username": "BP", "user_id": 272450}, {"username": "Medeia", "user_id": 312146}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}, {"username": "Deezcastforms", "user_id": 423085}, {"username": "Sabelette", "user_id": 583793}]}]}
  },
  "Koffing": {
    "comments": "<h1>Other Options</h1> <p>Koffing can opt to use Explosion, as most Rock- and Steel-types are too threatened by Hidden Power Grass and Flamethrower to safely switch in. Fire Blast is an option over Flamethrower to OHKO Naughty Delibird; however, Koffing appreciates the extra PP that Flamethrower provides. Taunt can be used to prevent opposing defensive Pokemon and setup sweepers from taking advantage of Koffing.</p> <h1>Checks and Counters</h1> <p><strong>Special Attackers: Spoink, Staryu, and Growlithe can all threaten Koffing with their STAB attacks. Staryu is worth noting because it can absorb Koffing's Will-O-Wisp with Natural Cure and use Recover to mitigate any damage.</p> <p><strong>Magnemite: Magnemite's immunity to Koffing's STAB moves and base 95 Special Attack allow it to reliably check Koffing forgoing Fire-type coverage.</p> <p><strong>Bulky Poison-types</strong>: Grimer and Dustox are able to take advantage Koffing's overall passiveness. Dustox's reliable recovery, Psychic-type coverage, and considerable bulk allows it to threaten Koffing. Grimer can use Koffing as setup fodder if it lacks Haze or Taunt.</p> ",
    "sets": [
      {
        "name": "Defensive",
        "description": "<p>Levitate in conjunction with stellar bulk allow Koffing to switch into all of Rhyhorn's moves reliably, making Koffing an excellent defensive pivot. Leftovers and Koffing's low base HP enable it to stay healthy by using Pain Split. Sludge Bomb threatens offensive Pokemon such as Aipom, Pidgeotto, and Taillow; it also discourages special attackers such as Elekid and Growlithe from switching in. Hidden Power Grass answers Ground-types such as Rhyhorn and Cubone more effectively. Will-O-Wisp cripples physical attackers such as Aipom, Cubone, and Pidgeotto. Alternatively, Flamethrower prevents Magnemite from taking advantage of Koffing's passiveness.</p> <p>Koffing fits best on balance and defensive teams due to its passive nature. Koffing pairs well with Pokemon that struggle with Rhyhorn such as Aipom, Pidgeotto, and Tailow. Castform checks common Pokemon that Koffing tends to struggle with such as Staryu, Elekid, and Dustox. Pokemon that appreciate a Ground-type immunity such as Chinchou, Elekid, and Magnemite all pair well with Koffing. Koffing struggles against special attackers such as Elekid, Staryu, and Growlithe so specially defensive pokemon such as Delcatty, Dustox, and Sunflora are integral in providing support. Delcatty is worth noting, as it can Wish pass to help remedy Koffing's lack of reliable recovery. Koffing struggles with other bulky Poison-types like Grimer and Dustox, so physical attackers like Rhyhorn, Aipom, and Cubone pair well with it.</p> "
      },
      {
        "name": "Utility",
        "description": "<p>Koffing comes equipped with an expansive utility movepool, Ground-type immunity, and excellent physical defense. This means Koffing can choose to play a more supportive role alongside its potency as a physical wall. Memento allows Koffing to safely bring in setup sweepers and wallbreakers against a foe. Alternatively, Koffing can choose to use Destiny Bond, which can force out faster threats that may not OHKO it. Destiny Bond can also force trades with threats like Aipom and Elekid. Koffing can opt to use Toxic in order to threaten defensive Pokemon such as Lileep. Haze can be used to shut down opposing setup sweepers that may abuse Koffings passiveness, such as Growlithe and Spoink.</p> <p>Rain and sun sweepers such as Seaking, Horsea, and Sunflora all appreciate Memento support to set up their respective weather. Setup sweepers such as Croconaw, Growlithe, and Spoink all appreciate the setup opportunity that Memento provides. Pokemon that struggle with physical attackers, such as Castform, Delcatty, and Sunflora, all appreciate Koffing's physical bulk. Koffing struggles against other defensive Pokemon, so wallbreakers such as Aipom, Staryu, and offensive Chinchou pair well with it.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "BP", "user_id": 272450}], "teams": [{"name": "Quality checked by", "members": [{"username": "BeatsBlack", "user_id": 479897}, {"username": "Gangsta Spongebob", "user_id": 535530}]}, {"name": "Grammar checked by", "members": [{"username": "Isaiah", "user_id": 375662}]}]}
  },
  "Pidgeotto": {
    "comments": "<h1>Other Options</h1> <p>Hidden Power Ground can be used to OHKO Magnemite and hit Shuppet, unlike Hidden Power Fighting. However, Hidden Power Ground cannot hit Lileep for significant damage. Hidden Power Flying hits harder than Aerial Ace, but Pidgeotto must then use Steel Wing as coverage, meaning it cannot threaten Pokemon such as Magnemite for a 2HKO.</p> <h1>Checks and Counters</h1> <p><strong>Physical Walls: Physical walls such as Koffing can switch into Pidgeotto locked into the wrong move and force it out. Most notably, bulky variants of Rhyhorn, Lileep, and Nosepass are not fazed by Pidgeotto's STAB combination or 2HKOed by its coverage, significantly reducing Pidgeotto's offensive presence. Lileep also has Recover to continuously counter Pidgeotto, while Rhyhorn can be problematic for Pidgeotto's team if Pidgeotto gives it a free turn of setup. Physically bulky Steel-types such as Magnemite and Aron don't mind Pidgeotto's STAB combination either, but they must be wary of a super effective Hidden Power.</p> <p><strong>Electric-Types: Some Electric-types such as Elekid outspeed Pidgeotto and can OHKO it with Thunderbolt; others such as Chinchou can come in and KO Pidgeotto if it's is locked into Aerial Ace. Magnemite resists both STAB types and threatens Pidgeotto with Thunderbolt, although it must be wary of a super effective Hidden Power.</p> <p><strong>Shuppet: Shuppet is immune to Double-Edge and Hidden Power Fighting, letting it completely stop Pidgeotto with a good prediction</p> <p><strong>Faster Attackers</strong>: Faster attackers such as Aipom, Elekid, Tailow, and Staryu can all outspeed Pidgeotto and threaten it with strong attacks, although they must be careful to avoid getting chipped down into Quick Attack range.</p> ",
    "sets": [
      {
        "name": "Physical Wallbreaker",
        "description": "<p>Pidgeotto stands out as a great physical wallbreaker thanks to its great STAB moves in Double-Edge and Aerial Ace, which can 2HKO common walls such as Dustox, Delcatty, and Bayleef, and its good speed tier outpacing Pokemon such as Butterfree, Castform, and Chinchou. Pidgeotto faces competition from another Normal / Flying type, Taillow, who has a better Speed and a useful ability in Guts. However, Pidgeotto has better attack and bulk. It also avoids OHKOs from walls such as Dustox and Delcatty after Double-Edge recoil, as well as outright OHKOs from powerful attacks such Double-Edge from non-Choice Band Aipom and Castform, and Aerial Ace from Choice Band Delibird. Return can be used over Double-Edge to help Pidgeotto stay healthy, but it will be harder to get targets into KO range. STAB Quick Attack revenge kills faster Pokemon such as Aipom, Elekid, and Delibird. Hidden Power Fighting can threaten Pokemon that don't mind Pidgeotto's STAB combination such as Rhyhorn, Magnemite, and specially defensive Lileep. Steel Wing can be used to ease prediction versus Shuppet, or if you are using Hidden Power Flying over Aerial Ace for the power. Here, Steel Wing lets Pidgeotto still threaten Rock-types like specially defensive Lileep and Nosepass. However, without a super effective Hidden Power, Pidgeotto cannot threaten to 2HKO Steel-Types such as Magnemite.</p> <p>Pidgeotto fits very well on balance and offense teams as a wallbreaker. It can remove Pokemon such as Delcatty, Dustox, and Bayleef, which can open up teammates such as Elekid, Staryu, and Rhyhorn. Pidgeotto appreciates Spikes support from Snorunt and Pineco, which helps chip Pokemon like Elekid and Aipom into Quick Attack range over time. Spikes also allows Pidgeotto to 2HKO Pokemon it normally can't like bulky variants of Rhyhorn. Special walls such as Chinchou and Delcatty are excellent checks to faster special attackers such as Elekid and Staryu, with Delcatty also offering cleric support if Pidgeotto gets burned by Pokemon such as Koffing. Rock-types such as Rhyhorn and Nosepass can switch into Aipom and Taillow's STAB moves as they try to revenge kill Pidgeotto. Nosepass has the added benefit of trapping Magnemite, a common Pidgeotto check. Also, Pidgeotto's Grass resistance also helps Rock-types versus Pokemon such as Bayleef and Butterfree. Special attackers such as Elekid and Spoink can remove physical walls such as Rhyhorn, Magnemite, and Koffing, which allows Pidgeotto to use its STAB moves without being punished.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "plznostep", "user_id": 595639}], "teams": [{"name": "Quality checked by", "members": [{"username": "BP", "user_id": 272450}, {"username": "Gangsta Spongebob", "user_id": 535530}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Growlithe": {
    "comments": "<h1>Other Options</h1> <p>Flash Fire can be used to help Growlithe switch into certain Fire-types, such as Cyndaquil and opposing Growlithe, though most Pokemon with Fire-type moves, like the aforementioned examples, still have the coverage to threaten Growlithe. Roar can be used to phaze targets, though Growlithe's lack of recovery and only decent bulk make it hard to use. Charcoal boosts the power of Growlithe's Overheat, though other items typically help Growlithe fulfill its given role better.</p> <h1>Checks and Counters</h1> <p><strong>Water-types: Hidden Power Grass fails to OHKO any relevant Water-type, while Growlithe is usually OHKOed by the Water STAB moves from threats such as Staryu, Chinchou, and Seaking. Chinchou is also notable for its ability to cripple Growlithe with Thunder Wave.</p> <p><strong>Rock-types: Nosepass isn't 2HKOed by unboosted Hidden Power Grass and can 2HKO Growlithe back with Rock Slide. However, it can only 3HKO Growlithe if it had its Attack lowered by Intimidate. Certain specially defensive Rhyhorn sets can tank a Hidden Power Grass from Timid Growlithe, though it can only OHKO Growlithe back if its Attack isn't lowered.</p> <p><strong>Special Sponges: Delcatty isn't 2HKOed by any of Growlithe's moves and can heal off the damage with Wish and status with Heal Bell. Castform easily tanks Growlithe's attacks and can overwhelm it with Double Edge, Thunderbolt, or Weather Ball in Rain. While Lileep isn't a special wall, it can easily switch into Growlithe and heal off any damage off with Recover, though it must watch out for Toxic.</p> <p><strong>Spoink: If Growlithe isn't running Crunch, Spoink can use it as setup fodder thanks to Thick Fat. Toxic variants of Growlithe can cripple Spoink, though they lose to speedy Substitute variants.</p> <p><strong>Cyndaquil</strong>: Cyndaquil can outspeed and 2HKO Growlithe with Hidden Power Water while only being 2HKOed back by Fire Blast.</p> ",
    "sets": [
      {
        "name": "Agility Sweeper",
        "description": "<p>After using Agility, Growlithe outspeeds the entire unboosted metagame, making it an effective cleaner. Fire Blast serves as a powerful and spammable STAB attack that notably breaks past the tier's best special wall, Dustox. After Growlithe's Petaya Berry activates, it becomes unwallable, as even the sturdiest walls, like Lileep and Delcatty, are 2HKOed by it. Hidden Power Grass OHKOes Rhyhorn and also deals significant damage to Water-types such as Chinchou and other Rock-types like Nosepass. Substitute shields Growlithe from status and also lets it activate its Petaya Berry easier. Alternatively, Crunch lets Growlithe target Spoink, which can otherwise set up on it using Calm Mind and Thick Fat. Intimidate is used, as reducing the foe's Attack gives Growlithe more opportunities to set up Agility and Substitute.</p> <p>Growlithe best fits on offensive and balance teams looking for an end-game sweeper. Even with Hidden Power Grass, Water-types such as Staryu beat Growlithe one-on-one, so it appreciates being paired with speedy physical wallbreakers such as Aipom and Taillow and defensive checks to Water-types such as Castform and Chinchou. Chinchou is a notable partner for its excellent type synergy with Growlithe, as it can easily KO the Rock- and Ground-types that Growlithe can struggle with, while Growlithe, in return, can eliminate the Grass-types that give Chinchou trouble. The aforementioned physical wallbreakers have the added benefit of breaking through special walls and tanks such as Castform and Delcatty, which also check Growlithe. Fast physical wallbreakers are themselves problematic to Growlithe before it has set up Agility, so Rock-types, Steel-types, and Shuppet support Growlithe by checking them. Special attackers like Elekid and Seaking can form effective offensive cores with Growlithe by weakening each other's checks. Finally, Spikes support from Snorunt can help soften up the opposing team to allow an end-game Growlithe sweep.</p> "
      },
      {
        "name": "Lead",
        "description": "<p>While Cyndaquil may appear to be the superior Fire-type lead because of its ability to deny Snorunt any entry hazards, Growlithe carves a niche with its stronger matchups against the general metagame. 76 Defense EVs and Intimidate let Growlithe always survive one Choice Band-boosted Double Edge from Aipom, which by extension lets it beat most physically offensive leads. Overheat is crucial, OHKOing common offensive leads such as Taillow and Delibird and having an 87.5% chance to OHKO Aipom. Flamethrower is a more spammable Fire-type STAB attack, though Fire Blast can be used instead for higher power at the cost of accuracy. Hidden Power Grass threatens Rhyhorn and also deals significant damage to Water-types such as Chinchou and Rock-types such as Nosepass. Toxic lets Growlithe cripple walls such as Lileep and non-Substitute Spoink. Crunch can be used instead to overwhelm Substitute variants of Spoink, which can otherwise use Growlithe as setup fodder. Lum Berry prevents Growlithe from getting statused by leads such as Butterfree.</p> <p>Growlithe best fits on offense and balance teams looking for a lead that can beat physically offensive leads. Given that Growlithe can't reliably deny Snorunt at least one layer of Spikes, it is best used on a team that either doesn't mind Spikes or has a spinner in the back, like Staryu. Water-types such as Staryu and Chinchou can usually beat Growlithe one-on-one if they switch into its Fire-type attacks, so special sponges such as Castform and Dustox make great partners. Chinchou itself is a great partner, with it able to break through the Water-, Rock-, and Ground-types that annoy Growlithe and spread Thunder Wave to shore up Growlithe's average Speed; in return, Growlithe can break through Grass-types for it. Physical wallbreakers such as Aipom and Taillow also work well because of their ability to break through both Water-types and special walls that could overwise beat Growlithe. If a team doesn't have a Rock-type, a Steel-type, or Shuppet, such as on certain hyper offense teams, Growlithe can sometimes be used as a check to physical wallbreakers like Choice Band Aipom and Taillow, though it shouldn't be a team's sole check to them.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Gangsta Spongebob", "user_id": 535530}], "teams": [{"name": "Quality checked by", "members": [{"username": "BP", "user_id": 272450}, {"username": "sleid", "user_id": 601970}]}, {"name": "Grammar checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}]}]}
  },
  "Magnemite": {
    "comments": "<h1>Other Options</h1> <p>Hidden Power Fire can be used to hit Grass-types such as Bayleef, Exeggcute, and Sunflora, and it also targets opposing Magnemite, while Hidden Power Ice can be used to also hit Lileep and still hit Ground-types. However, not being able to OHKO Rhyhorn or hit Chinchou is usually more detrimental than the benefits these Hidden Power types give. An EV spread of 252 HP / 4 SpA / 252 Spe and a Timid nature can be used to outspeed opposing Magnemite and niche options such as Larvitar. A Modest nature and a spread of 68 HP / 204 Def / 32 SpA / 204 Spe or 252 HP / 32 Def / 20 SpA / 204 Spe can be used to reduce Choice Band Pidgeotto’s Double Edge to a 3HKO while still maintaining a great offensive presence.</p> <h1>Checks and Counters</h1> <p><strong>Special Walls: Without Toxic, Magnemite is incapable of dealing with special walls such as Delcatty and Lileep. Magnemite also cannot deal with Dustox regardless of Toxic, and Dustox’s Whirlwind prevents it from utilizing Substitute properly. In addition, Chinchou can overwhelm Magnemite with its Water STAB moves even if Magnemite uses Hidden Power Grass.</p> <p><strong>Fighting and Ground Coverage: Physical attacker such as Aipom, Pidgeotto, and Taillow normally run Fighting and Ground coverage that 2HKOes or OHKOes Magnemite. Grimer without Curse can also run Hidden Power Fighting or Ground to hit Magnemite.</p> <p><strong>Fire Types: Growlithe and Cyndaquil can both OHKO Magnemite with their Fire STAB moves. They also sometimes run Lum Berry, which prevents Magnemite from statusing them from behind Substitute.</p> <p><strong>Magnet Pull: Magnet Pull Nosepass is able to trap and OHKO Magnemite with Earthquake. Opposing Hidden Power Fire Magnemite is also capable of removing it.</p> ",
    "sets": [
      {
        "name": "Substitute + Status",
        "description": "<p>Magnemite’s rare Steel typing and fantastic Special Attack stat allow it to function as a powerful utility Pokemon. Thunder Wave impairs fast attackers such as Aipom, Elekid, and Growlithe, while Toxic can be used instead to cripple walls such as Lileep, Delcatty, and Bayleef. Magnemite's STAB Thunderbolt threatens the tier's various Water- and Flying-types, like Pidgeotto, Delibird, Seaking, and Staryu. Thunderbolt also threatens neutral, non-special walls, such as Koffing, Shuppet, and Aron with heavy damage. Hidden Power Grass OHKOes Rhyhorn while also hitting Cubone and Chinchou. Magnemite's typing allows it to set up Substitute in front of passive walls such as Lileep, Delcatty, and non-Flamethrower Koffing and status the switch-in from behind the Substitute. The EV spread allows Magnemite to avoid an OHKO from Aipom's Choice Band Brick Break while the Speed EVs let it outspeed important Pokemon like Delcatty, Cubone, and Rhyhorn.</p> <p>Magnemite’s utility, defensive typing, and offensive presence allow it to fit on practically any team archetype. Offensive Pokemon like Aipom, Growlithe, and Rhyhorn appreciate Magnemite's ability to come in on passive walls, beating Lileep and Delcatty if it is running Toxic and Koffing with STAB Thunderbolt. Magnemite also completely walls Curse + Sleep Talk Grimer, which usually runs Sludge Bomb as its only attacking move. Slower offensive Pokemon like Pidgeotto, Cubone, and Castform also enjoy Thunder Wave Magnemite's capability to paralyze faster offensive threats for them. Magnemite appreciates defensive Pokemon like Koffing, Seaking, and Delcatty as switch-ins to Pokemon like Bonemerang Cubone, Growlithe, and Cyndaquil.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "JonAmon 25", "user_id": 494585}], "teams": [{"name": "Quality checked by", "members": [{"username": "BP", "user_id": 272450}, {"username": "Gangsta Spongebob", "user_id": 535530}]}, {"name": "Grammar checked by", "members": [{"username": "Sabelette", "user_id": 583793}]}]}
  },
  "Grimer": {
    "comments": "<h1>Other Options</h1> <p>Hidden Power Water can be used for its ability to smash Rhyhorn while at the same time providing a means to hit Aron and Ground-types such as Cubone for heavy damage. Likewise, Hidden Power Ground can be used to lure in Magnemite and Aron, and at the same time deal significant damage to Rhyhorn. However, it is difficult to justify using either Hidden Power over any of Grimer's other moves. Grimer can be used as a weather setter due to its access to Rain Dance, Sunny Day, and Explosion.</p> <h1>Checks and Counters</h1> <p><strong>Ground-types: Rhyhorn's double resistance to Poison means that even a boosted Sludge Bomb does negligible damage, while it can easily KO Grimer with Earthquake and abuse its presence to set up a Substitute and threaten the rest of Grimer's team. Other Ground-types such as Cubone and Numel can do the same, but their lower bulk and single resistance to Poison mean they can't switch in as easily, and due to its lack of Leftovers, Cubone in particular is very susceptible to Sludge Bomb's poison chance.</p> <p><strong>Steel-types: Magnemite and Aron are immune to Grimer's Sludge Bomb, meaning they cannot be harmed by non-Hidden Power sets.</p> <p><strong>Physical Wallbreakers</strong>: Physical wallbreakers such as Aipom and Taillow can overwhelm Grimer before it can set up.</p> <p><strong>Koffing: Koffing can run Taunt or Haze to completely shut down Grimer, with the former denying Grimer the ability to set up or use Rest and the latter letting Koffing easily PP stall Grimer.</p> <p><strong>Phazers</strong>: Phazers such as Dustox and Wailmer can stop Grimer's sweep, though this does not work against a Grimer that is the last Pokemon on its team.</p> ",
    "sets": [
      {
        "name": "CroMer",
        "description": "<p>Grimer's good bulk, combined with its access to Curse, lets it turn both prominent special attackers, such as Elekid and Staryu, and walls, such as Delcatty and Lileep, into setup fodder. Rest allows Grimer to avoid being worn down, while Sleep Talk prevents Grimer from being passive while it's asleep. Maximum investment into Grimer's special bulk allows it to sponge special hits as effectively as possible, complimenting Curse's Defense boost.</p> <p>Grimer best fits on teams looking for a win con that can also function as a special wall against threats such as Elekid and Cyndaquil. Grimer traditionally sees itself used on balance and bulky offense teams, though Rain offense can also make use of its high special bulk and ability to pick off weakened foes. Grimer is incapable of making any meaningful progress against Magnemite, Rhyhorn, and Aron, and thus checks to them are essential for it to function. The former can be handled by special tanks and walls, such as Chinchou or bulky variants of Castform, who have the added benefit of acting as a substitute special wall if Grimer is forced out while asleep. Rhyhorn and Aron, on the other hand, can usually be checked by Water- and Grass-types such as Staryu and Bayleef. Koffing is another notable partner, as while it and Grimer share the same typing, Koffing completely walls Rhyhorn and Aron, neutering 2 of Grimer's worst matchups, while in return, Grimer handles special attackers that give Koffing trouble. Delcatty is another partner that deserves a special mention, as it can use Wish and Heal Bell to keep Grimer healthy, but its cleric sets also struggle to touch the same Pokemon Grimer struggles with. Finally, Rock- and Steel-types such as Lileep and Magnemite make good partners due to their ability to check powerful Normal-type attackers such as Aipom and Taillow, who can usually overwhelm Grimer before it can set up.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Gangsta Spongebob", "user_id": 535530}], "teams": [{"name": "Quality checked by", "members": [{"username": "BP", "user_id": 272450}, {"username": "BeatsBlack", "user_id": 479897}]}, {"name": "Grammar checked by", "members": [{"username": "dex", "user_id": 277988}]}]}
  },
  "Onix": {"sets": [{"name": "Sun Setter"}]},
  "Voltorb": {"sets": [{"name": "Rain Setter"}]},
  "Exeggcute": {
    "comments": "<h1>Other Options</h1> <p>Exeggcute can opt to run a second status move like Toxic or Stun Spore over Psychic, but it would then be completely walled by Koffing alongside the other Poison-types that it already struggles with. It can also opt to run 136 Speed EVs to outspeed offensive Rhyhorn, although this greatly takes away from its role as a wall.</p> <h1>Checks and Counters</h1> <p><strong>Special Attackers: Delibird and Elekid both greatly threaten Exeggcute, but they have to worry about switching into Sleep Powder.</p> <p><strong>Fire-types: Growlithe and Cyndaquil are in a class of their own because they can safely come in on Exeggcute, since they commonly run Lum Berry, and outright OHKO it.</p> <p><strong>Bulky Poison-types: Poison-types like Grimer and Dustox aren't bothered by Exeggcute, as Grimer is 3HKOed by Psychic and Dustox 4HKOed. Grimer can bypass sleep with Sleep Talk, while Dustox is naturally faster and can threaten it with Toxic.</p> <p><strong>Choice Band Users: Aipom and Pidgeotto can come in and 2HKO Exeggcute, although they do have to worry about being put to sleep and taking chip damage on switch-ins.</p> <p><strong>Lileep: Lileep can sit on Exeggcute and wear it down with Toxic and Rock Slide while Exeggcute does very little back. Exeggcute can put it to sleep with Sleep Powder, but it finds difficulty taking it down one-on-one unless it gets favorable sleep turns and Special Defense drops.</p> <p><strong>Bug-Type Moves</strong>: With Exeggcute having a 4x weakness to Bug, it has to be aware of Seaking and Rhyhorn, which typically carry Megahorn and outspeed it.</p> ",
    "sets": [
      {
        "name": "Physical Wall",
        "description": "<p>Exeggcute is a physical wall that is able to pressure balance teams with Sleep Powder and Psychic. Sleep Powder is used for switch-ins such as Growlithe and Delibird, which can then allow a check to come in safely. It can also immobilize special walls, allowing special attackers to have an easier time taking them down. Psychic is its strongest move that can chunk Poison-types that want to come in on Exeggcute like Koffing and Grimer. It also does great damage to offensive switch-ins like Elekid, Cyndaquil, and Delibird, which limits their opportunity to come in more than once on it. Giga Drain does well against the aforementioned offensive threats as well as offensive Water-types like Seaking or Staryu that want to come in and KO it. Synthesis is a reliable form of recovery to keep Exeggcute around to do its job for longer.</p> <p>Exeggcute is preferred on balance and offense teams who are looking for a physical wall that can open up opportunites for its teammates. Sleep Powder helps set-up sweepers like Growlithe, Cubone, and Larvitar come in and possibly get off a free boosting move or Substitute. Special walls such as Nosepass and Delcatty can work well alongside Exeggcute, since it can deal with physical attackers like Cubone and Aron for them. On the other hand, these special walls can help Exeggcute because they can deal with special attackers like Growlithe and Elekid that want to come in on Exeggcute, although they have to be mindful of coming into a STAB-boosted Psychic more than once. It also appreciates teammates such as Magnemite and Aron that can take on Poison-types like Grimer and Dustox. Aron also has the added benefit of handling the Choice Band users like Pigdeotto and Aipom that can 2HKO Exeggcute with their STAB attacks; however, Aron needs to be aware of their Fighting-type coverage. Although, Nosepass performs this job better, since it can wall those physical attackers and cripple them with Thunder Wave.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "sleid", "user_id": 601970}], "teams": [{"name": "Quality checked by", "members": [{"username": "Gangsta Spongebob", "user_id": 535530}, {"username": "BP", "user_id": 272450}]}, {"name": "Grammar checked by", "members": [{"username": "Tea Guzzler", "user_id": 577920}]}]}
  },
  "Cubone": {
    "comments": "<h1>Other Options</h1> <p>Rock Slide can be used to hit Flying-types such as Pidgeotto, guaranteeing an OHKO. However, Double-Edge is preferred, as it still hits Flying-types relatively hard with perfect accuracy.</p> <h1>Checks and Counters</h1> <p><strong>Grass-types: Grass-types such as Sunflora and Bayleef resist Earthquake and are able to threaten Cubone back with Grass-type attacks, although they must be careful of being hit by Double-Edge on the switch.</p> <p><strong>Koffing: Koffing is one of the only Pokemon in the tier able to avoid a 2HKO from Cubone thanks to Levitate and is able to answer back with a burn, Explosion, or Hidden Power Grass.</p> <p><strong>Strong Special Attackers</strong>: Due to Cubone's low special bulk and poor Speed, special attackers such as Cyndaquil, Seaking, and Chinchou can revenge kill it, although they cannot switch into Cubone.</p> <p><strong>Flying-types: Flying-types like Delibird and Pidgeotto can pivot in on Earthquake and threaten Cubone out, although they must be careful of Cubone's coverage moves.</p> <p><strong>Residual Damage: Cubone's reliance on Thick Club for its firepower means it is not able to hold Leftovers, making it vulnerable to residual damage from Spikes and Toxic, which make it easier to revenge kill.</p> ",
    "sets": [
      {
        "name": "Swords Dance",
        "description": "<p>Cubone is a potent wallbreaker in ZU due to its incredibly high Attack thanks to Thick Club that can be boosted even further with Swords Dance. It also boasts decent coverage moves for Pokemon such as Koffing and Bayleef. Cubone is able to find opportunities to come in on passive Pokemon, like Delcatty and Dustox, and Choice-locked Pokemon like Nidorino and set up with Swords Dance. Earthquake is Cubone's STAB-boosted attack of choice, with it OHKOing Pokemon such as Rhyhorn at +0 and Lileep at +2. Bonemerang can be used instead to beat Substitute versus Pokemon like Rhyhorn, but it comes at the cost of less accuracy when compared to Earthquake. Double-Edge is Cubone's strongest option into Koffing, doing about half of its HP and almost being able to OHKO it at +2 while additonally hitting Grass-types such as Bayleef, which are Cubone's best defensive answers. It also threatens Flying-types such as Pidgeotto and Taillow that may want to pivot into Earthquake. An Adamant nature increases the odds of OHKOing Pidgeotto with Double-Edge, but it comes at the cost of losing Speed, meaning foes like Delcatty can outrun Cubone. Rock Head allows Cubone to avoid the recoil from Double-Edge that would put it in range of Choice Band Pidgeotto and Taillow. Substitute is used to avoid status from Koffing and to help Cubone deal with revenge killers like Seaking and Aipom.</p> <p>Cubone is mainly found on balance and some offense teams that prefer its power to the defensive utility that Ground-types like Rhyhorn may offer. Cubone also appreciates having defensive Pokemon to fall back on, as its defenses are rather poor, and its low Speed makes it liable to be revenge killed quite easily. Pokemon like Elekid and Mankey appreciate Cubone's ability to break through or trade with Pokemon like Dustox, Delcatty, and Koffing, which allows them to clean late-game. Cubone can struggle into strong special attackers such as Seaking and Growlithe. To help alleviate this issue, specially defensive walls like Dustox and Delcatty can be good partners. Particularly strong physical attackers such as Choice Band Aipom can also threaten to OHKO Cubone after some chip, and Pokemon like Pidgeotto and Taillow can also threaten to KO it. Pairing Cubone with Rock-types like Rhyhorn and Lileep can help remedy this, while Shuppet can also be useful to pivot into these attackers. Grass-types such as Sunflora and Bayleef can also attempt to pivot in on Cubone's Ground moves and threaten back with their Grass moves. Cubone thus appreciates partners like Cyndaquil and Growlithe to threaten these answers.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "plznostep", "user_id": 595639}], "teams": [{"name": "Quality checked by", "members": [{"username": "sleid", "user_id": 601970}, {"username": "Gangsta Spongebob", "user_id": 535530}]}, {"name": "Grammar checked by", "members": [{"username": "Tea Guzzler", "user_id": 577920}]}]}
  },
  "Rhyhorn": {
    "comments": "<h1>Other Options</h1> <p>Due to Rhyhorn's abysmal Speed, offensive Rhyhorn sets can run an EV spread with more HP than Speed investment in order to better tank hits from threats such as Aipom and Taillow, though this comes at the risk of being outsped by opposing Rhyhorn. Toxic can be used to cripple switch-ins, though Megahorn is generally superior due to it immediately threatening Grass-types. Swords Dance can allow Rhyhorn to act as a sweeper, but its terrible Speed leaves it threatened by way too many foes, and it remains countered by Koffing. Choice Band may be used with Double-Edge to maximize Rhyhorn's immediate power, though without Substitute Rhyhorn is much more reliant on prediction, and without Leftovers Rhyhorn is worn down very quickly.</p> <h1>Checks and Counters</h1> <p><strong>Grass-types and Grass-type Moves: Grass-types such as Bayleef and Exeggcute easily OHKO Rhyhorn, though they must be wary of switching into Megahorn. Other threats such as Butterfree and Delcatty can easily do the same with their Grass-type coverage unless Rhyhorn invests heavily in Special Defense.</p> <p><strong>Water-types: Water-types such as Staryu and Seaking easily outspeed and OHKO Rhyhorn. Staryu is notable due to its access to Recover, allowing it to switch in and recover off any sustained damage repeatedly.</p> <p><strong>Koffing: Koffing's combination of high physical bulk, immunity to Earthquake and Toxic, neutrality to Rock Slide, and resistance to Megahorn make it the perfect Rhyhorn switch-in. Once on the field, it instantly threatens Rhyhorn with Hidden Power Water or Grass, Will-O-Wisp, or Toxic. However, Koffing must use Hidden Power with caution, as Rhyhorn can threaten heavy damage in return with Counter.</p> <p><strong>Cubone</strong>: Cubone outspeeds Rhyhorn, easily tanks an Earthquake, and can OHKO Rhyhorn with Bonemerang, which even threatens Rhyhorn behind a Substitute due to it hitting twice.</p> ",
    "sets": [
      {
        "name": "Offensive",
        "description": "<p>Offensive Rhyhorn is the premier physical tank of ADV ZU, forgoing the sheer walling prowess of competition such as Lileep and Nosepass to become an exceptionally dangerous wallbreaker once it sets up a Substitute, something it can easily do due to the tier's plethora of Normal- and Flying-types. Rhyhorn's high Attack allows its STAB Earthquake to threaten Pokemon that do not resist Ground or have huge physical bulk, which is complemented by its STAB Rock Slide targeting Bug- and Flying-types. Rhyhorn's coverage is further augmented by Megahorn, which threatens Grass-types, such as Lileep, Bayleef, and Exeggcute. Maximum Attack investment coupled with an Adamant nature maximizes Rhyhorn's offensive presence, crucially 2HKOing the otherwise unbreakable Lileep. Maximum Speed investment lets Rhyhorn outpace certain walls, such as Nosepass and Exeggcute, while also maximizing its odds to outspeed opposing Rhyhorn.</p> <p>Offensive Rhyhorn best fits on offensive and balance teams looking for both a wallbreaker and a check to certain physical wallbreakers, such as Aipom, Taillow, and Pidgeotto. Due to Rhyhorn's lack of reliable recovery and the risk of heavy damage from the coverage of the aforementioned wallbreakers, another Rock- or Steel-type, such as Nosepass or Magnemite, can pick up Rhyhorn's slack if it gets KOed prematurely. Given Rhyhorn's low Special Defense and weaknesses to Water, Grass, and Ice, special walls such as Dustox, Sunflora, Grimer, and Delcatty are essential. The latter also provides Heal Bell support in case Rhyhorn gets statused. Castform is another notable partner, as its high special bulk and strong offensive presence provides great synergy with Rhyhorn's own offensive presence and physical bulk. Paralysis support from Pokemon such as Butterfree and Chinchou greatly aids Rhyhorn by helping to mitigate its low speed as an issue. Finally, special wallbreakers such as Cyndaquil, Chinchou, and Growlithe appreciate Rhyhorn breaking through many of their switch-ins, such as Grimer, while in return they can break past its one true counter, Koffing.</p> "
      },
      {
        "name": "Lure",
        "description": "<p>Rhyhorn's Electric-type immunity coupled with its offensive variant being OHKOed by Elekid's Hidden Power Grass make specially defensive Rhyhorn a great option for luring it. STAB Earthquake coupled with Rhyhorn's stellar Attack allows it to threaten any Pokemon that lacks resistance to Ground-type moves. Rock Slide allows Rhyhorn to threaten Flying-types, such as Pidgeotto, Taillow, Delibird, and Butterfree. Counter is a viable option over Rock Slide, as it provides Rhyhorn with an option to remove Koffing thanks to its use of Hidden Power Grass. Megahorn provides Rhyhorn with coverage against Grass-types, such as Bayleef, Lileep, and Exeggcute. Protect allows Rhyhorn to net more recovery from Leftovers while also scouting against Choice Band users. Rhyhorn's bulk investment allows it to survive Elekid's Hidden Power Grass from full health while also avoiding the 2HKO by Fighting-type coverage from Pidgeotto, Taillow, and non-Choice Band Aipom. 124 Speed EVs allow Rhyhorn to outspeed Exeggcute with no speed investment.</p> <p>Rhyhorn finds the most success on offensive and balanced teams that require a secondary Elekid check or an offensive Flying-type check. Physical wallbreakers such as Aipom, Pidgeotto, and Taillow and Water-types like Staryu and Seaking all appreciate Rhyhorn's effectiveness at removing Elekid. Rhyhorn must be in pristine health to check Elekid, so other Pokemon that resist Normal-types such as Nosepass, Magnemite, and Lileep all pair well with it. Special walls like Dustox, Sunflora, and Delcatty can help check special attackers that threaten Rhyhorn, such as Staryu, Seaking, and Chinchou. Delcatty is especially useful, as it can provide Rhyhorn with Wish and Heal Bell support to increase its longevity. Rhyhorn appreciates Rapid Spin support from Pineco and Staryu, or an anti-Spikes lead like Cyndaquil or Butterfree in order to maintain its HP for Elekid. If Rhyhorn is using Rock Slide, then special attackers, such as Chinchou, Elekid, and Growlithe can all threaten Koffing. If Rhyhorn is using Counter then Pokemon that appreciate Koffing's removal such as Cubone, Grimer, and Aipom pair well with it.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Gangsta Spongebob", "user_id": 535530}, {"username": "BP", "user_id": 272450}], "teams": [{"name": "Quality checked by", "members": [{"username": "BP", "user_id": 272450}, {"username": "BeatsBlack", "user_id": 479897}, {"username": "Gangsta Spongebob", "user_id": 535530}]}, {"name": "Grammar checked by", "members": [{"username": "Deezcastforms", "user_id": 423085}, {"username": "Sabelette", "user_id": 583793}]}]}
  },
  "Horsea": {"sets": [{"name": "Offensive Rain Dance"}]},
  "Seaking": {
    "comments": "<h1>Other Options</h1> <p>Hidden Power Ground can be used on its mixed set to lure and remove opposing Chinchou, though Seaking almost always prefers the option to check Dustox. Ice Beam can be run instead of Hidden Power to threaten Grass-types like Lileep and Bayleef, though it sees a steep overlap with Megahorn.</p> <h1>Checks and Counters</h1> <p><strong>Special Walls: Specially defensive Pokemon like Dustox and Delcatty can wall Seaking if it's not the mixed or rain variant.</p> <p><strong>Castform: Castform is the premier check to the Rain Dance set, as it stalls Seaking's turns with Protect and threatens it with Thunderbolt. Castform must be wary of Seaking's other sets, as it doesn't appreciate Megahorn or being crippled by Toxic. Moreover, Castform can also prevent Seaking taking advantage of rain thanks to Sunny Day.</p> <p><strong>Electric-Types</strong>: Chinchou and Elekid are both able to threaten Seaking with their STAB-boosted Thunderbolt. However, due to Seaking's bulk it manages to avoid being OHKOed.</p> <p><strong>Physical Attackers: Seaking is outpaced and OHKOed by common Choice Band wallbreakers such as Aipom, Pidgeotto, and Taillow.</p> ",
    "sets": [
      {
        "name": "Mixed",
        "description": "<p>Seaking has cemented itself as a defining threat in ADV ZU thanks to its excellent Attack, decent bulk, and coverage options. Moreover, Seaking's inability to be crippled by Will-O-Wisp means it can find more opportunitites to switch into Koffing, unlike most other attackers. Protect in conjunction with Leftovers helps Seaking maintain its longevity, providing it with more opportunities to wallbreak. STAB-boosted Hydro Pump is able to 2HKO Koffing and threatens neutral targets as well as Ground-types like Cubone and Rhyhorn. Megahorn is able to threaten Grass-types, most notably securing a 2HKO against Lileep. Hidden Power Flying provides Seaking with an alternative and more accurate option against Grass-types and a way to threaten Dustox. Alternatively, Hidden Power Rock can be used to threaten Flying-types such as Pidgeotto and Taillow while still threatening Dustox. Seaking's Attack investment ensures it is able to 2HKO Dustox with Hidden Power.</p> <p>Seaking's coverage and bulk allow it to excel on offense and balance teams. Specially defensive Pokemon such as Dustox, Castform, and Sunflora can check Elekid and Chinchou for Seaking. In return, Seaking can threaten Pokemon that check these special walls such as Rhyhorn, Cubone, and opposing Castform. Physical wallbreakers such as Aipom, Pidgeotto, and Nidorino pair well with Seaking, as they appreciate the pressure Seaking applies against physical walls like Lileep, Koffing, and Nosepass. Likewise, Seaking appreciates the added pressure these physical breakers apply to its checks such as Delcatty, Chinchou, and Castform. Seaking struggles against these same physical attackers, so physical walls such as Lileep, Nosepass, and Bayleef make great partners. Pivots such as Koffing, Magnemite, Shuppet, and Aron provide Seaking with more opportunities to come in.</p> "
      },
      {
        "name": "Rain Sweeper",
        "description": "<p>Seaking's access to Swift Swim in conjunction with its decent Speed and exceptional bulk makes it the best Rain Dance sweeper in ADV ZU. Rain Dance allows Seaking to set rain for itself which makes Seaking not as reliant on its teammates. Hydro Pump threatens anything not resistant or immune to Water. This includes prominent specially defensive Pokemon such as Dustox, Delcatty, and Grimer. Alternatively, Seaking can opt to use Surf over Hydro Pump for the PP, and accuracy increase. Hidden Power Grass allows Seaking to threaten opposing Water-types such as Chinchou, Staryu, and other Seaking. Megahorn threatens Castform and Grass-types such as Bayleef and Sunflora that may attempt to switch in on a Hydro Pump or Surf. Lum Berry ensures Seaking can avoid being crippled by status users like Butterfree and Chinchou.</p> <p>This set functions best on teams that can make full use of Rain Dance. Voltorb is used in the lead slot so it can use Rain Dance and then Explosion, which brings in Seaking for little cost. Other Swift Swim users such as Horsea and Kabuto pair well with Seaking. Kabuto is worth noting as it can threaten Castform, a common weather check. Secondary Rain Dance users such as Horsea, Illumise, and Castform all pair well with Seaking. Horsea and Seaking are usually used together, as they function almost entirely the same as special attackers. Horsea is worth noting as it helps weaken shared checks. Pokemon that can remove Electric-types such as Cubone, Chinchou, and Grimer all pair well with Seaking. Grimer is worth mentioning, as Seaking is able to easily remove Pokemon that check it like Rhyhorn so that it can set up. Castform can check opposing weather teams for Seaking thanks to its great coverage and access to Forecast. Seaking can also be used outside of rain on balance or offense teams. Defensive pivots such as Koffing, Sunflora, and Nosepass all pair well with it. Sunflora in particular is able to check Elekid and Chinchou, two of Seaking's biggest obstacles. Physical wallbreakers such as Aipom, Pidgeotto, and Cubone can remove specially defensive Pokemon for Seaking like Delcatty and Dustox.</p> "
      },
      {
        "name": "Toxic + Protect",
        "description": "<p>Seaking's decent bulk coupled with its respectable Speed allow it to act as a solid Toxic user. Toxic allows Seaking to cripple walls and bulky Pokemon that may try and switch in such as Lileep, Castform, and Chinchou. Seaking's Surf can be used to threaten opposing offensive and physically defensive Pokemon like Aipom, Koffing, and Nosepass. Megahorn provides Seaking valuable coverage against Grass-type Pokemon such as Bayleef, Lileep, and Exeggcute. Protect enables Seaking to stall for more Toxic damage while also allowing it to more reliably gain passive recovery and scout Choice Band attackers such as Nidorino, Aipom, and Pidgeotto.</p> <p>Seaking fits best on defensive and balance teams that appreciate having support from status as well as a defensive Water-type. Defensive Grass-types such as Sunflora, Bayleef, and Lileep appreciate Seaking's effectiveness at checking Growlithe and Cyndaquil. Likewise, Seaking appreciates these Grass-types, as they check Chinchou and Elekid. Seaking pairs well with physical attackers such as Aipom, Nidorino, and Pidgeotto, as they can threaten Delcatty, the most prominent Heal Bell user. Other Toxic users such as Nosepass, Magnemite, Koffing, and Dustox can help support Seaking in its role as a Toxic user due to its lack of reliable recovery. Magnemite, Nosepass, and Koffing are worth noting, as they can sponge hits from physical attackers that Seaking tends to struggle with otherwise. Physical wallbreakers such as Rhyhorn, Cubone, and Aipom can threaten Dustox and Grimer, which otherwise render Seaking useless with their high Special Defense and Toxic immunity.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "BP", "user_id": 272450}], "teams": [{"name": "Quality checked by", "members": [{"username": "Gangsta Spongebob", "user_id": 535530}, {"username": "sleid", "user_id": 601970}]}, {"name": "Grammar checked by", "members": [{"username": "Tea Guzzler", "user_id": 577920}]}]}
  },
  "Staryu": {
    "comments": "<h1>Other Options</h1> <p>Hidden Power Grass can 2HKO Chinchou, though Staryu can’t easily afford to give up Ice Beam or Thunderbolt. Psychic can 3HKO Dustox after a layer of Spikes and Grimer without resorting to Hydro Pump, though its use is limited outside those two targets. Toxic cripples special walls like Lileep and Sunflora, though Staryu is already strapped for moveslots and cannot afford space for it.</p> <h1>Checks and Counters</h1> <p><strong>Grass-types: Grass-types like Lileep, Sunflora, and Bayleef can switch into Staryu, avoid being 2HKOed by Ice Beam, and threaten it back with their STAB attacks.</p> <p><strong>Specially Defensive Walls: Dustox and Delcatty have enough special bulk to stomach any two hits from full health and safely wall Staryu. They can proceed to pressure it with either Toxic or Body Slam, respectively. Grimer can set up Curse in front of Staryu with its great special bulk, forcing it out.</p> <p><strong>Electric-types: Chinchou tanks all of Staryu's moves and can threaten it back with Thunderbolt. Faster Electric-types like Elekid and Voltorb can offensively check Staryu but cannot switch into it.</p> ",
    "sets": [
      {
        "name": "Special Attacker",
        "description": "<p>With fantastic Speed, great coverage, and respectable Special Attack, Staryu stands out as a great Water-type in ADV ZU. Hydro Pump is Staryu's prefered STAB option; Surf is an alternative, trading power for PP and accuracy. Thunderbolt hits Water-types like Seaking and opposing Staryu hard. Ice Beam targets Grass-types like Bayleef and Lileep and pressures them into using their recovery moves. Rapid Spin makes it an emergency Spikes remover. Recover alongside Natural Cure makes Staryu a reliable status absorber against defensive stalwarts like Dustox and Koffing, as well as being a consistent offensive threat. Maximum Speed and a Jolly nature allow Staryu to Speed tie with Aipom, Taillow, and opposing Staryu.</p> <p>Staryu operates well as a revenge killer, picking off slower foes like Seaking, Rhyhorn, and Pidgeotto with relative ease. On teams vulnerable to Spikes, Staryu is a great pick thanks to Rapid Spin. However, it must be aware of sturdy special walls like Lileep, Delcatty, and Dustox, since they can wall it with ease. As teammates, the aforementioned special walls—alongside specially defensive variants of Rhyhorn—can check Elekid, one of Staryu's worst matchups; Elekid in turn can be used to check other Staryu. Physical wallbreakers such as Aipom, Cubone, and Pidgeotto are especially good partners, as they have trouble dealing with Pokemon like Koffing; Staryu can switch into Will-O-Wisp and threaten Koffing due to its Natural Cure and Koffing's low Special Defense. Special wallbreakers such as Cyndaquil and Growlithe can wallbreak early-game to let Staryu clean late-game.</p> "
      },
      {
        "name": "Defensive",
        "description": "<p>With a bulkier EV spread, Staryu is the tier's premier Rapid Spin user with its acceptable bulk and high Speed. Thunderbolt targets Water-types like Seaking and opposing Staryu. Recover allows Staryu to reliably use Rapid Spin, as well as negating Spikes damage. Natural Cure allows it to absorb status from Koffing and Dustox.</p> <p>Teams that struggle against Spikes teams appreciate Staryu absorbing status, providing Speed control, and being a good Rapid Spin user, though Staryu should ideally remain healthy to continually clear Spikes. Special walls like Delcatty and Dustox can easily take its hits, so physical wallbreakers like Aipom, Rhyhorn, and Taillow are appreciated. Cleaners like Elekid, Aipom, and Seaking can sweep more easily without enemy Spikes, and they are free to run other items besides, like Lum Berry. Bulky Grass-types like Bayleef and Sunflora can easily switch into Staryu and retaliate, so it appreciates Fire-types like Cyndaquil and Growlithe, which can threaten them back. Given its merely good power, it can struggle to secure KOs, so it appreciates both physical and special walls to fall back on like Lileep, Dustox, and Delcatty; the latter two can check Elekid and spread status.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "5Dots", "user_id": 543866}], "teams": [{"name": "Quality checked by", "members": [{"username": "Gangsta Spongebob", "user_id": 535530}, {"username": "BP", "user_id": 272450}]}, {"name": "Grammar checked by", "members": [{"username": "Tea Guzzler", "user_id": 577920}, {"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Chinchou": {
    "comments": "<h1>Other Options</h1> <p>Chinchou can be used on teams that utilize Rain Dance as a wallbreaker or Rain Dance user. Thunder gives Chinchou an even more powerful Electric-type STAB move, which allows it to OHKO opposing Seaking and heavily chip foes resistant to Electric. Hydro Pump in conjunction with Mystic Water in rain allows Chinchou to 2HKO common switch-ins such as Dustox, Delcatty, and physically defensive Lileep. Surf is always an option over Hydro Pump for reliable accuracy and more PP, but the power difference is noticeable, especially when considering Chinchou’s mediocre Special Attack. Hidden Power Grass can be used in order to threaten opposing Chinchou, but the loss of Ice Beam makes it seldom worth it.</p> <h1>Checks and Counters</h1> <p><strong>Special Walls: Pokemon such as Delcatty, Dustox, Lileep, and Sunflora can all wall Chinchou. However, Lileep and Sunflora must be wary of Toxic, as it severely limits their ability to wall Chinchou.</p> <p><strong>Bulky Attackers: Seaking can threaten and remove Chinchou if it hasn't taken much damage. Sunflora and Castform can both wall and OHKO Chinchou with their STAB attacks, though Castform should remain wary of status. Sunflora is worth noting, as it can absorb status with Lum Berry and use Chinchou as a free window to set Sunny Day.</p> <p><strong>Physical Attackers: Chinchou's poor Defense and average Dpeed means it's able to be forced out or OHKOed by a plethora of physical attackers such as Aipom, Pidgeotto, and Taillow.</p> ",
    "sets": [
      {
        "name": "Offensive",
        "description": "<p>Chinchou's mediocre Special Attack is more than made up for thanks to its typing and strong coverage. Thunder Wave provides support for itself and slower teammates such as Cubone, Rhyhorn, and Shuppet. It also allows Chinchou to cripple Pokemon that are immune to Toxic such as Nidorino, Dustox, and Magnemite. Toxic can be run specifically for Lileep, as all defensive Lileep sets avoid a 2HKO from Ice Beam. Hydro Pump is Chinchou's main STAB-boosted attack and is able to chip or OHKO Pokemon that may try to switch into Thunderbolt such as Elekid, Rhyhorn, and Spoink. Thunderbolt allows Chinchou to hit opposing Water-types such as Seaking, Horsea, and Staryu. Ice Beam provides Chinchou with coverage that keeps it from being walled by Grass-types like offensive Sunflora, Exeggcute, and physically defensive Bayleef. A Modest nature allows for the strongest damage output, but Timid notably outspeeds all Cyndaquil, unboosted Growlithe, and neutral-natured Castform.</p> <p>Chinchou fits on balance and offensive teams that benefit from its unique typing and coverage. Pokemon such as Aipom, Pidgeotto, and Delibird all appreciate Chinchou's ability to check Elekid. These Pokemon can also weaken or remove specially defensive Pokemon that check Chinchou such as Dustox, Castform, Sunflora, and Grimer. Slower attackers like Cubone, Croconaw, and Rhyhorn all benefit from Chinchou's access to Thunder Wave. Chinchou appreciates bulky attackers that complement it offensively with their added bulk such as Castform, Seaking, and Grimer. Castform is worth noting, as it can act as a secondary check against Pokemon that Chinchou struggles to check alone like Lileep and opposing Chinchou. Fire-types such as Cyndaquil, Growlithe, and Numel all pair well with Chinchou, as they threaten Dustox and Grass-types. Alternatively, special walls such as Delcatty and Dustox can help remedy Chinchou's weakness to Grass-types. Delcatty can also provide Chinchou with Wish and Heal Bell support, thus maintaining its longevity and providing it with more opportunities to use its status move. Physical walls such as Lileep and Nosepass can wall Pokemon that threaten Chinchou such as Castform, Aipom, and Delibird.</p> "
      },
      {
        "name": "Defensive",
        "description": "<p>Chinchou can make use of its unique defensive profile thanks to its above-average HP stat, access to Volt Absorb, and use of Rest and Sleep Talk. Thunderbolt is Chinchou's primary STAB attack, which allows it to check foes that take advantage of Rain Dance such as Horsea, Luvdisc, and a weakened Seaking. Surf allows Chinchou to threaten Pokemon that are immune to or resist Thunderbolt such as Rhyhorn, Magnemite, and Cubone. Ice Beam can be used instead to chip Grass-types that would otherwise come in for free such as Lileep, Bayleef, and Sunflora, and it also provides nearly-unresisted neutral coverage, only unable to significantly damage Magnemite and opposing Chinchou.</p> <p>Chinchou works best on defensive and balance teams that require a dedicated check to rain and Electric- and Fire-types. Physical walls such as Koffing, Lileep, Nosepass, and Bayleef appreciate Chinchou checking special attackers for them. Likewise, Chinchou appreciates their ability to check physical attackers for it. Koffing is worth noting thanks to its ability to check physical attackers and Ground-types, while Chinchou threatens special attackers for Koffing. Due to the added passiveness of Rest, Chinchou appreciates Heal Bell support from Delcatty. Pokemon that can check Grass-types such as Growlithe, Cyndaquil, and Delibird pair well with Chinchou.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "BP", "user_id": 272450}], "teams": [{"name": "Quality checked by", "members": [{"username": "Gangsta Spongebob", "user_id": 535530}, {"username": "BeatsBlack", "user_id": 479897}]}, {"name": "Grammar checked by", "members": [{"username": "Tea Guzzler", "user_id": 577920}]}]}
  },
  "Aipom": {
    "comments": "<h1>Other Options</h1> <p>Body Slam can be used over Return to inflict paralysis, but it is generally too inconsistent to be worthwhile. Focus Punch is Aipom's strongest coverage option against Rock- and Steel- types, though if locked into Focus Punch, Aipom is extremely exploitable, and non-Choice Band sets still don't OHKO many Rock- and Steel-types. Aipom can run a dedicated SubPunch set to more easily use Focus Punch, but then Aipom cannot use Baton Pass, which it is forbidden to use with Substitute. An Adamant nature could be used for more power, though no longer outspeeding Delibird or tying with threats such as Taillow usually makes this not worth it.</p> <h1>Checks and Counters</h1> <p><strong>Rock- and Steel-types: Rock- and Steel-types such as Nosepass, Magnemite and Aron can easily switch into Double-Edge and force Aipom out. Rhyhorn and Lileep deserve a special mention, as the former is exceptionally dangerous if Aipom lets it get a free Substitute, while the latter has Recover. However, Brick Break still does sizable damage to most Rock- and Steel-types, especially with Choice Band, then OHKOing or 2HKOing all but Lileep and Nosepass. Toxic also cripples the Rock-types meant to check it.</p> <p><strong>Shuppet: Shuppet is immune to Aipom's common attacks bar Shadow Ball, and it can set up a Substitute while forcing it out. However, it must be wary of status and Shadow Ball.</p> <p><strong>Faster Threats</strong>: Though only Voltorb, Luvdisc, and Elekid naturally outspeed Aipom, they can easily force it out, especially after it has been chipped into their KO ranges. Additionally, setup sweepers such as Bagon and Cyndaquil, and weather sweepers such as Seaking and Sunflora, can outspeed and often even OHKO Aipom under optimal conditions.</p> <p><strong>Residual Damage: The high amount of recoil from Double-Edge wears Aipom down very quickly, especially when compounded with Spikes and Toxic.</p> ",
    "sets": [
      {
        "name": "Choice Band",
        "description": "<p>Choice Band Aipom's powerful Double-Edge and blistering fast base 85 Speed make it an excellent lead, mid-game wallbreaker, and cleaner. Brick Break serves as crucial coverage to hit Double-Edge's most common switch-ins, Rock- and Steel-types such as Rhyhorn and Magnemite, super effectively. Shadow Ball targets Shuppet, the only Ghost-type in the tier, but if that isn't a concern, Aipom can run Return instead to reduce the need for taking Double-Edge recoil. Finally, Baton Pass can scout switches, allowing Aipom's team to maintain momentum, something particularly important if Choice Band Aipom is used as a lead.</p> <p>Choice Band Aipom best fits on offense and balance teams looking for a formidable progress-maker. In return, it appreciates physical and special walls such as Koffing, Lileep, and Dustox: they can switch into threats that either outspeed Aipom or exploit its Choice lock to switch in, such as Elekid and Rhyhorn, respectively. Additionally, while it does possess Brick Break to hit Rock- and Steel-types, Choice Band Aipom enjoys support from special wallbreakers such as offensive Chinchou and Growlithe to deal with those threats, as they minimize its need for prediction. Aipom, in return, handles troublesome special walls. Toxic support also works very well against Rock-types, notably hindering Aipom's hardest counter, Lileep. Choice Band Aipom breaking through special walls also makes it a good partner for Elekid, which in turn threatens Pokemon that Speed tie Aipom, such as opposing Aipom, Taillow, and Staryu. Finally, other physical wallbreakers such as Taillow and Pidgeotto work very well with Aipom, as they can weaken each other's checks while offering a backup if the other faints.</p> "
      },
      {
        "name": "Lead Utility",
        "description": "<p>Lead Utility Aipom leverages its high Speed and strong utility options to defeat most other leads, and it's also a solid revenge killer later in the game. Taunt, Thunder Wave, and Toxic most notably deny Endure setup from opposing leads, with the former also stopping Spikes and recovery from walls, Thunder Wave paralyzing targets to help slower teammates, and Toxic allowing it to outright break past walls. Double-Edge is Aipom's strongest attack, allowing it to OHKO many leads such as Snorunt and Cyndaquil, while Brick Break lets it hit Rock- and Steel-types for significant damage. Baton Pass lets Aipom scout switches and gain momentum, making it extremely hard to pin down and KO due to its high Speed. Silk Scarf allows Aipom to somewhat maintain its role as a wallbreaker if it is not running Toxic, though Leftovers can be used instead to increase its longevity by offsetting some of the recoil from Double-Edge.</p> <p>Lead Utility Aipom best fits on offense and balance teams as a versatile lead, bringing respectable offensive presence and utility later in the game. If it's not running Toxic, physical and special wallbreakers such as Rhyhorn and Chinchou are essential, as they break through walls Aipom struggles to beat, such as Nosepass and Lileep. Even with Toxic, it still appreciates special wallbreakers, as Koffing remains an issue. Walls like Dustox and Koffing can switch into threats that can outdamage Aipom, like the aforementioned walls and also offensive threats like Elekid and Rhyhorn, and threaten to status or weaken them into KO range of Aipom's attacks. Finally, if Aipom's running Thunder Wave, slow wallbreakers such as Rhyhorn, Cubone, and Croconaw appreciate their targets being made slower, as do walls such as Lileep and Nosepass.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Gangsta Spongebob", "user_id": 535530}], "teams": [{"name": "Quality checked by", "members": [{"username": "BP", "user_id": 272450}, {"username": "wooper", "user_id": 393917}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Sunflora": {
    "comments": "<h1>Other Options</h1> <p>Grass Whistle can be used to put opposing Pokemon to sleep, but its poor accuracy makes it hard to justify over Synthesis. In the same vein, Substitute can be run to take advantage of Pokemon that might choose to switch out, but Synthesis is generally the better option to maintain Sunflora's longevity. Sunflora can opt to run maximum Speed with a Timid nature to outspeed Elekid with Chlorophyll active but this greatly weakens it offensively and is seldom worth the investment.</p> <h1>Checks and Counters</h1> <p><strong>Castform: Any Castform set that carries a physical move can make quick work of Sunflora. Addtionally, Castform's access to Forecast means that it can easily take a Solar Beam when sun is active and strike back with a boosted Fire Blast.</p> <p><strong>Physical Wallbreakers</strong>: Physical wallbreakers such as Aipom, Pidgeotto, and Nidorino can all OHKO Sunflora with their STAB attacks.</p> <p><strong>Fire-types: Cyndaquil and Growlithe are able to wall Sunflora naturally as Fire-types and can 2HKO it with their STAB attacks. Growlithe is worth noting due to it being able to use Sunflora as setup fodder with Agility.</p> <p><strong>Delcatty: Delcatty can waste Sunflora's sun turns thanks to its access to Wish and Protect. Addtionally, Sunflora's poor Defense means that Body Slam can heavily threaten it.</p> <p><strong>Status users</strong>: Status spreaders such as Butterfree, Magnemite, Lileep, and Dustox can hinder Sunflora's ability to act as a proper wall or cleaner. All must be wary of Sunflora when sun is active, however.</p> <p><strong>Megahorn users: Without Chlorophyll activation, Seaking and Rhyhorn outspeed and can OHKO Sunflora with Megahorn.</p> <p><strong>Poison-types: Poison-types such as Dustox and Grimer all resist Solar Beam. Dustox must be wary of Hidden Power Fire and cannot safely check it if weakened. Grimer is worth noting, as it can use Sunflora as setup fodder or OHKO it with Sludge Bomb.</p> ",
    "sets": [
      {
        "name": "Sunny Beam",
        "description": "<p>Sunflora comes equipped with the highest base Special Attack in ADV ZU. This coupled with Chlorophyll makes it an incredibly threatening sun sweeper. Sunny Day ensures Sunflora will get the Speed boost it needs. Solar Beam is extremely powerful and is Sunflora's strongest STAB attack, and it can be used with little-to-no drawbacks while sun is active. Hidden Power Fire prevents Pokemon such as Bayleef, other Sunflora, or Magnemite from walling Sunflora. It's also boosted by Sunny Day allowing Sunflora to almost always 2HKO Dustox. Synthesis provides Sunflora with a reliable form of recovery that gets a boost when sun is active. Lum Berry allows Sunflora a free turn to use Sunny Day against status users like Dustox and Magnemite while also allowing preventing it from being crippled as a cleaner. Its HP investment gets higher Leftovers recovery without hindering its Speed significantly. A Modest nature provides Sunflora with extra power while still outspeeding fully-investedfoes with base 85 speed like Staryu and Aipom while Sunny Day is active.</p> <p>Sunflora fits best on sun teams. It can also be used on balance teams as a late-game cleaner or mid-game wallbreaker. On teams that take advantage of sun, Sunflora appreciates other Sunny Day users such as Onix and Castform, which can help prevent Sunflora from taking a hit to set sun. Other Chlorphyll users such as Exeggcute and Nuzleaf can benefit from Sunflora's usage of Sunny Day. Likewise, they can also damage would-be checks so that Sunflora can remove them later. On balance teams Sunflora appreciates physical wallbreakers such as Aipom, Cubone, and Nidorino to weaken or remove specially defensive walls such as Delcatty and Castform that stand in the way of Sunflora cleaning. These same physical wallbreakers also appreciate Sunflora as a midgame wallbreaker that can threaten their checks such as Koffing, Rhyhorn, and Nosepass. Sunflora is still outsped by Elekid even with Sunny Day active, so Pokemon that can check it such as Castform, Nosepass, and Dustox pair well with Sunflora. Fire-types such Cyndaquil and Growlithe pair well with Sunflora due to making excellent secondary special wallbreakers while Sunny Day is active. These Fire-types can also prove to be quite difficult for Sunflora to deal with, so Pokemon such as Nosepass and Chinchou make good partners.</p> "
      },
      {
        "name": "Specially Defensive",
        "description": "<p>Growth boosts Sunflora's already astounding Special Attack, which allows it to take advantage of Pokemon that cannot 2HKO it such as Elekid, Chinchou, and Staryu. Alternatively, Leech Seed is used to chip switch-ins and as a form of recovery against bulkier Poison-type Pokemon such as Koffing, Grimer, and Dustox. Razor Leaf lets Sunflora avoid becoming setup fodder against Pokemon like Spoink thanks to its raised critical hit chance. Giga Drain can be run as another bonus recovery option, although Razor Leaf has significantly higher PP. Hidden Power Ice allows Sunflora to threaten other Grass-types such as Lileep, Bayleef, and Exeggcute while also threatening Pidgeotto and Taillow. Synthesis provides Sunflora with a reliable form of recovery. The HP EVs maximize Sunflora's HP while gaining optimal Leftovers recovery, and the Speed EVs allow Sunflora to outspeed uninvested base 35 Speed Pokemon like Koffing, with the rest put into its special bulk.</p> <p>Specially defensive Sunflora fits best on balance and offense teams that can benefit from the role compression it offers as an emergency check to Elekid. Physical walls such as Koffing, Lileep, and Nosepass can help shut down physical attackers like Aipom, Rhyhorn, and Pidgeotto for Sunflora. These same physical attackers pair well with Sunflora, as they are able to threaten specially defensive walls such as Delcatty and Dustox. They also greatly appreciate Sunflora acting as a check to Elekid. Due to Sunflora's susceptibility to Poison-types like Dustox, Koffing, and Grimer, Steel-types such as Aron and Magnemite pair well with it. Rhyhorn makes an excellent partner with Sunflora, as it's able to prevent Grimer from using Sunflora as setup fodder. Pokemon that resist Fire such as Nosepass, Seaking, and Chinchou pair well with Sunflora, although the latter two must be wary of Hidden Power Grass. Nosepass and Chinchou are worth mentioning, as their access to Thunder Wave can help remedy Sunflora's pitiful Speed.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "BP", "user_id": 272450}], "teams": [{"name": "Quality checked by", "members": [{"username": "sleid", "user_id": 601970}, {"username": "Gangsta Spongebob", "user_id": 535530}]}, {"name": "Grammar checked by", "members": [{"username": "Tea Guzzler", "user_id": 577920}]}]}
  },
  "Delibird": {
    "comments": "<h1>Other Options</h1> <p>Focus Punch lets Delibird break through Rock- and Steel-types with ease, but a Choice-locked Focus Punch is very exploitable, while a non-Choice Band Focus Punch fails to OHKO Lileep and bulkier Rhyhorn spreads. Body Slam lets Delibird fish for paralysis, though its lower power makes it generally not worth it compared to Double-Edge and Hidden Power targeting relevant foes (remove comma) or the utility that Rapid Spin provides. Salac Berry allows Delibird to bypass its Speed issues with Substitute, though such a set struggles due to its all-or-nothing nature.</p> <h1>Checks and Counters</h1> <p><strong>Faster threats: Faster foes such as Elekid, Staryu, Aipom, and Taillow can outspeed and OHKO Delibird. While they cannot naturally outspeed Delibird, weather attackers such as Seaking and Sunflora and Speed-boosting setup sweepers such as Bagon and Growlithe can outspeed and OHKO Delibird in weather or after setting up. However, none of these threats can switch into Delibird, and many can be picked off by Quick Attack when weakened.</p> <p><strong>Rock-types: Delibird's 4x weakness to Rock leaves it OHKOed by practically every Rock Slide user in the tier, while many Rock-types such as Lileep, Rhyhorn, and Nosepass can tank even a super effective attack from Delibird.</p> <p><strong>Bulky attackers: While they cannot switch in, bulky foes like Delcatty and Castform can beat Delibird one-on-one due to its poor defensive profile. Growlithe deserves a special mention, as its ability weakens all of Delibird's attacks except Ice Beam, which it resists, and it can OHKO Delibird with its Fire-type STAB moves and even set up on it with Agility. However, it must be wary of switching into Hidden Power Ground and Choice Band Double-Edge, which still do considerable damage.</p> <p><strong>Status: Toxic and burn from threats such as Koffing wear down Delibird very quickly, with the latter also neutering all its attacks except Ice Beam. Paralysis leaves Delibird outsped by the entire tier, making it easily removed due to its poor defensive typing and lackluster defensive stats. However, Delibird can take advantage of status users by setting up a Substitute.</p> ",
    "sets": [
      {
        "name": "Substitute + 3 Attacks",
        "description": "<p>Delibird's access to Hustle coupled with its respectable offensive stats cements it as a threatening and versatile attacker. Delibird uses its offensive presence to set up Substitute, which eases prediction and furthers its wallbreaking prowess. Aerial Ace is Delibird's primary STAB attack and notably ignores Hustle's accuracy-lowering effect while maintaining its power boost. Ice Beam targets Ground-types such as Rhyhorn and Cubone and deals more damage to certain physical walls such as Koffing. 68 Special Attack EVs are crucial to let Delibird 2HKO Lileep and Koffing after Leftovers recovery. Hidden Power Ground primarily targets Steel- and Electric-types, notably OHKOing Magnemite and significantly damaging Chinchou, foes which resist Delibird's STAB moves. Hidden Power Fighting could be used instead to target Normal-types at the cost of a worse matchup against Electric-types and one point of Speed.</p> <p>Substitute Delibird best fits on offense and balance teams looking for a dangerous wallbreaker. Delibird struggles against Aipom and Taillow, since they can outspeed and OHKO it, so Rock- and Steel-types such as Rhyhorn, Lileep, and Magnemite are essential partners. Elekid and Staryu can also outspeed and OHKO Delibird, so special walls such as Dustox and Delcatty are appreciated. Delibird struggles to break through specially defensive Rock-types such as Lileep, Nosepass, and bulkier Rhyhorn variants before being KOed itself, so checks to them like Koffing are very useful. Special wallbreakers like Cyndaquil and Growlithe pair well with Delibird, as they can break past each other's respective walls. Chinchou deserves a special mention, as it both offensively and defensively checks many of Delibird's losing matchups such as specially defensive Rhyhorn and Elekid, respectively. Delibird, in return, handles very troublesome matchups for it such as Dustox and Grass-types like Bayleef and Exeggcute.</p> "
      },
      {
        "name": "Choice Band",
        "description": "<p>Choice Band Delibird's power and diverse movepool make it an effective wallbreaker, while its immunity to Spikes makes it hard to wear down, unlike Aipom. As Hustle is used to augment Delibird's power, Aerial Ace is Delibird's primary STAB attack, as it ignores Hustle's accuracy lowering effect while maintaining the power boost. Ice Beam targets Ground-types such as Rhyhorn and Cubone. Hidden Power Fighting targets other Rock- and Steel-types such as Nosepass and Magnemite, and it notably 2HKOes Lileep. Delibird's last moveslot is very flexible; Quick Attack lets Delibird pick off faster threats such as Aipom and Elekid. Alternatively, Double-Edge is Delibird's strongest attack against neutral targets, threatening OHKOes on foes such as Seaking. Rapid Spin is another alternative, letting Delibird clear Spikes for its team, though it cannot do this long-term, and it can miss due to Hustle.</p> <p>Choice Band Delibird best fits on offense and balance teams looking for a powerful wallbreaker. Delibird struggles against Aipom and Taillow, which can outspeed and OHKO it, so physically defensive Rock- and Steel-types such as Lileep, Nosepass, and Magnemite make great partners. Due to its Choice Band, Delibird is very easily taken advantage of by Rock- and Steel-types themselves, so checks to them are appreciated. Special wallbreakers such as Chinchou and Castform can break past them for Delibird, while bulky Poison-types such as Dustox and Koffing handle Lileep. Another special attacker, Agility Growlithe, greatly appreciates Delibird chipping its targets and removing Spikes. Koffing is also notable for its ability to wall Rhyhorn, something that can seriously punish a Choice-locked Delbird. Delibird is outsped and OHKOed by Elekid and Staryu, so special walls such as Dustox and Delcatty make great partners. Due to its access to Rapid Spin and immunity to Spikes, Delibird is a usable but unreliable spinner on Spikes-weak teams.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Gangsta Spongebob", "user_id": 535530}], "teams": [{"name": "Quality checked by", "members": [{"username": "BP", "user_id": 272450}, {"username": "BeatsBlack", "user_id": 479897}]}, {"name": "Grammar checked by", "members": [{"username": "ken", "user_id": 594478}, {"username": "Tea Guzzler", "user_id": 577920}]}]}
  },
  "Elekid": {
    "comments": "<h1>Other Options</h1> <p>Elekid can use Thunder Wave to provide paralysis support. Magnet is an option to power up Thunderbolt, but the extra damage is generally outclassed by the survivability offered by Lum Berry and Leftovers. Psychic can be used to more substantially chip Dustox, but it still fails to 3HKO. Elekid can opt to use Ice Punch on sets without Toxic in order to hit Lileep harder; however, Toxic is almost always preferred due to it severely limiting Lileep's effectiveness as a wall.</p> <h1>Checks and Counters</h1> <p><strong>Special Walls: Pokemon such as Delcatty, Dustox, Lileep, and Sunflora can all wall Elekid despite its coverage. However, Delcatty and Lileep must be wary of Focus Punch when switching in or using a recovery move. Dustox is worth noting, as its Toxic immunity and bulk prevent it from being even remotely threatened by Elekid. Moreover, Shield Dust prevents Dustox from being crippled from secondary effects such as Thunderbolt's paralysis and Psychic's Special Defense drop. Grimer can switch into Elekid and use it as setup fodder.</p> <p><strong>Bulky Attackers: Bulky attackers such as Castform, Chinchou, Seaking, Cubone, and specially defensive variants of Rhyhorn can all threaten Elekid. However, they can be overwhelmed with chip damage. Moreover, offensive Chinchou variants are 2HKOed by Hidden Power Grass. If using Substitute, Elekid must be weary of Cubone's Bonemerang.</p> <p><strong>Priority Users: Pokemon with Quick Attack such as Pidgeotto, Delibird, and Tailow can pick off Elekid relatively early due to its frailty.</p> ",
    "sets": [
      {
        "name": "All-Out Attacker",
        "description": "<p>Elekid is one the defining threats in ADV ZU thanks to its excellent Speed tier, great coverage options, and respectable Special Attack. Elekid functions as a lead, revenge killer, and late-game cleaner. Thunderbolt threatens common offensive Pokemon such as Aipom, Pidgeotto, Tailow, and Delibird. Fire Punch hits Steel- and Grass-types such as Magnemite and Bayleef while Hidden Power Grass provides coverage for Chinchou and Ground-types like Rhyhorn and Cubone. Quick Attack is an option that picks off weakened foes, particularly Delibird, Pidgeotto, and Taillow looking to revenge kill with a Quick Attack of their own. Quick Attack also helps remove weakened weather and setup sweepers. Toxic cripples opposing switch-ins like Castform and Lileep. Elekid can opt to use Leftovers instead of Lum Berry; however, Elekid much prefers the one-time status immunity against Butterfree, Nosepass, and Chinchou.</p> <p>Elekid excels on balance and offensive teams that require a late-game cleaner or an offensive check to attackers such as Aipom, Staryu, Pidgeotto, Delibird, and Tailow. Ironically, these same attackers also pair well with Elekid, as they appreciate not having to risk a Speed tie with their opposites. Physical wallbreakers such as Aipom, Pidgetto, and Taillow are worth mentioning, as they form a frightening attacking core and power through special walls and bulky attackers such as Dustox, Delcatty, and Castform. Elekid appreciates bulkier Pokemon that complement it offensively such as Castform, Seaking, and Sunflora. Pivots such as Koffing, Staryu, and Aipom provide Elekid with more opportunities to switch in. Koffing is worth noting, as Elekid appreciates its Ground-type immunity and ability to check specially defensive variants of Rhyhorn.</p> "
      },
      {
        "name": "Substitute",
        "description": "<p>Elekid's excellent Speed tier and its plethora of coverage options allow it to shine as a Substitute user. Substitute allows Elekid to scout switch-ins and gives it more opportunities to use Focus Punch. Thunderbolt is a powerful and reliable attack that overwhelms all but dedicated special walls. Focus Punch threatens common switch-ins, most notably Castform and Delcatty. Cross Chop provides the same coverage and is less prediction reliant, but weaker and less accurate. Alternatively, Elekid can opt to use Fire Punch alongside a Timid nature specifically for Grass-types such as Bayleef and Exeggcute. Hidden Power Grass threatens Electric-immune Pokemon such as Chinchou, Rhyhorn, and Cubone.</p> <p>Substitute Elekid fits best on balance and offensive teams that appreciate Elekid's ability to threaten Delcatty and Castform with Focus Punch; special attackers such as Gowlithe, Cyndaquil, and Staryu are good examples. Growlithe and Cyndaquil are worth mentioning, as they threaten Dustox, Elekid's premier counter. These Pokemon also greatly appreciate Elekid's Speed. Spikes support from Pineco and Snorunt helps increase Elekid's effectiveness as an offensive threat. Elekid appreciates bulkier Pokemon that it can switch into after its Substitute has been removed such as Delcatty, Koffing, Sunflora, and Castform. Delcatty is worth noting due to the added benefit of Wish support. Physical wallbreakers such as Aipom and Pidgeotto can further threaten special walls for Elekid, most notably Dustox.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "BP", "user_id": 272450}], "teams": [{"name": "Quality checked by", "members": [{"username": "Gangsta Spongebob", "user_id": 535530}, {"username": "BeatsBlack", "user_id": 479897}]}, {"name": "Grammar checked by", "members": [{"username": "UT", "user_id": 523866}]}]}
  },
  "Larvitar": {"sets": [{"name": "Dragon Dance"}]},
  "Dustox": {
    "comments": "<h1>Other Options</h1> <p>Other offensive moves like Hidden Power Grass and Thief can be used over Whirlwind, letting Dustox lure in Rhyhorn or steal Leftovers from defensive stalwarts like Lileep and Koffing, respectively.</p> <h1>Checks and Counters</h1> <p><strong>Magnemite: Magnemite can wall anything Dustox can do. It can then freely attack, forcing Dustox to use Moonlight. However, if at least one layer of Spikes is up, Whirlwind can annoy it.</p> <p><strong>Physical Attackers</strong>: Dustox's low physical bulk allows most Choice Band users to 2HKO it, like Aipom, Pidgeotto, and Taillow. Strong attackers like Rhyhorn and Cubone can also 2HKO it as well. Taillow in particular enjoys switching into Toxic thanks to Guts, with the power boost allowing it to OHKO Dustox.</p> <p><strong>Super Effective Moves: Super effective attackers like Delibird, Growlithe, and Cyndaquil can outspeed and easily KO Dustox, forcing it out.</p> ",
    "sets": [
      {
        "name": "Specially Defensive",
        "description": "<p>Dustox is an elite special wall that checks many prominent special attackers, like Elekid, Chinchou, and Staryu. Thanks to its Toxic immunity, Toxic users like Lileep and Bayleef cannot cripple it. Sludge Bomb serves as a decently powerful and spammable STAB attack, though Psychic is an alternative, with it targeting Poison-types like Koffing, Grimer, and opposing Dustox. Sludge Bomb should be run with a Careful nature, while Psychic should be run with a Calm nature. Toxic cripples walls and offensive Pokemon that would otherwise counter Dustox, such as Lileep, Delcatty, Growlithe, and Aipom. Whirlwind synergizes well with Spikes users, racking up additional Spikes damage, while phazing setup sweepers like Grimer and Spoink in an emergency. Protect scouts Choice-locked Pokemon like Taillow, Aipom, and Pidgeotto. 16 Speed EVs allow it to outpace Adamant Cubone.</p> <p>Due to Dustox's low physical bulk, it appreciates physical walls such as Lileep and Koffing. Wallbreakers like Pidgeotto and Seaking appreciate Dustox switching into fast special attackers like Elekid and Staryu. Seaking particularly pairs well with Dustox, which has type synergy with it and beats Pokemon Seaking's coverage moves don't cover, like Bayleef and Sunflora. Normal-types like Taillow, Castform, and Aipom appreciate Dustox providing Toxic support against Rock-types like Rhyhorn and Lileep, making them easier to break through over the course of a game. Snorunt and Pineco enjoy its Whirlwind.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "5Dots", "user_id": 543866}], "teams": [{"name": "Quality checked by", "members": [{"username": "BP", "user_id": 272450}, {"username": "Gangsta Spongebob", "user_id": 535530}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Taillow": {
    "comments": "<h1>Other Options</h1> <p>Lead Taillow with Silk Scarf can be used to deal with Endure leads like Snorunt and Cyndaquil and physically frail leads like Chinchou, but its much lower damage output throughout the game hinders it significantly. Without a Choice item, Taillow can also utilize Endeavor to lower the HP of opposing Pokemon drastically after a single hit due to Taillow's low bulk. Hidden Power Fighting might be tempting to be able to hit all Rock- and Steel-types in one slot, but doing so loses Taillow a crucial Speed IV that makes it unable to Speed tie with Aipom, offensive Staryu, and opposing Taillow. Taillow also still cannot 2HKO a healthy Lileep with Hidden Power Fighting regardless.</p> <h1>Checks and Counters</h1> <p><strong>Rock- and Steel-types: Despite having coverage for these Pokemon, Taillow does not like having to predict and can be easily forced out if it is locked into any non-coverage move. For instance, Rhyhorn can take advantage of a Taillow locked into Double-Edge by using Substitute on it, and Lileep will always be able to wall all Taillow sets.</p> <p><strong>Frailty: Taillow's abysmal amount of bulk makes it difficult to safely switch in, as even weak neutral moves from walls such as Koffing and Dustox’s Sludge Bomb and Exeggcute’s Psychic can easily do more than half of Taillow's HP damage.</p> <p><strong>Residual Damage: Taillow's Double-Edge recoil compounded with its low HP stat can very quickly wear it down.</p> <p><strong>Faster Pokemon</strong>: Pokemon that outspeed Taillow such as Elekid and Luvdisc force it out easily.</p> <p><strong>Koffing: Koffing is able to 2HKO Taillow with Sludge Bomb and avoids being 2HKOed by Taillow's Double-Edge if Sludge Bomb doesn’t activate Guts.</p> ",
    "sets": [
      {
        "name": "Choice Band",
        "description": "<p>Taillow's fantastic base Speed in conjunction with Guts and powerful STAB Double-Edge allows it be an excellent revenge killer and wallbreaker. Quick Attack is used to safely revenge kill weakened Pokemon that Speed tie with or are faster than Taillow such as Aipom, Staryu, and Elekid. While not nearly as strong as Double-Edge, Aerial Ace provides a non-recoil STAB move that is still able to threaten offensive Pokemon as well as Bug- and Grass-types such as Bayleef, Dustox, and Exeggcute. Hidden Power Ground is coverage that allows Taillow to deal super effective damage to Rock- and Steel-types such as Rhyhorn, Magnemite, and Nosepass. As an alternative to Aerial Ace and Hidden Power Ground, Hidden Power Flying and Steel Wing can be used. Hidden Power Flying is stronger than Aerial Ace, while Steel Wing can hit Lileep, with the trade-off being walled by Magnemite and Aron. Taillow's access to Guts allows it to punish the use of Toxic and Will-O-Wisp by increasing its damage output, which other Choice Band Normal-types like Aipom and Pidgeotto cannot do.</p> <p>Taillow fits on offensive and balanced teams that enjoy its wallbreaking and revenge killing capabilities. Taillow suffers from competition from Pidgeotto, which has much better bulk and stronger attacks. However, Taillow's much higher Speed justifies its use on faster teams. Due to its extreme fragility, Taillow appreciates Rock- and Steel-type checks like Koffing, Bayleef, and Lileep. Special attackers such as Elekid, Chinchou, and Growlithe appreciate Taillow's ability to deal with common special walls like Dustox, Delcatty, and Chinchou; in return, Taillow benefits from their ability to deal with physical walls such as Rhyhorn, Koffing, and Magnemite. Spikes and Toxic support can help soften physical walls and lower faster offensive Pokemon into Quick Attack range.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "JonAmon 25", "user_id": 494585}], "teams": [{"name": "Quality checked by", "members": [{"username": "Gangsta Spongebob", "user_id": 535530}, {"username": "BP", "user_id": 272450}]}, {"name": "Grammar checked by", "members": [{"username": "autumn", "user_id": 384270}]}]}
  },
  "Nosepass": {"sets": [{"name": "Wall"}]},
  "Aron": {"sets": [{"name": "Protect + 3 Attacks"}]},
  "Spoink": {"sets": [{"name": "Substitute + Calm Mind"}, {"name": "Lead"}]},
  "Lileep": {
    "comments": "<h1>Other Options:</h1> <p>Lileep can run a specially defensive set with a Sassy nature to check special attackers like Chinchou and Staryu more easily; however, this makes it worse against the physical attackers it is often tasked with handling. Lileep can also trade Rock Slide for Ancient Power to potentially gain a boost; however, the loss in both power and PP is quite noticeable. Lastly, Lileep can sometimes use Hidden Power Ground to hit Magnemite; however, losing its Grass-type STAB move makes it significantly worse against the Rock- and Water-types it otherwise checks.</p> <h1>Checks and Counters:</h1> <p><strong>Ice-Type coverage: Specially offensive Castform variants threaten to 2HKO with Ice Beam. Elekid and Staryu can make it difficult for Lileep to switch in with the threat of a freeze from their Ice-type coverage moves.</p> <p><strong>Taunt: Taunt users like Spoink and Shuppet completely shut down Lileep's healing and Toxic, making it far less effective.</p> <p><strong>Poison-types: Poison types such as Koffing and Grimer completely wall Lileep.</p> <p><strong>Toxic Users: Toxic from Pokemon like opposing Lileep, Chinchou, Dustox, and Elekid severely cripples Lileep, putting it on a timer every switch-in and severely limiting its capabilities as a wall.</p> <p><strong>Setup Sweepers: Thanks to their Lum Berries, setup sweepers like Sunflora and Bagon can use Lileep as setup fodder.</p> ",
    "sets": [
      {
        "name": "Wall",
        "description": "<p>Lileep is the defining wall of ADV ZU as a result of its reliable recovery, fantastic bulk, and Rock / Grass-typing, which allows it to wall common physical threats like Aipom, Pidgeotto, and Tailow. Critically, it can sponge STAB Double-Edge from these Normal-types and heal off the damage, and it is one of the best checks to Rhyhorn in the tier. Offensive Rhyhorn is the most problematic set for Lileep, able to 2HKO it with Megahorn; even then, however, Lileep OHKOes with its Grass-type STAB move and can tank a Megahorn after switching into a STAB move, meaning the matchup overall favors Lileep. Toxic cripples most switch-ins and pressures the Pokemon Lileep switches into like Aipom and Delcatty. Rock Slide hits prominent threats including Pidgeotto, Taillow, and Delibird for super effective damage. Hidden Power Grass threatens Ground-types such as Cubone and Rhyhorn and Water-types such as Staryu and Chinchou. Alternatively, Giga Drain trades power and PP for additional recovery.</p> <p>Lileep supports any and all teammates, especially defensive cores that would otherwise crumple to Normal-types. It appreciates having status absorbers and fellow defensive pivots like Delcatty, Grimer, and Dustox, while in turn they appreciate Lileep’s ability to threaten Ground- and Rock-types like Rhyhorn and Nosepass. Delcatty in particular provides valuable cleric support to Lileep. Growlithe and Magnemite are offensive wallbreakers that appreciate Lileep threatening these foes as well; in turn, they threaten opposing Lileep, Dustox, Koffing, and Magnemite. Normal-types like Aipom, Taillow, and Pidgeotto also enjoy Lileep weakening Rock-types. They weaken opposing Toxic absorbers for Lileep, and they threaten offensive Pokemon including Spoink, Growlithe, and Cyndaquil. Water-type wallbreakers like Seaking and offensive Chinchou appreciate Lileep reliably checking opposing Grass-types like Exeggcute and Bayleef; in turn, they handle offensive Fire-types and threaten walls like Koffing and opposing Lileep.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "BaitWiz", "user_id": 598623}], "teams": [{"name": "Quality checked by", "members": [{"username": "BP", "user_id": 272450}, {"username": "Gangsta Spongebob", "user_id": 535530}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Snorunt": {
    "comments": "<h1>Other Options</h1> <p>Hidden Power Fire is an option for threatening opposing Snorunt leads and Magnemite. However, without Hidden Power Grass, Snorunt cannot reliably threaten Water-types such as Staryu and Chinchou for any significant damage. Hidden Power Water is an option to threaten Fire-types such as Cyndaquil and Growlithe, which otherwise use Snorunt as setup fodder, but it comes with the same flaws that Hidden Power Fire does.</p> <h1>Checks and Counters</h1> <p><strong>Taunt: Faster Taunt users such as Spoink and Aipom can completely deny Snorunt from Spikes on the field, and they can either use it as setup fodder or OHKO it outright.</p> <p><strong>Status Spreaders: Status spreaders such as Aipom, Magnemite, and Butterfree can cripple Snorunt with paralysis, making Salac Berry useless. Aipom can also cripple it with Toxic, rendering Endure useless. Butterfree is notable for sleeping Snorunt before it even has a chance to set up Spikes, incapacitating it for most the game.</p> <p><strong>Setup Sweepers Setup Sweepers such as Growlithe and Spoink do not fear any of Snorunt's moves and can use Snorunt as set up fodder. However, Growlithe cannot consistently stop Snorunt from setting up Spikes.</p> <p><strong>Rapid Spin</strong> Hazard Removal from Rapid Spinners such as Staryu can completely ruin Snorunt's effectiveness by removing Spikes.</p> <p><strong>Priority Moves</strong>: Priority moves from Pokemon such as Pidgeotto, Elekid, and Cyndaquil can pick off Snorunt even when it has activated its Salac Berry. Cyndaquil is notable for being able to KO Snorunt before it can set up Spikes.</p> ",
    "sets": [
      {
        "name": "Spikes Lead",
        "description": "<p>Snorunt may look like a horrible Pokemon in ADV ZU at first glance due to its terrible stats and abysmal defensive utility, but Spikes grants its team a powerful form of support. Ice Beam is a great STAB option that also threatens common Pokemon such as Pidgeotto and Lileep. Hidden Power Grass allows Snorunt to threaten the most prominent spinner in the tier, Staryu, alongside other Water-types such as Chinchou and Seaking. Finally, Endure allows Snorunt to activate its Salac Berry and outspeed every unboosted Pokemon bar Voltorb, meaning it will always be able to get a layer of spikes versus Pokemon without priority or a status move.</p> <p>Snorunt fits best on offensive and balance teams that benefit from Spikes support. Due to Snorunt's prevalence as a lead, it often faces counter-leads that can shut down Spikes such Aipom, Butterfree, and Cyndaquil. Some partners that can deal with these threats are Elekid, Seaking, and Magnemite. These partners and other offensive threats enjoy Spikes chipping down Pokemon that are otherwise tough matchups for them, such as Delcatty, Lileep, and Dustox, allowing them to wallbreak much more easily. Snorunt also appreciates pivots such as Aipom, Delcatty, and Lileep to help it set up spikes later if it faces an unfavourable lead matchup. Additionally, the former two are great checks to Spoink, another tough lead matchup for Snorunt due to its fast Taunt. Lileep can also deal with common priority users such as Pidgeotto and Taillow, which completely shut down Snorunt with a Salac Berry boost, and it checks Fire-types such as Growlithe and Cyndaquil that threaten Snorunt. As teammates, priority users enjoy Spikes chipping down faster Pokemon such as Elekid into range of a KO. Even defensive pokemon enjoy Spikes which helps them threaten offensive Pokemon such as tank Castform. Shuppet uniquely denies Rapid Spin users such as Staryu, and it takes advantage of the Spikes on Delcatty and Pokemon locked into Normal- or Fighting type moves. Lastly, Magnemite walls Snorunt, so Nosepass can be used trap and remove it, while at the same time also handling priority move users and Fire-types like Lileep can. However, Nosepass does not have the longevity to do this repeatedly throughout a game.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "plznostep", "user_id": 595639}], "teams": [{"name": "Quality checked by", "members": [{"username": "Gangsta Spongebob", "user_id": 535530}, {"username": "BP", "user_id": 272450}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  }
}