{
  "Snubbull": {"sets": {"Utility": {}}},
  "Ralts": {"sets": {"Utility": {}}},
  "Duskull": {"sets": {"Defensive": {}}},
  "Koffing": {"sets": {"Defensive": {}}},
  "Trapinch": {
    "overview": "<p>Trapinch is a slow but powerful Pokemon that can be used to trap and remove key targets in order to support its teammates. Arena Trap ensures there will be no escape for Trapinch's prey, and its base 100 Attack stat ensures that the opposing Pokemon will be hit hard. Trapinch also has surprisingly decent bulk, allowing it to take hits from Pokemon with super effective coverage like Elekid and Voltorb and Pokemon with high Special Attack stats like Abra, then OHKO them with Earthquake. However, Trapinch is outsped by everything in the metagame, making it incredibly easy for Water-types like Wailmer, Chinchou, and Staryu to come in and revenge kill it.</p>",
    "comments": "<h1>Other Options</h1> <p>Choice Band can be used to amplify Trapinch's already impressive Attack stat and get surprise KOs on unsuspecting foes, and despite its extremely low base Speed, it can still outspeed some key metagame threats such as Porygon, Snubbull, and bulky Wailmer with maximum Speed investment. However, Trapinch is still outsped by most of the tier, and some of these matchups aren't guaranteed to be in Trapinch's favor: it needs the opposing Porygon to be chipped or have its Sitrus Berry removed, as it will be KOed by Ice Beam, and it doesn't secure a guaranteed OHKO versus bulky Wailmer. Thankfully, Trapinch still has the bulk to survive hits from threats such as unboosted Abra and Larvitar, as well as Elekid and Voltorb, but its lack of recovery means it's easily picked off by faster opponents or priority attacks afterwards.</p> <h1>Checks and Counters</h1> <p><strong>Water-types</strong>: Trapinch is outsped by every Water-type in the tier and is unable to survive their STAB attacks.</p> <p><strong>Koffing</strong>: Thanks to its ability Levitate, Koffing is immune to Trapinch's powerful Earthquake and takes very little damage from its other moves. Koffing typically runs Hidden Power Water, which is a 3HKO against Trapinch. While this may sound like pitiful damage, Trapinch's moves do so little to Koffing that Koffing still wins this matchup.</p> <p><strong>Doduo</strong>: Choice Band Doduo is able to OHKO Trapinch with Double-Edge and is also able to OHKO it with Drill Peck if Trapinch has taken any chip damage. Doduo is immune to both Earthquake and Hidden Power Ghost, normally leaving Trapinch with only Quick Attack to hit it. However, it's not a perfect matchup for Doduo, as it must be wary of Rock Slide, which has a 62% chance to OHKO it.</p> <p><strong>Porygon</strong>: Porygon's ability Trace allows it to counter-trap Trapinch. While Trapinch is able to 2HKO Porygon with Earthquake, Porygon usually comes out on top in this matchup. This is because Porygon outspeeds and 2HKOes Trapinch with Ice Beam and is much more likely to have its Sitrus Berry intact thanks to Recycle.</p>",
    "sets": {
      "Trapper": {
        "description": "<p>The HP and Special Defense investment on this set is what allows Trapinch to perform its role effectively as a trapper. With this investment, Trapinch can survive super effective coverage moves from Elekid, Voltorb, and Magnemite and powerful special attacks from Pokemon like Abra, as well as +1 Earthquake from Larvitar, then remove these Pokemon using Earthquake. Notably, Trapinch is able to survive Porygon's Ice Beam, unlike its counterpart Diglett, enabling it to remove Porygon as well if it's in range of Earthquake. Hidden Power Ghost is useful for getting the KO on Gastly and doing good damage to Duskull, but Rock Slide can be considered for a chance to OHKO Doduo. Additionally, running Rock Slide over Hidden Power Ghost frees up some EVs that Trapinch can combine with its otherwise useless Speed EVs to boost any of its other stats by one point; for example, investing these EVs in Special Defense gives Trapinch a good chance to survive a +1 Psychic from Abra. Quick Attack lets Trapinch bypass its abysmal Speed stat to remove weakened foes or get some chip damage off before it faints. Protect is useful for saving Trapinch from a predicted Explosion or Self-Destruct, usually from opposing Voltorb or Gastly, and is also a reliable tool for scouting an opponent's move.</p> <p>Any Pokemon that wants Electric-types such as Elekid, Voltorb, and Magnemite or strong but frail special attackers such as Abra removed will appreciate Trapinch's ability to trap and remove them. In return, Trapinch appreciates a teammate that can come in on Water-types that will likely come in to revenge kill Trapinch such as Chinchou, Wailmer, or Staryu. Trapinch is able to trap and OHKO Diglett with Earthquake, so Pokemon who have poor matchups versus Diglett such as the previously mentioned Elekid, Voltorb, and Magnemite will enjoy having Trapinch as a teammate. Porygon specifically appreciates Trapinch as a teammate for its ability to counter-trap Diglett, as this lets Porygon stay healthy for other matchups. Although it's not as commonly seen in the metagame, Larvitar is trapped and removed by Trapinch even at +1 Attack, so teams looking for a way to deal with Larvitar should look no further than Trapinch.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "grape tylenol", "user_id": 593128}], "teams": [{"name": "Quality checked by", "members": [{"username": "Kaboom", "user_id": 300935}, {"username": "reggg", "user_id": 588561}]}, {"name": "Grammar checked by", "members": [{"username": "aurora", "user_id": 109385}]}]}
  },
  "Diglett": {
    "overview": "<p>Diglett's Speed tier and access to Arena Trap make it a threat to nearly every grounded Pokemon. It can trap and remove offensive threats such as Abra, Elekid, Chinchou, Ponyta, and Houndour to support its team. Defensively, it may appear underwhelming, but its immunity to Electric and not much need for high Attack investment allow Diglett to invest in bulk to customize what it's capable of trapping. One of its major shortcomings, however, is the ever-present Porygon's access to Trace and Ice Beam to counter-trap. After a successful trap, Water-types such as Staryu and Wailmer are a concern for Diglett as well, with their powerful STAB moves being difficult to switch into, and they do not fear much from Diglett.</p>",
    "comments": "<h1>Other Options</h1> <p>Choice Band allows Diglett to always output the same damage as Liechi Berry without burning through its HP, but being locked into any one of its moves is a massive downside. Sludge Bomb lets Diglett trap and KO chipped Cacnea and Exeggcute, but neither of these Pokemon are common enough to justify the moveslot. Toxic is an alternative to Rock Slide if wearing down Porygon and Duskull is more necessary than coverage for Doduo.</p> <h1>Checks and Counters</h1> <p><strong>Porygon</strong>: One of the most common play patterns in the tier is Porygon coming in on a Diglett after a KO to trace Arena Trap and remove it with Ice Beam. There is virtually no counterplay once Porygon is brought in, but Thief can be used to remove Porygon's Sitrus Berry prior to being KOed.</p> <p><strong>Water-types</strong>: Wailmer, Horsea, and Staryu all come in to revenge kill Diglett and threaten teams with their powerful Water-type STAB moves.</p> <p><strong>Trapinch</strong>: Similarly to Porygon, Trapinch comes in to counter-trap Diglett, being able to preserve its Sitrus Berry against weakened Diglett by using Quick Attack.</p>",
    "sets": {
      "Specially Defensive Trapper": {"description": "<p>This analysis is a work in progress, check it out <a href=\"https://www.smogon.com/forums/threads/specially-defensive-diglett-qc-1-2.3738464/\">here</a>!</p>"},
      "Offensive Trapper": {
        "description": "<p>Diglett makes use of its Speed to remove a wide variety of threats and aggressively close out games. The Attack EVs allow Diglett at +1 to OHKO Pokemon the more common specially defensive set can't, such as Anorith, Staryu, and bulky Abra, with Earthquake. Defensively, it is capable of surviving an Earthquake from specially defensive Diglett and OHKOing it back with its own. Hidden Power Ghost is the best option for KOing Gastly and dealing respectable damage to Duskull and Exeggcute. Thief and Screech are alternatives to either steal a Sitrus Berry from Porygon and Trapinch or lower their Defense to make Porygon vulnerable to a counter-trap from an ally Porygon or Trapinch. Substitute allows Diglett to lower its HP to activate its Liechi Berry against slower Pokemon, raising its Attack stat to an impressive 21.</p> <p>It is advised to save Diglett for late-game, as the omnipresent Porygon is a sure-fire way to remove it. It struggles to switch into many threats as well. While it has some of the highest damage output in the tier after a boost, Diglett still struggles to OHKO a large portion of the metagame. Spikes from the likes of Cacnea, Snorunt, and Pineco lessen this issue, with the former being capable of switching into the Water-types that threaten Diglett. Porygon removes Trapinch after it comes in to counter-trap Diglett, and when paired with Screech, it can use Trace to counter-trap an opposing Porygon that has traced Arena Trap. Gastly is an ideal partner for taking advantage of Quick Attack users such as Trapinch and Doduo, which revenge kill a low HP Diglett after activating its Liechi Berry.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Kaboom", "user_id": 300935}], "teams": [{"name": "Quality checked by", "members": [{"username": "Quinn", "user_id": 553008}, {"username": "grape tylenol", "user_id": 593128}]}, {"name": "Grammar checked by", "members": [{"username": "autumn", "user_id": 384270}, {"username": "zastra", "user_id": 558636}]}]}
  },
  "Meowth": {"sets": {"Lead": {}}},
  "Mankey": {"sets": {"Substitute + Reversal": {}}},
  "Abra": {"sets": {"Offensive Calm Mind": {}, "Bulky Calm Mind": {}}},
  "Machop": {"sets": {"Offensive": {}}},
  "Bellsprout": {"sets": {"Sunny Day Sweeper": {}}},
  "Ponyta": {"sets": {"Sunny Day": {}}},
  "Magnemite": {"sets": {"Offensive Utility": {}}},
  "Doduo": {
    "overview": "<p>Doduo is one of LC's most nuclear threats thanks to a naturally high Attack stat compounded with Choice Band, allowing it to OHKO the majority of the tier. Doduo's great Speed stat allows it to reach 18 Speed, which is great for the tier, and it even has Quick Attack to reliably revenge kill faster offensive foes like Diglett and Abra. Doduo's useful Flying typing also prevents it from being trapped by Trapinch and Diglett, making it difficult to revenge kill with these two. Nonetheless, Doduo is not without its flaws. While it is extremely powerful, its poor bulk means that if it can't OHKO an opposing Pokemon, it is likely to be OHKOed back. Doduo is also extremely prediction reliant, because if it does not choose the right move, Ghost-types like Gastly and Duskull easily wall it. Finally, while Doduo's Speed tier is great, being outsped by common threats like Abra, Diglett, Staryu, and Elekid can prevent it from completely steamrolling the opposing team.</p>",
    "comments": "<h1>Other Options</h1> <p>While much more niche, a Substitute set with Liechi Berry and Flail is a possibility, catching foes switching into Doduo off guard. Sky Attack can be run to OHKO Koffing, Duskull, and Porygon if Doduo opts for an Adamant nature, although it is extremely prediction reliant and requires a charge turn. Sitrus Berry can be opted over Choice Band, as Drill Peck + Double-Edge with Sitrus Berry can get surprise KOs on Koffing and Porygon.</p> <h1>Checks and Counters</h1> <p><strong>Faster offensive threats</strong>: Pokemon like Abra, Elekid, and Staryu all outspeed and OHKO Doduo with their STAB moves, while Diglett only needs slight chip from Double-Edge to KO it with Rock Slide. However, Doduo can KO all of them with Quick Attack after slight chip.</p> <p><strong>Ghost- and Rock-types</strong>: Ghost-types like Gastly and Duskull and Rock-types like Anorith and Onix can switch into Doduo's Double-Edge and threaten an OHKO back or use it as setup fodder.</p> <p><strong>Porygon, Snubbull, and Koffing</strong>: Porygon, Snubbull, and Koffing can all take an attack from Doduo and attempt to OHKO it or cripple it with status in return, making them an annoyance.</p>",
    "sets": {
      "Choice Band": {
        "description": "<p>Double-Edge is Doduo's strongest option, allowing it to OHKO threats like Wailmer, Trapinch, and Cubone, although its recoil can be troublesome. Drill Peck is Doduo's best option against Ghost-types like Gastly and Duskull, allowing it to not be completely walled by them as well as letting it target Pokemon like Exeggcute and Cacnea. Quick Attack is a valuable priority move, letting Doduo pick off weakened faster threats like Diglett and Abra. Hidden Power Ground gives Doduo coverage for Pokemon like Larvitar and Magnemite, although Hidden Power Grass is an option to specifically target and OHKO Onix, which otherwise completely counters Doduo.</p> <p>Although Doduo fits on practically every team, it is a particularly great fit on teams looking for a strong physical attacker that can create holes in the opposing team. Trappers like Diglett and Trapinch can remove faster threats like Elekid and Voltorb that Doduo is helpless against. Pokemon like Porygon and Snubbull can just barely survive Doduo's Double-Edge and threaten to KO it back or status it, so Spikes setters like Cacnea and Pineco that can set up Spikes to provide chip damage on these two are extremely appreciated. Checks to Ghost-types like Porygon and Pursuit Houndour can give Doduo an easier time breaking through teams. While fast, Doduo still gets outsped by multiple Pokemon in the metagame like Abra, Diglett, Elekid, and Staryu. Porygon thus makes an excellent partner, as it can spread paralysis for Doduo and trap Diglett.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Bella", "user_id": 567483}], "teams": [{"name": "Quality checked by", "members": [{"username": "reggg", "user_id": 588561}, {"username": "Quinn", "user_id": 553008}]}, {"name": "Grammar checked by", "members": [{"username": "Clouds", "user_id": 356215}, {"username": "Aera", "user_id": 572981}]}]}
  },
  "Gastly": {
    "overview": "<p>Gastly's combination of a diverse offensive movepool, complete with options such as Psychic, Thunderbolt, and Explosion, and ability to hit 18 Speed makes it a potent offensive threat in LC. What sets Gastly apart from other speedy attackers is its rare defensive utility. Its uncommon Ghost typing lets it take advantage of the exceptionally dangerous Choice Band Doduo and provides it with an immunity to Self-Destruct and Explosion. Once revealed, it dissuades the opponent from using this move as long as it isn't KOed. Levitate gives Gastly an immunity to Ground-type moves and lets it avoid being trapped by Diglett and Trapinch's Arena Trap. Finally, it has the right combination of moves and typing to take on one of LC's most threatening Pokemon, Wailmer. However, Gastly is hardly a defensive staple, with it easily OHKOed by common neutral hits like Choice Band Doduo's Drill Peck. Gastly's Speed can also fail it against certain foes, most significantly Abra, which can effortlessly revenge kill Gastly. This gives Gastly competition with Duskull, another Ghost-type with Levitate that can actually beat Abra and isn't OHKOed by Choice Band Doduo's Drill Peck, though Gastly is still generally preferred thanks to its offensive presence generally being more useful in such a fast-paced metagame.</p>",
    "comments": "<h1>Other Options</h1> <p>Destiny Bond can be used to help Gastly trade with its foe, though Explosion is preferred for this role due to its flexibility. Giga Drain and Hidden Power Grass provide coverage for Water- and Ground-types, notably being Gastly's strongest moves against the latter type and Chinchou, excluding Explosion. The latter move healing Gastly can also improve its longevity somewhat. However, Gastly generally doesn't need the recovery, and it already has other moves to hit Giga Drain's targets for good or better damage. Gastly can use Endure and Salac Berry to become a potent sweeper, one that notably is immune to Quick Attack. However, Gastly needs the opposing team heavily weakened, since it can't OHKO many foes, and running Endure forces it to give up coverage. Substitute can let Gastly take advantage of the switches it forces and ease prediction, though the loss of coverage limits its ability to take advantage of Substitute. Gastly can maximize its Special Attack and run a special attacking set using Psychic, Thunderbolt, Giga Drain, and Thief or Substitute, but this set sacrifices a powerful option in Explosion and coverage against Abra and Duskull.</p> <h1>Checks and Counters</h1> <p><strong>Faster Pokemon</strong>: Abra is Gastly's worst matchup, outspeeding and OHKOing it with Psychic, though it is OHKOed by Shadow Ball and Explosion. Staryu also outspeeds Gastly and has high odds to OHKO it with Hydro Pump, though it is OHKOed by Thunderbolt. Elekid and Diglett outspeed Gastly and 2HKO it while only being 2HKOed in return. Gastly can use Explosion to OHKO them, though they both often carry Substitute. Diglett in particular has low odds to OHKO Gastly with Hidden Power Ghost, which becomes a guaranteed OHKO with Choice Band or Liechi Berry.</p> <p><strong>Duskull</strong>: Duskull OHKOes Gastly with Shadow Ball while only being 2HKOed by Gastly's own—which becomes a 3HKO if Duskull still has its Sitrus Berry—and doesn't even lose half its health from any of Gastly's other moves. Additonally, Duskull can switch into Gastly's Explosion while taking no damage. However, Thunderbolt and Psychic can put Duskull in range of being KOed by Shadow Ball without activating Sitrus Berry.</p> <p><strong>Paralysis</strong>: Once paralyzed by a foe like Porygon, Elekid, or Snubbull, Gastly loses one-on-one to the majority of the tier.</p>",
    "sets": {
      "Mixed Offensive": {
        "description": "<p>Psychic is Gastly's most spammable attack, notably hitting opposing Poison-types like Koffing and Gastly super effectively while providing a strong hit against Diglett. Sludge Bomb deals decent damage to mixed bulky attacker Wailmer without activating Sitrus Berry, giving it high odds of being KOed by Thunderbolt afterwards. It also OHKOes Cacnea while having decent odds to do the same to Exeggcute, and it can possibly weaken other targets with its chance to poison. Shadow Ball is an alternative, also giving Gastly high, albeit slightly worse, odds of KOing mixed bulky attacker Wailmer when used before Thunderbolt. It's also Gastly's strongest move with no drawbacks against Duskull and Abra, KOing the former after Thunderbolt or Psychic and OHKOing the latter, though Gastly still loses one-on-one to them. Thunderbolt primarily hits Flying- and Water-types, damaging the aforementioned Wailmer and OHKOing foes like Doduo and Staryu. Thief is an alternative to let Gastly steal a foe's Sitrus Berry after Gastly has used up its own, notably preventing Porygon from using Recycle to stay healthy. Explosion lets Gastly sacrifice itself to OHKO most targets, including extremely bulky ones like Wailmer and Porygon. The given EV spread alongside a Hasty nature maximizes Gastly's Speed while providing enough Attack to OHKO Porygon. 76 Special Defense EVs let Gastly never be OHKOed by mixed bulky attacker Wailmer's Surf, with this matchup also being why Hasty is chosen over Naive. Of what is left over, 36 EVs are used to augment Gastly's Special Attack as much as possible, while the remainder is put into its Defense.</p> <p>Gastly is a natural fit on teams looking for a switch-in to Choice Band Doduo's Normal-type moves and Self-Destruct and Explosion users such as Wailmer, Koffing, and opposing Gastly, on teams that prefer Gastly's explosive offensive power over Duskull's better defenses. Essentially the entire metagame appreciates this support, with teammates unable to outspeed and OHKO these foes like Wailmer and Chinchou especially appreciating Gastly as a teammate. It is recommended that Gastly not reveal itself too early but instead switch in when it's clear the mentioned examples are committing to their Normal-type move. Either way, if the foe sacrifices itself for nothing or Doduo locks itself into a move that does no damage, Gastly will almost always get a KO in those situations. Gastly is also an effective answer to Porygon, as being able to KO it with Explosion is usually an advantageous trade, though players must be wary of not being too predictable and risking the opponent switching in their own Ghost-type. Beyond switching into Self-Destruct, Gastly also reliably handles Wailmer, helping Pokemon that struggle against it like Diglett, Elekid, and Koffing. Gastly primarily struggles with foes that are faster than it, such as Staryu, making a teammate like Chinchou useful at checking it. Gastly has an abhorrent matchup against Abra, being outsped and OHKOed by its STAB Psychic, with Abra even able to switch into many of Gastly's moves. Gastly is generally best off staying in to stop Abra from setting up, and once it's KOed, it can let in a faster teammate, like Elekid or Diglett, or a priority user, like Doduo, to revenge kill Abra.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Gangsta Spongebob", "user_id": 535530}], "teams": [{"name": "Quality checked by", "members": [{"username": "grape tylenol", "user_id": 593128}, {"username": "Quinn", "user_id": 553008}]}, {"name": "Grammar checked by", "members": [{"username": "aurora", "user_id": 109385}]}]}
  },
  "Onix": {"sets": {"All-Out Attacker": {}}},
  "Voltorb": {"sets": {"Offensive": {}}},
  "Exeggcute": {"sets": {"Sunny Day Sweeper": {}}},
  "Cubone": {"sets": {"Offensive": {}}},
  "Horsea": {"sets": {"Rain Sweeper": {}}},
  "Staryu": {"sets": {"All-Out Attacker": {}}},
  "Porygon": {
    "overview": "<p>Porygon is a wall that fits naturally onto any competitive LC team: almost no teams will be seen without it. Its natural bulk and support move options allow it to be a check to almost everything while maintaining extended longevity. Porygon's Normal typing is excellent, as Fighting-types and Fighting-type moves are rarely seen in LC. Porygon is also no slouch offensively, as its coverage and STAB moves allow it to deal consistent damage. Its ability, Trace, lets Porygon counter-trap Diglett and Trapinch by copying Arena Trap, allowing it to remove them and support its team further, as well as copying other useful abilities like Natural Cure, Levitate, and Volt Absorb.</p>",
    "comments": "<h1>Other Options</h1> <p>Investing in Special Defense EVs instead of Defense or Special Attack is an option to help versus strong special attackers like Abra, offensive Wailmer, and Horsea. This set should be paired with walls such as Koffing or Duskull to handle physical threats. Offensive Porygon sets are an option but are harder to justify because of Porygon's immense value as a defensive Pokemon. These sets use Agility or Sharpen to boost then use Substitute to avoid paralysis in order to try and sweep teams. These sets benefit from paralysis in order to get more setup opportunities. Toxic is an option to try and chip teams down but can be hard to fit because Porygon already wants other utility options, and paralysis is the typically preferred status condition. Defensive Pokemon like opposing Porygon, Duskull, and Wailmer are good targets to wear down with Toxic.</p> <h1>Checks and Counters</h1> <p><strong>Explosion / Self-Destruct</strong>: With Porygon's natural bulk, the only way to consistently OHKO Porygon is through the use of Explosion or Self-Destruct. Wailmer, Koffing, Exeggcute, Gastly, Voltorb, and Pineco are among the most relevant Pokemon with access to one of these moves.</p> <p><strong>Thief</strong>: The move Thief helps cripple Porygon, either forcing it to use Thief if it wants to heal or eliminating its healing entirely if Porygon is not carrying it. Pokemon such as Diglett, Abra, Duskull, and Koffing will often be seen running Thief.</p> <p><strong>Abra</strong>: With Calm Mind, Abra can start to threaten Porygon very quickly. At +1 Special Attack, Psychic has a chance to OHKO Porygon after one layer of Spikes or minimal chip damage, and at +2, it will always be OHKOed. The defensive Abra set will survive one use of either Return or Double-Edge, giving it more opportunities to set up. Substitute allows Abra to stop Thunder Wave from Porygon trying to cripple it, and Encore can lock Porygon into Recycle or Thunder Wave.</p> <p><strong>Anorith</strong>: With Swords Dance, Anorith is able to almost always OHKO Porygon with Brick Break: it also resists Porygon's Normal-type moves. Anorith can also avoid Thunder Wave with Substitute.</p>",
    "sets": {
      "Tank": {
        "description": "<p>236 HP EVs and 196 Defense EVs with a Relaxed nature allow Porygon to never be OHKOed by Choice Band Doduo's Double-Edge and almost always avoid the OHKO from Cubone's Bonemerang, the two strongest physical moves in the tier. 76 Special Attack EVs allow Ice Beam to always OHKO standard Diglett sets. Return is the more consistent STAB option, while Double-Edge allows Porygon to OHKO non-defensive Abra sets but risk knocking itself out if at low health. In some situations, Double-Edge lets Porygon damage itself to below 50% health, allowing it to heal using its Sitrus Berry. Ice Beam allows Porygon to threaten the many Ice-weak Pokemon in the tier, such as Doduo, Diglett, Trapinch, and Cubone. Thunderbolt can be used to still hit Doduo and get surprise damage against Water-types but has worse coverage in comparison to Ice Beam. Recycle, a move only Porygon has access to in the tier, allows Porygon to fully heal with its Sitrus Berry throughout the game, giving it great longevity. Thief allows Porygon to steal, consume, and potentially Recycle stolen Sitrus Berry in cases where its own has been taken. Thunder Wave is always a useful utility option thanks to how valuable speed control is in LC with Porygon's bulk letting it survive almost any hit and paralyze its foe in return. Trace is an extremely useful ability that allows Porygon to come in on Diglett and Trapinch and trace Arena Trap, but it also has other uses. Tracing Staryu's Natural Cure, Chinchou's Volt Absorb, and Gastly or Duskull's Levitate are all relevant interactions.</p> <p>Porygon pairs particularly well with Pokemon that appreciate Diglett and Trapinch being removed, such as Chinchou, Abra, and Elekid. Teams that do not want to run a more dedicated Choice Band Doduo check, such as Koffing or Duskull, will also appreciate running physically defensive Porygon, freeing up slots for other Pokemon. Porygon appreciates teammates that can help handle special threats like Abra and Elekid. A Pokemon such as specially defensive Wailmer to take hits or Diglett to trap the aforementioned special attackers can be effective. Any team will benefit from running Porygon due to how effective it is as a blanket check to so many Pokemon in the metagame.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "reggg", "user_id": 588561}], "teams": [{"name": "Quality checked by", "members": [{"username": "grape tylenol", "user_id": 593128}, {"username": "Kaboom", "user_id": 300935}]}, {"name": "Grammar checked by", "members": [{"username": "aurora", "user_id": 109385}]}]}
  },
  "Chinchou": {"sets": {"Offensive": {}}},
  "Pineco": {"sets": {"Spikes": {}}},
  "Houndour": {"sets": {"Special Attacker": {}}},
  "Elekid": {
    "overview": "<p>At a blistering 20 Speed, Elekid is tied for the fastest Pokemon in the metagame with Diglett and Voltorb. This high Speed stat helps it take advantage of its excellent offensive and utility movepools. The wide range of moves Elekid can run makes it difficult to predict but also makes it difficult for Elekid to cover all its bases. Elekid has to choose three of Focus Punch, Thief, Thunder Wave, Ice-type coverage, and Grass-type coverage, so once its set is revealed, the opponent will be able to bring in something that Elekid doesn't have coverage for. Elekid also has to be wary of specially defensive Ground-types such as Diglett, Trapinch, and Cubone, as they survive Ice Punch and Hidden Power Grass and KO Elekid with their STAB moves.</p>",
    "comments": "<h1>Other Options</h1> <p>Elekid already struggles to fit everything it wants into its four move slots, but it does have some other good moves that can be considered. Psychic is an interesting option that can OHKO Gastly and Koffing that may switch into Elekid not expecting it. Quick Attack can be used to pick off Pokemon at low HP—such as after using Endure or using Substitute to reach pinch Berry range—but doesn't accomplish much else. Elekid also has access to Light Screen, although it gains almost no benefit from setting it up, so it's outclassed by other screens setters that can set up dual screens such as Staryu.</p> <h1>Checks and Counters</h1> <p><strong>Trapinch</strong>: Regardless of what set Elekid is running, Trapinch is able to shrug off its attacks. Once Elekid is trapped, Trapinch can OHKO it with Earthquake, although Elekid can chunk it before it goes down using either Ice Punch or Hidden Power Grass.</p> <p><strong>Cubone</strong>: Similar to Trapinch, Cubone can survive any of Elekid's attacks and then break through its Substitute using Bonemerang to OHKO it.</p> <p><strong>Chinchou and Wailmer</strong>: Without Hidden Power Grass, Chinchou and Wailmer are difficult matchups for Elekid. Chinchou takes no damage from Elekid's Thunderbolt thanks to Volt Absorb, meaning Elekid needs to either hit it from behind a Substitute with Focus Punch or rely on Thief and Ice Punch, which deal negligible damage. Elekid is also unable to secure the KO on specially defensive Wailmer variants with Thunderbolt regardless of Special Attack investment. Hidden Power Grass allows Elekid to 2HKO specially defensive Wailmer by getting it into Thunderbolt range without activating its Sitrus Berry, but Elekid needs to be behind a Substitute to avoid being OHKOed by Wailmer's Earthquake.</p> <p><strong>Paralysis</strong>: Like most fast Pokemon in ADV LC, Elekid hates getting paralyzed, as one of its main strengths is its Speed. Elekid can use Substitute to block paralysis from most Pokemon but should still be wary of Thunder Wave from opposing Pokemon that Speed tie with it such as other Elekid and Voltorb.</p>",
    "sets": {
      "Substitute + 3 Attacks": {
        "description": "<p>Elekid's incredible Speed, high Special Attack, and diverse offensive movepool make it adept at forcing switches, letting it take advantage of them by using Substitute. Alongside giving Elekid an extra hit, Substitute also lets it avoid getting paralyzed by slower foes such as Porygon. Ice Punch 2HKOes Ground-, Grass-, and Dragon-types such as Trapinch, Exeggcute, and Bagon, though Elekid usually needs its Special Attack boosted to beat the former type. Thief lets Elekid steal its foe's Sitrus Berry after using up its own item, notably preventing Porygon from healing using Recycle. Hidden Power Grass is an alternative, 2HKOing the only Pokemon in LC that resists both Thunderbolt and Ice Punch in Chinchou. It also puts mixed bulky attacker Wailmer into range of Thunderbolt while rarely triggering Sitrus Berry, allowing Elekid to generally beat it one-on-one if it survives the turn, which is possible if it's behind a Substitute. Sitrus Berry lets Elekid fully heal itself after being brought to low HP, notably allowing it to create more Substitutes. Petaya Berry is an alternative that pairs nicely with Substitute allowing Elekid to safely get itself to low HP, as the Special Attack boost makes Elekid extremely threatening; it becomes able to reliably OHKO foes such as Abra and Wailmer and gains high odds to do so against Chinchou. Static generally isn't very useful due to Elekid's frailty, but it can paralyze a foe like a Speed-boosted Bagon in a pinch.</p> <p>Elekid is effective at exploiting common threats such as Doduo and Staryu by setting up a Substitute as it forces them out, making it pair nicely with teammates vulnerable to them such as Wailmer and Cubone. Elekid can often force in Porygon, with Thief variants adept at ruining its longevity. Elekid struggles to take on Chinchou, especially if it isn't running Hidden Power Grass, making checks to it like Porygon good partners. Elekid's role somewhat varies depending on its item—with Sitrus Berry, it has more mid-game utility, able to stay healthy to repeatedly set up Substitute to keep on attacking the opposing team, while Petaya Berry makes it more of a dedicated cleaner that uses its sheer power to overwhelm its checks. However, Elekid must make sure the time is right for it to start its sweep with Petaya Berry, because even if it can overwhelm a check like Chinchou one-on-one, it can then potentially be revenge killed by a priority user like Doduo or possibly lose the Speed tie against Diglett. It's best for Quick Attack users to first reveal themselves and be eliminated before Elekid reveals itself to start its sweep. Elekid struggles with specially defensive Diglett, which Speed ties with Elekid and can OHKO with Earthquake while almost always surviving one Ice Punch. If Elekid is meant to be its team's cleaner, it's recommended that it is not revealed until opposing Diglett are eliminated by a teammate like Wailmer or Trapinch.</p>"
      },
      "SubPunch": {
        "description": "<p>The highlight of this set is Focus Punch backed by 176 Attack EVs which allows Elekid to beat Diglett as long as Elekid is behind a Substitute. This can be the key to victory in some battles, as players will often send Diglett in on Elekid even when Elekid is behind a Substitute. This is because specially defensive Diglett, the most common Diglett set, will always beat Elekid barring a critical hit or freeze from Ice Punch. 80 Special Attack EVs are used to boost Thunderbolt's damage as well as to ensure a clean 2HKO on Porygon without triggering its Sitrus Berry by using Thunderbolt then Focus Punch. Thunder Wave has great utility and gives Elekid opportunities to fish for the opponent to be fully paralyzed, making it much easier to pull off a Focus Punch. Alternatively, Hidden Power Grass in combination with Thunderbolt allows it to beat common Pokemon such as Chinchou and Wailmer, as well as the more niche Onix, and is worth considering if its team already has paralysis support elsewhere.</p> <p>The two strengths of the SubPunch set are its ability to take out Diglett and its ability to spread paralysis, but it still has some weaknesses to cover. Slow Pokemon like Cubone and setup sweepers like Bagon and Larvitar that can take advantage of the paralysis Elekid spreads to the opposing team are good partners. As previously mentioned, without Hidden Power Grass, this set really struggles with Chinchou and Wailmer. A Pokemon that can handle both of them like Staryu or Porygon makes a good partner for Elekid. Elekid is also still vulnerable to Trapinch and Cubone, so a strong Water-type like Wailmer, Staryu, or Chinchou that can revenge kill Ground-types is a good idea too. Porygon is another good teammate for Elekid, as it can counter-trap and eliminate Trapinch and has a good matchup versus Cubone.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Gangsta Spongebob", "user_id": 535530}, {"username": "grape tylenol", "user_id": 593128}], "teams": [{"name": "Quality checked by", "members": [{"username": "Quinn", "user_id": 553008}, {"username": "grape tylenol", "user_id": 593128}, {"username": "BlackKnight_Gawain", "user_id": 205631}]}, {"name": "Grammar checked by", "members": [{"username": "aurora", "user_id": 109385}]}]}
  },
  "Larvitar": {"sets": {"Dragon Dance": {}}},
  "Carvanha": {"sets": {"Offensive": {}}},
  "Wailmer": {"sets": {"Mixed Bulky Attacker": {}, "Specially Offensive": {}}},
  "Cacnea": {"sets": {"Offensive Spikes": {}, "Utility Spikes": {}}},
  "Baltoy": {"sets": {"All-Out Attacker": {}}},
  "Lileep": {"sets": {"Defensive": {}}},
  "Anorith": {"sets": {"Swords Dance": {}}},
  "Snorunt": {"sets": {"Spikes": {}}},
  "Bagon": {
    "overview": "<p>Bagon has access to powerful tools like Dragon Dance, a high base 75 Attack stat, and a typing that brings resistances to extremely common Electric-, Fire-, and Water-type moves, meaning it should theoretically find many opportunities to set up. Unfortunately, a few major downsides offset these positive traits. Most Water- and Electric-types in the tier carry either Thunder Wave or Ice-type coverage moves that shut down Bagon, and it has no physical STAB, instead being reliant on a recoilless Double-Edge thanks to its ability Rock Head. This leaves it unable to pose much of a threat at +1 Attack to healthy teams, and even at +2 Attack, walls such as Wailmer or Koffing shrug it off with ease. However, with support in the form of Spikes and teammates capable of wearing down the physical walls of the tier, Bagon can shine as a late-game sweeper.</p>",
    "comments": "<h1>Other Options</h1> <p>Bagon can opt for a spread of 236 Atk / 36 Def / 36 SpD / 196 Spe with an Adamant nature to outspeed the entire unboosted metagame at +1 while hitting as hard as possible. However, this makes it much more difficult to find setup opportunities, with Bagon now being OHKOed by Water-types carrying Ice Beam and Elekid carrying Ice Punch while still being unable to OHKO walls such as Porygon or Wailmer even after an Attack boost. Substitute is an option to avoid status, as well as Self-Destruct and Explosion from the likes of Wailmer and Voltorb, but Bagon is very reliant on all of its coverage moves to clean up teams.</p> <h1>Checks and Counters</h1> <p><strong>Physical Walls</strong>: Porygon, Koffing, and Wailmer present massive issues to a Bagon attempting to sweep, easily tanking +2 Double-Edge and finishing off a worn down Bagon. At +1 Attack, however, it is possible to 2HKO Porygon and Wailmer through proper sequencing of Double-Edge and Brick Break to avoid activating Sitrus Berry.</p> <p><strong>Voltorb</strong>: Voltorb can switch into any of Bagon's attacks at +1, outspeeds it, and can either OHKO Bagon with Self-Destruct or paralyze it with Thunder Wave.</p> <p><strong>Priority</strong>: Attempting to set up Dragon Dance multiple times to sweep will typically leave Bagon in range to get KOed by Meowth's Fake Out and Doduo and Trapinch's Quick Attack.</p>",
    "sets": {
      "Dragon Dance": {
        "description": "<p>The EVs are meant to maximize the amount of setup opportunities for Bagon while taking advantage of its ability to raise its Speed using Dragon Dance. 22 HP and 13 Special Defense allow Bagon to survive Ice Beam from Staryu and Porygon and Ice Punch from Elekid a majority of the time, and 13 Speed allows it to outspeed Doduo and Gastly after a Dragon Dance. Bagon having both one of the highest Attack stats in the tier and access to Dragon Dance makes up for the lack of investment. Double-Edge is the strongest physical move Bagon has access to, and it inflicts no recoil thanks to Rock Head. Brick Break is the best option for hitting Porygon, Magnemite, and or Anorith. Hidden Power Ghost hits Duskull and Gastly, which would otherwise wall Bagon with their immunities to Normal and Fighting. Dragon Dance is one of the best setup moves in the game, and Bagon is able to find opportunities to use it fairly easily against prevalent Pokemon such as specially defensive Diglett, Houndour, and Porygon lacking Thunder Wave. After one Dragon Dance, a healthy Porygon faints to a combination of Double-Edge into Brick Break, the first attack not activating Sitrus Berry and the follow-up attack doing enough damage to KO. Aside from this, frailer Pokemon like Diglett are OHKOed by +1 Double-Edge. After two Dragon Dance boosts, Bagon is able to outspeed the likes of Staryu, Voltorb and Elekid and OHKO them with Double-Edge. Getting two Dragon Dance boosts is far more difficult to pull off, however, as it leaves Bagon vulnerable to priority from Doduo and Trapinch and being revenge killed by walls that it does not OHKO if they are healthy such as Porygon and or Koffing.</p> <p>Bagon should be the focal point of teams it is on, as it needs a lot of support to set up and sweep. Dragon Dance Larvitar is one of the ideal teammates, benefiting from a lot of the same support Bagon enjoys, as well as softening up checks for each other. Duskull with Memento provides more safe opportunities to get Bagon in to set up Dragon Dance. Spikes from Cacnea, Pineco and Snorunt provide necessary chip throughout the game to help Bagon score OHKOs on Pokemon at +1 Attack, though this removes the previously mentioned route to 2HKO Porygon at +1. Diglett and Trapinch switch into and remove Voltorb and Elekid, which could otherwise come in and outspeed +1 Bagon and use either Explosion or Thunder Wave to stop the sweep. Thunder Wave users such as Chinchou and Snubbull can slow down some of the faster Pokemon in the tier, such as Abra and Voltorb, allowing Bagon to always outspeed them.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Kaboom", "user_id": 300935}], "teams": [{"name": "Quality checked by", "members": [{"username": "grape tylenol", "user_id": 593128}, {"username": "reggg", "user_id": 588561}]}, {"name": "Grammar checked by", "members": [{"username": "aurora", "user_id": 109385}]}]}
  }
}