{
  "Butterfree": {
    "comments": "<h1>Other Options</h1> <p>Butterfree can opt to use Hidden Power Fire on its Petaya Berry set to prevent Magnemite from safely setting up Substitute, but this is not recommended due to giving up valuable coverage against Ground- and Water-types like Rhyhorn and Seaking.</p> <h1>Checks and Counters</h1> <p><strong>Magnemite: Magnemite resists Butterfree's damaging moves and can avoid Sleep Powder with its Substitute. Furthermore, Magnemite can cripple Butterfree with Thunder Wave which severely limits its opportunities to spread status.</p> <p><strong>Faster Attackers</strong>: Aipom, Elekid, Tailow, and Staryu are all able to outspeed and KO Butterfree. If another foe has been put to sleep, these Pokemon can switch in relatively easily if Butterfree lacks Stun Spore. Elekid in particular poses a threat, as it can absorb status once thanks to it commonly using Lum Berry. Choice Band users, namely, Aipom, Taillow, and Pidgeotto, can all OHKO Butterfree even with maximum HP investment</p> <p><strong>Lum Berry Leads: Lum Berry leads such as Pineco and Growlithe can both OHKO Butterfree if it tries to use Sleep Powder.</p> <p><strong>Special Walls: Both Delcatty and Lileep act as phenomenal Butterfree checks. Both possess threatening STAB moves namely Body Slam and Rock Slide. Furthermore, thanks to its access to Heal Bell, Delcatty is able to limit Butterfree's usefulness. Dustox is able to wall Butterfree and remove it with Whirlwind, nullifying a boost from Petaya Berry. Butterfree can also put special walls to sleep, which leaves them vulnerable to its teammates.</p> ",
    "sets": [
      {
        "name": "Lead",
        "description": "<p>Butterfree cements itself as one of the most reliable status users thanks to Compound Eyes-boosted Sleep Powder. Paired with its above-average Speed tier, it a frightening lead, particularly versus slower leads like Snorunt, Cyndaquil, and Spoink. Sleep Powder's nigh-perfect accuracy allows Butterfree to put switch-ins or opposing leads to sleep, which makes them deadweight for most of the game. Psychic is Butterfree's strongest move, and thanks to the rarity of viable Dark- and Steel-types, it is almost drawback-free. Hidden Power Grass allows Butterfree to OHKO offensive Rhyhorn while also threatening Ground-types such as Cubone and Water-types like Seaking and Staryu. Giga Drain is an option to provide Butterfree a form of recovery that helps complement Morning Sun's low PP, though it also has low PP and is weaker. Morning Sun provides Butterfree with reliable recovery and allows it to keep itself healthy throughout the match. Butterfree can opt to use Stun Spore alongside Sleep Powder in order to neuter faster threats such as Aipom, Pidgeotto, Taillow, and Elekid. If Stun Spore is used over Morning Sun, Butterfree appreciates the limited recovery that Leftovers and Giga Drain provide.</p> <p>Butterfree fits best on offensive and balanced teams that appreciate the free turns that Sleep Powder provides. Pokemon that resist Fire-type moves pair up nicely with Butterfree such as Spoink, Seaking, and Chinchou. Chinchou is worth noting due to its additional resistances to Ice and Electric. Its access to Thunder Wave means Butterfree and Chinchou can also spread status easily. Wallbreakers such as Aipom, Castform, and Elekid all appreciate the opportunity to switch in on sleeping Pokemon. Aipom can act as an offensive pivot for Butterfree, as it threatens Butterfree's checks with Double-Edge and Brick Break. Likewise, Castform is worth mentioning, as it can tank special moves from Butterfree's checks and deal heavy damage in return. Setup sweepers such as Croconaw, Growlithe, Cubone, and Spoink appreciate the setup opportunity that Sleep Powder and Stun Spore provides them. Rock- and Steel-types such as Rhyhorn, Aron, Magnemite, and Nosepass can switch into the STAB moves of faster physical attackers that threaten Butterfree such as Pidgeotto, Taillow, and Aipom.</p> "
      },
      {
        "name": "Substitute + Petaya Berry",
        "description": "<p>Butterfree's excellent Special Attack means it is able to function as a late-game cleaner. Substitute is primarily used to activate Petaya Berry to give Butterfree the boost it needs to clean. Sleep Powder provides Butterfree with more reliable setup opportunities while also providing status support. Psychic is Butterfree's strongest move and is almost always drawback-free thanks to the lack of prominent Pokemon that resist it. Giga Drain provides Butterfree with a form of recovery while also threatening Rhyhorn. Hidden Power Grass can be used over Giga Drain for its greater PP and stronger Base Power.</p> <p>Butterfree appreciates secondary status support, so Pokemon such as Chinchou, Magnemite, and Nosepass all make great partners. Rock-types like Nosepass and Rhyhorn are worth noting thanks to their ability to wall, cripple, and KO wallbreakers such as Choice Band Aipom if it is locked into its STAB move. Nosepass can also trap and remove opposing Magnemite, another prominent Butterfree check. Pokemon that resist Fire-type moves such as Growlithe, Seaking, and Spoink all make good partners. Growlithe is able to act as a wallbreaker with Overheat making it a great partner. Additionally, wallbreakers such as Aipom, Pidgeotto, and Staryu can help weaken Pokemon that Butterfree may struggle with like Lileep, Delcatty, and Magnemite. Butterfree struggles with faster attackers like Elekid, Aipom, and Staryu, so Pokemon that can wall them such as bulky variants of Castform, Koffing, Dustox, and Lileep make great partners. Koffing is worth mentioning due to its access to Memento, which can give Butterfree an easy setup opportunity.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 479897, "username": "BeatsBlack"}, {"user_id": 535530, "username": "Gangsta Spongebob"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}], "writtenBy": [{"user_id": 272450, "username": "BP"}]}
  },
  "Bayleef": {"sets": [{"name": "Special Wall"}]},
  "Cyndaquil": {
    "comments": "<h1>Other Options</h1> <p>Hidden Power Water can be used over Hidden Power Grass to hit Fire-types such as Growlithe and opposing Cyndaquil, and it retains the ability to hit Rock-types such as Rhyhorn. However, it leaves Cyndaquil completely walled by Water-types such as Seaking, Chinchou, and Staryu. ChestoRest sets are also an option for longevity, but they are generally outclassed by the Lum Berry wallbreaker set.</p> <h1>Checks and Counters</h1> <p><strong>Priority Moves: Priority moves from Pidgeotto, Elekid, and Delibird can pick off Cyndaquil even after it activates its Salac Berry, thus shutting it down completely.</p> <p><strong>Water-types: Water-types such as Seaking and RestTalk Chinchou resist Cyndaquil's Fire Blast and do not fear Hidden Power Grass while OHKOing back with their STAB moves.</p> <p><strong>Spoink</strong>: Thanks to Thick Fat, Spoink functionally resists Fire Blast, and Hidden Power Grass does not threaten it, allowing it to use Cyndaquil as setup fodder with Calm Mind. However, it must be wary of Toxic.</p> <p><strong>Rock-types</strong>: Rock-types such as Nosepass resist Fire Blast, and Nosepass doesn't even fear Blaze, avoiding the 2HKO regardless. Nosepass also shrugs off Hidden Power Grass thanks to its immense special bulk. Lileep can also avoid a 2HKO from Fire Blast if Cyndaquil is not in Blaze range, and it can hit hard with Rock Slide or PP stall Fire Blast's 8 PP with Recover.</p> ",
    "sets": [
      {
        "name": "Lead",
        "description": "<p>Cyndaquil is one of the best leads in ADV ZU thanks to its immense power with Blaze and priority move in Quick Attack. These traits give Cyndaquil a great matchup versus leads such as Snorunt, which it completely denies entry hazards from. Endure allows Cyndaquil to activate Blaze and its Salac Berry, letting it outspeed every unboosted Pokemon. This allows Cyndaquil to beat leads that would otherwise outspeed and OHKO it, such as Aipom, although it must be careful of paralysis. Fire Blast threatens leads such as Snorunt with an OHKO and packs a huge punch with Blaze active, 2HKOing specially bulky Pokemon such as Delcatty and Grimer. It can even 2HKO some Fire-resistant Pokemon such as Staryu and Chinchou. Hidden Power Grass hits Water- and Rock-types that resist Fire Blast such as Seaking and Rhyhorn. Lastly, Quick Attack stops Snorunt from setting up Spikes and can also be used to pick off faster Pokemon, such as Elekid, at low HP.</p> <p>Cyndaquil fits very well on balance teams that are weak to Spikes due to its great matchup against Snorunt. Many Pokemon, such as Elekid, Castform, and Aipom, no longer worry about Spikes cutting into their bulk or putting them KO in range of priority moves. Cyndaquil's presence as a lead has seen several counter-leads emerge, such as Spoink and Seaking, both relatively bulky Pokemon that can set up on Cyndaquil — ; using Calm Mind and Rain Dance, respectively. As a result, Cyndaquil appreciates teammates such as Delcatty, tank Castform, and Lileep, which all check these two Pokemon. Lileep can also deal with common priority attackers such as Elekid and Pidgeotto, which shut down Cyndaquil, even with a Salac Berry boost, if they are not in KO range of Cyndaquil's Quick Attack. Shuppet also can shut down Band Pidgeotto and Tailow locked into Quick Attack, which can revenge kill Cyndaquil. Lastly, opposing Fire-types such as Growlithe and Numel can handle Cyndaquil lacking the rare Hidden Power Water, so partners such as Seaking and Chinchou may be ideal.</p> "
      },
      {
        "name": "Wallbreaker",
        "description": "<p>As a wallbreaker, Cyndaquil is very powerful with a great offensive typing, dismantling common defensive cores with Pokemon such as Dustox and Magnemite. Blaze lets Fire Blast comfortably 2HKO special walls such as Lileep and Delcatty, which it otherwise struggles with. Hidden Power Grass covers Water-types and Rock-types that resist Fire Blast such as Seaking, Nosepass, and Rhyhorn. Quick Attack can finish off low-HP faster Pokemon looking to revenge kill Cyndaquil, such as Elekid and Pidgeotto. Cyndaquil's fourth moveslot is quite flexible, with Toxic giving a much better matchup against Spoink, which would otherwise use Cyndaquil as setup fodder, while also being useful versus specially bulky Pokemon such as Lileep and tank Castform. Substitute can be used to scout switches and also to put Cyndaquil in Blaze range.</p> <p>Cyndaquil benefits greatly from Spikes via a lead like Snorunt or Pineco, which lets it 2HKO common special walls such as Delcatty with two layers, as well as specially defensive Lileep with a little chip damage. Additionally, physical wallbreakers are appreciated to deal with these special walls if Cyndaquil can't, such as Rhyhorn, Pidgeotto, and Aipom. Cleaners such as Elekid appreciate Cyndaquil wallbreaking for them. Elekid is also notable for threatening Water-types that can cause Cyndaquil trouble. Cyndaquil can also struggle versus Rock-types such as Nosepass. Additionally, Spoink walls Cyndaquil thanks to Thick Fat and can use it as setup fodder. Delcatty and tank Castform check these Water-types and Spoink quite well, with the latter also checking various Rock-types such as Lileep.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 535530, "username": "Gangsta Spongebob"}, {"user_id": 272450, "username": "BP"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}], "writtenBy": [{"user_id": 595639, "username": "plznostep"}]}
  },
  "Croconaw": {"sets": [{"name": "Swords Dance"}]},
  "Castform": {"sets": [{"name": "Mixed Tank"}, {"name": "Choice Band"}, {"name": "Special Attacker"}]},
  "Koffing": {
    "comments": "<h1>Other Options</h1> <p>Koffing can opt to use Explosion, as most Rock- and Steel-types are too threatened by Hidden Power Grass and Flamethrower to safely switch in. Fire Blast is an option over Flamethrower to OHKO Naughty Delibird; however, Koffing appreciates the extra PP that Flamethrower provides. Taunt can be used to prevent opposing defensive Pokemon and setup sweepers from taking advantage of Koffing.</p> <h1>Checks and Counters</h1> <p><strong>Special Attackers: Spoink, Staryu, and Growlithe can all threaten Koffing with their STAB attacks. Staryu is worth noting because it can absorb Koffing's Will-O-Wisp with Natural Cure and use Recover to mitigate any damage.</p> <p><strong>Magnemite: Magnemite's immunity to Koffing's STAB moves and base 95 Special Attack allow it to reliably check Koffing forgoing Fire-type coverage.</p> <p><strong>Bulky Poison-types</strong>: Grimer and Dustox are able to take advantage Koffing's overall passiveness. Dustox's reliable recovery, Psychic-type coverage, and considerable bulk allows it to threaten Koffing. Grimer can use Koffing as setup fodder if it lacks Haze or Taunt.</p> ",
    "sets": [
      {
        "name": "Defensive",
        "description": "<p>Levitate in conjunction with stellar bulk allow Koffing to switch into all of Rhyhorn's moves reliably, making Koffing an excellent defensive pivot. Leftovers and Koffing's low base HP enable it to stay healthy by using Pain Split. Sludge Bomb threatens offensive Pokemon such as Aipom, Pidgeotto, and Taillow; it also discourages special attackers such as Elekid and Growlithe from switching in. Hidden Power Grass answers Ground-types such as Rhyhorn and Cubone more effectively. Will-O-Wisp cripples physical attackers such as Aipom, Cubone, and Pidgeotto. Alternatively, Flamethrower prevents Magnemite from taking advantage of Koffing's passiveness.</p> <p>Koffing fits best on balance and defensive teams due to its passive nature. Koffing pairs well with Pokemon that struggle with Rhyhorn such as Aipom, Pidgeotto, and Tailow. Castform checks common Pokemon that Koffing tends to struggle with such as Staryu, Elekid, and Dustox. Pokemon that appreciate a Ground-type immunity such as Chinchou, Elekid, and Magnemite all pair well with Koffing. Koffing struggles against special attackers such as Elekid, Staryu, and Growlithe so specially defensive pokemon such as Delcatty, Dustox, and Sunflora are integral in providing support. Delcatty is worth noting, as it can Wish pass to help remedy Koffing's lack of reliable recovery. Koffing struggles with other bulky Poison-types like Grimer and Dustox, so physical attackers like Rhyhorn, Aipom, and Cubone pair well with it.</p> "
      },
      {
        "name": "Utility",
        "description": "<p>Koffing comes equipped with an expansive utility movepool, Ground-type immunity, and excellent physical defense. This means Koffing can choose to play a more supportive role alongside its potency as a physical wall. Memento allows Koffing to safely bring in setup sweepers and wallbreakers against a foe. Alternatively, Koffing can choose to use Destiny Bond, which can force out faster threats that may not OHKO it. Destiny Bond can also force trades with threats like Aipom and Elekid. Koffing can opt to use Toxic in order to threaten defensive Pokemon such as Lileep. Haze can be used to shut down opposing setup sweepers that may abuse Koffings passiveness, such as Growlithe and Spoink.</p> <p>Rain and sun sweepers such as Seaking, Horsea, and Sunflora all appreciate Memento support to set up their respective weather. Setup sweepers such as Croconaw, Growlithe, and Spoink all appreciate the setup opportunity that Memento provides. Pokemon that struggle with physical attackers, such as Castform, Delcatty, and Sunflora, all appreciate Koffing's physical bulk. Koffing struggles against other defensive Pokemon, so wallbreakers such as Aipom, Staryu, and offensive Chinchou pair well with it.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 479897, "username": "BeatsBlack"}, {"user_id": 535530, "username": "Gangsta Spongebob"}]}, {"name": "Grammar checked by", "members": [{"user_id": 375662, "username": "Isaiah"}]}], "writtenBy": [{"user_id": 272450, "username": "BP"}]}
  },
  "Pidgeotto": {
    "comments": "<h1>Other Options</h1> <p>Hidden Power Ground can be used to OHKO Magnemite and hit Shuppet, unlike Hidden Power Fighting. However, Hidden Power Ground cannot hit Lileep for significant damage, which can be problematic for Pidgeotto. Hidden Power Flying hits harder than Aerial Ace, but Pidgeotto must then use Steel Wing as coverage, meaning it cannot threaten Pokemon such as bulky Magnemite for a 2HKO.</p> <h1>Checks and Counters</h1> <p><strong>Physical Walls: Physical walls such as Koffing can switch into Pidgeotto locked into the wrong move and force it out. Most notably, bulky Rhyhorn, physically defensive Lileep, and Nosepass are not fazed by Pidgeotto's STAB combination or 2HKOed by its coverage, significantly reducing Pidgeotto's offensive presence. Lileep also has Recover to continuously counter Pidgeotto, while Rhyhorn can be problematic for Pidgeotto's team if Pidgeotto gives it a free turn of setup. Physically bulky Steel-Types such as bulky Magnemite and Aron don't mind Pidgeotto's STAB combination either, but they must be wary of a super effective Hidden Power.</p> <p><strong>Electric-Types: Some Electric-Types such as Elekid outspeed Pidgeotto and can OHKO it with Thunderbolt; others such as Chinchou can come in and KO Pidgeotto if it's is locked into Aerial Ace. Magnemite resists both STAB types and threatens Pidgeotto with Thunderbolt, although it must be wary of a super effective Hidden Power.</p> <p><strong>Shuppet: Shuppet is immune to Double-Edge and Hidden Power Fighting, letting it completely stop Pidgeotto with a good prediction</p> <p><strong>Faster Attackers</strong>: Faster attackers such as Aipom, Elekid, Tailow, and Staryu can all outspeed Pidgeotto and threaten it with strong attacks, although they must be careful to avoid getting chipped down into Quick Attack range.</p> ",
    "sets": [
      {
        "name": "Physical Wallbreaker",
        "description": "<p>Pidgeotto stands out as a great physical wallbreaker thanks to its great STAB moves in Double-Edge and Aerial Ace, which can 2HKO common walls such as Dustox, Delcatty, and Bayleef, and it's good speed tier outpacing Pokemon such as Butterfree, Castform, and Chinchou. Pidgeotto faces competition from another Normal / Flying type, Taillow, who has a better Speed and a useful ability in Guts. However, Pidgeotto has better attack and bulk. It avoids OHKOs from walls such as Dustox and Delcatty after Double-Edge recoil, as well as outright OHKOs from powerful attacks: Double-Edge from non-Choice Band Aipom and Castform, for example, and Aerial Ace from Choice Band Delibird. Return can be used over Double-Edge to help Pidgeotto stay healthy, but it will be harder to get targets into KO range. STAB Quick Attack revenge kills faster Pokemon such as Aipom, Elekid, and Delibird. Hidden Power Fighting can threaten Pokemon that don't mind Pidgeotto's STAB combination such as Rhyhorn, bulky Magnemite, and specially defensive Lileep. Steel Wing can be used to ease prediction versus Shuppet, or if you are using Hidden Power Flying over Aerial Ace for the power. Here, Steel Wing lets Pidgeotto still threaten Rock-types like specially defensive Lileep and Nosepass. However, without a super effective Hidden Power, Pidgeotto cannot threaten to 2HKO Steel-Types such as bulky Magnemite.</p> <p>Pidgeotto fits very well on balance and offense teams as a wallbreaker. It can remove Pokemon such as Delcatty, Dustox, and Bayleef, which can open up teammates such as Elekid, Staryu, and Rhyhorn. Pidgeotto appreciates Spikes support from Snorunt and Pineco, which helps chip Pokemon like Elekid and Aipom into Quick Attack range over time. Spikes also allows Pidgeotto to 2HKO Pokemon it normally can't like bulky Rhyhorn. Special walls such as Chinchou and Delcatty are excellent checks to faster special attackers such as Elekid and Staryu, with Delcatty also offering cleric support if Pidgeotto gets burned by Pokemon such as Koffing. Rock-Types such as Rhyhorn and Nosepass can switch into Aipom and Taillow's STAB moves as they try to revenge kill Pidgeotto. Nosepass has the added benefit of trapping bulky Magnemite, a common Pidgeotto check. Also, Pidgeotto's Grass resistance also helps Rock-Types versus Pokemon such as Bayleef and Butterfree. Special attackers such as Elekid and Spoink can remove physical walls such as Rhyhorn, bulky Magnemite, and Koffing, which allows Pidgeotto to use its STAB moves without being punished.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 272450, "username": "BP"}, {"user_id": 535530, "username": "Gangsta Spongebob"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}], "writtenBy": [{"user_id": 595639, "username": "plznostep"}]}
  },
  "Growlithe": {"sets": [{"name": "Agility"}, {"name": "Lead"}]},
  "Magnemite": {"sets": [{"name": "Substitute + Status"}]},
  "Grimer": {
    "comments": "<h1>Other Options</h1> <p>Hidden Power Water can be used for its ability to smash Rhyhorn while at the same time providing a means to hit Aron and Ground-types such as Cubone for heavy damage. Likewise, Hidden Power Ground can be used to lure in Magnemite and Aron, and at the same time deal significant damage to Rhyhorn. However, it is difficult to justify using either Hidden Power over any of Grimer's other moves. Grimer can be used as a weather setter due to its access to Rain Dance, Sunny Day, and Explosion.</p> <h1>Checks and Counters</h1> <p><strong>Ground-types: Rhyhorn's double resistance to Poison means that even a boosted Sludge Bomb does negligible damage, while it can easily KO Grimer with Earthquake and abuse its presence to set up a Substitute and threaten the rest of Grimer's team. Other Ground-types such as Cubone and Numel can do the same, but their lower bulk and single resistance to Poison mean they can't switch in as easily, and due to its lack of Leftovers, Cubone in particular is very susceptible to Sludge Bomb's poison chance.</p> <p><strong>Steel-types: Magnemite and Aron are immune to Grimer's Sludge Bomb, meaning they cannot be harmed by non-Hidden Power sets.</p> <p><strong>Physical Wallbreakers</strong>: Physical wallbreakers such as Aipom and Taillow can overwhelm Grimer before it can set up.</p> <p><strong>Koffing: Koffing can run Taunt or Haze to completely shut down Grimer, with the former denying Grimer the ability to set up or use Rest and the latter letting Koffing easily PP stall Grimer.</p> <p><strong>Phazers</strong>: Phazers such as Dustox and Wailmer can stop Grimer's sweep, though this does not work against a Grimer that is the last Pokemon on its team.</p> ",
    "sets": [
      {
        "name": "CroMer",
        "description": "<p>Grimer's good bulk, combined with its access to Curse, lets it turn both prominent special attackers, such as Elekid and Staryu, and walls, such as Delcatty and Lileep, into setup fodder. Rest allows Grimer to avoid being worn down, while Sleep Talk prevents Grimer from being passive while it's asleep. Maximum investment into Grimer's special bulk allows it to sponge special hits as effectively as possible, complimenting Curse's Defense boost.</p> <p>Grimer best fits on teams looking for a win con that can also function as a special wall against threats such as Elekid and Cyndaquil. Grimer traditionally sees itself used on balance and bulky offense teams, though Rain offense can also make use of its high special bulk and ability to pick off weakened foes. Grimer is incapable of making any meaningful progress against Magnemite, Rhyhorn, and Aron, and thus checks to them are essential for it to function. The former can be handled by special tanks and walls, such as Chinchou or Bulky Castform, who have the added benefit of acting as a substitute special wall if Grimer is forced out while asleep. Rhyhorn and Aron, on the other hand, can usually be checked by Water- and Grass-types such as Staryu and Bayleef. Koffing is another notable partner, as while it and Grimer share the same typing, Koffing completely walls Rhyhorn and Aron, neutering 2 of Grimer's worst matchups, while in return, Grimer handles special attackers that give Koffing trouble. Delcatty is another partner that deserves a special mention, as it can use Wish and Heal Bell to keep Grimer healthy, but its cleric sets also struggle to touch the same Pokemon Grimer struggles with. Finally, Rock- and Steel-types such as Lileep and Magnemite make good partners due to their ability to check powerful Normal-type attackers such as Aipom and Taillow, who can usually overwhelm Grimer before it can set up.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 272450, "username": "BP"}, {"user_id": 479897, "username": "BeatsBlack"}]}, {"name": "Grammar checked by", "members": [{"user_id": 277988, "username": "dex"}]}], "writtenBy": [{"user_id": 535530, "username": "Gangsta Spongebob"}]}
  },
  "Onix": {"sets": [{"name": "Sun Setter"}]},
  "Voltorb": {"sets": [{"name": "Rain Setter"}]},
  "Horsea": {"sets": [{"name": "Offensive Rain Dance"}]},
  "Seaking": {"sets": [{"name": "Offensive Rain Dance"}, {"name": "Toxic + Protect"}]},
  "Staryu": {
    "comments": "<h1>Other Options</h1> <p>Hidden Power Grass can 2HKO Chinchou, though Staryu can’t easily afford to give up Ice Beam or Thunderbolt. Psychic can 3HKO Dustox after a layer of Spikes and Grimer without resorting to Hydro Pump, though its use is limited outside those two targets. Toxic cripples special walls like Lileep and Sunflora, though Staryu is already strapped for moveslots and cannot afford space for it.</p> <h1>Checks and Counters</h1> <p><strong>Grass-types: Grass-types like Lileep, Sunflora, and Bayleef can switch into Staryu, avoid being 2HKOed by Ice Beam, and threaten it back with their STAB attacks.</p> <p><strong>Specially Defensive Walls: Dustox and Delcatty have enough special bulk to stomach any two hits from full health and safely wall Staryu. They can proceed to pressure it with either Toxic or Body Slam, respectively. Grimer can set up Curse in front of Staryu with its great special bulk, forcing it out.</p> <p><strong>Electric-types: Chinchou tanks all of Staryu's moves and can threaten it back with Thunderbolt. Faster Electric-types like Elekid and Voltorb can offensively check Staryu but cannot switch into it.</p> ",
    "sets": [
      {
        "name": "Special Attacker",
        "description": "<p>With fantastic Speed, great coverage, and respectable Special Attack, Staryu stands out as a great Water-type in ADV ZU. Thunderbolt hits Water-types like Seaking and opposing Staryu hard. Ice Beam targets Grass-types like Bayleef and Lileep and pressures them into using their recovery moves. Rapid Spin makes it an emergency Spikes remover. Recover alongside Natural Cure makes Staryu a reliable status absorber against defensive stalwarts like Dustox and Koffing, as well as being a consistent offensive threat. Maximum Speed and a Jolly nature allow Staryu to Speed tie with Aipom, Taillow, and opposing Staryu.</p> <p>Staryu operates well as a revenge killer, picking off slower foes like Seaking, Rhyhorn, and Pidgeotto with relative ease. On teams vulnerable to Spikes, Staryu is a great pick thanks to Rapid Spin. However, it must be aware of sturdy special walls like Lileep, Delcatty, and Dustox, since they can wall it with ease. As teammates, the aforementioned special walls—alongside specially defensive Rhyhorn—can check Elekid, one of Staryu's worst matchups; Elekid in turn can be used to check other Staryu. Physical wallbreakers such as Aipom, Cubone, and Pidgeotto are especially good partners, as they have trouble dealing with Pokemon like Koffing; Staryu can switch into Will-O-Wisp and threaten Koffing due to its Natural Cure and Koffing's low Special Defense. Special wallbreakers such as Cyndaquil and Growlithe can wallbreak early-game to let Staryu clean late-game.</p> "
      },
      {
        "name": "Defensive",
        "description": "<p>With a bulkier EV spread, Staryu is the tier's premier Rapid Spin user with its acceptable bulk and high Speed. Thunderbolt targets Water-types like Seaking and opposing Staryu. Recover allows Staryu to reliably use Rapid Spin, as well as negating Spikes damage. Natural Cure allows it to absorb status from Koffing and Dustox.</p> <p>Teams that struggle against Spikes teams appreciate Staryu absorbing status, providing Speed control, and being a good Rapid Spin user, though Staryu should ideally remain healthy to continually clear Spikes. Special walls like Delcatty and Dustox can easily take its hits, so physical wallbreakers like Aipom, Rhyhorn, and Taillow are appreciated. Cleaners like Elekid, Aipom, and Seaking can sweep more easily without enemy Spikes, and they are free to run other items besides, like Lum Berry. Bulky Grass-types like Bayleef and Sunflora can easily switch into Staryu and retaliate, so it appreciates Fire-types like Cyndaquil and Growlithe, which can threaten them back. Given its merely good power, it can struggle to secure KOs, so it appreciates both physical and special walls to fall back on like Lileep, Dustox, and Delcatty; the latter two can check Elekid and spread status.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 535530, "username": "Gangsta Spongebob"}, {"user_id": 272450, "username": "BP"}]}, {"name": "Grammar checked by", "members": [{"user_id": 577920, "username": "Tea Guzzler"}, {"user_id": 517429, "username": "Adeleine"}]}], "writtenBy": [{"user_id": 543866, "username": "5Dots"}]}
  },
  "Chinchou": {"sets": [{"name": "Special Attacker"}, {"name": "RestTalk"}]},
  "Aipom": {
    "comments": "<h1>Other Options</h1> <p>Body Slam can be used over Return to inflict paralysis, but it is generally too inconsistent to be worthwhile. Focus Punch is Aipom's strongest coverage option against Rock- and Steel- types, though if locked into Focus Punch, Aipom is extremely exploitable, and non-Choice Band sets still don't OHKO many Rock- and Steel-types. Aipom can run a dedicated SubPunch set to more easily use Focus Punch, but then Aipom cannot use Baton Pass, which it is forbidden to use with Substitute. An Adamant nature could be used for more power, though no longer outspeeding Delibird or tying with threats such as Taillow usually makes this not worth it.</p> <h1>Checks and Counters</h1> <p><strong>Rock- and Steel-types: Rock- and Steel-types such as Nosepass, bulky Magnemite and Aron can easily switch into Double-Edge and force Aipom out. Rhyhorn and Lileep deserve a special mention, as the former is exceptionally dangerous if Aipom lets it get a free Substitute, while the latter has Recover. However, Brick Break still does sizable damage to most Rock- and Steel-types, especially with Choice Band, then OHKOing or 2HKOing all but Lileep and Nosepass. Toxic also cripples the Rock-types meant to check it.</p> <p><strong>Shuppet: Shuppet is immune to Aipom's common attacks bar Shadow Ball, and it can set up a Substitute while forcing it out. However, it must be wary of status and Shadow Ball.</p> <p><strong>Faster Threats</strong>: Though only Voltorb, Luvdisc, and Elekid naturally outspeed Aipom, they can easily force it out, especially after it has been chipped into their KO ranges. Additionally, setup sweepers such as Bagon and Cyndaquil, and weather sweepers such as Seaking and Sunflora, can outspeed and often even OHKO Aipom under optimal conditions.</p> <p><strong>Residual Damage: The high amount of recoil from Double-Edge wears Aipom down very quickly, especially when compounded with Spikes and Toxic.</p> ",
    "sets": [
      {
        "name": "Choice Band",
        "description": "<p>Choice Band Aipom's powerful Double-Edge and blistering fast base 85 Speed make it an excellent lead, mid-game wallbreaker, and cleaner. Brick Break serves as crucial coverage to hit Double-Edge's most common switch-ins, Rock- and Steel-types such as Rhyhorn and Magnemite, super effectively. Shadow Ball targets Shuppet, the only Ghost-type in the tier, but if that isn't a concern, Aipom can run Return instead to reduce the need for taking Double-Edge recoil. Finally, Baton Pass can scout switches, allowing Aipom's team to maintain momentum, something particularly important if Choice Band Aipom is used as a lead.</p> <p>Choice Band Aipom best fits on offense and balance teams looking for a formidable progress-maker. In return, it appreciates physical and special walls such as Koffing, Lileep, and Dustox: they can switch into threats that either outspeed Aipom or exploit its Choice lock to switch in, such as Elekid and Rhyhorn, respectively. Additionally, while it does possess Brick Break to hit Rock- and Steel-types, Choice Band Aipom enjoys support from special wallbreakers such as offensive Chinchou and Growlithe to deal with those threats, as they minimize its need for prediction. Aipom, in return, handles troublesome special walls. Toxic support also works very well against Rock-types, notably hindering Aipom's hardest counter, Lileep. Choice Band Aipom breaking through special walls also makes it a good partner for Elekid, which in turn threatens Pokemon that Speed tie Aipom, such as opposing Aipom, Taillow, and Staryu. Finally, other physical wallbreakers such as Taillow and Pidgeotto work very well with Aipom, as they can weaken each other's checks while offering a backup if the other faints.</p> "
      },
      {
        "name": "Lead Utility",
        "description": "<p>Lead Utility Aipom leverages its high Speed and strong utility options to defeat most other leads, and it's also a solid revenge killer later in the game. Taunt, Thunder Wave, and Toxic most notably deny Endure setup from opposing leads, with the former also stopping Spikes and recovery from walls, Thunder Wave paralyzing targets to help slower teammates, and Toxic allowing it to outright break past walls. Double-Edge is Aipom's strongest attack, allowing it to OHKO many leads such as Snorunt and Cyndaquil, while Brick Break lets it hit Rock- and Steel-types for significant damage. Baton Pass lets Aipom scout switches and gain momentum, making it extremely hard to pin down and KO due to its high Speed. Silk Scarf allows Aipom to somewhat maintain its role as a wallbreaker if it is not running Toxic, though Leftovers can be used instead to increase its longevity by offsetting some of the recoil from Double-Edge.</p> <p>Lead Utility Aipom best fits on offense and balance teams as a versatile lead, bringing respectable offensive presence and utility later in the game. If it's not running Toxic, physical and special wallbreakers such as Rhyhorn and Chinchou are essential, as they break through walls Aipom struggles to beat, such as Nosepass and Lileep. Even with Toxic, it still appreciates these teammates, as Koffing remains an issue. Walls like Dustox and Koffing can switch into threats that can outdamage Aipom, like the aforementioned walls and also offensive threats such as Elekid and Rhyhorn, threatening to status them or weaken them into KO range of Aipom's attacks. Finally, if Aipom's running Thunder Wave, slow wallbreakers such as Rhyhorn, Cubone, and Croconaw appreciate their targets being made slower, as do walls such as Lileep and Nosepass.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 272450, "username": "BP"}, {"user_id": 393917, "username": "wooper"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}], "writtenBy": [{"user_id": 535530, "username": "Gangsta Spongebob"}]}
  },
  "Sunflora": {"sets": [{"name": "SunnyBeam"}, {"name": "Special Wall"}]},
  "Delibird": {"sets": [{"name": "Choice Band"}]},
  "Elekid": {
    "comments": "<h1>Other Options</h1> <p>Elekid can use Thunder Wave to provide paralysis support. Magnet is an option to power up Thunderbolt, but the extra damage is generally outclassed by the survivability offered by Lum Berry and Leftovers. Psychic can be used to more substantially chip Dustox, but it still fails to 3HKO. Elekid can opt to use Ice Punch on sets without Toxic in order to hit Lileep harder; however, Toxic is almost always preferred due to it severely limiting Lileep's effectiveness as a wall.</p> <h1>Checks and Counters</h1> <p><strong>Special Walls: Pokemon such as Delcatty, Dustox, Lileep, and Sunflora can all wall Elekid despite its coverage. However, Delcatty and Lileep must be wary of Focus Punch when switching in or using a recovery move. Dustox is worth noting, as its Toxic immunity and bulk prevent it from being even remotely threatened by Elekid. Moreover, Shield Dust prevents Dustox from being crippled from secondary effects such as Thunderbolt's paralysis and Psychic's Special Defense drop. Grimer can switch into Elekid and use it as setup fodder.</p> <p><strong>Bulky Attackers: Bulky attackers such as Castform, Chinchou, Seaking, Cubone, and specially defensive Rhyhorn can all threaten Elekid. However, they can be overwhelmed with chip damage. Moreover, offensive Chinchou variants are 2HKOed by Hidden Power Grass. If using Substitute, Elekid must be weary of Cubone's Bonemerang.</p> <p><strong>Priority Users: Pokemon with Quick Attack such as Pidgeotto, Delibird, and Tailow can pick off Elekid relatively early due to its frailty.</p> ",
    "sets": [
      {
        "name": "All-Out Attacker",
        "description": "<p>Elekid is one the defining threats in ADV ZU thanks to its excellent Speed tier, great coverage options, and respectable Special Attack. Elekid functions as a lead, revenge killer, and late-game cleaner. Thunderbolt threatens common offensive Pokemon such as Aipom, Pidgeotto, Tailow, and Delibird. Fire Punch hits Steel- and Grass-types such as Magnemite and Bayleef while Hidden Power Grass provides coverage for Chinchou and Ground-types like Rhyhorn and Cubone. Quick Attack is an option that picks off weakened foes, particularly Delibird, Pidgeotto, and Taillow looking to revenge kill with a Quick Attack of their own. Quick Attack also helps remove weakened weather and setup sweepers. Toxic cripples opposing switch-ins like Castform and Lileep. Elekid can opt to use Leftovers instead of Lum Berry; however, Elekid much prefers the one-time status immunity against Butterfree, Nosepass, and Chinchou.</p> <p>Elekid excels on balance and offensive teams that require a late-game cleaner or an offensive check to attackers such as Aipom, Staryu, Pidgeotto, Delibird, and Tailow. Ironically, these same attackers also pair well with Elekid, as they appreciate not having to risk a Speed tie with their opposites. Physical wallbreakers such as Aipom, Pidgetto, and Taillow are worth mentioning, as they form a frightening attacking core and power through special walls and bulky attackers such as Dustox, Delcatty, and Castform. Elekid appreciates bulkier Pokemon that complement it offensively such as Castform, Seaking, and Sunflora. Pivots such as Koffing, Staryu, and Aipom provide Elekid with more opportunities to switch in. Koffing is worth noting, as Elekid appreciates its Ground-type immunity and ability to check specially defensive Rhyhorn.</p> "
      },
      {
        "name": "Substitute",
        "description": "<p>Elekid's excellent Speed tier and its plethora of coverage options allow it to shine as a Substitute user. Substitute allows Elekid to scout switch-ins and gives it more opportunities to use Focus Punch. Thunderbolt is a powerful and reliable attack that overwhelms all but dedicated special walls. Focus Punch threatens common switch-ins, most notably Castform and Delcatty. Cross Chop provides the same coverage and is less prediction reliant, but weaker and less accurate. Alternatively, Elekid can opt to use Fire Punch alongside a Timid nature specifically for Grass-types such as Bayleef and Exeggcute. Hidden Power Grass threatens Electric-immune Pokemon such as Chinchou, Rhyhorn, and Cubone.</p> <p>Substitute Elekid fits best on balance and offensive teams that appreciate Elekid's ability to threaten Delcatty and Castform with Focus Punch; special attackers such as Gowlithe, Cyndaquil, and Staryu are good examples. Growlithe and Cyndaquil are worth mentioning, as they threaten Dustox, Elekid's premier counter. These Pokemon also greatly appreciate Elekid's Speed. Spikes support from Pineco and Snorunt helps increase Elekid's effectiveness as an offensive threat. Elekid appreciates bulkier Pokemon that it can switch into after its Substitute has been removed such as Delcatty, Koffing, Sunflora, and Castform. Delcatty is worth noting due to the added benefit of Wish support. Physical wallbreakers such as Aipom and Pidgeotto can further threaten special walls for Elekid, most notably Dustox.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 535530, "username": "Gangsta Spongebob"}, {"user_id": 479897, "username": "BeatsBlack"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 272450, "username": "BP"}]}
  },
  "Dustox": {
    "comments": "<h1>Other Options</h1> <p>Other offensive moves like Hidden Power Grass and Thief can be used over Whirlwind, letting Dustox lure in Rhyhorn or steal Leftovers from defensive stalwarts like Lileep and Koffing, respectively.</p> <h1>Checks and Counters</h1> <p><strong>Magnemite: Magnemite can wall anything Dustox can do. It can then freely attack, forcing Dustox to use Moonlight. However, if at least one layer of Spikes is up, Whirlwind can annoy it.</p> <p><strong>Physical Attackers</strong>: Dustox's low physical bulk allows most Choice Band users to 2HKO it, like Aipom, Pidgeotto, and Taillow. Strong attackers like Rhyhorn and Cubone can also 2HKO it as well. Taillow in particular enjoys switching into Toxic thanks to Guts, with the power boost allowing it to OHKO Dustox.</p> <p><strong>Super Effective Moves: Super effective attackers like Delibird, Growlithe, and Cyndaquil can outspeed and easily KO Dustox, forcing it out.</p> ",
    "sets": [
      {
        "name": "Specially Defensive",
        "description": "<p>Dustox is an elite special wall that checks many prominent special attackers, like Elekid, Chinchou, and Staryu. Thanks to its Toxic immunity, Toxic users like Lileep and Bayleef cannot cripple it. An option over Sludge Bomb is Psychic, which targets Koffing, Grimer, and opposing Dustox, and it should be run with a Calm nature. Toxic cripples walls and offensive Pokemon that would otherwise counter Dustox, such as Lilieep, Delcatty, Growlithe, and Aipom. Whirlwind synergizes well with Spikes users, racking up additional Spikes damage, while phazing setup sweepers like Grimer and Spoink in an emergency. Protect scouts Choice-locked Pokemon like Taillow, Aipom, and Pidgeotto. 16 Speed EVs allow it to outpace Adamant Cubone.</p> <p>Due to Dustox's low physical bulk, it appreciates physical walls such as Lileep and Koffing. Wallbreakers like Pidgeotto and Seaking appreciate Dustox switching into fast special attackers like Elekid and Staryu. Seaking particularly pairs well with Dustox, which has type synergy with it and beats Pokemon Seaking's coverage moves don't cover, like Bayleef and Sunflora. Normal-types like Taillow, Castform, and Aipom appreciate Dustox providing Toxic support against Rock-types like Rhyhorn and Lileep, making them easier to break through over the course of a game. Snorunt and Pineco enjoy its Whirlwind.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 272450, "username": "BP"}, {"user_id": 535530, "username": "Gangsta Spongebob"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}], "writtenBy": [{"user_id": 543866, "username": "5Dots"}]}
  },
  "Taillow": {"sets": [{"name": "Choice Band"}]},
  "Lileep": {
    "comments": "<h1>Other Options:</h1> <p>Lileep can run a specially defensive set with a Sassy nature to check special attackers like Chinchou and Staryu more easily; however, this makes it worse against the physical attackers it is often tasked with handling. Lileep can also trade Rock Slide for Ancient Power to potentially gain a boost; however, the loss in both power and PP is quite noticeable. Lastly, Lileep can sometimes use Hidden Power Ground to hit Magnemite; however, losing its Grass-type STAB move makes it significantly worse against the Rock- and Water-types it otherwise checks.</p> <p>Checks and Counters:</p> <p><strong>Ice-Type coverage: Specially offensive Castform threatens to 2HKO with Ice Beam. Elekid and Staryu can make it difficult for Lileep to switch in with the threat of a freeze from their Ice-type coverage moves.</p> <p><strong>Taunt: Taunt users like Spoink and Shuppet completely shut down Lileep's healing and Toxic, making it far less effective.</p> <p><strong>Poison-types: Poison types such as Koffing and Grimer completely wall Lileep.</p> <p><strong>Toxic Users: Toxic from Pokemon like opposing Lileep, Chinchou, Dustox, and Elekid severely cripples Lileep, putting it on a timer every switch-in and severely limiting its capabilities as a wall.</p> <p><strong>Setup Sweepers: Thanks to their Lum Berries, setup sweepers like Sunflora and Bagon can use Lileep as setup fodder.</p> ",
    "sets": [
      {
        "name": "Wall",
        "description": "<p>Lileep is the defining wall of ADV ZU as a result of its reliable recovery, fantastic bulk, and Rock / Grass-typing, which allows it to wall common physical threats like Aipom, Pidgeotto, and Tailow. Critically, it can sponge STAB Double-Edge from these Normal-types and heal off the damage, and it is one of the best checks to Rhyhorn in the tier. Offensive Rhyhorn is the most problematic set for Lileep, able to 2HKO it with Megahorn; even then, however, Lileep OHKOes with its Grass-type STAB move and can tank a Megahorn after switching into a STAB move, meaning the matchup overall favors Lileep. Toxic cripples most switch-ins and pressures the Pokemon Lileep switches into like Aipom and Delcatty. Rock Slide hits prominent threats including Pidgeotto, Taillow, and Delibird for super effective damage. Hidden Power Grass threatens Ground-types such as Cubone and Rhyhorn and Water-types such as Staryu and Chinchou. Alternatively, Giga Drain trades power and PP for additional recovery.</p> <p>Lileep supports any and all teammates, especially defensive cores that would otherwise crumple to Normal-types. It appreciates having status absorbers and fellow defensive pivots like Delcatty, Grimer, and Dustox, while in turn they appreciate Lileep’s ability to threaten Ground- and Rock-types like Rhyhorn and Nosepass. Delcatty in particular provides valuable cleric support to Lileep. Growlithe and Magnemite are offensive wallbreakers that appreciate Lileep threatening these foes as well; in turn, they threaten opposing Lileep, Dustox, Koffing, and Magnemite. Normal-types like Aipom, Taillow, and Pidgeotto also enjoy Lileep weakening Rock-types. They weaken opposing Toxic absorbers for Lileep, and they threaten offensive Pokemon including Spoink, Growlithe, and Cyndaquil. Water-type wallbreakers like Seaking and offensive Chinchou appreciate Lileep reliably checking opposing Grass-types like Exeggcute and Bayleef; in turn, they handle offensive Fire-types and threaten walls like Koffing and opposing Lileep.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 272450, "username": "BP"}, {"user_id": 535530, "username": "Gangsta Spongebob"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}], "writtenBy": [{"user_id": 598623, "username": "BaitWiz"}]}
  },
  "Snorunt": {
    "comments": "<h1>Other Options</h1> <p>Hidden Power Fire is an option for threatening opposing Snorunt leads and Magnemite. However, without Hidden Power Grass, Snorunt cannot reliably threaten Water-types such as Staryu and Chinchou for any significant damage. Hidden Power Water is an option to threaten Fire-types such as Cyndaquil and Growlithe, which otherwise use Snowrunt as setup fodder, but it comes with the same flaws that Hidden Power Fire does.</p> <h1>Checks and Counters</h1> <p><strong>Taunt: Faster Taunt users such as Spoink and Aipom can completely deny Snorunt from Spikes on the field, and they can either use it as setup fodder or OHKO it outright.</p> <p><strong>Status Spreaders: Status spreaders such as Aipom, Magnemite, and Butterfree can cripple Snorunt with paralysis, making Salac Berry useless. Butterfree is notable for sleeping Snorunt before it even has a chance to set up Spikes, incapacitating Snorunt for most the game.</p> <p><strong>Setup Sweepers Setup Sweepers such as Growlithe and Spoink do not fear any of Snorunt's moves and can use Snorunt as set up fodder. However, Growlithe cannot consistently stop Snorunt from setting up Spikes.</p> <p><strong>Rapid Spin</strong> Hazard Removal from Rapid Spinners such as Staryu can completely ruin Snorunt's effectiveness by removing Spikes</p> <p><strong>Priority Moves</strong>: Priority moves from Pokemon such as Pidgeotto, Elekid, and Cyndaquil can pick off Snorunt even when it has activated its Salac Berry. Cyndaquil is notable for also OHKOing Snorunt before it can set up Spikes.</p> ",
    "sets": [
      {
        "name": "Spikes Lead",
        "description": "<p>Snorunt may look like a horrible Pokemon in ADV ZU at first glance due to its horrible stats and abysmal defensive utility, but Spikes grants its team a powerful form of support. Ice Beam is a great STAB option that also threatens common Pokemon such as Pidgeotto and Lileep. Hidden Power Grass allows Snorunt to threaten the most prominent spinner in the tier, Staryu, alongside other Water-types such as Chinchou and Seaking. Finally, Endure allows Snorunt to activate its Salac Berry and outspeed every unboosted Pokemon bar Voltorb, meaning it will always be able to get a layer of spikes versus Pokemon without priority or a status move.</p> <p>Snorunt fits best on offensive and balance teams that benefit from Spikes support. Due to Snorunt's prevalence as a lead, it often faces counter-leads that can shut down Spikes such Aipom, Butterfree, and Cyndaquil. Some partners that can deal with these threats are Elekid, Seaking, and Magnemite. These partners, and other offensive threats also enjoy Spikes chipping down Pokemon that are otherwise tough matchups for them, such as Delcatty, Lileep, and Dustox, respectively. This allows them to wallbreak much much more easily. Snorunt also appreciates pivots such as Aipom, Delcatty, and Lileep to help it set up spikes later if it faces an unfavourable lead matchup. Additionally, the former two are great checks to Spoink, another tough lead matchup for Snorunt due to its fast Taunt. Lileep can also deal with common priority users such as Pidgeotto and Taillow, which completely shut down Snorunt with a Salac Berry boost, and checks Fire-types such as Growlithe and Cyndaquil that threaten Snowrunt. As teammates, priority users enjoy Spikes chipping down faster Pokemon such as Elekid into range of a KO. Even defensive pokemon enjoy Spikes which helps them threaten offensive Pokemon such as tank Castform. Shuppet uniquely denies Rapid Spin users such as Staryu, and it takes advantage of the Spikes on Delcatty and Pokemon locked into Normal- or Fighting type moves. Lastly, Magnemite walls standard Snorunt, so Nosepass can be great to trap and remove it, as well as handling priority move users and Fire-types like Lileep can. However, Nosepass does not have the longevity to do this consistently throughout a game.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 535530, "username": "Gangsta Spongebob"}, {"user_id": 272450, "username": "BP"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}], "writtenBy": [{"user_id": 595639, "username": "plznostep"}]}
  }
}