{
  "Blastoise": {
    "overview": "<p>Blastoise is really useful in UU and should be kept alive as long as possible to keep dangerous Pokemon like Nidoking and Sandslash from sweeping your team. Wish support is not a bad idea, but is hard to pull off, so if you're really insecure about keeping his HP stable I recommend you use Sleep Talk. The longer Blastoise lasts, the more time your other Pokemon have to find a hole in your opponent's team. You would probably use him like you would use your bulky Water-type in standard play.</p>",
    "comments": "<h3>Other Options</h3> <p>Mirror Coat will kill Manectric, Lanturn, Electabuzz and anything else that sends a Thunderbolt at you. The only way it will catch Jolteon is if you also have Earthquake, otherwise it'll just Substitute. Counter works well if Fearow, Tauros or some other physical attacker is trying to take you on one on one, however you're better off using Surf or Ice Beam against all these Rocks and Grounds in UU.</p> <p>Hydro Pump is a more powerful alternative to Surf, but 80% accuracy is less than ideal. Earthquake hits aforementioned Electrics, but not very hard because Blastoise's Attack is average at best, and you probably don't want to stack it to keep your physical walling ability. Hidden Power Electric puts a dent in Mantine; Hidden Power Grass helps against Quagsire, but won't really come handy most of the time. Blastoise can Substitute and Focus Punch but it's not useful at all in UU.</p> <p>Haze and Roar work against Baton Passers and against Reversal / Flail Pokemon to an extent, but is not recommended in UU. Protect keeps Solrock from opening a hole in your team with Explosion and can work in conjunction with Counter or Mirror Coat to check what your opponent can do. Yawn is a fun move: lay down some Spikes beforehand for better results. Toxic is always fun to toy around with, you will be able to poison other Water types, and the standard Electric switches aren't fond of it either.</p> <h3>EVs</h3> <p>Blastoise needs max HP with plenty of Defense EVs. A Bold nature would help too. Blastoise tend to run around 200 Speed nowadays to get the first strike on Solrock and company before they Explode, and it's always nice to outrun those Sunnybeaming Grasses you will see in UU.</p> <h3>Checks and Counters</h3> <p>Lanturn resists Surf and hits hard with STAB Electric attacks. Muk's high Special Defense makes it an easy switch in against non-Earthquake versions; Clefable and Slowking also give him trouble. Poliwrath is especially dangerous, because it has Water Absorb, and can Belly Drum on you, unless you have something strange like Hidden Power Grass, or use Roar / Haze.</p>",
    "sets": {"Standard": {"description": "<p>Easy to bring in against many UU teams: Gligar, Sandslash and Solrock are just some examples. Use Sleep Talk if you are lacking something to absorb sleep, but beware that the most common sleepers in UU are Grass-types that can put a hurting in Blastoise. It's mostly useful to keep Blastoise alive and to surprise things like Gligar that try to set up on you while you're sleeping.</p> <p>If you don't want Sleep Talk, you can use Rapid Spin if you're afraid of Spikes. Rapid Spinning against Substitute Qwilfish is not a good idea, so it's a better idea to bring in something to take care of Qwilfish first, and get rid of the Spikes later. Toxic ruins a Lanturn that doesn't carry Rest, as well as several other Waters and Electrics that tend to come in on Blastoise.</p>"}}
  },
  "Raichu": {
    "overview": "<p>Can be a threat to standard teams if your opponent doesn't happen to have Celebi, as it hits about any standard wall quite hard.</p>",
    "comments": "<h3>Other Options</h3> <p>Thief can grab Leftovers from Blissey and Snorlax. Charm can be annoying for Curselax and Swampert. Volt Tackle can give you some extra power, but it can't be used with Surf.</p> <h3>EVs</h3> <p>233 Attack with Focus Punch to 2HKO Blissey in standard. 299 makes you tie with most Salamence for Speed, and 328 makes you faster than stuff like Modest Gengar and the like. Put leftover EVs in Special Attack. When not using Focus Punch, just make sure to max Special Attack for maximal sweeping power.</p> <h3>Checks and Counters</h3> <p>In standard, Venusaur and Celebi can come in easily on Thunderbolt, Hidden Power Grass, Surf and Focus Punch, taking nil damage thanks to Leftovers and Recover, Leech Seed and / or Synthesis. Even Hidden Power Ice doesn't do that much. Dusclops with around 360 Special Defense can take quite a few Thunderbolts from Raichu if it can Pain Split or Rest in time, and is immune to Focus Punch, while Hidden Powers and Surf don't do much damage. Blissey, Snorlax and Regice must avoid Focus Punch at all costs, so they cannot come in effectively on a Substitute Raichu either, but the rest of its moves don't do much at all. Snorlax might even be able to come in on Substitute and Curse up and come out on top, but beware of Raichu using Encore.</p> <p>Grounds can be used for countering Raichu to an extent. Flygon needs to beware of Hidden Power Ice, and doesn't take Focus Punches too lightly (especially if Flygon is Choice Banded and thus lacks Leftovers recovery), but makes an excellent counter nonetheless because of a guaranteed OHKO with its STAB Earthquake. Claydol is immune to Thunderbolt and resists Focus Punch, but is 3HKOed by Surf and almost 4HKOed by Hidden Power Grass or Ice. It is hard for Raichu to get around Claydol though, since Raichu will have to predict it switching in every time. Donphan is easier to beat but is still a hindrance; it takes nearly no damage from Focus Punch thanks to its high Defense, but Surf and Hidden Power will 2HKO him. Swampert is 2HKOed by Hidden Power Grass, but every other attack does absolutely nothing to it.</p> <p>In UnderUsed, Camerupt can be almost completely disregarded as a counter because of Surf. Vileplume and Meganium, much like Venusaur and Celebi, take nearly no damage from Focus Punch and Thunderbolt and can shrug it off with Leech Seed and Synthesis. They should watch out a little more for Hidden Power Ice, though. Quagsire and Whiscash do the same job as Swampert: countering any variant not using Hidden Power Grass with no trouble at all. That's why Vileplume or Meganium combined with Quagsire or Whiscash walls any Raichu available. Sandslash and Gligar do the same as Donphan here: being 2HKOed by Surf (and in Sandslash' case, Hidden Power) doesn't cut it, but easily take Focus Punch and Thunderbolt for breakfast. Hypno and Grumpig, the standard special walls of UU, do quite nicely at taking anything Raichu throws at them, though Grumpig has no Wish like Hypno does, so it will get worn down quickly. A sweeping Grumpig doesn't like to get Thunder Waved either.</p> <p>In general, attacking Raichu straight on is a good idea if it doesn't OHKO you. It's very fragile and weak to the most common attacking move in the game (Earthquake), and it often uses Substitute to see what you're going to do. Just switching out if it comes in on your non-attacking move is handy as well, since it is probably going to use Encore.</p>",
    "sets": {
      "Encore": {
        "description": "<p>Raichu is one of the fastest Encorers in the game. In standard, play it as follows: come in on a non-attacking move coming from a slower Pokemon and Encore it, then predict what your opponent is going to do. If Blissey, Snorlax or Regice are coming in, Focus Punch on the switch. If you think Swampert is coming, Hidden Power Grass it on the switch--it will not OHKO though. If you're insecure about prediction, use Substitute after Encoring, and handle from there. However, it's recommended to use Hidden Power Grass if your skills allow it, because Swampert is on nearly every team and it greatly hinders Raichu's sweeping potential.</p> <p>For UU play, Focus Punch probably won't come handy, as Thunderbolt will 2HKO Aggron and Clefable is rare, and not much else weak to Fighting is around, besides Golem who you can OHKO with Hidden Power Grass. Therefore, the EVs suggested are for standard play. A guaranteed 2HKO on Blissey with Focus Punch, and enough Speed to outspeed all Heracross.</p>"
      },
      "Special Sweeper with Focus Punch": {"description": "<p>Use this set with Substitute and Hidden Power Grass in UU to get quite a threatening sweeper. Surf is the main reason to use it over Manectric, because it 2HKOs Gligar and OHKOs Camerupt. Only use Hidden Power Ice in standard for Flygon and Salamence (usually doesn't OHKO), because you need Hidden Power Grass in UU for Quagsire. Like with the first set, if you smell a standard Special wall coming, Focus Punch it.</p> <p>When using Focus Punch, use the EVs suggested on the first set. Otherwise, use these. Timid Raichu ties with Jolly Fearow, Dodrio, Linoone and anything else with 100 base Speed and a +Speed nature. Modest ties with the same Pokemon, except with Adamant versions. You'll usually outspeed Salamence as well as the rare Charizard. Use the IVs suggested when using Hidden Power Ice in standard, having absolute max Speed is important.</p>"},
      "Wish": {"description": "<p>Raichu can force switches easily, being an Electric-type. Predict this, Wish, and switch to whatever counters what they sent in. It can stay alive against Blissey by Wishing and then Substituting. Wish prevents it from using Surf, so you are stuck using Hidden Power.</p>"},
      "Reversal": {"description": "<p>OHKOs Blissey and other normal friends and is a nice surprise. They might think you are whittling down yourself to get a Petaya Boost, so take advantage of their surprise. Watch out for Venusaur and Dusclops. Unfortunately, Surf cannot be used in tandem with Reversal. Not really recommended in either UU or standard: in standard Tyranitar messes you up, and in UU there's a lot of Quick Attack and similar moves around.</p>"}
    }
  },
  "Nidoqueen": {
    "overview": "<p>Nidoking is usually better suited for your competitive needs because his higher Speed and offenses, in addition to Megahorn, make it a lot easier to pulverize opposing teams. However, Nidoqueen is much better at using Counter due to higher sturdiness. Because of this tankish nature, Nidoqueen is also better at using the nice resistances given to the Poison / Ground typing, but still you should be wary of these nasty weaknesses to Earthquake, Psychic, Ice Beam, and Surf.</p>",
    "comments": "<h3>Other Options</h3> <p>Counter is an awesome move on Nidoqueen, since she usually survives even STAB Earthquakes if she has a defensive EV spread. Charm can be annoying as hell for physical switch-ins like Fearow, Snorlax or any Ground. Roar Nidoqueen can be used for teams based around Baton Pass and it can easily Roar away Ninjask or Scizor as well. Nidoqueen is defensive enough to pull off a Rest / Sleep Talk set, but it's better to use her outstanding versatility. Substitute helps against Weezing if it's not running Flamethrower or Fire Blast.</p> <p>Hidden Power Grass 2HKOes SwaQuagsire and Whiscash, but you should be using it on the switch or they will KO you with Earthquake, Surf or Hydro Pump. Use Crunch if you're using a Nidoqueen that's focused on Special Attack (though that's not recommended as it lacks STAB); it will damage Solrock and Misdreavus badly.</p> <h3>EVs</h3> <p>If you want to OHKO max HP Gligar with Ice Beam guaranteed, you need 200 Special Attack. The main sets should have offensive spreads like suggested, but if you're using Counter or just want a more sturdy Nidoqueen, I recommend using 252 HP / 140 Attack / 36 Defense / 80 Speed with Adamant nature (when not using any special attacks). With this, you survive STAB Earthquakes from the likes of Sandslash. This means you'll be easily living through Nidoking, non-Swords Danced Gligar and any non-STAB Earthquake.</p> <h3>Checks and Counters</h3> <p>Nidoqueen is versatile, but since its attacking stats are on the low side it doesn't hurt much if it's not dealing STAB or super effective damage.</p> <p>It's mostly Waters and Grounds that Nidoqueen fears. Politoed, Slowking, and Blastoise take on non-Choice Banded Nidoqueen easily, though they may get worn down after a while. If Nidoqueen is not using Hidden Power Grass, Quagsire and Whiscash are failsafe counters in the same way. Poliwrath usually doesn't run Earthquake or a Water move, but if it does it's a good Nidoqueen counter as well.</p> <p>Sandslash takes Ice Beam even worse than Donphan does, so it's only good as an early game counter that shouldn't switch into Ice Beam, and preferably not into Earthquakes either. Watch out for Sludge Bomb's Poison chance, too, as well as the rare Hidden Power Grass. Gligar can come in with some prediction to avoid Ice Beam, but it cannot OHKO Nidoqueen with Earthquake when Nidoqueen is at (near) full health, so just use it as a finisher. It will get OHKOed by most Ice Beaming Nidoqueen. Solrock, Misdreavus and Lunatone are immune to Earthquake and resist Sludge Bomb, so as long as they don't eat a Shadow Ball they're good counters. Solrock can even set up a Reflect to avoid too much damage. Solrock can Earthquake Nidoqueen (watch out for Counter), Misdreavus can Perish Trap or Calm Mind up, Lunatone can Calm Mind up and use Ice Beam / Psychic.</p>",
    "sets": {"Standard": {"description": "<p>The standard Nidoking set, applied to Nidoqueen. Nidoqueen lacks Megahorn, but it can remedy that by hitting Meganium with STAB Sludge Bomb and Solrock with Shadow Ball. Ice Beam OHKOs Gligar and does a lot of damage to other Grounds, as well as Fearow, who is immune to two of your moves.</p>"}, "Choice Band": {"description": "<p>Requires prediction to work. Your main attacking move here is Earthquake, so like with above set, hit Fliers like Gligar with Ice Beam, Shadow Ball is for Solrock, and Sludge Bomb is for Meganium (and it hits Fearow quite hard as well). This set makes Nidoqueen do notable damage if used right.</p> <p>If you're using Ice Beam for Gligar, use 56 Special Attack EVs and Hasty or Naive nature (taking EVs from HP and Speed), so you can OHKO it.</p>"}}
  },
  "Nidoking": {
    "overview": "<p>A great movepool that makes him beyond excellent in UU. There's very few surefire counters for Nidoking, especially in the UU environment. He can always surprise you and kill one of the key elements of your team. However, he can be rather hard to bring in due to his common weaknesses to Surf, Ice Beam, Psychic, and Earthquake, and will always have a problem taking down sturdy Water-types.</p>",
    "comments": "<h3>Other Options</h3> <p>Nidoking can use Counter on Choice Banders like Fearow, on walls like Solrock or even on Grounds like Quagsire and Sandslash. It does work nicely, but Nidoking is usually better off at attacking straight up. Toxic and Thief can help in wearing down opponents, but once again Nidoking is better off ramming things instead of stalling them out.</p> <p>Thunder does more damage to Waters than Thunderbolt if it hits and it has a high Paralysis chance, but in the long run Thunderbolt's accuracy is better. Roar can help you against UU Baton Passers, but those are rare. Hidden Power Grass is fun on Nidoking to hit Quagsire for a surprise.</p> <p>Rest and Sleep Talk are always a nice option on Pokemon that can take a hit or two. Nidoking can absorb a Sleep from a Grass-type nicely and then surprise them with Sludge Bomb, but it does hurt his great versatility. Protect is nice to scout for Earthquakes, Explosions, and Choice Banded moves, and helps for Leftovers recovery.</p> <h3>EVs</h3> <p>If you're using Counter on Nidoking, more defensive EVs are suggested. With 88 HP and 28 Defense EVs, you can survive a Gligar Earthquake (as long as he doesn't have an Adamant nature). Nidoking needs 200 Special Attack (the stat, not the amount of EVs) to OHKO Gligar. If you're using a -Special Attack nature (Adamant, for example), you need 68 EVs to reach that. However, without that, Nidoking already has 206 Special Attack, so there's no need to stack it any more. Generally you'll want to focus on Attack to put a little strength behind his Earthquakes, while his Special moves should be designed to kill specific threats like Gligar.</p> <h3>Checks and Counters</h3> <p>Your options are limited. Quagsire, Whiscash, Politoed, Poliwrath, Walrein, and Blastoise work as counters in the same way as the Waters from standard: they do not like Choice Band Earthquakes, and Quagsire and Whiscash do not like Hidden Power Grass, but they take the hits from any of his other moves rather well. Poliwrath, Whiscash, and Quagsire may be better off using Earthquake instead of Surf or Hydro Pump to counter Nidoking.</p> <p>Solrock and Lunatone should beware of Megahorn or Shadow Ball, and Grounds like Sandslash and Gligar cannot take Ice Beam, but if these moves are not present they are great counters.</p>",
    "sets": {
      "Standard": {"description": "<p>The best UU set for Nidoking. One of the greatest threats to Nidoking is Gligar, and Ice Beam takes care of him. Shadow Ball takes care of Misdreavus, Megahorn beats Grass and Psychic Pokemon, and Earthquake gets STAB. The absence of Thunderbolt allows for a better EV distribution; Water Pokemon for the most part will take more damage from STAB Earthquake than non-STAB Thunderbolt. Give this one max Speed--it's essential for taking on Gligar that want to switch in on your Earthquake.</p>"},
      "Choice Band": {"description": "<p>Choice Banded Nidoking is one of the most dangerous Pokemon in the UU environment. As with a lot of Choice Banders, depending on your and your opponent's prediction skills you could be totally messing something up or doing nothing to them at all. Earthquake should take care of Quagsire and other Water friends in 2 or 3 hits, Megahorn kills Solrock and Lunatone and puts quite a big hurting into Meganium, and Rock Slide is for Fliers like Fearow and Scyther. Sludge Bomb may seem handy for STAB, and Ice Beam catches Gligar.</p>"}
    }
  },
  "Clefable": {
    "overview": "<p>Clefable is really unpredictable and that's where its strength lies. There are zero safe counters for him. However, once its set is found out, its average stats across the board will cause difficulties in damaging things effectively. All sets are quite viable for UU play.</p>",
    "comments": "<h3>Other Options</h3> <p>Fire Blast as a more powerful option over Flamethrower. Psychic is for Fighting-types. Reflect is a great move to support your team with and can work in tandem with Counter. Safeguard supports, too, but to a lesser extent. Sing can catch any Clefable counter with a quick Sleep, and can help you set up Calm Mind or Belly Drum. Snatch can get you a Substitute, Calm Mind, Recover, Soft-Boiled, Aromatherapy or Dragon Dance, as long as you're good at predicting. It's a novelty move though. Wish can be considered an option over Soft-Boiled most of the time, Clefable is an above average Wisher. It might be wise to use Protect with it, which can also check what a Choice Bander is going to do, it can help your Leftovers recovery and it saves you from Explosion.</p> <h3>EVs</h3> <p>Depends completely on the set, and there's still no strict way of doing them. Using the Magic Stat Numbers article gives you an idea what you can use for EVs on Clefable. Stick with what's given on the sets.</p> <h3>Checks and Counters</h3> <p>Countering Clefable safely is hard; you'll usually have to use a combination of Pokemon. Any Pokemon with Rest stalls out the Toxic staller. Steel and Poison-types work as well, though Weezing and the Steels should beware of Fire moves.</p> <p>Generally, powerful offense, Toxic, and Leech Seed stop Clefable. It often has to use Soft-Boiled, so use that to switch in a counter easily.</p> <p>Quagsire does about as well as Swampert and counters it under the same conditions. Hypno can Toxic or Thunder Wave Clefable and wall it, though Choice Band Clefable or generally Shadow Baller can hurt, and Hypno doesn't enjoy Toxic itself. Some offense from Aggron or Fearow can hurt Clefable a lot, but beware of Counter.</p>",
    "sets": {
      "Belly Drum": {"description": "<p>Belly Drumming Clefable is quite fun, but not too good since after a Belly Drum its Attack is only 1048. Clefable is also quite slow which makes it hard to take advantage of its super high Attack, so make sure to paralyze some sweepers beforehand, or do it yourself with Thunder Wave. Even if you aren't able to find an opportunity to use Belly Drum, you can still get some random Attack boosts by using Meteor Mash if you picked that. Cosmic Power is an option as well to make this set more tankish: basically you Cosmic Power until you're not taking much damage from the opponent, use Soft-Boiled to recover the damage, Belly Drum up, and start hitting things. If you come across a Ghost or something that can kill you in the long run, Soft-Boiled to full HP, then switch out to come back later and try again.</p>"},
      "Calm Mind + BoltBeam": {"description": "<p>Standard Calm Mind Clefable, Ice Beam and Thunderbolt are only resisted by Magneton, Lanturn, and Shedinja. It doesn't do much against good Special sponges either. This Clefable's greatest enemy is Toxic. You can Rest it off, but expect to get hit hard physically then by Fearow or Aggron, for example. You can toy around with the EVs: more Special Defense means Calm Mind will make your Special Defense absolutely impregnable by Manectric or other Special Attackers, more Defense means you will get great defenses on both sides, and more Special Attack means you will have more firepower.</p>"},
      "Counter": {"description": "<p>Counter is one of Clefable's coolest moves. Pokemon that can be surprised by Counter include Fearow, Tauros, Quagsire, and many more. Clefable survives all of these. The first two moveslots can be about anything: Ice Beam + Thunderbolt is a good idea as well, and Calm Mind works to lure even more physical attacks; if you use Calm Mind, make sure to use a Special Attack in the other free moveslot. You can also use Light Screen in a similar way. Preferably don't use Thunder Wave here: if you Counter against a paralyzed Pokemon, you risk that they get fully paralyzed and your surprise will be given away.</p> <p>Make sure to switch to Bold and to shift Attack EVs to Special Attack when running Special Attacking moves.</p>"},
      "Cosmic Power Staller": {"description": "<p>A stalling set, takes a long time to win with. I don't like this set because you usually get forced to Rest and then phazed, and stalling for so long is just begging to eat a critical hit. I'd always go with Rest here, using Soft-Boiled makes you vulnerable to status. Use Encore on some attacking move and Seismic Toss them to death, or Toxic so your opponent loses HP even while you are setting up or recovering. Flamethrower / Fire Blast is a good option on this set to shut down Steel-types and Weezing.</p>"},
      "Choice Band": {"description": "<p>A more novel set. Please, use one of your many other Normal Choice Bander options. The only thing Clefable has over them is Meteor Mash, which isn't that great anyway. Feel free to blend in a special move like Flamethrower or Thunderbolt to hurt Skarmory. With these EVs you should be able to outpace Meganium, Blastoise, and about anything else with 200 Speed or lower.</p>"}
    }
  },
  "Vileplume": {
    "overview": "<p>A good UU Pokemon. It walls the hell out of Meganium (don't Sludge Bomb before you check for Counter though), can paralyze opponents or put them to sleep, supports with Aromatherapy and Leech Seed or sweeps with SunnyBeam. Like many other Grass- and Poison-types, however, it gets walled very easily, both in UU and in standard. Still, a good counter to Electric-, Grass-, Water-, and Fighting-types, depending on EVs.</p> <p>Vileplume should only be used outside of UU with the Aromatherapy set, otherwise special versions are inferior to Exeggutor, and physical versions wish they could be Victreebel.</p>",
    "comments": "<h3>Other Options</h3> <p>Stun Spore is cool if you can catch some fast Flier like Fearow or Salamence on the switch. Toxic is another status affliction Vileplume can deal out; it'll ruin Hypno, who relies on Wish to recover. It works wonders on Milotic and Suicune in standard too, the former losing stall potential, the latter being forced to Rest. Hidden Power Ghost is an alternative physical attack for Swords Dancing Vileplume.</p> <h3>EVs</h3> <p>On the Sunny Day set, since it should only be used in UU, you don't need to worry about being faster than threats like Aerodactyl and Jolteon, so you have a few options here. You can opt to be faster than Electrode (which rarely, if ever, uses a +Speed nature, and it's already rare to begin with), which requires a stat of 190 before Sunny Day (giving 380 after), or 216 EVs. The next breakpoint would be +Speed Persian and Sneasel (also rare) which needs 180 EVs to get a stat of 181. The slowest you should go would be 136 Speed EVs, giving a stat of 170, as this is faster than Timid Manectric and Electabuzz after Sunny Day. Whatever you decide, max out Special Attack with Modest, and put the rest into HP or a defense.</p> <p>On the sweeping sets, you should max the attacking stat you're using, as suggested. The last set should always have max HP, and be mostly focused on one of the defenses.</p> <h3>Checks and Counters</h3> <p>In standard, without Hidden Power Fire, Metagross, Forretress, Skarmory and other Steels laugh at Vileplume, except if they get Sleep Powdered. Heracross doesn't take much from anything Vileplume does, even Hidden Power Fire. Guts makes it ideal to absorb Stun Spore, and if it has Sleep Talk, then Sleep Powder as well. Dodrio, Salamence, Gyarados and other Fliers hit Vileplume hard with STAB Flying moves, but do not enjoy Stun Spore (due to the speed loss) or Sludge Bomb (because of poison chance and damage). Hidden Power Ice surprises some Fliers pretty well, too.</p> <p>In UU, Muk walls anything Vileplume throws at it, even the Sunnybeam set doesn't do much damage, and if Muk has Fire Blast Vileplume will be dead in two hits. Fearow hates Stun Spore, Hidden Power Ice and Sludge Bomb, but can come in on a Grass move easily and use Choice Banded Drill Peck, which OHKOs Vileplume. Sets without Sludge Bomb or Hidden Power Ice / Fire will get walled by Jumpluff and other Grassers, while any set without a Grass attack has some trouble with Waters with Ice Beam as well as Ground-types. Without Hidden Power Fire, Vileplume is a sitting duck against any Steel.</p>",
    "sets": {
      "SunnyBeam": {
        "description": "<p>This set is useful in UU play only, Exeggutor outclasses this in OU.</p> <p>Try to bring in Vileplume on something that doesn't do much damage to it, and is likely going to switch out. Start disabling your counters by wearing them down with Hidden Power or putting one of them to Sleep with Sleep Powder. You will likely want to wait with using Sunny Day when you can OHKO most things your opponent has left, or if you can beat them one on one without dying the process. When the time is right, use Sunny Day to double speed, power up Hidden Power Fire and turn Solar Beam into a one-turn attack. Hidden Power Fire gets rid of Steels like Metagross and Skarmory in two shots, Salamence will nearly always die to one Hidden Power Ice. In UU play, Solar Beam already puts a big dent in Gligar (the only thing really worth using Hidden Power Ice for), so you'll probably want to use Hidden Power Fire for other Grassers like Meganium.</p> <p>Paralysis negates your speed boost, making sweeping practically impossible, so that's why Lum Berry is an option. Leftovers is generally the better choice though, because it often means difference between life and death.</p>"
      },
      "Swords Dance": {
        "description": "<p>In standard, this set has no chance at all, and in UU it will be too easy to resist by Gligar. If anywhere you should use this set against ubers when paired with Groudon, but then it's just a worse Victreebel. If you're doing that, put Solar Beam in the last moveslot.</p> <p>Despite Sludge Bomb being a very cool move, Poison is one of the worst attacking types in the game. In addition, Vileplume is slow and its Attack is only average.</p> <p>Either way, the idea is to find some place to Swords Dance--preferably against a Water or a fellow Grasser-and then attack away, using Moonlight when needed. You can try to put one counter to Sleep with Sleep Powder. Moonlight is replaceable for another attacking move. Hidden Power Fighting has a chance to OHKO Aggron after a Swords Dance, Hidden Power Ground helps for Metagross and still puts a dent in Tyranitar if you're using this in OU. Then you could use a Grass move (Razor Leaf, Giga Drain or Hidden Power Grass) for Grounds like Sandslash, Quagsire, and again, Tyranitar.</p>"
      },
      "Cleric": {"description": "<p>Utility Vileplume, probably one of your best bets in both UU and standard if you're looking for a more sturdy Electric or Grasser counter. Works a bit like Venusaur, but with Aromatherapy. Leech Seed works well with Spikes and helps your team, and Moonlight keeps Vileplume alive as long as Sand Stream isn't raging. While it doesn't do much damage, this set makes a great supporter.</p> <p>Make sure to use a nature that reduces the attacking stat you're not using. An alternative way of EVing this Vileplume are shifting Special Defense to Defense and using Impish or Bold, depending on which attacking stat you're not using. Stacking the attacking stat isn't a bad idea either, especially if you're running Sludge Bomb, as Hidden Power Grass is mostly for things that are already weak to Grass, like Walrein and Quagsire.</p>"}
    }
  },
  "Poliwrath": {
    "overview": "<p>This can have a chance to dominate the Underused metagame, no questions asked. Nothing can withstand it when playing in that atmosphere. This Pokemon is quite underrated, since it is really not seen at all anywhere. It can give you a huge dent when it comes to standard play, too. Suicune might have some troubles once Poliwrath is set up, especially if Suicune lacks Roar. Suicune can't Surf it, and Ice Beam won't do much to it. A twice Calm Minded Suicune will bring Poliwrath down with Ice Beam. Poliwrath is probably suitable in the late stages of the game.</p>",
    "comments": "<h3>Other Options</h3> <p>It seriously does not have great moves. If it had Rock Slide, Poliwrath could be a little more common. Surf for that average STAB. Hydro Pump is pretty strong with STAB but is somewhat inaccurate. Counter can work off nicely due to its decent HP and Defense. Ice Beam can actually suit Poliwrath quite well. It does have some troubles with Salamence, and what can be more surprising than Ice Beaming it to oblivion.</p> <h3>EVs</h3> <p>Focus on Attack, with a bit of Speed (near max for Belly Drummers, a small amount for others), and drop the rest in HP or one of the defenses.</p> <h3>Checks and Counters</h3> <p>Claydol will just take it down, as long as it has Hidden Power Rock instead of Hidden Power Ghost. Note: Jolteon, Aerodactyl, and Crobat will still be faster than Poliwrath after the Salac boost, 1 stat point faster to be precise, if you max out Speed. As such, they will be labeled as counters. Venusaur, Donphan, Skarmory to an extent, Slowbro, Weezing, Gyarados, Flying types, Metagross, Salamence, Celebi, and Dragonite hit Poliwrath hard, in any set. As in UU, without Hydro Pump, Gligar can take any abuse it gives it and finish it off. If it's running without Substitute + Salac, faster things will just dominate it such as Fearow and Electabuzz.</p>",
    "sets": {
      "Belly Drum": {
        "description": "<p>Now this looks like an ordinary Substitute + Belly Drum Water version of Charizard, but it is in some ways better. Send this on a Water Pokemon, especially if your opponent's Suicune doesn't have Roar. The scenario might go like this: You Substitute, they switch. You Belly Drum, they attack. You get Salac boost and you can just attack. Hidden Power Ghost hits Ghosts and Psychics super effectively, but Hidden Power Rock gets Fliers. Since Poliwrath can't get over 394 Speed (393 max with Salac), the EVs suggested give just enough to beat Jolly Dugtrio and Timid Alakazam, as well as take less than 25% from Salamence's Choice Band Rock Slide (so you can switch it in after it kills something, Substitute as it attacks for less than 1/4 or switches, and then Belly Drum). With Hidden Power Rock, you'll need to increase your Speed EVs by 4 at the cost of Defense.</p> <p>In UU, barring Jolly Persian and Electrode, Adamant Poliwrath with those EVs is faster than all UU Pokemon after its Salac activates, giving you some much needed hitting power.</p> <p>Return hits Poisons and, most importantly, Gligar much harder than Brick Break or your Hidden Powers, hits Fliers harder than Hidden Power Ghost, and hits Psychics harder than Hidden Power Rock. It will always OHKO Gligar, but even min HP Gligar has a chance to survive Adamant Hidden Power. You can't even touch Ghosts, obviously, but in UU, Gligar, Vileplume, and Hypno are all common, and Return is the only way to cover them all. Don't use Hidden Power Rock in UU, as there are few Fliers that don't either take neutral damage from Fighting (Fearow and company), or take neutral damage from Rock (Gligar).</p>"
      },
      "SubPunch": {"description": "<p>A great surprise set. Put up a Substitute against Waters and such, and Focus Punch away. Hidden Power Ghost is for Ghosts while Hidden Power Rock takes care of Fliers (mostly Salamence, Gyarados and Zapdos in standard, as it won't make a difference versus Fearow and Gligar, who take more damage from Focus Punch). Hypnosis helps you to set up more easily and may shut down your main counter, while Bulk Up makes Poliwrath a physical tank. If you can set up a Substitute against slower physical Pokemon and Bulk Up a few times, they're going to be in a world of pain.</p> <p>Using Ice Beam on this set isn't a bad idea. It should cripple if not kill Gligar and Salamence, and it helps against Flygon and Zapdos as well.</p>"},
      "Choice Band": {"description": "<p>The Speed beats out Adamant Tyranitar, letting you Brick Break before it attacks, if it chooses to stay in. It also guarantees you will be faster than Zapdos, even 252 Timid ones, after Rock Tomb lowers its Speed. Choice Band Rock Tomb 2HKOs Zapdos about half the time after Leftovers, so if you can hit it with anything, it's going down to two Rock Tombs (Rock Tomb always lowers Speed). Ice Beam is to 2HKO Salamence, who is probably going to be their first switch in to Poliwrath. Focus Punch is easy to get off against Roar Suicune, and also good against Milotic. Sleep Talk is an option to make this thing a real Milotic counter, and it can go over anything but Brick Break.</p>"}
    }
  },
  "Victreebel": {
    "overview": "<p>Victreebel isn't simple to use. It's slow and fragile and lacks a good typing. However, its attacking stats are through the roof. It has a hard time with a lot of standards, mostly Steels, but can nonetheless be a menace by hitting hard on switches. Still, not recommended for newer players. In UU, he can be used to make fun of Meganium, with its immunity to Toxic, 4x resistance to Grass moves, and a Swords Dance-boosted Sludge Bomb that will even shut down those with Reflect or Counter.</p>",
    "comments": "<h3>Other Options</h3> <p>Encore can catch a lot of stuff off guard, such as Celebi's Recover, Salamence's Dragon Dance, Weezing's Haze, and Tyranitar's Substitute. Synthesis can work, but Victreebel is rather fragile and has no Ground resistance unlike the Recovering Celebi. Growth can be used to power up Special Attack, but Victreebel is bad enough at setting up as it is. Growth really doesn't increase your power that much, and Grass isn't a good attacking type at all. Stun Spore and Body Slam's paralysis chance help Victreebel's low Speed. Reflect can support the team. Hidden Power Ice is nice for catching Salamence and Flygon off-guard in standard, or Altaria and Gligar in UU.</p> <h3>EVs</h3> <p>208 Speed (128 EVs) is a good start for most if not all Victreebel's sets, especially in standard. It beats most Metagross, as well as max Speed Jolly Marowak. Suicune and Kingdra start at 206, so if they have only 4 Speed EVs or none at all you beat them as well. With your other EVs, you will want to max out Victreebel's main attacking stat. And then finally, when using Sludge Bomb on a Special set, put the leftover EVs in Attack. If you're not running Sludge Bomb like that, put what you have left into HP for some more survival, or Speed.</p> <h3>Checks and Counters</h3> <p>For standard: Weezing resists Sludge Bomb and Grass moves, can Will-O-Wisp Victreebel and take him down with Sludge Bomb or a Fire move. Haze will erase Swords Dances. Skarmory, Metagross, Jirachi and any other Steel are immune to Sludge Bomb and resists Grass. All three of them can hit Victreebel with STAB super effective moves, but Metagross will do fine with Meteor Mash. Hidden Power Fire is sour for them, though. Salamence and Gyarados take about 30% from Sludge Bomb after Intimidate and hit hard with Hidden Power Flying, and Salamence resists Grass 4x as well. Gengar and Dusclops resist Victreebel's STAB as well. They can both Will-O-Wisp, but Gengar can also use Ice Punch for a load of damage.</p> <p>In Underused matches, Muk resists Sludge Bomb and Grass moves and can Sludge Bomb or use a Fire move on Victreebel's low defenses. Altaria resists Grass moves, but should watch out for these dangerous Sludge Bombs. He doesn't mind Victreebel's status employment though. Camerupt resists Sludge Bomb and OHKOes with his Fire moves, but a Solar Beam nearly OHKOes it. Gligar walls physical sets nicely with his good Defense and natural Sludge Bomb resistance, but Grass moves will hurt him. His Hidden Power Flying really hurts Victreebel though. Any Fire type is going to OHKO Victreebel, they should all beware of that nasty STAB Sludge Bomb, but if Victreebel uses Sunny Day they can really take advantage of that. Beware of Misdreavus as well, who can Thunder Wave or Hidden Power Ice Victreebel.</p> <p>All of Victreebel's counters risk being Sleep Powdered, so try to absorb that with a Sleep Talker first, or put Sleep Talk on a counter.</p>",
    "sets": {
      "Swords Dance": {"description": "<p>Victreebel can be a menace when used right. A Swords Danced Sludge Bomb OHKOes a lot of things. Ground and Rock Pokemon get promptly Giga Drained, particularly Swampert and Rhydon in standard and Quagsire and Golem in UU. Sleep Powder is to disable one counter. Save Swords Dancing for later in the game, when there's only slower stuff left that Victreebel KOs easily.</p>"},
      "Special Attacker": {"description": "<p>Hidden Power Fire catches Metagross and Skarmory on the switch and can deal damage to Gengar. Sludge Bomb is to make sure Snorlax and Regice aren't going to wall you easily. It helps against Blissey as well, though she will usually shrug it off with Soft-Boiled. You won't want to cut your secondary attacking stat this time around, because without this Attack investment you won't do much to Snorlax and Regice at all. Rash is probably the best personality for this set, because with Mild, Dugtrio can kill you a lot easier.</p>"},
      "SunnyBeam": {"description": "<p>Sunny Day Victreebel. Hidden Power Fire is for Metagross and Skarmory, while Sludge Bomb keeps Blissey and other Special walls at bay. Sleep Powder is helpful for stuff like Fire Pokemon and Salamence, but it's not totally necessary. Since you're going to try and just sweep your opponent, defensive investment isn't needed.</p> <p>This set's main problem is that unless you use Sludge Bomb, Exeggutor outclasses it in every way in OU, so you should either use Sludge Bomb or use Exeggutor. In UU, however, Exeggutor is banned, so this problem no longer exists.</p>"}
    }
  },
  "Golem": {
    "overview": "<p>A good Pokemon to use in the UU metagame as it stops many sweepers and Choice Band users cold in their tracks. It also has Explosion, which can help to eliminate a Pokemon that's causing you trouble and generally gives some shock value. Golem's weaknesses to Earthquake and special attacks are a huge scar, though.</p>",
    "comments": "<h3>Other Options</h3> <p>With Block you can trap something on the switch, but the chance that Golem will be beating whatever switches in on him is slim. Its prime use is trapping Quagsire or some other slower Pokemon and then Exploding on it, but beware Damp or Protect Quagsire. Toxic can be used to wear things like Meganium and Solrock down, but won't work if your opponent has Aromatherapy or Heal Bell. Counter is a great surprise: Golem can survive many Earthquakes and Fighting hits to bounce them back for a quick KO. Roar is useful for Baton Pass chains.</p> <p>Golem can use Body Slam to paralyze a few of its counters, and can follow up with Rock Slide to lock them into paralysis and flinch until they faint. Focus Punch can hit some things hard on the switch, but it has the same power as Earthquake after STAB, so that won't generally do much for you.</p> <h3>EVs</h3> <p>Just put a load in HP and Attack, and a little in Defense. Defensive Golem should use Impish, while Choice Banders can use Impish or Adamant. A little Speed can be welcome to Explode on slow stuff, though. 72 EVs is enough for most Vileplume. Trying to outspeed Solrock or Walrein isn't worth the investment.</p> <h3>Checks and Counters</h3> <p>Golem has trouble with Solrock. Levitate grants it immunity to Earthquake, and with stacked HP and Defense and a faster Reflect, it is not easy to get past. Lunatone has less Defense, but the same typing and ability as well as that super effective Ice Beam to watch out for. Grasses generally make Golem shiver with fear, especially those who have Earthquake resistance, like Meganium and Bellossom. Vileplume and Victreebel OHKO him with any Grass move as well, but they don't like eating repeated STAB Earthquakes. Waters are a problem as well as that's Golem's secondary 4x weakness. Blastoise, Politoed and Poliwrath can all take a beating and Surf or Hydro Pump away. Walrein is weak to Rock, but if it can get in on another move, Golem is still toast. Quagsire has the advantage of the Rock resistance, and can also use STAB Earthquake or Surf, or Ice Beam. Misdreavus is immune to Double-Edge, Explosion, and Earthquake which is a great hindrance, especially for Choice Banders.</p> <p>Besides all this, any kind of decently powered special attack will really mess up Golem, if it doesn't end up KOing him. Not all special attackers like to come into Golem Earthquakes or Rock Slides though.</p>",
    "sets": {"RestTalk": {"description": "<p>Golem's best switch-in opportunity is something with Choice Band, like Fearow and Kangaskhan. From there, try to predict your opponent's next move and attack accordingly. Rest keeps Golem alive, and Ground + Rock covers just about anything you'll encounter in UU.</p>"}, "Choice Band": {"description": "<p>A much more offensive Golem. Hidden Power Bug hits Grass types like Meganium harder than your other moves, as well as covering Solrock and Lunatone, but cannot be used with Hidden Power Rock.</p>"}}
  },
  "Mr. Mime": {
    "overview": "<p>He's a great Pokemon in Baton Pass chains since he temporarily blocks Roar and Perish Song with Soundproof and can set up a great deal of moves. Not only that, but he's a great Baton Passer on his own as well, being able to shut down phazers easily. He's really fragile though and can be hard to bring in when playing with standards. Mr. Mime needs to be dealt with immediately and effectively, otherwise he can pass Calm Minds to something like Manectric which can really hurt.</p>",
    "comments": "<h3>Other Options</h3> <p>Recycle. Pure novelty.</p> <h3>EVs</h3> <p>For the Baton Passing sets, you'll want lots of HP and Special Defense. Others may concentrate on Speed and Special Attack.</p> <h3>Checks and Counters</h3> <p>Counters for Mr. Mime are Shiftry and Cacturne with immunity to Psychic and resistance to Thunderbolt. Trick band Grumpig will also beat Mr. Mime. Sharpedo can take Psychics and uses STAB Crunch, but has to watch out for Thunderbolt.</p>",
    "sets": {
      "Calm Mind + Baton Pass": {"description": "<p>Calm Minding, Baton Passing Mr. Mime. Being immune to Roar makes him an excellent choice for Baton Passing chains and allows him to contribute Calm Minding to the chain as well. He can block hits with his 120 base Special Defense, giving a Raikou-esque Calm Mind / Substitute feel. This is the Pokemon that makes Baton Passing such a dangerous strategy, since it stops Pokemon with Roar. I usually prefer Encore on here to stop Pokemon from Calm Minding up against you and getting away with it. Barrier is a good choice to make Mr. Mime very hard to take down by both physical and special attacks.</p>"},
      "Trickster": {"description": "<p>Trick a Choice Band into your opponent, and Torment them so they struggle every other turn. It's a decent strategy. I'd rather stick with the first set, though.</p>"},
      "Encore + Baton Pass": {"description": "<p>Substitute to block status, Encore and pass the Substitute to another Pokemon capable of causing destruction. Mr. Mime is a wonderful Baton Passer, you see.</p>"},
      "Calm Mind Sweeper": {"description": "<p>Put something to sleep, get a free Substitute or Calm Mind and pass it along or begin to sweep.</p>"}
    }
  },
  "Meganium": {
    "overview": "<p>Strictly to be used in UU competition, as it will get eaten alive in most OU games. Ground resistance is nice, and it's one of the few pure Grass-types. Cool Pokemon, but there are better Grass-types for most teams.</p>",
    "comments": "<h3>Other Options</h3> <p>Razor Leaf is a shafted move in ADV, but a critical hit can mess up things. Grass Whistle is a poor man's Sleep Powder, and again it could hit once. Meganium is very durable and won't mind the accuracy drop as much as fragile Sleepers like Persian would. Toxic is nothing new as an alternative and can work well on something as bulky as Meganium.Substitute + Leech Seed is an interesting combination that should always be mentioned, but Meganium is really too slow to abuse it.</p> <p>Swords Dance can power up physical moves, but you're probably better off using Victreebel for the STAB on Sludge Bomb. Giving Meganium Hidden Power Fire or Hidden Power Ice will allow you to cover more Pokemon types. Finally, if you are paranoid about being statused, Rest over Synthesis is an option. Don't try Sunny Day or Solar Beam, though; use Vileplume or Exeggutor for that.</p> <h3>EVs</h3> <p>If you plan to use Reflect, you'll want to get more Special Defense than suggested above. Alternately, you can use more Special Attack to help a bit with Walrein switches.</p> <h3>Checks and Counters</h3> <p>You'll want to watch out for all Grasses, especially those that carry Toxic or are named Vileplume. Fire-types pretty much prove an end to Meganium. Muk and other Poisons in general will have an easy time switching in and have STAB Sludge Bomb to hit Meganium hard. Tentacruel can turn Leech Seed against you with Liquid Ooze, and set up a Swords Dance sweep, or just straight up Sludge Bomb you.</p>",
    "sets": {"Standard": {"description": "<p>Counter is great on Meganium, 100 base in both defenses works excellently. For pseudo-passing and the 50% recovering Synthesis the same cool defenses are a big benefit. Leech Seed is a move every Grass-type should use, can give your team healing support. Too bad Meganium doesn't have better offensive moves. Counter works best with Light Screen, as it will protect you on the Special side while you kill them if they hit you physically.</p>"}}
  },
  "Feraligatr": {
    "overview": "<p>Feraligatr is actually a pretty good Pokemon overall, it's pretty diverse and doesn't really have any bad stats. Always an unexpected surprise in the UU environment, particularly since your foe will not know what the crocodile will throw at you!</p>",
    "comments": "<h3>Other Options</h3> <p>Hey, some people have pulled off a successful special Gyarados, and if he can do it, Feraligatr can (might) be able to, too! It is definitely unexpected, and that Special Attack isn't awful, and it's got a fair few special attacks there (Crunch and Dragon Claw too), so it's always up for consideration. Brick Break is there, of course, and if you don't like Swords Dance, you can go for a choice band set if you really want. Counter is somewhat unexpected on this Pokemon, so it's a possible choice. Screech at the very least forces a switch, or else let you totally destroy your foe.</p> <h3>EVs</h3> <p>For the first moveset you will want to max out that Attack, put a fair few into Speed, and dump the rest into HP. Its defenses are pretty good for the most part anyway. And maybe some into Special Attack to back Hydro Pump up a bit. Go Adamant or Brave. For the second one you'll want to split your EVs like you would for Gengar and Swampert.</p> <h3>Checks and Counters</h3> <p>This big brute will survive weaker Electric and Grass attacks, but I wouldn't push your luck. It is a fair balanced Pokemon overall, just watch out for strong Normal-type sweepers (unless you have Brick Break), fast users of Sleep Powder and Will-O-Wisps.</p>",
    "sets": {
      "Physical Sweeper": {"description": "<p>It's hard to believe that something this ugly is the forgotten one of all the starters. Well, those stats are a cut above most UU Pokemon, and, despite the fact that they are not really in the right places, you will find the crocodile to be a useful part of your UU team. He has good staying power, and can hit pretty hard.</p> <p>It's basically your standard physical sweeper, Earthquake and Hidden Power Flying are an attempt to cover its two weaknesses, Swords Dance to boost them, and Hydro Pump to hit the Pokemon with higher Defense, scoring an easier kill on Sandslash, Golem and friends. Rock Slide is probably more traditional on a physical sweeper like this, but I normally go with Hidden Power Flying. He should be able to get a Swords Dance in, and he's not THAT slow, so he should be able to score a fair few good hits.</p>"},
      "SubPunch": {"description": "<p>In UU this might be good, seeing as Feraligatr has pretty decent stats for that environment.</p>"}
    }
  },
  "Ampharos": {
    "overview": "<p>Ampharos makes a name for itself as the best cleric and Electric-type in ADV UU. In a metagame where teams are filled with multiple Pokemon using Toxic or spreading paralysis, Heal Bell is one of the most valuable utility tools for sustaining both offensive and defensive Pokemon, and Ampharos is very effective at using it. Ampharos is a common switch-in to the tier's plethora of Water- and Electric-types by virtue of having impressive mixed bulk coupled with a great ability in Static, which is good at punishing weak contact moves like Rapid Spin, Thief, and Scyther's Aerial Ace. Ampharos isn't a completely passive wall, however, as it is blessed with an astounding base 115 Special Attack stat, which is tied for the highest in the tier with Omastar. This means that it doesn't need much investment to match the power of other Electric-types. Ampharos is a staple on a wide variety of teams that need its cleric support, from balance to bulky offense, working on both Toxic spam and paralysis spam archetypes.</p> <p>However, what can hinder Ampharos as a wall is its lack of recovery outside of Leftovers. This, in conjunction with its poor base Speed, means it has trouble switching in repeatedly when Spikes are up. While Heal Bell is a good support option, its low 8 PP is also a problem for Ampharos, meaning it has to use its opportunities to use Heal Bell wisely, lest it gets overwhelmed by foes repeatedly statusing it. Many Pokemon can also use Heal Bell as an entry point, including powerful wallbreakers such as offensive Kangaskhan and Choice Band Solrock. The tier's common physical attackers usually run Ground-type moves, which Ampharos doesn't like taking due to its lower physical bulk, and even Water-types like Blastoise and Walrein can use Earthquake to keep Ampharos from repeatedly switching in. Finally, while Ampharos deals decent neutral damage, it can fall short of breaking past specially bulky targets like Kangaskhan and Cradily, often relying only on Toxic and Spikes pressure to make progress against them.</p>",
    "comments": "<h3>Other Options</h3> <p>Focus Punch can be used over a status move with a Quiet nature to break past Kangaskhan, but it reduces Ampharos's ability to make progress using status, and it isn't guaranteed to 2HKO Kangaskhan with Defense investment. Protect can be used instead of a status move for Ampharos to gain more Leftovers recovery, scout Choice Band users such as Solrock, and guard itself against Explosion from Pokemon like Qwilfish and Electrode. Rest can be used with a secondary cleric to give Ampharos recovery and preserve Heal Bell PP for itself. Hidden Power Grass is an alternative Hidden Power choice to be able to deal meaningful damage on Lanturn without resorting to Toxic, and it hits Golem and Quagsire 4x super effectively. However, Hidden Power Ice is preferred for more common checks to Ampharos. Counter can be used to get a surprise KO on some physical attackers that threaten Ampharos, but it has higher risk than reward compared to other consistent options.</p> <h3>Checks and Counters</h3> <p><strong>Kangaskhan</strong>: Kangaskhan walls Ampharos with great special bulk and Early Bird Rest to nullify status. Kangaskhan's Speed also means it will get the jump on Ampharos to pressure with a Normal-type STAB move or to recover off damage it takes from Thunderbolt with Spikes up. Even if Kangaskhan isn't going the bulky route, its offensive sets are able to severely dent Ampharos while avoiding Static when using Earthquake.</p> <p><strong>Ground-types</strong>: Ground-types can find entry on Thunderbolt and proceed to scare out Ampharos. Nidoqueen is a bulky wallbreaker with a Toxic immunity that can use its entry to pressure Ampharos's team with strong coverage and Sludge Bomb poisons, which puts the onus on Ampharos to come back in to use Heal Bell to clear the poison, circling back around to giving Nidoqueen entry again. Quagsire and Camerupt's unique typings allow them to not be affected by BoltBeam coverage, which lets them stonewall Ampharos and apply pressure to its team. Other Ground-types such as Gligar, Golem, Sandslash, and Nidoking can find entry, but they take more damage from Hidden Power Ice and have to be more careful when switching in.</p> <p><strong>Grass-types</strong>: Bulky Grass-types are able to come in and wall Ampharos, with their weakness to Hidden Power Ice being offset with bulk and instant recovery. Cradily is a prime Ampharos check despite its vulnerability to Toxic. It has great special bulk that lets it shrug off Hidden Power Ice, packs super effective coverage in Earthquake to punish passive plays like Toxic and Heal Bell and threaten a 3HKO, and has Recover with 32 PP, which means unlike other Grass-types that rely on Synthesis or Moonlight, its recovery option can be used liberally over the course of a game. Vileplume is immune to Toxic while having Leech Seed and Moonlight to outlast Ampharos with recovery, and it makes progress through Sludge Bomb poisons or even setting up Swords Dance. Roselia and Cacturne enter on Ampharos to set up Spikes, with Roselia preventing Ampharos from making progress due to its Toxic immunity and Synthesis and Cacturne exerting pressure with Encore and Counter.</p> <p><strong>Bulky Electric-types</strong>: Ampharos is able to check itself due to its huge bulk, and it can force opposing Ampharos to burn Heal Bell PP by repeatedly using status moves. Lanturn can find entry on Ampharos with Volt Absorb healing off any prior damage it takes, meaning it can stonewall Ampharos due to its BoltBeam resistance. Lanturn can protect itself against status from Ampharos by using Substitute or Rest, and can pressure it by battering it down with Surf or forcing it to burn Heal Bell PP by using Toxic.</p> <p><strong>Muk</strong>: Muk's enormous special bulk, coupled with a Toxic immunity, allows it to come in on Ampharos and break open holes in Ampharos's team, or even pose a threat to sweep with Curse + Rest.</p>",
    "sets": {
      "Cleric": {
        "description": "<h4>Set Description</h4> <p>Ampharos is a team's primary user of Heal Bell, which allows it to absorb status and cure its teammates of their own status, increasing the longevity of bulkier teammates or keeping offensive threats healthy, both of which include itself. Hidden Power Ice is used to hit Grass- and Ground-types such as Vileplume, Cradily, and Gligar. Most Ground-types besides Nidoqueen are 2HKOed by it, while Gligar is OHKOed, making their entry risky if Ampharos makes correct predictions. Toxic lets Ampharos make progress against defensive cores and cripple its checks that aren't immune to Toxic such as Kangaskhan, Lanturn, Cradily, Hypno, and opposing Ampharos. Thunder Wave is an alternative status option to hinder the Speed of Pokemon like Kangaskhan and Arcanine on paralysis spam structures.</p> <p>Maximum HP and 88 Defense EVs let Ampharos avoid a 2HKO from Choice Band Scyther's Hidden Power Bug, and 120 Special Defense EVs prevent a 3HKO from Lapras's Ice Beam. 16 Speed EVs are also used to outspeed certain defensive Omastar spreads.</p> <h4>Team Options</h4> <p>Ampharos pairs well with nearly every Pokemon in the tier, but it especially appreciates teammates that can help sustain its longevity or pose an offensive threat. Kangaskhan provides Ampharos Wish support, spreads status through Toxic or Body Slam, and absorbs status from Ampharos's checks to maintain Heal Bell PP. Omastar checks most physical attackers that can threaten Ampharos, and it provides Spikes support that helps Ampharos threaten its checks upon switching in, since most of them aren't Spikes immune. If a Rapid Spin user tries to remove Omastar's Spikes, Ampharos can find entry and punish their attempt at spinning with Static. Omastar can also reliably run Rest with cleric support, keeping it healthy to check physical attackers long-term. Rapid Spin support from Tentacruel, Blastoise, and Hitmontop is appreciated for Ampharos to comfortably switch into the things it checks. Vileplume partners well with Ampharos, as its bulk and multitude of recovery options allow it to check Kangaskhan and opposing Ampharos, and it provides extra status support through Sludge Bomb poisons or Stun Spore. Pokemon that pose sweeping threats help Ampharos's team establish a long-term offensive threat to mitigate some of Ampharos's own passivity. Long-term win conditions with Rest such as Slowking, Xatu, and Curse users like Walrein, Lapras, and Muk are great in this role, as they are at their most threatening when backed by cleric support to reduce the number of turns they are asleep. Ampharos is one of the best leads in the tier, as it checks common leads such as Qwilfish, Granbull, and Walrein, and it can stalemate with other Electric-type leads like Ampharos and Electabuzz. However, it can also be useful outside of the lead position to preserve its health until it needs to switch in against Water- and Electric-types.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "EllingtonReborn", "user_id": 619555}], "teams": [{"name": "Quality checked by", "members": [{"username": "Bouff", "user_id": 121672}, {"username": "LpZ", "user_id": 476616}]}, {"name": "Grammar checked by", "members": [{"username": "Tbolt", "user_id": 555379}]}]}
  },
  "Azumarill": {
    "overview": "<p>Azumarill has an easy time coming in on attacks in standard and might actually hurt the opponent, however it is really flawed in that it lacks physical STAB, or good stats not named HP or that auto-boosted Attack to begin with. It's good on paper, but isn't used much for a reason.</p>",
    "comments": "<h3>Other Options</h3> <p>Hydro Pump or Surf can be used to try and beat physical walls like Solrock/Gligar. Attract, like Sing and Encore, can buy you more time to Focus Punch. Light Screen supports the team against the Electrics Azumarill hates, while Charm and Tickle help against physicals. Icy Wind slows down opponents, it takes a while for Azumarill to catch up with it but your team might appreciate it. Perish Song forces switches, Present is a fun gamble that will either hurt the crap out of your opponent, do shitty damage or heal them. Azumarill is too slow to Belly Drum effectively but it's there.</p> <h3>Checks and Counters</h3> <p>Gligar and Solrock, by themselves or used together, wall this Pokemon quite effectively. A fast Electric starter could also just end it from the start and Vileplume can take any of its non STAB attacks. Sableye sadly walls this Pokemon from head to toe and can heal off any hopes of getting a critical hit with Hidden Power Ghost and whatnot.</p>",
    "sets": {"SubPunch": {"description": "<p>This set is a bit harder to use in UU than in standard, because most Pokemon are either really offensive or use Toxic, and nearly everything is faster than Azumarill. Gligar and Solrock sort of wall this set, but Azumarill learns Ice Beam and STAB Water moves to remedy that.</p>"}, "Choice Band": {"description": "<p>If you can predict, this might work. Azumarill is really slow and has low defenses though, and no STAB on any physical move. Like with the first set, it should be brought in on Waters. Focus Punch can do major damage sometimes.</p>"}}
  },
  "Jumpluff": {"sets": {"SubSeed": {}, "Swords Dance": {}}},
  "Granbull": {
    "overview": "<p>With good stats, a nice ability, and an awesome movepool, Granbull is a great UU Pokemon. Not only can it be a hard hitter, it can also wipe away status from your team with Heal Bell while spreading paralysis around an opponent's team with Thunder Wave.</p>",
    "comments": "<h3>Other Options</h3> <p>Granbull is certainly beefy enough to Roar. It can take most physical hits to Counter back for big damage. Reflect is a good move to pseudo-pass if you really need it. Granbull may have access to many special moves, but those should be avoided because of how much lower Granbull's Special Attack is compared to its Attack.</p> <h3>EVs</h3> <p>Adamant with nearly max Attack for every set except for the Heal Beller is the usual way to go. The utility Granbull will need more HP and Def that the others, though its Attack should never be neglected.</p> <h3>Checks and Counters</h3> <p>Blastoise and Walrein can take on hits from non-Choice Band sets and stall it out with Rest, but they aren't always the best choice. Reflect Meganium can take a few hits and heal them off with Leech Seed or Synthesis. You'll probably be best off by hitting it with STAB Thunderbolts from the Electric types or other fast hard hitters. If it lacks Earthquake, Aggron and Golem will stop it cold. If it lacks Shadow Ball, Misdreavus will have a chance to set up and sweep, and Solrock will be able to beat it 1v1.</p>",
    "sets": {
      "Bulk Up": {"description": "<p>The strategy for this set is rather simple: Bulk Up against physically weak opponents and Rest off the damage. The attack drop from Intimidate makes Bulking Up easier than with other Pokemon. The choice between Earthquake and Shadow Ball is dependent on your team. Earthquake covers Golem, Aggron, and other Normal-resistant Pokemon in UU, whereas Shadow Ball hits Misdreavus, Solrock, and Lunatone, and does a bit more to random Psychics than Return.</p>"},
      "Choice Band": {"description": "<p>Choice Band Granbull is dangerous in a UU environment. Its excellent Attack stat and diverse movepool more than compensate for its lackluster Speed. A team that has lost its physical wall will be devastated by this Granbull, therefore it will serve you better to save it for late game when you will be able to more accurately predict an opponent's moves which is the key to every Choice Band set.</p>"},
      "Support": {"description": "<p>This utility set is a completely different direction for Granbull. It is slow but has the Defense to function as decent UU Heal Beller. Just don't pair it up with Exploud or Mr. Mime, as they cannot receive the benefits of Heal Bell. Give it whichever secondary attack and status you need more on your team. While this set isn't as generally good as the others, it is a valuable option due to lack of viable clerics in UU, where Toxic and Thunder Wave users abound.</p>"},
      "SubPunch": {"description": "<p>Intimidate is always nice for a lead off Pokemon where this Granbull functions best. Substitute allows you to take a break from the prediction needed for the Choice Band set and sets up the powerful Focus Punch for the common Rock and Steel type switch-ins. Return is for STAB, and Shadow Ball hits Solrock and Lunatone, as well as Misdreavus and other Ghosts. You can use Brave to guarantee you'll move last, meaning you can take a hit, set up a Substitute, and then use Focus Punch as they break the Substitute.</p>"}
    }
  },
  "Hitmonlee": {
    "overview": "<p>Hitmonlee is actually pretty good. In UU, it is a force to be reckoned with.</p>",
    "comments": "<h3>Other Options</h3> <p>It can Double Kick for stuff like Substitute Aggron, but it's not that useful. It can use Return to hit Gligar harder than any of your other moves.</p> <h3>EVs</h3> <p>Attack and Speed, only.</p> <h3>Checks and Counters</h3> <p>Gligar is the best counter, thanks to its high Defense, Flying STAB, and Hitmonlee's low Defense. Slowking will also have a thing or two to say to it. Masquerain beats those without Rock Slide. Blastoise and Meganium can take hits from the Choice Band set. Grumpig and Hypno can use it to set up Calm Mind with their Fighting resistance, but Hidden Power Ghost will put the hurt on them.</p>",
    "sets": {"Choice Band": {"description": "<p>Use this Choice Band set how you would any other Choice Bander, with one important proviso: Hitmonlee can also switch into paralyzing moves such as Thunder Wave with impunity, since it has the Limber ability. Rock Slide isn't particularly useful in UU, as even Focus Punch hits Gligar harder on the switch, but it is useful for Pinsir and Scyther.</p>"}, "Reversal": {"description": "<p>Substitute or Endure to get your Salac Boost and then attempt to sweep. This is a pretty simple and standard strategy, but again Hitmonlee's Limber ability is extremely useful for this set.</p> <p>Bulk Up can be used with either Substitute or Endure, but Focus Punch should be used with Substitute. If you are using Bulk Up, you may want to lower your Speed to 254 Speed (176 EVs) and put the rest into HP so you can potentially get 2 or more Bulk Ups, as this still allows you to outspeed everything in UU but Timid Electrode, which is extremely rare.</p>"}}
  },
  "Hitmontop": {
    "overview": "<p>Hitmontop is one of the tier's few Fighting-types, offering unique role compression by being able to both use Rapid Spin and check the tier's best Pokemon, Kangaskhan. Hitmontop's ability Intimidate isn't just useful for switching into Kangaskhan, however, as it checks a slew of other physical attackers such as Granbull, Nidoqueen, and Solrock, which Hitmontop counters. Its base 110 Special Defense is nothing to scoff at either, letting it take hits and trade with certain special attackers in a pinch such as Tentacruel, Ampharos, and Lanturn. Hitmontop's access to Fighting-type STAB lets it threaten many common Pokemon, and it has a good physical movepool for coverage to back it up.</p> <p>However, while Hitmontop can both check Kangaskhan and use Rapid Spin as dual role compression, it finds itself being less effective at both than the Pokemon it competes with, such as Granbull for the former and Tentacruel and Blastoise for the latter. Hitmontop's meager base 50 HP and lack of reliable recovery means it can have trouble switching in against offensive Kangaskhan variants with Spikes up. Without the Intimidate Attack drop, it also takes heavy damage from the physical attackers it means to check besides Solrock. Hitmontop's onus to use Rapid Spin can also make it passive against Spikes teams, and it tends to invite in dangerous Pokemon such as Scyther and Gligar. Not only this, but Hitmontop can struggle against teams using Misdreavus to spinblock, as Hitmontop does not like wasting its health to Psychic without getting a chance to use Rapid Spin. Hitmontop also has issues offensively; as a Fighting-type, it wants as much coverage as possible but can't fit everything into one set, giving it painful four-moveslot syndrome. Even with the proper coverage, Hitmontop's unimpressive base 95 Attack means it lacks power even against the Pokemon hit super effectively by it, such as Omastar, Walrein, and Cradily.</p>",
    "comments": "<h3>Other Options</h3> <p>Mach Punch serves as a priority move to check sweepers such as Reversal Scyther, Rain Dance Omastar, and Petaya Berry Electric-types such as Electrode and Manectric. Thief can be used with no item to steal Leftovers from bulky Pokemon such as Ampharos, Tentacruel, and Vileplume. However, Hitmontop has to drop valuable coverage to run it, and it can backfire if Hitmontop accidentally steals a Choice Band from Scyther. Rest can be used alongside a cleric to gain recovery, but it makes Hitmontop much more passive while asleep, and it can't threaten with more coverage. Bulk Up can be used over a coverage option to pose a potential sweeping threat when it finds entry, and Hitmontop can use it to match the boosts of Curse users such as Walrein, Lapras, and Muk. High Jump Kick sounds appealing to threaten Kangaskhan and Omastar more than Brick Break can, but the extra damage is not worth it when considering its less than perfect accuracy and potential for massive recoil damage on a Pokemon that already struggles to preserve its health. Hitmontop can use Endeavor, Mach Punch, Hidden Power Ghost, and Endure with a Salac Berry on a lead set for a surprise way to make progress on offensive teams by breaking holes for offensive teammates to capitalize on, but its general consistency is very low compared to standard Rapid Spin sets.</p> <h3>Checks and Counters</h3> <p><strong>Flying-types</strong>: Gligar is not hit meaningfully by any of Hitmontop's coverage options, and it can set up Swords Dance to threaten Hitmontop with boosted Hidden Power Flying while not caring about Intimidate thanks to Hyper Cutter. Altaria can sit in on Hitmontop and stall it out with Toxic, as even Rock Slide won't be able to 3HKO physically defensive variants. Scyther can find entry on resisted moves or Rapid Spin and threaten Hitmontop with a strong Aerial Ace or Hidden Power Flying, but it has to be mindful of Rock Slide when switching in, and Rock Slide Hitmontop can find entry on a Scyther that is Choice-locked into Hidden Power Bug to scare it out. Fearow is similar to Scyther with a stronger Flying-type STAB option in Drill Peck, but finds less entry due to not resisting Brick Break.</p> <p><strong>Psychic-types</strong>: Psychic-types such as Slowking, Xatu, and Grumpig use their resistance to Fighting to find entry and threaten Hitmontop on the special side. None of them are OHKOed by Hidden Power Ghost, and the Psychic-types that are 2HKOed are faster, which means they win one on one. They can even take advantage of Hitmontop switching out by setting up Calm Mind, which lets them exert a lot of offensive pressure even when Hitmontop removes the Spikes they depend on.</p> <p><strong>Ghost-types</strong>: Misdreavus, Haunter, and Sableye are immune to Brick Break and can spinblock Hitmontop to keep Spikes up. Even though Misdreavus and Haunter's Psychic don't do amazing damage to Hitmontop while Hidden Power Ghost deals good damage to both, they can use it to pressure if Hitmontop's health is low enough. Haunter can also use Destiny Bond to remove Hitmontop for one of its teammates and for Spikes to stay up for the remainder of the battle. Sableye can completely wall Hitmontop lacking Toxic, with tools like Toxic and Knock Off to harm Hitmontop's longevity and Recover to outlast it.</p> <p><strong>Vileplume</strong>: Vileplume doesn't care about any of Hitmontop's coverage, and it can even heal off the damage it takes from Hitmontop with Leech Seed or Moonlight while making progress through spreading status with Sludge Bomb or Stun Spore. Swords Dance variants are also able to take advantage of Hitmontop to pose a sweeping threat while boosting past Intimidate.</p> <p><strong>Muk</strong>: Muk can switch in on Hitmontop to break open holes for its team, only being threatened by Earthquake. Muk can also use Curse + Rest to use Hitmontop as long-term setup fodder to pose a sweeping threat.</p> <p><strong>Intimidate</strong>: Opposing Intimidate hinders the effectiveness of Hitmontop, which already struggles with power. Even Granbull, which is weak to Brick Break, can utilize Intimidate and its great physical bulk to take negligible damage from Hitmontop and potentially set up with Bulk Up. Arcanine doesn't take much damage from Brick Break and threatens Hitmontop with Fire Blast. Opposing Hitmontop are also effective Hitmontop switch-ins, allowing both to reverse Spikes momentum for their teams.</p>",
    "sets": {
      "Rapid Spin": {
        "description": "<h4>Set Description</h4> <p>Hitmontop finds opportunities to use Rapid Spin by coming in on physical attackers such as Kangaskhan and Solrock, as well as a chipped Omastar in 2HKO range for Brick Break, as Hitmontop loses the interaction otherwise. Hidden Power Ghost is needed to check Solrock, and additionally hits other Psychic-types such as Slowking, Grumpig, and Lunatone, as well as Ghost-types such as Misdreavus and Haunter, which can spinblock Hitmontop. Hitmontop's third coverage move is important for deciding which Pokemon it will cover while sacrificing other matchups. Earthquake can be chosen to hit Poison-types, such as Tentacruel, Qwilfish, Nidoqueen, Nidoking, and Muk, and it can hit Electric-types hard without activating Static. Rock Slide is chosen to hit Flying-types such as Scyther, Altaria, and Fearow, usually on the switch in. Toxic helps against irritating walls such as Blastoise, Cradily, Sableye, and Hypno; it also is a generally safe move to use, as it cripples most of Hitmontop's switch-ins without having to guess with a coverage option.</p> <p>The given EV spread lets Hitmontop have favored odds to 3HKO Omastar with Brick Break while also dealing important damage to bulky Kangaskhan, Cradily, and Misdreavus. The rest of the EVs are put in HP and Defense to let Hitmontop switch in on physical attackers. More EVs can be placed into Speed to hit benchmarks for outspeeding certain Pokemon; 136 Speed EVs let Hitmontop outspeed offensive Omastar, and 184 Speed EVs allow it to outspeed defensive Kangaskhan variants. However, the extra Speed isn't always worth the loss in bulk unless it's needed for Hitmontop's team.</p> <h4>Team Options</h4> <p>Due to Hitmontop lacking reliable recovery, it is rarely seen without Wish Kangaskhan, which helps Hitmontop switch into common Kangaskhan switch-ins, such as opposing Kangaskhan, Omastar, Solrock, and Granbull, over the course of a longer game. Hitmontop is vulnerable to status such as Toxic from Kangaskhan when switching into it, which harms its general longevity, so a cleric such as Ampharos, Aromatherapy Vileplume, or Altaria helps patch up this issue. Hitmontop tends to invite in setup sweepers such as Swords Dance Scyther, Gligar, Curse Muk, and Swords Dance Vileplume, and it lacks power to prevent Curse Lapras, Curse Walrein, and Feraligatr from setting up on it. For this reason, Hitmontop pairs well with a phazer such as Encore Walrein, Roar Blastoise, Roar Altaria, or Perish Song Misdreavus. Hitmontop appreciates Pokemon that can switch into the Flying-types it tends to draw in, including most of the aforementioned Pokemon like Walrein, Altaria, Lapras, and Misdreavus. In return, Hitmontop switches into and checks Solrock, which threatens these Pokemon. Hitmontop can be used in the lead position to Intimidate physical attackers and win the 1v1 against leads like Ampharos, Kangaskhan, Walrein, and Nidoking, or it can be used in the back to switch into physical attackers or Spikers mid-game when it needs to.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "EllingtonReborn", "user_id": 619555}], "teams": [{"name": "Quality checked by", "members": [{"username": "LpZ", "user_id": 476616}, {"username": "BigFatMantis", "user_id": 507497}]}, {"name": "Grammar checked by", "members": [{"username": "Clouds", "user_id": 356215}, {"username": "Aera", "user_id": 572981}]}]}
  },
  "Exploud": {"sets": {"Mixed Attacker": {}}},
  "Electrode": {
    "overview": "<p>When it comes to fast Electric-types, Electrode has no issues standing out. Its astonishing base 140 Speed makes it the fastest unboosted Pokemon in the tier by quite some margin. With its incredible Speed, usable Special Attack, and Explosion, it makes for a good revenge killer and suicide wallbreaker on offensive teams. Electrode can reliably revenge kill Scyther, which other Electric-types like Manectric and Electabuzz can only Speed tie with. It also pairs well with Electric-types, though, as they share a lot of checks that Electrode can lure in and destroy with Explosion. However, Electrode's offensive stats leave something to be desired when comparing it to Electabuzz and Manectric, and although its Explosion hits hard, it won't KO bulkier Pokemon without some prior damage. It also has less than stellar bulk, so it won't withstand most super effective hits, and even strong neutral hits like Kangaskhan's Double-Edge will KO it without much prior damage.</p>",
    "comments": "<h3>Other Options</h3> <p>Taunt is an option over Substitute on some teams to easily KO Wish Kangaskhan with Explosion. Hidden Power Grass hits Lanturn without resorting to Explosion, but the downsides of dropping Hidden Power Ice are generally not worth it. Thunder Wave could be used on teams that appreciate faster Pokemon being slowed down.</p> <h3>Checks and Counters</h3> <p><strong>Kangaskhan</strong>: Although weakened Kangaskhan can be KOed by Explosion, offensive versions can OHKO Electrode back with ease. Rest means it might be able to switch out and heal any damage later, undoing Electrode's hard work. It also can potentially switch out or use Protect on a predicted Explosion.</p> <p><strong>Bulky Electric-types and Grass-types</strong>: Volt Absorb Lanturn renders Hidden Power Ice Electrode useless and may run Protect to block Explosion or Rest to handle Toxic. Ampharos cannot deal much damage to Electrode at once but generally outlasts it with its superior bulk and power. Cradily completely sits on Electrode unless it runs Toxic, as it is 3HKOed by Hidden Power Ice at best. Vileplume is also an effective counter, as it resists Thunderbolt and isn't 2HKOed by unboosted Hidden Power Ice. However, all of these Pokemon but Cradily fall to Explosion with enough chip damage.</p>",
    "sets": {
      "Substitute": {
        "description": "<h4>Set Description</h4> <p>Substitute gives Electrode a much needed shield from hard hitters, scouts for switch-ins when forcing foes out, and helps activate Petaya Berry or Liechi Berry. Explosion leaves a serious dent in most foes despite Electrode's horrible Attack. This is helped because Electrode's checks do not resist Normal; the main Pokemon that does, Omastar, wants nothing to do with Thunderbolt, and Ghost-types in Misdreavus and Banette are fairly uncommon and don't enjoy Thunderbolt either. Hidden Power Ice lets it OHKO Gligar and push damage on Vileplume so Explosion KOes. Toxic can cripple Cradily, which otherwise walls Electrode.</p> <p>As for its item, a pinch Berry is the most common choice. Petaya Berry is generally the best choice for its Special Attack boost, but Liechi Berry can be useful for instantly taking down a bulkier Explosion target like Kangaskhan, Vileplume, Ampharos, or the uncommon Hypno. Leftovers is another option, especially if Electrode is running Toxic, as it gives it longevity and potentially more Substitute uses. Magnet is useful if Electrode is running a Speed-boosting nature to give it a much needed damage boost to Thunderbolt.</p> <p>Because its Speed is so high, Electrode generally doesn't need a lot of Speed EVs unless you want it to outrun a specific boosted target, such as Gorebyss in rain or Salac Berry-boosted base 50s, 55s, or 60s like Banette. Not requiring a lot of Speed EVs means that it can invest in Special Attack, Attack, and even bulk at the same time. The spread shown above puts Electrode at 340 Speed with a neutral nature, letting it outrun base 105s like Scyther, Manectric, and Electabuzz. The spread also makes Substitute take exactly 25% of Electrode's health, allowing for the quickest activation of its pinch Berry. If not using one, this benchmark is unnecessary. 116 Defense EVs let Electrode take maximum Attack Kangaskhan's Earthquake. If you are not using any HP investment, 128 EVs will do the same. The other EVs are dumped into Attack for Explosion. An alternative spread is 100 Atk / 192 SpA / 216 Spe with a Naive nature, which revenge kills Swift Swim Gorebyss.</p> <h4>Team Options</h4> <p>Since Electrode needs help to break through bulkier Pokemon, Spikes is a natural fit with it. Omastar and Glalie make for good Spikes users, since the former can switch into Kangaskhan and fit on almost any team, and the latter is great at getting Spikes up early on for Electrode to take advantage of. Electrode makes a great partner for a second Electric-type like Manectric or Electabuzz, which greatly appreciates Electrode baiting in and using Explosion on shared counters, and they too appreciate Spikes support. Rain Dance Omastar, Scyther, and Gorebyss also appreciate Electrode's ability to lure in and destroy the likes of Ampharos, Vileplume, and Kangaskhan.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Cubic Skunk", "user_id": 527292}], "teams": [{"name": "Quality checked by", "members": [{"username": "Heysup", "user_id": 21929}, {"username": "Plas", "user_id": 355066}]}, {"name": "Grammar checked by", "members": [{"username": "CryoGyro", "user_id": 331519}, {"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Qwilfish": {
    "overview": "<p>Qwilfish is still Tentacruel's little brother, but Spikes are much better in Advance than they were in GSC, so Qwilfish is a valuable part of any UU team. The last set listed is also an incredible surprise Pokemon and will almost always kill something. Without Spikes it'd be insanely mediocre, but with them it's a pretty good UU. Always consider this fish for any UU team you might be making.</p>",
    "comments": "<h3>Other Options</h3> <p>There are better Hazers out there, but Qwilfish can Haze if you want him to, maybe in lieu of Destiny Bonding. Ice Beam can be used to for stuff like Claydol and Salamence, I suppose, but most everything else, such as Grass-types, will be hit harder by Sludge Bomb. Counter can be used instead of Destiny Bond, though most stuff KOs Qwilfish and Destiny Bond tends to be a much better move.</p> <h3>EVs</h3> <p>If you're using a mixed set, you should lower his Defense (use Hasty or Lonely nature), especially if you're using Destiny Bond, as that would guarantee that most things kill you, but still lets you switch on Walrein, Blastoise, and other Water-types. You'll want a lot of Attack on the sweeper sets, but more defensive EVs on the Spiker.</p> <h3>Checks and Counters</h3> <p>Donphan and Claydol can completely shut you down if you don't have Hydro Pump, and Claydol doesn't take much even if you do. Big brother Tentacruel can easily get set up on Qwilfish, and anything that can take a Sludge Bomb and deal some good damage is a pretty good deterrent as well. Most Rapid Spinners tend to have more than enough defense to take you on, so don't get overzealous with the Spikes. Take what you can get. From the \"if it has to Destiny Bond you\" standpoint of counters, Muk and Misdreavus make great switch ins. Gligar and Solrock can also have a say or two in countering this blowfish if they can avoid Hydro Pump.</p>",
    "sets": {
      "Spiker": {"description": "<p>Not a bad set with a simple idea behind it. Lead with it or switch into a Toxic or even Sludge Bomb, use Substitute, then let the Spikes roll in. Finish off opponents with Sludge Bomb, and if you've done your Spiking job and their Rapid Spinner is gone, Destiny Bond or Self-Destruct some slower Pokemon to hell. If your slower opponent sees Destiny Bond and doesn't dare to kill you, lay more Spikes or Sludge Bomb him.</p>"},
      "Swords Dance": {"description": "<p>Swords Dancing set with the opportunity to kill something with Self-Destruct. Swords Dance up as much as you can and hit whatever isn't totally resistant to your two attacking moves. Hydro Pump is needed for Gligar in particular, but also hits Aggron, Golem, and the like.</p>"},
      "Uber Choice Band": {"description": "<p>This set is designed for the Uber metagame in particular, but can be used outside of it, you'll just need a lot more Speed. The theory is that Qwilfish becomes faster than everything else with Drizzle in effect (and thus should only be used with Kyogre), but can't stay in for long due to its poor defenses and lack of useful resists outside of Ice Beam. A Choice Band, therefore, suits the style of play Qwilfish generally needs to survive. Hydro Pump hits Skarmory, Forretress, and Metagross, and does something to Groudon, but Ice Beam will do more to Groudon and Rayquaza. Hydro Pump is probably going to be the more useful move, as Rayquaza is very rare, especially compared to Forretress, and Hydro Pump is not much weaker vs. Groudon than Ice Beam. Sludge Bomb still hits Rayquaza decently hard.</p> <p>The Speed makes it faster than +Speed Deoxys-A in the Rain, the fastest Pokemon you are likely to encounter.</p>"},
      "Flail": {"description": "<p>Man is this thing cool. Swords Dance to boost the power of Flail, Endure to get down to 1 HP and get the Salac boost, and then nail whatever you can with Flail. Gengar or some other resistant Pokemon comes in to take the Flail after they know you have it? Destiny Bond him back to hell when he tries to do dismantle Qwilfish. Excellent surprise set that is almost guaranteed to get one kill, if not two, even in standard play. Shadow Ball prevents Ghosts from ruining your sweep if you don't want Destiny Bond.</p>"}
    }
  },
  "Mantine": {
    "overview": "<p>It has a bad movepool and that 4x Electric weakness hurts a lot, considering that the special attacks most teams need to wall against are Electric and Psychic (which it doesn't resist).</p>",
    "comments": "<h3>Other Options</h3> <p>It can use Confuse Ray to stall a bit. Protect works for the same reason, except you lose the chance for them to hit themselves for far more consistency.</p> <h3>EVs</h3> <p>Always max HP on Mantine. A Calm nature will also prove the most useful in almost any circumstance. 181 Speed (20 EVs) for the Rain Dance sets, as this ensures it's faster than even Jolly Persian / Sneasel in UU, meaning only Electrode can possibly be faster than you (or other Pokemon with boosted Speed).</p> <h3>Checks and Counters</h3> <p>Electric moves, especially unexpected Hidden Power Electrics if it was damaged before. Physical attacks in general will really harm Mantine. It has no offensive capabilities save Toxic and the weak Surf / Ice Beam, so it's easy to switch into.</p>",
    "sets": {
      "Hazer": {"description": "<p>With 140 SpD, it is going to shrug off any special attack not named Thunderbolt, and it can even take one of those somewhat; 307 Special Attack is needed to surely OHKO this Mantine with STAB Thunderbolt, and 466 is needed without STAB. So switch this in anything you are sure won't Thunderbolt you (also watch out for Hidden Power Electric Waters), and Toxic away. Surf and Ice Beam is its whole special movepool.</p>"},
      "RestTalk": {"description": "<p>This set lets Mantine stay alive much longer, but you have to give up a bit of utility. It's OK, though, Mantine's movepool is so poor it doesn't really notice the loss of two slots. Mantine makes a decent Sleep absorber because most Pokemon with Sleep moves are walled by Mantine.</p>"},
      "Rain Dance Sweeper": {"description": "<p>Ice Beam and Surf because it has nothing more than the standard Water-type movepool, but they have good coverage and Surf is boosted by Rain Dance. You might want Hidden Power Grass to hit stuff like Quagsire and Poliwrath, but Toxic provides some nice all-around coverage for stuff like Hypno and Walrein (if it doesn't have Rest).</p>"}
    }
  },
  "Lunatone": {
    "overview": "<p>Awesome UU special sweeper, generally overlooked for other special sweepers like Grumpig or Electabuzz, but still very good in its own right.</p>",
    "comments": "<h3>Other Options</h3> <p>Reflect and Light Screen can be good for pseudo-passing, and Lunatone has the typing and stats to come in on a few things to set them up. I'd go with Reflect on Lunatone, since you could just Baton Pass Calm Minds if you want a Special Defense boost. Lunatone can also Baton Pass Cosmic Power in a Baton Pass chain.</p> <h3>EVs</h3> <p>You'll generally want to max HP, give a token Speed investment, and then stick the rest of your EVs into Defense and possibly Special Attack. Calm Mind covers Special Attack and Special Defense, though. For Baton Passing, give it enough Speed to be faster than Blastoise and Grasses, which means about 200 Speed, or 96 EVs.</p> <h3>Checks and Counters</h3> <p>Grumpig and Hypno counter Lunatone exceptionally well. Aggron could give it some trouble with its resistance. Sharpedo, Slowking and Crawdaunt needs some love and countering Lunatone is where they come in handy with resistance to Ice Beam and resistance or immunity to Psychic.</p>",
    "sets": {"Calm Mind + Baton Pass": {"description": "<p>Many people don't know that Lunatone gets Baton Pass, so this could be a shocker to them. It can sweep on its own if it has to, or Baton Pass all those Calm Minds to something fast like Electabuzz and sweep.</p>"}, "Special Attacker": {"description": "<p>Hypnosis what you can't Calm Mind against, or kill and then do what would work well in the situation.</p>"}}
  },
  "Solrock": {
    "overview": "<p>Solrock is a staple in UU play for a good reason: it's immune to Earthquake, resists Normal and Flying, can hurt its opponents, set up dual screens, Baton Pass goodies, and use Explosion whenever it wants. It's been so influential that standards have changed: Gligar packs Toxic, Steel Wing or Iron Tail to deal with it, Fearow uses Steel Wing and some Ground-types use Hidden Power Bug or Ghost. Still, it's good to go. In standard, it can counter some Choice Banders like Salamence and Tauros pretty decently, but you'll have to predict even more accurately because despite its good HP and Defense, it takes quite a beating from neutral or super effective hits.</p>",
    "comments": "<h3>Other Options</h3> <p>With Psych Up, Solrock can surprise Snorlax in standard play. Come in when it has some Curses, copy them, and either try to take it out by yourself, or Baton Pass to something to handle it and the rest of your opponent's team. You may want to watch out for Shadow Ball variants though. Cosmic Power can be Baton Passed as well, but usually begs for critical hits, which you don't want. Light Screen, like Reflect, helps Solrock and the rest of the team to take hits better. Since Solrock lures Water- and Grass-types, it's not a bad idea at all.</p> <p>Body Slam can paralyze opponents sometimes, and Fire moves can hurt Steel-types like Skarmory and Forretress in OU. Toxic can help to wear down the Water-types that switch in on Solrock all the time, and finally, he doesn't make a bad Rest / Sleep Talk user. It does take away a lot of its offense though.</p> <h3>EVs</h3> <p>For most tankish Solrock, a +Defense nature like Impish is preferred. Max out its HP before working on its defenses; put its Defense somewhere between 260 and 280 to live through most hits decently. Special Defense is welcome to take on Psychic-types. A few Speed EVs isn't a bad idea either, especially if you're using Shadow Ball. Solrock ties Speed with Claydol, and of course it helps against enemy Solrock too.</p> <h3>Checks and Counters</h3> <p>In OU, Metagross awaits it with its resistance to Rock Slide and Explosion, and a STAB super effective Meteor Mash for the OHKO. Earthquake without a Choice Band will only 3HKO Metagross, so watch out. Jirachi with Reflect or Wish can be annoying to an extent, but it needs Thunderbolt and a Calm Mind to really hurt Solrock. Swampert's, Milotic's, and Suicune's high durability and STAB Surfs will be a huge problem as well, try to remove them with Explosion and sweep with something else. Check for Protect Swampert first though, or do it on the switch. Skarmory and Forretress take jack from any physical hit you throw at them. Both will put up Spikes, and Forretress sometimes uses Hidden Power Bug. Celebi can Recover off all your hits, and may pack a Grass move to really put a hurting in you. Dusclops can kill you with Shadow Ball, Will-O-Wisp you, block Explosion and Rest/Pain Split off the damage.</p> <p>For UU, generally Water-types and Grass-types can come in on anything Solrock does, and use their STAB attacks to put a hurting in you. Most notably Quagsire, Whiscash, Blastoise, Poliwrath (usually has no Water moves though), Politoed, and Slowking on the Water side, and Meganium, Vileplume, Bellossom, and Tangela on the Grass one. Banette can be a pain with Will-O-Wisp but won't be switching in on Rock Slides or Shadow Balls. You must beware of it when you want to use Explosion though, and the same goes for when your opponent uses Misdreavus.</p>",
    "sets": {
      "Reflect": {"description": "<p>A supporting Solrock. Solrock can come in pretty easily on Gligar, Sandslash, Kangaskhan, or Fearow and put up a Reflect. You may want to beware of Shadow Ball, Steel Wing, and Hidden Power Bug, but as long as you switch to Solrock on the right move and put on a Reflect, you'll be fine. After that, attack to your heart's content, switch out of counters, and keep the cycle going until you've had enough. Blow up Solrock on something that doesn't like to get blown up, and its job is done.</p>"},
      "Choice Band": {"description": "<p>A more offensive version of Solrock. It won't take beatings nearly as well as the Reflect version, due to lack of Leftovers and defensive EVs, but it does pack a great punch. Preferably bring it in on Earthquakes to avoid unnecessary damage, predict your opponent's next move, and hit the appropriate button. Explode when you're through.</p>"},
      "Baton Pass": {"description": "<p>XD grants Solrock the luxury of Baton Pass, which it performs quite well. As mentioned before, it's easy to bring in. Get in a Substitute or a Calm Mind and Baton Pass to a recipient to raise some hell on your opponent. You can toy around with the moves and the EVs--Solrock can make a fairly decent Grumpig counter with some Special Defense EVs and Shadow Ball, while still fulfilling this duty.</p>"}
    }
  },
  "Shiftry": {
    "overview": "<p>It is indeed a very cool UU, and has some potential to be used in OU play. You'll have trouble getting it in, but once you do and get the Sunny Day, it's a menace to get rid of. I don't know why it got Grass-type since it's a Tengu, a bird-like evil spirit, but it's a good thing it did. It also has some use in Ubers, paired with Groudon for the Speed boost, so it can just abuse Shadow Ball to hit all the Psychic Ubers.</p>",
    "comments": "<h3>Other Options</h3> <p>Growth and Synthesis, but don't use them, they are just the other mediocre moves Shiftry learns. Better go with the above sets.</p>",
    "sets": {"Choice Band": {"description": "<p>Nothing resists Shadow Ball + Brick Break, Choice Band Explosion HURTS and Quick Attack / Fake Out if you need to finish off something. You need prediction, like every Choice Bander. The lack of STAB hurts, but you have the element of unpredictability. Ability won't matter all that much, Early Bird can help sopping up Sleep status and still be able to wake up before the match is over, Chlorophyll if you can get your opponent or one of your other Pokemon to use Sunny Day.</p>"}, "Swords Dance": {"description": "<p>A lot like the last set, except with Swords Dance this time over Choice Band.</p>"}}
  },
  "Fearow": {
    "overview": "<p>Another Pokemon restricted to the confines of UU, due to Dodrio being better than it in every way. In the UU environment, however, Fearow is always a recommended choice due to its high Speed and brutally powerful STAB moves.</p>",
    "comments": "<h3>Other Options</h3> <p>Fearow has a pathetic movepool, sadly, which is another reason why it isn't as great as Dodrio. Well, Steel Wing can be used to hit Solrock and Lunatone, same for Hidden Power Ghost (which also hits UU Ghosts harder than Drill Peck, but that doesn't cover the Rock / Steel-types). Hidden Power Ground, however, is better overall, especially against Aggron. Double-Edge is another option over Return just for that extra punch. Double-Edge from Fearow HURTS UUs that aren't named Golem or Aggron (and other walls with a Rock / Steel typing). Hyper Beam can do some serious damage if Fearow is about to die, or if you want to kill the opponent's last Pokemon.</p> <h3>EVs</h3> <p>4 in HP, 252 Attack, and 252 Speed, using a Jolly nature to outspeed and hit as much as possible.</p> <h3>Checks and Counters</h3> <p>Stuff like Rock- and Steel-types follow the trend of walling Fearow, especially Golem and Solrock. Ghost-types like Sableye and Banette can be used too. You should, however, be careful while switching stuff into Fearow again as it can hit pretty hard if the player predicts right. Strong defensive Pokemon like Blastoise or Gligar may trouble you.</p>",
    "sets": {"Choice Band": {"description": "<p>Fearow is a staple in UU teams, so you can just about bet your boots that you will face one in an UU tournament. It's not hard to figure out; just pick an attack move. It's one of the fastest UU Pokemon, and with Choice Band backing it, it can deal quite a fair bit of damage, even without having to be a super effective hit. Quick Attack, despite being weak, can sometimes make all the difference when you need it the most, and Hidden Power Ground is there to deal with nasty Rock or Steel-types.</p>"}, "Baton Pass": {"description": "<p>Fearow got Baton Pass as an XD move, so it can be nice to pass stuff around when people are expecting the Choice Band version.</p> <p>Use 252 Speed EVs with Jolly if you're using Substitute, or the suggested EVs with Adamant and Agility.</p>"}}
  },
  "Sandslash": {
    "overview": "<p>In standard, the only thing it has over Donphan is Swords Dance, while Donphan has better stats everywhere except in Speed, plus Roar. Therefore, when using Sandslash in standard, use Swords Dance. It's not a bad Pokemon there, maybe even a tad underrated, a Swords Danced Earthquake does about 70% to Milotic and minimally 60% to Swampert. It resists Rock Slide from Tyranitar and Aerodactyl pretty well, you may want to try it out sometime.</p> <p>In UU, Sandslash is a monster. It rivals Quagsire and Gligar as the best Ground around. It can 2HKO Quagsire and Blastoise with a Swords Dance, and if Gligar comes in on a Swords Dance it can take it out one on one, barring Toxic. Its great Defense and the use of Hidden Power Ghost or Rock makes it an alright Solrock switch-in (though Reflect will be annoying), and it can hurt its counters quite well. Be aware of Sandslash's great sweeping powers, whether you're using it or not.</p>",
    "comments": "<h3>Other Options</h3> <p>A great example in standard is Snorlax: try coming in on a Curse. Snorlax might be afraid you're going to Swords Dance up on him and will try to attack you, and a Counter will put a big dent into him. It will also be of great use against Choice Banders such as Salamence in standard or Fearow in UU.</p> <p>You can use Rest for that, but Sandslash may have a hard time surviving this without Heal Bell or Aromatherapy somewhere on your team. Same for UU, except that is even more fast-paced. Protect can be handy for lingering Toxic, gaining Leftovers recovery and scouting for Explosion or Choice Banded moves.</p> <p>Focus Punch can come handy if Skarmory comes in on your Swords Dance, but usually it will not hurt anything more than Earthquake and Rock Slide together will. Flail simply doesn't work well as Sandslash doesn't have STAB on it and isn't fast enough to pull it off. Hidden Power Ghost hits Gengar and Misdreavus harder than Rock Slide, and still puts a dent into Celebi, Solrock and Lunatone, and Hidden Power Flying is an awesome option to scare Heracross and Breloom, and it still hits Celebi, so it's pretty useful when you're using this guy in standard. Sandslash makes an average Sleep Talker thanks to his great defense, but you'll be wasting his awesome Swords Dance potential, and the most common Sleep moves come from Milotic, Jynx and Grass-types, none of which Sandslash likes to face.</p> <h3>EVs</h3> <p>It outspeeds Blastoise with no Speed EVs, with the recommended spread, as well as anything slower (Hypno, Solrock, and anything else with 70 base or lower). You'll generally want a ton of Attack, with the rest of the EVs in HP.</p> <p>If you're using Counter, you may want to take EVs from Attack and Speed and put them into HP.</p> <h3>Checks and Counters</h3> <p>Its biggest weakness is that it's slow and doesn't take special hits very well, but most special attackers do not take his Earthquakes that easily either.</p> <p>In standard, Skarmory walls Sandslash to an extent. Toxic will mess it up badly, Spikes will hurt the team and Roar and Whirlwind negate Swords Dance. However, Sandslash can also Rapid Spin off the Spikes, and hit Skarmory with a Swords Danced Focus Punch, or try to wear it down with Rock Slide (Swords Danced Rock Slide does about 40%). Suicune, Milotic and Swampert can OHKO with Surf or Hydro Pump, and their high HP and Defense will be troublesome in the early stages. If their health falls below 50%, however, a Swords Danced Earthquake will kill all three of them (except a Bold max Defense max HP Suicune, who has a chance to survive). Salamence and Gyarados can be a pain with Intimidate and immunity to Earthquake, but unless they're using a Special Attack like Hydro Pump, Sandslash can just Swords Dance on the switch and beat them with Rock Slide. Claydol is immune to Earthquake and resists Rock Slide, and usually packs Toxic or a super effective Ice Beam, however he is 3HKOed by Hidden Power Ghost or Hidden Power Bug without Swords Dance. Zapdos and Raikou, as well as other Special Attackers that outspeed Sandslash, can come in on a non-attacking move or after Sandslash killed something to finish it off.</p> <p>In UU, a Gligar with Counter or Toxic can mess up Sandslash somewhat, and Quagsire, Blastoise and Walrein can hold the boat to the same extent Suicune, Milotic and Swampert can in standard. Solrock can Reflect up and Lunatone can use Ice Beam, but they should beware of Hidden Power Ghost or Hidden Power Bug. Any STAB Water, Grass or Ice attack will (nearly) kill Sandslash. Meganium makes a great counter with Giga Drain, Razor Leaf or Hidden Power Grass, perhaps in company of Reflect and / or Leech Seed, but once again watch out for Hidden Power Bug. Make sure to use Synthesis to keep it alive.</p>",
    "sets": {
      "Swords Dance": {"description": "<p>This set is recommended for both standard and UU play. Sandslash is easy to bring in on physical attacks, preferably a Rock Slide so it can spare some health. Hit your counters on the switch: Earthquake for Waters like Milotic, Swampert, Suicune in standard or Quagsire and Blastoise in UU, and Hidden Power Bug for Celebi in standard and Solrock in UU. Take note of how much damage you do. When they take two more hits to finish off, Swords Dance on the switch, then take them out.</p>"},
      "Choice Band": {"description": "<p>Return helps to 2HKO most Gligar, but that's the only Pokemon it's hitting, so Rapid Spin is an option if you really want to get rid of Spikes. Don't use this set in OU, however, because Donphan outclasses it there.</p>"},
      "Counter": {
        "description": "<p>This set is designed to specifically counter some of the biggest threats in the UU metagame, while still being able to get most of the 2HKOs and OHKOs that it needs to. Counter is a great addition to the sweeper set, as it allows Sandslash to destroy many of the Grass-type Pokemon which normally stop it, since their strongest move is Hidden Power Grass, which can be Countered. The basic strategy is to bring Sandslash in on a weak physical attack such as Rock Slide, or any Electric attack. Swords Dance on the switch and then start sweeping. This set allows you to take out Blastoise, Walrein, and Meganium - all common switch-ins to Sandslash -and continue sweeping what you can. Greedy Gligars also get taken out it they try to KO with only +2 or +4 Atk (depending on EVs and nature of the Gligar).</p> <p>Another bonus is that with the 252 HP EVs, and 36 SpD EVs you always survive various STAB Surfs and Ice Beams, while being faster and being able to 2HKO. For example, you can Swords Dance on your opponent's switch to Walrein or Blastoise, and then hit it for a 2HKO with Rock Slide (only on Walrein) or Earthquake, and live through the Surf / Ice Beam to hit them for the KO. Additionally, Sandslash will always survive a Timid Manectric's Hidden Power even after a Petaya boost, as well as almost always surviving a Timid Electabuzz's Ice Punch after a Petaya boost.</p> <p>Rock Slide is the preferred move in the 4th slot, because it has the flinch rate, and Sandslash is able to outspeed most walls. It also allows Sandslash to take out fliers and Levitators that would not take themselves out with Counter, such as Misdreavus and Xatu, but more importantly, Altaria (which is outsped by this variant of Sandslash, allowing you to Rock Slide and possibly flinch before you get hit with Haze or Perish Song). Furthermore, it helps with Scyther and Yanma, not allowing them to set up while you try to Counter. Hidden Power Bug hits Grass types that do not attack with Hidden Power Grass, such as Bellosom and Tangela, and can hit Meganium hard if it uses Light Screen or Leech Seed. Hidden Power Bug also hits Solrock / Lunatone for super effective damage. Hidden Power Ghost, on the other hand, hits not only the previously mentioned Lunatone / Solrock for super effective damage, but also Misdreavus and Xatu as well. Counter takes care of Fearow, so it is not a big trouble if it walls those two attacks. It should be noted, however, that Rock Slide does have lower accuracy than Hidden Power</p>"
      }
    }
  },
  "Ninetales": {
    "overview": "<p>As you can imagine Ninetales is fragile but useful. Your team members will sure appreciate the support of sleep, burn, and Grudge.</p>",
    "comments": "<h3>Other Options</h3> <p>You can use Flamethrower over Fire Blast, but Fire Blast is recommended because its Special Attack is quite low. Confuse Ray makes you hard to hit, but can work against you when you Grudge and they hit themselves in confusion. Hypnosis is a gamble, but a very rewarding one. You can use it with Will-O-Wisp if you wish: put one Pokemon to sleep, and then burn another. Toxic is another alternative status ailment; burn is better on physical attackers though. Hidden Power Ice takes a chunk of life out of Altaria.</p> <h3>EVs</h3> <p>At least 148 EVs in Speed and Timid nature for 300 Speed, but max is nice. Spread the rest over HP, Special Attack and Special Defense.</p> <h3>Checks and Counters</h3> <p>Camerupt is a good Ninetales counter. Wailord can switch in on Will-O-Wisp due to its trait, Water Veil, making it unable to be burned. Blastoise won't care about being hit by Will-O-Wisp and will dispatch Ninetales away quite easily with Surf, unless it gets Grudged. Generally all Fire-types will wall Ninetales though, so if you happen to have one, have fun!</p>",
    "sets": {"Grudge": {"description": "<p>When used with some prediction, Ninetales can screw around with his opponents badly. You have 100 Special Defense, so your opponent will most likely bring in a physical attacker to mess with you--only to get burned by Will-O-Wisp. When the end is near and you want to sacrifice Ninetales, it's time for his big contribution to the team: Grudge. If you use it on the turn your opponent kills you, all PP of that attacking move is stripped off. This can help you to set up another Pokemon.</p>"}}
  },
  "Persian": {
    "overview": "<p>A novelty Pokemon in both standard and UU. It is outclassed by many other Normals despite the great Speed, because its Attack is really below average and it cannot take a hit at all. It is highly unlikely Persian is going to pull off anything game breaking against someone who knows what he's doing. The fastest Hypnosis in the game is nice to shut down at least one counter though.</p>",
    "comments": "<h3>Other Options</h3> <p>Screech forces your opponent to either switch out, or stay in and eat double damage, but should only be used with Spikes. Hyper Beam can be used for some last-effort damage if Persian is going to die anyway, or to finish off something when it's not expecting Persian to do more damage. Thief is good to steal these Leftovers or Choice Band from your counter, you may want to put it on the Liechi set and use it when you're about to die. Toxic is a way of forcing permanent damage on things like Gligar and Solrock in UU, or Swampert in standard, but it doesn't help if your opponent has Aromatherapy, Rest, or Heal Bell. Thunder or Thunderbolt can be used in standard as they hurt Skarmory.</p> <h3>EVs</h3> <p>If Persian has 341 Speed (this requires 176 EVs and a Jolly nature), it is faster than all Pokemon in UU except Electrode, as well as Persian and Sneasel with more Speed EVs, so this is a good point to aim at. Then, max Persian's Attack and dump any leftover EVs into HP or a defense.</p> <h3>Checks and Counters</h3> <p>Anything that resists Normal. For standard, this includes Skarmory and Forretress, who can Spike up against Persian, as well as Metagross, Rhydon and Tyranitar. Metagross can OHKO with Meteor Mash, Rhydon with Earthquake, and Tyranitar with Focus Punch, but Tyranitar can also opt to 2HKO with Rock Slide (or, if it's Choice Banded, OHKO). Hidden Power helps against Tyranitar to an extent, but Metagross isn't even 2HKOed by Choice Band Hidden Power Ground. Regirock, Scizor and Registeel can take Persian's hits as well and set-up against it. Weezing doesn't resist Normal but nonetheless takes anything that's not a Choice Band Double-Edge easily, it can Will-O-Wisp Persian and Sludge Bomb it to death. Besides all this, lots and lots of things with some kind of Defense and attacking potential can take a hit and beat Persian one-on-one. Swampert, Suicune and Milotic can beat Persian, though Choice Band STAB attacks will bite.</p> <p>In UU, Golem takes anything like a champ and cripples Persian with Earthquake. Solrock doesn't like Shadow Ball or Iron Tail much but it can help it with Reflect and start pounding on Persian with STAB Rock Slide as well. Gligar has to avoid STAB Choice Band Normal hits but takes anything else just fine. Mawile's Normal resistance combined with Intimidate makes it quite a good counter, but beware Hidden Power Fighting or Ground. The same goes to Aggron: it takes no damage from anything but these Hidden Powers.</p> <p>And in the end, Persian still cannot take a hit, so when in doubt just hit Persian with your most powerful move and it will die in two hits maximum. Be wary of getting your counter Hypnotized.</p>",
    "sets": {
      "Choice Band": {"description": "<p>A viable set for Persian in both standard and UU. It's hard to bring it in, but when you manage to do so, try to deal the damage by predicting your opponent and using the right move at the right time. For standard, Shadow Ball hits Gengar and Dusclops, and your Hidden Power should deal with Tyranitar. Hidden Power Fighting is an OHKO, but without Hidden Power Ground you won't be hurting Metagross. Fake Out is for Ninjask, Alakazam, and things like Reversal Heracross and Medicham, though it won't work if they Endure the Fake Out. Iron Tail can be used if you're unsure if your opponent is going to switch to, for example Tyranitar or Gengar. It hits both quite hard, though it's a tad inaccurate.</p> <p>Use max Speed with Adamant to beat Jolly Fearow. Raise Speed EVs to 180 at the cost of HP if you have Hidden Power Fighting.</p>"},
      "Liechi Berry": {"description": "<p>Use Substitute to get low on health and activate Liechi Berry, and then Hypnotize your opponent. Predict what he will switch to, and if you're faster, you can hit it twice before it gets to hit you. A risky set as it relies on Hypnosis hitting, but Persian isn't likely to do anything at all if you play it safe. On the bright side, not much is faster than a max Speed Persian, especially not in UU.</p>"}
    }
  },
  "Golduck": {
    "overview": "<p>Golduck stands out in ADV UU as a fast offensive Water-type that has access to Calm Mind. Its strong STAB Hydro Pump rips through even specially bulky foes like Kangaskhan and Ampharos. Golduck is also gifted with a unique ability in Cloud Nine, making it able to put a stop to weather-based hyper offense teams. Cloud Nine disables the Speed boost from Swift Swim and Chlorophyll, allowing Golduck to revenge kill Rain Dance Omastar and Gorebyss and Sunny Day Vileplume, as well as ignoring Sunny Day Arcanine attempting to weaken Hydro Pump by setting up sun. Golduck is a more aggressive alternative to another offensive Water-type in Slowking because of its good Speed, Cloud Nine, and no Rest turns to exploit, making it a better pick on hyper offensive teams that need a backup weather answer.</p> <p>However, Golduck faces competition from the plethora of other offensive Water-types in the tier, such as Rain Dance Omastar, Swords Dance Tentacruel, Gorebyss, and Feraligatr. It lacks the defensive profile that enables Pokemon like Slowking to play the long game, which leaves it easily worn down by stray attacks and status as it tries to set up, and Golduck only makes up for it with its moderately fast base Speed stat. Additionally, Golduck's ability to revenge kill weather sweepers is replicated by Pokemon like Electrode and Ninjask, which can also revenge kill other fast Pokemon like Scyther and Tentacruel.</p>",
    "comments": "<h3>Other Options</h3> <p>Ice Beam can be used over Psychic to maintain a strong hit on Vileplume while having coverage for Cradily and Altaria, but Golduck would lack coverage for Tentacruel unless it uses Hidden Power Electric, which can't OHKO Omastar. Hypnosis lets Golduck shut down slower Pokemon that threaten it like Ampharos and Lanturn, giving it reliable setup turns. However, dropping any coverage Golduck has severely limits its ability to threaten its checks, and it can be risky to rely on Hypnosis's meager 60% accuracy. Lum Berry prevents Golduck from being worn down by status, letting it attack or set up against an incoming Toxic or paralysis move. Mystic Water allows Golduck to have the damage of a Modest nature on its STAB moves while maintaining the speed tie with Jolly Gligar that Timid provides. However, it's worth noting that while Golduck is not as reliant on the passive recovery of Leftovers as an offensive sweeper, any amount of passive damage, from Spikes to Toxic, permanently sticking makes Golduck much more fragile.</p> <h3>Checks and Counters</h3> <p><strong>Electric-types</strong>: Golduck is threatened by every common Electric-type in the tier. Ampharos has good special bulk and a Thunderbolt that can OHKO an unboosted Golduck, Lanturn has ample opportunity to gain entry with its Water resistance, and all other Electric-types, such as Electrode, Electabuzz, and Manectric, outspeed Golduck. However, Ampharos can't switch in too many times throughout a battle and has to stay out of range of a boosted Hydro Pump, while the faster Electric-types can't switch in well at all.</p> <p><strong>Cradily</strong>: Cradily is a bulky special wall that can put Golduck on a timer with Toxic, and it can also use Recover to take advantage of Hydro Pump's low PP as well as rack up Toxic damage. However, Golduck can take advantage of Cradily's general passivity to boost, and it doesn't take much damage from Cradily's attacks.</p> <p><strong>Paralysis</strong>: Because Golduck is reliant on its Speed to make successful sweeps, paralysis from Kangaskhan's Body Slam, Vileplume's Stun Spore, or Misdreavus's Thunder Wave stops Golduck dead in its tracks and allows more Pokemon to take advantage of its low bulk.</p> <p><strong>Phazers</strong>: Pokemon with phazing moves like Walrein, Altaria, and Blastoise stand in the way of Golduck's sweep with their good bulk and force it to start again from square one. However, most of these Pokemon don't like taking initial damage from Hidden Power Grass, and they can't threaten Golduck back aside from phazing it.</p>",
    "sets": {
      "Calm Mind": {
        "description": "<h4>Set Description</h4> <p>Golduck can find opportunities to set up Calm Mind on Pokemon such as Omastar, Gligar, or Kangaskhan after it uses Rest. The threat of Calm Mind can prevent Kangaskhan from using Rest to stall Golduck, as +1 Hydro Pump 2HKOes specially defensive variants. It can also set up by forcing out a Rock- or Ground-type such as Solrock or Gligar, on which Golduck can enter with a double switch, after they KO Golduck's teammate, or after a teammate has used Explosion. Psychic is used to hit Poison-types that resist Water like Tentacruel, Vileplume, and Qwilfish. Hidden Power Grass is used for other Water-types, notably OHKOing Omastar and 2HKOing Gorebyss, which Golduck can revenge kill by ignoring Swift Swim. While Hydro Pump is Golduck's preferred STAB option, Golduck can also feasibly run Surf over Hidden Power Grass to have guaranteed accuracy against super effective targets while also preserving Hydro Pump's minimal 8 PP.</p> <p>A Timid nature allows Golduck to, at worst, speed tie with other base 85 Speed Pokemon like Gligar, Qwilfish, and Nidoking. A Modest Golduck hits harder with its coverage, allowing for reliable 2HKOs on Vileplume and Tentacruel and a 3HKO on Lanturn without boosts while still outspeeding Omastar, Gorebyss, and Vileplume.</p> <h4>Team Options</h4> <p>Golduck fits well on hyper offensive teams as a Water-type setup sweeper that helps its frail teammates avoid being bowled over by weather sweepers. Golduck appreciates Spikes support from offensive spikers such as Qwilfish and Glalie, which lay as many layers of Spikes down as possible before they use Explosion to bring in an offensive teammate. Yawn Kangaskhan can create entry points for Golduck by threatening the opponent with sleep, which can force out or disable Electric-types and bulky Water-types that would give Golduck trouble when it sets up. Due to Golduck's difficult matchups against Electric-types, it appreciates Ground-types that reliably check them and keep up offensive pressure like Nidoqueen, Nidoking, and Sandslash; Nidoqueen and Nidoking are fast wallbreakers with great coverage, whereas Sandslash is a Swords Dance sweeper with great physical bulk. In return, Golduck can adequately handle any Water-types that give these Pokemon trouble. If Golduck ever faints before it can complete a sweep, it appreciates a cleaner that can take advantage of the damage Golduck has done and revenge kill foes, such as Scyther, Arcanine, Haunter, or a fast Electric-type like Electrode.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "EllingtonReborn", "user_id": 619555}], "teams": [{"name": "Quality checked by", "members": [{"username": "Bouff", "user_id": 121672}, {"username": "BigFatMantis", "user_id": 507497}]}, {"name": "Grammar checked by", "members": [{"username": "StupidFlandrs48", "user_id": 633500}, {"username": "Tbolt", "user_id": 555379}]}]}
  },
  "Primeape": {
    "overview": "<p>Primeape can go on a rampage when given some breathing room. Its high Speed and power are nothing to scoff at. Its defenses, however, are really sub-par and will force Primeape to switch out or die more often than not. It relies heavily on sleep inflicting moves like Sleep Powder to come in, which is risky business. In both standard and UU, it can put a great hurting into teams, provided you know how to predict and eliminate its many counters.</p>",
    "comments": "<h3>Other Options</h3> <p>Primeape can Overheat Skarmory, but its STAB Cross Chop and Focus Punch will be much more useful in other situations, and it's more of a one-time deal anyway as it sharply cuts your Special Attack. It won't even OHKO Skarmory (though Forretress and Scizor will be fried). Thunder or Thunderbolt work against Skarmory as well, and nothing else. Ice Punch, as idiotic as it seems, is good in UU because it hits Gligar and will usually 2HKO it. Thief can be used to steal Leftovers or Choice Band from something that walls you, comes handy in both standard and UU. Screech can force switches or cause massive damage from Cross Chop. With Taunt, you stop status from hitting you, but it's more likely that Primeape will be hit up straight on his weak defenses. This is why you may want to use Counter, with or without Taunt. Taunt / Counter Primeape can surprise the hell out of Gligar, Vileplume, Skarmory, Gyarados and some other things if they come into you.</p> <h3>EVs</h3> <p>For every usual non-Reversal set, minimally 300 in standard to beat Adamant Salamence and everything else with 100 base Speed and no boosting nature. In UU, 296 is a nice number as well to beat Jolly Gligar (rare, but nice anyway), but 308 is preferable for Adamant Fearow and Jolly Kangaskhan. Use 264 Speed minimally for standard Reversal sets, and make sure your HP is not divisible by four when using Substitute with it. For the rest, Primeape should stack its Attack as much as possible.</p> <h3>Checks and Counters</h3> <p>One great counter is Gligar, as it takes neutral damage or not very effective from all Primeape's attacks not named Ice Punch, and has decent Defense. Not a lot can switch in on Primeape in UU matches; utilizing two Pokemon to deal with Primeape is another method you could try. The Choice Band set will lose to a combination of Misdreavus and Muk or Vileplume. In all honesty the best way to beat Primeape is to attack it before it attacks you.</p>",
    "sets": {
      "Choice Band": {"description": "<p>Earthquake should take care of Muk and do some more damage to Electric and Fire-types, as well as helping against Grass / Poisons like Vileplume. Vileplume can also be taken care of with Hidden Power Flying and can be quite important for Primeape to beat, as Vileplume provides a switch-in for Primeape every time it tries to use Sleep Powder, and often tries to wall Primeape as it resists Cross Chop. The IVs given are for Hidden Power Flying. Outside of that, there is little reason to use Hidden Power Flying, unless you really want to hurt Heracross and Breloom badly in standard. The rest of Primeape's move's uses in UU are quite easy to tell: Hidden Power Ghost is for Hypno, Grumpig and Misdreavus and Rock Slide for random Fliers.</p>"},
      "Bulk Up": {"description": "<p>This works a bit like the standard Raikou: set-up your offense and defense at the same time, protect against status and gain time with Substitute, then hit hard with STAB and a secondary move. Earthquake should only be used in UU, all the others are fair game for both metagames. There will always be something that walls you, but this set requires less prediction and can really screw opponents over in late game, or if they rely on something like Toxic to stop Primeape.</p>"},
      "Reversal": {"description": "<p>The fastest STAB Reversal in the game. Coming from a respective 339 Attack, Primeape can be quite a monster with this set, provided there is no Sand Stream up and no Quick Attack (or a similar move) in the way. Even if there is a Quick Attacker, Primeape can always switch out and come back later (as long as there are no Spikes) and launch its Reversal. It's unlikely that something like Quick Attack Fearow or Fake Out Kangaskhan is going to switch into that. Use Bulk Up for an easier set-up, or Focus Punch to do some good damage on something like Skarmory before it Drill Pecks you to death. Endure can be a safer route in some situations, and usually works better with Endure.</p>"}
    }
  },
  "Arcanine": {"sets": {"Wallbreaker": {}, "Sunny Day": {}, "Mixed Attacker": {}}},
  "Tentacruel": {
    "overview": "<p>Tentacruel is truly a Pokemon to be feared in UU, and can compete in standard as well. Its offensive power with Swords Dance-boosted Sludge Bombs combined with Hydro Pump tends to be just too much for teams in both tiers. However, Tentacruel can only really switch into fellow Water-types and perhaps Skarmory, because he has low Defense, and is weak to Thunderbolt and Earthquake, two of the most common attacks in the game. Psychic weakness doesn't help either. His immunity to Toxic and resistance to Water and Ice helps a lot though, it makes him a great counter to Milotic and Suicune in standard, as well as Blastoise and Walrein in UU.</p>",
    "comments": "<h3>Other Options</h3> <p>A physical Hidden Power (most likely Ground, but Fighting works too) is Tentacruel's only real option for attacking, aside from Sludge Bomb, to take advantage of Swords Dance.</p> <h3>EVs</h3> <p>Usually Tentacruel should have 310 Speed in UU, unless it is a more defensive set, is an important point to hit, as the only used Pokemon that will be faster than you are the occasional Jolly Fearow, and Timid Manectric / Electabuzz. Hasty is the best nature for mixed sets, as Tentacruel's massive Special Defense is one of its major selling points, but if you're not using your Attack or Special Attack at all, Timid or Jolly should be used respectively. Stack the attacking stat(s) you're using on sweeping Tentacruel, otherwise you'll want to max out HP and put some in Special Defense.</p> <h3>Checks and Counters</h3> <p>Standard: Swampert is the best all-around counter for Tentacruel, as long as Tentacruel isn't packing the rare Giga Drain. It can soak up Sludge Bombs thanks to its resistance, and use its STAB Earthquake to dish out damage. Steels like Skarmory and Metagross get in the way when Tentacruel wants to sweep with Swords Dance, because Skarmory will Roar / Whirlwind away the boosts while Metagross will Earthquake. A few Surfs or Hydro Pumps should do them in though. Gengar is 4x resistant to Sludge Bomb and can Thunderbolt Tentacruel, but again, beware of Surf or Hydro Pump. Zapdos, Jolteon and Raikou may take quite some damage from a Swords Danced Sludge Bomb, but they're quite fast (Zapdos ties with Tentacruel, the other two are faster) and pack STAB Thunderbolts. Beware of Mirror Coat, however. Salamence and Gyarados can Earthquake Tentacruel and resist his Water moves, but their Intimidate won't work on Clear Body versions and Salamence has to watch out for Ice Beam.</p> <p>UU: Quagsire is an even better counter than Swampert because of Water Absorb, for the rest he works in the same way. Whiscash plays a mini-Swampert as well, but to a lesser extent. Hypno with some Defense EVs and Reflect can pose trouble, paralyzing Tentacruel with Thunder Wave or hitting hard with STAB Psychic. A Swords Danced Sludge Bomb will bang him up sooner or later though. Kangaskhan can take a beating and try for a paralysis with Body Slam or hit hard with Earthquake. Walrein can Earthquake, or Encore Substitute or Swords Dance, but again these Swords Danced Sludge Bombs hurt. For the rest, Tentacruel is pretty hard to beat in UU. Your best bet is hitting it hard when you can, preferably with Earthquake. If your team is full of physical offense, Psychic, and Thunderbolt, you can just make it impossible for Tentacruel to ever switch in.</p>",
    "sets": {
      "Druidcruel": {
        "description": "<p>Simple idea that works pretty well. Switch into something that will switch out once it sees Tentacruel and use Substitute. Wear down Steels, Rocks, and Grounds with Hydro Pump or Surf, and, later on, Swords Dance up and Sludge Bomb away. Works very well in standard, but really shines in UU, because about everything that resists Sludge Bomb is weak to your Water move. The main physical walls are Walrein (who cannot touch Tentacruel with the standard set of Rest, Sleep Talk, Toxic, Ice Beam), Gligar (who is OHKOed by a Water move), and Solrock (who is also OHKOed). In OU, you have stuff like Suicune with Roar, Weezing, Swampert, and the like around to ruin your fun.</p> <p>Surf has the obvious accuracy advantage over Hydro Pump (and the slightly less obvious PP advantage, but that's not that big of a deal, as the Water move's function is solely to hit a very limited number of Pokemon), but Hydro Pump's power can come in handy. With these EVs, Surf will never OHKO max HP Aggron, but Hydro Pump always will. Hydro Pump will easily OHKO Gligar, even if it has max HP, while Surf will always OHKO min HP Gligar, but bulkier versions will survive. Hydro Pump also just barely ekes out an OHKO on max HP Solrock.</p>"
      },
      "Special Sweeper": {
        "description": "<p>Special Sweeping Tentacruel. Substitute is to bluff the first set, and allows you to get in a free hit on whatever switches in without risk. Absolutely owns some common counters to the standard Tentacruel (Swampert and Quagsire, Salamence etc.). Hidden Power Electric can be used as a fourth slot also to take care of Gyarados who can mess this set up pretty well otherwise. Mantine in UU cannot do much to Tentacruel, so usually you'll just want to keep Substitute. Try not to reveal that you are using a special Tentacruel until the surprise will get you a KO (Substitute and Surf / Hydro Pump should be the only moves you use at first).</p> <p>With Timid you can expect Tentacruel to outspeed everything of 105 base Speed and under as long as they don't have a Speed boosting nature (so Adamant Salamence and Modest Zapdos in OU, and Modest Manectric / Electabuzz in UU), and anything base 90 Speed or lower even if they have a +Speed nature (including Kangaskhan and Gligar), but with Modest you will have more attacking power. Just max out Speed if you go Modest, or, alternately, go as low as 280 Speed to beat Adamant Kangaskhan.</p>"
      },
      "Mirror Coat": {
        "description": "<p>The idea is to set up a Barrier or two, forcing them to attack you from Tentacruel's Special side. Usually this will draw out Electrics like Zapdos, and allow Tentacruel to Mirror Coat that STAB Thunderbolt right in their face. Tentacruel's Special Defense is pretty good, so just by maxing HP, you will survive even a max Special Attack Zapdos Thunderbolt as long as you're on full health. Giga Drain can be used to keep Quagsire and Swampert off your ass, but Toxic will stop them from stalling against you and either switch out or attack you straight up. Hydro Pump is there for some general STAB damage.</p> <p>While it looks nice on paper, it usually won't work that well. You'll find a lot of people trying to set up something like Substitute or Calm Mind from the likes of Raikou, Gengar and Alakazam on Tentacruel, which he cannot really do anything against. Sometimes they will just weaken with Tentacruel with something else, and then kill you with their Thunderbolt. Or they could repeatedly Earthquake you until it goes critical, which pierces Barrier's defense boost. Still, it can be very neat, and this set actually makes a decent Suicune counter, as even if it Calm Minds to the max, it won't OHKO with Surf and risk a Mirror Coat to the face, not to mention Toxic will keep forcing it to Rest.</p> <p>For UU, this might work against Lunatone or Manectric, but again beware of Substitute and Calm Mind.</p>"
      },
      "Utility": {"description": "<p>As mentioned in the previous set, Tentacruel can take special hits quite well, and this support set takes advantage of it. Come in on Waters (especially Cloyster) to Rapid Spin those Spikes away or to Toxic foes. Haze helps against Suicune's Calm Mind, or when Curse Snorlax is taking a nap. Note that Haze is illegal with Rapid Spin. Surf or Hydro Pump is there to hit Gengar who may try to block Rapid Spin and Toxic, but it won't do much against Dusclops or Misdreavus. Fillers like Mirror Coat and Sludge Bomb can be put in the last slot. The main problem with this Tentacruel set is that it's weak to many common attacks, and that Blastoise fills its role pretty much better in UU.</p>"}
    }
  },
  "Rapidash": {
    "overview": "<p>Rapidash suffers from being a Fire-type, having to compete with a lot of other Pokemon that all have the same syndrome: high Attack but no physical STAB, and no offensive movepool to speak of. Rapidash's redeeming factors are Baton Pass and Hypnosis mostly, so try to use these when using Rapidash. You really should only use Rapidash in UU.</p>",
    "comments": "<h3>Other Options</h3> <p>Quick Attack is present just to counter Pokemon with Reversal and the like. It can use Double Kick on a physical attacking set to open up room so you don't have to use Hidden Power Fighting, and this works against Substitute Tyranitar in standard to an extent.</p> <h3>EVs</h3> <p>Rapidash needs 307 Speed minimum to be faster than Jolly Kangaskhan, and a load of other UU threats like Gligar. This requires 244 Speed EVs without a nature, and, if you're going that high, you might as well max it out to go for the tie against other Rapidash, Modest Electabuzz, and Modest Manectric. Alternately, you can use a +Speed nature and bring yourself to 310 Speed, which still beats all Kangaskhan, but also outpaces the aforementioned Modest Electabuzz / Manectric, which requires 144 EVs and a +Speed nature. Most sets will then max one of the attacking stats, and then pump the rest of the EVs into the other attacking stat if you're using a mixed Rapidash, or HP if you are not. The Baton Passer should have more HP EVs than that, however.</p> <h3>Checks and Counters</h3> <p>Suicune and any other Water-type shuts it out. Dugtrio can actually survive anything Rapidash throws at it except Fire Blast, and then trap it and kill with Earthquake. Aerodactyl has the advantage of resisting Fire, is faster, and has two moves that can OHKO (Earthquake and Rock Slide). Salamence easily beats Rapidash without Hidden Power Ice, same for Dragonite. All these counters should be careful for Hypnosis, if it hits of course. In Underused matches other Fire-type Pokemon generally stop it dead, if you don't have Hidden Power Ice then Altaria counters Rapidash quite easily being resistant to Fire Blast and Solar Beam and Natural Cure takes care of Hypnosis. Walrein can stall it out with Toxic, thanks to Thick Fat, or just attack it outright with Surf, same goes for Blastoise. Quagsire beats Rapidash without Hidden Power Grass. Hypno can stall out anything but a Toxic variant. Cradily stops all but the Sunny Day set, and even that one can easily get PP stalled, because the chance to get a Critical Hit is small with only 8 Fire Blast PP, and Flamethrower won't do enough.</p>",
    "sets": {
      "Baton Pass": {"description": "<p>Hypnosis is an option on this set if your opponent doesn't have a Pokemon that Rapidash can scare off (like Skarmory), giving you a free turn to set up a Substitute / Agility. Fire Blast will keep Skarmory and Weezing from erasing your boosts, so you can Substitute as they go to, say, Blissey, and then Baton Pass that Substitute to Gengar and Focus Punch it. Obviously, this set works in UU as well.</p> <p>You may not need as many Speed EVs if you are using Agility, but it might come handy to get in that crucial Hypnosis or Hidden Power. The IVs given are for Hidden Power Ice, which should generally only be used in OU, as Hidden Power Grass is more important to hit Waters like Blastoise, Walrein, and Quagsire there.</p>"},
      "SunnyBeam": {"description": "<p>It doesn't have the best Special Attack stat, but can catch your opponent by surprise. Hypnosis is still effective vs. Pokemon with Natural Cure like Blissey. Sunny Day as they come in, Hypnosis. If they stay in, they have to eat boosted Fire Blasts, and if they switch out, they're switching to something that isn't their main special wall, so if they try and come back in, you can just use Hypnosis again on them. Hidden Power Ice hits Salamence in OU, but the main Pokemon for which it's used in UU, is Gligar, who is OHKOed by Fire Blast, and almost always OHKOed by Flamethrower anyway, so Hypnosis is probably better. Sunny Day keeps Rapidash safe from Surf as it attacks.</p> <p>Once again, the IVs are only if you choose Hidden Power Ice.</p>"},
      "Mixed Attacker": {"description": "<p>Hypnosis is to put whatever Pokemon that is giving the team trouble to Sleep. Then, just use whatever attacks it needs to take it down. You'll have to deal with the limited movepool Rapidash provides for you. Overheat any Steel-types that come your way. Iron Tail any Rocks like Solrock. Pick whichever Hidden Power your team needs. Hidden Power Rock and Fighting are useful to take on Walrein just a little better.</p>"}
    }
  },
  "Muk": {
    "overview": "<p>In UU, Muk is very hard to beat if you don't know the set. I recommend Muk for any UU team. It also has a very high cool factor.</p>",
    "comments": "<h3>EVs</h3> <p>When you are running no special attacks, at least 401 HP on Muk, 404 if you are using Substitute. Adamant for the SubPuncher, Careful for the Curser, with EVs focused on the stats you are boosting (Attack and Special Defense respectively).</p> <p>For mixed movesets, use a speed-cutting nature: Brave for more Attack, Sassy for more Special Defense.</p> <p>As you see, Muk is quite hard to spread EVs for, so if you're having a lot of trouble you can just use max HP and Attack and you'll be just fine.</p> <h3>Other Options</h3> <p>Body Slam can paralyze the opponent, and paralysis is always good. Imprison is very unorthodox and works in very rare circumstances, stay away from it until you've tried out the standard Muk. Memento can make your opponent's Pokemon harmless, so you can set up a Belly Drummer next turn. Explosion is more recommended for suicide, though. Rest, with or without Sleep Talk, makes your Muk live longer. It's really an easy switch for counters though.</p> <h3>Checks and Counters</h3> <p>Muk is hard to counter. Its first set isn't shut down by anything completely, except Misdreavus and Shedinja if you run Hidden Power Grass, or Quagsire / Whiscash if you have Hidden Power Ghost. Nidoking and Nidoqueen can take one or two Ice Punches and Earthquake Muk to death.</p>",
    "sets": {
      "Standard": {"description": "<p>Use this set for Muk in UU, where it's right at home. Switch in on a Grasser or a Fighter (hopefully without Earthquake), and hit away. Ice Punch shuts down any unsuspecting Gligar, Hidden Power Ghost is for Misdreavus and Shedinja, and Hidden Power Grass stops Quagsire. There's no need for Special Attack EVs as you need more EVs in Special Attack than it's worth to OHKO either Gligar or Quagsire. Both Hidden Powers should do the job should Solrock come in to counter you.</p>"},
      "SubPunch": {"description": "<p>Slow and over 404 HP, so Muk is automatically a great Subpuncher. With a great Attack, this is something to watch out for. In UU, the only Steel that is used sometimes is Mawile, which Focus Punch is more than enough for, so Fire Blast isn't needed.</p>"},
      "Curse": {"description": "<p>Great Special Defense and Attack like Snorlax, Muk makes a pretty good Curser. Cursed Explosion is powerful, but with Rest you can keep on tanking. It will probably be run over by Psychic and Earthquake.</p>"},
      "Choice Band": {"description": "<p>More novelty than anything. Bring it in like you normally would, and predict what your opponent is going to do. Use the right attack, and hopefully you will hit them hard.</p>"}
    }
  },
  "Hypno": {
    "overview": "<p>A good UU Pokemon would be an understatement. It is top tier UU for a reason: it walls special hits over and over, takes physical hits moderately well, and supports your team with pseudo-passing moves such as Reflect, Light Screen, and Wish. It can switch into so many things in the UU metagame.</p>",
    "comments": "<h3>Other Options</h3> <p>Hypnosis could work to put Pokemon to sleep. Hypno definitely has the defenses to survive a miss or two, unlike many other Pokemon that learn Hypnosis. Light Screen helps because it protects the rest of your teams against Special hits without having to switch in Hypno. Fire Punch might work in very rare cases, but it'd be more fit if you battle against standard Pokemon such as Steelix and Metagross.</p> <h3>EVs</h3> <p>On both movesets, you will pretty much want to pump HP and Defenses. Try and get your Speed somewhere above 176 to beat Solrock and Lunatone. Put some EVs in Special Attack if you have Psychic.</p> <h3>Checks and Counters</h3> <p>Even with Reflect, Gligar and Ground Pokemon in general will switch into Hypno's Thunder Waves easily and get a free hit on whatever switches in. Banette is a bit risky because you don't want it to take a Thunder Wave, but it deals a ton of damage with its STAB Shadow Ball. Hidden Power Dark Grumpig says 'sup to Hypno as well by Substituting on the Thunder Wave and Calm Minding while Hypno is saddened.</p>",
    "sets": {
      "Support": {
        "description": "<p>This is just about the only Hypno set you will encounter. It's your standard support Hypno that you will see around UU almost all the time. It can be an annoyance if you don't have things to faint this before it Thunder Waves your whole team and sets up a Reflect. If you're using this, you will most likely switch in on something that has the potential to use a sleeping move or hit you with a special attack. While not being much of an offensive guy, it takes special hits like few others in UU. Psychic and Seismic Toss both work. It really depends though, do you want something that can hit Pokemon such as Gligar harder, or being able to stop Pokemon with Substitute from setting up as easily? It's up to you and your overall team. If you use Protect, use it with Toxic to further stall turns, but both Toxic and Thunder Wave can be used with Reflect. Use Counter with Toxic, as well, because it really ruins a perfect prediction to have them fully paralyzed when you Counter, thus destroying the surprise.</p>"
      },
      "Baton Pass": {"description": "<p>This is pretty much the only other moveset you will encounter. Like the other moveset, switch into sleep moves and special attacks, use Substitute and Calm Mind, and Baton Pass them to a target Pokemon. It could work if you passed it to a fast Pokemon such as Electabuzz.</p>"}
    }
  },
  "Kangaskhan": {
    "overview": "<p>Kangaskhan is one of the most used Pokemon in the UnderUsed environment. Bulky defenses, high HP, above-average Speed, high Attack with a fantastic movepool and Normal STAB makes Kangaskhan very dangerous. Kangaskhan can be difficult to stop; more than one resist is often necessary to handle it. When building your UU team, make sure that your team can handle Kangaskhan!</p>",
    "comments": "<h3>Other Options</h3> <p>Body Slam can be used as your Normal move for Paralysis. Roar can stop random stat uppers, especially the odd UU BP team (as Mr. Mime cannot stand up to STAB Returns to block your Roar), and Yawn works as a sort of pseudo-phazing move.</p> <h3>EVs</h3> <p>Near max HP and a lot of Attack in the first set, with the rest in Speed. On the Choice Band set, just max out Attack and Speed. On the Reversal set, max out Attack to ensure that Reversal can do a decent amount of damage. Speed will have to be 264 in OU, with an Adamant nature, but in UU, you can use much lower speeds, such as 251 to beat an Electrode without +Speed, or even less, depending on just how much you fear Electrode. The remainder of EVs should go into either Defense. Use no HP EVs so that you end up with 1% after 4 Substitutes, instead of 25% after 3, or Reversal will be much weaker. Of course, the extra EVs elsewhere will do virtually nothing, so you'll most likely just want to max your Speed to keep other Salac Pokemon from outspeeding you.</p> <h3>Checks and Counters</h3> <p>Often more than one Rock-type is needed to fully stop Kangaskhan. A bulky Omastar can handle it, Reflect Solrock can handle it. Golem, which is rather uncommon, can switch into it and scare off Kangaskhan, unless it is of course packing Earthquake or Focus Punch. Walrein and Blastoise can easily stall it with Rest and Toxic, unless it's holding a Choice Band. If it has a Choice Band, you'll need to use resists.</p>",
    "sets": {
      "Physical Attacker": {"description": "<p>This was one of the first sets for Kangaskhan in early FRLG play, before the Substitute + Focus Punch set became popular, and is starting to see a bit of use again. Return or Shadow Ball anything in sight until your HP is at around 50%. Then Rest the damage off and wait for one Sleep turn, thanks to Early Bird. Kangaskhan can also use Double-Edge effectively. Wish is also an option; with some defensive EVs, Kangaskhan can be bulky, which will allow it to be an effective Wish-passer. Watch out for status.</p>"},
      "Choice Band": {"description": "<p>Kangaskhan is no Slaking, but it can act as a Choice Bander quite well. Its Speed is rather high in UU to pull this off. Because Focus Punch hits very few things in UU, Fake Out can be used to stop Pokemon with Substitute and a Salac, or just for a little bit of extra damage against a Pokemon you normally couldn't take. However, Focus Punch can be useful to predict Walrein and Cradily, and guarantees an OHKO on Aggron, who can potentially survive your Earthquake only to Counter it back.</p>"},
      "Wish Staller": {"description": "<p>This set simply refuses to die, as very few things can do enough to Kangaskhan to overcome Wish and 2 turns of Leftovers for each hit, and those few Pokemon (for instance, Hitmonlee) often have very low Defense, letting your STAB Normal hit them hard. It's completely walled by Aggron, but Wish support lets Pokemon like Gligar switch into that all day. Counter can stop that nicely, but you risk being Thunder Waved or having Aggron just set up a Substitute. You could also stick Roar on there over Protect or Return if you have some Spikes down for even more stall. You may want to focus on more Special Defense if you have Counter to ensure that Counter KOs the opponent when they use a physical attack.</p>"},
      "SubPunch": {"description": "<p>105 base Hit Points and a decent Attack make this moveset very good on Kangaskhan. Make sure when you are using this set, to make sure you have 404 HP or more (at least 212 HP EVs) to make 101 HP Substitutes, as this means Seismic Toss will need two hits to break the Substitute.</p>"},
      "Reversal": {"description": "<p>Flail would have worked better, actually. If you think about it, Flail would save some room for Focus Punch. Too bad, though. The Reversaler set is in fact the unexpected set for Kangaskhan.</p>"}
    }
  },
  "Scyther": {
    "overview": "<p>Scyther is an excellent offensive Pokemon with one of the highest Speed stats in the tier and an exceptional base 110 Attack. It capitalizes on the progress made by its teammates, allowing it to function as a wallbreaker, revenge killer, cleaner, and sweeper. Scyther's sheer power with its STAB moves lets it 2HKO or 3HKO many relevant Pokemon, such as Kangaskhan, Tentacruel, Ampharos, Solrock, and Vileplume. Swarm punishes any Pokemon swinging at it, as its bulk lets it dodge an OHKO from most neutral attacks, like Kangaskhan's Double-Edge. Scyther works very well on offense and balance teams that uphold Spikes pressure and need a backbone of fast offense and priority, and this makes it one of the best late-game Pokemon.</p> <p>Scyther can, however, have a lack of longevity, as it has weaknesses to common attacking types in Electric, Ice, Fire, and Rock, and it hates being statused by paralysis and Toxic. Choice Band sets can end up being reliant on prediction, and they can allow more Pokemon to gain entry. It can be hard to find entry for Scyther due to its reliance on being kept healthy late-game and its common switch-ins forcing its team to play on the defensive, only coming in through Ground-type moves, double switches, or revenge kills.</p>",
    "comments": "<h3>Other Options</h3> <p>Hidden Power Fighting can be used on the Choice Band set over Hidden Power Ground to hit all of Cradily, Granbull, and Walrein on the switch in. Hidden Power Rock can be used to hit Flying-types like Altaria while maintaining coverage for Arcanine and Walrein as they switch in. Both Hidden Power choices lower Scyther's Speed IVs, which guarantees opposing base 105 Speed Pokemon can revenge kill it, so Hidden Power Ground, Bug, and Flying are preferable choices. On Reversal sets, Salac Berry can be substituted for Liechi Berry to make Reversal stronger, but this comes at the cost of risking the Speed tie against base 105 Speed foes and being too slow to avoid a revenge kill from Electrode and Ninjask.</p> <h3>Checks and Counters</h3> <p><strong>Rock-types</strong>: Omastar can comfortably switch into Scyther with its Normal and Flying resistances coupled with its sky-high Defense, and it can aptly pressure with Surf or lay down Spikes. Aggron and Golem pose similar problems and can OHKO Scyther with Rock STAB attacks. Although Aggron fears Hidden Power Ground, Omastar and Golem can tank it at least a few times. Other Rock-types like Cradily and Solrock can come in on moves they resist and threaten Scyther back, but they have trouble dealing with Hidden Power Bug.</p> <p><strong>Flying-types</strong>: Altaria and Gligar can both defensively check Scyther with their great bulk, Bug-type resistance, and Spikes immunity while also offensively checking Scyther with super effective coverage. Altaria is very bulky and uses Scyther as an opportunity to use Heal Bell, and it can use Roar on Swords Dance Scyther, forcing it to start the process all over again. Gligar can gain turns to set up its own Swords Dance boosts, hits back hard with Hidden Power Flying, and has priority to beat Salac Reversal sets. Both still need to take caution against Choice Band variants, as Hidden Power Flying and Double-Edge can 2HKO Gligar and non-physically defensive Altaria.</p> <p><strong>Electric-types</strong>: Ampharos is a mixed wall that zaps Scyther with a strong STAB Thunderbolt and can come in on Scyther's contact moves, potentially paralyzing it through Static. While other Electric-types lack Ampharos's bulk, they can Speed tie Scyther or outspeed in the case of Electrode.</p> <p><strong>Walrein</strong>: Walrein is a bulky wall that can threaten Scyther with its STAB Ice Beam, and it can phaze out any attempts of sweeping with Swords Dance through Encore or Roar.</p> <p><strong>Intimidate Users</strong>: Granbull and Arcanines Intimidate softens the blow of Scythers moves and forces Scyther's team to play on the defensive. Arcanine has a brutal STAB Fire Blast, resists Hidden Power Bug, and has priority to stuff any revenge kills at low health and stop Scyther from Reversal sweeping.</p> <p><strong>Revenge Killers</strong>: Faster Pokemon like Electrode and Ninjask can reliably revenge kill Scyther and can use their entry as an opportunity for their own offense.</p>",
    "sets": {
      "Choice Band": {
        "description": "<h4>Set Description</h4> <p>Choice Band Scyther is the most common set for its immediate power and ability to revenge kill fast Pokemon like Kangaskhan and Tentacruel. Scyther also has an incredible max Speed of 339, which is only outsped by Electrode and Ninjask, rivaling its Choice Band user competition like Fearow, Nidoking, and Hitmonlee.</p> <p>Hidden Power Bug is Scyther's main STAB attack for hitting neutral targets and is very powerful when Scyther is in Swarm range. It also provides coverage for Psychic-types, like Slowking and Solrock, and it can be used as a way to avoid contact abilities like Static. Double-Edge provides a very powerful neutral hit to most targets, including Flying-types like Gligar and Altaria, and its recoil can be helpful in pushing Scyther into Swarm range for a boosted Hidden Power Bug. Aerial Ace hits opposing Scyther, Vileplume, Ghost-types like Haunter and Misdreavus, and Fighting-types like Hitmontop. Quick Attack provides very useful priority against Reversal sweepers like opposing Scyther, serves as an additional check to chipped weather sweepers like Sunny Day Vileplume and Rain Dance Gorebyss, and helps check other priority from Arcanine. Silver Wind and Hidden Power Flying can be used as alternatives to Hidden Power Bug and Aerial Ace. This gives Scyther less contact moves, a stronger Flying STAB attack, and access to possible omniboosts with Silver Wind. Using both Silver Wind and Aerial Ace allows Scyther to use another Hidden Power over Double-Edge, such as Hidden Power Ground for Arcanine and Electric-, Rock-, and Steel-types that like to come in on Choice Band Scyther.</p> <h4>Team Options</h4> <p>Choice Band Scyther fits well onto Spikes offense with Omastar and Qwilfish. Spikes help Scyther break through bulky Pokemon more easily and wears down its checks as they switch in. Omastar is also a physical wall that can help to check Kangaskhan, Granbull, and opposing Scyther. Since Scyther is very status-prone, cleric Pokemon like Ampharos, Vileplume, and Altaria can heal off any stray Toxic or paralysis thrown at it. Scyther also appreciates a check to Arcanine, such as Tentacruel or Blastoise. Scyther is less effective at wallbreaking after Intimidate, and these teammates allow for safe switch-ins and can remove Spikes for Scyther's team. Lanturn can resist any BoltBeam coverage thrown Scyther's way from Electric-types, Walrein, offensive Omastar, and special attacking Ghost-types. Pokemon that block Rapid Spin, like Haunter and Misdreavus, help keep Spikes on the opposing side of the field and provide valuable offensive utility, such as Haunter's Thief, Will-O-Wisp, and Destiny Bond and Misdreavus's Thunder Wave.</p>"
      },
      "Salac Reversal": {
        "description": "<h4>Set Description</h4> <p>Salac Reversal Scyther is a dangerous late-game sweeper that is nearly impossible to stop without a priority move post-Speed boost. The choice of Hidden Power is mostly up to personal preference; Hidden Power Bug is boosted by Swarm and hits Psychic-types hard, while Hidden Power Flying has better coverage for Poison- and Ghost-types. Substitute is used to bring Scyther's HP down to 1% and capitalize on switches, allowing Scyther to use Swords Dance behind the Substitute. Scyther's HP cannot be divisible by 4 for Substitute sets to activate Salac Berry, so 4 EVs should be put into HP to make four Substitutes and for Reversal to be at maximum power. Endure allows Scyther to reliably get into Salac Berry range even if it took damage prior, lets it take hits from faster Pokemon, and gives it more freedom to set up Swords Dance at least once against most targets, since it is rarely OHKOed.</p> <h4>Team Options</h4> <p>Salac Reversal Scyther fits very well onto hyper offense teams, as it can outspeed and sweep every Pokemon without priority, and it can force damage onto bulkier targets. It can generally force the removal of at least one Pokemon for sweeper teammates to capitalize on. This Scyther set appreciates Spikes set early in the match for it to sweep more easily, benefitting from leads such as Qwilfish and Glalie that get as many layers of Spikes as possible then use Explosion to keep up momentum. Scyther also loves support that helps it enter freely, such as Yawn Kangaskhan, to force a switch or give Scyther a way to prey on the slept Pokemon. Explosion users, such as Electrode, Solrock, Haunter, and Muk, fit well as teammates, as they can remove key Pokemon for Scyther to make a full sweep or at least provide valuable chip if Explosion fails to KO, as well as giving free entry for Scyther. Since Arcanine and Gligar stand in the way of Reversal Scyther's sweep, it appreciates offensive teammates that force damage onto them early, such as Arcanine, offensive Kangaskhan, and Water-types like Gorebyss, Golduck, and Feraligatr. Ground-types like Nidoqueen, Nidoking, and Sandslash can check opposing Electric-types that threaten Scyther while making significant progress of their own.</p>"
      },
      "Swords Dance": {
        "description": "<h4>Set Description</h4> <p>Swords Dance Scyther is a fast setup sweeper that can clean up late-game with its STAB moves and Hidden Power Ground as well as break holes in the opposition for teammates to capitalize on and clean up.</p> <p>Scyther prefers dual STAB moves on Swords Dance sets, usually using Silver Wind and Aerial Ace. Silver Wind is its primary STAB move, giving it access to dangerous omniboosts, and it is further boosted when Scyther is in Swarm range. Aerial Ace allows for useful coverage against various Flying-, Fighting-, and Ghost-types like Gligar, Haunter, Misdreavus, and Hitmontop. These options free up a slot for Hidden Power Ground for hitting Poison-, Rock-, and Steel-types like Nidoqueen, Nidoking, Omastar, and Aggron. Alternatively, Quick Attack gives Scyther a priority move if it can forgo the coverage of Hidden Power Ground, allowing access to a Hidden Power with STAB.</p> <p>The item choice can be team-dependent but is mostly up to preference. Leftovers helps Scyther passively heal any damage it takes and have more longevity, while Lum Berry is used when Scyther doesn't have cleric support and lets it set up in the face of Toxic or paralysis that would otherwise shut down any chance Scyther has at sweeping.</p> <h4>Team Options</h4> <p>Spikes support from Omastar and Qwilfish helps Swords Dance Scyther muscle past bulky Pokemon like Kangaskhan, Ampharos, and Walrein. Thief support from Omastar, Tentacruel, Arcanine, Haunter, and Electabuzz further facilitates the sweep by removing Leftovers from defensive Pokemon that rely on passive recovery, meaning the damage they take from Scyther's boosted moves and Spikes will be permanent. Bulky Water-types like Tentacruel, Walrein, and Lanturn synergize well, as they can threaten Omastar, Arcanine, Altaria, and Walrein, which can otherwise stand in the way of Scyther's sweep, and they are good at making progress for Scyther to take advantage of. Fearow and Gligar make for good partners, as they are fast mid-game wallbreakers that can back up Scyther's general lack of priority and make for a brutal one-two punch of Flying offense.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "EllingtonReborn", "user_id": 619555}], "teams": [{"name": "Quality checked by", "members": [{"username": "BigFatMantis", "user_id": 507497}, {"username": "Bouff", "user_id": 121672}]}, {"name": "Grammar checked by", "members": [{"username": "Sabelette", "user_id": 583793}]}]}
  },
  "Electabuzz": {
    "overview": "<p>Great Speed, good Attack and Special Attack, good Special Defense... Electabuzz has very good stats and a very good movepool to boot. A top notch Underused Pokemon.</p>",
    "comments": "<h3>Other Options</h3> <p>Psychic could help with Muk and Venusaur, if you're having trouble with them for whatever reason. You could use Barrier to try and make Electabuzz survive a little longer / survive a STAB Earthquake and Counter it back for a quick kill. Thief is just an awesome move. Steal Leftovers from the most annoying staller you can find and laugh.</p> <h3>EVs</h3> <p>You'll need at least 244 Speed EVs to hit 307, beating Jolly Kangaskhan. Alternately, you could use 136 Speed EVs with a +Speed nature. Give it -Attack or -Defense, depending on whether you are using a Fighting move. Put the rest in Attack and Special Attack, always focusing more on Special Attack. The only time you're going to want to put some in Defense is for the last set, where you should focus on Defense, HP and Special Attack, with a little bit in its mediocre Special Defense, making it either Modest or Timid. A +Speed nature is almost exclusively to beat out Fearow, a very deadly UU Choice Bander. Otherwise, Electabuzz beats mostly the same things regardless of nature.</p> <h3>Checks and Counters</h3> <p>Grumpig and Hypno are easily able to switch into it with their beefy Special defense and Muk is quite useful, seeing as it will soak up any of Electabuzz's moves with its HP. You might also try Lanturn and Ampharos, as Electabuzz is unable to really put a big dent into them, due to their resistance to most of Electabuzz's moves, and high Special Defense stats. Meganium and Vileplume could put up a fight, despite being weak to one of its moves.</p>",
    "sets": {
      "Special Sweeper": {"description": "<p>Thief and Toxic are primarily to stop the special walls in UU from lasting as long. Toxic is particularly effective on Hypno, because it lacks the ability to Rest due to Insomnia. Both work on Grumpig, either take away its Leftovers (and do a cool base 40 super effective attack) or Toxic it, either way, it's going to have a lot more trouble stopping you. Watch out for Thieving from Grumpig, however, as it might be a Trickbanding variant (if it tries to Trick right away, though, you'll just steal the Choice Band, and it will Trick it right back onto itself, so you do a 40 power Super Effective move for free). Substitute is to block status and help with prediction. Not much is hit in UU by Focus Punch / Cross Chop that isn't hit harder by your other moves, which is why it's not on here.</p>"},
      "SubPunch": {"description": "<p>Thunderbolt is his most consistent move for damage, Substitute up on something that will run from Electabuzz, and then Focus Punch anything that resists Thunderbolt. Thunder Wave is to paralyze, which you can abuse with Substitute, to scout for full paralysis before attacking safely behind a Substitute with one of the three other special attacks to cover some other types. Fire and Ice Punch are nice for Grass-types who can really mess you up on this set. Ice Punch has the advantage of hitting Grounds, but Fire Punch stops Steelix from ruining your fun.</p>"},
      "Support": {"description": "<p>Support Electabuzz. Thunderbolt is his most damaging move, pick a status of your choice, then put the Light Screen in and either switch out to the Pokemon that needs to Light Screen or stay in and Counter the physical attacker who will switch in. A Bold nature helps Electabuzz survive attacks for Counter. Note: Do not try and Counter a STAB or Choice Banded Earthquake. You will die. You could use a Focus Band for this if you want, but don't.</p>"}
    }
  },
  "Magmar": {"sets": {"Mixed Attacker": {}}},
  "Pinsir": {
    "overview": "<p>Completely outclassed by Heracross, due to a lack of Megahorn, worse defenses overall, and no double STAB, if you ever feel like using it in OU. But Pinsir is a great UU Pokemon. It hits hard and fast, doesn't have that prominent 4x Flying weakness that Heracross has, and has got a great movepool. Pinsir suffers the most from not having a decent STAB attack, but, with the element of surprise backing, he can be a worthwhile investment. It has the advantage of not being walled by Solrock, and has a likely 2HKO with Rock Slide or Brick Break on Walrein with a Choice Band set, same for Return on Gligar, which are the 3 main physical walls used in UU. The Swords Dancer also has the ability to set up on almost anything in a UU team, and Solrock can't come out to try and abuse your weakness to Rock due to the threat of Hidden Power Bug.</p>",
    "comments": "<h3>Other Options</h3> <p>It's just a shame Pinsir doesn't get Counter anymore. Oh well, Revenge is partial compensation for that. Bulk Up is a decent alternative to Swords Dance. You could try a Rest + Sleep Talk set, because Earthquake and Hidden Power Bug covers most everything but Gligar that's seen on most teams, and Pinsir has a lot of durability. Double-Edge can be used over Return in case Gligar gets really defensive.</p> <h3>EVs</h3> <p>You'll want an Adamant nature most of the time, but sometimes, Jolly can get you just enough Speed to put you above foes like Kangaskhan and enemy Gligar.</p> <h3>Checks and Counters</h3> <p>Fearow can come in on Earthquake or Hidden Power Bug and OHKO with Choice Band Drill Peck. Golem has high defenses and STAB Rock Slide to take Pinsir out. Ninetales, Magmar, and Rapidash resist Hidden Power Bug and have STAB on Flamethrower, but Earthquake or Rock Slide will spell their end. Gligar can take on any Pinsir save those with Choice Band Return, and even then has a chance to win, depending on who's faster. Be sure to carry a Quick Attacker / Mach Puncher, however, or the Flailing Pinsir will sweep you, unless you have Misdreavus, or if a Pokemon you have can counter the specific set Pinsir runs. Aggron and Golem can do this for Hidden Power Bug Flailers and Solrock works well against Pinsir that run Earthquake as their secondary offensive move.</p>",
    "sets": {
      "Swords Dance": {"description": "<p>Pinsir is actually quite a good lead Pokemon, especially for UU teams, as it's quite unpredictable. It has a huge movepool for something that only gets one STAB attack. Well, it's surprisingly fast, hits hard, and has decent defenses, which is very good for a Swords Dancer. Most of Pinsir's counters will 2HKO it, so the damage from their hit will usually put Pinsir into Salac range, so that's a decent item, even without Endure, but Leftovers gives more longevity.</p>"},
      "Choice Band": {"description": "<p>Focus Punch here is good to predict switches to Pokemon like Walrein and Kangaskhan, as it's a guaranteed OHKO on Kangaskhan, and Walrein needs max Defense, Bold, and near max HP to even have a chance to survive. Return, however, will 2HKO Gligar, whereas Rock Slide will generally 3HKO.</p>"},
      "Swords Dance + Flail": {"description": "<p>The general strategy here is to bring it out on something that you scare off, and use Swords Dance on the switch. If they don't have Thunder Wave or Toxic, then Endure if they can OHKO you (almost nothing can when you are full health, except a Choice Band Gligar), otherwise, Swords Dance again. If you have Substitute, you can use that to block status, but you can't switch it in to any attack, and it can be harder to pull off a Swords Dance. Flail will seriously hurt things when you are at 1%, and then you have a choice between Earthquake and Hidden Power Bug. Hidden Power Bug hits Solrock and Lunatone, but Earthquake hits Golem, Aggron, and Omastar. Watch out for Quick Attackers, but Flail and Reversal have become such a rare strategy in UU that many people no longer carry one of those.</p>"}
    }
  },
  "Lapras": {"sets": {"Offensive Utility": {}, "Curse": {}}},
  "Omastar": {
    "overview": "<p>Omastar is widely regarded as one of the best Pokemon in UU due to its excellent defensive and offensive qualities. Omastar's access to Spikes is incredibly important for virtually every playstyle, and it finds itself to be the easiest Spikes setter to fit on teams due to its great Defense and decent defensive typing in Water / Rock, which gives it useful resistances to Flying- and especially Normal-type moves; these traits also make it one of the best leads in the metagame and a solid check to powerful Pokemon like Scyther, Fearow, and Kangaskhan. Additionally, Omastar's sky-high Special Attack prevents it from being completely passive when running defensive sets, threatening most of the Pokemon it checks with a strong, STAB-boosted Surf, and allows it to become an extremely deadly rain sweeper when paired with Swift Swim that can completely decimate teams once its checks have been taken down. However, while Water / Rock does provide some handy resistances, it also gives Omastar very common weaknesses to Grass-, Electric-, Ground-, and Fighting-type moves, making it more difficult for it to consistently check Pokemon like Choice Band Granbull and Kangaskhan and lessening its effectiveness as a check to Fire-types like Ninetales, since they often run Grass-type coverage. Omastar also suffers from poor special bulk, meaning strong neutral or super effective special attacks will often severely cripple or outright KO it. Omastar's lack of reliable recovery and vulnerability to status don't help it either, since Leftovers can instantly be negated by poison or burn and offensive sets detest being paralyzed due to their reliance on outspeeding foes. Omastar is also extremely slow without Swift Swim, so it often must take a hit before it can do anything.</p>",
    "comments": "<h3>Other Options</h3> <p>Hidden Power Electric may 3HKO Tentacruel depending on the set Omastar is running and lets it deter Tentacruel without having to worry about Hydro Pump's unreliable accuracy. However, using Hidden Power Electric over Hidden Power Grass leaves Omastar vulnerable to Lanturn and Quagsire. RestTalk improves Omastar's longevity and also prevents it from being worn down by status, but it makes Omastar more passive and leaves it setup fodder for Pokemon like Slowking.</p> <h3>Checks and Counters</h3> <p><strong>Rapid Spin Users</strong>: Rapid Spin users such as Tentacruel, Blastoise, and Hitmontop are able to remove Spikes from their side of the field and deal with Omastar in their own ways. Tentacruel is a fantastic counter to Omastar in general, since it has great special bulk, resists both Water-type STAB move options and Ice Beam, is neutral to Hidden Power Grass, is immune to Toxic, and can 2HKO Omastar with Hydro Pump or OHKO it with Giga Drain. While Hitmontop is the least effective of the Rapid Spin users and does not resist Omastar's attacks, it can inflict poison to Omastar with Toxic and wear it down with Brick Break.</p> <p><strong>Bulky Water-types</strong>: Bulky Water-types like Walrein, Lanturn, and Slowking are 3HKOed at best by Hidden Power Grass and are able to take down Omastar with their STAB moves or through other methods. Walrein can 3HKO it with Surf or inflict it with Toxic. Lanturn can paralyze Omastar with Thunder Wave and has a STAB in Thunderbolt to OHKO Omastar. Slowking can easily tank a Hidden Power Grass before a Calm Mind boost, use Omastar as setup fodder, and OHKO it at +2. If Omastar does not have Hidden Power Grass, Quagsire, although fairly uncommon, can completely wall it and threaten to 3HKO it with Earthquake.</p> <p><strong>Grass-types</strong>: Due to Omastar's 4x weakness to Grass, Grass-types such as Vileplume and Meganium pose a massive threat to it; the former also threatens to immobilize Omastar with Sleep Powder. However, these Pokemon are weak to Ice Beam, so they aren't always reliable answers.</p> <p><strong>Electric-types</strong>: Electric-types such as Electabuzz, Manectric, and Electrode are all very fast and threaten to OHKO Omastar with their super effective STAB moves, which make them huge problems. However, these Pokemon are all frail and would never want to take a STAB Hydro Pump from Rain Dance Omastar.</p> <p><strong>Status Ailments</strong>: Poison and burn will instantly negate Leftovers recovery and quickly wear down Omastar due to its lack of reliable recovery. Rain Dance Omastar strongly detests being paralyzed, since that means that even under rain it will fail to outspeed many threats, most notably Electric-types like Electabuzz.</p> <p><strong>Special Walls</strong>: While special walls such as Hypno and Kangaskhan still take a large chunk of damage from a rain- and STAB-boosted Hydro Pump, they are still able to stall out Rain Dance turns and Hydro Pump PP with Wish and Protect. Hypno and Kangaskhan don't fear anything from offensive and defensive Spikes sets apart from Thief and Toxic, and they can inflict Omastar with Toxic of their own to take it down. However, they do not do much to prevent Spikes from being set up.</p>",
    "sets": {
      "Defensive Spikes": {
        "description": "<h4>Set Description</h4> <p>Spikes is an incredibly powerful support tool, since it wears down grounded foes every time they switch in, limiting their opportunities while also making it easier for Omastar's teammates to take down bulkier threats. STAB Surf lets Omastar take down Fire-, Ground-, and Rock-types like Ninetales, Gligar, and Lunatone. Toxic cripples and stacks offensive pressure on most Pokemon that try to switch into Omastar, which gives it more opportunities to set Spikes. Protect helps Omastar rack up Toxic damage, gives it a turn of free Leftovers recovery, and allows it to scout for super effective attacks. Hidden Power Grass is an option to threaten an OHKO on opposing Omastar while also hitting other Water-types like Blastoise, Lanturn, and Quagsire. Another option is Ice Beam to take down Scyther and Altaria, which could become dangerous if not taken care of, and prevent Grass-types like Vileplume from freely switching in.</p> <p>Maximum HP and Defense EVs with a Bold nature let Omastar take multiple Earthquakes from Kangaskhan lacking Choice Band and use it as setup fodder for Spikes.</p> <h4>Team Options</h4> <p>Due to Omastar's lack of reliable recovery, it has to worry about being worn down by Spikes and status, especially poison. Thus, Rapid Spin users like Tentacruel, Blastoise, and Hitmontop are useful teammates. In particular, Tentacruel's resistance to Water, neutrality to Grass-type moves, and immunity to Toxic are very helpful. Moreover, clerics such as Granbull and Vileplume make for great allies. Specifically, Granbull has Intimidate to weaken physical attackers and Thunder Wave to slow down fast Pokemon, and Vileplume has useful resistances to Water, Grass, Electric, and Fighting as well as Sleep Powder to immobilize critical threats. Ghost-types such as Misdreavus and Banette can block Rapid Spin to keep Omastar's Spikes from being removed, making them useful partners. Grass- and Electric-types like Vileplume and Electabuzz are very dangerous to Omastar, so Pokemon that can check them such as Muk, Cradily, and Camerupt are good choices for their defensive synergy. Wish passers such as Hypno and Kangaskhan are very helpful to increase Omastar's longevity, due to its aforementioned lack of reliable recovery. They can also make use of Protect and Toxic to rapidly wear down foes in combination with Omastar's Spikes. Hypno is an especially synergistic teammate due to its resistance to Fighting-type moves and good special bulk. Lastly, strong attackers such as Scyther and Kangaskhan greatly appreciate Spikes support, since it wears down several common checks and counters and makes bulkier threats much easier to take down.</p>"
      },
      "Offensive Spikes": {
        "description": "<h4>Set Description</h4> <p>Spikes wears down grounded Pokemon when they switch in, limiting foes' opportunities and making bulky Pokemon easier to defeat. Surf is the STAB move of choice due to its higher accuracy and PP over Hydro Pump. Ice Beam takes down Pokemon like Scyther and Altaria as well as Grass-types such as Vileplume, Meganium, and Shiftry. Thief is Omastar's only way of doing anything significant to one of its strongest counters, Tentacruel, taking away its Leftovers and leaving it much more prone to being worn down by Spikes and chip damage. Hidden Power Grass allows Omastar to OHKO opposing Omastar leads and prevents it from being walled by Quagsire.</p> <p>Maximum HP investment and 12 Defense EVs make Omastar as bulky as possible without sacrificing speed and power. 28 Special Attack EVs with a Modest nature guarantee an OHKO with Hidden Power Grass against opposing Omastar leads, which is a critical matchup to win. 216 Speed EVs let Omastar outspeed uninvested base 80 Speed Pokemon such as Meganium.</p> <h4>Team Options</h4> <p>This set is one of the best leads for offensive teams due to its combination of good defenses and high power, which let it win the mirror matchup, prevent it from being passive, and allow it to fire off hard hits to weaken threats for its teammates. Since this set should primarily be used on offensive teams, Pokemon that appreciate Omastar's ability to easily set up Spikes early-game such as Electabuzz, Nidoking, and Scyther are excellent partners, as it turns many 3HKOs into 2HKOs, notably giving Nidoking a chance to win against Walrein after two layers of Spikes. Omastar's team needs Spikes to stay up as long as possible, so Rapid Spin users such as Blastoise, Hitmontop, and especially Tentacruel are very problematic. Electric-types such as Electabuzz and Manectric can threaten Blastoise and Tentacruel for Omastar with their super effective STAB moves; Kangaskhan also makes a very good answer to Tentacruel, since it usually runs Earthquake. Meanwhile, Psychic-types such as Hypno and Lunatone can check Hitmontop, as they can tank Brick Break and Hidden Power Ghost and put it down with Psychic. Spinblockers such as Misdreavus and Banette are also useful partners, but due to their mediocre-at-best bulk, they have to watch out for STAB Hydro Pump from Tentacruel and Hidden Power Ghost from Hitmontop.</p>"
      },
      "Rain Dance Sweeper": {
        "description": "<h4>Set Description</h4> <p>Rain Dance activates Swift Swim, letting Omastar outpace the entire unboosted metagame, and makes Hydro Pump an incredibly powerful STAB move that can do good damage even to some Pokemon that resist it. Hydro Pump is preferred over Surf on this set due to its significantly higher power, allowing Omastar to grab many KOs more easily at the cost of lower PP and unreliable accuracy. Ice Beam threatens to KO Flying-types like Fearow, Altaria, and Scyther and Grass-types like Vileplume and Meganium. Hidden Power Grass makes Omastar a more consistent sweeper, preventing it from being defenseless against Quagsire and giving it a better matchup against other Water-types like Blastoise. Although using Spikes over Hidden Power Grass can make Omastar a less effective sweeper, it is still an excellent tool to ease sweeping for Omastar's team and can lull the opponent into a false sense of security about its moveset.</p> <p>Mystic Water raises the power of Hydro Pump and allows Omastar to OHKO Pokemon like Hypno and Cradily under rain if three layers of Spikes have been set up. Instead of opting for the power of Mystic Water, Omastar can use Leftovers to increase its longevity. Lum Berry prevents Omastar from being crippled by poison, burn, and especially paralysis, which ensures that Omastar always outspeeds the entire metagame under rain.</p> <p>Maximum Special Attack and Speed investment with a Modest nature is chosen to maximize the power of Omastar's attacks and let it outspeed the entire metagame under rain. Omastar can run as low as 96 Speed EVs to invest into defenses, which would let Omastar survive a Hidden Power Grass from Walrein and still allows it to outspeed Scyther and most Electric-types under rain, although this leaves Omastar more vulnerable outside of rain, since Pokemon like Lunatone will be able to outspeed it and hit it with Psychic or Hypnosis, and also means that it will be unable to outrun Electrode under rain, which can threaten to OHKO it with STAB Thunderbolt.</p> <h4>Team Options</h4> <p>Despite Omastar's high damage output under rain, it is walled by bulky Water-types such as Tentacruel, Walrein, and Lanturn, so Electric-types like Electabuzz and Manectric and Grass-types like Vileplume make for good teammates. Vileplume is notable in that it has access to Aromatherapy, which helps offset Omastar's vulnerability to status, particularly Thunder Wave. Baton Passing Calm Mind boosts is very helpful for Omastar, making its already powerful attacks even stronger and helping it tank special attacks; therefore, Hypno and Lunatone can be valuable partners. Hypno notably has good special bulk, resists Fighting-type moves, and has access to Wish to alleviate Omastar's lack of reliable recovery, although Wish and Baton Pass cannot be used together. Choice Band Nidoking and other Ground-types with Choice Band also make for good teammates, since the bulky Water-types that can stop Omastar from sweeping will be significantly weakened if they are forced to take a Choice Band-boosted Earthquake. These Ground-types can also serve as pivots for Electric-type attacks aimed at Omastar.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Oldamar999", "user_id": 453750}], "teams": [{"name": "Quality checked by", "members": [{"username": "Hogg", "user_id": 228003}, {"username": "Plas", "user_id": 355066}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}, {"username": "Oglemi", "user_id": 40358}]}]}
  },
  "Kabutops": {
    "overview": "<p>Kabutops is a threat in UU matches.</p>",
    "comments": "<h3>Other Options</h3> <p>Giga Drain can be used to attack Ground-, Rock-, and Water-types on the switch in case they are resistant to one of your physical attacks, most notably Quagsire. Thief can be useful for stealing items, such as Choice Band and Leftovers, to help make life hard for your opponents, but Knock Off is the superior option. Confuse Ray can give you a bit more time to sweep. Body Slam has the chance to paralyze the target, which can also be useful.</p> <h3>EVs</h3> <p>Kabutops need a Speed stat of at least 264 for the Endure set. Rain Dance Kabutops only needs 8 Speed EVs to get it at 198. Swords Dance versions might want to get the maximum amount of Speed Kabutops can get. Maximum Attack is always good on Kabutops as well. Don't use a nature that lowers Kabutop's Special Attack if you plan on using a special attack, since its Special Attack is already below-average. If you're using Substitute with Flail, make sure your HP is not divisible by 4 so you are able to Substitute four times and maximize Flail's power.</p> <h3>Checks and Counters</h3> <p>Golem, Solrock, and Aggron counter most of Kabutops's sets because of their high Defense. but they are all weak to Surf. Kabutops cannot really hit Meganium and KO it quickly, so Meganium can Counter an attack back or KO it outright. Blastoise has good defensive stats, and because it is a Water-type, Kabutops cannot get around its Defense without being hit hard by it. Hypno can wall Kabutops fairly well because of Wish, Reflect, and its ability to status Kabutops. However, if Kabutops removes Hypno's Leftovers with Knock Off, it has a chance to put a dent in Hypno. Quagsire and Whiscash counter Kabutops in the same way Swampert does: they resist its Rock-type attacks and have decent Defense while packing a STAB Earthquake.</p>",
    "sets": {
      "Swords Dance + Flail": {"description": "<p>This set allows Kabutops to utilize Flail. This can work in UU, but be mindful of Quick Attack users, since combos like Endure + Flail are common in UU. 176 Speed EVs alongside a Jolly nature is all that is needed, since it would reach a Speed stat of 396 after consuming its Salac Berry.</p>"},
      "Knock Off": {"description": "<p>Knock Off makes Kabutops very annoying and can really help out your team. This set has its uses in UU, since it means that Pokemon like Hypno have to recover more and Pokemon like Fearow that may run Choice Band cannot sweep as effectively.</p>"},
      "Rain Dance Sweeper": {"description": "<p>This set is very straightforward and can definitely work in UU, since Swift Swim users can be fairly potent. Use Rain Dance to double your Speed and Swords Dance to make your attacks much stronger. You don't necessarily have to use Surf, but it is a good idea. If you don't want to, use an Adamant nature and put the Special Attack EVs into Speed. Surf is useful, though, for beating things like Solrock, since it and other similar Pokemon don't take as much damage from Rock Slide. Lum Berry is a good item choice so that your sweep isn't ruined by paralysis or burn.</p>"},
      "Choice Band": {"description": "<p>This set can be useful with some prediction, since Kabutops has above-average Attack. The lack of Earthquake as a move choice, though, really hinders Kabutops's ability to sweep. Double-Edge has a high damage output, but Return works if you don't like recoil damage. Rock Slide is a good move in general and a good STAB attack to have. Hidden Power Ground can hit Steel-types. It's a toss-up between Brick Break and Knock Off; Brick Break can hit Normal-types much harder, while Knock Off is good for a hit-and-run and generally annoying.</p>"}
    }
  },
  "Lanturn": {
    "overview": "<p>With its high HP and good Special Defense, Lanturn is a viable Electric Pokemon counter. Lanturn is also really annoying to kill in general, especially in UU matches. Volt Absorb repeatedly zaps it back to high health, and it keeps on dishing out status and some damage. Definitely worth trying.</p>",
    "comments": "<h3>Other Options</h3> <p>Substitute is cool because it can make over 101 HP Substitutes. Ice Beam is a decent option on any set, but only really for Flygon in standard (and of course it is in the uber set). Salamence gets wrecked by Thunder Wave, if Lanturn is not wrecked by Earthquake beforehand. Also, Toxic is a great option in the Underused environment due to the absence of viable Heal Bellers and Aromatherapists.</p> <h3>EVs</h3> <p>Lanturn's HP is plentiful enough; it gains better defensive capabilities if you stack its defenses. 404 HP is required if you use Substitute; 401 will do otherwise. Usually it doesn't need Defense since it's mostly a special wall, so focus on Special Defense. It is desperate for Special Attack EVs for hurting anything. Use Calm or Modest nature.</p> <h3>Checks and Counters</h3> <p>Quagsire, due to Water Absorb and Electric immunity. Light Screen Meganium will outstall Lanturn even it has Ice Beam. You can stall Lanturn out with another Lanturn. Grumpig can switch in and setup quite easily. Hypno walls Lanturn decently as well. Toxic messes up all of these, which is why Vileplume is also viable as a counter.</p>",
    "sets": {"RestTalk": {"description": "<p>This version of Lanturn can absorb any status from any Water, and dish attacks right back at it. With its great defensive capabilities, many special attackers will be stopped cold, and will become paralyzed in the process.</p>"}, "Parafusion": {"description": "<p>Double STAB and paralysis + confusion--Lanturn is one annoying Pokemon if used correctly. Lanturn's defensive capabilities extend beyond its ability to annoy, as its high HP coupled with its almost unique resistance to the popular Thunderbolt / Ice Beam combination make it a formidable special wall. Lanturn's ability to own Electrics, Waters, and Ice-types, and spread status all around an opponent's team, make it a strong team player.</p>"}}
  },
  "Xatu": {
    "overview": "<p>Xatu's main problem is that its typing gives it a weakness to Thunderbolt, Ice Beam, and Rock Slide, and it doesn't resist Normal. It does have that great 4x Fighting resist and Earthquake immunity, but since most Pokemon with either of these moves will also have at least one of Rock Slide, Shadow Ball, Return, or Hidden Power Ghost, Xatu can't even abuse its resistances to switch in, unless the enemy has a Choice Band.</p> <p>Grumpig or Hypno are usually a better choice if you want a supporter, Gligar takes on Pokemon that carry Fighting moves better, and Hypno is infinitely better at support. Xatu is simply outclassed by so many Pokemon, it's rarely worth the effort. At least it can come in on Choice Band Earthquakes.</p>",
    "comments": "<h3>Other Options</h3> <p>Hidden Power Water is an option for Tyranitar in OU, and Hidden Power Fire hits Metagross and Skarmory. Xatu resists Fighting x4, so if you give it Quick Attack, it can be a Reversal counter. Xatu's Attack isn't much worse than its Special Attack, so you could try out physical attacks on it, but then you're just a worse Fearow except for your Fighting resist. Xatu can use Hidden Power Ice to get a surprise OHKO on Gligar, something Hypno and Grumpig can't do without taking a Swords Danced hit, and Gligar might expect Ice Punch from them and switch out, anyway.</p> <p>Rest can be used with the Trait Early Bird to make Rest last a single turn, or you can use it with Synchronize to switch into status, Synchronize it, and then Rest off the status later, and when you wake up, Xatu can Synchronize someone else. This is probably best done with a Sleep Talk set, however, so Xatu isn't completely a sitting duck while it's Sleeping. Thunder Wave or Toxic can be added on as status.</p> <h3>EVs</h3> <p>Xatu should go to 310 Speed max, as that will make Xatu faster than neutral nature Scyther, Electabuzz, and Manectric, as well as Jolly Kangaskhan and Timid Pikachu; this requires 224 Speed EVs and a +Speed nature. 301 Speed makes it faster than Jolly Hitmonlee, Adamant Fearow, and neutral nature Tentacruel, as well as Jolly Gligar; this requires 192 EVs and a +Speed nature. 280 Speed beats Adamant Kangaskhan and Modest Pikachu; Xatu needs 216 EVs and a neutral nature to reach this. The lowest most Xatu should go is probably 270 Speed, to beat Adamant Gligar; this needs 176 EVs and a neutral nature.</p> <p>Supporter Xatu should max HP, and put the rest in Special Attack, whereas sweeper Xatu should do the opposite--max Special Attack, and put the rest in HP.</p> <h3>Checks and Counters</h3> <p>OU counters: Snorlax, Regice, and Blissey will easily stop any special set, and won't take enough damage from a physical hit if you try and run a Choice Band Xatu for the surprise factor to make it worth it. Xatu can potentially use Wish and Calm Mind to actually beat Blissey, unless it has Toxic, or can Calm Mind itself, but even Thunder Wave will ruin Xatu's chance at a sweep when they just bring in a physical attacker and OHKO you. Tyranitar and Metagross laugh at anything Xatu can throw at them, except Dragon Dancing Tyranitar won't like Thunder Wave. Raikou, Zapdos, and other Electric Pokemon can do more damage than Xatu can defend against with Calm Mind and Wish. Any physical attacker that isn't weak to Psychic can put the hurt on Xatu, really.</p> <p>UU counters: Manectric, Electabuzz, and other Electrics can damage Xatu too fast, just like in OU. Solrock and Lunatone laugh at anything Xatu can throw at it, save Hidden Power Dark, and even that won't do enough to counter Solrock's Rock Slide or Shadow Ball. Aggron doesn't care about Thunder Wave that much, resists Psychic and Hidden Power Dark, and has STAB Rock Slide to annihilate Xatu. Sableye is immune to Psychic and can hit Xatu hard with STAB Shadow Ball or Feint Attack. Banette OHKOs Xatu with Shadow Ball, but doesn't have the Special Defense to switch in that often. Kangaskhan takes very little from Xatu's attacks, and can just beat it down with STAB Return or Shadow Ball, and, if it is abusing Early Bird Rest, you can't even cripple it with Thunder Wave. Hypno and Grumpig can just come in and Calm Mind up with you, and they will win the Calm Mind war most of the time, especially if they have Ice Punch or Thunder Punch.</p>",
    "sets": {
      "Baton Pass": {"description": "<p>This is mostly inferior to Celebi in OU, and Hypno / Lunatone outclass it in UU, except that it can also pass Wish. This lets you have Xatu absorb a hit as it passes out to a weakened Pokemon, letting that Pokemon take no damage as it receives the Wish. Unfortunately, Xatu has neither the defenses nor the typing to pull this off effectively.</p> <p>If you are Quiet, you'll likely want to reduce your Speed IVs to 0, so that Xatu is more likely to take the hit than whatever you're passing to.</p>"},
      "Support": {"description": "<p>Xatu puts up a Reflect to protect itself from physical attacks, and then boosts its Special Defense with Calm Mind and attempts to sweep. Reflect and Wish are there to help out the whole team, and they give Xatu a good boost as well.</p>"},
      "Thief": {"description": "<p>Xatu is a pretty horrible Pokemon and this is about all it can do. Switch in on a Will-O-Wisp or Thunder Wave from something; Synchronize it to them while curing yourself. After this has happened, you have essentially gained a free steal and have crippled that Pokemon.</p>"}
    }
  },
  "Politoed": {
    "overview": "<p>A really funny UU Pokemon. It heals by switching in on Blastoise and pals. It is a cool guy and deserves more use overall.</p>",
    "comments": "<h3>Other Options</h3> <p>Psychic might beat the occasional Hitmonlee and Poliwrath or something. Swagger and Toxic are there because if you want to be \"annoying\", you might as well use them.</p> <h3>EVs</h3> <p>The EVs mentioned with the moveset is close to pretty much the best you will get. With maximum HP, it can deal the most Counter damage possible, and that gives it enough Speed to hit 201 which is a good Speed to aim for whenever you are around that area. The rest could be stuck in Special Attack or Defense, but Special Attack seems like the wiser choice.</p> <h3>Checks and Counters</h3> <p>Fellow Water-types such as Lanturn, and Mantine and Sleep Talk Walrein with Toxic or Hidden Power Grass, can take most anything from Politoed, including its own Hidden Power Grass. Lanturn even boasts a STAB Thunderbolt of its own with which to destroy Politoed quickly. Swords Dance Tentacruel uses its high Special Defense to set up extremely easily on Politoed and proceeds to sweep. The standard special walls of Hypno and Grumpig counter Politoed excellently as well; Hypno's Insomnia also nullifies one of Politoed's main selling points, Hypnosis. Meganium, Vileplume, and Bellossom have high Special Defense and recovery moves in Synthesis and Moonlight, and hit with Grass STAB. Banette boasts a very powerful Shadow Ball and immunity to Counter due to its Ghost typing. Electrics such as Electabuzz and Manectric make short work of Politoed.</p>",
    "sets": {"Special Attacker + Hypnosis": {"description": "<p>Surf is mainly here for STAB and so you can hit stuff like Solrock. Hypnosis is a fun status move and in UU, pretty much everything but Hypno, Banette, and the rare Sleep Talking Lanturn will be put to sleep by this guy. Ice Beam hits Grass Pokemon and Gligar for even more damage. Counter is probably the best move option, since it can withstand a lot of physical attacks and deal them back for damage.</p>"}}
  },
  "Quagsire": {
    "overview": "<p>Has a hard time in standard play, though Water Absorb is a lot of fun. The Counter set works the best there. Quagsire is an excellent UU Pokemon, quite hard to consistently beat. And if you're insane, it can counter Kyogre in Ubers (can't do much else though).</p>",
    "comments": "<h3>EVs</h3> <p>Cursing version wants lots of HP and Special Defense. Adamant or Careful when not using Surf / Ice Beam, and Brave / Sassy when you are. The leftover EVs should go in Attack or Defense. For the Counter version, probably Impish, almost max HP, and a nice load of Defense to be able to take more hits. After that, stack Attack EVs.</p> <h3>Checks and Counters</h3> <p>Meganium, Mantine, Cloyster, and Jumpluff somewhat. Besides all this, anything with Hidden Power Grass.</p>",
    "sets": {
      "Curse": {"description": "<p>The UU Swampert, except with Water Absorb. Still, Swampert is better in standard play unless you have a big weakness to Water. Curse up, launch STAB Earthquakes, hit Flying types with Ice Beam or Hidden Power Rock, and Rest when health is low or you've been statused. Chesto Berry is an option, because Quagsire doesn't have quite the staying power of Snorlax and Swampert to Rest without support, though I always use Leftovers.</p>"},
      "Counter": {"description": "<p>Counter is awesome on Quagsire. About every Choice Bander in the game, from Aerodactyl to Salamence to Tauros will fail to OHKO Quagsire and be killed by a Counter. You can use Haze to make Quagsire a Suicune counter of sorts, and to force physical attackers to hit you instead of stat up. Toxic is awesome if you're playing UU, since Rest isn't as common there. Last move, either Ice Beam or Surf, is to hit stuff like Gengar and Donphan. Remember, you can counter all Hidden Power, even Hidden Power Grass.</p>"}
    }
  },
  "Slowking": {
    "overview": "<p>Slowking is one of UU's premier Calm Mind sweepers and bulky Water-types. Slowking can be immediately threatening even with a single boost thanks to its nearly unresisted dual STAB combination. Its huge bulk allows for ample setup opportunities against the tier's numerous Water- and Ground-types such as Omastar, Tentacruel, and Gligar, with most special coverage options bouncing off of it. This is complemented nicely by Rest, which allows Slowking to continue its sweep and remain threatening for the long haul. Slowking can be very hard to KO without enough offensive pressure, allowing it to easily punish most bulky builds that aim to take the game slower, and it is a great fit on bulky balance and offense teams that can open up opportunities for Slowking to wreak havoc.</p> <p>Despite its great bulk and defensive typing, Slowking is very slow and can get easily overwhelmed by offensive pressure and forced into using Rest early, something further compounded by Spikes, which makes it difficult for it to switch in. Slowking's reliance on Rest for recovery is exploitable through lost momentum, especially by sweepers that can win the game on the spot, such as Swords Dance Scyther. Slowking is also very susceptible to critical hits, as only one can put it out of commission as it's getting pressured because it has a hard time finding another opportunity to use Rest.</p>",
    "comments": "<h3>Other Options</h3> <p>Thunder Wave is useful for turning the tides on switch-ins like Kangaskhan, Scyther, and Electabuzz and allows for earlier opportunities to set up or use Rest. Dropping Psychic for Thunder Wave is useful on paralysis spam structures, though dropping Psychic will hurt Slowking's ability to hit other Water-types and Vileplume. Dropping Rest for Thunder Wave is situationally useful on hyper offensive structures where Slowking's bulky setup sweeper nature trades longevity for speed control, but it then loses out on crucial recovery to sustain itself through its sweep. A Psychic + Calm Mind + RestTalk set reduces Slowking's coverage, but it allows Slowking to maintain itself as an offensive threat while asleep and boost more freely without losing any momentum.</p> <h3>Checks and Counters</h3> <p><strong>Kangaskhan</strong>: Offensive variants of Kangaskhan can muscle through Slowking's physical bulk and prevent it from Rest looping with Double-Edge being a 3HKO. Specially defensive variants also work well in a pinch, forcing Slowking into a bad spot with Toxic and having reliable ways to recover off the damage Slowking deals with Wish and Early Bird Rest. Roar variants of Kangaskhan can hard stop Slowking's sweep, forcing it out of its Calm Mind boosts. However, Slowking can take advantage of Kangaskhan's Rest turns by setting up and hitting back hard with a boosted Surf.</p> <p><strong>Bug-types</strong>: Scyther and Pinsir pose a dangerous threat to Slowking, smashing through it with super effective STAB moves. Choice Band Scyther has a lot of immediate power with Hidden Power Bug or Silver Wind, KOing even from 60% and potentially OHKOing in Swarm range. Although Swords Dance Scyther and non-Adamant Pinsir need to set up to 2HKO Slowking, they can use Slowking's Rest turns to boost and threaten to sweep. Both Pokemon can hit Slowking very hard, but they get hit hard in return if they switch in.</p> <p><strong>Electric-types</strong>: Electric-types like Ampharos, Lanturn, and Electabuzz are great at handling Slowking, since their STAB Thunderbolts are mostly unperturbed by Special Defense boosts and prevent Slowking from Rest looping. However, if they have taken prior chip damage, Slowking can occasionally take the trade to KO them after Calm Mind, and the faster Electric-types have trouble directly switching into its attacks.</p> <p><strong>Phazers</strong>: Pokemon with Roar such as Altaria, Walrein, Blastoise, and occasionally Kangaskhan can tank any boosted attacks and force Slowking out, making Slowking start back at square one on its sweep and potentially forcing it to switch in with Spikes up. If Slowking is low without using Rest, it's very hard to find an opportunity to recover and Slowking's team becomes on the back foot. However, some of these Pokemon usually don't make much progress of their own on Slowking one-on-one.</p> <p><strong>Encore</strong>: Encore users like Walrein, Cacturne, Mr. Mime, and Raichu can lock Slowking into Calm Mind, hard stopping its sweep and preventing it from healing off damage while they use the free turns to pressure its team. Some of these Pokemon need a read on Calm Mind, as they don't comfortably switch into Slowking's attacks.</p> <p><strong>Explosion</strong>: An Explosion user such as Solrock, Electrode, Muk, or Glalie can stop Slowking's sweep by trading with it. This often opens up a gateway for a Slowking-weak Pokemon like Arcanine or Gligar to safely clean.</p>",
    "sets": {
      "Calm Mind": {
        "description": "<h4>Set Description</h4> <p>Slowking should find opportunities to safely come in mid-game and set up Calm Mind on Pokemon such as Omastar, Tentacruel, Gligar, Arcanine, and non-Encore or Roar Walrein through passive entry points or double switches, though Slowking should be careful of the occasional Thief from some of these Pokemon. Its naturally high special bulk coupled with greatly invested physical bulk and a lack of common physical weaknesses means Slowking can survive numerous uses of STAB Earthquake, Hidden Power Electric, and Hidden Power Grass thrown its way, with the latter two doing little damage at +1 Special Defense. Psychic allows Slowking to hit Water- and Grass-types such as Tentacruel and Vileplume. Rest gives Slowking longevity to keep sweeping the opposing team and to offset the damage it takes from a multitude of attacks, Spikes, and Toxic.</p> <h4>Team Options</h4> <p>Spikes are the bane of Slowking, so a Rapid Spin user such as Tentacruel, Blastoise, or Hitmontop is mandatory with it, allowing for safer switches on Pokemon like Gligar and Arcanine. A cleric such as Ampharos, Vileplume, or Altaria can wake up Slowking after it uses Rest, letting it hit the field again for another Calm Mind-boosted assault. Kangaskhan provides the team another special sponge for opposing Water- and Electric-types, and it can pass a Wish to Slowking to keep it healthy when needing to switch into certain threats with Spikes up or if it took prior chip damage. Since Choice Band Scyther is an immediate threat to Slowking, Pokemon that can check it such as Granbull, Arcanine, and Gligar are good partners, establishing their own offense that complements Slowking by cleaning up late-game. Pokemon that can check Electric-types such as Kangaskhan, Ampharos, Cradily, and Nidoqueen can passively damage or wallbreak through them to enable Slowking to sweep and be not as easily forced out.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "EllingtonReborn", "user_id": 619555}], "teams": [{"name": "Quality checked by", "members": [{"username": "Bouff", "user_id": 121672}, {"username": "BigFatMantis", "user_id": 507497}]}, {"name": "Grammar checked by", "members": [{"username": "Gangsta Spongebob", "user_id": 535530}, {"username": "deetah", "user_id": 297659}]}]}
  },
  "Misdreavus": {
    "overview": "<p>Misdreavus is the UU version of Gengar, as such it can work wonders in UU matches.</p>",
    "comments": "<h3>Other Options</h3> <p>Snatch can catch a nice Substitute if they think you are going to Confuse Ray or Thunder Wave. Pain Split is a decent idea for recovering HP, since Misdreavus's HP is still quite low even with all those EVs invested. Shadow Ball with a few EVs in Attack is a 2HKO to Hypno and Grumpig, and on the Imprison set allows you to wall Banette and Granbull.</p> <h3>EVs</h3> <p>Mostly HP and defenses. Maxing out Speed is not recommended: you'll only outrun Gligar (which isn't even a guarantee since many have Jolly and maximum Speed) at the expense of much-needed defenses.</p> <h3>Checks and Counters</h3> <p>Counters are Mr. Mime and Exploud due to Perish Song immunity. Misdreavus isn't capable of taking many hits so hitting it hard with Choice Banders is probably your best way to beat Misdreavus.</p>",
    "sets": {
      "Perish Trapper": {"description": "<p>MissyD! The old Perish Trapper from GSC is back for more in ADV. Perish trapping is even better in ADV with Taunt. Trap your foe, Protect to regain health from Leftovers, Perish Song or Taunt depending on who is on the field. Protect and Taunt whore until it falls, and switch out. This is really a no-brainer. Use Destiny Bond if you are sure Misdreavus isn't going to survive the 3 turn setup Perish Song needs.</p>"},
      "Calm Mind": {"description": "<p>A cool set, to tell you the truth. Taunt a wall and Calm Mind up, then lay the smack down with Thunderbolt.</p>"},
      "Imprison": {"description": "<p>A lot of Pokemon rely on Hidden Power to hit Misdreavus since it's immune to Ground, Fighting and Normal, so Imprison prevents them from touching you. Often you will find the opponent frustrated by how they suddenly cannot attack her once Imprison is used. With Thunder Wave on the set you can't be paralyzed bar a random Stun Spore, and Hidden Power Ice forces Ground types to switch, helping you to spread paralysis.</p>"}
    },
    "credits": {"writtenBy": [{"username": "cookie", "user_id": 384}], "teams": [{"name": "Quality checked by", "members": [{"username": "dekzeh", "user_id": 11607}, {"username": "Caelum", "user_id": 19319}, {"username": "Havak", "user_id": 1830}]}]}
  },
  "Girafarig": {
    "overview": "<p>Girafarig is horrible, but can be used as a diverse Baton Pass user in the UU environment. Its typing is unique, letting it lose the Ghost weakness due to its Normal-type side. I wouldn't recommend this, though.</p>",
    "comments": "<h3>Other Options</h3> <p>Wish is generally superior to Rest, but with Early Bird, you only sleep for one turn. Reflect and Light Screen passing is another good option for Girafarig because it is so horrible to begin with. Girafarig can hit most phazers with Thunderbolt.</p> <h3>EVs</h3> <p>Focus on Girafarig's HP and defenses so it can stay alive long enough to get off the Baton Pass.</p> <h3>Checks and Counters</h3> <p>Almost anything. Anything that's faster and with enough Attack to OHKO Girafarig is a counter. Anything with enough Special Defense to take a hit from Girafarig and then OHKO it is a counter.</p>",
    "sets": {"Calm Mind + Baton Pass": {"description": "<p>Not really good, but Girafarig itself isn't good. Pass Calm Minds to other Pokemon or attempt to sweep after some Calm Minds with Girafarig itself. Girafarig can't do much more than this.</p>"}, "WishPasser": {"description": "<p>Once again, you Baton Pass either Calm Minds or Agilities as well as Substitutes and Wishes. It can't attack at all, as you see, but it can make some good support if used right. Of course there are far better options, but this gives you some diversity in what you can actually Baton Pass.</p>"}}
  },
  "Dunsparce": {
    "overview": "<p>Everyone loves Dunsparce, but no one loves to be on the receiving end of its haxing skills. I believe he is always a good choice for a UU team. He can take a fair few hits, and deal back some slow, steady damage, while the opponent can't do a thing and you restore health with Leftovers! Just don't overestimate his lifespan and be too risky... but other than that, have fun!</p>",
    "comments": "<h3>Other Options</h3> <p>Quite a few options here, most of which take advantage of Serene Grace. That 20% chance of a full stat boost from Ancient Power is always good, which can potentially make Dunsparce a good Pokemon (:o indeed!) Glare can paralyze more Pokemon than Thunder Wave or Body Slam can, being able to hit both Ground- and Ghost-types, but that accuracy winds me up sometimes. Ice Beam has that 20% chance of a freeze, but I don't use it much, as Dunsparce is all about paraflinch. Water Pulse has a 40% chance of confusion, quite chancey, always up for consideration. Attract can get piss annoying, and will at least force a switch, as does Yawn, but remember it doesn't go hand in hand with paralysis. And Counter is a nice surprise; you don't see it much on this Pokemon.</p> <h3>EVs</h3> <p>I usually max out HP, load quite a bit into Attack, and distribute the rest into its defenses. Go with Adamant. Unless, of course, you do decide to use one of those special attacks.</p> <h3>Checks and Counters</h3> <p>He may have a buttload of HP, but he can't really take a strong attack, least of all a Brick Break. His low Speed leaves him susceptible to status effects as well, like sleep and so forth, shutting down his whole operation. Watch out primarily for the likes of Machamp, Hariyama, Jumpluff and friends. And getting burned by Banette is never cool.</p>",
    "sets": {"Paraflinch": {"description": "<p>Dunsparce is a highly diverse Pokemon; I find it works better as a physical sweeper in a UU game. Flinching enemies constantly with Serene Grace + Headbutt is very annoying, and no Pokemon will score it more than Dunsparce, especially when a paralyzed foe is left in. Basically, use Thunder Wave (or Body Slam if you want the 60% chance of paralyzing a Ground Pokemon), maybe again if you predict a switch. Then Headbutt or Rock Slide for some major flinching!</p> <p>Shadow Ball is really only there to hit Ghosts, and with repeated Special Defense drops, it can trigger a switch later on. Rock Slide is primarily there to take out the common Jumpluff, Fearow and Swellow, but if you decide to risk using Dunsparce outside of UU, you may be able to score a KO against Skarmory... something I have managed to do with this Dunsparce many times.</p>"}}
  },
  "Gligar": {
    "overview": "<p>Definitely one of the best UU Pokemon available. It has an immunity to Earthquake and Thunderbolt, and resistances to Fighting, Bug, and Poison; it doesn't get much better than this. Quick Attack is a nice tool, and a STAB and Swords Dance-boosted Earthquake will hurt. It has some issues with the ever-common Water-types and Solrock, but still it has ways to get around those.</p>",
    "comments": "<h3>Other Options</h3> <p>Swords Dance will usually do better than Screech, but it helps for softening up something for your counter (for example, you Screech a Blastoise on the switch, then go to a Choice Bander). Counter is unexpected, but Gligar can live through almost any physical hit, boosted or not--it's a great surprise for Fearow and such friends. Toxic can help wearing down stuff on switches, but with the prevalence of a Sleep Talking Water type for a Gligar counter, it's primarily for Solrock on teams that don't have Vileplume to Aromatherapy. Steel Wing is less powerful than Iron Tail, but more accurate.</p> <h3>EVs</h3> <p>Gligar will generally want to use an Adamant nature with max Speed to tie other Gligar, or a Jolly nature and 200 EVs, bringing you to 280 Speed after the Speed IV drop from Hidden Power Flying, making you just faster than Adamant Kangaskhan. You should always max Attack, and put the rest in HP. When holding a Salac Berry, get 254 Speed max (196 EVs), as this beats out an Electrode without a +Speed nature. Alternately, you can run 242 Speed (144 EVs), to beat the unused Persian and Sneasel after your Salac Berry. You could go down to 227 Speed (84 EVs) to be faster than a Timid Electabuzz or Manectric after you activate your Salac Berry. This is the absolute lowest recommended Speed.</p> <h3>Checks and Counters</h3> <p>Solrock, Lunatone, Quagsire, Blastoise, Slowking, Walrein, Politoed.</p>",
    "sets": {
      "Swords Dance": {"description": "<p>The standard Gligar. Get your opponent's Waters out of the way and sweep to victory. You can come in on most Earthquakes, but don't expect to live through Special hits. Iron Tail is useful for the common Solrock.</p>"},
      "Choice Band": {"description": "<p>It works a bit like Flygon, except in UU. If you can predict Solrock, use Iron Tail and pray that it hits, because it will nearly OHKO it. Gligar's attack is just average though; it won't do as much damage as most Choice Banders. If they don't have a very defensive Water, you can potentially 2HKO their Gligar counter with a Choice Band Earthquake or Hidden Power Flying.</p>"},
      "Swords Dance + Salac": {"description": "<p>Basically you hit stuff on the switch until you think you can kill anything that's left, faster or not. Swords Dance, then Substitute or Endure yourself into Salac range. Using a Damage Calculator isn't a bad idea with this. Almost every serious UU team has something to take out low-health users though, be sure to take that out as well before going for Salac. Hidden Power Flying is good for STAB, and does tons of damage to Meganium and a bit to other Gligar, but Hidden Power Bug still hits Grass types (unless they're part Poison, in which case Earthquake is neutral), in addition to nailing Solrock and Lunatone hard, but you're lost against anything that's Flying.</p>"}
    }
  },
  "Shuckle": {
    "overview": "<p>The following analysis was produced many years ago and is currently being <a href=\"https://www.smogon.com/forums/threads/adv-nu-shuckle-wip.3697039/\">revamped</a>. Information contained in the analysis may be misinformative with regard to the current ADV NU metagame.</p> <hr /> <p>A horrible Pokemon. It can work somewhat with the right team and some Encore prediction though. Just hope you are lucky!</p>",
    "comments": "<h3>Other Options</h3> <p>Body Slam can paralyze things like Gyarados trying to set up on you, Attract can stall. Nothing that isn't mentioned, really.</p> <h3>EVs</h3> <p>252 HP, rest in defenses how you see fit. Rollout version requires Attack.</p> <h3>Checks and Counters</h3> <p>Any Steel / Poison type are immune to Toxic, Shuckle's main offense. Zangoose can abuse Immunity to block Toxic, but loses to Rollout. Anything with Rest and anything with Substitute block Toxic, as well, and Substitute can scout for a Rollout miss. Blissey, Miltank, and Celebi can heal the entire team of Toxic. Gyarados and Tyranitar can Taunt Shuckle to block Toxic and Dragon Dance up, but Gyarados has to worry just a bit about Rollout.</p>",
    "sets": {"Staller": {"description": "<p>Shuckle's not that great, but he can work as a mini Wobbuffet with this Encore moveset. For this to work, you need Magneton and Dugtrio on your team. It won't work any other way. Toxic stuff and Protect to get HP back. When you predict a Substitute, Encore it and switch to Dugtrio. If you predict Aromatherapy, do the same. If you are bad at predicting, Shuckle won't work at all. You'll need to kill Skarmory off first with Magneton. Weezing will stop you no matter what you have, so I suggest you pack a Facade Swellow or Ursaring. Encore Will-O-Wisp, switch to Swellow, and OHKO nearly everything with Facade. Proceed to sweep. Obviously not as effective as Wobbuffet, but Shuckle is allowed in OU matches.</p>"}, "Rollout": {"description": "<p>Defense Curl to boost your Defense and the power of Rollout. Even with Shuckle's low Attack, Rollout can do some massive damage on the 4th and 5th roll.</p>"}}
  },
  "Sneasel": {
    "overview": "<p>Sneasel is tied with Persian as the second fastest Pokemon in the entire metagame, which, alongside its decent base 95 Attack and unique dual typing, would allow it to perform wonderfully as a Swords Dance sweeper or Choice Band wallbreaker. Unfortunately, both of its STAB types are special, and it only has base 35 Special Attack, meaning Sneasel must use non-STAB moves if it wants to make use of its much higher Attack stat. Sneasel is also exceedingly frail and has five glaring weaknesses, necessitating an immense amount of team support in order for it to function. Even so, Sneasel has perfect neutral coverage in Shadow Ball + Brick Break, and in a metagame dominated by Psychic-types such as Hypno, Solrock, Lunatone, and Grumpig, as well as Fighting-weak Pokemon such as Kangaskhan, Cradily, and Walrein, perhaps it's not all bad for everyone's favorite icy weasel.</p>",
    "comments": "<h3>Other Options</h3> <p>A Choice Band set is more suited to revenge killing than Sneasel's Swords Dance set, making use of moves like Focus Punch and Hidden Power Flying, the latter of which is extremely useful against walls like Hitmontop, Vileplume, and Meganium that Sneasel would otherwise have trouble with. However, Sneasel faces heavy competition as a revenge killer from Persian, which gets STAB on Double-Edge, allowing it to always OHKO Hasty Tentacruel and hit Scyther significantly harder than Sneasel ever could. Substitute and Endure are both options to help Sneasel more safely bring its HP down to the activation range of its Liechi Berry. Focus Punch can be used alongside Substitute as a stronger alternative to Brick Break. Sneasel can also use Substitute in tandem with Toxic to wear down the foe. Quick Attack can be utilized as a priority move that picks off weakened Pokemon. However, Sneasel already has the necessary Speed tier to adequately perform this role, and giving up an important move for Quick Attack is not justifiable.</p> <h3>Checks and Counters</h3> <p>Fighting-types such as Poliwrath, Primeape, and Hitmontop can easily OHKO Sneasel with their STAB attacks. Hitmonlee and Hitmontop also have access to Mach Punch, which ignores Sneasel's absurd Speed stat. Additionally, Hitmontop's Intimidate softens the incoming attack before Hitmontop revenge kills Sneasel with Mach Punch. Walls such as Blastoise, Hypno, Granbull, and the aforementioned Hitmontop can all pivot into Sneasel easily and 2HKO it back, especially the latter two with their access to Intimidate. Due to its extreme frailty, Sneasel gets easily crushed by Rock-types such as Omastar, Solrock, and Lunatone; burned alive by Fire-types such as Ninetales, Camerupt, and Magmar; swarmed by Bug-types such as Scyther and Pinsir; and hammered by Steel-types such as Aggron.</p>",
    "sets": {
      "Physical Attacker": {
        "description": "<p>Shadow Ball and Brick Break combine to provide perfect neutral coverage against the entire tier, and, when boosted by Swords Dance, they clean up opposing teams quite nicely. Because Shadow Ball and Brick Break do not receive STAB, Double-Edge becomes Sneasels strongest attack against targets that are hit neutrally by the first two attacks. Swords Dance boosts Sneasels Attack stat by two stages with each use and allows it to perform the role of a setup sweeper.</p> <p>Liechi Berry is Sneasel's best option for a held item, as it is likely to take a massive hit to activate it or use Double-Edge enough to activate it through the recoil. Both of Sneasels abilities are relatively useless. However, Inner Focus prevents Sneasel from flinching, which is considerably more useful than prevention of lowered accuracy, especially with Fake Out users such as Persian and Shiftry around. Maximum Speed and Attack EVs allow Sneasel to outspeed the entire tier and hit as hard as possible. A Jolly nature is utilized so that Sneasel can outspeed base 105 Speed Pokemon such as Scyther, Manectric, Rapidash, and Electabuzz. Sneasel is hard to use because it's so incredibly frail and cannot be directly switched into basically anything. As such, Sneasel should only be switched in via a slow Baton Pass or after a teammate has fainted so that it can revenge kill the foe. Furthermore, bulky attackers such as Kangaskhan and Lunatone can ease pressure off Sneasel with their ability to take a hit yet still maintain offensive momentum. Spikes setters such as Omastar are incredibly useful for chipping away at the opposing team for Sneasel to clean up later.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Aaronboyer", "user_id": 239454}], "teams": [{"name": "Quality checked by", "members": [{"username": "Oglemi", "user_id": 40358}, {"username": "Hogg", "user_id": 228003}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}, {"username": "Empress", "user_id": 175616}]}]}
  },
  "Stantler": {
    "overview": "<p>Stantler; it's not just for Christmas teams! Stantler's average stats and awesome movepool make it a top-tier UU that can fit on most any UU team. It just doesn't have the durability for OU play, but is an interesting option if you're in need of a change and want a good statuser. Plus, it's a reindeer. Gotta love it.</p>",
    "comments": "<h3>Other Options</h3> <p>Skill Swap could be fun, and your Intimidate won't help anybody. Toxic and Hypnosis are other options for statuses that Stantler can inflict.</p> <h3>EVs</h3> <p>Stantler needs some weird EVs, depending on his set. For the standard set you're obviously going to want some Speed and Attack, so either give it full Speed and a +Spe nature or 285, enough to outspeed Medicham and other things at that Speed. Split the rest in Attack and HP so he'll survive and get more from Leftovers. For the Calm Mind set worry more about Special Attack and Speed over everything else, maybe a little in HP too. Psych-Up set is going to need less Attack and MUCH more HP and Defense.</p> <h3>Checks and Counters</h3> <p>Anything that shrugs off or abuses status for the first set, like Heracross or Celebi. Any physical attacker owns the shit out of the Swagger / Psych Up set with some luck. Prediction counters the last set. Skarmory beats all sets except those with Thunderbolt, Gengar / Misdreavus beat you if you don't have Shadow Ball, and any Steel / Rock can shut you down, especially without Earthquake. Steelix just laughs even at Choice Band Earthquakes and counters with an Earthquake of its own, or Toxic.</p>",
    "sets": {"Calm Mind": {"description": "<p>A special sweeper that uses Hypnosis to put its counters out of commission. Psychic hits more powerfully than Hidden Power Ice on foes that are neutral to the attacks, but Hidden Power Ice has better type coverage with Thunderbolt.</p>"}, "Swagger + Psych Up": {"description": "<p>Blah. I don't like Swagger + Psych-Up combo, but if you do Stantler can certainly pull it off. Just be careful you don't Swagger something that's going to destroy you in one hit if it hits through confusion.</p>"}, "Choice Band": {"description": "<p>A watered down version of Tauros except for Shadow Ball. Thunderbolt for Skarmory, Double-Edge to hit harder. I wouldn't recommend it but Stantler has a good movepool, so you can go for it if you want to.</p>"}}
  },
  "Linoone": {
    "overview": "<p>It learns some interesting moves in Belly Drum, Extreme Speed, and Trick, and if played right, can screw up the opponent's entire strategy.</p>",
    "comments": "<h3>Other Options</h3> <p>Endure over Substitute on the Flailer set. Nothing much else really.</p> <h3>EVs</h3> <p>Max Attack always. A 270 Speed stat is plenty in UU. For the SubFlail set make sure that Linoone's actual HP stat is not divisible by 4, for example, 300 HP won't work, as you'll be left with 1/4 health after the third Substitute / Sub + Belly Drum, thus weakening Flail. It doesn't matter if you end up with 1, 2, or 3 HP, though.</p> <h3>Checks and Counters</h3> <p>Gligar survives an attack and can finish it off. Golem can take one Belly Drummed Hidden Power Ground / Hidden Power Fighting. Aggron blocks those without Hidden Power Fighting / Hidden Power Ground. Cradily can take anything but Hidden Power Fighting and hit Linoone with any attack.</p> <p>The main way to counter Linoone is to simply just keep attacking it; since it's so fragile, it won't get off its Belly Drum and thus will be countered.</p>",
    "sets": {
      "Belly Drum": {"description": "<p>Go with Salac Berry if you are going with Substitute, although that may not be necessary since the move you will use the most is Extreme Speed. Get some reassurance of a switch and Belly Drum / Extreme Speed away. If you use Hidden Power Fighting, drop 4 Defense EVs for 4 Speed EVs so you remain faster than Adamant Gligar.</p>"},
      "Substitute + Flail": {"description": "<p>Here is where the real damage comes into play. The Quick Attackers and Extreme Speeders in UU rip this to pieces. However, this thinking has led few people to use a Pokemon with Flail / Reversal in UU, meaning people have let their guard down as far as having Quick Attackers goes.</p>"},
      "Choice Band": {"description": "<p>Sweep a tad with your Choice Band, and when they least expect it, Trick their Walrein or Skarmory with it and screw it for the rest of the match. I don't suggest going with the non-Trick version, but Extreme Speed + Trick is illegal. Flail is really just filler, in case you want Extreme Speed. Even at 35.4% HP, Flail has the same power as Extreme Speed, and it gets more at 20.8% health (100 power), rising again to 200 power if you are lucky enough to take hits that bring you down to 4.2% health. Surf lets you 2HKO Golem if you want to use Extreme Speed and don't want to use Flail, but it's mostly filler.</p>"}
    }
  },
  "Ninjask": {"sets": {"Swords Dance": {}}},
  "Sableye": {
    "overview": "<p>Sableye's unique type combination makes it have no weaknesses. This, however, is overshadowed by its low HP and defensive stats, meaning all neutral hits still do serious damage. Outside of Knock Off and Recover, its movepool is severely lacking. It can still abuse immunities and Recover, however, to help wall a few Choice Band Pokemon, and Knock Off is a rare and very useful move.</p>",
    "comments": "<h3>Other Options</h3> <p>Well, Sableye isn't exactly the Pokemon you look forward to if you're looking for a myriad of attacks. Night Shade covers Gengar, Dusclops, and Misdreavus to an extent. Torment and Taunt are fun moves to use, particularly when combined with Toxic. Substitute is some random move that can be put there.</p> <h3>EVs</h3> <p>Not much you can do with Sableye here. Think about its HP and defenses on any set you're planning to make.</p> <h3>Checks and Counters</h3> <p>Any Pokemon with decent offense and the ability to hit Sableye for neutral damage can counter it, but all Pokemon have to beware of losing their item to Knock Off. After you switch one Pokemon into Sableye, that should be your general switch-in for the rest of the match, to limit the effectiveness of Knock Off. Don't get too predictable with this, however, or the Sableye user can abuse your obvious switches to get in a real heavy-hitter like Electabuzz or Hitmonlee.</p>",
    "sets": {
      "Knock Off": {"description": "<p>Standard set to most people. Knock Off every Pokemon's item and just take care of them with Toxic. Seismic Toss covers for its terrible offenses, while Recover is there to help its below-average defenses by healing and stalling out with Toxic. Its type combination helps this set a little, seeing as it has no weaknesses, but don't expect much from Sableye. If it had Will-O-Wisp, it could have been a little better.</p>"},
      "Choice Band": {"description": "<p>Shadow Ball and Focus Punch hit everything at least neutral. Brick Break works to hit stuff that's already in, Fake Out can stop Pokemon at low HP, and Hidden Power Rock hits Fearow and the like hard.</p>"},
      "Calm Mind": {"description": "<p>The move in the third slot is mostly to hit some of the bit physical Pokemon in UU. Water Pulse hits both Aggron and Gligar, for instance. Ice Punch hits Gligar harder and also covers Fearow and random Grass Pokemon. Thunder Punch still hits Aggron for neutral damage, as well as hitting Poliwrath, Tentacruel, and Walrein. Otherwise, just Calm Mind up to block special hits and then start slamming on your enemies with STAB Hidden Power Dark, Recovering off the damage.</p>"}
    }
  },
  "Aggron": {
    "overview": "<p>Aggron in UU is a monster. It scares Fearow and other Choice Band fiends, hurts anything with that awesome Attack stat, and Thunder Waves speedy Earthquake users.</p>",
    "comments": "<h3>Other Options</h3> <p>Aggron is usually too slow for Endeavor, but its immunity to sandstorm makes it interesting for standard play. Aggron can Roar, but it won't beat anything it didn't already. Counter works quite well--it can survive non-STAB Earthquakes or Brick Breaks and Counter them back for an OHKO.</p> <h3>Checks and Counters</h3> <p>Gligar counters Aggron lacking Ice Beam especially well, as does Quagsire. Vileplume could also cause it some troubles, resisting Focus Punches, using Aromatherapy to prevent paralysis from Thunder Wave, and healing off Rock Slide damage with Moonlight. Solrock could wall it for quite a while since Aggron can't really do anything to it, especially if it's Reflecting. A solid tank such as Blastoise pretty much could Rest off anything Aggron has to throw at it.</p>",
    "sets": {"Standard": {"description": "<p>Bring it in on a Choice Banded Normal or Flying hit, get up your Substitute, and start wrecking things. Focus Punch can wear down Waters quickly, STAB Rock Slide hurts in general, and Ice Beam is a nasty surprise for any Ground-type that tries to wall you, especially Gligar.</p>"}}
  },
  "Manectric": {
    "overview": "<p>Manectric is an above average UU, and very underrated by many. However, when you compare it to Electabuzz, it's just entirely outclassed. Stat-wise, it has 5 more base HP and 3 more base Defense at the cost of 25 base Special Defense, and considering that the only Pokemon I'd really be switching either of them into are weakened enemy Electric- and Water-types, Special Defense is more important. In terms of movepool, Crunch is Manectric's only real advantage, whereas Electabuzz has Cross Chop, Fire Punch, Ice Punch, and Psychic.</p>",
    "comments": "<h3>Other Options</h3> <p>Rain Dance in combination with Thunder isn't a recommended strategy but you never know. Thunder Wave to help your team out a bit, but it won't be very effective considering Lanturn, Quagsire, or Meganium are going to be the most common switch-ins, Thief is a novelty option as well, but it could work in cases such as when you want to disable a Pokemon by removing their Leftovers. These options should mostly replace Crunch, because it's not going to be hitting Grumpig and the like much harder than Thunderbolt, anyway.</p> <h3>EVs</h3> <p>The EVs mentioned with the moveset allow you to get 330 Speed, which is a nice Speed to be at in UU considering that there are a lot of Pokemon in the 328-9 region. Instead of maxing Special Attack, by taking 8 EVs from it and moving it into the leftover EVs you got from setting the Speed below its maximum, you achieve a HP that is divisible by four which is very nice to activate your Petaya after 3 Substitutes instead of 4, so you might survive some random Quick Attacks, but being able to Substitute 4 times can also be useful.</p> <p>The IVs given are for Hidden Power Ice. Hidden Power Water should use 30 Attack, 30 Defense, and 30 Special Attack, with 31 everywhere else.</p> <h3>Checks and Counters</h3> <p>Lanturn can often eat a few Hidden Power Grasses and deal Surfs in return. Meganium takes around 2 Hidden Power Ices, and with Light Screen, even more. Quagsire can counter it only if Manectric's Hidden Power isn't Grass. Hypno and Grumpig are listed due to having a great Special Defense, and although they can't take a large amount of Crunches (especially if Special Defense drops occur), they sure won't go down without a fight.</p>",
    "sets": {"Special Sweeper": {"description": "<p>This set is fairly self explanatory. You want to have your HP divisible by 4 so you only need three Substitutes to reach 25%, and when you do, Petaya Berry activates. Proceed to sweep with boosted Special Attack and a nice Speed to boot. Thunderbolt almost everything in sight, Crunch is for Pokemon such as Hypno and Grumpig that can usually wall you if you don't have a super effective attack. The choice of Hidden Power can be a tad tough though. Hidden Power Grass is so you don't get totally walled by Lanturn and Quagsire, and so you can use it on Golem. Hidden Power Ice will hit Gligar however, and now it doesn't get walled by Meganium and other Grass Pokemon. Hidden Power Water hits Gligar harder than Crunch, but not as hard as Hidden Power Ice, as well as being your best bet against Camerupt.</p>"}}
  },
  "Sharpedo": {
    "overview": "<p>Those defenses are just too low. I mean, even Fearow lasts longer. And the amount of weaknesses Sharpedo has doesn't help. But if you're good at predicting switches, using the right moves at the right time, and are just that little bit lucky, you may want to consider Sharpedo. At least you can use it as a Reversal / Flail counter. Must count for something.</p>",
    "comments": "<h3>Other Options</h3> <p>Substitute actually isn't too bad on Sharpedo, if you predict a switch you can get the right move in later on, but Endure helps a lot to make Sharpedo stop Endure and Flail.</p> <h3>EVs</h3> <p>Max out Speed and Attack for the Choice Band set and Special Attack for the Endure set. The last EVs should go into Special Defense, since about the only things Sharpedo can survive are Surf and Ice Beam.</p> <h3>Checks and Counters</h3> <p>Any sort of sweeper puts this shark down for good. If Sharpedo doesn't kill, it will be killed. Watch out in particular for Fearow, Raticate, Raichu, Persian, Primeape, Tentacruel, Electabuzz, Yanma (maybe), Sneasel, Linoone, and Manectric, all around the same speed as this shark, and all able to kill it with relative ease.</p>",
    "sets": {
      "Special Sweeper": {"description": "<p>This reflects the only real use of Sharpedo: abusing Rough Skin. It makes Sharpedo the best Reversal / Flail counter in the game, and every serious UU team should have at least one of these. When something hits 1 HP, Endure the hit. Rough Skin will kill them, and your Salac Berry will activate. Sweep what you can, though you will probably be met by your opponent's Quick Attacker or Mach Puncher.</p> <p>Really, Sharpedo is mainly hit and run and should be played as such. The attacking versatility isn't bad, just hit stuff you can kill, and flee when you can't.</p>"},
      "Choice Band": {"description": "<p>Whichever way you look at it, Choice Banded Sharpedo is not a great Pokemon. Perhaps if it were a little bit faster, it would be useful. But as it is, it's pretty much a slightly slower Fearow with slightly better moves and perhaps the worst defenses in the game... the special version is probably better because you can choose your move every turn, and STAB makes more of a difference than stats here.</p> <p>Well, if you can predict a switch, you can score some use out of him. That attack power is still very high, and combined with Choice Band, you can have a killer on your hands. The likes of Manectric, Banette, Magmar, and maybe Fearow and Aggron will fall in one hit if you select the right attack. Hydro Pump is there as it hits the folk with higher Defense, like Torkoal and especially Gligar.</p>"}
    }
  },
  "Camerupt": {
    "overview": "<p>Camerupt is an oft overlooked Pokemon, capable of stopping some of both the UU metagame's biggest threats. The RestTalk set is probably the most effective set to use in UU, where status runs wild and very few Pokemon can safely switch in. The Choice Band set's effectiveness is dependent almost solely on prediction. The tank set's strength lies in supporting the team. The Pokemon that Camerupt draws in are fantastic, ones that usually are crucial in walling other dangerous Pokemon, and if you use Camerupt to get rid of them you can go for a sweep.</p>",
    "comments": "<h3>Other Options</h3> <p>Eruption can be used just to flaunt how cool a Pokemon Camerupt is (conversely, it can also easily show how pathetic it is), but its other Fire-moves are more reliable.</p> <h3>EVs</h3> <p>For the Sleep Talk set, HP is foregone for Special Defense because the only physical attack Camerupt should be taking is Sludge Bomb from Weezing / Vileplume. Attack investment is needed for some important OHKOs and 2HKOs, as well as giving bulky Water-type switch-ins a nice parting gift.</p> <p>Choice Band Camerupt needs all the firepower it can muster, while the tank set requires a mix of bulk and power.</p> <h3>Checks and Counters</h3> <p>Lunatone and Mantine take Camerupt's STAB like a champ, though a Choice Banded Rock Slide still hurts. Bulky Water-types work, especially since they almost always carry Rest and don't fear Toxic. Hidden Power Water Electric-Types will completely turn the tables on Camerupt as well.</p>",
    "sets": {
      "RestTalk": {
        "description": "<p>Camerupt, with its unique Fire / Ground Typing, walls Electric-Types quite effectively. With the massive EV investment in SpD, even a Zapdos with 383 SpA (the highest of any Electric-Type) only manages to do 24% - 28% with Hidden Power Ice or Grass. Timid Raikou's unboosted Crunch only hits for 23% - 25%, making Camerupt one of the best Calm Mind Raikou counters in the game. Though by far the most effective of its uses, Camerupt's walling potential is not limited to Electric-types. It switches in on Weezing with relative ease, though Sludge Bomb does take its toll. Heal Bell Celebi's Psychic only does 28% - 31%, while Fire Blast hits for 67% - 79%. While Camerupt doesn't exactly wall them, it can be used to beat Jirachi, Jynx, and Alakazam in a pinch. Wish Jirachi has only about a 1% chance of 2HKOing Camerupt with a +1 Psychic, while Camerupt has an 80.7% chance of 2HKOing Jirachi with Earthquake. Jynx and Alakazam miss out on the 2HKO and are both OHKOed by Earthquake.</p> <p>In UU, Camerupt stops, but falls short of beating, the ever popular Hypno + Vileplume combo. Sunny Day + Solar Beam users, barring nasty luck, are shut down, and Victreebel can be walled in a pinch. Ninetales, Manectric, and Electabuzz have no chance of overcoming Camerupt without Hidden Power Water.</p> <p>Rest and Sleep Talk, combined with a sandstorm immunity, gives Camerupt some much needed durability and allows it to completely wall special versions of Gengar. Letting it utilize dual STAB is an obvious choice, with Ground and Fire only being resisted by Flygon, Salamence, Gyarados, Moltres, and Charizard in OU and Mantine, Solrock, and Lunatone in UU. If being used in UU, Fire Blast completely outclasses Flamethrower. However, in OU, you may find your Fire Blast PP getting rapidly depleted by Zapdos, Suicune, and Dusclops, which makes Flamethrower a suitable replacement.</p>"
      },
      "Choice Band": {"description": "<p>A set tailored to the OU environment, though it also works in UU. Many players will give all of one-turn for Camerupt before it either has to switch out or get killed, and Choice Band lets Camerupt make the most out of it. A boosted Earthquake will put major dents in bulky Water-types, while your Fire-move cripples the other half of physical walls. The third move is really just filler, allowing you to stop Gyarados and Salamence from walking all over you if you have good prediction. And even then you could just unleash an Explosion on them, and perhaps open up a sweep for a SubSD Heracross or the like.</p>"},
      "Tank": {"description": "<p>This is basically a diluted, less prediction-based version of the Choice Band set. Power is sacrificed for ease of use and the ability to switch in. The first time Camerupt gets in, the first move it should be using is Toxic. It cripples its most common counters, Water-types, and with Fire Blast and Earthquake looming right overhead, opponents won't take the risk to switch in a Steel-type or something with Natural Cure. Afterwards, Toxic should be withheld unless their originally statused Pokemon can no longer switch in. Explosion gives you the opportunity to wreck another Pokemon on your opponent's team.</p>"}
    }
  },
  "Grumpig": {
    "overview": "<p>Grumpig is pretty cool, but it cannot be used in anything except the UU environment. There, however, it is one of the premier special tanks.</p>",
    "comments": "<h3>Other Options</h3> <p>Counter + Calm Mind is really deadly. Calm Mind, Thick Fat, and Grumpig's naturally high Special Defense will protect it from special attacks, so your opponent will naturally try and use physical attacks on Grumpig. This is where you hit them with Counter, setting you up for an unimpeded sweep. Grumpig can use Toxic to stop enemy Grumpig and Hypno better, but you'll want to pump Speed for this, to make sure you can get in a Toxic before they Substitute. You can Focus Punch with some Attack EVs to hit Kangaskhan and Aggron on the switch. Magic Coat can reflect random status, especially Toxic.</p> <h3>EVs</h3> <p>Focus on Special Attack and HP, and give it a little bit of Speed.</p> <h3>Checks and Counters</h3> <p>For the Trick Band set, bringing in any Choice Bander to take the Trick will send Grumpig running and hamper its usefulness. For the special sweeper set, ironically Trick Band Grumpig or Trick Band anything will stop it dead. Seismic Toss Hypno will also be enough to stop Grumpig from sweeping, unless it has Hidden Power Dark.</p>",
    "sets": {"Special Sweeper": {"description": "<p>Substitute and then proceed to Calm Mind when against other special attackers. The more Calm Minds you get, the harder the Substitute will be to break. Hidden Power Dark is your best bet against enemy Psychics like Grumpig and Hypno, and is usually the best choice. Ice Punch can hit a common physical attacker, Gligar, very hard. It also does a tad more to Fearow than Psychic. Fire Punch is mostly for BL-allowed tournaments to hit Steelix.</p>"}, "Trick + Choice Band": {"description": "<p>Use Trick to get rid of the Choice Band for, hopefully, some Leftovers. Proceed to Calm Mind and attack as you would with the first moveset. You could also use Substitute in that third slot, if you really want.</p>"}}
  },
  "Cacturne": {
    "overview": "<p>It has a great stalling movepool, but really low defensive capabilities. A jack of all trades, master of none. What he has going for him is the element of surprise, and the ability to mess up stall teams to an extent thanks to Leech Seed, Spikes, and Focus Punch. However, any proper offense shuts him down. Hard to use in UU.</p>",
    "comments": "<h3>Other Options</h3> <p>Counter will surprise and kill if it ever works, but Cacturne is really frail so you'll need to pump Defense and HP EVs. Grasswhistle is inaccurate, but can help you set up a Focus Punch or something. He gets Swords Dance as well but besides Dynamic Punch nothing interesting to work with it. He is too slow and fragile for it as well. He has Spikes but there are better Pokemon to do that.</p> <h3>EVs</h3> <p>Cacturne doesn't have the stats to tank efficiently, but to get in that extra layer of Spikes or to make Counter work you'll want to load its HP. Otherwise, focus on the offensive stats you're using. Destiny Bond set obviously needs max Speed to work well.</p> <h3>Checks and Counters</h3> <p>Fearow easily comes in on Grass moves or non-attacking moves and OHKOs with Drill Peck all the time. Thunder Punch and Focus Punch whack him up. Muk carries Sludge Bomb and resists Cacturne's main attacking moves. Gligar doesn't like Special Cacturne hits, but has enough Defense and Fighting resistance to come in easily, as well as a STAB Hidden Power Flying. Scyther resists both Grass and Fighting 4x, has STAB Bug moves for the OHKO, as well as the option to set up for Reversal. Any Fire-type obviously fries Cacturne.</p>",
    "sets": {"Destiny Bond": {"description": "<p>Any attack can be used in the last two slots. The idea is simple: Endure a killing hit to trigger Salac Berry. Destiny Bond will take your opponent down with you if they decide to land the finishing blow. If they don't, alternate Destiny Bond and Focus Punch. The moment they hinder Focus Punch is the moment they go down to Destiny Bond. Hidden Power Ghost is for Ghosts. Cacturne maxes out at 229 Speed (343 after Salac), so you won't be Destiny Bonding before some really fast Pokemon like Crobat or Persian.</p>"}}
  },
  "Altaria": {
    "overview": "<p>Natural Cure Rest is just awesome, and Altaria is the only thing that really gets to pull it off, since all other Pokemon with Natural Cure, even Corsola and Roselia, have Recover or some sort of recovery move. Thanks to Natural Cure, when Altaria uses Rest, it instantly wakes up after switching out. Its defensive stats are great, and it has the support moves to use them. That's why a set with more of a stalling mentality is recommended. However, the Dragon Dance set with Sing can really surprise people when you put their counter to sleep.</p>",
    "comments": "<h3>Other Options</h3> <p>Altaria gained Heal Bell with the XD moves, making it an even better supporter. It can come in to sponge a hit, Heal Bell to cure Toxics, Sleep Powders and whatnot, maybe Rest off any damage taken, and switch out to come back later.</p> <h3>EVs</h3> <p>For Dragon Dancing sets, keep Speed at the magic 200, focus a little bit on Attack, giving it an Adamant nature, even if you're using a Fire-type move, then dump the rest in HP and defenses. For a stalling set, you'll want to take advantage of Altaria's defenses, which are actually her best stats. Give her around 200 Speed, and then max HP, with any remaining EVs going into Defense and Special Defense, with most of the emphasis on Special Defense, as it is not only her greatest stat, but Ice Beam is her greatest fear, and you want to be able to survive it. Give her a Careful nature. That should just about do it for our little cotton soprano here.</p> <h3>Checks and Counters</h3> <p>Your best choices would be Hypno and Grumpig for the special attacker, albeit watch out for Toxics. Blastoise and Walrein pretty much stop Altaria all the time. If it's a Dragon Dancer, just send in your Solrock or Lunatone. Solid high HP Pokemon such as Kangaskhan and Granbull can easily take anything Altaria throws at them, too.</p>",
    "sets": {
      "Staller": {"description": "<p>This is a semi-standard Altaria set for both versions of play. Toxic can be used with Altaria's defenses to stall the opponent out and then heal with Rest, while Flamethrower will hit anything that you can't hit with Toxic (namely, Steel- and Poison-types, especially since many Poisons have a part Grass typing). Hidden Power Grass can be used to hit Water-types in general and Quagsire in particular. Dragon Claw can be used as an attack for the \"Flameclaw\" combo, which nothing resists, but Dragon Claw really isn't going to be hurting much, so it's not recommended. Sing and Toxic don't make a very good combo, generally, so try and use that with Dragon Claw more often.</p>"},
      "Dragon Dance": {"description": "<p>Dragon Dancing Altaria set is pretty much an inferior Salamence, except that Altaria can Natural Rest and hit the road when it knows it's beaten. Put in a Fire-type move if you want to beat Skarmory, but I'd suggest sticking with Rest and just Natural Resting when big bad Skarmory comes in. Fortunately, Skarmory is not in the same metagame as Altaria, and thus won't be seen in Altaria's normal use (UU).</p>"}
    }
  },
  "Cradily": {
    "comments": "<h3>Other Options</h3> <p>It can Confuse Ray if you really feel the need to use the move.</p> <h3>EVs</h3> <p>Lots of HP and Special Defense. If you are using a Mirror Coat version, concentrate on your Attack and Defense stats more.</p> <h3>Checks and Counters</h3> <p>Cradily is acceptable for use in the UnderUsed metagame. In that environment the counters for Cradily are Meganium and Gligar. These two can generally switch into Cradily without fear. Sandslash also can switch into physical Cradily without much trouble. Watch out for Pokemon carrying the move Toxic, especially if you use Recover as your method of regaining health.</p>",
    "sets": {"Physically based": {"description": "<p>Standard Cradily. Toxic foes, Recover off the damage. Cradily is a truly great special sponge, and makes the majority of Electric-types cry for their respective Pokemon mothers.</p>"}, "Staller": {"description": "<p>Industrial strength stalling bullshit. This only works because of Suction Cups, and you'd better hope your opponent doesn't have a Poison- or Steel-type.</p>"}, "Barrier + Mirror Coat": {"description": "<p>Barrier up, and when they give up and attack you with a special attack Mirror Coat it back in their faces.</p>"}, "Specially based": {"description": "<p>Special Cradily. Watch out for Giga Drain's PP.</p>"}}
  },
  "Banette": {
    "overview": "<p>Banette can switch in on a sleep-inflicting move like Sleep Powder; more often than not this will cause a switch, so it can get in a couple hits, a Will-O-Wisp, or a Knock Off. Despite its low Speed and mediocre defenses, Banette is a good UU Ghost-type with its decent Attack.</p>",
    "comments": "<h3>EVs</h3> <p>Banette's will need its Attack maxed out and should have an Adamant nature. You'll want a bit of Speed on this thing, usually, as well, because you don't want it taking a hit from what it's supposed to be killing. For the third set, max Speed and Attack with either Jolly or Adamant can work depending on what you want to outspeed after a Salac boost. Jolly can outspeed basically everything in UU except base 125 Speed Pokemon and above, but you lose the Attack power.</p> <h3>Checks and Counters</h3> <p>Not many things in UU can switch into Banette, but Blastoise, Walrein, and Politoed can hold their own quite well. Meganium can also switch into it, although it can't do anything back directly. Gligar and Golem can take a few hits, but again, watch out for that burn. Muk blocks Knock Off with Sticky Hold, and has decent defenses to take Shadow Balls and Hidden Power Fightings, but unless it has Rest or manages to get up a Substitute, it won't like taking Will-O-Wisp.</p>",
    "sets": {
      "Support": {"description": "<p>Knock Off and attack whenever possible, but it's also fun to burn things. Insomnia can really mess up some Pokemon and provides some easy switch-ins. Unfortunately, this can't be done often with Banette as you can see its defenses are lacking. This is more of an anti-tank Pokemon; if you want to counter sleep inducers, Hypno is probably the safer bet.</p>"},
      "Choice Band": {"description": "<p>Banette's top two attacking moves are self-explanatory. It has such a bad movepool, though, that other attacks are hard to find; even Double-Edge doesn't damage anything more than the other moves, other than the Normal / Flying types and Girafarig. Will-O-Wisp hurts them more, anyway. Hyper Beam and Destiny Bond are both suicide moves, Will-O-Wisp actually does something to physical sweepers, while Toxic can be used to wear down bulky Water-types.</p>"},
      "Salac + Destiny Bond": {"description": "<p>This set works well in UU, and it can catch things off guard. Banette is immune to Quick Attack / Mach Punch, so running Salac Berry should bring no worries. Hit / burn what you can, and then when you think your run is over, Endure and proceed to Destiny Bond that now slower sweeper or wall.</p>"}
    }
  },
  "Absol": {
    "overview": "<p>Absol has a good movepool and great Attack. Too bad its poor defenses and Speed stop it from being better, or it could be a complete monster. Baton Pass is still fun to toy with.</p>",
    "comments": "<h3>EVs</h3> <p>You'll want to focus on Defense and HP on Baton Passing Absol. For the sweeper sets, however, you'll want Attack, and lots of it. Running 264 Speed for Salac variants helps.</p> <h3>Checks and Counters</h3> <p>Your best bet is probably Gligar, unless Absol is using a novelty Ice Beam set. What hinders Absol is that its Speed is so low that even if it could pull something off, Nidoking or Fearow could just switch in and beat it down. Pokemon like Kangaskhan can easily take a hit from the special set and 2HKO it.</p>",
    "sets": {"Swords Dance + Baton Pass": {"description": "<p>This is a Baton Passing Absol. Absol makes a great Baton Passer with Taunt and can hit stuff hard with Shadow Ball. However, you may not find Taunt to be particularly useful in UU, as very few things run Roar there, and so for this reason, you may prefer Hidden Power Fighting. It combos nicely with Shadow Ball to hit everything at least neutrally. Substitute, however, is still useful to stop status effect moves and is a lot easier on prediction than Taunt. It also blocks Explosion and goes well with Baton Pass.</p>"}}
  },
  "Glalie": {
    "overview": "<p>Glalie has a niche in the UU metagame as a Spikes lead on hyper offense teams and as a rare mid-game Spiker with Explosion on bulky offense teams. Although it faces direct competition from prominent Spikers Omastar and Qwilfish, Glalie's niche comes from its pure Ice typing giving it a defensive edge against Electric- and Ground-type attacks from offensive Normal- and Electric-types. Glalie has positive matchups against both other Spikers and Rapid Spinners, giving it good self-sufficiency for winning Spikes wars. Many of Glalie's offensive teammates appreciate the momentum that Glalie provides with the combination of Spikes and Explosion, making it a good Spiker on teams that prefer Glalie's defensive typing. However, Glalie isn't infallible, as any team with an Arcanine can quickly reverse the momentum it generates. This is what separates Glalie from Qwilfish, whose Water typing allows it to resist Arcanine's Fire Blast to safely lay down Spikes while also providing reliable speed control for its team with Thunder Wave, leaving Qwilfish as the preferred hyper offense lead in the modern metagame.</p>",
    "comments": "<h3>Other Options</h3> <p>Glalie can be used as a mid-game Spiker with a specially defensive spread of 252 HP / 236 SpD / 20 Spe and a Careful nature to better switch into Water- and Electric-types. Taunt can be used over Hidden Power Grass to prevent slower foes from using Toxic to put Glalie on a timer, Kangaskhan from using Wish or Rest, or slower Spikers like Omastar from setting up. Ice Beam gives Glalie a STAB option that prevents Flying-type setup sweepers such as Swords Dance Scyther and Gligar from turning Glalie into setup fodder without resorting to Explosion. Icy Wind is a speed control tool to prevent Taunt users from denying Spikes or to lay more layers of Spikes against Pokemon such as Tentacruel and Electabuzz, though Qwilfish is better at speed control through Thunder Wave paralysis. Light Screen allows Glalie to survive special attacks more comfortably and set up on Omastar, Tentacruel, and Ampharos, and it can keep it active for a teammate after using Explosion. Lum Berry gives Glalie a safety net against Toxic and paralysis to let it lay more layers of Spikes without being put on a timer or losing its Speed for a fast Explosion.</p> <h3>Checks and Counters</h3> <p><strong>Arcanine</strong>: Arcanine hard stops Glalie from applying pressure, as it is faster than max Speed Glalie and OHKOes it with Fire Blast. Lead Arcanine can deny Glalie the opportunity to lay Spikes and pressure common switch-ins with Thief if Glalie switches out, while any non-lead Arcanine can limit Glalie to one layer of Spikes before exerting its own offense. If Glalie preemptively uses Explosion turn 1 on the Arcanine switch, this means Glalie has not laid down any Spikes, and Explosion can not OHKO Arcanine after Intimidate, keeping Arcanine healthy to receive Wish passes from Kangaskhan.</p> <p><strong>Solrock</strong>: Solrock's Rock Slide puts a dent into Glalie; Choice Band Solrock can OHKO it, while other variants usually 2HKO it. It is also Spikes-immune, resistant to Explosion, and not easily pressured by Glalie's coverage. Solrock can even safely set up Reflect or Light Screen against non-Taunt Glalie to enable certain setup sweepers.</p> <p><strong>Fighting-types</strong>: Hitmontop is a spinner Glalie has trouble against, as Brick Break puts the fear of a 2HKO into Glalie, while Rapid Spin removes its Spikes. Glalie can explode on Hitmontop after it has laid Spikes, but Intimidate means it will not OHKO, leaving Glalie to need prior chip damage or a revenge killer for Hitmontop. Hitmonlee is an anti-Spikes lead that can OHKO Glalie with Choice Band Brick Break, or use Bulk Up on its Spikes turn or switch-out turns.</p> <p><strong>Haunter</strong>: Haunter makes for a good anti-Spikes lead, as it can Taunt any attempts to lay Spikes and has an immunity to Explosion, leaving Glalie no other option than to switch out, or use the uncommon Ice Beam. Haunter thus makes its own progress by spreading Will-O-Wisps, Thieving any Leftovers, or using Substitute to push itself into Salac/Petaya Berry range and scout the switch-in.</p>",
    "sets": {
      "Spikes": {
        "description": "<h4>Set Description</h4> <p>Glalie safely sets up Spikes against Pokemon such as Omastar, Ampharos, Walrein, and Lanturn with its pure Ice typing and solid 80/80/80 bulk. Explosion breaks a hole in the opposition, severely denting anything that doesn't resist Normal or allowing Glalie's team to play a favorable 5v5. Explosion also comes in handy for removing slower setup sweepers such as Granbull, Slowking, and Curse Muk, which can otherwise outlast teams with great bulk and Rest. Earthquake puts pressure on Poison-types like Qwilfish and Tentacruel, taxing either of them for using Spikes or Rapid Spin, respectively, and allows Glalie to hit Electric-types without resorting to Explosion, breaking Electrode and Manectric's Substitutes to keep them from possibly taking advantage of Glalie. Hidden Power Grass is used to pressure Omastar, limiting the amount of Spikes it puts out while Glalie sets its own and making sure Glalie's Explosion connects on a different target that doesn't resist it.</p> <p>A Jolly nature on lead Glalie ensures it will outspeed leads such as Adamant Kangaskhan and neutral-natured base 85 Speed Pokemon such as Nidoking. A physically defensive spread of 252 HP / 120 Def / 136 Spe with an Impish nature allows Glalie to more effectively set up Spikes against Normal-types, as it can dodge a 2HKO from offensive Kangaskhan's Double-Edge, Bulk Up Granbull's unboosted Return, and an OHKO from Choice Band Granbull's Double-Edge. It also narrowly dodges an OHKO from non-Choice Band Kangaskhan and Granbull's Focus Punch while it sets up Spikes.</p> <h4>Team Options</h4> <p>Offensive Electric-types like Electrode, Manectric, and Electabuzz like Glalie as a teammate, for all their checks take Spikes damage, and they appreciate Glalie's ability to safely set up and use Explosion on Kangaskhan, Ampharos, and Lanturn. Psychic-types like Xatu, Lunatone, and Grumpig love Glalie's Spikes support increasing their offensive presence. They can force switches against positive matchups by taking advantage of Psychic's Special Defense drops and few notable resistances to set up a Substitute or Calm Mind. Arcanine likes Glalie as a partner both because it likes Spikes to help it break through specially bulky walls, and Glalie can wear down Tentacruel with Earthquake as well as using Explosion on other bulky Water-types such as Walrein, Blastoise, Lanturn, and Slowking. In a similar vein, physical wallbreakers like offensive Kangaskhan, Scyther, Granbull, Solrock, Nidoking, and Nidoqueen appreciate Glalie wearing down physical walls like Omastar, Granbull, and Vileplume through Spikes, Hidden Power Grass pressure for Omastar, and Explosion to remove the latter two. Late-game cleaners such as Scyther, Gorebyss, and Rain Dance Omastar are good Spikes partners, appreciating the extra push of Spikes damage to KO bulkier targets.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "EllingtonReborn", "user_id": 619555}], "teams": [{"name": "Quality checked by", "members": [{"username": "Bouff", "user_id": 121672}, {"username": "BigFatMantis", "user_id": 507497}]}, {"name": "Grammar checked by", "members": [{"username": "Milak", "user_id": 262594}]}]}
  },
  "Walrein": {
    "overview": "<p>This is a great alternative to Blastoise and Quagsire in UU, thanks to STAB on Ice Beam, but in an OU game, it's inferior to Lapras, except the Curse set, which is a weaker Swampert. This is one of the most contested UUs, with some respected UU players recommending it be moved to BL due to its ability to tank hits, if that is any indication of its power.</p>",
    "comments": "<h3>Other Options</h3> <p>It can Roar semi-effectively, but there is little to phaze in UU except Grumpig. Icy Wind can stop sweepers with its Speed lowering capabilities. Yawn gives Walrein a phazing move.</p> <h3>EVs</h3> <p>For the Cursing version you will want a good amount of Attack and Special Defense. For the others you might want to concentrate on Defense to take Gligar on. No matter what this won't take on Hitmonlee or other Pokemon with STAB Fighting attacks, so don't even bother (Surf scares away a lot of the Pokemon with Rock attacks). You can't go wrong with some Special Attack; STAB Ice Beam is very threatening. The Encore set uses a bunch of Special Defense to help it take on Calm Mind Pokemon better, but if you want to boost another stat, take it from there first.</p> <h3>Checks and Counters</h3> <p>Snorlax can take its hits all day and rest off the damage, or Curse up with it and win the match up (barring a critical hit) with STAB Normal, Swampert just overpowers it, any Water with Toxic beats Restless versions, Electric Pokemon especially Manectric and Electabuzz make it run, but sometimes have to worry about Earthquake on the switch. Hitmonlee absorbs hits with its huge Special Defense and unleashes STAB Fighting attacks. Hypno beats Walrein without Toxic. Water Absorb Quagsire can overpower those without Hidden Power Grass, but doesn't like being Toxiced.</p>",
    "sets": {
      "RestTalk": {"description": "<p>This thing never dies. Hidden Power Grass is used for other Waters, primarily Quagsire, but Toxic stops the ever common Hypno and Grumpig switches. Ice Beam has STAB and is a generally great attacking type. The defense allows it to switch into even Choice Band Gligar Earthquakes and Rock Slides, and then scare it off with STAB Ice Beam. Surf is another option in the last slot, as it also gets STAB and hits stuff like Aggron.</p>"},
      "Encore": {"description": "<p>You COULD use Rest here, Surf is probably more effective. At least try to Toxic a few things before you die. Encore can be useful to stop Cursers or paralyzed enemies, because otherwise, Walrein is usually too slow to really Encore effectively. A lot of people forget Walrein can Encore, though, so they might try and set up on you.</p>"},
      "Curse": {"description": "<p>Walrein can Curse decently if you are into that stuff. You will want to hit Electrics on the switch or you will be in trouble later on. Ice Beam hits Solrock and Misdreavus for decent damage and with STAB absolutely trashes Altaria. Offensively, Ground and Ice are a very powerful combination. Electabuzz and Manectric are your two biggest enemies here, so you have to try and catch them on the switch with Earthquake. You might not want to give away Curse and Earthquake at first, to lull the Electrics into a false sense of security, and then BAM! Earthquake KO.</p>"}
    }
  },
  "Gorebyss": {
    "overview": "<p>Using Gorebyss with Spikes can work, as the sight of Rain Dance users trigger a switch to Water-types, and Spikes + Hidden Power Grass will hurt. After you do this once your opponent will most likely keep the Pokemon in so you can freely Surf it. Hydro Pump is always an option over Surf, but that accuracy hurts.</p>",
    "comments": "<h3>Other Options</h3> <p>It gets Confuse Ray; if you have luck, you can try it. Maybe it can give you a turn to Rain Dance.</p> <h3>EVs</h3> <p>190 Speed (200 Speed EVs) is needed for the Rain Dancer in UU. You can go lower if you aren't afraid of Electrode and Persian. Max Special Attack, and put the rest in HP. For the Baton Passer, max HP, balance out the defenses, and put Speed wherever to beat something after an Agility (there are tons of things you can do with it).</p> <h3>Checks and Counters</h3> <p>The only way to stop this is using a Water-type with decent Special Defense, like Blastoise or Walrein (Omastar doesn't count, thanks to the part Rock typing). Light Screening Hypno and Tricking with Grumpig can help you. Shedinja is always an option.</p>",
    "sets": {"Rain Dance Sweeper": {"description": "<p>As you can see, Gorebyss has awesome Defense and Special Attack, while having crappy Speed and HP. So let's compare it to its rival, Omastar:</p> <p>HP: 70--Attack: 60--Defense: 125--Special Attack: 115--Special Defense: 70--Speed: 55</p> <p>So Omastar has nearly same Special Attack, 5 less Special Defense, but a solid 15 more HP, which more than covers the Special Defense, and 20 more Defense. Gorebyss lacks the Rock-type, which can be a pain or your lifesaver; no Normal resistance hurts a lot, but Omastar is weak to the common Earthquake. Due to having a pure Water-type, you can't switch Gorebyss in on resistances, as Ice and Water are its only resistances, and you would get Toxiced by the common Waters.</p> <p>Rain Dance boosts your Speed and powers up Surf, turning Gorebyss into an offensive powerhouse.</p>"}, "Baton Pass": {"description": "<p>Baton Passer. Watch out for Electrics and phazers.</p>"}}
  }
}