{
  "Snubbull": {
    "overview": "<p>At first glance, Snubbull seems to have nothing more than average stats and a common typing. However, its bulk, typing, and access to Thunder Wave make it a great utility Pokemon on many teams. Intimidate allows it to switch into and paralyze or KO physical threats that other walls cannot, and it has very high Attack and good coverage that allow it to apply pressure where its more passive contemporaries often cannot. Its mono-Normal typing is excellent due to the lack of consistent Fighting-type Pokemon and moves in the metagame. Despite this, Snubbull will often struggle to switch in a second time when its Sitrus Berry is removed or out of range to be eaten, which usually happens after its first time switching in. Its low Speed and reliance on Intimidate to act as a physical tank can also make it a prime target for revenge killers, including the ever-present Doduo that it tries to check.</p>",
    "comments": "<h3>Other Options</h3> <p>One viable other option for Snubbull is using it as a lead. Lead Snubbull forces leads like Anorith into situations where they cannot simply get off strong attacks freely like they would want. Spikes users don’t struggle much against it, though, and the common lead Wailmer can simply win one-on-one, so it’s not flawless. Key moveset variations include Double-Edge and Heal Bell. Double-Edge is usually run in place of Return to do more damage: for instance, it deals enough damage to consistently pick off chipped Porygon, whereas Return just knocks it into Sitrus Berry range. The recoil damage can even activate Snubbull’s own Sitrus Berry when it’s taken minor damage, but it can also put Snubbull in range of attacks it could otherwise take. Heal Bell improves the Snubbull user’s matchup against common and powerful paralysis spam teams that make use of heavy hitters like Cubone that make quick work of Snubbull, but it’s often not easy to find the turns to use Heal Bell because of the tier’s generally fast pace. Shadow Ball can also be foregone, though it means that Thief will be Snubbull’s only way to deal damage to the tier’s Ghost-types because both Gastly and Duskull have Levitate. A SubPunch set is another more niche option which can surprise KO Porygon 50% of the time; it can even guarantee the KO after minor chip damage from, for instance, a single layer of Spikes. A Choice Band set can similarly surprise an opponent and score KOes Snubbull otherwise could not get on Pokemon like Bagon, Trapinch, and, crucially, Wailmer. Bulk Up is another option to take advantage of Pokemon switching out of Snubbull to get free setup opportunities. These alternate sets do mean that Snubbull loses out on most of its usual utility, however, and its abysmal Speed lets it get revenge killed all too easily.</p> <h3>Checks and Counters</h3> <p><strong>Physical Walls</strong>: Physically defensive Pokemon like Koffing and Duskull can safely switch into the otherwise dangerously powerful attacks that Snubbull likes to shoot off and cripple it back with Will-O-Wisp, Memento, and Thief. Duskull does take significant damage from Shadow Ball, but Koffing is capable of simply outspeeding and outdamaging Snubbull to win one-on-one.</p> <p><strong>Cubone</strong>: Despite being a physical attacker, Cubone still can defeat Snubbull. It not only outspeeds Snubbull, but it cannot be paralyzed by nature of being a Ground-type, and it also isn’t immediately threatened by the damage Snubbull can do to it. Cubone’s presence alone turns Snubbull’s Thunder Wave into a much riskier option because it may allow a free point of entry for such a dangerous Pokemon as Cubone. Cubone’s Bonemerang is also likely to KO Snubbull with minor chip even at -1 Attack.</p> <p><strong>Doduo</strong>: Snubbull is one of the best Doduo switch-ins; however, Doduo is ironically one of the best ways to deal with Snubbull, if it switches in safely. Because Snubbull relies on Intimidate for its physical bulk, it can pretty easily let in Doduo after it makes progress with a KO, which puts Snubbull’s user into an awkward situation where, unless Snubbull is paired with a second Doduo counter, Doduo will likely score a KO. Additionally, any amount of chip damage, such as from Doduo’s strategic Quick Attack on the switch, can put Snubbull in range of Doduo’s Double-Edge even through the Intimidate drop.</p> <p><strong>Faster Revenge Killers</strong>: On a free switch in and with minor chip damage, Snubbull becomes easy pickings for many fast revenge killers, both special, like offensive Wailmer and Abra, and physical, like Choice Band Diglett and Anorith. This can be problematic because many of these threats are ones that, in better condition, Snubbull expects to counter, excepting offensive Wailmer. The opponent can get Snubbull into range of these attacks with Spikes or tactically low-Base Power moves to put Snubbull out of commission defensively.</p>",
    "sets": {
      "Utility": {
        "description": "<p>Shadow Ball hits the Ghost-types that Snubbull’s other moves cannot, OHKOing Gastly and dealing serious damage to Duskull. Thunder Wave offers extremely powerful speed control and team support to slower teams, but it can be eschewed in favor of Earthquake, which allows it to hit Rock- and Electric-types like Larvitar, Chinchou, and Voltorb. Perhaps just as importantly, Earthquake lets it deal chip damage to Porygon and Wailmer that doesn’t knock them into range of eating their Sitrus Berry. Shadow Ball can do the same to just Wailmer, only less consistently. Thief lets Snubbull stay healthy with some consistency and punish anything trying to switch into it by making them much more easily KOed through depriving them of their Sitrus Berry healing, and in Porygon’s case, Thief removes its ability to repeatedly heal using Recycle. 116 HP EVs and 36 Defense EVs are enough to comfortably switch into plenty of physically attacking threats like Diglett, Larvitar, Anorith, and, most importantly, Doduo. Specifically, it lets Snubbull live all but one roll of +1 Larvitar and Diglett’s Earthquake and -1 Choice Band Doduo’s Double-Edge. 196 Attack EVs on top of its high base 80 Attack allow it to directly threaten most of the tier with its STAB Return and do major damage to Rock-, Steel-, and Ghost-types with its coverage options. 36 Speed EVs mostly just cannot be reallocated anywhere more useful, but they do allow it to outspeed common Porygon sets as well as Duskull.</p> <p>Snubbull has two main strengths that lead to easy synergies: its ability to beat major offensive threats like Doduo and Abra, and its ability to spam Thunder Wave. With a reliable Doduo counter in Snubbull on the team, Porygon, for instance, can afford to run Special Defense EVs to improve the team’s matchup against special attackers such as Abra, Staryu, and even Horsea. Stacking multiple Doduo counters on a team like Snubbull and Duskull is another option that can create a situation where the opponent’s Doduo becomes merely a momentum sink for them, giving teammates that are checked by Doduo, like offensive Wailmer, chances to fire off attacks uninhibited. Slower offensive threats like Cubone and Trapinch, as well as really any Pokemon that makes use of Substitute, can also benefit greatly from Snubbull’s presence as a Thunder Wave spammer Paralyzing a Pokemon with extremely high Speed, like Elekid or Abra, can even flip crucial matchups for fast, but not quite fast enough teammates like Doduo, Houndour, Anorith, and the aforementioned offensive Wailmer.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 645476, "username": "Weterpete"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 593128, "username": "grape tylenol"}, {"user_id": 535530, "username": "Gangsta Spongebob"}]}, {"name": "Grammar checked by", "members": [{"user_id": 109385, "username": "aurora"}]}]}
  },
  "Ralts": {"sets": {"Utility": {}}},
  "Duskull": {
    "overview": "<p>Duskull's most significant role in the metagame is as a dedicated check to Choice Band Doduo and other physical wallbreakers such as Cubone. Duskull distinguishes itself in this role from the faster and more offensive Ghost-type Gastly and the more physically bulky Koffing by combining a diverse supportive movepool that includes options such as Memento, Icy Wind, and Will-O-Wisp with enough bulk and the typing to survive attacks that Gastly and Koffing cannot, notably Choice Band Doduo's Drill Peck and Abra's Psychic, respectively. Once revealed, Duskull's Ghost typing deters Self-Destruct and Explosion, while Levitate gives Duskull an immunity to Ground-type moves and allows it to avoid being trapped by Diglett and Trapinch's Arena Trap. These traits make Duskull a niche option on teams that need an answer to Choice Band Doduo's wallbreaking power or appreciate Duskull's ability to guarantee safe setup with Memento for Pokemon such as Bagon and Larvitar. Unfortunately, Duskull is quite passive and slow, so it struggles to make progress if it is against Pokemon it does not check or if it is unable to use Memento.</p>",
    "comments": "<h3>Other Options</h3> <p>Psychic is an option in order for Duskull to more easily deal with a weakened Koffing after coming in on a wrongly predicted Explosion, as Duskull can struggle to dispatch Koffing otherwise. Will-O-Wisp is a potential option on bulkier teams that struggle to deal with more durable physical attackers. Toxic can be used to put common bulky Duskull switch-ins such as Porygon on a timer. Sunny Day and Rain Dance can be paired with Memento in order to enable sun and rain sweepers like Exeggcute and Horsea, respectively.</p> <h3>Checks and Counters</h3> <p><strong>Houndour</strong>: Duskull cannot do anything to Houndour, which can always switch in and threaten Duskull with guaranteed damage from Pursuit or can always OHKO Duskull with Crunch if Duskull has taken any damage.</p> <p><strong>Strong Water-types</strong>: Strong Water-types such as Chinchou, Wailmer, and Staryu present issues for Duskull, as if these Pokemon choose to run Hydro Pump they can threaten to 2HKO Duskull and avoid activating Duskull's Sitrus Berry.</p>",
    "sets": {
      "Defensive": {
        "description": "<p>Early game, this set seeks to take advantage of Duskull's immunities and bulk to act as a check to Choice Band Doduo. Mid-game, it deters the use of Self-Destruct and Explosion and looks to steal an opposing Pokemon's Sitrus Berry. Late-game, it either acts as an emergency measure against an unrevealed Abra or enables a sweeper through Memento. Icy Wind and Ice Beam both 2HKO Doduo. Icy Wind provides utility on forced switches, while Ice Beam cannot miss and always 2HKOes against Cubone. Ice Beam also always 2HKOes Trapinch and specially defensive Diglett that have used their Sitrus Berry. Thief allows Duskull to try to keep itself healthy by stealing Sitrus Berries throughout a match and gives Duskull an option to make progress against Pokemon that are not running Thief. Duskull's bulk enables it to effectively use Memento against all-out attackers such as Diglett to guarantee setup opportunities for its teammates. However, Duskull should avoid using Memento against fast or bulky attackers that run Thunder Wave such as Elekid, Staryu, Chinchou, Snubbull, and Porygon unless its setup partner has a way to avoid being paralyzed. The EV spread gives Duskull the bulk necessary to survive the hits it needs to, making Choice Band Doduo's Drill Peck a 2HKO and unboosted Abra's Psychic a 3HKO, as well as hitting damage thresholds such as the 2HKO on Doduo with its Ice-type move and the OHKO on Abra and Gastly with Shadow Ball.</p> <p>Bulkier Pokemon such as specially defensive Porygon and Snubbull that appreciate Duskull's immunities and defensive profile can form defensive cores with Duskull. Frail offensive threats such as Doduo, Abra, and Gastly appreciate Duskull's ability to take hits for them and steal opposing defensive Pokemon's Sitrus Berries. Setup sweepers such as Bagon and Larvitar also appreciate Duskull's ability to enable their safe setup with Memento. Duskull is incredibly vulnerable to Houndour and cannot do anything to it besides stealing its Sitrus Berry or getting off Memento if Duskull is quite lucky; because of this, Pokemon with access to Arena Trap like Diglett and Trapinch can help Duskull by revenge killing Houndour. Duskull can also struggle against strong Water-types like Chinchou, Wailmer, and Staryu, which are able to put Duskull in range of a 2HKO if they are running Hydro Pump; Duskull cannot do much in return. Running Chinchou helps to combat Staryu and Wailmer, while Duskull's immunity to Ground helps to cover for Chinchou's weakness to it.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 585309, "username": "BlueWollyWog"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 593128, "username": "grape tylenol"}, {"user_id": 535530, "username": "Gangsta Spongebob"}]}, {"name": "Grammar checked by", "members": [{"user_id": 109385, "username": "aurora"}]}]}
  },
  "Koffing": {
    "overview": "<p>An excellent base 95 Defense stat and a lone weakness to Psychic-type attacks let Koffing act as the premier physical sponge of the tier. Levitate further allows Koffing to fulfill its role by providing an immunity to both Spikes and being trapped by Arena Trap from Diglett and Trapinch. It also distinguishes itself from Duskull with its above-average offensive presence and access to Explosion. However, Koffing is held back by its poor special bulk and Speed, meaning it will often be forced out by many of the special attackers of the tier.</p>",
    "comments": "<h3>Other Options</h3> <p>Will-O-Wisp can be used to cripple physical attackers but is hard to fit and struggles into Substitute users. An all-out attacking set with Sludge Bomb, Explosion, and any combination of Fire Blast, Flamethrower, Thunderbolt, and Shadow Ball can be used in the lead slot but is generally inferior to Gastly. Memento is an option over Explosion to give teammates like Bagon and Larvitar an opportunity to set up.</p> <h3>Checks and Counters</h3> <p><strong>Strong Special Attackers</strong>: Abra outspeeds and OHKOes Koffing and can Calm Mind on the switch. Offensive Wailmer and Modest Houndour have overwhelming odds to KO Koffing from full health and can take any hit back barring Explosion.</p> <p><strong>Weaker Special Attackers</strong>: While Koffing can survive attacks from Staryu, Chinchou, Elekid, and Ponyta from full health, it will often fall to these attackers after only some chip, forcing Koffing to use Explosion prematurely in one-on-one situations.</p> <p><strong>Gastly</strong>: Gastly walls Koffing lacking Shadow Ball and OHKOes the physically defensive spread with Psychic. Gastly is able to safely switch into Sludge Bomb and Explosion; however, it has to scout for Shadow Ball from specially defensive variants of Koffing.</p> <p><strong>Magnemite</strong>: Magnemite is immune to Sludge Bomb and takes little from anything else Koffing can throw at it except for rare Fire-type coverage.</p>",
    "sets": {
      "Defensive": {
        "description": "<p>Hidden Power Water hits physical threats such as Anorith, Cubone, Larvitar, and Onix, damaging the former two and OHKOing the latter. Shadow Ball lets Koffing OHKO Gastly most of the time and chunk Duskull. Thief provides Koffing more opportunities to heal after consuming its Sitrus Berry by depriving the foe of its Sitrus Berry. Lastly, Explosion allows Koffing to most notably trade with opposing Koffing, Wailmer, and Porygon. The given bulk investment guarantees that Koffing will survive Double-Edge from Choice Band Doduo, as well as staying around to check attackers like Snubull and Cubone. 76 Speed EVs let Koffing outpace bulky Wailmer and explode before it can move. If running Shadow Ball, an EV spread of 116 HP / 156 Def / 236 SpD with an Impish nature allows Koffing to live Psychic from Gastly and Double-Edge from Choice Band Doduo a vast majority of the time.</p> <p>Porygon is an excellent teammate, as it acts as a blanket check to all the special attackers Koffing fears. Additionally, Koffing takes the burden of checking Doduo off of Porygon, allowing it to invest more in its Special Defense stat. Bulky Water-types such as Wailmer and Chinchou are able to switch into strong Fire- and Water-type attacks from Ponyta, Houndour, and opposing Wailmer. Diglett and Trapinch remove Pokemon that Koffing struggles against, such as Ponyta, Abra, and Elekid. Houndour dominates Abra and runs enough bulk to survive Hidden Power Water unboosted, only losing to Calm Mind into Hidden Power Water. Doduo can benefit from the specially defensive spread luring Gastly, allowing it to click Double Edge freely.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 652526, "username": "Cawil Maxamad"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 588561, "username": "reggg"}, {"user_id": 535530, "username": "Gangsta Spongebob"}]}, {"name": "Grammar checked by", "members": [{"user_id": 109385, "username": "aurora"}]}]}
  },
  "Trapinch": {
    "overview": "<p>Trapinch is a slow but powerful Pokemon that can be used to trap and remove key targets in order to support its teammates. Arena Trap ensures there will be no escape for Trapinch's prey, and its base 100 Attack stat ensures that the opposing Pokemon will be hit hard. Trapinch also has surprisingly decent bulk, allowing it to take hits from Pokemon with super effective coverage like Elekid and Voltorb and Pokemon with high Special Attack stats like Abra, then OHKO them with Earthquake. However, Trapinch is outsped by everything in the metagame, making it incredibly easy for Water-types like Wailmer, Chinchou, and Staryu to come in and revenge kill it.</p>",
    "comments": "<h3>Other Options</h3> <p>Choice Band can be used to amplify Trapinch's already impressive Attack stat and get surprise KOs on unsuspecting foes, and despite its extremely low base Speed, it can still outspeed some key metagame threats such as Porygon, Snubbull, and bulky Wailmer with maximum Speed investment. However, Trapinch is still outsped by most of the tier, and some of these matchups aren't guaranteed to be in Trapinch's favor: it needs the opposing Porygon to be chipped or have its Sitrus Berry removed, as it will be KOed by Ice Beam, and it doesn't secure a guaranteed OHKO versus bulky Wailmer. Thankfully, Trapinch still has the bulk to survive hits from threats such as unboosted Abra and Larvitar, as well as Elekid and Voltorb, but its lack of recovery means it's easily picked off by faster opponents or priority attacks afterwards.</p> <h3>Checks and Counters</h3> <p><strong>Water-types</strong>: Trapinch is outsped by every Water-type in the tier and is unable to survive their STAB attacks.</p> <p><strong>Koffing</strong>: Thanks to its ability Levitate, Koffing is immune to Trapinch's powerful Earthquake and takes very little damage from its other moves. Koffing typically runs Hidden Power Water, which is a 3HKO against Trapinch. While this may sound like pitiful damage, Trapinch's moves do so little to Koffing that Koffing still wins this matchup.</p> <p><strong>Doduo</strong>: Choice Band Doduo is able to OHKO Trapinch with Double-Edge and is also able to OHKO it with Drill Peck if Trapinch has taken any chip damage. Doduo is immune to both Earthquake and Hidden Power Ghost, normally leaving Trapinch with only Quick Attack to hit it. However, it's not a perfect matchup for Doduo, as it must be wary of Rock Slide, which has a 62% chance to OHKO it.</p> <p><strong>Porygon</strong>: Porygon's ability Trace allows it to counter-trap Trapinch. While Trapinch is able to 2HKO Porygon with Earthquake, Porygon usually comes out on top in this matchup. This is because Porygon outspeeds and 2HKOes Trapinch with Ice Beam and is much more likely to have its Sitrus Berry intact thanks to Recycle.</p>",
    "sets": {
      "Trapper": {
        "description": "<p>The HP and Special Defense investment on this set is what allows Trapinch to perform its role effectively as a trapper. With this investment, Trapinch can survive super effective coverage moves from Elekid, Voltorb, and Magnemite and powerful special attacks from Pokemon like Abra, as well as +1 Earthquake from Larvitar, then remove these Pokemon using Earthquake. Notably, Trapinch is able to survive Porygon's Ice Beam, unlike its counterpart Diglett, enabling it to remove Porygon as well if it's in range of Earthquake. Hidden Power Ghost is useful for getting the KO on Gastly and doing good damage to Duskull, but Rock Slide can be considered for a chance to OHKO Doduo. Additionally, running Rock Slide over Hidden Power Ghost frees up some EVs that Trapinch can combine with its otherwise useless Speed EVs to boost any of its other stats by one point; for example, investing these EVs in Special Defense gives Trapinch a good chance to survive a +1 Psychic from Abra. Quick Attack lets Trapinch bypass its abysmal Speed stat to remove weakened foes or get some chip damage off before it faints. Protect is useful for saving Trapinch from a predicted Explosion or Self-Destruct, usually from opposing Voltorb or Gastly, and is also a reliable tool for scouting an opponent's move.</p> <p>Any Pokemon that wants Electric-types such as Elekid, Voltorb, and Magnemite or strong but frail special attackers such as Abra removed will appreciate Trapinch's ability to trap and remove them. In return, Trapinch appreciates a teammate that can come in on Water-types that will likely come in to revenge kill Trapinch such as Chinchou, Wailmer, or Staryu. Trapinch is able to trap and OHKO Diglett with Earthquake, so Pokemon who have poor matchups versus Diglett such as the previously mentioned Elekid, Voltorb, and Magnemite will enjoy having Trapinch as a teammate. Porygon specifically appreciates Trapinch as a teammate for its ability to counter-trap Diglett, as this lets Porygon stay healthy for other matchups. Although it's not as commonly seen in the metagame, Larvitar is trapped and removed by Trapinch even at +1 Attack, so teams looking for a way to deal with Larvitar should look no further than Trapinch.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 593128, "username": "grape tylenol"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 300935, "username": "Kaboom"}, {"user_id": 588561, "username": "reggg"}]}, {"name": "Grammar checked by", "members": [{"user_id": 109385, "username": "aurora"}]}]}
  },
  "Diglett": {
    "overview": "<p>Diglett's Speed tier and access to Arena Trap make it a threat to nearly every grounded Pokemon. It can trap and remove offensive threats such as Abra, Elekid, Chinchou, Ponyta, and Houndour to support its team. Defensively, it may appear underwhelming, but its immunity to Electric and not much need for high Attack investment allow Diglett to invest in bulk to customize what it's capable of trapping. One of its major shortcomings, however, is the ever-present Porygon's access to Trace and Ice Beam to counter-trap. After a successful trap, Water-types such as Staryu and Wailmer are a concern for Diglett as well, with their powerful STAB moves being difficult to switch into, and they do not fear much from Diglett.</p>",
    "comments": "<h3>Other Options</h3> <p>Choice Band allows Diglett to always output the same damage as Liechi Berry without burning through its HP, but being locked into any one of its moves is a massive downside. Sludge Bomb lets Diglett trap and KO chipped Cacnea and Exeggcute, but neither of these Pokemon are common enough to justify the moveslot. Toxic is an alternative to Rock Slide if wearing down Porygon and Duskull is more necessary than coverage for Doduo.</p> <h3>Checks and Counters</h3> <p><strong>Porygon</strong>: One of the most common play patterns in the tier is Porygon coming in on a Diglett after a KO to trace Arena Trap and remove it with Ice Beam. There is virtually no counterplay once Porygon is brought in, but Thief can be used to remove Porygon's Sitrus Berry prior to being KOed.</p> <p><strong>Water-types</strong>: Wailmer, Horsea, and Staryu all come in to revenge kill Diglett and threaten teams with their powerful Water-type STAB moves.</p> <p><strong>Trapinch</strong>: Similarly to Porygon, Trapinch comes in to counter-trap Diglett, being able to preserve its Sitrus Berry against weakened Diglett by using Quick Attack.</p>",
    "sets": {
      "Specially Defensive Trapper": {
        "description": "<p>This EV spread allows Diglett to survive super effective coverage moves from Elekid and Voltorb, as well as Psychic from offensive Abra, letting it switch into and remove them. This is the main purpose of this set, letting Diglett consistently remove these fast threats and support its team. Rock Slide is Diglett's primary way to hit Ground-immune Pokemon and is most commonly used to remove a chipped Doduo and Gastly. Rock Tomb trades damage—now only doing about 50% to Doduo and 32% to Gastly—for the ability to lower the foe's Speed in situations where they try to set up on Diglett, which is useful against Pokemon such as defensive Abra and Bagon. Thief in conjunction with Substitute gives Diglett a way to consistently activate its own Sitrus Berry and steal the foe's. This is especially relevant when Diglett is counter-trapped by Trapinch and Porygon, giving Diglett a way to make progress in a matchup it would typically lose.</p> <p>Diglett makes use of its Speed and Arena Trap to consistently remove a wide variety of threats for its team, making it a good choice for many teams. Pokemon that especially appreciate Elekid and Voltorb being removed, such as Doduo, Staryu, and offensive Wailmer, will pair well with specially defensive Diglett. Strong physical attackers like Doduo, Anorith, and Cubone are able to take advantage of Porygon after Diglett has removed its Sitrus Berry when Porygon comes in to counter-trap. Diglett struggles with healthy Water-types and Ground-types, making Chinchou and Staryu ideal partners for their ability to handle these threats. Porygon specifically is able to counter-trap and remove Trapinch, which otherwise easily removes Diglett.</p>"
      },
      "Offensive Trapper": {
        "description": "<p>Diglett makes use of its Speed to remove a wide variety of threats and aggressively close out games. The Attack EVs allow Diglett at +1 to OHKO Pokemon the more common specially defensive set can't, such as Anorith, Staryu, and bulky Abra, with Earthquake. Defensively, it is capable of surviving an Earthquake from specially defensive Diglett and OHKOing it back with its own. Hidden Power Ghost is the best option for KOing Gastly and dealing respectable damage to Duskull and Exeggcute. Thief and Screech are alternatives to either steal a Sitrus Berry from Porygon and Trapinch or lower their Defense to make Porygon vulnerable to a counter-trap from an ally Porygon or Trapinch. Substitute allows Diglett to lower its HP to activate its Liechi Berry against slower Pokemon, raising its Attack stat to an impressive 21.</p> <p>It is advised to save Diglett for late-game, as the omnipresent Porygon is a sure-fire way to remove it. It struggles to switch into many threats as well. While it has some of the highest damage output in the tier after a boost, Diglett still struggles to OHKO a large portion of the metagame. Spikes from the likes of Cacnea, Snorunt, and Pineco lessen this issue, with the former being capable of switching into the Water-types that threaten Diglett. Porygon removes Trapinch after it comes in to counter-trap Diglett, and when paired with Screech, it can use Trace to counter-trap an opposing Porygon that has traced Arena Trap. Gastly is an ideal partner for taking advantage of Quick Attack users such as Trapinch and Doduo, which revenge kill a low HP Diglett after activating its Liechi Berry.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 300935, "username": "Kaboom"}, {"user_id": 588561, "username": "reggg"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 553008, "username": "Quinn"}, {"user_id": 593128, "username": "grape tylenol"}, {"user_id": 535530, "username": "Gangsta Spongebob"}]}, {"name": "Grammar checked by", "members": [{"user_id": 109385, "username": "aurora"}, {"user_id": 384270, "username": "autumn"}, {"user_id": 558636, "username": "zastra"}]}]}
  },
  "Meowth": {"sets": {"Lead": {}}},
  "Mankey": {"sets": {"Substitute + Reversal": {}}},
  "Abra": {"sets": {"Offensive Calm Mind": {}, "Bulky Calm Mind": {}}},
  "Machop": {"sets": {"Offensive": {}}},
  "Bellsprout": {"sets": {"Sunny Day Sweeper": {}}},
  "Ponyta": {"sets": {"Sunny Day": {}}},
  "Magnemite": {"sets": {"Offensive Utility": {}}},
  "Doduo": {
    "overview": "<p>Doduo is one of LC's most nuclear threats thanks to a naturally high Attack stat compounded with Choice Band, allowing it to OHKO the majority of the tier. Doduo's great Speed stat allows it to reach 18 Speed, which is great for the tier, and it even has Quick Attack to reliably revenge kill faster offensive foes like Diglett and Abra. Doduo's useful Flying typing also prevents it from being trapped by Trapinch and Diglett, making it difficult to revenge kill with these two. Nonetheless, Doduo is not without its flaws. While it is extremely powerful, its poor bulk means that if it can't OHKO an opposing Pokemon, it is likely to be OHKOed back. Doduo is also extremely prediction reliant, because if it does not choose the right move, Ghost-types like Gastly and Duskull easily wall it. Finally, while Doduo's Speed tier is great, being outsped by common threats like Abra, Diglett, Staryu, and Elekid can prevent it from completely steamrolling the opposing team.</p>",
    "comments": "<h3>Other Options</h3> <p>While much more niche, a Substitute set with Liechi Berry and Flail is a possibility, catching foes switching into Doduo off guard. Sky Attack can be run to OHKO Koffing, Duskull, and Porygon if Doduo opts for an Adamant nature, although it is extremely prediction reliant and requires a charge turn. Sitrus Berry can be opted over Choice Band, as Drill Peck + Double-Edge with Sitrus Berry can get surprise KOs on Koffing and Porygon.</p> <h3>Checks and Counters</h3> <p><strong>Faster offensive threats</strong>: Pokemon like Abra, Elekid, and Staryu all outspeed and OHKO Doduo with their STAB moves, while Diglett only needs slight chip from Double-Edge to KO it with Rock Slide. However, Doduo can KO all of them with Quick Attack after slight chip.</p> <p><strong>Ghost- and Rock-types</strong>: Ghost-types like Gastly and Duskull and Rock-types like Anorith and Onix can switch into Doduo's Double-Edge and threaten an OHKO back or use it as setup fodder.</p> <p><strong>Porygon, Snubbull, and Koffing</strong>: Porygon, Snubbull, and Koffing can all take an attack from Doduo and attempt to OHKO it or cripple it with status in return, making them an annoyance.</p>",
    "sets": {
      "Choice Band": {
        "description": "<p>Double-Edge is Doduo's strongest option, allowing it to OHKO threats like Wailmer, Trapinch, and Cubone, although its recoil can be troublesome. Drill Peck is Doduo's best option against Ghost-types like Gastly and Duskull, allowing it to not be completely walled by them as well as letting it target Pokemon like Exeggcute and Cacnea. Quick Attack is a valuable priority move, letting Doduo pick off weakened faster threats like Diglett and Abra. Hidden Power Ground gives Doduo coverage for Pokemon like Larvitar and Magnemite, although Hidden Power Grass is an option to specifically target and OHKO Onix, which otherwise completely counters Doduo.</p> <p>Although Doduo fits on practically every team, it is a particularly great fit on teams looking for a strong physical attacker that can create holes in the opposing team. Trappers like Diglett and Trapinch can remove faster threats like Elekid and Voltorb that Doduo is helpless against. Pokemon like Porygon and Snubbull can just barely survive Doduo's Double-Edge and threaten to KO it back or status it, so Spikes setters like Cacnea and Pineco that can set up Spikes to provide chip damage on these two are extremely appreciated. Checks to Ghost-types like Porygon and Pursuit Houndour can give Doduo an easier time breaking through teams. While fast, Doduo still gets outsped by multiple Pokemon in the metagame like Abra, Diglett, Elekid, and Staryu. Porygon thus makes an excellent partner, as it can spread paralysis for Doduo and trap Diglett.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 567483, "username": "Bella"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 588561, "username": "reggg"}, {"user_id": 553008, "username": "Quinn"}]}, {"name": "Grammar checked by", "members": [{"user_id": 356215, "username": "Clouds"}, {"user_id": 572981, "username": "Aera"}]}]}
  },
  "Gastly": {
    "overview": "<p>Gastly's combination of a diverse offensive movepool, complete with options such as Psychic, Thunderbolt, and Explosion, and ability to hit 18 Speed makes it a potent offensive threat in LC. What sets Gastly apart from other speedy attackers is its rare defensive utility. Its uncommon Ghost typing lets it take advantage of the exceptionally dangerous Choice Band Doduo and provides it with an immunity to Self-Destruct and Explosion. Once revealed, it dissuades the opponent from using this move as long as it isn't KOed. Levitate gives Gastly an immunity to Ground-type moves and lets it avoid being trapped by Diglett and Trapinch's Arena Trap. Finally, it has the right combination of moves and typing to take on one of LC's most threatening Pokemon, Wailmer. However, Gastly is hardly a defensive staple, with it easily OHKOed by common neutral hits like Choice Band Doduo's Drill Peck. Gastly's Speed can also fail it against certain foes, most significantly Abra, which can effortlessly revenge kill Gastly. This gives Gastly competition with Duskull, another Ghost-type with Levitate that can actually beat Abra and isn't OHKOed by Choice Band Doduo's Drill Peck, though Gastly is still generally preferred thanks to its offensive presence generally being more useful in such a fast-paced metagame.</p>",
    "comments": "<h3>Other Options</h3> <p>Destiny Bond can be used to help Gastly trade with its foe, though Explosion is preferred for this role due to its flexibility. Giga Drain and Hidden Power Grass provide coverage for Water- and Ground-types, notably being Gastly's strongest moves against the latter type and Chinchou, excluding Explosion. The latter move healing Gastly can also improve its longevity somewhat. However, Gastly generally doesn't need the recovery, and it already has other moves to hit Giga Drain's targets for good or better damage. Gastly can use Endure and Salac Berry to become a potent sweeper, one that notably is immune to Quick Attack. However, Gastly needs the opposing team heavily weakened, since it can't OHKO many foes, and running Endure forces it to give up coverage. Substitute can let Gastly take advantage of the switches it forces and ease prediction, though the loss of coverage limits its ability to take advantage of Substitute. Gastly can maximize its Special Attack and run a special attacking set using Psychic, Thunderbolt, Giga Drain, and Thief or Substitute, but this set sacrifices a powerful option in Explosion and coverage against Abra and Duskull.</p> <h3>Checks and Counters</h3> <p><strong>Faster Pokemon</strong>: Abra is Gastly's worst matchup, outspeeding and OHKOing it with Psychic, though it is OHKOed by Shadow Ball and Explosion. Staryu also outspeeds Gastly and has high odds to OHKO it with Hydro Pump, though it is OHKOed by Thunderbolt. Elekid and Diglett outspeed Gastly and 2HKO it while only being 2HKOed in return. Gastly can use Explosion to OHKO them, though they both often carry Substitute. Diglett in particular has low odds to OHKO Gastly with Hidden Power Ghost, which becomes a guaranteed OHKO with Choice Band or Liechi Berry.</p> <p><strong>Duskull</strong>: Duskull OHKOes Gastly with Shadow Ball while only being 2HKOed by Gastly's own—which becomes a 3HKO if Duskull still has its Sitrus Berry—and doesn't even lose half its health from any of Gastly's other moves. Additonally, Duskull can switch into Gastly's Explosion while taking no damage. However, Thunderbolt and Psychic can put Duskull in range of being KOed by Shadow Ball without activating Sitrus Berry.</p> <p><strong>Paralysis</strong>: Once paralyzed by a foe like Porygon, Elekid, or Snubbull, Gastly loses one-on-one to the majority of the tier.</p>",
    "sets": {
      "Mixed Offensive": {
        "description": "<p>Psychic is Gastly's most spammable attack, notably hitting opposing Poison-types like Koffing and Gastly super effectively while providing a strong hit against Diglett. Sludge Bomb deals decent damage to mixed bulky attacker Wailmer without activating Sitrus Berry, giving it high odds of being KOed by Thunderbolt afterwards. It also OHKOes Cacnea while having decent odds to do the same to Exeggcute, and it can possibly weaken other targets with its chance to poison. Shadow Ball is an alternative, also giving Gastly high, albeit slightly worse, odds of KOing mixed bulky attacker Wailmer when used before Thunderbolt. It's also Gastly's strongest move with no drawbacks against Duskull and Abra, KOing the former after Thunderbolt or Psychic and OHKOing the latter, though Gastly still loses one-on-one to them. Thunderbolt primarily hits Flying- and Water-types, damaging the aforementioned Wailmer and OHKOing foes like Doduo and Staryu. Thief is an alternative to let Gastly steal a foe's Sitrus Berry after Gastly has used up its own, notably preventing Porygon from using Recycle to stay healthy. Explosion lets Gastly sacrifice itself to OHKO most targets, including extremely bulky ones like Wailmer and Porygon. The given EV spread alongside a Hasty nature maximizes Gastly's Speed while providing enough Attack to OHKO Porygon. 76 Special Defense EVs let Gastly never be OHKOed by mixed bulky attacker Wailmer's Surf, with this matchup also being why Hasty is chosen over Naive. Of what is left over, 36 EVs are used to augment Gastly's Special Attack as much as possible, while the remainder is put into its Defense.</p> <p>Gastly is a natural fit on teams looking for a switch-in to Choice Band Doduo's Normal-type moves and Self-Destruct and Explosion users such as Wailmer, Koffing, and opposing Gastly, on teams that prefer Gastly's explosive offensive power over Duskull's better defenses. Essentially the entire metagame appreciates this support, with teammates unable to outspeed and OHKO these foes like Wailmer and Chinchou especially appreciating Gastly as a teammate. It is recommended that Gastly not reveal itself too early but instead switch in when it's clear the mentioned examples are committing to their Normal-type move. Either way, if the foe sacrifices itself for nothing or Doduo locks itself into a move that does no damage, Gastly will almost always get a KO in those situations. Gastly is also an effective answer to Porygon, as being able to KO it with Explosion is usually an advantageous trade, though players must be wary of not being too predictable and risking the opponent switching in their own Ghost-type. Beyond switching into Self-Destruct, Gastly also reliably handles Wailmer, helping Pokemon that struggle against it like Diglett, Elekid, and Koffing. Gastly primarily struggles with foes that are faster than it, such as Staryu, making a teammate like Chinchou useful at checking it. Gastly has an abhorrent matchup against Abra, being outsped and OHKOed by its STAB Psychic, with Abra even able to switch into many of Gastly's moves. Gastly is generally best off staying in to stop Abra from setting up, and once it's KOed, it can let in a faster teammate, like Elekid or Diglett, or a priority user, like Doduo, to revenge kill Abra.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 535530, "username": "Gangsta Spongebob"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 593128, "username": "grape tylenol"}, {"user_id": 553008, "username": "Quinn"}]}, {"name": "Grammar checked by", "members": [{"user_id": 109385, "username": "aurora"}]}]}
  },
  "Onix": {"sets": {"All-Out Attacker": {}}},
  "Voltorb": {
    "overview": "<p>Voltorb reaches 20 Speed, tying with Elekid and Diglett for the title of fastest Pokemon in the metagame. Thanks to Thunder Wave and Explosion, Voltorb can reliably revenge kill and trade with a large portion of the tier. In addition to its Speed, Voltorb’s strong offensive typing allows it to check powerful threats such as Abra, Doduo, Wailmer, and Gastly. However, Voltorb is held back by the prominence of Diglett and Trapinch and is often forced into using Explosion against them, which in itself is risky: Trapinch sometimes runs Protect, while Diglett can win the Speed tie and KO Voltorb with Earthquake, preventing it from checking the aforementioned Pokemon long term. Voltorb’s damage output can sometimes let it down, with it struggling to break through bulkier Pokemon such as Chinchou, Pineco, and Porygon, especially since Explosion misses the KO against the latter two at full HP.</p>",
    "comments": "<h3>Other Options</h3> <p>Mirror Coat can be used to land surprise KOs against special attackers but is difficult to make use of in practice, as there are not many special attackers that like to stay in against Voltorb. Taunt can deny utility moves like Cacnea and Pineco’s Spikes and Sunny Day from Exeggcute. Rain Dance and Light Screen are viable options to support setup sweepers such as Horsea, Larvitar, and Bagon.</p> <h3>Checks and Counters</h3> <p><strong>Offensive Ground-types</strong>: Unless they have already taken chip damage, Voltorb is forced to use Explosion against Diglett, Trapinch, and Cubone. Voltorb has to win a Speed tie versus Diglett, while Trapinch and Cubone commonly run Protect, meaning Voltorb will have to gamble if it wants to get anything out of these interactions.</p> <p><strong>Electric-resistant Pokemon</strong>: Voltorb’s attacks do very little to Pokemon that resist Electric-type attacks, with its only coverage option being the weak Hidden Power Grass. Cacnea is able to take advantage of this to set up Spikes against Voltorb. Magnemite and Lileep care even less about Voltorb, as they resist Explosion on top of Thunderbolt.</p> <p><strong>Paralysis</strong>: Most of Voltorb’s utility comes from the fact that it is one of only three Pokemon that reach 20 Speed. Once Voltorb is paralyzed, it becomes dead weight and easy setup fodder. Voltorb can use Substitute to block Thunder Wave from opposing Pokemon, however.</p>",
    "sets": {
      "Offensive Pivot": {
        "description": "<p>The Defense investment allows Voltorb to always survive Earthquake from mixed bulky attacker Wailmer. 40 Attack EVs with a Timid nature are used to guarantee that Explosion OHKOes Trapinch and Wailmer. Thunder Wave is Voltorb’s best form of speed control, effectively neutering frail Pokemon that rely on their Speed such as Abra, Anorith, and Gastly. Thief gives Voltorb another option to cripple opposing Pokemon by removing their recovery in Sitrus Berry and using it itself or denying a sweep by removing their pinch Berries. Substitute is used to punish status attempts from slower Pokemon such as Porygon and Chinchou, giving Voltorb a free turn to attack or cripple the opposing Pokemon with Thunder Wave. Hidden Power Grass OHKOes Rock / Ground types such as Larvitar and Onix and lets Voltorb fight Electric-immune Pokemon without committing to Explosion. It is also worth mentioning that Hidden Power Grass into Thunderbolt KOes mixed bulky attacker Wailmer. Finally, Explosion OHKOes most of the tier, preventing troublesome Pokemon like Abra and Bagon from snowballing out of control and allowing it to beat otherwise strong checks in Chinchou and opposing Voltorb. Caution should be taken to avoid using Explosion into a Ghost-type, however.</p> <p>Voltorb pairs well with Pokemon that have trouble with Diglett and Trapinch, such as Houndour, Abra, and Elekid. Voltorb is an appealing target for Diglett and Trapinch, allowing it to force them out early, as well as having the potential to trade with them, albeit unreliably. Elekid in particular forms a potent offensive core with Voltorb, overloading their shared checks and smothering offense with their Speed and support options, like Light Screen and Thunder Wave. Wailmer is a good teammate, as it can struggle into Doduo, Staryu, and Gastly, and is a great switch-in to the Ground-types that will inevitably trap and remove Voltorb. Voltorb has strong synergy with Cacnea, as it can use Spikes against Diglett, Cubone, Trapinch, and Chinchou lacking Ice Beam. Voltorb in turn switches into Doduo locked into Drill Peck. Lastly, (add comma) Porygon and Trapinch can reliably remove Diglett in the event that Voltorb loses the Speed tie and remain healthy enough to check Abra or Elekid later in the match.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 652526, "username": "Cawil Maxamad"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 535530, "username": "Gangsta Spongebob"}, {"user_id": 593128, "username": "grape tylenol"}]}, {"name": "Grammar checked by", "members": [{"user_id": 109385, "username": "aurora"}]}]}
  },
  "Exeggcute": {"sets": {"Sunny Day Sweeper": {}}},
  "Cubone": {
    "overview": "<p>Cubone's gargantuan Attack stat when holding Thick Club makes it one of LC's most powerful offensive threats, with very few foes not being OHKOed by it. Beating nearly every foe slower than it and many faster foes that cannot OHKO it, Cubone is effective at removing key pieces of the opposing team with great consistency. However, Cubone's inability to hold Sitrus Berry makes its longevity notably worse than most Pokemon in the metagame, and it's not very fast, making it extremely easy to revenge kill even by ADV LC standards. Some threats like Staryu and Chinchou can even outspeed and OHKO Cubone. While no foe is immune to its combination of Bonemerang, Double-Edge, and Hidden Power Ghost, most teams have at least one Pokemon immune to each of those moves, making it somewhat easy to pivot in a check. Thus, Cubone is a high-risk, high-reward Pokemon, with players having to carefully manage its limited longevity to make the most of its wallbreaking prowess.</p>",
    "comments": "<h3>Other Options</h3> <p>Earthquake has perfect accuracy, though Bonemerang is preferred because it's stronger, notably hitting Porygon and Wailmer for better damage ranges, and it can take advantage of Substitute. A single use of Swords Dance lets Cubone OHKO the entire metagame, though Cubone is rarely left wanting for power and generally prefers attacking its target. 240 Defense EVs can allow Cubone to reliably tank Doduo's Double-Edge, though the loss in Cubone's Speed and power generally makes this not worth it. Rock Slide OHKOes Flying-types and hits Ghost-types, though the fact that it doesn't reliably 2HKO Duskull makes it only really useful as a midground against Gastly, and Grass-types still mandate the use of Double-Edge. Rock Tomb can make faster checks such as Gastly and offensive Cacnea slower than Cubone if it hits them as they switch in, letting Cubone outspeed and finish them off next turn.</p> <h3>Checks and Counters</h3> <p><strong>Faster Water-types</strong>: Staryu, Chinchou, and fast variants of Wailmer can outspeed and OHKO Cubone, with it able to do nothing back.</p> <p><strong>Doduo</strong>: Choice Band Doduo can outspeed and OHKO Cubone with Double-Edge, though Protect can let Cubone safely scout which move Doduo will lock itself into and bring in an appropriate teammate.</p> <p><strong>Revenge Killers</strong>: After some chip damage, faster foes such as Elekid, Voltorb, and Diglett can revenge kill Cubone, exploiting its inability to heal using Sitrus Berry.</p> <p><strong>Porygon</strong>: Cubone cannot OHKO Porygon without Spikes support, while Porygon can OHKO back with Ice Beam. Even if Porygon fails to OHKO Cubone due to damage rolls or it lacking Ice Beam, it can still tank another attack if it is holding a Sitrus Berry.</p> <p><strong>Cacnea</strong>: Offensive variants of Cacnea can outspeed Cubone, tank Bonemerang, and OHKO it with Hidden Power Grass, though they must be wary of being OHKOed by Double-Edge.</p> <p><strong>Explosion Users</strong>: Gastly can outspeed and OHKO Cubone with Explosion, while Pineco can tank any attack from Cubone and do the same. However, both must be wary of Protect, and Pineco must watch out for Substitute, since it is slower.</p>",
    "sets": {
      "Offensive": {
        "description": "<p>Bonemerang OHKOes nearly every neutral target and can break Substitute while dealing considerable damage, preventing foes such as Petaya Berry Elekid from setting up. Double-Edge targets Flying- and Grass-types such as Cacnea and Doduo, as well as being Cubone's strongest attack against Koffing. Hidden Power Ghost targets Gastly and Duskull, which are immune to Cubone's other attacks. It also reliably OHKOes Exeggcute. Protect lets Cubone scout which move Choice Band Doduo will lock itself into and can help it play around Explosion users like Gastly and Voltorb. Substitute lets Cubone take advantage of switches it forces, notably easing prediction on whether or not the opponent will switch to a Ground-immune foe. The given EV spread maximizes Cubone's Attack and Speed and dumps the rest into bulk. An Adamant nature lets Cubone have a 50% chance of OHKOing Porygon after one layer of Spikes, and a 100% chance after two layers. Jolly is an alternative, only having a 56.3% chance of OHKOing Porygon after two layers of Spikes, though it allows Cubone to Speed tie Modest Magnemite, giving Cubone a chance to beat it without taking damage. Rock Head lets Cubone use Double-Edge without taking recoil.</p> <p>Cubone best fits on teams looking for a wallbreaker that can reliably remove bulky defensive pieces like Wailmer and Snubbull. Teammates such as Elekid, Staryu, and Abra appreciate its ability to remove these foes. Cubone also matches up decently well against faster threats like Abra, Diglett, and Elekid, helping teammates like Doduo and Gastly. Against faster threats, Cubone can notably switch into them when they use physical attacks and status moves like Substitute and still win one-on-one. Cubone pairs nicely with Doduo, with both of them able to weaken or remove their shared checks in Ghost-types. Spikes support from a teammate like Cacnea or Pineco is recommended if running an Adamant nature, letting Cubone reliably take out Porygon. Cubone struggles the most against faster Water-types in Staryu and Chinchou, which are among the few Pokemon that can outspeed and OHKO it. In the event that Cubone is still needed, a teammate such as Porygon or one's own Chinchou can check these foes. Wailmer is a standout answer to these Water-types, being able to switch into their STAB moves and either beat or trade with them. Additionally, Electric-types like Elekid and Voltorb can check the frailer Water-types for Cubone. These Electric-types, as well as Snubbull, can also make Cubone's middling Speed less of an issue against faster threats by spreading paralysis. Choice Band Doduo can outspeed and OHKO Cubone, and while Protect mitigates the prediction game, a teammate that can switch into Double-Edge like Porygon or Gastly can help play around Doduo. Cubone is also a solid lead, matching up well against Elekid, Voltorb, and slower leads such as Wailmer. However, it is quite risky, losing to others such as Staryu and Chinchou, making the aforementioned checks to them useful. Players must also be wary of Wailmer running Speed investment to outspeed Cubone.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 535530, "username": "Gangsta Spongebob"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 300935, "username": "Kaboom"}, {"user_id": 588561, "username": "reggg"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}, {"user_id": 109385, "username": "aurora"}]}]}
  },
  "Horsea": {
    "overview": "<p>Horsea functions as a powerful Swift Swim sweeper that uses its powerful rain-boosted STAB moves to OHKO most of the tier while outspeeding every unboosted foe while under rain. It's commonly used to clean up the game after the opponent's team has been weakened. However, outside of rain, it has painfully mediocre power, bulk, and Speed. Setup opportunities can be difficult to find, as Substitute is a common move and can be used to stall out rain turns. Horsea’s poor Special Defense leaves it prone to being OHKOed by fast special attackers, as well as limiting its opportunities to set up. Rain Dance support from a teammate can mitigate this, but such support typically requires the teammate to sacrifice itself, which reduces the amount of rain turns available to Horsea.</p>",
    "comments": "<h3>Other Options</h3> <p>Petaya Berry allows Horsea to OHKO Water-types like Staryu with Hidden Power Grass and consistently OHKO Porygon in rain; however, Horsea then loses the longevity offered by Sitrus Berry. Without Sitrus Berry, Horsea loses opportunities to set up by itself and can more easily be picked off by priority attacks. Horsea can use Lum Berry and Substitute to help avoid Thunder Wave, but Lum Berry gives up Sitrus Berry as well and Substitute takes away a valuable moveslot. Using Substitute can take away one of Horsea’s coverage moves or force it to rely on using Hydro Pump and risking potential misses.</p> <h3>Checks and Counters</h3> <p><strong>Water-types</strong>: Water-types such as Chinchou, Wailmer, and Staryu are able to easily tank Horsea's STAB moves even under rain, while Horsea is unable to OHKO these Pokemon with Hidden Power Grass. Staryu and Chinchou always OHKO Horsea with Thunderbolt, while Wailmer can 2HKO Horsea with Hidden Power Grass.</p> <p><strong>Porygon</strong>: Porygon has a 75% chance to survive a Hydro Pump under rain and can invest in Special Defense in order to always survive. With Spikes support, however, Horsea always OHKOes Porygon while under rain. It's also able to hinder Horsea with Thunder Wave.</p> <p><strong>Grass-types</strong>: Cacnea, Lileep, and Exeggcute are able to survive Horsea's Hydro Pump under rain. Lileep and Cacnea can threaten to OHKO Horsea with Hidden Power Grass or Giga Drain. Exeggcute can use Sunny Day to cancel Rain Dance and then OHKO Horsea with Solar Beam. However with Spikes support, these three can be OHKOed by Ice Beam.</p> <p><strong>Fast Special Attackers</strong>: Horsea has a pitiful Special Defense stat and can easily be picked off by fast special attackers like Abra, Gastly, and Elekid. However they can all be OHKOed under rain by Horsea's Hydro Pump.</p>",
    "sets": {
      "Rain Sweeper": {
        "description": "<p>Horsea runs 15 Speed in order to outspeed and OHKO Larvitar and Cubone outside of rain while being faster than everything besides 20 Speed Pokemon with a Salac Berry boost while in rain. A Modest nature is used to maximize Special Attack, as the extra Speed from a Timid nature isn't needed. Horsea invests in Defense because its Special Defense is too poor to be worth any EVs. The Defense EVs also allow Horsea to set up rain against certain physical attackers like Trapinch and Snubbull. With Hydro Pump, Horsea is able to always OHKO every foe that doesn't resist Water under rain except for Porygon, which has a 75% chance to survive, and Lileep. Surf gives Horsea a weaker but reliable STAB option, allowing it to pick up KOs without the risk of missing. Surf does miss out on guaranteed OHKOs against certain bulky Pokemon like Duskull, Snubbull, and Porygon, though. Ice Beam allows Horsea to threaten Grass types such as Exeggcute and Cacnea but requires prior chip damage in order to OHKO them. Hidden Power Grass allows Horsea to hit Water-types like Chinchou, Wailmer, and Staryu but needs three layers of Spikes in order to OHKO them. Horsea can use Rain Dance to set up rain for itself and can notably use it against physical attackers like Trapinch, Larvitar, and Choice Band Doduo that's locked into anything other than Double-Edge.</p> <p>Horsea requires significant support in order to succeed from sources such as Spikes and teammates using Rain Dance for it. Voltorb is the most common partner and provides great utility options such as Rain Dance, Thunder Wave, and Explosion that help get Horsea safely onto the field. Explosion has the added benefit of automatically ending the turn, preventing the opponent from trying to stall out rain turns. This is important so that Horsea doesn't get KOed or paralyzed when trying to set up itself. Similarly, Duskull and Koffing can use Memento and, while niche, Rain Dance to support Horsea. Wailmer can wear down or potentially remove opposing Water-types with its coverage and Self-Destruct. Spikes support from Cacnea, Snorunt, and Pineco allows Horsea to OHKO Porygon and Lileep with Hydro Pump and OHKO Cacnea and Exeggcute with Ice Beam. Doduo is a strong wallbreaker that softens teams up, which allows Horsea to clean mid- to late-game. Specially defensive Diglett can be used to trap Electric-types like Chinchou, Elekid, and Voltorb that threaten Horsea.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 557247, "username": "Peachy07"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 593128, "username": "grape tylenol"}, {"user_id": 535530, "username": "Gangsta Spongebob"}]}, {"name": "Grammar checked by", "members": [{"user_id": 109385, "username": "aurora"}]}]}
  },
  "Staryu": {
    "overview": "<p>Staryu is a fast and strong presence in the metagame, able to threaten its foes with a strong STAB move in Hydro Pump, excellent coverage in Thunderbolt and Ice Beam, and useful utility options like Thunder Wave and Rapid Spin. Staryu's 19 Speed puts it in the second-fastest Speed tier, allowing it to outspeed almost the entire unboosted metagame. Anorith, Doduo, Gastly, Wailmer, and Houndour are common foes Staryu outspeeds and threatens out, while it is able to Speed tie with Abra and threaten it with Thunder Wave. Staryu makes for a great lead option, matching up well into other leads such as Wailmer, Doduo, Pineco, and Cubone. Staryu does have not have the greatest bulk, however, as it is KOed by Hidden Power Grass from Wailmer, Psychic from Abra, and Return from Snubbull, all after minimal chip damage. Staryu is also outsped by Elekid and Voltorb, both of which are easily able to OHKO it. Staryu also has four-moveslot syndrome, with it unable to fit all of its coverage and utility moves, forcing it to sacrifice key utility options or its performance in certain matchups.</p>",
    "comments": "<h3>Other Options</h3> <p>Staryu can use Surf over Hydro Pump as a more accurate STAB option, but it then loses out on KOs on Pokemon such as Gastly and Magnemite, as well as needing significantly more chip damage to KO Porygon. Staryu can use Illuminate, an ability with otherwise no competitive use, in order to permanently paralyze Porygon, since tracing Natural Cure lets Porygon switch out and be cured of its status. However, giving up an excellent ability in Natural Cure for this one scenario is usually not worth it. Light Screen or Reflect can let Staryu support its teammates and itself, though either move can be hard to fit over its coverage moves or other support options. Recover can be used as reliable recovery, but this is overshadowed by Sitrus Berry letting Staryu heal to full health and is difficult to justify when choosing Staryu's moves because of the fast-paced nature of the tier.</p> <h3>Checks and Counters</h3> <p><strong>Electric-types</strong>: Elekid and Voltorb both outspeed and OHKO Staryu with Thunderbolt and can switch into any of Staryu's moves safely except for Thunder Wave. Chinchou is able to do the same, but it also resists Staryu's Water-type moves and Ice Beam, making it an even better check. However, it must watch out for Staryu sets carrying Hidden Power Grass. Elekid, Voltorb, and Chinchou must watch out for specially defensive Diglett, a common partner to Staryu, which consistently removes them all.</p> <p><strong>Cacnea</strong>: Cacnea is a Spikes user that can OHKO Staryu with Hidden Power Grass, making it difficult for Staryu to remove Spikes. Staryu can threaten Cacnea with Ice Beam, but it will not OHKO it. Cacnea can also use Encore to lock Staryu into Rapid Spin or Ice Beam, enabling switches for its teammates.</p> <p><strong>Wailmer</strong>: Wailmer is a bulky Water-type that can survive even Staryu's Thunderbolt and threaten it back with Hidden Power Grass or Self-Destruct. Specially defensive variants of Wailmer can switch into Staryu's Hydro Pump and still survive a subsequent Thunderbolt, but offensive variants of Wailmer cannot.</p> <p><strong>Diglett</strong>: Diglett can outspeed and remove Staryu once it has taken chip damage, but Diglett cannot switch into Staryu freely for fear of a Water-type move.</p>",
    "sets": {
      "Offensive Utility": {
        "description": "<p>Thunderbolt lets Staryu hit Wailmer, a common foe that resists Water, as well as OHKOing opposing Staryu. Ice Beam threatens to hit other foes that resist Water such as Cacnea and Bagon, while Hidden Power Grass can be used to specifically hit Chinchou, which otherwise walls Staryu. Staryu's excellent coverage options let it threaten almost any would-be switch-in. Staryu is the best user of Rapid Spin in the metagame because of its Speed and ability to beat the tier's spinblockers in Duskull and Gastly. This lets Staryu completely shut down teams that are built upon getting Spikes up. 19 Speed and Thunder Wave allow Staryu many chances to spread paralysis, which is especially important for crippling setup sweepers like Abra, Exeggcute, and Bagon. Natural Cure allows Staryu to be a reliable status absorber, but Staryu has to be wary of Porygon tracing it and doing the same.</p> <p>Diglett and Trapinch are good teammates for Staryu because they can remove Elekid and Voltorb, which are both faster than Staryu and OHKO it with Thunderbolt. Specially defensive Wailmer is also a good option, as it can wear down foes that resist Water, as well as checking Electric-types thanks to its bulk. Pokemon that appreciate paralysis support will also enjoy having Staryu as a teammate; examples include slower, strong threats like Cubone and setup sweepers like Anorith and Abra. Teams that rely on Porygon as their only switch-in to Choice Band Doduo will benefit from Staryu's entry hazard removal, since Porygon can be OHKOed by Double-Edge after one layer of spikes.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 588561, "username": "reggg"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 593128, "username": "grape tylenol"}, {"user_id": 535530, "username": "Gangsta Spongebob"}]}, {"name": "Grammar checked by", "members": [{"user_id": 109385, "username": "aurora"}]}]}
  },
  "Porygon": {
    "overview": "<p>Porygon is a wall that fits naturally onto any competitive LC team: almost no teams will be seen without it. Its natural bulk and support move options allow it to be a check to almost everything while maintaining extended longevity. Porygon's Normal typing is excellent, as Fighting-types and Fighting-type moves are rarely seen in LC. Porygon is also no slouch offensively, as its coverage and STAB moves allow it to deal consistent damage. Its ability, Trace, lets Porygon counter-trap Diglett and Trapinch by copying Arena Trap, allowing it to remove them and support its team further, as well as copying other useful abilities like Natural Cure, Levitate, and Volt Absorb.</p>",
    "comments": "<h3>Other Options</h3> <p>Investing in Special Defense EVs instead of Defense or Special Attack is an option to help versus strong special attackers like Abra, offensive Wailmer, and Horsea. This set should be paired with walls such as Koffing or Duskull to handle physical threats. Offensive Porygon sets are an option but are harder to justify because of Porygon's immense value as a defensive Pokemon. These sets use Agility or Sharpen to boost then use Substitute to avoid paralysis in order to try and sweep teams. These sets benefit from paralysis in order to get more setup opportunities. Toxic is an option to try and chip teams down but can be hard to fit because Porygon already wants other utility options, and paralysis is the typically preferred status condition. Defensive Pokemon like opposing Porygon, Duskull, and Wailmer are good targets to wear down with Toxic.</p> <h3>Checks and Counters</h3> <p><strong>Explosion / Self-Destruct</strong>: With Porygon's natural bulk, the only way to consistently OHKO Porygon is through the use of Explosion or Self-Destruct. Wailmer, Koffing, Exeggcute, Gastly, Voltorb, and Pineco are among the most relevant Pokemon with access to one of these moves.</p> <p><strong>Thief</strong>: The move Thief helps cripple Porygon, either forcing it to use Thief if it wants to heal or eliminating its healing entirely if Porygon is not carrying it. Pokemon such as Diglett, Abra, Duskull, and Koffing will often be seen running Thief.</p> <p><strong>Abra</strong>: With Calm Mind, Abra can start to threaten Porygon very quickly. At +1 Special Attack, Psychic has a chance to OHKO Porygon after one layer of Spikes or minimal chip damage, and at +2, it will always be OHKOed. The defensive Abra set will survive one use of either Return or Double-Edge, giving it more opportunities to set up. Substitute allows Abra to stop Thunder Wave from Porygon trying to cripple it, and Encore can lock Porygon into Recycle or Thunder Wave.</p> <p><strong>Anorith</strong>: With Swords Dance, Anorith is able to almost always OHKO Porygon with Brick Break: it also resists Porygon's Normal-type moves. Anorith can also avoid Thunder Wave with Substitute.</p>",
    "sets": {
      "Tank": {
        "description": "<p>236 HP EVs and 196 Defense EVs with a Relaxed nature allow Porygon to never be OHKOed by Choice Band Doduo's Double-Edge and almost always avoid the OHKO from Cubone's Bonemerang, the two strongest physical moves in the tier. 76 Special Attack EVs allow Ice Beam to always OHKO standard Diglett sets. Return is the more consistent STAB option, while Double-Edge allows Porygon to OHKO non-defensive Abra sets but risk knocking itself out if at low health. In some situations, Double-Edge lets Porygon damage itself to below 50% health, allowing it to heal using its Sitrus Berry. Ice Beam allows Porygon to threaten the many Ice-weak Pokemon in the tier, such as Doduo, Diglett, Trapinch, and Cubone. Thunderbolt can be used to still hit Doduo and get surprise damage against Water-types but has worse coverage in comparison to Ice Beam. Recycle, a move only Porygon has access to in the tier, allows Porygon to fully heal with its Sitrus Berry throughout the game, giving it great longevity. Thief allows Porygon to steal, consume, and potentially Recycle stolen Sitrus Berry in cases where its own has been taken. Thunder Wave is always a useful utility option thanks to how valuable speed control is in LC with Porygon's bulk letting it survive almost any hit and paralyze its foe in return. Trace is an extremely useful ability that allows Porygon to come in on Diglett and Trapinch and trace Arena Trap, but it also has other uses. Tracing Staryu's Natural Cure, Chinchou's Volt Absorb, and Gastly or Duskull's Levitate are all relevant interactions.</p> <p>Porygon pairs particularly well with Pokemon that appreciate Diglett and Trapinch being removed, such as Chinchou, Abra, and Elekid. Teams that do not want to run a more dedicated Choice Band Doduo check, such as Koffing or Duskull, will also appreciate running physically defensive Porygon, freeing up slots for other Pokemon. Porygon appreciates teammates that can help handle special threats like Abra and Elekid. A Pokemon such as specially defensive Wailmer to take hits or Diglett to trap the aforementioned special attackers can be effective. Any team will benefit from running Porygon due to how effective it is as a blanket check to so many Pokemon in the metagame.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 588561, "username": "reggg"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 593128, "username": "grape tylenol"}, {"user_id": 300935, "username": "Kaboom"}]}, {"name": "Grammar checked by", "members": [{"user_id": 109385, "username": "aurora"}]}]}
  },
  "Chinchou": {
    "overview": "<p>Thanks to its Water / Electric typing and ability Volt Absorb, Chinchou compresses a Water- and Electric-type check into one slot, which is extremely valuable in a tier dominated by them like LC. Chinchou has good matchups into fellow Electric-types such as Elekid and Voltorb, as well as Pokemon that can carry Electric-type coverage like Staryu and Gastly. It is also notably is the only Electric-type not trapped by Trapinch. Chinchou is no slouch offensively either, with powerful dual STAB options like Hydro Pump and Thunderbolt. However, Chinchou is held back by one very bad matchup: it is trapped and removed by Diglett, one of the most prominent Pokemon in the metagame.</p>",
    "comments": "<h3>Other Options</h3> <p>Chinchou can become a potent sweeper using the combination of Endure and a Salac Berry, but Endure is difficult to pull off: most teams will have a Pokemon with Quick Attack, a common example being Doduo, as well as Pokemon with Substitute to punish a predicted Endure. Hidden Power Grass is an option to hit other Chinchou for good damage, as well as providing coverage for Water- and Ground-types in the same slot, but is very weak compared to Chinchou's other moves and fails to get any relevant OHKOs. Toxic is another option for spreading status, as some players may value the residual damage over the immediate advantage that paralysis provides. While niche, Toxic is great for forcing defensive Pokemon like Porygon to reconsider how long they want to stay in, and even 1 HP of chip damage can sometimes be the difference between a chance to OHKO and a guaranteed OHKO.</p> <h3>Checks and Counters</h3> <p><strong>Diglett</strong>: Diglett is faster than Chinchou and is able to trap and OHKO it with its ability Arena Trap and Earthquake. Diglett can also take advantage of Chinchou sets that only run Hydro Pump and Thunderbolt as attacking moves, as it can use Substitute repeatedly to fish for a Hydro Pump miss.</p> <p><strong>Exeggcute and Cacnea</strong>: Even if Chinchou is running Ice Beam, Exeggcute can survive Ice Beam from full HP and then set up Sunny Day to OHKO Chinchou with Solar Beam. Exeggcute does have to watch out for Chinchou stalling out sun turns with Substitute, however. Similarly, if Chinchou has Ice Beam, it's capable of doing big damage to defensive Cacnea variants and even OHKOing offensive variants, but it risks a 50% chance to be OHKOed in return by Hidden Power Grass and Giga Drain, respectively.</p> <p><strong>Revenge Killers</strong>: Sitting at an awkward 16 Speed, Chinchou is outsped by Doduo, which can easily OHKO it, Gastly, which can threaten an OHKO with Explosion and Substitute on an incorrect prediction, and Abra and Hidden Power Grass Staryu, which can pick off Chinchou once it's been chipped.</p>",
    "sets": {
      "Offensive": {
        "description": "<p>As always, the choice between Surf and Hydro Pump depends on whether accuracy or power is valued more. Surf provides more consistent Water-type damage, leaving other moveslots open for utility moves. Ice Beam is also a good coverage option against Cacnea, Bagon and Exeggcute, OHKOing offensive Cacnea variants and dealing significant damage to defensive Cacnea variants, Bagon, and Exeggcute. Hydro Pump secures the KO on Gastly and has a good chance to KO Magnemite with the drawback of being less accurate, although it can be run with Ice Beam to ensure Chinchou still has an accurate option to hit opposing Pokemon. Thunder Wave allows Chinchou to spread valuable paralysis for both itself and its teammates to take advantage of but can be dropped if paralysis support is already elsewhere on the team or simply not desired. Substitute serves its usual purpose of easing prediction and fishing for the opposing Pokemon to be fully paralyzed but also notably allows Chinchou to beat Diglett if it comes in on Chinchou behind a Substitute, possibly on an incorrectly predicted Thunderbolt or Thunder Wave.</p> <p>Since Chinchou is vulnerable to being trapped and KOed by Diglett, Porygon makes an excellent teammate, as it can come in and counter-trap Diglett then take it out with Ice Beam. Water-types like Staryu and Wailmer also work, as they will either KO Diglett or force a switch. Elekid and Voltorb, which are also trapped by Diglett, can make great partners for Chinchou alongside Porygon, as once one is trapped, Porygon can be used to counter-trap Diglett, leaving the field open for the remaining Electric-type. Pokemon like Doduo that struggle with fast Electric-types appreciate Chinchou's ability to deal with them. Chinchou is very effective at spreading paralysis, so Pokemon that benefit from paralyzed foes, such as setup sweepers like Abra and Bagon, make good teammates for it as well. Chinchou usually loses to opposing Grass-types, so a teammate that can take them out like Doduo or Houndour is a good idea.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 593128, "username": "grape tylenol"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 535530, "username": "Gangsta Spongebob"}, {"user_id": 300935, "username": "Kaboom"}]}, {"name": "Grammar checked by", "members": [{"user_id": 109385, "username": "aurora"}]}]}
  },
  "Pineco": {
    "overview": "<p>Pineco's access to the rare Spikes alongside Explosion gives it a solid role in the metagame, particularly as a lead. Pineco can set Spikes in the face of many common leads like Wailmer, Elekid, Voltorb, Snubbull, and Cubone and use Explosion to bring a teammate in safely and likely trade with the opponent. Pineco also has the capacity to set Light Screen up to not only provide the potential for more layers of Spikes or room to use Explosion but also bolster a teammate's special bulk, which can be useful for helping setup sweepers and wallbreakers on its team. Pineco also learns Rapid Spin, letting it clear Spikes set by opposing Spikes leads. However, Pineco does have some notable shortcomings, namely its low Speed and inability to exert offensive pressure outside of Explosion. The other two Spikes leads, Cacnea and Snorunt, have better Speed stats and offensive capabilities with solid special coverage options. These traits can make Pineco awkward to use outside of being a lead, but oftentimes a single layer of Spikes and the ability to eliminate an opposing threat with Explosion can set the tempo for the rest of the game.</p>",
    "comments": "<h3>Other Options</h3> <p>Protect allows Pineco to avoid an Explosion or Self-Destruct from the likes of Gastly, Exeggcute, and Wailmer while also letting it scout Choice Band Doduo leads by forcing it to lock into a move. Hidden Power Bug is a STAB option for Pineco that lets it OHKO Cacnea, Abra, and Exeggcute. Giga Drain is an option that hits many common leads such as Wailmer, Chinchou, and Staryu for decent damage while restoring a bit of HP; it also threatens to stifle Larvitar's setup opportunities. Rock Slide is a decently strong move that hits Snorunt and opposing Pineco hard and can discourage switches to Pokemon like Doduo.</p> <h3>Checks and Counters</h3> <p><strong>Doduo</strong>: Choice Band Doduo is a common lead that can threaten to OHKO Pineco immediately, though Doduo does have to be wary of Rock Slide if trying to switch into Pineco later on.</p> <p><strong>Explosion users</strong>: Explosion and Self-Destruct leads such as Gastly, Exeggcute, and Wailmer are dangerous for Pineco, as most of them can blow up to deny Spikes, though Pineco can run Protect to make their Explosion attempts whiff. With how ADV mechanics function, even if Pineco survives an Explosion, it cannot use a move due to the opponent having already fainted.</p> <p><strong>Substitute users</strong>: Many fast offensive Pokemon that run Substitute, such as Diglett, Elekid, and Gastly, can often take advantage of Pineco's relative passivity to either force it out and have a free turn or provoke a premature Explosion to eliminate Pineco.</p> <p><strong>Fire- and Rock-types</strong>: Houndour and Ponyta can easily dispatch Pineco with their STAB moves, though they must be wary of switching into a potential Rock Slide or Earthquake. Anorith can OHKO Pineco if Rock Blast hits three or more times, while Onix and Larvitar can hit hard with Rock Slide, though they should be careful of Giga Drain.</p>",
    "sets": {
      "Spikes": {
        "description": "<p>Pineco is most often seen as a lead for teams, as the immediate layer of Spikes can go a long way in chipping down the opposing team to hit damage thresholds. The listed EV spread lets Pineco survive a full-power Water Spout from Wailmer. Explosion not only provides immense wallbreaking power but also lets Pineco get a teammate in safely after it has set a layer of Spikes. Rapid Spin removes Spikes set by the opposing team, which can be useful for bulkier teams that rely on grounded Pokemon like Porygon and Wailmer to repeatedly handle the myriad of opposing threats such as Doduo and opposing Porygon. Rapid Spin also helps setup sweepers not take extra chip damage upon switching in to more easily clean up. Earthquake is a strong move that can threaten common Electric-type leads, as well as Houndour on the switch. Light Screen shores up Pineco's lacking Special Defense to let it handle many special threats such as Wailmer, Elekid, Staryu, Chinchou, and Houndour, providing more opportunities to set additional layers of Spikes. Additionally, the augmented special bulk from Light Screen gives Pineco more room to use Explosion, letting it safely bring a teammate in while likely trading with the opponent. Hidden Power Ghost is useful to hit Gastly and Duskull, which can otherwise block Rapid Spin and nullify an Explosion.</p> <p>Spikes support facilitates a wide variety of offensive threats by racking up damage on forced switches and bringing opposing Pokemon into KO ranges. Spikes helps Choice Band Doduo and offensive Wailmer immensely in their metagame assault, as they not only force a lot of switches due to their innate damage output, which means racking up Spikes chip damage, but said chip damage also weakens Pokemon such as defensive Porygon that try to withstand their hits into KO ranges. Cubone is another powerful threat that benefits greatly from Spikes support, as it lets it OHKO Porygon. Setup sweepers like Bagon and Larvitar also appreciate the chip damage Spikes provides in order to secure KOs on Pokemon after a Dragon Dance, as well as Pineco's capability to set up Light Screen for them and use Explosion to bring them in safely and widen their setup opportunities. Bagon can survive an Ice Beam from Wailmer and KO with Brick Break followed by Double-Edge at +1 after one layer of Spikes, while Larvitar benefits immensely from Light Screen softening a stray Hidden Power Grass. Elekid's high Speed and coverage threatens many Pokemon and forces many switches, which can give Elekid an opportunity to set up a Substitute while racking up Spikes damage that puts threats into KO ranges, such as specially defensive Diglett into Ice Punch range. Pineco dislikes facing lead Doduo, as its Choice Band-boosted Drill Peck easily OHKOes Pineco. Due to this, having a teammate that can switch into Doduo while threatening it is preferred. Duskull is a great teammate for Pineco, as it is immune to Normal and can tank a Drill Peck from Doduo while threatening it with an Ice Beam or Will-O-Wisp. Duskull's Ghost typing also lets it block Rapid Spin and keep Spikes up. Physically defensive Porygon can also handle lead Doduo and threaten an OHKO with Ice Beam. Magnemite is a sturdy answer to Doduo, as it resists Normal and Flying and can exert solid offensive pressure with its ability to force switches. Houndour can trap Gastly and Duskull with Pursuit to facilitate Pineco's ability to spin and use Explosion undeterred.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 264307, "username": "churine"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 535530, "username": "Gangsta Spongebob"}, {"user_id": 588561, "username": "reggg"}]}, {"name": "Grammar checked by", "members": [{"user_id": 109385, "username": "aurora"}]}]}
  },
  "Houndour": {
    "overview": "<p>Houndour's rare Dark typing and high Special Attack make it among the best checks to one of LC's most threatening Pokemon, Abra. It can survive any unboosted attack from Abra thanks to its immunity to Psychic and proper investment and OHKO back with Crunch. These defensive and offensive traits also make Houndour great at forcing another common foe, Gastly, to trade with it using Explosion. Houndour isn't useless otherwise, with it adept at taking on other foes such as Exeggcute and Duskull, as well as being able to threaten an OHKO on every Spikes setter in the tier. It can even KO Porygon with the combination of Crunch into Fire Blast. However, Houdour does have an abhorrent matchup against much of the metagame. It loses badly to common Water-types like Wailmer and fast attackers like Doduo. Diglett is a notably terrible matchup, because while it cannot switch into Fire Blast, it is an extremely common foe that is able to trap, outspeed, and OHKO Houndour.</p>",
    "comments": "<h3>Other Options</h3> <p>Houndour can run a mixed SubSalac set with Reversal to act as a sweeper, though it is easily revenge killed by Quick Attack Doduo and bulky foes like Wailmer. An Endure + Salac Berry special attacking set can lure in foes such as Anorith and Diglett that would otherwise easily revenge kill Houndour while also attempting a sweep, though this set struggles at this role for the same reasons as the previous set while being even easier to defensively handle. Will-O-Wisp can be used to cripple targets like Porygon and Cubone, notably providing Houndour's teammates with an easier time setting up and trading blows with these foes. Flash Fire seems like a good option to help Houndour take on opposing Fire-types, though Fire-types besides itself are rare, while the omnipresent Porygon can take advantage of Flash Fire. Protect can let Houndour survive Gastly's Explosion and scout the attacks of Choice Band users like Doduo.</p> <h3>Checks and Counters</h3> <p><strong>Arena Trap Users</strong>: Diglett and Trapinch can trap and OHKO Houndour, with the former outspeeding it and the latter generally able to tank any of Houndour's moves.</p> <p><strong>Water-types</strong>: Staryu and Chinchou outspeed and OHKO Houndour. Wailmer is slower than Houndour but isn't OHKOed by any of its moves, while it can OHKO back.</p> <p><strong>Faster Attackers</strong>: Faster physical attackers like Anorith and Doduo can outspeed and OHKO Houndour with little trouble. Others such as Gastly and Elekid can do the same if it has been weakened.</p>",
    "sets": {
      "Special Attacker": {
        "description": "<p>Fire Blast serves as a spammable STAB attack, though Overheat is an alternative whose higher damage ranges let Houndour, for example, always OHKO Koffing and Trapinch after one layer of Spikes. Crunch primarily targets Abra as well as Ghost-types such as Duskull and Gastly. Hidden Power Grass is Houndour's strongest attack against Water-types; it doesn't do substantially more damage than Crunch, but its better damage ranges allow Houndour to deal more damage to Wailmer. It also OHKOes Larvitar. Substitute is another alternative, allowing Houndour to take advantage of switches it forces, the opponent sacrificing a slower foe by switching them in, and a slower foe like Snubbull trying to status Houndour. Pursuit allows Houdour to trap foes it beats such as Abra and Duskull, OHKOing them if they switch out. Thief is an alternative that allows Houndour to steal a foe's Sitrus Berry after it has used its own, notably preventing Porygon from healing using Recycle. Houndour's EV spread maximizes its Special Attack and gives it enough Special Defense EVs to always live offensive Abra's Hidden Power Water. The remainder maximizes Houndour's Speed and then dumps the rest into its Defense. Early Bird is chosen as an ability because Houdour's other ability, Flash Fire, could be copied by Porygon's Trace, granting it an immunity to Houndour's most powerful attack.</p> <p>Houndour is best used as an early- to mid-game progress maker, able to remove foes such as Exeggcute and Duskull, or as a hard answer to Abra. If used in the latter role, Houndour should generally wait until Abra reveals itself, which is usually after a teammate such as Gastly gets a KO. This teammate cannot let Abra set up Calm Mind, because it always OHKOes Houndour with a +1 Hidden Power Water. Houndour can also be used to eliminate Gastly, though typically it trades at best due to Gastly outspeeding Houndour and OHKOing it with Explosion. Even if it isn't running Pursuit, the threat of it and Houndour's high power tend to keep its targets on the field. Houndour's ideal teammates appreciate its ability to eliminate the metagame's Ghost- and Psychic-types, something appreciated by Pokemon such as Gastly, Bagon, and Doduo. Teams that stack multiple Self-Destruct and Explosion users such as Wailmer and Gastly notably appreciate Houndour being able to remove Ghost-types. After eliminating its foe, Houndour will often be revenge killed by Diglett; Porygon can take advantage of this by tracing Diglett's ability and trapping it itself. Trapinch is another trapper Porygon excels at dealing with, though Houndour can OHKO it with Spikes support from a teammate like Pineco or Cacnea. If losing Houndour is too detrimental, it should only be revealed after the Arena Trap users are KOed. Houndour struggles against Water-types; Chinchou and Staryu outspeed and OHKO it, while Wailmer can easily tank any of Houndour's moves and do the same. If faced with them, Houndour is best off weakening them to put them in range of a teammate like Doduo or Elekid.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 535530, "username": "Gangsta Spongebob"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 300935, "username": "Kaboom"}, {"user_id": 588561, "username": "reggg"}]}, {"name": "Grammar checked by", "members": [{"user_id": 109385, "username": "aurora"}]}]}
  },
  "Elekid": {
    "overview": "<p>At a blistering 20 Speed, Elekid is tied for the fastest Pokemon in the metagame with Diglett and Voltorb. This high Speed stat helps it take advantage of its excellent offensive and utility movepools. The wide range of moves Elekid can run makes it difficult to predict but also makes it difficult for Elekid to cover all its bases. Elekid has to choose three of Focus Punch, Thief, Thunder Wave, Ice-type coverage, and Grass-type coverage, so once its set is revealed, the opponent will be able to bring in something that Elekid doesn't have coverage for. Elekid also has to be wary of specially defensive Ground-types such as Diglett, Trapinch, and Cubone, as they survive Ice Punch and Hidden Power Grass and KO Elekid with their STAB moves.</p>",
    "comments": "<h3>Other Options</h3> <p>Elekid already struggles to fit everything it wants into its four move slots, but it does have some other good moves that can be considered. Psychic is an interesting option that can OHKO Gastly and Koffing that may switch into Elekid not expecting it. Quick Attack can be used to pick off Pokemon at low HP—such as after using Endure or using Substitute to reach pinch Berry range—but doesn't accomplish much else. Elekid also has access to Light Screen, although it gains almost no benefit from setting it up, so it's outclassed by other screens setters that can set up dual screens such as Staryu.</p> <h3>Checks and Counters</h3> <p><strong>Trapinch</strong>: Regardless of what set Elekid is running, Trapinch is able to shrug off its attacks. Once Elekid is trapped, Trapinch can OHKO it with Earthquake, although Elekid can chunk it before it goes down using either Ice Punch or Hidden Power Grass.</p> <p><strong>Cubone</strong>: Similar to Trapinch, Cubone can survive any of Elekid's attacks and then break through its Substitute using Bonemerang to OHKO it.</p> <p><strong>Chinchou and Wailmer</strong>: Without Hidden Power Grass, Chinchou and Wailmer are difficult matchups for Elekid. Chinchou takes no damage from Elekid's Thunderbolt thanks to Volt Absorb, meaning Elekid needs to either hit it from behind a Substitute with Focus Punch or rely on Thief and Ice Punch, which deal negligible damage. Elekid is also unable to secure the KO on specially defensive Wailmer variants with Thunderbolt regardless of Special Attack investment. Hidden Power Grass allows Elekid to 2HKO specially defensive Wailmer by getting it into Thunderbolt range without activating its Sitrus Berry, but Elekid needs to be behind a Substitute to avoid being OHKOed by Wailmer's Earthquake.</p> <p><strong>Paralysis</strong>: Like most fast Pokemon in ADV LC, Elekid hates getting paralyzed, as one of its main strengths is its Speed. Elekid can use Substitute to block paralysis from most Pokemon but should still be wary of Thunder Wave from opposing Pokemon that Speed tie with it such as other Elekid and Voltorb.</p>",
    "sets": {
      "Substitute + 3 Attacks": {
        "description": "<p>Elekid's incredible Speed, high Special Attack, and diverse offensive movepool make it adept at forcing switches, letting it take advantage of them by using Substitute. Alongside giving Elekid an extra hit, Substitute also lets it avoid getting paralyzed by slower foes such as Porygon. Ice Punch 2HKOes Ground-, Grass-, and Dragon-types such as Trapinch, Exeggcute, and Bagon, though Elekid usually needs its Special Attack boosted to beat the former type. Thief lets Elekid steal its foe's Sitrus Berry after using up its own item, notably preventing Porygon from healing using Recycle. Hidden Power Grass is an alternative, 2HKOing the only Pokemon in LC that resists both Thunderbolt and Ice Punch in Chinchou. It also puts mixed bulky attacker Wailmer into range of Thunderbolt while rarely triggering Sitrus Berry, allowing Elekid to generally beat it one-on-one if it survives the turn, which is possible if it's behind a Substitute. Sitrus Berry lets Elekid fully heal itself after being brought to low HP, notably allowing it to create more Substitutes. Petaya Berry is an alternative that pairs nicely with Substitute allowing Elekid to safely get itself to low HP, as the Special Attack boost makes Elekid extremely threatening; it becomes able to reliably OHKO foes such as Abra and Wailmer and gains high odds to do so against Chinchou. Static generally isn't very useful due to Elekid's frailty, but it can paralyze a foe like a Speed-boosted Bagon in a pinch.</p> <p>Elekid is effective at exploiting common threats such as Doduo and Staryu by setting up a Substitute as it forces them out, making it pair nicely with teammates vulnerable to them such as Wailmer and Cubone. Elekid can often force in Porygon, with Thief variants adept at ruining its longevity. Elekid struggles to take on Chinchou, especially if it isn't running Hidden Power Grass, making checks to it like Porygon good partners. Elekid's role somewhat varies depending on its item—with Sitrus Berry, it has more mid-game utility, able to stay healthy to repeatedly set up Substitute to keep on attacking the opposing team, while Petaya Berry makes it more of a dedicated cleaner that uses its sheer power to overwhelm its checks. However, Elekid must make sure the time is right for it to start its sweep with Petaya Berry, because even if it can overwhelm a check like Chinchou one-on-one, it can then potentially be revenge killed by a priority user like Doduo or possibly lose the Speed tie against Diglett. It's best for Quick Attack users to first reveal themselves and be eliminated before Elekid reveals itself to start its sweep. Elekid struggles with specially defensive Diglett, which Speed ties with Elekid and can OHKO with Earthquake while almost always surviving one Ice Punch. If Elekid is meant to be its team's cleaner, it's recommended that it is not revealed until opposing Diglett are eliminated by a teammate like Wailmer or Trapinch.</p>"
      },
      "SubPunch": {
        "description": "<p>The highlight of this set is Focus Punch backed by 176 Attack EVs which allows Elekid to beat Diglett as long as Elekid is behind a Substitute. This can be the key to victory in some battles, as players will often send Diglett in on Elekid even when Elekid is behind a Substitute. This is because specially defensive Diglett, the most common Diglett set, will always beat Elekid barring a critical hit or freeze from Ice Punch. 80 Special Attack EVs are used to boost Thunderbolt's damage as well as to ensure a clean 2HKO on Porygon without triggering its Sitrus Berry by using Thunderbolt then Focus Punch. Thunder Wave has great utility and gives Elekid opportunities to fish for the opponent to be fully paralyzed, making it much easier to pull off a Focus Punch. Alternatively, Hidden Power Grass in combination with Thunderbolt allows it to beat common Pokemon such as Chinchou and Wailmer, as well as the more niche Onix, and is worth considering if its team already has paralysis support elsewhere.</p> <p>The two strengths of the SubPunch set are its ability to take out Diglett and its ability to spread paralysis, but it still has some weaknesses to cover. Slow Pokemon like Cubone and setup sweepers like Bagon and Larvitar that can take advantage of the paralysis Elekid spreads to the opposing team are good partners. As previously mentioned, without Hidden Power Grass, this set really struggles with Chinchou and Wailmer. A Pokemon that can handle both of them like Staryu or Porygon makes a good partner for Elekid. Elekid is also still vulnerable to Trapinch and Cubone, so a strong Water-type like Wailmer, Staryu, or Chinchou that can revenge kill Ground-types is a good idea too. Porygon is another good teammate for Elekid, as it can counter-trap and eliminate Trapinch and has a good matchup versus Cubone.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 535530, "username": "Gangsta Spongebob"}, {"user_id": 593128, "username": "grape tylenol"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 553008, "username": "Quinn"}, {"user_id": 593128, "username": "grape tylenol"}, {"user_id": 205631, "username": "BlackKnight_Gawain"}]}, {"name": "Grammar checked by", "members": [{"user_id": 109385, "username": "aurora"}]}]}
  },
  "Larvitar": {"sets": {"Dragon Dance": {}}},
  "Carvanha": {"sets": {"Offensive": {}}},
  "Wailmer": {
    "overview": "<p>Wailmer is an incredible Pokemon in LC, thanks to its great defensive typing, good base stats, and diverse movepool. Wailmer's excellent bulk allows it to tank most hits, highlighted by bulky Wailmer's ability to survive Electric-type attacks from Pokemon like Elekid and Voltorb. Wailmer is no pushover offensively either, as it has base 70 Attack and Special Attack as well as high-Base Power moves like Water Spout and Self-Destruct. Self-Destruct is one of Wailmer's best moves, often letting it take an opposing Pokemon down with it for a neutral or even positive trade if it has managed to pick up one KO already. Wailmer's set diversity makes it difficult to answer, it's able to run a bulky mixed set or a specially offensive set, which both have different matchups and answers. Wailmer makes for a great lead Pokemon due to both its unpredictability and good matchups against much of the tier. Wailmer isn't perfect however, as it notably has problems with Water-types like Staryu and Chinchou; against these Pokemon, it has to rely on the weak Hidden Power Grass in order to do any significant damage without exploding. Wailmer is also slow and outsped by much of the tier's offensive threats, letting Wailmer be revenge killed if it has been weakened.</p>",
    "comments": "<h3>Other Options</h3> <p>A physically defensive EV spread can be used to survive Choice Band Doduo's Double-Edge and Bonemerang from Cubone, letting Wailmer get surprise KOs on both of them. However, investing in Defense makes Wailmer vulnerable to OHKOs from opposing Electric-type Pokemon such as Elekid and Voltorb, without the benefits of the specially offensive set.</p> <h3>Checks and Counters</h3> <p><strong>Chinchou</strong>: Chinchou is the best check to both Wailmer sets, as it can freely switch in on offensive Wailmer and outspeed and OHKO it with Thunderbolt, while it can beat the bulky set by weakening Wailmer with Surf and then KOing it with Thunderbolt.</p> <p><strong>Staryu</strong>: Staryu can easily switch in on Water-type attacks from Wailmer and can threaten it with Thunderbolt and Hidden Power Grass or with paralysis from Thunder Wave.</p> <p><strong>Magnemite</strong>: Magnemite outspeeds bulky variants of Wailmer and can OHKO it with Thunderbolt, but it is slower than offensive Wailmer and can be OHKOed by either Water Spout or Hydro Pump.</p> <p><strong>Doduo</strong>: Doduo threatens to OHKO both Wailmer sets with Choice Band Double-Edge, forcing Wailmer to switch out.</p> <p><strong>Porygon</strong>: Porygon takes little damage from a bulky Wailmer and is only threatened by Self-Destruct, while it can disrupt offensive Wailmer sets with moves like Thief or Thunder Wave.</p>",
    "sets": {
      "Mixed Bulky Attacker": {
        "description": "<p>Bulky Wailmer is an incredible lead Pokemon due to its high bulk that provides with it a positive or neutral matchup against many other leads, such as Staryu, Voltorb, Elekid, and Abra. This set maximizes Special Defense investment for a 93% chance to survive Thunderbolt from two of the strongest Electric-type Pokemon in the tier, Elekid and Chinchou. The Special Defense investment is also generally useful against powerful special attackers in the tier such as Abra and Gastly. Earthquake is a great coverage move to hit Electric-types: with 40 Attack EVs, it lands an OHKO on Elekid while hitting Chinchou hard. Hidden Power Grass is used to hit other Water-types like Wailmer or Staryu. A Sassy nature lets Wailmer achieve maximum Special Defense and maintain the power of its physical moves while still outspeeding Porygon. Self-Destruct is excellent for trading Pokemon, as it is usually used against some of the tier's best Pokemon like Porygon. It can also be used in poor matchups or to sacrifice Wailmer to bring in one of its teammates.</p> <p>One of the few attacks capable of OHKOing Wailmer is Choice Band Doduo's Double-Edge, so Pokemon that can switch into Doduo such as Porygon, Snubbull, Gastly, or Duskull make good teammates. Despite being able to take on Electric-type Pokemon, Wailmer still appreciates Ground-type teammates like Trapinch or Diglett that can trap and remove Electric-types so that Wailmer is not overwhelmed. Wailmer's high bulk allows it to reliably check powerful threats like Abra, which is appreciated by Pokemon like Gastly, Doduo, and Koffing that are all scared out by it.</p>"
      },
      "Specially Offensive": {
        "description": "<p>Wailmer's high bulk and solid offensive movepool make Wailmer a threatening attacker. 196 Speed EVs allow Wailmer to outspeed Pokemon like Cubone, Magnemite, and Snubbull, which outspeed and threaten slower Wailmer variants. Water Spout hits incredibly hard when at full power, boasting a huge 150-Base Power and landing OHKOes on almost anything that doesn't resist the move like Snubbull or Magnemite. Hydro Pump is a backup option if Wailmer is at low HP and can't use Water Spout. Surf is a more reliable move than Hydro Pump but misses out on KOs versus Pokemon like Gastly or Koffing. Ice Beam can hit Pokemon like Cacnea and Bagon that try to come in on Water-type moves. Hidden Power Grass lets Wailmer hit Water-types like Chinchou and Staryu that resist its STAB moves. Self-Destruct can be used to KO an opposing Pokemon if Wailmer is at low HP.</p> <p>This set aims to hit enemies as hard as possible with Water Spout but misses KOs on bulky foes like Porygon, making Spikes setters like Pineco or Cacnea good teammates. Chinchou, Voltorb, and Elekid all outpseed and OHKO Wailmer with Thunderbolt, so pairing Wailmer with trappers like specially defensive Diglett or Trapinch to remove these Pokemon is a good idea. Finally, teams that appreciate strong wallbreakers enjoy Wailmer's ability to create holes in teams with Water Spout and Self-Destruct so that they can clean up with faster threats such as Abra and Staryu.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 605215, "username": "Flou"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 593128, "username": "grape tylenol"}, {"user_id": 588561, "username": "reggg"}]}, {"name": "Grammar checked by", "members": [{"user_id": 109385, "username": "aurora"}]}]}
  },
  "Cacnea": {"sets": {"Offensive Spikes": {}, "Utility Spikes": {}}},
  "Baltoy": {"sets": {"All-Out Attacker": {}}},
  "Lileep": {"sets": {"Defensive": {}}},
  "Anorith": {"sets": {"Swords Dance": {}}},
  "Snorunt": {"sets": {"Spikes": {}}},
  "Bagon": {
    "overview": "<p>Bagon has access to powerful tools like Dragon Dance, a high base 75 Attack stat, and a typing that brings resistances to extremely common Electric-, Fire-, and Water-type moves, meaning it should theoretically find many opportunities to set up. Unfortunately, a few major downsides offset these positive traits. Most Water- and Electric-types in the tier carry either Thunder Wave or Ice-type coverage moves that shut down Bagon, and it has no physical STAB, instead being reliant on a recoilless Double-Edge thanks to its ability Rock Head. This leaves it unable to pose much of a threat at +1 Attack to healthy teams, and even at +2 Attack, walls such as Wailmer or Koffing shrug it off with ease. However, with support in the form of Spikes and teammates capable of wearing down the physical walls of the tier, Bagon can shine as a late-game sweeper.</p>",
    "comments": "<h3>Other Options</h3> <p>Bagon can opt for a spread of 236 Atk / 36 Def / 36 SpD / 196 Spe with an Adamant nature to outspeed the entire unboosted metagame at +1 while hitting as hard as possible. However, this makes it much more difficult to find setup opportunities, with Bagon now being OHKOed by Water-types carrying Ice Beam and Elekid carrying Ice Punch while still being unable to OHKO walls such as Porygon or Wailmer even after an Attack boost. Substitute is an option to avoid status, as well as Self-Destruct and Explosion from the likes of Wailmer and Voltorb, but Bagon is very reliant on all of its coverage moves to clean up teams.</p> <h3>Checks and Counters</h3> <p><strong>Physical Walls</strong>: Porygon, Koffing, and Wailmer present massive issues to a Bagon attempting to sweep, easily tanking +2 Double-Edge and finishing off a worn down Bagon. At +1 Attack, however, it is possible to 2HKO Porygon and Wailmer through proper sequencing of Double-Edge and Brick Break to avoid activating Sitrus Berry.</p> <p><strong>Voltorb</strong>: Voltorb can switch into any of Bagon's attacks at +1, outspeeds it, and can either OHKO Bagon with Self-Destruct or paralyze it with Thunder Wave.</p> <p><strong>Priority</strong>: Attempting to set up Dragon Dance multiple times to sweep will typically leave Bagon in range to get KOed by Meowth's Fake Out and Doduo and Trapinch's Quick Attack.</p>",
    "sets": {
      "Dragon Dance": {
        "description": "<p>The EVs are meant to maximize the amount of setup opportunities for Bagon while taking advantage of its ability to raise its Speed using Dragon Dance. 22 HP and 13 Special Defense allow Bagon to survive Ice Beam from Staryu and Porygon and Ice Punch from Elekid a majority of the time, and 13 Speed allows it to outspeed Doduo and Gastly after a Dragon Dance. Bagon having both one of the highest Attack stats in the tier and access to Dragon Dance makes up for the lack of investment. Double-Edge is the strongest physical move Bagon has access to, and it inflicts no recoil thanks to Rock Head. Brick Break is the best option for hitting Porygon, Magnemite, and or Anorith. Hidden Power Ghost hits Duskull and Gastly, which would otherwise wall Bagon with their immunities to Normal and Fighting. Dragon Dance is one of the best setup moves in the game, and Bagon is able to find opportunities to use it fairly easily against prevalent Pokemon such as specially defensive Diglett, Houndour, and Porygon lacking Thunder Wave. After one Dragon Dance, a healthy Porygon faints to a combination of Double-Edge into Brick Break, the first attack not activating Sitrus Berry and the follow-up attack doing enough damage to KO. Aside from this, frailer Pokemon like Diglett are OHKOed by +1 Double-Edge. After two Dragon Dance boosts, Bagon is able to outspeed the likes of Staryu, Voltorb and Elekid and OHKO them with Double-Edge. Getting two Dragon Dance boosts is far more difficult to pull off, however, as it leaves Bagon vulnerable to priority from Doduo and Trapinch and being revenge killed by walls that it does not OHKO if they are healthy such as Porygon and or Koffing.</p> <p>Bagon should be the focal point of teams it is on, as it needs a lot of support to set up and sweep. Dragon Dance Larvitar is one of the ideal teammates, benefiting from a lot of the same support Bagon enjoys, as well as softening up checks for each other. Duskull with Memento provides more safe opportunities to get Bagon in to set up Dragon Dance. Spikes from Cacnea, Pineco and Snorunt provide necessary chip throughout the game to help Bagon score OHKOs on Pokemon at +1 Attack, though this removes the previously mentioned route to 2HKO Porygon at +1. Diglett and Trapinch switch into and remove Voltorb and Elekid, which could otherwise come in and outspeed +1 Bagon and use either Explosion or Thunder Wave to stop the sweep. Thunder Wave users such as Chinchou and Snubbull can slow down some of the faster Pokemon in the tier, such as Abra and Voltorb, allowing Bagon to always outspeed them.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 300935, "username": "Kaboom"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 593128, "username": "grape tylenol"}, {"user_id": 588561, "username": "reggg"}]}, {"name": "Grammar checked by", "members": [{"user_id": 109385, "username": "aurora"}]}]}
  }
}