{
  "Sceptile": {
    "sets": [
      {
        "name": "Fast Attacker",
        "description": "<ul> <li>Sceptile is faster than all other viable Pokemon in the tier, notably outspeeding maximum Speed Tyranitar after a Dragon Dance and many prevalent base 110s. With its notable coverage options, Sceptile is one of the tier's best revenge killers.</li> <li>Leaf Blade 2HKOes Tyranitar, making Sceptile one of its best offensive checks. Leaf Blade also does significant damage to common Water-types such as Starmie and Suicune, and it notably OHKOes Swampert, which no non-Grass-type does without Explosion.</li> <li>Sceptile 2HKOes Gengar with Crunch while surviving an Ice Punch in return. It also 3HKOes Latias and damages other Grass-resistant Pokemon such as Arcanine.</li> <li>Lum Berry keeps Sceptile safe from Thunder Wave once. Substitute allows Sceptile to block further attempts to paralyze it, which would severely impact Sceptile's ability to pick off slower threats, or absorb Explosions without using Protect, letting Sceptile reliably use Protect the next turn if need be. Furthermore, Substitute can be used to activate Overgrow and consume Petaya Berry, after which Sceptile can OHKO Tyranitar with Leaf Blade and uninvested Gengar with Crunch.</li> <li>Sceptile can also run another coverage option for common checks, such as Hidden Power Ice for Zapdos or Hidden Power Fire for Metagross.</li> <li>Sceptile is frail and performs better in later stages of the game, when its teammates have dealt with Pokemon that Sceptile's coverage misses out on, such as Snorlax and Heracross. Sceptile pairs up well with Explosion users like Metagross and Gengar, which can make up for Sceptile's lacking firepower unless it's landing super effective moves or picking off low-HP foes.</li> </ul> "
      }
    ],
    "credits": {"writtenBy": [{"username": "bunnyy", "user_id": 192134}], "teams": [{"name": "Quality checked by", "members": [{"username": "zee", "user_id": 501951}, {"username": "smudgerox", "user_id": 550367}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  }
}