{
  "Wartortle": {
    "comments": "<h3>Other Options</h3> <p>Specially defensive Wartortle can opt for Hidden Power Grass to match up better against Corsola, Clamperl, and offensive Wartortle, but this is extremely situational. On defensive sets, Haze can remove the boosts from common pinch Berry users such as Beedrill and Anorith. Rapid Spin provides team support, as Spikes tends to wear down common teammates for Wartortle; however, due to how uncommon Spikes is, Rapid Spin is seldom worth dropping a coverage or support move for.</p> <h3>Checks and Counters</h3> <p><strong>Electric-types</strong>: Flaaffy and Magnemite threaten Wartortle with Thunderbolt, while Wartortle is unable to 2HKO either with Surf. Voltorb is worth mentioning, as it not only outpaces Wartortle even after a Salac Berry boost but also 2HKOes Wartortle if it is healthy.</p> <p><strong>Grass-types</strong>: Specially defensive Gloom is the premier Wartortle check, as it can shrug off an Ice Beam and is immune to Toxic. Tropius, on the other hand, is 2HKOed by Ice Beam, meaning it has enough time to use Sunny Day and then Solar Beam to OHKO Wartortle. More niche options such as Sunflora, Lombre, and Weepinbell can also prove to be an issue. However, the former two must be wary of Toxic, while Weepinbell can be dispatched with Ice Beam.</p> <p><strong>Special Wallbreakers</strong>: Clamperl and Porygon can 2HKO Wartortle with Hidden Power Grass and Thunderbolt, respectively.</p> <p><strong>Strong Repeated Hits</strong>: Wartortle is still 2HKOed by Double-Edge from Choice Band Aipom and Doduo despite its physical bulk. Its lack of recovery beyond Leftovers leaves it unable to take many attacks from Choice Band Pokemon.</p> <p><strong>Doduo</strong>: Choice Band Doduo is the only priority user capable of removing Wartortle at 25% HP with its Quick Attack.</p>",
    "sets": {
      "Tank": {
        "description": "<p>Thanks to its solid bulk and mono Water typing, Wartortle functions exceptionally well as a bulky attacker. This allows it to threaten Rock- and Ground-types, cementing it as one of the best answers to Anorith, Onix, and Rhyhorn. Surf threatens the aforementioned Rock- and Ground-types and can be powered up by Torrent to heavily damage bulkier Pokemon like Ariados, Castform, and Mightyena. Ice Beam allows Wartortle to threaten Tropius and physically defensive Gloom. Alternatively, Hidden Power Grass can 2HKO bulky Clamperl and Corsola, which threaten Wartortle. Toxic allows Wartortle to threaten other Water-types such as Seaking, Chinchou, and Wartortle. Refresh maintains Wartortle's staying power, curing status from Pokemon such as Mightyena and Koffing. Protect is required to fully use Wartortle's defensive capabilities, as it allows Wartortle to scout against Choice Band users such as Aipom, Doduo, and Anorith and rack up passive recovery from Leftovers. Wartortle's HP and Defense investment ensures it can force a trade with Choice Band Aipom if it uses Double-Edge; Wartortle wins the matchup if Aipoms opts to go for Return instead. Wartortle's Special Attack investment allows it to always 3HKO max HP Mightyena with no Special Defense investment.</p> <p>Bulky offense and balanced teams greatly appreciate Wartortle's ability to trade with Aipom and check Rock- and Ground-types. However, Wartortle is unable to do both of these jobs simultaneously. For this reason, Wartortle appreciates other physically defensive Pokemon, such as Onix, Mightyena, and Koffing, as teammates. Onix pairs exceptionally well with Wartortle, as it can wall Aipom and threaten Anorith with Rock Slide, while Onix appreciates Wartortle coming in on opposing Water-types. Mightyena threatens and removes specially defensive Gloom, which otherwise completely walls Wartortle. Moreover, Fire-types such as Ponyta and Quilava can also check Grass-types like Gloom and Sunflora. These Fire-types also appreciate Wartortle as a dedicated Rock- and Ground-type check, as it can stomach hits from Onix and Rhyhorn. Physical wallbreakers, including Aipom, Doduo, Volbeat, and Anorith, can threaten and remove specially defensive Pokemon that Wartortle struggles with, such as Porygon, Gloom, Delcatty, and Noctowl. Wartortle also struggles with faster special attackers like Seaking, Flaaffy, and Voltorb, so specially defensive Pokemon like Delcatty, Porygon, and Gloom pair well with it. Delcatty and Wartortle pair exceptionally well together, as Delcatty can pass Wish to Wartortle, improving its overall longevity. Additionally, Wartortle can switch into Rock-types such as Onix and Rhyhorn, which Delcatty lures in. If Wartortle lacks Refresh, then Heal Bell users, most notably Delcatty and Mightyena, pair well with it.</p>"
      },
      "Defensive": {
        "description": "<p>Wartortle's mono Water typing and respectable bulk allow it to excel in defensive roles. Surf allows Wartortle to threaten Koffing as well as Rock- and Ground-types such as Cubone, Onix, and Rhyhorn. Seismic Toss is Wartortle's most consistent attacking move, as it allows Wartortle to chip switch-ins such as Flaaffy, Noctowl, and Porygon, forcing the latter two to use Rest or Recover. Alternatively, Toxic compensates for Surf's inability to chip other Water-types like Seaking and Wartortle, threatens Porygon, and forces Noctowl to use Rest. Refresh allows Wartortle to shrug off burn and poison, which otherwise severely limit its effectiveness in defensive roles. Protect allows Wartortle to gain passive recovery from Leftovers more easily and provides an excellent opportunity to scout Choice Band users such as Seaking, Aipom, and Doduo.</p> <p>Wartortle fits best on balance and bulky offense teams that appreciate a reliable defensive answer to Ponyta. Grounded Double-Edge users such as Aipom and Ponyta appreciate Wartortle's defensive value against Rock- and Ground-types such as Onix, Rhyhorn, and Anorith. In return, these Pokemon check specially defensive foes such as Noctowl and Porygon. Pokemon that can check Flaaffy, such as Onix, Porygon, and specially defensive Gloom, pair well with Wartortle. If Wartortle lacks Refresh, Heal Bell users such as Mightyena, Delcatty, and Flaaffy make good partners. Flaaffy is especially worth noting, as it can threaten Water-types such as Tentacool, Wartortle, and Seaking. Toxic absorbers such as Gloom, Koffing, and Ariados also pair well with Wartortle. Ariados, Gloom, and Koffing are notable teammates, as they heavily appreciate Wartortle's ability to check Fire-types. Pokemon that can check Grass-type such as Doduo, Ponyta, Quilava, and Tropius, help Wartortle deal with threats like Gloom.</p>"
      },
      "Offensive": {
        "description": "<p>Wartortle's respectable Special Attack and access to Torrent allow it to function as a late-game sweeper and wallbreaker. Substitute increases Wartortle's chances of receiving boosts from both Torrent and Salac Berry. With a Torrent boost, Hydro Pump proves extremely hard to switch into for Pokemon that don't resist Water, with only specially defensive Noctowl not being 2HKOed. Hidden Power Grass threatens opposing Water-types such as Corsola, Seaking, and Wartortle. Rain Dance allows Wartortle to set rain for itself and any other teammates that may benefit, such as Seaking. Additionally, rain allows Wartortle's Torrent-boosted Hydro Pump to 2HKO Pokemon it otherwise wouldn't, such as specially defensive Noctowl and Swords Dance Tentacool. Rain Dance also allows Wartortle to stifle recovery from Synthesis and Moonlight users such as Gloom, Tropius, and Dustox. Ice Beam threatens Tropius and Gloom, which otherwise wall Wartortle. Wartortle's Speed investment, coupled with a Salac Berry boost, lets it outspeed the entire metagame, bar Voltorb, allowing it to sweep. Wartortle's HP investment ensures that it is left with 25% HP after three Substitutes. 12 Defense EVs ensure that Wartortle isn't KOed by Quick Attack from Ponyta or Volbeat when at 25% HP.</p> <p>This set functions best on rain and hyper offense teams. Other Pokemon that appreciate Rain Dance support, such as Seaking, Lombre, and Horsea, pair well with Wartortle. Seaking and Wartortle form a particularly powerful combination, as the two can weaken each other's checks, such as Noctowl, Castform, and Porygon. Other special attackers like Quilava, Flaaffy, and Voltorb similarly pair well with Wartortle. Voltorb is particularly worth noting because it can function as an excellent lead Rain Dance user, which allows Wartortle space to run Ice Beam. Physical wallbreakers like Aipom, Doduo, and Anorith are excellent partners, as they can weaken or heavily remove special walls like Noctowl and Porygon. Wartortle appreciates secondary setup sweepers and cleaners such as Beedrill, Anorith, and Ariados, as they allow it to be more flexible in deciding whether to wallbreak or sweep. Wartortle appreciates teammates like Lombre and Ariados that can threaten faster checks such as Voltorb.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 272450, "username": "BP"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 452572, "username": "missangelic"}, {"user_id": 601970, "username": "sleid"}]}, {"name": "Grammar checked by", "members": [{"user_id": 229690, "username": "queez"}]}]}
  },
  "Butterfree": {
    "outdated": true,
    "comments": "<h4>Other Options</h4> <p>Butterfree can opt to use Hidden Power Fire on its Petaya Berry set to prevent Magnemite from safely setting up Substitute, but this is not recommended due to giving up valuable coverage against Ground- and Water-types like Rhyhorn and Seaking.</p> <h4>Checks and Counters</h4> <p><strong>Magnemite</strong>: Magnemite resists Butterfree's damaging moves and can avoid Sleep Powder with its Substitute. Furthermore, Magnemite can cripple Butterfree with Thunder Wave which severely limits its opportunities to spread status.</p> <p><strong>Faster Attackers</strong>: Aipom, Elekid, Taillow, and Staryu are all able to outspeed and KO Butterfree. If another foe has been put to sleep, these Pokemon can switch in relatively easily if Butterfree lacks Stun Spore. Elekid in particular poses a threat, as it can absorb status once thanks to it commonly using Lum Berry. Choice Band users, namely, Aipom, Taillow, and Pidgeotto, can all OHKO Butterfree even with maximum HP investment.</p> <p><strong>Lum Berry Leads</strong>: Lum Berry leads such as Pineco and Growlithe can OHKO Butterfree if it tries to use Sleep Powder.</p> <p><strong>Special Walls</strong>: Both Delcatty and Lileep act as phenomenal Butterfree checks, as they take minimal damage from its attacks and possess threatening STAB moves, namely Body Slam and Rock Slide. Furthermore, thanks to its access to Heal Bell, Delcatty is able to limit Butterfree's usefulness. Dustox is able to wall Butterfree and remove it with Whirlwind, nullifying a boost from Petaya Berry. However, Butterfree can put special walls to sleep, which leaves them vulnerable to its teammates.</p>",
    "sets": {
      "Lead": {
        "description": "<p>Butterfree cements itself as one of the most reliable status users thanks to Compound Eyes-boosted Sleep Powder. Paired with its above-average Speed tier, it is a frightening lead, particularly versus slower leads like Snorunt, Cyndaquil, and Spoink. Sleep Powder's nigh-perfect accuracy allows Butterfree to put switch-ins or opposing leads to sleep, which makes them deadweight for most of the game. Psychic is Butterfree's strongest move, and thanks to the rarity of viable Dark- and Steel-types, it is almost drawback-free. Hidden Power Grass allows Butterfree to OHKO offensive Rhyhorn while also threatening Ground-types such as Cubone and Water-types like Seaking and Staryu. Giga Drain is an option to provide Butterfree a form of recovery that helps complement Morning Sun's low PP, though it also has low PP and is weaker. Morning Sun provides Butterfree with reliable recovery and allows it to keep itself healthy throughout the match. Butterfree can opt to use Stun Spore alongside Sleep Powder in order to neuter faster threats such as Aipom, Pidgeotto, Taillow, and Elekid. If Stun Spore is used over Morning Sun, Butterfree appreciates the limited recovery that Leftovers and Giga Drain provide.</p> <p>Butterfree fits best on offensive and balanced teams that appreciate the free turns that Sleep Powder provides. Pokemon that resist Fire-type moves, such as Spoink, Seaking, and Chinchou, pair up nicely with Butterfree. Chinchou is worth noting due to its additional resistances to Ice and Electric. Its access to Thunder Wave means Butterfree's team can also spread status more easily. Wallbreakers such as Aipom, Castform, and Elekid all appreciate the opportunity to switch in on sleeping Pokemon. Aipom can act as an offensive pivot for Butterfree, as it threatens Butterfree's checks with Double-Edge and Brick Break. Likewise, Castform is worth mentioning, as it can tank special moves from Butterfree's checks and deal heavy damage in return. Setup sweepers such as Croconaw, Growlithe, Cubone, and Spoink appreciate the setup opportunity that Sleep Powder and Stun Spore provides them. Rock- and Steel-types such as Rhyhorn, Aron, Magnemite, and Nosepass can switch into the STAB moves of faster physical attackers that threaten Butterfree such as Pidgeotto, Taillow, and Aipom.</p>"
      },
      "Substitute + Petaya Berry": {
        "description": "<p>Butterfree's excellent Special Attack means it is able to function as a late-game cleaner. Substitute is primarily used to activate Petaya Berry to give Butterfree the boost it needs to clean. Sleep Powder provides Butterfree with more reliable setup opportunities while also providing status support. Psychic is Butterfree's strongest move and is almost always drawback-free thanks to the lack of prominent Pokemon that resist it. Giga Drain provides Butterfree with a form of recovery while also threatening Rhyhorn. Hidden Power Grass can be used over Giga Drain for its greater PP and stronger Base Power.</p> <p>Butterfree appreciates secondary status support, so Pokemon such as Chinchou, Magnemite, and Nosepass all make great partners. Rock-types like Nosepass and Rhyhorn are worth noting thanks to their ability to wall, cripple, and KO wallbreakers such as Choice Band Aipom if it is locked into its STAB moves. Nosepass can also trap and remove opposing Magnemite, another prominent Butterfree check. Pokemon that resist Fire-type moves such as Growlithe, Seaking, and Spoink all make good partners. Growlithe is able to act as a wallbreaker with Overheat making it a great partner. Additionally, wallbreakers such as Aipom, Pidgeotto, and Staryu can help weaken Pokemon that Butterfree may struggle with like Lileep, Delcatty, and Magnemite. Butterfree struggles with faster attackers like Elekid, Aipom, and Staryu, so Pokemon that can wall them such as bulky variants of Castform, Koffing, Dustox, and Lileep make great partners. Koffing is worth mentioning due to its access to Memento, which can give Butterfree an easy setup opportunity.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 272450, "username": "BP"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 479897, "username": "BeatsBlack"}, {"user_id": 535530, "username": "Gangsta Spongebob"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Beedrill": {
    "comments": "<h3>Other Options</h3> <p>Beedrill can opt to use Agility over Substitute and Lum Berry over Salac Berry, but due to its mediocre bulk, it struggles to activate Swarm safely. Brick Break can be used to threaten Corsola and Onix, though this requires dropping Hidden Power Bug, which heavily limits Beedrill's capacity to sweep.</p> <h3>Checks and Counters</h3> <p><strong>Fire-types</strong>: Quilava and Ponyta outspeed and OHKO Beedrill if it's not behind a Substitute. They can also stomach a Sludge Bomb if they come in on one, but Ponyta has to be worried about getting poisoned, since it will seal the OHKO. Quilava struggles to take Beedrill down behind a Substitute after Salac Berry activates, and Ponyta's Quick Attack rarely finishes off Beedrill when it gets down to 25% HP.</p> <p><strong>Physical Walls</strong>: Flamethrower Koffing is very tough to get past; however, Beedrill can get past non-Flamethrower variants. Wartortle and Corsola take hits very well and can fire back for solid damage, though they are not as troubling, since Beedrill can stomach Surf and use Swords Dance to get past them. However, Beedrill needs to be in good condition to do this.</p> <p><strong>Faster Attackers</strong>: Aipom, Doduo, Seaking, Anorith, and Volbeat can all outspeed and OHKO Beedrill, though they don't switch in safely or take hits very well. Abra has the added benefit of being able to use Encore to lock Beedrill into Swords Dance or Substitute. However, Beedrill can outspeed all of these attackers after a Salac Berry boost.</p> <p><strong>Priority</strong> If Beedrill is not behind a Substitute, Pokemon with access to Quick Attack such as Ponyta and Doduo can prevent Beedrill from sweeping after Salac Berry has been used.</p> <p><strong>Multi-Hit Moves</strong>: Beedrill gets entirely thwarted by Anorith and Rhyhorn using Rock Blast as well as Cubone carrying Bonemerang. Although, Anorith has to get in front of Beedrill before the Salac Berry procs and Beedrill gets into Swarm range.</p>",
    "sets": {
      "Substitute + Salac": {
        "description": "<p>Beedrill's access to Swords Dance, excellent Attack, and Swarm cement it as one of the most frightening setup sweepers. Substitute is integral, as it provides Beedrill with a more reliable way to activate its Salac Berry and more opportunities to use Swords Dance, since it can get free turns on Pokemon like Gloom and Koffing or on a predicted switch out. Swords Dance allows Beedrill to OHKO Pokemon it otherwise wouldn't such as Seaking, Aipom, and Flaaffy. Hidden Power Bug packs a huge punch when Swarm is active and allows Beedrill to sweep effectively, since it can pick up the 2HKO on Porygon and the OHKO on Anorith. Sludge Bomb makes it difficult for would-be switch-ins like Wartortle, Corsola, and Onix to come in unscathed due to its high chance to poison. It also provides Beedrill with a more powerful STAB option if Swarm has not been activated. The EV spread allows Beedrill's Substitute to withstand a Sludge Bomb from Gloom and Koffing and outspeed maximum Speed Voltorb with a Salac Berry boost.</p> <p>Beedrill fits best on balance and offense teams in need of a dedicated cleaner or wincon. Fire-resistant Pokemon such as Wartortle, Seaking, and Flash Fire Ponyta all pair well with Beedrill, since they can take on Quilava and opposing Ponyta for it. Wartortle is a notable teammate, as it can remove Spikes for Beedrill while reliably checking both Ponyta and Quilava. Physical wallbreakers such as Aipom, Seaking, and Doduo are able to weaken Beedrill's defensive checks like Wartortle, Onix, and Corsola. Choice Band Seaking is a notable partner, as it can act as a complementary wallbreaker for Beedrill with its good bulk and resistance to Fire. Aipom's Speed allows it to function as a secondary cleaner. Strong special attackers like Abra, Quilava, and Clamperl are able to heavily threaten some of Beedrill's defensive checks like Koffing, Ariados, and Corsola; in return, Beedrill can break down special walls like Noctowl and Porygon.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 272450, "username": "BP"}, {"user_id": 601970, "username": "sleid"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 535530, "username": "Gangsta Spongebob"}, {"user_id": 479897, "username": "BeatsBlack"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Bayleef": {
    "outdated": true,
    "comments": "<h4>Other Options</h4> <p>Bayleef can opt to become a set-up sweeper thanks to its access to Swords Dance, though is generally outclassed by other set-up sweepers due to its lackluster physical movepool and mediocre Attack. Reflect and Light Screen are options on offensive teams, though Bayleef is generally outclassed in this regard by Ledian. Moreover, dual screens is a fringe role due to the lack of effective Pokemon to take advantage of them. Thanks to its impressive bulk, Bayleef can opt to invest into Special Defense, though it faces stiff competition from both Dustox and Sunflora.</p> <h4>Checks and Counters</h4> <p><strong>Fire-types</strong>: Growlithe can be safely brought in on any of Bayleef's damaging moves thanks to Intimidate and OHKO it with its STAB move. Cyndaquil has an unfavorable range to OHKO, but is in return 2HKOed by Hidden Power Ground. Both can absorb a Toxic upon switch-in due to their tendency to hold a Lum Berry.</p> <p><strong>Flying-types</strong>: Delibird can 2HKO Bayleef with Ice Beam, while Pidgeotto and Taillow can 2HKO Bayleef with Aerial Ace with unfavorable ranges. Taillow is worth noting, as it can absorb a Toxic with Guts, allowing it to more easily 2HKO Bayleef.</p> <p><strong>Poison-types</strong>: Defensive Poison-types such as Koffing and Dustox can wall and status Bayleef. Offensive Poison-types such as Grimer and Nidorino can 2HKO Bayleef with their STAB moves. Grimer is worth noting, as it can use Bayleef as set-up fodder.</p> <p><strong>Toxic Users</strong>: Pokemon that commonly run Toxic such as Elekid and Lileep can severely limit Bayleef's effectiveness as a wall.</p> <p><strong>Seaking</strong>: Seaking's access to Megahorn allows it to 2HKO Bayleef. In return, Bayleef can only 3HKO Seaking with Hidden Power Grass.</p>",
    "sets": {
      "Wall": {
        "description": "<p>Bayleef's mono-Grass typing coupled with bulk that is comparable to Lileep make it an excellent contender for defensive roles. Hidden Power Grass allows Bayleef to threaten Ground- and Water-types such as Cubone, Rhyhorn, and Chinchou. Alternatively, Hidden Power Ground can be used to threaten Electric-types such as Elekid and Magnemite. However, Hidden Power Ground fails to break Cubone's Substitute and 2HKO Rhyhorn. Leech Seed allows Bayleef to punish Pokemon that may attempt to switch in such as Koffing and Dustox. Synthesis provides Bayleef with reliable recovery, allowing it to maintain its position as an effective wall for longer. Toxic prevents other walls, most notably Lileep, from taking advantage of Bayleef's passiveness. 34 Speed EVs allow Bayleef to outpace offensive Rhyhorn while maintaining its overall bulk.</p> <p>Bayleef excels on almost exclusively balance teams due to the competition it faces with Lileep. Pokemon that absorb Toxic such as Koffing, Grimer, and Staryu all pair well with Bayleef. Koffing is worth noting, as it can act as a secondary check to Aipom and a primary check to Rhyhorn, which would otherwise overwhelm Bayleef. Specially defensive Pokemon such as Castform and the previously mentioned Grimer pair well with Bayleef due to their ability to check Chinchou and Growlithe. Pokemon that can take Fire-type attacks such as Seaking, Chinchou, and Spoink make good partners. Physical wallbreakers such as Aipom, Cubone, and Delibird can all threaten Dustox, which otherwise takes advantage of Bayleef's passiveness. Bayleef pairs well with special wall breakers such as Elekid, Cyndaquil, and Staryu, as they can threaten Koffing.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 272450, "username": "BP"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 535530, "username": "Gangsta Spongebob"}, {"user_id": 601970, "username": "sleid"}]}, {"name": "Grammar checked by", "members": [{"user_id": 577920, "username": "Tea Guzzler"}]}]}
  },
  "Quilava": {
    "comments": "<h3>Other Options</h3> <p>Overheat can work in place of Toxic or Quick Attack when paired with Charcoal because of its ability to break through threats that would survive a Fire Blast, like specially defensive Gloom.</p> <h3>Checks and Counters</h3> <p><strong>Ponyta</strong>: Ponyta is a big hurdle to Quilava due to its ability Flash Fire and resistance to Hidden Power Grass. Even when running Hidden Power Water, Quilava is still challenged by Ponyta's superior Speed.</p> <p><strong>Water-types</strong>: Bulky Water-types like Corsola, Seaking, and Wartortle all make Quilava's ability to make an impact very difficult. Wartortle is especially troublesome due to its solid Special Defense and access to Refresh to easily manage Toxic.</p> <p><strong>Special Walls</strong>: Calm Mind Drowzee and specially defensive Noctowl can take any attack Quilava has to throw at them. Even if Quilava can break through these checks with Toxic, and a Blaze-boosted Fire Blast, it would prefer to maintain its HP and resources for other threats.</p>",
    "sets": {
      "Offensive": {
        "description": "<p>Quilava functions primarily as an offensive special attacker that can pressure bulkier teams thanks to its powerful STAB moves and excellent Speed tier. Fire Blast is used as Quilava's preferred STAB move to break through damaged teams without relying as heavily on Blaze or Petaya Berry. Despite the drop in damage output, Flamethrower is a reliable alternative that comes with improved accuracy and more PP. Hidden Power Grass provides coverage versus Water-, Ground-, and Rock-type Pokemon such as Corsola, Chinchou, Onix, and Rhyhorn. Hidden Power Water hits Ponyta while still threatening Pokemon like Onix and Rhyhorn. Substitute is used for its synergy with the ability Blaze; it also maximizes Toxic damage, and takes advantage of Petaya Berry or Salac Berry. Quilava also tends to force its foes out, which can allow it to set up a Substitute. Toxic threatens special walls like Drowzee, Porygon, and Noctowl, and it can punish Ponyta trying to switch in on Fire Blast or Flamethrower. Quick Attack is a great countermeasure to Substitute + pinch Berry sweepers like Abra and Beedrill as well as against Flail and Reversal users like Doduo and Meditite. 216 Speed EVs allow Quilava to outspeed base 75 Speed Pokemon like Anorith and Doduo, and it can invest its remaining EVs into bulk to guarantee survival against Silk Scarf Ponyta's Quick Attack at 25% HP and a Double Edge from Choice Band Ponyta at Full health. With the added bulk, Quilava can also guarantee that it can still use Substitute after taking Silk Scarf Ponyta's Double Edge at full health. This bulk even allows for Quilava to survive a Double-Edge from Choice Band Ponyta. Petaya Berry turns Quilava into an even scarier special attacker that can OHKO a majority of the tier, and 2HKO special walls like Delcatty, Drowzee, and Noctowl. Salac Berry enables Quilava to threaten a sweep versus faster Pokemon within the tier like Abra, Elekid, Ponyta, and Voltorb. This allows Quilava to function as a late-game sweeper against faster teams.</p> <p>Quilava fits well on balance, offense, and sun teams that benefit from its stellar Special Attack. Its ability to deal heavy damage to more defensive options like Corsola, Lileep, and Koffing enables physical attackers like Aipom, Doduo, and Meditite. While Quilava can threaten Ponyta with Toxic and Hidden Power Water, it may not always get the chance to, so it benefits greatly from defensive Normal-resistant Pokemon and Rock-resistant Pokemon such as Corsola, Lileep, Nosepass, Onix, and Rhyhorn, as they can handle physical attackers like Aipom and Ponyta. Water-types like Corsola, Seaking, and Wartortle can also threaten Quilava, and Hidden Power Grass won't do enough against healthy Water-types with decent Special Defense. This makes Electric-types like Elekid, Flaaffy, and Voltorb a great asset for Quilava to deal with Water-types. Late-game, Quilava can threaten a KO with the assistance of a Petaya Berry. Until that is feasible, Quilava needs the support of a special wall like Delcatty, Gloom, Porygon, or Wartortle for its ability to shrug off most special attacks. Clerics like Flaaffy and Mightyena can allow Quilava to not be as hindered by fear of Thunder Wave, Stun Spore, or Toxic.</p>"
      },
      "Rest + Chesto Berry": {
        "description": "<p>Quilava is capable of breaking down special walls such as Gloom and Sunflora thanks to its Fire typing, powerful STAB option, and Speed. Hidden Power Grass provides useful coverage against Water- and Rock-types such as Corsola, Chinchou, and Onix. Quick Attack assists in picking off weaker, faster attackers such as Abra and Elekid. In combination with a Chesto Berry, Rest heals Quilava instantly, clearing all status conditions and providing greater longevity. If Quilava is in Blaze range, it threatens to OHKO Pokemon such as Flaaffy, Koffing, and stallbreaker Mightyena, making it a juggernaut at breaking down foes. Quilava frequently switches in against Gloom and Dustox, which can threaten to wear it down with status. With the combination of Rest and Chesto Berry, Quilava can switch in without the worry of being affected by paralysis or poison.</p> <p>ChestoRest Quilava performs best on offensive teams that benefit from its ability to weaken special walls and ignore status conditions. Paralysis spreaders like Porygon and Drowzee give Quilava a difficult time when it tries to break them down, so paralysis absorbers like Cubone and Rhyhorn that are immune to Thunder Wave can help deal with Quilava's checks. Other physical wallbreakers such as Anorith and Doduo can thwart special walls Quilava is unable to break like Drowzee and Tentacool. Special attackers such as Clamperl and Wailmer soften up special walls, allowing Quilava to clean up. Bulky Water-types such as Seaking and Wartortle are difficult to break down, as Quilava's Hidden Power Grass inflicts insufficient damage against them. Grass-types such as Gloom and Sunflora tank special attacks from Chinchou and Wartortle and possess reliable recovery. Quilava benefits from paralysis spreaders such as Castform, Nosepass, and Porygon, allowing it to eliminate faster threats such as Aipom and Elekid. Clerics such as Delcatty and Mightyena are appreciated by Quilava, as they help awaken it after consuming its Chesto Berry. Fast offensive Pokemon, like Abra, Aipom, and Voltorb, can act as cleaners after Quilava has broken down their checks.</p>"
      },
      "Sunny Day": {
        "description": "<p>Quilava is a powerful wallbreaker with adequate Speed that can use Sunny Day to 2HKO special walls such as Porygon and Delcatty under sun. In addition to boosting Quilava's damage output, Sunny Day deters potential Water-type checks such as Clamperl and Chinchou by reducing the damage of Water-type moves. Substitute allows Quilava to safely get itself into Petaya Berry range and blocks potential status from Castform and Drowzee, which may weaken Quilava. Quilava can also safely get into Blaze range with Substitute. Hidden Power Ground is used to threaten a 2HKO against Ponyta and a 3HKO against Tentacool. When Quilava is reduced to Petaya Berry and Blaze range, it can use sun-boosted Fire Blast to OHKO physically defensive Lileep and Rhyhorn. Fire Blast also provides a 68.8% chance to OHKO specially defensive Delcatty. A Naive nature is preferred over Hasty, as it makes it more difficult for Quick Attack users such as Doduo and opposing Quilava to pick it off.</p> <p>Sunny Day Quilava fits well on sun and offense teams, functioning as a powerful wallbreaker. Chlorophyll users like Gloom, Sunflora, Tropius, and Weepinbell can benefit from Quilava setting up sun. Quilava is also able to break through special walls such as Delcatty and Porygon, enabling its teammates to clean. Bulky Water-types such as Corsola and Wartortle wall this set, so Pokemon such as Gloom and Sunflora are able to pick off bulky Water-types for Quilava. Each Chlorophyll user can set up Sunny Day, powering up Fire Blast and reducing the need for Quilava to set up sun for itself, as it is somewhat frail. Quilava values paralysis spreaders like Castform and Porygon hindering opposing Chlorophyll threats as well as faster Pokemon like Ponyta and Volbeat. Physical wallbreakers such as Anorith, Cubone, and Choice Band Seaking are appreciated by Quilava, as they help break special walls like Drowzee and Noctowl. Pokemon such as Onix and Koffing are capable of dealing with faster threats like Aipom for Quilava and its Chlorophyll partners if sun isn't up, and they can set sun for it as well.</p>"
      },
      "All-out Attacker": {
        "description": "<p>Quilava's combination of good Speed and Special Attack allows it to function as a strong wallbreaker, and its STAB Fire Blast threatens special walls such as Gloom and Dustox. Charcoal allows Quilava to OHKO physically defensive Tropius and Salac Berry Anorith with Overheat. Overheat also allows Quilava to OHKO Castform once it gets down to Blaze range. Quick Attack helps to pick off Abra and other weakened faster attackers. Hidden Power Grass is Quilava's best attack against Rock-types, as it helps shred Corsola, Onix, and Rhyhorn, which would otherwise safely switch into Quilava's Fire-type attacks. If Quilava gets down to Blaze range, it can OHKO Pokemon such as Flaaffy and specially defensive Gloom with Fire Blast. Quilava's Hasty nature preserves power on Quick Attack while guaranteeing Blaze range after Tropius's Earthquake.</p> <p>Quilava fits best on offense teams that require a special wallbreaker. Other special attackers such as Abra and Staryu benefit from Quilava, as it is able to chip special walls like Delcatty and Porygon, helping pick them off. Quilava finds difficulty breaking down Ponyta, so physical walls such as Lileep and Wartortle are appreciated, as they can withstand Double-Edge. Quilava appreciates physical attackers such as Aipom and Anorith threaten special walls like Noctowl and Tentacool, allowing it to clean through the rest of the team. Electric-types such as Elekid and Voltorb to complement Quilava, since they can repel the Water-types that harm it, while Quilava is capable of handling Grass-types. Gloom makes for an excellent teammate to Quilava, as it can stomach hits from Water-types like Staryu and Wartortle and threaten them out with Hidden Power Grass. Gloom can also use Stun Spore to debilitate faster Pokemon such as Aipom and Volbeat, allowing Quilava to eliminate them safely. Quilava is vulnerable to status from Pokemon such as Drowzee and Porygon, so clerics like Flaaffy and Mightyena are appreciated. Salac Berry sweepers such as Anorith and Beedrill appreciate Quilava being able to weaken physical walls like Koffing and Onix.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 345087, "username": "JoaF"}, {"user_id": 635335, "username": "Zpice"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 272450, "username": "BP"}, {"user_id": 452572, "username": "missangelic"}, {"user_id": 601970, "username": "sleid"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny004"}, {"user_id": 528364, "username": "adorluigi"}, {"user_id": 555379, "username": "Tbolt"}, {"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Croconaw": {
    "outdated": true,
    "comments": "<h4>Other Options</h4> <p>A Choice Band set may seem worthwhile due to Croconaw's excellent Attack, but its poor Speed and lack of STAB-boosted attacks mean it is unable to perform effectively.</p> <h4>Checks and Counters</h4> <p><strong>Electric-types</strong>: Both Chinchou and Elekid can outspeed and OHKO Croconaw with their Electric-type STAB moves. Chinchou is worth noting, as its bulk and typing can help it switch in.</p> <p><strong>Status Users</strong>: Pokemon that run status moves such as Lileep, Dustox, and Chinchou can all severely limit Croconaw as a sweeper. Toxic from the likes of Lileep and Dustox can hurt Croconaw's overall longevity, rendering it almost useless if it's relying on Salac Berry and Torrent. Nidorino is also worth mentioning, as it can outspeed and poison Croconaw if Croconaw is the Swords Dance variant. Will-O-Wisp from Koffing can remove Croconaw's ability to act as a physical wallbreaker while also shutting down hopes of it using Torrent and Salac Berry effectively. Thunder Wave from Chinchou or Body Slam paralysis from Delcatty can reduce Croconaw's already lacking Speed, which hinders it as an attacker.</p> <p><strong>Faster Attackers</strong>: Croconaw is easily revenge killed by faster attackers such as Aipom and Pidgeotto. Salac Berry somewhat remedies this, but this makes Croconaw extremely susceptible to priority users such as Pidgeotto, Tailow, and Delibird.</p> <p><strong>Grass-types</strong>: Bayleef is able to completely wall Swords Dance Croconaw and 2HKO it with Hidden Power Grass. Additionally, due to Bayleef's customizable defenses, it can choose to invest into its Special Defenses, which completely walls Croconaw's Salac Berry set. Specially defensive Sunflora is worth mentioning here, as it is able to completely wall Substitute + Salac Berry Croconaw.</p>",
    "sets": {
      "Swords Dance Sweeper": {
        "description": "<p>Croconaw's access to Swords Dance, respectable bulk, and excellent base 80 Attack set it apart from other physical wallbreakers. These traits allow Croconaw to find opportunities to set up on Pokemon such as Rhyhorn and Seaking despite its general lack of Speed. Unboosted Double-Edge is able to net a considerable amount of damage on foes that don't resist Normal. Croconaw can use Return to avoid recoil damage, but it tends to appreciate the extra damage that a +2 Double-Edge offers against Pokemon that have reliable recovery such as Dustox and Bayleef. Brick Break is able to threaten Rock- and Steel-types that resist Double-Edge such as Lileep and Magnemite. Croconaw's STAB-boosted Surf, although not boosted by Swords Dance, can reliably remove Rhyhorn and threaten Koffing, and it provides Croconaw with a way to hit Shuppet.</p> <p>Croconaw works best on balance and offense teams that rely on status users to help make progress. Butterfree makes an excellent partner, as Sleep Powder and Stun Spore offer Croconaw plenty of opportunities to set up Swords Dance. Paralysis users such as Magnemite, Chinchou, and Nosepass can help remedy Croconaw's poor base Speed as an offensive Pokemon. Nosepass is also worth mentioning for being a great answer to Aipom as well as providing support via Explosion to weaken or remove bulkier foes. Toxic users such as Magnemite, Shuppet, and Dustox can help weaken bulkier Pokemon, most notably Lileep and Bayleef. Special attackers such as Elekid, Growlithe, and the previously mentioned Chinchou all appreciate Croconaw's ability to threaten specially defensive Pokemon such as Delcatty, Dustox, and Grimer. In return, these special attackers threaten physically defensive Pokemon such as Koffing and Lileep for Croconaw. Mixed Seaking makes for an excellent partner, as it can threaten Lileep with Megahorn and other physically defensive Pokemon with STAB-boosted Hydro Pump. Castform and Sunflora shut down both Chinchou and Elekid, which otherwise prevent Croconaw from sweeping. Croconaw appreciates Spikes support from Snorunt, as the residual damage helps solidify a Double-Edge 2HKO at +2 against Bayleef.</p>"
      },
      "Salac Sweeper": {
        "description": "<p>Croconaw sets itself apart from other Water-types thanks to its access to Torrent. This in conjunction with Salac Berry allows Croconaw to become an incredibly frightening late-game sweeper. STAB-boosted Hydro Pump can prove difficult to switch into, and while Torrent is active, Pokemon that would otherwise comfortably switch in such as Chinchou, Seaking, and Castform get 2HKOed. Ice Beam provides Croconaw with excellent coverage against Grass-types such as Bayleef and Lileep. Hidden Power Grass allows Croconaw to hit opposing Water-types such as Seaking, Chinchou, and Staryu without relying on Hydro Pump's accuracy. Because of Croconaw's mediocre Special Attack, a Modest nature is used to ensure Croconaw 2HKOes specially defensive Pokemon such as Delcatty and Grimer while Torrent is active.</p> <p>Croconaw works best on offensive and balance teams in need of a dedicated cleaner or win condition. Croconaw appreciates status support, so Pokemon with access to Thunder Wave such as Nosepass, Chinchou, and Magnemite all make great partners. Physical wallbreakers such as Aipom, Pidgeotto, and Cubone can threaten specially defensive Pokemon such as Delcatty, Dustox, and Grimer. Rhyhorn makes for a fantastic partner, as it resists Delcatty's Body Slam and Grimer's Sludge Bomb. Mixed attackers such as Castform and Seaking make for excellent partners, as they can weaken Dustox and Delcatty, which can otherwise shut down Croconaw's ability to clean. Specially defensive Pokemon such as Sunflora and Castform act as excellent checks to Chinchou and Elekid, which otherwise threaten Croconaw's ability to clean if its Salac Berry has not been activated. Croconaw appreciates Spikes support from Snorunt, as the chip allows it to always 2HKO Dustox with Hydro Pump while Torrent is active.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 272450, "username": "BP"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 535530, "username": "Gangsta Spongebob"}, {"user_id": 601970, "username": "sleid"}]}, {"name": "Grammar checked by", "members": [{"user_id": 168392, "username": "P Squared"}, {"user_id": 555379, "username": "Tbolt"}, {"user_id": 577920, "username": "Tea Guzzler"}]}]}
  },
  "Farfetch’d": {
    "outdated": true,
    "comments": "<h4>Other Options</h4> <p>Farfetch'd can run Frustration over Flail for more immediate power, but Flail is usually preferred for the much higher power it provides when at low HP. Hidden Power Flying can be run over Hidden Power Ghost or Fighting to threaten Shuppet while also providing Farfetch'd with a STAB move to hit Pokemon like Bayleef with when not in range of Flail. Quick Attack is also an option to make Farfetch'd less vulnerable to priority and allow it to revenge kill faster foes, but you have to forego a crucial coverage move for it. Farfetch'd can also run a Choice Band set that can pivot thanks to Baton Pass, but it is vastly outclassed by Pokemon like Pidgeotto, Taillow, and Aipom due to Farfetch'd's low Speed.</p> <h4>Checks and Counters</h4> <p><strong>Rock- and Steel-types</strong>: Rock-types like Lileep, Rhyhorn, and Nosepass are able to take Farfetch'd's hits relatively well and OHKO Farfetch'd with their Rock-type STAB moves. Additionally, Steel-types like Aron and Magnemite can be troublesome for Farfetch'd to deal with, as they can take Flail relatively well and OHKO Farfetch'd back with Rock Slide and Thunderbolt, respectively. These Pokemon all dislike Hidden Power Fighting, however, and they also dislike a maximum power Flail, with the exception of Aron.</p> <p><strong>Shuppet</strong>: Shuppet is able to completely wall sets that run Hidden Power Fighting for Aron, although it cannot beat Hidden Power Ghost Farfetch'd. Shuppet can also threaten Farfetch'd with status moves, which completely ruin it.</p> <p><strong>Faster Attackers</strong>: Faster attackers like Elekid, Chinchou, and Aipom can threaten to OHKO Farfetch'd with Thunderbolt and Double-Edge, but if Farfetch'd already has a Substitute up, then they cannot beat Farfetch'd.</p> <p><strong>Status Users</strong>: Status users like Magnemite, Shuppet, and Lileep can be particularly troublesome for Farfetch'd, as a burn or poison stops it from activating its Salac Berry safely, while paralysis completely negates its Salac Berry boost.</p>",
    "sets": {
      "Flail Cleaner": {
        "description": "<p>Farfetch'd cements itself as a solid cleaner due to having access to Flail and Swords Dance. This allows it to OHKO various physical walls in the tier like Koffing, making it a scary offensive cleaner with a Salac Berry late-game. Flail is Farfetch'd's strongest move when at low HP, with it being able to OHKO or heavily damage even Normal-resistant Pokemon like Magnemite and Rhyhorn when boosted. Hidden Power Ghost is used to threaten Shuppet, which would otherwise be a hard wall thanks to its Normal immunity, but leaves Farfetch'd vulnerable to Aron. To remedy this, Farfetch'd can run Hidden Power Fighting to threaten Aron, but this leaves it completely walled by Shuppet. Substitute allows Farfetch'd to put itself in range of Salac Berry, power up Flail to its maximum strength, and take advantage of switches. Swords Dance allows Farfetch'd to reach offensive thresholds like OHKOing Magnemite and doing 72-85% to Rhyhorn with maximum power Flail, which can be crucial in Farfetch'd's clean late-game. Lastly, a Salac Berry allows Farfetch'd to outspeed the entire metagame, allowing it to clean with its only worry being priority users like Elekid, Pidgeotto, and Cyndaquil. Inner Focus is the preferred ability to stop flinches from Fake Out users like Meowth.</p> <p>Farfetch'd is usually found on offensive teams or teams that rely on status to give Farfetch'd more opportunities to set up. Pokemon like Magnemite and Delcatty that spread paralysis through Body Slam and Thunder Wave make good teammates for this reason, with Butterfree also standing out thanks to having Sleep Powder and Stun Spore. Farfetch'd also appreciates Pokemon that can pressure Rock- and Steel-types such as Lileep, Aron, and Rhyhorn, so Seaking, Growlithe, and Koffing can be great partners. Farfetch'd can be vulnerable to priority from Pokemon like Elekid, Pidgeotto, and Cyndaquil when set up, so Pokemon like Rhyhorn, Geodude, and Delcatty can help Farfetch'd deal with these foes. Additionally, Pokemon like Aipom and Elekid outspeed Farfetch'd and threaten an OHKO with Double-Edge and Thunderbolt, respectively, so it benefits from teammates like Rhyhorn, Lileep, and Chinchou that can deal with these Pokemon.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 595639, "username": "plznostep"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 272450, "username": "BP"}, {"user_id": 535530, "username": "Gangsta Spongebob"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}, {"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Noctowl": {
    "comments": "<h3>Other Options</h3> <p>Sleep Talk can be used on specially defensive sets with Rest to help Noctowl be less passive when asleep; however, it loses a valuable slot in either Toxic, Hidden Power Grass, or Psychic, which can be detrimental when facing Pokemon like Rhyhorn, Ariados, or Koffing. Choice Band can be used to help Noctowl's mediocre offenses, but being Choice-locked makes Noctowl more prediction reliant.</p> <h3>Checks and Counters</h3> <p><strong>Magnemite</strong>: Noctowl is unable to threaten Magnemite effectively, as it resists all of Noctowl's its moves and can threaten it back with a 2HKO or use it as setup fodder with Substitute.</p> <p><strong>Rock-types</strong>: Pokemon like Anorith and Corsola threaten Noctowl with an OHKO and force it to switch, although the latter must be afraid of Hidden Power Grass.</p> <p><strong>Physical Attackers</strong>: Aipom, Doduo, and Seaking can threaten Noctowl on its weaker Defense stat and force it out, although the former two dislike taking damage on the switch.</p> <p><strong>Electric-types</strong>: Flaaffy and Chinchou threaten Noctowl with a 2HKO or 3HKO with their STAB attacks, while the former also has Static to punish Noctowl for using contact moves.</p> <p><strong>Poison-types</strong>: Poison-types such as Koffing, Ariados, and Beedrill either do not care about Return or are not immediately threatened by Return and can threaten Noctowl back on its weaker defenses, although they all must be wary of Psychic.</p>",
    "sets": {
      "Special Wall": {
        "description": "<p>Noctowl boasts incredible special bulk that allows it to deal with many of the tiers most powerful special attackers such as Rain Dance Seaking and Sunny Day Gloom. Return is Noctowl's main attack, dealing decent damage to the majority of the tier and OHKOing Pokemon like Abra. Hidden Power Grass threatens Normal-resistant Pokemon such as Corsola with a 2HKO and OHKOes Rhyhorn. Toxic punishes defensive switch-ins such as Porygon and Tropius. Rest gives Noctowl a recovery option. Protect allows Noctowl to gain extra Leftovers recovery while additionally scouting Choice-locked Pokemon such as Aipom and Doduo. Psychic punishes Poison-types such as Koffing and Ariados expecting Toxic. Lastly, Whirlwind gives Noctowl a phazing option against Pokemon such as Calm Mind Corsola. 40 Speed EVs allow Noctowl to outspeed maximum Speed Cubone, Rhyhorn, and Corsola so it can threaten them first with Hidden Power Grass.</p> <p>Noctowl fits on slower teams such as balance and stall teams that rely on its amazing special bulk to fend off power special attackers. It appreciates clerics like Mightyena to help deal with status while also being useful to wake up Noctowl after it has used Rest. Additionally, Pokemon like Gloom help Noctowl versus Electric-types like Flaaffy. Wish users like Delcatty and Drowzee help Noctowl stay healthy by Wish passing. Physical walls like Corsola and Koffing cover physical wallbreakers such as Aipom that threaten Noctowl, while Noctowl handles special wallbreakers like Quilava and Abra. If Noctowl does not run Psychic, Pokemon such as Koffing and Ariados can be problematic for it; Pokemon such as Corsola and Magnemite can help alleviate this issue. Noctowl appreciates Leech Seed users such as Gloom and Sunflora, with strong special attackers such as Quilava in Blaze going from a chance to 3HKO into a 4HKO or 5HKO when combined with Protect. Finally, Normal-resistant Pokemon like Corsola, Anorith, and Rhyhorn can set up on Noctowl if it is lacking Hidden Power Grass, so Pokemon like Clamperl, Wartortle, and Koffing, respectively, can be great to help counter these Pokemon.</p>"
      },
      "Physical Attacker": {
        "description": "<p>Noctowl is able to be a decent offensive threat despite low attacking stats due to its excellent offensive typing and coverage while leveraging its superb bulk to check Pokemon like Quilava and Sunflora. Castform is notable competition for Noctowl, but Noctowl has much better bulk and has access to moves like Psychic, allowing Noctowl hit physical walls such as Koffing and Ariados much more effectively. Double-Edge is Noctowl's main attacking move, dealing decent damage into a majority of the tier. Alternatively, Return can be used if you wish to preserve Noctowl's bulk, though this comes at a cost in power, as Noctowl cannot 2HKO Pokemon like Seaking. Hidden Power Grass threatens Normal-resistant Pokemon in Corsola and Rhyhorn with a 2HKO and an OHKO, respectively. Psychic threatens the physically bulky Koffing. Reflect can be used to support Noctowl's teammates, such as Beedrill, into Pokemon such as Aipom. Toxic allows Noctowl to threaten physical walls it cannot hit with its coverage such as Lileep. Protect allows Noctowl to gain extra passive recovery from Leftovers, scout Choice-locked Pokemon like Doduo, and stall out rain or sun turns when facing Pokemon such as Seaking and Ponyta. 128 Defense EVs allow Noctowl to live a variety of physical hits from Pokemon such as Choice Band Aipom, while 128 Speed EVs allow Noctowl to outspeed Pokemon such as Flaaffy and Magnemite.</p> <p>Noctowl fits best on balance and hyper offense teams that appreciate Noctowl's great matchup into other hyper offense teams thanks to its ability to handle Pokemon such as Abra and Quilava while exerting a decent offensive presence. Some partners that appreciate Noctowl's presence include Corsola and Flaaffy, as Noctowl can handle Grass- and Water-types such as Sunny Day Gloom, Rain Dance Seaking, and Lombre. Beedrill and Anorith additionally appreciate Noctowl's ability to break their checks in Corsola and Koffing while also appreciating Noctowl setting up Reflect, which gives them more opportunities to set up. Reflect additionally helps Calm Mind Drowzee set up, especially versus Pokemon such as Choice Band Doduo. Ponyta also likes Noctowl's favorable matchups into Corsola and Seaking, which sets up rain on Ponyta. Noctowl appreciates Pokemon such as Flaaffy, Chinchou, and Sunflora that cover its weakness into Electric-types. Chinchou and Flaaffy are especially notable because the former resists Ice-type moves, which Noctowl is threatened by, and the latter can be a cleric. Other notable clerics include Delcatty and Mightyena, which help Noctowl's weakness to status and allow it to switch in on Pokemon like Koffing and Quilava more frequently. Sunflora also appreciates Noctowl checking Fire-types and can take advantage of Noctowl weakening the opposing team to clean. Wish users such as Drowzee and Delcatty are great partners for Noctowl, giving it more longevity throughout a game. Mightyena can be troublesome for Noctowl to deal with, so pairing Noctowl with Pokemon such as Ariados and Magnemite can be advantageous.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 595639, "username": "plznostep"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 272450, "username": "BP"}, {"user_id": 601970, "username": "sleid"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}, {"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Ariados": {
    "comments": "<h3>Other Options</h3> <p>Psychic is an additional option that allows Ariados to hit Koffing for super effective damage. Hidden Power Ground is an option that can go in place of Hidden Power Flying in order to hit Rock-types like Corsola, Onix, and Rhyhorn as well as Magnemite for super effective damage. Hidden Power Grass and Giga Drain are two options Ariados can utilize to patch up teams weak to Corsola and hit other Bug- and Poison-resistant Pokemon like Onix and Rhyhorn for 4x supereffective damage.</p> <h3>Checks and Counters</h3> <p><strong>Psychic-types</strong>: While Abra is OHKOed by Signal Beam, without being Agility boosted, Ariados is a sitting duck in front of Abra. Other Psychic-types, such as Drowzee and Smoochum, can give Ariados trouble as well.</p> <p><strong>Rock-types</strong>: Anorith, Corsola, and Rhyhorn threaten Ariados with an OHKO even behind a Substitute if they are running Rock Blast. Nosepass and Onix impede Ariados's progress thanks to their bulk, as unless Liechi Berry has activated and Ariados is in Swarm range, Signal Beam will be very unthreatening.</p> <p><strong>Fire-types</strong>: Ponyta and Quilava both threaten to OHKO Ariados and have access to Quick Attack to pick off weakened ones.</p> <p><strong>Flying-types</strong>: Delibird, Doduo, and Tropius threaten Ariados with STAB Flying-type attacks.</p> <p><strong>Poison-types</strong>: Without Psychic, Poison-types like opposing Ariados, Dustox, Gloom, and Koffing are massive thorns in Ariados's side. Signal Beam and Sludge Bomb are not very effective against Koffing, making an Ariados late-game sweep unlikely.</p>",
    "sets": {
      "Defensive Pivot": {
        "description": "<p>Ariados distinguishes itself as the best defensive pivot available in the tier. Thanks to its great defensive typing and superb stats for the tier, Ariados is a staple for many teams, checking physical attackers such as Meditite, Mightyena, and Beedrill. Psychic threatens Poison-types such as Beedrill, Koffing, and opposing Ariados. Sludge Bomb hits most Pokemon hard with neutral damage, and Poison-resistant Pokemon such as Rhyhorn and Onix dislike being poisoned by it. Toxic threatens bulky Pokemon such as Castform and Noctowl that hate status on the switch in. Baton Pass allows frail offensive Pokemon such as Meditite, Abra, and Elekid to find entry more commonly due to Ariados's low Speed. Protect gives Ariados extra Leftovers recovery and allows it to scout Choice-locked Pokemon such as Aipom and Meditite. Alternatively, Signal Beam pressures Mightyena more immediately. Giga Drain threatens Rock-types such as Rhyhorn, Corsola, and Onix on the switch in while also giving Ariados some recovery. A Relaxed nature makes Ariados more offensively threatening as a mixed attacker, while 20 Speed IVs are used in order to underspeed Pokemon like Koffing, keeping frail teammates like Abra safer. Ariados can also lower its Speed IVs to 0 to pivot more slowly than opposing pivot Ariados or at least Speed tie with them.</p> <p>Ariados's flexibility allows it to fit on offense and balance teams alike, as both playstyles appreciate a slow pivot to support Pokemon that struggle to find entry. Frail offensive Pokemon such as Ponyta, Meditite, Abra, and Elekid benefit from the addition of a pivot like Ariados giving them more opportunities to come in safely to wallbreak. Ponyta notably checks Fire-types such as Quilava and Magby, which threaten Ariados. Abra threatens to OHKO Ariados, so Pokemon such as Mightyena and Drowzee are good partners to help check Abra. Clamperl and Cubone are amazing teammates, as they appreciate Ariados bringing them in to break teams and can also punish Rock- and Fire-type switch-ins into Ariados. Both also appreciate Ariados checking Gloom. Other Pokemon that punish these switch-ins, such as Seaking, Wartortle, and Cubone, are also good partners for Ariados. Ariados lacks special bulk, so special walls such as Noctowl, Drowzee, and Porygon can accommodate this weakness. Delcatty can make a great partner to cover Ariados's mediocre special bulk while forming a Baton Pass core on offensive teams. Ariados is walled by Corsola, as Giga Drain is unable to 2HKO it, and used as setup fodder. Teammates such as Clamperl and Gloom are great to punish Corsola trying to set up.</p>"
      },
      "Agility": {
        "description": "<p>Ariados's access to Agility, a high Attack stat, and Swarm makes it a scary mid- or late-game sweeper. Ariados functions similarly to Beedrill, another Agility sweeper, but it offers better bulk, greater initial power in Signal Beam, and access to alternative Hidden Power options besides Hidden Power Bug. Agility allows Ariados to beat would-be faster foes like Abra, Anorith, Ponyta, and Quilava. Sludge Bomb is Ariados's strongest STAB move, threatening Fire-types, Tropius, and Noctowl. Signal Beam hits like a truck when Swarm is active, when it can 2HKO defensive options like Rhyhorn, Delcatty, and Porygon and OHKO threats like Anorith and Mightyena. Hidden Power Flying hits other Bug- and Grass-types such as opposing Ariados, Dustox, Gloom, and Volbeat for big damage. Substitute is vital if opting for Liechi Berry, as it enables Ariados to reliably activate its Liechi Berry, and it additionally blocks status and Intimidate and protects it from priority attackers. Psychic is another strong alternative to consider, as it allows Ariados to threaten Koffing. Leftovers is preferred for the recovery it provides and for allowing Ariados to set up Substitute multiple times. Liechi Berry can be an excellent tool for more offensive teams thanks to its sweeping potential by enabling Ariados to 2HKO common Bug-resistant foes like Corsola and Rhyhorn with Signal Beam, and it has great synergy with Swarm and Substitute. The EV spread allows Ariados to outspeed the entire unboosted metagame after using Agility. The rest of Ariados's EVs are funneled into its bulk, with the HP to let it activate its Liechi Berry at 25% health.</p> <p>Ariados fits well on balance and offensive teams that could use a hard-hitting bulky attacker that defensively answers Gloom and Tropius. With a Liechi Berry, Ariados can even function as a wincon on offense and hyper offense. Ariados appreciates special attackers like Abra, Clamperl, Flaaffy, and Quilava, as they can deal with its checks, such as Koffing, Corsola, and defensive Ariados. When not behind a Substitute, Ariados is defenseless in the face of Fire-types like Ponyta and Quilava, which makes bulky Water-types like Seaking and Wartortle very valuable allies. While Doduo can't switch in safely against Ariados due to its fragility and tendency to wear itself down with recoil damage, having a switch-in to it is a great option to preserve Ariados's HP when it's not Agility boosted or behind Substitute. For this reason, physically bulky Rock-types like Corsola, Onix, and Rhyhorn can make for great partners for Ariados. Ariados's Rock weakness demands strong defensive checks to Rock-types, which gives the aforementioned physically defensive Pokemon great defensive value when paired with Ariados. Similarly, Mightyena can serve to soften the blows from physical attackers with Intimidate, and it can also combat Abra and other Psychic-types. Ariados's ability to break down special walls opens the door to many strong special attackers like Abra and Quilava, since they get stopped in their tracks by Delcatty, Drowzee, and Noctowl. In that same vein, Ariados is strong against Mightyena, which can open the door to physical and mixed attackers like Aipom and Ponyta that prefer not being debuffed by Intimidate.</p>"
      },
      "All-Out Attacker": {}
    },
    "credits": {"writtenBy": [{"user_id": 345087, "username": "JoaF"}, {"user_id": 595639, "username": "plznostep"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 452572, "username": "missangelic"}, {"user_id": 601970, "username": "sleid"}, {"user_id": 272450, "username": "BP"}]}, {"name": "Grammar checked by", "members": [{"user_id": 229690, "username": "queez"}, {"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Corsola": {
    "sets": {
      "Calm Mind": {
        "description": "<p>Corsola has cemented itself as a metagame defining threat thanks to its excellent defensive typing and exceptional bulk. This, combined with its access to reliable recovery and Calm Mind, makes it one of the most potent setup sweepers. Calm Mind allows Corsola to comfortably set up against the variety of Pokemon that struggle to 2HKO it, such as Porygon, Mightyena, and Choice-locked Normal-types like Doduo and Aipom. With two Calm Mind boosts, Corsola can reliably avoid being 2HKOed by its most common offensive checks, Flaaffy, Chinchou, and Quilava, notably also surviving super effective hits like Hidden Power Grass. Recover provides Corsola with a reliable form of recovery, which helps increase the number of setup opportunities available. Refresh prevents it from being forced out by status users such as Porygon, Koffing, and Castform, drastically increasing its setup opportunities and allowing for almost riskless Calm Mind uses. Alternatively, Ice Beam is an option to threaten Tropius and specially defensive Gloom, two of Corsola's biggest defensive answers. Natural Cure lets Corsola heal off status conditions; while somewhat redundant alongside Refresh, it is still Corsola's most useful ability on this set.</p> <p>Corsola excels on balance and bulkier teams that appreciate its defensive typing and setup capabilities. Its premier partner Gloom excels on these kinds of teams. These two make for perfect partners, as Gloom can check Flaaffy, Chinchou, and opposing Corsola and helps with Corsola's susceptibility to being taken advantage of by weather users like opposing Gloom and Seaking. In return, Corsola can soak up physical attacks and threaten to set up on Pokemon that threaten Gloom such as Doduo and physical Seaking. Special walls like Porygon, Drowzee, and Delcatty pair well with Corsola, as they can wall Flaaffy and Quilava. Drowzee is worth mentioning because Corsola can absorb status for it, while Drowzee can pass a Wish to Corsola if it gets too weakened to use Recover. Corsola pairs well with physical wallbreakers like Aipom, Seaking, Volbeat, and Doduo, as they can remove Gloom and other specially defensive checks. Because Corsola can find multiple setup opportunities throughout a game, secondary sweepers and cleaners like Anorith and Beedrill make good teammates. Corsola can wall faster revenge killers such as Aipom, Doduo, and Volbeat or set up mid-game and remove potential checks to Beedrill and Anorith.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 272450, "username": "BP"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 535530, "username": "Gangsta Spongebob"}, {"user_id": 601970, "username": "sleid"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Masquerain": {
    "outdated": true,
    "comments": "<h4>Other Options</h4> <p>Masquerain can opt for a Lum Berry and focus solely on being a special attacker that counters Koffing, but the loss of Petaya Berry may cause it to struggle for power. A Salac Berry can be used as a late-game cleanup option, though it heavily relies on Aipom and Elekid being damaged beforehand. Toxic or Stun Spore can be run alongside Substitute to catch opposing switch-ins like Chinchou off guard; however, this limits Masquerain's coverage options.</p> <h4>Checks and Counters</h4> <p><strong>Special Walls</strong>: Dustox and Delcatty wall Masquerain thanks to their reliable recovery. Dustox can also phaze out Masquerain with Whirlwind to remove any boost. If Masquerain lacks Ice Beam, Grass-types like Sunflora and Bayleef can easily wall it.</p> <p><strong>Spoink</strong>: Substitute Calm Mind Spoink is able to wall an unboosted Masquerain and use it as setup fodder.</p> <p><strong>Faster attackers</strong>: Pokemon like Chinchou and Elekid can outspeed and OHKO Masquerain with Thunderbolt. Physical attackers like Aipom and Pidgeotto can OHKO it with Double-Edge, even with an Attack drop from Intimidate.</p>",
    "sets": {
      "SubPetaya": {
        "description": "<p>Masquerain's wide coverage, excellent base Special Attack, and access to Intimidate allow it to stand out amongst other pinch Berry users. Even without the boost from its Petaya Berry, Masquerain can threaten many attackers and physical walls such as Rhyhorn, Castform, and Staryu. With Substitute, Masquerain can more reliably self-activate Petaya Berry. Hydro Pump is Masquerain's strongest move and has a chance to OHKO both Elekid and Aipom when at +1. Giga Drain provides Masquerain with a form of recovery while keeping it from relying on Hydro Pump's poor accuracy against Rock- and Ground-types such as Rhyhorn and Cubone. Agility allows Masquerain to outspeed and threaten faster attackers such as Aipom, Elekid, and Chinchou. Alternatively, Ice Beam can be used to hit bulky Grass-types such as Sunflora, Bayleef, and Lileep which otherwise wall Masquerain. Ice Beam also allows Masquerain to focus its efforts on wallbreaking rather than relying on Agility to clean. Intimidate allows Masquerain to pivot in on weaker physical attackers, such as Koffing, or attackers that lack strong coverage, such as Shuppet. Masquerain's mediocre base Speed means it appreciates the boost that a Timid nature provides it. This allows it to Speed tie with other base 60 Speed Pokemon such as Wailmer and Growlithe. Modest can also be used but the only notable thing it can accomplish is securing a more favorable chance to OHKO Aipom, which requires the use of Agility.</p> <p>Masquerain thrives on bulky offense builds that appreciate special wallbreakers or late-game cleaners. Masquerain appreciates paralysis support from Pokemon such as Nosepass, Magnemite, and Chinchou. Chinchou deserves a special mention, as it's able to switch into Electric- and Ice-type moves for Masquerain and paralyze offensive threats that outspeed it, such as Elekid and opposing Chinchou. Other sweepers like Bagon, Mankey, and Croconaw appreciate Masquerain's role compression, which allows it to act as a sweeper or wallbreaker. Physical attackers such as Pidgeotto, Aipom, and Cubone can threaten special walls such as Delcatty and Dustox for Masquerain. These physical attackers also threaten Substitute + Calm Mind Spoink, which otherwise turns Masquerain into setup fodder. Dustox makes for a fantastic partner; it can phaze out Spoink with Whirlwind while walling special attackers that threaten Masquerain, such as Elekid and Chinchou. It's also a more reliable check to Koffing, which helps prevent Masquerain from being statused. If Masquerain lacks Ice Beam, Pokemon that can threaten Grass-types such as Growlithe, Pidgeotto, and Seaking are appreciated.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 272450, "username": "BP"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 535530, "username": "Gangsta Spongebob"}, {"user_id": 601970, "username": "sleid"}]}, {"name": "Grammar checked by", "members": [{"user_id": 633500, "username": "StupidFlandrs48"}, {"user_id": 577920, "username": "Tea Guzzler"}]}]}
  },
  "Delcatty": {"sets": {"Special Wall": {}}},
  "Volbeat": {
    "comments": "<h3>Other Options</h3> <p>Volbeat can opt for a special attacking set thanks to its access to Tail Glow and excellent coverage options. However, due to its abysmal Special Attack and mediocre bulk, it finds little opportunity to set up. Moonlight and Thunder Wave can be used to shift Volbeat's role into one of support, but it is generally outclassed in this regard by Gloom. Baton Pass is an option on Choice Band sets to maintain momentum, but this requires dropping valuable coverage.</p> <h3>Checks and Counters</h3> <p><strong>Poison-types</strong>: Poison-types such as Koffing, Ariados, Dustox, and Gloom can all wall Volbeat. However, Gloom and Dustox must be wary of Trick, as it prevents them from utilizing Moonlight effectively. If crippled with Trick, Koffing loses its only longevity in leftovers as well as its ability to use Explosion freely, while Ariados loses its flexibility as a mixed attacker. However, both Koffing and Ariados are able to 2HKO Volbeat with Choice Band Sludge Bomb.</p> <p><strong>Status</strong>: Volbeat's reliance on its Speed and access to Swarm means Toxic, Will-O-Wisp, and Thunder Wave completely neuter it. For this reason, Volbeat cannot risk switching into Porygon, Flaaffy, or Mightyena.</p> <p><strong>Faster Attackers</strong>: Ponyta, Voltorb, and Abra can outspeed and threaten Volbeat if it's already been damaged. However, all are threatened by a Quick Attack.</p> <p><strong>Physical Walls</strong>: Onix, Rhyhorn, and Tropius completely wall Volbeat, and they greatly benefit by obtaining a Choice Band via Trick. Corsola can also wall Volbeat and use it to set up, but it becomes entirely useless if it obtains Volbeat's Choice Band.</p>",
    "sets": {
      "Wallbreaker": {
        "description": "<p>Volbeat stands out among many viable Choice Band users thanks to its access to Swarm, excellent base Speed, and workable bulk. Moreover, due to an overall lack of Bug-resistant Pokemon, Volbeat cements itself as an excellent wallbreaker and late-game cleaner. Signal Beam allows Volbeat to 2HKO stallbreaker Mightyena and 3HKO defensive Mightyena at -1 Attack. With Swarm active, Volbeat has a chance to OHKO a majority of non-Bug-resistant foes, such as Seaking, Anorith, and Flaaffy. Brick Break threatens both Rhyhorn and Onix, which take on non-Swarm Signal Beam. Quick Attack provides Volbeat with a valuable form of speed control, allowing it to revenge kill common pinch Berry users such as Abra, Beedrill, and Quilava. Double-Edge provides Volbeat with a nice midground for bulky Poison-types such as Koffing and Ariados, which otherwise come in for free. Alternatively, Trick can be used to disrupt and cripple physical walls like Gloom and Corsola, as well as special wallbreakers like Flaaffy, Seaking, and Clamperl.</p> <p>Volbeat fits best on balanced and bulky offensive teams that struggle to reliably remove Salac Berry users like Anorith and Beedrill. Strong physical attackers such as Aipom, Doduo, and Ponyta can overload Volbeat's defensive checks such as Tropius, Ariados, and Koffing. Conversely, Volbeat can neuter these defensive checks with Trick, allowing the aforementioned physical attackers more consistency when wallbreaking. Doduo and Ponyta are exceptionally good at this because of their Flying- and Fire-type STAB attacks. Moreover, both have access to Quick Attack, allowing them to revenge kill for each other, as well as significantly reducing the potency of Salac Berry sweepers. Physically defensive Pokemon such as Onix, Koffing, and Corsola can wall physical attackers that Volbeat cannot OHKO without Swarm active, such as Aipom, Castform, and Seaking. Onix is worth a special mention, as its access to Explosion allows it to soften or remove bulkier foes and provide momentum, which can help open up a late-game scenario where Volbeat can clean. Volbeat is incredibly vulnerable to status, so Pokemon with Heal Bell, such as Mightyena, Flaaffy, and Delcatty, make for good teammates. Volbeat struggles with physical walls and priority users, so Pokemon like Gloom and Onix can help remedy this.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 272450, "username": "BP"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 601970, "username": "sleid"}, {"user_id": 479897, "username": "BeatsBlack"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Castform": {
    "comments": "<h3>Other Options</h3> <p>Castform is able to use a Choice Band to some effect, although such a set is largely outclassed by Pokemon such as Aipom and Doduo due to their better offensive stats and physical movepools. Castform can use Thunderbolt to hit Water-types such as Seaking harder on the switch. However, Castform fails to 2HKO Corsola without Hidden Power Grass, which makes this change usually not worth it. Ice Beam can be used on the tank set to threaten Pokemon such as Tropius and Lileep more directly. Alternatively, Fire Blast can be used to threaten physically defensive Gloom, Ariados, and Magnemite in addition to Tropius.</p> <h3>Checks and Counters</h3> <p><strong>Physical Wallbreakers</strong>: Castform is threatened by Pokemon such as Aipom and Doduo, and the latter can notably threaten Castform with an OHKO, although they cannot switch into Castform.</p> <p><strong>Physical Walls</strong>: Castform can struggle to deal meaningful damage versus Pokemon such as Koffing and Tropius, and it is forced out by status such as Will-O-Wisp and Toxic.</p> <p><strong>Magnemite</strong>: If Castform is not running Fire Blast, Magnemite is only 3HKOed by Castform, threatening it with a 2HKO or punishing it with Thunder Wave</p> <p><strong>Rock-types</strong>: Rock-types such as Anorith can use Castform as setup fodder due to not being immediately threatened by any of its moves. Additionally, Corsola is no longer 2HKOed by Hidden Power Grass after a boost from Calm Mind, and thus can continue to set up and threaten Castform with a boosted Surf.</p> <p><strong>Status</strong>: Status such as Will-O-Wisp from Koffing and Toxic from various physical walls can put Castform in KO range of Pokemon such as Choice Band Aipom, and a burn can completely ruin Castform's wallbreaking abilities.</p>",
    "sets": {
      "Tank": {
        "description": "<p>Castform boasts good stats and an offensive typing, which allow it to perform as a tank with great coverage. Castform sets itself apart from other bulky Normal-types, such as Noctowl, with its higher offensive stats and its ability in Forecast that allow Castform to answer weather-based teams more reliably. Return deals decent damage to the majority of the tier. Alternatively, Double-Edge can be used in order to threaten physical walls such as Koffing for more damage at the cost of recoil, which can put Castform in range of being KOed by Pokemon such as Choice Band Aipom. Hidden Power Grass covers Normal-resistant Pokemon such as Corsola and Rhyhorn, 2HKOing the former and OHKOing the latter. Toxic lets Castform threaten general physical walls such as Tropius and Lileep. Alternatively, Thunder Wave can cripple Pokemon such as Aipom and Gloom, making Castform a decent bulky paralysis user. Protect gives Castform a way of scouting Choice Band Pokemon such as Aipom and stalling weather turns. Castform also greatly benefits from the extra passive recovery from Leftovers that using Protect provides. Castform's EV spread allows it to survive a variety of Pokemon such as an OHKO from Choice Band Aipom, a 2HKO from Silk Scarf Ponyta and a 2HKO from Seaking under rain. The Speed investment allows Castform to outspeed base 45 Speed Pokemon like Flaaffy and Magnemite. The rest of Castform's EVs are put into Attack to make it as threatening as possible.</p> <p>Castform fits on a variety of team styles such as balance, bulky offense, and general offense teams, as many teams appreciate the defensive attributes Castform provides combined with its offensive presence. Pokemon like Abra, Aipom, and Quilava appreciate Castform's ability to check Ponyta, with the latter additionally appreciating Castform as a partner to overwhelm Normal-resistant Pokemon like Corsola. Fast Pokemon such as Ponyta and Abra appreciate Castform spreading paralysis to make them much harder to revenge kill. Castform's Toxic wears down walls such as Tropius that otherwise wall physical wallbreakers such as Aipom. Castform itself does not appreciate taking status, so Heal Bell users such as Flaaffy and Mightyena make great partners. Fire-types such as Ponyta and Quilava appreciate Castform's ability to check Rain Dance Seaking, which can take advantage of them to set up. Other setup sweepers such as Beedrill appreciate Castform checking priority users such as Ponyta. While Castform is quite bulky, some physical wallbreakers like Doduo and Meditite can threaten to OHKO it. Pokemon like Koffing can check Meditite and potentially use it as offensive momentum, while Pokemon such as Rhyhorn can switch into Doduo locked into Double-Edge to start wallbreaking.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 595639, "username": "plznostep"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 535530, "username": "Gangsta Spongebob"}, {"user_id": 272450, "username": "BP"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}, {"user_id": 452572, "username": "missangelic"}]}]}
  },
  "Koffing": {
    "comments": "<h3>Other Options</h3> <p>Memento can enable teammates like Beedrill, Drowzee, and Anorith to more safely set up. Destiny Bond can force a trade with offensive Pokemon like Aipom, Quilava, and Ponyta, but Koffing prefers sticking around as a wall rather than trading, and Explosion is less prediction-reliant at this role. Koffing can fit on rain teams as a weather setter with Explosion.</p> <h3>Checks and Counters</h3> <p><strong>Corsola</strong>: Corsola totally walls Koffing and can use it as setup fodder for Calm Mind. Thanks to Natural Cure, Corsola can absorb status from Will-O-Wisp or a Sludge Bomb poison and heal it off by switching out. However, Corsola must be wary of switching into Hidden Power Grass, as it will be forced to use Recover.</p> <p><strong>Psychic-types and Psychic-type Coverage</strong>: Abra, Drowzee, and Smoochum easily dispatch Koffing with STAB Psychic, as do less common Psychic-types like Exeggcute and Spoink. However, Abra and Smoochum cannot take a single Sludge Bomb, and other Psychic-types do not want to risk poison while switching into it. Ariados easily takes Sludge Bomb and threatens Koffing with Psychic, but it prefers not to take a Will-O-Wisp or Flamethrower.</p> <p><strong>Fire-types</strong>: Ponyta, Quilava, and Magby can take advantage of Will-O-Wisp and switch in to threaten Koffing out, though they don't enjoy taking Sludge Bomb.</p> <p><strong>Special Attackers</strong>: Flaaffy, Elekid, and Wartortle require minimal chip damage to KO Koffing thanks to its lower special bulk, though Elekid and other frail special attackers like Chinchou and Staryu don't switch into Sludge Bomb comfortably.</p> <p><strong>Substitute Users</strong>: Tentacool, Beedrill and Anorith can utilize Substitute to avoid Will-O-Wisp and use Koffing as setup fodder. Flamethrower and Hidden Power Water can respectively break the Substitutes of Beedrill and Anorith though.</p>",
    "sets": {
      "Defensive": {
        "description": "<p>Koffing is a great defensive answer to physical attackers and Grass-types like Meditite, Gloom, and Tropius thanks to its good physical bulk, Poison typing, and Levitate. Sludge Bomb threatens offensive Pokemon like Aipom, Seaking, and Doduo and prevents frailer special attackers that would otherwise threaten Koffing like Abra, Quilava, and Elekid from switching in safely. Hidden Power Water 2HKOes Anorith, is likely to 2HKO Cubone, and OHKOes Rhyhorn. Alternatively, Hidden Power Grass hits Corsola hard and retains a good matchup against Cubone and Rhyhorn. Will-O-Wisp debilitates physical attackers like Aipom, Meditite, and Doduo. Flamethrower is a less passive alternative to break Beedrill's Substitute, prevent Magnemite from switching in, and hit Gloom and Ariados harder. Pain Split is Koffing's only recovery option besides Leftovers, but its low base HP means Pain Split gives it decent longevity and easily wears down healthy and high-HP foes like Noctowl, Tropius, and Rhyhorn. A Relaxed nature ensures Koffing's power isn't hindered while trading off Speed that is mostly useless given Koffing usually goes second against most foes, and outspeeding Corsola is less important than losing out on extra power on Hidden Power Grass.</p> <p>Koffing is a good fit for balance and defensive teams thanks to it taking on prominent physical attackers like Aipom, Doduo, and Meditite. Pokemon that struggle against Gloom and Tropius such as Corsola, Wartortle, and Chinchou greatly appreciate Koffing. Delcatty is a standout partner, as it complements Koffing with its special bulk, can keep Koffing healthy with Wish, and appreciates Koffing neutralizing Pokemon like Gloom, Tropius, and Meditite that could overwhelm it. Koffing's vulnerability to special attackers like Abra, Ponyta, and Quilava makes special walls like Porygon, Drowzee, and Noctowl great options to form defensve cores with Koffing, as they appreciate it taking on physical attackers like Seaking and Anorith. Offensive teammates like Aipom, Ponyta, and Quilava love Koffing debilitating other offensive Pokemon so that they can more easily clean up weakened teams. Setup sweepers like Beedrill and Anorith are enabled by Koffing softening up teams for them, and they can take advantage of burned Pokemon for easier setup opportunities.</p>"
      },
      "Sun Setter": {
        "description": "<p>Koffing works as a physically bulky sun setter, setting up in front of Pokemon such as Beedrill and Anorith that threaten other sun staples. Sludge Bomb is able to greatly pressure opposing Grass-types such as Tropius while also being able to discourage physically frail Pokemon like Abra from switching in. Hidden Power Grass is able to chunk threats like Rhyhorn, Corsola, and Seaking. Pain Split allows Koffing to stay healthy throughout the battle while potentially weakening other Pokemon. Explosion can turn Koffing into a sacrifice, potentially setting up a late-game closer like Tropius for victory. The EVs are invested into Defense to make Koffing a bulky physical wall, taking attacks like Double Edge from Ponyta and Doduo.</p> <p>Pokemon such as Tropius and Gloom are great partners for Koffing, being able to exploit the sun very well, while Gloom can also patch up Koffing's lower Special Defense. Fire-types like Ponyta and Quilava also appreciate Koffing's sun-setting capabilities, being able to hit even harder with Fire Blast. Castform also benefits from the sun, nuking opposing Pokemon with Weather Ball. On the flip side, powerful special attackers along the lines of Abra can easily OHKO Koffing on the switch or in a one-on-one scenario. Opposing Ponyta and Quilava are also scary for Koffing, taking advantage of the sun and Koffing's lower Special Defense. Against these Pokemon, bulky Pokemon like specially defensive Mightyena and Noctowl work nicely. +1 Corsola is also really hard for Koffing to break through and take attacks from, even with the sun up and Hidden Power Grass. Chlorophyll users like Tropius and Gloom can deal with Corsola thanks to Solar Beam, although they must be weary of Ice Beam.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 452572, "username": "missangelic"}, {"user_id": 650323, "username": "Pengu"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 535530, "username": "Gangsta Spongebob"}, {"user_id": 595639, "username": "plznostep"}, {"user_id": 601970, "username": "sleid"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}, {"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Pidgeotto": {
    "outdated": true,
    "comments": "<h4>Other Options</h4> <p>Hidden Power Ground can be used to OHKO Magnemite and hit Shuppet, unlike Hidden Power Fighting. However, Hidden Power Ground cannot hit Lileep for significant damage. Hidden Power Flying hits harder than Aerial Ace, but Pidgeotto must then use Steel Wing as coverage, meaning it cannot threaten Pokemon such as Magnemite for a 2HKO.</p> <h4>Checks and Counters</h4> <p><strong>Physical Walls</strong>: Physical walls such as Koffing can switch into Pidgeotto locked into the wrong move and force it out. Most notably, bulky variants of Rhyhorn, Lileep, and Nosepass are not fazed by Pidgeotto's STAB combination or 2HKOed by its coverage, significantly reducing Pidgeotto's offensive presence. Lileep also has Recover to continuously counter Pidgeotto, while Rhyhorn can be problematic for Pidgeotto's team if Pidgeotto gives it a free turn of setup. Physically bulky Steel-types such as Magnemite and Aron don't mind Pidgeotto's STAB combination either, but they must be wary of a super effective Hidden Power.</p> <p><strong>Electric-Types</strong>: Some Electric-types such as Elekid outspeed Pidgeotto and can OHKO it with Thunderbolt; others such as Chinchou can come in and KO Pidgeotto if it's is locked into Aerial Ace. Magnemite resists both STAB types and threatens Pidgeotto with Thunderbolt, although it must be wary of a super effective Hidden Power.</p> <p><strong>Shuppet</strong>: Shuppet is immune to Double-Edge and Hidden Power Fighting, letting it completely stop Pidgeotto with a good prediction</p> <p><strong>Faster Attackers</strong>: Faster attackers such as Aipom, Elekid, Tailow, and Staryu can all outspeed Pidgeotto and threaten it with strong attacks, although they must be careful to avoid getting chipped down into Quick Attack range.</p>",
    "sets": {
      "Physical Wallbreaker": {
        "description": "<p>Pidgeotto stands out as a great physical wallbreaker thanks to its great STAB moves in Double-Edge and Aerial Ace, which can 2HKO common walls such as Dustox, Delcatty, and Bayleef, and its good speed tier outpacing Pokemon such as Butterfree, Castform, and Chinchou. Pidgeotto faces competition from another Normal / Flying type, Taillow, who has a better Speed and a useful ability in Guts. However, Pidgeotto has better attack and bulk. It also avoids OHKOs from walls such as Dustox and Delcatty after Double-Edge recoil, as well as outright OHKOs from powerful attacks such Double-Edge from non-Choice Band Aipom and Castform, and Aerial Ace from Choice Band Delibird. Return can be used over Double-Edge to help Pidgeotto stay healthy, but it will be harder to get targets into KO range. STAB Quick Attack revenge kills faster Pokemon such as Aipom, Elekid, and Delibird. Hidden Power Fighting can threaten Pokemon that don't mind Pidgeotto's STAB combination such as Rhyhorn, Magnemite, and specially defensive Lileep. Steel Wing can be used to ease prediction versus Shuppet, or if you are using Hidden Power Flying over Aerial Ace for the power. Here, Steel Wing lets Pidgeotto still threaten Rock-types like specially defensive Lileep and Nosepass. However, without a super effective Hidden Power, Pidgeotto cannot threaten to 2HKO Steel-Types such as Magnemite.</p> <p>Pidgeotto fits very well on balance and offense teams as a wallbreaker. It can remove Pokemon such as Delcatty, Dustox, and Bayleef, which can open up teammates such as Elekid, Staryu, and Rhyhorn. Pidgeotto appreciates Spikes support from Snorunt and Pineco, which helps chip Pokemon like Elekid and Aipom into Quick Attack range over time. Spikes also allows Pidgeotto to 2HKO Pokemon it normally can't like bulky variants of Rhyhorn. Special walls such as Chinchou and Delcatty are excellent checks to faster special attackers such as Elekid and Staryu, with Delcatty also offering cleric support if Pidgeotto gets burned by Pokemon such as Koffing. Rock-types such as Rhyhorn and Nosepass can switch into Aipom and Taillow's STAB moves as they try to revenge kill Pidgeotto. Nosepass has the added benefit of trapping Magnemite, a common Pidgeotto check. Also, Pidgeotto's Grass resistance also helps Rock-types versus Pokemon such as Bayleef and Butterfree. Special attackers such as Elekid and Spoink can remove physical walls such as Rhyhorn, Magnemite, and Koffing, which allows Pidgeotto to use its STAB moves without being punished.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 595639, "username": "plznostep"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 272450, "username": "BP"}, {"user_id": 535530, "username": "Gangsta Spongebob"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}]}
  },
  "Nidorino": {
    "outdated": true,
    "comments": "<h4>Other Options</h4> <p>Nidorino can opt to use Leftovers to increase its longevity and more easily damage switch ins, but this heavily reduces its effectiveness as a physical wallbreaker. Double Kick is an option over Facade specifically for Substitute Magnemite, however Nidorino almost always prefers Facade in case it gets hit with Will-O-Wisp while trying to weaken Koffing for other physical wallbreakers.</p> <h4>Checks and Counters</h4> <p><strong>Koffing</strong>: Koffing is the most reliable pivot into Nidorino, as it resists Sludge Bomb and is only 3HKOed by Return, giving it time to Nidorino's with Will-O-Wisp. While this does strengthen Facade, it still lacks the power to KO Koffing even after two uses of Return.</p> <p><strong>Steel-types</strong>: Aron and Magnemite can both switch into Nidorino if it's locked into Sludge Bomb and threaten it with Earthquake and Thunderbolt respectively. They also make safe switch-ins to Nidorino's Normal-type coverage moves. Both must be wary of Hidden Power Fighting, however.</p> <p><strong>Shuppet</strong>: Shuppet is immune to Nidorino's Fighting- and Normal-type coverage. However, as a Substitute user it can easily be crippled by poison from Nidorino's Sludge Bomb, which 2HKOes it despite resisting the move.</p> <p><strong>Protect Users</strong>: Protect users such as Castform, Seaking, and Delcatty can all scout the move Nidorino locks itself into, making it easier to switch into.</p> <p><strong>Faster Attackers</strong>: Elekid, Chinchou, and Aipom can all outspeed Nidorino and threaten it with their STAB-boosted attacks.</p> <p><strong>Ground-types</strong>: While neither like being poisoned by Sludge Bomb, Rhyhorn and Cubone can severely threaten Nidorino with Earthquake.</p>",
    "sets": {
      "Wallbreaker": {
        "description": "<p>Nidorino sets itself apart from other Choice Band users thanks to its Poison typing, excellent Attack stat, and rarely-seen ability Poison Point. STAB-boosted Sludge Bomb is incredibly dangerous to switch into for non Steel- or Poison-type Pokemon due to its high chance to inflict poison. Rock- and Ground-type Pokemon, most notably Rhyhorn and Cubone, are dissuaded from switching in because of the poison chance due to their tendency to use Substitute. Return provides Nidorino with an option against opposing Poison-types that may attempt to switch in such as Dustox, Grimer, and Koffing. Hidden Power Fighting allows Nidorino to threaten Steel-type Pokemon like Aron and Magnemite. Facade allows Nidorino to deal some semblance of damage even after being burned by Koffing. An Adamant nature is chosen to make use of Nidorino's fantastic Attack; using Jolly doesn't enable Nidorino to outspeed anything notable.</p> <p>Nidorino fits best on balance and offense teams that appreciate the likelihood of it spreading poison. Nidorino's access to Poison Point in conjunction with Sludge Bomb can open up opportunities for wallbreakers and setup sweepers by poisoning bulkier Pokemon. Other physical attackers such as Aipom, Rhyhorn, and Cubone appreciate Nidorino as a secondary wallbreaker. Due to its lacking Speed, Nidorino appreciates help from Thunder Wave users such as Nosepass, Chinchou, and Magnemite. Chinchou deserves a special mention, as it's able to threaten Koffing as well as Rock- and Ground-types that Nidorino can only hope to poison such as Rhyhorn and Cubone. Butterfree makes for a fantastic partner, as it's able to remove Koffing with Psychic and use Sleep Powder against Pokemon that would otherwise threaten Nidorino such as Chinchou. Nidorino struggles against special attackers, so specially defensive Pokemon such as Castform, Dustox, Delcatty, and Sunflora are integral for supporting it. Specially defensive Poison-types such as Dustox and Grimer are often forced to come in on Nidorino in fear of a Sludge Bomb, so special attackers such as Elekid and Chinchou appreciate Nidorino's ability to weaken them with its Normal coverage.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 272450, "username": "BP"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 535530, "username": "Gangsta Spongebob"}, {"user_id": 601970, "username": "sleid"}]}, {"name": "Grammar checked by", "members": [{"user_id": 633500, "username": "StupidFlandrs48"}, {"user_id": 577920, "username": "Tea Guzzler"}]}]}
  },
  "Gloom": {
    "comments": "<h3>Other Options</h3> <p>Defensive Gloom can use Stun Spore to support its teammates and punish offensive switch-ins like Ponyta and Quilava, and it's especially helpful against offensive Pokemon Gloom cannot otherwise threaten, such as Beedrill and Ariados. However, Leech Seed is more noxious to Pokemon looking to exploit or wall Gloom, such as Porygon, Drowzee, and Magnemite. Gloom can use Razor Leaf instead of Hidden Power Grass to bypass Corsola's Calm Mind boosts with a critical hit, but it cannot use Razor Leaf and Leech Seed on the same set.</p> <h3>Checks and Counters</h3> <p><strong>Koffing</strong>: Swords Dance Gloom is very unlikely to break through Koffing on its own, specially defensive Gloom can only wear it down with Leech Seed, and both are punished by Will-O-Wisp burns. However, Koffing is easily broken by sun sweeper Gloom and is quite passive against it without Flamethrower.</p> <p><strong>Fire-types and Fire-type Coverage</strong>: Ponyta and Quilava take advantage of Gloom setting sun for itself to sweep and burn it down with their super effective STAB attacks. However, they cannot take repeated or boosted hits from Sludge Bomb. Sun sweeper Gloom struggles to beat Castform, but Castform outside of sun must watch out for Swords Dance variants and can be worn down by specially defensive Gloom. Although not a Fire-type itself, Flaaffy threatens to 2HKO non-specially defensive Gloom with Fire Punch.</p> <p><strong>Magnemite</strong>: Swords Dance Gloom is setup fodder for Magnemite, although other Gloom variants can break Magnemite with Hidden Power Fire or Hidden Power Fighting.</p> <p><strong>Ariados</strong>: Ariados takes little damage from most of Gloom's moves and can pressure it with Sludge Bomb and Psychic, although it's vulnerable to being overwhelmed by Hidden Power Fire in sun and Leech Seed chip damage long-term.</p> <p><strong>Flying-types</strong>: Tropius can be threatened by Sludge Bomb but threatens Gloom back with Hidden Power Flying. Doduo's frailty can make it vulnerable to Gloom's Sludge Bomb, but its strong Drill Peck deals significant damage to even bulkier Gloom sets, and Quick Attack can let it pick off sun sweeper Gloom. Noctowl's fantastic special bulk is a pain for sun sweeper Gloom, and sets with Psychic also pressure it.</p> <p><strong>Psychic-types</strong>: Abra and Smoochum can't switch into Gloom's Sludge Bomb safely but threaten it with their powerful STAB moves. Drowzee has the bulk to take a hit from Gloom but lacks the immediate power of other Psychic-types.</p>",
    "sets": {
      "Specially Defensive": {
        "description": "<p>Gloom's typing and Special Defense stat make it one of the best choices against common threats like Corsola and Seaking, and it can even survive super effective attacks at full health from threats like Abra and Ponyta. Sludge Bomb is used to hit defensively weak Pokemon for respectable damage, scoring an OHKO on Abra and a 2HKO on Ponyta and Doduo. Hidden Power Grass is used to hit opposing Water-types like Chinchou, Wartortle, Seaking, and especially Corsola. Razor Leaf is a more niche alternative Grass-type STAB move that can be a strong option versus Calm Mind-boosted Corsola by threatening with a higher chance of a critical hit. Leech Seed can enable progress on threats that resist Gloom’s attacks like Ariados and Koffing, and it also provides safer switches for Gloom’s team. Stun Spore provides Gloom and its team speed control, which can make common threats like Ponyta, Aipom, and Beedrill much more manageable and also enable slower partners like Clamperl to outspeed and OHKO foes. Moonlight is chosen over Synthesis because it is compatible with Leech Seed. Leftovers is chosen to give Gloom additional recovery and longevity.</p> <p>This Gloom set fits best as a defensive backbone on balance teams that need support against specially offensive threats like Seaking, Flaaffy, and Corsola. Intimidate Mightyena has strong defensive synergy alongside Gloom, helping to deal with otherwise threatening physical attackers like Anorith, Aipom, and Volbeat. Mightyena can also serve to check certain special attackers that threaten Gloom such as Abra as well as other Psychic-types like Drowzee, Exeggcute, and Smoochum. Heal Bell on Mightyena is a great option that can patch up a statused Gloom. Heal Bell Flaaffy is an alternative cleric that can allow Gloom to stay in on more threats like opposing Fire Punch Flaaffy without fear of permanent burn. Gloom’s reluctance to stay in versus Quilava makes bulky Water-types such as Corsola, Seaking, and Wartortle as well as Flash Fire Ponyta strong pairings alongside Gloom. Corsola is another excellent defensive ally that fits nicely on Gloom teams, since the two cover up each other’s weaknesses with their typings. Corsola can be especially useful for helping Gloom switch out from strong Choice Band users like Aipom, Ponyta, and Doduo. Ponyta and Quilava both appreciate a strong switch-in against Water-types like Corsola and Seaking and thus pair nicely alongside Gloom. Stun Spore is an excellent way to enable slower offensive attackers like Clamperl, Cubone, and Rhyhorn. Poison-types like Koffing, Dustox, Ariados, and Beedrill can wall Gloom, especially when it's not running Leech Seed. This makes heavy hitters like Abra and Anorith great teammates to break walls that otherwise slowly deal with Gloom one-on-one. Other physical walls like Flamethrower Koffing can also be great partners to help Gloom better manage Poison-type and Bug-type threats alike. Swords Dance Tropius is another great option that can help manage Pokemon that resist Gloom's attacks, but it can expose the team with a greater Fire weakness. Specially defensive Gloom can unfortunately be exploited as setup fodder in the face of Anorith, Beedrill, and Abra. This makes priority attackers like Ponyta, Volbeat, Doduo, and Meditite great teammates that can alleviate this weakness. Gloom’s weakness to Noctowl offers another reason why certain physical attackers pair nicely with it, like Anorith and Rhyhorn.</p>"
      },
      "Sun Sweeper": {
        "description": "<p>With Chlorophyll shoring up Gloom's terrible Speed, it can make full use of its high Special Attack and great bulk to be a potent sun sweeper. In sun, Solar Beam can even 2HKO some foes that resist Grass such as Ponyta and Quilava. Hidden Power Fire hits Grass-types such as Tropius and opposing Gloom as well as Magnemite. It also threatens certain Poison-types such as Koffing, Ariados, and Beedrill. Synthesis provides Gloom with recovery to help it remain healthy while it trades blows with foes such as opposing Gloom and Koffing. The given EV spread maximizes Gloom's Special Attack while allowing it to outspeed base 95 Speed Pokemon, such as Elekid, while in sun. The longevity provided by Leftovers can be eschewed in favor of Lum Berry preventing a foe such as Porygon from paralyzing Gloom once.</p> <p>Gloom best fits on offense teams looking for a potent sun sweeper, being mandatory on dedicated sun teams and excellent on semi-sun teams. Gloom and other Chlorophyll sweepers such as Tropius and Exeggcute are able to weaken and remove each other's shared checks. Sun setters, such as Ponyta, can help Gloom by setting up sun and luring in Pokemon it checks such as Corsola and Clamperl. Gloom is notably very effective at removing Water-types such as Corsola, making it a natural teammate for Pokemon such as Aipom, Doduo, and Ponyta. Gloom struggles with Fire-types such as Ponyta and Quilava; while sun is active, Gloom can deal heavy damage to them with Solar Beam, but is usually OHKOed back; outside of sun, Gloom is completely helpless. Checks to them such as Flash Fire Ponyta and Chinchou make for great partners as a result. While it also hates taking Fire-type moves, Tropius can take advantage of Gloom's sun with Chlorophyll and, depending on its Attack investment, even OHKO most Fire-types with Earthquake. Offensive variants of Tropius can serve as potent checks to Gloom, outspeeding it even in sun and 2HKOing it with Hidden Power Flying or Fire, making checks to it such as Porygon good partners. Castform is a danger to most sun teams due to its good bulk and ability turning it into a Fire-type while in sun, making checks to it such as wallbreakers in Aipom and Doduo and bulky Pokemon in Noctowl and Koffing good teammates. There are a few special walls such as Porygon and Noctowl that can wall Gloom, making it appreciate support from strong physical wallbreakers such as Aipom and Doduo.</p>"
      },
      "Swords Dance": {
        "description": "<p>Gloom is a great bulky setup sweeper in ADV ZU thanks to its defensive typing and reliable recovery. Gloom's defensive profile grants it plentiful setup opportunities against passive Pokemon like specially defensive Gloom, Delcatty, and Lileep. STAB Sludge Bomb breaks down common physically defensive Pokemon like Tropius and Mightyena, and it has solid neutral coverage to prevent fast attackers like Ponyta and Quilava from switching in freely. Hidden Power Grass destroys Corsola and other Pokemon resistant to Poison, like Cubone and Rhyhorn. Full investment in HP and Defense creates more setup opportunities for Gloom, makes it more resilient to Pokemon unable to 2HKO it such as Castform and Volbeat, and prevents physically offensive wallbreakers like Aipom and Meditite from OHKOing Gloom.</p> <p>Gloom reliably answering Corsola benefits Aipom, Ponyta, and Doduo. Corsola benefits from Gloom checking Meditite, Tropius, and opposing Gloom, while Gloom gains from Corsola, checking threats to it like Choice Band Aipom and Doduo. Gloom can almost never break Koffing on its own, so it appreciates partners that can handle Koffing, such as Seaking, Corsola, and defensive Noctowl. Fast cleaners like Abra, Quilava, and Volbeat greatly benefit from Gloom breaking holes in teams so they can more easily finish off weakened targets. Psychic-type moves from Pokemon like Abra, Drowzee, and Smoochum chew through Gloom, so Mightyena and Magnemite are helpful to mitigate these threats. Fast Fire-types like Ponyta and Quilava are a threat to Gloom, and teammates like Wartortle, Castform, and Lileep manage these foes for it. Gloom struggles to prevent Beedrill from setting up freely on it, so it benefits from partnering with Quick Attack users like Ponyta, Quilava, and Doduo to prevent Beedrill from sweeping. Flaaffy threatens to 2HKO Gloom with Fire Punch, so partners that check it, such as Chinchou, Dustox, and Delcatty, are all helpful.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 345087, "username": "JoaF"}, {"user_id": 452572, "username": "missangelic"}, {"user_id": 535530, "username": "Gangsta Spongebob"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 272450, "username": "BP"}, {"user_id": 535530, "username": "Gangsta Spongebob"}, {"user_id": 601970, "username": "sleid"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}, {"user_id": 594256, "username": "GraveBee"}, {"user_id": 649096, "username": "a blue banana"}, {"user_id": 384270, "username": "autumn"}]}]}
  },
  "Mankey": {
    "outdated": true,
    "comments": "<h4>Other Options</h4> <p>Mankey can choose to use Rock Slide over Earthquake on its Salac Berry set to threaten Dustox, though this means it has to rely on a strengthened Reversal to reliably threaten Rhyhorn and Aron.</p> <h4>Checks and Counters</h4> <p><strong>Status Users</strong>: Toxic can invalidate Mankey's Salac Berry set, while Will-O-Wisp and Thunder Wave invalidate both sets. If Mankey lacks Rock Slide, Butterfree and Exeggcute can switch in and threaten Mankey with Psychic or hinder a switch-in with Sleep Powder. However, Mankey outspeeds almost every status user in the tier bar the tie it has with Butterfree as well as Elekid if it is running Toxic.</p> <p><strong>Faster Attackers</strong>: Due to how frail Mankey is, it can easily be revenge killed by faster attackers such as Aipom and Elekid. If Salac Berry hasn't activated or Mankey isn't behind a Substitute priority users such as Pidgeotto, Taillow, and Delibird can prevent Salac Berry Mankey from sweeping with Quick Attack.</p> <p><strong>Koffing</strong>: Koffing walls both of Mankey's sets due to its resistance to Fighting and immense physical bulk, and it can render it useless with Will-O-Wisp.</p>",
    "sets": {
      "Choice Band": {
        "description": "<p>Mankey's above-average Speed tier, excellent Attack, and its status as the only viable Fighting-type allow it to carve out a niche as a Choice Band user. STAB-boosted Cross Chop threatens common physically defensive walls such as Nosepass and Lileep while 2HKOing bulkier Pokemon that don't resist Fighting such as Cubone and Croconaw. Lileep finds itself as the physically defensive backbone on a plethora of different teams, and this allows Mankey to standout because of its adeptness at threatening it with Cross Chop. Earthquake provides Mankey with a more accurate option against Fire-types like Growlithe and Cyndaquil and Electric-types such as Chinchou, Magnemite, and Elekid. Mankey is able to outspeed the previous two and is able to avoid being OHKOed by Elekid's Thunderbolt while at full health. Rock Slide threatens Dustox and Flying-types like Pidgeotto, Tailow, and Delibird that may try to switch in on an Earthquake. Because of the sheer amount of switches Mankey forces, Focus Punch is a viable option, allowing it to heavily damage or OHKO would be switch-ins like Bayleef. Vital Spirit provides Mankey with an opportunity to switch into Butterfree on a Sleep Powder; however, Mankey Speed ties with maximum Speed Butterfree and gets OHKOed by Psychic if it loses the tie.</p> <p>Mankey excels on balance and offense teams that need a dedicated offensive Lileep check. Normal-types such as Pidgeotto, Aipom, and offensive Castform, as well as Petaya Berry Butterfree, appreciate Mankey being able to remove Lileep for them. Special attackers such as Chinchou, Elekid, Growlithe, and Staryu can remove Koffing, which otherwise completely walls Mankey. Dustox makes a great partner, as it walls Koffing and can threaten it with Psychic. Because of its poor bulk, Mankey struggles with faster attackers such as Elekid, so Pokemon with access to Thunder Wave such as Aipom, Nosepass, and Magnemite pair well with it. Utility Aipom appreciates how much Mankey threatens Lileep, which it otherwise struggles to remove due to its lack of Choice Band. Additionally, Nosepass also makes for a great partner, as its excellent bulk makes it an excellent pivot for Mankey into faster attackers like Pidgeotto. Special walls such as Delcatty, Sunflora, and Grimer can shut down special attackers that Mankey can't outspeed such as Elekid, Staryu, and Butterfree.</p>"
      },
      "Salac Sweeper": {
        "description": "<p>Mankey stands out in ADV ZU as the only viable Fighting-type thanks to its excellent base Attack in conjunction with its decent base Speed. These aspects alongside a Salac Berry and its access to Reversal allow Mankey to act as a frightening late-game sweeper. Substitute allows Mankey to avoid status while also providing it with a reliable way to activate its Salac Berry. STAB-boosted Reversal, when at full power, OHKOes almost every Pokemon that doesn't resist Fighting bar Bayleef. Earthquake provides Mankey with an option to hit Pokemon without relying on a weakened Reversal. It also threatens Poison-types that resist Reversal such as Grimer and Dustox while also threatening Shuppet, which is otherwise immune to Fighting. Bulk Up allows Mankey to function outside of or in conjunction with its Salac Berry as a setup sweeper. The most notable instance of this is allowing it to 2HKO Dustox with Earthquake at +2. Additionally, at +1, Mankey has a chance to OHKO Bayleef with a full-power Reversal.</p> <p>Mankey fits best on bulky offense and balance builds that require a late-game sweeper. Koffing is Mankey's biggest threat because of its resistance to Reversal as well as its immunity to Earthquake, so Pokemon that can threaten it such as Dustox, Magnemite, and Staryu all pair well with it. Physical walls such as Nosepass, Koffing, and Lileep can stifle the presence of faster physical attackers such as Pidgeotto and Aipom. Mankey struggles against Dustox, so Pokemon that can remove it such as mixed Seaking and Rhyhorn pair well with it. Elekid is one of Mankey's most common offensive checks, so Pokemon that can threaten it such as Castform, Delcatty, and Sunflora are all apreciated. Dustox is worth mentioning as it acts as a fantastic special wall capable of checking Elekid while also providing Toxic support.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 272450, "username": "BP"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 535530, "username": "Gangsta Spongebob"}, {"user_id": 601970, "username": "sleid"}]}, {"name": "Grammar checked by", "members": [{"user_id": 552227, "username": "Kinetic"}, {"user_id": 633500, "username": "StupidFlandrs48"}, {"user_id": 297659, "username": "deetah"}, {"user_id": 577920, "username": "Tea Guzzler"}]}]}
  },
  "Growlithe": {
    "outdated": true,
    "comments": "<h4>Other Options</h4> <p>Flash Fire can be used to help Growlithe switch into certain Fire-types, such as Cyndaquil and opposing Growlithe, though most Pokemon with Fire-type moves, like the aforementioned examples, still have the coverage to threaten Growlithe. Roar can be used to phaze targets, though Growlithe's lack of recovery and only decent bulk make it hard to use. Charcoal boosts the power of Growlithe's Overheat, though other items typically help Growlithe fulfill its given role better.</p> <h4>Checks and Counters</h4> <p><strong>Water-types</strong>: Hidden Power Grass fails to OHKO any relevant Water-type, while Growlithe is usually OHKOed by the Water STAB moves from threats such as Staryu, Chinchou, and Seaking. Chinchou is also notable for its ability to cripple Growlithe with Thunder Wave.</p> <p><strong>Rock-types</strong>: Nosepass isn't 2HKOed by unboosted Hidden Power Grass and can 2HKO Growlithe back with Rock Slide. However, it can only 3HKO Growlithe if it had its Attack lowered by Intimidate. Certain specially defensive Rhyhorn sets can tank a Hidden Power Grass from Timid Growlithe, though it can only OHKO Growlithe back if its Attack isn't lowered.</p> <p><strong>Special Sponges</strong>: Delcatty isn't 2HKOed by any of Growlithe's moves and can heal off the damage with Wish and status with Heal Bell. Castform easily tanks Growlithe's attacks and can overwhelm it with Double Edge, Thunderbolt, or Weather Ball in Rain. While Lileep isn't a special wall, it can easily switch into Growlithe and heal off any damage off with Recover, though it must watch out for Toxic.</p> <p><strong>Spoink</strong>: If Growlithe isn't running Crunch, Spoink can use it as setup fodder thanks to Thick Fat. Toxic variants of Growlithe can cripple Spoink, though they lose to speedy Substitute variants.</p> <p><strong>Cyndaquil</strong>: Cyndaquil can outspeed and 2HKO Growlithe with Hidden Power Water while only being 2HKOed back by Fire Blast.</p>",
    "sets": {
      "Agility Sweeper": {
        "description": "<p>After using Agility, Growlithe outspeeds the entire unboosted metagame, making it an effective cleaner. Fire Blast serves as a powerful and spammable STAB attack that notably breaks past the tier's best special wall, Dustox. After Growlithe's Petaya Berry activates, it becomes unwallable, as even the sturdiest walls, like Lileep and Delcatty, are 2HKOed by it. Hidden Power Grass OHKOes Rhyhorn and also deals significant damage to Water-types such as Chinchou and other Rock-types like Nosepass. Substitute shields Growlithe from status and also lets it activate its Petaya Berry easier. Alternatively, Crunch lets Growlithe target Spoink, which can otherwise set up on it using Calm Mind and Thick Fat. Intimidate is used, as reducing the foe's Attack gives Growlithe more opportunities to set up Agility and Substitute.</p> <p>Growlithe best fits on offensive and balance teams looking for an end-game sweeper. Even with Hidden Power Grass, Water-types such as Staryu beat Growlithe one-on-one, so it appreciates being paired with speedy physical wallbreakers such as Aipom and Taillow and defensive checks to Water-types such as Castform and Chinchou. Chinchou is a notable partner for its excellent type synergy with Growlithe, as it can easily KO the Rock- and Ground-types that Growlithe can struggle with, while Growlithe, in return, can eliminate the Grass-types that give Chinchou trouble. The aforementioned physical wallbreakers have the added benefit of breaking through special walls and tanks such as Castform and Delcatty, which also check Growlithe. Fast physical wallbreakers are themselves problematic to Growlithe before it has set up Agility, so Rock-types, Steel-types, and Shuppet support Growlithe by checking them. Special attackers like Elekid and Seaking can form effective offensive cores with Growlithe by weakening each other's checks. Finally, Spikes support from Snorunt can help soften up the opposing team to allow an end-game Growlithe sweep.</p>"
      },
      "Lead": {
        "description": "<p>While Cyndaquil may appear to be the superior Fire-type lead because of its ability to deny Snorunt any entry hazards, Growlithe carves a niche with its stronger matchups against the general metagame. 76 Defense EVs and Intimidate let Growlithe always survive one Choice Band-boosted Double Edge from Aipom, which by extension lets it beat most physically offensive leads. Overheat is crucial, OHKOing common offensive leads such as Taillow and Delibird and having an 87.5% chance to OHKO Aipom. Flamethrower is a more spammable Fire-type STAB attack, though Fire Blast can be used instead for higher power at the cost of accuracy. Hidden Power Grass threatens Rhyhorn and also deals significant damage to Water-types such as Chinchou and Rock-types such as Nosepass. Toxic lets Growlithe cripple walls such as Lileep and non-Substitute Spoink. Crunch can be used instead to overwhelm Substitute variants of Spoink, which can otherwise use Growlithe as setup fodder. Lum Berry prevents Growlithe from getting statused by leads such as Butterfree.</p> <p>Growlithe best fits on offense and balance teams looking for a lead that can beat physically offensive leads. Given that Growlithe can't reliably deny Snorunt at least one layer of Spikes, it is best used on a team that either doesn't mind Spikes or has a spinner in the back, like Staryu. Water-types such as Staryu and Chinchou can usually beat Growlithe one-on-one if they switch into its Fire-type attacks, so special sponges such as Castform and Dustox make great partners. Chinchou itself is a great partner, with it able to break through the Water-, Rock-, and Ground-types that annoy Growlithe and spread Thunder Wave to shore up Growlithe's average Speed; in return, Growlithe can break through Grass-types for it. Physical wallbreakers such as Aipom and Taillow also work well because of their ability to break through both Water-types and special walls that could overwise beat Growlithe. If a team doesn't have a Rock-type, a Steel-type, or Shuppet, such as on certain hyper offense teams, Growlithe can sometimes be used as a check to physical wallbreakers like Choice Band Aipom and Taillow, though it shouldn't be a team's sole check to them.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 535530, "username": "Gangsta Spongebob"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 272450, "username": "BP"}, {"user_id": 601970, "username": "sleid"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Abra": {
    "comments": "<h3>Other Options</h3> <p>Abra has the option to run additional offensive coverage in Fire Punch for Magnemite at the expense of utility. Abra can also run status moves as alternatives to Encore or Substitute. Toxic can be paired with Substitute to take on otherwise defensive checks like Noctowl, Delcatty, and Drowzee, wearing them down with Toxic. Thunder Wave can be useful on teams that may benefit from speed control like Clamperl offense.</p> <p>Calm Mind or Substitute can be ran alongside three attacks to provide Abra even stronger coverage. Encore offers Abra more defensive utility, but opting for Encore over additional coverage moves opens up the risk of not being able to guarantee crucial KOs on Pokemon like Corsola with Hidden Power Grass, Tropius with Ice Punch, and Magnemite with Fire Punch.</p> <h3>Checks and Counters</h3> <p><strong>Priority Attackers</strong>: Doduo, Ponyta, and Volbeat can easily revenge kill a damaged Abra with their priority Quick Attack and even OHKO it when they’re holding a Choice Band. Fake Out from Meditite, while less common, can also threaten Abra out. Even Quick Attack from Pokemon like Quilava can finish off an Abra that has reduced its HP down to 25% with Substitute.</p> <p><strong>Faster Attackers</strong>: Elekid and Voltorb can finish off a weakened Abra or use Explosion against it in Voltorb’s case. Agility users and weather-based attackers such as Ariados, Tropius, and Seaking can threaten to outspeed and OHKO Abra in certain conditions.</p> <p><strong>Psychic-Immune Pokemon</strong>: Mightyena can come in for free on Psychic or take unboosted special attacks fairly well and threaten to OHKO Abra back.</p> <p><strong>Special Walls</strong>: Noctowl, Delcatty, and Porygon as well as Mightyena can take unboosted attacks and threaten to OHKO Abra.</p> <p><strong>Drowzee</strong>: Seismic Toss Drowzee can take on Abra one-on-one without fear of taking much damage in return. Drowzee with status moves can invalidate an Abra without a Lum Berry or Encore as well.</p> <p><strong>Magnemite</strong>: Magnemite resists most common damaging moves from Abra and can stifle its ability to make an impact in battle.</p>",
    "sets": {
      "Special Attacker": {
        "description": "<p>Abra is a huge threat with its combination of Speed and Special Attack. It outspeeds and can revenge kill many weakened foes like Quilava, Aipom, Flaaffy, and Seaking. Calm Mind makes Abra an even stronger attacker and allows it to 2HKO even special walls like Porygon and Delcatty with Psychic after a single boost. Encore disrupts setup sweepers like Anorith and Beedrill as well as defensive threats like Wartortle and Delcatty by locking them into an unthreatening move. This offers Abra more setup opportunities and can make up for its poor defenses. Substitute pairs well with Petaya Berry to ensure it can be activated and is a safer way to boost Abra's offensive power without risking an OHKO. STAB Psychic threatens a 2HKO on many common foes such as Flaaffy and Seaking, making Abra very difficult to switch into and very powerful as a revenge attacker. Hidden Power Grass threatens mainly Corsola with the potential to OHKO it without a boost but can also serve to hit Water-types really hard and KO them with additional damage. Ice Punch threatens Tropius with 4x super effective damage and can also be an option over Hidden Power Grass to hit Mightyena and Lileep slightly harder. Petaya Berry coupled with Abra’s Special Attack allows it to swiftly clean up chipped teams, even 2HKOing special walls like Delcatty and Porygon with a +1 Psychic. Lum Berry is a great alternative to absorb and return status to preserve when Abra can be a threat without the additional power from Petaya. Lum Berry is ideal when running Encore + Calm Mind and no substitute. A Timid nature is recommended to outspeed the entirety of the tier outside of Voltorb and Elekid as well as Ponyta, which Abra Speed ties with.</p> <p>Abra fits both on offensive and defensive teams as a late-game sweeper and constant disruptor with the threat of Encore. Abra is at its strongest when it’s preserved to clean up late-game after its checks are dealt with or in a health range that allows Abra to KO them. This makes defensive pivots critical on any team with Abra to cover a number of common threats. Koffing can take on common physical attackers like Ponyta, Beedrill, Anorith and common Choice Band users like Meditite, Doduo, Seaking, and Aipom when they’re locked into a resisted move. Intimidate Mightyena and Normal-resistant Pokemon like Corsola, Rhyhorn, and Anorith can come in on Quick Attack users as well as opposing Abra and also do respectable damage to special walls that can get in Abra's way. Abra benefits greatly from a safe switch in due to its fragility, which makes strong Baton Pass users such as Ariados, Meditite, and Delcatty great pairings. Ariados can come in on Mightyena and threaten it out with a strong STAB Signal Beam while also taking on other threats with good coverage in Sludge Bomb and Psychic for Koffing and Beedrill. Abra’s extremely poor bulk makes it an easy target for priority users, notably Doduo, Ponyta, and Meditite. Specially defensive pivots are required alongside Abra to counteract opposing special walls that are not yet in range of a KO. Ariados can serve as a strong Mightyena switch-in and additionally functions as a slow pivot via Baton Pass. Delcatty can serve as a special wall and cleric support for Abra and other offensive threats on the team. Specially defensive Gloom and Noctowl can be great alternative options. Gloom can come in on many threats like Corsola and Mightyena and force progress with Stun Spore or Leech Seed. Noctowl can slowly wear down Pokemon that Abra doesn’t threaten like Mightyena or Drowzee. Abra enjoys being paired with additional sweepers that can enable its sweep. Options like Anorith can break through special walls like Noctowl, Delcatty and Porygon that can get in Abra's way. Weather sweepers like Seaking and Tropius can also open up Abra's offensive gameplan by putting opposing teams in KO range of its attacks. Choice Band wallbreakers like Ponyta and Mightyena can offer much of the same by damaging foes that tend to slow down Abra.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 345087, "username": "JoaF"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 601970, "username": "sleid"}, {"user_id": 272450, "username": "BP"}]}, {"name": "Grammar checked by", "members": [{"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Weepinbell": {"sets": {"Sun Sweeper": {}}},
  "Tentacool": {"sets": {"Swords Dance": {}}},
  "Ponyta": {
    "comments": "<h3>Other Options</h3> <p>Ponyta can use Toxic on its mixed attacker set to help against Lileep and Water-types, but this necessitates the loss of Quick Attack or its coverage move, which hinders Ponyta's offensive capabilities. Ponyta can opt to compress both its mixed attacking set and its Sunny Day set into one set; however, this requires the loss of Quick Attack.</p> <h3>Checks and Counters</h3> <p><strong>Bulky Water-types</strong>: Ponyta can be walled by bulky Water-types like Wartortle, Corsola, and Seaking. Seaking can tank a Double-Edge into a Quick Attack with no defensive investment and remove Ponyta with Choice Band-boosted (hyphen) Return or a Water-type move on its Rain Dance set. Corsola is a common check, as Double-Edge into Hidden Power Grass from Ponyta does not KO it. However, Corsola is unable to reliably OHKO Ponyta in return with Surf and must be wary of Hidden Power Grass on the switch in.</p> <p><strong>Castform</strong>: Castform can completely shut down and threaten to 2HKO Sunny Day Ponyta with Return and its ability Forecast. Mixed attacker Ponyta doesn't fare much better, as Double-Edge 3HKOes bulky Castform, while Castform's Return always OHKOes Ponyta after Double-Edge recoil. Moreover, if Ponyta lacks a Lum Berry, it is easily crippled by Castform using Toxic or Thunder Wave.</p> <p><strong>Physical Walls</strong>: Physical walls such as Lileep, Tropius, and Mightyena can prove to be troublesome for Ponyta. Lileep can completely wall mixed attacker Ponyta, and Sunny Day Ponyta fails to 2HKO Lileep with Fire Blast without the weather boost. Tropius can tank a Fire Blast outside of sun and threaten Ponyta with Earthquake. Moreover, Tropius outspeeds Ponyta with Chlorophyll activated. Mightyena can prove to be a nuisance for mixed attacking Ponyta with Intimidate and its customizable bulk.</p> <p><strong>Status Users</strong>: Toxic users such as Quilava, Mightyena, Porygon, and Drowzee are able to heavily reduce the number of times Ponyta can use Double-Edge. Paralysis spreaders like Porygon, Drowzee, Magnemite, and Gloom can invalidate Ponyta's usefulness as a fast attacker. Porygon and physically defensive Drowzee can wall mixed attacker Ponyta and cripple it with Toxic or Thunder Wave.</p> <p><strong>Priority Users</strong>: Due to Ponyta's poor Defense, it becomes extremely susceptible to being revenge killed by other priority users like Volbeat, Doduo, and opposing Ponyta. Choice Band Doduo can 2HKO Ponyta with Quick Attack.</p>",
    "sets": {
      "Fast Mixed Attacker": {
        "description": "<p>Ponyta cements itself as a metagame-defining threat thanks to its incredible Speed and Attack stats. As a fast mixed attacker, Ponyta can threaten a majority of the metagame. Moreover, Ponyta's ability Flash Fire grants it excellent defensive utility against other Fire-types like Quilava and Magby and lets it absorb Hidden Power Fire from sun sweepers. Double-Edge is Ponyta's strongest option due to the lack of offensive Normal-resistant Pokemon. Ponyta tends to get worn down fairly quickly while using Double-Edge; Return is a viable option over Double-Edge to prevent this. The only downside is a 15% decrease in power, making it more difficult for Ponyta to threaten foes it soft checks like Castform, Tentacool, and Chinchou. Fire Blast threatens physically bulkier foes like Tropius, Gloom, and Magnemite. Hidden Power Grass threatens Corsola with a 2HKO, preventing it from switching in safely. Hidden Power Ground can be used for a better matchup against Fire-types such as opposing Ponyta, Quilava, and Magby. Quick Attack provides Ponyta with a valuable form of speed control, allowing it to revenge kill common pinch Berry users like Abra, Quilava, and Beedrill. Choice Band can be used over Silk Scarf to guarantee the Quick Attack KO on Salac Berry Beedrill and Quilava after activating their Berry. Choice Band also allows Ponyta to OHKO Quilava and opposing Ponyta with Hidden Power Ground. Due to Double-Edge being generally riskless, using Leftovers is a viable option to help mitigate the recoil. This decrease in power means Ponyta requires chip damage on Pokemon like Aipom and Quilava before it can threaten them.</p> <p>Ponyta's excellent Speed tier, its potency as a mixed attacker, and its priority access allow it to excel in almost any team structure. Fast physical wallbreakers like Aipom, Volbeat, and Doduo appreciate Ponyta's ability to threaten physical walls such as Corsola, Koffing, and Mightyena. In return, Ponyta appreciates the added offensive pressure these attackers provide, which can help open an endgame in which Ponyta can clean. Physically defensive Pokemon such as Corsola, Tropius, Gloom, and Koffing appreciate Ponyta checking physical wallbreakers Aipom, Volbeat, and Doduo. Corsola is worth a special mention, as Ponyta can threaten Gloom for it. In return, Corsola can set up on common Ponyta checks like Porygon, Castform, Wartortle, and bulky Mightyena. In that same vein, special walls like Drowzee, Gloom, Porygon, and Delcatty appreciate how Ponyta can check Aipom, Volbeat, and Doduo. Special attackers such as Clamperl, Flaaffy, Quilava, and Abra appreciate Ponyta weakening special walls like Drowzee, Porygon, Gloom, and Delcatty. Flaaffy can check Corsola for Ponyta, allowing it the freedom to use Hidden Power Ground. In return, Ponyta checks Quilava, which OHKOes Flaaffy with Overheat.</p>"
      },
      "Sunny Day": {
        "description": "<p>Ponyta's excellent Speed tier and strong special moves allow it to shine as the premier Sunny Day user. Besides supporting its teammates, Sunny Day allows Ponyta to weaken incoming Water-types that may attempt to check it, such as Corsola, Wartortle, and Seaking. Fire Blast, while threatening on its own, becomes incredibly hard to withstand while boosted by sun. Solar Beam allows Ponyta to threaten the previously mentioned Water-types and Rock-types. It's important to note that Ponyta has a chance to OHKO bulky Wartortle with Solar Beam if it first switches into a Fire Blast. Hidden Power Ground allows Ponyta to threaten Fire-types such as Quilava, Ponyta, and Magby. Quick Attack may also be used as a safety net against Salac Berry users. It is recommended to not run maximum Speed on Chlorophyll teammates. Toxic weakens potential switch-ins early in the game before using Sunny Day later. Lum Berry allows Ponyta to disregard status users such as Porygon, Magnemite, and Gloom, resulting in more opportunities to use Sunny Day. Charcoal increases the potency of Fire Blast, and it most notably decreases the chip damage needed to KO Gloom and Tropius with Fire Blast outside of sun. It also secures the Fire Blast 2HKO on Porygon while sun is active. Run Away is used instead of Flash Fire so that Ponyta can reliably damage Porygon if it attempts to switch in.</p> <p>Ponyta fits almost exclusively on teams that center around the usage of Sunny Day. Moreover, its viability as a Sunny Day user allows it to function on semi-sun teams as well. Chlorophyll users like Gloom, Tropius, Sunflora, and Nuzleaf all benefit from Ponyta as a Sunny Day user. These Chlorophyll users can set Sunny Day on their own as well, which prevents Ponyta from needing to come in multiple times to use it. Tropius is worth mentioning, as Ponyta can weaken or remove physical walls that may prevent Tropius from sweeping. Ponyta appreciates physical wallbreakers like Aipom, Seaking, Volbeat, and Doduo to weaken or remove special walls like Drowzee, Porygon, and Tentacool. On semi-sun teams, if Ponyta chooses to use Charcoal, then a Heal Bell user such as Flaaffy or Mightyena is beneficial. Flaaffy is worth noting, as it forms a potent special attacking core with Ponyta. Flaaffy also benefits from Sunny Day, as it can OHKO Volbeat and reliably 2HKO specially defensive Gloom with Fire Punch in sun.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 272450, "username": "BP"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 535530, "username": "Gangsta Spongebob"}, {"user_id": 601970, "username": "sleid"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}, {"user_id": 452572, "username": "missangelic"}]}]}
  },
  "Magnemite": {
    "comments": "<h3>Other Options</h3> <p>Instead of Hidden Power Water, Magnemite can run Hidden Power Ice. This helps a lot with overwhelming Grass-types like Gloom. Hidden Power Ice does miss some key OHKOs though, notably against Rhyhorn and Onix. Hidden Power Grass can still achieve these KOs while having the added benefit of beating Chinchou, but it can struggle against Fire-types like Ponyta and Quilava.</p> <h3>Checks and Counters</h3> <p><strong>Fire-types</strong>: Fire-types such as Ponyta and Quilava can easily outspeed and OHKO Magnemite.</p> <p><strong>Gloom</strong>: Gloom can outlast all of Magnemite's attacks and can chip it down with Leech Seed, but defensive Gloom sets will need assistance in taking down Magnemite, especially if Magnemite has a Substitute up.</p> <p><strong>Electric-types</strong>: Electric-type Pokemon such as Chinchou and Fire Punch Elekid are issues for Magnemite, easily taking a Thunderbolt while firing back with Surf or a super effective Fire Punch.</p> <p><strong>Bulky Ground-types</strong>: Bulky Ground-types that can survive Hidden Power Water such as Cubone and Onix are able to switch in on Electric-type attacks and retaliate with super effective Ground-type attacks.</p> <p><strong>Fast Attackers</strong>: Powerful and fast attackers that have ways to threaten Magnemite such as Doduo and Meditite can easily outspeed and OHKO Magnemite with Hidden Power Ground and Brick Break, respectively.</p>",
    "sets": {
      "Substitute + Status": {
        "description": "<p>Magnemite acts as a bulky status spreader that can use its Steel typing to take advantage of passive Pokemon such as Gloom, defensive Mightyena, and Delcatty by chipping them down with Toxic and setting up Substitute. Hidden Power Water threatens Ground-types such as Rhyhorn and Onix. Substitute is useful against Pokemon that can't touch Magnemite such as Gloom and can be used to avoid Thunder Wave. Using Substitute allows Magnemite to rack up more Toxic damage while also letting it go for a paralysis if using Thunder Wave. Toxic helps break through walls like Porygon and Drowzee and is Magnemite's only good option against Chinchou. Thunder Wave hinders faster foes like Aipom and Volbeat and punishes Toxic-immune Pokemon like Gloom and Dustox. The Speed investment allows Magnemite to outspeed maximum Speed Cubone and Clamperl as well as defensive Noctowl sets, allowing Magnemite secure a 3HKO against it. The bulk investment allows Magnemite's Substitute to survive Hidden Power Grass from both Gloom and Koffing.</p> <p>Frail sweepers like Abra appreciate Magnemite's ability to spread status, as it chips down walls such as Porygon or paralyzes potential threats such as Doduo, Aipom, and Elekid. Allies that struggle with passive Pokemon like Drowzee appreciate Magnemite's capability to set up on them, as it is able to chip the foes down with Toxic and set up Substitute for free. Fire-types like Ponyta and Quilava appreciate Magnemite removing Water-types like Clamperl and Wartortle with ease. Faster foes that run Hidden Power Ground such as Doduo are an issue for Magnemite, since they easily OHKO it. Physical walls like Koffing and Lileep can switch in on these threats and threaten them back. Cubone is bulky enough to survive Hidden Power Water, and it can retaliate with a powerful Ground-type attack. Ground-immune Pokemon such as Koffing and Tropius are helpful because they gladly switch into Ground-type attacks. Fire-types like Ponyta can also easily blow through Magnemite, so Water-types like Wartortle and special walls like Porygon can help by safely switching in on a Fire Blast. Bulky Electric-immune or -resistant Pokemon like Chinchou, Flaaffy, and Gloom can be difficult for Magnemite to handle because they exert enough pressure to outlast Toxic or are just immune to its moves. Powerful wallbreakers like Aipom can help KO or significantly chunk these threats. Magnemite is able to use its defensive typing to assist allies that struggle with Pokemon such as Beedrill and Porygon.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 650323, "username": "Pengu"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 452572, "username": "missangelic"}, {"user_id": 601970, "username": "sleid"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Doduo": {
    "comments": "<h3>Other Options</h3> <p>A Salac Berry set with Flail and either Substitute or Endure can turn Doduo into a setup sweeper, but Doduo's bad defensive profile makes it an inconsistent sweeper, and ADV ZU has a plethora of Quick Attack users between Ponyta, Quilava, and opposing Doduo. Hidden Power Fighting covers Corsola, Mightyena, and Magnemite in one slot but makes Doduo's Speed IV a point lower, causing it to lose instead of speed Speed tie against opposing Doduo, Beedrill, and Anorith.</p> <h3>Checks and Counters</h3> <p><strong>Physical Walls</strong>: Corsola can switch into Doduo and can heal off any damage with Recover, while Doduo needs chip damage to 2HKO Corsola with Hidden Power Ground as it switches in. Tropius and Lileep can withstand attacks other than Drill Peck and force Doduo to wear itself down with Double-Edge recoil. Mightyena's Intimidate makes Doduo easier for it and its teammates to handle. Koffing and Wartortle can withstand a Double-Edge and potentially KO Doduo once it's chipped enough.</p> <p><strong>Faster Attackers</strong>: Aipom, Ponyta, and Quilava outspeed and easily OHKO Doduo or force it out due to its frailty. Abra OHKOes Doduo but must be wary of Quick Attack as do other weakened or frail faster attackers like Elekid, Staryu, and Voltorb. Ponyta and Quilava themselves can use Quick Attack to outprioritize Doduo.</p> <p><strong>Residual Damage</strong>: Doduo's low HP stat and recoil from Double-Edge quickly wear it down and can potentially KO it. The turn-ending effect of Doduo KOing itself can be used to deny recovery to defensive Pokemon like Corsola, Gloom, and Lileep in order to set up a teammate to finish them off.</p> <p><strong>Status</strong>: Doduo is frail and easily worn down by the recoil from Double-Edge, so it does not want to risk even switching into Toxic from passive targets like Mightyena, Porygon, and Noctowl. A burn from Koffing's Will-O-Wisp will neutralize Doduo. Paralysis from Thunder Wave from Porygon and Castform as well as Flaaffy's Static is debilitating to Doduo given its frailty and reliance on its Speed to avoid being KOed itself.</p>",
    "sets": {
      "Choice Band": {
        "description": "<p>Doduo is a powerful Choice Band wallbreaker and revenge killer in ADV ZU on account of its good Speed, great Attack, and few defensive answers to Normal-types in the metagame. Many Pokemon slower than Doduo like Seaking, Clamperl, and Meditite are OHKOed by Double-Edge. Certain physical walls like Koffing and Tropius cannot reliably switch into Doduo, while Mightyena and Wartortle are worn down switching into repeated attacks. Quick Attack compensates for Doduo's good but not amazing Speed and picks off weakened offensive Pokemon like Aipom, Ponyta, and Quilava, notably OHKOing Abra. Quick Attack is useful to finish off weakened Speed-boosting setup sweepers like Tropius, Gloom, Beedrill, and Ariados. Drill Peck deals over 80% damage to physically defensive Gloom, reliably 2HKOes physically defensive Tropius, and lacks the recoil damage of Double-Edge. Hidden Power Ground is Doduo's best coverage move for the few relevant physically bulky Pokemon that resist Normal in the tier, enabling it to 2HKO Corsola with some chip damage, OHKO Magnemite, and 2HKO Rhyhorn.</p> <p>Doduo is a good fit on offensive and balanced teams that appreciate both wallbreaking and revenge killing. Aipom is Doduo's most significant competition thanks to its greater bulk, Speed, and coverage, although Doduo's greater power and Quick Attack distinguish it from Aipom. Doduo threatening specially bulky Pokemon like Porygon, Noctowl, and Delcatty is appreciated by special attackers like Sunny Day Gloom, Abra, and Quilava, which return the favor to Doduo by beating physical walls like Corsola, Koffing, and Magnemite. Doduo's frailty leaves it unable to deal with Pokemon it invites in like Corsola, Mightyena, and Lileep, so it depends on defensive partners like Gloom, Corsola, and Koffing to compensate for its lacking defensive value. Doduo's frailty leaves it quickly worn down when using Double-Edge and rarely able to switch in for free, so partners using Baton Pass like Delcatty can bring Doduo in safely. Toxic users like Ponyta, Mightyena, and Porygon support Doduo by chipping down foes, wearing down Heal Bell Mightyena, and luring in Delcatty for Doduo to dispatch. Pokemon like Gloom, Koffing, and Corsola struggle against late-game cleaners and sweepers such as Abra, Ponyta, Quilava, and Sunny Day Gloom and Tropius, so Doduo's strong Quick Attack is much appreciated.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 452572, "username": "missangelic"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 535530, "username": "Gangsta Spongebob"}, {"user_id": 272450, "username": "BP"}]}, {"name": "Grammar checked by", "members": [{"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Grimer": {
    "outdated": true,
    "comments": "<h4>Other Options</h4> <p>Hidden Power Water can be used for its ability to smash Rhyhorn while at the same time providing a means to hit Aron and Ground-types such as Cubone for heavy damage. Likewise, Hidden Power Ground can be used to lure in Magnemite and Aron, and at the same time deal significant damage to Rhyhorn. However, it is difficult to justify using either Hidden Power over any of Grimer's other moves. Grimer can be used as a weather setter due to its access to Rain Dance, Sunny Day, and Explosion.</p> <h4>Checks and Counters</h4> <p><strong>Ground-types</strong>: Rhyhorn's double resistance to Poison means that even a boosted Sludge Bomb does negligible damage, while it can easily KO Grimer with Earthquake and abuse its presence to set up a Substitute and threaten the rest of Grimer's team. Other Ground-types such as Cubone and Numel can do the same, but their lower bulk and single resistance to Poison mean they can't switch in as easily, and due to its lack of Leftovers, Cubone in particular is very susceptible to Sludge Bomb's poison chance.</p> <p><strong>Steel-types</strong>: Magnemite and Aron are immune to Grimer's Sludge Bomb, meaning they cannot be harmed by non-Hidden Power sets.</p> <p><strong>Physical Wallbreakers</strong>: Physical wallbreakers such as Aipom and Taillow can overwhelm Grimer before it can set up.</p> <p><strong>Koffing</strong>: Koffing can run Taunt or Haze to completely shut down Grimer, with the former denying Grimer the ability to set up or use Rest and the latter letting Koffing easily PP stall Grimer.</p> <p><strong>Phazers</strong>: Phazers such as Dustox and Wailmer can stop Grimer's sweep, though this does not work against a Grimer that is the last Pokemon on its team.</p>",
    "sets": {
      "CroMer": {
        "description": "<p>Grimer's good bulk, combined with its access to Curse, lets it turn both prominent special attackers, such as Elekid and Staryu, and walls, such as Delcatty and Lileep, into setup fodder. Rest allows Grimer to avoid being worn down, while Sleep Talk prevents Grimer from being passive while it's asleep. Maximum investment into Grimer's special bulk allows it to sponge special hits as effectively as possible, complimenting Curse's Defense boost.</p> <p>Grimer best fits on teams looking for a win con that can also function as a special wall against threats such as Elekid and Cyndaquil. Grimer traditionally sees itself used on balance and bulky offense teams, though Rain offense can also make use of its high special bulk and ability to pick off weakened foes. Grimer is incapable of making any meaningful progress against Magnemite, Rhyhorn, and Aron, and thus checks to them are essential for it to function. The former can be handled by special tanks and walls, such as Chinchou or bulky variants of Castform, who have the added benefit of acting as a substitute special wall if Grimer is forced out while asleep. Rhyhorn and Aron, on the other hand, can usually be checked by Water- and Grass-types such as Staryu and Bayleef. Koffing is another notable partner, as while it and Grimer share the same typing, Koffing completely walls Rhyhorn and Aron, neutering 2 of Grimer's worst matchups, while in return, Grimer handles special attackers that give Koffing trouble. Delcatty is another partner that deserves a special mention, as it can use Wish and Heal Bell to keep Grimer healthy, but its cleric sets also struggle to touch the same Pokemon Grimer struggles with. Finally, Rock- and Steel-types such as Lileep and Magnemite make good partners due to their ability to check powerful Normal-type attackers such as Aipom and Taillow, who can usually overwhelm Grimer before it can set up.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 535530, "username": "Gangsta Spongebob"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 272450, "username": "BP"}, {"user_id": 479897, "username": "BeatsBlack"}]}, {"name": "Grammar checked by", "members": [{"user_id": 277988, "username": "dex"}]}]}
  },
  "Onix": {
    "comments": "<h3>Other Options</h3> <p>Toxic lets Onix wear down walls like Tropius, Corsola, and Lileep that it wouldn't otherwise beat on its own, but Onix has to give up one of one of its non-STAB moves for it. Dropping Substitute hurts Onix's defensive utility, going without Explosion takes away from Onix's offensive potential, and not using Protect hinders Onix's longevity and ability to scout.</p> <h3>Checks and Counters</h3> <p><strong>Special Attacks</strong>: Water- and Grass-types like Seaking and Gloom have no problem OHKOing Onix with their 4x super effective STAB attacks, and Abra hardly needs any prior chip damage to OHKO Onix. Hidden Power Grass coverage from Fire-types like Ponyta and Quilava, Flaaffy, and Normal-types like Doduo and Noctowl easily disposes of Onix.</p> <p><strong>Bulky Pokemon</strong>: Walls like Gloom, Porygon, and Mightyena can easily stomach Onix's attacks, only fearing Explosion. Corsola and Tropius have the bulk to withstand even super effective attacks from Onix and heal off the damage. Lileep, especially physically defensive variants, is especially good at walling Onix.</p> <p><strong>Fighting- and Ground-type Attacks</strong>: Meditite has a 75% chance to OHKO Onix, but it must mind its poor bulk and lower Speed. Aipom, Volbeat, and Anorith have Fighting-type moves to 2HKO or 3HKO Onix. Cubone and Rhyhorn can generally tank Earthquake from Onix and retaliate with their own stronger Ground-type attacks, the former being able to hit Onix while behind a Substitute if using Bonemerang.</p>",
    "sets": {
      "Substitute": {
        "description": "<p>Enormous Defense and a Rock typing give Onix a helpful position in ADV ZU as a check to physical attackers like Doduo, Beedrill, Anorith, and offensive Mightyena. Onix's solid base 70 Speed makes it a uniquely fast tank compared to other Rock-types like Corsola and Rhyhorn, as it can get the jump on otherwise troublesome special attackers like Flaaffy, Seaking, and Chinchou. Substitute lets Onix use the free turns it generates against Normal-types like Aipom and Doduo to better position itself against potential switch-ins like Corsola and Rhyhorn, and revenge killers like Hidden Power Grass Ponyta, Quilava, and Abra are thwarted by Onix's Substitute. Explosion lets Onix remove or make enormous dents in troublesome walls like Gloom, Porygon, and Koffing. In addition, it lets Onix trade with major offensive threats like Clamperl and Seaking that it wouldn't otherwise OHKO. Substitute synergizes with Explosion by letting Onix scout common users of Protect, such as Castform, Noctowl, and Seaking. Onix can use Protect itself over Explosion, enabling it to scout faster Choice Band users like Aipom, Doduo, and Volbeat for their Ground- and Fighting-type coverage moves. Protect also grants Onix extra passive recovery from Leftovers, which is an asset considering it has no other recovery. 176 Speed EVs and a Jolly nature make Onix faster than Meditite, neutral-natured Seaking and Chinchou, and offensive Mightyena. Choice Band Doduo only has a 1.2% to 2HKO Onix with Hidden Power Ground after Leftovers recovery when it has 176 HP EVs. The remaining EVs are dumped into Attack to give a much-needed boost to Onix's power, notably pushing Explosion over OHKO thresholds against targets like Porygon, Gloom, and Cubone, and the extra power helps Onix wallbreak more effectively against foes like Noctowl and Flaaffy without opening itself up to being KOed back.</p> <p>Onix shores up both the defensive backbone and speed control of offense and bulky offense teams. Its Explosion removing or heavily damaging bulky foes can open up a variety of teammates; Ponyta, Quilava, Beedrill, and Anorith thrive as cleaners from the holes Onix can blow into cores relying on bulky Water-types like Clamperl, Seaking, and Wartortle; Abra and specially offensive Ponyta love Porygon being out of the picture and having a Rock-type like Onix to tank Quick Attack from Doduo; Meditite can finish off weakened Koffing and Tropius, and Onix can handle faster Normal-types like Aipom and Doduo for it. Special walls like Gloom, Porygon, and Noctowl make up for Onix's awful special bulk, and they form complementary defensive cores with it thanks to its ability to answer physical attackers like Anorith and Beedrill. Wish support from Delcatty and Drowzee and Leech Seed support from Gloom and Tropius can provide some additional recovery for Onix, which otherwise lacks recovery beyond Leftovers. Onix is quite passive, even against targets it hits super effectively like Corsola, so it depends on more offensive teammates to pick up its slack; Seaking and Ponyta can handle Koffing, Clamperl and Gloom pressure Corsola, and offensive Mightyena and Meditite can beat Castform and Porygon.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 452572, "username": "missangelic"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 272450, "username": "BP"}, {"user_id": 479897, "username": "BeatsBlack"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Drowzee": {"sets": {"Defensive": {}, "Sub CM": {}}},
  "Voltorb": {
    "sets": {
      "Offensive": {},
      "Weather Lead": {
        "description": "<p>Voltorb is a threatening lead option for rain teams thanks to its high Speed stat and access to Explosion. Rain Dance is almost always used first, setting up the rain for sweepers such as Seaking and Horsea. Once rain has been set up, Voltorb can use Explosion to safely get in rain sweepers like Horsea without wasting any more turns of rain. Thanks to Silk Scarf, Explosion OHKOes bulky Pokemon such as Gloom and Noctowl. Thunder 2HKOs Corsola, preventing it from tanking Explosion. Thunder can also pressure Protect users like Mightyena and Seaking, stopping them from absorbing Explosion with Protect. Taunt can stop opposing weather setters, notably Koffing, Tropius, Gloom, Ponyta. As an alternative option, Voltorb can use Hidden Power Water to threaten Ground-types like Onix and Rhyhorn, which would otherwise safely wall Voltorb. Voltorb takes full advantage of Static when against physical attackers such as Aipom, potentially hindering them for the whole game. A Naive nature is used over Hasty to keep Voltorb's attacks strong while also surviving Earthquake from sun sweeper Tropius. With the full Attack investment, Explosion OHKOes bulky foes such as Gloom.</p> <p>Pokemon that benefit from rain, like Seaking, Wartortle, Horsea, and Lombre, are all great partners for Voltorb, as they all highly appreciate Voltorb as a rain setter that safely gets them in with Explosion. Even with Taunt at Voltorb's disposal, Tropius is still an issue, as it can take Voltorb's attacks and come back later to set sun. For this, rain sweepers that carry Ice-type coverage like Seaking help pin Tropius. Ice-type coverage also covers other Grass-types like Lileep. Rhyhorn and Onix can wall Voltorb if it lacks Hidden Power Water, though Voltorb's teammates cover for its inability to hit Ground-types.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 650323, "username": "Pengu"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 452572, "username": "missangelic"}, {"user_id": 272450, "username": "BP"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Exeggcute": {
    "outdated": true,
    "comments": "<h4>Other Options</h4> <p>Exeggcute can opt to run a second status move like Toxic or Stun Spore over Psychic, but it would then be completely walled by Koffing alongside the other Poison-types that it already struggles with. It can also opt to run 136 Speed EVs to outspeed offensive Rhyhorn, although this greatly takes away from its role as a wall.</p> <h4>Checks and Counters</h4> <p><strong>Special Attackers</strong>: Delibird and Elekid both greatly threaten Exeggcute, but they have to worry about switching into Sleep Powder.</p> <p><strong>Fire-types</strong>: Growlithe and Cyndaquil are in a class of their own because they can safely come in on Exeggcute, since they commonly run Lum Berry, and outright OHKO it.</p> <p><strong>Bulky Poison-types</strong>: Poison-types like Grimer and Dustox aren't bothered by Exeggcute, as Grimer is 3HKOed by Psychic and Dustox 4HKOed. Grimer can bypass sleep with Sleep Talk, while Dustox is naturally faster and can threaten it with Toxic.</p> <p><strong>Choice Band Users</strong>: Aipom and Pidgeotto can come in and 2HKO Exeggcute, although they do have to worry about being put to sleep and taking chip damage on switch-ins.</p> <p><strong>Lileep</strong>: Lileep can sit on Exeggcute and wear it down with Toxic and Rock Slide while Exeggcute does very little back. Exeggcute can put it to sleep with Sleep Powder, but it finds difficulty taking it down one-on-one unless it gets favorable sleep turns and Special Defense drops.</p> <p><strong>Bug-Type Moves</strong>: With Exeggcute having a 4x weakness to Bug, it has to be aware of Seaking and Rhyhorn, which typically carry Megahorn and outspeed it.</p>",
    "sets": {
      "Physical Wall": {
        "description": "<p>Exeggcute is a physical wall that is able to pressure balance teams with Sleep Powder and Psychic. Sleep Powder is used for switch-ins such as Growlithe and Delibird, which can then allow a check to come in safely. It can also immobilize special walls, allowing special attackers to have an easier time taking them down. Psychic is its strongest move that can chunk Poison-types that want to come in on Exeggcute like Koffing and Grimer. It also does great damage to offensive switch-ins like Elekid, Cyndaquil, and Delibird, which limits their opportunity to come in more than once on it. Giga Drain does well against the aforementioned offensive threats as well as offensive Water-types like Seaking or Staryu that want to come in and KO it. Synthesis is a reliable form of recovery to keep Exeggcute around to do its job for longer.</p> <p>Exeggcute is preferred on balance and offense teams who are looking for a physical wall that can open up opportunites for its teammates. Sleep Powder helps set-up sweepers like Growlithe, Cubone, and Larvitar come in and possibly get off a free boosting move or Substitute. Special walls such as Nosepass and Delcatty can work well alongside Exeggcute, since it can deal with physical attackers like Cubone and Aron for them. On the other hand, these special walls can help Exeggcute because they can deal with special attackers like Growlithe and Elekid that want to come in on Exeggcute, although they have to be mindful of coming into a STAB-boosted Psychic more than once. It also appreciates teammates such as Magnemite and Aron that can take on Poison-types like Grimer and Dustox. Aron also has the added benefit of handling the Choice Band users like Pigdeotto and Aipom that can 2HKO Exeggcute with their STAB attacks; however, Aron needs to be aware of their Fighting-type coverage. Although, Nosepass performs this job better, since it can wall those physical attackers and cripple them with Thunder Wave.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 601970, "username": "sleid"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 535530, "username": "Gangsta Spongebob"}, {"user_id": 272450, "username": "BP"}]}, {"name": "Grammar checked by", "members": [{"user_id": 577920, "username": "Tea Guzzler"}]}]}
  },
  "Cubone": {
    "comments": "<h3>Other Options</h3> <p>An Adamant nature makes Cubone much stronger at the much steeper cost of being outsped by Timid Clamperl sets, Chinchou, and uninvested Mightyena variants. Rock Slide hits Flying- and Bug-types like Tropius and Volbeat harder, Double-Edge is already quite strong and much more damaging to Koffing and other neutral targets.</p> <h3>Checks and Counters</h3> <p><strong>Koffing</strong>: Koffing isn't 2HKOed by Cubone and runs Hidden Power types that are super effective against Cubone, though it must be careful about being worn into range of a +2 Double-Edge.</p> <p><strong>Grass-types</strong>: Gloom and Tropius have the bulk to withstand an attack from Cubone and threaten it back with Solar Beam after setting up with Sunny Day. However, both of them are outsped by Cubone and risk it setting up with Swords Dance as they switch in.</p> <p><strong>Water-types</strong>: Wartortle and Seaking can survive one attack from Cubone and threaten it back with their Water-type moves. Chinchou cannot switch in against Cubone, but it does OHKO it with Surf.</p> <p><strong>Special Attackers</strong>: Quilava can OHKO Cubone with Fire Blast thanks to its poor special bulk. Abra has a good chance to OHKO Cubone, and it can use Substitute to activate its Petaya Berry and guarantee its chances to do so. Flaaffy, Elekid, and Magnemite all hit Cubone hard with their super effective coverage moves. However, only Porygon has the bulk to withstand a hit from Cubone, and many special attackers need Cubone to be chipped down before they can KO it.</p> <p><strong>Strong, Faster Physical Attackers</strong>: Cubone's low Speed leaves it prone to revenge killers after just a bit of chip damage. Doduo has a good chance to OHKO Cubone with Double-Edge, while Aipom and Meditite can reliably take out Cubone once it's below 80% HP. Volbeat is one of few faster attackers with good odds to survive either of Cubone's attacks, but it's incapable of OHKOing Cubone after some chip damage.</p>",
    "sets": {
      "Swords Dance": {
        "description": "<p>Cubone is a terrifying wallbreaker thanks to Thick Club and its STAB Earthquake tearing through physical walls like Corsola, Rhyhorn, and Onix. Bonemerang trades some of Earthquake's reliability to break Substitute, strengthening Cubone's matchups against users like Anorith, Beedrill, and Onix. Swords Dance makes Cubone capable of blowing through even physical walls like Koffing and Tropius, and it can use it to take advantage of opponents attempting to switch in a weakened Pokemon as a sack. Double-Edge has effectively perfect coverage with Earthquake, destroying Koffing, Noctowl, and Volbeat. Substitute protects Cubone from Koffing's Will-O-Wisp and Mightyena's Toxic, and these two Pokemon would otherwise be the only Pokemon that can switch in and take a hit after Cubone has used Swords Dance. Similar to Swords Dance, Substitute also capitalizes on the switches Cubone often forces as a wallbreaker. Additionally, Substitute gives Cubone a cushion against revenge killers given its lackluster Speed. Rock Head lets Cubone use Double-Edge without fear of recoil damage. Thick Club is required to power up Cubone's underwhelming Attack stat, and the flexibility to switch moves that it provides differentiates Cubone from Choice Band wallbreakers like Anorith, Volbeat, and Doduo.</p> <p>Cubone fits best on balance and offense teams looking for an especially powerful wallbreaker. Balance teams can compensate for Cubone's defensive shortcomings with bulky partners like Koffing, Tropius, Delcatty, and Noctowl. Delcatty is an especially good supporting partner to Cubone with Wish, Heal Bell, and Baton Pass, and Cubone destroys the Rock-types that Delcatty invites in. Fast offensive Pokemon, including Ponyta, Abra, and Aipom, can more easily clean up teams that Cubone weakens, and they compensate for its underwhelming Speed. Paralysis support from Gloom, Flaaffy, Porygon, and Castform enables Cubone to outspeed and run over paralyzed foes. Baton Pass users like Aipom, Ariados, and Delcatty offer Cubone much safer positioning, and they tend to lure in physical walls and Rock-types for it to threaten. Physical walls like Corsola and Koffing can handle fast Choice Band Normal-types like Aipom and Doduo that would threaten to revenge kill Cubone.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 452572, "username": "missangelic"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 272450, "username": "BP"}, {"user_id": 601970, "username": "sleid"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Rhyhorn": {
    "comments": "<h3>Other Options</h3> <p>An alternative spread with maximum Speed and Attack investment can be run to outspeed defensive Tropius, Sunflora, and Drowzee, though doing so makes Rhyhorn less effective as a tank. Running Substitute instead of Protect lets Rhyhorn block status moves like Koffing's Will-O-Wisp and take advantage of switches it forces against Normal-types like Aipom, but Rhyhorn struggles to fit it over any of its moves without losing out on its great coverage or the utility of Protect for scouting and passive recovery.</p> <h3>Checks and Counters</h3> <p><strong>Water-types</strong>: Seaking and Clamperl have the bulk to take an Earthquake from Rhyhorn, Wartortle can survive two hits, and all of them can OHKO Rhyhorn. Chinchou and Tentacool cannot switch into Earthquake, but both of them outspeed Rhyhorn and can take it out. Despite its Ground weakness, Corsola has the bulk to survive an attack from Rhyhorn and OHKO it with Surf.</p> <p><strong>Grass-types and Grass-type Coverage</strong>: Swords Dance Gloom has the physical bulk to wall Rhyhorn despite lacking a Ground resistance, and all of its sets threaten Rhyhorn with their Grass-type moves. Sunny Day Tropius variants have the bulk to survive a Rock-type move from Rhyhorn and set up in front of it, and physically defensive Tropius isn't 2HKOed by Rock Slide. Though not all of them switch in against Rhyhorn safely, foes like Noctowl, Castform, Ponyta, and Quilava commonly run Hidden Power Grass.</p> <p><strong>Meditite and Fighting-type Coverage</strong>: Although Meditite cannot take an Earthquake from Rhyhorn, it does threaten to OHKO it. Choice Band physical attackers like Aipom, Anorith, and Volbeat often run Brick Break, threatening to 2HKO or 3HKO Rhyhorn with good prediction. However, they're often unable to tank more than one hit themselves.</p> <p><strong>Koffing</strong>: Levitate lets Koffing switch into Earthquake with impunity, and Rhyhorn is neutered by Koffing's Will-O-Wisp.</p>",
    "sets": {
      "Tank": {
        "description": "<p>Rhyhorn's great physical bulk, solid Attack, and Rock typing distinguish it as an excellent tank in the face of top-tier Normal-types like Aipom and Doduo. Rhyhorn is much more powerful than other Rock-types like Onix and Lileep, and its powerful Earthquake ravages a tier with few Ground-resistant Pokemon. Rock Blast breaks past Substitute users like Anorith and Beedrill, but Rock Slide's consistent damage and higher accuracy make it more reliable. Megahorn 3HKOes defensive Mightyena even after Intimidate, and it destroys Lileep and other Bug-weak Grass-types. Protect helps Rhyhorn scout Choice Band users like Aipom, Anorith, and Volbeat to determine if it's safe to stay in and attack. In addition, the move lets Rhyhorn maximize its passive recovery from Leftovers. 204 HP and 20 Defense EVs give Rhyhorn enough bulk to generally avoid a 2HKO from Choice Band Aipom's Brick Break and survive Swords Dance Anorith's boosted Brick Break. 136 Speed EVs let Rhyhorn outspeed uninvested base 40 Speed Pokemon like Gloom and Porygon, Corsola, and bulky Clamperl variants. The rest of Rhyhorn's EVs are funneled into Attack to maximize its damage output.</p> <p>Rhyhorn is a good fit for bulky offense teams to shore up their defensive backbones against physical attackers, and it doesn't exacerbate passivity issues like Lileep and Onix would. Specially bulky Pokemon like Gloom and Porygon can compensate for Rhyhorn's vulnerability to special attackers, and Rhyhorn returns the favor to them by checking physical attackers they would otherwise struggle against. Castform is especially good against weather users like Ponyta, and it manages Hidden Power Grass variants of Ponyta for Rhyhorn too. Ariados handles Gloom, a major threat to Rhyhorn, while Rhyhorn can switch into and pressure Doduo and Anorith for it. Baton Pass Ariados variants further support Rhyhorn, pivoting to it after drawing in vulnerable Rock-types like Onix, weakened Corsola looking to heal up, and Anorith. Fast attackers like Ponyta and Quilava enjoy the holes Rhyhorn opens up in teams relying on bulky Water-types like Seaking and Wartortle, as such holes enable them to more easily clean up. Additionally, both of these Fire-types offensively threaten Grass-types like Tropius and Gloom for Rhyhorn. Rhyhorn is vulnerable to Water-types and Water-type moves given its 4x weakness and poor special bulk, so Seaking, Gloom, and Chinchou pair very well with it. Koffing hard walls Rhyhorn, which can be mitigated by partners like defensive Ariados, Seaking, and Wartortle.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 452572, "username": "missangelic"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 272450, "username": "BP"}, {"user_id": 601970, "username": "sleid"}]}, {"name": "Grammar checked by", "members": [{"user_id": 589016, "username": "Danbear02"}]}]}
  },
  "Horsea": {"sets": {"Rain Sweeper": {}}},
  "Seaking": {
    "comments": "<h3>Other Options</h3> <p>Ice Beam is an option to deal greater damage to Tropius and Gloom, but it has significant overlap with Megahorn's coverage and is weaker than Hidden Power Rock against Noctowl, and mixed Seaking struggles to fit it over Protect in order to maximize its longevity. Seaking can run a special rain sweeper set with a Lum Berry, Ice Beam, and Hidden Power Grass, but this set struggles against specially bulky Pokemon like Castform, Noctowl, and Delcatty.</p> <h3>Checks and Counters</h3> <p><strong>Corsola</strong>: Great physical bulk and Recover enable Corsola to sit on even Choice Band Seaking, and though Corsola is quite passive, it can set up on Seaking with Calm Mind.</p> <p><strong>Gloom and Tropius</strong>: Both Gloom and Tropius take neutral damage from Megahorn and can stave off Seaking with their bulkier sets or set up on it with Sunny Day to obliterate it with Solar Beam.</p> <p><strong>Electric-types</strong>: Chinchou, Flaaffy, and Elekid threaten Seaking with Thunderbolt, but only Flaaffy can threaten to OHKO Choice Band Seaking. All of the aforementioned Electric-types risk being OHKOed by Choice Band Seaking's strongest attacks, so they cannot switch in safely. Magnemite has a decent chance to survive two hits from Choice Band Seaking's physical attacks and deals significant damage with Thunderbolt but fails to KO Seaking on its own.</p> <p><strong>Faster Physical Wallbreakers</strong>: Choice Band users like Aipom, Meditite, and Doduo outspeed and threaten to KO Seaking, though they don't switch into it safely.</p> <p><strong>Status</strong>: Though Water Veil gives Seaking a burn immunity, Toxic from foes like Corsola, Quilava, and Mightyena chips away at its otherwise great bulk. Paralysis leaves Seaking prone to being revenge killed by slower Pokemon like Clamperl and Cubone.</p>",
    "sets": {
      "Mixed": {
        "description": "<p>Seaking's good mixed coverage, power, and bulk make it a supreme offensive threat in ADV ZU. Hydro Pump 2HKOes Koffing and is very threatening to Cubone, Mightyena, and Rhyhorn. Megahorn drills through specially bulky Pokemon such as Castform, Drowzee, and Lileep, and it's stronger and more reliable than Hydro Pump against Mightyena if Seaking hasn't been affected by Intimidate. Hidden Power Rock nails Noctowl and Dustox; lacks the shaky accuracy of Hydro Pump to reliably hit Ponyta, Anorith, and Quilava; and keeps Seaking threatening to certain Swords Dance sweepers like Beedrill and Tentacool. Protect maximizes Seaking's passive recovery from Leftovers and allows it to scout Choice Band users like Aipom, Doduo, and Meditite. Water Veil helps Seaking stand out from other physical attackers with its immunity to Koffing's Will-O-Wisp, enabling it to take advantage of it. The given Speed investment lets mixed Seaking outspeed base 35 Speed and slower Pokemon like Cubone and Clamperl, neutral-natured base 40 Speed Pokemon like Ariados, and uninvested base 70 Speed Pokemon like Noctowl and Mightyena. 176 Attack EVs are necessary to 2HKO Noctowl and for a 91.8% chance to 2HKO Dustox, while the rest of Seaking's EVs are put into its bulk to increase its resilience to Ponyta and Quilava.</p> <p>Seaking is a great fit for offense and bulky offense teams looking for a Pokemon with great offensive qualities and a solid defensive backbone. Fast sweeper teammates like Ponyta, Abra, and Aipom benefit from Seaking breaking holes in teams for them to clean up. Tropius, Gloom, Beedrill, and other physical attackers appreciate Seaking taking on Koffing for them, and in return, they threaten opposing Gloom, Corsola and Tropius for it. Koffing covers Seaking's poor matchups against Gloom and Tropius, while Seaking handles Ponyta and Quilava. Corsola is a particularly bad matchup for Seaking given it isn't 3HKOed by any of its moves and can heal off any damage, so partners that threaten it like Gloom, Tropius, and Flaaffy can cover for Seaking.</p>"
      },
      "Choice Band": {
        "description": "<p>Seaking's high Attack and solid movepool make it a threatening wallbreaker and lead. Double-Edge is Seaking's most spammable attack, something helped by the rarity of Normal-resistant foes in ZU. Megahorn targets Grass-types, though its use is limited by the fact that ZU's best Grass-types, Tropius and Gloom, are neutral to Bug and thus take the same amount of damage from Double-Edge; in general, Megahorn provides an equally powerful attack as Double-Edge with no recoil, a midground in the event the opponent switches to a Pokemon that resists Normal, and the ability to 2HKO all variants of Mightyena. Hydro Pump OHKOes Rock-types such as Rhyhorn and Anorith and Ground-types such as Cubone, and it is Seaking's strongest move against certain physical walls such as Koffing. Hidden Power Grass 2HKOes an unboosted Corsola, preventing it from switching into Seaking. Water Veil is used to prevent Seaking from being crippled by Will-O-Wisp from foes such as Koffing and burns from Fire-type attacks from foes such as Ponyta and Quilava.</p> <p>Seaking best fits on offense and balance teams looking for a threatening wallbreaker with few true walls. While it is best used in the lead slot, it is not confined in such a role and can be used in the back on teams with another Choice Band user or another dedicated lead. Corsola is Seaking's hardest check, with it having reliable recovery while not being 2HKOed by any of its moves barring Hidden Power Grass. Once Corsola sets up Calm Mind, Seaking is helpless against it. Thus, checks to Corsola such as Flaafy, Tropius, and Gloom make for great partners. Seaking struggles against Grass-types such as Gloom and Tropius, making it appreciate the support of teammates such as Ponyta, Quilava, and one's own Tropius. In return, Seaking is an effective check to aforementioned Fire-types themselves. Speedy offensive foes such as Elekid, Abra, Choice Band Aipom, and Choice Band Doduo can outspeed and KO Seaking, making bulky Pokemon such as the aforementioned Grass-types, Mightyena, and Corsola good teammates. Seaking can be used on sun teams, with it acting as an effective check to special walls and Fire-types.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 452572, "username": "missangelic"}, {"user_id": 535530, "username": "Gangsta Spongebob"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 272450, "username": "BP"}, {"user_id": 479897, "username": "BeatsBlack"}, {"user_id": 535530, "username": "Gangsta Spongebob"}, {"user_id": 601970, "username": "sleid"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}, {"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Staryu": {"sets": {"Offensive": {}}},
  "Porygon": {
    "comments": "<h3>Other Options</h3> <p>A more offensive EV spread with Agility can turn Porygon into a threatening setup sweeper, but other offensive setup sweepers like Gloom, Tropius, Beedrill, and Anorith are stronger.</p> <h3>Checks and Counters</h3> <p><strong>Magnemite</strong>: Porygon lacks a way to meaningfully threaten Magnemite, which can use it as setup fodder for Substitute, debilitate it with Toxic, and proceed to wear it down with repeated hits.</p> <p><strong>Clamperl</strong>: Clamperl can come in on Return or Ice Beam and threaten to 2HKO Porygon with Surf, though Porygon can wear it down with Toxic and threaten significant damage with Thunderbolt.</p> <p><strong>Physical Attackers</strong>: Aipom, Seaking, and Meditite cleave through Porygon by hitting its lower physical bulk. Gloom and Tropius can turn the tables on Porygon with Swords Dance, but Ice Beam threatens to 2HKO Gloom and easily 2HKOes Tropius.</p> <p><strong>Calm Mind Users</strong>: Corsola can take advantage of Porygon to set up on it and has Natural Cure and Refresh to mitigate Toxic, but it risks being worn down by Toxic and Thunderbolt. Abra can overwhelm Porygon if it boosts enough with Calm Mind, but Return will KO it back. Without Return, Porygon cannot threaten to break Drowzee's Substitute.</p> <p><strong>Status</strong>: Toxic from Ponyta and Quilava forces Porygon to use Recover more often and leads it to being more easily overwhelmed. Defensive Pokemon like Mightyena, Noctowl, Lileep, and Wartortle often carry Toxic, and Mightyena and Wartortle can heal off Porygon's own Toxic with Heal Bell and Refresh respectively. Paralysis from Castform, Chinchou, and Flaaffy makes Porygon less reliable given the chance to lose its turn, but paralysis can be protection from Toxic for Porygon. Abra's Synchronize can punish Porygon for using Toxic.</p>",
    "sets": {
      "Special Wall": {
        "description": "<p>Porygon's great bulk, reliable recovery, and special coverage make it a great wall in ADV ZU and set it apart from other special walls like Delcatty, Gloom, and Noctowl. Thunderbolt deals significant damage to Corsola and Clamperl, which otherwise switch in on Return and threaten to respectively wall and break through Porygon, and it's stronger against other Water-types like Wartortle, Horsea, and Staryu. Return is a stronger alternative to 2HKO Ponyta and Quilava, notably OHKOing Abra, and it doesn't leave Porygon reliant on Toxic to beat Chinchou. Ice Beam is strong against Gloom and Tropius and keeps Porygon threatening against physical attackers like Cubone and Rhyhorn. Toxic wears down offensive foes like Seaking, Ponyta, and Quilava while Porygon recovers, puts walls like opposing Porygon and Lileep on a timer, and forces Pokemon with ways to mitigate status like Corsola and Noctowl to switch out in Corsola's case or use Refresh and Rest respectively. Thunder Wave is an alternative to Toxic to neutralize fast attackers like Ponyta and Quilava, but it leaves Porygon more passive and unable to wear down opposing walls and Chinchou. Trace has interesting utility perks for Porygon, potentially allowing it to use Corsola's and Staryu's Natural Cure to heal off status and become immune to Flash Fire Ponyta's STAB moves.</p> <p>Porygon's sole Fighting weakness means special attackers like Ponyta, Quilava, and Abra struggle to break through it without support, so it's a great fit for bulky offense and balance teams. Physically defensive Pokemon like Corsola, Gloom, and Koffing are great partners for Porygon given their complementary bulk, making defensive cores that are tough to break, and all of them can absorb Toxic for Porygon and handle offensive Poison-types like Beedrill and Ariados. Tropius is another physically defensive Pokemon that particularly appreciates Porygon handling Ponyta and Quilava, and in return, it can handle Aipom and Meditite for Porygon. Mightyena helps neutralize physical attackers for Porygon with Intimidate and provides cleric support in case Porygon is afflicted by status. Setup sweepers like Beedrill, Anorith, and Abra benefit from Porygon wearing down foes with Toxic so that they can more comfortably sweep. Fast wallbreakers such as Aipom, Doduo, and Quilava benefit from Porygon handling faster special attackers like Abra, Ponyta, and Elekid for them. Porygon struggles to deal with Magnemite, so teammates like specially defensive Gloom, Ponyta, and Flaaffy should handle it for Porygon.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 452572, "username": "missangelic"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 601970, "username": "sleid"}, {"user_id": 272450, "username": "BP"}]}, {"name": "Grammar checked by", "members": [{"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Chinchou": {"sets": {"Offensive Utility": {}}},
  "Natu": {
    "outdated": true,
    "comments": "<h4>Other Options</h4> <p>Calm Mind allows Natu to directly take advantage of switches and potentially allows it to retain a Substitute against weak and resisted Special Attacks. Alongside Early Bird, Reflect, and Rest, Natu is able to become a relatively bulky sweeper. However, this set takes many turns to become a threat and Natu is still susceptible to being overpowered even through Reflect and Calm Mind. Any other variant of Calm Mind is mostly outclassed by Spoink, which has much better defensive use and a wider movepool. Wish can be used as a foe is switching out to recover health on Natu or a teammate, but Natu's poor defenses make this a risky option to use. Night Shade can deal damage for very percentages of health in the very low HP stat metagame of ZU. But Natu's main STAB attack, Psychic, has good neutral coverage and power already and many of its checks don't even resist it, although Night Shade does hit Steel-types harder. Baton Pass could be used to generate momentum for powerful wallbreakers as foes switch out, but this would force it to drop Substitute.</p> <h4>Checks and Counters</h4> <p><strong>Steel-types</strong>: Steel-types have the bulk and resistance to take Psychic while also being immune to Toxic. Magnemite and Aron can comfortably take any move Natu commonly uses and force it out.</p> <p><strong>Faster Offensive Pokemon</strong>: Natu's Speed tier is quite good, but it's not elite. Faster offensive Pokemon like Pidgeotto, Elekid, and Delibird can outrun and threaten to OHKO Natu if it is not behind a Substitute. Aipom deserves special mention, as it has the natural bulk to comfortably take a Psychic.</p> <p><strong>Specially Defensive Pokemon</strong>: If they manage to avoid a Toxic, specially bulky Pokemon like Chinchou and Lileep can switch into a Psychic and threaten Natu with their STAB attacks. However, they can be stalled out by Natu if they swap directly into a Toxic or Substitute. Delcatty is especially good in this role; it has the special bulk to tank Psychics, can 2HKO Natu with Body Slam, and can even remove status from itself and its teammates with Heal Bell.</p>",
    "sets": {
      "Substitute": {
        "description": "<p>Despite seemingly being outclassed due to Spoink's superior base stats and defensive utility, Natu has some key traits that allow it to carve out a niche as a Substitute and Toxic user. Psychic is a solid STAB-type with few checks in the tier. Notably, a super effective hit on Poison-types like Dustox and Grimer narrows the pool of Pokemon that can check Natu. Thanks to Natu's solid base 70 Speed, it can use Substitute in front of Pokemon that could tank a Psychic such as Spoink and Chinchou, while at minimum Speed tying Castform, which regularly does not fully invest in Speed. Toxic racks up damage on the many special tank checks to Natu like Castform and Lileep, particularly synergizing with Substitute due to the free turns it provides. Protect primarily allows Natu to stall more turns while the opponent is badly poisoned, but the extra turns of recovery from Leftovers and scouting it provides are appreciated as well. Hidden Power Grass is an alternative that allows Natu to immediately KO even specially defensive variants of Rhyhorn and pressure defensive Staryu without expending Psychic PP, although it becomes easier to force Natu out when it can't Protect to force additional Toxic damage. Maximum Speed and a Timid nature are used so that Natu can confidently outspeed Pokemon like Seaking, Chinchou, and Cyndaquil. 12 EVs HP are used to maximize Leftovers recovery, while the rest are dedicated to Special Attack. Both of Natu's abilities can be useful; Early Bird allows Natu to switch directly into Butterfree's Sleep Powder and wake up relatively quickly, while Synchronize can punish the very common Thunder Wave, Will-O Wisp, and Toxic at the cost of crippling Natu.</p> <p>Natu should be used on balance and offense teams which can take advantage of the pressure it applies, and Pokemon that serve as reliable switch-ins to faster attackers that threaten to OHKO Natu are ideal teammates. Spikes have excellent synergy with Natu, as the damage dealt to foes switching in combined with Toxic's increasing damage makes it very difficult to answer. Snorunt stands out as a Spiker with a strong offensive profile, although Pineco's Explosion can also get the ball rolling for Natu. Elekid sits in a nearly uncontested Speed tier, allowing it to clean up teams Natu has weakened and revenge kill targets like Pidgeotto and chipped Aipom. Swift Swim attackers like Horsea are similarly effective, running through teams once roadblocks like Chinchou and Bayleef have been put into KO range. Natu isn't powerful enough that it can threaten immediate KOs for offense teams, so other Pokemon that can such as Wailmer, Choice Band Aipom, and Seaking are great partners. Natu provides very little defensive utility, so it requires partners that can swap into attacks directed at it. Magnemite is a great partner, resisting many common Rock- and Normal-type attacks, keeping up offensive pressure, and even potentially trapping the other Steel-types that wall Natu. Koffing is another great pairing thanks to its mix of offense and defense. Its great physical bulk allows it to easily switch into unboosted physical attacks and threaten foes with Will-O-Wisp or its strong attacking movepool.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 482455, "username": "Monai"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 272450, "username": "BP"}, {"user_id": 535530, "username": "Gangsta Spongebob"}]}, {"name": "Grammar checked by", "members": [{"user_id": 356215, "username": "Clouds"}]}]}
  },
  "Flaaffy": {
    "comments": "<h3>Other Options</h3> <p>Thunder Wave and Toxic let Flaaffy spread status, but it is generally best off not facing the offensive Pokemon Thunder Wave is most useful against, and it already has the tools to take on most defensive Pokemon without relying on Toxic. Additionally, Flaaffy is in generally limited supply of moveslots. Hidden Power Ice is an option to compress the means to hit both Ground- and Grass-types into a single moveslot and is notably Flaaffy's strongest option against Tropius, even OHKOing some variants. However, Hidden Power Grass is Flaaffy's only means to hit Chinchou, and thus it's very difficult to drop.</p> <h3>Checks and Counters</h3> <p><strong>Ground-types</strong>: Due to Flaaffy's low physical bulk, Ground-types such as Cubone can easily OHKO it and it usually fails to OHKO them first. Some Earthquake users can also threaten Flaaffy, notably offensive variants of Tropius, which can outspeed and OHKO it.</p> <p><strong>Physical Wallbreakers</strong>: Faster offensive Pokemon such as Choice Band Aipom, Doduo, and Meditite can easily outspeed and OHKO Flaafy, though they must be wary of Static paralyzing them.</p> <p><strong>Special Walls</strong>: Flaaffy cannot 2HKO some special walls such as Porygon, Delcatty, and Lileep that have reliable recovery, letting them win a war of attrition. Others that lack reliable recovery, such as Drowzee, can still KO or heavily weaken Flaaffy one-on-one.</p> <p><strong>Chip Damage</strong>: Due to Flaaffy's lack of reliable recovery, weaker hits can wear it down over the course of a longer game. Even with Heal Bell, damage taken from Toxic or burn can also leave a lasting dent.</p>",
    "sets": {
      "Heal Bell": {
        "description": "<p>Flaaffy's workable bulk, rare Electric typing, and access to the coveted Heal Bell make it a metagame staple. Hidden Power Grass targets Ground-types such as Rhyhorn and Cubone and 2HKOes Chinchou, which are immune to Thunderbolt. Fire Punch targets Grass-types and Magnemite, which resist the combination of Thunderbolt and Hidden Power Grass. This notably 2HKOes Gloom, a foe that could otherwise use Flaaffy as setup fodder. Static is Flaaffy's only available ability, though it has use letting Flaaffy paralyze foes that use contact moves.</p> <p>Flaaffy best fits on balance and bulky offense teams that want a Pokemon that can cure status conditions for its team. Offensive Pokemon such as Aipom and Ponyta appreciate Flaaffy removing status conditions they may take while wallbreaking, while defensive Pokemon appreciate Flaaffy removing Toxic from them, such as in the case of Tropius and Porygon, or wake them up after using Rest, such as in the case of Noctowl and Clamperl. Flaaffy has significant competition with Delcatty in this role, though Flaaffy justifies its use with its solid offensive presence, making it effective at taking on some physical walls and Electic-weak foes such as Koffing, Clamperl, and Noctowl. While Flaaffy can be used to defensively check some foes such as Elekid and Koffing, it is quite frail and thus should generally avoid taking hits; as a result, bulky teammates such as Tropius, Mightyena, and Gloom make great partners. Bulky attackers such as Tropius and Castform can also form potent offensive cores with Flaafy, with them able to KO or status each other's checks. Flaafy can't break through some special walls such as Porygon, making wallbreakers such as Choice Band Aipom useful partners. Flaaffy has the tendency to get worn down quickly due to its lack of reliable recovery, making Wish users such as Delcatty and Drowzee good teammates on more defensive teams. Despite the fact that Flaaffy should generally avoid taking hits, Static can let it punish weak contact attackers such as Delcatty and defensive variants of Mightyena. In a pinch, Flaaffy can also try to force paralysis on a wallbreaker such as Aipom or Meditite, though it will usually be KOed in the process.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 535530, "username": "Gangsta Spongebob"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 272450, "username": "BP"}, {"user_id": 601970, "username": "sleid"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Aipom": {
    "comments": "<h3>Other Options</h3> <p>Focus Punch on Choice Band sets provides a stronger hit against Rock- and Steel-types, but it fails to OHKO Calm Mind Corsola, is extremely prediction-reliant, and can be exploited by foes after Aipom gets a KO. Aipom has a variety of utility options such as Taunt, Toxic, and Thunder Wave, but Aipom's its frailty makes it outclassed at using these moves. Shadow Ball provides Aipom with the means to threaten Shuppet, but its rarity makes Shadow Ball generally not worth using.</p> <h3>Checks and Counters</h3> <p><strong>Rock-types</strong>: Corsola and the rare Lileep take minimal damage from Aipom's STAB moves, aren't 2HKOed by a Choice Band-boosted Brick Break, and can heal off damage with Recover, making them Aipom's hardest check. Rhyhorn lacks reliable recovery, but it can easily tank Aipom's STAB moves and threaten it and its team with heavy damage in return.</p> <p><strong>Faster Foes</strong>: While they are usually OHKOed back, faster foes such as Abra and Ponyta can easily revenge kill Aipom after it has taken the smallest amount of chip damage. Weather sweepers, such as Gloom, can easily OHKO Aipom when their favored weather is active, though they usually take heavy damage or are OHKOed outright by Aipom's attacks.</p> <p><strong>Shuppet</strong>: Since Aipom usually only runs Normal- and Fighting-type attacking moves, it cannot damage Shuppet at all.</p> <p><strong>Magnemite</strong>: With its resistance to Normal, Magnemite can tank Aipom's STAB moves and threaten it and its team with heavy damage and status, though it cannot switch into even resisted Choice Band-boosted Normal-type attacks and must be wary of Aipom's Fighting-type coverage.</p> <p><strong>Tropius</strong>: Offensive variants of Tropius can easily tank even a Choice Band-boosted Double-Edge and threaten heavy damage in return, notably with Tropius able to set up sun to outspeed Aipom next turn. Defensive variants of Tropius are bulky enough to not even be 2HKOed by a Choice Band-boosted Double-Edge, letting it wall Aipom.</p> <p><strong>Status</strong>: Being burned completely ruins Aipom, preventing it from meaningfully damaging most foes. Paralysis is similar, making Aipom easy to KO due to its frailty. While Toxic doesn't immediately stop Aipom, it tends to be worn down very quickly by poison damage and Double-Edge recoil.</p>",
    "sets": {
      "Choice Band": {
        "description": "<p>Aipom's high Speed and Attack make it a potent wallbreaker with Choice Band and Double-Edge. Brick Break targets Rock-types such as Corsola and Rhyhorn, as well as hitting Magnemite. Baton Pass lets Aipom pivot out, easing prediction against foes likely to switch out against it. Return provides a powerful hit without costing Aipom's HP, but its lower power matters in some matchups, such as it failing to 2HKO physically bulky variants of Gloom and Koffing. Both of Aipom's abilities are useless; it does not matter which is chosen.</p> <p>Aipom best fits on offensive and balance teams looking for a potent wallbreaker, something helped by the lack of viable Pokemon that resist Normal-type moves. The ability to remove physical and special walls and tanks such as Koffing, Noctowl, and Flaaffy makes it a great partner for offensive teammates such as Elekid, Ponyta, and Gloom. Calm Mind Corsola is Aipom's hardest counter, taking minimal damage from Double-Edge and failing to be 2HKOed by Brick Break. Grass-types such as Tropius and Gloom can break through Corsola before it accumulates too many boosts, though they must watch out for Ice Beam. Powerful wallbreakers such as Clamperl and Cubone can break through Aipom's defensive checks like Corsola, Rhyhorn, and Lileep, while it in return provides them with the means to switch in with Baton Pass. Toxic users such as Porygon can also cripple these foes, limiting their ability to check Aipom. Aipom struggles with faster Pokemon such as Ponyta and Abra, making bulky Pokemon such as Mightyena and Tropius good teammates. Choice Band Aipom can be used as a lead, providing instant power against opposing leads and the ability to pivot out of bad matchups and predicted switches using Baton Pass.</p>"
      },
      "All-out Attacker": {
        "description": "<p>Aipom's Normal-type STAB moves and Fighting-type coverage moves are virtually perfect coverage against all of the ADV ZU metagame besides the rare Shuppet, and its high Speed enables it to easily revenge kill foes like Quilava, Doduo, and Meditite and clean up weakened teams. Brick Break lacks Double-Edge's recoil as a coverage move for Pokemon that resist Normal like Lileep, Magnemite, and Rhyhorn, though Double-Edge is still stronger against most of them, including Anorith. Return trades Double-Edge's recoil drawback for lower power, though this is helpful to Aipom given its lack of defensive utility and longevity. Focus Punch can catch Corsola and other Pokemon weak to Fighting like Mightyena and Lileep trying to switch into Aipom, dealing way more damage than Double-Edge or Brick Break despite the riskiness of using it. Baton Pass enables Aipom to be an offensive pivot, taking advantage of switch-ins to switch to an appropriate teammate and letting Aipom escape bad matchups against defensive Pokemon such as Corsola. A Silk Scarf maximizes the power of Aipom's STAB moves and lacks the drawbacks of locking in that Choice Band inflicts.</p> <p>All-out Attacker Aipom fits more offensive teams as a cleaner thanks to its high Speed, and its utility as a revenge killer is also appreciated by bulkier teams. Wallbreakers like Seaking, Quilava, and Ponyta can soften up teams for Aipom to clean up while checking opposing Ponyta. Choice Band wallbreakers such as Doduo, Volbeat, and Meditite can respectively break down physically defensive Pokemon such as Koffing, Mightyena, and Corsola for Aipom. Pokemon that can check or counter Koffing such as Tentacool, Drowzee, and Dustox are helpful teammates for Aipom due to it struggling to overcome Koffing on its own. Physically defensive Gloom and Tropius are a pain for Aipom to break without support, so it appreciates help from partners like Koffing and Fire-types like Ponyta and Quilava to neutralize them. Aipom appreciates bulkier partners that can check the few Pokemon faster than it; Castform and Wartortle can handle Ponyta, Mightyena and Porygon check Abra, and Chinchou and Delcatty answer Elekid. Aipom especially struggles to break Corsola, so it appreciates checks to it such as Flaaffy and Gloom. Other Baton Pass users such as Ariados and Delcatty synergize with Aipom by creating pivot cores and allowing it to come in more safely.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 452572, "username": "missangelic"}, {"user_id": 535530, "username": "Gangsta Spongebob"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 535530, "username": "Gangsta Spongebob"}, {"user_id": 601970, "username": "sleid"}, {"user_id": 272450, "username": "BP"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Sunflora": {
    "outdated": true,
    "comments": "<h4>Other Options</h4> <p>Grass Whistle can be used to put opposing Pokemon to sleep, but its poor accuracy makes it hard to justify over Synthesis. In the same vein, Substitute can be run to take advantage of Pokemon that might choose to switch out, but Synthesis is generally the better option to maintain Sunflora's longevity. Sunflora can opt to run maximum Speed with a Timid nature to outspeed Elekid with Chlorophyll active but this greatly weakens it offensively and is seldom worth the investment.</p> <h4>Checks and Counters</h4> <p><strong>Castform</strong>: Any Castform set that carries a physical move can make quick work of Sunflora. Addtionally, Castform's access to Forecast means that it can easily take a Solar Beam when sun is active and strike back with a boosted Fire Blast.</p> <p><strong>Physical Wallbreakers</strong>: Physical wallbreakers such as Aipom, Pidgeotto, and Nidorino can all OHKO Sunflora with their STAB attacks.</p> <p><strong>Fire-types</strong>: Cyndaquil and Growlithe are able to wall Sunflora naturally as Fire-types and can 2HKO it with their STAB attacks. Growlithe is worth noting due to it being able to use Sunflora as setup fodder with Agility.</p> <p><strong>Delcatty</strong>: Delcatty can waste Sunflora's sun turns thanks to its access to Wish and Protect. Addtionally, Sunflora's poor Defense means that Body Slam can heavily threaten it.</p> <p><strong>Status users</strong>: Status spreaders such as Butterfree, Magnemite, Lileep, and Dustox can hinder Sunflora's ability to act as a proper wall or cleaner. All must be wary of Sunflora when sun is active, however.</p> <p><strong>Megahorn users</strong>: Without Chlorophyll activation, Seaking and Rhyhorn outspeed and can OHKO Sunflora with Megahorn.</p> <p><strong>Poison-types</strong>: Poison-types such as Dustox and Grimer all resist Solar Beam. Dustox must be wary of Hidden Power Fire and cannot safely check it if weakened. Grimer is worth noting, as it can use Sunflora as setup fodder or OHKO it with Sludge Bomb.</p>",
    "sets": {
      "Sunny Beam": {
        "description": "<p>Sunflora comes equipped with the highest base Special Attack in ADV ZU. This coupled with Chlorophyll makes it an incredibly threatening sun sweeper. Sunny Day ensures Sunflora will get the Speed boost it needs. Solar Beam is extremely powerful and is Sunflora's strongest STAB attack, and it can be used with little-to-no drawbacks while sun is active. Hidden Power Fire prevents Pokemon such as Bayleef, other Sunflora, or Magnemite from walling Sunflora. It's also boosted by Sunny Day allowing Sunflora to almost always 2HKO Dustox. Synthesis provides Sunflora with a reliable form of recovery that gets a boost when sun is active. Lum Berry allows Sunflora a free turn to use Sunny Day against status users like Dustox and Magnemite while also allowing preventing it from being crippled as a cleaner. Its HP investment gets higher Leftovers recovery without hindering its Speed significantly. A Modest nature provides Sunflora with extra power while still outspeeding fully-investedfoes with base 85 speed like Staryu and Aipom while Sunny Day is active.</p> <p>Sunflora fits best on sun teams. It can also be used on balance teams as a late-game cleaner or mid-game wallbreaker. On teams that take advantage of sun, Sunflora appreciates other Sunny Day users such as Onix and Castform, which can help prevent Sunflora from taking a hit to set sun. Other Chlorphyll users such as Exeggcute and Nuzleaf can benefit from Sunflora's usage of Sunny Day. Likewise, they can also damage would-be checks so that Sunflora can remove them later. On balance teams Sunflora appreciates physical wallbreakers such as Aipom, Cubone, and Nidorino to weaken or remove specially defensive walls such as Delcatty and Castform that stand in the way of Sunflora cleaning. These same physical wallbreakers also appreciate Sunflora as a midgame wallbreaker that can threaten their checks such as Koffing, Rhyhorn, and Nosepass. Sunflora is still outsped by Elekid even with Sunny Day active, so Pokemon that can check it such as Castform, Nosepass, and Dustox pair well with Sunflora. Fire-types such Cyndaquil and Growlithe pair well with Sunflora due to making excellent secondary special wallbreakers while Sunny Day is active. These Fire-types can also prove to be quite difficult for Sunflora to deal with, so Pokemon such as Nosepass and Chinchou make good partners.</p>"
      },
      "Specially Defensive": {
        "description": "<p>Growth boosts Sunflora's already astounding Special Attack, which allows it to take advantage of Pokemon that cannot 2HKO it such as Elekid, Chinchou, and Staryu. Alternatively, Leech Seed is used to chip switch-ins and as a form of recovery against bulkier Poison-type Pokemon such as Koffing, Grimer, and Dustox. Razor Leaf lets Sunflora avoid becoming setup fodder against Pokemon like Spoink thanks to its raised critical hit chance. Giga Drain can be run as another bonus recovery option, although Razor Leaf has significantly higher PP. Hidden Power Ice allows Sunflora to threaten other Grass-types such as Lileep, Bayleef, and Exeggcute while also threatening Pidgeotto and Taillow. Synthesis provides Sunflora with a reliable form of recovery. The HP EVs maximize Sunflora's HP while gaining optimal Leftovers recovery, and the Speed EVs allow Sunflora to outspeed uninvested base 35 Speed Pokemon like Koffing, with the rest put into its special bulk.</p> <p>Specially defensive Sunflora fits best on balance and offense teams that can benefit from the role compression it offers as an emergency check to Elekid. Physical walls such as Koffing, Lileep, and Nosepass can help shut down physical attackers like Aipom, Rhyhorn, and Pidgeotto for Sunflora. These same physical attackers pair well with Sunflora, as they are able to threaten specially defensive walls such as Delcatty and Dustox. They also greatly appreciate Sunflora acting as a check to Elekid. Due to Sunflora's susceptibility to Poison-types like Dustox, Koffing, and Grimer, Steel-types such as Aron and Magnemite pair well with it. Rhyhorn makes an excellent partner with Sunflora, as it's able to prevent Grimer from using Sunflora as setup fodder. Pokemon that resist Fire such as Nosepass, Seaking, and Chinchou pair well with Sunflora, although the latter two must be wary of Hidden Power Grass. Nosepass and Chinchou are worth mentioning, as their access to Thunder Wave can help remedy Sunflora's pitiful Speed.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 272450, "username": "BP"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 601970, "username": "sleid"}, {"user_id": 535530, "username": "Gangsta Spongebob"}]}, {"name": "Grammar checked by", "members": [{"user_id": 577920, "username": "Tea Guzzler"}]}]}
  },
  "Pineco": {"sets": {"Spikes": {}}},
  "Delibird": {
    "comments": "<h3>Other Options</h3> <p>A Choice Band set may seem appealing, but Hustle makes any physical attacks besides Aerial Ace unreliable, and Delibird's fragility makes any unreliability a huge liability to its survival. Additionally, Delibird benefits from the ability to switch moves against Flying-resistant foes like Rhyhorn and Magnemite. Quick Attack picks off frail fast attackers like Abra and Salac Berry users like Beedrill. However, Delibird struggles to fit it over any of its coverage moves without becoming less effective as a wallbreaker, and the accuracy nerf applied by Hustle can lead Delibird to totally flop when trying to finish off dangerous foes like Ponyta and Elekid. Focus Punch can deal a huge chunk of damage to Corsola as it switches in, but this requires great prediction, usually getting Delibird behind a Substitute, and for the move not to miss because of Hustle. Additionally, giving up Hidden Power Ground or Ice Beam for Focus Punch makes Delibird overly prediction-reliant.</p> <h3>Checks and Counters</h3> <p><strong>Bulky Water-types</strong>: Delibird cannot 2HKO Corsola, even with Hidden Power Ground, and Corsola can 2HKO Delibird or just use it as setup fodder. Clamperl and Seaking are generally 3HKOed by Delibird's Aerial Ace and can OHKO Delibird outright. Defensive Wartortle can take repeated hits from Delibird and 2HKO it with Surf, and offensive variants can even OHKO Delibird.</p> <p><strong>Faster Pokemon</strong>: Aipom can take one attack from Delibird and OHKO it with a Normal-type move. Ponyta, Quilava, Elekid, and Voltorb can all switch into both Aerial Ace and Ice Beam and threaten to OHKO Delibird, but only Quilava can take Hidden Power Ground. Volbeat can switch into anything but Aerial Ace and proceed to KO Delibird with Double-Edge. Abra can OHKO Delibird outright, but it can only switch into a predicted Ice Beam.</p> <p><strong>Bulky Normal-types</strong>: Castform, Delcatty, and Porygon are not 2HKOed by Delibird, and they threaten to 2HKO it themselves given its terrible bulk. Delcatty and Porygon outright wall Delibird thanks to their access to reliable recovery. Defensive Noctowl can 2HKO Delibird and avoid a 2HKO, while offensive Noctowl can OHKO Delibird. However, Noctowl can be overwhelmed if Delibird sets up a Substitute as it switches in.</p> <p><strong>Mightyena</strong>: Intimidate softening Aerial Ace makes Mightyena a workable stop-gap to Delibird, though it doesn't work behind Substitute. Defensive Mightyena is generally bulky enough to avoid a 3HKO from Ice Beam with the help of Protect, and it's strong enough to 3HKO Delibird. Offensive variants 2HKO Delibird, while Delibird can only 3HKO them with Ice Beam. However, both variants have to be wary of being worn down enough to be overwhelmed by Delibird.</p>",
    "sets": {
      "Substitute + 3 Attacks": {
        "description": "<p>Hustle, an above-average Speed, and a good offensive typing make Delibird a niche mixed wallbreaker. Delibird uses Substitute to capitalize on the switches it forces against slower foes like Gloom, Tropius, and Meditite, protecting it from revenge killers like Ponyta, Quilava, and Aipom and decreasing the need to predict correctly. Aerial Ace is Delibird's most reliable strong attack by circumventing the accuracy nerf of Hustle, and it threatens Bug-types such as Ariados, Beedrill, and Dustox. Ice Beam best complements Aerial Ace by threatening physically bulky Pokemon like Onix, Koffing, and Rhyhorn. Hidden Power Ground covers Electric-types like Chinchou, Magnemite, and Flaaffy, and it's Delibird's strongest attack against Corsola. 68 Special Attack EVs let Delibird 2HKO Koffing and Lileep. Delibird hardly has the bulk to make its choice of defense-lowering nature matter, but a Hasty nature at least gives Delibird an 88.3% chance to avoid a 2HKO from physically defensive Mightyena's Crunch. A Naive nature keeps it out of range of Doduo's Quick Attack slightly better, which is helpful when Delibird risks putting itself into range of Quick Attack when using Substitute.</p> <p>Offense teams benefit from Delibird's presence as an especially threatening wallbreaker, but balance teams can make up for Delibird's lack of defensive value by relying on bulkier Pokemon to get it into good positions. Bulky Water-types like Wartortle and Seaking can intercept fast Fire-types for Delibird, while Delibird threatens Grass-types for them. Bulky Normal-types like Castform and Porygon can similarly check Ponyta and Quilava, and they also have good matchups against the fast Electric-types, Elekid and Voltorb. Delcatty is an especially good bulky Normal-type to pair with Delibird, as it can pivot it in safely with Baton Pass. Electric-types like Flaaffy and Chinchou threaten bulky Water-types that would check Delibird, while Delibird pressures bulky Grass-types like Gloom and Tropius that would wall its Electric-type partners. Bulky Normal-types, Electric-types, and Gloom can all support Delibird by spreading paralysis, enabling Delibird to outrun and dispose of fast, frail offensive threats. Delibird's unable to break through Corsola and other bulky Water-types like Seaking and Wartortle on its own, so it depends on support against them, which can include Gloom, Flaaffy, Chinchou, and Thunderbolt variants of Porygon.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 452572, "username": "missangelic"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 601970, "username": "sleid"}, {"user_id": 479897, "username": "BeatsBlack"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny004"}]}]}
  },
  "Smoochum": {
    "comments": "<h3>Other Options</h3> <p>Salac Berry can give Smoochum some legs to outrun fast revenge killers like Aipom and Ponyta so that it can sweep, but Smoochum is so frail that it struggles to find an easy point for setting up. Smoochum's physical bulk is so poor that Smoochum itself is easily finished off by Quick Attack users like Doduo, Ponyta, and Volbeat. Additionally, Abra tends to outclass Smoochum as a naturally faster specially offensive Psychic-type. Hidden Power Fire destroys Magnemite and opposing Smoochum, the only Pokemon to resist both of Smoochum's STAB moves, but Smoochum struggles to fit it over Calm Mind or Substitute.</p> <h3>Checks and Counters</h3> <p><strong>Faster Physical Attackers</strong>: Fast Normal-types like Aipom and Doduo, Volbeat, and Onix outspeed and OHKO Smoochum. Anorith has Rock Blast to break past Substitute.</p> <p><strong>Fire-types</strong>: Fire-types like Ponyta and Quilava outspeed Smoochum and OHKO it even after a Calm Mind boost.</p> <p><strong>Bulky Normal-types</strong>: Porygon, Delcatty, Castform, and even Noctowl can tank boosted attacks from Smoochum and hit it back with Normal-type moves to OHKO it. Porygon and Delcatty stand out as Smoochum checks for their reliable recovery, but both can be used as setup fodder if they lack a Normal-type attack.</p> <p><strong>Bulky Water-types</strong>: Seaking has the bulk to withstand a boosted Psychic from Smoochum and retaliate with Megahorn for an OHKO. Wartortle is bulky enough to tolerate a boosted attack, while Clamperl has good odds to OHKO a Smoochum attempting to survive its Surf by using Calm Mind, though Smoochum can overwhelm them.</p> <p><strong>Magnemite</strong>: Magnemite resists both of Smoochum's STAB moves and hits it back hard, but Smoochum does have a chance to overwhelm and 2HKO it if it switches in as Smoochum uses Calm Mind.</p>",
    "sets": {
      "Calm Mind": {
        "description": "<p>Smoochum is an offensive threat as a Calm Mind sweeper with virtually perfect coverage combination of STAB Psychic and Ice Beam against the relevant metagame, though it struggles with its middling Speed, underwhelming defensive typing, and poor physical bulk. Defensive staples like Mightyena, Flying-types like Tropius and Noctowl, and Grass-types like Gloom and Lileep are threatened by Ice Beam. Psychic tears through bulky Water-types like Corsola and Wartortle, Poison-types like Ariados and Dustox, and Fire-types like Ponyta and Quilava. Substitute turns passive walls like Porygon lacking Return, Drowzee, and Delcatty with no STAB move into setup fodder for Smoochum in addition to blocking harmful status like Thunder Wave and Toxic. Smoochum's tendency to force switches and encourage opponents to sack Pokemon makes it adept at creating opportunities to set up Substitute, which gives it more freedom to use Calm Mind. Additionally, Substitute's protection against revenge killers like Aipom and Ponyta is massively appreciated by Smoochum.</p> <p>Offense teams can get a lot of mileage out of Smoochum as a potent wallbreaker, and fast offensive threats like Aipom, Ponyta, and Volbeat can more efficiently clean up teams weakened by Smoochum. Special attackers like Quilava and Abra similarly appreciate the holes Smoochum can create. Balance teams benefit from the power Smoochum brings to the table to mitigate their overall passivity, and they can support Smoochum with bulkier teammates like Seaking, Rhyhorn, and Magnemite. Baton Pass users like Aipom and Volbeat can get Smoochum in with a potentially free switch, mitigating Smoochum's lack of bulk. Smoochum also preys on defensive Pokemon Aipom and Volbeat invite in, including Koffing and Rhyhorn. Slow Baton Pass users can particularly create opportunities for Smoochum to hit the field safely, so Ariados and Delcatty make excellent teammates for Smoochum.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 452572, "username": "missangelic"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 479897, "username": "BeatsBlack"}, {"user_id": 601970, "username": "sleid"}]}, {"name": "Grammar checked by", "members": [{"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Elekid": {"sets": {"Special Attacker": {}}},
  "Larvitar": {
    "outdated": true,
    "comments": "<h4>Other Options</h4> <p>Larvitar can use Substitute alongside a Lum Berry to turn Delcatty into setup fodder, but this means it has to drop Hidden Power Bug or Facade.</p> <h4>Checks and Counters</h4> <p><strong>Koffing</strong>: Koffing has a 12% chance to OHKO Larvitar with Hidden Power Grass and completely walls it at +1 if Guts is not active. Koffing must be wary of Larvitar if it has been inflicted with status, as Facade can 2HKO Koffing at +1.</p> <p><strong>Pokemon with Over Base 85 Speed</strong>: Elekid, Voltorb, and Luvdisc are all able to outspeed and OHKO it even at +1 with Hidden Power Grass or Hydro Pump.</p> <p><strong>Bulky Grass-types</strong>: Lileep and Bayleef can counter Larvitar if it lacks Hidden Power Bug and OHKO it with their Grass-type STAB moves. However, if Larvitar has been inflicted with status, at +1 it can 2HKO Bayleef with Facade and Lileep with Earthquake.</p> <p><strong>Faster Attackers</strong>: Pokemon that outspeed Larvitar can prevent it from using Dragon Dance. Water-types such as Chinchou, Seaking, and Croconaw all outspeed and threaten Larvitar with their Water-type STAB moves. Both Butterfree and Masquerain outspeed Larvitar and can OHKO it with their Grass-type coverage.</p> <p><strong>Cubone</strong>: Larvitar does outspeed Cubone; however, it only has a 37% to 2HKO Cubone with Earthquake when it's not at +1. This allows Cubone to answer back with an OHKO from Earthquake.</p>",
    "sets": {
      "Dragon Dance": {
        "description": "<p>Larvitar sets itself apart from Bagon as a Dragon Dance user thanks to its resistance to Normal-type moves. This allows it to set up a Dragon Dance against Aipom that is locked into Double Edge or Delcatty, which can often only hope to paralyze Larvitar with Body Slam. After one Dragon Dance, Larvitar is able to outspeed and OHKO most base 85 Speed attackers with either of its STAB moves. Earthquake OHKOes faster attackers such as Staryu, Mankey, and Aipom if Larvitar is holding Soft Sand while threatening Rock- and Electric-types such as Rhyhorn, Chinchou, and Magnemite. Rock Slide provides Larvitar with an option against Flying-types such as Delibird, Pidgeotto, Taillow, and Butterfree while also threatening Dustox. Hidden Power Bug threatens bulky Grass-types such as Bayleef and Exeggcute, which otherwise OHKO Larvitar with their Grass-type STAB moves. Alternatively, Larvitar can use Facade to grant it a more powerful option when inflicted with status due to its ability Guts. Soft Sand notably allows Larvitar to always OHKO Aipom with Earthquake when at +1 instead of relying on a 93% chance to do so without it. Alternatively, Larvitar can hold a Lum Berry in order to prevent it from being paralyzed by Delcatty when it tries to set up, though this can be counterproductive if Larvitar is using Facade.</p> <p>Larvitar does its best work on offense teams that rely on special attackers. These teams appreciate Larvitar's usefulness in threatening common special walls like Dustox and Delcatty. Pokemon like Elekid, Chinchou, Staryu, and Croconaw all appreciate Larvitar for these reasons. These special attackers threaten Koffing, which otherwise walls Larvitar and has a chance to OHKO it with Hidden Power Grass. Chinchou is notable as a teammate, as its access to Thunder Wave can create more opportunities for Larvitar to set up or remove threats by remedying its poor Speed. Secondary sweepers that appreciate the removal of special walls and Aipom, such as Growlithe, Masquerain, and Butterfree, pair well with Larvitar. Butterfree's access to Sleep Powder makes it an incredible partner, as it provides Larvitar with more opportunities to set up Dragon Dance. Growlithe is worth noting, as it threatens Grass-types like Bayleef, which allows Larvitar to more safely use Facade over Hidden Power Bug. Larvitar fails to outspeed Elekid, Luvdisc, and Voltorb when at +1, so Pokemon that can check them, such as Castform and Dustox, are appreciated.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 272450, "username": "BP"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 535530, "username": "Gangsta Spongebob"}, {"user_id": 601970, "username": "sleid"}]}, {"name": "Grammar checked by", "members": [{"user_id": 558636, "username": "zastra"}, {"user_id": 384270, "username": "autumn"}]}]}
  },
  "Mightyena": {
    "comments": "<h3>Other Options</h3> <p>Offensive Mightyena sets may seem tempting thanks to its qualities as a faster tank, but it is unable to use its STAB moves off of its greater Attack stat, and its lack of powerful coverage or setup moves also cause it to struggle breaking through defensive Pokemon; Aipom, Doduo, and Meditite boast greater power than Mightyena, while Seaking, Castform, and Flaaffy have more effective STAB attacks and coverage.</p> <h3>Checks and Counters</h3> <p><strong>Pokemon Immune to Toxic</strong>: Gloom, Koffing, and Dustox are all unbothered by Mightyena's main method of wearing foes down and can use it as an opportunity to heal. Beedrill and Tentacool aren't entirely safe from Mightyena's attacks but can use it as setup fodder by switching in on Toxic. Magnemite only fears Hidden Power Fighting and easily exploits Mightyena for setup if it lacks it. Ariados has sufficient bulk to take repeated hits from Mightyena and threaten it back with Sludge Bomb.</p> <p><strong>Status Recovery</strong>: Corsola's Natural Cure lets it absorb Mightyena's Toxic for its teammates, and even Mightyena's Hidden Power Fighting fails to 4HKO Calm Mind Corsola. Corsola can also run Refresh, as can Wartortle, allowing them both to stay in and wall Mightyena. Delcatty, Flaaffy, and opposing Mightyena can use Heal Bell to invalidate Mightyena's Toxic, but the low PP of the move and Flaaffy's lacking longevity should be accounted for.</p> <p><strong>Super Effective Physical Attacks</strong>: Meditite is the only relevant Fighting-type in the tier, and its frailty makes it uncomfortable switching into Mightyena directly, but it 2HKOes Mightyena with STAB Brick Break even after an Intimidate. Seaking, Volbeat, and Choice Band Anorith all threaten Mightyena with their Bug-type STAB attacks, though Mightyena can rely on Intimidate, Toxic, and Protect to wear them down before they finish it off, or it can at least scout their attacks for its teammates. Aipom can use Focus Punch to catch Mightyena switching in and punish it with significant damage.</p> <p><strong>Special Attackers</strong>: Ponyta, Quilava, and Elekid may lack the bulk to repeatedly switch in on Mightyena, but they still threaten it with significant damage and are not as punished by Intimidate compared to physical attackers. Despite Mightyena generally checking Psychic-types, Smoochum can rely on Ice Beam to break through a chipped Mightyena.</p> <p><strong>Faster Attackers</strong>: If unaffected by Intimidate, even physical attackers like Aipom and Doduo can outspeed and overwhelm Mightyena given its lack of immediate recovery.</p> <p><strong>Residual Damage</strong>: Mightyena lacks any form of recovery beyond Leftovers, so repeated attacks from foes like Seaking, Castform, and Ponyta can overload Mightyena. Status from Corsola, Koffing, and Porygon forces Mightyena to become passive and use Heal Bell, if it even has Heal Bell to mitigate status.</p>",
    "sets": {
      "Stallbreaker": {
        "description": "<p>Mightyena can function exceptionally well in an offensive-defensive role by combining its defensive utility and excellent base Attack. Return trades the recoil drawback from Double-Edge in exchange for a loss in power. This significantly increases Mightyena's longevity and gives it more opportunities to use Heal Bell. Alternatively, if Mightyena chooses to use Rest over Heal Bell, Double-Edge becomes the better alternative, allowing Mightyena to focus offensively. Hidden Power Ground is the most common coverage option, allowing Mightyena to OHKO Flaaffy after a Howl. Hidden Power Fighting is an option to threaten Castform. It also enables Mightyena to threaten Lileep with a 2HKO at +2. Howl allows Mightyena to set up on and threaten passive targets like Drowzee, Dustox, Lileep, and opposing Mightyena. With one Howl boost, Mightyena can threaten a 2HKO on Corsola, Castform, and Seaking. Heal Bell is used to maintain some defensive utility by supporting its teammates and itself as it tries to set up. Rest can often be used with Double-Edge to extend Mightyena's longevity and focus more heavily on wallbreaking with Howl. Roar is an option for setup sweepers such as Anorith, Beedrill, and Tropius that can threaten to set up on a damaged Mightyena. Mightyena's Speed investment allows it to outspeed bulky Castform, while maximum Attack investment helps solidify Mightyena's offensive presence. The remainder is invested in HP.</p> <p>Mightyena fits exceptionally well with balance and offense teams due to the excellent role compression it provides. Wallbreakers vulnerable to status such as Aipom, Seaking, and Volbeat all appreciate Heal Bell support from Mightyena. In return, they can weaken physical walls like Corsola, Koffing, Lileep, and Tropius, enabling Mightyena to use Howl and Return more freely. Volbeat is worth noting, as it can threaten opposing defensive Mightyena sets, which otherwise prove to be a nuisance if Mightyena lacks Hidden Power Fighting. Wish support from Drowzee or Delcatty on more balanced teams is greatly appreciated. However, this requires Mightyena to focus more on Heal Bell usage rather than its offensive capabilities. Thus, Mightyena prefers to use Rest and Double-Edge on more balanced builds, meaning Heal Bell support from Flaaffy or Delcatty is required. Flaaffy in particular makes for a fantastic partner, as it threatens Corsola and can spread paralysis. On more offensive teams, Mightyena greatly appreciates paralysis support from Elekid, Chinchou, and Voltorb. These Electric-types can threaten the bulky Water-types that an unboosted Mightyena can otherwise struggle into, such as Seaking, Wartortle, and Corsola. Ariados can use a slow Baton Pass to enable Mightyena to make use of Intimidate and provide it with more opportunities to use Howl or Heal Bell. Moreover, it can counter and threaten Koffing with Psychic, and in return, Mightyena removes the burn from Will-O-Wisp. Mightyena can set up against Pokemon like Lileep, Delcatty, defensive Ariados, and Dustox if it lacks Whirlwind.</p>"
      },
      "Physically Defensive": {
        "description": "<p>Mightyena is an excellent defensive anchor in ADV ZU thanks to its well-rounded bulk. Intimidate enables Mightyena to dampen physical attackers such as Aipom, Rhyhorn, and physical Noctowl. Thanks to its rare Dark typing, Mightyena is a unique stopgap to Psychic-types like Abra, Drowzee, and Smoochum. Toxic is Mightyena's most reliable move to wear down foes. Protect maximizes Mightyena's recovery from Leftovers, synergizes with Toxic, and helps it scout Choice Band attackers that might try to break through it, such as Meditite. Heal Bell is uncommon and welcome utility, letting Mightyena more comfortably deal with opposing defensive Pokemon like Porygon, Tropius, and Lileep. Return is an alternative to Heal Bell to reduce Mightyena's passivity by dealing reliable damage to a metagame with few Pokemon that resist Normal; it has a chance to 2HKO most Ponyta sets, immediately disposes of Abra, and reliably 2HKOes Meditite. No other common Pokemon in the tier resist Crunch, making it very consistent as a damaging move for Mightyena. Hidden Power Fighting deals better damage to Aipom, opposing Mightyena, and Castform, and it prevents Mightyena from being totally walled by Magnemite.</p> <p>Mightyena's role as a physical stopgap is useful for balance teams, and its ability to run Heal Bell supports defensive cores including Porygon, Noctowl, and Drowzee. Balance teams can compensate for Mightyena's limited recovery with Wish users like Delcatty and Drowzee. Mightyena's Heal Bell support is appreciated by Pokemon vulnerable to status, including Seaking, Tropius, and Castform. Mightyena's defensive value against Psychic-types is much appreciated by Poison-type teammates like Gloom, Dustox, and Koffing, which can handle Meditite's Brick Break in turn. Dustox is another Poison-type that forms a solid defensive core with Mightyena thanks to it handling non-Psychic-type special attackers, while Mightyena can blunt physical attackers like Doduo in turn. Specially defensive partners like Porygon and Castform similarly form solid defensive backbones with Mightyena. Fast cleaners like Ponyta, Quilava, and Abra benefit from Mightyena wearing down foes with Toxic while they threaten Poison-types like Gloom and Koffing that would otherwise wall it. Mightyena especially benefits from partners like the aforementioned Fire-types and Meditite that can mitigate its difficult matchup against Magnemite, and Mightyena can support them with Intimidate to allow these frailer teammates to switch in or set up more comfortably. Setup sweepers like Beedrill, Tentacool, and Anorith especially benefit from Mightyena's Intimidate widening their windows to set up; their use of Substitute has excellent synergy with Mightyena's use of Toxic to further whittle away at foes, and they can set up on Poison-types like Gloom and Koffing that would give Mightyena a hard time.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 272450, "username": "BP"}, {"user_id": 452572, "username": "missangelic"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 535530, "username": "Gangsta Spongebob"}, {"user_id": 272450, "username": "BP"}, {"user_id": 601970, "username": "sleid"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}, {"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Dustox": {
    "comments": "<h3>Other Options</h3> <p>Dustox could run Protect over Whirlwind to maximize the passive damage of Toxic and the passive recovery it receives from Leftovers. Protect also lets Dustox scout Choice Band attackers like Aipom, Seaking, and Doduo. However, dropping Whirlwind can let setup users like Howl Mightyena and Substitute Magnemite turn Dustox into setup fodder.</p> <h3>Checks and Counters</h3> <p><strong>Physical Attackers</strong>: Aipom, Doduo, and Anorith easily overwhelm Dustox because of its lower physical bulk. Castform and offensive Noctowl can 2HKO Dustox, though Toxic irritates them given their roles as bulky attackers. Meditite, Seaking, and Ariados can run physical coverage moves that beat Dustox.</p> <p><strong>Rock-types</strong>: Rhyhorn, Anorith, and Onix can switch into Dustox's attacks and threaten to overwhelm it with their Rock-type STAB moves, though they have to be wary of being worn down by Toxic and Sludge Bomb poisons.</p> <p><strong>Psychic-types</strong>: Abra 2HKOes Dustox and can use Psychic sets as setup fodder, especially by using Encore to lock Dustox into Moonlight or Psychic. Drowzee is bulky enough that its Substitute isn't broken by Sludge Bomb, but Dustox can phaze it with Whirlwind and isn't threatened until Drowzee has gained multiple Calm Mind boosts.</p> <p><strong>Fire-types</strong>: Quilava's Substitute is bulky enough to survive a Psychic from Dustox, and it and Sunny Day Ponyta threaten to 2HKO Dustox with Fire Blast. Mixed attacking Ponyta sets generally cannot 2HKO Dustox without having invested a significant amount of EVs in Special Attack.</p> <p><strong>Magnemite</strong>: Magnemite walls Dustox and can freely set up Substitute in its face, though Dustox can use Whirlwind to phaze it. Magnemite's Thunder Wave can help it and its teammates overwhelm Dustox.</p>",
    "sets": {
      "Specially Defensive": {
        "description": "<p>Dustox's impressive special bulk, reliable recovery, and immunity to Toxic make it a niche special wall. Moonlight lets Dustox wall offensive Gloom, Flaaffy, and Porygon. Sludge Bomb's good power and chance to inflict poison deter fast, frail attackers like Abra, Ponyta, and Quilava from switching in freely against Dustox. Psychic lets Dustox threaten Koffing and Ariados, take Gloom down with Special Defense drops, and break Substitute against Beedrill. Toxic lets Dustox put opposing bulky Pokemon like Castform, Porygon, and Tropius on a timer, and it punishes Ground-types like Rhyhorn, Cubone, and Onix for trying to switch in. Whirlwind phazes setup sweepers like Calm Mind Corsola, Swords Dance Gloom, and Beedrill. Dustox can also use Whirlwind to phaze Substitute users that would try to take advantage of it, such as Magnemite and Onix. Dustox can outspeed Adamant Cubone when Dustox runs 16 EVs in Speed. A Careful nature should be run if Dustox has Sludge Bomb, and a Calm nature is used if running Psychic.</p> <p>Balance and defensive teams can appreciate Dustox's ability to work as a special wall that blanket checks multiple Gloom sets and Electric-types like Flaaffy. Dustox's Whirlwind is especially helpful as a rare phazing option for defensive teams to deal with setup sweepers like Calm Mind Corsola and Swords Dance Beedrill. Mightyena can check physical attackers and Psychic-types for Dustox, and Dustox checks special attackers for Mightyena in return. Dustox's poison immunity allows it to more freely switch into status, enabling Mightyena to conserve its Heal Bell PP. Bulky Water-types like Wartortle and Seaking can check Fire-types like Ponyta and Quilava that would overwhelm Dustox, and it checks Electric-types like Chinchou and Flaaffy for them in return. Corsola and Lileep can check physical attackers like Aipom and Doduo for Dustox, and they can form a complementary defensive core with it, thanks to its good special bulk. Fast attackers like Aipom, Ponyta, and Doduo can more easily clean up teams that have been softened up by Dustox. Fast Normal-types and Fire-types like the aforementioned teammates especially appreciate how Dustox draws in Rock-types like Rhyhorn and Onix to inflict them with Toxic and wear them down. Heal Bell users like Mightyena, Delcatty, and Flaaffy are problematic for Dustox given its reliance on Toxic, so Dustox depends on Pokemon that can threaten those users, including strong wallbreakers like Cubone and Meditite. Dustox can only use Whirlwind to phaze Magnemite if it lacks Psychic, so it relies on partners like Flaaffy and Chinchou to deal real damage. Psychic-types like Abra and Drowzee pressure Dustox, which can be mitigated by teammates like Mightyena and Noctowl.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 452572, "username": "missangelic"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 272450, "username": "BP"}, {"user_id": 601970, "username": "sleid"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny004"}]}]}
  },
  "Lombre": {"sets": {"Rain Sweeper": {}, "Specially Defensive": {}}},
  "Taillow": {
    "outdated": true,
    "comments": "<h4>Other Options</h4> <p>Lead Taillow with Silk Scarf can be used to deal with Endure leads like Snorunt and Cyndaquil and physically frail leads like Chinchou, but its much lower damage output throughout the game hinders it significantly. Without a Choice item, Taillow can also utilize Endeavor to lower the HP of opposing Pokemon drastically after a single hit due to Taillow's low bulk. Hidden Power Fighting might be tempting to be able to hit all Rock- and Steel-types in one slot, but doing so loses Taillow a crucial Speed IV that makes it unable to Speed tie with Aipom, offensive Staryu, and opposing Taillow. Taillow also still cannot 2HKO a healthy Lileep with Hidden Power Fighting regardless.</p> <h4>Checks and Counters</h4> <p><strong>Rock- and Steel-types</strong>: Despite having coverage for these Pokemon, Taillow does not like having to predict and can be easily forced out if it is locked into any non-coverage move. For instance, Rhyhorn can take advantage of a Taillow locked into Double-Edge by using Substitute on it, and Lileep will always be able to wall all Taillow sets.</p> <p><strong>Frailty</strong>: Taillow's abysmal amount of bulk makes it difficult to safely switch in, as even weak neutral moves from walls such as Koffing and Dustox’s Sludge Bomb and Exeggcute’s Psychic can easily do more than half of Taillow's HP damage.</p> <p><strong>Residual Damage</strong>: Taillow's Double-Edge recoil compounded with its low HP stat can very quickly wear it down.</p> <p><strong>Faster Pokemon</strong>: Pokemon that outspeed Taillow such as Elekid and Luvdisc force it out easily.</p> <p><strong>Koffing</strong>: Koffing is able to 2HKO Taillow with Sludge Bomb and avoids being 2HKOed by Taillow's Double-Edge if Sludge Bomb doesn’t activate Guts.</p>",
    "sets": {
      "Choice Band": {
        "description": "<p>Taillow's fantastic base Speed in conjunction with Guts and powerful STAB Double-Edge allows it be an excellent revenge killer and wallbreaker. Quick Attack is used to safely revenge kill weakened Pokemon that Speed tie with or are faster than Taillow such as Aipom, Staryu, and Elekid. While not nearly as strong as Double-Edge, Aerial Ace provides a non-recoil STAB move that is still able to threaten offensive Pokemon as well as Bug- and Grass-types such as Bayleef, Dustox, and Exeggcute. Hidden Power Ground is coverage that allows Taillow to deal super effective damage to Rock- and Steel-types such as Rhyhorn, Magnemite, and Nosepass. As an alternative to Aerial Ace and Hidden Power Ground, Hidden Power Flying and Steel Wing can be used. Hidden Power Flying is stronger than Aerial Ace, while Steel Wing can hit Lileep, with the trade-off being walled by Magnemite and Aron. Taillow's access to Guts allows it to punish the use of Toxic and Will-O-Wisp by increasing its damage output, which other Choice Band Normal-types like Aipom and Pidgeotto cannot do.</p> <p>Taillow fits on offensive and balanced teams that enjoy its wallbreaking and revenge killing capabilities. Taillow suffers from competition from Pidgeotto, which has much better bulk and stronger attacks. However, Taillow's much higher Speed justifies its use on faster teams. Due to its extreme fragility, Taillow appreciates Rock- and Steel-type checks like Koffing, Bayleef, and Lileep. Special attackers such as Elekid, Chinchou, and Growlithe appreciate Taillow's ability to deal with common special walls like Dustox, Delcatty, and Chinchou; in return, Taillow benefits from their ability to deal with physical walls such as Rhyhorn, Koffing, and Magnemite. Spikes and Toxic support can help soften physical walls and lower faster offensive Pokemon into Quick Attack range.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 494585, "username": "JonAmon 25"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 535530, "username": "Gangsta Spongebob"}, {"user_id": 272450, "username": "BP"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Nosepass": {
    "outdated": true,
    "comments": "<h4>Other Options</h4> <p>Toxic is an option over Thunder Wave to wear down its switch-ins like Lileep and Rhyhorn, but Nosepass prefers to spread paralysis for its teammates to give them opportunities to either set up or break past their checks. Rock Slide can be used to help against the Flying-types, but removing any of its attacking moves makes it vulnerable to many Pokemon like Steel- and Electric-types.</p> <h4>Checks and Counters</h4> <p><strong>Water-types</strong>: Water-types like Seaking and Staryu can safely 2HKO Nosepass and can take Earthquakes from it fairly well. Seaking does have to be aware of getting crippled with Thunder Wave or OHKOed by Explosion, while Staryu only has concerns with the latter.</p> <p><strong>Grass-types</strong>: Lileep, Bayleef, and Exeggcute can all shrug off hits from Nosepass and can status or hit it back for super effective damage. They don't really enjoy taking a Thunder Wave though, and all but Lileep don't like taking an Explosion.</p> <p><strong>Status</strong>: Being hit by Toxic or getting poisoned from Sludge Bomb is less than ideal for Nosepass. Without Leftovers recovery, it gets chipped down too quickly and can't properly do its job as a wall throughout the course of the game. Burn greatly weakens Nosepass's attacks while also cancelling out its Leftovers.</p> <p><strong>Koffing</strong>: Nosepass can't do much to Koffing besides hit it with Thunder Wave. It really doesn't want to take a Will-O-Wisp, which cripples its ability to damage and utilize its Leftovers. However, Koffing does not like switching into Explosion.</p> <p><strong>Cubone and Rhyhorn</strong>: Cubone and Rhyhorn can come in on Nosepass since they are immune to Thunder Wave. However, they don't enjoy taking an Earthquake, since Rhyhorn is weak to it and Cubone doesn't have any form of recovery. They can then hit back for massive damage with their Ground-type STAB attacks.</p>",
    "sets": {
      "Wall": {
        "description": "<p>Nosepass is a strong defensive tank with great typing and monstrous bulk, allowing it to handle some of the most threatening Pokemon in the metagame like Aipom, Growlithe, and Elekid. Earthquake deals neutral damage to majority of the tier. It is chosen over a STAB move because of its ability to better hit Magnemite and Aron, since it can trap and remove them with Magnet Pull. Protect provides Nosepass some extra longevity and to scout moves from Choice Band users like Aipom and Pidgeotto. Explosion is used to OHKO offensive switch-ins like Seaking and Staryu, which can open up opportunities for its teammates. Nosepass does great at supporting slower teammates by crippling checks like Lileep, Koffing, and Bayleef with Thunder Wave. It can also slow down offensive threats like Seaking and Delibird. 60 Attack EVs are to KO Magnemite after a Substitute with Earthquake and OHKO Seaking with Explosion, with the rest used to maximize bulk.</p> <p>Nosepass does great on balance teams looking for a catch-all wall for offensive threats like Growlithe, Elekid, and Castform. It can form a solid core with physical walls like Koffing and Bayleef since they can take on Rhyhorn and Cubone, respectively. Koffing is worth the extra mention, because it can cripple physical attackers with Will-O-Wisp, which also helps put bulkier foes in range of Explosion. They also form a great Explosion core and generally cover each other's weaknesses well. Nosepass also does great at dealing with Choice Band users like Aipom and Pidgeotto because of its Rock typing, but it does have to be wary of their super effective coverage moves. These same Choice Band users make great partners because they can break through checks like Seaking and Chinchou. Aipom and Pidgeotto also appreciate Nosepass's ability to trap and remove Aron and Magnemite to open up the opposing team for them. Bulky support Pokemon like Dustox, Castform, and Delcatty also appreciate this removal as well. Nosepass appreciates being paired with these bulky supporters, since it cannot deal with Water-types like Seaking and Staryu. Nosepass desperately needs support against Flying-types like Pidgeotto and Tailow, since it cannot damage them barring Explosion, although they hate to stay in and take a Thunder Wave. Delibird is worth mentioning because it can safely use Subsitute in front of Nosepass, so Pokemon like Castform and Delcatty are great to help circumvent this issue. Slower setup sweepers and wallbreakers like Cubone, Nidorino, and Spoink appreciate Nosepass crippling faster Pokemon like Chinchou and Delibird with Thunder Wave. Nosepass prefers to be paired with a status absorber like Grimer or Delcatty, since burn cripples it entirely and poison wears it down quick with no reliable recovery.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 601970, "username": "sleid"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 535530, "username": "Gangsta Spongebob"}, {"user_id": 272450, "username": "BP"}]}, {"name": "Grammar checked by", "members": [{"user_id": 577920, "username": "Tea Guzzler"}]}]}
  },
  "Aron": {
    "outdated": true,
    "comments": "<h4>Other Options</h4> <p>Hidden Power Steel targets Lileep, though without a Choice Band it still fails to 2HKO it. Iron Tail 2HKOes Lileep outright and hits other Rock-types like Rhyhorn and Nosepass significantly harder, though its terrible accuracy makes it unreliable. Toxic can cripple some walls, notably Grass-types like Lileep and Bayleef. Body Slam is alternative over Double-Edge, trading power for a chance to paralyze foes. Choice Band is an option to let Aron act as a wallbreaker, notably allowing it to OHKO Staryu with Double-Edge, 2HKO Staryu and Seaking with Body Slam, and 2HKO Lileep with Hidden Power Steel. Unlike other Choice Band users like Aipom and Taillow, Aron's good defensive profile allows it to easily find entry points against common foes like the aforementioned Pokemon themselves as well as foes like Dustox. However, Choice Band Aron struggles since it has no recovery without Leftovers, and Aron's power alone isn't enough to break through most defensive teams.</p> <h4>Checks and Counters</h4> <p><strong>Ground-types and Ground-type Coverage</strong>: Rhyhorn and Cubone don't mind Aron's attacks that much and OHKO it with their Ground-type STAB moves; Cubone and offensive Rhyhorn also outspeed most Aron variants. Many Pokemon that use Hidden Power Ground, like Delibird and Taillow, can also outspeed and OHKO Aron, though these Pokemon tend to struggle to switch into it.</p> <p><strong>Fighting-types and Fighting-type Coverage</strong>: Mankey outspeeds and OHKOes Aron with Cross Chop, and some physical attackers like Delibird, Shuppet, and Aipom carry Fighting-type coverage, with a few of them such as Choice Band Aipom and Delibird also being able to OHKO Aron. However, none of these Pokemon can switch in easily.</p> <p><strong>Physical Walls</strong>: Koffing takes minimal damage from all of Aron's attacks, is immune to Toxic, and can burn Aron and whittle it down with special coverage, making it Aron's hardest defensive answer. Some physical walls like Bayleef can eternally wall Aron, though they must be wary of Toxic, and Lileep must be wary of Steel-type moves as well.</p> <p><strong>Special Attackers</strong>: Special attackers such as Chinchou and Growlithe can outspeed and OHKO Aron, though they don't enjoy switching into it. Staryu deserves a special mention, as alongside outspeeding and OHKOing Aron, Staryu will never be OHKOed by non-Choice Band Aron's attacks, only taking upwards of 90% from Double-Edge, and it can use Recover to stay healthy.</p>",
    "sets": {
      "Protect + 3 Attacks": {
        "description": "<p>Aron's high physical bulk, good Attack, and unique Steel / Rock typing give it a niche as a tank. Protect lets it stall for Leftovers recovery and scout which move Choice Band users like Aipom and Pidgeotto lock themselves into. Double-Edge is Aron's strongest attack against neutral targets, dealing sizable damage to offensive foes like Aipom and Pokemon like Staryu and Seaking. Rock Slide primarily targets Flying-types like Pidgeotto and Taillow and Bug-types like Dustox and Butterfree. Earthquake mainly hits Rock-types like Rhyhorn and Nosepass, Electric-types like Elekid and Magnemite, and some Poison-types like Grimer. This EV spread maximizes Aron's Attack while giving it enough Speed investment to outspeed and revenge kill lure Rhyhorn, with the rest being dumped into HP. An EV spread of 40 HP / 252 Attack / 216 Spe can be used instead to outspeed all variants of Rhyhorn, though the loss in bulk is noticeable.</p> <p>Aron fits on balance teams that appreciate its unique defensive utility, taking advantage of other balance and some defensive teams. It stonewalls CurseTalk Grimer thanks to its immunity to Poison, making it a natural partner for teammates Grimer can otherwise take advantage of, like Delcatty and Elekid. Another notable Poison-type Aron does extremely well against is Dustox, making it pair nicely with special attackers that struggle against it like Elekid and Chinchou. It is also an excellent check to Choice Band Double-Edge users like Aipom, Pidgeotto, and Taillow, as it can switch into most of their attacks with ease, though it must be wary of their Fighting- and Ground-type coverage. Aron also must be wary of Ground-types such as Rhyhorn and Cubone, as well as Mankey, as they can easily OHKO it using their 4x super effective STAB attacks. Certain physical walls such as Bayleef and Koffing make good partners for their ability to switch into the Normal-types' coverage and check Ground- and Fighting-types. Most special attackers such as Chinchou and Growlithe have little trouble taking out Aron, so special walls and tanks like Delcatty and Castform are essential teammates. Aron struggles to break through Lileep and Koffing, so it appreciates wallbreakers like Substitute Delibird and mixed wallbreaker Seaking that work excellently in eliminating these foes. Chinchou deserves a special mention, as it can break through most physical walls, switch into and beat Water-types trying to eliminate Aron, and mitigate Aron's Speed issues using Thunder Wave.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 535530, "username": "Gangsta Spongebob"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 272450, "username": "BP"}, {"user_id": 479897, "username": "BeatsBlack"}]}]}
  },
  "Meditite": {
    "comments": "<h3>Other Options</h3> <p>High Jump Kick is stronger than Brick Break and can secure some additional KOs against Pokemon like Mightyena, but crash damage from misses and Protect is hugely detrimental to Meditite. Double-Edge is stronger than Return and 2HKOes Koffing, but the recoil damage is not preferred on a Pokemon as frail as Meditite when Return is strong enough for it to break other Pokemon that resist Fighting. A set with Substitute, Leftovers, and Focus Punch can take advantage of the switches Meditite forces, but the surprise factor goes away once the set is revealed, and Meditite is better at dealing immediate damage. A Salac Berry set with Substitute or Endure and Reversal can turn Meditite into a sweeper, but it struggles to set up safely and is vulnerable to being picked off by Quick Attack from offensive Pokemon like Doduo, Ponyta, and Quilava. Fake Out is tempting to compensate for Meditite's middling Speed, but it is very exploitable once it's locked into Fake Out. Baton Pass might seem interesting to help Meditite pivot out of bad matchups, but its role is to deal as much damage as possible instead of trying to position its partners.</p> <h3>Checks and Counters</h3> <p><strong>Pokemon That Resist Fighting</strong>: Meditite cannot 2HKO Koffing with any of its coverage moves and risks burns from Will-O-Wisp, and Koffing can use Pain Split to keep itself healthy enough to check Meditite. Gloom and Tropius are difficult for Meditite to break through without proper prediction or chip damage, though they are 2HKOed by Hidden Power Flying. Volbeat and Beedrill have to be wary of Meditite's coverage but can take a Choice Band-boosted Brick Break. Drowzee fears Shadow Ball and Return, but physically defensive sets can beat Meditite one-on-one if it's locked into Brick Break or Hidden Power Flying.</p> <p><strong>Faster Offensive Pokemon</strong>: Quilava, Abra, and Ponyta all outspeed and OHKO Meditite. Aipom and Doduo can even take advantage of Meditite locked into Shadow Ball. However, almost no faster Pokemon can safely switch into Choice Band Meditite's Brick Break or even Return, so they must be careful.</p> <p><strong>Paralysis</strong>: Porygon and Castform's Thunder Wave debilitates Meditite due to its frailty and role as a mid-Speed wallbreaker, making them unsafe to switch into. Body Slam from Delcatty deals significant damage and can punish Meditite with paralysis for trying to switch in to take advantage of it using a non-attacking move.</p> <p><strong>Protect</strong>: Protect users like Mightyena, Seaking, and Castform can scout Meditite's move and switch to an appropriate teammate, which is very frustrating from otherwise easy targets for Meditite.</p>",
    "sets": {
      "Choice Band": {
        "description": "<p>Backed by Pure Power, Meditite is a powerful Choice Band wallbreaker in ADV ZU. Meditite capably destroys defensive Pokemon like Corsola, Mightyena, and Porygon with its rare STAB Brick Break. Return deals significant damage to the most common physically defensive Pokemon that resists Fighting, Koffing, as well as Tentacool, and it has nearly perfect coverage with Brick Break, given that Shuppet is the only Ghost-type in the tier and is very uncommon. Shadow Ball destroys Substitute + Calm Mind Drowzee, has perfect neutral coverage with STAB Brick Break, and dents most Pokemon that resist Fighting. Hidden Power Flying 2HKOes bulky Grass-types like Gloom and Tropius and OHKOes Ariados as well as other Pokemon that resist Fighting, but its lower power makes it a less-than-optimal move for Meditite to lock into. A Jolly nature lets Meditite outspeed neutral nature Seaking as well as Speed tie opposing Meditite.</p> <p>Fast offensive teammates like Ponyta, Doduo, and Abra can more easily clean up teams once Meditite has worn down their defensive cores. Meditite's Speed leaves it vulnerable to faster Pokemon such as Aipom and Ponyta, so defensive teammates that can handle them such as Mightyena, Wartortle, and Corsola are appreciated. Physical walls like Gloom and Tropius are a pain for Meditite to beat on its own without good prediction, so Pokemon like Beedrill, Ponyta, and Quilava make excellent partners by beating them. Baton Pass support from users like Delcatty and Volbeat is appreciated to help Meditite get in more safely. Paralysis support from Castform, Flaaffy, and Porygon can slow down faster offensive Pokemon for Meditite to beat, and Meditite's power compensates for its more utility-oriented teammates. Koffing can switch into Meditite's STAB move, so partners like Corsola, Drowzee, and Ponyta are appreciated as switch-ins to Koffing.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 452572, "username": "missangelic"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 535530, "username": "Gangsta Spongebob"}, {"user_id": 601970, "username": "sleid"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Wailmer": {"sets": {"Lead": {}}},
  "Numel": {
    "sets": {
      "Rest": {},
      "Special Wall": {
        "outdated": true,
        "description": "<p>Numel's typing gives it a niche to work as a special wall since it can switch into Koffing safely while also taking on two of the most powerful special attackers of the tier; Elekid and Growlithe. Numel can come in safely and OHKO both of these threats with STAB Earthquake while also being able to chunk offensive switch-ins like Rhyhorn. Fire Blast is its preferred Fire-type STAB move since it allows Numel to 2HKO Koffing and 3HKO Dustox. Flamethrower is an option with its better accuracy and greater PP since it still does well against the likes of Sunflora and Bayleef, but it fails to threaten Koffing and Dustox. RestTalk is the best recovery option to increase Numel's longevity. It's also worth mentioning that RestTalk gives Numel the ability to stall out Dustox in a 1v1 situation. Leftovers is preferred to rack up recovery against more passive opponents, while Chesto Berry works to give Numel the ability to keep threatening its enemies since being asleep can make it much more passive.</p> <p>Numel performs best on balance teams looking for something to handle Electric- and Fire-types like Elekid and Growlithe. It pairs well with Snorunt since Numel can switch into the leads that can beat it like Cyndaquil, Elekid, and Spoink, while Spikes from Snorunt give it a greater chance to take down Dustox with a 2HKO. Special attackers benefit from Numel's ability to safely switch into Dustox and Grimer to wear them down. Fast attackers and setup sweepers like Croconaw and Aipom appreciate Numel's ability as a status absorber with its typing and RestTalk. With its horrible physical bulk, Numel needs support from Pokemon that resist Normal-types, like Rhyhorn, Nosepass, and Lileep, to take hits from Aipom and Pidgeotto. Koffing is a great partner because it can help with offensive foes like Rhyhorn and Cubone that can OHKO Numel with Earthquake. Water-types like Seaking and Staryu threaten Numel because they can stomach an Earthquake and OHKO back with their 4x effective Water moves, so support from special walls like Dustox and Castform are needed. Numel can be taken advantage of when asleep, making Delcatty a solid teammate that can help remedy this with Heal Bell.</p>"
      }
    }
  },
  "Spoink": {
    "sets": {
      "Sub CM": {},
      "Substitute + Calm Mind": {
        "outdated": true,
        "description": "<p>Spoink operates as a sweeper or late-game cleaner with its solid bulk, Special Attack, and offensive typing that lacks resistances and beats many great special walls. Substitute lets Spoink avoid status conditions from the likes of Dustox and helps it get a safe Calm Mind against Pokemon it immediately threatens out like Snorunt, Koffing, and Cyndaquil. Due to its great special bulk, it can still continue to set up on special attackers like Elekid. Psychic 3HKOes Grimer and Dustox unboosted, as well as 2HKOing Elekid and Growlithe. After a Calm Mind, bulky Pokemon like Castform and Lileep have a harder time switching in and handling Spoink safely. Hidden Power Grass OHKOes Rhyhorn, which would otherwise be able to survive a Psychic and obliterate Spoink with Megahorn. Investing in HP over Special Attack helps Spoink function better as a sweeper, since it can set up with Calm Mind and Substitute on special attackers with better ease.</p> <p>Spoink does best on offensive or balance teams looking for a sweeper. It relies on physical attackers like Aipom, Pidgeotto, and Rhyhorn to remove the likes of Delcatty, which otherwise thwarts any attempts at a sweep. With its abysmal Defense, Rhyhorn, alongside other Pokemon that resist Normal like Lileep and Nosepass, make great partners to help take hits from Aipom and Pidgeotto, which OHKO Spoink with their STAB attacks. Spikes from Snorunt and Pineco really help Spoink break through Dustox and Grimer, turning them into a 2HKO instead of a 3HKO. Pokemon that bait in Growlithe and Cyndaquil like Sunflora and Magnemite pair well with Spoink, since it can set up on them or force them out. Spoink can help take special hits for physical walls like Rhyhorn and Lileep in a pinch, but it really needs all the health it can get to start performing a sweep and thus should be preserved. Paralysis spreaders such as Chinchou and Nosepass are also appreciated to give Spoink an easier time setting up on different targets like Butterfree and opposing Chinchou. Spoink taking any sort of status takes away its sweeping ability, so absorbers like Grimer and Staryu make great partners.</p>"
      },
      "Lead": {
        "outdated": true,
        "description": "<p>Spoink carves out a niche as a lead thanks to its special bulk and access to Thick Fat, which allows it to beat other common leads such as Snorunt, Growlithe, and Cyndaquil. Calm Mind allows Spoink to set up on Growlithe and Cyndaquil. Taunt is able to prevent Snorunt from using Spikes and, alongside Lum Berry, Butterfree from using Sleep Powder. STAB-boosted Psychic threatens Poison-type Pokemon such as Grimer, Koffing, and Nidorino, and due to the lack of Dark-types in the tier, it is very spammable. Hidden Power Fire is used to threaten Steel-types such as Magnemite and Aron. Hidden Power Grass can be used to help Spoink OHKO Rhyhorn without relying on a Calm Mind boost while also hitting Aron. Alternatively, Substitute can be used to help Spoink avoid status. The most notable instance of this is against Butterfree, where a Taunt followed by a Substitute allows Spoink to set up on it. While both Substitute and Hidden Power Grass are effective they fail to check Magnemite. 180 Speed EVs allow Spoink to outspeed Snorunt, while 236 HP EVs prevent a 2HKO from Growlithe's Crunch. 88 Special Attack EVs allow Spoink a chance to OHKO Cyndaquil with Psychic at +1.</p> <p>Spoink fits best on teams that aim to take advantage of common leads on balance teams such as Cyndaquil, Growlithe, and Snorunt. It can make an excellent lead on bulky offense teams for this reason. Dustox and bulky Castform are unable to check Cyndaquil and Growlithe reliably, so they naturally appreciate Spoink as a counter-lead. Pokemon that struggle against lead Butterfree such as Koffing, Rhyhorn, and Cubone all appreciate how adept Spoink is at shutting it down and forcing it out. Pokemon that struggle with taking repeated Spikes damage such as Magnemite, Chinchou, and Nosepass appreciate Spoink's denial of Snorunt's entry hazards. Other Substitute users such as Larvitar, Croconaw, and Mankey also appreciate the lack of Spikes. Larvitar is worth mentioning, as it can turn Delcatty, which walls Spoink, into set-up fodder. Other physical attackers such as Aipom, Rhyhorn, and Cubone can threaten Delcatty just as well. Spoink appreciates physically defensive walls such as Nosepass and Koffing, as they can prevent faster physical foes such as Aipom and Pidgeotto from OHKOing it.</p>"
      }
    }
  },
  "Lileep": {"sets": {"Defensive": {}}},
  "Anorith": {
    "comments": "<h3>Other Options</h3> <p>To outspeed Voltorb, Salac Berry sets require 136 Speed EVs. However, this forgoes some Special Defense, making Anorith more susceptible to being picked off by Ponyta and Quilava before it gets a boost from Salac Berry. Adding 4 EVs to HP on Salac Berry sets helps to activate the Salac Berry quicker and reduces its vulnerability to weak Quick Attacks. Knock Off and Rapid Spin can be used on Choice Band sets in place of Rock Blast or Double-Edge, providing more options for utility. Knock Off helps to remove Leftovers from physical walls such as Koffing and Wartortle that would frequently wall Anorith. Rapid Spin helps remove Spikes for offensive teams that are crippled by them. These options are unreliable, however, as Anorith will be locked into weak moves.</p> <h3>Checks and Counters</h3> <p><strong>Physical Walls</strong>: Wartortle avoids a 2HKO from Choice Band Anorith's Rock Slide, which can in response OHKO it with Surf in response. Wartortle is able to absorb several Rock Slides from Salac Berry Anorith and force it out. Koffing can switch into Brick Break and Hidden Power Bug freely and it can use Will-O-Wisp to neutralize Choice Band Anorith. Sludge Bomb and Flamethrower are able to break Anorith's Substitute and can status it if it choses to use Swords Dance without Substitute. Gloom is able to switch in and threaten Anorith with Stun Spore and breaks Anorith's Substitute. It also has a 0.4% chance of getting 2HKOed after Leftovers by Adamant Anorith's Choice Band Rock Slide.</p> <p><strong>Status Users</strong>: Thunder Wave from Castform and Porygon can greatly reduce Anorith's Speed, neutralizing it. Toxic from Mightyena and Seaking puts Anorith on a timer and can prevent a Salac Berry sweep altogether. Will-O-Wisp from Koffing significantly reduces Anorith's attacking output and puts it on a timer.</p> <p><strong>Faster Threats</strong>: All-out attacker Quilava will always OHKO Salac Berry sets with Overheat, and all Quilava sets can pick off Choice Band sets through Fire Blast. Salac Berry sets are vulnerable to Quick Attack once their Substitute is gone. Elekid outspeeds Salac Berry sets even after they have boosted. If Anorith is running an Adamant nature on Choice Band sets, it loses to Choice Band Doduo and Delibird, as it's susceptible to their Flying-type attacks. With Signal Beam, Volbeat has a 68.8% chance of OHKOing Anorith. Abra has a 68.8% chance to OHKO Choice Band sets with Psychic.</p>",
    "sets": {
      "Salac Berry": {
        "description": "<p>Anorith functions as a strong Salac Berry sweeper thanks to its high base Attack, solid type combination, and Swords Dance. Rock Slide is used most often due to the lack of Rock-resistant Pokemon within the tier, being able to OHKO Flaaffy, Noctowl, and uninvested Seaking at +2. Brick Break complements Rock Slide by targetting the likes of Corsola, Magnemite, and Porygon super effectively. Alternatively, Hidden Power Bug secures an OHKO on the likes of physically defensive Lileep at +2 and physically defensive Mightyena at +3 after Intimidate. Substitute gives Anorith some form of protection from switch-ins and status, allowing it to set up freely while getting itself down to Salac Berry range. Anorith can scare off Pokemon such as Magnemite and Ariados through its attacking options, allowing it the free opportunity to use Substitute. Swords Dance allows Anorith to become a threatening cleaner. An Adamant nature allows Anorith to OHKO uninvested Seaking at +2. 76 Speed EVs allow Anorith to outspeed Pokemon such as Ponyta and Abra at +1, while the Special Defense EVs allow it to tank Quilava's Fire Blast and Abra's Psychic so it can set up.</p> <p>Salac Berry Anorith functions best on offensive teams that benefit from having a strong cleaner to support them. Pokemon such as Gloom, Flaaffy, and Castform that help spread status are appreciated, giving Anorith more windows of opportunity to set up and sweep. Various Choice Band users, such as Aipom, and other setup Pokemon, like Quilava and Cubone, can help dismantle certain defensive cores, which allows Anorith to have an easier time sweeping. Seaking can cover for the likes of Koffing thanks to its solid Special Attack allowing it to 2HKO Koffing with Surf and access to Water Veil. Castform offers mixed attacking coverage and status, weakening threats like Gloom and Koffing and allowing Anorith to come in and clean. Wartortle gives Anorith a hard time. To help with this, both Magnemite and Tentacool are immune to its Toxic, Magnemite can 2HKO Wartortle with Thunderbolt, and Tentacool can apply pressure to non-Refresh and Seismic Toss Wartortle with status and Substitute. Anorith provides an important resistance to Normal, which Flaaffy and Porygon appreciate. However, Anorith isn't bulky enough to switch into Normal-type wallbreakers such as Choice Band Aipom and Doduo long-term, so Pokemon such as physically defensive Gloom and faster threats like Ponyta can prevent these Pokemon from causing too much havoc.</p>"
      },
      "Choice Band": {
        "description": "<p>Anorith establishes itself as a powerful Choice Band user thanks to the limited Rock-resistant Pokemon in the tier and its incredibly high Attack stat to back it up while also being decently fast. Rock Slide hits the majority of the tier neutrally or super effective and has an additional chance to flinch, potentially flipping the course of a game. Brick Break complements Rock Slide, as it allows Anorith to OHKO targets like Magnemite and Castform as well as 2HKO Rhyhorn. Hidden Power Bug uses Anorith's secondary STAB option to hit Drowzee and Mightyena harder. Rock Blast thwarts Substitute users such as Beedrill and Abra from setting up. Double-Edge deals slightly more damage compared to Rock Slide, with the drawback of recoil. This allows Double-Edge better odds of OHKOing Choice Band Seaking and Flaaffy. An Adamant Nature allows Anorith to secure 2HKOs on physically defensive Corsola using Brick Break and physically defensive Mightyena using Hidden Power Bug, while Jolly allows Anorith to outspeed maximum Speed Mightyena, Smoochum, and Chinchou.</p> <p>Choice Band Anorith fits best on offense teams, functioning as a strong wallbreaker. Paralysis spreaders such as Porygon and Gloom immobilize faster Pokemon, enabling Anorith to more effectively eliminate them. Anorith itself also doesn't like status spreaders, so offensive clerics like Flaaffy and Mightyena are greatly appreciated. Physical walls such as Koffing and Wartortle are capable of absorbing a Rock Slide, allowing the opponent to capitalize on Choice-locked Anorith; special wallbreakers like Magnemite and Clamperl can break past them for Anorith. Specially offensive setup sweepers such as Abra and Smoochum appreciate Anorith being able to handle special walls such as Noctowl and Lileep. Physical setup sweepers such as Cubone and Swords Dance Gloom enjoy Anorith wallbreaking, making it easier for them to come in and clean the weakened team. Other physical wall breakers that provide mixed coverage, like Seaking and Castform, complement Anorith, as they are able to break through Koffing and Wartortle. Weather team struggle to answer specially defensive Pokemon such as Drowzee and Delcatty; Anorith can threaten both Pokemon out with reliable 2HKOs using Rock Slide. Anorith is outsped and OHKOed by Quilava and Staryu, so special walls like Noctowl and specially defensive Lileep make great partners.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 635335, "username": "Zpice"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 272450, "username": "BP"}, {"user_id": 601970, "username": "sleid"}, {"user_id": 535530, "username": "Gangsta Spongebob"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}, {"user_id": 452572, "username": "missangelic"}, {"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Shuppet": {
    "outdated": true,
    "comments": "<h4>Other Options</h4> <p>Taunt can be used to stop Pokemon like Delcatty and Lileep from using their recovery moves, but it is usually better to just spread status instead. Knock Off also sees use to remove items from Pokemon like Dustox and Lileep, but again, status moves are usually preferred.</p> <h4>Checks and Counters</h4> <p><strong>Physical Walls</strong>: Shuppet can struggle to break physical walls like Lileep and Koffing due to its lackluster power, although these walls must be careful about status from Shuppet.</p> <p><strong>Strong Attackers</strong>: Shuppet's only defensive utility is through its Ghost typing; its defensive stats are horrible, meaning Pokemon like Seaking and Rhyhorn can threaten to OHKO Shuppet with even neutral moves like Hydro Pump and Earthquake.</p> <p><strong>Status Spreaders</strong>: Shuppet is completely ruined by burn and Toxic poison, which cancel out its Leftovers recovery, from users such as Koffing and Dustox. Paralysis from Pokemon like Magnemite and Nosepass also makes it slower then Pokemon like Cubone and Rhyhorn, which can in turn OHKO it.</p> <p><strong>Faster Attackers</strong>: Faster attackers like Elekid and Masquerain can threaten to OHKO Shuppet because of its lackluster bulk. Aipom and Pidgeotto can also OHKO it with their other moves like Aerial Ace and Shadow Ball if you predict incorrectly.</p>",
    "sets": {
      "Stallbreaker": {
        "description": "<p>Shuppet finds a niche thanks to being the only Ghost-type in the entire metagame, giving it useful immunities to Normal- and Fighting-type attacks, like Aipom's Double Edge and Brick Break, Delcatty's Body Slam, and Mankey's Cross Chop. It also boasts great utility in Thunder Wave, Will-O-Wisp, and Toxic to break down the opposing team. Shadow Ball is great neutral coverage thanks to the rarity of Dark-types. Hidden Power Fighting allows Shuppet to threaten Normal-types such as Castform and Aipom, which are immune to Shadow Ball, and Rock- and Steel-types like Lileep and Magnemite for a moderate amount of damage. Substitute allows Shuppet to take advantage of Choice-locked Normal-types such as Aipom, Pidgeotto, and Taillow by easing prediction as it forces them out. For Shuppet's last moveslot, you have the choice of either Thunder Wave, Toxic, or Will-O-Wisp. Thunder Wave helps slow down fast Pokemon like Elekid and Aipom to support slow Pokemon like Croconaw and Cubone, and it also cripples defensive walls like Lileep and Dustox. Will-O-Wisp threatens physical attackers like Mankey, Pidgeotto, and Koffing on the switch in. Toxic cripples general defensive walls like Lileep and helps Shuppet break down the opposing team more easily.</p> <p>Shuppet can fit on offensive and balance structures alike because of its ability to disrupt teams and deal with Normal-types like Delcatty well. Partners such as Chinchou, Elekid, and Growlithe particularly enjoy Shuppet's ability to take advantage of Delcatty. Shuppet can struggle with strong physical walls like Lileep, so strong special wallbreakers like Seaking and Chinchou can help Shuppet break through these walls. Physical and special wallbreakers also appreciate Shuppet's ability to spread crippling status onto various walls in the metagame, with it particularly helping cleaners like Elekid and Aipom. Many special walls like Delcatty and Dustox also appreciate Shuppet's presence, as strong Normal-types like Aipom and Pidgeotto can break through them easily, so Shuppet's ability to dissuade them from using their Normal-type moves is valuable. Pairing Shuppet with Thunder Wave users such as Magnemite and other paralysis spreaders like Butterfree is also a great option to help circumvent Shuppet's low Speed while allowing it to fish for full paralysis with Substitute.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 595639, "username": "plznostep"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 272450, "username": "BP"}, {"user_id": 535530, "username": "Gangsta Spongebob"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Tropius": {
    "comments": "<h3>Other Options</h3> <p>Tropius can use a physical EV spread with Hidden Power Flying and Swords Dance as an alternative to its sun sweeper set, hitting specially defensive Pokemon like Gloom harder. However, this set struggles against Mightyena and its Intimidate. Non-sun Sun sweeper Tropius can pull Swords Dance off better despite being slower thanks to their extra bulk and longevity creating opportunities to set up. Sun sweeper Tropius wants Synthesis for recovery but struggles to fit it over either of its coverage moves.</p> <h3>Checks and Counters</h3> <p><strong>Fire-types</strong>: Fire-types such as Ponyta and Quilava threaten to OHKO offensive Tropius sets and 2HKO defensive sets. Tropius cannot OHKO them back with Earthquake without a Swords Dance boost or prior damage.</p> <p><strong>Koffing</strong>: Defensive Tropius can find it difficult to break through Koffing due to its great physical bulk.</p> <p><strong>Porygon</strong>: Porygon has the bulk to easily take attacks from Tropius while threatening it with Ice Beam and Toxic.</p> <p><strong>Status</strong>: Offensive Tropius sets hate getting hindered by paralysis and burns from foes like Elekid and Koffing, while more defensive sets greatly dislike Toxic from the likes of Porygon, especially since these sets are supposed to wall foes.</p> <p><strong>Ice-type Attacks</strong>: Tropius is massively threatened by Ice-type attacks. Ice-type coverage from foes like Corsola, Seaking, and Abra threatens to KO uninvested Tropius with little-to-no prior chip damage.</p>",
    "sets": {
      "Physically Defensive": {
        "description": "<p>Tropius's amazing bulk and reliable recovery make it an excellent wall to common physical attackers like Aipom, Seaking, and Meditite. Hidden Power Flying is Tropius's most reliable and strongest STAB attack, and it has neutral or super effective coverage against most physical attackers, such as Doduo and Volbeat. Hidden Power Flying also punishes Poison-types weak to Flying such as Gloom, Beedrill, and Ariados trying to take advantage of Tropius. Earthquake provides excellent coverage, threatening Pokemon that resist Hidden Power Flying such as Flaaffy, Chinchou, and Magnemite. Earthquake mitigates Tropius's vulnerability to Ponyta and Quilava, and it can let Tropius beat them or significantly weaken them in a pinch if it isn't OHKOed by Quilava's Charcoal-boosted Overheat. Leech Seed helps Tropius wear down foes, keep itself healthier, and punish Pokemon that might take advantage of its passivity, including Mightyena, Koffing, and Noctowl. Alternatively, Tropius can use Swords Dance to help it break past bulkier Pokemon such as Corsola, Gloom, and opposing Tropius. An alternative EV spread of 252 HP / 48 Atk / 128 Def / 84 Spe reliably avoids a 2HKO from Choice Band Aipom's Double-Edge while giving Tropius enough Speed to tie sun sweeper Gloom, outspeed base 95 Pokemon like Elekid in sun, and outspeed Adamant Rhyhorn with 252 Speed EVs. This spread also has enough Attack investment to KO Hasty Ponyta with Earthquake after Leech Seed damage.</p> <p>Physically defensive Tropius is a great addition to balance teams thanks to its reliability as a physical wall. Corsola is a standout partner for Tropius by absorbing Toxic and standing up to physical attackers like Doduo, Anorith, and Beedrill with super effective STAB attacks, while Tropius handles Meditite and takes Fighting-type coverage from Aipom for Corsola in return. Koffing can also absorb Toxic and mitigate Tropius's vulnerabilities to Poison-types like Swords Dance Gloom and Tentacool. Pokemon that can absorb Toxic such as Corsola, Koffing, and Magnemite make great partners for Tropius. Heal Bell users like Mightyena, Flaaffy, and Delcatty can relieve Tropius of status if it must take a Toxic. Notably, Mightyena appreciates Tropius's longevity enabling it to take on physical attackers and keep itself healthier, while Delcatty's special bulk makes it complementary to Tropius. Pokemon that can take Fire-type moves like Seaking, Noctowl, and Chinchou make great partners for Tropius. Other specially bulky Pokemon like Drowzee, Porygon, and Lileep also pair nicely with Tropius by taking on special attackers with Ice-type coverage like Flaaffy, Smoochum, and Elekid. Koffing can handle Tropius's attacks, so teammates that can deal with it like Magnemite, Ponyta, and Tentacool are great partners.</p>"
      },
      "Sun Sweeper": {
        "description": "<p>Tropius works as a potent sweeper and cleaner in ADV ZU, being able to hit hard into big threats such as Corsola and Seaking hard under sun. Solar Beam is a powerful move in sun even against Grass-resistant foes, such as Ponyta and Quilava. Hidden Power Fire hits Grass-types like Gloom especially hard. It is Tropius's best option against Grass-resistant foes, such as Koffing and Ariados. Earthquake hits Fire-types super effectively, including the likes of Ponyta and Quilava. Additionally, Earthquake can hit Chinchou and Corsola when sun isn't up. Lum Berry lets Tropius have an easier time taking on status users, such as Porygon and Wartortle. The Defense investment allows Tropius to survive Choice Band Drill Peck from Doduo and two Sludge Bombs from Koffing. The Speed investment lets Tropius outspeed Voltorb and the rest of the unboosted metagame under sun. A Rash nature allows for Tropius to hit hard with both its physical and special moves.</p> <p>Tropius fits on dedicated sun teams thanks to its coverage and ability to sweep with Chlorophyll. Tropius really appreciates the support of Gloom, which can set sun right in front of rain teams even against Ice Beam coverage. Tropius works nicely alongside partners such as Ponyta and Quilava, as they benefit from the sun set by Tropius and more comfortably take Ice-type attacks from Pokemon such as Porygon and Abra. Sun setter Ponyta can help set up sun and beat Porygon with a Run Away set. Koffing is another potential sun setter that can support Tropius, and it's capable of taking on troublesome Poison-types such as Gloom and Ariados.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 452572, "username": "missangelic"}, {"user_id": 650323, "username": "Pengu"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 601970, "username": "sleid"}, {"user_id": 272450, "username": "BP"}, {"user_id": 535530, "username": "Gangsta Spongebob"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}, {"user_id": 528364, "username": "adorluigi"}, {"user_id": 452572, "username": "missangelic"}]}]}
  },
  "Snorunt": {
    "outdated": true,
    "comments": "<h4>Other Options</h4> <p>Hidden Power Fire is an option for threatening opposing Snorunt leads and Magnemite. However, without Hidden Power Grass, Snorunt cannot reliably threaten Water-types such as Staryu and Chinchou for any significant damage. Hidden Power Water is an option to threaten Fire-types such as Cyndaquil and Growlithe, which otherwise use Snorunt as setup fodder, but it comes with the same flaws that Hidden Power Fire does.</p> <h4>Checks and Counters</h4> <p><strong>Taunt</strong>: Faster Taunt users such as Spoink and Aipom can completely deny Snorunt from Spikes on the field, and they can either use it as setup fodder or OHKO it outright.</p> <p><strong>Status Spreaders</strong>: Status spreaders such as Aipom, Magnemite, and Butterfree can cripple Snorunt with paralysis, making Salac Berry useless. Aipom can also cripple it with Toxic, rendering Endure useless. Butterfree is notable for sleeping Snorunt before it even has a chance to set up Spikes, incapacitating it for most the game.</p> <p><strong>Setup Sweepers</strong> Setup Sweepers such as Growlithe and Spoink do not fear any of Snorunt's moves and can use Snorunt as set up fodder. However, Growlithe cannot consistently stop Snorunt from setting up Spikes.</p> <p><strong>Rapid Spin</strong> Hazard Removal from Rapid Spinners such as Staryu can completely ruin Snorunt's effectiveness by removing Spikes.</p> <p><strong>Priority Moves</strong>: Priority moves from Pokemon such as Pidgeotto, Elekid, and Cyndaquil can pick off Snorunt even when it has activated its Salac Berry. Cyndaquil is notable for being able to KO Snorunt before it can set up Spikes.</p>",
    "sets": {
      "Spikes Lead": {
        "description": "<p>Snorunt may look like a horrible Pokemon in ADV ZU at first glance due to its terrible stats and abysmal defensive utility, but Spikes grants its team a powerful form of support. Ice Beam is a great STAB option that also threatens common Pokemon such as Pidgeotto and Lileep. Hidden Power Grass allows Snorunt to threaten the most prominent spinner in the tier, Staryu, alongside other Water-types such as Chinchou and Seaking. Finally, Endure allows Snorunt to activate its Salac Berry and outspeed every unboosted Pokemon bar Voltorb, meaning it will always be able to get a layer of spikes versus Pokemon without priority or a status move.</p> <p>Snorunt fits best on offensive and balance teams that benefit from Spikes support. Due to Snorunt's prevalence as a lead, it often faces counter-leads that can shut down Spikes such Aipom, Butterfree, and Cyndaquil. Some partners that can deal with these threats are Elekid, Seaking, and Magnemite. These partners and other offensive threats enjoy Spikes chipping down Pokemon that are otherwise tough matchups for them, such as Delcatty, Lileep, and Dustox, allowing them to wallbreak much more easily. Snorunt also appreciates pivots such as Aipom, Delcatty, and Lileep to help it set up spikes later if it faces an unfavourable lead matchup. Additionally, the former two are great checks to Spoink, another tough lead matchup for Snorunt due to its fast Taunt. Lileep can also deal with common priority users such as Pidgeotto and Taillow, which completely shut down Snorunt with a Salac Berry boost, and it checks Fire-types such as Growlithe and Cyndaquil that threaten Snorunt. As teammates, priority users enjoy Spikes chipping down faster Pokemon such as Elekid into range of a KO. Even defensive pokemon enjoy Spikes which helps them threaten offensive Pokemon such as tank Castform. Shuppet uniquely denies Rapid Spin users such as Staryu, and it takes advantage of the Spikes on Delcatty and Pokemon locked into Normal- or Fighting type moves. Lastly, Magnemite walls Snorunt, so Nosepass can be used trap and remove it, while at the same time also handling priority move users and Fire-types like Lileep can. However, Nosepass does not have the longevity to do this repeatedly throughout a game.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 595639, "username": "plznostep"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 535530, "username": "Gangsta Spongebob"}, {"user_id": 272450, "username": "BP"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}]}
  },
  "Clamperl": {
    "comments": "<h3>Other Options</h3> <p>Rest can be used to try and keep Clamperl healthy to trade more, but it relies on team support through Heal Bell and thus can be inconsistent on a game-to-game basis. Deep Sea Scale gives Clamperl good special bulk, but it is outclassed by other Water-types such as Wartortle in a defensive role due to a low HP stat and no passive recovery through Leftovers.</p> <h3>Checks and Counters</h3> <p><strong>Electric-types</strong>: Pokemon such as Chinchou, Flaaffy, and Elekid all outspeed Clamperl and threaten to OHKO it; though, all of these Pokemon are not able to switch into Clamperl safely.</p> <p><strong>Grass-types</strong>: While they must be wary of Ice Beam, Grass-types such as Gloom can take one hit from Clamperl and threaten an OHKO, but they are unreliable at switching into Clamperl.</p> <p><strong>Faster Attackers</strong> Due to Clamperl's mediocre bulk, it is often OHKOed by many of the tier's special attackers such as Abra on sets without bulk, while Pokemon with super effective coverage such as Staryu and Quilava can threaten it out as well with chip damage beforehand.</p> <p><strong>Physical Wallbreakers</strong> Physical wallbreakers such as Doduo and Meditite all outspeed and threaten an OHKO on Clamperl. After some chip damage, Pokemon such as Aipom and Anorith can also revenge kill Clamperl.</p>",
    "sets": {
      "Wallbreaker": {
        "description": "<p>Clamperl is a huge threat for many slower teams with excellent offenses thanks to Deep Sea Tooth while being able to find common entry points on Pokemon such as Corsola. Surf OHKOes or 2HKOes the vast majority of the tier with the exception of Water-resistant Pokemon. Ice Beam threatens Grass-types with an OHKO in the case of physically defensive Gloom and Tropius while also OHKOing specially defensive Gloom after Surf. Hidden Power Grass threatens Water-types such as Seaking, Chinchou, and Corsola, OHKOing the latter after a Calm Mind boost. Substitute is a great option to punish switching around Clamperl, but Protect can also be used to scout Choice-locked revenge killers. The first EV spread is seen on offensively inclined teams to help Clamperl survive and trade with Pokemon such as Aipom with enough Speed investment to outspeed defensive Gloom. Modest is the preferred nature on this spread, as Timid does not reach any notable speed benchmarks. The alternate EV spread can be used more commonly on balance teams with a Timid nature to improve matchup against Pokemon such as Adamant Cubone and opposing Clamperl.</p> <p>Clamperl fits both on offensive and defensive teams as a wallbreaker. It is especially good at enabling Anorith and Beedrill, with its main targets of entry being Koffing and Corsola, which both teammates can struggle versus. Pokemon like Quilava and Ponyta also appreciate Clamperl trading with Water-types and checking Pokemon such as opposing Ponyta. Clamperl appreciates Pokemon that are able to pivot it in. Ariados and Aipom with Baton Pass can allow it to come in on Koffing or Corsola a lot easier to threaten the opposing team. Wailmer and Voltorb can be good partners, as they can use Explosion on Water- or Grass-types such as Seaking or Gloom while additionally giving Clamperl entry to continue wallbreaking. Notable defensive partners for Clamperl include Flaaffy, Gloom, and Sunflora, with all resisting Electric-type moves that threaten Clamperl while additionally providing offensive pressure against Water-type Pokemon.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 595639, "username": "plznostep"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 535530, "username": "Gangsta Spongebob"}, {"user_id": 272450, "username": "BP"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Bagon": {
    "outdated": true,
    "comments": "<h4>Other Options</h4> <p>Bagon has a few other options due to its move pool, but unfortunately, it can't make proper use of them because of its stats or ability. Using Dragon Claw may seem like a good option; however, with base 40 Special Attack, running a Dragon-type STAB move is pointless. Facade may also seem like a worthwhile option, but Bagon lacks Guts, so poison is the only acceptable status.</p> <h4>Checks and Counters</h4> <p><strong>Koffing</strong>: Bagon is unable to 2HKO Koffing with Double-Edge at +1. This allows Koffing to reliably switch into Bagon and 2HKO in return with Sludge Bomb.</p> <p><strong>Shuppet</strong>: Shuppet can easily withstand a Hydro Pump and cripple Bagon with its status options or 2HKO with Shadow Ball. Shuppet must be wary of Hidden Power Ghost, as it OHKOes even without an Attack boost.</p> <p><strong>Dustox</strong>: Dustox can withstand one Double-Edge at +1 from Bagon and can use Whirlwind to phase it out.</p> <p><strong>Faster Attackers</strong>: Bagon is quite frail and is easily threatened by faster attackers that have moves it doesn't resist such as Aipom, Chinchou, and Delibird. These Pokemon make setup opportunities hard to find.</p>",
    "sets": {
      "Dragon Dance": {
        "description": "<p>After just one Dragon Dance, Bagon outspeeds the entirety of the unboosted metagame bar Voltorb. This, coupled with its already respectable base Attack and its rare typing, cements Bagon as an extremely effective mid-game wallbreaker and sweeper. Double-Edge is Bagon's strongest physical option, allowing it to threaten common special attackers like Elekid, Staryu, and Chinchou after a Dragon Dance. Additionally, Double-Edge hits a majority of the metagame for neutral damage. Bagon is also able to negate the recoil damage from Double-Edge thanks to Rock Head. Brick Break primarily targets Normal- and Steel-types like Aipom, Delcatty, and Magnemite, but it also 2HKOes physically defensive Lileep at +2. Hydro Pump threatens Rock- and Ground-types like Rhyhorn and Cubone. Alternatively, Bagon can use Hidden Power Ghost to avoid being walled by the tier's only Ghost-type, Shuppet. A Lum Berry provides Bagon with a free setup opportunity against status users. The most notable instance of this is against Elekid that may try to use Toxic or Thunder Wave to reduce Bagon's chances of sweeping.</p> <p>Bagon excels on offense and balance teams that aim to take advantage of Elekid that lack Ice Punch. It can withstand one Thunderbolt when healthy and can outspeed and OHKO it after one Dragon Dance boost. Wallbreakers like Pidgeotto and Aipom appreciate this immensely, as Elekid outspeeds them and threatens them with Thunderbolt. Secondary sweepers such as Masquerain, Croconaw, Growlithe, and Butterfree all benefit from Elekid's removal as well. These sweepers can also act as mid-game breakers if Bagon is more poised for a successful late-game. Butterfree is worth mentioning, as its access to Sleep Powder creates more opportunities for Bagon to set up. Bagon can be completely walled by Koffing, so special attackers that threaten it such as Chinchou, Croconaw, and Elekid pair well with Bagon. Elekid is worth mentioning, as it can offensively check Aipom so Bagon doesn't need to rely on a Speed boost from Dragon Dance.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 272450, "username": "BP"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 479897, "username": "BeatsBlack"}, {"user_id": 535530, "username": "Gangsta Spongebob"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  }
}