{
  "Snubbull": {
    "sets": {
      "Offensive": {},
      "Choice Band": {},
      "Bulk Up": {},
      "Utility": {
        "outdated": true,
        "description": "<p>Shadow Ball hits the Ghost-types that Snubbull’s other moves cannot, OHKOing Gastly and dealing serious damage to Duskull. Thunder Wave offers extremely powerful speed control and team support to slower teams, but it can be eschewed in favor of Earthquake, which allows it to hit Rock- and Electric-types like Larvitar, Chinchou, and Voltorb. Perhaps just as importantly, Earthquake lets it deal chip damage to Porygon and Wailmer that doesn’t knock them into range of eating their Sitrus Berry. Shadow Ball can do the same to just Wailmer, only less consistently. Thief lets Snubbull stay healthy with some consistency and punish anything trying to switch into it by making them much more easily KOed through depriving them of their Sitrus Berry healing, and in Porygon’s case, Thief removes its ability to repeatedly heal using Recycle. 116 HP EVs and 36 Defense EVs are enough to comfortably switch into plenty of physically attacking threats like Diglett, Larvitar, Anorith, and, most importantly, Doduo. Specifically, it lets Snubbull live all but one roll of +1 Larvitar and Diglett’s Earthquake and -1 Choice Band Doduo’s Double-Edge. 196 Attack EVs on top of its high base 80 Attack allow it to directly threaten most of the tier with its STAB Return and do major damage to Rock-, Steel-, and Ghost-types with its coverage options. 36 Speed EVs mostly just cannot be reallocated anywhere more useful, but they do allow it to outspeed common Porygon sets as well as Duskull.</p> <p>Snubbull has two main strengths that lead to easy synergies: its ability to beat major offensive threats like Doduo and Abra, and its ability to spam Thunder Wave. With a reliable Doduo counter in Snubbull on the team, Porygon, for instance, can afford to run Special Defense EVs to improve the team’s matchup against special attackers such as Abra, Staryu, and even Horsea. Stacking multiple Doduo counters on a team like Snubbull and Duskull is another option that can create a situation where the opponent’s Doduo becomes merely a momentum sink for them, giving teammates that are checked by Doduo, like offensive Wailmer, chances to fire off attacks uninhibited. Slower offensive threats like Cubone and Trapinch, as well as really any Pokemon that makes use of Substitute, can also benefit greatly from Snubbull’s presence as a Thunder Wave spammer Paralyzing a Pokemon with extremely high Speed, like Elekid or Abra, can even flip crucial matchups for fast, but not quite fast enough teammates like Doduo, Houndour, Anorith, and the aforementioned offensive Wailmer.</p>"
      }
    }
  },
  "Duskull": {"sets": {"Defensive": {}}},
  "Koffing": {"sets": {"Defensive": {}}},
  "Trapinch": {"sets": {"Trapper": {}}},
  "Diglett": {"sets": {"Specially Defensive Trapper": {}, "Offensive Trapper": {}}},
  "Meowth": {"sets": {"Lead": {}}},
  "Mankey": {"sets": {"Substitute + Reversal": {}}},
  "Abra": {"sets": {"Offensive Calm Mind": {}, "Bulky Calm Mind": {}}},
  "Machop": {"sets": {"Offensive": {}}},
  "Bellsprout": {"sets": {"Sunny Day Sweeper": {}}},
  "Ponyta": {"sets": {"Sunny Day": {}}},
  "Magnemite": {"sets": {"Offensive Utility": {}}},
  "Doduo": {"sets": {"Choice Band": {}}},
  "Gastly": {"sets": {"Mixed Offensive": {}}},
  "Onix": {"sets": {"All-Out Attacker": {}}},
  "Voltorb": {"sets": {"Offensive Pivot": {}}},
  "Exeggcute": {"sets": {"Sunny Day Sweeper": {}}},
  "Cubone": {"sets": {"Offensive": {}}},
  "Horsea": {"sets": {"Rain Sweeper": {}}},
  "Staryu": {"sets": {"Offensive Utility": {}}},
  "Chinchou": {"sets": {"Offensive": {}, "SubToxic": {}}},
  "Pineco": {"sets": {"Spikes": {}}},
  "Houndour": {"sets": {"Special Attacker": {}}},
  "Elekid": {"sets": {"Substitute + 3 Attacks": {}, "SubPunch": {}}},
  "Larvitar": {"sets": {"Dragon Dance": {}}},
  "Carvanha": {"sets": {"Offensive": {}}},
  "Wailmer": {"sets": {"Mixed Bulky Attacker": {}, "Specially Offensive": {}}},
  "Cacnea": {"sets": {"Offensive Spikes": {}, "Utility Spikes": {}}},
  "Baltoy": {"sets": {"All-Out Attacker": {}}},
  "Lileep": {"sets": {"Defensive": {}}},
  "Anorith": {"sets": {"Swords Dance": {}}},
  "Snorunt": {"sets": {"Spikes": {}}},
  "Bagon": {"sets": {"Dragon Dance": {}}}
}