{
  "Zapdos": {
    "sets": [
      {
        "name": "Offensive",
        "description": "<ul> <li>Zapdos's powerful Thunderbolt makes it one of the most fearsome special attackers in ADV Doubles. Additionally, it boasts one of the best Metagross matchups in the tier, as it is immune to Earthquake and takes little damage from Meteor Mash, often forcing Metagross to predictably use Explosion.</li> <li>Hidden Power Grass 2HKOes Ground-types like Swampert and Marowak. Hidden Power Ice is Zapdos's best option for hitting Latias.</li> <li>Thunder Wave can be used to attempt to slow down faster Pokemon it otherwise doesn't enjoy facing like Gengar and Latias, but Zapdos is always at risk of encountering an opposing Lum Berry. Drill Peck OHKOes Heracross, 2HKOes Sceptile, and hits Latias for slightly more damage than Thunderbolt. Substitute can be used to scout for Explosion from Metagross and Steelix, which struggle to threaten Zapdos with their other moves.</li> <li>A Timid Nature allows Zapdos to outspeed max Speed Arcanine and bulky Gengar. Lum Berry is used to keep it temporarily safe from any potential Thunder Waves. Magnet can be used as an option to add more firepower to Zapdos's Thunderbolts, but it doesn't change any 2HKOs into OHKOs.</li> <li>Tyranitar and Steelix make excellent partners for Zapdos, as Zapdos's immunity to their Earthquakes and ability to pressure Water-types is greatly appreciated. Conversely, Zapdos appreciates their positive matchup into Raikou and opposing Tyranitar. Zapdos struggles to threaten faster special attackers like Starmie, Latias, and Gengar, which Snorlax can do with ease. Metagross and Swampert also make great teammates as they deal with Tyranitar with Meteor Mash and Earthquake, respectively.</li> </ul> "
      }
    ],
    "credits": {"writtenBy": [{"username": "zee", "user_id": 501951}], "teams": [{"name": "Quality checked by", "members": [{"username": "bunnyy", "user_id": 192134}, {"username": "Smudge", "user_id": 550367}]}, {"name": "Grammar checked by", "members": [{"username": "ken", "user_id": 594478}]}]}
  },
  "Sceptile": {
    "sets": [
      {
        "name": "Fast Attacker",
        "description": "<ul> <li>Sceptile is faster than all other viable Pokemon in the tier, notably outspeeding maximum Speed Tyranitar after a Dragon Dance and many prevalent base 110s. With its notable coverage options, Sceptile is one of the tier's best revenge killers.</li> <li>Leaf Blade 2HKOes Tyranitar, making Sceptile one of its best offensive checks. Leaf Blade also does significant damage to common Water-types such as Starmie and Suicune, and it notably OHKOes Swampert, which no non-Grass-type does without Explosion.</li> <li>Sceptile 2HKOes Gengar with Crunch while surviving an Ice Punch in return. It also 3HKOes Latias and damages other Grass-resistant Pokemon such as Arcanine.</li> <li>Lum Berry keeps Sceptile safe from Thunder Wave once. Substitute allows Sceptile to block further attempts to paralyze it, which would severely impact Sceptile's ability to pick off slower threats, or absorb Explosions without using Protect, letting Sceptile reliably use Protect the next turn if need be. Furthermore, Substitute can be used to activate Overgrow and consume Petaya Berry, after which Sceptile can OHKO Tyranitar with Leaf Blade and uninvested Gengar with Crunch.</li> <li>Sceptile can also run another coverage option for common checks, such as Hidden Power Ice for Zapdos or Hidden Power Fire for Metagross.</li> <li>Sceptile is frail and performs better in later stages of the game, when its teammates have dealt with Pokemon that Sceptile's coverage misses out on, such as Snorlax and Heracross. Sceptile pairs up well with Explosion users like Metagross and Gengar, which can make up for Sceptile's lacking firepower unless it's landing super effective moves or picking off low-HP foes.</li> </ul> "
      }
    ],
    "credits": {"writtenBy": [{"username": "bunnyy", "user_id": 192134}], "teams": [{"name": "Quality checked by", "members": [{"username": "zee", "user_id": 501951}, {"username": "Smudge", "user_id": 550367}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Swampert": {
    "sets": [
      {
        "name": "Mixed Attacker",
        "description": "<ul> <li>Swampert's excellent typing and natural bulk allow it to stand out as one of the best Water-types in ADV Doubles. Its Ground typing also renders it immune to the barrage of Thunder Waves thrown around in the tier. Additionally, it is virtually impossible to remove in one hit without a STAB Grass-type attack or Explosion, meaning it is efficient at trading positively with its high-power attacks and offensive coverage.</li> <li>Earthquake deals powerful spread damage if both foes are grounded and cleanly 2HKOes Metagross, Tyranitar, and Starmie. Ice Beam hits common Ground resistant Pokemon like Zapdos, Latias, and Sceptile.</li> <li>Hydro Pump is Swampert's strongest attack against Pokemon like Gengar, Steelix, and Arcanine, but Waterfall can be used to avoid risking misses at the cost of failing to achieve OHKOs on the latter two Pokemon.</li> <li>The given EV spread gives Swampert enough Attack investment to OHKO Raikou with Earthquake. The HP and Special Defense investment ensure Swampert always survives a Hidden Power Grass from Modest Zapdos, and the remainder is dumped into Special Attack. If using Mystic Water, Swampert can run an EV spread of 216 HP / 84 Atk / 208 SpA to guarantee it OHKOes Tyranitar with Hydro Pump. Quiet nature is used to not inhibit either attacking stat or its bulk, as the Speed tier below Swampert is relatively uncongested.</li> <li>Swampert's immunity to sand damage allows it to capitalize on the passive recovery provided by Leftovers.</li> <li>Swampert is one of the best answers to Tyranitar in the tier, making it a great partner for Pokemon like Raikou, Zapdos, and Latias, the latter two also providing an immunity to Earthquake for Swampert. Metagross and Arcanine pressure Grass-types like Sceptile and Exeggutor, keeping Swampert safe from being OHKOed. Physical attackers like Tauros and Tyranitar greatly appreciate Swampert's ability to eliminate physical walls like Steelix and Regirock with Hydro Pump.</li> </ul> "
      }
    ],
    "credits": {"writtenBy": [{"username": "zee", "user_id": 501951}], "teams": [{"name": "Quality checked by", "members": [{"username": "bunnyy", "user_id": 192134}, {"username": "Smudge", "user_id": 550367}]}, {"name": "Grammar checked by", "members": [{"username": "ken", "user_id": 594478}]}]}
  },
  "Gengar": {
    "sets": [
      {
        "name": "Fast Attacker",
        "description": "<ul> <li>Gengar's high Speed and excellent offensive coverage make it a proficient revenge killer, while its Explosion and Destiny Bond command respect at all stages of the game. Its immunities to Earthquake and Explosion make it a safe switch-in to all of the metagame's strongest spread moves.</li> <li>Ice Punch hits Latias and Zapdos super effectively while hitting most of the rest of the metagame for decent chip damage. Fire Punch is useful for hitting the omnipresent Metagross. This can be used in tandem with a partner's attack like Thunderbolt from Zapdos and Raikou or Hydro Pump from Starmie to remove Metagross before it gets a chance to move.</li> <li>Explosion is a very high risk but high reward option, as even with Gengar's low attack stat, it does well over 75% to most neutral targets. Thunderbolt gives Gengar a stronger neutral attack and a way to hit Water-types without using Explosion.</li> <li>Destiny Bond is excellent for punishing attacks that Gengar often draws in due to the threat of Explosion and its weak defenses.</li> <li>Gengar can run a variety of other moves in niche scenarios including Giga Drain or Hidden Power Grass for Tyranitar and Swampert, Psychic for opposing Gengar, Skill Swap to give partners Levitate, Rain Dance or Sunny Day for weather setups, or Will-O-Wisp to burn physical attackers without a Lum Berry. However, these moves either have limited uses or only work on specific team setups.</li> <li>As a lead, it's recommended to pair Gengar with teammates like Metagross and Swampert that deter Tyranitar from freely using Dragon Dance. Gengar also becomes dangerous in the back, as it can find weakened Pokemon to pick off with its coverage options.</li> <li>Lum Berry will give Gengar a one-time buffer from the common Thunder Wave, making it the most commonly useful item. Salac Berry does get activated often as most strong neutral hits come just shy of KOing Gengar, and the subsequent Speed boost lets it outrun and use Explosion before faster Pokemon—like Starmie, Sceptile, and Raikou—can attack.</li> <li>A very situational item, Silk Scarf boosts the raw power of Gengar's Explosion and can be used with a Hasty Nature and 68 Attack EVs to OHKO 4 HP Latias. Similarly, Charcoal helps with KOing Metagross with Fire Punch in conjunction with something like Latias's Hidden Power Fire or Raikou's Thunderbolt; however, both of these items have very specific niches, which makes them hard to generally recommend.</li> </ul> "
      }
    ],
    "credits": {"writtenBy": [{"username": "zee", "user_id": 501951}], "teams": [{"name": "Quality checked by", "members": [{"username": "bunnyy", "user_id": 192134}, {"username": "Smudge", "user_id": 550367}]}, {"name": "Grammar checked by", "members": [{"username": "ken", "user_id": 594478}]}]}
  },
  "Tauros": {
    "sets": [
      {
        "name": "Choice Band",
        "description": "<ul> <li>Tauros's base 110 Speed and powerful Normal-type attacks backed by Choice Band ensure it hits hard and fast. Additionally, it's one of the few viable Intimidate options in ADV Doubles.</li> <li>Double-Edge is Tauros's best attack and what it wants to use the majority of the time, 2HKOing every Pokemon that isn't immune or resistant to Normal. Frailer Pokemon like Starmie and Sceptile faint to it outright.</li> <li>Earthquake 2HKOes Tyranitar and Metagross while Hidden Power Ghost OHKOes Gengar.</li> <li>Tauros's shallow movepool means its best option for its last attacking slot is a second Normal-type move in addition to Double-Edge. Return scores the same 2HKOs against foes like Latias and Zapdos without incurring recoil damage but fails to OHKO Starmie and misses out on the roll to OHKO Raikou. Hyper Beam can be used for burst damage on a turn where Tauros is likely to be taken out after it moves, and Facade can provide surprisingly strong damage if Tauros finds itself hit by Thunder Wave or Will-O-Wisp.</li> <li>Tauros wants to use Intimidate on physical attackers like Tyranitar or Snorlax and eliminate a specific foe or punch holes in opposing teams so revenge killers like Sceptile, Gengar, and Raikou can clean up. Snorlax makes a great partner for absorbing the special attacks commonly aimed at Tauros, and Snorlax appreciates having Intimidate support to patch up its Defense. Raikou also actively threatens a lot of Tauros's problematic matchups like Starmie and Gengar. Lastly, Starmie threatens the majority of the tier's Normal resists as it can OHKO Steelix, bulkless Tyranitar, and Gengar while also 2HKOing most Metagross.</li> </ul> "
      }
    ],
    "credits": {"writtenBy": [{"username": "zee", "user_id": 501951}], "teams": [{"name": "Quality checked by", "members": [{"username": "bunnyy", "user_id": 192134}, {"username": "Smudge", "user_id": 550367}]}, {"name": "Grammar checked by", "members": [{"username": "ken", "user_id": 594478}]}]}
  },
  "Steelix": {
    "sets": [
      {
        "name": "Offensive",
        "description": "<ul> <li>Steelix's insanely high Defense makes it an excellent check to common physical attackers in ADV Doubles like Snorlax, Metagross, and Tyranitar, in spite of its Earthquake weakness. Its Ground and Steel typing also gives it a strong matchup into Zapdos and Raikou.</li> <li>Steelix's Earthquake cleanly OHKOes Raikou, though it fails to OHKO Metagross and Tyranitar. However, they only 3HKO Steelix with their respective Earthquakes, while Steelix 2HKOs the both of them.</li> <li>Steelix boasts one of the strongest Explosions in the tier behind Metagross and Snorlax, making it a terrifying threat if it can't be removed quickly.</li> <li>Hidden Power Ghost 2HKOes Gengar and 3HKOes Latias. Hidden Power Rock hits Gengar for significantly less damage but gives it an option to threaten Zapdos without using Explosion.</li> <li>The EV Spread gives Steelix enough Special Defense to be 3HKOed by Latias's Hidden Power Fire.</li> <li>Steelix's immunity to Thunder Wave and sand damage make it one of the few Pokemon in the tier that prefers using Leftovers to Lum Berry. The passive recovery can help it check physical attackers much better.</li> <li>Because Steelix hates facing Water-type attacks from Pokemon like Starmie and Swampert and Fire-type attacks from Arcanine and Gengar, pairing it with Latias, which can resist both types, is effectively required. Pokemon like Suicune and Zapdos also do a great job at pressuring these Pokemon with Hydro Pump from the former's Thunderbolt and Hidden Power Grass from the latter. Gengar makes an excellent teammate for Steelix as it is immune to its Explosion and Earthquake.</li> </ul> "
      }
    ],
    "credits": {"writtenBy": [{"username": "zee", "user_id": 501951}], "teams": [{"name": "Quality checked by", "members": [{"username": "bunnyy", "user_id": 192134}, {"username": "Smudge", "user_id": 550367}]}, {"name": "Grammar checked by", "members": [{"username": "ken", "user_id": 594478}]}]}
  },
  "Tyranitar": {
    "sets": [
      {
        "name": "Dragon Dance",
        "description": "<ul> <li>Dragon Dance Tyranitar is a fearsome win condition that every team in ADV Doubles must be prepared for. Earthquake and Hidden Power Rock provide perfect coverage, hitting every viable Pokemon in the tier for at least neutral damage. If given the room to set up, it can easily run away with games quickly. Preventing this is easier said than done, as its natural bulk means it's only really threatened by super effective attacks.</li> <li>Hidden Power Rock OHKOes Zapdos and uninvested Gengar after a Dragon Dance. Rock Slide is not recommended, as spread moves that only target the opponents see their damage halved in this generation.</li> <li>Earthquake serves as powerful spread damage and threatens Rock resistances like Metagross, Steelix, and Swampert.</li> <li>A Jolly nature is required to outspeed Adamant Metagross, as well as Starmie and Raikou after a Dragon Dance. Do note that Tyranitar falls slightly short of outspeeding Sceptile after a single Speed boost.</li> <li>The best time to use Dragon Dance is after checks like Metagross and bulky Water-types have been weakened or removed. Tyranitar easily sets up on the likes of Zapdos, Latias, Gengar, and Arcanine, as they provide little threat against it.</li> <li>Tyranitar can also make use of a Choice Band set, threatening the same immediate power that it would after a Dragon Dance boost, though it loses out on the ability to truly sweep through games as such a slow attacker.</li> <li>Bulky Water-types like Suicune and Swampert are some of Tyranitar's biggest obstacles even after a Dragon Dance, so pairing it with the likes of Sceptile and Zapdos to help break these Pokemon is recommended. Tyranitar's durability is greatly improved behind dual screens support from Latias. Arcanine can OHKO Metagross and Sceptile with Overheat, and its Intimidate helps with weakening opposing Earthquakes.</li> </ul> "
      }
    ],
    "credits": {"writtenBy": [{"username": "zee", "user_id": 501951}], "teams": [{"name": "Quality checked by", "members": [{"username": "bunnyy", "user_id": 192134}, {"username": "qsns", "user_id": 230771}]}, {"name": "Grammar checked by", "members": [{"username": "ken", "user_id": 594478}]}]}
  }
}