{
  "Zapdos": {
    "sets": {
      "Offensive": {
        "description": "<ul> <li>Zapdos's powerful Thunderbolt makes it one of the most fearsome special attackers in ADV Doubles. Additionally, it boasts one of the best Metagross matchups in the tier, as it is immune to Earthquake and takes little damage from Meteor Mash, often forcing Metagross to predictably use Explosion.</li> <li>Hidden Power Grass 2HKOes Ground-types like Swampert and Marowak. Hidden Power Ice is Zapdos's best option for hitting Latias.</li> <li>Thunder Wave can be used to attempt to slow down faster Pokemon it otherwise doesn't enjoy facing like Gengar and Latias, but Zapdos is always at risk of encountering an opposing Lum Berry. Drill Peck OHKOes Heracross, 2HKOes Sceptile, and hits Latias for slightly more damage than Thunderbolt. Substitute can be used to scout for Explosion from Metagross and Steelix, which struggle to threaten Zapdos with their other moves.</li> <li>A Timid Nature allows Zapdos to outspeed max Speed Arcanine and bulky Gengar. Lum Berry is used to keep it temporarily safe from any potential Thunder Waves. Magnet can be used as an option to add more firepower to Zapdos's Thunderbolts, but it doesn't change any 2HKOs into OHKOs.</li> <li>Tyranitar and Steelix make excellent partners for Zapdos, as Zapdos's immunity to their Earthquakes and ability to pressure Water-types is greatly appreciated. Conversely, Zapdos appreciates their positive matchup into Raikou and opposing Tyranitar. Zapdos struggles to threaten faster special attackers like Starmie, Latias, and Gengar, which Snorlax can do with ease. Metagross and Swampert also make great teammates as they deal with Tyranitar with Meteor Mash and Earthquake, respectively.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "zee", "user_id": 501951}], "teams": [{"name": "Quality checked by", "members": [{"username": "ryo yamada2001", "user_id": 192134}, {"username": "Smudge", "user_id": 550367}]}, {"name": "Grammar checked by", "members": [{"username": "ken", "user_id": 594478}]}]}
  },
  "Sceptile": {
    "sets": {
      "Fast Attacker": {
        "description": "<ul> <li>Sceptile is faster than all other viable Pokemon in the tier, notably outspeeding maximum Speed Tyranitar after a Dragon Dance and many prevalent base 110s. With its notable coverage options, Sceptile is one of the tier's best revenge killers.</li> <li>Leaf Blade 2HKOes Tyranitar, making Sceptile one of its best offensive checks. Leaf Blade also does significant damage to common Water-types such as Starmie and Suicune, and it notably OHKOes Swampert, which no non-Grass-type does without Explosion.</li> <li>Sceptile 2HKOes Gengar with Crunch while surviving an Ice Punch in return. It also 3HKOes Latias and damages other Grass-resistant Pokemon such as Arcanine.</li> <li>Lum Berry keeps Sceptile safe from Thunder Wave once. Substitute allows Sceptile to block further attempts to paralyze it, which would severely impact Sceptile's ability to pick off slower threats, or absorb Explosions without using Protect, letting Sceptile reliably use Protect the next turn if need be. Furthermore, Substitute can be used to activate Overgrow and consume Petaya Berry, after which Sceptile can OHKO Tyranitar with Leaf Blade and uninvested Gengar with Crunch.</li> <li>Sceptile can also run another coverage option for common checks, such as Hidden Power Ice for Zapdos or Hidden Power Fire for Metagross.</li> <li>Sceptile is frail and performs better in later stages of the game, when its teammates have dealt with Pokemon that Sceptile's coverage misses out on, such as Snorlax and Heracross. Sceptile pairs up well with Explosion users like Metagross and Gengar, which can make up for Sceptile's lacking firepower unless it's landing super effective moves or picking off low-HP foes.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "ryo yamada2001", "user_id": 192134}], "teams": [{"name": "Quality checked by", "members": [{"username": "zee", "user_id": 501951}, {"username": "Smudge", "user_id": 550367}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Swampert": {
    "sets": {
      "Mixed Attacker": {
        "description": "<ul> <li>Swampert's excellent typing and natural bulk allow it to stand out as one of the best Water-types in ADV Doubles. Its Ground typing also renders it immune to the barrage of Thunder Waves thrown around in the tier. Additionally, it is virtually impossible to remove in one hit without a STAB Grass-type attack or Explosion, meaning it is efficient at trading positively with its high-power attacks and offensive coverage.</li> <li>Earthquake deals powerful spread damage if both foes are grounded and cleanly 2HKOes Metagross, Tyranitar, and Starmie. Ice Beam hits common Ground resistant Pokemon like Zapdos, Latias, and Sceptile.</li> <li>Hydro Pump is Swampert's strongest attack against Pokemon like Gengar, Steelix, and Arcanine, but Waterfall can be used to avoid risking misses at the cost of failing to achieve OHKOs on the latter two Pokemon.</li> <li>The given EV spread gives Swampert enough Attack investment to OHKO Raikou with Earthquake. The HP and Special Defense investment ensure Swampert always survives a Hidden Power Grass from Modest Zapdos, and the remainder is dumped into Special Attack. If using Mystic Water, Swampert can run an EV spread of 216 HP / 84 Atk / 208 SpA to guarantee it OHKOes Tyranitar with Hydro Pump. Quiet nature is used to not inhibit either attacking stat or its bulk, as the Speed tier below Swampert is relatively uncongested.</li> <li>Swampert's immunity to sand damage allows it to capitalize on the passive recovery provided by Leftovers.</li> <li>Swampert is one of the best answers to Tyranitar in the tier, making it a great partner for Pokemon like Raikou, Zapdos, and Latias, the latter two also providing an immunity to Earthquake for Swampert. Metagross and Arcanine pressure Grass-types like Sceptile and Exeggutor, keeping Swampert safe from being OHKOed. Physical attackers like Tauros and Tyranitar greatly appreciate Swampert's ability to eliminate physical walls like Steelix and Regirock with Hydro Pump.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "zee", "user_id": 501951}], "teams": [{"name": "Quality checked by", "members": [{"username": "ryo yamada2001", "user_id": 192134}, {"username": "Smudge", "user_id": 550367}]}, {"name": "Grammar checked by", "members": [{"username": "ken", "user_id": 594478}]}]}
  },
  "Regice": {
    "sets": {
      "BoltBeam": {
        "description": "<ul> <li> <p>Regice's monstrous Special Defense allows it to wall the metagame's plethora of special attackers. Its BoltBeam coverage gives it a decent offensive presence, though its middling Special Attack makes it incapable of 2HKOing most Pokemon not weak to its attacks. Its weaknesses to Metagross and Tyranitar are also a big blow compared to other special walls like Snorlax, which fears them much less.</p> </li> <li> <p>Ice Beam 2HKOes Latias, Zapdos, and Gengar while 3HKOing other common Pokemon like Swampert and Raikou. Thunderbolt 2HKOes Starmie and 3HKOes Suicune but laughably fails to 3HKO Metagross.</p> </li> <li> <p>Regice makes good use of Thunder Wave, as it can be very difficult to remove before getting the opportunity to spread paralysis to multiple foes. Counter can be used to punish the physical attacks that Regice lures in with its lower Defense.</p> </li> <li> <p>Leftovers gives Regice passive recovery, which increases its durability and improves its matchup into the array of special attackers in the metagame. Since Regice's bulk leads to it staying around longer, it can make extra good use of the additional health.</p> </li> <li> <p>Regice is one of the slowest Pokemon in the metagame, so pairing it with fast attackers like Raikou, Latias, and Starmie to make up for its lack of Speed is recommended. Latias also greatly appreciates having another Pokemon to threaten opposing Latias so that it doesn't have to risk mirror matches. Arcanine, Swampert, and Zapdos are all viable partners with strong matchups into Metagross, which is Regice's worst matchup. Explosion users like Gengar and Metagross can swiftly remove multiple Pokemon at once, making up for Regice's lack of firepower, with the latter also boasting a strong matchup against Tyranitar. Suicune and Starmie greatly appreciate Regice's ability to wall and eliminate Raikou and Zapdos so they don't have to worry about their powerful Thunderbolt. Swampert and Sceptile check Tyranitar, which is greatly appreciated, as Tyranitar can use Dragon Dance on Regice freely.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "zee", "user_id": 501951}], "teams": [{"name": "Quality checked by", "members": [{"username": "ryo yamada2001", "user_id": 192134}, {"username": "Grandmas Cookin", "user_id": 428483}]}, {"name": "Grammar checked by", "members": [{"username": "ken", "user_id": 594478}]}]}
  },
  "Registeel": {
    "sets": {
      "Utility": {
        "description": "<ul> <li> <p>Registeel is one of the bulkiest Pokemon in the tier, which affords it the opportunity to spam Thunder Wave in attempt to make up for its lackluster offensive pressure.</p> </li> <li> <p>Weak Fire-type attacks like Latias's Hidden Power Fire and Gengar's Fire Punch fail to 4HKO, meaning that Earthquake is the best way to hit it for super effective damage. It lures in Earthquake from Metagross, Tyranitar, and Snorlax and punishes them by OHKOing with Counter in return. However, this can be predicted, and whiffing a Counter leaves Registeel a sitting duck, so timing it well is vital.</p> </li> <li> <p>Seismic Toss allows Registeel to deal chip damage, which is helpful when paired with revenge killers like Raikou and Tauros. Explosion is a decent source of offensive pressure, as it OHKOes Zapdos even without offensive investment. However, Registeel is reliant on Explosion to pose any sort of immediate offensive threat, which is not an admirable trait in this fast-paced metagame.</p> </li> <li> <p>The given EV spread makes Gengar's Fire Punch a 5HKO on Registeel after Leftovers recovery.</p> </li> <li> <p>Registeel annoys common leads such as Latias, Metagross, and Gengar, though it far from hard counters them. It should be paired with a lead like Zapdos, Swampert, or Latias that makes up for its lack of offensive pressure. Slower Choice Band users like Heracross and Snorlax appreciate Thunder Wave support in order to facilitate sweeps or score safe hits on faster Pokemon.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "zee", "user_id": 501951}], "teams": [{"name": "Quality checked by", "members": [{"username": "ryo yamada2001", "user_id": 192134}, {"username": "Smudge", "user_id": 550367}]}, {"name": "Grammar checked by", "members": [{"username": "ken", "user_id": 594478}]}]}
  },
  "Gengar": {
    "sets": {
      "Fast Attacker": {
        "description": "<ul> <li>Gengar's high Speed and excellent offensive coverage make it a proficient revenge killer, while its Explosion and Destiny Bond command respect at all stages of the game. Its immunities to Earthquake and Explosion make it a safe switch-in to all of the metagame's strongest spread moves.</li> <li>Ice Punch hits Latias and Zapdos super effectively while hitting most of the rest of the metagame for decent chip damage. Fire Punch is useful for hitting the omnipresent Metagross. This can be used in tandem with a partner's attack like Thunderbolt from Zapdos and Raikou or Hydro Pump from Starmie to remove Metagross before it gets a chance to move.</li> <li>Explosion is a very high risk but high reward option, as even with Gengar's low attack stat, it does well over 75% to most neutral targets. Thunderbolt gives Gengar a stronger neutral attack and a way to hit Water-types without using Explosion.</li> <li>Destiny Bond is excellent for punishing attacks that Gengar often draws in due to the threat of Explosion and its weak defenses.</li> <li>Gengar can run a variety of other moves in niche scenarios including Giga Drain or Hidden Power Grass for Tyranitar and Swampert, Psychic for opposing Gengar, Skill Swap to give partners Levitate, Rain Dance or Sunny Day for weather setups, or Will-O-Wisp to burn physical attackers without a Lum Berry. However, these moves either have limited uses or only work on specific team setups.</li> <li>As a lead, it's recommended to pair Gengar with teammates like Metagross and Swampert that deter Tyranitar from freely using Dragon Dance. Gengar also becomes dangerous in the back, as it can find weakened Pokemon to pick off with its coverage options.</li> <li>Lum Berry will give Gengar a one-time buffer from the common Thunder Wave, making it the most commonly useful item. Salac Berry does get activated often as most strong neutral hits come just shy of KOing Gengar, and the subsequent Speed boost lets it outrun and use Explosion before faster Pokemon—like Starmie, Sceptile, and Raikou—can attack.</li> <li>A very situational item, Silk Scarf boosts the raw power of Gengar's Explosion and can be used with a Hasty Nature and 68 Attack EVs to OHKO 4 HP Latias. Similarly, Charcoal helps with KOing Metagross with Fire Punch in conjunction with something like Latias's Hidden Power Fire or Raikou's Thunderbolt; however, both of these items have very specific niches, which makes them hard to generally recommend.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "zee", "user_id": 501951}], "teams": [{"name": "Quality checked by", "members": [{"username": "ryo yamada2001", "user_id": 192134}, {"username": "Smudge", "user_id": 550367}]}, {"name": "Grammar checked by", "members": [{"username": "ken", "user_id": 594478}]}]}
  },
  "Exeggutor": {
    "sets": {
      "Sun Attacker": {
        "description": "<ul> <li>Exeggutor is the strongest Grass-type special attacker in ADV Doubles, which gives it the niche of being able to OHKO Swampert. However, without Sunny Day support, it is slower than other Psychic-types like Latias and Starmie as well as Explosion users like Gengar and Metagross.</li> <li>Psychic is Exeggutor's best option for consistent damage, OHKOing Gengar and 2HKOing neutral targets like Zapdos, Raikou, and Tauros.</li> <li>Giga Drain OHKOes Swampert and provides HP recovery, but Hidden Power Grass allows Exeggutor to OHKO Starmie, and Solar Beam OHKOes Tyranitar and Suicune. Solar Beam is dependent on Sunny Day being active, which makes it the riskiest choice.</li> <li>Exeggutor's Explosion is deceptively powerful, strong enough to OHKO Latias and Zapdos. Hidden Power Fire can be used to hit Metagross for a 2HKO, as it resists all of Exeggutor's other attacks.</li> <li>Exeggutor can choose to set Sunny Day for itself in its last moveslot or use Sleep Powder to incapacitate foes before they move. However, risking accuracy and the odds of running into a Lum Berry makes it generally not worth it. Protect is also a viable option to scout for opposing Explosions or stall a turn to bring in a more supportive teammate.</li> <li>164 Speed EVs are necessary to outspeed Sceptile and Alakazam with a Chlorophyll boost. If Exeggutor does not have Sunny Day support, it can cut down to 48 Speed EVs to outrun Swampert.</li> <li>Fast Sunny Day users like Gengar and Latias are highly recommended to continually activate Chlorophyll should it run out or be interrupted by Tyranitar's Sand Stream. Raikou and Steelix appreciate Exeggutor's ability to decimate Swampert, and Exeggutor appreciates the former's ability to make up for its low Speed outside of Chlorophyll and the latter's good matchups against Metagross and Tyranitar.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "zee", "user_id": 501951}], "teams": [{"name": "Quality checked by", "members": [{"username": "ryo yamada2001", "user_id": 192134}, {"username": "Smudge", "user_id": 550367}]}, {"name": "Grammar checked by", "members": [{"username": "ken", "user_id": 594478}]}]}
  },
  "Raikou": {
    "sets": {
      "Offensive": {
        "description": "<ul> <li>Raikou's blistering Speed makes it one of the most fearsome revenge killers in ADV Doubles, as it is only outsped by Sceptile and the rare Aerodactyl, though it does tie with Starmie.</li> <li>Thunderbolt is strong enough to secure 2HKOs on a large portion of the tier's neutral targets, including Tauros and Zapdos.</li> <li>Crunch hits Latias, Gengar, and the rare Exeggutor. Crunch will OHKO Gengar after a Calm Mind boost.</li> <li>Hidden Power Grass is primarily for hitting Swampert, though it's also Raikou's strongest option to hit Steelix. A Calm Mind boost doesn't hit specific offensive benchmarks, but it does make it easier to pick up KOs against the likes of Metagross and Arcanine while bolstering its Special Defense to improve its matchups against attackers like Latias and Suicune. Thunder Wave can be used to slow down fast threats, though it will likely be burning through its foes' omnipresent Lum Berry first.</li> <li>Raikou runs Lum Berry so that its offensive pressure can be kept up even after being paralyzed once.</li> <li>Steelix is Raikou's absolute worst matchup, so pairing Raikou with a Water-type that can OHKO it with Hydro Pump—like Swampert, Starmie, or Suicune—is highly recommended. Its special attacks will bounce right off of Snorlax, which can threaten back with Earthquake, so be sure to have multiple strong physical attackers like Metagross, Tauros, and Heracross. Dual screens support from Latias can give it more room to set up Calm Mind. Raikou's Thunderbolt fails to 2HKO Tyranitar, which makes it easy Dragon Dance bait if not paired with bulky Earthquake users like Steelix and Swampert, which can threaten Tyranitar back.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "zee", "user_id": 501951}], "teams": [{"name": "Quality checked by", "members": [{"username": "ryo yamada2001", "user_id": 192134}, {"username": "Smudge", "user_id": 550367}]}, {"name": "Grammar checked by", "members": [{"username": "ken", "user_id": 594478}]}]}
  },
  "Suicune": {
    "sets": {
      "Calm Mind": {
        "description": "<ul> <li>Suicune's role as a bulky Water-type with Calm Mind makes it one of the tier's most potent simultaneous offensive and defensive threats. It can outspeed Metagross and Tyranitar, unlike Swampert, and is considerably bulkier than Starmie.</li> <li>Hydro Pump and Ice Beam give Suicune almost perfect coverage, only failing to hit Starmie and opposing Suicune for at least neutral damage.</li> <li>Calm Mind allows Suicune to act as a threatening win condition, OHKOing bulky Tyranitar with Hydro Pump after a Calm Mind boost and Metagross and Raikou after two. Ice Beam also 2HKOes Latias after a Calm Mind boost.</li> <li>152 Speed EVs allows Suicune to outspeed Jolly Tyranitar, though 228 Speed EVs will allow it to outspeed Jolly Metagross at the cost of reducing HP or Special Attack. Lum Berry helps Suicune maintain sweeps in the face of Thunder Wave or the rare Sleep Powder or Hypnosis, while Leftovers can help to maintain its longevity in exchange for being vulnerable to status.</li> <li>Once Suicune has used Calm Mind, the opponent will be forced to answer it with physical attacks, including Explosion, which Suicune can scout for and punish with a well-timed Protect.</li> <li>Marowak is a great partner for Suicune, as it draws away Thunderbolt from Zapdos and Raikou with Lightningrod, giving Suicune opportunities to use Calm Mind. Inversely, Zapdos and Raikou also make good partners for Suicune, as they pressure Starmie and opposing Suicune. Pokemon like Heracross, Metagross, and Tauros can help pressure special walls such as Snorlax and Latias, greatly assisting with Suicune's cleaning ability, while they also appreciate Suicune's ability to defeat Steelix and Arcanine. Fast revenge killers like Latias, Raikou, and Gengar work well to pick off low HP foes.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "zee", "user_id": 501951}], "teams": [{"name": "Quality checked by", "members": [{"username": "ryo yamada2001", "user_id": 192134}, {"username": "Grandmas Cookin", "user_id": 428483}]}, {"name": "Grammar checked by", "members": [{"username": "ken", "user_id": 594478}]}]}
  },
  "Arcanine": {
    "sets": {
      "Utility": {
        "description": "<ul> <li>Arcanine's Overheat is one of the few ways to OHKO Metagross in ADV Doubles, which makes it an excellent partner for lead Latias, which also appreciates Intimidate to help it withstand physical attacks better. Thanks to White Herb resetting Arcanine's Special Attack, it can hit the likes of Zapdos and Raikou for 2HKOs without having to switch out.</li> <li>Arcanine's other coverage moves aren't that strong, so it gets value out of using Helping Hand to attempt to turn its partners' 2HKOs into OHKOs.</li> <li>Crunch is Arcanine's strongest attack against Latias and can also 2HKO Gengar without resorting to Overheat. Hidden Power Grass allows Arcanine to 2HKO Swampert. Extreme Speed is really weak, but it is one of the only forms of priority seen in the tier and can be useful for picking off weakened foes.</li> <li>The given EV Spread allows Arcanine to outspeed Jolly Metagross while OHKOing up to 252 HP Metagross with Overheat. The HP and Defense investment allow it to survive Choice Band Tauros's Earthquake, and the remaining EVs are dumped into Special Defense.</li> <li>Arcanine is an excellent lead partner for Latias, as it OHKOes Metagross. Arcanine is reliant on Electric-types like Raikou and Zapdos or Grass-types like Sceptile to help threaten Water-types like Swampert, Starmie, and Suicune that threaten Arcanine with Hydro Pump. Swampert and Suicune appreciate Arcanine's ability to OHKO Sceptile, while Arcanine benefits from their good matchups into Tyranitar.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "zee", "user_id": 501951}], "teams": [{"name": "Quality checked by", "members": [{"username": "ryo yamada2001", "user_id": 192134}, {"username": "Grandmas Cookin", "user_id": 428483}]}, {"name": "Grammar checked by", "members": [{"username": "ken", "user_id": 594478}]}]}
  },
  "Marowak": {
    "sets": {
      "Lightning Rod": {
        "description": "<ul> <li>'s Thick Club-boosted Earthquake is one of the strongest attacks in the tier, 2HKOing every neutral target as well as Sceptile, and OHKOing Starmie.</li> <li>Hidden Power Rock covers Pokemon immune to Earthquake like Zapdos, Latias, and Gengar, though Marowak can use Ancient Power to make room for Hidden Power Ghost instead. Hidden Power Ghost OHKOes Gengar and 2HKOes Latias instead of the 2HKO and 3HKO it would score on them with Hidden Power Rock.</li> <li>Swords Dance boosts Marowak's Attack to an astronomical 1136, allowing its Earthquake to OHKO Sceptile and physically defensive Snorlax.</li> <li>124 Speed EVs allows Marowak to outrun Swampert without any Speed investment. The remaining EVs are spent on maximizing its Attack and dumped into HP to patch up its middling bulk.</li> <li>Gyarados and Suicune make natural partners for Marowak, as its Lightning Rod makes it easier for them to set up Dragon Dance and Calm Mind, respectively. Marowak does not enjoy facing special attackers like Latias, Gengar, and Starmie, so pairing it with a special wall like Snorlax that can stand up to these threats is very appreciated. Raikou and Zapdos work well with Marowak, as they can pressure Water-types, while Marowak threatens Steelix and Snorlax for them in return. Notably, Lightning Rod does not draw allies' Electric-type moves in ADV Doubles, making this a safe pairing.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "zee", "user_id": 501951}], "teams": [{"name": "Quality checked by", "members": [{"username": "ryo yamada2001", "user_id": 192134}, {"username": "Grandmas Cookin", "user_id": 428483}]}, {"name": "Grammar checked by", "members": [{"username": "ken", "user_id": 594478}]}]}
  },
  "Starmie": {
    "sets": {
      "Special Attacker": {
        "description": "<ul> <li> <p>Starmie's high Speed, solid Special Attack, and excellent coverage make it a potent revenge killer that is particularly good at hitting top tier threats like Tyranitar, Gengar, and Latias.</p> </li> <li> <p>Mystic Water is mandatory to ensure Hydro Pump OHKOes uninvested Tyranitar. It also OHKOes Arcanine and maximum HP and Special Defense Steelix with ease, and it 2HKOes Metagross and Tauros.</p> </li> <li> <p>Ice Beam is primarily used to wear down Latias. While it is a 3HKO, Starmie is unlikely to hit it three times before being eliminated, so it will usually put Latias in KO range of your own Latias instead. Ice Beam also 2HKOes Zapdos and Exeggutor, the latter of which walls Starmie's other coverage.</p> </li> <li> <p>Psychic decimates even a modestly HP invested Gengar.</p> </li> <li> <p>With Natural Cure, Starmie can soak up the omnipresent Thunder Wave for teammates that cannot afford to be slowed down such as Tauros and Raikou.</p> </li> <li> <p>Starmie pairs well with Electric-types such as Raikou and Zapdos, which are able to hit Water-types, such as Suicune and opposing Starmie, super effectively. Powerful physical attackers, such as Metagross, are able to punch through Snorlax and threaten Latias. Due to Starmie being rather frail and having weaknesses to many special attacks from the likes of Sceptile and Raikou, Snorlax's high special bulk makes it an excellent teammate. Steelix provides a much needed Electric immunity for Starmie, making it another complimentary teammate.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "Smudge", "user_id": 550367}], "teams": [{"name": "Quality checked by", "members": [{"username": "ryo yamada2001", "user_id": 192134}, {"username": "qsns", "user_id": 230771}]}, {"name": "Grammar checked by", "members": [{"username": "ken", "user_id": 594478}]}]}
  },
  "Tauros": {
    "sets": {
      "Choice Band": {
        "description": "<ul> <li>Tauros's base 110 Speed and powerful Normal-type attacks backed by Choice Band ensure it hits hard and fast. Additionally, it's one of the few viable Intimidate options in ADV Doubles.</li> <li>Double-Edge is Tauros's best attack and what it wants to use the majority of the time, 2HKOing every Pokemon that isn't immune or resistant to Normal. Frailer Pokemon like Starmie and Sceptile faint to it outright.</li> <li>Earthquake 2HKOes Tyranitar and Metagross while Hidden Power Ghost OHKOes Gengar.</li> <li>Tauros's shallow movepool means its best option for its last attacking slot is a second Normal-type move in addition to Double-Edge. Return scores the same 2HKOs against foes like Latias and Zapdos without incurring recoil damage but fails to OHKO Starmie and misses out on the roll to OHKO Raikou. Hyper Beam can be used for burst damage on a turn where Tauros is likely to be taken out after it moves, and Facade can provide surprisingly strong damage if Tauros finds itself hit by Thunder Wave or Will-O-Wisp.</li> <li>Tauros wants to use Intimidate on physical attackers like Tyranitar or Snorlax and eliminate a specific foe or punch holes in opposing teams so revenge killers like Sceptile, Gengar, and Raikou can clean up. Snorlax makes a great partner for absorbing the special attacks commonly aimed at Tauros, and Snorlax appreciates having Intimidate support to patch up its Defense. Raikou also actively threatens a lot of Tauros's problematic matchups like Starmie and Gengar. Lastly, Starmie threatens the majority of the tier's Normal resists as it can OHKO Steelix, bulkless Tyranitar, and Gengar while also 2HKOing most Metagross.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "zee", "user_id": 501951}], "teams": [{"name": "Quality checked by", "members": [{"username": "ryo yamada2001", "user_id": 192134}, {"username": "Smudge", "user_id": 550367}]}, {"name": "Grammar checked by", "members": [{"username": "ken", "user_id": 594478}]}]}
  },
  "Gyarados": {
    "sets": {
      "Dragon Dance": {
        "description": "<ul> <li> <p>Gyarados can be an alternative Dragon Dance sweeper to Tyranitar, boasting better matchups against Metagross and Water-types like Swampert as well as Intimidate. However, it hits noticeably weaker than Tyranitar and is reliant on support from Marowak's Lightning Rod to keep it safe from Thunderbolt from Raikou, Zapdos, and Gengar and requires multiple Dragon Dance boosts to deal serious damage. It should be noted that this is difficult to pull off consistently due to the tier's fast pace.</p> </li> <li> <p>Earthquake is powerful spread damage, but takes a few Dragon Dance boosts to become truly scary. It OHKOes Raikou at +1 Attack and Tyranitar and Metagross at +2.</p> </li> <li> <p>Hidden Power Flying gives Gyarados a strong STAB attack, KOing Gengar and Sceptile at +1 and Starmie at +2 Attack. Hidden Power Rock is an option to hit Zapdos, but it will only OHKO at +2 Attack.</p> </li> <li> <p>Gyarados requires an Adamant nature to always OHKO 252 HP Metagross with a +2 Earthquake, though a Jolly nature will allow it to outspeed the rarely-seen Aerodactyl after a single Dragon Dance boost.</p> </li> <li> <p>Lum Berry temporarily keeps Gyarados safe from any Thunder Wave or Will-O-Wisp it might draw in to halt its attempts to sweep.</p> </li> <li> <p>Lightning Rod Marowak is an absolute requirement for Gyarados, as most teams will have either an Electric-type like Raikou and Zapdos or Electric coverage like Thunderbolt on Gengar and Latias. Metagross, Steelix, and Thunderbolt-less Gengar can really only pressure Gyarados with Explosion, so pairing it with Gengar or multiple Protect users to block incoming Explosion will be helpful. Dual screens support from Latias to improve Gyarados's overall bulk will also go a long way in supporting its Dragon Dance sweep. Snorlax appreciates Gyarados's Intimidate and helps it out by checking Raikou and Zapdos thanks to its superb special bulk.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "zee", "user_id": 501951}], "teams": [{"name": "Quality checked by", "members": [{"username": "ryo yamada2001", "user_id": 192134}, {"username": "Smudge", "user_id": 550367}]}, {"name": "Grammar checked by", "members": [{"username": "ken", "user_id": 594478}]}]}
  },
  "Aerodactyl": {
    "sets": {
      "Choice Band": {
        "description": "<ul> <li> <p>Aerodactyl is the fastest viable Pokemon in ADV Doubles and boasts the coveted Ground and Rock offensive combination. However, it is reliant on a Choice Band to do any serious damage, and it still comes up shy of OHKOing Pokemon like Metagross and Tyranitar that threaten to OHKO it back.</p> </li> <li> <p>Earthquake is Aerodactyl's best attack, as it OHKOes Raikou and 2HKOes Tyranitar, Metagross, and Steelix. Common Ground-immune Pokemon, such as Gengar, are 2HKOed by Hidden Power Rock, while Zapdos is OHKOed.</p> </li> <li> <p>Double-Edge is a strong and spammable move for Aerodactyl to use freely and not worry about recoil thanks to Rock Head. Notably, it can 2HKO bulky Latias, which Hidden Power Rock fails to do. Aerial Ace OHKOes Sceptile, but most other Pokemon in the tier are hit harder by a different attack. Rock Slide has a pitiful damage output, but it is a spread move that can hit Flying-types and Levitate users while also having the ability to flinch. Hyper Beam is a last-ditch, high damage option that can be used in desperate situations to get a powerful attack off before it faints.</p> </li> <li> <p>The given EV Spread allows Aerodactyl to survive a Thunderbolt from Gengar while outspeeding Sceptile and Alakazam, making it the fastest viable Pokemon in the tier.</p> </li> <li> <p>Aerodactyl is best saved for late-game, where it can act as a cleaner or as a revenge killer on weakened fast Pokemon like Latias and Gengar. Locking into the wrong move can be costly, especially if locking into Earthquake, as it can be easily punished by Ground-immune foes switching in. It is important to note that Aerodactyl really isn't that strong and comes up short if its foes haven't taken any chip damage.</p> </li> <li> <p>Aerodactyl needs to be paired with multiple Ground-immune Pokemon, such as Gengar, Latias, and Zapdos, in order to freely spam Earthquake. Swampert and Snorlax make good partners with Aerodactyl for their ability to check Electric-types as well as Tyranitar, while Aerodactyl provides a Ground-immune partner for them to use Earthquake with.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "zee", "user_id": 501951}], "teams": [{"name": "Quality checked by", "members": [{"username": "ryo yamada2001", "user_id": 192134}, {"username": "Grandmas Cookin", "user_id": 428483}]}, {"name": "Grammar checked by", "members": [{"username": "ken", "user_id": 594478}]}]}
  },
  "Snorlax": {
    "sets": {
      "Bulky Attacker": {
        "description": "<ul> <li> <p>Snorlax shrugs off all unboosted special attacks in ADV Doubles, which makes it the best blanket check for Pokemon like Latias, Raikou, and Starmie. Its powerful attacks, especially Self-Destruct, also allow it to command a strong offensive presence at all times.</p> </li> <li> <p>Return is Snorlax's safest STAB attack, useful for strongly hitting Water-types like Swampert and Starmie in addition to Zapdos and Sceptile. Double-Edge offers more power but chips into Snorlax's HP, diminishing its bulk.</p> </li> <li> <p>Earthquake hits Normal-resistant foes like Metagross and Tyranitar. This, coupled with Shadow Ball for Gengar, gives it perfect coverage into the metagame, hitting all viable Pokemon for at least Neutral damage.</p> </li> <li> <p>Snorlax's Self-Destruct is one of the strongest attacks in the metagame and will OHKO even the bulkiest of neutral targets, such as Swampert and Latias, if attacking without any damage reduction. If it can pull off the attack successfully, it will decimate the opponent's side of the field.</p> </li> <li> <p>Protect can be used on Snorlax to allow it to scout for Explosion from foes or accumulate more Leftovers recovery.</p> </li> <li> <p>Lum Berry shields Snorlax from Will-O-Wisp burns and paralysis from Thunder Wave. Choice Band makes Snorlax's attacks even more devastating, allowing its Self-Destruct to OHKO even Normal-resistant foes like Tyranitar and Metagross. Leftovers allows Snorlax to recover some of its HP, amplifying its excellent bulk.</p> </li> <li> <p>The EV Spread allows Snorlax to 2HKO Latias with Shadow Ball while investing heavily into physical bulk, allowing it to be 3HKOed by Metagross's Meteor Mash.</p> </li> <li> <p>Snorlax appreciates Intimidate users such as Tauros and Arcanine to make up for its lower Defense stat. Arcanine also pressures Metagross with Overheat, which is appreciated, since Snorlax is threatened by Metagross's Meteor Mash and Explosion. Faster Pokemon like Raikou, Tauros, Gengar, and Latias make up for Snorlax's pitifully low Speed, as it ties Steelix as the slowest viable Pokemon in the tier. Gengar is a vital partner for Snorlax, as it can safely use Self-Destruct without having to force its partner to use Protect.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "zee", "user_id": 501951}], "teams": [{"name": "Quality checked by", "members": [{"username": "ryo yamada2001", "user_id": 192134}, {"username": "Smudge", "user_id": 550367}]}, {"name": "Grammar checked by", "members": [{"username": "ken", "user_id": 594478}]}]}
  },
  "Steelix": {
    "sets": {
      "Offensive": {
        "description": "<ul> <li>Steelix's insanely high Defense makes it an excellent check to common physical attackers in ADV Doubles like Snorlax, Metagross, and Tyranitar, in spite of its Earthquake weakness. Its Ground and Steel typing also gives it a strong matchup into Zapdos and Raikou.</li> <li>Steelix's Earthquake cleanly OHKOes Raikou, though it fails to OHKO Metagross and Tyranitar. However, they only 3HKO Steelix with their respective Earthquakes, while Steelix 2HKOs the both of them.</li> <li>Steelix boasts one of the strongest Explosions in the tier behind Metagross and Snorlax, making it a terrifying threat if it can't be removed quickly.</li> <li>Hidden Power Ghost 2HKOes Gengar and 3HKOes Latias. Hidden Power Rock hits Gengar for significantly less damage but gives it an option to threaten Zapdos without using Explosion.</li> <li>The EV Spread gives Steelix enough Special Defense to be 3HKOed by Latias's Hidden Power Fire.</li> <li>Steelix's immunity to Thunder Wave and sand damage make it one of the few Pokemon in the tier that prefers using Leftovers to Lum Berry. The passive recovery can help it check physical attackers much better.</li> <li>Because Steelix hates facing Water-type attacks from Pokemon like Starmie and Swampert and Fire-type attacks from Arcanine and Gengar, pairing it with Latias, which can resist both types, is effectively required. Pokemon like Suicune and Zapdos also do a great job at pressuring these Pokemon with Hydro Pump from the former's Thunderbolt and Hidden Power Grass from the latter. Gengar makes an excellent teammate for Steelix as it is immune to its Explosion and Earthquake.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "zee", "user_id": 501951}], "teams": [{"name": "Quality checked by", "members": [{"username": "ryo yamada2001", "user_id": 192134}, {"username": "Smudge", "user_id": 550367}]}, {"name": "Grammar checked by", "members": [{"username": "ken", "user_id": 594478}]}]}
  },
  "Heracross": {
    "sets": {
      "Choice Band": {
        "description": "<ul> <li> <p>Heracross is a strong Choice Band user with the ability to OHKO Latias and Tyranitar as well as threaten big damage on Snorlax. Its reliance on Choice Band can leave it locked into inopportune moves, and its weakness to Psychic is a big target on its back in a tier with Latias on nearly every team. Its awkward Speed tier and reliance on Hidden Power Ghost to threaten the omnipresent Gengar are also notable drawbacks.</p> </li> <li> <p>Megahorn OHKOes Latias and Tyranitar, and with a Swarm or Guts boost, it can OHKO Metagross and Suicune. Brick Break also OHKOes Tyranitar without risking a miss and 2HKOes Snorlax.</p> </li> <li> <p>Earthquake is a strong spread move that allows Heracross to deal massive damage to both opponents in one attack. It OHKOes Raikou and 2HKOes Tyranitar, Metagross, and Steelix. Hidden Power Ghost OHKOes Gengar, which walls Heracross otherwise.</p> </li> <li> <p>Swarm is easy to activate on Heracross, since it just narrowly survives Psychic from Latias and Starmie. Guts forces opponents to think twice about using Thunder Wave and Will-O-Wisp on Heracross, as a Guts-boosted Heracross can OHKO even maximum Defense Snorlax with Brick Break.</p> </li> <li> <p>The EV Spread allows Heracross to survive a Psychic from Latias and outspeed Jolly Metagross.</p> </li> <li> <p>Snorlax makes a great partner for Heracross due to its positive matchups against Latias, Starmie, and Zapdos. In return, Heracross can Brick Break Normal-resistant foes like Tyranitar and Steelix, removing potential Self-Destruct resistances or allowing Snorlax to freely spam Return. Raikou also boasts a positive matchup against the aforementioned threats and appreciates Heracross's ability to pressure Tyranitar and Snorlax. Latias and Starmie can OHKO Gengar without forcing Heracross to have to lock itself into Hidden Power Ghost. Thunder Wave support is appreciated to give Heracross the ability to outspeed faster threats like Latias and Raikou.</p> </li> <li> <p>Heracross can make use of Salac Berry and Endure to get a Speed boost and make use of Swarm, though it's worth noting that Tyranitar's Sand Stream can be used to effortlessly KO Heracross after surviving a turn with Endure.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "zee", "user_id": 501951}], "teams": [{"name": "Quality checked by", "members": [{"username": "ryo yamada2001", "user_id": 192134}, {"username": "Grandmas Cookin", "user_id": 428483}]}, {"name": "Grammar checked by", "members": [{"username": "ken", "user_id": 594478}]}]}
  },
  "Tyranitar": {
    "sets": {
      "Dragon Dance": {
        "description": "<ul> <li>Dragon Dance Tyranitar is a fearsome win condition that every team in ADV Doubles must be prepared for. Earthquake and Hidden Power Rock provide perfect coverage, hitting every viable Pokemon in the tier for at least neutral damage. If given the room to set up, it can easily run away with games quickly. Preventing this is easier said than done, as its natural bulk means it's only really threatened by super effective attacks.</li> <li>Hidden Power Rock OHKOes Zapdos and uninvested Gengar after a Dragon Dance. Rock Slide is not recommended, as spread moves that only target the opponents see their damage halved in this generation.</li> <li>Earthquake serves as powerful spread damage and threatens Rock resistances like Metagross, Steelix, and Swampert.</li> <li>A Jolly nature is required to outspeed Adamant Metagross, as well as Starmie and Raikou after a Dragon Dance. Do note that Tyranitar falls slightly short of outspeeding Sceptile after a single Speed boost.</li> <li>The best time to use Dragon Dance is after checks like Metagross and bulky Water-types have been weakened or removed. Tyranitar easily sets up on the likes of Zapdos, Latias, Gengar, and Arcanine, as they provide little threat against it.</li> <li>Tyranitar can also make use of a Choice Band set, threatening the same immediate power that it would after a Dragon Dance boost, though it loses out on the ability to truly sweep through games as such a slow attacker.</li> <li>Bulky Water-types like Suicune and Swampert are some of Tyranitar's biggest obstacles even after a Dragon Dance, so pairing it with the likes of Sceptile and Zapdos to help break these Pokemon is recommended. Tyranitar's durability is greatly improved behind dual screens support from Latias. Arcanine can OHKO Metagross and Sceptile with Overheat, and its Intimidate helps with weakening opposing Earthquakes.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "zee", "user_id": 501951}], "teams": [{"name": "Quality checked by", "members": [{"username": "ryo yamada2001", "user_id": 192134}, {"username": "qsns", "user_id": 230771}]}, {"name": "Grammar checked by", "members": [{"username": "ken", "user_id": 594478}]}]}
  },
  "Metagross": {
    "sets": {
      "Bulky Attacker": {
        "description": "<ul> <li>Metagross is the most offensively threatening Pokemon in ADV Doubles. Its Meteor Mash at worst 2HKOes neutral targets, and it has access to the two strongest spread moves in Earthquake and Explosion. Its bulk makes it extremely difficult to remove before getting to attack at least once, and Clear Body prevents Attack drops from Tauros and Arcanine's Intimidate.</li> <li>On Choice Band sets, Shadow Ball can be used to OHKO Starmie and deal more damage to Latias. Hidden Power Rock can be useful for hitting Zapdos but doesn't hit much else.</li> <li>Lum Berry is the preferred item to keep Metagross safe from the abundance of Thunder Wave in the tier as well as Gengar's Will-O-Wisp. Choice Band provides more immediate power, particularly notable for Explosion, at the cost of flexibility.</li> <li>The given EV spread is a conservative suggestion on how to EV Metagross, but Metagross can go as fast as running a Jolly nature with 176 Speed EVs to outspeed and OHKO Jolly Tyranitar.</li> <li>Metagross's primary goal is to KO a Pokemon and use Explosion later on. A well-played Metagross can trade three for one if it manages to pull this off. Any skilled opponent will be wary of Explosion, so be careful about using it liberally.</li> <li>Metagross should be on the vast majority of all ADV Doubles teams, and its toolkit is appreciated by almost all Pokemon in the tier. Using it as a lead with Pokemon immune to Earthquake—such as Gengar, Latias, or Zapdos—is recommended.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "zee", "user_id": 501951}], "teams": [{"name": "Quality checked by", "members": [{"username": "ryo yamada2001", "user_id": 192134}, {"username": "qsns", "user_id": 230771}]}, {"name": "Grammar checked by", "members": [{"username": "ken", "user_id": 594478}]}]}
  },
  "Latias": {
    "sets": {
      "Offensive": {
        "description": "<ul> <li>Latias's Speed, excellent bulk, and solid offensive qualities allow it to almost always get at least one powerful attack off, which is a rare feat in the aggressive and fast-paced ADV Doubles.</li> <li>Psychic and Dragon Claw form a potent offensive pairing, hitting the vast majority of the metagame for OHKOs or 2HKOs. Psychic notably scores an OHKO on Gengar, while Dragon Claw is extremely valueable for Tyranitar, Starmie, and opposing Latias.</li> <li>Hidden Power Fire is Latias's best way of hitting Metagross, though it should be noted that being required to run a 30 Speed IV means it can never opt into the Speed tie with Gengar, Tauros, and opposing Latias without Hidden Power Fire. Waterfall hits Tyranitar and Steelix harder at the cost of not being able to KO most Metagross in tandem with Gengar's Fire Punch.</li> <li>Lum Berry is used to momentarily keep Latias from being slowed down by Thunder Wave.</li> <li>Latias is the best Pokemon in the tier bar none, and the gap is so wide that it should really be on all serious teams. Its worst matchups are against Tyranitar, Metagross, and Snorlax, so powerful Earthquake users such as Metagross and Swampert make for good teammates. Faster Pokemon like Raikou, Starmie, and Sceptile also ease the pressure on the Latias mirror match.</li> </ul>"
      },
      "Utility": {
        "description": "<ul> <li>Dragon Claw gives Latias the most reliable neutral coverage in one moveslot, though running Psychic in addition is recommended for the higher base power and the OHKO on Gengar without bulk investment.</li> <li>Thunder Wave is one of the few viable methods of speed control in ADV Doubles, and Latias is one of its most effective users because of its high Speed.</li> <li>Reflect and Light Screen act to mitigate the large amounts of damage thrown around in the tier and are excellent at facilitating setup sweepers like Dragon Dance Tyranitar or Curse Snorlax. Helping Hand is an option that works well with Earthquake users like Swampert and Metagross or fast revenge killers like Raikou and Starmie.</li> <li>Lum Berry allows Latias to absorb a Thunder Wave, ensuring it can still move first to set up additional dual screens or spread more paralysis of its own.</li> <li>For as fast paced as ADV Doubles games are, Latias should generally be prioritizing setting up dual screens or spreading paralysis over attacking unless absolutely necessary, like KOing Gengar with Psychic or finishing off a weakened foe.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "zee", "user_id": 501951}], "teams": [{"name": "Quality checked by", "members": [{"username": "ryo yamada2001", "user_id": 192134}, {"username": "qsns", "user_id": 230771}]}, {"name": "Grammar checked by", "members": [{"username": "ken", "user_id": 594478}]}]}
  }
}