{
  "Arceus": {
    "overview": "<p>After the pre-battle tintinnabulation is completed, please stare in pure, unadulterated horror and ominous presentiment at what is unequivocally the best and most versatile Pokemon in the game. Dare not incur Arceus's divine wrath, or else the consequences shall be severe and merciless, and life shall become but an evanescent wisp.</p>",
    "comments": "<h1>Other Options</h1> <p>Although not necessarily outclassed, there are a few sets and options that Arceus could make great use of if not for the Species Clause. The Species Clause means you need to choose the Arceus set you use wisely. A dual screen set with Light Clay can be used to allow Arceus's teammates an easier setup, or allow Arceus to stall out opponents with Toxic and Recover, but it is best left to other Pokemon. In a similar vein, Arceus can use a stall-based set similar to Lugia consisting of Recover, Toxic or Will-O-Wisp, Roar, and a screen, but once again this is better left to other Pokemon. Thanks to its fairly decent movepool Arceus can run a somewhat effective mix set, but Normal-type STAB isn't the best move to base such a set off. Arceus can also make a decent lead with its access to Stealth Rock, wide variety of coverage moves, STAB Extreme Speed to pick off Focus Sash users, and the ability to use Lum Berry, but as it is with all the other options, Arceus can do much better than this. Finally, Perish Song is an interesting move in Arceus's arsenal, but Arceus only has Whirlpool for trapping and its pathetic 70 accuracy is a major letdown.</p> <h1>Checks and Counters</h1> <p>Although extremely dangerous, Arceus is perfectly counterable. Almost every Arceus set falls to Giratina with Rest, bar the Calm Mind version with Dark Pulse or Shadow Ball. Giratina is also immune to Extreme Speed, and can put any physical sweep to a grinding halt with Will-O-Wisp. Lugia also takes little damage from Extreme Speed with its massive Defense and HP stats, and can outspeed Arceus to set up Reflect before Arceus can use Shadow Claw, and proceed to Roost off any damage taken. Both of the aforementioned Pokemon also have Pressure, making Extreme Speed's meager PP drain in seconds. Arceus-Ghost can also take any hit from Arceus and Will-O-Wisp it. Arceus-Fighting, in a similar vein, can take any hit Arceus can dish out and respond with its super effective STAB. Skarmory completely walls any physical Arceus without Overheat, and can phaze away any boosts Arceus has acquired with Whirlwind. Groudon doesn't like taking too many boosted hits since it doesn't have reliable recovery, but it can easily survive one or two attacks and phaze Arceus with Roar. While they cannot directly counter Arceus, Lucario and Heracross can do major damage with their STAB Close Combat. Blissey and Latias can wall the Calm Mind set and Toxic stall it and Calm Mind alongside it, respectively. Finally, Tyranitar also laughs at the Calm Mind set's attacks thanks to its massive sandstorm-boosted Special Defense, and can eventually beat Arceus if it gets lucky with Defense drops from Crunch.</p>",
    "sets": [
      {
        "name": "Extreme Killer",
        "description": "<p>Arceus is a terror to behold on the battlefield. With its amazing bulk, good Attack stat, excellent type coverage, as well as STAB Extreme Speed, one would be wise to make ample preparations for this set. This set may appear to be outclassed by Rayquaza due to Rayquaza's higher Attack stat and STAB Dragon-type attacks, but STAB ExtemeSpeed, more bulk, and lack of a weakness to Stealth Rock all serve to differentiate Swords Dance Arceus from Swords Dance Rayquaza.</p> <p>This is arguably the best set Arceus can run, and for good reason. STAB Extreme Speed, coming off a base 120 Attack stat and amazing bulk, is something to fear. Swords Dance allows Arceus to raise its Attack stat and, by association, Extreme Speed's power to sky-high levels. Extreme Speed is the main attacking move as it provides STAB priority that puts the fear of god into many Uber Pokemon. Shadow Claw is chosen for the third move slot as it gives Arceus a way to hit Lugia and Ghost-type Pokemon that are immune to Extreme Speed for super effective damage. The last slot is dependent on what you need Arceus to beat. Earthquake gives you reliable coverage against Steel-type Pokemon that resist both Extreme Speed and Shadow Claw. On the other hand, Overheat allows Arceus to beat one of its biggest enemies, Skarmory, while still retaining the ability to roast Steel-type Pokemon; however, the accompanying Special Attack drop means that you will only be able to use it once, which is a definite drawback. Recover is another option to capitalize on Arceus's bulk, but it will sorely miss the coverage provided by Earthquake or Overheat.</p> <p>The item you use is based on personal preference. Silk Scarf provides Arceus with 20% more power on Extreme Speed without sacrificing HP, while Leftovers enhances Arceus's bulk. If you desire more power, Life Orb is a usable option, and is unique to Arceus. If you do choose Life Orb, Recover is the best choice for the last slot to mitigate the recoil damage. The last item to consider is Lum Berry; with Lum Berry, Arceus can shrug off a Dark Void or Will-O-Wisp from Darkrai and Giratina, respectively, which would normally put Arceus out of commission. As for moves, a viable option to consider is Dragon Claw, which hits Pokemon such as Latias and Giratina-O harder than Shadow Claw, but isn't recommended as the coverage against Lugia and Ghost Arceus is sorely missed. Shadow Force can work over Shadow Claw, as it can OHKO opposing Arceus-Ghost after a Swords Dance, but other than that it just leaves Arceus open to easy switch-ins; there are Pokemon immune to Shadow Force and Extreme Speed, meaning it's easy to simply switch back and forth and wall Arceus. Return is worth a glance, as it has a lot more PP when compared to Extreme Speed, but one should know by now that STAB Extreme Speed is what makes so many Uber Pokemon run in fear.</p> <p>Another thing to consider with Arceus is its nature; this is one of the few Arceus sets where a non Speed-boosting nature is viable. The choice depends on whether your team plans to utilize Spikes or not. If it uses only Stealth Rock, Adamant becomes the better choice to secure KOs that Jolly would otherwise fall short on. However, if your team does use Spikes, Jolly becomes the better option as one layer of Spikes, along with Stealth Rock, makes the power boost from Adamant negligible. It is worth noting the nature change only applies if you are using Silk Scarf or Life Orb, as without them, even with Adamant's power boost, Arceus will fall short on many KOs, making the Speed boost from Jolly more desirable. Jolly allows Arceus to outspeed all base 100 Speed Pokemon and below.</p> <p>Swords Dance Arceus has problems with Giratina, who can Will-O-Wisp Arceus and crush any chance it has of sweeping, and Lugia, who can set up Reflect and laugh at Arceus's weak Shadow Claws as Lugia Whirlwinds it away. For this reason, Wobbuffet alongside a Pursuit user, such as Scizor and Metagross, can make great teammates. Wobbuffet can switch into Lugia or Giratina, Encore them, and proceed to use Tickle to wither away their Defense stat into oblivion. After an adequate amount of Tickles, your Pursuit user can come in and crush the weakened walls, as they have no choice but to switch out thanks to Encore. Latias can also put Giratina and Lugia in a tight spot with Dragon Pulse and Thunder, respectively. As a bonus, Latias can check Arceus-Fighting, which can take any attack Arceus has with ease and crush it with its own super effective STAB. This set also is hard-pressed to sweep when Groudon is around, as Groudon can easily take a boosted Extreme Speed and either Roar Arceus away or hit it with a crippling Toxic or Thunder Wave. Latias can help against Groudon too, provided Latias has Grass Knot. Skarmory can easily switch in on a Groudon that lacks a Fire-type move (which many do), and proceed to set up Spikes, which can be helpful if you choose to use a Jolly nature on your Arceus, even though Skarmory can't beat Groudon one-on-one without Toxic. Mixed Dialga with Bulk Up and Draco Meteor is very adept at luring out Groudon and crushing it, so it too can be a valuable teammate. Dialga can also run Fire Blast to fry pesky Skarmory, who pose a big problem for this Arceus if it lacks Overheat. Without Overheat, Skarmory can switch in, set up Spikes, and Whirlwind Arceus away at its leisure. Pokemon that can use Light Screen and Reflect, such as Mewtwo, Uxie, and Latios, can help Arceus set up a lot easier, so are worth looking into. Lastly, Stealth Rock is a necessity when using this Arceus, so a reliable Pokemon that can set them up, such as Deoxys-S, is helpful. Deoxys-S can also use Spikes, which greatly aid Arceus in its sweeping endeavors by letting it use a Jolly nature.</p>"
      },
      {
        "name": "Calm Mind",
        "description": "<p>Calm Mind Arceus may seem like a bad idea, but Arceus has a few tricks up its sleeve to make this set worthwhile. The most prominent advantage Arceus has over other Calm Mind Arceus is the ability to use Leftovers as its hold item, and the consistent recovery provided helps a lot in many scenarios. Another advantage is Arceus's lack of common weaknesses, as it possesses a lone weakness to Fighting-type attacks. Lastly, if you desire a boost in power, Life Orb is also unique to Arceus, but Leftovers is the recommended item.</p> <p>Calm Mind is the crux of this set as it allows Arceus to raise its Special Attack and Special Defense to sky-high levels and muscle through even Pokemon that resist its attacks. With its great bulk, Arceus can set up on a wide variety of Pokemon and pose an immediate threat to any team. Judgment is chosen in the second slot to provide Arceus with reliable STAB. The third slot is a toss-up, and is used to patch up Normal's sub-par coverage. Flamethrower allows Arceus to beat Steel-types such as Scizor and Skarmory, however, Dark Pulse is also an option to give Arceus a better chance against Wobbuffet and Giratina-O. It is worth noting that Giratina-O can't actually touch Arceus, and has no recovery, so it will eventually be worn down by Flamethrower. Therefore, Flamethrower is usually the better choice so you aren't walled by Steel-types. Giratina, on the other hand, commonly carries Rest, so if you are without Dark Pulse you have no chance of beating it; thankfully, Giratina isn't too common. Recover is a necessity in the last slot to allow Arceus to heal its wounds and make it a near-indestructible sweeper. Likewise, a Timid nature should always be used as it allows Arceus to outspeed positive natured base 100 Speed Pokemon and below.</p> <p>Thanks to Arceus's vast special movepool, it has a few more options. Earth Power can be used to let Arceus hurt Rock- and Steel-type Pokemon, but this leaves it wide open to Skarmory unless you forgo Judgment or Recover for Flamethrower; neither of which is recommended. Focus Blast is also an option to hit the aforementioned types, but the accuracy is disappointing, even if Arceus has the bulk to afford a few misses. If you desire a bit more power, Fire Blast is usable over Flamethrower, but once again the accuracy is disappointing; it also scores no notable KOs and leaves you open to Giratina-O thanks to its low PP. Shadow Ball can be used over Dark Pulse if you would prefer the occasional Special Defense drop rather than the chance to flinch, but the flinch can come in handy against foes such as Wobbuffet. Finally, a Silk Scarf can be used over Leftovers, but then you forfeit consistent recovery, Calm Mind Arceus's claim to fame, to give it a 20% power boost to its STAB, which all Arceus have.</p> <p>Bulk Up Dialga makes a great partner to this set as it can easily take care of Blissey, Giratina-O, Giratina, and Tyranitar; all of which give Calm Mind Arceus trouble. Dialga can easily switch into a Toxic from Blissey thanks to its Steel typing, and doesn't mind anything that Giratina-O, Giratina, or Tyranitar can throw at it as it can Rest off their attacks later. If you do use Dialga it is recommended you use Flamethrower on Arceus, however, as Dialga has trouble with Skarmory as well. As a word of caution, both Dialga and Arceus are weak to Fighting-type attacks, so beware of compounding weaknesses. Arceus also has trouble with Latias, so Scizor makes a good teammate as it is able to switch into Latias's Dragon Pulse and use U-turn or Pursuit against Latias for massive damage. If you are using Scizor, Wobbuffet with Tickle in conjunction with Pursuit from Scizor can spell doom for Blissey who would otherwise wall Arceus. Scizor also has the added bonus of being able to check Tyranitar, who takes next to nothing from Arceus's common attacks and will eventually win with Defense drops from Crunch. Speaking of Tyranitar, it can also make a good teammate to Arceus, despite sandstorm negating Leftovers, thanks to its powerful physical Dark-type attacks. Tyranitar can easily take on Giratina-O, barring the rare Aura Sphere; Giratina and Arceus-Ghost, provided they don't have Will-O-Wisp; and Latias, although be careful of Grass Knot even though it falls short of an OHKO. Tyranitar can also catch a fleeing Blissey with Pursuit, but hates the possibility of Blissey hitting it with status. Although Groudon doesn't directly counter anything except Tyranitar, it can activate the sun with Drought, which increases Flamethrower's power and decreases Thunder's accuracy, both of which are beneficial to Arceus. Giratina-O and Latias can both make good pivots for Arceus as they resist or are immune to Fighting-type attacks, but don't directly counter much.</p>"
      },
      {
        "name": "Choice Band",
        "description": "<p>With Choice Band bloosting its already massive Attack stat, this Arceus forgos Swords Dance to hit hard right off the bat with powerful STAB Extreme Speeds. Due to the fact that Arceus has to wear a Plate to change its type, this is also the only Arceus that can use a Choice Band. When using this set, it is important to capitalize on Arceus's revenge killing capabilities, and not playing it in a way that makes it inferior to Extreme Killer Arceus. However, when played correctly, it's also an absolute terror late-game, and once a team has been sufficiently weakened, Arceus can tear through it with its powerful Extreme Speed.</p> <p>The primary slot of this set should be obvious. A STAB, Choice Band-boosted Extreme Speed is insanely powerful, and can 2HKO nearly everything that doesn't have a resistance or immunity to it. Extreme Speed is what makes Arceus such a viable revenge killer, and can also allow it to sweep teams that have had their Steel- and Ghost-types removed from play. Arceus can check multiple threats that have managed to boost their Speed, such as Dragon Dance and Swords Dance Rayquaza, after some prior damage. With prediction, Earthquake and Shadow Claw allow Arceus to hit Steel- and Ghost-type Pokemon that may attempt to switch into Extreme Speed super effectively. Overheat is used in the final slot as it's Arceus's only way of doing significant damage to Skarmory. Even with the Special Attack-hindering nature and the minimal investment, two consecutive uses of Overheat (with Stealth Rock factored in) do a minimum of 99.3% to 252 HP / 252 SpD Careful Skarmory, securing a 2HKO unless you get two extremely low damage rolls.</p> <p>Even though this set focuses on the role of revenge killing, one must still remember that Arceus has amazing bulk. This means you can use Recover in Overheat's place if beating Skarmory is of no concern to you. It may seem silly to use a non-attacking move on a Choiced set, but Arceus causes so many switches it can find plenty of opportunities to use Recover. Although not recommended, Return can be used over Extreme Speed for more power and PP, but the loss of priority seriously hurts Arceus's revenging capabilities. Punishment can be used over Shadow Claw to hit foes who have obtained some boosts, such as Latias and Giratina-O, for a lot of damage, but the otherwise 50 Base Power is disappointing. Dragon Claw is also another move worth considering for the ability to hit Dragon-type Pokemon harder, but Shadow Claw is usually the better choice as the difference in Base Power is negligible, and Shadow Claw allows Arceus to do more damage to Lugia and Wobbuffet.</p> <p>The last change to consider when using this set is nature. Adamant doesn't secure many 2HKOs or OHKOs, but since the Pokemon you will be trying to kill most likely won't be at full health, Adamant can be useful for a bit of added damage that may secure you a KO. Jolly is still the recommended nature, however, as with it, Arceus can outspeed all base 100 Speed Pokemon and below.</p> <p>Wobbuffet paired with a Pursuit user, such as Metagross and Scizor, can be a great help to this set, as its number one counters are Giratina and Lugia; both of which fall to this potent combo when played correctly. A mixed Dialga with Bulk Up can help Arceus by luring out Groudon and smashing it with Draco Meteor, as Groudon can cause some problems for this set. Due to Arceus's lone weakness to Fighting-type attacks, Giratina-O makes a great partner for its ability to switch in and kill common users of Fighting-type moves. Heracross in particular struggles to do damage to Giratina-O, and is promptly killed by powerful Dragon-type attacks. Arceus-Fighting can also cause this Arceus problems as Arceus-fighting isn't OHKOed by anything Arceus has and can hit it with its super effective STAB. For this reason, Latias makes a great teammate. With 152 HP investment, Latias isn't even 3HKOed by Ice Beam from Arceus-Fighting, meaning it can easily Calm Mind up against special versions and eventually beat them. Latias can also make a decent check to Lugia and Giratina, provided it has both Dragon Pulse and Thunder.</p>"
      }
    ],
    "credits": {"writtenBy": [{"username": "firecape", "user_id": 46442}], "teams": [{"name": "Quality checked by", "members": [{"username": "Jibaku", "user_id": 1779}, {"username": "Fireburn", "user_id": 29197}]}, {"name": "Grammar checked by", "members": [{"username": "Fatecrashers", "user_id": 14288}, {"username": "DJXO9", "user_id": 30058}]}]}
  },
  "Arceus-Bug": {
    "overview": "<p>Behold! The mighty Arceus reveals His perception of all other life on this miserable sphere He treads upon! In His glory He takes a form mirroring that perception, and He has found you to be lacking. Bow down, like the pitiful insects He has judged you to be, and marvel at a predator that no amount of natural selection could ever produce. Even in this weakened state, Arceus strikes down the impure and defies logical thought in the same fell swoop, and the ground itself stills at His approach. Do not be lulled into a sense of false security at the sight of this aspect of the God of Pokemon, for His mere presence in any incarnation is always a terror to behold.</p>",
    "comments": "<h1>Other Options</h1> <p>Refresh allows Arceus-Bug to rid itself of status, particularly poison and paralysis, that could hinder a sweep. Arceus-Bug can also spread poison around with Toxic. Reflect and Light Screen are available to support teammates, but there are better dual screen users, and it wastes a precious moveslot. Arceus-Bug can also use Perish Song to put a timer on opposing Calm Minders that think they can set up on Arceus-Bug, as well as to force switches. Arceus-Bug can also be a viable attacking lead. Its combination of STAB X-Scissor and Extreme Speed allow Deoxys leads to set up only one layer of hazards. In addition, Arceus-Bug has access to the move Magic Coat, which can put opposing Darkrai leads to sleep when they attempt to do the same to you.</p> <h1>Checks and Counters</h1> <p>Arceus-Bug has quite a few counters. Garchomp outpaces Arceus-Bug and can hit it with a super effective Stone Edge. Choice Scarf Kyogre can switch in and use Water Spout or Surf. Dialga is able to switch in with ease and Fire Blast to KO. Giratina can safely switch in and burn Arceus-Bug with Will-O-Wisp. Skarmory can take a +2 Stone Edge and phaze Arceus-Bug away with Whirlwind or hit it with a STAB Brave Bird, or even set up entry hazards against it. While Forretress can't do much to Arceus-Bug directly, it can set up hazards. Blissey becomes a counter to Calm Mind variants of Arceus-Bug that do not employ Substitute. Ho-Oh can take all of Arceus-Bug's attacks, bar Stone Edge, and OHKO it with a Sacred Fire or Brave Bird; it can also set up a Substitute on it with ease.</p>",
    "sets": [
      {
        "name": "Swords Dance",
        "description": "<p>Arceus-Bug has the potential to be a menacing Swords Dance user. X-Scissor and Stone Edge offer excellent coverage together, hitting nearly every Pokemon in the metagame for neutral damage, while a Jolly nature allows Arceus-Bug to outpace positive base 100 Speed Pokemon. Swords Dance Arceus-Bug may seem inferior to Swords Dance Arceus-Ghost at first glance, however Arceus-Bug has many notable strengths over its Ghost-type counterpart. Arceus-Bug is not weak to Ghost- or Dark-type attacks, such as Pursuit, and can hit Dark- and Psychic-type Pokemon super effectively with one attack. In addition, no type is immune to its STAB, and its Bug typing provides an ever useful Ground-type resistance.</p> <p>X-Scissor is the primary move on the set due to STAB. Swords Dance is the crux of the set, allowing Arceus-Bug to further bolster its already solid Attack. X-Scissor's damage output may seem lackluster at first, but Arceus-Bug's bulk, respectable defense typing, and Recover allow it to obtain multiple Attack boosts with Swords Dance. Stone Edge rounds off the set and gives Arceus-Bug near perfect coverage; it hits Flying- and Ghost-types who resist X-Scissor for neutral damage. Earthquake can be used over Recover for coverage against Steel-types, but the lack of recovery is offsetting, especially since Arceus-Bug is weak to Stealth Rock. Cosmic Power can be used over Stone Edge as it enables Arceus-Bug to withstand even more hits, while Substitute is an option to block status. Dragon Claw can also be used in place of Stone Edge for a 100% accurate move to use against Dragon-type Pokemon, and it hits Palkia and Dialga for more damage. However, replacing Stone Edge means that Pokemon such as Shaymin-S, Lugia, and Ho-Oh will become much more problematic. The last option to consider is Overheat, which can be used to fry Skarmory and Forretress, who are otherwise capable of taking several hits and laying down entry hazards.</p> <p>Swords Dance Arceus-Bug has a few counters capable of stopping it cold. Garchomp outpaces Arceus-Bug and can hit it with a super effective Stone Edge. Groudon can be an efficient partner in order to deal with Garchomp and take Rock-type attacks aimed at Arceus-Bug, but its sunlight makes opposing Fire attacks stronger. Choice Scarf Kyogre can switch in on Arceus-Bug and use Water Spout or Surf for devastating damage. Latios and Latias make good partners for Arceus-Bug since they are able to take Water attacks from Kyogre and resist its Fire-type weakness. Dialga is able to switch in with ease and use Fire Blast to KO Arceus-Bug; Giratina can also safely switch in and burn Arceus-Bug with Will-O-Wisp. Skarmory can take a +2 Stone Edge and phaze Arceus-Bug or set up entry hazards against it. While Forretress can't do much in return, it can also setup entry hazards. For all of these reasons, Heatran is given a nod as an excellent teammate as it can switch into Fire and Flying attacks aimed at Arceus-Bug and in return, Arceus-Bug can switch into the Ground attacks directed at Heatran. Wobbuffet makes setting up easier and can trap Scarfed Pokemon who attempt to KO Arceus-Bug. Dual screens can aid in setting up, allowing Arceus-Bug to obtain multiple Swords Dance boosts with more ease. Deoxys-S and Mewtwo are capable of setting up screens quickly with their blistering Speed. Spikes and Stealth Rock can help secure some KOs, so a Spiker is recommended. Forretress and Skarmory do the job well, particularly Forretress, who can use Rapid Spin to remove enemy entry hazards. Be wary though, as both of these Pokemon share a Fire-type weakness with Arceus-Bug. For this reason, suicide leads such Deoxys-S and Froslass are suitable alternatives to lay down entry hazards.</p>"
      },
      {
        "name": "Calm Mind",
        "description": "<p>Like all Arceus types, Arceus-Bug can run a very threatening Calm Mind set. Arceus-Bug easily differentiates itself from its other formes due to its defensive typing and STAB Bug-type Judgment. It is also one of the few Calm Mind Arceus types capable of beating Latias in a Calm Mind war, thanks to its super effective Judgment.</p> <p>Judgment is obviously the primary move due to Arceus-Bug receiving a STAB boost on it. Calm Mind is the crux of the set and allows Arceus-Bug to boost its Special Attack and Special Defense. Thanks to its respectable defense typing and Recover, Arceus-Bug can easily obtain multiple Calm Minds to boost its power. Arceus-Bug has a large variety of options for the last spot, such as Ice Beam, which can hit most Flying- and Dragon-type Pokemon for super effective damage, with Ho-Oh being the exception. Substitute can be used in the same spot to provide Arceus-Bug a way to block status, and Substitute also lets it beat Blissey. Earth Power can be used to net a surprise OHKO on Heatran, and it hits other grounded Steel-types super effectively, while Iron Defense enables Arceus-Bug to have even more defensive staying power, Fire Blast can be used to hit Steel-type Pokemon for super effective damage. However, the biggest reason to use Fire Blast is to beat Skarmory and Forretress, who will otherwise wall this set. Roar can allow Arceus-Bug to be an efficient phazer and can quickly wear down its counters with entry hazard support.</p> <p>Ho-Oh counters this set with ease, taking minimal damage from a +1 Ice Beam or Judgment. A Choice Scarf Kyogre's Water Spout can hit Arceus-Bug for heavy damage. Arceus-Bug can use Thunder to hit Kyogre and Ho-Oh for good damage but it has little use other than that. Latios and Latias make excellent counters to Kyogre with their ability to take Water-type attacks with ease; they can also absorb Ho-Oh's Fire-type attacks directed at Arceus-Bug. Wobbuffet makes for a good partner with its ability to trap counters to Arceus-Bug. Skarmory is troublesome because it can set up entry hazards with ease while phazing Arceus-Bug away or attacking with Brave Bird. Dialga has little trouble taking Arceus-Bug's attacks and can threaten with a Fire-type attack. Heatran and Dialga make excellent teammates for Arceus-Bug. Arceus-Bug resists their Fighting and Ground weaknesses, while Dialga can take Rock-type attacks and Heatran can take Fire-type attacks. Blissey can also counter this set should Arceus-Bug not use Substitute. Spikes and Stealth Rock are required to obtain certain KOs, so a Spiker is recommended. Forretress and Skarmory do the task set at hand, but Forretress gets the nudge over its competition because it can use Rapid Spin to remove the enemies' entry hazards. Be wary though, as both of these Pokemon share a Fire-type weakness with Arceus-Bug. For this reason, suicide leads such Deoxys-S and Froslass can also effectively provide Arceus-Bug the entry hazards it needs.</p>"
      }
    ],
    "credits": {"writtenBy": [{"username": "Megan_Fox", "user_id": 42019}, {"username": "JolteonFTW", "user_id": 73056}], "teams": [{"name": "Quality checked by", "members": [{"username": "Fireburn", "user_id": 29197}, {"username": "Theorymon", "user_id": 29010}]}, {"name": "Grammar checked by", "members": [{"username": "Oglemi", "user_id": 40358}, {"username": "Iconic", "user_id": 29308}]}]}
  },
  "Arceus-Dark": {
    "overview": "<p>The Creator lurks in the shadows with the attachment of the Dread Plate, and lies in wait for prey to come by for Him to pounce on. The Master of the night's opaque Judgment crushes His abundant Psychic- and Ghost-type children that reside in the Uber tier. While the deity of terror is Himself scared witless by Bugs and Fighters, and cannot hope to scratch the hide of Steel-clad Pokemon, the former two are rare in Ubers, and the latter are eradicated by a swift Focus Blast. The tenebrous One is also seemingly outclassed by its ectoplasmic counterpart, Arceus-Ghost; however, nothing is immune to Arceus-Dark's piercing Judgment. Cower in fear before the Master of horrors!</p>",
    "comments": "<h1>Other Options</h1> <p>Other than Focus Blast and Substitute, there are very few other options for Arceus-Dark to use. Flamethrower deserves mention as a secondary attack to roast any Scizor or Heracross bold enough to switch in, but it has fairly poor coverage, and it still leaves Arceus-Dark walled by Heatran and Tyranitar. An entirely offensive Calm Mind set with Judgment / Focus Blast / Ice Beam hits the majority of Uber Pokemon super effectively, although it struggles with stall and does not make use of the excellent bulk Arceus-Dark possesses. Any Swords Dance Arceus-Dark set is discouraged due to the lack of a reliable physical STAB move; it is completely outclassed by its Ghost counterpart.</p> <h1>Checks and Counters</h1> <p>Arceus-Dark is extremely difficult to take down because its weaknesses are uncommon in Ubers, coupled with the fact that Refresh and Recover greatly increase its longevity. Even Pokemon who resist Judgment like Forretress will struggle to do any meaningful damage back to Arceus-Dark; its most solid counters will resist Dark and threaten it back with powerful attacks.</p> <p>Scizor and Lucario are among Arceus-Dark's top counters, thanks to their resistance to Dark and their super effective STAB attacks. Although rare, Heracross resists Judgment and its dual STAB is super effective against Arceus-Dark. Infernape also resists Judgment, and can threaten with Close Combat or U-turn. Tyranitar has excellent Special Defense and resists Judgment, although its lack of super effective attacks to damage Arceus-Dark can cause it to become set-up fodder unless it packs Dragon Dance. Arceus-Dark's Bug and Fighting counterparts deserve mention since they have super effective STABs, and the latter resists Arceus-Dark's Judgment. Heatran's Taunt can prevent Arceus-Dark from healing or boosting, and it can use powerful Fire Blasts to scare Arceus-Dark away. Although most Dialga will have difficulties hurting Arceus-Dark after a few Calm Minds, mixed variants can threaten with Brick Break and Bulk Up versions can boost alongside it. With their excellent Special Defense and powerful attacks, Ho-Oh and Calm Mind Kyogre will almost always defeat Arceus-Dark in a one-on-one situation.</p> <p>Without Refresh, Arceus-Dark's great coverage will make it hard to switch into, although it will be quickly worn down by status and is vulnerable to stall. If Arceus-Dark chooses to use Focus Blast, Blissey's unmatched defenses will let it absorb any attack and get a Toxic off to effectively cripple Arceus-Dark. By extension, any Arceus-Dark lacking Refresh is extremely susceptible to Toxic Spikes.</p>",
    "sets": [
      {
        "name": "Calm Mind",
        "description": "<p>In a tier infested with Psychic-type Pokemon, Arceus-Dark makes an excellent Calm Mind mono-attacker, as nothing is immune to its STAB Judgment, a move with solid coverage overall. With Calm Mind boosting its already stellar special stats, Refresh eliminating bothersome status, and Recover healing any damage it has sustained, Arceus-Dark can be incredibly difficult to take down, especially for stall teams.</p> <p>Not only do Dark-type Judgments hit many Ubers super effectively, but very few Pokemon commonly found in the tier resist the attack. Thanks to its great coverage, Arceus-Dark can afford to eschew a secondary attack for a useful support move to help it set up. More often than not, this move should be Refresh, as it prevents Arceus-Dark from being crippled by status. The Achilles' heel of most Calm Minders is status, specifically Toxic damage, and so Arceus-Dark's ability to cleanse itself with Refresh greatly separates it from other Calm Mind sweepers. As previously mentioned, this specific Arceus excels at breaking stall teams. With Refresh removing poison from Toxic Spikes and Recover to heal residual damage, stall teams will struggle to defeat Arceus-Dark. In addition, common stall team phazers such as Lugia and Groudon can't keep absorbing boosted Judgments. While Refresh gives Arceus-Dark near-unparalleled stallbreaking abilities, there are a few other feasible options, each with their pros and cons. If one feels an auxiliary attacking move is necessary, Focus Blast is the ideal choice for nearly perfect neutral coverage alongside Judgment, although Arceus-Dark will have a much harder time breaking stall and staying alive in general. However, Focus Blast allows Arceus-Dark to deal with its most common counters, including Tyranitar, Lucario, and Scizor. On the other hand, Substitute can block incoming status moves while also allowing Arceus-Dark to scout switch-ins, but it's generally inferior to Refresh because it leaves Arceus-Dark helpless against Toxic Spikes.</p> <p>Although Arceus-Dark's combination of bulk and power makes it a frightening offensive threat, it still has many solid counters. Scizor is without a doubt the number one Arceus-Dark counter, as it's bulky enough to withstand even boosted Judgments, and can retaliate with its super effective STAB Bug-type attacks. While Tyranitar doesn't have a super effective STAB, its excellent Special Defense, resistance to Judgment, and ability to respond with Stone Edge or Dragon Dance make it a threat to any Arceus-Dark lacking Focus Blast. Although he has poor defenses, Lucario possesses a 4x resistance to Judgment and has STAB Close Combat to dispatch Arceus-Dark. Despite their scarcity in Ubers, Heracross and Infernape resist Judgment and have super effective STAB moves to force out or KO Arceus-Dark outright. While the lack of common Bug- and Fighting-type attacks means Arceus-Dark can often be difficult to take down, Arceus-Bug and Arceus-Fighting deserve mention as counters for their Dark counterpart due to their super effective STAB moves, especially the latter, as it resists Arceus-Dark's Judgment. Heatran can be a nuisance because it can easily absorb Judgments and prevents Arceus-Dark from boosting or recovering with Taunt. With their high Special Defense, Ho-Oh and Calm Mind Kyogre can withstand Arceus-Dark's Judgments and retaliate with their devastating STAB moves. Ho-Oh is free to exploit Arceus-Dark's unboosted Defense with either Brave Bird or Sacred Fire, while Kyogre will come out on top in a Calm Mind war with Arceus-Dark, assuming it has Rest. Although they'll have troubles breaking Arceus-Dark after it has used a few Calm Minds, Darkrai and Dialga can switch in with near impunity, thanks to their resistance to Judgment, and can threaten Arceus with their Fighting-type attacks.</p> <p>Without Focus Blast, Arceus-Dark requires partners that are capable of eliminating the ubiquitous Steel-types found in Ubers. Giratina-O has fantastic synergy with Arceus-Dark, as it resists Fighting- and Bug-type attacks, and has no problem eradicating Steels with Hidden Power Fire provided that sunlight is present. Speaking of which, a bulky Groudon can pair nicely with Arceus-Dark, as it can easily deal with Scizor, Tyranitar, Lucario, and Heracross thanks to its immense physical bulk. It is also capable of setting up Stealth Rock, which Arceus-Dark, like all sweepers, greatly appreciates. If one opts not to use Refresh, Forretress makes a good partner to eliminate Toxic Spikes that quickly wear Arceus-Dark down; Forretress can also sponge Choice Dialga's Dragon-type attacks. Kyogre is a solid answer to Ho-Oh and Heatran, who both give Arceus-Dark trouble, and Choice Scarf variants make excellent checks for any troublesome Darkrai, Heracross, and Infernape.</p>"
      }
    ],
    "credits": {"writtenBy": [{"username": "Iconic", "user_id": 29308}, {"username": "Oglemi", "user_id": 40358}], "teams": [{"name": "Quality checked by", "members": [{"username": "Fireburn", "user_id": 29197}, {"username": "bojangles", "user_id": 20796}]}, {"name": "Grammar checked by", "members": [{"username": "jc104", "user_id": 38600}, {"username": "jumpluff", "user_id": 24168}]}]}
  },
  "Arceus-Dragon": {
    "overview": "<p>With the Draco Plate equipped, the Creator's blood infuses with the magical power of His draconian offspring, His hide hardens into diamond-esque scales, and He commands the battlefield with a terrifying regality. Arceus's Dragon Judgment rains down on His victims with a nigh-unresistable power; only His Steel-clad children may withstand His awesome onslaught, though only until the Master torches them with a mighty Overheat. Kneel in honor of the most powerful of Arceus types, lest you become the next tortured victim of His wrath!</p>",
    "comments": "<h1>Other Options</h1> <p>Arceus-Dragon, like all other Arceus, has a very large movepool. However, most of the moves are outclassed, and are better off on another Arceus forme. Cosmic Power is a viable option on the Swords Dance set, making Arceus-Dragon almost impossible to take down after just one or two boosts. After that, Arceus-Dragon can set up multiple Swords Dances, healing with Recover when low on health. Thunder Wave, Toxic, and Will-O-Wisp are all unexpected options that allow Arceus-Dragon to cripple an opposing counter. It also has access to Roar, which allows Arceus-Dragon to phaze a setup sweeper, and Perish Song, which prevents last Pokemon sweeps from the likes of RestTalk Dialga. Finally, dual screens can be used to allow other Pokemon to set up, but dedicated support Pokemon such as Uxie can perform that job much better.</p> <h1>Checks and Counters</h1> <p>Steel-type Pokemon may seem like they can do well against Calm Mind Arceus-Dragon, but unfortunately, most of them cannot do significant enough damage to it. For example, 56 Attack Choice Band Scizor only manages to deal 37.2% maximum, while Arceus-Dragon can set up Calm Mind and heal itself with Recover as needed. Adamant max Attack Choice Band Metagross is a good counter, being able to 2HKO Arceus-Dragon with Meteor Mash, but boosted Judgments will still do reasonable damage in return. Choice Scarf Garchomp can OHKO Arceus-Dragon with Outrage, but it will get knocked out first if Garchomp switches in on a Substitute. Latias can deal around 75% to Arceus-Dragon with Draco Meteor after a Calm Mind, and will not get OHKOed by Judgment thanks to Soul Dew boosting its already high Special Defense stat. Latios can switch in on a Calm Mind and OHKO Arceus-Dragon with Draco Meteor even after the boost, but must watch out for a predicted Substitute. Swords Dance Arceus-Dragon is harder to counter and, like Rayquaza, usually has to be revenge killed. 188 Speed Timid Lugia can outspeed Arceus-Dragon, set up a Reflect, and fire off Ice Beams, while being able to PP stall with Pressure and Roost. Jolly Garchomp can survive a +2 Extreme Speed from Arceus-Dragon and KO back with Outrage. Swords Dance Arceus-Dragon suffers from moveslot syndrome, meaning if it lacks Overheat, Skarmory can come in and set up entry hazards or phaze it, while Heatran can easily come in and hit Arceus-Dragon hard with Dragon Pulse or Explosion if it does not carry Earthquake.</p>",
    "sets": [
      {
        "name": "Calm Mind",
        "description": "<p>Arceus-Dragon has the ideal combination of attributes for a Calm Mind user. Its powerful STAB Judgment has fantastic coverage, allowing it to easily tear through teams. Its decent bulk, high Speed, and access to Recover are just icing on the cake. Defensive teams in particular will have serious problems with this set, as the Substitutes Arceus-Dragon creates cannot be broken by a Seismic Toss from Blissey.</p> <p>Arceus-Dragon has a good set of resistances to complement its bulk, and it can manufacture plenty of opportunities to switch in and set up. Its powerful STAB Judgment hits many Pokemon in the tier for super effective damage, while most of the common Pokemon that resist it are simply setup fodder. Recover is a useful tool that allows Arceus-Dragon to shake off damage and completely shut down several common threats, such as Groudon. Substitute completes the set; one of its major functions is to block status, but it is also useful for scouting switch-ins. Garchomp, Latias, and Latios often hope to get in for free on a Calm Mind, but Substitute allows Arceus-Dragon to OHKO the former and dent the latter two with Judgment.</p> <p>Fire Blast and Flamethrower are options over Substitute, allowing Arceus-Dragon to fry Steel-type Pokemon such as Scizor. With Fire- and Dragon-type attacks in its arsenal, Arceus-Dragon has perfect neutral coverage against every single Pokemon bar Heatran, but becomes more vulnerable to status, such as the crippling Toxic, which could easily end Arceus-Dragon's sweep. Refresh can also be used to counteract Toxic Spikes, but Arceus-Dragon will have trouble setting up without Substitute, as Pokemon such as Choice Scarf Garchomp can easily come in to OHKO with Outrage. If Refresh is not used, then a Rapid Spinner can greatly benefit Arceus-Dragon. Forretress is the best spinner by far thanks to its great typing and the ability to set up its own entry hazards.</p>"
      },
      {
        "name": "Swords Dance",
        "description": "<p>At first glance, Swords Dance Arceus-Dragon may seem to be outclassed by Rayquaza, who can hit harder due to its higher base Attack, unrestricted EVs, and Life Orb. However, Arceus-Dragon has a few niches that prevent it from being eclipsed by the competition. Arceus-Dragon has access to Recover and quite a lot of bulk, which means it can easily nab multiple Swords Dances. Thanks to its extra bulk, it does not require as much team support as Rayquaza, who often has to rely on Wobbuffet to allow it to set up; Arceus-Dragon also has a higher Speed stat, is not weak to Stealth Rock, and does not get easily knocked out by random Ice attacks such as Ice Shard. Dragon Claw and Earthquake have excellent coverage, hitting every Pokemon bar Skarmory for neutral damage. Overheat is an option over Earthquake, allowing Arceus-Dragon to easily knock out Forretress and heavily damage Skarmory.</p> <p>Dragon Claw is used over Outrage to gain the most from Recover, and emphasizes Arceus-Dragon as a bulky sweeper. Outrage can be used for more power, but it makes Arceus-Dragon easy to revenge kill, and the confusion hurts, especially after a couple of Swords Dances. Recover allows Arceus-Dragon to take advantage of its bulk and differentiate itself from Rayquaza. Arceus-Dragon can make use of Extreme Speed, but this means losing out on either valuable coverage or bulk, both of which are very important in setting up a successful Arceus-Dragon sweep. Substitute can be used over Earthquake or Overheat in order to overcome checks such as Soul Dew Latias, though the loss in coverage is not good. A Jolly nature allows Arceus-Dragon to outspeed non-Choice Scarfed Timid Palkia and anything below that. Adamant is not recommended even with Extreme Speed as this will make Arceus-Dragon slower than positive-natured base 90 Speed Pokemon such as Dialga, which can easily dispose off Arceus-Dragon.</p>"
      }
    ],
    "credits": {"writtenBy": [{"username": "ShinyAzelf", "user_id": 43995}, {"username": "Ice-eyes", "user_id": 45047}, {"username": "Oglemi", "user_id": 40358}], "teams": [{"name": "Quality checked by", "members": [{"username": "Fireburn", "user_id": 29197}, {"username": "bojangles", "user_id": 20796}]}, {"name": "Grammar checked by", "members": [{"username": "Fatecrashers", "user_id": 14288}, {"username": "Honko", "user_id": 42413}]}]}
  },
  "Arceus-Electric": {
    "overview": "<p>That pulsating, tingling sensation you are feeling right now isn't a coincidence. Behold! The master of the world crackles with excitement with the Zap Plate attached to His hide. Arceus-Electric wields near-perfect neutral coverage with just His mighty Judgment and Ice Beam, forcing any adversary to cower with fear as little children do at the sound of thunder. And with only a single weakness to the Ground-type to short-circuit His presence on the battlefield, the creator has little to fear once He has boosted enough times with Calm Mind. Just be wary of Groudon stealing your rain if using the mighty Thunder, and the power of the speedy Garchomp, and you'll find that there is shockingly little that can stop Arceus-Electric from taking the Uber tier by storm.</p>",
    "comments": "<h1>Other Options</h1> <p>Grass Knot can be used to destroy any Groudon hoping to wall Arceus-Electric and has a slim chance of OHKOing after a Calm Mind. Grass Knot also gets a stronger hit on Arceus-Ground, but Ice Beam is usually the better option since it will easily OHKO Garchomp and Rayquaza, the former of which can be a major threat to Arceus-Electric. Earth Power can be used to deal with Heatran, Magnezone, and Tyranitar, but the moves listed in the set are generally superior.</p> <h1>Checks and Counters</h1> <p>Groudon is public enemy number one, as it is immune to Electric-type attacks and gets rid of the rain. It also OHKOes Arceus-Electric with Earthquake. However, even Groudon must be careful because Arceus outruns it and a boosted Ice Beam does 65.8% - 77.7% to support variants, meaning that Groudon can't take much prior damage. Garchomp is faster and can destroy Arceus-Electric with Earthquake while being immune to Judgment and Thunder. Again, Garchomp must be wary of switching into Ice Beam. Blissey can stop Arceus-Electric cold if it lacks Substitute. Arceus-Electric's gimped Speed stat is also one of its weak points, leaving it prone to being revenge killed by all Pokemon above the base 100 Speed tier.</p>",
    "sets": [
      {
        "name": "Calm Mind",
        "description": "<p>Out of all the different formes of Arceus, none are as offensively oriented as Arceus-Electric. Electric is a fantastic typing to have, bringing only one weakness, and hence allowing Arceus-Electric to exploit its natural bulk. Electric-type STAB is also very useful in Ubers as few Pokemon are immune to it. Although Judgment is preferred for its better accuracy, Thunder provides a more powerful alternative and is especially useful if rain support can be provided. Judgment and Ice Beam have unparalleled coverage in the tier, hitting many Ubers for super effective damage, including Giratina(-O), Garchomp, Groudon, Rayquaza, Kyogre, Lugia, Ho-Oh, and Salamence. Also, Arceus-Electric is one of the few Calm Mind Arceus variants capable of beating Ho-Oh and Kyogre one-on-one. Lastly, Recover allows Arceus-Electric to set up much more easily and works very well thanks to Arceus-Electric's magnificent bulk.</p> <p>Thunderbolt can be used over Judgment due to having 8 more PP and a slight chance of paralysis, which can be useful in a Calm Mind war against Latias or Latios. Substitute can be used in place of Recover to protect against status, but Recover does more in the way of keeping Arceus-Electric alive. Mixed Rayquaza is a perfect partner since it is immune to Earthquake and can hit Groudon with an unexpected Draco Meteor. It can also pick off weakened Choice Scarf users with Extreme Speed. A combination of Tickle Wobbuffet and Pursuit Scizor can be used to eliminate pesky special walls like Blissey. The combination also helps with Garchomp, since Scizor can take an unboosted Outrage and Wobbuffet can KO Scarf versions with Counter. Wobbuffet can also help Arceus-Electric set up thanks to Encore. Thunder Wave Kyogre lures in lots of Choice Scarf Pokemon, especially Palkia, and can cripple them with Thunder Wave. Surf and Ice Beam also do a lot of damage to Groudon and Garchomp, respectively. Jirachi can also provide paralysis support with Body Slam, and has the added benefit of being able to cripple Groudon and Garchomp. Wish support can also replace Recover, although it is much more difficult to heal Arceus-Electric with it. However, be aware that Jirachi shares Arceus-Electric's Ground-type weakness. Entry hazard support is extremely helpful for this set: Stealth Rock is mandatory as always, Toxic Spikes helps wear down opponents, and Spikes can help Arceus-Electric nab OHKOs, such as on Groudon switching in. Froslass, Deoxys-S, Deoxys-A, and Forretress can help for these reasons.</p>"
      }
    ],
    "credits": {"writtenBy": [{"username": "hamiltonion", "user_id": 40598}, {"username": "Oglemi", "user_id": 40358}], "teams": [{"name": "Quality checked by", "members": [{"username": "Jibaku", "user_id": 1779}, {"username": "Fireburn", "user_id": 29197}, {"username": "bojangles", "user_id": 20796}, {"username": "firecape", "user_id": 46442}]}, {"name": "Grammar checked by", "members": [{"username": "Calm Pokemaster", "user_id": 42777}, {"username": "jc104", "user_id": 38600}]}]}
  },
  "Arceus-Fighting": {
    "overview": "<p>Prostrate yourself before this incarnation of The Creator, for he is the embodiment of the fighter's spirit, the ultimate victor. Arceus-Fighting stands without peer, as it is immutable fact that even the brawniest of combatants cannot hope to match the might that emanates from Arceus-Fighting. You may try to hide yourself behind Blissey, normally the bane of special attackers, but be prepared to abandon all hope after even she is dispatched without pity or mercy. Truly, this Arceus forme is a fearsome sight to behold; ask not for whom the final bell tolls, it tolls for thee.</p>",
    "comments": "<h1>Other Options</h1> <p>Refresh frees Arceus-Fighting from status such as poison and paralysis that could hinder a sweep. A mono-attacking Calm Mind set is usable, but that leaves Arceus-Fighting totally helpless against any Ghost-type, so it's not recommended since Giratina-O is rather common. A Swords Dance set can be used, but it is generally a horrible option because Brick Break is the best physical STAB Arceus-Fighting can get. Swords Dance sets are better left to Arceus, Arceus-Ground, or Arceus-Ghost. Stone Edge allows Arceus-Fighting to bring down its biggest counter: Ho-Oh. However, it is generally an inferior option because it hits nothing else and Lugia laughs at it. Cosmic Power or a combination of Reflect and Light Screen can be used to boost Arceus-Fighting's defenses, but its lack of notable resistances means it is outclassed in this role. Perish Song can be used to defeat end-game sweepers, but Arceus-Fighting is better suited to demolishing the opponent than attempting to stall. Lastly, Toxic can be used to take out Ho-Oh, Lugia, and Kyogre lacking Rest, since Arceus-Fighting can usually scare off Steel-types with Judgment and Poison-types do not exist in Ubers, meaning it is easily abusable. Keep in mind that without Ice Beam, Giratina completely walls Arceus-Fighting, and Rayquaza gets the chance to set up on it.</p> <h1>Checks and Counters</h1> <p>Ho-Oh is the best counter to Arceus-Fighting with its great bulk and access to recovery, as well as STAB Brave Bird to destroy Arceus-Fighting. Lugia and Giratina are bulky enough to stomach any attack and status Arceus-Fighting or phaze it out, with the former having the added advantage of outrunning Arceus-Fighting when running a Timid nature. Latias has great special bulk thanks to Soul Dew, outspeeds it, and can easily defeat Arceus-Fighting in a Calm Mind war thanks to Latias's superior special stats and Speed. Specially defensive Mewtwo can wall Arceus-Fighting easily thanks to Mewtwo's decent bulk and access to Light Screen, Will-O-Wisp, and Taunt. Arceus-Psychic, while being one of the worst Arceus types, can easily defeat Arceus-Fighting with Zen Headbutt, but a boosted Dark Pulse will likely put a large dent into it. Gyarados has little to fear from Arceus-Fighting's weak Judgments while it can easily status, Taunt, phaze with Roar, or 2HKO Arceus-Fighting with Waterfall. In rain, a +1 Waterfall will likely OHKO Arceus-Fighting after a little prior damage. Arceus-Fighting can abuse one layer of Toxic Spikes to make itself immune to Toxic and defeat Blissey easily. Nevertheless, two layers of Toxic Spikes will severely hamper Arceus-Fighting's longevity.</p>",
    "sets": [
      {
        "name": "Calm Mind",
        "description": "<p>Arceus-Fighting is one of the only Arceus formes capable of using a specially-oriented set without being completely walled by the fat blob known as Blissey. After just 2 Calm Mind boosts, even the mighty Blissey is 2HKOed by Judgment. Arceus-Fighting can easily fit in on any team searching for a bulky sweeper. Unlike most Arceus formes, Arceus-Fighting easily demolishes Darkrai after the Sleep Clause has been activated, and also checks Tyranitar, Heatran, and Dialga. These qualities made Arceus-Fighting a natural fit into stall teams because it can take out almost any stallbreaker.</p> <p>Even with the abundance of Psychic-types in the metagame, Fighting-type Judgment is still an effective attack. After a few Calm Mind boosts, it will demolish almost anything that doesn't resist the attack or have huge special bulk. Sadly, the EV restrictions mean Arceus-Fighting will never outspeed Latias or Latios. Arceus-Fighting should never stay in on Latias unless it manages to garner enough boosts, because Latias can use Calm Mind alongside Arceus-Fighting and eventually defeat it. Arceus-Fighting has the added bonus of having a type advantage over several common Arceus formes, such as Arceus and Arceus-Steel. The coverage move is totally up to preference. Ice Beam nails most Dragon-types such as Rayquaza, Garchomp, and Salamence for an OHKO, while Dark Pulse hurts Psychic-types such as Mewtwo or Deoxys-D. Keep in mind that both Ice Beam and Dark Pulse will not do too much damage to several Uber walls such as Lugia, Giratina, and Latias, even when they are hit for super effective damage. Recover is standard on any Arceus set because it utilizes Arceus-Fighting's amazing bulk and sweeping ability. It also keeps Arceus-Fighting at high health and makes it one of the best counters to Darkrai and Tyranitar.</p> <p>Similar to many Calm Mind Arceus variants, Arceus-Fighting is incredibly vulnerable to Ho-Oh. Ho-Oh has STAB Brave Bird, immense special bulk, and access to reliable recovery which makes it a surefire check to Arceus-Fighting. To deal with the glorified turkey, Stealth Rock should always be used together with a spinblocker, preferably Giratina-O, severely limiting Ho-Oh's ability to switch in. Kyogre makes a good partner, as it is able to drown Ho-Oh with its powerful Surf or Water Spout, while Ho-Oh's Brave Bird will likely 2HKO any Kyogre set at worst. Latias is another large annoyance to this set as the little Dragon-type unfortunately outspeeds Arceus-Fighting. Blissey, Scizor, or Tyranitar can deal with Latias rather easily. Mewtwo generally lacks any Psychic-type move so Arceus-Fighting has little to fear from offensive Mewtwo. However, specially defensive Mewtwo can easily out-stall Arceus-Fighting with Light Screen, Taunt, Will-O-Wisp, and Recover. Giratina makes a fantastic partner for the sole reason of walling Ho-Oh and Choice Scarf Kyogre, who OHKOes Arceus-Fighting with Water Spout.</p>"
      }
    ],
    "credits": {"writtenBy": [{"username": "trickroom", "user_id": 39217}, {"username": "Fatecrashers", "user_id": 14288}], "teams": [{"name": "Quality checked by", "members": [{"username": "Jibaku", "user_id": 1779}, {"username": "firecape", "user_id": 46442}]}, {"name": "Grammar checked by", "members": [{"username": "cosmicexplorer", "user_id": 52295}, {"username": "zdrup15", "user_id": 55559}]}]}
  },
  "Arceus-Fire": {
    "overview": "<p>Do not anger Arceus, lest you dare to invoke the cruel punishment of its burning rage. When in its fiery guise, Arceus will not hesitate to send anything that stands in its way to fry for eternity in the burning lakes of fire for which the underworld is so well known. Its combination of speed, bulk, instant recovery, ability to boost its strength to unimaginable levels, and less of a care for petty magical stones that would make even the most majestic Ho-Oh think twice about coming to battle truly set Arceus-Fire a cut above its fellow Fire-types. However, while Arceus is in this enraged state, it cares less about trying to defend itself, which is why the flaming form of Arceus is not as adept defensively as the other types. Nevertheless, if you dare to challenge Arceus in its red-hot form, pray that the sun is not shining, or else the all-consuming flames of his wrath will leave even the mightiest of opposition standing as nothing more than a mere wisp of smoke in the wind.</p>",
    "comments": "<h1>Other Options</h1> <p>Overheat allows Arceus-Fire to do insane damage in one turn, but the Special Attack drop is somewhat counterproductive with Calm Mind. Ice Beam always OHKOes Garchomp switch-ins while providing good coverage alongside Arceus-Fire's STAB Judgment + Electric-type move of choice. Grass Knot allows Arceus-Fire to hit Kyogre and Tyranitar with one attack, but otherwise its coverage is forgettable and it makes Arceus-Fire even more vulnerable to Ho-Oh and Heatran. Earth Power smashes Heatran to pieces while still 2HKOing Tyranitar after a Calm Mind, and it also has the bonus of hitting opposing Arceus-Fire and Arceus-Rock, but Ho-Oh remains an issue. Arceus-Fire also has access to Cosmic Power, Roar, Refresh, and Iron Defense for a more defensively minded set up, but pure Fire typing isn't the best defensively, and generally other Arceus types can use these moves much more effectively.</p> <h1>Checks and Counters</h1> <p>Blissey can easily handle Arceus-Fire with Toxic if it does not have Substitute. Tyranitar resists Fire-type attacks, takes little damage from Thunder, and can easily KO Arceus-Fire with Stone Edge. Tyranitar, however, needs to be wary of Focus Blast and Earth Power. Kyogre can easily drown Arceus-Fire with a STAB rain-boosted Surf while simultaneously canceling out the sunlight thanks to Drizzle. Choice Scarf Kyogre is a particular issue since it is faster than Arceus-Fire; however, Kyogre can't switch into repeated Thunders. Garchomp is faster than Arceus-Fire, resists Judgment, is immune to Thunder, and will quickly defeat it with Earthquake. Ho-Oh can also tank a Thunder with ease and destroy Arceus-Fire with Earthquake. Latios and Latias will also defeat Arceus-Fire one-on-one in a Calm Mind war unless Arceus-Fire gets a critical hit. Heatran equipped with Taunt and Toxic can defeat this Arceus if it lacks Focus Blast or Earth Power, although Heatran will not enjoy a boosted Thunder. Finally, Arceus-Rock can also counter Arceus-Fire due to its natural type advantage.</p>",
    "sets": [
      {
        "name": "Calm Mind",
        "description": "<p>Unfortunately, the Fire-type isn't that great defensively, riddling Arceus-Fire with weaknesses to Water-, Ground-, and Rock-type attacks, as well as a weakness to Stealth Rock and a vulnerability to Toxic Spikes. However, Fire is quite potent offensively, and Arceus-Fire's large number of coverage moves complement STAB Fire-type attacks very well. When combined with Calm Mind and sunlight, Arceus-Fire's STAB Judgment will burn enormous chunks of health from even the bulkiest foes, notably the ubiquitous Steel-types in Ubers.</p> <p>Although Judgment is preferred as the STAB move of choice for its excellent mix of power and reliability, Fire Blast can also be used if you want significantly more power. Be wary though, as Fire Blast's accuracy is unreliable and it only has half the PP of Judgment, which can hurt Arceus-Fire's chances of winning a Calm Mind war. Thunder will easily 2HKO Kyogre, Manaphy, and Ho-Oh after a Calm Mind boost. However, Thunder has pitiful accuracy in the sunlight, so Thunderbolt presents a more reliable alternative to still gash Kyogre and Ho-Oh badly after a Calm Mind; unfortunately, Thunderbolt has significantly less power than Thunder. Recover is great for Arceus-Fire as it is very bulky despite its regettable defensive typing, and Recover helps to mitigate damage taken from Stealth Rock.</p> <p>Arceus-Fire has several other moves that can work over Recover if you would prefer an all-out offensive approach. Arceus-Fire can create 101 HP Substitutes, which allows it to set up on Blissey because Seismic Toss will not break its Substitutes in one hit. As a bonus, Arceus also gains status protection from using Substitute. Spacial Rend allows Arceus to do tons of damage to Garchomp, Rayquaza, and Palkia that think they can switch in for a free set-up. Spacial Rend also has a high critical hit rate, which can be beneficial to Arceus should it find itself in a Calm Mind war. Focus Blast will smash Tyranitar and Heatran to bits, while doing a nice bit of damage to Blissey after a few Calm Minds. However, it should be noted that without Recover, Arceus will not be able to take nearly as much punishment, especially if Stealth Rock is up on your side of the field.</p> <p>Groudon is an excellent teammate for Arceus-Fire. Not only does it set up the sunlight that makes this set so potent, it can also set up Stealth Rock, which will allow Arceus-Fire to deal with Ho-Oh much more easily, and stands as a great counter to Blissey, Garchomp, Arceus-Rock, and Tyranitar, all of which counter Arceus-Fire quite effectively. Rapid Spin support from Forretress is also a massive boon considering that Stealth Rock and Toxic Spikes greatly hinder this Arceus-Fire. Giratina-O is also recommended as a teammate to help keep entry hazards up on the opponent's side of the field, which is a huge help against Ho-Oh.</p> <p>Arceus-Fire has massive problems with Kyogre, Latios, Latias, and the aforementioned Blissey. Defensive Heatran with Toxic can also check Arceus-Fire with Taunt and Toxic, although a boosted Thunder will do quite a bit. The aforementioned Giratina-O can easily lure in and KO Heatran with a surprise Earthquake, and its powerful physical attacks make it a great check for Blissey. Latias, thanks to her enormous Special Defense and powerful Thunder, is an excellent counter to Kyogre and Heatran. Scizor can use its powerful STAB U-turn to KO; it can also weaken or KO the trio with Pursuit if they switch out. Metagross can fulfill a similar role, and it has the bonus of resisting the Rock-type attacks that will inevitably be thrown Arceus-Fire's way. Tickle Wobbuffet combined with a user of Pursuit is also a near foolproof way of KOing Blissey; Wobbuffet can also trap and KO Latios and Latias with Mirror Coat. Wobbuffet is a big help to Arceus-Fire in general thanks to Encore, which can be used to clear a path for Arceus-Fire to start setting up with Calm Mind. Arceus-Fire also covers Wobbuffet's weakness to Bug-type attacks.</p>"
      }
    ],
    "credits": {"writtenBy": [{"username": "Fireburn", "user_id": 29197}], "teams": [{"name": "Quality checked by", "members": [{"username": "Jibaku", "user_id": 1779}]}, {"name": "Grammar checked by", "members": [{"username": "viol and bass", "user_id": 35513}, {"username": "Oglemi", "user_id": 40358}]}]}
  },
  "Arceus-Flying": {
    "overview": "<p>With the power of the Sky Plate, Arceus embodies the power of the heavens themselves, and rides the winds of punishment upon His foes. Tremble like the aspen before His gale. None of Arceus's creations are immune to His mighty tempest, letting Him throw down His Judgment without much hesitation. Though He has many weaknesses in His Zephyrus forme, including the accursed Stealth Rock, the Mighty One also sports immunities to the dreaded Spikes and Toxic Spikes that plague many of the other denizens of Ubers. Brace for impact from this hurricane-wielding Arceus!</p>",
    "comments": "<h1>Other Options</h1> <p>Arceus-Flying's other options unfortunately suffer from large disadvantages. In terms of a defensive support set, Arceus-Flying's weaknesses leave much to be desired, and this role will probably be filled better by a more defensively advantaged Arceus forme. A physical set with Fly or Aerial Ace is a poor choice because Fly is risky due to taking up two turns, and Aerial Ace is rather weak without multiple Swords Dance boosts. Those looking for a good Swords Dance Arceus should find a different item to attach to it.</p> <h1>Checks and Counters</h1> <p>Arceus-Flying does not like Calm Mind wars with most other Ubers, particularly Giratina, Kyogre, Latias, Latios, Lugia, and other Arceus, especially since Thunder, which is super effective and can paralyze, is viable on all of them. If sufficiently weakened, Extreme Killer Arceus \"outruns\" with its priority Extreme Speed and can set up very easily. Other counters depend on Arceus-Flying's auxiliary move; without Substitute, Blissey can wall Arceus-Flying and inflict it with status, while without Iron Defense, Ho-Oh and Garchomp can outdamage +1 Judgment with their STABs. Without a Fighting- or Ground-type move, Magnezone can wall Arceus-Flying and damage it severely with STAB Thunder.</p> <p>When facing Arceus-Flying, it is very important to know the sprite difference between Arceus-Flying and the similar-looking Arceus-Steel. You absolutely do not want to find yourself using a Ground- or Fighting-type move on Arceus-Flying just because you thought it was Arceus-Steel.</p>",
    "sets": [
      {
        "name": "Calm Mind",
        "description": "<p>Witness Arceus-Flying's glorious moveset. The main idea is to use Arceus-Flying's fantastic bulk to survive various moves while setting up. To this end, Calm Mind is a given to power up Judgment to respectable sweeping levels, while Recover increases Arceus-Flying's longevity further to render 3HKOs useless and set up even more. However, one must not get carried away with this because of the potential for a critical hit, which may put all of the setting up that Arceus-Flying has done to waste. A Timid nature is highly recommended to outrun all threats with base 100 Speed or lower, including particularly major threats such as Kyogre, who can smash Arceus-Flying otherwise with super effective moves.</p> <p>As a Flying-type Calm Mind user, the Wind God's main competition for domination of the skies is offensive Calm Mind Lugia. However, Arceus-Flying sports an arguably superior stat spread for the job, having about 16.6% more physical bulk and 7.9% more Special Attack than offensive Calm Mind Lugia does, while missing out only on outpacing Garchomp in terms of Speed. Notably, +1 Hidden Power Fighting 2HKOes Mixed Dialga, and Arceus-Flying has an extra defensive option in Iron Defense. Finally, Arceus-Flying is not weak against Dark- or Ghost-type moves, which Lugia cannot boast.</p> <p>This Arceus-Flying has several options to round out the set. Substitute is a particularly strong option to shield Arceus-Flying from status moves, and to allow it to set up on Blissey, who cannot break Arceus-Flying's 101 HP Substitutes with Seismic Toss. However, if Arceus-Flying deems Blissey unworthy of attention, it can run Iron Defense to bolster its physical bulk, making it even more difficult to KO with direct damage. Iron Defense can also be used as a last-resort strategy against Wobbuffet's Encore-to-sweeper tactic, and shuts down its Tickle-to-Pursuit tactic. Refresh is also worth some consideration to ward off status without sacrificing Arceus-Flying's HP to Substitute.</p> <p>Arceus-Flying can also take a more direct offensive route by running a secondary attacking move. Hidden Power Fighting is the main option to land reliable 2HKOs against its targets. Alternatively, Focus Blast lands 2HKOs on bulkier Dialga and Skarmory at +1 that Hidden Power Fighting does not achieve, but it hits twice only 49% of the time and has only 8 PP, so it is quite risky. As for other options, Earth Power provides a compromise between power and reliability, but Skarmory walls it, while Thunder hits Kyogre, Lugia, and Ho-Oh harder, but Dialga and Tyranitar wall it.</p> <p>If using Hidden Power Fighting, reducing the Attack IV to 1 will legalize the IV-Nature combination.</p>"
      }
    ],
    "credits": {"writtenBy": [{"username": "capefeather", "user_id": 32648}, {"username": "Oglemi", "user_id": 40358}], "teams": [{"name": "Quality checked by", "members": [{"username": "Fireburn", "user_id": 29197}, {"username": "Theorymon", "user_id": 29010}]}, {"name": "Grammar checked by", "members": [{"username": "Snorlaxe", "user_id": 35542}, {"username": "viol and bass", "user_id": 35513}]}]}
  },
  "Arceus-Ghost": {
    "overview": "<p>The spectral embodiment of Arceus is truly one of the beast's mightiest forms. While in this state, Arceus can attack the souls of its enemies directly with its powerful, ectoplasmic Judgment. Arceus, while in its ghostly form, cannot be hurt by neither Normal nor Fighting assaults. Even thee spinners are neigh worthy enough to cast their blasphemous eyes upon the mighty ghost of the omnipotent Arceus, as their feeble and worthless attempts to spin will be nothing but a waste. It would not be wise to underestimate the spirit of Arceus, lest one wishes to have their very soul stolen from their body.</p>",
    "comments": "<h1>Other Options</h1> <p>Refresh allows Arceus-Ghost to rid itself of status such as poison and paralysis that could hinder a sweep. You can try running a mono-attack Calm Mind set, but that leaves Arceus-Ghost totally helpless against any Normal-type, so it's not recommended. Thunder also has some use on the Calm Mind set to hit Kyogre and Ho-Oh for good damage. Arceus-Ghost can also spread poison around with Toxic. Reflect and Light Screen or Cosmic Power can be used to boost Arceus-Ghost's defenses or to support teammates, but there are better dual screeners, and Arceus-Steel is generally a better Cosmic Power user since it can't be poisoned. Arceus-Ghost can also use Perish Song to put a timer on Calm Minders that think they can set up, as well as forcing switches.</p> <h1>Checks and Counters</h1> <p>Darkrai resists Arceus-Ghost's STAB attacks and can put it to sleep with Dark Void or outright KO it with Dark Pulse, although it will not enjoy taking a boosted Extreme Speed to the face. The Swords Dancer is stopped cold by Skarmory, while special sets can be handled by Kyogre and Ho-Oh thanks to their high Special Defense and powerful STAB attacks. Defensive Groudon variants can also survive a hit from the Swords Dance set and Roar away its boosts. Choice Scarf Tyranitar outspeeds Arceus-Ghost and can nail it with a STAB Crunch, although it won't enjoy being burned. Arceus-Dark is also a good counter thanks to its natural type advantage. Blissey can wall the Calm Mind and defensive sets all day and hit Arceus-Ghost with a status move. Finally, Arceus-Ghost hates being poisoned as its bulk is then compromised.</p>",
    "sets": [
      {
        "name": "Swords Dance",
        "description": "<p>Arceus-Ghost has the distinction of being the only Ghost-type Pokemon with access to Swords Dance, and thanks to its respectable combination of bulk, speed, and power, it can take advantage of this move to gear itself up for a deadly sweep.</p> <p>Shadow Force is the STAB move of choice because of its insane power. For example, it always OHKOes Wobbuffet without a Swords Dance, meaning that Arceus-Ghost will not have to worry about Encore. After a Swords Dance, Shadow Force becomes incredibly devastating; Kyogre, Lugia, Palkia, both Giratina formes, Ho-Oh, and Rayquaza are OHKOed, and even the most defensive of Groudon variants will be 2HKOed. However, the charge up phase Arceus-Ghost experiences while using Shadow Force is problematic, since it gives the opponent a free turn to switch to a Normal-type to absorb the attack and possibly smack Arceus with a status condition. Although this problem can be circumvented with a bit of thought, if you wish to avoid this scenario entirely, Shadow Claw is usable over Shadow Force, but the power drop is very significant. Brick Break pounds the Dark-, Normal-, and Steel-types that resist Arceus-Ghost's STAB attack of choice, and it grants perfect coverage alongside Ghost-type moves. Recover is an excellent move for this set to allow Arceus to gain more than one Swords Dance (especially helpful if using Shadow Claw) and heal off damage taken while setting up. Extreme Speed is also a great option to allow Arceus-Ghost to pick off faster revenge killers. Overheat can also be used to OHKO Skarmory.</p> <p>The only true counter to this set is Skarmory, who can take boosted hits from Arceus-Ghost all day and Whirlwind it away or hit it with Toxic. Darkrai will loathe a boosted Extreme Speed, but it can otherwise set up on Arceus-Ghost without much fear. Choice Scarf Tyranitar and Choice Band Garchomp can easily come in and put down Arceus-Ghost with a powerful Crunch or Outrage, respectively. Defensive Groudon can also survive a hit, status Arceus-Ghost, and then Roar away its boosts. Finally, Arceus can defeat this set if it has Will-O-Wisp. A defensive Groudon of your own can defeat Garchomp and Tyranitar with ease, and it can also lure in and defeat Skarmory with a surprise Overheat. A bulky Kyogre can also handle Garchomp and Tyranitar while also being capable of drowning Skarmory and Groudon with its STAB Surf. If it is carrying Sleep Talk, Kyogre can also defeat Darkrai. Choice Scarf Heracross is an excellent switch-in to Darkrai and Arceus-Dark thanks to its Dark-type resistance and its Guts ability, meaning that a Will-O-Wisp will net Heracross a power boost. Forretress can also cripple most of the above counters by setting up Toxic Spikes. It can also spin away the opponent's Toxic Spikes, which would otherwise compromise Arceus-Ghost's bulk, and it helps Forretress in return by blocking Rapid Spin.</p>"
      },
      {
        "name": "Calm Mind",
        "description": "<p>At first glance, this set may seem to be inferior to Giratina-O since it gets STAB on Dragon-type attacks, packs a lot more resistances, and boasts an immunity to Toxic Spikes. However, Arceus-Ghost has several qualities that Giratina-O wishes it had, namely higher Speed, a more powerful STAB move, and access to Recover, turning him into an extremely threatening user of Calm Mind.</p> <p>Arceus-Ghost's STAB Judgment will murder anything that does not resist it after a Calm Mind or two. STAB Ghost-type attacks are very potent in Ubers since it hits the ubiquitous Psychic-types found there for super effective damage, the most notable targets being Latias and Latios, who cannot beat this Arceus in a Calm Mind war thanks to its super effective STAB. Focus Blast destroys the Dark-, Normal-, and Steel-types that resist Judgment. Although its accuracy is pretty terrible, Arceus-Ghost has the bulk to afford it missing once or twice. Recover is the preferred option in the last moveslot to keep Arceus-Ghost alive as it gathers Calm Mind boosts. Substitute is a viable alternative, however, to give Arceus-Ghost a shield against status. Since Arceus-Ghost can also make 101 HP Substitutes, it can use the move to set up on and defeat Blissey.</p> <p>In addition to still having difficulties with Darkrai and Choice Scarf Tyranitar, Calm Mind Arceus-Ghost will lose to bulky Pokemon that can take a boosted hit or two and either KO it or cripple it with status. This includes Blissey (if Arceus-Ghost lacks Substitute), Ho-Oh, and Kyogre. Wobbuffet equipped with Tickle combined with a Pursuit user, such as Scizor, can easily trap and defeat Blissey, allowing Arceus-Ghost to go on a rampage. Scizor is also helpful in general to help check Darkrai and Tyranitar. Stealth Rock can help keep Ho-Oh in check since Arceus-Ghost naturally stops them from being spun away. A defensive Kyogre is a good teammate to help stop Ho-Oh from wrecking Arceus-Ghost with Sacred Fire, and if it has Calm Mind and Rest, it can defeat Blissey one-on-one as well. Latias and Palkia can switch in on most Kyogre sets and fry it with Thunder. Once again, Forretress is also a great teammate to provide Toxic Spikes, and it also helps clear your side of the field of entry hazards with Rapid Spin.</p>"
      },
      {
        "name": "Lead",
        "description": "<p>Arceus-Ghost's power, bulk, and speed, combined with its wide movepool allow it to be an effective lead for offensive and stall teams alike. Arceus-Ghost can defeat most other leads with ease while still being able to pose a good offensive threat later on in the match with its powerful STAB Judgment, or perhaps a defensive threat with its impressive bulk and Rapid Spin blocking abilities.</p> <p>Judgment followed by Extreme Speed will always KO Deoxys-S and Deoxys-A leads, limiting them to one entry hazard. Not even Choice Scarf Deoxys can defeat Arceus-Ghost, as Multitype grants it an immunity to Trick. Judgment also always 2HKOes Mew and Mewtwo leads, the former of which is outsped and the latter of which cannot 2HKO Arceus-Ghost unless it has Shadow Ball and Life Orb. With Recover, Arceus-Ghost can shrug off damage from leads such as Groudon, Dialga, Giratina-O, and Rayquaza, who will all eventually crumble to repeated Judgments. Extreme Speed also bypasses Shaymin-S's excellent Speed stat, allowing Arceus-Ghost to KO it before its Air Slash KOes Arceus-Ghost. Although, if Shaymin-S chooses to Seed Flare first, then unlucky Special Defense drops might force Arceus-Ghost to switch out while Flamethrower will fry lead Forretress and Scizor to a crisp. Stealth Rock can also be used instead if you need a Pokemon to set it up, but Flamethrower is generally best so Arceus-Ghost can do something to Forretress after Arceus switches in to block Rapid Spin. Flamethrower is also by far the superior choice if using a stall team.</p> <p>A Hasty nature is needed on this set so Arceus-Ghost's Extreme Speed will have sufficient power to deal with Shaymin-S leads. Despite having lower physical defense, Arceus-Ghost can still stand up to powerful hits from physical attackers such as Scizor, Heracross, and Groudon. A Speed boosting nature allows Arceus-Ghost to always outspeed lead Rayquaza and anything slower. It also enables Arceus-Ghost to outspeed all maximum Speed, positively-natured Palkia and Mew by three points, provided neither of them are holding a Choice Scarf.</p> <p>Arceus-Ghost will lose to Darkrai, Tyranitar, and Kyogre leads, so your team will need Pokemon that can deal with them. The latter is easily dealt with by Latias or Blissey thanks to their huge special defensive capabilities, while a defensive Kyogre can take on the former two. Wobbuffet can also come in on Choice Scarf Darkrai's Dark Void and just sit there until it runs out of PP and KOes itself with Struggle. However, if Darkrai turns out to be a Focus Sash lead with Nasty Plot, you will be in a massive world of pain, so watch out. If not running Flamethrower, then Forretress is also an issue, so it is recommended to have a Forretress of your own to spin away its hazards. Alternatively, you can use Magnezone to trap and KO the enemy Forretress before it causes too much trouble.</p>"
      },
      {
        "name": "Defensive Spinblocker",
        "description": "<p>This set is a more defensively oriented Arceus-Ghost that is meant for use on stall teams as a dedicated spinblocker. Even though Arceus-Ghost doesn't have a lot of resistances, it also doesn't have a lot of weaknesses, and with its great natural bulk it can wall many threats such as Scizor, Heracross, Groudon, Jirachi, Metagross, Rayquaza, some variants of Palkia, Giratina-O, and more. It also boasts Recover over Giratina and higher bulk over Giratina-O.</p> <p>Even though it isn't using a boosting move, Arceus-Ghost's STAB Judgment will still hit any Pokemon that doesn't resist it for nice damage. Arceus-Ghost can easily prevent Forretress from spinning away your team's entry hazards and burn it with Flamethrower. Recover allows Arceus to stay alive to keep walling the Pokemon mentioned above. The last slot is dedicated to a support move, and Arceus-Ghost has a wide variety of options it can choose from. Will-O-Wisp allows Arceus-Ghost to cripple physical and mixed attackers such as Scizor, Groudon, and Palkia, which can allow special walls, such as Jirachi and Blissey, to have a field day. Thunder Wave can cripple fast offensive sweepers such as Darkrai and Mewtwo. Paralysis support is also helpful for slow but powerful sweepers such as Groudon. Finally, Roar is an excellent option to shuffle around the opponent's team while spreading damage from entry hazards. It also stops Pokemon such as Kyogre from setting up on Arceus-Ghost. Stealth Rock is also usable if your team has no other Pokemon that can use it.</p> <p>A Speed boosting nature should always be used on this set. Being able to outspeed threats, such as Groudon, Rayquaza, and Palkia, and smack them with Will-O-Wisp before eating an attack is much more valuable than the small defense boost.</p> <p>As this set's main job is to stop Rapid Spin, anything that can set up entry hazards, such as Deoxys, Groudon, Dialga, and Forretress, will greatly benefit from Arceus-Ghost's presence and is a must to pair with this set. If Arceus-Ghost is carrying Will-O-Wisp, special walls such as Jirachi, Blissey, and Latias are excellent partners. With the opponent's physical and/or mixed attackers suffering from Attack-reducing burns, the opponent will be extremely hard-pressed to break these special walls who can just sit there and stall with poison or entry hazard damage.</p>"
      }
    ],
    "credits": {"writtenBy": [{"username": "Fireburn", "user_id": 29197}], "teams": [{"name": "Quality checked by", "members": [{"username": "Theorymon", "user_id": 29010}, {"username": "Jibaku", "user_id": 1779}]}, {"name": "Grammar checked by", "members": [{"username": "Zystral", "user_id": 32149}, {"username": "Oglemi", "user_id": 40358}]}]}
  },
  "Arceus-Grass": {
    "overview": "<p>The Creator dons a more soothing color when holding a Meadow Plate, and appears as though He's only the Master of zen and harmony. Don't be fooled by this welcoming appearance; the Mighty One is as quick to react to potential prey as the venus fly trap. Arceus-Grass's Judgment crushes His behemoth children, Kyogre and Groudon, and He stands as sturdy as the statuesque sequoia. Arceus-Grass may be green with envy of the defensive prowess of His other types, but He has a niche of resisting both Earthquake and Thunder. Quiver like a frail leaf in a mighty storm before the Master of the forest!</p>",
    "comments": "<h1>Other Options</h1> <p>Most of Arceus-Grass's main options have already been listed. Thunder is a usable option to hit Ho-Oh, Arceus-Grass's biggest fear. It also deals decent damage against most Steel-types and severely damages Arceus-Flying. A mono-attacking Calm Mind set is plausible due to the fact that Arceus-Grass can create 101 HP substitutes, but it is generally not recommended; this is better off left to other Arceus types due to the mediocre coverage of Grass-type Judgment.</p> <h1>Checks and Counters</h1> <p>Ho-Oh is arguably Arceus-Grass's biggest counter, as it can take the majority of its hits and threaten it with either Brave Bird or Sacred Fire. Arceus-Fire or Arceus-Flying can also come in and set up multiple Calm Minds in Arceus-Grass's face, although they have to watch out for Earth Power and Ice Beam, respectively. Scizor can come in on any set lacking Flamethrower and U-turn out, hitting for super effective damage. Skarmory and Forretress also laugh in the face of Arceus-Grass who lack Flamethrower, and can dole out Spikes as it struggles to deal any damage. Blissey fares well against most sets, and can cripple Arceus-Grass with Thunder Wave or Toxic, and repeatedly use Seismic Toss to wear Arceus-Grass down. Giratina can do well against variants not packing Ice Beam, and can either set up Calm Minds or Roar it out. Shaymin-S has trouble switching in on Thunder Wave and Ice Beams, but if it manages to switch in safely, can kill Arceus-Grass with repeated Air Slashes. Latias and Latios dislike coming in on a Thunder Wave from Support Arceus-Grass, but can come in on anything Calm Mind Arceus-Grass can throw at it, and threaten to set up a sweep with their own Calm Mind.</p>",
    "sets": [
      {
        "name": "Support",
        "description": "<p>Due to Arceus-Grass's great bulk, resistances to common attacks in Ubers, and great utility in Thunder Wave, it can pull off a defensive set with ease. Arceus-Grass possesses the ability to beat many common threats in the Uber metagame, such as Kyogre, Groudon, and Palkia. The backbone of this set however, is Thunder Wave. Arceus-Grass's Grass typing can easily scare off the Ground-types that could otherwise absorb the incoming Thunder Wave. As a result, Thunder Wave is unrestricted in a sense, which means that it can easily cripple powerful threats without fearing potential Ground-type switch-ins. Arceus-Grass can also utilize its great bulk with Recover.</p> <p>Grass Knot is preferred over Judgment for the ability to hit some of the more common Uber threats harder due to their general heavy stature. For example, with Judgement, Arceus-Grass is unable to grab the guaranteed 2HKO on most Palkia that's provided by Grass Knot. Grass Knot also has higher PP than Judgment, which will often come in handy when so many threats have Pressure for an ability. The choice in the last slot depends on what you want to hit harder. Flamethrower helps to deal with Scizor and prevents Forretress from setting up Spikes, while Earth Power hits Heatran and Arceus-Fire. Ice Beam hits Rayquaza and provides Arceus-Grass a way to damage Arceus-Flying; both of the listed Pokemon are unable to come in on a Thunder Wave. A Bold nature can also be considered in lieu of Timid, since Thunder Wave allows Arceus-Grass to outspeed most threats anyway.</p> <p>Considering Arceus-Grass's weakness to Fire-type attacks and inability to hit Steel-types (if you don't have Flamethrower), Kyogre makes an excellent partner for it. Kyogre has excellent synergy with Arceus-Grass, and can clean up the majority of its counters, such as Ho-Oh and most Steel-types. Scizor and Jirachi are also good partners to Arceus-Grass, as they are great counters against Blissey and Shaymin-S who would otherwise either cripple Arceus-Grass with a status ailment or, in Shaymin-S's case, KO Arceus-Grass with Air Slash.</p> <p>Ho-Oh is arguably this set's biggest fear, as it doesn't mind Thunder Wave, easily walls most of its attacks, and can heavily damage Arceus-Grass with a Brave Bird or Sacred Fire. Arceus-Fire or Arceus-Flying can also set up Calm Minds on Arceus-Grass and threaten it with their respective Judgment; although, they risk being crippled by Thunder Wave. Defensive variants of Heatran don't really mind Thunder Wave, and can wall most of its attacks bar Earth Power with relative ease. Should you run Earth Power in the last slot, Pokemon such as Forretress and Skarmory can rack up multiple layers of Spikes on Arceus-Grass without minding the paralysis from Thunder Wave. Scizor can also take advantage of the absence of Flamethrower and KO Arceus-Grass with U-turn.</p>"
      },
      {
        "name": "Calm Mind",
        "description": "<p>While Arceus-Grass works best as a defensive supporter, it is no slouch offensively. With its impressive bulk and pure Grass typing, Arceus-Grass has the ability to rack up a few Calm Minds before securing a sweep. Additionally, its immunity to Trick means that it won't need to worry about being crippled for the rest of the match with a Choice item. Arceus-Grass's typing isn't especially impressive offensively, particularly with the large number of Steel- and Dragon-types in the Uber metagame. However, Grass-type Judgment beats both Kyogre and Groudon at once, and allows Arceus-Grass to free up a moveslot.</p> <p>Since beating Wobbuffet is much more important for Arceus-Grass with Calm Mind, Judgment is usually the preferred option over Grass Knot. The choice of move in the last slot generally depends on which Pokemon are more important to hit. Ice Beam allows Arceus-Grass to hit Dragon-types who would otherwise force Arceus-Grass out, such as Rayquaza, Latias, and Latios, although hitting Latias and Latios is fairly less significant, since Arceus-Grass will usually lose to them anyway. Earth Power hits Heatran and Arceus-Fire, and Flamethrower hits Scizor and Forretress. Alternatively, Arceus-Grass can utilize Thunder to kill Ho-Oh and deal considerable damage against most Steel-types.</p> <p>Kyogre works well as a teammate since it gets rid of Arceus-Grass's main counters and complements it well in terms of synergy. Additionally, Pokemon such as Jirachi and Scizor help greatly against Latias and Latios and help eliminate Blissey and Shaymin-S; any of these Pokemon otherwise have a field day with Arceus-Grass. Choice Scarf Palkia and Dialga are also good alternatives to revenge kill Latias and Latios; the former also drowns Steel-types with Surf.</p>"
      }
    ],
    "credits": {"writtenBy": [{"username": "Toaster", "user_id": 36263}, {"username": "Oglemi", "user_id": 40358}], "teams": [{"name": "Quality checked by", "members": [{"username": "Fireburn", "user_id": 29197}, {"username": "Theorymon", "user_id": 29010}, {"username": "Jibaku", "user_id": 1779}]}, {"name": "Grammar checked by", "members": [{"username": "iDunno", "user_id": 38127}, {"username": "DJXO9", "user_id": 30058}, {"username": "Oglemi", "user_id": 40358}]}]}
  },
  "Arceus-Ground": {
    "overview": "<p>The divine titan stands tall above all else on the highest cliff smiting His very creation. When holding the Earth Plate, He's ready to use the earth He created against those who stand in His way. He can choose to either approach His enemies in a Calm (Mind) demeanour and crush them with brilliant dual coverage in the form of Ground-type Judgment and Ice Beam. Else He can unleash His mighty rage in the form of His universally-feared (Swords) Dance, wreaking foes with the still excellent dual coverage of Earthquake and Stone Edge. His mighty bulk, immunity to Electric-type attacks, and resistance to Stealth Rock separate Him from His other Arceus brethren. Whilst very few can resist His awesome two-move coverage, He's prone to some common special attacks, mainly Surf and Ice Beam. But those who try to use such attacks against, as well as any other foe, should never underestimate the power of the titan whose very footsteps make the world shake.</p>",
    "comments": "<h1>Other Options</h1> <p>Thanks to Arceus-Ground's huge movepool, options for it are almost unlimited. The most important thing is to make sure it's not outclassed by Garchomp or Groudon. Arceus-Ground can stall fairly efficiently with Substitute and Recover alongside Will-O-Wisp or Toxic, but this is generally better left to other Pokemon. Roar is also a decent option when used in conjunction with multiple entry hazards to rack up damage and prevent set up. Arceus-Ground also has access to Light Screen and Reflect, but usually Lugia and Deoxys-S can do a better job at that. Rest + Sleep Talk is also a viable option as it can be used to function as a status absorber.</p> <h1>Checks and Counters</h1> <p>Arceus-Ground is plagued by weaknesses to common types. Luckily, Arceus-Ground has something no other Ground-type has with its 120/120/120 defenses, which limits its counters to a degree. The best, and probably most reliable counter to Arceus-Ground, is Choice Scarf Kyogre; with its high-powered rain-boosted STAB Water Spout it still has a chance to OHKO Arceus-Ground after two Calm Minds with Stealth Rock in play. It also has the advantage in Speed, forcing one to predict an incoming Kyogre to weaken the damage Water Spout does. Calm Mind Latias is also a reliable option for countering Arceus-Ground; with her natural bulk and high Special Attack, a boosted Grass Knot will spell doom for Arceus-Ground. Arceus-Water, Arceus-Grass, and Arceus-Ice are also decent counters, but Arceus-Grass should be wary of switching into Ice Beam. Other than the aforementioned Pokemon, counters are few and far between for this earthy behemoth.</p>",
    "sets": [
      {
        "name": "Calm Mind",
        "description": "<p>Arceus-Ground is one of the only Ground-type Pokemon who is able to boost its Special Attack - the other one being Claydol. Arceus-Ground's naturally high Speed allows it to outspeed all positively-natured base 100 Speed Pokemon with a Timid nature and 100 Speed EVs. Arceus-Ground also resists Stealth Rock, a valuable asset in any metagame. Thanks to its naturally high bulk, Arceus-Ground can find many opportunities to get a Calm Mind or two and proceed to sweep. Arceus-Ground is also one of the most reliable Dialga counters thanks to its STAB Ground-type attacks and great bulk, while Dialga rarely carries an attack super effective against it.</p> <p>Ground- and Ice-type attacks are all Arceus-Ground needs to be effective in Ubers, hitting everything but the odd Bronzong for at least neutral damage. However, it does have a few other options. For instance, one may utilize Substitute to run a SubCM set which can scout for counters and make setting up easier, as well as blocking status such as Toxic and Will-O-Wisp. Thunder can also be used in place of Ice Beam to hit things such as Ho-Oh and Lugia harder, as well as score a super effective hit on Kyogre, but Arceus-Ground will lose its only way of harming the Lati twins, Latios and Latias.</p> <p>Arceus-Ground's biggest problems are Pokemon that outspeed it. Therefore, a revenge killer like Wobbuffet is important to take out these threats. Choice Scarf Kyogre is a huge threat to Arceus-Ground because Water Spout will do a significant amount of damage to Arceus-Ground, even after a Calm Mind. For this reason, entry hazard support such as Toxic Spikes and Stealth Rock are very important as they will wear down common switch-ins and help to weaken Kyogre. By extension of this, spinblockers, such as Giratina and Giratina-O, make excellent teammates. Latios and Latias, especially the latter, are also very dangerous to Arceus-Ground. Calm Mind Latias can take an Ice Beam or two from Arceus-Ground and do major damage with Grass Knot. Bronzong utterly walls this set, but needs Toxic or Explosion to do anything to back to Arceus-Ground. Ho-Oh can also wall this set if Stealth Rock isn't in play.</p>"
      },
      {
        "name": "Swords Dance",
        "description": "<p>Much like every other Arceus type, Arceus-Ground can run an efficient Swords Dance set. Normally a Ground-type Swords Dance Pokemon would seem to be outclassed by Garchomp with its higher Speed, due to Arceus-Ground's EV restrictions, or Groudon with its higher HP and Defense. However, Arceus-Ground has a few things over these Pokemon. It lacks the 4x weakness to Ice-type moves and weakness to Dragon-type moves that Garchomp has, and it has higher Special Defense and Speed than Groudon. In addition to this, it has Recover, which prolongs its sweep. Earthquake + Stone Edge offers extraordinary coverage, resisted by only 6 Pokemon in the entire game, only a couple of which are commonly seen in Ubers. A Jolly nature is used for the same reason as Timid is in the above set, to outpace positively-natured base 100 Speed Pokemon.</p> <p>Substitute is an option over Recover in the last slot if you are worried about status or Intimidate. It also allows Arceus-Ground to scout for its counters more easily. Extreme Speed can also be used in the last slot to pick off faster weakened opponents, such as Darkrai or Scarfers, and outspeed Custap users who are looking to take you out with Destiny Bond or Explosion. Thanks to Arceus-Ground's natural bulk and Recover, it can take on Dialga really well, being immune to Thunder and having the ability to Recover off Draco Meteors and Outrages.</p> <p>As with every other Swords Dance user in the game, Stealth Rock and other entry hazards are important for Arceus-Ground for turning 3HKOs into 2HKOs and 2HKOs into OHKOs. Forretress makes a great partner with its bulk and resistances to Grass- and Ice-type attacks. Choice Scarf Kyogre is one of Arceus-Ground's biggest counters. Because of this, Quagsire is a great teammate for Arceus-Ground because it can take on any variant of Kyogre one-on-one. Palkia and even Kyogre are also great teammates because of their ability to revenge kill and take common Ice- and Water-type attacks; however, beware when using Kyogre of the Grass-type weakness it shares with Arceus-Ground. Bronzong, once again, can take on this set as well, but will need Toxic or Explosion to threaten Arceus-Ground.</p>"
      }
    ],
    "credits": {"writtenBy": [{"username": "Alan", "user_id": 43880}, {"username": "Darkmalice", "user_id": 23736}], "teams": [{"name": "Quality checked by", "members": [{"username": "Jibaku", "user_id": 1779}, {"username": "Fireburn", "user_id": 29197}]}, {"name": "Grammar checked by", "members": [{"username": "viol and bass", "user_id": 35513}, {"username": "Oglemi", "user_id": 40358}]}]}
  },
  "Arceus-Ice": {
    "overview": "<p>With the attachment of the Icicle Plate the Creator has turned frigid and exhausted His attachment to the world around Him. With cold-hearted eyes Arceus gazes over His ruinous creation and declares an omnipotent, hyperborean Judgment on all Pokemon who tremble before Him, devastating the terrain and leaving behind only a petrified tundra. While this glacial visage of Arceus cannot boast the same defensive typing that others can, it can boast one of the most offensive forms this divine creature can take. Stand before this majestic beast if you dare, but if you do not have a will of steel prepare to be eradicated.</p>",
    "comments": "<h1>Other Options</h1> <p>Ice Beam can replace Judgment. While this change reduces the damage output, it does give Arceus-Ice a 10% chance to freeze the opponent's Pokemon in any weather but sun. Even though the damage change seems minimal, Judgment is still recommended over Ice Beam because it has a higher chance of obtaining some important OHKOs and 2HKOs. For example, Judgment gives Arceus-Ice a ~30% higher chance to OHKO Latias and Giratina after 1 Calm Mind (factoring Stealth Rock damage), while also guaranteeing an OHKO on Latios after 1 Calm Mind without Stealth Rock damage. Judgment also allows Arceus-Ice to 2HKO Wobbuffet ~98.9% of the time after Stealth Rock, as well as giving Arceus-Ice a ~25% chance to 2HKO without Stealth Rock, something Ice Beam cannot do. While the 10% chance to freeze is tempting, Judgment is still recommended as Arceus-Ice's primary choice.</p> <h1>Checks and Counters</h1> <p>Without Flamethrower or Earth Power, Arceus-Ice is easily countered by Steel-type Pokemon. There are some Steel-type Pokemon that can counter Arceus-Ice even when it runs Flamethrower or Earth Power. Thanks to Choice Scarf Jirachi's Speed, it can easily outrun Arceus-Ice and hit it with Iron Head. While Iron Head is a 3HKO without Stealth Rock, Iron Head can cause Arceus-Ice to flinch and Arceus-Ice can only OHKO in return with Flamethrower in the sun. If Arceus-Ice is not running Flamethrower, all Uber Scizor sets are at best 2HKOed by +1 Thunder, while the Choice Band, Swords Dance, and Trapper sets can all 2HKO Arceus-Ice with Bullet Punch. Without Earth Power, all Heatran sets walk right over Arceus-Ice, taking anything Arceus-Ice can throw at it and retaliating with Flamethrower. Without Flamethrower, Bronzong can take Judgment and Thunder, while being immune to Earth Power and being able to 2HKO with Gyro Ball. Other than Steel-types though, there are only a few Pokemon that give Arceus-Ice trouble. Arceus-Ice is only able to beat Ho-Oh in the rain. In any other weather Ho-Oh can do 90.1% - 106.4% to Arceus-Ice with Sacred Fire, while Arceus-Ice has no reliable move to hit back with. In the rain however, Sacred Fire only does 49.5% - 58.4% and Arceus-Ice can 2HKO with Thunder. Without Substitute, Blissey can outstall Arceus-Ice with Toxic and Wish / Soft-Boiled.</p>",
    "sets": [
      {
        "name": "Calm Mind",
        "description": "<p>With no strong physical STAB move and Ice's weaknesses to common attacking types (Rock-, Fighting-, and Fire-type moves), a special sweeper set is the best option for Arceus-Ice. Despite its weaknesses, Arceus-Ice's great offensive typing and access to Judgment and Thunder give it the ability to be a very potent special sweeper. With its natural bulk, Arceus-Ice can take hits pretty well despite its horrible defensive typing. Its stats and EVs also allow this Arceus-Ice to hit a Speed of 331, allowing it to outrun positively-natured Base 100 Pokemon. However, the true beauty of this Arceus-Ice is in its Judgment, which with the Icicle Plate attached becomes a 180 BP Ice move (factoring in STAB and Icicle Plate boost) that hits 14 Uber Pokemon for super effective and is resisted by only six. Add Thunder to the set and you get the BoltBeam combo that has perfect neutral coverage except for against Lanturn, Magnezone, and Shedinja. Add the ability to boost Special Attack and Special Defense simultaneously and a reliable recovery move and you have an excellent late-game sweeper.</p> <p>While this set maybe seem to be outclassed by other Arceus-Ice due to its poor defensive typing and weakness to Stealth Rock, it has several important jobs it can do. It has the ever prominent BoltBeam combo, while the only other Arceus-Ice who can pull BoltBeam off as successfully is Arceus-Electric. Unlike Arceus-Electric, it is also among one of the few Calm Mind Arceus sets that is able to beat the Lati twins when fought one-on-one.</p> <p>The EVs given may look a bit strange, but they are the best we can currently give Arceus-Ice. The only Arceus that can legally be obtained is the MICHINA/TRU Arceus that comes at level 100. The only way to EV train a level 100 Pokemon is through Vitamins, so Arceus-Ice can only have EVs that are multiples of 10 to a maximum of 100 in any particular stat. While this would cripple any normal Pokemon, Arceus-Ice can survive with this EV restriction due to its incredibly high Base Stats. While this does hinder its abilities somewhat, a positive nature and 100 EVs in Speed allows Arceus-Ice to outspeed positively-natured Base 100 Pokemon. The distribution of 100 EVs to all of its stats also gives Arceus-Ice reasonable bulk to add to its outstanding 120/120/120 defenses to add onto everything else Arceus-Ice has to offer.</p> <p>The biggest obstacle for Arceus-Ice is the amount of Steel-type Pokemon in the Uber metagame who can wall Arceus-Ice thanks to their resistances to Ice, Dragon, and Ghost. The many lower tier Steel-types being brought up to Ubers to fend off the raging onslaught of Dragon-types that overrun the metagame can also easily stop Arceus-Ice in its tracks. Not only can Arceus-Ice not hit Steel-types as hard, but also it is weak to Steel-type moves. The most dangerous of these for Arceus-Ice is Bullet Punch, whose priority allows Pokemon to bypass Arceus-Ice's Speed and heavily damage him despite his considerable bulk.</p> <p>Earth Power or Flamethrower can be used instead of Recover to make a Calm Mind + 3 Attacks set. Both will give Arceus-Ice coverage against Steel-types, but each has its pros and cons. Flamethrower gives Arceus-Ice the ability to handle Scizor and Forretress, whereas Earth Power allows Arceus-Ice to handle Heatran. Earth Power is a reliable attack regardless of weather, whereas Flamethrower is hindered greatly by rain. If you choose to use Calm Mind + 3 attacks with Kyogre on your team, it is often safer to use Earth Power.</p> <p>Substitute or Refresh can be used over Thunder to make a mono-attacking Arceus-Ice. With its HP Stat of 406 Arceus-Ice makes 101 HP Substitutes, allowing it to take Seismic Toss without the Substitutes being broken. Refresh allows Arceus-Ice to get rid of any status and does not cost the 101 HP that Substitute does. Both of these allow you to beat Blissey one-on-one, as they prevent Arceus-Ice from being crippled by status as it sets up Calm Mind. While Ice is not the best defensive typing, Arceus-Ice's natural bulk and the combination of Calm Mind, Substitute / Refresh, and Recover let it be much harder to KO. Also, Ice is one of the best mono-attacking types you can use, especially in Ubers. When doing this, though, it is more important than ever to be rid of Steel-types because they will wall Arceus-Ice completely.</p>"
      }
    ],
    "credits": {"writtenBy": [{"username": "Ditto", "user_id": 10012}], "teams": [{"name": "Quality checked by", "members": [{"username": "Fireburn", "user_id": 29197}, {"username": "bojangles", "user_id": 20796}]}, {"name": "Grammar checked by", "members": [{"username": "jc104", "user_id": 38600}, {"username": "Draco Zephyr", "user_id": 29682}]}]}
  },
  "Arceus-Poison": {
    "overview": "<p>The Creator oozes with the scum and filth He has deemed you to be in His toxic form. The might of the pestilential deity lays waste to His victims faster than the deadliest of plagues. While the goopy master cannot scratch the hide of His Steel nemeses with His divine Judgment, nor is He a friend of the Psychic- and Ground-types He hath created, His viscous hide protects Him from even the most powerful of onslaughts. The venomous creator even consumes all forms of Toxic and Toxic Spikes in His mighty gullet when He enters the battlefield. Bow before your corrosive maker!</p>",
    "comments": "<h1>Other Options</h1> <p>Flamethrower or Ice Beam can be used over Focus Blast on the Calm Mind set, but the coverage Focus Blast gives is significantly better. Sludge Bomb is a possibility over Judgment if you really want to poison your opponent, but the power loss is rather significant.</p> <p>For the Support set, Judgment can be used over Ice Beam or Flamethrower if you really desire a STAB move, but having a Poison-type move as your only attack is very suboptimal considering the abundance of Steel-types in Ubers. Thunder Wave or Toxic can be used over Will-O-Wisp, but Will-O-Wisp's ability to cripple Arceus-Poison's biggest threats in Groudon and Garchomp makes it a great choice.</p> <h1>Checks and Counters</h1> <p>Groudon is the best counter for Arceus-Poison; the standard Rock Polish Groudon will always OHKO Arceus-Poison with Earthquake, unless you are running the Support set and are able to burn it. In a similar manner, Garchomp can pose a threat if Arceus-Poison lacks Ice Beam or Will-O-Wisp, as Choice Scarf Garchomp will 2HKO it with Earthquake. Heatran and other Steel-types are a pain for Arceus-Poison because it will have to rely on Focus Blast's shaky accuracy in order to take care of them. Arceus-Steel deserves a special mention because not only can it Calm Mind along with Arceus-Poison, but it could also use Roar to phaze your Arceus-Poison out, putting you in a real tough spot.</p>",
    "sets": [
      {
        "name": "Calm Mind",
        "description": "<p>Poison is a notoriously bad offensive typing, it is resisted by 4 types, not including Steel-types being immune to it, while only hitting Grass-types super effectively. However, Arceus-Poison has its place in the Ubers metagame, due to its ability to absorb Toxic Spikes and its immunity to Poison. Therefore, it can set up on Blissey with impunity, fearing only Thunder Wave. Apart from absorbing Toxic Spikes, this set plays identical to almost every other Arceus Calm Mind set.</p> <p>Focus Blast is recommended in the second slot due to its ability to hit Steel-types immune to Judgment for super effective damage. However, there are a couple of other options: notably Flamethrower and Ice Beam. Flamethrower hits some of the Steel-types for super effective damage, except that you lose the ability to hit Dialga hard and Heatran is now immune to both of your moves. Ice Beam, on the other hand, trades the ability to hit Steel-types for the ability to hit the plethora of Dragons in Ubers for super effective damage, most notably Giratina, who resists Judgment with its part-Ghost typing. Sludge Bomb is also a possibility over Judgment if you are enamored with the 30% chance of poisoning your opponent, but the loss in power is noticeable to the point where at +6, you have a small chance to not even 2HKO Ubers Soft-Boiled Blissey.</p> <p>Arceus-Poison greatly appreciates Groudon being out of the picture before it attempts to sweep. The standard Rock Polish Groudon will always OHKO Arceus-Poison with Earthquake, while you need 2 Calm Minds under your belt to OHKO it with Ice Beam, and need 5 Calm Minds to guarentee an OHKO with Focus Blast. A Latios or Latias with Grass Knot can deal with any Groudon, fearing only Dragon Claw. Alternatively, Lugia can be used as a defensive counter. Wobbuffet is a great teammate for Calm Mind Arceus-Poison, as with Encore, it can almost guarantee a free Calm Mind for Arceus-Poison while your opponent switches out. Also, Wobbuffet greatly appreciates the Toxic Spikes removal that Arceus-Poison provides. If Ice Beam is chosen over Focus Blast, Magnezone makes a great teammate, trapping and killing off the Steel-types that wall you.</p>"
      },
      {
        "name": "Support",
        "description": "<p>The main draw to using Arceus-Poison is to support the team by removing Toxic Spikes, so it's only natural to utilize its potential as a team supporter. With 406 HP and 301 defenses, access to a reliable healing move in Recover, and fantastic support moves, Arceus-Poison can fill this role very well. Will-O-Wisp is a great move that helps Arceus-Poison and the rest of its team against physical attackers, while the final slot either prevents your opponent from setting up, or turns Arceus-Poison into an impregnable wall.</p> <p>Will-O-Wisp is the preferred status move, although Toxic and Thunder Wave both have their merits. However, Will-O-Wisp's ability to soften hits from Groudon, who would otherwise stomp all over Arceus-Poison makes it the better choice. Ice Beam's utility and coverage in Ubers makes it the primary choice for an attack, but Flamethrower is also an option, especially if you choose Toxic or Thunder Wave, as it still gives you a chance at burning Groudon and other physical attackers.</p> <p>Since you are likely using Arceus-Poison for its ability to absorb Toxic Spikes, it is very hard to \"counter.\" However, there are some Pokemon that are especially disruptive to your supportive efforts: Mewtwo, Heatran, and Groudon. Taunt + Calm Mind Mewtwo is a real problem for Support Arceus-Poison, as Arceus-Poison would be forced to either fire very weak Ice Beams or switch out. A great way of dealing with Mewtwo is Giratina-O, whose Shadow Sneak can wear down Mewtwo rather quickly. If you choose Cosmic Power for your final moveslot, Heatran will wall you, so you will need something like Garchomp to take care of it with a powerful Earthquake. Forretress or Skarmory make great teammates for Support Arceus-Poison, as it will be forcing a lot of switches, which you can take advantage of by laying down entry hazards of your own. If necessary, Arceus-Poison can use Stealth Rock in the last slot, but since it has much better things to do than that, this is not recommended. Finally, with Arceus-Poison crippling physical attackers with Will-O-Wisp, Blissey is safe to take the remaining special attackers on.</p>"
      }
    ],
    "credits": {"writtenBy": [{"username": "timetwister", "user_id": 34073}, {"username": "Oglemi", "user_id": 40358}], "teams": [{"name": "Quality checked by", "members": [{"username": "bojangles", "user_id": 20796}, {"username": "Fireburn", "user_id": 29197}]}, {"name": "Grammar checked by", "members": [{"username": "Fatecrashers", "user_id": 14288}, {"username": "Komodo", "user_id": 26964}]}]}
  },
  "Arceus-Psychic": {
    "overview": "<p>Once upon a glorious first generation, Psychic-types were the dominant force of the metagame, with virtually zero weaknesses, and a powerful STAB that made all cower in fear. Truly, had Arceus-Psychic chosen to reveal Himself at that time, He would have been the mightiest among gods. But alas, it was not to be, for Arceus-Psychic appears instead in a time when His own devious Dark- and Steel-type creations run rampant, placing His very survival in jeopardy. Competition from other Psychic-types also threatens to overshadow the prowess of Arceus-Psychic; the mighty Mewtwo, born of the technologies of mere mortals, actually completely beats Arceus-Psychic on the offensive front; while Lugia, the harbinger of tempests and halcyon winds alike, surpasses even its creator in defensive ability. Arceus-Psychic is unquestionably formidable, but whether He can make an impact against so many others remains to be seen.</p>",
    "comments": "<h1>Other Options</h1> <p>If it wasn't made clear enough, Arceus-Psychic is heavily outclassed in many roles. In fact, the only reason a Calm Mind set is there is because every analysis needs at least one set. Despite being overshadowed, however, Arceus-Psychic can pull off Swords Dance and RestTalk sets successfully; just know that Pokemon such as Arceus-Ghost, Arceus-Dark, Garchomp, Rayquaza, Groudon, and Lucario; and Arceus-Steel, Arceus-Ghost, Giratina-O, and Kyogre; respectively, are probably better candidates for the job.</p> <h1>Checks and Counters</h1> <p>Most Calm Mind users give Arceus-Psychic a hard time, as his poor STAB and typing allow many to beat him in a Calm Mind war with a simple type advantage. Latias and Lugia, in particular, give him the most trouble, as their huge Special Defense stats, resistances to both Psychic and Fighting, and access to Recover allow them to take everything Arceus-Psychic can throw at them and eventually come out on top. Non-Calm Mind Lugia can also deal with Arceus-Psychic by taking a hit and phazing it out with Whirlwind. Choice Band Scizor can take most boosted attacks (besides Flamethrower / Fire Blast), U-turn out, and leave Arceus-Psychic weak enough to be KOed by most things. Darkrai outspeeds Arceus-Psychic, and can put him to sleep with Dark Void or smack him with Dark Pulse before he can do anything. Wobbuffet can Encore Calm Mind or even Mirror Coat Shadow Ball to beat Arceus-Psychic. Specially defensive Tyranitar can take a +1 Focus Blast if it has to, and then weaken Arceus-Psychic with STAB Crunch.</p>",
    "sets": [
      {
        "name": "Calm Mind",
        "description": "<p>Arceus-Psychic, like every other Arceus forme, can be an excellent Calm Mind user. Funnily enough, this ultimately comes back to bite him, as he is often considered outclassed by Arceus-Dark and Arceus-Ghost, both of whom sport significantly better STAB, as well as Arceus-Steel, who has a better defensive typing and can beat Blissey one-on-one. Additionally, Latias, Latios, Kyogre, Mewtwo, Lugia, and Giratina-O are also usually referred to as \"better\" Calm Mind users, for their own reasons. This draws much from Arceus-Psychic's appeal, but he's still completely viable.</p> <p>Judgment is the same great, effectively 120 Base Power STAB move that all Arceus formes share. Following it, Focus Blast covers Steel- and Dark-types, hitting both super effectively, but leaves Arceus-Psychic open to opposing Psychic-types. Conversely, Shadow Ball will hit Psychic-types super effectively, but leave Arceus-Psychic open to Steel- and Dark-types. Finally, Recover is what sets Arceus-Psychic apart from most other Calm Mind users--who can only rely on Rest for healing--by giving it a reliable recovery move with which it can take advantage of its bulk.</p> <p>Fire Blast or Flamethrower can be a decent secondary attacking move, getting reliable coverage on Steel-, Dark-, and Psychic-types, but losing out on Tyranitar. Ice Beam is also usable for its harder hit on Dragon- and Flying-types, although STAB Judgment hits most for about equal damage, while Latias and Latios are both bulky enough specially to avoid being 2HKOed by it. The EVs are such because the only legally obtainable Arceus is received at Lv. 100, meaning he caps out at 100 EVs per stat (with Vitamins). Therefore, the best way to EV Arceus-Psychic is to put 100 EVs in each stat, except for the one which is least useful, here being Attack. A Timid nature is used so that Arceus-Psychic can still outspeed base 90 and 95 Speed Pokemon, many of which are prominent in Ubers.</p> <p>Latias can handle every other Calm Mind user that can set up on Arceus-Psychic with its own Calm Mind set, but shares, along with team role, Dark-, Ghost-, and Bug-type weaknesses with Arceus-Psychic. Lucario has a 4x resistance to both Bug- and Dark-type attacks, allowing it to set up on Pursuits, Crunches, Megahorns, and other such things aimed at Arceus-Psychic, or just hit hard off the bat with Close Combat. Darkrai causes problems for this set, so a RestTalk or Choice Scarf user such as Kyogre or Heracross would be nice. Finally, Magnezone can trap and KO Steel-types, who would wall Arceus-Psychic if you opt for Shadow Ball.</p>"
      }
    ],
    "credits": {"writtenBy": [{"username": "tripe", "user_id": 25051}, {"username": "Aeron Ee1", "user_id": 42173}, {"username": "Fatecrashers", "user_id": 14288}], "teams": [{"name": "Quality checked by", "members": [{"username": "firecape", "user_id": 46442}, {"username": "Fireburn", "user_id": 29197}, {"username": "Jibaku", "user_id": 1779}]}, {"name": "Grammar checked by", "members": [{"username": "Calm Pokemaster", "user_id": 42777}, {"username": "TelamonianAjax", "user_id": 72666}]}]}
  },
  "Arceus-Rock": {
    "overview": "<p>The Creator rises out of the depths of the earth and takes on the very qualities of the rocks themselves, from the hardest obsidian to the smoothest alabaster. Sharp stones rain upon the hides of all those who dare oppose the mineral deity, as summoning the might of Gaia is but a trifle for this incarnation of Arceus. Those weak of faith will have you believe that Arceus-Rock is prone to too many elements and thus an inferior forme, but rest assured that once He harnesses a few boosts, the Creator shall exact His revenge upon all. Underestimate Him at your own peril.</p>",
    "comments": "<h1>Other Options</h1> <p>Refresh allows Arceus-Rock to rid itself of status effects such as poison and paralysis, which could hinder a sweep. Arceus-Rock can also spread poison around with Toxic, but it's generally inferior to just attacking. Roar can allow Arceus-Rock to be an efficient phazer while wearing down its counters, and also gives Arceus-Rock a chance to win in a Calm Mind war when facing Latias or Latios. If Arceus-Rock uses Roar, entry hazard support is necessary to make the most of its phazing ability. Reflect and Light Screen can be used to support teammates, but there are better dual screen users, especially given that Arceus-Rock cannot carry Light Clay. Arceus-Rock can also use Perish Song to put a timer on Calm Mind users that think they can set up, and can also force switches to rack up entry hazard damage.</p> <h1>Checks and Counters</h1> <p>Arceus-Rock has quite a few counters that can stop it cold. Garchomp outspeeds Arceus-Rock and can hit it with a super effective STAB Earthquake. Choice Scarf Kyogre can switch in and use Water Spout or Surf to devastating effect. Physically defensive Skarmory can phaze Arceus-Rock away after taking a considerable portion of damage from Stone Edge. Scizor can Bullet Punch Arceus for a large amount of damage. Arceus-Fighting resists Arceus-Rock's STAB moves and hits it with its Fighting-type Judgment. While Shaymin-S can't switch in, its STAB Seed Flare does an enormous amount of damage.</p>",
    "sets": [
      {
        "name": "Calm Mind",
        "description": "<p>Like all Arceus formes, Arceus-Rock can run a very threatening Calm Mind set. Arceus-Rock is also one of the few Arceus formes that can beat Ho-Oh with a Calm Mind set, thanks to its Rock-type Judgment. However, due to its weaknesses to common types such as Water, Ground, and Fighting, Arceus-Rock can't tank hits very well. Despite this, with Calm Mind, Arceus-Rock is still an offensive threat. Arceus-Rock's +1 Grass Knot always OHKOes offensive Groudon, and OHKOes support Groudon, who would otherwise stop Arceus-Rock cold, after a little prior damage.</p> <p>Calm Mind is the crux of the set, allowing Arceus-Rock to boost its Special Attack and Special Defense. Judgment is obviously the primary attacking move, thanks to STAB, and though it may seem weak at first, Arceus-Rock can easily obtain multiple Calm Mind boosts with its great bulk and Recover. Arceus-Rock has two main options for the last spot: Grass Knot and Substitute. Grass Knot is used to hit Groudon and Kyogre for super effective damage, while Substitute is used to block status, allowing Arceus-Rock to beat Blissey. Ice Beam can be used over Grass Knot to score an OHKO on Garchomp, while still hitting Groudon hard, but Arceus-Rock will have problems with bulky Kyogre. Fire Blast can also work over Grass Knot to hit Steel-types for super effective damage while still doing respectable damage to Groudon.</p> <p>Latios and Latias can outpace Arceus-Rock and will win in a Calm Mind war. Scizor can be used to remedy that, with its decent Special Defense and access to U-turn and Pursuit. Tyranitar is another answer to Latios and Latias, also providing sandstorm support to boost Arceus-Rock's Special Defense. Garchomp can outspeed Arceus-Rock and can hit with a super effective STAB Earthquake, so recommended partners would include Skarmory, which can wall Garchomp while also setting up entry hazards to aid Arceus-Rock. Choice Scarf Kyogre can switch in and use Water Spout or Surf to devastating effect, and bulky Kyogre can pose a threat even though it takes a hefty 61.3% - 72.3% from a boosted Grass Knot. Latios and Latias can take Water-type attacks from Kyogre aimed at Arceus-Rock, so they can make good teammates. Specially defensive Skarmory can phaze Arceus-Rock away, but it will take a big hit from Judgment. Wobbuffet lets Arceus-Rock set up more easily while trapping Scarfed Pokemon who attempt to KO Arceus-Rock as well. Dual screens can also aid in setting up, allowing Arceus-Rock to obtain multiple Calm Mind boosts with ease. Spikes and Stealth Rock can help secure some KOs, so a user of entry hazards is recommended. Forretress and Skarmory do the job, and Forretress can use Rapid Spin to remove the opponent's entry hazards. Both of these Pokemon make excellent choices, since Arceus-Rock can switch into the Fire-type attacks aimed at them. Scizor has Bullet Punch, making it a threat to Arceus-Rock even though Arceus-Rock can hit it for plenty of damage. Partners such as Dialga and Heatran can easily switch into Bullet Punch and immediately threaten Scizor. Arceus-Fighting and Lucario both resist Arceus-Rock's Judgment and can hit it with their respective STAB attacks. Giratina-O can switch into these Fighting-type moves without worry thanks to its immunity. While Shaymin-S can't switch in, its STAB Seed Flares do an enormous amount of damage even after a Calm Mind boost. In addition, Blissey can counter this set should Arceus-Rock not use Substitute.</p>"
      },
      {
        "name": "Swords Dance",
        "description": "<p>Arceus-Rock has the potential to be a menacing Swords Dance sweeper. Stone Edge and Earthquake offer excellent coverage together, hitting nearly every Pokemon in the metagame for at least neutral damage. A Jolly nature is needed to outpace positive base 90 Speed Pokemon and lower.</p> <p>Swords Dance boosts Arceus-Rock's attack to huge levels, while Stone Edge is the main attack as it receives STAB. Stone Edge's damage output may seem lackluster at first, but Arceus-Rock's bulk and access to Recover allows it to obtain multiple Attack boosts with Swords Dance. Earthquake rounds off its near-perfect coverage by hitting most Pokemon who resist Stone Edge. Extreme Speed is a good option as it allows Arceus-Rock to pick off faster Pokemon, while Recover can be used in the same spot in order to increase longevity. The last option to consider is Overheat, which can be used to fry Skarmory and Forretress, who can otherwise take several hits and lay down hazards.</p> <p>Garchomp poses a threat as it outspeeds Arceus-Rock and deals serious damage with STAB Earthquake. Skarmory makes a great teammate, as it can switch into any of Garchomp's attacks, and provide much-appreciated entry hazard support. Choice Scarf Kyogre can outspeed and OHKO Arceus-Rock with Water Spout or Hydro Pump, although it can't switch in, as it is 2HKOed by a combination of Stone Edge and Extreme Speed. Physically defensive Skarmory can phaze Arceus-Rock after taking a considerable portion of damage from Stone Edge. Wobbuffet aids setting up and can trap Scarfed Pokemon that attempt to revenge kill Arceus-Rock. Dual screen support can make set-up even easier, allowing Arceus-Rock to stomach powerful hits and set up Swords Dance with ease. Entry hazards can help secure some extra KOs that are normally out of reach. Skarmory or Forretress can accomplish this nicely, the former walling Garchomp, while the latter provides Rapid Spin support. Arceus-Rock can take Fire-type attacks aimed at either of the aforementioned Pokemon, preventing them from being roasted. Scizor can easily revenge kill Arceus-Rock with STAB Technician-boosted Bullet Punch, although it can't switch in as it is KOed by a boosted Stone Edge after Stealth Rock damage. Partners such as Dialga and Heatran can easily switch into Bullet Punch and immediately threaten it.</p>"
      },
      {
        "name": "Mixed",
        "description": "<p>This set takes a more unusual approach to using Arceus-Rock. Many common switch-ins to will struggle to deal with this set. For Instance, Kyogre and Groudon, Arceus-Rock's two most common switch-ins, are hit very hard by Grass Knot. A Speed-boosting nature is needed to outpace positive base 90 Speed Pokemon and anything slower.</p> <p>Stone Edge is the primary move due to STAB, and it hits many common Pokemon in the Uber environment for super effective damage. Fire Blast is used in order to hit Steel-types who resist the rest of Arceus-Rock's moves. Earthquake is also an option to hit harder in the rain, but it causes Arceus-Rock to struggle with Bronzong, Skarmory, and Forretress. Recover is used in the last spot into increase longevity. Dragon Claw can also be used in place of Stone Edge for a 100% accurate move to use against Dragon-type Pokemon, while also hitting Palkia and Dialga for more damage than Stone Edge. However, without Stone Edge, Pokemon such as Shaymin-S, Lugia, and especially Ho-Oh have a much easier time with Arceus-Rock.</p> <p>Garchomp is problematic because it can outspeed Arceus-Rock and hit it with STAB Earthquake. Skarmory is a great fix to the problem thanks to its amazing Defense stat and typing, which lets it resist Garchomp's dual STAB. Choice Scarf Kyogre can revenge kill Arceus-Rock with Water Spout or Surf for an OHKO. Latios and Latias can take any attack aimed at Arceus-Rock from a Kyogre, barring Ice Beam. Wobbuffet can trap and eliminate Pokemon that pose a threat to Arceus-Rock. Spikes and Stealth Rock support can weaken Pokemon upon switching in and make it easier for Arceus-Rock to take them out. Forretress and Skarmory fit the bill nicely, with Forretress providing Rapid Spin support and Skarmory being able to wall Garchomp. Arceus-Fighting resists Arceus-Rock's Stone Edge and can KO it with STAB Fighting-type Judgment. Giratina-O makes a good check to Arceus-Fighting thanks to its Ghost typing. While Shaymin-S can't switch on Arceus-Rock fearing a Stone Edge, its STAB Seed Flare does a huge amount of damage.</p>"
      }
    ],
    "credits": {"writtenBy": [{"username": "Megan_Fox", "user_id": 42019}, {"username": "Fatecrashers", "user_id": 14288}], "teams": [{"name": "Quality checked by", "members": [{"username": "bojangles", "user_id": 20796}, {"username": "Fireburn", "user_id": 29197}]}, {"name": "Grammar checked by", "members": [{"username": "cosmicexplorer", "user_id": 52295}, {"username": "Nix_Hex", "user_id": 40064}]}]}
  },
  "Arceus-Steel": {
    "overview": "<p>Gaze before the metallic sheen of the omnipotent Arceus-Steel. Of all of Arceus's many faces, this is by far the most resilient. His immunity to the dreaded poison, numerous resistances to the elements, and ability to resist the mighty Dragon's lance make Arceus-Steel a formidable opponent indeed. With His ability to stand firm as an unmoving wall from the heavens or attack with the divine might of a thousand stars, Steel Arceus can be godly on every team. Do not underestimate His wrath, for thou shalt be smote into nothing more than a pile of ash, unworthy to see the glow of one of Arceus's mightiest forms.</p>",
    "comments": "<h1>Other Options</h1> <p>Earth Power on the Calm Mind set can be useful against Heatran, but it leaves Arceus open against Kyogre. It also lacks Roar's and Iron Defense's utilities. Ice Beam can work over Judgment on the Calm Mind set to OHKO Garchomp, Rayquaza, and Shaymin-S, but Judgment is generally better as it hits Pokemon that are neutral to Ice Beam and Thunder (such as Wobbuffet, Darkrai, and Mewtwo) for greater damage. Furthermore, a neutral Judgment is nearly as powerful as a super effective Ice Beam. Judgment is also easily the superior attack if you decide to use only one attack. Stone Edge can be used on the Swords Dance set to hit Ho-Oh for super effective damage, but is generally not worth sacrificing a moveslot.</p> <h1>Checks and Counters</h1> <p>Ho-Oh is Arceus-Steel's greatest fear. Its high Special Defense and resistance to Judgment allow it to soak up hits with incredible ease and it can roast Arceus back with Sacred Fire. Ho-Oh also destroys the physical set. However, Ho-Oh must be wary of a Calm Mind-boosted Thunder; Stealth Rock can also make it difficult for Ho-Oh to defeat Arceus. Heatran is a large issue to the Calm Mind set due to its quadruple resistance to Judgment. It can then melt Arceus with STAB Flamethrower and restrict its options with Taunt and Roar. However, in the rain, Heatran cannot do much to Arceus and is taken down by repeated Thunders. Heatran also defeats the Swords Dance set if it lacks Earthquake. Groudon in general is an issue as it increases the strength of Fire-type attacks and can hit Arceus with a super effective Earthquake. Garchomp is faster than Arceus and can take a boosted Judgment or Iron Head, and 2HKOes back with an unboosted Earthquake, or OHKOes Arceus if it's holding a Choice Band. Arceus-Fire resists Judgment and can dispatch of Arceus-Steel with its own Judgment, but once again, rain can be an issue. Without Thunder, Lucario can survive two unboosted Judgments and OHKO back with Close Combat.</p> <p>Swords Dance Arceus detests Choice Scarf Palkia if it does not get enough Cosmic Power boosts in time. Arceus is incapable of OHKOing Palkia even with a boosted Earthquake and is 2HKOed by Surf in the rain, or 2HKOed by Fire Blast in the sun. Bulky Calm Mind and Choice Scarf Kyogre are also issues. The former isn't even 2HKOed by Swords Danced Earthquake, while it can 2HKO back with Surf. Even if Arceus uses Cosmic Power to boost its bulk, Kyogre can essentially neutralize it through Calm Mind. Choice Scarf Kyogre is faster and 2HKOes with Surf or Water Spout, and is not OHKOed by Swords Danced Earthquake even after Stealth Rock and Spikes damage. Skarmory's high physical Defense, resistance to Iron Head, and immunity to Earthquake, allow it to set up Spikes with ease and phaze Arceus away. However, it cannot beat Arceus one-on-one. Similarly, Giratina can burn Arceus, and Lugia can set up a Reflect and Whirlwind it away, but they cannot take on Arceus one-on-one easily.</p>",
    "sets": [
      {
        "name": "Calm Mind",
        "description": "<p>Calm Mind Arceus combines both amazing durability and power into a set that can prove to be extremely difficult to handle. Unlike just about any other Calm Mind user in the game, Arceus has no fear of Toxic and Toxic Spikes thanks to its natural immunity to the status. With no fear of Blissey's main crippling move, Arceus gains a valuable moveslot that can help increase the utility of the set.</p> <p>At first glance, it may appear odd that Arceus's main attack, Judgment, is a Steel-type, given that many Pokemon in the Uber metagame resist it. However, it is important to realize that no Pokemon outside of Shedinja is immune to Steel-type attacks and that a resisted Judgment has a Base Power roughly equivalent to 90 (with the Iron Plate and STAB boost factored in). Furthermore, most of the Pokemon that resist Steel-type attacks fear switching into Arceus as they usually lack an attack strong enough to quickly break through its impressive bulk, allowing it to set up on them. Those who do not resist Steel, such as Mewtwo and Groudon, end up taking a fierce blow from Judgment's raw power. Roar allows Arceus to combat other Calm Mind users, such as Latias and Kyogre, as well as any other Pokemon that utilizes a boosting move, like Bulk Up Dialga. It also allows Arceus to scout its potential counters and rack up entry hazard damage. Should you find Judgment's coverage inadequate, Thunder helps round it out by hitting many Pokemon that resist Judgment, such as Kyogre, Ho-Oh, and Heatran hard. Iron Defense fortifies Arceus's otherwise unboosted Defense stat, allowing it to tank hits from both sides, amazingly well. Finally, Recover provides Arceus with reliable recovery, allowing it to continuously set up and tank hits.</p> <p>Due to Arceus-Steel's weakness to Fire, and the presence of Drought in the Uber metagame, Kyogre is an excellent partner, as it removes the sunlight through Drizzle and patches up its Fire-type weakness. Furthermore, Kyogre can switch into Ho-Oh and Heatran, two of this set's greatest fears, and destroy them with a powerful Surf. If you're using Roar, entry hazards are crucial, and as such, Forretress and Deoxys-S are great partners for that role alone. Giratina-O aids in blocking Rapid Spin and is immune or resistant to all of Arceus-Steel's weaknesses. Latias and Latios are also excellent teammates as they cover Arceus's weaknesses perfectly, and vice versa.</p> <p>Groudon is a surprisingly great partner as it can set up Stealth Rock and is neutral to Ground, Fighting, or Fire, unlike most of the other Pokemon with access to it. Drought may appear antagonistic at first, but it allows Arceus to set up on Latios and Latias easier as Thunder is no longer 100% accurate. Although risky, Groudon can switch into Kyogre's non damaging moves or Thunder, and immediately switch to Arceus and let it set up. However, with the Fire-type move's increased strength, Arceus can be easier to break down. As a result, Heatran and Ho-Oh are great partners. Although Heatran shares Arceus-Steel's Ground-type and Fighting-type weaknesses, Flash Fire allows it to take full advantage of the Fire-type attacks aimed at Arceus. Ho-Oh resists all of three of Arceus's weaknesses and can use Earthquake to eliminate an opposing Heatran.</p>"
      },
      {
        "name": "Swords Dance",
        "description": "<p>Unlike most Swords Dancers in the metagame, Arceus-Steel possesses a great amount of bulk and Speed. Arceus's natural bulk and plentiful resistances allow it to switch in with ease and set up, without support from Wobbuffet most of the time. However, this set takes advantage of the general lack of physical Defense in Ubers and can deal damage quicker as Swords Dance boosts its offensive stat faster than Calm Mind.</p> <p>Iron Head is Arceus's main attacking option, being boosted by STAB and Iron Plate, as well as offering decent neutral coverage. It also boasts a great 30% chance of flinching, which, combined with Arceus's moderately fast 331 Speed, can sometimes prove to be quite annoying to slower Pokemon, such as Groudon and Wobbuffet. Earthquake rounds out Arceus's coverage by hitting most Pokemon that resist Iron Head for at least neutral damage. Earthquake also hits Dialga, Heatran, and Lucario super effectively. Cosmic Power helps turn Arceus into a monstrous tank, boosting its defenses to make it incredibly tough to break down and thus allowing it to secure a sweep easier, but it loses the coverage Earthquake provides. As this set aims to take full advantage of Steel Arceus's bulk and resistances, Recover is a must in order to keep it healthy. This is further justified by the fact that its attacking options either lack the raw power or utility compared to the other variants of Swords Dance Arceus.</p> <p>Despite the quick Attack boost from Swords Dance, a few Pokemon are capable of taking the boosted hit and causing trouble for Arceus. Ho-Oh, with its resistance to Iron Head and immunity to Earthquake, can take a hit quite easily and dispatch of Arceus with a powerful Sacred Fire. Even if it is raining, Sacred Fire's incredibly high chance of burning can be a large nuisance. Bulky Calm Mind and Choice Scarf Kyogre are also issues. The former isn't even 2HKOed by Swords Danced Earthquake, while it can 2HKO Arceus back with Surf. Even if Arceus uses Cosmic Power to boost its bulk, Kyogre can essentially neutralize it through Calm Mind. Choice Scarf Kyogre is faster and 2HKOes with Surf or Water Spout, and is not OHKOed by Swords Danced Earthquake, even after Stealth Rock and Spikes damage! Garchomp outruns Arceus and can 2HKO with Earthquake (or OHKO if it's holding a Choice Band), and a Swords Danced Iron Head will fail to OHKO after Stealth Rock damage. Rock Polish Groudon can take a boosted hit and OHKO with Earthquake, but must be wary of Iron Head's flinching chance. Defensive Groudon is not 2HKOed by Swords Danced Iron Head and can 2HKO back with Earthquake or Roar it away.</p> <p>Due to all of these threats, Kyogre is an excellent teammate, as it can handle Ho-Oh, Groudon, and Garchomp to a certain extent as well as reduce Arceus-Steel's weakness to Fire-type moves via Drizzle. Kyogre also deals with Heatran, should you decide to use Cosmic Power instead of Earthquake. Latios, Latias, and Palkia help cover up enemy Kyogre that can trouble Arceus; again, the former two get an honorable mention as they resist all of Arceus's weaknesses and vice versa. In the same vein, Giratina-O resists all of Arceus-Steel's weaknesses and vice versa, and blocks Rapid Spin should you have multiple layers of entry hazards. Speaking of entry hazards, Forretress is a decent partner as it can set up Spikes and more importantly, Toxic Spikes, which aid in Arceus's stalling ability. Combined with Iron Head's high flinch chance, enemy Groudon and Kyogre can be worn down quickly.</p>"
      }
    ],
    "credits": {"writtenBy": [{"username": "Jibaku", "user_id": 1779}, {"username": "Brambane", "user_id": 29630}], "teams": [{"name": "Quality checked by", "members": [{"username": "Fireburn", "user_id": 29197}, {"username": "firecape", "user_id": 46442}, {"username": "Theorymon", "user_id": 29010}]}, {"name": "Grammar checked by", "members": [{"username": "Aeron Ee1", "user_id": 42173}, {"username": "Engineer Pikachu", "user_id": 34000}]}]}
  },
  "Arceus-Water": {
    "overview": "<p>From the raging maelstrom rises Arceus-Water. As a Water-type, Arceus must compete with the great creator of the seas, Kyogre. While the mighty Arceus may not have Kyogre's sheer power, Arceus does have many glorious qualities. Arceus's ability to move like a raging torrent is its biggest advantage, as it is able to outpace both the space-bending Palkia and the ruler of the air, Rayquaza. With Recover, Arceus can repair any wound inflicted upon its majestic form, unlike Kyogre, who is forced to use Rest to heal. Arceus is also much more devastating as a physical attacker thanks to the great Swords Dance. While Arceus-Water and Kyogre may seem like rivals, one should not underestimate their offensive prowess on the same team. With Kyogre's eternal rain on the battlefield, the power of Arceus's own Water-type moves is increased to a terrifying level. Be wary against this form of the omnipotent Arceus or face its divine wrath in the form of a torrential flood that will wash all but the strongest away.</p>",
    "comments": "<h1>Other Options</h1> <p>The options listed above are superior, but there are still a few other possibilities. Firstly, Shadow Claw can be used over Dragon Claw on the Swords Dance set to hit Psychic- and Ghost-type Pokemon harder, but Waterfall ensures nearly all the same KOs, and Dragon Claw is useful for coverage against Dragon-type Pokemon. Another interesting option is a bulky Water set, making use of Arceus's great natural bulk and Recover. However, it would be generally inferior to Kyogre, who may not have access to Recover, but has superior Special Attack. In general, a tank Arceus set is a bad idea due to Species Clause; one needs to use Arceus wisely. There are a near-infinite number of possibilities, but most of them are best left to other Pokemon or Arceus types. It may be tempting to use an Attack- or Special Attack-boosting nature for more power, but it is never a good idea for Arceus-Water, as it needs to outspeed base 95 Speed Pokemon and below to reach its full potential.</p> <h1>Checks and Counters</h1> <p>Arceus-Water may be mighty, but both sets are perfectly counterable. Without any Special Defense boosts, Arceus is OHKOed by a Choice Specs-boosted Thunder from a Pokemon with base 150 Special Attack after it takes Stealth Rock damage. Therefore, Choice Specs Kyogre, Dialga, and Mewtwo can easily switch in on Swords Dance or Calm Mind and strike Arceus down with Thunder, but they must be careful of a Ground-type switch-in. Also, Kyogre and Dialga must be aware of Waterfall's 20% chance to flinch, as they will both be 2HKOed by it after a Swords Dance boost and Stealth Rock damage. Groudon can also be a problem for Arceus-Water, as it isn't always 2HKOed by Waterfall after Stealth Rock due to its ability, Drought, terminating the rain and summoning sun in its place. The Calm Mind set may be able to 2HKO Groudon, but it still hates the rain being taken away. Groudon can also cripple Arceus with Thunder Wave, or use Roar to nullify its boosts and force it to take damage from entry hazards. Grass and Electric Arceus resist Arceus-Water's STAB, and can crush it with their own super effective STABs. If Arceus uses Substitute over a secondary attacking option, it will be completely walled by Pokemon with Water Absorb, like Quagsire. In addition to Pokemon with Water Absorb, Palkia will also be able to crush mono-attacking Arceus thanks to its 4x resistance to Water-type attacks and its access to Thunder. Shaymin-S can also be a problem because an Air Slash followed by Seed Flare will always kill a Arceus-Water without any Special Defense boosts, and even if Arceus has a few Special Defense boosts under its belt, Seed Flare has a 64% chance to make it plummet back down.</p> <p>For the Calm Mind set in particular, Latias can switch into anything Arceus-Water has, Calm Mind alongside it, and strike it with Thunder for a 2HKO, while Arceus's Ice Beam fails to 3HKO a large percentage of the time, assuming they both have an equal number of Calm Minds. Calm Mind Kyogre easily counters Calm Mind Arceus-Water, as it can 2HKO Arceus with Surf if they have an equal number of Calm Minds, while Arceus can only muster a 4HKO. If Arceus lacks Substitute or Refresh, Blissey can easily Toxic stall it due to its massive Special Defense and HP. Finally, Toxic Spikes are deadly to this Arceus's efficacy, particularly that of the Calm Mind set.</p>",
    "sets": [
      {
        "name": "Swords Dance",
        "description": "<p>It may seem odd to use a Swords Dance Arceus-Water over something like Kabutops, who has higher Speed and Attack due to Swift Swim and Arceus's EV limit, respectively. However, Arceus is bulkier than other rain sweepers, and has access to Recover, which sets it apart and makes it a force to be reckoned with.</p> <p>Swords Dance allows Arceus to raise its Attack to sky-high levels and deal insane damage; after Stealth Rock, Waterfall 2HKOes even Giratina-O! Waterfall is the STAB of choice for this set as it gains \"double STAB\" in the rain, letting Arceus muscle through even Pokemon who resist Water with its handy 20% flinch rate. Dragon Claw is the ideal move to complement Waterfall in terms of coverage, as it hits Dragon-types that resist Waterfall for super effective damage. Dragon and Water also combine to provide phenomenal type coverage, hitting everything in Ubers for at least neutral damage. A word of caution, a 2x resisted Waterfall in the rain has more power than a neutral Dragon Claw. Therefore, Dragon Claw should only be used against opposing Dragon-types, or when facing a Pokemon with a 4x resistance to Water, such as Ludicolo or Palkia. Against Giratina-O Waterfall is the better course of action, however, as both Dragon Claw and Waterfall fail to OHKO it after a Swords Dance boost, but Waterfall has a nice chance to flinch and still 2HKOes despite the resistance. Garchomp is another Dragon that Arceus is better off using Waterfall against, as a +2 Waterfall in the rain will always OHKO, unlike Dragon Claw. Recover rounds off the set nicely by giving Arceus a way to capitalize on its great bulk. With Recover, Arceus can set up a Swords Dance or two on a wide variety of Pokemon and simply heal off any damage taken before sweeping. A Jolly nature is needed to outspeed the numerous base 90 Speed Pokemon in Ubers, as a max Speed base 90 with a Speed boosting nature outruns a neutral Arceus due to Arceus's EV limit.</p> <p>Waterfall is generally the best option for reliability, but if more power is absolutely necessary Aqua Tail can be used. However, the difference in power between Aqua Tail and Waterfall is so insignificant that you are better off using Waterfall for its chance to flinch and perfect accuracy. Another possible option for Arceus-Water is Substitute. Substitute allows Arceus-Water to scout for switch-ins and block status from Pokemon like Blissey. Even with its EV limit, Arceus can still make 101 HP Substitutes, which Blissey will be unable to break with a single Seismic Toss. If you opt to use Substitute, it's best used over Dragon Claw, although Arceus will miss the coverage. You should avoid using Substitute over Recover, however, as Arceus will lose large chunks of HP and relinquish one of its biggest assets - longevity. In a similar vein, Arceus can use Refresh to rid itself of troublesome status, but once again it will miss the coverage provided by Dragon Claw. Extreme Speed is also an option to pick off faster weakened Pokemon, but it is rather weak, even after a Swords Dance boost.</p> <p>Arceus-Water has problems with Pokemon that use Thunder, such as Kyogre, Dialga, Latias, and Palkia. Furthermore, a Choice Specs Thunder coming from 150 Special Attack (which all of the aforementioned Pokemon, bar Latias, have) will always OHKO Arceus-Water after Stealth Rock. There are several Pokemon who can help Arceus in this regard, the most prominent being Garchomp. Garchomp can easily switch into a Choice-locked Thunder due to its Ground typing and proceed to use Swords Dance as the opponent is forced to switch. If you want to deal with them directly, Latias can switch into all of the aforementioned Pokemon, bar opposing Latias, and hit them with a powerful Dragon Pulse or Thunder. However, it must watch out for Thunder's pesky 30% paralysis rate. It is worth noting that all of the aforementioned checks can be 2HKOed (or OHKOed) by either Dragon Claw or Waterfall, but it's risky to stay in as they may be holding a Choice Scarf. Groudon can also cause problems with its Drought ability, which weakens Arceus-Water's STAB. Groudon isn't always 2HKOed by Waterfall, either. Once again, Latias can make a good check if Groudon lacks Thunder Wave, as it can switch into Earthquake and crush it with a Soul Dew-boosted Grass Knot. Kyogre can also take any attack Groudon can throw at it and drown it with a powerful Surf, while bringing back the rain that Arceus loves. That being said, Kyogre should always be paired with this Arceus due to its ability to summon rain and boost Waterfall's power.</p>"
      },
      {
        "name": "Calm Mind",
        "description": "<p>At first glance, this set may seem inferior to Calm Mind Kyogre due to Kyogre's superior Special Attack; however, upon closer observation, one will find that Calm Mind Arceus-Water has several advantages over the giant whale. First and foremost is Arceus's access to Recover, which is largely superior to Kyogre's Rest. Arceus also has more Speed than Kyogre, even with the EV limit, allowing it to always outspeed Rayquaza and set up more easily on base 90 Speed Pokemon.</p> <p>The first slot of this set goes to Calm Mind, which allows Arceus to raise its Special Attack and Special Defense to obscene levels, and after a few uses, it is nearly unbreakable on the special side. The second slot depends on whether you want to use a mono-attacker set or a regular Calm Mind set. If one wishes to use mono-attacker Arceus-Water, the best option is Surf due to its superior PP. If one does choose Surf, then the third slot should be Substitute, as it allows Arceus to scout for switch-ins and gives it an easier setup on foes like Blissey, who cannot break Arceus's Substitute with a single Seismic Toss. If one chooses to use Judgment for added power, Ice Beam becomes the better choice for the third slot to provide Arceus-Water with better coverage. Ice Beam allows Arceus to crush the Dragon-type Pokemon it would normally struggle against, such as Palkia and Rayquaza. Arceus needs two Calm Mind boosts to even 2HKO Rayquaza with Surf because of Rayquaza's Air Lock, which negates rain and the boosts it provides. This fact is what makes considering other ways of beating Rayquaza, in this case Ice Beam, important. However, no matter what, Kyogre is always a required teammate due to its Drizzle boosting the power of Arceus's Judgment or Surf to astounding levels. Recover is recommended in the last slot as it complements Arceus's great bulk, and lets it set up on all but the fiercest special attackers by alternating between Calm Mind and Recover. Finally, Timid should always be used with this set as it allows Arceus to outspeed Pokemon like Rayquaza and Dialga, provided they aren't holding a Choice Scarf.</p> <p>As stated before, Calm Mind Arceus-Water can be used in two different ways: it can be used as a regular Calm Mind set with Judgment and Ice Beam, or it can be used as a mono-attacker with Surf and Substitute over Judgment and Ice Beam, respectively. If you want a way to deal with Kyogre without having to resort to teammates, Thunder is an option over Ice Beam or Recover, but if placed over the former Arceus will struggle to take down Dragon-type Pokemon, and if used over Recover, Arceus will lose one of its biggest advantages over Calm Mind Kyogre. Spacial Rend is another lesser option, but it's worth mentioning for its ability to 2HKO Palkia at +1 compared to Ice Beam's feeble 3HKO. Lastly, if Arceus is taking the mono-attacker route, Refresh is an option over Substitute, allowing Arceus to rid itself of poison from Toxic Spikes, but Substitute is generally the better option as it can be used to scout switch-ins.</p> <p>There is one Pokemon that should always be used alongside Arceus-Water: Kyogre. Kyogre provides rain, boosting the power of Arceus's Water-type attacks to sky-high levels and allowing it to smash through even Pokemon who resist Water. However, Kyogre and Arceus-Water have the same typing, which means they compound each other's weaknesses to Grass- and Electric-type attacks. Therefore, it is a good idea to pack a teammate who can take attacks of these types, such as Latias. Latias also has the bonus of being able to handle opposing Kyogre, Grass and Electric Arceus, Manaphy, Palkia, and Groudon (if it carries Grass Knot), all of whom pose a major threat to Arceus-Water. One can also use a Ground-type, like Garchomp, to switch into Choiced Thunder, which Arceus will often encounter. Since Thunder carries a high chance of paralysis, which cripples Arceus-Water, it is worth packing a teammate to help with this. Calm Mind Arceus-Water also has trouble with Latias, as it can to Calm Mind alongside Arceus and 2HKO with Thunder at any time. A Pursuit user like Scizor or Metagross can help eliminate Latias, but it is a bad idea to use Tyranitar because it gets rid of rain. If Arceus lacks Substitute or Refresh, Blissey can be a major problem, as she can easily use Toxic against Arceus and proceed to repeatedly heal until Arceus succumbs to poison. A strong physical attacker can help eliminate Blissey; Garchomp in particular gets special mention due to its ability to switch into Thunder. Both mono-attacker and regular Calm Mind Arceus-Water enjoy Toxic Spikes support, as with it Arceus can stall out opponents that would otherwise give it trouble; such as Blissey, and Calm Mind Kyogre.</p>"
      }
    ],
    "credits": {"writtenBy": [{"username": "firecape", "user_id": 46442}, {"username": "Brambane", "user_id": 29630}], "teams": [{"name": "Quality checked by", "members": [{"username": "Fireburn", "user_id": 29197}, {"username": "Jibaku", "user_id": 1779}, {"username": "bojangles", "user_id": 20796}]}, {"name": "Grammar checked by", "members": [{"username": "jc104", "user_id": 38600}, {"username": "Draco Zephyr", "user_id": 29682}]}]}
  }
}