{
  "Victreebel": {"sets": [{"name": "Swords Dance"}, {"name": "Specially Offensive"}, {"name": "Sun Attacker"}, {"name": "Choice Scarf"}]},
  "Bellossom": {
    "overview": "<p>Bellossom functions as one of PU's best specially defensive Pokemon. With a great support movepool, good bulk, and reliable recovery, it is able to check a wide variety of special attackers like Misdreavus, Mantine, Ampharos, and Mr. Mime. Bellossom sets itself apart from the other Grass-types in the tier by using its superior Special Defense to check Water-types like Golduck as well, while the other big Grass-type, Tangela, can't do so. However, Bellossom's lower Defense means physical attackers like Rhydon, Relicanth, Zangoose, and Purugly can still break through it.</p> ",
    "sets": [
      {
        "name": "Specially Defensive",
        "description": "<p>Leaf Blade is the chosen attacking move for Bellossom, as it allows it to beat most Calm Mind users that may try and set up on it, most notably Misdreavus, Golduck, and Substitute Mantine. Energy Ball is another option, as it uses Bellossom's slightly higher Special Attack to get OHKOs on Rhydon and Relicanth. Sleep Powder is one of Bellossom's most useful moves, as it allows it to essentially eliminate one of its switchi-ns, notably Victreebel. Leech Seed helps provide Bellossom with more passive recovery, while Stun Spore can be used to help cripple foes like Murkrow that might otherwise switch into Bellossom freely. Bellossom's ability to check most Water-types makes it a great partner for Pokemon like Magmar, Rhydon, and Relicanth that normally are threatened by or have trouble breaking through bulky Water-types like Quagsire and Mantine. Rhydon and Relicanth also deal with Muk very easily, which Bellossom greatly appreciates. Monferno is an option to help with opposing Grass-types like Tangela and Victreebel that Bellossom can't damage well as well as providing U-turn support. Bellossom also appreciates Water-type teammates like Politoed and Mantine to switch into Fire-type moves from opposing Magmar.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "SergioRules", "user_id": 265399}], "teams": [{"name": "Quality checked by", "members": [{"username": "avarice", "user_id": 346653}, {"username": "Akir", "user_id": 231726}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}]}]}
  },
  "Mantine": {"sets": [{"name": "Rain Dance"}, {"name": "SubTox"}]},
  "Glaceon": {"sets": [{"name": "BRRRR (Choice Specs)"}]},
  "Golduck": {"sets": [{"name": "Choice Scarf"}, {"name": "Calm Mind"}]},
  "Kadabra": {"sets": [{"name": "Life Orb"}, {"name": "Choice Scarf"}]},
  "Muk": {"sets": [{"name": "Curse"}, {"name": "Offensive"}]},
  "Rhydon": {"sets": [{"name": "Physical Attacker"}, {"name": "Choice Band"}]},
  "Electabuzz": {"sets": [{"name": "Life Orb"}]},
  "Magmar": {
    "overview": "<p>Magmar is a potent wallbreaker with its great coverage and decent Speed tier. Magmar makes for a solid lead with how it can immediately pressure Pokemon like Metang and Relicanth. It can also pick off weakened Purugly and other Pokemon with Mach Punch. Magmar can also be an amazing wallbreaker mid-game, especially if it can safely get up a Substitute. It is generally vulnerable to fast Pokemon like Purguly and Electabuzz, in addition to Choice Scarf users like Golduck.</p> ",
    "sets": [
      {
        "name": "Life Orb Attacker",
        "description": "<p>Fire Blast is Magmar's go-to STAB option for its surprisingly high power and strong neutral coverage in the tier, but Overheat can also be used for even more power. Magmar's wide coverage allows it to bypass plenty of Fire-resistant foes. Thunder Punch is able to OHKO Mantine, while Hidden Power Grass covers other common Fire-resistant Pokemon such as Relicanth, Rhydon, Quagsire, and Gastrodon. Mach Punch can pick off faster Pokemon such as Sneasel. Substitute is an alternative to ease prediction while avoiding potential status to make Magmar extremely threatening mid- and late-game. Flame Body can cripple faster attackers like Purugly trying to finish it off. Magmar lacks coverage for Gabite and is often checked by Purugly, making bulky Grass-types like Tangela and Bellossom solid partners. Spikes support from lead Glalie can make Magmar more threatening mid-game, as its coverage becomes more punishing, for example against Muk. Purugly is also a nice partner, as it can draw in Metang and Tangela for Magmar with U-turn, and it can clean up once Magmar has punched a few holes in teams. Similarly, Choice Scarf Gabite can freely click its STAB moves once Magmar beats Steel- and Grass-types. Magmar can also run Choice Scarf itself with Focus Blast and Sleep Talk instead of Thunder Punch and Mach Punch, but Monferno often outclasses it here given its access to U-turn. Ampharos can cover Magmar well against Water-types like Golduck, lure Gabite in to nail it with Hidden Power Ice, and potentially paralyze faster foes like Purugly with Static.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "avarice", "user_id": 346653}], "teams": [{"name": "Quality checked by", "members": [{"username": "Estarossa", "user_id": 461329}, {"username": "Akir", "user_id": 231726}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Pinsir": {"sets": [{"name": "Lum Lead"}, {"name": "Choiced Attacker"}]},
  "Murkrow": {
    "overview": "<p>Murkrow is a potent wallbreaker in PU. It can hit most of the tier neutrally with its coverage and can be difficult to switch into with Brave Bird. Sucker Punch is helpful against offense as well, preempting threats like Magmar that outspeed Murkrow naturally. While extremely frail, Murkrow does have a sliver of defensive utility in the form of Insomnia, letting it aggressively switch into some of the tier's Grass-types like Tangela and Victreebel, which use Sleep Powder. However, this is rather risky. Murkrow also struggles with sustainability between Stealth Rock, Brave Bird, and Life Orb recoil.</p> ",
    "sets": [
      {
        "name": "Life Orb Attacker",
        "description": "<p>Brave Bird is rather spammable with Murkrow's decent Speed tier. Sucker Punch is solid at picking off weakened fast threats like Purugly and Magmar. It can also hit Metang before a Custap Berry activates. Hidden Power Grass is able to remove common bulky Pokemon like Quagsire and Rhydon. Heat Wave hits Metang without relying on it attacking and does more damage to Tangela than Brave Bird. Given its lack of sustainability, Murkrow tends to fit best on offensive teams. Glalie is a good partner that can use Taunt to block Stealth Rock and provide Spikes to wear down Pokemon like Metang, which Murkrow struggles to break past immediately. Purugly works well with Murkrow, as it can weaken faster Pokemon like Choice Scarf Monferno with Fake Out. Purugly can also bring Murkrow in on foes like Misdreavus with a U-turn. Murkrow can remove Normal-resistant Pokemon like Relicanth and Rhydon in turn. Pokemon like Golduck and Gabite, which are annoyed by Grass-types like Bellossom and Tangela, appreciate Murkrow as well. Relicanth and Bellossom are able to beat foes that check Murkrow like Purugly and Electabuzz.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "avarice", "user_id": 346653}], "teams": [{"name": "Quality checked by", "members": [{"username": "Estarossa", "user_id": 461329}, {"username": "Akir", "user_id": 231726}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Misdreavus": {"sets": [{"name": "Defensive"}, {"name": "Choice Scarf"}]},
  "Armaldo": {"sets": [{"name": "Rapid Spin"}, {"name": "Swords Dance"}]},
  "Glalie": {"sets": [{"name": "Spikes Lead"}]},
  "Relicanth": {"sets": [{"name": "Stealth Rock"}, {"name": "Choice Band"}]},
  "Metang": {"sets": [{"name": "Defensive"}]},
  "Gastrodon": {"sets": [{"name": "Toxic"}, {"name": "Curse"}]},
  "Purugly": {"sets": [{"name": "All-out Attacker"}]},
  "Gabite": {"sets": [{"name": "Defensive"}, {"name": "Offensive"}]}
}