{
  "Charizard": {
    "overview": "<p>Charizard is generally regarded as the best Pokemon in NU. It's powerful, fast, and extremely versatile, capable of running sets ranging from special attacker to physical setup sweeper to Toxic staller that each require different counters. Its typing comes with an obvious drawback in a 4x weakness to Stealth Rock, making Rapid Spin support nearly mandatory, but Charizard also has an immunity to Ground and resistance to Fighting, which open up far more opportunities to switch in freely than other offensive Fire-types have, as well as access to Roost. When you're building an NU team, Charizard is the number one Pokemon you need to keep in mind.</p>",
    "comments": "<h1>Other Options</h1> <p>Charizard can be an effective revenge killer with Choice Scarf, but you're usually better off using Typhlosion or Magmortar in that role. The combination of Sunny Day and Solar Beam is an option to overpower some of the usual counters to special attacking sets, but this is usually only worth the setup if you have at least one other Pokemon on your team that benefits from sun.</p> <p>Belly Drum is an extremely high-risk, high-reward option. If you can keep Stealth Rock off the field, remove faster Choice Scarf users and priority users, weaken physically defensive Water-types, and give Charizard a free turn, it can win the game with a set of Substitute / Belly Drum / Fire Punch / Earthquake with a Salac Berry. That's a lot of conditions, though, which makes this set impossible to pull off with any consistency.</p> <p>Rock Slide and Hidden Power Rock allow Charizard to win mirror matchups but provide no other useful coverage. Hidden Power Electric stops Mantine from walling special sets, retains coverage against Slowking and Politoed, and also has some value against opposing Charizard, at the cost of leaving Charizard walled by Quagsire and Gastrodon. Will-O-Wisp neuters Skuntank that try to revenge kill Charizard with Sucker Punch, but you're better off simply shooting a Fire Blast at just about any other Pokemon that you'd want to burn.</p> <h1>Checks and Counters</h1> <p>Regirock and Slowking are the safest immediate answers to Charizard; they can switch in on both the standard special and physical sets and beat or force out Charizard, although Slowking needs significant investment in Defense to survive +2 Thunder Punch if Stealth Rock is up. However, they both hate switching in on the SubToxic set, and Regirock is vulnerable to Focus Blast from special sets, while Slowking must beware of being Pursuit trapped by one of Charizard's teammates.</p> <p>Politoed and Mantine are solid counters to special attacking sets but lose to physical sets with Thunder Punch. Specially defensive variants of Lickilicky and Cradily can stall out special attacking Charizard sets that lack Focus Blast, but both fall to +2 Flare Blitz. Gardevoir, Grumpig, and Hypno can also counter special attacking sets but lack the physical bulk to stand up to boosted Flare Blitz, and all three are very vulnerable to being trapped by Skuntank. Ninetales and Flareon can switch into special sets relatively safely but are crushed by Earthquake from physical sets. Probopass checks any set without Focus Blast or Earthquake and can set up Stealth Rock.</p> <p>Quagsire, Gastrodon, and Whiscash are perhaps the best counters to physical sets, but special sets annihilate them with Hidden Power Grass. Poliwrath and Walrein can also check physical Charizard, but they lack reliable recovery and need to stay relatively healthy to be able to survive a boosted Thunder Punch. Solrock counters physical sets quite well, but it loses to special sets and is rarely seen outside of the lead slot.</p> <p>Perhaps the easiest way to handle Charizard, especially for offensive teams, is to keep Stealth Rock up and force it out with faster Pokemon. Tauros, Manectric, Floatzel, and Electrode all naturally outspeed Charizard and can OHKO it with their STAB moves. Choice Scarf users such as Gardevoir, Magmortar, Medicham, and Magneton all threaten Charizard with Electric-type moves, although the first three require a bit of prior damage to secure the OHKO. Priority users such as Skuntank, Shiftry, and Sharpedo can also revenge kill weakened Charizard, although those that rely on Sucker Punch must beware of Charizard dodging it with Roost or Substitute.</p>",
    "sets": {
      "Special Attacker": {
        "description": "<p>This is Charizard's most common and straightforward set. Fire Blast is the primary attack, while Air Slash gives Charizard an option with neutral coverage against opposing Fire-types, better accuracy, higher PP, and a handy flinch chance. Hidden Power Grass covers the Water- and Rock-types that resist Charizard's STAB moves. Roost allows Charizard to recover the HP it loses from Stealth Rock and Life Orb recoil on forced switches, mitigating its 4x Stealth Rock weakness to some extent and setting Charizard apart from most other offensive Pokemon in NU, which lack reliable recovery. You can opt for Focus Blast over Air Slash or Hidden Power Grass in order to KO Regirock, Lickilicky, and Cradily after they switch into Fire Blast, but keep in mind that dropping Air Slash hurts Charizard's neutral coverage and consistency, while dropping Hidden Power Grass means losing to Water-types that Charizard could otherwise 2HKO.</p> <p>Charizard sits at an important Speed tier that lets it outspeed Jynx and Haunter and Speed tie with Typhlosion, Dodrio, Ninetales, and of course other Charizard, so maximum Speed investment with a Timid nature is required. Life Orb is highly recommended for the power boost that makes Charizard so dangerous. However, it does have the serious drawback of limiting Charizard to a single switch-in if Stealth Rock is on the field and Charizard doesn't get a chance to use Roost. If you're not confident that your team can keep Stealth Rock off the field, you can consider switching to Expert Belt or Leftovers in order to ensure Charizard can come into the battle at least twice, although you may be better off just using Choice Specs instead.</p> <p>Flamethrower can replace Fire Blast if you're worried about accuracy. Substitute is a neat option if you can afford to drop Hidden Power Grass, especially on teams that intend to spread poison or paralysis. It protects Charizard from status and Sucker Punch, takes advantage of opponents who try to sacrifice a weakened Pokemon to get a revenge killer in, and allows Charizard to fish for opposing full paralysis and Stone Edge misses or stall out poisoned foes.</p> <p>Entry hazard removal is the most important support for any Charizard set. Sandslash and Hitmonchan both pair well with Charizard, since they can switch in on Regirock fairly easily; Hitmonchan also threatens Lickilicky and Cradily, while Sandslash can set up your own Stealth Rock and provides an Electric immunity. With Stealth Rock off the field, Charizard can repeatedly switch in on most Grass- and Ground-types and force them out, especially Sandslash and Gligar, which often don't carry a Rock-type attack. You can also use Charizard as a lead in order to be sure that it gets into battle at least once without taking Stealth Rock damage.</p> <p>Specially defensive Water-types such as Slowking, Politoed, and Mantine comfortably counter this set, as Hidden Power Grass never 2HKOes them even after Stealth Rock damage. Grass-types such as Shiftry, Cacturne, and Meganium are therefore good partners. Specially defensive Psychic-types such as Gardevoir, Hypno, and Grumpig can also stop Charizard, which makes Skuntank an excellent teammate for its ability to trap Psychic-types with Pursuit. Tauros is very commonly used to revenge kill Charizard, so your team should include a solid switch-in such as Regirock, Cradily, or Drifblim.</p>"
      },
      "Toxic Stall": {
        "description": "<p>Although Charizard is mostly known for its offensive prowess, it also has all the tools necessary to be a very effective Toxic staller. This set is great at crippling typical defensive switch-ins such as Slowking and Regirock with Toxic. Once the opponent's walls are poisoned, Charizard can stall them out with Substitute and Roost. Flamethrower hits most of the common Poison- and Steel-types super effectively and still does significant damage to most offensive Pokemon despite this set's lack of investment in Special Attack.</p> <p>Investing in HP helps Charizard stall for longer against the weak attacks of defensive Pokemon such as Lickilicky and Slowking. However, it's also reasonable to move some EVs from HP into Special Attack in order to better take on certain offensive Pokemon. For example, with 192 Special Attack EVs, Charizard will always OHKO Jynx and has a 50% chance to OHKO Haunter after Stealth Rock damage.</p> <p>This set can be an effective lead. Leading means Charizard won't have to worry about switching into Stealth Rock to get into play, and it can reveal and cripple your opponent's Fire-type counter very early in the match. In addition, Substitute blocks sleep from lead Jynx and Venomoth and also punishes opponents who choose to spend the first turn setting up entry hazards.</p> <p>This set works best alongside other Pokemon that spread poison. Regirock, Gligar, Lickilicky, Politoed, and Hypno are all examples of effective Toxic stallers that can work well alongside Charizard. Setting up multiple layers of entry hazards also greatly increases the effectiveness of Toxic stalling strategies, so consider adding Nidoqueen or Venomoth for Toxic Spikes, Glalie or Cacturne for Spikes, and a Ghost-type to block Rapid Spin.</p>"
      },
      "Swords Dance": {
        "description": "<p>Swords Dance makes Charizard a powerful wallbreaker with a very different set of counters from its more common special attacking sets. After a boost and with Stealth Rock up, Flare Blitz OHKOes specially defensive Lickilicky, Cradily, and Hypno, Thunder Punch OHKOes most specially defensive Water-types, including Slowking that don't invest most of their EVs in Defense, and Earthquake demolishes Fire-types such as Ninetales and Flareon.</p> <p>Entry hazard removal is even more important than usual for this set, since it will be suffering recoil damage from Flare Blitz in addition to Life Orb and lacks any healing. Hazard support of your own is also important, most notably for putting Slowking into OHKO range for +2 Thunder Punch.</p> <p>Regirock takes a maximum of approximately 75% from +2 Earthquake, which means Charizard can't beat it alone. This set therefore works best alongside another Pokemon that Regirock counters, such as Tauros or Typhlosion. Since Regirock lacks reliable recovery, you can have Charizard weaken it to allow your Tauros to sweep, or vice versa. Pokemon that Slowking counters, such as Medicham and Floatzel, are also good partners for similar reasons. Water / Ground types and physically defensive Water-types such as Poliwrath counter this set, so it's a good idea to bring a Grass-type that can switch in on them. This set is relatively easy to revenge kill, especially after Flare Blitz and Life Orb recoil have taken their toll, so your team will need solid answers to Tauros, Floatzel, and common Choice Scarf users such as Medicham and Gardevoir.</p>"
      },
      "Choice Specs": {
        "description": "<p>Choice Specs Charizard has a couple of notable advantages over the more common Life Orb variant. The extra power allows Charizard to 2HKO Lickilicky and Hypno with Fire Blast and potentially OHKO Regirock with Focus Blast after Stealth Rock damage, whereas Life Orb Charizard falls short. In addition, the lack of recoil means Charizard can switch in at least twice per match even if you can't keep Stealth Rock off the field, whereas Life Orb Charizard can only switch into Stealth Rock once if it attacks but doesn't use Roost. The downside, of course, is that Choice Specs requires more prediction to use effectively, and Charizard loses the option of using Roost to heal itself when it forces a switch, making any damage it takes permanent.</p> <p>Fire Blast is the primary STAB move and the attack you'll be looking to use once you've weakened or KOed the opposing Pokemon that resist it. Air Slash has better accuracy and provides good neutral coverage alongside Fire Blast, most importantly against opposing Fire-types. Hidden Power Grass hits Water- and Rock-types, although it unfortunately falls short of 2HKOing most Slowking and Politoed unless you have multiple layers of entry hazards set up. Focus Blast OHKOes Regirock that don't fully invest in Special Defense and also hits many other common switch-ins hard.</p> <p>Flamethrower and Overheat are worth a look as alternative STAB moves. If you're willing to give up Focus Blast's coverage, running Flamethrower and Overheat together gives Charizard great flexibility in choosing between power and reliability depending on the situation. However, Fire Blast remains the primary option due to the 2HKOs it achieves against common special walls.</p> <p>Choice Specs Charizard is a decent lead choice, as leading gets it into the battle without worrying about Stealth Rock. Whether it leads or not, Charizard obviously benefits from Rapid Spin support. It also appreciates support from Skuntank to help remove Slowking, and it works well with other Pokemon that Regirock counters, such as Typhlosion and Dodrio, since it can knock Regirock out of the game with a single Focus Blast.</p>"
      },
      "Dragon Dance": {
        "description": "<p>Charizard is one of the few Pokemon with access to Dragon Dance in NU, and it's the only one with enough Speed to outspeed most Choice Scarf users after a boost. This makes it a dangerous late-game sweeper that can run over offensive teams that expect to rely on revenge killers to deal with Charizard. Flare Blitz is Charizard's primary STAB move, Earthquake covers Rock- and Fire-types, and Thunder Punch zaps Water-types. It's important to note that Charizard is not especially powerful at +1 and cannot OHKO anything with decent physical bulk that isn't weak to Flare Blitz, so you'll need to soften up the opponent's defensive core before attempting to sweep.</p> <p>Rapid Spin support is absolutely critical for Charizard to have a chance at sweeping, since recoil from Flare Blitz and Life Orb will deplete its HP very quickly. With only a +1 boost to its mediocre base 84 Attack, Charizard cannot OHKO most walls, so it appreciates teammates that can lure out and weaken the opponent's Water- and Rock-types as well as other physically defensive Pokemon such as Sandslash and Lickilicky. Tauros is a good partner, as it tends to draw out the opponent's physical walls and can weaken them with its coverage moves. Stacking multiple layers of Spikes is also an option, as that can help push Pokemon such as Politoed, Cradily, and Tauros into OHKO range.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Honko", "user_id": 42413}], "teams": [{"name": "Quality checked by", "members": [{"username": "Oglemi", "user_id": 40358}, {"username": "Bughouse", "user_id": 52547}, {"username": "Jirachee", "user_id": 61836}]}, {"name": "Grammar checked by", "members": [{"username": "frenzyplant", "user_id": 185509}, {"username": "Lumari", "user_id": 232216}]}]}
  },
  "Vileplume": {
    "overview": "<p>Vileplume is a very solid but unspectacular Pokemon in NU. Its Grass / Poison typing isn't ideal for a defensive Pokemon in a metagame where many of the most dangerous attackers are Fire- and Psychic-types, and Vileplume's extremely shallow attacking movepool and low Speed prevent it from being a significant offensive threat. However, while it can't carry a team on its own, Vileplume is still a very effective and common Pokemon thanks to its nice support movepool, balanced combination of bulk and power, and great synergy with other common defensive Pokemon such as Slowking and Regirock. It's not the type of Pokemon that you need to worry about countering when you're building a team, but it will consistently pull its weight when included in a well-built core.</p>",
    "comments": "<h1>Other Options</h1> <p>Vileplume can mimic Venusaur's flagship UU tank set by running Sleep Powder, Moonlight, and two STAB moves with Life Orb and an offensive EV spread, but Vileplume's low Speed and inability to learn Leaf Storm make it a poor imitation. You're usually better off using Sunny Day if you want Vileplume to go on the offensive. Grass Knot can replace Energy Ball on the defensive set for significantly higher power against Regirock, Lapras, and Walrein, but it fails to OHKO Whiscash, Floatzel, and Gorebyss and prevents Vileplume from being able to break Haunter's Substitute, so Energy Ball's consistent power is preferable. Giga Drain is another alternative Grass-type STAB option that offers some additional healing, but its low Base Power makes it an inferior choice in most cases. Hidden Power Ground hits Skuntank and Magneton super effectively, making it Vileplume's best coverage move if you can find a moveslot for it. Like nearly every Grass-type Pokemon, Vileplume has access to Swords Dance, but given its poor Attack and Speed and its extremely shallow physical movepool, you're better off choosing one of the half dozen other Grass-types in the tier that can use it more effectively.</p> <h1>Checks and Counters</h1> <p>Sleep Powder makes Vileplume very difficult to truly counter when it first appears on the battlefield. Hypno is the safest switch-in thanks to Insomnia and its excellent Special Defense, but it needs Psychic as its attacking move if it wants to beat Vileplume one-on-one; Vileplume can usually outlast the more common Seismic Toss Hypno by poisoning it with Sludge Bomb. Certain Pokemon with a moveslot to spare, such as Typhlosion and Dodrio, can afford to run Sleep Talk if they want to counter Vileplume as well. If you don't have one of these somewhat niche counters, you're probably going to have to let one of your Pokemon get put to sleep.</p> <p>Once Sleep Clause is activated, Vileplume becomes much easier to counter. Poison-types such as Skuntank and Venomoth are solid switch-ins that take very little damage from Vileplume's STAB attacks. Gardevoir has excellent Special Defense and can OHKO Vileplume with Psychic. In addition, Trace will copy Vileplume's Chlorophyll, making Gardevoir perhaps the best answer to the Sunny Day set. Against the defensive set, Fire-types, especially Charizard, can switch in on Grass-type moves and force Vileplume out. Other powerful attackers such as Medicham, Jynx, and Dodrio will take a decent amount of damage if they switch in on an attack, but Vileplume can't OHKO any of them, and once they're in, they can easily outspeed and OHKO Vileplume with their super effective STAB moves. Against the Sunny Day set, Choice Scarf users such as Typhlosion, Charizard, Magmortar, and Manectric can always outspeed and OHKO Vileplume in spite of the Chlorophyll boost.</p>",
    "sets": {
      "Defensive": {
        "description": "<p>Vileplume's nice support movepool and above-average bulk make it a natural fit for a defensive role. It's one of the few viable Pokemon in NU with access to a reliable sleep-inducing move, and it can back that up with reliable recovery and two complementary STAB attacks powered by a solid base 100 Special Attack. Vileplume can't take on NU's top attackers, such as Charizard, Medicham, and Jynx, so you shouldn't rely on it to be your primary defensive Pokemon, but it pairs very well with other common defensive Pokemon. In particular, the combination of Slowking, Regirock, and Vileplume is a popular and effective defensive core. Whether it's as part of that core or in some other team composition, Vileplume brings a lot to the table with its ability to counter Grass-types such as Shiftry, check most other physical attackers, put a dangerous Pokemon to sleep, and absorb Toxic Spikes.</p> <p>It's important to note that defensive Vileplume faces some competition from Meganium, which has better defenses and arguably a better defensive typing for NU, and Roselia, which is one of the few Pokemon in the tier that can set up Spikes. However, Meganium is significantly weaker offensively and lacks a secondary STAB move to discourage Fire- and Grass-types from switching in, and Roselia's much lower HP and Defense stats leave it unable to take on any of the physical attackers that Vileplume beats. Furthermore, neither of them can use a reliable sleep-inducing move (unless Roselia forgoes Spikes, but that would mean giving up its biggest selling point). Vileplume's balanced combination of Sleep Powder, good defenses, and just enough offense makes it the best choice for many teams.</p> <p>The nature and EV spread focus on Defense because Vileplume's typing is better suited to taking on physical attackers in a tier where Fire, Psychic, and Ice are all common special attacking types. However, you can switch to a more specially defensive spread of 252 HP / 60 Def / 196 SpD with a Calm nature if you want Vileplume to be able to better take on Haunter and Water-type special attackers such as Gorebyss and Golduck. The 60 Defense EVs in that spread allow Vileplume to always survive Choice Band Tauros's Double-Edge after Stealth Rock and respond by putting it to sleep.</p> <p>Vileplume learns several other useful support moves, most notably Aromatherapy and Stun Spore, but it's difficult to find a place for them on this set. Although Sleep Powder is probably Vileplume's best move, you can drop it for another support move if your team is built around spreading paralysis or poison or if you're using another sleep inducer, such as Jynx, on your team. Dropping Sludge Bomb is also an option, but this makes Vileplume a less effective counter to offensive Grass-types and also makes it easier for opposing Fire- and Flying-types to switch in. Vileplume can also use Leech Seed in place of Moonlight for a more aggressive type of healing at the expense of reliable longevity.</p> <p>This set needs teammates that can counter the powerful Fire- and Psychic-types that dominate NU, such as Charizard, Medicham, and Jynx, as well as the more powerful physical attackers that Vileplume can't switch into, such as Tauros and Dodrio. As mentioned earlier, Slowking and Regirock can counter all of those threats and more, and they also appreciate Vileplume's ability to counter Grass-types and absorb Toxic Spikes. Other good options for defensive teammates include Hypno, Gligar, and Dusclops.</p>"
      },
      "Sunny Day": {
        "description": "<p>Although Vileplume is most commonly seen in a defensive role, it can also turn itself into an offensive threat by setting up Sunny Day. In the sun, Vileplume outspeeds every relevant unboosted Pokemon in the tier and gains access to a much more powerful STAB move in Solar Beam. With Sludge Bomb for coverage on Fire- and Grass-types and Sleep Powder to put a counter out of commission, Vileplume can be very difficult to handle for teams that lack a Choice Scarf user that can OHKO it.</p> <p>The biggest flaw of this set, and the reason it isn't more commonly seen, is that Victreebel can run the same set but with a higher Speed stat that allows it to outspeed Choice Scarf users and a powerful Weather Ball that allows it to OHKO a few Pokemon that Vileplume misses out on, such as Skuntank, Drifblim, and opposing defensive Vileplume. Sunny Day Vileplume's only tangible advantage over Victreebel is its much greater bulk, which allows it to survive a hit before setting up Sunny Day in situations where Victreebel would be unable to. Vileplume also has some surprise factor going for it, as it usually runs a more defensive set, which means the opponent is more likely to make a passive play such as switching out to bring in sleep fodder, inadvertently giving Vileplume the chance to set up Sunny Day for free. Victreebel, on the other hand, virtually always runs an offensive Sunny Day set, meaning the opponent is more likely to attempt to OHKO it before it gets a chance to set up. Overall, Vileplume can work quite well as a mid- or late-game standalone sweeper, but make sure that Victreebel isn't a better fit for your team.</p> <p>The EV spread maximizes Vileplume's power and gives it enough Speed to outspeed every unboosted Pokemon in the tier except Electrode, with the leftover EVs going into HP to reinforce Vileplume's natural bulkiness. Switching to a Timid nature with maximum Speed investment allows it to outspeed Choice Scarf users with base 80 Speed, such as Medicham and Drifblim, but if you want a sun sweeper that can outspeed Choice Scarf users, you're usually better off choosing Victreebel. Hidden Power Fire can replace Sleep Powder in order to OHKO a few of the Pokemon that resist both of Vileplume's STAB moves, such as Magneton and Venomoth, especially if your team has another sleep inducer or is focused on spreading other statuses, but the ability to put a counter to sleep is a big part of what makes Vileplume dangerous. You could also use Hidden Power Fire over Sludge Bomb, but this makes Vileplume completely dependent on Sleep Powder to take on Fire-types and leaves it without a dependable attack to use in cases where it doesn't have a chance to set up Sunny Day, so it's not recommended.</p> <p>A fast Fire-type such as Choice Scarf Typhlosion is a good partner for this set thanks to its ability to clean up with sun-boosted STAB Fire Blast or Eruption if the opponent manages to force out or KO Vileplume before Sunny Day expires. You should also have a solid counter for the same fast Fire-types in order to prevent them from coming in after a KO and turning the tables on you with a sun-boosted sweep of their own. Regirock handles Fire-types very well and can also set up Stealth Rock to help weaken the opposing team's Fire-, Flying-, and Bug-types that resist Solar Beam, making it easier for Vileplume to sweep. Slowking is even more of a hard stop to Fire-types thanks to its high Special Defense, access to instant recovery, and resistance to most Fire-types' main coverage move in Focus Blast, but keep in mind that Sunny Day halves the power of its Surf.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Honko", "user_id": 42413}], "teams": [{"name": "Quality checked by", "members": [{"username": "Oglemi", "user_id": 40358}, {"username": "Bughouse", "user_id": 52547}]}, {"name": "Grammar checked by", "members": [{"username": "frenzyplant", "user_id": 185509}, {"username": "Lumari", "user_id": 232216}]}]}
  },
  "Victreebel": {
    "overview": "<p>Victreebel is widely regarded as the most immediately dangerous weather sweeper in the metagame. Due to its solid offensive stats, Chlorophyll, moves such as Sleep Powder and Weather Ball, and its Toxic immunity, it can harass offensive and bulky teams alike under sun. Its strong Grass-type STAB moves in Solar Beam and Leaf Storm are especially effective at threatening metagame staples such as Regirock and Slowking.</p> <p>Nonetheless, Victreebel's Speed outside of sun and bulk are pretty lackluster, and weaknesses to common types such as Fire and Psychic make Victreebel easy to revenge kill and hard to bring safely onto the field. Therefore, it relies a lot on sun to accomplish anything against offensive teams. Furthermore, while Victreebel is certainly powerful, its Special Attack isn't enough to reliably break through common special walls such as Cradily, Lickilicky, and Hypno. The omnipresent Skuntank is also very troublesome, as it resists Victreebel's STAB moves and threatens it with Pursuit and Sucker Punch.</p>",
    "comments": "<h1>Other Options</h1> <p>Victreebel with a Timid nature can turn itself into a self-sufficient sweeper by using Sunny Day and outspeeding common Choice Scarf users such as Typhlosion and Manectric, something that Vileplume cannot accomplish. However, it takes away an important moveslot, and Victreebel's bulk makes it difficult to successfully pull off. Swords Dance in tandem with Leaf Blade lets Victreebel lure in and dent typical switch-ins such as Cradily and Lickilicky and can be very difficult to deal with under sun. However, Shiftry is usually a better user of Swords Dance due to its STAB on Sucker Punch and better physical movepool. Choice Scarf makes Victreebel a revenge killer with a fast Sleep Powder, but its STAB attacks are easily covered and being locked into Leaf Storm can be very punishing. Other disrupting moves such as Encore and Stun Spore have some merits once Sleep Clause is underway, but they are hard to fit onto a set.</p> <h1>Checks and Counters</h1> <p>Special walls such as Cradily and Lickilicky take most of Victreebel's hits fairly well and stall it out as long as they avoid Sleep Powder and, to a lesser extent, Sludge Bomb poison. Such walls are especially harmful if Victreebel's team relies on sun and can't afford to waste turns. Hypno gets a special mention due to Insomnia, which allows it to shrug off Sleep Powder. Drifblim resists Victreebel's STAB moves, can play around Sleep Powder with either Substitute or Chesto Berry, and can attempt to set up with Calm Mind. Nonetheless, it should be wary of setting up against a Victreebel under sun, seeing that a boosted Weather Ball does up to 70%. It also takes a noticeable amount of damage from Leaf Storm with Stealth Rock down and should be wary of Sucker Punch. Poison-types naturally check Victreebel due to their typing; Skuntank in particular is extremely dangerous, as it outspeeds Victreebel and can threaten it with Pursuit and Sucker Punch if sun is active, although Leaf Storm is quite threatening for it. Venomoth can stomach a Leaf Storm with relative ease and force Victreebel out. However, both of these Pokemon need to avoid Weather Ball in sun as well as Sleep Powder. Although much rarer, Muk is a solid counter to Victreebel due to its naturally great special bulk and power.</p> <p>Outside of sun, Victreebel's lackluster Speed leaves it very susceptible to faster Pokemon such as Charizard, Magmortar, Tauros, Haunter, Jynx, Medicham, and many more. Choice Scarf Typhlosion and Manectric are fast enough to revenge kill Modest Victreebel under sun, as are Shiftry and Gardevoir thanks to Chlorophyll and Trace. Even in sun, Victreebel's frailty remains a problem against strong priority users like Skuntank and Cacturne. However, Sleep Powder enables Victreebel to play around them. Fake Out users, such as Medicham, not only severely cripple Victreebel but also stall out precious sun turns. Finally, while much less common, Ice Shard users like Piloswine and Sneasel threaten Victreebel with a potential OHKO.</p>",
    "sets": {
      "Chlorophyll Sweeper": {
        "description": "<p>This set is one of the main reasons why sun is a solid team archetype in NU. Sleep Powder stops opposing Pokemon from disturbing Victreebel and its teammates. Solar Beam is a powerful STAB attack without any drawbacks under sun. Weather Ball in sun threatens common checks to Victreebel such as Drifblim and Skuntank with a potential OHKO after Stealth Rock damage. Sludge Bomb is a secondary STAB move that hits Fire-types very hard and is Victreebel's most consistent attacking move when sun is gone. However, Hidden Power Rock can also be considered, as it OHKOes Charizard and heavily damages Drifblim, which otherwise would freely set up on Victreebel outside of sun.</p> <p>Maximum investment in Special Attack allows Victreebel to get the aforementioned KOs when holding a Life Orb. A Timid nature with 252 EVs in Speed is recommended in order to outspeed some of the most common Choice Scarf users, such as Typhlosion and Manectric, under sun, with the former being very threatening for sun teams. Nonetheless, Modest should also be considered for a very likely OHKO on Skuntank and Drifblim with Weather Ball after Stealth Rock, both of which could shrug off Sleep Powder with Lum Berry or Chesto Berry and cause major trouble otherwise.</p> <p>On dedicated sun teams, Regirock is highly recommended as a Sunny Day user due to its access to Stealth Rock and ability to check opposing Fire-types that could take advantage of sun. Other notable sun setters are Persian and Jumpluff, as they can reliably set it in the lead position due to their Speed and various disrupting moves such as Taunt and Sleep Powder. Shiftry is another staple of sun teams and can get rid of most of Victreebel's answers. With Sucker Punch, it can threaten the very troublesome Gardevoir that revenge kills Victreebel by virtue of its ability Trace. Shiftry is also able to break through problematic special walls such as Cradily and Lickilicky with Explosion or moves boosted by Swords Dance or Nasty Plot. Fire-types provide a strong offensive presence with their sun-boosted STAB moves and ability to reliably use Solar Beam. Typhlosion in particular is very dangerous with its extremely powerful Eruption. Ninetales is also a good candidate due to its ability Flash Fire, which permits it to absorb Fire-type attacks aimed at Victreebel and its teammates, becoming tremendously powerful by doing so. Skuntank is a valuable partner, as it can use Pursuit to threaten the very bothersome Gardevoir as well as Hypno, which ignores Sleep Powder and can take Victreebel's attacks quite well.</p>"
      },
      "Non-sun Attacker": {
        "description": "<p>While it faces competition from the more popular Shiftry outside of dedicated sun teams, Victreebel distinguishes itself thanks to its access to Sleep Powder, Toxic immunity, and better Special Attack. Sleep Powder makes Victreebel harder to play around, and it can be very rewarding because most teams only have one reliable switch-in to Leaf Storm from Victreebel. Leaf Storm is Victreebel's strongest attack, scoring an OHKO on Regirock and most Slowking variants. Keep in mind that it should be used carefully, as the Special Attack drop essentially forces Victreebel out. Sludge Bomb is a reliable STAB attack that deals a lot of damage to Fire- and Grass-types that would be tempted to switch into Leaf Storm. It can also inflict poison, which is extremely annoying for bulky Pokemon that cannot afford to have their Leftovers recovery cancelled. However, be wary of poisoning a foe that would be more hindered by Sleep Powder.</p> <p>Morning Sun is a semi-reliable form of recovery that allows Victreebel to counterbalance the health loss induced by Life Orb, entry hazards, and other sources of damage. It also drastically improves Victreebel's matchup against stall teams, as it allows Victreebel to switch in on Pokemon such as Cradily, specially defensive Regirock, Meganium, and Politoed throughout the match. However, Victreebel can make use of its base 105 Attack by using Sucker Punch to deter Pokemon such as Haunter, Jynx, Gardevoir, and various weakened Choice Scarf users from revenge killing it, which makes Victreebel more menacing for offensive teams instead.</p> <p>Maximum Special Attack investment and Life Orb allow Victreebel to OHKO Slowking with Leaf Storm. The remaining EVs are dumped into Speed in order to outspeed Pokemon like defensive Gardevoir and Meganium that would be tempted to invest into Speed as well. Modest is usually the nature choice, but a Timid nature can be chosen to outspeed Pokemon sitting at base 80 such as Medicham, Gardevoir, and Shiftry with a neutral nature. Rash is recommended if Victreebel packs Sucker Punch.</p> <p>Thanks to its typing, Victreebel absorbs Toxic Spikes upon entry and can serve as an offensive check to Poliwrath lacking Ice Punch, a trait greatly appreciated by bulky Pokemon such as Regirock, Cradily, Lickilicky, and Sableye. In return, these Pokemon make solid defensive backbones, potentially checking offensive threats that tend to force Victreebel out like Charizard, Skuntank, Tauros, Gardevoir, Jynx, Magmortar, Haunter, Drifblim, and Medicham. Furthermore, Cradily and Regirock can set up Stealth Rock, which limits Charizard's, Jynx's, Magmortar's, and Drifblim's ability to revenge kill Victreebel. Victreebel tends to struggle against specially defensive Pokemon such as Cradily, Lickilicky, and especially Hypno, which has the luxury of safely switching into Sleep Powder by virtue of Insomnia. Therefore, physical wallbreakers such as Tauros, offensive Regirock, and Medicham are teammates of choice. Nonetheless, Victreebel can still cripple its defensive checks with Sleep Powder or, to a lesser extent, poison induced by Sludge Bomb. Other specially offensive Pokemon, such as Haunter and Charizard, may have an easier time getting past the aforementioned special walls if Victreebel statuses them beforehand. With Hypno and Drifblim being some of Victreebel's biggest nemeses, Skuntank is naturally a good partner, as it can get rid of both of these annoyances with Pursuit. It also helps against other troublesome Pokemon like Gardevoir, Haunter, and Jynx.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Wenderz", "user_id": 331114}], "teams": [{"name": "Quality checked by", "members": [{"username": "Oglemi", "user_id": 40358}, {"username": "Bughouse", "user_id": 52547}, {"username": "Rabia", "user_id": 336073}, {"username": "Honko", "user_id": 42413}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}, {"username": "Rabia", "user_id": 336073}]}]}
  },
  "Typhlosion": {
    "overview": "<p>Typhlosion is one of the most dangerous Fire-types in DPP NU, and probably one of the best Choice item users in the tier. It possesses a powerful, accurate, and spammable STAB move in Eruption, a nice Speed tier, and an awesome ability in Blaze. Additionally, it isn't as weak to Stealth Rock as Charizard, losing only 25% per switch in rather than Charizard's 50%.</p> <p>However, outside of using Choice items, Typhlosion faces stiff competition from Charizard, Magmortar, and other Fire-types for a teamslot, as said alternatives are more adept at using non-Choice sets.</p>",
    "comments": "<h1>Other Options</h1> <p>In terms of coverage, Earthquake can be run to hit Fire-types, while Hidden Power Water can be used to hit Camerupt. Overheat is not as spammable as Typhlosion's other Fire-type moves and is more situational than the criteria of \"be at high HP\" that Eruption requires. Sleep Talk can be used over a coverage move if you need a sleep absorber.</p> <p>Additional options include a set with Solar Beam and Sunny Day and a Substitute / Protect / Toxic / Flamethrower set with maximum Speed.</p> <p>In terms of alternative items, Charcoal and Expert Belt can be used to bluff a Choice item. Life Orb's HP-sapping effect clashes with Eruption and is done better by Charizard and Magmortar. For non-Choice sets in general, you're probably better off using Charizard (due to its STAB Air Slash, Roost, Ground immunity, and boosting moves) or another Fire-type.</p> <h1>Checks and Counters</h1> <p>Politoed is the best initial switch-in to Typhlosion, as it isn't Pursuit-weak. Other good initial switch-ins to Typhlosion are bulky Psychic-types such as Slowking, Hypno, and Grumpig, but all of these dislike Skuntank, which is often paired with Fire-types. Regirock is a good check to Typhlosion if it avoids Focus Blast. Lickilicky and Poliwrath are other viable switch-ins to Typhlosion, though Poliwrath is less adept at handling Choice Specs Typhlosion.</p> <p>Strong priority users like Skuntank, Hitmonchan, and Floatzel can damage Typhlosion and limit the strength of its Eruption. Any non-Choice Scarf set is revenge killed by Tauros, Floatzel, and strong Choice Scarf users like Medicham.</p> <p>Stealth Rock and other entry hazards reduce the strength of Typhlosion's Eruption. Beware of pushing Typhlosion into Blaze range while wearing it down, however.</p> <p>Other checks and counters to Typhlosion exist, but they are on the uncommon side: Whiscash, Quagsire, and Gastrodon handle it if they avoid Hidden Power Grass, specially defensive Camerupt and Flareon can check Typhlosion if it lacks Earthquake, and Mantine fends off Typhlosion if it lacks Hidden Power Electric. Do note that Mantine and Flareon are hindered by a Stealth Rock weakness, though.</p>",
    "sets": {
      "Choice Scarf": {
        "description": "<p>Typhlosion is a great late-game cleaner due to its high Speed and an excellent, accurate STAB move in Eruption. It should ideally be spamming Eruption, its main STAB move. When Typhlosion's health is lower, use Flamethrower or Fire Blast instead to benefit from Blaze as much as possible.</p> <p>Focus Blast is there mainly to damage Regirock. In the last slot, Hidden Power Grass is for foes like Whiscash, Quagsire, and Gastrodon. Hidden Power Rock can be used to OHKO Charizard and gives Typhlosion a better shot at dealing with Fire-types at the price of its perfect Speed IV. Hidden Power Electric hits Charizard and Mantine while retaining a super effective hit on the non-Ground / Water types.</p> <p>A Timid nature is recommended to outspeed and OHKO Choice Scarf Haunter and Choice Scarf Jynx and makes the most of Typhlosion's good Speed tier.</p> <p>Regirock and bulky Psychic-types have no issues in handling Typhlosion, so you'll want them taken out. Another Fire-type on your team can lure out Regirock and damage it, while Skuntank can come in and Pursuit trap Psychic-types. Tauros is another good candidate for weakening Regirock.</p> <p>A spinner is recommended to keep Eruption at maximum power. Hitmonchan and Sandslash are the best entry hazard removers in the tier.</p>"
      },
      "Choice Specs": {
        "description": "<p>Choice Specs is for wallbreaking. Spam Eruption at high health. Spam Fire Blast at low health; a Choice Specs Fire Blast enhanced further by Blaze is absurdly powerful.</p> <p>Focus Blast is there to invalidate Regirock. In the last slot, various Hidden Powers do various things; Hidden Power Grass KOes Pokemon like Whiscash, Quagsire, and Gastrodon, while Hidden Power Electric damages Charizard and Mantine.</p> <p>A Timid nature lets you turn non-Choice Scarf Jynx and non-Choice Scarf Haunter into roadkill. Maximum Speed is recommended to tie with other base 100s (Charizard in particular) and outspeed base 95s like Haunter and Jynx.</p> <p>The added power from Choice Specs makes Typhlosion better at damaging Regirock and Hypno. More support in eliminating Regirock and bulky Psychic-types still helps; Skuntank can eliminate the latter, while Tauros or another Fire-type can pressure Regirock or take advantage of a Regirock hit by Focus Blast to wreak havoc.</p> <p>A spinner is helpful in keeping Typhlosion's HP high. Hitmonchan and Sandslash are the best spinners in DPP NU and are decent at handling Rock-type attacks.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "ThriceElite", "user_id": 7104}], "teams": [{"name": "Quality checked by", "members": [{"username": "Bughouse", "user_id": 52547}, {"username": "Honko", "user_id": 42413}, {"username": "Oglemi", "user_id": 40358}]}, {"name": "Grammar checked by", "members": [{"username": "CryoGyro", "user_id": 331519}, {"username": "P Squared", "user_id": 168392}]}]}
  },
  "Hitmonchan": {
    "overview": "<p>Hitmonchan is one of the two reliable Rapid Spin users that exist in NU, with Sandslash being its only notable competition. It's also one of just three fully evolved Fighting-types in the tier, and the only one with access to Mach Punch or Close Combat. These rare traits make Hitmonchan a valuable member of a lot of teams. Outside of those niches, Hitmonchan is a powerful physical attacker with good coverage options in the Iron Fist-boosted elemental punches, but its poor physical bulk and relatively low Speed for an offensive Pokemon make it difficult to switch into battle, and it usually only has room for one coverage move on its sets, making it fairly easy to wall. It also suffers from being mostly outclassed as an attacker by Medicham, which is faster, is nearly 20% more powerful, and has access to useful secondary STAB moves.</p>",
    "comments": "<h1>Other Options</h1> <p>Hitmonchan can use Agility to set up a late-game sweep. After a boost, it outspeeds everything in the tier except Choice Scarf Manectric and Tauros, and it can clean up weakened teams quite well with Close Combat and both elemental punches. However, finding an opportunity to set up can be difficult, and you sacrifice the mid-game utility of Rapid Spin and Mach Punch by running Agility. Foresight allows Hitmonchan to spin against Dusclops and the rare defensive Misdreavus, but it's useless in every other matchup, as Hitmonchan already beats Haunter and Drifblim, the two most common Ghost-types, with the elemental punches. Choice Band and SubPunch sets aren't bad options, but they don't accomplish much that the Life Orb set can't already do, they limit Hitmonchan's ability to use its utility moves effectively, and they're outclassed by Medicham.</p> <h1>Checks and Counters</h1> <p>Dusclops is perfectly built to counter Hitmonchan. It's immune to Hitmonchan's STAB moves, blocks Rapid Spin, and isn't even 3HKOed by Life Orb-boosted elemental punches, meaning it can easily burn Hitmonchan and stall it out with Rest. Hypno can't block Rapid Spin or burn Hitmonchan the way Dusclops can, but it walls Hitmonchan's attacks just as effectively. If Hitmonchan lacks Thunder Punch, Slowking counters it extremely well. On the other hand, without Ice Punch, Hitmonchan can barely scratch Gligar, Nidoqueen, and Vileplume. Charizard, Gardevoir, and Medicham don't particularly enjoy switching into Hitmonchan, as Life Orb Close Combat will take out over 50% of their HP despite their resistance to Fighting, but once they're in, they can outspeed Hitmonchan and OHKO it with their STAB moves. Bug- and Poison-types such as Venomoth, Pinsir, and Muk also match up well, as Hitmonchan usually doesn't carry any moves that threaten them.</p>",
    "sets": {
      "Offensive Spinner": {
        "description": "<p>This set's combination of power and utility makes it a solid addition to offensive teams that need a spinner. Close Combat is a powerful STAB move that 2HKOes every NU Pokemon that doesn't resist it. Mach Punch is one of the strongest reliable priority moves in the tier thanks to the boost from Iron Fist, making Hitmonchan an effective revenge killer of frail or weakened offensive Pokemon. The elemental punches also receive boosts from Iron Fist and provide valuable coverage on the Pokemon that resist Hitmonchan's STAB moves; Ice Punch OHKOes Gligar and 2HKOes Nidoqueen and Vileplume, while Thunder Punch 2HKOes Slowking and OHKOes Charizard on the switch. Last, but certainly not least, Rapid Spin provides invaluable support, especially for teams featuring Pokemon that are weak to Stealth Rock, such as Charizard and Typhlosion.</p> <p>Life Orb is the best item on this set, as it gives Hitmonchan the power it needs to 2HKO common switch-ins like Slowking and Nidoqueen with the appropriate elemental punch. However, Black Belt is a viable alternative to boost Close Combat and Mach Punch without forcing Hitmonchan to take recoil damage when using Rapid Spin. The EV spread maximizes Hitmonchan's power and gives it enough Speed to beat neutral-natured base 70s such as Magneton and Poliwrath as well as the occasional Jolly Whiscash. The remaining EVs go into HP and Defense to slightly improve Hitmonchan's bulk without increasing Life Orb recoil. A bulkier spread of 128 HP / 252 Atk / 128 Spe is a reasonable alternative that still lets Hitmonchan outspeed neutral-natured base 60s and below.</p> <p>Bulky Psychic- and Ghost-types such as Hypno and Dusclops wall Hitmonchan effortlessly. This makes Skuntank a great partner, as it is perfectly built to shut down and cripple Psychic- and Ghost-type walls with its typing and access to Pursuit, Taunt, and Crunch. The offensive Fire-types that appreciate Hitmonchan's Rapid Spin support also appreciate Skuntank's ability to remove Pokemon such as Hypno, Slowking, and Grumpig from play; a team built around one or more Fire-types supported by Skuntank and Hitmonchan can be very difficult to deal with.</p> <p>Depending on which elemental punch you choose, Hitmonchan will also be walled by some additional Pokemon. Without Thunder Punch, Hitmonchan can't do meaningful damage to Slowking, so having Skuntank or another Pursuit user as a teammate is even more important. On the other hand, without Ice Punch, Hitmonchan is walled by Gligar, Nidoqueen, and Vileplume, so powerful Fire- or Psychic-type special attackers such as Charizard, Jynx, and Gardevoir are good teammates.</p>"
      },
      "Bulk Up": {
        "description": "<p>This set sacrifices power in exchange for better longevity, giving Hitmonchan a much better matchup against defensive teams that could simply wear down the Life Orb set. Bulk Up allows Hitmonchan to easily defeat defensive physical attackers that could otherwise 2HKO it, such as Sandslash and Quagsire. Drain Punch helps keep Hitmonchan healthy and has a respectable 75 Base Power thanks to Iron Fist. After a Bulk Up, Hitmonchan can survive an attack from many offensive Pokemon and OHKO them back with Drain Punch, restoring most of its lost HP in the process; examples include Tauros, Manectric, and Floatzel. Ice Punch is Hitmonchan's best coverage move, allowing it to hit every common defensive Pokemon except Slowking for at least neutral damage. The last slot is reserved for Rapid Spin. You could opt for another move in that slot to make Hitmonchan more threatening, such as Thunder Punch, Mach Punch, or Substitute, but Poliwrath and Medicham both have significant advantages over Hitmonchan as dedicated Bulk Up sweepers; Rapid Spin is what sets Hitmonchan apart.</p> <p>The EV spread maximizes Hitmonchan's Attack so that it can deal decent damage even when it doesn't get a chance to boost. 88 Speed EVs allow Hitmonchan to outspeed neutral-natured base 55s such as Cacturne and Relicanth, as well as minimum Speed Gligar and all other walls that don't invest in Speed. It's worth noting that Gligar and some other fast walls such as Gardevoir will sometimes invest in Speed, so you should consider adding a few more Speed EVs if you want to increase Hitmonchan's chances of outspeeding them.</p> <p>This set belongs on a team that needs Hitmonchan's Rapid Spin support, as otherwise Poliwrath and Medicham are better choices as Bulk Up users. Slower balanced or defensive teams generally prefer this set to the Life Orb variant thanks to its ability to stay healthy so that it can spin multiple times in a match if needed. Skuntank is a highly recommended teammate, as nearly every Psychic-type in the tier can safely switch into Hitmonchan and force it out.</p>"
      },
      "Choice Scarf": {
        "description": "<p>Hitmonchan's access to a 120-Base Power, 100% accurate STAB move and excellent super effective coverage from the elemental punches make it a solid revenge killer and late-game cleaner when equipped with a Choice Scarf. Close Combat OHKOes most offensive Pokemon after Stealth Rock or other chip damage, and Thunder Punch and Ice Punch cover most of the Pokemon that resist it. The last slot is mostly filler. Stone Edge OHKOes Charizard, which barely survives Thunder Punch from full health, and also hits Venomoth and Pinsir. Earthquake 2HKOes Muk, which shakes off any other move Hitmonchan throws its way, and can also be nice to have against Pokemon with Static or Flame Body, such as Manectric and Magmortar, because it does not make contact. Finally, although Rapid Spin is not a good move to be locked into, it can still be useful to have in case your opponent manages to stack a lot of entry hazards.</p> <p>This set competes directly with Medicham, which can run a similar set but with more power, slightly more Speed, and access to a secondary STAB move and Trick. However, Medicham's primary STAB move is High Jump Kick, which has a 10% chance to miss and the possibility of recoil damage that could cause Medicham to KO itself. Hitmonchan's access to Close Combat makes it a more reliable option if you don't need Medicham's extra power. Choice Scarf Hitmonchan also works well alongside Medicham; Life Orb Medicham can kick and punch massive holes into your opponent's walls, and then Choice Scarf Hitmonchan can clean up the rubble.</p> <p>With the boost from Choice Scarf, 216 Speed EVs allow Hitmonchan to outspeed every unboosted Pokemon in the tier except Electrode. Mach Punch and Fire Punch are alternative options in the last moveslot if you don't like any of the options listed. Mach Punch may seem strange on a Choice Scarf set, but it could save your team from being swept by Choice Scarf Typhlosion or Chlorophyll-boosted Shiftry. Fire Punch is an alternative to Stone Edge to hit Bug-types more reliably and is a relatively safe move to be locked into due to the lack of common Fire-immune Pokemon in NU.</p> <p>Choice Scarf Hitmonchan is most effective when you can click Close Combat without thinking, which means it needs teammates that can remove Ghost- and Psychic-types. As always, Skuntank is a great partner as the best Pursuit trapper in the tier. Wallbreakers such as Life Orb Medicham, Life Orb Magmortar, and Swords Dance Charizard are also excellent at KOing or severely crippling Slowking and other walls that could stop Hitmonchan from cleaning. Hitmonchan is relatively slow for a Choice Scarf user, which means it fits better on teams that have solid defensive answers to common faster Choice Scarf users such as Typhlosion and Manectric. Slowking and Regirock counter Typhlosion, and Nidoqueen is a great switch-in to Manectric.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Honko", "user_id": 42413}], "teams": [{"name": "Quality checked by", "members": [{"username": "Bughouse", "user_id": 52547}, {"username": "Oglemi", "user_id": 40358}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}, {"username": "P Squared", "user_id": 168392}]}]}
  },
  "Regirock": {
    "overview": "<p>Regirock is arguably the best tank in NU and inarguably one of the easiest Pokemon to fit on a team. Every serious NU team needs to be able to set up Stealth Rock, check Charizard, and check Tauros, and Regirock is an excellent choice for all three of those jobs. It also innately checks most other offensive Pokemon that don't have a super effective STAB move thanks to its remarkable bulk and respectable offensive presence. On top of that, it has access to Explosion, ensuring it will almost always at least trade one-for-one and preventing it from draining its team's momentum the way other defensive Pokemon sometimes do. Its only real flaw is its lack of a reliable recovery move, which makes it fairly easy to wear down, especially since it's often expected to counter multiple opposing Pokemon per match. That said, Regirock is a rock-solid pick for just about any team.</p>",
    "comments": "<h1>Other Options</h1> <p>If your team needs a lure to eliminate a Fighting- or Water-type in order for a teammate to sweep, Regirock equipped with a Chople or Passho Berry is the best you could ask for. Regirock can survive even the most powerful STAB moves from Choice Band Fighting-types and Choice Specs Water-types when holding the appropriate Berry, and it can respond with Explosion to take its target out.</p> <p>Regirock can run a mono-attacking Curse set with Rest, Sleep Talk, and Rock Slide. This set needs significant team support to remove the opponent's Water-, Ground-, Fighting-, and Grass-types before it can sweep, but with that support, it is a formidable sweeper. Alternatively, a more offensive Curse set with three attacks allows Regirock to punish opponents that respond to it passively. Most notably, after a single Curse, Regirock still outspeeds Slowking despite the Speed drop and can now 2HKO it with Stone Edge, and it also beats Sandslash that don't have Swords Dance or Toxic.</p> <p>Regirock is a decent Choice Band user that can surprise some of its usual counters early in the game with a boosted Ice Punch or Earthquake and come back in later to either dish out its powerful STAB Stone Edge or simply use Explosion for a nearly guaranteed OHKO. Regirock can also viably run a Substitute + Focus Punch set with Stone Edge and either Toxic or Explosion. It has no trouble finding opportunities to set up a Substitute, and teams that lack a bulky Rock-resistant Pokemon will be hard pressed to deal with it. The main reason these offensive sets are uncommon is that Regirock is so efficient at the more important role of setting up Stealth Rock, so for most teams it's easier to have it stick to that job and give the more dedicated offensive sets to another Pokemon.</p> <p>Counter allows Regirock to potentially KO bulky Ground-types without blowing itself up, but many Ground-types will try to set up on Regirock instead of attacking it immediately, so Explosion is generally the safer choice. Finally, Regirock can use a set with Block and Rest to attempt to trap and stall out an opposing Pokemon while potentially setting up with Curse. However, with the exception of defensive Sandslash, most of the Pokemon that commonly switch in on Regirock can disrupt it with Taunt or Encore, can boost their own Attack to prevent it from stalling them out, or simply have enough power to 3HKO it through Rest even after it has boosted with Curse.</p> <h1>Checks and Counters</h1> <p>Bulky Ground-types that aren't weak to Earthquake such as Sandslash, Gligar, and Quagsire have little to fear from Regirock other than Toxic and Explosion. More offensive Ground-types such as Whiscash, Marowak, and Rhydon can also switch in on Regirock at least once and force it out but will take non-negligible damage from Earthquake if Regirock has it. Poliwrath can switch in on any move other than Toxic or Explosion and then use Encore and Substitute to shut Regirock down if it doesn't switch out. Medicham and Hitmonchan can switch in on Regirock's STAB moves but dislike being paralyzed and take heavy damage from Earthquake. Dusclops and Sableye can burn Regirock and stall it out and are the only counters that don't fear Explosion. Physically defensive Grass-types with recovery such as Cradily, Meganium, and Vileplume are also solid defensive answers. For offensive teams that don't have room for a defensive counter, beating Regirock generally requires you to overload it with multiple attackers, as its bulk allows it to survive even super effective STAB attacks like Life Orb Hitmonchan's Close Combat and Choice Specs Magneton's Flash Cannon and cripple its attackers with Thunder Wave or KO them with Explosion.</p>",
    "sets": {
      "Offensive Tank": {
        "description": "<p>With this set, Regirock is a very reliable pivot and Stealth Rock setter that fits well on just about any offensive or balanced team. It easily switches in on common threats like Charizard and Tauros and can set up Stealth Rock multiple times per match. It's no mere passive entry hazard setter, however; with non-trivial Attack investment, Regirock's STAB Stone Edge is actually quite difficult to switch in on without a resistance. Earthquake provides perfect neutral coverage alongside Stone Edge and gives Regirock a more accurate attack to finish off weakened foes without risking Stone Edge's 20% chance to miss. If you're willing to give up Earthquake's coverage, Thunder Wave is always a useful move to cripple opposing offensive Pokemon and assist your own wallbreakers. If you opt for Thunder Wave in this slot, Rock Slide becomes a decent alternative to Stone Edge, as its flinch rate pairs nicely with paralysis, and it gives Regirock more than Stone Edge's 8 PP to work with. Explosion is the move that truly sets Regirock apart from other bulky Pokemon; it prevents Regirock from losing momentum when faced with a counter and allows it to almost always trade efficiently.</p> <p>Leftovers is great for any bulky pivot and is the most consistently useful item for Regirock, but there are some viable alternatives for more offensive teams that don't expect Regirock to stick around for too long. Custap Berry allows a weakened Regirock to throw out a last-ditch Stealth Rock or Explosion against a faster Pokemon before being KOed, and it's fairly easy for Regirock to activate given its excellent overall bulk. If you're using Regirock as your lead, Lum Berry is a good option to prevent it from being put to sleep on the first turn by Jynx or Venomoth.</p> <p>252 HP EVs improve Regirock's overall bulk, most notably making it very unlikely to be 2HKOed by Choice Band Tauros's Earthquake after Stealth Rock damage. 144 Attack EVs and an Adamant nature give Regirock enough power to always break Poliwrath's Substitute with Earthquake, preventing it from setting up on Regirock for free, and to almost always 2HKO Tauros with Stone Edge. 112 Special Defense EVs ensure that Choice Specs Charizard and Typhlosion will almost never OHKO Regirock with Focus Blast and that Life Orb Charizard's Focus Blast will never OHKO even after Stealth Rock damage. If you're using Rock Slide and Thunder Wave instead of Stone Edge and Earthquake, you may want to shift some more of the Attack EVs into Special Defense to help Regirock counter Pokemon like Life Orb Charizard and Substitute + Calm Mind Drifblim more consistently. On the other hand, if your team doesn't need Regirock to switch in on special attackers, maximizing Regirock's Attack is also a viable option that allows it to do serious damage to Pokemon like Hitmonchan and Nidoqueen that think they can switch in for free.</p> <p>This set works best on offensive-leaning teams, where it's meant to pivot in on Normal- and Fire-types a couple of times, set up Stealth Rock, fire off an attack or two, and then use Explosion to get a KO and safely bring in a sweeper. Most teams will want to have at least one other bulky Pokemon to switch in on the threats that Regirock can't handle. Slowking is a great partner that counters many of the Pokemon that give Regirock trouble, such as Poliwrath, Hitmonchan, and Gligar; this pairing is the most popular core in NU. Due to its lack of a recovery move, Regirock is prone to being worn down and therefore shouldn't be your team's only answer to Fire-types and Tauros, since they can work together to break past it. Slowking or another bulky Water-type can provide defensive backup against Fire-types, but more fast-paced teams can instead rely on an offensive check like Floatzel, Tauros, or Ninetales as your secondary method of keeping opposing Fire-types in line.</p>"
      },
      "Specially Defensive": {
        "description": "<p>Investing fully in Regirock's Special Defense makes it a more reliable counter to Fire-types and a great Stealth Rock setter for defensive teams. This set faces competition from Cradily, which not only can check some of the same Pokemon and set up Stealth Rock, but also has access to Recover. However, Regirock's resistances to Fire and Flying make it a better counter to Pokemon like Choice Specs Typhlosion and Choice Band Dodrio that are otherwise very difficult to switch into. Regirock's access to Thunder Wave and Explosion also makes it less of a momentum killer than Cradily, since opponents must respect the possibility that their switch-in will be crippled by one of those moves.</p> <p>Toxic is this set's best way to deal meaningful damage to most of its switch-ins and fits well on defensive teams. Protect stalls for additional Leftovers recovery and Toxic damage, scouts Choice item users, and punishes Medicham that think they can break through Regirock with High Jump Kick. Balanced teams may prefer to forgo Toxic and Protect in favor of Thunder Wave alongside either Explosion or Earthquake. Thunder Wave pairs well with Rock Slide's flinch rate, and it punishes offensive Pokemon that think they can switch in relatively freely on Rock Slide, such as Medicham and Shiftry. Explosion OHKOes most of the metagame despite this set's lack of Attack investment, and it prevents Pokemon like Poliwrath and Whiscash from setting up on Regirock. On the other hand, Earthquake prevents Pokemon like Nidoqueen and opposing Regirock from switching in and setting up their own entry hazards for free. On teams that have cleric support, Rest is also an option in the final moveslot that allows Regirock to continue countering its targets throughout the match without relying on Wish support for recovery.</p> <p>Maximizing Regirock's Special Defense allows it to counter all specially attacking Fire-types so long as it doesn't switch in on a Choice Specs-boosted Focus Blast. However, if Regirock is your team's only answer to Tauros, you can shift 52 EVs into Defense to ensure that its Choice Band-boosted Earthquake will never 2HKO Regirock after Stealth Rock damage.</p> <p>Since Regirock lacks a recovery move, Wish support is very useful to help it stay healthy, especially on stall teams. Lickilicky is the tier's best Wish passer, although it shares a Fighting-type weakness with Regirock that other teammates will need to handle. Gardevoir and Hypno are the tier's other notable Wish users, but they can be risky to use on stall teams due to their weakness to Pursuit. Cleric support from a teammate like Lickilicky, Vileplume, Meganium, or Grumpig is also helpful, especially if Regirock has Rest. Regirock needs a teammate that can handle Ground- and Fighting-types, especially if Rock Slide is its only attacking move. Slowking is a great teammate on balanced teams, but it's less popular on stall due to its Pursuit weakness and its inability to truly counter Fighting-types with Thunder Punch and Ground-types with boosting moves. Sableye and Dusclops are stall teams' best answers to Fighting-types, while Meganium is an excellent counter to Ground-types. It's also worth keeping in mind that Regirock shouldn't be your team's only response to Fire-types and Tauros, as they can work together to wear Regirock down due to its lack of reliable recovery. Your team should have at least one other Pokemon that can switch in on Fire-types or reliably revenge kill them.</p>"
      },
      "Rock Polish": {
        "description": "<p>With Rock Polish and a Life Orb, Regirock can be surprisingly effective offensively. Although it lacks the power to OHKO most Pokemon unless it hits them super effectively or uses Explosion, it does outspeed and 2HKO most of the metagame after a boost, and its excellent natural bulk makes it difficult to revenge kill even without any defensive investment. This set faces some competition from Rhydon, which gets STAB on Earthquake and hits significantly harder overall, but Regirock is able to set up much more easily and is significantly harder to revenge kill due to its greater bulk, lack of 4x weaknesses, and ability to outspeed many common Choice Scarf users after boosting its Speed. Regirock also has Explosion to almost guarantee that it will KO at least one foe even if it isn't able to sweep, although it can use Ice Punch in the final moveslot instead if you want Regirock to be able to muscle past Ground-types without sacrificing itself.</p> <p>A Jolly nature allows Regirock to outspeed Choice Scarf Medicham, Gardevoir, and Shiftry and Speed tie with Choice Scarf Magmortar, all of which can OHKO Regirock after it's taken any damage from Stealth Rock or Life Orb recoil. On the other hand, an Adamant nature gives Regirock the power to 2HKO walls such as Slowking and Cradily with Stone Edge without needing them to take entry hazard damage first, although Spikes support from Cacturne or Glalie can help make that a moot point. If Regirock lacks Explosion, it will be unable to break through physically bulky Ground-, Water-, and Grass-types like Poliwrath, Quagsire, and Meganium, so it needs a teammate that can switch in on them such as Victreebel or Vileplume. Conversely, a Regirock that has Explosion is likely to use it against those targets, potentially opening up a sweeping opportunity for a teammate such as Floatzel or Tauros.</p>"
      },
      "Sunny Day Support": {
        "description": "<p>Regirock is the perfect mid-game Sunny Day user for dedicated sun teams. Its bulk allows it to reliably set up both Stealth Rock and Sunny Day, and it can follow that up with Explosion to get out of the way so one of your sweepers can come in safely. It also naturally checks opposing Fire-types like Choice Scarf Typhlosion that might otherwise be able to use the harsh sunlight to countersweep you. Ideally, Regirock will only stay on the battlefield long enough to set up and then sacrifice itself, but its powerful Stone Edge is still useful in a few scenarios, such as when there is one turn of sun remaining and you need to burn a turn before setting it up again, or when faced with a Ghost-type that would otherwise set up a free Substitute.</p> <p>The straightforward EV spread gives Regirock enough bulk to reliably set up both Stealth Rock and Sunny Day while maximizing the power of its Explosion, almost guaranteeing that it will KO any target that doesn't resist it. You can shift some of the Attack EVs into Special Defense if you want to make it even easier for Regirock to set up, but keep in mind that this set really only wants to survive for three turns before ceding the stage to a Sunny Day sweeper.</p> <p>This set obviously belongs on a dedicated Sunny Day team. Victreebel and Shiftry are by far the two most dangerous Chlorophyll sweepers, and every sun team should carry at least one, if not both, of them. Fast Fire-types such as Choice Scarf Typhlosion are also good choices, since the sun powers up their STAB attacks but they aren't as dependent on it as Chlorophyll sweepers are, meaning they can act as a wincon even if you aren't able to keep sunlight active. Your sun team should also include at least two additional Sunny Day users, including one that can lead, since Regirock is too slow to set up Sunny Day against common Taunt leads. Persian and Jumpluff are much safer Sunny Day leads that outspeed most other leads and can use Taunt or Sleep Powder to keep opposing entry hazards out of play. Outside of the lead slot, Skuntank, Lickilicky, and Hypno are all good options for your third Sunny Day setter.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Honko", "user_id": 42413}], "teams": [{"name": "Quality checked by", "members": [{"username": "Bughouse", "user_id": 52547}, {"username": "Oglemi", "user_id": 40358}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}, {"username": "Empress", "user_id": 175616}]}]}
  },
  "Tauros": {
    "overview": "<p>Tauros is one of the very best offensive Pokemon in NU. It can double as a wallbreaker and revenge killer with a single set thanks to its excellent Speed, decent Attack, and access to powerful physical moves with good coverage. On top of that, it has solid physical bulk backed up by Intimidate and lacks a Stealth Rock weakness, making it easy to fit onto teams. The popularity of Regirock prevents Tauros from completely dominating the tier, but there is overall very little downside to using Tauros. If you have an open spot on your team and are looking for a Pokemon to fill it, Tauros is always a good choice.</p>",
    "comments": "<h1>Other Options</h1> <p>Equipping a Choice Scarf allows Tauros to outspeed and KO opposing Choice Scarf users and Speed-boosting sweepers that most other revenge killers cannot, including Choice Scarf Typhlosion, Choice Scarf Manectric, Dragon Dance Charizard, and Sunny Day Victreebel.</p> <p>Tauros can use Substitute effectively, as Intimidate helps it force switches and many teams' first response to Tauros is to try to paralyze it. A set of Substitute / Return / Earthquake / Stone Edge with Life Orb, Leftovers, or even a pinch Berry can punish those switches and protect Tauros from being hit with status or revenge killed. If you're feeling adventurous, you can swap out Stone Edge for Endeavor or Toxic to cripple some of the bulkier walls that Tauros would otherwise be unable to break without a Choice Band.</p> <p>Tauros has a bizarrely good special movepool, almost all of which is completely useless to it. However, if you really want to ruin a Gligar's day, Ice Beam or Blizzard from Life Orb Tauros should do the trick.</p> <h1>Checks and Counters</h1> <p>Regirock is the most common answer to Tauros, as Tauros fails to 2HKO it with Earthquake even when holding a Choice Band and with Stealth Rock up, and Regirock can cripple Tauros with Thunder Wave or 2HKO it with Stone Edge. However, Regirock lacks a recovery move and is often expected to check multiple offensive Pokemon each match, so it is prone to being worn down. Cradily is a more reliable counter thanks to its access to Recover and lack of weakness to Earthquake; the only thing it has to fear from Tauros is Iron Head.</p> <p>Physically defensive Dusclops is a hard counter that can cripple Tauros with Will-O-Wisp and stall it out with Rest, although the uncommon Payback has a chance to 2HKO if Dusclops switches in and Stealth Rock is up. Physically defensive Sableye is an even more guaranteed counter that doesn't have to rely on Rest for recovery, but it's a niche Pokemon that doesn't have much use outside of full stall teams. Defensive Porygon2 is also somewhat niche, but it can soften Tauros's attacks thanks to Trace copying Intimidate, and it becomes a solid counter if given significant Defense investment.</p> <p>No other walls can safely switch in on Choice Band-boosted Double-Edge when Stealth Rock is up, but there are several that can stall out Tauros one-on-one with recovery moves while it slowly KOes itself with Double-Edge recoil, including Meganium, Gligar, Quagsire, and Vileplume. The first three are also solid counters to any set that isn't holding a Choice Band.</p> <p>If you're looking for offensive checks, Haunter and Drifblim can switch in on Choice-locked Double-Edge and Earthquake for free and set up a Substitute, but it's risky to switch them in before you know Tauros's set because Life Orb Stone Edge OHKOes. Rhydon and Golem can switch in on Double-Edge, but Earthquake 2HKOes them both. Choice Scarf Magneton can check Tauros one time, but Choice Band Double-Edge 2HKOes it despite the resistance, and Earthquake obviously OHKOes. If all else fails, there are plenty of Pokemon that can revenge kill Tauros, especially after it has been weakened by entry hazards and recoil damage. Potential revenge killers include powerful Choice Scarf users such as Medicham and Typhlosion, naturally faster Pokemon such as Floatzel and Electrode, and powerful priority users such as Hitmonchan and Skuntank. Finally, sometimes your best bet is to use your own Tauros to check your opponent's Tauros, as Intimidate will weaken its attacks even if it stays in and wins the Speed tie.</p>",
    "sets": {
      "All-Out Attacker": {
        "description": "<p>When equipped with a Choice Band, Tauros is an effective wallbreaker, revenge killer, late-game sweeper, and check to physical attackers all at once. It outspeeds all but a handful of unboosted Pokemon in the tier, and Double-Edge OHKOes most offensive Pokemon and 2HKOes most defensive Pokemon that don't resist it. Earthquake is Tauros's most important coverage move and the move you will often want to use early in the match to weaken the inevitable Regirock switch-in. In the third slot, Pursuit is a fantastic utility move for eliminating Haunter and Jynx, as Tauros outspeeds and KOes them after a little bit of chip damage even if they stay in. Pursuit is also great for weakening other valuable targets that you expect to switch out, including slower offensive Pokemon like Charizard and Magmortar as well as special walls like Slowking and Politoed. Payback lacks the utility of Pursuit, but it's a viable alternative if you want Tauros to beat Ghost-types one-on-one; it consistently OHKOes Haunter and has a decent chance of 2HKOing Dusclops on the switch if Stealth Rock is up.</p> <p>Tauros can hit the entire metagame at least neutrally with its first three moves, so the last moveslot is flexible. Iron Head is a good option when using Choice Band, as it hits Cradily super effectively and is a relatively safe coverage move to lock Tauros into that allows neither Rock-types nor Ghost-types to switch in for free. If you're not worried about Cradily, choosing Return gives Tauros a recoil-free STAB move to use when you want to preserve Tauros's bulk early-game or prevent it from KOing itself with recoil damage late-game. On the other hand, Stone Edge prevents Drifblim from setting up on Tauros and adds super effective coverage against a few other physically bulky Pokemon that can tank Double-Edge, including Pinsir, Lapras, and Articuno. Stone Edge can also help against Charizard and Haunter when you're using Life Orb over Choice Band; Charizard will usually survive Life Orb-boosted Double-Edge from full HP, and Haunter always survives Life Orb Pursuit if it stays in, but Stone Edge OHKOes them both. Finally, Sleep Talk is an option if your team lacks another sleep absorber.</p> <p>A simple EV spread with maximum Speed and a Jolly nature allows Tauros to outspeed a lot of key threats including Manectric, Charizard, and Jynx as well as Speed tie with opposing Tauros. Choice Band is usually the best item for this set; Tauros isn't especially powerful, so it appreciates the extra boost that a Choice Band provides, and the lack of recoil damage helps Tauros make the most of its good physical bulk. However, Life Orb is an acceptable alternative on offensive teams that use Tauros more as a revenge killer and late-game sweeper and are willing to sacrifice its wallbreaking capabilities and defensive utility in order to avoid needing to switch out as often. Silk Scarf is another option that keeps Double-Edge's power high without the recoil of Life Orb, and it can allow Tauros to bluff a Choice set and perhaps nab a surprise KO, but it leaves Tauros helpless against Regirock and makes its Pursuit a lot less effective.</p> <p>Tauros is pretty self-sufficient and doesn't require any special support to be effective. That said, it pairs well with other Pokemon that share Regirock as a primary counter, such as Charizard, Typhlosion, and Dodrio, because together they can overload Regirock with their coverage moves. Medicham is also a good partner; between the two of them, Tauros and Medicham can break through any wall that isn't a Ghost-type.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Honko", "user_id": 42413}], "teams": [{"name": "Quality checked by", "members": [{"username": "Bughouse", "user_id": 52547}, {"username": "Oglemi", "user_id": 40358}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}, {"username": "CryoGyro", "user_id": 331519}]}]}
  },
  "Slowking": {
    "overview": "<p>Slowking is arguably NU's best defensive Pokemon thanks to its excellent mixed bulk, unique set of resistances, and access to a reliable recovery move. It's also capable of going on the attack with a wide special movepool and the ability to boost with Calm Mind and Nasty Plot or even set up its own Trick Room. Slowking's only major flaw is its weakness to Pursuit, particularly from Skuntank; it's risky to build a team that's too reliant on Slowking when it might get trapped and KOed or crippled early in the match. However, as long as you have a contingency plan for dealing with Pursuit, Slowking is one of the very best Pokemon in the tier.</p>",
    "comments": "<h1>Other Options</h1> <p>Slowking can use Signal Beam or Focus Blast to cover Grass / Dark types like Cacturne and Water / Dark types like Sharpedo with a single attack. Its only other notable coverage move is Hidden Power Grass, which Slowking can use on defensive sets to avoid being walled by Quagsire and Gastrodon or set up on by Whiscash and Crawdaunt. Grass Knot is the better choice when using Choice Specs for its ability to 2HKO opposing Slowking, but defensive sets appreciate Hidden Power Grass's consistent power against lighter targets like Whiscash and Gastrodon.</p> <p>Colbur Berry is a viable item if you want to improve Slowking's matchup against Skuntank. If Colbur Berry Slowking hits Skuntank with Thunder Wave or Surf on the switch, it has a good chance of winning the matchup without losing much HP at all. Even if Skuntank gets in safely, at worst the Colbur Berry will allow Slowking to switch out without taking too much damage from Pursuit.</p> <p>Slowking can run an offensive set with Nasty Plot and Slack Off to act as a wallbreaker, especially on a team that focuses on spreading paralysis. On that note, if one of your team's primary win conditions is having Slowking sweep with Calm Mind, Nasty Plot, or Choice Specs, it's not a bad idea to invest some EVs in Slowking's Speed so that it can outspeed paralyzed Choice Scarf users. 44 EVs is enough for Slowking to outspeed paralyzed Choice Scarf Medicham and Gardevoir, while 60 EVs will allow it to outspeed paralyzed Choice Scarf Magmortar and Pinsir as well.</p> <p>Yawn is an alternative status move that can force switches and build up entry hazard damage, although it's only really worth considering with Spikes support. If you're willing to forgo a coverage move, Protect is a viable option on defensive sets to scout Choice item users like Medicham, block Explosion from Regirock, and rack up extra Toxic damage and Leftovers recovery. Finally, Slowking can use Block alongside Calm Mind and Rest to trap a passive Pokemon, such as an opposing defensive Slowking, set up on it, stall it out of PP, and then attempt to sweep.</p> <h1>Checks and Counters</h1> <p>Skuntank is Slowking's biggest obstacle. Slowking can fight back to some extent with a combination of Surf, Thunder Wave, and good prediction, but ultimately it is unlikely to escape from Skuntank without losing most of its HP. This makes Skuntank very popular on teams that Slowking would otherwise excel against, limiting Slowking's overall reliability in the metagame.</p> <p>Cacturne, Shiftry, Sharpedo, and Crawdaunt can all switch in on either of Slowking's STAB moves and force it out. Cacturne can use this opportunity to set up Spikes, and Shiftry and Crawdaunt can potentially boost and sweep with Swords Dance and Dragon Dance, respectively. Bulky Grass-types without a secondary Poison typing, such as Cradily and Meganium, can switch in and beat most Slowking sets, especially if Slowking lacks Toxic. Similarly, bulky Water-types such as Quagsire, Politoed, and opposing Slowking are all safe switch-ins, although they need Toxic to do meaningful damage to Slowking. Toxic in general is something Slowking desperately wants to avoid, so lures like SubToxic Charizard can be very effective at wearing it down. Manectric and Magneton take a lot of damage from Surf and hate being paralyzed, but they can force Slowking out if they get in safely. Many other offensive Pokemon can force out or KO a weakened Slowking, but be careful not to underestimate its bulk; a healthy Slowking is very capable of absorbing a powerful hit from Pokemon like Life Orb Haunter and Choice Band Tauros and actually coming out on top.</p>",
    "sets": {
      "Defensive": {
        "description": "<p>Slowking is a natural check to many of NU's top attackers, including Charizard, Medicham, and Jynx, making it a great foundation for a defensive core. Slack Off sets Slowking apart from other defensive Psychic- and Water-types, most of which lack access to an instant, reliable recovery move. Slowking's STAB moves have good coverage and power for a defensive Pokemon, with Surf hitting most of the Pokemon that Slowking wants to counter at least neutrally and Psychic covering some common Water-resistant Pokemon like Poliwrath and Vileplume. Thunder Wave neuters most offensive Pokemon, which makes Slowking difficult for offensive teams to switch in on and ensures that it can turn Pokemon like Tauros and Medicham into non-threats even if it doesn't live to tell the tale. Thunder Wave also gives Slowking a much better chance to escape from or defeat Skuntank by paralyzing it as it switches in. On the other hand, Toxic allows Slowking to take on its defensive switch-ins; without it, Slowking is helpless against walls like Lickilicky, Cradily, Quagsire, and opposing Slowking. You can replace Psychic with Fire Blast in order to surprise and OHKO some of Slowking's most common offensive switch-ins, including Shiftry, Cacturne, and Magneton, at the cost of leaving Slowking completely reliant on Toxic against opposing Water-types.</p> <p>The EV spread gives Slowking balanced defenses that allow it to comfortably counter specially attacking Fire-types while also holding its own against most physical attackers, especially with Thunder Wave. Specifically, a Calm nature and 96 EVs in Special Defense ensure that Slowking will never be 2HKOed by Hidden Power Grass from Choice Specs Charizard or Typhlosion or by Thunderbolt from Choice Scarf Magmortar, even after Stealth Rock damage. Feel free to customize the spread based on what your team needs Slowking to counter; if Slowking has a specially defensive Regirock or Lickilicky as a teammate, for example, you may want to put more EVs into Defense to make Slowking a better check to Hitmonchan and Medicham and reduce its vulnerability to Pursuit.</p> <p>This set can fit on a wide variety of teams, but any team that it's on needs to plan around opposing Skuntank. It's a good idea to have secondary checks to Fire- and Fighting-types to prevent your team from falling apart in case Slowking gets trapped and eliminated with Pursuit. Regirock and Cradily are good teammates to help out against Fire-types, while Gligar and Sableye are solid options on defensive teams to help deal with Fighting-types. Slowking also appreciates teammates that can handle Electric- and Grass-types. Nidoqueen, Vileplume, Meganium, and Camerupt are all decent options to fill in those gaps.</p>"
      },
      "Offensive Trick Room": {
        "description": "<p>Slowking is indisputably the best Trick Room user in NU. It has the bulk to reliably set Trick Room up and the power, coverage, and low Speed to take advantage of it. Whether as part of a dedicated Trick Room team or as a standalone sweeper, this set allows Slowking to turn the tables on opponents that expect to be able to force it out with Pokemon like Magneton, Manectric, and Tauros, all of which it can outspeed and OHKO with Life Orb-boosted Surf when Trick Room is active. STAB Psychic provides the best overall coverage, hitting most Pokemon that resist Surf for at least neutral damage. Nasty Plot gives Slowking the ability to sweep through defensive teams, taking advantage of foes that try to stall out Trick Room turns with Protect or recovery moves. However, if you're not worried about the matchup against stall, you can drop Nasty Plot for Ice Beam, Signal Beam, or another coverage move to help against Pokemon like Shiftry, Cacturne, Sharpedo, and opposing Slowking.</p> <p>Life Orb is usually the best item for this set, since Slowking's goal is to KO as much of the opponent's team as possible while Trick Room is up, but Leftovers is an option if Slowking has Nasty Plot. It's a good idea to pair this set with at least one other slow teammate that can continue to sweep if Slowking is KOed while Trick Room is still active. Marowak, Camerupt, and Ampharos are some examples of strong Trick Room sweepers that have nice synergy with Slowking. If you're using Slowking on a dedicated Trick Room team, you should have a faster Trick Room setter such as Solrock or Haunter as your lead and ideally at least one other Pokemon that can set Trick Room up mid-game, such as Porygon2 or Gardevoir.</p>"
      },
      "Calm Mind": {
        "description": "<p>With Calm Mind, Slowking maintains its utility as a wall while also gaining the potential to sweep. Slowking's good all-around bulk and access to instant recovery set it apart from most other setup sweepers in NU and allow it to set up relatively easily against teams that lack Toxic or a disrupting move like Encore or Trick. After a boost, Slowking can comfortably tank even super effective STAB moves from special attackers like Haunter and Manectric, making it very difficult to break directly without a powerful physical attacker.</p> <p>Investing 64 EVs in Special Defense ensures that Slowking will never be 2HKOed by Life Orb Charizard's Hidden Power Grass after Stealth Rock damage or by Choice Specs Typhlosion's Hidden Power Grass or Choice Scarf Magmortar's Thunderbolt from full HP, meaning that it remains a solid counter to most specially attacking Fire-types before it sets up. The remaining EVs bolster Slowking's physical bulk, making it more difficult for physical attackers such as Tauros and Medicham to put an end to Slowking's sweep.</p> <p>Toxic is a major problem for this set as listed, essentially preventing Slowking from accomplishing anything against defensive teams. To counteract this, you can drop one of Slowking's attacks and switch to a mono-attacking set with Rest alongside either Sleep Talk or Slack Off for recovery. Sleep Talk has the advantage of making Slowking more difficult to switch into while it's sleeping and also makes Slowking a fantastic counter to Jynx, but Slack Off gives Slowking more defensive utility before setting up and more flexibility when attempting to sweep. If you choose to make Slowking a mono-attacker, it will need significant team support, since both of its STAB attack options have common Pokemon immune to them. If you choose Surf as Slowking's attack, you will need to ensure that Pokemon with Water Absorb such as Poliwrath, Quagsire, Mantine, and Politoed are eliminated before attempting to sweep, while if you choose Psychic, Slowking will need Dark-types such as Skuntank, Shiftry, Cacturne, and Sharpedo out of the way. The upside of going this route is that Slowking will be very hard for defensive teams to stop once such foes are out of play.</p>"
      },
      "Choice Specs": {
        "description": "<p>Slowking has the stats and movepool to make excellent use of Choice Specs on bulky offensive teams, especially those that feature paralysis support. The power provided by Choice Specs and full investment in Slowking's Special Attack allows it to OHKO many of its common offensive switch-ins, including Skuntank and Magneton with Surf and Cacturne and Shiftry with Fire Blast. Defensive Grass-types can't switch in safely either, as Fire Blast OHKOes physically defensive Meganium and Vileplume. If Cradily is a bigger concern or you prefer a 100% accurate move to hit Grass-types with, Ice Beam is an alternative that 2HKOes Cradily while still OHKOing offensive Grass-types, though it doesn't quite OHKO Vileplume, Meganium, or specially defensive Cacturne. In the third slot, Psychic is a safe, spammable move once Dark-types are out of the way, and it hits most common Water-resistant Pokemon for at least neutral damage. Grass Knot is actually weaker than Psychic against most Water-types, but it has a good chance to 2HKO opposing defensive Slowking after Stealth Rock and will always OHKO Crawdaunt and Sharpedo, which can otherwise switch in and force Slowking out. Finally, Trick ensures that Slowking has value in matchups against defensive teams containing walls like Lickilicky and Politoed, which could comfortably tank any of its attacks but hate being locked into a single move.</p> <p>If your primary goal in using this set is to cripple a defensive switch-in with Trick, you can run Slack Off in the third slot to allow Slowking to act as a tank after ridding itself of its Choice Specs. This will leave Slowking unable to directly harm opposing Water-types, but locking them into a single move is often more impactful than the damage Slowking could deal with Psychic or Grass Knot anyway.</p> <p>This set has the ability to lure and eliminate Skuntank and most Grass-types, potentially opening up a sweeping opportunity for a teammate. For example, Shiftry and Whiscash both benefit greatly from having the opponent's Grass-types out of the way, and Drifblim and Gardevoir are much happier when they don't have to worry about Skuntank. On the other hand, it's a good idea to have a teammate that can switch into and take advantage of Skuntank or a Grass-type if they manage to come in safely on a resisted move or after a KO. Charizard and other Fire-types are good options to handle Grass-types, while bulky Rock-types such as Rhydon and Regirock can switch in on Skuntank and possibly set up a sweep with Rock Polish. Slowking's life is also a lot easier if its teammates can remove opposing Water-types. Skuntank can do the job if your opponent's Water-type is a Slowking, or you can use a lure like Regirock or Camerupt with Explosion.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Honko", "user_id": 42413}], "teams": [{"name": "Quality checked by", "members": [{"username": "Bughouse", "user_id": 52547}, {"username": "Oglemi", "user_id": 40358}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}, {"username": "Empress", "user_id": 175616}]}]}
  },
  "Medicham": {
    "overview": "<p>Medicham is the best physical wallbreaker in NU, and arguably the hardest Pokemon in the tier to switch into. Its High Jump Kick is absurdly powerful thanks to Pure Power, and it has reliable secondary STAB attacks and coverage moves to back it up. Fighting- and Psychic-type attacks together cover many of the tier's best defensive Pokemon, and Thunder Punch covers Slowking, the most prominent exception. Poor bulk and middling Speed make Medicham fairly easy to revenge kill, and High Jump Kick is a risky move that's easily exploited, but these flaws aren't enough to stop Medicham from being one of NU's most dangerous Pokemon.</p>",
    "comments": "<h1>Other Options</h1> <p>Medicham can use Choice Band to beat the handful of walls that can stop its Life Orb set. The extra power allows Medicham to always 2HKO Gligar and Dusclops with Zen Headbutt, and Trick allows Medicham to cripple Hypno and any other wall that's likely to switch in. Choice Band requires more prediction than Life Orb does, though, and Medicham's priority moves don't fit well on a Choice Band set, making it helpless against anything faster than it.</p> <p>Medicham forces a lot of switches, and many teams rely on revenge killing to beat it, so Substitute is a good option that can help Medicham grab an extra KO. However, it's only effective if Medicham can OHKO the switch-in, so it's better saved for later in the match when the opponent's walls have been weakened.</p> <p>Drain Punch's 60 Base Power is too low for it to be useful as a primary STAB move, but it can work alongside High Jump Kick as an alternative Fighting-type STAB move to use in situations where High Jump Kick's power isn't needed. The only time Drain Punch is worth considering as Medicham's only Fighting-type attack is on a Bulk Up set, where the healing effect is more useful and the Attack boost helps make up for the low Base Power. For example, after a Bulk Up boost, Medicham can survive Choice Band Tauros's Double-Edge and respond with Drain Punch for an OHKO. However, Medicham is generally better off running all-out attacking sets and trying to do as much damage as possible each turn.</p> <p>Rock Slide gives Medicham slightly different coverage than the elemental punches. It's most useful on the Choice Scarf set for a more reliable OHKO against Charizard, but it also hits Pinsir harder than Medicham's other moves while still covering other Flying-types such as Drifblim and Jumpluff.</p> <h1>Checks and Counters</h1> <p>Hypno is the only viable Pokemon with reliable recovery that can safely switch in on all of Medicham's attacks; even the Choice Band set can't 2HKO it. The only thing Hypno fears from Medicham's arsenal is Trick. Its one flaw as a counter is its vulnerability to being trapped by Skuntank, which is a common teammate for Medicham, so it needs to be used cautiously. Gligar and Dusclops are the next best switch-ins, although Gligar loses if Medicham has Ice Punch, and Dusclops only barely avoids a 2HKO from Life Orb-boosted Zen Headbutt and is forced to rely on Pain Split or Rest for recovery. Physically defensive Grumpig can switch in on any set except Choice Band and force Medicham out at least once, but its lack of reliable recovery limits it to being a short-term answer. Sableye is the only other Pokemon that can switch in on all of Life Orb Medicham's moves, but it is extremely uncommon and not very good in general.</p> <p>If you don't have any of the Pokemon listed above on your team, you'll need at least a little bit of prediction to counter Medicham. Against the Life Orb set, there are several offensive Pokemon that can switch in on a move they resist and force Medicham out with the threat of an OHKO; Flying- and Ghost-types such as Charizard and Haunter can switch in on High Jump Kick, and Dark-types such as Skuntank and Shiftry can switch in on Zen Headbutt. The Choice Scarf set, on the other hand, is countered by most defensive Psychic-types and other physically defensive walls that aren't weak to its STAB moves, although all of them hate Trick, and some, such as Slowking, will lose if they switch in on a super effective coverage move. Choice Scarf Medicham is pretty easy to counter after it's locked into a move, as common Pokemon resist or are immune to each of its moves. The problem, of course, is correctly guessing which move it's going to lock itself into.</p>",
    "sets": {
      "Life Orb": {
        "description": "<p>Life Orb Medicham is easily one of the best wallbreakers in NU. High Jump Kick 2HKOes everything that doesn't resist it, and Zen Headbutt demolishes many of the Pokemon that do. Thunder Punch covers Flying-types and, more importantly, Slowking, which is a very common switch-in to Medicham. Not needing to play around Slowking is one of the biggest perks of this set; if Slowking switches in on either of Medicham's STAB moves, Thunder Punch has a good chance to KO it on the next turn.</p> <p>In the last slot, Fake Out does 30-40% to most offensive Pokemon, making it a solid option to help Medicham pull its weight against offensive teams, which comprise mostly of Pokemon that outspeed it. Ice Punch is an alternative that OHKOes Gligar, which otherwise walls Medicham. Bullet Punch is another option for a more flexible priority move than Fake Out. Although most of the common Pokemon that outspeed Medicham resist Bullet Punch, it still does a decent 15-20%, which can allow Medicham to pick off heavily damaged Pokemon and ones that switch in and barely survive one of its attacks. It also OHKOes Jynx and does around 60% to Haunter, both of which otherwise force Medicham out. If you choose Ice Punch in the last slot, Psycho Cut becomes an option over Zen Headbutt to give Medicham a 100% accurate STAB move to rely on. Using Psycho Cut together with either Fake Out or Bullet Punch is illegal, though.</p> <p>High Jump Kick's monstrous power is what enables Medicham to break through NU's toughest physical walls, but it's also one of the riskiest moves in the game. The threat of a Ghost-type switching in makes it dangerous to use High Jump Kick before you've scouted your opponent's team, and walls such as Lickilicky and Regirock can use Protect to force Medicham into a prediction game. Keep in mind that High Jump Kick's crash recoil is based on the damage the move would have done (or, against Ghost-types, the target's max HP), so a crash against a target with high HP, such as Lickilicky or Drifblim, can OHKO Medicham. If you want a safer Fighting-type STAB move that doesn't require as much prediction, Brick Break is a viable alternative. Of course, the loss of power means Medicham misses out on some important KOs; it will no longer be able to OHKO Skuntank and Whiscash or 2HKO Quagsire, and it will need Ice Punch to be able to 2HKO Meganium and Sandslash.</p> <p>A Jolly nature is mandatory on this set; there are a lot of common Pokemon that sit at or slightly below Medicham's Speed tier, and the additional power that an Adamant nature would provide is overkill. This set can work as a passable attacking lead with Fake Out if your team doesn't have room for a true lead. Medicham matches up very well against slower entry hazard-setting leads, but most faster leads will force it out after it uses Fake Out.</p> <p>Although this set has no trouble breaking through most of NU's walls, it struggles against pure Psychic-types, especially Hypno. This makes Skuntank an excellent teammate, as it has nothing to fear from Hypno and can reliably trap it with Pursuit. Gligar (if you forgo Ice Punch) and Dusclops are the only other walls that have a chance at stopping Medicham. Zen Headbutt has about a 50% chance to 2HKO them if they switch in on it and Stealth Rock is up, but if Medicham misses out on that initial 2HKO, it will need a Zen Headbutt flinch or critical hit in order to win. Charizard is a good partner that can switch in on Dusclops's Will-O-Wisp and Gligar's Earthquake for free and benefits from Medicham's ability to lure and KO Slowking.</p>"
      },
      "Choice Scarf": {
        "description": "<p>Choice Scarf Medicham is a solid revenge killer and a threatening late-game sweeper. Even without a damage-boosting item, High Jump Kick's power remains impressive; it hits about as hard as Choice Band Tauros's Return. Psycho Cut is a 100% accurate STAB move that's useful both early-game, when you haven't yet scouted your opponent's team for Ghost-types, and late-game, when the opponent's team is weakened and High Jump Kick's power is no longer needed. Thunder Punch 2HKOes Slowking and is also Medicham's best move against Flying-types such as Charizard and Drifblim. Trick cripples walls that Medicham can't beat by attacking, such as Hypno and Meganium. Alternatively, Ice Punch allows Medicham to get past Gligar without giving away its Choice Scarf.</p> <p>With an Adamant nature, Medicham always OHKOes Tauros and Magmortar from full HP as well as Skuntank after Stealth Rock damage and Charizard after one round of Life Orb recoil. A Jolly nature reduces all of those KOs to approximately 50% chances, but it allows Medicham to at least Speed tie with opposing Choice Scarf Medicham and Gardevoir and outspeed a few of NU's slower weather sweepers such as Modest Vileplume and Modest Gorebyss in their respective weathers. Either nature is viable, but Adamant is the more consistently useful choice for most teams.</p> <p>All Medicham sets benefit from Pursuit support, but this set needs it the most. Thunder Punch can 2HKO Slowking if you predict it to switch in, but other bulky Psychic-types don't fear anything from Choice Scarf Medicham except Trick. Skuntank is the best Pursuit user in NU, and its support is invaluable in allowing Medicham to safely spam its STAB moves.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Honko", "user_id": 42413}], "teams": [{"name": "Quality checked by", "members": [{"username": "Oglemi", "user_id": 40358}, {"username": "Bughouse", "user_id": 52547}]}, {"name": "Grammar checked by", "members": [{"username": "CryoGyro", "user_id": 331519}, {"username": "Lumari", "user_id": 232216}]}]}
  },
  "Manectric": {
    "overview": "<p>Manectric's stats and movepool make it a very decent Special Attacker in NU. Base 105 Speed grants Manectric the ability to outspeed common threats like Charizard, Typhlosion, and Dodrio, and its access to Flamethrower separates itself from other Electric-types, as it allows it to break through the likes of Magneton, Vileplume, and Meganium without much trouble. Moreover, due to its Speed tier and access to Switcheroo, Manectric is a premier Choice Scarf user in NU, able to revenge kill most setup sweepers like Dragon Dance Charizard and Sunny Day Vileplume. However, Manectric's bulk is mediocre, making it susceptible to faster Pokemon like Tauros and Floatzel and strong priority like Sucker Punch from Skuntank and Shiftry. Moreover, its Special Attack, while good, isn't amazing, and its movepool lacks important coverage moves like Focus Blast. Therefore, Manectric has a tough time against special walls like Cradily, Regirock, and Lickilicky. Furthermore, as an offensive Electric-type, Manectric faces competition from Magneton, which packs slightly better Special Attack, valuable defensive utility, and a secondary Steel typing that allows it to dent some of the aforementioned special walls.</p>",
    "comments": "<h1>Other Options</h1> <p>Choice Specs is an alternative that allows Manectric to hit harder and to use Switcheroo to good effect, but such a set relies a lot on prediction. Signal Beam is Manectric's best tool available to damage Cradily and Psychic-types like Hypno, but it fails to 2HKO any of these Pokemon. Toxic can be run on offensive Manectric, since its fourth moveslot is pretty free. Thunder can also be considered, as it proves to be very helpful in some scenarios when you absolutely need the most immediate power you can get, and it can cause paralysis as well. Hidden Power Water OHKOes Camerupt, but apart from this one target, it doesn't help much.</p> <h1>Checks and Counters</h1> <p>Ground-types are arguably Manectric's biggest nemeses, since they're immune to Electric and can OHKO it back with their STAB attacks. Nidoqueen isn't 2HKOed by anything Manectric can throw at it and can even punish Manectric for using Switcheroo if it's holding Black Sludge. Depending on the type of Hidden Power Manectric is using, it is walled either by Whiscash, Quagsire, and Gastrodon or by Camerupt, although none of these Pokemon like receiving a Choice Scarf. Gligar and Sandslash win one-on-one, but they take a lot of damage from Hidden Power Ice. Special walls and tanks like Cradily, Lickilicky, defensive Gardevoir, Hypno, and to a lesser extent Regirock have the upper hand against Manectric, but they should watch out for Switcheroo. Strong priority like Sucker Punch from Skuntank and Shiftry, as well as Aqua Jet from Sharpedo, will often spell doom for Manectric if it has been weakened a bit. However, none of these outright OHKO it, and Manectric can strike back with a powerful hit if it survives. Faster Pokemon like Tauros, Floatzel, and Choice Scarf users like Typhlosion, Gardevoir, and Medicham can revenge kill Manectric pretty easily. Nonetheless, they cannot directly switch into it and should make sure they're not facing Choice Scarf Manectric beforehand.</p>",
    "sets": {
      "Choice Scarf": {
        "description": "<p>Due to its ability to outspeed all other common Choice Scarf users and revenge kill setup sweepers like Dragon Dance Whiscash and Charizard, Rock Polish Rhydon, and Vileplume and neutral Speed nature Victreebel under sun, Manectric is an excellent Choice Scarf user in NU. Thunderbolt, Flamethrower, and Hidden Power Grass are needed to eliminate the Pokemon listed above and provide good coverage overall. Overheat isn't a good move to be locked into to due to the Special Attack drop, but it can prove to be very useful if you happen to need the additional power to take out opposing Meganium or Vileplume. Switcheroo cripples common defensive answers to Manectric, including Cradily, Lickilicky, and Hypno.</p> <p>Manectric needs as much Speed and Special Attack investment as possible in order to fulfill its job. This variant is able to hinder Cradily, Camerupt, Nidoqueen, Lickilicky, and Hypno with Switcheroo, which is greatly appreciated by Offensive Pokemon such as Tauros, Magmortar, and Charizard. However, Manectric still fears Sucker Punch from Shiftry and Skuntank, the latter of which can also punish it with Pursuit if it attempts to switch out. Thus, Vileplume and Nidoqueen make for good partners. While this variant can cripple most of Manectric's initial switch-ins, it also benefits from wallbreakers like Medicham and Pinsir getting them out of the way for Manectric to spam Thunderbolt more freely.</p>"
      },
      "All-Out Attacker": {
        "description": "<p>Thunderbolt is a reliable STAB move that hits Slowking, arguably the most common special wall in the tier, super effectively. Flamethrower invalidates Magneton, Vileplume, and Meganium as answers to Manectric, as well as less common Pokemon like Piloswine and Regice. Overheat is an alternative that hits much harder at the cost of essentially forcing Manectric out afterwards. It has some notable merits, such as OHKOing most Vileplume variants. The third slot is dedicated to hitting Ground-types as hard as possible. Hidden Power Grass OHKOes Whiscash, Quagsire, and Rhydon, all of which would wall Manectric otherwise and use it as setup fodder in the case of Whiscash, whereas Hidden Power Ice OHKOes Gligar and is Manectric's best way to damage Nidoqueen and Cradily. Finally, Substitute allows you to play around Sucker Punch users like Skuntank and Shiftry and ease predictions on switch-ins. Charge Beam, while unreliable, can boost Manectric's Special Attack, making it more threatening, but you generally won't find too many opportunities to use it.</p> <p>Manectric's EV spread aims to maximize its Speed and damage output, the latter of which is further enhanced by Life Orb. However, Expert Belt can be considered if you don't want Manectric to be worn down too quickly by recoil and the use of Substitute. Just like many frail offensive Pokemon, Manectric has a hard time getting onto the field safely. This is why you should use it as a revenge killer to pressure slower Pokemon like Charizard, punish predicted switch-ins, or force Pokemon like Slowking to use recovery moves. Due to Manectric's tendency to attract Ground-types that use it as Stealth Rock bait like Camerupt and Nidoqueen, spinners like Hitmonchan and Sandslash make for good partners. Other dangerous Pokemon that can take advantage of them like Charizard, Sharpedo, and Drifblim are teammates of choice as well. Other special walls like Cradily and Lickilicky are troublesome for Manectric, so strong physical attackers like Medicham, Pinsir, and Poliwrath can be considered. Finally, Manectric is forced out by faster threats like Tauros and Floatzel and by strong priority users like Skuntank and Shiftry, especially if it's not running Substitute. Thus, having some defensive presence from a Pokemon like Cradily, Vileplume, or Meganium is advised.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Wenderz", "user_id": 331114}], "teams": [{"name": "Quality checked by", "members": [{"username": "Bughouse", "user_id": 52547}, {"username": "Oglemi", "user_id": 40358}, {"username": "Honko", "user_id": 42413}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}, {"username": "Empress", "user_id": 175616}]}]}
  },
  "Drifblim": {
    "overview": "<p>Drifblim is an unique Pokemon with a great signature ability in Unburden that allows it to act as a one-time sweeper when used in tandem with Calm Mind. Its unique typing gives it a useful Ghost STAB to hit the numerous Psychic-types in the tier, mainly special walls like Slowking, Grumpig, and Hypno, for good damage. Drifblim also has useful resistances to act as an offensive check to the likes of Tauros and Sunny Day Vileplume and to invalidate most Lickilicky variants. Furthermore, thanks to its wide movepool and its other ability Aftermath, Drifblim is versatile enough to fulfill tasks such as leading, revenge killing, Baton Passing, and setting weather. However, its typing sports several crippling weaknesses, mainly to Stealth Rock and Pursuit, leaving Drifblim very vulnerable to the omnipresent Skuntank. Moreover, due to its middling Speed and Special Attack, Drifblim relies on boosts to pose a threat and thus faces heavy competition from Haunter as an offensive Ghost-type.</p>",
    "comments": "<h1>Other Options</h1> <p>Drifblim makes a very good user of Baton Pass due to its ability to pass high HP Substitutes and either Calm Mind or Stockpile; the lack of phazers in the tier helps its case. With the first set, Drifblim may be unable to use any move if it's facing faster and stronger Pokemon like Charizard and Manectric. Due to this, Substitute can be swapped for Endure in order to have a chance to do some damage, but with its typing and bulk, Drifblim will more often than not have at least one opportunity to set up in each match. Drifblim can also act as a Sunny Day or Rain Dance user on dedicated weather teams. Its access to Weather Ball, Thunder, and Explosion allows it to deal with common threats to these kinds of teams. Choice Specs is an option if you really want immediate power, but Life Orb Haunter hits harder and is also faster. A support set with moves like Memento can work on some hyper offensive teams, but dual screens users are generally better options. Drifblim can act as a status spreader with moves such as Will-O-Wisp, Hypnosis, and Thunder Wave, but more powerful Pokemon like Gardevoir are more suited for this task. A defensive variant with moves like Will-O-Wisp and Haze has some merits due to Drifblim's unique typing, but its Stealth Rock weakness and the existence of Sableye and Dusclops hinder it.</p> <h1>Checks and Counters</h1> <p>Dark-types are Drifblim's biggest nemeses mainly due to their super effective priority moves that bypass the Unburden boost; some of them also trap it with Pursuit. The omnipresent Skuntank in particular will often spell doom for Drifblim with either Sucker Punch, Crunch, or Pursuit, only fearing Hidden Power Ground from Drifblim. Sneasel can fire off Ice Shard without hesitation and threaten Drifblim with Pursuit as well, but it has to be wary of Hidden Power Fighting. Shiftry and Cacturne are extremely scary as well with their strong Sucker Punch, but Substitute variants can play around them. Rock-types like Regirock and Cradily are bulky enough to withstand even boosted hits and will do massive damage with their STAB attacks. Specially bulky Pokemon with super effective coverage like Regice, Muk, and Lapras have the upper hand against Drifblim if they're healthy, but they can be in trouble if it already has several Calm Mind boosts under its belt. Some special walls or tanks can cripple Drifblim in their own way; Politoed can lock it in a setup move with Encore, Mantine may erase its boosts with Haze, and Lickilicky can pack another offensive move specifically for Haunter and Drifblim. Finally, a ton of revenge killers can take care of Drifblim if Unburden isn't active or if it hasn't set up a Substitute or Calm Mind boosts, such as Manectric, Haunter, Jynx, Charizard, Choice Scarf Magneton, and Sharpedo.</p>",
    "sets": {
      "Substitute + Calm Mind": {
        "description": "<p>Drifblim's most common set acts as a very threatening late-game sweeper. However, keep in mind that Unburden's effect disappears as Drifblim switches out, so choose an effective moment for it to set up and to eat its Berry carefully. Calm Mind allows Drifblim to attempt a sweep thanks to the Special Attack boost. The added boost in Special Defense is very handy in a metagame where fast special attackers are common, as it makes Drifblim harder to revenge kill before Unburden is activated. Substitute is meant to be used repeatedly until Drifblim eats its Berry; it also allows Drifblim to play around Sucker Punch users, to escape Pursuit, to protect itself from revenge killers before Unburden activates, and to avoid status. Shadow Ball is Drifblim's best STAB attack that hits Psychic-types such as Slowking, Gardevoir, and Jynx hard, all of which are very common threats. Hidden Power Fighting gives Drifblim perfect coverage alongside Shadow Ball that allows it to hit Regirock, Cradily, Magneton, Lickilicky, Regice, and Dark-types not named Skuntank super effectively.</p> <p>The given EV spread allows Drifblim to outspeed Choice Scarf Timid Manectric after the Unburden boost, which is likely the fastest revenge killer it will face aside from the somewhat rare Choice Scarf Tauros. The Special Attack is maximized so Drifblim is guaranteed to OHKO Tauros, Floatzel, and Manectric and to 2HKO Regirock after a Calm Mind and Stealth Rock damage. However, the EV spread is pretty customizable, depending on what you need. For instance, 140 SpA / 124 SpD / 244 Spe ensures that Drifblim's Substitute won't break to Slowking's Surf after a Calm Mind, but you'll miss some of the crucial aforementioned KOs.</p> <p>The chosen Berry depends mostly on personal preferences; Sitrus Berry doesn't require Drifblim to be at very low health, which means it may activate Unburden sooner, and grants it an additional Substitute. Petaya Berry, on the other hand, is very helpful if Drifblim faces too much pressure to set up manually with Calm Mind.</p> <p>Hidden Power Ground is an appealing option, since it 2HKOes Skuntank even when unboosted, but it leaves Drifblim completely walled by Dodrio and much more vulnerable to other Dark-types, namely Shiftry and Cacturne. Hidden Power Flying provides a secondary STAB option that hits all of Skuntank, Vileplume, Hitmonchan, specially defensive Cacturne, Poliwrath, and Meganium, at the cost of leaving Drifblim weaker against Regirock, Cradily, Magneton, and Tauros. Status moves like Will-O-Wisp can prove to be useful to cripple some of Drifblim's usual checks and let it avoid Sucker Punch, but outside of the accuracy issue, a Drifblim without a coverage move is walled by Normal-types and struggles even more against Dark-types. Since Drifblim may end up being unable to sweep the opposing team, Baton Pass ensures that all of the Calm Mind boosts accumulated won't be a waste if you pack another special attacker. Moreover, Baton Pass allows Drifblim to escape Pursuit. If Drifblim is holding a Petaya Berry, giving up Calm Mind is also possible, as it will free up a moveslot and let it use one of the above options or other offensive options like Thunderbolt and Explosion instead. Although it wouldn't have to set up manually with Calm Mind anymore, eating the Berry requires Drifblim to be at very low health, and it will only get a +1 boost in Special Attack by doing so, making sweeping difficult.</p> <p>With Skuntank being Drifblim's biggest threat, Pokemon that can lure it out and either cripple or outright KO it like Gardevoir with Will-O-Wisp, Focus Blast, or Destiny Bond and Shiftry with Explosion make good partners. Other Dark-types with super effective priority moves like Shiftry and Cacturne are pretty annoying as well, although Substitute helps Drifblim against them. Therefore, having a good switch-in to most of them like Vileplume is appreciated. Specially bulky Pokemon with super effective coverage like Regirock, Cradily, Regice, and Muk need to be out of the way or severely damaged in order to sweep with Drifblim. Wallbreakers like Medicham threaten all of them. Another way to wear down said Pokemon is with Spikes and Stealth Rock support. Drifblim's Ghost typing is something to take advantage of against opposing spinners, although its weaknesses to Hitmonchan's Ice Punch and Sandslash's Night Slash make it a pretty subpar spinblocker. Even though Drifblim doesn't mind Stealth Rock that much, as it needs to get in Sitrus Berry's range anyway, Rapid Spin support from Hitmonchan or Sandslash is still appreciated, as Drifblim will likely have an easier time setting up if it comes in at full health. Moreover, both of these Pokemon are pretty good at checking most of Drifblim's threats, namely Regirock and Skuntank. Also, due to Unburden, most of Drifblim's answers are either strong priority users or specially bulky Pokemon. Nonetheless, naturally faster Pokemon can also pose a threat if they pressure Drifblim enough to prevent it from setting up. These include most special attackers like Haunter, Jynx, and Manectric. Thus, packing a special wall or tank like Lickilicky is a good idea.</p>"
      },
      "Rest + Calm Mind": {
        "description": "<p>An alternative to the more offensive Calm Mind set, which is very effective as well if played right. Instead of lowering its health to reach the Sitrus Berry's range, Drifblim has access to a one-time full recovery with the combination of Rest and Chesto Berry. This variant has to activate Unburden manually by using Rest, which is a double-edged sword, as Unburden can't be triggered against your will by reaching a given range and without the protection of Substitute. Calm Mind stays as the needed move to pull off a sweep, as this variant will likely be able to accumulate more boosts thanks to its ability to heal itself. Shadow Ball and Hidden Power Fighting keep perfect coverage together and thus remain Drifblim's preferred offensive tools.</p> <p>The given EV spread allows Drifblim to outspeed Choice Scarf Timid Manectric after the Unburden boost. The Special Attack is maximized to hit as hard as possible, and the remaining EVs are thrown into Defense in order to take physical hits a little better. Putting 252 EVs in Defense is an option that almost guarantees Drifblim can take a Life Orb-boosted Sucker Punch from Adamant Skuntank, but it doesn't necessarily hit hard enough in return.</p> <p>Hidden Power Ground is a coverage option to hit Skuntank, but Hidden Power Fighting stays as the best choice overall since it makes Drifblim less vulnerable to Shiftry, Cacturne, and Dodrio. Hidden Power Flying might be a more solid option with this variant, since Drifblim has a harder time playing around Sucker Punch users and status without Substitute, which means that the improved matchup against Skuntank, Vileplume, and Meganium may be important. Recycle is also an option, as retrieving its Berry allows Drifblim to take greater advantage of the ChestoRest strategy. The selling point of this move is to activate Unburden possibly several times throughout the match. However, it's difficult to find a moveslot for it.</p> <p>When using this variant, you need to be prepared against Sucker Punch users like Shiftry, Cacturne, and especially Skuntank which also threatens Drifblim with Pursuit while taking Hidden Power Fighting reasonably well. Hence, Pokemon like Will-O-Wisp Gardevoir and Shiftry make good teammates due to their ability to lure in and significantly cripple Skuntank. Said Pokemon are also suited for damaging the likes of Regirock and Cradily, two common threats that tend to prevent Drifblim from sweeping. In spite of its one-time full recovery move in Rest, Drifblim appreciates having Rapid Spin support from the likes of Hitmonchan and Sandslash, as Stealth Rock could hamper its ability to set up. Drifblim may also struggle to find an opportunity if it's facing too much offensive pressure. Thus, defensive backbones like Lickilicky are partners of choice due to their ability to take hits from the likes of Haunter and Jynx.</p>"
      },
      "Hindenburg (Lead)": {
        "description": "<p>Thanks to Unburden, Hypnosis, Explosion, and its immunity to Fake Out, Drifblim makes a pretty effective lead. Hypnosis is a high-risk, high-reward move that allows Drifblim to beat Pokemon that would normally have the upper hand against itprovided it doesn't miss. It also prevents slower Pokemon from setting Stealth Rock, and sleep disables just about any Pokemon. A sleep-inducing move fits nicely on Drifblim, since its Ghost STAB scares Hypno off, which is the most common sleep absorber. Explosion is a last-ditch tool that will hopefully KO the opposing Pokemon. Drifblim's Ghost STAB proves to be useful to discourage opposing Ghost-types from trying to absorb Explosion. In the best scenario, this variant of Drifblim can take down two opposing Pokemon. Hidden Power Fighting allows Drifblim to take care of opposing lead Persian and has perfect coverage with Shadow Ball.</p> <p>The EV spread allows Drifblim to outspeed Choice Scarf Manectric after the Unburden boost, which you may encounter in the lead position. Drifblim's defenses are minimized so that Focus Sash can be activated more easily, since Unburden won't activate otherwise.</p> <p>Memento and Destiny Bond aren't bad alternatives to Explosion, since they are far less predictable. The former gives your team a plethora of setup opportunities early-game, and the latter can catch Pokemon like Regirock as well as being a great tool against Sucker Punch users when the Sleep Clause is active. Nonetheless, the immediate threat of Explosion is hard to give up. Sucker Punch is a pretty neat priority attack that allows Drifblim to get some surprise KOs against opposing Focus Sash leads, but it's hard to fit.</p> <p>Faster sleep inducers like Jynx, Venomoth, and Jumpluff are extremely threatening, since they can prevent Drifblim from doing anything. Therefore, sleep absorbers like Hypno and RestTalk Mantine make good partners. Faster leads like Floatzel and Glalie can possibly beat Drifblim one-on-one or set up multiple layers of Spikes, respectively, as long as they predict Hypnosis correctly or simply avoid it, so be sure to have something to deal with them afterwards. Even if Drifblim survives at 1 HP, priority users and Rock-types like Regirock don't fear much from it if Sleep Clause is already active. Therefore, packing a Pokemon that can take advantage of most of them like Poliwrath is something to consider.</p>"
      },
      "Choice Scarf": {
        "description": "<p>Drifblim makes good use of Choice Scarf, as it makes for very appealing role compression between Trick, Explosion, its defensive utility, its ability to spinblock, and its ability to revenge kill fast Pokemon. Its other ability Aftermath allows it to wear down the opposing Pokemon further if it eliminates Drifblim with a contact move, which can prove to be useful in case Explosion wouldn't work. Trick is a neat tool, especially if your team has trouble against Skuntank, Regirock, Lickilicky, or Cradily, since it either cripples them or makes them outright useless. Shadow Ball is Drifblim's best and mandatory STAB move, and Thunderbolt is Drifblim's best option to revenge kill Charizard, Dodrio, Floatzel, Sharpedo, and Crawdaunt. Explosion is an immediately threatening offensive move that can take down most Pokemon that don't resist it and serve as a last-dish tool in emergency cases. This variant of Drifblim can ideally cripple two opposing Pokemon by using Trick and Explosion.</p> <p>A Naive nature is needed to outspeed Electrode and slower Choice Scarf users like Magneton without lowering the power of Explosion. Hidden Power Fighting is very underwhelming when unboosted but can prove to be useful against Shiftry and Cacturne.</p> <p>Hidden Power Grass is an option if you're really afraid of Dragon Dance Whiscash and Rock Polish Rhydon, but their usage is still pretty low. Baton Pass can be useful to scout the opponent's team and bring an answer to the incoming switch-in; note that it also allows Drifblim to escape safely from Pursuit.</p> <p>Since Skuntank will either faint or be at low health after eliminating Drifblim due to Explosion and Aftermath, anything that appreciates having it out of the way is a good teammate. Examples include Jynx, Shiftry, and Gardevoir. You also may end up giving Drifblim's Choice Scarf to bulky Pokemon like Regirock, Cradily, and Regice with Trick. If you succeed in doing this, Pokemon like Tauros and Haunter will have a much easier time sweeping through the opponent's team.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Wenderz", "user_id": 331114}], "teams": [{"name": "Quality checked by", "members": [{"username": "Honko", "user_id": 42413}, {"username": "Oglemi", "user_id": 40358}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}, {"username": "Oglemi", "user_id": 40358}]}]}
  },
  "Skuntank": {
    "overview": "<p>Despite not being especially powerful, bulky, or fast, Skuntank is one of the most influential Pokemon in the NU metagame due to the Pursuit support it provides. By removing opposing Psychic-types such as Slowking, Gardevoir, Grumpig, and Hypno from the match, Skuntank opens the door for NU's dangerous Fire- and Fighting-type attackers to sweep uncontested. On top of that, Skuntank's STAB Sucker Punch is one of the strongest priority attacks in the tier, and it also has access to Explosion, ensuring that it has plenty of value even in matches where your opponent doesn't have any Psychic-types to trap. You won't see Skuntank sweeping teams singlehandedly or walling all of your opponent's attackers, but it offers such unique and important support that it's worth considering on nearly any team.</p>",
    "comments": "<h1>Other Options</h1> <p>Skuntank can hold a Choice Scarf to reliably revenge kill Pokemon that would normally outspeed it, such as Jynx, Haunter, and Choice Scarf Gardevoir, and its Explosion can take out one opposing offensive Pokemon in an emergency. Skuntank is an effective support Pokemon on dedicated Sunny Day or Rain Dance teams. It can set up either weather and use Explosion to get a sweeper in quickly and safely, and its Pursuit support is very useful for eliminating one of the biggest threats to weather teams in Choice Scarf Gardevoir. Rain Dance teams in particular should almost always use Skuntank as one of their supporters, since they also benefit from having Slowking weakened. Memento is an alternative to Explosion if you need to give a teammate such as Belly Drum Linoone or Nasty Plot Shiftry in the sun a free turn to set up.</p> <h1>Checks and Counters</h1> <p>Since Skuntank's primary goal is to trap and remove Psychic-types, the most efficient way to \"counter\" it is to not include any Psychic-types on your team. That obviously isn't always the right teambuilding choice, but any time you do bring a Psychic-type, you have to accept the possibility that it will be trapped and eliminated by a Skuntank. The important thing is to build a team that won't completely fall apart in the event that its Psychic-types get trapped. For example, don't rely on Slowking as your only answer to Fire-types. You should also play cautiously with your Psychic-types until you know your opponent doesn't have a Skuntank; switch back out immediately if you predict that your opponent might switch Skuntank in, or at least don't use a move that will let it switch in for free like Psychic or Toxic. Once Skuntank is in, you can always try to outpredict it; stay in when you expect it to use Pursuit, switch out when you predict Crunch, and recover or use a status move if you think it will use Sucker Punch.</p> <p>When it's not trapping your Psychic-types, Skuntank is relatively easy to counter, although it can take many of its counters down with it by using Explosion. Bulky Rock-types such as Regirock, Cradily, Rhydon, and Probopass are all good counters that can shrug off Skuntank's Dark-type moves and survive Explosion. Magneton, Hitmonchan, and Poliwrath resist Skuntank's primary moves and force it to use Explosion or switch out. Ground-types such as Sandslash, Gligar, and Whiscash similarly force Skuntank to use Explosion or flee. Skuntank threatens many faster Pokemon with Sucker Punch, but physically bulky attackers such as Tauros and Pinsir survive easily and OHKO back, while others like Jynx and Charizard can use Substitute or other non-attacking moves to dodge Sucker Punch and come out ahead.</p>",
    "sets": {
      "Offensive Trapper": {
        "description": "<p>Skuntank provides invaluable Pursuit support for any team that aims to sweep with a Pokemon like Charizard, Typhlosion, or Medicham, all of which have very few counters once Psychic-types are removed. This set also has plenty of offensive utility on top of trapping thanks to its powerful Sucker Punch and Explosion. Sucker Punch does heavy damage to most offensive Pokemon, making Skuntank a valuable revenge killer. Crunch is Skuntank's most reliable attack; it has good neutral coverage, lacks any drawbacks, and doesn't require any prediction to use. It may seem a little bit strange to have three Dark-type attacks with no coverage moves, but that's often all Skuntank needs in order to do its job. However, Taunt is an alternative to Crunch that shuts down your opponent's attempts to cripple Skuntank with status, stall with recovery moves, or set up on Skuntank after it's successfully trapped its target. Taunt also reduces the level of prediction needed to use Pursuit and Sucker Punch by limiting the possible actions your opponent can take. Finally, Explosion is an excellent way to send Skuntank out of the battle after its job is done. Don't be too eager to blow Skuntank up early in the game, though, especially if you might need its Sucker Punch for revenge killing later.</p> <p>Skuntank has several coverage options it can run to take out specific targets, replacing Crunch or even Sucker Punch if your team doesn't need a priority move. Poison Jab is a solid alternative STAB move that hits most Pokemon that resist Dark at least neutrally, most notably allowing Skuntank to OHKO Shiftry and Cacturne. Fire Blast and Hidden Power Ground both OHKO Magneton; the former maintains coverage against Shiftry and Cacturne, while the latter 2HKOes opposing Skuntank. Finally, Hidden Power Grass and Hidden Power Ice hit most Ground-types significantly harder than Skuntank's STAB moves, but keep in mind that they are quite weak without Special Attack investment; Hidden Power Grass doesn't even OHKO Whiscash, for example.</p> <p>Black Glasses is the preferred item if Skuntank is running three Dark-type attacks, while Life Orb is the better choice if Skuntank is carrying a coverage move. Even without a coverage move, Skuntank still sometimes appreciates the extra power that Life Orb brings, especially when it's trying to revenge kill with Sucker Punch or KO a wall with Explosion, but the recoil damage can make it more difficult for Skuntank to successfully trap the Pokemon that it wants to. For example, after Skuntank has taken a single round of Life Orb recoil, Life Orb Haunter will always OHKO with Hidden Power Ground with Stealth Rock damage, and defensive Slowking's Surf will always 2HKO. Lum Berry is another decent option to prevent Pokemon like Gardevoir and Slowking from crippling Skuntank with a burn or paralysis as it switches in, but this set is usually better off with a power-boosting item.</p> <p>An Adamant nature is highly recommended, since power is usually much more important than Speed when using Pursuit or Sucker Punch. However, switching to a Jolly nature does help Skuntank in a few specific matchups against Pokemon with base 80 Speed, most notably in order to attack Gardevoir before it can burn Skuntank with Will-O-Wisp and to prevent Medicham from bypassing Sucker Punch with its own priority moves. If you opt to use Fire Blast or Hidden Power for coverage, switch to a Lonely or Hasty nature in order to avoid lowering Skuntank's Special Defense, since most of the Pokemon that it wants to switch into use special attacks. Skuntank's EV spread is very flexible. When you're using Life Orb, a simple spread with maximum Attack and Speed is the best choice, but when using Black Glasses you should consider shifting a few EVs into HP or defenses to take advantage of Skuntank's decent bulk. For example, a spread of 12 HP / 240 Atk / 32 SpD / 224 Spe will guarantee that Skuntank survives Life Orb Haunter's Hidden Power Ground after Stealth Rock damage while still outspeeding neutral-natured Pokemon with base 80 Speed.</p> <p>Skuntank is the ideal teammate for Pokemon that appreciate having opposing Psychic-types removed. Medicham and Hitmonchan benefit greatly from being able to spam their Fighting-type STAB moves freely. Jynx and Fire-types such as Charizard and Typhlosion appreciate Slowking and Grumpig being out of the way. Floatzel notably lures Slowking in and can use Baton Pass on the switch to bring Skuntank in to trap it. Rain Dance Gorebyss suddenly becomes very threatening with Slowking out of the picture. Perhaps the simplest template for building an effective offensive team in NU is to combine Skuntank with one or more Fire-types and a spinner, as it is very difficult to stop Pokemon like Charizard and Magmortar once Psychic-types and entry hazards are out of the way.</p>"
      },
      "Bulky Trapper": {
        "description": "<p>By focusing on Skuntank's decent bulk and cool defensive typing, this set aims to allow Skuntank to comfortably switch in and trap or counter not only Psychic-types but also certain other special attackers such as Haunter, Shiftry, and Vileplume. Pursuit is Skuntank's most important move, allowing it to trap and remove defensive Psychic-types in order to open the gate for a teammate like Charizard or Medicham to sweep. Sucker Punch is a useful tool for hitting faster Pokemon, especially since this set doesn't attempt to outspeed most offensive Pokemon. Crunch is a reliable attack to fall back on when your opponent might try to play around Pursuit or Sucker Punch. Taunt prevents your opponent from crippling Skuntank with status or using recovery moves and has nice synergy with Sucker Punch, but keep in mind that this set's lack of Speed investment means Skuntank can't use Taunt to prevent Pokemon like Whiscash from setting up. Poison Jab is also an option in this slot to make Skuntank a solid counter to Shiftry and Cacturne. In the last slot, Explosion is a great tool to ensure you get value out of Skuntank even when there's nothing left for it to trap.</p> <p>This set is very customizable depending on what you want Skuntank to counter. With the listed EV spread and a Shuca Berry, Life Orb Haunter's Hidden Power Ground will never 2HKO Skuntank even after Stealth Rock damage, making Skuntank a guaranteed counter. Shuca Berry also allows Skuntank to survive an Earthquake from Tauros or Whiscash and respond with Explosion. On the other hand, Lum Berry makes it safer for Skuntank to switch in and trap Gardevoir, Slowking, and Dusclops, especially if you also carry Taunt to prevent further attempts to cripple Skuntank with Will-O-Wisp or Thunder Wave. If neither of those seems necessary, Black Sludge is a great option to help Skuntank stay healthy and better tank weak or resisted hits. For example, with Black Sludge and the listed EV spread, defensive Slowking's Surf doesn't even 3HKO Skuntank, giving you much more leeway in case you mispredict whether Slowking will switch out or stay in and attack. Feel free to adjust the EVs to help against other targets, keeping in mind that Skuntank's high base HP and low base defenses often makes it better to invest in Defense or Special Defense before investing in HP. One other benchmark worth noting is that investing 24 EVs in Speed allows Skuntank to outspeed neutral-natured Cacturne and Crawdaunt and positive-natured Golem and Marowak, which may pay off if your team lacks good switch-ins to any of those Pokemon.</p> <p>Aside from Fire- and Fighting-types such as Charizard and Medicham, which always appreciate Skuntank's Pursuit support, choosing which teammates to use with Skuntank depends on what Pokemon you've tailored this set to beat. If Skuntank is using Poison Jab to counter Grass-types, it fits nicely on teams with defensive cores that are weak to Grass-type moves, such as Regirock + Slowking. On the other hand, Shuca Berry Skuntank's ability to reliably switch in on and remove Haunter makes it a good teammate for Normal-type attackers such as Choice Band Tauros and Curse Lickilicky. Treat Skuntank as a glue Pokemon; almost any team will have some weakness that Skuntank can help it overcome with the right set.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Honko", "user_id": 42413}], "teams": [{"name": "Quality checked by", "members": [{"username": "Bughouse", "user_id": 52547}, {"username": "Oglemi", "user_id": 40358}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}, {"username": "CryoGyro", "user_id": 331519}]}]}
  },
  "Lickilicky": {
    "overview": "<p>In a tier dominated by powerful special attackers, Lickilicky stands out as one of the main answers to them due to its solid special bulk and access to reliable recovery in the form of Wish. It distinguishes itself from other specially defensive Pokemon like Slowking, Gardevoir, and Hypno with its lack of Dark weakness, which means it doesn't fear Pursuit from the omnipresent Skuntank nearly as much as its competitors. Its typing also allows it to serve as a potential check to some variants of Haunter, Shiftry, and Venomoth, a task that Psychic-types cannot fulfill. Furthermore, like many Normal-types, Lickilicky is blessed with a vast movepool and well-rounded stats all around. As a result, Lickilicky can turn into an offensive threat, notably packing the strongest unboosted move in the game in STAB Explosion.</p> <p>However, each Lickilicky variant has its fair share of drawbacks; due to its average offensive stats, it's very passive without significant investment. Thus, defensive sets can be taken advantage of pretty easily by Pokemon like Drifblim and Poliwrath. On the other hand, offensive Lickilicky suffers from low Speed and an average Attack stat, thus facing stiff competition from Tauros and Dodrio as a Normal-type wallbreaker. Moreover, a lot of Pokemon can exploit Lickilicky's Fighting weakness, including Focus Blast users like Gardevoir, Magmortar, and Typhlosion, which greatly hurts its reliability as a special wall.</p>",
    "comments": "<h1>Other Options</h1> <p>With its bulk and access to a ridiculously strong Explosion, Lickilicky makes a good Sunny Day or Rain Dance user on dedicated weather teams. Curse makes Lickilicky harder to break through with physical attacks and enables it to ideally sweep the opposing team. Nonetheless, Cradily mostly outclasses it in this area thanks to its access to an immediate and reliable form of recovery and a STAB move nothing is immune to. Curse can be used in tandem with Block and Rest in order to trap a Pokemon unable to 3HKO Lickilicky through Rest to potentially PP stall it before attempting a sweep afterwards. However, such a setup is stopped cold by Ghost-types, and trapping setup fodder can be difficult. A Substitute + Focus Punch set can be considered thanks to Lickilicky's solid Substitute and ability to get rid of Regirock and Cradily, but the Swords Dance set usually performs better. Lickilicky possesses a colorful special movepool, including Fire Blast, Ice Beam, and Thunderbolt. However, Lickilicky's physical arsenal provides a good enough coverage most of the time, although moves like Shadow Ball to hit the likes of Haunter and Drifblim or Surf to deal with Regirock, Rhydon, and Fire-types can find their place into the first set listed.</p> <h1>Checks &amp; Counters</h1> <p>Fighting-types like Medicham and Hitmonchan OHKO Lickilicky with their respective STAB attacks, although the former shouldn't mindlessly use High Jump Kick in front of a Lickilicky with Protect. Poliwrath deserves a special mention, as it can exploit Lickilicky by locking into the wrong move with Encore or setting up with Bulk Up under Substitute cover. The only moves it has to watch out for are Power Whip as well as Toxic on the switch. Among Ghost-types, Drifblim is especially painful for Lickilicky to face, as the Calm Mind variants can freely set up on the defensive variant and make a good check to the offensive variants, seeing that Choice Band-boosted Ice Punch and boosted Aqua Tail are the only moves that scare it off. Haunter is in a similar position, but its extreme frailty and lack of boosting moves make it a much less reliable answer. Sableye can shut down most Lickilicky with Taunt and Will-O-Wisp, but it wants to avoid Toxic and boosted Power Whip on the switch. Some bulky setup Pokemon like Calm Mind Slowking, Curse Cradily, Swords Dance Meganium, and Dragon Dance Whiscash can take advantage of non-Toxic defensive Lickilicky, but they are in trouble against any other variants. Lickilicky also heavily despises being poisoned unless it runs Heal Bell, and even if it does, the low PP of this move makes common Toxic users like Regirock, Charizard, Hypno, and opposing Lickilicky potential threats. It should also be wary of switching into the likes of Choice Scarf Manectric and Gardevoir, as they can heavily cripple Lickilicky with Switcheroo or Trick. Finally, common users of Focus Blast like Magmortar, Gardevoir, and Typhlosion, as well as strong physical wallbreakers like Tauros, Dodrio, and Rhydon, can break through or revenge kill Lickilicky. However, a combination of Protect and Wish can keep it alive until Focus Blast runs out of PP and scout which moves the aforementioned Choice Band users are locked into.</p>",
    "sets": {
      "Special Wall": {
        "description": "<p>Lickilicky's main set fulfills a pretty important task in a metagame dominated by special wallbreakers. Wish is Lickilicky's most reliable form of recovery, which also allows it to heal its teammates. Protect makes Wish much safer to use and has some other desirable features, like punishing a predicted High Jump Kick from a reckless Medicham, scouting which move a Choice item user like Tauros locks itself into, burning some PP from moves like Focus Blast, and gaining additional recovery from Leftovers. Return is Lickilicky's main offensive move due to its high natural Base Power that is further boosted by STAB. Body Slam is an option if you want to spread paralysis, but be careful not to prevent opposing defensive Pokemon like Regirock and Slowking from being crippled by a more detrimental status effect like poison. On the last slot, Toxic makes up for Lickilicky's passivity and allows it to outstall opposing defensive Pokemon that don't carry Toxic themselves like the aforementioned Slowking and Regirock. Heal Bell is an option if you can't afford to have Lickilicky or any of its partners crippled by status. Finally, Aqua Tail makes Lickilicky less of an offensive liability by preventing Drifblim, Haunter, and Rhydon from setting up too easily on it. Other attacking moves like Power Whip can be considered if you want to prevent Poliwrath and Whiscash from using Lickilicky as setup fodder. On stall teams, Knock Off is an option, as it can hinder a lot of unsuspecting targets by removing their item. For example, it can remove Poliwrath's Leftovers so that its use of Substitute is limited and entry hazard damage racks up on it faster. It can also remove items that boost the power of wallbreakers such as Choice Specs from Typhlosion, Choice Band from Floatzel, and Life Orb from Magmortar, making each of them significantly easier for Lickilicky or one of its teammates to wall. However, in many cases, Toxic or even just Return is sufficient to deter these threats.</p> <p>Leftovers is a natural choice for a stall Pokemon. Maximum HP and Special Defense investment is necessary to effectively check the likes of Charizard, Jynx, and Manectric. Alternatively, since Lickilicky's natural physical bulk is just as good as its special bulk, maximizing its Defense instead is certainly possible if you need to keep the likes of Tauros and Dodrio in check. However, NU is more specially oriented, and the Fighting weakness becomes even more hindering for a physical wall. Some mixed defensive spreads are playable as well; 252 HP / 76 Def / 180 SpD with a Careful nature provides enough physical bulk to survive a Close Combat from Choice Scarf Hitmonchan, and an Impish nature with a spread of 252 HP / 96 Def / 160 SpD will allow Lickilicky to survive a Focus Punch from Poliwrath and an Explosion from some bulky Skuntank variants while still being able to take a Focus Blast from the likes of Gardevoir and Magmortar. This Lickilicky variant fits mostly on balance and stall teams, where its passivity isn't too bothersome.</p> <p>Lickilicky's ability to heal its teammates with Wish is greatly appreciated by Pokemon such as Regirock, which provides a good defensive presence against Tauros, Dodrio, and Drifblim, three Pokemon that can take advantage of Lickilicky. Since Lickilicky is forced out by Fighting-types like Medicham, Hitmonchan, and Poliwrath, having a reliable answer to most of these threats like Sableye and Slowking is a good idea. Furthermore, Lickilicky has a harder time performing as a special wall if the opposing Charizard, Magmortar, Typhlosion, Gardevoir, or Jynx packs Focus Blast, although spamming Protect and Wish potentially stall them out. Thus, some additional insurances against these Pokemon in the form of Politoed and once again Slowking can be considered.</p>"
      },
      "Swords Dance": {
        "description": "<p>With this set, Lickilicky can turn into a potent stallbreaker thanks to its bulk and access to Swords Dance, as it can find several opportunities to set up throughout the match. Return is a decently powerful and reliable STAB move without any significant drawbacks. Aqua Tail grants near-perfect neutral coverage alongside Return and hits Haunter and Drifblim very hard when boosted. Power Whip packs a very appealing immediate power and coverage, notably scoring a guaranteed 2HKO on Regirock and most Cradily, as well as an OHKO on Slowking. Explosion provides a tremendously powerful last-ditch tool, as it will break through Regirock after one Swords Dance. Substitute, on the other hand, is a more defensive approach that allows Lickilicky to avoid status and set up Swords Dance safely against passive Pokemon. If you manage to keep the Substitute up, you may deter frailer and faster Pokemon that might try to revenge kill Lickilicky. Heal Bell enables Lickilicky to directly switch in on defensive threats without having to worry about being statused. It also works better against Pokemon that are strong enough to break Lickilicky's Substitute in one hit and threaten it with status afterwards.</p> <p>The given EV spread aims to hit as hard as possible while outspeeding base 70 Speed Pokemon like Poliwrath and Politoed without investment. The rest is dumped into HP in order to keep some bulk, enabling Lickilicky to take two Thunderbolts from Choice Scarf Manectric after Stealth Rock. However, if you're using Substitute, you may opt for a more optimized EV spread like 252 HP / 24 Atk / 92 SpD / 140 Spe with a Careful nature, which provides a Substitute sturdy enough to take a Surf from defensive Slowking, a Rock Slide from Cradily and some Regirock, and a Seismic Toss, as well as any hit weaker than these. Leftovers makes up for the health lost by the potential use of Substitute or by the damage inflicted by the defensive Pokemon that Lickilicky uses as setup bait.</p> <p>Said Pokemon need to be dragged onto the field for Lickilicky to come in and start using Swords Dance. Sweepers like Drifblim, Floatzel, Charizard, and Typhlosion tend to attract the likes of Slowking, Cradily, and defensive Lickilicky. All of these can serve as setup bait for this Lickilicky variant. Unless it manages to always keep the cover from Substitute, Lickilicky will be forced out by faster Fighting-types like Medicham, Hitmonchan, and Poliwrath and overall strong offensive threats like Tauros and Magmortar. Therefore, defensive backbones in the form of Sableye and Slowking remain good partners.</p>"
      },
      "Choice Band": {
        "description": "<p>Although Lickilicky faces a lot of competition from the likes of Tauros and Dodrio as an offensive Normal-type due to their superior Speed and Attack, Choice Band Lickilicky still retains some merits, namely its bulk, its movepool, and the potential surprise factor. Return remains Lickilicky's preferred STAB move. Power Whip is a powerful coverage move that 2HKOes most Regirock and Sableye variants after Stealth Rock and heavily dents Slowking and Sandslash, among other physically bulky Pokemon. Ice Punch nearly OHKOes Haunter and Gligar and 2HKOes Cradily and Drifblim. Explosion tears through just about anything bar Ghost-types and a couple of very physically bulky Rock-types, which means that most Pokemon that would be able to tank Lickilicky's other moves still have to watch out. Aqua Tail remains a nice middle ground due to its overall coverage, which allows it to hit all of Magneton, Haunter, Sandslash, Drifblim, Regirock, and Gligar for good damage.</p> <p>The given EV spread allows Lickilicky to outspeed uninvested base 70 Speed Pokemon while hitting as hard as possible; the remaining EVs go into HP. Investing more into HP can be considered; for instance, 232 EVs in this stat ensure that some common Pokemon like offensive Skuntank, Choice Scarf Gardevoir, and Life Orb Venomoth cannot 2HKO Lickilicky after Stealth Rock damage, but it requires cutting Lickilicky's Speed by a significant amount. An Adamant nature and Choice Band further enhances Lickilicky's Attack.</p> <p>Choice Band Lickilicky has an easier time coming onto the field and punching holes in the opposing team if the foe happens to be a relatively passive Pokemon like Cradily or Hypno. Thus, offensive Pokemon like Charizard and Manectric remain teammates of choice, since they tend to attract this kind of Pokemon. In a similar manner, Lickilicky is still pressured by faster Fighting-types and other powerhouses, which means that typical answers to these threats like Sableye and Slowking are once again among Lickilicky's favorite partners.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Wenderz", "user_id": 331114}], "teams": [{"name": "Quality checked by", "members": [{"username": "Honko", "user_id": 42413}, {"username": "Bughouse", "user_id": 52547}]}, {"name": "Grammar checked by", "members": [{"username": "deetah", "user_id": 297659}, {"username": "Lumari", "user_id": 232216}]}]}
  },
  "Magmortar": {
    "overview": "<p>Magmortar is one of the most dangerous Pokemon in NU. Its Fire Blast is the second strongest special attack in the tier (behind only Typhlosion's fully-powered Eruption), and it can back that up with fantastic coverage moves in Thunderbolt and Focus Blast that make it extremely difficult to switch into. However, Magmortar can sometimes be tricky to fit onto teams due to two issues: its Stealth Rock weakness and its lower Speed than other Fire-types. Being weak to Stealth Rock means it requires more support than other wallbreakers like Medicham and Magneton, and, although its Speed isn't terrible, being slower than Charizard and Typhlosion makes it a less effective check to Pokemon like Jynx and Haunter. On the other hand, none of those other Pokemon bring Magmortar's combination of power and coverage to the table. So long as Magmortar's team is built to compensate for its weaknesses, it is one of the best Pokemon in the tier.</p>",
    "comments": "<h1>Other Options</h1> <p>Magmortar can run a terrifying Choice Specs set that 2HKOes literally everything in NU except Grumpig and Flareon. It's harder to fit on teams and use successfully than other sets, though, because it requires excellent prediction and teammates that can reliably keep entry hazards off the field in order to be effective. A Sunny Day set with Solar Beam is also an option, but it's less useful on Magmortar than other Fire-types because Magmortar already has Thunderbolt for Water-types.</p> <p>Including Sleep Talk on any set makes Magmortar a great sleep absorber that can switch in on Jynx and Grass-types. Earthquake is Magmortar's best option against opposing Fire-types other than Charizard, making it a decent option on a mixed Life Orb set; even without any Attack investment, it OHKOes opposing Magmortar, Typhlosion, and Ninetales after Stealth Rock damage. Magmortar can theoretically go fully physical with its decent base 95 Attack and a nice movepool that also includes Flare Blitz, Thunder Punch, Low Kick, and even Mach Punch, but it's noticeably less powerful and doesn't really do anything better than its special attacking sets. Belly Drum is an entertaining option for those who feel adventurous, as Magmortar actually has higher Attack than Charizard and still outspeeds most of the same Choice Scarf users after a Salac Berry boost. However, like Belly Drum Charizard, it needs a perfectly orchestrated opportunity to set up that is difficult to actually pull off with any consistency even with a fully dedicated team, and Magmortar's lower Speed and lack of a Ground immunity make that opportunity even more difficult to create.</p> <h1>Checks and Counters</h1> <p>Specially defensive Grumpig isn't even 3HKOed by any of Magmortar's attacks and can cripple it with status, although it lacks recovery and therefore can't counter Magmortar indefinitely if Stealth Rock isn't up. Specially defensive Hypno and Gardevoir are potential counters that can stall Magmortar out with Wish and Protect once they're in, but if Stealth Rock is up, Life Orb-boosted Fire Blast has a decent chance to 2HKO them as they switch in. All three of these Psychic-types are very vulnerable to being trapped by Skuntank, which is a common teammate for Magmortar, so they must be played cautiously.</p> <p>Slowking and Politoed can check Magmortar, as they can switch in on Fire Blast while still retaining enough HP to survive a Thunderbolt on the next turn, but they lose if Magmortar uses Thunderbolt on the switch. Ninetales can switch in for free on Fire Blast, set up with Nasty Plot while surviving a hit from Focus Blast or Thunderbolt, and OHKO Magmortar with +2 Hidden Power Rock, but it will lose if it gets hit by Focus Blast, Thunderbolt, or Earthquake as it switches in. Specially defensive Camerupt and Flareon are uncommon sights in NU, but they both counter Magmortar quite effectively unless it carries Earthquake. Specially defensive Cradily and Regirock can sometimes force Magmortar out, despite being weak to Focus Blast, because Magmortar must risk Focus Blast's accuracy twice in a row to KO them and they can threaten to OHKO back with Rock Slide in case of a miss. Specially defensive Lickilicky similarly forces Magmortar to either rely on good fortune or switch out; unless Magmortar consistently hits its Focus Blasts or gets a lucky Special Defense drop or burn, Lickilicky can stall out Fire Blast's and Focus Blast's PP with Wish and Protect. Finally, many faster Pokemon can revenge kill Magmortar, especially physical attackers such as Tauros, Floatzel, Dodrio, and Pinsir.</p>",
    "sets": {
      "Wallbreaker": {
        "description": "<p>Unparalleled power and coverage make Magmortar a fantastic wallbreaker. Life Orb STAB Fire Blast coming off Magmortar's base 125 Special Attack is almost impossible to switch into without a resistance. Thunderbolt really sets Magmortar apart from other Fire-types by allowing it to 2HKO Water-types such as Slowking and Politoed. Focus Blast has a good chance to OHKO Regirock that don't invest in Special Defense; it also helps achieve 2HKOs on specially defensive Lickilicky and Cradily, which Fire Blast can't quite muster. Hidden Power Grass rounds out Magmortar's coverage, allowing it to beat the occasional Whiscash or Gastrodon as well as giving it a more accurate option for finishing off weakened Rock- and Ground-types.</p> <p>Life Orb gives this set its devastating power, most importantly by powering up Fire Blast against neutral targets. Expert Belt is a viable alternative that allows Magmortar to take better advantage of its decent special bulk without getting worn down too quickly by Life Orb recoil on top of Stealth Rock damage. Expert Belt still gives Magmortar a moderate boost to its coverage moves, but it's a good idea to compensate for the loss of power by either switching to a Modest nature or having a teammate set up Spikes in addition to the usual Stealth Rock. The lack of recoil damage also makes Magmortar's set slightly harder to guess, but don't count on consistently bluffing a Choice item, as Expert Belt is fairly common and expected on Magmortar.</p> <p>Substitute and Taunt are both viable alternatives over either Focus Blast or Hidden Power Grass. Substitute punishes switches, especially sacrifices intended to get a revenge killer in. On the other hand, Taunt prevents opposing walls from healing, which can allow Magmortar to win one-on-one against passive walls that could otherwise attempt to stall it out such as Lickilicky and Hypno. Both moves also protect Magmortar from status effects. If you use Substitute, then Expert Belt and Leftovers become better items choices, as the combined residual damage from entry hazards, Substitute, and Life Orb would severely shorten Magmortar's lifespan.</p> <p>Specially defensive Psychic-types such as Slowking, Hypno, and Grumpig are Magmortar's most common switch-ins, so Pursuit Skuntank is an ideal teammate thanks to its ability to trap and remove them. Like most Fire-types, Magmortar greatly appreciates Rapid Spin support, so either Hitmonchan or Sandslash is also a good addition to the team. If you're building an offensive team, adding another Fire-type such as Charizard or Typhlosion is a popular choice, as they greatly appreciate Magmortar's ability to break through common counters; just make sure you have a solid answer to opposing Tauros and Floatzel, as they can outspeed and OHKO both of your Fire-types.</p>"
      },
      "Choice Scarf": {
        "description": "<p>The power and coverage that make Magmortar such a good wallbreaker also make it an effective revenge killer and late-game sweeper when equipped with a Choice Scarf. Magmortar's Fire Blast is powerful enough to OHKO most offensive Pokemon that don't resist it, especially if you can keep Stealth Rock up. Thunderbolt gives Magmortar great coverage against Water- and Flying-types, most notably allowing Magmortar to revenge kill Charizard after a couple of rounds of Life Orb recoil. Hidden Power Grass covers Rock- and Ground-types, including Dragon Dance Whiscash and Rock Polish Rhydon. In the last moveslot, Focus Blast maximizes Magmortar's coverage, allowing it to OHKO Rock Polish Regirock and deal more damage to most Normal- and Fire-types. However, being locked into a 70% accurate move that a lot of common Pokemon resist isn't ideal, so running a second STAB move is also an option that gives Magmortar flexibility in choosing between power and accuracy depending on the in-game situation. The 100% accurate Flamethrower is a great option to have in order to safely revenge kill or sweep against weakened foes without worrying about an untimely miss. On the other hand, Overheat provides extra single-turn power that allows Magmortar to reliably OHKO some important targets that Fire Blast can't quite guarantee without prior damage, including Tauros, Medicham, and Skuntank.</p> <p>With maximum Speed investment, Magmortar ties with +2 positive-natured Pokemon with base 50 Speed such as Timid Sunny Day Vileplume and Jolly Rock Polish Regirock. It also outspeeds common base 80 Speed Choice Scarf users such as Medicham and Gardevoir as well as slower Rain Dance sweepers such as Modest Gorebyss and Adamant Relicanth.</p> <p>As with pretty much any set that any Fire-type in NU runs, this set appreciates Skuntank's support in removing bulky Psychic-types such as Slowking and Grumpig. Rapid Spin support is also crucial in allowing Magmortar to switch in multiple times to revenge kill opposing threats. It can also allow Magmortar to use its bulk to pull off a late-game sweep even if the opponent has a faster Choice Scarf user. For example, Choice Scarf Manectric deals slightly more than 50% to Magmortar on average, while Magmortar can OHKO back with Fire Blast. If you can keep Magmortar healthy by keeping Stealth Rock off the field, it can shake off a hit from Manectric and continue with a sweep, but if it's taken a couple of rounds of Stealth Rock damage, Manectric will be able to KO it. Hitmonchan is a great option; in addition to spinning, it pressures Lickilicky and Regirock, lures and weakens Slowking with Thunder Punch, and benefits from the same Skuntank support that helps Magmortar sweep.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Honko", "user_id": 42413}], "teams": [{"name": "Quality checked by", "members": [{"username": "Oglemi", "user_id": 40358}]}, {"name": "Grammar checked by", "members": [{"username": "CryoGyro", "user_id": 331519}, {"username": "GatoDelFuego", "user_id": 91628}]}]}
  }
}