{
  "Bellossom": {
    "overview": "<p>Bellossom functions as one of PU's best specially defensive Pokemon. With a great support movepool, good bulk, and reliable recovery, it is able to check a wide variety of special attackers like Misdreavus, Mantine, Ampharos, and Mr. Mime. Bellossom sets itself apart from the other Grass-types in the tier by using its superior Special Defense to check Water-types like Golduck as well, while the other big Grass-type, Tangela, can't do so. However, Bellossom's lower Defense means physical attackers like Rhydon, Relicanth, Zangoose, and Purugly can still break through it.</p> ",
    "sets": [
      {
        "name": "Specially Defensive",
        "description": "<p>Leaf Blade is the chosen attacking move for Bellossom, as it allows it to beat most Calm Mind users that may try and set up on it, most notably Misdreavus, Golduck, and Substitute Mantine. Energy Ball is another option, as it uses Bellossom's slightly higher Special Attack to get OHKOs on Rhydon and Relicanth. Sleep Powder is one of Bellossom's most useful moves, as it allows it to essentially eliminate one of its switchi-ns, notably Victreebel. Leech Seed helps provide Bellossom with more passive recovery, while Stun Spore can be used to help cripple foes like Murkrow that might otherwise switch into Bellossom freely. Bellossom's ability to check most Water-types makes it a great partner for Pokemon like Magmar, Rhydon, and Relicanth that normally are threatened by or have trouble breaking through bulky Water-types like Quagsire and Mantine. Rhydon and Relicanth also deal with Muk very easily, which Bellossom greatly appreciates. Monferno is an option to help with opposing Grass-types like Tangela and Victreebel that Bellossom can't damage well as well as providing U-turn support. Bellossom also appreciates Water-type teammates like Politoed and Mantine to switch into Fire-type moves from opposing Magmar.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 346653, "username": "avarice"}, {"user_id": 231726, "username": "Akir"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "Lumari"}]}], "writtenBy": [{"user_id": 265399, "username": "SergioRules"}]}
  },
  "Golduck": {"sets": [{"name": "Choice Scarf"}, {"name": "Calm Mind"}]},
  "Muk": {"sets": [{"name": "Curse"}]},
  "Murkrow": {"sets": [{"name": "Life Orb Attacker"}]},
  "Purugly": {"sets": [{"name": "All-out Attacker"}]}
}