{
  "Clamperl": {
    "overview": "<p>Clamperl may seem pitiful, but its signature item Deep Sea Tooth doubles its Special Attack and makes it a fearsome attacker with Trick Room support. Clamperl exploits the tier's lack of common Water-resistant foes and can sweep through unprepared teams with its powerful Muddy Water, especially in rain. However, none of Clamperl's other stats get boosted, which makes it the slowest viable Pokemon in the tier and threatened by nearly any attacker. Clamperl is powerful, but its frailty and chance to miss Muddy Water make it an inconsistent performer.</p> ",
    "comments": "<h1>Other Options</h1> <p>Clamperl can drop a coverage option for Brine, which can eliminate low-HP foes without risking a Muddy Water miss. Clamperl can also run Hidden Power Grass to OHKO Swampert; however, as it already takes significant damage from Muddy Water, it is more important to cover the Gyarados and Empoleon matchups.</p> <h1>Checks and Counters</h1> <p><strong>Water-resistant foes: Common Water-resistant foes such as Latios, Latias, and Shaymin all threaten to OHKO Clamperl with their powerful STAB attacks. While Clamperl can deal a lot of damage with Ice Beam, this means that it's not using Muddy Water, which leaves it vulnerable to the other opposing Pokemon.</p> <p><strong>Any Attack: Clamperl is so frail that common powerful attacks such as Latios's Psychic will effortlessly OHKO it, while other attacks such as Metagross's Zen Headbutt, Tyranitar's Stone Edge, and many more threaten to at least 2HKO it.</p> ",
    "sets": [
      {
        "name": "Rain Sweeper",
        "description": "<h1>Set Description</h1> <p>Clamperl will mostly be using Muddy Water, as there are few Pokemon in the tier that can comfortably take one, especially in rain. Common Water-resistant foes such as Latios, Latias, and Shaymin all move after Clamperl in Trick Room and take significant damage from Ice Beam, while opposing Water-types such as Gyarados and Empoleon must fear Hidden Power Electric. Clamperl needs Protect to defend itself in situations that expose its terrible bulk, such as when foes use Fake Out and whenever Trick Room isn't up. Trick Room is essential to Clamperl's success, as it can clean up late-game or weaken teams throughout the mid-game for another Trick Room attacker to clean up.</p> <h1>Team Options</h1> <p>Dusclops is the best Trick Room setter for Clamperl, as it underspeeds Clamperl, meaning it can set up Rain Dance before Clamperl moves in Trick Room. It provides additional support with Helping Hand and can break Focus Sash with its attacking move so Clamperl can pick up more KOs. Bronzong can also provide Trick Room and Rain Dance support.</p> <p>Fellow powerful Trick Room attackers such as Rhyperior and Machamp can also pick up KOs whenever Clamperl misses them. Rhyperior is an especially natural fit, as its Lightning Rod ability keeps Clamperl safe from Electric-type attacks from Raikou and Rotom-A.</p> <p>Raikou is an additional Rain Dance user, and its Electric-type STAB attacks can eliminate common Water-types such as Gyarados and Suicune. Other beneficiaries of rain are fast Swift Swim users such as Kingdra and Ludicolo, which can help weaken teams for Clamperl whenever Trick Room isn't up.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "bunnyy", "user_id": 192134}], "teams": [{"name": "Quality checked by", "members": [{"username": "zee", "user_id": 501951}, {"username": "qsns", "user_id": 230771}]}, {"name": "Grammar checked by", "members": [{"username": "Tea Guzzler", "user_id": 577920}, {"username": "Adeleine", "user_id": 517429}]}]}
  }
}