{
  "Rotom-Heat": {
    "sets": {
      "Choice Specs": {
        "description": "<p>With Choice Specs, Rotom-A becomes one of the tier's most threatening special attackers. With its nigh-unwallable coverage and solid Speed tier, Rotom-A can pressure nearly the entire tier and force opponents into unfavorable damage trades. Thunderbolt and Shadow Ball are powerful STAB attacks that combine to hit the entire tier for at least neutral damage, while a coverage move of choice can better threaten specific foes. Leaf Storm OHKOes Swampert, Overheat OHKOes Steel-types such as Metagross and Bronzong, and Hydro Pump 2HKOes Heatran andall but the bulkiest Tyranitar. Trick can be used to cripple support Pokemon such as Togekiss or Bronzong, which frees up Rotom-A to make use of its coverage options. Rotom-A's unique set of immunities and resistances allow for solid longevity even on this very offensive set, allowing it to use its powerful attacks without worrying about Fake Out or strong Fighting- and Ground-type moves, such as Heracross's Close Combat or Metagross's Earthquake. Choice Specs Rotom-A acts mostly as a wallbreaker, and it is particularly effective as a lead. Lead Rotom-A leverages its good defensive typing and ability to immediately pressure either of the opposing Pokemon, with Trick giving the additional option to cripple support Pokemon. As a lead, its Ghost typing gives Rotom-A a crucial immunity to Fake Out from Hitmontop and Mew, allowing Rotom-A to throw out strong attacks without the threat of being flinched. Mew in particular doesn't want to stay in on a Shadow Ball. Rotom-A appreciates teammates that can deal with Tyranitar, as it can take most of Rotom-A's attacks well while threatening super effective damage or setting up a Dragon Dance. Metagross and Heracross are good partners that threaten Tyranitar, while Rotom-A checks their counters, such as Gyarados, in return. Rotom-A doesn't appreciate trading with Sucker Punch Hitmontop or Mew, so Intimidate users such as Gyarados and your own Hitmontop make for good teammates.</p>"
      },
      "Choice Scarf": {
        "description": "<p>Choice Scarf Rotom-A is a powerful revenge killer that outspeeds the entire unboosted metagame. Rotom-Cut's Leaf Storm matches up better against Swampert and Tyranitar, but one can change formes and use different coverage options for better matchups against different threats, such as Metagross or Bronzong. Alternatively, Choice Scarf Rotom-A can drop a coverage move for a support move such as Thunder Wave or Will-O-Wisp and play more of a supportive role, especially after it drops its Choice Scarf with Trick. Choice Scarf Rotom-A is less focused on wallbreaking compared to Choice Specs sets, mostly a more support-oriented Pokemon early- and mid-game or a late-game cleaner. As a cleaner, Rotom-A prefers to lock into either of its STAB moves if possible, as its coverage options are less reliable and harder to spam. Overheat's and Leaf Storm's Special Attack drops greatly reduce Rotom-A's offensive pressure, while Hydro Pump's lower accuracy makes it risky to rely on for consistent damage. If Rotom-A uses a status move instead of a coverage move, then its priority is to lose its Choice Scarf with Trick and follow up with status moves to disrupt the opponent's game plan. As a lead, Choice Scarf Rotom-A can leverage its great Speed tier to get the jump on Pokemon that would normally be faster, such as Latias or Mew. In general, Rotom-A matches up well against common leads such as Metagross and Mew, threatening them with super effective damage. Additionally, more passive lead options such as Bronzong or Hitmontop hate getting a Choice Scarf from Trick. Choice Scarf Rotom-A appreciates partners that threaten Tyranitar such as Gyarados, Metagross, and Heracross, but it is less reliant on them than other Rotom-A sets to create value, as the Choice Scarf set doesn't need to spread consistent damage. Hitmontop's Fake Out gives Rotom-A free turns to use Trick or hit foes with its status moves, if it runs them.</p>"
      },
      "Bulky Disruption": {
        "description": "<p>Rotom-A can opt for a full-on defensive set to focus on sponging hits and providing speed control or damage reduction with status. Bulky Rotom-A can drop a status move for Protect to allow for better longevity and easier positioning. Thunder Wave is often more valuable than Will-O-Wisp, as it can take fast threats such as Latias out of the game almost entirely, while the damage reduction and chip damage from Will-O-Wisp may not provide enough value in fast-paced games. Special Defense investment is required to be able to take on Latias's Draco Meteor and opposing Rotom-A's Shadow Ball, letting Rotom-A threaten super effective damage with its own Shadow Ball—physical damage reduction is more readily available through Intimidate and your own Will-O-Wisp. Sitrus Berry is standard, as the burst healing allows Rotom-A to match up better against the tier's strong attackers, although Leftovers can be used to offset sand chip damage and synergize better with Protect. While Rotom-A is able to withstand the strongest attacks in the tier, it doesn't like to take unnecessary damage because it is often a team's defensive glue, so safely bringing Rotom-A onto the field is important. Bulky Rotom-A can be used as a lead, but once the opponent realizes it is a less aggressive set, they can take advantage of Rotom-A's low unboosted damage output. Bulky Rotom-A often trades health for the chance to status a major threat, such as Choice Specs Latias, Choice Scarf Heracross, or Dragon Dance Tyranitar. Rotom-A's low base HP makes it a great user of Pain Split, allowing for another avenue to whittle down foes while increasing longevity. Both mid-tier Speed and fast offensive Pokemon appreciate the speed control Rotom-A can provide. Pokemon such as Gyarados, Heatran, and Metagross love outspeeding threats such as Latias or opposing Rotom-A, which would otherwise apply a lot of offensive pressure. Similarly, as teammates, these same fast threats appreciate Thunder Wave slowing down common Choice Scarf users such as Heracross, as well as allowing them to win potential mirror matches.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 608134, "username": "bagel"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 192134, "username": "ryo yamada2001"}, {"user_id": 501951, "username": "zee"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}]}
  },
  "Rotom-Wash": {
    "sets": {
      "Choice Specs": {
        "description": "<p>With Choice Specs, Rotom-A becomes one of the tier's most threatening special attackers. With its nigh-unwallable coverage and solid Speed tier, Rotom-A can pressure nearly the entire tier and force opponents into unfavorable damage trades. Thunderbolt and Shadow Ball are powerful STAB attacks that combine to hit the entire tier for at least neutral damage, while a coverage move of choice can better threaten specific foes. Overheat OHKOes Steel-types such as Metagross and Bronzong, and Hydro Pump 2HKOes Heatran and all but the bulkiest Tyranitar, while Leaf Storm OHKOes Swampert. Trick can be used to cripple support Pokemon such as Togekiss or Bronzong, which frees up Rotom-A to make use of its coverage options. Rotom-A's unique set of immunities and resistances allow for solid longevity even on this very offensive set, allowing it to use its powerful attacks without worrying about Fake Out or strong Fighting- and Ground-type moves, such as Heracross's Close Combat or Metagross's Earthquake. Choice Specs Rotom-A acts mostly as a wallbreaker, and it is particularly effective as a lead. Lead Rotom-A leverages its good defensive typing and ability to immediately pressure either of the opposing Pokemon, with Trick giving the additional option to cripple support Pokemon. As a lead, its Ghost typing gives Rotom-A a crucial immunity to Fake Out from Hitmontop and Mew, allowing Rotom-A to throw out strong attacks without the threat of being flinched. Mew in particular doesn't want to stay in on a Shadow Ball. Rotom-A appreciates teammates that can deal with Tyranitar, as it can take most of Rotom-A's attacks well while threatening super effective damage or setting up a Dragon Dance. Metagross and Heracross are good partners that threaten Tyranitar, while Rotom-A checks their counters, such as Gyarados, in return. Rotom-A doesn't appreciate trading with Sucker Punch Hitmontop or Mew, so Intimidate users such as Gyarados and your own Hitmontop make for good teammates.</p>"
      },
      "Choice Scarf": {
        "description": "<p>Choice Scarf Rotom-A is a powerful revenge killer that outspeeds the entire unboosted metagame. Rotom-Heat's Overheat matches up better against Metagross and Bronzong, but one can change formes and use different coverage options for better matchups against different threats, such as Tyranitar or Swampert. Alternatively, Choice Scarf Rotom-A can drop a coverage move for a support move such as Thunder Wave or Will-O-Wisp and play more of a supportive role, especially after it drops its Choice Scarf with Trick. Choice Scarf Rotom-A is less focused on wallbreaking compared to Choice Specs sets, mostly a more support-oriented Pokemon early- and mid-game or a late-game cleaner. As a cleaner, Rotom-A prefers to lock into either of its STAB moves if possible, as its coverage options are less reliable and harder to spam. Overheat's and Leaf Storm's Special Attack drops greatly reduce Rotom-A's offensive pressure, while Hydro Pump's lower accuracy makes it risky to rely on for consistent damage. If Rotom-A uses a status move instead of a coverage move, then its priority is to lose its Choice Scarf with Trick and follow up with status moves to disrupt the opponent's game plan. As a lead, Choice Scarf Rotom-A can leverage its great Speed tier to get the jump on Pokemon that would normally be faster, such as Latios or Mew. In general, Rotom-A matches up well against common leads such as Metagross and Mew, threatening them with super effective damage. Additionally, more passive lead options such as Bronzong or Hitmontop hate getting a Choice Scarf from Trick. Choice Scarf Rotom-A appreciates partners that threaten Tyranitar such as Gyarados, Metagross, and Heracross, but it is less reliant on them than other Rotom-A sets to create value, as the Choice Scarf set doesn't need to spread consistent damage. Hitmontop's Fake Out gives Rotom-A free turns to use Trick or hit foes with its status moves, if it runs them.</p>"
      },
      "Bulky Disruption": {
        "description": "<p>Rotom-A can opt for a full-on defensive set to focus on sponging hits and providing speed control or damage reduction with status. Bulky Rotom-A can drop a status move for Protect to allow for better longevity and easier positioning. Thunder Wave is often more valuable than Will-O-Wisp, as it can take fast threats such as Latios out of the game almost entirely, while the damage reduction and chip damage from Will-O-Wisp may not provide enough value in fast-paced games. Special Defense investment is required to be able to take on Latios's Draco Meteor and opposing Rotom-A's Shadow Ball, letting Rotom-A threaten super effective damage with its own Shadow Ball—physical damage reduction is more readily available through Intimidate and your own Will-O-Wisp. Sitrus Berry is standard, as the burst healing allows Rotom-A to match up better against the tier's strong attackers, although Leftovers can be used to offset sand chip damage and synergize better with Protect. While Rotom-A is able to withstand the strongest attacks in the tier, it doesn't like to take unnecessary damage because it is often a team's defensive glue, so safely bringing Rotom-A onto the field is important. Bulky Rotom-A can be used as a lead, but once the opponent realizes it is a less aggressive set, they can take advantage of Rotom-A's low unboosted damage output. Bulky Rotom-A often trades health for the chance to status a major threat, such as Choice Specs Latios, Choice Scarf Heracross, or Dragon Dance Tyranitar. Rotom-A's low base HP makes it a great user of Pain Split, allowing for another avenue to whittle down foes while increasing longevity. Both mid-tier Speed and fast offensive Pokemon appreciate the speed control Rotom-A can provide. Pokemon such as Gyarados, Heatran, and Metagross love outspeeding threats such as Latios, Latias, or opposing Rotom-A, which would otherwise apply a lot of offensive pressure. Similarly, as teammates, these same fast threats appreciate Thunder Wave slowing down common Choice Scarf users such as Heracross, as well as allowing them to win potential mirror matches.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 608134, "username": "bagel"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 192134, "username": "ryo yamada2001"}, {"user_id": 501951, "username": "zee"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}]}
  },
  "Rotom-Frost": {
    "sets": {
      "Choice Specs": {
        "description": "<p>With Choice Specs, Rotom-A becomes one of the tier's most threatening special attackers. With its nigh-unwallable coverage and solid Speed tier, Rotom-A can pressure nearly the entire tier and force opponents into unfavorable damage trades. Thunderbolt and Shadow Ball are powerful STAB attacks that combine to hit the entire tier for at least neutral damage, while a coverage move of choice can better threaten specific foes. Overheat OHKOes Steel-types such as Metagross and Bronzong, and Hydro Pump 2HKOes Heatran and all but the bulkiest Tyranitar, while Leaf Storm OHKOes Swampert. Trick can be used to cripple support Pokemon such as Togekiss or Bronzong, which frees up Rotom-A to make use of its coverage options. Rotom-A's unique set of immunities and resistances allow for solid longevity even on this very offensive set, allowing it to use its powerful attacks without worrying about Fake Out or strong Fighting- and Ground-type moves, such as Heracross's Close Combat or Metagross's Earthquake. Choice Specs Rotom-A acts mostly as a wallbreaker, and it is particularly effective as a lead. Lead Rotom-A leverages its good defensive typing and ability to immediately pressure either of the opposing Pokemon, with Trick giving the additional option to cripple support Pokemon. As a lead, its Ghost typing gives Rotom-A a crucial immunity to Fake Out from Hitmontop and Mew, allowing Rotom-A to throw out strong attacks without the threat of being flinched. Mew in particular doesn't want to stay in on a Shadow Ball. Rotom-A appreciates teammates that can deal with Tyranitar, as it can take most of Rotom-A's attacks well while threatening super effective damage or setting up a Dragon Dance. Metagross and Heracross are good partners that threaten Tyranitar, while Rotom-A checks their counters, such as Gyarados, in return. Rotom-A doesn't appreciate trading with Sucker Punch Hitmontop or Mew, so Intimidate users such as Gyarados and your own Hitmontop make for good teammates.</p>"
      },
      "Choice Scarf": {
        "description": "<p>Choice Scarf Rotom-A is a powerful revenge killer that outspeeds the entire unboosted metagame. Rotom-Heat's Overheat matches up better against Metagross and Bronzong, but one can change formes and use different coverage options for better matchups against different threats, such as Tyranitar or Swampert. Alternatively, Choice Scarf Rotom-A can drop a coverage move for a support move such as Thunder Wave or Will-O-Wisp and play more of a supportive role, especially after it drops its Choice Scarf with Trick. Choice Scarf Rotom-A is less focused on wallbreaking compared to Choice Specs sets, mostly a more support-oriented Pokemon early- and mid-game or a late-game cleaner. As a cleaner, Rotom-A prefers to lock into either of its STAB moves if possible, as its coverage options are less reliable and harder to spam. Overheat's and Leaf Storm's Special Attack drops greatly reduce Rotom-A's offensive pressure, while Hydro Pump's lower accuracy makes it risky to rely on for consistent damage. If Rotom-A uses a status move instead of a coverage move, then its priority is to lose its Choice Scarf with Trick and follow up with status moves to disrupt the opponent's game plan. As a lead, Choice Scarf Rotom-A can leverage its great Speed tier to get the jump on Pokemon that would normally be faster, such as Latios or Mew. In general, Rotom-A matches up well against common leads such as Metagross and Mew, threatening them with super effective damage. Additionally, more passive lead options such as Bronzong or Hitmontop hate getting a Choice Scarf from Trick. Choice Scarf Rotom-A appreciates partners that threaten Tyranitar such as Gyarados, Metagross, and Heracross, but it is less reliant on them than other Rotom-A sets to create value, as the Choice Scarf set doesn't need to spread consistent damage. Hitmontop's Fake Out gives Rotom-A free turns to use Trick or hit foes with its status moves, if it runs them.</p>"
      },
      "Bulky Disruption": {
        "description": "<p>Rotom-A can opt for a full-on defensive set to focus on sponging hits and providing speed control or damage reduction with status. Bulky Rotom-A can drop a status move for Protect to allow for better longevity and easier positioning. Thunder Wave is often more valuable than Will-O-Wisp, as it can take fast threats such as Latios out of the game almost entirely, while the damage reduction and chip damage from Will-O-Wisp may not provide enough value in fast-paced games. Special Defense investment is required to be able to take on Latios's Draco Meteor and opposing Rotom-A's Shadow Ball, letting Rotom-A threaten super effective damage with its own Shadow Ball—physical damage reduction is more readily available through Intimidate and your own Will-O-Wisp. Sitrus Berry is standard, as the burst healing allows Rotom-A to match up better against the tier's strong attackers, although Leftovers can be used to offset sand chip damage and synergize better with Protect. While Rotom-A is able to withstand the strongest attacks in the tier, it doesn't like to take unnecessary damage because it is often a team's defensive glue, so safely bringing Rotom-A onto the field is important. Bulky Rotom-A can be used as a lead, but once the opponent realizes it is a less aggressive set, they can take advantage of Rotom-A's low unboosted damage output. Bulky Rotom-A often trades health for the chance to status a major threat, such as Choice Specs Latios, Choice Scarf Heracross, or Dragon Dance Tyranitar. Rotom-A's low base HP makes it a great user of Pain Split, allowing for another avenue to whittle down foes while increasing longevity. Both mid-tier Speed and fast offensive Pokemon appreciate the speed control Rotom-A can provide. Pokemon such as Gyarados, Heatran, and Metagross love outspeeding threats such as Latios, Latias, or opposing Rotom-A, which would otherwise apply a lot of offensive pressure. Similarly, as teammates, these same fast threats appreciate Thunder Wave slowing down common Choice Scarf users such as Heracross, as well as allowing them to win potential mirror matches.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 608134, "username": "bagel"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 192134, "username": "ryo yamada2001"}, {"user_id": 501951, "username": "zee"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}]}
  },
  "Rotom-Fan": {
    "sets": {
      "Choice Specs": {
        "description": "<p>With Choice Specs, Rotom-A becomes one of the tier's most threatening special attackers. With its nigh-unwallable coverage and solid Speed tier, Rotom-A can pressure nearly the entire tier and force opponents into unfavorable damage trades. Thunderbolt and Shadow Ball are powerful STAB attacks that combine to hit the entire tier for at least neutral damage, while a coverage move of choice can better threaten specific foes. Overheat OHKOes Steel-types such as Metagross and Bronzong, and Hydro Pump 2HKOes Heatran and all but the bulkiest Tyranitar, while Leaf Storm OHKOes Swampert. Trick can be used to cripple support Pokemon such as Togekiss or Bronzong, which frees up Rotom-A to make use of its coverage options. Rotom-A's unique set of immunities and resistances allow for solid longevity even on this very offensive set, allowing it to use its powerful attacks without worrying about Fake Out or strong Fighting- and Ground-type moves, such as Heracross's Close Combat or Metagross's Earthquake. Choice Specs Rotom-A acts mostly as a wallbreaker, and it is particularly effective as a lead. Lead Rotom-A leverages its good defensive typing and ability to immediately pressure either of the opposing Pokemon, with Trick giving the additional option to cripple support Pokemon. As a lead, its Ghost typing gives Rotom-A a crucial immunity to Fake Out from Hitmontop and Mew, allowing Rotom-A to throw out strong attacks without the threat of being flinched. Mew in particular doesn't want to stay in on a Shadow Ball. Rotom-A appreciates teammates that can deal with Tyranitar, as it can take most of Rotom-A's attacks well while threatening super effective damage or setting up a Dragon Dance. Metagross and Heracross are good partners that threaten Tyranitar, while Rotom-A checks their counters, such as Gyarados, in return. Rotom-A doesn't appreciate trading with Sucker Punch Hitmontop or Mew, so Intimidate users such as Gyarados and your own Hitmontop make for good teammates.</p>"
      },
      "Choice Scarf": {
        "description": "<p>Choice Scarf Rotom-A is a powerful revenge killer that outspeeds the entire unboosted metagame. Rotom-Heat's Overheat matches up better against Metagross and Bronzong, but one can change formes and use different coverage options for better matchups against different threats, such as Tyranitar or Swampert. Alternatively, Choice Scarf Rotom-A can drop a coverage move for a support move such as Thunder Wave or Will-O-Wisp and play more of a supportive role, especially after it drops its Choice Scarf with Trick. Choice Scarf Rotom-A is less focused on wallbreaking compared to Choice Specs sets, mostly a more support-oriented Pokemon early- and mid-game or a late-game cleaner. As a cleaner, Rotom-A prefers to lock into either of its STAB moves if possible, as its coverage options are less reliable and harder to spam. Overheat's and Leaf Storm's Special Attack drops greatly reduce Rotom-A's offensive pressure, while Hydro Pump's lower accuracy makes it risky to rely on for consistent damage. If Rotom-A uses a status move instead of a coverage move, then its priority is to lose its Choice Scarf with Trick and follow up with status moves to disrupt the opponent's game plan. As a lead, Choice Scarf Rotom-A can leverage its great Speed tier to get the jump on Pokemon that would normally be faster, such as Latios or Mew. In general, Rotom-A matches up well against common leads such as Metagross and Mew, threatening them with super effective damage. Additionally, more passive lead options such as Bronzong or Hitmontop hate getting a Choice Scarf from Trick. Choice Scarf Rotom-A appreciates partners that threaten Tyranitar such as Gyarados, Metagross, and Heracross, but it is less reliant on them than other Rotom-A sets to create value, as the Choice Scarf set doesn't need to spread consistent damage. Hitmontop's Fake Out gives Rotom-A free turns to use Trick or hit foes with its status moves, if it runs them.</p>"
      },
      "Bulky Disruption": {
        "description": "<p>Rotom-A can opt for a full-on defensive set to focus on sponging hits and providing speed control or damage reduction with status. Bulky Rotom-A can drop a status move for Protect to allow for better longevity and easier positioning. Thunder Wave is often more valuable than Will-O-Wisp, as it can take fast threats such as Latios out of the game almost entirely, while the damage reduction and chip damage from Will-O-Wisp may not provide enough value in fast-paced games. Special Defense investment is required to be able to take on Latios's Draco Meteor and opposing Rotom-A's Shadow Ball, letting Rotom-A threaten super effective damage with its own Shadow Ball—physical damage reduction is more readily available through Intimidate and your own Will-O-Wisp. Sitrus Berry is standard, as the burst healing allows Rotom-A to match up better against the tier's strong attackers, although Leftovers can be used to offset sand chip damage and synergize better with Protect. While Rotom-A is able to withstand the strongest attacks in the tier, it doesn't like to take unnecessary damage because it is often a team's defensive glue, so safely bringing Rotom-A onto the field is important. Bulky Rotom-A can be used as a lead, but once the opponent realizes it is a less aggressive set, they can take advantage of Rotom-A's low unboosted damage output. Bulky Rotom-A often trades health for the chance to status a major threat, such as Choice Specs Latios, Choice Scarf Heracross, or Dragon Dance Tyranitar. Rotom-A's low base HP makes it a great user of Pain Split, allowing for another avenue to whittle down foes while increasing longevity. Both mid-tier Speed and fast offensive Pokemon appreciate the speed control Rotom-A can provide. Pokemon such as Gyarados, Heatran, and Metagross love outspeeding threats such as Latios, Latias, or opposing Rotom-A, which would otherwise apply a lot of offensive pressure. Similarly, as teammates, these same fast threats appreciate Thunder Wave slowing down common Choice Scarf users such as Heracross, as well as allowing them to win potential mirror matches.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 608134, "username": "bagel"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 192134, "username": "ryo yamada2001"}, {"user_id": 501951, "username": "zee"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}]}
  },
  "Rotom-Mow": {
    "sets": {
      "Choice Specs": {
        "description": "<p>With Choice Specs, Rotom-A becomes one of the tier's most threatening special attackers. With its nigh-unwallable coverage and solid Speed tier, Rotom-A can pressure nearly the entire tier and force opponents into unfavorable damage trades. Thunderbolt and Shadow Ball are powerful STAB attacks that combine to hit the entire tier for at least neutral damage, while a coverage move of choice can better threaten specific foes. Overheat OHKOes Steel-types such as Metagross and Bronzong, and Hydro Pump 2HKOes Heatran and all but the bulkiest Tyranitar, while Leaf Storm OHKOes Swampert. Trick can be used to cripple support Pokemon such as Togekiss or Bronzong, which frees up Rotom-A to make use of its coverage options. Rotom-A's unique set of immunities and resistances allow for solid longevity even on this very offensive set, allowing it to use its powerful attacks without worrying about Fake Out or strong Fighting- and Ground-type moves, such as Heracross's Close Combat or Metagross's Earthquake. Choice Specs Rotom-A acts mostly as a wallbreaker, and it is particularly effective as a lead. Lead Rotom-A leverages its good defensive typing and ability to immediately pressure either of the opposing Pokemon, with Trick giving the additional option to cripple support Pokemon. As a lead, its Ghost typing gives Rotom-A a crucial immunity to Fake Out from Hitmontop and Mew, allowing Rotom-A to throw out strong attacks without the threat of being flinched. Mew in particular doesn't want to stay in on a Shadow Ball. Rotom-A appreciates teammates that can deal with Tyranitar, as it can take most of Rotom-A's attacks well while threatening super effective damage or setting up a Dragon Dance. Metagross and Heracross are good partners that threaten Tyranitar, while Rotom-A checks their counters, such as Gyarados, in return. Rotom-A doesn't appreciate trading with Sucker Punch Hitmontop or Mew, so Intimidate users such as Gyarados and your own Hitmontop make for good teammates.</p>"
      },
      "Choice Scarf": {
        "description": "<p>Choice Scarf Rotom-A is a powerful revenge killer that outspeeds the entire unboosted metagame. Rotom-Heat's Overheat matches up better against Metagross and Bronzong, but one can change formes and use different coverage options for better matchups against different threats, such as Tyranitar or Swampert. Alternatively, Choice Scarf Rotom-A can drop a coverage move for a support move such as Thunder Wave or Will-O-Wisp and play more of a supportive role, especially after it drops its Choice Scarf with Trick. Choice Scarf Rotom-A is less focused on wallbreaking compared to Choice Specs sets, mostly a more support-oriented Pokemon early- and mid-game or a late-game cleaner. As a cleaner, Rotom-A prefers to lock into either of its STAB moves if possible, as its coverage options are less reliable and harder to spam. Overheat's and Leaf Storm's Special Attack drops greatly reduce Rotom-A's offensive pressure, while Hydro Pump's lower accuracy makes it risky to rely on for consistent damage. If Rotom-A uses a status move instead of a coverage move, then its priority is to lose its Choice Scarf with Trick and follow up with status moves to disrupt the opponent's game plan. As a lead, Choice Scarf Rotom-A can leverage its great Speed tier to get the jump on Pokemon that would normally be faster, such as Latios or Mew. In general, Rotom-A matches up well against common leads such as Metagross and Mew, threatening them with super effective damage. Additionally, more passive lead options such as Bronzong or Hitmontop hate getting a Choice Scarf from Trick. Choice Scarf Rotom-A appreciates partners that threaten Tyranitar such as Gyarados, Metagross, and Heracross, but it is less reliant on them than other Rotom-A sets to create value, as the Choice Scarf set doesn't need to spread consistent damage. Hitmontop's Fake Out gives Rotom-A free turns to use Trick or hit foes with its status moves, if it runs them.</p>"
      },
      "Bulky Disruption": {
        "description": "<p>Rotom-A can opt for a full-on defensive set to focus on sponging hits and providing speed control or damage reduction with status. Bulky Rotom-A can drop a status move for Protect to allow for better longevity and easier positioning. Thunder Wave is often more valuable than Will-O-Wisp, as it can take fast threats such as Latios out of the game almost entirely, while the damage reduction and chip damage from Will-O-Wisp may not provide enough value in fast-paced games. Special Defense investment is required to be able to take on Latios's Draco Meteor and opposing Rotom-A's Shadow Ball, letting Rotom-A threaten super effective damage with its own Shadow Ball—physical damage reduction is more readily available through Intimidate and your own Will-O-Wisp. Sitrus Berry is standard, as the burst healing allows Rotom-A to match up better against the tier's strong attackers, although Leftovers can be used to offset sand chip damage and synergize better with Protect. While Rotom-A is able to withstand the strongest attacks in the tier, it doesn't like to take unnecessary damage because it is often a team's defensive glue, so safely bringing Rotom-A onto the field is important. Bulky Rotom-A can be used as a lead, but once the opponent realizes it is a less aggressive set, they can take advantage of Rotom-A's low unboosted damage output. Bulky Rotom-A often trades health for the chance to status a major threat, such as Choice Specs Latios, Choice Scarf Heracross, or Dragon Dance Tyranitar. Rotom-A's low base HP makes it a great user of Pain Split, allowing for another avenue to whittle down foes while increasing longevity. Both mid-tier Speed and fast offensive Pokemon appreciate the speed control Rotom-A can provide. Pokemon such as Gyarados, Heatran, and Metagross love outspeeding threats such as Latios, Latias, or opposing Rotom-A, which would otherwise apply a lot of offensive pressure. Similarly, as teammates, these same fast threats appreciate Thunder Wave slowing down common Choice Scarf users such as Heracross, as well as allowing them to win potential mirror matches.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 608134, "username": "bagel"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 192134, "username": "ryo yamada2001"}, {"user_id": 501951, "username": "zee"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}]}
  },
  "Zapdos": {
    "sets": {
      "Bulky Special Attacker": {
        "description": "<p>Zapdos is a strong and versatile bulky attacker thanks to its excellent typing, solid bulk, and valuable offensive coverage. Thunderbolt is deals consistent damage and threatens common Water-types like Suicune and Empoleon. Hidden Power Ice pairs well with Thunderbolt, notably hitting Dragon-types like Latias and Salamence, while Hidden Power Grass targets Ground-types such as Swampert and Rhyperior that are 4x weak to it. Heat Wave provides spread damage and is particularly useful for OHKOing Scizor. Roost improves Zapdos’s longevity by letting it recover health throughout the match, which is especially useful in drawn-out games. Protect allows Zapdos to shield itself from Fake Out, stall out field effects like Trick Room, and scout opposing moves while its partner deals with threats. Alternate move options such as Tailwind can support teammates with speed control; Roar can disrupt opposing setup or Trick Room attempts; and Rain Dance can be used on weather-based teams. The given EV spread allows Zapdos to outspeed positive-natured base 70s such as Metagross, survive a Choice Specs Draco Meteor from Latias, and invest the remaining EVs into Special Attack for solid offensive output. Zapdos fits well on many team archetypes, but especially values partners that can consistently handle Tyranitar, such as Hitmontop and Metagross. Since it struggles against Latias, it also pairs nicely with Tyranitar and Metagross. Zapdos reliably checks bulky Water-types, so teammates such as Swords Dance Scizor and Heatran appreciate its support as well.</p>"
      },
      "Choice Scarf": {"description": "<p>Choice Scarf Zapdos acts as a fast attacker on offensive teams, leveraging its high Speed and wide coverage to pressure a range of threats. Thunderbolt deals strong single-target damage. Heat Wave offers spread damage and lets Zapdos pressure common Steel-types such as Metagross and Scizor. Hidden Power Ice provides coverage against Dragon- and Ground-types like Latias and Rhyperior that shrug off Thunderbolt. U-turn enables Zapdos to pivot out of unfavorable matchups and maintain momentum for its team. Choice Band Scizor is a strong partner that forms a potent pivoting core with Zapdos with U-turn. Zapdos also benefits from teammates that can handle Tyranitar, such as Hitmontop. Choice Scarf Zapdos doesn't appreciate Stealth Rock, which whittles it down over time as it pivots with U-turn. If possible, prevent Stealth Rock from going up by pressuring the opponent's Stealth Rock setter or bring a lead with Taunt, like Infernape or Gengar.</p>"}
    },
    "credits": {"writtenBy": [{"user_id": 353628, "username": "ned04817"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 501951, "username": "zee"}, {"user_id": 228280, "username": "DaAwesomeDude1"}]}, {"name": "Grammar checked by", "members": [{"user_id": 593115, "username": "igiveuponaname"}]}]}
  },
  "Hitmontop": {
    "overview": "<p>Hitmontop is one of the most flexible support Pokemon in the metagame with Intimidate, the pressure it applies from Fake Out, access to numerous useful support moves, and decent offensive capabilities. However, Hitmontop lacks firepower against the metagame's many Fighting-type resistances and can be forced off the field by foes with Intimidate and its own Close Combat stat drops. While Hitmontop can patch up a team's weaknesses with its appealing role compression, it often finds itself generating little pressure against some of the tier's most common Pokemon such as Metagross and Mew.</p>",
    "comments": "<h3>Other Options</h3> <p>Hitmontop has access to numerous utility moves that can patch up a team's specific weaknesses or enable different teammates. Helping Hand makes powerful attacks such as Latias's Draco Meteor and Heatran's Heat Wave even more fearsome and difficult to switch into. Rapid Spin removes Stealth Rock from the field so that Flying-types such as Gyarados can switch in more comfortably. Hitmontop is also a capable Rain Dance setter, enabling Swift Swim users Kingdra and Ludicolo. Lastly, Hitmontop can choose to patch up its own weaknesses with Bulk Up, which it can use in the face of the Protect it often forces with Fake Out. Bulk Up negates Close Combat's Defense drop and a boosted Sucker Punch is very fearsome in the late-game.</p> <p>Hitmontop can choose to invest 64 Speed EVs to outspeed uninvested Heatran and to have a faster Fake Out against opposing uninvested Hitmontop. It is better to reduce your Attack EVs over HP EVs, as Hitmontop is somewhat frail, and its offensive capabilities are less important to its functioning.</p> <h3>Checks and Counters</h3> <p><strong>Psychic-types</strong>: Psychic-types such as Latias, Mew, and Metagross can switch into Close Combat and easily threaten to damage or KO it outright. Metagross is especially fearsome, as it doesn't have to worry about Sucker Punch damage unlike the other two.</p> <p><strong>Intimidate</strong>: Hitmontop is severely weakened by foes with Intimidate such as Gyarados and other Hitmontop that both comfortably switch into Close Combat. At -1 Attack, Close Combat will fail to OHKO Heatran and Tyranitar holding a Chople Berry, allowing them to threaten a lot of damage back. Similarly, Gyarados can effortlessly Dragon Dance on any Hitmontop without Toxic.</p>",
    "sets": {
      "Bulky Support": {
        "description": "<h4>Set Description</h4> <p>The threat of Fake Out generates turns wherein Hitmontop's partner can act freely and fire off powerful attacks without retaliation or set up moves such as Trick Room, Dragon Dance, and Substitute. Close Combat threatens Fighting-weak foes such as Tyranitar and Heatran and does significant damage to frail threats such as Raikou. Close Combat incurs stat drops after use and makes Hitmontop prone to being picked off by neutral attacks; as such, it commonly finds itself forced off the field, as it prefers to preserve its utility for late-game. Sucker Punch picks off weakened threats and chunks Latias. Detect allows Hitmontop to shield itself from powerful attacks; however, using Toxic will improve its matchup against bulky Psychic-types that want to stay on the field for multiple turns, such as Latias and Cresselia, and bulky foes that Hitmontop's other moves fails to cover like Swampert and Gyarados.</p> <p>Hitmontop is a common bulky switch-in to physical attacks or Dragon Dance users due to Intimidate, while the subsequent Fake Out pressure frees up its partner to eliminate them. As such, Hitmontop is often preserved for late-game, where its utility is even more consequential, and where it can help pick off weakened threats with Sucker Punch. Hitmontop also finds itself as a fairly common lead, because its Fake Out allows a teammate to set up Stealth Rock or Trick Room, and it threatens Tyranitar with a Close Combat; however, it struggles against other common leads such as Mew, Metagross, Rotom-H, and Pokemon with a faster Fake Out.</p> <h4>Team Options</h4> <p>Every Pokemon appreciates Hitmontop's utility, with the greatest beneficiaries being those that want to use their own utility moves to generate more pressure in the long run. Dragon Dance Tyranitar and Gyarados are threats that appreciate the setup opportunities that Hitmontop creates with Fake Out and by weakening physical attackers. Trick Room users such as Bronzong and Cresselia also enjoy Hitmontop's presence, as very few individual special attackers can punch through their bulk. It must be noted that while Hitmontop's Speed is low enough to be functional in Trick Room, it is often too weak and risks generating too little offensive pressure, especially next to the aforementioned setters. Hitmontop also finds itself as a common partner next to Substitute users such as Heatran and Metagross.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 192134, "username": "ryo yamada2001"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 230771, "username": "qsns"}, {"user_id": 501951, "username": "zee"}]}, {"name": "Grammar checked by", "members": [{"user_id": 594478, "username": "ken"}]}]}
  },
  "Dusclops": {
    "sets": {
      "Trick Room": {
        "description": "<ul> <li> <p>Dusclops is only used as a Trick Room setter for Clamperl. Dusclops is preferred over Dusknoir in this role for its lower Speed tier, allowing it to set Rain Dance under Trick Room before Clamperl attacks, thus boosting its Muddy Water, which can be further amplified with Helping Hand. Dusclops's utility is better achieved by bulkier Trick Room setters with more favorable typing, but alongside Clamperl it becomes a fearsome unevolved combination.</p> </li> <li> <p>Dusclops will often lead and set up Trick Room on the first turn and set up Rain Dance on the next while trying to bring in Clamperl safely. Rain Dance also undoes Tyranitar's sand, which leaves it less bulky and thus vulnerable to Clamperl's attacks.</p> </li> <li> <p>A Helping Hand-boosted Muddy Water in Rain leaves practically no switch-ins to Clamperl, capable of 2HKOing all but Kingdra and Ludicolo. Once the Clamperl has fainted, Dusclops can still make itself useful by using Helping Hand to boost common partner's attacks like Rhyperior's Rock Slide and Machamp's Dynamic Punch.</p> </li> <li> <p>Night Shade gives Dusclops a slight offensive presence, as it chips foes with consistent damage, beating passive foes such as Cresselia in isolation, while Shadow Sneak is used to break Focus Sash, allowing its teammates to guarantee KOs on frail threats.</p> </li> <li> <p>Mail prevents Choice item Latias and Rotom-A from using Trick, which would otherwise severely disrupt Dusclops's game plan. Those same foes may attack Dusclops expecting Mail; Sitrus Berry helps offset some of this damage and extends Dusclops's longevity in general. Lastly, Dusclops can carry a Colbur Berry to live a Crunch from Choice Band Tyranitar it otherwise can't, though this is a less consistent option than the aforementioned items.</p> </li> <li> <p>The given EV spread lives Choice Specs Rotom-A's Shadow Ball with the remainder of EVs put in Defense.</p> </li> <li> <p>Dusclops's niche synergy with Clamperl is the only reason for using it, and, as such, they should always be paired. Clamperl Trick Room is a dedicated archetype that benefits from additional Trick Room setters with Rain Dance such as Cresselia, which also has Helping Hand. Dusclops enables Trick Room attackers such as Rhyperior and Machamp, boosting their high damage output with Helping Hand. Dusclops often finds itself as a lead with Mew, which can immobilize foes with its Fake Out and Taunt while also getting to use Explosion freely because of Dusclops's Ghost typing.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 192134, "username": "ryo yamada2001"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 501951, "username": "zee"}, {"user_id": 228280, "username": "DaAwesomeDude1"}]}, {"name": "Grammar checked by", "members": [{"user_id": 594478, "username": "ken"}]}]}
  },
  "Empoleon": {
    "sets": {
      "Bulky Special Attacker": {
        "description": "<ul> <li> <p>Empoleon is a powerful special attacker that uses its bulk and resistances to take hits and trade back with Hydro Pump, which is especially fearsome once it activates Torrent. Its unique typing grants resistances to Kingdra's and Tyranitar's STAB attacks, making it a noteworthy glue Pokemon or lead on teams that need rain and Tyranitar checks. However, Empoleon's low Speed tier and reliance on Hydro Pump make it inconsistent, and its weaknesses leave it prone to common attacks such as Rotom-A and Raikou's Thunderbolt, Hitmontop's Close Combat, and Swampert's Earth Power.</p> </li> <li> <p>Hydro Pump hits most of the tier for neutral damage, which lets Empoleon chunk and 2HKO bulky foes such as Metagross and Mew while also 2HKOing Tyranitar. Once Torrent is activated, its 2HKOs will turn into near-OHKOs, and frailer and Water-weak foes such as offensive Rotom-A and Tyranitar will be OHKOed.</p> </li> <li> <p>Ice Beam 2HKOes Latios and Latias after Stealth Rock.</p> </li> <li> <p>Hidden Power Electric lets Empoleon 2HKO Gyarados, which shrugs off its other attacks. Lead Empoleon uses Stealth Rock well, chipping foes to put them in range of Hydro Pump, especially once Torrent is activated, or other attacks. Non-lead Empoleon can use Substitute to help activate its own Torrent and to block the common attacks that it is weak to. Other, less consistent options include Grass Knot to have a chance at OHKOing Swampert and Agility to overcome Empoleon's middling Speed tier.</p> </li> <li> <p>Empoleon uses a variety of resistance berries to take hits that would otherwise OHKO it, which helps activate Torrent. Shuca Berry activates Torrent after Life Orb Rhyperior's Earthquake and lets Empoleon better take Swampert's Earth Power and Choice Band Gyarados's Earthquake. Chople Berry activates Torrent after Heracross's Close Combat and may activate it after Hitmontop's Close Combat. Empoleon can also use Wacan Berry to take Thunderbolt from Rotom-A and Raikou or use Sitrus Berry to extends its longevity with disregard for Torrent.</p> </li> <li> <p>While Empoleon is an adequate switch-in to rain-boosted Water- and Dragon-type attacks, it doesn't always do a great job at returning damage. Tyranitar is a common partner that can further disrupt rain, eliminate Latios, and switches into Electric-type attacks well. Rotom-A resists or is immune to all of Empoleon's weaknesses, making them a natural combination. Empoleon appreciates speed control such as Thunder Wave Rotom-A or Thunder Wave Mew, so it can outspeed and chunk foes with its Hydro Pump.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 192134, "username": "ryo yamada2001"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 550367, "username": "Smudge"}, {"user_id": 501951, "username": "zee"}]}, {"name": "Grammar checked by", "members": [{"user_id": 594478, "username": "ken"}]}]}
  },
  "Raikou": {
    "overview": "<p>Raikou is one of the metagame's most consistent Pokemon with its phenomenal Speed tier, notable Special Attack, and nice access to strong coverage and supportive options with which it can enable its teammates. Its base 115 Speed is higher than the rest of the unboosted metagame, so Raikou commonly finds itself as a lead, as it is difficult to stop it from setting up dual screens or Rain Dance while also making it a respectable special attacker against threats like Latias. Raikou can also choose to hide in the back and boost its offensive capabilities with Calm Mind. Raikou has decent innate defensive stats but rarely runs investment so it can maximize its attacking prowess instead. As such, while Raikou is only weak to Ground-type attacks, it is often worn down by powerful neutral hits.</p>",
    "sets": {
      "Dual Screens": {
        "description": "<h4>Set Description</h4> <p>Raikou utilizes its immense base 115 Speed as a lead that can outspeed, threaten, and set up a screen of its choosing against the common lead metagame. Raikou will set up Reflect against physical leads such as Tyranitar and Metagross or Light Screen against special attackers like Latias and Rotom-H. Dual screens allow Raikou's offensively oriented teammates to switch in more comfortably and threaten significant damage in return while also enabling the likes of Dragon Dance Tyranitar and Calm Mind Latias to use their setup moves easier. Light Clay extends screens to last for 8 turns, which often accounts for the majority of turns in this fast-paced metagame. Raikou isn't a great beneficiary of its own dual screens, so it prefers making way for its teammates by switching out or being KOed at an opportune moment.</p> <p>Thunderbolt does solid neutral damage against a majority of the metagame, needing only minimal chip to 2HKO 252 HP Metagross, 252 HP Hitmontop, and uninvested Heracross. Shadow Ball notably hits Latias while also being better against Mew, as Thunderbolt risks paralyzing itself through Mew's Synchronize.</p>"
      },
      "Rain Dance": {
        "description": "<h4>Set Description</h4> <p>Raikou is an excellent Rain Dance user because its innately high Speed makes it difficult to stop from setting up, and its offensive capabilities means it benefits from rain's conditions with Thunder. Thunder's increased accuracy in rain makes for a significant powerup, as Raikou becomes able to 2HKO nearly all of the unresisted metagame with Life Orb. A Life Orb-boosted Shadow Ball also 2HKOes Latias and comes close to 2HKOing Latias, both of which resist Thunder.</p> <p>Raikou can forgo Life Orb's power boost to use Damp Rock instead, which better benefits its Swift Swim teammates. While this item is generally less powerful given Tyranitar's omnipresence, it still has merits once Tyranitar is eliminated. The more offensive Life Orb set prefers Protect in its last slot so it can stay on the field to maximize its Thunder use, while the Damp Rock set intends on supporting its teammates with weather control and speed control through Thunder Wave or defense with Light Screen.</p>"
      },
      "Calm Mind": {
        "description": "<h4>Set Description</h4> <p>Unlike other Raikou sets, Calm Mind prefers coming in mid- or late-game to set up a timely Calm Mind and sweep its foes once its common checks are eliminated. Raikou is faster than all of the unboosted metagame and has good special bulk, so it can set up a Calm Mind to reduce incoming damage from common special attackers like Mew, Rotom-A, and Latias after it has used Draco Meteor while threatening a 2HKO back. This set prefers to use Leftovers, as it intends to stay on the field with its Calm Mind boosts for extended periods; however, it can also use Sitrus Berry for immediate recovery, or Lum Berry for a one-time insurance against Thunder Wave.</p> <h4>Team Options</h4> <p>The biggest beneficiaries of dual screens are bulky attackers such as Metagross, Gyarados, and Rotom-A, as they can stay on the field for longer and trade more favorably as incoming damage is reduced. Pokemon with many weaknesses, like Tyranitar and Heatran, and ones prone to being worn down to heavy neutral damage hits, like Kingdra, maneuver more comfortably behind dual screens as well. Lastly, setup attackers such as Dragon Dance Tyranitar, Swords Dance Mew, and Calm Mind Latias get more opportunities to use their setup moves behind screens.</p> <p>Rain Dance is appreciated most by Swift Swim users such as Kingdra and Ludicolo, which are both capable of dealing heavy damage to the Ground-types that would otherwise beat Raikou.</p> <h4>Checks and Counters</h4> <p><strong>Ground-types:</strong> Common Ground-types such as Swampert and Gliscor can switch into Electric-type attacks and threaten significant damage back with their own Earth Power and Earthquake, respectively. Raikou is also prone to other common Ground-type coverage such as Metagross's or Tyranitar's Earthquake and Mew's Earth Power.</p> <p><strong>Tyranitar:</strong> Tyranitar comfortably switches into Raikou's attacks and threatens to either return major damage or set up a Dragon Dance. Whenever it switches in, it will also remove the ongoing effects of rain with Sand Stream.</p> <p><strong>Powerful physical attackers:</strong> Raikou's mediocre physical defense leaves it vulnerable to common powerful physical attackers such as Tyranitar, Hitmontop, and Heracross. Many of the metagame's physical attackers run Ground-type coverage as well.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 192134, "username": "ryo yamada2001"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 501951, "username": "zee"}, {"user_id": 550367, "username": "Smudge"}]}, {"name": "Grammar checked by", "members": [{"user_id": 594478, "username": "ken"}]}]}
  },
  "Suicune": {
    "sets": {
      "Calm Mind": {
        "description": "<ul> <li> <p>Suicune is a fringe sweeper that uses its bulk and favorable matchups against rain and weak special attackers to clean late-game once it has set up Calm Mind. However, Suicune doesn't offer great utility or offensive pressure compared to Water-types like Gyarados and Swampert, has a middling Speed tier, and is susceptible to a plethora of powerful physical attacks, notably Explosion. Suicune excels in a few matchups, but its shortcomings hold it back from significance.</p> </li> <li> <p>Hydro Pump hits most of the metagame for neutral or super effective damage, though its damage is underwhelming without Calm Mind boosts; Suicune needs to be at +1 to OHKO Heatran, and even at +2, it doesn't always OHKO Tyranitar. Ice Beam is Suicune's best way of hitting Latias.</p> </li> <li> <p>Suicune sets up Calm Mind against special attackers that pose little to no threat to it, such as Latias after Draco Meteor, Empoleon, Mew, and Cresselia. It prefers to not be revealed for as long as possible so its teammates can eliminate checks that would deter it from setting up and sweeping late-game.</p> </li> <li> <p>Leftovers is Suicune's only form of consistent recovery, pairing well with its tendency to stay on the field for many subsequent turns to preserve its Calm Mind boosts.</p> </li> <li> <p>The given EV spread lets Suicune take an Explosion from maximum Attack Metagross and a Thunderbolt from Choice Specs Rotom-A.</p> </li> <li> <p>Other fringe options include Icy Wind, which lets Suicune mitigate its own middling speed tier at the cost of dealing less damage to Latias, and Substitute, which drops Ice-type coverage entirely in favor of blocking Thunder Wave and Toxic, defending Suicune from Explosion, and generally making it harder to remove.</p> </li> <li> <p>As Suicune invests significantly in Special Defense, its biggest checks are strong physical attackers. Thus, Intimidate users such as Salamence and Hitmontop effectively increase Suicune's bulk by weakening foes. Suicune requires speed control to be effective, so partners with Thunder Wave, such as Zapdos and Gyarados, slow down foes for Suicune to pick off. Rhyperior's offensive coverage and ability Lightning Rod match up well against the Electric-types that otherwise pose a threat against Suicune. Teammates with immediate offensive pressure such as Choice Specs Latias make up for Suicune's middling damage output, making it a fearsome setup threat instead.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 192134, "username": "ryo yamada2001"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 230771, "username": "qsns"}, {"user_id": 501951, "username": "zee"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "Lumari"}, {"user_id": 558636, "username": "zastra"}]}]}
  },
  "Cresselia": {
    "sets": {
      "Utility": {
        "description": "<ul> <li> <p>Cresselia solidifies itself as one of the best support Pokemon in the metagame thanks to its wide movepool and monstrous bulk. Even the likes of Choice Band Tyranitar fail to OHKO it, which is a testament to its durability with which it can use vital support moves such as Thunder Wave and Trick Room. Cresselia is very reliant on its partners to make up for its own poor offensive presence, but Helping Hand makes up for this by boosting its partners.</p> </li> <li> <p>Psychic significantly hits Fighting-types like Infernape and Hitmontop, which is useful when Cresselia is commonly paired with Fighting-weak Pokemon like Tyranitar, Rhyperior, and Heatran.</p> </li> <li> <p>Thunder Wave is Cresselia's most reliable form of speed control, allowing slow Pokemon like Tyranitar and Swampert to outspeed Choice Scarf Latias.</p> </li> <li> <p>Helping Hand allows Cresselia to make up for its middling offensive pressure by allowing powerful attackers like Metagross and Choice Specs Latias to KO bulky Tyranitar and chipped Cresselia. Spread move users like Heatran, Rhyperior, and Swampert also greatly appreciate the boost in order to do as much damage to opponents as quickly as possible.</p> </li> <li> <p>Trick Room enables slow, bulky attackers such as Tyranitar, Rhyperior, and Metagross, as it turns their low speed into an advantage against the tier's faster threats, especially with Cresselia's Helping Hand support. Icy Wind can be used on faster teams, where it is advantageous to slow down Choice Scarf users like Rotom-A and Latias as well as other fast attackers like Raikou and Infernape.</p> </li> <li> <p>Cresselia can fit a variety of other options such as dual screens to enable teammates to setup, Toxic to wear down other bulky foes, and Safeguard to help shield it and its teammates from opposing Thunder Wave.</p> </li> <li> <p>The HP and Defense investment along with a Defense boosting nature and Sitrus Berry allow Cresselia to take Adamant Tyranitar's Crunch and a round of sandstorm damage twice. The remaining EVs are dumped into Special Defense to better withstand the likes of Draco Meteor from Latias and Shadow Ball from Rotom-A.</p> </li> <li> <p>Cresselia appreciates support from Fighting- and Steel-types, like Hitmontop, Infernape, and Metagross, that can OHKO Tyranitar, as it is one of Cresselia's worst matchups. Incidentally, Tyranitar pairs well with Cresselia, as it threatens Rotom-A and can go on a tear with Cresselia's Trick Room and Helping Hand support. Heatran and Infernape, along with other Fire-type coverage like Rotom-H's Overheat, are also useful for blasting Steel-types like Metagross, Bronzong, and Scizor, as Cresselia can't touch them. Cresselia works well early-game to spread Thunder Wave and great late-game to secure a vital Trick Room going up, but it should be especially careful of Trick from Choice Item Latias and Rotom-A if used as a lead.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 501951, "username": "zee"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 230771, "username": "qsns"}, {"user_id": 192134, "username": "ryo yamada2001"}]}, {"name": "Grammar checked by", "members": [{"user_id": 594478, "username": "ken"}]}]}
  },
  "Machamp": {
    "sets": {
      "Physical Attacker": {
        "description": "<ul> <li>Machamp will mostly be using Dynamic Punch, as No Guard makes it perfectly accurate. Dynamic Punch is one of the metagame's most powerful attacks, effortlessly OHKOing all Pokemon weak to Fighting and any frailer non-resistant Pokemon such as Raikou and Kingdra. Even Fighting resistances such as Heracross and bulky threats such as Metagross and Jirachi risk being 2HKOed. Furthermore, thanks to Dynamic Punch's confusion, Machamp sometimes generates free turns where it would otherwise be threatened.</li> <li>Payback hits Psychic- and Ghost-types that resist or are immune to Dynamic Punch. However, that leaves it vulnerable to powerful Psychics from Latias and Mew. Payback's power also doubles if the foe switches out, meaning Machamp can call out switches to common immunities such as Rotom-A and OHKO them.</li> <li>Ice Punch OHKOes Salamence and 2HKOes Latias, making it a more consistent option against them than Payback.</li> <li>Bullet Punch can cleanup late-game or pick up KOs on foes that have survived on a sliver of health. It is usually unfavorable for Machamp to lock into, so it is best used when Machamp can guarantee picking up KOs with it.</li> <li>With a little chip, Machamp OHKOes uninvested Gyarados with Stone Edge after Intimidate; Stone Edge also 2HKOes bulkier Togekiss variants. Otherwise, Earthquake can be used for spread damage, as it is often just as powerful against Pokemon weak to Ground as a neutral hit from Dynamic Punch is.</li> <li>Choice Band Machamp is one of the metagame's most powerful yet vulnerable attackers, as its poor Speed tier, middling bulk, and underwhelming typing leaves it prone to powerful neutral attacks wearing it down. Machamp performs better with speed control partners such as Thunder Wave Jirachi or Trick Room Cresselia and Bronzong.</li> <li>Life Orb and Sitrus Berry are less powerful items but grant more maneuverability and survivability outside of Trick Room as well, as it can run Protect in its last slot.</li> <li>With Thunder Wave support, Machamp can run an Adamant nature. As a dedicated Trick Room attacker, it does better to minimize its Speed with a Brave nature.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 192134, "username": "ryo yamada2001"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 501951, "username": "zee"}, {"user_id": 550367, "username": "Smudge"}]}, {"name": "Grammar checked by", "members": [{"user_id": 594478, "username": "ken"}]}]}
  },
  "Mew": {
    "sets": {
      "Lead": {
        "description": "<ul> <li> <p>Mew's good bulk, solid damage output, great ability, and unrivaled flexibility make it one of the standout leads in the metagame. Fake Out applies immediate pressure, creating opportunities for partners to set up and dish out damage uncontested or giving a Pokemon in the back a free switch. Mew is able to outspeed and use Fake Out before opposing Hitmontop, the other common Fake Out user in the tier. Psychic 2HKOes Fighting-types such as Hitmontop and Heracross. Earth Power complements it by hitting common Psychic-resistant foes such as Metagross and Heatran for super effective damage. Explosion offers burst damage rivaled only by other Explosion users and can potentially knock out both foes, although there is the risk of hitting into Protect or Ghost-types such as Rotom-A.</p> </li> <li> <p>Mew's last move is traditionally an option that covers up a team's specific weakness. Taunt stops Trick Room setters such as Bronzong or Cresselia and status moves from Rotom-A and opposing Mew. Thunder Wave is an option to cripple fast threats such as Latias. Stealth Rock is an option to punish switches, particularly on Rock-weak Pokemon such as Gyarados.</p> </li> <li> <p>Mew has such a vast movepool, so a variety of alternative moves are also viable. Superpower can be used to 2HKO Tyranitar and U-turn allows Mew to act as a pivot and generate momentum. Will-O-Wisp cripples physical attackers such as Metagross and Trick Room offers alternative speed control.</p> </li> <li> <p>Sitrus Berry is the most common item on Fake Out Mew, as the burst healing complements its good bulk. Lum Berry lets Mew use Thunder Wave against opposing Mew without paralyzing itself because of Synchronize and better absorb opposing status while, Life Orb gives Mew a greater offensive presence.</p> </li> <li> <p>Maximizing its Special Attack and Speed with a Timid Nature allow mew to make the most of its offensive capabilities, but it can forego special attack investment to run 252 HP to survive more hits instead.</p> </li> <li> <p>Mew is most commonly seen as a lead, leveraging its utility and flexibility to create a better board position for its team. Fast teams love Taunt Mew as a fail-safe against Trick Room teams, while Thunder Wave Mew make faster threats such as Latias more manageable. Mew trades well into most of the tier, so often it prefers to stay in and attack after its utility support is no longer needed, even sacrificing itself to give teammates a free switch. While Mew is flexible, it can't run everything it wants to in every game, which give opponents the ability to exploit Mew's lack of coverage once its set has been revealed.</p> </li> <li> <p>On lead, heavy-hitting partners such as Latias, Metagross, and Choice Specs Rotom-A all love the free turn provided by Mew's Fake Out in order to dish out damage uncontested. Metagross makes a great partner by threatening Tyranitar for Mew while benefiting from Mew's speed control in Thunder Wave. Tyranitar also makes for a good partner as one of the best answers to Rotom-A and Latias. Choice Scarf Tyranitar can trap Rotom-A and Latias with Pursuit or OHKO them with Crunch, which otherwise threaten to KO Mew or cripple it by giving it a Choice item with Trick. Alternatively, Dragon Dance Tyranitar can start setting up relatively uncontested on Rotom-A and Latias. Other partners such as Raikou appreciate the free turn from Mew's Fake Out to set up dual screens or Rain Dance.</p> </li> </ul>"
      },
      "Swords Dance": {
        "description": "<ul> <li> <p>Swords Dance Mew aims to take advantage of traditional counterplay to Fake Out Mew such as Latias, Rotom-A, and Tyranitar by setting up and sweeping with strong priority in Sucker Punch and spread damage in Earthquake. Sucker Punch lets Mew handle faster threats such as Latias and Ground immune foes such as Rotom-A, while Earthquake spreads big damage, threatening 2HKOs on common Pokémon such as Tyranitar and Metagross after a Swords Dance boost. Protect keeps Mew safe from opposing attacks, while Explosion offers unrivaled damage that can allow Mew to break through nearly any foe, particularly if boosted from Swords Dance. Soft-Boiled is an option to improve Mew's longevity, but it is riskier than Protect, as Mew isn't able to avoid Fake Out from the opponent. Synchronize is a great ability for Swords Dance Mew, as it dissuades opponents from attempting to cripple it with status moves such as Thunder Wave.</p> </li> <li> <p>Lum Berry lets Mew absorb status more easily, freeing it up to take an extra turn to set up in front of Pokemon such as bulky Gyarados and support Raikou. Alternatively Sitrus Berry can be used if burst healing is preferred over absorbing a Thunder Wave, allowing Mew to live a crucial extra turn.</p> </li> <li> <p>It is hard to distinguish Mew sets from lead, and as such, it can aggressively use Swords Dance to punish plays such as using Protect or switching out that are common against utility Mew. It is important to set up Swords Dance quickly, as Mew lacks offensive presence without this boost and Intimidate from Hitmontop and Gyarados cripples its damage output.</p> </li> <li> <p>Rotom-A is a great partner as it threatens Earthquake-immune Pokemon that aren't weak to Sucker Punch such as Gyarados and Togekiss while also being immune to Earthquake itself. Tyranitar also threatens super effective damage on these Pokemon, but it has to be more careful about taking hits from Gyarados. Swords Dance Mew appreciates the free turns generated by Fake Out support from Hitmontop. Intimidate users such as Gyarados and Hitmontop can slow Mew down, so strong special attackers such as Latias that can ignore the Attack drop and deal damage while Mew sets up make for good teammates.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 608134, "username": "bagel"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 192134, "username": "ryo yamada2001"}, {"user_id": 501951, "username": "zee"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Scizor": {
    "sets": {
      "Swords Dance": {
        "description": "<ul> <li>Swords Dance Scizor makes for a threatening setup sweeper with its unique defensive typing and powerful STAB priority move in Bullet Punch. Compared to its Steel-type peer Metagross, Scizor is slightly more frail and susceptible to Intimidate, but it has greater sweeping potential with Swords Dance.</li> <li>Bug Bite hits common Psychic-types like Mew and Latias while benefiting from Technician, whereas Superpower can catch Steel-types off guard and secure the mirror match.</li> <li>Metal Coat guarantees that Bullet Punch will OHKO uninvested Latias at +2 after Stealth Rock. Alternatively, Leftovers gives Scizor added longevity to act as a wincon at the cost of power.</li> <li>A simple EV spread of 248 HP / 252 Atk / 8 Spe allows Scizor to deal maximum damage and absorb strong hits. It should be noted that most Scizor will run an arbitrary number of Speed EVs to outspeed opposing Scizor, especially if you choose to run Superpower to win the mirror match. Every EV allocated to Speed makes Scizor frailer, so be conscious of how much bulk you're willing to sacrifice.</li> <li>Swords Dance Scizor is best used as a late-game wincon after the opponent's team has been weakened. It should be brought in against favorable Pokemon to set up Swords Dance and then sweep with Bullet Punch.</li> <li>Scizor benefits from Fake Out users like Mew and Infernape as well as Follow Me users like Clefable to provide safe setup opportunities. It also needs partners that can eliminate Fire-types, namely Heatran, so Water-types such as Suicune and Swampert pair well with it. Stealth Rock from Tyranitar and Infernape also helps put foes in range of boosted Bullet Punch.</li> </ul>"
      },
      "Choice Band": {
        "description": "<ul> <li>Choice Band Scizor operates as a bulky pivot and priority attacker that constantly exerts pressure on the opponent's team, either threatening KOs or bringing in allies to maintain the onslaught.</li> <li>Scizor's U-turn is quite powerful in itself but also has the benefit of safely bringing in an ally due to the fact that it often moves last with its low Speed.</li> <li>Bullet Punch picks off weakened foes, while Superpower rounds out Scizor's coverage, hitting Steel-types.</li> <li>Pursuit is useful for trapping Latias, which often prefers to switch out fearing a KO.</li> <li>Choice Band Scizor should be played aggressively, brought in to threaten KOs, pivot, and relentlessly beat down the opponent's team.</li> <li>Other U-turn users like Choice Scarf Zapdos and Azelf make a dangerous pivot core with Scizor. It also appreciates Stealth Rock support from Infernape or Mew to weaken foes switching in and out and bring them into Bullet Punch range. Finally, allies like Hitmontop and Kangaskhan can utilize priority moves alongside Scizor and eliminate faster, frailer threats such as Raikou and Kingdra.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 353628, "username": "ned04817"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 501951, "username": "zee"}, {"user_id": 228280, "username": "DaAwesomeDude1"}]}, {"name": "Grammar checked by", "members": [{"user_id": 391343, "username": "EthanLac"}, {"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Kingdra": {
    "sets": {
      "Rain Sweeper": {
        "description": "<ul> <li> <p>In rain, Kingdra is capable of wiping unprepared teams with powerful rain-boosted Muddy Water. Kingdra stands out for its Dragon-typing, which makes Draco Meteor a powerful secondary STAB attack that nukes the Water-resistant Latias and Salamence while doing neutral damage to other rain checks. Its typing leaves Kingdra weak only to opposing Dragon-type attacks, often making it hard to OHKO Kingdra despite its mediocre bulk. Kingdra only succeeds with dedicated rain support, as outside of rain it is too frail, too weak, and too slow to exploit the lack of viable Water resistances in the tier.</p> </li> <li> <p>A rain-boosted Muddy Water is capable of 2HKOing most of the unresisted metagame, picking up 2HKOs on bulky foes such as Rotom-H, Mew, and Metagross. Kingdra is hard to switch into, and Muddy Water's chance of causing accuracy drops reduces counterplay even more, but Muddy Water's own accuracy will sometimes cause key misses, which foes can take advantage of.</p> </li> <li> <p>Draco Meteor is a secondary STAB attack with which Kingdra can nuke common Water-resistant foes such as Latias and Salamence and 2HKO the likes of Gyarados. It's also useful for nearly OHKOing the tier's frailer foes such as Raikou and Heracross and remains a powerful option outside of rain also. The Special Attack drop incurred by Draco Meteor often forces Kingdra off the field, as all of its attacks are significantly less threatening at -2, which can sap momentum from these rain teams that only get limited turns of rain to work with.</p> </li> <li> <p>As there is no permanent rain setter in the tier and Tyranitar's Sand Stream is highly disruptive, Kingdra can run Rain Dance to sustain itself and other Swift Swim teammates with additional turns to work with. Kingdra is not the best rain setter, as it is rather frail, so if a team has sufficient ways of setting up rain, Kingdra can also use Hydro Pump for a single-target Water-type nuke that outright OHKOes Rotom-H, Metagross, and Hitmontop and 2HKOes Mew, Swampert, and Cresselia in rain.</p> </li> <li> <p>Kingdra requires dedicated rain support to be a threatening sweeper. Fast Rain Dance users such as Gengar and Raikou synergize particularly well, as the former is immune to Fake Out, so it sets up easier, and the latter can Thunder Water-types such as Gyarados and Empoleon. Hitmontop is another capable rain setter with its own Fake Out support. As rain teams are a dedicated archetype, it pays to have an additional Swift Swim user such as Ludicolo on the team, which also has Fake Out to create setup opportunities for the Rain Dance users. Tyranitar is a particular nuisance to rain teams, so Steel- or Fighting-types that can switch in and threaten significant damage, such as Jirachi or Hitmontop, do well to check it. Kingdra also works with additional fast, powerful hitters such as Latias or Choice Scarf Heracross, as their respective STAB attacks can overwhelm teams with their sheer offensive pressure and clean up opposing teams once Kingdra has done its damage.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 192134, "username": "ryo yamada2001"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 230771, "username": "qsns"}, {"user_id": 228280, "username": "DaAwesomeDude1"}]}, {"name": "Grammar checked by", "members": [{"user_id": 594478, "username": "ken"}]}]}
  },
  "Tyranitar": {
    "overview": "<p>Tyranitar is among the metagame's most versatile Pokemon, as it can fulfill a plethora of roles with its bulk, power, versatile movepool, and unique ability to set permanent weather. Sand Stream is the only viable permanent weather setting ability in the metagame, effectively granting Tyranitar an oft uncontested and significant Special Defense boost that allows it to switch into common special attackers such as Latias and Raikou even without investment while also dealing consistent sand damage and disrupting rain teams. Tyranitar matches up well against the common lead metagame, as bulky Tyranitar can easily set up Stealth Rock against the likes of Mew and Rotom-H, while a Choice Scarf set Pursuit traps them, but its offensive capabilites and typing also make it a great wallbreaker, setup sweeper, and late-game cleaner. While Tyranitar boasts many favorable matchups, it must remain wary of its common weaknesses against Steel-types and Fighting-types, as the likes of Metagross and Hitmontop resist Tyranitar's STAB attacks and OHKO it back. Tyranitar is also prone to Intimidate, which significantly hampers its ability to trade favorably or become a fearsome Dragon Dance sweeper.</p>",
    "comments": "<h3>Other Options</h3> <p>Earthquake hits Metagross and Heatran super effectively, but Tyranitar needs Choice Band to OHKO them. It is awkward for Tyranitar to lock into as it does little damage to neutral targets, is easily exploited by the plethora of common Flying-types and Levitate users, and requires pivoting its teammates so as not to take damage. A bulky Tyranitar with Chople Berry can use Counter to OHKO a Hitmontop using Close Combat against it. This is a rather inconsistent strategy that requires Intimidate support, as even a little chip damage leaves it prone to being OHKOed.</p> <p>Tyranitar can use specific resistance berries to improve specific matchups and surprisingly live hits: Passho Berry allows Tyranitar to live a Choice Band Gyarados's Waterfall and return an OHKO with Stone Edge, and Babiri Berry Tyranitar lives a Choice Band Metagross's Meteor Mash so Tyranitar can take a chunk out of it with its own Earthquake. Alternatively, Tyranitar can set up a Dragon Dance in these situations.</p> <h3>Checks and Counters</h3> <p><strong>Fighting-types</strong>: Fighting-types such as Hitmontop, Heracross, and Machamp resist both of Tyranitar's STAB attacks and can easily OHKO non-Chople Berry variants.</p> <p><strong>Steel-types</strong>: Steel-types such as Metagross, Bronzong, and Empoleon resist Tyranitar's Rock-type attacks while their high physical defense allows them to take Crunch from non-Choice Band Tyranitar as well.</p> <p><strong>Ground-types</strong>: Tyranitar struggles to break physically bulky Ground-types such as Swampert and Rhyperior, which can return super effective damage with their own Ground-type attacks.</p> <p><strong>Water-types and Rain</strong>: Choice Band Gyarados Intimidates Tyranitar and OHKOes it with Waterfall. Sand Stream makes Tyranitar a contingency check against rain, but non-bulky variants are easily 2HKOed by Kingdra and Clamperl.</p> <p><strong>Intimidate</strong>: Common Intimidate users such as Hitmontop and Gyarados deal super effective damage and hamper Tyranitar's ability to trade favorably or easily set up its Dragon Dance win condition.</p>",
    "sets": {
      "Choice Attacker": {
        "description": "<h4>Set Description</h4> <p>Tyranitar looks to eliminate common glue Pokemon such as Mew and Rotom-H in early- to mid-game, stopping them from threatening their utility throughout games, making it easier for Tyranitar's teammates to clean up late-game. Choice Scarf Tyranitar is especially adept at trapping Latias and other fast special attackers but misses out on several OHKOs, while Choice Band Tyranitar relinquishes Speed in favor of this greater wallbreaking prowess, capable of punching holes through foes so its teammates can clean up. Choice Scarf Tyranitar also functions as a fearsome late-game sweeper once its checks are eliminated, as there are very few foes that can either outspeed or comfortably take a hit and eliminate it besides Metagross, Fighting-types, and Swampert.</p> <p>Crunch OHKOes Latias and bulkless Rotom-H, and Choice Band gives Tyranitar the power to OHKO Latias and 252 HP Mew after sand damage. Choice Scarf Tyranitar can trap common leads such as Mew and Rotom-H with Pursuit, punishing them for their inability to significantly threaten Tyranitar. Tyranitar with Pursuit is also a formidable revenge killer, as it can trap Latias after Draco Meteor, Rotom-H after Overheat, and support-oriented Mew sets, as weakened special attackers pose little to no threat to Tyranitar in sand. Pursuit's power being conditional means locking into it leaves Tyranitar prone to bulky foes such as Metagross and Machamp, threatening to OHKO it, or setup attackers like Gyarados, which may Dragon Dance freely. Stone Edge is the more powerful STAB attack against neutral targets and Flying-types, dealing significant damage to Raikou, Gyarados, and Togekiss. The latter two are OHKOed by Choice Band Stone Edge, while Raikou is taken down by the Stone Edge and the additional sand damage. Rock Slide is a powerful alternative attack for its strong spread damage and, especially with a Choice Scarf, the added benefit of possible flinching. Tyranitar's last moveslot is Fighting-type coverage to hit the Steel-types that resist its STAB attacks. Superpower is more consistent, because it maximizes damage on Empoleon and Hitmontop at the cost of stat drops, but Low Kick hits most common targets such as Tyranitar, Mamoswine, Heatran, and Rhyperior for just as much damage.</p>"
      },
      "Dragon Dance": {
        "description": "<h4>Set Description</h4> <p>Dragon Dance Tyranitar uses its innate bulk to punish common special attackers like Latias, Rotom-H, and Mew by setting up on them and breaking teams with powerful STAB attacks or sweeping late-game once its checks are removed. With a Dragon Dance boost, Tyranitar outspeeds and OHKOes Latias and Mew with Crunch and deals devastating spread damage and potential flinches with Rock Slide. It is especially important to get this boost when using Rock Slide, as without it, it will fail to OHKO bulkless Gyarados and risk not breaking Heatran's Substitute. Tyranitar can opt for Stone Edge, which does all of those things and is especially difficult to switch into at +1 for nearly all neutral targets, OHKOing Raikou and Heatran after Stealth Rock, but carries with it a great risk of missing. Lum Berry gives Tyranitar a one-time safeguard against status moves that would otherwise significantly hamper its sweeping abilities. Tyranitar can also use resistance berries to improve specific matchups, such as Chople Berry against Fighting-types like Hitmontop or Babiri Berry against Metagross; however, these are highly conditional and Tyranitar may still be KOed if it isn't at full health.</p> <p>This set is particularly effective at preying on special attackers and passive foes like Cresselia, while offering the power boost of Choice item sets and retaining flexibility, though at the cost of having to find setup opportunities. Tyranitar isn't very threatening before a Dragon Dance boost and can be hampered by common counterplay such as Hitmontop's Intimidate, Metagross's bulk and Meteor Mash, and faster attackers such as Heracross.</p>"
      },
      "Bulky Lead": {
        "description": "<h4>Set Description</h4> <p>Tyranitar's tremendous stats, immense Special Defense in sand, unique typing, and wide movepool allows it to function as a powerful bulky lead that matches up well against common lead Pokemon such as Mew and Rotom-H. Its bulk investment allows it to shrug off special attackers and weak hitters even better than offensively-oriented Tyranitar sets, which allows it to trade better and thus grant more opportunities to set up Stealth Rock. Stealth Rock, in combination with sand damage, wears down foes without access to consistent recovery options, and bulky Tyranitar forces many switches against common special attackers such as Mew, Raikou, and Rotom-H, which can't threaten it. Boasting significant attack, Tyranitar will significantly damage Dark-weak foes such as Latias and Rotom-H with Crunch and maims foes with the weaker Rock Slide. It can also run Stone Edge, as this will OHKO even bulky Gyarados and guarantee breaking Heatran's Substitute. Its last moveslot can be Superpower to punch through its common STAB resistances such as Heatran and Empoleon, but Pursuit can be used to more effectively trap common Dark-weak leads.</p> <p>While Tyranitar is very bulky, it is slow and must fear many common physical attackers such as Gyarados and Metagross and Fighting-types such as Heracross and Hitmontop. Chople Berry offsets these immediate threats, but it is still important to pair Tyranitar with an Intimidate user. Hitmontop makes for an especially good pairing, as it can Fake Out opposing leads that Tyranitar matches up poorly against, such as Metagross and Bronzong. Alternatively, Sitrus Berry restores health to extend Tyranitar's trading opportunities.</p> <h4>Team Options</h4> <p>Hitmontop is an excellent partner for Tyranitar, as its Fake Out creates opportunities for Tyranitar to set up Dragon Dance or Stealth Rock when used as a lead pair. Its Close Combat hits Steel-types such as Heatran and Empoleon, which Tyranitar's coverage misses out on, while also scaring off opposing Tyranitar with Intimidate and the threat of OHKOing it. Another Fake Out user that works well with Tyranitar is Mew, especially as it can whittle down Steel-types with Earth Power. Gyarados, especially with a Choice Band, is another excellent partner because of its Intimidate and ability to hit bulky Steel- and Ground-types such as Metagross, Bronzong, and Swampert with its own powerful Waterfall. Fire-types like Infernape and Heatran can also eliminate these Steel-types that Tyranitar commonly struggles with, and Rotom-H uses Overheat while being able to switch into the Fighting-type attacks that Tyranitar often draws to itself. Conversely, Metagross can check Fighting-type threats such as Heracross and Hitmontop with its own Zen Headbutt. Other Psychic-types such as Latias and Latias will also check these Fighting-types with their Psychic, with Choice Scarf Latias outspeeding Choice Scarf Heracross in particular. Raikou is a great partner for offensively-oriented Tyranitar sets, as it sets up dual screens to amplify Tyranitar's innate bulk more so, and it can cripple Swift Swim users with Thunder Wave and eliminate Gyarados with Thunderbolt.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 192134, "username": "ryo yamada2001"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 501951, "username": "zee"}, {"user_id": 228280, "username": "DaAwesomeDude1"}]}, {"name": "Grammar checked by", "members": [{"user_id": 594478, "username": "ken"}]}]}
  },
  "Hariyama": {
    "sets": {
      "Bulky Support": {
        "description": "<ul> <li>Hariyama is a niche choice for hard Trick Room teams. It faces stiff competition from Hitmontop, which serves a similar role with Fake Out support but has a better ability in Intimidate. Hariyama's distinguishing factor is its massive bulk and power, allowing it to shrug off big hits and retaliate with powerful Guts-boosted attacks.</li> <li>Fake Out disrupts opposing Pokemon and gives Hariyama's partner the opportunity to safely set Trick Room.</li> <li>Close Combat is Hariyama's primary attacking move that does significant neutral damage and OHKOes common threats such as Tyranitar and Heatran.</li> <li>Ice Punch rounds out Hariyama's coverage, hitting the Flying-types that resist Close Combat and 2HKOing the omnipresent Latias.</li> <li>Alternatively, Payback punishes Ghost- and Psychic-types such as Rotom-A, Gengar, and Mew, and it does sizeable damage outside of Trick Room with its double-Base Power bonus.</li> <li>Detect gives Hariyama the ability to stall for a turn while Flame Orb activates, protect itself from double targets, and scout for foes' movesets without risking a KO, especially when Trick Room has yet to be set up.</li> <li>Feint is an alternative to bypass opposing Pokemon using Protect, a common tactic for stalling out Trick Room. It also allows allies such as Bronzong to safely use Explosion without the fear of wasting the attack.</li> <li>The Defense and Special Defense investment minimize the chance that Hariyama is KOed by Bronzong's Explosion or Choice Specs Latias's Draco Meteor.</li> <li>Hariyama belongs exclusively on hard Trick Room teams, which benefit from its unique stat spread but also support its low Speed.</li> <li>Hariyama's natural teammates include Trick Room setters such as Bronzong and Cresselia. It also pairs well with powerful spread attackers such as Eruption Heatran and Rhyperior, which appreciate Feint to break Protect.</li> <li>Hariyama can work well as both a lead and as late-game support to set a final Trick Room. Although it makes a decent switch-in due to its bulk, be cognizant of Flame Orb damage, which can rack up quickly in combination with other field conditions such as sand and hail. Guts also allows Hariyama to absorb Will-O-Wisp from the likes of Rotom-A and Gengar, a key factor that sets it apart from Hitmontop.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 353628, "username": "ned04817"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 550367, "username": "Smudge"}, {"user_id": 501951, "username": "zee"}]}, {"name": "Grammar checked by", "members": [{"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Clamperl": {
    "overview": "<p>Clamperl may seem pitiful, but its signature item Deep Sea Tooth doubles its Special Attack and makes it a fearsome attacker with Trick Room support. Clamperl exploits the tier's lack of common Water-resistant foes and can sweep through unprepared teams with its powerful Muddy Water, especially in rain. However, none of Clamperl's other stats get boosted, which makes it the slowest viable Pokemon in the tier and threatened by nearly any attacker. Clamperl is powerful, but its frailty and chance to miss Muddy Water make it an inconsistent performer.</p>",
    "comments": "<h3>Other Options</h3> <p>Clamperl can drop a coverage option for Brine, which can eliminate low-HP foes without risking a Muddy Water miss. Clamperl can also run Hidden Power Grass to OHKO Swampert; however, as it already takes significant damage from Muddy Water, it is more important to cover the Gyarados and Empoleon matchups.</p> <h3>Checks and Counters</h3> <p><strong>Water-resistant foes</strong>: Common Water-resistant foes such as Latias, Salamence, and Shaymin all threaten to OHKO Clamperl with their powerful STAB attacks. While Clamperl can deal a lot of damage with Ice Beam, this means that it's not using Muddy Water, which leaves it vulnerable to the other opposing Pokemon.</p> <p><strong>Any Attack</strong>: Clamperl is so frail that common powerful attacks such as Latias's Psychic will effortlessly OHKO it, while other attacks such as Metagross's Zen Headbutt, Tyranitar's Stone Edge, and many more threaten to at least 2HKO it.</p>",
    "sets": {
      "Rain Sweeper": {
        "description": "<h4>Set Description</h4> <p>Clamperl will mostly be using Muddy Water, as there are few Pokemon in the tier that can comfortably take one, especially in rain. Common Water-resistant foes such as Latias and Salamence all move after Clamperl in Trick Room and take significant damage from Ice Beam, while opposing Water-types such as Gyarados and Empoleon must fear Hidden Power Electric. Clamperl needs Protect to defend itself in situations that expose its terrible bulk, such as when foes use Fake Out and whenever Trick Room isn't up. Trick Room is essential to Clamperl's success, as it can clean up late-game or weaken teams throughout the mid-game for another Trick Room attacker to clean up.</p> <h4>Team Options</h4> <p>Dusclops is the best Trick Room setter for Clamperl, as it underspeeds Clamperl, meaning it can set up Rain Dance before Clamperl moves in Trick Room. It provides additional support with Helping Hand and can break Focus Sash with its attacking move so Clamperl can pick up more KOs. Bronzong can also provide Trick Room and Rain Dance support.</p> <p>Fellow powerful Trick Room attackers such as Rhyperior and Machamp can also pick up KOs whenever Clamperl misses them. Rhyperior is an especially natural fit, as its Lightning Rod ability keeps Clamperl safe from Electric-type attacks from Raikou and Rotom-A.</p> <p>Raikou is an additional Rain Dance user, and its Electric-type STAB attacks can eliminate common Water-types such as Gyarados and Suicune. Other beneficiaries of rain are fast Swift Swim users such as Kingdra and Ludicolo, which can help weaken teams for Clamperl whenever Trick Room isn't up.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 192134, "username": "ryo yamada2001"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 501951, "username": "zee"}, {"user_id": 230771, "username": "qsns"}]}, {"name": "Grammar checked by", "members": [{"user_id": 577920, "username": "Tea Guzzler"}, {"user_id": 517429, "username": "Adeleine"}]}]}
  },
  "Bronzong": {
    "sets": {
      "Utility": {
        "description": "<ul> <li> <p>Bronzong is a solid Trick Room setter, as its typing and bulk make it difficult to OHKO, and it has several utility options with which to make itself useful. While Bronzong excels as a Trick Room setter, its lack of offensive pressure means it faces competition from other Steel-types, such as Metagross and Jirachi, that offer either significant damage or more consistent utility outside of Trick Room.</p> </li> <li> <p>Bronzong's main role is as a Trick Room setter, enabling the likes of Rhyperior and Eruption Heatran to become threatening sweepers. Under Trick Room, Bronzong uses Gyro Ball, which OHKOes maximum Speed Tyranitar and 3HKOes Latias, or Stealth Rock which chips away at foes that want to switch around to burn Trick Room turns. While these options chip away at foes, Bronzong often finds itself draining its own team's momentum, preferring to use Explosion to eliminate foes and generate a free switch to a better Trick Room sweeper. This strategy is risky, as Bronzong may use Explosion into Protect. Because it often has a lot of defensive responsibilities, Bronzong may instead opt into Earthquake to 2HKO Heatran, and put opposing Metagross in the range of Rhyperior's Earthquake.</p> </li> <li> <p>Bronzong is also an adequate Rain Dance user, enabling Kingdra and Ludicolo while also masking its Fire-type weakness. As a Trick Room rain setter, it also enables Clamperl, albeit less effectively than Dusclops due to not having Helping Hand.</p> </li> <li> <p>Occa Berry covers Bronzong's sole Fire-type weakness, letting it set up Trick Room while surviving a Choice Specs Rotom-H Overheat or taking a Heatran's Heat Wave better. Other options include Lum Berry, with which Bronzong avoids being paralyzed, thus letting it set up Trick Room; Macho Brace, which makes Gyro Ball hit slightly harder or move before slower Pokemon such as Clamperl; and Leftovers, which lets it recover a little as it stays on the field.</p> </li> <li> <p>The EV spread maximizes Bronzong's HP, lets it OHKO 252 Speed Tyranitar with Gyro Ball, and puts the rest in Special Defense to take hits such as Kingdra's Muddy Water better. Bronzong can also maximize its Attack instead, giving its moves, especially Explosion, greater firepower. However, Bronzong's coverage remains underwhelming and as such it can also forego Attack investment to maximize its Special Defense instead, letting it take two subsequent Choice Specs Rotom-H Overheat with Occa Berry.</p> </li> <li> <p>Bronzong fails to threaten most Steel-types, so slow Fire-types such as Camerupt, Heatran, and the honorary Fire-type Rotom-H function well under Trick Room and eradicate the likes of Metagross, Jirachi, and opposing Bronzong. Similarly, Ground-type attackers such as Rhyperior synergize well, as they can freely use Earthquake and deal with Steel-types for Bronzong. Fighting-type attackers with Fake Out such as Hariyama and Hitmontop generate free turns for Bronzong to set up Trick Room and KO Heatran. Teammates with Electric- or Rock-type coverage such as Rotom-A, Tyranitar, and Hariyama also help deal with Gyarados. When using Rain Dance Bronzong, it prefers to be paired with Swift Swim sweepers like Kingdra and Ludicolo or, on teams with Trick Room also, Clamperl. Lastly, teams with Bronzong often dedicate themselves to the full Trick Room archetype, meaning it benefits from additional setters such as Cresselia.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 192134, "username": "ryo yamada2001"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 428483, "username": "Grandmas Cookin"}, {"user_id": 230771, "username": "qsns"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Rhyperior": {
    "sets": {
      "Bulky Attacker": {
        "description": "<ul> <li> <p>Rhyperior's sky-high Attack and excellent STAB coverage makes it a behemoth that hits nearly all of the tier for at least neutral damage, solidifying it as one of the tier's most powerful attackers. Its preference to use Earthquake synergizes nicely with Levitate Trick Room setters, such as Cresselia and Bronzong, and its immense physical bulk paired with Solid Rock also allows it to function outside of Trick Room as a bulky attacker. Rhyperior benefits greatly from speed control, as it wreaks havoc under Trick Room; outside of it, it becomes vulnerable because of its pitiful Special Defense and many common weaknesses. The likes of Choice Specs Latias can effortlessly eliminate it with Draco Meteor, while Zapdos 2HKOes it with Hidden Power Grass.</p> </li> <li> <p>Earthquake is a devastating STAB attack, which threatens Steel-types such as Metagross and Heatran. Though Sitrus Berry threatens to 2HKO Tyranitar and Heatran without fear of retaliation, Life Orb Rhyperior OHKOes bulkless Tyranitar, Raikou, and Shuca Berry Heatran after Stealth Rock.</p> </li> <li> <p>Rock Slide hits nearly all Ground-resistant and immune foes for neutral damage, with Life Orb Rhyperior 2HKOing common Earthquake switch-ins such as Latias, Rotom-H, and Gyarados.</p> </li> <li> <p>Stone Edge is a nuke option that, especially with damage boosting items and Helping Hand support, effortlessly picks up KOs on nearly all neutral targets. Life Orb Rhyperior OHKOes Latias after Stealth Rock, OHKOes uninvested Rotom-H after Stealth Rock, and even 2HKOes bulky foes like Mew.</p> </li> <li> <p>Many foes will use Protect against Rhyperior's pressure, hoping to stall out Trick Room turns. Rhyperior can maximize the value of these turns it can't damage foes by using Swords Dance, putting them under extreme stress the next turn, as practically nothing can comfortably switch into a +2 Earthquake or Rock Slide. This can be a game-winning maneuver, so opponents must be careful not to give Rhyperior these opportunities. Rhyperior can also opt for Ice Punch, especially when using Life Orb, as it OHKOes Latias after minimal chip.</p> </li> <li> <p>Protect is necessary for Rhyperior to defend itself from the numerous super effective and special attacks that could harm it such as from Latias's Draco Meteor, Swampert's Hydro Pump, and Machamp's Dynamic Punch. While Rhyperior uses Protect, its teammates can set up Trick Room or eliminate an opposing threat so Rhyperior can continue to attack.</p> </li> <li> <p>As Solid Rock Rhyperior survives many attacks on a small margin, such as Heracross's Close Combat, Metagross's Meteor Mash, and Machamp's Dynamic Punch, it often prefers the extra survivability from Sitrus Berry. Life Orb is preferred if Rhyperior intends to deal as much damage as possible as quickly as it can, especially in full Trick Room teams, as it hits numerous offensive benchmarks that Stirus Berry misses out on such as OHKOing bulkless Tyranitar. Stone Plate is effective for boosting damage output without chipping away at Rhyperior's survivability, notably OHKOing Gyarados with Stone Edge at -1. Alternatively, Earth Plate boosts Earthquake so it can OHKO bulkless Tyranitar after Stealth Rock, though boosting damage on its Rock-type attacks is often more important.</p> </li> <li> <p>Solid Rock is key to Rhyperior's immense bulk, as this ability allows it to live hits from Choice Band Machamp and Metagross that it wouldn't with Lightning Rod. However, Lightning Rod still has conditional value to redirect the common Thunder Wave and next to the commonly paired Gyarados, which is another partner freely enabling the use of Earthquake.</p> </li> <li> <p>On full Trick Room teams, Rhyperior runs 0 Speed IVs with a Brave nature to minimize its Speed, but on less committed Trick Room teams, Rhyperior should run Adamant with 31 Speed IVs to ensure it outspeeds paralyzed Choice Scarf Latias.</p> </li> <li> <p>Rhyperior greatly benefits from Trick Room, and the best partners for that are Levitate users Cresselia and Bronzong, which Rhyperior can freely use Earthquake with. Cresselia is especially potent, because it elevates Rhyperior's damage output to dizzying heights with Helping Hand, helping Life Orb Rhyperior secure KOs on Mew and Metagross with Stone Edge and Earthquake, respectively. Rhyperior requires teammates that can eliminate common special attackers that threaten massive damage on it; Choice Specs Rotom-H is a great partner, as it has Levitate, a low enough Speed tier for Trick Room teams, and the power to OHKO Latias, Mew, and Bronzong. Gyarados is a fantastic partner, as its Intimidate weakens common Fighting-type attackers such as Machamp, Heracross, and Hitmontop while being immune to Earthquake. It also checks Swampert, which has the physical bulk and coverage to pose a major threat to Rhyperior.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 192134, "username": "ryo yamada2001"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 228280, "username": "DaAwesomeDude1"}, {"user_id": 230771, "username": "qsns"}]}, {"name": "Grammar checked by", "members": [{"user_id": 594478, "username": "ken"}]}]}
  }
}