{
  "Vileplume": {
    "overview": "<p>Utilizing great defensive stats and valued resistances to types such as Water, Fighting, and Electric, Vileplume blossoms in PU as a sturdy tank and an excellent cleric that walls common threats like Shiftry and Zebstrika. The combination of Aromatherapy, Effect Spore, and being a grounded Poison to soak up Toxic Spikes gives Vileplume the ability to support a large variety of teams and fortify them in longer matches. Vileplume's offensive prowess is also reasonably good in comparison to other clerics like Audino thanks to the power and poison chance of Sludge Bomb, making it a cleric that is not inherently passive. However, Vileplume's weaknesses to common types such as Fire, Psychic, and Flying from threats like Monferno, Beheeyem, and Swanna, respectively, means that it may face too much pressure to utilize its toolkit to the fullest.</p>",
    "sets": {
      "Cleric": {
        "description": "<p>Giga Drain and Sludge Bomb are the preferred STAB moves for healing and applying status, respectively, and allow Vileplume to survive long into the match while wearing down foes. Aromatherapy is the main focus of the set, allowing Vileplume to purge common status such as paralysis from Static and sleep from Rest, helping teammates like Monferno and Bronzor, respectively. Black Sludge is the preferred item for providing passive healing and therefore longevity, but Occa Berry can be used instead to allow Vileplume to check Zebstrika and Monferno in a pinch and potentially status them with Sludge Bomb or Effect Spore. The EVs are for outspeeding base 55 Speed Pokemon such as Ursaring as well as uninvested Torterra, with the rest thrown into Defense to make Vileplume as bulky as possible.</p> <p>Vileplume's weaknesses to Fire- and Psychic-type attacks from threats like Simisear and Beheeyem can be patched up by teammates such as Tentacool, Scraggy, and Zweilous. Other weaknesses such as Flying- and Ice-type attacks from threats like Dodrio and Sneasel can be mitigated with partners like Stunfisk and Bronzor. Vileplume's resistance to Water-, Fighting-, and Electric-type attacks is highly appreciated by teammates such as Stunfisk, Zweilous, and Swanna. Access to Aromatherapy is also heavily appreciated by Pokemon that rely on Rest such as Bronzor as well as Pokemon that are severely crippled by Static paralysis such as Monferno. Additionally, even though Vileplume is not as passive as other clerics like Audino, it still tends to attract opposing walls such as Klang and Articuno, so wallbreakers such as Simisear and Mawile also make for great teammates. Vileplume makes for a good partner for Pokemon such as Scraggy and Zebstrika, as their usual counters like Machoke and Purugly do not like to risk receiving status from Effect Spore.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 231726, "username": "Akir"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 567483, "username": "Bella"}]}, {"name": "Grammar checked by", "members": [{"user_id": 229690, "username": "queez"}]}]}
  },
  "Victreebel": {
    "overview": "<p>There are few things as scary in PU as Victreebel in sun. With access to powerful STAB moves like Solar Beam and Sludge Bomb, perfect coverage with Weather Ball, great Special Attack, and Speed that lets it outrun the entire tier in sun even with a neutral nature, Victreebel can violently carve its way through unprepared teams. However, walls such as Audino and Klang can weather the heat, and priority users such as Purugly can whittle Victreebel down even with Chlorophyll's Speed boost. Victreebel also demands sun to be up; otherwise, it finds itself quickly outclassed by the long list of capable Grass-types in PU.</p>",
    "sets": {
      "Sun Sweeper": {
        "description": "<p>Solar Beam is Victreebel's most powerful attack and does not have a charge turn while under sun, so it functions as the primary STAB option. Sludge Bomb is a secondary STAB option for threats that resist Grass, such as Flying-types like Natu and Dragon-types like Zweilous. Sun-boosted Weather Ball gives Victreebel coverage for Steel-types like Klang and Bronzor while also hitting Grass-types like Vileplume hard. The last move is recommended to be Sunny Day, so Victreebel can set itself up and sweep. However, if Victreebel finds itself on a dedicated sun team, it can use Hidden Power Ground for additional coverage against Fire- and Poison-types like Monferno and Arbok. Growth is also an option for the fourth moveslot to give Victreebel even more power, but this uses a valuable sun turn, and the extra power is really only of use against particularly bulky teams.</p> <p>The most notable partner for Victreebel is the best weather setter in the format, Volbeat, and together they make the beginnings of a dedicated sun team. Other choices for dedicated sun teams include Onix as a reliable suicide lead that can set up sun for Victreebel and Rapidash as a sun wallbreaker that can break down special walls that Victreebel might struggle with. In general, Zebstrika makes for a good partner that can pivot in Victreebel while checking some key threats like Jumpluff and Klang very well. Sun teams generally cannot afford defensive teammates, but outside of those kinds of teams, teammates like Stunfisk and Tentacool are great at checking offensive threats such as Purugly and Simisear. Monferno is another notable partner, as it is able to get rid of high-value specially defensive walls like Audino, Scraggy, and Zweilous that would wall Victreebel otherwise. One last interesting partner is Weepinbell; while it does not contribute at all to defensive synergy, having what is effectively a slightly weaker second Victreebel makes for an interesting offensive combo that banks on the fact that most teams can barely handle Victreebel by itself.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 231726, "username": "Akir"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 567483, "username": "Bella"}]}, {"name": "Grammar checked by", "members": [{"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Articuno": {
    "overview": "<p>Thanks to its amazing special bulk, Articuno is very capable of walling and stalling Pokemon like Shiftry and Audino; however, it is severely hindered by its bad typing that lets prominent foes like Monferno, Zebstrika, and Rampardos break it, and its weakness to entry hazards limits it from switching in consistently. Nevertheless, with its ability, Pressure, as well as reliable recovery in Roost, Articuno can be a great defensive asset to teams if it's provided with the proper support like other defensive Pokemon which help cover its weaknesses.</p>",
    "sets": {
      "Specially Defensive": {
        "description": "<p>With maximum Special Defense, this set focuses on using Articuno's bulk to stall out the opponent's team. Substitute prevents status from crippling Articuno; and allows it to stall out threatening low-PP moves such as Head Smash, Stone Edge, and Close Combat from users like Relicanth, Torterra, and Ursaring. Ice Beam helps Articuno not be too passive, threatening an OHKO on Torterra, Jumpluff, and Gabite, as well as 2HKOs on foes like Shiftry, Maractus, Fraxure, and Marowak. Toxic can be useful to stall out most defensive Pokemon if Articuno's team does not provide Toxic Spikes support; it can also be helpful to spread Toxic in conjunction with Pokemon like Bronzor and be a good option when paired with entry hazard setters like Dwebble, Stunfisk, and Torterra. Roar is an alternative that's useful if Articuno has entry hazard support and has value in phazing setup sweepers like Shiftry, Ursaring, and Mawile. Articuno can alternatively use an EV spread with maximum Speed investment, which lets it outspeed the likes of Gabite, Monferno, and Luxray; however, this leaves it more frail.</p> <p>Due to the tier's abundance of entry hazard setters that can hinder Articuno, Natu and Rapid Spin users like Tentacool are very good teammates. In return, Articuno can help wall their checks like Shiftry. Articuno's weaknesses to Fire-, Rock-, and Electric-type moves let it be broken down by Pokemon like Monferno, Rampardos, and Raichu, making other defensive Pokemon that can cover these weaknesses like Frillish, Klang, and Stunfisk appreciated. In return, Articuno can help to wall Pokemon that threaten them like Shiftry, defensive Gabite, and Golduck. Articuno appreciates Heal Bell and Wish users like Audino, which can help offset its Stealth Rock weakness.</p>"
      }
    },
    "credits": {"writtenBy": [], "teams": [{"name": "Quality checked by", "members": [{"user_id": 231726, "username": "Akir"}, {"user_id": 567483, "username": "Bella"}]}, {"name": "Grammar checked by", "members": [{"user_id": 532450, "username": "TheRealBigC"}, {"user_id": 511181, "username": "Rose"}]}]}
  },
  "Jumpluff": {
    "overview": "<p>Jumpluff finds a niche in PU as a reliable pivot and support Pokemon. Jumpluff's excellent typing gives it plenty of opportunities to switch into common threats like Torterra and Scraggy while also having the Speed and deep support movepool to disrupt them with options like Encore. Jumpluff's access to Synthesis gives it the longevity to disrupt foes and pivot around for most of the match. However, Jumpluff's offensive prowess is less impressive and leaves it open to being stopped by common walls like Bronzor, Stunfisk, and even Klang. Jumpluff is also still outsped by the common Zebstrika or the less common Sneasel.</p>",
    "sets": {
      "Pivot": {
        "description": "<p>Acrobatics is the chosen STAB move thanks to its interaction with Flying Gem. With Flying Gem, both the Flying Gem boost and the Acrobatics boost apply at the same time, making the first Acrobatics that Jumpluff uses is extremely strong, while granting every subsequent Acrobatics a consistent 110 Base Power. The last move is a choice between three moves: Encore, Aromatherapy, and Swords Dance. Encore is the preferred option and allows Jumpluff to shut down setup and neutralize walls such as Beheeyem and Bronzor by locking the target into an unthreatening move, which also gives teammates potential turns to set up themselves. Aromatherapy is effective for keeping its teammates healthy by shrugging off common status such as paralysis and poison and doubles down on Jumpluff's longevity as well. Swords Dance is a final option for late-game sweeps; however, Jumpluff finds itself easily stopped by common walls, so this is the least preferred option.</p> <p>Jumpluff is best at home on offense teams that are looking for ways to break stall and stay healthy for scrappier matches. In this sense, Jumpluff is a great teammate for Pokemon such as Monferno that are prone to getting hit with status and appreciate being brought in safely by U-turn. Jumpluff also heavily appreciates a teammate that is able to handle its common counters in Bronzor, Stunfisk, and Klang that Jumpluff commonly faces; Pokemon like Simisear and Marowak are excellent choices for breaking past Jumpluff's counters. Other teammates include Zebstrika, which can make an excellent VoltTurn core with Jumpluff. Jumpluff is also surprisingly able to tank strong boosted hits from Pokemon such as Torterra, so teammates such as Stunfisk appreciate the synergy Jumpluff has to offer. Stunfisk, Frillish, and Klang are also good defensive partners, being able to tank some of the attacks directed at Jumpluff. An important thing to keep in mind about Jumpluff is that it is neither a wall nor a sweeper: Jumpluff is there to come in when it's convenient, perform its support task like Encore, heal if it has to or maybe squeeze a hit in if it can, then get out efficiently.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 231726, "username": "Akir"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 567483, "username": "Bella"}, {"user_id": 481576, "username": "roxie"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}, {"user_id": 384270, "username": "autumn"}]}]}
  },
  "Mawile": {
    "overview": "<p>Mawile is blessed with two powerful abilities in Sheer Force and Intimidate as well a good Steel typing, letting Mawile's unassuming stats go a considerable distance. Sheer Force combined with Swords Dance makes Mawile a fearsome wallbreaker, and Intimidate mixed with Mawile's coveted Steel typing allows it to function as a defensive tank. However, Mawile's lack of Speed and reliable recovery limit its effectiveness in both roles.</p>",
    "sets": {
      "Swords Dance Wallbreaker": {
        "description": "<p>Swords Dance pushes Mawile's Attack to a considerable level, and in combination with Life Orb and Sheer Force, this makes Mawile able to 2HKO a considerable amount of the tier such as Torterra, Vileplume, and Duosion. Sucker Punch gives Mawile a priority option to make up for its lackluster Speed and potentially KO faster threats like Zebstrika. The last moveslot is dedicated to any of these coverage moves: Ice Punch hits Ground-types like Stunfisk and Torterra, Fire Fang hits Steel-types such as Bronzor and Klang, and Thunder Punch hits Water-types such as Swanna and Frillish. It is also possible to drop Sucker Punch for a second coverage move, but the overall utility of Sucker Punch makes it recommended to keep. The given EVs spread lets Mawile outspeed uninvested Pokemon with base 55 Speed such as Ursaring as well as uninvested Torterra while minimizing Life Orb damage, but a faster or bulkier spread can also be utilized depending on the team.</p> <p>While Mawile is excellent at wallbreaking, it can still be walled depending on its chosen coverage move. If Ice Punch is not chosen, Stunfisk easily walls Mawile, so a partner like Torterra can be great to round out that weakness. If Fire Fang is not chosen, Bronzor and Klang can wall Mawile, so Monferno and Scraggy can make for good partners. If Thunder Punch is not chosen, then Frillish can wall Mawile, making a teammate like Vileplume a strong choice. Pokemon that can sweep after Mawile is done wallbreaking make for a good offensive combo, so sweepers like Huntail and Fraxure make for excellent partners. Revenge killers such as Zebstrika and Choice Scarf Swanna can also be effective for taking on faster threats that Mawile might struggle with otherwise.</p>"
      },
      "Defensive": {
        "description": "<p>With Intimidate and its Steel typing, Mawile can make for a decent physically defensive tank, walling threats like Purugly and Dodrio. Thanks to Intimidate, Mawile causes a lot of switches, making Stealth Rock both easy to set up and potent in use. Iron Head is a reliable STAB option, and Toxic is used for reliable chip damage. Knock Off is recommended for the last moveslot to get rid of common items like Leftovers and Eviolite, crippling Pokemon such as Stunfisk and Klang, but Pain Split can be used to patch up Mawile's lack of consistent recovery thanks to its low base HP. However, Mawile usually gets more opportunities to use Knock Off than it would with Pain Split.</p> <p>Many dedicated defensive cores prefer sturdier Steel-types like Bronzor due to their better longevity, so defensive Mawile tends to find a home on more offensive teams that are looking for a reliable tank and appreciate the disruption of Intimidate and Knock Off that Mawile provides. Mawile is weak to Fire- and Fighting-type moves and worn down notably by entry hazards, so Tentacool is a particularly good option for a partner, while Tentacool also appreciates Mawile tanking physical hits as well. Mawile also is weak to common Ground-type attacks, so Pokemon like Maractus can also make for good partners. Maractus and Tentacool both can also set up Spikes and Toxic Spikes respectively, synergizing with Mawile's ability to force switches very well. Other defensive Pokemon such as Frillish, Vileplume, and even Jumpluff can also make for good teammates by covering Mawile's weaknesses and healing any status conditions and damage it has taken.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 231726, "username": "Akir"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 567483, "username": "Bella"}]}, {"name": "Grammar checked by", "members": [{"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Torterra": {
    "overview": "<p>Torterra is an absolute monster of a threat in the BW PU metagame, carrying one of the most deadly offensive presences that works hand-in-hand with one of the most customizable toolkits in the tier. With massive stats in comparison to the tier, its natural bulk and strength mean it can fit into many teams. Its typing is incredible both offensively and defensively, granting it incredible coverage between its STAB moves and access to EdgeQuake while possessing monstrous defensive utility. Torterra thrives off its ability to fit into many teams seamlessly, being a great glue to prevent Electric-types such as Zebstrika from pivoting with Volt Switch while resisting Ground-type attacks from threats such as opposing Torterra and Gabite. With its offensive sets, it can quickly threaten to sweep opposing teams while using its incredible natural bulk to set up on more passive Pokemon such as Klang and Scraggy or go directly for breaking through with a Choice Band. Torterra's versatility can only carry it so far, however, as it has a mediocre Speed tier, leaving it reliant on setup to become a game-ending threat. Its quadruple weakness to Ice-type attacks such as STAB Ice Punch from Sneasel, Hidden Power Ice from Zebstrika, and Ice Beam from faster Water-types such as Golduck forces it to play carefully. Flying-type Pokemon such as Jumpluff and Swanna are additionally able to outspeed it and thwart it with their STAB moves, but they must be watchful of Stone Edge. Torterra also must be wary of Bronzor, which walls it in most cases.</p>",
    "sets": {
      "Offensive Tank": {
        "description": "<p>Earthquake is chosen primary STAB move, and Stone Edge is chosen as the primary coverage in order to hit Flying-types such as Natu and Jumpluff; however, Wood Hammer is stronger against neutral targets and cannot miss. The last moveslot is extremely versatile and can be whatever the team needs. Stealth Rock is always appreciated and Torterra is a particularly reliable hazard setter thanks to its bulk and typing. Rock Polish and Swords Dance are both good options for setting up and sweeping or wallbreaking, respectively. Toxic is useful for hitting and getting chip damage on common switch-ins like Jumpluff. Roar can be useful for phazing threats like Duosion that might set up otherwise but is generally more situational than the other strong choices for the last moveslot. The EVs in HP and Special Defense are to survive two Hidden Power [Ice] Ices or one Hidden Power [Ice] and one Overheat from Magnet Zebstrika after Stealth Rock, with the rest being put into Attack to always get an OHKO on Zebstrika and Tentacool with Earthquake. Yache Berry is critical for making the previous calculation work, but Occa Berry can also work for absorbing Fire-type moves like a Flare Blitz from Monferno and Overheat from Zebstrika and KOing with Earthquake.</p> <p>This Torterra set is focused around bringing out as many of Torterra's strengths in a single role as possible and can find a home on offensive teams that need a solid tank that can fill in multiple roles such as setting Stealth Rock while tanking hits from both physical and special threats such as Arbok or Vileplume. Torterra's resistances to Rock and Ground and immunity to Electric allow it to find a home on teams that need checks to Rampardos, Gabite, and Zebstrika. Pokemon such as Monferno and Purugly also appreciate the defensive synergy that Torterra provides, properly answering their common walls such as Stunfisk. Torterra is also weak to Fire, Flying, and Ice, so partners like Tentacool and Klang can be excellent choices for rounding out a defensive core.</p>"
      },
      "Physically Defensive": {
        "description": "<p>Maximum HP and Defense EVs allow Torterra to take considerably less damage and even avoid a 2HKO from Choice Band Stoutland. This investment in bulk makes Torterra one of the most reliable Stealth Rock setters in the tier. The last moveslot is very flexible; Swords Dance is the default option, as it allows Torterra to set up and beat many slow setup threats such as Scraggy, making Torterra into a potent wallbreaker in addition to a wall. Roar allows Torterra to phaze and rack up more chip damage from entry hazards it sets up. Earthquake is a secondary STAB option without recoil, and Toxic is always good for slowly chipping down targets and hitting threats on the switch.</p> <p>Torterra has notable weaknesses to Ice- and Fire-type attacks, so partners like Tentacool and Frillish that can absorb those attacks make for excellent partners. Tentacool also has the added benefit of Rapid Spin and Toxic Spikes while Torterra covers the Ground-type attacks pointed at Tentacool, so the synergy between these two is of particular note. Torterra is also excellent at shutting down setup sweepers like Scraggy and Duosion by either setting up itself with Swords Dance or phazing with Roar, so offensive pivots such as Zebstrika and Monferno appreciate having an easy option to pivot into to solve those matchups. Torterra also invites in many Flying-types such as Jumpluff, so a partner that can resist Flying-type attacks such as Zebstrika or Klang can also make for great partners.</p>"
      },
      "Choice Band": {
        "description": "<p>Maximum Attack investment with a Choice Band allows Torterra's Wood Hammer to OHKO or 2HKO a large swath of offensive threats like Swanna and Stoutland, and Overgrow allows Wood Hammer to even have a chance to OHKO Monferno. Stone Edge rounds out the coverage by hitting Flying-types such as Jumpluff or Natu that would wall Torterra's STAB moves otherwise. The last moveslot goes mostly unused, as the other three slots are near-perfect coverage, but Superpower works for hitting certain threats like Scraggy harder, while Seed Bomb also works as a Grass-type STAB option without recoil while still 2HKOing threats like Ursaring and Beheeyem.</p> <p>Even with all of this Attack investment, Torterra is still heavily walled by Bronzor. As such, partners that can beat Bronzor such as Simisear and Monferno are heavily appreciated. Choice Band Torterra also excels in baiting Bronzor in, so teammates like Scraggy that can set up on Bronzor also make for good options. Torterra also excels in breaking down walls like Stunfisk to make way for a teammate like Monferno and Zebstrika to sweep later. Stealth Rock goes a long way in helping Torterra break down walls, since it tends to draw in Flying-types, so partners that set them consistently like Dwebble and Bronzor are very appreciated. It also heavily appreciates a free switch-in from a pivot like Klang or Monferno to keep itself healthy and positioned well.</p>"
      },
      "Double Dance": {
        "description": "<p>This set runs both Swords Dance and Rock Polish not with the expectation of getting both boosts off but so Torterra has the correct setup option for whatever situation it finds itself in. Rock Polish is for the potential late-game sweep, and Swords Dance is for when Torterra needs to be a wallbreaker. Wood Hammer is Torterra's most powerful STAB option but comes with heavy recoil, and Earthquake is the secondary STAB move with no recoil. Either STAB option or Swords Dance can be replaced with Stone Edge for better coverage against common Flying-type switch-ins like Jumpluff and Natu. Life Orb is the chosen item for an extra power boost to ease sweeps after Rock Polish, comfortably 2HKOing threats like Beheeyem and OHKOing Stunfisk, but Yache Berry can also be used to absorb a stray Ice-type attack like Hidden Power Ice from Zebstrika to earn a turn to set up. Overgrow is the preferred ability for its ability to power up Torterra's Wood Hammer to dizzying heights when activated, but if Stone Edge is chosen over Wood Hammer, then Shell Armor should be the chosen ability.</p> <p>Even with Swords Dance and a Life Orb, Torterra is still walled by Bronzor. Common answers for beating Bronzor include Monferno, Simisear, Marowak, and Scraggy. Torterra can also be threatened out by some Choice Scarf Pokemon even after a Rock Polish such as Swanna and Monferno, so partners like Klang and Frillish can be excellent choices for protecting Torterra from the revenge killers. Torterra is also excellent at breaking through physical walls like Machoke and Stunfisk, so Pokemon like Monferno and Zebstrika appreciate its wallbreaking potential.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 231726, "username": "Akir"}, {"user_id": 468904, "username": "SBPC"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 567483, "username": "Bella"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Monferno": {
    "overview": "<p>Monferno is the best Pokemon in BW PU thanks to its phenomenal STAB combination, versatility, and ability to break through a majority of defensive Pokemon in the tier, such as Torterra, Bronzor, and Mawile. Close Combat and Flare Blitz both have huge Base Powers, Thunder Punch acts as good coverage for Water-types, and an Iron Fist-boosted Mach Punch can help clean up offensive teams late-game, especially when boosted by Swords Dance. Monferno also has decent support options such as Stealth Rock, U-turn, Taunt, Will-O-Wisp, and reliable recovery in Slack Off. Monferno is, however, somewhat let down by its stats. Its Speed, while decent, still leaves it outpaced by Pokemon like Dodrio and Swanna, without a boost from Swords Dance or Choice Band, its Attack is very middling, and its bulk is low enough that it can't usually take even more than one or two neutral hits in a game. Despite these shortcomings, Monferno is still a fierce wallbreaker in the tier and every team has to prepare for it.</p>",
    "sets": {
      "All-Out Attacker": {"description": "<p>Even without a boost, the combination of Close Combat and Flare Blitz can handle Pokemon such as Scraggy, Stoutland, Shiftry, Torterra, Klang, and Maractus. Mach Punch is used as an anti-offense measure, picking off weakened faster threats like Zebstrika. U-turn can be used to take advantage of the switches that Monferno forces against Pokemon like Audino and Mawile and gain momentum, while Thunder Punch can be used as extra coverage to punish Water- and Flying-types like Mantine and Swanna that might expect a relatively easy switch into Monferno's STAB moves. Eviolite helps to improve Monferno's meager bulk to allow it to take hits better from the likes of Zebstrika, Shiftry, and Sneasel, while Life Orb boosts the power of its moves substantially. With base 81 Speed, a Jolly nature is needed to make sure that Monferno outspeeds several threats like Shiftry, Stoutland, and Arbok.</p>"},
      "Swords Dance": {"description": "<p>Swords Dance takes advantage of Monferno's ability to force switches and boosts its power level sky high, allowing it to crush defensive staples like Beheeyem, Tentacool, and Stunfisk after one round of Stealth Rock damage, though it needs to be wary of Static from the latter. Fire Punch has significantly lower power than Flare Blitz but lacks recoil, making it a potentially useful option, especially for Life Orb sets. Mach Punch functions as a great anti-offense tool, knocking out Zebstrika and Dodrio with slight chip after a Swords Dance. Thunder Punch, on the other hand, allows Monferno to KO Frillish and Mantine. Swords Dance Monferno appreciates entry hazard support from Pokemon like Maractus, Stunfisk, Torterra, and Bronzor in order to ensure it gets the KOs it needs. Stunfisk works as a good Pokemon that resists Flying and Maractus or Torterra can also set up hazards while helping to check Water- and Ground-types.</p>"},
      "Choiced Attacker": {
        "description": "<p>Monferno's high Base Power STAB moves and decent Speed make it a fantastic choice as a Choice Scarf user, outspeeding every other unboosted Pokemon in the tier. Choice Band, on the other hand, makes Monferno a powerful breaker without needing a turn to boost. U-turn has more viability on these sets, as Monferno undoubtedly will force switches and seeing an opponent's initial switch into it can help immensely as the game goes on. Mach Punch allows Monferno to damage faster Choice Scarf users like Dodrio while also making up for the lower Speed on the Choice Band set. These sets function well with other Volt Switch and U-turn users like Zebstrika and Jumpluff, as they can wear down mutual checks and continue forcing switches from the opponent. Because of this, hazard-stacking Pokemon like Dwebble, Maractus, and Stealth Rock users help to rack up damage and get opposing Pokemon into KO range.</p> <h4>Checks and Counters</h4> <p><strong>Faster Pokemon</strong>: Swanna, Dodrio, Swoobat, Zebstrika, and Jumpluff all outspeed and threaten non-Choice Scarf Monferno with KOs or at least heavy damage. Only some of these Pokemon can switch into Monferno depending on Monferno's moveset, and some can be picked off by a boosted Mach Punch but overall can at least force Monferno out.</p> <p><strong>Stunfisk and Beheeyem</strong>: While a bit shaky against the Swords Dance set, physically defensive Pokemon like Beheeyem and Stunfisk can take at least one hit from Monferno usually and threaten it with super-effective moves after. Stunfisk specifically makes Monferno tread carefully, even when using U-turn, due to the threat of Static paralysis shutting Monferno down completely.</p> <p><strong>Frillish</strong>: Frillish is the most reliable Monferno check, being immune to one STAB move and resisting the other. However, Frillish does have to worry about being chipped into range of a +2 Flare Blitz and the possibility of Thunder Punch, which OHKOes after a Swords Dance.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 265399, "username": "SergioRules"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 231726, "username": "Akir"}, {"user_id": 567483, "username": "Bella"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Stoutland": {
    "overview": "<p>Stoutland makes its niche in PU by hitting very hard. With a Choice Band, excellent Attack, and STAB Return, it shreds most Pokemon that don't resist Normal-type attacks. Stoutland also has great coverage and two fantastic abilities to round out its toolkit, making it a fearsome wallbreaker. However, its Speed falls short of making it a true offensive threat, and some walls like Bronzor can counter it even with coverage.</p>",
    "sets": {
      "Wallbreaker": {
        "description": "<p>Return is one of the most spammable moves in the tier thanks to its high Base Power and lack of downsides. Superpower is Stoutland's primary coverage, which is able to hit Pokemon that resist Normal such as Klang and Mawile super effectively. Pursuit is also a strong option for hitting certain Pokemon like Beheeyem while they try to switch out, guaranteeing valuable chip damage. The last moveslot is flexible; Facade can be used as an alternate STAB move if Stoutland is poisoned or burned, but Fire Fang can be used as an answer to Bronzor. Stoutland prefers the utility of Intimidate due to the notable lack of Ghost-types in PU, but Scrappy can be useful for hitting the occasional Banette and Frillish with Return.</p> <p>Stoutland's Speed is just enough to outspeed every wall in PU, but it is just shy of beating most offensive threats with the most notable being Monferno. Because of this, walls such as Stunfisk make for good partners to switch to after it is forced out. Stoutland also loves entry hazards, since they make it even harder for foes to switch into its attacks, so hazard setters like Dwebble, Maractus, and Torterra also make for good partners. Other options for partners include faster offensive threats that are enabled by Stoutland's wallbreaking such as Swanna and Rock Polish Torterra.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 231726, "username": "Akir"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 567483, "username": "Bella"}]}, {"name": "Grammar checked by", "members": [{"user_id": 527276, "username": "Techno"}]}]}
  },
  "Simisage": {
    "overview": "<p>Simisage is an odd wallbreaker due to its mediocre STAB options but powerful and near-perfect coverage options. Combine this great coverage with Simisage's great Speed and an excellent mixed wallbreaker is born. However, Simisage's choice between weak or unreliable STAB options mixed with the fact that some walls like Bronzor wall Simisage regardless means that Simisage's performance can sometimes come up short.</p>",
    "sets": {
      "Mixed Wallbreaker": {
        "description": "<p>Leaf Storm is extremely powerful even without much Special Attack investment, but Giga Drain is also an option if you want a more spammable STAB option that also heals at the cost of a lot of power. Superpower hits Steel-types like Klang super effectively while also hitting specially defensive walls like Audino, Scraggy, and Zweilous for more damage than Leaf Storm can. Acrobatics hits Grass-types like Vileplume that resist the other two moves and gets an additional bonus from Flying Gem. The last move is filler, as the other three moves achieve near-perfect coverage, but Taunt shuts down walls like Bronzor and Audino from using their healing and status moves.</p> <p>Simisage is excellent for breaking through walls like Zweilous and Vileplume, so sweepers like Swanna and Shiftry that are walled by these two love having it around. Simisage does have problems breaking through Bronzor and therefore invites it in a lot, so partners like Scraggy and Monferno that can deal with Bronzor and use it as setup fodder also make for good choices. Simisage also invites in a lot of Fire- and Flying-types, such as Rapidash and Dodrio, so Pokemon like Frillish, Stunfisk, and Klang make for great teammates for Simisage to pivot to.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 231726, "username": "Akir"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 567483, "username": "Bella"}]}, {"name": "Grammar checked by", "members": [{"user_id": 356215, "username": "Clouds"}, {"user_id": 327515, "username": "Zrp200"}]}]}
  },
  "Arbok": {
    "overview": "<p>Arbok's unassuming stats belie one of the most interesting setup Pokemon in PU. Coil elevates Arbok to a surprisingly hard-hitting wallbreaker that can be difficult to deal with. Arbok has two great abilities; Intimidate gives it plenty of opportunities to set up, while Shed Skin grants it longevity. A useful Poison typing allows Arbok to set up on certain would-be threats like Vileplume and Close Combat Monferno. Arbok can also utilize a Choice Scarf to become a revenge killer with interesting utility in the form of Switcheroo while bluffing the much more common Coil set. Arbok's stats do keep it down however, as without a Coil boost or Choice Scarf, it can be underwhelming both offensively and defensively.</p>",
    "sets": {
      "Coil": {
        "description": "<p>Coil's increases to Attack and accuracy synergizes well with Gunk Shot, which becomes a powerful, accurate STAB attack and with a high poison chance. Earthquake is a good coverage move for Gunk Shot, as it hits common switch-ins like Klang and Stunfisk for heavy damage. The last move is recommended to be Sucker Punch to give Arbok a priority option, but Fire Fang is useful for hitting certain threats like Bronzor. Both abilities help with consistency; Intimidate gives Arbok more opportunities to set up, while Shed Skin lets it shake off status that could cripple it otherwise such as paralysis from Stunfisk and Vileplume. Intimidate is recommended due to its more versatile utility and potential to make Arbok a useful switch-in to threats like Monferno and Simisage. Leftovers is the preferred item to make Arbok harder to KO, let it bank more on Coil's Defense boost, and make switching into the aforementioned threats slightly easier, but the power advantage of Life Orb is high enough that it allows Arbok to hit as if it had an additional Coil already set up. Shuca Berry can be used to mitigate Arbok's Ground weakness, allowing it to live attacks from threats like Stunfisk and Torterra and potentially beat or set up against them.</p> <p>Coil Arbok finds itself on balance and bulky offense teams that want a blanket check to some threats like Monferno that can also threaten walls like Vileplume. As such, Arbok makes for a good teammate to Pokemon that appreciate having those threats taken care of such as Shiftry, Marowak, and Zebstrika. Arbok also appreciates partners that cover its Psychic- and Ground-type weakness such as Scraggy or Torterra. Arbok also really enjoys the entry hazards set by Pokemon such as Rampardos, Torterra, and Dwebble. Arbok's Speed is just shy of the base 81 Speed benchmark, making it into a slightly slower offensive Pokemon, so Pokemon like Stunfisk and Clefairy that can spread paralysis are appreciated for their ability to slow the opposing team down for a potential Arbok sweep later.</p>"
      },
      "Choice Scarf": {
        "description": "<p>Poison Jab is the preferred STAB option due to its 100% accuracy, but Gunk Shot is significantly stronger at the cost of accuracy. Earthquake rounds out coverage by letting Arbok hit Steel-types like Klang as well as hitting a potential counter in Stunfisk. Switcheroo gives Arbok's Choice Scarf to common walls that usually beat it like Bronzor, crippling them. The last slot goes largely unused, but there are a few options that are worthwhile after Switcheroo is used: Fire Fang allows Arbok to damage Bronzor after giving it the Choice Scarf, Coil lets Arbok set up, and Sucker Punch can be used to continue revenge killing even after the Choice Scarf is lost. Shed Skin is the preferred ability to have a chance to shake off any unfortunate burns or paralysis that would cripple Arbok otherwise.</p> <p>It is very important to note that while Arbok can adequately fulfill the role of revenge killer with a Choice Scarf, it is the slowest common option for a Choice Scarf user by the tier's standards. As such, the decision to choose Choice Scarf Arbok hinges more on its ability to cripple walls with Switcheroo than anything else. Because of this, teammates like Torterra, Beheeyem, and Monferno that love having Arbok's common checks and counters like Stunfisk and Bronzor crippled are excellent choices for a potential follow-up sweep. Arbok needs a lot of help to fully finish off threats, so entry hazard setters like Dwebble, Stunfisk, and Maractus can be good choices. Pokemon such as Bronzor, Maractus, and Scraggy also make for good partners, as they can take on common Ground- and Psychic-type attacks from Marowak and Beheeyem that are directed at Arbok. Arbok can take Fighting- and Grass-type attacks from threats like Monferno and Simisage for teammates like Scraggy and Stunfisk for some light defensive synergy as well.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 231726, "username": "Akir"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 567483, "username": "Bella"}]}, {"name": "Grammar checked by", "members": [{"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Dodrio": {
    "overview": "<p>With strong STAB moves in Brave Bird and Return, Dodrio is able to threaten a large portion of the BW PU metagame, including the Grass- and Fighting-type threats of the tier like Torterra and Monferno, while its high base 100 Speed allows it to outrun threats such as Swanna and Leafeon. Choice Scarf Dodrio functions as a great late-game cleaner, while Choice Band sets can greatly threaten slower teams and are able to threaten Pokemon like Scraggy even after a few boosts. Unfortunately, Dodrio is incredibly linear, as aside from its STAB attacks, it only sports Pursuit as viable coverage; this means that defensive Pokemon that switch into its attacks such as Klang, Bronzor, and Stunfisk will completely wall Dodrio, while other Pokemon with good defensive stats such as physically defensive Articuno don't mind switching in in a pinch as well. Secondly, Dodrio's main STAB move in Brave Bird causes recoil, which further lessens its already meager longevity when coupled with its weakness to Stealth Rock. Dodrio's dependence on Choice items also makes it extremely prediction reliant, and clicking the wrong move on the wrong turn can turn it into easy setup for the opponent. Finally, while Dodrio's Speed is very good for the tier, it is still slower than Pokemon like Zebstrika and Sneasel, so sets without a Choice Scarf can struggle against these faster foes.</p>",
    "comments": "<h3>Checks and Counters</h3> <p><strong>Steel-types</strong>: Though there are few, Steel-types such as Mawile and Klang are not particularly threatened by Dodrio due to its lack of even neutral coverage to hit them with. These two examples can easily switch into Dodrio and either damage it or cripple it with status, while Bronzor and Mawile freely set up Stealth Rock on it. Only an offensive Mawile set is particularly threatened by Choice Band Dodrio, and even then it can usually switch into one Brave Bird and threaten to do a lot of damage back with Sucker Punch.</p> <p><strong>Ice-types</strong>: Bulky Articuno doesn't mind switching into Choice Scarf variants of Dodrio, as it can fire back with super effective STAB attacks. Additionally, Sneasel and Choice Scarf Vanilluxe threaten to outspeed and take out Choice Band Dodrio while also being able to scare off Choice Scarf with their powerful Ice Shards.</p> <p><strong>Electric-types</strong>: Zebstrika outspeeds and KOes Choice Band Dodrio, while Choice Scarf Dodrio doesn't always KO Zebstrika with Return. Stunfisk in particular counters Dodrio and can freely switch into it, always threatening to paralyze it with Static or almost KO it with Discharge, while Dodrio's moves do fairly little to it.</p> <p><strong>Revenge killers</strong>: The recoil damage on Dodrio's main STAB move paired with its mediocre bulk and weakness to Stealth Rock leaves it very open to faster Choice Scarf users like Rapidash as well as priority users like Monferno, Shiftry, and Purugly. These Pokemon, while unable to switch into strong Brave Birds, can easily threaten Dodrio in return after it has knocked out one of their teammates.</p>",
    "sets": {
      "Choice Scarf": {
        "description": "<p>Brave Bird and Return are Dodrio's main STAB moves, helping to check Monferno and Torterra while still being able to hit Zebstrika neutrally. Quick Attack is a decently strong priority move to pick off faster Pokemon like Choice Scarf Rapidash, weather sweepers like Golduck and Shiftry, and other priority users like Monferno. Pursuit is an option to take advantage of the switches that Dodrio forces against Pokemon like Natu, Jumpluff, and Zebstrika that don't appreciate taking strong Brave Birds. Drill Peck is used as a significantly weaker Flying-type STAB move that can still pick off weakened Pokemon without the recoil of Brave Bird. Steel Wing is Dodrio's only real coverage option and has the niche of hitting Rock-types harder, but is hard to justify using over the utility of the other moves. Tangled Feet is the most useable of Dodrio's abilities, giving it an evasion boost if it gets confused. An Adamant nature is preferred for much-needed power, but a Jolly nature can be used to outspeed opposing Choice Scarf users such as Swanna and Mr. Mime.</p> <p>Choice Scarf Dodrio functions well as a late-game cleaner, after bulkier Pokemon such as Beheeyem, Mantine, and Frillish have been worn down in range of its attacks. Due to its lack of coverage, Dodrio needs partners that can help deal with the likes of Mawile, Klang, and Stunfisk. Ground-types like Gabite and Torterra fill this role quite nicely while also helping Dodrio against Electric-types such as Zebstrika, and they can also set up Stealth Rock to wear down Dodrio's checks. Dodrio's own susceptibility to Stealth Rock also makes Tentacool and Natu good partners for being able to keep entry hazards off the field, giving Dodrio the ability to switch in more times over longer games. Dodrio also appreciates momentum support from Pokemon like Monferno, Natu, and Zebstrika so that it can more easily switch into the threats that it would like to check.</p>"
      },
      "Choice Band": {
        "description": "<p>The added power of Choice Band pushes the power of Brave Bird and Return high enough to now OHKO Pokemon like defensive Torterra and most Gabite sets, as well as getting a 2HKO on defensive Pokemon like Pelipper. Quick Attack is preferred on Choice Band Dodrio for its ability to pick off weakened threats with much more reliability. Pursuit is extremely useful to damage opposing Pokemon that would normally be threatened by Dodrio, while Drill Peck can be used as a STAB move without recoil.</p> <p>Choice Band Dodrio works very well as an early-game wallbreaker, as its high-powered moves can severely weaken even some of its sturdier checks and a strong, well-timed Pursuit can help weaken Pokemon for Dodrio's teammates such as Jumpluff and Zebstrika. Many of the same Pokemon that work well with Choice Scarf Dodrio also work well with its Choice Band set such as Natu, Tentacool, and momentum users. However, Choice Band Dodrio also appreciates some extra support to handle Zebstrika and Sneasel, since it has no chance of outspeeding them normally. Ground-types like Gabite and Torterra work well to help against Zebstrika, with special mention to Stunfisk, as it doesn't have a 4x weakness to Hidden Power Ice. Ice-type checks such as Monferno and defensive Mawile help to keep Sneasel under control. Pokemon like Stunfisk, Dwebble, or Maractus can set up Stealth Rock or Spikes, which can help make Dodrio's attacks guarantee OHKOs on Pokemon like defensive Beheeyem and Audino. Pokemon like Torterra and Scraggy greatly fear Choice Band Dodrio, so Pokemon that can take advantage of them being knocked out like one's own Torterra, Gabite, and Beheeyem make great partners.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 265399, "username": "SergioRules"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 231726, "username": "Akir"}, {"user_id": 468904, "username": "SBPC"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "Lumari"}]}]}
  },
  "Mantine": {
    "overview": "<p>Mantine is a Pokemon with many wonderful things going for it on paper. Excellent defensive typing that lets it switch into Monferno and Swanna, a great defensive ability in Water Absorb, and supremely high Special Defense all suggest that it is a Pokemon that would find a niche in BW PU as a sought-after wall. However, a weakness to Stealth Rock and 4x weakness to Electric, lack of recovery outside of Rest and Leftovers, notable passivity, and a mediocre support movepool unfortunately keep Mantine from achieving any true potential.</p>",
    "sets": {
      "Special Wall": {
        "description": "<p>Rest is for healing off any damage and status, and Sleep Talk is for making sure Mantine isn't too passive while asleep. Scald is the go-to STAB option for inflicting burn, and the fourth moveslot has multiple options. Toxic wears down foes more quickly than what a burn can achieve but can be redundant with Scald's burn. Hidden Power Electric is also a good pick for properly countering Water-types that Mantine wants to switch into such as Swanna and Golduck, and Air Slash is good as a secondary STAB move for hitting Grass-types that may switch in such as Maractus and Vileplume. The EVs are to avoid a 2HKO from Life Orb Swanna's Hurricane, with the rest of the investment thrown into Defense to better take hits from threats like Monferno and Mawile.</p> <p>Stealth Rock is a huge factor into whether or not Mantine can safely switch into attacks. As such, hazard control Pokemon like Tentacool and Natu are important partners to consider to make sure Stealth Rock doesn't ruin Mantine's ability to tank hits from Swanna and Monferno. Mantine also folds to Electric- and Rock-type attacks from common threats like Zebstrika and Rampardos, so switch-ins like Stunfisk and Torterra can also make for good partners. Mantine does have excellent role compression in that it is a switch-in for Monferno, Swanna, and Simisear, so teammates such as Bronzor, Marowak, and Vileplume that get beaten by them really appreciate having Mantine on the team. Mantine does heavily struggle with keeping itself healthy as well, so partners like Audino that can pass Wish and Vileplume that can heal status with Aromatherapy are also good. Physically defensive teammates such as Bronzor and Vileplume also pair well with Mantine, as they can absorb the physical attacks pointed at Mantine while Mantine takes all of the special attacks and spread burns.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 231726, "username": "Akir"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 567483, "username": "Bella"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Volbeat": {
    "overview": "<p>Volbeat enjoys a small niche in PU thanks to its access to Prankster and its wide range of support moves such as Encore and weather moves like Sunny Day, making it the most consistent weather setter in the tier. However, its passiveness, weakness to Stealth Rock, and average bulk means that it only finds consistent success on weather teams.</p>",
    "sets": {
      "Support": {
        "description": "<p>U-turn is the only damage-dealing attack on the set, as the best thing Volbeat can do for offense is to switch out to a Pokemon that is better equipped for dealing damage. Roost and Encore are also staples on the set, as they allow Volbeat to stall and ease the damage from its Stealth Rock weakness and break stall itself by locking opposing Pokemon into either setup or passive moves. The last move is specific to what your team needs; usually it will be the appropriate weather move that its teammates need, but Thunder Wave and Toxic are also fine options for the very few instances that Volbeat finds itself on a different kind of team. EVs are put into Defense to get the most out of Volbeat's coveted resistances to Ground- and Fighting-type moves, and the Relaxed nature is chosen to make it as slow as possible to make U-turn move last more consistently.</p> <p>Volbeat is a mainstay staple of dedicated weather teams in PU to the point of it being almost mandatory, as it is the best mid- to late-game weather setter by a large margin. It also gives valuable access to moves like Encore that weather teams can use to stallbreak more consistently. Pokemon that take advantage of weather such as Victreebel and Golduck can make the most of the weather Volbeat sets. Alternative setters like Relicanth and Onix are good partners for secondary setters that also have light defensive synergy with Volbeat, as Volbeat can take the Ground-type attacks thrown at them while Onix and Relicanth can take the Fire- and Flying-type attacks thrown at Volbeat. It can also work outside of a weather team in a dedicated support role on semi-stall teams, but very few teams have the space to spare for Volbeat and its specific set of tools. Even Pokemon like Jumpluff, which would not usually be considered for a defensive support role, almost always fill Volbeat's role better on teams without weather.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 231726, "username": "Akir"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 567483, "username": "Bella"}]}, {"name": "Grammar checked by", "members": [{"user_id": 527276, "username": "Techno"}]}]}
  },
  "Vanilluxe": {
    "overview": "<p>With the combination of Choice Scarf to outrun the entire unboosted metagame and a surprisingly powerful Ice Beam that even notably damages Pokemon that resist it, Vanilluxe makes a niche for itself in PU as a revenge killer and potential sweeper. Unfortunately, the notable lack of good coverage moves, lack of a truly good ability, weaknesses to common priority moves and Stealth Rock, and the fact that Vanilluxe is walled heavily by common Pokemon like Klang keep it from being a premier threat in PU.</p>",
    "sets": {
      "Choice Scarf": {
        "description": "<p>Ice Beam has no drawbacks and will be chosen almost all the time, especially since even Pokemon that resist it like Sneasel have the chance to be 2HKOed with entry hazards. The rest of the moveset is dedicated to niche coverage. Hidden Power Ground is the preferred option in the second moveslot for hitting Steel- and Fire-types like Klang and Monferno, while Hidden Power Fire exchanges the coverage on Fire-types for being able to hit Bronzor. Flash Cannon can be used to hit other Ice-types like Articuno, and Frost Breath can pierce through potential Special Defense boosts from Pokemon like Calm Mind Duosion. Weak Armor is the preferred ability for the potential Speed boost and the fact that hail is unviable, but Ice Body can be chosen if the Defense drop from Weak Armor is unappealing. A Modest nature is chosen for the extra power as the Choice Scarf already makes Vanilluxe faster than the entire unboosted metagame.</p> <p>Entry hazards go an exceptionally long way in letting Vanilluxe sweep, very often being the difference between a 3HKO and a 2HKO, so reliable hazard setters like Dwebble and Stunfisk are key teammates. Vanilluxe also hates hazards itself, so hazard control from Pokemon like Tentacool or Natu can help keep Vanilluxe healthy throughout the match. Vanilluxe is commonly walled by Steel-types like Klang and Bronzor, Water-types like Tentacool, and specially defensive walls like Audino, so partners like Marowak, Zebstrika, and Monferno are excellent choices for dealing with those walls. Vanilluxe also appreciates being switched in safely with Klang's Volt Switch and Jumpluff's U-turn. Vanilluxe doesn't offer much in the way of synergy itself, but wallbreakers like Stoutland and Simisear do appreciate Vanilluxe inviting in and weakening down common Steel- and Water-type switch-ins like Mawile and Frillish. Vanilluxe also tends to threaten out or take out certain threats like Vileplume and Stunfisk, so Pokemon that enjoy having those walls taken care of like Zebstrika and Monferno appreciate having it on their team.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 231726, "username": "Akir"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 567483, "username": "Bella"}]}, {"name": "Grammar checked by", "members": [{"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Shiftry": {
    "overview": "<p>Shiftry is an offensive powerhouse with a varied and effective toolkit to punch holes through the opposing team. Shiftry can leverage both a Choice Specs and a Swords Dance set to wallbreak, with both having appropriate pros and cons and largely different list of counters. Choice Specs has immediate power with few Pokemon willing to consistently switch into it, while the Swords Dance set can break through walls while still keeping offensive pressure with Sucker Punch. Because both of these sets are both strong and have mostly different counters, opponents can sometimes struggle to consistently answer Shiftry. However, Shiftry's low defenses means that it is vulnerable to getting knocked out quickly. Shiftry also tends to suffer under offensive pressure since its Speed is just short of being effective and reliance on Sucker Punch can only get Shiftry so far. It also doesn't help that Shiftry's biggest offensive counter, Monferno, is the most used Pokemon in PU by far.</p>",
    "sets": {
      "Choice Specs": {
        "description": "<p>Dark Pulse is Shiftry's go-to STAB attack as a spammable option with excellent coverage and no drawbacks. Leaf Storm is significantly stronger than Dark Pulse, but it drops Shiftry's Special Attack after use, making it less spammable than Dark Pulse. The choice of Hidden Power coverage depends on what you need to hit; Hidden Power Ground hits Fire-types like Monferno and Rapidash, but Hidden Power Fire hits Bronzor specifically. Both hit Klang as well, but Ground is the preferred option since Bronzor can still take some damage from Dark Pulse whereas Monferno switches in relatively safely otherwise. The last moveslot varies on what the team needs as well; Focus Blast hits Dark-type switch-ins like Zweilous and Scraggy hard, but Sucker Punch gives a priority option for potentially finishing off an otherwise problematic offensive threat. If Shiftry is loaded up with Sucker Punch, Shiftry will prefer a Mild nature.</p> <p>It is important to remember that Choice Specs Shiftry is at its strongest the first turn it is out on the field. Shiftry's power and coverage before locking into a move is intimidating and sometimes difficult to handle, but as soon as Shiftry does select a move, then the opponent can switch into the appropriate answer. Some threats, like Monferno and Audino, can also feel fairly safe switching in regardless of what is chosen. Because of this, having a strong defensive backbone to counter the incoming threats is key. Pokemon like Stunfisk and Tentacool are excellent choices for this, as they can reliably switch in on threats like Monferno and even set up entry hazards to help Shiftry's job of wallbreaking. Shiftry also loves having a teammate that can make good use of all of the holes it has burned through the opposing team, so Pokemon that can sweep after Shiftry has done its job such as Swanna, Trick Room Beheeyem, and Golduck are excellent choices. Swanna in particular is a good partner, as it also checks Shiftry's nemesis, Monferno.</p>"
      },
      "Swords Dance": {
        "description": "<p>This set trades the immediate power of Choice Specs in favor of setting up with Swords Dance for more versatility, stronger coverage options, and stronger priority. Swords Dance boosts Shiftry's respectable base 105 Attack to new heights, allowing it to threaten both offensive and defensive teams alike. STAB Sucker Punch after a Swords Dance can OHKO a large list of offensive threats like Zebstrika while also giving Shiftry a priority option. Nature Power in BW turns into Earthquake, giving Shiftry some much-needed coverage to hit Poison- and Steel-types like Arbok and Klang that would wall Shiftry otherwise. Life Orb is the preferred item for giving Shiftry more power overall, especially for Seed Bomb, but Dark Gem is also useful for an emergency boosted Sucker Punch to fend off a potential sweep.</p> <p>While Shiftry is fast enough to be a good wallbreaker, it is not fast enough to be a consistent sweeper. Base 80 Speed is good, but Shiftry's nemesis Monferno sits just out of reach at base 81. This means that Shiftry, even at +2, is best viewed from a wallbreaking perspective. Defensive partners for Shiftry such as Stunfisk can take hits directed at Shiftry and set up hazards to push offensive threats within Sucker Punch range. Shiftry also appreciates partners that can take on walls like Bronzor and Vileplume that Shiftry can't overcome, such as Monferno and Simisear.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 231726, "username": "Akir"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 567483, "username": "Bella"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Golduck": {
    "overview": "<p>Golduck makes a home for itself in PU by either being a threatening Calm Mind sweeper or a potent Choice Scarf revenge killer. Golduck's ability Cloud Nine also lets it be a notable check to the rare weather team by shutting down the entire strategy. However, Golduck's stats are middle-of-the-road even in PU, leaving the SubCM set easily revenge killed and the Choice Scarf set easily walled, and faces stiff competition from Pokemon like Swanna and Duosion for similar roles.</p>",
    "sets": {
      "SubCM": {
        "description": "<p>Substitute blocks status and absorbs damage, giving Golduck opportunities to safely set up Calm Mind. Golduck after one Calm Mind is also decently bulky. Leftovers is the recommended item to hopefully give Golduck more opportunities to set up Substitute, but Life Orb is also excellent for making the most out of the Calm Mind boosts at the cost of being put on a timer. Scald is the preferred STAB option for the added utility of a potential burn, making setup easier and making this set useful beyond sweeping or wallbreaking. Ice Beam hits Dragon- and Grass-types like Zweilous and Vileplume. Cloud Nine is useful for turning rain and sun off against the occasional hyper offensive weather teams, letting it outspeed and KO threats like Victreebel.</p> <p>Golduck appreciates being brought in safely via Volt Switch or U-turn, so partners like Zebstrika and Jumpluff are excellent choices that also patch up Golduck's Speed. Paralysis support also goes a long way towards helping Golduck, so teammates like Stunfisk and Clefairy make for excellent picks as well. Golduck is weak to common Electric- and Grass-type attacks from threats like Zebstrika and Simisage, so counters such as Stunfisk and Zweilous can also help Golduck. Lastly, Golduck is great for luring in and weakening Grass-types and other kinds of walls such as Vileplume and Tentacool, so Pokemon that appreciate those walls being gone such as Torterra or Simisear are also good choices for rounding out a team.</p>"
      },
      "Choice Scarf": {
        "description": "<p>Hydro Pump is the stronger of the two STAB options but has lower accuracy than Surf does. Ice Beam hits Grass- and Dragon-types such as Maractus and Zweilous that can wall Golduck otherwise. Hidden Power Electric is Golduck's only meaningful way to hit Water-types like Swanna and Tentacool. Focus Blast is a strong hit against would-be walls like Scraggy or Audino and a heavier hit on Zweilous than Ice Beam. Encore is also a strong option for the last moveslot, as with a Choice Scarf, Golduck is able to lock common setup sweepers like Huntail, Torterra, and Duosion into an unfavorable move, but it comes at the cost of Golduck having to switch out as well. Cloud Nine is critical for this set, as it lets Choice Scarf Golduck outspeed and revenge kill common weather abusers such as Victreebel and even other Golduck.</p> <p>Golduck tends to get stopped by specially defensive walls such as Klang, Audino, and Zweilous, so wallbreakers like Monferno and Stoutland make for good partners. Golduck also tends to bring in Grass- and Electric-types, so defensive teammates like Bronzor and Stunfisk can allow Golduck to pivot out safely. This set heavily appreciates entry hazards to make revenge killing easier, so Pokemon that can reliably set up Stealth Rock or Spikes such as Marowak and Maractus pair well with Golduck. Choice Scarf Golduck fits well on offensive teams that require a revenge killer that can cover weather teams, so slower offensive Pokemon like Beheeyem and Life Orb Mawile love having Golduck around.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 231726, "username": "Akir"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 567483, "username": "Bella"}]}, {"name": "Grammar checked by", "members": [{"user_id": 572981, "username": "Aera"}]}]}
  },
  "Abra": {
    "overview": "<p>With the combination of Magic Guard and Focus Sash, Abra finds a niche as an all-purpose utility Pokemon that is able to survive any attack once. This allows it to work as a trump card and revenge kill most threats in a pinch. Abra also outspeeds a large portion of the tier, including some important threats like Monferno and Arbok. However, without the Focus Sash, it has paper-thin defenses and its Speed still falls short of outspeeding most of the fastest threats in the tier like Swanna and Zebstrika.</p>",
    "sets": {
      "Revenge Killer": {
        "description": "<p>The combination of Magic Guard and Focus Sash is critical for this set to function, since it allows Abra to survive all single-hit attacks at least once. Signal Beam gives it excellent coverage to hit threats like Beheeyem and Shiftry, which is cannot hit with just Psychic. Abra has a flexible choice of three good options for the last two moveslots. Thunder Wave is handy for disabling any fast threats like Swanna and Jumpluff that might cause trouble otherwise. Knock Off is great for disrupting foes by getting rid of valuable items like Eviolite from common switch-ins like Bronzor, and with Magic Guard, Abra can actually afford to come in and use Knock Off potentially multiple times in a single match. Alternatively, Encore is good for endlessly forcing support and setup Pokemon into using unfavorable moves such as Duosion and Beheeyem into Calm Mind and Bronzor into Stealth Rock.</p> <p>Abra finds a home on offensive teams that tend to not have enough of a defensive backbone to take on multiple varied threats and therefore need a blanket check to most Pokemon thrown their way. It is unique in that it does not provide much to a team in terms of basic offensive and defensive synergy, but it instead fills its shortcomings in roles. Abra's ability to disable fast threats like Swanna and Simisear by paralyzing them with Thunder Wave or revenge killing them is extremely appreciated by wallbreaking and sweeping teammates like Monferno and Huntail that might be revenge killed otherwise. Abra's ability to further disable walls like Bronzor and Stunfisk with Encore and Knock Off also makes them considerably easier to overcome, which is adored by partners like Torterra and Zebstrika that are walled otherwise. It also desperately wants to avoid taking any unnecessary damage, so partners that can bring it in safely like Klang and Jumpluff are great choices. Common priority users such as Shiftry and Monferno frequently attempt to finish Abra off after its Focus Sash is broken, so switch-ins like Klang and Stunfisk also make for good partners to absorb those attacks.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 231726, "username": "Akir"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 567483, "username": "Bella"}]}, {"name": "Grammar checked by", "members": [{"user_id": 527276, "username": "Techno"}]}]}
  },
  "Machoke": {
    "overview": "<p>Machoke takes on the surprising role of a physical tank for stall teams in BW PU. Machoke's physical bulk after investment and Eviolite, combined with its lack of common physical weaknesses, lets it take many neutral hits; Pokemon such as Monferno and Torterra will even struggle to 4HKO it. On top of that, Machoke is a lot less passive than other walls like Klang; even without investment, Machoke's Dynamic Punch still hurts common threats like Scraggy and Monferno. However, Machoke's lack of common resistances, inability to use Leftovers, and reliance on Rest for recovery cuts deeply into its longevity.</p>",
    "sets": {
      "Physical Tank": {
        "description": "<p>Rest keeps Machoke healthy, and Sleep Talk is extra useful for Machoke due to it potentially saving some Dynamic Punch PP. No Guard Dynamic Punch gives Machoke a reliable STAB option with the added bonus of causing confusion. The last moveslot can be any of three options: Toxic is excellent for spreading chip damage, Ice Punch hits Flying-types like Jumpluff, and Thunder Punch hits Tentacool and Golduck as well as other Flying-types like Swanna that are not to weak to Ice. With 44 Speed EVs, Machoke outspeeds uninvested base 50 Speed Pokemon such as Audino.</p> <p>Machoke's unique toolkit is best used on stall teams that can support it with options like Heal Bell and Wish via Pokemon like Articuno and Audino. In return Machoke can absorb some of the physical attacks thrown at them. Machoke also appreciates partners such as Zweilous and Bronzor that can patch up its Psychic- and Flying-type weaknesses. Machoke also loves entry hazard support, as Dynamic Punch's confusion forces many switches, so teammates like Bronzor and Tentacool that can set entry hazards while patching up Machoke's weaknesses are great choices. Machoke boasts rare-but-valuable resistances to Dark- and Rock-type attacks, so common stall staples like Duosion and Articuno also love having it around to take hits from threats like Shiftry and Rampardos.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 231726, "username": "Akir"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 567483, "username": "Bella"}]}, {"name": "Grammar checked by", "members": [{"user_id": 327515, "username": "Zrp200"}, {"user_id": 384270, "username": "autumn"}]}]}
  },
  "Tentacool": {
    "overview": "<p>Tentacool makes a niche for itself as the best choice for the ever-coveted role of entry hazard control in PU. With good bulk, a wide variety of support options, and most importantly, Rapid Spin, it finds itself as a top pick for many different kinds of teams. Tentacool also packs important resistances to common offensive types such as Water- and Fire, reliably absorbing those hits with its great Special Defense. However, it is very passive on the topic of damage, it can't reliably heal itself outside of the shaky and uncommon Rest, and its middling Defense leaves it vulnerable to wallbreakers such as Stoutland, Arbok, and Torterra. The final irony of Tentacool is that it's a victim of its own success: its Toxic Spikes are often swept up by the common sight of an opposing Tentacool.</p>",
    "sets": {
      "Rapid Spinner": {
        "description": "<p>Rapid Spin is the primary reason to use Tentacool, as it is extremely valuable in a tier with very few options for entry hazard control. Toxic Spikes adds pressure to foes, especially key threats like Audino and Beheeyem, and Scald gives Tentacool a chance to burn Pokemon that can't be poisoned or would be worse off with an Attack drop like Klang and Stoutland. The last moveslot can be a huge variety of options, with the most common one being Knock Off to eliminate the valuable items of walls such as Klang and Audino. Sludge Bomb can be used as an alternative STAB move that can poison foes, and Hidden Power Electric allows Tentacool to be a much more surefire counter to Water-types such as Swanna. Rest is the last recommended option, since Tentacool cannot heal itself reliably any other way, but the difficulty of BW Sleep makes this option the least popular. This set also invests fully into Special Defense to maximize Tentacool's ability to tank special hits, but more investment into Defense is also a valid option to better checks certain physical threats such as Monferno.</p> <p>Tentacool's entry hazard control prowess is appreciated by just about every Pokemon, but some that come into play a lot or are particularly weak to Stealth Rock,like Zebstrika and Articuno, respectively, appreciate its support more. Tentacool appreciate teammates that can cover its weaknesses to common types like Electric and Ground, such as Stunfisk and Torterra. Tentacool also cannot heal itself, so a partner such as Audino that can pass a Wish can go a long way if your gameplan is based around longer games. Tentacool's passive nature also lets in many slow setup Pokemon such as Duosion and Scraggy, so a Pokemon that can deal with these kinds of sweepers such as Jumpluff is a good idea. Lastly, it is important to play Tentacool with an eye for keeping it around for as long as possible so it can Rapid Spin throughout the match.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 231726, "username": "Akir"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 567483, "username": "Bella"}]}, {"name": "Grammar checked by", "members": [{"user_id": 527276, "username": "Techno"}]}]}
  },
  "Rapidash": {
    "overview": "<p>Rapidash outspeeds most of the tier and boasts a ton of power through its great Attack and a strong STAB move in Flare Blitz. Combine that with great coverage and access to healing via Morning Sun, and Rapidash becomes a versatile and fast threat in PU that can outspeed key threats like Simisage, Swanna, and Dodrio. However, Rapidash can get worn down easily by entry hazards and chip damage from its own attacks, gets consistently stopped by walls such as Frillish and Machoke, is outsped by even faster threats like Zebstrika and Purugly, and faces stiff competition by other Fire-types like Monferno and Simisear, so the horse can sometimes struggle to find solid success in PU.</p>",
    "sets": {
      "Physical Attacker": {
        "description": "<p>Morning Sun increases longevity by healing off recoil damage as well as other chip damage from sources like entry hazards. Wild Charge is for hitting Water-types such as Swanna and Huntail, and Drill Run is for hitting Rock-types such as Rampardos as well as Stunfisk. Will-O-Wisp can be used over Drill Run as an additional utility option for hindering threats like Dodrio and Stoutland as well as spreading chip damage, but the loss of Drill Run makes taking on certain walls like Stunfisk much harder. Leftovers is the preferred item to shore up Rapidash's constant chip damage and increase longevity, but Life Orb can also be used to secure certain 2HKOs on key threats like Frillish.</p> <p>Rapidash tends to collect a lot of recoil damage from Flare Blitz and Wild Charge, so additional chip damage from sources like entry hazards can make a significant difference in how long Rapidash is in play. Following that, entry hazard control such as Tentacool and Natu make for good partners. Rapidash also attracts common Water-type switch-ins like Frillish as well as certain other physical walls like Stunfisk and Machoke, so Pokemon that counter these threats like Vileplume, Torterra, and Beheeyem also work as teammates. Rapidash excels in clearing out Grass- and Steel-types like Vileplume and Bronzor, so Pokemon like Zebstrika and Gabite also appreciate having it around. Rapidash also tends to coax in common revenge killers such as Zebstrika and Jumpluff, so having walls of your own in the wings such as Stunfisk and Bronzor can also be useful.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 231726, "username": "Akir"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 567483, "username": "Bella"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny004"}]}]}
  },
  "Magikarp": {
    "overview": "<p>There is no excuse for using Magikarp, at all. All comedy value in using it disappeared by about 1998.</p>",
    "comments": "<h3>Other Options</h3> <p>You could maximize HP at the expense of Speed or Attack to turn OHKOs into 99% chance for OHKOs. You also might as well maximise Special Attack, if only to troll people rating your team. Alternatively, you could just evolve it into Gyarados. Or use Feebas or any of the vast number of Water types available. Seriously, there's like a hundred of them and you picked this one?</p> <h3>Checks and Counters</h3> <p>Stop using an Old Rod.</p>",
    "sets": {"One Speed, One Gear, One Moveset": {"description": "<h4>Moves</h4> <p>With the nerf of Explosion and Selfdestruct in Gen 5, Magikarp lost out in its main use as a sacrifice to switch in when the opponent goes boom. However, it still hits a respectable 426 with Jolly and Choice Scarf attached, so you might be able to revenge-kill a low-health Dragonite or something. Putting Sandstorm up would do exactly the same thing for all the damage you're dishing out, but let's work with what we have here.</p> <h4>Set Details</h4> <p>Focus Sash is good for making Flail work, especially to lead with. The other items are only mentioned because they are all just about as useful overall.</p>"}},
    "credits": {"writtenBy": [{"user_id": 384, "username": "cookie"}], "teams": [{"name": "Grammar checked by", "members": [{"user_id": 241023, "username": "dhelmise"}]}]}
  },
  "Chinchou": {
    "overview": "<p>Chinchou is a Pokemon that looks far better on paper than it is in PU. Chinchou's resistances to Water, Ice, and Fire and an incredibly valuable immunity to Electric-type attacks are all highly sought-after in PU, and Chinchou's impressive Specially Defensive sets the stage for a successful wall that is seen in bulkier teams. However, its extreme passiveness, its general lack of support options for helping its team, and desperate wish for a fifth moveslot all make for a Pokemon that can be challenging but rewarding to fit on teams.</p>",
    "sets": {
      "Special Wall": {
        "description": "<p>Rest and Sleep Talk keeps Chinchou healthy without making Chinchou too passive, and Scald is the primary STAB option for spreading burn against normally safe switch-ins like Torterra. The last option is a choice for an Electric-type STAB attack; Volt Switch is good for keeping momentum up, and Discharge is for spreading paralysis against Pokemon like Stoutland and beating Water-types Chinchou is meant to wall such as Swanna. Discharge can also be run instead of Sleep Talk, with that tradeoff being making Chinchou deadweight when asleep but having the ability to threaten Pokemon such as Golduck that Chinchou attempts to wall. Volt Absorb is chosen as the ability because Electric-immune Pokemon that aren't thwarted by common coverage options on Zebstrika are exceedingly rare.</p> <p>Chinchou needs a lot of support such as Aromatherapy from Vileplume and Wish from Audino in order to remain healthy throughout the match. It also needs teammates such as Torterra and Bronzor to take the Ground- and Grass-type attacks frequently thrown at it. Chinchou's resistances to Water and Fire and its immunity to Electric-type attacks are heavily appreciated by partners like Stunfisk, Klang, and Swanna. Chinchou tends to invite in many setup sweepers such as Scraggy and Duosion, so Pokemon that can take care of them such as Jumpluff and Articuno are good picks.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 231726, "username": "Akir"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 567483, "username": "Bella"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Natu": {
    "overview": "<p>In a tier with little entry hazard control, Natu has surprising bulk and excellent utility in Magic Bounce. Natu is able to reliably switch in on many common hazard setters such as Torterra and Maractus and can even wall them thanks to its good typing and good bulk with Eviolite. Natu even has support options like U-turn to keep momentum going for offense teams. However, Natu does struggle against many other hazard setters such as Stunfisk and Glalie, who have super effective STAB against it, and its bulk is just not good enough to make it a generally reliable wall.</p>",
    "sets": {
      "Utility": {
        "description": "<p>Night Shade is Natu's go-to offensive option, as Natu's middling Special Attack tend to accomplish less than the consistent 100 damage from Night Shade. U-turn is to pivot Natu out and keep momentum up for the team. The last slot is almost always used for Toxic to wear down common switch-ins like Stunfisk and Stoutland, but Reflect can be used to make Natu wall threats like Monferno and Marowak more reliably and give more light utility to the rest of the team.</p> <p>Natu finds a consistent home on more offensive teams that want hazard control and a pivot but don't want to invest in a slower Rapid Spin option. As a result, Natu can slot itself into VoltTurn teams with the likes of Zebstrika and Klang fairly easily. Natu's slow U-turn is also excellent for bringing in wallbreakers like Stoutland. Stunfisk also makes for a good partner for Natu; Stunfisk can wall Electric-types like Zebstrika or Emolga who would threaten Natu and Natu can wall Grass-Types like Torterra, which threaten Stunfisk.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 231726, "username": "Akir"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 567483, "username": "Bella"}, {"user_id": 481576, "username": "roxie"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}, {"user_id": 511181, "username": "Rose"}]}]}
  },
  "Unown": {
    "overview": "<p>Some may prefer Alakazam as their Psychic-type of choice, probably thanks to its magnificent moustache, or perhaps the slow and ugly Reuniclus. However, Unown does the job of a Psychic-type just as well this generation as always. To be blunt, it is <strong>unknown</strong> why one would choose not to use Unown. Unchanged from DPP, it deals with most of the OU threats that would otherwise roam freeunless it gets hit first, of course.</p>",
    "comments": "<h3>Other Options</h3> <p>You can literally run any type of Hidden Power! Unown has an option for every type and its power knows no limitsother than being hit by any other opposing Pokemon, of course. Unown wouldn't want to learn any other moves anyway, because it does not need them. Hidden Power is all it needs to wreak havoc, cause despair, and spread fear amongst the opposing team. Using stronger moves such as the boring Fire Blast, Hydro Pump, or Draco Meteor would make Unown a little girl who can't fight and likes to risk a miss that could cost you a game. Unown is no gambler.</p> <h3>Checks and Counters</h3> <p>Literally nothing can counter or check almighty Unown, as it is a force to be reckoned with by all teams. Well, nothing unless you face that rare opposing Pokemon that's either faster, has a damaging move, resists its Hidden Power type, has an existent Special Defense stat, has a priority move, or is just not Unown.</p>",
    "sets": {
      "The Most Almighty Unown": {
        "description": "<h4>Moves</h4> <p>This is Unown's master moveset, perfect and beautiful in its design. Unown is the most versatile of all Pokemon; it can choose from any of the three suggested Hidden Powers to counter the great powerhouses of OU. The damage calculations below showcase its might against the puny Dragon-types and other plebeians weak to Hidden Power Ice:</p> <ul> <li>252+ SpA Choice Specs Unown Hidden Power Ice vs. 0 HP / 0- SpD Tornadus: 76.25 - 90.3%</li> <li>252+ SpA Choice Specs Unown Hidden Power Ice vs. 4 HP / 0 SpD Haxorus: 77.55 - 91.83%</li> <li>252+ SpA Choice Specs Unown Hidden Power Ice vs. 12 HP / 0 SpD Breloom: 97.72 - 115.15%</li> <li>252+ SpA Choice Specs Unown Hidden Power Ice vs. 252 HP / 0 SpD Salamence: 104.56 - 123.85%</li> <li>252+ SpA Choice Specs Unown Hidden Power Ice vs. 252 HP / 0 SpD Gliscor: 122.03 - 144.63%</li> <li>252+ SpA Choice Specs Unown Hidden Power Ice vs. 0 HP / 4 SpD Landorus: 127.89 - 151.72%</li> <li>252+ SpA Choice Specs Unown Hidden Power Ice vs. 0 HP / 0 SpD Landorus-T: 129.15 - 152.97%</li> </ul> <p>It can even OHKO Dragonite after Stealth Rock damage! Unown becomes so powerful that it is also able to crush many other dangerous OU threats, swiftly dispatching them to the depths of Hell they should have never left, should it choose Hidden Power Fighting:</p> <ul> <li>252+ SpA Choice Specs Unown Hidden Power Fighting vs. 4 HP / 0 SpD Magnezone: 65.95 - 78.01%</li> <li>252+ SpA Choice Specs Unown Hidden Power Fighting vs. 0 HP / 0 SpD Mamoswine: 71.46 - 84.21%</li> <li>252+ SpA Choice Specs Unown Hidden Power Fighting vs. 4 HP / 0 SpD Tyranitar: 99.41 - 118.12%</li> <li>252+ SpA Choice Specs Unown Hidden Power Fighting vs. 4 HP / 0 SpD Magikarp: 145.05 - 170.87%</li> <li>252+ SpA Choice Specs Unown Hidden Power Fighting vs. 0 HP / 0- SpD Cloyster: 147.71 - 174.27%</li> </ul> <p>But that's not all! The third option, being the powerful STAB Psychic-type Hidden Power, will tear to shreds other important opposing forces, such as:</p> <ul> <li>252+ SpA Choice Specs Unown Hidden Power Psychic vs. 0 HP / 0 SpD Venusaur: 84.38 - 100.33%</li> <li>252+ SpA Choice Specs Unown Hidden Power Psychic vs. 0 HP / 0 SpD Keldeo: 86.06 - 102.16%</li> <li>252+ SpA Choice Specs Unown Hidden Power Psychic vs. 0 HP / 4 SpD Terrakion: 86.06 - 102.16%</li> <li>252+ SpA Choice Specs Unown Hidden Power Psychic vs. 252 HP / 0 SpD Conkeldurr: 87.43 - 103.38%</li> <li>252+ SpA Choice Specs Unown Hidden Power Psychic vs. 0 HP / 0- SpD Cloyster: 110.78 - 130.7%</li> <li>252+ SpA Choice Specs Unown Hidden Power Psychic vs. 4 HP / 0 SpD Gengar: 123.66 - 146.56%</li> <li>252+ SpA Choice Specs Unown Hidden Power Psychic vs. 12 HP / 0 SpD Breloom: 146.21 - 172.72%</li> <li>252+ SpA Choice Specs Unown Hidden Power Psychic vs. 4 HP / 0 SpD Magikarp: 217.58 - 256.04%</li> <li>252+ SpA Choice Specs Unown Hidden Power Psychic vs. 4 HP / 0 SpD Toxicroak: 235.06 - 277.92%</li> </ul> <p>After all, who doesn't want almighty and powerful sweepers like Magikarp OHKOed? Unown is a solid staple in any team and it will not deceive you. The ability to OHKO Toxicroak with its superior Psychic-type powers will come in handy when you have to face the troublesome rain teams that plague the current metagame. All of the OU powerhouses will, ultimately, fall to Unown's might.</p> <h4>Set Details</h4> <p>You could run a Timid nature, but Unown does not need to be fast; remember, it has the superb Hidden Power at its disposal. However, the all-powerful Unown will probably have just one chance to attack before it faints, so it may need the Speed against faster foes.</p> <h4>Team Options</h4> <p>Because Dark-types are mean to Unown and will try to Crunch its feeble body, it's generally a good idea to team it up with bullies such as Conkeldurr or Terrakion, who will gladly take the attack and answer with a brutal, well-thrown Superpower. Lucario, the OU Fighting-type outcast, will gladly help Unown as well with its powerful ExtremeSpeed. The mean Ghost-types of OU, Gengar and Jellicent, as well as the hyped-up but less powerful Psychic-types, Alakazam and Reuniclus, may try to hit Unown with a pesky Shadow Ball. Therefore it is recommended to pair Blissey or Chansey with Unown, as they will gladly take Shadow Ball. Steel-types that can deal with these opponents are also helpful, such as Skarmory and Heatran, as they are friendly towards Unown and respect it enough to protect its life and vanquish its foes. Unown will enjoy any type of support your team can give: Stealth Rock, Spikes, Toxic Spikes, Light Screen, Reflect, and spreading paralysis help it shine and let it do its work. In fact, it's highly recommended that you enact your support before letting Unown unleash its fury because, as they say, you'd be better safe than sorry. Unown might not look like the fittest member of your team, but it is a really solid Pokemon that's remained throughout the years because it's never had to change at all! Unown's great power, coverage and movepool allow it to sweep unprepared teams that are unaware of its might.</p>"
      },
      "The Swift Death": {
        "description": "<h4>Moves</h4> <p>Whilst this set does not grant the incredible damage Choice Specs Unown can deal, being the speediest in the current metagamefaster than those living in the modern worldis key to success. The most powerful Unown can outspeed several foes with a Timid nature such as Jolly Gliscor, Jolly 176 Speed Jirachi, and Adamant Salamence. Should you choose to take the more powerful choice and try a Modest nature instead, almighty Unown can still outspeed Jolly Gyarados, Timid Heatran, Jolly Breloom and Jolly Cloyster, allowing it to utterly destroy these enemies with the Hidden Power of choice.</p> <h4>Set Details</h4> <p>There are no more options for this set, for Unown runs Hidden Power and only Hidden Power, its pride does not allow it to try other moves. It won't need any other attacks, anyway, as it's the perfect revenge killer and will just need to switch in and deal huge damage to its foe, then run away while a teammate deals with the remnants of the opposition.</p> <h4>Team Options</h4> <p>This set requires the same teammates and help as The Most Almighty Unown, so you'd better read the additional comments there to see how can you utilize the utmost power of Unown.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 161822, "username": "Joim"}], "teams": [{"name": "Grammar checked by", "members": [{"user_id": 109385, "username": "aurora"}, {"user_id": 32149, "username": "Zystral"}]}]}
  },
  "Ursaring": {
    "overview": "<p>With sky-high Attack, excellent coverage, and respectable bulk, Ursaring makes a home for itself in PU as a menacing stallbreaker. It can also utilize its ability Quick Feet to become a sweeper as well. However, it can still be stopped by common walls like Frillish or Bronzor despite its Attack, and its slow Speed keeps it from reaching its full potential as a sweeper or wallbreaker.</p>",
    "sets": {
      "RestTalk": {
        "description": "<p>Return is the go-to STAB option for being the most powerful with no drawbacks, but Body Slam can be used for its paralysis chance against potential threats like Mawile and Swanna at the cost of some power. The last move can be one of two options: Sleep Talk is the better of the two options to prevent Ursaring from being too passive while asleep from Rest, while Crunch allows Ursaring to hit Ghosts-types like Frillish and the rare Banette that are immune to its Normal-type STAB moves.</p> <p>This Ursaring set is an excellent stallbreaker, so it best finds a home on slower teams that might have a difficult stall matchup otherwise. Ursaring is weak to Fighting-type attacks, so partners that can absorb them such as Frillish and Duosion are appreciated. Ursaring also appreciates partners to heal off its sleep from Rest, so clerics like Vileplume can be a great choice. Ursaring also tends to struggle against Ghost-types if it isn't running Crunch such as Frillish and Banette, so having a way to deal with them such as Pursuit from Sneasel and Stoutland can go a long way. This Ursaring set also excels in taking neutral special attacks from threats like Zebstrika and Swoobat, so partners like Stunfisk and Torterra that can soak up physical attacks make for good choices and an excellent defensive core.</p>"
      },
      "Quick Feet": {
        "description": "<p>This set leverages Quick Feet to outspeed past base 110 Speed Pokemon like Jumpluff by using a Toxic Orb. Facade is the chosen attack thanks to its hefty 140 Base Power after the Toxic Orb activates. Close Combat and Crunch both round out Ursaring's coverage by letting it push through key defensive threats like Klang and Frillish, respectively. The last moveslot is a choice between two excellent choices; Protect guarantees that Toxic Orb activates without taking damage, but Swords Dance can be used to push Ursaring's Attack even higher and go for the sweep at the cost of potentially taking damage during the setup turn and therefore having less of a chance to sweep. Jolly is the mandatory nature due to it pushing Ursaring's Speed high enough to outspeed almost every Pokemon in the tier except very fast threats like Zebstrika and Purugly.</p> <p>This Ursaring set needs to prioritize avoiding any and all chip damage when possible, as due to the mandatory damage from the Toxic Orb, too much chip damage can easily result in an easy revenge kill or Toxic Orb knocking Ursaring out outright. As a result, partners like Tentacool and Natu are key for keeping entry hazards far away from Ursaring. Other options, such as Healing Wish from Mr. Mime, can keep Ursaring healthy throughout the match even if Healing Wish gets rid of the poison from the Toxic Orb. Quick Feet Ursaring can struggle to break through dedicated walls even with Swords Dance such as Bronzor, so entry hazards from partners like Stunfisk or dedicated wallbreaking from teammates like Simisear can be a huge help to pulling off the sweep. Ursaring can be revenge killed by threats like Zebstrika and Choice Scarf Swanna, so partners like Frillish, Stunfisk, and Klang that can switch into these threats are especially appreciated. Stunfisk in particular is a great partner for its ability to spread paralysis to make sure Ursaring does outspeed everything it needs to while still checking Zebstrika.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 231726, "username": "Akir"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 567483, "username": "Bella"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Banette": {
    "overview": "<p>Banette's Ghost-typing allows it to be one the incredibly rare spinblockers in PU. It also has a great Attack stat, making it a powerful wallbreaker and one of the best Pursuit trappers. This combination gives Banette its niche; it comes in on a Rapid Spin from something like Tentacool or an attempted Magic Bounce from Natu, and it then punishes them switching out with Pursuit. Unfortunately, Banette's lackluster defenses and terrible movepool means that it is worn down easily and Pursuit trapped itself while also being easily walled by Dark- and Normal-types.</p>",
    "sets": {
      "Spinblocker": {
        "description": "<p>Pursuit is the main niche of this set, allowing Banette to trap entry hazard control targets like Tentacool and Natu. The last two moveslots are highly customizable but end up feeling similar. Trick is useful for disabling walls like Bronzor and Audino, but only if Banette has a Choice Band. Sucker Punch and Shadow Sneak are both priority options, with Sucker Punch being stronger but Shadow Sneak not having to rely on foes attacking to work. Lastly, Return is a spammable attack with decent power that can hit common Normal-types like Stoutland, Audino, and Ursaring that Banette otherwise can barely touch. While all of the options are interchangeable, the recommended set for most scenarios is Shadow Claw + Pursuit + Trick + Sucker Punch due to having the most utility and power available. Ghost Gem is also a good option for bluffing a Choice Band and hitting hard with Shadow Claw and Shadow Sneak, but it makes Pursuit much weaker. Frisk allows additional scouting that can come in handy, and 44 Speed EVs is just enough to outspeed uninvested foes with base 70 Speed such as Natu, with the rest of the EVs thrown into HP for general bulk.</p> <p>Banette is best utilized as a spinblocker, so teammates that set entry hazards such as Dwebble, Maractus, and Stunfisk are a must. Banette also struggles to break through Normal- and Dark-type walls like Audino and Scraggy, so partners like Monferno and Torterra that can handle them is recommended. Banette also invites in a lot of Dark- and Normal-types, so Pokemon like Klang that can take a hit from those can also be key. Banette also has additional synergy with Fighting-types like Monferno and Machoke due to the fact that it is adept at getting rid of Psychic-types like Duosion and Beheeyem with either its STAB moves or Pursuit, while the Fighting-types beat the Normal-and Dark-types that usually wall Banette.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 231726, "username": "Akir"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 567483, "username": "Bella"}]}, {"name": "Grammar checked by", "members": [{"user_id": 527276, "username": "Techno"}]}]}
  },
  "Glalie": {
    "overview": "<p>Glalie's toolkit of Spikes, Taunt, and great offensive coverage gives it a niche in PU as an offensive Spiker. Ice Beam and Earthquake make for excellent coverage, hitting everything in the tier at least neutrally except fringe cases like Bronzor and notably forcing out the tier's most popular hazard control options in Natu and Tentacool. Glalie can also add to its utility list by running Taunt, meaning that it can set up its Spikes while blocking foes' hazards and other support moves. Glalie can even use Explosion to make itself an effective suicide lead. Its stats let it down though, as it is still too weak to threaten out most walls like Frillish and too slow to outspeed key Pokemon like Monferno. Glalie is also generally outshined by fellow Spikes users Maractus and Dwebble, which generally have better and broader support options like useful resistances and Stealth Rock, respectively.</p>",
    "sets": {
      "Offensive Spikes": {
        "description": "<p>Spikes is the main selling point of the set, as setting Spikes in PU is particularly potent thanks to the general rarity of entry hazard control. Glalie's coverage of Earthquake allows it to hit common Ice-type switch-ins such as Klang and Monferno. Glalie also can fight off the standard hazard control options of Natu and Tentacool with Ice Beam and Earthquake, respectively. Taunt is useful for hindering walls that stop Glalie such as Bronzor as well as other hazard setters like Dwebble and Rampardos. Explosion can be run over Earthquake for a huge attack before fainting, which can also be useful for stopping a Rapid Spin from Tentacool but comes at the cost of losing key coverage to Fire- and Steel-types such as Rapidash and Mawile. The item choices are equal in viability; Leftovers allows Glalie to stay around for longer and have more chances to set Spikes, but Focus Sash makes it a competent suicide lead.</p> <p>Glalie's ability to force out Natu and Tentacool while setting up Spikes is best appreciated by more offensive teams that utilize wallbreakers and sweepers such as Stoutland, Beheeyem, and Huntail. Glalie invites in common Fire- and Steel-type threats such as Monferno and Klang, so partners that can comfortably switch in such as Stunfisk are excellent choices. Glalie is capable of threatening out Ground- and Dragon-types such as Marowak and Zweilous, so teammates like Zebstrika and Swanna that are stopped by them love the support Glalie brings to the team. Glalie is also fairly adept at luring in and weakening common Ice-type switch-ins such as Klang and Rapidash with coverage moves or Explosion, so Pokemon that arhate these switch-ins such as Swanna and Simisear appreciate the additional offensive synergy.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 231726, "username": "Akir"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 567483, "username": "Bella"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Huntail": {
    "overview": "<p>Huntail is a fearsome setup sweeper in PU with the help of Shell Smash. The boost from Shell Smash gives Huntail just enough Speed to outrun the entire unboosted metagame, and the dual boosts to Attack and Special Attack make Huntail a truly difficult Pokemon to stop late-game that can shred weakened teams. However, Huntail can struggle to find a time to set up in the face of offensive pressure from threats like Zebstrika and Stoutland and is relatively weak and slow without the Shell Smash boost.</p>",
    "sets": {
      "Shell Smash": {
        "description": "<p>Huntail can utilize a special or physical Shell Smash set with relatively similar viability. The special set utilizes Hydro Pump and is the stronger of the two options overall and is therefore the recommended set, but Waterfall's perfect accuracy and only slightly worse damage output make the physical set a good choice as well. It is also worth mentioning that although Surf might seem like an obvious third choice, it is weaker than Waterfall and Hydro Pump and therefore inferior to the previous options. Ice Beam is critical coverage for threats like Maractus and Vileplume that would be able to soak up Huntail's STAB Water-type attacks otherwise, regardless of if Huntail is physical or special. The last move choice depends on Huntail's orientation; Hidden Power Electric gives Huntail a strong option for breaking through Tentacool and Frillish and rounds out Huntail's coverage perfectly, while Crunch gives physical Huntail great neutral coverage while also hitting Frillish hard. White Herb is the preferred item due to it restoring Huntail's defenses after a Shell Smash, but Life Orb is also very useful for pushing Huntail's power further and allowing it to hit certain benchmarks, such as Waterfall always 2HKOing Bronzor and Hydro Pump getting a chance to OHKO Bronzor. Water Veil is the chosen ability to avoid burns, but Swift Swim can be used on dedicated rain teams to let Huntail outspeed everything in the tier after a Shell Smash. Modest is always chosen as the nature on special variants, but if you are running a physical set, then Naughty is chosen to allow Huntail to use Ice Beam to the fullest while also not taking any extra damage from common priority moves like Mach Punch and Sucker Punch.</p> <p>Huntail at +2 Speed is able to outspeed the entire unboosted tier but fails to outrun common Choice Scarf users like Swanna, Arbok, and Monferno. Because of this, having strong walls to fall back on to stop them like Klang and Stunfisk can be essential for keeping Huntail around. Huntail can also struggle to get a good opportunity to set up, so a Volt Switch from Klang, a U-turn from Monferno, or a Healing Wish from Mr. Mime can all be ways to position Huntail well enough to get a Shell Smash off. Huntail can also struggle to break through certain Grass- and bulky Steel-types like Maractus and Klang, so wallbreakers that threaten these two like Simisear and Marowak can make great partners. Huntail also tends to force out bulky Water-types like Tentacool and Frillish, so Pokemon like Swanna and Monferno are excellent choices for utilizing the holes that Huntail punches through the opponent's team.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 231726, "username": "Akir"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 567483, "username": "Bella"}]}, {"name": "Grammar checked by", "members": [{"user_id": 643347, "username": "marillvibes"}, {"user_id": 297659, "username": "deetah"}]}]}
  },
  "Rampardos": {
    "overview": "<p>Rampardos is a famous example of a glass cannon, and its role in PU is no different. With sky-high Attack, Mold Breaker, and Stealth Rock, it takes on the role of a suicide lead that specializes in brutally beating down the other lead and entry hazard removal competition. Mold Breaker is what sets Rampardos up to be a strong lead by giving it the ability to negate Sturdy, Magic Bounce, and Levitate. This means that common hazard setters and control options such as Dwebble, Natu, and Bronzor are beaten handily by Rampardos. Even other hazard removal options such as Tentacool are scared out by the threat of Rampardos's incredible Attack. However, its low defenses and Speed mean that it struggles in any other role.</p>",
    "sets": {
      "Lead": {
        "description": "<p>Stealth Rock gives Rampardos's teammates strong early-game momentum via entry hazard damage. Head Smash and Stone Edge both work as good STAB options, with Head Smash being the stronger of the two. Its recoil damage breaks Focus Sash early, but it can be used to KO Rampardos after Focus Sash is used to freely switch in a teammate while also being significantly stronger than Stone Edge. Earthquake hits plenty of threats such as Bronzor, Tentacool, and Mawile for incredible damage. Ice Beam is chosen specifically for Torterra as it is 2HKOed even without further investment.</p> <p>Rampardos is most at home on offense and hyper offense teams where its use as a suicide lead is heavily appreciated. It does not need much support as a suicide lead, since its role is to set up Stealth Rock and then do as much damage as possible before fainting. However, it is excellent at drawing in Ground-types and other bulky physical walls like Stunfisk, Bronzor, and Torterra, so partners like Monferno and Gabite heavily appreciate their counters being worn down. Another good option for a partner is Maractus, since it can absorb the Water- and Grass-type attacks thrown at Rampardos and set up Spikes to complement the Stealth Rock that Rampardos sets up.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 231726, "username": "Akir"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 567483, "username": "Bella"}]}, {"name": "Grammar checked by", "members": [{"user_id": 527276, "username": "Techno"}]}]}
  },
  "Purugly": {
    "overview": "<p>Purugly finds itself in a difficult position in PU, as it is walled by a slew of very common walls in the format. Stunfisk, Klang, Mawile, Bronzor, and even walls like Vileplume and Duosion all can wall poor Purugly. Purugly is also outsped by the commonly seen Zebstrika and the less common Sneasel. Even with all of this in mind, Purugly is able to find a niche as a talented revenge killer and a bane of hyper-offense teams in the tier thanks to its good Speed and even better selection of priority moves.</p>",
    "sets": {
      "Revenge Killer": {
        "description": "<p>Fake Out lets Purugly rack up chip damage against offensive threats such as Monferno and Zebstrika with little fear of retribution. Return is used for finishing off any weakened threats that are slower than Purugly, whereas Sucker Punch can be used to finish off any threats that are faster such as Zebstrika. U-Turn provides Purugly with the ability to comfortably pivot to teammates. Thick Fat is chosen as the ability over Defiant because there aren't many opportunities in the tier to take advantage of Defiant, especially since the only Intimidate user is Mawile and that walls Purugly regardless of Attack boosts. Silk Scarf is the default item to boost the power of Fake Out and Return, but Leftovers can also be chosen to give Purugly surprising longevity when paired with Fake Out.</p> <p>While Purugly is fast and has plenty of priority for finishing off weakened Pokemon, it is not particularly strong. As such, targets for Purugly such as Zebstrika and Choice Scarf Swanna need fairly significant chip damage before Purugly can comfortably take them down. Entry hazards from Pokemon such as Torterra, Dwebble, Glalie, and Maractus are all highly appreciated. Some of these Pokemon, like Torterra, are more notable partners for their ability to switch into common Purugly counters such as Stunfisk. Purugly also needs the help of strong wallbreakers like Monferno and Simisear that can take down the common walls such as Klang and Bronzor that stop Purugly. Purugly excels in taking on hyper offense teams, in particular weather teams, but tends to struggle against defensive teams. On top of that, using Fake Out carelessly can get Purugly paralyzed via Stunfisk's Static or let in a threat like Ursaring or Beheeyem relatively safely, so it is best to not immediately use Fake Out at every given opportunity and instead go for the safer U-Turn or Return depending on the situation. Purugly also makes effective VoltTurn cores with the likes of Zebstrika, Monferno, and Natu.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 231726, "username": "Akir"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 567483, "username": "Bella"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Bronzor": {
    "overview": "<p>With incredible bulk and even better defensive typing with much sought-after resistances to types such as Psychic, Ground, and Normal, Bronzor stands as one of the best multipurpose walls in the format. Being able to single-handedly wall common threats that are difficult to answer such as Beheeyem, Stoutland, Zebstrika, Torterra, is something that most teams heavily appreciate. However, Bronzor's lack of healing outside of Rest and notable passiveness makeit an occasional momentum sink.</p>",
    "sets": {
      "Support Wall": {
        "description": "<p>Psywave is Bronzor's only way to do any considerable damage despite its significant unreliability. Toxic builds up chip damage against common foes that can't quickly KO Bronzor such as Torterra and deters Pokemon like Beheeyem from setting up. Rest is a somewhat reliable healing move because many Pokemon fail to 2HKO Bronzor. Stealth Rock is usually preferred for the fourth moveslot, as Bronzor is one of the most reliable setters of it. Alternatively, Sleep Talk helps with Bronzor's passiveness while it's asleep from Rest, but it should only be used on teams with another Stealth Rock setter. The EVs make sure that Bronzor cannot be 2HKOed by a Thunderbolt + Overheat combination from Magnet Zebstrika after Stealth Rock. An alternative EV spread of 252 HP / 68 Def / 188 SpD with a Calm nature can be used to avoid the aforementioned move combination from Fire Gem Zebstrika, but the significant loss of physical bulk can be costly. Levitate is always chosen as the ability, as avoiding Spikes damage is crucial to keeping Bronzor healthy enough to tank the plethora of hits it is expected to take.</p> <p>Bronzor is weak to Fire-type attacks from the likes of Monferno and Simisear, so Pokemon that resist them such as Frillish, Swanna, and Tentacool make for good partners. Bronzor has a ton of useful resistances to high-value types, such as Ground, Flying, Grass, Psychic, and Ice. These resistances are heavily appreciated by Pokemon that are weak to them such as Stunfisk, Scraggy, Frillish, Machoke, and Zweilous. Clerics, such as Audino and Jumpluff, are excellent for helping Bronzor stay healthy by getting rid of sleep from Rest. Bronzor's passiveness tends to bring in setup threats like Scraggy and Duosion, so teammates like Encore Jumpluff and Roar Zweilous that can shut down those threats are also appreciated. As a final note, Bronzor is a rare Normal-resistant Pokemon that is not weak to Fighting-type moves, making it one of the better switch-ins to Stoutland and therefore a mainstay on bulkier teams.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 231726, "username": "Akir"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 567483, "username": "Bella"}]}, {"name": "Grammar checked by", "members": [{"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Gabite": {
    "overview": "<p>Gabite is blessed with just enough good merits in all the right places to carve a niche for itself in PU. 82 Speed is perfect for outspeeding common wallbreakers like Stoutland, Shiftry, and Monferno. Ground typing is also highly sought after for the Electric immunity and resistance to Rock, and the combination of Ground and the rare Dragon typing means that Gabite isn't weak to the common Grass- and Water-type attacks in PU. STAB Earthquake with a secondary STAB option in Outrage makes for excellent coverage as well. However, Gabite finds itself commonly walled by tanks such as Bronzor and Torterra, and the lack of recovery mixed with only above-average bulk mean that Gabite can struggle to achieve its full potential in either an offensive or defensive capacity.</p>",
    "sets": {
      "Offensive": {
        "description": "<p>Outrage and Earthquake make for a potent STAB combination that is only resisted fully by Bronzor. Pokemon such as Klang that can take an Outrage do not like Earthquake, and others such as Torterra that can take Earthquake do not quite like taking damage from Outrage. Dragon Claw is a Dragon-type STAB option that will not lock Gabite into it like Outrage does. The last slot goes largely unused thanks to Outrage and Earthquake hitting everything much harder than most of Gabite's coverage options, but Stone Edge is recommended as another option for Flying- and Fire-types. Fire Blast might seem like a tempting option for Bronzor, but even with a neutral nature, Fire Blast's mediocre damage is not enough to break through Bronzor so it is simply better to accept being walled and move on. Choice Band and Choice Scarf are equally viable and the choice between the two will come down to what your team needs: Choice Band makes Gabite into a wallbreaker, and Choice Scarf will make it into a revenge killer.</p> <p>Gabite hits hard but does not have the bulk to take multiple hits itself, so defensive partners that can take the Ice-type moves pointed at it, like Klang, are good. Klang can also pivot into Gabite safely with Volt Switch, making it an excellent partner overall. Gabite also needs a way to get around Bronzor, so a teammate that beats it like Scraggy or Simisear can be good as well. Gabite also heavily appreciates entry hazards to make it even harder to switch into or to ease its potential sweep, so hazard setters like Mawile, Glalie, and Rampardos can be great options. Gabite also appreciates hazard removal in the form of Tentacool and Natu, as Gabite can't heal off the chip damage, but Gabite's resistance to Stealth Rock means Gabite doesn't take as much as others. The Choice Band set is great at weakening opposing teams for a sweep, so a sweeper like Huntail or Monferno can fit alongside Gabite well. The Choice Scarf set is also best utilized for revenge killing certain threats like Monferno and Zebstrika, so slower wallbreakers like Stoutland or Swanna can make for good partners.</p>"
      },
      "Defensive": {
        "description": "<p>Gabite's toolkit of a Ground typing, Eviolite, Rough Skin, Roar, and Stealth Rock give it the ability to be a decently bulky tank. With EV investment and Eviolite, Gabite can prove to be a decent switch-in against physical threats like Monferno while also switching into some Electric-types like Stunfisk. Stealth Rock is always useful, and Gabite's ability to force switches through Roar and bluffing a potential Choice Band set mean that it gets plenty of opportunities to set them up. Earthquake is the go-to STAB move, and Dragon Claw is useful for hitting threats that are immune to or resist Earthquake. The last slot is versatile: Roar is highly valued in the metagame for phazing setup threats like Scraggy and racking up entry hazard damage, whereas Toxic is good for residual damage on whatever switches in. Phazing is uncommon in PU, so it is generally chosen over Toxic, but Gabite can run both Roar and Toxic by using one over Dragon Claw at the risk of being much more passive to certain threats like Jumpluff and Swanna. The Speed EVs are for outspeeding maximum Speed neutral nature Rampardos and base 60 Speed Pokemon with the rest into bulk, but the Speed can be increased to 148 EVs to outspeed Naive maximum Speed Rampardos.</p> <p>Defensive Gabite lives in the shadow of Stunfisk and Torterra largely, but the Speed gives Gabite its niche. As such, defensive Gabite finds a home on more offensive teams that do not want a heavy momentum sink like Stunfisk or Torterra can be but still want a reliable Stealth Rock setter. Gabite has a crippling weakness to Ice-type moves as well as strong neutral special attacks, so a good partner to make a defensive core would be Klang or Tentacool. Gabite also checks Rock-types and Zebstrika, so Pokemon that appreciate having a teammate that can handle either, such as Swanna, make for good partners as well. Finally, Spikes setters such as Glalie and Tentacool also make good teammates, as the Spikes and Toxic Spikes damage makes Gabite's Roar much more potent.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 231726, "username": "Akir"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 567483, "username": "Bella"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Zebstrika": {
    "overview": "<p>Zebstrika is one of the premier pivots of the metagame. With the highest Speed stat in the tier and access to Volt Switch, it finds itself nestled on just about any offensive team. Overheat also allows it to threaten the plethora of Grass-types that can usually switch in to resist its Electric-type attacks. However, Zebstrika does lack power, as it has a mediocre base 80 Special Attack and no way of boosting it outside of items, making it struggle to beat specially defensive Pokemon like Audino and Scraggy. Zebstrika is also fairly one-dimensional, lacking any sort of variability other than the user's choice of Hidden Power and item, meaning that any player should know what to expect from team preview.</p>",
    "sets": {
      "Offensive Pivot": {
        "description": "<p>Thunderbolt is Zebstrika's primary STAB move, while Volt Switch allows it to quickly pivot out. Overheat, as mentioned above, hits Grass-types like Maractus and Shiftry. Hidden Power Ice allows Zebstrika to hit Ground-types, namely Gabite, Torterra, and Stunfisk. Magnet can be used over Life Orb to help Zebstrika's longevity, but the power loss on Hidden Power Ice is especially notable. Expert Belt is a middle-ground option to keep power on Hidden Power Ice, but it lacks the stronger power on neutral Thunderbolt. Fire Gem gives Zebstrika a one-time boost to Overheat, allowing it to break through would-be checks like Vileplume and Torterra more easily. Lightning Rod is Zebstrika's preferred ability, since it allows it to switch into and check other Electric-types while boosting its Special Attack, though Sap Sipper can be used instead to better check Jumpluff and Simisage and potentially swap into them in a pinch.</p> <p>Zebstrika's Speed is its main draw to be used on offensive teams, so slower and hard-hitting wall-breakers, like Choice Band Torterra, Beheeyem, and even some faster ones like Choice Specs Shiftry, can help greatly weaken teams to the point of Zebstrika being able to clean. Grass- and Water-types, such as the aforementioned Torterra, Maractus, and Swanna, can help handle Ground-types while also appreciating Zebstrika's ability to weaken other Grass- and Water-types with Overheat and Thunderbolt, respectively. Many Choice Scarf Pokemon can still outspeed Zebstrika despite its high Speed, the most common being Golduck, Gabite, and Dodrio. Pokemon that can switch into and check these threats, such as Vileplume, Torterra, and Klang, greatly help Zebstrika. Pokemon with U-turn, like Choice Scarf Monferno, Swoobat, and Purugly, also help form nice momentum cores with Zebstrika.</p> <h4>Checks and Counters</h4> <p><strong>Specially Defensive Pokemon</strong>: Pokemon like Audino and Scraggy can easily switch into Zebstrika's attacks and heal the damage off. Even other walls, like specially defensive Vileplume, can take several Overheats with little issue due to the Special Attack drop.</p> <p><strong>Choice Scarf Pokemon and Priority Moves</strong>: No Pokemon in the metagame outspeed Zebstrika naturally, but with its poor bulk, any Pokemon that outspeed it with a Choice Scarf can threaten it, such as Golduck, Mr. Mime, and Gabite. It is also threatened by priority moves from the likes of Shiftry, Purugly, and Monferno.</p> <p><strong>Ground-types</strong>: Any Ground-type prevents Zebstrika from spamming its Volt Switch easily, and Zebstrika is threatened back by their STAB moves. Torterra can sometimes live a Hidden Power Ice depending on its Special Defense investment and whether or not it has a Yache Berry. Stunfisk also can take a Hidden Power Ice pretty easily and threaten to KO Zebstrika in return.</p> <p><strong>Passive Damage</strong>: Due to Zebstrika's high Speed and Volt Switch, the main way for most teams to beat it is by whittling it down through passive damage. Stealth Rock and Spikes are both key in this, limiting Zebstrika's opportunities to switch in as much as possible. Status conditions also limit Zebstrika's longevity, so it has to be wary of switching into Pokemon like Klang, Mawile, and Frillish in case it gets hit by Toxic or burned by Scald or Will-O-Wisp.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 265399, "username": "SergioRules"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 231726, "username": "Akir"}, {"user_id": 567483, "username": "Bella"}]}, {"name": "Grammar checked by", "members": [{"user_id": 594478, "username": "ken"}]}]}
  },
  "Swoobat": {
    "overview": "<p>The stars aligned in an interesting way for Swoobat, giving it one of the most unique niches in PU. Swoobat utilizes its Unaware ability to shut down setup threats like Beheeyem and Monferno and 2HKOes most foes by ignoring any defensive stat boosts. Combined with excellent base 114 Speed and great STAB coverage, Swoobat becomes a menace to offense and balance teams alike and, as a result, is an incredible asset to offense teams. However, even with all of this, it can still come up short. Swoobat outspeeds almost all of the tier but fails to outspeed Zebstrika and Sneasel, two threats that shut it down with their STAB attacks. On top of that, Swoobat's low natural Special Attack means that it can struggle greatly against bulkier teams.</p>",
    "sets": {
      "Choiced Disruptor": {
        "description": "<p>Psychic does solid neutral damage to a large portion of the tier, making it a strong spammable option. Signal Beam is also crucial, bypassing the defensive boosts of Calm Mind Beheeyem and Duosion while also hitting Dark-types such as Shiftry. U-turn allows Swoobat to slot effectively into offensive VoltTurn teams. The last slot is versatile and depends on what threats Swoobat needs to shut down for your specific team. Air Slash stops Scraggy from safely setting up, whereas Heat Wave stops Shift Gear Klang. Trick is also an option for shutting down any wall that might try and stop Swoobat, such as Audino or Articuno.</p> <p>Swoobat is an effective anti-setup option for offensive teams, beating setup sweepers such as Beheeyem thanks to Unaware. Swoobat also checks Monferno especially well, as it is one of the few checks that does not fear a boosted Mach Punch. However, despite having Choice Specs, Swoobat is a subpar dedicated wallbreaker. Pairing Swoobat with other wallbreakers such as Choice Band Monferno and Swords Dance Torterra is an excellent decision, as both of those choices threaten common Swoobat counters like Audino, while Swoobat can use U-turn to safely bring them in. Another factor to consider is that Swoobat's Speed is just barely not enough; as such, having priority, a bulky teammate, or a Choice Scarf user to outspeed possible threats like Zebstrika is necessary. Mach Punch Monferno and Stunfisk are potential options. Swoobat also must choose between beating Scraggy or Klang, so having a partner like Swanna or Stunfisk that can threaten what Swoobat can't will also be beneficial. Remember that Swoobat's primary job is to beat setup threats and threaten frail and slower offensive Pokemon, not to wallbreak.</p> <h4>Checks and Counters</h4> <p><strong>Specially Defensive Pokemon</strong>: Threats such as Audino and Articuno can consistently[B] [/B]wall Swoobat throughout a match. Even Scraggy and Klang can wall Swoobat if it lacks the proper coverage move. All of these Pokemon do fear the rare Trick, but not enough to dissuade them from coming in whenever Swoobat is out.</p> <p><strong>Faster Pokemon</strong>: Swoobat is exceptionally fast, but Pokemon such as Zebstrika and Sneasel are even faster and easily revenge kill it with their STAB moves. Similarly, common Choice Scarf users such as Dodrio and Golduck can also outspeed and prey upon Swoobat. Very[B] [/B]few of these fast threats want to switch into Swoobat directly, but when they are able to come in safely, they easily[B] [/B]force Swoobat out.</p> <p><strong>Dark-types</strong>: Psychic is usually a safe move to lock into, but a Dark-type such as Shiftry or Scraggy can make use of the opportunity to set up or threaten Swoobat. Dark-types do have to fear Swoobat's coverage, however, as even a U-turn can be crippling to Shiftry.</p> <p><strong>Priority Attacks</strong>: Threats such as Purugly can ignore Swoobat's superior Speed and KO it[B] [/B]with priority attacks like Fake Out and Sucker Punch. It is also noteworthy that most offensive users of Sucker Punch, such as Shiftry, can cleanly[B] [/B]KO Swoobat with it after just one round of Stealth Rock damage.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 231726, "username": "Akir"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 265399, "username": "SergioRules"}, {"user_id": 468904, "username": "SBPC"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}]}]}
  },
  "Audino": {
    "overview": "<p>Audino is a premier special wall in PU thanks to its good bulk, great support movepool, and fantastic ability in Regenerator. Audino's access to important support options like Heal Bell and Wish also make it a cornerstone of many stall and bulky offense teams. However, Audino's Normal typing leaves it with little to no meaningful resistances in the tier, making its ability to wall harder than some other choices like Bronzor. Audino is also perilously passive, meaning that many offensive Pokemon such as Monferno or Beheeyem can set up or outright KO it with little fear.</p>",
    "sets": {
      "Specially Defensive": {
        "description": "<p>Wish and Protect are key for this set as they provide healing not just for Audino but for all of Audino's team as well. Audino's last move is dependent on what the rest of the team needs. Heal Bell is the most common, as the ability to rid Audino and its teammates of status is extremely valuable in PU. Encore can lock opposing Pokemon into unfavorable moves, such as setting a redundant entry hazard or forcing a setup Pokemon like Scraggy or Beheeyem to continually set up, which gives Audino's teammates a few turns to respond to that threat. Toxic is by far the least popular option, but can still be handy for racking up chip damage that Audino can struggle to do otherwise.</p> <p>Audino is able to tank many special hits, but can struggle against physical attacks. As such, Pokemon such as Stunfisk or Bronzor make good teammates. Audino only has one weakness to Fighting, so Pokemon such as Frillish or Duosion, which can tank Fighting-type attacks are also good partners. All of these Pokemon also heavily appreciate the Wish and Heal Bell support that Audino provides. Audino is also passive and invites in many Pokemon that might try to set up and win, so phazers such as Zweilous or fast Encore Pokemon such as Jumpluff can also make for good teammates.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 231726, "username": "Akir"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 567483, "username": "Bella"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny004"}]}]}
  },
  "Maractus": {"sets": {"Spikes": {}}},
  "Dwebble": {
    "overview": "<p>Dwebble finds its niche as one of the tier's premier leads, particularly as a suicide entry hazard lead. Dwebble's unique ability to set up both Stealth Rock and Spikes is valuable, and with Sturdy and Custap Berry it is able to reliably set both. In a metagame with very limited removal, having both hazards set up is extremely effective. However, Dwebble's utility is extremely limited outside of this role, and if Dwebble loses Sturdy for whatever reason, Dwebble's ability to set any hazards at all is severely diminished.</p>",
    "sets": {
      "Suicide Lead": {
        "description": "<p>Stealth Rock and Spikes are the main focus of this set and should be used as soon and as much as possible. Ideally Dwebble takes enough damage to activate Sturdy while setting Stealth Rock, which then activates Custap Berry to give near-priority to Spikes right before it goes down. Rock Blast threatens out opposing leads that also have Focus Sash or Sturdy such as Rampardos and opposing Dwebble to potentially stop them from setting up their own entry hazards. The last slot is flexible and based on what utility the rest of the team would appreciate most. Toxic and Knock Off can cripple defensive switch-ins such as Stunfisk and Bronzor, respectively, and Shell Smash is effective at threatening out common hazard removal from Tentacool or Natu. Endure can act as a backup Sturdy in case Dwebble needs another way to activate Custap Berry.</p> <p>Frillish and Banette are notable teammates for blocking Rapid Spin, thus keeping Dwebble's hazards around. Other teammates like Zebstrika and Monferno that force a lot of switches are also excellent partners for making full use of the entry hazards to quickly chip down their counters of Stunfisk and Swanna.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 231726, "username": "Akir"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 265399, "username": "SergioRules"}, {"user_id": 567483, "username": "Bella"}]}, {"name": "Grammar checked by", "members": [{"user_id": 535530, "username": "Gangsta Spongebob"}, {"user_id": 297659, "username": "deetah"}]}]}
  },
  "Scraggy": {
    "overview": "<p>Scraggy is one of the most dangerous setup sweepers in the tier, packing an unresisted STAB combination, great special bulk, and Bulk Up, threatening virtually every team and cementing itself as a top-tier Pokemon. Scraggy's bulk and resistance to Stealth Rock are useful tools that help it check many special attackers like Zebstrika, Beheeyem, and Vanilluxe and set up in front of defensive staples like Stunfisk, Bronzor, Audino, Klang, and Mawile. However, even though Scraggy is a difficult Pokemon to stop once it has boosted a few times and threatens an immense portion of the meta, it can still come up short due to it relying on Shed Skin to decrease its Rest turns, as it is vulnerable to being whittled down while sleeping, leaving it unable to sweep. Its Attack is lackluster before Scraggy sets up, letting checks such as Swanna and Torterra can easily come in on it with little risk.</p>",
    "comments": "<h3>Other Options</h3> <p><strong>Fighting-types</strong>: Monferno and Machoke can take Scraggy's hits with relative ease and threaten it back with their Fighting-type STAB moves, 2HKOing it even after a Bulk Up boost. However, they have to be careful of being continuously damaged if they lack recovery.</p> <p><strong>Flying-types</strong>: Swanna is able to check Scraggy with its strong Hurricane and access to Roost. Pelipper has the same tools in Hurricane and Roost, but it trades Swanna's power and speed for bulk, allowing it to directly switch into Scraggy more easily. Dodrio can't switch into it directly due to its frailty, but its Brave Bird can OHKO Scraggy. Jumpluff is another offensive check that can't switch in directly because of its lack of recovery and weakness to Stealth Rock, but it can deal with Scraggy with Flying Gem-boosted Acrobatics or Encore, which prevents Scraggy from snowballing. Choice Specs Swoobat 2HKOs Scraggy with Air Slash; however, it needs to be wary of Crunch.</p> <p><strong>Torterra and Vileplume</strong>: Both of these Grass-types make use of their great physical bulk and access to Swords Dance and consistent recovery to set up alongside and outlast Scraggy. Choice Band Torterra can hit Scraggy really hard even after a Bulk Up, but it is more prone to getting worn down.</p>",
    "sets": {
      "Bulk Up": {
        "description": "<p>Bulk Up turns Scraggy into a potential sweeping demon, boosting its initially lackluster Attack stat and decent Defense to alarming levels. Drain Punch is the go-to Fighting-type STAB move, as it provides a secondary source of recovery while having decent damage output once boosted. Crunch is Scraggy's Dark-type STAB move of choice, boasting decent damage output and a way of hitting Fighting resistances at least neutrally. Rest gives it the longevity it needs to accumulate Bulk Up boosts. Shed Skin is the ability of choice as it allows Scraggy to act as a status absorber and potentially wake up sooner after it uses Rest. 20 Speed EVs let it outspeed base 50 Pokemon such as Klang, Audino, and Mawile.</p> <p>Scraggy serves as a great sweeper on stall and balance teams with its great sweeping potential and ability to check to Dark- and Psychic-types. It also proves its worth on offensive teams, being able to clean or weaken foes while acting as a special sponge. Beheeyem is a good partner for Scraggy due to its ability to handle Fighting-types; additionally, Scraggy can use Beheeyem checks such as Klang, Mawile, and Bronzor as set up fodder. Scraggy appreciates faster teammates like Choice Scarf Dodrio and Purugly that can pressure some of Scraggy's most common checks. Choice Scarf Dodrio also offensively checks Fighting-types and Vileplume, Pursuit traps Swoobat, which can heavily damage Scraggy with STAB Air Slash, and baits in Steel-types for Scraggy. On the other hand, Purugly can check threats like Swanna with Fake Out and Return while using U-turn to bring Scraggy on the field more easily, as it baits in Steel-types that Scraggy can set up on; furthermore, it isn't weak to Stealth Rock, which affords it more longevity than Dodrio.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 476616, "username": "LpZ"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 231726, "username": "Akir"}, {"user_id": 265399, "username": "SergioRules"}]}, {"name": "Grammar checked by", "members": [{"user_id": 277988, "username": "dex"}]}]}
  },
  "Duosion": {
    "overview": "<p>With the combination of reliable recovery, Eviolite, and, most notably, Magic Guard, Duosion makes for a prime option as a wall and bulky setup sweeper. Unlike many other setup sweepers, Duosion can check many walls such as Bronzor, Maractus, and Tentacool and use them as setup fodder without fear of moves like Toxic and Leech Seed. However, Duosion has to watch out for Knock Off, as it relies heavily on its Eviolite to tank hits while setting up, especially if not running Acid Armor. Duosion can also do significant damage without the need to set up with its naturally high Special Attack, making it both an offensive and defensive threat. The immunity to hazards allows Duosion to switch in and take hits more safely, which is very valuable due to the lack of hazard removal in the tier. However, Duosion faces large competition with Beheeyem, which can serve as a bulky setup sweeper without having to rely on Eviolite for bulk, allowing it to hold Leftovers or expand its versatility on offensive sets with items like Choice Specs and Life Orb. Duosion also suffers from four-moveslot syndrome, making it choose between a worse matchup against physical wallbreakers like Stoutland and Marowak or being hard-walled by Dark-types like Shiftry and Zweilous.</p>",
    "sets": {
      "Bulky Calm Mind": {
        "description": "<p>Magic Guard is Duosion's best attribute, as it leaves Duosion unable to be stalled out by moves like Toxic or be worn down by entry hazards, which are otherwise very common answers for walls and bulky setup sweepers. Psyshock gives Duosion a better matchup against special walls like Audino and opposing Calm Mind users like Golduck, though Psychic can be used instead for slightly more power overall. Acid Armor pairs well with Calm Mind while sweeping to better take hits from physical wallbreakers like Rampardos and Stoutland. Signal Beam is also an option, as it gives Duosion a way to hit Dark-types like Shiftry and Zweilous and improves its matchup against opposing Psychic-types like Beheeyem. Before setting up, Duosion can utilize its immunity to hazards throughout the match to switch in against offensive and defensive foes alike such as Monferno and Bronzor, respectively. Passive foes like Maractus and Frillish are great options for Duosion to set up against once threats like Scraggy have been KOed. Fighting-types like Monferno and Machoke are solid teammates, since they can take out Dark-types for Duosion. Finally, Duosion's durability makes it a great option for stall teams, on which other walls like Frillish, Audino, and Bronzor are common teammates.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 355061, "username": "UberSkitty"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 265399, "username": "SergioRules"}, {"user_id": 231726, "username": "Akir"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Swanna": {
    "overview": "<p>Swanna is a premier threat in PU, utilizing its good Speed and incredible offensive movepool to threaten a huge portion of the tier, including key threats such as Monferno, Torterra, Stunfisk, and Marowak. STAB-boosted Scald and Hurricane shred the tier, with very few Pokemon able to fully weather the storm. Base 98 Speed also puts Swanna above most of the tier, and its Flying typing means that it is immune to Spikes and resists the tier's most common priority of Mach Punch. Swanna can also boast a strong Choice Scarf set for consistent revenge killing that also resisting the common Mach Punch. However, due to its lack of setup moves and only above-average Special Attack, it can sometimes find itself relying on heavy chip damage or lucky Hurricane confusion in order to break through defensive Pokemon like Klang. Swanna's weakness to Stealth Rock also can force it to use Roost more than it ideally wants.</p>",
    "sets": {
      "SubRoost": {
        "description": "<p>Substitute and Roost allow Swanna to avoid status and large hits while healing off any damage it takes. Swanna can also find a lot of opportunities to set up Substitute against common threats like Tentacool and Choice-locked Monferno. Scald + Hurricane is also a great combination, as both have a 30% chance inflict burn and confusion, respectively. This particular STAB combination is really only fully resisted by the exceedingly rare Chinchou, meaning that Swanna is largely free to spam the appropriate move without much need for coverage. Leftovers is the go-to choice for this set to add to the longevity of this set, but Life Orb can also be useful for additional damage.</p> <p>Swanna is fast but can still be revenge killed by the likes of Zebstrika and other faster threats, so backup switch-ins such as Stunfisk make for good teammates. It also prefers to have Stealth Rock off the field, so entry hazard removal like Tentacool and Natu are also excellent partners. It loves the help of wallbreakers such as Monferno to help take down common walls such as Klang. Swanna also adds some light defensive utility to teams by resisting Fire, Fighting, and Ground, so Pokemon like Klang and Stunfisk appreciate the additional synergy. SubRoost Swanna is also excellent at stallbreaking threats such as Zweilous, Audino, and Machoke, so Pokemon like Zebstrika that tend to struggle against stall also love having Swanna around.</p>"
      },
      "Choice Scarf": {
        "description": "<p>Surf is the chosen go-to STAB move, as Scald is not as powerful and Hydro Pump is not as consistent for a revenge killer. Ice Beam is for hitting Grass-types such as Vileplume and Maractus, and Hidden Power Electric hits other Water-types, with the most notable being opposing Swanna. The last move is dedicated to a Flying-type STAB move, but the selection is varied. Brave Bird has 100% accuracy and makes Swanna a decent mixed attacker, but it has recoil. Hurricane allows Swanna to run Timid nature and hits harder, but it can miss at crucial times.</p> <p>This set is best suited for more offensive-oriented teams that need a slot dedicated for speed control and revenge killing threats faster than Zebstrika. As such, wallbreakers such as Stoutland and Beheeyem appreciate having Swanna take out potential faster threats such as Monferno and Sneasel. Wallbreakers also have the added benefit of breaking down Swanna's defensive answers to allow a potential sweep later. Choice Scarf Swanna is easily walled by Klang, Frillish, Articuno, Audino, Bronzor, and other defensive Pokemon that can take advantage of it being locked into the wrong move. As a result, Pokemon like Stunfisk and Klang that can provide a safe switch-in when Swanna needs it are appreciated.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 231726, "username": "Akir"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 567483, "username": "Bella"}]}, {"name": "Grammar checked by", "members": [{"user_id": 558636, "username": "zastra"}]}]}
  },
  "Klang": {
    "overview": "<p>Klang is one of the fantastic Steel-type tanks of PU, providing a long list of sought-after resistances to Flying, Grass, and more to plenty of teams of all varieties. When this is combined with Klang's impressive bulk, it stands as one of the sturdiest walls in PU. Klang even has Volt Switch, making it into an effective pivot. Unfortunately, Klang's subpar Attack and reliance on Toxic to deal damage makes it into a particularly passive wall. Klang also can get worn down easily, as it takes full damage from entry hazards and lacks any recovery outside of Rest. Add in Klang's weaknesses to common attacking types like Fighting and Ground from threats like Monferno and Marowak, and it might struggle to stay around for as long as it wants.</p>",
    "sets": {
      "Pivot": {
        "description": "<p>Klang's singular recovery move is Rest, healing it to full health and getting rid of any status but locking it into two turns of sleep at minimum. Unfortunately, due to to BW's sleep mechanics, the amount of turns Klang has been asleep for resets every time it switches out, so Sleep Talk is also used on the set to alleviate this problem. Volt Switch allows Klang to safely bring in its teammates thanks to its extremely slow Speed. Toxic is used so that Klang can status common switch-ins like Stunfisk and Torterra and rack up damage, while Gear Grind can be used instead with a Careful nature. It is worth noting, however, that Toxic is the more reliable and effective damage source between the two choices.</p> <p>Klang's EV spread allows it to properly take hits from heavy special hitters like Swanna, Beheeyem, and Shiftry. Klang is great for slow pivoting into wallbreakers such as Monferno and Beheeyem safely with Volt Switch. While Klang does have impressive natural bulk, it is still weak to common attacking types like Fighting and Ground. As a result, partners that can take those hits such as Torterra and Frillish are good options. Stunfisk stands out as one of the stronger options for a defensive teammate; it can reliably take on common Klang answers like Monferno and Zebstrika and take physical hits generally well, while Klang can take a lot of the Water- and Ice-type attacks thrown at Stunfisk by threats like Swanna and Vanilluxe. Certain other teammates such as Shiftry and Swanna can also be effective partners for Klang, as they can reliably take on the Ground-types that regularly threaten it such as Marowak or Torterra.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 231726, "username": "Akir"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 567483, "username": "Bella"}, {"user_id": 481576, "username": "roxie"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}, {"user_id": 511181, "username": "Rose"}]}]}
  },
  "Beheeyem": {
    "overview": "<p>Beheeyem is among the best Pokemon in PU as one of the more harrowing wallbreakers to face. Beheeyem's sky-high base 125 Special Attack mixed with Analytic means that it hits like a truck, cleanly OHKOing a significant portion of the tier and even 2HKOing some special walls. Beheeyem has three ways to leverage this power: a bulky setup set for stallbreaking, Choice Specs for immediate wallbreaking power, and Trick Room for sweeping late-game. However, none of this means that Beheeyem isn't without its counters. Walls like Scraggy and Bronzor can counter Beheeyem no matter the set, but other choices like Audino and Shiftry can reasonably counter it depending on the set.</p>",
    "sets": {
      "Bulky SetUp": {
        "description": "<p>With maxed-out physical bulk, Beheeyem becomes surprisingly tanky and gets many opportunities to switch in and set up because of it. The choice between Nasty Plot and Calm Mind comes down largely to preference: Nasty Plot gives more immediate power and is the more common pick, but Calm Mind adds further bulk, making it easier for further setup. Signal Beam can be used for breaking through bulky Psychic-types like Duosion while still hitting most Dark-types like Shiftry, but Hidden Power Fighting hits Scraggy for super effective damage. Recover is the chosen last move to keep Beheeyem healthy to tank more hits for the team and itself.</p> <p>This set of Beheeyem has the tradeoff of more immediate power compared to the other sets but provides the team with a bulky switch-in for Fighting-types like Monferno. Beheeyem also enjoys being brought in by U-turn or Volt Switch to preserve bulk and potentially buy a turn to set up with. For this, Pokemon such as Monferno and Zebstrika also make good partners with the added bonus that the two listed examples also tend to bring in walls like Stunfisk that Beheeyem can set up on.</p>"
      },
      "Choice Specs": {
        "description": "<p>This set trades the bulk of the above set to maximize Beheeyem's bone-crushing power. The EVs are for outspeeding Audino and 2HKOing with Psychic, with the rest of the EVs thrown into needed bulk. Signal Beam and Hidden Power Fighting are both coverage options that hit common switch-ins to Beheeyem such as Duosion and Klang, respectively, while still hitting Dark-type switch-ins like Zweilous. Trick is for walls this set can't overcome otherwise like Bronzor, crippling them by giving them Choice Specs. Beheeyem can still hit hard even without the Choice Specs, so Trick is a comfortable choice to regularly use if your opponent has a Bronzor, Scraggy, or other unassailable wall.</p> <p>This set is also prone to getting chipped down via entry hazards, status, and stray damage, so Pokemon that can help Beheeyem stay healthy such as Tentacool with Rapid Spin, Vileplume with Aromatherapy, and Audino with Wish are all good partners. Beheeyem is also commonly walled by Bronzor and Scraggy, so having a teammate like Monferno that can check them is also a great option. The key to utilizing this set is proper planning at Team Preview: seeing what Beheeyem can and can't break through is the best way to decide what move to lock into, how to get around counters, and when Beheeyem can simply let Psychic loose for some easy KOs.</p>"
      },
      "Trick Room": {
        "description": "<p>Trick Room takes Beheeyem's middling Speed and makes it into a fearsome late-game sweeper. A Quiet nature lowers Beheeyem's Speed further for Trick Room while also allowing Beheeyem to get Analytic boosts against some of the even slower Pokemon in the tier. Hidden Power Fighting is the preferred coverage for this set to more easily beak through Scraggy and Steel-types like Klang, but Signal Beam is also a good option for hitting Psychic-types like Duosion while still hitting common Dark-types like Shiftry and Zweilous. Recover is a solid option for keeping Beheeyem healthy from Life Orb recoil and gives Beheeyem the longevity to act as both a mid-game wallbreaker and a late-game sweeper, but replacing it with Signal Beam to round out coverage for a more potent sweep is also a fine option. Life Orb gives Beheeyem as much power as possible, as this set does not set up nor utilize Analytic during Trick Room.</p> <p>Like most sweepers, the timing of Beheeyem's Trick Room sweep is everything. Waiting until walls such as Bronzor are either crippled or KOed is key so Beheeyem can grab as many KOs as possible during the few turns Trick Room is up. As such, pairing Trick Room Beheeyem with a teammate like Monferno and Simisear can help immensely to help clear the way of common walls like Bronzor and Scraggy. Beheeyem also appreciates racking up as much chip damage as possible before the sweep, and entry hazards are a key part of that; hazard setters such as Torterra and Dwebble are solid choices for this role. Beheeyem also appreciates help wearing down the opposing team and coming in safely with U-turn or Volt Switch, and Zebstrika is a particularly good partner for this, as Zebstrika tends to attract and chip down similar counters to Beheeyem.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 231726, "username": "Akir"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 567483, "username": "Bella"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Fraxure": {
    "overview": "<p>Fraxure is a Pokemon that finds itself outclassed on multiple fronts in PU. Fraxure has Dragon Dance to be an endgame sweeper but doesn't have the Speed to sweep after just one boost, and it runs into immediate competition from other sweepers like Huntail. Fraxure could also use a Choice Band to wallbreak, but its lack of Earthquake and awkward Speed mean that Gabite is the better option. Despite these downsides, Fraxure does have one unique niche: Taunt and Swords Dance allow Fraxure to break stall decently well, but Fraxure's limited coverage and subpar Speed mean that it struggles to accomplish much outside of the stall matchup.</p>",
    "sets": {
      "Stallbreaker": {
        "description": "<p>Swords Dance allows Fraxure to boost its Attack enough to break through walls while Taunt stops all disruption besides basic attacks. Dragon Claw is the chosen STAB option solely due to the lack of downsides while still achieving multiple 2HKOs on threats like Frillish after one Swords Dance. Outrage is an alternate STAB move that is significantly stronger than Dragon Claw and achieves multiple 2HKOs on high-value targets like Machoke and Torterra and possible a OHKO on Frillish after Stealth Rock with only one Swords Dance, but locking into Outrage invites in a Klang or Bronzor that Fraxure cannot use Taunt on until Outrage is done. One last thing to consider while choosing the STAB option is to keep in mind that Fraxure with Taunt is sometimes able to get off another Swords Dance and make Dragon Claw just as powerful as Outrage in the same amount of time Fraxure spends being locked into Outrage. Superpower is the preferred coverage option for hitting Steel-types like Klang while also surprising other walls like Audino that take super effective damage from it. Mold Breaker would be great if Fraxure had Earthquake but only has use for breaking through Sturdy. Unnerve can be used for blocking potential Berry activations but those are very rare; both options come down to personal preference, as they have very low impact most of the time. Fraxure's Speed investment allows Fraxure to outspeed uninvested base 70 Pokemon like Natu; the rest of the EVs invested into HP and the Eviolite let it take plenty of hits from the Taunted walls.</p> <p>Fraxure belongs on teams that value breaking down stall cores extremely highly, so teammates like Huntail or Zebstrika that can take advantage of destroyed walls are excellent choices. Fraxure is also weak to Ice- and Dragon-type attacks, so Bronzor in particular can make an excellent pick for a partner. Klang also can be a great alternative thanks to Fraxure really appreciating the slow Volt Switch to bring it in safely. Fraxure also resists to Fire, Water, and Electric, making for some interesting defensive synergy with Pokemon like Maractus, Monferno, and Swanna that really appreciate having a Pokemon soak up some of those hits even though Fraxure would prefer not to.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 231726, "username": "Akir"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 567483, "username": "Bella"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Stunfisk": {
    "overview": "<p>Stunfisk hits the stage of BW PU as one of the best utility walls in the format. Stunfisk's unique typing grants it a useful array of resistances to common attacking types such as Flying, Rock, Poison, and even an immunity to Electric. Stunfisk also has access to Stealth Rock to set for the team, and its ability Static makes any contact moves, especially from Pokemon like Monferno and Stoutland, risky and potentially crippling. Combine all of this with Stunfisk's great bulk and it stands as one of the most solid anchors a team could ask for. Weaknesses to Grass, Ground, and Water do make Stunfisk's job difficult sometimes, especially with Grass-types like Torterra resisting both of Stunfisk's STAB moves for an easy switch in.</p>",
    "sets": {
      "Utility": {
        "description": "<p>Stealth Rock is always a boon and Stunfisk's ability to force switches gives it plenty of opportunities to set it up. Discharge is both for a STAB option and for an additional 30% paralysis chance that can threaten common usually-safe switch-ins like Shiftry and Bronzor. Earth Power is for an additional STAB move to better threaten Zebstrika, Klang, and Arbok. Toxic is used in the fourth slot to spread chip damage on to opposing walls that aren't threatened by Stunfisk's STABS or paralysis, while Thunder Wave can be used to instead spread paralysis to slow foes down for a later sweep by a teammate. Stunfisk's ability should also always be Static, as the combination of Static and Ground typing means that Stunfisk can effectively stop VoltTurn in its tracks.</p> <p>Stunfisk forces out many Pokemon but also invites other threats in such as Ground-types like Torterra and Grass-types like Shiftry. Teammates such as Jumpluff and Monferno can help mitigate Ground- and Grass-types on offensive teams, and other choices like Bronzor and Audino can help on defensive teams. Water-type attacks are also a notable threat to Stunfisk, so partners like Vileplume, Maractus, and Tentacool also make for good partners. Stunfisk is also heavily reliant on just its Leftovers for healing, so clerics and Wish passers such as Aromatherapy Vileplume and Wish Audino can make Stunfisk stay around for a long time. Stunfisk is also excellent at checking threats like Zebstrika and Monferno, so partners such as Swanna and Shiftry always appreciate having Stunfisk around.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 231726, "username": "Akir"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 567483, "username": "Bella"}, {"user_id": 481576, "username": "roxie"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}, {"user_id": 384270, "username": "autumn"}]}]}
  },
  "Zweilous": {
    "overview": "<p>Boasting an array of valuable resistances and a prized immunity to Psychic-type attacks, allowing it to check the likes of Beheeyem and Duosion, Zweilous is an accomplished specially defensive wall in BW PU. Zweilous also boasts a surprisingly powerful Crunch even without investment thanks to Hustle and useful phazing in either Roar or Dragon Tail. Unfortunately, Zweilous has to grapple with Hustle's lowered accuracy and has to rely on Rest for healing, making for a sometimes inconsistent Pokemon.</p>",
    "sets": {
      "Specially Defensive": {
        "description": "<p>Rest is for healing HP and status, and Sleep Talk is to let Zweilous avoid being too passive even when asleep by allowing Zweilous to continue doing damage and phaze. The last move is a choice between Roar and Dragon Tail; Roar can't miss and will almost always phaze foes even through Substitute, but Dragon Tail does good damage and hits through Soundproof and Taunt, though it can miss at crucial times.</p> <p>Zweilous resists Water-, Dark-, and Grass-type attacks from threats such as Swanna and Shiftry, so teammates like Monferno, Beheeyem, and Stunfisk that get checked by them appreciate Zweilous's defensive profile. Zweilous brings a lot of valuable resistances to the table but does have common weaknesses to types such as Fighting and Ice. Partners like Vileplume, Bronzor, and Frillish can cover those weaknesses, while Zweilous patches up the Fire and Electric weaknesses that they have. Entry hazards also pair well with Zweilous and its phazing, so partners like Maractus and Torterra that can set Spikes or Stealth Rock are also appreciated.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 231726, "username": "Akir"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 567483, "username": "Bella"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  }
}