{
  "Volcarona": {
    "comments": "<h1>Other Options</h1> <p>Volcarona may opt for Bug Gem for extra insurance versus Latios, or Fire Gem for extra damage against neutral targets like opposing Volcarona, Conkeldurr, and Scrafty.</p> <p>Will-O-Wisp + Roost defeats some physical attackers like Choice Band Snorlax, but requires Volcarona to drop an attacking move.</p> <p>Volcarona can lure in some of its supposed checks as well: Life Orb + Giga Drain defeats Rhyperior, Jaboca Berry beats Crustle by using Overheat turn 1, and Passho Berry with Psychic or Hurricane wins against Keldeo. Psychic is perfectly accurate, but can lose to bulkier Keldeo, while Hurricane is more reliable versus bulky variants, at the cost of shaky accuracy. If you wish to use this set, use an EV spread of 248 HP / 200 SpA / 40 SpD / 20 Spe with a Modest nature, which allows Volcarona to survive Timid Choice Specs Latios's Draco Meteor and Choice Specs Keldeo's Hydro Pump, as well as outspeeding Magnezone.</p> ",
    "sets": [
      {
        "name": "Charti Berry Setup",
        "description": "<h1>Set Description</h1> <p>Volcarona is the best Fire-type in BW 1v1 due to its natural power and its access to Quiver Dance. Overheat does massive damage to non-resistant targets like Zapdos, while Bug Buzz threatens common Psychic-types like Cresselia, Latios, and Meloetta and comes without Overheat's stat drop. Volcarona's last move is quite customizable. Substitute buys Volcarona a free turn on status moves, gives it a better matchup against other Volcarona, and allows it to fish for misses on inaccurate attacks such as Choice Band Sawk's Stone Edge. On the other hand, Flame Charge guarantees the win against Magnezone, and Roost helps against other Volcarona and stall Snorlax. Charti Berry is used to survive various Rock-type coverage moves, like Choice Scarf Heracross's Rock Slide or Choice Specs Magnezone's Hidden Power Rock.</p> <h1>EVs</h1> <p>The Special Defense investment allows Volcarona to survive Choice Specs Zapdos's Hidden Power Flying. The Speed investment allows Volcarona to outspeed Magnezone.</p> <h1>Usage Tips</h1> <p>If Volcarona can take an OHKO on turn 1, such as against Metagross, Celebi, or Genesect, it will.</p> <p>To avoid being locked into Quiver Dance by Trick users such as Cresselia and Porygon-Z, Volcarona should use Bug Buzz or Overheat, respectively, on turn 1.</p> <p>Versus Latios, Volcarona has an unintuitively bad matchup. Bug Buzz is not guaranteed to OHKO no bulk Latios and it commonly carries Trick + Choice Specs or Calm Mind to stop Volcarona's Quiver Dance. Volcarona must choose between setting up Quiver Dance on an attack or Calm Mind or using Bug Buzz to use Latios's Choice Specs against it or go for a damage roll.</p> <p>Against opposing Volcarona, both players should use Quiver Dance repeatedly before attacking each other. If either player has Substitute, they should use it early on to force the opponent to lower their Special Attack with Overheat. If you have Roost, use it to heal off damage from Overheat.</p> <p>Substitute allows Volcarona to fish for misses on inaccurate Rock-type moves from slower opponents like Tyranitar, and may buy free turns if the opponent decides to set up, like against Bulk Up Scrafty or Conkeldurr.</p> <p>Flame Charge breaks Magnezone's Sturdy so that Volcarona does not have to worry about Mirror Coat.</p> <p>Roost allows Volcarona to outlast stall Snorlax's Seismic Toss and boost up to +6 to match Snorlax's Amnesia boosts. It then 4HKOes most stall Snorlax with Bug Buzz. Roost is also helpful versus opposing Volcarona, since it heals off damage from Overheat and forces them to use Quiver Dance to regain maximum Special Attack.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 493772, "username": "Lumii"}, {"user_id": 234355, "username": "DEG"}]}, {"name": "Grammar checked by", "members": [{"user_id": 277988, "username": "dex"}]}], "writtenBy": [{"user_id": 518399, "username": "Itchy"}]}
  },
  "Raikou": {
    "comments": "<h1>Other Options</h1> <p>Choice Specs Raikou can also run Hidden Power Rock in its last moveslot, which lets it have a better matchup against Volcarona sets without the common Charti Berry. If a Charti Berry Volcarona does not have any Speed EVs, Hidden Power Rock Raikou will still win. Raikou can run Aura Sphere to defeat Tyranitar, which forces it to have a Rash nature. However, due to Rash Raikou being OHKOed by Water Gem- or Choice Specs-boosted Hydro Pump from Keldeo, Aura Sphere is very often not worth using.</p> ",
    "sets": [
      {
        "name": "Pressure Stall",
        "description": "<h1>Set Description</h1> <p>Substitute + Protect in combination with Raikou's ability, Pressure, allows it to PP stall Pokemon such as Choice-item variants of Rhyperior, Jellicent, and Arcanine. Toxic allows Raikou to more easily beat non-Rest Cresselia. Raikou should always be shiny so the opponent can't be sure it's not an Aura Sphere special attacker variant.</p> <h1>EVs</h1> <p>Raikou should have maximum Speed EVs and a Timid nature to outspeed Choice Scarf Jellicent. It should also have 192 HP EVs to optimize its Substitute stalling.</p> <h1>Usage Tips</h1> <p>Unless Raikou can 2HKO with Thunderbolt, it should always use its Substitute + Protect strategy to PP stall its foe. Against Snorlax, Raikou should always use Substitute on the first turn to play around Belly Drum + Custap Berry sets that lack Return. Raikou should always attempt to scout Trick from Pokemon like Cresselia and Porygon-Z by using Protect. It should then use Toxic or Thunderbolt, respectively, to give itself the best chance of winning these matchups.</p> "
      },
      {
        "name": "Choice Specs",
        "description": "<h1>Set Description</h1> <p>Thunderbolt is Raikou's best STAB move and should be used against both Tornadus formes, Keldeo, and Jellicent. Shadow Ball should be used against Choice Scarf Cresselia and offensive Latias sets. Signal Beam lets Raikou be a reliable Serperior answer. Hidden Power Grass can be used to OHKO Swampert and Choice Band Rhyperior, while Hidden Power Fire gives Raikou a better matchup against some Genesect sets. Raikou should always be shiny so the opponent can't be sure if it lacks Aura Sphere.</p> <h1>EVs</h1> <p>Raikou should use maximum Speed EVs to Speed tie Jellicent with the 30 Speed IVs forced by Hidden Power Fire.</p> <h1>Usage Tips</h1> <p>Raikou should almost always use the move that does the most damage to its foe. The only exception is when a Pokemon is expected to use Endure + Custap Berry. In this situation, it is better to click a weaker move if the weaker move can still 2HKO but is less likely to activate Custap Berry.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 408904, "username": "neomon"}, {"user_id": 518399, "username": "Itchy"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}], "writtenBy": [{"user_id": 493772, "username": "Lumii"}]}
  },
  "Crustle": {
    "sets": [
      {
        "name": "Rock Gem",
        "description": "<h1>Set Description</h1> <p>Shell Smash boosts Crustle's Attack and Speed by two stages each, allowing it in many cases to move before the opponent the following turn. Rock Wrecker is Crustle's strongest STAB move and with a Rock Gem and Shell Smash boost, it can OHKO most Pokemon that do not resist it, such as Snorlax and Latias. Rock Blast is useful against Pokemon that try to set up Substitute, such as Volcarona, Thundurus, Aerodactyl, and Serperior. X-Scissor allows Crustle to more reliably hit Pokemon such as Cresselia. Earthquake can be used to have better matchups against Heatran and Terrakion. Counter can be used in conjunction with Sturdy to punish physical attackers, such as Choice Scarf Landorus-T.</p> <h1>EVs</h1> <p>Crustle almost always runs 252 Attack EVs due to needing as much damage as possible from Shell Smash. It also almost always runs 252 Speed EVs to outspeed Tornadus-T after a Shell Smash. Adamant is the preferred nature because Crustle does not gain any meaningful matchups having a Jolly nature other than against opposing Crustle.</p> <h1>Usage Tips</h1> <p>Crustle's strength lies in its combination of Sturdy, Shell Smash, and Rock Wrecker. Sturdy allows Crustle to often freely use Shell Smash and attack first on turn two. However, Crustle struggles against Pokemon that can use moves like Taunt, which is commonly used by Heatran, Jellicent, and Sableye. It also struggles against Pokemon with priority moves, such as Keldeo, Genesect, and Mienshao, which can either break Sturdy or attack it after Sturdy activates. Despite having difficulties against Trick, Crustle can still perform well against Choice Scarf Cresselia and Choice Specs Latios if it has X-Scissor. If Crustle has X-Scissor, it is important to not use Shell Smash on the first turn against these Pokemon, as they can use Trick to lock Crustle into Shell Smash. Crustle, however, still struggles against Porygon-Z and Jellicent, which also commonly use Trick.</p> <h1>Other Options</h1> <p>Crustle can also use a variety of different items with this set, including Mail, which makes Crustle immune to with Trick, and Lum Berry, which can heal a burn from Heatran, Arcanine, or Sableye's Will-O-Wisp, which Crustle struggles against. Choice Band Crustle is also an option, but it is generally worse than Rock Gem sets, as it cannot use Shell Smash.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 518399, "username": "Itchy"}, {"user_id": 437679, "username": "crucify"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 493772, "username": "Lumii"}]}
  },
  "Magnezone": {
    "sets": [
      {
        "name": "Choice Scarf",
        "description": "<h1>Set Description</h1> <p>Magnezone's most consistent STAB move is Thunderbolt, which it should use against Keldeo, Tornadus, and Porygon-Z. Flash Cannon should be used against Rock-types like Choice Band Rhyperior and Choice Band Terrakion. Hidden Power Rock nails Volcarona; however, some Volcarona with Flame Charge can still win. Charge Beam can beat Choice Scarf Cresselia, while Thunder is better against bulky Zapdos variants and Choice Band Arcanine.</p> <h1>EVs</h1> <p>Magnezone runs 252 Special Attack EVs to have better odds to 2HKO Psychic Gem and Steel Gem Metagross that do not have Earthquake. Magnezone runs 252 Speed EVs and a Timid nature to outspeed Latios, Latias, and +1 Volcarona that has no Speed investment.</p> <h1>Usage Tips</h1> <p>Magnezone can either reliably OHKO or 2HKO many Pokemon, but this can be interrupted by priority moves, Custap Berry, faster Choice Scarf users, and moves that either boost or lower Speed. When deciding between clicking Thunder and Thunderbolt, it is important to factor in Thunder's lower accuracy and not automatically commit to it due to the theoretically higher damage output.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 408904, "username": "neomon"}, {"user_id": 437679, "username": "crucify"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}], "writtenBy": [{"user_id": 493772, "username": "Lumii"}]}
  },
  "Arcanine": {
    "sets": [
      {
        "name": "Bulky Choice Band",
        "description": "<h1>Set Description</h1> <p>Flare Blitz is Arcanine's strongest physical STAB move and can be used against targets it hits super effectively such as Genesect, Metagross, and Shaymin as well as neutral targets such as Porygon-Z and Volcarona. Outrage hits common Dragon-types such as Latios, Garchomp, and Haxorus. Close Combat is Arcanine's strongest move against Choice Scarf Terrakion, Snorlax, and Heatran. Extreme Speed beats Sturdy + Custap Berry Sawk. Bulldoze can be used over Extreme Speed to beat PP stall Raikou and Chople Berry Heatran. Intimidate improves Arcanine’s matchup against physical attackers such as Choice Band Snorlax, Choice Scarf Terrakion, and Garchomp.</p> <h1>EVs</h1> <p>The HP and Special Defense allows Arcanine to survive a Dragon Gem-boosted Draco Meteor from Latios. The investment in HP also allows Arcanine to always survive Choice Band Haxorus's Earthquake.</p> <h1>Usage Tips</h1> <p>Choice Band Arcanine is a very straightforward attacker. In most cases, use the attack that does the most damage. However, it is important to predict potential Occa, Chople, and Haban Berries, as Arcanine has no Speed investment and relies on OHKOs to net wins. It is also important to take into account the Defense and Special Defense drops from Close Combat and the recoil damage from Flare Blitz and choose another, usually less effective move, to avoid being OHKOed back in certain matchups.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 437679, "username": "crucify"}, {"user_id": 408904, "username": "neomon"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 493772, "username": "Lumii"}]}
  },
  "Donphan": {
    "sets": [
      {
        "name": "Ground Gem",
        "description": "<h1>Set Description</h1> <p>Ground Gem-boosted Earthquake, Donphan's strongest STAB move, OHKOes Metagross and Heatran. Ice Shard lets Donphan KO many Pokemon at low HP that could otherwise 2HKO it in return, such as Haxorus, Magnezone, and Porygon-Z. Endeavor + Sturdy lets Donphan survive would-be OHKOs and bring the foe to 1 HP, which lets Ice Shard pick them off. Donphan's Rock Slide is for Aerodactyl, Substitute Tornadus, and Thundurus, while Head Smash is worse against the three but better against bulky Choice Specs Zapdos. Counter allows Donphan to beat some physical attackers, such as Scrafty.</p> <h1>EVs</h1> <p>Maximum Attack EVs and an Adamant nature let Donphan do as much damage as possible. The rest of the EVs are relatively insignificant, as Donphan can use Sturdy to avoid OHKOs and Ice Shard to bypass its low Speed.</p> <h1>Usage Tips</h1> <p>If Donphan is able to 2HKO with some attack + Ice Shard, it should always use it. An example of this is against Sawk, which faints to Donphan's Earthquake + Ice Shard. Donphan should use Endeavor against threats that are expected to activate its Sturdy. Against Latios, Donphan can either use Endeavor or Ice Shard, which often 3HKOes. If Latios attacks and activates Sturdy, Endeavor + Ice Shard wins. If Latios uses either Calm Mind or Trick, repeatedly using Ice Shard wins instead. Donphan cannot, however, win against Latios that have Psyshock + Draco Meteor.</p> "
      },
      {"name": "Sitrus Berry + Endeavor", "description": "<h1>Set Description</h1> <p>Sturdy and a Sitrus Berry allow Donphan to more comfortably use Substitute on the first turn. Endeavor is used to get a foe in KO range of Ice Shard. Earthquake is Donphan's strongest STAB move and can OHKO Pokemon like Heatran.</p> <h1>EVs</h1> <p>0 Speed IVs allow Donphan to use Substitute after Snorlax attacks. Donphan should also have 0 IVs in Special Defense to activate Sturdy more often. Since physical attacks rarely activate Sturdy anyway, 252 Defense EVs are used to help against physical attackers.</p> <h1>Usage Tips</h1> <p>Unless Donphan can KO immediately with Earthquake + Ice Shard, it should always use Substitute on the first turn, which, due to its Sitrus Berry, will work even if Sturdy is activated. Donphan should continue to use Substitute until its HP does not allow it to use Substitute again. After this, Donphan can use Endeavor + Ice Shard to attempt to KO.</p> "}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 518399, "username": "Itchy"}, {"user_id": 234355, "username": "DEG"}, {"user_id": 408904, "username": "neomon"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}], "writtenBy": [{"user_id": 493772, "username": "Lumii"}]}
  },
  "Tyranitar": {
    "sets": [
      {
        "name": "Defensive Chople Berry",
        "description": "<h1>Set Description</h1> <p>Stone Edge is Tyranitar's strongest STAB move and is its best option to hit Rock-weak and neutral targets, such as Volcarona, Zapdos, Genesect, and more. Crunch is used to beat Choice Scarf Cresselia, Latios, Jellicent, and Chandelure. Taunt is used to beat stall Cresselia, Registeel, and Crustle. Counter is used to beat Choice Scarf Landorus-T, Arcanine, and stall Snorlax that runs Seismic Toss. A Chople Berry allows Tyranitar to survive many non-STAB Fighting-type moves, such as Focus Blast from Thundurus-T or Meloetta and +1 Attack Superpower from Tornadus.</p> <h1>EVs</h1> <p>Tyranitar's HP and Defense EVs, along with its Chople Berry, allow it to survive a Close Combat from Adamant Choice Scarf or Custap Berry Sawk. The Speed EVs allow Tyranitar to outspeed Crustle before a Shell Smash, which it can prevent with Taunt.</p> <h1>Usage Tips</h1> <p>Against Cresselia, Tyranitar should always use Crunch on the first turn. This is because Cresselia often runs Choice Scarf sets with Trick, which makes using Taunt dangerous. Even against stall Cresselia sets, using Crunch on the first turn does not make Tyranitar lose the matchup. Defensive Chople Berry Tyranitar faces a near-coinflip scenario against Crustle. Using Taunt on the first turn wins if Crustle uses Shell Smash, but if Crustle uses X-Scissor, it will likely 2HKO before Tyranitar can 2HKO in return. If predicting X-Scissor, Tyranitar can use Counter on the first turn, which, if successful, lets Crunch KO the next turn.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 437679, "username": "crucify"}, {"user_id": 518399, "username": "Itchy"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}], "writtenBy": [{"user_id": 493772, "username": "Lumii"}]}
  },
  "Porygon-Z": {
    "comments": "<h1>Other Options</h1> <p>Choice Specs Porygon-Z is an option if the extra damage with coverage such as Dark Pulse, Hidden Power Fire, Thunderbolt, or Ice Beam is desired. Without the Speed boost from Choice Scarf or Normal Gem's ability to switch moves, it is hard to justify, but still a solid set.</p> <p>Normal Gem Porygon-Z may opt for Endure for other Porygon-Z and Crustle, forcing them to recharge with Hyper Beam or Rock Wrecker</p> <p>If you want to be a bit wild with your Porygon-Z set, Chople Berry + Conversion defeats Sawk and most other Fighting-types. With 224 HP / 248 Def / 36 SpA and a Modest nature, Porygon-Z survives Choice Band Sawk's Close Combat before becoming a Ghost-type with Shadow Ball. Keep in mind that all of Porygon-Z's other moves need to be Normal-type for Conversion to work correctly.</p> ",
    "sets": [
      {
        "name": "Choice Scarf",
        "description": "<h1>Set Description</h1> <p>Hyper Beam, boosted by Adaptability, blasts through most non-resistant foes like Latios and Keldeo before the recharge turn takes effect. Trick stops setup from foes such as Shell Smash Crustle. Trick, Icy Wind, and Hyper Beam together allow Porygon-Z to reliably defeat Crustle. Uproar allows Porygon-Z to avoid a recharge turn, which is useful versus various Endure + Custap Berry users like Garchomp and Venusaur, as well as block Rest from various Pokemon, such as stall Snorlax. Dark Pulse allows Porygon-Z to damage Ghost-types, most notably Jellicent.</p> <h1>EVs</h1> <p>The HP investment allows Porygon-Z to always survive Crustle's Rock Wrecker after Rock Gem is removed. The Speed investment and a Choice Scarf outspeeds Raikou and Starmie.</p> <p>An alternate spread of 40 HP / 248 Def / 144 SpA / 76 Spe may be used instead to survive Fighting Gem Conkeldurr's Mach Punch and outspeed Latios and Latias, but the lower Special Attack investment means various targets like Crustle and Substitute Thundurus are less reliable.</p> <h1>Usage Tips</h1> <p>Usually, Porygon-Z will use Hyper Beam to OHKO foes before they can move; however, some matchups are less straightforward. Some of the most common matchups with more complex sequences are listed below.</p> <p>To defeat Crustle, first use Trick to potentially lock the opponent into Shell Smash and remove Rock Gem, then use Icy Wind to break Crustle's Sturdy, and finally use Hyper Beam to KO Crustle.</p> <p>Versus Custap Berry users like Venusaur and Garchomp, you will have to guess whether to use Uproar on a potential Endure or Hyper Beam. Note that Garchomp more commonly uses Yache Berry instead, so it is usually safer to use Hyper Beam.</p> <p>Although Hyper Beam does not OHKO Cresselia, it is useful for Porygon-Z in this matchup anyway. Provided Cresselia is not holding Mail, Porygon-Z should use Trick turn 1 onto Cresselia to lock it into a potential status move before continually using Hyper Beam. Hyper Beam outdamages Rest and Moonlight, eventually resulting in a win for Porygon-Z.</p> <p>Many other stall Pokemon, like Registeel, Snorlax, and Manaphy, may use Mail to block Trick; watch for it on Team Preview and be mindful of it in game.</p> "
      },
      {
        "name": "Normal Gem",
        "description": "<h1>Set Description</h1> <p>Porygon-Z's Adaptability-boosted Hyper Beam overpowers even sturdy specially defensive walls like Snorlax and Cresselia with Normal Gem and can be further boosted with Nasty Plot to break through Special Defense boosts from Calm Mind and Amnesia. Substitute helps beat Snorlax by scouting for Belly Drum. Uproar allows Porygon-Z to defeat Substitute + Protect users like Raikou and Suicune, while Dark Pulse allows Porygon-Z to damage Ghost-types, most notably Jellicent.</p> <h1>EVs</h1> <p>The given EV spread outspeeds Suicune and provides some additional bulk.</p> <p>An alternative EV spread of 40 HP / 4 SpA / 248 Def / 216 Spe survives Fighting Gem Conkeldurr's Mach Punch and still outspeeds Suicune, but has a much worse matchup against Snorlax.</p> <h1>Usage Tips</h1> <p>Versus most foes, even bulky targets like Cresselia, Porygon-Z should use Hyper Beam.</p> <p>Versus Snorlax, use Substitute turn 1. If they use Amnesia, use Nasty Plot until they use Seismic Toss to break Substitute or they get to +6 Special Defense. Then, use Hyper Beam repeatedly. If Snorlax uses Giga Impact, Superpower, or any other offensive move, you should use Hyper Beam and hope Snorlax is OHKOed. If they use Belly Drum, use Uproar to KO them so you don't miss Hyper Beam.</p> <p>Versus Custap Berry users like Venusaur, Porygon-Z should use Nasty Plot if you predict them to Endure. If you do not believe they will, use Hyper Beam.</p> <p>Versus Pressure stall Pokemon, like Raikou and Suicune, use Substitute turn 1, since they will more than likely scout for Choice Scarf + Trick with Protect. You are then free to use Uproar until they are KOed. Raikou also commonly uses Choice Specs, so Normal Gem Porygon-Z does not defeat all sets.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 493772, "username": "Lumii"}, {"user_id": 437679, "username": "crucify"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 518399, "username": "Itchy"}]}
  },
  "Shaymin": {
    "comments": "<h1>Other Options</h1> <p>Shaymin can use Bullet Seed instead of Seed Flare to be a better answer against PP stall Raikou and Aerodactyl, but this is not as reliable as running Seed Flare. In addition, Shaymin can also use Worry Seed instead of Seed Flare to beat all Snorlax, but this causes Shaymin to lose to any Pokemon with Taunt.</p> ",
    "sets": [
      {
        "name": "SubSeed",
        "description": "<h1>Set Description</h1> <p>Leech Seed, in combination with Substitute and Protect, allows Shaymin to beat both Pokemon that are slower and don't OHKO it, such as Scrafty and Choice Band Sawk, and faster Pokemon that fail to 2HKO, such as Choice Scarf Magnezone. Seed Flare should be utilized against Keldeo, Terrakion, Jellicent, and Chansey.</p> <h1>EVs</h1> <p>40 Defense EVs allow Shaymin to beat most Snorlax by surviving a Choice Band-boosted Return after using Substitute; Substitute is used in case Snorlax has Belly Drum + Custap Berry. Maximum Speed EVs allow Shaymin to generally outspeed a lot of foes to stall them out with Leech Seed, such as Suicune and Normal Gem Porygon-Z.</p> <h1>Usage Tips</h1> <p>Against Pokemon holding a Custap Berry, such as Magnezone, Shaymin should use Protect on the turn Custap Berry activates. Against Snorlax, Shaymin should use Substitute on the first turn, as it allows Shaymin to play around Belly Drum + Custap Berry sets while not being OHKOed by Choice Band Snorlax's Return after the recovery from Leftovers. However, Shaymin still loses to stall Snorlax sets that have Rest. If an opposing Sawk outspeeds Shaymin's Leech Seed on the first turn, Shaymin should use Protect and Seed Flare on the following two turns to KO.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 493772, "username": "Lumii"}, {"user_id": 408904, "username": "neomon"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}], "writtenBy": [{"user_id": 489963, "username": "SwordIsBored"}]}
  },
  "Conkeldurr": {
    "comments": "<h1>Other Options</h1> <p>Conkeldurr can also run a Guts set with Ice Punch in order to beat Sableye. This set can be run either with or without a Flame Orb or a Toxic Orb, as it is more beneficial on some teams to hold a different item. This set has good odds against Sableye, which otherwise has good odds against Conkeldurr. However, losing Iron Fist is usually too big of a cost to run this set.</p> ",
    "sets": [
      {
        "name": "Fighting Gem",
        "description": "<h1>Set Description</h1> <p>Iron Fist and Fighting Gem boost Hammer Arm to OHKO many neutral targets, such as Haxorus, Genesect, and Keldeo without Reflect. Mach Punch, which is also boosted by Iron Fist and Fighting Gem, OHKOes most Porygon-Z sets. Bulk Up gives a better matchup against Chople Berry offensive Snorlax, while Taunt gives a better matchup against stall Snorlax sets. Stone Edge is for Volcarona, which Conkeldurr can reliably beat unless Volcarona has Substitute, Will-O-Wisp, or Charti Berry and a bulky EV spread. Payback can be used to OHKO Latios lacking Choice Specs or Dragon Gem. Ice Punch can be used to OHKO Garchomp and Landorus-T that do not hold a Yache Berry.</p> <h1>EVs</h1> <p>248 HP EVs let Conkeldurr survive Gem- or Choice Band-boosted Outrage from Garchomp in addition to Rough Skin damage, letting Conkeldurr OHKO with Ice Punch. 248 HP EVs and 128 Special Defense EVs let Conkeldurr survive Water Gem or Choice Specs Keldeo's Hydro Pump. The rest of the EVs in Attack let Conkeldurr have better matchups against Yache Berry Garchomp, Keldeo without Reflect, and offensive Manaphy. Conkeldurr can also run 64 EVs in Defense, as they, alongside 248 HP EVs, guarantee surviving Choice Band Snorlax's Giga Impact.</p> <h1>Usage Tips</h1> <p>Conkeldurr should use its very powerful Hammer Arm against most Pokemon. Some exceptions are Porygon-Z and Chople Berry + Counter users. Porygon-Z can OHKO with Hyper Beam, but many variants do not survive Conkeldurr's Mach Punch, which is preferred in that matchup. Against Scrafty, Conkeldurr should use Bulk Up if it has it. If it doesn't, using Mach Punch can make Scrafty use up its Chople Berry; this strategy can also be used against other Chople Berry users, such as Chople Berry + Counter Snorlax. Counter users in general, such as Blissey and Crustle, require careful play, usually with Bulk Up or Taunt. Conkeldurr should use its super effective coverage moves on Pokemon that resist Hammer Arm, such as Volcarona and Latios.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 437679, "username": "crucify"}, {"user_id": 518399, "username": "Itchy"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}], "writtenBy": [{"user_id": 493772, "username": "Lumii"}]}
  },
  "Sawk": {
    "comments": "<h1>Other Options</h1> <p>Sawk can also run Custap Berry sets, which can allow Sawk to run different moves from its Choice-item sets like Bulk Up, Taunt, and Knock Off. However, due to Endure and Close Combat leaving only two free moveslots, Custap Berry Sawk struggles to run any coverage moves whatsoever.</p> ",
    "sets": [
      {
        "name": "Choice Band",
        "description": "<h1>Set Description</h1> <p>Sawk's biggest strength is its Sturdy ability, which lets it get at least one Choice Band-boosted attack off in most circumstances. Close Combat is Sawk's strongest move and OHKOes many Fighting-weak and neutral threats, such as Snorlax, offensive Genesect, and Porygon-Z. Sawk's Ice Punch OHKOes Thundurus-T, Zapdos, Tornadus, Latios, and Landorus-T. Bulldoze lets Sawk beat Raikou, while Earthquake is better against Custap Berry Chandelure sets. Sawk's Stone Edge OHKOes Volcarona sets that do not both outspeed and have Substitute.</p> <h1>EVs</h1> <p>Choice Band Sawk always wants to use maximum Attack and Speed EVs with an Adamant nature, as Sturdy allows it to attack at least once against almost any Pokemon.</p> <h1>Usage Tips</h1> <p>Choice Band Sawk is very straightforward: use the move that does the most damage to the foe. There are exceptions to this; against Raikou, Sawk should always use Bulldoze if it has it to work around potential Pressure stall sets.</p> "
      },
      {
        "name": "Choice Scarf",
        "description": "<h1>Set Description</h1> <p>Choice Scarf sacrifices Sawk's raw power with Choice Band to freely hit many targets twice with its Sturdy ability and Speed. Close Combat is Sawk's strongest move and can be used against Porygon-Z, Snorlax, and Meloetta. Ice Punch lets Sawk beat Taunt + Charge Thundurus, Landorus-T, Tornadus, Tornadus-T, and non-Yache Berry Garchomp variants. Stone Edge lets Sawk beat most Volcarona sets if it hits twice. Earthquake beats Raikou and Chandelure.</p> <h1>EVs</h1> <p>Choice Scarf Sawk always wants to use maximum Attack and Speed EVs with an Adamant nature, as Sturdy allows it to attack at least once against almost any Pokemon.</p> <h1>Usage Tips</h1> <p>Choice Scarf Sawk should click the move that does the most damage against its foe. Due to Sturdy, Sawk does not have to fear Counter from any Pokemon other than Scrafty, which can break Sawk's Sturdy with its Fake Out. Choice Scarf also makes Sawk harder to PP stall with Pokemon like Aerodactyl due to it moving before a potential use of Substitute.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 518399, "username": "Itchy"}, {"user_id": 408904, "username": "neomon"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}], "writtenBy": [{"user_id": 493772, "username": "Lumii"}]}
  },
  "Scrafty": {
    "sets": [
      {
        "name": "Chople Counter",
        "description": "<h1>Set Description</h1> <p>Fake Out allows Scrafty to freely damage most Pokemon and bypass Sturdy from Pokemon like Magnezone and Sawk. High Jump Kick is Scrafty's strongest STAB attack and allows it to beat many common threats such as Slaking, Heatran, and Tyranitar. It is also Scrafty's strongest option against neutral targets. Payback is used over Crunch due to Scrafty's low Speed stat, which allows Scrafty to underspeed Choice Scarf Cresselia even after Cresselia uses Trick. Counter, Chople Berry, and Intimidate beat physical Fighting-types such as Sawk, Mienshao, and opposing Scrafty.</p> <h1>EVs</h1> <p>Maximum HP and 84 Special Defense EVs allow Scrafty to survive a Dragon Gem Latios's Draco Meteor and OHKO back with Payback. The rest of the EVs are dumped into Attack to maximize Scrafty's damage.</p> <h1>Usage Tips</h1> <p>Fake Out allows Scrafty to break Magnezone and Sawk's Sturdy, and High Jump Kick and Counter can OHKO them. Against physical Fighting-types, such as Mienshao, Conkeldurr, Hariyama, and opposing Scrafty, it is always advisable to use Fake Out into Counter. However, Bulk Up variants can still beat Scrafty. Against Conkeldurr, after using Fake Out, it is important to then use Counter. If Conkeldurr attacks with Hammer Arm, Counter wins. However, if Conkeldurr uses Mach Punch, using High Jump Kick on the third turn is a favorable damage roll. Scrafty also has a decent matchup against Snorlax. However, it is important to play around the possibility of Counter by using Payback after Fake Out, as this allows Scrafty to always OHKO with High Jump Kick after. However, this strategy does fail against Belly Drum Snorlax; if you suspect Belly Drum, use High Jump Kick on turn two.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 518399, "username": "Itchy"}, {"user_id": 437679, "username": "crucify"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 493772, "username": "Lumii"}]}
  },
  "Landorus-Therian": {
    "sets": [
      {
        "name": "Choice Scarf",
        "description": "<h1>Set Description</h1> <p>Earthquake is Landorus-T's strongest STAB move and hits common foes such as Heatran and Raikou; it is also Landorus-T's preferred way of hitting neutral targets, such as Crustle. Rock Slide 2HKOes Aerodactyl and Zapdos. Outrage, when paired with a Choice Scarf, allows Landorus-T to outspeed and OHKO common Dragon-types, such as Latios and Haxorus, while 2HKOing Latias. Superpower lets Landorus-T OHKO Porygon-Z and gives it a better option against Air Balloon Heatran, while Hidden Power Ice gives it better matchup against opposing Landorus-T.</p> <h1>EVs</h1> <p>252 Speed EVs and a Choice Scarf are required in order to outspeed Choice Scarf Porygon-Z. Landorus-T should also run an Adamant nature and 252 Attack EVs to maximize its damage output.</p> <h1>Usage Tips</h1> <p>Landorus-T should almost always use the attack that does the most damage against the opponent. However, there are some matchups in which this is not advised, such as against Garchomp and against Magnezone. Against Garchomp, always use Earthquake instead of Outrage to avoid being KOed by Rough Skin. Against Magnezone, it is recommended to use Superpower, if Landorus-T has it, over Earthquake, as Magnezone may use Magnet Rise to prevent Earthquake from OHKOing after Sturdy; Superpower circumvents Magnezone's Magnet Rise.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 234355, "username": "DEG"}, {"user_id": 518399, "username": "Itchy"}]}, {"name": "Grammar checked by", "members": [{"user_id": 277988, "username": "dex"}]}], "writtenBy": [{"user_id": 493772, "username": "Lumii"}]}
  },
  "Keldeo": {
    "comments": "<h1>Other Options</h1> <p>Choice Specs Keldeo is an option as well, with Focus Blast for Snorlax and Hidden Power Ghost for Jellicent and non-Psychic Cresselia. However, the ability to switch moves and potentially use Taunt is usually more useful. Wacan Berry Keldeo can lure in Electric-types, such as bulky Zapdos and Thundurus-T, but loses out on a lot of power by giving up Water Gem.</p> ",
    "sets": [
      {
        "name": "Bulky Reflect",
        "description": "<h1>Set Description</h1> <p>Reflect allows Keldeo to take on various physical attackers such as Garchomp, Sawk, and Choice Band Snorlax. Water Gem-boosted Hydro Pump does immense damage to neutral and super effective targets such as Genesect and Volcarona. Secret Sword OHKOes non-Chople Berry Tyranitar and gives Keldeo a better matchup versus Snorlax and Scrafty. Taunt provides utility for Keldeo, stopping various setup Pokemon like Calm Mind + Acid Armor Manaphy and Iron Defense + Amnesia Registeel. Icy Wind allows Keldeo to be more consistent against Haxorus and Garchomp.</p> <h1>EVs</h1> <p>The defensive investment allows Keldeo to defeat Fighting Gem Conkeldurr by setting Reflect, as well as various other physical attackers like Sawk, Haxorus, and Garchomp. The Speed investment allows Keldeo to outspeed Garchomp.</p> <h1>Usage Tips</h1> <p>Versus Snorlax, Keldeo must guess which set the opponent is using. Choosing to use Reflect versus Choice Band Snorlax wins, but then Keldeo may be blown back by Custap Berry + Belly Drum variants. If Keldeo uses Secret Sword, Choice Band Snorlax has a chance to OHKO it, but Snorlax will not be able to set Belly Drum. Each option is equally precarious. If Snorlax uses Defense Curl, Amnesia, Seismic Toss, or Rest, it is a stall variant, so use Taunt if you have it.</p> <p>Against some physical attackers like Conkeldurr, it always best to set Reflect before attacking. If Keldeo is carrying Icy Wind, it should use it versus Sawk, Haxorus, and Garchomp. If Keldeo is not, it should attack them and hope they are not holding Choice Scarf.</p> <p>Taunt allows Keldeo to act as a blanket check to stall Pokemon. If Keldeo is carrying Taunt, it should be used versus Manaphy, especially if you see it has Mail at Team Preview.</p> "
      },
      {
        "name": "All-out Offensive",
        "description": "<h1>Set Description</h1> <p>Keldeo's Water Gem-boosted Hydro Pump is immensely powerful; it OHKOes various Electric-types like Zapdos and Thundurus-T if they lack significant investment in bulk. So, at the teambuilding stage, they have to decide whether defeating Keldeo is worth sacrificing Speed. Secret Sword does consistent damage versus Snorlax and OHKOes non-Chople Berry Tyranitar. Icy Wind allows for Keldeo to be more reliable versus various Choice Scarf users like Haxorus, Sawk, and Garchomp. Taunt allows Keldeo to defeat stall Pokemon such as Manaphy and block Crustle's Shell Smash.</p> <h1>EVs</h1> <p>4 Special Defense EVs force Genesect to get an Attack boost from Download instead of a Special Attack boost.</p> <h1>Usage Tips</h1> <p>In most cases, offensive Keldeo just uses its best damaging move.</p> <p>Use Icy Wind against Sawk, Haxorus, and Garchomp turn one to defeat Choice Scarf variants.</p> <p>Versus Crustle and stall Pokemon like Mail Manaphy, use Taunt.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 493772, "username": "Lumii"}, {"user_id": 408904, "username": "neomon"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}], "writtenBy": [{"user_id": 518399, "username": "Itchy"}]}
  }
}