{
  "Scrafty": {
    "sets": [
      {
        "name": "Chople Counter",
        "description": "<h1>Set Description</h1> <p>Fake Out allows Scrafty to freely damage most Pokemon and bypass Sturdy from Pokemon like Magnezone and Sawk. High Jump Kick is Scrafty's strongest STAB attack and allows it to beat many common threats such as Slaking, Heatran, and Tyranitar. It is also Scrafty's strongest option against neutral targets. Payback is used over Crunch due to Scrafty's low Speed stat, which allows Scrafty to underspeed Choice Scarf Cresselia even after Cresselia uses Trick. Counter, Chople Berry, and Intimidate beat physical Fighting-types such as Sawk, Mienshao, and opposing Scrafty.</p> <h1>EVs</h1> <p>Maximum HP and 80 Special Defense EVs allow Scrafty to survive a Dragon Gem Latios's Draco Meteor while and OHKO back with Payback. The rest of the EVs are dumped into Attack to allow Scrafty and maximize Scrafty's damage.</p> <h1>Usage Tips</h1> <p>Fake Out allows Scrafty to break Magnezone and Sawk's Sturdy, and High Jump Kick and Counter can OHKO them. Against physical Fighting-types, such as Mienshao, Conkeldurr, Hariyama, and opposing Scrafty, it is always advisable to use Fake Out into Counter. However, Bulk Up variants can still beat Scrafty. Against Conkeldurr, after using Fake Out, it is important to then use Counter. If Conkeldurr attacks with Hammer Arm, Counter wins. However, if Conkeldurr uses Mach Punch, using High Jump Kick on the third turn is a favorable damage roll. Scrafty also has a decent matchup against Snorlax. However, it is important to play around the possibility of Counter by using Payback after Fake Out, as this allows Scrafty to always OHKO with High Jump Kick after. However, this strategy does fail against Belly Drum Snorlax; if you suspect Belly Drum, use High Jump Kick on turn two.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 518399, "username": "Itchy"}, {"user_id": 437679, "username": "crucify"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 493772, "username": "Lumii"}]}
  }
}