{
  "Hitmontop": {
    "overview": "<p>Even though Hitmontop has had a mediocre reputation in singles throughout all generations, its movepool and ability make it perfect for Doubles. With access to Intimidate, Fake Out, and Wide Guard, Hitmontop is the master of creating free turns. It can switch in on the majority of physical attackers in the tier, and proceed to immobilize the more threatening half of the opposition for a turn; Hitmontop is also able to break Protect with Feint and shut down spread moves with Wide Guard. It does not end here, for Hitmontop's Fighting Gem-boosted Close Combat allows it to OHKO Chople Berry Tyranitar, Heatran, and Kingdra; the move also deals heavy damage to almost anything that doesn't resist it, allowing Hitmontop to fill the role of a supporter and a powerful attacker with the same moveset, increasing its versatility.</p> ",
    "comments": "<h1>Other Options</h1> <p>Almost all of Hitmontop's other options don't really shine in Doubles. You could, of course, run some extremely situational items, such as Coba Berry for Flying-types on the bulky set or Dark Gem on the offensive set to KO Latios, but item-wise, Hitmontop usually won't utilize anything as consistently as Fighting Gem or Sitrus Berry. Stone Edge can be used specifically to hit Flying-types, such as Zapdos and Thundurus, who would otherwise give Hitmontop a lot of trouble. A spread of 4 HP / 252 Atk / 252 Spe is also usable to avoid other Hitmontop's Fake Outs, whilst catching Pokemon such as Breloom off guard with a Fighting Gem-boosted Close Combat.</p> <p>A completely different set would be a priority attacking set with Life Orb and Technician. It takes a completely different approach to using Hitmontop, and could provide strong Fake Outs and Mach Punches, which, when used alongside Sucker Punch, would create perfect neutral priority coverage. This would of course, mean that Hitmontop would have to give up Intimidate, and because Intimidate is one of the best abilities in the metagame, it would be a harsh loss to suffer.</p> <h1>Checks and Counters</h1> <p>Perhaps Hitmontop's biggest problem is sturdy, hard-hitting Flying-types with STAB moves. Zapdos or Thundurus carrying Hidden Power Flying will severely damage Hitmontop, and Hitmontop cannot do much in return bar hitting them with the rare Stone Edge. Even if it has Stone Edge, it won't be able to OHKO Zapdos, and only has a 12.5% chance to OHKO 4 HP / 0 Def Thundurus. Defiant Tornadus is the most problematic Flying-type, considering it not only ignores Intimidate, but gains a boost from it, allowing it to easily OHKO Hitmontop with Flying Gem-boosted Acrobatics. Bisharp will make the Hitmontop user think twice about switching it in, as Bisharp also has access to Defiant. Bulky Psychic-types, such as Cresselia, Jirachi, and Metagross, will also be able to completely stop Hitmontop in its tracks, whilst usually 2HKOing in return. Ghost-types with Will-O-Wisp, Dusclops and Jellicent, can prove to be a living hell for Hitmontop, as there is no way Hitmontop can touch them. The presence of Ghost- and Psychic-types alone will usually allow said Pokemon to take advantage of the team spot that is now filled with dead weight.</p> ",
    "sets": [
      {
        "name": "Offensive Utility",
        "description": "<p>When it comes to shutting down physical attackers in Doubles, Hitmontop is one of the best due to its access to the notorious combination of Intimidate and Fake Out. This moveset allows Hitmontop to effectively utilize its access to Intimidate, Fake Out, and Close Combat to the fullest extent. Thanks to the Fighting Gem, Close Combat will be hitting hard, even off of Hitmontop's below average base 95 Attack stat. Feint is useful for breaking the ever so common Protect, allowing Hitmontop's partner to snipe down the cowardly Pokemon. Sucker Punch is a good alternate option, as it lets Hitmontop pick off weakened threats; it also forms the extremely effective Fighting + Dark coverage along with Close Combat, and is especially useful for hitting Latios and Latias hard. In the last spot, Wide Guard is usually the preferred option, as it lets Hitmontop create protect itself and its teammate from Blizzards, Rock Slides and Surfs. Teammates weak to these common spread moves love the support it can provide; however, if you don't feel comfortable with Wide Guard or if your team isn't weak to spread moves at all, Detect is a great option. Detect is used over Protect because it stops Hitmontop from being hampered by the combination of Protect + Imprison.</p> <p>The EVs allow Hitmontop to outspeed standard Rotom-W whilst optimizing its attacking prowess. The rest of its EVs are invested into HP to utilize its decent bulk and access to Intimidate. An alternative spread of 252 HP / 252 Atk / 4 Spe could be used to completely optimize Hitmontop's bulk, but missing out on Rotom-W and things slower than it is usually not worth the extra bulk. If you want Hitmontop to last longer, Sitrus Berry is a viable option, but Hitmontop loves to fire off a powerful first hit, making Fighting Gem the better option.</p> <p>Almost any Pokemon can use the massive support that comes from Intimidate and Fake Out, making Hitmontop really easy to fit on a lot of teams. A noteworthy partner that works wonders alongside Hitmontop is Quiver Dance Volcarona; the combination of Fake Out and Wide Guard will help shield Volcarona from its despised spread weaknesses to Rock Slide and Surf.</p> "
      },
      {
        "name": "Support",
        "description": "<p>This set lets Hitmontop survive hits that would otherwise OHKO a more offensive variant. You will often see Hitmontop switch in many times in a match and immobilize the opposition for at least a turn, aiming to provide as many free turns as possible for a teammate to dish out damage or set up with moves such as Trick Room, Tailwind, or even Quiver Dance, in Volcarona's case. Fake Out and Close Combat are obligatory, as they prevent the foe from moving for a turn and dish out heavy damage respectively. When it comes to choosing between Feint and Helping Hand, you really should consider what fits your team best. Feint is a great option if you have problems with offensive Pokemon that like to use Protect, as it can expose unsuspecting victims, such as Deoxys-A, that feel they're safe behind a Protect. Helping Hand is awesome for Pokemon that like to use spread moves, as it easily patches up the 25% power drop, even boosting the moves past their normal base power.</p> <p>With the given spread, Hitmontop will be able to take both Psyshock and Dragon Gem-boosted Draco Meteor from Latios, whilst healing a portion of its health back up with the Sitrus Berry. The remaining EVs are dumped into Attack to hit things harder with Close Combat. You could alternatively try shifting the EVs from Attack to Special Defense, just to have overall better bulk after Intimidate. This new spread would be 252 HP / 64 Def / 192 SpD; however, the extra attack could prove useful against Pokemon weak to Close Combat, such as Tyranitar, Heatran, and Terrakion.</p> <p>As this set revolves more around supporting teammates, Hitmontop is now the optimal Volcarona partner if Hitmontop has Helping Hand, as Volcarona can do tons of damage with Helping Hand-boosted +1 STAB Heat Wave. This Hitmontop also pairs extremely well with Substitute + Protect Heatran, as Hitmontop can block incoming Earthquakes with Wide Guard whilst using Fake Out to create a free turn to set up a Substitute. Other than that, Hitmontop generally supports almost any Pokemon extremely well, especially with its newfound bulk.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Laga", "user_id": 176920}], "teams": [{"name": "Quality checked by", "members": [{"username": "Mizuhime", "user_id": 51961}, {"username": "Joim", "user_id": 161822}, {"username": "Nollan", "user_id": 161530}]}, {"name": "Grammar checked by", "members": [{"username": "Arkian", "user_id": 174386}, {"username": "-Tsunami-", "user_id": 30130}]}]}
  },
  "Togekiss": {
    "overview": "<p>Togekiss is one of the best support Pokemon in the Doubles metagame. It has one of the largest array of support moves in its arsenal, including the unique combination of Follow Me and Tailwind. Togekiss's bulk is awesome, and it happens to be one of the most specially bulky users of Follow Me and Rage Powder. It's no slouch in the offensive department either, with a whopping base 120 Special Attack. Its typing is queer, having the ability to evade the common Earthquake. However, this renders it vulnerable to other common moves such as Blizzard and Rock Slide. Nonetheless, Togekiss is an extremely versatile Pokemon and should definitely be considered for a slot on your team.</p> ",
    "comments": "<h1>Other Options</h1> <p>Roost is a great option to heal yourself when necessary. Body Slam is also a great option for spreading paralysis as it bypasses Taunt. Togekiss can also run an interesting support set with dual screens, but is outclassed by Pokemon such as Cresselia in this regard. Tri Attack is usable for spreading debilitating status effects onto your opponent. Hyper Voice is Togekiss's strongest spread move and benefits from STAB, but its poor coverage is disappointing. ExtremeSpeed can catch opponents off guard, but has a poor damage output and thus is a waste of a moveslot. After You is an interesting option for speeding up your team, but has major limitations that prevent it from being effective. Togekiss can also function as a weather inducer with Sunny Day or Rain Dance, but the above sets are better. Togekiss also has other interesting moves such as Magic Coat, Encore, and Safeguard, but these function on a case-by-case basis.</p> <h1>Checks and Counters</h1> <p>Togekiss is weak to Blizzard and Discharge, and due to these moves being common in Doubles, Togekiss might have trouble finding turns to set up. Blizzard users include Abomasnow, Kyurem, and Rotom-F, while Discharge users include Zapdos, Rotom-W, and Thundurus. Taunt users that outspeed Togekiss, including Prankster users, can prevent Togekiss from using its support moves and render it helpless, barring the moderately powerful Air Slash. Rock Slide is also a threat to Togekiss, and thus it has to beware of users such as Tyranitar, Terrakion, Landorus-T, and Excadrill. Togekiss, like any other Tailwind user, is quite vulnerable to Trick Room, and thus steps should be taken to prevent it from being set on the field.</p> <p>Common Electric Pokemon such as Zapdos are thorns in Togekiss's side, but might not necessarily OHKO it, allowing Togekiss to unleash a Tailwind or Thunder Wave before death. Rain-boosted Swift Swim users such as Kabutops can also outspeed Togekiss and deal heavy damage, and Sand Rush-boosted Excadrill can do the same. Steel-types are checks to Togekiss as they can handle Air Slash with ease, but are usually unable to stop Togekiss from playing its support role.</p> ",
    "sets": [
      {
        "name": "Tailwind Support",
        "description": "<p>This set invests in bulk in order to maximize sustainability for Togekiss, permitting it to set up multiple Tailwinds throughout the match. Tailwind is an obvious option to double the Speed of all your teammates for three turns, granting a tactical advantage that has been the staple of many Doubles cores. Air Slash is an option to deal with slower and bulkier threats, such as Cresselia, while your sweepers wreak havoc on the other opponent. It also boasts a 60% chance to flinch opponents, rendering them motionless for that turn. Follow Me is a great option to grant setup opportunities for your teammate, as it lures all the opponents' attacks onto Togekiss's giant bulk and keeps your teammate safe. Protect is a classic option in Doubles to defend Togekiss from attacks, possibly leaving your teammate free to attack the opponent or to shield it from multi-hit moves. Helping Hand is a wonderful option to grant a 50% power boost to your teammate, allowing it to deliver powerful blows to the opponents.</p> <p>The Speed EVs allow Togekiss to outspeed Cresselia, minimum Speed Rotom-W, and some faster Hitmontop variants. 248 HP EVs are used so Togekiss can attain an odd HP number to receive less damage from hail and sandstorm. The rest of the EVs are put into its already stellar Special Defense as an extra boost. 176 Speed EVs can be used to outspeed maximum Speed neutral base 70s, specifically Hitmontop and Ludicolo. 16 Defense EVs can be given to allow Togekiss to survive a Choice Band- or Helping Hand-boosted Rock Slide from Tyranitar. A Sitrus Berry is given instead of Leftovers as it is more useful in sand and hail, being able to restore 25% of Togekiss's health instead of being nullified by weather. Additionally, it is more helpful in allowing Togekiss to tank two attacks in a turn.</p> <p>Togekiss usually aids teammates instead of having teammates aid it; it works well with powerful teammates with middling Speed such as Kyurem-B, Hydreigon, Breloom, Metagross, and more. Mold Breaker Excadrill is a great partner for Togekiss, with Follow Me to allow a Swords Dance boost; it can also use Earthquake freely, as Togekiss is immune to Ground-type attacks. Hitmontop is also a good partner thanks to Intimidate, helping to cover Togekiss's weaker Defense while providing Wide Guard support to protect Togekiss from Blizzards, Rock Slides and Discharges. Heracross and Mamoswine are also decent partners, having good synergy with Togekiss and appreciating Tailwind support. Heracross can defeat the Rock- and Ice-types that threaten Togekiss, while Mamoswine handles Electric- and Ice-types. Landorus-T can also be used, but has to beware of Blizzard.</p> "
      },
      {
        "name": "Bulky Paralyzer",
        "description": "<p>This Togekiss set works wonderfully on bulky offense teams due to its ability to Thunder Wave a majority of the opponents and slow them down for your sweepers. Air Slash is a great move in combination with Thunder Wave, granting the paraflinch combo. Not to mention Togekiss also has Serene Grace, being able to double the rate of flinching from Air Slash and therefore being able to keep the opponent immobile for longer. Follow Me is Togekiss's advantage over other Thunder Wave users such as Thundurus—the ability to lure attacks aimed at your partner and tank them with great special bulk is a huge selling point. Protect, as usual, is to defend Togekiss from attacks that are aimed at it. Helping Hand is a great move to give your partner a 50% power boost, allowing it to annihilate the already paralyzed opponents.</p> <p>The EVs are specially tailored to allow Togekiss to survive a multitude of powerful attacks, namely Rock Gem Terrakion's Rock Slide, Dragon Gem Latios's Draco Meteor, Thundurus's Thunderbolt, and Choice Specs Rotom-W's Thunderbolt. The HP EVs are given an odd number in order to reduce damage taken from sandstorm and hail. A Sitrus Berry is used to grant greater longevity, helping Togekiss take two attacks in one turn and is overall more useful than Leftovers in this metagame.</p> <p>Togekiss works great with bulky offensive Pokemon that benefit from opponents getting paralyzed, allowing them to go first and wreak havoc. These Pokemon include Metagross, Landorus-T, Heatran, and Kyurem-B. Hitmontop is once again a good partner with Intimidate to cover Togekiss's weaker Defense and can also use Wide Guard to protect Togekiss from the likes of Rock Slide, Blizzard, and Discharge.</p> "
      },
      {
        "name": "Offensive Tailwind",
        "description": "<p>Togekiss isn't only meant to function defensively; it can also go offensive thanks to its useful base 120 Special Attack. Tailwind is on the set in order to increase the Speed of the whole team, while Air Slash is for a reliable STAB and helpful flinches. Heat Wave is a good Fire-type move that can hit both opponents for decent damage and has a nice 30% chance to burn them. Aura Sphere is another reliable option to induce solid Fighting-type damage onto the opponent. Protect is useful in this instance to stall out Trick Room turns, while Helping Hand is good for boosting allies, especially when Togekiss's coverage is ineffective in that particular situation.</p> <p>208 HP EVs are used to give Togekiss an odd HP number to reduce damage from sandstorm and hail. 48 Speed EVs are given to allow Togekiss to outspeed 4 Speed base 85s, most notably Cresselia. Sitrus Berry is given to grant Togekiss greater longevity and to take more hits, while Flying Gem can give Togekiss a cool one-time damage boost. Fire Blast or Flamethrower can be used instead of Heat Wave for greater damage on individual opponents.</p> <p>Good teammates should have good coverage in tandem with Togekiss so they can take out bulkier opponents such as Cresselia. Tyranitar and Chandelure are good choices in this regard, and also benefit from Tailwind. Mamoswine and Heracross are also good partners—Mamoswine has good coverage and enjoys the flinches that Togekiss deals onto the opponent, while Heracross enjoys the Helping Hand support which permits it to OHKO Cresselia, and also beats the Ice- and Rock-types that trouble Togekiss. Hitmontop's Intimidate comes in handy to cover up Togekiss's weaker Defense, and its Wide Guard support grants protection against Blizzard, Rock Slide, and Discharge.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Metal Sonic", "user_id": 158673}, {"username": "Level 51", "user_id": 118474}], "teams": [{"name": "Quality checked by", "members": [{"username": "Audiosurfer", "user_id": 136301}, {"username": "Nollan", "user_id": 161530}, {"username": "Mizuhime", "user_id": 51961}]}, {"name": "Grammar checked by", "members": [{"username": "Arkian", "user_id": 174386}, {"username": "GatoDelFuego", "user_id": 91628}]}]}
  },
  "Volcarona": {
    "overview": "<p>Volcarona has one of the best offensive typings in the Doubles metagame. Its STAB attacks hit everything from Cresselia to Bisharp for super effective damage, and it even gains useful resistances to Ice- and Fighting-type moves. To make life even better, it has a massive Special Attack stat, alongside a solid base Speed. It even gets additional support options in Tailwind and Rage Powder. To top it all off, it is one of the few Pokemon capable of making use of setup moves in Doubles, which it does through Quiver Dance.</p> <p>Unfortunately, even a fire-spewing moth has its faults. It is held back in that it has a mediocre Defense and a 4x weakness to Rock-type moves, leaving it susceptible to Rock Slide. Furthermore, a Water weakness leaves it begging for mercy against the majority of rain teams. It also has little coverage outside of its STABs. Fortunately, this rare species of \"Volcano Moth\" is far from extinct, as its lethal STAB combination is capable of taking down many common Doubles threats, including Cresselia, Breloom, Scizor, Hydreigon, and others.</p> ",
    "comments": "<h1>Other Options</h1> <p>Fire Blast and Fiery Dance can be alternate Fire STABs, as they pack more power than Heat Wave at the cost of only being able to hit one target at a time and do not have a Special Attack drop like Overheat. Hidden Power Ground can achieve coverage against Heatran and anything else Volcarona struggles to hit; however, it is lacking in power and requires giving up a moveslot. Hurricane and Psychic can be used, taking out Hitmontop and other Fighting-types, but they are generally inferior to a Fire Gem boosted Overheat, which deals more damage. Giga Drain damages Politoed and can heal Volcarona, extending its longevity. Magnet Rise can surprise the opposition with a Ground-type immunity, but it is generally outclassed by Volcarona's support options in Tailwind and Rage Powder. Finally, Sunny Day can be used to mess with weather and buff Volcarona's Fire-type STAB to incredibly powerful levels, and SolarBeam can be used alongside it, hitting Rock- and Water-type Pokemon for heavy damage.</p> <h1>Checks and Counters</h1> <p>Heatran is more or less the ultimate Volcarona counter; bar the rare Hidden Power Ground, it walls every Volcarona in and out offensively. Heatran can easily hammer Volcarona back with Heat Wave, and Substitute Heatran can set up in Volcarona's face, making it even more difficult to take down. Chandelure is also a wonderful counter to Volcarona and can do what Heatran does by walling it and hammering it with repeated Heat Waves or setting Trick Room without fear of Volcarona's attacks.</p> <p>Faster physical attackers, such as Terrakion, Landorus, Excadrill, and Garchomp, can move first and OHKO Volcarona with Rock Slide. Volcarona can do little back to most of these, but if it has a Quiver Dance up, it can outspeed and deal heavy damage, so be cautious. Excadrill gets a special mention, as Volcarona will need two Quiver Dance boosts to beat it. One rare potential check is Stone Edge Hitmontop, which could trick Volcarona into thinking it is not an offensive problem. It is utterly destroyed by a Fire Gem Overheat though, so it needs to be played with caution. Rain in general will also give Volcarona trouble. Swift Swim Pokemon, particularly Kabutops and Kingdra, can run right through it with their respective STABs and can tank an unboosted Bug Buzz. Volcarona additionally hates opposing speed control; in particular, Thunder Wave and Trick Room will cripple it. Once it is slowed, a variety of slow threats can pick it off.</p> ",
    "sets": [
      {
        "name": "Rage Powder",
        "description": "<p>Despite its lower bulk, Rage Powder Volcarona has some good matchups as a pure redirector over Amoonguss. Most notably, it can outspeed and redirect Hitmontop's Fake Out, even having a 30% chance to burn with Flame Body. It also forces Latios to Draco Meteor, isn't Taunt bait in front of Thundurus, and safely redirects Substitute Kyurem-B, Scizor, Cresselia, and Conkeldurr. However it is destroyed by rain teams, and Stealth Rock often forces it to be kind of a suicide lead.</p> <p>Overheat OHKOes most Fire-weak Pokemon even without investment such as Metagross and does solid damage to frail neutral targets. Tailwind is a good greed option, but Bug Buzz is safer for solid damage against Water-types, Latios, and Tyranitar.</p> <p>Sitrus Berry gives Volcarona extra longevity. The EV spread outspeeds Hitmontop and survives Latios's Gem Draco Meteor while maximizing physical bulk for redirecting Fighting- and Steel-types. Volcarona needs Modest nature and near maximum investment to OHKO Amoonguss with Overheat, which generally isn't worth it, but could be. You can also run 252 SpA with Modest Fire Gem for a solid chance to OHKO Thundurus with Overheat, but the loss of bulk will be even more notable.</p> <p>This set pairs well with fast and heavy-hitting Pokemon that have good defensive synergy with Volcarona such as Latios, as Volcarona draws in attacks and paralysis, allowing its teammates to live longer. Anything that can get past Heatran, such as Garchomp, Landorus, Breloom, and Gastrodon, is also very helpful, as Volcarona has a lot of trouble with it.</p> "
      },
      {
        "name": "Quiver Dance",
        "description": "<p>Volcarona is one of the few Pokemon that can successfully utilize setup moves in Doubles. After a Quiver Dance, it can rip through entire teams, as its STAB attacks get great coverage. Heat Wave provides a spread move and is lethal after a Quiver Dance boost. Bug Buzz is Volcarona's most powerful secondary STAB, dealing heavy damage to threats like Hydreigon and Cresselia. Protect allows Volcarona to evade dangerous attacks while your partner handles things.</p> <p>Modest Life Orb is needed to OHKO Tyranitar and Cresselia with +1 Bug Buzz and Landorus-T with +1 Heat Wave, so that's generally the best item to avoid a revenge kill. Lum Berry allows Volcarona to avoid being crippled by paralysis, especially from Thundurus, but since Volcarona does not OHKO at +1 anyway, Lum Berry is not a matchup on its own. A Timid nature can be used to outspeed Hydreigon at +0 and Jolly Scarf Landorus-T at +1 but Heat Wave becomes a shaky roll to OHKO Landorus-T. A bulkier spread using a Bold nature can be used, as it allows Volcarona to tank more hits, though the standard spread is generally better as it does not require a Quiver Dance to deal heavy damage.</p> <p>Good teammates for this set include Rage Powder and Fake Out users, such as Amoonguss and Hitmontop, which make setting up easier. Hitmontop is also capable of guarding Volcarona from dangerous spread attacks such as Muddy Water and Rock Slide with Wide Guard. Anything that can take out Heatran, such as Garchomp and Rotom-W, also makes a good partner. Fast Pokemon such as Latios also help against other fast Pokemon packing Rock Slide, such as Garchomp and Terrakion. Weavile, in particular, is good alongside this set, as it has high Speed, can provide Fake Out support, and can nail a lot of counters, such as Choice Scarf Tyranitar, Terrakion, and Garchomp for heavy damage; watch out for Tyranitar with Chople Berry, though, because it can tank a Low Kick and get a double KO with Rock Slide. Breloom and Virizion can also make solid partners, using STAB moves to take out Rock-types and bulky Water-types, both of which give Volcarona trouble, along with archetypal rain and sand teams in general. Breloom can also help shut down troublesome threats with Spore.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Nollan", "user_id": 161530}], "teams": [{"name": "Quality checked by", "members": [{"username": "tofucocoa", "user_id": 34584}, {"username": "Pocket", "user_id": 95}, {"username": "Level 51", "user_id": 118474}]}, {"name": "Grammar checked by", "members": [{"username": "Ender", "user_id": 192999}, {"username": "melvni", "user_id": 64080}]}]}
  },
  "Suicune": {
    "overview": "<p>Suicune is one the unsung heroes of the Doubles metagame. With a great pure Water typing, excellent bulk, and a great movepool, Suicune can fit onto a variety of teams. It can provide great support and speed control to a team through Tailwind and Icy Wind, without being dead weight like some other defensive Pokemon. The only thing letting Suicune down is its mediocre base Speed. However, this isn't as big of a deal in Doubles as it is in Singles and can be mitigated easily.</p> ",
    "comments": "<h1>Other Options</h1> <p>Suicune has a few other great options it can run, though they are usually better used by other Pokemon. It has the ability to set literally any weather manually, notably rain and hail, making it a good fit on weather teams who could use an additional bulky weather setter. Additionally, Suicune has access to Calm Mind, which can make for a very interesting last Pokemon situation with its ChestoRest set. Overall, any set that plays off of Suicune's excellent bulk will usually work well.</p> <h1>Checks and Counters</h1> <p>Suicune's biggest threat is Thundurus. With Prankster Taunt and Thunder Wave as well as a strong STAB Thunderbolt, Thundurus can hit Suicune hard, dealing massive damage, or just screw up any sort of set up Suicune attempts and paralyze a good majority of your team before it finally gets taken out. Other threats are faster attackers with super effective coverage, including, but not limited to, Shaymin-S, Ludicolo under rain, and Zapdos as well as Latios, Latias and to a lesser degree, Hydreigon, who all resist Suicune's STAB Water-type attacks; the last three can all hit Suicune hard with a Draco Meteor. Another threat is Ferrothorn, who hits Suicune super effectively, only really fears a burn from Scald, and doesn't care about Icy Wind and Snarl in the slightest. This is also true for Kyurem-B, as it almost always carries Fusion Bolt and is bulky enough to shrug off any attack Suicune carries. Gastrodon is a great bulky check, as it walls Suicune completely, absorbing its STAB Water-type moves. Chlorophyll users are another big threat, especially Sawsbuck and Lilligant. With their powerful Grass-type attacks, they can easily outspeed and subdue Suicune. Abomasnow also fits this description, being able to kill Suicune with Giga Drain or Wood Hammer. Finally, Defiant Pokemon cause trouble for any set that uses Icy Wind or Snarl; Bisharp is a notable example, gaining Attack boosts and threatening Suicune with powerful moves such as Sucker Punch.</p> ",
    "sets": [
      {
        "name": "Bulky Support",
        "description": "<p>With defensive investment and supporting moves, this set aims to reduce your opponent's team's offensive capabilities, in addition to still dealing damage and letting your teammates come in more easily. This set also tries to force switches from your opponents, disrupting their entire strategy. Snarl and Icy Wind are two great spread attacks with a 100% chance of lowering the opponent's Special Attack and Speed, respectively, which is a big deal in a metagame all about Speed and power control. Tailwind is something every person should consider when running Suicune, as it is easily one of the best users of the move in the game. Scald is the STAB move of choice due to its 30% chance to burn opponents, which makes for a total of three stat-reducing moves. Protect is the obvious choice in the last slot to prevent damage and effects for a turn; however, Rest allows Suicune to stick around longer and cause even more mischief.</p> <p>Suicune's EVs are highly specific. After an Icy Wind, it outspeeds up to base 110s, a Speed tier most notably including Latias and Latios. Suicune's bulk allows it to live Dragon Gem-boosted Draco Meteors from Timid Latios and Modest Hydreigon with plenty of HP to spare. Coupled with Snarl, Suicune can further lower their Special Attack stats, crippling them and forcing them to switch. The item selection here depends on what role Suicune plays on your team and how long it needs to be around to do what you need it to. While Sitrus Berry is usually the better choice, Wacan Berry will give Suicune a one-time safety net from Electric attacks, while Chesto Berry can let Suicune Rest off any damage and ailments and get right back into the action. Between burns, Snarl and Icy Wind, Suicune's job is to cripple the opponent's offense and cause mayhem, which it does with aplomb. This Suicune works well with Intimidate support and Light Screen, making Hitmontop, Cresselia, Gyarados, and Salamence all good partners. Be wary of Tornadus and Bisharp, though, as their Defiant ability can make them very hard to deal with if you spam stat-lowering moves willy-nilly.</p> "
      },
      {
        "name": "Offensive Tailwind",
        "description": "<p>Suicune's Tailwind set is one of its better sets in Doubles. Access to Tailwind while being resistant to Ice-types moves gives Suicune a very important niche, thanks to all of the Icy Winds flying around. Tailwind support, although sometimes inferior to other forms of speed control, is a very solid and easy way to make everything on your team super-fast, giving average to low Speed Pokemon a chance to run over the opposing team for four turns, counting the turn Tailwind is used. The choice of moves following Tailwind is up to the player. Scald offers a good 30% burn chance, while Hydro Pump gives Suicune a huge punching tool, albeit a bit less accurate. Ice Beam gives it good coverage against everything but other Water-types. The last move depends on what your team needs. Protect is an obvious choice in Doubles, giving Suicune a full turn of protection from everything bar passive weather effects. Roar, however, has the interesting effect of being able to phaze out Trick Room-inducers just before they can set up, which is important as Tailwind teams usually fare horribly in Trick Room.</p> <p>Suicune's EVs let it outspeed all positive-natured base 70s. This includes Politoed, Cloyster, and the ever-important Breloom. Outrunning Breloom lets Suicune get off a Tailwind before it can be Spored. Also, after Tailwind is up, Suicune outspeeds even Choice Scarf Latios. Maximum investment in Special Attack gives Suicune as much power as possible. There's nothing better than surprising your opponent with a very powerful Hydro Pump coming off what is usually seen as a wall. The remaining EVs are dumped into HP to complement Suicune's already high natural bulk. Suicune can also run a spread of 28 HP / 252 SpA / 228 Spe with a Modest nature for more power in exchange for bulk. Suicune can also run a spread of 252 HP / 120 SpA / 136 Spe with a Timid nature for a far bulkier set than the earlier mentioned one that still retains a punch.</p> <p>The item choice here is usually dependent on what your team needs more. Wacan Berry is more useful overall, as Electric-type attacks are far more common than Grass-type attacks and Suicune's natural bulk can only let it take so much. After all, Sitrus Berry is of no use if you're already dead. Sitrus does have its uses though, especially on sand and hail teams where passive damage can add up quickly. Water Gem could also be used to give Suicune a powerful one-time nuke.</p> <p>This particular set works well on bulky offense teams, where members hit really hard and can take hits but lack the Speed to do a lot of damage to the other team. Grass-types make really great partners in particular, as their STABs hit the main thing Suicune can't, namely bulky Water-types. Breloom is one of the best partners Suicune could ask for, as it forces the opponent to make it a priority while Suicune sets up, thus letting the two go to town on the opponent in tandem with one another. Amoonguss is another great partner, almost guaranteeing Tailwind being set up with the Rage Powder and Spore support it can provide. Amoonguss also gives your team a bit of cushion against Trick Room teams thanks to its low Speed. Abomasnow is also a good partner, as it lets Suicune use Blizzard over Ice Beam, thus giving Suicune a great spread attack. Abomasnow also provides a Grass-type STAB attack for dealing with bulky Water-types.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "BlankZero", "user_id": 156102}], "teams": [{"name": "Quality checked by", "members": [{"username": "Audiosurfer", "user_id": 136301}, {"username": "Nollan", "user_id": 161530}, {"username": "Level 51", "user_id": 118474}]}, {"name": "Grammar checked by", "members": [{"username": "-Tsunami-", "user_id": 30130}, {"username": "melvni", "user_id": 64080}]}]}
  },
  "Heatran": {
    "sets": [
      {
        "name": "Substitute",
        "description": "<ul> <li>Heatran has an excellent defensive typing, resisting common types such as Dragon and Steel. This, alongside good natural bulk, allows Heatran to easily set up Substitute. With the lack of abundant Fire-resistant Pokemon, Heatran behind Substitute becomes a formidable wincon by continuously chipping the opponent's team with its spread STAB attack, Heat Wave. All in all, its typing and being the only reliable Fire-type make Heatran a mainstay in the metagame.</li> <li>Earth Power is only for opposing Heatran but can do reliable damage against Fire-resistant Pokemon, such as Tyranitar and Kingdra.</li> <li>Heatran aims to set up Substitute as quickly as possible, protecting it from moves that can OHKO it, such as Latios's Hidden Power Ground and Landorus-T's Earthquake, while allowing it to freely chip the opponent's team with Heat Wave. With the lack of abundant Fire-resistant Pokemon, Heatran oftentimes can exert immense offensive pressure with its Heat Wave by forcing Protect and switches, allowing it to generate free opportunities to set up Substitute.</li> <li>Heatran benefits greatly from Thundurus. In addition to Thundurus checking Water-types, its Prankster Thunder Wave can allow Heatran to outspeed threats, such as Latios, and set up Substitute while fishing for a full paralysis. Tyranitar is another excellent teammate due to its ability to check opposing Heatran, Thundurus; which can stop Heatran's Substitute with Taunt; Latios, and Cresselia. Heatran's Substitute can also stall for extra turns, allowing the sand damage to add up on the opposing team while Heatran recovers HP through Leftovers, thanks to its Steel typing. Amoonguss can facilitate Substitute with Spore or redirect super effective hits with Rage Powder. Finally, Latios and Cresselia both can threaten Fighting-types, Landorus-T, and opposing Heatran.</li> </ul> "
      },
      {
        "name": "Offensive",
        "description": "<ul> <li>Rather than acting as a wincon, this set makes use of Heatran's excellent typing and role as the only reliable Fire-type by turning it into an offensive attacker. This allows it to be played more aggressively to take advantage of the small number of Fire-resistant Pokemon in the metagame.</li> <li>Shuca Berry allows Heatran to tank a Ground-type attack that would otherwise OHKO it, notably improving the matchup against Latios and opposing Heatran. Earth Power is mainly to hit opposing Heatran super effectively. Flash Cannon is a second STAB attack that does better damage against Kyurem-B, Latios, and Tyranitar. Heatran can opt for more Speed if necessary. For example, 84 Speed EVs allow it to outrun Adamant Choice Scarf Landorus-T under Tailwind.</li> <li>Generally, this set likes to take advantage of Heatran's typing to generate free attacking opportunities by safely switching into resisted attacks. For example, Heatran counters the common Steel-types, such as Metagross and Genesect, so it can be played aggressively by switching directly into them, giving Heatran a free Heat Wave chance.</li> <li>Similarly to Substitute Heatran, Shuca Berry Heatran benefits greatly from Thundurus due to its speed control with Prankster Thunder Wave and its ability to check Water-types, such as Jellicent. Latios and Cresselia are also excellent teammates, as they can threaten Fighting-types, Landorus-T, and opposing Heatran while also having access to speed control. Since this set is worse against rain, Heatran appreciates teammates that can deter Kingdra, such as Jellicent. Finally, Tyranitar benefits from Heatran's ability to remove Steel-types and Amoonguss, and it can deter rain with Sand Stream and threaten opposing Jellicent, Latios, Cresselia, and Heatran.</li> <li>On dedicated Trick Room teams, Heatran can be used as a strong wallbreaker with an EV spread of 252 HP / 4 Def / 252 SpA, a Quiet nature, 0 Speed IVs, Fire Gem or Charcoal for the item, and a moveset of Eruption, Earth Power, Heat Wave, and Protect.</li> </ul> "
      }
    ],
    "credits": {"writtenBy": [{"username": "DaAwesomeDude1", "user_id": 228280}], "teams": [{"name": "Quality checked by", "members": [{"username": "Memoric", "user_id": 215000}, {"username": "Smudge", "user_id": 550367}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Cresselia": {
    "overview": "<p>The metagame of Doubles is vastly different from Singles, and no Pokemon attests to this fact more then Cresselia. A forgotten relic of a long gone age in Singles, Cresselia absolutely shines in this metagame, often known as the \"queen of Doubles.\" Possessing absolutely insane 120 / 120 / 130 bulk, a typing that is rather okay defensively, a useful immunity to Earthquake, and a large supporting movepool more robust than a Swiss Army knife, Cresselia is the ultimate supporter in Doubles, able to both reliably and consistently do her job under almost any circumstance. While she is weak to a few top tier threats such as Tyranitar and Bisharp, it is hard to call Cresselia anything other than the best Pokemon in the tier, and she should always be considered if you need a support Pokemon.</p> ",
    "comments": "<h1>Other Options</h1> <p>Given Cresselia's amazing movepool, it is only natural that the she would have a plethora of other options. Leftovers is an option over Sitrus Berry if you foresee Cresilla commonly living for more than four turns. Psychic is always an option for a little more power against Defense-heavy Pokemon. A Calm Mind set is viable, but it must beware critical hits, status conditions, Taunt, and strong physical Dark-type attacks. Sunny Day is always an option, as it beats Swift Swim and Sand Rush Pokemon and pairs nicely with Heatran, a common partner with Cresselia. Psycho Shift with a Burn Orb is an interesting option that allows Cresselia to spread burns, something she otherwise cannot reliably do. Lunar Dance is a great option for certain teams, as it can give certain key Pokemon a second lease on life. Gravity is a somewhat powerful field effect in Doubles, but it leaves Cresselia open to Ground-type attacks. Some Pokemon such as Heatran appreciate having Levitate, so Skill Swap is always an option, one that can sometimes be used against the opponent as well, such as to remove Storm Drain from Gastrodon. Magic Coat is an option to reflect moves that Cresselia does not enjoy taking such as Taunt and Toxic. Finally, Swagger can be used with a Lum Berry carrying teammate to give it +2 Attack or as a risky gambit against the opponent in order to confuse them.</p> <h1>Checks and Counters</h1> <p>While Cresselia is mighty, she is not unstoppable. First and foremost, Cresselia really doesn't like Fake Out, as it can stop Trick Room, crucial Icy Winds, and all sorts of important support moves. Tying in with this, Cresselia absolutely loathes Taunt, as the move can shut down a lot of her support options. Trick Room and Calm Mind Cresselia both dislike Roar, as it will both erase Calm Mind boosts and phaze Cresselia before she can use Trick Room due to its higher priority. Powerful Dark-types such as Tyranitar and Bisharp are also deadly, with Bisharp being especially such due to gaining +2 Attack every time Cresselia uses Icy Wind against it. Chandelure can deal large chunks of damage to Cresselia with STAB Shadow Ball, while the absolute best Cresselia can do in return is Psyshock. Hydreigon can 2HKO or 3HKO most of Cresselia's sets with Dark Pulse, but it must watch out for the Speed drop from Icy Wind, which will absolutely cripple it until it switches out. Volcarona threatens Cresselia heavily with its STAB Bug Buzz and can even use Quiver Dance to raise its power and give Cresselia even more of a hard time. Genesect's +1 U-turn can seriously damage Cresselia, but it fails to make a significant impact otherwise. Heracross's Megahorn coming off of a Guts boost can also do major damage. Escavalier fears only Hidden Power Fire but avoids being OHKOed by it and deals intense damage with Megahorn. Finally, Scizor only fears Hidden Power Fire from the offensive set, and it threatens Cresselia with its high-power STAB Technician-boosted Bug Bite.</p> ",
    "sets": [
      {
        "name": "Offensive",
        "description": "<p>Despite its low Special Attack, Cresselia is actually a useful attacker, dealing decent damage while retaining solid neutral bulk. Psychic is better than Psyshock because it breaks Kyurem-B's Substitute and deals extra damage to Conkeldurr. Hidden Power Ground prevents Heatran from setting up, while Hidden Power Fire does the same for the less common Scizor. Ice Beam is kind of pathetic, but can 2HKO Ice weak Pokemon like Latios and offensive Thundurus. Thunder Wave and Trick Room are great options for speed control, with which is better just depending on your team. On the flipside, you can run Icy Wind, which does some damage to Ice weak Pokemon, provides some speed control, and lets you run Helping Hand.</p> <p>Expert Belt is used to bluff a defensive set as well as still provide reasonable levels of power and not damage Cresselia with recoil. If you run Icy Wind, you can use 124 Speed EVs to outspeed Tornadus after a single Icy Wind; if you run Trick Room, make sure to give Cresselia a Quiet nature.</p> <p>Ideal partners for this set include Pokemon that can beat those that wall Cresselia. Ground-types such as Excadrill, Landorus, Landorus-T, and Garchomp can not only can murder Tyranitar and Steel-types that give Cresselia headaches but also don't have to worry about hitting her with Earthquake thanks to Levitate. Fighting-types such as Hitmontop, Blaziken, and Scrafty also work wonders in this regard; with the exception of Scrafty they must watch out for Psychic-type Pokemon, which Cresselia cannot touch.</p> "
      },
      {
        "name": "Speed Control",
        "description": "<p>Useful at any stage in the game, this Cresselia set aims to gain control of the enemy's Speed as well as possibly bolster the power of your team's attacks. Icy Wind and Thunder Wave are the best choices for the primary move, and they both have their upsides and downsides. Icy Wind lowers the Speed of both enemies at once and deals decent damage to Pokemon weak to Ice-type attacks, but it also raises the Attack of Defiant Pokemon by two stages, does not work on Clear Body Pokemon, and is reset by the enemy switching out. Thunder Wave has a slightly greater effect and lasts for the duration of the match until healed, but it does not work on Ground-type Pokemon and can only affect one target at once. Psyshock is the main attacking move, and it's recommended due to targeting the opponent's Defense, a stat not as commonly boosted in Doubles as Special Defense. Helping Hand is the recommended option the third slot for boosting the power of Cresselia's partner. Finally, while Rest is used in the last slot to help Cresselia survive as long as possible, Protect can be used to avoid attacks such as Crunch and stall for time against field effects such as Trick Room and Tailwind.</p> <p>For items, if you are using Rest, use a Chesto Berry to instantly wake Cresselia up. Otherwise, use a Sitrus Berry so that she lives longer. The EVs are set up to 2HKO Hariyama, Virizion, and Hitmontop with Psyshock and avoid being OHKOed by Dark Gem Tyranitar's Crunch, with the rest of the EVs shoved into Special Defense and HP to maximize bulk.</p> <p>This Cresselia set works on pretty much any team in existence, but it is especially good as a partner for Pokemon such as Breloom and Kyurem-B who really appreciate being able to get the jump on their enemies. Heatran deserves a special mention, as not only does it threaten Bug-, Dark-, and Ghost-type Pokemon (such as Darkrai, Volcarona, and Bisharp) which give Cresselia a hard time, but it can also fully take advantage of Cresselia's speed control as well as Helping Hand.</p> "
      },
      {
        "name": "Trick Room",
        "description": "<p>Cresselia and Trick Room work extremely well together; Cresselia has the bulk to reliably set up Trick Room and the movepool to be useful for more then just this, and she really appreciates partners that can defeat her foes for her due to being incapable of utilizing Trick Room herself. Quite possibly the most useful and consistent Trick Room setter in existence, Cresselia should be considered for any Trick Room Team, as it is really hard to pass up her bulk and movepool.</p> <p>Trick Room is used because, well, obviously this is a Trick Room set--it would be quite difficult to set up Trick Room without having Trick Room. In the second slot Psyshock is recommended due to targeting the opponent's Defense, a stat not as commonly boosted in Doubles as Special Defense. In the third slot, Helping Hand is generally preferred to boost the power of Cresselia's partner. Finally, Protect is used in the last slot to help Cresselia survive for as long as possible to keep setting up Trick Room. Safeguard is also an option if you are concerned about burns and paralysis, two things that Trick Room teams loathe.</p> <p>Mental Herb is the item of choice if you wish for Cresselia to avoid Taunt once; otherwise, Sitrus Berry allows Cresselia to stay around for significantly longer. The EVs are set so Cresselia can avoid being 2HKOed by Tyranitar's Crunch and otherwise focus on increasing her bulk as much as possible. While a Sassy nature is recommended, it is viable to go with a Relaxed nature if your team requires more Defense.</p> <p>Ideal partners for this set, first and foremost, are Fake Out users, such as Hitmontop and Scrafty, and Rage Powder and Follow Me users such as Jirachi and Amoonguss, all of which greatly assist Cresselia in setting up Trick Room. Once Trick Room is up, slow, bulky, and powerful Pokemon such as Conkeldurr, Heatran, Tyranitar, Rypherior, and Escavalier all make for excellent partners, as they can fully take advantage of Trick Room.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "nyttyn", "user_id": 60743}], "teams": [{"name": "Quality checked by", "members": [{"username": "Level 51", "user_id": 118474}, {"username": "Nollan", "user_id": 161530}, {"username": "Audiosurfer", "user_id": 136301}, {"username": "Mizuhime", "user_id": 51961}, {"username": "Pocket", "user_id": 95}]}, {"name": "Grammar checked by", "members": [{"username": "melvni", "user_id": 64080}, {"username": "Governess", "user_id": 168470}]}]}
  },
  "Politoed": {
    "sets": [
      {
        "name": "Defensive Rain Setter",
        "description": "<ul> <li>As one of the few weather setters in the metagame, Politoed's usage is only for its ability to set rain with Drizzle. That said, Politoed isn't useless, in part due to a great defensive typing alongside a plethora of support moves. Scald is a reliable STAB attack, benefiting from Politoed's ability. Toxic is great to hinder Jellicent and Gastrodon, allowing Politoed to passively cripple two of Kingdra's most viable checks. Helping Hand helps mitigate Politoed's lack of offensive presence and is especially devastating alongside Kingdra's Muddy Water. Encore disrupts or punishes foes that try to take advantage of Politoed's passiveness by setting up a Substitute, or it can lock them into an undesirable move such as Protect. Alternatively, Hydro Pump can be used as a stronger STAB attack.</li> <li>Eject Button is the item of choice, because it allows Politoed to immediately bring in a more offensive partner after setting rain. Eject Button also allows Politoed to be safely preserved in case it needs to set rain again. Sitrus Berry can be used instead to increase its longevity.</li> <li>The offensive EV investment allows Politoed to OHKO 4 HP Choice Scarf Landorus-T. The Special Defense investment lives a Dragon Gem-boosted Draco Meteor from Latios with the remaining EVs dumped into Defense.</li> <li>Politoed's one job is to set rain. If there is an opposing weather setter, such as Tyranitar, it is best to preserve Politoed as much as possible so that it can win the weather war.</li> <li>Naturally, Kingdra is a mandatory teammate for Politoed to take advantage of rain. Like Kingdra, Politoed also benefits from teammates that can remove common threats to rain abusers such as Jellicent, Thundurus, Grass-types, and Dragon-types. Thundurus-T can threaten Jellicent, Thundurus, and Grass-types. Genesect and Metagross both appreciate Politoed's ability to threaten Fire-types, while they can threaten Kyurem-B and Latios, two of the most common Dragon-types in the metagame.</li> </ul> "
      },
      {
        "name": "Offensive Rain Setter",
        "description": "<ul> <li>Unlike defensive Politoed this set aims to maximize an offensive presence, pressuring the opposing team with its strong rain-boosted STAB attacks. Politoed's role, however, is still to set rain with Drizzle, so the choice between the defensive and offensive sets oftentimes comes down to personal preference.</li> <li>Hydro Pump is the strongest Water-type attack Politoed has access to and can do massive damage under rain. Scald is a reliable Water-type attack for when accuracy is preferred. Ice Beam can hit Water resistances, such as Latios and Amoonguss, super effectively. Toxic can be used to punish common bulky switch-ins such as Jellicent and Kyurem-B. Hidden Power Grass is a more offensive option to punish common Water-type switch-ins such as Jellicent and Gastrodon. Protect should only be used in combination with Water Gem.</li> <li>Choice Specs further boosts Politoed's power, while Water Gem trades the consistent power boost for the flexibility of switching moves. Both items, however, are equally valuable and the choice oftentimes comes down to player preference.</li> <li>This spread aims to maximize Politoed's damage output. Alternatively, a spread of 248 HP / 204 SpA / 56 SpD can be used to survive Dragon Gem-boosted Draco Meteor from Latios at the cost of slightly decreased power.</li> <li>Although Politoed's main job is still to set rain, it still has enough offensive presence to allow it to stay on the field, since it is not as big of a momentum sap as defensive Politoed. Due to the lack of defensive investment, if the opponent has another weather setter, it is best to play safely and preserve Politoed in order to win the weather war.</li> <li>Kingdra is a mandatory teammate to take advantage of rain. Pokemon that threaten or answer common rain checks, such as Jellicent, Thundurus, Amoonguss, and Dragon-types, are excellent teammates. Thundurus-T can threaten Jellicent, Amoonguss, and Thundurus. Steel-types, such as Metagross and Genesect, can threaten Kyurem-B and Latios while also benefitting from Politoed's ability to threaten Heatran. Finally, Thundurus can threaten Jellicent and Amoonguss while also offering speed control with its Prankster Thunder Wave to mitigate Politoed's low Speed.</li> </ul> "
      }
    ],
    "credits": {"writtenBy": [{"username": "DaAwesomeDude1", "user_id": 228280}], "teams": [{"name": "Quality checked by", "members": [{"username": "Yoda2798", "user_id": 243662}, {"username": "zee", "user_id": 501951}]}, {"name": "Grammar checked by", "members": [{"username": "ken", "user_id": 594478}]}]}
  },
  "Scizor": {
    "sets": [
      {
        "name": "Swords Dance",
        "description": "<ul> <li>One of the only setup attackers in the metagame, Scizor's great defensive typing and priority Technician-boosted STAB attack in Bullet Punch make it a dangerous force if boosted. That said, Scizor relies heavily on Swords Dance to be threatening and can be slowed down by Intimidate. Additionally, it struggles heavily to beat some of the metagame's most common Pokemon, such as Jellicent and Thundurus, and is hard-countered by Heatran.</li> <li>Bug Bite is a solid second Technician-boosted STAB attack that is stronger than Bullet Punch and can steal berries from common Pokemon such as Cresselia and Amoonguss.</li> <li>Steel Gem is the preferred item, because it powers up Bullet Punch, Scizor's most commonly used attack, notably allowing it to OHKO Latios after a Swords Dance boost. Steel Gem can also allow Scizor to do respectable damage even without a Swords Dance boost.</li> <li>Scizor's main goal is to set up Swords Dance as safely as possible to clean the opposing team with its priority Bullet Punch. Focus on removing Steel-type resistances and Pokemon that threaten Scizor so that it can properly sweep uninhibited.</li> <li>Politoed and Kingdra are great teammates due to their ability to remove Heatran and Landorus-T, while they benefit from Scizor's ability to threaten Tyranitar, Kyurem-B, and Latios. Tyranitar can threaten Jellicent, Thundurus, and Heatran, opening the door for Scizor to set up. Additionally, the residual damage from sand can put Pokemon in range of being KOed by Scizor's attacks. Finally, Thundurus can threaten Jellicent while being able to prevent Will-O-Wisp or Spore with Taunt.</li> </ul> "
      }
    ],
    "credits": {"writtenBy": [{"username": "DaAwesomeDude1", "user_id": 228280}], "teams": [{"name": "Quality checked by", "members": [{"username": "Yoda2798", "user_id": 243662}, {"username": "zee", "user_id": 501951}]}, {"name": "Grammar checked by", "members": [{"username": "ken", "user_id": 594478}]}]}
  },
  "Kingdra": {
    "sets": [
      {
        "name": "Weather Attacker",
        "description": "<ul> <li>Under rain, Kingdra is an offensive juggernaut, outrunning the entire metagame and inflicting massive damage on non-resistant targets with its boosted Water-type attacks. If that isn't enough, a strong spread Water-type attack in Muddy Water makes Kingdra difficult to switch into, thus solidifying it as one of the most fearsome threats in the metagame.</li> <li>Muddy Water is a strong spread STAB attack with increased damage in rain. Draco Meteor is another STAB attack that can hit Dragon-types that resist Water super effectively, such as Latios and Kyurem-B. It's also a strong attack for Pokemon immune to Water, such as Gastrodon and Jellicent. Substitute most importantly blocks debilitating statuses, such as Thunder Wave paralysis, and it allows Kingdra to tank a hit with minimal damage. Hydro Pump can be used over Substitute if the damage is preferred, but this will greatly hinder the Thundurus and Amoonguss matchups.</li> <li>Water Gem is an option if using Hydro Pump to give Kingdra a nuke that is capable of OHKOing Thundurus. This, however, is fairly situational and weakens Kingdra's overall damage output, so Life Orb is the better option in most cases.</li> <li>A Timid nature is an option to outspeed or Speed tie opposing Kingdra, although it lowers Kingdra's damage output.</li> <li>Kingdra's combination of Speed and power can allow it to function both as a wallbreaker or a cleaner. Most of the time, Kingdra will be using Muddy Water and only uses Draco Meteor on threats that it can KO, such as Dragon-types or a weakened Amoonguss, since Kingdra will likely have to switch out afterwards.</li> <li>With how powerful Kingdra can be, teams with Kingdra are oftentimes built solely around supporting it. Politoed is a mandatory to set rain. Teammates that can threaten Thundurus, such as Thundurus-T or Kyurem-B, or redirect Thunder Wave, such as Amoonguss, are important to prevent Kingdra from being paralyzed. Thundurus-T and Kyurem-B both also threaten Amoonguss and Jellicent, which are two of the most common answers for Kingdra. Pokemon that can threaten Tyranitar, such as Genesect, Scizor, and Landorus-T, are important to ensure that rain stays on the field. Landorus-T also threatens Thundurus and can also pivot with U-turn, allowing one to switch Kingdra in safely. Finally, Grass-types, such as Breloom, Ferrothorn, and Shaymin-S, are common partners to threaten Water-types that resist Muddy Water, with Ferrothorn aiding with rain teams' often poor Trick Room matchups.</li> </ul> "
      }
    ],
    "credits": {"writtenBy": [{"username": "DaAwesomeDude1", "user_id": 228280}], "teams": [{"name": "Quality checked by", "members": [{"username": "zee", "user_id": 501951}, {"username": "Smudge", "user_id": 550367}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Tyranitar": {
    "overview": "<p>Tyranitar is possibly the best weather summoner in Doubles due not only to its ability to check some of the best Pokemon the metagame has to offer, such as Cresselia and Thundurus, but also because of its amazing movepool. Tyranitar has many powerful attacks such as Crunch, Rock Slide, and Fire Blast. The main problem that Tyranitar faces is its less-than-stellar defensive typing, as being 4x weak to Fighting-type moves in Doubles is a very bad thing with threats such as Hitmontop being prominent. Despite its glaring weakness to Fighting-types, Tyranitar's phenomenal special bulk complemented with its high offensive stats makes it a versatile special tank in Doubles.</p> ",
    "comments": "<h1>Other Options</h1> <p>Tyranitar doesn't only bring sand to the battlefield; it can also support its teammates in other ways. Tyranitar gets some very appealing support moves that don't see much use. Thunder Wave can help with speed control, something every team benefits from. Roar and Dragon Tail both have higher priorities than Trick Room, and could be used as a way to stop the opposition from getting it up. Stone Edge could be used in conjunction with Rock Slide to give Tyranitar the ability to hit for spread damage and also avoid Wide Guard problems at the expense of some coverage. Finally, Tyranitar gets access to Taunt, a move that can be used to shut down Pokemon such Togekiss and Cresselia and stop them from supporting their teammates. A Dark or Rock Gem could be used over Focus Sash to pick up OHKOs Tyranitar normally wouldn't be able to achieve. Unnerve Tyranitar can stop Pokemon from eating resistance Berries, ensuring that it and its teammates can get KOs on Pokemon that would otherwise survive thanks to their Berries.</p> <h1>Checks and Counters</h1> <p>Tyranitar has a few major counters that it has problems dealing with. Firstly, Fighting-type Pokemon such as Terrakion, Breloom, and Conkeldurr are a major issue. They all have the ability to hit Tyranitar for 4x damage, which isn't good. Intimidate users are another large problem for it. Pokemon such Hitmontop, Landorus-T, and Scrafty can all lower Tyranitar's Attack, forcing it to rely on special attacks to deal damage. Hitmontop also gets Wide Guard, which stops Rock Slide cold. The final major problem Tyranitar faces is Ground-types, such as Garchomp. Opposing sand sweepers with Sand Force, such as Excadrill and Landorus, are especially threatening due to their boosted Earthquakes.</p> <p>One of the problems Tyranitar faces that isn't as fatal as the above is rain. Tyranitar can keep weather on its side in some cases, but in others rain can be up and be very problematic. Pokemon such as Politoed, Kingdra, and Ludicolo will all have boosted STABs thanks to the rain they often bring with them. Toxicroak is also a common Pokemon on rain teams that can switch in on Tyranitar with impunity. Rotom-W is another Water-type bulky enough to switch in and threaten Tyranitar out.</p> <p>Finally, Pokemon with powerful STABs, such as Jirachi, Scizor, Bisharp, Metagross, Escavalier, and Genesect, can all hit Tyranitar for heavy damage depending on its set. However, if Tyranitar is carrying Fire Blast, it can handle these Pokemon fairly easily, but they should be accounted for by teammates anyway.</p> ",
    "sets": [
      {
        "name": "Standard",
        "description": "<p>Rock Slide is standard on any set Tyranitar will run; as a powerful spread move with STAB, it lets Tyranitar deal with many common Pokemon in the Doubles metagame. Crunch is used as a single target move that hits foes extremely hard; however, Fire Blast is also a viable, as Tyranitar will have trouble hurting Pokemon such as Ferrothorn and Scizor without it. Low Kick is used to OHKO Pokemon such as Bisharp and other Tyranitar, and also 2HKO very prominent threats such as Hydreigon.</p> <p>Winning the weather war is just as, if not more, important in Doubles than it is in Singles. As Tyranitar is going to be slower than most Pokemon, you might as well take advantage of its less-than-stellar Speed stat. By using a Brave nature with 0 IVs in Speed, Tyranitar will win the weather war 100% of the time (at least initially). As for the EV spread, 36 EVs are used in Defense so that Tyranitar can survive an unboosted Meteor Mash from Metagross.</p> <p>Chople Berry is the best choice of item for this set, as Tyranitar has a very exploitable weakness to Fighting-type attacks that Pokemon such as Breloom and Hitmontop can easily take advantage of otherwise. Tyranitar is excellent at supporting its teammates thanks to its amazing ability Sand Stream. Sandstorm alone provides great support for Pokemon such as Excadrill and Landorus, making them feared sweepers, but it also gives Rock-type Pokemon a 50% boost to their Special Defense stat, meaning that Pokemon such as Terrakion will be able to live a super effective Psychic-type attack from Cresselia or Latios. As good a teammate as Tyranitar can be, it needs help as well. Due to its 4x weakness to Fighting-type attacks, fast Psychic-types such Latios and Latias make good teammates. Rain is also a very large problem that Tyranitar cannot deal with alone. Pokemon such as Rotom-W, Thundurus, Breloom, and Gastrodon all help with the removal of common rain sweepers.</p> <p>There are a few other moves that Tyranitar could run besides the ones listed. For example, Stone Edge, a single-target attack, is far more powerful than Rock Slide and isn't stopped by Wide Guard. If the accuracy of Fire Blast is something that causes you to shy away from using it, Flamethrower can be used in its place. Though not as strong, it won't miss at a crucial moment in the match. Finally, Substitute can be used to shield Tyranitar from Fighting-type attacks. Because it is so slow, Tyranitar will need a free turn to set one up, so Fake Out users such as Hitmontop and Scrafty are good partners. It's also recommended to use Leftovers on Tyranitar when using Substitute, as Chople Berry would then be a waste of Tyranitar's item slot.</p> "
      },
      {
        "name": "Choice Scarf",
        "description": "<p>Choice Scarf Tyranitar is one of the biggest threats in Doubles. Not only does it support its team with sand, but it's also fast enough to damage opponents before getting damaged itself. Rock Slide is the main move on the set, allowing Tyranitar to hit both opponents and also giving it an opportunity to flinch them. Crunch is the secondary STAB move, offering a way to hit Cresselia, Latios, and Latias hard. The Superpower vs Low Kick decision is up to you. Superpower hits Pokemon such as Hydreigon for an OHKO while Low Kick is a 2HKO, but Superpower also lowers Tyranitar's Attack and Defense stats every time it's used. Low Kick is a safer option, and despite being weaker, it has an advantage in stopping you from worrying about Tyranitar's stats being lowered. Fire Blast allows Tyranitar to hit Steel-type Pokemon such as Ferrothorn and Scizor for super effective damage, while Ice Beam hits a few Pokemon harder than Rock Slide would. Factoring in Intimidate, Ice Beam covers Tyranitar's weakness to Salamence and Landorus-T.</p> <p>76 EVs in HP let Tyranitar live a +1 Bullet Punch from Scizor 100% of the time, and max Speed allows it to outspeed base 111s, most notably Thundurus. The remaining EVs are put into Attack to let Tyranitar do as much damage as possible.</p> <p>Tyranitar can use Earthquake on this set as well; it's an alternate spread move, though it's not as strong as Tyranitar would like it to be and it also comes with the drawback of hitting Tyranitar's grounded teammates. Stone Edge is stronger than Rock Slide and is a single-target move, though it has worse accuracy. The main benefit that Stone Edge brings is the ability to still hit Pokemon when an opponent uses Wide Guard. Fire Punch shouldn't be used because Fire Blast from an uninvested Special Attack still does more damage with this spread and, with Intimidate being such a commonly used ability, it's likely that Tyranitar's Attack will be lowered.</p> <p>Tyranitar's main goal with this set is to be faster than its opponents; the only problem with that is that it means Tyranitar's going to lose the initial weather war. This means that teammates that help deal with opposing weather are crucial to ensure victory. Because rain is going to be a large problem, Pokemon such a Thundurus and Rotom-W can paralyze and take little damage from most Pokemon commonly used in rain are very useful. Gastrodon can't be touched by any Water-type attack, making it a good choice. Defiant Tornadus deserves a special mention as it directly counters all Intimidate users and Fighting-type Pokemon at the same time. Landorus, Hitmontop, Scrafty, Gyarados, and Salamence cannot switch in freely like they otherwise would be able to with it on the field.</p> "
      },
      {
        "name": "Focus Sash",
        "description": "<p>Focus Sash Tyranitar is used to beat some of Tyranitar's usual counters. Being able to live any immediate hit, it can strike back with something just as powerful. Rock Slide is the main STAB move on this set because it allows Tyranitar to hit the opposition hard. Crunch is used to hit Psychic-types, such as Cresselia, Latias, and Latios, and Ghost-types, such as Jellicent and Chandelure, for super effective damage. Low Kick allows Tyranitar to beat opposing Tyranitar and a Pokemon it would normally lose to: Terrakion. Superpower can also be used to hit some Pokemon harder but at the cost of lowering Tyranitar's Attack and Defense every time it's used.</p> <p>Tyranitar is a creature of the sand and it's not a fan of being in anything else. Rain teams are always a problem for faster variants of Tyranitar, so you need to build your team accordingly. Pokemon that are hard counters to rain are very good partners for a faster Tyranitar; Pokemon such as Thundurus, Rotom-W, Gastrodon, and Breloom are all excellent choices and stop rain in multiple ways. Tyranitar also brings a weather of its own to the field, so we cannot forget about Pokemon such Excadrill and Landorus, who both benefit greatly from sandstorm support.</p> <p>Focus Sash opens up many different possibilities for Tyranitar, the first of which is Dragon Dance. Dragon Dance boosts Tyranitar's Attack and Speed at the same time, making it as fast as the Choice Scarf set but with the ability to switch moves and deal serious damage. Counter can be used on this set as well, letting Tyranitar deal serious damage if a predicted physical hit comes its way. Stone Edge can be used in place of Rock Slide as a more powerful, single-target attack.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Mizuhime", "user_id": 51961}], "teams": [{"name": "Quality checked by", "members": [{"username": "Joim", "user_id": 161822}, {"username": "Laga", "user_id": 176920}, {"username": "Pocket", "user_id": 95}]}, {"name": "Grammar checked by", "members": [{"username": "melvni", "user_id": 64080}, {"username": "-Tsunami-", "user_id": 30130}]}]}
  },
  "Breloom": {
    "overview": "<p>Do not let Breloom's harmless appearance fool you: it is a very threatening Pokemon. Spore is a deadly move, and Breloom is one of the best users of it. If that wasn't enough, access to Technician-boosted STAB moves in Bullet Seed and Mach Punch make it a very potent physical threat. Its typing allows it to be a solid offensive check to sand and rain teams and also lets it defeat Rotom-W and Gastrodon. However, not all is well for Breloom, whose frailty and middling Speed stat leave much to be desired. Despite its flaws, however, Breloom can be a very annoying Pokemon to deal with in Doubles.</p> ",
    "comments": "<h1>Other Options</h1> <p>Breloom's shallow movepool means that it lacks many other options. Helping Hand can be useful for helping Breloom's partner, and Substitute can take advantage of Breloom's ability to force switches. Breloom also has access to Swords Dance, but it is not bulky enough to use this move effectively in Doubles; the same can be said for Stun Spore. However, a bulky Poison Heal variant of Breloom can be used, as it allows Breloom to have greater longevity and a status immunity.</p> <h1>Checks and Counters</h1> <p>Pokemon that resist Breloom's STAB moves give it a lot of problems. Chandelure can tank any move outside of Stone Edge (and Spore) and sauté the beloved mushroom. Thundurus and Tornadus can do the same with Hidden Power Flying and Acrobatics, respectively. Dragonite can tank any hit if Multiscale is intact and KO Breloom with a variety of moves. Latios and Latias can wall Breloom completely (outside of Spore) and can KO it with relative ease; Heracross can do the same. Lum Berry Pokemon also cause Breloom massive problems, as they can KO it after brushing off Spore. Amoonguss and Volcarona are especially troublesome, as they can use Rage Powder to redirect Breloom's attacks. Other priority users, such as Weavile, Scizor, and Mamoswine, can also KO Breloom rather easily. Pokemon with Intimidate, such as Landorus-T and Salamence, can weaken Breloom and then KO it. Bulky Pokemon such as Cresselia and Dusclops can also sponge any hit Breloom can dish out. Due to Breloom's middling Speed stat, many Pokemon in the metagame are faster than it, meaning they can easily KO it so long as they are able to tank a Mach Punch; Jirachi and Garchomp are examples of Pokemon that can do this. Sableye can Taunt Breloom to stop Spore and then Will-O-Wisp it to incapacitate it. Cloyster can OHKO Breloom with Icicle Spear, which also conveniently bypasses Focus Sash. Finally, having sandstorm or hail can nullify Breloom's Focus Sash, allowing it to be KOed more easily.</p> ",
    "sets": [
      {
        "name": "Physical Attacker",
        "description": "<p>Spore is what makes Breloom a truly threatening Pokemon in the metagame. Putting an opposing Pokemon to sleep usually renders it useless for the remainder of the game, crippling the opposition. Mach Punch is a great tool in Breloom's arsenal as well, allowing it to have a way to get around its average Speed stat; Technician-boosted Mach Punch is great for finishing off weakened foes. Bullet Seed is Breloom's other STAB move, and it hits extremely hard. Being a multi-hit move makes it especially useful, as it can bypass the opposition's Substitutes. Bullet Seed also gets around any pesky Rindo Berries the enemy might have up their sleeve. Protect is a staple on most of the Pokemon in Doubles, and Breloom is no exception, but it is especially helpful on Breloom due to its frailty.</p> <p>Low Sweep is an alternative over Protect, as it allows Breloom to KO Pokemon such as Heatran that Mach Punch would fail to knock out. Stone Edge is another possible move in this slot and is especially useful if Breloom is holding a Focus Sash, as it lets the mushroom warrior defeat otherwise major threats such as Thundurus and Chandelure. However, Life Orb is the preferred option over Focus Sash, as it gives Breloom a power boost it greatly appreciates. Focus Sash can also be broken by sandstorm, making it less reliable; however, it does often allow for a guaranteed Spore, making it very useful at times. A Fighting Gem could also be used, allowing the Breloom user to possibly get a key KO with Mach Punch or Low Sweep that would otherwise not have been possible. Max Attack is used to give Breloom as much power as possible, while a Jolly nature with 252 Speed EVs guarantees that Breloom outruns threats such as Heatran.</p> <p>Heatran can be a good partner for Breloom, as it can make Pokemon such as Chandelure think twice about using Heat Wave, giving Breloom more leeway to work its magic. Choice Scarf Tyranitar is also a good partner, as it can eliminate threats to Breloom such as Latios and Tornadus; Breloom also defeats the bulky Water-types that give Tyranitar trouble. Breloom fits well on rain teams, as it can defeat Pokemon such as Gastrodon and Rotom-W that would otherwise cause problems; Breloom also defeats Abomasnow and Tyranitar, allowing the rain to stay on the field. Other good partners for Breloom include Pokemon who have access to moves such as Tailwind and Icy Wind, as these moves can help make up for Breloom's poor Speed stat; Suicune is a great example of a Pokemon that can fill this role.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "-Tsunami-", "user_id": 30130}], "teams": [{"name": "Quality checked by", "members": [{"username": "Pocket", "user_id": 95}, {"username": "Nollan", "user_id": 161530}, {"username": "Mizuhime", "user_id": 51961}]}, {"name": "Grammar checked by", "members": [{"username": "Ender", "user_id": 192999}, {"username": "Oglemi", "user_id": 40358}]}]}
  },
  "Salamence": {
    "overview": "<p>With a fantastic ability in Intimidate, a wide attacking movepool, and high attacking stats, Salamence is a fearsome beast seemingly made for Doubles. It also has access to Tailwind, making it a unique support Pokemon combined with Intimidate. Thanks to its huge offensive stats, it has no problem going dedicated special or mixed and still wreaking havoc. Be sure not to use Salamence as an inferior Garchomp or Kyurem-B, which have a wider physical movepool and higher offensive stats are higher, respectively. Salamence is faster than Kyurem-B and has a much higher Special Attack than Garchomp, so cater to these characteristics.</p> ",
    "comments": "<h1>Other Options</h1> <p>Salamence has an enormous movepool for an offensive Pokemon. Aqua Tail is an option for mixed Salamence, especially if used in the rain. A pure physical set with Dragon Claw, Crunch, Stone Edge, and Earthquake may work. Dragon Dance is an option, especially with Moxie, but Salamence does not want to give its opponents any free turns and Intimidate is a much more consistent an supportive ability in doubles. Don't even think about using Outrage, as its lack of targeting and the need for Salamence to be locked in for 2 or 3 turns does not make up for its power; Kyurem-B does this much better anyway. Focus Sash gives Salamence a guaranteed attack outside of getting slapped by Fake Out, but the lack of power is disappointing. Haban Berry can be used to let Salamence survive a hit from Kingdra's Dragon Pulse and OHKO back with Draco Meteor, but Kingdra's Draco Meteor will still OHKO Salamence. Flying Gem powers up Hidden Power Flying, but leaves Salamence's other attacks underpowered. Finally, a bulky Dragon Tail set can be used, allowing Salamence to stop Trick Room users before they even have a chance to set up, coupled with Roost for immediate recovery. However, Dragon Tail's -3 priority leaves it open to your opponent's partner to attack it.</p> <h1>Checks and Counters</h1> <p>Mamoswine is the probably the best check to Salamence, OHKOing any variant lacking a Yache Berry. It is severely weakened by Draco Meteor or Hydro Pump, however. Ferrothorn laughs at Salamence's Dragon-type moves, but Fire Blast or Heat Wave will OHKO it outside of rain. Cresselia can survive hits from all but the Choice Specs set and can use Icy Wind for Speed control, hitting Salamence very hard and crippling it. Dusclops with even minimal Special Defense investment can take two Draco Meteors outside of Modest variants with Dragon Gem or Choice Specs and drain its PP quickly with Pressure, set up Trick Room, burn it with Will-O-Wisp, or recover off the damage with Pain Split. Genesect with a Choice Scarf can take care of Salamence with Ice Beam, but it must watch out for Choice Scarf Salamence, which can OHKO it with a Fire-type move. Latios is faster and can rip Salamence to shreds with its own Dragon-type attacks. Tyranitar takes a pittance from any of Salamence's attacks outside of Earthquake and can hit it back hard with Rock Slide. Terrakion can do similarly, but it must have sand support to take Salamence's special attacks with as much ease as Tyranitar. Ice-type attacks in general, even Hidden Power Ice from threats like offensive Thundurus, will make short work of any Salamence not running Yache Berry. Choice Scarf Abomasnow can outspeed it destroy it with its powerful STAB Blizzard. Rain sweepers such as Kingdra, Ludicolo, and Kabutops can all outspeed Salamence and OHKO with their super effective attacks.</p> ",
    "sets": [
      {
        "name": "Special Attacker",
        "description": "<p>Salamence's base 110 Special Attack works wonders with Salamence's wide special movepool, allowing it to fire off devastating Draco Meteors at will, as well as provide your team a nice spread move in Heat Wave. Fire Blast can be used over Heat Wave, however, to nail Occa Berry Scizor and Metagross, OHKOing the former and 2HKOing the latter. The extra power is especially appreciated if Salamence is running a Timid nature. Hidden Power Flying is a reliable STAB, picking off Pokemon weak to it, such as Breloom and Hitmontop, without having to suffer from a Special Attack drop from Draco Meteor or rely on an inaccurate Fire-type attack. However, Tailwind provides vital team support and is especially useful if Salamence is using a Modest nature. Protect is as useful as ever in doubles for avoiding an attack whenever necessary, but make sure not to overuse it when Tailwind is up, or you risk stalling out your Tailwind turns.</p> <p>Dragon Gem is the primary item, maximizing Draco Meteor's power, but Yache Berry lets Salamence take Mamoswine's Ice-type attacks more easily, most importantly Ice Shard. Follow Me Jirachi makes for an excellent partner, resisting both Ice- and Dragon-type attacks that threaten Salamence's life while giving Salamence a free shot at Kingdra if it's raining. Volcarona makes for a great partner as well, with Rage Powder redirecting resisted Ice-type attacks, and potentially burning physical contact attacks such as Scizor's Bullet Punch and Mamoswine's Ice Shard.</p> <p>There are a few additional options that Salamence can use on this set. Life Orb boosts Salamence's other attacks, but the recoil damage combined with hail or sand really shortens Salamence's lifespan. Flamethrower is a more accurate Fire-type attack, but lacks the spread capabilities of Heat Wave and the raw destructive power of Fire Blast.</p> "
      },
      {
        "name": "Mixed Attacker",
        "description": "<p>Salamence's huge base 135 Attack backed by its solid physical and special movepools allow it to run an effective mixed attacking set. Draco Meteor is an extremely powerful STAB move, and the Special Attack drop is not as devastating since Salamence can rely on its physical attacks after the drop. Earthquake is a straightforward spread move, providing excellent all-around coverage, as well as nailing Heatran and hitting Tyranitar for decent damage. Dragon Claw is a powerful STAB move and provides great coverage alongside Earthquake. Tailwind is great to boost both Salamence and your team's Speed for a short while, whereas Protect is used for general prediction.</p> <p>Naive is the preferred nature, as it allows Salamence to survive Mamoswine's Ice Shard after the Attack drop from Intimidate. The given Special Attack EVs guarantee that Draco Meteor will OHKO offensive Thundurus, while still maximizing Salamence's Speed. The rest are dumped into Attack to give Dragon Claw and Earthquake as much power as possible. The item choice is pretty straightforward. Life Orb boosts Salamence's offenses even further, while Yache Berry allows it to stick around and take more Ice-type attacks if necessary.</p> "
      },
      {
        "name": "Choice",
        "description": "<p>Salamence is a natural candidate for a Choice set, with massive attacking stats, great Speed, and an array of high-powered attacks, all with excellent coverage. With Choice Scarf, Salamence turns into a great revenge killer and potential late-game cleaner. A Modest nature gives Salamence maximum power while letting it outspeed 76 Speed Ludicolo in the rain and is almost guaranteed to land an OHKO with a Helping Hand-boosted Hidden Power Flying, which hits just as hard as Draco Meteor because it is super effective, but without the Special Attack drop. Salamence also outspeeds other common Choice Scarf users, with a 56% chance to OHKO 224 HP Mamoswine with Hydro Pump and a guaranteed OHKO on Abomasnow and neutral-natured Genesect with its Fire-type move of choice.</p> <p>Choice Specs, on the other hand, makes Salamence an absolute nuke. Unlike Dragon Gem, Salamence can launch multiple Draco Meteors, switching out and coming back in when its Special Attack has dropped too far. Every shaky OHKO and nearly all 2HKOs from previously unboosted attacks are now guaranteed with the Choice Specs boost. Choice Specs Salamence, like most Choice Specs users, is best played as a hole puncher: choose whichever move hits your opponent, or a predicted switch-in, for the most damage. After a Special Attack drop or two, or if locked into an unfavorable attack, switch out Salamence and bring it in later for further firepower and Intimidate support.</p> <p>Timid may be used for the Choice Scarf set, allowing Salamence to outspeed Jolly Choice Scarf Landorus-T, but can only OHKO it with Hydro Pump, and it misses out on a lot of the OHKOs that Modest brings. Helping Hand support makes up for the lack of power boost with Scarf, and makes Choice Specs Draco Meteor that much scarier, 2HKOing 252 / 192+ Cresselia even with a Timid nature. Modest can be used with Choice Specs to do as much damage as possible, but Timid is preferred to outspeed anything below base 100 Speed. Dragon Pulse is a nice option for late-game sweeping, still offering solid power without suffering the Special Attack drops from Draco Meteor. As usual, you should provide Salamence with anything that can stomach Ice- or Dragon-type attacks; Follow Me Jirachi is as good as ever and can even offer Thunder Wave support to slow down Kingdra or other Choice Scarf users.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Level 51", "user_id": 118474}, {"username": "Nix_Hex", "user_id": 40064}], "teams": [{"name": "Quality checked by", "members": [{"username": "Laga", "user_id": 176920}, {"username": "tofucocoa", "user_id": 34584}, {"username": "Mizuhime", "user_id": 51961}]}, {"name": "Grammar checked by", "members": [{"username": "piikachuu", "user_id": 190864}, {"username": "GatoDelFuego", "user_id": 91628}]}]}
  },
  "Metagross": {
    "overview": "<p>Metagross is an excellent Pokemon and is one of the best physical attackers in Doubles. Thanks to its high Attack stat, it has no problem hitting most of the tier for great damage. If that isn't enough to entice you, Clear Body allows Metagross to avoid stat drops from common things such as Icy Wind and Intimidate, allowing it to distinguish itself from other physical attackers such as Scizor. Metagross's typing also grants it many useful resistances against moves such as Latios's Draco Meteor and Abomasnow's Blizzard, and this combined with its good bulk means that it has no trouble switching in and sponging hits. Unfortunately for Metagross, its middling Speed leaves it outsped by many common Pokemon threats such as Heatran and Rotom-W. In addition, it has difficulty handling common bulky Water-types such as Jellicent, Rotom-W and Gastrodon, all of whom resist its Steel-type STAB and can cripple Metagross with Will-O-Wisps or Scalds. When compared though, Metagross's positives far outweigh its negatives, and it should always be considered for a teamslot.</p> ",
    "comments": "<h1>Other Options</h1> <p>Choice Band can be used, but being locked into moves with Metagross's low Speed can be undesirable. An Explosion set with Normal Gem is an interesting option to surprise an opponent with a huge amount of damage, but it forces you to Protect or run a Ghost-type in order to avoid dealing huge chunks of damage to your own Pokemon. Gravity can be nice to support the team and grant Metagross's STAB attacks perfect accuracy, but it loses access to an additional attacking move, and it makes the rest of the team weaker to Earthquake users such as Excadrill. Bulldoze can be a decent option to grant Speed control, but it hits your partner and is very weak. Magnet Rise can be useful to grant Metagross a Ground-type immunity, giving it nothing to fear from Pokemon such as Excadrill and Landorus. However, Magnet Rise isn't too useful otherwise, as it can be difficult to set up due to Metagross's low Speed, and comes at the cost of one of its attacking options.</p> <p>Light Screen can be a cool option to allow Metagross and its teammates to better handle special attacks. Metagross can make a good supporter of Rain teams with Rain Dance, as it can take on Tyranitar and Abomasnow and change weather. A set with Agility or Rock Polish can make Metagross function as a sweeper, but it can be hard to set up, and due to Metagross's weak offensive coverage it will have a difficult time sweeping even after nabbing a boost. A set with Gyro Ball, Trick, and Iron Ball can be an option with Trick Room support to give Metagross a high-powered STAB attack while crippling an opposing Pokemon at the same time by Tricking them an Iron Ball. ThunderPunch gives Metagross an option to hit bulky Water-types such as Jellicent and Gyarados, but its other moves tend to have more utility. Psych Up can be cool to copy stat boosts from Pokemon such as Dragon Dance Gyarados, but it is very situational. Substitute can be nice to protect Metagross from powerful attacks and status moves that can cripple it, but it's generally too slow to make use of it effectively. Rock Slide is a nice option to hit Flying-types and Volcarona as well as granting Metagross a spread move, but it's not very strong due to the lack of a STAB boost and the spread damage reduction. Icy Wind can be used to grant Speed control for the rest of your team, but it is generally better left to Pokemon such as Cresselia and Jirachi. Swagger can also be used to pose a nuisance to special attackers as well as grant boosts to physical attackers with Lum Berry, but it is not very reliable.</p> <h1>Checks and Counters</h1> <p>Bulky Water-types such as Rotom-W, Jellicent, Politoed, Suicune, and Gastrodon make for good counters to Metagross as they resist its main STAB attack and can heal off the damage, while hitting back hard with their own attacks, and cripple Metagross with burns from Will-O-Wisp and Scald. Fire-types such as Ninetales, Volcarona, Heatran, Chadelure, and Victini also make for great checks since they resist Metagross's Steel-type STAB and can melt it with powerful, super effective attacks. Victini, Volcarona, and Heatran get special mentions; Victini can resist both of Metagross's STABs, while Volcarona and Heatran are able to set up on Metagross with Quiver Dance and Substitute, respectively. However, all must be wary of Metagross with Earthquake. Ground-types such as Garchomp, Landorus, and Excadrill can outspeed Metagross and deal large chunks of damage with their STAB Earthquakes. However, Garchomp and Landorus must watch out for Choice Scarf sets that can outspeed and OHKO them. Opposing Steel-types such as Scizor, Bisharp, and Heatran have little issue with Metagross sets that lack Earthquake and Hammer Arm, as they resist all of its other commonly carried moves and can hit back hard. Zapdos and Thundurus resist Metagross's Steel-type attacks and can also hit back hard with Thunderbolt. In addition, Zapdos has Heat Wave to hit Metagross super effectively.</p> ",
    "sets": [
      {
        "name": "Tank",
        "description": "<p>With this set, Metagross is able to both hit hard and capitalize on its good bulk and typing to become an effective tank in the Doubles metagame. Meteor Mash is Metagross's main STAB attack and is capable of dealing a lot of damage due to its high Base Power. In addition, its chance of granting an Attack boost can be useful to give it even more of an offensive punch. Bullet Punch is the other STAB attack, and it serves to circumvent Metagross's lackluster Speed as well as pick off weakened Pokemon. Zen Headbutt is a great option in the third slot, as it provides a nice secondary STAB option, is able to maul common Fighting-types such as Hitmontop, and gives Metagross a way to hit bulky Water-types such as Gastrodon and Rotom-W who otherwise have little to fear from Metagross. In addition, its chance to flinch can also be very useful in a pinch. Ice Punch is another option and is useful for swiftly eliminating Flying- and Dragon-types with a super effective coverage move. Clear Body makes these options even better because it can strike Landorus-T and Hitmontop without having to worry about Intimidate. Earthquake is a good way to catch opposing Steel-types such as Heatran and opposing Metagross, but it lacks a STAB boost and will also hit your partner, which can be tricky to play around.</p> <p>Occa Berry allows Metagross to live through Fire-type hits that would otherwise KO it. However, one must be aware of more powerful Fire-type attacks such as a Fire Gem-boosted Overheat from Volcarona or Chandelure as they can still OHKO Metagross even with Occa Berry. Steel Gem is another great option to give a one-time boost to Meteor Mash when needed. Shuca Berry is an option to let Metagross better handle Ground-type attacks, accomplishing things such as taking a Landorus-T's Earthquake and 2HKOing back with a combination of Ice Punch and Bullet Punch. However, its other options are generally more useful. Lum Berry can also be a nice choice, which lets Metagross cure pesky statuses such as burns that would otherwise render it useless. In addition, Lum Berry can be used with a Swagger user to grant a free +2 Attack boost that can't be removed by Intimidate. Hammer Arm can be used to hit Steel-types without having to resort to Earthquake, but it hits most of the common Steel-types in the tier neutrally and its Speed drop is undesirable. Psychic Gem is a useful option as it gives Zen Headbutt enough power to OHKO Amoonguss as well as some bulkier Fighting-types. An EV spread of 68 HP / 252 Atk / 188 Spe can be used to outspeed Garchomp after an Icy Wind, but the loss of bulk compared to the main spread is noticeable. 60 EVs in Speed allows Metagross to outrun and OHKO uninvested Heatran.</p> <p>Pokemon such as Togekiss, Cresselia, and Zapdos make for great partners to this set as they can provide it with Speed control to help patch up its underwhelming Speed. Tailwind is particularly useful as 4 Speed EVs and Tailwind support allows Metagross to outspeed Tornadus. Zapdos is an especially great partner, as it can provide Tailwind support and also eliminate bulky Water-types that hassle Metagross. Trick Room support from Pokemon such as Cresselia and Reuniclus can also be nice since Metagross is fairly slow. If this is the case, Hammer Arm is a great option in the third slot due to the Speed drop it provides, which effectively increases Metagross's Speed under Trick Room. Other physical attackers such as Tyranitar make for good partners as they appreciate Metagross's ability to take out common Intimidate Pokemon such as Landorus-T and Hitmontop. Pokemon such as Breloom and Rotom-W make for great partners as well since they have no trouble getting rid of bulky Water-types that trouble Metagross. In addition, the aforementioned Pokemon can also handle Earthquake users such as Excadrill who can threaten Metagross. Rain support from Politoed can be appreciated as well since it negates Metagross's Fire-type weakness.</p> "
      },
      {
        "name": "Choice Scarf",
        "description": "<p>With a Choice Scarf, Metagross can effectively patch up its poor Speed and eliminate common Pokemon such as Garchomp, Shaymin-S, and Terrakion. The Speed boost allows Metagross to outspeed Shaymin-S and outpace the majority of Pokemon in the tier. This can be useful to swiftly KO Pokemon that stay in expecting to outspeed and damage Metagross. Meteor Mash is the main STAB attack on this set, boasting a high Base Power and a useful chance to grant an Attack boost. Ice Punch allows Metagross to eliminate common Pokemon such as Shaymin-S, Landorus-T, and Garchomp. Zen Headbutt is a good option for a secondary STAB attack, as Steel-type STAB has pitiful coverage. Earthquake is also an option to hit Pokemon such as Heatran, but being locked into Earthquake in a tier filled with Flying-types and Levitators can often backfire. Trick is a great option in the last slot to give Metagross a way to deal with bulkier Pokemon such as Jellicent and Cresselia, neutering their effectiveness with a Choice item.</p> <p>Explosion can be a cool option to net some KOs on unsuspecting Pokemon, but it can constrain your teambuilding as it hits your partner as well as your opponent. Other physical attackers such as Tyranitar and Breloom appreciate Metagross's ability to dispatch common Intimidate Pokemon such as Landorus-T, Salamence, and Hitmontop. Slower teams appreciate this set because it grants them more speed than they would have otherwise, giving them a good check to fast Pokemon such as Terrakion and Latios. Pokemon such as Breloom and Rotom-W make for good partners to Metagross as they can KO bulky Water-types that are a thorn in Metagross's side. Rain support can be useful to help mitigate Metagross's Fire-type weakness.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Audiosurfer", "user_id": 136301}], "teams": [{"name": "Quality checked by", "members": [{"username": "tofucocoa", "user_id": 34584}, {"username": "Nix_Hex", "user_id": 40064}, {"username": "Nollan", "user_id": 161530}]}, {"name": "Grammar checked by", "members": [{"username": "piikachuu", "user_id": 190864}, {"username": "Governess", "user_id": 168470}]}]}
  },
  "Latias": {
    "overview": "<p>Latias is outclassed in most roles that it can perform in Doubles due to the omnipresent Psychic-types, Cresselia and Latios. Cresselia usually pulls off a support role better courtesy of its mind boggling bulk, something Latias can only dream of rivaling. Latios, on the other hand, largely outclasses Latias as an offensive Pokemon, due to its higher Special Attack stat. That said, thanks to its good bulk, useful resistances to common attacking types—Water, Fire, Electric, and Fighting—and Speed, Latias is one of the best Tailwind setters in the metagame.</p> ",
    "comments": "<h1>Other Options</h1> <p>If you could describe Latias's movepool with a single word, it would be 'colossal'. That said, even with plenty of attacking and supportive options, there are few if any combinations Latias can use as effectively as the moves listed on the main set. There are two item options worth mentioning though: Yache Berry and Dragon Gem. Yache Berry is fairly self-explanatory; it helps Latias in countering Blizzard teams and taking Ice-type attacks comfortably in general. Dragon Gem, on the other hand, seems like complete madness, but because Latias secures OHKOs on Breloom, Kyurem-B, and Chandelure with it, it is a perfectly viable option if you wish to fling an extra hard-hitting Draco Meteor in your opponent's direction.</p> <p>As Latias is first and foremost a supporter, additional moves that help it support naturally get the first mentions. Icy Wind can be used as a different form of speed control, but it is often better used by more bulky Pokemon such as Cresselia. Heal Pulse is an interesting option that lets Latias heal a teammate, but should be used with caution; it will hit the opponent if your teammate goes down. Safeguard also deserves a mention, as it prevents the opponent from repeatedly using Thunder Wave, which is usually one of Tailwind's worst enemies. Reflect and Light Screen seem great for Latias on paper, but it is no Cresselia, and therefore has a hard time setting said screens up. Sunny Day and Rain Dance are options to help either support your weather team or disrupt problematic opposing weather teams. Role Play can also help perform this, as well as copying useful abilities such as Intimidate, but it is generally hard to consistently use effectively due to the move's gimmicky nature. Magic Coat is useful for bouncing back Taunt and Thunder Wave, but it is very situational. Swagger can be used in tandem with a teammate carrying a Lum Berry to boost its Attack for free; it can also be used to disrupt the opposition, but relying on coin flips is usually a terrible idea.</p> <p>Latias can also pack a punch, so a fully offensive spread with 4 HP / 252 SpA / 252 Spe and a Timid nature is viable due to Latias having more bulk than Latios. The main moves for this set would be Draco Meteor, Psyshock, Hidden Power Fire, and Protect. Thunderbolt and Thunder could also be used to hit many bulky Water-types hard, and Grass Knot and Energy Ball could do the same against different Water-types. You could also opt to use Psychic over Psyshock, but because most Pokemon in Doubles invest in Special Defense rather than Defense, Psyshock hits most targets harder. Finally, Latias's humongous list of other options ends with a rather peculiar option: Mist Ball. This move works as a STAB move and a pseudo-Snarl at the same time, but Psyshock is a more consistent STAB Psychic-type attack.</p> <h1>Checks and Counters</h1> <p>Steel-types, such as Metagross and Bisharp, have no trouble walling Latias's attacks and can do a good amount of damage in return. Bug-types, such as Heracross, Genesect, and Scizor, can easily KO it with their STAB moves, and in Volcarona's case, even set up on Latias. Thundurus and Tornadus are problematic if Latias needs to set up Tailwind, as they can both Taunt it, the latter also being able to deal a big number with Flying Gem-boosted Acrobatics. Another huge problem for Latias is bulky or fast Dark-types, such as Tyranitar and Weavile, as they can take it out with a STAB move of choice. Most Trick Room setters can both wall Latias and undermine its speed control, especially bulky setters such as Cresselia and Dusclops. Chandelure succeeds in both setting up Trick Room and dealing super effective damage, making it one of the big thorns in Latias's side. Latios will win against Latias if it gets lucky; it needs to win the Speed tie and hope that Latias doesn't carry Haban Berry, but if the situation is so, Latias gets OHKOed easily by Draco Meteor, boosted or not. Finally, Sableye is a Pokemon that will make Latias rip its (non-existent) hair out, due to its ability to shut Latias down with Taunt and burn the potential physical attackers standing at its side.</p> ",
    "sets": [
      {
        "name": "Speedy Support",
        "description": "<p>With this set, Latias pieces together all of its positive traits to make the most out of itself as a fast supporter in the Doubles metagame. Tailwind is a fantastic support move, helping your team wreak havoc throughout the four turns that it lasts without fear of getting outpaced, but Thunder Wave is a perfectly viable alternative that permanently affects a Pokemon on the opponent's team's Speed. Draco Meteor might seem odd on a support Pokemon, and Dragon Pulse looks a bit more appealing on paper, but Draco Meteor provides fantastic utility by being able to OHKO many popular Dragon-types in Doubles and makes sure Latias can perform an alternative role as opposed to just being a fully support-oriented Pokemon.</p> <p>To show the benefit of using Draco Meteor over Dragon Pulse, here are some important damage calculations:</p> <p>Draco Meteor vs. 4 / 0 Salamence: 119.27 - 140.96%</p> <p>Draco Meteor vs. 4 / 0 Hydreigon: 109.2 - 129.44%</p> <p>Draco Meteor vs. 4 / 0 Garchomp: 104.46 - 124.02%</p> <p>Draco Meteor vs. 0 / 4 Latios: 100.33 - 118.27%</p> <p>The third slot is another move that prevents Latias from becoming dead weight after using Tailwind or Draco Meteor. Helping Hand is extremely useful, as it can boost Latias's teammates' moves after Tailwind has been set up, helping it fill the role of a supporter more effectively. Protect is very useful in the last slot for playing mindgames and is a general staple on many Pokemon in Doubles, but because Latias is as bulky as it is, Protect is not nearly as necessary as it would be on an offensive Pokemon. Psyshock is another viable option, as it hits common Fighting-types such as Hitmontop and Breloom for solid damage.</p> <p>The given spread allows Latias to use its amazing Speed tier to outpace key threats such as Terrakion, Salamence, and Garchomp. An alternative spread of 252 HP / 252 Def / 4 SpD might look appealing for additional bulk, but Latias's Speed is what really sets it apart from Cresselia, and it is much harder to set Tailwind or use Thunder Wave if Latias is slow. Sitrus Berry is the main item, as it helps with Latias's overall longevity, but Haban Berry helps it deal with opposing Dragon-types much more effectively, as it can survive any Dragon-type attack and retaliate by either setting up Tailwind or hitting back hard with a Draco Meteor. Dragon Pulse could work over Draco Meteor, but it misses out on the important OHKOs listed above. Psychic is an option to hit Pokemon such as Breloom and Landorus-T for more damage, but Psyshock hits most Pokemon harder due to the metagame being more specially defensive in general.</p> <p>First and foremost when it comes to picking teammates, know that anything with middling to high Speed appreciates the speed control support from Latias. Pokemon such as Rotom-W, Heracross, and Victini are all good Pokemon to use on Tailwind teams and should therefore be considered for use alongside Latias. Even more notable Pokemon under this category are Ground-types that benefit from Tailwind. Garchomp, Landorus-T, and Mamoswine are all fantastic teammates, as they can freely use Earthquake due to Latias's immunity to it. Steel-types synergize extremely well with Latias, as they resist attacks that hit Latias for super effective damage, so Pokemon such as Scizor and Metagross are good teammates as well. Finally, teams weak to sun and rain appreciate the presence of Latias, as its presence alone will be a thorn in the side of those archetypes.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Laga", "user_id": 176920}], "teams": [{"name": "Quality checked by", "members": [{"username": "Audiosurfer", "user_id": 136301}, {"username": "Nollan", "user_id": 161530}, {"username": "Pocket", "user_id": 95}]}, {"name": "Grammar checked by", "members": [{"username": "Kingler", "user_id": 189059}, {"username": "melvni", "user_id": 64080}]}]}
  },
  "Latios": {
    "sets": [
      {
        "name": "Special Attacker",
        "description": "<ul> <li>Latios is one of the premier special attackers in the metagame, capable of decimating opposing teams with its boosted Draco Meteor and its high Speed that allows it to outpace most foes. This, alongside Hidden Power Ground to cover Heatran and Metagross, makes Latios difficult to reliably switch into and a threat that every team must prepare for.</li> <li>Psychic is another reliable STAB attack that can hit common Pokemon, such as Amoonguss and Conkeldurr, without the drawback of Draco Meteor. Alternatively, teams can opt for Tailwind over Psychic if they require the speed control.</li> <li>Both Dragon Gem and Life Orb function to improve Latios's damage output. Dragon Gem gives Latios a one-time Draco Meteor nuke. The idea behind the Dragon Gem set is that Latios uses Draco Meteor most often and only uses Psychic or Hidden Power Ground against super effective targets such as Conkeldurr and Heatran, respectively, which already take a ton of damage even without a Life Orb boost. Given how common residual damage is, such as from Stealth Rock or sand, the lack of recoil with Dragon Gem can allow Latios to better tank hits, such as Landorus-T's U-turn, Excadrill's Iron Head, or Choice Band Genesect's Extreme Speed.</li> <li>On the other hand, Life Orb gives a boost to all of Latios's attacks, thus allowing it to function better as a wallbreaker by dishing out more damage to key metagame threats, such as Heatran, Metagross, and Amoonguss. Additionally, Life Orb gives Latios more consistent Draco Meteor damage. Overall, either set provides more or less the same value to a team, and deciding which item to use oftentimes comes down to personal playstyle.</li> <li>Latios's unique combination of speed and power can allow it to function as a reliable wallbreaker while also being able to outspeed and threaten much of the format's slower attackers, such as Kyurem-B.</li> <li>Latios requires minimal direct support due to its ability to fit on a variety of teams, although it does benefit from teammates that can remove Tyranitar, such as Conkeldurr, Landorus-T, and Genesect.</li> <li>Hidden Power Fire can be used to hit Genesect and Ferrothorn, although Latios will be slower than opposing Latios due to HP Fire IVs.</li> <li>A Choice Scarf set with Trick over Protect and Ice Beam over Psychic can be used as a speedy revenge killer, allowing Latios to outspeed and OHKO opposing unboosted Latios, Choice Scarf Kyurem-B, and Choice Scarf Landorus-T while enabling it to cripple bulkier Pokemon, such as Cresselia or Jellicent, with Trick.</li> </ul> "
      }
    ],
    "credits": {"writtenBy": [{"username": "DaAwesomeDude1", "user_id": 228280}], "teams": [{"name": "Quality checked by", "members": [{"username": "zee", "user_id": 501951}, {"username": "Memoric", "user_id": 215000}]}, {"name": "Grammar checked by", "members": [{"username": "autumn", "user_id": 384270}]}]}
  },
  "Deoxys-Attack": {
    "overview": "<p>A Pokemon with godlike defenses rivaling those of Shuckle and a phenomenal HP stat that puts even Blissey to shame... this is the complete opposite of Deoxys-Attack. A dismal HP stat with pathetic defenses means that Deoxys-A will be OHKOed by almost every Pokemon in the game; it is the ultimate glass cannon. However, despite its pathetic durability, Deoxys-A's offensive prowess makes it a truly threatening behemoth. Base 180 attacking stats with unparalleled coverage and a 140 Base Power STAB move in Psycho Boost means that it can OHKO most of the metagame. Deoxys-A is truly a legend that all teams should be prepared to face.</p> ",
    "comments": "<h1>Other Options</h1> <p>Deoxys-A's wide movepool means that it has a large amount of other options. For example, it can use Thunder or Thunderbolt to hit Water-types; however, Psycho Boost can usually OHKO them regardless. Substitute can make Deoxys-A a monster, but is very difficult to get up safely. It also has access to Taunt to stop the opposition from trying to paralyze it or set up Trick Room. Rock Slide is an option as well, being Deoxys-A's only spread move, but the coverage moves provided usually work much more effectively. Finally, an all-out Special variant of Deoxys-A can be used with Psycho Boost / Ice Beam / Hidden Power Fire / Protect, but a mixed set usually works better.</p> <h1>Checks and Counters</h1> <p>Hitmontop can use Fake Out to break Deoxys-A's Focus Sash, and also has access to Feint to break Deoxys-A's predicted Protect. Tyranitar and Abomasnow can break Deoxys-A's Focus Sash with their respective weather abilities, making them solid answers to it. Priority users such as Breloom and Scizor can also be great answers to Deoxys-A, especially if it is not carrying a Focus Sash. Bulky Steel-types, such as Metagross and Bronzong, can also be a problem, as they can tank Superpower and Hidden Power Fire and KO Deoxys-A in return. Spread moves can also pose a major problem to Deoxys-A, as the reduced power will not matter due to Deoxys-A's frailty. Jirachi can tank any of Deoxys-A's hits easily, and can redirect its attacks with Follow Me. Scrafty can lower its attack and KO Deoxys-A with Crunch, while Bisharp can kill it with Sucker Punch. Swift Swim Pokemon can also defeat Deoxys-A easily. Cresselia and Reuniclus can tank a Dark Pulse from Deoxys-A and KO it in return. Finally, Thundurus-I can Thunder Wave Deoxys-A and effectively neutralize it; Pokemon with Tailwind or Trick Room can also render Deoxys-A useless.</p> ",
    "sets": [
      {
        "name": "Mixed Attacker",
        "description": "<p>This set utilizes Deoxys-A's raw power and phenomenal coverage in the most effective way possible. STAB Psycho Boost can KO most of the tier, and can still do major damage to the opposition even after the Special Attack drop it causes. Dark Pulse can work well against Psychic-types, such as Cresselia and Reuniclus, that resist Psycho Boost. However, ExtremeSpeed can also work; as Deoxys-A's lone priority move, it can work well to KO weakened Choice Scarf and priority users. Superpower lets Deoxys-A annihilate Dark-types, such as Tyranitar, and Steel-types; Hidden Power Fire also works in this slot, however, letting Deoxys-A hit Scizor and Genesect while foregoing its ability to hit Tyranitar and other Dark-types as hard. Finally, Protect is key in the last slot, allowing Deoxys-A to block opposing Fake Outs.</p> <p>Focus Sash is key on this set, as it allows Deoxys-A to take any hit despite its low defenses. However, Life Orb can also be a useful item, as it can help Deoxys-A get key KOs on Pokemon such as Heatran that it could not otherwise. Life Orb is a better choice on sand and hail teams, as well as teams without weather control, as sand and hail will render Deoxys-A's Focus Sash worthless anyway. The EVs take full advantage of Deoxys-A's offensive prowess, with enough Speed investment to move before Jolteon and Scarf Cloyster; Rash nature maximizes its Special Attacking power. Stealth Rock can be used over Protect and can work against teams with Pokemon such as Thundurus, but Protect's versatility makes it a more reliable option. Ice Beam can be used over Dark Pulse, retaining coverage on Latias and Latios, while gaining super effective coverage on Pokemon such as Landorus-T and Garchomp, but its inability to hit Reuniclus and Cresselia super effectively means it is usually a worse option.</p> <p>Deoxys-A appreciates a partner that minimizes the opponent's chance to retaliate. Thus pairing Deoxys-A with a powerful priority user, such as Bisharp, or a speedy Sweeper; such as Life Orb Darkrai, Genesect, or Volcarona, is recommended. The aforementioned teammates also offer powerful Fire-, Dark-, or Bug-type offenses to combat troublesome Steel- and Psychic-types, potentially freeing up one of Deoxys-A's moveslot for a different type of coverage or utility move, such as Ice Beam or ExtremeSpeed. Pokemon with Follow Me or Rage Powder, such as Jirachi, Togekiss, and Volcarona, can also be good partners, as Deoxys-A can OHKO most of the tier by itself. Hitmontop is also a very good partner due to its access to Wide Guard, which can block spread moves, Feint, which can break Protect, and Fake Out, which can leave potentially dangerous threats vulnernable to being OHKOed by Deoxys-A. Speed control is also very important when using this set due to Deoxys-A's pathetic bulk, so Pokemon that can use Tailwind, such as Tornadus, can be a big help; Tornadus also has access to Prankster Taunt, which can stop the opposition from using moves such as Thunder Wave and Trick Room which would render Deoxys-A useless.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "-Tsunami-", "user_id": 30130}], "teams": [{"name": "Quality checked by", "members": [{"username": "Laga", "user_id": 176920}, {"username": "Mizuhime", "user_id": 51961}, {"username": "Audiosurfer", "user_id": 136301}]}, {"name": "Grammar checked by", "members": [{"username": "Nix_Hex", "user_id": 40064}, {"username": "Arkian", "user_id": 174386}]}]}
  },
  "Abomasnow": {
    "overview": "<p>Abomasnow seems lackluster at first glance, but it is actually a large threat in the Doubles metagame. Its key to success is its ability, Snow Warning. This allows it to be a great check to opposing weather teams, robbing Pokemon such as Kingdra and Excadrill of their respective weathers. Its STABs are also great offensively, providing good neutral coverage and allowing it to easily dispatch the two most common weather inducers in the tier, Politoed and Tyranitar. Defensively, its resistance to Water-type attacks allows it to be a thorn in the side of most rain teams. Furthermore, Snow Warning grants it access to perfectly accurate Blizzards, allowing it to be pose an even bigger offensive threat. However, it is also left weak to many common attacking types and spread moves. This makes Abomasnow difficult to keep alive, as those weaknesses can be easily exploited. Abomasnow does have its fair share of flaws, but its excellent ability and unique set of assets more than make up for this, making it a Pokemon that should be considered for many teams.</p> ",
    "comments": "<h1>Other Options</h1> <p>A Substitute set can be useful to shield Abomasnow from Pokemon looking to KO it, but due to its slew of weaknesses, it can be difficult to find the time to set up a Substitute. Leech Seed can be useful to give Abomasnow gradual recovery as well as stacking residual damage with hail, but Leech Seed stalling isn't as effective in Doubles as it is in Singles. Earthquake is an option to hit Steel- and Fire-types for super effective damage; however, due to the fact that it lacks STAB and has its damage reduced due to being a spread move, it can be problematic. In addition, the fact that it would also hit Abomasnow's partner can make it difficult to use at times. Ice Beam is an option to allow Abomasnow to reliably hit Pokemon with an Ice-type STAB move when hail isn't up, but this option is rather situational and it is usually better to just run Blizzard. Icy Wind can be used to provide speed control for the rest of your team, but Abomasnow is usually better off leaving that to a teammate. Focus Blast can be useful on special attacking sets to hit non-Chople Berry Tyranitar harder than Giga Drain, as well as hitting Pokemon such as Heatran, Bisharp, and Kyurem super effectively. An Ice Gem is a nice way to power up Blizzard, doing large amounts of damage to anything it hits neutrally. Finally, a set utilizing Expert Belt can be a nice option to power up Abomasnow's coverage moves and net additional KOs.</p> <h1>Checks and Counters</h1> <p>Fire-types such as Ninetales, Heatran, Chandelure, Victini, and Volcarona make for great counters, as they resist all of Abomasnow's commonly used moves and can easily KO it with STAB-boosted Fire-type attacks. Heatran and Volcarona are especially threatening, as they can easily set up a Substitute or a Quiver Dance, respectively, while Abomasnow is on the field. Jirachi makes a great check as it resists both of Abomasnow's STAB moves, is difficult for Abomasnow to wear down, and can use Follow Me to redirect its attacks and thus limit its usefulness. Metagross, Bisharp, Genesect, and Scizor also resist both of Abomasnow's STAB attacks and can deal large amounts of damage back with their Steel-type attacks. However, they must all watch out for Hidden Power Fire, especially Scizor. Fighting-types such as Hitmontop, Scrafty, Conkeldurr, and Terrakion also make good checks to Abomasnow, as they can easily threaten it with their Fighting-type attacks. Hitmontop and Conkeldurr are especially threatening, because they can use Wide Guard to shield both themselves and their partners from Abomasnow's Blizzard. Offensive Cresselia can take any of Abomasnow's hits and KO it with Hidden Power Fire. Tornadus easily outspeeds Abomasnow and can maul it with Acrobatics, although it has to watch out for Ice Shard and the Choice Scarf set. Rock Slide users such as Tyranitar and Excadrill can deal significant damage to Abomasnow, though if it lives through the hit, it is capable of doing a lot of damage to them in return.</p> ",
    "sets": [
      {
        "name": "Focus Sash",
        "description": "<p>With this set, Abomasnow can stay alive longer in order to keep hail up. It can also act as a good check to common weather sweepers such as Excadrill and Ludicolo. Blizzard is the main attacking move here due to the fact that it is both very powerful and a spread move, letting Abomasnow hit both opposing Pokemon hard. In addition, Blizzard has good neutral coverage, so it is easy to spam. Giga Drain is a good secondary STAB move, as it allows Abomasnow to hit bulky Water-types, such as Jellicent and Politoed. The recovery from Giga Drain is a nice bonus to grant more longevity and potentially allow Abomasnow to put itself back in Focus Sash range. Grass Knot is a nice alternative to hit heavier Pokemon such as Tyranitar for more damage, although the lack of recovery is unfortunate. Ice Shard is a useful option to pick off weakened Pokemon and somewhat makes up for Abomasnow's low Speed, while Hidden Power Fire is a great option to roast Scizor, Metagross, and opposing Abomasnow. The former in particular will otherwise switch into Abomasnow without worry.</p> <p>Focus Sash is used so that Abomasnow can survive any attack at full health. A Quiet nature is the main option because it makes Abomasnow slower than most weather inducers, which lets it put up hail turn one. In addition, it allows Abomasnow to be a nice check to Trick Room teams. However, if you'd rather have the additional Speed, you could use a Modest nature instead. Hidden Power Rock is an option to hit Volcarona, who otherwise has nothing to fear from Abomasnow. However, Abomasnow is not a very reliable check, as Volcarona can easily outspeed and KO it. It is also a very niche option and won't be needed very often, as outside of Fire-types, Hidden Power Rock and Blizzard have redundant coverage.</p> <p>Due to Abomasnow's poor Speed, Trick Room setters such as Cresselia and Slowking make for great partners, forming a devastating HailRoom combination that can quickly dismantle unprepared teams with Blizzard. Psychic- and Ghost-types are great options to set up Trick Room, as they can also cover up Abomasnow's Fighting weakness. Hitmontop makes for an amazing partner as it has access to Wide Guard, shielding Abomasnow from Rock Slides and Heat Waves that would otherwise deal heavy damage to it. Hitmontop's Fighting-type STAB also lets it threaten Rock-types, such as Tyranitar, and Steel-types, such as Heatran, that can cause problems for this set. Heatran and Chandelure make great partners for this set as they can discourage the opponent from using Fire-type attacks that would otherwise spell the end of Abomasnow. They can also defeat the Steel-types that resist both of Abomasnow's STAB moves and can KO Abomasnow in return. Water-types such as Rotom-W and Suicune make for nice partners, as they can defeat Pokemon that threaten Abomasnow such as Scizor, Heatran, and Tyranitar. In return, Abomasnow can eliminate Gastrodon. Other Blizzard users such as Kyurem and Rotom-F make for good partners as well, as they can provide the pieces for a deadly BlizzSpam strategy.</p> "
      },
      {
        "name": "Mixed Attacker",
        "description": "<p>The main goal of this set is to use raw power to eliminate opposing weather setters and win the weather war quickly. Wood Hammer is the main draw of this set, and thanks to its high Base Power, it can deal huge amounts of damage to Pokemon such as Politoed and Tyranitar. Although a special attack might seem more practical, Wood Hammer has the advantage of circumventing Tyranitar's Special Defense boost from sandstorm, allowing it to do more damage than special alternatives would. Blizzard is used as a secondary STAB move, and it is a great attacking option thanks to its high Base Power and the ability to hit both opposing Pokemon. It is also nice because it has great type coverage with Wood Hammer, taking out Flying-types that resist the move. Ice Shard is a nice option in the third slot to pick off weakened Pokemon and somewhat mitigate Abomasnow's low Speed. However, Hidden Power Fire is another great option to hit Steel-types, such as Scizor and Metagross, that can quickly become a problem for Abomasnow. It also allows Abomasnow to take out opposing Abomasnow, which is a nice bonus.</p> <p>Grass Gem is used on this set because it allows Abomasnow to net some important KOs with Wood Hammer, such as an OHKO on Politoed and Tyranitar, the two most common weather setters. Although the EV spread seems complicated, it serves a very specific purpose: 124 Attack in conjunction with a Brave nature allows Abomasnow to OHKO Tyranitar and Politoed with a Grass Gem-boosted Wood Hammer. The HP and Defense EVs allow Abomasnow to survive both a Rock Slide and a Low Kick from Tyranitar. The remaining EVs are put into Special Attack to power up Blizzard. Brave is used over Adamant so as not to reduce the power of Blizzard. It also ensures Abomasnow is generally slower than most opposing weather setters, so it can swiftly KO them with Wood Hammer and keep hail up.</p> <p>Other Blizzard users such as Kyurem and Rotom-F make for excellent partners to this set, as they can take advantage of Abomasnow's ability to get rid of opposing weather setters by spamming STAB-boosted Blizzards and heavily damaging opposing teams. Hitmontop is also a great partner, as Wide Guard support is appreciated with Abomasnow lacking any way to survive deadly spread moves such as Heat Wave and Rock Slide. The fact that Hitmontop has Feint is also great to get a surprise KO on Politoed and Tyranitar that think that they are safe by simply Protecting. Chandelure and Heatran are nice partners, as they can dissuade opposing Pokemon from using Fire-type attacks thanks to their Flash Fire ability. Water-types such as Rotom-W and Suicune make for good partners as well, as they can handle the Rock-, Fire-, and Steel-types that can give Abomasnow trouble; in return Abomasnow can quickly KO Gastrodon, who is a large nuisance to them. Thanks to its low Speed, Abomasnow partners well with Trick Room setters such as Cresselia and Slowking to utilize a HailRoom strategy that can be very difficult for the opponent to fight. Most Trick Room setters also either resist or are immune to Fighting-type attacks, so they can take on the Fighting-types that trouble Abomasnow.</p> "
      },
      {
        "name": "Choice Scarf",
        "description": "<p>With a Choice Scarf equipped and maximum Speed investment, Abomasnow is able to reach 360 Speed, allowing it to outspeed fast sweepers such as Tornadus and Latios and dispatch of them. Blizzard is the main attacking move here, being an excellent move to be locked into thanks to its amazing neutral coverage, great power, and the ability to hit both opposing Pokemon at once. Hidden Power Fire is a good option to dispatch Scizor and Genesect. However, if these Pokemon are not concerning to you, Hidden Power Ground is a good option to hit Heatran and Chandelure, who would otherwise be massive threats to Abomasnow. Giga Drain is a good secondary STAB move to hit bulky Water-types, such as Politoed, that would otherwise not be bothered by Abomasnow's attacks. The fact that Giga Drain recovers some HP is a nice bonus as well. Grass Knot is an alternative to hit heavier Pokemon, such as Jellicent and Tyranitar, for more damage. Ice Shard is a good option to pick off faster Pokemon such as Shaymin-S, as even with a Choice Scarf equipped, Abomasnow still isn't that fast.</p> <p>This set has a nice surprise value, as Pokemon such as Latios and Tornadus will often attempt to OHKO Abomasnow, only to be outsped and OHKOed themselves. In addition, this set is a nice check to dangerous weather sweepers such as Kingdra and Excadrill, as it can remove their preferred weather, outspeed them, and hit them for nice damage.</p> <p>28 EVs are put into Defense to allow Abomasnow to survive both a Bullet Punch from Scizor and a Steel Gem-boosted Bullet Punch from Metagross, and the remaining EVs are put into Speed and Special Attack. A Modest nature might be appealing to grant Abomasnow more power, but Timid is necessary to outspeed Latios and Tornadus. Light Screen is an interesting option in order to give Abomasnow's partner more special bulk in a pinch, letting it survive hits it otherwise might not. However, being locked into Light Screen will quickly become problematic for Abomasnow. Hidden Power Rock can be used to hit Volcarona, but it is very situational and outside of targeting Fire-types, Hidden Power Rock gets redundant coverage with Blizzard.</p> <p>Because this set has a harder time winning weather wars than its other sets, Pokemon that can take on Ninetales and Tyranitar, namely Terrakion, Garchomp, and Rotom-W, make for great partners. Heatran and Chandelure make for good partners to discourage the opponent from using Fire-type moves, which otherwise can easily eliminate Abomasnow. Other Blizzard users such as Kyurem and Rotom-F make for great partners to this set, as together they can form an effective BlizzSpam core.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Audiosurfer", "user_id": 136301}], "teams": [{"name": "Quality checked by", "members": [{"username": "tofucocoa", "user_id": 34584}, {"username": "Nollan", "user_id": 161530}, {"username": "Pocket", "user_id": 95}]}, {"name": "Grammar checked by", "members": [{"username": "melvni", "user_id": 64080}, {"username": "Blast", "user_id": 191846}]}]}
  },
  "Mamoswine": {
    "sets": [
      {
        "name": "Physical Attacker",
        "description": "<ul> <li> <p>is a physical attacker whose typing and offensive coverage grant it nifty role compression in that it checks numerous Steel-types and matches up well against Landorus-T and Thundurus. However, its middling Speed tier, numerous weaknesses against common attacking types, and offensive shortcomings in its lack of damage and susceptibility to Intimidate leave it as a very niche Pokemon in the metagame, one that is often better replaced by Kyurem-B or Landorus-T.</p> </li> <li> <p>Icicle Crash OHKOes Landorus-T, Thundurus, and Latios. Icicle Spear is an option to OHKO Focus Sash Landorus-T but is less consistent against Thundurus and Latios, as it requires 3 hits to OHKO them. Earthquake OHKOes Heatran and 2HKOes Metagross and Tyranitar. Ice Shard gets around Mamoswine's mediocre Speed tier to hit Landorus-T and Latios first, 2HKOing them and circumventing Focus Sash Landorus-T, while Stealth Rock grants it some utility and chips foes to get them in KO range of its teammates' attacks.</p> </li> <li> <p>Focus Sash allows Mamoswine to guarantee a damage trade one time and is especially useful for Mamoswine as it isn't affected by sand and hail damage.</p> </li> <li> <p>Other options include Superpower to OHKO Tyranitar without Chople Berry. Mamoswine can also run Choice Scarf, which circumvents its mediocre Speed by outspeeding and OHKOing Latios, and it matches up even better into Landorus-T and Thundurus.</p> </li> <li> <p>Mamoswine does poorly into Jellicent, which can use Will-O-Wisp and Recover against it, and rain, so support from Tyranitar, Thundurus, and powerful Dragon-types is appreciated. Thundurus also mitigates Mamoswine's mediocre Speed tier by using Thunder Wave against faster foes such as Latios and Kingdra. Support from strong Dragon-types such as Dragon Gem Latios also helps put other foes in range of Mamoswine's middling attacks. Heatran is a good teammate because it deals with Metagross, which outtrades Mamoswine despite Earthquake, and non-Ground-weak Steel-types in Ferrothorn, Scizor, and Genesect. Conkeldurr also deals with Ferrothorn and hits Kyurem-B and Excadrill, who beat Mamoswine. All of the aforementioned teammates greatly appreciate Mamoswine's ability to beat the ubiquitous Landorus-T and Thundurus. Teammates like Genesect and Metagross that can remove Cresselia quickly are necessary, as it walls Mamoswine.</p> </li> </ul> "
      }
    ],
    "credits": {"writtenBy": [{"username": "ryo yamada2001", "user_id": 192134}], "teams": [{"name": "Quality checked by", "members": [{"username": "Smudge", "user_id": 550367}, {"username": "DaAwesomeDude1", "user_id": 228280}]}, {"name": "Grammar checked by", "members": [{"username": "Tbolt", "user_id": 555379}, {"username": "autumn", "user_id": 384270}]}]}
  },
  "Rotom-Wash": {
    "overview": "<p>Rotom-W manages to stand out as a premier Water-type in yet another tier thanks to its great typing, bulk, offenses, and ability. Its dual STAB moves coming off of its base 105 Special Attack stat allow it to threaten common Pokemon in weather teams, and from a defensive standpoint, its typing in tandem with its good bulk allows it to check dangerous Pokemon such as Heatran and Kingdra. Its ability in Levitate is the icing on the cake, allowing it to both easily check and partner well with Earthquake users such as Excadrill and Landorus. Sadly for Rotom-W, however, it faces competition from other Electric-types in the tier, most notably Zapdos and Thundurus, who are more powerful and have cooler support options such as Tailwind and priority Thunder Wave. Thankfully, however, Rotom-W's access to Hydro Pump gives it a niche these other threats do not have, allowing it to maim the Ground-types looking to absorb an Electric-type attack. All in all, Rotom-W is a top tier threat that every team should be prepared for.</p> ",
    "comments": "<h1>Other Options</h1> <p>Rotom-W can utilize a ChestoRest set to heal off damage and cure itself of status, but the lack of a support move can hinder its effectiveness. A Rain Dance set can be effective to aid Politoed in winning weather wars. Sunny Day might seem like a strange option, but thanks to Rotom-W's typing and bulk, it can take hits from common rain attackers, set up Sunny Day, and maul Politoed with a STAB Thunderbolt. A Life Orb attacker set can be used to grant Rotom-W more attacking power and flexibility, but the recoil hampers its ability to check important threats. Light Screen can be used to pad the Special Defense of Rotom-W and its teammates. A Rindo Berry can be used to let Rotom-W survive a hit from Shaymin-S or Ferrothorn, letting it respond with the appropriate status move. Finally, Electroweb is an interesting option that lets Rotom-W grant more speed control to its team.</p> <h1>Checks and Counters</h1> <p>Grass- and Dragon-types that resist both of Rotom-W's STAB moves make for good counters to it. Abomasnow can easily switch into all of Rotom-W's moves and hit it hard with a STAB Giga Drain. Ferrothorn and Virizion also switch in with ease and can quickly dispatch Rotom-W, although they both must watch out for Will-O-Wisp. While Breloom and Shaymin-S don't enjoy taking one of Rotom-W's attacks, they can outspeed and KO with Bullet Seed and Seed Flare, respectively. Amoonguss is able to switch into Rotom-W with impunity, redirect its attacks with Rage Powder, put it to sleep with Spore, and heal off the damage with Regenerator. Latios, Latias, Hydreigon, Kyurem, and Kyurem-B can all shrug off attacks from Rotom-W and deal huge amounts of damage back with their Dragon-type STAB moves. Gastrodon is immune to both of Rotom-W's STAB moves. Although it can do little in return of Toxic, it grants its partner full protection from Rotom-W's Hydro Pump.</p> ",
    "sets": [
      {
        "name": "Bulky Attacker",
        "description": "<p>With this set, Rotom-W makes an excellent offensive support Pokemon and can use its good bulk and offensive power to check powerful Pokemon such as Excadrill, Kingdra, and Tyranitar. Hydro Pump is a great attacking move here, as it is very powerful and has excellent neutral coverage. It also decimates Ground-types and Tyranitar, both of which wouldn't mind taking a Thunderbolt. The fact that it gets a boost under rain allows Rotom-W to be both a nice rain partner and an even better rain check. Thunderbolt is a nice secondary STAB move, mauling the bulky Water-types that would otherwise not be threatened by Rotom-W. Thunderbolt also gives Rotom-W a more accurate attacking option than Hydro Pump. Thunder Wave is used here in order to cripple faster Pokemon and allow Rotom-W to better support its team. It is also nice to give Rotom-W a way to hit Pokemon that otherwise would not be very threatened by it, such as Latios. Will-O-Wisp is nice to cripple physical attackers, but paralysis is generally a more useful status condition.</p> <p>Sitrus Berry is the main item on this set because it helps boost Rotom-W's survivabiity, allowing it to continue to be a threat to the opponent as well as granting it the ability to take multiple hits in a single turn when needed. Alternatively, Rotom-W may hold a Water Gem or an Electric Gem to power one of its STAB moves to net quicker KOs. The investment in bulk is used to let Rotom-W survive a Life Orb-boosted Giga Drain from Ludicolo and either cripple it with paralysis or hit it with a Thunderbolt; the rest of the EVs are invested in Rotom-W's Special Attack to allow it to hit the things it checks for solid damage. Hidden Power Grass is a nice option to hit Gastrodon, which is otherwise a huge problem for this set. However, the loss of a support move can hamper Rotom-W's effectiveness. Thunder is a nice option in rain to grant Rotom-W more power, but its accuracy is shaky outside of rain, which can be a problem. Another option for this set is Discharge, as it gives Rotom-W a spread move with a nice paralysis chance. However, there is a noticeable drop in power between it and Thunderbolt, and the fact that it can also hit your partner can be a huge problem as it either forces Rotom-W's partner to Protect or forces you to pair Rotom-W with a Pokemon with an immunity to Electric-type attacks.</p> <p>Because Rotom-W is vulnerable to Grass- and Dragon-types that don't mind its attacks, Pokemon that can handle them such as Scizor and Abomasnow make for great partners. Scizor resists both Grass- and Dragon-type moves and can damage their users heavily with its Technician-boosted attacks. Abomasnow's STAB Blizzards can easily threaten both Grass- and Dragon-types, and it can also take care of Gastrodon with Giga Drain, making it another good choice. Other good partners include Hitmontop for its Intimidate support, Latios for its ability to outspeed other Dragon-types and beat Grass-types, and Tornadus for outspeeding all common Dragon-types and decimating things that can threaten Rotom-W with a Flying Gem-boosted Acrobatics. Pokemon such as Garchomp and Landorus can also be effective partners, as they appreciate Rotom-W's ability to check rain as well as its paralysis support; they also don't have to worry about hitting Rotom-W with Earthquake thanks to its Levitate ability.</p> "
      },
      {
        "name": "Choice Specs",
        "description": "<p>With Choice Specs and maximum Special Attack investment, Rotom-W's Special Attack reaches a whopping 509, letting it dish out serious pain to just about anything it attacks. Hydro Pump is the main STAB attack here, and it is a great move to be locked into thanks to its great coverage and high power, which lets it heavily damage Pokemon such as Tyranitar and Scizor. Thunderbolt is the secondary STAB move and has nice coverage with Hydro Pump, eliminating pesky Water-types such as Jellicent and Suicune that don't mind a Hydro Pump. It also allows Rotom-W to be locked into a more reliable STAB move and not have to risk Hydro Pump's 80% accuracy. Thunder might seem like a strange option alongside Thunderbolt, but it serves an important purpose. Even if you are using Rotom-W outside of rain, Thunder is necessary to net important KOs against common rain Pokemon, making this set a much better rain check. Here are some damage calculations comparing the power of Thunder to that of Thunderbolt:</p> <ul> <li>252+ SpA Choice Specs Rotom-W Thunderbolt vs. 0 HP / 4 SpD Ludicolo: 220-259 (73.57 - 86.62%) -- guaranteed 2HKO <li>252+ SpA Choice Specs Rotom-W Thunder vs. 0 HP / 4 SpD Ludicolo: 277-327 (92.64 - 109.36%) -- 56.25% chance to OHKO</li> <li>252+ SpA Choice Specs Rotom-W Thunderbolt vs. 0 HP / 4 SpD Kingdra: 229-270 (78.69 - 92.78%) -- guaranteed 2HKO</li> <li>252+ SpA Choice Specs Rotom-W Thunder vs. 0 HP / 4 SpD Kingdra: 288-340 (98.96 - 116.83%) -- 93.75% chance to OHKO</li> </ul> <p>If you are uncomfortable using Thunder outside of rain, Trick is another good option, as it lets you cripple a Pokemon by locking it into a move, severely hampering its usability. Trick is also useful because it prevents Pokemon from effectively taking advantage of moves such as Fake Out and Protect. Hidden Power Grass is mainly used to eliminate Gastrodon, which is very important because Gastrodon is immune to both of its STAB moves and not only redirects but also gets a boost from Hydro Pump. Hidden Power Ice is also an option to be able to eliminate Salamence and Shaymin-S. However, Thunder is able to OHKO both of them, so keep that in mind when deciding whether to use it.</p> <p>Volt Switch allows Rotom-W to fire off an attack while gaining momentum, but it is weaker than Thunderbolt and isn't able to be used as reliably due to forcing Rotom-W out when it is used. Another option for this set is Discharge, as it gives Rotom-W a spread move with a high chance to paralyze an opposing Pokemon. However, there is a noticable drop in power between it and Thunderbolt, and the fact that it can hit Rotom-W's partner can be a huge problem. This set really enjoys rain support, as not only does it grant Hydro Pump more power but it also allows Rotom-W to use Thunder reliably. The EVs allow Rotom-W to live a Life Orb-boosted Giga Drain from Ludicolo, which is even more important on this set because Rotom-W has a high chance to OHKO it in return with Thunder.</p> <p>Pokemon such as Scizor and Tornadus that can reliably eliminate Grass- and Dragon-types make good partners for this set as well. Garchomp, Excadrill, and Landorus appreciate this set's ability to easily wear down defensive Pokemon so they can clean up late-game. They also enjoy the fact that they can use their powerful Earthquakes without worrying about hurting Rotom-W. Cresselia also makes for a great partner as it can provide the speed control that Rotom-W likes having. It also enjoys the fact that this set can easily destroy things such as Scizor and Tyranitar that would otherwise threaten it.</p> "
      },
      {
        "name": "Choice Scarf",
        "description": "<p>With a Choice Scarf set, Rotom-W can outspeed and beat faster threats such as Tornadus. Hydro Pump is one of the main STAB moves used, and it is a great attacking option due to its high Base Power and its impeccable coverage. It is also great because it can eliminate Ground-types which are looking to absorb a Thunderbolt or Volt Switch; it also hits Tyranitar, which otherwise would not be bothered by anything on this set. Thunderbolt is another great attacking option because it hits bulky Water-types such as Jellicent and Politoed and is more reliable than Hydro Pump due to its perfect accuracy. Volt Switch is a great option for picking off weakened Pokemon while maintaining offensive momentum. It is also a great way to bring in Pokemon such as Politoed to give your team an edge in weather wars. Trick is a great option to cripple defensive Pokemon that might try to take advantage of the fact that Rotom-W will be locked into a move. The fact that it disrupts the use of moves such as Fake Out and Protect is also a nice bonus. Hidden Power Grass is the main option on this set to get rid of Gastrodon, which is very important because Rotom-W has no way to get past it otherwise. However, Hidden Power Ice is an option to KO Shaymin-S and Salamence.</p> <p>The EVs are very simple and are meant to make Rotom-W as fast and as powerful as possible. A Timid nature is slashed first in order to outspeed Jolly Choice Scarf Heracross, but if this benchmark isn't necessary for your team, a Modest nature can be used for more power, netting useful KOs such as an OHKO on Tyranitar outside of Sand. Thunder is an option over Thunderbolt, but it should only be used with rain support, as otherwise its accuracy will be too shaky. Sadly, due to the lack of investment in bulk, this set has more trouble switching into hits than others. This set works best on teams that are slower and need a way to take on fast attackers, so teams utilizing strategies such as Tailwind will likely be better served by another one.</p> <p>Politoed makes for a great partner for this set, giving Hydro Pump a large boost in power and enabling Rotom-W to use Thunder instead of Thunderbolt. In addition, Politoed appreciates Rotom-W's access to Volt Switch, as it allows Politoed to perform better in weather wars. Pokemon that can defeat the Grass- and Dragon-types that don't mind taking on this set, such as Scizor, Abomasnow, and Tornadus, make for good partners. Cresselia makes for another good partner to this set as it can provide Helping Hand support, allowing Rotom-W to gain KOs that it might otherwise miss out on, such as an OHKO on Shaymin-S with Thunder.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Audiosurfer", "user_id": 136301}], "teams": [{"name": "Quality checked by", "members": [{"username": "Level 51", "user_id": 118474}, {"username": "tofucocoa", "user_id": 34584}, {"username": "Laga", "user_id": 176920}]}, {"name": "Grammar checked by", "members": [{"username": "-Tsunami-", "user_id": 30130}, {"username": "melvni", "user_id": 64080}]}]}
  },
  "Shaymin-Sky": {
    "overview": "<p>As the only Pokemon that was unanimously banned from OU, it should be no surprise that Shaymin-S is a threat to prepare for in Doubles. Thanks to its high Speed, Shaymin-S is able to outspeed a large number of important threats such as Darkrai, Terrakion, Garchomp, and Tornadus, as well as various Choice Scarf users such as Tyranitar and Abomasnow. Shaymin-S also has the ability Serene Grace, which gives its two main STAB moves, Seed Flare and Air Slash, an 80% chance to lower the foe's Special Defense and a 60% chance to flinch, respectively. Shaymin's Grass / Flying typing makes it an excellent check to common Pokemon such as Hitmontop, Gastrodon, Rotom-W, and Breloom. Unlike several other powerhouses, such as Hydreigon and Latios, Shaymin-S's main STAB move, Seed Flare, eases prediction due to its high chance of a Special Defense drop. Shaymin can also eliminate common Pokemon with the ability Intimidate, such as Hitmontop, which can aid several physical attackers.</p> <p>Shaymin-S is not without its faults, however. Despite its typing giving it resistances to the common Water- and Fighting-type moves, it also plagues it with weaknesses to Rock-, Ice-, and Fire-type moves, three common attacking types in Doubles, and will most likely be OHKOed by these moves due to its subpar bulk. Furthermore, Shaymin-S struggles to OHKO anything that isn't weak to its moves without a flinch from Air Slash or a Special Defense drop from Seed Flare. Despite these setbacks, Shaymin-S will make an amazing addition to any Doubles team in need of check to Water- and Fighting-types; just make sure to work around its Ice- and Rock-type weaknesses.</p> ",
    "comments": "<h1>Other Options</h1> <p>Shaymin-S lacks many other options due to its mediocre movepool. Shaymin-S can use Healing Wish in conjunction with a Focus Sash to attack once or twice and heal a damaged teammate. However, Shaymin-S's average bulk means that it may not always pull off this tactic, despite its amazing Speed. Shaymin-S can use a Choice Scarf to a great effect, as this allows it to outspeed opposing Choice Scarf users such as Genesect as well as every Swift Swim Sweeper up to Timid Kingdra. Shaymin-S also has several support moves such as Safeguard, Worry Seed, and Leech Seed, but this is better left to Whimsicott, which can immediately use these moves due to Prankster. Finally, Shaymin-S can use Leaf Storm to have a higher chance to OHKO Tyranitar, but it is inferior to Seed Flare in nearly every other situation.</p> <h1>Checks and Counters</h1> <p>Despite Shaymin-S's high Speed and Special Attack, its limited coverage makes it relatively easy to counter. As previously mentioned, Thundurus is Shaymin-S's greatest counter, as it can take one Hidden Power Ice and either cripple it with Thunder Wave or deal a large amount of damage with its own Hidden Power Ice. Zapdos and Thundurus-T can do similar jobs, but both lack the ability to immediately cripple Shaymin-S with a Prankster Thunder Wave. Rotom-H also makes a solid counter to Shaymin-S, as it resists everything in Shaymin-S's arsenal and can OHKO it with a Fire Gem-boosted Overheat. Cresselia is able to take two Life Orb-boosted Seed Flares from Shaymin-S and either cripple it with Thunder Wave or deal an enormous amount of damage with Icy Wind. Cresselia dislikes the Special Defense drops from Seed Flare and flinches from Air Slash, however. Bulky Dragon-types such as Kyurem-B, Hydreigon, and Latios are able to take one super effective Hidden Power Ice, or in Kyurem-B's case, Air Slash, and OHKO with their respective STAB attacks. Bulky Fire-types such as Chandelure, Heatran, and Victini aren't fazed by anything Shaymin-S throws at them apart from a Life Orb-boosted Earth Power and can OHKO in return with their respective Fire STAB. Steel-types such as Bisharp, Metagross, and Jirachi, as well as bulky Flying-types such as Tornadus and Togekiss, can function as solid checks to Shaymin-S, taking a hit and retaliating with their powerful STAB moves. Bisharp and Tornadus even benefit from Seed Flare's Special Defense drop due to Defiant, while Metagross is unaffected by it due to Clear Body. If you happen to lack any defensive answers to Shaymin-S, then revenge killing it is always an option. Weavile and Mamoswine can both bypass Shaymin-S's amazing Speed with a 4x super effective Ice Shard, while Choice Scarf users such as Genesect, Kyurem-B, Kyurem, and Cloyster can revenge kill Shaymin-S with an Ice move, even if it is carrying a Yache Berry. Pokemon with the Swift Swim ability, such as Ludicolo and Kingdra, can also revenge kill Shaymin-S with their boosted Speed in the rain. In the sand, Excadrill is a solid check to Shaymin-S, as a Life Orb-boosted Iron Head will bring Shaymin-S down to its knees. The rare Crobat and Aerodactyl are naturally faster than Shaymin-S and destroy it with Acrobatics and Stone Edge, respectively. Finally, Trick Room teams can make Shaymin-S's Speed a liability, as it is outsped by nearly every Pokemon in Doubles under the twisted dimensions.</p> ",
    "sets": [
      {
        "name": "Offensive",
        "description": "<p>With this set, Shaymin-S is able to support its team by removing threats such as Gastrodon and Hitmontop. Air Slash functions as Shaymin-S's main STAB move thanks to its amazing coverage in Doubles as well as its 60% chance to flinch, which can give free turns to both Shaymin-S and its partner. Seed Flare is Shaymin-S's secondary STAB move, OHKOing all but the most specially defensive Gastrodon through its Rindo Berry and can help several of Shaymin-S's teammates achieve more OHKOs thanks to its 80% chance to lower the foe's Special Defense. Earth Power allows Shaymin-S to hit bulky Fire- and Steel-types such as Metagross and Heatran for decent damage. Hidden Power Ice is an equally effective option, as it can hit several of Shaymin-S's counters, such as Thundurus, Hydreigon, and Tornadus for a great amount of damage. Protect allows Shaymin-S to scout what its foe is doing, as well as protect it from spread moves.</p> <p>A Life Orb is the recommended item for this set to increase Shaymin-S's damage output as well as OHKO standard Hitmontop after one turn of sandstorm damage. However, a Focus Sash can be used to survive various attacks, given that Shaymin-S is quite frail. Shaymin-S can also use a Grass Gem to have a decent chance to OHKO Tyranitar, but this item is not useful in any other situation. Tailwind is a viable option on this set, as Shaymin-S has access to one of the fastest non-Prankster Tailwinds in the game. However, this is better left to dedicated Tailwind users, such as Togekiss and Tornadus.</p> <p>Thundurus is Shaymin-S's worst nightmare, as it resists both of Shaymin-S's main STAB moves and can either neuter Shaymin-S with Thunder Wave or deal a tremendous amount of damage with Hidden Power Ice, so packing a counter to it such as Choice Scarf Mamoswine is recommended. While not required, Thunder Wave support is extremely useful, as it increases the chance of the foe doing nothing when combined with Air Slash. Dark-types such as Tyranitar, Bisharp, and Hydreigon are very good partners, as they can all heavily damage Pokemon that give Shaymin-S trouble, such as Cresselia and Thundurus. Heatran and Kingdra are able to to defeat the Steel- and Fire-types that can easily wall Shaymin-S. Volcarona and Jirachi are also solid partners for this set, as the former can dismantle Latios, Latias, and Hydreigon with Bug Buzz as well as Steel-types and Thundurus with a Fire Gem-boosted Overheat, while the latter can redirect the threatening Ice- and Rock-type moves. Despite overlapping your team's Ice weakness, Ground-types such as Landorus-T, Garchomp, and Excadrill are excellent partners, as they can defeat the Fire- and Steel-types that give Shaymin-S trouble. In return, Shaymin-S can defeat the Water- and Fighting-types, such as Breloom and Gastrodon, that give those Pokemon trouble. Shaymin's typing also lets them use Earthquake with no repercussions.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Magcargo", "user_id": 177111}, {"username": "BLOOD TOTEM", "user_id": 191667}], "teams": [{"name": "Quality checked by", "members": [{"username": "tofucocoa", "user_id": 34584}, {"username": "Pocket", "user_id": 95}, {"username": "Nollan", "user_id": 161530}]}, {"name": "Grammar checked by", "members": [{"username": "Nix_Hex", "user_id": 40064}, {"username": "GatoDelFuego", "user_id": 91628}]}]}
  },
  "Excadrill": {
    "sets": [
      {
        "name": "Sand Rush",
        "description": "<ul> <li>Boasting a high Attack stat, access to a powerful STAB spread attack in Earthquake, and the ability to outrun the entire metagame in sand, Excadrill is one of the most fearsome Pokemon in the metagame. Additionally, Excadrill has an excellent typing that has an amazing matchup against some of the most common Pokemon, such as Thundurus, Tyranitar, and Metagross. Most notably, Excadrill hard-counters Thundurus, including a rare immunity to its Prankster Thunder Wave, which sets it apart from other fast attackers.</li> <li>Rock Slide is a secondary spread attack that can hit Ground-immune Pokemon, such as Thundurus, in addition to having decent odds of flinching opposing Pokemon. Substitute makes great use of Excadrill's typing, allowing it to set Substitute up easily against the likes of Thundurus. Substitute also blocks Intimidate, burns from Will-O-Wisp, and Amoonguss's Spore, which are common ways of slowing down Excadrill. Iron Head is a secondary STAB move that can be used to hit Ground-immune Pokemon, such as Latios or Landorus-T, harder. Finally, Swords Dance is a more aggressive option that makes use of Excadrill's excellent matchup into Thundurus, allowing Excadrill to snowball and take over the game.</li> <li>Life Orb is the preferred item, because it gives a consistent boost to all of Excadrill's attacks. Ground Gem is an option for a one-time power boost to Earthquake. The idea is that Rock Slide is typically only used on super-effective hits, so Excadrill can afford the drop in power. Leftovers is an option on those using Substitute, although this greatly weakens Excadrill's damage output.</li> <li>A Jolly nature can be used to ensure a Speed tie with opposing Excadrill but similarly will weaken Excadrill's damage output, notably missing the guaranteed OHKOs on Shuca Berry Heatran and Choice item Kyurem-B with Iron Head after sand damage.</li> <li>Unlike its other weather-reliant counterpart, Kingdra, Excadrill does not gain a power boost to its attacks; therefore, it mostly acts as a cleaner with its strong spread attacks once key threats, such as Landorus-T and Conkeldurr, have been removed or weakened.</li> <li>Tyranitar is a mandatory teammate to set sand. Because Tyranitar and Excadrill share common weaknesses, Pokemon that can cover Ground-, Fighting-, and Water-types make excellent teammates. Excadrill will use Earthquake most often so Ground-immune Pokemon are necessary. Finally, Intimidate can slow Excadrill down, so it will benefit from teammates that can threaten Landorus-T, Scrafty, and Hitmontop. Latios and Cresselia are two notable teammates, because they both threaten Landorus-T, the most common Intimidate user, Fighting-types such as Conkeldurr, and are immune to Ground-type attacks. Thundurus is another excellent teammate that can hit Water-types, such as Jellicent and Politoed, super effectively. Amoonguss can redirect super effective hits and generate free turns with Spore, allowing Excadrill to more easily set up.</li> </ul> "
      }
    ],
    "credits": {"writtenBy": [{"username": "DaAwesomeDude1", "user_id": 228280}], "teams": [{"name": "Quality checked by", "members": [{"username": "Smudge", "user_id": 550367}, {"username": "zee", "user_id": 501951}]}, {"name": "Grammar checked by", "members": [{"username": "ken", "user_id": 594478}]}]}
  },
  "Conkeldurr": {
    "sets": [
      {
        "name": "Physical Attacker",
        "description": "<ul> <li>Iron Fist with excellent Fighting- and Ice-type coverage makes Conkeldurr one of the best physical attackers in the tier, only being walled by Jellicent. In addition, its low Speed makes it an excellent Trick Room attacker, while its decent bulk and priority move can allow it to function well outside of Trick Room too, making it great at trading against faster, non-Trick Room attackers.</li> <li>Hammer Arm is a strong STAB attack, with the Speed drop drawback oftentimes being a positive for Conkeldurr, allowing it to underspeed Amoonguss under Trick Room. Drain Punch can be used over Hammer Arm for increased longevity in exchange for raw power.</li> <li>Mach Punch allows Conkeldurr to finish off weakened foes. Ice Punch can hit common Fighting-resistant foes, such as Landorus-T, Thundurus, and Amoonguss.</li> <li>Detect is preferred over Protect in the rare chance the foe is using Imprison.</li> <li>A Brave nature with 0 Speed IVs is recommended, if using Hammer Arm, so that Conkeldurr can underspeed Amoonguss after using Hammer Arm. If using Drain Punch, an Adamant nature with 31 Speed IVs can be used, which allows Conkeldurr to outrun faster paralyzed threats such as Choice Scarf Genesect and Choice Scarf Kyurem-B.</li> <li>This spread maximizes Conkeldurr's Attack while allowing it to live Expert Belt Cresselia Psychic.</li> <li>Life Orb is the preferred item because it gives a consistent boost to all of Conkeldurr's attacks, notably allowing it to OHKO bulky Thundurus with Ice Punch.</li> <li>Conkeldurr benefits greatly from any type of speed control, although it can be more effective under Trick Room due to its low Speed. It is worth noting that, depending on the chosen STAB move, Conkeldurr can have a different role on the team. With Hammer Arm, Conkeldurr acts as a dedicated Trick Room attacker. With Drain Punch, it can focus more on whittling down the opposing team, exchanging raw damage output for better damage trading and health recovery.</li> <li>Cresselia and Jellicent are two common Trick Room setters that benefit from Conkeldurr's ability to beat Dark-types, such as Tyranitar and Bisharp. Thundurus can provide speed control with its Prankster Thunder Wave while also threatening Jellicent. Tyranitar can threaten Psychic-types, such as Cresselia and Latios, and Jellicent.</li> <li>Thunder Punch is an option over Ice Punch to hit Jellicent; however, this would greatly reduce Conkeldurr's coverage, as it loses the ability to reliably damage Landorus-T and Amoonguss. Conkeldurr's low Speed in combination with common Fighting-resistant foes, such as Landorus-T, Thundurus, and Amoonguss, makes it easy to chip Conkeldurr if using Life Orb; therefore, Fighting Gem is an option to increase its longevity while maintaining a strong Fighting-type attack.</li> <li>Another option is a bulky set with a 252 HP / 4 Atk / 252 SpD EV spread, an Adamant nature, Drain Punch over Hammer Arm, and Sitrus Berry for the item. This set focuses on Conkeldurr's excellent coverage and passable bulk to force trades and can be more functional outside of Trick Room.</li> </ul> "
      }
    ],
    "credits": {"writtenBy": [{"username": "DaAwesomeDude1", "user_id": 228280}], "teams": [{"name": "Quality checked by", "members": [{"username": "Yoda2798", "user_id": 243662}, {"username": "Memoric", "user_id": 215000}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Scrafty": {
    "overview": "<p>Scrafty has a unique Dark / Fighting typing which allows it to dominate Tyranitar and Cresselia, two of the greatest tanks in Doubles. Intimidate is a great ability in Doubles that works very well with Scrafty's impressive bulk. Its immunity to Psychic-type moves also allows it to stand out from Hitmontop, the other Intimidate-using Fighting-type in the tier. Scrafty also stands out from Hitmontop with its ability to bite off large chunks of health from Chandelure, Cresselia, and Latios with STAB Crunch. Its access to Fake Out further bolsters its utility in Doubles. However, Scrafty suffers from having a poor Speed stat, which leaves it outsped by a lot of Pokemon. Hitmontop gives Scrafty competition as a Fighting-type with Intimidate and has access to other useful support moves such as Wide Guard, Feint, and Helping Hand. Scrafty also lacks massive firepower, having only base 90 Attack and relatively weak STAB moves. However, it is able to hit many prevalent threats in Doubles for super effective damage, and can provide a more prolonged Intimidate + Fake Out support than Hitmontop thanks to its superior bulk.</p> ",
    "comments": "<h1>Other Options</h1> <p>Hi Jump Kick is a usable move over Drain Punch for its great power, but as Protect is an extremely common move in Doubles, using it is very risky. If used, however, a Pokemon with Imprison and Protect should be used to disable said move. A Choice Band can be used to give Scrafty more power at the cost of not being able to effectively utilize Fake Out. Dragon Dance can be used to make Scrafty faster and stronger, and can work with Follow Me or Rage Powder support, and it outspeeds Tornadus after one boost. Outside of that, however, it's fairly risky to set up with. Bulk Up is also a usable option to boost Scrafty's power and bulk, and works quite well with Intimidate. Moxie is a decent ability that allows Scrafty to become pretty scary after a few KOs, and is good for Trick Room teams. Low Kick can be used to do more damage to heavier opponents, but misses out on the recovery and consistency Drain Punch provides. Taunt enables Scrafty to stop Trick Room users, but is very situational otherwise. Finally, ChestoRest can be used to fully heal Scrafty once.</p> <h1>Checks and Counters</h1> <p>Hitmontop is best answer to Scrafty available, taking little damage from Scrafty thanks to Intimidate, while hitting back hard with Close Combat. Landorus-T also has Intimidate, while Breloom, Hariyama, and Conkeldurr can hit Scrafty hard with their Fighting STAB. Toxicroak and Heracross resist both of Scrafty's STAB moves and hit it fairly hard in return, making them good checks. Tornadus has Flying STAB to nail Scrafty, as well as Defiant to benefit from Intimidate. Gyarados and Salamence can take on most of what Scrafty has to throw at them thanks to Intimidate, though Salamence must be wary of Ice Punch. Metagross and Togekiss have enough bulk to take whatever Scrafty has to offer and can hit back fairly hard. Sableye has Will-O-Wisp to burn Scrafty and weaken its damage output. Overall, the best way to handle Scrafty is by taking it on with something reasonably bulky.</p> ",
    "sets": [
      {
        "name": "Offensive Support",
        "description": "<p>This is Scrafty's best set in the Doubles metagame. Its typing and bulk allow it to take on common threats in Doubles, such as Cresselia, Latios, and Tyranitar. Scrafty's Fighting STAB also allows it to take on the most common answer to Intimidate users, Bisharp. Intimidate is a great ability, as being able to weaken opposing physical attackers is fairly valuable. Fake Out is the main move on this set, and allows Scrafty to stop one opponent from moving for the turn of its usage; the free damage is also noteworthy. Drain Punch serves as a decently powerful and reliable STAB move that also provides recovery. Crunch is secondary STAB move and provides great coverage with Drain Punch. Detect is a useful move in Doubles that can block a hit, and it's preferred over Protect as it bypasses Imprison. Ice Punch, however, allows Scrafty to land a strong blow on Garchomp, Landorus, and Thundurus.</p> <p>A Chople Berry is the preferred item here as it lets Scrafty avoid the OHKO from some Fighting-type moves, notably Hitmontop's Close Combat. A Sitrus Berry, however, can give Scrafty decent recovery outside of Drain Punch once. A Dark Gem can be useful to deliver a stronger Crunch for one turn. The utility that Chople Berry and Sitrus Berry provide, however, is much more useful. Leftovers is also a viable option, as Scrafty is quite durable and it also cancels out hail and sand damage. There are also a number of viable alternate EV spreads over the one listed. 252 HP / 72 Atk / 100 Def / 84 SpD with an Expert Belt is usable to survive Latios's Dragon Gem-boosted Draco Meteor and Hitmontop's Fighting Gem-boosted Close Combat (after Intimidate), and provides as much power as maximum Attack Scrafty against targets weak to its moves. 252 HP and 60 Special Defense EVs can also be used to live a Dragon Gem-boosted Draco Meteor from Modest Kyurem and Modest Latios. 4 Speed EVs allow Scrafty to outpace opposing Scrafty and use Fake Out against them.</p> <p>Dusclops and Cresselia are both great teammates for Scrafty, sporting good synergy while being able to set up Trick Room; they can also run Helping Hand to let Scrafty deliver stronger blows. Jellicent is also a viable teammate that synergizes well defensively with Scrafty. Abomasnow has good offensive synergy as it can handle Flying-types such as Tornadus well with its Ice STAB, while Scrafty provides Intimidate support to lessen blows from Scizor and handles Tyranitar, Heatran, and Chandelure. Other Pokemon such as Reuniclus can be useful as well, as Reuniclus can handle Fighting-types, and Scrafty can aid in its ability to set up Trick Room with Fake Out and also handles opposing Psychic-, Ghost-, and Dark-type Pokemon.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "ScraftyIsTheBest", "user_id": 157610}], "teams": [{"name": "Quality checked by", "members": [{"username": "Pocket", "user_id": 95}, {"username": "Laga", "user_id": 176920}, {"username": "Nollan", "user_id": 161530}]}, {"name": "Grammar checked by", "members": [{"username": "piikachuu", "user_id": 190864}, {"username": "Kingler", "user_id": 189059}]}]}
  },
  "Amoonguss": {
    "sets": [
      {
        "name": "Redirection Support",
        "description": "<ul> <li>Amoonguss's access to 100% accurate sleep in Spore, redirection in Rage Powder, excellent typing, and a low speed that allows it to function as a built-in Trick Room check makes it one of the premier support Pokemon in the metagame. Giga Drain is a weak STAB attack that does decent damage against Water-types.</li> <li>The given EV spread lives Metagross's Zen Headbutt while maximizing Special Defense so that Amoonguss can better tank common special moves, such as Life Orb Latios's Psychic or Kyurem-B's Ice Beam. A Sassy nature with 0 Speed IVs minimizes Amoonguss's Speed so that it can function better as a Trick Room check. Most notably, it underspeeds Conkeldurr in Trick Room. Sitrus Berry can increase Amoonguss's longevity by allowing it to survive being attacked by both foes or 2HKOs it would not otherwise, thus allowing it to continue disrupting with Spore or redirection. Lum Berry is mainly for opposing Amoonguss, as it cures Amoonguss from sleep, whereas Mental Herb is mainly for Thundurus, preventing Amoonguss from being shut down by Taunt for one turn.</li> <li>Amoonguss can be extremely flexible with its spread and item depending on the needs of the team. For example, teams can opt for a more physically defensive set if necessary.</li> <li>Amoonguss aims to disrupt the opponent by putting key threats to sleep or supporting teammates with redirection. With its typing, Amoonguss can act as a pivot by switching into attacks and putting a threat to sleep. Against rain or Trick Room teams, it is best to preserve Amoonguss's health as much as possible, as it matches up well against them.</li> <li>Amoonguss is extremely flexible, so it can fit on many team compositions. Jellicent is an excellent teammate, forming a defensive core that is generally capable of answering anything in the metagame. Landorus-T is another great teammate due to Intimidate weakening opposing physical attackers, its ability to threaten Thundurus, Heatran, and Metagross, and access to U-turn, which allows it to pivot safely into Amoonguss. Finally, Amoonguss synergizes well with Heatran, as it can redirect Fighting- and Water-type attacks as well as allows Heatran to set up Substitute easier.</li> </ul> "
      }
    ],
    "credits": {"writtenBy": [{"username": "DaAwesomeDude1", "user_id": 228280}], "teams": [{"name": "Quality checked by", "members": [{"username": "Yoda2798", "user_id": 243662}, {"username": "Smudge", "user_id": 550367}]}, {"name": "Grammar checked by", "members": [{"username": "ken", "user_id": 594478}]}]}
  },
  "Jellicent": {
    "sets": [
      {
        "name": "Defensive Tank",
        "description": "<ul> <li>Jellicent's excellent typing combined with its natural bulk, access to two solid status moves, and reliable recovery makes it the best defensive wincon in the metagame. On top of this, it is the most reliable Trick Room setter and is a built-in answer to rain teams with Water Absorb.</li> <li>Will-O-Wisp can cripple common physical attackers such as Choice Band Kyurem-B and Conkeldurr, while Toxic is mainly used to beat the likes of Cresselia, Gastrodon, and opposing Jellicent by putting them on a timer. Generally, Will-O-Wisp provides more immediate support and utility, while Toxic helps Jellicent to function more as a wincon.</li> <li>Sitrus Berry is the preferred item, because it gives immediate healing, allowing Jellicent to avoid 2HKO's that it otherwise could not.</li> <li>Water Absorb makes Jellicent an even better check to rain teams. Cursed Body can be used on teams with sufficient rain answers and has a chance at disabling moves that hit Jellicent hard, such as Thundurus's Thunderbolt or Landorus-T's Earthquake. This allows Jellicent to stall it out when it couldn't otherwise.</li> <li>This EV spread allows Jellicent to survive Tyranitar's Crunch while maximizing Special Defense so that it can better tank common special moves such as Dragon Gem Latios's Draco Meteor or Thundurus's Thunderbolt. Notably, this spread with Sitrus Berry gives Jellicent a 75% chance to be 3HKOed by bulky Thundurus's Thunderbolt.</li> <li>Since Jellicent is a defensive wincon, it can oftentimes win games by itself once its threats are removed. That said, Jellicent's excellent typing can allow it to switch in easily against common metagame threats. Additionally, access to recovery allows Jellicent to stay healthy and be used throughout the game, so it may be used early to spread status.</li> <li>Although Jellicent can fit easily on many teams, it appreciates teammates that can threaten Tyranitar, Thundurus, Grass-types, and Dragon-types. Landorus-T is an excellent teammate due to Intimidate support and its ability to threaten Tyranitar and Thundurus. Metagross and Genesect are able to threaten Tyranitar while also matching well into Grass-types and the two most common Dragon-types, Latios and Kyurem-B. Pokemon that can benefit from Trick Room also pair well with Jellicent. Conkeldurr is a notable one, as it can threaten Tyranitar, Kyurem-B, and Thundurus. Heatran, which can benefit from Trick Room, appreciates Jellicent's ability to threaten Landorus-T, Conkeldurr, opposing Heatran, and rain while it, in return, can check Amoonguss. Finally, Amoonguss has excellent synergy with Jellicent, forming a strong defensive core. For example, Jellicent can switch into Heatran, Cresselia, and Ice-type attacks that threaten Amoonguss, while Amoonguss covers Jellicent by switching into opposing Toxic and resists Electric-type attacks.</li> <li>Leftovers can be used for more passive healing. Mental Herb is an option for more dedicated Trick Room teams to avoid Taunt and guarantee a Trick Room.</li> </ul> "
      }
    ],
    "credits": {"writtenBy": [{"username": "DaAwesomeDude1", "user_id": 228280}], "teams": [{"name": "Quality checked by", "members": [{"username": "Yoda2798", "user_id": 243662}, {"username": "zee", "user_id": 501951}]}, {"name": "Grammar checked by", "members": [{"username": "ken", "user_id": 594478}]}]}
  },
  "Bisharp": {
    "overview": "<p>Blessed with one of the best abilities for a physical attacker in the Doubles metagame, Bisharp is a force to be reckoned with. Defiant and Steel typing allow Bisharp to not only brush off Intimidate and Icy Wind but also grab an Attack boost from them instead. It also has access to and STAB on Sucker Punch, allowing it to take advantage of its ability against fast teams. Bisharp also does extremely well in and against Trick Room, as priority moves first both in and out of Trick Room. Rounding off the list of merits, Bisharp's typing allows it to keep common Psychic- and Dragon-types, such as Cresselia and Latios, in check.</p> <p>That said, Bisharp is unfortunately weak to common spread moves; Heat Wave and Earthquake hit it super effectively, and it does not exactly enjoy taking rain-boosted Surfs either. In addition to this, it also has a crippling weakness to Fighting-type moves, and being that Fighting-types resist Sucker Punch, it has a very hard time dealing with said Pokemon. In addition to these demerits, Bisharp is also very one-dimensional and is therefore predictable. Even with all these weaknesses, Bisharp is an amazing addition to teams that otherwise have problems with Intimidate and Icy Wind as its presence alone forces your opponent to think twice before using them.</p> ",
    "comments": "<h1>Other Options</h1> <p>Bisharp has a ton of other options to try out, but many of them are very situational. Notable items to use include Life Orb, Lum Berry, Focus Sash, and Choice Band. Life Orb provides a more consistent boost, but Bisharp's bulk is ruined by the residual damage. Lum Berry allows Bisharp to avoid burn and paralysis once, but the power boost from Dark Gem is preferred. Focus Sash is great for taking threatening Fighting-type attacks, and it allows Bisharp to invest fully into Speed, but with no boost in power, Bisharp misses a lot of KOs if not boosted by Defiant. Focus Sash also helps Bisharp set up Swords Dance if you want to use that. Choice Band is definitely an item best suited for Trick Room, as outside of it, Bisharp will be open to many more Fighting-type attacks and therefore likes the ability to use Protect effectively much more.</p> <p>With a fantastic movepool at its disposal, Bisharp naturally has many other moves to try out as well. Thunder Wave is an option if your team is focused on spreading paralysis, and Magnet Rise can be used to dodge obvious Earthquakes, but Bisharp is best suited for an offensive role, and the two moves limit its coverage. Bisharp finds the best coverage alongside its STABs in Fighting-types moves, a few of which it learns besides Low Kick. Low Sweep can be used for speed control, but Low Kick hits the majority of targets for much more damage. Brick Break is the second coverage option and is a good choice for teams that have trouble with dual screens. Pursuit is another STAB option, especially useful for fleeing Psychic-types, such as Latios. Finally, Stone Edge is an option for hitting Flying-types, such as Tornadus and Zapdos, for more damage.</p> <h1>Checks and Counters</h1> <p>The best way to keep Bisharp in check is to play around it carefully; refrain from use Icy Wind and switching in an Intimidate Pokemon while Bisharp is on the field. Once you begin to play around Bisharp like this, it is not very hard to counter. The presence of faster Fighting-types, such as Terrakion, Heracross, and Breloom, put Bisharp in a living hell, as they can shrug off Sucker Punch and OHKO with their STAB moves. Most Steel-types can wall Bisharp, especially if it doesn't carry Low Kick. Notable examples include Scizor, Heatran, Escavalier, and Excadrill. Fast Dark-types with coverage moves, such as Choice Scarf Tyranitar and Hydreigon with Low Kick and Fire Blast, respectively, can put a stop to Bisharp as well, as said Pokemon can shrug off a Sucker Punch and OHKO back. Bar Jellicent, bulky Water-types, such as Politoed and Gastrodon are shaky checks, as they can easily take unboosted hits, but some miss the OHKO on Bisharp. Finally, there is Sableye which can easily play around Bisharp's Sucker Punch, and use priority Will-O-Wisp to limit its attacking capabilities.</p> <p>In addition to typing, there are also a couple of moves that counter Bisharp's main move, Sucker Punch. Substitute dodges Sucker Punch and allows its user to pose as a threat at the same time; this move is especially effective if the Substitute user is resistant to Bisharp's coverage moves. Will-O-Wisp also avoids Sucker Punch, but instead of making its user more threatening, the move makes Bisharp less threatening. Finally, Follow Me and Rage Powder are also moves that completely shut down Sucker Punch, as both redirect it and dodge it at the same time.</p> ",
    "sets": [
      {
        "name": "Defiant",
        "description": "<p>This set aims to to prevent opponents from freely spamming Intimidate and Icy Wind, becoming a huge threat if they make a mistake. Its combination of the ability Defiant and access to STAB Sucker Punch allows it to fill this role consistently and effectively. Sucker Punch is the main move of this set and should be, with the possible exception of Protect, the move you are using the most. In the second spot, Iron Head is the preferred option, as it is much more consistently powerful than Low Kick due to STAB, but if you want to use Night Slash in the third slot, Low Kick provides better coverage. In the third spot, Low Kick hits problematic Steel-types that Sucker Punch and Iron Head cannot, but Night Slash is great for preventing Trick Room from being set, as it hits the majority of setters super effectively. In the final slot, Protect is obligatory; it is a massive staple on offensive Pokemon in Doubles, especially those weak to common types such as Fighting, Ground, and Fire.</p> <p>Considering that Bisharp will be using Sucker Punch and Protect most of the time, Attack and HP investment is usually preferred over Speed investment, as both of these moves have priority. With 252 HP EVs, Bisharp is surprisingly bulky and can even take super effective hits such as Jolly Landorus-T's Earthquake and Modest Zapdos's Heat Wave. One could opt to run an alternative spread of 120 HP / 252 Atk / 136 Spe alongside Steel Gem, as this enables Bisharp to outspeed standard Hitmontop and OHKO with +1 Steel Gem-boosted Iron Head, but the spread is situational. If using Bisharp on a Trick Room team, you should use a Brave nature with 0 Speed IVs, as this makes the most out of Trick Room. When it comes to picking an item, Dark Gem is usually preferred, gaining important OHKOs on Pokemon such as Tornadus and Reuniclus, but Steel Gem is very useful to get that OHKO on Hitmontop. Swords Dance is also a possibility, as Bisharp forces the opponent to play carefully, which helps it find opportunities to set up.</p> <p>When it comes to teammates, Bisharp enjoys the presence of Pokemon that can deal with Steel-types. Fire-types can roast said Steel-types; Volcarona is a notable partner, as it can also redirect Fighting-type attacks with Rage Powder. Fighting-types such as Terrakion and Hitmontop can also punch holes in Steel-types, allowing Bisharp to have an easier time breaking through the opposition. Any Pokemon susceptible to Intimidate or Icy Wind loves having Bisharp by its side, as the opponent will have to think twice about spamming said tactics. Notable Pokemon that appreciate this support are Terrakion, Landorus-T, and Tyranitar. Pokemon that carry Taunt such as Thundurus and Gyarados also support Bisharp well; Taunt support makes Sucker Punch much more reliable, as it will only fail if a Taunted Pokemon switches out or uses a faster priority move.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Laga", "user_id": 176920}], "teams": [{"name": "Quality checked by", "members": [{"username": "Nollan", "user_id": 161530}, {"username": "Pocket", "user_id": 95}, {"username": "Nix_Hex", "user_id": 40064}]}, {"name": "Grammar checked by", "members": [{"username": "melvni", "user_id": 64080}, {"username": "Nix_Hex", "user_id": 40064}]}]}
  },
  "Hydreigon": {
    "overview": "<p>With a monstrous base 125 Special Attack, as well as an amazing offensive typing to go along with it, Hydreigon is a force to be reckoned with in Doubles. While Hydreigon might appear to be outclassed by other special attacking Dragon-types such as Latios and Salamence, it has several perks to differentiate itself. Hydreigon has an excellent movepool with moves such as Fire Blast, Earth Power, and Dark Pulse, and it lacks a weakness to both Rock Slide and Sucker Punch, which plague the other two Dragon-types. What truly differentiates Hydreigon from its brethren is its Dark typing, allowing it to check common Pokemon such as Cresselia and Chandelure. Hydreigon is not without its flaws, however. While its typing does give it useful resistances, it also gives it crippling weaknesses to the common Fighting-, Ice-, and Dragon-type moves. Hydreigon also faces a large amount of competition from other special attacking Dragon-types, as its awkward base 98 Speed leaves it outsped by Salamence and Latios, as well as Genesect. Despite these setbacks, Hydreigon's versatility and power make it a great Pokemon overall.</p> ",
    "comments": "<h1>Other Options</h1> <p>Hydreigon has plenty of other options to choose from thanks to its amazing movepool. Taunt is a very useful move that Hydreigon has access to, allowing it to shut down defensive Pokemon such as Amoonguss and Cresselia. A Dark Gem can also be used to boost the power of Dark Pulse, but Hydreigon's Dark STAB not only has worse coverage than its Dragon STAB, but it also has less Base Power. Surf is an option if Hydreigon is being used on a rain team, but other Dragon-types, such as Kingdra and Latios, make better users of the move. A Choice Scarf or Choice Specs can be used to increase Hydreigon's power or Speed, respectively, but these items ruin Hydreigon's main draw over other Dragon-types: its amazing coverage. U-Turn can be used in conjunction with Tailwind to bring in a more suitable Tailwind sweeper. Thunder Wave is another option Hydreigon can use, as it cripples many faster threats, such as Shaymin-S and Thundurus. Finally, Hydreigon can use Psych Up to copy the opponent's stat changes, which would remove the stat drops from Draco Meteor and Icy Wind.</p> <h1>Checks and Counters</h1> <p>Hydreigon's incredible coverage and power make it very difficult to counter. Chansey and Blissey can take whatever Hydreigon throws at it and can slowly wear it down with Seismic Toss. Occa Berry Metagross paired with Tyranitar is a very good check, as the Occa Berry allows it to take one Fire Blast, and the combination of Meteor Mash and Bullet Punch will KO Hydreigon after two turns of sandstorm damage. Apart from Earth Power and Focus Blast, Heatran can take whatever Hydreigon throws at it and can 2HKO Hydreigon with Dragon Pulse. Jirachi can paralyze Hydreigon and wear it down with multiple Iron Heads, but it must watch out for Fire Blast. Apart from Focus Blast, Tyranitar isn't fazed by any of Hydreigon's attacks can and 2HKO it with Low Kick.</p> <p>While Hydreigon is very difficult to counter, its common weaknesses make it rather easy to check. Breloom, Conkeldurr, and Mamoswine can all revenge kill Hydreigon with a super effective priority move, while Pokemon such as Latios, Terrakion, Genesect, Volcarona, and Salamence can all outspeed and OHKO Hydreigon with a super effective STAB move. Choice Scarf Kyurem-B, Cloyster, and Abomasnow can also revenge kill Hydreigon. However, many of the aforementioned Pokemon become risky checks if Hydreigon has a Tailwind boost.</p> ",
    "sets": [
      {
        "name": "Special Attacker",
        "description": "<p>Thanks to Hydreigon's amazing offensive typing and Special Attack, it can function as an amazing special attacker. Draco Meteor is Hydreigon's main STAB; with a Dragon Gem boost, it deals a significant amount of damage to anything that doesn't resist it. However, Dragon Pulse is an option if you prefer consistency, but its lower Base Power makes it an inferior option overall. Dark Pulse is Hydreigon's secondary STAB move and deals a large amount of damage to common Trick Room users such as Reuniclus, Cresselia, and Musharna. Fire Blast gets amazing coverage with Hydreigon's Dragon STAB, hitting Steel-types such as Jirachi and Metagross for a great amount of damage. Earth Power can be used over Fire Blast to hit Heatran and Tyranitar for super effective damage while still hitting Steel-types hard. If none of these coverage moves interest you, then Tailwind can be used to increase Hydreigon's Speed to amazing levels and allow it to outspeed and OHKO faster threats such as Latios, Salamence, and Garchomp. Protect is the best option in the last slot, as it allows Hydreigon to avoid damage from the foe's attacks.</p> <p>If you are using Tailwind, then an EV spread of 80 HP / 176 Spe / 252 SpA with a Modest nature is recommended to outpace Adamant Excadrill in the sand. A Modest nature is the preferred nature if you are using a Dragon Gem, as many bulky walls that have EVs to survive Timid Latios's Dragon Gem-boosted Draco Meteor will be overwhelmed by Modest Hydreigon's Dragon Gem-boosted Draco Meteor. While the Dragon Gem does allow Hydreigon to break through bulky special walls, the Life Orb is the preferred item to boost the power of Hydreigon's coverage moves, giving it the power to 2HKO Cresselia with Dark Pulse and OHKO Metagross with Fire Blast. A Chople Berry can be used to survive relatively powerful Fighting-type attacks such as Terrakion's Close Combat, but the extra power from the Life Orb or Dragon Gem is usually more useful. Flamethrower or Heat Wave can be used for a more accurate alternate to Fire Blast, with the latter hitting both Pokemon on the foe's side of the field. However, the extra power that Fire Blast provides is much more useful. Focus Blast can be used to OHKO Tyranitar and Bisharp while still hitting Steel-types super effectually, but its low accuracy is a major drawback. Pokemon that can cover up Hydreigon's weaknesses are great partners. Jirachi is an amazing partner, as it can redirect the powerful Dragon- and Ice-type moves aimed at Hydreigon with Follow Me while also providing Thunder Wave support to mitigate Hydreigon's average Speed. Excadrill is a great offensive partner, as it can destroy nearly every relevant Steel-type with Earthquake, allowing Hydreigon to use Draco Meteor without risk late-game.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Magcargo", "user_id": 177111}], "teams": [{"name": "Quality checked by", "members": [{"username": "Level 51", "user_id": 118474}, {"username": "Laga", "user_id": 176920}, {"username": "Pocket", "user_id": 95}]}, {"name": "Grammar checked by", "members": [{"username": "GatoDelFuego", "user_id": 91628}, {"username": "Governess", "user_id": 168470}]}]}
  },
  "Terrakion": {
    "overview": "<p>Terrakion is a very straightforward Pokemon in both concept and practice. While other Fighting-types might use supportive moves such as Fake Out or rely on other Pokemon to set up field conditions, Terrakion gets straight to the point, outspeeding the majority of the unboosted metagame and often KOing or dealing massive damage with its incredibly useful STAB moves. This straightforward approach is also one of Terrakion's weaknesses, however. The Doubles metagame is riddled with Intimidate users, Cresselia (which basically walls and 2HKOes it), and weather users capable of outspeeding Terrakion, and it can't do much back without getting KOed. However, Terrakion is still a high-priority target that threatens many teams, and with a little speed control, Terrakion can easily dominate games.</p> ",
    "comments": "<h1>Other Options</h1> <p>Terrakion doesn't have the largest movepool, but it still has some interesting options that could easily fit on the physical attacking set. Quick Attack is rather odd, but it allows Terrakion to pick off weakened opponents such as bulky Thundurus or 252 HP Kyurem-Black that might survive Terrakion's onslaughts and also picks at the opponent before an expected demise at the hands of a priority move or a faster Pokemon. Helping Hand could be used in a similar vein; its best use would probably be powering up a Psychic-type enough to OHKO a threatening Fighting-type or making Draco Meteor even more difficult to wall. On the subject of supportive moves, Safeguard can easily shut down Pokemon that are keen on spreading status, but it isn't useful against Breloom and Amoonguss, and it requires a turn of setup against Thundurus and Sableye due to Prankster. Additionally, Safeguard paired with a Lum Berry can be combined with Swagger to boost Terrakion's Attack to sky-high levels or simply negate an Attack drop from Intimidate.</p> <p>Swords Dance and Rock Polish are two other moves that can raise Terrakion's stats, but Rock Polish can be redundant if you run any sort of speed control. Swords Dance is a very interesting filler move that can be used on predicted double Protects to great effect, but it requires a great deal of prediction to pull off. Besides the aforementioned Lum Berry, there aren't many other items Terrakion could take advantage of aside from a Choice Band and Chesto Berry. Choice Band's usefulness should be obvious, but an appropriate Gem is usually enough to score KOs. Chesto Berry probably isn't as obvious, but it can prove useful to cure Terrakion of paralysis and burns when paired with Rest prevention is probably the best medicine in this case, though. Finally, Sacred Sword negates stat changes and doesn't cause any of your own, but it's rather weak and probably better suited to VGC environments where evasion moves are not banned.</p> <h1>Checks and Counters</h1> <p>Landorus-T and Cresselia are Terrakion's biggest roadblocks. Both can soften its attacks and 2HKO or OHKO Terrakion with their STAB moves while Terrakion can't do much to stop them. In fact, Intimidate in general can handily check Terrakion, but some Intimidate users won't like taking Stone Edges. Common priority users such as Conkeldurr, Breloom, and Scizor can also easily check Terrakion, provided it doesn't hide behind Quick Guard. Amoonguss takes a pittance from Terrakion's STAB moves and redirects them with Rage Powder, can put Terrakion to sleep, and can take chunks out of it's health with Giga Drain. Prankster users, such as Sableye and Thundurus, can also cripple it with priority moves, though again, Thundurus won't like taking a STAB Rock-type move. Faster Pokemon with super effective moves also make quick work of Terrakion, the most notable examples being Latios, Deoxys-A, Shaymin-S, Kingdra, and Excadrill, with the latter two being able to outspeed even the Choice Scarf set in their appropriate weather.</p> <p>Trick Room, as well as speed control in general, is a major threat to Terrakion, as basically everything it previously outsped can now outspeed Terrakion and KO it, depending on how many times its defenses have dropped due to Close Combat. Jellicent, Slowking, and Gallade are Trick Room setters that can take advantage of their own Trick Room, with the former two having spread moves that hit Terrakion super effectively and the latter having access to Feint to ensure a KO. Cresselia can simply utilize Icy Wind and throw a Psyshock Terrakion's way to KO it. It also sets up Trick Room with ease, which often results in a quick demise for Terrakion.</p> ",
    "sets": [
      {
        "name": "Sub + 2 Attacks",
        "description": "<p>The general idea of this set is to use Substitute to insulate Terrakion from its checks and to block status and Intimidate. Substitute also helps Terrakion circumvent Close Combat's defense drops, which is always appreciated. Terrakion's STAB moves comprise the set's coverage, which is almost unresisted. A Fighting Gem-boosted Close Combat is Terrakion's weapon of choice, providing it with a power boost equal to that of a Choice Band, allowing Terrakion to OHKO threats such as Kyurem-B, Hitmontop (without Intimidate), Kingdra, and other similarly bulky Pokemon. Rock Gem is also an option, as it guarantees an OHKO on 252 HP Thundurus with Rock Slide as well as having a very good chance of OHKOing Latios with Stone Edge. Protect is in the last slot as a staple Doubles move, and it is especially useful against opponents that try to double target Terrakion's Substitute in hopes of reaching the chewy center.</p> <p>Gems are the main items you should consider for this set, as items such as Life Orb and Focus Sash would prove redundant or harmful with Substitute. Expert Belt is another item you could try if you dislike Gems, as it provides Terrakion with nice boosts against its common targets, but it's probably not going to score any impressive OHKOs, especially with Rock Slide. The 4 EVs in Defense instead of HP make Terrakion's HP odd, which allows it to make four Substitutes, provided it doesn't take any damage.</p> <p>Substitute Terrakion relies a bit more on Follow Me and Fake Out support than speed control. Mew, Jirachi, and Amoonguss, as usual, provide just that, as well as offensive support in taking care of Terrakion's checks with their coverage and resistances. Sableye provides Fake Out support as well as an incredibly useful priority Will-O-Wisp to threaten physical Fighting-types and Feint to ensure a knockout on Protecting Tyranitar and other such Pokemon. Cresselia, specifically offensive Cresselia, can provide Terrakion with important speed control and chip damage, as well as help Terrakion with Fighting-types and Landorus-T. A surprise Hidden Power Fire from Cresselia also goes a long way in dealing with the ever-threatening Scizor, but you have to be careful with using this method until you're sure Scizor isn't holding an Occa Berry.</p> "
      },
      {
        "name": "Physical Attacker",
        "description": "<p>This is about as straightforward as Terrakion can get without losing the ability to change its moves. Close Combat is a staple on any Terrakion, as it OHKOes key Pokemon such as Kyurem and Chople Berry Tyranitar, even without Life Orb. Focus Sash is used, as it allows Terrakion to take a hit without having to worry about how many times it can use Close Combat before it's OHKOed by a slight breeze. Life Orb, in a sense, does the exact opposite, powering up Close Combat enough to turn some 2HKOs into OHKOs while sapping Terrakion of any semblance of bulk. Rock Slide is, by comparison, weaker but deals healthy spread damage to anything weak to or neutral against it, resulting in more gross damage. Stone Edge doesn't have the nice spread coverage or accuracy, but it can OHKO bulky Thundurus and isn't bothered by Wide Guard, allowing Terrakion to check Volcarona more easily.</p> <p>The third slot is mainly filler. X-Scissor does nice damage to Cresselia and other Psychic-types, 2HKOing said Cresselia with only one turn of Helping Hand support (the first attack brings it just below Sitrus range and the second attack KOes) or a few turns of Sandstorm damage, while Cresselia can only 2HKO in return. Quick Guard not only protects Terrakion from Bullet Punch and Mach Punch, but it also stops slower Pokemon such as Hitmontop and Liepard from using Fake Out on Terrakion or its partner. An important detail to note about Quick Guard is that it does not protect against Prankster-induced priority, such as Thundurus's Thunder Wave. Taunt is rather useful to stop Trick Room, but you have to be careful about Taunting some supporters such as Cresselia and Thundurus, as they can both easily cripple or 2HKO Terrakion regardless of Taunt. Protect is a staple on this set to buy time for Speed changes to take effect or to nab another turn for Terrakion's partner to take out whatever is threatening Terrakion at the moment.</p> <p>Terrakion doesn't ask for much support outside of the already essential speed control. Cresselia and Mew provide offensive support, tackling tough cats such as Hitmontop, Scizor, and Landorus-T, as well as potentially possessing the incredibly useful Helping Hand. While Hitmontop and Terrakion share the same typing, it can still support Terrakion with Wide Guard and Helping Hand, which can sometimes be all Terrakion needs to tango with rain and sand teams. Swampert also has Wide Guard, but its main attraction is the fact that it can use Ice Beam or Ice Punch to OHKO Landorus-T or leave it vulnerable to a Rock Slide. As a bonus, Swampert can offer Icy Wind support and generally deal damage with its decent base Attack and good STAB coverage.</p> "
      },
      {
        "name": "Choice Scarf",
        "description": "<p>A charging bull makes for a frightening opponent. By extension, a bull charging at speeds you wouldn't expect it to makes for a very frightening opponent. To many, this is exactly what a Choice Scarf Terrakion is, with its STAB moves capable of OHKOing its checks that rely on being faster, and the fact that it can run Adamant without worrying about Speed only bolsters its destructive power. However, like the bull that only runs in a straight line, Terrakion can become rather clunky when it's locked into the wrong move, so as always, it's wise to utilize prediction. Earthquake and X-Scissor are mostly filler when compared to the usefulness of Terrakion's STAB moves, but they still offer their perks. X-Scissor hits Cresselia, Latios, and Tyranitar for super effective damage, which is very useful to ease prediction in some cases, while Earthquake is a relatively safe option to hit Heatran super effectively and Fighting-types neutrally.</p> <p>If you're feeling adventurous, you could use both Rock Slide and Stone Edge at the same time at the expense of Earthquake. Both moves can have different applications at times, with Rock Slide being a safe early-game option while Stone Edge is more suited to mid- or late-game where you might need more immediate power. To further compare the two, Rock Slide has the Base Power of 55 to one Pokemon, but it can deal damage to two Pokemon at once and has a good chance to flinch, while Stone Edge's Base Power is a whopping 100, but it only hit one Pokemon and has worse accuracy. The EVs ensure that Terrakion outspeeds max Speed Deoxys-A and can survive attacks such as Adamant Life Orb Breloom's Mach Punch and Landorus-T's Earthquake, while the remaining EVs are dumped into Attack for more power.</p> <p>Terrakion doesn't need much support in general outside of more offensive Follow Me, chip damage and, of course, Helping Hand to guarantee OHKOs. Volcarona can easily dispatch Breloom with Heat Wave, redirect Fake Out, can burn the offender with Flame Body, and can go the hyper offensive route with Terrakion that can easily bulldoze through unprepared teams. Liepard isn't all that powerful or bulky, but it possesses Fake Out as well as a Prankster-boosted Encore to lock Pokemon into undesirable moves such as Trick Room or Protect; in addition, it has rather interesting options in Swagger and Taunt to prevent setup and possibly create free turns for Terrakion. Liepard can also run Sucker Punch to utilize Justified and pick off Pokemon weakened by Terrakion, but you have to be careful about damaging your own Terrakion to the point where it can no longer take advantage of its defensive EVs. Cresselia's offensive set once again comes into play, but defensive sets with Helping Hand might be more suited to helping Terrakion run wild. Sunny Day Cresselia also does a nice job of supporting Terrakion, as it basically neuters rain long enough enough for Terrakion to maim many Pokemon commonly found on rain teams such as Kingdra and Thundurus-T. Outside of this, Terrakion appreciates speed control to manage the opponent's speed control that's working against it.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "tofucocoa", "user_id": 34584}], "teams": [{"name": "Quality checked by", "members": [{"username": "Audiosurfer", "user_id": 136301}, {"username": "Mizuhime", "user_id": 51961}]}, {"name": "Grammar checked by", "members": [{"username": "Ender", "user_id": 192999}, {"username": "Governess", "user_id": 168470}]}]}
  },
  "Tornadus": {
    "overview": "<p>Tornadus is often overlooked in the Doubles metagame, even though it is one of the best physical attackers in the tier, courtesy of Defiant. Its other ability, Prankster, is also effective, allowing it to use support options such as Tailwind with priority. This is further backed by the fact it is one of only a few Flying-types with access to Flying-type STAB outside of Hidden Power in Acrobatics, which along with Defiant, allows it to rip through common Fighting-types such as Hitmontop. Additionally, Tornadus has good offensive stats, and its base 111 Speed allows it to outspeed and OHKO Latios, the fastest Dragon-type in the Doubles metagame.</p> <p>While its strengths may make it seem like a true terror to face on the battlefield, it has weaknesses to three common attacking types, Electric, Ice, and Rock, and it is further crippled by mediocre 79/70/80 defenses. This leaves Tornadus completely open to common spread moves, such as Blizzard and Rock Slide, and common threats such as Thundurus. Fortunately, the raw power of Acrobatics and the pressure Defiant can apply to the opponent more than makes up for whatever flaws Tornadus may have.</p> ",
    "comments": "<h1>Other Options</h1> <p>Tornadus has a variety of options. Icy Wind can be used to slow the opposition down. Unfortunately, Tailwind provides more Speed control, and there is little need for both in most cases. Air Slash, Heat Wave, and Grass Knot are all viable special attacking options, though in general, Tornadus's role is one of a physical attacker. Foul Play could see use on a bulkier set, dealing heavy damage to opposing attackers, but a bulky support set is outclassed by Thundurus in most cases. Role Play and Swagger are two great options for the Prankster set; Role Play can copy Drizzle, Sand Stream, or another ability off of a partner, resetting weather and helping your team in a weather war, but it can only be used once before Tornadus has to switch out. Swagger is a great move choice because it can give the opposition a lot of trouble from confusion, but it is basically a 50/50 coin flip, and is often as risky as it is rewarding. Still, it can be used on a partner with a Lum Berry or Persim Berry, essentially giving them a free +2 Attack boost before their assault. Yache Berry, Wacan Berry, and Charti Berry can be used to offset its weaknesses, but Tornadus prefers holding a Flying Gem for Acrobatics.</p> <p>An entirely different set involving Prankster Rain Dance and Hurricane can be used. This is probably one of the best special sets Tornadus can run; utilizing a moveset of Hurricane / Focus Blast / Rain Dance / Tailwind, with an EV spread of 4 HP / 252 SpA / 252 Spe and a Timid Nature. Flying Gem and Damp Rock are both decent item choices for this set. Unfortunately, Thundurus outclasses this set too, and in general, Tornadus is best used as a physical attacker, since that is a role Thundurus, its life-long rival, cannot fill.</p> <h1>Checks and Counters</h1> <p>The easiest way to beat Tornadus is by using an Electric-type. Bulky Thundurus is probably the best, as it can nail Tornadus with a Prankster Thunder Wave (assuming Tornadus is running a Defiant set) and finish it off with a Thunderbolt. Rotom-W and Zapdos are also great choices to put a stop to Tornadus's shenanigans, as they can both OHKO it with a Thunderbolt. Ice-types such as Kyurem and Kyurem-Black are also great choices to put a stop to Tornadus. Faster Ice-types, such as Weavile, Choice Scarf Cloyster, and Choice Scarf Abomasnow, can take out Tornadus before it can hit back; Mamoswine and Abomasnow can also deal heavy damage through Ice Shard, though Abomasnow will need to watch out for Acrobatics. Cloyster and Mamoswine additionally get special mentions, as Icicle Spear will tear through a Prankster Tornadus's Substitute.</p> <p>Rock-types that can tank a Superpower will also work out nicely if they get a safe switch in; Chople Tyranitar is an example of this. Like Ice-types, speedy Rock-types, such as Scarf Tyranitar and Aerodactyl, can take Tornadus down before it can attack. Terrakion can also be a large issue, especially if it is holding a Choice Scarf, though it will need some investment to tank a Flying Gem Acrobatics or Superpower. A less efficient way to beat Tornadus is Intimidate, which can weaken Prankster sets; however, you have to be sure that Tornadus is using Prankster, as Defiant sets will gain a boost from Intimidate and put you in a very bad situation. Additionally, Steel-types that can tank Superpower, such as Metagross and Jirachi, will also put a stop to Tornadus, as they can tank its attacks and hit hard in return.</p> ",
    "sets": [
      {
        "name": "Defiant Attacker",
        "description": "<p>This is Tornadus's defining set. Defiant allows it to laugh at Intimidate, which will only give its attacks more power. It can also gain power from Icy Wind, though the loss of Speed still hurts it. A Flying Gem-boosted Acrobatics is incredibly powerful; anything that doesn't resist it is going to take a lot of damage, and frail resists such as Thundurus will still take heavy damage as well. Superpower rounds out Tornadus's coverage, nailing Rock-types such as Tyranitar, who resist Acrobatics, very hard. The choice of moves in third slot is a difficult one. Taunt is generally the most common choice, stopping Trick Room, Tailwind, and more unfriendly status. Tailwind is also an option, allowing your team to move faster than the opposition, which can be very useful. U-turn stands out as an offensive option if your doesn't need any support, and also lets Tornadus switch out while doing some damage. Protect is in the fourth slot, as it allows Tornadus to guard itself against opposing attacks while its partner on the field handles things.</p> <p>The spread is simple, with maximum Speed and Attack investment. For moves, Tornadus doesn't really have many other options. The third slot can be filled by Substitute, but this counteracts the effects of Defiant, and Tornadus has better options. Bulk Up can be used to boost Tornadus's power to higher levels and increase its Defense so that it doesn't have to worry as much about priority, but it is pretty situational, even with Rage Powder support, because Tornadus is weak to spread attacks such as Rock Slide and Blizzard.</p> <p>This set pairs well with Steel-types, as they can switch in to dangerous Ice- and Rock-type attacks, emerge without a scratch, and blow the opposition to the ground with STAB moves. Metagross and Scizor are particularly useful, nailing threats to Tornadus, Tyranitar in particular, with Bullet Punch. Jirachi gets a mention, as it can use Follow Me to redirect Electric-type attacks; it also resists common spread moves that trouble Tornadus, such as Blizzard and Rock Slide. Heatran is another good choice, especially against Ice-types, though it rarely runs a Steel-type STAB move. Lightningrod is an ability Tornadus can work well with, redirecting Electric-type attacks away from it. Unfortunately, very few Pokemon have this ability, and the best users of it are Rhyperior, Rhydon, and Manectric, who have some crippling weaknesses; Rhyperior also prefers Solid Rock in most cases. Ground-types that are not deathly weak to Rotom-W are good teammates as well, since they can freely spam STAB Earthquake to deliver heavy damage to Rock- and Steel-types. Mold Breaker Excadrill and Garchomp are the best Pokemon to pair with Tornadus that fit the bill. Mold Breaker Excadrill, in particular, ignores Rotom-W's ability and can easily dispose of it with an Earthquake; making a solid team with Mold Breaker Excadrill is very difficult, though. This set works well with anything that hates Intimidate, as it will make Intimidate Pokemon risky to send in, allowing Tornadus's partners to work without worry of their attacks being weakened. Fighting-types have good offensive synergy with Tornadus as well; Terrakion, Hitmontop, Conkeldurr, Breloom, and others work very well with it, taking out potentially hazardous Ice- and Rock-types with their Fighting-type STAB attacks. Hydreigon can be useful, as it is able to deal heavy damage to bulkier Pokemon such as Cresselia and Rotom-W with a Dark Pulse and Draco Meteor, respectively.</p> "
      },
      {
        "name": "Tailwind Support",
        "description": "<p>This set aims to make the most of Tornadus's other ability: Prankster. Thanks to Prankster, Tailwind goes up with priority, meaning Tornadus will almost always get Tailwind up. It also gives Tornadus access to priority Taunt, which helps shut down opposing Trick Room and Thunder Wave users, which a Tailwind team hates, making Tornadus a great team supporter. Acrobatics is the STAB attack of choice, dealing heavy damage to a variety of threats. Superpower can be used in slot 2, rounding out coverage, but Taunt is an option here as well. Substitute is useful on this set because it does not have Defiant, and most opponents would not dare to bring in their Intimidate-user on the turn Tornadus sets up a Substitute.</p> <p>Rain Dance is an option here, allowing Tornadus either support a rain team or mess with opposing weather. While you may want to use Hurricane on this set, Acrobatics does not rely on rain to hit, and thus it is the better option, especially due to the fact that it can OHKO Amoonguss and Latios while Hurricane can't. In general, this set pairs well with Pokemon with middling Speed; Heracross, Chandelure, and Mamoswine all appreciate Tailwind support. Steel-type attackers also make good teammates. Pokemon such as Scizor, Metagross, Bisharp, and Heatran resist Rock- and Ice-type attacks that Tornadus hates, and can strike Ice- and Rock-types back with high-powered Steel-type attacks. Fighting-type attackers such as Terrakion, Hitmontop, and Breloom will also make great teammates; Breloom particularly loves a Tailwind boost, as it allows Breloom to cripple dangerous threats with Spore. Hitmontop can also provide Fake Out support, allowing Tailwind to be set safely. Tornadus also pairs well with Ground-types, such as Garchomp and Mold Breaker Excadrill, both of which can spam Earthquake without worrying about injuring Tornadus. They both greatly appreciate the Speed boost to outrun the likes of Latios and Terrakion, and have effective offensive synergy with Tornadus's Acrobatics. Hydreigon is also a good option, as it can take out threats to Tornadus with a Dragon Gem-boosted Draco Meteor and dent Trick Room setters such as Cresselia with Dark Pulse.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Nollan", "user_id": 161530}], "teams": [{"name": "Quality checked by", "members": [{"username": "tofucocoa", "user_id": 34584}, {"username": "Audiosurfer", "user_id": 136301}, {"username": "Pocket", "user_id": 95}]}, {"name": "Grammar checked by", "members": [{"username": "Ender", "user_id": 192999}, {"username": "-Tsunami-", "user_id": 30130}]}]}
  },
  "Thundurus": {
    "sets": [
      {
        "name": "Utility",
        "description": "<ul> <li>Arguably the best support Pokemon in the metagame, Thundurus's combination of Prankster and Thunder Wave allows it to cripple the opponent's team by easily spreading paralysis. Taunt further boosts Thundurus's utility, as it can shut down Amoonguss, prevent Substitute, and stop Trick Room from going up. On top of this, an impressive Special Attack stat alongside BoltBeam coverage gives Thundurus an offensive presence that most support Pokemon do not have. Notably, Thundurus is one of most teams' only options in consistently pressuring Jellicent.</li> <li>All of this combined solidifies Thundurus as one of the best Pokemon in the metagame and a threat that all teams must be prepared for.</li> <li>This EV spread allows Thundurus to survive Timid Dragon Gem Latios's Draco Meteor and outspeed Adamant Landorus-T. Thundurus can run many other spreads depending on the needs of the team. For example, a spread of 252 HP / 60 Def / 176 SpD / 20 Spe and a Calm nature allow Thundurus to survive a Timid Dragon Gem Latios's Draco Meteor while outrunning boosted base 70s.</li> <li>Thundurus has extremely high value, so it is recommended to preserve it as long as possible or until it has slowed down key threats with Thunder Wave. Thunder Wave will always have utility at any stage of the game because a key full paralysis can oftentimes turn the tides of the battle.</li> <li>Thundurus can easily fit on many team archetypes and does not require much direct support to be effective; however, it does benefit greatly from teammates that can remove Kyurem-B and Tyranitar, two threats that can threaten an OHKO on Thundurus, such as Genesect and Conkeldurr.</li> <li>Thundurus has a plethora of other moves it can use. Hidden Power Flying is an option for better damage to Amoonguss. Substitute can block a strong incoming attack, such as Latios's Draco Meteor. Additionally, Substitute guarantees that Thundurus can take one hit, allowing it to more effectively spread paralysis. Protect can be used to increase Thundurus's longevity, as opponents oftentimes prioritize removing Thundurus. Finally, Sky Drop is an interesting option to remove a threat for one turn and is often used in combination with a setup Pokemon, such as Suicune.</li> <li>A set with a 4 Def / 252 SpA / 252 Spe spread, a Timid nature, and an Electric Gem can be used on teams that favor more offensive presence while still having the utility of Thunder Wave.</li> <li>A physical Thundurus with Defiant, a 252 Atk / 4 Def / 252 Spe spread, a Jolly nature, Life Orb, and a moveset of Wild Charge, Superpower, Crunch, and Protect is a solid anti-metagame option, as it can outspeed and threaten common Pokemon such as Latios, Tyranitar, and Jellicent.</li> </ul> "
      }
    ],
    "credits": {"writtenBy": [{"username": "DaAwesomeDude1", "user_id": 228280}], "teams": [{"name": "Quality checked by", "members": [{"username": "Yoda2798", "user_id": 243662}, {"username": "zee", "user_id": 501951}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Thundurus-Therian": {
    "sets": [
      {
        "name": "Special Attacker",
        "description": "<ul> <li>In a tier dominated by Thundurus and its Prankster Thunder Wave, Thundurus-T finds a solid niche in being one of the only Pokemon immune to it. This, in combination with its high Special Attack and decent Speed tier, allows it to be an offensive threat that is capable of checking the most common Pokemon in the metagame such as the aforementioned Thundurus and Jellicent. Thundurus-T, however, lacks the overall utility of its Incarnate forme, making it a harder fit for most teams. As a result, Thundurus-T is typically only used on more offensive teams, such as rain, where the utility of being a Thunder Wave absorber can be more beneficial than the use of Thunder Wave itself.</li> <li>If Thundurus-T is being used on a rain team, Thunder is recommended; otherwise, Thunderbolt should be used. Hidden Power Flying is typically recommended, as it hits Amoonguss super effectively. Hidden Power Ice is an option for teams that want to hit Landorus-T instead and is more suited for non-rain teams, as those already have multiple ways of hitting Landorus-T super effectively.</li> <li>Electric Gem is the preferred item, as it notably allows Thundurus-T to OHKO Jellicent with Thunder. Flying Gem can be used on rain teams for more damage against Amoonguss.</li> <li>Thundurus-T's main role is to use Thunder whenever possible and Volt Switch out against unfavorable matchups. If the opponent has a Thundurus, it is best to preserve Thundurus-T so that it can check Thundurus when needed.</li> <li>Politoed and Kingdra are excellent teammates, as they can threaten Ground-types such as Landorus-T and Excadrill. Thundurus-T, in turn, matches well into common rain answers such as Amoonguss, Jellicent, and Thundurus. Genesect is another teammate that benefits from Thundurus-T's ability to check Jellicent and Thundurus, while it can check Tyranitar and Kyurem-B for Thundurus-T. The two also form a formidable VoltTurn core, capable of pivoting between each other for better positioning.</li> <li>Other options include Choice Scarf, which turns Thundurus-T into a speedy, powerful pivot, and Choice Specs, which turns it into a strong wallbreaker. A Substitute set with Leftovers is another interesting option, taking advantage of its excellent matchup into common Pokemon in the metagame, such as Amoonguss, Jellicent, and Thundurus, setting up Substitute and spreading massive damage against the foe with its strong Electric-type attacks.</li> </ul> "
      }
    ],
    "credits": {"writtenBy": [{"username": "DaAwesomeDude1", "user_id": 228280}], "teams": [{"name": "Quality checked by", "members": [{"username": "zee", "user_id": 501951}, {"username": "Smudge", "user_id": 550367}]}, {"name": "Grammar checked by", "members": [{"username": "ken", "user_id": 594478}]}]}
  },
  "Landorus-Therian": {
    "sets": [
      {
        "name": "Sash Attacker",
        "description": "<ul> <li>Access to a strong STAB spread move in Earthquake, pivoting in U-turn, one of the only immunities to Thunder Wave, ability to threaten Thundurus with Stone Edge, and utility with Intimidate and Stealth Rock, which allows for important chip damage to targets such as Thundurus, make Landorus-T one of the best Pokemon in the metagame.</li> <li>Protect over Stealth Rock further boosts Landorus-T's longevity if entry hazards are not needed on the team.</li> <li>Focus Sash increases Landorus-T's longevity by allowing it to survive powerful lethal hits, such as Dragon Gem Latios's Draco Meteor or Kingdra's Muddy Water.</li> <li>An Adamant nature is preferred to guarantee the OHKO on standard Thundurus with Stone Edge. Jolly is an option if higher Speed is preferred, as many Pokemon, such as Cresselia, Kyurem-B, and the aforementioned Thundurus, will Speed creep Adamant Landorus-T.</li> <li>Landorus-T is a common lead Pokemon, since it can cripple foes with Intimidate, set up hazards, or pivot out of unfavorable matchups. Against teams with strong physical attackers, such as Excadrill, Conkeldurr, or Tyranitar, it is best to preserve Landorus-T's health so that it can continuously use Intimidate.</li> <li>Landorus-T is capable of fitting on many teams easily due to its splashability; however, it does appreciate Ground-immune teammates so that it can use Earthquake freely. A common partner is Thundurus, because it can cripple faster threats, such as Latios or Kingdra. Latios is also a common partner, since it can threaten Kyurem-B and opposing Landorus-T. Cresselia benefits from Intimidate while also being able to hit opposing Landorus-T super effectively.</li> <li>Explosion is an option on Jolly Landorus-T, as it can outrun Speed creeping Pokemon and is guaranteed to live a hit with Focus Sash, barring a double-target. Superpower over U-turn is also an option on Jolly Landorus-T to hit Kyurem-B super effectively.</li> </ul> "
      },
      {
        "name": "Choice Scarf",
        "description": "<ul> <li>Choice Scarf trades the utility of the Focus Sash set for a strong, speedy attacker. This allows Landorus-T to become one of the fastest non-weather reliant Pokemon in the tier, alongside an immunity to Thunder Wave.</li> <li>Rock Slide is an alternative move that takes advantage of Landorus-T's Speed for spread chip damage while also having the ability to flinch.</li> <li>The given EV spread outruns Choice Scarf base 70s while the defensive investment allows it to live an uninvested Thundurus Hidden Power Ice. Similarly, Adamant nature guarantees the OHKO on standard Thundurus with Stone Edge. Alternatively, a spread with Jolly and maximum Speed can be used to outrun positive nature Deoxys-A.</li> <li>With its Speed and U-turn, this set aims to spread chip damage while pivoting for favorable matchups. Importantly, U-turn allows Choice Scarf Landorus-T to outrun and threaten Latios. This set can also clean with its strong Earthquakes once the opponent's Ground-immune Pokemon have been removed.</li> <li>Choice Scarf Landorus-T requires teammates that it can Earthquake next to, since it does not have the luxury to switch moves. Latios is a great offensive partner, as its combination of Speed and Special Attack, alongside an immunity to Earthquake, can allow it to clean up games with Landorus-T. Since Landorus-T uses U-turn often, bulky Pokemon it can pivot into, such as Amoonguss, are great partners as well.</li> </ul> "
      }
    ],
    "credits": {"writtenBy": [{"username": "DaAwesomeDude1", "user_id": 228280}], "teams": [{"name": "Quality checked by", "members": [{"username": "Yoda2798", "user_id": 243662}, {"username": "zee", "user_id": 501951}]}, {"name": "Grammar checked by", "members": [{"username": "ken", "user_id": 594478}]}]}
  },
  "Kyurem-Black": {
    "overview": "<p>Kyurem-B is a monster in Doubles, which is to be expected from the Pokemon with the highest BST in the metagame. It is certainly intimidating on paper, with incredibly efficient 125 / 100 / 90 defensive stats alongside useful Electric- and Water-type resistances and a base 170 Attack. Unfortunately, there are numerous problems that make Kyurem-B difficult to build a team around and even more difficult to use properly. For starters, it has no physical Ice-type attacks bar the unreliable Freeze Shock, which means it has to fall back on its base 120 Special Attack when using Ice-type moves, which is only average at best. Then there is its double-edged Dragon / Ice typing, which in exchange for useful STAB on Ice- and Dragon-type moves leaves it weak to Steel-, Fighting-, Dragon-, and Rock-type attacks, all of which are common in the Doubles metagame. It also suffers from its base 95 Speed, which leaves it outsped by common threats such as Hydreigon, Latios, and Terrakion, making speed control required if you want non-Choice Scarf variants to see success. Finally, while its Attack is stellar, common abilities like Intimidate as well as burns will lower its offensive presence significantly. However, don't let these flaws discourage you from using Kyurem-B, as it can completely tear down opposing teams with the proper team support. For example, a common Defiant attacker such as Tornadus or Bisharp as a teammate can discourage Intimidate.</p> ",
    "comments": "<h1>Other Options</h1> <p>Berries that offer Kyurem-B some cushioning against its common weaknesses, such as Chople Berry and Haban Berry to soften Fighting-type and Dragon-type blows respectively, can be used to defeat some of its common checks, but these are very situational. A combination of Power Herb and Freeze Shock can allow Kyurem-B to run a completely physical set with a semi-reliable Ice STAB, but this lowers the power of its other moves. A Substitute set can be used to cushion Kyurem-B from blows and ease prediction; however, this strategy is not as effective in Doubles as compared to in singles.</p> <p>Kyurem-B has a wide movepool, which grants it access to other useful moves that are highly situational. Icy Wind is a good option in the Doubles metagame, performing as a useful mechanism for speed control that also receives a STAB boost. Focus Blast can be used as a coverage option; however, its shaky accuracy is undesirable and thus Earth Power is better suited to eliminate pesky Steel-types. Kyurem-B, with its massive bulk, has access to Light Screen and Reflect. Such as set can throw the opponent off-guard as compared to a common Dual Screens setter like Cresselia. Rest with a Chesto Berry can be used to give Kyurem-B another chance at life, giving it a second chance to sweep the opponent's team.</p> <p>There are some other gimmicky options that Kyurem-B can try, such as Blizzard spam with hail support, but this would be better performed by normal Kyurem. Kyurem-B has access to Imprison, which can mess up the opponent's strategy if any of their Pokemon happen to carry the same moves as Kyurem-B. Access to Sunny Day and Rain Dance can allow Kyurem-B to disrupt the opponent's weather strategy, especially if their weather setter has been defeated, but this moveslot can be put to better use.</p> <h1>Checks and Counters</h1> <p>Almost any Steel-type, such as Scizor, Metagross, and Excadrill, will be a nuisance. However, Kyurem-B is properly equipped to deal with Heatran with Earth Power. Fighting-types serve as good checks to Kyurem-B. These include Breloom, Hitmontop, Conkeldurr, and Terrakion. However, Terrakion needs to avoid the Choice Scarf set, and the others might have some trouble breaking through the bulky sets. Kyurem-B hates Intimidate and burns, as they decrease its offensive power. Landorus-T and Hitmontop are common Intimidate users that can decrease Kyurem-B's damage output, but Landorus-T must avoid Ice Beam. Faster Dragon-types can outspeed and KO Kyurem-B, but they need to have an opportunity to switch in before doing so and must avoid the Choice Scarf set. As a final note, Kyurem-B dislikes sand teams in general as it cannot endure too many Rock Slides.</p> ",
    "sets": [
      {
        "name": "Choice Band",
        "description": "<p>This set aims to use Choice Band to hit Pokemon really hard repeatedly. While that seems gimmicky, Kyurem's massive base 170 Attack stat means even Steel-types like Metagross will lose half their health to Outrage. In particular, Kyurem-B's Water-type resistance makes this set a threat to rain teams, especially when Kingdra and Steel-types are eliminated. Electric-type resistance and Ice-type neutrality make it a good check to Electric-types such as Thundurus and Rotom-W, but it must be wary of Thunder Wave and Will-o-Wisp, respectively. However, this set requires support to function at its best; Kyurem-B is vulnerable to many of the tier's best attackers, especially after an Outrage, and Intimidate turns its OHKOes and 2HKOes into 2HKOes and 3HKOes.</p> <p>Dragon Claw is usually the STAB move to click when unintimidated, especially when your opponent still has Steel- and Dragon-types. Fusion Bolt hits bulky Water-types, especially Jellicent, slightly harder than Outrage does and is more reliable. Outrage should generally be used only when the opponent's Steel-types or Kyurem-B checks have been eliminated, allowing Kyurem-B to dominate the playing field and deal massive damage to opponents. It can be used early game to destroy Intimidate or Steel-type switchins, but can easily lock you in to get revenge killed. Sleep Talk is rarely relevant, but if you can switch in your Kyurem-B on Spore, it is an excellent sleep absorber: immune to other statuses, able to switch out after Outrage, and activating Sleep Clause.</p> <p>Kyurem-B should run max Speed for the mirror and max Attack for more power. Jolly is acceptable, but Kyurem-B needs Adamant to, for example, OHKO bulky Thundurus with Dragon Claw or Hitmontop with -1 Outrage.</p> <p>Choice Band Kyurem-B enjoys teammates that can dispose of the Steel-types that give it trouble. These include partners such as Heatran, Terrakion, and Hitmontop, which have powerful offensive capabilities to match Kyurem-B. Kyurem-B also enjoys teammates such as Tornadus, Cresselia, and Shaymin-S that can deal with Fighting-types. This set in particular has an intense hatred towards Intimidate, so partners with Defiant such as Tornadus and Bisharp make for great allies. Finally, speed control from partners such as Thundurus and Cresselia will help Kyurem-B move first, which is key in allowing it to outspeed faster Dragon-types such as Hydreigon and Latios.</p> "
      },
      {"name": "Substitute"},
      {
        "name": "Mixed Attacker",
        "description": "<p>Due to how vast the special side of Kyurem-B's movepool is, it is not hard to see why a mixed attacking set is one of the most popular choices for Kyurem-B. Dragon Claw establishes itself as the Dragon-type STAB move of choice, as it is far more reliable than its more powerful counterpart and deals heavy damage to the majority of the metagame, especially opposing Dragon-types. However, Outrage is certainly a plausible option, as while it will hit a random opponent, it has 50% more power than Dragon Claw, allowing it to achieve KOs that Dragon Claw cannot. Fusion Bolt cements itself in the second slot, standing out as a method to hit Steel-types harder than Dragon Claw and deal super effective damage to bulky Water-types such as Suicune and Jellicent. Earth Power is preferred in the third slot, as it allows Kyurem-B to OHKO troublesome Steel-types, particularly Heatran. Earth Power also lands 2HKOs on the majority of other Steel-types, including Excadrill and Metagross that aren't holding Shuca Berry. However, Ice Beam is an alternative choice for the third slot, as it can hit threats such as Landorus-T and Shaymin-S for OHKOs. Protect is the obvious choice for the final slot, guarding Kyurem-B from dangerous priority attacks such as Bullet Punch and Mach Punch while its partner on the field does some damage.</p> <p>The 44 Special Attack EVs allow Kyurem-B to always OHKO 252 HP Heatran and Excadrill with a Life Orb-boosted Earth Power. Meanwhile, 236 Speed EVs allow Kyurem-B to hit a nice Speed tier, outrunning Adamant Landorus-T and everything slower, including Jolly Breloom. If Kyurem-B uses Ice Beam instead of Earth Power, 20 Special Attack EVs can be used instead to guarantee the OHKO on 252 HP Landorus-T holding a Yache Berry. If for some reason you would like to run Kyurem-B on a Trick Room team, a Brave Nature with 236 HP EVs should be considered.</p> <p>Dragon Gem is an option over Life Orb to give Kyurem-B's Dragon-type STAB move more power. However, do take note that Kyurem-B cannot OHKO Heatran with Earth Power without the Life Orb boost, even if 252 Special Attack EVs are invested. Sitrus Berry is another option that can give Kyurem-B some extra bulk that turns many 2HKOs into 3HKOs, but Kyurem-B's large array of weaknesses and the fact that it will no longer achieve an OHKO on Heatran with Earth Power makes this choice heavily situational.</p> "
      },
      {
        "name": "Choice Scarf",
        "description": "<p>Choice Scarf allows Kyurem-B to outspeed and demolish a large array of threats it normally cannot, such as Latios, Garchomp, Hydreigon, Tornadus, Thundurus, and more. Dragon Claw is the Dragon-type STAB move of choice; with the extra Speed from Choice Scarf, Kyurem-B can reliably OHKO threats such as Latios granted it gets a safe switch-in. Ice Beam provides Ice-type STAB and can take down threats such as Landorus-T and Shaymin-S. Fusion Bolt hits Tornadus and bulky Water-types such as Suicune and Jellicent for heavy damage. Rock Slide is useful as a spread move that has a chance to flinch the opponents, while Earth Power provides necessary coverage against Steel-types that would otherwise laugh at this set's attempts to hurt them.</p> <p>The given Speed investment allows Choice Scarf Kyurem-B to outspeed positive-natured base 130s. Maximum Attack investment and the rest of the EVs dumped into Special Attack maximize its offensive power. Because this set works around so many common threats, almost any Pokemon appreciates Kyurem-B's support. However, there are definitely some teammates that can help Kyurem-B out a lot; Tornadus and Bisharp with Defiant can deter Intimidate users from reducing Kyurem-B's offensive capabilities. Partners that can deal with Steel-types, such as Heatran, Chandelure, and Hitmontop are also useful so that Kyurem-B doesn't have to lock itself into Earth Power.</p> <p>This set hates opposing speed control a lot, so Taunt support or partners that can take down common users of Icy Wind and Trick Room will be very helpful. Some examples include Bisharp and Volcarona, which also takes down common Trick Room setters. Kyurem-B itself can usually defeat Thunder Wave Thundurus and common Tailwind setters, so they aren't as much of an issue.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Metal Sonic", "user_id": 158673}, {"username": "Nollan", "user_id": 161530}], "teams": [{"name": "Quality checked by", "members": [{"username": "Mizuhime", "user_id": 51961}]}, {"name": "Grammar checked by", "members": [{"username": "GatoDelFuego", "user_id": 91628}, {"username": "blitzlefan", "user_id": 163416}]}]}
  },
  "Keldeo": {
    "overview": "<p>Keldeo is known to be one of the best Water-types available in Gen 5 Doubles, with a very good base Speed of 108 and a great base Special Attack of 129. As such, it is commonly seen on rain teams, but its versatility allows it to function well even outside of rain. Keldeo has a shallow movepool, but it is enough to allow it to be a potent force in the Doubles metagame. Access to Icy Wind is useful for speed control in Doubles, while a powerful Fighting STAB move in Secret Sword quite makes up for it. Secret Sword's main appeal is that bulkier Pokemon usually invest in their Special Defense and are paired with Intimidate support to work around physical attackers. Secret Sword bypasses this strategy as it strikes at their weaker Defense but isn't softened by Intimidate. Thus, Keldeo can help rain teams by using its Fighting STAB move of choice to remove checks to common rain sweepers such as Tyranitar, Abomasnow, and Ferrothorn. Unfortunately, every Fighting-type can perform this role, so Keldeo faces competition from other Fighting-types, especially from the rain-loving Toxicroak. In addition, Keldeo stacks up weaknesses to Grass- and Electric-type attacks along with Politoed, which might be problematic in teambuilding. Nonetheless, Keldeo remains a more powerful wallbreaker, especially in rain.</p> ",
    "comments": "<h1>Other Options</h1> <p>Keldeo's shallow movepool means that it doesn't have any other coverage moves bar Hidden Power. Hidden Power Psychic can possibly be used to deal a bit of damage to Amoonguss and OHKO Toxicroak, but that will not be a good use of a moveslot. A Choice Set can be used; Choice Scarf nets some surprise kills while Choice Specs overwhelms special bulwarks, including Cresselia. Keldeo can also boost the power of its STAB moves with Calm Mind, which it can set up with Fake Out and/or Rage Powder support. Helping Hand is a great move to boost a teammate's damage output, but is better used by a bulkier teammate such as Togekiss. Keldeo can use Rain Dance to change the weather instantly without having to rely on Politoed.</p> <h1>Checks and Counters</h1> <p>Keldeo hates Trick Room and Thunder Wave, so common users of these moves like Cresselia, Gyarados, and Thundurus cripple it. Slowking is a threat that lurks on many Trick Room teams, resists both of Keldeo's STABs, and can retaliate with a super effective Psychic. Amoonguss is also a common threat, and its Rage Powder can stop Keldeo from doing anything useful to Amoonguss's partner, which sets it apart from the other counters. However, this is rendered ineffective if Keldeo runs Taunt.</p> <p>Shaymin-S is a dangerous check to Keldeo, and can be a full-blown counter if Keldeo isn't carrying Icy Wind. Kingdra and Ludicolo both outspeed Keldeo in rain due to Swift Swim and deal heavy damage to it. Keldeo's checks include faster Psychic-types such as Deoxys-A, Latios, and Latias; and Electric-types such as Thundurus formes, Rotom-W, and Zapdos, which can all hurt Keldeo pretty badly but cannot switch in safely. Jellicent is also a good counter to Keldeo, having a useful niche in being a Trick Room setter that is immune to Fake Out and strong Fighting- and Water-type moves. Celebi also shares the trait of resisting both of Keldeo's STABs, but it is not commonly seen in Doubles.</p> ",
    "sets": [
      {
        "name": "All-Out Attacker",
        "description": "<p>This set permits Keldeo to switch moves and deal damage with the appropriate STAB. Hydro Pump is a powerful STAB move that can punch holes in the opponent's team after being boosted by Life Orb and usually rain. Secret Sword is a great Fighting STAB move that strikes the enemy's Defense rather than their Special Defense, which nails rain checks Tyranitar, Abomasnow, Ferrothorn, and Kyurem, as well as Kyurem-B. Protect is a staple in Doubles for general scouting and defensive strategies. Life Orb and Expert Belt are the item options for this set. Life Orb gives significant boost in power but cuts 10% of Keldeo's health each time, while Expert Belt can be used if the user dislikes the recoil.</p> <p>Icy Wind is awesome in Doubles, hitting both opponents with fair coverage and also slowing both of them down, which is helpful for a slower teammate to break walls. However, its low Base Power means that it cannot even OHKO the Landorus formes with certainty. Taunt is useful to shut down status users like Thundurus and setup sweepers, disrupting their strategy for the match. A notable example is Amoonguss, which is extremely irritating due to Spore and Rage Powder. Furthermore, Taunt is also extremely useful for shutting down Trick Room teams, which are detrimental to Keldeo's quick playstyle. Hidden Power Grass is great for shutting down Water-types and especially Gastrodon, a major threat to rain teams in general. It is also useful against Jellicent, which is a prominent counter to Keldeo.</p> <p>Surf can be a good option for hitting both opponents, and wrecks enemies especially in rain. However, it also attacks the partner so care must be taken to select good teammates, for example to use Protect on the turn that Surf is used or have abilities that benefit from it, such as Water Absorb or Storm Drain. Several different moves can replace Icy Wind's slot in order to suit the team's needs. Hidden Power Electric can be used to deal damage to Water-types and also take down Gyarados. Substitute can be used to help Keldeo ease prediction and block status moves. Quick Guard can be used to protect Keldeo and its partner from priority moves, notably Fake Out and Sucker Punch.</p> <p>Politoed is a great teammate for rain support, allowing Hydro Pump or Surf to be extremely painful. Pokemon that are immune to Water-type attacks are extremely good partners if Keldeo is using Surf: these include Gastrodon and Toxicroak, which also happen to function well on rain teams. Gastrodon also happens to be one of the best partners for Keldeo, as Storm Drain allows it to boost its Special Attack each time it is hit by a Water-type move, allowing it to hurt enemies even more. Furthermore, it also has decent synergy with Keldeo, as it can take Electric-type moves, such as Discharge, while Keldeo resists Blizzard; both of them resist Rock Slide. Keldeo also pairs well with either of the top two Swift Swim sweepers, Kingdra and Ludicolo, as they each eliminate the other's checks. Kingdra can help eliminate Latias and Latios while Keldeo can remove Ferrothorn to assist Kingdra. Ludicolo eliminates bulky Water-types such as Gastrodon and Rotom-W while Keldeo removes Ferrothorn, Kyurem, and Kyurem-B.</p> <p>Keldeo also pairs well with Latios, as Latios deals with most of the bulky Grass-, Electric-, and Water-types that hinder Keldeo, while Keldeo threatens Tyranitar and Steel-types that can tank Latios's powerful STAB moves. Choice Scarf Tyranitar deserves a special mention as a great partner for Keldeo, despite being incompatible with rain. The two have tremendous offensive synergy, as Choice Scarf Tyranitar can outrun and take out the likes of Latios, Tornadus, Thundurus, Salamence, and Jellicent, against which Keldeo struggles.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Metal Sonic", "user_id": 158673}], "teams": [{"name": "Quality checked by", "members": [{"username": "Laga", "user_id": 176920}, {"username": "Stratos", "user_id": 59770}, {"username": "Pocket", "user_id": 95}]}, {"name": "Grammar checked by", "members": [{"username": "Kingler", "user_id": 189059}, {"username": "GatoDelFuego", "user_id": 91628}]}]}
  },
  "Genesect": {
    "overview": "<p>Genesect's decent base Speed stat allows it to outrun a plethora of major threats in the Doubles metagame. Genesect also has great attacking stats, letting it take on the role of a physical or special attacker and making it easy to fit on teams. Its BoltBeam coverage is stellar, and its attacking prowess can be boosted significantly by a favorable Download boost. It also has access to STAB U-turn, which allows it to scout out the enemy team and makes it a potent Choice Scarf user. Its typing leaves it with only one weakness, albeit a large one, but unfortunately, its bulk leaves it unable to fully take advantage of it. Genesect fears paralysis and is dead weight in Trick Room, so it needs teammates that can cover those weaknesses.</p> ",
    "comments": "<h1>Other Options</h1> <p>Genesect can run a powerful Choice Band or physical Life Orb set, which has the power to OHKO every weather starter in the metagame with either Explosion or U-turn; it also has decent coverage with Blaze Kick to KO Steel-types and has revenge killing potential with ExtremeSpeed. A Focus Sash might allow Genesect to grab a few surprise KOs, and Genesect's immunity to sandstorm makes Focus Sash a more reliable item, but other items are generally better. Genesect can run an Occa Berry, but it still won't be able to survive most powerful Fire-type attacks used in the tier. Bug Gem is also an option for allowing Genesect to do major damage to Cresselia and Tyranitar without restricting its move selection, but Choice Band is generally the better item choice if you want extra power. Rock Polish is available, but Genesect doesn't quite have the bulk to pull it off in Doubles. Sitrus Berry is nice for longevity, but it is generally worse than more offensive items such as Expert Belt.</p> <h1>Checks and Counters</h1> <p>Fire-type Pokemon, such as Heatran, Volcarona, Chandelure, and Ninetales, do not fear Genesect at all and can easily exploit its 4x weakness to Fire-type moves without taking much damage from its attacks. Excadrill in sand and Kingdra in rain are also big threats, as their powerful moves will deal a lot of damage to Genesect. Choice Scarf users such as Landorus-T and Garchomp also threaten Genesect with powerful spread moves such as Earthquake, though it is worth noting that Choice Scarf Genesect can beat Landorus-T with Ice Beam. Genesect can't really do much to Pokemon such as Hitmontop and Kyurem-B, either of which can strike back and take a serious chunk out of its health.</p> ",
    "sets": [
      {
        "name": "All-Out Attacker",
        "description": "<p>This set makes use of Genesect's BoltBeam coverage to hit almost everything for at least neutral damage and many Pokemon super effectively. U-turn is great for scouting the opponent's team and is an option for when Genesect gets an Attack boost from Download. It also hits common Pokemon such as Tyranitar in sandstorm for more damage than Bug Buzz, which is still a viable alternative if you want a special STAB that is unaffected by Intimidate. Thunder is the better choice for rain teams and can OHKO 252/0 Politoed, provided Genesect has a Special Attack boost from Download; however, it is risky if rain is not up. Ice Beam deals with Dragons-types and other Pokemon 4x weak to it, such as Landorus-T, allowing Genesect to outspeed and KO them. Protect is standard for prediction and can keep Genesect safe while its counters are removed. Flamethrower is an option over Protect to increase Genesect's coverage but means Genesect is even more threatened by its checks and counters, and will be forced to switch out more often.</p> <p>With a favorable Download boost, Genesect can easily defeat a lot of Pokemon with not-so-stellar defenses; however, anything with decent bulk can force it out. Genesect also hates Trick Room, as it works against Genesect's Speed. Pokemon with moves such as Taunt to stop the enemy from using Trick Room can be good partners. This set really benefits from Tailwind support as it helps Genesect take on faster opponents and also lets it U-turn out into a Tailwind setter to keep momentum. Genesect partners well with Chandelure and Heatran, as they make opponents think twice about using Fire-type attacks. Genesect takes no damage from sandstorm, meaning it is easy to fit onto a sandstorm team. Giga Drain can be used to take down Gastrodon if it is an issue. Blizzard is viable, especially in hail, as it really packs a punch and can deal major damage. A Focus Sash can secure a few surprise KOs, but Expert Belt and Life Orb are generally better. Expert Belt is the preferred choice for most teams as it helps Genesect get a number of significant KOs with no drawbacks. Genesect can also use a Life Orb to increase its damage output, but it means that Genesect is worn down much faster.</p> "
      },
      {
        "name": "Choice Scarf",
        "description": "<p>Genesect is one of the premier Choice Scarf users in the tier thanks to its good Speed stat and ability to beat other common Choice Scarf users such as Landorus-T with its Download-boosted attacks. BoltBeam coverage means that only a select few Pokemon resist Genesect's coverage. U-turn makes Genesect an excellent scout. It also allows it to dent Pokemon such as Cresselia and Tyranitar, and provides an answer to Reuniclus, one of the most popular Trick Room setters. With a beneficial Download boost, U-turn OHKOes both Latios and Latias, thus taking a major threat out of the game. Thunder will OHKO max HP Politoed 75% of the time, making it the better option for a rain team; however, Thunderbolt still packs quite a punch. The last slot depends on your team. Flamethrower provides more coverage but is worse on rain teams, on the one hand while Bug Buzz gives Genesect a special STAB move in case you don't want it to switch out. Explosion is great late-game, and can help deal with things your team might struggle with. Genesect must always be wary of getting predicted and locked into a bad move, as it doesn't have much bulk to rely on. Make sure you scout out the enemy's Choice Scarf users before being too reckless with Genesect due to this frailty. Furthermore, Choice Scarf Genesect hates dealing with sun teams, as it can't do much damage to many of their major threats.</p> <p>The given EV Spread allows Genesect to outspeed everything up to and including Deoxys-A (with 236 Speed EVs). The extra EVs in Attack allows Genesect to 2HKO Cresselia provided it receives an attack boost from Download. Giga Drain can be used in the last slot if your team has trouble dealing with the commonly seen Gastrodon. Genesect benefits greatly from a Pokemon that resists Fire-type attacks, such as Tyranitar; Genesect's immunity to sandstorm makes Tyranitar an even better partner. Chandelure also works as a great partner, as it can also get a boost from Fire-type attacks directed at Genesect.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "BLOOD TOTEM", "user_id": 191667}], "teams": [{"name": "Quality checked by", "members": [{"username": "Laga", "user_id": 176920}, {"username": "Level 51", "user_id": 118474}, {"username": "Nollan", "user_id": 161530}]}, {"name": "Grammar checked by", "members": [{"username": "-Tsunami-", "user_id": 30130}, {"username": "Arkian", "user_id": 174386}, {"username": "melvni", "user_id": 64080}]}]}
  }
}