{
  "Crustle": {
    "sets": [
      {
        "name": "Rock Gem",
        "description": "<h1>Set Description</h1> <p>Shell Smash boosts Crustle's Attack and Speed by two stages each, allowing it in many cases to move before the opponent the following turn. Rock Wrecker is Crustle's strongest STAB move and with a Rock Gem and Shell Smash boost, it can OHKO most Pokemon that do not resist it, such as Snorlax and Latias. Rock Blast is useful against Pokemon that try to set up Substitute, such as Volcarona, Thundurus, Aerodactyl, and Serperior. X-Scissor allows Crustle to more reliably hit Pokemon such as Cresselia. Earthquake can be used to have better matchups against Heatran and Terrakion. Counter can be used in conjunction with Sturdy to punish physical attackers, such as Choice Scarf Landorus-T.</p> <h1>EVs</h1> <p>Crustle almost always runs 252 Attack EVs due to needing as much damage as possible from Shell Smash. It also almost always runs 252 Speed EVs to outspeed Tornadus-T after a Shell Smash. Adamant is the preferred nature because Crustle does not gain any meaningful matchups having a Jolly nature other than against opposing Crustle.</p> <h1>Usage Tips</h1> <p>Crustle's strength lies in its combination of Sturdy, Shell Smash, and Rock Wrecker. Sturdy allows Crustle to often freely use Shell Smash and attack first on turn two. However, Crustle struggles against Pokemon that can use moves like Taunt, which is commonly used by Heatran, Jellicent, and Sableye. It also struggles against Pokemon with priority moves, such as Keldeo, Genesect, and Mienshao, which can either break Sturdy or attack it after Sturdy activates. Despite having difficulties against Trick, Crustle can still perform well against Choice Scarf Cresselia and Choice Specs Latios if it has X-Scissor. If Crustle has X-Scissor, it is important to not use Shell Smash on the first turn against these Pokemon, as they can use Trick to lock Crustle into Shell Smash. Crustle, however, still struggles against Porygon-Z and Jellicent, which also commonly use Trick.</p> <h1>Other Options</h1> <p>Crustle can also use a variety of different items with this set, including Mail, which makes Crustle immune to with Trick, and Lum Berry, which can heal a burn from Heatran, Arcanine, or Sableye's Will-O-Wisp, which Crustle struggles against. Choice Band Crustle is also an option, but it is generally worse than Rock Gem sets, as it cannot use Shell Smash.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 518399, "username": "Itchy"}, {"user_id": 437679, "username": "crucify"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 493772, "username": "Lumii"}]}
  },
  "Porygon-Z": {
    "comments": "<h1>Other Options</h1> <p>Choice Specs Porygon-Z is an option if the extra damage with coverage such as Dark Pulse, Hidden Power Fire, Thunderbolt, or Ice Beam is desired. Without the Speed boost from Choice Scarf or Normal Gem's ability to switch moves, it is hard to justify, but still a solid set.</p> <p>Normal Gem Porygon-Z may opt for Endure for other Porygon-Z and Crustle, forcing them to recharge with Hyper Beam or Rock Wrecker</p> <p>If you want to be a bit wild with your Porygon-Z set, Chople Berry + Conversion defeats Sawk and most other Fighting-types. With 224 HP / 248 Def / 36 SpA and a Modest nature, Porygon-Z survives Choice Band Sawk's Close Combat before becoming a Ghost-type with Shadow Ball. Keep in mind that all of Porygon-Z's other moves need to be Normal-type for Conversion to work correctly.</p> ",
    "sets": [
      {
        "name": "Choice Scarf",
        "description": "<h1>Set Description</h1> <p>Hyper Beam, boosted by Adaptability, blasts through most non-resistant foes like Latios and Keldeo before the recharge turn takes effect. Trick stops setup from foes such as Shell Smash Crustle. Trick, Icy Wind, and Hyper Beam together allow Porygon-Z to reliably defeat Crustle. Uproar allows Porygon-Z to avoid a recharge turn, which is useful versus various Endure + Custap Berry users like Garchomp and Venusaur, as well as block Rest from various Pokemon, such as stall Snorlax. Dark Pulse allows Porygon-Z to damage Ghost-types, most notably Jellicent.</p> <h1>EVs</h1> <p>The HP investment allows Porygon-Z to always survive Crustle's Rock Wrecker after Rock Gem is removed. The Speed investment and a Choice Scarf outspeeds Raikou and Starmie.</p> <p>An alternate spread of 40 HP / 248 Def / 144 SpA / 76 Spe may be used instead to survive Fighting Gem Conkeldurr's Mach Punch and outspeed Latios and Latias, but the lower Special Attack investment means various targets like Crustle and Substitute Thundurus are less reliable.</p> <h1>Usage Tips</h1> <p>Usually, Porygon-Z will use Hyper Beam to OHKO foes before they can move; however, some matchups are less straightforward. Some of the most common matchups with more complex sequences are listed below.</p> <p>To defeat Crustle, first use Trick to potentially lock the opponent into Shell Smash and remove Rock Gem, then use Icy Wind to break Crustle's Sturdy, and finally use Hyper Beam to KO Crustle.</p> <p>Versus Custap Berry users like Venusaur and Garchomp, you will have to guess whether to use Uproar on a potential Endure or Hyper Beam. Note that Garchomp more commonly uses Yache Berry instead, so it is usually safer to use Hyper Beam.</p> <p>Although Hyper Beam does not OHKO Cresselia, it is useful for Porygon-Z in this matchup anyway. Provided Cresselia is not holding Mail, Porygon-Z should use Trick turn 1 onto Cresselia to lock it into a potential status move before continually using Hyper Beam. Hyper Beam outdamages Rest and Moonlight, eventually resulting in a win for Porygon-Z.</p> <p>Many other stall Pokemon, like Registeel, Snorlax, and Manaphy, may use Mail to block Trick; watch for it on Team Preview and be mindful of it in game.</p> "
      },
      {
        "name": "Normal Gem",
        "description": "<h1>Set Description</h1> <p>Porygon-Z's Adaptability-boosted Hyper Beam overpowers even sturdy specially defensive walls like Snorlax and Cresselia with Normal Gem and can be further boosted with Nasty Plot to break through Special Defense boosts from Calm Mind and Amnesia. Substitute helps beat Snorlax by scouting for Belly Drum. Uproar allows Porygon-Z to defeat Substitute + Protect users like Raikou and Suicune, while Dark Pulse allows Porygon-Z to damage Ghost-types, most notably Jellicent.</p> <h1>EVs</h1> <p>The given EV spread outspeeds Suicune and provides some additional bulk.</p> <p>An alternative EV spread of 40 HP / 4 SpA / 248 Def / 216 Spe survives Fighting Gem Conkeldurr's Mach Punch and still outspeeds Suicune, but has a much worse matchup against Snorlax.</p> <h1>Usage Tips</h1> <p>Versus most foes, even bulky targets like Cresselia, Porygon-Z should use Hyper Beam.</p> <p>Versus Snorlax, use Substitute turn 1. If they use Amnesia, use Nasty Plot until they use Seismic Toss to break Substitute or they get to +6 Special Defense. Then, use Hyper Beam repeatedly. If Snorlax uses Giga Impact, Superpower, or any other offensive move, you should use Hyper Beam and hope Snorlax is OHKOed. If they use Belly Drum, use Uproar to KO them so you don't miss Hyper Beam.</p> <p>Versus Custap Berry users like Venusaur, Porygon-Z should use Nasty Plot if you predict them to Endure. If you do not believe they will, use Hyper Beam.</p> <p>Versus Pressure stall Pokemon, like Raikou and Suicune, use Substitute turn 1, since they will more than likely scout for Choice Scarf + Trick with Protect. You are then free to use Uproar until they are KOed. Raikou also commonly uses Choice Specs, so Normal Gem Porygon-Z does not defeat all sets.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 493772, "username": "Lumii"}, {"user_id": 437679, "username": "crucify"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 518399, "username": "Itchy"}]}
  },
  "Scrafty": {
    "sets": [
      {
        "name": "Chople Counter",
        "description": "<h1>Set Description</h1> <p>Fake Out allows Scrafty to freely damage most Pokemon and bypass Sturdy from Pokemon like Magnezone and Sawk. High Jump Kick is Scrafty's strongest STAB attack and allows it to beat many common threats such as Slaking, Heatran, and Tyranitar. It is also Scrafty's strongest option against neutral targets. Payback is used over Crunch due to Scrafty's low Speed stat, which allows Scrafty to underspeed Choice Scarf Cresselia even after Cresselia uses Trick. Counter, Chople Berry, and Intimidate beat physical Fighting-types such as Sawk, Mienshao, and opposing Scrafty.</p> <h1>EVs</h1> <p>Maximum HP and 80 Special Defense EVs allow Scrafty to survive a Dragon Gem Latios's Draco Meteor while and OHKO back with Payback. The rest of the EVs are dumped into Attack to allow Scrafty and maximize Scrafty's damage.</p> <h1>Usage Tips</h1> <p>Fake Out allows Scrafty to break Magnezone and Sawk's Sturdy, and High Jump Kick and Counter can OHKO them. Against physical Fighting-types, such as Mienshao, Conkeldurr, Hariyama, and opposing Scrafty, it is always advisable to use Fake Out into Counter. However, Bulk Up variants can still beat Scrafty. Against Conkeldurr, after using Fake Out, it is important to then use Counter. If Conkeldurr attacks with Hammer Arm, Counter wins. However, if Conkeldurr uses Mach Punch, using High Jump Kick on the third turn is a favorable damage roll. Scrafty also has a decent matchup against Snorlax. However, it is important to play around the possibility of Counter by using Payback after Fake Out, as this allows Scrafty to always OHKO with High Jump Kick after. However, this strategy does fail against Belly Drum Snorlax; if you suspect Belly Drum, use High Jump Kick on turn two.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 518399, "username": "Itchy"}, {"user_id": 437679, "username": "crucify"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 493772, "username": "Lumii"}]}
  }
}