{
  "Ivysaur": {"sets": {"Physical Wall": {}}},
  "Beedrill": {"sets": {"Offensive Toxic Spikes": {}}},
  "Pikachu": {
    "comments": "<h1>Other Options</h1> <p>Volt Tackle is Pikachu's strongest physical Electric-type move, with it notably able to 2HKO physically defensive Clefairy, and Lightning Rod is generally the superior ability over Static, though neither can be used in conjunction with Extreme Speed. Another useful option that cannot be used alongside Extreme Speed is Fake Out. Nasty Plot is an enticing option on a special-attacking set, though it's held back by Pikachu's horrid bulk and average Speed, so Raichu outclasses it in this role. Pikachu possesses powerful utility options such as Encore, Yawn, and Knock Off, though Pikachu's terrible bulk means that, if it isn't KOing or pivoting off its target, it's likely getting KOed back. Hidden Power Grass threatens Whiscash, OHKOing offensive variants, though the coverage of Hidden Power Ice is generally superior.</p> <h1>Checks and Counters</h1> <p><strong>Fake Out</strong>: Fake Out users bypass Pikachu's good Speed and Extreme Speed's +2 priority to threaten Pikachu's terrible Defense. Persian is notable, as its Fake Out is powerful enough to OHKO Pikachu.</p> <p><strong>Faster Threats</strong>: While Extreme Speed 2HKOes them, naturally faster threats such as Simisear and Choice Scarf users such as Grumpig and Kingler can outspeed and OHKO Pikachu.</p> <p><strong>Grass-types</strong>: Grass-types such as Leafeon can easily tank a hit from Pikachu and OHKO it back. Meganium and Ivysaur are notable since their enormous bulk and reliable recovery let them wall Pikachu throughout the course of a game, despite them being weak to Hidden Power Ice.</p> <p><strong>Bulky Pokemon</strong>: High bulk and reliable recovery let walls such as Solrock and Meganium tank Pikachu's attacks and either KO or cripple it in return. Physically defensive Clefairy doesn't immediately threaten Pikachu, but Pikachu can't 2HKO it, and it can heal with Soft-Boiled and slowly wear Pikachu down with Seismic Toss. While threats lacking reliable recovery cannot wall Pikachu long-term, tanks such as Lairon and Muk can easily take a hit and OHKO Pikachu back</p> <p><strong>Item Removal</strong>: If Pikachu loses its Light Ball through the use of moves such as Knock Off or Trick, it becomes pitifully weak and practically dead weight to its team.</p>",
    "sets": {
      "Revenge Killer": {
        "description": "<p>Extreme Speed combined with Pikachu's immense Light Ball-boosted Attack makes it an excellent revenge killer. Wild Charge is Pikachu's strongest physical Electric-type attack that is compatible with Extreme Speed. Volt Switch lets Pikachu pivot while dealing sizeable damage. Hidden Power Ice targets the Grass-, Ground-, and Dragon-types that resist or are immune to Pikachu's Electric-type STAB moves. Maximizing Pikachu's Attack with a Lonely nature is essential to get the most out of Extreme Speed, though Pikachu may either use a Speed-boosting nature or an alternative EV spread of 252 Atk / 112 SpA / 144 Spe. The latter spread increases the power of its special moves, letting it deal more damage to foes like Lairon and Hippopotas, while keeping enough Speed investment to outpace positive-nature base 65 threats such as Mienfoo. Static is the only ability Pikachu possesing Extreme Speed can have.</p> <p>Pikachu is best used on offensive teams looking for a powerful revenge killer. Wallbreakers such as Simisear and Mr. Mime can help break through walls like Solrock and Meganium, which are among the few Pokemon that can switch into Pikachu and remain healthy enough to KO it back. While Pikachu's Extreme Speed is very threatening to frail offensive Pokemon like Simisear and Mr. Mime, it cannot OHKO them and they usually OHKO it back. Thus, sources of chip damage, notably Stealth Rock, are crucial to getting these threats into KO range. Solrock and Lairon are notable Stealth Rock setters, as each additionally provides a strong offensive and defensive backbone. While it is much harder to fit on teams, Spikes support from teammates like Shelmet also goes a long way to help Pikachu get its checks into KO range. Given its frailty, Pikachu appreciates the defensive backbone provided by teammates like Lairon, Solrock, and Muk, as they can switch into the attacks it cannot. Pivots like Mienfoo and Persian can form effective VoltTurn cores with Pikachu, with them notably helping it switch in safely.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Gangsta Spongebob", "user_id": 535530}], "teams": [{"name": "Quality checked by", "members": [{"username": "Monai", "user_id": 482455}, {"username": "Mirbro", "user_id": 451786}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Raichu": {
    "comments": "<h1>Other Options</h1> <p>Raichu can choose to run Hidden Power Grass to specifically do more damage to Whiscash and Graveler, but Hidden Power Ice covers a lot more for it. Raichu can also run physical sets with moves like Fake Out, Extreme Speed, and Volt Tackle, but it is outclassed by Pikachu in this way. Static can be chosen over Lightning Rod in order to get the paralysis chance on something using U-turn or another weaker move that Raichu can take, but Lightning Rod's Electric immunity is much more useful, especially for switching into Thunder Wave.</p> <h1>Checks and Counters</h1> <p><strong>Bulky Resistances</strong>: Grass-types like Meganium, Gloom, and Ivysaur resist a Choice Specs Thunderbolt. They do have to watch out for being pivoted out of with Volt Switch or taking a Hidden Power Ice when they are low. Shelgon is another Pokemon that can resist its Electric-type attacks, but it can threaten to set up in front of Raichu with Dragon Dance.</p> <p><strong>Immune to Electric</strong>: Ground-types such as Hippopotas, Whiscash, Graveler, and Wormadam-G completely stop Raichu when it is locked into an Electric-type move and can hit it back with super effective moves. There are also Pokemon with Electric-absorbing abilities like Pikachu, Emolga, and Raichu that can gain a boost from an Electric-type attack as well. All of these Pokemon have to fear Raichu's coverage, especially Hidden Power Ice.</p> <p><strong>Faster Attackers</strong>: Faster attackers give Raichu a lot of trouble due to its frail bulk. Simisear and Persian naturally outspeed it, making revenge killing it very easy. Choice Scarf users like Grumpig, Mr. Mime, Arbok, and Mienfoo also can come in to revenge kill. Pawniard and Pikachu are also worth noting because they carry strong priority with Sucker Punch and Extreme Speed, respectively, that can greatly damage and possibly elminate Raichu.</p> <p><strong>Special Walls</strong>: Raichu has trouble breaking past some of the premier special walls in the tier such as Grumpig, Muk, and specially defensive Clefairy. These can be overcome depending on which set Raichu chooses.</p>",
    "sets": {
      "Nasty Plot": {
        "description": "<p>Raichu is one of the fastest Pokemon in the tier, and it has a very solid Special Attack stat and great coverage moves to deal with just about anything. After a Nasty Plot, not many Pokemon will want to switch into it. Its Thunderbolt can do great damage to any Electric-weak target and most neutral foes that have middling bulk; examples of these would be Lairon, Simisear, Arbok and Mr. Mime. Hidden Power Ice hits the Ground- and Grass-types that resist Thunderbolt. Focus Blast is used to pick up OHKOs on Pokemon that Thunderbolt or Hidden Power Ice doesn't, like Lairon, Glaceon, and Graveler. Endure with a Salac Berry is an alternative to boost Raichu's Speed and survive Persian's Fake Out, which is useful on hyper offensive teams. When running Salac Berry + Endure sets, you lose out on 2HKOs with Life Orb at +2 against Meganium, Grumpig and Clefairy, but you gain the ability to outspeed Choice Scarf users except for Simisear. Ice Gem picks up the OHKOs on Hippopotas and bulky Shelgon with Hidden Power Ice after a Nasty Plot boost. Lightning Rod is used over Static to come in on opposing Electric-types to gain a free Special Attack boost. Raichu isn't very keen on taking physical attacks anyways.</p> <p>Raichu does well on balance, offensive, or hyper offensive teams looking for a powerful special sweeper. There are very few options that can deal with Raichu, let alone Raichu with a Nasty Plot boost; these options may outspeed it naturally or with a Choice Scarf. Choice Scarf users would be the likes of Arbok, Grumpig, Mienfoo, and Mr. Mime; naturally, Raichu is outsped by Emolga, Simisear, and Persian. Frillish, Shelgon, and Lairon do well against the majority of these checks. Priority moves are also an option against Raichu, such as Pawniard's and Arbok's Sucker Punch, Pikachu's Extreme Speed, or Muk's Shadow Sneak. Pokemon like Lairon, Solrock and Pelipper can come in on these checks. Another choice is Pokemon with great Special Defense like Meganium, Gloom, Ivysaur, Grumpig, and Clefairy that can take a hit at +2, but they won't OHKO it back unless Raichu has been previously weakened. Bulky Whiscash is the only Pokemon that can take a hit from boosted Raichu and OHKO back. Simisear appreciates Raichu as a teammate to help get through the bulky Water-types like Walrein, Staryu, Pelipper, and Frillish. Raichu ideally wants to pair with a Grass-type like Leafeon, Meganium, or Ivysaur to help with Ground-types Hippopotas, Whiscash, and Wormadam-G. It can pair with Poison-types such as Arbok and Muk to handle the bulkier Grass-types mentioned above, which it can't break through with Hidden Power Ice. Raichu also does well with physical wallbreakers like Muk, Leafeon, and Slaking to help break through their respective physical walls.</p>"
      },
      "Choice Specs": {
        "description": "<p>Choice Specs Raichu is a blistering fast and threatening special wallbreaker with the ability to pivot. The boost from Choice Specs makes its STAB Thunderbolt very threatening to any Pokemon that does not resist Electric or is immune to it. Hidden Power Ice helps with the Grass-, Ground-, and Dragon-types it struggles with. Raichu is able to 2HKO most of its Grass-type counters with Hidden Power Ice like Ivysaur and Gloom, and even opposing Raichu after taking Stealth Rock damage. The same goes for its Ground- and Dragon-type counters, as well as Electric-immune Emolga. Focus Blast is a great coverage move to blast through Pokemon such as special defensive Clefairy and Whiscash, which aren't threatened by Thunderbolt. It also helps pick up the OHKO on bulkier Pokemon like Slaking, Lairon, and Glaceon. Volt Switch is a great move to keep up the momentum in battle; it can be used on the Grass or Dragon resistances to bring in a teammate that can deal with it and force progress. Lightning Rod is useful for switching into other Electric-type moves and getting a free +1 boost from the likes of Emolga and opposing Raichu. A Timid nature allows Raichu to naturally outspeed Leafeon and Mr. Mime, but if these matchups are not a concern, a Modest nature can be used instead.</p> <p>Raichu works well on balance or offensive teams looking for a strong special attacker and/or a Volt Switch pivot. Simisear, Arbok, and Muk pair well with Raichu to help with the Grass-types like Meganium, Gloom, and Ivysaur that want to switch in on it, while Ivysaur, Leafeon, Meganium, and Walrein help with the Ground-immune Pokemon that want to stop it such as Hippopotas, Whiscash, and Wormadam-G. There are also Pokemon with abilities to absorb its Electric-type moves like Pikachu, Emolga, and opposing Raichu. Bringing counters for Raichu and Pikachu like Whiscash, Clefairy, and Meganium work well, whereas Solrock, Hippopotas, and Lairon work better for Emolga. Raichu helps teams looking to break physical walls like Solrock, Lairon, and Wormadam-S. It also deals with the Water-types that Simisear might struggle with like Staryu, Walrein, and Pelipper. Usually, it is paired with a pivot like Persian, Mienfoo, or Raticate that draw in some of the previously mentioned physical walls for Raichu to blast through. The Water-types also can use Raichu as a teammate to block Electric-type moves and deal massive damage back to anything that comes in to its +1 boost. Raichu also appreciates entry hazard support in order to turn some previously non-guaranteed OHKOs into surefire knockouts.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "sleid", "user_id": 601970}], "teams": [{"name": "Quality checked by", "members": [{"username": "Gangsta Spongebob", "user_id": 535530}, {"username": "Monai", "user_id": 482455}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}, {"username": "ken", "user_id": 594478}]}]}
  },
  "Clefairy": {
    "comments": "<h1>Other Options</h1> <p>Clefairy's movepool is very expansive, and while there is room to experiment with some of its more fringe options, they won't find consistent use on most teams. Healing Wish has the potential to give a teammate a second life, restoring Pokemon like Whiscash and Shelgon for another chance at a sweep, but Clefairy has trouble fitting such a move into its set, and Healing Wish has the obvious drawback of KOing Clefairy. Magic Coat has the huge upside of reflecting Taunt or Thunder Wave back at the opponent, as well as forcing the opponent to set Stealth Rock against themselves. However, it has very little application outside of denying those two utility moves, and Clefairy can just run Stealth Rock itself. Calm Mind to become a status immune sweeper seems appealing, but Clefairy has extremely low power without a boost and this moveset makes it even weaker to disruption like Taunt, Encore, Thunder Wave, and Knock Off. Clefairy can run mixed EV investment if the team calls for it, but that may compromise its ability to check certain threats.</p> <h1>Checks and Counters</h1> <p><strong>Muk:</strong> Muk is the most consistent counter, absorbing Knock Off, not taking much damage from Seismic Toss, and being able to damage Clefairy significantly with Poison Jab or Fighting-type moves. Muk does eventually get worn down by Seismic Toss and dislikes being hit by Thunder Wave, though.</p> <p><strong>Fighting-Types</strong>: Mienfoo's STAB High Jump Kick and Regenerator give it the ability to switch into Clefairy using Stealth Rock or Seismic Toss and threaten to OHKO it or use one of its utility moves as Clefairy switches out. However, Mienfoo is crippled by Thunder Wave and Knock Off and still loses a huge portion of its HP from Seismic Toss, even if it can heal it off by switching out. Other Fighting-types are very uncommon in the tier, but Pokemon like Pignite can OHKO Clefairy in a similar manner.</p> <p><strong>Item Removal</strong>: Clefairy's bulk gets cut heavily without Eviolite, making Knock Off from attackers like Emolga and Persian an effective way to threaten it. Knock Off also means certain passive walls that Clefairy would otherwise sit on can threaten it, such as Pelipper. Trick and Switcheroo take this a step further, forcing a Choice item onto Clefairy in place of Eviolite.</p> <p><strong>Disruption Moves</strong>: Moves like Taunt and Encore deny Clefairy's utility moves or force it into an option respectively, letting the opponent take advantage of Clefairy. Taunt from Emolga, Persian, and Grumpig are especially common.</p> <p><strong>Strong Wallbreakers</strong>: Despite blanket checking a large portion of the tier, its mediocre stats allow for many threats to muscle past it. Nasty Plot + Focus Blast boosted with a Life Orb or Fighting Gem can overpower even specially defensive Clefairy, with Raichu in particular not having to worry about Thunder Wave thanks to Lightning Rod. Guts attackers like Luxray also cleanly 2HKO even physically defensive Clefairy with Facade, threaten a potential OHKO with Superpower, and don't fear Thunder Wave. Choice Specs and Choice Band users can also punish Clefairy but have to be wary of Thunder Wave and Knock Off for the entire game.</p>",
    "sets": {
      "Physical Wall": {
        "description": "<p>Despite its unimpressive stats and a typing barren of resistances, Clefairy nevertheless is an elite Pokemon in ZU, thanks in huge part to its incredible ability, Magic Guard. A complete immunity to entry hazards and other residual damage, as well as a defensive boost from Eviolite, lets Clefairy become an all-purpose wall, capable of spreading status, disrupting the opponent, and setting up hazards. Seismic Toss is a necessary attack to ensure Clefairy is never too passive, and a guaranteed 100 damage a turn is surprisingly difficult to handle in a tier with low HP totals and where many Pokemon can't afford Leftovers. Knock Off allows Clefairy to remove items from opposing Pokemon, crippling item-reliant staples like Meganium and Grumpig, while absolutely ruining other Eviolite walls like opposing Clefairy, Mienfoo, and Hippopotas. Thunder Wave is a solid alternative that pressures walls as well as allowing Clefairy and its team to outspeed opposing offensive Pokemon. Soft-Boiled is a required move for a wall like Clefairy, keeping it healthy over the course of a game. The last move is very flexible and allows Clefairy to support its team in a myriad of ways. Clefairy can fulfill the necessary function of a Stealth Rock setter for its team, which it is especially effective at thanks to how it dominates Staryu, the best Rapid Spin user in the tier. Encore is one of Clefairy's best tools against offense, preventing even Substitute users like Walrein or Muk from using Clefairy as setup fodder. It also allows Clefairy to generate momentum by forcing Pokemon to repeat utility moves like Stealth Rock or Recover. Heal Bell is another good option if a team cannot fit a different cleric like Aromatherapy Meganium. Wish is an alternative cleric option that keeps Clefairy's team healthy in a more direct way, which Clefairy can afford since it doesn't mind switching around in the face of hazards. The focus on physical bulk allows Clefairy to check the widest range of threats possible thanks to maximum investment and naturally good Special Defense, consistently withstanding even boosted attacks from threats like Swords Dance Kingler and Dragon Dance Shelgon. However, a more mixed spread of 168 Defense and 88 Special Defense with a Careful Nature allows Clefairy to more reliably check special attackers like Walrein while retaining sizeable physical bulk.</p> <p>Clefairy fits best on balance and defensive teams, which make good use of Clefairy's ability to blanket check a huge portion of the tier's attackers while offering a wide range of utility. Solrock is an excellent partner, as it can switch into and cripple the physical attackers that can break past Clefairy's bulk, namely Mienfoo and Muk. Solrock is also not reliant on its item to function and can afford to switch into a Knock Off aimed at Clefairy. In turn, Clefairy comfortably switches into the status moves that try to cripple Solrock such as Scald, Toxic, and Will-O-Wisp. Muk also has good synergy with Clefairy. Muk can switch into Mienfoo and various Knock Off and Trick users targeting Clefairy. In turn, Clefairy can easily switch into the status used to check Muk while supporting Muk with Thunder Wave or Knock Off. If Clefairy lacks Encore, it is liable to become setup fodder for sweepers that can ignore Thunder Wave, like Whiscash or Lum Berry users. Reliable revenge killers like Persian or Choice Scarf Grumpig allow Clefairy to support its team with moves like Stealth Rock and Wish without letting certain threats get out of hand.</p>"
      },
      "Special Wall": {
        "description": "<p>With maximum investment in Special Defense, Clefairy is nearly unparalleled in its ability to check special attackers long term. Magic Guard leaves Clefairy unaffected by the status and entry hazards that hamper Grumpig and Meganium, making it an ideal special wall on stall teams. Seismic Toss gives Clefairy a move to output consistent damage regardless of its attacking stats. Knock Off allows Clefairy to permanently cripple any non-Muk switch-in, cutting off healing from Pokemon reliant on Leftovers or softening walls reliant on Eviolite. Removing a boosting item as a Pokemon switches in can also nullify threats that need the item to break through a wall, such as Light Ball Pikachu and Choice Band Slaking. Soft-Boiled is necessary to keep Clefairy healthy, and it can be used alongside Wish for reliability. Thunder Wave allows Clefairy to hamper offensive Pokemon that could otherwise take advantage of it, like Mienfoo or Muk. Encore is a good option to prevent setup from any Pokemon lacking Taunt, allowing a teammate to switch in without risk. Wish provides support to the team, restoring the health of Pokemon without recovery like Muk, Grumpig, and Simisear. Stealth Rock and Heal Bell are two other potential options, but it isn't difficult to fit those moves on other Pokemon and utility moves like Encore and Wish are very powerful.</p> <p>This Clefairy set fits best on defensive and stall teams that have physically defensive support options, as they allow Clefairy to invest fully in Special Defense to take on hugely powerful special attackers like Nasty Plot Simisear, Calm Mind Grumpig, and Substitute Walrein. Solrock is an all-purpose physical wall that helps answer the Normal- and Poison-types that threaten to break stall teams. Clefairy safeguards Solrock against burns and poison while answering the Grass- and Water-types that switch into Solrock like Meganium, Frillish, and Staryu. Meganium is another excellent defensive staple that pairs quite well with Clefairy. Its incredible mixed bulk and typing let it check the few special sweepers that Clefairy cannot answer, namely Nasty Plot Mr. Mime and Raichu, while securing its team against the dangerous Kingler. In exchange, Clefairy's immunity to residual damage lets it absorb any Scald or Toxic aimed at Meganium, maximizing Meganium's bulk instead of forcing it to waste Aromatherapy PP to keep itself healthy. Wormadam-S is another fixture on stall teams that is especially bolstered by Clefairy's Wish support and ability to easily switch into Scald and Will-O-Wisp. It makes the most out of this support by using its great bulk and typing to check a huge range of threats, notably physical attackers it resists like Shelgon and Persian, as well as Grumpig and Mr. Mime, which can do huge damage to Clefairy with a boosted Focus Blast.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Monai", "user_id": 482455}], "teams": [{"name": "Quality checked by", "members": [{"username": "Gangsta Spongebob", "user_id": 535530}, {"username": "Xrn", "user_id": 317912}]}, {"name": "Grammar checked by", "members": [{"username": "Clouds", "user_id": 356215}, {"username": "ken", "user_id": 594478}, {"username": "deetah", "user_id": 297659}]}]}
  },
  "Mr. Mime": {
    "comments": "<h1>Other Options</h1> <p>Calm Mind can be used to help Mr. Mime set up in front of certain special attackers, though the immediate power of Nasty Plot is generally more useful. While Toxic and Thunder Wave can be used to cripple foes trying to switch in, Mr. Mime generally gets more mileage by either attacking its foe, setting up, or using Trick when holding a Choice item. Encore can be used to create setup opportunities but it has limited utility against offensive foes. Energy Ball OHKOes Whiscash, but it is inferior to Thunderbolt against other Water-types and leaves Mr. Mime struggling to damage Vullaby. Hidden Power Fire slams Wormadam-S and Pawniard, but it causes Mr. Mime to lose one point of Speed, causing it to always be outsped by other base 90 Speed foes.</p> <h1>Checks and Counters</h1> <p><strong>Steel-types</strong>: Lairon and Wormadam-S resist Mr. Mime's Psychic-type STAB moves. The former OHKOes it with Head Smash, but it's OHKOed by Mr. Mime's Fighting-type coverage and can be overwhelmed by Thunderbolt. Mr. Mime cannot hit Wormadam-S for super effective damage while it can wear down Mr. Mime using Bug Bite and Toxic, though its lack of recovery means it can be worn down if hit repeatedly.</p> <p><strong>Priority</strong>: Foes with super effective priority moves, like Muk and Arbok, or especially powerful ones, like Pikachu, can 2HKO Mr. Mime, though they can usually only pick off a weakened Mr. Mime due to their frailty or Psychic-type weakness. While it is OHKOed by Mr. Mime's Fighting-type coverage, Pawniard is immune to Psychic and its Sucker Punch OHKOes Mr. Mime. Persian is another notable foe since it 2HKOes with Fake Out, and thus even at full health, Mr. Mime is unable to strike back.</p> <p><strong>Pursuit</strong>: Slaking and Pawniard can OHKO Mr. Mime as it switches out, and their bulk or typing, respectively, offers them switch in opportunities. They also threaten OHKOes while being faster or using priority.</p> <p><strong>Faster Attackers</strong>: Mr. Mime's terrible physical bulk leaves it losing to most faster physical attackers like Leafeon. Some like Emolga can even OHKO it. While not as reliable as answers, faster special attackers like Simisear and Raichu can also beat most Mr. Mime sets one-on-one.</p> <p><strong>Vullaby</strong>: Vullaby's typing and bulk let it check Choice item variants locked into a Psychic-type move, but it loses to variants carrying Thunderbolt and must watch out for Trick and Focus Blast after Stealth Rock.</p>",
    "sets": {
      "Choice Scarf": {
        "description": "<p>Mr. Mime's high Speed and respectable power make it a solid revenge killer when holding a Choice Scarf. What differentiates it from other Pokemon that perform similar roles, namely the bulkier Psychic-type Grumpig, is access to Healing Wish, which offers players considerable flexibility in how players may use Mr. Mime's teammates with limited longevity. Psychic serves as a spammable STAB move that can 2HKO the tier's plethora of frail offensive threats, like Simisear and Emolga, and Poison-types, like Ivysaur and Muk. It also OHKOes Mienfoo and Arbok. Focus Blast primarily serves as coverage against Steel-types, with it OHKOing Lairon and Pawniard and 3HKOing Wormadam-S. It also serves as coverage against Normal-, Rock-, and Ice-types, 2HKOing foes like Slaking, Graveler, Walrein, and Glaceon and notably OHKOing Persian. Trick cripples walls such as Clefairy and Meganium attempting to check Mr. Mime, though it must be used with caution because the loss of its Choice Scarf robs Mr. Mime of much of its utility. Filter is Mr. Mime's most useful ability, notably letting it always survive certain priority moves like Arbok's Sucker Punch and Muk's Shadow Sneak after Stealth Rock.</p> <p>Mr. Mime best fits as speed control for offensive and balance teams. Teammates such as Shelgon, Leafeon, Arbok, and Walrein greatly appreciate Mr. Mime's Healing Wish support. Given that few Pokemon are OHKOed by its attacks and that it often risks being KOed back due to its poor bulk, Stealth Rock setters like Lairon and Solrock make good partners by helping Mr. Mime wear its foes down into KO range. While much harder to fit on teams, Spikes support from teammates like Shelmet further aids Mr. Mime in this regard. Mr. Mime appreciates the support from walls and tanks such as Solrock, Wormadam-S, and Muk, as they can switch in if Mr. Mime is faced with a foe that it cannot immediately KO. Physical walls are particularly important as priority bypasses Mr. Mime's boosted Speed; Arbok and Muk can KO Mr. Mime after the slightest chip, Pawniard OHKOes it outright, and Persian and Mienfoo can quickly wear Mr. Mime down with Fake Out. Mr. Mime appreciates the support of wallbreakers and stallbreakers like Simisear and Walrein; they can break through the walls it cannot, while in return Mr. Mime can scare off faster threats and heal these allies with Healing Wish. Some walls also notably appreciate Healing Wish, namely those with no reliable recovery, like Wormadam-S, and slower walls that can be forced out at low health, like Frillish.</p>"
      },
      "Nasty Plot": {},
      "Choice Specs": {
        "description": "<p>With Choice Specs, Mr. Mime is a dangerous wallbreaker with respectable Speed. Psyshock serves as a spammable STAB move that threatens the majority of the tier. It targeting the opponent's Defense is important, as Mr. Mime is traditionally checked by special sponges and Psychic-types; Psyshock notably OHKOes Muk, 2HKOes specially defensive Clefairy and opposing Mr. Mime, and 3HKOes Munchlax and offensive Grumpig variants. Psychic is an alternative that hits physical walls like Shelgon much harder. Focus Blast primarily targets Steel-types, OHKOing Lairon and Pawniard and 2HKOing Wormadam-S. Focus Blast has the added benefit of also targeting Rock-, Normal-, and Ice-types, OHKOing notable foes like Graveler, Slaking, and Glaceon. Hidden Power Fighting is a more accurate alternative that still OHKOes Lairon and Pawniard, though it only 2HKOes most foes weak to Fighting, leaves Mr. Mime unable to 2HKO certain Pokemon like Wormadam-S, and causes it to lose 1 point in Speed, which leads to it being outsped by opposing base 90 Speed foes, namely Abra and opposing Mr. Mime. Thunderbolt 2HKOes Vullaby and Frillish, two Pokemon Mr. Mime otherwise struggles against. Trick can be used to cripple walls like Wormadam-S trying to switch into Mr. Mime; Healing Wish is an alternative that lets Mr. Mime sacrifice itself to heal a teammate such as Walrein and Lairon. Filter is Mr. Mime's most useful ability, as while Mr. Mime is still extremely frail, it can dodge the OHKO from certain super effective attacks like Leafeon's Life Orb-boosted X-Scissor and Arbok's +1 Sucker Punch.</p> <p>Mr. Mime best fits on offensive and balance teams looking for a potent wallbreaker. Certain special walls like specially defensive Grumpig and Meganium can wall Mr. Mime, so physical wallbreakers like Kingler and Pikachu and stallbreakers like Walrein and Taunt Emolga work well as partners. Mr. Mime is extremely frail, especially on the physical side, so it's easily revenge killed by faster foes and priority users like Leafeon and Pikachu, respectively. Thus, physical walls and tanks like Solrock, Wormadam-S, bulky Mienfoo, and Lairon are key partners. Checks to Pawniard, like the latter two, are especially important, as it can OHKO Mr. Mime with Sucker Punch and is difficult to wear down due to its resistance to Stealth Rock. Mr. Mime's frailty gives it trouble switching in, so pivots like Vullaby and the aforementioned Mienfoo help in that regard.</p>"
      },
      "Dual Screen": {}
    },
    "credits": {"writtenBy": [{"username": "Gangsta Spongebob", "user_id": 535530}], "teams": [{"name": "Quality checked by", "members": [{"username": "Monai", "user_id": 482455}, {"username": "5Dots", "user_id": 543866}, {"username": "Mirbro", "user_id": 451786}, {"username": "sleid", "user_id": 601970}]}, {"name": "Grammar checked by", "members": [{"username": "Tbolt", "user_id": 555379}, {"username": "red fintans", "user_id": 637479}]}]}
  },
  "Meganium": {
    "sets": {
      "Specially Defensive": {
        "description": "<p>Meganium is the best cleric ZU has to offer, owing to its great bulk, utility, and access to reliable recovery. Giga Drain can make up for Meganium's passivity, discouraging threats like Persian and Kingler from staying in on it. Aromatherapy allows Meganium to sponge status while supporting status-vulnerable teammates like Solrock, Frillish, and Leafeon. Dragon Tail racks up residual damage and stops sweepers not running Substitute, like Grumpig, Leafeon, and Pawniard. Alternatively, Earthquake provides a stronger hit against Steel-, Poison-, and Fire-types like Lairon, Muk, and Simisear.</p> <p>Meganium is a staple on balance and defensive teams alike, bringing great bulk and cleric support to the table. To shore up its vulnerability to physical attackers, physical walls like Solrock, Wormadam-S, and Shelgon are recommended to switch into physically offensive Pokemon like Mienfoo, Arbok, and Emolga. In return, Meganium can keep special attackers and status spreaders like Grumpig, Raichu, Staryu, and Frillish at bay. Even with Earthquake, Meganium is vulnerable to Simisear and Poison-types like Arbok and Muk; Frillish stands out as an excellent partner thanks to resisting both of their types and providing great mixed defenses. Pokemon resistant to Fire or Poison, like Grumpig or Hippopotas, can shield Meganium from said attacks. Entry hazard setters like Solrock, Wormadam-S, and Hippopotas can help rack up more residual damage, which synergies well with Dragon Tail and makes it more difficult for sweepers not carrying Substitute, like Leafeon and Grumpig, to stay healthy and set up. Although Spikes setters like Shelmet and Pineco are very niche, they can mix well with Meganium phazing foes with Dragon Tail.</p>"
      },
      "Swords Dance": {
        "description": "<p>Swords Dance lures unsuspecting checks off guard, surprising them with boosted attacks. At +2, Seed Bomb can OHKO offensive Grumpig and 2HKO specially defensive Clefairy and Hippopotas after Stealth Rock.  Earthquake 2HKOes Poison-types like Muk and Arbok after Stealth Rock while also 2HKOing Lairon and Pawniard. It also OHKOes Emolga that have used Roost, as well as Raichu after Stealth Rock. Return is an alternative, being its strongest option against Emolga, Leafeon, and opposing Meganium. Synthesis gives it extra longevity as a sweeper.</p> <p>In addition to fitting on balance teams, this set can also fit well on offensive teams to highlight its offensive prowess. It can lure unsuspecting targets like Muk and Pawniard, though more caution is required to not take their attacks due to Meganium's relative lack of bulk. Faster attackers like Simisear and Emolga remain problematic, so dedicated walls like Frillish and Hippopotas are appreciated to give Meganium a safety net against those attackers. Special attackers like Grumpig and Simisear can help break through walls like Muk, Wormadam formes, and opposing Meganium. Stallbreakers like Persian, Emolga, and Frillish can all use Taunt to prevent walls from using status, enabling Meganium to have a much easier time wallbreaking or cleaning.</p>"
      },
      "Choice Specs": {}
    },
    "credits": {"writtenBy": [{"username": "5Dots", "user_id": 543866}], "teams": [{"name": "Quality checked by", "members": [{"username": "Mirbro", "user_id": 451786}, {"username": "Gangsta Spongebob", "user_id": 535530}, {"username": "sleid", "user_id": 601970}]}, {"name": "Grammar checked by", "members": [{"username": "Tbolt", "user_id": 555379}, {"username": "Tea Guzzler", "user_id": 577920}]}]}
  },
  "Granbull": {"sets": {"Choice Band": {}}},
  "Marshtomp": {"sets": {"Bulky Stealth Rock": {}}},
  "Exploud": {"sets": {"Special Attacker": {}, "Choice Band": {}}},
  "Kecleon": {"sets": {"Special Wall": {}}},
  "Pignite": {"sets": {"Tank": {}}},
  "Simisear": {
    "sets": {
      "Nasty Plot": {},
      "All-Out Attacker": {},
      "Choice Scarf": {
        "description": "<p>Holding a Choice Scarf, Simisear outspeeds every other viable Choice Scarf user besides Persian and common setup sweepers at +2 Speed like Lairon and Whiscash, a trait that makes it a solid revenge killer when combined with its high power and diverse movepool. Flamethrower serves as a spammable STAB move that threatens nearly every foe that doesn't resist Fire or is extremely specially bulky. Fire Blast is an alternative, trading accuracy and PP for higher damage ranges. The boost in power also allows Simisear to OHKO a few foes Flamethrower fails to like Choice Band Lairon and a chance to OHKO Emolga. Overheat is Simisear's most powerful attack, turning Fire Blast's ranges into guarantee OHKOs while also having a chance to OHKO certain foes like Persian and pivot Mienfoo. However, Overheat's Special Attack drop makes it not very spammable, leading to a more spammable Fire-type option being necessary. Hidden Power Grass's purpose is to 2HKO Whiscash, with the added benefit of OHKOing Graveler and threatening other Water-types, notably 2HKOing Staryu. Focus Blast targets Normal-types, 2HKOing physically defensive Clefairy and Slaking; it also OHKOes all Lairon variants and 2HKOes Walrein. Blaze is Simisear's only useful ability when it isn't holding a berry, and while difficult to activate due to Simisear's frailty, the boost to its Fire-type STAB moves can allow it to perform feats like always OHKOing Persian with Flamethrower and Raichu and Arbok with Fire Blast.</p> <p>Simisear best fits on offense and balance teams looking for speed control. Simisear's frailty and inability to switch moves necessitates a strong defensive backbone, a role that can be fulfilled by partners like Solrock, Meganium, Staryu, and Clefairy. Physical walls and tanks are especially important, as Simisear is very vulnerable to priority, notably Persian's Fake Out, but also moves like Arbok's Sucker Punch and Pikachu's Extreme Speed. Simisear lacks the power to reliably break through certain walls and tanks like Frillish and specially defensive Clefairy. Physical wallbreakers like Lairon and Muk and stallbreakers like Grumpig and Walrein work well as checks to them. Given that many of Simisear's checks rely on Eviolite for their bulk or Leftovers for recovery, Knock Off users like Mienfoo and Persian can cripple its checks and make them more susceptible to being worn down or broken through. Entry hazard support, primarily Stealth Rock from setters like Solrock and Lairon, works excellently in wearing down all of Simisear's offensive and defensive checks barring Clefairy. If its checks are removed and the opposing team is sufficiently weakened, Simisear can sometimes be used as late-game cleaner. Simisear's weakness to Stealth Rock hurts its longevity; on offensive teams, a speedy Taunt user like Persian can try to stop them from being set, while slower teams can use spinners like Staryu to remove them.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Gangsta Spongebob", "user_id": 535530}], "teams": [{"name": "Quality checked by", "members": [{"username": "Mirbro", "user_id": 451786}, {"username": "Monai", "user_id": 482455}]}, {"name": "Grammar checked by", "members": [{"username": "ken", "user_id": 594478}]}]}
  },
  "Leavanny": {"sets": {"Agility": {}}},
  "Venipede": {"sets": {"Hazard Setter": {}}},
  "Lampent": {"sets": {"Calm Mind": {}, "Choice Specs": {}, "Stallbreaker": {}}},
  "Arbok": {
    "comments": "<h1>Other Options</h1> <p>Shed Skin is an option to mitigate status, but Intimidate weakening physical attackers is generally more useful, and Shed Skin is unreliable. Substitute is another option for Coil Arbok to dodge status, though it hates having to give up one of its coverage moves or Sucker Punch. Arbok can act as a wallbreaker with Choice Band or speed control with Choice Scarf, though it's outclassed in both roles.</p> <h1>Checks and Counters</h1> <p><strong>Ground-types</strong>: Hippopotas takes minimal damage even from boosted super effective attacks, has reliable recovery in Slack Off, and threatens Arbok with Earthquake or Whirlwind. Even after a Coil, Wormadam-G or Graveler can tank an Aqua Tail or Seed Bomb and threaten Arbok back with Earthquake.</p> <p><strong>Steel-types</strong>: Without Earthquake or Aqua Tail, Arbok struggles to hurt Steel-types like Lairon and Pawniard, which can easily overwhelm Arbok with their powerful attacks. Wormadam-S is another effective check, as it is not weak to any of Arbok's coverage moves and can hit back hard with Psychic or Hidden Power Ground.</p> <p><strong>Solrock</strong>: If Arbok lacks Aqua Tail or Seed Bomb, Solrock can easily switch in and threaten to burn Arbok with Will-O-Wisp, and it can stay healthy with Morning Sun. Even with super effective coverage and a Coil boost, Arbok cannot OHKO Solrock. However, Arbok has an easier time breaking through offensive Solrock sets, as they have a harder time tanking its attacks and can be removed by Sucker Punch.</p> <p><strong>Water-types</strong>: If Arbok lacks Seed Bomb, Frillish stonewalls it, while Whiscash can overwhelm it one-on-one. Even with Seed Bomb, Frillish can threaten to burn Arbok before it gets enough boosts to KO it.</p> <p><strong>Faster Threats</strong>: Choice Band Slaking can outspeed and OHKO even a boosted Arbok while taking minimal damage from its Sucker Punch. Naturally faster threats like Simisear and Emolga, alongside Choice Scarf users like Mr. Mime and Kingler, can outspeed Arbok, tank a boosted Sucker Punch, and revenge kill it. However, if they face Arbok at full health, they will likely lose one-on-one, and entry hazards can bring them into Sucker Punch range. Persian's Fake Out out-prioritizes Sucker Punch and is thus able to pick off a weakened Arbok.</p>",
    "sets": {
      "Coil": {
        "description": "<p>Coil makes Arbok a dangerous sweeper, and its accuracy boost makes Arbok's STAB move, Gunk Shot, more reliable. Earthquake primarily targets Steel-types like Lairon and Pawniard, and it has the added benefit of breaking through opposing Arbok, though picking it leaves Arbok struggling against Ground-types and Solrock. Alternatively, Aqua Tail still provides super effective coverage against most Rock- and Ground-types while still doing high damage to Pawniard, though it leaves Arbok unable to break through Whiscash and Frillish before they can KO or cripple it back. Seed Bomb retains super effective damage against Solrock and Ground-types while also threatening Whiscash and Frillish, though now Arbok has no effective way to damage Steel-types, and Frillish can still threaten Arbok if not weakened prior. Sucker Punch lets Arbok pick off faster threats like Persian and Simisear, as well as threatening Choice Scarf Psychic-types like Grumpig and Mr. Mime. Intimidate lets Arbok find more setup opportunities by weakening opposing physical attackers.</p> <p>Arbok best fits on offensive teams looking for an effective wincon that can set up on certain important physical attackers, such as Muk or Mienfoo. Based on its choice of coverage, Solrock, Steel-types, or Ground-types tend to be able to wall it. Water-types such as Staryu and Whiscash serve as effective checks to Solrock and most Pokemon of these types, Grass-types such as Leafeon and Meganium can also handle Solrock and Ground-types, and Mienfoo and Hippopotas can handle Steel-types as well. The aformentioned Grass-types also help against Frillish and Whiscash if Arbok forgoes Seed Bomb. Stealth Rock support from setters such as Solrock and Lairon is essential for getting faster threats like Simisear and Mr. Mime into Sucker Punch range. While much harder to fit on teams, Spikes support from the likes of Pineco or Shelmet also greatly aids Arbok in these matchups, especially with preventing Persian from repeatedly switching in to wear Arbok down with Fake Out. Other offensive threats like Kingler and Raichu can soften up the opposing team to aid Arbok's endgame sweep.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Gangsta Spongebob", "user_id": 535530}], "teams": [{"name": "Quality checked by", "members": [{"username": "Monai", "user_id": 482455}, {"username": "Mirbro", "user_id": 451786}]}, {"name": "Grammar checked by", "members": [{"username": "Clas", "user_id": 545372}, {"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Corsola": {"sets": {"Physical Wall": {}}},
  "Pelipper": {
    "sets": {
      "Defensive Pivot": {
        "description": "<p>Pelipper sets itself apart from other pivots and Water-types, such as Vullaby, Mienfoo, and Frillish, thanks to its unique defensive typing letting it take on Pokemon like Kingler, Pawniard, and Flareon at the same time, not relying on Eviolite to function at its fullest potential, and having neat utility options such as Scald, U-turn, Roost, and Knock Off, the latter of which allows Pelipper to remove Clefairy's Eviolite. Scald's burn chance combined with Pelipper's decent physical bulk makes it difficult for physical attackers such as Kingler and Persian to take on Pelipper. Knock Off allows Pelipper to cripple Pokemon such as Clefairy, Mienfoo, and Frillish that rely on their Eviolite to function at their highest potential. Alternatively, Toxic can be opted for instead, putting Pokemon such as Dragon Dance Shelgon and Solrock on a timer, but means Pelipper has a harder time breaking though Pokemon such as Clefairy. Rain Dish is generally useless, but it can help against the occasional rain teams.</p> <p>Pelipper is generally seen on balance teams needing a reliable pivot. Pelipper's best teammates are generally ones that appreciate having a pivot to tank hits for them and allow them to come in safely as well as Pokemon that help negate Pelipper's weaknesses. Pokemon like Persian, Raichu, and Emolga can form a powerful pivot core with Pelipper. Setup sweepers such as Kingler, Lairon, and Muk enjoy having Pelipper as a teammate to help get them in safely to attempt a sweep. Special tanks such as Clefairy and Meganium can form a solid defensive core with Pelipper, with Pelipper checking foes like Magmar, Pawniard, and Beartic while Clefairy and Meganium check threats like Raichu and Pikachu. Ground-types such as Hippopotas and Graveler are also useful partners to have, as they help with Pelipper's weaknesses to common Electric- and Rock-type attacks. Pelipper's weakness to Stealth Rock makes it difficult to get in safely often, so spinners like Staryu can be helpful to have. If Pelipper has decided to drop Knock Off in its moveset, then a way to take advantage of Clefairy is necessary. Mienfoo, Muk, and Whiscash can threaten Clefairy and force it out.</p>"
      },
      "Offensive Pivot": {},
      "Agility": {
        "description": "<p>After an Agility, Pelipper outspeeds the entire unboosted metagame, and when combined with its nice STAB options, Pelipper can operate as a solid sweeper. Hydro Pump is a valuable STAB attack, hitting Pokemon such as Solrock, Simisear, and Lairon. Hurricane hits Pokemon that otherwise tank Hydro Pump, like Grass-types such as Meganium and Leafeon, as well as Walrein, and it is aided by being perfectly accurate under rain. Air Slash can be opted for instead, trading off power and accuracy in rain for a more reliable STAB move outside of it. Pelipper most commonly runs Roost in the final moveslot, allowing it to recover HP on Pokemon that don't immediately threaten it such as Clefairy or Frillish. Alternatively, Knock Off can remove Eviolite from Pokemon such as Staryu, Frillish, and Clefairy, weakening them for Pelipper or its teammates to break through them. Water Gem is generally preferred, allowing it to have a one-time boost on Hydro Pump and notably allows it to OHKO Pokemon it otherwise couldn't such as Raichu and Persian, as well as physically defensive Clefairy in rain. Alternatively, Leftovers can be used to mitigate damage, while Lum Berry allows Pelipper to set up on Pokemon attempting to status it, such as Clefairy and Frillish. Rain Dish allows Pelipper to have a bit of extra recovery under rain.</p> <p>Agility Pelipper fits best on rain teams, as well as offense and balance teams looking for a solid sweeper. When Pelipper is used on a rain team, rain setters like Emolga and Illumise are required partners. Wallbreakers on rain teams like Raichu, Kingler, and Beartic can break down threats for Pelipper to win in the endgame. Pelipper's most direct threats are Electric-types like Emolga and Raichu, so Pokemon like Solrock and Graveler that can check them are great partners to have. Pivots like Persian and Mienfoo can give Pelipper a safe switch to setup. Whiscash is a notable partner; it can remove Pokemon like Emolga and Solrock that Pelipper can struggle against, and Pelipper can remove threats like Leafeon, Gloom, and Staryu for Whiscash. Other special attackers like Simisear and Mr. Mime can partner up with Pelipper to help take down their shared checks like Clefairy and Muk. If Pelipper is running Knock Off, Pokemon like Kingler and Lairon appreciate Pelipper knocking off their checks to help them break through easier.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Bella", "user_id": 567483}], "teams": [{"name": "Quality checked by", "members": [{"username": "Monai", "user_id": 482455}, {"username": "Gangsta Spongebob", "user_id": 535530}]}, {"name": "Grammar checked by", "members": [{"username": "Tbolt", "user_id": 555379}, {"username": "red fintans", "user_id": 637479}]}]}
  },
  "Illumise": {"sets": {"Sun Setter": {}}},
  "Lunatone": {"sets": {"Calm Mind": {}}},
  "Solrock": {
    "comments": "<h1>Other Options</h1> <p>Physically defensive Solrock sets can invest in 176 Speed EVs to outspeed Adamant Pawniard and burn it, though the drop in Solrock's bulk is significant. Light Screen and Reflect let Solrock act as a dual screens setter on hyper offense teams, though having to fit both leaves it with four-moveslot syndrome. Calm Mind is an enticing option when paired with Solrock's diverse special movepool, which includes Flamethrower, Fire Blast, Earth Power, and Shadow Ball. However, Solrock's unboosted Special Attack is abysmal, and Solrock lacks a good special Rock-type STAB move. Additionally, as a special attacker, Lunatone outperforms Solrock.</p> <h1>Checks and Counters</h1> <p><strong>Physical Walls</strong>: Physically defensive Pokemon like Clefairy and Hippopotas don't mind most of Solrock's attacks and can overwhelm it with chip damage or status. However, they must be wary of the power of Choice Band and Explosion, and all but Clefairy don't like taking Will-O-Wisp.</p> <p><strong>Water-types</strong>: Kingler and Pelipper outspeed and OHKO most Solrock variants. However, they must be wary of Solrock's attacks, and physical attackers must be very afraid of Will-O-Wisp. Some Water-types like Whiscash and Frillish can't outspeed Solrock, but in return they don't mind anything it uses against them besides Choice Band-boosted attacks and Will-O-Wisp.</p> <p><strong>Grass-types</strong>: Leafeon outspeeds and OHKOes Solrock with Leaf Blade. While they are slower, Meganium and Ivysaur can wall most Solrock variants and even use Aromatherapy to remove the burns Solrock spreads. However, all these foes must be wary of Choice Band-boosted attacks and Flying Gem-boosted Acrobatics.</p> <p><strong>Status</strong>: Defensive Solrock sets lose most of their effectiveness when poisoned and offensive sets still hate the hit to their longevity. Burn completely cripples offensive sets and annoys defensive sets with chip. While defensive sets don't mind paralysis that much, they still dislike their inability to outspeed certain wallbreakers, while offensive sets suffer greatly as they're much more reliant on their Speed to function.</p> <p><strong>Taunt Users</strong>: While most Taunt users don't like taking Solrock's Rock-type STAB move, they can deny a weakened Solrock a chance to recover health or set up.</p>",
    "sets": {
      "Physical Wall": {
        "description": "<p>Solrock's combination of solid bulk, Morning Sun, and Rock typing with Levitate make it an elite physical wall. It can check a plethora of top-tier offensive threats, such as Emolga, Muk, Arbok, and the best Pokemon in the tier, Persian. Due to how common the Pokemon it walls are, Solrock can effortlessly find opportunities to set up Stealth Rock, making it among the best setters in the tier. Rock Slide is Solrock's preferred Rock-type STAB move due to its solid accuracy and ability to flinch Clefairy, though Stone Edge can be used instead for its higher damage, notably scoring a 2HKO on Persian. Earthquake primarily targets Steel-types like Lairon and Pawniard and certain Poison-types like Arbok and Muk. Will-O-Wisp is an alternative over either attacking move, as it's a strong catch-all tool that lets Solrock cripple the physical attackers it's tasked with checking, mitigating the hole it leaves in Solrock's coverage. Rocky Helmet is used to wear down opposing physical attackers, notably targeting users of U-turn, though Leftovers can be held instead to make Solrock itself less susceptible to being worn down. 16 Speed EVs let Solrock outspeed Adamant Lairon, with the rest being used to maximize physical bulk.</p> <p>Solrock is a perfect fit on defensive, balance, and bulky offense teams looking for a reliable check to most physical attackers. Notably, every team needs some check to Persian, a role Solrock is superb at. While Solrock pairs well with the majority of the tier due to the sheer volume of Pokemon it checks, it's a notably excellent partner to physically frail Pokemon like Persian and Simisear, which enjoy having a sturdy defensive backbone. Solrock needs the support of wallbreakers like Muk and Kingler, as it lacks the firepower to reliably break through bulky foes like physically defensive Clefairy and Meganium. Solrock's mediocre special bulk leaves it losing to most special attackers, so a special sponge like Muk or specially defensive Clefairy pairs well with it. Solrock also can't wall Water- and Grass-types, so checks to them like Ivysaur and Meganium are good partners as well.</p>"
      },
      "Rock Polish": {
        "description": "<p>Rock Polish and high Attack make Solrock an effective sweeper, while its typing combined with Levitate let it set up on common offensive foes like Persian, Muk, and Emolga. EdgeQuake threatens the majority of the tier for significant damage. Flying Gem combined with Acrobatics gives Solrock the means to threaten EdgeQuake's best switch-ins, namely Grass-types like Leafeon and Fighting-types like Mienfoo.</p> <p>Solrock best fits on offensive teams looking for a cleaner. Solrock struggles the most against physical walls that don't mind its coverage, like physically defensive Clefairy, Wormadam-S, and physically defensive Solrock. Thus, checks to them, like special wallbreakers such as Simisear, or stallbreakers such as Grumpig, are essential partners. Some physically bulky Grass-types like Meganium and Ivysaur can tank a Flying Gem-boosted Acrobatics at full health, so teammates that can handle them like Muk and the aforementioned Simisear are also needed. These Grass-types are also great partners to Solrock, as they check Water-types like Whiscash and Kingler, which can tank whatever attacks Solrock throws at them.</p>"
      },
      "Suicide Lead": {
        "description": "<p>Solrock's decent Speed, good defensive traits, and access to Stealth Rock make it a great suicide lead. EdgeQuake coverage lets Solrock threaten the majority of the tier for decent damage, preventing it from being set up on. This combination also makes it harder for Taunt users like Persian to stop Solrock from setting up Stealth Rock. Explosion lets Solrock deal heavy damage to its target and maintain momentum by sacrificing itself. A Focus Sash can be used to augment Solrock's reliability in setting up Stealth Rock, though a Normal Gem can be used instead to increase the power of Explosion, making it a more threatening attack.</p> <p>Since it's a dedicated lead, Solrock should exclusively be used on hyper offense teams, paired with setup sweepers like Whiscash and Grumpig. Getting up Stealth Rock is particularly important for stopping Persian, which can otherwise continually switch in and use Fake Out to wear down these teammates with impunity. Persian, Emolga, and Grumpig are notable examples of Taunt users that can prevent Solrock from setting up Stealth Rock. Stone Edge can take out the former two, though if faced with the latter in Team Preview, it's usually best that Solrock be kept in the back until it can find an opportunity to set up Stealth Rock later. If it's not holding a Focus Sash, Solrock can be outsped and OHKOed by some Water- and Grass-types like Kingler and Leafeon. If these foes are spotted in Team Preview, it's recommended that Solrock be reserved for the mid-game, letting teammates like Raichu and Leafeon deal with Water-types, while teammates like Simisear and Arbok take care of Grass-types.</p>"
      },
      "Choice Band": {
        "description": "<p>High Attack, usable Speed, and solid coverage combined with Solrock's inherently good defensive traits make it an effective wallbreaker when holding a Choice Band. Its STAB Stone Edge and Zen Headbutt threaten the majority of the tier, and its coverage is rounded off with Earthquake, which super effectively hits Steel-types that resist both. Explosion lets Solrock sacrifice itself to deal massive damage to any non-Ghost-, Rock-, or Steel-type target, though Rock Slide can be used instead as a more accurate Rock-type STAB move, which has the added benefit of breaking through certain physical walls like Clefairy with some luck.</p> <p>Solrock best fits on offense and balance teams, acting as a physical wallbreaker that can use its defensive profile to check a variety of top offensive threats like Persian, Emolga, and Muk. It appreciates pivots like Mienfoo or Emolga, as they can help it switch in and thus maintain its health. Solrock struggles the most against physical walls like Meganium, physically defensive Clefairy, and opposing Solrock, so special wallbreakers and stallbreakers like Simisear and Grumpig pair well with it. Faster foes like Kingler and Leafeon can outspeed and OHKO Solrock, so generally bulky Pokemon like Frillish and Ivysaur are necessary partners.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Gangsta Spongebob", "user_id": 535530}], "teams": [{"name": "Quality checked by", "members": [{"username": "Monai", "user_id": 482455}, {"username": "Mirbro", "user_id": 451786}]}, {"name": "Grammar checked by", "members": [{"username": "berry", "user_id": 226455}, {"username": "WrathoftheLeopard", "user_id": 511181}, {"username": "Adeleine", "user_id": 517429}, {"username": "ken", "user_id": 594478}, {"username": "UT", "user_id": 523866}]}]}
  },
  "Chimecho": {"sets": {"Physical Wall": {}, "Calm Mind": {}}},
  "Wormadam-Sandy": {"sets": {"Utility": {}}},
  "Wormadam-Trash": {"sets": {"Physical Wall": {}}},
  "Vanilluxe": {"sets": {"Choice Scarf": {}, "Autotomize": {}, "Choice Specs": {}}},
  "Beartic": {"sets": {"Rain Sweeper": {}}},
  "Vibrava": {"sets": {"Defensive": {}}},
  "Leafeon": {
    "comments": "<h1>Other Options</h1> <p>Leafeon can also run Substitute or Endure over Synthesis on its Swords Dance set with Salac Berry. This makes Leafeon a very dangerous late-game cleaner for hyper offensive teams that outspeeds almost every Pokemon in the tier, barring Choice Scarf Raichu and Simisear. The downside to running this set is that Leafeon loses its longevity and niche as a bulky Swords Dance user.</p> <h1>Checks and Counters</h1> <p><strong>Grass- and Poison-types</strong>: Cleric Leafeon can have a tough time dealing with the likes of Meganium, Arbok, Muk, Ivysaur, Gloom, and even opposing Leafeon due to its lack of coverage. Swords Dance Leafeon needs a Normal Gem to threaten Poison- and Grass-types from high health, and otherwise they can hit it super effectively or phaze it.</p> <p><strong>Special Attackers</strong>: Leafeon is susceptible to special attackers due to its middling HP and Special Defense stats. Faster Pokemon such as Choice Scarf Mr. Mime, Grumpig, Gastly, and Glaceon, or Simisear and Raichu, can come in and immediately threaten it. Some of these can be circumvented by running the Substitute + Salac Berry variant. Some bulkier special attackers can come in on Leafeon's Swords Dance and KO it back after taking a hit; these would include Ivysaur, Gloom, Lampent, and Magmar.</p> <p><strong>Wormadam-S</strong>: Wormadam-S's Bug / Steel typing completely blanks Leafeon. Wormadam-S can wear it down quickly with Toxic and Protect. However, Substitute Leafeon variants can get past this Pokemon, as long as it doesn't run Bug Bite.</p> <p><strong>Faster Revenge Killers</strong>: Persian can come in on Leafeon and deal massive damage with Fake Out + Return or U-turn. Leafeon must be healthy in order to survive these hits back-to-back and heal off the damage. Emolga can OHKO with Flying Gem + Acrobatics; it also comes very close without the use of Flying Gem.</p>",
    "sets": {
      "Swords Dance": {
        "description": "<p>Swords Dance Leafeon is a threatening setup sweeper due to its great Attack and Speed stats. It has solid bulk, allowing it to come in and set up against passive walls or weaker physical attackers, like Clefairy, Hippopotas, Graveler, or Munchlax. Using Lum Berry can help Leafeon safely set up against any of these more passive Pokemon reliant on status, like Solrock and Frillish. Leaf Blade deals massive damage to bulky neutral targets such as Lairon, Wormadam-G, and Pelipper. The high critical hit ratio can also assist in breaking through the aforementioned setup targets. Return or Double-Edge can help it break through the Poison-types and Grass-types that resist Leaf Blade. When carrying the Normal Gem, Leafeon can OHKO those Grass-resistant foes with a Normal-type move after setting up one Swords Dance; it is worth noting that Return won't always OHKO Muk, Meganium, or opposing Leafeon at full health in this instance, whereas Double-Edge always will. Alternatively, X-Scissor is optimal for hitting opposing Grass- and Psychic-types really hard without the concern of Double-Edge recoil damage, but Leafeon struggles to damage Muk and Arbok without a Normal-type move. Synthesis is great for Leafeon's longevity, keeping it healthy to set up against the previously mentioned Pokemon that it wants to come in on.</p> <p>Leafeon thrives on balance and offensive teams looking for a reliable sweeper that can take a hit or two. It appreciates teammates like Solrock or Graveler to take hits from the faster physically offensive Pokemon such as Emolga and Persian. Special walls such as Clefairy and Grumpig can deal with the faster Raichu and Simisear. Depending on its coverage move, Leafeon can struggle against some combination of Grass-, Poison- and Steel-types. Leafeon pairs well with Muk, Grumpig, Simisear, and Arbok, which can help deal with walls of these types, some of the few it struggles to break through. These walls include Meganium, Muk, Ivysaur, and Wormadam-S. Simisear in particular works well with Leafeon, as it can bring in the Water- and Rock-types that Leafeon likes to setup on. Leafeon also has strong synergy with other physical sweepers like Shelgon and Whiscash, as Leafeon and them can pressure each other's shared checks.</p>"
      },
      "Cleric": {
        "description": "<p>Leafeon can work well defensively on teams looking for a cleric and Wish support. Its fantastic Defense allows it to wall many physical attackers that can't hit it for super effective damage such as Mienfoo, Lairon, Slaking, and many Persian sets. Wish does a great job at keeping its teammates healthy, allowing them more opportunities to break down the opposing team. Protect ensures Leafeon can receive the healing it needs from Wish, or you can opt to run Synthesis instead to regain immediate health if it can't afford to use Wish and wait a turn. Heal Bell is for curing Leafeon and its teammates of status conditions. Leaf Blade is still a strong STAB move despite the lack of Attack investment, and it keeps Leafeon from being incredibly passive.</p> <p>Cleric Leafeon does best on bulky and balance teams. It is able to sit in on Pokemon like Solrock, Meganium, Hippopotas, and Vibrava while later curing status with Heal Bell. This means it can pass Wishes with little to no drawback to an offensive Pokemon with a favorable matchup against them like Glaceon, Grumpig, Walrein, or Pelipper. Cleric Leafeon really appreciates being paired with Pokemon such as Simisear, Muk, Emolga, and Arbok that can deal with foes that resist its Leaf Blade. It does well at providing teams with longevity when they otherwise wouldn't be able to outlast bulkier teams that attempt to wear them down with status conditions or other notable chip damage.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "sleid", "user_id": 601970}], "teams": [{"name": "Quality checked by", "members": [{"username": "Gangsta Spongebob", "user_id": 535530}, {"username": "Monai", "user_id": 482455}]}, {"name": "Grammar checked by", "members": [{"username": "Clouds", "user_id": 356215}, {"username": "memesketch", "user_id": 537558}, {"username": "deetah", "user_id": 297659}, {"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Glaceon": {"sets": {"Choice Specs": {}, "Choice Scarf": {}}},
  "Raticate": {"sets": {"Guts Attacker": {}, "Choice Scarf": {}}},
  "Fearow": {"sets": {"Choice Band": {}, "Choice Scarf": {}}},
  "Sandshrew": {"sets": {"Hazard Utility": {}}},
  "Gloom": {"sets": {"Physically Defensive": {}}},
  "Persian": {
    "comments": "<h1>Other Options</h1> <p>Persian has an enormous suite of tools, but many of its other options are not worthwhile. Persian could opt for Leftovers over Silk Scarf to remain healthy in the face of Stealth Rock and Rocky Helmet, but it appreciates the power boost from Silk Scarf a lot. Persian could make use of Choice Band to immediately threaten OHKOs with its Double-Edge, but Silk Scarf has higher damage, if the foe takes a Fake Out and Double-Edge, and Slaking effectively outclasses it. Nasty Plot seems appealing to turn the fastest Pokemon in the tier into a setup threat, but Persian lacks reliable setup opportunities and is completely stuffed by common specially defensive Pokemon like Clefairy and Muk. Substitute on a predicted sacrificial switch Pokemon could potentially be very rewarding, but Persian appreciates all of its moveslots, and it still gets walled easily based on its coverage. Sun is a notably less consistent option than Rain, but on Sun teams, Persian is invaluable support for its speedy Sunny Day and U-turn.</p> <h1>Checks and Counters</h1> <p><strong>Rock and Steel-types</strong>: Persian is checked very reliably by Rock- or Steel-types like Lairon, Solrock, and Graveler. However, all 3 take significant damage from Water Pulse, and Lairon is terrified of Hidden Power Ground. Wormadam-S is an excellent counter that is only afraid of Hidden Power Fire. Even if it is running its wallbreaking set, it cannot threaten to immediately knock them out if they switch into a Normal-type attack or are healthy.</p> <p><strong>Physical Walls</strong>: Physically bulky Pokemon can tank its attacks and fire back against the frail Persian. Leafeon, Shelgon, and defensive Mienfoo can easily threaten to KO Persian, while walls like Hippopotas and Ivysaur are only afraid of Knock Off on the switch.</p> <p><strong>Choice Scarf Users</strong>: While most Choice Scarf users can't switch into Persian's powerful attacks, they can use the Speed boost to threaten Persian out. Persian's tendency to use Fake Out and Taunt frequently might invite a risky switch from the opponent looking to take momentum back. Slaking deserves special mention thanks to being able to tank Persian's attacks and threaten it with either a STAB attack or Pursuit.</p> <p><strong>Priority</strong>: While Fake Out almost always goes first in the priority bracket, Pokemon that are able to tank a Fake Out and threaten back with powerful priority deny Persian its goal of revenge killing. Arbok with a Coil or two of boosts can comfortably tank Fake Out and do huge damage back with Sucker Punch. Pikachu's Extreme Speed turns the tables on a Persian that has just gotten a KO, and its gigantic attacking stats mean that it is very difficult to switch into. In endgame situations, other Persian are able to use their Fake Out to potentially force a KO on Persian or its teammates.</p> <p><strong>Residual Damage</strong>: Persian's tendency to throw out many \"free\" attacks leads to Rocky Helmet Solrock being its most common check, which is able to damage Persian even if it switches out with U-turn. Persian also weaves in and out of battle to make the most out of Fake Out and U-turn, which accumulates a lot of chip damage from Stealth Rock.</p>",
    "sets": {
      "Offensive Pivot": {
        "description": "<p>Flaunting the highest Speed stat in the tier, a deep movepool, and decent offensive stats paired with the incredible ability Technician, Persian takes its place at the top of the metagame as an incredible revenge killer and wallbreaker. Technician-boosted Fake Out is the lynchpin of this Persian set, giving it a strong priority attack that racks up damage with its guaranteed flinch as well as allowing Persian to pick off weakened Speed-boosted Pokemon like Shelgon or Choice Scarf users. The choice of STAB move between Return and Double-Edge comes down to the pacing of the team, as more aggressive teams might need the improved damage of Double-Edge, while more balanced teams can afford to let Persian play more conservatively with its HP. U-turn allows Persian to keep momentum on predicted switches as well as chip important targets like Solrock and Lairon with the help of Stealth Rock. Taunt is an overall good utility move that lets Persian deny status moves such as Thunder Wave and Will-O-Wisp as well as prevent recovery moves from Pokemon that Persian needs to keep at low HP. Knock Off is another good option that lets Persian ruin unevolved walls like Clefairy and Hippopotas while being generally difficult to switch in against. The final common option that Persian makes use of is Bite, which lets Persian muscle through a relatively hard counter in Frillish, while still outputting good damage against Solrock. Despite no other Pokemon in BW ZU approaching Persian's Speed tier, maximum Speed investment is used in order to outspeed Jolly Whiscash after a boost as well as to tie with other Persian.</p> <p>This Persian set fits best on balance and offensive teams. Balance appreciates Persian's ability to revenge kill and force out a variety of attackers as well as wear down other balance and defensive teams through attacks, U-turn, and its disruption moves. Mienfoo is a stellar partner as its Regenerator and U-turn form a solid pivot core; Persian appreciates such a reliable answer to Lairon, while Mienfoo can cripple Eviolite-reliant walls such as Hippopotas, as well as pivot Persian in for opportunities to throw out attacks. Persian really appreciates Stealth Rock in order to make the constant switches it forces more painful, and Pokemon like Solrock, Wormadam-S, Clefairy, and Lairon are all excellent setters. Persian is also a great facilitator of powerful wallbreakers like Simisear and Glaceon, which lack opportunities to directly switch in. If Persian is being used on a more offensive team, Persian is great at baiting in Pokemon that resist Double-Edge like Solrock and Lairon for certain setup sweepers such as Substitute Leafeon and Dragon Dance Whiscash, respectively.</p>"
      },
      "Choice Scarf": {
        "description": "<p>While equipping the fastest Pokemon in the tier with a Choice Scarf sounds like a joke, Choice Scarf Persian holds the unique distinction of outrunning many Pokemon after they boost or even double their Speed, as well as revenge killing Pokemon that use Endure to ignore Fake Out. U-turn is a great pivoting tool to take advantage of predicted switches, but it also allows Persian to attack while switching out, which avoids being locked into a suboptimal move. Bite grants Persian a stronger hit on Solrock and allows it to damage Ghost-types like Frillish heavily, but Knock Off is an alternative if crippling Eviolite switch-ins is considered more important. Switcheroo allows Persian to force its Choice Scarf on an opposing wall, ensuring that it will also have utility against defensive teams.</p> <p>Choice Scarf Persian fits well on teams that appreciate Persian's ability to blanket check many setup sweepers that other common Choice Scarf users can't outrun, like Agility Kingler, Salac Berry Raichu, and Salac Berry Simisear. Defensive staples like Meganium lacking Dragon Tail, Staryu, and Solrock are liable to being set up on, and Choice Scarf Persian helps ensure that teams with them are secure versus threats like Raichu. However, teams with this Persian set must have reliable answers to Lairon and other physically bulky setup threats like Shelgon, which Persian has a poor matchup against. Choice Scarf Persian is also one of the best tools for a defensive team against other defensive teams, as Switcheroo can ruin regular Persian checks like Solrock and Wormadam-T.</p>"
      },
      "Mixed Wallbreaker": {
        "description": "<p>Persian is able to make use of Technician and its acceptable Special Attack to don a lure set. Persian's tendency to force physical walls in lets it snipe Pokemon like Lairon, Wormadam-T, and Solrock with a coverage move. Double-Edge is the preferred STAB move on this Persian, as this set cannot afford Silk Scarf and thus needs the power of Double-Edge. Hidden Power Fire is used to dispose of Wormadam-T, which is an incredibly reliable counter otherwise, but Hidden Power Ground can be used alongside U-turn to run a hybrid of the Offensive Pivot and Mixed Wallbreaker sets. This combination allows Persian to still lure in and snipe Lairon and other Steel-types while pivoting out of poor matchups, like Wormadam-T and Solrock. Water Pulse is used to hit Rock- and Ground-types like Lairon, Solrock, and Hippopotas. Knock Off allows Persian to cripple Pokemon that have little issue walling a Persian without Silk Scarf, such as Clefairy or defensive Leafeon. Fake Out lets Persian retain its priority, although it's a notably weaker option without Silk Scarf.</p> <p>This Persian pairs best with teammates that appreciate its ability to lure in regular checks to Persian. Emolga takes incredible advantage of weakened Lairon and Solrock, as this opens up the opposing team to its powerful Acrobatics. Dragon Dance Shelgon also exploits the absence of Steel-types, as it can click Outrage and Dragon Claw without worry. Pikachu and Raichu appreciate that bulky Grass-types are often used to check Persian after this set has been revealed; they're allowed more opportunities to throw out their powerful Electric-type attacks once Persian weakens Meganium or Ivysaur. Offensive Stealth Rock users pair well with this aggressive Persian set, like Lairon, Solrock, and Graveler.</p>"
      },
      "Weather Setter": {
        "description": "<p>This Persian set forgoes its usual roles as a revenge killer and wallbreaker, and it instead focuses on Persian supporting weather-based strategies. Persian is the fastest Pokemon with access to all of a weather-setting move, U-turn, and Taunt, which lets it set ideal conditions for Pokemon reliant on weather. Return is the necessary STAB move that allows Persian to threaten damage on its own, but Double-Edge is an alternative to apply more pressure.</p> <p>This Persian set should find itself alongside weather attackers and support Pokemon. On rain teams, Agility Pelipper and Beartic are excellent wallbreakers, and they can clean through weakened teams with their incredible power and Speed under rain. Raichu can make use of a perfectly accurate Thunder under rain, and its Nasty Plot boosted Hidden Power Ice helps wear down Grass-types like Meganium and Ivysaur for Water-type teammates they might wall otherwise. Kingler and Walrein under rain are terrifying threats, using the power boost to destroy all but the bulkiest of checks. Persian cannot keep up weather all on its own, though, and it should pair with other Rain Dance users for consistency. Phione has the best defensive profile of the Rain Dance users, and it utilizes Hydration and Water-type STAB moves to be surprisingly difficult to handle. Illumise is another option, able to use a slow U-turn while setting priority Rain Dance for endgames against fast cleaners.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Monai", "user_id": 482455}], "teams": [{"name": "Quality checked by", "members": [{"username": "Gangsta Spongebob", "user_id": 535530}, {"username": "btboy", "user_id": 528652}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}, {"username": "ken", "user_id": 594478}]}]}
  },
  "Abra": {"sets": {"Revenge Killer": {}}},
  "Weepinbell": {"sets": {"Sun Sweeper": {}}},
  "Graveler": {"sets": {"Tank": {}}},
  "Magnemite": {"sets": {"Magnet Pull": {}}},
  "Muk": {
    "sets": {
      "All-Out Attacker": {
        "description": "<p>Top tier bulk, a solid offensive presence, and a good defensive typing allow Muk to fulfill a tank role excellently. Maximum HP investment lets Muk check Pokemon as comfortably as possible, easily taking hits from staples like Meganium, Leafeon, and Clefairy. Maximum Attack investment with an Adamant nature ensures Muk can fire back as hard as possible. Poison Jab is a reliable STAB attack with a lack of coverage that is made up for somewhat by its nasty 30% poison chance. Brick Break provides strong coverage against the Rock- and Steel-types that attempt to switch into Poison Jab, hitting the dangerous Lairon especially hard. Fire Punch is solid coverage for its super effective hit against Wormadam-S on its only weakness. Payback hits Solrock for significant damage, especially if it tries to set Stealth Rock in front of Muk, and also allows Muk to threaten Ghost- and other Psychic-types. Shadow Sneak, although not very strong, grants Muk priority and is especially effective at picking off weakened Psychic- and Ghost-types like Grumpig, Gastly, and Mr. Mime. It may seem odd to pass up on Poison Touch's extra damage, but Sticky Hold is an incredible ability. The immunity to item disruption allows Muk to stuff Knock Off and flip momentum with a risky switch into Trick or Switcheroo from Choice Scarf users like Grumpig.</p> <p>Muk is a great tank that can use its many opportunities to switch in and great power to force a lot of damage early into the game, which balance, offense, and hyper offense teams love. Stealth Rock setters like Lairon, Solrock, and Wormadam-S help apply pressure through status and their STAB attacks, which can force in walls like Clefairy and Meganium for Muk to abuse. On more balanced teams, Clefairy provides an important ability to pivot into special attacks and status while spreading Thunder Wave for the slow Muk. In return, Muk can dominate Mienfoo for Clefairy, and is unafraid of Knock Off thanks to Sticky Hold. This trait is especially appreciated by walls that use Eviolite like Clefairy and Grass-type walls like Meganium, the latter of which can switch into Ground-types and Solrock for Muk. Muk is amazing at trading hits and keeping up pressure, but its low Speed often results in an inability to KO many low health foes. Revenge killers and setup sweepers like Emolga, Persian, and Kingler are great picks to run through a team that Muk has damaged.</p>"
      },
      "Curse": {},
      "SubPunch": {}
    },
    "credits": {"writtenBy": [{"username": "Monai", "user_id": 482455}], "teams": [{"name": "Quality checked by", "members": [{"username": "Gangsta Spongebob", "user_id": 535530}, {"username": "sleid", "user_id": 601970}]}, {"name": "Grammar checked by", "members": [{"username": "Clouds", "user_id": 356215}]}]}
  },
  "Gastly": {"sets": {"Choice Scarf": {}, "Stallbreaker": {}, "SubSplit": {}}},
  "Onix": {"sets": {"Sun Lead": {}}},
  "Kingler": {
    "sets": {
      "Choice Scarf": {},
      "Swords Dance": {
        "description": "<p>With Swords Dance, Kingler is a dangerous wallbreaker. Crabhammer is a spammable STAB attack that threatens every foe that doesn't resist or is immune to Water; when boosted by Swords Dance, Life Orb, and an Adamant nature, it has a chance to OHKO physically bulky walls like Wormadam-S and physically defensive Clefairy. Rock Slide targets Flying-types; with Sheer Force and Life Orb, Rock Slide 2HKOes Vullaby and defensive Pelipper and OHKOes offensive variants of Pelipperwithout Life Orb, the former two are 3HKOed and latter 2HKOed. Rock Slide also 2HKOes Walrein, which resists Crabhammer, and threatens to OHKO other Ice-types like Glaceon. While it does not hit them super effectively, Rock Slide can serve as coverage against Frillish and the Grass-types Meganium, Leafeon, and Ivysaur, 2HKOing them at +2. Substitute lets Kingler dodge status and take advantage of its tendency to force switches. Some walls like Frillish lacking Night Shade cannot break through Kingler's Substitute in one hit, letting it set up on them. However, Kingler tends to be worn down very quickly when using Substitute in conjunction with Life Orb. Superpower is an alternative, letting Kingler OHKO Pawniard and Lairon at +0 and physically defensive Clefairy at +2. X-Scissor is another alternative, as it OHKOes Meganium at +2 while also OHKOing Swords Dance Leafeon and 2HKOing cleric Leafeon. While Life Orb is crucial to reach many KO thresholds, Leftovers can be used instead to increase Kingler's longevity, which notably lets it use Substitute more times. Lum Berry is another alternative, granting Kingler more flexibility in how it handles status spreaders. An Adamant nature is prefered to maximize Kingler's power, though Jolly can be used instead to help it outspeed foes like Jolly pivot Mienfoo.</p> <p>Kingler best fits on offense and balance teams looking for a potent wallbreaker. It's easily taken out by faster special attackers such as Raichu, so special sponges like Muk make good partners. Grass-types like Leafeon, Ivysaur, and Meganium threaten OHKOes on Kingler and fear little in return, so checks to them like Muk and Emolga work well as partners. Frillish can usually burn Kingler before it can set up enough Swords Dances to break through it, leaving Electric- and Grass-types like Raichu and Leafeon as useful checks to it, as well as the status-sponging Clefairy. Knock Off users such as Persian, Mienfoo, and Ivysaur can remove Eviolite from walls such as Frillish and Ivysaur, giving Kingler a much easier time breaking through them. Pivots like the aformentioned Persian and Raichu can chip the opposing team while safely bringing in Kingler and other offensive partners. Stealth Rock users like Solrock, Lairon, and Clefairy help getting foes into KO range, which is especially important against Flying-types if Kingler forgoes Life Orb.</p>"
      },
      "Double Dance": {},
      "Agility": {}
    },
    "credits": {"writtenBy": [{"username": "Gangsta Spongebob", "user_id": 535530}], "teams": [{"name": "Quality checked by", "members": [{"username": "Mirbro", "user_id": 451786}, {"username": "Monai", "user_id": 482455}]}, {"name": "Grammar checked by", "members": [{"username": "Tea Guzzler", "user_id": 577920}]}]}
  },
  "Seaking": {"sets": {"Offensive Rain Dance": {}}},
  "Staryu": {"sets": {"Physically Defensive": {}, "Mixed Wall": {}}},
  "Magmar": {"sets": {"Physical All-Out Attacker": {}, "SubPunch": {}, "SubStatus": {}}},
  "Flareon": {"sets": {"All-Out Attacker": {}, "Special Wall": {}}},
  "Porygon": {"sets": {"Bulky Setup Sweeper": {}}},
  "Sudowoodo": {"sets": {"Offensive Stealth Rock": {}}},
  "Girafarig": {"sets": {"Mixed Attacker": {}}},
  "Pineco": {"sets": {"Suicide Lead": {}}},
  "Octillery": {"sets": {"Special Attacker": {}, "Physical Attacker": {}}},
  "Mightyena": {"sets": {"Stallbreaker": {}, "Substitute + 3 Attacks": {}}},
  "Slaking": {
    "comments": "<h1>Other Options</h1> <p>Giga Impact is Slakings strongest move, and Truant means Slaking would skip the next turn anyway, but it's situational since it forces Slaking to stay in. Hammer Arm on the Choice Band set punishes physically defensive Clefairy while retaining coverage for Rock- and Steel-types, but it is less accurate than Earthquake and lowers Slaking's Speed.</p> <h1>Checks and Counters</h1> <p><strong>Protect and Substitute</strong>: Pokemon sporting Protect like Grumpig, Muk, and defensive variants of Leafeon and Shelgon can block every attack from Slaking, using it as setup fodder when Truant activates. If Substitute users like Simisear and Whiscash can set up a Substitute while Slaking is loafing around, they can automatically beat it.</p> <p><strong>Ghost-types</strong>: Frillish stands out as one of Slakings worst matchups, stomaching a Night Slash even after Stealth Rock. Frillish can cripple it with status or switch to a different teammate as Truant activates. Other Ghost-types like Lampent and Gastly can also switch into Return, but they must be much more careful with Slakings Dark-type coverage, and Earthquake for the former.</p> <p><strong>Rock- and Steel-types</strong>: Pokemon like Graveler, Lairon, and Pawniard can come in freely on anything but Earthquake, and they can retaliate by either setting up Stealth Rock or freely pivoting to other teammates. Solrock instead can come in on Earthquake but fears Night Slash. Wormadam-S particularly stands out, comfortably tanking any attack Slaking commonly runs and regularly running Protect.</p> <p><strong>Physical Walls</strong>: Physical walls like Hippopotas and Gloom can stomach even a Choice Band-boosted Return, recover the damage off, and freely use their utility moves when Truant activates.</p> <p><strong>Faster Pokemon</strong>: Although Slaking sits at a good Speed tier, naturally faster Pokemon like Emolga and Simisear, and Choice Scarf users like Mr. Mime and Glaceon, can pick off Choice Band Slaking with enough chip damage. However, they must be aware of Slaking boasting a Choice Scarf of its ownnote that, if Slaking KOes a foe with a move that didn't require Choice Band to KO, opponents may not discover Slaking's item.</p>",
    "sets": {
      "Choice Band": {
        "description": "<p>With the highest Attack stat in ZU, a wide offensive movepool, and a great Speed tier, Slaking stands out as a dangerous wallbreaker. Double-Edge can be used over Return for extra power at the cost of wearing Slaking down more quickly. Earthquake crushes Steel-types like Lairon and Pawniard and significantly damages Graveler. Night Slash targets Solrock and Ghost-types like Frillish and Gastly. Sucker Punch picks off faster Pokemon like Simisear, Emolga, and Persian with enough chip damage. Pursuit traps frail attackers like Persian, Pikachu, non-Protect Grumpig, and Mr. Mime. Pursuit can also remove sufficiently weakened defensive Pokemon, such as Frillish, specially defensive Clefairy, and Solrock.</p> <p>Slaking best fits on balance teams due to its hit-and-run nature: it provides great offense, but it needs bulkier teammates to come in and tank hits if Truant forces it out. Staryu stands out as a great partner, pressuring Rock- and Steel-types with Scald and Frillish with Toxic, as well as removing entry hazards to improve Slaking's longevity. Pivots such as Emolga and Vibrava allow Slaking an easier time entering the field safely. Pokemon that commonly carry Protect, like Grumpig and Muk, can be especially problematic for Slaking; teammates like Emolga and Arbok can check them with their faster Speed or super effective coverage, respectively. Ground- and Fighting-types like Mienfoo, Hippopotas, and Whiscash can check Steel-types, while Grass-types like Meganium and Ivysaur can check Frillish and Solrock. Once Slaking has sufficiently damaged teams, offensive partners like Muk and Simisear can clean up late-game.</p>"
      },
      "Choice Scarf": {"description": "<p>Choice Scarf Slaking outpaces the entire unboosted metagame, serving as a strong revenge killer. Double-Edge provides higher damage output at the cost of recoil. Earthquake allows Slaking to revenge kill Rock Polish Lairon and the uncommon Pawniard. Night Slash targets Solrock and Ghost-types like Frillish and Gastly. Pursuit picks off weakened foes like Mr. Mime and non-Protect Grumpig.</p> <p>This Slaking set fits better on bulky offense and balance teams, providing a revenge killer and Pursuit trapper. Pivots like Emolga and Pelipper allow it to hit the field more safely. Ground- and Fighting-types like Hippopotas, Vibrava, and Mienfoo check the Rock-types that switch in on Slaking, while Grass-types like Meganium and Ivysaur can pressure Frillish and Solrock. In return, Slaking can take on naturally fast Pokemon like Emolga and Simisear, as well as Choice Scarf users like Grumpig and Mr. Mime.</p>"}
    },
    "credits": {"writtenBy": [{"username": "5Dots", "user_id": 543866}], "teams": [{"name": "Quality checked by", "members": [{"username": "Gangsta Spongebob", "user_id": 535530}, {"username": "Monai", "user_id": 482455}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Lairon": {
    "sets": {
      "Bulky Stealth Rock": {},
      "Choice Band": {},
      "Rock Polish": {
        "description": "<p>Lairon's high power and physical bulk make it an effective sweeper when Rock Polish boosts its otherwise pitiful Speed. At +2 Speed, only Persian can naturally outspeed Lairon. Head Smash is critical, with it 2HKOing nearly every neutral target in ZU, and it notably OHKOes common foes like Persian and Emolga. However, given its terrible accuracy, Head Smash should only be used when its power is needed. Iron Head serves as a more reliable STAB attack that has the added benefit of hitting Solrock for super effective damage. Its chance to make foes flinch also lets it situationally break through walls it otherwise struggles to, like physically defensive Clefairy, Meganium, and physically defensive Solrock. Earthquake primarily targets opposing Steel-types, OHKOing Choice Band Lairon and 2HKOing Pawniard and other Lairon variants. It only does slightly less damage to Poison-types than Head Smash while also being perfectly accurate, preventing foes like Arbok from getting lucky and potentially ending Lairon's sweep early. Rock Head is used in order to prevent Lairon from taking massive amounts of recoil from Head Smash.</p> <p>Lairon best fits on offense teams looking for a physically bulky sweeper that is difficult to wall. Hyper offense in particular needs something that can switch into offensive pivot Persian, a role Lairon does quite well. Lairon can only sweep when the opposing team is sufficiently weakened; beyond the chip damage sustained from neutral attacks, a sizable number of Pokemon, including those Lairon is often tasked with checking like Persian and Emolga, often carry Fighting- and Ground-type coverage. In a pinch Lairon can usually tank one quad-super effective Hidden Power, Earthquake, or Superpower, but having to do this more than once will result in Lairon being KOed. Stealth Rock support from partners like Solrock is an effective way to get Lairon's targets into KO range. Another source of chip damage comes from pivots like Mienfoo, Pikachu, and Persian wearing down the opposing team with their priority and pivoting moves; Persian is notably effective due to its powerful Fake Out. Dual screens support from Mr. Mime can be used to augment Lairon's bulk; behind screens, it's nearly impossible to OHKO, making setting up Rock Polish and attacking multiple times much easier. Even at +2 Lairon is still slower than most Choice Scarf users. If a common user like Kingler or Mr. Mime is spotted in Team Preview, unless Lairon can find an opportunity to use Rock Polish multiple times, it should avoid setting up until they are KOed or it's revealed they're not using Choice Scarf. Alternatively, Lairon can bait a Choice Scarf user to lock itself into an attack while KOing Lairon, giving a teammate like Leafeon or Whiscash a prime setup opportunity.</p> <p>A few Pokemon can consistently wall Lairon, namely physically bulky Eviolite users that aren't weak to Lairon's moves, like physically defensive Clefairy, Hippopotas, offensive pivot Mienfoo, and Ivysaur. Additionally, while they can't easily switch in, physically defensive Solrock, Meganium, and Frillish aren't OHKOed by anything Lairon can do against them, while in return they can either threaten to burn it or finish off a weakened Lairon with a super effective attack. Another potent check to Lairon is Cleric Leafeon, which does minimal damage to Lairon but has reliable recovery and isn't 2HKOed by any of Lairon's moves. Given that many of Lairon's walls are NFEs, Knock Off support from partners like Vullaby, Mienfoo, and Persian is effective. Since most of these Pokemon invest heavily in physical bulk, special wallbreakers like Simisear and Mr. Mime can break through them, a pairing that's particularly effective on hyper offense teams. Sometimes if there are no major walls for Lairon on the opposing team, it can instead act as a mid-game wallbreaker and have another partner clean in the endgame; this is especially viable on hyper offense teams.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Gangsta Spongebob", "user_id": 535530}], "teams": [{"name": "Quality checked by", "members": [{"username": "Mirbro", "user_id": 451786}, {"username": "Monai", "user_id": 482455}]}, {"name": "Grammar checked by", "members": [{"username": "P Squared", "user_id": 168392}]}]}
  },
  "Grumpig": {
    "comments": "<h1>Other Options</h1> <p>Grumpig can use Snatch to steal Calm Minds from opposing Grumpig, rather than Taunt simply blocking the attempt. Grumpig can use dual screens and Taunt to become a bulkier dual screens setter than Mr. Mime, but the additional Speed and access to moves like Healing Wish make Mr. Mime a generally better choice. Grumpig can make use of Gluttony with a Salac Berry to become a Speed-boosting sweeper, but its mediocre Speed means it only outspeeds a handful of Choice Scarf users, and it is still susceptible to priority.</p> <h1>Checks and Counters</h1> <p><strong>Faster Physical Attackers</strong>:  Grumpig's middling physical bulk and speed leave it at the mercy of physical revenge killers like Persian, Emolga, and Leafeon, as well as Choice Scarf users such as Kingler. Slaking deserves special mention, as without Protect, Slaking easily OHKOes Grumpig and can even trap it from high health with Pursuit.</p> <p><strong>Specially Bulky Pokemon</strong>: Grumpig lacks Nasty Plot compared to its competition, making it easier to check with raw bulk. Pokemon with high Special Defense such as Clefairy, Meganium, and Munchlax can take Grumpig's attacks and either status or phaze it. Grumpig will typically lack super effective coverage against Vullaby and Wormadam-T, making them good answers if they have carry their super effective STAB attacks.</p> <p><strong>Pawniard</strong>: Pawniard can easily pivot into Grumpig's STAB attack, although it must be careful of a Focus Blast or Hidden Power Fighting on the switch. From there. it easily threatens Grumpig out with a Sucker Punch and can set up a Swords Dance as Grumpig switches.</p> <p><strong>Status</strong>: Grumpig is crippled particularly hard by status. Poison and burn cut heavily into Grumpig's bulk, while paralysis ruins Grumpig's Speed and makes it significantly easier to handle.</p>",
    "sets": {
      "Offensive Calm Mind": {
        "description": "<p>Grumpig makes use of its amazing defensive profile and solid offensive stats to don a very threatening Calm Mind set. Its great set of resistances and natural bulk give it many opportunities to switch in, and its solid power and wide range of coverage often force switches that allow it to find a turn to use Calm Mind. Psychic is the necessary STAB attack for Grumpig, and the ability to hit the common Mienfoo and Muk for super effective damage is a very valuable trait. Psyshock is a generally weaker alternative, especially since Clefairy commonly runs a physically defensive set, but the ability to hit specially defensive Meganium and OHKO Muk might be valuable to certain teams. Focus Blast allows Grumpig to hit Steel-types as well as the all-important Clefairy for a huge amount of damage after a boost. Hidden Power Fighting is a perfectly accurate alternative to Focus Blast, but Grumpig sorely misses the power against Clefairy, Munchlax, and Wormadam-T, and the IV requirement means that Grumpig misses out on a potential speed tie against opposing Grumpig and offensive Meganium. Shadow Ball rounds out Grumpig's perfect coverage, hitting Frillish and Psychic-types like opposing Grumpig, Solrock, and Mr. Mime for great damage. An alternative way to beat other Grumpig is Taunt, which prevents them from using Calm Mind to match boosts and has great utility outside of a Grumpig mirror matchup, denying Stealth Rock attempts, status, and preventing walls from healing. Finally, Protect is an option to deny Persian's Fake Out, stuff a common revenge killer in Slaking, and accrue Leftovers recovery. Leftovers makes Grumpig a threat long term, but Fighting Gem can be used to muscle past Pokemon like Clefairy and Wormadam-T. Thick Fat solidifies Grumpig as a check to Simisear and Glaceon.</p> <p>Grumpig is best used on balance and offensive teams thanks to its ability to turn defensive staples like Muk and Mienfoo into setup opportunities while also using its unique resistances to check dangerous special attackers like Simisear and Glaceon. Grumpig needs Stealth Rock to function at its best, and the Stealth Rock-setting Lairon and Solrock are two excellent partners for their resistance to Normal and great physical bulk. Lairon is a powerful attacker on its own and baits in Mienfoo and Solrock for Grumpig to take advantage of, while Solrock's recovery and status allows its team to play a longer game. While Grumpig's natural special bulk is quite good, it shouldn't be a team's primary answer to special attackers. Clefairy provides numerous utility options for Grumpig to take advantage of, namely Encore and Thunder Wave, while Grumpig can threaten Mienfoo trying to take advantage of Clefairy. Meganium can take the brunt of special attacks, while Grumpig is a solid backup check to most special attackers and safeguards the team against Simisear. Muk is another excellent answer to special attackers that trades longevity for offensive presence, and it is one of the most reliable switchins to Clefairy.</p>"
      },
      "Choice Scarf": {
        "description": "<p>Choice Scarf on Grumpig makes use of its great stat spread and resistances to become a revenge killer with excellent defensive properties. Psychic is Grumpig's strongest attack to lock into and has solid neutral coverage, dispatching offensive staples like Simisear, Leafeon, and Emolga after some chip damage. Psyshock is a generally weaker alternative that hits unboosted Muk harder, but it is especially effective Mothim after a Quiver Dance. Focus Blast has good synergy with a STAB Psychic, importantly hitting Rock Polish Lairon, but also doing significantly more damage to Pokemon like Clefairy, Glaceon, and Walrein. Hidden Power Fighting gains accuracy against Lairon in exchange for a point of Speed, and due to its lack of power, the ability to hit most other targets. Trick gives Grumpig a way to cripple defensive switch-ins like Clefairy and Meganium and allows it to attack freely. Shadow Ball allows Grumpig to hit other Grumpig and Mr. Mime directly, as well as hitting Frillish and Lampent for more damage than Psychic. If the rest of the team can handle these Pokemon, then Calm Mind can be used in the last moveslot alongside Psyshock. This allows Grumpig to use the free turn from Trick against a foe setting up for its own setup opportunity. Thick Fat notably allows Grumpig to switch into Simisear's STAB moves.</p> <p>Choice Scarf Grumpig is a very flexible Pokemon, able to switch into threats in a pinch and use its wide coverage to handle them accordingly. Balance and offense teams love Grumpig compressing a revenge killer and a switch-in to some of the biggest threats in the metagame, especially Simisear. More defensive teams can also appreciate the speed control Grumpig provides against nearly unwallable threats like Mr. Mime and Simisear. Clefairy is an excellent partner, as Clefairy can blanket check a large portion of the metagame, while Grumpig can offensively answer the few Pokemon capable of breaking through Clefairy, such as Raichu. Persian and Grumpig together can revenge kill almost any threat in the metagame thanks to their Speed and combined physical and special power. If Grumpig is willing to give up its Choice Scarf, then Trick is an excellent tool to facilitate teammates. Certain wallbreakers like Exploud and Pikachu appreciate Clefairy and Meganium being crippled by a Choice Scarf. As a teammate, Meganium wants little more than a Simisear check and a Clefairy hit by Trick, as with those threats crippled or KOed, Meganium becomes nearly impossible to KO. Walrein and Glaceon are two incredible wallbreakers that appreciate Grumpig's revenge killing offensive Pokemon faster than them, and in turn they put huge pressure on Clefairy and opposing Grumpig, potentially opening up a Psychic sweep in the endgame.</p>"
      },
      "Bulky Calm Mind": {
        "description": "<p>This set takes an alternate approach to Calm Mind Grumpig, investing in bulk and using utility moves to become a devastating stallbreaker. Psyshock is a necessary move, as it pressures specially defensive Meganium more immediately and ignores any opposing Calm Mind boosts. Focus Blast gives Grumpig a powerful option to muscle past Pokemon that can take Psyshock like physically defensive Clefairy, Lairon, and Solrock. Hidden Power Fighting grants Grumpig accuracy and more PP, but the drop in damage is very noticeable, and the drop in Speed might be problematic against other Grumpig. Calm Mind is the lynchpin of the set, allowing Grumpig to become a threat with multiple boosts and making revenge killing it with special attackers difficult. The last moveslot is dedicated to a utility move, mainly one of Taunt or Substitute. Taunt allows Grumpig to deny healing or status attempts from Pokemon that can't damage it significantly, such as Clefairy, Staryu, and Toxic from Walrein, and even special attackers after Grumpig as accrued enough boosts. Substitute allows Grumpig to block weak attacks after enough Calm Mind boosts, completely shutting down Pokemon like Meganium, Ivysaur, Pelipper, and Staryu, thanks to its ability to block status. Thick Fat is used for its defensive utility, adding useful resistances to Fire and Ice.</p> <p>This Grumpig set is best used on balance and offensive teams, cleaning up once opposing attackers that can threaten Grumpig have been weakened or knocked out. It is important to pair Grumpig with offensively capable Pokemon, so they can either weaken the opponent's team for Grumpig or clean it up after Grumpig is knocked out. Walrein and Leafeon are two powerful breakers that put heavy pressure on Clefairy and Wormadam-S, respectively. Persian is a stellar partner, pressuring attackers faster than Grumpig like Emolga, Lopunny, and Raichu while also wearing down their shared checks, namely Wormadam-S, which stuffs Grumpig from high health. Grumpig's middling Speed tier and reliance on its bulk means that it especially appreciates status to help clean up teams. Staples like Clefairy, Solrock, Wormadam-S, Frillish, and Staryu all fulfill important defensive roles while spreading burns, paralysis, and/or poison that Grumpig can take advantage of.</p>"
      },
      "Specially Defensive": {
        "description": "<p>Grumpig can even take on a defensive role, utilizing its important resistances and wide movepool to spread status, disrupt the opponent's team, and even become a cleric. Psychic is essential so that Grumpig isn't too passive, letting it threaten frail Pokemon like Simisear and Pokemon weak to Psychic like Mienfoo. The rest of the moves can be picked from Grumpig's many great options, but its most broadly useful option is Thunder Wave, which cripples much of the tier and can set up a slower wallbreaker for success. Taunt allows Grumpig to harass slower walls like Meganium, Clefairy, and Solrock, and any wall after Thunder Wave, preventing them from healing or using their other utility moves. Protect is a consistent option to keep Grumpig healthy over the course of a game, as well as scouting Choice item users and preventing Slaking from Pursuit trapping it. However, Taunt and Protect are by no means mandatory. While cleric support can be fit more easily on other staples like Meganium and Clefairy, Heal Bell can be used if the team is lacking those Pokemon, or to open up their moveslots. Whirlwind is the final common option and very unique, forcing out Substitute users like Walrein and other Grumpig, as well as setup sweepers like Raichu and Shelgon in an emergency. Maximum Special Defense EVs minimize damage from Pokemon like Simisear and Walrein while Grumpig cripples them or forces them out, and Thick Fat provides the pseudo-resistances needed to check said Fire and Ice types.</p> <p>This Grumpig is best used on defensive and stall teams, as it can compress a check to many very threatening special attackers, namely Glaceon and Simisear. A key partner to Grumpig is Solrock, as it can answer many powerful physical attackers, especially Persian and Emolga, while setting Stealth Rock. Frillish allows stall teams to maintain Stealth Rock versus Staryu, heavily cutting into the longevity of wallbreakers like Simisear and Glaceon, which means they cannot come in multiple times to wear Grumpig down. Staryu's Rapid Spin can clear Stealth Rock for Grumpig, making the most of its and its teammates' bulk. Clefairy and Meganium are defensive staples of the metagame that should be used on most stall teams, but their ability to absorb and heal status makes them very valuable to Grumpig in specific, especially if it forgoes Heal Bell. Grumpig lacks reliable healing, so Wish passers like Leafeon and Clefairy are good to keep Grumpig at high health.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Monai", "user_id": 482455}], "teams": [{"name": "Quality checked by", "members": [{"username": "Gangsta Spongebob", "user_id": 535530}, {"username": "Mirbro", "user_id": 451786}]}, {"name": "Grammar checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}, {"username": "Adeleine", "user_id": 517429}, {"username": "ken", "user_id": 594478}]}]}
  },
  "Seviper": {"sets": {"Stallbreaker": {}}},
  "Whiscash": {"sets": {"Bulky Substitute + Dragon Dance": {}, "Fast Substitute + Dragon Dance": {}}},
  "Walrein": {
    "sets": {
      "Substitute": {
        "description": "<p>Walrein's huge HP stat allows its Substitutes to hit the magic number of 101 HP, blanking Seismic Toss and Night Shade, as well as surviving weak attacks from the likes of Wormadam-T and Vullaby. Behind a Substitute, Walrein's STAB attacks are extremely difficult to handle. Surf provides solid neutral coverage and terrorizes staples like Solrock and Lairon. STAB Ice Beam is a great complement to Surf, hitting Grass-types like Meganium and Leafeon for enormous damage. Thanks to the continuous safety of Substitute, spamming Ice Beam for the chance to land a critical hit or freeze is notoriously viable, allowing Walrein to force its way through Clefairy with a bit of luck. The last move is used to harass walls that can stand up to Walrein's attacks. Toxic is the standard, stacking increasing damage on Water-types and walls that can take Surf and Ice Beam, such as Staryu, Munchlax, and other Walrein. Encore is another good option if Walrein's team can cover for Water-types, as the free turns generated can be used to set up a Substitute or fire off more attacks. Thick Fat is Walrein's only consistent ability; the Fire-type resistance is useful against Choice-locked Fire-types like Simisear and Lampent. 176 HP EVs are necessary for Walrein to reach 404 HP. 252 Speed EVs with a Timid nature allow Walrein to outspeed Pokemon like most Meganium and Solrock while providing a speed tie at minimum against other Walrein and Mienfoo. However, a Modest nature can be used if immediate damage is a higher priority.</p> <p>Walrein fits on offense teams that can take advantage of the KOs it force, but it still appreciates some defensive backbone. Emolga is a standout Walrein partner, pivoting it in on Rock-types while having the Speed and power to revenge kill faster threats to it like Leafeon and Simisear. In return, Walrein provides some much-needed hit-taking ability for offense teams, trading hits against opposing offense teams in a way staples like Persian, Emolga, and Raichu can't afford. Arbok also has good synergy with Walrein, baiting in common answers like Wormadam-S, Hippopotas, and Solrock for Walrein to take advantage of. Cleaners like Pelipper and Kingler appreciate the holes Walrein punches in the enemy team, abusing weakened or KOed Frillish and Clefairy to go for a win. Walrein's Stealth Rock weakness can limit its longevity, so defensive pivots that can take hits for the team rather than needing to use its valuable health are appreciated. Meganium is a solid defensive presence that covers Walrein against Electric-types while either providing utility like Aromatherapy or more offense through Swords Dance. Staryu is commonly seen as a partner thanks to Rapid Spin support keeping Walrein healthy; Thunder Wave can allow Walrein to outspeed offensive Pokemon that try to switch into Staryu. Pelipper is another great teammate despite its shared weaknesses to Electric- and Rock-types, as it can spread lots of status with Scald and Toxic, as well as debilitating Clefairy with Knock Off. Pokemon that can punish Volt Switch give Walrein some leeway when dealing with Raichu and occasionally Emolga. Ground-type Pokemon like Hippopotas, Wormadam-G, and Whiscash can block Volt Switch and threaten the user with Earthquake or status, while Emolga and Raichu both gain bonus effects from absorbing Volt Switch.</p>"
      },
      "3 Attacks": {}
    },
    "credits": {"writtenBy": [{"username": "Monai", "user_id": 482455}], "teams": [{"name": "Quality checked by", "members": [{"username": "Gangsta Spongebob", "user_id": 535530}, {"username": "sleid", "user_id": 601970}]}, {"name": "Grammar checked by", "members": [{"username": "TheRealBigC", "user_id": 532450}, {"username": "WrathoftheLeopard", "user_id": 511181}]}]}
  },
  "Clamperl": {"sets": {"Shell Smash": {}}},
  "Shelgon": {
    "sets": {
      "Bulky Dragon Dance": {},
      "Offensive Dragon Dance": {
        "description": "<p>Shelgon's decent bulk combined Eviolite with its useful defensive typing, being one of the few viable Dragon-types in the tier, allows it to set up relatively safely against most of the metagame, making it one of BW ZU's most threatening wallbreakers and sweepers. Outrage is extremely powerful at +1, 2HKOing even the bulkiest of threats such as defensive Pelipper and Frillish. Brick Break provides coverage against Steel-types such as Pawniard and Lairon. Fire Fang targets Wormadam-S hard and is a safer option than Outrage against Grass-types like Leafeon and Meganium. Dragon Claw can be opted for instead in the fourth slot, losing out on coverage against Wormadam-S in exchange for a safer and more spammable STAB option. An Adamant nature is generally preferred, boosting Shelgon's offensive capabilities to their highest potential while still allowing it to outspeed Pokemon such as Arbok and non-Choice Scarf Grumpig at +1; however, Jolly gives it the ability to outpace threats such as Swords Dance Leafeon and Raticate after a Dragon Dance.</p> <p>Shelgon fits best on offensive teams needing a reliable endgame sweeper and cleaner. Its primary weaknesses are it struggling to reliably muscle through walls such as Solrock and Clefairy and its capacity to have its wallbreaking potential limited if it gets statused. An excellent partner is Simisear; it helps threaten out Pokemon such as Wormadam-S and Lairon, and in return Shelgon can take out Pokemon such as specially defensive Clefairy and Frillish. Knock Off users such as Persian and Pelipper can help weaken walls that rely on Eviolite to check Shelgon such as physically defensive Clefairy and Frillish; both also act as pivots to give Shelgon a safe switch-in to the battlefield. Other physical wallbreakers such as Muk, Pawniard, and Leafeon are good options as partners, as they and Shelgon can wear down their shared checks. Other setup sweepers like Lairon, Grumpig, and Arbok also appreciate Shelgon luring in Choice Scarf revenge killers such as Kingler and Mienfoo they can set up against. On hyper offense teams, dual screens support from Pokemon like Solrock can help Shelgon set up more safely.</p>"
      },
      "Wish": {
        "description": "<p>While it faces stiff competition from Pokemon like Clefairy and Leafeon as a Wish user, Shelgon sets itself apart from other clerics thanks to its unique Dragon typing, letting it resist hits from Pokemon like Leafeon, Simisear, and Kingler. Protect allows Shelgon to receive its own Wishes safely, scout out Choice-locked foes' attacks, and stall for Toxic damage if Shelgon is running it. Dragon Claw is the STAB move of choice, allowing Shelgon to not be completely passive if it is Taunted. The last move slot is flexible; most commonly, Roar is used to allow Shelgon to operate as a phazer and prevent Pokemon like Calm Mind Grumpig and Nasty Plot Simisear and Mr. Mime from using it as setup fodder, as well as allowing it to rack up entry hazard damage. Brick Break gives Shelgon super effective coverage into Steel-types like Lairon and other Pokemon like Persian, and Toxic allows Shelgon to status opposing set-up threats and walls like Solrock, Simisear, Leafeon, and Frillish and put them on a timer.</p> <p>Shelgon fits best on balance and defensive teams looking for solid Wish support and check to common offensive threats. Hazard setters like Solrock, Clefairy, and Pineco are great to have if Shelgon is running Roar, allowing it to bypass Shelgon's limited damage output by racking up residual damage. Bulky wallbreakers such as Muk, Grumpig, and Lairon that lack reliable recovery appreciate Shelgon keeping them healthy. Pokemon like Solrock and Glaceon enjoy Shelgon's ability to wall their checks like Swords Dance Leafeon and Kingler, thanks to it having a favorable defensive typing into their STAB moves, as well as Roar and Toxic. Shelgon struggles to deal with Pokemon like Walrein and Pelipper due to them being able to muscle through it with their STAB combination or Knock Off its Eviolite, so partners like Raichu and Emolga that can threaten them out are good teammates to have. If Shelgon is lacking Brick Break, checks to Steel-types are needed; Pokemon like Simisear and Mienfoo can threaten them out. Shelgon's mediocre special bulk can make it difficult to check special attackers; special walls like Clefairy and Muk are good partners.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Bella", "user_id": 567483}], "teams": [{"name": "Quality checked by", "members": [{"username": "Monai", "user_id": 482455}, {"username": "Gangsta Spongebob", "user_id": 535530}, {"username": "5Dots", "user_id": 543866}]}, {"name": "Grammar checked by", "members": [{"username": "TheRealBigC", "user_id": 532450}, {"username": "Tbolt", "user_id": 555379}, {"username": "WrathoftheLeopard", "user_id": 511181}]}]}
  },
  "Bibarel": {"sets": {"Suicide Lead": {}}},
  "Luxray": {"sets": {"Guts Wallbreaker": {}}},
  "Cranidos": {"sets": {"Choice Scarf": {}, "Hazard Lead": {}}},
  "Mothim": {"sets": {"Choice Specs": {}, "Quiver Dance": {}}},
  "Munchlax": {"sets": {"CroLax": {}, "Mixed Wall": {}, "Physical Wall": {}}},
  "Hippopotas": {"sets": {"Physical Wall": {}}},
  "Carnivine": {"sets": {"Swords Dance": {}}},
  "Lumineon": {"sets": {"Specially Defensive Pivot": {}}},
  "Phione": {"sets": {"Revenge Killer": {}}},
  "Drilbur": {"sets": {"Offensive Spinner": {}}},
  "Emolga": {
    "comments": "<h1>Other Options</h1> <p>Metronome over Flying Gem and special sets are plausible for breaking through physical walls like Hippopotas and Vullaby, though Emolga will sorely miss Acrobatics's power. Static can punish contact moves like U-turn, though Emolga's frailty prevents it from taking physical attacks unless it resists them. A Naive nature more easily lets Emolga take on Pawniard and Lairon with Knock Off and Hidden Power Fighting, but it sacrifices some special bulk.</p> <h1>Checks and Counters</h1> <p><strong>Faster Pokemon</strong>: Persian outspeeds Emolga and forces it out with STAB moves, and it can gain momentum on Emolga with U-turn. Choice Scarf users like Grumpig, Kingler, and Simisear can surprise Emolga and take it out with their STAB moves.</p> <p><strong>Rock-types and Steel-types</strong>: Without Hidden Power Fighting, Emolga struggles against Rock-types like Solrock, Lairon, and Graveler, all of which can set up Stealth Rock against it, forcing Emolga to use Roost more often. Solrock is especially notable because it is neutral to Hidden Power Fighting, and it can rack up Rocky Helmet damage if Emolga pivots out with U-turn. Pawniard can tank Acrobatics comfortably and threaten Emolga back with a STAB Sucker Punch, but it must be wary of Hidden Power Fighting.</p> <p><strong>Physical Walls</strong>: Physical walls like Hippopotas and defensive Shelgon can stomach two Acrobatics and can 2HKO Emolga back with their own attacks. Neither enjoys Knock Off, however.</p> <p><strong>Bulky Attackers</strong>: While Pokemon like Muk, Walrein, and Exploud cannot switch in directly, they can take any one hit from Emolga and threaten to OHKO it back, especially if Emolga has used up its Flying Gem.</p>",
    "sets": {
      "Offensive Pivot": {
        "description": "<p>With amazing Speed alongside a solid offensive and utility movepool, Emolga is a premier pivot. Acrobatics synergizes well with Flying Gem to deal massive damage to most neutral targets. U-turn steers Emolga away from bad matchups, such as Solrock and Lairon, as well as Ground-typeswhich block Volt Switchlike Graveler and Hippopotas. Volt Switch can be picked to evade Rocky Helmet damage from the aforementioned Solrock and chip foes a bit more. Hidden Power Fighting heavily damages Lairon, Pawniard, and Graveler, but it forces Emolga to run 30 Speed IVs, making it slower than opposing Emolga. Emolgas last moveslot is quite flexible: Taunt stops walls like Clefairy, Wormadam-S, and Frillish from using their utility moves, Encore locks Pokemon like Arbok and Grumpig into their setup moves, and Knock Off cripples Eviolite-reliant walls like Frillish and Staryu, as well as removing Leftovers from Pokemon like Wormadam-S. Motor Drive gives Emolga an Electric immunity and additional Speed from Electric-type attacks, like opposing Volt Switch, potentially letting it beat other Emolga.</p> <p>Emolga is an excellent facilitator for VoltTurn teams and pairs well with other pivots like Persian, Mienfoo, and Pelipper. Emolgas pivoting also allows for offensive threats like Simisear, Grumpig, and Arbok to hit the field more safely. In turn, Emolga appreciates having Rock-type checks removed or severely weakened by teammates like Meganium, Staryu, and Ivysaur. Special attackers like Grumpig and Walrein can help scare off physical walls like Solrock and Hippopotas, which would otherwise comfortably switch into Acrobatics. Stealth Rock support from Pokemon like Solrock, Clefairy, and Wormadam-S is also helpful, since it makes Emolga even more difficult to switch into over the course of a game. Bulky Pokemon to stomach hits from faster threats like Persian and Choice Scarf Simisear, like Hippopotas and bulky Grumpig, can help with Emolga's longevity.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "5Dots", "user_id": 543866}], "teams": [{"name": "Quality checked by", "members": [{"username": "Gangsta Spongebob", "user_id": 535530}, {"username": "Monai", "user_id": 482455}]}, {"name": "Grammar checked by", "members": [{"username": "Itchy", "user_id": 518399}, {"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Frillish": {
    "comments": "<h1>Other Options</h1> <p>Frillish can choose to run Energy Ball or Ice Beam to target foes such as Grass- and Water-types such as Leafeon, Meganium, Staryu, and Frillish, predicting when they switch in.</p> <h1>Checks and Counters</h1> <p><strong>Grass-types</strong>: Grass-type Pokemon threaten Frillish with super effective attacks. They include Leafeon, Ivysaur, Meganium and Gloom. None of these Pokemon necessarily like switching into Frillish for fear of getting inflicted with status, however.</p> <p><strong>Electric-types</strong>: Electric-types are completely problematic for Frillish due to most of them being special attackers. These include Pikachu, Raichu, and some Emolga sets, although there is also physical Luxray. None of these Pokemon necessarily like switching into Frillish for fear of getting inflicted with status, except Guts Luxray.</p> <p><strong>Dark- and Ghost-types</strong>: Frillish has to watch out for super effective moves that hit its Ghost-typing. The likes of Pawniard, Grumpig, Gastly, and Muk can all use Ghost- or Dark-type moves.</p> <p><strong>Faster Status Inflictors</strong>: Taunt is the most important move when it comes to the defensive utility Frillish set. Frillish can struggle throughout the game if it cannot outspeed status-inducing foes. Thunder Wave from the likes of Clefairy can ruin its faster Taunt and ability to spread burn to the slower walls that can deal massive damage. Toxic from Walrein, Vullaby, or Staryu can be problematic, as Frillish gets worn down quickly; burn affects it in the same way, except not as badly. This obviously doesn't affect Frillish very badly if it chooses to run Rest.</p> <p><strong>Fast Taunt Users</strong>: Fast Taunt users can shut down Frillish, taking away its ability to heal or spread status. Pokemon that carry this move are Persian, Grumpig, and Mr. Mime.</p> <p><strong>Knock Off</strong>: Knock Off can compromise the bulk that Frillish is brought for. Frillish doesn't want to take a Knock Off from a Pokemon like Clefairy, Mienfoo, or Pelipper; otherwise, it will struggle to fulfill its role for the rest of the match.</p>",
    "sets": {
      "Defensive Utility": {
        "description": "<p>Physically defensive wall, Rapid Spin blocker, and status-inducing support are the roles Frillish plays in this metagame. Taunt is useful for preventing passive walls such as Clefairy, Hippopotas, and either Wormadam forme from inflicting status conditions and using healing moves. Also, it disallows slower Pokemon to set up on Frillish such as Curse Muk, bulky Dragon Dance Shelgon, and Curse Munchlax. Night Shade is for consistent chip damage. Scald can be chosen instead for the same reason, which also has a chance to burn the target. Will-O-Wisp is mostly used in conjunction with Night Shade, because using it alongside Scald would be redundant. Toxic can be used with Scald for effective dual status spreading. It is especially useful for Pokemon Frillish cannot burn such as those with Water Absorb and Fire-types. Toxic is crippling against opposing walls, since it does exponential damage and Frillish can heal up against them while they are being worn down. Rest can be used in this slot over the previous two status moves as a way to add a status absorber to the team. Frillish is invested with 100 Speed EVs in order to be faster than base 50 Speed Pokemon to ensure that they can be hit with a Taunt before they can use a status-inducing, healing, or setup move.</p> <p>Frillish is used on teams looking for a physically defensive wall and spinblocker. There are a few different team archetypes that appreciate its presence, these being balance, bulky balance, stall, and entry hazard stack teams. It has an advantageous matchup against the tier's best Rapid Spin users, being Staryu, Drilbur, and Sandshrew; it is worth mentioning that Staryu can possibly run a niche set with Thunderbolt, however. Frillish is helpful in walling most offensive Pokemon that can only hit it for neutral damage, especially if it gets a burn from Will-O-Wisp or Scald; some of these include Shelgon, Lairon, and Whiscash. As previously mentioned, teams will appreciate that Frillish disallows walls to use status-inducing moves and heal or slow offensive Pokemon to use setup moves. It can completely wall some offensive threats that struggle to hit Ghost-types such as Persian, Mienfoo, and Slaking. Frillish does well with Grass-type teammates like Leafeon, Ivysaur, Meganium, and Gloom, which can handle its Electric and Grass weaknesses; additionally, Electric-types such as Pikachu, Raichu, and Luxray cover the former weakness. Pokemon like Muk, Arbok, and Simisear pair well with Frillish, because of the Grass-types it brings in, while the likes of Meganium, Muk, and Wormadam-S are general walls that can handle Electric-types. Frillish also has to be aware of opposing Ghost- and Dark-type moves from the likes of Grumpig, Gastly, and Arbok. Bringing a Steel- or Dark-type such as Pawniard, Lairon, Vullaby, or Wormadam-S can provide a switch-in to these moves. Knock Off absorbers like Emolga, Solrock, and Muk are also important to have on the same team as Frillish, because losing its Eviolite can weaken its effectiveness.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "sleid", "user_id": 601970}], "teams": [{"name": "Quality checked by", "members": [{"username": "Gangsta Spongebob", "user_id": 535530}, {"username": "Mirbro", "user_id": 451786}]}, {"name": "Grammar checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}, {"username": "ken", "user_id": 594478}]}]}
  },
  "Eelektrik": {"sets": {"Defensive Pivot": {}}},
  "Shelmet": {"sets": {"Spikes": {}}},
  "Mienfoo": {
    "comments": "<h1>Other Options</h1> <p>Mienfoo can act as a setup sweeper with Swords Dance and Bulk Up, but its shaky bulk, even with Eviolite, and mediocre Speed make it very easy to revenge kill. Inner Focus looks like it has potential for its ability to let Mienfoo surprise Fake Out users like Persian, but bulky sets need Regenerator to function, while bulkless sets take way too much damage from Fake Out for this to be a viable strategy.</p> <h1>Checks and Counters</h1> <p><strong>Special Attackers</strong>: Most special attackers OHKO Choice Scarf Mienfoo and 2HKO variants holding Eviolite, though Psychic-types like Grumpig and especially powerful special attackers like Simisear can OHKO even the bulkiest Mienfoo sets.</p> <p><strong>Faster Physical Wallbreakers</strong>: Bulkless Eviolite Mienfoo sets can only 2HKO or 3HKO many physical attackers like Kingler and Leafeon, while they outspeed and 2HKO it back. Choice Scarf sets can outspeed them, but without Eviolite Mienfoo is often OHKOed. However, these physical attackers must be wary of bulkier spreads with Eviolite, which can often dodge a 2HKO and either finish off its targets or pivot around them.</p> <p><strong>Poison-types</strong>: Mienfoo lacks the coverage to threaten Poison-types, meaning oftentimes the most it can do against foes like Muk and Arbok is to use a resisted High Jump Kick. However, all Poison-types barring the rare Sticky Hold Muk dislike Knock Off.</p> <p><strong>Flying-types</strong>: Without Rock-type coverage, Mienfoo struggles to damage Flying-types. Emolga is a notable problem due to its Flying Gem-boosted Acrobatics OHKOing even the bulkiest variants of Eviolite-holding Mienfoo.</p> <p><strong>Status</strong>: While Regenerator means residual damage isn't a huge concern, the attack reduction of burn leaves Mienfoo unable to threaten foes that it can't hit for super effective damage. Paralysis is troublesome for Mienfoo sets reliant on their Speed, notably Choice Scarf sets.</p>",
    "sets": {
      "Pivot": {
        "description": "<p>Solid Attack, decent Speed, and access to excellent utility make Mienfoo a fantastic pivot. While its bulk may seem paltry at first, its rare mono-Fighting typing and Eviolite make it a strong check to physical attackers like Lairon and Pawniard, while Regenerator and a resistance to Stealth Rock make it extremely hard to wear down. High Jump Kick is Mienfoo's main STAB attack, with it dealing heavy damage to most neutral foes and notably OHKOing Lairon and Pawniard. U-turn paired with Regenerator makes Mienfoo one of the tier's best pivots, as it can heal off attacks and residual damage while safely bringing in its more frail teammates. Fake Out lets Mienfoo chip its opponent for free, finishing off low-health targets and pairing well with High Jump Kick, since it hits most Normal-resistant foes super effectively. Taunt lets Mienfoo deny walls like Hippopotas recovery as well as prevent some foes like Solrock from spreading status. Toxic could be used over Taunt, letting Mienfoo cripple those aforementioned walls. An alternative over Fake Out or Taunt and Toxic is Knock Off, crippling walls that rely on Leftovers for their recovery, like Wormadam-S, or Eviolite to bring their bulk up to par like Frillish. A standard offensive spread with Adamant or Jolly can be used, though a spread of 120 HP / 252 Def / 136 Spe with an Impish nature retains enough Speed investment to Taunt Adamant Shelgon before it can use Dragon Dance while letting Mienfoo better check physical attackers with its higher bulk.</p> <p>Mienfoo best fits on offense and balance teams looking for a check to opposing physical attackers, notably Lairon and Pawniard, and a reliable pivot for their frailer offensive Pokemon. Mienfoo loses badly to most special attackers, especially to Psychic-types like Mr. Mime and Grumpig, so special sponges like Meganium, Muk, and specially defensive Clefairy are essential partners. Mienfoo's ability to pivot pairs well with wallbreakers, as it can help bring them in, while they break through the walls it lacks the firepower to get past. Special wallbreakers like Simisear and Mr. Mime work especially well in this regard, though physical ones like Slaking and Kingler are also very useful. Other pivots like Persian and Emolga also make good teammates, as they can pivot in Mienfoo and its wallbreaking partners. Mienfoo struggles to damage Poison-types like Muk and Arbok, so Ground- and Psychic-types like Hippopotas and Grumpig help in this regard.</p>"
      },
      "Choice Scarf": {
        "description": "<p>Choice Scarf Mienfoo is an effective revenge killer and speedy pivot with U-turn. High Jump Kick is Mienfoo's main STAB attack, and it notably OHKOes common Pokemon like Persian and Lairon. Rock Slide is Mienfoo's main source of coverage against Flying-types like Emolga and Pelipper. Stone Edge can be used instead for its higher damage, notably having an 87.5% chance to OHKO Emolga, though this comes with the cost of lower accuracy and the loss of Rock Slide's chance to flinch. Knock Off lets Mienfoo remove its target's item, which is important, since many walls in ZU are reliant on Leftovers for recovery or Eviolite for their bulk like Wormadam-S and Frillish, respectively. However, due to its low base power, Knock Off is a very risky move to lock Mienfoo into. Reckless can be used to increase the power of Mienfoo's High Jump Kick, though Regenerator can be used instead to help Mienfoo stay healthy, letting it avoid getting into KO range of some attacks, like Persian's Fake Out or Pawniard's Sucker Punch, late-game.</p> <p>Mienfoo is best used as speed control for offensive and balance teams. It's deathly afraid of priority, notably Persian's Fake Out and Pikachu's Extreme Speed, so physically bulky Rock-types like Lairon and Solrock make great partners. These Pokemon can also set up Stealth Rock for Mienfoo, which helps wear down its targets into KO range. Additional pivots work well in adding damage on Mienfoo's targets, with Persian in particular excelling at this role due to its powerful Fake Out. Mienfoo and its fellow pivots can help switch in wallbreakers like Kingler, which help break through physical walls that check them like Solrock. Mienfoo struggles to damage Poison-types like Muk and Arbok, so Psychic- and Ground-types like Mr. Mime and Hippopotas make good answers to them.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Gangsta Spongebob", "user_id": 535530}], "teams": [{"name": "Quality checked by", "members": [{"username": "Monai", "user_id": 482455}, {"username": "Mirbro", "user_id": 451786}]}, {"name": "Grammar checked by", "members": [{"username": "ken", "user_id": 594478}]}]}
  },
  "Pawniard": {"sets": {"Wallbreaker": {}, "Stealth Rock": {}}},
  "Vullaby": {"sets": {"Physically Defensive": {}}},
  "Heatmor": {"sets": {"Mixed Attacker": {}}}
}