{
  "Jumpluff": {"sets": [{"name": "Encore"}]},
  "Mawile": {"sets": [{"name": "Defensive"}, {"name": "Offensive"}]},
  "Torterra": {"sets": [{"name": "Tank"}, {"name": "Double Dance"}, {"name": "Choice Band"}, {"name": "Defensive Support"}]},
  "Monferno": {"sets": [{"name": "All-Out-Attacking"}]},
  "Dodrio": {"sets": [{"name": "Physical Attacker"}]},
  "Golduck": {"sets": [{"name": "Cloud Nine"}]},
  "Tentacool": {"sets": [{"name": "Utility"}]},
  "Natu": {"sets": [{"name": "Magic Bounce Pivot"}]},
  "Shiftry": {"sets": [{"name": "Choice Specs"}, {"name": "Swords Dance"}]},
  "Rampardos": {"sets": [{"name": "Suicide Lead"}]},
  "Purugly": {"sets": [{"name": "Pivot Attacker"}]},
  "Gabite": {"sets": [{"name": "Utility"}, {"name": "Choice Band"}]},
  "Simipour": {
    "overview": "<p>Simipour's solid Speed tier, high Special Attack, and great coverage make it a top-tier offensive threat in the metagame that every team must prepare for. Between its Water-type STAB moves hitting much of the tier for neutral damage, Ice Beam hitting Grass-types such as Maractus and Vileplume, and Hidden Power Electric threatening checks such as Tentacool and Mantine, Simipour forces many switches and has the power to beat almost all of its checks with correct prediction. With access to Nasty Plot, it can also become a devastating mid- or late-game sweeper, taking advantage of forced switches or more passive checks like Tentacool to set up a Substitute and sweep with considerable ease. However, Simipour's fragility limits its longevity and switch-in opportunities. It also relies on correct prediction to succeed, as teams that stack checks like Scraggy and Tentacool punish Simipour if it predicts incorrectly.</p> ",
    "sets": [
      {
        "name": "Choice Item Attacker",
        "description": "<p>Scald is the best STAB option, with the burn chance being great for wearing down switch-ins that aren't immune to Water. Still, Surf's slightly better power is somewhat useful for cleaning. Hidden Power Electric hits most Water-types, OHKOing Mantine after Stealth Rock and wearing down Tentacool. Hydro Pump is a powerful attack mainly used for wallbreaking. Choice Scarf allows Simipour to outspeed the entire unboosted tier, acting as a solid revenge killer against Pokemon like Zebstrika and Jumpluff. Choice Specs turns Simipour into a fearsome wallbreaker, notably being able to 2HKO Scraggy and Beheeyem after Stealth Rock.</p> <p>Due to Simipour's fragility, a solid defensive core can provide switch-ins to the threats that force it out, as well as opportunities to safely get in. Scraggy and Stunfisk can take advantage of standard offensive threats like Beheeyem and Zebstrika by setting up or setting Stealth Rock, respectively. Klang is a solid tank that does not mind Scalds from Simipour switch-ins like Frillish and Tentacool due to Rest, and it can bring Simipour in safely with Volt Switch. In return, Simipour forces out opposing Ground-types such as Torterra. Offensive Pokemon like Jumpluff and Zebstrika synergize well with Simipour because they force out Water-types like Tentacool for it. Entry hazards from setters like Dwebble and Marcatus are also useful, as they can guarantee OHKOs on Pokemon like Dodrio, Zebstrika, and Shiftry.</p> "
      },
      {
        "name": "Substitute + Nasty Plot",
        "description": "<p>This set takes advantage of the many switches Simipour forces to make it an even stronger, and more flexible, wallbreaker than Choice Specs allows. Surf is consistent, while Hydro Pump allows for obscene feats like 2HKOing Tentacool at +2 after Stealth Rock with Torrent activated. Ice Beam gives Simipour solid neutral coverage to hit Grass-types like Torterra and Maractus, while Hidden Power Electric hits Water-types like Mantine and Frillish. A Salac Berry makes Simipour outspeed the entire unboosted tier and most Choice Scarf Pokemon when eaten. Torrent turns Simipour into a more fearsome wallbreaker; however, this comes at the cost of being weaker to priority.</p> <p>Due to the explosive nature of this set, it fits on dedicated offense teams. Leads such as Rampardos, Dwebble, and Glalie can set entry hazards to wear down Simipour's checks, as well as being easier to fit on offense teams than other entry hazards setters like Stunfisk and Bronzor. Monferno is a solid partner, forcing out Scraggy and Klang, which can otherwise break Simipour's Substitute and prevent it from setting up, while bringing it in with U-turn. In return, Simipour can help wear down shared checks like Swanna and Tentacool, forming a solid offensive core. Zebstrika is a revenge killer for offensive teams that appreciates Simipour threatening Ground-types like Stunfisk. In return, it can force out Water-types like Mantine for Simipour. Klang and Mawile are defensive options that can check Grass-types like Simisage and pivot back into Simipour.</p> <h1>Checks and Counters</h1> <p><strong>Bulky Water-types: Tentacool and Chinchou are two common Pokemon that resist Water and can handily switch into most of Simipour's moves. While Tentacool lacks recovery, Chinchou can use Rest to heal itself back up. Frillish is less common, but it has reliable recovery and is harder to wear down, since Water Absorb heals it upon switching into Simipour's STAB moves. Mantine and Swanna both resist Water, but they are shakier switch-ins due to their weakness to Stealth Rock and 4x weakness to Hidden Power Electric.</p> <p><strong>Grass-types: Despite their dislike of Ice Beam, defensive Grass-types such as Maractus and Vileplume can switch into Simipour's STAB moves and use a free turn to set up Spikes or Growth, respectively. Offensive Grass-types like Shiftry and Jumpluff can take advantage of Choice item Simipour not locked into Ice Beam by setting up Nasty Plot or Swords Dance.</p> <p><strong>Specially Defensive Pokemon: Pokemon with naturally high Special Defense, such as Audino and Zweilous, can switch into most Simipour sets at least once while threatening to break its Substitute. Special mention goes to Scraggy for switching into Choice Scarf sets and making them setup fodder by healing status with Shed Skin and recovering with Rest.</p> <p><strong>Faster Offensive Pokemon: Faster Pokemon such as Zebstrika, Jumpluff, and Rapidash can all force Simipour out with super effective moves, allowing them to pivot or set up. Choice Scarf users such as Dodrio can also force Simipour out, but they cannot outspeed the Choice Scarf set. Weather sweepers such as Golduck and Victreebel can easily revenge kill Simipour as long as their respective weather is up.</p> <p><strong>Priority: Simipour's vulnerability to all entry hazards and fragility means that residual damage stacks up. This makes it easy to get Simipour into the range of priority users such as Purugly and Shiftry.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 231726, "username": "Akir"}, {"user_id": 265399, "username": "SergioRules"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 414072, "username": "Heracross2.0"}]}
  },
  "Zebstrika": {"sets": [{"name": "Ol’ Reliable (Volt Switch Pivot)"}]},
  "Swoobat": {"sets": [{"name": "Anti-Setup Wallbreaker"}]},
  "Maractus": {"sets": [{"name": "Spikes"}]},
  "Dwebble": {"sets": [{"name": "Suicide Lead"}]},
  "Scraggy": {"sets": [{"name": "Specially Defensive Bulk Up"}]},
  "Duosion": {"sets": [{"name": "Bulky Calm Mind"}]},
  "Swanna": {"sets": [{"name": "SubRoost"}, {"name": "Choice Scarf"}]},
  "Klang": {"sets": [{"name": "Pivot"}]},
  "Beheeyem": {"sets": [{"name": "Choice Specs"}, {"name": "Defensive Setup"}, {"name": "Trick Room"}]},
  "Fraxure": {"sets": [{"name": "Dragon Dance"}]},
  "Stunfisk": {"sets": [{"name": "Utility"}]}
}