{
  "Jumpluff": {"sets": [{"name": "Encore"}]},
  "Mawile": {"sets": [{"name": "Defensive"}, {"name": "Offensive"}]},
  "Torterra": {"sets": [{"name": "Tank"}, {"name": "Double Dance"}, {"name": "Choice Band"}, {"name": "Defensive Support"}]},
  "Monferno": {"sets": [{"name": "All-Out-Attacking"}]},
  "Dodrio": {"sets": [{"name": "Physical Attacker"}]},
  "Golduck": {"sets": [{"name": "Cloud Nine"}]},
  "Tentacool": {"sets": [{"name": "Utility"}]},
  "Magikarp": {
    "overview": "<p>There is no excuse for using Magikarp, at all. All comedy value in using it disappeared by about 1998.</p> ",
    "comments": "<h1>Other Options</h1> <p>You could maximize HP at the expense of Speed or Attack to turn OHKOs into 99% chance for OHKOs. You also might as well maximise Special Attack, if only to troll people rating your team. Alternatively, you could just evolve it into Gyarados. Or use Feebas or any of the vast number of Water types available. Seriously, there's like a hundred of them and you picked this one?</p> <h1>Checks and Counters</h1> <p>Stop using an Old Rod.</p> ",
    "sets": [{"name": "One Speed, One Gear, One Moveset", "description": "<h1>Moves</h1> <p>With the nerf of Explosion and Selfdestruct in Gen 5, Magikarp lost out in its main use as a sacrifice to switch in when the opponent goes boom. However, it still hits a respectable 426 with Jolly and Choice Scarf attached, so you might be able to revenge-kill a low-health Dragonite or something. Putting Sandstorm up would do exactly the same thing for all the damage you're dishing out, but let's work with what we have here.</p> <h1>Set Details</h1> <p>Focus Sash is good for making Flail work, especially to lead with. The other items are only mentioned because they are all just about as useful overall.</p> "}],
    "credits": {"teams": [{"name": "Grammar checked by", "members": [{"user_id": 241023, "username": "Kris"}]}], "writtenBy": [{"user_id": 384, "username": "cookie"}]}
  },
  "Natu": {"sets": [{"name": "Magic Bounce Pivot"}]},
  "Unown": {
    "overview": "<p>Some may prefer Alakazam as their Psychic-type of choice, probably thanks to its magnificent moustache, or perhaps the slow and ugly Reuniclus. However, Unown does the job of a Psychic-type just as well this generation as always. To be blunt, it is <strong>unknown why one would choose not to use Unown. Unchanged from DPP, it deals with most of the OU threats that would otherwise roam free—unless it gets hit first, of course.</p> ",
    "comments": "<h1>Other Options</h1> <p>You can literally run any type of Hidden Power! Unown has an option for every type and its power knows no limits—other than being hit by any other opposing Pokemon, of course. Unown wouldn't want to learn any other moves anyway, because it does not need them. Hidden Power is all it needs to wreak havoc, cause despair, and spread fear amongst the opposing team. Using stronger moves such as the boring Fire Blast, Hydro Pump, or Draco Meteor would make Unown a little girl who can't fight and likes to risk a miss that could cost you a game. Unown is no gambler.</p> <h1>Checks and Counters</h1> <p>Literally nothing can counter or check almighty Unown, as it is a force to be reckoned with by all teams. Well, nothing unless you face that rare opposing Pokemon that's either faster, has a damaging move, resists its Hidden Power type, has an existent Special Defense stat, has a priority move, or is just not Unown.</p> ",
    "sets": [
      {
        "name": "The Most Almighty Unown",
        "description": "<h1>Moves</h1> <p>This is Unown's master moveset, perfect and beautiful in its design. Unown is the most versatile of all Pokemon; it can choose from any of the three suggested Hidden Powers to counter the great powerhouses of OU. The damage calculations below showcase its might against the puny Dragon-types and other plebeians weak to Hidden Power Ice:</p> <ul> <li>252+ SpA Choice Specs Unown Hidden Power Ice vs. 0 HP / 0- SpD Tornadus: 76.25 - 90.3%</li> <li>252+ SpA Choice Specs Unown Hidden Power Ice vs. 4 HP / 0 SpD Haxorus: 77.55 - 91.83%</li> <li>252+ SpA Choice Specs Unown Hidden Power Ice vs. 12 HP / 0 SpD Breloom: 97.72 - 115.15%</li> <li>252+ SpA Choice Specs Unown Hidden Power Ice vs. 252 HP / 0 SpD Salamence: 104.56 - 123.85%</li> <li>252+ SpA Choice Specs Unown Hidden Power Ice vs. 252 HP / 0 SpD Gliscor: 122.03 - 144.63%</li> <li>252+ SpA Choice Specs Unown Hidden Power Ice vs. 0 HP / 4 SpD Landorus: 127.89 - 151.72%</li> <li>252+ SpA Choice Specs Unown Hidden Power Ice vs. 0 HP / 0 SpD Landorus-T: 129.15 - 152.97%</li> </ul> <p>It can even OHKO Dragonite after Stealth Rock damage! Unown becomes so powerful that it is also able to crush many other dangerous OU threats, swiftly dispatching them to the depths of Hell they should have never left, should it choose Hidden Power Fighting:</p> <ul> <li>252+ SpA Choice Specs (Unown Hidden Power Fighting vs. 4 HP / 0 SpD Magnezone: 65.95 - 78.01% <li>252+ SpA Choice Specs Unown Hidden Power Fighting vs. 0 HP / 0 SpD Mamoswine: 71.46 - 84.21%</li> <li>252+ SpA Choice Specs Unown Hidden Power Fighting vs. 4 HP / 0 SpD Tyranitar: 99.41 - 118.12%</li> <li>252+ SpA Choice Specs Unown Hidden Power Fighting vs. 4 HP / 0 SpD Magikarp: 145.05 - 170.87%</li> <li>252+ SpA Choice Specs Unown Hidden Power Fighting vs. 0 HP / 0- SpD Cloyster: 147.71 - 174.27%</li> </ul> <p>But that's not all! The third option, being the powerful STAB Psychic-type Hidden Power, will tear to shreds other important opposing forces, such as:</p> <ul> <li>252+ SpA Choice Specs Unown Hidden Power Psychic vs. 0 HP / 0 SpD Venusaur: 84.38 - 100.33%</li> <li>252+ SpA Choice Specs Unown Hidden Power Psychic vs. 0 HP / 0 SpD Keldeo: 86.06 - 102.16%</li> <li>252+ SpA Choice Specs Unown Hidden Power Psychic vs. 0 HP / 4 SpD Terrakion: 86.06 - 102.16%</li> <li>252+ SpA Choice Specs Unown Hidden Power Psychic vs. 252 HP / 0 SpD Conkeldurr: 87.43 - 103.38%</li> <li>252+ SpA Choice Specs Unown Hidden Power Psychic vs. 0 HP / 0- SpD Cloyster: 110.78 - 130.7%</li> <li>252+ SpA Choice Specs Unown Hidden Power Psychic vs. 4 HP / 0 SpD Gengar: 123.66 - 146.56%</li> <li>252+ SpA Choice Specs Unown Hidden Power Psychic vs. 12 HP / 0 SpD Breloom: 146.21 - 172.72%</li> <li>252+ SpA Choice Specs Unown Hidden Power Psychic vs. 4 HP / 0 SpD Magikarp: 217.58 - 256.04%</li> <li>252+ SpA Choice Specs Unown Hidden Power Psychic vs. 4 HP / 0 SpD Toxicroak: 235.06 - 277.92%</li> </ul> <p>After all, who doesn't want almighty and powerful sweepers like Magikarp OHKOed? Unown is a solid staple in any team and it will not deceive you. The ability to OHKO Toxicroak with its superior Psychic-type powers will come in handy when you have to face the troublesome rain teams that plague the current metagame. All of the OU powerhouses will, ultimately, fall to Unown's might.</p> <h1>Set Details</h1> <p>You could run a Timid nature, but Unown does not need to be fast; remember, it has the superb Hidden Power at its disposal. However, the all-powerful Unown will probably have just one chance to attack before it faints, so it may need the Speed against faster foes.</p> <h1>Team Options</h1> <p>Because Dark-types are mean to Unown and will try to Crunch its feeble body, it's generally a good idea to team it up with bullies such as Conkeldurr or Terrakion, who will gladly take the attack and answer with a brutal, well-thrown Superpower. Lucario, the OU Fighting-type outcast, will gladly help Unown as well with its powerful ExtremeSpeed. The mean Ghost-types of OU, Gengar and Jellicent, as well as the hyped-up but less powerful Psychic-types, Alakazam and Reuniclus, may try to hit Unown with a pesky Shadow Ball. Therefore it is recommended to pair Blissey or Chansey with Unown, as they will gladly take Shadow Ball. Steel-types that can deal with these opponents are also helpful, such as Skarmory and Heatran, as they are friendly towards Unown and respect it enough to protect its life and vanquish its foes. Unown will enjoy any type of support your team can give: Stealth Rock, Spikes, Toxic Spikes, Light Screen, Reflect, and spreading paralysis help it shine and let it do its work. In fact, it's highly recommended that you enact your support before letting Unown unleash its fury because, as they say, you'd be better safe than sorry. Unown might not look like the fittest member of your team, but it is a really solid Pokemon that's remained throughout the years because it's never had to change at all! Unown's great power, coverage and movepool allow it to sweep unprepared teams that are unaware of its might.</p> "
      },
      {
        "name": "The Swift Death",
        "description": "<h1>Moves</h1> <p>Whilst this set does not grant the incredible damage Choice Specs Unown can deal, being the speediest in the current metagame—faster than those living in the modern world—is key to success. The most powerful Unown can outspeed several foes with a Timid nature such as Jolly Gliscor, Jolly 176 Speed Jirachi, and Adamant Salamence. Should you choose to take the more powerful choice and try a Modest nature instead, almighty Unown can still outspeed Jolly Gyarados, Timid Heatran, Jolly Breloom and Jolly Cloyster, allowing it to utterly destroy these enemies with the Hidden Power of choice.</p> <h1>Set Details</h1> <p>There are no more options for this set, for Unown runs Hidden Power and only Hidden Power, its pride does not allow it to try other moves. It won't need any other attacks, anyway, as it's the perfect revenge killer and will just need to switch in and deal huge damage to its foe, then run away while a teammate deals with the remnants of the opposition.</p> <h1>Team Options</h1> <p>This set requires the same teammates and help as The Most Almighty Unown, so you'd better read the additional comments there to see how can you utilize the utmost power of Unown.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Grammar checked by", "members": [{"user_id": 109385, "username": "Aurora"}, {"user_id": 32149, "username": "Zystral"}]}], "writtenBy": [{"user_id": 161822, "username": "Joim"}]}
  },
  "Shiftry": {"sets": [{"name": "Choice Specs"}, {"name": "Swords Dance"}]},
  "Rampardos": {"sets": [{"name": "Suicide Lead"}]},
  "Purugly": {"sets": [{"name": "Pivot Attacker"}]},
  "Gabite": {"sets": [{"name": "Utility"}, {"name": "Choice Band"}]},
  "Zebstrika": {"sets": [{"name": "Ol’ Reliable (Volt Switch Pivot)"}]},
  "Swoobat": {"sets": [{"name": "Anti-Setup Wallbreaker"}]},
  "Maractus": {"sets": [{"name": "Spikes"}]},
  "Dwebble": {"sets": [{"name": "Suicide Lead"}]},
  "Scraggy": {
    "overview": "<p>Scraggy is one of the most dangerous setup sweepers in the tier, packing an unresisted STAB combination, great special bulk, and Bulk Up, threatening virtually every team and cementing itself as a top-tier Pokemon. Scraggy's bulk and resistance to Stealth Rock are useful tools that help it check many special attackers like Zebstrika, Beheeyem, and Vanilluxe and set up in front of defensive staples like Stunfisk, Bronzor, Audino, Klang, and Mawile. However, even though Scraggy is a difficult Pokemon to stop once it has boosted a few times and threatens an immense portion of the meta, it can still come up short due to it relying on Shed Skin to decrease its Rest turns, as it is vulnerable to being whittled down while sleeping, leaving it unable to sweep. Its Attack is lackluster before Scraggy sets up, letting checks such as Swanna and Torterra can easily come in on it with little risk.</p> ",
    "sets": [
      {
        "name": "Bulk Up",
        "description": "<p>Bulk Up turns Scraggy into a potential sweeping demon, boosting its initially lackluster Attack stat and decent Defense to alarming levels. Drain Punch is the go-to Fighting-type STAB move, as it provides a secondary source of recovery while having decent damage output once boosted. Crunch is Scraggy's Dark-type STAB move of choice, boasting decent damage output and a way of hitting Fighting resistances at least neutrally. Rest gives it the longevity it needs to accumulate Bulk Up boosts. Shed Skin is the ability of choice as it allows Scraggy to act as a status absorber and potentially wake up sooner after it uses Rest. 20 Speed EVs let it outspeed base 50 Pokemon such as Klang, Audino, and Mawile.</p> <p>Scraggy serves as a great sweeper on stall and balance teams with its great sweeping potential and ability to check to Dark- and Psychic-types. It also proves its worth on offensive teams, being able to clean or weaken foes while acting as a special sponge. Beheeyem is a good partner for Scraggy due to its ability to handle Fighting-types; additionally, Scraggy can use Beheeyem checks such as Klang, Mawile, and Bronzor as set up fodder. Scraggy appreciates faster teammates like Choice Scarf Dodrio and Purugly that can pressure some of Scraggy's most common checks. Choice Scarf Dodrio also offensively checks Fighting-types and Vileplume, Pursuit traps Swoobat, which can heavily damage Scraggy with STAB Air Slash, and baits in Steel-types for Scraggy. On the other hand, Purugly can check threats like Swanna with Fake Out and Return while using U-turn to bring Scraggy on the field more easily, as it baits in Steel-types that Scraggy can set up on; furthermore, it isn't weak to Stealth Rock, which affords it more longevity than Dodrio.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 231726, "username": "Akir"}, {"user_id": 265399, "username": "SergioRules"}]}, {"name": "Grammar checked by", "members": [{"user_id": 277988, "username": "dex"}]}], "writtenBy": [{"user_id": 476616, "username": "LpZ"}]}
  },
  "Duosion": {"sets": [{"name": "Bulky Calm Mind"}]},
  "Swanna": {"sets": [{"name": "SubRoost"}, {"name": "Choice Scarf"}]},
  "Klang": {"sets": [{"name": "Pivot"}]},
  "Beheeyem": {"sets": [{"name": "Choice Specs"}, {"name": "Defensive Setup"}, {"name": "Trick Room"}]},
  "Fraxure": {"sets": [{"name": "Dragon Dance"}]},
  "Stunfisk": {"sets": [{"name": "Utility"}]}
}