{
  "Jumpluff": {"sets": [{"name": "Encore"}]},
  "Mawile": {"sets": [{"name": "Defensive"}, {"name": "Offensive"}]},
  "Torterra": {"sets": [{"name": "Tank"}, {"name": "Double Dance"}, {"name": "Choice Band"}, {"name": "Defensive Support"}]},
  "Monferno": {"sets": [{"name": "All-Out-Attacking"}]},
  "Dodrio": {
    "overview": "<p>With strong STAB moves in Brave Bird and Return, Dodrio is able to threaten a large portion of the BW PU metagame, including the Grass- and Fighting-type threats of the tier like Torterra and Monferno, while its high base 100 Speed allows it to outrun threats such as Swanna and Leafeon. Choice Scarf Dodrio functions as a great late-game cleaner, while Choice Band sets can greatly threaten slower teams and are able to threaten Pokemon like Scraggy even after a few boosts. Unfortunately, Dodrio is incredibly linear, as aside from its STAB attacks, it only sports Pursuit as viable coverage; this means that defensive Pokemon that switch into its attacks such as Klang, Bronzor, and Stunfisk will completely wall Dodrio, while other Pokemon with good defensive stats such as physically defensive Articuno don't mind switching in in a pinch as well. Secondly, Dodrio's main STAB move in Brave Bird causes recoil, which further lessens its already meager longevity when coupled with its weakness to Stealth Rock. Dodrio's dependence on Choice items also makes it extremely prediction reliant, and clicking the wrong move on the wrong turn can turn it into easy setup for the opponent. Finally, while Dodrio's Speed is very good for the tier, it is still slower than Pokemon like Zebstrika and Sneasel, so sets without a Choice Scarf can struggle against these faster foes.</p>",
    "comments": "<h1>Checks and Counters</h1> <p><strong>Steel-types</strong>: Though there are few, Steel-types such as Mawile and Klang are not particularly threatened by Dodrio due to its lack of even neutral coverage to hit them with. These two examples can easily switch into Dodrio and either damage it or cripple it with status, while Bronzor and Mawile freely set up Stealth Rock on it. Only an offensive Mawile set is particularly threatened by Choice Band Dodrio, and even then it can usually switch into one Brave Bird and threaten to do a lot of damage back with Sucker Punch.</p> <p><strong>Ice-types: Bulky Articuno doesn't mind switching into Choice Scarf variants of Dodrio, as it can fire back with super effective STAB attacks. Additionally, Sneasel and Choice Scarf Vanilluxe threaten to outspeed and take out Choice Band Dodrio while also being able to scare off Choice Scarf with their powerful Ice Shards.</p> <p><strong>Electric-types: Zebstrika outspeeds and KOes Choice Band Dodrio, while Choice Scarf Dodrio doesn't always KO Zebstrika with Return. Stunfisk in particular counters Dodrio and can freely switch into it, always threatening to paralyze it with Static or almost KO it with Discharge, while Dodrio's moves do fairly little to it.</p> <p><strong>Revenge killers: The recoil damage on Dodrio's main STAB move paired with its mediocre bulk and weakness to Stealth Rock leaves it very open to faster Choice Scarf users like Rapidash as well as priority users like Monferno, Shiftry, and Purugly. These Pokemon, while unable to switch into strong Brave Birds, can easily threaten Dodrio in return after it has knocked out one of their teammates.</p>",
    "sets": [
      {
        "name": "Choice Scarf",
        "description": "<p>Brave Bird and Return are Dodrio's main STAB moves, helping to check Monferno and Torterra while still being able to hit Zebstrika neutrally. Quick Attack is a decently strong priority move to pick off faster Pokemon like Choice Scarf Rapidash, weather sweepers like Golduck and Shiftry, and other priority users like Monferno. Pursuit is an option to take advantage of the switches that Dodrio forces against Pokemon like Natu, Jumpluff, and Zebstrika that don't appreciate taking strong Brave Birds. Drill Peck is used as a significantly weaker Flying-type STAB move that can still pick off weakened Pokemon without the recoil of Brave Bird. Steel Wing is Dodrio's only real coverage option and has the niche of hitting Rock-types harder, but is hard to justify using over the utility of the other moves. Tangled Feet is the most useable of Dodrio's abilities, giving it an evasion boost if it gets confused. An Adamant nature is preferred for much-needed power, but a Jolly nature can be used to outspeed opposing Choice Scarf users such as Swanna and Mr. Mime.</p> <p>Choice Scarf Dodrio functions well as a late-game cleaner, after bulkier Pokemon such as Beheeyem, Mantine, and Frillish have been worn down in range of its attacks. Due to its lack of coverage, Dodrio needs partners that can help deal with the likes of Mawile, Klang, and Stunfisk. Ground-types like Gabite and Torterra fill this role quite nicely while also helping Dodrio against Electric-types such as Zebstrika, and they can also set up Stealth Rock to wear down Dodrio's checks. Dodrio's own susceptibility to Stealth Rock also makes Tentacool and Natu good partners for being able to keep entry hazards off the field, giving Dodrio the ability to switch in more times over longer games. Dodrio also appreciates momentum support from Pokemon like Monferno, Natu, and Zebstrika so that it can more easily switch into the threats that it would like to check.</p>"
      },
      {
        "name": "Choice Band",
        "description": "<p>The added power of Choice Band pushes the power of Brave Bird and Return high enough to now OHKO Pokemon like defensive Torterra and most Gabite sets, as well as getting a 2HKO on defensive Pokemon like Pelipper. Quick Attack is preferred on Choice Band Dodrio for its ability to pick off weakened threats with much more reliability. Pursuit is extremely useful to damage opposing Pokemon that would normally be threatened by Dodrio, while Drill Peck can be used as a STAB move without recoil.</p> <p>Choice Band Dodrio works very well as an early-game wallbreaker, as its high-powered moves can severely weaken even some of its sturdier checks and a strong, well-timed Pursuit can help weaken Pokemon for Dodrio's teammates such as Jumpluff and Zebstrika. Many of the same Pokemon that work well with Choice Scarf Dodrio also work well with its Choice Band set such as Natu, Tentacool, and momentum users. However, Choice Band Dodrio also appreciates some extra support to handle Zebstrika and Sneasel, since it has no chance of outspeeding them normally. Ground-types like Gabite and Torterra work well to help against Zebstrika, with special mention to Stunfisk, as it doesn't have a 4x weakness to Hidden Power Ice. Ice-type checks such as Monferno and defensive Mawile help to keep Sneasel under control. Pokemon like Stunfisk, Dwebble, or Maractus can set up Stealth Rock or Spikes, which can help make Dodrio's attacks guarantee OHKOs on Pokemon like defensive Beheeyem and Audino. Pokemon like Torterra and Scraggy greatly fear Choice Band Dodrio, so Pokemon that can take advantage of them being knocked out like one's own Torterra, Gabite, and Beheeyem make great partners.</p>"
      }
    ],
    "credits": {"writtenBy": [{"username": "SergioRules", "user_id": 265399}], "teams": [{"name": "Quality checked by", "members": [{"username": "Akir", "user_id": 231726}, {"username": "SBPC", "user_id": 468904}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}]}]}
  },
  "Shiftry": {"sets": [{"name": "Choice Specs"}, {"name": "Swords Dance"}]},
  "Golduck": {"sets": [{"name": "Cloud Nine"}]},
  "Tentacool": {"sets": [{"name": "Utility"}]},
  "Magikarp": {
    "overview": "<p>There is no excuse for using Magikarp, at all. All comedy value in using it disappeared by about 1998.</p>",
    "comments": "<h1>Other Options</h1> <p>You could maximize HP at the expense of Speed or Attack to turn OHKOs into 99% chance for OHKOs. You also might as well maximise Special Attack, if only to troll people rating your team. Alternatively, you could just evolve it into Gyarados. Or use Feebas or any of the vast number of Water types available. Seriously, there's like a hundred of them and you picked this one?</p> <h1>Checks and Counters</h1> <p>Stop using an Old Rod.</p>",
    "sets": [{"name": "One Speed, One Gear, One Moveset", "description": "<h1>Moves</h1> <p>With the nerf of Explosion and Selfdestruct in Gen 5, Magikarp lost out in its main use as a sacrifice to switch in when the opponent goes boom. However, it still hits a respectable 426 with Jolly and Choice Scarf attached, so you might be able to revenge-kill a low-health Dragonite or something. Putting Sandstorm up would do exactly the same thing for all the damage you're dishing out, but let's work with what we have here.</p> <h1>Set Details</h1> <p>Focus Sash is good for making Flail work, especially to lead with. The other items are only mentioned because they are all just about as useful overall.</p>"}],
    "credits": {"writtenBy": [{"username": "cookie", "user_id": 384}], "teams": [{"name": "Grammar checked by", "members": [{"username": "Kris", "user_id": 241023}]}]}
  },
  "Natu": {"sets": [{"name": "Magic Bounce Pivot"}]},
  "Unown": {
    "overview": "<p>Some may prefer Alakazam as their Psychic-type of choice, probably thanks to its magnificent moustache, or perhaps the slow and ugly Reuniclus. However, Unown does the job of a Psychic-type just as well this generation as always. To be blunt, it is <strong>unknown why one would choose not to use Unown. Unchanged from DPP, it deals with most of the OU threats that would otherwise roam free—unless it gets hit first, of course.</p>",
    "comments": "<h1>Other Options</h1> <p>You can literally run any type of Hidden Power! Unown has an option for every type and its power knows no limits—other than being hit by any other opposing Pokemon, of course. Unown wouldn't want to learn any other moves anyway, because it does not need them. Hidden Power is all it needs to wreak havoc, cause despair, and spread fear amongst the opposing team. Using stronger moves such as the boring Fire Blast, Hydro Pump, or Draco Meteor would make Unown a little girl who can't fight and likes to risk a miss that could cost you a game. Unown is no gambler.</p> <h1>Checks and Counters</h1> <p>Literally nothing can counter or check almighty Unown, as it is a force to be reckoned with by all teams. Well, nothing unless you face that rare opposing Pokemon that's either faster, has a damaging move, resists its Hidden Power type, has an existent Special Defense stat, has a priority move, or is just not Unown.</p>",
    "sets": [
      {
        "name": "The Most Almighty Unown",
        "description": "<h1>Moves</h1> <p>This is Unown's master moveset, perfect and beautiful in its design. Unown is the most versatile of all Pokemon; it can choose from any of the three suggested Hidden Powers to counter the great powerhouses of OU. The damage calculations below showcase its might against the puny Dragon-types and other plebeians weak to Hidden Power Ice:</p> <ul> <li>252+ SpA Choice Specs Unown Hidden Power Ice vs. 0 HP / 0- SpD Tornadus: 76.25 - 90.3%</li> <li>252+ SpA Choice Specs Unown Hidden Power Ice vs. 4 HP / 0 SpD Haxorus: 77.55 - 91.83%</li> <li>252+ SpA Choice Specs Unown Hidden Power Ice vs. 12 HP / 0 SpD Breloom: 97.72 - 115.15%</li> <li>252+ SpA Choice Specs Unown Hidden Power Ice vs. 252 HP / 0 SpD Salamence: 104.56 - 123.85%</li> <li>252+ SpA Choice Specs Unown Hidden Power Ice vs. 252 HP / 0 SpD Gliscor: 122.03 - 144.63%</li> <li>252+ SpA Choice Specs Unown Hidden Power Ice vs. 0 HP / 4 SpD Landorus: 127.89 - 151.72%</li> <li>252+ SpA Choice Specs Unown Hidden Power Ice vs. 0 HP / 0 SpD Landorus-T: 129.15 - 152.97%</li> </ul> <p>It can even OHKO Dragonite after Stealth Rock damage! Unown becomes so powerful that it is also able to crush many other dangerous OU threats, swiftly dispatching them to the depths of Hell they should have never left, should it choose Hidden Power Fighting:</p> <ul> <li>252+ SpA Choice Specs Unown Hidden Power Fighting vs. 4 HP / 0 SpD Magnezone: 65.95 - 78.01% <li>252+ SpA Choice Specs Unown Hidden Power Fighting vs. 0 HP / 0 SpD Mamoswine: 71.46 - 84.21%</li> <li>252+ SpA Choice Specs Unown Hidden Power Fighting vs. 4 HP / 0 SpD Tyranitar: 99.41 - 118.12%</li> <li>252+ SpA Choice Specs Unown Hidden Power Fighting vs. 4 HP / 0 SpD Magikarp: 145.05 - 170.87%</li> <li>252+ SpA Choice Specs Unown Hidden Power Fighting vs. 0 HP / 0- SpD Cloyster: 147.71 - 174.27%</li> </ul> <p>But that's not all! The third option, being the powerful STAB Psychic-type Hidden Power, will tear to shreds other important opposing forces, such as:</p> <ul> <li>252+ SpA Choice Specs Unown Hidden Power Psychic vs. 0 HP / 0 SpD Venusaur: 84.38 - 100.33%</li> <li>252+ SpA Choice Specs Unown Hidden Power Psychic vs. 0 HP / 0 SpD Keldeo: 86.06 - 102.16%</li> <li>252+ SpA Choice Specs Unown Hidden Power Psychic vs. 0 HP / 4 SpD Terrakion: 86.06 - 102.16%</li> <li>252+ SpA Choice Specs Unown Hidden Power Psychic vs. 252 HP / 0 SpD Conkeldurr: 87.43 - 103.38%</li> <li>252+ SpA Choice Specs Unown Hidden Power Psychic vs. 0 HP / 0- SpD Cloyster: 110.78 - 130.7%</li> <li>252+ SpA Choice Specs Unown Hidden Power Psychic vs. 4 HP / 0 SpD Gengar: 123.66 - 146.56%</li> <li>252+ SpA Choice Specs Unown Hidden Power Psychic vs. 12 HP / 0 SpD Breloom: 146.21 - 172.72%</li> <li>252+ SpA Choice Specs Unown Hidden Power Psychic vs. 4 HP / 0 SpD Magikarp: 217.58 - 256.04%</li> <li>252+ SpA Choice Specs Unown Hidden Power Psychic vs. 4 HP / 0 SpD Toxicroak: 235.06 - 277.92%</li> </ul> <p>After all, who doesn't want almighty and powerful sweepers like Magikarp OHKOed? Unown is a solid staple in any team and it will not deceive you. The ability to OHKO Toxicroak with its superior Psychic-type powers will come in handy when you have to face the troublesome rain teams that plague the current metagame. All of the OU powerhouses will, ultimately, fall to Unown's might.</p> <h1>Set Details</h1> <p>You could run a Timid nature, but Unown does not need to be fast; remember, it has the superb Hidden Power at its disposal. However, the all-powerful Unown will probably have just one chance to attack before it faints, so it may need the Speed against faster foes.</p> <h1>Team Options</h1> <p>Because Dark-types are mean to Unown and will try to Crunch its feeble body, it's generally a good idea to team it up with bullies such as Conkeldurr or Terrakion, who will gladly take the attack and answer with a brutal, well-thrown Superpower. Lucario, the OU Fighting-type outcast, will gladly help Unown as well with its powerful ExtremeSpeed. The mean Ghost-types of OU, Gengar and Jellicent, as well as the hyped-up but less powerful Psychic-types, Alakazam and Reuniclus, may try to hit Unown with a pesky Shadow Ball. Therefore it is recommended to pair Blissey or Chansey with Unown, as they will gladly take Shadow Ball. Steel-types that can deal with these opponents are also helpful, such as Skarmory and Heatran, as they are friendly towards Unown and respect it enough to protect its life and vanquish its foes. Unown will enjoy any type of support your team can give: Stealth Rock, Spikes, Toxic Spikes, Light Screen, Reflect, and spreading paralysis help it shine and let it do its work. In fact, it's highly recommended that you enact your support before letting Unown unleash its fury because, as they say, you'd be better safe than sorry. Unown might not look like the fittest member of your team, but it is a really solid Pokemon that's remained throughout the years because it's never had to change at all! Unown's great power, coverage and movepool allow it to sweep unprepared teams that are unaware of its might.</p>"
      },
      {
        "name": "The Swift Death",
        "description": "<h1>Moves</h1> <p>Whilst this set does not grant the incredible damage Choice Specs Unown can deal, being the speediest in the current metagame—faster than those living in the modern world—is key to success. The most powerful Unown can outspeed several foes with a Timid nature such as Jolly Gliscor, Jolly 176 Speed Jirachi, and Adamant Salamence. Should you choose to take the more powerful choice and try a Modest nature instead, almighty Unown can still outspeed Jolly Gyarados, Timid Heatran, Jolly Breloom and Jolly Cloyster, allowing it to utterly destroy these enemies with the Hidden Power of choice.</p> <h1>Set Details</h1> <p>There are no more options for this set, for Unown runs Hidden Power and only Hidden Power, its pride does not allow it to try other moves. It won't need any other attacks, anyway, as it's the perfect revenge killer and will just need to switch in and deal huge damage to its foe, then run away while a teammate deals with the remnants of the opposition.</p> <h1>Team Options</h1> <p>This set requires the same teammates and help as The Most Almighty Unown, so you'd better read the additional comments there to see how can you utilize the utmost power of Unown.</p>"
      }
    ],
    "credits": {"writtenBy": [{"username": "Joim", "user_id": 161822}], "teams": [{"name": "Grammar checked by", "members": [{"username": "aurora", "user_id": 109385}, {"username": "Zystral", "user_id": 32149}]}]}
  },
  "Rampardos": {"sets": [{"name": "Suicide Lead"}]},
  "Purugly": {"sets": [{"name": "Pivot Attacker"}]},
  "Gabite": {"sets": [{"name": "Utility"}, {"name": "Choice Band"}]},
  "Zebstrika": {"sets": [{"name": "Ol’ Reliable (Volt Switch Pivot)"}]},
  "Swoobat": {
    "overview": "<p>The stars aligned in an interesting way for Swoobat, giving it one of the most unique niches in PU. Swoobat utilizes its Unaware ability to shut down setup threats like Beheeyem and Monferno and 2HKOes most foes by ignoring any defensive stat boosts. Combined with excellent base 114 Speed and great STAB coverage, Swoobat becomes a menace to offense and balance teams alike and, as a result, is an incredible asset to offense teams. However, even with all of this, it can still come up short. Swoobat outspeeds almost all of the tier but fails to outspeed Zebstrika and Sneasel, two threats that shut it down with their STAB attacks. On top of that, Swoobat's low natural Special Attack means that it can struggle greatly against bulkier teams.</p>",
    "sets": [
      {
        "name": "Choiced Disruptor",
        "description": "<p>Psychic does solid neutral damage to a large portion of the tier, making it a strong spammable option. Signal Beam is also crucial, bypassing the defensive boosts of Calm Mind Beheeyem and Duosion while also hitting Dark-types such as Shiftry. U-turn allows Swoobat to slot effectively into offensive VoltTurn teams. The last slot is versatile and depends on what threats Swoobat needs to shut down for your specific team. Air Slash stops Scraggy from safely setting up, whereas Heat Wave stops Shift Gear Klang. Trick is also an option for shutting down any wall that might try and stop Swoobat, such as Audino or Articuno.</p> <p>Swoobat is an effective anti-setup option for offensive teams, beating setup sweepers such as Beheeyem thanks to Unaware. Swoobat also checks Monferno especially well, as it is one of the few checks that does not fear a boosted Mach Punch. However, despite having Choice Specs, Swoobat is a subpar dedicated wallbreaker. Pairing Swoobat with other wallbreakers such as Choice Band Monferno and Swords Dance Torterra is an excellent decision, as both of those choices threaten common Swoobat counters like Audino, while Swoobat can use U-turn to safely bring them in. Another factor to consider is that Swoobat's Speed is just barely not enough; as such, having priority, a bulky teammate, or a Choice Scarf user to outspeed possible threats like Zebstrika is necessary. Mach Punch Monferno and Stunfisk are potential options. Swoobat also must choose between beating Scraggy or Klang, so having a partner like Swanna or Stunfisk that can threaten what Swoobat can't will also be beneficial. Remember that Swoobat's primary job is to beat setup threats and threaten frail and slower offensive Pokemon, not to wallbreak.</p> <h1>Checks and Counters</h1> <p><strong>Specially Defensive Pokemon: Threats such as Audino and Articuno can consistently[B] [/B]wall Swoobat throughout a match. Even Scraggy and Klang can wall Swoobat if it lacks the proper coverage move. All of these Pokemon do fear the rare Trick, but not enough to dissuade them from coming in whenever Swoobat is out.</p> <p><strong>Faster Pokemon</strong>: Swoobat is exceptionally fast, but Pokemon such as Zebstrika and Sneasel are even faster and easily revenge kill it with their STAB moves. Similarly, common Choice Scarf users such as Dodrio and Golduck can also outspeed and prey upon Swoobat. Very[B] [/B]few of these fast threats want to switch into Swoobat directly, but when they are able to come in safely, they easily[B] [/B]force Swoobat out.</p> <p><strong>Dark-types: Psychic is usually a safe move to lock into, but a Dark-type such as Shiftry or Scraggy can make use of the opportunity to set up or threaten Swoobat. Dark-types do have to fear Swoobat's coverage, however, as even a U-turn can be crippling to Shiftry.</p> <p><strong>Priority Attacks</strong>: Threats such as Purugly can ignore Swoobat's superior Speed and KO it[B] [/B]with priority attacks like Fake Out and Sucker Punch. It is also noteworthy that most offensive users of Sucker Punch, such as Shiftry, can cleanly[B] [/B]KO Swoobat with it after just one round of Stealth Rock damage.</p>"
      }
    ],
    "credits": {"writtenBy": [{"username": "Akir", "user_id": 231726}], "teams": [{"name": "Quality checked by", "members": [{"username": "SergioRules", "user_id": 265399}, {"username": "SBPC", "user_id": 468904}]}, {"name": "Grammar checked by", "members": [{"username": "Rabia", "user_id": 336073}]}]}
  },
  "Maractus": {"sets": [{"name": "Spikes"}]},
  "Dwebble": {"sets": [{"name": "Suicide Lead"}]},
  "Scraggy": {
    "overview": "<p>Scraggy is one of the most dangerous setup sweepers in the tier, packing an unresisted STAB combination, great special bulk, and Bulk Up, threatening virtually every team and cementing itself as a top-tier Pokemon. Scraggy's bulk and resistance to Stealth Rock are useful tools that help it check many special attackers like Zebstrika, Beheeyem, and Vanilluxe and set up in front of defensive staples like Stunfisk, Bronzor, Audino, Klang, and Mawile. However, even though Scraggy is a difficult Pokemon to stop once it has boosted a few times and threatens an immense portion of the meta, it can still come up short due to it relying on Shed Skin to decrease its Rest turns, as it is vulnerable to being whittled down while sleeping, leaving it unable to sweep. Its Attack is lackluster before Scraggy sets up, letting checks such as Swanna and Torterra can easily come in on it with little risk.</p>",
    "comments": "<h1>Other Options</h1> <p><strong>Fighting-types</strong>: Monferno and Machoke can take Scraggy's hits with relative ease and threaten it back with their Fighting-type STAB moves, 2HKOing it even after a Bulk Up boost. However, they have to be careful of being continuously damaged if they lack recovery.</p> <p><strong>Flying-types: Swanna is able to check Scraggy with its strong Hurricane and access to Roost. Pelipper has the same tools in Hurricane and Roost, but it trades Swanna's power and speed for bulk, allowing it to directly switch into Scraggy more easily. Dodrio can't switch into it directly due to its frailty, but its Brave Bird can OHKO Scraggy. Jumpluff is another offensive check that can't switch in directly because of its lack of recovery and weakness to Stealth Rock, but it can deal with Scraggy with Flying Gem-boosted Acrobatics or Encore, which prevents Scraggy from snowballing. Choice Specs Swoobat 2HKOs Scraggy with Air Slash; however, it needs to be wary of Crunch.</p> <p><strong>Torterra and Vileplume: Both of these Grass-types make use of their great physical bulk and access to Swords Dance and consistent recovery to set up alongside and outlast Scraggy. Choice Band Torterra can hit Scraggy really hard even after a Bulk Up, but it is more prone to getting worn down.</p>",
    "sets": [
      {
        "name": "Bulk Up",
        "description": "<p>Bulk Up turns Scraggy into a potential sweeping demon, boosting its initially lackluster Attack stat and decent Defense to alarming levels. Drain Punch is the go-to Fighting-type STAB move, as it provides a secondary source of recovery while having decent damage output once boosted. Crunch is Scraggy's Dark-type STAB move of choice, boasting decent damage output and a way of hitting Fighting resistances at least neutrally. Rest gives it the longevity it needs to accumulate Bulk Up boosts. Shed Skin is the ability of choice as it allows Scraggy to act as a status absorber and potentially wake up sooner after it uses Rest. 20 Speed EVs let it outspeed base 50 Pokemon such as Klang, Audino, and Mawile.</p> <p>Scraggy serves as a great sweeper on stall and balance teams with its great sweeping potential and ability to check to Dark- and Psychic-types. It also proves its worth on offensive teams, being able to clean or weaken foes while acting as a special sponge. Beheeyem is a good partner for Scraggy due to its ability to handle Fighting-types; additionally, Scraggy can use Beheeyem checks such as Klang, Mawile, and Bronzor as set up fodder. Scraggy appreciates faster teammates like Choice Scarf Dodrio and Purugly that can pressure some of Scraggy's most common checks. Choice Scarf Dodrio also offensively checks Fighting-types and Vileplume, Pursuit traps Swoobat, which can heavily damage Scraggy with STAB Air Slash, and baits in Steel-types for Scraggy. On the other hand, Purugly can check threats like Swanna with Fake Out and Return while using U-turn to bring Scraggy on the field more easily, as it baits in Steel-types that Scraggy can set up on; furthermore, it isn't weak to Stealth Rock, which affords it more longevity than Dodrio.</p>"
      }
    ],
    "credits": {"writtenBy": [{"username": "LpZ", "user_id": 476616}], "teams": [{"name": "Quality checked by", "members": [{"username": "Akir", "user_id": 231726}, {"username": "SergioRules", "user_id": 265399}]}, {"name": "Grammar checked by", "members": [{"username": "dex", "user_id": 277988}]}]}
  },
  "Duosion": {"sets": [{"name": "Bulky Calm Mind"}]},
  "Swanna": {"sets": [{"name": "SubRoost"}, {"name": "Choice Scarf"}]},
  "Klang": {"sets": [{"name": "Pivot"}]},
  "Beheeyem": {"sets": [{"name": "Choice Specs"}, {"name": "Defensive Setup"}, {"name": "Trick Room"}]},
  "Fraxure": {"sets": [{"name": "Dragon Dance"}]},
  "Stunfisk": {"sets": [{"name": "Utility"}]}
}