{
  "Jumpluff": {"sets": [{"name": "Encore"}]},
  "Mawile": {"sets": [{"name": "Defensive"}, {"name": "Offensive"}]},
  "Torterra": {"sets": [{"name": "Tank"}, {"name": "Double Dance"}, {"name": "Choice Band"}, {"name": "Defensive Support"}]},
  "Monferno": {"sets": [{"name": "All-Out-Attacking"}]},
  "Dodrio": {"sets": [{"name": "Physical Attacker"}]},
  "Golduck": {"sets": [{"name": "Cloud Nine"}]},
  "Tentacool": {"sets": [{"name": "Utility"}]},
  "Natu": {"sets": [{"name": "Magic Bounce Pivot"}]},
  "Shiftry": {"sets": [{"name": "Choice Specs"}, {"name": "Swords Dance"}]},
  "Rampardos": {"sets": [{"name": "Suicide Lead"}]},
  "Purugly": {"sets": [{"name": "Pivot Attacker"}]},
  "Gabite": {"sets": [{"name": "Utility"}, {"name": "Choice Band"}]},
  "Zebstrika": {"sets": [{"name": "Ol’ Reliable (Volt Switch Pivot)"}]},
  "Swoobat": {"sets": [{"name": "Anti-Setup Wallbreaker"}]},
  "Maractus": {"sets": [{"name": "Spikes"}]},
  "Dwebble": {"sets": [{"name": "Suicide Lead"}]},
  "Scraggy": {
    "overview": "<p>Scraggy is one of the most dangerous setup sweepers in the tier, packing an unresisted STAB combination, great special bulk, and Bulk Up, threatening virtually every team and cementing itself as a top-tier Pokemon. Scraggy's bulk and resistance to Stealth Rock are useful tools that help it check many special attackers like Zebstrika, Beheeyem, and Vanilluxe and set up in front of defensive staples like Stunfisk, Bronzor, Audino, Klang, and Mawile. However, even though Scraggy is a difficult Pokemon to stop once it has boosted a few times and threatens an immense portion of the meta, it can still come up short due to it relying on Shed Skin to decrease its Rest turns, as it is vulnerable to being whittled down while sleeping, leaving it unable to sweep. Its Attack is lackluster before Scraggy sets up, letting checks such as Swanna and Torterra can easily come in on it with little risk.</p> ",
    "sets": [
      {
        "name": "Bulk Up",
        "description": "<p>Bulk Up turns Scraggy into a potential sweeping demon, boosting its initially lackluster Attack stat and decent Defense to alarming levels. Drain Punch is the go-to Fighting-type STAB move, as it provides a secondary source of recovery while having decent damage output once boosted. Crunch is Scraggy's Dark-type STAB move of choice, boasting decent damage output and a way of hitting Fighting resistances at least neutrally. Rest gives it the longevity it needs to accumulate Bulk Up boosts. Shed Skin is the ability of choice as it allows Scraggy to act as a status absorber and potentially wake up sooner after it uses Rest. 20 Speed EVs let it outspeed base 50 Pokemon such as Klang, Audino, and Mawile.</p> <p>Scraggy serves as a great sweeper on stall and balance teams with its great sweeping potential and ability to check to Dark- and Psychic-types. It also proves its worth on offensive teams, being able to clean or weaken foes while acting as a special sponge. Beheeyem is a good partner for Scraggy due to its ability to handle Fighting-types; additionally, Scraggy can use Beheeyem checks such as Klang, Mawile, and Bronzor as set up fodder. Scraggy appreciates faster teammates like Choice Scarf Dodrio and Purugly that can pressure some of Scraggy's most common checks. Choice Scarf Dodrio also offensively checks Fighting-types and Vileplume, Pursuit traps Swoobat, which can heavily damage Scraggy with STAB Air Slash, and baits in Steel-types for Scraggy. On the other hand, Purugly can check threats like Swanna with Fake Out and Return while using U-turn to bring Scraggy on the field more easily, as it baits in Steel-types that Scraggy can set up on; furthermore, it isn't weak to Stealth Rock, which affords it more longevity than Dodrio.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 231726, "username": "Akir"}, {"user_id": 265399, "username": "SergioRules"}]}, {"name": "Grammar checked by", "members": [{"user_id": 277988, "username": "dex"}]}], "writtenBy": [{"user_id": 476616, "username": "LpZ"}]}
  },
  "Duosion": {"sets": [{"name": "Bulky Calm Mind"}]},
  "Swanna": {"sets": [{"name": "SubRoost"}, {"name": "Choice Scarf"}]},
  "Klang": {"sets": [{"name": "Pivot"}]},
  "Beheeyem": {"sets": [{"name": "Choice Specs"}, {"name": "Defensive Setup"}, {"name": "Trick Room"}]},
  "Fraxure": {"sets": [{"name": "Dragon Dance"}]},
  "Stunfisk": {"sets": [{"name": "Utility"}]}
}