{
  "Ivysaur": {"sets": [{"name": "Physical Wall"}]},
  "Beedrill": {"sets": [{"name": "Offensive Toxic Spikes"}]},
  "Pikachu": {"sets": [{"name": "Revenge Killer"}]},
  "Raichu": {"sets": [{"name": "Nasty Plot"}, {"name": "Choice Specs"}]},
  "Clefairy": {"sets": [{"name": "Physical Wall"}, {"name": "Special Wall"}]},
  "Mr. Mime": {"sets": [{"name": "Choice Scarf"}, {"name": "Nasty Plot"}, {"name": "Choice Specs"}, {"name": "Dual Screen"}]},
  "Meganium": {"sets": [{"name": "Specially Defensive"}, {"name": "Swords Dance"}, {"name": "Choice Specs"}]},
  "Granbull": {"sets": [{"name": "Choice Band"}]},
  "Marshtomp": {"sets": [{"name": "Bulky Stealth Rock"}]},
  "Exploud": {"sets": [{"name": "Special Attacker"}, {"name": "Choice Band"}]},
  "Kecleon": {"sets": [{"name": "Special Wall"}]},
  "Pignite": {"sets": [{"name": "Tank"}]},
  "Simisear": {"sets": [{"name": "Nasty Plot"}, {"name": "All-Out Attacker"}, {"name": "Work Up"}, {"name": "Choice Scarf"}, {"name": "Choice Specs"}]},
  "Leavanny": {"sets": [{"name": "Agility"}]},
  "Venipede": {"sets": [{"name": "Hazard Setter"}]},
  "Lampent": {"sets": [{"name": "Calm Mind"}, {"name": "Choice Specs"}, {"name": "Stallbreaker"}]},
  "Arbok": {"sets": [{"name": "Coil"}]},
  "Corsola": {"sets": [{"name": "Physical Wall"}]},
  "Pelipper": {"sets": [{"name": "Defensive Pivot"}, {"name": "Offensive Pivot"}, {"name": "Agility"}]},
  "Illumise": {"sets": [{"name": "Sun Setter"}]},
  "Lunatone": {"sets": [{"name": "Calm Mind"}]},
  "Solrock": {
    "sets": [
      {"name": "Physical Wall"},
      {
        "name": "Rock Polish",
        "description": "<p>Rock Polish and high Attack make Solrock an effective sweeper, while its typing combined with Levitate let it set up on common offensive foes like Persian, Muk, and Emolga. EdgeQuake threatens the majority of the tier for significant damage. Flying Gem combined with Acrobatics gives Solrock the means to threaten EdgeQuake's best switch-ins, namely Grass-types like Leafeon and Fighting-types like Mienfoo.</p> <p>Solrock best fits on offensive teams looking for a cleaner. Solrock struggles the most against physical walls that don't mind its coverage, like physically defensive Clefairy, Wormadam-S, and physically defensive Solrock. Thus, checks to them, like special wallbreakers such as Simisear, or stallbreakers such as Grumpig, are essential partners. Some physically bulky Grass-types like Meganium and Ivysaur can tank a Flying Gem-boosted Acrobatics at full health, so teammates that can handle them like Muk and the aforementioned Simisear are also needed. These Grass-types are also great partners to Solrock, as they check Water-types like Whiscash and Kingler, which can tank whatever attacks Solrock throws at them.</p> "
      },
      {"name": "Suicide Lead"},
      {"name": "Choice Band"}
    ],
    "credits": {"writtenBy": [{"username": "Gangsta Spongebob", "user_id": 535530}], "teams": [{"name": "Quality checked by", "members": [{"username": "Monai", "user_id": 482455}, {"username": "Mirbro", "user_id": 451786}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Chimecho": {"sets": [{"name": "Physical Wall"}, {"name": "Calm Mind"}]},
  "Wormadam-Sandy": {"sets": [{"name": "Utility"}]},
  "Wormadam-Trash": {"sets": [{"name": "Physical Wall"}]},
  "Vanilluxe": {"sets": [{"name": "Choice Scarf"}, {"name": "Autotomize"}, {"name": "Choice Specs"}]},
  "Leafeon": {"sets": [{"name": "Swords Dance"}, {"name": "Cleric"}]},
  "Glaceon": {"sets": [{"name": "Choice Specs"}, {"name": "Choice Scarf"}]},
  "Raticate": {"sets": [{"name": "Guts Attacker"}, {"name": "Choice Scarf"}]},
  "Fearow": {"sets": [{"name": "Choice Band"}, {"name": "Choice Scarf"}]},
  "Sandshrew": {"sets": [{"name": "Hazard Utility"}]},
  "Gloom": {"sets": [{"name": "Physically Defensive"}]},
  "Persian": {"sets": [{"name": "Offensive Pivot"}, {"name": "Choice Scarf"}, {"name": "Mixed Wallbreaker"}, {"name": "Weather Setter"}]},
  "Abra": {"sets": [{"name": "Revenge Killer"}]},
  "Weepinbell": {"sets": [{"name": "Sun Sweeper"}]},
  "Graveler": {"sets": [{"name": "Tank"}]},
  "Magnemite": {"sets": [{"name": "Magnet Pull"}]},
  "Muk": {"sets": [{"name": "All-Out Attacker"}, {"name": "Choice Band"}, {"name": "CroMuk"}, {"name": "SubPunch"}]},
  "Gastly": {"sets": [{"name": "Choice Scarf"}, {"name": "Stallbreaker"}, {"name": "SubSplit"}]},
  "Onix": {"sets": [{"name": "Sun Lead"}]},
  "Kingler": {"sets": [{"name": "Choice Scarf"}, {"name": "Swords Dance"}, {"name": "Double Dance"}, {"name": "Agility"}]},
  "Seaking": {"sets": [{"name": "Offensive Rain Dance"}]},
  "Staryu": {"sets": [{"name": "Physically Defensive"}, {"name": "Mixed Wall"}]},
  "Magmar": {"sets": [{"name": "Physical All-Out Attacker"}, {"name": "SubPunch"}, {"name": "SubStatus"}]},
  "Flareon": {"sets": [{"name": "All-Out Attacker"}, {"name": "Special Wall"}]},
  "Sudowoodo": {"sets": [{"name": "Offensive Stealth Rock"}]},
  "Girafarig": {"sets": [{"name": "Mixed Attacker"}]},
  "Pineco": {"sets": [{"name": "Suicide Lead"}]},
  "Octillery": {"sets": [{"name": "Special Attacker"}, {"name": "Physical Attacker"}]},
  "Mightyena": {"sets": [{"name": "Stallbreaker"}, {"name": "Substitute + 3 Attacks"}]},
  "Slaking": {
    "comments": "<h1>Other Options</h1> <p>Giga Impact is Slaking’s strongest move, and Truant means Slaking would skip the next turn anyway, but it's situational since it forces Slaking to stay in. Hammer Arm on the Choice Band set punishes physically defensive Clefairy while retaining coverage for Rock- and Steel-types, but it is less accurate than Earthquake and lowers Slaking's Speed.</p> <h1>Checks and Counters</h1> <p><strong>Protect and Substitute: Pokemon sporting Protect like Grumpig, Muk, and defensive variants of Leafeon and Shelgon can block every attack from Slaking, using it as setup fodder when Truant activates. If Substitute users like Simisear and Whiscash can set up a Substitute while Slaking is loafing around, they can automatically beat it.</p> <p><strong>Ghost-types: Frillish stands out as one of Slaking’s worst matchups, stomaching a Night Slash even after Stealth Rock. Frillish can cripple it with status or switch to a different teammate as Truant activates. Other Ghost-types like Lampent and Gastly can also switch into Return, but they must be much more careful with Slaking’s Dark-type coverage, and Earthquake for the former.</p> <p><strong>Rock- and Steel-types: Pokemon like Graveler, Lairon, and Pawniard can come in freely on anything but Earthquake, and they can retaliate by either setting up Stealth Rock or freely pivoting to other teammates. Solrock instead can come in on Earthquake but fears Night Slash. Wormadam-S particularly stands out, comfortably tanking any attack Slaking commonly runs and regularly running Protect.</p> <p><strong>Physical Walls: Physical walls like Hippopotas and Gloom can stomach even a Choice Band-boosted Return, recover the damage off, and freely use their utility moves when Truant activates.</p> <p><strong>Faster Pokemon: Although Slaking sits at a good Speed tier, naturally faster Pokemon like Emolga and Simisear, and Choice Scarf users like Mr. Mime and Glaceon, can pick off Choice Band Slaking with enough chip damage. However, they must be aware of Slaking boasting a Choice Scarf of its own—note that, if Slaking KOes a foe with a move that didn't require Choice Band to KO, opponents may not discover Slaking's item.</p> ",
    "sets": [
      {
        "name": "Choice Band",
        "description": "<p>With the highest Attack stat in ZU, a wide offensive movepool, and a great Speed tier, Slaking stands out as a dangerous wallbreaker. Double-Edge can be used over Return for extra power at the cost of wearing Slaking down more quickly. Earthquake crushes Steel-types like Lairon and Pawniard and significantly damages Graveler. Night Slash targets Solrock and Ghost-types like Frillish and Gastly. Sucker Punch picks off faster Pokemon like Simisear, Emolga, and Persian with enough chip damage. Pursuit traps frail attackers like Persian, Pikachu, non-Protect Grumpig, and Mr. Mime. Pursuit can also remove sufficiently weakened defensive Pokemon, such as Frillish, specially defensive Clefairy, and Solrock.</p> <p>Slaking best fits on balance teams due to its hit-and-run nature: it provides great offense, but it needs bulkier teammates to come in and tank hits if Truant forces it out. Staryu stands out as a great partner, pressuring Rock- and Steel-types with Scald and Frillish with Toxic, as well as removing entry hazards to improve Slaking's longevity. Pivots such as Emolga and Vibrava allow Slaking an easier time entering the field safely. Pokemon that commonly carry Protect, like Grumpig and Muk, can be especially problematic for Slaking; teammates like Emolga and Arbok can check them with their faster Speed or super effective coverage, respectively. Ground- and Fighting-types like Mienfoo, Hippopotas, and Whiscash can check Steel-types, while Grass-types like Meganium and Ivysaur can check Frillish and Solrock. Once Slaking has sufficiently damaged teams, offensive partners like Muk and Simisear can clean up late-game.</p> "
      },
      {"name": "Choice Scarf", "description": "<p>Choice Scarf Slaking outpaces the entire unboosted metagame, serving as a strong revenge killer. Double-Edge provides higher damage output at the cost of recoil. Earthquake allows Slaking to revenge kill Rock Polish Lairon and the uncommon Pawniard. Night Slash targets Solrock and Ghost-types like Frillish and Gastly. Pursuit picks off weakened foes like Mr. Mime and non-Protect Grumpig.</p> <p>This Slaking set fits better on bulky offense and balance teams, providing a revenge killer and Pursuit trapper. Pivots like Emolga and Pelipper allow it to hit the field more safely. Ground- and Fighting-types like Hippopotas, Vibrava, and Mienfoo check the Rock-types that switch in on Slaking, while Grass-types like Meganium and Ivysaur can pressure Frillish and Solrock. In return, Slaking can take on naturally fast Pokemon like Emolga and Simisear, as well as Choice Scarf users like Grumpig and Mr. Mime.</p> "}
    ],
    "credits": {"writtenBy": [{"username": "5Dots", "user_id": 543866}], "teams": [{"name": "Quality checked by", "members": [{"username": "Gangsta Spongebob", "user_id": 535530}, {"username": "Monai", "user_id": 482455}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Lairon": {"sets": [{"name": "Bulky Stealth Rock"}, {"name": "Choice Band"}, {"name": "Offensive"}]},
  "Grumpig": {"sets": [{"name": "Offensive Calm Mind"}, {"name": "Choice Scarf"}, {"name": "Bulky Calm Mind"}, {"name": "Specially Defensive"}]},
  "Seviper": {"sets": [{"name": "Stallbreaker"}]},
  "Whiscash": {"sets": [{"name": "Bulky Substitute + Dragon Dance"}, {"name": "Fast Substitute + Dragon Dance"}]},
  "Walrein": {"sets": [{"name": "Substitute"}, {"name": "3 Attacks"}]},
  "Clamperl": {"sets": [{"name": "Shell Smash"}]},
  "Shelgon": {"sets": [{"name": "Offensive Dragon Dance"}, {"name": "Bulky Dragon Dance"}, {"name": "Cleric"}]},
  "Bibarel": {"sets": [{"name": "Suicide Lead"}]},
  "Luxray": {"sets": [{"name": "Guts Wallbreaker"}]},
  "Mothim": {"sets": [{"name": "Choice Specs"}, {"name": "Quiver Dance"}]},
  "Munchlax": {"sets": [{"name": "CroLax"}, {"name": "Mixed Wall"}, {"name": "Physical Wall"}]},
  "Hippopotas": {"sets": [{"name": "Physical Wall"}]},
  "Carnivine": {"sets": [{"name": "Swords Dance"}]},
  "Lumineon": {"sets": [{"name": "Specially Defensive Pivot"}]},
  "Drilbur": {"sets": [{"name": "Offensive Spinner"}]},
  "Emolga": {
    "comments": "<h1>Other Options</h1> <p>Metronome over Flying Gem and special sets are plausible for breaking through physical walls like Hippopotas and Vullaby, though Emolga will sorely miss Acrobatics's power. Static can punish contact moves like U-turn, though Emolga's frailty prevents it from taking physical attacks unless it resists them. A Naive nature more easily lets Emolga take on Pawniard and Lairon with Knock Off and Hidden Power Fighting, but it sacrifices some special bulk.</p> <h1>Checks and Counters</h1> <p><strong>Faster Pokemon: Persian outspeeds Emolga and forces it out with STAB moves, and it can gain momentum on Emolga with U-turn. Choice Scarf users like Grumpig, Kingler, and Simisear can surprise Emolga and take it out with their STAB moves.</p> <p><strong>Rock-types and Steel-types: Without Hidden Power Fighting, Emolga struggles against Rock-types like Solrock, Lairon, and Graveler, all of which can set up Stealth Rock against it, forcing Emolga to use Roost more often. Solrock is especially notable because it is neutral to Hidden Power Fighting, and it can rack up Rocky Helmet damage if Emolga pivots out with U-turn. Pawniard can tank Acrobatics comfortably and threaten Emolga back with a STAB Sucker Punch, but it must be wary of Hidden Power Fighting.</p> <p><strong>Physical Walls: Physical walls like Hippopotas and defensive Shelgon can stomach two Acrobatics and can 2HKO Emolga back with their own attacks. Neither enjoys Knock Off, however.</p> <p><strong>Bulky Attackers: While Pokemon like Muk, Walrein, and Exploud cannot switch in directly, they can take any one hit from Emolga and threaten to OHKO it back, especially if Emolga has used up its Flying Gem.</p> ",
    "sets": [
      {
        "name": "Offensive Pivot",
        "description": "<p>With amazing Speed alongside a solid offensive and utility movepool, Emolga is a premier pivot. Acrobatics synergizes well with Flying Gem to deal massive damage to most neutral targets. U-turn steers Emolga away from bad matchups, such as Solrock and Lairon, as well as Ground-types—which block Volt Switch—like Graveler and Hippopotas. Volt Switch can be picked to evade Rocky Helmet damage from the aforementioned Solrock and chip foes a bit more. Hidden Power Fighting heavily damages Lairon, Pawniard, and Graveler, but it forces Emolga to run 30 Speed IVs, making it slower than opposing Emolga. Emolga’s last moveslot is quite flexible: Taunt stops walls like Clefairy, Wormadam-S, and Frillish from using their utility moves, Encore locks Pokemon like Arbok and Grumpig into their setup moves, and Knock Off cripples Eviolite-reliant walls like Frillish and Staryu, as well as removing Leftovers from Pokemon like Wormadam-S. Motor Drive gives Emolga an Electric immunity and additional Speed from Electric-type attacks, like opposing Volt Switch, potentially letting it beat other Emolga.</p> <p>Emolga is an excellent facilitator for VoltTurn teams and pairs well with other pivots like Persian, Mienfoo, and Pelipper. Emolga’s pivoting also allows for offensive threats like Simisear, Grumpig, and Arbok to hit the field more safely. In turn, Emolga appreciates having Rock-type checks removed or severely weakened by teammates like Meganium, Staryu, and Ivysaur. Special attackers like Grumpig and Walrein can help scare off physical walls like Solrock and Hippopotas, which would otherwise comfortably switch into Acrobatics. Stealth Rock support from Pokemon like Solrock, Clefairy, and Wormadam-S is also helpful, since it makes Emolga even more difficult to switch into over the course of a game. Bulky Pokemon to stomach hits from faster threats like Persian and Choice Scarf Simisear, like Hippopotas and bulky Grumpig, can help with Emolga's longevity.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "5Dots", "user_id": 543866}], "teams": [{"name": "Quality checked by", "members": [{"username": "Gangsta Spongebob", "user_id": 535530}, {"username": "Monai", "user_id": 482455}]}, {"name": "Grammar checked by", "members": [{"username": "Itchy", "user_id": 518399}, {"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Frillish": {"sets": [{"name": "Defensive Utility"}]},
  "Eelektrik": {"sets": [{"name": "Defensive Pivot"}]},
  "Shelmet": {"sets": [{"name": "Spikes"}]},
  "Mienfoo": {"sets": [{"name": "Offensive Pivot"}, {"name": "Choice Scarf"}, {"name": "Bulky Pivot"}]},
  "Pawniard": {"sets": [{"name": "Wallbreaker"}, {"name": "Stealth Rock"}]},
  "Vullaby": {"sets": [{"name": "Physically Defensive"}]},
  "Heatmor": {"sets": [{"name": "Mixed Attacker"}]}
}