{
  "Crustle": {
    "sets": [
      {
        "name": "Rock Gem",
        "description": "<h1>Set Description</h1> <p>Shell Smash boosts Crustle's Attack and Speed by two stages each, allowing it in many cases to move before the opponent the following turn. Rock Wrecker is Crustle's strongest STAB move and with a Rock Gem and Shell Smash boost, it can OHKO most Pokemon that do not resist it, such as Snorlax and Latias. Rock Blast is useful against Pokemon that try to set up Substitute, such as Volcarona, Thundurus, Aerodactyl, and Serperior. X-Scissor allows Crustle to more reliably hit Pokemon such as Cresselia. Earthquake can be used to have better matchups against Heatran and Terrakion. Counter can be used in conjunction with Sturdy to punish physical attackers, such as Choice Scarf Landorus-T.</p> <h1>EVs</h1> <p>Crustle almost always runs 252 Attack EVs due to needing as much damage as possible from Shell Smash. It also almost always runs 252 Speed EVs to outspeed Tornadus-T after a Shell Smash. Adamant is the preferred nature because Crustle does not gain any meaningful matchups having a Jolly nature other than against opposing Crustle.</p> <h1>Usage Tips</h1> <p>Crustle's strength lies in its combination of Sturdy, Shell Smash, and Rock Wrecker. Sturdy allows Crustle to often freely use Shell Smash and attack first on turn two. However, Crustle struggles against Pokemon that can use moves like Taunt, which is commonly used by Heatran, Jellicent, and Sableye. It also struggles against Pokemon with priority moves, such as Keldeo, Genesect, and Mienshao, which can either break Sturdy or attack it after Sturdy activates. Despite having difficulties against Trick, Crustle can still perform well against Choice Scarf Cresselia and Choice Specs Latios if it has X-Scissor. If Crustle has X-Scissor, it is important to not use Shell Smash on the first turn against these Pokemon, as they can use Trick to lock Crustle into Shell Smash. Crustle, however, still struggles against Porygon-Z and Jellicent, which also commonly use Trick.</p> <h1>Other Options</h1> <p>Crustle can also use a variety of different items with this set, including Mail, which makes Crustle immune to with Trick, and Lum Berry, which can heal a burn from Heatran, Arcanine, or Sableye's Will-O-Wisp, which Crustle struggles against. Choice Band Crustle is also an option, but it is generally worse than Rock Gem sets, as it cannot use Shell Smash.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 518399, "username": "Itchy"}, {"user_id": 437679, "username": "crucify"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 493772, "username": "Lumii"}]}
  },
  "Scrafty": {
    "sets": [
      {
        "name": "Chople Counter",
        "description": "<h1>Set Description</h1> <p>Fake Out allows Scrafty to freely damage most Pokemon and bypass Sturdy from Pokemon like Magnezone and Sawk. High Jump Kick is Scrafty's strongest STAB attack and allows it to beat many common threats such as Slaking, Heatran, and Tyranitar. It is also Scrafty's strongest option against neutral targets. Payback is used over Crunch due to Scrafty's low Speed stat, which allows Scrafty to underspeed Choice Scarf Cresselia even after Cresselia uses Trick. Counter, Chople Berry, and Intimidate beat physical Fighting-types such as Sawk, Mienshao, and opposing Scrafty.</p> <h1>EVs</h1> <p>Maximum HP and 80 Special Defense EVs allow Scrafty to survive a Dragon Gem Latios's Draco Meteor while and OHKO back with Payback. The rest of the EVs are dumped into Attack to allow Scrafty and maximize Scrafty's damage.</p> <h1>Usage Tips</h1> <p>Fake Out allows Scrafty to break Magnezone and Sawk's Sturdy, and High Jump Kick and Counter can OHKO them. Against physical Fighting-types, such as Mienshao, Conkeldurr, Hariyama, and opposing Scrafty, it is always advisable to use Fake Out into Counter. However, Bulk Up variants can still beat Scrafty. Against Conkeldurr, after using Fake Out, it is important to then use Counter. If Conkeldurr attacks with Hammer Arm, Counter wins. However, if Conkeldurr uses Mach Punch, using High Jump Kick on the third turn is a favorable damage roll. Scrafty also has a decent matchup against Snorlax. However, it is important to play around the possibility of Counter by using Payback after Fake Out, as this allows Scrafty to always OHKO with High Jump Kick after. However, this strategy does fail against Belly Drum Snorlax; if you suspect Belly Drum, use High Jump Kick on turn two.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 518399, "username": "Itchy"}, {"user_id": 437679, "username": "crucify"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 493772, "username": "Lumii"}]}
  }
}