{
  "Pikachu": {"sets": {"Revenge Killer": {}}},
  "Ariados": {"sets": {"Lead": {}}},
  "Magcargo": {"sets": {"Physical Wall": {}, "Shell Smash": {}}},
  "Corsola": {"sets": {"Physical Wall": {}}},
  "Masquerain": {"sets": {"Quiver Dance": {}}},
  "Volbeat": {"sets": {"Weather Setter": {}}},
  "Illumise": {"sets": {"Choice Specs": {}}},
  "Lunatone": {"sets": {"All-Out Attacker": {}}},
  "Solrock": {"sets": {"Physical Wall": {}, "Offensive": {}, "Weather Lead": {}}},
  "Chimecho": {"sets": {"Choice Specs": {}, "Future Sight": {}}},
  "Wormadam-Trash": {"sets": {"Physical Wall": {}}},
  "Gigalith": {"sets": {"Stealth Rock": {}, "Choice Band": {}}},
  "Vanilluxe": {"sets": {"Choice Specs": {}, "Choice Scarf": {}, "Stallbreaker": {}, "Autotomize": {}}},
  "Beartic": {"sets": {"Rain Sweeper": {}}},
  "Meowstic": {"sets": {"Dual Screens": {}}},
  "Vibrava": {"sets": {"Defog": {}}},
  "Glaceon": {"sets": {"Choice Specs": {}}},
  "Gourgeist-Small": {"sets": {"All-Out Attacker": {}, "SubSeed": {}, "Defensive": {}}},
  "Gourgeist-Large": {"sets": {"Physical Wall": {}}},
  "Ivysaur": {"sets": {"Defensive": {}, "Sun Sweeper": {}}},
  "Wartortle": {"sets": {"Physically Defensive": {}, "Specially Defensive": {}}},
  "Butterfree": {"sets": {"Quiver Dance": {}}},
  "Beedrill": {"sets": {"Toxic Spikes": {}, "Swords Dance": {}}},
  "Pidgeot": {"sets": {"Offensive Defog": {}, "Choice Band": {}, "Choice Scarf": {}}},
  "Raticate": {"sets": {"Guts": {}, "Choice Band": {}, "Choice Scarf": {}}},
  "Fearow": {"sets": {"Choice Band": {}, "Choice Scarf": {}}},
  "Sandshrew": {"sets": {"Hazard Utility": {}}},
  "Wigglytuff": {"sets": {"Cleric": {}, "Offensive Stealth Rock": {}}},
  "Persian": {"sets": {"Offensive Pivot": {}, "Nasty Plot": {}}},
  "Golduck": {"sets": {"Rain Attacker": {}, "Calm Mind": {}}},
  "Tentacool": {"sets": {"Specially Defensive": {}}},
  "Graveler": {"sets": {"Suicide Lead": {}}},
  "Magnemite": {"sets": {"Magnet Pull": {}}},
  "Gastly": {"sets": {"Substitute + 3 Attacks": {}, "SubWisp": {}, "Choice Scarf": {}}},
  "Seaking": {"sets": {"Specially Defensive": {}, "Agility": {}}},
  "Electabuzz": {"sets": {"Offensive Pivot": {}, "Choice Scarf": {}, "Choice Specs": {}}},
  "Magmar": {"sets": {"Special All-Out Attacker": {}, "Choice Specs": {}, "Choice Scarf": {}, "Physical All-Out Attacker": {}}},
  "Ditto": {"sets": {"Revenge Killer": {}}},
  "Dragonair": {"sets": {"Bulky Dragon Dance": {}, "Offensive Dragon Dance": {}}},
  "Meganium": {"sets": {"Special Wall": {}, "Swords Dance": {}}},
  "Chinchou": {"sets": {"Special Pivot": {}}},
  "Natu": {"sets": {"Magic Bounce Pivot": {}}},
  "Politoed": {
    "comments": "<h1>Other Options</h1> <p>Focus Blast offers strong coverage generally, but it lacks specific targets to make up for its inaccuracy. Choice Scarf sets can get the jump on some noticeable targets if the opponent is unaware, although these sets lack either the defensive reliability or power that the other sets excel at. Perish Song + Whirlpool sets offer a different stallbreaking option than Encore; however, these sets make Politoed more passive, which can sink momentum. No Item + Thief can be opted for over Protect as a means to debilitate Eviolite-reliant counters, but the lack of Leftovers and the risk of stealing a useless or debilitating item like Dustox's Black Sludge usually means that item removal is a better fit for Politoed's teammates. Substitute is another option on Leftovers sets that prefer more Speed, as it gives Politoed an extra burn chance and allows for safer Toxics against foes that want to switch in on it like Swalot, Sawsbuck and Ivysaur.</p> <h1>Checks and Counters</h1> <p><strong>Dustox</strong>: Dustox is immune to Scald burns due to its ability Shield Dust. Additionally, it can use Toxic to completely shut down Politoed, all while having the bulk and recovery to consistently function as a safe switch-in except versus Choice Specs Hydro Pump.</p> <p><strong>Duosion</strong>: Specially defensive Duosion tanks Politoed's unboosted hits, and, thanks to Regenerator, it can generally leave unscathed. Double Dance sets are in jeopardy of getting hit by Encore, though.</p> <p><strong>Grass-types</strong>: Faster Grass-types like Servine, Simisage, and Sawsbuck can force out Politoed, although they risk a strong Ice Beam if they attempt to set up versus it.</p> <p><strong>Revenge Killers</strong>: Stronger revenge killers like Electabuzz, Choice Specs Vanilluxe, and Choice Band Furfrou favorably trade hits against Politoed, and they will force it out once at low health; scouting with Protect can deter the Choice-locked revenge killers, however.</p> <p><strong>Status</strong>: Politoed doesn't do well when taking residual damage from poison or burn due to its only form of recovery being Leftovers. It needs to be wary of Toxic from the likes of Dustox and Gigalith, as well as Will-O-Wisp from Dusclops and Solrock.</p>",
    "sets": {
      "Tank": {
        "description": "<p>Politoed is a multifaceted offensive tank and bulky Water-type. The threat of a strong Scald backed up by Ice Beam to hit Grass-types like Servine and Jumpluff makes Politoed hard to switch into. Access to Water Absorb and great defensive stats also make Politoed a valuable defensive asset in a pinch against the likes of Magmar, Klang, and Simipour. Protect doubles as a means to net extra recovery from Leftovers, as well as a defense against Choice-locked attackers like Vanilluxe. Encore also pairs well with Protect because it allows Politoed to scout and then punish utility moves and weaker attacks versus slower foes like Duosion and Bronzor, all while securing additional Leftovers recovery. Encore is also very good against setup sweepers that don't care about Toxic like Scraggy and the aforementioned Duosion. Toxic is another stallbreaking option for Politoed to be more threatening versus its counters like Regenerator Duosion, although it comes at the opportunity cost of losing the safe switch against slower status users. Another consideration is Hidden Power Grass, which can be opted for if the team needs to rely on Politoed to check offensive Water-types like Simipour and Huntail. With 16 Speed EVs, Politoed outspeeds and revenge kills Adamant Lairon.</p> <p>Politoed fits on any balance and bulky offense team that can appreciate its role compression and defensive typing. Defensive cores like Gigalith + Vibrava and Dustox + Carbink need Politoed to check threats like Huntail, Klang, and Pignite. In return, they can create a safe switch opportunity for Politoed against Pokemon like Gigalith, Vibrava, and Carbink, especially when prompting foes to trade entry hazards. Scraggy and Bronzor can absorb Future Sight from Regenerator Duosion, while Dustox and Gogoat are generally good threats to Servine. Ground-types like Krokorok and Hippopotas are great to maintain momentum versus faster Volt Switch users that can force out Politoed, and they are especially beneficial versus Choice-locked Electabuzz, given Politoed's Protect will punish revenge kill attempts.</p>"
      },
      "Choice Specs": {
        "description": "<p>Choice Specs Politoed boasts an impressive offensive movepool and still retains a lot of its defensive merit. Most notably, the extra power offers Politoed a guaranteed 2HKO versus Regenerator Duosion and Dustox with Hydro Pump. Its coverage in Ice Beam + Hidden Power Grass gives Politoed a chance to OHKO the likes of Gourgeist-L and Whiscash, respectively. Additionally, Politoed's ability Water Absorb means that even without defensive investment, it can still soft check the likes of Huntail and Simipour and retaliate with Hidden Power Grass with a chance to OHKO after Stealth Rock.</p> <p>Pivots like Electabuzz and Dustox are great teammates to get Politoed in safely. Knock Off users like Servine and Persian can soften up Eviolite walls like Bronzor and Quilladin, making them more vulnerable to Politoed's wallbreaking. Swalot, Ivysaur, and Gourgeist-L are all checks to Grass-types that give Politoed a defensive backbone to rely on versus the likes of Simisage and Sawsbuck. Specially offensive sweepers like Vanilluxe and Butterfree can clean late-game after Politoed pokes holes through opposing special walls. Fast attackers like Persian and Sawsbuck make for great partners to help circumvent Politoed's mediocre Speed.</p>"
      },
      "Choice Scarf": {},
      "Perish Song": {}
    },
    "credits": {"writtenBy": [{"username": "S1nn0hC0nfirm3d", "user_id": 231074}, {"username": "sleid", "user_id": 601970}], "teams": [{"name": "Quality checked by", "members": [{"username": "5Dots", "user_id": 543866}]}, {"name": "Grammar checked by", "members": [{"username": "SolarBeam", "user_id": 470115}]}]}
  },
  "Jumpluff": {"sets": {"Swords Dance": {}}},
  "Murkrow": {"sets": {"Physically Based Attacker": {}, "Specially Based Attacker": {}}},
  "Girafarig": {"sets": {"Nasty Plot": {}, "Choice Scarf": {}}},
  "Dunsparce": {"sets": {"Coil": {}}},
  "Octillery": {"sets": {"Trick Room Attacker": {}}},
  "Marshtomp": {"sets": {"Stealth Rock": {}}},
  "Mightyena": {"sets": {"All-Out Attacker": {}}},
  "Dustox": {"sets": {"Special Wall": {}, "Double Dance": {}}},
  "Slaking": {"sets": {"Choice Band": {}, "Choice Scarf": {}}},
  "Lairon": {
    "sets": {
      "Offensive Stealth Rock": {
        "description": "<p>Lairon is a dangerous Stealth Rock setter with its solid defensive typing, powerful Rock STAB move in Head Smash, and great coverage to discourage the entire tier from switching in safely. Lairon's Head Smash threatens to 2HKO many common defensive walls such as Swalot, Ivysaur, and Regenerator Duosion after Stealth Rock damage. Superpower hits Pokemon that resist Head Smash such as Scraggy, Klang, and opposing Lairon. Heavy Slam is preferred in the last slot as another STAB move that is stronger against lighter foes like Carbink and Vibrava. Roar is an alternative option to phaze Pokemon that want to come in and set up in front of Lairon like Duosion or to chip away at opposing Pokemon that sit on it like Bronzor. Toxic is an option that does well at chipping down a common switch-in, Vibrava, to deter it from coming in and removing Lairon's entry hazards. Toxic also wears down other Ground-types like Hippopotas and Marshtomp, which can comfortably switch into Lairon's attacks. Rock Head allows Head Smash to be a spammable move and keeps Lairon healthy.</p> <p>Lairon does well on balance and offensive teams looking for an entry hazard setter that can put pressure on hazard removers like Dustox and physical walls like Ivysaur and Carbink. Cleaners like Klang, Choice Scarf Krokorok, and Huntail appreciate Lairon's ability to put a dent in the likes of Swalot and Duosion. Teammates that can come in and take advantage of opposing Vibrava like Jumpluff and Ivysaur are appreciated. Vibrava is a great pairing, since it can deal with a lot of Pokemon that threaten Lairon such as Pignite, Krokorok, and Gigalith, while Lairon can come in on Pokemon that bother Vibrava like Dustox, Wigglytuff, and Persian. Lairon needs teammates that can help deal with Bronzor, since Bronzor outright walls and beats it, so Pokemon such as Krokorok, Scraggy, and Magic Guard Duosion help alleviate this problem. Faster teammates are always appreciated to make up for Lairon's slow Speed, especially those that benefit from its wallbreaking like Sawsbuck and Jumpluff.</p>"
      },
      "Bulky Stealth Rock": {},
      "Choice Band": {},
      "Rock Polish": {}
    },
    "credits": {"writtenBy": [{"username": "sleid", "user_id": 601970}], "teams": [{"name": "Quality checked by", "members": [{"username": "Jett", "user_id": 226429}, {"username": "5Dots", "user_id": 543866}]}, {"name": "Grammar checked by", "members": [{"username": "SolarBeam", "user_id": 470115}]}]}
  },
  "Meditite": {"sets": {"Choice Band": {}, "Choice Scarf": {}}},
  "Swalot": {"sets": {"Physical Wall": {}, "Specially Defensive": {}, "Tank": {}, "Curse": {}}},
  "Wailord": {"sets": {"StallLord": {}}},
  "Seviper": {"sets": {"Choice Scarf": {}, "Mixed Attacker": {}}},
  "Whiscash": {"sets": {"Choice Specs": {}, "Dragon Dance": {}, "SubToxic": {}}},
  "Banette": {"sets": {"Choice Band": {}, "Mixed Wallbreaker": {}}},
  "Dusclops": {"sets": {"Special Wall": {}, "Physical Wall": {}}},
  "Glalie": {"sets": {"Offensive Spikes": {}, "Suicide Lead": {}}},
  "Walrein": {"sets": {"SubToxic": {}}},
  "Huntail": {"sets": {"Physical Shell Smash": {}, "Special Shell Smash": {}}},
  "Shelgon": {"sets": {"Cleric": {}, "Bulky Dragon Dance": {}, "Offensive Dragon Dance": {}}},
  "Grotle": {"sets": {"Specially Defensive": {}}},
  "Bibarel": {"sets": {"Suicide Lead": {}}},
  "Kricketune": {"sets": {"Sticky Web Lead": {}}},
  "Luxray": {"sets": {"Physical Wallbreaker": {}}},
  "Mothim": {"sets": {"Choice Specs": {}, "Substitute + Quiver Dance": {}}},
  "Lopunny": {"sets": {"Offensive Utility": {}}},
  "Stunky": {"sets": {"Offensive Utility": {}}},
  "Bronzor": {"sets": {"Physical Wall": {}, "Special Wall": {}}},
  "Munchlax": {"sets": {"CroLax": {}}},
  "Hippopotas": {"sets": {"Physical Wall": {}, "Special Wall": {}}},
  "Servine": {
    "comments": "<h1>Other Options</h1> <p>Servine's Choice Scarf and offensive utility sets can opt to run Hidden Power Fire over Hidden Power Ice, though not being able to consistently threaten Flying-types and Vibrava with super effective damage can end up causing problems if not properly accounted for in teambuilding. While Servine can opt for additional utility moves like Leech Seed, Knock Off, and Glare over Hidden Power on its utility sets, this leaves it walled or threatened by significantly more Pokemon, including several other Grass-type Pokemon like Simisage and Sawsbuck. Servine can also opt for an offensive spread of 4 HP / 252 SpA / 252 Spe on Eviolite sets, but this spread is typically only used on hyper offense teams.</p> <h1>Checks and Counters</h1> <p><strong>Fire-types</strong>: Fire-type Pokemon like Pignite and Magmar can easily switch into Servine's attacks and threaten super effective STAB damage in return, with the latter also outspeeding non-Choice Scarf Servine.</p> <p><strong>Poison-types</strong>: Bulky Poison-type Pokemon like Dustox, Swalot, and Ivysaur easily switch into and threaten out Servine.</p> <p><strong>Flying-types</strong>: Swoobat and Jumpluff can KO Servine from over half HP and can take advantage of Choice Scarf Servine being locked into Leaf Storm.</p> <p><strong>Vanilluxe</strong>: Choice Scarf Vanilluxe can outspeed and KO offensive variants of Servine from nearly full HP, and all variants of Vanilluxe can survive an unboosted Leaf Storm with relative ease.</p> <p><strong>Sap Sipper</strong>: Sap Sipper Pokemon like Gogoat and Sawsbuck are fully immune to Leaf Storm and take relatively little damage from unboosted Hidden Power Ice / Fire, allowing them to threaten Servine out with setup and damage, respectively.</p>",
    "sets": {
      "Offensive Utility": {
        "description": "<p>Offensive Servine is a top-tier setup sweeper through its ability to break foes with its self-boosting STAB Leaf Storm, remove opposing items with Knock Off, hinder switch-ins with Glare, and shut down walls and entry hazard setters with Taunt. Its excellent Speed also allows it to benefit from the paralysis it spreads, outpacing all paralyzed Choice Scarf users in mid-game and end-game scenarios. Hidden Power Ice allows Servine to hit opposing Grass-, Dragon-, and Flying-type Pokemon super effectively.</p> <p>Fire-type teammates like Magmar and Pignite appreciate Servine's ability to paralyze opposing threats and cleanly answer opposing Water-type Pokemon; in return, they threaten out the special walls that often slow down Servine like Dustox, Meganium, and Bronzor. Servine also appreciates having teammates like Politoed, Simipour, and Whiscash that can handle opposing Fire- and Steel-type Pokemon like Pignite and Bronzor. Entry hazard support from Pokemon like Gigalith and Krokorok is also greatly appreciated by Servine to chip its checks into boosted Leaf Storm range. Servine often struggles with opposing Poison-type Pokemon like Swalot and Trubbish, so Psychic-types like Swoobat and Duosion are appreciated as teammates. Lastly, since Servine is a late-game sweeper, wallbreakers like the aforementioned Magmar and Simipour as well as Simisage are invaluable teammates to have.</p>"
      },
      "Bulky Contrary": {
        "description": "<p>Bulky Servine serves as a reliable check to several offensive Electric- and Water-type threats like Electabuzz, Pikachu, Simipour, Politoed, and Huntail and uses the turns that it gains from these threats to chip or otherwise hinder foes. Hidden Power Ice allows Servine to hit opposing Flying- and Dragon-type Pokemon, Hidden Power Fire allows it to hit opposing Steel-type Pokemon, and both give it a tool to answer opposing Grass-type Pokemon. Synthesis acts as reliable recovery, allowing Servine to continue answering the threats it's meant to check, while its final moveslot lets it choose between removing items, paralyzing foes, or chipping at foes and gaining further recovery with Leech Seed. Servine can opt to include both Glare and Knock Off while forgoing Hidden Power, allowing it to disrupt foes in many ways, but this leaves it unable to hit opposing Grass-types. The given EV spread allows Servine to outpace several foes like Scraggy and Modest Glaceon while taking special attacks as well as possible.</p> <p>Entry hazard setters like Gigalith and Krokorok pair excellently with Servine, which punishes Defog attempts with Contrary and appreciates hazard damage on the Fire- and Poison-type Pokemon that often threaten it out. Servine's ability to reliably switch into Electric-type threats is greatly appreciated by teammates like Simipour, Politoed, and Huntail, which can in turn take advantage of the Fire-type Pokemon that Servine is often checked by. Servine often struggles against opposing Poison-type Pokemon like Dustox and Swalot, so teammates like Duosion and Swoobat are greatly appreciated to help deal with them. Lastly, Servine loves having Fire-type teammates like Magmar and Pignite that answer the Steel-type Pokemon trying to take advantage of Servine's relative passivity, especially if it's lacking Hidden Power Fire.</p>"
      },
      "Choice Scarf": {
        "description": "<p>Choice Scarf Servine is one of the tier's premier revenge killers and cleaners, outpacing the entire unboosted metagame and dealing excellent damage with its boosted STAB Leaf Storm. Energy Ball acts as a solid secondary STAB move, allowing Servine to save its limited Leaf Storm PP until the endgame, while Hidden Power Ice allows Servine to KO weakened opposing Grass-types like Simisage and Sawsbuck, Flying-types like Jumpluff, and Vibrava. Servine's final move is dedicated to taking advantage of the many switches it forces in early- and mid-game scenarios, paralyzing foes with Glare or removing items with Knock Off.</p> <p>It can be difficult for Choice Scarf Servine to switch in at times, so it appreciates teammates with pivot moves like Electabuzz and Vibrava. Servine commonly struggles against opposing Fire-type Pokemon like Pignite and Magmar, meaning that Water-type teammates like Simipour and Politoed are excellent to switch into and exploit them. Servine also struggles to break past Poison-type Pokemon like Swalot and Dustox, so Psychic-types like Duosion, Meowstic-F, and Swoobat make for excellent allies to break them. Servine also loves having entry hazard-setting teammates like Gigalith and Krokorok to further chip down its checks with hazard damage, enabling its sweep more easily in endgame scenarios when common checks like Pignite and Dustox are heavily chipped down or removed.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "BaitWiz", "user_id": 598623}], "teams": [{"name": "Quality checked by", "members": [{"username": "5Dots", "user_id": 543866}, {"username": "Jett", "user_id": 226429}]}, {"name": "Grammar checked by", "members": [{"username": "SolarBeam", "user_id": 470115}]}]}
  },
  "Pignite": {"sets": {"All-Out Attacker": {}, "Curse": {}, "Taunt + Toxic": {}}},
  "Simisage": {"sets": {"Mixed All-Out Attacker": {}, "Nasty Plot": {}, "Choice Scarf": {}, "Choice Specs": {}}},
  "Simipour": {"sets": {"Nasty Plot": {}, "Choice Scarf": {}}},
  "Swoobat": {"sets": {"Choice Specs": {}, "Dual Screens": {}, "Calm Mind": {}}},
  "Palpitoad": {"sets": {"Defensive Stealth Rock": {}}},
  "Whirlipede": {"sets": {"Spikes": {}}},
  "Krokorok": {"sets": {"Offensive Stealth Rock": {}, "Choice Band": {}, "Choice Scarf": {}}},
  "Dwebble": {"sets": {"Suicide Lead": {}}},
  "Scraggy": {"sets": {"Bulk Up": {}, "Dragon Dance": {}}},
  "Trubbish": {"sets": {"Defensive Spikes": {}}},
  "Gothitelle": {"sets": {"Calm Mind": {}}},
  "Duosion": {"sets": {"Calm Mind": {}, "Defensive Pivot": {}}},
  "Sawsbuck": {"sets": {"Swords Dance": {}, "Choice Scarf": {}, "Choice Band": {}}},
  "Emolga": {"sets": {"Offensive Pivot": {}}},
  "Frillish": {"sets": {"Physical Wall": {}}},
  "Klang": {"sets": {"Shift Gear": {}, "Double Dance": {}, "Defensive Pivot": {}}},
  "Eelektrik": {"sets": {"Defensive Pivot": {}}},
  "Lampent": {"sets": {"Substitute + Calm Mind": {}, "Choice Specs": {}}},
  "Mienfoo": {"sets": {"Offensive Pivot": {}, "Choice Scarf": {}}},
  "Heatmor": {"sets": {"Wallbreaker": {}}},
  "Zweilous": {"sets": {"Choice Band": {}, "Choice Scarf": {}, "RestTalk": {}}},
  "Quilladin": {"sets": {"Offensive Spikes": {}, "Defensive Spikes": {}}},
  "Frogadier": {"sets": {"Offensive Pivot": {}, "Choice Scarf": {}}},
  "Gogoat": {"sets": {"Bulk Up": {}, "Special Wall": {}}},
  "Furfrou": {"sets": {"Choice Band": {}, "Choice Scarf": {}, "Physically Defensive": {}}},
  "Meowstic-F": {"sets": {"All-Out Attacker": {}, "Choice Scarf": {}}},
  "Carbink": {"sets": {"Physical Wall": {}, "Offensive Stealth Rock": {}, "Double Dance": {}}},
  "Sliggoo": {"sets": {"Curse": {}, "Tank": {}}}
}