{
  "Blastoise": {
    "overview": "<p>On paper, Mega Blastoise might seem like an underwhelming Pokemon due to its average stats, but thanks to its unique ability and movepool, it's a staple in the Battle Spot Triples metagame that's easy to fit on multiple team styles. Mega Launcher combined with Aura Sphere and Dark Pulse make it an effective Special Attacker that can attack any Pokemon, regardless of its position. Access to Fake Out and Water Spout further increases Mega Blastoise's versatility, making it an effective support Pokemon and spread attacker. Furthermore, Mega Blastoise's mediocre Speed allows it to fit well on both Tailwind and Trick Room teams, and its typing makes it a great choice for rain teams.</p> <p>Mega Blastoise's biggest flaw is that compared to other Mega Evolutions, it actually isn't that powerful. Its reliance on placement-ignoring attacks also makes it extremely vulnerable to redirection. Overall, Mega Blastoise isn't the most prominent Mega Evolution in Battle Spot Triples, but its unique attributes make it an indispensable part of the metagame.</p> ",
    "comments": "<h1>Other Options</h1> <p>Muddy Water is an alternate choice for a spread Water-type attack over Water Spout. While it's much weaker and can miss, it also doesn't have to worry about Mega Blastoise's current HP. Hydro Pump and Scald can work as Water-type attacks that aren't harmed as much by redirection. Ice Beam is also less harmed by redirection, destroys Landorus-T under the sun, and does good damage to Dragon-types. If Mega Salamence is a serious problem, Dragon Pulse can be used to hit it regardless of its placement. Dragon Pulse also does slightly more damage to Hydreigon.</p> <p>A surprise Choice Scarf set is possible to use under the rain with Water Spout, as it allows Blastoise to potentially get some surprise KOs. However, once Blastoise loses health, it becomes a rather mediocre Pokemon to use in the rain due to Water Spout's reduced power.</p> <h1>Checks and Counters</h1> <p><strong>Redirection Pokemon: Rage Powder and Follow Me are Mega Blastoise's arch-nemeses, as they affect Aura Sphere and Dark Pulse. Amoonguss is the biggest problem, since it can also hit Mega Blastoise with Giga Drain, but Clefairy and Togekiss are also problematic because they resist Dark Pulse and Aura Sphere.</p> <p><strong>Ludicolo and Grass-types: Ludicolo is a big problem, since it can slam Mega Blastoise with Giga Drain and is often faster because of the rain support Mega Blastoise often takes advantage of. Other Grass-types such as Whimsicott and Mega Venusaur will usually come out on top against Mega Blastoise. Most other Grass-types, such as Whimsicott, have no problems tanking Mega Blastoise's attacks either.</p> <p><strong>Mega Charizard Y: Mega Charizard Y's Drought ruins the Base Power of Water Spout and Water Pulse, and it also makes Mega Blastoise a prime target for getting hit by Solar Beam.</p> <p><strong>Zapdos and Electric-types</strong>: Zapdos gets hit hard by STAB Water-type attacks, but it has a STAB Thunderbolt/Thunder to defeat Mega Blastoise with, and it also likes to use Light Screen and Tailwind to give Mega Blastoise further problems. Other more obscure Electric-types such as Thundurus and Mega Manectric get hit hard, but their STAB moves hurt Mega Blastoise a lot.</p> <p><strong>Double Targeting: Mega Blastoise is fairly bulky, but if it gets double targeted, it will quickly lose enough health to make Water Spout too weak to be effective.</p> ",
    "sets": [
      {
        "name": "Mega Attacker",
        "description": "<h1>Moves</h1> <p>Water Spout is an extremely powerful spread attack when Mega Blastoise is healthy, especially when it has rain support. Fake Out gives Mega Blastoise useful flinch support and is very important for ensuring that Mega Blastoise helps guarantee the setup of your speed control move of choice. If either if these are replaceable for you, consider Water Pulse, which is Mega Blastoise's most powerful placement-ignoring move. It's especially useful for smashing Landorus-T and reliably hitting Sylveon when Mega Blastoise's health is low. You can opt for Protect to save Mega Blastoise from getting seriously damaged from strong super effective attacks.</p> <p>Thanks to Mega Launcher, Dark Pulse gets the equivalent of a STAB boost, making it Mega Blastoise's most reliable placement-ignoring move. It also happens to hit important targets such as Aegislash, Gothitelle, and Mega Gengar for super effective damage. Aura Sphere has nearly perfect coverage with Dark Pulse, grabbing an easy OHKO on Bisharp, and even having a 12.5% chance of OHKOing Mega Kangaskhan with no residual damage.</p> <h1>Set Details</h1> <p>Mega Blastoise should usually max its Special Attack to ensure that it gets the KOs it needs to function, such as OHKOing Meowstic with Dark Pulse, or defeating Tyranitar or Mega Kangaskhan with a small amount of residual damage via Aura Sphere. Rain Dish is the preferred ability, because it allows Blastoise to restore some of its health on switch-ins when it's raining before it Mega Evolves.</p> <p>The biggest decision to make for Mega Blastoise is its Speed, as it has numerous speed benchmarks to consider. If running Mega Blastoise with Tailwind support, run 76 Speed EVs and a Modest nature to outspeed Adamant Choice Scarf Landorus-T. If you prefer to use Mega Blastoise with Trick Room support, run a Quiet nature and a Speed IV of 0 to maximize its effectiveness under Trick Room. If launching off powerful Water Spouts is your biggest concern, you can run a Timid nature with maximum Speed, though note that you lose some power in the process, such as the ability to always OHKO Bold Meowstic with Dark Pulse, or KO Tyranitar or Mega Kangaskhan after a bit of damage.</p> <h1>Usage Tips</h1> <p>Mega Blastoise's placement really depends on your gameplan and the stage of the game. If you want to use Dark Pulse and Aura Sphere, you'll want Mega Blastoise on the sides to avoid getting hit by any of the opponent's three Pokemon. If your plan is to use Fake Out, sending Mega Blastoise in the middle can be a good idea to be able to target any Pokemon. However, if your opponent is carrying a faster Fake Out user, it might be wise to put Mega Blastoise in the corner and make it shift to the center. This way, Mega Blastoise conserves its Fake Out so it can use it the next turn without fear of getting flinched itself!</p> <p>While Mega Blastoise works well to set the tone early in the match, leaving it until later in the game can still be a very effective tactic, because as long as your desirable speed control is intact, Mega Blastoise can become a deadly spread sweeper with Water Spout. Just note that if your opponent is carrying Mega Charizard Y or Ninetales, Mega Blastoise's late-game utility will be diminished due to sunny weather.</p> <p>Mega Blastoise's ability to ignore placement and flinch with Fake Out is the cause of many switches and uses of Protect, so try to take advantage of your opponent's predictability by targeting the Pokemon most likely to attack, such as vulnerable Pokemon in the middle, as this can give Mega Blastoise an effective edge over your opponent.</p> <h1>Team Options</h1> <p>The most important kind of support for Mega Blastoise is speed control. Because Mega Blastoise's Speed is rather middling, it isn't able to fully take advantage of Water Spout or its placement-ignoring attacks without usually going after the opponent. For faster variants of Mega Blastoise, Tailwind is best suited for the job. Talonflame is one of the premier users of Tailwind and can help against Wide Guard with Snatch and slam Amoonguss and Ludicolo with priority Brave Bird. Crobat works as an alternative to Talonflame that is less worried about Quick Guard and is immune to Fake Out, while Whimsicott has plenty of unique support moves in addition to Tailwind.</p> <p>For slower Mega Blastoise, Trick Room support makes the most sense. Gothitelle and Aromatisse are especially good teammates to consider, as they both have access to Heal Pulse, which can power Mega Blastoise's Water Spout back up. Meowstic in particular can use Snatch to defeat Wide Guard, opening up a chance to use Water Spout. If you're looking for pure bulk, Cresselia will work fine enough.</p> <p>Note that Mega Blastoise, while a good user of Fake Out, is one of the slower users of it (especially on Trick Room variants), so pairing Mega Blastoise up with a secondary Fake Out user such as Hitmontop or Smeargle can lower the pressure to set up speed control for Mega Blastoise.</p> <p>For Mega Blastoise that focus on cleaning up with Water Spout, Wide Guard needs to be addressed. Similarly, Fake Out Mega Blastoise can't stand the idea of Quick Guard blocking its flinching. As previously mentioned, Talonflame, Crobat, and Meowstic are great choices for Snatch users. Clefairy is another great choice, making Mega Blastoise bulkier with Friend Guard, and having the ability to use Heal Pulse to power up Water Spout again. Hitmontop and Hariyama are among the best users of Feint around, and both benefit from Mega Blastoise taking care of Aegislash.</p> <p>Mega Blastoise's biggest problem are redirection Pokemon, which will attract its movement-displacing moves. Amoonguss is the biggest problem due to its fantastic bulk, but Clefairy and Togekiss are also problematic due to their resistances to Aura Sphere and Dark Pulse. Taunt Pokemon do a great job of shutting these tactics down, such as Talonflame, Crobat, Sableye, and Whimsicott. Ironically, these very same Pokemon that give Mega Blastoise trouble are great teammates, since they can keep Mega Blastoise's health up by redirecting attacks.</p> <p>While Politoed brings typing redundancies in, it's an especially great teammate thanks to Drizzle. Under the rain, Water Spout becomes extremely powerful, and Water Pulse becomes a hard-hitting move that ignores placement. Politoed can also aid in checking Mega Charizard Y by switching in after it has Mega Evolved. If you're especially worried about Mega Charizard Y, Rain Dance users can also make for good teammates. Klefki and Meowstic stand out as the best users of Rain Dance thanks to Prankster and access to other useful support moves, but Thundurus can also work if you need a more offensive support Pokemon. If bulk is more important, Latias makes for a great user of Rain Dance thanks to its ability to effectively handle Mega Charizard Y.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Theorymon", "user_id": 29010}], "teams": [{"name": "Quality checked by", "members": [{"username": "NOVED", "user_id": 234462}, {"username": "Whiskey Tango", "user_id": 222394}]}, {"name": "Grammar checked by", "members": [{"username": "GatoDelFuego", "user_id": 91628}, {"username": "Winry", "user_id": 216033}]}]}
  },
  "Clefairy": {
    "overview": "<p>Clefairy might seem like a strange option compared to other more common redirection users such as Amoonguss and Togekiss, as its stats aren't very good. However, Clefairy has an ace up its sleeve in the form of Friend Guard, which boosts the defenses of its partners by 33%. Follow Me support in general is great at redirecting important placement-ignoring moves such as Dark Pulse, Aura Sphere, and Dragon Pulse, but Clefairy has other useful support moves such as Snatch and Heal Pulse. Eviolite also does a decent job of making Clefairy bulky while stepping around the Item Clause.</p> <p>Unfortunately, Clefairy is also massively weak to Taunt: as soon as it gets Taunted, Clefairy is forced to Struggle or use weak attacks such as Icy Wind and Moonblast. Clefairy generally relies on its other two partners for offense, and because of its redirection-based nature and mediocre defenses, it's very easy for Clefairy to get KOed early if you place it in the middle of your team. Overall, Clefairy is a niche Pokemon that isn't very threatening on its own, but its amazing support capbilities make it well worth consideration for any Battle Spot Triples team.</p> ",
    "comments": "<h1>Other Options</h1> <p>Thunder Wave provides Clefairy with an alternate method of speed control. Moonlight can be used to keep Clefairy healthy for longer. Aromatherapy allows Clefairy to further support its partner, though it's fairly situational. Tickle and Fake Tears can be used to help soften up the opponent's team, but Clefairy is very slow and usually can't use either of these moves before its partners get the chance to move. Clefairy is one of the most viable users of Gravity, if that interests you. Clefairy also gets Magic Coat, which allows it to bounce Taunt right back at its attackers and even smack Smeargle's team with its own Dark Void! Minimize can be incredibly nasty for raising Clefairy's evasion, but it'll usually be KOed before it becomes nearly untouchable. After You allows Clefairy to help other teammates under Trick Room take advantage of its low base 35 Speed, which can be helpful for getting out of tricky situations.</p> <h1>Checks and Counters</h1> <p><strong>Taunt: Taunt reduces Clefairy's usefulness severely. Taunt users to be wary of include Sableye, Whimsicott, Thundurus, and Gengar.</p> <p><strong>Strong Steel- and Poison-type Attacks: Mega Mawile can OHKO Clefairy with Iron Head regardless of defensive investment. Aegislash can 2HKO Clefairy with Flash Cannon. Bisharp's Iron Head will always 2HKO Clefairy, and Life Orb sets even have a chance to OHKO it.</p> <p><strong>Strong Offensive Presence: Clefairy isn't particularly bulky, so ganging up on it with two Pokemon can cut its life short, especially if it's located in the middle of the team. Clefairy can make use of Protect to get around this, however, making prediction very important.</p> ",
    "sets": [
      {
        "name": "Follow Me",
        "description": "<h1>Moves</h1> <p>Follow Me lets Clefairy redirect and tank hits for its partner. Snatch is an excellent support move, stealing Tailwind, Wide Guard, and Quick Guard for Clefairy's more offensive teammates. Protect lets Clefairy stick around for a bit longer, allowing your other two Pokemon to further take advantage of Friend Guard. The last slot can be somewhat tricky to choose, as Clefairy has plenty of viable options. Heal Pulse allows Clefairy to give any of its teammates a second chance at life, which is especially deadly when paired with Friend Guard's defense-boosting power and Trick Room, under which Clefairy suddenly becomes a speed demon. Helping Hand lets Clefairy boost a partner's offenses and makes up somewhat for its bad offenses, and it is especially useful if your team is full of spread move users. Icy Wind is rather weak, but it gives non-Trick Room based teams another form of speed control, while Moonblast is Clefairy's strongest and most reliable STAB attack.</p> <h1>Set Details</h1> <p>Friend Guard is the main reason to use Clefairy over Amoonguss or Togekiss. The ability reduces the damage that Clefairy's partner Pokemon receive, making them very hard to deal with. 252 HP EVs and 172 Defense EVs let Clefairy always survive Adamant maximum Attack Mega Kangaskhan's Double-Edge, while the rest of the EVs are put in Special Defense for maximum special tanking power. If your team is especially worried about Hydreigon, you can invest 20 Special Attack EVs, which allows Clefairy to OHKO Hydreigon with Moonblast. 12 Special Attack EVs also allow Clefairy to 2HKO Terrakion with the moves.</p> <p>A Sassy nature with 0 Speed IVs is also a good choice for Clefairy, allowing it to take deadly special attacks such as Sylveon's Hyper Voice better and making it fairly fast under Trick Room. If your team uses other forms of speed control such as Tailwind and Icy Wind, a Calm nature may be preferable. If you are more concerned about surviving powerful Steel-type attacks, a Relaxed or Bold nature with an EV spread of 252 HP / 212 Def / 44 SpD allows Clefairy to survive a Life Orb-boosted Iron Head from Bisharp.</p> <h1>Usage Tips</h1> <p>Follow Me is used to protect Clefairy's partners from attacks, and it should be used often to give Clefairy's teammates the chance to set up. If your team encounters Quick Guard or Wide Guard, use Snatch to steal them for your own team, aiding Clefairy's teammates' offensive presence. Snatch is also a great move to use against a predicted Tailwind. Meanwhile, Heal Pulse should be used often to keep Clefairy's bulky teammates on the battlefield longer. If using Helping Hand, targeting spread attack teammates maximizes your team's chance of dealing massive damage. Don't be afraid to let Clefairy go down if it's taking a lot of nasty hits. It's better for Clefairy to do its job for a little while than sit around and not do anything later on.</p> <p>Positioning is an especially important aspect of Clefairy in Battle Spot Triples. It may be tempting to place Clefairy in the middle to make maximum use of Follow Me, but be warned: getting hit by three attacks will often knock Clefairy out, meaning that your team will lose its Friend Guard support in one turn. To make the best use of Friend Guard and Follow Me, you'll usually want Clefairy on either the left or the right side of your team. Just make sure that the Pokemon in the middle benefits from Clefairy's Helping Hand if you're using that.</p> <p>If you find that Clefairy's usefulness is going down, you're late in the game, or you just feel that Clefairy has one particularly good shot of shifting the match's momentum to your favor, this is when sending out Clefairy to the middle can be a good choice. This allows Clefairy to use Helping Hand on either partner and target any Pokemon with Snatch. Because this makes Clefairy a big target, using Protect to delay attempts to KO Clefairy is especially useful when in the middle.</p> <h1>Team Options</h1> <p>Pokemon that can set up with Substitute or boosting moves, such as Mega Kangaskhan, Mega Metagross, Mega Salamence, Whimsicott + Terrakion, and Heatran, are all great partners. Tailwind and Trick Room users such as Suicune and Jellicent greatly appreciate Follow Me's redirection support and Friend Guard's defensive boosts. Given that Clefairy has access to Snatch, Pokemon that strongly dislike Wide Guard and Quick Guard such as Sylveon, Mega Charizard Y, Mega Camerupt, Talonflame, and Hitmontop are great teammates. Fire-types, such as Heatran and Mega Charizard Y, can take out opposing Steel-types. Dragon-types such as Hydreigon and Steel-types such as Aegislash and Heatran naturally complement Clefairy. A rule of thumb when using Clefairy is to make sure that its partners are able to make up for Clefairy's extreme lack of offensive presence.</p> <p>An important aspect of Clefairy's Follow Me support is that it will redirect placement-ignoring moves such as Brave Bird, Dark Pulse, Aura Sphere, and Dragon Pulse. This makes Pokemon such as Hariyama, Aegislash, Mega Metagross, Bisharp, Mega Kangaskhan, Hydreigon, and Mega Salamence great partners, as Follow Me allows them to avoid these moves.</p> <p>As a special note, Clefairy especially loves Trick Room support, as it gives it the Speed to use Heal Pulse to support teammates, and slow spread attackers such as Sylveon and Mega Camerupt are especially deadly under Trick Room. Some good Trick Room users to consider include Cresselia, Meowstic-M (which can use Safeguard to save Clefairy from Dark Void), Gothitelle, and Jellicent. Another special teammate to consider is Mega Blastoise. Clefairy supports Mega Blastoise with the very valuable Heal Pulse to restore Water Spout's power (the move is especially deadly under Trick Room) and Clefairy can also remove Wide Guard with Snatch, while Mega Blastoise supports Clefairy by slamming Bisharp and Aegislash with its Mega Launcher-boosted Aura Sphere and Dark Pulse, respectively.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Theorymon", "user_id": 29010}], "teams": [{"name": "Quality checked by", "members": [{"username": "NOVED", "user_id": 234462}, {"username": "Level 51", "user_id": 118474}]}, {"name": "Grammar checked by", "members": [{"username": "P Squared", "user_id": 168392}, {"username": "Empress", "user_id": 175616}]}]}
  },
  "Landorus-Therian": {
    "overview": "<p>If you're looking for a Pokemon that can put all three foes in mortal danger at once, you don't really get much better than Landorus-T! With a high Attack stat and access to Earthquake and Rock Slide, Landorus-T is fully capable of devastating every Pokemon on the field in one turn. To make the deal even sweeter, Landorus-T has the amazing ability Intimidate, softening the attacks of any physical Pokemon that dare lead against it. Finally, Landorus-T's typing is quite swell, giving it an immunity of its own to opposing Earthquakes without the usual Rock Slide weakness.</p> <p>Landorus-T is one of the kings of the middle position in Battle Spot Triples, so most competent teams will have a game plan for it. Unfortunately, said game plan can be as simple as running some Wide Guard Pokemon. When Wide Guard is thrown up, Landorus-T's offensive capabilities are severely compromised, leaving it highly reliant on teammates to pick up the slack. Additionally, Landorus-T's typing gives it a 4x weakness to Ice-type attacks, which are fairly common. Finally, Landorus-T, being a Ground-type, absolutely hates facing common rain teams. Landorus-T's flaws deserve some pause for thought, but Landorus-T is so prominent in Battle Spot Triples that waltzing in unprepared for it would never prove successful.</p> ",
    "comments": "<h1>Other Options</h1> <p>Yache Berry can keep Landorus-T from being OHKOed by Ice Beam; however, without proper investment, STAB Ice Beams will still OHKO through it. Explosion is an option on a Choice Band set, allowing Landorus-T to sacrifice itself in the interest of getting a frail threat such as Gardevoir or non-Mega-Evolved Salamence in for free while doing massive damage, though making your own Pokemon faint is very easy in a metagame crawling with Protect. Substitute is interesting for a Landorus-T that likes to stay in as opposed to bouncing around for Intimidate spam, though it is less useful when Mega Kangaskhan and Sylveon can simply ignore or break through these Substitutes with ease. Earth Plate powers up Earthquake without forcing Landorus-T to lock itself into a move or sacrificing bulk, though the usefulness of this is limited to improving matchups against team-specific threats such as Mega Mawile.</p> <h1>Checks and Counters</h1> <p><strong>Wide Guard: Quite possibly Landorus-T's Achilles heel, Wide Guard nullifies Earthquake and Rock Slide, dramatically reducing Landorus-T's usefulness. Common users of Wide Guard include Hitmontop, Aegislash, Smeargle, Hariyama, Mienshao, Swampert, and Aerodactyl.</p> <p><strong>Ice-type Moves and Pokemon: Mamoswine and Abomasnow make very short work of Landorus-T with their STAB Ice-type attacks, and bulkier Ice Beam users such as Suicune and Cresselia can OHKO or deal huge damage to it, while Landorus-T does little to no damage in return with its main means of offense, Earthquake and Rock Slide.</p> <p><strong>Water-types: The combination of Politoed, Ludicolo, and Kingdra gives Landorus-T a very hard time, as it can't outspeed Swift Swim users even with a Choice Scarf and each can threaten a KO with a Water-type move or Ice Beam. Mega Blastoise sometimes runs Water Pulse, allowing it to OHKO Landorus-T no matter where on the battlefield it resides. Rotom-W can OHKO Landorus-T with Hydro Pump and is immune to Earthquake. While Jellicent gets hit hard by Knock Off, it's almost always run on Trick Room teams, usually giving it the chance to OHKO Landorus-T with a powerful Water Spout. Gyarados inhibits Landorus-T's damage output with Intimidate and can OHKO it with a STAB move at +0 or with Ice Fang at -1.</p> <p><strong>Defiant or Competitive Pokemon: Milotic's Special Attack is doubled by Landorus-T's Intimidate, giving it a huge offensive advantage if it comes in at the right time, easily OHKOing with a boost. Choice Scarf Braviary is also a problem, as it outspeeds Adamant Choice Scarf Landorus-T when running a Jolly nature and can threaten to OHKO it with a boosted Brave Bird. While Bisharp is a poor answer to Landorus-T alone, a boosted Sucker Punch deals a serious amount of damage, and it can be especially devastating when paired with a Wide Guard Pokemon.</p> <p><strong>Burns and Intimidate: As with anything that relies on its Attack stat, Intimidating Landorus-T or burning it can quickly reduce its damage output. Sableye, Gengar, and Rotom-W can somewhat reliably burn Landorus-T with Will-O-Wisp thanks to Prankster or Levitate, while Dusclops's sheer bulk ensures it'll live to fire off Will-O-Wisp. Scrafty, Hitmontop, and Gyarados are top picks to Intimidate Landorus-T, as they resist or are immune to most of Landorus-T's offensive options and can use Fake Out to neutralize it for a turn or KO it directly.</p> <p><strong>Trick Room: Landorus-T's decent base 91 Speed makes it extremely vulnerable to Trick Room, as the heavy hitters of Trick Room tend to be powerful special attackers such as Sylveon, Mega Camerupt, and Heatran.</p> ",
    "sets": [
      {
        "name": "Choice Scarf",
        "description": "<h1>Moves</h1> <p>Earthquake and Rock Slide are Landorus-T's main forms of offense, as spread damage coming off base 145 Attack is very useful. U-turn saves Landorus-T from Perish Song and helps Landorus-T bounce out to allow safe switches or just to get damage off while ensuring another Intimidate. The last slot is mainly for coverage purposes. Knock Off hits Wide Guard Aegislash hard, removes items, and is just a solid offensive type to lock Landorus-T into. Rock Tomb gives Landorus-T some minor speed control and ignores Wide Guard, while Stone Edge lets Landorus-T fare better against bulky Mega Charizard Y.</p> <h1>Set Details</h1> <p>Adamant is the nature of choice, giving Landorus-T the power it needs to spread Earthquake. 228 Speed EVs are recommended for outspeeding Choice Scarf Smeargle. While maximum Speed can be helpful in some mirror matches against other Landorus-T, being slower allows your Landorus-T to U-turn out after your opponent's, which gives you a slight edge in scouting. Jolly should only be used if your team is especially scared of Choice Scarf Braviary, which can OHKO Landorus-T with +1 Brave Bird.</p> <h1>Usage Tips</h1> <p>When using Choice Scarf Landorus-T, don't be shy about switching constantly to take full advantage of Intimidate and the ability to switch moves. U-turn helps wear down foes, so use that to switch out if Landorus-T is not immediately threatened (especially against Perish Song teams).</p> <p>It might be tempting to throw out Earthquake and Rock Slide as much as possible, but beware of this tactic you are facing users of Wide Guard such as Aegislash and Hitmontop. If you feel pressured to leave Landorus-T in against these Pokemon and have no means of stopping Wide Guard, using one of its other coverage moves is less risky.</p> <p>An important aspect of Landorus-T is where to place it. Landorus-T makes an excellent lead in the middle, allowing it to Intimidate all three foes while threatening all of them with its spread attacks. However, later in the game, Landorus-T can work fine in one of the corners if that means avoiding an Ice Beam or Intimidating the only relevant Pokemon. Putting Landorus-T on the side will also mean avoiding hitting your other side Pokemon with Earthquake, which increases its attacking options. Choice Scarf Landorus-T's Speed also makes it great at shifting while in the corner, potentially saving your middle Pokemon from a KO if Landorus-T doesn't use Earthquake. One final note is that if you see a Defiant or Competitive user such as Bisharp, Milotic, or Braviary, leading with Landorus-T is highly discouraged, as Landorus-T will give its foe an offensive boost.</p> <h1>Team Options</h1> <p>Anything immune to Landorus-T's Earthquake makes a good partner. Mega Charizard Y, Rotom-W, and Rotom-H can throw out their STAB moves alongside Landorus-T to beat down the opponent with constant spread moves. If you want to protect your whole team from your Landorus-T's Earthquakes, carrying Wide Guard support isn't a bad idea. Wide Guard users that work well with Landorus-T include Hitmontop, Aegislash, and Hariyama. Another Intimidate user such as Hitmontop or Gyarados also works well (except when you're faced with Bisharp or Milotic), as you can switch them out, use U-turn with Landorus-T, and switch them back in to put your foes at -3 Attack in one turn. You can refresh Hitmontop's Fake Out this way as well. Be wary of doing this when the opponent has Bisharp, as Defiant can take advantage of Intimidate and turns an Attack drop into a boost. Other than that, just about everything can use Protect against Landorus-T's Earthquakes and enjoys Intimidate support.</p> <p>It is almost required to run anti-Wide Guard support in the form of Feint or Snatch with Landorus-T, as the move's presence dramatically reduces Landorus-T's offensive capabilities. Common Wide Guard Pokemon to look out for include Hitmontop, Aegislash, Smeargle, Hariyama, Mienshao, Swampert, and Aerodactyl. Talonflame, Rotom-W, and Crobat are superb Snatch-using teammates, thanks to their Earthquake immunity, while Meowstic is notable for being able to use Safeguard to protect Landorus-T from status moves. Other good Snatch and Feint users to consider include Hitmontop, Hariyama, and Mienshao. Choice Scarf Landorus-T also despises Trick Room because of its high Speed, so carrying a Trick Room user of your own isn't a bad idea to nullify your opponent's use of it. Dusclops and Kecleon are especially good choices, as they have access to Snatch and Feint, respectively, while Chandelure and Mega Gardevoir can stop Trick Room and Protect with Imprison.</p> <p>Landorus-T is a very high-value target, especially because you'll most often send it out in the middle of the battlefield, so consider some fast Pokemon to shift in Landorus-T's place to take Ice-type attacks. Talonflame and Meowstic do a good job of taking weaker Ice-type attacks from the likes of Zapdos and Cresselia, while Hariyama and Jellicent do an excellent job of taking Ice Beams under Trick Room.</p> "
      },
      {
        "name": "Physical Attacker",
        "description": "<h1>Moves</h1> <p>Without a Choice item, Landorus-T does much better against Wide Guard Pokemon and is able to take advantage of its good bulk. Earthquake and Rock Slide are Landorus-T's main attacks, while U-turn is for safe switches and Intimidate spamming. Superpower lets Landorus-T destroy Bisharp under Wide Guard, and slam Mega Kangaskhan. If your team can handle those two threats just fine, consider Knock Off for hitting Aegislash while under Wide Guard, and hitting Cresselia harder. If you aren't running Assault Vest, Protect can be a nice option to punish foes targeting Landorus-T.</p> <h1>Set Details</h1> <p>Maximum HP and Attack investment lets Landorus-T make the best use of Assault Vest's added special bulk while still giving it good attacking power. If you need more bulk, a Careful nature can be used to survive Modest Suicune's Ice Beam. If you're more worried about Landorus-T outspeeding threats such as Smeargle, consider running at least 228 Speed EVs to outspeed Focus Sash variants.</p> <p>There are three other items worth mentioning if you're willing to give up bulk. Lum Berry allows Landorus-T to take one Dark Void from Smeargle and avoid Will-O-Wisp; Focus Sash lets Landorus-T take one powerful attack; and Life Orb makes Landorus-T incredibly powerful.</p> <h1>Usage Tips</h1> <p>Usually, Landorus-T works best when sent out in the middle of the battlefield, as this lets Landorus-T Intimidate all three opposing Pokemon. This works especially well early in the game, but be warned: if you see Bisharp, Milotic, or Braviary in Team Preview, it's best not to lead with Landorus-T, as their abilities will get their offensive stats a boost from Intimidate. Landorus-T doesn't always have to be sent out in the middle, though, as being sent on one of the side positions ensures that Landorus-T's Earthquake won't hit the Pokemon on the other side, freeing that teammate from using Protect.</p> <p>While this Landorus-T may not be restricted by a Choice item, be wary of blindly using Earthquake and Rock Slide against common Wide Guard users such as Hitmontop, Hariyama, and Aegislash, as they can use the turn wasted in using a spread attack to gain the upper hand. If you can't send out a Feint or Snatch Pokemon against these threats, you're probably best off using Knock Off, Superpower, or U-turn if Landorus-T must attack.</p> <p>As many opponents will assume Landorus-T is carrying a Choice Scarf, consider switching Landorus-T out before you use more than one move or using U-turn if your opponent's Pokemon are all slower than Landorus-T. If you fool your opponent into thinking that your Landorus-T is carrying a Choice Scarf, this can shift momentum to your side with a surprise Knock Off or Superpower!</p> <h1>Team Options</h1> <p>Landorus-T appreciates speed control, especially in the form of Tailwind. Talonflame is your number one pick for this job, thanks to its excellent support movepool, but Mega Charizard Y deserves a special mention, as Drought combats Politoed and Landorus-T's Intimidate allows Mega Charizard Y to survive Rock Slides much more easily. Other good options for Tailwind users include Zapdos (which can fry Water-types with Thunderbolt), Crobat (which, much like Talonflame, has access to Snatch), and Hydreigon (which can smash Aegislash with Dark Pulse). Thunder Wave from users such as Cresselia, Rotom-W, and Male Meowstic can also work well against individual speedy Pokemon, while Icy Wind from Cresselia or Suicune can work well against Taunt. Milotic deserves special mention as an Icy Wind user, as its ability Competitive can make your opponent reluctant to use Intimidate against Landorus-T. Finally, while Landorus-T itself is not a huge fan of Trick Room, it still fits well on partial Trick Room teams, and this can be an especially effective way for Landorus-T to push offensive pressure on Swift Swim Pokemon such as Ludicolo and Kingdra.</p> <p>Always prepare for Landorus-T's greatest triples threat, Wide Guard, as a Landorus-T unable to use its spread attacks becomes far less effective. The usual Wide Guard suspects to watch out for include Hitmontop, Aegislash, Smeargle, Hariyama, Mienshao, Swampert, and Aerodactyl. The best solution against Wide Guard is to pack users of Feint or Snatch to nullify it. Talonflame, Rotom-W, and Crobat deserve special mentions, as they happen to be immune to Landorus-T's Earthquakes. Other reliable options to consider include Hitmontop, Hariyama, Meowstic, Clefairy, and, if you're using Landorus-T on Trick Room, Dusclops and Kecleon. Also note that, ironically, Landorus-T appreciates Wide Guard support to protect its own teammates, so consider using any one of Landorus-T's great nemeses for additional support!</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Theorymon", "user_id": 29010}], "teams": [{"name": "Quality checked by", "members": [{"username": "NOVED", "user_id": 234462}, {"username": "Whiskey Tango", "user_id": 222394}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}, {"username": "GatoDelFuego", "user_id": 91628}]}]}
  },
  "Talonflame": {
    "overview": "<p>Talonflame is a staple Pokemon in the Battle Spot Triples metagame that provides teams with a good offensive Pokemon with incredible support options. It has priority STAB Brave Bird that can hit any side of the field, no matter what position Talonflame is in; this means that unlike against most other Pokemon, your opponent can't position their Pokemon to avoid Talonflame's attacks. Talonflame is very useful for disrupting opposing strategies and providing your own team with speed control. It has support moves such as Tailwind, Quick Guard, and Snatch, all incredibly useful moves to have on a Triples team. Talonflame has a nice Fire / Flying typing as well, giving it some useful resistances to common types such as Fairy and Fire and an immunity to Ground. Furthermore, Talonflame can work on almost any kind of team: it's great on offensive teams because it can provide support without being dead weight offensively, and it provides great support for balanced teams or Trick Room teams as a fast backup attacker. However, Talonflame is very frail and has a crippling 4x weakness to the common Rock Slide, so it can often be hard to keep it in the fight for more than a few turns.</p> ",
    "comments": "<h1>Other Options</h1> <p>Choice Band makes Talonflame a very strong attacker that can hit any side of the field; it's especially good on Trick Room teams to OHKO Amoonguss, which usually is a pain. Running Choice Band means Talonflame gives up a lot of its support options and becomes much less flexible. Lum Berry can be useful when facing Dark Void Smeargle or Amoonguss. Focus Sash can guarantee Talonflame survives a second turn after setting up Tailwind. Talonflame can be run more defensively, as priority can make up for lack of Speed investment, allowing you to run bulk to patch up Talonflame's frailty. Acrobatics can be used as an alternative to Brave Bird with no recoil, but it has a much lower damage output and your opponent will be able to see Talonflame's lack of item in Team Preview and know what to expect. Charti Berry can be used to allow Talonflame to survive one Rock Slide. Bulk Up can be used to help Talonflame survive some attacks and become very strong, but it is often hard to find good setup opportunities and it is difficult to fit into a moveset. Bulk Up is also susceptible to being taken by opposing Snatch users.</p> <h1>Checks and Counters</h1> <p><strong>Intimidate: Talonflame's Attack isn't very impressive to begin with, and after an Attack drop from Intimidate, Talonflame can really struggle to do significant damage.</p> <p><strong>Bulky Water-types</strong>: Water-types such as Mega Blastoise, Politoed, and Jellicent can take Talonflame's hits fairly easily and fire back with super effective STAB moves. Mega Blastoise can also hit Talonflame from any side of the field when running Water Pulse.</p> <p><strong>Rock-type Moves: Talonflame will be KOed by almost any Rock-type move without Intimidate factored in. Landorus-T with Rock Slide is especially common and Intimidates Talonflame as well. Tyranitar takes Brave Birds easily and fires back with powerful STAB Rock Slides.</p> <p><strong>Snatch: Talonflame often provides great support with Quick Guard and Tailwind, both being susceptible to Snatch, making it difficult to play around opponents with it.</p> <p><strong>Quick Guard</strong>: Talonflame's main attack has priority, so Quick Guard completely shuts Talonflame down offensively. Without a partner with Feint or Snatch, there isn't much Talonflame can do to stop this.</p> <p><strong>Electric-types</strong>: Pokemon such as Zapdos, Rotom-W, and Thundurus resist Brave Bird and hit back with super effective STAB moves. Zapdos is especially good because it's very bulky and can Roost off any damage Talonflame does to it. Zapdos can also use Tailwind itself to match Talonflame's Tailwind.</p> ",
    "sets": [
      {
        "name": "Offensive Support",
        "description": "<h1>Moves</h1> <p>Brave Bird is Talonflame's strongest STAB Flying-type move and hits any side of the field regardless of what position it's in. Thanks to Gale Wings, Talonflame can set up Tailwind very reliably, providing speed control for your team, which is very important in Triples. Quick Guard protects your team from various moves such as Fake Out, Sucker Punch, and Flying-type attacks from opposing Talonflame. Fake Out is an especially important move to block because it's incredibly common in the metagame, and Talonflame conveniently outspeeds every unboosted user of Fake Out bar Mega-Evolved Mega Lopunny. Snatch is a very useful move in Triples, as it can stop many common moves such as Wide Guard, Quick Guard, Reflect, Light Screen, and Tailwind. Stopping your opponent from using Wide Guard and Quick Guard is especially useful for helping Talonflame's teammates use spread moves or Fake Out. If you don't need Tailwind on Talonflame, or are using it on a Trick Room team, it has many other options it can use. Protect can be used for stalling Trick Room and keeping Talonflame on the field for another crucial turn of support. Flare Blitz allows Talonflame to hit Steel-types such as Aegislash. Taunt can help prevent Wide Guard, Trick Room, and other strategies. Will-O-Wisp can be used to cripple many physical attackers such as Mega Kangaskhan.</p> <h1>Set Details</h1> <p>A Jolly nature with maximum Speed investment is used to at least Speed tie with other Talonflame and allows Talonflame to outspeed Weavile and Quick Guard its Fake Out. 60 EVs in HP help Talonflame survive a -1 Rock Slide from Landorus-T. The remaining EVs are put into Attack to get the best damage output possible. Sharp Beak is used to give Talonflame a better offensive presence; it is usually used over Life Orb so that Talonflame will have a little less recoil and potentially survive a turn or two longer, as well as allowing another teammate to use Life Orb if need be. If you don't mind the extra recoil and want more damage, Life Orb is still a viable option. Gale Wings is an amazing ability, allowing Talonflame to usually move first, even against opposing speed control such as Trick Room and Tailwind.</p> <h1>Usage Tips</h1> <p>Talonflame should utilize its support moves to give your team the biggest advantage possible. If the opposing team doesn't have any way to initially stop your speed control, Tailwind should be used. If the opponent has their own Tailwind setter, you might want to attempt to Snatch it, preventing it and using it for yourself. Snatch should also be used if you have teammates using spread attacks, such as Earthquake and Hyper Voice, against a foe that might have Wide Guard. If you need to get a Fake Out off with one of Talonflame's teammates, Snatch can also be used if you expect your opponent to use Quick Guard. You can also use Talonflame's Quick Guard when you expect opposing Fake Out or other priority moves to come your way. Successfully stopping any Fake Out will usually put a big dent in your opponent's plans. Aside from its great support, Talonflame can use its strong priority attacks to get off good damage, being especially useful for its ability to hit any side of the field. Because of this, you usually want to position Talonflame away from the center to avoid more Pokemon being able to target it. Positioning it away from the center is also nice because Talonflame can use its great natural Speed for shifting, which can be very useful for protecting Talonflame's teammates from predicted attacks.</p> <h1>Team Options</h1> <p>Pokemon with spread attacks, such as Earthquake and Heat Wave, really appreciate Talonflame's ability to Snatch away opposing Wide Guard. Pokemon with good spread attacks that work well with Talonflame include Sylveon, Landorus-T, Blastoise, and many more. Talonflame can also use its strong Brave Birds to weaken Pokemon for these spread attacks to clean through the opposing team. Pokemon with Wide Guard, such as Aegislash, Hitmontop, and Hariyama, can assist Talonflame by blocking Rock Slide. Hitmontop and Hariyama also appreciate Talonflame's Snatch because it helps them get off Fake Out against Quick Guard users. They can also use Feint to break Quick Guard for Talonflame's Brave Bird. Pokemon with average Speed, such as Mega Blastoise, Sylveon, and Assault Vest Landorus-T, can benefit from the Tailwind that Talonflame provides. Trick Room teams like having Talonflame as a backup fast attacker and for the support it can provide against Fake Out users that try to stop Trick Room from going up. Snatch also helps stop Wide Guard, which normally threatens most strong Trick Room sweepers such as Sylveon, Mega Camerupt, and Jellicent. Talonflame also deals with Amoonguss well, which can be a major problem for Trick Room teams. Talonflame is very frail, so Intimidate support is useful to soften some blows. Landorus-T and Hitmontop both offer Intimidate support and synergize well with Talonflame for reasons listed above. Talonflame also hates opposing Intimidate, so having Bisharp as a partner helps to play against it and discourages your opponent from leading with or bringing in their Intimidate users. Some other viable Defiant or Competitive Pokemon to accomplish this with are Milotic and Braviary. Although Braviary stacks weaknesses with Talonflame and functions similarly, having both can quickly wear down the opponent's Flying-type checks. Electric-types such as Zapdos and Rotom-W can help against bulky Water-types that Talonflame struggles with. Rotom-W can easily deal with Landorus-T and can also Snatch away Quick Guards for Talonflame.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "NOVED", "user_id": 234462}], "teams": [{"name": "Quality checked by", "members": [{"username": "Theorymon", "user_id": 29010}, {"username": "Whiskey Tango", "user_id": 222394}]}, {"name": "Grammar checked by", "members": [{"username": "P Squared", "user_id": 168392}, {"username": "GatoDelFuego", "user_id": 91628}]}]}
  }
}