{
  "Gengar": {"sets": {"Standard": {}, "Counter": {}, "Choice Specs": {}}},
  "Raikou": {"sets": {"Pressure Stall": {}}},
  "Entei": {"sets": {"Assault Vest": {}, "Anti-Charizard, Anti Kyurem-B": {}, "Pressure Stall": {}}},
  "Crustle": {"sets": {"Custap Berry": {}}},
  "Greninja": {"sets": {"Timid Choice Specs": {}, "Modest Choice Specs": {}, "Petaya Berry": {}, "Choice Band": {}}},
  "Gardevoir": {"sets": {"Modest Icy Wind": {}, "Fast": {}, "Encore + Disable": {}, "Trick Room": {}}},
  "Magnezone": {"sets": {"Custap Berry": {}, "Choice Specs": {}}},
  "Gallade": {"sets": {"Standard": {}, "Encore + Disable": {}}},
  "Heatran": {"sets": {"Air Balloon": {}, "Choice Specs": {}, "Custap Berry": {}, "Choice Scarf": {}}},
  "Aegislash": {"sets": {"Standard": {}}},
  "Empoleon": {"sets": {"Choice Specs": {}, "Custap Berry": {}}},
  "Cresselia": {"sets": {"Standard": {}}},
  "Venusaur": {"sets": {"Standard": {}, "Curse": {}}},
  "Blastoise": {"sets": {"Standard": {}, "Anti-Porygon-Z": {}}},
  "Clefable": {"sets": {"Stall": {}}},
  "Arcanine": {"sets": {"Choice Scarf": {}, "Choice Band": {}}},
  "Alakazam": {"sets": {"Encore + Disable": {}}},
  "Golem": {"sets": {"Standard": {}, "Weakness Policy": {}}},
  "Slowbro": {"sets": {"Standard": {}, "Demonbro": {}}},
  "Chansey": {"sets": {"Standard": {}}},
  "Pinsir": {"sets": {"Standard": {}, "Flail": {}, "Facade": {}}},
  "Gyarados": {"sets": {"Standard": {}, "Anti-Kyurem-B": {}, "Fast": {}, "Bulky Offensive": {}}},
  "Zapdos": {"sets": {"Choice Specs": {}, "Stall": {}, "Custap Berry": {}}},
  "Dragonite": {"sets": {"Bulky Choice Band": {}, "Choice Scarf": {}, "Choice Specs": {}}},
  "Mew": {"sets": {"Sitrus Berry": {}, "Rocky Helmet": {}, "Stall": {}, "Choice Band": {}}},
  "Ampharos": {"sets": {"Standard": {}, "Anti-Gyarados, Anti Heatran": {}, "Stall": {}}},
  "Azumarill": {"sets": {"Stall": {}, "Custap Berry": {}, "Weakness Policy": {}}},
  "Umbreon": {"sets": {"Standard": {}}},
  "Scizor": {"sets": {"Standard": {}}},
  "Heracross": {"sets": {"Standard": {}, "Specially Defensive": {}, "Bullet Seed": {}}},
  "Kingdra": {"sets": {"Anti-Dragons": {}}},
  "Donphan": {"sets": {"Choice Band": {}}},
  "Porygon2": {"sets": {"Standard": {}}},
  "Tyranitar": {"sets": {"Standard": {}, "Dragon Dance": {}}},
  "Swampert": {"sets": {"CounterCoat": {}}},
  "Slaking": {"sets": {"Choice Band": {}}},
  "Sableye": {"sets": {"Confide": {}, "Defensive Snarl": {}, "Specially Defensive": {}}},
  "Mawile": {"sets": {"Taunt": {}, "Offensive HyperCutter": {}, "Punishment": {}, "Metal Burst": {}}},
  "Aggron": {"sets": {"Standard": {}, "Curse": {}, "Choice Band": {}}},
  "Medicham": {
    "comments": "<h3>Other Options</h3> <p>Mega Medicham can run Bullet Punch with an Adamant nature to answer Mega Diancie, Mega Gardevoir without Protect, and Archeops; however, this is largely outclassed by Giga Impact and Poison Jab. A defensive Mega Medicham set with Thunder Punch and Bulk Up can be run as a guaranteed counter to Mega Gyarados; however, this depreciates Mega Medicham's Speed and Attack EVs, which it desperately needs for many threats like Genesect, Mega Metagross, and Manaphy.</p>",
    "sets": {
      "Fake Out Attacker": {
        "description": "<h4>Set Description</h4> <p>Fake Out breaks Sturdy and Multiscale against Pokemon such as Aggron, Magnezone, and Dragonite; next to that, it gives Mega Medicham just that little bit of damage to get KOs with its stronger attacks. High Jump Kick KOs Pokemon like Heatran, Meloetta, and Manaphy after a Fake Out. Giga Impact helps against bulky Volcarona, non-Choice Scarf Victini, and Mega Gardevoir. Bulk Up is useful against bulky variants of Mega Metagross, as well as Mega Aggron and Rhyperior. Poison Jab OHKOes Mega Gardevoir and Whimsicott. Endure gets around Pokemon that use recharge moves like Greninja, Mega Lopunny, and Porygon-Z. It can also be used for those with Endure + Custap Berry like offensive Manaphy. Zen Headbutt deals with Pokemon like Mega Venusaur and Mega Heracross. Ice Punch is there for those weak to Ice, like non-Choice Scarf Dragonite and Landorus-T. Thunder Punch gives Mega Medicham a better Mega Gyarados matchup.</p> <h4>EVs</h4> <p>Maximum Speed with a Jolly nature is so that Mega Medicham outspeeds non-Choice Scarf Genesect and can Speed tie Manaphy, Mega Gardevoir, and other Mega Medicham. The four leftover EVs are put into Special Defense so that Download from Genesect gives an Attack boost instead of Special Attack. An Adamant nature can be run for more firepower, which helps against Volcarona, fast Mega Metagross, and Victini when using Giga Impact.</p> <h4>Usage Tips</h4> <p>Using Mega Medicham is pretty straightforward; you always use Fake Out the first turn, followed by the strongest move possible. By using Fake Out, you can estimate the foe's HP and defensive EVs, which is helpful for Pokemon that run different sets. Greninja is an example; while Torrent Greninja runs Defense EVs, Choice Specs Greninja does not; knowing its set helps you decide whether to use an attack or Endure.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 449859, "username": "DezShizzels"}, {"user_id": 425798, "username": "pqs"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 437679, "username": "crucify"}, {"user_id": 234355, "username": "DEG"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}, {"user_id": 197240, "username": "sunny004"}]}]}
  },
  "Manectric": {"sets": {"Bulky": {}, "Offensive": {}}},
  "Altaria": {"sets": {"Facade": {}, "Dragon Dance": {}, "Stall": {}, "Hyper Voice": {}}},
  "Metagross": {"sets": {"Standard": {}, "Defensive": {}, "Fast": {}, "Bulky": {}}},
  "Registeel": {"sets": {"Specially Defensive": {}, "Stall": {}}},
  "Latias": {"sets": {"Anti-Charizard": {}, "Calm Mind": {}, "Charm": {}}},
  "Latios": {"sets": {"Modest Choice Specs": {}, "Hidden Power Poison": {}, "Choice Scarf": {}}},
  "Jirachi": {"sets": {"Choice Scarf": {}}},
  "Deoxys-Speed": {"sets": {"Pressure Stall": {}, "Choice Specs": {}, "Choice Band": {}}},
  "Gastrodon": {"sets": {"CounterCoat": {}}},
  "Ambipom": {"sets": {"Life Orb": {}}},
  "Lopunny": {"sets": {"Jolly": {}, "Adamant": {}}},
  "Garchomp": {
    "overview": "<p>Choice Band Garchomp's sky-high Attack stat combined with its strong movepool and nice Speed tier makes it a premier offensive presence in the metagame. Its Speed stat allows it to just barely outspeed base 100 Speed Pokemon like Mega Gardevoir, Mega Medicham, and Volcarona, which makes running Choice Scarf not much of a necessity. A useful Dragon / Ground typing gives it a powerful STAB Outrage and Earthquake able to take down common metagame threats like non-Choice Scarf Kyurem-B, non-defensive Mega Mawile, and Aegislash. Despite having a powerful offensive presence, there's much to be desired for with Garchomp's defensive capabilities. Almost any Pokemon holding a Choice Scarf, like Porygon-Z, Kyurem-B, Genesect, and Dragonite, can outspeed and KO it with ease. It also has a hard time against threats that naturally outspeed it like Mega Lopunny and Greninja. Garchomp also struggles with physically defensive Pokemon that it can't KO turn one, such as Metal Burst Mega Mawile, Mega Gyarados, and Mega Altaria, and they can usually KO Garchomp outright or after setting up.</p>",
    "comments": "<h3>Other Options</h3> <p>An alternative EV spread of 176 Atk / 80 SpD / 252 Spe with a Jolly nature can be ran to let Garchomp always take a Hidden Power Ice from maximum Special Attack Heatran and non-Choice Specs Magnezone; only run this alongside Fling to beat all Heatran variants and Custap Berry Magnezone. This does have its downfalls, though; Garchomp's reliability against Mega Mawile and Mega Metagross lessens because now it can't always get them into the range where Rough Skin damage is enough to KO them after an Earthquake; it also gives Garchomp worse odds against defensive variants of Mega Gardevoir if running Poison Jab. Choice Scarf can be run to outspeed and beat Greninja, Choice Scarf Kyurem-B and Genesect, and opposing Garchomp. This set largely misses the mark, however, as its main purpose of outspeeding and KOing hyper offensive Pokemon is inconsistent at best, seeing as how it cannot beat other glass cannons like Darkrai and Mega Lopunny. This set also loses out on the damage output that lets Garchomp win matchups against threats like Mega Mawile, Mega Metagross, Mega Gardevoir, and Aegislash. Mega Garchomp can be used due to its bulk and the fact that it retains Garchomp's base Speed tier on the first turn that it Mega Evolves. With defensive EVs and Rock Tomb, it can beat Mega Lopunny and Choice Scarf Dragonite, and it can also freely use Swords Dance for stall matchups or Substitute for catching Porygon-Z and Meloetta off-guard. However, Mega Garchomp has neither nearly as much of the damage output that Choice Band provides nor the Speed of Choice Scarf, so this is largely outclassed.</p> <h3>Checks and Counters</h3> <p><strong>Ice-type Coverage</strong>: Common threats that run Ice-type coverage like Choice Scarf Kyurem-B, Choice Scarf Genesect, Mega Lopunny, Manaphy, Darkrai, and Greninja are big threats to Garchomp, as they can either outspeed or take a hit from it and KO it with relative ease.</p> <p><strong>Stall</strong>: Stall Pokemon like Mega Sableye, Mega Slowbro, and Mega Venusaur all give Garchomp a tough time due to them being able to wear it out by either crippling Garchomp's Attack or raising their own Defense.</p> <p><strong>Bulky Fairy-types</strong>: Fairy-types like Mega Altaria and Sylveon give Garchomp a tough time because they can KO it after taking a hit from it.</p> <p><strong>Faster Pokemon</strong>: Pokemon such as Protect Mega Diancie, Choice Scarf Porygon-Z, Latios, and Protect Mega Pinsir can outspeed Garchomp and OHKO it due to its bad defenses.</p> <p><strong>Damage Reflection</strong>: Pokemon such as Mega Sableye, Mega Mawile, Mega Aggron, Rhyperior, and Mega Tyranitar pose huge threats to Garchomp; since it's locked into an attack and can't play around these foes, they can take a hit from Garchomp and then respond with a stronger Metal Burst or Counter.</p>",
    "sets": {
      "I'd Go Chomper Here (Choice Band)": {
        "description": "<h4>Set Description</h4> <p>Iron Tail covers Mega Gardevoir, Togekiss, and Choice Specs Sylveon. Alternatively, Garchomp can use Poison Jab to beat Whimsicott and for its higher accuracy at the cost of worse Mega Gardevoir and Sylveon matchups due to its reduced power. Fire Fang can be ran to beat Steel-types that Earthquake doesn't like Mega Scizor, Ferrothorn, and Choice Specs Genesect. Fling allows Garchomp to take down Air Balloon Heatran and Custap Berry Magnezone. If using Swords Dance, Fling also allows Garchomp to beat Chansey, stall Manaphy, Registeel, and Mega Venusaur. Rough Skin is the preferred ability, since if both Pokemon are KOed on the same turn, the Garchomp user would win, which makes investing EVs for Garchomp much harder for physical foes and allows Garchomp to more reliably take down non-Metal Burst Mega Mawile and Mega Metagross, as well as FEAR Pokemon like Aron. Choice Band maximizes Garchomp's power due to its already high Speed tier.</p> <h4>EVs</h4> <p>252 Speed EVs and a Jolly nature let Garchomp outspeed up to base 101s, including non-Choice Scarf Pokemon like Mega Medicham, Mega Gardevoir, Volcarona, Genesect, and Landorus. An Adamant nature gives Garchomp a better chance against defensive variants of Meloetta, Counter Registeel, and defensive variants of Mega Mawile, but this makes Garchomp lose out on the aforementioned Jolly matchups, which is why it is largely outclassed.</p> <h4>Strategy &amp; Support</h4> <p>Garchomp generally has very straightforward matchups, but be wary of sending it in if you know the opponent is going to choose Metal Burst Mega Mawile or Mega Aggron, as though Garchomp has a type advantage, both of them can take a hit and KO it back with Metal Burst. Watch out for Protect Mega Diancie, as it can outspeed and KO Garchomp before Garchomp can OHKO it with Earthquake. If Garchomp is using Fling and the opposing team has an Air Balloon Heatran, keep in mind that the opponent may be inclined to send Heatran out due to it being able to wall most Garchomp sets, allowing you to catch them off-guard. Using Fire Fang over Outrage against Crustle can give Garchomp a better chance to win against Counter variants due to the Rough Skin damage it gives them. Only give Garchomp Swords Dance if it already has Fling. Garchomp appreciates bulky offensive teammates that can take hits from and beat hyper offensive Pokemon like Mega Lopunny, Choice Specs Greninja, and Choice Scarf Porygon-Z, which outspeed Garchomp and KO it with ease. This means that Pokemon like Manaphy, Mega Metagross, and Mega Gardevoir make good teammates. Garchomp, in return, can take down Victini, Aegislash, and, if running Fire Fang, Choice Specs Genesect for these teammates. Garchomp also appreciates Steel-type teammates like Heatran, Mega Metagross, and Magnezone due to their ability to take down threatening Fairy-types that Garchomp can't already cover with its chosen coverage like Metal Burst Mega Mawile, Mega Altaria, and Custap Berry Sylveon. In return, Garchomp can take down opposing Heatran, Volcanion, and Volcarona. Garchomp's weakness to faster or adequately bulky Dragon-types like Choice Scarf Kyurem-B and Haban Berry Kyurem-B can be covered by Fairy-types like Mega Altaria, Mega Gardevoir, and Diancie. In return, Garchomp can take down Steel-type threats that they alone would normally struggle with, like Mega Metagross, Aegislash, Heatran if running Fling, and Mega Scizor if running Fire Fang.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 425798, "username": "pqs"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 234355, "username": "DEG"}, {"user_id": 289008, "username": "LRXC"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}, {"user_id": 240732, "username": "Astra"}, {"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Rhyperior": {"sets": {"Choice Band": {}, "Custap Berry": {}}},
  "Togekiss": {"sets": {"Kee Berry": {}, "Rocky Helmet": {}, "Choice Scarf": {}, "Choice Specs": {}}},
  "Porygon-Z": {"sets": {"Choice Scarf": {}, "Custap Berry": {}, "Choice Specs": {}}},
  "Manaphy": {"sets": {"Fast Stall": {}, "Bold Stall": {}, "Custap Berry": {}, "Choice Specs": {}}},
  "Victini": {"sets": {"Choice Band": {}, "Choice Specs": {}, "Choice Scarf": {}, "Weakness Policy": {}, "Bulky Weakness Policy": {}, "Custap Berry": {}}},
  "Serperior": {
    "comments": "<h3>Other Options</h3> <p>Assault Vest with Mirror Coat and Hidden Power Ground can also be used in order to lure in Choice Specs Greninja, non-Choice item Heatran, Meloetta, and non-Choice Specs Porygon-Z; this set fails to be reliable, however, because of Serperior's weak HP and Special Defense stats even after investment, making many matchups item-dependent. Serperior may use Worry Seed, stopping Registeel from using Rest by replacing its ability with Insomnia. Worry Seed also beats Mega Mawile by removing Huge Power and Dragon Dance Mega Altaria by removing Pixilate. Taunt beats stall Pokemon as well and gains other matchups such as Taunt Mega Aggron and Shell Smash Crustle. These moves, because they require dropping Protect, often lose more matchups than Worry Seed or Taunt will gain. Serperior can also use Occa Berry over Leftovers for Fire-types like Choice Specs or Weakness Policy Victini and non-Choice Scarf Heatran; this, however, loses out on the Leftovers recovery, which is pivotal in allowing Serperior to stall out Pokemon indefinitely.</p>",
    "sets": {
      "SubSeed": {
        "description": "<h4>Set Description</h4> <p>Serperior uses its great Speed tier to set Leech Seed and gain passive recovery at the end of the turn. Then, Serperior alternates between Protect and Substitute, chipping the opponent and stalling turns; this allows it to beat many top threats, such as Garchomp and Mega Metagross. To round out the set, Serperior uses Leaf Storm, which gains power with each use thanks to Contrary; this allows Serperior to beat stall Pokemon, such as Mega Sableye, Manaphy, and Mega Slowbro.</p> <h4>EVs</h4> <p>Serperior needs maximum Speed investment to outspeed base-110 Speed threats, most notably Mega Diancie, Mega Metagross, and non-Choice Scarf Archeops; this lets it fare well against other Serperior. The HP and Defense investment allows it to take an Outrage from Jolly Choice Band Garchomp while maximizing its HP.</p> <h4>Usage Tips</h4> <p>Versus Sableye, Serperior can use Protect on turn one to avoid Taunt, which will still be a priority move due to Prankster when they Mega Evolve. This will allow Serperior to get a Substitute off against Mega Sableye to avoid potential Metal Burst damage. If they use Calm Mind, use Leaf Storm. However, if they choose not to Mega Evolve, they preserve Prankster Taunt, and the matchup becomes a toss-up between Leaf Storm on Taunt or Substitute on Metal Burst. However, it should be noted that many Sableye do not carry Metal Burst. Versus various targets that are weak to Grass, such as Mega Diancie, Mega Gyarados, and Mega Slowbro, Serperior should use Leaf Storm repeatedly instead of setting Leech Seed. In most other matchups, using Leech Seed on turn one before alternating between Protect and Substitute provides the best chances of winning, provided Serperior survives the foe's initial attack.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 518399, "username": "Itchy"}, {"user_id": 425798, "username": "pqs"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 437679, "username": "crucify"}, {"user_id": 234355, "username": "DEG"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 197240, "username": "sunny004"}]}]}
  },
  "Audino": {"sets": {"Standard": {}}},
  "Sawk": {"sets": {"Choice Band": {}, "Choice Scarf": {}, "Custap Berry": {}}},
  "Whimsicott": {"sets": {"Standard Occa Berry": {}, "Defensive Occa Berry": {}, "Standard Babiri Berry": {}, "Defensive Babiri Berry": {}, "Yache Berry": {}}},
  "Archeops": {"sets": {"Choice Band": {}, "Choice Scarf": {}, "Anti-Stall Mew": {}}},
  "Reuniclus": {"sets": {"Stall": {}}},
  "Ferrothorn": {"sets": {"Standard": {}, "Choice Band": {}}},
  "Haxorus": {"sets": {"Choice Scarf": {}, "Choice Band": {}, "Haban Berry": {}}},
  "Durant": {"sets": {"Choice Band": {}}},
  "Volcarona": {"sets": {"Standard": {}, "Custap Berry": {}}},
  "Terrakion": {"sets": {"Choice Band": {}, "Choice Scarf": {}}},
  "Tornadus": {"sets": {"Toxic Stall": {}, "Assault Vest": {}}},
  "Thundurus-Therian": {"sets": {"Standard": {}}},
  "Landorus": {"sets": {"Choice Specs": {}, "Choice Scarf": {}, "Life Orb": {}}},
  "Landorus-Therian": {"sets": {"Choice Scarf": {}, "Choice Band": {}, "Choice Specs": {}}},
  "Kyurem-Black": {"sets": {"Choice Scarf": {}, "Haban Berry Toxic": {}, "Choice Band": {}, "Choice Specs": {}, "Bulky Choice Specs": {}}},
  "Meloetta": {"sets": {"Choice Specs": {}, "Choice Scarf": {}}},
  "Genesect": {"sets": {"Choice Scarf": {}, "Choice Specs": {}}},
  "Diggersby": {"sets": {"Choice Band": {}, "Choice Scarf": {}}},
  "Talonflame": {"sets": {"Bulk Up": {}}},
  "Tyrantrum": {"sets": {"Choice Scarf": {}}},
  "Sylveon": {"sets": {"Choice Specs": {}, "Custap Berry": {}}},
  "Diancie": {"sets": {"Choice Specs": {}, "Weakness Policy": {}, "Standard Mega": {}}},
  "Hoopa-Unbound": {"sets": {"Choice Band": {}, "Choice Specs": {}, "Mixed Choice Scarf": {}}},
  "Volcanion": {"sets": {"Choice Scarf": {}, "Standard Choice Specs": {}, "Bulky Choice Specs": {}, "Shuca Berry": {}}}
}