{
  "Pikachu": {"sets": [{"name": "Imposter"}]},
  "Gengar": {
    "comments": "<h1>Other Options</h1> <p>Substitute can be used to decrease Mega Gengar's reliance on Substitute-passing Wonder Guard users, as well as being able to reset a Substitute if it was broken to continue sweeping. Boomburst can be used as another attack to Imposter-proof effectively, and it allows Gengar to hit foes behind a Substitute. However, this option is not recommended, as Gengar can typically clear foes with its standard moveset effectively. King's Shield can be used as an option to counter -ate Speed users, lowering their Attack while avoiding a turn of potential priority damage.</p> <h1>Checks and Counters</h1> <p><strong>Pursuit: Pursuit users—namely Huge Power Dark-types like Mega Gyarados, Mega Tyranitar, and Yveltal—and -ate Speed users like Kyurem-B can force 50-50s every time they come in on Mega Gengar. However, they can usually only come in once or twice before getting put into KO range by Judgment. A few other, less prevalent Pursuit users like Wonder Guard Skuntank and Drapion might need Knock Off and Pursuit to adequately force 50-50s versus Mega Gengar.</p> <p><strong>Wonder Guard Blissey and Mega Audino: Because Mega Gengar usually has to pick between Sludge Wave and Secret Sword, Mega Gengar may not be able to break Blissey that check Sludge Wave sets and Mega Audino that check Secret Sword sets. However, the opponent has to scout Mega Gengar's coverage move first, as not knowing which move Mega Gengar has chosen as coverage makes it very unsafe for both Blissey and Mega Audino to come in. Sometimes, Mega Gengar runs both coverage moves to check both.</p> <p><strong>Prankster Pokemon</strong>: Prankster Pokemon like Giratina can threaten Mega Gengar's boosts or lure it into attacking into a Destiny Bond, instantly KOing both Pokemon.</p> <p><strong>-ate Speed Users: -ate Speed users such as Pixilate Mega Diancie and Refrigerate Kyurem-B are able to outspeed Mega Gengar with STAB Extreme Speed and threaten it with Pursuit as it switches out.</p> <p><strong>Special Walls: Special walls like Wonder Guard Primal Kyogre and Magic Guard Ho-Oh can survive a hit from +2 Mega Gengar, threatening to OHKO it back through its paper-thin defenses. Additionally, self-status-inflicting sets like Toxic Orb Ho-Oh prevent Gengar from putting them to sleep, allowing them to become crippled, well as being freely switching into Dark Void.</p> ",
    "sets": [
      {
        "name": "Mold Breaker",
        "description": "<p>Mold Breaker Mega Gengar is a strong sweeper that effectively does its job with the combination of Shell Smash and powerful Spooky Plate-boosted Judgment. Spooky Plate-boosted Judgment used in tandem with a partial Ghost typing makes Mega Gengar one of the most Imposter-proof Mold Breaker sweepers, as using Judgment without a Plate equipped makes it a Normal-type move. Sludge Wave is a strong STAB move that lets Mega Gengar beat common Fairy-types such as Xerneas and Mega Audino. Secret Sword allows Mega Gengar to attack Normal- and Dark-types, which resist or are immune to Judgment, while also offensively pressuring specially defensive support Pokemon like non-Imposter Chansey, Mega Gyarados, and Yveltal. In the last moveslot, Dark Void or Spore can effectively shut down switch-ins, generating more time to let Mega gengar set up or fire off more high-powered STAB moves. Notably, Mega Gengar benefits from putting Prankster Pokemon that intend to remove its boosts or KO it with a well-timed Destiny Bond to sleep. A Modest nature gives Mega Gengar a slight boost in power over Timid, but unboosted Modest Mega Gengar risks being outsped by rarer threats such as maximum Speed Arceus and Mega Rayquaza.</p> <p>Mega Gengar most effectively functions in combination with a Substitute-passing Wonder Guard pivot, allowing it to freely switch in and set up a Shell Smash. Additionally, Mega Gengar benefits from slow pivots that can build momentum by switching it in against a poorly matched opposing Pokemon. Switch-ins equipped with a Focus Sash have the greatest chance of countering Mega Gengar, so entry hazard setters like Wonder Guard Arceus and Mega Scizor are strongly recommended as teammates. Additionally, because of the lack of recovery, Mega Gengar struggles to survive long games without Wish and Defog support from Wonder Guard users and high-HP support Pokemon like Giratina, Xerneas, and Arceus. Finally, item removal support can give Mega Gengar the upper hand, namely by removing Safety Goggles from foes so Mega Gengar can put them to sleep or immobilizing bulky Pokemon that resist Mega Gengar's moves by Tricking a Choice item onto them.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 506113, "username": "BahamutLagoon"}, {"user_id": 569731, "username": "NToTheN"}]}, {"name": "Grammar checked by", "members": [{"user_id": 241023, "username": "Kris"}]}], "writtenBy": [{"user_id": 226455, "username": "berry"}]}
  },
  "Arceus": {
    "comments": "<h1>Other Options</h1> <p>For support Wonder Guard Arceus, an alternate EV Spread of 248 HP / 148 Def / 96 SpD / 16 Spe and a Bold nature can be used alongside Knock Off to soft check Mold Breaker Mega Gengar. This EV spread allows Arceus to survive +2 Mega Gengar's Sludge Wave after Stealth Rock while also avoiding the KO from +2 Secret Sword. This is noteworthy, as every other Normal-type Wonder Guard user bar Meloetta struggles versus unscouted Mega Gengar. Alternatively, a fully specially defensive EV spread with a Calm nature can be used alongside Knock Off to check other Plate + Judgment Mold Breaker sweepers such as Mega Diancie and Mega Sceptile while still checking Mega Gengar lacking Secret Sword. However, such a set sacrifices Arceus's ability to scout Primal Groudon, Mega Rayquaza, and other physical attackers effectively. 0 Speed EVs and IVs and a Relaxed nature can be used alongside Parting Shot or Baton Pass to provide slow pivoting support to Arceus’s team. However, Arceus is usually outclassed by Slaking in this role, comma since Arceus's naturally high Speed means it is still undersped by most opposing slow pivots such as Xerneas and Primal Kyogre.</p> <p>Like all support Wonder Guard users, Arceus has a panoply of useful utility options available to it. Spikes, Toxic Spikes, and Sticky Web are alternative entry hazard options over Stealth Rock. Glare and Will-O-Wisp can be used to punish incoming Mold Breaker users and Huge Power users, while Dark Void, Spore, and Taunt are all decent options with Arceus's good Speed tier. Whirlwind helps versus some setup sweepers, synergizes well with Stealth Rock and, perhaps more importantly, forces out Substitute + Baton Pass Wonder Guard users like Xerneas. Keep in mind, however, that all of the aforementioned options can be reflected with a timely Magic Bounce switch in and leave Arceus very vulnerable to Taunt. Nuzzle is an alternative to Glare that trades the ability to paralyze Wonder Guard users and Primal Groudon for a better matchup against Magic Bounce users and Taunt users. Similarly, Perish Song is an alternative to Whirlwind that has a slightly worse matchup versus Wonder Guard Subsitute + Baton Pass users, but isn't reflected by the aforementioned Magic Bounce. Magic Coat is another option to reflect entry hazards, sleep moves from Mold Breaker users, and Sing, Gastro Acid, Taunt, and Spider Web from No Guard users. Finally, Steam Eruption can also be used over a utility move to OHKO standard Primal Groudon sets and to 2HKO Mega Diancie, although it hits very few targets otherwise and has very limited PP.</p> <p>Safety Goggles improve Arceus's matchup versus Mold Breaker users that run Spore and can give Arceus a leg up versus Imposter users if Arceus itself opts to use Spore. Any of the seventeen Plates are options to give Arceus an immunity to Trick. Chesto Berry is an extremely niche option that can be used alongside the aforementioned Knock Off to make Arceus a more consistent check to Mold Breaker Mega Gengar. Lastly, Chople Berry is another very fringe option that can allow Arceus to survive a singular Drain Punch from Huge Power Mega Mewtwo X. However, note that all of these options leave Wonder Guard Arceus very vulnerable to Shadow Tag users, so consider running them alongside a pivoting move such as Baton Pass or Parting Shot to give Arceus counterplay versus trapping.</p> <p>For Mold Breaker Arceus, a Timid nature can be run to outpace Modest Mega Gengar, Adamant Mega Mewtwo X, and Mega Rayquaza running a positive Speed nature, letting Arceus heavily damage or KO them with Judgment. On sets that opt for King's Shield, an EV spread of 240 HP / 252 SpA / 16 Spe can be used to maximize bulk while still outspeeding Adamant Primal Groudon before Shell Smash, as outpacing threats such as Choice Band Mega Rayquaza before setup is less of a concern. Alternatively, a spread of 132 HP / 252 SpA / 124 Spe can be used for additional bulk and outpacing Jolly Primal Groudon and other positive nature base 90 Speed Pokemon.</p> <p>Mold Breaker Arceus can opt to use a third coverage move in the last moveslot—such as Secret Sword, Earth Power, or Steam Eruption—but doing so makes Arceus more reliant on its teammates to set up safely and can make Imposter-proofing more difficult. Recover is another option, especially on teams with Pursuit + Huge Power teammates, that capitalizes on Arceus’s good bulk and ability to overwhelm teams once opposing Giratina are removed. Stealth Rock takes advantage of Boomburst's ability to force switches. Items such as Safety Goggles, Leftovers, Lum Berry, and Mental Herb are options—alongside a coverage move over Judgment—that can ease setup on teams with Huge Power + Pursuit users, but they are almost never worth sacrificing the immunity to Trick and the additional power that Spooky Plate or Dread Plate and Judgment provide.</p> <p>It's also worth noting that on teams with three or more Arceus—often refered to as spam teams—fringe Arceus sets such as Prankster, No Guard, Choice Band Huge Power, Huge Power Fake Out + Extreme Speed, Fist Plate Wonder Guard Shell Smash, Spooky Plate Multitype, and Magic Bounce have significantly increased viability.</p> <h1>Checks and Counters</h1> <p><strong>Powerful Fighting Coverage: Powerful Fighting-type attacks from Huge Power and Protean users will force Wonder Guard Arceus out. In particular, Huge Power Mega Mewtwo X can OHKO Arceus with any of its STAB attacks, even OHKOing Chople Berry Arceus with Low Kick or Close Combat.</p> <p><strong>Prankster Giratina</strong>: Like most defensive Wonder Guard users, Prankster Giratina can come in on virtually every variation of Wonder Guard support Arceus and force it out with Encore or chip it with Will-O-Wisp or Curse. And while Prankster Giratina doesn't want to come in on a powerful Ghost- or Dark-type Judgment, its presence, particularly alongside a Normal- or Dark-type teammate, prevents Mold Breaker variants of Arceus from freely using Boomburst or Shell Smash. However, Giratina can be overwhelmed if Mold Breaker Arceus puts it to sleep or uses Taunt as it switches in, which gives it chances to set up with Shell Smash.</p> <p><strong>Trick</strong>: Unless it's holding a Plate, Trick users can hinder Wonder Guard Arceus for the entirety of the match. Since most Arceus sets forgo a pivoting move, it’s even more of a momentum sink with a Choice item than other support Wonder Guard users. In addition, loss of its Shed Shell leaves Arceus especially vulnerable to being removed by Shadow Tag users.</p> <p><strong>Taunt</strong>: Taunt shuts Wonder Guard Arceus down completely unless it chooses to run non-status utility options such as Knock Off, Nuzzle, and Steam Eruption.</p> <p><strong>Choice Item Mold Breaker Users</strong>: Powerful Mold Breaker users like Choice Band Primal Groudon, Choice Band Mega Rayquaza, and Choice Specs Mega Mewtwo Y can all force Arceus out; Primal Groudon's V-create OHKOes after Stealth Rock, Mega Rayquaza can wear Arceus down and waste its Recover PP with repeated usage of Dragon Ascent, and Mega Mewtwo Y's Psycho Boost OHKOes after Stealth Rock.</p> <p><strong>Revenge Killers</strong>: Unless Mold Breaker Arceus is carrying King's Shield, -ate Speed users such as Pixilate Mega Diancie and Aerilate Mega Rayquaza can force it out. In particular, 252 HP EV Mega Diancie can survive a +2 Boomburst and +2 Ghost-type Judgment, and it is even less threatened by Dread Plate variants. On the other hand, Huge Power Mega Gyarados, another very popular revenge killer, needs all five hits of Water Shuriken to connect in order to revenge kill -1 Defense Arceus—though Arceus still needs to be wary of Sucker Punch variants.</p> <p><strong>Faster Powerful Attackers: Powerful attackers that outpace Arceus, such as Mega Mewtwo Y and Mega Mewtwo X, can threaten to OHKO Mold Breaker Arceus and force it out. In addition, Mold Breaker Arceus is also vulnerable to OHKO moves from faster No Guard users like Mega Mewtwo Y and Mega Manectric.</p> <p><strong>Offensive Shadow Tag Users: Fast and powerful Shadow Tag users, such as Mega Mewtwo X and Choice Scarf Primal Groudon, can trap and KO Mold Breaker Arceus, especially if Arceus is chipped or running few defensive EVs.</p> <p><strong>Special Walls</strong>: Mold Breaker Arceus has trouble breaking through specially defensive titans such as Blissey and RegenVest users like Yveltal and Primal Kyogre. While rare and vulnerable to Spore or Dark Void, RegenVest users can annoy Arceus by phazing it with Circle Throw, using Nuzzle, or pivoting out to a revenge killer or Prankster user; Wonder Guard Blissey can disrupt Arceus with Glare or Whirlwind.</p> ",
    "sets": [
      {
        "name": "Wonder Guard Support",
        "description": "<p>A unique combination of excellent bulk, high Speed, and only one weakness makes Arceus a strong choice for a support Wonder Guard user. Like all support Wonder Guard users, Arceus has some flexibility with the utility moves it can run. Stealth Rock gives Arceus a way to make progress in nearly every game, especially since Wonder Guard users inherently force switches against many non-Mold Breaker foes. Gastro Acid is another option that takes advantage of Arceus's good Speed tier to wall slower Mold Breaker foes such as Adamant Primal Groudon and Mega Tyranitar, as well as halving the power of any Huge Power users Arceus finds itself facing. It can also pressure opposing Wonder Guard users, especially those using Baton Pass, as Gastro Acid's ability suppression is passed as well. Defog and Aromatherapy are extremely valuable utility moves on nearly every team composition. However, if either one is already being provided by a teammate, then King's Shield can be used as a scouting tool versus foes like Mega Mewtwo X and to improve Arceus's matchup versus Choice Band Mold Breaker users like Primal Groudon and Mega Rayquaza. In addition, King's Shield makes Wish a more reliable recovery option for Arceus. On sets lacking King's Shield, however, Recover is usually preferred for its immediacy and reliability. Shed Shell is the preferred item so that Arceus can escape being trapped by Shadow Tag users. A physically defensive EV spread effectively scouts physical Mold Breaker users such as Choice Band Primal Groudon and Mega Rayquaza; 16 Speed EVs allow Arceus to outpace Adamant Primal Groudon and neutralize it with Gastro Acid.</p> <p>Many team structures appreciate the utility Arceus can provide. However, since Arceus doesn't provide pivoting support effectively, Wonder Guard users that can do so, such as Substitute + Baton Pass Xerneas, form effective Wonder Guard cores with Arceus. In addition, Arceus itself appreciates Xerneas's Substitutes giving it additional turns to utilize its utility moves or to force out opposing Mold Breaker users with Gastro Acid. In return, Arceus can scout Mold Breaker Mega Gengar and neutralize Mold Breaker Primal Groudon with Gastro Acid, two of Wonder Guard Xerneas's most common switch-ins. Thanks to its singular weakness to Fighting, Wonder Guard Arceus also makes an excellent teammate for Huge Power, Protean, and Parental Bond teammates such as Mega Mewtwo X, Mega Mewtwo Y, and Mega Latios lacking Fighting attacks, as it can serve as a swtich-in to Imposter users. Finally, because of Arceus's own vulnerability to Fighting-type attackers like Huge Power Mega Mewtwo X, teammates that match up well against it, such as Aerilate Mega Rayquaza, Pixilate Mega Diancie, Wonder Guard Xerneas and Mega Gardevoir, and Prankster Will-O-Wisp Giratina, are appreciated.</p> "
      },
      {
        "name": "Mold Breaker + Shell Smash",
        "description": "<p>With its powerful STAB Boomburst, immunity to Trick and Knock Off, straightforward Imposter-proofing, excellent bulk, and good Speed tier, Mold Breaker Arceus is an excellent option for a Shell Smash sweeper. Boomburst's STAB-augmented 140 Base Power allows Arceus to OHKO and 2HKO large swathes of the metagame at +2—the only exceptions being Ghost-types and extremely specially bulky Pokemon, such as Wonder Guard Blissey and the rare Assault Vest Primal Kyogre. Either Spooky Plate or Dread Plate give Judgment near-perfect coverage alongside Boomburst and, due to an Arceus-specific mechanic, also grants Arceus an immunity to Trick and Knock Off. Both also make it easy to Imposter-proof, as a Ghost-type teammate can cover any Imposter user that lacks a Plate item. Spooky Plate gives Arceus better overall coverage, as the only relevant threat that resists both Ghost and Normal is Mega Tyranitar, while Dread Plate eases prediction against teams that have both Prankster Giratina and a Normal- or Dark-type, such as Wonder Guard Slaking or Mega Audino. Arceus's final moveslot is devoted to disruption, aiding it either in setting up a Shell Smash or in continuing a sweep. Dark Void and Spore create setup opportunities by inflicting sleep; Spore has perfect accuracy and makes Imposter-proofing even easier with a Safety Goggles teammate, though it's worse against opposing Safety Goggles users, Mega Abomasnow, and the rare Wonder Guard Ludicolo. Taunt aids Arceus primarily versus Prankster Giratina and Wonder Guard Blissey, which otherwise come in on Arceus without too much difficulty and force it out with Encore and Whirlwind, respectively. Finally, King's Shield can halt -ate Speed users like Mega Rayquaza and Mega Diancie attempting to stop Arceus’s sweep. 216 Speed EVs are used to outpace neutral-natured Mega Rayquaza.</p> <p>Mold Breaker Arceus fits best on balance and offense teams that can give it opportunities to set up. In particular, Substitute + Baton Pass Wonder Guard Xerneas and Mega Gardevoir are excellent teammates, as they both give Arceus free turns with Substitute and threaten Prankster Giratina for it with their powerful Moonblasts. Similarly, No Guard-using teammates, such as Mega Mewtwo Y and Mega Lopunny, generate free turns for Arceus by forcing in Wonder Guard users with their OHKO moves. Huge Power Dark-types, such as Mega Gyarados and Mega Tyranitar, also make strong teammates for Pursuit trapping the metagame's premier Ghost-type, Giratina, allowing Arceus to use Boomburst more freely. Mold Breaker Arceus also appreciates having at least one Ghost-type teammate, such as Giratina, Wonder Guard Mega Sableye, Wonder Guard Dusclops, or Mega Gengar, to efficiently Imposter-proof it. Secret Sword Mega Gengar is a particularly noteworthy partner on offense teams for providing good role compression; it can be a second Mold Breaker sweeper, Imposter-proof both itself and Arceus, and threaten common switch-ins to Arceus like Prankster Giratina and Wonder Guard Blissey. Level 2 Wonder Guard Mega Sableye both provides an extremely slow pivot with Baton Pass and efficiently Imposter-proofs Dark Void variants of Arceus thanks to its Flame Orb—which many methods to Imposter-proof Spore Arceus, like Safety Goggles, can't do.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 226455, "username": "berry"}, {"user_id": 515077, "username": "Mbouchon"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}, {"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 562267, "username": "Daylight"}]}
  },
  "Gardevoir": {
    "comments": "<h1>Other Options</h1> <p>An alternate EV Spread of 80 Def / 252 SpA / 176 Spe with a Timid nature can be used to outspeed Jolly Primal Groudon and other maximum Speed base 90 Pokemon before Mega Gardevoir uses Shell Smash, in addition to giving it the ability to survive Choice Band Adamant Mold Breaker Primal Groudon’s Extreme Speed before Mega Gardevoir uses Shell Smash and non-Choice Band Extreme Speed after a Shell Smash. This spread, however, is generally only worth using in tandem with either Water coverage like Scald or Steam Eruption or on niche Choice Specs Mold Breaker sets with Psycho Boost that can OHKO Primal Groudon without requiring a boost first. Thanks to Mega Gardevoir’s physical frailty, further defensive investment is generally inadvisable.</p> <p>Mega Gardevoir has a wide range of other viable coverage options; Bug Buzz hits Psychic-type Wonder Guard users, Aura Sphere hits Normal-type Wonder Guard users not named Blissey harder than Secret Sword, Scald OHKOes Primal Groudon, and Giga Drain hits Water-type Wonder Guard users while also providing recovery. Gastro Acid is also an option over a coverage move to allow Mega Gardevoir to break through Wonder Guard users of any type at the somewhat steep cost of an additional turn to do so. In addition, while Stealth Rock is hard to fit, Mega Gardevoir’s ability to threaten out the format’s most popular Magic Bouncers—Giratina and Yveltal—make it a reliable entry hazard setter.</p> <p>Mega Gardevoir is also a very competent user of Substitute + Baton Pass Wonder Guard sets, but faces fierce competition from the much bulkier Xerneas for this role. However, it is worth noting that Mega Gardevoir specifically utilizes Glare and Shell Smash variants of these sets just as efficiently, if not better, than Xerneas can in many scenarios. Mold Breaker sets with either Choice Specs or Shell Smash are also a niche option. However, the former faces steep competition with Choice Specs Mega Mewtwo Y and even the rare Choice Specs Mega Diancie and the latter is only useful over similar Mega Diancie sets if STAB Stored Power or Psystrike is greatly desired.</p> <h1>Checks and Counters</h1> <p><strong>Strong Physical Attackers: Mega Gardevoir’s physical frailty means it cannot switch into or stomach any reasonably strong physical hits bar Fighting type attacks. A Choice Band or Huge Power boosted hit that makes it through Mega Gardevoir’s Wonder Guard will almost always KO. In addition, super effective priority moves such as Shadow Sneak and Bullet Punch—most frequently seen on Shadow Tag and Huge Power Regigigas and Slaking sets—bypass Gardevoir’s Wonder Guard and KO it outright.</p> <p><strong>Mega Gengar: Mold Breaker Mega Gengar puts a lot of pressure on Mega Gardevoir, outspeeding and OHKOing it with Spooky Plate Judgment or Sludge Wave. However, Mega Gengar cannot switch into Mega Gardevoir effectively, especially if Gardevoir is carrying Spooky Plate or is already boosted.</p> <p><strong>Opposing Wonder Guard</strong>: Because Wonder Guard sweepers are inherently matchup dependent, Wonder Guard users that Mega Gardevoir is not packing the correct coverage move for will force it out.</p> <p><strong>Item Removal</strong>: Trick, Switcheroo, and Mold Breaker Knock Off can severely impede Mega Gardevoir’s ability to do its job, removing one third of its coverage as well as its ability to beat Imposter users.</p> <p><strong>Plate Imposter Users</strong>: While rare and very suboptimal outside of a matchup into offensive Wonder Guard Mega Gardevoir or Xerneas (or Mold Breaker Mega Gengar, in the case of Spooky Plate), Imposter Pokemon holding an Iron Plate or Spooky Plate directly counter this set and can be difficult to deal with.</p> ",
    "sets": [
      {
        "name": "Wonder Guard Shell Smash",
        "description": "<p>Mega Gardevoir’s excellent Psychic / Fairy typing and high base 165 Special Attack make it one of the best options for a Wonder Guard Shell Smash sweeper. Judgment and either Iron Plate or Spooky Plate allow this set to beat Imposter users, as well as Fairy-type or Psychic-type Wonder Guard users, respectively. Thanks to the evergreen popularity of Wonder Guard Xerneas, Iron Plate is usually preferred, but Spooky Plate does have additional utility outside of hitting Psychic-type Wonder Guard users—notably +2 Spooky Plate Judgment OHKOes Mega Mewtwo X, Mega Mewtwo Y, and Mega Latios, as well as standard Primal Groudon after Stealth Rock. The remaining moveslots are dedicated to coverage for breaking as many Wonder Guard cores and Mold Breaker switch-ins as possible and are, as a result, quite flexible and very team-dependent. Grass Knot and Freeze-Dry are powerful coverage options that, most notably, allow this set to beat the ever popular Wonder Guard Primal Kyogre. On Iron Plate sets, Grass Knot is usually preferred for the OHKO on Primal Groudon after Stealth Rock at +2. Freeze-Dry nails a broader range of threats, however, including OHKOing Wonder Guard Gyaradosite Gyarados and Mega Rayquaza. Moonblast is a powerful STAB move that is often Mega Gardevoir’s best option against non-Wonder Guard switch-ins and also OHKOes the somewhat common Wonder Guard Mega Sableye. It also OHKOes standard Giratina sets even at just +1. Secret Sword and Lava Plume smack Normal and Bug / Steel type Wonder Guards, respectively, while Earth Power is notable for hitting both Electric Wonder Guard users and netting a guaranteed KO against Primal Groudon at +2. Mix and match these (or other) coverage options according to your team’s needs and current metagame trends. A Modest nature is preferred to secure several key KOs such as Mega Mewtwo X and Mega Rayquaza, but a Timid nature is an option if outpacing Timid Xerneas is desired.</p> <p>Wonder Guard Shell Smash Mega Gardevoir fits well on both balance and offensive teams as a powerful wincon. Physical Mold Breakers, though valuable on nearly every team structure in ORAS Pure Hackmons, are especially important teammates for Mega Gardevoir, breaking through the Wonder Guard users Mega Gardevoir’s chosen coverage moves may not pierce. Choice Band Primal Groudon is especially noteworthy for its excellent offensive synergy with Mega Gardevoir, as well as its ability to obliterate opposing Wonder Guard users with its STAB V-create. Fast and powerful Mold Breaker users such as Mega Mewtwo Y and especially Mega Gengar can make it very difficult for Gardevoir to get a Shell Smash up, so teammates such as Yveltal, Mega Gyarados, Wonder Guard Meloetta, Arceus carrying Knock Off, and various -ate Speed users like Mega Rayquaza and Mega Abomasnow are appreciated. Many of these Pokemon are also good entry hazard setters, and Mega Gardevoir appreciates Stealth Rock support to turn many of its already favorable rolls, such as +2 Spooky Plate Judgment or Grass Knot into 240 HP Primal Groudon, into guaranteed KOs. Aromatherapy support from support Wonder Guard partners with complementary typing such as Primal Kyogre, Meloetta, Slaking, and Mega Scizor, among others, is also appreciated to prevent Toxic or Will-O-Wisp from putting a timer on Mega Gardevoir’s sweep. Defog and Wish support from these teammates can also offset any chip Mega Gardevoir might take throughout a game, making its job as a late-game cleaner and wincon more flexible.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 515077, "username": "Mbouchon"}, {"user_id": 226455, "username": "berry"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 562267, "username": "Daylight"}]}
  },
  "Beedrill": {"sets": [{"name": "Support WG"}]},
  "Chansey": {
    "comments": "<h1>Other Options</h1> <p>Blissey is an option over Chansey for sets that forgo Eviolite, but revealing that your Imposter user is running an item other than Eviolite, like Choice Scarf, generally is not worth the slight increase in HP. Shed Shell allows Chansey to escape traps that utilize Shadow Tag or trapping moves like Thousand Waves. In order to have a greater chance of beating an Imposter-proofed sweeper, which usually rely on Judgement, Chansey can run a Plate. Iron Plate allows it to beat Wonder Guard Xerneas, Spooky Plate counters Mold Breaker Mega Gengar, and Pixie Plate provides Fairy Judgment against Mold Breaker Mega Diancie.</p> <h1>Checks and Counters</h1> <p><strong>Imposter-proofed Sweepers: Some sweepers, like Mega Gengar, Mega Diancie, Arceus, and Dialga, may run sets that can't be effectively copied by Chansey, allowing for safe setup. Judgement is a common Imposter-proofing move, as it requires a Plate to change type, and can be used to prevent Chansey from checking the sweeper. Additionally, sweepers behind a Substitute, typically through Substitute + Baton Pass support, prevents Imposter from activating and are problematic if Chansey is the only revenge killer on its team.</p> <p><strong>Imposter-proofed Utility: Some utility Pokemon aim to trap and eliminate Chansey with Shadow Tag, such as Mega Mewtwo Y and Mega Mewtwo X. However, Choice Scarf Chansey that has already copied a boosted Shell Smash sweeper will usually outspeed said Shadow Tag users, making counterplay through trapping shaky at best.</p> ",
    "sets": [
      {
        "name": "Imposter",
        "description": "<p>Imposter Chansey is one of the most effective utility Pokemon due to its ability to scout the opponent's sets in a metagame where every move is a possibility. Instantly copying the opponent's typing, stats, boosts, and movepool while retaining its massive 250 base HP and the defensive boost from Eviolite forces the opponent to face a much bulkier version of the set they built themselves. Scouting is Chansey's main utility, as this can help the player identify weaknesses in the opponent's team and potentially use their own strategy against them. Eviolite is generally the preferred item to give Chansey truly titanic bulk and retain the ability to switch moves, but Choice Scarf is another option to avoid Speed ties; this is especially important against offensive sweepers with Shell Smash, Spore, or Dark Void, as Chansey may not be able to recover from losing the Speed tie. Chansey's own moveset comes into play when it is switched in on a Pokemon behind a Substitute, with Illusion active, or that is an already-transformed Imposter user. Whirlwind forces the opposing Pokemon out, potentially disrupting a Substitute + Baton Pass user's support. Lunar Dance is a great option to retain momentum when Chansey is weakened, as Chansey excels on offensive teams that don't mind sacrificing Chansey to heal a severely damaged offensive teammate. Parting Shot allows Chansey to retain momentum while also weakening offensive opponents switching into Chansey. Spikes allows Chansey to set entry hazards when Chansey has a free turn; it also synergizes well with teammates running Stealth Rock. Wish takes advantage of Chansey's titanic HP to nearly fully heal teammates; alternatively, Recover is a strong option on Eviolite sets for more reliable recovery, as Chansey is prone to getting worn down by boosted threats.</p> <p>Due to its amazing utility in checking opposing sweepers, Imposter Chansey fits on nearly every team, though it excels on offense in particular. However, it requires some support to effectively scout and make progress. First, in order to switch in without risking being trapped and eliminated, Chansey requires teammates that can bring it in with a slow pivoting move such as Baton Pass Wonder Guard Mega Audino, Blissey, and Escavalier. Additionally, because Chansey's main utility activates on switch, Defog support from a teammate allows it to more easily come in and out without getting worn down by entry hazards; as such, Wonder Guard users that often carry Defog like Arceus and Primal Kyogre are good partners for Chansey. Chansey also requires a teammate that can switch into Knock Off, as it is heavily reliant on its item. Wonder Guard Pokemon that are not weak to Dark and work well on offensive teams, like Xerneas and Wonder Guard Gyarados, can easily switch into Knock Off for Chansey. Finally, -ate Speed users like Pixilate Mega Diancie and Refrigerate Kyurem-B excel at defeating sweepers that Imposter-proof themselves against Chansey like Mold Breaker Mega Gengar.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 506113, "username": "BahamutLagoon"}, {"user_id": 515077, "username": "Mbouchon"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 226455, "username": "berry"}]}
  },
  "Gyarados": {"sets": [{"name": "Pursuit Trapper"}, {"name": "Gyaradosite Sweeper"}]},
  "Mewtwo": {
    "comments": "<h1>Other Options</h1> <p>Leftovers is an option on No Guard sets to offset the chip damage Mega Mewtwo Y tends to accumulate throughout a game, but Mega Mewtwo’s frailty means it usually doesn't make a difference. Shed Shell is an option to escape Shadow Tag revenge killers such as Regigigas and Slaking, but it has minimal utility otherwise.</p> <p>Spider Web is an option on the Focus Sash + No Guard set to trap and KO Wonder Guard users lacking Shed Shell in tandem with Gastro Acid and Sing. However, such sets require good prediction to use effectively and perform inconsistently against opponents who play carefully. Spikes, Toxic Spikes, and Sticky Web are alternate entry hazard options over Stealth Rock, each with their own advantages. Taunt is an option over Gastro Acid that bypasses Substitute and can also force out defensive and Substitute + Baton Pass Wonder Guard users. However, Gastro Acid functions more effectively in the majority of circumstances. King's Shield is an option to force out -ate Speed users attempting to revenge kill Mega Mewtwo Y. No Guard Mega Mewtwo Y can also make use of a wide array of coverage options in addition to the ones listed above—such as Seed Flare, Moonblast, Dynamic Punch, Bug Buzz, Night Daze, and Steam Eruption. Note, however, that these options have narrow applications and should be chosen based on specific teambuilding needs.</p> <h1>Checks and Counters</h1> <p><strong>Revenge Killers: Revenge killers like -ate Speed users and Huge Power Mega Gyarados force out all variants of No Guard Mega Mewtwo Y except for those using the rare King's Shield. Shadow Tag revenge killers such as Slaking and Regigigas are especially dangerous, as they always KO all but the very niche Shed Shell and King's Shield variants of Mega Mewtwo Y. Additionally, Choice Scarf No Guard Mega Mewtwo has to be particularly wary of locking itself into an unfavorable move versus teams with Huge Power Pursuit users like Mega Gyarados.</p> <p><strong>Wonder Guard Users: Although Trick, Sing, Gastro Acid, and coverage moves can all help offset No Guard Mega Mewtwo Y's inability to beat most Wonder Guard users, it still requires team support to break most well-played Wonder Guard cores. Notably, Wonder Guard users immune to Trick—such as Mail Cresselia and Blue Orb Kyogre—can be particularly difficult for Choice Scarf No Guard variants of Mega Mewtwo Y. Additionally, Magic Coat + Wonder Guard users can reflect Sing and Gastro Acid, draining the momentum Mega Mewtwo Y is usually so effective at maintaining.</p> ",
    "sets": [
      {"name": "Huge Power (Mewtwo-Mega-X)"},
      {"name": "Shadow Tag (Mewtwo-Mega-X)"},
      {"name": "Shell Smash Sweeper (Mewtwo-Mega-X)"},
      {"name": "Protean (Mewtwo-Mega-Y)"},
      {"name": "Huge Power (Mewtwo-Mega-Y)"},
      {"name": "Choice Specs (Mewtwo-Mega-Y)"},
      {
        "name": "Choice Scarf No Guard (Mewtwo-Mega-Y)",
        "description": "<p>Mega Mewtwo Y is one of the most effective users of No Guard OHKO moves thanks to its high Speed, high Special Attack, and ability to catch opponents off-guard thanks to its wide array of other viable sets. Choice Scarf allows Mega Mewtwo Y to outspeed every unboosted threat as well as some boosted ones, such as +2 maximum Speed Primal Groudon. Sheer Cold is the preferred OHKO move, as no Pokemon is immune to it without Wonder Guard or Sturdy. Fissure is an alternative that misses out on Mega Rayquaza, Yveltal, and Ho-Oh but hits the somewhat uncommon, though still relevant, group of Wonder Guard users weak to Ground—namely Primal Groudon, Mega Lucario, and Mega Manectric. Trick allows Mega Mewtwo Y to both hinder a Wonder Guard switch-in and have the flexibility of switching moves for the remainder of the game. Choice Scarf No Guard Mega Mewtwo Y's remaining two moveslots are extremely flexible, and almost any combination of the listed moves is viable. Sing, Gastro Acid, and Stealth Rock take advantage of Mega Mewtwo Y's ability to force in Wonder Guard users with Sheer Cold or Fissure, either hindering them with sleep, forcing them to switch out again, or taking advantage of the forced switch by setting Stealth Rock. Sing and Gastro Acid together allow Mega Mewtwo Y to spread sleep and generate an abundance of free turns for its teammates. Gastro Acid also pairs nicely with Stealth Rock, allowing Mega Mewtwo Y to continually force chip damage against Wonder Guard foes. Alternatively, thanks to Mega Mewtwo Y's extremely high Special Attack stat, it can effectively run coverage moves to damage or outright KO common Wonder Guard switch-ins. Zap Cannon and Inferno hit Water- and Bug / Steel type Wonder Guard users, respectively, in addition to being broadly useful against a wide-array of non-Wonder Guard threats thanks to their respective 100% chances to paralyze and burn. Additionally, Zap Cannon 2HKOes Mold Breaker Mega Rayquaza, non-Assault Vest Yveltal, and Ho-Oh after minimal chip—making it particularly useful on Fissure variants of Mega Mewtwo Y. Freeze-Dry hits Water-type Wonder Guard users, Giratina, and OHKOes the most relevant Flying-type, Mega Rayquaza, making it another useful option on Fissure variants of Mega Mewtwo Y. Sludge Wave hits common Fairy-type Wonder Guard users like Xerneas, Mega Audino, and Mega Gardevoir, while Focus Blast threatens Normal-type Wonder Guard users not named Blissey or Chansey. The leftover 4 EVs should be placed in Defense to allow Mega Mewtwo Y to always survive Mega Diancie's Pursuit. Note that if Mega Mewtwo Y opts to forgo coverage attacks completely, an EV spread of 248 HP / 8 Def / 252 Spe and a Timid nature should be used.</p> <p>Most teams benefit from the revenge killing potential Choice Scarf No Guard Mega Mewtwo Y provides, in addition to forcing in passive Wonder Guard users that teammates can take advantage of. Due to Mega Mewtwo Y's frailty, slow Wonder Guard pivots, such as Xerneas and Mega Scizor, make good teammates. In particular, Substitute + Baton Pass teammates like Wonder Guard Xerneas can grant Mega Mewtwo Y security against revenge killers and Imposter users. In return, Mega Mewtwo Y provides them with free turns to create and pass Substitutes to other teammates as well. Powerful offensive Pokemon such as Choice Band Mold Breaker Primal Groudon and Mega Rayquaza appreciate No Guard Mega Mewtwo Y's ability to force in Wonder Guard users. Additionally, both Wonder Guard and Mold Breaker setup sweepers appreciate the free turns Mega Mewtwo Y generates, as well as its ability to threaten Prankster Giratina; however, Giratina can force a trade with Destiny Bond. Trick-immune Wonder Guard teammates such as Blue Orb Primal Kyogre, Plate Arceus, and Mail Cresselia are valuable teammates to Imposter-proof No Guard + Trick Mega Mewtwo Y. Shadow Tag teammates such as Mega Mewtwo X and Perish Song Lugia appreciate Mega Mewtwo Y's ability to force in Wonder Guard users and remove their Shed Shell with Trick. Wonder Guard users with Stealth Rock, Defog, and Aromatherapy are also notable teammates for Gastro Acid variants of Mega Mewtwo Y, as they help it continually force switches—and entry hazard chip damage—versus opposing Wonder Guard and Mold Breaker users alike, while also allowing Mega Mewtwo Y to switch freely without fear of entry hazard chip damage itself. Finally, -ate Speed users make excellent teammates for Choice Scarf No Guard Mega Mewtwo Y, as they can revenge kill nearly every boosted threat that Mega Mewtwo Y itself doesn’t outpace and revenge kill.</p> "
      },
      {
        "name": "No Guard Wallbreaker (Mewtwo-Mega-Y)",
        "description": "<p>With a Focus Sash or Lum Berry equipped, No Guard Mega Mewtwo Y is a potent and flexible wallbreaker. Focus Sash provides security against Imposter users, Pursuit trappers, and opposing No Guard users and allows it to safely enter the battlefield at least once without Substitute + Baton Pass or slow pivoting support. Alternatively, Lum Berry can improve Mega Mewtwo Y's ability to switch into status spreaders, such as Glare Giratina and Spore or Dark Void Mold Breaker users. Sing allows Mega Mewtwo Y to generate free turns against basically every possible switch-in. Gastro Acid forces out the Wonder Guard users that switch in and, on Fissure variants, allows Mega Mewtwo Y to more effectively force mind games against teams using one or more Ground-weak Wonder Guard users. Stealth Rock gives Mega Mewtwo Y an efficient way to make progress in nearly every game and synergizes exceptionally well with its inherent ability to force switches. Zap Cannon and Inferno are great coverage options that hit Water- and Bug / Steel type Wonder Guard users, respectively, and are also useful against a broad range of non-Wonder Guard switch-ins thanks to their secondary effects. Freeze-Dry is another option to hit Water-type Wonder Guard users and also OHKOes the most prominent Flying-type in the format, Mega Rayquaza, making it particularly useful on Fissure variants. Sludge Wave hits Fairy-type Wonder Guard users; Focus Blast hits Normal-type Wonder Guard users. The choice between these options is flexible and many variations on the options presented in Mega Mewtwo Y’s latter three moveslots are viable and should be chosen based on individual team-building needs. Note that if Mega Mewtwo Y is not running any coverage attacks, an EV spread of 248 HP / 8 Def / 252 Spe and a Timid nature should be used.</p> <p>Most teams benefit from the free turns No Guard Mega Mewtwo Y generates. In particular, powerful Mold Breaker users like Choice Band Primal Groudon and Mega Rayquaza appreciate Mega Mewtwo Y's ability to force in Wonder Guard users. Substitute + Baton Pass users, like Wonder Guard Xerneas, also make excellent teammates, as they're able to utilize the free turns Mega Mewtwo Y generates to pass Substitutes. Offensive Shell Smash Wonder Guard users such as Mega Gardevoir and Mega Lucario also appreciate the opportunities to set up that Mega Mewtwo Y can create. Additionally, they're also very resistant to the revenge killers, like -ate Speed users and Huge Power Mega Gyarados, that force Mega Mewtwo Y out. They can also efficiently Imposter-proof Mega Mewtwo Y on offensive teams that require the role compression. Focus Sash + No Guard Mega Mewtwo Y also appreciates paralysis support from teammates such as Glare + Prankster Giratina, Glare + Wonder Guard Xerneas, and Glare Support Wonder Guard users, to outpace and OHKO as many foes as possible. Shadow Tag users make excellent teammates for Mega Mewtwo Y, as they can trap and remove Wonder Guard users that frequently forgo Shed Shell—such as Xerneas and Mega Lucario—making it much easier for Mega Mewtwo Y to clean teams with Sheer Cold or Fissure. Defensive Wonder Guard users are valuable teammates, as they can clear the field of entry hazards, cure Mega Mewtwo Y of status, and provide it with slow pivoting and Imposter-proofing support. Defog support, as well as Magic Bounce support from Pokemon like Giratina, is particularly critical for Focus Sash variants of Mega Mewtwo to preserve the utility of its item. Finally, Fake Out + Extreme Speed users such as Aerilate Mega Rayquaza and Huge Power Regigigas can form a potent revenge killing core alongside Mega Mewtwo Y.</p> "
      },
      {"name": "Offensive WG (Mewtwo-Mega-Y)"},
      {"name": "SubPass WG (Mewtwo-Mega-Y)"},
      {"name": "Support WG (Mewtwo-Mega-Y)"},
      {"name": "Shadow Tag (Mewtwo-Mega-Y)"}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 515077, "username": "Mbouchon"}, {"user_id": 226455, "username": "berry"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 562267, "username": "Daylight"}]}
  },
  "Scizor": {"sets": [{"name": "Support WG"}]},
  "Blissey": {
    "comments": "<h1>Other Options</h1> <p>Thanks to its titanic HP stat, Blissey is a powerful Imposter user; however, Chansey's ability to bluff Eviolite nearly always make it superior. It's worth noting, though, that Blissey's viability as an Imposter user does force opponents to play with that possibility in mind if they see Blissey in team preview, regardless of whether it is an Imposter set or not. An alternate EV spread of 4 HP / 252 Def / 252 SpD with either a Bold or a Calm nature gives Blissey better mixed bulk and is a decent option on King's Shield sets. Additionally, physically defensive EV spreads improve Blissey's matchup versus the rare Mold Breaker Pursuit. Transform is a niche scouting tool that, like Imposter, takes advantage of Blissey's very high HP. Glare, Nuzzle, Will-O-Wisp, Chatter, Perish Song, and Magic Coat are all alternative viable utility options. However, Blissey usually prefers Knock Off or Whirlwind to help it check and Imposter-proof special Mold Breaker users. Foul Play is an option that OHKOes Mega Gengar and Mega Latios after a Shell Smash and 2HKOes Mega Diancie and Mega Sceptile after a Shell Smash and Knock Off. However, its utility is limited outside of those targets, as Blissey can seldom take a hit from a boosted physical attacker. Trick is an option that allows Blissey to disrupt opposing Wonder Guard users, as well as Imposter-proof Trick + Choice Specs Mold Breaker teammates without the use of Mail. Parting Shot is an alternative to Baton Pass that inflicts a useful debuff while pivoting, but also cedes momentum to Magic Bounce users. Sticky Web, Spikes, and Toxic Spikes are alternatives to Stealth Rock if their individual advantages are desired. Finally, Blissey's extremely high HP makes it one of the most viable users of niche options Metal Burst, Mirror Coat, and Counter.</p> <p>Safety Goggles is an option to improve Blissey’s ability to check Spore Mold Breaker users. Mail is an option make Blissey immune to Trick, which can be useful for Imposter-proofing Choice Specs + Trick Mold Breaker teammates. Leftovers is an option that allows Blissey to use Recover less frequently versus special Mold Breaker users, potentially maintaining momentum. However, all of these options come at the cost of increased vulnerability to Shadow Tag users—which is one of the main advantages that Blissey has over Wonder Guard Eviolite Chansey.</p> <h1>Checks and Counters</h1> <p><strong>Powerful Physical Mold Breaker Users: Blissey’s physical fragility means even unboosted physical Mold Breaker users force it out. Additionally, Special Mold Breaker users carrying either Secret Sword or Psystrike similarly force Blissey out.</p> <p><strong>Powerful Fighting-type Coverage</strong>: Similar to moves from Mold Breaker users, Fighting coverage pierces Blissey’s Wonder Guard. And since Secret Sword hits Blissey’s weaker Defense stat, essentially every Huge Power, Protean, Parental Bond, and Wonder Guard + Shell Smash user carrying Fighting coverage will force Blissey out. A healthy Blissey can withstand hits from uncommon Aura Sphere foes, however.</p> <p><strong>Trick</strong>: Trick users can hinder all but rare Mail variants of Blissey for the entirety of the game, either with Black Sludge forcing it to Recover more frequently or Choice Scarf forcing it to relinquish momentum. Trick also removes Shed Shell, leaving Blissey vulnerable to Shadow Tag users like Mega Mewtwo X.</p> <p><strong>Prankster Giratina: Prankster Giratina dislikes losing its item to Knock Off variants of Blissey, but is otherwise unthreatened by Blissey and can force it out with Encore, Curse, or chip it with Will-O-Wisp.</p> <p><strong>Taunt</strong>: Taunt leaves most Blissey sets lacking Knock Off unable to support or maintain momentum for their team.</p> ",
    "sets": [
      {
        "name": "Wonder Guard Support",
        "description": "<p>Unparalleled special bulk, an advantageously low Speed tier, and only one weakness make Blissey a highly effective support Wonder Guard Pokemon. Nearly unique among Wonder Guard users, Blissey's incredible Special Defense allows it to both Imposter-proof a variety of powerful special Mold Breaker teammates and to check opposing special Mold Breaker foes. Baton Pass takes advantage of Blissey's low Speed, notably underspeeding other common slow pivots like Xerneas, Primal Kyogre, and Mega Scizor. King's Shield is an alternative that allows Blissey to utilize Wish more effectively and scout foes; an EV Spread of 252 HP / 252 Def / 4 SpD with a Bold nature should be used on sets with King's Shield, as otherwise Blissey is OHKOed even by many -2 physical attackers. Defog and Aromatherapy are appreciated by nearly all Pure Hackmons team structures; however, if a teammate is carrying either one, Blissey can opt for other utility moves such as Stealth Rock, Knock Off, and Whirlwind. Knock Off and Whirlwind, in particular, are useful options, as they allow Blissey to more effectively check and Imposter-proof many powerful special Mold Breaker users. Knock Off deprives Plate + Judgment users like Mega Diancie, Dialga, and Mega Gengar lacking Secret Sword of their STAB move, while Whirlwind can force out special Mold Breaker users that require multiple boosts to break through Blissey. Additionally, Knock Off can helpfully deprive non-Wonder Guard foes, as well as most Psychic- and Ghost- type Wonder Guard foes, of their Shed Shells, Safety Goggles, and other critical items. On some teams, this utility is so valuable that Blissey can forgo Baton Pass or King’s Shield to be able to make use of three utility moveslots. Finally, recovery is essential for Blissey to function effectively. Recover's immediacy and reliability is generally preferred, but Wish takes advantage of Blissey's titanic HP stat to support its teammates and synergizes well with King's Shield and Baton Pass. Shed Shell is the preferred item to improve Blissey's matchup against Shadow Tag users like Mega Mewtwo X and Perish Song Lugia. A specially defensive EV spread is preferred on sets without King's Shield to minimize damage from powerful special Mold Breaker users, as well as uncommon Aura Sphere variants of Protean users like Mega Latios and Shell Smash + Wonder Guard sweepers like Mega Gardevoir. Additionally, a specially defensive EV spread allows Blissey to survive Mega Lucario’s +2 Fist Plate Judgment after Stealth Rock and force it out with Whirlwind.</p> <p>Blissey fits best on balance and bulky offense teams that appreciate its ability to blanket check special attackers without Secret Sword and Psystrike. Additionally, powerful special Mold Break sweeprs, such as Choice Specs Mega Mewtwo Y lacking Psystrike and Choice Specs Mega Rayquaza, appreciate Blissey's ability to efficiently Imposter-proof them. Furthermore, Blissey is a particularly good teammate for special Shell Smash + Mold Breaker teammates that aren't making use of a Plate for Imposter-proofing, such as Mega Latios without Psystrike and Moonblast Mega Diancie, which are otherwise very difficult to Imposter-proof. Blissey's vulnerability to physical attackers means it appreciates teammates such as physically defensive Wonder Guard users like Mega Scizor and Cresselia, as well as Prankster Giratina. Furthermore, Blissey and Giratina have great overall synergy; Blissey can tank powerful special Fairy- and Ghost-type attacks from the likes of Mega Diancie and Mega Gengar for Giratina, while Giratina can switch into Fighting-type attacks and powerful physical Mold Breaker foes for Blissey. Notably, the combination of Wonder Guard Blissey and Prankster Giratina can make progress extremely difficult to make for teams that rely on Mold Breaker Arceus. On bulkier balance teams, Blissey can be used alongside another defensive Wonder Guard user—granting them both additional flexibility with their movesets and, in particular, allowing Blissey to more easily use utility options like Knock Off and Whirlwind. Blissey also appreciates Magic Bounce teammates for their ability reflect entry hazards, as Blissey prefers to take as little chip damage as possible to more effectively check special Mold Breaker foes. Finally, Pursuit users like Huge Power Mega Gyarados are excellent teammates for their ability to trap and threaten Giratina, one of Blissey’s most common switch-ins. Mega Gyarados, in particular, is an excellent teammate for the additional utility of being able to revenge kill Primal Groudon. Similarly, revenge killers like Refrigerate Kyurem-B and Pixilate Mega Diancie are notable teammates for their ability to force out Mega Gengar and Mega Latios, some of the most common users of Secret Sword and Psystrike, respectively.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 515077, "username": "Mbouchon"}, {"user_id": 226455, "username": "berry"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 562267, "username": "Daylight"}]}
  },
  "Tyranitar": {"sets": [{"name": "Shell Smash Sweeper"}, {"name": "Pursuit Trapper"}]},
  "Swampert": {"sets": [{"name": "SubPass WG"}, {"name": "Support WG"}]},
  "Slaking": {"sets": [{"name": "Support WG"}, {"name": "Huge Power Revenge Killer"}, {"name": "Shadow Tag Revenge Killer"}]},
  "Sableye": {"sets": [{"name": "FEAR WG"}, {"name": "Support WG"}]},
  "Manectric": {
    "comments": "<h1>Other Options</h1> <p>Thanks to its high Speed and notoriety as a Wonder Guard user, Mega Manectric can effectively make use of No Guard alongside Sheer Cold or Fissure, Zap Cannon, and some combination of Inferno, Gastro Acid, Stealth Rock, and Sing. Additionally, although it suffers from four-moveslot syndrome, a support Wonder Guard set with Defog and Aromatherapy is also a viable option for Mega Manectric. Mental Herb and Lum Berry are alternate item options that can allow Manectric to Baton Pass a Substitute versus Encore and sleep-inflicting opponents, respectively. Air Balloon is a fringe option that alleviates Mega Manectric’s weakness to Fissure. Finally, Manectite grants Mega Manectric an immunity to Trick. However, all of these item options are almost never worth giving up the utility Leftovers or Shed Shell provide.</p> <p>Glare is a useful option to hinder opposing sweepers and, unlike many Glare users, Mega Manectric can use it without fear of a Magic Bounce switch-in thanks to its Electric typing. Dark Void is another disruption option, though unlike Glare, a timely Magic Bounce switch-in can turn Mega Manectric into a sleeping momentum sink. Nuzzle is another alternative to Glare that affects Magic Bounce users, but has a worse matchup versus most Wonder Guard users. Destiny Bond is an option that takes advantage of Mega Manectric's high Speed stat and frailty to take a surprise KO against attackers like Huge Power Mega Mewtwo X and slower Choice item Mold Breaker users. Stealth Rock and other entry hazards are options, though Mega Manectric is a noticeably less effective entry hazard setter as compared to other Substitute + Baton Pass Wonder Guard users like Xerneas and Mega Gardevoir due to its inability to force out common Magic Bounce users like Giratina. Magic Coat can be used to reflect entry hazards, sleep moves from Mold Breaker users, and Sing, Gastro Acid, Taunt, and Spider Web from No Guard users. Finally, Sheer Cold can be used to bluff No Guard sets and deter Prankster Giratina from switching in.</p> <h1>Checks and Counters</h1> <p><strong>Ground-type Coverage: Mega Manectric's frailty means its vulnerable to being OHKOed by Ground-type coverage from foes such as Thousand Arrows Huge Power Mega Mewtwo X, Earth Power Protean Mega Latios, and Earth Power Wonder Guard Mega Gardevoir. Additionally, Mega Manectric is vulnerable to the somewhat uncommon, but very dangerous, Fissure. However, niche Destiny Bond Mega Manectric variants are often able to force a trade in a bad matchup.</p> <p><strong>Primal Groudon: Despite usually carrying Water coverage, Mega Manectric is extremely vulnerable to Primal Groudon's powerful Ground attacks. In particular, Choice Scarf + Shadow Tag Primal Groudon sets can trap, outpace, and OHKO Mega Manectric with Thousand Arrows if it isn't already behind a Substitute. Additionally, Choice Scarf + Mold Breaker Primal Groudon can also surprise KO Mega Manectric in a one-on-one scenario.</p> <p><strong>Prankster Giratina</strong>: Prankster Giratina is entirely unthreatened by any Mega Manectric not carrying Taunt and can force it out with Encore or Curse. Furthermore, Giratina's Will-O-Wisp can limit Mega Manectric's ability to create Substitutes over the course of a game.</p> <p><strong>Trick</strong>: Trick users can hinder Mega Manectric for the entirety of the game, either with Black Sludge limiting its ability to create Substitutes or Choice items forcing it to relinquish momentum.</p> <p><strong>Taunt</strong>: Despite usually carrying Scald, Taunt still leaves Mega Manectric unable to support or maintain momentum for its team.</p> ",
    "sets": [
      {
        "name": "Substitute + Baton Pass Wonder Guard",
        "description": "<p>High Speed, an immunity to paralysis, and a good typing make Wonder Guard Mega Manectric a highly effective Substitute + Baton Pass user. The combination of Substitute and Baton Pass allows Mega Manectric to support its teammates by giving them a safe turn to set up, use a utility move, or fire off a powerful attack. Scald has a high chance to OHKO standard Primal Groudon, guaranteed after Stealth Rock. Alternatively, Steam Eruption always OHKOes Primal Groudon and also OHKOes standard Mold Breaker Mega Diancie after Stealth Rock, but has much lower PP and imperfect accuracy. Gastro Acid is extremely useful thanks to Mega Manectric's high Speed tier, neutralizing slower Mold Breaker users that don't carry a Ground move, such as Mega Rayquaza without Precipice Blades, Mega Latios, and Arceus. Taunt is an alternative that allows Mega Manectric to force out Prankster Giratina and support Wonder Guard users trying to phaze Manectric with Whirlwind. Leftovers keeps Mega Manectric healthy and allows it to make more Substitutes over the course of a game. If greater resilience against Shadow Tag users like Choice Scarf Primal Groudon and Choice Specs Mega Mewtwo Y is desired, Shed Shell can be used alongside Recover in the final moveslot. However, Substitute + Baton Pass Mega Manectric appreciates the passive recovery Leftovers provides and dislikes the loss of momentum from taking a turn to use Recover.</p> <p>Wonder Guard Mega Manectric's Ground weakness—and thus, Fissure weakness—means it should nearly always be paired with both a Wonder Guard teammate that isn't weak to Ground—such as Mega Audino or Primal Kyogre—as well as a Flying-type teammate—such as Mega Rayquaza or Yveltal. Choice Band and Choice Specs variants of Mold Breaker Mega Rayquaza are particularly notable teammates, as they appreciate Mega Manectric's Substitutes in addition to being useful teammates versus Fissure users. Mega Manectric also appreciates teammates like Prankster Giratina and—though they're difficult to accommodate on most team structures—physically defensive Poison Heal users like Mega Slowbro and Mega Gyarados for their ability to defensively check Mold Breaker Primal Groudon. Similarly, Mega Manectric appreciates teammates like Huge Power Mega Gyarados, Refrigerate Mega Abomasnow, and Imposter Chansey for their ability to revenge kill Primal Groudon. Pursuit trappers like Mega Gyarados and Yveltal also double as checks to Prankster Giratina. Mold Breaker Primal Groudon itself also makes an excellent teammate, as it appreciates the opportunities Mega Manectric's Substitutes give it to either setup a Shell Smash or fire off a Choice Band boosted V-Create. Most Shell Smash Mold Breaker sweepers—especially frail ones like Mega Gengar and Mega Diancie— similarly appreciate Manectric's Substitutes to ease their setup and defend them against revenge killers like -ate Speed users and Choice Scarf Imposter users. No Guard users such as Mega Mewtwo Y and Mega Lopunny synergize with Mega Manectric, as they give it abundant opportunities to use Substitute thanks to the pressure their OHKO moves exert. Symbiotically, No Guard users appreciate Mega Manectric's Substitutes themselves, as they grant No Guard users a free turn to disrupt the opposing team with Gastro Acid or Sing and ease their matchup against -ate Speed users and Pursuit trappers.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 226455, "username": "berry"}, {"user_id": 515077, "username": "Mbouchon"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 562267, "username": "Daylight"}]}
  },
  "Latios": {"sets": [{"name": "Protean"}, {"name": "Mold Breaker Sweeper"}, {"name": "Shadow Tag"}]},
  "Kyogre": {
    "comments": "<h1>Other Options</h1> <p>An alternate EV spread of 248 HP / 252 Atk / 8 SpD with an Adamant nature and Water Shuriken can be used to revenge kill Shell Smash + Mold Breaker Primal Groudon and Mega Diancie at -1 Defense, but this has little other utility. A Chesto Berry alongside Whirlwind, Nuzzle, or Glare can make Primal Kyogre a safer check to Dark Void variants of Mold Breaker users like Mega Gengar and Mega Diancie, albeit only once. Blue Orb makes Primal Kyogre immune to Trick, reduces damage from Mold Breaker Knock Off, and helps it Imposter-proof Trick + Choice Specs Mold Breaker and Trick + Choice Scarf No Guard teammates. Leftovers allows Primal Kyogre to use Recover less frequently, potentially maintaining momentum for its team. However, sacrificing Shed Shell's resistance to Shadow Tag users makes Primal Kyogre more difficult to use.</p> <p>Though Primal Kyogre already struggles with four-moveslot syndrome, it can nevertheless viably run a myriad of other support options. Nuzzle allows Primal Kyogre to disrupt the opposing team while also making it more resilient versus Taunt users. In addition, the most relevant Pokemon immune to the move—Primal Groudon—doesn't want to switch into Primal Kyogre. However, Nuzzle + Scald Primal Kyogre sets can make Imposter-proofing more difficult, as the two moves combined can disrupt virtually every non-Wonder Guard user. Glare is another paralysis option that does affect Primal Groudon, should that be necessary, but leaves Primal Kyogre more vulnerable to Taunt and is less effective versus Magic Bounce users. Chatter is another Taunt-resistant disruption option for minimum Speed variants of Primal Kyogre to disrupt Pokemon receiving Substitute from faster Baton Pass users. Perish Song is an alternative to Whirlwind that puts Substitute + Baton Pass Magic Bounce users, which are immune to Whirlwind, on a timer. Magic Coat reflects sleep moves from Mold Breaker users, Parting Shot and Stealth Rock from -ate Speed users like Mega Abomasnow, and Sing, Gastro Acid, Taunt, and Spider Web from No Guard users. Parting Shot is an alternative to Baton Pass that fares worse against Magic Bounce users but better against Curse and Gastro Acid users. Finally, Primal Kyogre is also a decent user of Stealth Rock and other entry hazards, though its inability to threaten common Magic Bounce users means it requires greater team support.</p> <p>Thanks to its sky-high Special Attack stat, Primal Kyogre can also run a decent Shell Smash + Wonder Guard set with an EV spread of 4 Def / 252 SpA / 252 Spe, a Modest nature, Judgment, and a Meadow Plate. Notably, Primal Kyogre's +2 Meadow Plate Judgment OHKOes standard Primal Groudon, allowing it to forgo its STAB move for additional coverage. A Choice Specs + Mold Breaker set is also a viable option, as its STAB Steam Eruption OHKOes and 2HKOes large swathes of the metagame; Giratina, opposing Primal Kyogre, Blissey, and very bulky RegenVest users are some of the only switch-ins to Steam Eruption. Additionally, Choice Specs Primal Kyogre can make use of coverage moves like Moonblast, Ice Beam, Freeze-Dry, and Secret Sword to break through those aforementioned checks, leaving it with few true switch-ins.</p> <p>Finally, it's worth noting that on teams with three or more Primal Kyogre—colloquially known as spam teams—fringe Primal Kyogre sets such as Huge Power + Water Shuriken, RegenVest, Parental Bond, and Magic Bounce have significantly increased viability.</p> <h1>Checks and Counters</h1> <p><strong>Grass- and Electric-type Coverage: Despite its impressive bulk, like any Wonder Guard user, Primal Kyogre is vulnerable to OHKOs from powerful foes carrying the right coverage, such as Petal Blizzard Huge Power Mega Mewtwo X and Grass Knot Protean Mega Latios. Additionally, Primal Kyogre's popularity as a Wonder Guard user means that most teams are prepared to face it, making such coverage moves more common. King's Shield variants of Primal Kyogre, however, can scout the aforementioned foes and somewhat mitigate the unfavorable matchup.</p> <p><strong>Trick: Unless it's holding Blue Orb, Trick users can saddle Primal Kyogre with a Choice item for the entirety of the match, forcing it to either use Baton Pass or relinquish momentum. Additionally, Poison-type Trick users like Mega Beedrill can Trick Primal Kyogre their Black Sludge, forcing Primal Kyogre to use Recover more often and making it easier to KO.</p> <p><strong>Powerful Mold Breaker Users: Despite Primal Kyogre's incredible bulk, Shell Smash + Mold Breaker users like Mega Gengar and Arceus can still break through it with decent sleep turn luck. Mold Breaker Mega Latios doesn't even need sleep or luck, as it can just power through Primal Kyogre's weaker Defense with Psystrike. In addition, if Primal Kyogre forgoes King's Shield, it's also forced out easily by Choice Band Mold Breaker users like Mega Rayquaza, and even by Shell Smash Primal Groudon if Primal Kyogre isn't fully healthy.</p> <p><strong>Prankster Giratina: Like is the case with most defensive Wonder Guard users, Prankster Giratina can come in on virtually every Primal Kyogre set and force it out with Encore or chip it with Will-O-Wisp. Giratina dislikes getting burned by Scald, however. Further, teammates running Huge Power + Pursuit, in particular Mega Gyarados and Mega Tyranitar, can discourage Giratina from switching in on Primal Kyogre.</p> <p><strong>Offensive Shadow Tag Users: If Primal Kyogre forgoes or loses its Shed Shell, it's very vulnerable to offensive Shadow Tag users. Baton Pass can mitigate this weakness to some extent, though never completely.</p> <p><strong>Taunt</strong>: Taunt forces out almost all variants of Primal Kyogre that forgo Scald. Even Scald variants find themselves unable to support their team versus Taunt users.</p> ",
    "sets": [
      {
        "name": "Wonder Guard Support",
        "description": "<p>Massive special bulk, pure Water typing, a flexible Speed tier, and forcing out metagame titan Primal Groudon make Primal Kyogre one of the format's best support Wonder Guard users. Scald is an extremely useful STAB move that OHKOes all variants of Primal Groudon and Mold Breaker Mega Diancie. Additionally, Scald's burn chance makes switching in risky for threats like physical Mega Rayquaza. Alternatively, since even the threat of Scald is good at forcing out Primal Groudon, Primal Kyogre can forgo its STAB attack to provide pivoting support with Baton Pass. Defog and Aromatherapy are extremely valuable support options on the majority of team structures. However, if a teammate is carrying either one, Primal Kyogre can opt to use King's Shield or Whirlwind. The former gives Primal Kyogre a scouting tool and improves its matchup against physical Mold Breaker users such as Mega Rayquaza. Whirlwind, on the other hand, exploits Primal Kyogre being notoriously difficult for many special Mold Breaker users and powerful special coverage moves, excluding Protean Mega Latios's Grass Knot, to OHKO. Primal Kyogre can also use both Baton Pass and Scald by forgoing one of its standard utility moveslots, though this type of set is usually restricted to teams with room for multiple defensive Wonder Guard users. Finally, recovery is essential for Primal Kyogre to fill its role as a support Wonder Guard user effectively. Wish synergizes well with King's Shield and can support Primal Kyogre's teammates, but Recover is usually preferred for its immediacy and greater ease of use. A Calm nature and a specially defensive EV spread allow Primal Kyogre to tank hits from specially offensive Mold Breaker users like Mega Gengar and Mega Diancie, as well as scouting powerful special coverage moves from attackers such as Wonder Guard + Shell Smash Mega Gardevoir and Protean Mega Mewtwo Y. A physically defensive EV spread with a Bold nature is an equally viable option, however, as this set checks Primal Groudon with greater ease and offers better mixed bulk for scouting Pokemon, such as Mega Rayquaza, that can run both physical and special sets. A Sassy or Relaxed nature alongside 0 Speed IVs can be run on Baton Pass variants of Primal Kyogre to better bring teammates in safely. A Shed Shell is the preferred item to make Primal Kyogre more resilient versus Shadow Tag users. However, Safety Goggles can be used to make Primal Kyogre a harder check to Spore + Mold Breaker users; special ones such as Mega Gengar and Mega Diancie for specially defensive Primal Kyogre, or Primal Groudon and Mega Tyranitar for physically defensive sets.</p> <p>The vast majority of team structures appreciate the utility that Primal Kyogre can provide. Notably, Primal Kyogre works very well alongside the popular Mold Breaker Primal Groudon + Wonder Guard Xerneas + Prankster Giratina core, defensively covering most offensive threats alongside Xerneas and Giratina. Giratina is a notable partner outside of this core as well, though, as it can easily switch into Huge Power- and Protean-boosted Grass- and Electric-type attacks aimed at Primal Kyogre. In return, specially defensive Primal Kyogre can soft check powerful Ghost- and Fairy-type attackers like Mega Gengar and Mega Diancie for Giratina, particularly if running Safety Goggles and Whirlwind. Primal Kyogre's vulnerability to Protean Mega Latios and Huge Power Mega Mewtwo X means it appreciates teammates that can force them out, such Pixilate Mega Diancie, Aerilate Mega Rayquaza, offensive Shadow Tag users such as Mega Mewtwo Y, and faster No Guard users like Mega Aerodactyl. In addition, those same teammates make excellent entry hazard setters, thus synergizing especially well with Whirlwind variants of Primal Kyogre. Many Choice Specs + Mold Breaker users—such as Mega Rayquaza and Mega Mewtwo Y—appreciate specially defensive Primal Kyogre efficiently Imposter-proofing them. On bulkier balance teams, Primal Kyogre can be run alongside another defensive Wonder Guard user—such as Cresselia, Mega Scizor, or Mega Audino—for more flexibility with both their movesets. Finally, Pursuit users such as Huge Power Mega Gyarados, Yveltal, and Mega Tyranitar are excellent teammates to pressure Giratina, Primal Kyogre's most common non-Wonder Guard switch-in.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 515077, "username": "Mbouchon"}, {"user_id": 226455, "username": "berry"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}], "writtenBy": [{"user_id": 562267, "username": "Daylight"}]}
  },
  "Groudon": {
    "comments": "<h1>Other Options</h1> <p>Mold Breaker + Shell Smash Primal Groudon can use Glare, Nuzzle, or Thunder Wave as disruption, as once opposing Giratina suffers full paralysis, Primal Groudon usually grabs a KO; however, running paralysis makes proper Imposter-proofing more difficult. Sheer Cold is another option; while it is inherently luck-dependent, across a game it has a good chance of eliminating opposing Giratina, making Shell Smash Primal Groudon much more threatening for the rest of the game. Precipice Blades and Diamond Storm are fringe options on its last two moveslots. Having a stronger Ground-type STAB move allows Primal Groudon to OHKO Mega Tyranitar and Primal Groudon after Stealth Rock, and Primal Kyogre, Xerneas, and offensive Arceus after Shell Smash. However, the additional utility gained from having two support moves makes running these moves not worth it most of the time. Sacred Fire is an option over King's Shield or V-create, spreading burns against offensive switch-ins and OHKOing Substitute + Baton Pass Wonder Guard Xerneas after a Shell Smash, but it does not synergize well with Spore or Dark Void and only slightly helps against opposing Giratina. U-turn can be used for Shell Smash Primal Groudon to force opposing Giratina in and retain momentum, taking advantage of Thousand Arrows's virtually-perfect coverage and Primal Groudon's incredible offensive prowess even when unboosted; it also 2HKOes Huge Power Mega Gyarados, a popular switch-in. However, without a teammate that can handle and punish Giratina, especially a Huge Power Dark-types like Mega Gyarados, Mega Tyranitar, or Yveltal, Primal Groudon still has trouble breaking through Giratina. Running Knock Off allows boosted Shell Smash Primal Groudon to threaten Giratina lacking Griseous Orb more, and it synergizes well with Spore by removing Safety Goggles; however, this leaves Primal Groudon exceptionally difficult to Imposter-proof. Safety Goggles allows Primal Groudon to win one-on-one against Mega Gengar, Mold Breaker Arceus, and Dialga running Spore, and it blocks Spore from Prankster Giratina, but it usually isn't worthwhile over Lum Berry. Earth Plate is a fringe option to OHKO opposing Primal Groudon not running bulk investment with Thousand Arrows; Life Orb lets Primal Groudon do the same and OHKO bulky Primal Groudon variants after Stealth Rock. However, running an item that aids Shell Smash Primal Groudon's longevity, such as Leftovers, aids its sweep, like Mental Herb, or removes status, like Lum Berry, is usually more worthwhile. Shell Smash Primal Groudon can invest more in Speed at the cost of bulk; 56 Speed EVs outspeed Choice Scarf Shadow Tag Primal Groudon after a Shell Smash, 148 Speed EVs outspeed Deoxys-S after a boost, and maximum Speed investment (with an Adamant nature) outspeeds Mega Mewtwo Y, Mega Mewtwo X, Mega Gengar, and Mega Manectric after a Shell Smash and V-create.</p> <p>Choice Band + Mold Breaker Primal Groudon has nearly as much set versatility as Shell Smash + Mold Breaker Primal Groudon does. Sacred Fire can be run to provide burn support over multiple uses, which is especially important because Primal Groudon can slowly wear burned Prankster Giratina down with Thousand Arrows if it lacks Leftovers; it is also a powerful STAB move in its own right, being a near-guaranteed 2HKO against Wonder Guard Cresselia, Slaking, and Arceus while 2HKOing Mega Audino. Extreme Speed is an option to pick off frailer weakened foes such as Mega Mewtwo X, Mega Mewtwo Y, and Shell Smash Mega Latios lacking King's Shield, but often isn't worth it due to being unreliable against healthy foes and having the opportunity cost of forgoing coverage or support. Water Shuriken specifically targets Shell Smash Primal Groudon and Mold Breaker Mega Diancie, as well as weakened Choice Band Primal Groudon and Mold Breaker Mega Tyranitar, though it's difficult to justify using, as it's nigh-useless otherwise. Diamond Storm can OHKO standard Mega Rayquaza, Yveltal, and Ho-Oh, but Thousand Arrows usually hits hard enough with a Choice Band, especially with Stealth Rock support, that running Diamond Storm isn't necessary. Stealth Rock, Spikes, and Toxic Spikes can be useful when forcing Giratina in, but they are momentum sinks, especially when Choice Band on Primal Groudon is revealed. Recover can also be used on the switch, greatly helping Primal Groudon's longevity, but it is much more difficult to use against a team with Shadow Tag users, and the opportunity cost of not running coverage or support is high. Glare and Nuzzle can paralyze opposing Giratina when it comes in, forcing mind games and luck gambles the next time Primal Groudon comes in. Alternative EV spreads of 232 HP / 252 Atk / 4 Def / 20 Spe, 180 HP / 252 Atk / 76 Spe, and 4 HP / 252 Atk / 252 Spe with an Adamant nature can be run. The first spread outspeeds standard Shell Smash Mold Breaker Primal Groudon, Mega Tyranitar, and Dialga, the second outspeeds uninvested Yveltal and Xerneas, and the final one outspeeds Mega Mewtwo Y, Mega Mewtwo X, and Mega Gengar after Sticky Web. However, even when running the first spread, it's quite risky to stay in against Pokemon Primal Groudon is meant to outspeed when it's weakened, and the other two spreads lose out on bulk. A Jolly nature could be run with 252 Speed EVs to outspeed all Shell Smash Primal Groudon and Dialga variants, Mold Breaker Xerneas, and slower Mega Latios spreads, but it also misses out on bulk and fails to reliably OHKO opposing Wonder Guard Slaking, Arceus, Cresselia, and Mega Audino after Stealth Rock.</p> <h1>Checks and Counters</h1> <p><strong>Prankster Giratina: Prankster Giratina can check Primal Groudon well in tandem with a revenge killer that threatens Primal Groudon, especially when running Safety Goggles. It can then severely diminish Primal Groudon's offensive presence with Glare, force Shell Smash sweeper variants out with Encore, or predict a switch and chip opposing switch-ins with Curse. Additionally, niche Haze sets cannot be PP stalled by Shell Smash like Encore variants, though they have a much more difficult time checking special Mold Breaker users, which threaten Giratina unboosted. However, Shell Smash Primal Groudon running Dark Void can power through Giratina, and Choice Band + Mold Breaker variants running Beat Up can gash it after a single prediction, so running Prankster Giratina as the only check isn't recommended.</p> <p><strong>Imposter users</strong>: Due to its general reliance on Thousand Arrows, Shell Smash + Mold Breaker Primal Groudon is notoriously difficult to Imposter-proof. Without an exceptionally powerful revenge killer such as Huge Power Mega Gyarados or a healthy Prankster Giratina, opposing Imposter users can make progress and potentially countersweep; however, teams running Dark Void Primal Groudon in particular are especially susceptible to Imposter countersweeps, even with a healthy Giratina. Eviolite Imposter users are especially difficult for Mold Breaker + Shell Smash Primal Groudon to deal with, as despite having to win a Speed tie if Primal Groudon stays in, they can force a switch into Giratina, which is very passive and drains momentum. Choice Scarf Imposter users are slightly more manageable, as they are stuck using Thousand Arrows or V-create, but are still very threatening nonetheless. However, even Choice Scarf + Imposter Chansey is 2HKOed by Choice Band Primal Groudon's Thousand Arrows, so Choice Scarf Imposter users cannot switch in reliably.</p> <p><strong>Huge Power Mega Gyarados: Mega Gyarados is bulky enough to come in on unboosted Primal Groudon, and it can force coinflip scenarios with Water Shuriken and a Huge Power-boosted Pursuit; however, this mind game is somewhat eased if Mold Breaker + Shell Smash Primal Groudon runs King's Shield, and Mega Gyarados is incentivized to use Water Shuriken, as Primal Groudon staying in on Pursuit would prove disastrous. Additionally, Water Shuriken requires three hits to KO healthy unboosted Primal Groudon running standard EV spreads, assuming Mega Gyarados isn't running a boosting item. Therefore, even when a correct prediction is done, Primal Groudon can maybe heavily damage Mega Gyarados, and remove heavily damaged ones, with Thousand Arrows.</p> <p><strong>Other Revenge Killers</strong>: Other revenge killers can also threaten Primal Groudon, though they struggle to do so to the same extent as Mega Gyarados. Although they dislike switching into Mold Breaker + Shell Smash Primal Groudon multiple times, Refrigerate Mega Abomasnow and Kyurem-B, Aerilate or Gale Wings Mega Rayquaza, and Huge Power Slaking or Regigigas running Water Shuriken can force unboosted Primal Groudon out if healthy. However, all but Mega Abomasnow and special Gale Wings Mega Rayquaza, and Slaking or Regigigas with Water Shuriken and a boosting item, will fail to reliably force out boosted Mold Breaker + Shell Smash Primal Groudon with King's Shield. Also, only Gale Wings Mega Rayquaza can reliably come in on Choice Band Primal Groudon if healthy. Some Choice Scarf + No Guard users, like Mega Mewtwo Y, Mega Aerodactyl, and Deoxys-S, outspeed any Primal Groudon even after a Shell Smash, so they can reliably force Primal Groudon out after coming in on a prediction, with pivoting support, or after a teammate has fainted. However, weakened Choice Scarf + No Guard users can fall to rare Choice Band + Mold Breaker variants running Extreme Speed. Additionally, Choice Scarf + Shadow Tag users, like Mega Rayquaza and Mega Mewtwo Y, can outspeed Choice Band + Mold Breaker Primal Groudon, as well as slower Shell Smash Primal Groudon sets even after a boost, and OHKO with a special Water-type move. Choice Band + Shadow Tag Mega Mewtwo X running Precipice Blades can also remove Choice Band Primal Groudon sets, as well as revenge killling unboosted Shell Smash Primal Groudon, with minimal chip damage.</p> <p><strong>Faster Hard Hitters: In a one-on-one scenario, faster Pokemon that are sufficiently strong, such as Huge Power Mega Mewtwo X, Protean Mega Latios, and Choice Specs Mega Mewtwo Y or Mega Rayquaza, can force Primal Groudon out. While a healthy Mold Breaker Primal Groudon can switch into and threaten offensive Wonder Guard users, some Shell Smash + Wonder Guard users, such as Xerneas or Mega Gardevoir running Earth Power and Mega Lucario, can reliably OHKO Primal Groudon after a Shell Smash. Wonder Guard Mega Gardevoir running Grass Knot or Spooky Plate + Judgment will still OHKO even bulky Primal Groudon variants after a Shell Smash and Stealth Rock.</p> <p><strong>Water-type Coverage: Pokemon that Primal Groudon often switches in on, like Xerneas, Wonder Guard Mega Mewtwo Y, and Mega Manectric, can run Water-type moves to catch it off guard and OHKO it; however, they are largely circumvented by running Substitute + Baton Pass support and adequately scouting for such moves.</p> ",
    "sets": [
      {
        "name": "Physical Shell Smash Sweeper",
        "description": "<p>With its amazing physical bulk, incredible offensive typing, ridiculous Attack stat, nifty immunity to the otherwise problematic Will-O-Wisp, and great synergy with other metagame titans, Primal Groudon is the single most threatening offensive Pokemon in the metagame. Every team must prepare for Primal Groudon heavily in the teambuilder, and most teams use one defensive check and one offensive check. Spore or Dark Void allows Primal Groudon to set up against its most common switch-in, Giratina; Spore has 100% accuracy and allows for Imposter-proofing with Safety Goggles Prankster Giratina, while Dark Void affects opposing Safety Goggles users. Stealth Rock is another option, as Primal Groudon forces numerous switches and can use the free turn to set entry hazards. Taunt lets Primal Groudon consistently beat Giratina, which almost always runs four status moves, but is far less useful against its other checks like Primal Kyogre. Shell Smash allows Primal Groudon to boost both its Attack and Speed in a single turn, synergizing well with disruption in Spore, Dark Void, or Taunt. Thousand Arrows is virtually unresisted in the metagame, meaning Primal Groudon can often run a single attack and have tremendous flexibility with its moveset. King's Shield creates mind games with opposing revenge killers, often rendering them null as a threat; V-create is another good choice that allows Primal Groudon to immediately threaten bulky unresisted foes, such as Wonder Guard Slaking, Mega Audino, and Cresselia, much more effectively, forcing them out more often. Primal Groudon has several options for its item; Leftovers synergizes particularly well with King's Shield and increases Primal Groudon's longevity, Lum Berry potentially gifts Primal Groudon a free turn to set up, and Mental Herb allows Primal Groudon to set up against Prankster Giratina lacking Glare or Spore much more easily, nearly always forcing a sack. Mold Breaker allows Primal Groudon to ignore Wonder Guard, allowing it to take full advantage of Thousand Arrows's amazing neutral coverage. The given spread maximizes physical bulk while allowing Primal Groudon to outspeed Pokemon with 150 base Speed, such as Deoxys-Attack and Mega Aerodactyl, after a Shell Smash; an Adamant nature further increases Primal Groudon's offensive prowess, allowing it to 2HKO Giratina after Shell Smash.</p> <p>Primal Groudon fits on nearly every team structure, as its combination of base stats, great STAB moves, and ability to threaten other top metagame threats' checks make it too good to forgo. Prankster Giratina is Primal Groudon's best partner, as it can Imposter-proof Primal Groudon and use Will-O-Wisp or Glare to grant Primal Groudon more opportunities to set up. Giratina also has the option of running Destiny Bond, which is especially useful against Huge Power Mega Gyarados, a common switch-in to Primal Groudon. Despite its impressive bulk, Primal Groudon appreciates being brought in safely by Substitute + Baton Pass users like Wonder Guard Xerneas and Magic Bounce Giratina. Specially offensive Mold Breaker users like Mega Diancie, Choice Specs Mega Rayquaza, and Dialga are great partners to threaten Giratina. In particular, Dialga is an excellent partner, as it can check Gale Wings users and Mega Gyarados lacking Sucker Punch, two common revenge killers to Primal Groudon. Offensive Wonder Guard users, like Xerneas, Mega Gardevoir, and Mega Lucario, are also quite good at forcing out most revenge killers that otherwise take full advantage of unboosted Primal Groudon. As Giratina is Primal Groudon's greatest obstacle, Huge Power Mega Gyarados is a great partner; it can also potentially force out a chipped Imposter user. Physically defensive Wonder Guard Primal Kyogre, as well as Wonder Guard Mega Swampert, are good partners as well due to their ability to check unboosted Imposter users; the latter can also run a Substitute + Baton Pass set to allow offensive teammates to set up more easily. Lastly, Shadow Tag Mega Mewtwo X is a good partner, as with bulk investment it can survive Lum Berry Huge Power Mega Gyarados's Sucker Punch and OHKO back with a Fighting-type attack.</p> "
      },
      {
        "name": "Choice Band + Mold Breaker",
        "description": "<p>Choice Band + Mold Breaker Primal Groudon is one of the most powerful Choice item attackers in the metagame due to its incredible STAB moves, great defensive typing, immunity to burns, and amazing bulk. V-create is a ludicrously powerful STAB move that threatens the entirety of the unresisted metagame, notably OHKOing physically defensive Wonder Guard Slaking, Arceus, Mega Audino, and Cresselia after Stealth Rock. In contrast, Thousand Arrows is a virtually unresisted STAB move that is more spammable than V-create thanks to having no drawbacks, freely threatening slower Pokemon, such as Substitute + Baton Pass Wonder Guard Xerneas and Wonder Guard Mega Scizor, alongside paralyzed offensive Pokemon, like opposing Primal Groudon, chipped Mold Breaker Mega Rayquaza, slightly damaged Mega Mewtwo X, Mega Mewtwo Y, and Mega Gengar. Beat Up is a great coverage option to heavily damage Prankster Giratina and the rare Mega Slowbro, which would ordinarily switch in on Choice Band Primal Groudon. Alternatively, Precipice Blades still 2HKOes Giratina while also threatening non-Flying-types much more effectively than Beat Up; however, opposing Prankster Giratina has a good chance to successfully fish for a miss by repeatedly using Recover. Knock Off item removal can be useful when forcing mind games, especially against defensive Wonder Guard users running Shed Shell when running a Shadow Tag teammate, and it still threatens Magic Bounce Giratina if Giratina has an intact item and even slight chip damage. Trick is a great option to incapacitate Prankster Giratina, supporting offensive and Substitute + Baton Pass Wonder Guard teammates by shutting down their largest counter. U-turn allows Primal Groudon to retain momentum for its team, as well as continually forcing chip damage against its main check in Giratina. Primal Groudon outspeeds most relevant threats without Speed investment at +2, and the extra HP investment helps it survive -ate Speed from users like Abomasnow.</p> <p>Primal Groudon works best on bulky offense teams, which appreciate its ability to force coinflip scenarios against slower teams and create momentum for offensive teammates. Prankster Giratina benefits Primal Groudon greatly by Imposter-proofing it thanks to its massive physical bulk and V-create resistance. Since opposing Prankster Giratina is Primal Groudon's most common switch-in, Huge Power Dark-types that can remove it with Pursuit, such as Mega Gyarados, Mega Tyranitar, and Yveltal, are valuable partners for it; they can also heavily damage most Choice item + Shadow Tag users, which pick a weakened Primal Groudon off. In particular, Mega Gyarados is great, as it can also switch into an opposing Shell Smash Primal Groudon if healthy and force it out with Water Shuriken. Substitute + Baton Pass Wonder Guard users allow Primal Groudon to come in safely with a Substitute, helping it beat offensive Pokemon like opposing Primal Groudon and Protean Mega Latios one-on-one. In particular, Substitute + Baton Pass Wonder Guard Xerneas has great utility in forcing Prankster Giratina and most Magic Bounce users out with Moonblast, and it can run a diverse array of support options in its filler moveslot, such as Stealth Rock, Defog, Aromatherapy, paralysis support in Glare, Dark Void, Taunt, and even Wish or Shell Smash support for Primal Groudon. Special Mold Breaker users, especially more powerful ones like Mega Latios, Mega Diancie, Choice Specs Mega Rayquaza, and Dialga, can force Giratina out after Primal Groudon uses U-turn. Paralysis support from the likes of Prankster Giratina, as well as select support Wonder Guard users, can make Primal Groudon even more threatening by providing free turns. Also, Primal Groudon can force out paralyzed offensive threats like Mega Gengar, Huge Power Mega Mewtwo X, Mega Mewtwo Y lacking a Choice Scarf, Mega Latios, and special Mega Rayquaza. Shadow Tag users can work well with Knock Off Primal Groudon, as the likes of Wonder Guard Primal Kyogre and bulky Gastro Acid + Wonder Guard users like Arceus are secondary switch-ins to it. Entry hazard setters, such as Substitute + Baton Pass Wonder Guard users, defensive Wonder Guard users, and bulky Mold Breaker teammates, can bolster Primal Groudon's offensive prowess, as the additional chip damage from Stealth Rock affects Primal Groudon's KO rolls in a wide variety of instances. Defensive Wonder Guard users can provide Defog and Aromatherapy support, keeping Primal Groudon healthy over the course of a game.</p> "
      },
      {"name": "Choiced Shadow Tag"},
      {"name": "Shell Smash Sweeper WG"},
      {"name": "Choice Scarf Mold Breaker"},
      {"name": "Support WG"},
      {"name": "Baton Pass WG"},
      {"name": "Choice Band Revenge Killer"},
      {"name": "Huge Power Coverage"},
      {"name": "Special Shell Smash Sweeper"}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 569731, "username": "NToTheN"}, {"user_id": 235009, "username": "Ransei"}, {"user_id": 226455, "username": "berry"}, {"user_id": 506113, "username": "BahamutLagoon"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}, {"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 515077, "username": "Mbouchon"}]}
  },
  "Rayquaza": {
    "comments": "<h1>Other Options</h1> <p>Dragon Claw threatens Prankster Giratina more effectively than Dragon Ascent; however, it is hard to fit and usually not worth it over a coverage option. Additionally, Gear Grind has better rolls than Dragon Ascent to OHKO the common Xerneas, but it mostly isn't worth it because Dragon Ascent usually OHKOes Xerneas anyway. V-Create is a powerful alternative to Sacred Fire, KOing Mega Steelix after minor chip damage and making Mega Rayquaza slightly easier to imposter-proof; however, its drawbacks mean Mega Rayquaza is usually forced out after using the move once, and it doesn't spread status like Sacred Fire does. A Jolly nature can be used to outspeed opposing neutral nature Mega Rayquaza, Modest Arceus, and Timid Mega Diancie and Mega Latios, though the extra pressure Adamant brings against Prankster Giratina is usually better. Mega Rayquaza can also use entry hazards like Spikes and Stealth Rock, as it often forces many switches. Waterfall and Steam Eruption are more accurate alternatives to Crabhammer, but they do not KO Mega Tyranitar after Stealth Rock like Crabhammer does. Close Combat can be used to hit Normal-types like Arceus and Slaking, but is outclassed by Sacred Fire in most cases. Thousand Arrows is another decent option, which hits the Electric-types that resist Mega Rayquaza's Dragon Ascent, but is also usually outclassed by Sacred Fire.</p> <h1>Checks and Counters</h1> <p><strong>Prankster Giratina: Prankster Giratina is one of the few Pokemon that can switch in on Choice Band Mega Rayquaza and live to tell the tale. While Choice Band-boosted Dragon Ascent 2HKOes it, it can heal and PP stall with its priority recovery. Additionally, priority status moves like Glare can hinder Mega Rayquaza's ability to consistently threaten foes later in the game. Additionally, some Prankster Giratina sets elect to run Destiny Bond, which can make a Mega Rayquaza sweep short.</p> <p><strong>Shadow Tag</strong>: Offensive Shadow Tag users, like Mega Mewtwo X and Mega Mewtwo Y, can consistently trap and KO Mega Rayquaza with their powerful attacks. Additionally, Perish Song trappers such as Lugia and Arceus commonly run King's Shield, which can remove Rayquaza's strongest asset in its high attack, as well as removing it with Perish Song.</p> <p><strong>Priority Users: Common priority users like Refrigerate Kyurem-B and Mega Abomasnow, Pixilate Mega Diancie, Aerilate Mega Rayquaza, Extreme Speed Regigigas, and Huge Power + Sucker Punch Dark-types can reliably KO Mega Rayquaza after Dragon Ascent's defense drops. These threats can effectively force a coinflip scenarios, KOing Rayquaza with priority if it stays in and getting good dama with Pursuit if it decides to switch out.</p> <p><strong>Stealth Rock: Stealth Rock heavily punishes Mega Rayquaza due to its pivot-heavy playstyle, chipping it every time it switches in. However, Stealth Rock is rather difficult to consistently keep on the field, as a teammate with Defog can remove Stealth Rock then potentially bring Mega Rayquaza in with a pivot move.</p> <p><strong>King's Shield Users</strong>: Activating King's Shield with a contact move potentially nullifies Mega Rayquaza's ability to break walls and secure KOs. However, King's Shield users must be healthy, as well as sufficiently bulky enough, to switch into Mega Rayquaza and hamper its offensive prowess.</p> <p><strong>Imposter</strong>: Defense drops from Dragon Ascent mean that Imposter users can effectively force out Mega Rayquaza, even if they don't hold a Choice Band.</p> ",
    "sets": [
      {
        "name": "Choice Band + Mold Breaker",
        "description": "<h1>Moves</h1> <p>Mega Rayquaza uses its sky-high Attack stat primarily to obliterate foes with its STAB Dragon Ascent, which deals huge damage to everything that doesn't resist it. Sacred Fire is used to hit Steel-type Pokemon, such as Wonder Guard Mega Scizor, Registeel, and Mega Steelix; it also finds great utility in its 50% burn chance, which constantly chips at bulky switch-ins like Prankster Giratina while weakening opposing Imposter users. Precipice Blades is another good option, OHKOing Mold Breaker Mega Tyranitar from full health and Primal Groudon after Stealth Rock. Crabhammer can be used to OHKO Primal Groudon and KO Mega Tyranitar after Stealth Rock, while Trick invalidates would-be checks like King's Shield users and Giratina by forcing them to stick to one status move. Extreme Speed is a great option for picking off weakened foes, especially with Mega Rayquaza's high Attack stat and Choice Band. U-turn takes advantage of Mega Rayquaza demanding switch-ins, as it allows you to conserve momentum. Mega Rayquaza's Mold Breaker allows it threaten opposing Wonder Guard users, letting it keep momentum even more effectively.</p> <p>Rayquaza's most common check is Prankster Giratina, so naturally anything that can beat it pairs well with Mega Rayquaza. Mega Gyarados is an amazing option, as it can force coinflip scenarios against Giratina with its Huge Power-boosted Pursuit and Knock Off. Special Mold Breaker users like Mega Gengar and Mega Diancie can continuously pressure Giratina. Mega Gengar in particular is amazing for its Speed, which lets it take care of fast threats that Mega Rayquaza can't; notably it Speed ties with Mega Mewtwo X and outspeeds opposing Mega Rayquaza, Timid Mega Latios, and Timid Mega Diancie. Slow pivots like Mega Audino, Mega Scizor, and Cresselia, allow Mega Rayquza to get into the field safely, capitalizing on its potential to pressure many Pokemon with its devastating attacks once in. Mega Rayquaza also appreciates the help from Aromatherapy and Defog users like Primal Kyogre and Mega Audino to remove status and Stealth Rock. This set can also be paired with a Choice Specs Mold Breaker Mega Rayquaza as not only do they defeat each other's checks, but the opponent lack reliable counterplay due to not knowing which set is in. Mega Rayquaza pairs well with -ate Speed Pokemon because it takes advantage of their ability to force opposing Wonder Guards users in.</p> "
      },
      {"name": "Choice Specs Mold Breaker"},
      {"name": "Aerilate Revenge Killer"},
      {"name": "Choiced Shadow Tag"},
      {"name": "Gale Wings Revenge Killer"}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 226455, "username": "berry"}, {"user_id": 515077, "username": "Mbouchon"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}], "writtenBy": [{"user_id": 569731, "username": "NToTheN"}]}
  },
  "Deoxys-Attack": {"sets": [{"name": "Huge Power"}, {"name": "Choice Specs Mold Breaker"}]},
  "Deoxys-Speed": {"sets": [{"name": "Scarf No Guard"}, {"name": "Sash No Guard"}]},
  "Lopunny": {
    "comments": "<p>Focus Sash compensates for Mega Lopunny's poor bulk and allows it to freely switch moves. Sheer Cold is Mega Lopunny's primary weapon, OHKOing everything without Wonder Guard or fringe Sturdy. Sing takes advantage of Mega Lopunny's ability to force switches, putting opposing Wonder Guard switch-ins to sleep, and has additional utility through bypassing Substitute. Gastro Acid is used to force switches from Wonder Guard users that switch into Sheer Cold with impunity, allowing the user to use Sing on switches or make easier double switches into other teammates. Stealth Rock is used to sustain chip damage against opposing Wonder Guard users, while Dynamic Punch takes advantage of Mega Lopunny's Attack stat to threaten opposing Wonder Guard users weak to the move, such as Slaking, Arceus, and Mega Lucario. Maximum HP and Speed investment allows Mega Lopunny to outspeed as much as possible while also maximizing its overall bulk; If running attacking moves such as Dynamic Punch, HP investment should be forgone for Attack to maximize damage.</p> <p>Mega Lopunny usually benefits best from being placed on fast-paced Offensive teams that like to quickly gain momentum and force switches. Some notable teammates include Mold breaker users such as Primal Groudon and Mega Latios that take advantage of foes that are put to sleep by Mega Lopunny and also benefit from the chip damage Mega Lopunny gives with Stealth Rock. Shadow Tag Pokemon such as Mega Mewtwo X, Mega Mewtwo Y, and Lugia are appreciated for their ability to remove Wonder Guard users and enable Mega Lopunny to sweep teams. However, Mega Lopunny will need sufficient hazard control if it hopes to keep it's Focus Sash intact. It benefits from Defog Users such as Wonder Guards and Magic Bounce users. These Pokemon also can slowly pivot so Mega Lopunny has a safer time getting on the field.</p> <h1>Other Options</h1> <p>Spikes and Toxic Spikes are alternatives to Stealth Rock to better damage Rock-resistant foes and pressure Wonder Guard users lacking reliable recovery respectively. Sticky Web can help teams that want more speed control and enables slower partners such as Primal Groudon, Mega Rayquaza, Mega Diancie, Mega Tyranitar, and Dialga. Mega Lopunny can use some attacks such as Sacred Fire, Gunk Shot, and Dynamic Punch. However, these are fishing for specific weaknesses of certain Wonder Guard users and are much more situational, so they generally aren't the best options. Lastly, substituting Sheer Cold for Fissure can work to target ground weak Wonder Guard Users Ground-weak Wonder Guard users, but this also falls under situational matchup fishing.</p> <h1>Checks and Counters</h1> <p><strong>Priority Revenge Killers Mega Lopunny can be revenge killed in many ways, ranging from Extreme Speed users such as Regigigas, Slaking, and -ate speed users to Water Shuriken Mega Gyarados, Gale Wings Mega Rayquaza, and even Prankster Giratina running Spore, Dark Void, or Destiny Bond.</p> <p><strong>Wonder Guard Users: While Mega Lopunny is meant to dismantle and force switches between Wonder Guard users, they can still block Trick with items like Mail, Mega Stones, and Primal Orbs. Magic Coat or Magic Bounce users can bounce back Sing and Hazards. Some Wonder Guard users also run attacks such as Xerneas with Moonblast or Kyogre-Primal with Scald and can force Lopunny-Mega out.</p> <p><strong>Faster Pokemon: Faster Pokemon, like Mega Mewtwo Y, Deoxys-S, and Choice Scarf users, can threaten Focus Sash Mega Lopunny out. Additionally, some Choice Scarf users, like Mega Mewtwo Y and No Guard Deoxys-S, can also outspeed Choice Scarf Mega Lopunny and threaten it. Choice Scarf Shadow Tag users, like Mega Rayquaza and Primal Groudon, can outspeed and KO chipped Focus Sash Mega Lopunny. However, most of these options require pivoting support from Wonder Guard teammates to come in on Mega Lopunny safely, and Choice Scarf users naturally slower than Mega Lopunny, like Mega Rayquaza and Mega Mewtwo X, are at risk of getting outsped and OHKOed by Choice Scarf Mega Lopunny.</p> ",
    "sets": [
      {
        "name": "Choice Scarf",
        "description": "<p>Mega Lopunny's high-Speed stat makes it a good No Guard user, as Speed is integral to this utility-centered role. Sheer Cold, which always hits due to No Guard, can OHKO any foe without Wonder Guard or the fringe Sturdy. This allows Mega Lopunny to force opposing Wonder Guard users in with ease. Trick allows Mega Lopunny to disrupt opposing Wonder Guard users; it's best to use Trick early, as getting rid of Choice Scarf gives Mega Lopunny more opportunities to force switches due to Gastro Acid. Mega Lopunny capitalizes on the switches it forces with either Stealth Rock, for entry hazard control and chip damage, or a sleep move like Sing to put opposing Wonder Guard users to sleep. Sing is significantly better than most sleep moves for bypassing Substitute. Mega Lopunny shouldn't afraid to make double switches, as it all but ensures an opposing Wonder Guard user comes in; making double switches is even easier if opposing Wonder Guard users are asleep, or if one is Tricked.</p> <p>Mega Lopunny benefits from slow pivot teammates such as Magic Bounce Giratina and Wonder Guard Pokemon with Parting Shot or Baton Pass. This is because Mega Lopunny is rather frail and needs to get on the field in a safe way. Mega Lopunny is generally used on teams that lack utility or ways to forcibly gain momentum. Mega Lopunny nearly always needs an offensive Pokemon, such as Primal Groudon, Mega Latios, Mega Mewtwo X, or Mega Mewtwo Y, to help back it up and capitalize on the switches and momentum Mega Lopunny gives.</p> "
      },
      {"name": "Focus Sash"}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 515077, "username": "Mbouchon"}, {"user_id": 235009, "username": "Ransei"}, {"user_id": 226455, "username": "Berry"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}, {"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 506113, "username": "BahamutLagoon"}]}
  },
  "Skuntank": {"sets": [{"name": "Support WG"}]},
  "Lucario": {
    "comments": "<h1>Other Options</h1> <p>An alternate EV spread of 68 Atk / 252 SpA / 188 Spe alongside Bolt Strike is an option to OHKO physically defensive Primal Kyogre at +2 while still outpacing Jolly Primal Groudon. Similarly, a spread of 176 Atk / 252 SpA / 80 Spe with a Rash nature is an option alongside either Bolt Strike or Power Whip to OHKO Primal Kyogre while outpacing maximum speed Adamant Primal Groudon. A Timid or Naive nature is another option to outpace the somewhat rare Timid Mega Latios and Timid Mega Diancie.</p> <p>Flame Plate is an option over Fist Plate to hit Bug- and Steel-type Wonder Guard users. However, using Flame Plate means that Mega Lucario sacrifices the ability to hit Normal-type Wonder Guard users and OHKO Primal Groudon at +2 unless it also sacrifices its ability to beat Imposter users. Earth Plate is also an option over Fist Plate that trades hitting Normal-type Wonder Guard users for Electric-type Wonder Guard users while retaining the ability to KO Primal Groudon at +2. However, this version of the set faces fierce competition from Dialga, which has superior bulk, higher Special Attack, and lacks a Fire weakness.</p> <p>Mega Lucario also has a handful of other coverage options it can utilize. Bug Buzz does better against Cresselia than Knock Off, allowing Lucario to avoid mind games against King's Shield variants. Play Rough and Moonblast are both alternatives to hit Wonder Guard Mega Sableye; however, the former is an alternative to Knock Off that also OHKOes Mega Latios, while the latter offers similar coverage and hits harder overall. Scald can be used to OHKO Primal Groudon. Gastro Acid is an option to allow Mega Lucario to break through Wonder Guard users of any type at the somewhat steep cost of an additional turn to do so.</p> <h1>Checks and Counters</h1> <p><strong>Fissure: Like all Ground-weak Wonder Guard users, Mega Lucario is vulnerable to the somewhat uncommon but still very dangerous Fissure.</p> <p><strong>Strong Attackers</strong>: Mega Lucario is very frail both specially and physically. If a powerful unresisted attack pierces its Wonder Guard, Mega Lucario will almost certainly be KOed. In addition, all three of Mega Lucario’s weaknesses are to very common attacking types, which means that most teams have multiple attackers that can bypass Mega Lucario's Wonder Guard. In particular, Mega Lucario is weak to both of Primal Groudon's STAB attacks. Faster Mold Breaker attackers, such as Mega Mewtwo Y and Mega Gengar, as well as those that can tank a hit, such as Protean Mega Latios, are all highly threatening to Mega Lucario.</p> <p><strong>Opposing Wonder Guard: Because Wonder Guard sweepers are inherently matchup dependent, Wonder Guard users that Mega Lucario is not packing the correct coverage moves for will force it out.</p> <p><strong>Item Removal</strong>: Trick, Switcheroo, and Mold Breaker Knock Off can severely impede Mega Lucario's ability to do its job, removing one-third of its coverage as well as its ability to beat Imposter users.</p> <p><strong>Offensive Shadow Tag Users</strong>: Offensive Shadow Tag users such as Primal Groudon or Mega Mewtwo X can pivot in on unboosted Mega Lucario and OHKO it. Very few offensive Shadow Tag users do not carry an attacking move that can KO Mega Lucario.</p> <p><strong>Prankster Giratina</strong>: Unless Mega Lucario is already boosted and just used a move that Giratina does not resist while it switches in, Prankster Giratina can come in freely on Mega Lucario and annoy it with Will-O-Wisp or Glare.</p> ",
    "sets": [
      {
        "name": "Wonder Guard Shell Smash",
        "description": "<p>Mega Lucario's decent typing for an offensive Wonder Guard user, quadruple resistance to Stealth Rock, strong attacking stats, and good base 112 Speed make it a powerful option for a Wonder Guard Shell Smash sweeper. The combination of Judgment and Fist Plate is a huge boon to Mega Lucario, allowing it to defeat Imposter users, Normal-type Wonder Guard users, and allowing it OHKO Primal Groudon after one Shell Smash. Flash Cannon and Gear Grind are both powerful STAB moves that hit Fairy-type Wonder Guard users. Flash Cannon's superior accuracy makes it the more consistent option and is slightly stronger against standard Wonder Guard Mega Audino. Gear Grind, on the other hand, is noticeably better against Wonder Guard Xerneas and Mega Gardevoir, breaking the former's Substitutes and outright OHKOing the latter without a boost. The final moveslot is flexible, as it is both metagame- and team-dependent, but notable options include: Freeze-Dry, Grass Knot, and Knock Off. Freeze-Dry and Grass Knot both do well against Water-type Wonder Guard users like Primal Kyogre. The former's greater coverage usually make it the preferred option, but Grass Knot's increased Base Power versus certain targets such as Whirlwind Primal Kyogre is valuable as well. Knock Off is a useful option, as it OHKOes Mega Latios at +2. Without Knock Off, Mega Latios can take any other hit from Lucario—even at +2—and OHKO back. Knock Off also gives Mega Lucario a way of damaging Psychic- and Ghost-type Wonder Guard users and has the additional utility of removing items, making switch-ins without Wonder Guard less safe. A Rash nature is preferred if physical attacks are used; otherwise, a Modest nature is preferred.</p> <p>Mega Lucario fits best on balance and offense teams in need of a wincon and late-game cleaner. However, Mega Lucario differs from similar Wonder Guard Shell Smash sweepers like Mega Gardevoir and Xerneas, most notably because of its Fissure weakness, meaning that it appreciates teammates that can scout potential opposing No Guard users, such as Imposter users and slow pivots with Wonder Guard that don't share weaknesses with Mega Lucario, such as Cresselia, Slaking, and Primal Kyogre. In addition, a Flying-type teammate, such as Mega Rayquaza, can also help alleviate Mega Lucario’s Fissure weakness, as Sheer Cold + Fissure No Guard users are uncommon. Mega Lucario is also limited in its ability to beat certain Wonder Guard users, namely those weak to Fire- and Ground-type moves, without compromising its ability to beat Imposter users. As a result, Mega Lucario benefits from Choice Band Mold Breaker teammates that can break opposing Wonder Guard cores such as Primal Groudon and Mega Rayquaza. Offensive Shadow Tag teammates—Primal Groudon in particular—are also worth a mention, as they can trap and KO the Wonder Guard users Mega Lucario can't touch. Substitute + Baton Pass Wonder Guard users are also useful teammates, as they can give Mega Lucario additional opportunities to use Shell Smash and provide it some breathing room versus opposing Shadow Tag Primal Groudon, which would otherwise trap and KO Lucario. Finally, Mega Lucario also appreciates Aromatherapy, Defog, and Wish support from teammates such as the aforementioned slow pivoting Wonder Guard users to make its job as a wincon and late-game cleaner easier.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 226455, "username": "berry"}, {"user_id": 515077, "username": "Mbouchon"}]}, {"name": "Grammar checked by", "members": [{"user_id": 241023, "username": "Kris"}]}], "writtenBy": [{"user_id": 562267, "username": "Daylight"}]}
  },
  "Drapion": {"overview": "<p>Drapion is slightly outclassed by Skuntank as a Poison / Dark Wonder Guard user. While Drapion has higher physical bulk, allowing it to survive hits like Primal Groudon's Thousand Arrows and Choice Band Mega Rayquaza's Dragon Ascent, Skuntank has slightly better special bulk and can pivot after Wonder Guard Primal Kyogre, Primal Groudon, and minimum Speed Cresselia and Meloetta. As Drapion and Skuntank are functionally the same, Skuntank's analysis can be found here.</p> ", "sets": [{"name": "Support WG"}]},
  "Abomasnow": {
    "comments": "<h1>Other Options</h1> <p>Mega Abomasnow can opt for V-Create instead of Boomburst to threaten Magic Bounce Steel-types like Registeel, as well as OHKO Wonder Guard Mega Scizor and Escavalier. However, forgoing Boomburst means Mega Abomasnow has a much more difficult time checking Shell Smash Mold Breaker Primal Groudon running King's Shield, and V-Create's main targets in Magic Bounce Steel-types are relatively uncommon. Sacred Fire is an alternative option which can provide utility with burns, but is usually not worth it as it fails to OHKO Mega Scizor or 2HKO Mega Steelix. Pursuit can also be used over Boomburst to trap opposing Mega Gengar, weakened Mega Mewtwo Y, and Mega Latios after a Shell Smash; however, it has the high opportunity cost of not being able to be run with Boomburst and a support move. Spikes, Toxic Spikes, and Sticky Web are options over Stealth Rock, as Mega Abomasnow adequately threatens Flying-types, and its teammates appreciate the chip offered by poison from Toxic Spikes and the Speed drop from Sticky Web. The consistent damage of Stealth Rock is generally more useful, however. Baton Pass can work over Parting Shot, as it allows Mega Abomasnow to pass Substitutes it received from a teammate to another offensive teammate while still offering universal pivoting. Taunt can be used on the switch to disable Wonder Guard switch-ins running four status moves. Spore is another option that also disables them by putting them to sleep, and the opponent cannot put Mega Abomasnow to sleep with a well-timed Magic Bounce switch-in. Recover is a fringe option to keep Mega Abomasnow healthy, though the opportunity cost of not running a support move is high. Running coverage in the last one or two moveslots is an option, with possible options being Petal Blizzard, Freeze-Dry, Gunk Shot, Knock Off, Thousand Arrows, Close Combat, Low Kick, and Play Rough. If running Freeze-Dry, an alternative spread of 4 HP / 252 Atk / 252 SpA with a Brave nature could be used to force recovery from physically defensive Wonder Guard Primal Kyogre, but the added bulk from investing in HP is generally more worthwhile. Leftovers is a niche option over Icicle Plate, as it increases Mega Abomasnow's longevity throughout the game; however, forgoing Icicle Plate means Mega Abomasnow misses out on the OHKO against Giratina with Boomburst.</p> <h1>Checks and Counters</h1> <p><strong>Wonder Guard Users: The vast majority of Wonder Guard users can switch in on Mega Abomasnow and render its Refrigerate-boosted attacks null. In particular, offensive Wonder Guard users are problematic, as they can't be revenge killed by Mega Abomasnow and, in a good matchup, can snowball through teams which have Mega Abomasnow as the sole setup check.</p> <p><strong>Offensive Shadow Tag Users</strong>: Offensive Shadow Tag users, especially bulky Mega Mewtwo X, can come in on Mega Abomasnow on a resisted move or Fake Out and OHKO it. In particular, Mega Mewtwo X with significant bulk investment and Primal Groudon are bulky enough to usually survive Fake Out into Extreme Speed and can OHKO Mega Abomasnow with Drain Punch or V-Create, respectively. However, most pivoting support is useless for offensive Shadow Tag users aiming to remove Mega Abomasnow due to its abysmal speed, and nearly all Shadow Tag users are vulnerable to getting KOed by Boomburst into Extreme Speed.</p> <p><strong>Huge Power Mega Gyarados</strong>: Despite Mega Abomasnow investing in HP to increase its bulk, Huge Power-boosted Pursuits are problematic for it. In particular, Mega Gyarados is an issue, as it can come in on Fake Out, Extreme Speed, or Boomburst safely if healthy.</p> <p><strong>Magic Bounce Steel-types</strong>: Magic Bounce Steel-types, such as Registeel and Mega Steelix, can prevent specific Mega Abomasnow sets from being able to support its team. However, Registeel can be threatened with V-Create or Sacred Fire, and Mega Steelix is blown past by Boomburst sets.</p> ",
    "sets": [
      {
        "name": "Refrigerate",
        "description": "<p>Refrigerate Mega Abomasnow is an excellent revenge killer that differentiates itself from other -ate Speed users with its resistance to Thousand Arrows, immunity to Spore, and low Speed stat that allows it to underspeed many of the format's slow pivots. Fake Out and Extreme Speed form a potent combination that allows Mega Abomasnow to threaten chip against sweepers lacking King's Shield and revenge weakened foes with its strong priority STAB attacks. Fake Out on its own is also able to chip opposing sweepers lacking King's Shield, letting Mega Abomasnow hard switch into unboosted sweepers on a prediction and either chip them or force them out. Boomburst is an incredibly powerful STAB move that with an Icicle Plate OHKOes opposing Giratina and allows Mega Abomasnow to force non-Wonder Guard users out the majority of the time if healthy. Stealth Rock allows Mega Abomasnow to support its team through entry hazard setting, capitalizing on Mega Abomasnow's ability to force out offensive threats; Parting Shot and Gastro Acid are good alternative options, as the former helps to retain momentum against even slow pivot Wonder Guard users like Mega Audino and Primal Kyogre, while the latter forces most opposing Wonder Guard users to switch due to the threat of Boomburst and Extreme Speed. Since Boomburst already OHKOes Giratina without any investment, Abomasnow can throw its EVs into HP and Attack. A Brave nature and 0 Speed IVs minimizes Mega Abomasnow's Speed, giving it the ability to underspeed slow pivots like Wonder Guard Mega Audino and Chansey.</p> <p>Mega Abomasnow works best on teams that appreciate its ability to revenge kill non-Wonder Guard sweepers, such as offense, bulky offense, balance, and dual Mega Mewtwo X teams. In particular, it works well with the ubiquitous Shell Smash Primal Groudon + Prankster Giratina + Wonder Guard Xerneas core, as even Prankster Giratina proves to be insufficient counterplay to opposing Mold Breaker Primal Groudon on its own. Offensive pressure from Primal Groudon helps retain momentum against teams that rely on Wonder Guard Xerneas to come in on Mega Abomasnow, especially if Mega Abomasnow runs Parting Shot; Prankster Giratina, especially variants running Will-O-Wisp, can switch in on healthy Huge Power users using a Fighting-, Fire-, Poison-, or Steel-type attack and force them out with either Encore or the threat of a burn. Wonder Guard Xerneas can pass Substitutes to Mega Abomasnow, which allows Mega Abomasnow to set Stealth Rock or threaten opposing switch-ins with Gastro Acid. Mold Breaker users, in particular slower ones like Mega Tyranitar, Choice item Mega Rayquaza, and Mega Latios, also appreciate Mega Abomasnow's ability to revenge kill faster threats. On faster offensive teams, Imposter Chansey is a good partner, as Mega Abomasnow struggles to deal with King's Shield sweepers; in return, Mega Abomasnow can threaten Mega Gengar and Mold Breaker Mega Diancie, two Pokemon Imposter Chansey can't prevent from setting up easily. Offensive Shadow Tag users, in particular Mega Mewtwo X, Mega Mewtwo Y, and Mega Latios, are good partners for Parting Shot Mega Abomasnow due to being able to remove Wonder Guard users not running Shed Shell, such as Xerneas and Safety Goggles Primal Kyogre. Mega Abomasnow can work well on dual Mega Mewtwo X teams due to being a fairly reliable lone revenge killer, though it faces stiff competition from other -ate users such as Kyurem-B and Mega Rayquaza. Lastly, defensive Wonder Guard users are extremely valuable for Mega Abomasnow, as they can provide Defog, Aromatherapy, and Wish support, helping for removing entry hazards, protecting against Dark Void Mold Breaker sweepers, and providing for Mega Abomasnow's longevity respectively, while also disrupting Substitute + Baton Pass Wonder Guard users coming in and trying to set up with Whirlwind.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 226455, "username": "berry"}, {"user_id": 506113, "username": "BahamutLagoon"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 515077, "username": "Mbouchon"}]}
  },
  "Dialga": {"sets": [{"name": "Shell Smash Sweeper"}]},
  "Regigigas": {
    "comments": "<h1>Other Options</h1> <p>Regigigas can use other priority moves instead of Bullet Punch, such as Shadow Sneak for Mega Gengar or Water Shuriken for Primal Groudon. However, Water Shuriken needs to hit all 5 times to OHKO Primal Groudon with a Defense drop, and Shadow Sheak requires Life Orb to always OHKO opposing Mega Gengar after a Shell Smash, making these moves generally not worth running. A set with Encore and Perish Song can be used over Bullet Punch and Spikes in order to trap passive Wonder Guard users without Shed Shell as well as opposing sweepers running King's Shield that are locked into the move, but the utility of Spikes and Bullet Punch are usually not worth forgoing. Other entry hazards such as Stealth Rock and Sticky Web can also be used in the place of Spikes, but Regigigas's ability to set multiple layers means Spikes is usually preferred. Coverage moves for Wonder Guard Pokemon such as Gunk Shot, Gear Grind, Sacred Fire, and Close Combat can also be used, but these moves are often not worth using as they are very matchup reliant. Recover is another option for the fourth moveslot, allowing Regigigas to heal off chip from entry hazards.</p> <h1>Checks and Counters</h1> <p><strong>Wonder Guard Users: Most Wonder Guard users do not fear any of Regigigas's moves and can usually heal or set entry hazards in front of Regigigas. However, those lacking Shed Shell that underspeed Regigigas, like Substitute + Baton Pass Xerneas and Safety Goggles Primal Kyogre, fear the uncommon Encore and Perish Song set.</p> <p><strong>Shed Shell Users: Pokemon holding Shed Shell avoid being trapped by Shadow Tag, removing Regigigas's main niche and allowing them to freely switch to a Pokemon that can beat Regigigas. However, these Pokemon must be wary of getting their item removed by one of Regigigas's teammates.</p> <p><strong>Giratina</strong>: Giratina is not threatened by any of Regigigas's moves and is unable to be trapped due to its Ghost typing, allowing it to threaten Regigigas with crippling status moves. Magic Bounce sets can also prevent Regigigas from setting entry hazards, completely shutting it down. Giratina is weak to Pursuit from Regigigas's teammates, but running Pursuit often defeats the purpose of Regigigas, so it is not common.</p> <p><strong>Faster Ghost, Rock, and Steel Pokemon</strong>: Offensive Pokemon who resist Regigigas's STAB moves such as Dialga and Gengar often don't fear any of Regigigas's moves and can set up freely against teams who rely on Regigigas as their main way of revenge killing.</p> <p><strong>King's Shield Mold Breaker Sweepers: King's Shield drops Regigigas's Attack sharply and prevents it from reliably revenging opposing Pokemon. However, Imposter Chansey is able to revenge most King's Shield users.</p> ",
    "sets": [
      {"name": "Huge Power Revenge-Killer"},
      {
        "name": "Shadow Tag Revenge Killer",
        "description": "<p>Shadow Tag Regigigas is one of the best revenge killers in the metagame, as it can trap and eliminate frail offensive Pokemon including Mold Breaker Mega Diancie, No Guard Deoxys-S, and many variants of Mega Mewtwo Y. Its main source of damage is the combination of Fake Out and Extreme Speed, allowing Regigigas to often deal large amounts of damage without taking any in return. This combination of moves notably KOes Deoxys-S, offensive Mega Mewtwo Y, and Mega Latios with slight chip. Bullet Punch is used to OHKO Mega Diancie after a Shell Smash, as well as chip Substitute + Baton Pass Wonder Guard Xerneas. Spikes capitalizes on the free turns Regigigas gets against passive Wonder Guard users such as Mega Audino and Mega Scizor, as well as Substitute + Baton Pass Xerneas lacking Glare, Dark Void, or Taunt. Regigigas is also often able to set 3 layers of Spikes vs passive Pokemon without Shed Shell, as they can not threaten it. Silk Scarf provides a boost to Regigigas's Normal-type STAB moves, allowing it to KO Deoxys-S, uninvested Mega Mewtwo Y, and Mega Latios with the combination of Fake Out and Extreme Speed. Additionally, Leftovers provides recovery that Regigigas can capitalize on by trapping passive Pokemon with Shadow Tag. Maximum Attack EVs with an Adamant nature allow Regigigas to hit as hard as possible, while an investment in HP increases Regigigas's longevity.</p> <p>Regigigas fits mostly on balance and bulky offense teams that appreciate its ability to trap and remove powerful offensive threats. Frail Mold Breaker sweepers such as Mega Gengar and Mega Diancie pair well with Regigigas, as removing offensive Pokemon allows them to set up more easily. Additionally, these Mold Breaker users can force out the metagame's most common Magic Bounce user in Giratina, which would otherwise prevent Regigigas from setting entry hazards. Mold Breaker Tyranitar is able to force Regigigas out, so Fairy- and Dark-type teammates such as Mega Diancie are good to have. Common Wonder Guard Pokemon such as Mega Scizor and Primal Kyogre are able to wall Regigigas, so the same Mold Breaker Pokemon also pair well with Regigigas, as they can eliminate these Pokemon. Imposter Chansey is another great partner, as the two of them can revenge almost all Pokemon except Mega Gengar and Dialga. Wonder Guard users also make good teammates, Regigigas is often able to remove the Mold Breaker Pokemon that threaten them. Pokemon with Trick, Mold Breaker Knock Off, or other forms of item removal are other helpful teammates, as Regigigas greatly appreciates Shed Shells being removed from opposing Wonder Guard users.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 515077, "username": "Mbouchon"}, {"user_id": 226455, "username": "berry"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 525446, "username": "Ducky"}]}
  },
  "Giratina": {
    "comments": "<h1>Other Options</h1> <p>Baton Pass can be run on the first moveslot, as Giratina often incentivizes switching by threatening to use Encore; additionally, Baton Pass allows Giratina to switch out of Huge Power Pursuit users safely. Substitute is another option which allows Giratina to force attacks in tandem with Encore and scout against opposing Choice item Mold Breaker users in a 1v1 situation, but is generally not worth it as the opportunity cost of not running an additional utility move is very high. Toxic can be run to chip Mega Mewtwo X, Primal Groudon, and Wonder Guard Xerneas, but doesn't have Will-O-Wisp's ability to cripple most physical attackers or Glare's ability to hamper most Mold Breaker users' sweeping ability. Trick, especially with a detrimental item like Lagging Tail, allows Giratina to remove Plates from the many special Mold Breaker users, such as Mega Gengar, Mega Diancie, Dialga, and Mega Sceptile. As an alternative to Will-O-Wisp, Flame Orb + Psycho Shift prevents Dark Void from affecting Giratina and, in effect, spreads 100% accurate burns, but its downside includes Giratina needing to recover more frequently due to passive self-damage, forcing Giratina to cede momentum to the opponent. Dark Void is an option for the first moveslot which ignores Safety Goggles, at the cost of putting Giratina to sleep when used against a Magic Bounce user. Swagger can also be run in the first moveslot when paired with Imposter Chansey, as when Giratina is overwhelmed by a physical Mold Breaker user, it can use the move and either secure chip and heal itself or sack itself to bring Chansey in. Colbur Berry is an option that allows it to switch out of Huge Power Pursuit users one time without being as heavily damaged, though it is rather difficult to run due to the opportunity cost of not being able to block Spore, having passive recovery, or blocking Trick. Haze is an option over Encore that allows Giratina to check opposing Shell Smash sweepers in long games, as Encore is prone to getting PP stalled; however, this is only useful against physical Mold Breakers that Giratina naturally checks, like Primal Groudon and Mega Mewtwo X.</p> <p>Aside from Prankster and Magic Bounce, Giratina can run niche abilities in Poison Heal and Fur Coat; Poison Heal Giratina can defensively check Primal Groudon and Choice Band Mega Rayquaza more effectively, while Fur Coat Giratina has much less difficulty switching into Huge Power users. Poison Heal sets run Will-O-Wisp, Psycho Shift, Scald, or Steam Eruption in the first moveslot, King's Shield or Spiky Shield in the second moveslot, Curse, and Recover, with Toxic Orb as the item. Fur Coat Giratina enjoys running a similar moveset, but it favors running the same items that Prankster Giratina runs; however, Fur Coat Giratina does not rely on King's Shield as much, and it cannot run Psycho Shift viably. However, these abilities are not without their weaknesses: Poison Heal Giratina cannot disrupt Shell Smash sweepers that it is weak to, such as Mega Gengar, Mega Diancie, Mega Tyranitar, and Dialga, the way Prankster Giratina would be able to, and Fur Coat Giratina is extremely passive and is generally outclassed by Prankster except against Huge Power users. No Guard Giratina is an extremely fringe option that exclusively relies on surprise, but a faster No Guard user, such as Mega Mewtwo Y, Mega Mewtwo X, or Mega Aerodactyl, is virtually always superior.</p> <h1>Checks and Counters</h1> <p><strong>Huge Power Dark-Types: Dark-type Huge Power users, like Mega Gyarados, Mega Tyranitar, and Yveltal, can force mindgames against Giratina through threatening both Pursuit and a conventional attack, usually Knock Off. However, Giratina can use Destiny Bond to force a trade between it and the Huge Power Dark-type, or run the niche Baton Pass to circumvent Pursuit.</p> <p><strong>Specially Offensive Pokemon: The vast majority of special Mold Breaker users can threaten Giratina, as Giratina is virtually always physically defensive and has a poor typing to deal with opposing special attackers. However, many special Mold Breakers rely on Plates to have a powerful STAB move or coverage, and Giratina running Trick can render said Plate users null as a threat once their Plate is removed. Even when not taking Mold Breaker users into account, specially offensive Pokemon, such as Protean Mega Latios and Choice Specs Gale Wings Mega Rayquaza, force Giratina out.</p> <p><strong>Wonder Guard Xerneas and Mega Gardevoir: Fairy-type Wonder Guard users with a respectable Special Attack stat, namely Xerneas and Mega Gardevoir, can force Giratina out with Moonblast; however, they must watch out for Glare, Will-O-Wisp, and Destiny Bond, as a loss of momentum, effectively being on a timer, or just being removed hampers the support they are able to give to the rest of the team.</p> <p><strong>Lum Berry Mega Mewtwo X</strong>: If Giratina is not healthy, Mega Mewtwo X with a Lum Berry can overwhelm Giratina, though Destiny Bond Giratina can force a trade between itself and Mega Mewtwo X.</p> <p><strong>-ate Users</strong>: Refrigerate, Pixilate, and Aerilate (collectively called -ate) users can force Giratina out by threatening either Fake Out + Extreme Speed or an extremely powerful Boomburst. Mega Diancie and Kyurem-B can threaten a KO against Giratina with Fake Out into Extreme Speed; Mega Abomasnow and Mega Rayquaza can potentially play around Giratina variants with Destiny Bond.</p> <p><strong>No Guard Users: By virtue of OHKOing every Pokemon that don't have Wonder Guard or Sturdy, No Guard users are adept at forcing Giratina out. However, Giratina can force a trade by using Destiny Bond on a OHKO move.</p> ",
    "sets": [
      {
        "name": "Prankster",
        "description": "<p>Prankster Giratina is the best blanket check to physical attackers in the metagame, as it is an untrappable check to Primal Groudon and Mega Mewtwo X with amazing bulk and potentially an immunity to Trick. In addition, it has numerous possible options to try and circumvent its checks. Will-O-Wisp allows Giratina to cripple opposing Huge Power users without a Lum Berry and chips foes lacking recovery without resorting to Curse. Destiny Bond is also a great option, as it allows for a near-guaranteed trade, usually against a runaway sweeper. Spore annoys the likes of Primal Groudon and Mega Mewtwo X lacking Safety Goggles, as well as Pokemon that would normally threaten Giratina like Mega Gengar, Mega Latios, and Mold Breaker Mega Diancie. Glare is another option that makes Primal Groudon and Huge Power users easier to deal with, but leaves Giratina vulnerable to Huge Power Pursuit users like Mega Gyarados, Mega Tyranitar, and Yveltal. Encore is integral to Giratina's ability to check sweepers, as locking opposing sweepers into setup moves like Shell Smash all but forces them out. Curse is extremely valuable, as many switch-ins to Giratina lack reliable recovery, and it is fairly easy for Giratina to find opportunities to heal itself. Recover is essential to Giratina's longevity. Safety Goggles is preferred, as it allows Giratina to be a sturdy check to Primal Groudon using Spore as disruption; Leftovers can be used to passively heal Giratina reduce chip damage from U-turn and entry hazards. Griseous Orb prevents Trick users, like Choice Band Primal Groudon and Mega Rayquaza, from locking Giratina into either a support move, preventing recovery until Giratina switches back in later in the game, or recovery, leaving Giratina a momentum sink.</p> <p>Giratina can fit on virtually any team, as the widespread utility it provides on top of checking offensive Pokemon is unmatched. It effectively acts as a switch-in for Primal Groudon, Mega Mewtwo X, and offensive Choice Band Mold Breaker users. Giratina forms a crucial part of the metagame's most dominant core in Giratina, Primal Groudon, and Wonder Guard Xerneas. Giratina can come in on Huge Power-boosted Poison- and Steel-type attacks, while Xerneas can support the rest of the team with utility, such as Stealth Rock, Defog, Aromatherapy, and Glare; Giratina can also Imposter-proof Primal Groudon sets not running Dark Void. Additionally, Giratina can potentially use Glare and allow for Primal Groudon to pose a greater threat, or Destiny Bond to remove checks to this core like Mega Gengar and Protean Mega Latios. Both of these threats dislike having to win 50-50s against Pursuit and Sucker Punch users; thus Huge Power Dark-types, in particular Mega Gyarados, are good partners to Giratina. Aside from Mega Gyarados, -ate users that can threaten opposing Primal Groudon, such as Mega Abomasnow and Mega Rayquaza, are also good partners, as Giratina has trouble reliably checking Dark Void variants. On more defensive teams, Magic Bounce users that complement Giratina well typing-wise, such as Yveltal, Registeel, and occasionally Mega Venusaur and Ferrothorn, work well. Because of Wonder Guard Xerneas's prevalence and it being a common switch-in to Giratina, Shadow Tag users, in particular Mega Mewtwo X, are great partners to Giratina.</p> "
      },
      {"name": "Magic Bounce"}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 226455, "username": "berry"}, {"user_id": 235009, "username": "Ransei"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 515077, "username": "Mbouchon"}]}
  },
  "Cresselia": {
    "comments": "<h1>Other Options</h1> <p>116 Speed EVs can be used outpace and escape Huge Power Yveltal's Pursuit, though doing so comes at the cost of Cresselia's survivability versus Mold Breaker users, as well as the ability to underspeed minimum Speed Wonder Guard Arceus. A specially defensive set, though hard to justify when Cresselia is so effective at scouting physically offensive Mold Breakers, is also an option to improve Cresselia's matchup against Choice Specs Mold Breaker users and to let it survive a single Bug Buzz from Protean Latios. Colbur Berry is another option to improve Cresselia's matchup against Pursuit trappers, allowing it to risk the 50 / 50 a single time versus Mega Gyarados; however, forgoing Shed Shell comes at the cost of increased vulnerability to Shadow Tag users like Perish Song Lugia. Safety Goggles is another option that can allow Cresselia to soft check some Spore Mold Breaker Shell Smash sweepers alongside either Whirlwind or Glare—although it similarly leaves Cresselia vulnerable to Shadow Tag users. Mail is a final option to make Cresselia immune to Trick.</p> <p>Though a little difficult to fit, Glare is an option to punish Mold Breaker users like Mega Gengar that Cresselia lures in. Similarly, Will-O-Wisp is an option to cripple incoming Huge Power users, continuously chip special attackers lacking recovery, and to limit the number of times Substitute + Baton Pass users like Xerneas and Mega Mewtwo Y can use Substitute. Substitute can be used alongside Baton Pass, but this role is typically filled better by less passive Wonder Guard users, such as Xerneas. Perish Song is an alternative to Whirlwind to put any opponent, but especially Whirlwind-immune Substitute + Baton Pass Magic Bounce users, on a timer. Magic Coat is an option to reflect sleep moves from Mold Breaker users like Primal Groudon looking to use Cresselia as a setup opportunity, as well as Parting Shot and Stealth Rock from -ate Speed users like Mega Abomasnow and Sing, Gastro Acid, Taunt, and Spider Web from No Guard users. Finally, a set with both King's Shield and Baton Pass is viable, but it severely limits the utility Cresselia can offer its team.</p> <h1>Checks and Counters</h1> <p><strong>Huge Power Pursuit: Despite measures to mitigate Cresselia's weakness to Pursuit, it is still very vulnerable to Huge Power Pursuit users like Mega Gyarados and Yveltal. Even if running additional speed EVs to outpace Yveltal, Cresselia still has to be wary of being trapped while paralyzed or afflicted with a Speed drop from Sticky Web, especially since Cresselia is often the team's cleric and entry hazard remover. Sets lacking Baton Pass have to be played even more carefully in a matchup versus Huge Power Pursuit.</p> <p><strong>Knock Off</strong>: Thanks to its Dark-type weakness, Cresselia is vulnerable to having its Shed Shell removed by Knock Off, leaving it vulnerable to Shadow Tag users, or just being outright KOed by Dark-type Huge Power users.</p> <p><strong>Trick</strong>: Unless it's holding Mail, Trick users can hinder Cresselia for the entirety of the match, forcing it to either use Baton Pass or relinquish momentum.</p> <p><strong>Powerful Mold Breaker Users</strong>: Shell Smash Mold Breakers like Mega Gengar, Mega Tyranitar, Mega Diancie, and Arceus can swap in on nearly every Cresselia set risk free use it as setup fodder. In addition, if Cresselia forgoes King's Shield, it's also forced out without much difficulty by Choice Band Primal Groudon.</p> <p><strong>Prankster Giratina: Like is the case with most defensive Wonder Guard users, Prankster Giratina can come in on virtually every Cresselia set and force it out with Encore, chip it with Will-O-Wisp, or leave it vulnerable to Pursuit trapping with Glare.</p> <p><strong>Unfavorable Matchup</strong>: Despite its impressive bulk, like any Wonder Guard user, Cresselia is still vulnerable to being OHKOed by powerful foes carrying the right coverage such as Beat Up Huge Power Mega Mewtwo X and Bug Buzz Protean Mega Latios. King's Shield variants of Cresselia, however, can scout the aforementioned foes and somewhat mitigate the disadvantage of an unfavorable matchup.</p> ",
    "sets": [
      {
        "name": "Support Wonder Guard",
        "description": "<p>Thanks to its titanic bulk, decent Speed tier, and good pure Psychic typing, Cresselia is an excellent support Wonder Guard user, reliably providing cleric support, Wish passing, entry hazard removal, entry hazard setting, and pivoting support for its teammates. In addition to the utility a pivoting move provides, Baton Pass also allows Cresselia to escape its greatest enemy—Pursuit—provided it is faster than its foe. Thankfully, Cresselia is naturally faster than the most common Pursuit user, Huge Power Mega Gyarados. Alternatively, King's Shield eases Cresselia's matchup versus Pursuit users while also improving Cresselia's matchup against powerful physical foes like Choice Band Mold Breaker Mega Rayquaza. Defog and Aromatherapy are extremely valuable support options on the majority of team structures, but if another teammate is carrying either one, Cresselia can also opt to support its team with Stealth Rock instead. Whirlwind is another option that synergizes well with entry hazards and allows Cresselia to force out Substitute + Baton Pass Wonder Guard users like Xerneas. Finally, recovery is essential for this set to function. Recover's immediate recovery is usually superior on sets lacking King's Shield, while Wish allows Cresselia to support its teammates and has good synergy with both King's Shield and Baton Pass. Shed Shell is the preferred item, as it makes Cresselia much more resilient against Shadow Tag users, requiring a teammate to remove its item with Trick or Knock Off before it can be trapped. A physically defensive EV spread is used to better scout Choice Band Mold Breaker users, as Cresselia's typing and natural bulk allow it to switch into the likes of Choice Specs Mega Mewtwo Y and Mega Rayquaza once even without investment. A Bold Nature and 31 Speed IVs allow Cresselia to outspeed opposing Mega Gyarados with no Speed EVs, allowing it to escape Mega Gyarados's Pursuit with Baton Pass. Alternatively, if vulnerability to Pursuit trappers isn't a concern, a Relaxed nature and 0 Speed IVs can be used to allow Cresselia to underspeed other common slow pivots such as Xerneas and Primal Kyogre.</p> <p>Like is the case with all support Wonder Guard users, most teams benefit from the utility Cresselia can provide in the form of Aromatherapy, entry hazard removal or setting, pivoting, and Wish passing. In addition, Cresselia can also support Huge Power or Protean teammates lacking a Dark-, Bug-, or Ghost-type attack as a switch-in for them against Imposter users. Cresselia can similarly support Choice Specs Mega Mewtwo Y and Mega Rayquaza against Imposter users. Wonder Guard Xerneas is a particularly notable teammate for Cresselia, as it has an excellent matchup against Huge Power Mega Gyarados and other Pursuit trappers in addition to forming a strong Wonder Guard core with it. Alternatively, Cresselia can also pair well with offensive Wonder Guard users like Mega Lucario and Shell Smash Xerneas thanks to their positive matchup into Pursuit users, as well as Cresselia's own ability to effectively compress the roles of cleric and defogger. Offensive Shadow Tag users that aren't weak to Water, such as a Choice Band Mega Mewtwo X, also make effective teammates for Cresselia, as they can trap and remove the aforementioned Mega Gyarados. Ironically, Cresselia's greatest nemeses—Huge Power Dark-types like Mega Gyarados, Mega Tyranitar, and Yveltal—are also stellar teammates for it, serving as offensive checks against Shell Smash Mold Breaker users, especially with Sucker Punch. Similarly, -ate Speed users such as Mega Rayquaza and Mega Abomasnow are also excellent teammates for that same ability to check and revenge kill Shell Smash Mold Breaker users. In addition, -ate Speed users are excellent entry hazard setters and can either form a entry hazard stacking core with Cresselia or free up a moveslot for Whirlwind or other utility move.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 515077, "username": "Mbouchon"}, {"user_id": 226455, "username": "berry"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 562267, "username": "Daylight"}]}
  },
  "Audino": {
    "comments": "<h1>Other Options</h1> <p>Mega Audino can run Knock Off to fully dismantle Mega Gengar, weaken opposing Mega Latios, and remove Prankster Giratina's Safety Goggles for offensive teammates running Spore. Whirlwind and Perish Song are options that can be used when threatening Mold Breaker sweepers like Primal Groudon try to switch into Mega Audino or when Wonder Guard users like Xerneas try to pass a Substitute to a teammate. This isn't as common because Mega Audino can either just predict a switch and pivot to Pokemon more suited to deal with sweepers, or it can be pressured by the Mold Breaker sweeper through continuous status infliction. U-turn is an alternative pivot move that can maintain momentum against Taunt users such as Mold Breaker Primal Groudon and slightly chip physically frail Mold Breaker users coming in, such as Mega Mewtwo Y. However, the loss of momentum against opposing Wonder Guard users usually isn't worth it. A Lum Berry can help Mega Audino heal from sleep or bad poison from Toxic Spikes, but its one-time use can prove inefficient. Wonder Guard is best for longevity, but Prankster and Magic Bounce give Mega Audino more flexibility to run support moves. OHKO moves can be useful as a shock factor to offensive threats and can OHKO opposing No Guard users, but they almost always aren't worth running due to being inconsistent. Mega Audino can also use hazards to punish opposing switch-ins. Lastly, Mega Audino can run a variety of other support moves like Glare, Chatter, and Will-O-Wisp to help advance its teammates further.</p> <h1>Checks and Counters</h1> <p><strong>Unfavorable Matchup: Various Pokemon including Huge Power Mega Mewtwo X, Protean Mega Latios, Protean Mega Mewtwo Y, and Wonder Guard Xerneas often run super effective coverage moves against Mega Audino to force it out.</p> <p><strong>Giratina</strong>: Giratina can be sent out against Mega Audino to run Curse against it, as Curse can be passed by Baton Pass. Additionally, a Giratina with Magic Bounce would not be able to let Mega Audino run Parting Shot in to escape and a Prankster Giratina can force Mega Audino out with Encore. However, Prankster Giratina must be careful when using Curse against Mega Audino with Parting Shot, as Mega Audino using the move the same turn Giratina uses Curse prevents Curse from affecting it, while Giratina is left less healthy.</p> <p><strong>Mold Breaker Shell Smash Users</strong>: Mold Breaker users carrying Shell Smash can use Mega Audino's passivity to set up on it. They can also put Mega Audino to sleep with Spore or Dark Void—the former requires Safety Goggles to block more than once, while the latter cannot be consistently blocked by any item—or inflict chip damage with a powerful attack. However, some Mold Breaker users, such as Mega Gengar lacking a Poison-type STAB move, struggle to get past Mega Audino without getting lucky with sleep.</p> <p><strong>Shadow Tag Perish Trappers</strong>: Mega Audino without Shed Shell is very vulnerable to removal by Shadow Tag users. If swapped in on any move bar Baton Pass or Parting Shot, the Shadow Tag user can Encore Mega Audino, set three layers of Spikes, and remove it with Perish Song.</p> <p><strong>Taunt Users</strong>: Taunt shuts down all Mega Audino sets bar those using U-turn, Magic Coat, or non-status utility moves like Nuzzle and Knock Off.</p> ",
    "sets": [
      {
        "name": "Wonder Guard Support",
        "description": "<p>Though it has an opportunity cost in not being able to be run with Wonder Guard Xerneas, Mega Audino is a premier Wonder Guard user in the Pure Hackmons metagame due to having an amazing defensive typing, being a very slow pivot, and being able to soft-check the likes of Mega Gengar lacking a Poison-type STAB move and Mega Latios lacking Shell Smash. Mega Audino can make use of either Recover to keep itself healthy or Wish with its high HP stat to keep both its teammates and itself healthy, though relying on Wish to heal makes it significantly more difficult to retain momentum. Aromatherapy and Defog are two of the best forms of support any defensive Wonder Guard user can offer its teammates. The former cures Mega Audino and its teammates of status ailments that they would otherwise be annoyed with, while the latter helps to minimize the amount of chip damage that offensive teammates take over the course of the game. King's Shield gives Mega Audino the chance to scout offensive Pokemon that like to switch into it, such as Huge Power Mega Mewtwo X and Mold Breaker Mega Rayquaza, as well as allowing Mega Audino to force out many variants of said switch-ins after an Attack drop. Magic Coat helps Mega Audino's longevity by reflecting back status-inflicting moves like Spore, Dark Void, Will-O-Wisp, and Glare, as well as moves that would otherwise force Mega Audino out, like Taunt and Encore. A pivoting move is almost always required for Mega Audino to retain momentum for its team; Parting Shot is a solid option that can weaken offensive switch-ins, but it causes Mega Audino to struggle to maintain momentum against teams with a Magic Bounce user; however, Baton Pass is the preferred option due to its high PP and freedom pivoting. Mega Audino wants to be as physically bulky as possible in order to scout and pivot out of powerful physical attackers such as Mega Mewtwo X and Primal Groudon; a Relaxed nature with maximum HP and Defense investment and minimum Speed IVs help Mega Audino perform this function of a defensive cleric, soft-check specific Mold Breaker users, and act as a slow pivot. Shed Shell is the preferred item to prevent Mega Audino from being removed by Shadow Tag users, while Safety Goggles helps Mega Audino against Spore users like Mold Breaker users and Prankster Giratina.</p> <p>Mega Audino should only be used in rare semi-stall teams, bulky balance teams, and teams with enough offensive pressure to prefer the defensive roles Xerneas cannot perform as well in. Semi-stall is rare due to limits in teambuilding, but these teams can have Ho-Oh and Mega Steelix cover Mega Audino's weaknesses. Glass cannons, such as Mold Breaker Mega Gengar, Mold Breaker Mega Diancie, and Choice Band Mold Breaker Mega Rayquaza, appreciate Mega Audino's ability to bring them onto the field safely. In addition, these Pokemon also all appreciate Mega Audino's ability to clear entry hazards and cure status. Mega Audino also Imposter-proofs most offensive teammates lacking Poison-type and Steel-type moves, including Mold Breakers like Mega Rayquaza, Mega Latios, Dialga, and Mega Tyranitar. Mega Audino's vulnerability to Mold Breaker Primal Groudon and coverage attackers like Mega Mewtwo X and Mega Latios in an unfavorable matchup makes -ate Speed users like Mega Rayquaza, Kyurem-B, and Mega Abomasnow valuable teammates. Notably, Mega Abomasnow is able to revenge kill the majority of Primal Groudon sets thanks to its resistance to Thousand Arrows, a powerful Boomburst, and Primal Groudon not being able to fit in a Fire-type STAB move and King's Shield on the same set. Mega Audino appreciates being part of most Wonder Guard cores. Cresselia, Mega Scizor, and Mega Manectric are all great examples of solid Wonder Guard partners, since Mega Audino compresses a lot of utility into one teamslot and carries distinct weaknesses. SubPass Wonder Guard users like Mega Swampert and Primal Groudon make for strong partners, since they appreciate the support Wish Mega Audino gives while providing the main support Mega Audino cannot offer. Offensive Shell Smash Wonder Guard sweepers like Mega Lucario and Primal Groudon also pair well with it. Finally, King's Shield Mega Audino can form a solid Wonder Guard core with Wonder Guard users weak to contact moves like Blissey and specially defensive Primal Kyogre.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 562267, "username": "Daylight"}, {"user_id": 569731, "username": "ntothen"}, {"user_id": 515077, "username": "Mbouchon"}]}, {"name": "Grammar checked by", "members": [{"user_id": 241023, "username": "Kris"}]}], "writtenBy": [{"user_id": 235009, "username": "Ransei"}]}
  },
  "Kyurem-Black": {
    "comments": "<h1>Other Options</h1> <p>Kyurem-B can also opt to run a physical coverage move like Gunk Shot, Freeze-Dry, Close Combat, or Thousand Arrows to hit unsuspecting Wonder Guard users that would switch in to block its Ice-type STAB moves. Spikes, Toxic Spikes, or Sticky Web can replace Stealth Rock. Will-O-Wisp can also replace it to status and chip Wonder Guard users that switch in. A Brave nature with 0 Speed IVs can be used on Boomburst sets to move slower than some Wonder Guard users' pivots. Kyurem-B can also run King's Shield because all of its main competitors (Regigigas, Slaking, Mega Diancie, and Mega Rayquaza) tend to outspeed it. It can then threaten to beat any of these one-on-one if they lack a King's Shield and Boomburst of their own.</p> <h1>Checks and Counters</h1> <p><strong>Wonder Guard: Because Kyurem-B usually forgoes running coverage, Wonder Guard Pokemon aren't afraid of it, and some can even set up in front of it. However, Kyurem-B sets running Gastro Acid can circumvent this to an extent, as once Wonder Guard is removed, most Wonder Guard users are forced out, granting the Kyurem-B user momentum.</p> <p><strong>Other Priority Users</strong>: In a one-on-one scenario, faster -ate Speed users, like Mega Diancie and Mega Rayquaza, are able to outspeed Kyurem and hit hard with Fake Out into Extreme Speed.</p> <p><strong>King's Shield + Mold Breaker Sweepers: Bulky Mold Breaker sweepers that run King's Shield, such as Primal Groudon, Mega Tyranitar, and Dialga, force Kyurem-B to play mind games every time they set up and Kyurem-B comes in. Primal Groudon is particularly threatening, as it has exceptional physical bulk for a Shell Smash sweeper and can run a sleep move and King's Shield on the same set viably.</p> <p><strong>Offensive Shadow Tag Users: Shadow Tag Primal Groudon and Mega Mewtwo X can punish Kyurem-B heavily by surviving an Extreme Speed and attacking back with their strong attacks, like V-create and Drain Punch.</p> <p><strong>Bulky Steel-types: Pokemon like Magic Bounce Registeel and Mega Steelix have high Defense to absorb Kyurem-B's attacks with ease, removing any progress it makes with their recovery.</p> ",
    "sets": [
      {
        "name": "Refrigerate",
        "description": "<p>Through its use of priority Ice-type STAB attacks, Refrigerate Kyurem-B acts as an effective revenge killer, sweep-stopper, and general offensive powerhouse. Fake Out + Extreme Speed can easily dispatch most No Guard users and Shell Smash sweepers lacking King's Shield, as well as chunking bulky Ice-weak support Pokemon like Giratina. Boomburst can be used to damage sweepers behind Substitute, as well as immediately threatening Magic Bounce Giratina and unboosted Primal Groudon. Pursuit gives Kyurem-B the option to punish physically frail foes, like Mega Gengar and Mega Latios, on a switch out. Sacred Fire is an option to threaten bulky Steel-types like Mega Scizor, Registeel, and Mega Steelix, which makes Stealth Rock easier to use in matchups against said foes. Stealth Rock itself is a great way to punish switches. Finally, Gastro Acid instead lets Kyurem-B force most Wonder Guard Pokemon out, escape offensive Shadow Tag users, and remove Mold Breaker from sweepers running King's Shield if it predicts correctly. Lum Berry is used to avoid sleep from Mold Breaker sweepers once and dodge other status if they aren't in play, while Icicle Plate buffs Kyurem-B's Ice-type moves and gives it the power to KO Giratina with Boomburst after Stealth Rock. On sets running Boomburst, a Naughty nature is preferred to avoid lowering Kyurem-B's Special Attack; otherwise, an Adamant nature is preferred. Maximum Defense investment allows it to survive one V-create or Thousand Arrows from boosted Primal Groudon at full.</p> <p>Kyurem-B fits best on offensive teams that appreciate it revenge killing frailer threats that outspeed its teammates. Kyurem-B's largest weakness is its inability to consistently damage Wonder Guard users because of its narrow coverage. Because of this, it benefits greatly from Mold Breaker teammates like Mega Gengar, Pokemon that use a wide variety of coverage moves like offensive Wonder Guard Xerneas, and Perish Song trappers like Lugia. Choice Scarf + No Guard Mega Mewtwo X and Mega Mewtwo Y can help the matchup against Primal Groudon. Additionally, special attackers like the Mega Mewtwo Y or Mega Gengar can stop physical walls from walling Kyurem-B out. Finally, due to its Stealth Rock weakness, Defog support is needed to maximize its longevity when switching in to revenge kill.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 515077, "username": "Mbouchon"}, {"user_id": 235009, "username": "Ransei"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}], "writtenBy": [{"user_id": 226455, "username": "berry"}]}
  },
  "Meloetta": {
    "comments": "<h1>Other Options</h1> <p>An alternate EV Spread of 248 HP / 28 Def / 232 SpD with a Calm nature maximizes Meloetta's special bulk while allowing it to avoid the 2HKO from Mold Breaker Mega Gengar's Secret Sword after Stealth Rock. 76 Speed EVs can be used outpace Huge Power Yveltal and escape its Pursuit, though doing so cuts into Meloetta's chance of surviving attacks from Mold Breaker users like Mega Gengar and usually isn't worth it due to Huge Power Yveltal's relative rarity. Colbur Berry is an option on physically defensive sets, allowing it to avoid the Pursuit trapper mind game once. Safety Goggles and Chesto Berry are options that can improve Meloetta's matchup against Mold Breaker users using Spore and Dark Void, respectively. Mail is a final option that makes Meloetta immune to Trick. All these options, however, leave Meloetta vulnerable to Shadow Tag users like Perish Song Lugia and Choice Band Mega Mewtwo X.</p> <p>Psystrike is a decent option that OHKOes Mega Gengar, even without investment, making it a much more reliable check—especially alongside Chesto Berry or Safety Goggles—though it has little utility outside of hitting Mega Gengar. Glare is another option that, like Whirlwind, makes Meloetta a situational check to some special Shell Smash Mold Breaker or Wonder Guard sweepers. Perish Song is an alternative to Whirlwind that fares better versus Magic Bounce Substitute + Baton Pass users like Giratina. Nuzzle and Chatter are niche options that can disrupt opposing sweepers and also make Meloetta less vulnerable to Taunt users. Steam Eruption is an option to OHKO standard Primal Groudon, but has little utility otherwise. Parting Shot and U-Turn are alternate pivoting options over Baton Pass. However, the former cedes momentum Magic Bounce users, the latter cedes momentum to Wonder Guard users, and, unlike Baton Pass, neither move evades a slower Pursuit. Finally, Magic Coat is an option to reflect sleep moves from Mold Breaker users, Stealth Rock from -ate Speed users, and Sing, Gastro Acid, Taunt, and Spider Web from No Guard users.</p> <h1>Checks and Counters</h1> <p><strong>Huge Power Pursuit: Despite King's Shield and Baton Pass mitigating Meloetta's weakness to Pursuit, it still has to be wary of being Pursuit trapped while paralyzed, when facing the uncommon but relevant Sticky Web, and when facing faster Pursuit users—particularly since Meloetta is often its team's cleric or entry hazard remover.</p> <p><strong>Powerful Mold Breaker Users</strong>: Shell Smash Mold Breakers like Primal Groudon, Mega Tyranitar, and Arceus set up safely on any Meloetta set not carrying Whirlwind or niche options like Glare or Chatter. In addition, if Meloetta forgoes King's Shield, it's also forced out by powerful physical attackers like Choice Band Primal Groudon and Mega Rayquaza.</p> <p><strong>Unfavorable Matchup: Like any Wonder Guard user, Meloetta is vulnerable to powerful Huge Power, Protean, and Parental Bond attackers carrying the right coverage moves—such as Beat Up Huge Power Mega Mewtwo X and Bug Buzz Protean Mega Latios.</p> <p><strong>Knock Off: Meloetta is vulnerable to Knock Off, which either removes its Shed Shell, leaving it vulnerable to Shadow Tag users, or KOes it outright.</p> <p><strong>Trick</strong>: Unless it's holding Mail, Trick users can hinder Meloetta for the entirety of the match, forcing it to either use Baton Pass or relinquish momentum.</p> <p><strong>Prankster Giratina</strong>: As is the case with the majority of support Wonder Guard users, Prankster Giratina can force Meloetta out with Encore and chip it with Will-O-Wisp and Curse. Additionally, Giratina's Glare can also leave Meloetta vulnerable to slower Pursuit users it would ordinarily evade.</p> <p><strong>Taunt</strong>: Taunt forces out nearly all Meloetta sets. Even those making use of niche options like Psystrike or Nuzzle become limited in their ability to maintain momentum and support their team.</p> ",
    "sets": [
      {
        "name": "Wonder Guard Support",
        "description": "<p>Meloetta's unique typing, good bulk, and flexible Speed tier make it a strong option for a support Wonder Guard user. Baton Pass allows Meloetta to provide pivoting support to its teammates while also escaping slower Pursuit users, such as Huge Power Mega Gyarados. King's Shield is an alternative that can similarly ease Meloetta's matchup versus Pursuit users while also letting it scout for its team and improving its one-on-one matchup versus powerful physical threats like Choice Band Mold Breaker Primal Groudon. Defog and Aromatherapy are valuable support options for nearly every team composition. However, if a teammate is carrying either or both, Meloetta can make use of other utility options like Whirlwind and Stealth Rock. Notably, Whirlwind can make Meloetta a situational check to many special Shell Smash Mold Breaker and Wonder Guard sweepers, as well as force out Substitute + Baton Pass users like the ever popular Wonder Guard Xerneas. Finally, recovery is essential for Meloetta to function effectively. Recover's immediacy and reliability is generally preferred, but Wish is an alternative that allows Meloetta to support its teammates and synergizes well with King's Shield and Baton Pass. Shed Shell is the preferred item, as it makes Meloetta much less susceptible to Shadow Tag users. The given EV spread maximizes Meloetta's physical bulk while also giving it the ability to survive Mold Breaker Mega Gengar's +2 Sludge Wave after Stealth Rock. This is notable, as Meloetta's immunity to Ghost and good bulk allow it to soft check Mold Breaker Mega Gengar whether it's carrying Secret Sword or Sludge Wave. Finally, if Pursuit trappers aren't a concern, Meloetta can make use of a Relaxed nature and 0 Speed IVs to underspeed popular slow pivots like Substitute + Baton Pass Wonder Guard Xerneas.</p> <p>Like is the case with all support Wonder Guard users, Meloetta fits on a wide variety of team structures. Its weakness to Pursuit users means that Meloetta appreciates teammates such as Substitute + Baton Pass Wonder Guard Xerneas, as well as Wonder Guard Shell Smash sweepers like Mega Gardevoir and Mega Lucario. Choice Specs Mold Breaker users, such as Mega Mewtwo Y and Mega Rayquaza, appreciate specially defensive Meloetta's ability to Imposter-proof them thanks to its unique typing and good special bulk. Choice Specs Mold Breaker Mega Mewtwo Y is worth noting in particular, as even physically defensive variants of Meloetta can Imposter-proof it with Whirlwind or by using Baton Pass to pivot to a revenge killer like Sucker Punch Mega Gyarados. Additionally, Pursuit trappers like Huge Power Mega Gyarados and Yveltal are excellent teammates for Meloetta, checking Shell Smash Mold Breakers users and Pursuit trapping Prankster Giratina. Furthermore, Pursuit users can trap Imposter users copying variants of Meloetta lacking Baton Pass. -ate Speed users like Mega Rayquaza and Mega Abomasnow are also helpful teammates for Meloetta, as they force out the majority of Mold Breaker sweepers after being brought in safely by Meloetta's Baton Pass. On bulkier teams, Meloetta can be run alongside another defensive Wonder Guard user, allowing for more flexibility with both their movesets. In particular, Wonder Guard users that can switch into physical attackers for Meloetta, but are perhaps more vulnerable to Mold Breaker Mega Gengar—such as Mega Scizor and Mega Swampert—synergize very well with Meloetta. Finally, offensive Shadow Tag users such as Mega Rayquaza and Mega Mewtwo X are valuable teammates as they can trap the Pursuit trappers that Meloetta fears.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 226455, "username": "berry"}, {"user_id": 515077, "username": "Mbouchon"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 562267, "username": "Daylight"}]}
  },
  "Genesect": {
    "comments": "<h1>Other Options</h1> <p>An EV spread of 252 Atk / 4 SpA / 252 Spe alongside a Naughty nature can be used to OHKO physically defensive Primal Kyogre with +2 Bolt Strike and standard Wonder Guard Xerneas with +2 Gear Grind while still OHKOing Bug / Steel type Wonder Guard users with Techno Blast. However, such a set is largely outclassed by Mega Lucario and Mega Scizor, of which the former has higher Speed, better overall damage output, and can OHKO Primal Groudon at +2 with its Fist Plate Judgment. Genesect has a few other viable coverage options available to it; Scald OHKOes most variants of Primal Groudon without needing to boost first, Aura Sphere hits Normal-type Wonder Guard users not named Blissey or Chansey harder than Secret Sword, Night Daze hits Wonder Guard Dusclops, Knock Off removes items and hits Psychic-type Wonder Guard users, and Giga Drain hits Water-type Wonder Guard users like Mega Swampert while also providing recovery. Finally, Flame Plate and Judgment are options over Burn Drive and Techno Blast if Judgment’s greater PP is valued more than the immunity to item removal that Burn Drive grants.</p> <h1>Checks and Counters</h1> <p><strong>Fire-type Coverage: A quadruple weakness to Fire and below average bulk means that Genesect drops to even relatively weak Fire-type attacks. Furthermore, Sacred Fire, V-Create, Searing Shot, and Lava Plume are all very common coverage moves on Huge Power, Protean, Parental Bond, and opposing Shell Smash + Wonder Guard users.</p> <p><strong>Powerful Mold Breaker Users</strong>: A weakness to powerful Mold Breaker users like Primal Groudon and Mega Rayquaza isn't unique to Genesect. However, unlike other Wonder Guard + Shell Smash sweepers like Mega Gardevoir and Mega Lucario, Genesect's comparatively low Special Attack means that it cannot OHKO many Mold Breaker users even after a Shell Smash depending on its coverage moves, leaving it vulnerable to being OHKOed in return.</p> <p><strong>Opposing Wonder Guard: Wonder Guard sweepers are inherently matchup dependent, so Wonder Guard users Genesect's coverage can’t touch will force it out.</p> <p><strong>Prankster Giratina</strong>: Genesect's relatively low Special Attack for a Wonder Guard + Shell Smash sweeper means that Giratina can easily switch in and force an unboosted Genesect out. In particular, Haze variants of Giratina can wall Genesect almost endlessly, barring an unlucky freeze from Freeze-Dry. Once Genesect is neutralized with Encore or Haze, Giratina can also chip it with Will-O-Wisp or remove its sweeping potential with Glare.</p> <p><strong>Offensive Shadow Tag Users</strong>: Genesect's lack of a Shed Shell leaves it vulnerable to offensive Shadow Tag users like Mega Mewtwo Y, Mega Mewtwo X, and Primal Groudon. However, they cannot consistently check a boosted Genesect depending on its coverage moves; +2 Bug Buzz OHKOes Mega Mewtwo Y, +2 Moonblast OHKOes Mega Mewtwo X, and +2 Earth Power OHKOes Primal Groudon.</p> ",
    "sets": [
      {
        "name": "Shell Smash Wonder Guard",
        "description": "<p>Genesect's good Special Attack, solid Bug / Steel typing, and unique interaction with Burn Drive make it a decent option for a Wonder Guard Shell Smash sweeper. Techno Blast and Burn Drive allow Genesect to both Imposter-proof itself and OHKO opposing Bug / Steel Wonder Guard users. Additionally, Burn Drive grants Genesect an immunity to Trick without sacrificing its ability to beat Imposter users—a property that only Fist Plate Arceus shares among Wonder Guard Shell Smash sweepers. The remaining two moveslots are devoted to coverage moves to hit as many Wonder Guard users as possible. Flash Cannon is a decently powerful Steel-type STAB that hits Xerneas, Mega Audino, and Mega Gardevoir. Earth Power hits Mega Manectric and Mega Lucario, in addition to OHKOing Primal Groudon at +2. Secret Sword hits Normal-type Wonder Guard users like Slaking and Blissey. Freeze-Dry hits Water-type Wonder Guard users like Primal Kyogre and Gyarados, as well as 2HKOes standard Giratina at +2. Grass Knot similarly hits Water-type Wonder Guard users, excluding Gyarados, but its situationally higher Base Power improves its matchup versus foes like Whirlwind Kyogre. Moonblast has good neutral coverage and at +2 OHKOes Wonder Guard Mega Sableye and Mega Mewtwo X and 2HKOes Giratina. Bug Buzz is another STAB option that allows Genesect to break through Psychic-type Wonder Guard users like Mega Mewtwo Y, Cresselia, Meloetta, and Deoxys-S—notably bypassing Substitute + Baton Pass Mega Mewtwo Y and Deoxys-S's Substitutes. Alternatively, Genesect can make use of Gastro Acid to break through any Wonder Guard user that can't immediately KO it or force it out with Whirlwind. However, Gastro Acid essentially restricts Genesect's final coverage option to either Freeze-Dry or Moonblast, else it is unable to break through Prankster Giratina.</p> <p>Genesect fits best on balance and offense teams as a late-game wincon. Offensive Shadow Tag users like Mega Mewtwo X and Mega Mewtwo Y make excellent teammates for their ability to trap and KO opposing Wonder Guard users that frequently forgo Shed Shell, such as Xerneas, Mega Gardevoir, and Mega Manectric. Choice item Mold Breaker users like Primal Groudon and Mega Rayquaza also make excellent teammates for their ability to blow holes in opposing Wonder Guard cores. In particular, Choice Band Primal Groudon is notable for its ability to essentially delete the majority of opposing Wonder Guard users with its STAB V-create. No Guard users such as Mega Mewtwo Y and Mega Aerodactyl are helpful teammates, (comma) as they provide Genesect with an abundance of free turns to use Shell Smash, in addition to forcing out Prankster Giratina. Similarly, Huge Power Pursuit users are valuable teammates for their ability to Pursuit trap Prankster Giratina, as well as the Choice item Shadow Tag users that like to switch into Genesect. Refrigerate and Pixilate users like Mega Abomasnow and Mega Diancie are likewise noteworthy teammates for their ability to force out Giratina with their powerful Boomburst. In particular, Mega Abomasnow is notable for its ability to revenge kill many variants of Primal Groudon, which most Genesect sets struggle against even while boosted. Furthermore, -ate Speed users make excellent entry hazard setters, and Genesect appreciates entry hazard support to turn some of its favorable rolls, such as +2 Grass Knot versus physically defensive Kyogre, into guaranteed KOs, improving its overall effectiveness as a wincon. Finally, Aromatherapy, Defog, and Wish support from defensive Wonder Guard teammates is greatly appreciated to offset any chip damage or status conditions Genesect might acquire during a game, easing its job as a late-game cleaner.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 226455, "username": "berry"}, {"user_id": 515077, "username": "Mbouchon"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 562267, "username": "Daylight"}]}
  },
  "Xerneas": {
    "comments": "<h1>Other Options</h1> <p>Substitute + Baton Pass Xerneas is extremely versatile, with many available options for the first moveslot. Shell Smash is a great option, as it sharply increases both offensive stats and Speed which it can then pass to a teammate. If running Shell Smash, an alternative spread of 248 HP / 184 SpA / 76 Spe with a Modest nature ensures that Xerneas outspeeds Deoxys-S lacking Choice Scarf after a Shell Smash. Alternative support for the rest of the team, namely Defog and Aromatherapy, are also decent options. Spikes is a workable option over Stealth Rock, as two of the most prominent Flying-types, Mega Rayquaza and Yveltal, are both weak to Moonblast; Toxic Spikes and Sticky Web provide great support as well, although Mega Gengar or Wonder Guard Poison-types like Skuntank and Drapion can come in and soak up Toxic Spikes without much difficulty. Steam Eruption is workable coverage that allows Xerneas to OHKO Primal Groudon, though it doesn't threaten much apart from Primal Groudon; if running Steam Eruption, an alternative spread of 72 HP / 252 SpA / 184 Spe with a Modest nature allows Xerneas to outspeed and OHKO Adamant Primal Groudon. Wish is an option over Recover, taking advantage of Xerneas's large HP stat to heal large portions of teammates' health, but running it makes it more difficult for Xerneas to heal itself safely. King's Shield is a niche option that allows Xerneas to force out Choice Band Mold Breaker Mega Rayquaza, as it is OHKOed by Dragon Ascent with minimal chip otherwise. Spore is usable over Dark Void due to its higher accuracy, but doesn't affect passive Wonder Guard users with Safety Goggles like Primal Kyogre and Cresselia; Safety Goggles is an option on Xerneas if running Spore. Knock Off is a fringe option that potentially removes Leftovers and Lum Berry from Primal Groudon and threatens Plate users like Mega Gengar, Mold Breaker Mega Diancie, and Dialga if Xerneas has a Substitute up. Magic Coat helps to burn Prankster Giratina's Encore PP and bounces back Whirlwinds, but faces stiff competition from Taunt. Gastro Acid can be used on the switch to remove Mold Breaker users' ability, allowing Xerneas a free turn to set up Substitute in most instances. Finally, Mail can be run on Xerneas to prevent Trick users from crippling it, but sets running Mail are generally forced into running Recover in the first moveslot.</p> <p>Mold Breaker Xerneas can effectively make use of Dark Void or Taunt as alternatives to Spore on sets with Pixie Plate Judgment as their only attack. However, they make Imposter-proofing more difficult; the former requires a Ghost-type teammate with Flame Orb— such as Level 2 Wonder Guard Sableye—while the latter requires an all out attacking Ghost-type teammate. Xerneas can also make use of Earth Power over Steam Eruption for mostly similar neutral coverage, letting it 2HKO Registeel and OHKO Primal Groudon after Shell Smash at the cost of failing to OHKO Primal Groudon before Shell Smash and greater difficulty breaking through Ho-Oh. Xerneas can similarly make use of Fire coverage like Searing Shot or Blue Flare to hit defensive Steel- and Poison-types like Registeel and Mega Venusaur, but such threats are uncommon and doing so leaves Xerneas walled by Ho-Oh and Primal Groudon and without either the additional survivability of King’s Shield or the utility of Spore. Secret Sword is an option that OHKOes Blissey at +0 and 2HKOes Eviolite Chansey and Registeel at +2—all of which can switch into Mold Breaker Xerneas and can force it out with Whirlwind or deprive it of its Pixie Plate with Knock Off—but has limited utility otherwise. Recover and Substitute are alternatives to King's Shield that similarly augment Xerneas's survivability; the former allows for Mold Breaker Xerneas to potentially set up multiple times during a game, while the latter preemptively protects Xerneas against both status and revenge killers. Stealth Rock and other entry hazards are decent options on single attack sets. Volt Switch and U-turn are options over King's Shield or Steam Eruption that take advantage of Mold Breaker to maintain momentum. Sets utilizing Moonblast over Pixie Plate Judgment allow Xerneas to make use of items like Leftovers, Lum Berry, Mental Herb, Shed Shell, and Safety Goggles. However, the loss in power is noticeable and forgoing Judgment makes Xerneas more difficult to Imposter-proof.</p> <h1>Checks and Counters</h1> <p><strong>Primal Groudon: Mold Breaker Primal Groudon, especially variants running Leftovers, can force Xerneas out with relative ease due to its resistance to Moonblast and offensive presence. However, Xerneas sets running Glare and Dark Void can cripple Primal Groudon sets not running Lum Berry, and rare Steam Eruption sets OHKO it.</p> <p><strong>Choice Item Mold Breaker Users</strong>: Choice item Mold Breaker Pokemon, especially ones with extremely powerful STAB moves like Primal Groudon, Mega Rayquaza, and Mega Mewtwo Y, are generally powerful enough to force Xerneas out. However, they can usually only come in on slow pivoting, as most Choice item Mold Breaker users must be wary of Xerneas's Moonblast.</p> <p><strong>Shadow Tag Users: Shadow Tag users can trap Xerneas, which primarily runs Leftovers, and eliminate it one way or another. Bulky perish trappers, like Lugia and Arceus, can set up three layers of Spikes and remove Xerneas if pivoted in on when Xerneas uses anything bar Glare, Dark Void, or Baton Pass. Offensive Shadow Tag users, most notable among them Mega Mewtwo X, can KO Xerneas with coverage moves like Gunk Shot, Gear Grind, or Sludge Wave. However, Shadow Tag users require pivoting to get in safely against sets running Glare or Dark Void, and often only secures a KO against Xerneas users that play carelessly. Xerneas variants running Shed Shell are much more resistant to Shadow Tag users, and require considerable support to threaten.</p> <p><strong>Trick Users: Trick users, especially Pokemon that Xerneas ordinarily comes in on like No Guard users, Wonder Guard Mega Beedrill, and rare Choice item Wonder Guard users, can severely hinder Xerneas's ability to support its team by giving it a detrimental item. Choice items virtually force Xerneas into using Baton Pass, due to losing momentum if using any other move, and Black Sludge effectively puts it on a timer. However, rare Mail variants are immune to Trick.</p> <p><strong>Whirlwind Wonder Guard Users: Wonder Guard users running Whirlwind, such as Primal Kyogre, Slaking, and Cresselia, can force Xerneas out and disrupt its ability to pass Substitutes to teammates. However, Xerneas can somewhat circumvent this if it is running Glare, as it can pass Substitutes if the foe is fully paralyzed for one turn.</p> <p><strong>Magic Bounce Users Not Weak To Moonblast: While fairly rare, Magic Bounce users that resist Moonblast, such as Registeel, Mega Steelix, and Mega Venusaur, can prevent most Xerneas sets from supporting its team through any means other than passing a Substitute. However, these Magic Bounce users are generally setup bait for Xerneas sets running Shell Smash unless they run Perish Song.</p> <p><strong>Wonder Guard Shell Smash Sweepers: Three of the best Wonder Guard Shell Smash sweepers are Xerneas, Mega Gardevoir, and Mega Lucario, and virtually every single Shell Smash set runs coverage for Fairy-type Wonder Guard users like Xerneas and Mega Audino. However, in a 1v1 scenario, Xerneas variants with Glare can survive a hit and cripple the opposing Wonder Guard Shell Smash user with paralysis.</p> <p><strong>Unfavorable Matchup: If the Xerneas user gets an unfavorable matchup against opposing Huge Power, Protean, or rare Parental Bond users, careful play must be accomplished to bring either Prankster Giratina or a powerful revenge killer, such as Sucker Punch Mega Gyarados, in and force the offensive Pokemon out. While rare, No Guard sets fishing for coverage, if granted a favorable matchup, require extremely offensive play by revenge killers and Mold Breaker users to have a chance at winning before the opponent does.</p> <p><strong>Item Removal: Most Mold Breaker Xerneas sets are extremely reliant on Pixie Plate and item removal in the form of either Trick or Knock Off is nearly akin to KOing Xerneas.</p> <p><strong>Special Walls</strong>: Extremely specially bulky Pokemon like Blissey, Eviolite Chansey, Registeel, and the rare RegenVest Primal Kyogre can stomach even boosted Judgments from Mold Breaker Xerneas and force it out with Whirlwind or remove its Pixie Plate with Knock Off. Niche Poison Heal + Toxic Orb variants of such Pokemon are even more problematic for Mold Breaker Xerneas, as it can't make use of sleep luck to break past them. Magic Guard + Toxic Orb Ho-Oh is probably the most effective stop to Mold Breaker Xerneas sets that forgo Steam Eruption; its excellent natural special bulk, resistance to Fairy, and immunity to sleep thanks to Toxic Orb means Xerneas needs at least four turns to break Ho-Oh, giving it ample time to force Xerneas out with Whirlwind or Perish Song. Although extremely niche, Mega Venusaur can similarly put a stop to all but rare Fire coverage sets thanks to its good bulk, resistance to both Fairy and Water, and it’s immunity to Spore.</p> <p><strong>Plate Imposter Users</strong>: Though extremely niche, Iron Plate, Spooky Plate, and Pixie Plate Imposter users directly counter the most common methods of Imposter-proofing Mold Breaker Xerneas.</p> ",
    "sets": [
      {
        "name": "Substitute + Baton Pass Wonder Guard",
        "description": "<p>Wonder Guard Xerneas is the most threatening and versatile Wonder Guard user in the metagame thanks to its great defensive and offensive typing, respectable offensive stats, and versatile Speed tier. The first moveslot is extremely customizable, as Xerneas's offensive typing forces out most Magic Bounce users. Stealth Rock provides a way to chip opposing switch-ins, while Glare often nets free turns and can make Shell Smash sweepers more manageable by sharply reducing their Speed. While Recover faces stiff competition from the aforementioned two moves and isn't as easy to justify on Leftovers variants, it is nevertheless an excellent option on Shed Shell sets due to greatly increasing Xerneas's longevity. Taunt prevents Wonder Guard users from phasing Xerneas with Whirlwind and Prankster users from preventing Xerneas from passing Substitutes to teammates; Dark Void generates even more free turns than Glare does, although it's not as accurate and a well-timed Magic Bounce switch in puts Xerneas to sleep instead. Substitute, in tandem with Baton Pass, almost always allows Mold Breaker teammates one extra turn to safely set up, disrupt its check, or heavily damage opposing switch-ins. Baton Pass in itself is also a fantastic option, as Xerneas's offensive presence forces a wide variety of metagame threats out, often generating momentum for its team. Moonblast sets Xerneas apart from most other Wonder Guard users, as it's an amazing STAB option that threatens Giratina, Mega Rayquaza, Mega Mewtwo X lacking coverage for Xerneas, and weakened Mega Latios, allowing Xerneas to force opposing Wonder Guard users in in a wide variety of situations. Leftovers is generally preferred to allow for passive recovery on Xerneas and synergizes well with Substitute; Shed Shell can be run on Recover sets, however, as it prevents Xerneas from being easily removed by offensive Shadow Tag users. The given spread maximizes Xerneas's bulk, as well as Substitute's HP amount, while also forcing Pokemon weak to Fairy-type attacks out, such as Prankster Giratina, Mega Mewtwo X, and Mega Rayquaza; minimum Speed maximizes Baton Pass's effectiveness, as pivoting after the opposing Pokemon moves ensures that the user's switch-in comes in safely.</p> <p>Substitute + Baton Pass Xerneas works best on balance and bulky offense builds with teammates that appreciate being passed a Substitute, as well as defensive teammates that take care of what threatens Xerneas. In particular, the ubiquitous Primal Groudon + Giratina + Wonder Guard Xerneas core works extremely well, as Xerneas can pass Substitutes to Primal Groudon, Primal Groudon forces opposing Giratina in, and Giratina comes in on Huge Power-boosted Poison- and Steel-type attacks while simultaneously Imposter-proofing most Primal Groudon sets. Special Mold Breaker users, especially physically frailer ones like Mega Gengar, Mega Latios, Mega Diancie, and Mega Sceptile, also appreciate Substitute + Baton Pass support from Xerneas. Additionally, Xerneas also fits well on dual Mega Mewtwo X teams, as Mega Mewtwo X dislikes having to risk taking damage from Sucker Punch Mega Gyarados, being chipped by Shadow Tag Slaking and Regigigas, and, on sets lacking Lum Berry, getting burned by Prankster Giratina. Xerneas's most common switch-in in Primal Groudon can be taken advantage of by running defensive checks such as Prankster Giratina or the rare Mega Slowbro, offensive checks like Huge Power Mega Gyarados, or soft-checks that are also good support options like physically defensive Wonder Guard Primal Kyogre. Good revenge-killers to Primal Groudon, such as the aforementioned Mega Gyarados, Imposter Chansey, and Refrigerate Mega Abomasnow, also excel as partners to Xerneas. Mega Gyarados also doubles as a check to the most prevalent Shadow Tag Perish trapper in Lugia. Lastly, No Guard users, which often force opposing Wonder Guard users in, are great partners to Xerneas, as most of the time they provide fodder for Xerneas to use Substitute. Last but not least, Xerneas can be paired with other Xerneas in spam teams if running Recover on the first moveslot, with possible abilities on teammates being Mold Breaker, Huge Power, Pixilate, No Guard, and Prankster.</p> "
      },
      {
        "name": "Mold Breaker Sweeper",
        "description": "<p>Excellent overall stats and a stellar typing both offensively and defensively make Mold Breaker Xerneas a powerful and resilient sweeper. Additionally, Xerneas's good bulk sets it apart from other Fairy-type Mold Breaker users like Mega Diancie and Mega Gardevoir—whose frailty prevents them from effectively making use of defensive options like King's Shield and Recover. Pixie Plate makes Judgment into a powerful STAB attack, OHKOing targets like standard Mega Gyarados after Stealth Rock and all variants of Mega Rayquaza. After Shell Smash, Judgment also OHKOes Mega Gengar after Stealth Rock, always OHKOes bulky Dialga, and has a high chance to OHKO Wonder Guard Xerneas—guaranteed after Stealth Rock. Additionally, +0 Judgment 2HKOes physically defensive Prankster Giratina. King's Shield makes Xerneas much more resilient versus most common revenge killers—namely -ate Speed users like Mega Abomasnow—as well as forcing out offensive Shadow Tag users like Regigigas and Choice Band Mega Mewtwo X. Alternatively, Steam Eruption OHKOes Primal Groudon and Mega Diancie and gives Xerneas very good neutral coverage, with only extremely specially bulky Pokemon like Blissey and Primal Kyogre able to switch in safely after a Shell Smash. Steam Eruption also allows Xerneas to beat Magic Guard + Toxic Orb Ho-Oh, a niche set that is otherwise very difficult for Xerneas to break. Spore gives Xerneas free turns to set up and is preferred over other disruption moves like Dark Void and Taunt, as alongside Pixie Plate Judgment, it makes Xerneas extremely easy to Imposter-proof with a Safety Goggles Ghost-type teammate like Giratina. However, when supported by teammates like No Guard users and Substitute + Baton Pass users, Xerneas has an easier time setting up without Spore. Consequently, a set with both Steam Eruption for coverage and King's Shield for survivability is viable. The given EV Spread outpaces maximum Speed Adamant Primal Groudon. Alternatively, an EV spread of 180 HP / 252 SpA / 76 Spe can be used to maximize overall bulk while still outpacing Deoxys-S after a Shell Smash.</p> <p>Mold Breaker Xerneas fits best on balance and bulky offense teams as a late-game wincon. Prankster Giratina is perhaps Xerneas's most notable partner; it provides invaluable counterplay versus opposing Shell Smash sweepers like Primal Groudon and is a blanket check to the many powerful physical attackers of the metagame. More importantly, however, is that Prankster Giratina provides a rock-solid answer to Imposter users impersonating Xerneas, thanks to its Ghost-typing blocking Normal-type Judgement and Safety Goggles blocking Spore. Xerneas appreciates a secondary Mold Breaker teammate, as it is unable to adequately pressure most Wonder Guard Pokemon before a boost. Choice Band Mold Breaker Primal Groudon and Mega Rayquaza are particularly notable teammates, as they pressure most of Xerneas's defensive checks, such as Blissey and Ho-Oh. Huge Power Mega Gyarados, Choice Scarf Imposter Chansey, and Refrigerate Mega Abomasnow are also all excellent teammates for their ability to revenge kill a wide variety of threats, but especially Primal Groudon. Xerneas also appreciates teammates that give it opportunities to set up, such as Substitute + Baton Pass users like Mega Manectric, Mega Swampert, and Wonder Guard Xerneas, as well as No Guard teammates like Mega Mewtwo Y and Mega Aerodactyl. Shadow Tag users like Choice Band Mega Mewtwo X and Choice Scarf Primal Groudon are also excellent teammates for their ability to trap and KO Xerneas's checks, especially opposing Primal Groudon. Xerneas sets using Pixie Plate Judgment as their sole attack especially appreciate Shadow Tag users's ability to clear the way for its sweep. Finally, support Wonder Guard users are essential teammates for Xerneas, keeping the field clear of hazards and their team free of status. Additionally, because Xerneas usually lacks recovery, those same teammates can provide it with valuable Wish support, extending its survivability throughout longer games.</p> "
      },
      {"name": "SmashPass WG"},
      {"name": "Shell Smash Sweeper WG"},
      {"name": "Support WG"}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 226455, "username": "berry"}, {"user_id": 506113, "username": "BahamutLagoon"}, {"user_id": 569731, "username": "NToTheN"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 528036, "username": "Sulo"}]}], "writtenBy": [{"user_id": 515077, "username": "Mbouchon"}, {"user_id": 562267, "username": "Daylight"}]}
  },
  "Yveltal": {"sets": [{"name": "Magic Bounce"}, {"name": "Poison Heal"}, {"name": "Pursuit Trapper"}]},
  "Diancie": {
    "comments": "<h1>Other Options</h1> <p>Pixilate Mega Diancie can make use of 96 Speed EVs alongside a Naughty nature and either Surf or Steam Eruption to outpace and OHKO maximum speed Adamant Primal Groudon in a 1v1 scenario. Alternatively, Mega Diancie can use an EV Spread of 64 HP / 252 Atk / 96 SpA / 96 Spe with a Naughty nature to do the same with Scald. Further, 204 Speed EVs can be to outpace Jolly Primal Groudon. Water Shuriken is an option that allows Mega Diancie to revenge kill heavily chipped Primal Groudon in a pinch. However, it’s inconsistent if Primal Groudon is healthy, as Mega Diancie needs all five hits of Water Shuriken to connect in order to KO, even after Fake Out. Mega Diancie can make use of Pursuit to catch frail sweepers like Mega Gengar and Mega Mewtwo Y switching out. Parting Shot is an option to maintain momentum, as Diancie forces switches against many non-Wonder Guard foes. V-Create is an alternative to Sacred Fire that OHKOes standard Registeel after Stealth Rock and 2HKOes standard Mega Steelix. However, the utility and flexibility of Sacred Fire is usually superior, as such foes are both rare and are hit hard by Sacred Fire anyway. Coverage moves to hit specific Wonder Guard users, such as Gunk Shot, Bolt Strike, Thousand Arrows, and Close Combat are options over Boomburst or Sacred Fire, though they’re quite situational and matchup dependent. Of those options, Close Combat, Precipice Blades, and Thousand Arrows are the most worth considering for their ability to heavily damage Magic Bounce Steel-types. Sticky Web, Toxic Spikes, and Spikes are all usable alternatives to Stealth Rock should a teammate already have it or if the specific utility of any of the aforementioned entry hazards is desired. Spore is an option in the last moveslot, as Mega Diancie forces out most common Magic Bounce users and Safety Goggles Wonder Guard users are relatively rare. Life Orb is an alternate item that improves Mega Diancie's matchup against bulky Pokemon neutral to Fairy-type attacks, such as Perish Song Lugia, though it does cut into Mega Diancie’s longevity and ability to enter the battlefield repeatedly in longer games. Finally, Diancite, Shed Shell, and Safety Goggles are alternate items that can improve Mega Diancie's matchup against Trick, Shadow Tag, and Spore users, respectively. However, their applications are all far more narrow than Lum Berry or Pixie Plate.</p> <p>On Mold Breaker Diancie, Searing Shot is an option over Spore or Dark Void to break past would-be checks, such as Registeel and the rare Mega Venusaur and Ferrothorn—alternatively, Blue Flare can OHKO Registeel after a Shell Smash, but Searing Shot is usually better due to its accuracy and most of Mega Diancie's checks getting worn down often by entry hazards. Further, lacking a sleep move leaves Mega Diancie vulnerable against offensive teams. Either Fire-type move can also be run over Steam Eruption, but this leaves Mega Diancie vulnerable against healthy Primal Groudon running Lum Berry. Diamond Storm KOes Ho-Oh and threatens Wonder Guard Blissey, but like Fire-type coverage, it is hard to fit. Earth Power and Precipice Blades are usable over Steam Eruption, with the former threatening Registeel and Mega Steelix and the latter better threatening Registeel and Blissey; however, usually neither is worth it, as they leave Mega Diancie walled by Ho-Oh and forced out by unscouted Mega Scizor. King's Shield is another option for the first moveslot, as it provides protection against many Pokemon: -ate Speed users such as Kyurem-B, Pixilate Mega Diancie, and Mega Abomasnow, Huge Power Slaking and Regigigas not running Water Shuriken, and to an extent Shadow Tag Slaking and Regigigas. However, lacking a sleep move leaves Mega Diancie forced out by healthy Primal Kyogre and Wonder Guard Blissey with Knock Off, and King's Shield does not help if Mega Diancie is already weakened. Moonblast can work over Judgment, as it is still a fairly powerful STAB move and allows Mega Diancie to run useful items like Lum Berry, Focus Sash, and Leftovers, but the loss in power and vulnerability to opposing Imposter users is usually too much to justify running it. Finally, a Timid nature can be run to outspeed Adamant or Modest Mega Rayquaza, Modest Mega Latios, opposing Mold Breaker Mega Diancie, and Modest Arceus, but the loss in power—and the inherent risks in staying in on most of these threats—means Timid is often not worth it.</p> <p>Besides Pixilate and Shell Smash Mold Breaker sets, Mega Diancie can opt for two niche options in Choice Specs + Mold Breaker and Huge Power. The former takes advantage of Mega Diancie's ability to pose an immediate threat, forcing switches, and often sacks, with Choice Specs-boosted Moonblast, Steam Eruption, Fire-type coverage (or Trick), and Volt Switch. Huge Power Mega Diancie largely relies on the surprise disguising itself as Pixilate Mega Diancie until it hopefully KOes an opposing Wonder Guard user. While these are usable options, Choice Specs Mega Diancie is often too slow to make progress against more offensive teams and can be a pain to Imposter-proof, and Huge Power Mega Diancie is virtually completely inferior to Mega Mewtwowhen the surprise is revealed.</p> <p>On Mega Diancie spam teams—that is, teams with three or more Mega Diancie—fringe sets such as Choice Scarf + Huge Power, Prankster, Shell Smash + Wonder Guard, Parental Bond, No Guard, and Magic Bounce have significantly increased viability.</p> <h1>Checks and Counters</h1> <p><strong>Primal Groudon: Primal Groudon almost directly counters the majority of Pixilate Mega Diancie sets. However, variants with Water-type coverage can defeat unboosted and non-Choice Scarf Primal Groudon sets in a 1v1 scenario.</p> <p><strong>Wonder Guard Users</strong>: Pixilate Mega Diancie is forced out by vast majority of Wonder Guard users. However, Gastro Acid variants of Mega Diancie can overcome this to some extent.</p> <p><strong>King's Shield Sweepers</strong>: Pixilate Mega Diancie ordinarily forces out most Mold Breaker sweepers; however, those carrying King's Shield can force Mega Diancie to play mind games, forcing it out if it guesses wrong.</p> <p><strong>Offensive Shadow Tag Users</strong>: Some offensive Shadow Tag users, namely Primal Groudon, are bulky enough to survive Pixilate Mega Diancie's Fake Out and Extreme Speed and can OHKO back with a super-effective Ground-, Steel-, or Water-type move. Additionally, Shadow Tag revenge killers like Regigigas and Slaking can trap and KO both Pixilate and Mold Breaker Mega Diancie with Fake Out and Bullet Punch if they’re healthy enough to survive an Extreme Speed. For Mold Breaker Diancie, this necessitates Mega Diancie teammates with Substitute + Baton Pass to make progress, especially when the Shadow Tag Slaking or Regigigas user runs pivoting support. However, offensive Shadow Tag users without priority usually can't threaten a boosted Mold Breaker Mega Diancie.</p> <p><strong>Defensive Steel-types</strong>: Magic Bounce Steel-types such as Registeel and Mega Steelix can prevent Pixilate Mega Diancie lacking Fire coverage from making much, if any, progress. Additionally, defensive Steel-types like Registeel, Mega Scizor, and Escavalier can switch into most Mold Breaker Mega Diancie sets and, if they have one, force it out with a Steel-type STAB option. However, such checks are vulnerable, either to getting worn down over the course of a game or to Mega Diancie's teammates.</p> <p><strong>Revenge Killers: Due to Mold Breaker Mega Diancie being relatively frail, priority revenge killers almost always force it out. In particular, Huge Power Mega Gyarados outright OHKOes it with Water Shuriken, and Mega Diancie switching out can let Pursuit KO if it is heavily damaged. -Ate Speed users such as Mega Abomasnow, Pixilate Mega Diancie, Kyurem-B, and Mega Rayquaza can also threaten Mega Diancie, being able to set entry hazards or otherwise support their team when Mega Diancie is forced to switch. However, most revenge killers require pivoting support to not risk Mega Diancie OHKOing them.</p> <p><strong>Item Removal: Although Mold Breaker Mega Diancie boasts a resistance to Knock Off, losing Pixie Plate means it fails to seriously threaten most teams. However, Trick or Knock Off users that Mega Diancie does not threaten when boosted are relatively rare.</p> <p><strong>Wonder Guard Blissey and Chansey</strong>: Extremely specially defensive Wonder Guard users in Blissey and Chansey are reliable switch-ins to most Mold Breaker Mega Diancie sets, as Judgment does not 2HKO them after Shell Smash. However, they are prone to getting worn down by entry hazards, and taking Spore or Dark Void can let Mega Diancie set up enough to power through them.</p> <p><strong>Specially Defensive Toxic Orb Users</strong>: Specially defensive Pokemon running Toxic Orb, in particular Poison Heal Primal Kyogre, are major obstacles to most Mold Breaker Mega Diancie sets when healthy and poisoned, as Spore and Dark Void don't affect them. Poison Heal Primal Kyogre can threaten Mega Diancie with Scald and can switch into it with relative ease when healthy. Another Toxic Orb user, Ho-Oh, can threaten Mega Diancie with niche options in Wood Hammer and Thousand Arrows; the former OHKOes with after Shell Smash, while the latter OHKOes boosted Mega Diancie after Stealth Rock. However, it can't do much back to Mega Diancie if lacking either niche move. While fairly reliable against Mega Diancie one-on-one, most Toxic Orb switch-ins are vulnerable to being removed by a Shadow Tag user, meaning if Mega Diancie has Shadow Tag support, they are not reliable switch-ins.</p> <p><strong>Plate + Imposter Users</strong>: While relatively rare, opposing Imposter users using a Plate item, in particular Pixie Plate, Iron Plate, or Spooky Plate, can annoy most Mold Breaker Mega Diancie, especially as Plate items are generally unexpected items on Imposter users. However, these Imposter users must win a Speed tie against Mega Diancie, as well as other Mold Breaker sweepers they hope to check, so they are generally suboptimal picks overall.</p> ",
    "sets": [
      {
        "name": "Pixilate Revenge Killer",
        "description": "<p>High offensive stats and excellent offensive typing make Pixilate Mega Diancie a powerful revenge killer. Boosted by Pixilate, Fake Out and Extreme Speed allow Mega Diancie to revenge kill most No Guard users and Mold Breaker sweepers lacking King's Shield, Primal Groudon being the one notable exception. Boomburst is an incredibly powerful STAB move thanks to Pixilate that notably OHKOes Giratina. Alternatively, Sacred Fire can be used to hit Steel-type Magic Bounce users hard and to OHKO Bug / Steel type Wonder Guard users like Mega Scizor and Escavalier. Stealth Rock takes advantage of Pixilate Mega Diancie's ability to force out most No Guard, Mold Breaker, and Magic Bounce users. Alternatively, Gastro Acid takes advantage of Mega Diancie's ability to force Wonder Guard users in. Lum Berry is an exceptionally item useful for Mega Diancie, allowing it to switch into Spore, Glare, and Will-O-Wisp from Mold Breaker foes and Prankster Giratina. Pixie Plate is an alternative that augments Mega Diancie's overall damage output; notably, it allows Mega Diancie to KO unboosted Mega Gengar with Fake Out and Extreme Speed after Stealth Rock. As Mega Diancie relies on Fake Out and Extreme Speed against the majority of foes, Speed investment is unnecessary. A Brave nature and 4 Special Attack EVs allow Mega Diancie to OHKO standard Giratina with Boomburst. On sets without Boomburst, an Adamant nature and an EV spread of 248 HP / 252 Atk / 8 Def should be used.</p> <p>Due to its inability to consistently revenge kill Primal Groudon, Pixilate Mega Diancie fits best on offensive teams that have room for multiple revenge killers. In particular, Choice Scarf Imposter Chansey, Choice Scarf Shadow Tag users, and Choice Scarf No Guard users make excellent teammates thanks to their ability to revenge kill nearly all variants of Primal Groudon and most King's Shield Mold Breaker sweepers. Prankster Giratina also makes an excellent teammate due to its ability to switch into and check Primal Groudon. Additionally, Mega Diancie appreciates Prankster Giratina's ability to force out most defensive Wonder Guard users—Mega Diancie's most common switch-ins—with Encore and Curse. Offensive Shadow Tag users like Mega Mewtwo X and Mega Mewtwo Y also make excellent teammates for their ability to trap and KO Wonder Guard users that frequently forgo Shed Shell, such as the ever popular Substitute + Baton Pass Xerneas, another common switch-in to Pixilate Mega Diancie. Powerful Mold Breaker teammates like Choice Band Primal Groudon, although invaluable on nearly every team structure, are especially valuable teammates to Pixilate Mega Diancie for their ability break through the Wonder Guard users that switch into Mega Diancie. Finally, Mega Diancie appreciates the Defog, Aromatherapy, Wish, and Imposter-proofing support that support Wonder Guard teammates like Cresselia and Primal Kyogre can provide.</p> "
      },
      {
        "name": "Shell Smash Sweeper",
        "description": "<p>Mold Breaker Mega Diancie is an amazing sweeper. It has a great STAB move that helps Imposter-proof it in Pixie Plate Judgment, impressive offensive stats, and fairly good Speed. Spore and Dark Void are excellent options to gain free setup turns against would-be checks, such as specially defensive Wonder Guard Primal Kyogre and Blissey. Spore is usually preferred because it means one teammate, Safety Goggles + Prankster Giratina, is enough to almost perfectly Imposter-proof Mega Diancie. However, Dark Void is also a great option due to bypassing opposing Safety Goggles users. Shell Smash immensely bolsters Mega Diancie's offensive prowess in a single turn. Fairy-type Judgment is an exceptionally valuable STAB move to have; not only is it noticeably stronger than Moonblast, but it also greatly diminishes the pressure that Imposter Chansey imposes on Mega Diancie, letting Giratina and specially defensive Primal Kyogre Imposter-proof it extremely well. This reduced pressure allows it to safely set up with Shell Smash in nearly any matchup. Additionally, Judgment threatens a wide enough portion of the metagame that Mega Diancie can often force progress without relying on Shell Smash boosts. Steam Eruption is an amazing coverage option that OHKOes Primal Groudon, 2HKOes Ho-Oh after a Shell Smash, and hits defensive Steel-types, like Wonder Guard Mega Scizor, Mega Steelix, and to an extent Registeel. Although some Steel-types, like Registeel running Knock Off, can stand up to a boosted Steam Eruption and threaten Mega Diancie's wallbreaking, Mega Diancie can annoy them by burning them over the course of the game. Mold Breaker allows Mega Diancie to ignore Wonder Guard, letting it make maximum use of its great offensive typing. A Modest nature further increases Mega Diancie's power, with it notably OHKOing uninvested Mega Latios after Stealth Rock and offensive Arceus after a Shell Smash. 252 Speed EVs, even without Timid, are enough to outspeed a sizable portion of the metagame.</p> <p>Mega Diancie fits best on bulky offense and balance teams that can take advantage of its offensive typing and resistance to Imposter Chansey to get and retain momentum. They must also tolerate Mega Diancie's mediocre Speed for a frail Shell Smash sweeper. Mega Diancie fits well into the metagame's most dominant core of Mold Breaker Primal Groudon, Giratina, and Substitute + Baton Pass Wonder Guard Xerneas; it threatens Primal Groudon's most prominent switch-in in Giratina, broadly does well in most matchups Primal Groudon and Giratina struggle in, and is an excellent recipient of Substitutes from Xerneas. In return, Primal Groudon can switch into its defensive checks like Wonder Guard Blissey and provide Stealth Rock support, Giratina can come in on Choice Band Mega Rayquaza and Choice Scarf Primal Groudon, and Xerneas can switch in on -ate Speed users that would otherwise take full advantage of Mega Diancie's need to switch out. As Mega Diancie is quite frail, Substitute support from Baton Pass users like Wonder Guard Xerneas, Mega Swampert, and Magic Bounce Giratina is appreciated, even when Mega Diancie is not used in the aforementioned core. Shadow Tag users, in particular Mega Mewtwo X and Primal Groudon, can remove most checks to Mega Diancie with Fire-type coverage or STAB moves. Mega Mewtwo X also revenge kills Huge Power Mega Gyarados, which can force Mega Diancie out with Water Shuriken—or force a coinflip scenario with Water Shuriken and Pursuit when Mega Diancie is weakened. Pursuit users, in particular Mega Gyarados and Mega Tyranitar, work well with Mega Diancie, as they can heavily damage Pokemon that can remove it before Shell Smash, in particular Shadow Tag Slaking and Regigigas. Finally, slow defensive Wonder Guard users, such as Primal Kyogre, Slaking, Mega Audino, Blissey, and Escavalier, can provide Defog and Aromatherapy support while also acting as slow pivots, helping to get Mega Diancie on the field.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 506113, "username": "BahamutLagoon"}, {"user_id": 235009, "username": "Ransei"}, {"user_id": 515077, "username": "Mbouchon"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}, {"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 515077, "username": "Mbouchon"}, {"user_id": 562267, "username": "Daylight"}]}
  }
}