{
  "Gengar": {
    "overview": "<p>Thanks to the incredible ability Shadow Tag, Mega Gengar is the best trapper in the metagame. It has high Special Attack and Speed stats, allowing offensive sets to outspeed and revenge KO common offensive Pokemon such as Darkrai, Arceus, and Mega Rayquaza while stopping them from switching out. Gengar's large movepool includes powerful offensive options such as Shadow Ball and Focus Blast for perfect coverage alongside support moves such as Destiny Bond, and sets with Taunt or Perish Song destroy stall and balance, particularly passive Pokemon such as Clefable and support Arceus. It is incredibly effective at supporting sweepers by removing their answers, such as Arceus-Fairy for Darkrai. Mega Gengar also has an excellent offensive typing that allows it to take on common metagame picks such as Xerneas, Lugia, Arceus-Fairy, and Mega Diancie without being a slouch defensively either thanks to its immunity to Normal-type moves allowing it to revenge KO Arceus and Mega Rayquaza without worrying about Extreme Speed. However, Mega Gengar cannot be run alongside other Mega Pokemon such as Mega Rayquaza, making it much harder to fit onto a team. Its paltry bulk prevents it from taking any non-resisted hits from nearly any offensive Pokemon, and it has a decent number of solid checks, forcing it to play as a hit-and-run trapper</p> ",
    "comments": "<h1>Other Options</h1> <p>Disable on offensive sets allows Mega Gengar to trap and KO Choice-locked Pokemon that it cannot otherwise touch, such as Ho-Oh, or Pokemon with only one effective move, such as Magic Coat Arceus. Will-O-Wisp can guarantee a burn on any given Pokemon, but is usually a waste of Mega Gengar's time compared to removing them outright. Hypnosis is an option that can make trapping effortless, turning battles around in an instant. However, it has an abysmal accuracy that makes relying on it a questionable decision. Meanwhile, Hex in combination with Toxic Spikes support, Hypnosis, or Will-O-Wisp deals much heavier damage, but it requires more team support and is ineffective against Lum Berry Arceus. Attacking moves can be used on the Perish Trap set to remove some particular target, but all the moves listed are required for maximum effectiveness.</p> <h1>Checks and Counters</h1> <p>Mega Gengar cannot be countered in the ordinary sense because it can pick and choose what it wants to battle with Shadow Tag.</p> <p><strong>Faster Pokemon: Faster Pokemon such as Mega Mewtwo Y, Deoxys-A, and Choice Scarf Genesect can effectively revenge KO Mega Gengar. None of them can come in safely, however, so often the best they can do is force Mega Gengar out.</p> <p><strong>Yveltal: Thanks to its excellent typing and bulk, both offensive and defensive Yveltal can take on Mega Gengar, either by avoiding the 2HKO and OHKOing back or simply eliminating it with Sucker Punch. Mega Gengar requires significant chip damage on Yveltal to have even a shot at winning.</p> <p><strong>Super Effective Priority</strong>: Sucker Punch and Shadow Sneak from Pokemon such as Yveltal, Aegislash, and Giratina-O hit super effectively before Mega Gengar can act, usually OHKOing it. However, all users with the exception of Yveltal are quite rare, and Sucker Punch can be freely switched out of.</p> <p><strong>Tanks: Bulky Pokemon not weak to Mega Gengar's attacks such as Ho-Oh, Mega Sableye, Klefki, and Primal Groudon can take an attack and proceed to cripple or KO Mega Gengar. However, all of these bar Mega Sableye can be Perish Trapped or defeated with enough chip damage.</p> ",
    "sets": [
      {
        "name": "Offensive Trapper",
        "description": "<h1>Moves</h1> <p>Sludge Wave is Mega Gengar’s hardest-hitting option, dealing heavy damage to any Pokemon that doesn't resist it, particularly Fairy-type Pokemon such as Xerneas. Sludge Bomb does similar damage, but sacrifices a bit of power for a decent chance of poison. Shadow Ball still deals large amounts of damage while having the ability to hit Ghost-types such as Giratina and being the best move on the set to hit Primal Groudon. Focus Blast is a nice coverage option for Mega Gengar, with perfect neutral coverage alongside Shadow Ball and the ability to hit troublesome Pokemon like Darkrai, Extreme Killer Arceus, and Arceus-Steel. Destiny Bond is another option that allows Mega Gengar to trade with Pokemon that it cannot otherwise beat such as Primal Groudon, going well with its ability to force Pokemon to stay in and take it on. Protect allows Gengar to safely Mega Evolve, gain its new Speed tier, and scout the foe's moveset, while Taunt cripples support Pokemon like Arceus-Water and Lugia and stops them from avoiding Destiny Bond, recovering, or phazing Mega Gengar.</p> <h1>Set Details</h1> <p>252 Speed EVs and a Timid nature allows Mega Gengar to Speed tie with Mewtwo and outspeed anything slower, including Arceus, Darkrai, and Mega Rayquaza. 252 Special Attack EVs allows Mega Gengar to do as much damage as possible, notably enabling it to always OHKO Xerneas after Stealth Rock. Levitate allows Gengar to avoid Earthquake and pivot into users such as Extreme Killer Arceus, but keeping it is generally inferior to immediately Mega Evolving to get Shadow Tag, which prevents the foe from switching out and allows Mega Gengar to effectively revenge KO threats.</p> <h1>Usage Tips</h1> <p>This set's primary goal is trap and KO any Pokemon that threatens your team strategy, particularly those weak to Gengar's attacks. Be cautious when attempting this on Xerneas, however, as with a Choice Scarf it outspeeds Mega Gengar and can 2HKO it. Double switching or pivot support is important in order to properly utilize Mega Gengar, as it cannot directly switch in to most attacks. It’s possible to wait until the opponent KOes a Pokemon for a free switch, but in many cases you cannot afford to lose a Pokemon. In most battles, you should Mega Evolve Gengar as soon as feasible because regular Gengar lacks the ability to trap and has far lower stats, particularly its Special Attack and Speed. It's often a good idea to keep Mega Gengar around to check Extreme Killer Arceus late-game, as Mega Gengar is faster and immune to Extreme Speed. Not Mega Evolving is mostly only useful here, as it makes Gengar a better switch-in to Arceus. When revenge KOing, attempt to get chip damage via entry hazards or prior attacks, as Mega Gengar often falls just short of an OHKO.</p> <h1>Team Options</h1> <p>Switch-ins for Yveltal are crucial, as Mega Gengar can do little to it. Arceus-Fairy and Xerneas do this well, but they can be beaten by offensive sets if low on HP. Ghost-types such as Giratina-O and Aegislash cannot be trapped and threaten Mega Gengar with their super effective STAB priority moves, so Pokemon that can take them on like Yveltal and Ho-Oh are useful. Pokemon that can take on Ground-types, such as Giratina, Yveltal, and Arceus-Water, are useful to have, as Mega Gengar cannot effectively deal with Arceus-Ground or Primal Groudon. Pokemon that can take on Klefki such as Primal Groudon, Extreme Killer Arceus, and Mega Diancie are extremely useful to keep Mega Gengar from being crippled. Checks to Ho-Oh such as Arceus-Water, Arceus-Rock, and Zekrom are also appreciated due to Ho-Oh's high Special Defense and ability to OHKO Mega Gengar. Wallbreakers that can take advantage of opened holes in opposing teams, like Ho-Oh and Mewtwo, pair well with Mega Gengar due to the latter's ability to selectively remove troublesome Pokemon. Setup sweepers like Extreme Killer Arceus and Geomancy Xerneas also benefit from Mega Gengar removing their checks and counters. Pivot Pokemon like Jirachi, Yveltal, and Genesect are also handy to bring Mega Gengar in safely by removing the risk of the foe switching to an unfavorable matchup. Entry hazard setters like Deoxys-A, Klefki, and Primal Groudon are useful to allow Mega Gengar to take out bulky attackers such as Arceus, while Mega Gengar pressures Defoggers and the rare Rapid Spin user.</p> "
      },
      {
        "name": "Perish Trapper",
        "description": "<h1>Moves</h1> <p>Perish Song facilitates the removal of even extremely bulky walls, such as Lugia, Arceus, and Chansey. It is passed by Baton Pass and goes through Substitute and Magic Bounce, allowing Mega Gengar to force a sacrifice against any Pokemon that cannot avoid Shadow Tag. Protect lets Gengar safely Mega Evolve as well as allowing it to stall out Perish Song and scout for threatening moves. Taunt prevents phazing with Roar or Whirlwind and stops the foe from doing anything useful like setting Stealth Rock before fainting, while Disable stops the opposing Pokemon from using their most recently used move, making it invaluable versus Choice-locked Pokemon or when combined with Protect. Substitute blocks both status moves and attacks and allows Mega Gengar to stall out Perish Song turns.</p> <h1>Set Details</h1> <p>216 Speed EVs and a Timid nature allow Mega Gengar to outspeed maximum Speed Darkrai, as well as anything slower. 248 HP and 32 Defense EVs allow Mega Gengar to survive a Lum Berry Arceus's Earthquake after Stealth Rock. 12 Special Defense EVs in conjunction with the HP allows Mega Gengar to survive an Earth Power from Mega Diancie after Stealth Rock damage or +2 Thunder from Xerneas. Shadow Tag allows Mega Gengar to trap any Pokemon that is not a Ghost-type, a Shadow Tag user, or carrying a Shed Shell.</p> <h1>Usage Tips</h1> <p>Gengar cannot trap anything until it Mega Evolves, so do so as early in the match as is safe. Due to its low bulk, aggressive double switches and pivot moves are very helpful to get Mega Gengar in safely. Don't attempt to Disable Pokemon with multiple effective attacking moves such as Calm Mind Arceus, as even after a Disable they can still heavily damage Mega Gengar. Anything that lacks multiple moves that can OHKO Mega Gengar is a valid option for trapping, but trapping defensive, passive walls gives the lowest risk vs. reward ratio, as they usually can't do anything to stop Mega Gengar. When deciding on which Pokemon to remove, focus on removing answers to your wincon, such as Arceus-Water for Primal Groudon. Against defensive Pokemon that commonly use Roar such as support Arceus and Giratina, use Taunt on the first turn to prevent them from phazing Mega Gengar, and then Protect to scout for super effective coverage, Disabling it if necessary. Perish Song should be used as quickly as feasible to avoid racking up chip damage, but against some targets it can be useful to click another move first. While you can stall out the Perish Song counter with Protect, Substitute, and Disable, if the foe phazes Mega Gengar they can switch out and remove the countdown. On the turn before the Perish Song counter reaches zero, you almost always switch Mega Gengar out. There's rarely a reason to let it get KOed.</p> <h1>Team Options</h1> <p>Setup sweepers such as Arceus, Xerneas, and Primal Groudon appreciate the ability of Mega Gengar to remove their counters, as do those such as Klefki with a very select number of viable answers. Defensively, Pokemon that do not mind taking Ghost-, Dark-, and Psychic-type attacks, like Yveltal and support Arceus, are helpful to avoid Mega Gengar getting unnecessarily damaged. Pivot Pokemon like Zekrom, Yveltal, and Genesect are also useful to bring Mega Gengar in safely against their would-be counters. As Shadow Tag does not affect Ghost-types, answers to them such as Ho-Oh and Yveltal are beneficial. In particular, the latter also deals with the occasional Shed Shell user such as Blissey with Knock Off, either by KOing them outright or leaving them vulnerable to trapping.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 202117, "username": "MZ"}, {"user_id": 262044, "username": "Chloe"}]}, {"name": "Grammar checked by", "members": [{"user_id": 331519, "username": "CryoGyro"}, {"user_id": 232216, "username": "The Dutch Plumberjack"}]}], "writtenBy": [{"user_id": 297239, "username": "Quantum Tesseract"}]}
  },
  "Arceus": {
    "overview": "<p>Arceus is one of the most threatening and metagame-defining offensive Pokemon in the format while also having a solid support set as a secondary option. For the offensive set, strong priority makes it a dangerous cleaner in tandem with a boosting move in Swords Dance, and it also has super effective coverage for nearly every common Normal-resistant Pokemon and the Speed to beat out foes such as Mega Diancie. Arceus is also incredibly bulky for an offensive Pokemon, which allows it to check a number of threatening foes such Darkrai and Klefki in tandem with Lum Berry. Meanwhile, its support set stands out thanks to a lack of exploitable weaknesses and can be incredibly difficult to break through. Arceus also has a deep offensive and defensive movepool, and it is one of the few Pokemon that can be easily paired with itself to become even more threatening. However, it can be somewhat weak and walled by physically bulky Pokemon such as Giratina and Lugia. Arceus also has issues with how common Ghost-types are in the metagame.</p> ",
    "comments": "<h1>Other Options</h1> <p>Choice Band is an option that provides very strong priority revenge killing but sacrifices Lum Berry and the ability to set up. Wallceus can attempt to fit in an attacking move such as Extreme Speed, but it is somewhat weak and has an easier time chipping foes with status, entry hazards, and phazing. Earthquake is another option to surprise Mega Diancie and Mega Gengar but has the same drawbacks and fails to hit many targets. Wallceus can also run Lum Berry to cripple Darkrai with status or at least phaze it once, but this fails versus Taunt variants and is otherwise incredibly niche. Extreme Killer can fit Perish Song onto its moveset to fare better versus Baton Pass but sacrifices a useful moveslot in doing so. Overheat on Life Orb Extreme Killer can surprise Steel-types such as Ferrothorn and Skarmory but is otherwise not terribly useful. If the role compression is necessary, Extreme Killer Arceus can run Stealth Rock over an attack to provide both entry hazard and revenge killing support. Shadow Force is an option over Shadow Claw to deal significantly more damage to Ghost-types, but its extra turn can provide opportunities for opponents to switch into a Normal-type or other switch-in. Refresh can remove status but doesn't help versus Darkrai, and Lum Berry is simply more reliable. Silk Scarf increases the damage of Extreme Speed slightly without chipping away at Arceus's own HP, and it is a solid item option provided Darkrai is not too threatening for the team.</p> <h1>Checks and Counters</h1> <p><strong>Ghost-types: Bulky Ghost-types such as Mega Sableye, Giratina, and defensive Arceus-Ghost are immune to Arceus's strongest attack and can survive its coverage moves while KOing Arceus with Foul Play or phazing or burning it. Giratina-O and Arceus-Ghost can revenge kill a slightly weakened Extreme Killer Arceus, although neither appreciates a +2 Shadow Claw. Mega Gengar can outspeed a slightly weakened Extreme Killer Arceus and KO it with Focus Blast or remove it with Destiny Bond if necessary.</p> <p><strong>Lugia: Arceus cannot do significant damage to Multiscale Lugia before it is phazed, and it can easily be stalled out by Reflect variants. However, a +2 Life Orb-boosted Stone Edge can KO fast Lugia variants after Stealth Rock, as it is reliant on Multiscale to take Arceus's hits well.</p> <p><strong>Yveltal</strong>: Physically defensive Yveltal takes little from any of Arceus's attacks save a boosted Stone Edge and can Roost off the damage or KO with Foul Play.</p> <p><strong>Unaware</strong>: Clefable and Quagsire can survive any hit from standard Extreme Killer Arceus with ease regardless of its boosts and slowly chip away at it with Moonblast or Earthquake, respectively. However, both can be 2HKOed by Life Orb-boosted Return.</p> <p><strong>Steel-types: Steel-types such as Skarmory, Ferrothorn, and Mega Scizor can wall Arceus lacking Overheat, although none can do significant damage in return. Bronzong can wall Arceus variants lacking Shadow Claw, while Dialga is able to survive a +2 Earthquake with Shuca Berry and do significant damage with Draco Meteor. Magnet Rise Klefki can also avoid significant damage from Arceus, and Arceus-Steel can revenge kill a weakened Arceus without fearing Extreme Speed.</p> <p><strong>Arceus-Rock: Arceus-Rock can pick off weakened Extreme Killer Arceus with Judgment or burn them one-on-one after using up their Lum Berry, but it does not appreciate taking a +2 Earthquake.</p> <p><strong>Mega Mewtwo X</strong>: Mega Mewtwo X can survive a +2 Life Orb-boosted Extreme Speed from Arceus and OHKO in return with Low Kick.</p> <p><strong>Status</strong>: Burn severely cripples Extreme Killer Arceus, and paralysis leaves it outsped by foes that it would rather use coverage moves to hit, such as Dialga. Wallceus can be chipped away at with Toxic or burn, forcing it to heal constantly and leaving it unable to survive through longer games.</p> <p><strong>Taunt and Magic Bounce</strong>: Wallceus is forced to Struggle or switch out versus Taunt users such as Yveltal and Darkrai, and it has no way to prevent itself from being trapped by Taunt Mega Gengar. Magic Bounce users such as Mega Sableye completely shut it down as well, forcing Wallceus to be careful about using its status moves.</p> ",
    "sets": [
      {
        "name": "Extreme Killer",
        "description": "<h1>Moves</h1> <p>Swords Dance allows Arceus to set up before cleaning with its strong priority in Extreme Speed. Earthquake is useful coverage to hit Rock- and Steel-types like Diancie and Arceus-Steel, as well as Primal Groudon. Stone Edge and Shadow Claw are different useful coverage moves; Stone Edge hits Flying-types such as Yveltal and Skarmory, while Shadow Claw hits Ghost-types such as Arceus-Ghost and Giratina-O. Magic Coat can also be used in combination with Lum Berry to give status-reliant foes such as Klefki and Darkrai a hard time. Return can be used with Life Orb to 2HKO Unaware Clefable, which Arceus otherwise fails to break through, as well as being a slightly stronger attack versus foes Arceus does not carry super effective coverage for.</p> <h1>Set Details</h1> <p>Maximum Attack investment allows Arceus to hit as hard as possible to sweep opposing teams. Maximum Speed investment and a Jolly nature ensure Arceus beats out foes such as Mega Diancie and Mega Rayquaza while also Speed typing with opposing Arceus. Lum Berry allows Arceus to more effectively check Darkrai, Klefki, and support Arceus formes with Will-O-Wisp, while Life Orb can be used for extra power, but then the lack of Lum Berry to check Darkrai can be problematic.</p> <h1>Usage Tips</h1> <p>Arceus functions best as a late-game cleaner once checks such as Giratina have been worn down or removed. It can also be used mid-game to check foes such as Darkrai and Klefki with its Lum Berry, but it likely won't be sweeping. Keep Arceus alive to check boosting sweepers such as Xerneas, as Extreme Speed can be useful to pick off weakened foes. Arceus's coverage moves should be revealed carefully, as it can often lure an assumed counter such as Yveltal by bluffing what it's running. When used with other Arceus, it is often useful to sacrifice one to wear down checks such as Arceus-Rock for the other. Magic Coat sets should be used to check Darkrai and potentially annoy entry hazard setters such as Primal Groudon.</p> <h1>Team Options</h1> <p>Multiple Arceus formes support one another quite well, as they can run different coverage moves for each one to break down different checks and counters for another one to sweep. Wallbreakers such as Swords Dance Primal Groudon and Choice Band Mega Rayquaza can break down foes such as Mega Sableye for Arceus to sweep. Entry hazard support from teammates such as Primal Groudon and Skarmory is also useful to chip away at Arceus's counters. Checks to Ghost-types such as Darkrai help threaten Arceus's main offensive checks, and Yveltal in particular can help to provide wallbreaking support and check both Ghost-types and Mega Mewtwo X. Mega Gengar can trap and remove counters to Arceus such as Lugia and Skarmory while also checking Ghost-types. If you're using Life Orb, status absorbers such as Rest Primal Kyogre can switch into Will-O-Wisp for Arceus. Checks to Yveltal such as Arceus-Fairy and Mega Diancie can be useful if Arceus declines to run Stone Edge. Strong special attackers such as Xerneas and Primal Kyogre can help break down physical walls such as Giratina for Arceus.</p> "
      },
      {
        "name": "Wallceus",
        "description": "<h1>Moves</h1> <p>Arceus can choose to run either Stealth Rock or Defog to function as an entry hazard setter or remover depending on its role on the team. Recover keeps it healthy over long games. Will-O-Wisp cripples physical attackers such as Arceus-Ghost to prevent Arceus from being setup fodder, while Toxic can be used to target Primal Groudon and be more crippling to support Arceus formes but does not cripple physically offensive foes as effectively. Roar phazes foes to prevent Arceus from being setup fodder and can rack up chip damage with entry hazards.</p> <h1>Set Details</h1> <p>Near-maximum HP and Defense investment makes Arceus as bulky as possible to take on Mega Rayquaza, Extreme Killer Arceus, and other physical attackers more effectively. 16 Speed EVs allow Arceus to outspeed maximum Speed Adamant Ho-Oh and Primal Groudon to use Stealth Rock, Toxic, or Defog before being KOed. Leftovers provides additional passive recovery to make Arceus less reliant on using Recover frequently, although Rocky Helmet can be used for extra chip damage on opposing physical attackers.</p> <h1>Usage Tips</h1> <p>Wallceus's main goal is to either keep setting up Stealth Rock or keep removing entry hazards throughout a game while also checking physical attackers. Pivot into physically offensive threats such as opposing Extreme Killers frequently, especially when running Rocky Helmet. If possible, aim to cripple foes with status before phazing them. Keep Wallceus healthy in order to check stronger physical attackers such as Mega Rayquaza by using Recover frequently. Wallceus is also useful to check evasion-boosting foes such as Clefable. If facing a Mega Gengar, pivot frequently to avoid being trapped and crippled or KOed.</p> <h1>Team Options</h1> <p>Teammates that need a fairly reliable switch-in to most physical attackers like Mega Rayquaza, such as Ho-Oh, appreciate having a check to physical revenge killers. Entry hazard-weak teammates such as Lugia appreciate Defog support, while wallbreakers such as Mega Rayquaza enjoy Stealth Rock support. Pokemon that can switch into status moves, such as Mega Diancie, can help take Toxic and Will-O-Wisp for Arceus, and Heal Bell users such as Clefable are also useful to keep it status free. Checks to Darkrai such as Xerneas are essential, as it can break through Wallceus easily. Xerneas and special Arceus formes are also useful for taking on Mega Sableye and Mega Diancie, which can Magic Bounce back all of Wallceus's status moves. Somewhat weaker attackers such as Shaymin-S can benefit from Wallceus's ability to wear down teams with status and phazing. Although there is little Wallceus can do about Mega Gengar, Pursuit Tyranitar can potentially help to trap it.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 262044, "username": "Chloe"}, {"user_id": 277877, "username": "HunterStorm"}, {"user_id": 273913, "username": "Enzo Gorlami"}]}, {"name": "Grammar checked by", "members": [{"user_id": 168392, "username": "P Squared"}, {"user_id": 232216, "username": "The Dutch Plumberjack"}]}], "writtenBy": [{"user_id": 202117, "username": "MZ"}]}
  },
  "Arceus-Fairy": {
    "overview": "<p>Arceus-Fairy has an incredible offensive and defensive typing that threatens many common Pokemon. It can easily take on common metagame picks such as Yveltal, Arceus-Dragon, and Giratina while being the closest thing to a counter to Mega Rayquaza. Arceus-Fairy has an incredible movepool that includes recovery, status, hazard removal, and amazing coverage to go along with its excellent stats. It can power through teams with Calm Mind, can reliably set up Stealth Rock by forcing out Pokemon that have Magic Bounce, and functions as an excellent glue that can fit on nearly every team. While Fairy has few weaknesses, it also has few resistances, making it hard to find opportunities to freely switch in. Furthermore, Arceus-Fairy often has difficulty harming common Pokemon such as Primal Groudon, Ho-Oh, Arceus-Steel, and Primal Kyogre along with having a crippling weakness to Mega Gengar.</p> ",
    "comments": "<h1>Other Options</h1> <p>Thunder Wave cripples sweepers by greatly lowering their Speed stat, but is usually inferior to either Will-O-Wisp or Toxic. Refresh can cure status and increase longevity but it is often niche due to its inability to remove confusion and sleep. Iron Defense can be an option on Calm Mind variants to beat physical attackers, but Arceus-Fairy usually prefers coverage. Magic Coat bounces back hazards and status such as Darkrai's Dark Void, but using it requires careful prediction.</p> <p>Perish Song is great to beat Baton Pass teams with an Ingrain user, but it has little other utility. Thunder is also a coverage option to beat Flying-types, especially Ho-Oh and Skarmory. Unlike Thunderbolt, Thunder deals more damage to super effective targets than Judgment does.</p> <p>Stone Edge can be used to OHKO Ho-Oh from full HP, but that requires Arceus-Fairy to go mixed with 144 Attack EVs. Flamethrower and Fire Blast are good tricks to smack around most unsuspecting Steel-types, but Arceus-Fairy often has no moveslot to spare. Fully offensive Arceus-Fairy is nice for the extra power, but the lack of bulk can often be annoying. Safeguard is a great move to block status for teammates and Arceus-Fairy itself, but it must be used before the opponent launches the status, thus preventing it from being used to reliably take on Darkrai or Klefki.</p> <h1>Checks and Counters</h1> <p><strong>Steel-types: Steel-types can switch into Arceus-Fairy's STAB Judgment. Mega Scizor in particular is able to switch in on both Arceus-Fairy’s STAB and coverage moves to deal heavy damage with Bullet Punch. Skarmory can also easily take any standard coverage hit and force Arceus-Fairy out, while Arceus-Steel doesn't really care about any attacks that Arceus-Fairy uses. No Steel-type, however, appreciates Will-O-Wisp.</p> <p><strong>Ho-Oh and Primal Groudon: Ho-Oh and Primal Groudon are the most offensive Arceus-Fairy switch-ins and can easily wall it while dishing out severe damage. Ho-Oh's typing provides resistances to both Arceus-Fairy's STAB move and its main coverage options, while Primal Groudon is able to boost to knock out Arceus-Fairy or phaze it with Roar. Primal Groudon risks being worn down if it lacks Rest, however, and neither Primal Groudon nor Ho-Oh appreciates Toxic or the rarer coverage options.</p> <p><strong>Lugia</strong>: Lugia is a very solid Arceus-Fairy counter that can wall both sets with ease, even after several boosts. It checks Arceus-Fairy even after six Calm Minds and can phaze it, but this shouldn't be relied upon due to the commonality of Stealth Rock. While it is not crippling, Lugia also dislikes status, as burn and poison break the protection granted by Multiscale.</p> <p><strong>Setup Sweepers</strong>: If Arceus-Fairy lacks Roar or if the opponent is down to their final Pokemon, it is setup bait for Pokemon such as Primal Groudon, Lum Berry + Magic Coat Arceus, Geomancy Xerneas, and opposing Calm Mind Arceus formes.</p> <p><strong>Primal Kyogre: Due to its superior stats and rain-boosted STAB moves, Primal Kyogre will nearly always win versus Arceus-Fairy. It dislikes status unless it runs Rest, but it still easily powers through unless Arceus-Fairy has significant boosts.</p> <p><strong>Mega Gengar</strong>: A super effective Sludge Wave from Mega Gengar deals heavy damage, and its ability, Shadow Tag, prevents Arceus-Fairy from being withdrawn. While a boosted Arceus-Fairy can potentially defeat it, Mega Gengar must be carefully played around throughout the match.</p> <p><strong>Arceus-Poison</strong>: While it greatly dislikes Will-O-Wisp and cannot take boosted Earth Powers, Arceus-Poison easily switches in on Toxic or Judgment and powers through Arceus-Fairy with its super effective STAB moves.</p> ",
    "sets": [
      {
        "name": "Support",
        "description": "<h1>Moves</h1> <p>Judgment is Arceus-Fairy's only STAB move, coming in at an impressive 120 Base Power after the boost from Pixie Plate. Recover is necessary to keep Arceus-Fairy healthy throughout the match, allowing it to maintain the bulk it needs to check certain Pokemon. Toxic hits Ho-Oh, Lugia, and support Arceus while making Arceus-Fairy harder to switch in on; it puts opposing Pokemon on a timer and removes Lum Berries, at the cost of worsening Arceus-Fairy's matchup versus Steel- and Poison-types. Will-O-Wisp allows Arceus-Fairy to safely take on offensive Arceus formes and other physical setup sweepers, but it comes with a worse matchup against stall and Fire-types. Roar forces the opponent's Pokemon out, removing boosts and racking up chip damage should entry hazards be up. Defog removes hazards for the rest of the team, allowing for more and easier switching. Stealth Rock allows Arceus-Fairy to punish switching by getting chip damage, pairing up very well with Roar.</p> <h1>Set Details</h1> <p>The 16 Speed EVs let Arceus-Fairy outspeed maximum Speed neutral-natured base 90 Speed Pokemon such as Ho-Oh as well as anything slower, such as bulky Primal Groudon or Geomancy Xerneas before boosting. The remaining EVs let Arceus-Fairy be as physically bulky as possible. Defense investment is used over Special Defense because Anything Goes is full of powerful physical attackers.</p> <h1>Usage Tips</h1> <p>Early on in the game, Arceus-Fairy should be spamming its status moves to cripple switch-ins for teammates. Arceus-Fairy functions as a good anti-lead as well due to its excellent hazard removal and bulk. Until Mega Rayquaza is knocked out, Arceus-Fairy should be kept as healthy as possible to check it. If your opponent has a Mega Gengar, aggressively double switch because Arceus-Fairy is easily trapped and KOed by a super effective Sludge Wave. Arceus-Fairy is a great switch-in for common Pokemon such as Yveltal, Mega Diancie, and Mega Mewtwo X. Defog should be used whenever the hazards on the field harm your team more than your opponent's team, particularly if hazards are only on your side or you are playing against a Spikes-stacking team. Stealth Rock should be set up as early as possible to break Focus Sashes and punish any switching throughout the match. If it is removed, reapply it at the next opportunity.</p> <h1>Team Options</h1> <p>Arceus-Fairy partners well with Arceus-Rock and Zekrom, as they can take on Ho-Oh without much trouble. Bulky Yveltal, Ho-Oh, and Skarmory are also excellent teammates because they are able to defeat any setup sweepers that attempt to boost on Arceus-Fairy. Physically bulky Pokemon such as Arceus-Water and Lugia pair well with Arceus-Fairy due to their ability to take on Primal Groudon, a common Arceus-Fairy check. Arceus-Fairy is one of the most reliable hazard removers in the tier, so Pokemon that need hazards gone, like Ho-Oh and Mega Rayquaza, have great synergy with Arceus-Fairy. Should you decide to run Stealth Rock instead, Pokemon that want hazards up on the opponent's side in order to sweep, such as Darkrai and Xerneas, are great teammates. Pokemon that can take on Arceus-Poison and Arceus-Steel, such as Primal Groudon, Arceus-Ground, and Klefki, are useful as well. However, Arceus-Fairy is largely a self-sufficient Pokemon and one that can function as a glue for teams requiring its support.</p> "
      },
      {
        "name": "Calm Mind",
        "description": "<h1>Moves</h1> <p>Judgment is Arceus-Fairy's most powerful STAB move, getting further boosted by Pixie Plate and any Special Attack boosts that Arceus-Fairy might acquire. Calm Mind allows Arceus-Fairy to power through its checks and sweep while allowing it to take on opposing special attackers more easily; it also allows Arceus-Fairy to power through most balanced and stall teams with just a few boosts. Recover allows Arceus-Fairy to maintain its health while setting up, most notably letting it set up without consequence on Pokemon too weak to seriously harm it. Earth Power breaks past the Fire-, Poison-, and Steel-types that wall Arceus-Fairy, only notably missing out on Ho-Oh.</p> <h1>Set Details</h1> <p>Maximum Speed investment with a Timid nature allows Arceus-Fairy to Speed tie with opposing variants of Arceus and outspeed many common threats such as Mega Rayquaza and Mega Diancie. 184 Defense EVs and 72 HP EVs allow Arceus-Fairy to nearly always survive a Dragon Ascent from a +1 Adamant Mega Rayquaza after Stealth Rock while maintaining respectable mixed bulk. Arceus-Fairy can boost its Special Attack and Special Defense stats, making investing in them largely unneeded.</p> <h1>Usage Tips</h1> <p>Try to reveal as little as possible about Arceus-Fairy's set in order to make the opponent believe that it is a defensive set, potentially allowing you to get two turns of setup before they bring in their answer. Once its checks have been sufficiently weakened so that they can be defeated after a Calm Mind boost, bring Arceus-Fairy in on something it forces out and begin boosting. Some good Pokemon for Arceus-Fairy to set up against are passive Pokemon such as Dragon Tail Giratina, Mega Sableye, and attackers such as Yveltal and Mega Mewtwo X, since they deal very little damage to it. Other relatively weak special support Pokemon such as Mega Diancie are also good setup fodder for Calm Mind Arceus-Fairy. Once Arceus-Fairy gets going, it is very difficult to stop, but not impossible. Don't sacrifice it against Pokemon it cannot KO such as Ho-Oh just because you don't want to lose the boosts; unlike Geomancy Xerneas, it can set up more than once. Avoid Toxic if possible; burn and paralysis let Arceus-Fairy defeat Darkrai more easily, but being badly poisoned stops it from sweeping. Keeping Earth Power unrevealed can be nice to take advantage of the opponent's confidence in their Fairy-resistant Pokemon, but don't avoid using it when it is appropriate to just because you don't want them to find out.</p> <h1>Team Options</h1> <p>Magic Bounce Pokemon like Mega Diancie take on Klefki, a major headache for this set; they also make the opponent think twice about using Toxic. Skarmory is able to take priority attacks for Arceus-Fairy when it is low on HP, as well as damaging attackers with Rocky Helmet and forcing out attackers such as Extreme Killer Arceus and Choice Scarf Genesect. Other Steel-type counters such as Primal Groudon, Arceus-Ground, Ho-Oh, and Primal Kyogre are nice to take take Steel-type attacks and retaliate by breaking holes in the opponent's team. Poison-type counters such as the aforementioned Primal Groudon and Arceus-Ground are also nice, especially considering their ability to check both Poison- and Steel-types.</p> <p>Stealth Rock users are very beneficial partners to Arceus-Fairy, as they are able to wear down Ho-Oh and break Lugia's Multiscale. Arceus-Fairy and Xerneas are good teammates because they can break down each other's checks and counters; there are usually at most one or two Pokemon that resist Fairy on a team, so any chip damage can be the difference between being KOed while trying to sweep and knocking out the opposing Pokemon. Ho-Oh, for instance, only needs 20% chip damage before it is KOed by a Thunder from a +2 Xerneas. Arceus-Rock and Zekrom are easily able to come in on any attack from Ho-Oh, barring a Choice Band-boosted Earthquake, and outspeed it and OHKO with their respective Judgment and Bolt Strike, making them excellent teammates. Arceus-Water can do the same, but it misses out on the OHKO.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 202117, "username": "MZ"}, {"user_id": 262044, "username": "Chloe"}, {"user_id": 273913, "username": "Enzo Gorlami"}]}, {"name": "Grammar checked by", "members": [{"user_id": 168392, "username": "P Squared"}, {"user_id": 91628, "username": "GatoDelFuego"}]}], "writtenBy": [{"user_id": 297239, "username": "Quantum Tesseract"}]}
  },
  "Arceus-Ground": {
    "overview": "<p>Arceus-Ground is a very good Pokemon in Anything Goes, as its ability to set up and sweep using either attacking stat makes it unpredictable. While other Arceus formes are used more often in support roles, Arceus-Ground is the most effective Arceus forme to use against the ever-present Primal Groudon, giving it a niche in a support role as well, further adding to its viability. Unfortunately, it loses to most of the common Water-types, such as Kyogre, Primal Kyogre, and Arceus-Water. It also loses to some common walls, such as Skarmory and Ho-Oh, once it reveals whether if it is a physical attacker or special attacker. However, its resistance to Stealth Rock makes it an effective Defog user, and it functions as a decent Klefki check due to its immunity to Thunder Wave, giving it a firm niche in Anything Goes.</p> ",
    "comments": "<h1>Other Options</h1> <p>Thunder can be used on a specially attacking set to hit Kyogre, Ho-Oh, and Primal Kyogre for decent damage; however, Arceus-Ground needs to have a Calm Mind boost to be able to do decent damage to these Pokemon. Roar can be used to discourage the opponent from setting up and works really well on entry hazard-stacking teams featuring Pokemon such as Ferrothorn, Skarmory, and Scolipede. Perish Song is an option to check setup Pokemon, evasion users, and Baton Pass teams. Refresh makes Arceus-Ground less weak to status and allows it to set up on bulky Arceus formes that use Will-O-Wisp or Toxic, such as Fairy Arceus and bulky Arceus. Magic Coat is an option to bounce back status moves used by Pokemon such as Darkrai, Smeargle, and Klefki or entry hazards from the likes of Skarmory, Ferrothorn, opposing Arceus formes, and Primal Groudon. Overheat can be used on the physical set to lure and KO Skarmory.</p> <h1>Checks and Counters</h1> <p><strong>Water-types: Choice Scarf Kyogre can easily revenge kill any Arceus-Ground set with its rain-boosted Water-type STAB attacks. Primal Kyogre can tank hits from the special set all day long and retaliate with a strong Origin Pulse. It dislikes eating Earthquake from the physical set, though. Arceus-Water is bulky enough to withstand any hit and retaliate with a super effective Judgment. Palkia can hit Arceus-Ground hard with STAB Hydro Pump; however, it is rare in Anything Goes and takes a lot of damage from Arceus-Ground's attacks.</p> <p><strong>Bronzong: Bronzong takes very little damage from anything Arceus-Ground does and can set up Stealth Rock and Toxic it in return.</p> <p><strong>Flying-types</strong>: Flying-types bulky enough to take Arceus-Ground's coverage moves can be difficult to handle. If Multiscale is intact, Lugia can come in and phaze Arceus-Ground easily. It does take a large chunk of damage from +2 Stone Edge and +2 Ice Beam, however, but it still survives and can switch in as Arceus-Ground boosts. Skarmory hard walls the physical set, not being 2HKOed by +2 Stone Edge and being able to phaze it.</p> <p><strong>Ho-Oh: Ho-Oh gets a special mention, as it hard walls both the special Arceus-Ground set and the support set. Its massive special bulk allows it to tank any hit from either set and either phaze it or attempt to get a burn with Sacred Fire. It must watch out for Stone Edge, however, so often the Ho-Oh user will switch it out of Arceus-Ground until its set is revealed.</p> <p><strong>Xerneas</strong>: Xerneas can set up on the support set and beats the Calm Mind set in a one-on-one situation due to the combination of Geomancy and Power Herb boosting Xerneas faster than Calm Mind boosts Arceus-Ground.</p> <p><strong>Darkrai</strong>: Darkrai can outspeed Arceus-Ground, put it to sleep with Dark Void, and set up a Substitute or attempt to KO it with Dark Pulse.</p> <p><strong>Status Users</strong>: Toxic wears all Arceus-Ground sets down very quickly and prevents it from doing too much damage. Burn damage is slightly more manageable for the special sweeper and support sets, but it is still annoying to play around, and it cripples the physical sweeper set.</p> <p><strong>Giratina</strong>: Giratina is bulky enough to tank any hit from Arceus-Ground, even if it has a boost already, and proceed to burn the physical attacking set with Will-O-Wisp or phaze the special attacking set with Roar. It can also use Rest to get rid of all status or damage taken from any set.</p> ",
    "sets": [
      {
        "name": "Physical Sweeper",
        "description": "<h1>Moves</h1> <p>Swords Dance boosts Arceus-Ground's Attack to monstrous levels. Earthquake is mandatory as a very strong STAB move that is boosted further by Earth Plate. Stone Edge completes the classic EdgeQuake coverage and hits Flying-types such as Ho-Oh, Lugia, and Yveltal, which Earthquake fails to hit. Extreme Speed nabs KOs on weakened Pokemon and hits Xerneas and Choice Scarf Kyogre before they can KO Arceus-Ground. Recover is an option that allows Arceus-Ground to check Primal Groudon more easily and set up on a wider range of attacks.</p> <h1>Set Details</h1> <p>Arceus-Ground runs a very simple EV spread with maximum Attack investment for grabbing more KOs and maximum Speed investment to outspeed as much as possible. A Jolly nature is used to Speed tie with opposing Arceus formes and outspeed Mega Rayquaza and Mega Diancie. Adamant is another option that gives it a notable power increase, including almost guaranteeing the OHKO on physically defensive Yveltal after Stealth Rock damage with a Swords Dance boost, but generally the Speed tier that a Jolly nature lets Arceus-Ground hit is much more preferred.</p> <h1>Usage Tips</h1> <p>Arceus-Ground can be used to set up and break down threats for teammates to clean up later; alternatively, it can be used as a late-game cleaner once its checks and counters have been removed. An effective way to use it is to play mind games with your opponent by bluffing the special or support set and then revealing the physical set and hopefully nabbing a KO or two. Good targets to set up on include Primal Groudon, Aegislash, Arceus-Poison, and Arceus-Steel; just watch out for burns from Lava Plume or Will-O-Wisp. Arceus-Ground can be brought in to revenge kill weakened foes with Extreme Speed before attempting to actually sweep. It should be run on offensive teams that can wear down or defeat its checks and counters.</p> <h1>Team Options</h1> <p>Xerneas and Arceus-Ground form a fantastic duo with amazing offensive synergy, each demolishing the other's checks. Arceus-Ground can eliminate Arceus-Steel, Arceus-Poison, Primal Groudon, Aegislash, and Ho-Oh, while Xerneas can defeat Skarmory, Yveltal, and Giratina. Xerneas does need Ingrain and Aromatherapy to effectively handle Skarmory, though. Arceus-Fairy can easily dispatch annoying Pokemon such as Yveltal and Giratina and appreciates Arceus-Ground eliminating Steel-types. Zekrom handles Lugia, Yveltal, Skarmory, and both formes of Kyogre for Arceus-Ground. Mega Diancie stops Darkrai from putting Arceus-Ground to sleep and can defeat Skarmory with Hidden Power Fire. Good checks to Kyogre such as Palkia and Primal Groudon are necessary on teams with Arceus-Ground. Mega Gengar can trap and eliminate Skarmory and Darkrai if it has Focus Blast.</p> "
      },
      {
        "name": "Special Sweeper",
        "description": "<h1>Moves</h1> <p>Calm Mind boosts Arceus-Ground's Special Attack and Special Defense in order to attempt a sweep. Judgment is generally Arceus-Ground's go-to attacking move. Ice Beam is for Flying-type Pokemon such as Yveltal, Mega Rayquaza, and Lugia, which are immune to Judgment, as well as hitting Levitate users such as Giratina-O and Gengar. Recover is used to allow Arceus-Ground to heal off damage accrued during setup and check Primal Groudon and Klefki better.</p> <h1>Set Details</h1> <p>Maximum Speed investment with a Timid nature is used to Speed tie with opposing Arceus formes and outspeed Mega Rayquaza. 180 Special Attack EVs are used to OHKO Mega Rayquaza with Ice Beam at +1 Special Attack after Stealth Rock damage. 4 Special Defense EVs give Download Genesect an Attack boost instead of an Special Attack boost, forcing it to do less with Ice Beam, the move it usually carries to hit Ground-types for super effective damage. 72 HP EVs give Arceus-Ground a bit of bulk.</p> <h1>Usage Tips</h1> <p>Arceus-Ground should generally be brought in to sweep late-game, after its checks, such as Ho-Oh, Darkrai, and Lugia, have been weakened or eliminated. That being said, it can also be brought in mid-game if you need it to check or remove certain Pokemon, such as Klefki and Primal Groudon; however, make sure it is at reasonable health when you switch it out to keep it healthy for later in the match. It will almost always force out Primal Groudon, so that is an excellent opportunity to set up, and it can also set up on weaker attackers without super effective moves such as Mega Diancie.</p> <h1>Team Options</h1> <p>Arceus-Rock is a good teammate, as Ho-Oh troubles this set. Bulky Water-types such as Primal Kyogre and Arceus-Water make for good teammates as well, checking Ho-Oh and weakening or crippling Arceus-Ground's other checks with status. Primal Groudon is a nifty partner, as it can check both Primal Kyogre and Xerneas individually, two threats to Arceus-Ground. Mega Diancie prevents Darkrai from halting Arceus-Ground's sweep while also outspeeding and KOing Ho-Oh.</p> "
      },
      {
        "name": "Support",
        "description": "<h1>Moves</h1> <p>Judgment allows Arceus-Ground to defeat Primal Groudon, as well as Steel-types and Poison-types, while also making it not Taunt bait. Recover gives Arceus-Ground more longevity and allows it to more effectively check Klefki and Primal Groudon. Arceus-Ground is an excellent Defog user due to its resistance to Stealth Rock and ability to take on most Stealth Rock users; however, if a Defog user is found elsewhere on the team, the move can be replaced with Ice Beam or Will-O-Wisp. Ice Beam is a more reliable way of handling Mega Rayquaza than Will-O-Wisp due to Lum Berry being a very common item on it, while Will-O-Wisp allows Arceus-Ground to burn Pokemon such as Skarmory, Ferrothorn, Arceus-Ghost, and Arceus, making it a nuisance and crippling most Stealth Rock users. It can also be an effective Stealth Rock setter itself due to its ability to force switches against some top Pokemon in Anything Goes.</p> <h1>Set Details</h1> <p>The Speed EVs allow Arceus-Ground to outspeed fully invested neutral-natured base 90 Speed Pokemon such as Primal Groudon. Running 252 HP EVs and 240 Defense EVs with a Bold nature maximizes Arceus-Ground's physical bulk to better take on Mega Rayquaza, Primal Groudon, and opposing Arceus formes. 124 Speed EVs can be used to outspeed all Primal Groudon and Primal Kyogre; however, any more investment severely compromises Arceus-Ground's bulk.</p> <h1>Usage Tips</h1> <p>Arceus-Ground can be brought in whenever it can safely wall something and remove entry hazards. Bring it in every time on Primal Groudon and most times on Klefki if you lack a separate check to it. An excellent way to use this set is to bring it in on a physical attacker, burn it, and then switch out to a teammate that can set up and sweep. Arceus-Ground makes for a great lead due to its ability to cripple opposing leads with Will-O-Wisp or set up Stealth Rock for your team.</p> <h1>Team Options</h1> <p>Arceus-Rock and Water-types such as Kyogre, Palkia, and Arceus-Water make for good teammates, as they can handle Ho-Oh and other Flying-types that Arceus-Ground may have trouble with. Defensive Pokemon such as Ho-Oh, Yveltal, and Lugia appreciate Arceus-Ground's entry hazard removal, as Stealth Rock cripples all three to the point where they may be unable to check the Pokemon they must. Sweepers such as Xerneas and Arceus appreciate the free switches and setup opportunities Arceus-Ground provides, as well as their checks being crippled or removed.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 273913, "username": "Enzo Gorlami"}, {"user_id": 276133, "username": "Josh"}, {"user_id": 228835, "username": "Trickster"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "The Dutch Plumberjack"}, {"user_id": 168392, "username": "P Squared"}]}], "writtenBy": [{"user_id": 250201, "username": "InfernapeTropius11"}]}
  },
  "Arceus-Water": {
    "overview": "<p>A great defensive typing in pure Water, leaving it with only two uncommon weaknesses, makes Arceus-Water one of the best support Arceus formes. In addition to its lack of common weaknesses, Arceus-Water is capable of beating common Pokemon such as Ho-Oh, Primal Kyogre lacking Thunder, and Mega Diancie. Like every Arceus forme, Arceus-Water has excellent bulk and an extremely expansive movepool. However, Arceus-Water is very weak to status, especially Toxic, which heavily cripples it.</p> ",
    "comments": "<h1>Other Options</h1> <p>Forgoing Defog and opting to run both Judgment and Ice Beam is a viable alternative for teams that don't need entry hazards removed and rely on entry hazards of their own, but Arceus-Water is still relatively passive and loses a lot of its utility. Will-O-Wisp can be used instead of Toxic to cripple physical attackers, but it is less effective at wearing down opposing Pokemon, and bulky walls can handle burns more easily than Toxic. Will-O-Wisp also cannot touch Primal Groudon, letting it wall Arceus-Water more easily. Arceus-Water can also run Stealth Rock, but this mandates using Roar, which means replacing Toxic or Recover, and thereby hurting Arceus-Water's longevity.</p> <h1>Checks and Counters</h1> <p><strong>Status: All forms of status completely cripple Arceus-Water. Toxic especially wears Arceus-Water down extremely fast and puts it on a timer.</p> <p><strong>Setup Sweepers</strong>: Setup sweepers such as Swords Dance Primal Groudon and Geomancy Xerneas can quite often easily set up on Arceus-Water and proceed to overwhelm it with their boosted power.</p> <p><strong>Steel-types: Steel-type Pokemon are immune to Toxic, meaning Arceus-Water will have difficulty overcoming them. Arceus-Steel can simply set up on Arceus-Water, Ferrothorn can stack hazards as well as cripple it with Thunder Wave, and Dialga resists Judgment and has a neutrality to Ice Beam, completely shutting Arceus-Water down.</p> <p><strong>Mega Gengar: Mega Gengar traps and easily eliminates Arceus-Water. If the opponent has a Mega Gengar, it is difficult to send Arceus-Water in because it can be picked off very easily, even with just one misprediction.</p> ",
    "sets": [
      {
        "name": "Bulky Support",
        "description": "<h1>Moves</h1> <p>Toxic wears down most foes and provides very helpful passive damage considering Arceus-Water has very little offensive presence. Toxic also forces out common Stealth Rock setters such as Primal Groudon, which can provide turns to reliably use Defog. Recover lets Arceus-Water stay around longer. Defog clears entry hazards from the field, providing team support. Judgment allows Arceus-Water to hit most Pokemon decently hard even uninvested and does a fair bit to Ho-Oh. Ice Beam is an alternative attacking option, giving Arceus-Water a way to actually damage Primal Groudon besides Toxic and deal a significant amount of damage to Mega Rayquaza.</p> <h1>Set Details</h1> <p>Splash Plate is required for Arceus-Water to become Water-type. Running 16 Speed EVs allows Arceus-Water to outpace 252 Speed neutral-natured Primal Groudon. 252 HP EVs and 240 Defense EVs along with a Bold nature make Arceus-Water as physically bulky as possible. Alternatively, a faster EV spread with 218 Speed EVs can be used with a Timid nature in order to outspeed Mega Rayquaza and cripple it with Toxic or damage it with Ice Beam. However, this severely reduces Arceus-Water's bulk, making it less effective at switching into the likes of Ho-Oh.</p> <h1>Usage Tips</h1> <p>Spread Toxic as much as possible to cripple and wear down the opponent's team. If the opponent has a Magic Bounce user such as Mega Sableye or Mega Diancie, be wary of using Toxic so that Arceus-Water won't cripple itself. Use Judgment when Magic Bounce users are predicted to switch in so that Arceus-Water can weaken them. Arceus-Water needs to be kept as healthy as possible so that it can handle the likes of Ho-Oh easily because Stealth Rock and burns from Sacred Fire can wear it down very quickly. Avoid faster users of Taunt such as Darkrai, Mega Mewtwo X and Y, Mega Gengar, and Yveltal. Avoid using Defog against setup sweepers, as the likes of Mega Rayquaza can set up and OHKO Arceus-Water, so just use Ice Beam to pick it off before it can accumulate enough boosts to OHKO Arceus-Water.</p> <h1>Team Options</h1> <p>Mega Sableye pairs well with Arceus-Water because it can deflect status, as well as spread status of its own. It can also stomach quite a few physical attacks itself and help prevent Arceus-Water from being overwhelmed by entry hazards. Ho-Oh appreciates Arceus-Water removing Stealth Rock from the field for it, and in turn it can check Xerneas, which sets up on Arceus-Water. Primal Groudon has good synergy with Arceus-Water, as it can come in on Thunder Primal Kyogre and Zekrom, while Arceus-Water can pivot into Primal Kyogre's Water- and Ice-type moves. Arceus-Water struggles to take down Steel-type Pokemon, so pairing it with something with super effective coverage on most Steel-types such as Mega Mewtwo X or Ho-Oh is very beneficial. Clerics such as Blissey and Mega Diancie aid Arceus-Water by healing its status, and in turn Arceus-Water can handle physical attacks for Blissey. Ferrothorn can greatly aid Arceus-Water because it easily switches in on Zekrom and Primal Kyogre, two of the biggest threats to Arceus-Water, and is also capable of absorbing Toxic. Unaware users such as Clefable and Quagsire can beat many threats that are capable of setting up on Arceus-Water. Clefable is capable of taking on Darkrai and Xerneas, while Quagsire takes on Arceus and Swords Dance Primal Groudon.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 262044, "username": "Chloe"}, {"user_id": 202117, "username": "MZ"}, {"user_id": 277877, "username": "HunterStorm"}]}, {"name": "Grammar checked by", "members": [{"user_id": 168392, "username": "P Squared"}, {"user_id": 193885, "username": "Haund"}]}], "writtenBy": [{"user_id": 276133, "username": "Josh"}]}
  },
  "Espeon": {
    "overview": "<p>Espeon is the most important Pokemon on Baton Pass teams thanks to a combination of its ability Magic Bounce, formidable power, and decent Speed tier. If you are just looking for a Magic Bounce user and not a full Baton Pass team, use Mega Diancie or Sableye on offense and balance or stall, respectively. With STAB Stored Power backed up by Baton Passed boosts, Espeon can sweep a large portion of teams. Nothing beats it one-on-one once it has set up, but it sometimes finds difficulty doing so due to its reliance on hax and its terrible stats. It also requires heavy team support in order to function and is near useless on its own.</p> ",
    "comments": "<h1>Other Options</h1> <p>When using two Espeon, a second Espeon set with no Special Attack investment and instead HP investment can be extremely useful for supporting a team so that you don't need to rely on your wincon to also block status moves and entry hazards.</p> <h1>Checks and Counters</h1> <p><strong>Perish Song</strong>: Perish Song is the biggest counter to Baton Pass teams; if the opponent has a Pokemon with Perish Song, Espeon's team can often just lose at Team Preview.</p> <p><strong>Ditto</strong>: If Espeon doesn't have a Substitute up, Ditto can come in, copy all of Espeon's boosts, and Baton Pass to a teammate of choice, which can then potentially countersweep.</p> <p><strong>Haze</strong>: Haze removes all boosts, rendering Espeon completely useless. Luckily, Haze is nearly never seen in Anything Goes.</p> <p><strong>Psych Up Users</strong>: Though uncommon, Psych Up users such as Mega Mewtwo Y, Primal Groudon, and Arceus can easily render Baton Pass useless by copying boosts.</p> <p><strong>Primal Kyogre: Thunder ignores evasion in rain, which can let Kyogre break Baton Pass early in the game. The chance to paralyze is also annoying. However, if Espeon has had a few Special Defense boosts passed to it, Primal Kyogre loses one-on-one.</p> <p><strong>Strong Attackers</strong>: Strong attackers such as Rayquaza and Life Orb Extreme Killer Arceus are huge threats for Espeon and Baton Pass teams in general, as they threaten to break through boosts and KO Espeon and its teammates before they can finish the Baton Pass chain. However, if Espeon has enough boosts passed to it, it can beat the strong attackers one-on-one.</p> ",
    "sets": [
      {
        "name": "Sweeper",
        "description": "<h1>Moves</h1> <p>Stored Power takes advantage of all of the boosts Espeon's team has Baton Passed to it. Dazzling Gleam is essential coverage for Dark-type Pokemon. Substitute capitalizes on the evasion that is often Baton Passed to Espeon, which allows it to get free Substitutes up. Espeon will also often have numerous defensive boosts, which prevent a large portion of attackers from breaking the Substitute. Baton Pass allows Espeon to continue the Baton Pass chain.</p> <h1>Set Details</h1> <p>Magic Bounce is Espeon's only viable ability, granting it an immunity to Taunt, phazing, and status. Leftovers gives Espeon passive recovery. The given EVs and a Timid nature allow Espeon to be as fast as possible with maximum damage output.</p> <h1>Usage Tips</h1> <p>Early-game, Espeon is used to reflect entry hazards, Taunt, and phazing. Late-game, once your Baton Pass chain is all boosted up, Espeon is used for sweeping. Baton Passing to Espeon against Pokemon such as Klefki and Mega Sableye is a good idea, as it completely walls them. Be careful when bringing Espeon in, as it is often the wincon on Baton Pass teams and if it faints you lose your only way of dealing damage.</p> <h1>Team Options</h1> <p>Espeon only fits on full Baton Pass teams, so teammates that boost Speed, Special Attack, and bulk reliably are essential. Scolipede and Blaziken are excellent options for passing Speed, as they can also pass Attack via Swords Dance.Zapdos is another great teammate for boosting Speed because it also acts as a reliable answer to Mega Rayquaza. Mr. Mime is an excellent team option because it can pass Calm Mind boosts as well as grant an immunity to Perish Song thanks to its ability Soundproof. A defensive booster such as Acid Armor Vaporeon is very important because of all the priority attacks floating around in Anything Goes. Smeargle is a great partner too because it gets stat boosts every turn thanks to Moody, helping Espeon take advantage of Stored Power, and can afford to run any moves it wants. Drifblim pairs well with Espeon, as it is the most viable Evasion passer, getting Minimize, Substitute, Magic Coat, and an excellent defensive typing, allowing it to deal with most Extreme Killers efficiently. Having two Espeon on a team can actually be very useful, giving you a second wincon and leaving more room for error.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 202117, "username": "MZ"}, {"user_id": 262044, "username": "Chloe"}, {"user_id": 277877, "username": "HunterStorm"}]}, {"name": "Grammar checked by", "members": [{"user_id": 168392, "username": "P Squared"}, {"user_id": 232216, "username": "The Dutch Plumberjack"}]}], "writtenBy": [{"user_id": 276133, "username": "Josh"}]}
  },
  "Skarmory": {
    "overview": "<p>Skarmory has a defined niche in the Anything Goes metagame as the best Extreme Killer counter there is and one of the best physical walls in general. It has great support options, such as Spikes, Stealth Rock, Whirlwind, Toxic, and especially Defog, as this move removes the need to rely on a defensive Arceus forme or Giratina. Unfortunately, Skarmory is Taunt and Magic Bounce bait, has mediocre Special Defense, and has a general lack of offensive presence.</p> ",
    "comments": "<h1>Other Options</h1> <p>Taunt is an option that allows Skarmory to deal with walls more efficiently, most notably Chansey and Blissey. Counter is an option to surprise powerful physical attackers that otherwise can beat Skarmory, such as Ho-Oh. A specially defensive spread can work on Skarmory to better check weaker special attackers; however, it is generally mediocre and not very effective. Occa Berry can be used to scout out a potential V-create Mega Rayquaza without sacrificing your Extreme Killer Arceus check. A Custap Berry + Sturdy lead set can be used to take out foes with Counter and set up Stealth Rock, although it is outclassed by Focus Sash Excadrill and Scolipede.</p> <h1>Checks and Counters</h1> <p><strong>Special Attackers: Skarmory despises special attackers in general because they have no issue breaking through it and sometimes use it as setup bait. In particular, Darkrai is a big problem because Dark Void breaks Sturdy and it usually runs Substitute to avoid Toxic damage.</p> <p><strong>Reflection: Magic Bounce renders Skarmory completely useless, reflecting all of its moves except for Iron Head and preventing it from doing much of anything. Magic Coat users such as Arceus are also very bothersome for Skarmory, as it can win 50/50s to set up and potentially beat Skarmory, or just PP stall it.</p> <p><strong>Ho-Oh</strong>: Ho-Oh's main STAB move, Sacred Fire, is super effective on Skarmory and has a 50% chance to burn it, breaking its Sturdy.</p> <p><strong>Yveltal</strong>: Both the bulky Yveltal sets with Taunt and the offensive sets destroy all Skarmory variants.</p> <p><strong>Taunt</strong>: Taunt cripples Skarmory and prevents it from doing anything. Yveltal is the most common Taunt user, but it can be seen on numerous other Pokemon randomly.</p> <p><strong>Mega Gengar</strong>: Mega Gengar's access to Taunt and Disable and its trapping capabilities severely damage Skarmory, usually disabling it completely.</p> <p><strong>Super Effective Coverage</strong>: Random super effective coverage such as Thunder on Xerneas and Lava Plume on Primal Groudon is terrible for Skarmory, because you think you can safely beat the opponent but you end up losing.</p> ",
    "sets": [
      {
        "name": "Bulky Support",
        "description": "<h1>Moves</h1> <p>Toxic is useful to wear down walls and give Skarmory a way to damage opposing Pokemon. Whirlwind is useful for both phazing foes to prevent them from setting up on Skarmory and racking up passive damage from entry hazards. Roost allows Skarmory to remain healthy for the duration of the match. Defog is useful for removing hazards in the free turns Skarmory gets. If your team isn't weak to hazards and already has a Stealth Rock setter, Spikes is an option over Defog, as is Stealth Rock, and Iron Head is an option that deals with Mega Diancie and is a way to deal more damage to Xerneas.</p> <h1>Set Details</h1> <p>Sturdy guarantees Skarmory can at least survive one hit and either phaze a boosted threat or get a Toxic off, provided it can enter without taking entry hazard damage. Rocky Helmet is useful for getting extra damage off on physical attackers and wears them down much quicker. Leftovers is also an option in order to give Skarmory some additional recovery. Shed Shell is a usable item on teams weak to Mega Gengar to prevent Skarmory from being trapped; however, it is often not worth it because of how uncommon Mega Gengar is. The EVs and a Bold nature give Skarmory the most physical bulk possible while hitting a Stealth Rock number.</p> <h1>Usage Tips</h1> <p>You should generally switch Skarmory into physical attackers and should switch it out of special ones. Be wary of letting an Arceus or Mega Rayquaza set up too much, because if they break Skarmory and are boosted, they can often sweep your team. Don't let Skarmory get weakened too much if your opponent still has an Arceus or Mega Rayquaza, because otherwise it can't switch in safely, and don't be afraid to sacrifice Skarmory if your opponent doesn't have any physical attackers left, as it is often dead weight in that situation. Keeping Sturdy intact can ensure Shadow Force Arceus-Ghost cannot pick up an OHKO even at +6; this would be achieved by constantly Roosting while Arceus-Ghost is badly poisoned. Skarmory can be 2HKOed by neither a +6 Jolly Arceus's Extreme Speed nor a +2 Jolly Mega Rayquaza's Dragon Ascent. Stacking entry hazards and shuffling your opponent's team with Whirlwind is a very effective strategy if running Spikes due to how bulky Skarmory is and how many switches it forces. Try to scout for Magic Coat and Overheat on Arceus, because if they happen to have it, Skarmory just gets destroyed. Try not to switch in Skarmory unless necessary while Mega Gengar and Darkrai are still alive, as they only need to come in on it once.</p> <h1>Team Options</h1> <p>Specially bulky Pokemon such as Kyogre and Blissey can work well with Skarmory, as they are able to take special hits for Skarmory; such a pair functions well together on semi-stall and balance teams. Darkrai and Xerneas both appreciate having Skarmory, as they are very potent setup sweepers that are both weak to revenge killing by Arceus's and Mega Rayquaza's Extreme Speed. Dragon-types such as Arceus-Dragon and Mega Rayquaza work well as teammates for Skarmory because they resist both Fire- and Electric-type attacks for Skarmory. Pokemon that appreciate Spikes, such as Genesect and Ho-Oh, are solid team options because entry hazards help them clean up more easily. Arceus-Fairy and Xerneas are good team options, as they handle the Magic Bounce users that trouble Skarmory; in addition, Xerneas not only appreciates Skarmory taking Extreme Speeds for it but also counters Yveltal in turn for Skarmory.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 202117, "username": "MZ"}, {"user_id": 262044, "username": "Chloe"}, {"user_id": 277877, "username": "HunterStorm"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "The Dutch Plumberjack"}, {"user_id": 168392, "username": "P Squared"}]}], "writtenBy": [{"user_id": 276133, "username": "Josh"}]}
  },
  "Smeargle": {
    "overview": "<p>Smeargle is unique for both its excellent movepool and position as the best Moody user in the metagame. Due to its incredibly poor bulk, Smeargle is relegated to Baton Passing stat boosts to its teammates, but it can also make use of Ingrain to help prevent Pokemon with Roar from ruining Baton Pass chains and Spore to find extra setup opportunities. Smeargle is also very easy to KO without obtaining any evasion boosts from Moody, making it reliant on beneficial boosts to be successful. Additionally, Smeargle is reliant on setting up versus sleeping foes but almost every team will naturally be able to deal with this thanks to the omnipresence of Darkrai.</p> ",
    "comments": "<h1>Other Options</h1> <p>Smeargle can be run outside of full Baton Pass teams utilizing Substitute instead of Ingrain and Leftovers rather than Focus Sash to more effectively stall for Moody boosts. However, it is still unreliable at passing boosts and is extremely vulnerable to being KOed without a Focus Sash, which it cannot use without being unable to easily accumulate boosts. A hazard lead set can be run thanks to Smeargle's access to every single entry hazard and Spore, but this is generally outclassed by other leads, such as Scolipede, due to its poor Speed and bulk and inability to beat Magic Bounce or Magic Coat users. It is, however, the only viable user of Sticky Web in the metagame. Minimize can make Smeargle less reliant on grabbing evasion boosts with Moody but sacrifices a moveslot and Smeargle often lacks the free turns to set up. Magic Coat can annoy Taunt users such as Yveltal and reflect Darkrai's Dark Void, but it is often useless, as every Pokemon in the metagame not reliant on Foul Play to do damage can OHKO or 2HKO Smeargle anyway.</p> <h1>Checks and Counters</h1> <p><strong>Faster Pokemon: Smeargle's terrible bulk means that it's OHKOed by all faster attackers if Stealth Rock has broken its Focus Sash, including weaker attackers such as defensive Arceus-Water. However, it can still put faster foes to sleep and Baton Pass out to a teammate if its Focus Sash is intact or if it gets passed Speed boosts first.</p> <p><strong>Sleep Talk and Lum Berry: Sleep Talk and Lum Berry users such as Ho-Oh and Mega Rayquaza are not crippled by Spore and can OHKO Smeargle before it has the time to accumulate Moody boosts.</p> <p><strong>Taunt: Taunt users such as Darkrai, Yveltal, and Mewtwo can render Smeargle totally useless and break its Baton Pass chain. Mega Gengar can trap Smeargle and prevent it from Baton Passing out with Taunt before KOing it.</p> <p><strong>Mega Diancie: Mega Diancie can reflect Spore back at Smeargle and threaten to KO it with Moonblast, as well as deal significant damage to any teammate Smeargle attempts to pass its boosts to.</p> <p><strong>Priority</strong>: Priority users such as Arceus and Mega Rayquaza can threaten to pick off Smeargle with Extreme Speed before it's able to pass its Moody boosts to a teammate.</p> ",
    "sets": [
      {
        "name": "Baton Pass",
        "description": "<h1>Moves</h1> <p>Spore puts slower Pokemon such as support Primal Groudon to sleep, giving Smeargle extra time to accumulate Moody boosts. Spiky Shield helps to stall for extra turns, as well as dealing chip damage to Pokemon with contact attacks, while King's Shield can potentially allow Smeargle to survive attacks from weakened foes, such as avoiding the 2HKO from Extreme Killer Arceus. Ingrain helps support Smeargle's teammates by preventing phazing and providing some passive recovery, while Baton Pass passes Moody boosts and Ingrain to a teammate.</p> <h1>Set Details</h1> <p>Moody allows Smeargle to accumulate stat boosts without the need for setup moves. A Focus Sash allows Smeargle to survive a single attack before Baton Passing its stat boosts or putting its foe to Sleep. Maximum Speed investment and a Timid nature help Smeargle to outspeed as many foes as possible to put them to sleep before they can attack, while Maximum HP investment provides a slight bulk increase to weather weaker attacks, such as avoiding the 2HKO from Klefki's Dazzling Gleam.</p> <h1>Usage Tips</h1> <p>Smeargle's only function is to pass Moody boosts and Ingrain to its teammates. Ideally, Smeargle should be Baton Passed Speed boosts from a teammate such as Scolipede as it is brought in so that it can outspeed and Spore foes that would normally be faster, such as Arceus-Ground. Smeargle should be brought in versus slower foes that it can put to sleep with Spore and accumulate boosts against, as any faster foe can easily KO it if its Focus Sash is broken or leave it in range of priority users. Ingrain only needs to be used if the opposing team has a foe with a phazing move, such as Primal Groudon or Skarmory, as the passive recovery is fairly useless. Stall for as many turns as possible with Spiky Shield or King's Shield in order to obtain extra Moody boosts to pass on to Smeargle's teammates, but be wary because stalling for too many turns can give time for foes to wake up or set up. This can be especially dangerous when facing priority users such as Arceus, which can KO Smeargle without giving it a second chance to put them to sleep.</p> <h1>Team Options</h1> <p>This set should only be used on full Baton Pass teams. Only teammates such as Scolipede, Mr. Mime, Zapdos, and others that can utilize Baton Pass to accumulate stat boosts before passing them to Espeon to sweep should be used. Entry hazard removers can be useful for keeping Smeargle's Focus Sash intact; however, they cannot be easily fit onto Baton Pass teams.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 262044, "username": "Chloe"}, {"user_id": 276133, "username": "Josh"}, {"user_id": 273913, "username": "Enzo Gorlami"}]}, {"name": "Grammar checked by", "members": [{"user_id": 193885, "username": "Haund"}, {"user_id": 215806, "username": "horyzhnz"}]}], "writtenBy": [{"user_id": 202117, "username": "MZ"}]}
  },
  "Sableye": {
    "overview": "<p>Mega Sableye is a great Pokemon due to a great pre-Mega Evolution ability in Prankster and a great post-Mega Evolution ability in Magic Bounce. Prankster Will-O-Wisp allows it to burn physical attackers easily, and Magic Bounce allows Mega Sableye to counter Klefki, a major threat in the metagame, as well as pivot into other entry hazard setters and status users such as Arceus-Fairy, making Mega Sableye extremely good on stall archetypes. Its dual typing grants it three immunities, including an immunity to Arceus's and Mega Rayquaza's Extreme Speed, and only one weakness. It is also one of the best defensive Deoxys-A and Mewtwo checks there is, Pokemon that otherwise decimate stall. Unfortunately, Sableye is very slow and loses Prankster after it Mega Evolves, making it easy to take advantage of. Due to the prevalence of Klefki and Darkrai in Anything Goes, there are a ton of status absorbers, which hurts Mega Sableye a lot. Mega Sableye is also often overwhelmed by the sheer power of the attackers of the metagame, and even the Pokemon it is supposed to check can often annoy it with some sets, such as Magic Coat Arceus and special Mega Rayquaza. Even defensive Pokemon such as Arceus-Water and Lava Plume Primal Groudon can KO Mega Sableye, and Fairy-type Pokemon put a ton of pressure on it. Mega Sableye is also a complete momentum suck and only really fits on full stall and occasionally on balance teams.</p> ",
    "comments": "<h1>Other Options</h1> <p>Toxic is a viable option on Mega Sableye to nail conventional Fire-type switch-ins, and it puts walls on a timer unlike Will-O-Wisp, making them far more hesitant to switch in on Mega Sableye. A regular Sableye set with Leftovers and Swagger is usable, as even though Liepard and Klefki often outclass it, Recover gives Sableye a niche. Metal Burst is sometimes handy for hitting a few that wants to hit Sableye hard, but it is hard to justify a moveslot and creates even more annoying mind games for the user to predict. Alternatively, Counter is a decent option because Metal Burst doesn't pick up that many KOs due to Sableye's low HP, but it is incompatible with Prankster, so it is often not worth it. Knock Off can annoy some common switch-ins to Mega Sableye, especially Xerneas; however, a large number of Pokemon have items that can't be removed, namely Primal Groudon, Primal Kyogre, Arceus formes, and most Mega Evolutions, so it is generally a mediocre option that leaves Mega Sableye too passive. Taunt allows Mega Sableye to counter-lead even Skill Swap variants of Deoxys-S reliably, and it makes predicting against Darkrai and Xerneas much easier.</p> <h1>Checks and Counters</h1> <p><strong>Fairy-types: Arceus-Fairy and Xerneas both don't really mind anything Mega Sableye can do, and they can easily OHKO it with their STAB moves or simply set up on it. Mega Diancie can bounce Will-O-Wisp and Toxic back to Mega Sableye while taking very little damage from its attacks and threatening it with STAB Moonblast.</p> <p><strong>Special Setup Sweepers: Special setup sweepers such as Calm Mind Arceus formes and Nasty Plot Darkrai take very little damage from anything Mega Sableye has to throw at them and can simply use it as setup bait.</p> <p><strong>Kyogre</strong>: Both Primal Kyogre and Choice Scarf Kyogre have no problem KOing Mega Sableye, and it fails to even 2HKO them in return with Foul Play. RestTalk Primal Kyogre in particular is one of Mega Sableye's best counters, as it can heal off status problems with Rest and remain threatening with Sleep Talk.</p> <p><strong>Yveltal</strong>: Offensive Yveltal takes extremely little damage from everything Mega Sableye has in its arsenal, and it easily 2HKOes back.</p> <p><strong>Fire-types</strong>: Fire-type Pokemon such as Ho-Oh and Primal Groudon are immune to Mega Sableye's main way of wearing down its foes, so they are very effective checks to it. Primal Groudon is a Stealth Rock setter that beats Mega Sableye one-on-one, so Mega Sableye should only be used as a pivot to it and not stay in.</p> <p><strong>Clerics: Blissey and Clefable take next to nothing from Foul Play and don't care about a burn, and they can easily heal up their team because Mega Sableye can't apply anywhere near enough offensive pressure to stop them. However, it is important to note that Blissey can't touch Sableye either, so they both just end up in a stalemate.</p> ",
    "sets": [
      {
        "name": "Support",
        "description": "<h1>Moves</h1> <p>Fake Out allows Mega Sableye to safely Mega Evolve and to stall for burn damage later in the battle. Foul Play is important because Mega Sableye would otherwise be extremely passive and setup bait for lots of threats, and it allows Mega Sableye to do decent damage to most physical attackers and do something to Primal Groudon. It also wards away Pokemon like Mega Rayquaza and Arceus from attempting to boost past the burn drop to break through Mega Sableye. Recover gives Mega Sableye a form of recovery so that it doesn't get worn down throughout the match and can keep checking physical attackers and entry hazard setters. Will-O-Wisp cripples most physical attackers and is also nice for passive damage throughout the match on special attackers.</p> <h1>Set Details</h1> <p>An Impish nature, 248 HP EVs, and 252 Defense EVs maximize Mega Sableye's physical bulk while hitting a Stealth Rock number, with the remaining EVs being placed in Special Defense. Prankster allows Sableye to fire off a priority Will-O-Wisp on the turn it Mega Evolves, crippling almost every physical attacker because Sableye is immune to Extreme Speed.</p> <h1>Usage Tips</h1> <p>Fake Out should be used to Mega Evolve even if the foe threatens Sableye, as Mega Evolving and gaining Magic Bounce as quickly as possible is crucial. Make sure to not use Fake Out while Mega Evolving if a Prankster Will-O-Wisp would be optimal later in the game. Spreading burns is very nice, but if your opponent has Primal Groudon or Ho-Oh, be wary of using Will-O-Wisp too freely or you'll just end up giving them free switches in. Switch Sableye into physical attackers such as Arceus quickly, because if they start setting up and Sableye isn't in, it can fail to check them and get overwhelmed. Additionally, Foul Play does not OHKO +2 Arceus or unboosted Mega Rayquaza either, so it is imperative to keep Sableye healthy enough to take a hit from both of them if they are still in play. Pivot Mega Sableye into Stealth Rock setters such as Primal Groudon and support Arceus-Ground. Don't let Mega Sableye get weakened too much because it is too slow to use Recover on many Pokemon, so it can often just be picked off even by Pokemon it usually counters. That said, if Mega Sableye is too weakened to heal on anything else for the battle, it can often be beneficial to keep it around, as just the threat of Mega Sableye deters opponents from deploying entry hazards and status moves. It is almost always wise to lead with Sableye to allow it to Mega Evolve immediately, offering the threat of Magic Bounce for the entire battle, as well as pivot Mega Sableye into entry hazard setters such as Primal Groudon. However, be wary of getting burned by Primal Groudon's Lava Plume, which can cripple Mega Sableye for the rest of the match.</p> <h1>Team Options</h1> <p>Mega Sableye pairs extremely well with Lugia, as it requires Stealth Rock off the field to function, and it can help defend against physical attackers as well so that Mega Sableye doesn't get overwhelmed. Lugia also acts as another check to Mega Rayquaza, which Mega Sableye cannot fully check due to its sheer power. Ho-Oh also appreciates Stealth Rock off the field and has phenomenal special bulk to complement Mega Sableye's physical bulk. It also sponges Fairy-type moves extremely well for Mega Sableye. Ferrothorn has great defensive synergy with Mega Sableye, as it can tank all of the Fairy-type attacks that might be thrown at Mega Sableye as well as counter Primal Kyogre, and in turn, Mega Sableye can deal with Fighting-type attacks efficiently as well as wear down physical attackers further with Will-O-Wisp. Ferrothorn can also set entry hazards, which benefit Mega Sableye greatly due to all of the switches it forces. Primal Groudon pressures non-Foul Play Mega Sableye sets immensely and even takes on Foul Play variants somewhat well, so having Primal Groudon switch-ins such as Arceus-Water and Giratina-O is beneficial. Primal Groudon on Mega Sableye's own team is also helpful, as it can check Fairy-types. Pairing Mega Sableye with a Defog user such as Arceus-Water or Arceus-Fairy lets you control hazards extremely reliably, which also opens up the door for Ho-Oh as well as Lugia.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 202117, "username": "MZ"}, {"user_id": 262044, "username": "Chloe"}, {"user_id": 273913, "username": "Enzo Gorlami"}]}, {"name": "Grammar checked by", "members": [{"user_id": 193885, "username": "Haund"}, {"user_id": 175616, "username": "Empress"}]}], "writtenBy": [{"user_id": 276133, "username": "Josh"}]}
  },
  "Latias": {
    "overview": "<p>While Latias isn't commonly used, it has a niche in AG thanks to its typing, ability, and Soul Dew, allowing it to check Primal Groudon and Kyogre as well as beat Adamant Mega Rayquaza one-on-one and threaten weakened Extreme Killer Arceus. Its ability to wall common Stealth Rock setters such as Primal Groudon and Arceus-Water makes it a useful Defogger. Because of this, Pokemon such as Ho-Oh and Yveltal appreciate the support it provides.</p> <p>However, Latias loses to a large number of Pokemon including Darkrai, Klefki, support Arceus, Ho-Oh, and Yveltal. Moreover, it often gives Pokemon a free turn, which can give Darkrai or Klefki a free Substitute, allow Xerneas to use Geomancy, or let Arceus get a Swords Dance or Calm Mind off, especially after Latias has used Draco Meteor. Latias also faces tough competition from Pokemon such as Arceus-Dragon and Arceus-Water, both of which boast access to Defog alongside similar bulk and resistances. It should be noted that they aren't entirely similar, though, as Arceus has better Speed and Defense, while Latias offers better utility and offensive options. Latios also offers some competition; however, Latias's higher special bulk is generally more useful than Latios's stronger offensive stats.</p> ",
    "comments": "<h1>Other Options</h1> <p>Dragon Pulse might seem like an appealing option over Draco Meteor in order to avoid the Special Attack drop; however, it isn't worth the lower damage output. A Calm Mind set is rarely worthwhile due to the abundance of checks and counters to Latias in the tier such as Darkrai and Klefki. Also, Latios provides tough competition for this kind of set. Latias can run Healing Wish to support its teammates; however, it struggles to fit the move into its moveset without becoming setup bait. Thunder Wave and Roar can be used to try to prevent Latias from being setup bait, though the reliable damage from Psyshock is generally more worthwhile. Toxic can be used to wear Pokemon down while also coming in handy against stall. However, having a reliable STAB move that gives Latias the ability to hit both physically and specially are more useful in the vast majority of situations. Hidden Power Fire can be run for Steel-types such as Klefki and Ferrothorn; however, it's very weak—for example, specially defensive Klefki avoids being 2HKOed. Moves such as Tailwind, Wish, Light Screen, and Reflect might sound useful for the team; however, the moveslots are generally better used for other moves. Refresh can be used to deal with burns from Scald and Lava Plume to better check Primal Groudon and Kyogre, but neither will 2HKO even with burn damage and it probably wouldn't be worth the moveslot even if they did. Finally, Magic Coat might sound good for use against more passive Pokemon, though the moveslot is better used on an offensive move, as otherwise Latias will become too passive itself.</p> <h1>Checks and Counters</h1> <p><strong>Steel-types: Klefki, Ferrothorn, Genesect, and Mega Scizor all wall Latias, while Dialga also functions as a check. All of these use the free turn Latias gives them very well—for example, Genesect and Mega Scizor can both pivot out with U-turn against whatever Pokemon is brought in, while Dialga can set up Stealth Rock.</p> <p><strong>Setup Sweepers: Multiple Pokemon such as Swords Dance or Calm Mind Arceus happily set up on Latias, especially after it has used Draco Meteor.</p> <p><strong>Fairy-types: Fairy-types are immune to Draco Meteor and use Latias as setup bait. Xerneas and Arceus-Fairy can set up on it. Arceus-Fairy and Choice Scarf Xerneas are also faster than Latias. Klefki easily beats Latias, and Mega Diancie is faster (although it is 2HKOed by Psyshock with Moonblast only 2HKOing in return); Clefable also hard counters Latias.</p> <p><strong>Dark-types: While Yveltal and Darkrai dislike switching in on Draco Meteor, they can easily come in on Psyshock and beat Latias one-on-one. It's also worth noting they're very common and gain momentum every time they come in on Latias, so Latias needs to play around them carefully.</p> <p><strong>Support Arceus: Certain support Arceus variants such as Arceus and Arceus-Ghost can wall Latias, while also being able to set up Stealth Rock, although many can't deal much damage back without Toxic.</p> <p><strong>Ho-Oh and Lugia: Lugia completely walls Latias and can toxic stall it in return. Ho-Oh can check Latias with Stealth Rock up and counter Latias otherwise; however, be warned that Latias's attacks will do almost 50% to Ho-Oh while Ho-Oh rarely OHKOes in return with Brave Bird.</p> ",
    "sets": [
      {
        "name": "Defog Support",
        "description": "<h1>Moves</h1> <p>Defog is necessary to remove entry hazards and support Latias's teammates, allowing Pokemon like Ho-Oh and Mega Rayquaza to come in easily. Recover keeps Latias healthy enough to effectively check Pokemon such as Primal Groudon that could otherwise wear it down over time. Draco Meteor is the main offensive move for Latias to use. However, the Special Attack drop it causes alongside the fact that it is walled by Xerneas, Ho-Oh, and offensive Arceus makes it far from perfect. Psyshock allows Latias to hit the aforementioned Pokemon reasonably well, while Grass Knot can be run over Psyshock to hit Primal Groudon, Primal Kyogre, and some Arceus formes such as Arceus-Ground harder.</p> <h1>Set Details</h1> <p>Soul Dew makes Latias usable, as it boosts both its Special Attack and Special Defense. Levitate allows Latias to reliably check Primal Groudon despite its attacks mostly targeting Latias's weaker Defense stat. 176 Speed EVs with a Timid nature let Latias outspeed Adamant Mega Rayquaza, allowing it to be taken out with a Draco Meteor before it gets any boosts. 196 HP EVs allow Latias to avoid the 2HKO from Primal Kyogre's Ice Beam, and bulk is generally useful against a number of Pokemon such as Ho-Oh and Arceus. The remaining EVs are placed into Special Attack, allowing Latias to hit targets as hard as possible with Draco Meteor.</p> <h1>Usage Tips</h1> <p>While Latias offers a reasonable amount of firepower, its first priority is to support the team with Defog. Keeping Stealth Rock off the field is often more important than weakening a foe, so if in doubt, use Defog over another move. It's also often worthwhile to recover health rather than simply attack, as otherwise Latias can be worn down relatively easily by the Pokemon it's supposed to check. Be wary of letting Latias become setup bait for the opponent—try to use Psyshock over Draco Meteor if it would do enough damage, and avoid letting Pokemon such as Xerneas, Klefki, and Darkrai switch in on attacks they're immune to. Draco Meteor can be very useful for making holes in an opposing team so that another Pokemon can sweep, so don't be afraid to sacrifice Latias to make a dent in something important.</p> <h1>Team Options</h1> <p>Latias fits best on bulky offense teams that require a Defogger to work well, as its offensive pressure can allow it to use Defog with less loss of momentum than other hazard removers. Good teammates include Pokemon weak to Stealth Rock such as Ho-Oh, Mega Rayquaza, and Yveltal. Teams with Latias appreciate a solid Stealth Rock setter, as many Pokemon that check Latias such as Ho-Oh and Yveltal dislike Stealth Rock. However, the setter needs to be able to come in multiple times, as Latias will remove Stealth Rock from both sides of the field, so avoid setters like Deoxys formes. Latias appreciates a solid core to support it in order to deal with the Pokemon that gain free turns from coming in on it. Pokemon such as Ho-Oh and Primal Groudon are good options. Checks to Pokemon such as Klefki, Bronzong, Ferrothorn, and other Steel-types that completely wall Latias are also needed. Finally, checks to setup sweepers such as Swords Dance Arceus, Calm Mind Arceus, Darkrai, and Xerneas are required due to Latias being relatively easy to use as setup bait.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 202117, "username": "MZ"}, {"user_id": 273913, "username": "Enzo G"}, {"user_id": 262044, "username": "Chloe"}]}, {"name": "Grammar checked by", "members": [{"user_id": 91628, "username": "GatoDelFuego"}]}], "writtenBy": [{"user_id": 193182, "username": "DoW"}]}
  },
  "Kyogre": {
    "overview": "<p>Even in a metagame with Mega Rayquaza, Primal Kyogre is still an incredibly strong attacker with excellent coverage options to augment its offensive power. It's also incredibly bulky, although it relies on Rest for any recovery. Kyogre can also opt to use its base forme, running a Choice Scarf revenge killer set that can easily sweep weakened teams. However, its offensive sets have somewhat poor bulk, making it easy to pressure them with the multitudes of strong attackers in the metagame. The high number of Water-resistant Pokemon does Kyogre no favors either, as it can be pressured by common threats such as Mega Rayquaza and Primal Groudon.</p> ",
    "comments": "<h1>Other Options</h1> <p>Thunder Wave or Toxic can be used as filler to catch incoming Primal Groudon and Lugia and cripple them. Hidden Power Ground can also be run on the offensive set to do more damage to Primal Groudon, but it has little utility otherwise. Physical Primal Kyogre sets, while gimmicky, can at least lure conventional switch-ins such as Primal Groudon and Blissey to KO them with Earthquake or Waterfall, respectively. Blizzard is an option over Ice Beam on the offensive set to OHKO Mega Rayquaza after Stealth Rock, but the accuracy makes this option unreliable. Substitute is a possibility thanks to Primal Kyogre's high bulk and effectiveness at forcing out slower foes, but it clashes with Kyogre's lack of recovery and already tight moveslots. Surf can be run over Origin Pulse on Choice Scarf Kyogre to trade power for accuracy, but the power loss is significant.</p> <h1>Checks and Counters</h1> <p><strong>Primal Groudon: Thanks to its immunity to Thunder and ability to cancel out heavy rain and negate Kyogre's Water-type attacks, Primal Groudon is the premier switch-in to Primal Kyogre, capable of doing heavy damage with Precipice Blades or setting up Stealth Rock or Rock Polish. However, as long as Primal Kyogre is brought in second so that heavy rain is in effect, it can simply OHKO Groudon with its Water-type STAB moves.</p> <p><strong>Dragon-types</strong>: The large number of Dragon-types in Anything Goes such as Rayquaza, Latias, Zekrom, Dialga, and Giratina-O are all capable of taking a resisted Origin Pulse or Thunder with ease and dealing back heavy damage. Zekrom is also notable, as it can pivot out of Kyogre with Volt Switch or simply OHKO it with Bolt Strike. Although none appreciate taking an Ice Beam save Palkia, they all outspeed and 2HKO Kyogre, save Giratina-O.</p> <p><strong>Specially Bulky Pokemon: Although Kyogre can break through most special walls with its extremely powerful attacks, it has issues with Blissey, Chansey, and specially defensive Ferrothorn. The first two can easily recover off any damage done to them and status Kyogre, while Ferrothorn lacks recovery but can stack entry hazards while sapping Kyogre's health with Leech Seed and takes very little from Kyogre's attacks.</p> <p><strong>Strong Attackers: Even when heavily invested, Kyogre still can be broken through by strong attackers thanks to its lack of recovery outside of Rest and lack of useful resistances outside of Water. Strong attackers such as offensive Arceus formes, Mega Rayquaza, and Deoxys-A can all do severe damage to Kyogre, either permanently crippling it or forcing it to Rest off the damage.</p> <p><strong>Priority Users and Faster Pokemon: Choice Scarf Kyogre's reliance on Water Spout is easily exploitable by faster Pokemon or priority users such as Choice Scarf Xerneas and Arceus, which can wear it down to decrease the effectiveness of Water Spout. They also threaten to revenge kill Kyogre from middling percents thanks to its mediocre bulk.</p> ",
    "sets": [
      {
        "name": "Offensive",
        "description": "<h1>Moves</h1> <p>Origin Pulse is Primal Kyogre's main attack and does massive damage to anything without a resistance and high special bulk when boosted by heavy rain. Thunder hits Lugia and opposing Water-types such as Arceus-Water and helps check evasion boosters with its perfect accuracy under rain. Ice Beam is Primal Kyogre's only coverage move for Dragon-types such as Mega Rayquaza and Giratina-O. Sleep Talk allows Primal Kyogre to check Darkrai lacking Taunt, although Calm Mind can be used to break through stall teams more quickly.</p> <h1>Set Details</h1> <p>Maximum Special Attack investment and a Modest nature allow Primal Kyogre to hit with as much power as possible. 76 Speed EVs allow it to outspeed uninvested Yveltal and Xerneas, while the remaining EVs are dumped into HP to augment its natural bulk.</p> <h1>Usage Tips</h1> <p>Primal Kyogre is primarily used as a strong early-game wallbreaker to wear down teams for a late-game sweep by a teammate. It does not carry much late-game utility due to its poor Speed and lack of resistances, making it easy to sweep through. Kyogre should only set up Calm Minds if the extra power is needed to break through extremely bulky targets such as Lugia; the power is generally unnecessary versus offensive teams. If the power provided by Calm Mind is needed, try to set up on bulkier Pokemon that cannot do significant damage to Primal Kyogre such as Arceus-Steel and defensive Dialga. Avoid setting up on potential Toxic users such as Yveltal if possible, as the status makes Kyogre far easier to stall out. If facing teams with Primal Groudon, be extremely careful about going for Origin Pulse and potentially giving it a free switch in. Kyogre should attempt to be the one switching into Primal Groudon as it goes for a Fire-type move or Stealth Rock so it can get off a free hit under the heavy rain, but it needs to be careful about taking a Precipice Blades or Earthquake. Kyogre can also switch into Ho-Oh's Sacred Fire, but it cannot easily take a STAB Brave Bird.</p> <h1>Team Options</h1> <p>Setup sweepers such as Swords Dance Arceus formes and Geomancy Xerneas can take advantage of Primal Kyogre's ability to demolish opposing walls to sweep late-game. Checks to Primal Groudon such as Giratina-O and Arceus-Water are essential, as it can switch into Kyogre and threaten it out or KO it. Checks to Dragon-types like Mega Rayquaza and Latias are also valued, as they give Primal Kyogre a teammate to fall back on when it is forced out. Klefki is a notable partner for providing paralysis support to slow down faster threats, checking Dragon-types and even luring Primal Groudon and crippling it with Toxic. Although Electric- and Grass-types are very rare in Anything Goes, checks to them such as Arceus-Ground and Primal Groudon can still be useful, both of which also appreciate Kyogre's wallbreaking capabilities. Ferrothorn can be very difficult for Kyogre to break through, so teammates that can defeat it such as Ho-Oh are useful.</p> "
      },
      {
        "name": "Defensive",
        "description": "<h1>Moves</h1> <p>Scald gives Primal Kyogre some offensive presence and can threaten switch-ins with burns. Roar allows it to phaze foes, which works well in conjunction with entry hazards and prevents it from being setup fodder, although Ice Beam can be used to let Primal Kyogre do damage to opposing Dragon-types and Primal Groudon. Rest keeps Kyogre healthy throughout longer matches, while Sleep Talk prevents it from being totally useless while asleep.</p> <h1>Set Details</h1> <p>Near-maximum HP and maximum Defense investment with a Bold nature make Primal Kyogre as physically defensive as possible to better take on threats such as Swords Dance Arceus-Ground and Primal Groudon. The Speed investment lets Primal Kyogre outspeed Timid Diancie before it Mega Evolves.</p> <h1>Usage Tips</h1> <p>Primal Kyogre is an excellent status absorber thanks to Rest and can be used as a switch-in to foes such as Klefki and Lugia. It can check many strong attackers such as Darkrai, Diancie, and Primal Groudon, but it needs to stay healthy by using Rest frequently in order to be at a high enough health to take their attacks. Additionally, be wary of the occasional Taunt Darkrai, which can use Kyogre as setup fodder. Use Scald a lot versus teams lacking Primal Groudon in order to spread burns across them.</p> <h1>Team Options</h1> <p>Defensive Primal Kyogre fits best on stall or semi-stall teams with teammates to handle its checks and counters, so pair it with common defensive Pokemon such as Lugia and Mega Sableye. Primal Groudon checks such as Latias and Giratina-O are essential, as it can use Kyogre as setup fodder, and Pokemon that can handle Dragon-types such as Mega Scizor and Aegislash are useful fallbacks for it. Hazard removers such as support Arceus formes prevent Kyogre from being worn down by the chip damage, while your own entry hazards help Primal Kyogre rack up extra damage with with Roar. Clerics such as Xerneas and Clefable can wake up Kyogre early, making it less reliant on Sleep Talk rolls to deal with foes.</p> "
      },
      {
        "name": "Choice Scarf",
        "description": "<h1>Moves</h1> <p>Water Spout is Kyogre's strongest move when it's at high health and can let it sweep through opposing teams if Kyogre is at high enough health. Origin Pulse acts as a secondary STAB move for when Kyogre is at an amount of health where Water Spout is weaker. Sheer Cold nets KOs versus would-be counters such as Primal Groudon, but it can be unreliable, with only about a 50/50 chance to beat slower foes on the switch. Thunder hits Water-types such as Arceus-Water and opposing Kyogre, while Ice Beam hits Primal Groudon and Dragon-types harder than anything else Kyogre has but is hard to fit on its set.</p> <h1>Set Details</h1> <p>Choice Scarf allows Kyogre to outspeed the entire unboosted metagame aside from Deoxys-A. Maximum Speed and Special Attack investment allows it to function as a cleaner and revenge killer more effectively. A Modest nature is preferred for the extra power, although Timid is a possibility to beat Choice Scarf Kyurem-W and Deoxys-A.</p> <h1>Usage Tips</h1> <p>Kyogre functions primarily as a revenge killer or late-game sweeper when its checks have been worn down or removed; bringing it in earlier risks it being weakened, making Water Spout a less effective cleaning tool. In particular, Primal Groudon needs to have been KOed for this set to be effective, as it is immune to Kyogre's strongest attacks. If counters such as Zekrom and Primal Groudon have not been sufficiently weakened and Kyogre lacks Ice Beam, its best chance is to attempt to hit Sheer Cold. Avoid using Water Spout when facing priority users such as Yveltal and Arceus, as Kyogre can be weakened with priority prior to attacking, significantly lowering its power. Kyogre is normally better at threatening special Arceus formes and other special attackers that do not carry priority, as most of the physical attackers in the tier have priority of one kind or the other. Also avoid Choice-locking Kyogre into a Water-type attack if the opponent has a healthy Mega Rayquaza or Primal Groudon, which can use it as setup fodder.</p> <h1>Team Options</h1> <p>Checks to Primal Groudon and Dragon-types, such as Arceus-Ground and Xerneas, are essential, as they need to be weakened or KOed for Kyogre to sweep. Entry hazard removal helps keep Kyogre healthy for Water Spout to be at maximum power, while entry hazard support of your own from Pokemon such as Primal Groudon and Scolipede helps weaken its checks more quickly. Checks to priority users such as Arceus and Yveltal, such as Skarmory and Arceus-Fairy, can take priority Extreme Speeds or Sucker Punches aimed at Kyogre. Although rare, Healing Wish users such as Latias and Shaymin-S can give Kyogre a second chance to sweep with Water Spout if it's been weakened.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 262044, "username": "Chloe"}, {"user_id": 276133, "username": "Josh"}, {"user_id": 277877, "username": "HunterStorm"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "The Dutch Plumberjack"}, {"user_id": 168392, "username": "P Squared"}]}], "writtenBy": [{"user_id": 202117, "username": "MZ"}]}
  },
  "Groudon": {
    "overview": "<p>Primal Groudon is one of the most threatening and customizable Pokemon in Anything Goes due to its ability to perform as a blanket check for common threats. On top of that, its Ground / Fire typing leaves it with only two weaknesses and provides it with five resistances; this lets it check Xerneas, Arceus-Steel, and, to an extent, Klefki. Additionally, even though one of Primal Groudon's two weaknesses is a 4x weakness to Water, this is remedied by its ability, Desolate Land, which gives it an immunity to Water-type moves, thus letting it switch in on Water-types and break through Primal Kyogre after it switches in. A vast movepool lets Primal Groudon run a plethora of sets, ranging from a support Pokemon to a wall, which makes it difficult for almost any Pokemon to switch into Primal Groudon. Primal Groudon has both powerful physical and powerful special STAB moves in Precipice Blades and Lava Plume, allowing it to weaken a wider range of walls. However, Primal Groudon's base Speed is quite low in the AG metagame without any boosts, and it is setup bait for and easily KOed by Darkrai due to its lack of recovery moves and its inability to run a support item like Lum Berry to avoid being put to sleep. Its inability to run a Lum Berry further causes Primal Groudon to be easily worn down by poison, resulting in it easily getting walled by bulky Arceus formes. Despite technically only having a weakness to Ground-type moves, Primal Groudon finds that weakness glaring due to how commonly Earthquake and Earth Power are used as coverage moves, limiting what it can wall. Mega Rayquaza also easily checks Primal Groudon, which is especially annoying, considering how common it is. Despite all of that, Primal Groudon is incredibly strong with both Swords Dance sets and Rock Polish sets. While Rock Polish doesn't directly boost Primal Groudon's Attack, the ability to outspeed the entire unboosted AG metagame is a great advantage.</p> ",
    "comments": "<h1>Other Options</h1> <p>On the support set, an offensive EV spread of 224 HP / 240 Atk / 32 SpD / 12 Spe with an Adamant nature can be used to let Primal Groudon be more threatening offensively. The EVs let Primal Groudon OHKO Primal Kyogre with Precipice Blades after Stealth Rock and still survive a Focus Blast from +2 Xerneas after Stealth Rock. Rest is good on Primal Groudon due to it being its only form of recovery; however, wasting two turns is very annoying and leaves Primal Groudon setup fodder, and while it could be used with Heal Bell users, that just puts more of a burden on the user unless the team is stall oriented. Overheat can be used as a special STAB move to reliably OHKO physical walls like Skarmory; however, it lowers Primal Groudon's Special Attack, which might cause it to get easily forced out. Substitute can be used over Thunder Wave on the Swords Dance set to mess with Pokemon like Arceus-Water, but Primal Groudon can't take advantage of the move too well. Solar Beam could be used as a lure for Quagsire and Arceus-Water. A special Rock Polish set can be used to lure in physical walls like Yveltal and Arceus-Fairy and KO them with moves like Fire Blast, Earth Power, and Dragon Pulse. Eruption can be used to deal incredible amounts of damage; however, it requires some form of speed control such as Sticky Web.</p> <h1>Checks and Counters</h1> <p><strong>Ground-immune Pokemon: Lugia can survive most of Primal Groudon's non-boosted attacks due to its outrageous bulk, and it can proceed to Toxic stall it down due to Multiscale and Roost. However, Lugia takes large amounts of damage from Stone Edge if Multiscale is not active, and it does not like Lava Plume burns either. Pokemon such as Mega Rayquaza, Giratina-O, and Latias all resist or are immune to both of Primal Groudon's STAB options and can break through it with their powerful attacks. However, Primal Groudon can run Dragon Claw or Dragon Tail as a coverage move to hit these threats as well. Yveltal beats physically offensive Primal Groudon sets due to its immunity to Primal Groudon's main STAB move, Precipice Blades, its decent bulk with Rocky Helmet, and its ability to Toxic stall Primal Groudon. Skarmory can beat all Groudon sets that lack Fire-type coverage by simply phazing Groudon or making it waste its Rock-type coverage move by recovering off the damage with Roost. Giratina's outrageous bulk allows it to survive anything of Primal Groudon's and phaze it with Roar or Dragon Tail. However, Giratina must be wary of Swords Dance + Dragon Claw Primal Groudon variants. Ho-Oh can check Primal Groudon variants that do not decide to run Rock-type coverage moves and can 2HKO it with Earthquake. Ho-Oh also benefits from not being weakened by burns from Lava Plume, although Stone Edge is a popular choice on Primal Groudon, so switching it in becomes a risk in most cases.</p> <p><strong>Support Arceus Formes: Support Arceus formes like Arceus-Fairy, Arceus-Dragon, bulky Arceus, and Arceus-Water resist or take little from Fire-type attacks and can avoid the 2HKO from Precipice Blades. They can then Toxic stall Primal Groudon; however, they do get beaten by Swords Dance variants.</p> <p><strong>Arceus-Ground: Arceus-Ground can survive any attack from Primal Groudon and can OHKO or 2HKO it with its own STAB Ground-type moves. Recover can help Arceus-Ground stall out Primal Groudon, but the burn from Lava Plume can cripple it, especially the physical sets.</p> <p><strong>Primal Kyogre</strong>: Primal Kyogre can overwrite Desolate Land with Primordial Sea and threaten to OHKO Primal Groudon with its Water-type moves. However, it does not appreciate switching in on Primal Groudon's STAB Ground-type attacks. Adding onto that, Primal Groudon can also switch in on Primal Kyogre to overwrite its Primordial Sea and either force it out or OHKO it with Precipice Blades.</p> <p><strong>Chip Damage</strong>: Chip damage from entry hazards like Stealth Rock, Spikes, and Toxic Spikes and weak attacks all easily cut down Primal Groudon's health, especially due to its secondary Fire typing giving it a neutrality to Stealth Rock.</p> ",
    "sets": [
      {
        "name": "Support",
        "description": "<h1>Moves</h1> <p>Stealth Rock allows Primal Groudon to support itself and its teammates by applying chip damage to any foe that switches in. Stealth Rock is especially easy to set up when combined with Primal Groudon's ability to force switches against almost any Pokemon. Precipice Blades is Primal Groudon's primary STAB move and lets it maintain a great offensive presence, 2HKOing Xerneas and Arceus. Earthquake can be used as a more accurate alternative to Precipice Blades at the cost of power; however, the drop in power is often very noticeable, notably not being able to 2HKO Xerneas and Arceus. Lava Plume is Primal Groudon's other STAB move and has great power under Desolate Land, and when used in tandem with a 30% burn chance, it lets Primal Groudon cripple a plethora of physical attackers by burning them as well as weaken down walls. Stone Edge can be used over Lava Plume to hit Ho-Oh, mostly because non-Rock-type coverage variants are forced out by Ho-Oh. However, just keep in mind this is only recommended if you are running this set on a Ho-Oh-weak team. Roar is used to phaze setup sweepers like Xerneas, Mega Rayquaza, and Arceus, and it helps rack up residual damage with Stealth Rock. Thunder Wave can be used over Roar to cripple fast threats, which help Primal Groudon and its teammates deal with threatening wallbreakers. Dragon Tail can be used over Roar as well to phaze Ground-immune Dragon-types like Mega Rayquaza and Giratina-O and can specifically hit Mega Rayquaza for a lot of damage while phazing it. However, one disadvantage of running Dragon Tail over Roar is the inability to phaze Xerneas, which is one of AG's most prevalent setup sweepers, and even if Primal Groudon is running Thunder Wave, it can at least lower Xerneas's Speed.</p> <h1>Set Details</h1> <p>The given EVs let Primal Groudon survive a Focus Blast from a +2 Xerneas, even after taking chip damage from Stealth Rock and one layer of Spikes. If you're running Stone Edge on Primal Groudon, use an Impish nature instead. In addition to that, the EVs allow Primal Groudon to avoid the 2HKO from Primal Kyogre's Ice Beam, Arceus-Rock's Judgment, and Giratina-O's Shadow Force. A Relaxed nature lets Primal Groudon survive an Earthquake from +2 Arceus and a Precipice Blades from opposing support Primal Groudon. A Careful nature with an EV spread of 248 HP / 8 Def / 252 SpD could be used instead to let Primal Groudon face Xerneas and Primal Kyogre more easily but makes it harder for Primal Groudon to take physical attacks.</p> <h1>Usage Tips</h1> <p>Use Primal Groudon to support its teammates by setting up Stealth Rock and crippling foes with Thunder Wave; this is the main focus of the set. Don't rely solely on Primal Groudon to set up Stealth Rock and paralyze foes, as its vulnerability to all forms of entry hazards and ability to get pressured by Arceus make it difficult to set up Stealth Rock repeatedly. Try to spam Lava Plume because of its incredible chance of burning foes. Be wary of using Primal Groudon's Ground-type STAB move if the opponent still has a Ground-immune Pokemon on their team, as they can switch it in on Primal Groudon and attempt to capitalize off of it. Set up Stealth Rock early-game for as much residual damage on the opponent's team throughout the match. Use Primal Groudon as a phazer to setup sweepers like Mega Rayquaza, Arceus, and Xerneas. Try to avoid a situation where Primal Kyogre can switch in on Primal Groudon to allow the harsh sun to stay up and to avoid Primal Groudon getting forced out, giving Primal Kyogre a free KO; the same applies for Mega Rayquaza coming in on Primal Groudon and making it setup bait.</p> <h1>Team Options</h1> <p>Primal Groudon doesn't like facing Ground-immune Dragon-types like Mega Rayquaza and Giratina-O, with the latter being able to remove Primal Groudon's Stealth Rock with Defog; Fairy-types like Xerneas, Mega Diancie, and Arceus-Fairy can be used to take care of them, and they appreciate Primal Groudon's ability to take care of the Steel-types that threaten them. Klefki can be a decent teammate because it can set up Spikes to complete a Stealth Rock + Spikes entry hazard setting core to further help cripple the foes that Primal Groudon cripples with its moves and Stealth Rock, and it additionally can take care of most of Primal Groudon's checks with Swagger + Foul Play. Arceus-Ground is also very threatening because a +1 Judgment OHKOes Primal Groudon and a +2 Earthquake 2HKOes it; Skarmory, Lugia, and Mega Rayquaza can check it. Aromatherapy and Heal Bell support from Xerneas, Blissey, Mega Diancie, and Chansey is useful to help Primal Groudon get rid of status ailments. Ho-Oh checks like Mega Diancie, Arceus-Rock, and Arceus-Water are good because Ho-Oh threatens Primal Groudon with Earthquake and it can't do anything in return. Entry hazard removers like Giratina-O and Arceus-Fairy get rid of the entry hazards that severely weaken Primal Groudon. Pokemon that can take down support Arceus formes, such as Ho-Oh, are good, considering that a lot of support Arceus formes are weak to Ho-Oh's STAB and coverage moves. Pokemon that benefit from Stealth Rock support like Xerneas, Mega Rayquaza, and Arceus are good teammates because it helps them turn would-be 2HKOs into OHKOs.</p> "
      },
      {
        "name": "Offensive Stealth Rock",
        "description": "<h1>Moves</h1> <p>Stealth Rock allows Primal Groudon to support itself and its teammates by turning more 2HKOs into OHKOs due to chip damage, and it is easy to set up thanks to Primal Groudon's ability to force foes out with its offensive pressure. Precipice Blades is Primal Groudon's main STAB move, as it lets it 2HKO most of the AG metagame. Dragon Tail lets Primal Groudon phaze most setup sweepers; it is particularly useful against Mega Rayquaza due to its Dragon weakness and decent power. However, it leaves Primal Groudon without a way to phaze Geomancy Xerneas due to its immunity to Dragon-type moves. Fire Punch can be used over Dragon Tail to give Primal Groudon a strong, sun-boosted secondary STAB move, letting it easily damage a vast majority of the metagame neutrally, as well as being able to OHKO Skarmory, Ferrothorn, and Bronzong. Stone Edge lets Primal Groudon hit threatening Flying-types like Yveltal, Lugia, and Ho-Oh super effectively. Rock Tomb can be used over Stone Edge to give Primal Groudon a more accurate Rock-type move, but the power drop is quite noticeable; however, it still lets Primal Groudon OHKO Ho-Oh and has the benefit of lowering the foe's Speed.</p> <h1>Set Details</h1> <p>76 Speed EVs let Primal Groudon outspeed every Pokemon up to uninvested Xerneas and Yveltal. 152 HP EVs and 44 Special Defense EVs let Primal Groudon survive a +2 Focus Blast from Geomancy Xerneas after Stealth Rock and an Earthquake from +1 Mega Rayquaza. 236 Attack EVs and an Adamant nature let Primal Groudon 3HKO physically defensive Xerneas and 2HKO opposing Primal Groudon.</p> <h1>Usage Tips</h1> <p>Play Primal Groudon with minimal risk if it needs to perform both as a Geomancy Xerneas check and as a Stealth Rock setter reliably. Try to set up Stealth Rock early-game to have as much of an effect throughout the match as possible, or when Primal Groudon is forcing a switch. Use Dragon Tail when you predict that the opponent is trying to bring in an entry hazard clearer or a foe is trying to set up. If you're running Fire Punch on Primal Groudon instead, it's safe to use the move when you aren't sure what Pokemon is going to be brought in because of the decent damage it deals after the sun and STAB boosts. If you can predict that a faster foe is switching in, try to use Rock Tomb because it can cause normally threatening Pokemon to switch back out or get KOed.</p> <h1>Team Options</h1> <p>Offensive Ground-immune Pokemon like Mega Rayquaza and Giratina-O are good teammates for switching in on opposing Ground-types like Primal Groudon. Ho-Oh helps with covering some of Primal Groudon's weaknesses to special attacks and Ground-type moves. Fairy-types like Xerneas and Mega Diancie are helpful for taking care of the Dragon-types that threaten Primal Groudon, like Arceus-Dragon and Mega Rayquaza. Ghost- and Dark-types like Mega Gengar, Darkrai, and Yveltal are useful for threatening stall and balance teams, which Primal Groudon otherwise struggles with. All of the aforementioned teammates appreciate Stealth Rock support from Primal Groudon in return. A more reliable Xerneas check is recommended due to Primal Groudon being unable to do so after being whittled down by other attacks.</p> "
      },
      {
        "name": "Rock Polish",
        "description": "<h1>Moves</h1> <p>Rock Polish helps Primal Groudon outspeed the entire neutral metagame after one boost, which makes it a deadly late-game sweeper. Precipice Blades is Primal Groudon's main STAB move and allows it to hit opposing Primal Groudon, Mega Gengar, and Arceus-Poison super effectively and deal a lot of damage to threatening foes like Arceus. Dragon Claw can be used to let Primal Groudon 2HKO the Dragon-types that normally wall it such as Giratina-O and Mega Rayquaza. Swords Dance can be used to give Primal Groudon a double dance set to let it perform as an insanely fast and strong attacker, allowing it to deal with bulkier threats like Lugia and Arceus-Water more reliably. Stone Edge lets Primal Groudon hit Flying-types like Ho-Oh and Yveltal super effectively and is optimal with Swords Dance because it can easily KO the aforementioned Lugia. Fire Punch can be used over Stone Edge to let Primal Groudon hit Steel-types like Skarmory and Ferrothorn super effectively, provides great neutral coverage in general, and is more reliable than Precipice Blades in the sun; however, it gives Primal Groudon the burden of not being able to hit Flying-types as reliably.</p> <h1>Set Details</h1> <p>Maximum Attack EVs and an Adamant nature grant Primal Groudon an outrageous offensive presence. 56 Speed EVs guarantee that Primal Groudon outspeeds Choice Scarf base 90 Speed Pokemon like Dialga, Kyogre, and Zekrom after a Rock Polish boost. 104 HP EVs and 96 Special Defense EVs let Primal Groudon survive a +2 Focus Blast from Xerneas. 124 Speed EVs can be used instead to let Primal Groudon outspeed faster Choice Scarf users like Jirachi and Genesect, but it sacrifices either Primal Groudon's ability to check Geomancy Xerneas or a substantial amount of damage.</p> <h1>Usage Tips</h1> <p>Use Primal Groudon to force out Pokemon like Xerneas and set up Rock Polish (and Swords Dance if you're running it) on said switches. Try to get rid of or weaken opposing Mega Rayquaza and Giratina-O before sending Primal Groudon in to sweep. Swords Dance can be a good option for pressuring support Defoggers like Arceus-Water but is less reliable against Mega Rayquaza. Non-Swords Dance variants need support Arceus formes and other physically bulky teammates gone to successfully sweep. Keep Primal Groudon healthy if it's needed for checking Fairy-types.</p> <h1>Team Options</h1> <p>Primal Groudon pairs well with offensive Pokemon like Mega Gengar, Yveltal, another Primal Groudon, and Arceus-Water to take care of Lugia, defensive Primal Kyogre, and Ground Arceus. Mega Gengar is an especially useful teammate for variants of this set that lack Fire Punch to give your team a way of trapping and KOing support Arceus formes and Skarmory. Darkrai is a good teammate because it can outspeed and put all of Primal Groudon's checks to sleep to help it set up later in the match. Powerful wallbreakers like Mega Rayquaza and Ho-Oh can weaken walls like Lugia to help Primal Groudon wear down the opposing team easily. Stealth Rock support from Pokemon like Arceus-Fairy and Deoxys-S is important to chip at the health of Flying-type foes and break Focus Sashes on common users like Smeargle, as the former can reliably check Mega Rayquaza and the latter can easily fit onto most offensive archetypes.</p> "
      },
      {
        "name": "Paradancer",
        "description": "<h1>Moves</h1> <p>Swords Dance gives Primal Groudon a way to boost its Attack to monstrous levels, letting it break through many bulky walls like Lugia. Thunder Wave is a great utility move that allows Primal Groudon to cripple and set up on a plethora of faster foes like Xerneas, Lugia, and Arceus-Water. Precipice Blades is Primal Groudon's main STAB move because it gives it the ability to OHKO many neutrally effected foes after one Swords Dance. Rock Slide lets Primal Groudon hit Ground-immune foes like Lugia, Ho-Oh, and Yveltal; paraflinch foes when used in tandem with Thunder Wave; and it is more accurate than Stone Edge at the cost of less power. Fire Punch can be used as a secondary STAB move, but the lack of a way to reliably hit Flying-types is quite noticeable when Primal Groudon uses dual STAB over Precipice Blades + Rock Slide.</p> <h1>Set Details</h1> <p>Maximum HP EVs and 48 Special Defense EVs allow Primal Groudon to survive a Focus Blast from a +2 Xerneas after Stealth Rock Damage. 12 Speed EVs allow Primal Groudon to outspeed maximum Speed Diancie before it Mega Evolves. 196 Attack EVs and an Adamant nature let Primal Groudon maximize its power while maintaining enough bulk to survive moves from threatening foes.</p> <h1>Usage Tips</h1> <p>Use Primal Groudon early-game to paralyze as many foes as possible to make it easier to keep Primal Groudon's Swords Dance boosts for longer periods of time later on in the match and to break through walls for teammates to finish off later. Try to set up on more passive Fairy- and Steel-types like Clefable and Ferrothorn to take minimal damage while completing the set up. Setting up will likely force the passive foes out, so try to paralyze the switch-in. Don't spam Thunder Wave too often until all opposing Ground-types are eliminated, as the lack of momentum can be detrimental later on in the match. Try to avoid setting up on Toxic users like Arceus-Water if possible; however, this may be required to remove Arceus-Water from the match. Primal Groudon should be played offensively so Pokemon like Mega Rayquaza can't freely pivot into it and ruin its sweep.</p> <h1>Team Options</h1> <p>Stealth Rock setters like Dialga and Deoxys-S are good teammates for weakening foes to give Primal Groudon more KOs against bulkier Pokemon like Arceus-Water and Lugia. Other setup sweepers like Geomancy Xerneas, Swords Dance Mega Rayquaza, and Extreme Killer Arceus can potentially sweep after Primal Groudon cripples, weakens, or KOes their checks. Primal Groudon gets checked by Dragon-types and Ho-Oh easily if it runs Fire Punch, so teammates like Klefki, Mega Diancie, and Arceus-Rock are great teammates to deal with them. Healing Wish users like Jirachi and Latias are good to fully heal Primal Groudon to let it have a chance at sweeping again. Pokemon that appreciate support Arceus formes being gone like Mega Rayquaza and Extreme Killer Arceus are good teammates for this set as well. Mega Gengar is a good teammate for removing Skarmory for non-Fire Punch variants.</p> "
      },
      {
        "name": "Lum Berry",
        "description": "<h1>Moves</h1> <p>Earthquake is Groudon's main STAB move and allows it to dent most neutral targets, even without Attack investment, and is much more reliable than Precipice Blades on a support set. Stealth Rock gives Groudon the ability to indirectly weaken foes for it or its teammates to finish off. Thunder Wave lets Groudon cripple fast wallbreakers like Darkrai and Ho-Oh on the switch. Rock Tomb can be used over Thunder Wave to deal decent damage to Ho-Oh and still act as a form of speed control. Dragon Tail is Groudon's main phazing move because it can damage Mega Rayquaza and isn't stopped by taunt. Roar is an alternative phazing move to Dragon Tail that hits behind Substitute, evades Protect, and hits Fairy-types.</p> <h1>Set Details</h1> <p>248 HP and Defense EVs let Groudon act as a bulky tank that can survive powerful physical attacks from Mega Rayquaza, Arceus, and Primal Groudon. 12 Speed EVs let Groudon outspeed Mega Diancie before or on the turn that it Mega Evolves. Lum Berry lets Groudon check status spreaders like Klefki and Darkrai temporarily.</p> <h1>Usage Tips</h1> <p>Utilize defensive Groudon as a lead to efficiently set up Stealth Rock and cripple any non-Ground-type foes with Thunder Wave. Use this set to capitalize on Swagger + Foul Play Klefki and OHKO it in return or to check sleep inducers like Darkrai and surprise them with an attack. Don't try to switch Groudon in on powerful special attackers like Xerneas due to its lack of special bulk that leaves it 2HKOed or OHKOed often. Be wary of Flying-types like Mega Rayquaza and Lugia because they can often take advantage of Groudon's lack of coverage. Spam Thunder Wave when the Ground-types on the opponent's team are gone to support teammates by crippling fast foes.</p> <h1>Team Options</h1> <p>Regular Groudon has trouble dealing with Water-types due to the lack of Desolate Land, so teammates like Mega Rayquaza are almost mandatory. Special walls like Clefable are good teammates because they can cover Groudon's low Special Defense and provide Wish support to give Groudon a form of recovery. Pokemon that appreciate entry hazard support to get easier KOs like Mega Rayquaza and Arceus are good teammates. Fairy-type checks like Mega Gengar, Ho-Oh, and Arceus-Poison are great for taking care of Xerneas. Options for dealing with Primal Kyogre such as Primal Groudon are recommended, as this set struggles immensely with Primal Kyogre, contrary to the other listed sets.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 202117, "username": "MZ"}, {"user_id": 262044, "username": "Chloe"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "The Dutch Plumberjack"}]}], "writtenBy": [{"user_id": 241023, "username": "Kris"}]}
  },
  "Rayquaza": {
    "overview": "<p>Mega Rayquaza is a dominant force in the current Anything Goes metagame, with its amazing 180 offensive stats coupled with a great Dragon / Flying offensive typing making it one of the best wallbreakers in the tier. Its STAB moves combined with its great coverage make it difficult to find checks and counters that can reliably switch into its attacks. It also has great durability for an offensive Pokemon, as its amazing defensive typing in conjunction with Delta Stream cutting the damage from some super effective moves in half and canceling out opposing Primal weather means it can provide great defensive synergy on offensively oriented teams. Mega Rayquaza has a diverse movepool with priority in Extreme Speed, two setup moves in Dragon Dance and Swords Dance, and amazing coverage letting it hit most of the metagame for at least neutral damage. Its lack of needing to hold a Mega Stone also helps increase the diversity between its sets, meaning it can have more options compared to other Mega Evolutions.</p> <p>However, although it has a high base Speed, it still does not outspeed key threats in Deoxys-A, Darkrai, and Mewtwo, leaving it reliant on priority to take them out. This is an issue, as Mega Rayquaza is often forced to run Extreme Speed so that it cannot be revenge killed easily, especially before Mega Evolving. Being slower than Arceus also means that it can be taken out by the latter's Extreme Speed. Lastly, Mega Rayquaza takes up your team's Mega slot, preventing you from running other Mega Evolutions.</p> ",
    "comments": "<h1>Other Options</h1> <p>Mega Rayquaza has many potential sets to choose from. Mega Rayquaza can run a Choice Specs set as well, as it can surprise and KO physically oriented walls such as Lugia and Primal Groudon; however, this set is generally not recommended, as Rayquaza must run Dragon Ascent to Mega Evolve, meaning that it will need to invest in its Attack in order to use such a set to its full potential. It also means that Mega Rayquaza cannot utilize Extreme Speed, which makes it easily revenge killed by faster Pokemon like Darkrai and Mewtwo. Being locked into Draco Meteor can also be a setback, as the stat drops can easily allow your opponent to bring in a Fairy-type Pokemon like Xerneas and have a free turn to set up Geomancy. Regular Rayquaza can also be used, but it is outclassed by its Mega Evolution due to Mega Rayquaza's ability to do everything regular Rayquaza can but better. Although it can effectively be used as a wallbreaker alongside another Mega Pokemon such as Mega Diancie and Mega Salamence, it's still rather niche overall. A bulky Mega Rayquaza set is possible as well due to Mega Rayquaza's great natural bulk and access to Delta Stream. Bulky spreads with Swords Dance and Dragon Dance are possible, giving Mega Rayquaza more setup opportunities with its extra bulk. A spread of 200 HP / 252 Attack / 56 Speed with an Adamant nature allows Mega Rayquaza to survive a +2 Extreme Speed from a Jolly Lum Berry Arceus after Stealth Rock damage. It is also able to outspeed uninvested Arceus, Primal Kyogre, and Groudon without any stat boosts and can outspeed the entire metagame after a Dragon Dance. However, this set is quite mediocre, as Primal Groudon and Primal Kyogre can both set up with their impressive bulk as well, and the Speed Mega Rayquaza loses with this set leaves it susceptible to faster Pokemon that can revenge kill it. Choice Scarf Mega Rayquaza is often considered viable due to the majority of players assuming that it is a great revenge killer. This is true to some extent, but Mega Rayquaza's access to Extreme Speed means it's somewhat unnecessary to run Choice Scarf to outspeed other threats. Mega Rayquaza can also gain Speed boosts from Dragon Dance, which often surpasses the capabilities of the Choice Scarf set, as the latter set's lack of Life Orb or boosted stats often leaves Mega Rayquaza too weak to 2HKO the threats it's supposed to. Mega Rayquaza can attempt to utilize Earthquake instead of Waterfall on its Choice Band set, but Earthquake is a poor move to be Choice-locked into, and it nets few KOs that Mega Rayquaza does not already attain.</p> <h1>Checks and Counters</h1> <p><strong>Fairy-types: Bulky Fairy-types such as Xerneas, Klefki, and Arceus-Fairy can all check Mega Rayquaza due to their immunity to Dragon-type moves, and they are usually capable of surviving any unboosted move Mega Rayquaza has to offer and proceeding to OHKO it with their respective STAB attacks. Mega Rayquaza will also need to be wary of Choice Scarf Xerneas and fast, bulky Arceus-Fairy, which are able to outspeed it and take it out. Klefki is also a nuisance, as it is able to hax Mega Rayquaza with Swagger, Thunder Wave, and Double Team before it is even able to hit back.</p> <p><strong>Lugia: Lugia can check Mega Rayquaza with Multiscale and is able to 2HKO it with Ice Beam. However, Lugia will always need to be at full health if it would like to survive a boosted hit and will need to invest in Special Attack in order to be able to 2HKO or OHKO Mega Rayquaza with Ice Beam.</p> <p><strong>Arceus-Dragon</strong>: Bulky Arceus-Dragon sets can usually avoid any 2HKOs from non-special or mixed sets while being able to OHKO Mega Rayquaza with Judgment. Arceus-Dragon's typing allows it to take any of Mega Rayquaza's attacks besides Outrage and Draco Meteor without being hit super effectively.</p> <p><strong>Yveltal</strong>: Bulky Yveltal variants use Foul Play to deal massive amounts of damage to every Mega Rayquaza variant except the Choice Specs set, while it can survive any unboosted hit from Mega Rayquaza.</p> <p><strong>Status Moves</strong>: Status moves like Thunder Wave and Will-O-Wisp from Pokemon such as Klefki and Mega Sableye can cripple Mega Rayquaza tremendously and potentially leave it useless for the rest of the match, although if Rayquaza chooses to run a Lum Berry, this issue can be remedied once.</p> <p><strong>Steel-types: Steel-type Pokemon resist both of Mega Rayquaza's STAB attacks and can wall it depending on which coverage moves it decides to run. Bullet Punch users can revenge kill Mega Rayquaza once it's weakened, as they resist Extreme Speed.</p> <p><strong>Arceus-Rock</strong>: Defensive Arceus-Rock is able to survive a +1 Waterfall or Earthquake from Mega Rayquaza and can burn or paralyze it in return.</p> <p><strong>Faster Pokemon</strong>: Faster threats such as Darkrai and Mewtwo can revenge kill Mega Rayquaza once it has been weakened by Life Orb recoil or Dragon Ascent stat drops. Choice Scarf users such as Kyurem-W and Genesect can also threaten to OHKO Mega Rayquaza without any Speed boosts with a super effective Ice Beam. This means Mega Rayquaza will often rely on priority to deal with these faster threats, but these Pokemon will need to be wary, as Mega Rayquaza can potentially KO them with a boosted Extreme Speed when they are weakened.</p> ",
    "sets": [
      {
        "name": "Dragon Dance",
        "description": "<h1>Moves</h1> <p>Dragon Dance boosts Mega Rayquaza's Attack and Speed by one stage, making it capable of sweeping many teams even after only one boost. Dragon Ascent 2HKOes most neutral targets after one Attack boost, including Primal Groudon, Lugia, and Arceus. Earthquake provides coverage on common Pokemon that resist Flying such as Klefki, Arceus-Rock, and Arceus-Steel. V-create is an alternative that allows Mega Rayquaza to hit Steel-types such as Ferrothorn, Arceus-Steel, and Skarmory for significantly more damage; however, its stats drops in conjunction with those of Dragon Ascent can make Mega Rayquaza get worn down more easily. Extreme Speed is a useful priority move, hitting before Arceus's Extreme Speed after one Dragon Dance boost. It also reliably hits faster foes when Mega Rayquaza does not have any boosts.</p> <h1>Set Details</h1> <p>Lum Berry allows Mega Rayquaza to sponge one status move and retaliate with a powerful attack. This helps it defeat Klefki and Mega Sableye more reliably. An Adamant nature increases Mega Rayquaza's raw power, and Mega Rayquaza does not need to maximize its Speed due to Dragon Dance boosting its Speed stat already. However, Jolly can still be run if you prefer Mega Rayquaza to outspeed Pokemon like Mega Diancie and Latios before any boosts. This depends on what your team requires Mega Rayquaza to accomplish. Finally, the EVs are maximized in Attack and Speed to give Mega Rayquaza the best chance of sweeping.</p> <h1>Usage Tips</h1> <p>Dragon Dance Mega Rayquaza should be used late-game, once the opposing team is weakened so that it can start setting up freely. Notable Pokemon that Dragon Dance Mega Rayquaza prefers to be weakened are Steel-types that are not hit super effectively by Ground-type attacks, as well as bulky Fairy-types that can survive a +1 Dragon Ascent. Also, make sure Mega Rayquaza does not try to set up on Pokemon that can potentially cripple it. Even if Mega Rayquaza is running Lum Berry, Pokemon like Klefki and bulky Arceus can either paralyze or burn it again after setting up. Try not to bring Mega Rayquaza in on attacks, even if they are neutral, as it might then be too weakened to take priority moves. Lastly, avoid using Dragon Ascent when it is unnecessary, such as when Mega Rayquaza is facing a weakened Xerneas or Arceus-Ground; if it is capable of taking them out with a +1 Earthquake, it is recommended to use that instead of Dragon Ascent, as the stat drops can leave Mega Rayquaza susceptible to priority moves afterwards.</p> <h1>Team Options</h1> <p>Thanks to Mega Rayquaza's immaculate offensive prowess and wallbreaking capabilities, it can easily fit onto any offensive team. Specially defensive Primal Groudon is an amazing partner for Dragon Dance Mega Rayquaza, as even if it is running Lum Berry, it still does not appreciate status, and utilizing Primal Groudon to sponge burns and paralysis can save Mega Rayquaza's Lum Berry for foes like Swagger Klefki. Primal Groudon can also set up Stealth Rock and deal with Fairies such as Xerneas and Arceus-Fairy, which can force Mega Rayquaza out. Klefki can absorb Fairy-type and Dragon-type attacks as well as spread paralysis, which can help Mega Rayquaza sweep later on; in return, Mega Rayquaza has no problem switching into the Fire-type and Ground-type moves that Klefki is weak to. Mega Diancie is a huge threat for Mega Rayquaza, as it can outspeed and KO it if it hasn't obtained any boosts. Luckily, Calm Mind Arceus-Steel is a great counter to Mega Diancie, as well as to Arceus-Fairy, defensive Yveltal, and non-Focus Blast Xerneas. Entry hazard removers such as Arceus-Fairy and Arceus-Rock are recommended, as Mega Rayquaza appreciates having Stealth Rock off the field and can weaken their checks and counters such as Klefki and Arceus-Steel with Earthquake in return. Entry setters are also recommended, as Mega Rayquaza can sometimes get crucial KOs on foes with entry hazards up, such as Arceus after one boost and Multiscale Lugia. Other physical wallbreakers like Arceus-Ground and Arceus-Ghost can be used to weaken Mega Rayquaza's checks and apply more offensive pressure to the opposing team. Steel-types such as Arceus-Steel and Ferrothorn have amazing defensive synergy with Mega Rayquaza, as they can take Fairy-type attacks easily and can set up entry hazards to boot.</p> "
      },
      {
        "name": "Choice Band",
        "description": "<h1>Moves</h1> <p>Dragon Ascent is Mega Rayquaza's main STAB move for denting anything that doesn't resist Flying. Extreme Speed allows Mega Rayquaza to revenge kill faster foes with extremely strong priority. V-create hits opposing Steel-types like Klefki and Skarmory, and Waterfall allows Mega Rayquaza to OHKO Primal Groudon if Desolate Land is not in effect and hits Rock-types such as Arceus-Rock and Tyranitar.</p> <h1>Set Details</h1> <p>Maximum Attack investment with a Choice Band allows Mega Rayquaza to hit as hard as possible and wallbreak more effectively. Maximum Speed investment lets Rayquaza outspeed as many foes as possible to KO them without relying on Extreme Speed. An Adamant nature further increases Mega Rayquaza's attacking power and secures the OHKO on uninvested Arceus and standard Xerneas, but Jolly can be used to outspeed Adamant Mega Rayquaza, Mega Diancie, and all non-positive nature Arceus formes. 4 Special Defense EVs make Genesect's Download grant it a boost to Attack rather than Special Attack, weakening its Ice Beam.</p> <h1>Usage Tips</h1> <p>Mega Rayquaza should be brought in often versus balanced and defensive teams to quickly break through their defensive cores. Scout for the typing of opposing Arceus formes before throwing out attacks to avoid using Dragon Ascent into Arceus-Steel or Arceus-Rock or being rendered setup fodder for Arceus-Ghost after using Extreme Speed. Be aware that Waterfall can be somewhat weak and many common Pokemon such as Primal Kyogre and opposing Mega Rayquaza resist it and can use a Choice-locked Mega Rayquaza for setup fodder. If the opposing team has a fast sweeper such as Geomancy Xerneas or Deoxys-A, Mega Rayquaza can be preserved to revenge kill them with Extreme Speed.</p> <h1>Team Options</h1> <p>Setup sweepers such as Geomancy Xerneas and Swords Dance Arceus-Ghost appreciate Mega Rayquaza's ability to demolish defensive Pokemon. Entry hazard removers such as Arceus-Fairy and Giratina-O can remove Stealth Rock to grant Mega Rayquaza more opportunities to switch in. Mega Rayquaza also appreciates Stealth Rock setters such as Primal Groudon and Skarmory to wear down switch-ins even more easily. Primal Kyogre is an excellent offensive partner, as it can take on Arceus-Rock and Arceus-Steel for Mega Rayquaza while Mega Rayquaza checks Primal Groudon. Fairy-types checks such as Arceus-Steel and Primal Groudon help take on foes such as Mega Diancie, which can revenge kill Mega Rayquaza. Status absorbers such as Rest Primal Kyogre and Aromatherapy Xerneas can switch into Thunder Wave or Will-O-Wisp from foes such as Klefki and bulky Arceus formes.</p> "
      },
      {
        "name": "Swords Dance",
        "description": "<h1>Moves</h1> <p>Swords Dance boosts Mega Rayquaza's Attack to insane levels, letting it easily OHKO or 2HKO the entire metagame after one boost. Dragon Ascent allows Mega Rayquaza to hit Pokemon like Xerneas, Ho-Oh, and Lugia for powerful neutral damage. Earthquake provides nice coverage in conjunction with Dragon Ascent, letting Mega Rayquaza hit threats like Primal Groudon, Arceus-Rock, and Klefki super effectively. V-create can be used instead to hit Pokemon like Ferrothorn and Skarmory for super effective damage, which Earthquake cannot do; however, the stat drops from V-create coupled with those from Dragon Ascent can make Mega Rayquaza get worn down quite quickly. Extreme Speed should be used to hit faster threats that can threaten to revenge kill Mega Rayquaza.</p> <h1>Set Details</h1> <p>Life Orb is generally preferred to get key KOs on Pokemon that would otherwise be able to survive a +2 attack from Mega Rayquaza. Lum Berry is a popular alternative that allows Mega Rayquaza to sponge Thunder Wave or Swagger from Klefki or Will-O-Wisp from Mega Sableye and Arceus-Fairy and retaliate without suffering recoil from Life Orb. A Jolly nature is preferred, as it allows Mega Rayquaza to outspeed Pokemon that can threaten it like Mega Diancie, Adamant Mega Rayquaza, Adamant Arceus, and Lugia. Adamant can also be used to get the almost-guaranteed 2HKO with Dragon Ascent against Multiscale Lugia, although Mega Rayquaza is then outsped by those other Pokemon. Speed and Attack EVs are maximized to let Mega Rayquaza outspeed as much of the metagame and deal as much damage as possible.</p> <h1>Usage Tips</h1> <p>Because Mega Rayquaza cannot boost its Speed with this set, it risks being revenge killed against more offensive teams. However, it performs well against stall teams, where it has an easier time setting up against Pokemon that cannot deal significant damage to it. It is generally preferred to sweep with Swords Dance Mega Rayquaza later on during the match, letting teammates take care of threats like Primal Groudon and Klefki, which can hamper Mega Rayquaza's sweeping capabilities at full health. Mega Rayquaza should also not be switching in on powerful attacks, meaning it should only come in after a teammate has been KOed. It is advised to conserve its health until the late-game, as that is when it will be able to sweep most effectively. However, it also appreciates coming in on weakened Pokemon so that it can revenge kill them with Extreme Speed, which guarantees a free Mega Evolution. Mega Rayquaza should avoid setting up on defensive Arceus formes, as they can threaten to cripple it with Will-O-Wisp. However, it can OHKO Arceus-Fairy, one of its best counters, with a +2 Adamant Dragon Ascent after Stealth Rock. It also appreciates being at near-full health against offensive Arceus formes due to their inability to revenge kill a healthy Mega Rayquaza even with a +2 Extreme Speed. Being able to bluff whether or not your Mega Rayquaza has V-create or Earthquake can also come to your advantage, as your opponent will need to be wary of which Pokemon they can bring in to check it.</p> <h1>Team Options</h1> <p>Physically defensive Primal Groudon can deal with Fairy-types such as Xerneas, Klefki, and Arceus-Fairy, which threaten to take out Mega Rayquaza. It can also take priority moves from faster revenge killers, which Mega Rayquaza is quite vulnerable to, as well as Will-O-Wisp or Thunder Wave, which would otherwise cripple Mega Rayquaza, particularly if it runs Life Orb. Entry hazard removal is not mandatory, but it's heavily encouraged, as Mega Rayquaza tends to switch in and out quite often. Arceus-Water is a nice teammate to do this, as it can take on Primal Groudon quite easily. Entry hazard setters such as Primal Groudon and Deoxys-S are also very nice to have, as they can grant Mega Rayquaza more OHKOs and break Lugia's Multiscale. Wallbreakers such as Nasty Plot Darkrai and Calm Mind Primal Kyogre are also nice to take care of bulky walls such as Arceus-Fairy and Multiscale Lugia that threaten Mega Rayquaza. Pokemon like Xerneas and Latios that are threatened by Steel-types also work very well with Mega Rayquaza if it runs V-create, as it can lure and break down Ferrothorn and Skarmory.</p> "
      },
      {
        "name": "Mixed Life Orb Attacker",
        "description": "<h1>Moves</h1> <p>Draco Meteor lets Mega Rayquaza lure and break physically defensive walls that are assuming that it is purely physical. Dragon Ascent lets Mega Rayquaza hit Fairy-types that Draco Meteor cannot. It also lets Mega Rayquaza hit walls that have no issue taking any of Mega Rayquaza's special moves like Ho-Oh and Primal Kyogre. Earthquake is more commonly used as a coverage option, as it lets Mega Rayquaza hit Steel-types such as Arceus-Steel and Klefki and Rock-types such as Mega Diancie and Arceus-Rock super effectively, but Surf can also be utilized to OHKO Primal Groudon, which can otherwise survive any hit Mega Rayquaza has to offer if it has investment in bulk and is at relatively high HP. Fire Blast is another alternative that can hit physically bulky Steel-types that are not hit super effectively by Earthquake, such as Skarmory and Ferrothorn. Extreme Speed should be used to take out faster threats such as Darkrai and Arceus that can hinder Mega Rayquaza's wallbreaking capabilities.</p> <h1>Set Details</h1> <p>Life Orb is used on this set, as it increases Mega Rayquaza's overall power and wallbreaking capabilities to impressive levels. Naive is the nature of choice, as it does not hinder Mega Rayquaza's offensive stats and still lets it outspeed Pokemon such as Mega Diancie and Latios. Dropping Mega Rayquaza's Special Defense stat over its Defense is optimal, as this allows Mega Rayquaza to not be 2HKOed by Arceus's Extreme Speed. However, this does leave it in range to get 2HKOed by Primal Kyogre's and Mewtwo's Ice Beam. The given EVs allow Mega Rayquaza to OHKO Primal Groudon with Surf, 2HKO Arceus with Draco Meteor, and still be able to muscle through most special walls with ease.</p> <h1>Usage Tips</h1> <p>This Mega Rayquaza set is best used early in the game, as it can break through the opposing team because of its expansive coverage. However, it can be quite inferior compared to other sets, as this Mega Rayquaza cannot boost any of its stats, which leaves it vulnerable to faster revenge killers. It can also be easily taken down by two of the metagame's most prominent threats in Darkrai and Klefki, as they can take advantage of Draco Meteor and Dragon Ascent's stat drops and set up a Substitute against it. This is why it is important to only use this set against Pokemon that cannot take advantage of Mega Rayquaza's lowered stats and start setting up. As mentioned previously, this set is not designed to take damage from even neutral attacks. In light of this, it is advised to safely bring in Rayquaza in order for it to last longer and ensure a safe Mega Evolution by sacking a teammate or bringing it in on a weakened Pokemon that can be taken out by Extreme Speed. Being able to bluff a strictly physical set is vital and sometimes game changing, as your opponent might bring in a check that deals with a physical Mega Rayquaza only for it to be destroyed by a Draco Meteor. Be wary when deciding whether to use Dragon Ascent, as the Defense drops can leave Mega Rayquaza susceptible to priority moves from Arceus and other Mega Rayquaza. This set cannot sweep teams as well as the other Mega Rayquaza sets can due to it being plagued by stat drops, meaning it is geared towards a wallbreaking role instead of a sweeping one.</p> <h1>Team Options</h1> <p>Primal Groudon is a great partner for this set, as it can effectively run a dual dance or Rock Polish set due to Mega Rayquaza being able to weaken all of Primal Groudon's checks, allowing it to sweep the opposing team with ease. Primal Groudon can also deal with Fairy-types easily and absorb status moves such as Will-O-Wisp and Thunder Wave, which can cripple Mega Rayquaza. It can also spread paralysis against faster threats, which helps Mega Rayquaza wallbreak more easily because it need not fear being revenge killed. Other setup sweepers such as Nasty Plot Darkrai, Swords Dance Arceus, and Geomancy Xerneas also fit well with this set, as all of their checks and counters can be severely weakened by Mega Rayquaza's scary offensive pressure as well. Entry hazard removal is required, as Mega Rayquaza needs to switch out frequently due to the stat drops from its moves. Good examples of Pokemon capable of filling this role are Latios, Arceus-Steel, and Arceus-Fairy, as Mega Rayquaza can weaken their checks and counters with Earthquake. Hazard support is also advised, as it lets Mega Rayquaza have an easier time breaking the opposing team's walls and acquire more OHKOs against Pokemon such as Ho-Oh, Lugia, and Yveltal. Notable Pokemon that fill this role include Primal Groudon and Klefki, which can apply pressure to the opposing team while setting up their respective hazards. Cleric support can be useful in conjunction with this set, as Mega Rayquaza will often be worn down quickly after Life Orb recoil and constant switching when Draco Meteor and Dragon Ascent stat drops occur. If Mega Rayquaza chooses to run Earthquake, Pokemon that can remove Steel-types like Ferrothorn and Skarmory are recommended. This includes Primal Groudon and Ho-Oh, which can break through bulky Fairy-types and also appreciate Mega Rayquaza's wallbreaking capabilities immensely.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 277877, "username": "HunterStorm"}, {"user_id": 262044, "username": "Chloe"}, {"user_id": 202117, "username": "MZ"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "The Dutch Plumberjack"}, {"user_id": 193885, "username": "Haund"}, {"user_id": 175616, "username": "Empress"}, {"user_id": 91628, "username": "GatoDelFuego"}]}], "writtenBy": [{"user_id": 202117, "username": "MZ"}]}
  },
  "Deoxys-Attack": {
    "overview": "<p>Deoxys-A has incredible mixed offensive stats that allow it to OHKO most of the metagame and possesses an incredible Speed tier that allows it to outpace every relevant offensive Pokemon. This is further backed by a solid movepool, which gives it the coverage to hit any wall that resists its powerful STAB moves at least neutrally. Deoxys-A also has access to Extreme Speed, which allows it to aid in checking faster or boosted threats such as Extreme Killer Arceus, Geomancy Xerneas, and Mega Rayquaza. Deoxys-A functions as an offensive sweeper as well as a capable wallbreaker, making it useful against nearly any archetype, and it can set entry hazards with almost no risk of being setup bait thanks to its offensive pressure. However, Deoxys-A is severely hindered in all of its roles by low defenses and vulnerability to priority, which means it requires Defog support in order to not be forced out by common Pokemon such as Arceus and Mega Rayquaza. Deoxys-A is also prey to fast Choice Scarf users, and it faces competition in its lead role from the bulkier and faster Deoxys-S.</p> ",
    "comments": "<h1>Other Options</h1> <p>Low Kick is another option for the offensive set that does not cause any Attack drops and still hits the majority of the metagame for 120 Base Power, but it fails to OHKO Darkrai.</p> <h1>Checks and Counters</h1> <p>**Mega Sableye **: Mega Sableye's typing makes it immune to Psycho Boost, Superpower, and Extreme Speed. It also has sufficient bulk to tank hits such as Knock Off or Ice Beam with ease and stall out Deoxys-A or just KO it outright with Foul Play. Magic Bounce even prevents Deoxys-A from setting up Stealth Rocks or Taunting it, allowing Mega Sableye to invalidate the lead set.</p> <p><strong>Choice Scarf Pokemon: Choice Scarf Pokemon such as Xerneas, Jirachi, and Genesect are massive issues for Deoxys-A due to their greater Speed. While none of them like switching in, they can revenge kill Deoxys-A or pivot into walls such as Yveltal that can take Deoxys-A's attacks.</p> <p><strong>Priority: Priority users can take advantage of Deoxys-A's poor bulk, forcing it to use Extreme Speed rather than getting major damage in. Yveltal and Arceus in particular accomplish this well, as they have the bulk to take a hit should Deoxys-A have an intact Focus Sash.</p> <p><strong>Klefki: Due to its defensive typing, ability, and stats, Klefki is able to survive several of Deoxys-A's moves and more importantly cripple it with status moves such as Swagger and Thunder Wave before Deoxys-A can attack.</p> ",
    "sets": [
      {
        "name": "All-Out Attacker",
        "description": "<h1>Moves</h1> <p>Psycho Boost is Deoxys-A's most powerful STAB move. Its typing and high Base Power mean that it 2HKOes or OHKOes every neutral target, making it usually worth the drop in Special Attack. Superpower is solid coverage for Dark- and Steel-types that are immune to or resist Psycho Boost, albeit with a nasty side effect of dropping Deoxys-A's Attack. Extreme Speed is a powerful physical move used to revenge kill weakened Pokemon without needing to worry about opposing priority, stat drops, or boosted Speed stats. Ice Beam handles threats such as Yveltal, Lugia, and Mega Rayquaza, while Knock Off is another option that does heavy damage to Dark-type weak Pokemon such as Mewtwo and Jirachi while removing items.</p> <h1>Set Details</h1> <p>252 Special Attack EVs and a Special Attack-boosting nature make Psycho Boost and Ice Beam hit as hard as possible, and Mild is chosen over Rash to avoid the OHKO from Lugia's Ice Beam after Stealth Rock. 236 Speed EVs let Deoxys-A reach 395 Spe, which lets it outspeed every single unboosted offensive threat other than Mega Mewtwo Y and faster variants of itself, and allow it to revenge kill top metagame picks such as Mega Gengar and Mewtwo. The remaining 20 EVs are placed in Attack to add a little extra damage to Extreme Speed and Superpower. Focus Sash is the recommended item in this set because Extreme Speed users are extremely common in Anything Goes and are all capable of OHKOing Deoxys-A. Since all of Deoxys-A's strong moves lack priority, it is very valuable to get off a second hit. Life Orb is an alternative option that gives the power to OHKO some Primal Groudon variants, Xerneas, and Arceus formes at the cost of a greater weakness to priority.</p> <h1>Usage Tips</h1> <p>Deoxys-A is best used in the beginning of the match to break down as many walls as possible for another Pokemon to sweep. It's usually optimal to use Deoxys-A as a hit-and-run attacker due to its stat drops allowing Pokemon such as Geomancy Xerneas to set up on it. Bring Deoxys-A in with pivoting moves and to revenge kill whenever possible to keep its Focus Sash intact. Focus Sash allows Deoxys-A to act as an emergency check to powerful attackers such as Dragon Dance Mega Rayquaza and Geomancy Xerneas, so be sure to keep entry hazards off the field if that role will be necessary.</p> <h1>Team Options</h1> <p>Sweepers that appreciate Deoxys-A's wallbreaking, such as Extreme Killer Arceus, Mega Rayquaza, and Xerneas, pair well to take advantage of the holes Deoxys-A provides. Answers to Mega Sableye such as Mega Diancie, Arceus-Fairy, and Primal Groudon are important, as Mega Sableye utterly walls Deoxys-A. Checks to Klefki such as Primal Groudon, Mega Diancie, and Lum Berry Arceus are also great teammates due to how effectively Klefki deals with Deoxys-A. Defog Pokemon such as support Arceus and Giratina or Magic Bounce users such as Mega Diancie should be paired with Deoxys-A to keep opposing entry hazards off the field, while physical walls such as Lugia, Yveltal, and Skarmory are useful to check common priority users like Extreme Killer Arceus and Mega Rayquaza. Entry hazard setters such as Primal Groudon, Klefki, and support Arceus are also handy to let Deoxys-A OHKO bulky Pokemon such as Yveltal and Primal Groudon.</p> "
      },
      {
        "name": "Suicide Lead",
        "description": "<h1>Moves</h1> <p>Psycho Boost does heavy damage to opposing Pokemon, preventing most Magic Bounce users and Defoggers, such as Mega Diancie and support Arceus, from switching in. Stealth Rock is the preferred entry hazard move, as it is easy to set up and does more consistent damage, particularly to common Rock-weak Pokemon such as Mega Rayquaza and Ho-Oh. Spikes is another potential hazard option, but it is usually inferior, as Deoxys-A's nonexistent bulk makes it difficult to set up more than one or two layers and it does not affect Flying-types. Taunt prevents Pokemon from Defogging, stops setup attempts and opposing entry hazard setters, and allows your team to dictate the flow of battle. However, some Pokemon can use this opportunity to get off a free attack. Knock Off cripples most other leads and item-reliant Pokemon such as Deoxys-S, Xerneas, and Ho-Oh, while Extreme Speed is an option to get in a bit more chip damage before fainting against a faster or Dark-type Pokemon</p> <h1>Set Details</h1> <p>252 Speed EVs and a Speed-boosting nature allow Deoxys-A to outspeed nearly every relevant Pokemon, only losing to Deoxys-S and Choice Scarf users such as Xerneas and Jirachi. Naive is chosen over Hasty to allow Deoxys-A to survive an extra Rapid Spin from Excadrill. 252 Special Attack EVs maximize the power of Psycho Boost, significantly increasing Deoxys-A's offensive presence, while 4 Attack EVs provide a little extra power to Knock Off and Extreme Speed. Focus Sash is a must in order for Deoxys-A to get at least one entry hazard in place before it goes down.</p> <h1>Usage Tips</h1> <p>This set should be used as a lead for offensive or hyper offensive teams, where it sets up entry hazards and then gets KOed. Once it has been KOed, you have the opportunity to bring in the Pokemon of your choice to gain momentum. Taunt also helps Deoxys-A prevent hazards and Defog from other leads, but don't be too obvious in its use, as they can turn it into a wasted turn by attacking. When faced with a Magic Bounce user such as Espeon or Mega Diancie, it is better to attempt to eliminate them first with Knock Off or Psycho Boost and then set up hazards safely. If the opponent has a Mega Sableye, do not lead with Deoxys-A, and be cautious using it until Mega Sableye is knocked out.</p> <h1>Team Options</h1> <p>Since this set is usually used right at the start of the battle, there isn't really any specific set or teammate that it needs to function properly bar offensive Pokemon that appreciate its entry hazards. However, Pokemon such as Xerneas that can answer Mega Sableye are extremely useful due to its ability to hard wall Deoxys-A and prevent hazards from going up. Having a Pokemon such as Mega Gengar or Darkrai that puts pressure on common Defoggers such as support Arceus and Giratina is also handy. Setup sweepers and wallbreakers such as Extreme Killer Arceus, Geomancy Xerneas, and Dragon Dance Mega Rayquaza that appreciate hazards and crippled walls also pair well with this set.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 202117, "username": "MZ"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "The Dutch Plumberjack"}, {"user_id": 100418, "username": "Eien"}]}], "writtenBy": [{"user_id": 297239, "username": "Quantum Tesseract"}]}
  },
  "Dialga": {
    "overview": "<p>Dialga is a great lead because it sets Stealth Rock reliably thanks to its favorable matchup against most Magic Bounce Pokemon and common Defog users. It also has decent offensive presence, especially for a Stealth Rock setter, and a solid defensive typing, though Dialga's STAB attacks do have pretty mediocre coverage, leaving it with a dependence on coverage moves that it doesn't always have space for. Furthermore, if lacking Roar, it is setup bait for some Pokemon such as Calm Mind Fairy Arceus. Lack of recovery hurts Dialga's viability, causing it to get worn down easily throughout a game. It's also fairly slow and lacks priority, leaving it vulnerable to fast attackers.</p> ",
    "comments": "<h1>Other Options</h1> <p>Metal Burst is a great option on Dialga thanks to a combination of its low Speed, decent HP, and solid bulk in general that allows it to sponge a lot of hits; however, it is hard to justify using a moveslot this way. Toxic is a decent option for Dialga to surprise Pokemon that intend to set up on it such as Calm Mind Arecus formes, but again, it is hard to justify using it. Thunder is a good option to hit some Pokemon super effectively that would otherwise beat Dialga such as Water Arceus and Primal Kyogre. Leftovers gives Dialga some passive recovery but is overall less useful than Shuca Berry. Life Orb increases Dialga's already decent offensive presence, though lacking Shuca Berry prevents it from getting Stealth Rock up as reliably. Lum Berry allows Dialga to take a Dark Void from Darkrai and either get Stealth Rock up or threaten to KO it with Draco Meteor, so it is useful if your team is weak to Darkrai. Dialga can utilize a Choice Scarf set fairly well and deal a lot of damage, though it has difficulty KOing some common attackers. The Choice Scarf set can also run Sleep Talk to surprise Darkrai.</p> <h1>Checks and Counters</h1> <p><strong>Darkrai: Darkrai outpaces Dialga, puts it to sleep, and then sets up on it, so it is essential that teams using Dialga can handle it.</p> <p><strong>Calm Mind Arceus Formes</strong>: If Dialga lacks Roar, Arceus formes carrying Calm Mind such as Fairy Arceus and Dark Arceus simply set up on it freely.</p> <p><strong>Magic Coat Arceus</strong>: Arceus carrying Magic Coat can bounce back Dialga's Stealth Rock and set up on it easily.</p> <p><strong>Mega Mewtwo X</strong>: Mega Mewtwo X, while uncommon, outpaces and OHKOes Dialga with its Fighting-type STAB attacks.</p> <p><strong>Ho-Oh</strong>: Ho-Oh takes very little damage from anything Dialga commonly runs and hits it back extremely hard with a Sacred Fire or Earthquake.</p> <p><strong>Specially Bulky Pokemon</strong>: Specially bulky Pokemon with recovery moves such as Primal Kyogre and bulky Arceus formes can simply eat any of Dialga's attacks and heal the damage off, as Dialga can't boost its Special Attack. Chansey and Blissey in particular are terrible for Dialga, as it is completely incapable of dealing any significant damage to them.</p> <p><strong>Deoxys Formes: Lead Deoxys-S and Deoxys-A can outspeed and Taunt Dialga to prevent it setting up Stealth Rock before laying their own entry hazards, giving it a poor lead matchup. Offensive Deoxys-A can also do a significant amount of damage to Dialga with Superpower.</p> ",
    "sets": [
      {
        "name": "Offensive Lead",
        "description": "<h1>Moves</h1> <p>Flash Cannon is the best Steel-type STAB move Dialga has, with decent Base Power and no drawbacks. Draco Meteor is a powerful STAB move, hitting everything that doesn't resist it extremely hard. Fire Blast is a very useful coverage move for Steel-type Pokemon such as Steel Arceus and Ferrothorn, which resist both of Dialga's STAB attacks. Roar is a decent option in place of Fire Blast to phaze foes, preventing them from setting up on Dialga and racking up entry hazard damage, and the Special Attack drop from Draco Meteor can make Dialga setup bait a lot of the time if it lacks Roar. Stealth Rock provides support for Dialga's teammates by racking up passive damage.</p> <h1>Set Details</h1> <p>Pressure can be useful in certain situations by allowing Dialga to PP stall common low-PP moves such as Extreme Speed from Extreme Killer Arceus. Ground-type coverage is extremely common in Anything Goes, so Shuca Berry allows Dialga to tank more hits and get entry hazards up much more reliably. 12 Speed EVs allow Dialga to outpace Diancie pre-Mega Evolution, which is very useful, because Diancie is a very common lead and Dialga can OHKO it easily with Flash Cannon. 248 Special Attack EVs along with a Modest nature make Dialga as powerful as possible.</p> <h1>Usage Tips</h1> <p>Dialga should lead most of the time in order to get entry hazards up as early as possible. Assuming you have Shuca Berry, luring in opposing Primal Groudon and using Draco Meteor to cripple the opposing team's hazard setter can be great in the long term, as you won't have to deal with Stealth Rock on your side of the field. It also opens the door for Pokemon such as Choice Scarf Kyogre to sweep. Be careful when going for Draco Meteors, especially if you lack Roar, because it often leaves Dialga as setup bait. If your team is weak to Extreme Killer Arceus, try to keep Dialga healthy with its Shuca Berry intact in order to take it on late-game and prevent a sweep. Be aware of Magic Coat from foes such as Arceus, as it can catch Dialga off guard and reflect Stealth Rock.</p> <h1>Team Options</h1> <p>Dialga is very weak to Fighting-types such as Mega Mewtwo X, so it greatly benefits from being paired with checks to Mega Mewtwo X such as Arceus-Ghost and Yveltal. Xerneas really appreciates Dialga luring in and weakening Primal Groudon so it can sweep much more easily later. Dialga gets put to sleep and set up on by Darkrai, so Darkrai checks such as Sleep Talk Ho-Oh and Mega Diancie are great teammates. Pokemon that appreciate Stealth Rock support to pick up some extra KOs such as Xerneas and Mega Rayquaza are decent teammates for Dialga. Ghost-type Pokemon such as Arceus-Ghost can come in on Fighting-type moves and absorb the hits for Dialga, which is especially good when running Shuca Berry, as it prevents any super effective hits before Shuca Berry is used. Dialga rarely lasts past the first few turns, so it relies on its team to keep offensive pressure up on Defog users.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 202117, "username": "MZ"}, {"user_id": 262044, "username": "Chloe"}, {"user_id": 277877, "username": "HunterStorm"}]}, {"name": "Grammar checked by", "members": [{"user_id": 168392, "username": "P Squared"}, {"user_id": 193885, "username": "Haund"}]}], "writtenBy": [{"user_id": 276133, "username": "Josh"}]}
  },
  "Darkrai": {
    "overview": "<p>Darkrai is one of the most threatening Pokemon in the Anything Goes metagame thanks to its ability to put to sleep as many foes as it wants to in a row thanks the lack of a Sleep Clause. Its combination of Dark Void and excellent Speed makes it an incredibly difficult Pokemon to handle, and it can put to sleep and sweep entire teams with ease. Additionally, it has solid a Special Attack stat that can be boosted by Nasty Plot to make it a highly potent offensive sweeper, and it can also run multiple different options to demolish some of its checks. However, Darkrai's mediocre bulk can leave it somewhat vulnerable to priority users and strong attackers, which it needs to put to sleep to take on. Additionally, it can be checked by certain Fairy-types such as Mega Diancie, Clefable, and Xerneas, and Dark Void's middling accuracy can leave Darkrai in difficult situations.</p> ",
    "comments": "<h1>Other Options</h1> <p>Thunder allows Darkrai to hit Kyogre and Ho-Oh harder than anything else in its repertoire. Focus Blast targets Tyranitar, Ferrothorn, and Klefki, but Darkrai has trouble fitting this into its set. Focus Sash can allow Darkrai to survive a single hit and put foes to sleep, but it prevents Darkrai from effectively using Substitute and can be easily broken by entry hazards. Double Team Darkrai can become hard to take down with the combination of sleep, Substitute, and evasion boosting, but this is still checked by most of Darkrai's normal checks and is reliant on foes not waking up too quickly. Hidden Power Steel hits Mega Diancie, but the move is otherwise worthless and Mega Diancie can be worn down by Sludge Bomb anyway. An alternative spread of 180 Def / 72 SpA / 252 Spe allows Darkrai to survive two Extreme Speeds from Lum Berry Arceus after Stealth Rock and then put it to sleep with two Dark Voids, but this can be situational, requiring Darkrai to be at full health and sacrificing attacking power and Leftovers's recovery. Life Orb allows Darkrai to wallbreak more quickly, often with Sludge Bomb, but it makes it easier to be chipped away at and KOed. Thunder Wave and Will-O-Wisp have niche uses to cripple checks such as Choice Scarf Xerneas and Swords Dance Arceus, respectively, but Darkrai would almost always rather put its foes to sleep and not waste the moveslot.</p> <h1>Checks and Counters</h1> <p><strong>Faster Pokemon: If Darkrai does not have a Substitute up, it can be KOed by Pokemon such as Mewtwo, Shaymin-S, and Deoxys-A before it gets the chance to put them to sleep. Choice Scarf users such as Xerneas and Zekrom are also effective checks, especially if running Sleep Talk. Mega Gengar can trap Darkrai and OHKO it with Focus Blast.</p> <p><strong>Lum Berry and Sleep Talk: As Darkrai is reliant on sleep to beat most foes, it can be KOed by working around the status. Lum Berry users such as Arceus and Mega Rayquaza can absorb one Dark Void and either set up on or KO Darkrai, and Sleep Talk users can absorb Dark Void and still be able to attack Darkrai. Although Sleep Talk will occasionally be seen on many Pokemon specifically to check Darkrai, it is most often seen on Ho-Oh and Primal Kyogre, which can effectively take on Darkrai lacking Taunt thanks to their high natural Special Defense.</p> <p><strong>Magic Bounce and Magic Coat: Magic Bounce users such as Mega Diancie and Mega Sableye and Magic Coat users such as various Arceus formes can reflect Darkrai's Dark Void, putting it to sleep if it does not have a Substitute up and avoiding being put to sleep themselves.</p> <p><strong>Fairy-types: Darkrai lacking Sludge Bomb has no concrete way to hit Fairy-types and must instead slowly chip away at foes such as Xerneas and Arceus-Fairy with Dark Pulse and Bad Dreams. Additionally, Xerneas often carries Sleep Talk and a Choice Scarf, Mega Diancie can reflect Dark Void, and Klefki can paralyze Darkrai with Prankster Thunder Wave as long as it does not have a Substitute up.</p> <p><strong>Status: Poison or burn prevents Darkrai from effectively setting up Substitutes to stall out foes and chips away at its health. Paralysis allows Darkrai to be outsped and KOed far more easily.</p> ",
    "sets": [
      {
        "name": "Sleep Inducer",
        "description": "<h1>Moves</h1> <p>Dark Void puts foes to sleep, giving Darkrai an opportunity to set up Substitute and begin attacking with Dark Pulse. Nasty Plot allows Darkrai to increase its attacking power while its foes are sleeping to sweep more easily, while Sludge Bomb provides coverage to hit Fairy-types such as Clefable and Mega Diancie. Taunt allows Darkrai to beat Sleep Talk users such as Ho-Oh and Primal Kyogre more reliably by preventing them from attacking while asleep.</p> <h1>Set Details</h1> <p>Maximum Speed investment allows Darkrai to outspeed as many foes as possible to put them to sleep before they can damage it. Maximum Special Attack breaks down foes as quickly as possible, and Leftovers provides passive recovery to let Darkrai set up as many Substitutes as possible throughout the match.</p> <h1>Usage Tips</h1> <p>Darkrai's main goal should be to put every foe it faces to sleep, set up a Substitute, and begin wearing down the opposing team with Dark Pulse or boosting with Nasty Plot. Beware of surprise Sleep Talk or Magic Coat users, which can attack after the Dark Void or put Darkrai to sleep itself. Use Substitute frequently to scout for these moves. If facing a team with a Magic Bounce user, set up a Substitute to use Dark Void without fear of having Darkrai put to sleep itself. Darkrai should avoid directly switching into the field if possible, as it is very frail and needs to stay at a high amount of health to set up Substitutes.</p> <h1>Team Options</h1> <p>Using multiple Darkrai on the same team can effectively wear down its checks and counters by chipping away at Sleep Talk or Magic Bounce users and forcing them to use their Lum Berries. Checks to Extreme Killer Arceus and Mega Rayquaza, such as Skarmory, Arceus-Ghost, and Arceus-Rock, are essential, as these Pokemon can force Darkrai out easily. Fairy-type checks such as Primal Groudon and Arceus-Steel are also appreciated. Setup sweepers such as Xerneas and Mega Rayquaza appreciate Darkrai's ability to put extreme pressure on defensive cores. Stealth Rock setters such as Primal Groudon help to wear down Ho-Oh and chip away at teams forced to switch around Darkrai. Mega Gengar is useful to trap sleeping Pokemon and remove certain checks such as Ho-Oh with Destiny Bond. It also checks Arceus and can remove Toxic Spikes. Other entry hazard removers for getting rid of Toxic Spikes are appreciated, and clerics such as Clefable can keep Darkrai free of status.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 277877, "username": "HunterStorm"}, {"user_id": 262044, "username": "Chloe"}]}, {"name": "Grammar checked by", "members": [{"user_id": 193885, "username": "Haund"}, {"user_id": 232216, "username": "The Dutch Plumberjack"}]}], "writtenBy": [{"user_id": 202117, "username": "MZ"}]}
  },
  "Ferrothorn": {
    "overview": "<p>Between decent bulk and stellar defensive typing, Ferrothorn is an excellent wall and the backbone of many balance or stall teams in AG. It has great utility options, though its minimal offensive presence hurts it. Ferrothorn is very good at forcing switches, but it is prone to being worn down due to its lack of recovery.</p> ",
    "comments": "<h1>Other Options</h1> <p>Power Whip allows Ferrothorn to hit Arceus-Water and Kyogre, but Gyro Ball is generally better coverage-wise. Thunder Wave is an option in order to cripple foes, but it is often hard to justify the moveslot. It also synergizes poorly with Gyro Ball, so if Ferrothorn carries Thunder Wave, it should carry Iron Head or Power Whip as its attacking move. Rocky Helmet is an option in order to deal more passive damage to physical attackers, though it is hard to justify its use instead of passive recovery. Toxic can be used to whittle down a foe's health even faster but is often not too useful, as Ferrothorn has to use its turns to preserve its HP in the form of Leech Seed. Rest can be run to deal with Ferrothorn's lack of recovery, although Ferrothorn is almost fodder while asleep and may have problems surviving the sleep turns. However, Leech Seed aids its resiliency tremendously. Substitute is an option to take advantage of Leech Seed recovery along with Protect, although it is hard to spare a moveslot for and requires extensive scouting of your opponent's sets. Running a physically defensive set allows Ferrothorn to take on a prevalent threat in Arceus, as well as allowing it to survive a +1 Dragon Ascent from Mega Rayquaza.</p> <h1>Checks and Counters</h1> <p><strong>Chip Damage: Ferrothorn is very prone to being worn down, preventing it from checking foes it is supposed to check. It is difficult to keep healthy; both chip damage from burns and attacks wear Ferrothorn down quickly.</p> <p><strong>Fire-types</strong>: Almost all Fire-type moves will OHKO Ferrothorn. They can be seen on random Pokemon occasionally, such as Mega Rayquaza carrying V-create and Arceus carrying Overheat, but Ferrothorn can scout them with Protect.</p> <p><strong>Special Arceus</strong>: Special Arceus formes such as Arceus-Ground and Arceus-Ghost are very threatening to Ferrothorn because they can easily 2HKO it with their STAB Judgment after a Calm Mind or after minimal prior damage.</p> <p><strong>Mega Rayquaza: Rayquaza can easily OHKO Ferrothorn with V-create, and even if it doesn't carry it, a +1 Dragon Ascent OHKOes Ferrothorn thanks to Rayquaza's incredible power.</p> <p><strong>Mega Mewtwo X: As the only relevant Fighting-type in AG, Mega Mewtwo X has no issue OHKOing Ferrothorn with its STAB Low Kick or Drain Punch.</p> <p><strong>Ho-Oh</strong>: Ho-Oh in particular is a huge problem for Ferrothorn, as it shrugs off any attack it has, easily OHKOes it with Sacred Fire, and even carries Substitute and Lum Berry sometimes to ignore Thunder Wave. Ferrothorn definitely needs a teammate to deal with Ho-Oh to function well.</p> <p><strong>Mega Sableye</strong>: Mega Sableye bounces back Ferrothorn's utility moves, making it reluctant to use them all game just due to Sableye's presence, and takes minimal damage from all of Ferrothorn's attacks. It can also punish Ferrothorn with a burn.</p> ",
    "sets": [
      {
        "name": "Specially Defensive",
        "description": "<h1>Moves</h1> <p>Leech Seed gives Ferrothorn much more recovery than Leftovers alone would and punishes nearly any switch-in due to the lack of Grass-type Pokemon and Magic Guard Pokemon in Anything Goes. Protect gives Ferrothorn free recovery and allows it to scout for moves such as V-create on Mega Rayquaza. Gyro Ball gives Ferrothorn a decent offensive presence, preventing it from being setup bait for sweepers such as Xerneas and Mega Rayquaza. Stealth Rock is used to capitalize on all of the free turns Ferrothorn gets, allowing it to deal more passive damage on all of the switches it forces. Spikes is an option over Stealth Rock if your team already has a Stealth Rock setter.</p> <h1>Set Details</h1> <p>Leftovers gives Ferrothorn passive recovery. Iron Barbs allows Ferrothorn to punish physical attackers that make contact. The EVs and a Sassy nature give Ferrothorn the most special bulk possible, and the nature, alongside the minimized IVs, also makes Ferrothorn as slow as possible to maximize Gyro Ball damage.</p> <h1>Usage Tips</h1> <p>Try to use Leech Seed as much as possible, as it wears down foes very quickly while keeping Ferrothorn healthy. Ferrothorn should come in on physical attackers for the most part, though it can also come in on Kyogre and Xerneas. Use Protect a lot as well, both to scout for moves such as Arceus's Overheat and Rayquaza's V-create and to PP stall. However, Protect can become predictable and your opponent can take advantage of you spamming it, so mixing it up is good sometimes. Keep Ferrothorn away from Fire-types, as they easily KO it.</p> <h1>Team Options</h1> <p>Rocky Helmet Yveltal and Giratina are great options, as they can switch into Mega Rayquaza and most variants of Primal Groudon, which is very helpful for Ferrothorn. Ferrothorn's biggest downfall is its lack of reliable recovery, so pairing it with a Wish passer such as Blissey or Chansey allows them to heal it up, and in turn it can sponge physical attacks for them. A cleric such as Xerneas or Blissey pairs extremely well with Ferrothorn because a burn cripples Ferrothorn permanently. Primal Groudon is another great partner, as it absorbs Will-O-Wisp, which would otherwise cripple Ferrothorn, while also being a decent switch-in to Fire-type moves, and in return Ferrothorn provides amazing support by absorbing hits from Kyogre, allowing Primal Groudon to switch back in next turn to reset Desolate Land. Ho-Oh checks such as Arceus-Rock are essential for Ferrothorn to perform well. Ferrothorn appreciates checks for special Arceus formes, such as Ho-Oh, which synergizes very well with Ferrothorn because it can sponge physical hits for it in return. Physically defensive Arceus-Water has excellent synergy with Ferrothorn, as it deals with Ho-Oh, handles all variants of Primal Groudon except for Double Dance, and can absorb V-create and Overheat with ease.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 202117, "username": "MZ"}, {"user_id": 262044, "username": "Chloe"}, {"user_id": 277877, "username": "HunterStorm"}]}, {"name": "Grammar checked by", "members": [{"user_id": 168392, "username": "P Squared"}, {"user_id": 232216, "username": "The Dutch Plumberjack"}]}], "writtenBy": [{"user_id": 276133, "username": "Josh"}]}
  },
  "Kyurem-White": {
    "overview": "<p>Kyurem-W fits well on offensive teams, as it can fulfill multiple roles and provide excellent support for a number of sweepers. Its high base Special Attack means it hits hard even in a metagame like Anything Goes, allowing it to break walls like Lugia, Yveltal, Giratina, and Arceus-Ground. With a Choice Scarf equipped, it outspeeds much of the metagame, allowing it to revenge kill many threatening Pokemon such as Mega Rayquaza. It can also act as a sleep absorber, which is incredibly useful due to the metagame's lack of Sleep Clause.</p> <p>However, it relies on support from its teammates to do some jobs, as Stealth Rock damage prevents it from checking key Pokemon. Its defensive typing is also a weak point, only really helping it against Kyogre and making it weak to a number of relatively common types such as Steel. Its reliance on a Choice item means it can be played around relatively easily, meaning good switches by the opponent will force it out and cost momentum. It also faces competition from a number of Pokemon; for example, Ho-Oh threatens many of the Pokemon that wall Extreme Killer Arceus and Geomancy Xerneas, while Xerneas and Kyogre are strong special Choice Scarf users that can revenge kill and wallbreak well. It should also be noted that, due to in-game mechanics rather than any Species Clause, the use of more than one Kyurem-W or Kyurem-B is prohibited. However, although it isn't a great Pokemon in the Anything Goes metagame, Kyurem-W is overall a useful Pokemon capable of overcoming certain weaknesses that its competition faces, and therefore it can be worth using if it would fit well on your team.</p> ",
    "comments": "<h1>Other Options</h1> <p>A Choice Specs set provides far more power, but it gets surprisingly few OHKOs compared to the Choice Scarf set and is very easy to take out before it can do anything useful due to its low Speed. Similarly, while a Life Orb set's ability to switch moves might sound handy, the lack of Speed and extra chip damage from recoil mean it is rarely better than the Choice Scarf set. An Expert Belt set bluffing Choice Scarf might pick up the occasional extra KO; however, the risk of your opponent not falling for it and the low reward if successful generally mean this isn't worthwhile.</p> <p>Focus Blast can replace Fusion Flare or Sleep Talk, as it has a reasonable amount of power behind it; however, it doesn't hit hard enough to make up for its worse coverage or frustrating 70% accuracy. Flash Cannon is an option for hitting Fairies such as Mega Diancie that can come in on Draco Meteor; however, Kyurem-W's other moves such as Ice Beam and Earth Power generally 2HKO these threats anyway. Stone Edge can be run to hit Ho-Oh, but it should be noted that the Attack investment required for an OHKO isn't worth it and the moveslot is generally better spent on other moves. Roost can be run to regain health as the foe is forced out; however, the damage Draco Meteor and Ice Beam put out alongside the momentum cost and moveslot generally mean this isn't viable. Dragon Pulse can be used over Draco Meteor to avoid the Special Attack drop, but the loss of power and the fact that Kyurem-W often wants to switch out anyway mean that this is very rarely useful.</p> <h1>Checks and Counters</h1> <p><strong>Stealth Rock: Kyurem-W relies on being at full health to successfully check a number of Pokemon, and one round of Stealth Rock damage allows +2 Mega Rayquaza's Extreme Speed and Fairy and Arceus-Steel's Judgment to OHKO it rather than 2HKO while also allowing Darkrai's Dark Pulse to 2HKO rather than 3HKO. Kyurem-W therefore needs Stealth Rock to be removed in order for it to do its job well.</p> <p><strong>Xerneas and Arceus-Fairy: While the standard Geomancy Xerneas set can be 2HKOed by Ice Beam, many Xerneas sets will easily counter Kyurem-W. Arceus-Fairy also does this job well, although it should be wary of chip damage, as Ice Beam has a small chance to 2HKO after Stealth Rock.</p> <p><strong>Certain Arceus Formes</strong>: While it can defeat some Arceus formes, those that Kyurem-W can't hit super effectively, such as Arceus-Water and Arceus-Ghost, can come in on it and wall it or set up. However, hitting them with a Draco Meteor on the switch in and then switching to force them out can successfully wear them down somewhat.</p> <p><strong>Ho-Oh: If Stealth Rock isn't up, Ho-Oh easily defeats Kyurem-W while Regenerator prevents it from being worn down easily. However, with Stealth Rock up, Ho-Oh is easily defeated.</p> <p><strong>Other Fairy-types</strong>: The presence of a Fairy on the opposing team will discourage the use of Draco Meteor and Focus Blast while also making it easier to play around a Choice-locked Kyurem-W. However, don't expect just any Fairy to counter Kyurem-W, as Pokemon such as Mega Diancie and Clefable lose to Ice Beam and Klefki can't take a Fusion Flare or Earth Power well at all.</p> <p><strong>Chansey and Blissey: Although rare, Chansey and Blissey can hard wall Kyurem-W. Many physical attackers such as Extreme Killer Arceus pair well with Kyurem-W and set up on both, although often they dislike the Toxic poison or paralysis that they will generally be inflicted with in return.</p> <p><strong>Kyogre</strong>: Kyogre boasts enough special bulk to check Kyurem-W; however, it often can't do much in return other than hope for a Scald burn, unless it happens to run Calm Mind, and Draco Meteor will still deal a large chunk of damage before Kyurem-W switches out.</p> ",
    "sets": [
      {
        "name": "Choice Scarf",
        "description": "<h1>Moves</h1> <p>Ice Beam is Kyurem-W's go-to attack, as it has 100% accuracy and doesn't lower its Special Attack. It also picks up a large number of important OHKOs and 2HKOs such as the OHKO on standard Mega Rayquaza and the 2HKO on Lugia. Draco Meteor is Kyurem-W's most powerful attack, capable of dealing heavy damage to many Pokemon, hitting threats like Ho-Oh hard. Fusion Flare is the best coverage move available, as it allows Kyurem-W to take out Skarmory, Ferrothorn, Aegislash, and Klefki and beat most Arceus-Steel one-on-one. Sleep Talk allows Kyurem-W to hard check Darkrai and other sleep-inducing Pokemon.</p> <p>Earth Power can be used over Fusion Flare because it hits threats like Primal Groudon harder; however, it isn't as effective at taking out all of the above threats and therefore should only be used if your team already has solid answers to these Pokemon. It can also be run over Sleep Talk if your team already has a Darkrai check. It should be noted that Earth Power is especially good if Kyurem-W is being used to support a Geomancy Xerneas, as it hits Primal Groudon, Arceus-Steel, and Arceus-Poison hard, all of which can cause trouble for Xerneas.</p> <h1>Set Details</h1> <p>252 Special Attack EVs with a Modest nature are required for Kyurem-W to hit hard and pick up certain KOs. Choice Scarf allows it to function effectively as a revenge killer, and 216 Speed EVs allow it to outspeed Modest Choice Scarf Kyogre. 40 HP EVs add to its bulk, although some of these may be moved to Speed to creep Choice Scarf Xerneas, which often also runs just enough investment to outspeed Choice Scarf Kyogre.</p> <h1>Usage Tips</h1> <p>Kyurem-W needs to be at a good level of HP in order to check Pokemon such as Mega Rayquaza, so be wary of bringing it in if not needed, and try to keep Stealth Rock off your side of the field. Be wary of using the wrong move, as Pokemon such as Xerneas and Arceus-Steel will happily use this as an opportunity to set up. At the same time, don't be too cautious—Draco Meteor will take a chunk out of any Pokemon that doesn't resist it, while an unexpected Fusion Flare can easily make way for another Pokemon to sweep later in the game. Finally, don't be afraid to sacrifice Kyurem-W. The large number of priority moves in the tier means it will rarely serve as a cleaner, but letting it faint while opening a hole in the opposing team's defenses is almost always worthwhile.</p> <h1>Team Options</h1> <p>Extreme Killer Arceus and Mega Rayquaza appreciate Kyurem-W's ability to defeat or force out a large number of their checks such as Steel-types, Yveltal, Lugia, Giratina, and Quagsire and deal heavy damage to Pokemon such as Primal Groudon. Geomancy Xerneas similarly appreciates Kyurem-W's ability to take out Steel-types and Amoonguss and hit Pokemon such as Ho-Oh and Primal Groudon hard. Physical attackers such as Arceus-Steel with Iron Head and Stone Edge pair well with Kyurem-W, as they take on many of its counters such as Ho-Oh, Chansey, and Xerneas.</p> <p>Kyurem-W dislikes Stealth Rock, which prevents it from checking Pokemon such as Mega Rayquaza effectively, so teammates capable of preventing or removing entry hazards are appreciated. Pokemon such as Mega Diancie, Mega Sableye, and support Arceus formes help with this. Kyurem-W also appreciates Stealth Rock being set on the opposing side, as this prevents Pokemon such as Ho-Oh and support Arceus formes from effectively checking it. Those same Arceus formes, as well as Pokemon such as Mega Diancie and Primal Groudon, can be useful in this respect. Finally, Kyurem-W is somewhat frail due to its average defensive stats and weak typing, so offensive pressure and slow VoltTurn Pokemon that allow it to come in safely are appreciated.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 202117, "username": "MZ"}, {"user_id": 262044, "username": "Chloe"}, {"user_id": 276133, "username": "Josh"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "The Dutch Plumberjack"}, {"user_id": 168392, "username": "P Squared"}]}], "writtenBy": [{"user_id": 193182, "username": "DoW"}]}
  },
  "Klefki": {
    "overview": "<p>Klefki is one of the most metagame-defining Pokemon in Anything Goes. Prankster, coupled with a huge support movepool and an amazing defensive typing, allows Klefki to check threats like Xerneas, Darkrai, and Mewtwo. Because of Prankster, Klefki is easily able to get around powerful attackers such as Primal Groudon and Mega Rayquaza because of how effectively it utilizes moves like Double Team, Swagger, and Thunder Wave that make Klefki a very annoying Pokemon to take down when used together. Even though Klefki has answers to Magic Bounce users such as Mega Diancie and Mega Sableye in Flash Cannon and Dazzling Gleam, respectively, it suffers from four-moveslot syndrome because it has to sacrifice important moveslots to beat them. Because Klefki cannot run everything it wants to, it struggles to handle common switch-ins such as Arceus-Ground and Primal Groudon. Klefki also has no offensive presence in the Anything Goes metagame because its offensive stats are extremely low, leaving it vulnerable to Taunt. Nonetheless, Klefki is still considered one of the best and most dominant Pokemon in Anything Goes and must be taken into account when building any serious team.</p> ",
    "comments": "<h1>Other Options</h1> <p>Fairy Lock can be used to trap certain threatening Pokemon such as Primal Groudon; however, Klefki needs to sacrifice itself for Fairy Lock to work to its full effect. Magic Coat can help against opposing Klefki, Taunt users, Stealth Rock setters, and opposing Spikes setters. Switcheroo with a Choice item can cripple non-Mega Pokemon and Pokemon that aren't Arceus formes, but it is very situational, and Klefki can find itself in matchups where it cannot remove its item. Mental Herb allows Klefki to avoid Taunt once and thus provides it with an opportunity to use Swagger or Spikes. Dazzling Gleam with 88 Special Attack EVs allows Klefki to 2HKO 248 HP / 8 SpD Mega Sableye. Play Rough can be used to deal more damage to Calm Mind sweepers and Xerneas. Flash Cannon is capable of OHKOing Mega Diancie, which walls Klefki easily, while Sleep Talk can be used to make Klefki a more effective Darkrai check. Finally, Safeguard can be used to avoid status conditions from the likes of Darkrai and Mega Sableye. Safeguard also heavily benefits teammates that are easily outsped and shut down by Darkrai and helps sweepers set up more easily.</p> <h1>Checks and Counters</h1> <p><strong>Magic Bounce and Magic Coat: If Klefki lacks Dazzling Gleam or Flash Cannon, Mega Sableye and Mega Diancie, respectively, are huge threats for their ability to bounce back entry hazards and status moves. Pokemon with access to Magic Coat such as Arceus formes can run the move in order to better handle Klefki as well.</p> <p><strong>Fire-type Coverage Moves</strong>: Because Klefki has no way to avoid damage from Fire-type moves, Pokemon like Ho-Oh, V-create Mega Rayquaza, and Lava Plume Primal Groudon heavily pressure it.</p> <p><strong>Ground-types: If Klefki lacks Magnet Rise, Ground-types such as Primal Groudon, Arceus-Ground, and Landorus-T are big threats because they are capable of OHKOing Klefki and are immune to Thunder Wave.</p> <p><strong>Special Attackers: Primal Kyogre doesn't care about Swagger as much as physical attackers do, can run a RestTalk set effectively for decent recovery, is capable of phazing evasion-boosting Klefki sets, and can deal heavy damage to Klefki with its Water-type STAB move. RestTalk or Aromatherapy Xerneas can also pick off Klefki and are capable of healing off paralysis from Thunder Wave.</p> ",
    "sets": [
      {
        "name": "SwagPlay",
        "description": "<h1>Moves</h1> <p>Swagger turns Klefki into an extremely annoying Pokemon, having a 50% chance to create a free turn while also increasing the damage the foe takes from Foul Play. Substitute allows Klefki to capitalize on the free turns created by Swagger and makes Klefki harder to take down, as it also allows Klefki to avoid status moves such as Thunder Wave and Dark Void. Foul Play deals more damage after the foe has had their Attack boosted by Swagger, but this is noticeably less effective on special attackers such as Primal Kyogre. Thunder Wave creates even more opportunities for a free turn and slows down faster Pokemon such as Mewtwo and +2 Xerneas. Double Team adds onto this further, giving Klefki a chance to avoid threatening moves such as Precipice Blades, Earthquake, and Fire Blast and thus making it even harder to deal with. Magnet Rise can be used to set up against Arceus-Ground and Primal Groudon lacking Fire-type moves. Flash Cannon can also be used to hit Mega Diancie, which can otherwise wall Klefki with ease.</p> <h1>Set Details</h1> <p>Maximum Special Defense investment allows Klefki to consistently switch into special attackers such as Xerneas, Arceus-Fairy, Darkrai, and special attacking Arceus-Ghost. Leftovers provides Klefki with passive recovery and prevents it from being worn down easily. Prankster makes Klefki very threatening, granting priority to Swagger and Thunder Wave. Klefki can also run a physically defensive set, but it checks less important threats at the cost of a better matchup against the likes of Arceus.</p> <h1>Usage Tips</h1> <p>Use Swagger as much as possible and create as many opportunities for free turns that can be used to set up Substitutes and spread paralysis with Thunder Wave. Once Klefki is behind a Substitute, it is usually safe to use Foul Play to weaken the opposing Pokemon after its Attack has been boosted by Swagger. Flash Cannon should be used to OHKO Mega Diancie before spamming Swagger, as Magic Bounce can shut down Klefki. Paralysis should be spread as much as possible with Thunder Wave, but be wary of opposing Ground-type switch-ins.</p> <h1>Team Options</h1> <p>Setup sweepers such as Xerneas, Arceus, Primal Groudon, and Mega Rayquaza all appreciate Klefki's ability to weaken the opposing team and create opportunities to sweep late-game. Other Pokemon like Substitute Darkrai also appreciate the potential free turns created by Swagger and Thunder Wave. Strong wallbreakers that lack Speed such as Primal Kyogre can take advantage of paralysis slowing down the opposing team. Fairy-types such as Xerneas, Mega Diancie, and Arceus-Fairy can threaten Mega Sableye, which completely walls Klefki, while Steel-types such as Arceus-Steel and Aegislash can threaten Mega Diancie if Klefki lacks Flash Cannon. Primal Kyogre, Arceus-Ground, and Lugia can help in walling Primal Groudon, which walls Klefki completely unless it gets unlucky. Klefki can also be paired with other Klefki in order to wear down their checks and counters with ease. Choice Scarf Ditto also appreciates Klefki boosting the foe's Attack so that it can switch in and potentially sweep with a boosted copy of the opponent's Pokemon.</p> "
      },
      {
        "name": "Spikes",
        "description": "<h1>Moves</h1> <p>Spikes quickly wears down the opposing team and helps Klefki's teammates net OHKOs and 2HKOs more easily. Magnet Rise allows Klefki to avoid Ground-type attacks from the likes of Arceus and Mega Rayquaza. Thunder Wave cripples Pokemon capable of using Defog such as Arceus formes, Latias, and Latios. Swagger is capable of creating free turns and has great synergy with Spikes, as it can force switches, and the free turns that Swagger creates allow for more opportunities to set up Spikes. Foul Play takes advantage of Swagger boosting the foe's Attack.</p> <h1>Set Details</h1> <p>Maximum HP and Special Defense investment allows Klefki to switch into the likes of Xerneas, Darkrai, Latias, and Latios easily. Prankster provides +1 priority to Spikes and Magnet Rise, allowing Klefki to avoid Ground-type moves from the likes of Arceus-Ground, Mega Rayquaza, and Primal Groudon. Leftovers gives Klefki passive recovery that lets it stay on the field for longer and allows it to check threats such as Xerneas more reliably.</p> <h1>Usage Tips</h1> <p>Spikes should be used when Klefki has free opportunities to set it up; however, watch out for Magic Bounce users such as Mega Sableye and Mega Diancie because they can switch into the move and use it against Klefki. Use Thunder Wave to cripple setup sweepers and opposing users of Defog and the less common Rapid Spin. Magnet Rise should be used against Pokemon that have access to Ground-type moves that can easily OHKO or 2HKO Klefki, but be wary of Pokemon like Mega Rayquaza and Primal Groudon that often run Fire-type coverage moves. Swagger should be used on predicted Ground-type switch-ins in order to create more opportunities to use Spikes. Foul Play should be used after Swagger in order to maximize Klefki's damage output.</p> <h1>Team Options</h1> <p>Primal Groudon is capable of forming an entry hazard-stacking core with Klefki, utilizing Stealth Rock and Roar in order to deal more chip damage to the opponent's Pokemon. Sweepers such as Mega Rayquaza, Darkrai, Rock Polish Primal Groudon, and Xerneas appreciate Spikes support in order to net OHKOs and 2HKOs more easily. Darkrai threatens common Defoggers such as certain Arceus formes, Giratina-O, Latios, and Latias. Pokemon like Arceus-Ground, Primal Kyogre, Landorus, Yveltal, and Latios are good teammates for their ability to check and weaken Primal Groudon, giving Klefki more freedom to spread paralysis. Ho-Oh checks such as Arceus-Rock, Primal Groudon, Arceus-Water, and Primal Kyogre are also good options, as Ho-Oh is also a very annoying Pokemon for Klefki to face. Arceus-Ground and Primal Kyogre are good teammates too for their ability to check Mega Diancie while Steel-types are capable of checking Mega Diancie and Fairy-types can handle Mega Sableye.</p> "
      },
      {
        "name": "Dual Screens",
        "description": "<h1>Moves</h1> <p>Klefki's ability to set up Light Screen and Reflect with +1 priority makes it a very effective dual screens setter, providing easier setup opportunities for Klefki's teammates and allowing them to take very powerful hits more easily. Swagger wears down powerful Pokemon such as Primal Groudon, and Foul Play is a great follow-up option to deal more damage. Thunder Wave can also be used to provide even more support for the team by crippling offensive threats.</p> <h1>Set Details</h1> <p>Prankster ensures that Klefki can set up dual screens easily, only being outprioritized by Extreme Speed, which Klefki resists. Maximum HP investment along with maximum Special Defense investment allows Klefki to switch into and set up against the likes of Xerneas and Darkrai. Light Clay allows Klefki's screens to stay up for longer.</p> <h1>Usage Tips</h1> <p>Klefki should switch into Pokemon like Latios, Darkrai, Xerneas, and Arceus-Fairy and set up the appropriate screen to survive a hit from them with ease. Setting up Light Screen and Reflect as soon as possible provides early setup opportunities for Klefki's teammates. This set also functions as an anti-lead, potentially stopping the opposing lead with Swagger. Ensure that opposing Ditto are removed before bringing in your setup sweepers.</p> <h1>Team Options</h1> <p>Setup sweepers such as Arceus, Arceus-Ground, Mega Rayquaza, Arceus-Fairy, Xerneas, Darkrai, and Primal Groudon appreciate the extra bulk provided by Klefki's screens that makes it a lot easier for them to set up. Pokemon like Primal Groudon can also switch into threats such as Mega Rayquaza and Xerneas more effectively.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 202117, "username": "MZ"}, {"user_id": 276133, "username": "Josh"}, {"user_id": 262044, "username": "Chloe"}]}, {"name": "Grammar checked by", "members": [{"user_id": 216033, "username": "Winry"}, {"user_id": 175616, "username": "Empress"}]}], "writtenBy": []}
  },
  "Xerneas": {
    "overview": "<p>Xerneas's extremely well-rounded stats and great Special Attack allow it to become a powerful attacker, and it is able to further boost its offensive prowess with Fairy Aura and Geomancy. These qualities let Xerneas serve numerous roles both offensively and defensively, making it difficult to switch into. It has many coverage options like Focus Blast and Psyshock to deal with some of its checks. Despite having more options for offensive sets, Xerneas can also utilize its high HP stat paired with its nice defensive typing for more defensive sets or act as a cleric with moves like Aromatherapy and Roar. However, Xerneas lacks reliable recovery and relies on Rest to regain health, which leaves it vulnerable. Xerneas also struggles against Steel- and Fire-types and has very few options to deal with them outside of Focus Blast. Multiple priority users can also overwhelm Xerneas and revenge kill it.</p> ",
    "comments": "<h1>Other Options</h1> <p>Psyshock is able to 2HKO Arceus-Poison and hit it on the switch in and provides and decent coverage against specially defensive Pokemon. Ingrain on Geomancy sets prevents phazers from forcing Xerneas out after it has already used Geomancy, allowing Xerneas to utilize the boosts for significantly longer. Block enables Xerneas to trap support Arceus sets and use them to set up Geomancy or potentially recover HP and rid itself of status with Rest. Substitute can also be run on Geomancy sets, which helps Xerneas avoid status and capitalize on set up fodder. Sleep Talk on Geomancy Xerneas can be helpful when switching into Darkrai and Smeargle leads, allowing it to potentially set up or knock out the foe. Choice Specs on Xerneas allows it to hit extremely hard without using a setup turn, making it very hard to switch into. Grass Knot can be run on all-out attacker sets, exchanging Aromatherapy or Roar for a move that 2HKOes Primal Groudon.</p> <h1>Checks and Counters</h1> <p><strong>Steel-types: Mega Scizor is able to switch in on Xerneas and revenge kill it with Bullet Punch, and it gives Geomancy Xerneas sets trouble. Bronzong easily switches into any attack Xerneas has and is able to 2HKO it with Gyro Ball. Arceus-Steel, Genesect, and Jirachi are able to switch into Moonblast as well as revenge kill Choice Scarf and all-out attacker sets effectively.</p> <p><strong>Ho-Oh and Primal Groudon: Primal Groudon and Ho-Oh are the most effective offensive Xerneas counters in the tier and can knock out Xerneas with little prior damage. Ho-Oh's typing allows it to resist Xerneas's STAB and main coverage options and can heal off damage with Recover and Regenerator or KO Xerneas. Primal Groudon is able to both switch into and knock out Xerneas or phaze it with Roar after it has used Geomancy.</p> <p><strong>Priority Users</strong>: Priority users need slightly more prior damage in order to ensure KOs. Extreme Killer Arceus and Mega Rayquaza are able to inflict the most damage with Extreme Speed and revenge kill Xerneas once it has been worn down. Xerneas can still survive if it is untouched beforehand; however, it can easily be overwhelmed by multiple priority users on a single team.</p> <p><strong>Lugia: Lugia is a very solid Xerneas check, as it is able to come in after something has been knocked out, take Moonblast easily with Multiscale even after Geomancy while phazing Xerneas with Whirlwind, and wear Xerneas down with Toxic and stall it out.</p> <p><strong>Arceus-Poison</strong>: Arceus-Poison resists both Moonblast and Focus Blast and can easily knock out Xerneas with Poison Jab as well as being able to pivot into all of Xerneas's sets. If Arceus-Poison uses the chance to set up against Xerneas, it has to be extremely wary of coverage moves like Hidden Power Ground and Psyshock, as they can deal massive damage to it.</p> ",
    "sets": [
      {
        "name": "Geomancy",
        "description": "<h1>Moves</h1> <p>Geomancy raises Xerneas's Special Attack, Special Defense, and Speed by two stages, allowing it to easily sweep a weakened team. Moonblast is the most powerful STAB option that Xerneas has access to, and when coupled with Fairy Aura and a Geomancy boost, it becomes a devastating attack. Focus Blast is Xerneas's main coverage move, as it is able to hit Steel-types such as Arceus-Steel, Jirachi, and Klefki as well as hitting Primal Groudon for more damage. Hidden Power Ground can be used over Focus Blast, as it is more accurate, but it is significantly weaker. Thunder is able to hit Ho-Oh and Lugia hard and can capitalize on Primal Kyogre switching in. Aromatherapy allows Xerneas to relieve its team from status effects and gives Xerneas an easier time with Klefki and support Arceus formes, which can cripple Xerneas with Thunder Wave and Swagger or wear it down with Toxic, respectively.</p> <h1>Set Details</h1> <p>Maximum Special Attack investment and a Modest nature ensure that Xerneas deals as much damage as possible. The 52 Speed EVs are used to outspeed Choice Scarf Genesect and Choice Scarf Jirachi after a Geomancy. 28 EVs are invested in Defense to avoid giving Genesect +1 Attack from Download, and the rest are put in HP to help Xerneas avoid 2HKOs from Extreme Killer Arceus's Extreme Speed and Choice Band Ho-Oh's Earthquake.</p> <h1>Usage Tips</h1> <p>Xerneas has only a single chance to set up due to its reliance on Power Herb, so picking the right time is essential. Normally, setting up when checks like Primal Groudon, Ho-Oh, Klefki, and Clefable are severely weakened or knocked out is optimal. Multiple priority users also pose a problem for Xerneas, as they can overwhelm it with priority and KO after it has set up. Be wary of how much health Xerneas has and the number of priority users on the other team before using Geomancy. Try to set up on Pokemon like Yveltal, Mega Sableye, and Mega Diancie, as Xerneas can force them out as well as set up on them.</p> <h1>Team Options</h1> <p>Primal Groudon is a great teammate because it is able to switch into Steel-types and deal with most of Xerneas's counters like Arceus-Poison and Ho-Oh. Additionally, Primal Groudon, as well as support Arceus formes, can set up Stealth Rock for Xerneas so it can sweep more effectively. Primal Groudon also baits in Yveltal and Giratina-O, which Xerneas can set up on. Arceus-Ghost and Skarmory are able to switch into Mega Rayquaza and Extreme Killer Arceus with ease and are able to cripple them with Will-O-Wisp or phaze them, respectively, allowing Xerneas to KO crippled target or capitalize on a forced switch. Skarmory can also lay down Spikes to restrict switching and force the opponent to use Defog, giving an opportunity for Xerneas to set up.</p> "
      },
      {
        "name": "Choice Scarf",
        "description": "<h1>Moves</h1> <p>Moonblast is Xerneas's main STAB move because it deals the most damage due to Fairy Aura. Sleep Talk allows Xerneas to switch into Darkrai and lead off against Smeargle, and it is able to ensure the OHKO against both of them extremely reliably because Moonblast is the only move it is able to select. Alternatively, Focus Blast is able to threaten many Pokemon that resist Moonblast like Primal Groudon, Steel Arceus, and Ferrothorn; however, it is not commonly run because it makes Xerneas significantly less reliable against Darkrai, as it can miss when using Sleep Talk or select a move that would be significantly less powerful than Moonblast in the given circumstance.</p> <h1>Set Details</h1> <p>Full Special Attack investment along with a Modest nature allows Xerneas to hit as hard as possible. 184 Speed EVs allow Xerneas to outspeed Darkrai, Zekrom, and Modest Choice Scarf Kyogre. 72 Defense EVs are invested so that Xerneas will not give Genesect +1 Attack from Download while also giving it more physical bulk.</p> <h1>Usage Tips</h1> <p>Be wary of having Xerneas locked into Sleep Talk, as it can be used as setup fodder when it wakes up. Xerneas can directly switch into Darkrai and Smeargle, since it's running Sleep Talk, and KO them the following turn. This set works best as a late-game cleaner, able to blow through the enemy team once all of its counters are knocked out or weakened. However, it is able to revenge kill opposing Pokemon quite well too due to its high damage output from Moonblast combined with its above average Speed enhanced by Choice Scarf. Despite this set being relatively frail, it can switch into some Pokemon like Yveltal and hit something on the switch with Moonblast. Primal Groudon specifically should be severely weakened or knocked out, as it is able to wall Xerneas quite easily.</p> <h1>Team Options</h1> <p>Skarmory is able to switch directly into a +2 Extreme Killer Arceus without fearing Earthquake and can phaze it with Whirlwind. Entry hazard setters are crucial, as they break Lugia's Multiscale and damage Ho-Oh significantly. Primal Groudon and Arceus-Ground are able to capitalize on Steel-types switching in if Xerneas is locked into Moonblast. Xerneas benefits from Primal Groudon checks, as they can KO Primal Groudon or get it to low enough health that it cannot freely switch into Moonblast.</p> "
      },
      {
        "name": "All-out Attacker",
        "description": "<h1>Moves</h1> <p>Moonblast is Xerneas's most powerful move boosted by both Fairy Aura and Life Orb. Close Combat is able to deal significant damage to Steel-types, Arceus, Blissey, and Chansey, but it can also be used to weaken Primal Groudon. Rock Slide is able to OHKO Ho-Oh, but it has very little use against anything else. Aromatherapy is able to get rid of status effects from Klefki and bulkier Arceus sets and may be used on predicted switches to stop passive damage infliction as well as relieving Xerneas's team from status. Sleep Talk serves as a check to Darkrai, as both Close Combat and Moonblast are able to OHKO it and Rock Slide is able to break a potential Substitute.</p> <h1>Set Details</h1> <p>184 Speed EVs allow Xerneas to outspeed Primal Kyogre, defensive Ho-Oh sets, and most Primal Groudon sets. The 84 Attack EVs are used for ensuring the OHKO with Rock Slide on maximum HP Ho-Oh as well as letting Close Combat hit harder. The remaining EVs are dumped into Special Attack to amplify the power of Moonblast. Life Orb allows Xerneas to hit harder without wasting a turn to set up or getting locked into a move.</p> <h1>Usage Tips</h1> <p>Xerneas can bluff Geomancy to lure in Ho-Oh and Blissey when they switch in; unfortunately, it can only bluff for the first turn, as its attacks will reveal Life Orb to the opponent. Thanks to Fairy Aura, Xerneas is able to do massive damage early-game without setting up. Due to the lack of HP investment and Life Orb damage constantly wearing it down, Xerneas will not be able to switch into many hits, so try to use it to revenge kill or force a switch.</p> <h1>Team Options</h1> <p>Fire- and Ground-types like Ho-Oh and Primal Groudon are able to check common Steel-types such as Steel Arceus that can pivot into Xerneas. Ghost-types such as Arceus-Ghost and the Giratina formes can switch into Extreme Speed from Extreme Killer Arceus and can cripple it with Will-O-Wisp. Calm Mind Arceus sets and Kyogre help take out Xerneas checks and Primal Groudon, while Xerneas is able to get rid of Pokemon like Chansey and bulkier Arceus sets that can wall Calm Mind Arceus sets and Kyogre.</p> "
      },
      {
        "name": "Defensive",
        "description": "<h1>Moves</h1> <p>Moonblast is Xerneas's only attacking move on this set and keeps it from becoming Taunt bait as well as providing a means of attacking boosted by Fairy Aura. Rest allows Xerneas to recover lost health as well as shrug off status. Sleep Talk is used to not be completely ineffective while sleeping as well as checking Darkrai. Aromatherapy keeps Xerneas from getting worn down by status and can be used to cure its team of status. Alternatively, Roar is able to neuter setup sweepers and Substitute Darkrai and is also effective against Baton Pass teams.</p> <h1>Set Details</h1> <p>Maximum Defense investment along with a Bold nature makes Xerneas as physically bulky as possible. The remaining EVs are put into HP to improve its overall bulk. Leftovers gives Xerneas some passive recovery and allows it to avoid many 2HKOs like Ho-Oh's Brave Bird and Mega Rayquaza's Dragon Ascent.</p> <h1>Usage Tips</h1> <p>Although Xerneas has Sleep Talk, its unreliability can easily be taken advantage of, so using Rest sparingly is essential. Use Aromatherapy over Rest when trying to relieve Xerneas of status, and rely on Rest only for restoring Xerneas's health. Xerneas can easily wall Pokemon like Darkrai and Arceus-Dragon and force them to switch. Try to avoid Mega Gengar, as it is able to trap and OHKO Xerneas after Stealth Rock damage.</p> <h1>Team Options</h1> <p>Defensive Arceus variants and Skarmory are great partners, as they can easily switch into Extreme Killer Arceus and phaze foes when Xerneas opts for Aromatherapy over Roar. Yveltal is able to take on boosted threats such as +2 Extreme Killer Arceus and Mega Rayquaza and OHKO them with Foul Play. Ho-Oh can KO Aegislash, Arceus-Steel, Ferrothorn, and Skarmory the turn after it switches in. Primal Groudon appreciates the cleric support that Xerneas can provide and can switch into to Steel-types. Arceus-Rock can easily revenge kill Ho-Oh as well as threaten it out.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 202117, "username": "MZ"}, {"user_id": 262044, "username": "Chloe"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "The Dutch Plumberjack"}]}], "writtenBy": [{"user_id": 259986, "username": "Whis"}]}
  },
  "Diancie": {
    "overview": "<p>Mega Diancie's high Speed and access to Magic Bounce allow it to be a good lead and prevent Klefki, Darkrai, and Smeargle from spamming their status moves, giving it a firm niche in Anything Goes. Unfortunately, it can't take on the most prevalent entry hazard setters in the tier due to most of them carrying attacks that are super effective on it. Its low pre-Mega Evolution Speed means it can't outspeed most Pokemon in AG, particularly Primal Groudon, Primal Kyogre, Landorus, and Ho-Oh, forcing it to run Protect to ensure a safe Mega Evolution. While its post-Mega Evolution Speed tier is good, it still fails to outspeed notable Pokemon such as Jolly Mega Rayquaza and Jolly Arceus. However, Mega Diancie's high offensive stats and high-powered STAB attacks make it a great mixed wallbreaker that can be difficult to switch into due to its excellent offensive typing and good coverage options.</p> ",
    "comments": "<h1>Other Options</h1> <p>Calm Mind and Rock Polish are options in the fourth slot to gain power and bulk or Speed; however, these are underwhelming most of the time, as Mega Diancie is not fast enough to run Calm Mind or strong enough to run Rock Polish. Stealth Rock can be usable, as Mega Diancie has an immunity to Taunt; however, it does not have the bulk to set it multiple times per match. A Rash nature is an option for increased power, but Naive is preferred in order to outspeed maximum Speed Yveltal, base 100s, and Adamant Mega Rayquaza. A Timid nature can be used if you want Speed without lowering Mega Diancie's defenses. Hidden Power Fire can be used to hit Skarmory and Ferrothorn for super effective damage, which is helpful for teammates such as Arceus and Arceus-Ground. Heal Bell is an option, as Mega Diancie is one of the few viable Pokemon in Anything Goes with the ability to remove status. Magnet Rise can be used to avoid Ground-type moves from the likes of Primal Groudon, Arceus formes, and Mega Rayquaza and do a lot of damage in return. The 80 Attack EVs can be moved to HP for a bit more bulk if that is desired over increased power for Diamond Storm. Diancie can alternatively run a bulkier spread of 248 HP / 164 Def / 96 Spe with a Bold nature that enables more switch ins on Darkrai, allows it to take more Foul Play attacks, and in general increase its defensive capabilities to survive a lot of attacks that the offensive spread cannot, such as avoiding the 2HKO from Choice Band Ho-Oh's Brave Bird. It also outspeeds fully invested neutral-natured base 90 Speed Pokemon, such as Primal Kyogre, Primal Groudon, Dialga, and Ho-Oh.</p> <h1>Checks and Counters</h1> <p><strong>Steel-types: Steel-types such as Mega Scizor, Ferrothorn, Genesect, Aegislash, and Skarmory can tank both of Mega Diancie's STAB attacks and threaten to OHKO it with their Steel-type STAB attacks. Calm Mind Arceus-Steel can easily set up on Mega Diancie.</p> <p><strong>Ground-types: Specially defensive Primal Groudon can survive an Earth Power and OHKO Mega Diancie. Calm Mind Arceus-Ground uses Mega Diancie as setup bait.</p> <p><strong>Water-types</strong>: Bulky Water-types such as Primal Kyogre and Arceus-Water can take any attack from Mega Diancie and can OHKO it in return with their powerful Water-type STAB moves. Choice Scarf Kyogre can outspeed and OHKO Mega Diancie, and the Choice Specs set can also survive all of Mega Diancie's attacks and then OHKO it.</p> <p><strong>Faster Pokemon: Faster Pokemon such as Arceus, Deoxys-A, and Choice Scarf users such as Genesect and Xerneas can outspeed and KO Mega Diancie before getting KOed in return.</p> <p><strong>Coverage: Coverage moves such as Earthquake on Mega Rayquaza and Flash Cannon on Klefki threaten to KO Mega Diancie; however, this can be played around via good scouting with Protect.</p> ",
    "sets": [
      {
        "name": "Mixed Attacker",
        "description": "<h1>Moves</h1> <p>Moonblast hits threats such as Darkrai and Yveltal for super effective damage and is Mega Diancie's main attack to use against neutral targets. Earth Power is necessary for hitting Fire-types and Ground-types such as Klefki and Primal Groudon. Diamond Storm hits the various Flying-types in the tier, such as Ho-Oh and Lugia. It is also a physical attack, allowing Mega Diancie to break walls effectively with its mixed STAB attacks. Protect is mandatory for a safe Mega Evolution as well as scouting for Steel-type coverage, such as Klefki that use Flash Cannon or Iron Head. Mega Evolving safely with Protect against Primal Groudon in particular is fantastic, allowing Mega Diancie to switch in already Mega Evolved later in the match, as well as preventing Stealth Rock from going up on the first turn.</p> <h1>Set Details</h1> <p>Diancite allows Diancie to Mega Evolve and gain great offensive stats as well as Magic Bounce. Maximum Special Attack EVs increase Mega Diancie's power. 176 Speed EVs and a Naive nature are used to outspeed Adamant Mega Rayquaza and OHKO it with Moonblast, as well as outspeed positive-natured base 100 Speed Pokemon. Naive is the preferred nature over Hasty due to most priority, such as Extreme Speed from Mega Rayquaza and Arceus, being physical attacks. The remaining 80 EVs go into Attack to give Diamond Storm a boost in power.</p> <h1>Usage Tips</h1> <p>Against teams with Klefki, Smeargle, or Darkrai, Mega Diancie should often be your lead in order to gain Magic Bounce as soon as possible. After Mega Evolving, Mega Diancie should be switched in on these Pokemon every time, as well as on other predicted status moves, such as Stealth Rock. Against teams without these Pokemon, it should generally be used as a wallbreaker early on in the game, hopefully nabbing a KO or weakening a foe to the point where a teammate can finish up. Great targets in this scenario include Ho-Oh, Yveltal, and Primal Groudon, as these all take a lot of damage from Mega Diancie and can be difficult for other Pokemon to defeat. Mega Diancie can also be used to clean up late game, after Arceus formes have been removed. Use Protect to scout for super effective coverage moves, to safely Mega Evolve, and to stall for passive damage from poison or burn if Mega Diancie's teammates run moves that induce those statuses. If Diancie is up against Deoxys-S, delaying its Mega Evolution by a turn can be handy so that Skill Swap does not remove Magic Bounce, allowing it to still bounce back entry hazards. Only switch Mega Diancie in on Pokemon such as Lugia, defensive Arceus, and Mega Sableye that use status moves and can't do more than 30% to it, as it has relatively poor bulk.</p> <h1>Team Options</h1> <p>Ho-Oh is a great teammate, as it can easily and consistently switch in on the Ground- and Steel-type attacks aimed at Mega Diancie, and it appreciates the entry hazard support that Magic Bounce can provide. Defensive Yveltal can handle common offensive Arceus formes and Mega Rayquaza, all of which outspeed Mega Diancie if they run full Speed and can KO it with Earthquake. Primal Kyogre is also bulky enough to take on the various Steel-types in the tier that threaten Mega Diancie as well as Calm Mind Arceus formes that come in to try and set up on Mega Diancie. It also appreciates Klefki removed if it isn't running Rest. Sweepers such as Arceus-Ground, non-Lum Berry Mega Rayquaza, and Xerneas appreciate Klefki and Darkrai out of the picture. Darkrai is a good teammate to put support Arceus formes to sleep with Dark Void, as these are generally the most consistent Mega Diancie switch-ins. Primal Groudon can check the Water-types that threaten Mega Diancie, such as Kyogre, Primal Kyogre, and Arceus-Water. Giratina can switch in on Pokemon such as Mega Rayquaza and offensive Arceus and phaze them with Dragon Tail or cripple them with Will-O-Wisp. Giratina-O can come in on Ground-type attacks aimed at Mega Diancie and provide Defog support if the opponent does get entry hazards up.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 202117, "username": "MZ"}, {"user_id": 262044, "username": "Chloe"}, {"user_id": 277877, "username": "HunterStorm"}]}, {"name": "Grammar checked by", "members": [{"user_id": 193885, "username": "Haund"}, {"user_id": 232216, "username": "The Dutch Plumberjack"}]}], "writtenBy": [{"user_id": 250201, "username": "InfernapeTropius11"}]}
  }
}