{
  "Greninja": {
    "overview": "<p>Greninja’s great offensive Water / Dark typing, exceptional abilities in Protean and Torrent, and blistering Speed make it a great pick in the metagame, allowing it to overwhelm popular threats such as Mega Slowbro, Mega Metagross, and Heatran. This is bolstered by its large movepool, circumventing normally good checks like Mega Venusaur, Genesect, and Ferrothorn. A Substitute + Torrent set adds onto its unpredictability, empowering its offensive capabilities against Pokemon like specially defensive Mega Charizard X, and Mega Metagross. Moreover, the benefits of not being Choice-locked allow it to deter previous checks via Taunt and Toxic, the most notable mentions being Chansey and Reflect Type Mega Latias. However, Greninja’s lackluster bulk leaves much to be desired, easily causing it to be taken out from super effective attacks and strong neutral attacks like Kyurem-B’s Outrage, Mega Gyarados’s Outrage, and Choice Specs Hoopa-U's Thunderbolt. While Greninja has impressive Speed, offensive Pokemon like Mega Lopunny and Choice Scarf users like Kyurem-B, Genesect, and Victini outspeed it.</p> ",
    "comments": "<h1>Other Options</h1> <p>Thanks to its ability Protean, Greninja has a diverse amount of sets at its disposal. Greninja can opt to run a Choice Band set with Low Kick for Kyurem-B and Gunk Shot for Fairy-types like Mega Gardevoir. However, its other sets are more useful and cover the metagame better. A set with Modest nature and a Choice Scarf can handle other Choice Scarf Pokemon like Garchomp, Genesect, Victini. Despite this, the power drop is enormous and is very niche apart from handling these Pokemon. Hidden Power Ground can defeat Magnezone but is useless apart from this. A Life Orb set can be run to have more leverage, as it is no longer Choice-locked, but it loses power compared to other sets. If using Life Orb, then Shadow Sneak can be run to avoid being hit by Hyper Beam and Close Combat from Choice-item Porygon-Z and Sawk respectively.</p> <h1>Checks and Counters</h1> <p><strong>Faster Pokemon: Greninja is vulnerable to powerful STAB moves and super effective moves from faster Pokemon and Choice Scarf users such as Mega Lopunny, Kyurem-B, and Victini.</p> <p><strong>Bulky Pokemon: Despite Greninja’s unpredictability, there are some Pokemon that even both of its sets struggle against like specially defensive Mega Mawile, Mega Venusaur, Hoopa-U, Chansey, and Registeel, although it should be mentioned that even Mega Venusaur struggles against the possibility of Greninja running Extrasensory.</p> <p><strong>Sturdy: Sturdy users like Golem and Crustle are especially problematic for Greninja due to their ability to tank a hit and retaliate using their strong STAB moves.</p> ",
    "sets": [
      {
        "name": "Choice Specs",
        "description": "<h1>Moves</h1> <p>Hydro Cannon is Greninja’s Water-type STAB move of choice and can easily KO offensive Mega Charizard X, Choice Specs Genesect, and Diancie. Grass Knot can handle Mega Slowbro and Mega Swampert. Extrasensory lets Greninja deal respectable damage against Mega Venusaur and Choice Band Sawk. Dark Pulse deals with Psychic- and Ghost-types like Mega Metagross, Mega Latias, and Aegislash. Ice Beam gives Greninja amazing coverage, nailing Dragon- and Ground-types like Mega Altaria, Dragonite, Choice Band Garchomp, and Landorus-T. Hidden Power Fire is Greninja’s best option against non-Choice Scarf Genesect, Ferrothorn, and Mega Scizor. Hidden Power Electric is effective against Mega Gyarados, being able to OHKO prior to Mega Evolving.</p> <h1>Set Details</h1> <p>Maximum Special Attack and Speed EVs allow Greninja to hit as strong and fast as possible. A Timid nature ensures Greninja can outspeed Pokemon like Mega Diancie, Terrakion, and Mega Latias. Protean gives Greninja STAB on any move, giving it extra power against the foe.</p> <h1>Strategy &amp; Support</h1> <p>Choice Specs Greninja is simple to use, as Hydro Cannon is powerful and hits most Pokemon that don’t resist it. This variant of Greninja has trouble dealing with Pokemon that can live Hydro Cannon like Kyurem-B, specially defensive Mega Charizard X, and Mega Gardevoir; because of this, you should try to avoid these Pokemon. Use Hidden Power Fire and Grass Knot on targets that usually defeat Greninja like Ferrothorn and Mega Swampert, respectively, which might be lured in. Due to its frailty, it should also avoid Choice Scarf Pokemon like Kyurem-B, Porygon-Z, Genesect, and Victini. Mega Mawile and Mega Metagross are great offensive partners that benefit from Greninja drawing in and handling bulky Water- and Fire-types such as Mega Gyarados, Mega Slowbro, and non-Endure Heatran. In return, they can handle Sturdy Pokemon like Crustle and Fighting-types such as Mega Lopunny and Sawk, as well as special walls like Chansey. A solid answer to specially defensive Mega Charizard X is appreciated, as Greninja doesn’t have sufficient firepower to handle it. Air Balloon Heatran and Crustle are all capable of taking hits from Mega Charizard X and revenge killing it. In return, Greninja can handle bulky Water-types like Mega Slowbro and Mega Swampert. Choice Band Kyurem-B is a great offensive partner, as it helps Greninja deal with unfavorable matchups such as against bulky Meloetta, Magnezone, and Hoopa-U. In return, Kyurem-B benefits from Greninja taking care of Steel-types like Air Balloon Heatran, Choice Specs Genesect, and Ferrothorn.</p> "
      },
      {
        "name": "Petaya",
        "description": "<h1>Moves</h1> <p>Substitute is the flagship of this set, allowing Greninja to reliably defeat Mega Charizard X by using it until Torrent and Petaya Berry are activated. Hydro Cannon is indispensable for this set, using its immense 150-Base Power on top of STAB, boosted by Torrent and Petaya Berry, to deal tremendous amounts of damage against non-resistant foes. Haze allows Greninja to have a favorable matchup against Flame Charge and Dragon Dance variants of Mega Charizard X as well as Calm Mind Mega Latias when utilized with Toxic. Toxic is useful against non-Rest variants of Mega Slowbro and Mega Latias. Taunt is useful for pinning down stall Pokemon like Mew and Jumpluff.</p> <h1>Set Details</h1> <p>160 Defense EVs are crucial so that Greninja can survive a Flame Charge from Mega Charizard X while using Substitute. 160 Speed EVs with a Timid nature let Greninja outspeed Mega Metagross, Mega Diancie and Jumpluff. The remaining EVs are put into Special Attack to let Greninja hit as hard as possible. Petaya Berry allows Greninja to continuously use Substitute until Torrent is activated, letting it fire off a potent Hydro Cannon.</p> <h1>Strategy &amp; Support</h1> <p>Focus on Pokemon slower than Greninja that don’t resist Hydro Cannon and stall Pokemon that are weak to Taunt like Mew and Jumpluff. When against Mega Charizard X, first use Substitute so you don’t get OHKOed by Outrage; if the opposing Pokemon uses Flame Charge, proceed to use Haze to get rid of the Speed boost so you are always faster than it, and use the same method as followed until you reach 25% health, as Petaya Berry and Torrent will have activated and you can OHKO it with Hydro Cannon. Avoid Pokemon that can bypass Substitute like Mega Gardevoir, Meloetta, and Mega Altaria. Make sure not to Haze away your Petaya Berry boost, as the power drop is significant without it. This set is reliant on setting up with Substitute, so ideally having Pokemon that can deal with faster Pokemon and Choice Scarf users like Mega Lopunny, Kyurem-B, and Porygon-Z make excellent partners. Therefore, Pokemon like Mega Metagross, Mega Gardevoir, and Mega Heracross pair up well. In return, Greninja can deter Mega Charizard X from being sent out against them. Mega Metagross in particular has excellent synergy with Greninja, as it deals with Pokemon that can bypass Substitute like Mega Gardevoir, Meloetta, and Mega Altaria. Pokemon that can handle bulky Water-types like Mega Gyarados, Rest Mega Slowbro, and Mega Blastoise complement Greninja well. Examples include Choice Band Kyurem-B, Mega Venusaur, and Serperior. In return, Greninja deals with Fire-types like Victini and Kee Berry Volcarona.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "PA", "user_id": 430787}], "teams": [{"name": "Quality checked by", "members": [{"username": "LRXC", "user_id": 289008}, {"username": "DEG", "user_id": 234355}]}, {"name": "Grammar checked by", "members": [{"username": "Milak", "user_id": 262594}, {"username": "Astra", "user_id": 240732}]}]}
  },
  "Heatran": {
    "overview": "<p>Heatran's key to success in 1v1 is its great Fire / Steel typing, which makes it a premier check for popular Steel- and Fairy-type Pokemon. Flash Fire gives Heatran the upper hand against other Fire-types, most notably Mega Charizard X. However, its typing does make it weak to popular Water- and Fighting-type Pokemon, such as Mega Gyarados, Manaphy, Terrakion, Mega Heracross, and Mega Lopunny. It also has lackluster offensive stats, so it has trouble against some Pokemon it can't hit super effectively like Hoopa-U and Dragonite. Finally, it's pretty slow compared to the rest of the metagame, leaving it vulnerable to faster threats like Greninja, Garchomp, and Mega Medicham.</p> ",
    "comments": "<h1>Other Options</h1> <p>Choice Scarf Heatran maintains many of Heatran's positive matchups, and it also gains favorable matchups versus Victini and Mew with Dark Pulse, in addition to the likes of Mega Medicham with the extra Speed.</p> <p>Rocky Helmet + Taunt Heatran defeats Seismic Toss Chansey and Brick Break Mega Charizard X, two fairly common checks to Heatran.</p> <p>Choice Specs Heatran with Eruption is more reliable against bulky Pokemon, notably Mega Venusaur, Mega Sableye, and Nasty Plot Porygon-Z, while keeping a positive matchup against Steel-type Pokemon like Mega Mawile and Genesect. If extra Speed is desired, Overheat and Fire Blast don't require a Quiet nature, but neither is very reliable versus Mega Venusaur.</p> <p>However, without Air Balloon, Heatran struggles with Ground-type coverage moves from the likes of Mega Charizard X and Mirror Coat users like Magnezone. Therefore, these options can make many matchups more risky.</p> <h1>Checks and Counters</h1> <p><strong>Super Effective STAB Moves: Many Water- and Fighting-types such as Mega Gyarados, Manaphy, Mega Medicham, and Mega Heracross can easily OHKO Heatran. Further, most Water-types do not take much damage from its attacks. Some Ground-types like Mega Garchomp and Landorus-T circumvent Heatran's Air Balloon with Rock Tomb + Earthquake, surviving any attack in the meantime.</p> <p><strong>Stall Pokemon: Air Balloon Heatran cannot take on some bulky Pokemon, even if it runs Taunt, such as Mega Sableye, Chansey, and Mega Slowbro. Mega Sableye should be wary of Choice Specs Heatran, and Rocky Helmet + Taunt beats Seismic Toss Chansey.</p> <p><strong>Bulky Offensive Pokemon: Heatran loses to offensive bulky Pokemon, such as Dragonite and Hoopa-U, as they can easily sponge its hits and deal back heavy damage.</p> ",
    "sets": [
      {
        "name": "Air Balloon",
        "description": "<h1>Set Description</h1> <p>Overheat defeats Steel-types such as Mega Metagross and Mega Mawile. Flash Cannon is specifically for Fairy-type Pokemon like Mega Diancie and Mega Gardevoir. Alternatively, Heatran can run Endure to force Rock Wrecker Crustle and Choice Specs + Hydro Cannon Greninja to recharge, or Taunt, which eases matchups against some bulky Pokemon like Registeel, Mew, Mega Venusaur, and Porygon2. Rock Tomb helps in various matchups, most importantly slowing down Mega Charizard X, as well as breaking Magnezone's Sturdy without activating Mirror Coat. Earth Power gives Heatran an easier time against opposing Heatran and Mega Charizard X. Air Balloon makes it immune to Ground-type moves such as Earthquake from Donphan and Earth Power from Kyurem-B.</p> <h1>EVs</h1> <p>168 Special Defense EVs allow Heatran to survive Modest Mega Charizard Y's Focus Blast and avoid the 2HKO from Timid Choice Specs Greninja's Dark Pulse. Therefore, using Endure turn 1 is safe regardless of which move Greninja uses. 124 Speed EVs allow Heatran to outspeed Charizard after a Rock Tomb.</p> <h1>Strategy &amp; Support</h1> <p>You should always use Rock Tomb turn 1 against Charizard to outspeed turn 2. Note that Heatran is not reliable versus Mega Charizard X, since Counter variants KO back after Rock Tomb and Dragon Dance variants can use Brick Break. You should also use Rock Tomb against Magnezone turn 1 to avoid being OHKOed by Mirror Coat. If you're running Taunt, always use it against Registeel and Mega Venusaur on the first turn. Use Endure against Greninja turn 1, since Dark Pulse won't 2HKO anyway and Hydro Cannon will force a recharge. If Greninja locks into Dark Pulse, OHKO it with Overheat turn 2. Keep using Endure every other turn if it picks Hydro Cannon.</p> <p>Stall Pokemon such as Mega Sableye and Mega Slowbro are problematic for Heatran, so a stallbreaker such as Mega Gardevoir is a great teammate. Mega Gardevoir also helps it against bulkier offensive Pokemon such as Mega Gyarados, Mega Heracross, and Choice Band Dragonite. Another great partner is Mega Sableye, as it covers offensive Pokemon that can either outspeed Heatran and OHKO it such as Garchomp, Mega Gyarados, and Terrakion, as well as some that survive its attacks like Hoopa-U. Mega Venusaur also works well with Heatran, as it can also pressure and defeat offensive Pokemon such as Terrakion, Mega Gyarados, Manaphy, and Dragonite thanks to its typing and Charm's Attack reduction.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "DEG", "user_id": 234355}, {"username": "Itchy", "user_id": 518399}], "teams": [{"name": "Quality checked by", "members": [{"username": "magicarpe_lvl100", "user_id": 370838}, {"username": "OM", "user_id": 241400}, {"username": "DezShizzels", "user_id": 449859}, {"username": "crucify", "user_id": 437679}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Dragonite": {
    "overview": "<p>With its high Attack stat and powerful STAB Outrage, Dragonite is a great choice for a physical attacker in ORAS 1v1. Its ability Multiscale supports its already great power, giving it an edge over other Dragon-types in 1v1 like Garchomp and Latios, while its typing and bulk allow it to withstand hits from some of the strongest Pokemon in the metagame like Porygon-Z and Meloetta. Furthermore, thanks to its great arsenal of coverage moves, it can be tailored to take on commonly used Pokemon, including bulky Pokemon such as Heatran, Mega Tyranitar, and Diancie. Dragonite's ability to run either a Choice Band or Choice Scarf coupled with the unpredictability of its set in Team Preview lets it lure and KO all-out attackers like Greninja, Mega Lopunny, and Manaphy. However, Dragonite can be easily exploitable mainly due to being vulnerable to status effects from Pokemon like Mega Gardevoir and Mega Sableye, while others capitalize on Fake Out strategies like Mega Medicham and Mega Blastoise, which breaks Multiscale. Moreover, despite Dragonite's Attack stat being very high, it still ends up struggling against stall Pokemon like Mega Sableye, Mega Slowbro, and Kee Berry Mew as well as wallbreakers such as Kyurem-B and Mega Mawile.</p> ",
    "comments": "<h1>Other Options</h1> <p>A Weakness Policy set can be run with 252 Attack EVs and an Adamant nature to almost always defeat Mega Metagross; it should be noted that you should use Earthquake into Extreme Speed to reliably beat it. However, this is generally useless apart from this matchup, which is why its other sets are preferred. Protect can be run with Weakness Policy to help Dragonite with Fake Out users like Mega Lopunny, Mega Medicham, Mega Blastoise, and Ambipom. A Choice Specs set with Hurricane, Fire Blast, Ice Beam, and Thunderbolt can be run to handle physical walls like Mega Venusaur and Mega Slowbro. However, it isn't as useful as the other sets, which cover a variety of Pokemon and more significant threats. Fly can be run in order to handle Mega Heracross but is generally useless apart from this matchup.</p> <h1>Checks and Counters</h1> <p><strong>Broken Multiscale: The main reason for using Dragonite is its ability Multiscale, and without it, Dragonite would be weaker to attacks. Pokemon that ignore Multiscale such as Mega Gyarados, Kyurem-B, and Haxorus, as well as Fake Out users like Mega Medicham and Mega Blastoise, can handle it effectively. Status inflictions can also be a good way of breaking Multiscale, with Pokemon like bulky Will-O-Wisp Mega Charizard X and Mega Gardevoir crippling it and defeating it as a result.</p> <p><strong>Stall: Stall Pokemon like Mega Sableye, Mega Slowbro, Mew, and Registeel all have enough bulk to live Dragonite's attacks and set up on it to mitigate or lower its offense capabilities.</p> <p><strong>Fairy-types: Fairy-types like Mega Mawile, Mega Altaria, and Togekiss can all tank Dragonite's attacks and cripple it with their respective moves.</p> <p><strong>Sturdy: Pokemon like Crustle, Golem, and Sawk are able to survive a hit thanks to their ability Sturdy and counteract with Counter.</p> ",
    "sets": [
      {
        "name": "Choice Band",
        "description": "<h1>Moves</h1> <p>Outrage is Dragonite's strongest STAB move, capable of pummeling Pokemon that don't resist it like Mega Charizard X, Meloetta, and Hoopa-U. Earthquake rounds out Dragonite's coverage well, hitting most Dragon-resistant Pokemon such as Aegislash and Magnezone. Fire Punch is useful for beating Pokemon that are neutral to Earthquake like Genesect, Ferrothorn, and Mega Scizor. Superpower is an option to reliably beat Heatran and Mega Tyranitar. Extreme Speed allows Dragonite to handle frail Pokemon like Choice Scarf Togekiss, non-Choice Specs Greninja, Jumpluff, and Smeargle. Iron Head can be used to beat Mega Diancie and stall Mega Altaria.</p> <h1>Set Details</h1> <p>The key to this set is taking advantage of Dragonite's sheer power with Choice Band to break through bulky Pokemon. 216 HP EVs and 84 Defense EVs allow Dragonite to tank Choice Band Garchomp, while the HP EVs allow Dragonite to survive Choice Specs Draco Meteor from Latios and Ice Beam from Choice Specs Genesect. Multiscale is an integral part, allowing Dragonite to shine by withstanding most attacks from full HP unless against Mold Breaker users and Pokemon with substantially high super effective attacks.</p> <p>Alternatively, Dragonite can run a spread of 112 HP / 64 Atk / 248 SpD / 84 Spe with an Adamant nature to tank Choice Specs Greninja's Ice Beam and outspeed Heracross and bulky Meloetta or a spread of 168 HP / 108 Atk / 240 Def with an Adamant nature if you want to defeat Mega Lopunny.</p> <h1>Strategy &amp; Support</h1> <p>Choice Band Dragonite should mainly focus on Pokemon that lack reliable recovery and Pokemon without Intimidate such as Porygon-Z, Heatran, and Genesect. Ideally, it should be chosen against Pokemon such as Choice Specs Latios, Choice Band Garchomp, Meloetta, and Mega Tyranitar to withstand their strong hits with Multiscale. When against Choice Scarf Togekiss, rather than using Iron Head, it's best to use Extreme Speed, as it removes the chances of getting flinched by Air Slash. One of the biggest issues for Dragonite is Mega Gyarados, and as a result, Pokemon such as Mega Venusaur and Mega Gardevoir pair well. In return, Dragonite can deal with strong special wallbreakers like Porygon-Z and Meloetta. Powerful special wallbreakers like specially defensive Mega Mawile and Choice Specs Hoopa-U synergize with Dragonite quite well thanks to their ability to handle physically defensive Pokemon like Mega Sableye and Mega Blastoise, which Dragonite struggles against. In return, Dragonite can take on specially defensive Pokemon like Diancie. As Sturdy and Counter users like Crustle, Donphan, and Golem can all take hits from Dragonite and knock it out with Counter, Mega Gyarados, while being one of Dragonite's biggest issues, can also be its greatest ally, handling them and shutting down Pokemon like Mega Slowbro, Kee Berry Mew, and Registeel with Taunt. As a result, Taunt Mega Gyarados synergizes well with Dragonite, with the latter being able to handle bulky Mega Charizard X, Ferrothorn, and Genesect. Mega Metagross can deal with problematic Dragon-, Fairy-, and Poison-types like Kyurem-B, Mega Gardevoir, and Mega Venusaur and appreciates Dragonite's effectiveness against Fire-types like Heatran and Victini.</p> "
      },
      {
        "name": "Choice Scarf",
        "description": "<h1>Moves</h1> <p>Outrage is Dragonite's most solid option for handling Dragon-types like Choice Band Kyurem-B, Garchomp, and opposing Choice Band Dragonite. Earthquake pins down Fire- and Steel-types like Victini, Aegislash, and Magnezone. Fire Punch hits Steel-types that aren't hit super effectively by Earthquake like Ferrothorn and Genesect. Superpower can be run in order to hit Heatran, Mega Tyranitar, and Mega Lopunny, while Iron Head is mainly for hitting Mega Diancie and Archeops.</p> <h1>Set Details</h1> <p>8 HP and 4 Special Defense EVs allow Dragonite to tank Ice Beam from Choice Scarf Greninja, while the remaining EVs are invested into Attack and Speed. Multiscale is run in order to tank Outrage from Mega Charizard X and Ice Beam from Choice Scarf Genesect. A Jolly nature can be run to outspeed Mega Lopunny, while an Adamant nature can be run to have a more reliable matchup against Aegislash.</p> <h1>Strategy &amp; Support</h1> <p>This set revolves around outspeeding frailer Pokemon like Porygon-Z, Greninja, Genesect, and Mega Lopunny, which usually have a great matchup against Dragonite, and then proceed to OHKO them with your coverage moves. Against Greninja, if running an Adamant nature, it is better to use Outrage instead of Superpower, as it doesn't risk the possibility of Greninja running Shadow Sneak, and Outrage OHKOes Greninja anyways. On the other hand, running a Jolly nature makes Superpower the optimal choice, as Outrage isn't a reliable win condition due to the significant power drop. Keep in mind that Dragonite's bulk is considerably low and can get overwhelmed by stall and Counter Pokemon like Mega Sableye, Mew, and Crustle. Mega Gyarados is an excellent partner for Dragonite, as it can combat these threats as well as Sturdy Pokemon like Crustle and Golem for it. Mega Gyarados appreciates Dragonite's ability to handle the likes of Genesect. Weakness Policy Victini offensively synergizes well with Dragonite due to its ability to handle Steel-types like Mega Mawile, Mega Metagross, and Mega Aggron. In return, Dragonite deals with offensive threats like Porygon-Z, Mega Lopunny, and Archeops. Other Choice Scarf users like Kyurem-B and Haxorus can use their abilities to outspeed and OHKO Dragonite. Steel-types like Mega Mawile, Genesect, and Mega Aggron can assist Dragonite by getting rid of these threats. In return, Dragonite can handle Fire-types like Victini and Heatran.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "PA", "user_id": 430787}], "teams": [{"name": "Quality checked by", "members": [{"username": "LRXC", "user_id": 289008}, {"username": "OM", "user_id": 241400}]}, {"name": "Grammar checked by", "members": [{"username": "Milak", "user_id": 262594}, {"username": "Astra", "user_id": 240732}]}]}
  },
  "Tyranitar": {
    "overview": "<p>Mega Tyranitar is the most powerful Rock-type in ORAS 1v1. Its huge natural bulk, defensive typing, Special Defense boost from sand, and  extensive movepool let it reliably counter some of the top threats in the metagame, such as Mega Charizard X, Porygon-Z, Victini, Kyurem-B, Aegislash, and Timid Choice Specs Greninja. Mega Tyranitar also has excellent utility, with Rock Tomb and Dragon Dance for speed control and Taunt to prevent opposing setup. Its enormous base 164 Attack gives Mega Tyranitar freedom to invest EVs defensively and still OHKO and 2HKO many Pokemon.</p> ",
    "comments": "<h1>Other Options</h1> <p>Stone Edge is generally not worth using over Rock Tomb, since it sacrifices utility and accuracy, but using both moves on the same set can be surprisingly effective, since Stone Edge deals heavy damage and can threaten walls with critical hits. Screech can bypass walls like Counter Chansey. Counter is a great option in many cases, since Mega Tyranitar can survive most physical attacks, even from Pokemon like Mega Gyarados and Choice Band Garchomp. Ice Beam can 2HKO Donphan and Golem without fear of Counter. 248 HP and 68 Defense EVs let Mega Tyranitar survive Choice Band-boosted Earthquake from both. Avalanche OHKOes Garchomp, but 200 HP and 164 Defense EVs are required to survive both Jolly Choice Band-boosted Earthquake and Rough Skin damage. Earthquake with 144 Attack EVs and an Adamant nature 2HKOes specially defensive Mega Mawile. Dragon Dance and Iron Head give Mega Tyranitar a winning matchup versus Magnet Rise Mega Diancie.</p> <h1>Checks and Counters</h1> <p><strong>Fighting-types: A 4x effective STAB Fighting-type move from a Pokemon such as Mega Lopunny, Mega Heracross, Sawk, Conkeldurr, or Terrakion is guaranteed to OHKO Mega Tyranitar.</p> <p><strong>Fairy-types: Mega Gardevoir, Mega Altaria, Mega Mawile, Sylveon, and Clefable can absorb hits from Mega Tyranitar and often quickly OHKO or 2HKO either set with STAB moves.</p> <p><strong>Water-types: Bulky Water-types can take hits from Mega Tyranitar and KO it with their super effective STAB moves. Manaphy, Azumarill, Mega Blastoise, and Taunt Torrent Greninja will all generally come out ahead versus Mega Tyranitar.</p> <p><strong>Grass-types: Grass-types without a 4x Fire weakness can make quick work of Mega Tyranitar. Mega Venusaur and Serperior can beat it easily with HP investment and their choice of offensive Grass-type attacks. Whimsicott's Leech Seed and Substitute can effectively stall Mega Tyranitar, but against Taunt sets, Whimsicott uses Protect to scout the Taunt and then must block with its own.</p> <p><strong>Mega Metagross: Despite a weakness to Crunch, Mega Metagross can outspeed Mega Tyranitar, absorb any of its attacks with its 150 base Defense, and threaten to OHKO or 2HKO with Tough Claws-boosted Hammer Arm and Bullet Punch.</p> ",
    "sets": [
      {
        "name": "Rock Tomb + Taunt",
        "description": "<h1>Set Description</h1> <p>Rock Tomb simultaneously damages and slows down foes like Mega Charizard X and Kyurem-B, acting as a reliable 2HKO move, and allows Mega Tyranitar to outspeed Taunt users like Mew in order to break their stall. Taunt shuts down Substitute + Leech Seed strategies from Whimsicott, Jumpluff, and Mega Venusaur, unless the former has Protect and Taunt too. Fire Punch breaks through Genesect and Ferrothorn. Crunch is a spammable STAB move that makes quick work of Ghost- and Psychic-types like Aegislash, Mega Gengar, Meloetta, Mew, Victini, Jirachi, Deoxys-S, Mega Latias, and Mega Latios. Alternatively, Earthquake improves Mega Tyranitar's matchups against Magnezone and Heatran.</p> <h1>EVs</h1> <p>136 Speed EVs let Mega Tyranitar outspeed non-Choice Scarf Kyurem-B after Rock Tomb. 84 Special Defense EVs ensure Genesect and Porygon-Z get an Attack boost from Download instead of Special Attack before Tyranitar Mega Evolves. This special bulk also lets Mega Tyranitar survive Focus Blast from Timid Mega Gengar and Timid Choice Scarf Hoopa-U, as well as Hydro Cannon from Timid Choice Specs Greninja. 240 HP EVs give Mega Tyranitar the best odds against Kyurem-B — using Rock Tomb twice beats any variant reliably except Adamant Choice Scarf — while allowing Mega Tyranitar to tank four Seismic Tosses from Chansey and similar walls. 48 Attack EVs and an Adamant nature help Mega Tyranitar find essential OHKOs and 2HKOs versus Genesect, Mega Charizard X, and Kyurem-B.</p> <h1>Strategy &amp; Support</h1> <p>Rock Tomb lets Mega Tyranitar outspeed the majority of the unboosted metagame on turn 2 of a battle. Fire Punch is a good first move to use against Timid Greninja, since Mega Tyranitar will OHKO after it uses Grass Knot. If Greninja uses Hydro Cannon, Mega Tyranitar can use Crunch on the recharge turn. Using Taunt on turn 1 versus stall Pokemon is generally best unless they, like Deoxys-S and Kee Berry Mew, also carry Taunt. In this case, Mega Tyranitar should slow them down with Rock Tomb first, then use Taunt once their Taunt wears off, which can force Struggle or at least prevent stalling tactics. Steel-, Fairy-, and Water-types are all very popular in the metagame; it's important to include checks to each alongside Mega Tyranitar. Mega Mawile, Mega Metagross, and Aegislash help cover Mega Tyranitar's crippling Fighting weakness. In return, Mega Tyranitar beats Mega Charizard X, Heatran, Choice Specs Genesect, Ferrothorn, Babiri Berry Whimsicott, and Victini. Mega Gardevoir and Togekiss are excellent checks to most Fighting-types, covering Mega Tyranitar's biggest weakness, and deal with Mega Gyarados. In return, Mega Tyranitar covers Mega Charizard X, Kyurem-B, Magnezone, and Victini.</p> "
      },
      {
        "name": "Defensive Dragon Dance",
        "description": "<h1>Set Description</h1> <p>Rock Tomb slows down Gyarados and forces it to eventually Mega Evolve, which makes Low Kick super effective. It's also useful versus Mew, Mega Charizard X, Kyurem-B, and most other Pokemon that outspeed Mega Tyranitar. Low Kick 2HKOes Magnezone and makes quick work of Rock Tomb-chipped Mega Gyarados once Dragon Dance neutralizes the Intimidate Attack drop. Crunch is a stronger STAB move and nails threats like Aegislash, Mega Gengar, and Jirachi.</p> <h1>EVs</h1> <p>200 HP EVs and 252 Defense EVs with an Impish nature give Mega Tyranitar the best odds against Gyarados, as it survives two Waterfalls. 44 Attack EVs let Mega Tyranitar OHKO Mega Gyarados with Low Kick after Rock Tomb, Dragon Dance, and sand chip damage. 12 Speed EVs, after Rock Tomb and Dragon Dance, outspeed any foe invested to outspeed Jolly Mega Lopunny.</p> <h1>Strategy &amp; Support</h1> <p>Against Gyarados, Mega Tyranitar should use Rock Tomb first to slow it down and force an eventual Mega Evolution. Dragon Dance on the second turn lets it outspeed Mega Gyarados and neutralize the Attack drop from Intimidate. Low Kick will then KO it. Be sure to include checks to Greninja and Focus Blast users on your team, since Impish Mega Tyranitar can't withstand their attacks. Specially defensive Mega Metagross, specially defensive Mega Charizard X, and Choice Scarf users like Victini, Porygon-Z, Dragonite, and Haxorus are all good teammates, since they either outspeed or survive hits from Choice Specs Greninja and encourage an opposing Mega Gyarados pick.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Elo Bandit", "user_id": 298753}], "teams": [{"name": "Quality checked by", "members": [{"username": "DEG", "user_id": 234355}, {"username": "crucify", "user_id": 437679}]}, {"name": "Grammar checked by", "members": [{"username": "Lumii", "user_id": 493772}, {"username": "Adeleine", "user_id": 517429}, {"username": "autumn", "user_id": 384270}]}]}
  },
  "Mawile": {
    "overview": "<p>Mega Mawile's insane Attack after Huge Power and immense offensive movepool make it a great offensive Pokemon in the metagame. An amazing typing of Steel / Fairy allows it to resist prevalent types such as Dragon, Dark, and Normal so it can deal with Kyurem-B, Mega Sableye, and Mega Lopunny. Good 50 / 120 / 95 bulk and Intimidate allow Mega Mawile to survive most neutral hits and even some super effective ones and handle most physical attackers in the metagame. Alternatively, Hyper Cutter can be used to set up against Charm Venusaur and beat Intimidate Gyarados. However, Mega Mawile's Speed tier is a double-edged sword, as it provides a slow Metal Burst but can leave it outsped and OHKOed in certain bad matchups. There are many common Fire- and Ground-types such as Mega Charizard X, Heatran, Donphan, and Landorus that can OHKO Mega Mawile efficiently.</p> ",
    "comments": "<h1>Other Options</h1> <p>Mega Mawile can run a Hyper Cutter set with an EV spread of 240 HP / 228 Atk / 40 Spe, an Adamant nature, and the moves Swords Dance, Iron Head, Play Rough, and Taunt or Sucker Punch. Using this set gives Mega Mawile a better matchup against Mega Gyarados and opposing Mega Mawile, and it also beats Mega Venusaur with Taunt and Swords Dance. Taunt + Counter can be used to beat Registeel and Mega Metagross if Mega Metagross isn't running Substitute. Fire Fang can be used to have a better matchup against opposing Mega Mawile.</p> <h1>Checks and Counters</h1> <p><strong>Fire- and Ground-types: Fire- and Ground-types such as Heatran, Mega Charizard X, Volcarona, and Landorus are able to outspeed Mega Mawile and OHKO it with a super effective move.</p> <p><strong>Physical Walls: Physically defensive Pokemon such as Mew, Slowbro, and Registeel can all boost their Defense against Mega Mawile. Mew can use Taunt to block Mega Mawile's Swords Dance or Taunt, Slowbro can ignore Taunt with Oblivious by not Mega Evolving, and Registeel can easily tank Mega Mawile's attacks and retaliate with Seismic Toss.</p> <p><strong>Bulky Steel-types: Bulky Steel-types such as Mega Metagross and Mega Aggron can easily eat up Mega Mawile's attacks, attack back, and eventually KO it.</p> ",
    "sets": [
      {
        "name": "Specially Defensive Taunt",
        "description": "<h1>Moves</h1> <p>Metal Burst is always good to use against Choice item users like Garchomp and Choice Specs Greninja, as well as Pokemon that resist Mega Mawile's STAB attacks like Genesect. Iron Head gives Mawile an easier time against Fairy- and Poison-types such as Mega Gardevoir and Mega Venusaur while also being safer against Nasty Plot Porygon-Z. Play Rough is Mega Mawile's strongest move and is used to take down Dark- and Dragon-types such as Mega Sableye, Mega Gyarados, and Kyurem-B. Taunt is used to shut down stall Pokemon such as Jumpluff, Whimsicott, Chansey, and Charm Mega Venusaur if Mega Mawile has Iron Head. Sucker Punch makes up for Mega Mawile's terrible Speed and allows it to finish foes off that it barely can't OHKO, like Meloetta and Sturdy users like Crustle and Sawk, although Crustle and Sawk can OHKO Mega Mawile with Counter if it uses a powerful attack turn one. Sucker Punch is also used to finish off Custap Berry users, namely Magnezone and Porygon-Z.</p> <h1>Set Details</h1> <p>Mega Mawile's 248 HP EVs, 252 Special Defense EVs, and Careful nature allow it to take a plethora of special attacks such as Modest Choice Specs Porygon-Z's Hyper Beam and Choice Specs Greninja's Hydro Cannon. The 248 HP EVs also boost its tanking abilities against physical attackers, specifically Garchomp and Mega Gyarados. Intimidate is preferred over Hyper Cutter, since it allows Mega Mawile to tank hits such as Earthquake from both Choice Band Garchomp and Adamant Choice Band Dragonite, and it ensures Genesect will get its Attack stat boosted by Download instead of its Special Attack.</p> <p>Mega Mawile can run the EV spread of 248 HP / 188 Atk / 72 Def with an Adamant nature to always survive an Earthquake from Choice Band Garchomp and OHKO back with Metal Burst. However, this spread fails to survive Hydro Cannon from Choice Specs Greninja, Flamethrower from Genesect, and Hyper Beam from Choice Specs Porygon-Z.</p> <h1>Usage Tips</h1> <p>Use Mega Mawile against special attackers. This set also does well against Choice item users that cannot OHKO Mega Mawile, as it can either use Metal Burst to return any damage or Play Rough to OHKO. These include Choice Band Garchomp, Choice Specs Greninja, Choice Specs Genesect, and Choice Band Kyurem-B. Beware of Pokemon that can work around Metal Burst, like Metal Sound Magnezone and Nasty Plot Porygon-Z. Be wary of Counter users, namely Sawk and Crustle; to counter them, do not use Iron Head or Play Rough turn one.</p> <h1>Team Options</h1> <p>Rock-types such as Mega Tyranitar and Terrakion work well with Mega Mawile, since they can deal with prevalent Fire-types like Heatran, Mega Charizard X, and Mega Charizard Y, while Mega Mawile can deal with Fighting-types such as Mega Heracross and Mega Lopunny and Water-types like Azumarill and Greninja. Water-types like Mega Blastoise, Greninja, and Mega Gyarados pair well with Mega Mawile, since they can deal with Ground- and Fire-types as well as Mega Metagross. Fire-types such as Will-O-Wisp Mega Charizard X and Heatran can beat Magnezone, Mega Aggron, and Mega Metagross. Mega Mawile can also partner with special attackers, namely the aforementioned Greninja and Porygon-Z, since they can deal with physically defensive Pokemon such as Mega Slowbro and Mew, while Mega Mawile can threaten specially defensive Pokemon like Mega Sableye, Chansey, and Mega Tyranitar.</p> "
      }
    ],
    "credits": {"writtenBy": [], "teams": [{"name": "Quality checked by", "members": [{"username": "DEG", "user_id": 234355}, {"username": "OM", "user_id": 241400}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}, {"username": "Astra", "user_id": 240732}]}]}
  },
  "Medicham": {
    "comments": "<h1>Other Options</h1> <p>Mega Medicham can run Bullet Punch with an Adamant nature to answer Mega Diancie, Gardevoir without Protect, and Archeops.</p> ",
    "sets": [
      {
        "name": "Fake Out Attacker",
        "description": "<h1>Set Description</h1> <p>Fake Out breaks Sturdy and Multiscale against Pokemon such as Aggron, Magnezone, and Dragonite; next to that, it gives Mega Medicham just that little bit of damage to get KOs with its stronger attacks. High Jump Kick is its strongest attack and KOes Pokemon like Heatran, Meloetta, and Manaphy after a Fake Out. Zen Headbutt deals with Pokemon like Venusaur, Sawk, and Mega Charizard Y. Ice Punch is there for those weak to Ice, like Landorus-T, Mega Altaria, and Dragonite. Thunder Punch gives a more reliable Gyarados matchup, as it hits Gyarados hard whether it Mega Evolves or not. Poison Jab OHKOes Gardevoir and Whimsicott. Rock Tomb is used for a more reliable Charizard matchup. Endure gets around Pokemon that use recharge moves like Greninja, Mega Lopunny, and Porygon-Z. It can also be used for those with Endure + Custap Berry like offensive Manaphy.</p> <h1>EVs</h1> <p>Maximum Speed with a Jolly nature is so that Mega Medicham outspeeds Genesect and can Speed tie prominent Pokemon like Mega Charizard X, Mega Charizard Y, and Manaphy. The four leftover EVs are put into Special Defense so that Download from Genesect gives an Attack boost instead of Special Attack. An Adamant nature can be run for more firepower, but it loses Speed for the above matchups.</p> <h1>Usage Tips</h1> <p>Using Mega Medicham is pretty straightforward; you always use Fake Out the first turn into the strongest move possible. By using Fake Out you can estimate the foe's HP and defensive EVs, which is helpful for Pokemon that run different sets. Greninja is an example; while Torrent Greninja runs Defense EVs, Choice Specs Greninja does not. Knowing its set helps you decide whether to use an attack or Endure.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "DezShizzels", "user_id": 449859}], "teams": [{"name": "Quality checked by", "members": [{"username": "crucify", "user_id": 437679}, {"username": "DEG", "user_id": 234355}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Lopunny": {
    "overview": "<p>Mega Lopunny's high Attack and Speed stats along with great STAB moves like Fake Out, Giga Impact, and High Jump Kick let it outspeed and KO many common threats such as offensive Mega Charizard X, Mega Gardevoir, non-Choice Scarf Kyurem-B, Mega Tyranitar, and Heatran. Mega Lopunny also has several utility and coverage moves such as Substitute, Encore, Endure, Thunder Punch, and Ice Punch. The wide range of options give Mega Lopunny a significant surprise factor, but other than Substitute, these options are generally rare. Scrappy is a very useful ability to take on Ghost-types like Mega Sableye and Aegislash, which it can't hit otherwise. Unfortunately, Mega Lopunny's offensive capabilities can only go so far, as foes commonly invest in bulk to survive its attacks, which leaves it prone to threats like Mega Charizard X, Mega Altaria, and Victini. Furthermore, Mega Lopunny's defensive stats leave much to be desired, as other fast offensive threats that can outspeed it will undoubtedly KO it, such as Timid Greninja and Choice Scarf Porygon-Z and Kyurem-B.</p> ",
    "comments": "<h1>Other Options</h1> <p>The combination of High Jump Kick and Thunder Punch can be used to beat most Gyarados, though be wary of a Gyarados EV spread that has close to 252 Attack EVs and enough Speed to outspeed Mega Lopunny at +1, as Mega Gyarados can always KO Mega Lopunny with a +1 Waterfall after a Dragon Dance. If you want to reliably beat Mega Gyarados with Thunder Punch, a spread of 32 HP / 184 Atk / 84 Def / 208 Spe and an Adamant nature will always take a +1 Waterfall from Mega Gyarados and KO back. Ice Punch lets Mega Lopunny reliably beat non-Choice Scarf Landorus-T and Dragonite. Flail over Giga Impact gives Mega Lopunny more reliability against non-Flame Charge Mega Charizard X and Choice Band Victini, though this is generally a big downgrade, as it loses out on key matchups where being able to attack early is crucial, such as those against Mega Gardevoir, Meloetta, Garchomp, Hoopa-U, and Serperior. Endure gives Mega Lopunny a chance versus unsuspecting Timid Choice Specs Greninja and Choice Scarf Porygon-Z, which, under normal circumstances, would use their recharge move instantly. It also gives Mega Lopunny reliability against Custap Berry users, like Manaphy and Porygon-Z. Encore over Substitute allows Mega Lopunny to lock foes into status moves, such as slower Substitute users and some stall Pokemon, but leaves Lopunny more vulnerable to attacks.</p> <h1>Checks and Counters</h1> <p><strong>Faster Offensive Pokemon: Faster offensive Pokemon like Timid Greninja, as well as Choice Scarf Porygon-Z, Kyurem-B, Dragonite, and Victini, can all take out Mega Lopunny in one hit, giving it no time to react.</p> <p><strong>Stall: Generally, Mega Lopunny has a poor matchup against stall Pokemon like Mew, Mega Slowbro, Mega Altaria, Mega Venusaur, and Mega Ampharos, as they survive anything Lopunny can throw at them. Encore can help, but only versus some stall Pokemon.</p> <p><strong>Bulky Offensive Pokemon: Mega Charizard X, Mega Metagross, Victini, Sylveon, and Landorus-T are all threats that can easily EV themselves to take Mega Lopunny’s hits— or just tank them naturally— and KO back with their own moves.</p> ",
    "sets": [
      {
        "name": "Hyper Offense",
        "description": "<h1>Set Description</h1> <p>Fake Out gives Lopunny a safe turn to Mega Evolve before Mega Lopunny's Speed tier kicks in, as well as getting off some very useful chip damage, which aids it in almost every matchup. Giga Impact goes well with Fake Out, allowing Mega Lopunny to always beat Mega Gardevoir, Garchomp, Meloetta, Serperior, and offensive Mega Charizard X. High Jump Kick covers Kyurem-B, Mega Sableye, and Choice Specs Porygon-Z, and it will generally be the move of choice after Fake Out against Pokemon that resist Giga Impact such as Heatran, Mega Tyranitar, and Genesect. Substitute gives Mega Lopunny a better matchup against Counter users like Registeel, along with stall Pokemon, blocking moves like Charm from Mega Venusaur and Will-O-Wisp from Mew. It also helps against Custap Berry users like Porygon-Z and Manaphy while giving Mega Lopunny a better chance against Aegislash and non-Flame Charge Mega Charizard X. Limber, though rarely applicable, should be used to have a better matchup against defensive Thunder Wave Togekiss and Porygon2. Scrappy lets Mega Lopunny beat Mega Sableye and Aegislash, as well as Mega Gengar if Mega Lopunny chooses to use a Jolly nature over an Adamant one.</p> <h1>EVs</h1> <p>252 Attack EVs along with an Adamant nature is the standard, as alternatives make its already imperfect power even more of a concern. 252 Speed EVs allow it to outspeed Pokemon such as Serperior, Jumpluff, and Modest Greninja. Though usually outclassed by Adamant due to the noticeable loss of strength, a Jolly nature can be used to consistently beat Greninja and Mega Gengar, but this will give Mega Lopunny less reliability against semi-bulky Mega Charizard X, Mega Gardevoir, Meloetta, Choice Scarf Genesect, and Togekiss. A spread of 40 HP / 204 Atk / 56 Def / 208 Spe with an Adamant nature can be used to always survive a neutral-nature Choice Scarf Kyurem-B's Outrage, and it maintains enough Speed for Serperior. Alternatively, Mega Lopunny could use 64 HP / 108 Atk / 128 Def / 208 Spe with an Adamant nature to always take an Outrage from Choice Scarf Kyurem-B. These options are generally outclassed by the standard spread, though, as they make once-guaranteed KOs unreliable and lose the chance of winning the mirror matchup. Choice Scarf Kyurem-B is also not very common.</p> <h1>Strategy &amp; Support</h1> <p>Mega Lopunny is generally simple to use, using Fake Out and then the appropriate STAB move. Exceptions to this, though, are times where Mega Lopunny needs to use Substitute. Pokemon like Manaphy and Aegislash force mindgames, as Mega Lopunny should use Substitute on the turn(s) they use Endure or King's Shield, respectively. Another important matchup is that against Mega Charizard X: if you look at the opponent's team and expect Mega Charizard X lacks Flame Charge, you should immediately use Substitute after Fake Out, either fishing for Outrage confusion self-damage or accumulating its Flame Flare Blitz recoil. Both give Mega Lopunny a better chance to KO it with Giga Impact once it can no longer use Substitute. If you do expect the Mega Charizard X to have Flame Charge, after using Fake Out, Mega Lopunny should immediately use Giga Impact and hope that it doesn’t have adequate Defense investment to guarantee survival or falls to a critical hit. Don't assume Mega Lopunny has a good matchup against Gyarados due to Mega Gyarados's Fighting weakness. Gyarados can just avoid Mega Evolving immediately and, depending on its set, use Dragon Dance right after Fake Out and then OHKO or 2HKO semi-reliably with Waterfall. Fake Out into Giga Impact is very unreliable versus bulkier variants of Gyarados, making Mega Lopunny very unreliable as a whole against Gyarados. Substitute Mega Charizard X is a great partner for Mega Lopunny because it can cover the Steel-types that aren't weak to Mega Lopunny's High Jump Kick, as well as taking on some stall Pokemon that Mega Lopunny has trouble with, like Mega Venusaur, Mega Ampharos, and non-Occa Berry Whimsicott. There are also many options with its EVs, as Mega Charizard X could run a specially defensive set to take on Choice Specs Greninja, or it could run a physically defensive set to take on other Mega Lopunny. Alternatively, Belly Drum could be run over Substitute on Mega Charizard X, though this will give it a worse time against Mega Venusaur. Fire-types, by extension, are generally good partners for Mega Lopunny. Mega Slowbro aids in the Mega Charizard X matchup and is generally helpful against Steel-types that Mega Lopunny can’t already beat like Mega Mawile and Mega Metagross. Mega Gyarados also reliably beats Mega Charizard X, and it can cover non-Choice Specs Hoopa-U and Aegislash.</p> "
      }
    ],
    "credits": {"writtenBy": [], "teams": [{"name": "Quality checked by", "members": [{"username": "DEG", "user_id": 234355}, {"username": "LRXC", "user_id": 289008}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}, {"username": "UT", "user_id": 523866}]}]}
  },
  "Garchomp": {
    "overview": "<p>Garchomp's sky-high Attack stat after a Choice Band boost combined with its strong movepool and nice Speed tier makes it a premier offensive presence in the metagame. Its Speed stat allows it to just barely outspeed base 100 Speed Pokemon like Mega Gardevoir and Mega Charizard X which makes running Choice Scarf not much of a necessity. A useful Dragon / Ground typing that it and only a few other Pokemon possess gives it a powerful STAB Outrage and Earthquake able to take down common metagame threats like Mega Charizard X and non-Choice Scarf Kyurem-B, non-Metal Burst Mega Mawile, and Aegislash. This Dragon / Ground typing also has its cons, though, mainly being that Ice-type coverage is not rare in this metagame, and Garchomp can be OHKOed by most Pokemon with Ice-type moves. Though having a powerful offensive presence, there's much to be desired for with Garchomp's defensive capabilities. Almost any Pokemon holding a Choice Scarf can outspeed and KO it with ease, like Porygon-Z, Kyurem-B, Genesect, and Dragonite. It also has a hard time against threats that naturally outspeed it like Mega Lopunny and Greninja. Garchomp also struggles with physically defensive Pokemon that it can't KO turn one, which can usually set up and KO Garchomp or outright KO it, such as Metal Burst Mega Mawile, Mega Gyarados, and Mega Altaria.</p> ",
    "comments": "<h1>Other Options</h1> <p>Choice Scarf can alternatively be run to outspeed Choice Scarf Kyurem-B, Mega Charizard X, and sometimes Greninja, though this set loses out on the driving power that enables Garchomp to win many other matchups, such as but not limited to Mega Mawile, Mega Metagross, Mega Gardevoir, and Aegislash. Swords Dance paired with Fling can be used to stallbreak Pokemon like Chansey and Registeel.</p> <h1>Checks and Counters</h1> <p><strong>Ice-type Coverage: Common threats like Choice Scarf Kyurem-B, Choice Scarf Genesect, Mega Lopunny, Manaphy, Choice Specs Magnezone, and Greninja that run Ice-type coverage are big threats to Garchomp due to them either outspeeding and KOing it or taking a hit and KOing it with relative ease due to its 4x weakness to Ice.</p> <p><strong>Stall: Stall Pokemon like Mega Sableye, Mega Slowbro, and Mega Venusaur all give Garchomp a tough time due to them being able to wear it out by either crippling Garchomp's Attack or raising their own Defense.</p> <p><strong>Bulky Fairy-types: Fairy-types like Mega Altaria and Sylveon give Garchomp a tough time due to them being able to KO it after taking a hit from it.</p> <p><strong>Faster Pokemon: Pokemon such as Protect Mega Diancie, Choice Scarf Porygon-Z, Latios, and Protect Mega Pinsir that normally outspeed Garchomp can OHKO it due to its bad defenses.</p> <p><strong>Move Reflection: Pokemon such as Mega Sableye, Mega Mawile, Mega Aggron, Rhyperior, defensive Mega Charizard X, and Mega Tyranitar that can take a hit from Garchomp and then respond with a stronger Metal Burst or Counter pose huge threats to it, since it's locked into an attack and can't play around the foe.</p> ",
    "sets": [
      {
        "name": "I'd Go Chomper Here (Choice Band)",
        "description": "<h1>Set Description</h1> <p>Outrage is Garchomp's most powerful move on this set, able to take down Mega Charizard X and non-Choice Scarf Kyurem-B. Earthquake provides great coverage against Steel-types such as non-Metal Burst Mega Mawile and Mega Metagross, Fire-types like Victini and Volcanion, and Rock-types like Mega Tyranitar, Diancie, and Terrakion. Poison Jab covers weak Fairy-types like Mega Gardevoir and Whimsicott. Fling in tandem Earthquake allows you to lure in and take down Air Balloon Heatran, since otherwise you'd be stuck with using an ineffective move against it. It can also help against Custap Berry Magnezone because they'd usually expect you to use Earthquake turn one. Alternatively, Fire Fang can be ran to beat Steel-types that Earthquake doesn't like Mega Scizor, Ferrothorn, and Choice Specs Genesect. Stone Edge can also be used to catch bulky Counter Mega Charizard X off guard, since it usually stays in its base forme. An alternative to Poison Jab is Iron Tail, which can solidify the matchup against bulky Sylveon and still take on Mega Gardevoir, but it has the downside of a miss chance and loses out on the Whimsicott matchup. Rough Skin is the preferred ability, since if both Pokemon are KOed on the same turn, the Garchomp user would win, which makes it much harder for physical Pokemon to EV for Garchomp and allows it to more reliably take down Mega Charizard X, non-Metal Burst Mega Mawile, and Mega Metagross, as well as FEAR Pokemon like Aron. Choice Band maximizes Garchomp's power due to its already high Speed tier.</p> <h1>EVs</h1> <p>252 Attack EVs maximize Garchomp's KOing capabilities. 252 Speed EVs and a Jolly nature let Garchomp outspeed up to base 101 Speed non-Choice Scarf Pokemon like Mega Charizard X, Mega Medicham, Mega Gardevoir, Volcarona, Genesect, and Landorus-I.</p> <p>An alternative spread of 176 Atk / 80 SpD / 252 Spe with a Jolly nature can be ran to always take a Hidden Power Ice from maximum Special Attack Heatran and non-Choice Specs Magnezone, so run this when running Fling to beat all Heatran variants. This does have its downfalls, though; your reliability against Mega Mawile and bulky Mega Charizard X lessens because now you can't always OHKO them.</p> <h1>Strategy &amp; Support</h1> <p>Garchomp generally has very straightforward matchups, but avoid sending it in if you know the opponent is going to choose Mega Mawile or Mega Aggron, as though you have a type advantage, these both can take a hit and KO back with Metal Burst. Though mostly outclassed by its regular forme, watch out for Protect Mega Diancie, as it can outspeed and KO you, whereas normally you'd be able to OHKO with Earthquake. Using Fire Fang over Outrage against Crustle can give you a better chance to win against Counter variants due to the Rough Skin damage you give them. Garchomp appreciates bulky offensive teammates that can take hits from and beat hyper offensive Pokemon like Mega Lopunny, Choice Specs Greninja, and Choice Scarf Porygon-Z, which outspeed Garchomp and KO it with ease. This means that teammates like specially defensive Mega Charizard X and Manaphy make good teammates. In return, Garchomp can take down Occa Berry Whimsicott, offensive Mega Mawile, and Heatran. Garchomp also appreciates Steel-type teammates like Heatran, Mega Metagross, and Magnezone due to their ability to take down threatening Fairy-types that Garchomp can't already cover with its Poison-type coverage like Metal Burst Mega Mawile, Mega Altaria, and Sylveon. In return, Garchomp can take down opposing Heatran, Volcanion, and Volcarona.</p> "
      }
    ],
    "credits": {"writtenBy": [], "teams": [{"name": "Quality checked by", "members": [{"username": "DEG", "user_id": 234355}, {"username": "LRXC", "user_id": 289008}]}, {"name": "Grammar checked by", "members": [{"username": "Rabia", "user_id": 336073}, {"username": "Astra", "user_id": 240732}]}]}
  },
  "Manaphy": {
    "comments": "<h1>Other Options</h1> <p>Manaphy can also use a Custap Berry set that makes use of Tail Glow, Endure, Surf, and Hyper Beam. However, this set struggles from having to rely on Endure predictions in many matchups, making it unreliable. Chesto Berry is an alternative to Sitrus Berry that helps standard Manaphy against Genesect and helps it be less prone to critical hits, but Sitrus Berry is generally preferred.</p> ",
    "sets": [
      {
        "name": "Stall",
        "description": "<h1>Set Description</h1> <p>Manaphy uses a stall set that aims to outlive most threats but has the problem of being prone to critical hits. It uses Scald as the STAB move for its chance to burn the foe, which can help in matchups versus Taunt users like Mega Gyarados and setup Pokemon such as Swords Dance Garchomp. It uses Acid Armor and Calm Mind to take less damage from physical and special attackers, such as Mega Charizard X, Victini, and Genesect, while boosting Scald's power. It uses Rest as its recovery move gets rid of status and helps PP stall other stall Pokemon such as Slowbro and Chansey. Sitrus Berry is useful for instant recovery in matchups versus powerful attackers like Choice Band Terrakion and Mega Charizard X.</p> <h1>EVs</h1> <p>The EVs increase Manaphy's mixed bulk while allowing it to outspeed Genesect and Speed tie base 100s like Jolly Mega Charizard X, giving it better odds to beat it. It also has 4 Special Defense EVs to stop Genesect from getting a Special Attack Download boost.</p> <h1>Usage Tips</h1> <p>Manaphy's matchups usually come down to using Acid Armor on physical attackers and Calm Mind on special attackers. Due to Manaphy's moves having high PP and it having Rest, it is able to outstall other stall Pokemon such as Slowbro and Registeel.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "bea", "user_id": 481149}], "teams": [{"name": "Quality checked by", "members": [{"username": "crucify", "user_id": 437679}, {"username": "DezShizzels", "user_id": 449859}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Serperior": {
    "comments": "<h1>Other Options</h1> <p>Serperior may occasionally use Worry Seed, stopping Registeel from using Rest by replacing its ability with Insomnia. Worry Seed also beats Mega Mawile by removing Huge Power and Dragon Dance Mega Altaria by removing Pixilate. Taunt beats stall Pokemon as well and gains other matchups such as Taunt Mega Aggron and Shell Smash Crustle. These moves see less use because they require dropping Protect, which will often lose more matchups than Worry Seed or Taunt will gain.</p> ",
    "sets": [
      {
        "name": "SubSeed",
        "description": "<h1>Set Description</h1> <p>Serperior uses its great Speed tier to set Leech Seed and gain passive recovery at the end of the turn. Then, Serperior alternates between Protect and Substitute, chipping the opponent and stalling turns. This allows Serperior to beat many top threats, such as Garchomp and Mega Metagross. To round out the set, Serperior uses Leaf Storm, a powerful STAB move that gains power with each use thanks to Contrary. This allows Serperior to beat some stall Pokemon, such as Mega Sableye, Manaphy, and Slowbro.</p> <h1>EVs</h1> <p>Serperior needs maximum Speed investment to outspeed base 110 Speed threats, most notably Mega Diancie, Mega Metagross, and non-Choice Scarf Archeops. The Defense investment allows Serperior to beat Jolly Choice Band Terrakion without investing in HP, so Serperior gets the largest percentage of its own HP from opponents with Leech Seed. The Special Attack investment gives it a better chance to KO Mega Sableye with two Leaf Storms.</p> <h1>Usage Tips</h1> <p>Versus Sableye, Serperior can use Protect turn 1 to avoid Taunt, which will still be a priority move due to Prankster when they Mega Evolve. This will allow Serperior to get a Substitute off against Mega Sableye to avoid potential Metal Burst damage. If they use Calm Mind, use Leaf Storm. However, if they choose not to Mega Evolve, they preserve Prankster Taunt and the matchup becomes a tossup between Leaf Storm on Taunt or Substitute on Metal Burst. However, it should be noted that many Sableye do not carry Metal Burst.</p> <p>Versus various targets that are weak to Grass, such as Mega Diancie, Mega Gyarados, and Mega Slowbro, Serperior should use Leaf Storm repeatedly instead of setting Leech Seed.</p> <p>In most other matchups, using Leech Seed turn 1 before alternating between Protect and Substitute provides the best chances of winning, provided Serperior survives the foe's initial attack.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Itchy", "user_id": 518399}], "teams": [{"name": "Quality checked by", "members": [{"username": "crucify", "user_id": 437679}, {"username": "DEG", "user_id": 234355}]}, {"name": "Grammar checked by", "members": [{"username": "UT", "user_id": 523866}]}]}
  },
  "Whimsicott": {
    "overview": "<p>Whimsicott's Prankster, along with the combination of Leech Seed, Substitute, and Protect, allows it to outstall most offensive Pokemon as long as it can survive one attack, regardless of if they naturally outspeed it. Prankster also gives Whimsicott's Taunt priority, so it shuts down stall Pokemon such as Manaphy and other Taunt users such as Mega Gyarados. Whimsicott can also take on Steel- and Fire-types like Mega Mawile and Mega Charizard X with Babiri Berry or Occa Berry, which let it take a super effective attack that would usually OHKO it and afflict them with Leech Seed. Whimsicott's Grass / Fairy typing is good defensively, due to key resistances such as Water, Dark, and Ground and its immunity to Dragon-types. Whimsicott is also 4x weak to Poison-type moves though, meaning Pokemon like Sawk, Garchomp, and Landorus can easily OHKO it by running Poison Jab or Sludge Wave as a coverage move. Whimsicott suffers against sound move users like Porygon-Z and Meloetta, as both Uproar and Hyper Voice go through Substitute. Whimsicott also cannot do anything to opposing Grass-types like Mega Venusaur, as they are immune to Leech Seed and can easily take care of it with their STAB attacks.</p> ",
    "comments": "<h1>Other Options</h1> <p>Occa Berry can be used in combination with a 240 HP / 100 Def / 168 SpD spread and a Calm nature to beat Pokemon like Mega Charizard X and Mega Camerupt, which would otherwise KO Whismicott. Whimsicott may even use Kebia Berry to survive Poison-type coverage moves such as Poison Jab from Sawk and Sludge Wave from Volcanion, or Yache Berry to survive Ice-type moves like Ice Beam from Choice Specs Kyurem-B. Whimsicott can run a combination of Sitrus Berry and Cotton Guard, giving up Taunt for a very good matchup against physical attackers it wouldn't normally beat, such as Mega Metagross and Choice Scarf Garchomp. Alternatively, Whimsicott can run Encore for a better matchup versus Mega Slowbro, but these both carry the risk of losing to Taunt Pokemon.</p> <h1>Checks and Counters</h1> <p><strong>Magic Bounce: Pokemon like Mega Sableye and Mega Diancie cannot be hit by Leech Seed due to Magic Bounce and can simply KO Whimisicott back.</p> <p><strong>Grass-types: Pokemon like Mega Venusaur and Ferrothorn are immune to Leech Seed and can KO Whimsicott with their STAB attacks.</p> <p><strong>Strong Super Effective Attackers: Pokemon like Mega Charizard X, Choice Specs Kyurem-B, and Mega Gengar can OHKO a Whimsicott that isn't holding the appropriate Berry. Additionally, Choice Band Victini can OHKO Whimsicott even when it's holding an Occa Berry.</p> <p><strong>Poison-type Coverage: Garchomp, Sawk, Landorus, and Volcanion can OHKO Whimsicott with either Poison Jab or Sludge Wave. These Pokemon still need to be wary of potential Kebia Berry sets.</p> <p><strong>Sound Moves: Hyper Voice from Mega Gardevoir, Uproar from Meloetta and Porygon-Z, and Bug Buzz from Volcarona and Genesect can bypass Whimsicott's Substitute, thus breaking through its stalling.</p> <p><strong>Bullet Punch: Pokemon like Mega Metagross and Mega Medicham can use Bullet Punch after expending Whimsicott's Babiri Berry to OHKO it, given that they are faster than it.</p> <p><strong>Slowbro: Slowbro is unaffected by Taunt thanks to Oblivious, so it can use recovery moves to stall out Whimsicott.</p> ",
    "sets": [
      {
        "name": "Babiri Berry",
        "description": "<h1>Moves</h1> <p>Leech Seed allows Whimsicott to get HP back after using Substitute and Protect to effectively stall out the opposing Pokemon's HP. Protect should be used turn 1 vs Fake Out users like Lopunny and should be alternated with Substitute. Taunt is useful against Pokemon with recovery moves like Manaphy, Registeel, and Kee Berry Mew, and opposing Taunt users, such as Mega Gyarados and Deoxys-S.</p> <h1>Set Details</h1> <p>24 HP EVs and 252 Defense EVs with a Bold nature allow Whimsicott to take a high number of non-super effective hits from strong Pokemon in the metagame, such as Giga Impact from Mega Lopunny, and even some strong super effective hits such as Iron Head from Choice Band Terrakion. Running few HP EVs allows Whimsicott to heal more of its HP from Leech Seed. 232 EVs in Special Defense allow Whimsicott to tank an uninvested Ice Beam from Kyurem-B and Air Slash from Choice Scarf Togekiss. Babiri Berry allows Whimsicott to tank Steel-type hits it otherwise wouldn't, like Iron Head from Mega Mawile and Flash Cannon from Magnezone.</p> <h1>Usage Tips</h1> <p>Send Whimsicott out against Steel-types like Mawile and Magnezone, as it can use Leech Seed first, tank a hit with its Babiri Berry, and stall out the foe with Substitute and Protect. Be wary of Pokemon like Mega Aggron and Mega Mawile, as they can run Taunt and beat Whimsicott that way. While Whimsicott does tank a Meteor Mash from Mega Metagross thanks to its Babiri Berry, Mega Metagross will still KO it with Bullet Punch before it can use Substitute. Against certain Pokemon like Togekiss and Mew, it is best to use Protect first to scout if they have Trick. If they do have Trick, use Substitute or Taunt to block it; otherwise, use Leech Seed and proceed to stall as usual. Against Kee Berry Mew, it is best to use Taunt after Protect to avoid Taunt from Mew and then use Leech Seed and the combination of Protect + Substitute to stall it out of HP. Whimsicott has trouble with moves that go through Substitute, such as Hyper Voice from Mega Gardevoir, Uproar from Porygon-Z, and Bug Buzz from Genesect, so do not send it out against these Pokemon.</p> <h1>Team Options</h1> <p>Strong Fire-types like Victini, Mega Charizard Y, and Volcarona can help with Grass-types like Mega Venusaur, Ferrothorn, and Serperior, which are immune to Leech Seed and easily KO Whimsicott. In return, Whimsicott can take on bulky offensive threats, like Mega Gyarados and Mega Altaria, for them. Water- and Dragon-types such as Azumarill, Manaphy, Haxorus, and Garchomp make good partners for Whimsicott to take on troubling Fire-types like Mega Charizard X and Y, Victini, and Heatran. In return, Whimsicott can take on various threats like Mega Ampharos, Magnezone, and Mega Gyarados for them. Pokemon like Meloetta, Mega Gardevoir, Mega Altaria, and Porygon-Z give Whimsicott trouble, as Hyper Voice and Uproar go though Substitute, so Pokemon that can take care of these like Mega Aggron, Mega Metagross, and Mega Mawile are good to pair with it. In return, Whimsicott can potentially take on Ground-type Pokemon like Garchomp that typically bother them.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "OM", "user_id": 241400}], "teams": [{"name": "Quality checked by", "members": [{"username": "LRXC", "user_id": 289008}, {"username": "DEG", "user_id": 234355}, {"username": "crucify", "user_id": 437679}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}, {"username": "UT", "user_id": 523866}]}]}
  },
  "Terrakion": {
    "comments": "<h1>Other Options</h1> <p>Terrakion can use a Choice Scarf for reliability versus Mega Lopunny, Mega Diancie, Greninja, Archeops, and the mirror, but the drop in attacking power without Choice Band is usually too much to justify. Choice Scarf Terrakion does not need to survive Outrage from Kyurem-B, and so it runs maximum Attack and Speed instead.</p> ",
    "sets": [
      {
        "name": "Choice Band",
        "description": "<h1>Set Description</h1> <p>Close Combat and Stone Edge are central to Terrakion's role in ORAS 1v1. Close Combat OHKOes Kyurem-B, Porygon-Z, Heatran, and many other top Pokemon. Stone Edge OHKOes most Charizard sets, with even a slight chance to OHKO Mega Charizard X with near-maximum Defense investment. It is also useful versus Togekiss and Volcanion. Iron Head OHKOes Diancie and most Mega Gardevoir variants. To round out the set, Terrakion has several options, including Giga Impact for Mega Medicham, Aerial Ace for Mega Heracross, Poison Jab to OHKO Whimsicott, and Double Kick, which OHKOes Aggron and has a chance to OHKO Magnezone.</p> <h1>EVs</h1> <p>With 12 HP and 36 Defense EVs, Terrakion survives Outrage from Choice Scarf Kyurem-B and OHKOes it in return. Maximum Speed is for the mirror matchup and to outspeed Pokemon with base 100 Speed, such as Charizard and Victini, as well as Greninja without a Speed-boosting nature.</p> <h1>Usage Tips</h1> <p>Usually, Terrakion is quite straightforward to use. However, against Mega Gyarados, it must predict whether or not the opponent will choose to Mega Evolve, with Stone Edge KOing Gyarados if it does not Mega Evolve and Close Combat KOing it if it does.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Itchy", "user_id": 518399}], "teams": [{"name": "Quality checked by", "members": [{"username": "crucify", "user_id": 437679}, {"username": "DezShizzels", "user_id": 449859}]}, {"name": "Grammar checked by", "members": [{"username": "dex", "user_id": 277988}]}]}
  },
  "Meloetta": {
    "overview": "<p>Meloetta's Normal / Psychic typing allows it to shine offensively and defensively in 1v1. It's also blessed with good bulk, allowing it to sponge strong hits such as Outrage from Mega Charizard X and Dark Pulse from Greninja. Meloetta also has access to Hyper Beam, Uproar, and Psyshock, as well as a plethora of coverage moves such as Focus Blast, Thunderbolt, and Hidden Power Fire to widen the number of Pokemon it beats. However, Meloetta's Speed is lackluster, so it is vulnerable to faster Pokemon, especially Substitute users such as Mega Charizard X, since they block Hyper Beam. The abundance of Steel- and Rock-type Pokemon such as Archeops, Mega Mawile, and Mega Metagross also hinders Meloetta, as they resist its STAB moves and tank its coverage moves. Meloetta also has to pick its checks and counters depending on its teammates because it can only carry so many coverage options.</p> ",
    "comments": "<h1>Other Options</h1> <p>Choice Specs Meloetta can utilize Dazzling Gleam to deal with Mega Sableye, but it has to be wary of Calm Mind and Snarl. Trick can be used to defeat Registeel and Chansey. A Choice Scarf set with 252 Speed and Special Attack EVs and a Timid nature with Hyper Beam, Psychic, Focus Blast, and Thunderbolt can be used to deal with fast heavy-hitters such as Greninja, Mega Lopunny, and Mega Gyarados.</p> <h1>Checks and Counters</h1> <p><strong>Bulky Steel-type Pokemon: Steel-type Pokemon like Mega Metagross and Mega Mawile have no problem tanking any coverage move from Meloetta.</p> <p><strong>Bulky Rock-type Pokemon: Some bulky Rock-type Pokemon like Choice Band Archeops, Rhyperior, and Mega Diancie have no problem taking on Meloetta even if it has Focus Blast.</p> <p><strong>Offensive Bulky Pokemon: A lot of fast, bulky Pokemon like Dragonite and Hoopa-U can take on Meloetta easily.</p> <p><strong>Fast Hard-hitters: A lot of Pokemon are fast enough to outspeed Meloetta and pack the power to OHKO it, like Mega Lopunny, Choice Band Victini, and Choice Specs Porygon-Z.</p> ",
    "sets": [
      {
        "name": "Choice Specs",
        "description": "<h1>Set Description</h1> <p>Choice Specs Hyper Beam easily OHKOes many offensive threats such as Kyurem-B, Porygon-Z, and Mega Charizard X. Psyshock is used to deal with Terrakion and Mega Venusaur. Meloetta can utilize Uproar to defeat Pokemon that use Substitute such as Whimsicott and Serperior. Uproar is also a safe option against Endure users like Manaphy and frail offensive Pokemon such as Greninja, and it usually defeats Mega Venusaur. Focus Blast allows Meloetta to defeat Mega Tyranitar and Heatran. Hidden Power Fire allows Meloetta to defeat Ferrothorn and Genesect.</p> <h1>EVs</h1> <p>252 HP EVs combined with 12 Defense EVs allow Meloetta to survive Hyper Beam from Choice Scarf Porygon-Z, Outrage from Adamant Mega Charizard X, Bug Buzz from Choice Scarf Genesect, and Dark Pulse from Choice Specs Greninja. Meanwhile, 244 Special Attack EVs and a Modest nature allow Meloetta to maximize its offensive potential and defeat the aforementioned Pokemon. If Meloetta is running Hidden Power Fire and wishes to beat Choice Specs Genesect, an alternative EV spread of 252 HP / 152 SpA / 104 SpD will allow it to survive a Choice Specs Bug Buzz and OHKO back with Hidden Power Fire.</p> <h1>Strategy &amp; Support</h1> <p>Faster Pokemon might run Substitute, or slower Pokemon can run Endure; if you suspect this and have Uproar, it is the safest option. Notable Pokemon that run Substitute are Greninja and Mega Charizard X, while Pokemon that can run Endure are Manaphy and Mega Medicham. Meloetta usually fails to defeat specially defensive Pokemon like Mega Charizard X and Kyurem-B, so analyzing your matchup at Team Preview will help—these Pokemon don't always run Special Defense investment unless their partners are weak to specially offensive Pokemon. Other bulky offensive Pokemon can tank all of Meloetta's attacks, notably Dragonite, Hoopa-U, and Mega Gyarados, so offensive Pokemon that can power through most of these threats such as Mega Tyranitar, Mega Lopunny, and Mega Mawile help Meloetta. Meloetta also suffers against opposing Steel-, and Rock-type Pokemon such as Mega Mawile, Mega Metagross, and Crustle, so defensive Pokemon such as Mega Slowbro, Mega Sableye, and Mega Venusaur also help. Fast hard-hitters such as Mega Lopunny and Choice Band Victini are also threats to Meloetta, so physically bulky Pokemon such as defensive Mega Charizard X and Diancie or faster Pokemon such as Choice Scarf Terrakion helps Meloetta fend these threats off.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "DEG", "user_id": 234355}, {"username": "Itchy", "user_id": 518399}], "teams": [{"name": "Quality checked by", "members": [{"username": "OM", "user_id": 241400}, {"username": "DezShizzels", "user_id": 449859}]}, {"name": "Grammar checked by", "members": [{"username": "Itchy", "user_id": 518399}, {"username": "autumn", "user_id": 384270}]}]}
  },
  "Genesect": {
    "overview": "<p>Genesect's high base Special Attack, coupled with Download and a plethora of strong coverage options such as Flash Cannon, Flamethrower, and Thunderbolt, makes it a terrifying threat that handles top-tier Pokemon like Kyurem-B, Mega Gardevoir, Mega Metagross, and Mega Gyarados. Genesect's decent Speed tier allows it to run a Choice Scarf set, meaning it can beat faster Pokemon like Greninja and Garchomp with Fire-type coverage. It struggles to pick between its many coverage options, though, and Genesect's severe Fire weakness gives it popular counters like Mega Charizard X, Heatran, and Victini. Pokemon with equal base defenses such as Manaphy threaten it, as they can invest a mere 4 EVs in Special Defense to deny Download a Special Attack boost. Moreover, Genesect faces stiff competition from other Steel-types like Mega Mawile and Mega Metagross, as they have more bulk and cover even more threats.</p> ",
    "comments": "<h1>Other Options</h1> <p>Genesect can run Psychic to surprise Mega Lopunny. Energy Ball can be run for dealing with certain Water-types like Mega Swampert and Gastrodon, which aren't weak to any standard option. Iron Head improves Genesect's matchup against specially bulky Fairy-types like Hidden Power Fire Mega Gardevoir.</p> <h1>Checks and Counters</h1> <p><strong>Fire-types: Fire-types such as Mega Charizard X, Victini, and Heatran are the biggest threats to Genesect, as they can survive its attacks and OHKO Genesect.</p> <p><strong>Stall Pokemon: Mega Sableye, Chansey, and Registeel can easily take Genesect’s attacks and stall or KO it.</p> <p><strong>Sturdy: Pokemon like Magnezone, Aggron, and Sawk can survive a hit thanks to Sturdy and use powerful attacks to KO Genesect.</p> <p><strong>Bulky Pokemon with Fire-type Coverage: Some Pokemon like Porygon-Z, Meloetta, and Mega Altaria can afford to run defensive EVs for Genesect and OHKO it back with either Hidden Power Fire or Fire Blast. Meanwhile, other checks like Fire Punch Jirachi can outspeed and OHKO it.</p> ",
    "sets": [
      {
        "name": "Choice Specs",
        "description": "<h1>Set Description</h1> <p>With Download and a Modest nature, Genesect can deal with many foes such as Kyurem-B, Mega Gardevoir, Mega Slowbro, and Mega Metagross. Thunderbolt is Genesect’s preferred coverage move, letting it handle Mega Gyarados. Ice Beam hits Garchomp and Landorus-T, which otherwise wall this set. Flamethrower can be run for opposing Steel-types like Mega Metagross and Registeel.</p> <h1>EVs</h1> <p>40 HP and 208 Defense EVs provide Genesect with good physical bulk, with it surviving a Close Combat from Choice Band Terrakion. 160 Speed EVs allow Genesect to outspeed Gyarados and Smeargle. Alternatively, Genesect can run 44 HP / 136 SpA / 144 SpD / 184 Spe with a Timid nature to survive a Hyper Beam from Choice Specs Porygon-Z, outspeed it, and 2HKO it.</p> <h1>Strategy and Support</h1> <p>Avoid sending Genesect in against stall Pokemon like Mega Sableye, special walls like Chansey, and faster powerhouses like Greninja, as it lacks the tools to deal with them. It's best to not send Genesect into Mega Mawile in case it's running Metal Burst. Use Genesect against other wallbreakers like Kyurem-B, Mega Gyarados, and Hoopa-U, as it can use its bulk to survive a hit and at least 2HKO them. There are many Pokemon that can lure Genesect in and hit it with Fire-type coverage, like Hidden Power Fire Porygon-Z or Meloetta and Fire Blast Togekiss, so Genesect should be cautious about these Pokemon. Taunt Mega Gyarados is an excellent partner to beat roadblocks to Genesect, including stall Pokemon like Chansey and Fire-types like Mega Charizard X. In return, Genesect can handle offensive Pokemon like Mega Gardevoir, Choice Specs Hoopa-U, Serperior, and Mega Diancie. Mega Charizard X complements Genesect, dealing with opposing Steel-types like Mega Mawile and Magnezone. In return, Genesect can deal with Pokemon like Mega Gyarados and Mega Tyranitar. Mega Diancie can take on some of Genesect's biggest counters: Mega Sableye and Fire-types like Mega Charizard X and Victini. In return, Genesect can handle Ground-types like Garchomp and Landorus-T.</p> "
      },
      {
        "name": "Choice Scarf",
        "description": "<h1>Set Description</h1> <p>Use Genesect's wide coverage and boosted Speed to KO and outspeed foes like Kyurem-B and Greninja. Bug Buzz notably handles Substitute users like Whimsicott and Deoxys-S. The slashed coverage moves cover different threats, like Flamethrower for Mega Metagross and Ferrothorn, Ice Beam for Garchomp and Landorus, and Thunderbolt for offensive Mega Gyarados and Talonflame.</p> <h1>EVs</h1> <p>Maximum Speed EVs let Genesect outspeed Pokemon like Greninja. Maximum Special Attack EVs with a Modest nature let Genesect 2HKO Mega Slowbro with Bug Buzz more often.</p> <h1>Strategy &amp; Support</h1> <p>Try to avoid bulky and stall Pokemon like Mega Sableye, Mega Venusaur, and Chansey, as Choice Scarf Genesect's damage output is lacking against them. Choice Scarf Genesect mainly relies on luring in faster Pokemon that would normally beat Choice Specs sets, like Greninja and Garchomp, beating them with Fire-type coverage. Sturdy Pokemon like Magnezone, Sawk, and Golem, alongside Mega Mawile if it runs Metal Burst, can survive a hit and KO Genesect, so avoid them. Additionally, there are many Pokemon that carry Fire-type coverage like Hidden Power Fire Porygon-Z and Meloetta, Fire Blast Mega Altaria, so be wary with them. Ground- and Rock-types like Choice Band Garchomp, Mega Diancie, and Mega Tyranitar are great partners for this set, as they handle Fire-types like Mega Charizard X, which are extremely common and detrimental for Genesect. In return, Genesect can assist them against some Water-types like Mega Gyarados and Greninja. Taunt Mega Gyarados creates a potent core with Genesect. Mega Gyarados adds additional offensive pressure against Dragonite, Mega Tyranitar and Mega Charizard X. Additionally, it can also punish several checks to Genesect, including Sturdy Pokemon and special walls like Magnezone, Sawk, and Golem. In return, Genesect can deal with Fairy-types like Mega Gardevoir and Mega Diancie and Grass-types like Ferrothorn and Serperior. Victini has very good synergy with Genesect because it can deal with opposing Steel-types and Psychic-types like Mega Mawile, Registeel, Meloetta, and Jirachi. In return, Genesect hits Ground-types like Garchomp and Landorus-T.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "PA", "user_id": 430787}, {"username": "DezShizzels", "user_id": 449859}], "teams": [{"name": "Quality checked by", "members": [{"username": "Ginger Princess", "user_id": 276708}, {"username": "DEG", "user_id": 234355}, {"username": "crucify", "user_id": 437679}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}, {"username": "Sulo", "user_id": 528036}]}]}
  },
  "Diancie": {
    "sets": [
      {
        "name": "Mega Diancie",
        "description": "<h1>Set Description</h1> <p>Mega Diancie uses Protect to increase its Speed on the turn it Mega Evolves, which allows it to outspeed and OHKO Terrakion and Garchomp. Since Diancie uses both physical and special moves, such as Diamond Storm and Moonblast, a Hasty nature is preferred.  Magnet Rise helps with slower Ground-types that Diancie cannot OHKO like both Landorus formes and Donphan. Rock Tomb allows Mega Diancie to beat Gengar while also avoiding the KO from Mega Charizard X's Counter. Skill Swap beats Choice Specs Volcanion, Mega Gardevoir, and Mega Altaria by acquiring Water Absorb from Volcanion and swapping away Pixilate from Mega Gardevoir and Mega Altaria.</p> <h1>EVs</h1> <p>Maximum Speed EVs with a Hasty nature allow Mega Diancie to outspeed Pokemon like Terrakion and Garchomp. 152 HP EVs let Diancie live Solar Beam from Mega Charizard Y and OHKO in return with Diamond Storm without the need to Mega Evolve. The remaining EVs are put into Special Attack.</p> <h1>Usage Tips</h1> <p>Diancie should never Mega Evolve against a Charizard, as it can get lured by Substitute Charizard Mega Y. In most other scenarios, Diancie should Mega Evolve and use Protect on the first turn against faster threats, like Garchomp and Terrakion. If using Rock Tomb, against Gengar Diancie should Mega Evolve and use Rock Tomb on the first turn, as this either breaks Gengar's Substitute or allows Mega Diancie to outspeed Mega Gengar on the next turn.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "DezShizzels", "user_id": 449859}], "teams": [{"name": "Quality checked by", "members": [{"username": "crucify", "user_id": 437679}, {"username": "DEG", "user_id": 234355}]}, {"name": "Grammar checked by", "members": [{"username": "UT", "user_id": 523866}]}]}
  }
}