{
  "Pikachu": {"sets": {"Revenge Killer": {}}},
  "Noctowl": {"sets": {"Special Attacker": {}}},
  "Ariados": {"sets": {"Lead": {}}},
  "Magcargo": {"sets": {"Physical Wall": {}, "Shell Smash": {}}},
  "Corsola": {"sets": {"Physical Wall": {}}},
  "Masquerain": {"sets": {"Quiver Dance": {}}},
  "Volbeat": {"sets": {"Weather Setter": {}}},
  "Illumise": {"sets": {"Choice Specs": {}}},
  "Lunatone": {"sets": {"All-Out Attacker": {}}},
  "Solrock": {"sets": {"Physical Wall": {}, "Weather Lead": {}}},
  "Chimecho": {"sets": {"Offensive Utility": {}, "Trick Room Setter": {}}},
  "Wormadam-Trash": {"sets": {"Physical Wall": {}}},
  "Gigalith": {
    "comments": "<h3>Other Options</h3> <p>Explosion, especially when paired with Custap Berry, is one way for Gigalith to trade massive damage when it's already at low HP. It is Gigalith's strongest coverage move versus Vibrava, which can come in handy to ensure Stealth Rock stays up, given Vibrava will likely want to come in and use Defog in the favorable matchup, only to get blown up. Custap Berry sets work great as leads so Gigalith can get up Stealth Rock before getting KOed, letting a teammate come in afterwards and threaten Defoggers like Vibrava and Dustox. Investing some EVs into Special Defense can improve Gigalith's matchups against Swoobat and Vanilluxe.</p> <h3>Checks and Counters</h3> <p><strong>Ground-types</strong>: Marshtomp and Hippopotas are easily the best counters to Gigalith, even versus its Choice Band variant. Other Ground-types like Vibrava and Krokorok may deter Stone Edge, but they fear stronger coverage moves.</p> <p><strong>Grass-types</strong>: One of Gigalith's most common weaknesses, faster Grass-types like Servine and Ivysaur easily force it out. Physically defensive Grass-types like Gourgeist-L and Meganium are faster than Gigalith, and even ignoring the threat of Giga Drain, they can fish for a Stone Edge miss and recover with Synthesis and Leech Seed. Ivysaur and Meganium are particularly annoying, since they can deal with Toxic through their typing and Aromatherapy, respectively.</p> <p><strong>Water-types</strong>: Politoed and special variants of Huntail can take a hit from Gigalith and threaten great damage as well as potential burn with Scald from Politoed. Simipour and Frogadier have a harder time coming in safely but can threaten to OHKO with Hydro Pump.</p> <p><strong>Special and Mixed Attackers</strong>: Gigalith's bulk is only remarkable on the physical side, so any special attacker with strong coverage like Electabuzz or Magmar with Focus Blast is an issue. Even worse, physical attackers like Persian and Simisage can afford coverage like Water Pulse and Leaf Storm, respectively, to bypass Gigalith's great physical bulk.</p> <p><strong>Bronzor</strong>: Bronzor shrugs off Stone Edge, Toxic, and Earthquake. It doesn't fear much from Gigalith unless it's a specially defensive variant against the Choice Band set.</p>",
    "sets": {
      "Stealth Rock": {
        "description": "<p>Gigalith's sheer bulk, strength, and access to Stealth Rock make it a popular pick for balance teams and the like. Its typing means that physically offensive Normal-types like Persian, Furfrou, and Raticate struggle to take it down, whereas Pokemon with stronger coverage versus Gigalith like Pignite and Swalot will struggle to trade hits successfully. Stone Edge will deal more damage than Rock Blast on average, consistently 2HKOing Servine and Politoed, whereas Rock Blast is more consistent with its accuracy and the ability to break Substitute and Focus Sash on the likes of Swoobat and Butterfree. Earthquake pairs best with Gigalith's Rock-type coverage, especially versus foes like Swalot and Lairon. Superpower nails Krokorok and Lairon, especially useful given Earthquake lacks a chance to OHKO the latter. It is also Gigalith's strongest coverage move versus Vibrava, although Toxic is another option to punish Vibrava along with other checks like Gourgeist-L. Rocky Helmet is an alternative to Leftovers that chips at offensive pivots like Persian and Furfrou. Lastly, Custap Berry offers the chance for Gigalith to get an extra hit off when it's at low health, which also works as an emergency check to most sweepers if it is still at full health for Sturdy.</p> <p>A staple on most cores, Gigalith pairs with special walls like Duosion, Dustox, and Klang. They deal with the strong special attackers that Gigalith is forced out by, whereas it can check physical attackers like Lairon and Persian. Specially offensive pivots like Electabuzz and Frogadier can position Gigalith on the field to set up Stealth Rock and fire off strong attacks. Poison-types like Ivysaur and Swalot make for good partners, as they can take on Grass-types like Servine and Simisage. In the same vein, teammates like Politoed and specially defensive Servine check offensive Water-types. A Grass-type that can comfortably switch into Earthquake, like Servine or Quilladin, is also a must. Servine specifically can dissuade Defog attempts from Vibrava, which is a Pokemon that gives Gigalith trouble.</p>"
      },
      "Choice Band": {
        "description": "<p>With the extra power from Choice Band and extra Speed investment, Gigalith makes for a dangerous wallbreaker. It can OHKO slower foes like Duosion and Swalot, and even potential switch-ins tend to be shoddy at best given the raw damage of Stone Edge. However, Gigalith is still slower than physical walls like Gourgeist-L and Meganium, so even with a stronger Superpower, it fails to get past these foes by itself. Heavy Slam offers good neutral coverage, 2HKOing Vibrava as an example. Toxic is an alternative to deal with the aforementioned Grass-type walls that Gigalith still struggles against.</p> <p>Pivots like Electabuzz, Dustox, Frogadier, and Vibrava are all great teammates to position Gigalith on the field versus slower, vulnerable targets. Physical sweepers like Huntail and Klang are also great to have once Gigalith is able to break down opposing physical walls. Knock Off users like Servine, Ivysaur, and Persian are excellent to soften up Eviolite-reliant walls like Bronzor and Vibrava soften up for Gigalith; it can then OHKO these foes with Superpower. Special wallbreakers like Magmar and Swoobat are great to pivot into when Gigalith is forced out by a faster Grass-type.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 231074, "username": "S1nn0hC0nfirm3d"}, {"user_id": 601970, "username": "sleid"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 543866, "username": "5Dots"}, {"user_id": 226429, "username": "Jett"}]}, {"name": "Grammar checked by", "members": [{"user_id": 470115, "username": "SolarBeam"}]}]}
  },
  "Vanilluxe": {
    "comments": "<h3>Other Options</h3> <p>Hidden Power Fire over Hidden Power Ground has a small chance of 2HKOing Bronzor after Stealth Rock while still hitting Dustox, most Steel-types, and Grass-types for super effective damage. However, a super effective Hidden Power Fire is weaker than a neutral Ice Beam against all other targets, and this worsens Vanilluxe's matchup against Lairon.</p> <h3>Checks and Counters</h3> <p><strong>Steel-types</strong>: Bronzor is Vanilluxe's worst matchup, as, barring the rare Hidden Power Fire, it resists everything in Vanilluxe's arsenal, can retaliate with either Stealth Rock, Toxic, or Psywave, and can heal off any damage it accumulates with Rest. Defensive Klang does similarly well and can even avoid the 2HKO from Hidden Power Ground, though offensive Klang and Lairon cannot risk switching into said coverage move.</p> <p><strong>Special Walls</strong>: Specially defensive behemoths like Duosion and specially defensive variants of Dusclops and Swalot can avoid the 2HKO from Vanilluxe's Ice Beam; they can threaten it out with their STAB moves, and the former two even have recovery moves to outlast repeated hits from its STAB moves.</p> <p><strong>Fire-types</strong>: Fire-types like Magmar, Pignite, and Lampent resist Vanilluxe's STAB moves and Flash Cannon and can retaliate back with their own STAB moves, with the first of these even outspeeding Vanilluxe. However, they do not want to face Hidden Power Ground.</p> <p><strong>Residual Damage</strong>: Due to Vanilluxe's merely decent Speed, lack of defensive utility, and mediocre bulk, it is quite susceptible to entry hazards, especially Stealth Rock. Toxic shortens its already low longevity, while Thunder Wave negates its offensive threat potential.</p> <p><strong>Faster Threats</strong>: Faster threats like Simipour, Simisage, and Furfrou can revenge kill it after some prior chip damage, though physical revenge killers have to watch out for accidentally triggering a Weak Armor boost from Vanilluxe.</p>",
    "sets": {
      "Choice Specs": {
        "description": "<p>Vanilluxe solidifies itself as an excellent wallbreaker, courtesy of its power, offensive typing, and solid Speed. Ice Beam devastates popular Grass- and Ground-types like Servine, Ivysaur, Vibrava, and Krokorok. Freeze-Dry targets Water-types that would switch into Ice Beam, such as Politoed, Simipour, and Seaking. Hidden Power Ground hits Steel-types, OHKOing Lairon and 2HKOing offensive Klang. Flash Cannon OHKOes Carbink, Wigglytuff, and opposing Vanilluxe, OHKOing the latter two after Stealth Rock. Frost Breath 2HKOes Duosion and Carbink, bypassing any Calm Mind boosts they may have obtained. Weak Armor provides Vanilluxe with a situational Speed boost after being hit with contact moves like Knock Off and U-turn, which can be useful in endgames against attackers like Persian.</p> <p>Vanilluxe's wallbreaking capabilities best suit it on balanced and offensive teams, taking advantage of cores that rely on Politoed and bulky Grass-types for their defensive cores. Despite having coverage, Vanilluxe has difficulty forcing out Fire- and Steel-types like Pignite and Bronzor, which can freely switch into its STAB moves. Therefore, Fire-types like Pignite and Magmar can force out Steel-types, while Water-types like Simipour and Frogadier can force out Fire-types, making them good partners to Vanilluxe. Owing to its lack of defensive utility, Vanilluxe appreaciates slow pivots and Defoggers like Dustox and Vibrava to enter the field more safely and remove hazards to allow it to continue wallbreaking. Other pivots like Persian and Jumpluff enjoy Vanilluxe weakening Steel-types so that they can have an easier time revenge killing later in the game. Late-game cleaners like Whiscash and Sawsbuck likewise value Vanilluxe's power that lets them pick off weakened foes late-game. Special walls like Duosion, Dusclops, and specially defensive Swalot can be difficult for Vanilluxe to break through, so physical attackers like Scraggy, Sawsbuck, and Krokorok can help force these walls out.</p>"
      },
      "Choice Scarf": {
        "description": "<p>Vanilluxe turns into a threatening revenge killer, courtesy of its offensive typing and solid Speed. Freeze-Dry targets Water-types that would switch into Ice Beam, such as Politoed, Simipour, and Seaking, and revenge kills boosted sweepers like +1 Dragon Dance Whiscash and +1 Butterfree as well as fast setup Pokemon like Jumpluff and Swoobat in one slot. Hidden Power Ground targets Steel-types, OHKOing most Lairon sets and 3HKOing offensive Klang sets after Stealth Rock damage. Flash Cannon 2HKOes Carbink, Wigglytuff, and Vanilluxe. Weak Armor allows Vanilluxe to outspeed faster Choice Scarf users like Simipour and Electabuzz after being hit by physical contact moves.</p> <p>As this Vanilluxe set is meant to revenge kill, it ideally partners with wallbreakers like Pignite and Simisage. Even with Hidden Power Ground, Vanilluxe has difficulty forcing out Fire- and Steel-types like Pignite and Bronzor, which can freely switch into its STAB moves. Fire- and Ground-types like Magmar and Krokorok can weaken these checks so that Vanilluxe has an easier time revenge killing. Vanilluxe enjoys slow pivots and Defoggers like Dustox and Vibrava to shore up its lacking defensive profile. Late-game cleaners like Simipour and Scraggy value Vanilluxe's power to pick off weakened foes. Due to Vanilluxe's lower power holding a Choice Scarf, it struggles more against walls like Dustox, Duosion, and Scraggy, so answers to these defensive Pokemon like Lairon, Scraggy, and Pignite can ease its vulnerabilities to them.</p>"
      },
      "Autotomize": {
        "description": "<p>Vanilluxe turns into a frightening late-game cleaner with Autotomize, being able to switch between moves and outspeeding all Choice Scarf users in the metagame after a boost. Freeze-Dry breaks past Water-types that would tank Ice Beam like Politoed and Seaking. Hidden Power Ground threatens Steel- and Fire-types like Lairon and Pignite, OHKOing the former and 2HKOing the latter. Life Orb is the preferred item to boost Hidden Power Ground's power, 2HKOing Pignite after Stealth Rock damage. While Weak Armor does not synergize with Vanilluxe's offensive profile, it does allow it to outspeed the unboosted metagame without an Autotomize boost if it is hit with moves like Knock Off and U-turn.</p> <p>To ensure a successful sweep, Vanilluxe prefers having its Fire- and Steel-type checks like Pignite, Magmar, Klang, and Bronzor severely weakened or removed. Water- and Ground-types like Simipour and Krokorok stand out, with both having Knock Off to cripple Vanilluxe's checks and providing wallbreaking prowess to force out the opposition. Krokorok particularly stands out, being able to Pursuit trap Bronzor and threaten slower Steel- and Fire-types. Physical wallbreakers like Pignite and Furfrou can target special walls like Scraggy, Duosion, and Dustox, with the former also targeting Steel-types and the latter providing U-turn support to bring Vanilluxe in safely. Setup support like Memento from Jumpluff can give Vanilluxe an easier time setting up Autotomize, shoring up its poor defensive profile. Defoggers like Vibrava and Dustox and Taunt users like Quilladin and Servine can enhance Vanilluxe's longevity through preventing entry hazards from going up, ensuring a more reliable sweep.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 543866, "username": "5Dots"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 601970, "username": "sleid"}, {"user_id": 296755, "username": "5gen"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}, {"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Beartic": {"sets": {"Rain Sweeper": {}}},
  "Meowstic": {
    "outdated": true,
    "comments": "<h4>Other Options</h4> <p>Yawn can be used in favor of Thunder Wave to help thwart the Defoggers or setup sweepers that can take advantage of Meowstic-M. Psychic can be dropped for Mean Look to further guarantee the sleep from Yawn, which allows for free turns for its teammates but means Meowstic has no attacks and is completely vulnerable to Taunt.</p> <h4>Checks and Counters</h4> <p><strong>Defog Users</strong>: Dustox, Vibrava, and Pidgeot can remove Meowstic-M's dual screens while taking low damage, being able to heal off the minimal damage from Psychic. However, Dustox and Pidgeot have to be worried about being crippled by Thunder Wave.</p> <p><strong>Knock Off Users</strong>: The likes of Scraggy and Krokorok can enter the field safely while threatening to remove Meowstic-M's Light Clay, which weakens its ability to support its teammates. Other users like Ivysaur, Servine, and Persian can remove Meowstic-M's item as well, but they risk getting paralyzed.</p> <p><strong>Setup Sweepers</strong>: Bulk Up Scraggy, Dragonair, and Klang are setup sweepers that can safely boost in front of Meowstic-M while not being concerned with Psychic and Thunder Wave thanks to Shed Skin and RestTalk, respectively. Calm Mind Duosion is a similar case, except it doesn't have a way around Thunder Wave.</p> <p><strong>Taunt and Encore Users</strong>: Pokemon like Quilladin, Pignite, Politoed, and Jumpluff can thwart Meowstic-M's ability to set up dual screens but don't particularly enjoy the chance of being statused beforehand.</p>",
    "sets": {
      "Dual Screens": {
        "description": "<p>Meowstic-M is the tier's premier support Pokemon on hyper offensive teams because of its access to Prankster Reflect and Light Screen. Dual screens is great for allowing the likes of Scraggy, Swoobat, and Huntail to set up with a bit more safety in front of opposing threats. Psychic gives Meowstic-M some offensive presence, doing notable damage to common switch-ins like Dustox and Vibrava that want to remove its dual screens and Poison-types that might want to set up hazards on it like Whirlipede and Trubbish. Psychic also ensures Meowstic isn't completely Taunt fodder. Thunder Wave cripples fast attackers that might try to set up on it, such as Jumpluff, Moxie Scraggy, and Swoobat.</p> <p>Meowstic-M works best on hyper offensive teams looking for dual screens support in order to give their setup Pokemon like Simipour, Klang, and Sawsbuck a better opportunity to break or sweep the opposing team. Defog users like Dustox and Vibrava remove the dual screens that Meowstic-M sets up, so deterrents like offensive Wigglytuff and Servine are appreciated to keep them up. Taunt users like Scraggy, Krokorok, and Pignite all help thwart these Defoggers as well. Bulk Up Scraggy and Krokorok completely wall Meowstic-M and either set up on it or remove its item with Knock Off, respectively, so teammates like Jumpluff and Carbink are helpful for stopping them.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 601970, "username": "sleid"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 226429, "username": "Jett"}, {"user_id": 543866, "username": "5Dots"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}, {"user_id": 384270, "username": "autumn"}]}]}
  },
  "Vibrava": {
    "comments": "<h3>Other Options</h3> <p>A specially defensive spread makes it more consistent at pivoting against special attackers like Servine and Swoobat, though this set has less value due to pivoting against a smaller amount of targets, and Electabuzz and Magmar can still 2HKO it with Hidden Power Ice.</p> <h3>Checks and Counters</h3> <p><strong>Ice-types and Ice-type Coverage</strong>: Vibrava's 4x weakness to Ice means Ice-types like Vanilluxe and Glalie can threaten to OHKO it. Some Pokemon, like Electabuzz and Magmar, sport Ice-type coverage and can 2HKO it, preventing it from being a safe switch-in to them.</p> <p><strong>Wallbreakers</strong>: Even with full defensive investment, Vibrava has mediocre stats, meaning that wallbreakers like Servine, Simipour, and Simisage can easily muscle through it and 2HKO or even OHKO it with Ice-type coverage.</p> <p><strong>Setup Sweepers</strong>: With Vibrava's only options of deterring setup being U-turn and Toxic, setup sweepers like Huntail, Scraggy, and Duosion can easily spiral out of control through their boosts, able to use it as a free setup opportunity.</p> <p><strong>Status</strong>: Toxic and burn from Pokemon like Gigalith, Lairon, and Gourgeist formes limit Vibrava's longevity and stifle its effectiveness as both a Defogger and pivot.</p> <p><strong>Fairy-types</strong>: While uncommon, Wigglytuff and Carbink can 2HKO Vibrava with their STAB options; however, offensive Carbink variants are less reliable and can get 2HKOed back by Vibrava's STAB moves.</p>",
    "sets": {
      "Defog": {
        "description": "<p>Vibrava is a premier Defogger, distinguishing itself through its resistance to Stealth Rock, Volt Switch immunity, and unique defensive profile. Earthquake is the preferred STAB move, 2HKOing Electabuzz and Magmar. Earth Power makes it more consistent against Lairon, always OHKOing it, though Earth Power is mainly used for that matchup, and Earthquake's superior power makes it the inferior move otherwise. U-turn enables Vibrava to escape bad matchups against Pokemon like Simipour, Simisage, and Scraggy. Toxic cripples bulky threats like Politoed and Servine, preventing them from walling it. 16 Speed EVs enable Vibrava to outspeed maximum Speed Adamant Lairon.</p> <p>Teammates weak to Stealth Rock, like Jumpluff and Magmar, enjoy Vibrava's bulk and pivoting combined with its ability to consistently remove Stealth Rock. Special walls like Meganium and defensive Klang work well with it, with the former being a great Knock Off absorber and cleric, while the latter resists all of Vibrava's weaknesses, is immune to Toxic, and can pivot with Volt Switch. In turn, Vibrava covers their Fire weaknesses and can give them an easier time switching in through Defog. Vibrava's great bulk and mediocre Speed make it a great VoltTurn candidate, pairing well with other pivots like Electabuzz, Frogadier, and Furfrou, enabling them to hit the field more safely. If running Toxic, setup deterrents like Jumpluff and Volbeat can prevent Vibrava from being turned into setup fodder. In return, Vibrava can check physically offensive Pokemon like Pignite, Lairon, and Gigalith, the last two of which can otherwise consistently set up Stealth Rock. As it is immune to Volt Switch, it can halt momentum from Volt Switch users like defensive Klang and Hidden Power Grass variants of Electabuzz, though it must be wary of Toxic and Ice-type coverage.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 543866, "username": "5Dots"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 226429, "username": "Jett"}, {"user_id": 601970, "username": "sleid"}]}, {"name": "Grammar checked by", "members": [{"user_id": 470115, "username": "SolarBeam"}]}]}
  },
  "Glaceon": {"sets": {"Choice Specs": {}}},
  "Gourgeist-Small": {"sets": {"All-Out Attacker": {}, "SubSeed": {}, "Defensive": {}}},
  "Gourgeist-Large": {
    "comments": "<h3>Other Options</h3> <p>Rocky Helmet can replace Colbur Berry and Leftovers to punish physical attackers and U-turn users like Furfrou, Vibrava, and Persian. Unlike Will-O-Wisp, Toxic punishes burn-immune Pokemon like Magmar and Pignite and wears foes down more over an extended time on the field, but burns are usually more useful against the physically offensive foes like Gourgeist-L targets. Gourgeist-L could run Seed Bomb instead of Foul Play for more damage on foes like Krokorok, Politoed, and Whiscash, but this leaves it considerably more passive versus targets like Sawsbuck, Klang, and Simisage.</p> <h3>Checks and Counters</h3> <p><strong>Special Attackers</strong>: Many special attackers exploit Gourgeist-L's lower special bulk and fear Will-O-Wisp less than physical attackers. Frogadier, Vanilluxe, and Glaceon easily OHKO Gourgeist-L with Ice Beam. Other special attackers like Simipour, Simisage, Servine, and Electabuzz commonly run Fire- and Ice-type coverage moves. However, all special attackers should be wary of accumulating chip damage from Gourgeist-L's status moves.</p> <p><strong>Fire-types</strong>: Magmar and Pignite take little damage from Foul Play and switch in safely on Will-O-Wisp. Magmar easily OHKOes Gourgeist-L with Fire Blast, and Pignite can 2HKO it with Flare Blitz or set up with Curse. Neither Fire-type enjoys chip damage from Gourgeist-L's Leech Seed though, and they must watch their HP switching in repeatedly if Stealth Rock is up.</p> <p><strong>Duosion</strong>: Foul Play does little damage to Duosion, while Will-O-Wisp and Leech Seed are ineffective against Magic Guard sets. Duosion can exploit Gourgeist-L to set up with Calm Mind or Acid Armor. Regenerator Duosion is somewhat annoyed by the passive damage of Leech Seed and Will-O-Wisp, but it can intercept these status conditions for its teammates and put Gourgeist-L into difficult positions with Future Sight.</p> <p><strong>Toxic</strong>: Toxic puts Gourgeist-L on a timer, limiting it as a wall. Gigalith, Lairon, and Furfrou are common physical attackers that run Toxic to punish Gourgeist-L and other walls. However, these Pokemon must be wary about Gourgeist-L burning them in return.</p> <p><strong>Encore, Taunt, and Substitute</strong>: Politoed can lock Gourgeist-L into Synthesis, and Jumpluff can safely lock it into Leech Seed and Synthesis. Foes like Krokorok and Quilladin can shrug off Foul Play while debilitating Gourgeist-L with Taunt. SubTox Whiscash can lure Gourgeist-L in to use it as setup fodder, and its and Calm Mind Golduck's Susbtitutes are not broken by Gourgeist-L's Foul Play either. However, only Jumpluff and Quilladin can risk switching into Leech Seed, and none of them want to take Will-O-Wisp.</p>",
    "sets": {
      "Physical Wall": {
        "description": "<p>Gourgeist-L is a competent wall against common physical attackers like Gigalith, Lairon, Persian, and Furfrou thanks to its great physical bulk, unique typing, and reliable recovery. Will-O-Wisp is especially threatening to physical setup sweepers such as Sawsbuck, Gogoat, and Jumpluff. Leech Seed wears down Pokemon that can shrug off burns such as Restalk Klang, Bulk Up Scraggy, and Dragonair. Foul Play takes advantage of the physical attackers and setup sweepers Gourgeist-L checks, turning their high Attack stats and boosts against them. Colbur Berry dampens the damage from common Knock Off users like Krokorok, Persian, and Dragon Dance Scraggy, giving Gourgeist-L a chance to burn these foes and wall them. However, Leftovers increases Gourgeist-L's longevity and makes it less reliant on Synthesis. 24 EVs in Speed gives Gourgeist-L the jump on offensive Lairon sets, while the rest of its EVs are invested to maximize its physical bulk. Frisk is useful for scouting foes' items.</p> <p>Gourgeist-L fits on more balanced teams looking for a physically defensive backbone. Specially defensive Pokemon like Swalot, Dustox, and Bulk Up Scraggy cover Gourgeist-L's special vulnerabilities and take Toxic for it, as Gourgeist-L struggles with both special attackers and chip damage from status; in turn, they appreciate Gourgeist-L's great physical bulk. Fire-types such as Pignite and Magmar are problematic for Gourgeist-L given their burn immunity, Eviolite-backed bulk, and strong STAB moves to break through Gourgeist-L, so it relies on partners such as Marshtomp, Whiscash, and Carbink to cover its poor matchup against Fire-types. Wigglytuff's Heal Bell heals Toxic status that Gigalith, Lairon, and Furfrou might inflict on Gourgeist-L. In turn, Gourgeist-L's Attack-lowering burns and physical bulk give Wigglytuff more opportunities to use Wish. Ice-types like Vanilluxe, Glaceon, and Glalie are dangerous for Gourgeist-L, so it benefits from the support of Pokemon like Magmar, Pignite, and Klang. Gourgeist-L can use Leech Seed on its checks even if it cannot beat them one-on-one, which provides support for its partners that lack their own reliable recovery such as Politoed, Pignite, and Klang.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 452572, "username": "missangelic"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 601970, "username": "sleid"}, {"user_id": 543866, "username": "5Dots"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Ivysaur": {
    "comments": "<h3>Other Options</h3> <p>Sleep Powder can be used as an alternative over Leech Seed or Giga Drain to deal with checks and is Ivysaur's most effective way of crippling Swalot. However, Leech Seed is more effective in most other matchups, and this makes Ivysaur shakier against the Pokemon it wants to check, like Politoed and Krokorok. An EV spread of 248 HP / 164 SpA / 96 Spe turns Ivysaur into more of a stallbreaker, more consistent at checking Grass-types like Servine and Gogoat at the cost of giving up some of its bulk.</p> <h3>Checks and Counters</h3> <p><strong>Poison-types</strong>: Ivysaur struggles to make progress against Poison-types like Swalot and Dustox; Swalot can repeatedly whittle its Synthesis PP down with various attacks, while Dustox can freely pivot to another check or even phaze it with Whirlwind. Spikes setters like Trubbish and Whirlipede aren't threatened too much by its STAB moves and can freely set up Spikes against it. However, all of them can get overwhelmed by its sun sweeper set.</p> <p><strong>Steel-types</strong>: Steel-types like Klang, Bronzor, and Lairon resist Ivysaur's STAB combination and can set up on it or attack it outright even when it runs Knock Off and Leech Seed, though none of them enjoy dealing with offensive Ivysaur.</p> <p><strong>Fire-types</strong>: Fire-types like Magmar and Pignite resist Giga Drain and can threaten massive damage against Ivysaur with their STAB moves. They don't like getting poisoned by Sludge Bomb or losing their Eviolite, however.</p> <p><strong>Knock Off Users</strong>: Without its Eviolite, Ivysaur can struggle to stomach hits; Knock Off users like Scraggy, Simisage, and Krokorok can lower its effectiveness as a wall.</p> <p><strong>Strong Attackers</strong>: Ivysaur can get overwhelmed by super effective coverage from attackers like Frogadier, Swoobat, and Vanilluxe. However, all of them struggle against offensive Ivysaur.</p> <p><strong>Residual Damage</strong>: Even with terrific bulk and a Toxic immunity, Ivysaur is vulnerable to entry hazards and burn, both of which can cripple its longevity and can make it harder for it to perform as a wall, which is made worse by Synthesis's low PP. Hippopotas's Sand Stream cuts Synthesis's effectiveness, stacks up residual damage, and removes sun, negating much of Ivysaur's offensive presence.</p>",
    "sets": {
      "Defensive": {
        "description": "<p>Armed with excellent bulk and solid utility options, Ivysaur stands out as an elite defensive Pokemon. Knock Off cripples walls and checks like Dustox, Bronzor, and Quilladin, Pokemon that would otherwise freely switch into it. Giga Drain makes Ivysaur more consistent against Grass-weak targets like Gigalith, Huntail, and Krokorok, while Leech Seed can force the aforementioned checks as well as Steel-types like Klang to switch out and supplies Ivysaur additional recovery. The EV spread prevents a 2HKO from Politoed's Ice Beam and a 3HKO from non-Choice Band Krokorok. While Chlorophyll is situational, under sun, Ivysaur can outspeed everything up to Murkrow.</p> <p>Ivysaur fits best on bulky and balance teams that appreciate its bulk and typing, checking Pokemon like Servine, Electabuzz, and Gigalith. Offensive wallbreakers like Pignite and Simipour appreciate Ivysaur removing items through Knock Off, making it easier to break through checks like Carbink and Dustox later in the game. Ivysaur's passivity leaves it vulnerable to Fire-types like Pignite and Magmar and wallbreakers like Frogadier and Swoobat, so other walls like Politoed and defensive Klang are appreciated. Outside of Knock Off and Leech Seed, Ivysaur fails to threaten Steel-types, so checks to them like Krokorok and Magmar are appreciated as well. Knock Off absorbers like Carbink and Wigglytuff are also appreciated to maintain its usefulness as a wall.</p>"
      },
      "Sun Sweeper": {
        "description": "<p>Ivysaur is a staple on sun teams thanks to its great bulk bolstered by Eviolite, solid power, and variety of coverage moves. Growth augments its offensive potential, making it even scarier to face off against. Solar Beam is preferred thanks to its massive damage output under sun; Giga Drain can be used outside of sun and gives Ivysaur additional longevity. Hidden Power Fire is Ivysaur's strongest option against foes resistant to its STAB moves, like Dustox, Bronzor, and Klang.</p> <p>Sun setters like Volbeat and Graveler are essential to allow Ivysaur opportunities to wallbreak or sweep under sun; Volbeat can cripple checks with Thunder Wave and Encore, while Graveler can provide Stealth Rock and momentum with Explosion. Other sun sweepers like Sawsbuck and Jumpluff are also useful partners, appreciating Ivysaur weakening checks like Swalot and Bronzor. In turn, they can help take on Fire-types and defensive Duosion, checks that Ivysaur struggles to get past. Fire-types like Magmar and Pignite stand out as great partners, weakening the aforementioned checks so Ivysaur can have an easier time cleaning late-game. In turn, Ivysaur can help break through Water- and Rock-types that they struggle against.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 543866, "username": "5Dots"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 226429, "username": "Jett"}, {"user_id": 601970, "username": "sleid"}]}, {"name": "Grammar checked by", "members": [{"user_id": 470115, "username": "SolarBeam"}]}]}
  },
  "Wartortle": {"sets": {"Physically Defensive": {}, "Specially Defensive": {}}},
  "Butterfree": {"sets": {"Quiver Dance": {}}},
  "Beedrill": {"sets": {"Toxic Spikes": {}, "Swords Dance": {}}},
  "Pidgeot": {"sets": {"Defog": {}, "Choice Scarf": {}}},
  "Raticate": {"sets": {"Guts": {}, "Choice Band": {}, "Choice Scarf": {}}},
  "Fearow": {"sets": {"Choice Band": {}, "Choice Scarf": {}}},
  "Sandshrew": {"sets": {"Hazard Utility": {}}},
  "Wigglytuff": {
    "comments": "<h3>Other Options</h3> <p>Knock Off can be used over Dazzling Gleam on the defensive set to give it added utility, though this makes its matchups against Dark- and Dragon-types like Krokorok, Mightyena, Vibrava, and Dragonair more complicated. Thunder Wave can similarly be chosen over Heal Bell or Stealth Rock to have a better matchup against offensive teams, but its utility is more difficult to fit than the aforementioned moves.</p> <h3>Checks and Counters</h3> <p><strong>Poison-types and Poison-type coverage</strong>: Swalot is arguably Wigglytuff's greatest check, able to consistently avoid the 2HKO after Stealth Rock from any of its moves and retaliate with threatening STAB moves, which can be further accentuated with Assault Vest. Other Poison-types like Dustox and Ivysaur can threaten Toxic or their own STAB moves to exhaust Wish and Heal Bell PP, but they struggle against coverage from offensive sets.</p> <p><strong>Steel-types</strong>: Steel-types like Bronzor, Lairon, and Klang can use Wigglytuff's defensive sets as setup fodder and take pittance from its attacks. However, they are greatly threatened by coverage from offensive sets.</p> <p><strong>Wallbreakers</strong>: Special or mixed wallbreakers like Magmar, Simipour, and Simisage can blast through Wigglytuff with powerful STAB moves without too much trouble, especially if it's not running defensive sets. Even with full bulk investment, physical attackers like Choice Band Furfrou and Swords Dance Sawsbuck can deal a lot of damage to Wigglytuff.</p> <p><strong>Setup Sweepers</strong>: Due to Wigglytuff's passivity, setup sweepers like Sawsbuck, Gogoat, Double Dance Duosion, and Swoobat can all use it as setup fodder, though they falter against offensive sets.</p>",
    "sets": {
      "Defensive Utility": {
        "description": "<p>Wigglytuff distinguishes itself from defensive staples by being one of the few clerics in the tier—with rare access to Wish, decent bulk, and a helpful typing—that checks important threats like Krokorok and Scraggy. The combination of Wish and Protect can heal both its teammates and itself; Protect can also scout for Choice item users like Magmar and Vanilluxe. Dazzling Gleam is preferred to cover targets like Krokorok, Vibrava, Scraggy, and Mightyena. Heal Bell makes Wigglytuff a cleric, allowing Wigglytuff to heal its teammates and absorb status; Stealth Rock can be used if the team needs to fit an entry hazard setter.</p> <p>Wigglytuff fits best on defensive and balanced builds, giving needed longevity for its teammates over the course of a game, though it should not be relied on as the team's sole physical wall. Defensive stalwarts like Swalot and Bronzor form great defensive cores with it; both can take on opposing Poison- and Steel-types like Ivysaur and Klang while being reliable backbones against physical attackers. If running Heal Bell, Wigglytuff can free them from Rest cycles. Attackers like Krokorok, Electabuzz, and Magmar greatly appreciate Wigglytuff's large Wish, which gives them a cushion against attacks and addresses their lack of recovery. Entry hazards can force Wigglytuff to be more passive by entering Wish + Protect cycles, so hazard removers like Dustox and Vibrava can make it less reliant on those cycles for longevity. If running Stealth Rock, wallbreakers like Simipour and Sawsbuck can greatly benefit from the residual damage—being able to consistently 2HKO threats like Servine and Swalot, respectively—while also benefitting from Wigglytuff's Wishes. Special wallbreakers like Magmar and Simipour can break through Wigglytuff, so special walls like Duosion and Meganium can respectively check these threats.</p>"
      },
      "Offensive Stealth Rock": {
        "description": "<p>Wigglytuff's deep coverage, acceptable offensive stats, and ability Competitive make it an adept offensive Stealth Rock setter and Defog deterrent. Fire Blast 2HKOes Grass-types like Servine, Gogoat, and Ivysaur; Steel-types like Bronzor and Klang; and Dustox. Focus Blast OHKOes Rock-types like Lairon and, after Stealth Rock, Gigalith; OHKOes Normal-types like Persian and Furfrou; and threatens special defensive Klang. Knock Off cripples special walls like Duosion and Seaking. Life Orb powers up Wigglytuff's coverage moves and enables it to reach the aforementioned thresholds. Competitive lets it discourage Defog users like Vibrava and Dustox from removing entry hazards. Psychic is a perfectly accurate coverage option that catches defensive Swalot off guard and maintains coverage against Ivysaur and Dustox.</p> <p>This Wigglytuff set fits best on more offensive builds, sacrificing its cleric abilities to become a deadly offensive Stealth Rock setter, which lets it pressure Defog users like Dustox and Vibrava and opposing Stealth Rock setters like Krkorok, Bronzor, and Gigalith. Swalot is a serious threat to it, consistently avoiding the 2HKO from attacks and threatening it back with its own STAB moves; Ground- and Psychic-types like Krokorok and Duosion can threaten serious damage back. Spikes setters like Whirlipede and Glalie can rack up more residual damage and reinforce Wigglytuff's role as an entry hazard deterrent with Competitive; they can provide additional utility with Toxic and Taunt, respectively. Special sweepers like Servine, Simisage, and Simipour can also work together to overwhelm special checks such as Meganium and Seaking. Thunder Wave users like Duosion and Electabuzz can address Wigglytuff's low Speed. Given its lacking bulk, pivots like Electabuzz, Jumpluff, and Furfrou are greatly appreciated to help it get in safely. These pivots take advantage of Wigglytuff's ability to threaten checks in Bronzor, Scraggy, and Gourgeist-L.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 543866, "username": "5Dots"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 296755, "username": "5gen"}, {"user_id": 601970, "username": "sleid"}]}, {"name": "Grammar checked by", "members": [{"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Persian": {
    "comments": "<h3>Other Options</h3> <p>Taunt can surprise walls like Bronzor and Quilladin, preventing them from using their utility moves, though it is difficult to drop one of Persian's coverage moves. Double-Edge can be used over Return for the extra power, achieving benchmarks like OHKOing Vanilluxe and Magmar after Stealth Rock and Spikes and also having more favorable damage rolls against offensive Pokemon like Simipour and Swoobat, though the recoil damage cuts into Persian's already low bulk. Leftovers makes Persian fare better in entry hazard-stacking matchups, though Persian doesn't tank hits well enough for it to be useful. Nasty Plot sets can surprise anticipated switch-ins like Lairon and Hippopotas with Technician-boosted coverage in Hidden Power Fighting and Water Pulse. Shadow Ball helps Persian punch through Gourgeist-L. However, Persian still lacks sufficient power at +2, struggles with setup due to its low bulk, and often cannot fit the coverage it needs.</p> <h3>Checks and Counters</h3> <p><strong>Rock-types</strong>: Rock-types like Gigalith, Carbink, and Lairon are Persian's worst matchups, taking a pittance from any of its attacks and setting up Stealth Rock or retaliating with their STAB moves. Offensive variants of the last two can even use it as setup fodder.</p> <p><strong>Ghost-types</strong>: While not as immediately threatening as the aforementioned Rock-types, Ghost-types like Gourgeist formes and Dusclops can still easily switch into Persian's attacks and cripple it with Will-O-Wisp or whittle it away with utility options like Seismic Toss or and Leech Seed. However, Dusclops doesn't appreciate being hit with Knock Off.</p> <p><strong>Steel-types</strong>: While Steel-types like Lairon, Klang, and Bronzor do not appreciate Knock Off, they have the bulk and power to shrug off anything Persian does and can make use of their utility options. Klang and Bronzor also run Rest to negate any damage Persian can inflict on them, forcing it to pivot out.</p> <p><strong>Physical Walls</strong>: Defensive behemoths like Swalot, Quilladin, and Hippopotas can use their naturally high bulk to weather Persian's attacks, chip it down with their STAB moves, use their recovery moves to increase their longevity, and take advantage of it with their utility options.</p> <p><strong>Choice Scarf Users</strong>: While Persian is the fastest unboosted attacker in the metagame, it falls short of Choice Scarf users that can outpace it. Choice Scarf users like Simipour, Simisage, and Magmar can take it out with some prior damage.</p>",
    "sets": {
      "Revenge Killer": {
        "description": "<p>As the tier's fastest unboosted Pokemon, Persian establishes itself as an elite revenge killer. Technician-boosted Fake Out chips away at fast attackers like Jumpluff, Frogadier, and Simipour, which can put them into KO range of Return. Knock Off cripples defensive switch-ins like Bronzor, Gigalith, and Lairon, while U-turn pivots away from the aforementioned Pokemon.</p> <p>Persian's excellent Speed and utility movepool enable it to fit on a variety of VoltTurn teams. Volt Switch and U-turn users like Electabuzz, Pikachu, and Frogadier stand out as great examples of fast pivots that can build up momentum against the opposition. Slow pivots like Dustox, Vibrava, and defensive Klang enable Persian to hit the field more safely, with the first two even reducing Persian's susceptibility to entry hazards via Defog. Even with Knock Off and U-turn, Persian severely struggles against Rock- and Steel-types like Gigalith and Klang; checks to them like Hippopotas and Pignite can address these weaknesses. Physical walls like Ivysaur and Hippopotas can be difficult for Persian to break down, even with Knock Off, so wallbreakers like Choice Specs Vanilluxe and Magmar can give Persian an easier time cleaning late-game.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 543866, "username": "5Dots"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 601970, "username": "sleid"}, {"user_id": 296755, "username": "5gen"}]}, {"name": "Grammar checked by", "members": [{"user_id": 569291, "username": "zinnias"}, {"user_id": 470115, "username": "SolarBeam"}]}]}
  },
  "Golduck": {"sets": {"Rain Attacker": {}, "Calm Mind": {}}},
  "Tentacool": {"sets": {"Defensive": {}}},
  "Graveler": {"sets": {"Suicide Lead": {}}},
  "Slowpoke": {"sets": {"Physically Defensive": {}}},
  "Magnemite": {"sets": {"Magnet Pull": {}}},
  "Gastly": {"sets": {"Substitute + 3 Attacks": {}, "SubDisable": {}, "Choice Scarf": {}}},
  "Hypno": {"sets": {"Nasty Plot": {}, "Cleric": {}}},
  "Seaking": {"sets": {"Specially Defensive": {}}},
  "Electabuzz": {
    "comments": "<h3>Other Options</h3> <p>Thunder Wave is an option for teams that benefit from the speed control it provides. Discharge fulfills a similar idea of spreading paralysis, but generally Thunderbolt is much preferred due to its higher power.</p> <h3>Checks and Counters</h3> <p><strong>Electric-immune Pokemon</strong>: Lightning Rod and Volt Absorb users such as Seaking and Chinchou make for excellent Electabuzz answers, as they can shrug off any of its attacks. Ground-types such as Vibrava, Krokorok, Whiscash, and Hippopotas can block Electabuzz's Volt Switch, but only Hippopotas does not need to be mindful of its coverage.</p> <p><strong>Grass-types</strong>: Bulky Grass-types such as Servine, Gogoat, Ivysaur, and Meganium can handle Electabuzz relatively well, but the first two must be wary of switching into Toxic.</p> <p><strong>Specially Defensive Pokemon</strong>: Duosion, Bronzor, and Dustox do not mind switching into any of Electabuzz's attacks. Duosion in particular is a problem for Electabuzz, as it can shrug off Volt Switch damage without needing to heal thanks to Regenerator.</p> <p><strong>Revenge Killers</strong>: Despite Electabuzz being one of the fastest Pokemon in the metagame, it is still susceptible to being revenge killed by Choice Scarf users like Krokorok and Sawsbuck as well as naturally faster Pokemon such as Persian and Swoobat.</p>",
    "sets": {
      "Offensive Pivot": {
        "description": "<p>With Speed like lightning, a solid Special Attack stat, and a wide movepool, Electabuzz is the metagame's premier all-out special attacker. Volt Switch lets Electabuzz keep up tempo against Grass-types like Servine, Gogoat, and Meganium and bulky special walls like Duosion and Swalot, which are common switch-ins. Focus Blast nails Steel-types like Klang and Lairon and threatens an OHKO on even offensive Eviolite Krokorok. Alternatively, Toxic can be used to wear down some foes that Electabuzz is unable to immediately break past such as Seaking and Chinchou. Hidden Power Ice nails both Grass- and Ground-types like Simisage, Sawsbuck, and Hippopotas and is particularly useful against Vibrava, whereas Hidden Power Grass is unable to deal with Grass-types but is much better against Whiscash and Marshtomp. Static is useful against fast attackers like Persian and Choice Scarf users such as Furfrou and Sawsbuck, while Vital Spirit is preferred to allow Electabuzz to reliably check Jumpluff.</p> <p>As the premier Volt Switch user, Electabuzz is a staple of VoltTurn teams; some common partners include Persian, Frogadier, Vibrava, and Dustox. Entry hazard setters such as Gigalith, Quilladin, and Whirlipede can further amplify the effectiveness of the VoltTurn archetype. Grass-types like Simisage, Servine, and Gogoat can cover for Electabuzz's Ground weakness, and in return, Electabuzz can switch into and revenge kill most Flying-types. Electabuzz often forces Grass-types to switch in, so Fire- and Flying-types like Pignite, Magmar, and Jumpluff make for great partners, with Pignite and Magmar also benefitting from Electabuzz checking Flying- and Water-types, respectively. Strong physical attackers such as Choice Band Krokorok and Murkrow are also useful teammates, as they can Pursuit trap Duosion and Bronzor and break down other specially defensive walls such as Dustox and Swalot, which Electabuzz struggles with.</p>"
      },
      "Choice Scarf": {
        "description": "<p>With Choice Scarf, Electabuzz can outspeed the entire unboosted metagame as well as most other Choice Scarf users, making it a great revenge killer and solid cleaner. Volt Switch can gain momentum on several Choice Scarf users like Simipour and Frogadier. Focus Blast nails Choice Scarf Krokorok and +2 Speed Klang. Hidden Power Ice hits Grass-types, most notably Jumpluff, and Ground-types, while Hidden Power Grass can revenge kill +2 Speed Whiscash. Psychic is also an option for Poison-types like Swalot and Ivysaur and Fighting-types like Pignite.</p> <p>Choice Scarf Electabuzz is even more dependent on removing Ground-types and other Electric-immune Pokemon, as this eases prediction and allows it to freely use Volt Switch. Some good options that can deal with Ground-types include Ivysaur, Sawsbuck, the Gourgeist formes, Simipour, Politoed, and Vanilluxe. Physical wallbreakers such as Pignite, Lairon, and Furfrou can take down specially defensive Pokemon that Electabuzz hates, increasing the likelihood of it cleaning games. Due to Electabuzz's lack of recovery and susceptibility to entry hazards, Wish and Healing Wish users like Wigglytuff, Chimecho, and Lopunny and hazard removers such as Dustox, Vibrava, and Sandshrew make for great teammates.</p>"
      },
      "Choice Specs": {
        "description": "<p>Choice Specs Electabuzz is a deadly wallbreaker with a wide movepool to hit Electric-immune and -resistant Pokemon while still serving as a great pivot. The additional power Choice Specs provides lets Electabuzz more easily break past even bulky foes; Thunderbolt picks up an OHKO on Politoed and 2HKOs on neutral targets such as Carbink and Dustox after Stealth Rock. Focus Blast secures 2HKOs on Bulk Up Scraggy and specially defensive Klang. Hidden Power Ice is able to OHKO Vibrava and Jumpluff, while Hidden Power Grass can OHKO Whiscash and Marshtomp. Psychic lands a 2HKO on Dustox and most Swalot sets.</p> <p>Physical attackers like Pignite, Swalot, and Persian greatly appreciate Electabuzz's ability to reliably weaken physically defensive walls such as Vibrava, Bronzor, and Gigalith. Knock Off users such as Servine, Simipour, and Simisage can remove Leftovers or Eviolite from Gogoat, Duosion, and Hippopotas, which helps bring them into Electabuzz's cleaning range. Similarly, entry hazard setters like Carbink, Trubbish, and Frogadier support Electabuzz's pivoting efforts greatly by further wearing down resistant Pokemon. Choice Scarf users and setup sweepers like Magmar, Krokorok, Klang, and Jumpluff make for ideal teammates, as they can best exploit the foes that Electabuzz weakens.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 226429, "username": "Jett"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 543866, "username": "5Dots"}, {"user_id": 601970, "username": "sleid"}]}, {"name": "Grammar checked by", "members": [{"user_id": 569291, "username": "zinnias"}, {"user_id": 470115, "username": "SolarBeam"}]}]}
  },
  "Magmar": {
    "comments": "<h3>Other Options</h3> <p>Magmar can run Psychic as its last move on its all-out attacker set to catch Pignite off guard, but dropping Toxic loses out on the ability to cripple Politoed and Carbink. Hidden Power Steel is a very niche pick to KO Carbink, but removing a coverage option for a move that hits one Pokemon is less than ideal.</p> <h3>Checks and Counters</h3> <p><strong>Rock-types</strong>: Magmar can't do much against Carbink aside from hitting it with Toxic, which it can use Rest to heal off. However, Carbink does have to be wary of switching in against a Choice Specs Hidden Power Grass if it is not at full health. Gigalith can switch into a Choice-locked Fire-type move or Psychic, but it struggles against everything else.</p> <p><strong>Water-types</strong>: All Water-types do not take a Choice Specs Hidden Power Grass well at all, since all but Politoed are OHKOed after Stealth Rock damage. However, Politoed can take attacks from other sets quite well, but does have to watch out for Toxic because Leftovers is its only form of recovery. Simipour and Frogadier can switch into an attack and threaten to OHKO Magmar back; however, they have to be wary of Choice Scarf sets because they can be 2HKOed by Fire Blast after Stealth Rock.</p> <p><strong>Pignite</strong>: All-out attacker Magmar is greatly threatened by Pignite, since it can only really threaten it with Toxic. Choice Specs Magmar can OHKO Pignite with Psychic after Stealth Rock damage, as well as 2HKOing it with Focus Blast. Choice Scarf Magmar has to catch Pignite with Psychic, or it will be forced to switch out.</p> <p><strong>Neutral Special Walls</strong>: Duosion and Dusclops easily take on Magmar's attacks while not being bothered by Toxic. However, Duosion is at risk of being 2HKOed by Choice Specs Fire Blast if Stealth Rock is up.</p> <p><strong>Fast Attackers</strong>: Persian, Simisage, and Choice Scarf Krokorok can take out non-Choice Scarf Magmar after some chip damage. Choice Scarf users like Electabuzz, Frogadier, and Sawsbuck can outspeed even Choice Scarf Magmar.</p>",
    "sets": {
      "All-out Attacker": {
        "description": "<p>Magmar is a solid offensive presence with its powerful Special Attack, great Speed, and perfect coverage options. Focus Blast hits common switch-ins to Fire Blast like Gigalith and Scraggy. Hidden Power Ice OHKOes Vibrava while also being a safer move to pick off weakened Grass- and Ground-types like Servine and Hippopotas. Hidden Power Grass is an alternative option to 2HKO Water- and Ground-types like Marshtomp, Simipour, and Krokorok. Toxic is a safer move for crippling common switch-ins that Magmar struggles against, like Carbink, Politoed, and Pignite. However, Flame Charge can be used instead to give Magmar the ability to act as an late-game cleaner, since it can outspeed fast attackers and Choice Scarf users like Furfrou and Krokorok, respectively. Vital Spirit is preferred over Flame Body to switch in against Sleep Powder from Jumpluff and Yawn from Meowstic; burning foes with Flame Body isn't typically worth the potential damage Magmar takes, since it already gets chipped enough with entry hazards.</p> <p>Magmar does well on balance or offensive teams looking for a special attacker that can take down a lot of popular walls like Dustox, Klang, and Meganium. Water-types like Simipour and Frogadier appreciate Magmar's ability to threaten these walls, since they struggle to take them down. In return, they can weaken Gigalith and Carbink for Magmar. Entry hazard removers like Vibrava and Dustox are appreciated as teammates to give Magmar more opportunities to enter the field. These removal options often use U-turn against targets that Magmar preys on like Bronzor and Ivysaur. Magmar is outsped and OHKOed by Frogadier and Simipour, which the likes of Duosion, Seaking, and Politoed can help switch into. Fast attackers like Simisage and Furfrou can help make up for Magmar's lack of Speed. Defensive pivot Duosion can shrug off Magmar's attacks and doesn't mind Toxic, so teammates like Scraggy and Klang are needed to help take it on. Magmar really wants to be paired with Carbink or Hippopotas, since Pignite switches into Magmar easily on and can hit it hard with STAB Superpower.</p>"
      },
      "Choice Specs": {
        "description": "<p>Choice Specs Magmar is a threatening wallbreaker in ORAS ZU with its great offensive typing and wide coverage movepool. Fire Blast 2HKOes Bulk Up Scraggy and defensive pivot Duosion after Stealth Rock. Overheat is Magmar's strongest attack, able to OHKO specially defensive Meganium and bulky Servine, which Fire Blast does not. However, Overheat often forces Magmar to switch out the next turn because it can be used as setup fodder at -2. Focus Blast picks up the OHKO on Gigalith while also being a better neutral move against the Water-types and Vibrava. Psychic is specifically for Pignite, since it shrugs off all of Magmar's other moves. Hidden Power Grass can be used to OHKO Marshtomp and Whiscash, as well as 2HKOing Politoed after Stealth Rock damage. Hidden Power Ice is a more niche option instead if Magmar wants to catch Vibrava off guard and OHKO it, but Fire Blast can 2HKO it after some slight chip damage. Vital Spirit is preferred over Flame Body so it can switch in against Sleep Powder from Jumpluff and Yawn from Meowstic, although Flame Body has the niche of punishing U-turn from Dustox or Persian.</p> <p>Magmar works well on teams looking for a special wallbreaker so that partners like Simipour, Servine, and Vanilluxe can sweep. Entry hazard removers like Vibrava and Dustox are appreciated as teammates to give Magmar more opportunities to enter the field, since they often pivot out against targets that Magmar preys on like Bronzor and Ivysaur. Magmar drops to any hit from Water-types like Politoed, Frogadier, and Simipour, so teammates like Servine, Meganium, and Gogoat are appreciated to handle them. Normal-resistant Pokemon like Gigalith, Carbink, and Lairon make good teammates, since they can take on Persian and Furfrou, which would otherwise easily take out Magmar. Specially defensive Swalot can take hits with ease and hit back hard with Earthquake, so Magmar appreciates being paired with the likes of Duosion and Lunatone to help switch into it. Revenge killers like Furfrou, Persian and Sawsbuck can pick it off without much difficulty, so teammates like Bronzor and Swalot do well at punishing them.</p>"
      },
      "Choice Scarf": {
        "description": "<p>Choice Scarf Magmar is one of the strongest revenge killers with its wide range of coverage moves and solid Speed to outrun the majority of the tier. Overheat is Magmar's most powerful move, denting many unexpecting fast targets like Persian, Choice Scarf Krokorok, and Electabuzz, although it has to be careful of becoming setup fodder after dropping its Special Attack. Focus Blast 2HKOes many common switch-ins like Gigalith and Scraggy after slight chip damage. Psychic does well at safely picking off targets like Pignite, Dustox, and Swalot; it also has a high chance to 2HKO all three after Stealth Rock. Hidden Power Ice catches Vibrava off guard with an OHKO after minimal chip damage while accurately finishing off Grass-types like Servine and Jumpluff. Hidden Power Grass hits Water- and Ground-types for big damage like Simipour, Frogadier, and Marshtomp. Vital Spirit is better for safely switching into Jumpluff's Sleep Powder and Meowstic's Yawn, but Flame Body can be helpful for catching U-turn users like Persian and Dustox, but the risk isn't usually worth the low reward chance.</p> <p>Magmar works well on balance or offensive teams looking for speed control and a strong revenge killer. Grass-types like Servine, Gourgeist-L, and Ivysaur do well at taking hits from common switch-ins to Magmar like Politoed, Gigalith, and Carbink. The likes of Simipour, Servine, and Swoobat are appreciated as teammates, since they can break down special walls like Duosion and Swalot, leading the way for Magmar to clean. Entry hazard removers like Dustox and Vibrava make for good teammates, since they can limit the chip damage Magmar takes. Barring Psychic, Pignite switches into Magmar with ease, so teammates like Carbink and Hippopotas are needed to check it.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 601970, "username": "sleid"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 296755, "username": "5gen"}, {"user_id": 543866, "username": "5Dots"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Ditto": {"sets": {"Revenge Killer": {}}},
  "Dragonair": {"sets": {"Bulky Dragon Dance": {}, "Offensive Dragon Dance": {}}},
  "Meganium": {"sets": {"Special Wall": {}, "Swords Dance": {}}},
  "Chinchou": {"sets": {"Specially Defensive Pivot": {}}},
  "Natu": {"sets": {"Magic Bounce Pivot": {}}},
  "Sudowoodo": {"sets": {"Offensive Stealth Rock": {}}},
  "Politoed": {
    "comments": "<h3>Other Options</h3> <p>Focus Blast offers strong coverage generally, but it lacks specific targets to make up for its inaccuracy. Choice Scarf sets can get the jump on some noticeable targets if the opponent is unaware, although these sets lack either the defensive reliability or power that the other sets excel at. Perish Song + Whirlpool sets offer a different stallbreaking option than Encore; however, these sets make Politoed more passive, which can sink momentum. No Item + Thief can be opted for over Protect as a means to debilitate Eviolite-reliant counters, but the lack of Leftovers and the risk of stealing a useless or debilitating item like Dustox's Black Sludge usually means that item removal is a better fit for Politoed's teammates. Substitute is another option on Leftovers sets that prefer more Speed, as it gives Politoed an extra burn chance and allows for safer Toxics against foes that want to switch in on it like Swalot, Sawsbuck and Ivysaur.</p> <h3>Checks and Counters</h3> <p><strong>Dustox</strong>: Dustox is immune to Scald burns due to its ability Shield Dust. Additionally, it can use Toxic to completely shut down Politoed, all while having the bulk and recovery to consistently function as a safe switch-in except versus Choice Specs Hydro Pump.</p> <p><strong>Duosion</strong>: Specially defensive Duosion tanks Politoed's unboosted hits, and, thanks to Regenerator, it can generally leave unscathed. Double Dance sets are in jeopardy of getting hit by Encore, though.</p> <p><strong>Grass-types</strong>: Faster Grass-types like Servine, Simisage, and Sawsbuck can force out Politoed, although they risk a strong Ice Beam if they attempt to set up versus it.</p> <p><strong>Revenge Killers</strong>: Stronger revenge killers like Electabuzz, Choice Specs Vanilluxe, and Choice Band Furfrou favorably trade hits against Politoed, and they will force it out once at low health; scouting with Protect can deter the Choice-locked revenge killers, however.</p> <p><strong>Status</strong>: Politoed doesn't do well when taking residual damage from poison or burn due to its only form of recovery being Leftovers. It needs to be wary of Toxic from the likes of Dustox and Gigalith, as well as Will-O-Wisp from Dusclops and Solrock.</p>",
    "sets": {
      "Tank": {
        "description": "<p>Politoed is a multifaceted offensive tank and bulky Water-type. The threat of a strong Scald backed up by Ice Beam to hit Grass-types like Servine and Jumpluff makes Politoed hard to switch into. Access to Water Absorb and great defensive stats also make Politoed a valuable defensive asset in a pinch against the likes of Magmar, Klang, and Simipour. Protect doubles as a means to net extra recovery from Leftovers, as well as a defense against Choice-locked attackers like Vanilluxe. Encore also pairs well with Protect because it allows Politoed to scout and then punish utility moves and weaker attacks versus slower foes like Duosion and Bronzor, all while securing additional Leftovers recovery. Encore is also very good against setup sweepers that don't care about Toxic like Scraggy and the aforementioned Duosion. Toxic is another stallbreaking option for Politoed to be more threatening versus its counters like Regenerator Duosion, although it comes at the opportunity cost of losing the safe switch against slower status users. Another consideration is Hidden Power Grass, which can be opted for if the team needs to rely on Politoed to check offensive Water-types like Simipour and Whiscash. With 16 Speed EVs, Politoed outspeeds and revenge kills Adamant Lairon.</p> <p>Politoed fits on any balance and bulky offense team that can appreciate its role compression and defensive typing. Defensive cores like Gigalith + Vibrava and Dustox + Carbink need Politoed to check threats like Simipour, Klang, and Pignite. In return, they can create a safe switch opportunity for Politoed against Pokemon like Gigalith, Vibrava, and Carbink, especially when prompting foes to trade entry hazards. Scraggy and Bronzor can absorb Future Sight from Regenerator Duosion, while Dustox and Gogoat are generally good threats to Servine. Ground-types like Krokorok and Hippopotas are great to maintain momentum versus faster Volt Switch users that can force out Politoed, and they are especially beneficial versus Choice-locked Electabuzz, given Politoed's Protect will punish revenge kill attempts.</p>"
      },
      "Choice Specs": {
        "description": "<p>Choice Specs Politoed boasts an impressive offensive movepool and still retains a lot of its defensive merit. Most notably, the extra power offers Politoed a guaranteed 2HKO versus Regenerator Duosion and Dustox with Hydro Pump. Its coverage in Ice Beam + Hidden Power Grass gives Politoed a chance to OHKO the likes of Gourgeist-L and Whiscash, respectively. Additionally, Politoed's ability Water Absorb means that even without defensive investment, it can still soft check the likes of Simipour and retaliate with Hidden Power Grass with a chance to OHKO after Stealth Rock.</p> <p>Pivots like Electabuzz and Dustox are great teammates to get Politoed in safely. Knock Off users like Servine and Persian can soften up Eviolite walls like Bronzor and Quilladin, making them more vulnerable to Politoed's wallbreaking. Swalot, Ivysaur, and Gourgeist-L are all checks to Grass-types that give Politoed a defensive backbone to rely on versus the likes of Simisage and Sawsbuck. Specially offensive sweepers like Vanilluxe and Butterfree can clean late-game after Politoed pokes holes through opposing special walls. Fast attackers like Persian and Sawsbuck make for great partners to help circumvent Politoed's mediocre Speed.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 231074, "username": "S1nn0hC0nfirm3d"}, {"user_id": 601970, "username": "sleid"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 543866, "username": "5Dots"}]}, {"name": "Grammar checked by", "members": [{"user_id": 470115, "username": "SolarBeam"}]}]}
  },
  "Jumpluff": {
    "comments": "<h3>Other Options</h3> <p>Dropping Swords Dance for Memento and using a spread of 252 HP / 4 Atk / 252 Spe, Jumpluff acts as more of a supportive Pokemon on hyper offense teams, making great use of its utility moves. Synthesis provides Jumpluff with recovery but usually isn't worth it, since Jumpluff is less bulky than other Grass-types and has a worse defensive typing that also makes it weak to Stealth Rock. Jumpluff also has a small niche on weather teams, as it is the fastest Chlorophyll user in ZU, making it a fairly reliable non-Prankster weather setter. However, it is much weaker than other Chlorophyll wallbreakers such as Sawsbuck and Ivysaur and is by no means mandatory on these teams. Jumpluff can also run a Leech Seed + Substitute set to wear down Pokemon that resist its STAB attacks, but this means giving up Swords Dance and lowering its overall damage output.</p> <h3>Checks and Counters</h3> <p><strong>Steel-types</strong>: Lairon and Klang shrug off any attacks from Jumpluff and, unless Sleep Powder is a threat, can freely set up on it. Bronzor is equally impossible to take down for Jumpluff.</p> <p><strong>Poison-types</strong>: Bulky Poison-types such as Swalot and Trubbish can handle Jumpluff's attacks fairly well, with the former also absorbing sleep fairly well due to using Sleep Talk while also threatening massive damage against it. Choice Scarf Seviper can revenge kill Jumpluff, although it may struggle to switch in safely.</p> <p><strong>Physically Defensive Walls</strong>: Magcargo and Dusclops are near impossible for Jumpluff to break past, which is only worsened by both also being able to burn it. Even Gigalith and Gourgeist-L make for decent answers despite being weak to Jumpluff's STAB attacks thanks to their naturally high physical bulk. Gigalith can tank a +2 Seed Bomb and OHKO Jumpluff back, while Gourgeist-L can just cripple Jumpluff with a burn, making it far easier to manage.</p> <p><strong>Residual Damage</strong>: Stealth Rock can make it hard for Jumpluff to set up and act as a pivot. Similarly, status like burn and poison can heavily limit setup opportunities, as Jumpluff does not run any recovery.</p> <p><strong>Vital Spirit</strong>: Electabuzz and to a lesser extent Magmar, despite being slower than Jumpluff, can still pose a great threat to it due to their immunity to Sleep Powder. Electabuzz has the added benefit of resisting Acrobatics, making it a more reliable Jumpluff answer than Magmar, which needs to be at full health to avoid a 2HKO. Magmar may sometimes run Flame Body to deter Acrobatics.</p> <p><strong>Faster Pokemon</strong>: While Jumpluff is third fastest Pokemon in the metagame, both Pokemon that are faster, Persian and Swoobat, can revenge kill it reliably. Choice Scarf Pokemon such as Simisage, Frogadier, and Vanilluxe can also outpace Jumpluff and threaten it with super effective coverage.</p>",
    "sets": {
      "Swords Dance": {
        "description": "<p>Jumpluff serves as one of the most reliable revenge killers and cleaners in ZU thanks to its incredible Speed. Swords Dance remedies its otherwise-measly Attack, which is further helped by Acrobatics's insane power at the cost of not using a held item. Sleep Powder not only provides potential setup opportunities but can shut down Pokemon Jumpluff cannot easily break past such as Lairon, Bronzor, and Trubbish. Seed Bomb complements Acrobatics by nailing Rock-types like Gigalith and Carbink. U-turn lets Jumpluff safely escape from some of the aforementioned poor matchups while keeping momentum, while Encore can force slower Pokemon to lock into undesirable moves, creating setup turns, and shut down opposing setup Pokemon like Duosion and Swalot that can otherwise outmatch Jumpluff.</p> <p>Jumpluff cannot deal with Steel-types like Bronzor, Klang, and Lairon on its own; Fire-types and Ground-types like Pignite and Whiscash can all handle them with ease and also appreciate being brought in safely by U-turn. Even with Seed Bomb, Rock-types are physically bulky enough to withstand multiple hits from Jumpluff, and Gigalith in particular poses a great threat because it can OHKO Jumpluff in return; therefore, answers to Rock-types such as Vibrava, Marshtomp, and Scraggy make for great partners. These Pokemon also provide additional benefits: Vibrava's access to Defog allows for easier setup opportunities, Marshtomp's Stealth Rock helps weaken foes into Jumpluff's effective cleaning range, and Scraggy can remove important items like Eviolite and Rocky Helmet to aid Jumpluff's sweep. Spikes setters such as Quilladin, Whirlipede, and Glalie are also great partners, as many of Jumpluff's reliable answers are grounded. Special wallbreakers such as Simipour, Simisage, and Magmar can take down physical walls such as Swalot and Dusclops, as well as better dealing with the previously mentioned Steel- and Rock-types, which are typically weaker specially. Teams with many Eviolite-dependent Pokemon like Electabuzz, Bronzor, and Hippopotas can use Jumpluff as a Knock Off absorber. U-turn Jumpluff also makes for a great addition to VoltTurn teams, which feature the likes of Electabuzz, Frogadier, and Dustox.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 226429, "username": "Jett"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 601970, "username": "sleid"}, {"user_id": 543866, "username": "5Dots"}]}, {"name": "Grammar checked by", "members": [{"user_id": 652656, "username": "Gambit"}, {"user_id": 470115, "username": "SolarBeam"}]}]}
  },
  "Murkrow": {"sets": {"Physically Based Attacker": {}}},
  "Girafarig": {"sets": {"Nasty Plot": {}, "Choice Scarf": {}}},
  "Dunsparce": {"sets": {"Coil": {}}},
  "Octillery": {"sets": {"Trick Room Attacker": {}}},
  "Marshtomp": {"sets": {"Stealth Rock": {}, "Specially Defensive": {}}},
  "Mightyena": {"sets": {"All-Out Attacker": {}}},
  "Dustox": {
    "comments": "<h3>Other Options</h3> <p>Double Dance sets with Quiver Dance + Iron Defense and Bug Buzz for coverage can be decent wincons, but they fail to break the mold due to their passivity before setting up and lack of general power even after boosts.</p> <h3>Checks and Counters</h3> <p><strong>Rock-types</strong>: Lairon and Gigalith are offensive Stealth Rock users that Dustox has little chance at deterring by itself because they can threaten it out with their STAB attacks.</p> <p><strong>Fire-types</strong>: Dustox needs to watch out for offensive Fire-type Pokemon like Magmar and Pignite, as it fears letting them in any time it attempts to recover with Roost or use Defog.</p> <p><strong>Psychic-types</strong>: While they take hefty damage from U-turn, Dustox struggles with its role as a special wall versus Psychic-types like Duosion and Swoobat.</p> <p><strong>Wallbreakers</strong>: Dustox is vulnerable to stronger physical attackers like Choice Band Furfrou and Life Orb Simisage. Even with maximum bulk, it also still cannot safely switch into some special threats like Choice Specs Vanilluxe.</p> <p><strong>Stallbreakers</strong>: Given Dustox's passivity, it relies on Toxic and Whirlwind to deal with setup sweepers, so the likes of Dragon Dance + Taunt Scraggy and Encore Jumpluff make it a sitting duck.</p>",
    "sets": {
      "Specially Defensive": {
        "description": "<p>Dustox compresses the roles of entry hazard control, special wall, and pivot into a single set. While its bulk is far from impenetrable, its typing allows it to have a solid matchup versus special attackers like Servine and Frogadier. Politoed gets a special mention here; Dustox is one of its best switch-ins, since it doesn't have to be concerned with burn from Scald due to Shield Dust. This provides opportunities for it to clear entry hazards with Defog as well as gain momentum with STAB U-turn. Toxic allows Dustox to punish switch-ins like Gigalith and Pignite, a more proactive approach of dealing with its checks in comparison to pivoting. Whirlwind forces out sweepers like Klang and Scraggy, and it can also gain momentum when drawing in a Pokemon that cannot threaten Dustox with a subsequent U-turn. Sludge Bomb is another option Dustox may opt for to spread status while also nailing the Grass-types it checks like Servine, Simisage, and Gogoat. Physically defensive and mixed defensive investments work well too, given the appropriate team support. These sets help check the likes of offensive Swalot, Krokorok, and Persian.</p> <p>Offensive Water-types like Politoed, Simipour, and Frogadier are great teammates, as they can force out the Fire- and Rock-types that come in on Dustox, like Magmar and Lairon. In return, Dustox can come in on Grass-types like Servine and restart the U-turn momentum cycle. Physical walls like Gigalith and Carbink make for a good core to pair with Dustox because it takes on the Grass- and Water-types that threaten them while they handle the Normal- and Fire-types that threaten Dustox. Offensive pivots like Electabuzz and Furfrou also generate momentum in tandem with Dustox. Dark-types like Scraggy and Krokorok are necessary so that Dustox can pivot out on Duosion and not fear the following Future Sight. Krokorok has the added benefit of Pursuit trapping Duosion.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 231074, "username": "S1nn0hC0nfirm3d"}, {"user_id": 601970, "username": "sleid"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 543866, "username": "5Dots"}, {"user_id": 226429, "username": "Jett"}]}, {"name": "Grammar checked by", "members": [{"user_id": 470115, "username": "SolarBeam"}]}]}
  },
  "Slaking": {"sets": {"Choice Band": {}, "Choice Scarf": {}}},
  "Shedinja": {"sets": {"Wonder Guard Pivot": {}}},
  "Lairon": {
    "comments": "<h3>Other Options</h3> <p>Hone Claws is an option to provide Lairon better KO ranges and give Head Smash perfect accuracy, although it's not a very viable option because it takes an extra turn of setup and makes Lairon drop an important coverage slot. Running a Jolly nature is an option to ensure Lairon outspeeds the likes of Swoobat and other Pokemon that prefer to creep the 179 benchmark at +2. However, a Jolly nature generally isn't worth the loss in power.</p> <h3>Checks and Counters</h3> <p><strong>Bronzor</strong>: All of Lairon's sets are completely walled by Bronzor and get chipped down by Psywave.</p> <p><strong>Bulky Ground-types</strong>: Vibrava can shrug off hits from Lairon, remove its Stealth Rock, and threaten it back with STAB Earthquake. Marshstomp and Hippopotas can also take hits easily and set up their own Stealth Rock. However, they all have to be wary of Lairon carrying Toxic.</p> <p><strong>Fast Revenge Killers</strong>: Lairon has a hard time, outside of its Rock Polish set, dealing with revenge killers like Krokorok and Simipour, which can OHKO it. Electabuzz, Magmar, and Vanilluxe typically carry coverage moves that also OHKO Lairon. Even its Rock Polish set struggles to avoid being revenge killed by most Choice Scarf users, as well as Swoobat that carry Hidden Power Ground.</p> <p><strong>Bulky Attackers</strong>: A good portion of the tier, such as Pignite, Politoed, and Dragon Dance Scraggy, can switch in on Lairon once and threaten to revenge kill it with a super effective move.</p>",
    "sets": {
      "Offensive Stealth Rock": {
        "description": "<p>Lairon is a dangerous Stealth Rock setter with its solid defensive typing, powerful Rock STAB move in Head Smash, and great coverage to discourage the entire tier from switching in safely. Lairon's Head Smash threatens to 2HKO many common defensive walls such as Swalot, Ivysaur, and Regenerator Duosion after Stealth Rock damage. Superpower hits Pokemon that resist Head Smash such as Scraggy, Klang, and opposing Lairon. Heavy Slam is preferred in the last slot as another STAB move that is stronger against lighter foes like Carbink and Vibrava. Roar is an alternative option to phaze Pokemon that want to come in and set up in front of Lairon like Duosion or to chip away at opposing Pokemon that sit on it like Bronzor. Toxic is an option that does well at chipping down a common switch-in, Vibrava, to deter it from coming in and removing Lairon's entry hazards. Toxic also wears down other Ground-types like Hippopotas and Marshtomp, which can comfortably switch into Lairon's attacks. Rock Head allows Head Smash to be a spammable move and keeps Lairon healthy.</p> <p>Lairon does well on balance and offensive teams looking for an entry hazard setter that can put pressure on hazard removers like Dustox and physical walls like Ivysaur and Carbink. Cleaners like Klang, Choice Scarf Krokorok, and Huntail appreciate Lairon's ability to put a dent in the likes of Swalot and Duosion. Teammates that can come in and take advantage of opposing Vibrava like Jumpluff and Ivysaur are appreciated. Vibrava is a great pairing, since it can deal with a lot of Pokemon that threaten Lairon such as Pignite, Krokorok, and Gigalith, while Lairon can come in on Pokemon that bother Vibrava like Dustox, Wigglytuff, and Persian. Lairon needs teammates that can help deal with Bronzor, since Bronzor outright walls and beats it, so Pokemon such as Krokorok, Scraggy, and Magic Guard Duosion help alleviate this problem. Faster teammates are always appreciated to make up for Lairon's slow Speed, especially those that benefit from its wallbreaking like Sawsbuck and Jumpluff.</p>"
      },
      "Bulky Stealth Rock": {
        "description": "<p>Bulky Lairon is a great entry hazard setter, using its solid defensive typing and physical bulk to take on some of the tier's top threats like Persian, Klang, and Furfrou. Head Smash is Lairon's strongest STAB move and hits most Pokemon like Swalot, Carbink, and Quilladin, for great damage. Roar phazes foes that Lairon can't touch, like Bronzor, and disrupts setup attempts from Pokemon like Klang, Duosion, and Carbink. Vibrava and Gigalith both have an easy time switching into Lairon, so Toxic is the main option to wear them down. Superpower is an alternative to deal more immediate damage to Scraggy and Klang; however, it isn't as strong of an option against Vibrava, which can just shrug it off. Rock Head makes Head Smash more spammable because it stops Lairon from taking recoil damage that would cut into its bulk. Lairon uses maximum HP investment to avoid KOs that a set with no HP investment wouldn't, like the OHKO from Politoed's Scald and Eviolite Krokorok's Earthquake and the 2HKO from Bulk Up Scraggy's Drain Punch.</p> <p>Lairon does its best work on balance and offense teams looking for an entry hazard setter with a great defensive profile that can deal with a plethora of Pokemon like Persian, Dustox, and Duosion. Frailer teammates like Frogadier and Simipour appreciate Lairon's ability to eat hits from Persian and Furfrou. Lairon pairs well with offensive Quilladin on hazard-stacking teams because Lairon can phaze the opposing team to pile up chip damage, while Quilladin helps deal with a lot of Pokemon that Lairon is weak to such as Vibrava, Gigalith, and Krokorok. Other Grass-types like Simisage and Meganium really like having Lairon on their team because it comes in on Dustox and keeps Stealth Rock up against it for later chip damage. Lairon needs some support from the likes of Scraggy and Magic Guard Duosion against Bronzor, which completely walls it. Swalot is a great teammate that deals with the likes of Pignite and Scraggy while also absorbing Knock Off so Lairon doesn't lose its Eviolite.</p>"
      },
      "Choice Band": {
        "description": "<p>Choice Band Lairon is a powerful wallbreaker, capable of 2HKOing many physical walls and naturally bulky Pokemon such as Swalot, Meganium, and Vibrava. With Choice Band, Head Smash would-be 3HKOs on physical defensive Dusclops and Bulk Up Scraggy become safe 2HKOs after Stealth Rock damage. Heavy Slam is the preferred Steel-type STAB move because it hits Vibrava than harder Iron Head. Superpower is strong coverage against Klang and opposing Lairon. Iron Head is one of the better last slot options because it's a safer click against heavier targets like Swalot and Gigalith than a move that has a chance to miss in Head Smash or has a drawback of dropping Lairon's stats in Superpower. Shadow Claw is an alternative to give Lairon a way to actually damage Bronzor, however, it's still only a 3HKO and isn't very strong against other targets. Toxic is an option to take down Gourgeist-L and Vibrava, which can otherwise safely heal off damage from Lairon and threaten it back with Will-O-Wisp and Earthquake, respectively.</p> <p>Lairon is best on offensively oriented teams that are looking for a physical wallbreaker to clear the path for physical sweepers such as Scraggy, Huntail, and Klang. Lairon appreciates being paired with slower pivots like Dustox and Vibrava, which bring it into favorable matchups against their common switch-ins like Ivysaur and Jumpluff. Offensive checks to Bronzor such as Scraggy and Krokorok are important, as Lairon finds it almost impossible to break it. Stealth Rock support from the likes of Marshstomp, Krokorok, and Carbink is very helpful for getting Pokemon such as bulky Servine, Meganium, and Furfrou into favorable KO ranges for Lairon. Paralysis support from the likes of Servine and Duosion is greatly appreciated, since it can slow down threats that would otherwise outspeed and OHKO Lairon like Pignite and Simipour.</p>"
      },
      "Rock Polish": {
        "description": "<p>Lairon is a threatening cleaner with access to Rock Polish to let it outspeed the entire unboosted tier, a powerful Rock-type STAB move in Head Smash, and a solid defensive profile. Head Smash comes with no drawback with Lairon's Rock Head ability and OHKOes most offensive targets like Simisage, Frogadier, and Sawsbuck. Superpower is coverage against Pokemon that resist Head Smash like Scraggy, Klang, and opposing Lairon. Heavy Slam is coverage to OHKO Carbink and heavily damage Vibrava, and it is also a solid midground move against most switch-ins.</p> <p>Lairon does well on balance and offense teams looking for an endgame cleaner. Wallbreakers like Krokorok, Pignite, and Scraggy are all appreciated by Lairon, since they can help it get through physical walls that stifle it like Vibrava and Bronzor. Entry hazard setters like Marshtomp, Quilladin, and Whirlipede are appreciated for helping put foes into KO ranges; for example, physically defensive Swalot goes from being 3HKOed to being 2HKOed after Stealth Rock, and Electabuzz goes from being 2HKOed to being OHKOed after Stealth Rock and a layer of Spikes. Lairon likes being paired with teammates that can switch into common Choice Scarf users like Frogadier and Simipour, since it fails to outspeed some of them even after a Rock Polish, so Meganium, Dustox, and Servine make great partners. Lairon also does very well on offensive teams looking for a check to Persian and Furfrou for frailer teammates like Pikachu, Butterfree, and Swoobat.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 601970, "username": "sleid"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 226429, "username": "Jett"}, {"user_id": 543866, "username": "5Dots"}]}, {"name": "Grammar checked by", "members": [{"user_id": 470115, "username": "SolarBeam"}, {"user_id": 528364, "username": "adorluigi"}, {"user_id": 569291, "username": "zinnias"}, {"user_id": 511181, "username": "Rose"}]}]}
  },
  "Meditite": {"sets": {"Choice Band": {}, "Choice Scarf": {}}},
  "Swalot": {
    "comments": "<h3>Other Options</h3> <p>Infestation can be slotted over one of Swalot's coverage moves on its physically defensive set and chips down threats like Scraggy and Pignite more quickly, though it leaves Swalot more vulnerable to checks like Lairon and Krokorok. A Choice Band set makes use of Swalot's coverage and solid Attack, though being locked into one of its moves can render it setup fodder against a check, making it more risky than its other sets.</p> <h3>Checks and Counters</h3> <p><strong>Bronzor</strong>: Bronzor is Swalot's worst matchup: barring Fire Punch from Curse sets, it can easily switch into any of Swalot's attacks before whittling it down with Psywave.</p> <p><strong>Ground-types and Ground-type coverage</strong>: Ground-types like Krokorok and Whiscash resist Swalot's STAB moves and can threaten it out with their own, though they need to be careful of coverage moves. Pokemon sporting Ground-type coverage like Gigalith and offensive Swalot sets can threaten out defensive Swalot.</p> <p><strong>Psychic-types</strong>: Psychic-types like Duosion, Swoobat, and Meowstic-F can outspeed Swalot, threaten it out with their STAB moves, and set up against it, though Duosion does not enjoy dealing with offensive Swalot variants.</p> <p><strong>Residual Damage</strong>: Due to Swalot lacking reliable recovery, it can be worn down by entry hazards and burn, which lowers its effectiveness as a wall and causes it to rely on Rest or Pain Split to keep healthy, rendering it more passive than usual.</p> <p><strong>Strong Wallbreakers</strong>: Depending on what defensive spread it invests in, Swalot can be vulnerable to wallbreakers like Vanilluxe, Choice Specs Magmar, Choice Band Gigalith, and Furfrou, as it lacks enough damage output to fight back against them.</p>",
    "sets": {
      "Physically Defensive": {
        "description": "<p>Swalot is a premier wall thanks to its great defensive typing, bulk, and set versatility. Sludge Bomb is preferred over Sludge Wave for its higher PP and poison chance, though Sludge Wave can be used to target Quilladin. Ice Beam hits Ground-types like Krokorok and Vibrava, while Earthquake hits Lairon, Klang, and opposing Swalot. RestTalk allows Swalot to continue walling foes without worrying about being statused. Encore and Pain Split are used to discourage setup sweepers and not have to wait three turns for recovery, respectively. A Bold nature should be run if Swalot chooses Ice Beam as its coverage; otherwise, Swalot should run a Relaxed nature if running Earthquake. Sticky Hold is Swalot's preferred ability to excel as a Knock Off and Trick absorber.</p> <p>Swalot fits on a variety of balance and bulky teams thanks to its great bulk and customizable movepool. Defensive stalwarts like Bronzor and Servine appreciate it absorbing Knock Off for them and chipping down physical attackers, trading with offensive threats like Pignite, Lairon, and Scraggy. In return, they can check Pokemon Swalot is vulnerable to, with Bronzor handling Psychic-types like Duosion and Swoobat and Servine handling Ground-types like Krokorok and Whiscash. While Swalot is a solid status absorber, cleric support from Pokemon like Wigglytuff and Meganium can make Rest more reliable without making it go through sleep turns.</p>"
      },
      "Specially Defensive": {
        "description": "<p>With an Assault Vest, great all-around bulk, and a good typing, Swalot makes for a sturdy special wall. Sludge Wave hits Quilladin at the cost of forsaking Sludge Bomb's lower poison chance and PP. Ice Beam hits targets like Swoobat and Vibrava harder than any of Swalot's other coverage moves do. Giga Drain targets Water-types like Politoed, Simipour, and Whiscash and gives Swalot extra longevity. Earthquake hits Steel-types like Lairon and Klang harder than any of Swalot's other moves do. A Sassy nature is necessary to not weaken Earthquake.</p> <p>As this set is more specially defensive, Swalot appreciates walls and tanks like Carbink, Gigalith, and Gourgeist-L to shore up its lower physical bulk. Bronzor particularly pairs well with it to set entry hazards and to cover both of Swalot's weaknesses. Due to Swalot's lack of recovery, Steel-types like Bronzor and Klang are even more difficult to answer, so checks like Pignite and Krokorok pair up nicely with it. Clerics like Meganium and Wigglytuff can alleviate Swalot's vulnerability to status, with the latter also helping out with Wish to address Swalot's lack of recovery. Eviolite-reliant Pokemon like Servine and Klang appreciate Swalot being a good Knock Off and Trick absorber.</p>"
      },
      "Tank": {
        "description": "<p>Swalot's diverse coverage choices and decent Attack when invested in make it a solid all-out attacker. A physically offensive set is preferred because Swalot's special movepool is shallow. Ice Punch targets Ground-types like Vibrava and Krokorok, while Earthquake hits Steel-types like Klang and Lairon. Power-Up Punch makes it easier for Swalot to break through walls like Gigalith and opposing Swalot. Explosion provides a strong neutral hit and blocks Defoggers like Vibrava and Dustox at the cost of sacrificing Swalot, which works well on offensive teams. Seed Bomb provides a stronger and more reliable hit against Water-types like Marshtomp and Whiscash. The given EV spread allows Swalot to outspeed Pignite, Adamant Dragon Dance Scraggy, and offensive Lairon while having a high chance of surviving the 2HKO from Life Orb Frogadier.</p> <p>This Swalot set shines on bulky offense and balance teams, where it can take advantage of its diverse coverage options to surprise foes expecting defensive sets. Walls like Klang and Grass-types like Servine and Jumpluff pair well with Swalot, resisting Ground and retaliating with utility moves like Glare and Sleep Powder. In return, Swalot can break down physical walls that normally switch into it, like opposing Swalot and Klang, that they struggle to break through. Even with Earthquake, Swalot struggles to take on Steel-types like Klang and Bronzor, so Fire-types like Pignite and Magmar can effectively force them out. Dark-types like Choice Scarf Krokorok and Mightyena also make for great partners, with the former even able to Pursuit trap Psychic-types like Swoobat and Meowstic-F that might otherwise easily revenge kill Swalot. Paralysis support from Pokemon like Servine and defensive Duosion can mitigate Swalot's low Speed and let it switch into threats like Gigalith and opposing Duosion more easily.</p>"
      },
      "Curse": {
        "description": "<p>This set turns Swalot into a setup sweeper through Curse, increasing its bulk to become progressively harder to defeat. RestTalk allows Swalot to either continue boosting with Curse or attack with Fire Punch. Fire Punch is preferred over a STAB move because of Fire-immune Pokemon's rarity in the metagame and Poison being a commonly resisted type.</p> <p>This Swalot set fits well on stall and bulky balance teams, able to leverage its bulk to ward off prominent attackers like Frogadier, Electabuzz, and Servine. Swalot pairs nicely with physically bulky Pokemon like Bronzor and Gourgeist-L: the former resists Swalot's weaknesses and can set up entry hazards, while the latter can spread burn and force switches with Leech Seed, and both cover Swalot's weakness to Ground. Clerics like Wigglytuff and Meganium can make Swalot less reliant on RestTalk to perform, and the former can even spread Wish to Swalot as a secondary form of recovery. Dark-types like Krokorok and Zweilous are helpful for checking Psychic-types like Swoobat and Meowstic-F, and the former can even Pursuit trap them. Taunt and Encore users like Pignite and Politoed can be tricky to handle, so checks to these threats like Vibrava and Servine, respectively, can force them out.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 543866, "username": "5Dots"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 226429, "username": "Jett"}, {"user_id": 601970, "username": "sleid"}]}, {"name": "Grammar checked by", "members": [{"user_id": 470115, "username": "SolarBeam"}]}]}
  },
  "Wailord": {"sets": {"StallLord": {}}},
  "Seviper": {"sets": {"Choice Scarf": {}, "Mixed Attacker": {}}},
  "Whiscash": {"sets": {"Choice Specs": {}, "Dragon Dance": {}, "SubToxic": {}}},
  "Banette": {"sets": {"Choice Band": {}, "Mixed Wallbreaker": {}}},
  "Dusclops": {"sets": {"Wall": {}, "Offensive": {}}},
  "Tropius": {"sets": {"Setup Sweeper": {}}},
  "Glalie": {"sets": {"Offensive Spikes": {}, "Suicide Lead": {}}},
  "Walrein": {"sets": {"Substitute": {}}},
  "Shelgon": {"sets": {"Cleric": {}, "Bulky Dragon Dance": {}, "Offensive Dragon Dance": {}}},
  "Bibarel": {"sets": {"Hazard Lead": {}}},
  "Kricketune": {"sets": {"Sticky Web Lead": {}}},
  "Luxray": {"sets": {"Physical Wallbreaker": {}}},
  "Mothim": {"sets": {"Choice Specs": {}, "Substitute + Quiver Dance": {}}},
  "Lopunny": {"sets": {"Offensive": {}}},
  "Stunky": {"sets": {"Offensive Utility": {}}},
  "Bronzor": {
    "comments": "<h3>Other Options</h3> <p>Bronzor can opt for a specially defensive set, helping it better check the likes of Electabuzz, Simipour, and Politoed. However, it already does a solid job at checking them and really wants the Defensive investment to check physical threats like Jumpluff, Gigalith, and Persian better. Stealth Rock can be dropped for Sleep Talk on stall teams to alleviate some passivity, but Stealth Rock is generally better for role compression. Protect can be used over Stealth Rock to rack up Toxic damage and scout Choice-locked threats like Krokorok and Simipour.</p> <h3>Checks and Counters</h3> <p><strong>Dark-types</strong>: Mightyena, Krokorok, and Scraggy all threaten Bronzor with their STAB moves while only having to worry about taking a Toxic upon entry. Bulk Up Scraggy in particular completely walls Bronzor, since it can heal off Toxic with Shed Skin.</p> <p><strong>Fire-types</strong>: Pignite and Magmar can safely 2HKO Bronzor with Flare Blitz and Fire Blast, respectively.</p> <p><strong>Duosion</strong>: Magic Guard Duosion can sit on Bronzor and stall it out. Sets that run Calm Mind can use Bronzor as setup fodder.</p> <p><strong>Item Removal</strong>: The likes of Persian, Ivysaur, and Servine all threaten Bronzor with Knock Off if it has to switch in to take a hit from them. Losing Eviolite greatly weakens Bronzor's ability as a wall. Trick and Switcheroo users like Swoobat and Lopunny can swap Bronzor's Eviolite for a debilitating item that lessens its walling capabilities.</p> <p><strong>Taunt Users</strong>: Servine, Frogadier, and Quilladin can all use Taunt to deny Bronzor the opportunity to set up Stealth Rock or use Toxic on them, which allows them to boost or set up entry hazards.</p>",
    "sets": {
      "Physical Wall": {
        "description": "<p>Bronzor is a premier physical wall that can take on the likes of Furfrou, Gigalith, and Swalot with its phenomenal stats, support movepool, and great defensive typing paired with Levitate. Psywave is a great move to help Bronzor not be so passive against Toxic-immune targets like Klang, Ivysaur, and Lairon. Bronzor walls so many Pokemon that it often finds a free opportunity to set up Stealth Rock for its teammates. Rest is the only form of recovery that Bronzor can run, but it works well enough because of its previously discussed longevity.</p> <p>Bronzor works best when it can keep Eviolite, so it appreciates the likes of Swalot and Wigglytuff, which work well as Knock Off absorbers. Bronzor can easily handle the top Rock-types in the tier, Gigalith and Lairon, which partners like Dustox, Persian, and Jumpluff really appreciate. Pignite and Magmar pose a serious threat to Bronzor, so teammates like Politoed and Carbink are great to bring alongside Bronzor to alleviate this issue. Dark-types like Krokorok, Mightyena, and Scraggy are even scarier, since they are immune to Psywave, and Krokorok can even Pursuit trap Bronzor. Bulk Up Scraggy in particular completely walls Bronzor, since it can heal off Toxic with Shed Skin, so Meganium and Wigglytuff are good teammates, as they do well at stopping these Dark-types in their tracks. These same Dark-types also make for great teammates to help take on Duosion, which can use Bronzor as setup fodder. Grass-types like Servine and Simisage love having Bronzor around to take on Swalot and Dustox.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 601970, "username": "sleid"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 543866, "username": "5Dots"}, {"user_id": 296755, "username": "5gen"}]}, {"name": "Grammar checked by", "members": [{"user_id": 569291, "username": "zinnias"}, {"user_id": 470115, "username": "SolarBeam"}]}]}
  },
  "Munchlax": {"sets": {"CroLax": {}}},
  "Hippopotas": {"sets": {"Physical Wall": {}}},
  "Phione": {"sets": {"Defensive Pivot": {}}},
  "Servine": {
    "comments": "<h3>Other Options</h3> <p>Servine's Choice Scarf and offensive utility sets can opt to run Hidden Power Fire over Hidden Power Ice, though not being able to consistently threaten Flying-types and Vibrava with super effective damage can end up causing problems if not properly accounted for in teambuilding. While Servine can opt for additional utility moves like Leech Seed, Knock Off, and Glare over Hidden Power on its utility sets, this leaves it walled or threatened by significantly more Pokemon, including several other Grass-type Pokemon like Simisage and Sawsbuck. Servine can also opt for an offensive spread of 4 HP / 252 SpA / 252 Spe on Eviolite sets, but this spread is typically only used on hyper offense teams.</p> <h3>Checks and Counters</h3> <p><strong>Fire-types</strong>: Fire-type Pokemon like Pignite and Magmar can easily switch into Servine's attacks and threaten super effective STAB damage in return, with the latter also outspeeding non-Choice Scarf Servine.</p> <p><strong>Poison-types</strong>: Bulky Poison-type Pokemon like Dustox, Swalot, and Ivysaur easily switch into and threaten out Servine.</p> <p><strong>Flying-types</strong>: Swoobat and Jumpluff can KO Servine from over half HP and can take advantage of Choice Scarf Servine being locked into Leaf Storm.</p> <p><strong>Vanilluxe</strong>: Choice Scarf Vanilluxe can outspeed and KO offensive variants of Servine from nearly full HP, and all variants of Vanilluxe can survive an unboosted Leaf Storm with relative ease.</p> <p><strong>Sap Sipper</strong>: Sap Sipper Pokemon like Gogoat and Sawsbuck are fully immune to Leaf Storm and take relatively little damage from unboosted Hidden Power Ice / Fire, allowing them to threaten Servine out with setup and damage, respectively.</p>",
    "sets": {
      "Offensive Utility": {
        "description": "<p>Offensive Servine is a top-tier setup sweeper through its ability to break foes with its self-boosting STAB Leaf Storm, remove opposing items with Knock Off, hinder switch-ins with Glare, and shut down walls and entry hazard setters with Taunt. Its excellent Speed also allows it to benefit from the paralysis it spreads, outpacing all paralyzed Choice Scarf users in mid-game and end-game scenarios. Hidden Power Ice allows Servine to hit opposing Grass-, Dragon-, and Flying-type Pokemon super effectively.</p> <p>Fire-type teammates like Magmar and Pignite appreciate Servine's ability to paralyze opposing threats and cleanly answer opposing Water-type Pokemon; in return, they threaten out the special walls that often slow down Servine like Dustox, Meganium, and Bronzor. Servine also appreciates having teammates like Politoed, Simipour, and Whiscash that can handle opposing Fire- and Steel-type Pokemon like Pignite and Bronzor. Entry hazard support from Pokemon like Gigalith and Krokorok is also greatly appreciated by Servine to chip its checks into boosted Leaf Storm range. Servine often struggles with opposing Poison-type Pokemon like Swalot and Trubbish, so Psychic-types like Swoobat and Duosion are appreciated as teammates. Lastly, since Servine is a late-game sweeper, wallbreakers like the aforementioned Magmar and Simipour as well as Simisage are invaluable teammates to have.</p>"
      },
      "Bulky Contrary": {
        "description": "<p>Bulky Servine serves as a reliable check to several offensive Electric- and Water-type threats like Electabuzz, Pikachu, Simipour, Politoed, and Seaking and uses the turns that it gains from these threats to chip or otherwise hinder foes. Hidden Power Ice allows Servine to hit opposing Flying- and Dragon-type Pokemon, Hidden Power Fire allows it to hit opposing Steel-type Pokemon, and both give it a tool to answer opposing Grass-type Pokemon. Synthesis acts as reliable recovery, allowing Servine to continue answering the threats it's meant to check, while its final moveslot lets it choose between removing items, paralyzing foes, or chipping at foes and gaining further recovery with Leech Seed. Servine can opt to include both Glare and Knock Off while forgoing Hidden Power, allowing it to disrupt foes in many ways, but this leaves it unable to hit opposing Grass-types. The given EV spread allows Servine to outpace several foes like Scraggy and Modest Glaceon while taking special attacks as well as possible.</p> <p>Entry hazard setters like Gigalith and Krokorok pair excellently with Servine, which punishes Defog attempts with Contrary and appreciates hazard damage on the Fire- and Poison-type Pokemon that often threaten it out. Servine's ability to reliably switch into Electric-type threats is greatly appreciated by teammates like Simipour, Politoed, and Seaking, which can in turn take advantage of the Fire-type Pokemon that Servine is often checked by. Servine often struggles against opposing Poison-type Pokemon like Dustox and Swalot, so teammates like Duosion and Swoobat are greatly appreciated to help deal with them. Lastly, Servine loves having Fire-type teammates like Magmar and Pignite that answer the Steel-type Pokemon trying to take advantage of Servine's relative passivity, especially if it's lacking Hidden Power Fire.</p>"
      },
      "Choice Scarf": {
        "description": "<p>Choice Scarf Servine is one of the tier's premier revenge killers and cleaners, outpacing the entire unboosted metagame and dealing excellent damage with its boosted STAB Leaf Storm. Energy Ball acts as a solid secondary STAB move, allowing Servine to save its limited Leaf Storm PP until the endgame, while Hidden Power Ice allows Servine to KO weakened opposing Grass-types like Simisage and Sawsbuck, Flying-types like Jumpluff, and Vibrava. Servine's final move is dedicated to taking advantage of the many switches it forces in early- and mid-game scenarios, paralyzing foes with Glare or removing items with Knock Off.</p> <p>It can be difficult for Choice Scarf Servine to switch in at times, so it appreciates teammates with pivot moves like Electabuzz and Vibrava. Servine commonly struggles against opposing Fire-type Pokemon like Pignite and Magmar, meaning that Water-type teammates like Simipour and Politoed are excellent to switch into and exploit them. Servine also struggles to break past Poison-type Pokemon like Swalot and Dustox, so Psychic-types like Duosion, Meowstic-F, and Swoobat make for excellent allies to break them. Servine also loves having entry hazard-setting teammates like Gigalith and Krokorok to further chip down its checks with hazard damage, enabling its sweep more easily in endgame scenarios when common checks like Pignite and Dustox are heavily chipped down or removed.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 598623, "username": "BaitWiz"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 543866, "username": "5Dots"}, {"user_id": 226429, "username": "Jett"}]}, {"name": "Grammar checked by", "members": [{"user_id": 470115, "username": "SolarBeam"}]}]}
  },
  "Pignite": {
    "comments": "<h3>Other Options</h3> <p>A faster set with Taunt + Toxic can shut down some walls and switch-ins, but it comes at the cost of Pignite's coverage and defensive capabilities, which are generally more valuable. Power-Up Punch is an alternative option on the tank set to potentially pick off a weakened target and then use the extra power to sweep with a stronger Sucker Punch. Flame Charge with extra Speed investment allows Pignite to potentially clean late-game, although Curse + Sucker Punch offers a more reliable vehicle to success. Wild Charge nails Water-types attempting to switch in, although all notable examples will be just as vulnerable to Superpower, which also comes with the perk of lacking recoil. Roar works as some bulky setup sweepers like Scraggy and Iron Defense Klang can become too hard for Pignite to break itself. Bulldoze is helpful for the mirror and works like Flame Charge to a lesser extent, getting the jump on faster attackers like Magmar and Electabuzz. Sometimes, the offensive potential of Blaze can be worth forfeiting Pignite's ability to easily switch into Vanilluxe with Thick Fat, especially given its good synergy with Flare Blitz recoil. RestTalk over Toxic and Sucker Punch on an offensive set is great for helping Pignite stick around while making it arguably the best long-term answer to Bronzor. Although RestTalk makes Pignite much bulkier, it leaves it vulnerable to being revenge KOed more easily. Heavy Slam is a good option to OHKO a common counter in Carbink.</p> <h3>Checks and Counters</h3> <p><strong>Ground-types</strong>: Bulky Ground-types such as Vibrava, Hippopotas, and Marshtomp are hard for Pignite to trade hits against, even if they lose their Eviolite or get poisoned by Toxic.</p> <p><strong>Water-types</strong>: Most Water-types do not want to switch in against Pignite's strong coverage, but the likes of Simipour and Whiscash can come in against its Fire-type attacks and force it out. Politoed's bulk and access to Protect and Encore makes it one of the hardest checks to deal with.</p> <p><strong>Swalot</strong>: Physically defensive Swalot is a pain for Pignite to get through, especially when Flare Blitz recoil is compounded with Rocky Helmet chip damage. Some variants also carry Encore to shut down Curse Pignite.</p> <p><strong>Duosion</strong>: Duosion's overall bulk and access to STAB Psychic and Future Sight make it a good check to Pignite, even absorbing its strong Flare Blitz thanks to Regenerator.</p> <p><strong>Wallbreakers</strong>: Faster, hard-hitting attackers like Life Orb Murkrow and Choice Specs Electabuzz can force out Pignite. Even some of the wallbreakers that Pignite can discourage, like Vanilluxe and Magmar, run coverage like Hidden Power Ground and Psychic, respectively, that can 2HKO Pignite.</p>",
    "sets": {
      "Tank": {
        "description": "<p>As a bulky offensive threat, Pignite ends up being the offensive glue that holds a lot of teams together, with its good all-around bulk and solid offensive coverage always coming in handy. Many Grass-types have a hard time trading hits and preventing Pignite from coming in against them, and many other walls and sweepers such as Dustox, Bronzor, Klang, and Scraggy all struggle versus it. Sucker Punch means that even when Pignite is at low HP, it can still pose a threat to revenge killers, especially frailer examples like Swoobat and Pikachu. For bulkier targets it fails to break through, like Regenerator Duosion, Marshtomp, and Hippopotas, Pignite can still threaten them with Toxic on the switch in. Thick Fat is an asset for discouraging STAB attacks from wallbreakers like Choice Specs Magmar and Vanilluxe. The given EV spread outspeeds Adamant Lairon, although a faster spread to outspeed Adamant Klang is also viable.</p> <p>Grass- and Water-types are some of the best teammates for Pignite, as they complete the Fire / Water / Grass core. Servine and Politoed work on bulky offense, being able to spread status and pivot Pignite in on Grass-types like Ivysaur and Gogoat. Alternatively, the likes of Simisage and Frogadier support Pignite with their revenge killing capabilities, and in return it forces heavy hits on important walls. Duosion's Future Sight support is a great way to make sure Pignite will net hefty damage, as walls like Swalot and Trubbish stop being safe switch-ins to Superpower. Pivots like Volt Switch Electabuzz and Klang can force out Water-types and bring Pignite in on susceptible special walls. Klang, Krokorok, and Lairon appreciate Pignite's ability to break down defensive walls with its powerful STAB moves, giving them an easier time to sweep in the endgame. Entry hazard removers like Vibrava and Dustox are appreciated to reduce the amount of chip damage Pignite takes, since it already deals with Flare Blitz recoil.</p>"
      },
      "Curse": {
        "description": "<p>Pignite poses as a threatening defensive setup sweeper thanks to Curse, while Thick Fat gives it free entry against powerful attackers. Early-game, Pignite has the special bulk to tank hits from a slew of special attackers like Servine, Magmar, and Vanilluxe and can even absorb status like Servine's Glare. It can then recover with Rest late-game and start to set up with Sleep Talk + Curse. Given the lack of viable Flash Fire users, Fire Punch suffices as Pignite's only attack. Brick Break can also work either over Sleep Talk or, seldomly, by itself over Fire Punch, but being unable to force out Gourgiest-L and being completely walled by Ghost-types is usually too much of a liability.</p> <p>Water-types like Politoed and Whiscash make for great teammates, as they can eliminate the Rock-types like Gigalith and Carbink that Pignite struggles to set up against. Sticky Hold Swalot is a solid teammate, as both Trick and Knock Off can stop Curse sweeps. Electabuzz also is great as a way to punish Encore users such as Jumpluff and Politoed. Ivysaur and Servine can remove items with Knock Off, spread status, and force out Water-types like Seaking and Politoed, making it easier for Pignite to sweep, and in return they rely on Pignite to tank the strong Fire- and Ice-type attacks that force them out. Clerics like Meganium and Wigglytuff make Pignite less reliant on Rest for recovery and relieve its role as a status absorber.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 231074, "username": "S1nn0hC0nfirm3d"}, {"user_id": 601970, "username": "sleid"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 543866, "username": "5Dots"}, {"user_id": 226429, "username": "Jett"}]}, {"name": "Grammar checked by", "members": [{"user_id": 470115, "username": "SolarBeam"}]}]}
  },
  "Simisage": {
    "comments": "<h3>Other Options</h3> <p>Hidden Power Ice can be used over on Simisage's mixed all-out attacker set to allow it to break past Gourgeist-L and OHKO an incoming Jumpluff after Stealth Rock. However, it is not easy to fit Hidden Power Ice over Superpower, Rock Slide, or Gunk Shot because Simisage will miss out on certain targets like Klang, Dustox, and specially defensive Servine. Similarly, Synthesis can be used over a coverage move on the mixed all-out attacker set to provide Simisage with more longevity. Substitute can be used over Focus Blast or Hidden Power Ice on the Nasty Plot set to avoid status against Gourgeist-L and Servine as well as protect against revenge killers like Persian, Fufrou, and Choice Scarf Magmar. However, Simisage typically wants coverage to beat Grass- and Steel-types. Choice Scarf Simisage can run Superpower or Gunk Shot over Leaf Storm to revenge kill Dragon Dance Scraggy, Shift Gear Klang, and Choice Scarf Vanilluxe or to have a way around Servine and Gogoat. However, being locked into Superpower or Gunk Shot is easy to exploit, so Simisage usually doesn't run them. Choice Specs can be used instead of Choice Scarf to turn Simisage into a special wallbreaker not reliant on Nasty Plot. However, Choice Specs Simisage is not that consistent because it is quite prediction reliant and still struggles against common Pokemon such as Swalot, Servine, Dustox, and Pignite.</p> <h3>Checks and Counters</h3> <p><strong>Poison-types</strong>: Bulky Poison-types like Swalot and Trubbish switch into Simisage comfortably and can set up on it or set up entry hazards in Trubbish's case. Other Poison-types like Ivysaur, Dustox, and Whirlipede can switch into Simisage and force it out, but they dislike losing their item from Knock Off and are threatened by Rock Slide.</p> <p><strong>Bulky Grass-types</strong>: Bulky Grass-types such as Gourgeist-L, Servine, Gogoat, and Meganium pivot into Leaf Storm and really only fear Gunk Shot or +2 Hidden Power Ice from Simisage's Nasty Plot set. As such, these Grass-types can often switch into Simisage to scout its set. Moreover, Gourgeist-L, Meganium, and Servine can cripple Simisage with status, whereas Bulk Up Gogoat can set up on it.</p> <p><strong>Faster Pokemon</strong>: Fast Pokemon like Persian, Jumpluff, and Furfrou outspeed and revenge kill Life Orb Simisage. More niche Pokemon like Choice Specs Swoobat and Emolga outspeed it and can OHKO Life Orb variants. Choice Scarf users such as Simipour, Frogadier, Magmar, and Vanilluxe can also revenge kill Simisage from full HP. However, Choice Scarf Simisage can threaten these Pokemon if locked into the right coverage move.</p> <p><strong>Residual Damage</strong>: Simisage has poor bulk and lacks recovery, so even resisted attacks like Electabuzz's Volt Switch and Hippopotas's Earthquake put in KO range for faster attackers. Simisage wears itself down quickly because it is vulnerable to all entry hazards.</p> <p><strong>Pignite</strong>: Outside of Superpower and Hidden Power Flying, Pignite tanks Simisage's attacks and OHKOes in return. As such, Simisage needs to predict correctly with coverage or Nasty Plot on a predicted switch to have a chance at beating Pignite.</p>",
    "sets": {
      "Mixed All-Out Attacker": {
        "description": "<p>Simisage is a premier offensive Pokemon because of its ability to force switches and wallbreak due to its high Speed, diverse coverage choices, and power. Simisage forces switches due to the threat of Leaf Storm, so Knock Off is used to remove Leftovers and Black Sludge from switch-ins like Gogoat and Dustox. Moreover, Knock Off helps Simisage cripple Eviolite users such as Servine, Bronzor, and Ivysaur. Superpower helps Simisage punch through Steel-types like Klang and Lairon as well as Pokemon like Scraggy, non-Choice Scarf Vanilluxe, and Sawsbuck that would otherwise force Simisage out. Rock Slide rounds out Simisage's coverage, allowing it to hit would-be switch-ins such as Dustox, Jumpluff, Magmar, and Pidgeot. Gunk Shot can be used over either Superpower or Rock Slide so Simisage can break through bulky Grass-types like Servine, Gogoat, and Meganium. Most of Simisage's coverage is physical, and Leaf Storm is absurdly strong anyway, so Simisage prefers maximum Attack over Special Attack.</p> <p>Simisage has poor bulk and is easy to wear down due to Life Orb recoil, so pair it with pivots. Offensively, pivots such as Electabuzz, Frogadier, and Furfrou are excellent partners. Electabuzz pressures faster Pokemon like Jumpluff and Furfrou that threaten Simisage, while Simisage beats Ground-types for Electabuzz. Similarly, Frogadier and Furfrou break through Simisage's Fire- and Poison-type checks like Pignite and Swalot. Defensive pivots like Dustox and Vibrava cover Simisage's weakness to Poison- and Fire-types, bring it in safely with a slow U-turn, and remove entry hazards with Defog to increase its longevity. Simisage struggles to break through bulky Poison-types like Swalot, Trubbish, and Ivysaur, so pair it with Ground- and Psychic-types like Krokorok, Marshtomp, and Duosion. Similarly, Water-types like Politoed, Simipour, and Huntail are solid partners because they check Fire-types for Simisage. Simisage forces many switches, so entry hazard setters such as Gigalith, Lairon, and Whirlipede provide additional chip damage and help Simisage break more effectively. For example, Simisage can OHKO Jumpluff and Dustox with Rock Slide after Stealth Rock damage. Faster Pokemon like Persian, Jumpluff, and Furfrou are huge threats to Simisage, so pair it with defensive Pokemon like Carbink and Klang that switch into them. Simisage gives setup sweepers such as Shell Smash Huntail and Dragon Dance Scraggy an easier path to clean because it breaks through their checks like Politoed and Hippopotas.</p>"
      },
      "Nasty Plot": {
        "description": "<p>Nasty Plot Simisage aims to break through teams with its excellent coverage and Speed and takes advantage of would-be checks like Gogoat and Gourgeist-L. Giga Drain gives it more longevity when it's time to break or sweep. It offsets Life Orb recoil, making Simisage more difficult to take down. Focus Blast is used to hit Steel-types like Klang and Bronzor and can OHKO bulky Pokemon like Scraggy and Pignite after a Nasty Plot. Hidden Power Ice is preferred over Hidden Power Flying because while both hit Grass-types, Hidden Power Ice also hits Flying- and Dragon-types such as Pidgeot and Dragonair. Hidden Power Flying can be used to nail Dustox, Whirlipede, and Pignite, but it fails to OHKO Jumpluff like Hidden Power Ice does.</p> <p>This set is countered by bulky Poison-types like Swalot and Trubbish, so Psychic- and Ground-types like Duosion, Krokorok, and Marshtomp make for good partners. In return, Simisage breaks down Scraggy and Water-types like Politoed and Golduck for them. Simisage helps setup sweepers like Huntail, Shift Gear Klang, and Dragon Dance Scraggy clean in the late-game because it tears holes in teams. It should be paired with powerful attackers like Choice Band Furfrou, Pignite, and Murkrow to break through walls like Dustox, Swalot, Servine, and Ivysaur for it to break or clean. Entry hazard setters such as Gigalith, Lairon, Whirlipede, and Glalie make for good partners, as they provide necessary chip damage. For example, Stealth Rock and a layer of Spikes ensure the OHKO on Dustox with +2 Hidden Power Flying if it is used. Because of its poor bulk, pair Simisage with slow pivots such as Dustox, Vibrava, and Klang to bring it in safely. It is pressured by faster Pokemon such as Persian, Jumpluff, and Swoobat, so bulky Pokemon like Carbink, Rocky Helmet Swalot, and Bronzor make for good partners because they switch into these threats. Lastly, Water-types like Politoed, Simipour, and Frogadier make for good partners because they check Fire-types for it, while Simisage pressures Electabuzz and Gogoat for them.</p>"
      },
      "Choice Scarf": {
        "description": "<p>Choice Scarf Simisage is one of the better revenge killers in the tier because it is faster than most other boosted Pokemon and has the coverage to revenge kill top offensive Pokemon such as Simipour and Persian. Due to the Special Attack drop, Leaf Storm is more of a one-time hit to revenge kill Pokemon like Shell Smash Huntail and Rock Polish Lairon and to nail physically bulky Pokemon like Carbink and Furfrou. Seed Bomb is its primary way to revenge kill offensive Pokemon like Electabuzz and Simipour. Gunk Shot can be used over Seed Bomb to hit Grass-types like Servine, Meganium, and Sawsbuck. Knock Off gives it more utility to cripple incoming switch-ins like Pignite and Bronzor by removing their Eviolite. Rock Slide is used to 2HKO Dustox, Jumpluff, and Pidgeot after Stealth Rock. Maximum Attack is needed because most of Simisage's coverage is physical. A Naive nature ensures Leaf Storm's damage output isn't lowered.</p> <p>Simisage fits best on balance and offensive teams that need a revenge killer that pressures Water-, Rock-, and Ground-types alongside its diverse coverage. As such, Pokemon like Pignite, Furfrou, and Electabuzz appreciate its ability to pressure those types of Pokemon. It has very limited opportunities to switch in, so pivots like Persian, Frogadier, and Dustox are great partners. Wallbreakers such as Choice Specs Magmar, Choice Specs Vanilluxe, and Choice Band Furfrou break down teams for it to revenge kill or clean late-game. These wallbreakers appreciate its ability to revenge kill faster Pokemon so they can wallbreak more easily. Entry hazard setters like Gigalith, Whirlipede, and Bronzor make for good partners because they provide chip damage and defensive support. For example, Simisage can OHKO Choice Scarf Magmar with Rock Slide after Stealth Rock. Gigalith checks Swalot and Furfrou, Whirlipede checks bulky Grass-types, and Bronzor walls Jumpluff and Dustox. Similarly, entry hazard removers like Dustox, Sandshrew, and Pidgeot improve its longevity because it is vulnerable to residual chip. Bulky Pokemon like Carbink, Politoed, and Duosion provide solid defensive support for it, as they take on Normal- and Fire-types and absorb status in Duosion's case. Lastly, Simisage provides solid support to offensive Pokemon such as Simipour, Vanilluxe, and Swoobat because it can use Knock Off to remove Eviolite from their checks like Servine, Pignite, and Bronzor.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 296755, "username": "5gen"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 601970, "username": "sleid"}, {"user_id": 543866, "username": "5Dots"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}, {"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Simipour": {
    "comments": "<h3>Other Options</h3> <p>Simipour can opt to run Knock Off on its Nasty Plot sets to remove opposing Eviolite and Leftovers instead of Substitute or Hidden Power Grass, but losing the former makes it very prediction-reliant, while losing the latter makes it struggle more against opposing Water-type Pokemon. Simipour can also run a Modest nature on Salac Berry sets to further increase its power, but having worse Speed often makes it not worth the tradeoff, considering that its excellent Speed is one of the main reasons to use it.</p> <h3>Checks and Counters</h3> <p><strong>Grass-types</strong>: Servine and Gogoat can easily take Simipour's STAB Hydro Pump and withstand the follow-up Ice Beam at high HP while revenge killing easily. Both can also withstand a +2 Ice Beam from full HP, though Servine must be bulky to do so. Choice Scarf Simisage easily revenge kills Life Orb variants of Simipour. Meganium and Gourgeist-L can also serve as defensive checks to Simipour, while Jumpluff can check it offensively due to its better Speed.</p> <p><strong>Water-types</strong>: Politoed easily absorbs Simipour's Hydro Pump with Water Absorb, though it must be wary of Hidden Power Grass. Seaking and Wartortle do similarly well while being able to withstand +2 Hidden Power Grass.</p> <p><strong>Revenge Killers</strong>: Common users of Choice Scarf like Servine, Simisage, and Furfrou can easily revenge kill Simipour, with Furfrou even being able to outpace it at +1 Speed. Priority users like Pikachu, Furfrou, and Gourgeist-S can pick off weakened Simipour with their powerful priority attacks. Lastly, Electabuzz is a particularly notable revenge killer and overall threat to non-Choice Scarf variants of Simipour, as it outspeeds Simipour, threatens a cold OHKO with Thunderbolt, and can grab momentum with Volt Switch after forcing Simipour out.</p>",
    "sets": {
      "Nasty Plot": {
        "description": "<p>Nasty Plot Simipour is one of ZU's premier wallbreakers and sweepers with its excellent combination of Speed and Special Attack, taking advantage of the many switches it forces due to its powerful STAB Hydro Pump to create progress for its team. Ice Beam acts as coverage for tmany Grass-type Pokemon like Simisage, Servine, and Gogoat. Hidden Power Grass is used as coverage for other Water-type Pokemon like Seaking and Politoed, while Substitute is used to ease prediction, help safely set up Nasty Plot, and bring Simipour closer to both Salac Berry and Torrent range.</p> <p>Simipour often struggles to switch in safely due to its poor bulk, so it appreciates pivoting teammates like Electabuzz, Vibrava, and Dustox. Grass-type teammates like Gogoat and Servine love Simipour's ability to take advantage of opposing Fire-type Pokemon like Magmar and Pignite, while Simipour appreciates their ability to take on opposing Water-type Pokemon like Politoed and Whiscash. Simipour also appreciates teammates that beat common Grass-types that resist its Hydro Pump like Magmar and Swoobat. Teammates like Sawsbuck, Klang, and Krokorok appreciate Simipour's ability to pressure common physical walls like Gigalith, Wigglytuff, and Gourgeist-L. Lastly, Simipour struggles greatly against Electabuzz, so specially defensive teammates like Bronzor and Swalot as well as Volt Switch-immune teammates like Vibrava, Krokorok, and Whiscash are greatly appreciated to help withstand its repeated assaults and dissuade Volt Switch.</p>"
      },
      "Choice Scarf": {
        "description": "<p>Choice Scarf Simipour excels as a revenge killer and cleanerwith its powerful STAB Hydro Pump augmented by excellent coverage in Ice Beam and Superpower, the former hitting Grass-types and the latter hitting Scraggy and special walls like Bronzor and bulky Klang for solid damage. Knock Off helps Simipour make progress early- and mid-game, removing key held items like Leftovers and Eviolite to benefit itself and its teammates. Hidden Power Grass can be used over Superpower to give Simipour a tool to hit opposing Water-types, but this means that it struggles with opposing Scraggy and has to rely more on Hydro Pump's shaky accuracy and limited PP against special walls.</p> <p>Simipour often struggles against opposing Water-type Pokemon, so Grass-type teammates like Servine and Electric-type teammates like Electabuzz are greatly appreciated to take them on. Simipour is also incredibly prediction-reliant against opposing Grass-types, so Fire-type teammates like Magmar and Pignite can help punish them if they switch safely into its STAB Hydro Pump. Teammates that can safely bring it in like Electabuzz and Vibrava also work well with Simipour, which has poor natural bulk. Lastly, Simipour loves having teammates with entry hazard support to weaken its checks, so partners like Gigalith, Bronzor, and Quilladin are greatly appreciated.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 598623, "username": "BaitWiz"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 543866, "username": "5Dots"}, {"user_id": 226429, "username": "Jett"}]}, {"name": "Grammar checked by", "members": [{"user_id": 470115, "username": "SolarBeam"}]}]}
  },
  "Unfezant": {"sets": {"Physical Wallbreaker": {}}},
  "Swoobat": {
    "comments": "<h3>Other Options</h3> <p>Heat Wave can be run in the last slot on Swoobat's Choice Specs set to hit all three Steel-types, but this leaves it reliant on its teammates to get through Duosion. Heat Wave can also work on its Calm Mind set instead of one of its support moves in order to hit the Steel-types, allowing it to apply more immediate pressure but limiting its longevity. Swoobat can run dual screens with its great Speed and support movepool of Taunt and U-turn, though it faces strong competition from Meowstic because it does not have Prankster.</p> <h3>Checks and Counters</h3> <p><strong>Steel-types</strong>: Klang, Lairon, and Bronzor all resist Swoobat's STAB moves. However, Bronzor is 2HKOed by Shadow Ball after Stealth Rock. Lairon can't reliably switch into Swoobat more than two times unless it's running a bulky set, and it also has to be wary of Hidden Power Ground.</p> <p><strong>Psychic-types</strong>: Defensive Pivot Duosion can easily take hits from Swoobat's STAB moves, threaten it with paralysis, and heal back any damage taken with Regenerator. Meowstic can set up Light Screen to take hits from Swoobat and also has the option to cripple it with Thunder Wave, while Lunatone resists both of Swoobat's STAB moves and can threaten it back with Power Gem. However, they all fear coming into a Shadow Ball or U-Turn.</p> <p><strong>Faster Attackers</strong>: Persian and Choice Scarf users like Krokorok, Simipour, and Vanilluxe can outspeed and reliably KO Swoobat with their STAB moves. Priority users such as Huntail, Furfrou, and Pikachu also threaten Swoobat, although less reliably because Swoobat can avoid Sucker Punch by using Substitute or tank Extreme Speed at +2 Defense.</p> <p><strong>Bulky Attackers</strong>: The likes of Electabuzz, Gigalith, and Politoed can all stomach a hit from Swoobat and OHKO it back.</p> <p><strong>Chip Damage</strong>: Stealth Rock and status like poison or burn can severely limit the longevity of Swoobat, giving it a harder time at functioning properly.</p>",
    "sets": {
      "Choice Specs": {
        "description": "<p>Swoobat sets itself apart as a special wallbreaker and revenge killer with its incredible Speed stat, outpacing other fast Pokemon like Electabuzz, Jumpluff, and Simipour. Swoobat's offensive STAB moves are only resisted by the few Steel-types in the tier, making it very hard to switch into. U-turn gives Swoobat the ability to pivot out of these Steel-types like Lairon and Klang so its teammates can chip them down. Shadow Ball hits Bronzor and Duosion for big damage. Trick is an option to cripple the Steel-types trying to switch into it as well as Dusclops, which would otherwise wall it. Hidden Power Ground gives Swoobat an option to 3HKO Klang and OHKO Lairon, but having no way around Bronzor and Duosion is less than ideal.</p> <p>Special sweepers like Simipour, Servine, and Vanilluxe appreciate Swoobat's ability to break through or cripple special walls like Duosion and Klang. Pokemon like Scraggy, Pignite, and Magmar make great partners, since they can be brought into favorable matchups versus the Steel-types that like to switch into Swoobat. Swoobat can check Grass-types like Servine, Simisage, and Quilladin, so the likes of Huntail and Gigalith appreciate it as a teammate. Entry hazard removers like Dustox and Vibrava are beneficial, since they provide Swoobat more longevity and give reliable entry against the opposing team with their slow pivot. Due to Swoobat's mediocre defensive stats, it is susceptible to getting revenge killed by Persian and Choice Scarf users like Krokorok; it really needs teammates that can take on these threats like Carbink and Meganium, respectively. VoltTurn teams get the most out of Swoobat because it has such a hard time hitting the field with its defensive profile, so pivots like Electabuzz, Furfrou, and Frogadier are helpful partners.</p>"
      },
      "Calm Mind": {
        "description": "<p>Swoobat works as a great Calm Mind sweeper with its fantastic Speed, solid movepool, and its ability Simple. Stored Power is Swoobat's best Psychic-type STAB move, since it can accrue boosts quickly with Kee Berry + Calm Mind, surpassing Psychic's power after a single Calm Mind. However, Psychic can be used for more immediate damage and to revenge kill weakened or frailer foes like Simisage and Simipour. Signal Beam helps it hit the likes of Krokorok, Bronzor, and Duosion. Roost gives Swoobat a reliable recovery option to ease setting up, whereas Substitute blocks status from Pokemon like Servine, Klang, and Carbink and protects Swoobat from Sucker Punch from the likes of Furfrou and Pignite. Taunt takes on a similar status-blocking role like Substitute, but it has the added benefit of shutting down other utility moves like Calm Mind from Duosion, RestTalk from Klang, and Haze from Dusclops. Kee Berry boosts Stored Power more quickly and works around strong physical attackers like Persian and Pignite, whereas Leftovers helps Swoobat gain some passive recovery while it boosts up against slower attackers or is behind a Substitute.</p> <p>Swoobat works best on hyper offensive teams that are looking for a sweeper. Meowstic is a great support Pokemon alongside Swoobat, with its dual screens giving Swoobat a much easier time at boosting in front of strong foes. Special wallbreakers like Magmar and Simipour help break down walls like Klang, Scraggy, and Dusclops, giving Swoobat an easier job at sweeping. Physical wallbreakers like Pignite, Sawsbuck, and Krokorok can make Swoobat's sweep easier, since they can help chip down threats like Gigalith, Politoed, and Bronzor. Entry hazard removers like Vibrava and Dustox as well as Taunt users like Pignite and Krokorok are vital, since they help Swoobat avoid taking too much chip damage. Hazard setters like Marshtomp, Whirlipede, and Gigalith help ease Swoobat's sweep, letting it hit KO ranges like OHKOing Offensive Stealth Rock Krokorok with +2 Signal Beam after Stealth Rock and a layer of Spikes.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 601970, "username": "sleid"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 296755, "username": "5gen"}, {"user_id": 543866, "username": "5Dots"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}, {"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Palpitoad": {"sets": {"Defensive Stealth Rock": {}}},
  "Whirlipede": {"sets": {"Offensive Spikes": {}, "Defensive Spikes": {}}},
  "Krokorok": {
    "comments": "<h3>Other Options</h3> <p>Iron Tail can be used to deal with Fairy-types like Wigglytuff and Carbink but generally isn't worth using over Krokorok's other moves due to its unreliability.</p> <h3>Checks and Counters</h3> <p><strong>Grass-types</strong>: Quilladin comfortably avoids being 2HKOed by even Choice Band Krokorok. Other bulky Grass-types like Servine and Gogoat are reliable answers to only its non-Choice Band sets. Colbur Berry Gourgeist-L can also threaten Krokorok with a burn, severely limiting its offensive presence. Faster Grass-types like Simisage and Sawsbuck have no trouble revenge killing Krokorok, with their Choice Scarf variants also outpacing Choice Scarf Krokorok. Jumpluff doesn't mind Knock Off and is immune to Earthquake but must be wary of Stone Edge.</p> <p><strong>Water-types</strong>: Frogadier and Simipour outspeed Krokorok and threaten to OHKO it, and their Choice Scarf sets outrun Choice Scarf Krokorok, but neither enjoys switching into Krokorok. Politoed and Marshtomp are bulky enough to withstand at least one hit from Krokorok and KO it back with their STAB attacks.</p> <p><strong>Ice-types</strong>: Vanilluxe and Glalie force Krokorok out with Ice Beam, but they cannot safely switch into its attacks.</p> <p><strong>Fighting-types</strong>: Scraggy and Mienfoo resist Krokorok's Dark-type attacks and have Drain Punch to mitigate the damage it does inflict, making them solid answers, although they dislike losing Eviolite.</p> <p><strong>Wigglytuff</strong>: Wigglytuff resists Knock Off and nails Krokorok with Dazzling Gleam. It also can use Wish and Protect to stall out Krokorok.</p> <p><strong>Faster Attackers</strong>: Persian, Furfrou, and Magmar can revenge kill Krokorok, and Choice Scarf variants of the last two can even outpace Choice Scarf variants of it.</p>",
    "sets": {
      "Offensive Stealth Rock": {
        "description": "<p>Krokorok is a rare breed of Stealth Rock setter, as it does not possess the bulk of Gigalith and Carbink, nor is it a dedicated lead like Dwebble. Instead, it boasts respectable Speed and Attack stats that let it make great use of its potent STAB combination; Earthquake threatens Knock Off absorbers like Swalot and Trubbish, while Knock Off cripples common switch-ins like Servine, Vibrava, and Quilladin. Taunt prevents Defog attempts from Dustox and Vibrava, as well as shutting down opposing entry hazard setters such as Whirlipede and Hippopotas. Pursuit can also be used in the last slot to trap Psychic-types like Duosion and Bronzor, which want to avoid Knock Off at all costs. Intimidate is generally preferred, as it allows Krokorok to avoid being OHKOed by Lairon's Superpower and serve as a more reliable Pikachu answer, although Moxie can further increase the gains from a successful Pursuit.</p> <p>Krokorok works well on offensive and balanced teams that value its utility; common wallbreakers on these archetypes such as Simisage, Pignite, and Swalot are great beneficiaries of Krokorok's ability to remove Steel-, Poison-, and Psychic-types. In return, they cover its weaknesses against the likes of Politoed, Quilladin, and Wigglytuff, respectively. Similarly, setup sweepers appreciate Krokorok's support, with Klang and Sawsbuck faring best against most of Krokorok's weaknesses. While Krokorok is a Ground-type, it cannot switch into Electabuzz safely, as it is OHKOed by Focus Blast and takes heavy damage from Hidden Power Ice. Having more reliable Electabuzz switch-ins is therefore important,so Duosion, Servine, and Whiscash make for some good teammates. Spikers like Quilladin, Trubbish, and Frogadier form entry hazard-stacking cores with Krokorok, making great use of its Taunt. Additionally, Krokorok dissuades Poison-types from switching in, allowing poison from Toxic Spikes to be spread more effectively.</p>"
      },
      "Choice Band": {
        "description": "<p>Krokorok is one of the most feared physical wallbreakers in the metagame, as its STAB combination is difficult for even defensive Pokemon to switch into. Reliable answers to non-Choice Band Krokorok like Servine, Vibrava, and Meganium are vulnerable to being 2HKOed by Choice Band-boosted Knock Off. Knock Off also removes Eviolite from Hippopotas and Quilladin, which allows Krokorok to 2HKO them with Earthquake and Assurance with one layer of Spikes, respectively. Earthquake OHKOes Pignite and deals heavy damage to other Dark-resistant Pokemon like Carbink, Scraggy, and Wigglytuff. Pursuit OHKOes Duosion and Swoobat that are trying to switch out and heavily chips Bronzor. Assurance is Krokorok's strongest option against incoming switch-ins like Jumpluff, Politoed, and Furfrou when entry hazards are up, while Stone Edge is Krokorok's best option for Flying-types like Jumpluff and Pidgeot. Intimidate offers some defensive utility against physical attackers like Swalot and opposing Krokorok, whereas Krokorok is not able to make great use of Moxie, as it will likely be forced out by a faster threat whenever it picks up a KO.</p> <p>Setup sweepers and Choice Scarf users such as Lairon, Dragon Dance Scraggy, Simipour, and Simisage can more easily clean as a result of Krokorok's wallbreaking capabilities. Swalot, Jumpluff, and Meowstic-F appreciate Krokorok's ability to remove Psychic-types like Duosion and Bronzor. In return, they can check Grass-types for Krokorok or act as sweepers themselves. Entry hazard support from Carbink, Whirlipede, and Glalie wears down physically defensive walls like Quilladin and Hippopotas, allowing Krokorok to overwhelm them. It also helps Krokorok to secure better KO ranges; a single layer of Spikes allows Krokorok to OHKO the likes of Dustox, Gigalith, Swalot, and Klang. Krokorok is threatened out by faster Grass-types like Simisage, Jumpluff, and Sawsbuck, so switch-ins to them like Swalot and Gourgeist-L are ideal teammates. Similarly, Krokorok has issues against fast Water-types like Simipour and Frogadier; some good answers to them include Politoed, Servine, and Dustox. Steel-types like Klang, Bronzor, and Lairon help Krokorok's poor matchup against Vanilluxe and Wigglytuff, as well as being solid switch-ins to some of the aforementioned Grass-types.</p>"
      },
      "Choice Scarf": {
        "description": "<p>Choice Scarf Krokorok makes for a great choice for teams in need of a cleaner and revenge killer. Knock Off allows Krokorok to provide utility outside of its main roles by weakening item-dependent Pokemon like Servine, Marshtomp, and Vibrava. Earthquake revenge kills the likes of Electabuzz, Magmar, and +2 Speed Rock Polish Lairon after Stealth Rock chip damage. The additional Speed gained from Choice Scarf allows Krokorok to more reliably trap Swoobat, and it remains a good option in punishing escaping Duosion and Bronzor. Stone Edge is Krokorok's best option for revenge killing Flying-types like Jumpluff and Murkrow, while Assurance synergizes greatly with entry hazards and is Krokorok's best option against fully evolved defensive Grass-types such as Gogoat and Meganium. Moxie is preferred over Intimidate, as it allows Krokorok to snowball after a KO, and unlike its other sets, Choice Scarf means fewer Pokemon can revenge kill it.</p> <p>Krokorok benefits greatly when paired with strong wallbreakers like Simisage, Pignite, and Lairon, which can pave the way for it to clean up teams. Grass-types are a nuisance to Krokorok, as Earthquake and Knock Off bounce off defensive walls like Quilladin and Meganium, while Choice Scarf Grass-types like Simisage and Servine can revenge kill it. Therefore, Grass-resistant and -immune Pokemon such as Ivysaur, Klang, and Gogoat make for good partners. Choice Scarf Water- and Ice-types like Frogadier and Vanilluxe are also faster than Krokorok, with solid answers to them including Politoed and Bronzor, respectively. Gourgeist-L and Swalot can cover Krokorok's weakness to Fighting-types like Mienfoo and Scraggy, respectively, and have solid defensive profiles that generally synergize well with it. In return, Krokorok is able to deal with Fire-types like Magmar and Psychic-types like Bronzor and Duosion for them,respectively. Krokorok benefits greatly from entry hazard support from Gigalith, Lairon, and Trubbish, as this helps wear down bulky Pokemon like Scraggy, Ivysaur, and Marshtomp into its cleaning range.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 226429, "username": "Jett"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 543866, "username": "5Dots"}, {"user_id": 601970, "username": "sleid"}]}, {"name": "Grammar checked by", "members": [{"user_id": 569291, "username": "zinnias"}, {"user_id": 652656, "username": "Gambit"}, {"user_id": 470115, "username": "SolarBeam"}]}]}
  },
  "Dwebble": {"sets": {"Entry Hazard Lead": {}}},
  "Scraggy": {
    "comments": "<h3>Other Options</h3> <p>Iron Head can be used on the Dragon Dance set to 2HKO Carbink on the switch, though it lacks any other targets, and the utility of Taunt or Rest is preferred.</p> <h3>Checks and Counters</h3> <p><strong>Fairy-types</strong>: Even with Iron Head, Fairy-types like Carbink and Wigglytuff are bulky enough to take at least one hit from Scraggy and OHKO it with their Fairy-type STAB moves.</p> <p><strong>Fighting-types and Fighting-type coverage</strong>: Mienfoo outspeeds all Scraggy variants and can threaten it out with High Jump Kick and Knock Off. While Pignite doesn't outspeed offensive Scraggy variants, it can take at least any +1 Attack hit and threaten it out with its own Fighting-type STAB moves, and can even phaze Bulk Up Scraggy with Roar. Pokemon sporting Fighting-type coverage, like Magmar and Electabuzz, can discourage Scraggy from setting up.</p> <p><strong>Poison-types</strong>: Swalot and Ivysaur resist Scraggy's Fighting-type STAB moves and have enough bulk to take Knock Off reasonably well. They can wear it down with Rocky Helmet chip damage and Leech Seed, respectively. Offensive Poison-types like a healthy Seviper and Gastly can use Final Gambit and Dazzling Gleam, respectively, to threaten huge damage on Scraggy.</p> <p><strong>Flying-types</strong>: While they cannot switch in safely, Flying-types like Pidgeot, Swoobat, and Jumpluff can threaten Scraggy out with their STAB moves; Jumpluff does particularly well as it does not run an item and therefore takes less damage from Knock Off.</p> <p><strong>Physical Wallbreakers</strong>: Scraggy's physical bulk without a Bulk Up boost is mediocre, so wallbreakers like Furfrou and Sawsbuck can threaten heavy damage on Scraggy and jeopardize its sweeping attempts. Even at +1 Speed, offensive Scraggy is outpaced by revenge killers like Simisage, Jumpluff, and Furfrou.</p>",
    "sets": {
      "Bulk Up": {
        "description": "<p>With a fantastic typing, ability, and good bulk, Bulk Up Scraggy makes for a terrific defensive setup sweeper. Drain Punch is preferred over its other Fighting STAB moves, giving it additional longevity. Knock Off threatens out Fighting-resistant and -immune targets like Duosion and Dusclops, while crippling bulky walls like Ivysaur and Dustox. Rest allows Scraggy to get rid of any status it had and makes it healthy again. Shed Skin allows for Scraggy to potentially wake up earlier and makes it a solid status absorber.</p> <p>Scraggy pairs excellently in bulky balance and stall builds as a status absorber, Knock Off user, and a wincon in one slot. Unlike other Dark-types, Scraggy is able to wall Psychic-types like Meowstic-F and Duosion through its typing and bulk, which other Dark-types have trouble doing. Physical walls like Bronzor and Swalot make for excellent partners; both can provide utility via setting up Stealth Rock and absorbing Knock Off, respectively, and resist Fairy-type attacks from Carbink. Additionally, Bronzor can resist Flying-type attacks from Jumpluff. Clerics like Meganium and Wigglytuff can make Scraggy less reliant on Rest and Shed Skin, and the latter can even pass large Wishes to augment Scraggy's longevity. In return, Scraggy can make progress for its team through Knock Off support, crippling item-reliant Pokemon like Politoed and Servine, while consistently walling Duosion's Future Sights. Physical walls like Hippopotas and Carbink can often halt its progress as a late-game sweeper, so checks to them like Ivysaur and Bronzor can be quite helpful. Conversely, Scraggy can help its teammates out through walling defensive staples like Bronzor, Duosion, and Dustox, while also taking on special attackers like Electabuzz, Frogadier, and Vanilluxe in a pinch.</p>"
      },
      "Dragon Dance": {
        "description": "<p>Dragon Dance Scraggy is a terrifying cleaner with its threatening STAB moves and solid Speed and power after a boost. Knock Off cripples many Eviolite- and item-reliant Pokemon like Bronzor and Politoed. High Jump Kick's higher Base Power enables Scraggy to achieve benchmarks Drain Punch would not, such as securing OHKOs on Furfrou, and Magmar, and having a good chance to OHKO Huntail after Stealth Rock, all at +1 Attack. Drain Punch can be used as a safer move against Protect users like Politoed and Ghost-types like Dusclops. Taunt stops bulky Pokemon like Whirlipede, Dustox, and Vibrava from using their utility moves, enabling Scraggy to continue setting up and potentially snowball KOs with Moxie boosts. Rest can be used alongside Shed Skin to make status less effective against Scraggy, though it can be unreliable when dealing with offensive pressure.</p> <p>Unlike the previous set, Dragon Dance Scraggy works better on offensive teams, working together to overwhelm the opposition with repeated attacks. Setup sweepers like Dragonair, Simipour, and Swoobat work nicely alongside Scraggy, looking to overwhelm checks it struggles against like Electabuzz, Carbink, and Swalot, respectively. In return, Scraggy can break down defensive stalwarts like Bronzor, Dustox, and Klang. Meowstic-M stands out as a great support partner, setting up screens and spreading status via Thunder Wave so that Scraggy has an easier time breaking or cleaning. Entry hazard setters like Gigalith and Whirlipede can make offensive benchmarks easier to achieve.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 543866, "username": "5Dots"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 601970, "username": "sleid"}, {"user_id": 226429, "username": "Jett"}]}, {"name": "Grammar checked by", "members": [{"user_id": 229690, "username": "queez"}]}]}
  },
  "Trubbish": {"sets": {"Defensive Spikes": {}, "Offensive Spikes": {}}},
  "Gothitelle": {"sets": {"Calm Mind": {}}},
  "Duosion": {
    "comments": "<h3>Other Options</h3> <p>Hidden Power Fighting is coverage that can also nail Steel-types like Klang but is marginally worse against Dark-types and weaker against opposing Duosion and bulky Grass-types such as Servine, Meganium, and Gogoat. The combination of Night Shade + Infestation and some investment in Speed allows Duosion to beat out the standard Future Sight variants of itself.</p> <h3>Checks and Counters</h3> <p><strong>Dark-types</strong>: While they must be wary of coverage moves, Krokorok and Mightyena can OHKO Future Sight Duosion and are immune to its Psychic-type attacks. Krokorok can also punish Duosion trying to switch out with Pursuit. Scraggy is also bulky enough to safely switch into Duosion and threaten to set up on it.</p> <p><strong>Item Removal</strong>: Since Duosion is heavily reliant on its Eviolite, Knock Off from the likes of Servine, Simipour, and Ivysaur can severely limit its ability to pivot or its setup opportunities. Trick and Switcheroo users such as Swoobat, Lopunny, and Seviper can also disrupt Duosion's ability to recover and set up.</p> <p><strong>Phazers</strong>: Notable examples include Roar Scraggy, Whirlwind Hippopotas, and Dragon Tail Meganium, but with the exception of Scraggy, most phazers must be wary of letting Duosion set up too much beforehand.</p> <p><strong>Taunt</strong>: Taunt users such as Quilladin and Pignite can shut down Duosion's setup attempts, although not all of these Pokemon can easily switch into Duosion even before it starts boosting.</p> <p><strong>Wallbreakers</strong>: With physically defensive EV spreads, if Duosion has suffered minor chip damage, strong wallbreakers like Choice Specs Vanilluxe and Simisage can overwhelm it. Similarly, Choice Band Lairon can tear through specially defensive Duosion sets.</p> <p><strong>Klang</strong>: Klang is a problem for Duosion, as it doesn't take much from Duosion's attacks and can therefore use it as an opportunity to set up, although offensive sets must be wary of Thunder Wave.</p>",
    "sets": {
      "Defensive Pivot": {
        "description": "<p>With the coveted Regenerator and solid bulk thanks to Eviolite, Duosion is the metagame's premier defensive pivot and a staple on many balance teams. Unlike other walls, Duosion circumvents passivity issues by possessing an incredibly high Special Attack stat and Future Sight. This allows it to double up as an excellent progress-maker against most of the metagame due to bulky Psychic-resistant and -immune Pokemon being hard to come by. Signal Beam nails frail Dark-type Pokemon such as Krokorok and Mightyena; the former is especially threatening if it gets in safely because it commonly utilizes Pursuit. Protect not only allows Duosion to scout Choice Krokorok sets but also synergizes greatly with Future Sight. Alternatively, Thunder Wave can punish foes like Servine and offensive Klang sets that may attempt to boost on Duosion. The EV spread allows Duosion to reliably switch into Electabuzz's Volt Switch and heal off any damage with Regenerator. Magic Guard is an alternative that allows Duosion to bypass residual damage from entry hazards and status, although this worsens its functionality as a pivot.</p> <p>Duosion pairs well with Pokemon that take advantage of its Future Sight; some of the most notable examples are Pignite, Simisage, and Scraggy, as they can all hit Dark- and Steel-types for super effective damage and appreciate Future Sight threatening Poison- and Fighting-types switching in. These Pokemon tend to also have the added benefit of covering Duosion's defensive weaknesses. Pignite and Scraggy sometimes use Roar when paired with Future Sight Duosion, as it can phaze in preferred targets. Physically bulky Pokemon like Lairon, Hippopotas, and Gourgeist-L all appreciate Duosion's ability to withstand even the strongest of special attacks from the likes of Simipour, Vanilluxe, and Magmar. Due to Duosion's middling defensive stats without Eviolite, it should be paired with Knock Off absorbers such as Swalot, Jumpluff, and Carbink. Entry hazards punish switching around Future Sight even more, so setters like the aforementioned Carbink and Gigalith as well as Quilladin and Frogadier can make for good partners.</p>"
      },
      "Calm Mind": {
        "description": "<p>Duosion makes for one of the best defensive setup sweepers in the metagame thanks to Magic Guard letting it ignore damage from status and entry hazards. Psyshock can be used over Psychic to win Calm Mind wars against Carbink and opposing setup Duosion. Acid Armor stops physical attackers such as Pignite, Lairon, and Klang from breaking past it, while Signal Beam provides it a means to get around Dark-types like Krokorok and Murkrow.</p> <p>If Duosion is opting for Acid Armor, it is imperative that your team is able to remove Dark-types prior to setting up. Some examples that match up well against Dark-types are Pignite, Carbink, and Wigglytuff. These Pokemon also make for good partners for non-Acid Armor variants, as they can switch into potential revenge killers like mixed Simisage and Choice Band Krokorok. Non-Acid Armor Duosion also appreciates help from Pignite and Hippopotas to help it with Klang, since Klang will win the setup war. If you opt for Psychic over Psyshock, then Steel- and Dark-types such as Klang, Lairon, Scraggy, and Zweilous cover Calm Mind Carbink and opposing Duosion, respectively. To have an easier time setting up late-game, preserving Duosion's Eviolite is pivotal, so Sticky Hold Pokemon like Swalot and Trubbish make for good teammates. They also have the added benefit of spreading status via Toxic and Toxic Spikes, which is another means for Duosion to stall out Dark-types if necessary. Wallbreakers like Vanilluxe and Magmar can take advantage of defensive phazers and Taunt users such as Hippopotas, Meganium, and Quilladin, which are typically troublesome for Duosion's setup attempts.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 226429, "username": "Jett"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 543866, "username": "5Dots"}, {"user_id": 601970, "username": "sleid"}]}, {"name": "Grammar checked by", "members": [{"user_id": 470115, "username": "SolarBeam"}]}]}
  },
  "Sawsbuck": {
    "comments": "<h3>Other Options</h3> <p>Synthesis could be used for additional longevity when wallbreaking, though Sawsbuck can't give up any of its coverage, and Simisage does this better due to its higher Speed and greater diversity in coverage. Choice Band amplifies Sawsbuck's offensive power, though its only good Speed and prediction-reliant nature make its standard sets preferable. Silk Scarf empowers Sawsbuck's Normal-type attacks without any recoil at the expense of its coverage and Grass-type attacks.</p> <h3>Checks and Counters</h3> <p><strong>Bronzor</strong>: Bronzor is Sawsbuck's worst matchup, as it resists both of Sawsbuck's STAB moves, doesn't take much damage from its coverage moves, and can whittle it down with Toxic and Psywave.</p> <p><strong>Dusclops</strong>: Dusclops is immune to Sawsbuck's Normal-type STAB moves, can cripple it with Will-O-Wisp or Toxic, and can proceed to wear it down with Seismic Toss. Due to Dusclops's low HP, Sawsbuck doesn't gain a lot of HP from Horn Leech, and Dusclops can also heal any damage taken with Rest. Offensive Dusclops variants can also threaten Sawsbuck out with Ice Punch.</p> <p><strong>Poison-types</strong>: Physically defensive Poison-types like Swalot, Ivysaur, and Trubbish can stomach even a +2 Return from Sawsbuck and retaliate with their STAB moves. However, only Trubbish survives when Stealth Rock is taken into consideration. Offensive Poison-types like Choice Scarf Seviper and Choice Scarf Gastly can outspeed Sawsbuck variants without Choice Scarf and revenge kill it, though they cannot switch into it.</p> <p><strong>Grass-types</strong>: Both Gourgeist formes can easily take all of Sawsbuck's coverage, force it out through Will-O-Wisp or Foul Play, and recover any damage taken with Synthesis. Faster Grass-types like Jumpluff and Simisage can also force out non-Choice Scarf Sawsbuck with STAB Acrobatics and coverage, respectively.</p> <p><strong>Flying-types</strong>: Flying-types like Swoobat and Pidgeot can switch into Horn Leech and threaten Choice Scarf Sawsbuck not locked into its Normal-type STAB moves.</p> <p><strong>Revenge Killers</strong>: Despite Sawsbuck's respectable Speed, faster attackers like Electabuzz, Frogadier, and Simipour can defeat it with minimal prior chip damage, and Choice Scarf variants of these Pokemon can even pick off Choice Scarf variants of Sawsbuck.</p>",
    "sets": {
      "Swords Dance": {
        "description": "<p>Sawsbuck is an excellent setup sweeper with Swords Dance, owing to its good Speed, power, and typing. Double-Edge is preferred over Return, always 2HKOing Servine and OHKOing Simisage. Return can be used instead if Sawsbuck does not wish to suffer recoil, but it misses these benchmarks. Horn Leech targets Normal-resistant and immune Pokemon like Gigalith, Carbink, and Dusclops. Jump Kick is its preferred coverage move, hitting Steel-types like Klang and Lairon harder than any of its other moves do. Sap Sipper allows Sawsbuck to pivot into Grass-type attacks freely while also enhancing its wallbreaking prowess. If used on sun teams, an Adamant nature and Chlorophyll are necessary for it to outspeed the entire unboosted metagame under sun while hitting as hard as possible.</p> <p>Sawsbuck does excellently on balance and offensive teams, where it can leverage its good Speed and offensive prowess to punch holes early-game as a wallbreaker or clean up late-game. It struggles the most against Bronzor and physically bulky Poison-types like Swalot and Ivysaur; checks to these threats like Magmar and Krokorok help it break through these checks more easily. Defensive backbones strong against these threats, like the aforementioned Poison-types and Duosion, can preserve Sawsbuck's health. Late-game sweepers like Simipour and Calm Mind Swoobat can help clean up the opposition and take advantage of Sawsbuck's wallbreaking. Wallbreakers like Magmar and Vanilluxe make Sawsbuck harder to stop late-game.</p>"
      },
      "Choice Scarf": {
        "description": "<p>Sawsbuck makes for a notable cleaner and revenge killer, getting the jump on the entire unboosted metagame and able to check fast threats like Simipour, Simisage, and Persian well. Without a damage-boosting item, Double-Edge's strength is necessary over Return's lack of recoil—the extra power allows Sawsbuck to always 2HKO Pignite without needing Stealth Rock and have a good chance of OHKOing Simisage with Stealth Rock. Jump Kick is its strongest coverage against Steel-types like Lairon and Klang. Megahorn 2HKOes Grass-types like Gogoat and Servine and is its strongest coverage move against Bronzor. Toxic puts walls like Gourgeist formes and Dusclops on a timer.</p> <p>As this set emphasizes Sawsbuck's Speed to let it revenge kill, it tends to struggle more against checks like the aforementioned Bronzor and bulky Poison-types. Wallbreakers like Pignite and Choice Band Lairon can threaten the opposition, making Sawsbuck's attacks even harder to switch into. Walls like Swalot and Gigalith can provide a cushion for physical attacks to give Sawsbuck opportunities to perform later into the game. Pivots like Electabuzz and Dustox can help get Sawsbuck onto the field more safely, and special attackers like Frogadier and Magmar can threaten bulky checks that it often has trouble getting past.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 543866, "username": "5Dots"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 226429, "username": "Jett"}, {"user_id": 601970, "username": "sleid"}]}, {"name": "Grammar checked by", "members": [{"user_id": 470115, "username": "SolarBeam"}]}]}
  },
  "Emolga": {"sets": {"Offensive Pivot": {}}},
  "Klang": {
    "comments": "<h3>Other Options</h3> <p>Klang can run a set with maximum Attack and Speed with Wild Charge + Return over RestTalk on hyper offensive teams to act as a more immediate offensive presence, since it can heavily damage checks like Politoed with Wild Charge and Magmar with Return. Klang can also run a specially defensive set with Iron Defense in place of Sleep Talk to act as a difficult-to-break sweeper that takes advantage of its great typing and bulk, although it becomes very passive when it uses Rest.</p> <h3>Checks and Counters</h3> <p><strong>Fire-types</strong>: Pignite and Magmar can take hits from Klang without issue and threaten it back with their powerful STAB moves. However, they do have to wary of taking a Toxic from Klang's defensive pivot set.</p> <p><strong>Ground-types</strong>: Marshtomp, Hippopotas, Whiscash, and Vibrava all take Gear Grind very well, block Volt Switch, and hit back hard with their Ground-type STAB moves, giving Klang a tough time at doing its job. Hippopotas can notably phaze it with Whirlwind. However, none of these Pokemon like Toxic and will struggle to hold off Klang if it gets a few Shift Gear boosts.</p> <p><strong>Politoed</strong>: Politoed deters offensive Klang from setting up with the combination of Encore and Scald, and it takes miniscule damage from Volt Switch. However, it doesn't want to take a Toxic because it relies on Leftovers for healing.</p> <p><strong>Gourgeist-L</strong>: Gourgeist-L entirely walls offensive Klang with Will-O-Wisp, Leech Seed, and Foul Play, punishing Klang for trying to set up on it. It does not want to get hit by Toxic, since it will limit its ability as a physical wall.</p> <p><strong>Item Removal</strong>: The likes of Persian, Ivysaur, and Servine all threaten Klang with Knock Off if it has to switch in to help take a hit. Losing Eviolite greatly weakens Klang's ability to set up and sweep or act as a specially defensive wall. Trick and Switcheroo users like Swoobat and Lopunny can swap Klang's Eviolite for a debilitating item like Choice Specs or Flame Orb.</p> <p><strong>Faster Threats</strong>: Electabuzz, Dragon Dance Scraggy, and offensive Swalot can take hits from Klang fairly well and hit back with great damage. Choice Scarf users like Simipour and Magmar can even come in and greatly threaten offensive Klang, even after a Shift Gear boost.</p>",
    "sets": {
      "Shift Gear": {
        "description": "<p>Klang is a threatening setup sweeper with a great typing and Eviolite-boosted bulk, access to Shift Gear, and a powerful STAB move in Gear Grind. Klang can cover defensive holes and set up on Pokemon like Jumpluff, Furfrou, and Vanilluxe. After a Shift Gear boost, Klang is able to 2HKO bulky Servine and Scraggy as well as Vibrava and Simipour after Stealth Rock damage. RestTalk is Klang's only form of recovery, but it helps it heal off status moves like Will-O-Wisp from Gourgeist-L and Dusclops, Thunder Wave from Duosion, and Glare from Servine. 160 HP EVs give Klang the ability to avoid 3HKOs from Dusclops's Night Shade or Seismic Toss and from Bronzor's Psywave. 124 Speed EVs let Klang outspeed Furfrou, Simisage, and Simipour after using Shift Gear.</p> <p>Klang works best on offense or balance teams that are looking for a sweeper. Other physical setup users like Scraggy and Sawsbuck work well with Klang, since they can weaken the opposition so it can have a better chance at sweeping, and vice versa. Klang really struggles to sweep with Fire-types like Pignite and Magmar on the opposing team, so checks to them like Carbink and Vibrava are appreciated as partners. Politoed, Hippopotas, and Marshtomp all take Gear Grind very well and deter Klang due to Encore from the former and Ground-type STAB moves from the latter two. Teammates like Servine, Simisage, and Ivysaur help to eliminate this issue and also check Ground-types that might deter Klang from sweeping. Klang's natural bulk with Eviolite and defensive typing give it a favorable matchup against the likes of Jumpluff, Ivysaur, and Quilladin, which Politoed, Seaking, and Simipour all appreciate. Stealth Rock support from the likes of Marshtomp, Gigalith, and Krokorok helps Klang 2HKO Vibrava, Electabuzz, and Simipour after using Shift Gear.</p>"
      },
      "Double Dance": {},
      "Defensive Pivot": {
        "description": "<p>Klang functions as a great defensive pivot to enable offensive Pokemon like Simipour, Sawsbuck, and Magmar with its solid bulk and defensive typing. This set leverages its bulk and resistances to check threatening special attackers like Vanilluxe, Frogadier, and Servine. Gear Grind is usually preferred to chip down targets like Lairon, Scraggy, and Ivysaur; however, Toxic does well at chipping down common switch-ins like Pignite, Politoed, and Electabuzz. It also gives Klang the ability to pressure Ground-types like Hippopotas and Marshstomp, since Gear Grind can't get through them, which puts a damper Klang's its pivot role. RestTalk gives Klang reliable recovery and the ability to heal off status while still being able to pivot. Klang prefers minimum speed in order to move last as often as possible, giving its teammates free entry.</p> <p>Klang works well on balance teams looking for a teammate to facilitate offensive powerhouses like Pignite, Krokorok, and Simisage. Klang appreciates partners that can come in on Vibrava, Hippopotas, and Whiscash, since they block its Volt Switch, like Servine and Politoed. Fighting-types like Mienfoo, Scraggy, and Pignite all threaten Klang with their STAB moves, so teammates like Swalot and Carbink help alleviate this. The likes of Magmar and Hippopotas appreciate Klang's ability to come in on Water-types like Frogadier and Politoed. These same Water-types can rely on Klang to take on Servine, Simisage, and Quilladin for them. Klang relies on the bulk boost from Eviolite, so Knock Off absorbers like Swalot and Wigglytuff make for great teammates. Status inflictors such as Bronzor, Dustox, and Duosion can cripple potential teammates like Krokorok, Servine, and Lairon, making Klang a very helpful teammate, since it can absorb these status effects.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 601970, "username": "sleid"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 296755, "username": "5gen"}, {"user_id": 543866, "username": "5Dots"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}, {"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Eelektrik": {"sets": {"Defensive Pivot": {}}},
  "Lampent": {"sets": {"Substitute + Calm Mind": {}, "Offensive": {}}},
  "Mienfoo": {"sets": {"Offensive Pivot": {}, "Defensive": {}}},
  "Heatmor": {"sets": {"Wallbreaker": {}}},
  "Zweilous": {"sets": {"RestTalk": {}, "Choice Band": {}}},
  "Quilladin": {
    "comments": "<h3>Other Options</h3> <p>Stone Edge and Rock Slide threaten checks to Quilladin such as Jumpluff, Magmar, and Dustox with a lot of damage with one coverage move, but Quilladin's Zen Headbutt already threatens Dustox and entry hazard chip damage is so effective versus Magmar anyway. Quilladin has a deep movepool of coverage options like Poison Jab for opposing Grass-types, but other coverage moves tend to be weak, Quilladin struggles to fit them, and they offer very little extra coverage. Super Fang can deal a lot of damage to healthy targets and help Quilladin stallbreak better with Taunt, but it struggles to fit this move over coverage for its checks. Leech Seed can wear down foes like Klang, Swalot, and Wigglytuff that might try to take advantage of Quilladin, but this move makes Quilladin very passive when Synthesis is already reliable recovery.</p> <h3>Checks and Counters</h3> <p><strong>Strong Special Attacks</strong>: Special attackers can hit Quilladin on the weaker Special Defense and cut right through it. Frogadier and Vanilluxe have little issue KOing Quilladin, while other special attackers like Electabuzz, Servine, and Simisage often run super effective coverage for Grass-types.</p> <p><strong>Fire-types</strong>: Pignite and Magmar take little damage from Quilladin's Grass-type STAB move while threatening it out with their own Fire-type STAB moves, and Magmar's Flame Body can burn Quilladin to neuter it. Pignite must be wary of Zen Headbutt from offensive Quilladin, and neither Fire-type enjoys switching in repeatedly with entry hazards up.</p> <p><strong>Ground-immune Pokemon</strong>: Jumpluff, Bronzor, and Swoobat are unaffected by Spikes and take little damage from Quilladin's STAB moves, turning it into potential setup fodder. Bronzor is vulnerable to Taunt but shrugs off most of Quilladin's moves.</p> <p><strong>Knock Off</strong>: Offensive Pokemon that Quilladin checks like Servine, Krokorok, and Persian can commonly remove its Eviolite and make it less effective of a utility wall or tank.</p> <p><strong>Taunt and Encore</strong>: Servine and Scraggy can use Taunt to prevent Quilladin from phazing them or setting up its entry hazards, though defensive variants of the latter will get outsped and be afflicted with Taunt. Jumpluff and Swalot are hardly threatened by Quilladin's Grass-type attacks and can use Encore to turn it into setup fodder.</p>",
    "sets": {
      "Offensive Spikes": {
        "description": "<p>Rare access to Spikes makes Quilladin a threatening offensive entry hazard stacker. Bulky hazard removers like Vibrava and Dustox do little damage to Quilladin on their own and cannot use Defog or Recover on it due to Taunt. Taunt also prevents opposing hazard setters like Lairon and Bronzor from setting up Stealth Rock or putting Quilladin on a timer with Toxic. Wood Hammer is Quilladin's strongest physical attack and deals significant damage to physical tanks and walls like Gigalith and Carbink. Slower Grass-weak Pokemon like Huntail and Politoed are very vulnerable to Quilladin's Wood Hammer. Zen Headbutt lets it wear down Poison-types like Dustox, Swalot, and Ivysaur and potentially 2HKO Pignite after Stealth Rock. Drain Punch makes Quilladin worse versus Poison-types but lets it check Sawsbuck and pressure Klang and Scraggy better. Bulletproof is an excellent defensive ability, as it makes Quilladin immune to Sludge Bomb from Swalot and Ivysaur. Maximum Speed investment lets Quilladin quickly use Taunt against Pokemon like Lairon, Klang, and Scraggy to prevent them from setting up.</p> <p>Offensive Spikes Quilladin best fits on teams built to take advantage of entry hazards. Electric-types like Electabuzz and Pikachu generally have grounded checks like Meganium and Marshtomp that do not appreciate Spikes chip damage. Ice-types like Vanilluxe and Glaceon similarly benefit from Spikes chip damage on grounded foes like Pignite and Magmar while checking Grass-types like Servine and Jumpluff that would give Quilladin trouble. Defensive backbones like Politoed and Swalot can check the aforementioned Fire-types. Swalot in particular is a great partner to prevent Quilladin from being overwhelmed by previously mentioned offensive Grass-types. Persian especially benefits from Quilladin as a partner, as Quilladin and its Spikes wear Persian's checks like Gigalith and Carbink. Competitive Pokemon like Meowstic-F and Wigglytuff can punish Defog, where Meowstic-F threatens Poison-types that threaten Quilladin, while Wigglytuff can stack Stealth Rock on top of Quilladin's Spikes.</p>"
      },
      "Defensive Spikes": {
        "description": "<p>Quilladin's solid Eviolite-boosted bulk lets it comfortably set up Spikes on physical attackers like Gigalith, Lairon, and Krokorok. Roar synergizes nicely with Spikes, racking up entry hazard damage on switch-ins like Magmar and Swalot while phazing setup sweepers like Servine and Scraggy. Taunt prevents passive Pokemon like Bronzor and Carbink from setting up their own entry hazards and using recovery moves and setup sweepers like Bulk Up Scraggy from setting up. Seed Bomb is a good neutral move for Quilladin to wear down targets like Carbink, Gigalith, and Krokorok. Wood Hammer deals more damage than Seed Bomb but wears down Quilladin and forces it to use Synthesis more often.</p> <p>Defensive Spikes Quilladin works best on hazard-stacking teams looking for a bulkier backbone. Poison-types like Swalot, Steel-types like Lairon and Bronzor, and Magic Guard Duosion all make great partners for Quilladin by safely scouting for Toxic from the two most common Defoggers, Dustox and Vibrava. In turn, Quilladin checks Krokorok, which is very threatening to most Toxic-immune Pokemon. Pokemon like Persian, Electabuzz, and Vanilluxe make up for Quilladin's lack of damage output by thriving with Spikes chip damage on their typically grounded defensive checks. Politoed covers problematic Fire-types like Magmar and Pignite for Quilladin while appreciating the passive damage from Quilladin's Spikes and it bearing the burden of checking Rock- and Ground-types like Gigalith and Krokorok for it. Swalot can absorb Knock Off for Quilladin, bolstering its defensive longevity, and Swalot also checks offensive Grass-types like Servine and Sawsbuck that might threaten to overwhelm Quilladin. Pokemon that can deter hazard removal such as Wigglytuff and Meowstic-F can help Quilladin keep its Spikes up and compensate for its lacking damage output.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 452572, "username": "missangelic"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 543866, "username": "5Dots"}, {"user_id": 601970, "username": "sleid"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}, {"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Frogadier": {
    "comments": "<h3>Other Options</h3> <p>Frogadier can also use Surf instead of or with Hydro Pump as a less powerful but more reliable STAB option, but it is generally difficult to justify over the additional power of Hydro Pump or using the moveslot for other coverage moves.</p> <h3>Checks and Counters</h3> <p><strong>Specially Defensive Walls</strong>: Dustox, Duosion, and Bronzor can shrug off any of Frogadier's attacks. Dustox, Bronzor, and Magic Guard Duosion sets also cannot be worn down by Frogadier's Toxic Spikes.</p> <p><strong>Bulky Water-types</strong>: Politoed and Seaking are generally safe switch-ins into Frogadier, as they both resist its common moves and are only 2HKOed by Life Orb Hidden Power Grass sets.</p> <p><strong>Bulky Grass-types</strong>: Servine and Gogoat are bulky enough to avoid being 2HKOed by Ice Beam, with the former also threatening to paralyze Frogadier with Glare.</p> <p><strong>Fast Offensive Pokemon</strong>: Electabuzz, Simisage, and Jumpluff can all outspeed and OHKO Frogadier with their STAB attacks, and Choice Scarf variants of the first two outpace even Choice Scarf Frogadier.</p>",
    "sets": {
      "Offensive Pivot": {
        "description": "<p>Great offensive stats, backed by the coveted Protean and a wide coverage and utility movepool, make Frogadier one of the best special attackers and pivots in the tier. Life Orb allows Frogadier to hit several benchmarks, such as OHKOing Eviolite Magmar with Hydro Pump and 2HKOing bulky Servine with Ice Beam. Eviolite, on the other hand, lets Frogadier better switch into attacks in general, notably letting it avoid an OHKO from Gigalith's Stone Edge and Duosion's Future Sight, although it should only be switching into strong attacks like these in a pinch. Ice Beam nails Grass-types such as Ivysaur, Gourgeist-L, and Gogoat as well as Vibrava, with Protean removing Frogadier's weakness to the former group's STAB attacks. U-turn is an excellent tool to keep momentum against specially bulky Pokemon such as Bronzor, Duosion, and Swalot. Toxic Spikes can wear down bulky Water-types like Politoed and Seaking, which typically switch in to answer Frogadier, and also synergizes well with its coverage and U-turn forcing switches. Hidden Power Grass with Life Orb can 2HKO Politoed and Seaking one layer of Spikes, while Taunt helps to prevent the specially bulky Pokemon from using their recovery moves.</p> <p>Given Frogadier's frailty, slow U-turn users like Vibrava and Dustox are good partners and have the added benefit of clearing the entry hazards that can limit the opportunities in which Frogadier can pivot. Offensive pivots such as Electabuzz, Persian, and Furfrou can also form great cores with Frogadier, with the last two also luring in Rock-types like Gigalith, Carbink, and Lairon, which Frogadier can take advantage of. Faster Grass-type attackers such as Simisage, Jumpluff, and Choice Scarf Sawsbuck can revenge kill Frogadier, so it is imperative to have some Fire-, Poison-, or Flying-types on your team when using Frogadier; some good examples include Pignite, Magmar, Swalot, Ivysaur, and Pidgeot. Similarly, Electabuzz poses a big problem to Frogadier, so Electric-immune and resistant Pokemon like Hippopotas, Krokorok, Servine, and Quilladin are appreciated. The aforementioned Krokorok, as well as Whiscash and Swoobat, appreciate Toxic Spikes support, as their answers are vulnerable to poison. Fast Normal-types like Persian, Furfrou, and Choice Scarf Pidgeot can revenge kill Frogadier, so reliable switch-ins to them like Gigalith, Lairon, and Bronzor are incredibly valuable.</p>"
      },
      "Choice Scarf": {
        "description": "<p>Choice Scarf Frogadier outpaces the entire unboosted metagame, making its Hydro Pump a great tool for revenge killing opposing Choice Scarf users, such as Krokorok and Magmar, as well as boosted setup sweepers like Rock Polish Lairon and Shell Smash Magcargo. Ice Beam can revenge kill Simisage, Jumpluff, and Choice Scarf Sawsbuck. U-turn chips away at expected switch-ins like Politoed and bulky special walls like Duosion and Bronzor, while Toxic Spikes provides additional chip damage on Servine, Gogoat, non-Magic Guard Duosion, and other specially defensive walls to allow Frogadier to clean late-game. Alternatively, Hidden Power Grass is useful for stopping Whiscash and Huntail in their tracks.</p> <p>Setup sweepers and wallbreakers like Sawsbuck, Simisage, Klang, and Pignite make for good partners, since Frogadier can keep Fire-types like Magmar and Lampent and Ground-types like Krokorok at bay. Frogadier also pairs well with other pivots, since it can struggle to switch in safely; examples of good slow pivots include Dustox and Vibrava. Dustox and Vibrava also offer entry hazard removal, which is vital, as Frogadier lacks recovery and pivots often. Pokemon that can remove items such as Persian, Krokorok, and Servine and entry hazard setters like Bronzor, Gigalith, and Whirlipede help aid Frogadier's cleaning efforts. Additionally, special wallbreakers like Magmar, Vanilluxe, and Simisage can help weaken the likes of Swalot, Bronzor, and Duosion so that Frogadier has an easier time cleaning through them.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 226429, "username": "Jett"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 543866, "username": "5Dots"}, {"user_id": 601970, "username": "sleid"}]}, {"name": "Grammar checked by", "members": [{"user_id": 569291, "username": "zinnias"}, {"user_id": 470115, "username": "SolarBeam"}]}]}
  },
  "Gogoat": {
    "comments": "<h3>Other Options</h3> <p>Dropping Substitute and Bulk Up for Roar and Milk Drink, respectively, makes Gogoat a sturdy phazer, though this makes it more passive and faces competition from Meganium. Offensive Bulk Up sets with an Occa Berry lure in Fire-types like Pignite and Magmar, though this sacrifices a lot of bulk and faces competition with offensive Grass-types like Jumpluff and Sawsbuck. An EV spread of 252 HP / 40 Def / 184 SpD / 32 Spe prevents Gourgeist-L from breaking its Substitutes, enabling it to use it as setup fodder.</p> <h3>Checks and Counters</h3> <p><strong>Poison-types</strong>: Poison-types like Swalot, Ivysaur, and Trubbish take pittance from most of Gogoat's unboosted attacks and can set up on it with their utility moves or threaten it outright with their STAB moves.</p> <p><strong>Steel-types</strong>: Steel-types like Bronzor and Klang take little from Gogoat's unboosted attacks and can set up on it with their utility moves, though Bronzor and defensive Klang variants may have trouble breaking Gogoat's Substitutes.</p> <p><strong>Fire-types</strong>: Fire-types like Magmar, Pignite, and the uncommon Lampent resist Gogoat's STAB moves and can retaliate back with their own STAB moves. Pignite itself does excellently against Rock Slide thanks to its Fighting typing and Eviolite, and it can strike back with either Flare Blitz or Toxic.</p> <p><strong>Residual Damage</strong>: Despite Gogoat's solid bulk, it is very vulnerable to residual damage; burns cripple its sweeping potential, and Toxic wears it down too quickly for it to consistently sweep. Entry hazards also jeopardize its sweeping potential and make it more vulnerable against revenge killers like Vanilluxe and Jumpluff.</p> <p><strong>Revenge Killers</strong>: Without Bulk Up boosts, Gogoat's low Speed greatly hinders it against faster threats like Vanilluxe, Sawsbuck, and Furfrou, Pokemon that can threaten it with either super effective coverage or raw damage output.</p>",
    "sets": {
      "Bulk Up": {
        "description": "<p>By virtue of Gogoat's solid natural bulk and defensive typing, Gogoat makes for a sturdy setup sweeper. Horn Leech is preferred over Leaf Blade's higher power for its recovery, and it threatens out popular walls like Politoed and Gigalith. Rock Slide threatens out Grass-resistant Pokemon like Dustox, Magmar, and Jumpluff, threats that would otherwise safely switch into Horn Leech. Earthquake targets anticipated switch-ins like Swalot, Pignite, and Klang, Pokemon otherwise unfazed by Horn Leech and Rock Slide. Substitute shields Gogoat from status users like Electabuzz and Gourgeist-S; Gogoat's high-HP Substitutes also prevents Dusclops and, most of the time, Bronzor from breaking them with their standard attacking moves. Sap Sipper makes Gogoat a consistent check against Grass-types like Servine and non-Gunk Shot Simisage. 36 Speed EVs enable Gogoat to outspeed Adamant Lairon.</p> <p>Gogoat fits well on bulky and balance builds as both a special wall and wincon simultaneously, being a consistent switch-in against popular Grass- and Water-types like Servine and Politoed. Poison-types like Swalot and Ivysaur and Steel-types like Bronzor and Klang serve as Gogoat's biggest obstacles for successful Bulk Up sweeps; Psychic-types like Duosion and Swoobat can threaten out the aforementioned Poison-types, while Ground-types like Krokorok and Marshtomp can provide provide Stealth Rock support to rack up chip damage and threaten out Gogoat's checks. Krokorok particularly pairs well, providing utility with Knock Off and Pursuit trapping Bronzor. In return, Gogoat can threaten out Water-types like Politoed and Simipour that would threaten the Ground-types. Politoed and Seaking also serve as good partners to threaten out Fire-types like Magmar and Pignite. Cleric support from Wigglytuff can enhance Gogoat's longevity and rid of status moves it may have sustained earlier in the match.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 543866, "username": "5Dots"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 601970, "username": "sleid"}, {"user_id": 296755, "username": "5gen"}]}, {"name": "Grammar checked by", "members": [{"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Furfrou": {
    "comments": "<h3>Other Options</h3> <p>Furfrou can opt for a Choice Scarf to outspeed the likes of Persian, Swoobat, and Electabuzz; however, it then greatly loses out on its wallbreaking ability. Thunder Wave is an option to cripple fast targets like Sawsbuck, Jumpluff, and Klang, making them easier for teammates to take down. However, Furfrou usually prefers to pivot out of them and bring in teammates to keep up the momentum. Facade is an option in its last slot for a very strong STAB move if Furfrou takes a Toxic or gets burned. However, it prefers to have one of the other two options, as they give it a more reliable way to wallbreak. Hidden Power Ground 2HKOes Lairon but compromises Furfrou's bulk and doesn't hit other targets hard enough.</p> <h3>Checks and Counters</h3> <p><strong>Steel-types</strong>: Furfrou has nothing to hit Bronzor, Lairon, and offensive Klang for significant damage, while they can all chip it back. The best Furfrou can do is pivot out of them to bring in a teammate.</p> <p><strong>Ghost-types</strong>: Gourgeist-L and Dusclops wall Furfrou, since they are immune to Return. Gourgeist-L can be hit with Toxic, making it easier to take down over the course of the game, but Dusclops can just heal off any status with Rest.</p> <p><strong>Chip Damage</strong>: Entry hazards and status greatly limit Furfrou's role as a pivot, since they reduce its chances to come in. Rocky Helmet from the likes of Swalot, Carbink, and Gigalith can deal additional chip damage, but Swalot can't take Return well, and Carbink and Gigalith don't do well against Iron Tail.</p> <p><strong>Fast Special Attackers</strong>: Electabuzz and Swoobat naturally outspeed Furfrou, while Frogadier, Simipour, and Magmar outspeed it with a Choice Scarf and threaten to take it out after some chip damage due to its low special bulk.</p>",
    "sets": {
      "Choice Band": {
        "description": "<p>Furfrou is a great wallbreaker with its solid Attack, Speed, and coverage moves to take down common walls. U-turn gives Furfrou the ability to pivot out from the likes of Bronzor, Dusclops, and Lairon, bringing in a teammate that matches up favorably against them. Sucker Punch is great for picking up KOs against faster foes like Swoobat, Persian, and Electabuzz after some chip damage; however, this is usually for endgame scenarios, as Furfrou wants to avoid being taken advantage of if it's locked into Sucker Punch. Iron Tail allows Furfrou to 2HKO common switch-ins such as, Gigalith and Carbink. Toxic can be used to cripple Pokemon that Furfrou wouldn't be able to take on otherwise like Gourgeist-L and Hippopotas, giving Furfrou an easier time dealing with them later in the game.</p> <p>Furfrou forms a great pivoting core with Frogadier and Electabuzz, helping each other chip down their checks. It has trouble dealing with Steel-types like Bronzor, Klang, and Lairon, so it prefers to pivot out of them and bring in teammates like Pignite and Magmar. Hippopotas and Gourgeist-L can easily take on Furfrou, making it rely on partners like Vanilluxe and Politoed to come in and force them out. Furfrou appreciates Knock Off users like Servine, Scraggy, and Simipour, since they can weaken physical walls that rely on Eviolite like Quilladin and Hippopotas. Physical cleaners like Shell Smash Huntail, Dragon Dance Scraggy, and Choice Scarf Krokorok appreciate Furfrou's ability to break through physical walls like Carbink, Swalot, and Duosion for them.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 601970, "username": "sleid"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 296755, "username": "5gen"}, {"user_id": 543866, "username": "5Dots"}]}, {"name": "Grammar checked by", "members": [{"user_id": 602431, "username": "CaptainDaimyo"}, {"user_id": 470115, "username": "SolarBeam"}]}]}
  },
  "Meowstic-F": {"sets": {"Fast Attacker": {}}},
  "Carbink": {
    "comments": "<h3>Other Options</h3> <p>If paired with a Stealth Rock user like Bronzor or Hippopotas, Carbink can opt for Iron Defense instead of Stealth Rock to become a threatening setup sweeper that is hard to take down when it starts boosting. Carbink can use Earth Power over Calm Mind on its physical wall set to catch the likes of Lairon, Magmar, and Swalot off guard, even if it does middling damage. It can also choose to run Power Gem instead of Calm Mind to better hit Jumpluff and Dustox. However, Carbink is incredibly passive without Calm Mind, so that's the preferred option.</p> <h3>Checks and Counters</h3> <p><strong>Steel-types</strong>: Klang and Lairon can come in on Carbink's Moonblast safely and threaten to OHKO it back with their Steel-type STAB moves, although Lairon has to be wary of getting outsped and OHKOed by Earth Power from offensive Stealth Rock Carbink. Bronzor completely walls Carbink and can whittle it down with Toxic and Psywave while shrugging off its +6 Moonblast.</p> <p><strong>Water-types</strong>: Frogadier, Politoed, Simipour, and special Huntail can take a Moonblast fine enough and threaten Carbink back for big damage with their STAB moves. Seaking can sit on offensive Carbink and beat it. However, these checks struggle to take down Carbink if it has used a couple of Calm Minds. Meanwhile, Marshtomp and Whiscash can threaten heavy damage on Carbink, 2HKOing it after Stealth Rock damage.</p> <p><strong>Ground-types</strong>: Hippopotas, Marshtomp, and Whiscash can all outdamage and take down Carbink with their STAB Earthquakes. Choice Band Krokorok can 2HKO Carbink with Earthquake, while the other Krokorok sets only 3HKO it, meaning it always win one-on-one if it catches Carbink with Earthquake on the switch in.</p> <p><strong>Offensive Grass-types</strong>: Servine, Gogoat, Jumpluff, and Simisage can boost and take down Carbink while taking minimal damage. However, Jumpluff needs to watch out for offensive Carbink, since Carbink can 2HKO it with Power Gem.</p> <p><strong>Steel-type Coverage Moves</strong>: Carbink can be heavily damaged or even OHKOed by Steel-type coverage moves like Furfrou and Mightyena's Iron Tail and Pignite and Gigalith's Heavy Slam.</p>",
    "sets": {
      "Physical Wall": {
        "description": "<p>Carbink is one of the tier's premier physical walls due to its great role compression, ability to check Normal- and Fire-types and Scraggy, and access to Stealth Rock. STAB Moonblast does notably well against the likes of Vibrava, Scraggy, and Krokorok while also hitting the majority of the tier neutrally. Calm Mind is used as a win condition and to minimize damage from many weaker special threats like Electabuzz and defensive Ivysaur, which would take advantage of it otherwise. Carbink can switch in on a plethora of Pokemon like Scraggy, Pignite, and Persian, so Rest is important to let it consistently check them. Rocky Helmet is the item of choice to further help chip down the aforementioned Pokemon and punish U-turn and Knock Off users, on top of the Stealth Rock damage they take upon entry.</p> <p>Balance and stall teams look to Carbink as an option for a Stealth Rock setter and physical wall. Carbink struggles to perform well against Steel- and Grass-types like Klang and Servine, so Pignite, Swalot, and Magmar all make good partners to help alleviate this. Other defensive walls like Bronzor and Duosion appreciate Carbink's ability to take on Scraggy. Bronzor, as well as Grass-types like Ivysaur and Gogoat, also appreciates Carbink's ability to take hits from Pignite and Magmar. Carbink pairs well with offensive Pokemon like Simipour, Sawsbuck, and Murkrow because it switches into and chips down faster pivots like Persian and Furfrou with Rocky Helmet. Carbink also greatly benefits from clerics like Meganium and Wigglytuff, since they give Carbink an easier time using Rest.</p>"
      },
      "Offensive Stealth Rock": {
        "description": "<p>Carbink can opt to run an offensive Stealth Rock set that can threaten entry hazard removers like Vibrava and Dustox with its STAB moves. Earth Power is great coverage to surprise Pokemon that can normally switch in on its defensive set, OHKOing Lairon and 3HKOing Swalot and offensive Klang. Power Gem can safely 2HKO Whirlipede and Dustox after Stealth Rock, which is especially helpful when the former would otherwise set up a full set of Spikes. Rocky Helmet is to help chip down physical threats that Carbink can switch in on like Pignite and Persian. Without a Modest nature, Carbink can't safely hit any of the damage ranges above; it doesn't need more Speed to perform its job regardless.</p> <p>Carbink does best on balance teams looking for a threatening Stealth Rock user that can keep its entry hazards up. Carbink is completely walled by Bronzor, so teammates like Scraggy and Krokorok are appreciated to help force it out. Frailer teammates like Simisage and Murkrow appreciate Carbink's ability to switch in safely against Normal-types like Persian and Furfrou. Water-types like Simipour and Frogadier greatly threaten Carbink, so teammates like Politoed, Servine, and Ivysaur can help alleviate this issue. These same Grass-types appreciate Carbink switching into Magmar and Pignite's STAB moves. Opposing Servine, Ivysaur, and the like also threaten Carbink and hardly take any damage in return, so Swalot and Klang make for good partners to handle them. Swalot and Klang also do well at absorbing status for Carbink, since poison and burn can quickly wear it down. Although Carbink can greatly damage it on its switch in with Earth Power, Klang can still destroy Carbink the following turn unless Carbink has teammates like Pignite, Magmar, and Electabuzz to come in and take the hit for it. Bronzor and Duosion are completely helpless against Scraggy, so they appreciate having Carbink as a partner to counter it. Klang, Huntail, and Scraggy appreciate the Stealth Rock support that Carbink provides, helping them reach easier KO ranges against Electabuzz, Sawsbuck, and Dusclops, respectively.</p>"
      },
      "Double Dance": {}
    },
    "credits": {"writtenBy": [{"user_id": 601970, "username": "sleid"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 296755, "username": "5gen"}, {"user_id": 543866, "username": "5Dots"}]}, {"name": "Grammar checked by", "members": [{"user_id": 470115, "username": "SolarBeam"}, {"user_id": 569291, "username": "zinnias"}]}]}
  },
  "Sliggoo": {"sets": {"Curse": {}, "Tank": {}}}
}