{
  "Pikachu": {"sets": {"Revenge Killer": {}}},
  "Ariados": {"sets": {"Lead": {}}},
  "Magcargo": {"sets": {"Physical Wall": {}, "Shell Smash": {}}},
  "Corsola": {"sets": {"Physical Wall": {}}},
  "Masquerain": {"sets": {"Quiver Dance": {}}},
  "Volbeat": {"sets": {"Weather Setter": {}}},
  "Illumise": {"sets": {"Choice Specs": {}}},
  "Lunatone": {"sets": {"All-Out Attacker": {}}},
  "Solrock": {"sets": {"Physical Wall": {}, "Offensive": {}, "Weather Lead": {}}},
  "Chimecho": {"sets": {"Choice Specs": {}, "Future Sight": {}}},
  "Wormadam-Trash": {"sets": {"Physical Wall": {}}},
  "Gigalith": {
    "comments": "<h1>Other Options</h1> <p>Explosion, especially when paired with Custap Berry, is one way for Gigalith to trade massive damage when it's already at low HP. It is Gigalith's strongest coverage move versus Vibrava, which can come in handy to ensure Stealth Rock stays up, given Vibrava will likely want to come in and use Defog in the favorable matchup, only to get blown up. Custap Berry sets work great as leads so Gigalith can get up Stealth Rock before getting KOed, letting a teammate come in afterwards and threaten Defoggers like Vibrava and Dustox. Investing some EVs into Special Defense can improve Gigalith's matchups against Swoobat and Vanilluxe.</p> <h1>Checks and Counters</h1> <p><strong>Ground-types</strong>: Marshtomp and Hippopotas are easily the best counters to Gigalith, even versus its Choice Band variant. Other Ground-types like Vibrava and Krokorok may deter Stone Edge, but they fear stronger coverage moves.</p> <p><strong>Grass-types</strong>: One of Gigalith's most common weaknesses, faster Grass-types like Servine and Ivysaur easily force it out. Physically defensive Grass-types like Gourgeist-L and Meganium are faster than Gigalith, and even ignoring the threat of Giga Drain, they can fish for a Stone Edge miss and recover with Synthesis and Leech Seed. Ivysaur and Meganium are particularly annoying, since they can deal with Toxic through their typing and Aromatherapy, respectively.</p> <p><strong>Water-types</strong>: Politoed and special variants of Huntail can take a hit from Gigalith and threaten great damage as well as potential burn with Scald from Politoed. Simipour and Frogadier have a harder time coming in safely but can threaten to OHKO with Hydro Pump.</p> <p><strong>Special and Mixed Attackers</strong>: Gigalith's bulk is only remarkable on the physical side, so any special attacker with strong coverage like Electabuzz or Magmar with Focus Blast is an issue. Even worse, physical attackers like Persian and Simisage can afford coverage like Water Pulse and Leaf Storm, respectively, to bypass Gigalith's great physical bulk.</p> <p><strong>Bronzor</strong>: Bronzor shrugs off Stone Edge, Toxic, and Earthquake. It doesn't fear much from Gigalith unless it's a specially defensive variant against the Choice Band set.</p>",
    "sets": {
      "Stealth Rock": {
        "description": "<p>Gigalith's sheer bulk, strength, and access to Stealth Rock make it a popular pick for balance teams and the like. Its typing means that physically offensive Normal-types like Persian, Furfrou, and Raticate struggle to take it down, whereas Pokemon with stronger coverage versus Gigalith like Pignite and Swalot will struggle to trade hits successfully. Stone Edge will deal more damage than Rock Blast on average, consistently 2HKOing Servine and Politoed, whereas Rock Blast is more consistent with its accuracy and the ability to break Substitute and Focus Sash on the likes of Swoobat and Butterfree. Earthquake pairs best with Gigalith's Rock-type coverage, especially versus foes like Swalot and Lairon. Superpower nails Krokorok and Lairon, especially useful given Earthquake lacks a chance to OHKO the latter. It is also Gigalith's strongest coverage move versus Vibrava, although Toxic is another option to punish Vibrava along with other checks like Gourgeist-L. Rocky Helmet is an alternative to Leftovers that chips at offensive pivots like Persian and Furfrou. Lastly, Custap Berry offers the chance for Gigalith to get an extra hit off when it's at low health, which also works as an emergency check to most sweepers if it is still at full health for Sturdy.</p> <p>A staple on most cores, Gigalith pairs with special walls like Duosion, Dustox, and Klang. They deal with the strong special attackers that Gigalith is forced out by, whereas it can check physical attackers like Lairon and Persian. Specially offensive pivots like Electabuzz and Frogadier can position Gigalith on the field to set up Stealth Rock and fire off strong attacks. Poison-types like Ivysaur and Swalot make for good partners, as they can take on Grass-types like Servine and Simisage. In the same vein, teammates like Politoed and specially defensive Servine check offensive Water-types. A Grass-type that can comfortably switch into Earthquake, like Servine or Quilladin, is also a must. Servine specifically can dissuade Defog attempts from Vibrava, which is a Pokemon that gives Gigalith trouble.</p>"
      },
      "Choice Band": {
        "description": "<p>With the extra power from Choice Band and extra Speed investment, Gigalith makes for a dangerous wallbreaker. It can OHKO slower foes like Duosion and Swalot, and even potential switch-ins tend to be shoddy at best given the raw damage of Stone Edge. However, Gigalith is still slower than physical walls like Gourgeist-L and Meganium, so even with a stronger Superpower, it fails to get past these foes by itself. Heavy Slam offers good neutral coverage, 2HKOing Vibrava as an example. Toxic is an alternative to deal with the aforementioned Grass-type walls that Gigalith still struggles against.</p> <p>Pivots like Electabuzz, Dustox, Frogadier, and Vibrava are all great teammates to position Gigalith on the field versus slower, vulnerable targets. Physical sweepers like Huntail and Klang are also great to have once Gigalith is able to break down opposing physical walls. Knock Off users like Servine, Ivysaur, and Persian are excellent to soften up Eviolite-reliant walls like Bronzor and Vibrava soften up for Gigalith; it can then OHKO these foes with Superpower. Special wallbreakers like Magmar and Swoobat are great to pivot into when Gigalith is forced out by a faster Grass-type.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "S1nn0hC0nfirm3d", "user_id": 231074}, {"username": "sleid", "user_id": 601970}], "teams": [{"name": "Quality checked by", "members": [{"username": "5Dots", "user_id": 543866}, {"username": "Jett", "user_id": 226429}]}, {"name": "Grammar checked by", "members": [{"username": "SolarBeam", "user_id": 470115}]}]}
  },
  "Vanilluxe": {"sets": {"Choice Specs": {}, "Choice Scarf": {}, "Stallbreaker": {}, "Autotomize": {}}},
  "Beartic": {"sets": {"Rain Sweeper": {}}},
  "Meowstic": {
    "comments": "<h1>Other Options</h1> <p>Yawn can be used in favor of Thunder Wave to help thwart the Defoggers or setup sweepers that can take advantage of Meowstic-M. Psychic can be dropped for Mean Look to further guarantee the sleep from Yawn, which allows for free turns for its teammates but means Meowstic has no attacks and is completely vulnerable to Taunt.</p> <h1>Checks and Counters</h1> <p><strong>Defog Users</strong>: Dustox, Vibrava, and Pidgeot can remove Meowstic-M's dual screens while taking low damage, being able to heal off the minimal damage from Psychic. However, Dustox and Pidgeot have to be worried about being crippled by Thunder Wave.</p> <p><strong>Knock Off Users</strong>: The likes of Scraggy and Krokorok can enter the field safely while threatening to remove Meowstic-M's Light Clay, which weakens its ability to support its teammates. Other users like Ivysaur, Servine, and Persian can remove Meowstic-M's item as well, but they risk getting paralyzed.</p> <p><strong>Setup Sweepers</strong>: Bulk Up Scraggy, Dragonair, and Klang are setup sweepers that can safely boost in front of Meowstic-M while not being concerned with Psychic and Thunder Wave thanks to Shed Skin and RestTalk, respectively. Calm Mind Duosion is a similar case, except it doesn't have a way around Thunder Wave.</p> <p><strong>Taunt and Encore Users</strong>: Pokemon like Quilladin, Pignite, Politoed, and Jumpluff can thwart Meowstic-M's ability to set up dual screens but don't particularly enjoy the chance of being statused beforehand.</p>",
    "sets": {
      "Dual Screens": {
        "description": "<p>Meowstic-M is the tier's premier support Pokemon on hyper offensive teams because of its access to Prankster Reflect and Light Screen. Dual screens is great for allowing the likes of Scraggy, Swoobat, and Huntail to set up with a bit more safety in front of opposing threats. Psychic gives Meowstic-M some offensive presence, doing notable damage to common switch-ins like Dustox and Vibrava that want to remove its dual screens and Poison-types that might want to set up hazards on it like Whirlipede and Trubbish. Psychic also ensures Meowstic isn't completely Taunt fodder. Thunder Wave cripples fast attackers that might try to set up on it, such as Jumpluff, Moxie Scraggy, and Swoobat.</p> <p>Meowstic-M works best on hyper offensive teams looking for dual screens support in order to give their setup Pokemon like Simipour, Klang, and Sawsbuck a better opportunity to break or sweep the opposing team. Defog users like Dustox and Vibrava remove the dual screens that Meowstic-M sets up, so deterrents like offensive Wigglytuff and Servine are appreciated to keep them up. Taunt users like Scraggy, Krokorok, and Pignite all help thwart these Defoggers as well. Bulk Up Scraggy and Krokorok completely wall Meowstic-M and either set up on it or remove its item with Knock Off, respectively, so teammates like Jumpluff and Carbink are helpful for stopping them.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "sleid", "user_id": 601970}], "teams": [{"name": "Quality checked by", "members": [{"username": "Jett", "user_id": 226429}, {"username": "5Dots", "user_id": 543866}]}, {"name": "Grammar checked by", "members": [{"username": "adorluigi", "user_id": 528364}, {"username": "autumn", "user_id": 384270}]}]}
  },
  "Vibrava": {"sets": {"Defog": {}}},
  "Glaceon": {"sets": {"Choice Specs": {}}},
  "Gourgeist-Small": {"sets": {"All-Out Attacker": {}, "SubSeed": {}, "Defensive": {}}},
  "Gourgeist-Large": {"sets": {"Physical Wall": {}}},
  "Ivysaur": {
    "comments": "<h1>Other Options</h1> <p>Sleep Powder can be used as an alternative over Leech Seed or Giga Drain to deal with checks and is Ivysaur's most effective way of crippling Swalot. However, Leech Seed is more effective in most other matchups, and this makes Ivysaur shakier against the Pokemon it wants to check, like Politoed, Krokorok, and Huntail. An EV spread of 248 HP / 164 SpA / 96 Spe turns Ivysaur into more of a stallbreaker, more consistent at checking Grass-types like Servine and Gogoat at the cost of giving up some of its bulk.</p> <h1>Checks and Counters</h1> <p><strong>Poison-types</strong>: Ivysaur struggles to make progress against Poison-types like Swalot and Dustox; Swalot can repeatedly whittle its Synthesis PP down with various attacks, while Dustox can freely pivot to another check or even phaze it with Whirlwind. Spikes setters like Trubbish and Whirlipede aren't threatened too much by its STAB moves and can freely set up Spikes against it. However, all of them can get overwhelmed by its sun sweeper set.</p> <p><strong>Steel-types</strong>: Steel-types like Klang, Bronzor, and Lairon resist Ivysaur's STAB combination and can set up on it or attack it outright even when it runs Knock Off and Leech Seed, though none of them enjoy dealing with offensive Ivysaur.</p> <p><strong>Fire-types</strong>: Fire-types like Magmar and Pignite resist Giga Drain and can threaten massive damage against Ivysaur with their STAB moves. They don't like getting poisoned by Sludge Bomb or losing their Eviolite, however.</p> <p><strong>Knock Off Users</strong>: Without its Eviolite, Ivysaur can struggle to stomach hits; Knock Off users like Scraggy, Simisage, and Krokorok can lower its effectiveness as a wall.</p> <p><strong>Strong Attackers</strong>: Ivysaur can get overwhelmed by super effective coverage from attackers like Frogadier, Swoobat, and Vanilluxe. However, all of them struggle against offensive Ivysaur.</p> <p><strong>Residual Damage</strong>: Even with terrific bulk and a Toxic immunity, Ivysaur is vulnerable to entry hazards and burn, both of which can cripple its longevity and can make it harder for it to perform as a wall, which is made worse by Synthesis's low PP. Hippopotas's Sand Stream cuts Synthesis's effectiveness, stacks up residual damage, and removes sun, negating much of Ivysaur's offensive presence.</p>",
    "sets": {
      "Defensive": {
        "description": "<p>Armed with excellent bulk and solid utility options, Ivysaur stands out as an elite defensive Pokemon. Knock Off cripples walls and checks like Dustox, Bronzor, and Quilladin, Pokemon that would otherwise freely switch into it. Giga Drain makes Ivysaur more consistent against Grass-weak targets like Gigalith, Huntail, and Krokorok, while Leech Seed can force the aforementioned checks as well as Steel-types like Klang to switch out and supplies Ivysaur additional recovery. The EV spread prevents a 2HKO from Politoed's Ice Beam and a 3HKO from non-Choice Band Krokorok. While Chlorophyll is situational, under sun, Ivysaur can outspeed everything up to Murkrow.</p> <p>Ivysaur fits best on bulky and balance teams that appreciate its bulk and typing, checking Pokemon like Servine, Electabuzz, and Gigalith. Offensive wallbreakers like Pignite and Simipour appreciate Ivysaur removing items through Knock Off, making it easier to break through checks like Carbink and Dustox later in the game. Ivysaur's passivity leaves it vulnerable to Fire-types like Pignite and Magmar and wallbreakers like Frogadier and Swoobat, so other walls like Politoed and defensive Klang are appreciated. Outside of Knock Off and Leech Seed, Ivysaur fails to threaten Steel-types, so checks to them like Krokorok and Magmar are appreciated as well. Knock Off absorbers like Carbink and Wigglytuff are also appreciated to maintain its usefulness as a wall.</p>"
      },
      "Sun Sweeper": {
        "description": "<p>Ivysaur is a staple on sun teams thanks to its great bulk bolstered by Eviolite, solid power, and variety of coverage moves. Growth augments its offensive potential, making it even scarier to face off against. Solar Beam is preferred thanks to its massive damage output under sun; Giga Drain can be used outside of sun and gives Ivysaur additional longevity. Hidden Power Fire is Ivysaur's strongest option against foes resistant to its STAB moves, like Dustox, Bronzor, and Klang.</p> <p>Sun setters like Volbeat and Graveler are essential to allow Ivysaur opportunities to wallbreak or sweep under sun; Volbeat can cripple checks with Thunder Wave and Encore, while Graveler can provide Stealth Rock and momentum with Explosion. Other sun sweepers like Sawsbuck and Jumpluff are also useful partners, appreciating Ivysaur weakening checks like Swalot and Bronzor. In turn, they can help take on Fire-types and defensive Duosion, checks that Ivysaur struggles to get past. Fire-types like Magmar and Pignite stand out as great partners, weakening the aforementioned checks so Ivysaur can have an easier time cleaning late-game. In turn, Ivysaur can help break through Water- and Rock-types that they struggle against.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "5Dots", "user_id": 543866}], "teams": [{"name": "Quality checked by", "members": [{"username": "Jett", "user_id": 226429}, {"username": "sleid", "user_id": 601970}]}, {"name": "Grammar checked by", "members": [{"username": "SolarBeam", "user_id": 470115}]}]}
  },
  "Wartortle": {"sets": {"Physically Defensive": {}, "Specially Defensive": {}}},
  "Butterfree": {"sets": {"Quiver Dance": {}}},
  "Beedrill": {"sets": {"Toxic Spikes": {}, "Swords Dance": {}}},
  "Pidgeot": {"sets": {"Offensive Defog": {}, "Choice Band": {}, "Choice Scarf": {}}},
  "Raticate": {"sets": {"Guts": {}, "Choice Band": {}, "Choice Scarf": {}}},
  "Fearow": {"sets": {"Choice Band": {}, "Choice Scarf": {}}},
  "Sandshrew": {"sets": {"Hazard Utility": {}}},
  "Wigglytuff": {"sets": {"Cleric": {}, "Offensive Stealth Rock": {}}},
  "Persian": {"sets": {"Offensive Pivot": {}, "Nasty Plot": {}}},
  "Golduck": {"sets": {"Rain Attacker": {}, "Calm Mind": {}}},
  "Tentacool": {"sets": {"Specially Defensive": {}}},
  "Graveler": {"sets": {"Suicide Lead": {}}},
  "Magnemite": {"sets": {"Magnet Pull": {}}},
  "Gastly": {"sets": {"Substitute + 3 Attacks": {}, "SubWisp": {}, "Choice Scarf": {}}},
  "Seaking": {"sets": {"Specially Defensive": {}, "Agility": {}}},
  "Electabuzz": {"sets": {"Offensive Pivot": {}, "Choice Scarf": {}, "Choice Specs": {}}},
  "Magmar": {"sets": {"Special All-Out Attacker": {}, "Choice Specs": {}, "Choice Scarf": {}, "Physical All-Out Attacker": {}}},
  "Ditto": {"sets": {"Revenge Killer": {}}},
  "Dragonair": {"sets": {"Bulky Dragon Dance": {}, "Offensive Dragon Dance": {}}},
  "Meganium": {"sets": {"Special Wall": {}, "Swords Dance": {}}},
  "Chinchou": {"sets": {"Special Pivot": {}}},
  "Natu": {"sets": {"Magic Bounce Pivot": {}}},
  "Politoed": {
    "comments": "<h1>Other Options</h1> <p>Focus Blast offers strong coverage generally, but it lacks specific targets to make up for its inaccuracy. Choice Scarf sets can get the jump on some noticeable targets if the opponent is unaware, although these sets lack either the defensive reliability or power that the other sets excel at. Perish Song + Whirlpool sets offer a different stallbreaking option than Encore; however, these sets make Politoed more passive, which can sink momentum. No Item + Thief can be opted for over Protect as a means to debilitate Eviolite-reliant counters, but the lack of Leftovers and the risk of stealing a useless or debilitating item like Dustox's Black Sludge usually means that item removal is a better fit for Politoed's teammates. Substitute is another option on Leftovers sets that prefer more Speed, as it gives Politoed an extra burn chance and allows for safer Toxics against foes that want to switch in on it like Swalot, Sawsbuck and Ivysaur.</p> <h1>Checks and Counters</h1> <p><strong>Dustox</strong>: Dustox is immune to Scald burns due to its ability Shield Dust. Additionally, it can use Toxic to completely shut down Politoed, all while having the bulk and recovery to consistently function as a safe switch-in except versus Choice Specs Hydro Pump.</p> <p><strong>Duosion</strong>: Specially defensive Duosion tanks Politoed's unboosted hits, and, thanks to Regenerator, it can generally leave unscathed. Double Dance sets are in jeopardy of getting hit by Encore, though.</p> <p><strong>Grass-types</strong>: Faster Grass-types like Servine, Simisage, and Sawsbuck can force out Politoed, although they risk a strong Ice Beam if they attempt to set up versus it.</p> <p><strong>Revenge Killers</strong>: Stronger revenge killers like Electabuzz, Choice Specs Vanilluxe, and Choice Band Furfrou favorably trade hits against Politoed, and they will force it out once at low health; scouting with Protect can deter the Choice-locked revenge killers, however.</p> <p><strong>Status</strong>: Politoed doesn't do well when taking residual damage from poison or burn due to its only form of recovery being Leftovers. It needs to be wary of Toxic from the likes of Dustox and Gigalith, as well as Will-O-Wisp from Dusclops and Solrock.</p>",
    "sets": {
      "Tank": {
        "description": "<p>Politoed is a multifaceted offensive tank and bulky Water-type. The threat of a strong Scald backed up by Ice Beam to hit Grass-types like Servine and Jumpluff makes Politoed hard to switch into. Access to Water Absorb and great defensive stats also make Politoed a valuable defensive asset in a pinch against the likes of Magmar, Klang, and Simipour. Protect doubles as a means to net extra recovery from Leftovers, as well as a defense against Choice-locked attackers like Vanilluxe. Encore also pairs well with Protect because it allows Politoed to scout and then punish utility moves and weaker attacks versus slower foes like Duosion and Bronzor, all while securing additional Leftovers recovery. Encore is also very good against setup sweepers that don't care about Toxic like Scraggy and the aforementioned Duosion. Toxic is another stallbreaking option for Politoed to be more threatening versus its counters like Regenerator Duosion, although it comes at the opportunity cost of losing the safe switch against slower status users. Another consideration is Hidden Power Grass, which can be opted for if the team needs to rely on Politoed to check offensive Water-types like Simipour and Huntail. With 16 Speed EVs, Politoed outspeeds and revenge kills Adamant Lairon.</p> <p>Politoed fits on any balance and bulky offense team that can appreciate its role compression and defensive typing. Defensive cores like Gigalith + Vibrava and Dustox + Carbink need Politoed to check threats like Huntail, Klang, and Pignite. In return, they can create a safe switch opportunity for Politoed against Pokemon like Gigalith, Vibrava, and Carbink, especially when prompting foes to trade entry hazards. Scraggy and Bronzor can absorb Future Sight from Regenerator Duosion, while Dustox and Gogoat are generally good threats to Servine. Ground-types like Krokorok and Hippopotas are great to maintain momentum versus faster Volt Switch users that can force out Politoed, and they are especially beneficial versus Choice-locked Electabuzz, given Politoed's Protect will punish revenge kill attempts.</p>"
      },
      "Choice Specs": {
        "description": "<p>Choice Specs Politoed boasts an impressive offensive movepool and still retains a lot of its defensive merit. Most notably, the extra power offers Politoed a guaranteed 2HKO versus Regenerator Duosion and Dustox with Hydro Pump. Its coverage in Ice Beam + Hidden Power Grass gives Politoed a chance to OHKO the likes of Gourgeist-L and Whiscash, respectively. Additionally, Politoed's ability Water Absorb means that even without defensive investment, it can still soft check the likes of Huntail and Simipour and retaliate with Hidden Power Grass with a chance to OHKO after Stealth Rock.</p> <p>Pivots like Electabuzz and Dustox are great teammates to get Politoed in safely. Knock Off users like Servine and Persian can soften up Eviolite walls like Bronzor and Quilladin, making them more vulnerable to Politoed's wallbreaking. Swalot, Ivysaur, and Gourgeist-L are all checks to Grass-types that give Politoed a defensive backbone to rely on versus the likes of Simisage and Sawsbuck. Specially offensive sweepers like Vanilluxe and Butterfree can clean late-game after Politoed pokes holes through opposing special walls. Fast attackers like Persian and Sawsbuck make for great partners to help circumvent Politoed's mediocre Speed.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "S1nn0hC0nfirm3d", "user_id": 231074}, {"username": "sleid", "user_id": 601970}], "teams": [{"name": "Quality checked by", "members": [{"username": "5Dots", "user_id": 543866}]}, {"name": "Grammar checked by", "members": [{"username": "SolarBeam", "user_id": 470115}]}]}
  },
  "Jumpluff": {"sets": {"Swords Dance": {}}},
  "Murkrow": {"sets": {"Physically Based Attacker": {}, "Specially Based Attacker": {}}},
  "Girafarig": {"sets": {"Nasty Plot": {}, "Choice Scarf": {}}},
  "Dunsparce": {"sets": {"Coil": {}}},
  "Octillery": {"sets": {"Trick Room Attacker": {}}},
  "Marshtomp": {"sets": {"Stealth Rock": {}}},
  "Mightyena": {"sets": {"All-Out Attacker": {}}},
  "Dustox": {
    "comments": "<h1>Other Options</h1> <p>Double Dance sets with Quiver Dance + Iron Defense and Bug Buzz for coverage can be decent wincons, but they fail to break the mold due to their passivity before setting up and lack of general power even after boosts.</p> <h1>Checks and Counters</h1> <p><strong>Rock-types</strong>: Lairon and Gigalith are offensive Stealth Rock users that Dustox has little chance at deterring by itself because they can threaten it out with their STAB attacks.</p> <p><strong>Fire-types</strong>: Dustox needs to watch out for offensive Fire-type Pokemon like Magmar and Pignite, as it fears letting them in any time it attempts to recover with Roost or use Defog.</p> <p><strong>Psychic-types</strong>: While they take hefty damage from U-turn, Dustox struggles with its role as a special wall versus Psychic-types like Duosion and Swoobat.</p> <p><strong>Wallbreakers</strong>: Dustox is vulnerable to stronger physical attackers like Choice Band Furfrou and Life Orb Simisage. Even with maximum bulk, it also still cannot safely switch into some special threats like Choice Specs Vanilluxe.</p> <p><strong>Stallbreakers</strong>: Given Dustox's passivity, it relies on Toxic and Whirlwind to deal with setup sweepers, so the likes of Dragon Dance + Taunt Scraggy and Encore Jumpluff make it a sitting duck.</p>",
    "sets": {
      "Specially Defensive": {
        "description": "<p>Dustox compresses the roles of entry hazard control, special wall, and pivot into a single set. While its bulk is far from impenetrable, its typing allows it to have a solid matchup versus special attackers like Servine and Frogadier. Politoed gets a special mention here; Dustox is one of its best switch-ins, since it doesn't have to be concerned with burn from Scald due to Shield Dust. This provides opportunities for it to clear entry hazards with Defog as well as gain momentum with STAB U-turn. Toxic allows Dustox to punish switch-ins like Gigalith and Pignite, a more proactive approach of dealing with its checks in comparison to pivoting. Whirlwind forces out sweepers like Klang and Scraggy, and it can also gain momentum when drawing in a Pokemon that cannot threaten Dustox with a subsequent U-turn. Sludge Bomb is another option Dustox may opt for to spread status while also nailing the Grass-types it checks like Servine, Simisage, and Gogoat. Physically defensive and mixed defensive investments work well too, given the appropriate team support. These sets help check the likes of offensive Swalot, Krokorok, and Persian.</p> <p>Offensive Water-types like Politoed, Simipour, and Frogadier are great teammates, as they can force out the Fire- and Rock-types that come in on Dustox, like Magmar and Lairon. In return, Dustox can come in on Grass-types like Servine and restart the U-turn momentum cycle. Physical walls like Gigalith and Carbink make for a good core to pair with Dustox because it takes on the Grass- and Water-types that threaten them while they handle the Normal- and Fire-types that threaten Dustox. Offensive pivots like Electabuzz and Furfrou also generate momentum in tandem with Dustox. Dark-types like Scraggy and Krokorok are necessary so that Dustox can pivot out on Duosion and not fear the following Future Sight. Krokorok has the added benefit of Pursuit trapping Duosion.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "S1nn0hC0nfirm3d", "user_id": 231074}, {"username": "sleid", "user_id": 601970}], "teams": [{"name": "Quality checked by", "members": [{"username": "5Dots", "user_id": 543866}, {"username": "Jett", "user_id": 226429}]}, {"name": "Grammar checked by", "members": [{"username": "SolarBeam", "user_id": 470115}]}]}
  },
  "Slaking": {"sets": {"Choice Band": {}, "Choice Scarf": {}}},
  "Lairon": {
    "comments": "<h1>Other Options</h1> <p>Hone Claws is an option to provide Lairon better KO ranges and give Head Smash perfect accuracy, although it's not a very viable option because it takes an extra turn of setup and makes Lairon drop an important coverage slot. Running a Jolly nature is an option to ensure Lairon outspeeds the likes of Swoobat and other Pokemon that prefer to creep the 179 benchmark at +2. However, a Jolly nature generally isn't worth the loss in power.</p> <h1>Checks and Counters</h1> <p><strong>Bronzor</strong>: All of Lairon's sets are completely walled by Bronzor and get chipped down by Psywave.</p> <p><strong>Bulky Ground-types</strong>: Vibrava can shrug off hits from Lairon, remove its Stealth Rock, and threaten it back with STAB Earthquake. Marshstomp and Hippopotas can also take hits easily and set up their own Stealth Rock. However, they all have to be wary of Lairon carrying Toxic.</p> <p><strong>Fast Revenge Killers</strong>: Lairon has a hard time, outside of its Rock Polish set, dealing with revenge killers like Krokorok and Simipour, which can OHKO it. Electabuzz, Magmar, and Vanilluxe typically carry coverage moves that also OHKO Lairon. Even its Rock Polish set struggles to avoid being revenge killed by most Choice Scarf users, as well as Swoobat that carry Hidden Power Ground.</p> <p><strong>Bulky Attackers</strong>: A good portion of the tier, such as Pignite, Politoed, and Dragon Dance Scraggy, can switch in on Lairon once and threaten to revenge kill it with a super effective move.</p>",
    "sets": {
      "Offensive Stealth Rock": {
        "description": "<p>Lairon is a dangerous Stealth Rock setter with its solid defensive typing, powerful Rock STAB move in Head Smash, and great coverage to discourage the entire tier from switching in safely. Lairon's Head Smash threatens to 2HKO many common defensive walls such as Swalot, Ivysaur, and Regenerator Duosion after Stealth Rock damage. Superpower hits Pokemon that resist Head Smash such as Scraggy, Klang, and opposing Lairon. Heavy Slam is preferred in the last slot as another STAB move that is stronger against lighter foes like Carbink and Vibrava. Roar is an alternative option to phaze Pokemon that want to come in and set up in front of Lairon like Duosion or to chip away at opposing Pokemon that sit on it like Bronzor. Toxic is an option that does well at chipping down a common switch-in, Vibrava, to deter it from coming in and removing Lairon's entry hazards. Toxic also wears down other Ground-types like Hippopotas and Marshtomp, which can comfortably switch into Lairon's attacks. Rock Head allows Head Smash to be a spammable move and keeps Lairon healthy.</p> <p>Lairon does well on balance and offensive teams looking for an entry hazard setter that can put pressure on hazard removers like Dustox and physical walls like Ivysaur and Carbink. Cleaners like Klang, Choice Scarf Krokorok, and Huntail appreciate Lairon's ability to put a dent in the likes of Swalot and Duosion. Teammates that can come in and take advantage of opposing Vibrava like Jumpluff and Ivysaur are appreciated. Vibrava is a great pairing, since it can deal with a lot of Pokemon that threaten Lairon such as Pignite, Krokorok, and Gigalith, while Lairon can come in on Pokemon that bother Vibrava like Dustox, Wigglytuff, and Persian. Lairon needs teammates that can help deal with Bronzor, since Bronzor outright walls and beats it, so Pokemon such as Krokorok, Scraggy, and Magic Guard Duosion help alleviate this problem. Faster teammates are always appreciated to make up for Lairon's slow Speed, especially those that benefit from its wallbreaking like Sawsbuck and Jumpluff.</p>"
      },
      "Bulky Stealth Rock": {
        "description": "<p>Bulky Lairon is a great entry hazard setter, using its solid defensive typing and physical bulk to take on some of the tier's top threats like Persian, Klang, and Furfrou. Head Smash is Lairon's strongest STAB move and hits most Pokemon like Swalot, Carbink, and Quilladin, for great damage. Roar phazes foes that Lairon can't touch, like Bronzor, and disrupts setup attempts from Pokemon like Klang, Duosion, and Carbink. Vibrava and Gigalith both have an easy time switching into Lairon, so Toxic is the main option to wear them down. Superpower is an alternative to deal more immediate damage to Scraggy and Klang; however, it isn't as strong of an option against Vibrava, which can just shrug it off. Rock Head makes Head Smash more spammable because it stops Lairon from taking recoil damage that would cut into its bulk. Lairon uses maximum HP investment to avoid KOs that a set with no HP investment wouldn't, like the OHKO from Politoed's Scald and Eviolite Krokorok's Earthquake and the 2HKO from Bulk Up Scraggy's Drain Punch.</p> <p>Lairon does its best work on balance and offense teams looking for an entry hazard setter with a great defensive profile that can deal with a plethora of Pokemon like Persian, Dustox, and Duosion. Frailer teammates like Frogadier and Simipour appreciate Lairon's ability to eat hits from Persian and Furfrou. Lairon pairs well with offensive Quilladin on hazard-stacking teams because Lairon can phaze the opposing team to pile up chip damage, while Quilladin helps deal with a lot of Pokemon that Lairon is weak to such as Vibrava, Gigalith, and Krokorok. Other Grass-types like Simisage and Meganium really like having Lairon on their team because it comes in on Dustox and keeps Stealth Rock up against it for later chip damage. Lairon needs some support from the likes of Scraggy and Magic Guard Duosion against Bronzor, which completely walls it. Swalot is a great teammate that deals with the likes of Pignite and Scraggy while also absorbing Knock Off so Lairon doesn't lose its Eviolite.</p>"
      },
      "Choice Band": {},
      "Rock Polish": {
        "description": "<p>Lairon is a threatening cleaner with access to Rock Polish to let it outspeed the entire unboosted tier, a powerful Rock-type STAB move in Head Smash, and a solid defensive profile. Head Smash comes with no drawback with Lairon's Rock Head ability and OHKOes most offensive targets like Simisage, Frogadier, and Sawsbuck. Superpower is coverage against Pokemon that resist Head Smash like Scraggy, Klang, and opposing Lairon. Heavy Slam is coverage to OHKO Carbink and heavily damage Vibrava, and it is also a solid midground move against most switch-ins.</p> <p>Lairon does well on balance and offense teams looking for an endgame cleaner. Wallbreakers like Krokorok, Pignite, and Scraggy are all appreciated by Lairon, since they can help it get through physical walls that stifle it like Vibrava and Bronzor. Entry hazard setters like Marshtomp, Quilladin, and Whirlipede are appreciated for helping put foes into KO ranges; for example, physically defensive Swalot goes from being 3HKOed to being 2HKOed after Stealth Rock, and Electabuzz goes from being 2HKOed to being OHKOed after Stealth Rock and a layer of Spikes. Lairon likes being paired with teammates that can switch into common Choice Scarf users like Frogadier and Simipour, since it fails to outspeed some of them even after a Rock Polish, so Meganium, Dustox, and Servine make great partners. Lairon also does very well on offensive teams looking for a check to Persian and Furfrou for frailer teammates like Pikachu, Butterfree, and Swoobat.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "sleid", "user_id": 601970}], "teams": [{"name": "Quality checked by", "members": [{"username": "Jett", "user_id": 226429}, {"username": "5Dots", "user_id": 543866}]}, {"name": "Grammar checked by", "members": [{"username": "SolarBeam", "user_id": 470115}, {"username": "zinnias", "user_id": 569291}]}]}
  },
  "Meditite": {"sets": {"Choice Band": {}, "Choice Scarf": {}}},
  "Swalot": {"sets": {"Physical Wall": {}, "Specially Defensive": {}, "Tank": {}, "Curse": {}}},
  "Wailord": {"sets": {"StallLord": {}}},
  "Seviper": {"sets": {"Choice Scarf": {}, "Mixed Attacker": {}}},
  "Whiscash": {"sets": {"Choice Specs": {}, "Dragon Dance": {}, "SubToxic": {}}},
  "Banette": {"sets": {"Choice Band": {}, "Mixed Wallbreaker": {}}},
  "Dusclops": {"sets": {"Special Wall": {}, "Physical Wall": {}}},
  "Glalie": {"sets": {"Offensive Spikes": {}, "Suicide Lead": {}}},
  "Walrein": {"sets": {"SubToxic": {}}},
  "Huntail": {"sets": {"Physical Shell Smash": {}, "Special Shell Smash": {}}},
  "Shelgon": {"sets": {"Cleric": {}, "Bulky Dragon Dance": {}, "Offensive Dragon Dance": {}}},
  "Grotle": {"sets": {"Specially Defensive": {}}},
  "Bibarel": {"sets": {"Suicide Lead": {}}},
  "Kricketune": {"sets": {"Sticky Web Lead": {}}},
  "Luxray": {"sets": {"Physical Wallbreaker": {}}},
  "Mothim": {"sets": {"Choice Specs": {}, "Substitute + Quiver Dance": {}}},
  "Lopunny": {"sets": {"Offensive Utility": {}}},
  "Stunky": {"sets": {"Offensive Utility": {}}},
  "Bronzor": {"sets": {"Physical Wall": {}, "Special Wall": {}}},
  "Munchlax": {"sets": {"CroLax": {}}},
  "Hippopotas": {"sets": {"Physical Wall": {}, "Special Wall": {}}},
  "Servine": {
    "comments": "<h1>Other Options</h1> <p>Servine's Choice Scarf and offensive utility sets can opt to run Hidden Power Fire over Hidden Power Ice, though not being able to consistently threaten Flying-types and Vibrava with super effective damage can end up causing problems if not properly accounted for in teambuilding. While Servine can opt for additional utility moves like Leech Seed, Knock Off, and Glare over Hidden Power on its utility sets, this leaves it walled or threatened by significantly more Pokemon, including several other Grass-type Pokemon like Simisage and Sawsbuck. Servine can also opt for an offensive spread of 4 HP / 252 SpA / 252 Spe on Eviolite sets, but this spread is typically only used on hyper offense teams.</p> <h1>Checks and Counters</h1> <p><strong>Fire-types</strong>: Fire-type Pokemon like Pignite and Magmar can easily switch into Servine's attacks and threaten super effective STAB damage in return, with the latter also outspeeding non-Choice Scarf Servine.</p> <p><strong>Poison-types</strong>: Bulky Poison-type Pokemon like Dustox, Swalot, and Ivysaur easily switch into and threaten out Servine.</p> <p><strong>Flying-types</strong>: Swoobat and Jumpluff can KO Servine from over half HP and can take advantage of Choice Scarf Servine being locked into Leaf Storm.</p> <p><strong>Vanilluxe</strong>: Choice Scarf Vanilluxe can outspeed and KO offensive variants of Servine from nearly full HP, and all variants of Vanilluxe can survive an unboosted Leaf Storm with relative ease.</p> <p><strong>Sap Sipper</strong>: Sap Sipper Pokemon like Gogoat and Sawsbuck are fully immune to Leaf Storm and take relatively little damage from unboosted Hidden Power Ice / Fire, allowing them to threaten Servine out with setup and damage, respectively.</p>",
    "sets": {
      "Offensive Utility": {
        "description": "<p>Offensive Servine is a top-tier setup sweeper through its ability to break foes with its self-boosting STAB Leaf Storm, remove opposing items with Knock Off, hinder switch-ins with Glare, and shut down walls and entry hazard setters with Taunt. Its excellent Speed also allows it to benefit from the paralysis it spreads, outpacing all paralyzed Choice Scarf users in mid-game and end-game scenarios. Hidden Power Ice allows Servine to hit opposing Grass-, Dragon-, and Flying-type Pokemon super effectively.</p> <p>Fire-type teammates like Magmar and Pignite appreciate Servine's ability to paralyze opposing threats and cleanly answer opposing Water-type Pokemon; in return, they threaten out the special walls that often slow down Servine like Dustox, Meganium, and Bronzor. Servine also appreciates having teammates like Politoed, Simipour, and Whiscash that can handle opposing Fire- and Steel-type Pokemon like Pignite and Bronzor. Entry hazard support from Pokemon like Gigalith and Krokorok is also greatly appreciated by Servine to chip its checks into boosted Leaf Storm range. Servine often struggles with opposing Poison-type Pokemon like Swalot and Trubbish, so Psychic-types like Swoobat and Duosion are appreciated as teammates. Lastly, since Servine is a late-game sweeper, wallbreakers like the aforementioned Magmar and Simipour as well as Simisage are invaluable teammates to have.</p>"
      },
      "Bulky Contrary": {
        "description": "<p>Bulky Servine serves as a reliable check to several offensive Electric- and Water-type threats like Electabuzz, Pikachu, Simipour, Politoed, and Huntail and uses the turns that it gains from these threats to chip or otherwise hinder foes. Hidden Power Ice allows Servine to hit opposing Flying- and Dragon-type Pokemon, Hidden Power Fire allows it to hit opposing Steel-type Pokemon, and both give it a tool to answer opposing Grass-type Pokemon. Synthesis acts as reliable recovery, allowing Servine to continue answering the threats it's meant to check, while its final moveslot lets it choose between removing items, paralyzing foes, or chipping at foes and gaining further recovery with Leech Seed. Servine can opt to include both Glare and Knock Off while forgoing Hidden Power, allowing it to disrupt foes in many ways, but this leaves it unable to hit opposing Grass-types. The given EV spread allows Servine to outpace several foes like Scraggy and Modest Glaceon while taking special attacks as well as possible.</p> <p>Entry hazard setters like Gigalith and Krokorok pair excellently with Servine, which punishes Defog attempts with Contrary and appreciates hazard damage on the Fire- and Poison-type Pokemon that often threaten it out. Servine's ability to reliably switch into Electric-type threats is greatly appreciated by teammates like Simipour, Politoed, and Huntail, which can in turn take advantage of the Fire-type Pokemon that Servine is often checked by. Servine often struggles against opposing Poison-type Pokemon like Dustox and Swalot, so teammates like Duosion and Swoobat are greatly appreciated to help deal with them. Lastly, Servine loves having Fire-type teammates like Magmar and Pignite that answer the Steel-type Pokemon trying to take advantage of Servine's relative passivity, especially if it's lacking Hidden Power Fire.</p>"
      },
      "Choice Scarf": {
        "description": "<p>Choice Scarf Servine is one of the tier's premier revenge killers and cleaners, outpacing the entire unboosted metagame and dealing excellent damage with its boosted STAB Leaf Storm. Energy Ball acts as a solid secondary STAB move, allowing Servine to save its limited Leaf Storm PP until the endgame, while Hidden Power Ice allows Servine to KO weakened opposing Grass-types like Simisage and Sawsbuck, Flying-types like Jumpluff, and Vibrava. Servine's final move is dedicated to taking advantage of the many switches it forces in early- and mid-game scenarios, paralyzing foes with Glare or removing items with Knock Off.</p> <p>It can be difficult for Choice Scarf Servine to switch in at times, so it appreciates teammates with pivot moves like Electabuzz and Vibrava. Servine commonly struggles against opposing Fire-type Pokemon like Pignite and Magmar, meaning that Water-type teammates like Simipour and Politoed are excellent to switch into and exploit them. Servine also struggles to break past Poison-type Pokemon like Swalot and Dustox, so Psychic-types like Duosion, Meowstic-F, and Swoobat make for excellent allies to break them. Servine also loves having entry hazard-setting teammates like Gigalith and Krokorok to further chip down its checks with hazard damage, enabling its sweep more easily in endgame scenarios when common checks like Pignite and Dustox are heavily chipped down or removed.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "BaitWiz", "user_id": 598623}], "teams": [{"name": "Quality checked by", "members": [{"username": "5Dots", "user_id": 543866}, {"username": "Jett", "user_id": 226429}]}, {"name": "Grammar checked by", "members": [{"username": "SolarBeam", "user_id": 470115}]}]}
  },
  "Pignite": {
    "comments": "<h1>Other Options</h1> <p>A faster set with Taunt + Toxic can shut down some walls and switch-ins, but it comes at the cost of Pignite's coverage and defensive capabilities, which are generally more valuable. Power-Up Punch is an alternative option on the tank set to potentially pick off a weakened target and then use the extra power to sweep with a stronger Sucker Punch. Flame Charge with extra Speed investment allows Pignite to potentially clean late-game, although Curse + Sucker Punch offers a more reliable vehicle to success. Wild Charge nails Water-types attempting to switch in, although all notable examples will be just as vulnerable to Superpower, which also comes with the perk of lacking recoil. Roar works as some bulky setup sweepers like Scraggy and Iron Defense Klang can become too hard for Pignite to break itself. Bulldoze is helpful for the mirror and works like Flame Charge to a lesser extent, getting the jump on faster attackers like Magmar and Electabuzz. Sometimes, the offensive potential of Blaze can be worth forfeiting Pignite's ability to easily switch into Vanilluxe with Thick Fat, especially given its good synergy with Flare Blitz recoil. RestTalk over Toxic and Sucker Punch on an offensive set is great for helping Pignite stick around while making it arguably the best long-term answer to Bronzor. Although RestTalk makes Pignite much bulkier, it leaves it vulnerable to being revenge KOed more easily. Heavy Slam is a good option to OHKO a common counter in Carbink.</p> <h1>Checks and Counters</h1> <p><strong>Ground-types</strong>: Bulky Ground-types such as Vibrava, Hippopotas, and Marshtomp are hard for Pignite to trade hits against, even if they lose their Eviolite or get poisoned by Toxic.</p> <p><strong>Water-types</strong>: Most Water-types do not want to switch in against Pignite's strong coverage, but the likes of Simipour and Whiscash can come in against its Fire-type attacks and force it out. Politoed's bulk and access to Protect and Encore makes it one of the hardest checks to deal with.</p> <p><strong>Swalot</strong>: Physically defensive Swalot is a pain for Pignite to get through, especially when Flare Blitz recoil is compounded with Rocky Helmet chip damage. Some variants also carry Encore to shut down Curse Pignite.</p> <p><strong>Duosion</strong>: Duosion's overall bulk and access to STAB Psychic and Future Sight make it a good check to Pignite, even absorbing its strong Flare Blitz thanks to Regenerator.</p> <p><strong>Wallbreakers</strong>: Faster, hard-hitting attackers like Life Orb Murkrow and Choice Specs Electabuzz can force out Pignite. Even some of the wallbreakers that Pignite can discourage, like Vanilluxe and Magmar, run coverage like Hidden Power Ground and Psychic, respectively, that can 2HKO Pignite.</p>",
    "sets": {
      "Tank": {
        "description": "<p>As a bulky offensive threat, Pignite ends up being the offensive glue that holds a lot of teams together, with its good all-around bulk and solid offensive coverage always coming in handy. Many Grass-types have a hard time trading hits and preventing Pignite from coming in against them, and many other walls and sweepers such as Dustox, Bronzor, Klang, and Scraggy all struggle versus it. Sucker Punch means that even when Pignite is at low HP, it can still pose a threat to revenge killers, especially frailer examples like Swoobat and Pikachu. For bulkier targets it fails to break through, like Regenerator Duosion, Marshtomp, and Hippopotas, Pignite can still threaten them with Toxic on the switch in. Thick Fat is an asset for discouraging STAB attacks from wallbreakers like Choice Specs Magmar and Vanilluxe. The given EV spread outspeeds Adamant Lairon, although a faster spread to outspeed Adamant Klang is also viable.</p> <p>Grass- and Water-types are some of the best teammates for Pignite, as they complete the Fire / Water / Grass core. Servine and Politoed work on bulky offense, being able to spread status and pivot Pignite in on Grass-types like Ivysaur and Gogoat. Alternatively, the likes of Simisage and Frogadier support Pignite with their revenge killing capabilities, and in return it forces heavy hits on important walls. Duosion's Future Sight support is a great way to make sure Pignite will net hefty damage, as walls like Swalot and Trubbish stop being safe switch-ins to Superpower. Pivots like Volt Switch Electabuzz and Klang can force out Water-types and bring Pignite in on susceptible special walls. Klang, Krokorok, and Lairon appreciate Pignite's ability to break down defensive walls with its powerful STAB moves, giving them an easier time to sweep in the endgame. Entry hazard removers like Vibrava and Dustox are appreciated to reduce the amount of chip damage Pignite takes, since it already deals with Flare Blitz recoil.</p>"
      },
      "Curse": {
        "description": "<p>Pignite poses as a threatening defensive setup sweeper thanks to Curse, while Thick Fat gives it free entry against powerful attackers. Early-game, Pignite has the special bulk to tank hits from a slew of special attackers like Servine, Magmar, and Vanilluxe and can even absorb status like Servine's Glare. It can then recover with Rest late-game and start to set up with Sleep Talk + Curse. Given the lack of viable Flash Fire users, Fire Punch suffices as Pignite's only attack. Brick Break can also work either over Sleep Talk or, seldomly, by itself over Fire Punch, but being unable to force out Gourgiest-L and being completely walled by Ghost-types is usually too much of a liability.</p> <p>Water-types like Politoed and Whiscash make for great teammates, as they can eliminate the Rock-types like Gigalith and Carbink that Pignite struggles to set up against. Sticky Hold Swalot is a solid teammate, as both Trick and Knock Off can stop Curse sweeps. Electabuzz also is great as a way to punish Encore users such as Jumpluff and Politoed. Ivysaur and Servine can remove items with Knock Off, spread status, and force out Water-types like Huntail and Politoed, making it easier for Pignite to sweep, and in return they rely on Pignite to tank the strong Fire- and Ice-type attacks that force them out. Clerics like Meganium and Wigglytuff make Pignite less reliant on Rest for recovery and relieve its role as a status absorber.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "S1nn0hC0nfirm3d", "user_id": 231074}, {"username": "sleid", "user_id": 601970}], "teams": [{"name": "Quality checked by", "members": [{"username": "5Dots", "user_id": 543866}, {"username": "Jett", "user_id": 226429}]}, {"name": "Grammar checked by", "members": [{"username": "SolarBeam", "user_id": 470115}]}]}
  },
  "Simisage": {"sets": {"Mixed All-Out Attacker": {}, "Nasty Plot": {}, "Choice Scarf": {}, "Choice Specs": {}}},
  "Simipour": {"sets": {"Nasty Plot": {}, "Choice Scarf": {}}},
  "Swoobat": {"sets": {"Choice Specs": {}, "Dual Screens": {}, "Calm Mind": {}}},
  "Palpitoad": {"sets": {"Defensive Stealth Rock": {}}},
  "Whirlipede": {"sets": {"Spikes": {}}},
  "Krokorok": {
    "sets": {
      "Offensive Stealth Rock": {},
      "Choice Band": {
        "description": "<p>Krokorok is one of the most feared physical wallbreakers in the metagame, as its STAB combination is difficult for even defensive Pokemon to switch into. Reliable answers to non-Choice Band Krokorok like Servine, Vibrava, and Meganium are vulnerable to being 2HKOed by Choice Band-boosted Knock Off. Knock Off also removes Eviolite from Hippopotas and Quilladin, which allows Krokorok to 2HKO them with Earthquake and Assurance with one layer of Spikes, respectively. Earthquake OHKOes Pignite and deals heavy damage to other Dark-resistant Pokemon like Carbink, Scraggy, and Wigglytuff. Pursuit OHKOes Duosion and Swoobat that are trying to switch out and heavily chips Bronzor. Assurance is Krokorok's strongest option against incoming switch-ins like Jumpluff, Politoed, and Furfrou when entry hazards are up, while Stone Edge is Krokorok's best option for Flying-types like Jumpluff and Pidgeot. Intimidate offers some defensive utility against physical attackers like Swalot and opposing Krokorok, whereas Krokorok is not able to make great use of Moxie, as it will likely be forced out by a faster threat whenever it picks up a KO.</p> <p>Setup sweepers and Choice Scarf users such as Huntail, Lairon, Simipour, and Simisage can more easily clean as a result of Krokorok's wallbreaking capabilities. Swalot, Jumpluff, and Meowstic-F appreciate Krokorok's ability to remove Psychic-types like Duosion and Bronzor. In return, they can check Grass-types for Krokorok or act as sweepers themselves. Entry hazard support from Carbink, Whirlipede, and Glalie wears down physically defensive walls like Quilladin and Hippopotas, allowing Krokorok to overwhelm them. It also helps Krokorok to secure better KO ranges; a single layer of Spikes allows Krokorok to OHKO the likes of Dustox, Gigalith, Swalot, and Klang. Krokorok is threatened out by faster Grass-types like Simisage, Jumpluff, and Sawsbuck, so switch-ins to them like Swalot and Gourgeist-L are ideal teammates. Similarly, Krokorok has issues against fast Water-types like Simipour and Frogadier; some good answers to them include Politoed, Servine, and Dustox. Steel-types like Klang, Bronzor, and Lairon help Krokorok's poor matchup against Vanilluxe and Wigglytuff, as well as being solid switch-ins to some of the aforementioned Grass-types.</p>"
      },
      "Choice Scarf": {}
    },
    "credits": {"writtenBy": [{"username": "Jett", "user_id": 226429}], "teams": [{"name": "Quality checked by", "members": [{"username": "sleid", "user_id": 601970}, {"username": "5Dots", "user_id": 543866}]}, {"name": "Grammar checked by", "members": [{"username": "zinnias", "user_id": 569291}, {"username": "SolarBeam", "user_id": 470115}]}]}
  },
  "Dwebble": {"sets": {"Suicide Lead": {}}},
  "Scraggy": {"sets": {"Bulk Up": {}, "Dragon Dance": {}}},
  "Trubbish": {"sets": {"Defensive Spikes": {}}},
  "Gothitelle": {"sets": {"Calm Mind": {}}},
  "Duosion": {
    "comments": "<h1>Other Options</h1> <p>Hidden Power Fighting is coverage that can also nail Steel-types like Klang but is marginally worse against Dark-types and weaker against opposing Duosion and bulky Grass-types such as Servine, Meganium, and Gogoat. The combination of Night Shade + Infestation and some investment in Speed allows Duosion to beat out the standard Future Sight variants of itself.</p> <h1>Checks and Counters</h1> <p><strong>Dark-types</strong>: While they must be wary of coverage moves, Krokorok and Mightyena can OHKO Future Sight Duosion and are immune to its Psychic-type attacks. Krokorok can also punish Duosion trying to switch out with Pursuit. Scraggy is also bulky enough to safely switch into Duosion and threaten to set up on it.</p> <p><strong>Item Removal</strong>: Since Duosion is heavily reliant on its Eviolite, Knock Off from the likes of Servine, Simipour, and Ivysaur can severely limit its ability to pivot or its setup opportunities. Trick and Switcheroo users such as Swoobat, Lopunny, and Seviper can also disrupt Duosion's ability to recover and set up.</p> <p><strong>Phazers</strong>: Notable examples include Roar Scraggy, Whirlwind Hippopotas, and Dragon Tail Meganium, but with the exception of Scraggy, most phazers must be wary of letting Duosion set up too much beforehand.</p> <p><strong>Taunt</strong>: Taunt users such as Quilladin and Pignite can shut down Duosion's setup attempts, although not all of these Pokemon can easily switch into Duosion even before it starts boosting.</p> <p><strong>Wallbreakers</strong>: With physically defensive EV spreads, if Duosion has suffered minor chip damage, strong wallbreakers like Choice Specs Vanilluxe and Simisage can overwhelm it. Similarly, Choice Band Lairon can tear through specially defensive Duosion sets.</p> <p><strong>Klang</strong>: Klang is a problem for Duosion, as it doesn't take much from Duosion's attacks and can therefore use it as an opportunity to set up, although offensive sets must be wary of Thunder Wave.</p>",
    "sets": {
      "Defensive Pivot": {
        "description": "<p>With the coveted Regenerator and solid bulk thanks to Eviolite, Duosion is the metagame's premier defensive pivot and a staple on many balance teams. Unlike other walls, Duosion circumvents passivity issues by possessing an incredibly high Special Attack stat and Future Sight. This allows it to double up as an excellent progress-maker against most of the metagame due to bulky Psychic-resistant and -immune Pokemon being hard to come by. Signal Beam nails frail Dark-type Pokemon such as Krokorok and Mightyena; the former is especially threatening if it gets in safely because it commonly utilizes Pursuit. Protect not only allows Duosion to scout Choice Krokorok sets but also synergizes greatly with Future Sight. Alternatively, Thunder Wave can punish foes like Servine and offensive Klang sets that may attempt to boost on Duosion. The EV spread allows Duosion to reliably switch into Electabuzz's Volt Switch and heal off any damage with Regenerator. Magic Guard is an alternative that allows Duosion to bypass residual damage from entry hazards and status, although this worsens its functionality as a pivot.</p> <p>Duosion pairs well with Pokemon that take advantage of its Future Sight; some of the most notable examples are Pignite, Simisage, and Scraggy, as they can all hit Dark- and Steel-types for super effective damage and appreciate Future Sight threatening Poison- and Fighting-types switching in. These Pokemon tend to also have the added benefit of covering Duosion's defensive weaknesses. Pignite and Scraggy sometimes use Roar when paired with Future Sight Duosion, as it can phaze in preferred targets. Physically bulky Pokemon like Lairon, Hippopotas, and Gourgeist-L all appreciate Duosion's ability to withstand even the strongest of special attacks from the likes of Simipour, Vanilluxe, and Magmar. Due to Duosion's middling defensive stats without Eviolite, it should be paired with Knock Off absorbers such as Swalot, Jumpluff, and Carbink. Entry hazards punish switching around Future Sight even more, so setters like the aforementioned Carbink and Gigalith as well as Quilladin and Frogadier can make for good partners.</p>"
      },
      "Calm Mind": {
        "description": "<p>Duosion makes for one of the best defensive setup sweepers in the metagame thanks to Magic Guard letting it ignore damage from status and entry hazards. Psyshock can be used over Psychic to win Calm Mind wars against Carbink and opposing setup Duosion. Acid Armor stops physical attackers such as Pignite, Lairon, and Klang from breaking past it, while Signal Beam provides it a means to get around Dark-types like Krokorok and Murkrow.</p> <p>If Duosion is opting for Acid Armor, it is imperative that your team is able to remove Dark-types prior to setting up. Some examples that match up well against Dark-types are Pignite, Carbink, and Wigglytuff. These Pokemon also make for good partners for non-Acid Armor variants, as they can switch into potential revenge killers like mixed Simisage and Choice Band Krokorok. Non-Acid Armor Duosion also appreciates help from Pignite and Hippopotas to help it with Klang, since Klang will win the setup war. If you opt for Psychic over Psyshock, then Steel- and Dark-types such as Klang, Lairon, Scraggy, and Zweilous cover Calm Mind Carbink and opposing Duosion, respectively. To have an easier time setting up late-game, preserving Duosion's Eviolite is pivotal, so Sticky Hold Pokemon like Swalot and Trubbish make for good teammates. They also have the added benefit of spreading status via Toxic and Toxic Spikes, which is another means for Duosion to stall out Dark-types if necessary. Wallbreakers like Vanilluxe and Magmar can take advantage of defensive phazers and Taunt users such as Hippopotas, Meganium, and Quilladin, which are typically troublesome for Duosion's setup attempts.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Jett", "user_id": 226429}], "teams": [{"name": "Quality checked by", "members": [{"username": "5Dots", "user_id": 543866}, {"username": "sleid", "user_id": 601970}]}, {"name": "Grammar checked by", "members": [{"username": "SolarBeam", "user_id": 470115}]}]}
  },
  "Sawsbuck": {
    "comments": "<h1>Other Options</h1> <p>Serene Grace and Headbutt can be used to flinch walls like Swalot and Ivysaur, though this relies a lot more on luck and paralysis support to be executed successfully. Synthesis could be used for additional longevity when wallbreaking, though Sawsbuck can't give up any of its coverage, and Simisage does this better due to its higher Speed and greater diversity in coverage. Choice Band amplifies Sawsbuck's offensive power, though its only good Speed and prediction-reliant nature make its standard sets preferable. Silk Scarf empowers Sawsbuck's Normal-type attacks without any recoil at the expense of its coverage and Grass-type attacks.</p> <h1>Checks and Counters</h1> <p><strong>Bronzor</strong>: Bronzor is Sawsbuck's worst matchup, as it resists both of Sawsbuck's STAB moves, doesn't take much damage from its coverage moves, and can whittle it down with Toxic and Psywave.</p> <p><strong>Dusclops</strong>: Dusclops is immune to Sawsbuck's Normal-type STAB moves, can cripple it with Will-O-Wisp or Toxic, and can proceed to wear it down with Seismic Toss. Due to Dusclops's low HP, Sawsbuck doesn't gain a lot of HP from Horn Leech, and Dusclops can also heal any damage taken with Rest. Offensive Dusclops variants can also threaten Sawsbuck out with Ice Punch.</p> <p><strong>Poison-types</strong>: Physically defensive Poison-types like Swalot, Ivysaur, and Trubbish can stomach even a +2 Return from Sawsbuck and retaliate with their STAB moves. However, only Trubbish survives when Stealth Rock is taken into consideration. Offensive Poison-types like Choice Scarf Seviper and Choice Scarf Gastly can outspeed Sawsbuck variants without Choice Scarf and revenge kill it, though they cannot switch into it.</p> <p><strong>Grass-types</strong>: Both Gourgeist formes can easily take all of Sawsbuck's coverage, force it out through Will-O-Wisp or Foul Play, and recover any damage taken with Synthesis. Faster Grass-types like Jumpluff and Simisage can also force out non-Choice Scarf Sawsbuck with STAB Acrobatics and coverage, respectively.</p> <p><strong>Flying-types</strong>: Flying-types like Swoobat and Pidgeot can switch into Horn Leech and threaten Choice Scarf Sawsbuck not locked into its Normal-type STAB moves.</p> <p><strong>Revenge Killers</strong>: Despite Sawsbuck's respectable Speed, faster attackers like Electabuzz, Frogadier, and Simipour can defeat it with minimal prior chip damage, and Choice Scarf variants of these Pokemon can even pick off Choice Scarf variants of Sawsbuck.</p>",
    "sets": {
      "Swords Dance": {
        "description": "<p>Sawsbuck is an excellent setup sweeper with Swords Dance, owing to its good Speed, power, and typing. Double-Edge is preferred over Return, always 2HKOing Servine and OHKOing Simisage. Return can be used instead if Sawsbuck does not wish to suffer recoil, but it misses these benchmarks. Horn Leech targets Normal-resistant and immune Pokemon like Gigalith, Carbink, and Dusclops. Jump Kick is its preferred coverage move, hitting Steel-types like Klang and Lairon harder than any of its other moves do. Sap Sipper allows Sawsbuck to pivot into Grass-type attacks freely while also enhancing its wallbreaking prowess. If used on sun teams, an Adamant nature and Chlorophyll are necessary for it to outspeed the entire unboosted metagame under sun while hitting as hard as possible.</p> <p>Sawsbuck does excellently on balance and offensive teams, where it can leverage its good Speed and offensive prowess to punch holes early-game as a wallbreaker or clean up late-game. It struggles the most against Bronzor and physically bulky Poison-types like Swalot and Ivysaur; checks to these threats like Magmar and Krokorok help it break through these checks more easily. Defensive backbones strong against these threats, like the aforementioned Poison-types and Duosion, can preserve Sawsbuck's health. Late-game sweepers like Simipour and Calm Mind Swoobat can help clean up the opposition and take advantage of Sawsbuck's wallbreaking. Wallbreakers like Magmar and Vanilluxe make Sawsbuck harder to stop late-game.</p>"
      },
      "Choice Scarf": {
        "description": "<p>Sawsbuck makes for a notable cleaner and revenge killer, getting the jump on the entire unboosted metagame and able to check fast threats like Simipour, Simisage, and Persian well. Without a damage-boosting item, Double-Edge's strength is necessary over Return's lack of recoilthe extra power allows Sawsbuck to always 2HKO Pignite without needing Stealth Rock and have a good chance of OHKOing Simisage with Stealth Rock. Jump Kick is its strongest coverage against Steel-types like Lairon and Klang. Megahorn 2HKOes Grass-types like Gogoat and Servine and is its strongest coverage move against Bronzor. Toxic puts walls like Gourgeist formes and Dusclops on a timer.</p> <p>As this set emphasizes Sawsbuck's Speed to let it revenge kill, it tends to struggle more against checks like the aforementioned Bronzor and bulky Poison-types. Wallbreakers like Pignite and Choice Band Lairon can threaten the opposition, making Sawsbuck's attacks even harder to switch into. Walls like Swalot and Gigalith can provide a cushion for physical attacks to give Sawsbuck opportunities to perform later into the game. Pivots like Electabuzz and Dustox can help get Sawsbuck onto the field more safely, and special attackers like Frogadier and Magmar can threaten bulky checks that it often has trouble getting past.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "5Dots", "user_id": 543866}], "teams": [{"name": "Quality checked by", "members": [{"username": "Jett", "user_id": 226429}, {"username": "sleid", "user_id": 601970}]}, {"name": "Grammar checked by", "members": [{"username": "SolarBeam", "user_id": 470115}]}]}
  },
  "Emolga": {"sets": {"Offensive Pivot": {}}},
  "Frillish": {"sets": {"Physical Wall": {}}},
  "Klang": {"sets": {"Shift Gear": {}, "Double Dance": {}, "Defensive Pivot": {}}},
  "Eelektrik": {"sets": {"Defensive Pivot": {}}},
  "Lampent": {"sets": {"Substitute + Calm Mind": {}, "Choice Specs": {}}},
  "Mienfoo": {"sets": {"Offensive Pivot": {}, "Choice Scarf": {}}},
  "Heatmor": {"sets": {"Wallbreaker": {}}},
  "Zweilous": {"sets": {"Choice Band": {}, "Choice Scarf": {}, "RestTalk": {}}},
  "Quilladin": {"sets": {"Offensive Spikes": {}, "Defensive Spikes": {}}},
  "Frogadier": {
    "comments": "<h1>Other Options</h1> <p>Frogadier can also use Surf instead of or with Hydro Pump as a less powerful but more reliable STAB option, but it is generally difficult to justify over the additional power of Hydro Pump or using the moveslot for other coverage moves.</p> <h1>Checks and Counters</h1> <p><strong>Specially Defensive Walls</strong>: Dustox, Duosion, and Bronzor can shrug off any of Frogadier's attacks. Dustox, Bronzor, and Magic Guard Duosion sets also cannot be worn down by Frogadier's Toxic Spikes.</p> <p><strong>Bulky Water-types</strong>: Politoed and Seaking are generally safe switch-ins into Frogadier, as they both resist its common moves and are only 2HKOed by Life Orb Hidden Power Grass sets.</p> <p><strong>Bulky Grass-types</strong>: Servine and Gogoat are bulky enough to avoid being 2HKOed by Ice Beam, with the former also threatening to paralyze Frogadier with Glare.</p> <p><strong>Fast Offensive Pokemon</strong>: Electabuzz, Simisage, and Jumpluff can all outspeed and OHKO Frogadier with their STAB attacks, and Choice Scarf variants of the first two outpace even Choice Scarf Frogadier.</p>",
    "sets": {
      "Offensive Pivot": {
        "description": "<p>Great offensive stats, backed by the coveted Protean and a wide coverage and utility movepool, make Frogadier one of the best special attackers and pivots in the tier. Life Orb allows Frogadier to hit several benchmarks, such as OHKOing Eviolite Magmar with Hydro Pump and 2HKOing bulky Servine with Ice Beam. Eviolite, on the other hand, lets Frogadier better switch into attacks in general, notably letting it avoid an OHKO from Gigalith's Stone Edge and Duosion's Future Sight, although it should only be switching into strong attacks like these in a pinch. Ice Beam nails Grass-types such as Ivysaur, Gourgeist-L, and Gogoat as well as Vibrava, with Protean removing Frogadier's weakness to the former group's STAB attacks. U-turn is an excellent tool to keep momentum against specially bulky Pokemon such as Bronzor, Duosion, and Swalot. Toxic Spikes can wear down bulky Water-types like Politoed and Seaking, which typically switch in to answer Frogadier, and also synergizes well with its coverage and U-turn forcing switches. Hidden Power Grass with Life Orb can 2HKO Politoed and Seaking one layer of Spikes, while Taunt helps to prevent the specially bulky Pokemon from using their recovery moves.</p> <p>Given Frogadier's frailty, slow U-turn users like Vibrava and Dustox are good partners and have the added benefit of clearing the entry hazards that can limit the opportunities in which Frogadier can pivot. Offensive pivots such as Electabuzz, Persian, and Furfrou can also form great cores with Frogadier, with the last two also luring in Rock-types like Gigalith, Carbink, and Lairon, which Frogadier can take advantage of. Faster Grass-type attackers such as Simisage, Jumpluff, and Choice Scarf Sawsbuck can revenge kill Frogadier, so it is imperative to have some Fire-, Poison-, or Flying-types on your team when using Frogadier; some good examples include Pignite, Magmar, Swalot, Ivysaur, and Pidgeot. Similarly, Electabuzz poses a big problem to Frogadier, so Electric-immune and resistant Pokemon like Hippopotas, Krokorok, Servine, and Quilladin are appreciated. The aforementioned Krokorok, as well as Whiscash and Swoobat, appreciate Toxic Spikes support, as their answers are vulnerable to poison. Fast Normal-types like Persian, Furfrou, and Choice Scarf Pidgeot can revenge kill Frogadier, so reliable switch-ins to them like Gigalith, Lairon, and Bronzor are incredibly valuable.</p>"
      },
      "Choice Scarf": {
        "description": "<p>Choice Scarf Frogadier outpaces the entire unboosted metagame, making its Hydro Pump a great tool for revenge killing opposing Choice Scarf users, such as Krokorok and Magmar, as well as boosted setup sweepers like Rock Polish Lairon and Shell Smash Magcargo. Ice Beam can revenge kill Simisage, Jumpluff, and Choice Scarf Sawsbuck. U-turn chips away at expected switch-ins like Politoed and bulky special walls like Duosion and Bronzor, while Toxic Spikes provides additional chip damage on Servine, Gogoat, non-Magic Guard Duosion, and other specially defensive walls to allow Frogadier to clean late-game. Alternatively, Hidden Power Grass is useful for stopping Whiscash and Huntail in their tracks.</p> <p>Setup sweepers and wallbreakers like Sawsbuck, Simisage, Klang, and Pignite make for good partners, since Frogadier can keep Fire-types like Magmar and Lampent and Ground-types like Krokorok at bay. Frogadier also pairs well with other pivots, since it can struggle to switch in safely; examples of good slow pivots include Dustox and Vibrava. Dustox and Vibrava also offer entry hazard removal, which is vital, as Frogadier lacks recovery and pivots often. Pokemon that can remove items such as Persian, Krokorok, and Servine and entry hazard setters like Bronzor, Gigalith, and Whirlipede help aid Frogadier's cleaning efforts. Additionally, special wallbreakers like Magmar, Vanilluxe, and Simisage can help weaken the likes of Swalot, Bronzor, and Duosion so that Frogadier has an easier time cleaning through them.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Jett", "user_id": 226429}], "teams": [{"name": "Quality checked by", "members": [{"username": "5Dots", "user_id": 543866}, {"username": "sleid", "user_id": 601970}]}, {"name": "Grammar checked by", "members": [{"username": "zinnias", "user_id": 569291}, {"username": "SolarBeam", "user_id": 470115}]}]}
  },
  "Gogoat": {"sets": {"Bulk Up": {}, "Special Wall": {}}},
  "Furfrou": {"sets": {"Choice Band": {}, "Choice Scarf": {}, "Physically Defensive": {}}},
  "Meowstic-F": {"sets": {"All-Out Attacker": {}, "Choice Scarf": {}}},
  "Carbink": {"sets": {"Physical Wall": {}, "Offensive Stealth Rock": {}, "Double Dance": {}}},
  "Sliggoo": {"sets": {"Curse": {}, "Tank": {}}}
}