{
  "Gengar": {
    "overview": "<p>Gengar is a terrific Pokemon in Balanced Hackmons because it can be in its Mega forme while being able to wield any item it wants. There are a multitude of great traits that Mega Gengar possesses, such as a high Speed stat, high damage output, and being almost entirely Imposter-proof except to Spooky Plate Imposter users, making Mega Gengar a huge threat to many teams in the Balanced Hackmons metagame. Mega Gengar can also counter Sturdy Shedinja thanks to Mold Breaker. However, Mega Gengar is threatened by -ate Pokemon, as the combination of Fake Out and Extreme Speed from just about every viable -ate Pokemon can 2HKO Mega Gengar, although running King's Shield can slightly remedy this problem.</p> ",
    "comments": "<h1>Other Options</h1> <p>Moonblast can be used to KO Yveltal. A set utilizing normal Gengar with Illusion and Gengarite can exploit a loophole to acquire Shadow Tag. Running Taunt with Sludge Bomb completely shuts down Mega Audino. Quiver Dance is an option, being a little slower than Shell Smash in terms of the time it takes to set up without having to deal with any Defense drops. Aura Sphere might seem appealing, but it is a lackluster option because hitting Slaking harder is not nearly as good as breaking Fur Coat Chansey. Adaptability lets Mega Gengar turn 2HKOs into OHKOs on various Pokemon. Substitute is an alternative to King's Shield to combat -ate Pokemon such as Mega Rayquaza and has the additional perk of giving Mega Gengar more setup opportunities. Baton Pass is neat in order to escape opposing Pursuit trappers. Dark Void over Spore is an option to put Grass-types to sleep, but Grass-types do not normally switch in on Mega Gengar. Entry hazards can also be used, as Mold Breaker ignores Magic Bounce users.</p> <h1>Checks and Counters</h1> <p><strong>Yveltal: Specifically, Poison Heal and Regenerator variants of Yveltal can Pursuit trap Mega Gengar, ending its reign of terror. Additionally, they can hit Mega Gengar with Sucker Punch if it stays in to attack.</p> <p><strong>-Ate Ability Users</strong>: -Ate ability users can hit Mega Gengar with priority attacks in the form of Fake Out in conjunction with Extreme Speed. Mega Gengar is ridiculously frail, so it is 2HKOed by the combination from just about every viable user.</p> <p><strong>Mega Audino</strong>: Mega Audino is a huge threat to Mega Gengar if it doesn't run Sludge Bomb. It walls Mega Gengar due to its typing and bulk, although Mega Audino cannot do much back.</p> <p><strong>Knock Off Users</strong>: Knock Off users such as Yveltal can remove Mega Gengar's Spooky Plate in addition to doing massive damage to it.</p> <p><strong>Spooky Plate Imposter Users</strong>: Although not common, Spooky Plate Chansey and Blissey can transform into Mega Gengar and hit it with Judgment. Mega Gengar can't OHKO Imposter Blissey and Chansey unless it can set up Shell Smash. Either way, Mega Gengar would have to rely on a Speed tie because Imposter also copies stat changes.</p> ",
    "sets": [
      {
        "name": "Mold Breaker Sweeper",
        "description": "<h1>Moves</h1> <p>With Spooky Plate, Judgment is turned into a 120-Base Power Ghost-type move. It also allows Mega Gengar to evade and demolish non-Spooky Plate Imposter users. Secret Sword in tandem with Ghost-type Judgment means that no Pokemon will resist Mega Gengar's Fighting- and Ghost-type moves. Secret Sword also allows Mega Gengar to beat Fur Coat Chansey. Sludge Bomb is a good alternative to Secret Sword, as it hits Mega Audino, a common switch-in to Mega Gengar, for massive damage. Shell Smash boosts Mega Gengar's Attack, Special Attack, and Speed by two stages, allowing it to threaten a plethora of teams as long as -ate Pokemon have been eliminated. The fourth move slot depends on what the team needs. King's Shield gives Mega Gengar a way to combat -ate Pokemon, Pursuit lets Mega Gengar KO Sturdy Shedinja, which tends to switch out of it, and Spore gives Mega Gengar many more opportunities to set up a Shell Smash. A very reasonable alternative to Shell Smash is Tail Glow, which allows Mega Gengar to destroy slower builds to an even greater extent at the cost of not doing as well versus offensive builds.</p> <h1>Set Details</h1> <p>Maximum Speed investment with a Timid nature allows Mega Gengar to Speed tie with positive-natured Mega Mewtwo X. Maximum Special Attack investment gives Mega Gengar's attacks a lot of punch. Even if Mega Gengar is running Pursuit, a Timid nature should be used because Pursuit is used exclusively for Shedinja. A Spooky Plate is imperative to hold on just about every Mega Gengar, as otherwise Mega Gengar doesn't have a Ghost-type STAB move that is virtually Imposter proof. Mold Breaker allows Mega Gengar to beat Sturdy Shedinja and Fur Coat Chansey. Another boon of using Mold Breaker is breaking many Pokemon with Unaware, though the ability is not very common in the current Balanced Hackmons metagame.</p> <h1>Usage Tips</h1> <p>Try to pivot into Mega Gengar, whether by double switches or a switching move. If Pursuit is being used, try to switch in Mega Gengar on the same turn that Shedinja switches in, as Shedinja can pivot out on a Mega Gengar switch-in. When Shedinja tries to switch out, use Pursuit to KO it. It is highly recommended to not set up Shell Smash until all the opposing -ate users are eliminated, even if Mega Gengar is running King's Shield.</p> <h1>Team Options</h1> <p>The number one partner to Mega Gengar is Mega Diancie, as it can beat Mega Gengar's two best counters, Yveltal and Mega Audino. A bulky Steel-type is imperative, as one can remove the -ate Pokemon that hinder Mega Gengar so much. Examples include Aegislash, Dialga, and Registeel. Entry hazard setters such as Groudon provide another method to chip away at the opposing team. Pokemon that greatly appreciate Shedinja's absence, such as -ate Pokemon, will love being paired with Mega Gengar. Even without Pursuit, the -ate Pokemon can wear down the opposing Pokemon for Mega Gengar to clean up late-game.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Ranger Mike", "user_id": 206898}], "teams": [{"name": "Quality checked by", "members": [{"username": "Uselesscrab", "user_id": 167744}, {"username": "Piccolo Daimao", "user_id": 219853}, {"username": "E4 Flint", "user_id": 203690}]}, {"name": "Grammar checked by", "members": [{"username": "Empress", "user_id": 175616}, {"username": "Lumari", "user_id": 232216}]}]}
  },
  "Arceus": {
    "overview": "<p>Arceus's even distribution of stats reflects its ability to perform a variety of roles. However, the comparative mediocrity of a base stat of 120 in the Balanced Hackmons metagame makes Arceus a jack of all trades and a master of none. It neither hits as hard nor takes hits as well as Pokemon with more extreme stat spreads. That being said, Arceus has several distinct characteristics that set it apart from its competitors. For one, though it isn't great defensively, Arceus's Normal typing gives it access to two of the most powerful STAB moves in the metagame, Facade and Boomburst, both of which it can use equally well thanks to its well-rounded attacking stats. In addition, Arceus possesses the inherent advantage of taking reduced damage from Knock Off and being invulnerable to Trick when it holds a Plate. Finally, because any Arceus sprite can be used on the Pokemon Showdown! teambuilder regardless of whether or not Arceus is using Multitype and/or holding a plate of the given type, a variety of colorful sprites can be used to beguile the opponent. Overall, Arceus ekes out a niche as a solid attacker in Balanced Hackmons, though it does lack the flair of faster and stronger offensive Pokemon like the Mega Mewtwo formes and Mega Rayquaza.</p> ",
    "comments": "<h1>Other Options</h1> <p>Arceus is occasionally used in defensive roles, most notably as a physically defensive Soundproof Pokemon that can function well against offense (by defeating -ate ability users that run Boomburst) and stall (by using Perish Song in conjunction with a trapping move). However, other Pokemon with superior bulk or defensive typings, such as Mega Slowbro, are generally more useful in this role. Multitype can be used to change Arceus's type; the combination of Multitype and a Spooky Plate is often used to emulate Mega Gengar strategies, while a Stone Plate is occasionally seen on sand-based teams to gain the Special Defense boost provided by the weather. Note once again that the player does not necessarily have to equip on Pokemon Showdown the sprite that matches Arceus's actual type; it is advantageous to try to trick the opponent by using a different sprite. Neither Multitype strategy is very effective because they require the effective sacrifice of both an item and ability to function. Dark Void can replace Spore because it is not blocked by Safety Goggles or Grass-types, but its unreliable accuracy can result in a defeat.</p> <h1>Checks and Counters</h1> <p><strong>Massively Bulky Pokemon: Pokemon such as the omnipresent Giratina and the somewhat-less-so Mega Slowbro counter the physical Arceus set. Even Arceus's super effective moves like Knock Off do negligible damage to these Pokemon, especially if the foe is running Griseous Orb or Slowbronite, respectively. The Poison Heal variant of Giratina is especially effective at countering Arceus because its recovery prevents it from losing to a physical set with the combination of Icicle Crash and Leech Seed. In addition to Giratina and Mega Slowbro, many Magic Bounce users and the occasional Flash Fire Aegislash can force out the Poison Heal set through the use of ability-changing moves such as Entrainment or phazing ones such as Whirlwind. Meanwhile, Fur Coat Chansey can shrug off any hit from any variant of the Judgment set and only fears Leech Seed.</p> <p><strong>Mega Mewtwo X: Mega Mewtwo X outspeeds Arceus before it gets the chance to set up a Shift Gear or Quiver Dance and can easily OHKO with either super effective Fighting-type STAB moves or simply incredibly powerful attacks like V-create. It only fears King's Shield, which is somewhat uncommon on Arceus anyway.</p> <p><strong>Mega Mewtwo Y</strong>: Mega Mewtwo Y, much like its X counterpart, checks Arceus, particularly if it uses the combination of Sheer Force, Focus Blast, and Life Orb, with which it can easily OHKO barring a miss. Otherwise, it can still threaten Arceus with different Fighting-type coverage moves like Secret Sword.</p> ",
    "sets": [
      {
        "name": "Physical Poison Heal",
        "description": "<h1>Moves</h1> <p>When Arceus's Toxic Orb has been activated, Facade is boosted to a Base Power of 140 and can serve as an extremely reliable STAB move for this set. Running Facade also helps against Imposter Chansey because the ability doesn't copy poison and thus doesn't carry over the power boost, leaving the user with a STAB move of only 70 Base Power. With regards to coverage moves, Arceus's excellent Speed tier makes Icicle Crash, using which it can outspeed and OHKO Mega Rayquaza, an extremely viable option. Icicle Crash also does more damage than other coverage options like Knock Off to Griseous Orb-holding or itemless Giratina, though it doesn't do a terrific amount of damage regardless. Though it is less effective against Giratina after it first connects and removes Giratina's item, Knock Off hits the Rock- and Steel-types that resist Facade for neutral damage and removes crucial items like Imposter Chansey's Eviolite. Similarly, Thousand Arrows has a bit of utility due to its ability to hit Pokemon with the same Rock and Steel defensive typings for large amounts of damage. Spore is especially useful on this Arceus set because though the move can be blocked by Grass-types and Safety Goggles, a poisoned Arceus has no fear of having Spore bounced back by Magic Bounce. Leech Seed helps extend Arceus's longevity; the draining effect also helps beat Imposter Chansey because an opposing Chansey will have a higher HP stat than Arceus and thus gain less HP back from Leech Seed recovery; the move also provides a reliable means of knocking out Sturdy Shedinja. King's Shield provides an opportunity for guaranteed Toxic Orb activation (though the player should watch out for opposing status moves) as well as an added line of defense against -ate ability users. Shift Gear allows Arceus to punch holes in opposing teams and outpace fast attackers like Mega Gengar and the Mega Mewtwo formes as a result of the Speed boost. Alternatively, Roost is an extra form of recovery that significantly extends Arceus's lifespan but removes all sweeping potential from the set.</p> <h1>Set Details</h1> <p>The 216 EVs in Speed and the Jolly nature enable Arceus to outspeed notable offensive threats such as Mega Rayquaza (which it can OHKO with Icicle Crash), Mega Diancie, Regigigas, and Slaking. 248 EVs in Attack ensure that Facade and any coverage moves do as much damage as possible; these EVs are especially important given Arceus's relatively low attacking stats. The remaining 44 EVs go into HP to increase Arceus's chances of surviving powerful attacks and to hit a number ideal for Poison Heal recovery. Toxic Orb ensures that Arceus, if switched in safely, will be poisoned and thus be able to make full use of both its ability and its primary STAB move.</p> <h1>Usage Tips</h1> <p>It is important to switch Arceus in by means of an allied Pokemon's fainting or the use of a slow pivot with U-turn, Baton Pass, or Volt Switch so that one does not even run the risk of encountering a stray status move or Knock Off before Toxic Orb is activated and Poison Heal can begin to take effect. In addition, while Arceus is relatively bulky, with the given stat spread it lacks the defenses required to take hits from some of Balanced Hackmons's elite attackers, making switching in by means of a pivot or sacrifice all the more important.</p> <h1>Team Options</h1> <p>Giratina and other Ghost-types are excellent teammates for Arceus because they are immune to Fighting, Arceus's sole weakness. Giratina is especially useful because it can switch into a variety of Mega Mewtwo X sets very reliably, which is one of the main Pokemon that run sets that frequently threaten Arceus. If Arceus does not run Leech Seed or Spiky Shield, a Mold Breaker teammate like Mega Gengar, Mega Gyarados, or even Giratina is necessary to eliminate Sturdy Shedinja. (Even if Spiky Shield is used, this is a useful provision because Spiky Shield is not the most reliable way of checking Shedinja.) Lastly, wallbreakers such as Mega Mewtwo X (which can also eliminate Rock- and Steel-types) are essential to take out Prankster and especially Unaware Pokemon that may threaten a potential sweep by Shift Gear Arceus.</p> "
      },
      {
        "name": "Quiver Dance",
        "description": "<h1>Moves</h1> <p>While many prominent defensive Pokemon like Giratina, Registeel, and Aegislash resist or are immune to Boomburst, it does huge chunks of damage to the offensive Pokemon that populate the metagame. Judgment takes advantage of the fact that Arceus cannot have its Plates Knocked Off and serves as reliable coverage that Imposter users cannot access. Quiver Dance is an excellent move for special Arceus sets, as it not only boosts Special Attack but also boosts Arceus's already excellent Speed to the point that Arceus outspeeds the entire Balanced Hackmons metagame. King's Shield can be used to protect against -ate ability users' Fake Out or Extreme Speed and force them to incur a two-stage Attack drop. It also allows Arceus to scout for Fighting-type coverage moves from faster attackers. Alternatively, Secret Sword provides additional coverage that hits Mega Tyranitar, the only relevant Pokemon that resists Ghost / Normal coverage, extremely hard, though it is less useful on Earth Plate Judgment sets, while also hitting powerful walls such as Chansey (which it notably hits on its weaker Defense stat) and Registeel for super effective damage. Lastly, Leech Seed is an option that serves as an additional anti-Imposter Chansey (due to Chansey's high HP stat) and anti-Sturdy Shedinja measure.</p> <h1>Set Details</h1> <p>Spooky Plate gives Arceus a Ghost-type Judgment that hits Giratina and Aegislash hard while providing excellent neutral coverage with the Normal-type Boomburst. This is generally the optimal Plate. However, Earth Plate gives Arceus a Ground-type Judgment, which can hit bulky Steel-types such as Registeel super effectively but leaves Arceus walled by virtually any variant of the exceptionally common Giratina. The 124 Speed EVs, together with the Timid nature, enable Arceus to outspeed Deoxys-S (and thus the entirety of Balanced Hackmons) after a single use of Quiver Dance, though fewer Speed EVs and perhaps even a Modest nature can be used if outspeeding only certain slower Pokemon is one's priority. 244 Special Attack EVs boost Arceus's mediocre Special Attack nearly as much as possible to give it the best possible chance of sweeping, while the remaining 140 EVs go into HP, making Arceus hit a number ideal for Poison Heal recovery.</p> <h1>Usage Tips</h1> <p>Arceus's unique stat distribution makes setting up a sweep somewhat difficult. It's best to eliminate opposing -ate ability users before attempting to set up with Quiver Dance, as even after setting up, Arceus is extremely vulnerable to the combination of Fake Out and Extreme Speed that they commonly employ. Arceus also lacks the attacking prowess to simply power through its counters by boosting, so Pokemon that easily counter the set (Mega Tyranitar for the Spooky Plate set without Secret Sword, Giratina for the Earth Plate set) should also be taken out beforehand. Also, because Arceus is likely running an offensive EV spread, it lacks the bulk to take hits from strong attackers and should probably be brought in via a teammate's fainting or the use of a slow pivot. Finally, the aforementioned trick that involves changing Arceus's sprite is especially useful for this set, which can bluff a variety of types using the combination of Judgment and a Plate and thus confuse the opponent.</p> <h1>Team Options</h1> <p>Giratina (thanks to its immunity to the Fighting-type attacks that threaten Arceus and its ability to check Mega Mewtwo X) and wallbreakers like the Mega Mewtwo formes (which can eliminate Prankster or Unaware users that aim to prevent a sweep as well as other defensive Pokemon that resist Arceus's attacks) are excellent teammates for Arceus. If Arceus does not run Leech Seed, a Mold Breaker user, perhaps even Giratina itself, will also be necessary to ensure that Sturdy Shedinja does not pose a great threat to one's team. Finally, because this set is somewhat vulnerable to -ate ability users' Fake Out + Extreme Speed, a common counter to them like Fur Coat Chansey can be of use.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Uselesscrab", "user_id": 167744}, {"username": "Kingslayer2779", "user_id": 231877}], "teams": [{"name": "Quality checked by", "members": [{"username": "E4 Flint", "user_id": 203690}, {"username": "Piccolo Daimao", "user_id": 219853}]}, {"name": "Grammar checked by", "members": [{"username": "P Squared", "user_id": 168392}, {"username": "Lumari", "user_id": 232216}]}]}
  },
  "Aegislash": {
    "overview": "<p>Aegislash sees high usage in Balanced Hackmons, since its great mixed defensive stats allow it to act as a bulky special or physical wall. As a Steel-type, it has a resistance to common attacking types, like Dragon, Ice, Flying, and Fairy, the last three of which let it check -ate users. Aegislash's Ghost typing gives useful immunities to Normal and Fighting, which can be seen in Endeavor Shedinja and common Fighting coverage for other Steel-types. It also gives Aegislash an immunity to being trapped, so things like Magnet Pull and Magma Storm can be switched out of. However, Aegislash is also weak to two common coverage types in Ground and Fire as a result of its typing. Furthermore, it is weak to Dark, which is extremely common on walls and attackers alike in the form of Knock Off. Dark, along with Ghost, is also a prevalent attacking type in Pokemon like Mega Tyranitar, Gyarados, and Gengar. The Dark-type weakness also allows Aegislash to be taken out with Pursuit easily. As a result of these hindrances, it faces tough competition from Registeel, which is slightly bulkier and trades Aegislash's Dark- and Ghost-type weaknesses for a Fighting-type weakness. Aegislash's Speed stat is also higher than that of common pivots like Registeel and Mega Audino, making it less effective at gaining momentum against these Pokemon, since it will switch first when using a pivot move.</p> ",
    "comments": "<h1>Other Options</h1> <p>Thanks to Aegislash's wide variety of resistances, it can effectively run several other support moves, like Stealth Rock, Heal Bell, and Defog, since it has many opportunities to switch in. Heart Swap can also be used over Topsy-Turvy, and it can ignore Substitute. With Baton Pass, Aegislash can pass boosts to teammates as well. Alternatively, Haze can remove boosts entirely and stops sweepers from just setting up again afterwards, unlike Heart Swap, and is more useful against those that lower their own stats via moves like V-create and Shell Smash. The Prankster set can also run Taunt and Curse, the former of which stops Pokemon from setting up and using support moves, and the latter of which damages the opposing Pokemon, preventing sweeps and Baton Pass shenanigans. Curse's use is limited, however, because of the large HP loss. Whirlwind is another option for the Prankster set that works well with Destiny Bond, which will remain in effect until Aegislash's next move, letting it phaze sweepers. Aegislash can also run a Regenerator set with Assault Vest, as it is one of the few Pokemon that isn't 2HKOed by Mega Rayquaza's Choice Specs- and Aerilate-boosted Boomburst. It has the niche of being immune to Secret Sword, which Mega Rayquaza occasionally runs. Levitate can be run to cover Aegislash's Ground weakness, which is useful considering that Precipice Blades is a common coverage move on -ate users; however, the prevalence of Thousand Arrows reduces its use. Aegislash can also be run with Stance Change as a surprise sweeper.</p> <h1>Checks and Counters</h1> <p><strong>Dark-types: Dark-types like Mega Tyranitar and Yveltal deal lots of damage to Aegislash due to its Dark weakness, and they can carry Pursuit to eliminate a weakened Aegislash. They also commonly run Poison Heal, giving them an immunity to Spore and Will-O-Wisp. However, they must be wary of burns if they are running a different set.</p> <p><strong>Substitute and Taunt Users: Pokemon carrying Substitute or Taunt, like Gale Wings Mega Rayquaza, render both sets ineffective, as their main moves are useless. Substitute can be Encored by Prankster Aegislash, though.</p> <p><strong>Super Effective Coverage Moves</strong>: Coverage moves like Earth Power and Precipice Blades can take out Aegislash, especially if they come from boosted or powerful attackers like Mega Rayquaza. Pokemon carrying Mold Breaker, like Mega Mewtwo X, can also bypass Flash Fire to hit Aegislash with Fire-type moves.</p> <p><strong>Primal Groudon: Primal Groudon beats most variants of Aegislash due to its natural burn immunity and super effective Ground- and Fire-type STAB moves. The Prankster set can put it to sleep with Spore, however.</p> <p><strong>Magic Bounce</strong>: Magic Bounce Pokemon can nullify most of Aegislash's effectiveness aside from absorbing damage.</p> ",
    "sets": [
      {
        "name": "Flash Fire",
        "description": "<h1>Moves</h1> <p>Will-O-Wisp spreads burns, crippling physical attackers and chipping away at the health of opposing Pokemon. It can be used without reserve because Flash Fire prevents Magic Bounce and Imposter Pokemon from using it against you. Recover keeps Aegislash healthy so it can continue to function as a wall. Whirlwind is useful for phazing sweepers, especially those behind a Substitute. Topsy-Turvy can be used instead to invert the foe's boosts, which is better against setup sweepers and Contrary users without Substitute. Baton Pass lets Aegislash pivot out, gaining momentum, but also pass along harmful effects like Leech Seed and Parting Shot stat drops. U-turn can be used instead so Aegislash isn't shut down by Taunt, but it can be blocked by Protect and make Aegislash susceptible to Rocky Helmet damage. Parting Shot is another option that weakens attackers, but creates a problem if the opponent is carrying a Contrary user and is also blocked by Soundproof and Magic Bounce Pokemon. This does give it the use of phazing Magic Bounce sweepers, which cannot be phazed by Whirlwind or hit with Topsy-Turvy. Entrainment is an alternative option that replaces the opposing Pokemon's ability, stopping Poison Heal, -ate, and Contrary users.</p> <h1>Set Details</h1> <p>The given EVs and nature maximize Aegislash's special bulk so that it can take strong special attacks like -ate Boomburst and Psycho Boost more comfortably. If preferred, Aegislash can invest in Defense instead, since many moves it is weak to, like Knock Off and Thousand Arrows, are physical. A Speed-decreasing nature lets Aegislash move after other Aegislash so it can gain momentum more consistently when using Baton Pass. Flash Fire covers Aegislash's Fire-type weakness, letting it counter common Contrary sets and -ate users with Fire-type coverage. It also renders Aegislash immune to Will-O-Wisp, so Imposter and Magic Bounce users can't use the move against it. Safety Goggles ensures that Aegislash isn't hit by Spore, while Leftovers provides a little passive recovery.</p> <h1>Usage Tips</h1> <p>Aegislash can switch into attackers whose STAB attacks it resists, although it is advised to scout for coverage moves that could KO it first. Recover should be used often to keep Aegislash healthy, especially since powerful attacks like Mega Rayquaza's Aerilate Boomburst and Draco Meteor deal lots of damage. Use Whirlwind against Pokemon behind a Substitute or setup sweepers. Topsy-Turvy should be used against Pokemon that have already boosted. Use Baton Pass when a switch is predicted or to safely bring in another Pokemon. If using Parting Shot, scout for potential Contrary users first, as they can gain boosts from it. If a switch to a Soundproof, Magic Bounce, or Contrary user is predicted, it is better to switch normally. Entrainment can be used against Poison Heal or Contrary Pokemon to nullify their abilities and force them out. Will-O-Wisp can be safely spammed to cripple physical attackers and damage other Pokemon due to its high PP and Aegislash's immunity to it, but using it gives away Aegislash's ability.</p> <h1>Team Options</h1> <p>Yveltal and Mega Audino are good partners, as they can easily take the Ghost- and Dark-type attacks that Aegislash is weak to, like Knock Off and Spooky Plate Judgment. Physical walls like Mega Audino and Giratina, especially with Fur Coat, can handle physical Ground-type attackers like Mega Garchomp and Primal Groudon. Giratina can also take Mold Breaker Fire-type attacks. Frail wallbreakers and sweepers like Mega Gengar also synergize well with Aegislash, and they can capitalize on the slow pivots it can provide.</p> "
      },
      {
        "name": "Prankster",
        "description": "<h1>Moves</h1> <p>Prankster Parting Shot lets Aegislash switch out of and weaken threats without getting hit. It also lets Aegislash force out Magic Bounce users they can attack or use support moves. U-turn can be used instead so that Aegislash can switch after faster Pokemon to gain more momentum. When used directly after a Prankster Destiny Bond, Aegislash is almost guaranteed to take down the attacker or get a free switch, since Destiny Bond stays active until Aegislash uses U-turn. Recover increases Aegislash's longevity, and Topsy-Turvy inverts the foe's boosts to prevent sweeps, but it is blocked by Substitute. Destiny Bond lets Aegislash sacrifice itself to eliminate a threat, such as a boosted Pokemon. Encore locks opposing Pokemon into a move, catching Substitute and setup sweepers with Prankster. It also stops a Pokemon trying to stall out Destiny Bond's PP by using non-attacking moves, and it can lock Pokemon into moves that are ineffective against Aegislash, like Fighting- and Normal-type moves and -ate Fake Out. Spore puts opposing Pokemon to sleep, but it is ineffective against foes behind a Substitute, those carrying Safety Goggles, or those with Magic Bounce or Poison Heal (after Toxic Orb has activated).</p> <h1>Set Details</h1> <p>Safety Goggles is the preferred item, especially if Spore is used, as it prevents Aegislash from being affected by Spore from Imposter and Magic Bounce Pokemon and also other Pokemon, like Gale Wings Mega Rayquaza. Leftovers alternatively provides a little passive recovery. A Careful nature and maximized special bulk let Aegislash better take strong special attacks like Mega Rayquaza's Aerilate-boosted Boomburst.</p> <h1>Usage Tips</h1> <p>Parting Shot should be used against Pokemon that Aegislash can't wall if its other moves are ineffective against them. However, it is better to scout for potential Contrary users before using this move, as they can gain boosts from it. If a switch to a Soundproof, Magic Bounce, or Contrary user is predicted, it is better to switch normally. In addition, it is good to use to force out Magic Bounce Pokemon before they can attack or use support moves like Recover and Defog. U-turn should be used if a switch is predicted or to safely bring in another Pokemon. Recover should be used whenever Aegislash is low on health. Topsy-Turvy should be used against boosted Pokemon, provided they aren't behind a Substitute or have the ability Magic Bounce. Destiny Bond is a last-resort move and should only be used when the opposing Pokemon is a large threat to your team and cannot be walled. It has low PP, though, and it is important to try to predict whether or not your foe will attack or not before using it if not carrying Encore. Encore should be used if the opposing Pokemon has just used a status move or one that is ineffective against Aegislash to stop it from doing something else. It also suffers from having low PP and should be conserved if not necessary. Spore should be used against Pokemon that do not have a status condition, a Substitute, Magic Bounce, or Safety Goggles.</p> <h1>Team Options</h1> <p>Yveltal and Mega Audino are great teammates, as they can take the Dark- and Ghost-type attacks that Aegislash can't, like Knock Off and Spooky Plate Judgment. Physical walls like Giratina and Mega Slowbro, especially with Fur Coat, are useful for switching into strong Fire- and Ground-type attackers, like Primal Groudon and Mega Garchomp. Bulky attackers and walls all appreciate the Attack and Special Attack drops Parting Shot gives, while frail attackers can make use of U-turn to be brought in safely.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "nyan kat", "user_id": 256353}], "teams": [{"name": "Quality checked by", "members": [{"username": "Uselesscrab", "user_id": 167744}, {"username": "morogrim", "user_id": 276906}, {"username": "SeanBumagat", "user_id": 203960}]}, {"name": "Grammar checked by", "members": [{"username": "Haund", "user_id": 193885}, {"username": "Rare Poison", "user_id": 197616}]}]}
  },
  "Venusaur": {
    "overview": "<p>Venusaur is a unique Pokemon. While its subpar stats may cause many players pass over it without thinking twice, its Grass / Poison typing has interesting defensive properties that grant it a niche in Balanced Hackmons. The most obvious of these is an immunity to Spore, Leech Seed, and Toxic, all without the need to run an item like Safety Goggles or an ability like Sap Sipper or Magic Guard. A less blatant effect is a resistance to Fairy moves, allowing it to check many threats like Moonblast Kyogre or Pixilate Mega Diancie. However, that same typing gives it crippling weaknesses to three extremely common attacking types. The weaknesses to Flying and Ice are extremely problematic, as Venusaur cannot run an ability to make it immune to either one. Its weakness to Psychic is not as harmful, though, as Venusaur usually does not like to stay in on Pokemon that use Psychic attacks anyway.</p> ",
    "comments": "<h1>Other Options</h1> <p>While there are a massive number of moves Venusaur can run that benefit from Prankster, only some are worth consideration. Haze is an alternative to Topsy-Turvy or Heart Swap that has more PP than both, is not reflected by Magic Bounce, does not leave Venusaur less bulky if the opponent has used Shell Smash, and goes through Substitutes. However, Haze doesn't leave the opponent at a disadvantage, so it is generally not preferred. Aromatherapy and Stealth Rock can support the rest of the team but can just as easily be run on a teammate. Taunt and Encore can disrupt an opponent and provide free switches in. Infestation is an alternative to Leech Seed that can trap a foe to ease prediction with Trick while going through Magic Bounce at the cost of recovery. Venusaur can use switching moves like Parting Shot and Baton Pass effectively to gain momentum. Venusaur can also run a Toxic Orb to Trick onto the foe, although due to the prominence of Poison Heal and Steel-type Pokemon, this is largely outclassed by Black Sludge.</p> <p>Venusaur can effectively run a Flash Fire set that can counter many threatening Pokemon like Mega Diancie effectively due to its resistances. The set consists of Roost, Thousand Waves, Giga Drain, and Entrainment with a specially defensive spread to counter Poison Heal Kyogre with Ice Beam or a mixed spread of 248 HP / 84 Def / 176 SpD with a Bold nature to better check Poison Heal Arceus and Tyranitar. Running Venusaurite is also an option on this set, as it makes Venusaur immune to Trick.</p> <p>Venusaur is easily outclassed in terms of stats alone, so its best sets take advantage of its unique defensive typing in the Balanced Hackmons metagame. When designing your own Venusaur set, check to see if your set can work better on a different Pokemon.</p> <h1>Checks and Counters</h1> <p><strong>Aerilate or Refrigerate Users: No abilities exist that grant immunity to Flying or Ice moves, and Venusaur's bulk is merely average, meaning Aerilate and Refrigerate users have no problem eliminating it.</p> <p><strong>Anti-Trick Pokemon</strong>: Certain items block the use of Trick when held by certain Pokemon. These items include all Mega Stones and Primal Orbs, the Griseous Orb, Genesect's Drives, all Plates on Arceus, and Mail, which is the only item out of these that can be Knocked Off. Primal Groudon is immune to Trick and, while it fears Spore, can easily threaten Venusaur with a high-powered Fire move.</p> <p><strong>Imposter Users: Imposter Pokemon can switch into Venusaur and stall out a decent portion of its PP while not fearing any of its moves. Additionally, if Venusaur has no teammates that are immune to Trick, it runs the risk of an Imposter Pokemon giving its Black Sludge to one of Venusaur's own teammates.</p> <p><strong>Mega Rayquaza</strong>: Mega Rayquaza gets special mention due to the fact that it both 4x resists Giga Drain and has incredibly high-powered priority STAB moves that can often OHKO Venusaur. It does fear Spore while switching in, however.</p> <p><strong>Substitute</strong>: While the move is uncommon, Venusaur cannot do anything to a target behind a Substitute.</p> ",
    "sets": [
      {
        "name": "Prankster",
        "description": "<h1>Moves</h1> <p>Trick swaps items between Mega Venusaur and its foe, indefinitely crippling Pokemon such as Chansey and Shedinja. A recovery move grants Mega Venusaur longevity should Venusaur be needed late-game. Spore can quickly incapacitate an opposing Pokemon and cannot harm Venusaur if it is reflected by Magic Coat or Magic Bounce. Leech Seed can be chosen to sap the enemy's health and will KO all Shedinja that switch into Mega Venusaur, whereas Topsy-Turvy is an option to quickly stop a boosted foe before it gets out of control, and it does not require sacrificing Venusaur to do it. Heart Swap can be considered instead of Topsy-Turvy if running Baton Pass as a fourth move, but this isn't always wise, as Venusaur already has four-moveslot syndrome. Giga Drain stops Venusaur from being complete Taunt bait, but it is rather weak. Finally, Destiny Bond can bring something down when Venusaur is not needed anymore.</p> <h1>Set Details</h1> <p>Black Sludge is the preferred item instead of Choice Scarf for several reasons. Not only can Venusaur function perfectly well while still holding it, but it is also generally more harmful to most Pokemon in the Balanced Hackmons environment. As Venusaur has the option to run Metal Burst, 0 Speed IVs and a Sassy nature can be used if choosing to use that move. A specially defensive spread and a Calm nature are chosen because a lot of the Pokemon threatened by Venusaur are biased towards special attacks. Prankster gives priority to all of the listed moves bar Giga Drain, allowing Venusaur to surprise its foe before it can even move.</p> <h1>Usage Tips</h1> <p>At Team Preview, try to evaluate which opposing Pokemon are hurt the most by Black Sludge or by Spore and how you can deal with them if you mispredict. Because you only get one chance to Trick Black Sludge, mispredicting can be costly. If you do Trick it onto your intended target, be cautious about scrambling enemy items, as your opponent may try to get their Black Sludge Tricked away from them. However, Venusaur can safely hold many otherwise hazardous items, so feel free to scramble Toxic Orbs among the enemy's team. When you are finished swapping items around, Destiny Bond can easily stop out-of-control sweepers without risking a Speed tie with an Imposter user.</p> <h1>Team Options</h1> <p>Pokemon that appreciate their few checks being crippled by Spore or a hazardous item are good teammates for Venusaur. Mega Venusaur's ability to remove Plates from Judgment users like Mega Gengar tends to make Giratina a good teammate, especially as it can carry a Griseous Orb to become immune to an Imposter user's Trick. Pokemon that appreciate the free switches Venusaur causes, such as Mega Tyranitar, Tinted Lens Dialga, and the Mega Mewtwo formes, also make for good partners. Because Venusaur is weak to Ice and Flying, Pokemon that can beat Aerilate and Refrigerate users are a necessity, with Flash Fire Steel-types such as Registeel and Aegislash in particular being great teammates for Prankster Venusaur. Lastly, Pokemon that are immune to Trick (and the other moves Venusaur carries) make for good partners due to their ability to counter Imposters trying to Trick their items away. A Magic Bounce Pokemon with an un-Trickable item such as Mail is usually a good answer.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Anna says hi", "user_id": 211835}], "teams": [{"name": "Quality checked by", "members": [{"username": "Kingslayer2779", "user_id": 231877}, {"username": "SeanBumagat", "user_id": 203960}, {"username": "Pikachuun", "user_id": 171701}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}, {"username": "P Squared", "user_id": 168392}]}]}
  },
  "Chansey": {
    "overview": "<p>Chansey is the definition of the Balanced Hackmons metagame. It has a titanic HP stat, which is only second to Blissey's. This combined with Eviolite allows Chansey to have substantial special bulk and decent physical bulk. Imposter copies the opponent's stats bar HP, while Fur Coat turns Chansey into an impressive physical wall by doubling her Defense stat, making both abilities excellent choices for Chansey. Imposter Chansey restricts the metagame to the point where you must run a wall or, at the very least, a check to your own sweeper; otherwise, your team can and will be swept by it. Fur Coat Chansey is an exceptional mixed wall that can take repeated punishment from even Mega Rayquaza despite its large attacking stats, and isn't hit super-effectively by most coverage moves due to its pure Normal typing. Due to its access to Eviolite and Lucky Punch for Imposter sets, Chansey is the superior choice over Blissey outside of a few niches Blissey has. Neither Chansey set likes Knock Off and Spore, especially Fur Coat Chansey, which no longer counters Mega Diancie and Mega Rayquaza if they carry Spore, so scouting the foe's moveset is highly recommended.</p> ",
    "comments": "<h1>Other Options</h1> <p>On the Imposter set, you can run Final Gambit to deal massive damage if Chansey's HP stat is high enough. Chansey is a valuable team member, on the other hand, so Final Gambit is not the best option, but it is still an option for offensive teams that might need to take out something bulky. Additionally, an alternate option for Chansey's fourth move is Parting Shot; this allows Chansey to phaze Magic Bounce Pokemon even if they are behind a Substitute. This provides a free switch for your opponent, however, which can lead to devastating outcomes. Another switching move such as U-turn, Volt Switch, or Baton Pass can be run over this to attempt to preserve momentum in the case that Chansey does not copy the foe, and all three of those moves are typically better than Parting Shot due to no possible free switches occurring for your opponent, outside of Ground-types that come in on Volt Switch. This is especially useful with Wish to bring a teammate that needs healing in safely. Another alternate option for Imposter Chansey's fourth move is Perish Song, which allows Chansey to put the foe on a timer and effectively force a switch after three turns, if not sooner. This move also has a bit of a surprise factor to it. Imposter Chansey can run a plethora of items that can be used to bluff Eviolite or Lucky Punch and catch most Imposter-proof sweepers by surprise. Spooky Plate allows Imposter Chansey to deal with Mega Gengar and potentially counter-sweep, Choice Scarf guarantees that Chansey will outspeed the foe if they aren't carrying one themselves, Safety Goggles allows Chansey to be immune to Spore, and Toxic Orb poisons Chansey and allows it to deal with Poison Heal Pokemon more effectively. On both the Imposter and the Fur Coat sets, Spiky Shield is an alternative over King's Shield that prevents Chansey from being affected by status moves such as Taunt and Spore and deals chip damage on contact rather than causing an Attack drop. This can be useful for dealing with Sturdy Shedinja, but there are better ways to do so.</p> <p>As for the Fur Coat set, Stealth Rock is an option for the fourth move that allows Chansey to provide entry hazard support itself; however, there are better, more reliable entry hazard setters than Chansey, such as Registeel and Giratina.</p> <p>In terms of alternate sets, a Magic Bounce set can be run on Chansey that is similar in structure to the Fur Coat set, but Fur Coat is typically better due to Chansey's only decent physical bulk without it. An Unaware set can be run that is also similar to the Fur Coat set, allowing Chansey to deal with special attackers that rely on setup quite nicely; however, this set fails horribly against physical attackers, similarly to the Magic Bounce set. A more gimmicky Imprison + Transform set can be run as well, with the most common ability that this set utilizes being Prankster. It doesn't work often, as your opponent will most likely see what's coming after using Imprison, but when it works, it effectively forces a switch.</p> <h1>Checks and Counters</h1> <p><strong>Pokemon with Judgment: Imposter Chansey also has a hard time dealing with other Pokemon that use Judgment, as in most cases, they will pick the Plate that hits Chansey the hardest. One example of a Pokemon that uses Judgment is Mega Gengar. In most cases, they pick a plate that gives them great coverage, such as Spooky Plate in the aforementioned case, whereas Chansey is stuck with a Normal-type Judgment that is easier to wall. This isn't so much of a problem with Fur Coat Chansey, depending on the foe's moveset. However, Mega Gengar and other Ghost-types are a special case as Imposter Chansey cannot deal with them at all without running Spooky Plate, as most only run Judgment and a Fighting-type coverage move. As such, Mega Gengar, and other Ghost-types that utilize this strategy, are said to be Imposter-proof. Fur Coat Chansey can potentially deal with Mega Gengar by either using Metal Burst on its Fighting-type coverage move or phazing it with Whirlwind if Mega Gengar's ability is not Magic Bounce, but Fur Coat Chansey cannot deal with Mega Gengar if Mega Gengar carries Spore or has Mold Breaker, the latter of which is exceptionally common. Other Ghost-types that utilize this strategy can be dealt with via a similar method.</p> <p><strong>Poison Heal Pokemon</strong>: In general, Poison Heal Pokemon often cause Chansey a lot of grief due to their immunity to status ailments and passive healing, which they can and often will utilize with their movesets. Expect moves such as Will-O-Wisp, Spore, Dark Void, and Leech Seed to be present in an attempt to deal with Imposter Chansey.</p> <p><strong>Mega Mewtwo X</strong>: Mega Mewtwo X can Knock Off Chansey's Eviolite, which is especially dangerous for the Fur Coat set, and it can then proceed to use a move like Close Combat to do immense amounts of damage to Chansey. Fur Coat Chansey can retaliate with Metal Burst, but this leaves it crippled. In addition, many Mega Mewtwo X run Mold Breaker to be an even better means of dealing with Fur Coat Chansey.</p> <p><strong>Sturdy Shedinja</strong>: Shedinja's unique gimmick is that Sturdy is always active under most circumstances due to Shedinja's 1 HP. Of course, Chansey's HP is far greater than 1, meaning that Imposter Chansey cannot switch in on Sturdy Shedinja and expect good results. Fur Coat Chansey is threatened out by Endeavor, meaning that it isn't the ideal method to deal with Sturdy Shedinja either.</p> <p><strong>Illusion Pokemon</strong>: Imposter Chansey cannot transform into Illusion Pokemon, making them mostly Imposter-proof. Fake Out isn't always reliable, especially if the foe carries Spiky Shield or King's Shield to block it with or if the foe is a Ghost-type.</p> <p><strong>Steel-types with Magnet Pull Teammates</strong>: This is a bit more of an interesting \"check\" to Imposter Chansey, as it is composed of two Pokemon. The Steel-type will most likely have no switching moves unless the Magnet Pull Pokemon is immune to them, and it will also, noticeably, have no moves to hit the Magnet Pull Pokemon with. The result is that the Magnet Pull Pokemon traps Chansey, sets up on it, and sweeps your team. As such, extreme caution should be taken if you see a Steel-type Pokemon with moves that a Pokemon is conveniently immune to.</p> <p><strong>Pokemon with Frustration or Return</strong>: The Base Power of Frustration and Return is based on Chansey's happiness, not the copied Pokemon's happiness, when Chansey uses them. As such, if Chansey has the default amount of happiness, Frustration will most likely do around 1 damage. If you set Chansey's happiness to 0, Return and Frustration will switch places in terms of damage. Setting Chansey's happiness level to one of the two lets you deal with the one you pick, but not the other.</p> ",
    "sets": [
      {
        "name": "Imposter",
        "description": "<h1>Moves</h1> <p>Fake Out allows Chansey to break Illusion, which is the only ability that prevents it from transforming on the switch. This also can break Focus Sashes if needed, and it essentially deals free damage. The lone exceptions to this are Ghost-types such as Mega Gengar, as they are immune to Fake Out, so an Illusion Ghost-type can be hard to deal with. Recover, or any other instant recovery move you choose to run, allows Chansey to instantly and reliably regain its health should it need to do so. Wish is another option that allows Chansey to pass half of its massive HP to either itself, which gives it a less instant form of recovery, or one of its allies. In most cases, the allies will be healed by more than half of their maximum HP due to Chansey's own massive HP stat. Whirlwind allows Chansey to phaze Substitute users, which Imposter doesn't work against, as well as prevent setup sweepers from setting up if they get too greedy. If the foe has Magic Bounce, Chansey will be phazed instead, but it still can be used to potentially prevent a sweep on non-Magic Bounce Pokemon. Metal Burst utilizes Chansey's ability to take very large amounts of damage due to its high HP and redirects any damage to the foe. Essentially, if Chansey gets hit by an attack, it will deal 150% of that damage to the foe, and thanks to Chansey's large HP stat, this can often result in taking out a major chunk of the foe's HP. It is highly recommended to minimize Speed IVs, shift the 8 Speed EVs to Special Defense, and change the nature on this set to Relaxed if Metal Burst is run due to the benefit of underspeeding base 50 Speed Pokemon. King's Shield takes advantage of the fact that the foe will most likely use a physical attack against Chansey, lowering their Attack if the move makes contact. Considering Chansey's lackluster physical bulk, even with Eviolite, this can be very crucial to keeping Chansey alive if Imposter fails to trigger.</p> <h1>Set Details</h1> <p>248 EVs are invested in HP, as HP is the only stat that matters in most cases due to Imposter's mechanics, and 248 EVs are used over 252 to get an odd HP number for Curse and other forms of residual damage. Attack IVs are minimized and a Bold nature is run to minimize Foul Play and confusion damage, even though Chansey has an exceptionally low Attack stat regardless. Defense EVs are maximized because of Chansey's lackluster Defense stat when it doesn't transform into the foe. The rest of the EVs are put into Speed, as that is the only other stat that matters. Imposter allows Chansey to transform into the foe, copying attributes such as their stats, stat boosts, moves, and ability. Happiness can be changed to 0 or kept as the base 255, the former of which deals with Pokemon that rely on Frustration to deal with Imposter and the latter of which does so for Return. Because most items rely on the user's base species, not counting transformations, this opens up the option to run Eviolite or Lucky Punch on Imposter Chansey. Eviolite is run to increase the Defense and Special Defense of whatever Chansey transforms into by 50%. Lucky Punch can be run to increase Chansey's critical hit rate to 50%. This is exceptionally useful for breaking through the defensive boosts of the foe if they set up, and as such, it is better than Eviolite for dealing with most Poison Heal setup sweepers. It also can be used to deal with Pokemon that are simply not prepared for critical hits, such as -ate Pokemon.</p> <h1>Usage Tips</h1> <p>Imposter Chansey is exceptionally useful to scout the foe's movesets, especially with Eviolite, so it is safe to switch it in if you're wondering about said movesets, except for a few cases. These include known \"Imposter-proof\" Pokemon such as Mega Gengar and Hoopa-U, frail Pokemon such as Deoxys-A, and Pokemon that typically carry moves that hit themselves super effectively. With these Pokemon, you must be far more cautious when sending out Imposter Chansey, as this can easily mean free setup for them. Speaking of setup, Imposter Chansey is also quite useful if the foe has set up. Some examples are foes with Simple + Geomancy or Contrary, depending on the set for the latter. In particular, if the opponent has no counters to their current Pokemon, you can send in Imposter Chansey and attempt to counter-sweep them. This Chansey can also be used to stall; because it copies the foe, you can utilize tools such as Aromatherapy, Defog, and Magic Bounce even if you don't have them on your team. It also effectively has infinite PP if it transforms into the foe due to Imposter's mechanics of \"replenishing\" transformed PP once you switch Chansey out.</p> <h1>Team Options</h1> <p>Imposter Chansey is a massive amount of team support in itself due to it being able to scout movesets and counter-sweep, so it doesn't require too much of it to succeed. Of course, team support is always appreciated for any Pokemon, but Imposter Chansey doesn't need as much of it as others. A Pokemon that can deal with various \"Imposter-proof\" Pokemon, such as Yveltal for Mega Gengar, is highly recommended if you choose to rely on this for dealing with setup sweepers, because, as the name entails, Imposter Chansey cannot counter-sweep these in most cases. Entry hazard support from the likes of Registeel and Aegislash is always appreciated to deal chip damage and make a counter-sweep easier. Entry hazards also help against Sturdy Shedinja, which Chansey has a slightly difficult time against. Pivots, especially those with Magic Bounce, such as Registeel and Mega Audino, can also be used to prevent Chansey from taking a Knock Off and allow it to scout the foe's moveset safely.</p> "
      },
      {
        "name": "Fur Coat",
        "description": "<h1>Moves</h1> <p>Due to Chansey's high HP stat, Metal Burst can deal a lot of damage to the foe if Chansey gets hit by a strong attack, and it can potentially OHKO the foe depending on the attack. Fur Coat Chansey is better at this role than Imposter Chansey is due to its massive physical bulk by comparison, allowing it to take more hits. Recover, or any other recovery move, allows Chansey to heal itself by a sizable portion of its HP reliably. Wish allows Chansey to heal its allies while also providing itself with another, albeit less reliable, form of healing. King's Shield lowers the foe's Attack if they use a contact move on Chansey. Most physical moves fall into this category, which means that King's Shield can be used to take advantage of the foe attempting to hit Chansey with a physical attack. It can also be used to scout your foe's moveset. Whirlwind allows Chansey to phaze the foe in an emergency. This can potentially be used to prevent a sweep if the foe doesn't have Magic Bounce. Baton Pass allows Chansey to preserve momentum and somewhat scout the foe's moveset by taking a hit with its sizable bulk and switching out. Baton Pass also has a massive 64 PP, allowing you to use it throughout the match. U-turn is similar to Baton Pass, but it cannot be Taunted or bounced back via Magic Bounce. The alternative, Volt Switch, has Pokemon immune to it, whereas U-turn does not. U-turn is a contact move, however, so Chansey will take Rocky Helmet damage whenever this move is used. Both of these options provide quite a bit of team support, as they are essentially a slow, safe switch into whatever offensive threat you want to send in.</p> <h1>Set Details</h1> <p>Chansey's HP EVs aren't maximized; this ensures that Eviolite provides as much of a benefit as possible. Attack IVs are minimized for Foul Play damage to be as low as possible. Defense EVs are maximized to increase the benefits given by both Fur Coat and Eviolite. A Relaxed nature also contributes to Chansey's massive physical bulk by boosting it by another 10%. This gives Chansey an effective Defense stat of a fully invested and positive-natured base 130 Defense Pokemon! The rest is put into Special Defense, as that is the only other stat that matters, outside of Speed, which is minimized as much as possible to preserve momentum by providing a slow, safer switch for frailer sweepers, as well as maximizing Metal Burst's effectiveness due to its dependence on the user's Speed stat. Fur Coat is run to double Chansey's Defense, allowing it to be effective as a physical wall, and Eviolite is run to increase Chansey's Defense and Special Defense by 50% on top of what Fur Coat provides for Defense, maximizing Chansey's bulk.</p> <h1>Usage Tips</h1> <p>Fur Coat Chansey is a counter to all -ate Pokemon, except if they have Spore, which is quite dangerous due to Chansey being unable to run Safety Goggles without being outclassed by other Fur Coat Pokemon such as Mega Audino or Giratina. It is highly recommended to scout your foe's moveset beforehand to make sure they don't have this move. Fur Coat Chansey values its Eviolite immensely, so it requires careful planning before you switch it in; essentially, you need to make sure that the foe doesn't have Knock Off as well before blindly switching Chansey in. For reference, this set gets 2HKOed by Mega Rayquaza and Mega Diancie on the switch by Boomburst without its Eviolite. This is a mixed wall that can switch in on most attacks that don't hit it super effectively. If you need something to take a hit and phaze the foe or simply provide a safer switch into a sweeper such as Deoxys-A, you should probably switch Chansey in. Metal Burst requires a slight amount of prediction to pull off successfully, as Chansey can easily be left in the dust if the foe uses a status move. Keep this in mind before you click it thinking it's essentially free damage. Of course, Fur Coat Chansey should not be your catch-all to setup sweepers, as if they set up enough, Chansey can very easily be KOed even with its massive bulk. In most cases, however, Chansey can take a hit and phaze the foe with Whirlwind, or at the very least it can provide a safer switch into something that can threaten the foe.</p> <h1>Team Options</h1> <p>Fur Coat Chansey provides quite a bit of team support in itself, but it still needs quite a bit of it. Entry hazard support from the likes of Aegislash and Registeel is appreciated to discourage Sturdy Shedinja from switching in, which threatens Chansey out with Endeavor. A Pokemon with Heal Bell or Aromatherapy, such as Mega Audino, is also nice to have, as the residual damage caused by these ailments can add up and hinder Fur Coat Chansey's ability to wall what it needs to. Another more interesting partner is Imposter Chansey, as it can be used to scout the foe's moveset for Spore or Knock Off, which Fur Coat Chansey doesn't like seeing. Poison Heal Pokemon such as Kyogre or Mega Audino, with their Toxic Orb activated, can be used to easily sponge Spores and Knock Offs that are thrown at Chansey.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Pikachuun", "user_id": 171701}], "teams": [{"name": "Quality checked by", "members": [{"username": "Uselesscrab", "user_id": 167744}, {"username": "Piccolo Daimao", "user_id": 219853}, {"username": "E4 Flint", "user_id": 203690}]}, {"name": "Grammar checked by", "members": [{"username": "GatoDelFuego", "user_id": 91628}, {"username": "Empress", "user_id": 175616}]}]}
  },
  "Gyarados": {
    "overview": "<p>Thanks to its high Attack stat and great offensive typing, Mega Gyarados is a very dangerous offensive threat in Balanced Hackmons. Very few Pokemon can safely switch into its STAB Knock Off, and those that can are crippled by the loss of their item. Mega Gyarados also has good special bulk and a beneficial defensive typing, which allows it to take hits from a lot of dangerous offensive threats and proceed to smack them back with its high-powered STAB moves. However, it is held back significantly by its poor Speed and low physical bulk, meaning it can easily be taken down by many common physical attackers.</p> ",
    "comments": "<h1>Other Options</h1> <p>An offensive Prankster set with Spore and Knock Off can surprise a lot of common checks to Mega Gyarados and is very effective at spreading sleep around opposing teams. This sort of set is generally performed more effectively by Mega Mewtwo X, however. The Mold Breaker set can be tailored to your team's needs, and there are a lot of other viable options that it can run. Taunt can be used to shut down defensive Pokemon, but running Taunt makes Imposter users more difficult to deal with. Whirlwind or Gastro Acid can be used to allow Mega Gyarados to more effectively check Poison Heal Kyogre, and Recover can be used to keep Mega Gyarados healthy, although it usually doesn't get many opportunities to use it. A boosting move such as Shift Gear can be run on the Mold Breaker set to good effect, but this is very weak to Imposter users and generally outclassed by the Poison Heal set. A set starting as regular Gyarados that takes advantage of an ability such as Illusion or Simple to set up boosts before Mega Evolving to sweep with the aid of Mega Gyarados's Mold Breaker is a gimmicky but usable option.</p> <h1>Checks and Counters</h1> <p><strong>Pixilate Mega Diancie: Mega Diancie with Pixilate has an easy time revenge killing Mega Gyarados thanks to its Fairy-type Extreme Speed.</p> <p><strong>Strong Physical Attackers</strong>: Mega Gyarados has subpar physical bulk, so Pokemon such as Mega Mewtwo X and Primal Groudon can deal huge amounts of damage to it with their powerful physical attacks.</p> <p><strong>Bulky Poison Heal Users: Bulky Pokemon with Poison Heal can usually tank Mega Gyarados's attacks fairly comfortably, can't be Spored, and don't mind losing their item to Knock Off (provided that they have already activated their Toxic Orb). Mega Audino, Yveltal, and physically defensive Kyogre are examples of Pokemon that can perform this role effectively.</p> ",
    "sets": [
      {
        "name": "Mold Breaker",
        "description": "<h1>Moves</h1> <p>The biggest reason to use this set is Pursuit, which in conjunction with Mold Breaker is one of the only reliable means of KOing Sturdy Shedinja. It also does a ton of damage to Pokemon such as Giratina, Aegislash, and Mega Slowbro, which will often switch out of Mega Gyarados fearing Knock Off. Speaking of, Knock Off is a powerful STAB move with excellent coverage, and it cripples Mega Gyarados's switch-ins by removing their items. In particular, Chansey hates taking a Knock Off, as it will lose its Eviolite, severely reducing its bulk. Crabhammer smacks Mega Diancie and is Mega Gyarados's most powerful option against neutral targets once their item has been removed. Sucker Punch is a very powerful priority move that is quite helpful against the likes of Mega Gengar, Mega Mewtwo Y, Mega Latios, and Mega Latias. Spore is a great option that allows Mega Gyarados to cripple a lot of its common switch-ins by putting them to sleep, and thanks to Mold Breaker it ignores Magic Bounce. It has good synergy with Knock Off, which removes foes' Safety Goggles. Mega Gyarados can also run Stealth Rock quite effectively, as Mold Breaker allows it to bypass Magic Bounce. King's Shield is an option to help patch up Mega Gyarados's mediocre physical bulk and give it a better matchup against dangerous physical attackers such as Mega Mewtwo X and Mega Rayquaza that otherwise would check it easily.</p> <h1>Set Details</h1> <p>This spread guarantees that Mega Gyarados survives Timid Protean Mega Mewtwo Y's Moonblast 100% of the time while still being able to deal a lot of damage. Rocky Helmet will KO a Shedinja that uses Endeavor against Gyarados and gets chip damage against Pokemon that use contact moves. Alternatively, Focus Sash can be used to make Mega Gyarados a solid check to a lot of offensive threats provided that it is at full health, including Pixilate Mega Diancie, Aerilate Mega Rayquaza, and Psychic-type Contrary users such as Mega Latios. Safety Goggles is a good choice if you are running Spore, as it allows you to put an Imposter user to sleep while it cannot do the same to Mega Gyarados. However, the Imposter user will be able to use Spore on Mega Gyarados if the Safety Goggles gets removed by Knock Off.</p> <h1>Usage Tips</h1> <p>Mega Gyarados's main role is to take out Shedinja, so if the opponent has one, try to preserve Mega Gyarados until Shedinja has been KOed. In addition, do not switch Mega Gyarados directly into Shedinja, as Shedinja will either KO it with Endeavor + priority or get momentum by pivoting out. Try to either get Mega Gyarados in with a pivoting move or switch it in on a predicted switch to Shedinja. Once the foe's item has been removed with Knock Off, Crabhammer is far more powerful than Knock Off against a neutral target. If you are running Focus Sash, try to avoid letting Mega Gyarados take damage in order to keep the Focus Sash intact. Try to keep entry hazards off your side of the field, and be wary of stray U-turns from defensive Pokemon.</p> <h1>Team Options</h1> <p>Good partners for this set are Pokemon that appreciate Shedinja being removed, such as -ate ability users. Mega Gyarados has difficulty switching in, so Pokemon with pivoting moves that can bring it in safely make for good teammates, such as U-turn Registeel or Baton Pass Shedinja. Mega Gyarados is quite prone to being revenge killed by -ate ability users, so Pokemon that can take those on make for good partners. Examples include Registeel and Imposter Chansey. It's important to have a Pokemon that can take on an Imposter user that is copying Mega Gyarados. Exactly what you use for this is largely dependent on what moves Mega Gyarados is running, but in general a bulky Poison Heal Pokemon will work well. Yveltal and Mega Audino are good choices. If you do choose to use a Poison Heal Pokemon for this role, make sure to activate its Toxic Orb before sending it in, or else the Imposter user may remove it with Knock Off and render the Poison Heal Pokemon useless.</p> "
      },
      {
        "name": "Poison Heal",
        "description": "<h1>Moves</h1> <p>Shift Gear allows Mega Gyarados to boost its Attack and Speed to ludicrous levels in a single turn. At +2 Speed, Mega Gyarados outspeeds almost every unboosted Pokemon in the metagame. Coil is a more niche option in place of Shift Gear. Coil gives Mega Gyarados an easier time against Imposter Pokemon and makes it more difficult for Aerilate Mega Rayquaza to revenge kill it, but it is prone to being outsped and KOed by a lot of common offensive threats such as Mega Mewtwo Y. If you opt for Coil, a bulkier spread such as 248 HP / 252 SpD / 8 Spe with a Careful nature is recommended to better take advantage of the Defense boosts Coil offers. Knock Off is generally the go-to STAB move on the set, hitting the vast majority of the metagame for at least neutral damage and removing pesky items such as Chansey's Eviolite. Crabhammer hits the Pokemon that aren't KOed by Knock Off, such as Xerneas and Mega Audino. Sacred Fire is a powerful option against Steel-types, and it also enables Mega Gyarados to cripple an Imposter user by burning it, while it can't burn Mega Gyarados in return. Will-O-Wisp is an alternative to Sacred Fire that allows Mega Gyarados to more reliably beat Imposter users and Shedinja, as Sacred Fire's 50% burn chance might not always be enough.</p> <h1>Set Details</h1> <p>44 Speed EVs are the minimum required for Mega Gyarados to outspeed Timid Mega Mewtwo Y after a Shift Gear. Maximum Attack investment and an Adamant nature are used for maximum damage output, and the rest of the EVs are put in bulk to allow Mega Gyarados to take hits better, giving it an easier time setting up.</p> <h1>Usage Tips</h1> <p>Be careful when you have yet to activate Mega Gyarados's Toxic Orb, as an unexpected Knock Off or status move will leave it with no recovery. Try to get Mega Gyarados in with a slow pivoting move to safely activate its Toxic Orb. Aditionally, try not to boost too much or let Mega Gyarados get too weakened if the opponent's Imposter user is still healthy, as they might be able to break past Mega Gyarados if they get lucky with Speed ties and Sacred Fire's burn chance. People might try to use King's Shield to lower Mega Gyarados's attack stat; if you predict King's Shield, take advantage of it with Shift Gear. If the opponent sends out a Shedinja, go for Knock Off before trying to burn it. Many Shedinja run Lum Berry with Recycle, which will allow them to stall out your Sacred Fire's or Will-o-Wisp's PP. If you Knock Off the Lum Berry, they will not be able to Recycle it.</p> <h1>Team Options</h1> <p>This set is hard checked by Pixilate Mega Diancie, so Pokemon that can deal with it make for good partners. Bulky Steel-types are good options. Mega Gyarados has a far easier time sweeping if the opponent's Imposter user is weakened, so Pokemon that are able to draw in Imposter Pokemon and wear them down help Mega Gyarados a lot. Users of the -ate abilities are a good example. Pokemon with pivot moves such as U-turn and Volt Switch can allow Mega Gyarados to safely activate its Toxic Orb and are thus greatly appreciated. It is good to have a Pokemon in reserve to deal with Imposter users, just in case they do manage to get past Mega Gyarados. Pixilate Mega Diancie with Fake Out and Extreme Speed or a Prankster Pokemon with Topsy-Turvy is a good choice for this role.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "MAMP", "user_id": 225453}], "teams": [{"name": "Quality checked by", "members": [{"username": "Piccolo Daimao", "user_id": 219853}, {"username": "Uselesscrab", "user_id": 167744}]}, {"name": "Grammar checked by", "members": [{"username": "P Squared", "user_id": 168392}, {"username": "Lumari", "user_id": 232216}]}]}
  },
  "Mewtwo": {
    "overview": "<h1>Mega Mewtwo X</h1> <p>With a recognizably high Attack stat, Mega Mewtwo X is one of the leading physical attackers in Balanced Hackmons. With vast and unpredictable coverage, it is able deal large amounts of damage to most of the metagame with relative ease. However, such power comes at a cost, as it can be difficult to deal with opposing Imposter users, which can transform into Mega Mewtwo X. It can also be rendered extremely ineffective against certain walls such as common Fur Coat users like Giratina.</p> <h1>Mega Mewtwo Y</h1> <p>With the highest Special Attack in the game, incredible Speed that allows it to outspeed almost all offensive threats in the metagame, and access to a plethora of power-bolstering abilities, Mega Mewtwo Y is one of the biggest threats in the Balanced Hackmons metagame. With various options including No Guard, Mega Mewtwo Y is very unpredictable and extremely versatile. Mega Mewtwo Y also has decent bulk, and although it is very lacking physically, it can survive some powerful special attacks. Despite being the pinnacle of special attackers, though, Mega Mewtwo Y cannot switch in easily, forcing teams to run defensive support to provide it with safe opportunities to switch in.</p> ",
    "comments": "<h1>Other Options</h1> <section><h1>Mega Mewtwo X</h1> <p>A Refrigerate set can be used to surprise and defeat Pokemon that are weak to Ice such, as Mega Rayquaza, frail offensive Pokemon, such as Mega Gengar, and non-Fur Coat Giratina. Mold Breaker can be also be used in conjunction with Pursuit to defeat Sturdy Shedinja; Fighting-type STAB moves and an unrivaled Attack stat give Mega Mewtwo X a niche over other Mold Breaker users. U-turn could also be used as a powerful option for pivoting.</p> <h1>Mega Mewtwo Y</h1> <p>A different set with Fist Plate, Judgment, and coverage moves of types that are weak to Fighting, such as Boomburst, Power Gem, Ice Beam, and Doom Desire. No Guard with Lum Berry can be used with Sing, Zap Cannon, Inferno, and another low-accuracy move. Dynamic Punch can be used with a Naive nature to allow Mega Mewtwo Y to spread status ailments quickly and disturb the opposing team's momentum. Tinted Lens-boosted Future Sight is incredibly powerful, but Mega Mewtwo Y functions more like a hit-and-run Pokemon and wants immediate power. A Contrary set with attacks such as Psycho Boost, Overheat, Leaf Storm, and Draco Meteor can be used, but it faces competition from physically attacking Contrary users and is very weak to Chansey and Shedinja. However, it can 2HKO the entire metagame easily after a single boost. The combination of Simple and boosting moves such as Shell Smash and Quiver Dance can be used but is very weak to Chansey, and other Pokemon can fill this role better due to Mega Mewtwo Y's poor typing. Random support moves such as Spore can be used to catch the opponent off guard, but Mega Mewtwo Y doesn't have the room for them. Judgment can be used with specific Plates in place of a coverage move, such as Pixie Plate with Judgment instead of Moonblast. Mega Mewtwo Y with an -ate ability hits extremely hard and has coverage for foes that resist Ice-, Flying-, or Fairy-type moves, though it cannot change types and thus is stuck with its mediocre Psychic typing. Steam Eruption can be used to cripple and wear down switch-ins with a possible burn and is capable of hitting Rock-types if Mega Mewtwo Y lacks the coverage to hit them. Seed Flare is a useful option for breaking through Water-, Rock-, and Ground-types and, coupled with its dangerous secondary effect, allows Mega Mewtwo Y to easily break through opposing walls.</p> </section><h1>Checks and Counters</h1> <p><strong>Due to the nature of this Pokemon and the dependance of forms, they have differing checks and counters.</strong></p> <section><h1>Mega Mewtwo X</h1> <p><strong>Giratina: Giratina serves as Mega Mewtwo X's greatest check, particularly Fur Coat sets; without Draco Meteor, there is nothing that Mega Mewtwo X can do due to the lack of super effective physical coverage moves available.</p> <p><strong>Imposter</strong>: The titanic bulk of Imposter users such as Chansey almost always means that they will defeat Mega Mewtwo X, even if the latter wins the Speed tie. Additionally, if Mega Mewtwo X is unable to check its own Mega Mewtwo X set or if your team's check has fainted, then transformed Imposter users will be free to sweep.</p> <p><strong>Shedinja</strong>: Mega Mewtwo X can't afford to run moves that defeat Shedinja without hindering its own coverage against the rest of the metagame.</p> <p><strong>Fur Coat</strong>: If the Pokemon running Fur Coat isn't weak to any of Mega Mewtwo X's moves, it will likely be able to check Mega Mewtwo X. Notable examples include Giratina and Mega Audino.</p> <h1>Mega Mewtwo Y</h1> <p><strong>Priority Attackers: Mega Mewtwo Y relies on its high Speed to overpower its foes, so priority is one of the best ways to take it down. -ate ability users such as Mega Diancie and Mega Rayquaza can easily KO it or force it out with their strong attacks boosted by their -ate abilities. Gale Wings sweepers can also deal significant amounts of damage to Mega Mewtwo Y. Prankster users are also great checks to Mega Mewtwo Y. Topsy-Turvy users check boosting sets by reversing the stat boosts, and Prankster Spore is a reliable way to shut Mega Mewtwo Y down temporarily, as it rarely runs items such as Safety Goggles and Lum Berry in favor of more offensive items. Once Mega Mewtwo Y is crippled, it is far easier to take down with a teammate. Sucker Punch users such as Mega Tyranitar, Yveltal, and Mega Gyarados, can also KO Mega Mewtwo Y provided that it has taken enough prior damage.</p> <p><strong>Imposter Chansey: Imposter Chansey can check Mega Mewtwo Y with a little bit of Speed tie luck. Chansey beats the non-Judgment set easily, forcing it out and gaining massive amounts of momentum. However, it loses to the Judgment set unless it can get lucky with Speed ties.</p> <p><strong>Fast Attackers</strong>: Powerful Pokemon that can outspeed Mega Mewtwo Y can check it so long as they switch in safely. Deoxys-A and Mega Aerodactyl can outspeed and KO Mega Mewtwo Y, and with the right coverage moves, they can maneuver past King's Shield as well. Unfortunately, these Pokemon have limited viability otherwise.</p> <p><strong>Extremely Bulky Pokemon: It requires a lot of natural bulk for a Pokemon to be able to tank multiple hits from Mega Mewtwo Y, but some Pokemon can do it. Fur Coat Chansey is an excellent example, as it shrugs off the attacks from both of Mega Mewtwo Y's sets fairly easily depending on the coverage and can gradually wear Mega Mewtwo Y down or even KO it with Metal Burst. Poison Heal Mega Audino is also an excellent check, as it can easily shrug off hits phaze it should it try to set up. Poison Heal Yveltal is a reliable check to the Judgment set as well, as it can sponge Judgment and Secret Sword continuously and hit Mega Mewtwo Y hard with its STAB attacks. Ho-Oh resists Moonblast, is immune to Earth Power, and has very high special bulk, meaning that it is capable of switching into Mega Mewtwo Y.</p> <p><strong>Knock Off Users: Besides dealing super effective damage, Knock Off can cripple the Judgment set by removing the Spooky Plate that makes Mega Mewtwo Y's Judgment Ghost-type. Without its Spooky Plate, Mega Mewtwo Y struggles to even scratch most Ghost-types, and Pokemon such as Giratina, Mega Gengar, Aegislash, and even Imposter Chansey can check it far more easily. However, due to Mega Mewtwo Y's immense offensive presence, it is not always easy to successfully hit it with Knock Off without risking losing a Pokemon.</p> <p><strong>Shedinja: Shedinja is a good check to the Judgment set if it lacks Infestation or Magma Storm and can check the non-Judgment set as well. It is important to scout Mega Mewtwo Y's set, however, before trying to confront it with Shedinja.</p> </section>",
    "sets": [
      {
        "name": "Protean (Mega Mewtwo X)",
        "description": "<h1>Moves</h1> <p>Precipice Blades defeats many common Pokemon that are weak to Ground, such as Mega Gengar, Mega Diancie, and a plethora of defensive Steel-types, such as Registeel and Aegislash. Thousand Arrows can also be used as a more accurate option; however, the damage output from Precipice Blades is generally preferable. Bolt Strike is another powerful move that complements Ground-type coverage, allowing Mega Mewtwo X to take out Pokemon such as Mega Slowbro and the occasional Flying-types such as Mega Rayquaza, Ho-Oh, and Yveltal. Fusion Bolt is a more accurate alternative; however, similarly to Precipice Blades, the damage output from Bolt Strike is usually superior. V-create is useful for demolishing Pokemon that don't resist Fire-type attacks; however, it must be used sparingly, as the stat drops can easily be taken advantage of by the foe. Extreme Speed functions as a useful priority attack that works best for picking off weakened threats and also overcoming -ate Pokemon while not having to rely on King's Shield to lower their Attack stat. Sucker Punch also acts as a useful priority move for defeating offensive Pokemon that Mega Mewtwo X may struggle to beat, such as Mega Gengar and Protean Mega Mewtwo Y. Draco Meteor hits Dragon-types such as Mega Rayquaza and Giratina hard, especially when boosted by a Life Orb. King's Shield is essential, allowing Mega Mewtwo X to take on super effective priority moves from Pokemon with Aerilate, Pixilate, and Gale Wings; even if the foe doesn't suffer an Attack drop, the Steel typing from Protean allows Mega Mewtwo X to survive priority moves that it otherwise wouldn't.</p> <h1>Set Details</h1> <p>The given EV spread maximizes Mega Mewtwo X's offensive presence. A Speed-boosting nature is necessary to outspeed everything that it can. Not only does Protean render an Attack-boosting nature unnecessary, but the occasional Mega Rayquaza, Mega Diancie, and Mega Gengar running Speed-boosting natures can severely put a dent in Mega Mewtwo X without it. As such, a Jolly nature is the most practical choice. If Draco Meteor is being used, a Naive nature should be used, as it gives Mega Mewtwo X a little insulation from physical priority moves and does not lower its Special Attack. The 4 HP EVs should also be moved into Special Attack when using Draco Meteor. Safety Goggles is the safest item choice, allowing Mega Mewtwo X to block Spore from common Prankster users such as Aegislash; it is also especially useful with King's Shield unable to block status ailments. If more power is preferred, Life Orb is the best option to boost the power of all moves.</p> <h1>Usage Tips</h1> <p>When facing off against priority users, do not be afraid to use King's Shield. It is almost always the safest option unless it is highly likely the foe will do something that will be problematic, such as use a boosting move or switch to teammate that can defeat Mega Mewtwo X.</p> <h1>Team Options</h1> <p>The most important thing to have on your team is a check to your own Mega Mewtwo X in case an Imposter user transforms into it. This check may vary depending on the moves that are chosen; however, bulky Fur Coat users such as Giratina that do not have a weakness to one of Mega Mewtwo X's moves are generally the best option. A check for Giratina is useful if Mega Mewtwo X does not run Draco Meteor, as it will be hard-walled by Giratina otherwise; examples of Giratina checks include Mega Diancie and Mega Gengar. Sturdy Shedinja hard-walls Mega Mewtwo X, as it cannot afford to run moves that deal passive damage such as Infestation without severely limiting its coverage. As such, Pokemon that can eliminate Shedinja, such as Stealth Rock setters and Mold Breaker + Pursuit users, are recommended, such as Clefable and Mega Aggron, etc. Burns and paralysis will completely cripple Mega Mewtwo X, so a cleric such as Umbreon makes for a good teammate.</p> "
      },
      {
        "name": "Judgment (Mega Mewtwo Y)",
        "description": "<h1>Moves</h1> <h1>Judgment is Mega Mewtwo Y's main attacking move and, coupled with Spooky Plate, becomes a 120 Base Power Ghost-type move that hits incredibly hard after gaining a STAB boost from Protean. Judgment is also very useful for Imposter Chansey; Chansey's Judgment will remain Normal-type, so it cannot touch Ghost-type Mega Mewtwo Y. Secret Sword provides very solid coverage alongside Ghost-type Judgment and allows Mega Mewtwo Y to hit Normal- and Dark-types that resist its Judgment. Secret Sword also prevents Imposter Chansey from attacking Ghost-type Mega Mewtwo Y. Quiver Dance allows Mega Mewtwo Y to boost its Special Attack, Special Defense, and Speed to incredible levels with the goal of sweeping. Boomburst is extremely powerful and allows Mega Mewtwo Y to hit the likes of Mega Audino and Yveltal, both of which are neutral to the combination of Ghost-type Judgment and Secret Sword. Infestation can also be used as a way to beat Shedinja while still being able to beat Imposter users. King's Shield is necessary, as it allows Mega Mewtwo Y to handle -ate ability users. It can potentially weaken contact attackers and also changes Mewtwo Y into a Steel-type, which provides it with an opportunity to safely attack. Set Details</h1> <p>Protean is what makes Mega Mewtwo Y so threatening, granting it STAB on all of its attacks and thus bolstering its damage output to ridiculous levels; it also increases Mega Mewtwo Y's longevity, as it can switch types to resist incoming attacks. Spooky Plate is needed to make Judgment Ghost-type, which provides Mega Mewtwo Y with a reliable STAB move and prevents Imposter Chansey from checking this set. Maximum Speed and Special Attack investment is essential, as Mega Mewtwo Y needs to be as fast as possible and needs its damage output maximized.</p> <h1>Usage Tips</h1> <p>Although Mega Mewtwo Y has decent Special Defense, it still struggles to switch into even resisted attacks. When Mega Mewtwo Y is sent in, it is usually safe to use Judgment against most Pokemon outside of Normal- and Dark-types, against which Mega Mewtwo Y should use Secret Sword. King's Shield should be used to scout for powerful contact and priority moves. It can provide Mega Mewtwo Y with nifty resistances that usually let it use the appropriate attacking move against the foe without taking too much damage in return. King's Shield should not be overused, though, as it can provide free turns for the foe to set up or use crippling status moves. When using Mega Mewtwo Y, scout the opponent's team for their support Pokemon in order to prevent Mega Mewtwo Y from being crippled by Prankster Spore, as it becomes easy to take down once it is put to sleep. When facing Imposter Chansey, keep Mega Mewtwo Y as a Ghost-type so that Chansey cannot touch it. Only use Quiver Dance once the opportunity arises so that you do not have to worry about the Speed tie, switch Mewtwo back to Ghost-type whenever you expect the foe to attack, and slowly whittle Chansey down with Secret Sword.</p> <h1>Team Options</h1> <p>This set lacks the need for offensive support because it is very independent and capable of functioning by itself; however, it requires defensive support. Bulky pivots such as Registeel, Giratina, and Mega Audino can bring in Mega Mewtwo Y safely with U-turn, Volt Switch, and Baton Pass. They can also provide healing if Mega Mewtwo Y is weakened too much and can set up entry hazards to check Shedinja, which walls Mega Mewtwo Y lacking Infestation or Magma Storm. Your own answer to Protean Mega Mewtwo Y is absolutely essential, as this set can still lose to Imposter Chansey through bad luck or poor predictions. An example is Fur Coat Chansey, which can repeatedly come in on Mega Mewtwo Y, heal off the damage, and threaten to cripple it. Prankster coupled with Spore is capable of shutting down Mega Mewtwo Y, and specially defensive Pokemon such as Poison Heal Kyogre, Ho-Oh, and Yveltal are capable of switching in and weakening it. Because this set functions best as a late-game cleaner, wallbreakers such as Tail Glow Dialga make for decent teammates for their ability to crush opposing walls. As Judgment loses functionality without Spooky Plate, a Knock Off absorber such as Mega Audino is needed. Mold Breaker users such as Mega Gengar can remove Shedinja for Mega Mewtwo Y should it lack infestation. Strong physical attackers such as Arceus and Mega Rayquaza can wear down the likes of Mega Audino and Fur Coat Chansey for Mega Mewtwo Y.</p> "
      },
      {
        "name": "All-Out Attacker (Mega Mewtwo Y)",
        "description": "<h1>Moves</h1> <p>Boomburst is Mega Mewtwo Y's main attacking move, as it is the strongest perfectly accurate special attack in the game and is boosted even further by Protean and potentially Life Orb. Moonblast is used as Fairy-type coverage, allowing Mega Mewtwo Y to hit Mega Mewtwo X and many common Dark- and Dragon-types in the metagame super effectively, as well as changing its typing to weaken incoming Dark-type moves and gain an immunity to Dragon-type moves. Earth Power hits Steel- and Poison-types that can otherwise switch in easily, and it is capable of hitting Rock-types such as Mega Diancie as well. Magma Storm can also be used, providing Mega Mewtwo Y with more powerful coverage to hit Steel-types and a means to beat Shedinja. King's Shield is necessary to improve Mega Mewtwo Y's matchup against priority users and give it safer opportunities to attack, as it temporarily becomes a Steel-type upon using the move.</p> <h1>Set Details</h1> <p>Protean is what makes Mega Mewtwo Y so threatening; it provides it with a STAB boost to all of its attacking moves, significantly boosting its damage output, and allows it to change types to reduce damage from faster attacks, increasing Mega Mewtwo Y's longevity. Safety Goggles allows Mega Mewtwo Y to avoid Spore from Prankster users trying to shut it down. Life Orb can be used instead to bolster its attacks even further, making it incredibly difficult to wall coupled with its coverage. Maximum Speed and Special Attack investment is essential in order to Speed tie with opposing Mega Mewtwo Y and outspeed everything slower. Special Attack is maximized for maximum damage output.</p> <h1>Usage Tips</h1> <p>Unlike sets running Judgment, this set isn't capable of beating Imposter Chansey one-on-one; instead, it fills a hit-and-run role, dealing huge damage with its coverage moves to opposing Pokemon that its teammates have trouble breaking through. If the opponent has a Chansey, avoid keeping Mega Mewtwo Y on the field for too long, as it can severely punish your team by using Mega Mewtwo Y against it. Mega Mewtwo Y lacks the bulk to switch in repeatedly, so avoid switching it in too often and especially avoid powerful attacks. Once Mega Mewtwo Y is safely on the field, Boomburst should be used, as it is Mega Mewtwo Y's most effective attack, though other moves can be used depending on the opposing Pokemon. Mega Mewtwo Y is capable of 2HKOing the entire metagame outside of dedicated walls, so it isn't heavily reliant on prediction. King's Shield should be used against predicted contact attacks and to scout priority attacks. It can lower the foe's Attack stat and temporarily changes Mega Mewtwo Y to a Steel-type to resist the incoming priority attack the following turn. Avoid using King's Shield too much, as it can provide the foe with free turns to either set up or hit Mega Mewtwo Y with a status move. Scout the opponent's team for support Pokemon and avoid Pokemon with Prankster Spore if Mega Mewtwo Y lacks Safety Goggles.</p> <h1>Team Options</h1> <p>This set is designed to offer team-dependent offensive coverage to other sweepers, so there is no particular offensive teammate that pairs exceptionally well with it. Bulky Pokemon such as Registeel, Giratina, and Mega Audino can use pivoting moves to provide Mega Mewtwo Y with safe switches in. They can also heal it with Wish and Heal Bell and provide entry hazard support to cover the likes of Shedinja, which is capable of walling this set should it lack Magma Storm. An answer to opposing Protean Mega Mewtwo Y is necessary, as Imposter Chansey can punish teams unprepared for it. Prankster Spore users and Pokemon such as Poison Heal Kyogre, Ho-Oh, and Yveltal can all handle Chansey that have transformed depending on Mega Mewtwo Y's coverage. Strong physical attackers such as Mega Diancie and Arceus can help wear down the likes of Mega Audino and Fur Coat Chansey, which can get in Mega Mewtwo Y's way. Mold Breaker teammates with Pursuit are appreciated if Mega Mewtwo Y lacks Magma Storm for Shedinja.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "rs", "user_id": 240461}, {"username": "Heisenerg", "user_id": 223631}, {"username": "Electrolyte", "user_id": 148071}], "teams": [{"name": "Quality checked by", "members": [{"username": "Kingslayer2779", "user_id": 231877}, {"username": "nyan kat", "user_id": 256353}, {"username": "Uselesscrab", "user_id": 167744}, {"username": "Piccolo Daimao", "user_id": 219853}, {"username": "E4 Flint", "user_id": 203690}]}, {"name": "Grammar checked by", "members": [{"username": "P Squared", "user_id": 168392}, {"username": "Empress", "user_id": 175616}, {"username": "Winry", "user_id": 216033}]}]}
  },
  "Tyranitar": {
    "overview": "<p>Mega Tyranitar, despite the existence of seemingly more notable offensive threats such as Mega Mewtwo X and Mega Rayquaza, has its own unique set of attributes that make it a good Pokemon in the Balanced Hackmons metagame. For instance, its nice Rock / Dark typing allows it to deal with Aerilate Mega Rayquaza that do not carry Close Combat. It also has good mixed bulk and a very good Attack stat, the latter of which is backed up by STAB Knock Off and Diamond Storm. However, Mega Tyranitar is held back by its low Speed and weaknesses to many common offensive types, such as Fairy, Ground, and Fighting. When played properly, Mega Tyranitar can be used to wreak havoc either defensively or offensively.</p> ",
    "comments": "<h1>Other Options</h1> <p>A RegenVest set can be run if a pivot role is desired, giving Mega Tyranitar nice bulk and allowing it to deal with Mega Rayquaza even better. Keep in mind that Mega Tyranitar cannot use moves such as Will-O-Wisp and King's Shield and should carry Volt Switch or U-turn to better its pivoting role. A Sand Stream set can be run to improve Mega Tyranitar's Special Defense and better handle non-Safety Goggles Sturdy Shedinja. The defensive Poison Heal set is typically better due to its immunity to status, which can be crucial; however, this set has a niche of allowing Sand Rush users to potentially sweep, such as Mega Latios. Pursuit and Sucker Punch can be used to trap the foe and simply to have a priority move, respectively. Notably, Mold Breaker can be used alongside Pursuit to trap and KO Sturdy Shedinja.</p> <h1>Checks and Counters</h1> <p><strong>Bulky Fairy- and Ground-types: Bulky Fairy- and Ground-types, such as Xerneas, Mega Swampert, and Groudon, resist at least one of Mega Tyranitar's STAB moves and can hit it hard in return with theirs.</p> <p><strong>Mega Mewtwo X: Mega Mewtwo X as well as other, rarer Fighting-types can give Mega Tyranitar a few issues thanks to its 4x weakness to their STAB attacks. However, they do not enjoy switching in on Will-O-Wisp or Sacred Fire due to most of them being physically oriented.</p> <p><strong>Mega Diancie</strong>: While Mega Diancie does not appreciate taking a Diamond Storm from either set, its extremely powerful Pixilate-boosted attacks can very easily get rid of Mega Tyranitar, regardless of the set.</p> <p><strong>Contrary Users</strong>: Most Pokemon with Contrary will either run Leaf Storm or Superpower, both of which Mega Tyranitar is quite weak to. These Pokemon do not typically appreciate taking Mega Tyranitar's attacks on the switch, however, and most of them can also be copied by Imposter Chansey to revenge kill or potentially countersweep.</p> ",
    "sets": [
      {
        "name": "Specially Defensive",
        "description": "<h1>Moves</h1> <p>Diamond Storm provides a nice chance to boost Tyranitar's Defense and deals heavy damage to Mega Rayquaza. Knock Off allows Mega Tyranitar to get rid of various useful items that the foe may be holding, such as Toxic Orb, Eviolite, and Lum Berry. Will-O-Wisp burns the foe if they do not already have a status ailment, allowing Mega Tyranitar to take their physical attacks more easily. Slack Off increases Mega Tyranitar's longevity throughout the match by providing instant recovery alongside the gradual recovery that is obtained via Poison Heal. On the other hand, King's Shield serves as a deterrent to most Fighting-type moves such as Close Combat by lowering the foe's Attack on contact. If you just so happen to weaken Mega Diancie's Attack by predicting a contact move such as Fake Out, this move makes it easier for other Pokemon to switch in on Mega Diancie as well. Additionally, if Mega Tyranitar is poisoned, King's Shield essentially provides a slight amount of free recovery.</p> <h1>Set Details</h1> <p>HP and Special Defense EVs are maximized and a Careful nature is run in order to maximize Mega Tyranitar's walling capabilities. Special Defense investment allows it to switch into stronger special moves such as Aerilate Mega Rayquaza's Boomburst. The other 4 EVs are placed into Attack for a slight increase in damage output. Poison Heal provides Mega Tyranitar with passive recovery when poisoned. As this set is based around this ability, a Toxic Orb is run to ensure that Mega Tyranitar is poisoned as soon as possible, essentially making it immune to other status ailments.</p> <h1>Usage Tips</h1> <p>It is beneficial to scout for Mega Rayquaza's coverage moves, such as Close Combat and Precipice Blades, to ensure that Mega Tyranitar can deal with it safely. Because Mega Tyranitar needs to be poisoned throughout the match, it is also beneficial to get it in on a free switch or scout for Knock Off and status-inflicting moves such as Spore beforehand; these become a non-issue once Mega Tyranitar is poisoned, and at this point, Mega Tyranitar makes for an excellent Knock Off and status sponge.</p> <h1>Team Options</h1> <p>Registeel and Aegislash can help deal with Mega Diancie, which this set is bad at walling due to Mega Diancie's very powerful, super effective STAB attacks. Flash Fire is the ideal ability to run on these Pokemon to prevent Mega Diancie's Magma Storm from KOing them, but Precipice Blades will still hurt them. Giratina can be used to cover most of Mega Tyranitar's weaknesses to Fighting-, Water-, and Grass-type moves. It can also somewhat sponge Ground-type attacks such as Thousand Arrows.</p> "
      },
      {
        "name": "Shift Gear",
        "description": "<h1>Moves</h1> <p>Diamond Storm is the most powerful Rock-type attack with no crippling flaws, while the Defense boosts it provides can potentially help Mega Tyranitar sweep. Knock Off is also quite strong and provides a large amount of utility by getting rid of the foe's item, notably removing Sturdy Shedinja's Lum Berry and Imposter Chansey's Eviolite. Sacred Fire provides a very nice amount of coverage, hitting Steel-types such as Registeel for super effective damage, and has a large chance to burn the foe. Spore is a very reliable sleep-inducing move that can aid in a sweep or cripple an incoming Imposter user. Shift Gear allows Mega Tyranitar to pull off a sweep by boosting its already high Attack and patching up its mediocre Speed stat.</p> <h1>Set Details</h1> <p>Attack EVs are maximized and an Adamant nature is run to allow Mega Tyranitar to deal as much damage as possible. 168 Speed EVs allow Mega Tyranitar to outspeed positive-natured Deoxys-A after a Shift Gear. If you would instead like to only outspeed Timid Mega Mewtwo Y after a Shift Gear, you may shift 44 Speed EVs to HP. The rest of the EVs are placed into HP to improve Mega Tyranitar's bulk, allowing it to pull off a sweep slightly more easily. Poison Heal gives Mega Tyranitar passive recovery to facilitate its sweep, and Toxic Orb is used to poison Mega Tyranitar as early as possible so that Poison Heal can activate, effectively making it immune to other status ailments.</p> <h1>Usage Tips</h1> <p>Due to this set's nature, it is exceptionally important to bring Mega Tyranitar in safely and allow its Toxic Orb to activate. This prevents Mega Tyranitar from getting burned or paralyzed, which is incredibly useful to keep a sweep going. With its Toxic Orb activated, Mega Tyranitar is an excellent status and Knock Off absorber, allowing it to potentially get a free switch in and set up. While Imposter does not give this set too much trouble if it isn't boosted, it can be important to Knock Off the Imposter user's item. It is also quite important to inflict the Imposter user with a status ailment, as without a Sacred Fire burn, the Imposter user can 2HKO Mega Tyranitar after a Shift Gear boost. Therefore, it is a good idea not to set up too many Shift Gears while your opponent has a healthy Imposter user. Knock Off is always a good move to click to get rid of a potential switch-in's item, as is Shift Gear to allow Mega Tyranitar to sweep. The former can also be utilized to deal with Sturdy Shedinja, as Shedinja's Ice Shard fails to KO Mega Tyranitar after an Endeavor when factoring in Poison Heal recovery. Spore can also be used after Knock Off, as the latter gets rid of the foe's Safety Goggles if they have it, allowing Mega Tyranitar to put anything to sleep that isn't Grass-type, does not have Magic Bounce, and doesn't already have a status ailment, facilitating a sweep. However, against Pokemon such as Giratina, it can sometimes be important to wait to Knock Off the foe's item until later in the match so that Knock Off retains its power boost.</p> <h1>Team Options</h1> <p>Registeel or Aegislash can provide entry hazards for Mega Tyranitar to help it sweep as well as provide a resistance to Fairy, which is essential because Mega Tyranitar's weakness to this type makes it a prime target for Mega Diancie. Because Mega Tyranitar is weak to Fighting-, Water-, and Grass-type moves, Giratina is an excellent teammate to patch up these weaknesses. Giratina can also somewhat deal with Ground-type attacks depending on what Pokemon uses them.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Pikachuun", "user_id": 171701}], "teams": [{"name": "Quality checked by", "members": [{"username": "Uselesscrab", "user_id": 167744}, {"username": "Kingslayer2779", "user_id": 231877}, {"username": "nyan kat", "user_id": 256353}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}, {"username": "Empress", "user_id": 175616}]}]}
  },
  "Ho-Oh": {
    "overview": "<p>Ho-Oh's main niche is a check to strong special attackers such as Mega Mewtwo Y, Mega Gengar, Pixilate Mega Diancie, and Gale Wings Mega Rayquaza. It has a good Attack stat that gives Ho-Oh reasonable offensive presence. Its typing is also reasonably good, as offensively, Fire and Flying have good neutral coverage, only missing out on Rock-types and Flash Fire Steel-types. Defensively, two of its weaknesses in Water and Electric are uncommon, and the Fairy-type resistance allows it to check Pixilate Mega Diancie.</p> <p>However, Ho-Oh's main drawback is its low physical bulk, leaving it very vulnerable to powerful physical attackers such as Kyurem-B, Mega Mewtwo X, Regigigas, and Mega Tyranitar. Furthermore, its 4x Stealth Rock weakness limits Ho-Oh to running Magic Guard sets and thus preventing it from running other, arguably better, abilities. The presence of Diamond Storm + Poison Heal Mega Tyranitar, which is able switch in on Ho-Oh's STAB moves and easily KO back with Diamond Storm, is no help either. Thousand Arrows also leaves Ho-Oh vulnerable to other Ground-type moves.</p> ",
    "comments": "<h1>Other Options</h1> <p>Ho-Oh can run Dark Void if Knock Off isn't being used. However, it has lower accuracy than Spore and only really fits on the defensive set due to that running Toxic Orb anyway. Both sets can run Spore to put counters and Imposter Chansey to sleep. It is best used with Knock Off to remove Safety Goggles so more foes will switch out against Ho-Oh, making Stealth Rock optimal for chip damage. However, Spore is not easy to fit on the offensive set and makes Ho-Oh weaker because it needs to run Toxic Orb for the sleep immunity in case it encounters a Magic Bounce user. On the defensive set, Ho-Oh can run High Jump Kick to function as a Mega Tyranitar lure. Will-O-Wisp and Leech Seed also fit on the defensive set because if they are bounced, they do nothing to Ho-Oh because of its Fire typing and Magic Guard, respectively. Will-O-Wisp in conjunction with Knock Off and Leech Seed also helps in beating Sturdy Shedinja. Non-Magic Guard sets are usually very bad due to having a 4x weakness to Stealth Rock, but Water Absorb or Desolate Land can be used to beat Water-types such as Kyogre and Mega Slowbro. Ho-Oh can also run a decent Unburden set to lure in Imposter Chansey after using Belly Drum and OHKOing with Diamond Storm. However, Ho-Oh will have an enormous Stealth Rock weakness and the Unburden set will need a lot of support. Psycho Shift can, in theory, spread poison around the opponent's team. In practice, it's pretty bad, since Psycho Shift removes Ho-Oh's poison, which means Ho-Oh is no longer a good Knock Off absorber, and this tactic can potentially poison a Pokemon with Poison Heal.</p> <h1>Checks and Counters</h1> <p><strong>Physical Attackers and Psystrike Users: Physical attackers such as Mega Rayquaza and Kyurem-B can easily take down Ho-Oh with Fake Out + Extreme Speed. Mega Mewtwo X and Regigigas can leave Ho-Oh severely weakened with their strong physical moves. Mega Latios and Mega Mewtwo Y can easily take down Ho-Oh with STAB Psystrike, which hits Ho-Oh's weaker Defense.</p> <p><strong>Extremely Strong Special Attackers: Though Ho-Oh has very high special bulk, extremely strong special attacks like Mega Rayquaza's Aerilate Boomburst can 2HKO it.</p> <p><strong>Rock-type Pokemon and Moves</strong>: Rock-types such as Regirock and Mega Tyranitar can switch in on nearly any move from Ho-Oh and OHKO it with Diamond Storm. The former will be left heavily weakened if Ho-Oh is already at +1 though, and the latter must be wary of High Jump Kick, as it will be OHKOed. Pokemon that Ho-Oh can check sometimes carry Rock-type moves just to beat it as well. A notable example is Diamond Storm Mega Diancie.</p> <p><strong>Flash Fire Steel-types: If a Steel-type with Flash Fire, such as Aegislash or Registeel, can get in on Ho-Oh, it can force out Ho-Oh with Entrainment, making it take damage from Toxic Orb or Life Orb on the defensive and offensive set, respectively. The offensive set also will take large amounts of recoil from Flare Blitz, Brave Bird, and High Jump Kick missing or being blocked by Spiky Shield or King's Shield.</p> <p><strong>Imposter Chansey: Imposter Chansey can beat the offensive set even if Ho-Oh has already set up, as it can counter sweep a team that lacks a counter to its own Ho-Oh set.</p> <p><strong>Physical Walls</strong>: Ho-Oh cannot break through Giratina, Mega Slowbro, and Fur Coat Chansey due to their reliable recovery. Giratina can also block damage and wear down Ho-Oh with Spiky Shield, and all three can weaken Ho-Oh severely with King's Shield due to all of Ho-Oh's common attacking moves making contact. Mega Slowbro can even force Ho-Oh to switch out with Perish Song or weaken it with Parting Shot.</p> <p><strong>Poison Heal Pokemon: Physical attackers with Poison Heal, such as Mega Garchomp, Mega Gyarados, and Mega Tyranitar, are all capable of switching in on most of Ho-Oh's moves and dealing heavy damage, leaving Ho-Oh severely weakened and unable to check what it needs to. On the other hand, Poison Heal physical walls, such as Giratina or Mega Audino, can easily take hits from Ho-Oh and damage it with Spiky Shield or weaken it with King's Shield due to Ho-Oh's attacking moves making contact.</p> <p><strong>Water-types: Although the only two relevant Water-types are Kyogre and Mega Slowbro, they can easily take down Ho-Oh with Scald or Steam Eruption. They lose if Ho-Oh runs Water Absorb or Desolate Land, though.</p> ",
    "sets": [
      {
        "name": "Defensive Magic Guard",
        "description": "<h1>Moves</h1> <p>Recover keeps Ho-Oh healthy throughout the match and allows it to keep checking special attackers. Flare Blitz is Ho-Oh's main STAB move due to it being highly spammable with Magic Guard negating recoil. Sacred Fire can be used for the high burn chance, allowing Ho-Oh to wear down walls, cripple physical attackers, KO Sturdy Shedinja that lack Lum Berry, and make up for Ho-Oh's weak Defense, but it has significantly lower PP. If hitting Pokemon that resist Fire such as Giratina and Mega Rayquaza is a priority, Brave Bird can be used, but then Ho-Oh will have no way to touch Steel-types. It also makes Ho-Oh more vulnerable to Imposter users, as Ho-Oh takes neutral damage from Flying. Knock Off can be used over Flare Blitz for general utility, removing items such as Eviolite from Chansey, Life Orb, Safety Goggles, and Spooky Plate from Mega Gengar, and Toxic Orb from Poison Heal users. Will-O-Wisp can be used over Knock Off if a more reliable way to spread burns is desired. Ho-Oh's Fire typing makes it immune to burns, thus making it not a problem if opposing Magic Bounce users switch in and end up bouncing back the move. However, you lose out on removing useful items. Whirlwind can stop some setup sweepers such as Tail Glow Mega Rayquaza and Shell Smash Mega Gengar. U-turn works well with Ho-Oh's relatively low Speed, getting most teammates in safely. Stealth Rock allows Ho-Oh to get chip damage on the opponent's team. It meshes well with Ho-Oh's Fire typing due to forcing out many Magic Bounce Steel-types with Flare Blitz. It can backfire, however, if the opponent has bulky Magic Bounce users that aren't Steel-type or if Ho-Oh uses Brave Bird over Flare Blitz, in which case Steel-types can safely switch in. Defog could also be used in the last slot, as Ho-Oh gets many opportunities to switch in and use the move to remove entry hazards.</p> <h1>Set Details</h1> <p>A simple spread of maximum HP and maximum Special Defense gives Ho-Oh the bulk it needs to check most special attackers, including taking a +2 Judgment from Mega Gengar, while a Sassy nature and 0 Speed IVs make Ho-Oh's U-turn as slow as possible, enabling it to easily bring a sweeper in safely. Magic Guard allows Ho-Oh to avoid residual damage from Stealth Rock, Leech Seed, weather, and Curse, as well as recoil damage from Flare Blitz (or Brave Bird, if it is used). Toxic Orb meshes well with Magic Guard, as Ho-Oh being badly poisoned allows it to be immune to status once Toxic Orb activates, letting Ho-Oh switch in on Spore and Dark Void freely, stopping frail sweepers that carry the move as well as Prankster Registeel.</p> <h1>Usage Tips</h1> <p>Getting Ho-Oh in without taking a Knock Off is important, as it won't be immune to status before its Toxic Orb activates. After Toxic Orb activates, Ho-Oh is a good Knock Off absorber due to the lack of need for its item unless you have a cleric on the team. If possible, use Stealth Rock to provide chip damage on the opposing team. Flare Blitz, or Brave Bird if it is used over Flare Blitz, is highly spammable due to Magic Guard negating recoil. The high Base Power of both moves make them good options to use when you don't know what is going to switch in. Use Whirlwind if a Flash Fire Pokemon switches in, such as Aegislash, or if something else, like Mega Rayquaza, is already behind a Substitute. U-turn should be used to get a Pokemon in safely. This helps when a strong physical attacker like Mega Mewtwo X, Kyurem-B, Regigigas, or Mega Rayquaza switches in, as Ho-Oh can U-turn to a check or counter like Registeel, Giratina, or Fur Coat Chansey. Knock Off should be used on predicted switches to remove items from would-be checks like Safety Goggles and Spooky Plate from Mega Gengar and Eviolite from Chansey, as well as Toxic Orbs from Pokemon with Poison Heal, but it must be used as they switch in or else Toxic Orb will activate.</p> <h1>Team Options</h1> <p>Steel-type walls such as Registeel and Aegislash are almost mandatory due to their ability to check Mega Rayquaza and Kyurem-B. Physical walls such as Giratina, Mega Slowbro, and Fur Coat Mega Audino that can switch in on physical attackers such as Mega Mewtwo X and Regigigas are helpful due to Ho-Oh's lack of physical bulk. Pokemon that appreciate the extra damage from Stealth Rock to secure KOs, such as Kyurem-B, Mega Mewtwo X and Y, and Mega Rayquaza, make good teammates.</p> "
      },
      {
        "name": "Offensive Magic Guard",
        "description": "<h1>Moves</h1> <p>Flare Blitz and Brave Bird are powerful and highly spammable due to recoil being ignored by Magic Guard. Sacred Fire can be used over Flare Blitz; though it is weaker and has less PP, the higher burn rate can potentially allow Ho-Oh to beat Sturdy Shedinja that carry Safety Goggles. High Jump Kick allows Ho-Oh to OHKO Mega Tyranitar and 2HKO Regirock, both of which can switch in on everything else and potentially OHKO Ho-Oh with Diamond Storm. Crash damage is ignored due to Magic Guard, making High Jump Kick a strong and very spammable coverage move. Shift Gear boosts Ho-Oh's Attack and Speed, giving Ho-Oh the power and speed it needs to clean up late-game. U-turn can be used to gain momentum upon predicting a switch or to bring in a teammate safely in order to deal with strong physical attackers. It is very difficult to fit on this set, though, due to a loss of a reliable way to clean late-game.</p> <h1>Set Details</h1> <p>Maximum Attack EVs and an Adamant nature allow Ho-Oh to hit as hard as possible, while 16 Speed EVs enable Ho-Oh to outrun everything up to positive-natured base 150 Speed Pokemon such as Timid Mega Sceptile and Jolly Mega Aerodactyl after a Shift Gear. The rest of the EVs go into HP, which allows Ho-Oh to narrowly avoid the 2HKO from Spooky Plate Mega Gengar Judgment or avoid the OHKO if Mega Gengar is already at +2. Magic Guard makes Ho-Oh immune to indirect damage, such as recoil damage from Flare Blitz and Brave Bird, as well as crash damage from High Jump Kick. Due to this, Ho-Oh can afford to run Life Orb for a free power boost, but it can also run Toxic Orb if the immunity to status is preferred. However, if it runs Toxic Orb, Ho-Oh will be significantly weaker.</p> <h1>Usage Tips</h1> <p>It is best to save setting up for late-game, when all of Ho-Oh's counters have been removed. Flare Blitz and Brave Bird are highly spammable due to Magic Guard nullifying recoil. High Jump Kick should be used to OHKO Mega Tyranitar and 2HKO Regirock. This Ho-Oh variant can also be used as a wallbreaker, dealing high damage and then switching out. It can still switch into special attackers like Mega Gengar, but it will take significantly more damage than if it is brought in via a slow U-turn from RegenVest Regirock or another slow pivot.</p> <h1>Team Options</h1> <p>A check to your own Ho-Oh is required if this set gets copied by an Imposter Chansey if it is already boosted. Some good checks are Unaware or Fur Coat Giratina and Mega Slowbro. Because this variant of Ho-Oh has less bulk and no recovery, it is mandatory to have checks to physical attackers. As such, Giratina, especially with Fur Coat, as well as Fur Coat Chansey are vital to check Mega Mewtwo X and Regigigas. Steel-types like Registeel and Aegislash can check -ate variants of Mega Rayquaza and Kyurem-B. Entry hazard support from Pokemon such as Mold Breaker Giratina can easily secure KOs such as High Jump Kick on Regirock. As a bonus, Giratina can eliminate Sturdy Shedinja with Pursuit, giving Ho-Oh more room to set up and sweep. Walls like Regirock and Registeel can provide a slow U-turn to bring Ho-Oh in safely.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Heavyweapons Mann", "user_id": 217737}], "teams": [{"name": "Earlier versions by", "members": [{"username": "nyan kat", "user_id": 256353}]}, {"name": "Quality checked by", "members": [{"username": "morogrim", "user_id": 276906}, {"username": "Uselesscrab", "user_id": 167744}, {"username": "E4 Flint", "user_id": 203690}]}, {"name": "Grammar checked by", "members": [{"username": "Rare Poison", "user_id": 197616}, {"username": "GatoDelFuego", "user_id": 91628}]}]}
  },
  "Shedinja": {
    "overview": "<p>Shedinja is an incredibly potent threat in the Balanced Hackmons metagame, able to endure virtually any direct hit and bring most foes down to their last breath in one fell swoop. Shedinja's almost infinite bulk comes from its unique hardcoded 1 HP stat in combination with the ability Sturdy, which allows it to tank any direct damage thrown at it that doesn't come from a Pokemon with Mold Breaker. From here it is able to use moves such as Endeavor and Pain Split to reduce the foe's HP or simply function as an extremely efficient defensive pivot to preserve your team's momentum and easily switch in checks and counters for whatever the opponent attempts to throw at Shedinja.</p> <p>Shedinja has defined the Balanced Hackmons metagame to the point that any successful team has multiple ways to deal with it, most of which function very well outside of countering Shedinja. Strategies include Mold Breaker, which becomes an almost infallible way of dealing with Shedinja if paired with Pursuit. Other methods include entry hazards such as Stealth Rock and Toxic Spikes, status infliction, partial trapping moves, Rocky Helmet and Spiky Shield, and damage-dealing weather conditions such as sand and hail. A well-played Shedinja will almost always be able to nullify the effects of these methods, though, either with proper team support or by adjusting its moveset or item.</p> ",
    "comments": "<h1>Other Options</h1> <p>Magic Guard can be used to bluff a Sturdy set in Team Preview and not take damage from entry hazards or status, but once it's been found out all utility is lost, as it only takes one hit from any Pokemon to break the Focus Sash that is required on this set, and another to take Shedinja out. Abilities such as the -ates and Scrappy also allow Shedinja to surprise Ghost-type switch-ins with an Endeavor. Consider running Pursuit on these sorts of sets to prevent the opponent from switching their Ghost-type out after realizing that your Shedinja isn't Sturdy. Pursuit can also be used as a finishing move if priority isn't necessary, as it ensures a KO on an unprotected foe, even those that try to switch out after being hit by Endeavor. Spore can be useful on Safety Goggles sets, as you won't need to fear Magic Bounce users. Putting a threat to sleep will usually force them to switch out, which will allow Shedinja to switch into a check for that. It's good for momentum but comes at the cost of staying in the field longer. Spore also gives Shedinja the opportunity to switch out of Mold Breaker users lacking Safety Goggles, but that item and ability combination is rather common, so be sure to have Knock Off support if you are going to attempt this strategy. The extremely risky Teeter Dance can also be used to force a 50% chance of survival against a Mold Breaker user that switches in. Foresight can be used, not only to hit Ghost-types that are immune to Endeavor but also to force Ghost-types out, allowing Shedinja's Endeavor to land on another Pokemon on the opponent's team. This won't help in situations where the opponent has multiple Ghost-types on their team, however. Extreme Speed can be used as an alternative to Ice Shard or Feint for more power at the cost of making contact and being blocked by Protect clones and Ghost-types. Perish Song can also be used to force switches when you come across a sweeper that the rest of your team can't handle or to use in tandem with partial trapping to deal with walls that your offensive Pokemon aren't able to break through. Eject Button and Red Card can also be used if you have trouble with partial trapping moves such as Magma Storm, Infestation, and Whirlpool. Eject Button also allows Shedinja to switch out of status inflicted via attacks such as Inferno, Sacred Fire, Scald, and Poison Fang. Magic Coat can also be useful against foes that opt for status moves as their answer to Shedinja.</p> <h1>Checks and Counters</h1> <p><strong>Mold Breaker</strong>: Common Mold Breaker users include offensive Pokemon such as Mega Gyarados and Mega Gengar but also defensive Pokemon such as Giratina. More often than not, a Mold Breaker user will be carrying Pursuit, even if they are defensive, which is guaranteed to hit Shedinja, even if it switches out. Mold Breaker users also have the ability to set up entry hazards without fear of having them bounced back by Magic Bounce, which makes hazard removal on Shedinja's teammates absolutely mandatory.</p> <p><strong>Entry Hazards: The only entry hazard that Shedinja isn't afraid of is Sticky Web. The rest of them either KO Shedinja or inflict it with poison as it switches in, making Shedinja little more than a sacrifice unless your team carries Defog or Rapid Spin.</p> <p><strong>Passive Damage</strong>: Different types of passive damage knock out different Shedinja, depending on which item they choose to run. Sand from weather setters such as Mega Aerodactyl and Mega Tyranitar instantly defeats Lum Berry variants but not Safety Goggles ones. Moves that cause poison or burn damage like Will-o-Wisp and No Guard users' Inferno knock out Safety Goggles variants but not Lum Berry ones. Partial trapping from Mega Rayquaza or Mega Mewtwo Y's Magma Storm or Soundproof users' Infestation, Curse from Giratina, and Leech Seed from Poison Heal Kyogre defeat most common types of Sturdy Shedinja.</p> <p><strong>Knock Off: Knock Off severely cripples Shedinja's ability to avoid passive damage, either by removing its Lum Berry and opening it up to status or by removing its Safety Goggles and making it vulnerable to passive weather damage and moves like Spore, which hamper its pivoting abilities as well. Common users of Knock Off include Mega Gyarados, Mega Tyranitar, Mega Mewtwo X, Giratina, and Regirock.</p> <p><strong>Poison Heal: Poison Heal provides a hard check to Shedinja the majority of the time, unless used by a Pokemon with a particularly low Defense stat. Poison Heal outheals partial trapping unless Shedinja is running Binding Band, and makes it very difficult to KO the Poison Heal user with Ice Shard or Feint. On top of that, many Poison Heal users, such as Kyogre and Giratina, also run moves specifically to counter Shedinja, such as Psycho Shift, Leech Seed, Trick, and Scald.</p> <p><strong>Regenerator</strong>: A slow Pokemon with Regenerator, such as Regirock or Registeel, is able to switch into any of Shedinja's moves and switch back out to heal, making it very difficult to knock out unless Shedinja is running Pursuit. A dual Regenerator core is nigh-unbeatable by Shedinja.</p> ",
    "sets": [
      {
        "name": "Defensive Pivot (level 1)",
        "description": "<h1>Moves</h1> <p>Baton Pass is the safest switching move that Shedinja can use, as the only thing that stops it from working is the move Taunt, which is quite uncommon. Other switching moves all rely on your opponent not having a common item, type, ability, or move, such as Rocky Helmet, Ground-types with Mold Breaker, and Magic Bounce users, all of which can spell trouble for your Shedinja. Pain Split shares the difference between Shedinja's HP and its foe's; because of Shedinja's hardcoded 1 HP stat, it will always cut the foe's HP in half. It's a slower method of knocking out foes than a move such as Endeavor, but it has the benefit of not making contact and being able to hit Ghost-types. The respectable 32 PP that Pain Split offers also means that any recovery on a defensive foe can be stalled out, securing Shedinja a KO or allowing teammates to sweep it with little trouble. Alternatively, Shedinja can run Endeavor as a more drastic means of attempting to lower the HP of an opposing Pokemon. Whirlpool complements both Pain Split and Endeavor very well, as it deals damage equal to one-eighth of the foe's maximum HP at the end of every turn while also preventing them from directly switching out, aside from Ghost-types and Shed Shell Pokemon. Whirlpool is less accurate than Infestation, but it has the benefit of not making contact, meaning that Shedinja is not vulnerable to the effects of Rocky Helmet, Spiky Shield, and abilities such as Rough Skin. Partial trapping is vital on this Shedinja set if you intend to score KOs with it, especially with Pain Split, as Pain Split can only do so much damage before it ceases to work. Safeguard and Recycle are both moves that reduce the risk of status knocking out Shedinja, and the move used depends on Shedinja's item. Safeguard works with Safety Goggles to give Shedinja an immunity to status as well as to residual weather damage, but even the turn used to set up Safeguard can be very risky for Shedinja. Conversely, Recycle allows a Lum Berry to be used up to 16 times, making Shedinja virtually immune to status but leaving it vulnerable to weather damage and forcing Shedinja to go on the defensive when facing a foe that spams status moves. Another option is Shell Smash, which can be used in conjunction with Baton Pass to pass very powerful stat boosts to Shedinja's teammates.</p> <h1>Set Details</h1> <p>Shedinja being Level 1 allows for a slow Baton Pass to ensure that you start the next turn with the upper hand; this Shedinja set will almost assuredly go last, except against other Level 1 Pokemon. Furthermore, the minimalized defenses guarantee that your team will be able to OHKO any Imposter Pokemon that copies this set, provided you have a Pokemon with Mold Breaker and Pursuit on your team. Even if not, many opponents don't pay attention to Shedinja's level, so they don't consider that their Imposter users will have only single-digit defenses after they transform, increasing the likelihood of opponents keeping their copied Shedinja in on any Pokemon that doesn't look like it will OHKO them. Safety Goggles provides Shedinja with the ability to avoid passive damage when supported by teammates with Aromatherapy or Heal Bell, allowing it to not be bothered by the occasional sand or hail team, as well as supplying a useful immunity to the omnipresent Spore. Lum Berry, on the other hand, allows Shedinja to run more independently in regards to status when paired with the move Recycle to keep status away without switching out, with the compromise being that any sand or hail team will render Shedinja useless, as it will be knocked out as soon as it switches in.</p> <h1>Usage Tips</h1> <p>Above all else, this Shedinja set is a defensive pivot, so Baton Pass should really be the only move it uses to minimize the risk of it fainting and compromising your team's defensive synergy. However, Shedinja shouldn't be the only Pokemon capable of taking a hit on your team, as the methods of dealing with it are flexible enough to be applied to any Pokemon, sweepers and walls alike. If another Pokemon on your team is capable of taking a hit or two from a certain threat, switch into that before switching into Shedinja, as it will give you the opportunity to find out what moves the foe is running and whether or not Shedinja should be afraid of them. Directly switching into Shedinja should only be done when you know what your opponent is running or when no other Pokemon on your team is capable of taking a hit from a certain threat.</p> <p>Furthermore, the use of slow switching strategies on Shedinja's teammates makes scouting for Shedinja's checks a lot easier. A slow switch into Shedinja not only keeps Shedinja safe from any attacks but also allows you to see whether or not the Pokemon you're facing is capable of dealing with Shedinja. Oftentimes if a certain Pokemon can't either KO or outheal Shedinja, it will switch out immediately. Shedinja will be able to safely Baton Pass away afterwards, and for the rest of the match you will know almost for sure that that certain Pokemon can be checked by Shedinja. Be wary of Mold Breaker and its clones, which anything can run in Balanced Hackmons. You want to keep Shedinja alive as long as possible; don't just sacrifice it in the beginning of the game because you see an opportunity for a KO.</p> <h1>Team Options</h1> <p>Shedinja's niche isn't hampered by many playstyles or team setups, so it is able to find a place on most teams. However, Shedinja isn't something that can be thrown on a team for an instant win; if you don't want Shedinja fainting very early, a large part of your team needs to be built around it or at least optimized for use with it. Use Shedinja alongside a Mold Breaker Pursuit Pokemon such as Giratina or Mega Gyarados to lure opposing Imposter Pokemon into your pivoting Shedinja and OHKO them every time. Entry hazard removal is mandatory. Defog is the most reliable method, although Rapid Spin can be run if you're looking to only remove hazards from your own side of the field, though it can be blocked by the many Ghost-types in Balanced Hackmons. Common Defog users include Registeel, Aegislash, and Lugia, but the move can be run on just about any defensive Pokemon with success. Rapid Spin is usually reserved for Pokemon that run Assault Vest + Regenerator, which can include Regirock, Registeel, and Kyogre. Status curing is also very important, especially if you run Safety Goggles. Not only do the moves Aromatherapy and Heal Bell allow Shedinja to switch in after it's been inflicted with a status, but they also cure other members of your team. These moves can usually fit nicely into the moveset of a Pokemon that uses Defog, particularly ones with the Prankster or Magic Bounce abilities. To reduce risk, it's a good idea to have an Imposter teammate to scout the opponent's movesets before bringing Shedinja in on them if possible. Chansey is the best choice. Scouting can also be achieved by using VoltTurn strategies to determine the movesets of the opponent's team. The use of defensive Pokemon with Regenerator alongside Shedinja nullifies residual damage from Leech Seed and partial trapping that gets passed by Baton Pass, assuming they switch out afterwards, as well as providing an opportunity for these VoltTurn strategies. Pokemon such as Mega Slowbro, Regirock, and Registeel are often effective users of Regenerator.</p> "
      },
      {
        "name": "Endeavor",
        "description": "<h1>Moves</h1> <p>Endeavor is Shedinja's most powerful damaging move, instantly bringing anything that it can hit down to 1 HP. It's much quicker at minimizing the foe's HP than Pain Split, but it does make contact, meaning that Rocky Helmet, Spiky Shield, Rough Skin, and Iron Barbs instantly KO Shedinja upon use. It also only has 8 PP, meaning that it's very easy for defensive Pokemon with Leftovers to PP stall it. Ice Shard is used alongside Endeavor to ensure that a foe is knocked out before being able to heal, unless the foe is a Prankster user with more Speed than Shedinja. Ice Shard's typing also allows it to deal a large amount of damage to common threats in the metagame such as Mega Rayquaza. Feint is a +2 priority move that has the benefit over Ice Shard of ignoring protection moves such as Protect and Spiky Shield. Priority can be exchanged for a move such as Whirlpool to trap the foe if you'd like the slow switch and easy Imposter luring of a Level 1 Shedinja, as partial trapping deals consistent damage, regardless of Shedinja's attack stat. Whirlpool is used over Infestation, as it allows Shedinja to score damage on foes with Rocky Helmet without KOing itself. Baton Pass allows Shedinja to fulfill the role of a pivot when you haven't scouted the opponent's team enough to know when Shedinja can start attacking other Pokemon. It also passes conditions such as confusion, Leech Seed, Gastro Acid, and partial trapping to its recipient, but the effects of these are more often than not nullified by proper team support. If you don't want to run Baton Pass, opt for Volt Switch instead of U-turn or Parting Shot. U-turn is affected by Rocky Helmet and Spiky Shield, while Parting Shot leaves Shedinja vulnerable to Magic Bounce users taking advantage of the move for a free switch into their own Mold Breaker user. Safeguard and Recycle reduce the risk of status knocking out Shedinja; the choice depends on Shedinja's item. Safeguard works with Safety Goggles to give Shedinja immunity to status as well as to weather damage, whereas Recycle allows a Lum Berry to be used many times, giving Shedinja an effective immunity to status.</p> <h1>Set Details</h1> <p>Defensive IVs and EVs are minimal, but Shedinja's Attack is maximized and its level must remain at 100 if using Ice Shard or Feint, to be able to break through Pokemon that carry Leftovers. Imposter Pokemon can still be taken out using this spread, but you should be careful if you pair this Shedinja set with a defensive Mold Breaker user, as their Pursuit might not always OHKO an Imposter with high HP such as Chansey or Blissey. Both items protect Shedinja from passive damage. If you can't fit Aromatherapy on your team, opt for the Lum Berry to give Shedinja independence in its status-walling abilities. Otherwise, use Safety Goggles, as it is the only way to protect Shedinja from residual weather damage outside of gimmicks such as Magic Guard. The Brave nature maximizes Shedinja's Attack, giving it a stronger finishing move while minimizing its Speed to preserve its slow pivoting abilities. It also maximizes the amount of damage that a move such as Foul Play will do to an Imposter user, should you choose not to run Shedinja alongside a Mold Breaker Pursuit user.</p> <h1>Usage Tips</h1> <p>This Shedinja set functions best as a defensive pivot, but it sacrifices the minimal Speed and lack of contact moves of the Pain Split set and reduces its ability to lure in and deal with Imposter Pokemon in favor of a more consistent offensive presence. However, because this offensive presence requires the use of contact moves, be sure to scout the opponent's team for Rocky Helmet and Spiky Shield users before attempting to cripple their Pokemon with Shedinja.</p> <p>Slow switching via the use of Baton Pass is extremely helpful for Shedinja. While slow switching is not completely necessary on all Balanced Hackmons teams, you'll have a very difficult time getting Shedinja safely into play without it, as you then open yourself up to surprise coverage or switching into a Mold Breaker user. Paranoia is excellent when it comes to using Shedinja, so don't be surprised if most of the early-game sees Shedinja only using its switching move.</p> <h1>Team Options</h1> <p>A Mold Breaker user with Pursuit not only provides a near-guaranteed OHKO on any opposing Shedinja but also serves as an extremely capable Imposter counter if an Imposter Pokemon switches into your Shedinja as it pivots out. With this set in particular, an offensive Mold Breaker Pokemon is preferred, as a Pursuit coming off of a defensive Pokemon won't always OHKO an opposing Chansey. Cleric support and entry hazard control are also a must if you want to ensure Shedinja's reliability throughout the match. Prankster users such as Registeel and Giratina perform this role very efficiently. An Imposter user of your own works wonders to ensure maximum knowledge of your opponent's team. By far the most reliable Imposter user is Eviolite Chansey. Team members that run Knock Off, such as Mega Gyarados, Mega Tyranitar, Mega Mewtwo X, and Regigigas, as well as defensive Pokemon such as Giratina, Regirock, and Registeel make Shedinja's job a lot easier by removing Rocky Helmet and Leftovers from the equation, giving Shedinja much greater freedom to use Endeavor and Ice Shard. This Shedinja set also synergizes very well with sand and hail teams if it runs Safety Goggles. Shedinja can cripple the foe with Endeavor while the residual weather damage finishes them off, effectively KOing it in a single turn. This also allows Shedinja to stay in against a wider variety of threats, as the foe will faint before partial trapping moves or Leech Seed are able to KO Shedinja.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "tysequaine", "user_id": 268314}], "teams": [{"name": "Quality checked by", "members": [{"username": "Uselesscrab", "user_id": 167744}, {"username": "Piccolo Daimao", "user_id": 219853}, {"username": "E4 Flint", "user_id": 203690}]}, {"name": "Grammar checked by", "members": [{"username": "P Squared", "user_id": 168392}, {"username": "Lumari", "user_id": 232216}]}]}
  },
  "Regirock": {
    "overview": "<p>Though Regirock faces challenges in distinguishing itself in the Balanced Hackmons metagame, its stats and typing combine to provide it with a niche as a bulky pivot. Its Rock typing can initially appear to be a curse in a metagame infested with Thousand Arrows and other attacks that prey on the type's weaknesses. However, the typing also sports key resistances to Flying and Fire, which notably allows Regirock to take Aerilate-boosted attacks with ease. This, combined with Regirock's 80 / 200 physical bulk to absorb Thousand Arrows, means that it sports the ability to comfortably check Mega Rayquaza, as well as countering other threats like Ho-Oh. Regirock's Rock typing also grants it STAB on Diamond Storm, allowing it to apply offensive pressure on a variety of top-tier threats while operating in its defensive capacities. Unfortunately, it faces stiff competition from Mega Tyranitar and Mega Diancie offensively and from Registeel and other bulky Steel-types defensively. Overall, however, Regirock is an excellent pivot that can help teams cover key weaknesses to prominent offensive threats while maintaining momentum.</p> ",
    "comments": "<h1>Other Options</h1> <p>Regirock's final moveslot is relatively flexible. Icicle Spear and Ice Shard are both useful additions for their abilities to help out against Mega Rayquaza; the first can hit Gale Wings Mega Rayquaza through Substitute, while the second can allow Regirock to save a turn of tanking damage by KOing Mega Rayquaza with priority. A reliable damaging move like Seismic Toss or Night Shade is a possibility, but as Regirock's offense is relatively well rounded between Diamond Storm and Sacred Fire, this is often a redundant option. Rapid Spin is another potential inclusion, but Regirock is unfortunately a terrible user of the move, as it gives two of its checks, Shedinja and Giratina, free switches in. A phazing move such as Circle Throw or Dragon Tail is also an option to nail foes trying to set up and potentially bring in something against which Regirock can U-turn out with impunity. However, due to Regirock's low Speed and lack of immediate recovery, this could potentially backfireanything you aim to phaze will likely have the capacity to leave a mark on Regirock (otherwise, there is very little reason to phaze it), and after being hit by a strong attack, Regirock will often be forced to switch out blindly against a fresh attacker that could cripple or even KO it before it can get off a U-turn. Clear Smog is another option to achieve the same goal of blocking stat boosting. Finally, Metal Burst is an option that synergizes well with Regirock's low Speed, but Regirock's comparatively low HP by Balanced Hackmons standards greatly lowers the move's effectiveness.</p> <p>Alternatively, one could attempt a Sand Stream set with Leftovers or Safety Goggles to provide a similar buff to Special Defense as Assault Vest does. Sand Stream also holds the allure of discouraging Shedinja from switching in. By sacrificing Regenerator, however, Regirock is forced to spend valuable time recovering, which sacrifices much of the niche that it otherwise holds. Between extra chip damage, a free item slot, and the ability to use status moves, Sand Stream Regirock may appear to be a strong option, but it unfortunately faces strong competition from Flash Fire Steel-types, which play a similar role, unless you plan to use Regirock as a weather setter for a team built around sand. If this is not the case, however, RegenVest is the superior choice, as it is what Regirock excels at.</p> <h1>Checks and Counters</h1> <p><strong>Poison Heal Giratina: Once its Toxic Orb is activated, Poison Heal Giratina is impervious to anything Regirock can do. It can easily switch in and status or otherwise cripple Regirock, forcing Regirock to U-turn out on the switch or hard switch out once Giratina is in. However, if Giratina has not yet activated its Toxic Orb, Regirock can threaten it with a Sacred Fire, Nuzzle, or Knock Off.</p> <p><strong>Lum Berry Sturdy Shedinja</strong>: If Regirock lacks Sand Stream, Knock Off, and Infestation, Shedinja can switch in with absolute impunity and Recycle its Lum Berry if statused. From this position, Shedinja can threaten Regirock with Endeavor or pivot out with an even slower switching move than Regirock's U-turn, stealing momentum.</p> <p><strong>Flash Fire Steel-types</strong>: Flash Fire Steel-types can easily switch in on Regirock, tanking its moves with ease and notably being immune to its Sacred Fire. Regirock can use Knock Off against them, but that is unfortunately the extent of its ability. Meanwhile, they can threaten Regirock back with status or attempt to wear it down with STAB Steel-type attacks.</p> <p><strong>Mega Mewtwo X and Y</strong>: While they struggle to switch in safely, Mega Mewtwo X and Y can both threaten Regirock with STAB Fighting-type moves and the combination of Sheer Force and Earth Power or Focus Blast, respectively. Due to Regirock's lack of immediate, reliable recovery, it is often forced to switch out of these attacks to avoid being KOed (both formes have at least a chance to OHKO Regirock with their corresponding move, maximum investment, and Life Orb).</p> <p><strong>Mega Diancie</strong>: Mega Diancie can easily switch in on much of Regirock's moveset thanks to its typing, and once it does, it can threaten Regirock with a powerful Pixilate-boosted Boomburst. However, Mega Diancie is relatively vulnerable to Regirock's Diamond Storm and Sacred Fire.</p> ",
    "sets": [
      {
        "name": "RegenVest",
        "description": "<h1>Moves</h1> <p>Diamond Storm is Regirock's preferred STAB move, dealing decent damage against most foes that don't resist it while having a nifty 50% chance to boost Regirock's Defense. U-turn is a great move for grabbing momentum, allowing Regirock to exploit its low Speed to give teammates a free switch. Sacred Fire allows Regirock to cripple physical attackers like Mega Mewtwo X on the switch, as well as allowing it to threaten Shedinja somewhat. However, Nuzzle is also an option to cripple offensive Pokemon in general. Knock Off has obvious, general utility; notably, it allows Regirock to neuter the offensive power of threats carrying Life Orb or other boosting items, as well as removing Eviolite from Chansey and stopping Toxic Orbs on the switch. Knock Off also discourages cleric support alongside Poison Heal users even once their Toxic Orbs are setwhile the poisoning initially remains, removing the Toxic Orb means that Poison Heal will stop working if your opponent elects to use Heal Bell or Aromatherapy. Finally, Infestation is another option to surprise Shedinja if you opt against running Sacred Fire.</p> <h1>Set Details</h1> <p>The EV spread given allows Regirock to always avoid the 2HKO from Adamant Sky Plate Mega Rayquaza's Thousand Arrows or Boomburst after Stealth Rock. It also affords Regirock the ability to check Mega Gengar in a pinch, as it is not OHKOed by +2 Spooky Plate Judgment or Secret Sword. However, if Mega Gengar carries Spore, Regirock will struggle to check it. The rest of the EVs are poured into Attack in order to give Regirock as much offensive presence as possible. Regenerator enables Regirock to recover passively without wasting turns to do so, while Assault Vest buffs up its relatively low Special Defense and synergizes well with Regenerator.</p> <h1>Usage Tips</h1> <p>Regirock thrives on forced switches; U-turn, Sacred Fire, Nuzzle, and Knock Off are all tools that you can capitalize upon and grab momentum or cripple the foe. Because of Regirock's demonstrable efficacy in crippling foes on the switch, it's a good idea to identify the members of your opponent's team that Regirock can force out and exploit to the fullest. Early-game, it's also a good idea to make copious use of U-turn to identify what the opponent's strongest answer to Regirock is. Even later on in the game, U-turn is a great, safe option to snag momentum against foes that Regirock walls. Because Regirock is incredibly susceptible to status, you should scout around to identify which members of the opposing team can burn it or put it to sleep and act accordinglygetting hit with either of these statuses can leave Regirock functionally useless. Finally, if you opt to use Infestation, this should be hidden against opponents running Sturdy Shedinja until you can bait the Shedinja to come in on Regirock's attacks; otherwise, a smart opponent will simply pivot out and make it quite difficult to land the Infestation.</p> <h1>Team Options</h1> <p>Poison Heal Giratina makes for a fantastic teammate to Regirock. Not only can it counter an Imposter of Regirock with ease, but it also boasts excellent defensive synergy with Regirock and can soak up status for it. In addition, Regirock's slow U-turn gives Giratina an easy way to activate its Toxic Orb or nab an extra turn of Poison Heal recovery. If Regirock doesn't run Infestation, a Mold Breaker Pokemon with Pursuit such as Mega Gengar, Giratina, or Mega Gyarados can also be very useful to take care of Shedinja, once again capitalizing on Regirock's U-turn to ease prediction. Entry hazard control is essential to Regirock's success, making a solid Defogger such as Giratina or Registeel an excellent teammate. Ideally, Regirock would also appreciate entry hazards down on the opponent's field to capitalize on with its U-turn; however, as keeping hazards off of its own side of the field is the primary concern and Defog is the most reliable way to do this, stacking hazards is often forced to take a back seat. Another way to limit hazards is with a Magic Bounce user (again, Giratina and Registeel are prime contenders), which can also be useful to redirect the status that Regirock attracts like a magnet; however, Mold Breaker can easily bypass it. While Regirock is certainly bulky, it struggles to switch in against Pixilate and, to a lesser extent, Refrigerate attackers such as Mega Diancie and Kyurem-B. Therefore, a secondary check to these two must be included as a teammate. However, Regirock's alleviation of the pressure from Aerilate allows greater flexibility in checking the other two ate Pokemon. Finally, a cleric such as Registeel or Mega Audino is a good idea for a teammate, preventing Regirock from becoming dead weight if put to sleep or burned unexpectedly, although it synergizes poorly with Poison Heal on other teammates.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "jackm", "user_id": 118019}], "teams": [{"name": "Quality checked by", "members": [{"username": "Uselesscrab", "user_id": 167744}, {"username": "E4 Flint", "user_id": 203690}, {"username": "Piccolo Daimao", "user_id": 219853}]}, {"name": "Grammar checked by", "members": [{"username": "P Squared", "user_id": 168392}, {"username": "Lumari", "user_id": 232216}]}]}
  },
  "Registeel": {
    "overview": "<p>Registeel is a very versatile Pokemon in Balanced Hackmons due to its strong defenses and mono-Steel typing. It can run many supportive and defensive sets effectively and is commonly used as a check to -ate users, as it resists Ice, Flying, and Steel. However, coverage moves, such as V-create, Close Combat, Thousand Arrows, and Magma Storm, can be a problem for Registeel, as it often cannot take super effective hits from the strongest Pokemon in the tier. It competes with Aegislash as a bulky Steel-type wall, but Registeel is bulkier. All in all, Registeel is one of the premier all-around defensive Pokemon of the tier, capable of walling many strong offensive threats as long as they don't have super effective moves.</p> ",
    "comments": "<h1>Other Options</h1> <p>Registeel can run Levitate or Flash Fire to effectively wall one's own sweepers such as Mewtwo Mega Y from Imposter users. Fur Coat Registeel sees some usage because it's a great wall to just about any physical move in the game. Mail is sometimes a good item for Registeel so that it can't get Tricked a Choice Scarf or Assault Vest. Additionally, Gastro Acid or Entrainment can be used on Prankster variants to destroy Poison Heal users or simply remove abilities that might otherwise be dangerous to your team. Encore or Spore with Safety Goggles are also good options for the Prankster set. Additionally, Sacred Fire can be used on the RegenVest set in order to spread burns, which can be game changing. Additionally, Dragon Tail may be used over Clear Smog, with the trade-off being that it does not work on Fairy-types or the opponent's last Pokemon. Night Shade can be used for more consistent damage as well.</p> <h1>Checks and Counters</h1> <p><strong>Strong Super Effective Attacks: Coverage is one of the best ways of dealing with Registeel. Hard-hitting super effective attacks, such as Precipice Blades and Sacred Fire, almost always OHKO or 2HKO Registeel. Contrary sweepers are also quite threatening to Registeel, as they commonly run V-create and Superpower.</p> <p><strong>Mega Rayquaza</strong>: Rayquaza can often run coverage moves to deal with Registeel easily, such as Earth Power, Magma Storm, Low Kick, Precipice Blades, and Thousand Arrows.</p> <p><strong>Mega Mewtwo X: Mega Mewtwo X can take advantage of its Fighting-type STAB moves to easily deal with Registeel. Even if it lacks Fighting-type STAB moves, if it runs Mold Breaker, it can still bypass a Flash Fire or Levitate Registeel's ability by using moves like V-create and Precipice Blades, respectively.</p> <p><strong>Mega Gengar</strong>: Mega Gengar is capable of setting up Substitute or Shell Smash against Registeel, which gets it ready to sweep. Some Registeel sets are capable of stopping it with Knock Off, Whirlwind, or Topsy-Turvy, but Mega Gengar is often a good switch-in to Registeel anyway.</p> <p><strong>Magic Bounce Users</strong>: Registeel sets that can do anything to Magic Bounce users are few and far between, so Registeel will have to switch out when it sees one most of the time.</p> <p><strong>Poison Heal Users</strong>: Registeel can do very little to Poison Heal users after they've been poisoned, besides forcing them out with Entrainment.</p> ",
    "sets": [
      {
        "name": "Magic Bounce",
        "description": "<h1>Moves</h1> <p>Entrainment allows Registeel to force Poison Heal users out, as once their ability is switched, they start taking large amounts of damage from poison. Knock Off, on the other hand, has great utility against many types of teams and is especially useful for hitting Mega Gengar, removing Eviolite from Imposter Chansey, and removing Toxic Orb from Poison Heal users, discouraging their teammates from using Aromatherapy or Heal Bell. Baton Pass allows Registeel to easily pivot and bring in a check to a potential switch-in. It also allows Registeel to escape Perish trap or Magnet Pull users. Defog is a must-have on all teams due to entry hazard stacking, and Registeel can use it effectively because it also prevents entry hazards from being set up with Magic Bounce. Aromatherapy allows Registeel to easily heal its team of status ailments, and Recover keeps Registeel healthy so that it can continue to take on offensive threats.</p> <h1>Set Details</h1> <p>Leftovers give Registeel passive recovery, which can be useful against foes that would otherwise 2HKO it. Rocky Helmet allows Registeel to punish U-turn users, and generally build up damage on foes that lack recovery. It's especially useful against Mega Rayquaza because Fake Out and Extreme Speed are both contact moves, and if Stealth Rock is set up, Mega Rayquaza's ability to switch in and out is severely limited. The EVs allow Registeel to avoid being 2HKOed by Modest Choice Specs Mega Rayquaza's Boomburst over 90% of the time after Leftovers recovery.</p> <h1>Usage Tips</h1> <p>It's always a good idea to scout sets with Imposter Chansey before switching Registeel in, especially against Mega Rayquaza, which often prepares for Registeel with powerful coverage moves. Registeel can switch into just about any non-Mold Breaker Deoxys-S lead, as Magic Bounce lets Registeel bounce back Spore and entry hazards that Deoxys-S throws at it. If you know Registeel walls the foe, it's generally safe to Baton Pass out, predicting the foe's switch. Registeel also loves switching in against physical Poison Heal users, especially Arceus, as it walls most of them and can force them out with Entrainment.</p> <h1>Team Options</h1> <p>Imposter Chansey works well with Registeel, as it can scout opposing sets to see if Registeel can wall them. Also, Fur Coat or Poison Heal Giratina complements this set because it resists or is immune to two of Registeel's three weaknesses and is a similarly bulky wall. Sweepers that are walled by Registeel, such as certain Mega Rayquaza or Mega Diancie sets, can also be used as partners without worrying about needing to be Imposter-proof.</p> "
      },
      {
        "name": "Prankster",
        "description": "<h1>Moves</h1> <p>Topsy-Turvy lets Registeel stop setup sweepers by flipping their stat boosts, rendering them powerless. Destiny Bond gives Registeel an easy way of removing an opposing sweeper if it 2HKOes or otherwise threatens Registeel. Taunt prevents the foe from setting up or otherwise stalling PP. It can force many defensive Pokemon to switch out. Parting Shot gives Registeel the ability to pivot and gain momentum if the foe switches out. It can also phaze Magic Bounce users because when Parting Shot gets bounced back, it forces the opponent to switch, regardless of other trapping effects, such as Ingrain. U-turn is great for slow pivoting, providing safe switches, and effectively making Destiny Bond last two turns. It also allows Registeel to easily escape a situation where it has been Taunted somehow, such as from a Magic Bounce user switching into its Taunt, and provides a small amount of residual damage. Recover lets Registeel shrug off any damage that foes have done to it.</p> <h1>Set Details</h1> <p>A physically defensive spread allows Registeel to take very little damage from Fake Out + Extreme Speed from -ate users, and Prankster Recover gives it some leg room when dealing with Boomburst users. Safety Goggles prevents Spore from shutting down this set, allowing Registeel to switch into the move easily. Leftovers gives Registeel a small amount of recovery each turn, cutting burn and Leech Seed damage in half as well as allowing Registeel to wall foes that otherwise 2HKO it. Rocky Helmet forces -ate users to think twice before using Fake Out or Extreme Speed, as the residual damage adds up quickly, especially on sets that lack recovery.</p> <h1>Usage Tips</h1> <p>Prankster Registeel can switch into almost any non-super effective attack, so it's a good idea to scout out what moves the foe has with an Imposter user. Registeel doesn't mind Knock Off all that much, so it's generally not the end of the world if it switches into a few of those. After its item is removed, unboosted Knock Off will do next to nothing. It's also worth noting that because Destiny Bond lasts until Registeel moves next, Destiny Bond followed by slow U-turn effectively grants Registeel two turns of Destiny Bond. Registeel is commonly used as a switch-in to -ate users, as it can often Recover off any damage that coverage moves do to it.</p> <h1>Team Options</h1> <p>Giratina pairs well with this set because of its typing and bulk, which allow it to take hits that would often KO Registeel. Imposter Chansey can scout out what coverage moves the foe has before determining if Registeel can safely switch in. Additionally, setup sweepers that are Imposter resistant such as Poison Heal Kyogre and Mega Gyarados often have issues with Topsy-Turvy.</p> "
      },
      {
        "name": "RegenVest Pivot",
        "description": "<h1>Moves</h1> <p>A slow U-turn is a terrific move for pivoting and predicting switches. Metal Burst lets Registeel punish attackers such as Kyogre that are able to do a lot of damage but cannot OHKO it. Clear Smog lets Registeel stop setup sweepers and discourage foes from boosting to KO it. Nuzzle allows Registeel to cripple opposing sweepers by reducing their Speed significantly. It pairs well with Knock Off because if an opposing Poison Heal user loses its Toxic Orb to Knock Off, its teammates are discouraged from using Aromatherapy. Knock Off provides other utility as well, easily removing Eviolite or other useful items from your opponent's Pokemon.</p> <h1>Set Details</h1> <p>The chosen EVs and nature along with Assault Vest allow Registeel to have very strong mixed defenses, enabling it to take powerful attacks with ease. Its Speed is minimized to underspeed other bulky pivots for momentum gaining with U-turn, and to make Metal Burst go last more often. Alternatively, a more specially defensive spread can be used in order to provide added insurance against strong special attackers with moves like Earth Power and Magma Storm.</p> <h1>Usage Tips</h1> <p>This Registeel set can often switch into strong resisted or neutral attacks. Because of this, it works well as a scout for moves for teams without an Imposter user such as Chansey. It also works well as a switch-in to -ate users because it is bulky enough to shrug off their STAB moves and can use Metal Burst against coverage moves. Losing its Assault Vest to Knock Off reduces the bulk of this set significantly, so make sure to play carefully around Pokemon that commonly run this move, such as Yveltal and Mega Tyranitar. When Registeel gets low on health, it's a good idea to use U-turn or switch out so that Regenerator heals it. Additionally, when Registeel is brought in against a foe that it walls, it's often safe to U-turn out, predicting the switch. Knock Off is most useful against Poison Heal users to discourage Aromatherapy and against Chansey to remove its Eviolite. If it has Clear Smog, Registeel can switch into Poison Heal Kyogre often and prevent it from boosting.</p> <h1>Team Options</h1> <p>Giratina pairs well with Registeel because its typing complements Registeel's. Generally speaking, this set works well on teams with Pokemon that it walls, because then it's unnecessary to take Imposter users into account when teambuilding.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Piccolo Daimao", "user_id": 219853}], "teams": [{"name": "Quality checked by", "members": [{"username": "E4 Flint", "user_id": 203690}, {"username": "Uselesscrab", "user_id": 167744}]}, {"name": "Grammar checked by", "members": [{"username": "Electrolyte", "user_id": 148071}, {"username": "Empress", "user_id": 175616}, {"username": "Lumari", "user_id": 232216}]}]}
  },
  "Latios": {
    "overview": "<p>With Soul Dew boosting its Special Attack and Special Defense to sky-high levels, Mega Latios is a powerhouse in the Balanced Hackmons metagame. Its good Dragon / Psychic typing gives it handy resistances to common offensive types such as Fire, Water, and Fighting. By holding a Soul Dew, Mega Latios has an easier time getting past Imposters, but it doesn't make Mega Latios completely Imposter-proof. However, due to its subpar physical bulk, Mega Latios has trouble getting past Pixilate and Refrigerate users, both of which it is weak to, and is very vulnerable to Knock Off due to its reliance on Soul Dew.</p> ",
    "comments": "<h1>Other Options</h1> <p>Protean Mega Latios has many other viable moves that it can run, such as Boomburst, Volt Switch and Steam Eruption, but they are generally not as useful, as they do not have as much coverage. Mega Latios can also run a bulky Quiver Dance set that helps get past Imposter because the Soul Dew boost is not copied. Another possible set that Mega Latios can run is a Shell Smash + Stored Power set, which normally uses Shell Smash / Stored Power / Spacial Rend, but it's not as useful because Mega Latios struggles to find opportunities to set up and is also very Imposter weak. Finally, Mega Latios can run a Contrary set, using high-power moves such as Draco Meteor, Psycho Boost, and Overheat to constantly increase its Special Attack, but this set is very prone to Imposter users even with the Soul Dew boost, so it isn't used as much.</p> <h1>Checks and Counters</h1> <p><strong>Chansey: Imposter Chansey is a problem for Mega Latios because Latios gets KOed if Chansey wins the Speed tie. Non-Imposter variants also are a problem to deal with due to their stellar bulk after Eviolite boosts.</p> <p><strong>The ates</strong>: Pokemon that use the abilities Refrigerate and Pixilate threaten Mega Latios with boosted Fake Outs and Extreme Speeds which can KO Mega Latios due to its subpar physical bulk. Mega Rayquaza in particular is a major threat to non-King's Shield variants of Mega Latios.</p> <p><strong>Prankster Users: Pokemon that use Prankster, such as Registeel, can come in on a resisted hit and cripple Mega Latios by either putting it to sleep or decreasing its offenses with Parting Shot.</p> <p><strong>Regenerator + Assault Vest Users: Pokemon that use Regenerator + Assault Vest, such as Regirock and Registeel, can give Mega Latios problems as they are able to take a Special Attack and heal it off by switching out.</p> ",
    "sets": [
      {
        "name": "Protean",
        "description": "<h1>Moves</h1> <p>King's Shield allows Mega Latios to scout for moves and punish physical attackers with an Attack drop. It also changes Mega Latios's type to Steel, which helps it deal with the -ate abilities better, as it resists all three of them. Moonblast and Earth Power have great coverage together, hitting many common Pokemon such as Registeel, Rayquaza, and Giratina very hard. Magma Storm, being a partial trapping move, helps Mega Latios deal with Sturdy Shedinja, but the move has shaky accuracy. Seed Flare is another option which can be used to hit Primal Kyogre super effectively.</p> <h1>Set Details</h1> <p>Maximum Special Attack investment considerably heightens Mega Latios's firepower when combined with the Soul Dew. Maximum Speed investment with a Timid nature is important to Speed tie with other threats with base 110 Speed such as Mega Diancie. Protean gives Mega Latios a STAB boost on all its moves. Protean also allows Mega Latios to switch types to resist certain moves, most notably with King's Shield for the -ates.</p> <h1>Usage Tips</h1> <p>Faster threats such as Mega Mewtwo Y, Mega Mewtwo X, Mega Gengar, and Mega Rayquaza should be removed before Mega Latios enters the field, as they pose a huge threat to it. Be wary of Knock Off, even from defensive Pokemon, as it removes Mega Latios's Soul Dew, which leaves it very underpowered. Also be sure that all Imposter Pokemon are gone before bringing Mega Latios in, as they can win a Speed tie and KO even when weakened.</p> <h1>Team Options</h1> <p>Seeing as some of the threats to Mega Latios are the -ate users, it's good to have a Steel- type such as Registeel or Aegislash to check them. Pokemon capable of checking Imposter users such as Illusion lures, -ate users, Mega Gengar, and Hoopa-U are appreciated because it's risky for Mega Latios to take them on. In case Mega Latios is KOed by an Imposter user, it's important to have a check for Protean Mega Latios. Pokemon such as non-Imposter Chansey are very helpful for such a scenario.</p> "
      },
      {
        "name": "Tinted Lens",
        "description": "<h1>Moves</h1> <p>Draco Meteor hits a huge majority of the tier for massive damage. Psystrike helps with getting around specially bulky Pokemon such as Primal Kyogre, Ho-Oh, and non-Imposter Chansey by hitting them based on their weaker Defense. Volt Switch is essential for keeping momentum on your side and hits decently hard even after a Special Attack drop from Draco Meteor. King's Shield is useful for scouting moves, while Magma Storm can be used to get past Shedinja.</p> <h1>Set Details</h1> <p>Maximum Special Attack and Speed investment with a Timid nature ensures that Mega Latios can hit as hard as possible while Speed tying with other Pokemon with base 110 Speed such as Mega Diancie. Tinted Lens gives Mega Latios unresisted coverage between its two STAB moves. Soul Dew provides a Choice Specs boost without locking Mega Latios into a move while also increasing its Special Defense.</p> <h1>Usage Tips</h1> <p>Most of the time Draco Meteor is the move of choice, as, with Tinted Lens, it is nearly impossible to switch into without something getting KOed or severely crippled. Be wary of Pokemon that carry Knock Off, even defensive ones such as Giratina, as losing Soul Dew's buffs is something Mega Latios does not appreciate. More often than not switching Mega Latios in is risky, so creating free switches by using moves such as U-turn or Volt Switch is optimal so that Mega Latios does not take unnecessary damage</p> <h1>Team Options</h1> <p>Imposter Chansey and Steel-types such as Registeel and Aegislash are very helpful as they can check some of Mega Latios's biggest threats, the -ate users. Entry hazard setters also pair well with Mega Latios because they help it wallbreak by punishing switch-ins with residual damage or status. Pokemon that can give Mega Latios free switches are also good partners, such as U-Turn Registeel and Baton Pass Shedinja. Lastly, be sure to have a check for Mega Latios in case of opposing Imposter users. -ate Pokemon or faster attackers such as Mega Mewtwo X are good for this purpose.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Hack_Guy", "user_id": 242885}], "teams": [{"name": "Quality checked by", "members": [{"username": "Piccolo Daimao", "user_id": 219853}, {"username": "MAMP", "user_id": 225453}, {"username": "Uselesscrab", "user_id": 167744}]}, {"name": "Grammar checked by", "members": [{"username": "Malley", "user_id": 243195}, {"username": "GatoDelFuego", "user_id": 91628}]}]}
  },
  "Kyogre": {
    "overview": "<p>Kyogre is the most specially bulky Water-type in Balanced Hackmons that is also capable of dealing high damage. With some investment in bulk, it is capable of surviving almost any unboosted move in the metagame, which gives it the opportunity to set up quite reliably. It is one of the best Scald users in the metagame due to its base 150 Special Attack and STAB and only faces some competition from Palkia, which has a better offensive typing anyway due to its secondary Dragon typing; however, Kyogre has better defensive typing and superior bulk. Kyogre's decent defensive typing allows it to switch into many of the commonly used special moves in the game, such as Blue Flare, Steam Eruption, and Ice Beam. Kyogre's typing leaves it with only two weaknesses, Electric and Grass, both of which are not too common in the metagame. Kyogre additionally takes neutral damage from Aerilate- and Pixilate-boosted moves and resists Ice, which allows it to take even a Boomburst from any -ate user and proceed to retaliate. Kyogre also has a good offensive typing, as Water-type moves are only resisted by Water-, Dragon-, and the uncommon Grass-types. As a result, Kyogre is already Imposter-resistant because it resists its own type. Kyogre is, however, held back by its lower Defense. Kyogre's Speed stat also hinders it, as it needs to boost to at least +2 to outspeed relevant threats in the metagame such as Mega Gengar, Mega Mewtwo X, Mega Mewtwo Y, and Mega Rayquaza without any Speed investment.</p> ",
    "comments": "<h1>Other Options</h1> <p>Freeze Dry can be used for Ice-type coverage at the expense of losing some power; it can, however, help Kyogre deal with Water-types such as Palkia, Mega Gyarados, and Mega Swampert more easily. It also does not make Kyogre terribly weak to Imposter users either, as Freeze Dry does not do much damage when uninvested. Freeze Dry is, however, a liability against the uncommon Lucky Punch Imposter Chansey, as critical hits ignore all positive stats changes of the foe. King's Shield can also be replaced with Spiky Shield so that Kyogre does not need a slow pivot support to activate Toxic Orb, though this comes at the expense of not being able to potentially weaken physical attackers with King's Shield. Spore can be used instead in the fourth moveslot to put foes to sleep. This helps Kyogre defeat some threats such as Mega Latios, Mega Latias, Fur Coat Chansey, and Primal Groudon, none of which are easily KOed and can hit Kyogre hard in return (with the exception of Chansey). Dark Void may also be used to hit walls holding Safety Goggles at the expense of having a bit less accuracy. Infestation can be used instead of Leech Seed to be able to still defeat Shedinja while also being able to trap unsuspecting switch-ins. Water Spout and Steam Eruption are alternatives to Scald that are Imposter-proof and also deal more damage at the expense of having many fewer PP. Water Spout has the disadvantage of being HP-reliant, so Kyogre must be kept at high HP for it to remain effective. Taunt, another option for the fourth moveslot, helps Kyogre defeat walls that normally force it out with utility moves such as Topsy-Turvy and Whirlwind, but it also has the disadvantage of making Kyogre a bit more vulnerable to Imposter users. Fur Coat is also an option for Kyogre, as it greatly helps in patching up its weaker Defense stat and can be used to deal with -ate users such as Mega Rayquaza and Mega Diancie. RegenVest takes advantage of Kyogre's high Special Defense and makes it a great special wall, neutral to many attacks. In this case, Quiver Dance should be replaced with a pivoting move such as Volt Switch and the fourth move should be changed to Night Shade, Nuzzle, or Dragon Tail, while Moonblast is preferred for the third move.</p> <h1>Checks and Counters</h1> <p><strong>Strong Physical Attackers: Powerful physical foes such as Mega Mewtwo X and Kyurem-B can easily KO Kyogre with a strong coverage move such as Bolt Strike.</p> <p><strong>Prankster Walls: Walls such as Registeel and Giratina can ruin Kyogre's attempts at setting up with moves such as Encore, Topsy-Turvy, and Heart Swap, but they risk getting burned by Scald.</p> <p><strong>Unaware Walls: Unaware users such as Mega Audino can phaze Kyogre while ignoring its boosts, but they risk getting burned by Scald.</p> <p><strong>Faster Special Wallbreakers: Wallbreakers such as Mega Mewtwo Y and Mega Sceptile can threaten Kyogre before it sets up and force it out.</p> <p><strong>Primal Groudon: Primal Groudon completely shuts Kyogre down with Desolate Land and can deal large amounts of damage to it.</p> <p><strong>Mega Latios and Mega Latias</strong>: Mega Latios and Mega Latias can take Ice Beams pretty well thanks to Soul Dew and can hit Kyogre on its weaker defensive side with STAB Psystrikes.</p> <p><strong>Bulky Poison Heal Users</strong>: Poison Heal users such as Kyogre and Giratina are extremely hard to defeat, and Kyogre requires many boosts to be able to break them, especially if they carry phazing moves such as Whirlwind.</p> ",
    "sets": [
      {
        "name": "Poison Heal",
        "description": "<h1>Moves</h1> <p>Quiver Dance boosts Kyogre's already high Special Attack and Special Defense stats along with its Speed. Scald is preferred over Steam Eruption because it has much higher PP, and as a result, it can be spammed to spread burns. Scald is also useful against Imposter users because their moves will have 5 PP each. Scald burns weaken physical attackers, making up for Kyogre's low Defense, and it also wears down walls that Kyogre cannot easily defeat, such as Giratina and Fur Coat Chansey. The third moveslot is dedicated to either an Ice- or Fairy-type coverage move or Leech Seed. Ice Beam has 100% accuracy and can KO Dragon-types and OHKO Mega Rayquaza without any prior boosts, while Moonblast can defeat Water-types such as Palkia and Mega Gyarados. Moonblast, though, does have the disadvantage of having a chance to lower Kyogre's Special Attack if an Imposter user uses it and also makes Kyogre vulnerable to Lucky Punch Imposter Chansey. Leech Seed can be used to deal with Shedinja and to defeat Imposter users such as Chansey and Blissey since they have higher HP than Kyogre. King's Shield enables Kyogre to be able to defeat -ate users in addition to giving a free turn of passive recovery from Poison Heal. It also allows Kyogre to scout for the foe's moveset but does not block status such as sleep and burn from moves such as Spore and Will-O-Wisp if Toxic Orb has not been activated yet. Leech Seed is also a good option for this moveslot if a coverage move was selected for the third moveslot.</p> <h1>Set Details</h1> <p>Toxic Orb allows Kyogre to activate Poison Heal, which prevents status conditions and also provides passive recovery. 248 EVs are invested into HP to increase Kyogre's longevity and minimize Stealth Rock damage taken. A Bold nature along with 80 Defense EVs allows Kyogre to survive the Fake Out + Extreme Speed combination from Aerilate Mega Rayquaza with Sky Plate without even using King's Shield (after Poison Heal Recovery). Alternatively, a Modest nature along with 40 Defense EVs can be run if King's Shield is chosen as one of the moves to ensure surviving an Extreme Speed from a Life Orb Mega Rayquaza. The other 40 EV points can either be dumped into Special Attack or Special Defense. 180 Special Defense EVs guarantees that Kyogre will survive a Boomburst from a Life Orb Mega Rayquaza without fainting. A more offensive spread such as 248 HP / 40 Def / 72 SpA / 148 Spe can also be used with a Timid nature (preferably alongside King's Shield) to enable Kyogre to outspeed up to positive-natured Mega Mewtwo Y after a single Quiver Dance boost.</p> <h1>Usage Tips</h1> <p>Bring Kyogre in with a slow pivot to safely activate Poison Heal. This is absolutely crucial because Kyogre cannot afford to lose its Toxic Orb via moves such as Knock Off and Trick or get statused. Kyogre can easily set up on walls after activating Poison Heal; however, be wary of Trick users, as they can easily cripple Kyogre by tricking a Choice item onto it. Use Scald to burn walls that will use a phazing move to get some chip damage on them and wear them down. King's Shield should be used to weaken physical attackers, get a free turn of passive recovery, or scout for movesets. Be wary of opponents that could predict this and take that opportunity to set up. Kyogre can be brought in on walls such as Giratina or even bulky attackers such as Mega Tyranitar to set up; however, make sure that Toxic Orb has already been activated so that Kyogre does not risk getting statused. Leech Seed, the primary way of dealing with Shedinja, should also be used to defeat Imposter users, as their HP is higher than Kyogre's. Try to use Kyogre in the late-game after your wallbreakers have weakened the opponent's walls to set up and sweep. Setting up in the early-game mostly results in Kyogre being forced out, so it is better to just go for Scald burns early on.</p> <h1>Team Options</h1> <p>Kyogre appreciates wallbreakers such as Mega Latios, Mega Mewtwo X, and -ate users such as Mega Rayquaza to break down walls, as Kyogre is easily forced out by most of them. Kyogre also requires some support to be able to defeat Primal Groudon, which can set up on this set. Bulky attackers such as Mega Garchomp and Mega Swampert are good offensive answers, while physical walls such as Fur Coat Giratina and Mega Slowbro are more defensive approaches. Additionally, defensive Pokemon such as Giratina and Mega Slowbro can help deal with the physical attackers that Kyogre normally has trouble with.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "morogrim", "user_id": 276906}], "teams": [{"name": "Quality checked by", "members": [{"username": "nyan kat", "user_id": 256353}, {"username": "E4 Flint", "user_id": 203690}, {"username": "Uselesscrab", "user_id": 167744}]}, {"name": "Grammar checked by", "members": [{"username": "queez", "user_id": 229690}, {"username": "Haund", "user_id": 193885}]}]}
  },
  "Groudon": {
    "overview": "<p>Groudon is one of the bulkiest Ground-type Pokemon in Balanced Hackmons, and it is capable of both taking and dealing large amounts of damage thanks to its versatile defensive and offensive capabilities. When equipped with a Red Orb, Groudon can transform into Primal Groudon, which is otherwise banned from the metagame due to its incredible power. This gives it several advantages over other tanky Ground-types, including immunity to burns and Water-type attacks and the ability to check Mega Diancie thanks to a resistance to Fairy-type moves. However, Groudon faces competition both from Mega Swampert, as a bulky attacker and even in some defensive roles as a result of the latter's Water typing, and from Mega Garchomp, which has higher Attack and gets STAB on Dragon-type moves.</p> ",
    "comments": "<h1>Other Options</h1> <p>Choice Scarf and Choice Band Adaptability sets remain a viable option, due to the lack of Pokemon that resist Thousand Arrows, though they are generally better employed by the stronger Mega Garchomp, which also has a second STAB on Dragon-type moves. Poison Heal Coil and Shift Gear sets are also very viable, but they must be specialized to be able to deal with Imposter foes through the use of moves like Leech Seed or Sacred Fire. Red Orb Groudon can also run Draco Meteor to help it better defeat its most common counter, Giratina; this also makes the Special Attack boosts that Download may provide more useful. Since this set is difficult to counter, one must also run a Primordial Sea Fairy-type Pokemon like Mega Audino or Xerneas to defeat Imposter users. Soundproof is also an option on regular Groudon, since Groudon's Defense allows it to easily take Fake Out and Extreme Speed from -ate ability users and Soundproof provides a Boomburst immunity. It's important to scout for Techno Blast, however. Groudon is a rather weak Soundproof user, however, since it has no answer to Refrigerate Kyurem-B or Kyurem-W.</p> <h1>Checks and Counters</h1> <p><strong>Strong Special Attackers: Strong special moves such as Boomburst from Aerilate Mega Rayquaza can OHKO Groudon due to its below-average Special Defense. Other common users of this move are Pixilate Mega Diancie, Arceus, and Mega Gengar.</p> <p><strong>Fur Coat Users: Physically bulky Fur Coat users like Giratina and opposing Groudon often have more than enough bulk to counter offensive Groudon sets.</p> <p><strong>Strong Water- and Ice-type Attacks</strong> Water- and Ice- type attacks, especially special ones like Steam Eruption or Origin Pulse and Ice Beam, respectively, can easily defeat Groudon. In addition, Scald and Steam Eruption can inflict burns on non-poisoned Groudon if it survives, crippling it for the rest of the match.</p> <p><strong>Primordial Sea</strong>: On Pokemon like Mega Rayquaza, this ability can be used to completely shut down Primal Groudon. Primordial Sea Mega Rayquaza is immune to both Fire- and Ground-type moves and can thus only be hit by obscure coverage (e.g. Draco Meteor) and U-turn. It can then easily KO Primal Groudon with a rain-boosted (for pseudo-STAB) Water-type move. Primordial Sea is also occasionally used on Kyogre (often with Blue Orb), which can check, if not counter, Primal Groudon.</p> ",
    "sets": [
      {
        "name": "Red Orb",
        "description": "<h1>Moves</h1> <p>V-create is an incredibly powerful STAB move but comes at the cost of a Defense, Special Defense, and Speed drop; however, the OHKO potential is usually worth it. Sacred Fire is a good alternative option because it does not lower Primal Groudon's stats and can burn the foe; this residual damage is very useful against Giratina and Mega Slowbro, whose Poison Heal sets are particularly crippled if their Toxic Orb has not yet been activated. Thousand Arrows has neutral coverage on the whole metagame, and it is a more spammable move than V-create. Precipice Blades is an alternative option for more damage, and it also can be used to better deal with Imposter users because one's own Flying-types do not have to worry about the Smack Down effect that is a component of Thousand Arrows. U-turn can be used to gain momentum and slowly wear down Primal Groudon's counters. Synthesis is a recovery move that benefits greatly from Desolate Land, enabling Groudon to heal 2/3 of its HP, at the cost of having only 8 PP. Stealth Rock and other support moves can be run effectively in Primal Groudon's last moveslot.</p> <h1>Set Details</h1> <p>Holding Red Orb is currently the only way to access Primal Groudon due to Primal Groudon's ban. 252 Attack EVs and a boosting nature make Primal Groudon hit as hard and possible, and maximum HP investment makes Primal Groudon as bulky as possible, while 8 Speed EVs allow it to outspeed Pokemon of the same base Speed with 0 or 4 Speed EVs. Download can boost Groudon's Attack once before Red Orb triggers; however, Primal Groudon must be switched into a Pokemon whose Special Defense is higher than its Defense, or else Download will provide a useless Special Attack boost. Intimidate is an alternative that can be used to force out fast physical attackers like Mega Mewtwo X. Primal Groudon's ability after Primal Reversion is Desolate Land, which provides a boost to Fire-type moves and a Water immunity.</p> <h1>Usage Tips</h1> <p>V-create should be used carefully because it has few PP and Groudon is often forced to switch after using it as a result of the stat drops. Thousand Arrows is Primal Groudon's primary means of attacking, and zero relevant Pokemon resist it thanks to its inherent Smack Down effect. U-turn is highly useful, as momentum and scouting are extremely important elements of Balanced Hackmons, and U-turn provides both. Burns from Sacred Fire help Primal Groudon wear down its checks and counters, like Mega Slowbro, faster. Stealth Rock is ideally used on the switch, but be careful of Magic Bounce from random defensive Pokemon. Primal Groudon generally can safely switch into passive walls such as Registeel and Regirock. If possible, try to scout the foe's abilities first, as Levitate and Flash Fire, for instance, can be devastating to Primal Groudon under certain circumstances.</p> <h1>Team Options</h1> <p>Mega Rayquaza is an excellent partner for Primal Groudon, as they can beat each other's counters. Mega Rayquaza can eliminate Giratina and Mega Slowbro, while Primal Groudon can significantly damage Steel-types and Fur Coat Chansey, both of which inconvenience Mega Rayquaza. Mega Gengar beats both of Primal Groudon's main counters, Mega Slowbro and Giratina; however, it is not a great switch-in due to its low bulk. It is highly recommended you run a counter to Primal Groudon on your team, such as Mega Slowbro or Giratina, so that Imposter users cannot exploit your set.</p> "
      },
      {
        "name": "Defensive",
        "description": "<h1>Moves</h1> <p>Thousand Arrows is the best STAB option and pressures frail Pokemon. Thousand Waves is an alternative STAB option that can trap the foe, but it cannot hit Flying-type Pokemon. U-turn gains momentum, and it can slowly wear down Groudon's switch-ins. Reliable recovery is essential to all walls and other defensive Pokemon in Balanced Hackmons, so make sure you run Recover or one of its clones. Stealth Rock and other team support moves can be run effectively in Groudon's last moveslot. Leech Seed can siphon HP from the foe (a function that is particularly useful against Imposter Chansey, which has a high HP stat) and KO Sturdy Shedinja.</p> <h1>Set Details</h1> <p>The given EV spread makes Groudon as physically bulky as possible in order to minimize damage from moves such as Mega Mewtwo X's V-create. Safety Goggles protects Groudon from Spore and other powder moves and, less importantly, Hail. Toxic Orb is used to trigger Poison Heal, which gives Groudon additional recovery and turns Groudon into a means of blocking status.</p> <h1>Usage Tips</h1> <p>Groudon is an excellent counter to Tyranitar, Regigigas, and Mega Mewtwo X. These Pokemon frequently trouble Registeel + Giratina cores, making Groudon a good supplemental option. While unlikely, it is possible for fast special attackers like Mega Mewtwo Y to carry Water- or Ice-type coverage, which may be able to beat Groudon, so scouting is recommended if possible. Poison Heal is preferred for countering Tyranitar and Regigigas because these sweepers often carry Knock Off and status-inflicting moves such as Sacred Fire and Spore, neither of which matters much provided that Toxic Orb has already been activated, so it is important to get Poison Heal Groudon a safe switch so that it can be badly poisoned.</p> <h1>Team Options</h1> <p>Giratina can switch into highly threatening Water- and Grass-type attacks for Groudon. Gengar can check Mega Slowbro and Giratina. Chansey can deal with several of the strong specially attacking threats that can threaten defensive Groudon sets. Chansey's Imposter set is also very helpful for scouting for coverage moves that might threaten Groudon, such as the aforementioned uncommon Water- and Ice-type moves from Mega Mewtwo Y. Registeel is a good counter to Pokemon with -ate abilities, which can easily threaten Groudon with Boomburst.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Kingslayer2779", "user_id": 231877}], "teams": [{"name": "Quality checked by", "members": [{"username": "Piccolo Daimao", "user_id": 219853}, {"username": "E4 Flint", "user_id": 203690}, {"username": "nyan kat", "user_id": 256353}]}, {"name": "Grammar checked by", "members": [{"username": "Haund", "user_id": 193885}, {"username": "P Squared", "user_id": 168392}]}]}
  },
  "Rayquaza": {
    "overview": "<p>Mega Rayquaza's excellent mixed offenses and STAB on the type with the best neutral coverage in the game allow it to utilize a variety of sets effectively. The most common Mega Rayquaza sets utilize powerful priority attacks with the ability Aerilate to boost priority moves' power or the ability Gale Wings to increase its Flying-type moves' priority, making Mega Rayquaza an excellent revenge killer; additionally, Mega Rayquaza can also work well as a wallbreaker or setup sweeper, and it can use less common but still effective sets such as Contrary to surprise common walls and sweep. However, Mega Rayquaza is commonly walled by nearly anything that its Flying STAB type is not very effective against and is commonly accounted for during teambuilding, although common walls may be countered with certain coverage moves. Mega Rayquaza also lacks a reliable way to keep healthy throughout the match, as well as being a common target for Imposter Pokemon. Regardless, Mega Rayquaza should be considered for any hyper offensive or balanced team due to its versatility and ability to perform several roles effectively.</p> ",
    "comments": "<h1>Other Options</h1> <p>Physical Gale Wings Mega Rayquaza with Dragon Ascent is another option that does not take up your -ate slot and can still do massive damage with a priority STAB move. Another possible option is Contrary Mega Rayquaza, which has the opportunity to surprise its common checks and counters with moves like V-Create, Overheat, and Leaf Storm. However, it still struggles against Chansey and Shedinja; with a Choice Scarf, Mega Rayquaza may be able to handle Chansey but only if predicted correctly. Mega Rayquaza also has several other options for its Aerilate set. One possible option is swapping the Attack and Special Attack EVs for more power for Boomburst, although this weakens the power of Fake Out and Extreme Speed. Mega Rayquaza may also change its fourth moveslot to Infestation to consistently beat Shedinja, or Precipice Blades, Low Kick, or Thousand Arrows to hit common switch-ins to Mega Rayquaza super effectively, although an Imposter counter must be chosen appropriately. Finally, Mega Rayquaza may run Choice Scarf with Aerilate to have a fast Boomburst. If this is run, Trick is an excellent option to cripple switch-ins. Pivot moves such as Volt Switch are also excellent choices, as Mega Rayquaza does not mind the Choice item when using those.</p> <h1>Checks and Counters</h1> <p><strong>Mega Diancie: Mega Diancie is a significant threat to Mega Rayquaza, as Mega Diancie resists both of Mega Rayquaza's STAB moves and can threaten it with a super effective Pixilate Extreme Speed.</p> <p><strong>Physically Bulky Soundproof Pokemon</strong>: Physically bulky Soundproof users such as Mega Slowbro and Arceus can tank Aerilate Mega Rayquaza's Fake Out and Extreme Speed and are not affected by Boomburst.</p> <p><strong>Registeel and Aegislash: With a resistance to Flying, Steel-type tanks can switch into any attack and may not even be KOed by coverage moves. Additionally, sets running Levitate, Flash Fire, and Prankster may counter any one variant of Mega Rayquaza.</p> <p><strong>Shedinja</strong>: If Mega Rayquaza lacks a way to beat Shedinja, Shedinja can consistently switch in to take in Mega Rayquaza's attacks and threaten to use Endeavor or gain momentum by pivoting into another Pokemon.</p> <p><strong>Pokemon with King's Shield</strong>: Offensive Pokemon with King's Shield such as Mega Mewtwo Y can use King's Shield to harshly lower Mega Rayquaza's Attack upon contact to potentially force Mega Rayquaza to switch out or risk taking an attack.</p> ",
    "sets": [
      {
        "name": "Standard Aerilate",
        "description": "<h1>Moves</h1> <p>The high priority of Fake Out and Extreme Speed, coupled with Extreme Speed's decent power, allows Mega Rayquaza to almost always hit hard before the opponent moves. Fake Out, which is boosted by Aerilate and STAB, gets free damage due to the 100% flinch chance and can be followed up by Extreme Speed to deal good damage to anything that does not resist it. However, King's Shield can replace Fake Out to scout the opponent's moves and punish Pokemon using contact moves. Mega Rayquaza's third move slot is Boomburst, which 2HKOes practically anything that does not resist it and hits through Substitute, although it is blocked by Soundproof. If Soundproof is a worry, Techno Blast can be used instead, but Techno Blast has fewer PP and less power and doesn't bypass Substitutes. For Mega Rayquaza's final moveslot, King's Shield may be used to prevent revenge killers from KOing it and to scout the opponent's moveset; however, be wary when using King's Shield, as it does not protect from status moves. Alternatively, Magma Storm can be used to hit Steel-types super effectively while also KOing Sturdy Shedinja on the switch. Spore can also be used to put a foe to sleep. However, this makes Mega Rayquaza susceptible to Magic Bounce users; Safety Goggles may be used to overcome this drawback.</p> <h1>Set Details</h1> <p>Mega Rayquaza has maximum EVs in Attack and Speed to outspeed or Speed tie with other Mega Rayquaza and maximum Speed Mega Diancie while also dealing maximum damage with Fake Out and Extreme Speed. The final 4 EVs are invested into Special Attack to deal slightly more damage with Boomburst. A Hasty Nature allows Mega Rayquaza the most offensive capability with maximum Speed. Mega Rayquaza may also alter its EVs to favor Special Attack, changing its role from a priority-using revenge killer into a wallbreaker. Aerilate, which turns Mega Rayquaza's Normal-type moves into boosted Flying-type STAB moves, is the chosen ability to provide powerful Flying-type priority attacks. Sky Plate can be used to boost all of Mega Rayquaza's STAB attacks without any drawbacks. Safety Goggles is another option to avoid being hit by Spore, which is commonly found on a Prankster Steel-types. Safety Goggles also complements Mega Rayquaza's own Spore, as it prevents Mega Rayquaza from being put to sleep if it uses Spore on a Pokemon with Magic Bounce.</p> <h1>Usage Tips</h1> <p>Mega Rayquaza should use Fake Out and Extreme Speed if the foe can outspeed or outprioritize it otherwise, while Boomburst is the preferred option for wallbreaking against slower teams. However, due to the abundance of King's Shield in the metagame, Boomburst can be used over Fake Out or Extreme Speed if the foe is suspected to have King's Shield. Moves such as U-turn, Volt Switch, Baton Pass, and Parting Shot are useful for bringing in Mega Rayquaza safely, as it is relatively frail and does not appreciate taking unnecessary damage.</p> <h1>Team Options</h1> <p>As Mega Rayquaza is weak to other common Fake Out and Extreme Speed users such as Kyurem-B and Mega Diancie, a Steel-type such as Registeel or Aegislash that resists both of these Pokemon's STAB moves is a vital teammate. These two Steel-types can also counter to Pokemon with Imposter that have transformed into Mega Rayquaza. A way to beat Shedinja is necessary, as Mega Rayquaza cannot break Shedinja unless it has Magma Storm, which is unreliable. Effective ways to deal with it are entry hazard support and Pokemon with a combination of Mold Breaker and Pursuit. Mega Rayquaza also appreciates hazard removal and cleric support through Pokemon such as Mega Audino and Registeel, as Mega Rayquaza is weak to Stealth Rock and is crippled by burns, which makes its priority attacks nearly useless. Mega Rayquaza also appreciates hazard setters such as Giratina and Deoxys-S, as Mega Rayquaza usually forces a lot of switches. Pokemon that can remove Steel-types, such as Mega Mewtwo X and Red Orb Groudon, are also necessary to eliminate some of Mega Rayquaza's most common checks.</p> "
      },
      {
        "name": "Choice Specs Wallbreaker",
        "description": "<h1>Moves</h1> <p>Boomburst is Mega Rayquaza's strongest move; with the boosts from Aerilate, STAB, and Choice Specs, it is able to 2HKO almost every Pokemon in the game, including Chansey and specially defensive Aegislash, with no drawbacks and the added bonus of hitting through Substitute, making it really hard to switch into and even impossible without a Pokemon that resists Flying or has Soundproof. The next moves aim to patch up these weaknesses, with Techno Blast being able to OHKO physically defensive Soundproof users such as Mega Slowbro and Groudon while still hitting everything else extremely hard and having no drawbacks. Ground coverage is necessary to get past some bulky Rock-types, the main target being RegenVest or Sand Stream Mega Tyranitar, but it is also really useful for Prankster Registeel as well as RegenVest Zekrom and Mega Ampharos that can otherwise switch on Choice Specs Rayquaza and OHKO it back. Secret Sword can be used over Precipice Blades to guarantee an OHKO on Mega Tyranitar, which might be able to recover its health throughout the battle otherwise, especially if it's running Regenerator. In that case, Draco Meteor should be used over Techno Blast, as it still reliably OHKOes common Soundproof users but also hits RegenVest Zekrom and Mega Ampharos. Draco Meteor can also OHKO specially defensive Giratina before it can cripple Rayquaza with status or retaliate with Metal Burst, but the move forces Rayquaza out once used, potentially allowing a Pokemon to set up, and therefore it isn't as easy to use as Techno Blast. Extreme Speed is used so that Rayquaza keeps some of the revenge killing capabilities of standard Aerilate sets, as even without a boost, it hits extremely hard against frailer or weakened Pokemon. It can be replaced with additional coverage, mainly Volt Switch, which allows you to scout the opponent's move as well as weaken potential counters or, in the case of Shedinja, remove them with the support of a Mold Breaker Pursuit trapper. However, Volt Switch does have the negative effect of giving Imposter Chansey momentum. Trick is another option to permanently cripple a wall that Rayquaza might not be able to break or to just ease up prediction in a battle where the boost from Choice Specs isn't needed; it should be used carefully and only as a last resort, as Rayquaza's item is what makes it so threatening, and it becomes significantly easier to handle without it. Finally, Magma Storm can be used as a way to provide Rayquaza with additional coverage and a way to deal with Shedinja. It also prevents foes from switching out, which can help guarantee a 2HKO on Steel-types, but comes at the cost of low accuracy.</p> <h1>Set Details</h1> <p>Maximum Special Attack investment as well as a Special Attack-increasing nature is necessary to allow Rayquaza to properly break common switch-ins. Maximum Attack investment gives Extreme Speed as much power as possible. Aerilate turns Boomburst into a Flying-type move, giving it a staggering 273 Base Power coupled with Choice Specs, which boosts its power just enough to invalidate some of Rayquaza's most common switch-ins. Minimal Special Defense IVs can be used to punish Imposter Chansey harder if it switches into Rayquaza directly but will make Rayquaza a bit easier to revenge kill with special attacks. 56 Attack EVs can be moved to Speed to allow it to outpace 148+ Spe and 252 Spe Kyogre. If no physical move is chosen, Rayquaza can opt for a Modest nature with the Attack EVs moved into either Speed or bulk depending on the needs of the team. Another spread of 4 Atk / 252 SpA / 252 Spe with a Naive nature can be used to outspeed positive-natured base 110 Speed Pokemon such as Mega Latios, Mega Latias, and Mega Diancie, but Rayquaza then has significantly less power and relies much more on entry hazard support and chip damage to get the 2HKOs it needs.</p> <h1>Usage Tips</h1> <p>Boomburst is not only Rayquaza's strongest move but also its safest, as it has no drawbacks, it has high PP, and even if the opponent has a switch-in, they will be forced to recover. For these reasons, it's the move you should be clicking most of the time and start with if you're unsure of the opponent's play. Cases where you wouldn't want to click Boomburst mindlessly are if there's an obvious switch-in like Mega Slowbro on an -ate weak team or Zekrom, in which case aggressive predictions can really put the opponent under pressure from early-game. Additionally, a lot of teams don't have a switch-in to Choice Specs Rayquaza and might want to rely on Shedinja after Choice Specs has been revealed, in which case double switching into a Mold Breaker Pursuit trapper will really put them under pressure. A more defensive team with many pivots doesn't necessarily have to play aggressively, as they can bring Rayquaza in many times throughout the battle. Very rarely switch Rayquaza directly in unless you predict the opponent to switch or recover, as Rayquaza should avoid all kinds of status and most defensive Pokemon in Balanced Hackmons run a pivoting move, making switching in directly often useless. If Rayquaza runs Volt Switch, it's an extremely good way to scout and weaken your opponent's answers early-game as well as easily removing Shedinja with support from Mold Breaker Pursuit. When switch-ins have been removed, Rayquaza can just spam Boomburst.</p> <h1>Team Options</h1> <p>Imposterproofing is necessary as to avoid a countersweep from Imposter Chansey. The Imposter-countering method will depend completely on the chosen coverage, but either way, Chansey doesn't run Choice Specs, which makes it much more manageable. Fur Coat Chansey can counter Mega Rayquaza's Imposter no matter what coverage is used. Aegislash can counter any variant that runs Fighting coverage with relative ease, and Levitate Registeel can do the same with Ground. A way to beat Shedinja is necessary, so a Mold Breaker Pursuit trapper like Mega Mewtwo X, Giratina, or Mega Gengar is a good teammate. Mold Breaker Pokemon can also set Stealth Rock up without worrying about Magic Bounce, which raises Rayquaza's chance of 2HKOing specially defensive Registeel with Boomburst from 60% to 98%, easing prediction and making revenge killers such as opposing Rayquaza and Imposter Chansey take chip damage. A way to remove Stealth Rock from the field is also incredibly important, as Rayquaza is weak to Rock. A Pokemon that finds opportunities to switch in against most teams can usually use Defog reliably; Giratina, for example, checks most physical attackers and is able to use Defog. Steel-types and -ate checks, such as Registeel, Aegislash, and more specific Pokemon such as Magic Guard Ho-Oh and specially defensive Tyranitar, are also reliable Defoggers because of the prevalence of Rayquaza and Diancie in the metagame. RegenVest users such as Metagross and Zekrom can also use Rapid Spin but are less reliable due to Ghost-type Pokemon like Giratina being immune to Rapid Spin. A Magic Bounce Pokemon can also help at preventing hazards altogether, though a Defogger should still be run alongside it in case of a mispredict or Mold Breaker user. Ways to bait and beat Chansey are not at all necessary, but appreciated; these include bulky Pokemon with a trapping move that can make Chansey struggle to death, some Magnet Pull combination like the common Dialga + Xerneas core, or a Steel-type with Volt Switch and a Magnet Pull Ground-type.</p> "
      },
      {
        "name": "Special Gale Wings",
        "description": "<h1>Moves</h1> <p>Oblivion Wing is a strong Flying-type move that recovers Mega Rayquaza's HP, allowing Mega Rayquaza to run a Life Orb to compensate for the loss of power compared to Boomburst. It also allows Mega Rayquaza to effectively use Substitute to block incoming status and attempted use of Imposter, as the HP lost from using Substitute can be regained through Oblivion Wing. Tail Glow boosts Mega Rayquaza's Special Attack to drastic levels, allowing it to take down even some Pokemon that resist its attacks; with a Substitute and a single Tail Glow, Mega Rayquaza can OHKO Mega Diancie without fear of being knocked out by Extreme Speed or Fake Out. Magma Storm can be used to hit Steel-types that resist Oblivion Wing. Magma Storm can also KO Shedinja. Alternatively, Earth Power can be used to hit Steel- and Rock-types, both of which resist Oblivion Wing. However, Mega Rayquaza is unable to hit Shedinja with Earth Power and therefore requires the team to have another way of beating it.</p> <h1>Set Details</h1> <p>Gale Wings gives all of Mega Rayquaza's Flying-type moves +1 priority, allowing it to outprioritize most threats other than Fake Out and Extreme Speed users. Life Orb is used to increase the power of Oblivion Wing. Oblivion Wing restores HP, and counteracts the recoil from Life Orb. Alternatively, Leftovers can be used to allow Mega Rayquaza to set up more Substitutes. Maximum Special Attack and Speed investment allows Mega Rayquaza to hit as hard and as fast as possible. Modest is preferred to maximize Special Attack, but Timid can be used to outspeed other Gale Wings Mega Rayquaza.</p> <h1>Usage Tips</h1> <p>Try to bring in Mega Rayquaza on something it can force out in order to set up Substitute or Tail Glow. Be wary setting up when the opponent still has a Pokemon with higher-priority moves or a tank that resists Oblivion Wing, as these can often force Mega Rayquaza out. Due to Substitute blocking Transform and Imposter, Substitute is generally the best choice if the opponent still has an Imposter in the back. Only attempt to sweep when anything that can check Mega Rayquaza at +3 Special Attack has been removed.</p> <h1>Team Options</h1> <p>Imposter Chansey is a common switch-in to Mega Rayquaza. Therefore, a powerful special tank or an Unaware user such as Cresselia is vital to prevent it from sweeping. If Earth Power is used over Magma Storm, Shedinja is another option to take on Chansey as well as to beat Mega Diancie. This set appreciates entry hazard removal from Pokemon like Registeel and Giratina to avoid taking unnecessary amounts of damage from switching in. Mega Rayquaza also appreciates having hazards on the opponent's side of the field through Pokemon such as Giratina and Deoxys-S, as entry hazards prevent Shedinja from switching in. Steel-type tanks such as Registeel and Aegislash are useful to take attacks from Pokemon with the abilities Pixilate and Refrigerate using Fake Out and Extreme Speed. Shedinja should still be accounted for, even if Magma Storm is run, and can be checked by a Mold Breaker Pursuit user or the aforementioned hazards. This Mega Rayquaza set is not threatened as much by status, as Substitute blocks most of it, but because it tends to stay in for extended periods of time, status removal through Pokemon like Mega Audino is useful to keep Mega Rayquaza healthy.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "omnisc", "user_id": 233691}, {"username": "motherlove", "user_id": 231750}], "teams": [{"name": "Quality checked by", "members": [{"username": "morogrim", "user_id": 276906}, {"username": "Uselesscrab", "user_id": 167744}, {"username": "SeanBumagat", "user_id": 203960}, {"username": "Piccolo Daimao", "user_id": 219853}]}, {"name": "Grammar checked by", "members": [{"username": "P Squared", "user_id": 168392}, {"username": "Lumari", "user_id": 232216}, {"username": "Malley", "user_id": 243195}]}]}
  },
  "Garchomp": {
    "overview": "<p>Mega Garchomp is one of the bulkiest Ground-types in Balanced Hackmons that can take hits and deal large amounts of damage. Thanks to both its amazing bulk and offensive power, it can fill the roles of either wallbreaker or sweeper, and thanks to a fantastic Dragon / Ground typing, it has perfect neutral coverage and can hit most of the metagame's walls super effectively; its Ground-type moves hit Steel-types such as Registeel and Aegislash, and its Dragon-type moves hit Dragon-types such as Giratina. Mega Garchomp's typing also gives it nice resistances, with Fire and Rock being two of the most notable ones as they allow Mega Garchomp to switch into a multitude of threats, such as Mega Tyranitar. Mega Garchomp's typing does, however, have some drawbacks, as it has notable weaknesses to Ice and Fairy-type attacks that make it vulnerable to getting revenge killed by Pixilate and Refrigerate users such as Mega Diancie, Kyurem-B, and Kyurem-W. Mega Garchomp is also vulnerable to strong special attackers such as Mega Mewtwo Y and Mega Latios, especially those that have Fairy- or Ice-type coverage, such as Moonblast or Ice Beam. For this reason, Mega Garchomp faces competition from Mega Swampert, which does not have any weakness to the common offensive types in the metagame; however Mega Garchomp has the better offensive typing and more overall power. Mega Garchomp is the best user of Thousand Arrows, even better than Primal Groudon due to having STAB, a base 170 Attack, and the ability to use any ability and hold an item to further augment its power. Additionally, Mega Garchomp is not weak to Thousand Arrows while Primal Groudon is. Despite being held back by a Speed stat that causes it to be able to get revenge killed by faster threats such as Mega Rayquaza and Mega Diancie, it is still faster than base 90 Speed Pokemon such as Groudon and Kyogre, and with some support from its team, Mega Garchomp is able to wreak havoc on the enemy team.</p> ",
    "comments": "<h1>Other Options</h1> <p>Choice Band is an alternative option for the Choice Scarf set if Speed is not a concern and allows Mega Garchomp to hit even harder. Life Orb can be used to avoid getting locked into one move for the Choice Scarf set. Additionally, Draco Meteor can be used on the Choice Scarf set instead of Precipice Blades to be able to take out certain Fur Coat users such as Giratina. Technician is another option that can be used instead of Adaptability to get a stronger Dual Chop and a strong dual-hit Ground-type move in Bonemerang, but the main difference will be that Thousand Arrows will now be replaced with a setup move such as Shift Gear and Choice Scarf will be replaced by Life Orb, thus turning this Mega Garchomp into a sweeper. If outspeeding threats is not a concern, Shift Gear can also be replaced with a Rock-type move such as Rock Tomb or Diamond Storm to hit Flying-types super effectively. Coil can be used over Shift Gear on the Poison Heal set with an EV spread of 248 HP / 8 Atk / 252 SpD and either an Adamant or a Careful nature at the expense of outspeeding some major threats, which can lead to Mega Garchomp potentially getting OHKOed by strong attackers such as Mega Mewtwo Y or Mega Mewtwo X. It does, however, allow Mega Garchomp to set up on and take hits from physical attackers. Another option that can be used instead of Adaptability is Soundproof, which allows Mega Garchomp to be immune to sound-based moves such as Boomburst and Parting Shot, which is commonly used by Steel-type walls. This allows Mega Garchomp to potentially catch these unsuspecting targets by surprise and set up on them. A moveset consisting of Shift Gear, Substitute, Thousand Arrows, and Dual Chop is recommended for this set. Sacred Fire is an option that can be used on the Poison Heal set to be able to potentially burn Magic Bounce users but at the expense of having a burning move not as reliable as Will-O-Wisp.</p> <h1>Checks and Counters</h1> <p><strong>Pixilate and Refrigerate Users: Mega Diancie and Kyurem-B can threaten Mega Garchomp with their super effective priority moves and force it out.</p> <p><strong>Strong Ice-, Fairy-, and Dragon-type Moves: Moves such as Ice Beam, Moonblast, and Spacial Rend can easily defeat Mega Garchomp as they hit it super effectively.</p> <p><strong>Fur Coat Users</strong>: Fur Coat users such as Mega Audino can wall and phaze the Choice Scarf set but risk getting burned by Will-O-Wisp and having their items removed by the Poison Heal set. Fur Coat Groudon can additionally trap Mega Garchomp with Thousand Waves and defeat it but at the expense of getting burned by the Poison Heal set.</p> <p><strong>Strong Priority Users: An Extreme Speed coming from a Regigigas using Guts or Dragon Ascent coming from a Gale Wings Mega Rayquaza can revenge kill Mega Garchomp.</p> <p><strong>Strong Special Attackers: Mega Mewtwo Y and Mega Latios can threaten the Poison Heal set before it sets up and force it out.</p> <p><strong>Status Removers: Natural Cure users that use Entrainment can permanently cripple the Poison Heal set if Toxic Orb has been removed by Knock Off.</p> <p><strong>Ability-changing Moves</strong>: Gastro Acid, Worry Seed, Simple Beam, Skill Swap, and Entrainment can force the Poison Heal set out.</p> <p><strong>Unaware Users</strong>: Walls that are not weak to Ground-type moves such as Unaware Giratina can wall the Poison Heal set but at the expense of getting burned and getting their items removed by Knock Off.</p> ",
    "sets": [
      {
        "name": "Choice Scarf",
        "description": "<h1>Moves</h1> <p>Thousand Arrows is Mega Garchomp's main STAB move that hits everything including Flying-types and Levitate users and is mostly unresisted. Dual Chop is another STAB move that hits Dragon-types super effectively, breaks potential Focus Sashes, and is able to get past Sturdy and Substitutes. This move can be replaced with Dragon Claw if accuracy is a concern. Precipice Blades can be used once there is no fear of Flying-type or switch-ins with Levitate for additional power, though its great power comes with shaky accuracy. Use this move also to OHKO foes that would otherwise be 2HKOed by Thousand Arrows such as Mega Mewtwo X and Kyogre. U-turn lets Mega Garchomp provide the team with a fast pivot and can be used to gain momentum; this move can be replaced with Trick to cripple walls such as Mega Audino or Mega Slowbro that would most likely be switching in, although keep in mind that some of these walls use their Mega Stones as their items to block Trick.</p> <h1>Set Details</h1> <p>A Choice Scarf alongside 236 Speed EVs allows Mega Garchomp to outspeed the majority of the unboosted Pokemon in the metagame up to positive-natured base 140s and neutral-natured base 90s that are holding a Choice Scarf or have +1 in Speed and allows it to outspeed Imposter users if they are not holding a Choice Scarf. Investing 252 EVs in Attack along with an Adamant nature enables Mega Garchomp to hit as hard as possible. A Jolly nature can alternatively be used along with 188 Speed EVs to also outspeed up to positive-natured base 150 Speed Pokemon such as Mega Aerodactyl and Deoxys-A with the help of a Choice Scarf. The rest of the EVs are dumped into Defense to maximize Mega Garchomp's bulk (20 or 68 Defense EVs for Adamant and Jolly natures, respectively). Adaptability allows Mega Garchomp to hit even harder with its STAB moves and allows it to 2HKO most of the metagame's walls such as defensive Mega Audino, defensive Giratina, and defensive Arceus. It also can OHKO almost all of the offensive threats in the tier such as Mega Rayquaza, Mega Mewtwo Y, Mega Mewtwo X, Mega Gengar, Mega Diancie, and Kyogre and even some of the tier's walls such as Registeel and Aegislash.</p> <h1>Usage Tips</h1> <p>Mega Garchomp can be used as a revenge killer or wallbreaker and can 2HKO a good portion of the metagame. Use Mega Garchomp in the early-game to deal as much damage as possible to make way for the sweepers later on. Thousand Arrows will be used the majority of the time, since it hits everything pretty hard and has good neutral coverage. Use Precipice Blades after getting rid of all Flying-types and Levitate users, although if accuracy is a concern or if hitting the next move is crucial, Thousand Arrows should be used. Precipice Blades can also be used to net some OHKOs that would otherwise be 2HKOs with Thousand Arrows such as on Mega Mewtwo X and Kyogre. U-turn should be used to get out of a bad matchup or to gain momentum for your team. Use Dual Chop on Dragon-types and also on foes that you think might have Focus Sash or the ability Sturdy. Dual Chop can also be used on foes that are behind Substitutes to break the Substitute and deal additional damage to them. Use Trick to cripple enemy tanks such as Mega Audino and Mega Slowbro, which are common switch-ins to Mega Garchomp.</p> <h1>Team Options</h1> <p>Mega Garchomp can get OHKOed by Pixilate and Refrigerate users such as Mega Diancie and Kyurem-B and thus appreciates support from Steel-type or Poison-type walls such as Registeel, Mega Venusaur, and Aegislash to compensate for this weakness. Furthermore, should Steel-types be transformed into by Imposter users, Mega Garchomp can immediately switch into them and threaten the opponent's team. For this reason, Steel-type walls should be constructed in a way that would allow Mega Garchomp to safely switch into them. Sweepers and wallbreakers such as Mega Mewtwo Y, Mega Latios, and even Aerilate Mega Rayquaza can also help Mega Garchomp deal with Fur Coat users such as Mega Slowbro and Mega Audino and at the same time benefit from Mega Garchomp's dual threat to the Dragon- and Steel-type walls in the metagame. Mega Garchomp also requires Imposter-proofing support by Fur Coat users such as Xerneas, Mega Slowbro, Mega Audino, and Groudon. Mega Garchomp also cannot defeat Shedinja by itself and greatly appreciates Mold Breaker or entry hazard support to be able to take it out.</p> "
      },
      {
        "name": "Poison Heal",
        "description": "<h1>Moves</h1> <p>Shift Gear boosts Mega Garchomp's Attack and Speed to tremendous levels and allows it to sweep. Mega Garchomp outspeeds the entire unboosted metagame bar anything above base 150 Speed and can 2HKO a good portion of the tier after a single Shift Gear. Thousand Arrows has excellent neutral coverage, also hitting Flying-types and Levitate users, and is mostly unresisted, since Grass- and Bug-types are incredibly rare, and Mega Venusaur takes neutral damage due to its Grass / Poison typing. Knock Off is used to remove crucial items such as Eviolite and to hit Ghost- and Psychic-types super effectively; use this move along with Will-O-Wisp to cripple physical attackers, most notably Imposter users. Will-O-Wisp also does chip damage to walls, which can help Mega Garchomp eventually defeat them. An alternative set would include Leech Seed, to KO Shedinja and to beat Imposter users, along with Sacred Fire to hit Grass-types super effectively and to potentially burn physical attackers and Imposter users. Sacred Fire can also burn Magic Bounce users, whereas Will-O-Wisp cannot.</p> <h1>Set Details</h1> <p>Toxic Orb allows Mega Garchomp to activate Poison Heal, which prevents status conditions and also provides it with very good passive recovery. The spread of 248 HP / 200 Def gives Mega Garchomp great bulk and longevity and enables it to survive the combination of Fake Out + Extreme Speed from Aerilate users such as Mega Rayquaza and even a +1 V-create from Primal Groudon. It also guarantees that Mega Garchomp will be at most 3HKOed from any move that an opposing Imposter user would use at +1 Attack. The remaining EVs are dumped into Attack along with an Adamant nature to maximize damage output.</p> <h1>Usage Tips</h1> <p>Bring Mega Garchomp in with a slow pivot to safely activate Poison Heal; this is absolutely crucial, as Mega Garchomp cannot afford to lose its Toxic Orb or getting statused, and it does not have a protecting move such as Spiky Shield to activate Poison Heal by itself. After Poison Heal has been activated, almost any wall is a free switch in due to Mega Garchomp being immune to status. Use these to set up with Shift Gear and sweep. This Mega Garchomp is completely Imposter proof, as it can burn the Imposter user and will not even be 2HKOed in the event it loses the Speed tie. For this reason, also make sure not to set up more than two times if there is a non-burned Imposter user on the opponent's team. Shedinja can also be defeated with this set by using either Leech Seed or Will-O-Wisp (if Shedinja is not using Lum Berry) or Knock Off + Will-O-Wisp if the Shedinja has Lum Berry + Recycle. Thousand Arrows is the move that should be used most of the time, but Knock Off should be used to remove crucial items such as an Eviolite from a Fur Coat Chansey and to hit walls such as Giratina super effectively. Mega Garchomp can also be used as a Primal Groudon check and can even take a +1 V-create from it under harsh sunlight and OHKO in return with Thousand Arrows after the drop in Defense from V-create. Mega Garchomp can also check Mega Tyranitar after Poison Heal has been activated and can easily set up on it, as it resists Rock-type moves, and Knock Off will not do significant damage due to the investment in bulk, especially after Toxic Orb has already been removed. Use Will-O-Wisp on walls that can phaze Mega Garchomp or prevent it from setting up through moves such as Topsy-Turvy to deal chip damage to them. Using Will-O-Wisp on physical attackers also makes it easy for Mega Garchomp to set up on them.</p> <h1>Team Options</h1> <p>Mega Garchomp fears getting revenge killed by Pixilate and Refrigerate priority users such as Mega Diancie and Kyurem-B and therefore pairs well with Steel-type or Poison-type walls such as Registeel, Mega Venusaur, and Aegislash to compensate for this weakness. Mega Garchomp also has a very hard time overcoming Fur Coat users and appreciates special wallbreakers such as Mega Mewtwo Y and Mega Latios to help it deal with them. Slow pivoting support is also a necessity to be able to safely activate the Toxic Orb and this can be provided by slow walls such as Mega Audino, Mega Slowbro, Registeel, and Aegislash.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "morogrim", "user_id": 276906}], "teams": [{"name": "Quality checked by", "members": [{"username": "Uselesscrab", "user_id": 167744}, {"username": "nyan kat", "user_id": 256353}, {"username": "E4 Flint", "user_id": 203690}]}, {"name": "Grammar checked by", "members": [{"username": "Haund", "user_id": 193885}, {"username": "Lumari", "user_id": 232216}]}]}
  },
  "Dialga": {
    "overview": "<p>Dialga, while not as good a wallbreaker as Mega Diancie or Mega Rayquaza, has quite a few distinct properties that make it good in the Balanced Hackmons metagame. Its unique Steel / Dragon typing provides a resistance to Flying and a neutrality to Fairy, corresponding to two of the more commonly used -ate abilities in Aerilate and Pixilate. Steel / Dragon is an interesting offensive typing as well, giving it unresisted coverage with just Tinted Lens and its STAB moves, with Dragon alone being unresisted itself outside of Fairy-types. Tinted Lens allows Dialga to lure in and deal massive damage to Steel-types such as Registeel and Aegislash, which rely on their resistances to take hits. Its bulk is decent, and its Special Attack is quite good, but it is a bit on the slow side. Pokemon with Imposter present a problem to it, requiring a Fairy-type Pokemon with Magnet Pull and Substitute to be dealt with reliably. Overall, Dialga is a massive threat when set up and can sweep unprepared teams with ease.</p> ",
    "comments": "<h1>Other Options</h1> <p>There are plenty of alternate options for Dialga's fourth move. Spiky Shield can be run to block status moves, unlike King's Shield, and deal chip damage to the foe if it makes contact, as well as KO Sturdy Shedinja if it uses Endeavor. Magma Storm can be run to deal super effective damage to Steel-types and KO Sturdy Shedinja; while Doom Desire and Draco Meteor do slightly more damage to Steel-types thanks to Tinted Lens, the residual damage is always appreciated. Keep in mind that this makes Dialga harder to protect against Imposter Pokemon than it already is. Lastly, Spore can be run, as it is almost guaranteed put a foe to sleep; if you opt for this, Safety Goggles is a good item to run to prevent Magic Bounce users from putting Dialga to sleep instead.</p> <p>A Choice Specs set is an option to make Doom Desire ridiculously powerful and potentially cripple walls with Trick. The setup sweeper Tinted Lens set is almost always better, however, as Doom Desire is not the best move to be locked into. A Magnet Pull set can be used to lure, trap, and KO Imposter users that would normally capitalize on a free Tail Glow. Shell Smash and Judgment can also be run on this set, as well as on the setup sweeper Tinted Lens set, to make KOing Imposter users easier.</p> <h1>Checks and Counters</h1> <p><strong>Magnet Pull Fairy-types: Fairy-types are immune to Dragon-type moves, and as such the only move Dialga has to hit them with is Doom Desire. Most Magnet Pull Fairy-types capitalize on this, neutering Dialga by using Substitute to block the damage caused by Doom Desire. The most prominent example of a Pokemon that utilizes this strategy is Xerneas. These are the largest threats to Dialga because they can easily fully set up on Dialga and sweep.</p> <p><strong>Mega Mewtwo: Both Mega Mewtwo X and Mega Mewtwo Y commonly run Ground-type coverage moves (e.g. Precipice Blades and Earth Power, respectively) to hit Steel-types super effectively. Dialga has a hard time taking hits from either as a result of this. However, neither forme appreciates taking a Doom Desire on the switch, especially if it is boosted by Tail Glow.</p> <p><strong>Sturdy Shedinja: Sturdy Shedinja walls this set if Dialga doesn't carry Leech Seed or something else that is dedicated to defeating Shedinja, and it can threaten Dialga with Endeavor. Entry hazard support and a teammate with Mold Breaker and Pursuit alleviate this to an extent.</p> <p><strong>Unaware Pokemon</strong>: Unaware Pokemon that can reliably take Draco Meteor can switch into Dialga and phaze it. Keep in mind that they are harder to switch in if Dialga is using Doom Desire and that the Unaware Pokemon will constantly be hit by a full-powered Draco Meteor unless they are Fairy-types, as they ignore the stat drops.</p> <p><strong>Imposter Pokemon</strong>: Imposter Pokemon can copy this set and threaten to sweep with it. If Dialga is unboosted, this becomes far easier, as Imposter Chansey can take a few unboosted Draco Meteors, set up a Tail Glow, and sweep. On the other hand, if Dialga has boosted, Imposter becomes a shakier way to deal with it due to how much damage Draco Meteor and Doom Desire deal, requiring the Imposter user to be brought in via a safer method such as a slow U-turn. Due to the ease with which Magnet Pull Fairy-types can be slapped onto a team to deal with Dialga, Imposter Pokemon need to be played carefully in order to avoid being trapped themselves; however, Imposter can easily spell the end for Dialga's team when played properly.</p> ",
    "sets": [
      {
        "name": "Doom Desire",
        "description": "<h1>Moves</h1> <p>Tail Glow allows Dialga to raise its Special Attack to sky-high levels. Doom Desire allows Dialga to fire off a high-power STAB move that very few Pokemon resist due to Tinted Lens. Additionally, this move is not affected by Protect, Metal Burst, or Destiny Bond. It also creates some interesting opportunities due to its two-turn delay by forcing switches or simply KOing the opponent's Pokemon if they choose not to switch. Draco Meteor is another powerful STAB attack that works best if Dialga switches out afterwards, because then Doom Desire uses Dialga's unmodified Special Attack rather than the decreased Special Attack that results from using Draco Meteor. Spacial Rend is an alternate option over Draco Meteor with less power but a higher chance to get critical hits, which can be useful to get past Pokemon with Special Defense boosts, such as Quiver Dance sweepers. King's Shield allows Dialga to scout the foe's moveset, lower the foe's Attack, and stall out Doom Desire turns. It is mostly used to block and punish priority moves boosted by -ate abilities, such as Fake Out and Extreme Speed, and Fighting-type moves that make contact, which can do massive damage to Dialga. Leech Seed KOes Sturdy Shedinja, which is an undesirable Pokemon for Dialga to face, and provides passive healing. It can also be used to gain massive amounts of HP if an Imposter user such as Chansey switches in. Recover, or any of its clones, gives Dialga increased longevity via instant recovery, which can be more useful than the slower recovery that Leech Seed provides.</p> <h1>Set Details</h1> <p>252 Special Attack EVs and a Modest nature allow Dialga to do as much damage as possible. Adamant Orb is run to increase this damage, boosting Dialga's STAB moves without locking it into a move or making it take recoil. 248 HP EVs limit damage taken from Curse and Spikes. The rest of the EVs are placed in Special Defense. Tinted Lens is the ability of choice, giving Dialga's STAB moves unresisted coverage. With this ability, very common Steel-types such as Registeel and Aegislash cannot counter Dialga. Safety Goggles is an alternate option over Adamant Orb that prevents Dialga from being put to sleep by Spore, although it loses some power in the process.</p> <h1>Usage Tips</h1> <p>Doom Desire is most often the best move to use when Dialga is not immediately threatened due to its ability to ignore the effects of various moves such as Protect, Metal Burst, and Destiny Bond and potentially force a switch. It is important to use Doom Desire before Tail Glow, if you wish to use Tail Glow at all, due to Tail Glow's boosts only being factored in when the move hits. Tail Glow can be used if Dialga forces a switch after using Doom Desire to deal massive damage even to switch-ins that resist Doom Desire. Another strategy is to use Doom Desire, follow up with Draco Meteor, and then switch out; because Dialga's stat changes are reset if it switches out, Doom Desire will use Dialga's unmodified Special Attack rather than the decreased stat that results from using Draco Meteor. Use King's Shield to scout a foe's moves and potentially lower its Attack. Using Dialga's moveset strategically is key, as you can essentially pick when you want Dialga to sweep, wallbreak, or scout, depending on the scenario. Remove Pokemon with the ability Imposter before trying to sweep unless you have a full counter, in which case Imposter isn't as much of a worry. In addition, it is important to remove Sturdy Shedinja as soon as possible if Dialga does not have Leech Seed, as without it, Dialga cannot harm Shedinja.</p> <h1>Team Options</h1> <p>Teammates with Mold Breaker are highly recommended for various reasons. The first is that they can provide entry hazard support even against Magic Bounce users, which KOes Sturdy Shedinja when it switches in as well as inflicting chip damage. The second is that the combination of Mold Breaker and Pursuit allows them to trap and KO Sturdy Shedinja, dissuading Shedinja from switching into Doom Desire and punishing it if it does. Lastly, Mold Breaker users cannot have their phazing moves bounced back by Magic Bounce, allowing them to shuffle foes around to take heavy hits from Doom Desire. Examples of good Pokemon to run Mold Breaker include Mega Gengar, Mega Gyarados which has the special mention distinction of being able to run any other ability and Mega Evolve to gain Mold Breaker, and Mega Mewtwo X. A Magnet Pull Fairy-type with Substitute can be used to counter and set up on Pokemon with Imposter that copy this set by preventing it from switching out. A Pokemon with a phazing move that can take a Draco Meteor or two from Dialga can also be used to deal with Imposter users, as forcing the Imposter Pokemon out makes the Doom Desire use the Imposter Pokemon's Special Attack rather than Dialga's, resulting in paltry amounts of damage. Another Steel-type can be used in conjunction with Dialga to better deal with Pixilate and Refrigerate Pokemon, as Dialga is neutrally affected by Fairy- and Ice-type moves. A Fur Coat Pokemon such as Mega Audino or Giratina can also be run to sponge the Ground- and Fighting-type attacks that Dialga finds undesirable to go up against.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Pikachuun", "user_id": 171701}], "teams": [{"name": "Quality checked by", "members": [{"username": "Piccolo Daimao", "user_id": 219853}, {"username": "Uselesscrab", "user_id": 167744}, {"username": "E4 Flint", "user_id": 203690}]}, {"name": "Grammar checked by", "members": [{"username": "Malley", "user_id": 243195}, {"username": "Lumari", "user_id": 232216}]}]}
  },
  "Regigigas": {
    "overview": "<p>While not an incredibly common Pokemon in Balanced Hackmons, Regigigas has the Attack and Speed stats to succeed against a large portion of the metagame. Its Normal typing is poor defensively but provides it with a fantastic STAB move in the form of Facade. Regigigas's bulk also distinguishes it from more frail attackers. The most often seen Poison Heal set is notably Imposter resistant, as an Imposter Chansey not only will be unable to recover HP but also will miss out on the damage boost that Facade gets when used by poisoned Pokemon. As a result of these attributes, Regigigas can function extremely well against a variety of teams once common checks and counters like Shedinja and Mega Rayquaza have been eliminated. Great care is required in setting Regigigas up, as while its bulk is above average, it cannot switch into many of the metagame's more powerful attackers and must always be wary of Knock Off or status-inducing moves.</p> ",
    "comments": "<h1>Other Options</h1> <p>Extreme Speed is occasionally used, especially on teams that are notably weak to -ate ability users because Regigigas's Extreme Speed can outprioritize theirs after it has set up a Shift Gear. Fake Out has some utility in this same vein and also ensures the activation of Toxic Orb immediately. King's Shield can also fulfill the anti-Aerilate and anti-Pixilate role while activating Toxic Orb, but if the opponent uses a status move on the same turn, this plan can go horribly awry.</p> <h1>Checks and Counters</h1> <p><strong>Fighting-type Moves</strong>: Regigigas's innate bulk is virtually irrelevant when it faces Fighting-type moves from the likes of Mega Mewtwo X. However, the latter Pokemon can be defeated if Regigigas has already set up a Shift Gear, especially if Regigigas is carrying Sacred Fire or Thousand Arrows to scout for King's Shield.</p> <p><strong>Giratina: Giratina, especially with Fur Coat, walls most variants of Regigigas exceptionally well. Even Knock Off Regigigas does very little at +6 Attack because Giratina can run Griseous Orb.</p> <p><strong>Sturdy Shedinja</strong>: Shedinja is generally a reliable counter, but some scouting is required to ensure that the Regigigas is not running the fairly uncommon Sacred Fire or Leech Seed.</p> <p><strong>Aerilate or Pixilate Fake Out + Extreme Speed</strong>: Without Spiky Shield or King's Shield, Regigigas is helpless against this extremely common strategy. Even with Poison Heal recovery, Regigigas can be easily knocked out by the combination with a tiny bit of prior damage. For instance, Jolly Life Orb Mega Rayquaza with 252 Attack EVs can take away a minimum of 80% of Regigigas's HP with the pair of moves with one turn of Poison Heal recovery factored in.</p> ",
    "sets": [
      {
        "name": "Poison Heal",
        "description": "<h1>Moves</h1> <p>Facade provides a 140-Base Power STAB move as soon as Regigigas's Toxic Orb is activated and can do huge chunks of damage to the vast majority of the metagame. Spore allows Regigigas to neuter Fur Coat and other non-Magic Bounce walls as well as Imposter Chansey, allowing for more setup opportunities. Leech Seed provides another answer to Chansey and a way of beating Shedinja, but it can be bounced back and end up being detrimental to a potential sweep. Shift Gear allows Regigigas to boost its Speed and thus outpace Pokemon like the Mega Mewtwo formes and Mega Rayquaza, as well as powering up Facade. Spiky Shield gives Regigigas a chance to beat Endeavor Shedinja with good prediction, blocks common priority moves like Fake Out and Extreme Speed from opposing -ate ability users, and permits Regigigas to freely gain back an extra chunk of health from Poison Heal recovery. A variety of coverage moves can be used. Knock Off dents Ghost-types like Giratina and Aegislash and neutrally hits most Rock- and Steel-types that resist Facade, in addition to removing important items like Chansey's Eviolite; Thousand Arrows hits those same Rock- and Steel-types super effectively; and Sacred Fire hits Steel-types super effectively as well and has a chance to beat Safety Goggles Shedinja but runs the risk of burning an Imposter Pokemon and powering up its Facade.</p> <h1>Set Details</h1> <p>The combination of a Toxic Orb and Poison Heal provides Regigigas with a steady means of recovering health and a reliable STAB move in Facade. With Shift Gear, Regigigas does not need additional Speed EVs to outrun the metagame, so the non-Attack EVs are put into HP. An Adamant nature powers up Facade and the player's coverage move of choice.</p> <h1>Usage Tips</h1> <p>It is essential to be careful when switching Regigigas in, as a Knock Off from the foe can remove Regigigas's Toxic Orb and prevent any chance of a sweep. Therefore, it is important to get a safe switch in by means of a pivot or a teammate fainting. Alternatively, if Spiky Shield is used, it should be activated immediately to ensure that Regigigas is badly poisoned. When in the midst of attempting to sweep after setting up a Shift Gear, Facade should be the primary move used, but if the player is running Sacred Fire, it can be used in an attempt to fish for burns on opposing physical attackers. Because Sacred Fire and Thousand Arrows do not make contact, they can be used to avoid the attack drop from King's Shield. Finally, it is important not to use Spore recklessly, as though its being bounced back cannot put a poisoned Regigigas to sleep, the use of the move can still provide an opposing Magic Bounce Pokemon with an unimpeded switch.</p> <h1>Team Options</h1> <p>Frail, fast offensive Pokemon like Mega Mewtwo X, Mega Mewtwo Y, and Mega Gengar are effective alongside Regigigas because of their power and ability to break the Rock- and Steel-types that plague some variants of Regigigas. If Regigigas doesn't run Leech Seed, a Shedinja counter, like Mold Breaker Giratina or Mega Gengar with Pursuit, is incredibly useful. Entry hazard setters like Deoxys-S are useful for this purpose as well. Lastly, Giratina is a good teammate that can wall non-Knock Off variants of this set should Imposter Chansey manage to break through (which is unlikely).</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Uselesscrab", "user_id": 167744}, {"username": "Electrolyte", "user_id": 148071}, {"username": "Illusio", "user_id": 233866}], "teams": [{"name": "Quality checked by", "members": [{"username": "Pikachuun", "user_id": 171701}, {"username": "Piccolo Daimao", "user_id": 219853}, {"username": "E4 Flint", "user_id": 203690}, {"username": "Kingslayer2779", "user_id": 231877}]}, {"name": "Grammar checked by", "members": [{"username": "P Squared", "user_id": 168392}, {"username": "Lumari", "user_id": 232216}]}]}
  },
  "Kyurem-Black": {
    "overview": "<p>Thanks to its typing and high Attack stat, Kyurem-B is the hardest hitting physically offensive user of Refrigerate and also the second most powerful physical -ate ability user in the metagame. Its Ice STAB gives it a very effective offensive typing that alone allows it to hit most of the tier neutrally or better, and with its coverage moves, there's nothing that Kyurem-B can't touch. Its main sets allow it to revenge kill even faster foes. This offensive pressure can keep the foe from trying to set up and sweep with a frail sweeper, lest it be picked off. Foes also have to be wary of sending in Imposters or Shedinja because although they can shut down most sets, Kyurem-B is capable of running a set to beat both of them.</p> <p>Kyurem-B faces stiff competition from Mega Diancie and Mega Rayquaza for the role of -ate ability user, as both are faster and can run mixed sets much more effectively. Kyurem-B also has a poor defensive typing that not only leaves it with very few relevant resistances, but also leaves it weak to Pixilate. However, Kyurem-B has greater bulk than either of them, allowing it to beat threats that they cannot handle.</p> ",
    "comments": "<h1>Other Options</h1> <p>Refrigerate sets have a number of usable Normal-type moves with a variety of uses. Facade paired with a Toxic Orb creates a high risk, high reward, somewhat Imposter-resistant set. This results in less longevity, so recovery or escape moves are necessary. Rapid Spin, when used with Refrigerate, makes for unblockable entry hazard removal. But because Kyurem-B is weak to entry hazards, this isn't an ideal choice. Explosion can also be run, as the power is enough to OHKO some would-be checks and counters while crippling the few Pokemon that survive, including potential Imposter switch-ins. However, the power makes checking Imposter Pokemon very difficult if they get in safely and decide to sacrifice themselves. Feint is an option for bypassing King's Shield and Spiky Shield as well as potentially outspeeding and picking off other Extreme Speed users. However, Feint's base power is extremely low, so it serves little use beyond this. Boomburst can also be used to hit certain physical walls, such as Fur Coat users, much harder than any of Kyurem-B's physical moves.</p> <p>On sets using Bolt Strike, Fusion Bolt is an option with more accuracy but less power, which can make it miss out on important KOs. Conversely, sets with Thousand Arrows may opt for Earthquake or Precipice Blades for more power at the risk of Steel-types with Levitate and certain Flying-type Pokemon, such as Ho-Oh, being potential nuisances. Taunt completely shuts down passive counters to Refrigerate sets, such as Fur Coat Chansey. Knock Off can also be used to take advantage of switches, most notably removing Chansey's Eviolite and Toxic Orbs from Pokemon with Poison Heal before the Orbs activate.</p> <p>Low Kick can also be run on any set to hit most Steel-types with Levitate hard, but Ground- and Electric-type moves provide better coverage in general. If they can spare a moveslot, all sets appreciate recovery moves such as Heal Order, which gives Kyurem-B better longevity. Infestation and Leech Seed are options on all sets to help deal with Shedinja and Imposter, and Leech Seed can also be used on predicted King's Shield turns to wear down walls and help keep Kyurem-B healthy.</p> <p>Finally, Kyurem-B has the typing and access to the right STAB moves to run a Technician set, utilizing moves such as Dual Chop, Dragon Tail, and Bonemerang in addition to those listed in its Skill Link set. While the power is potentially higher, the performance is less consistent with moves such as Icicle Spear.</p> <h1>Checks and Counters</h1> <p><strong>Entry Hazards: Most Kyurem-B sets lack recovery, so, with its weakness to Stealth Rock, it is very vulnerable to residual damage from entry hazards, making hazard removal support almost mandatory.</p> <p><strong>Opposing -ate Ability Users</strong>: Refrigerate, Aerilate, and especially Pixilate users can KO Kyurem-B or force it out if it's not running King's Shield. However, all common users such as Mega Rayquaza and Mega Diancie struggle to switch into Kyurem-B's attacks. Refrigerate Kyurem-B can also check them in return if it gets a safe switch into them.</p> <p><strong>Physically Bulky Pokemon: Pokemon with investment in physical bulk, such as Mega Slowbro, Mega Aggron, Mega Scizor, Regenerator + Assault Vest Regirock and Registeel, and Fur Coat users, can cause problems for Kyurem-B lacking set up moves. Additionally, Steel-type checks may be able to hit back with their STAB attacks. Unaware users, such as some Cresselia, can shut down Kyurem-B even with a boosting move. Boomburst can bypass many of these if they lack Soundproof, however.</p> <p><strong>Status: Burns cripple Kyurem-B, and it is not very fond of sleep either. The Anti-Imposter and Skill Link sets also do not appreciate paralysis.</p> <p><strong>Mega Mewtwo X</strong>: While it cannot switch in on Kyurem-B's attacks, many of Mega Mewtwo X's sets can easily OHKO Kyurem-B with a Fighting-type move.</p> ",
    "sets": [
      {
        "name": "Refrigerate",
        "description": "<h1>Moves</h1> <p>The first two moves on this set are mandatory, as they are what make Kyurem-B so dangerous. Fake Out helps Kyurem-B rack up free damage against many targets so that they can be finished off with an Extreme Speed. Most frail Pokemon are 2HKOed by the combination.</p> <p>In the third slot, Bolt Strike gives Kyurem-B amazing coverage that is only resisted by Pokemon with abilities granting an Electric immunity. It also allows it to quickly dispatch Kyogre and Mega Gyarados, which Kyurem-B has trouble with otherwise, while allowing it to hit Steel-types neutrally. If Steel-types are more of a concern, Thousand Arrows is an option to deal with them better. It can also be run in the last move slot alongside Bolt Strike to allow Kyurem-B to bypass many would-be checks. Earth Power can be run for similar reasons to bypass certain Pokemon with lopsided defenses that have the physical bulk to otherwise wall Kyurem-B with even Thousand Arrows, such as Mega Aggron.</p> <p>In the last slot, King's Shield helps keep Kyurem-B from being revenge killed by opposing -ate ability users, most notably Mega Diancie, and Imposters, while also threatening and potentially shutting them down thanks to the -2 Attack drop it induces on contact. Swords Dance can be used on predicted switches to help Kyurem-B sweep the opponent's team, though running this move makes stopping an Imposter more difficult. As Kyurem-B often forces switches, U-turn can be used to scout the foe and maintain offensive pressure.</p> <h1>Set Details</h1> <p>The listed EVs maximize Kyurem-B's power and bulk while also allowing it to switch into Stealth Rock five times. Icicle Plate maximizes the power of Kyurem-B's STAB moves without any recoil while Rocky Helmet can punish opposing physically offensive -ate ability users, Imposters, and Shedinja that attempt to attack Kyurem-B, especially when paired with King's Shield.</p> <h1>Usage Tips</h1> <p>Because Extreme Speed has very limited PP and is Kyurem-B's main attack, it is necessary to scout before committing fully to a sweep. As such, early- and mid-game, Kyurem-B should be used to force switches, prevent set-up, revenge kill, and occasionally use Extreme Speed on a Pokemon that would be seriously hurt and will likely switch out to keep your opponent from predicting your own switch. While Kyurem-B is a threatening sweeper, it needs to be able to set up. However, once its checks and counters are out of play, Kyurem-B can clean up game very efficiently.</p> <p>Be wary of King's Shield, as it is a very common defensive move that can easily force Kyurem-B to switch due to the attack drop. Rocky Helmet holders are also fairly common and can quickly inflict a lot of residual damage.</p> <h1>Team Options</h1> <p>As Kyurem-B forces a lot of switches, it appreciates entry hazard support to build up damage against checks and counters and to guarantee some KOes with Fake Out and Extreme Speed. As it is also weak to entry hazards itself, Kyurem-B appreciates Rapid Spin or Defog support to keep its side of the field clear. Kyurem-B also appreciates Wish and cleric support to keep it healthy, as it may need to switch into status moves or weak attacks to pressure the foe.</p> <p>Offensively, teammates that can eliminate Kyurem-B's checks and counters are useful. While Rocky Helmet KOes Shedinja, Kyurem-B does not appreciate being hit with Endeavor from Sturdy Shedinja. As such, Mold Breaker + Pursuit users, such as Mega Gengar, are good teammates, as they can easily eliminate Shedinja. Illusion users can disguise themselves as Kyurem-B to lure in and trap or destroy its checks and counters. Mega Gengar does this particularly well when Mega-Evolved so that it can trap the foe with Shadow Tag.</p> <p>Aegislash-Shield makes for a good defensive partner, as it resists or is immune to all of Kyurem-B's weaknesses, is slow enough to bring it in safely with a U-Turn or Parting Shot, and can easily check Pokemon that have transformed into Kyurem-B with Imposter should Kyurem-B lack Precipice Blades. Poison Heal Kyogre is another good partner if Kyurem-B does not run Bolt Strike, as it can set up on Imposters of Kyurem-B and also take down most of Kyurem-B's checks.</p> "
      },
      {
        "name": "Anti-Imposter",
        "description": "<h1>Moves</h1> <p>Most Imposters run the default maximum happiness, so Frustration is the best choice for the first slot, as it not only hits hard after a Refrigerate boost, but also causes Imposters to inflict very little damage back. Bolt Strike is Kyurem-B's best coverage move, as not only does Kyurem-B resist it, but it beats Kyogre and Mega Gyarados, which would wall the set otherwise, and it hits most Steel-types neutrally.</p> <p>Infestation not only allows Kyurem-B to KO Shedinja, which otherwise walls this set, on the switch, but also to trap opposing Imposters, allowing Kyurem-B to knock them out. Spore is another option if using Safety Goggles, as it allows Kyurem-B to put the Imposter to sleep, making it easier for Kyurem-B to remove it. Leech Seed doesn't cripple Imposters as much but allows for Kyurem-B to take HP from them and KOes Shedinja.</p> <p>Shift Gear not only allows for an easier sweep, but it can also lure Imposters in. Fake Out allows Kyurem-B to not only bluff a standard Refrigerate set, but also inflict free damage on foes and sometimes revenge KO on weakened Pokemon. U-turn helps to scout the foe's moves. It is particularly good on a Choice Band set.</p> <h1>Set Details</h1> <p>As the set's primary goal is to eliminate opposing Imposters, EVs are invested into HP to maximize Kyurem-B's bulk without increasing the Imposter's own survivability. The remainder is put to Attack for more power. However, if greater sweeping capability is desired, a spread of 4 HP / 252 Atk / 252 Spe can be used.</p> <p>Rocky Helmet is the preferred item, as all of Kyurem-B's attacks are contact moves, which whittles down the opposing Imposter as it tries to hit back. Safety Goggles are primarily used on a set running Spore, but the immunity to opposing Spore users is always handy. Choice Band gives Kyurem-B great wallbreaking capabilities while also inflicting more damage on Imposters than they can do back.</p> <h1>Usage Tips</h1> <p>This set can be used to bluff Extreme Speed sets, especially if Fake Out is run, so use this to force switches by threatening a KO with Extreme Speed.</p> <p>While Rocky Helmet can KO Shedinja after Endeavor, Kyurem-B cannot counter an Imposter at 1 HP, so avoid taking an Endeavor just to get rid of Shedinja. Additionally, if using Shift Gear to lure an Imposter in, do not boost too much while the Imposter is still alive, as, after several boosts, even resisted coverage moves can inflict large amounts of damage if Kyurem-B loses a Speed tie.</p> <h1>Team Options</h1> <p>Thanks to an Imposter's Frustration often being very weak, Pokemon that would otherwise have poor synergy with Kyurem-B can be good teammates, such as Giratina and Lugia. Sweepers weak to Imposters appreciate this Kyurem-B's ability to shut Imposters down and also to deal with certain walls such as Giratina.</p> <p>As it is weak to all entry hazards, Kyurem-B is greatly helped by Rapid Spin and Defog support. The given coverage moves mean that Kyurem-B has trouble breaking certain walls, such as physically defensive Registeel and Aegislash-Shield, so partners that can break them down are appreciated. This set is also checked by opposing -ate ability users, so Pokemon such as Aegislash-Shield help greatly to stop them. As this set is merely resistant to Imposters, rather than immune, it appreciates Wish support to help it do its job over the course of the match, especially against teams with two Pokemon with Imposter. If not running Infestation, a teammate that can eliminate Sturdy Shedinja, such as one with Mold Breaker + Pursuit, is necessary.</p> "
      },
      {
        "name": "Skill Link",
        "description": "<h1>Moves</h1> <p>With Skill Link, Icicle Spear has an effective Base Power of 125 and can bypass Substitute. The move also does not make contact, allowing Kyurem-B to handle Pokemon that are reliant on King's Shield or Rocky Helmet to check standard Refrigerate Kyurem-B. Bone Rush provides perfect coverage barring Levitate users and also benefits from Skill Link.</p> <p>Water Shuriken gives Kyurem-B reasonably hard-hitting priority and pick off certain fast and frail sweepers, such as Mega Aerodactyl, or other weakened Pokemon without the need to set up. However, if eliminating Pokemon such as Kyogre is more important, Bullet Seed is an option. U-turn is also an option to scout the foe and potentially bluff Refrigerate.</p> <p>Shift Gear is the preferred set up move to allow Kyurem-B to outspeed faster Pokemon. However, Swords Dance can be used instead to hit harder and also bluff Refrigerate. King's Shield lets Kyurem-B deal with Fake Out and Extreme Speed more easily. The move can also be run in the third slot if set up is needed more than additional coverage.</p> <h1>Set Details</h1> <p>The given EV spread allows Adamant Kyurem-B to outspeed Timid Mega Mewtwo Y after a single Shift Gear. This spread also still keeps an odd HP to minimize Life Orb and Stealth Rock damage. An alternative spread of 144 HP / 252 Atk / 112 Spe can be used to outspeed positive nature Deoxys-S after one boost. Another spread of 4 HP / 252 Atk / 252 Spe with a Jolly nature can be used to maximize Kyurem-B's sweeping potential.</p> <p>Life Orb significantly boosts Kyurem-B's power, allowing it to break past many Pokemon without needing to set up. Lum Berry gives some protection from otherwise crippling status. Finally, King's Rock gives just under a 50% chance to make the foe flinch after every multi-hit attack.</p> <h1>Usage Tips</h1> <p>While this set is not as immediately powerful as the Refrigerate set, it can lure in and deal with several checks, such as Substitute + Protect PP stall, King's Shield users, and certain strong walls, that the Refrigerate set and other physically offensive -ate ability users can have trouble with. As such, this set gets most of its mileage by bluffing a traditional Refrigerate set and not revealing its multi-hit moves until the time is right. Be wary of opposing Imposters, as they can invalidate the element of surprise.</p> <h1>Team Options</h1> <p>As this set's main draw is to lure in checks to -ate ability users, this set pairs excellently with any common -ate user, especially a second Kyurem-B running the first set. These -ate ability users also have the benefit of checking Imposters of this set very well. However, although Skill Link Kyurem-B has excellent coverage, something that can wall boosted neutral hits, such as Mega Slowbro, Unaware Cresselia, or Sturdy Shedinja, is mandatory to stop an opposing counter sweep if your -ate ability user cannot switch in safely against an Imposter.</p> <p>During the bluffing phase of the game, Kyurem-B is liable to force several switches, so it appreciates entry hazard support to rack up damage. It is also weak to all entry hazards, so Rapid Spin and Defog support are always appreciated. This set is weak to Shedinja, so a reliable counter to it, such as a Pokemon with Mold Breaker + Pursuit, is mandatory.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Rumors", "user_id": 194701}], "teams": [{"name": "Quality checked by", "members": [{"username": "MAMP", "user_id": 225453}, {"username": "Piccolo Daimao", "user_id": 219853}, {"username": "E4 Flint", "user_id": 203690}]}, {"name": "Grammar checked by", "members": [{"username": "Malley", "user_id": 243195}, {"username": "Empress", "user_id": 175616}]}]}
  },
  "Xerneas": {
    "overview": "<p>Xerneas's niche in Balanced Hackmons is as a bulky Fairy-type stallbreaker with overall good offensive stats. Its Fairy typing allows it to excel in a metagame rampant with Dragon- and Dark-types, such as Giratina, Mega Tyranitar, and Yveltal. The same typing also gives it weaknesses to not commonly offensive types in Poison and Steel, which are fairly offset by its decent bulk. It is also the only relevant Fairy-type in BH with a Fighting resistance. However, it faces stiff competition offensively from Mega Diancie, which has higher offenses and defenses but is frail, and defensively from Mega Audino, which has better bulk; therefore, Xerneas is best suited as a bulky sweeper.</p> ",
    "comments": "<h1>Other Options</h1> <p>Spore can provide Xerneas with more opportunities to set up, though Dark Void can be used instead to bypass Safety Goggles at the cost of lower accuracy. Xerneas can run a physical Poison Heal set using Play Rough, forgoing Quiver Dance for Shift Gear, though this makes it more challenging to accumulate boosts. A RegenVest set can function as a defensive pivot while still packing a punch, but Xerneas lacks the bulk to switch into the majority of the tier's heavy hitters, such as -ate users. Xerneas has a niche as a bulky Pixilate user, though Mega Diancie performs it better because it's noticeably stronger. As an Unaware user, Xerneas has some utility over Mega Audino in taking on Contrary Pokemon, such as Mega Mewtwo X, whose Fighting-type STAB moves Xerneas resists, and Mega Rayquaza, thanks to its more powerful Moonblast; however, Mega Audino is bulkier overall and can thus perform the role better. Xerneas can use Magnet Pull to trap Doom Desire Dialga and use Substitute to prevent itself from being hit by Dialga's only move, but if Dialga is not on the opposing team, Xerneas is often deadweight.</p> <h1>Checks and Counters</h1> <p><strong>Primal Groudon and Ho-Oh: Primal Groudon and Ho-Oh resist Xerneas's Moonblast and can survive it even after six Quiver Dance boosts. In return, Groudon can OHKO Xerneas with V-create and Ho-Oh can phaze Xerneas with Whirlwind. However, Groudon must be wary of Earth Power, and Ho-Oh struggles once Taunted.</p> <p><strong>Bulky Steel-types</strong>: With a resistance to Fairy, Registeel and Aegislash can switch into Xerneas's Moonblast comfortably. While Earth Power and Taunt help with these matchups, Xerneas will struggle with either Flash Fire or Magic Bounce variants depending on its moveset.</p> <p><strong>Mega Gengar: Mega Gengar easily takes on unboosted Xerneas and can set up on it with Shell Smash. Mega Gengar resists Xerneas's Moonblast and threatens Xerneas with a super effective Sludge Wave.</p> <p><strong>Unaware Pokemon</strong>: Unaware Pokemon, such as Mega Audino, don't fear Xerneas's boosted attacks. In return, these Pokemon can phaze Xerneas or steal its boosts with Heart Swap. However, Unaware users struggle against Xerneas running Taunt.</p> <p><strong>Prankster Pokemon</strong>: Prankster Pokemon bypass Xerneas's Speed boosts and can steal its Quiver Dance boosts with Heart Swap, lock it into a non-attacking move with Encore, or shut down its sweep with Topsy-Turvy. However, Prankster users must be wary of Xerneas's Taunt.</p> ",
    "sets": [
      {
        "name": "Stallbreaker",
        "description": "<h1>Moves</h1> <p>Taunt shuts down non-Magic Bounce walls, essentially turning them into complete setup fodder for Xerneas. It also allows Xerneas to reliably beat Recycle Shedinja. Quiver Dance boosts Xerneas's Special Attack and Speed, preparing it for a sweep, and can be used after a wall has been Taunted to ensure a safe setup. Moonblast is Xerneas's only STAB attack, OHKOing Mega Rayquaza after a single Quiver Dance boost. Will-O-Wisp cripples physical attackers and forces them out and also wears down walls; it also helps against Imposter users. Another option is Leech Seed, which provides Xerneas with more recovery in conjunction with Poison Heal and also helps with Imposter users and Shedinja. However, forgoing Will-O-Wisp leaves Xerneas vulnerable to strong physical attackers. Another alternative is Earth Power, which lets Xerneas beat Magic Bounce Steel-types and Primal Groudon at the cost of losing to Shedinja and, again, having trouble against physical attackers.</p> <h1>Set Details</h1> <p>The 252 HP and 36 Special Defense EVs guarantee that Xerneas survives a Sky Plate-boosted Boomburst from 4 SpA Mega Rayquaza prior to any Quiver Dance boosts. The remaining EVs contribute to Xerneas's physical bulk, as it already boosts its Special Defense with Quiver Dance. They also helps it avoid being revenge killed by -ate users. Toxic Orb activates Poison Heal, which provides passive healing and an immunity to other status ailments. It also makes Xerneas a good Knock Off absorber once Toxic Orb has activated along with its typing.</p> <h1>Usage Tips</h1> <p>Xerneas can switch into nearly any defensive Pokemon in the metagame once Toxic Orb is activated. Taunt forces most non-Quiver Dance walls out, giving Xerneas an opportunity to set up or burn the switch-in. Taunt should be used against stall Pokemon to prevent them from recovering. Thanks to Quiver Dance boosting its Special Defense and the burn from Will-O-Wisp crippling physical attackers, Xerneas can survive most unboosted attacks. After three Quiver Dance boosts, Xerneas can OHKO most offensive Pokemon with Moonblast, allowing it to begin a sweep.</p> <h1>Team Options</h1> <p>Entry hazard support in the form of Stealth Rock or Spikes is valuable, as Taunt forces many switches and Pokemon can be worn down by the hazards. This set struggles with Magic Bounce Registeel and Aegislash, so a reliable switch-in such as Magic Guard Ho-Oh or Red Orb Primal Groudon makes for a good partner. Alternatively, a Mold Breaker Pokemon such as Giratina can be used, as it can ignore Magic Bounce and set up entry hazards or inflict status. Giratina also makes for a good switch-in to Primal Groudon, which this set struggles with. If an Imposter user switches in and wins a Speed tie to Taunt Xerneas, Magic Bounce Registeel or Aegislash with Whirlwind makes for a good backup plan. They can also provide a slow U-turn to ensure that Xerneas's Toxic Orb activates safely. As Xerneas is primarily a stallbreaker, bulky Pokemon capable of handling strong Pokemon such as Mega Rayquaza and Mega Diancie are valuable teammates. Strong Pokemon such as Mega Rayquaza, Mega Mewtwo Y, and Mega Mewtwo X make for good offensive teammates, as they can weaken Xerneas's counters and clean up after Xerneas in return breaks down the Pokemon that wall them.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Enroyalle", "user_id": 55162}], "teams": [{"name": "Quality checked by", "members": [{"username": "E4 Flint", "user_id": 203690}, {"username": "morogrim", "user_id": 276906}, {"username": "Uselesscrab", "user_id": 167744}]}, {"name": "Grammar checked by", "members": [{"username": "P Squared", "user_id": 168392}, {"username": "Lumari", "user_id": 232216}]}]}
  },
  "Yveltal": {
    "overview": "<p>One of the more underrated defensive choices the Balanced Hackmons metagame has to offer, Yveltal stands out as one of the best checks to Mega Gengar and other Ghost-type Judgment users in the metagame due to its unique typing. Yveltal also functions as an excellent stallbreaker thanks to its great Speed tier, allowing it to outspeed common uninvested base 90 and 95 Speed Pokemon in the metagame and Taunt them. In addition, Yveltal's relatively high offensive stats for a wall mean it isn't as passive as most other walls, and its Dark STAB type makes Yveltal one of the few walls that can take advantage of Knock Off as both a primary attack and a utility move in addition to being able to absorb it as well. However, while Yveltal's bulk is not terrible, it isn't exceptional either, meaning Yveltal must more often than not rely on its typing in order to wall foes. Due to this downside, which means that it can only wall specific Pokemon, Yveltal isn't an ideal choice on most offensive teams as a wall, and it is better used with a defensive core on more defensively oriented teams. In addition, a weakness to Rock-type moves means Yveltal cannot perform as well when Stealth Rock is on the field, and weaknesses to Electric, Ice, and Fairy-type moves mean it cannot stand up to most Refrigerate and Pixilate users.</p> ",
    "comments": "<h1>Other Options</h1> <p>Aerilate and Gale Wings are options on Yveltal for both physically and specially offensive sets considering its Flying STAB type and decent attacking stats, but Mega Rayquaza often does this a lot better than Yveltal thanks to its considerably higher damage output, despite lacking STAB on Knock Off. RegenVest may seem like a better alternative to Poison Heal to allow Yveltal to take on special attackers even better than it already can, but the inability to use status moves and Yveltal's newly acquired weakness to sleep-inducing moves without Poison Heal usually make it an inferior option. Other status moves, namely Spore and Nuzzle, can be used over Will-O-Wisp, but these moves are not as effective on Yveltal as Will-O-Wisp is due to the move's ability to cripple physical attackers and cause passive damage. Foul Play can be used to heavily dent physical attackers, Sucker Punch is an option to outprioritize and heavily damage Mega Mewtwo Y and defeat Mega Gengar without taking damage, and Pursuit can be used to trap and KO Mega Gengar, but all of these Dark-type moves are rather redundant with Knock Off, which is too valuable for Yveltal to pass up on. Shift Gear and Coil can both be used over Swords Dance, with Coil having the useful side effect of increasing Will-O-Wisp's accuracy, but the direct power boost from Swords Dance is generally more useful than the Speed and Defense boosts. Oblivion Wing can be used due to its ability to simultaneously pose an offensive threat and heal Yveltal, but the additional coverage doesn't allow Yveltal to beat any additional notable Pokemon. Finally, various other support options such as Stealth Rock, Topsy-Turvy, Defog, U-turn, Circle Throw, Thousand Waves, Sacred Fire, and Worry Seed are all plausible choices in the final slot, but their utility is usually inferior to the utility granted by the moves listed on the main set.</p> <h1>Checks and Counters</h1> <p><strong>Poison Heal Users: The threat of a Swords Dance-boosted Knock Off does scare away some Poison Heal users, but the ones that don't mind taking a Knock Off, such as Mega Tyranitar, Mega Gyarados, Arceus, and Regigigas, have very little to fear from Yveltal thanks to their immunity to Will-O-Wisp and lack of use for their item after being poisoned. In return, they can overwhelm Yveltal with their STAB attacks and coverage moves.</p> <p><strong>Magic Bounce Users: While the loss of their item can be annoying, Magic Bounce users such as Registeel and Mega Audino completely wall Leech Seed and Taunt variants of Yveltal, and with moves such as Topsy-Turvy and Haze, they can take on Swords Dance variants as well. Alternatively, they can use a slow Baton Pass or U-turn to safely pivot in a strong attacker to pummel Yveltal, gaining momentum for their team and putting them in a favorable situation.</p> <p><strong>Fire-types: Due to their immunity to burns, Fire-types such as Ho-Oh, Reshiram, and Mega Blaziken can come in on Will-O-Wisp and threaten Yveltal with their Fire-type moves, though losing their item to Knock Off may be unideal. With Contrary, they can also smack Yveltal without fearing King's Shield and use it as setup fodder.</p> <p><strong>-Ate Ability Users: While they don't appreciate switching into Knock Off or Will-O-Wisp, when brought it via a bulky teammate with Baton Pass or U-turn or after a teammate has fainted, -ate ability users such as Mega Rayquaza and Mega Diancie can force out Yveltal under the threat of their powerful Boomburst.</p> ",
    "sets": [
      {
        "name": "Poison Heal",
        "description": "<h1>Moves</h1> <p>Knock Off is Yveltal's STAB move of choice, simultaneously giving Yveltal an offensive presence and the utility of item removal. Will-O-Wisp allows Yveltal to cripple physical attackers and burden Pokemon without Magic Bounce or Poison Heal with passive damage. Spiky Shield and King's Shield accomplish the same purpose of shielding Yveltal so that it can rack up Poison Heal recovery, but the choice comes down to which of the moves' effects is preferred. Spiky Shield is generally the superior choice, as it also shields Yveltal from status moves that Poison Heal does not block, such as Leech Seed and Entrainment, but King's Shield's secondary effect of halving the foe's Attack stat is arguably more useful than dealing chip damage. Should a more reliable method of recovery be desired, Recover is also an option in this slot; however, because Yveltal is usually fine without direct recovery, this isn't usually needed. Taunt is the move of choice in the last slot to allow Yveltal to also perform the role of a stallbreaker and turns Yveltal into a gigantic pain for defensive teams to handle. In tandem with King's Shield, it also allows Yveltal to stall out physical Poison Heal users to an extent. Leech Seed is another option in the last slot to better take on opposing attackers and defeat Shedinja more reliably, though it leaves Yveltal unable to do much to Magic Bounce and Poison Heal Pokemon. It also allows Yveltal to defeat Imposter users more easily. If Leech Seed is chosen, it is recommended not to use Recover in the third slot, as Leech Seed offers Yveltal more than enough recovery. Swords Dance may seem like a strange choice for a defensive Pokemon, especially because Yveltal has only one attacking move, but it allows Yveltal to better punish opposing Magic Bounce and Poison Heal users, which will usually switch into Yveltal in order to block Will-O-Wisp.</p> <h1>Set Details</h1> <p>Yveltal's EVs and nature allow it to always survive Timid Mega Gengar's Sludge Wave after a Tail Glow and KO it in return with Knock Off while simultaneously giving Yveltal a usable Defense stat in order to both stand up to physical attackers and burn them with Will-O-Wisp and take Secret Sword with ease. Poison Heal gives Yveltal both an immunity to status and substantial recovery after its Toxic Orb activates, considerably prolonging its longevity on the battlefield and allowing it to function as a great status absorber.</p> <h1>Usage Tips</h1> <p>Yveltal should mainly be used to combat Ghost-types that run Spooky Plate Judgment, which often give defensive teams trouble due to their resiliency to Imposter users. It is crucial not to let Yveltal's Toxic Orb be removed before it is activated, as without being poisoned Yveltal becomes nearly useless, especially if it is not using Recover. Using Spiky Shield and slow pivots to get Yveltal into play are the best ways of activating its Toxic Orb safely. King's Shield also works, but you must watch out for Trick and status moves such as Will-O-Wisp. In addition, if you plan to use Aromatherapy later on in the match, it's advisable not to let Yveltal's Toxic Orb get removed at all, as Yveltal will otherwise not be able to restore its poison. If Aromatherapy is not used on your team, however, it is encouraged to switch Yveltal into Knock Off users, as it functions as a great Knock Off absorber. For the same reasons Yveltal fears having its own Toxic Orb removed by Knock Off, Knock Off should be used against opposing Poison Heal users if you know the enemy team uses Aromatherapy, as this will greatly increase the effect of Will-O-Wisp on the opponent's Pokemon by discouraging Aromatherapy support. Yveltal can defeat Imposter users courtesy of their vulnerability to burns and remove their Eviolites as well, but it should be noted that they're able to Knock Off Yveltal's Toxic Orb despite crippling themselves in the process. Don't be afraid to use Spiky Shield or King's Shield liberally, as Yveltal needs to be at high health to function at its best. Both of these moves can also be used to scout the opposing team for dangerous moves and thus give you an idea of what teammate is best suited to handle your foe. Try not to let Stealth Rock reside on your side of the field for too long, as it diminishes Yveltal's ability to heal off damage due to the damage it takes when switching in. Taunt should be used against the opponent's walls in order to prevent them from accomplishing most of their intended tasks and allows Yveltal to function as a great stallbreaker. Finally, use Swords Dance if you expect a Magic Bounce or Poison Heal user to switch in, as most of them do not appreciate a Swords Dance-boosted Knock Off.</p> <h1>Team Options</h1> <p>Users of Defog are highly recommended alongside Yveltal to increase its overall performance. Because Yveltal forces many switches, entry hazards in the form of Stealth Rock and possibly Spikes greatly aid Yveltal. Registeel and Aegislash are examples of Pokemon that can both utilize Defog and set up hazards effectively. Physically bulky Fur Coat users such as Giratina and Mega Audino work very well alongside Yveltal to absorb the stronger physical hits thrown its way. Both of these Pokemon are also notable in that they can absorb Knock Off for Yveltal on teams using Aromatherapy courtesy of Griseous Orb and Audinite, respectively. -Ate ability switch-ins, such as Aegislash, Registeel, and Fur Coat Chansey, pair very well with Yveltal due to its vulnerability to Refrigerate and Pixilate users. Non-Imposter Chansey also makes for a great partner to take the special attacks that Yveltal cannot, courtesy of its gargantuan special bulk. Finally, Entrainment users are highly useful alongside Yveltal due to their ability to handle Poison Heal users. While any defensive Pokemon without Poison Heal itself can make use of the move, Mega Audino and Giratina are notable due to their excellent mixed bulk.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Klang", "user_id": 191951}], "teams": [{"name": "Quality checked by", "members": [{"username": "Uselesscrab", "user_id": 167744}, {"username": "E4 Flint", "user_id": 203690}, {"username": "Piccolo Daimao", "user_id": 219853}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}, {"username": "P Squared", "user_id": 168392}]}]}
  },
  "Diancie": {
    "overview": "<p>Mega Diancie is a powerful force in the Balanced Hackmons metagame. With its very high offenses, beaten in this aspect only by Deoxys-A and Mega Rayquaza, as well as its good Speed stat, it is an exceptionally powerful wallbreaker that teams need to prepare for. Its best set utilizes the ability Pixilate to fire off high-powered STAB attacks such as Boomburst, Techno Blast, and Extreme Speed, which become Fairy-type due to said ability. However, it is considered frail for the Balanced Hackmons metagame, despite possessing good defenses, due to its low HP. It is also mostly walled by the omnipresent Steel-types as well as Sturdy Shedinja, depending on Mega Diancie's coverage. Overall, it is an effective glass cannon.</p> ",
    "comments": "<h1>Other Options</h1> <p>Spiky Shield is an alternate option over King's Shield. Unlike King's Shield, this move will also block status moves such as Taunt, but instead of lowering Attack on contact it will cause the opponent to take damage. Thousand Arrows can be run over Precipice Blades for higher accuracy as well as the ability to bypass Ground immunities that would otherwise prevent Mega Diancie from hitting Pokemon such as Ho-Oh super effectively. Spore can be run as the fourth move due to it causing sleep; running Safety Goggles as an item is highly recommended in this case to prevent Pokemon with Magic Bounce or Pokemon that copied this set using Imposter from putting Mega Diancie to sleep instead. Dark Void can also be run over Spore to bypass the effects of Safety Goggles as well as hit Grass-types; however, it is harder to Imposter-proof this set if you choose to run it, and it also makes Magic Bounce harder to deal with. Infestation can be run as the fourth move to hit Sturdy Shedinja more reliably than Magma Storm, but this typically is not the best option. Explosion is the strongest move, power-wise, in all of Pokemon, even getting boosted by Pixilate, but due to the fact that it causes Mega Diancie to faint instantly, it typically isn't preferable. Judgment allows Mega Diancie to deal with almost any Pokemon you want by changing its item to the corresponding plate; keep in mind that this works best if you invest in Special Attack rather than Attack. Volt Switch is yet another option to preserve momentum on a predicted switch, but keep in mind that you need to be more careful around Primal Groudon, as it is immune to this and other Electric-type moves. Leech Seed KOes Sturdy Shedinja on the switch and heals Mega Diancie by a slight amount if used on anything else; keep in mind that this can be turned against Mega Diancie with Magic Bounce.</p> <p>In terms of different sets, a Choice Specs set can also be run to further increase Mega Diancie's power, but in most cases, the Pixilate set is the best one to use due to its revenge killing properties. A Choice Scarf set can also be run for surprise factor; if you choose to run this, Fake Out must be replaced by a coverage move. You can run Life Orb over Pixie Plate for the slight increase in power, but it typically isn't worth it due to the recoil impacting how many times you can use Mega Diancie.</p> <p>Of course, to get around recoil caused by Life Orb as well as any other sources, you can run a set utilizing Magic Guard, Head Smash, and Light of Ruin. This set does have its merits, such as also being immune to entry hazards, poison, and Leech Seed. You also have more options in terms of moves to take advantage of this, such as Flare Blitz to deal with Steel-types. In most cases, due to the revenge killing aspect as well as the power behind Pixilate Boomburst, the Pixilate set is better.</p> <h1>Checks and Counters</h1> <p><strong>Bulky Steel-types: Mega Diancie's coverage to hit Steel-types with is quite lacking. In particular, Flash Fire Steel-types will give Mega Diancie the most grief if it isn't running Precipice Blades or similar coverage. They also take Mega Diancie's attacks quite well, with specially defensive Registeel having a very low chance to be 3HKOed after Stealth Rock damage, barring critical hits.</p> <p><strong>Bulky Soundproof Pokemon: Mega Diancie's prime nuke is Boomburst. Of course, Soundproof prevents Boomburst from doing anything, as Boomburst is a sound move. In particular, physically defensive Soundproof Pokemon give this set a bit of grief, depending on the Pokemon. To get around Soundproof, Mega Diancie can run Techno Blast over Boomburst.</p> <p><strong>Red Orb Groudon</strong>: Red Orb Groudon can take any one attack from Mega Diancie thanks to its excellent bulk and Fire typing. However, many Red Orb Groudon, especially those with minimal HP, Defense, or Special Defense investment, can be easily knocked out in two hits by a move like Boomburst or Techno Blast if Mega Diancie has Special Attack investment or by a move like Precipice Blades if Mega Diancie has Attack investment. That being said, should Primal Groudon get a free switch, it wins regardless of which Mega Diancie set is used, making it an adequate check overall.</p> <p><strong>Mega Mewtwo Y</strong>: Despite not being able to switch in on Mega Diancie's attacks, if Mega Mewtwo Y gets a free switch it can be a problem for Mega Diancie. In particular, Mega Mewtwo Y can use King's Shield to block Mega Diancie's Extreme Speed and cause the latter Pokemon's Attack to drop by two stages.</p> ",
    "sets": [
      {
        "name": "Pixilate",
        "description": "<h1>Moves</h1> <p>Fake Out is used for outprioritizing other commonly used priority moves such as Extreme Speed, and for free damage on the foe. Extreme Speed is the most powerful priority move that currently exists, and it has a higher priority than most other priority attacks barring Fake Out and Feint. Boomburst bypasses the effects of Substitute. This move is oftentimes the go-to move to use due to its sheer power, even without investment. Techno Blast is an alternate option over Boomburst that has fewer PP and slightly less power, and while it doesn't bypass the effects of Substitute, it does bypass the effects of Soundproof. All four of these moves are boosted by Pixilate, and three out of the four options, most commonly Fake Out, Extreme Speed, and Boomburst, should always be used on Mega Diancie. In terms of the final move, several options can be run depending on preference. King's Shield can be used to scout the foe's moveset, as well as protect Mega Diancie from most non-status moves. It can also sharply lower the foe's Attack if they make contact. This effect applies to moves such as Fake Out from opposing Mega Rayquaza or Mega Diancie. Magma Storm hits Steel-types, which are the only Pokemon that are going to be walling Mega Diancie's STAB moves barring Fur Coat Chansey and defensive Fire-types, super effectively. It also destroys Sturdy Shedinja, another Balanced Hackmons threat, due to the residual damage bypassing its ability. Precipice Blades is an alternate option to hit both Steel- and Fire-types super effectively; both of these types resist Mega-Diancie's STAB moves, with the latter also resisting Magma Storm, making this move a great alternate option.</p> <h1>Set Details</h1> <p>On this set, the Attack EVs are maximized to make sure Fake Out and Extreme Speed do the most damage possible, and Speed EVs are maximized to outpace other Mega Diancie. However, if you want Boomburst to deal more damage rather than these two moves, you can move the EVs from Attack into Special Attack, which allows said move to 2HKO Primal Groudon and prevent non-Choice Scarf variants from switching in. A Hasty or Naive nature, depending on preference, is run to outpace other Mega Diancie, in addition to the rarer neutral-natured Mega Rayquaza. If you desire more power, you can run a positive nature in either Attack or Special Attack. Pixilate is the ability of this set for obvious reasons; it turns Mega Diancie's Normal-type moves into Fairy-type STAB moves, with a power bonus. Without this ability, there is virtually no reason to run these moves, unless you're attempting to bluff a different set your opponent. In terms of items, Pixie Plate is the preferred option to boost the power of the main attacks without any drawbacks. Safety Goggles is another viable option to prevent Prankster Spore, or just Spore in general.</p> <h1>Usage Tips</h1> <p>Fake Out and Extreme Speed should be the primary options if your opponent's Pokemon can outspeed or outprioritize Mega Diancie. If this isn't true, or you predict your opponent to use King's Shield or something similar, clicking Boomburst is most likely the best option, as it does the most damage, even without investment. If Mega Diancie's fourth move can hit the foe super effectively and does more damage than Boomburst, or is one of the shields, using it is most likely the best option. This is most likely obvious due to Mega Diancie's low bulk, but it is highly advised not to switch Mega Diancie in blindly, as it will take quite a bit of unnecessary damage, even from resisted hits.</p> <h1>Team Options</h1> <p>A teammate that can deal with Steel-types reliably, such as Primal Groudon, is preferred, unless you decide to run the corresponding coverage move. Dealing with Sturdy Shedinja is also quite important, especially if Mega Diancie's fourth move is either King's Shield or Precipice Blades, as it can stop Mega Diancie in its tracks. Mold Breaker Pursuit and entry hazard support are some of the best ways to deal with it. Any Pokemon can fulfill at least one of these roles, but one of the best is Primal Groudon due to its bulk and offensive pressure. In addition to entry hazard support, a teammate that has a method to clear entry hazards from your side of the field, such as Defog, will also aid in making sure Mega Diancie doesn't take too much prior damage, as its bulk is quite low for Balanced Hackmons standards.</p> <p>Because Mega Diancie also has issues dealing with Primal Groudon, Giratina, especially Fur Coat variants, also makes for an excellent teammate. Additionally, if Giratina gets copied via Imposter or a similar method, Mega Diancie can force it out. A Steel-type of your own, such as Registeel or Aegislash, as well as Sturdy Shedinja depending on Mega Diancie's moveset, is also a good partner in the all-too-common case that your Mega Diancie becomes copied by an Imposter. This is to prevent your own Mega Diancie set from sweeping you, which is exceptionally crucial to making a good Balanced Hackmons team. Another potential partner could be either an Assault Vest + Regenerator Pokemon or a Soundproof Pokemon to deal with your own Mega Diancie set as well as other Mega Diancie in general.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Pikachuun", "user_id": 171701}], "teams": [{"name": "Quality checked by", "members": [{"username": "Uselesscrab", "user_id": 167744}, {"username": "Piccolo Daimao", "user_id": 219853}, {"username": "E4 Flint", "user_id": 203690}]}, {"name": "Grammar checked by", "members": [{"username": "GatoDelFuego", "user_id": 91628}, {"username": "P Squared", "user_id": 168392}]}]}
  }
}