{
  "Suicune": {
    "overview": "<p>Suicune is one of the more difficult Pokemon to use in this format thanks to Primal Groudon and its Desolate Land. However, with the right support, Suicune can catch people off guard and take down some of the metagame's biggest threats on its own. Base 100 / 115 / 115 defensive stats give Suicune a considerable amount of bulk, and its Water typing makes Suicune weak to only two types. Suicune's limited support movepool comes in handy to create various disrupting plays like using Snarl to weaken your opponent's offensive options and Tailwind to increase your team's Speed. Suicune is one of the few Pokemon in the metagame that easily shrug off both Primal Groudon's Eruption and Primal Kyogre's Water Spout while hitting both Primal Groudon and Rayquaza for super effective damage. While Suicune plays a huge supportive role in your team, it exerts little to no offensive pressure against the likes of Kyogre and Xerneas and is completely ineffective and helpless in Primal Groudon's harsh sun. Pokemon like Thundurus can easily shut down its support option with Taunt and can KO Suicune with super effective Thunderbolts, while Primal Kyogre completely walls Suicune and KOes it with Thunder. In short, Suicune works much like Cresselia but provides better bulk in a metagame focused around the Primal Reversions and can help set up different types of speed control.</p>",
    "comments": "<h1>Other Options</h1> <p>Mirror Coat can be used to easily OHKO any Xerneas and Thundurus, as it avoids redirection, providing a foolproof plan to beat down the biggest threats in one hit and allowing Suicune to be viable offensively. Assault Vest works well with this strategy, if you don't mind dropping Tailwind or if your team has a different form of speed control, though this makes Suicune much more susceptible to sleep. Chesto Berry works as a viable option if another Pokemon like Crobat is already using Lum Berry, which also opens up another option in the form of Rest for recovery. Reflect could be used to make your team more physically bulky to survive powerful attacks from the likes of Mega Rayquaza, though this makes Suicune Taunt bait in a best of three environment. Additionally, if you feel that your team needs more offense, Suicune can run an offensive set with a Modest nature and 116 Special Attack EVs to OHKO Mega Salamence with Ice Beam; this, however, is not recommended, as it makes Suicune much more fragile in a metagame centered around powerhouses.</p> <h1>Checks and Counters</h1> <p><strong>Electric-types</strong>: Electric-types like Thundurus and Raichu easily KO Suicune with super effective STAB moves, as they are usually faster than most Pokemon in the format. Thundurus also has the added aid of Taunt to shut down Suicune's support options. Thunder from Primal Kyogre also deals quite an amount of damage.</p> <p><strong>Grass-types</strong>: Grass-types like Ferrothorn and Amoonguss wall Suicune and proceed to KO it with Power Whip and Leech Seed or put it to sleep with Spore, respectively. These Pokemon also serve as counters to Mega Kangaskhan, which is usually paired with Suicune for Fake Out support.</p> <p><strong>Bulky Water-types</strong>: With its high Special Defense and Water typing, Primal Kyogre walls Suicune and can whittle down its health with relative ease, especially if it runs Thunder for coverage. Other Water-types like Gastrodon and Slowbro wall Suicune with ease as well.</p> <p><strong>Smeargle</strong>: Like most Pokemon in the metagame, Suicune suffers from being put to sleep by Smeargle, which usually outspeeds it, unless you have Tailwind set up. Due to Suicune's mediocre offensive stats, Scald fails to deal sufficient damage to Smeargle, allowing it to use Dark Void on the rest of your Pokemon. This forces players to make a decision as to whether to run Lum Berry or Sitrus Berry.</p> <p><strong>Strong Attackers</strong>: Despite Suicune's bulk, restricted Pokemon like Xerneas and Mega Rayquaza can easily take down Suicune with little effort. The fast-paced nature of VGC 2016 forces Suicune players to run a variety of Pokemon that have different types to allow for some decent switching options. Other Pokemon like Mega Kangaskhan deal quite a lot of damage with Helping Hand support.</p> <p><strong>Desolate Land</strong>: Suicune becomes functionless in Primal Groudon's Desolate Land and requires the aid of Air Lock to work. This makes Suicune a sitting duck when facing a Primal Groudon if your Rayquaza has already fainted, forcing you to stall out games with Roar or Icy Wind.</p>",
    "sets": {
      "Tailwind Disruptor": {
        "description": "<h1>Moves</h1> <p>Tailwind is Suicune's main form of speed control, allowing your offensive team members to outspeed and KO the opposing Pokemon with their powerful spread moves, such as Geomancy-boosted Xerneas, which is one of the most common Pokemon in the metagame. Scald is Suicune's primary STAB move to OHKO any opposing Primal Groudon if Air Lock or Primordial Sea is active and can be used on most physical attackers thanks to its 30% burn chance. Icy Wind is generally used as an additional form of speed control and hits Mega Salamence and Rayquaza super effectively, while Ice Beam deals higher amounts of damage to those Pokemon. Roar is often used as an option to phaze Geomancy-boosted Xerneas to reset its boosts as well as stop the activation of Trick Room, which is important because Suicune is primarily used on fast, offensive teams. Roar also has the added utility of phazing Smeargle to get rid of annoying Moody boosts. Snarl can be used in the final slot to provide additional disruption, weakening Primal Kyogre and Xerneas.</p> <h1>Set Details</h1> <p>Sitrus Berry is used to maximize Suicune's longevity, but Lum Berry can be used to lead against Smeargle users and set up Tailwind as early as possible to begin your team's offensive onslaught. Unfortunately, Suicune's ability, Pressure, doesn't make much of an impact in this format, other than making Eruption run out of PP much faster. This set is EVed to survive as many physical attacks as possible. 252 HP and 156 Defense EVs along with a Bold nature give Suicune enough physical bulk to have a 10.5% chance to avoid the 2HKO from Mega Rayquaza's Dragon Ascent. Additionally, this spread makes sure Suicune survives Mega Rayquaza's Helping Hand-boosted Dragon Ascent, which happens to be one of the strongest physical attacks available in the VGC 2016 metagame. 100 Special Defense EVs help Suicune survive +2 Xerneas's Moonblast 87.5% of the time, which allows it to retaliate with a Roar after taking a hit.</p> <h1>Usage Tips</h1> <p>Suicune's primary usage is that of a support Pokemon similar to Cresselia. Keep Suicune on the field to disrupt your opponent's Pokemon while ensuring you have a form of speed control on the field. Suicune is often used with Rayquaza to take advantage of Air Lock, allowing it to hit Talonflame and Primal Groudon with a super effective Scald, which usually OHKOes the latter. Leading Suicune against a Trick Room team to Roar their setter away is often the preferred play, though it should be wary of redirectors. Suicune should lead with a Fake Out user to help it set up Tailwind or phaze the opposing threats, allowing you to gain momentum as quickly as possible. Icy Wind is commonly used against Rayquaza + Primal Kyogre teams when paired with a Primal Groudon, as a combination of Eruption and Icy Wind is usually enough to KO Rayquaza on the switch, securing you the win. Additionally, Icy Wind can be used against teams with both Primal Reversions that have their own Tailwind, which allows your Pokemon to be the fastest on the field. Roar can be used against such teams as well to shut down any Trick Room attempt. As people are aware of Roar's existence, they might bait Suicune into using Roar on their Xerneas, only to hit you with a Moonblast or Dazzling Gleam, making you lose momentum.</p> <h1>Team Options</h1> <p>Rayquaza makes an excellent partner to any Water-type Pokemon like Kyogre or Suicune. Rayquaza hurts Dragon-types and Primal Kyogre hard, which usually wall Suicune. Primal Groudon is immune to Electric-type moves, usually from Thundurus, forming a good core with Suicune and Rayquaza while providing some switch options. It also is often used to KO Mega Mawile and Ferrothorn, two of the metagame's biggest Steel-type threats, which can easily take down any Rayquaza that doesn't run Overheat. It should be noted that Groudon's Desolate Land is counterproductive with Water-types, forcing the player to run a weather-negating ability like Cloud Nine or Rayquaza's Air Lock for the core to function effectively. As Mega Rayquaza + Primal Kyogre and Xerneas + Primal Kyogre teams may be the most difficult matchups for this trio, Ferrothorn is often run alongside Suicune, since it hits Kyogre and Xerneas hard for super effective damage. Xerneas itself is a good partner to Suicune, when paired with Rayquaza, since Suicune can stop any Trick Room attempts that thwart Xerneas and also takes down Primal Groudon when Air Lock is active. Geomancy-boosted Xerneas along with Suicune's Roar to stop Trick Room forms a formidable core. Electric-types such as Thundurus make solid partners for Suicune, damaging most Water-types like Primal Kyogre that wall Suicune for super effective damage while providing an additional form of speed control via Thunder Wave and using Taunt to shut down Smeargle, which usually gives Suicune a lot of trouble. Raichu can work in this slot as well to draw out Electric-type attacks thanks to its Lightning Rod ability and to provide Fake Out support. Steel-types like Scizor are worth a mention, as they can help take down Xerneas + Mega Rayquaza teams, which usually use a hyper offensive playstyle. Scizor's priority attacks can be used to deal with Smeargle as well, one of the most-used Pokemon in the format. One of the unrestricted Pokemon often used with Suicune is Mega Kangaskhan, as Fake Out support is vital to any team when trying to establish a form of speed control.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Mr.GX", "user_id": 239881}], "teams": [{"name": "Quality checked by", "members": [{"username": "Carbonific", "user_id": 233942}, {"username": "Jio", "user_id": 22788}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}, {"username": "P Squared", "user_id": 168392}]}]}
  },
  "Giratina-Origin": {
    "overview": "<p>Giratina-O is given an opening in the metagame as a result of its great matchup against Primal Kyogre and Primal Groudon. This is especially true in the latter's case, as Giratina-O's Levitate ability grants it an immunity to Ground-type moves. Offensively, its typing is good, as Ghost provides excellent neutral coverage. In fact, Giratina-O can easily get away with only running Ghost-type coverage, particularly given its signature move, Shadow Force, which is capable of breaking through the very common Protect. It also possesses good defensive stats and a total of six resistances and three immunities, including from its ability, which allows it to take attacks well from many of the format's most prominent attackers. Further, Giratina-O's decent support movepool, including moves such as Will-O-Wisp and Tailwind, allows it to be flexible in supporting its team. However, Giratina-O struggles against Xerneas and teams that take advantage of Yveltal's Dark Aura, which is problematic because both are relatively common. Its base 90 Speed stat is also awkward, as it is only just enough to Speed tie with Primal Kyogre and Primal Groudon, which doesn't help much. Furthermore, being forced to use Griseous Orb to maintain its forme means that it lacks the item versatility other Pokemon do. A lack of spread moves also makes it less appealing offensively compared to other restricted Pokemon such as Primal Groudon and Xerneas. Giratina-O can be effective given the right team, but ensure it's not outclassed by its alternate forme, Giratina, by taking proper advantage of its comparatively superior offensive stats.</p>",
    "comments": "<h1>Other Options</h1> <p>While Dragon Claw takes better advantage of Giratina-O's higher Attack stat, Draco Meteor OHKOes most Dragons regardless and is not affected by Intimidate. Dragon Tail could be used to phaze Trick Room setters and setup sweepers, with the exception of Xerneas. Icy Wind and Thunder Wave can provide an alternative form of speed control. Icy Wind has the advantage of hitting 4x Ice-weak foes such as Landorus-T and Mega Salamence hard. Thunder Wave, being that it inflicts status, is more permanent and reduces the chance a foe has to move. Destiny Bond takes a foe with Giratina-O when it faints, but Giratina-O is not fast enough to take proper advantage of it. Magic Coat reflects status from moves such as Smeargle's Dark Void back at the opponent's side of the field. Safeguard similarly serves as a check to status by making Giratina-O and its teammates immune to them for five turns. Giratina-O has a good special movepool, with access to moves such as Dragon Pulse and Earth Power. However, these are rarely worthwhile, as the combination of Shadow Force and Draco Meteor generally enables Giratina-O to pick up the KOs the aforementioned moves can.</p> <h1>Checks and Counters</h1> <p><strong>Dragon-type Pokemon</strong>: While Giratina-O can hit them with Draco Meteor, certain Dragons are nevertheless problematic. Mega Rayquaza outspeeds Giratina-O and can OHKO it with a Draco Meteor of its own. It also commonly holds a Focus Sash, which allows it to survive a single strong attack. Dialga's Steel typing means it takes Dragon-type attacks neutrally, and it can OHKO Giratina-O with Draco Meteor. Kyurem-W can not only KO Giratina with a Dragon-type attack but also make use of a super effective Blizzard under Gravity as well.</p> <p><strong>Dark-type Pokemon</strong>: Dark-types resist Ghost-type moves and hit Giratina-O hard with their super effective STAB moves. Yveltal's Dark Aura-boosted attacks easily dispatch Giratina, and it can outprioritize it with Sucker Punch. Weavile deals great damage with Icicle Crash, particularly when holding a Life Orb, and can use Ice Shard for priority. Liepard can utilize both the super effective Foul Play and Encore, which can lock Giratina into ineffectual support moves.</p> <p><strong>Fairy-type Pokemon</strong>: Fairy-types are more easily able to switch into Giratina-O's attacks thanks to their immunity to Dragon. Xerneas is particularly problematic, as its Fairy Aura-boosted attacks deal massive damage, being capable of OHKOing Giratina after a Geomancy boost. Mega Mawile, while admittedly threatened by Will-O-Wisp, deals a large amount of damage to Giratina with Play Rough.</p> <p><strong>Intimidate and Burns</strong>: Intimidate and burn are problematic for Giratina-O, as they reduce the damage output of its physical attacks. Intimidate users such as Landorus-T lower Giratina's Attack by one stage when they switch in. Will-O-Wisp users such as Gengar and Sableye cut Giratina's Attack in half by burning it. Further, the chip damage this inflicts is useful for whittling away Giratina-O's HP given its natural bulk.</p> <p><strong>Smeargle</strong>: Smeargle outspeeds uninvested Giratina-O, can use Dark Void against it, and is unaffected by Ghost-type moves, making it difficult to deal with.</p>",
    "sets": {
      "Bulky Attacker": {
        "description": "<h1>Moves</h1> <p>Shadow Force is Giratina-O's primary STAB attack, boasting a high Base Power and the bonus of breaking through Protect. Shadow Sneak provides STAB priority to compensate for Giratina-O's fairly average Speed. Tailwind can be used instead if you'd prefer Giratina-O to have the ability to supply speed control for its team. Draco Meteor OHKOes opposing Dragon-types but can also be used if Giratina's Attack stat has been lowered, for example, as a result of Intimidate or burn. If KOing Dragons is not an issue, then Will-O-Wisp can be used to neuter opposing physical attackers instead. Protect defends Giratina for a turn while its partner eliminates a threat or switches to improve positioning. If Will-O-Wisp is chosen, Protect can also help stall out burn inflicted on foes. If you want Tailwind or Will-O-Wisp and don't wish to drop a coverage move, either can also be used over Protect.</p> <h1>Set Details</h1> <p>Griseous Orb is required for Giratina to stay in its Origin forme and also boosts its Ghost- and Dragon-type attacks by 20%, which is valuable given that Giratina-O rarely strays from these attacking types. Griseous Orb also prevents a foe from dealing increased damage with Knock Off, as it can't be removed. Levitate is Giratina-O's only ability, but an immunity to Ground-type attacks is valuable against attackers like Primal Groudon. An Adamant nature and 252 Attack EVs are used to maximize the output of Giratina's physical attacks. If Giratina-O is being used on a team featuring Trick Room, a Brave nature and 0 Speed IVs can be used instead in order to move sooner under its effect. Defensively, the EVs make both Primal Groudon's Precipice Blades under Gravity and Life Orb Talonflame's Brave Bird a 3HKO. With regards to special attacks, they also prevent an OHKO from Timid Xerneas's Moonblast before a Geomancy boost. EVs can be taken out of Attack and placed into Defense or Special Defense if you'd prefer Giratina-O to be bulkier. An example is dropping down to 140 Attack EVs to OHKO 252 HP / 4 Def Aegislash in Shield forme. This can be more appealing if a more supportive build is preferred. More Speed EVs may be tempting, but there's nothing relevant until maximum Speed to Speed tie with Primal Kyogre and Primal Groudon.</p> <h1>Usage Tips</h1> <p>Giratina-O is fairly flexible with regards to when it can be brought out, although it does a good job at cleaning up during the late-game thanks to its priority Shadow Sneak. With that said, support-focused builds might prefer to be brought in the early-game to help set up Tailwind and burn foes for Giratina-O's partners. If up against a team centered around utilizing Yveltal's Dark Aura, you may wish to leave Giratina-O on the bench due to its exceptionally poor matchup in such a situation. Shadow Force is a safe move most of the time due to its high damage and ability to break through Protect. In fact, even if Draco Meteor would deal slightly more damage, the latter reason often makes Shadow Force the preferred option. No Pokemon resists the combination of Ghost- and Fighting-type moves, so doubling into a foe with those types is a great option for safe damage. Be cautious of Sucker Punch users, as even Shadow Sneak will often fail to outpace them due to Giratina-O's low Speed.</p> <h1>Team Options</h1> <p>Mega Kangaskhan appreciates Giratina-O's Fighting-type immunity and can help support Giratina-O with Fake Out. Smeargle makes for a good partner for similar reasons and can also redirect Ghost-type moves using Follow Me with ease as a result of its immunity to them. Primal Kyogre's special attacks complement Giratina-O's physical ones, and it appreciates the Tailwind support Giratina-O provides. Primal Groudon equally appreciates Tailwind, and Giratina-O can switch into Ground-type moves that would hit it super effectively thanks to Levitate. Landorus-T can use Earthquake freely alongside Giratina-O thanks to Levitate, and the Attack drop provided by its Intimidate further improves Giratina-O's bulk. Talonflame provides a Fairy-type resistance, and the combination of Brave Bird and Shadow Sneak can be useful to pick up quick KOs. Crobat can be a valuable partner, as its Super Fang can help turn Giratina-O's attacks from close misses into KOs. Ferrothorn is a great check to Xerneas, which threatens Giratina-O, as a result of Gyro Ball's high Base Power after Xerneas has gotten a Geomancy boost. Mega Mawile is also well equipped to check Xerneas thanks to its STAB-boosted Iron Head, and it can additionally beat Dark-types for Giratina-O. A Xerneas of your own could be useful to dispatch opposing Dark- and Dragon-types with ease. Cresselia can set Trick Room for Giratina-O to compensate for its Speed, and Helping Hand aids it in picking up OHKOs.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Carbonific", "user_id": 233942}], "teams": [{"name": "Quality checked by", "members": [{"username": "Jio", "user_id": 22788}, {"username": "Jibaku", "user_id": 1779}]}, {"name": "Grammar checked by", "members": [{"username": "P Squared", "user_id": 168392}, {"username": "fleurdyleurse", "user_id": 195877}]}]}
  },
  "Cresselia": {
    "overview": "<p>As one of the most dominant Trick Room setters in the format, Cresselia has a large target on its back, and for good reason. Its excellent natural defenses make it one of the bulkiest Trick Room setters available, and its Levitate ability is also great in a metagame where Ground-type attacks are prevalent. Additionally, its large support movepool makes it very versatile and therefore able to pair well with many other common Pokemon; notably, access to a variety of support moves such as Magic Coat can make it unpredictable to battle against. An above average Speed stat and access to both Icy Wind and Thunder Wave also allow it to function outside of Trick Room should the need arise. However, its typing is mediocre defensively, as while it tanks many neutral attacks, a weakness to Dark-type attacks hurts it, particularly against teams with Yveltal, which are often geared to take full advantage of its Dark Aura ability. That same typing in combination with a low Special Attack stat also gives it very little offensive presence and therefore makes it vulnerable to Taunt and being set up on by Pokemon like Xerneas. Finally, it faces competition from restricted Trick Room setters such as Dialga and Palkia, which boast much greater offensive presence, provided a restricted Pokemon slot is available.</p>",
    "comments": "<h1>Other Options</h1> <p>Psyshock can be used in place of Psychic if hitting a foe's potentially lower Defense stat is more important. Light Screen and Reflect can reduce the damage Cresselia's team takes from special or physical moves. Swagger reduces the chance the foe has to move and can be used as part of a self-Swagger combination to boost the Attack stat of an ally. Moonlight can be effective on teams with Primal Groudon, as the sun causes Cresselia to heal significantly more health. Safeguard and Magic Coat provide means of preventing sleep-inducing moves such as Smeargle's Dark Void. Lum Berry and Chesto Berry also prevent sleep-inducing moves, and the latter could be used in combination with Rest. Leftovers can be used if Sitrus Berry is in greater demand on a teammate as a result of the item clause. A physically defensive EV spread such as 204 HP / 156 Def / 148 SpD with a Relaxed nature, which makes Adamant Mega Kangaskhan's Return a 3HKO, is viable in combination with a Rocky Helmet to punish physical attackers. Using this spread with the aforementioned Moonlight can be a great way to deal continuous chip damage. Using Cresselia on a semi-Trick Room team with a Calm or Bold nature and Icy Wind over Ice Beam or Thunder Wave in the fourth moveslot is possible if you'd prefer to have additional options for speed control. However, bear in mind that Icy Wind's Speed drops are easily removed by switching and that Primal Groudon is immune to Thunder Wave.</p> <h1>Checks and Counters</h1> <p><strong>Typing Advantage</strong>: Dark-types such as Yveltal and Weavile are immune to Psychic and deal a lot of damage with their super effective STAB moves. Yveltal checks Cresselia particularly well, as it can OHKO it with a Black Glasses-boosted Knock Off. Ghost-types such as Mega Gengar, Giratina, and Aegislash also heavily threaten Cresselia. Mega Gengar notably has a high chance to OHKO Cresselia if its common partner, Whimsicott, uses Fake Tears on it. However, it should be wary of its weakness to Psychic. Steel-types such as Mega Mawile and Scizor resist both Psychic and Ice Beam and can also inflict a lot of damage. Scizor can steal and eat Cresselia's Sitrus Berry with Bug Bite as well. Both also don't mind Trick Room, as they function reasonably well under its effect.</p> <p><strong>Speed</strong>: Very slow Pokemon can turn Cresselia's Trick Room against it, as they can move first under its effect. Amoonguss is particularly problematic, as it can freely spam Spore and therefore ruin momentum by putting Cresselia's team to sleep. Ferrothorn's similarly low Speed stat means it's free to fire off Gyro Ball and Power Whip. Pokemon with priority are also less affected by Trick Room, as they're able to move first regardless. For example, Talonflame's Gale Wings allows it to move first even under Trick Room when it uses Flying-type moves.</p> <p><strong>Speed Control</strong>: Opposing Trick Room setters such as Dialga, Palkia, and Gothitelle can revert the effects of Trick Room by using the move themselves. Quash Sableye can also send Cresselia's teammates to the bottom of the move order, regardless of Trick Room. Slow After You users such as Clefairy and Togetic can also allow faster foes to move first. Thunder Wave users such as Liepard and Thundurus can use the move on their own teammates to slow them down under Trick Room, although this then comes with the risk of full paralysis.</p> <p><strong>Strong Physical Attackers</strong>: Because Cresselia usually invests more into Special Defense, it's generally more susceptible to strong physical attackers. Mega Kangaskhan is a prime example, as it deals massive amounts of damage with Return or Double-Edge. Mega Rayquaza, while having to be wary of Ice Beam, deals a lot of damage with Dragon Ascent. Mega Salamence is also troubled by Ice Beam, but its Double-Edge deals equally large amounts of damage. Primal Groudon can also hit Cresselia with Precipice Blades for excellent damage after its Levitate ability has been removed through the use of Skill Swap.</p> <p><strong>Utility Moves</strong>: Taunt users such as Crobat, Thundurus, and Whimsicott shut down Cresselia not holding Mental Herb, as it's dependent on its non-attacking moves to support its team. Encore users such as Liepard and Whimsicott can force Cresselia to revert a recently set up Trick Room. Roar and Whirlwind users such as Groudon and Ho-Oh can force Cresselia to switch before it sets up Trick Room thanks to them having higher priority. Finally, copious use of moves like Protect and Substitute does a good job at stalling out Trick Room's limited turns.</p> <p><strong>Miscellaneous</strong>: Sheer Cold users such as Lapras and Smeargle can eliminate Cresselia from the field in a single hit and therefore circumvent the need to deal with Cresselia's immense bulk.</p>",
    "sets": {
      "Trick Room Setter": {
        "description": "<h1>Moves</h1> <p>Trick Room reverses the move order of all Pokemon the field, providing Cresselia and its slower teammates the opportunity to move quicker under its effects. A damaging move is useful to stop Cresselia from being total Taunt bait. Ice Beam deals good damage to foes 4x weak to Ice such as Mega Rayquaza, Mega Salamence, and Landorus-T. Psychic is an alternative option if Ice-type coverage is unneeded, as it hits Amoonguss and neutral targets harder. Helping Hand boosts the power of an ally's attack and often results in a higher damage output than Cresselia could achieve on its own. Skill Swap is primarily used to regain control of the weather by using it on an allied Primal Groudon or Primal Kyogre. Gravity increases the accuracy of all Pokemon by two stages and allows Ground-type moves to hit Flying-types and Pokemon with Levitate. Skill Swap is generally the more useful of the two, but if maintaining control of the weather is less important for Cresselia, such as when its teammates have alternative means to control the weather, then Gravity may be more appealing.</p> <h1>Set Details</h1> <p>Sitrus Berry is used to maximize Cresselia's overall bulk, but Mental Herb can be used instead if Taunt is more threatening to setting up Trick Room than damage is. Levitate is Cresselia's only ability, but it's an excellent one. The prevalence of Ground-type attacks as a result of Primal Groudon not only provides Cresselia with a great immunity but also makes Levitate a good ability to Skill Swap away to a vulnerable partner. A Speed-reducing nature is used to allow Cresselia to move quicker under the effect of Trick Room. The HP EVs grant Cresselia an even number of HP, which allows Sitrus Berry to activate after taking a Super Fang from Crobat. The remaining investment makes both Jolly Mega Kangaskhan's Double-Edge and Modest Primal Groudon's Eruption a 3HKO factoring in Sitrus Berry's recovery. When using Mental Herb, an alternative EV spread of 252 HP / 60 Def / 196 SpD should be used instead to make +2 Modest Xerneas's Dazzling Gleam a 3HKO. While using 0 Speed IVs is generally recommended to make Cresselia as slow as possible under Trick Room, running 4 or more may also be useful to use Skill Swap after a foe's Cresselia under Trick Room, as this causes your team's weather to activate second and prevail over the opposing team's.</p> <h1>Usage Tips</h1> <p>Cresselia should preferably be led in combination with a Fake Out user or redirection user to provide the best chance of setting up Trick Room, which it should aim to do as early as possible in order to provide the maximum opportunities for partners to sweep. Try to determine early on if you'll need Cresselia to set up Trick Room multiple times to help decide whether to conserve it after its initial activation. Once set up, Cresselia should mostly aim to use Helping Hand in combination with powerful spread attacks such as Precipice Blades and Origin Pulse in order to deal as much damage as possible during Trick Room's limited turns. Cresselia's damage output is fairly underwhelming on its own, so think twice about using Ice Beam or Psychic over Helping Hand. When an allied Primal Groudon or Primal Kyogre is on the field and the opponent is threatening to switch in its counterpart, use Skill Swap pre-emptively to maintain control of the weather and avoid killing momentum. Also be aware of instances where Cresselia can steal strong abilities from foes, such as Parental Bond from Mega Kangaskhan. When Cresselia is beside another Trick Room setter, remember the option of using Trick Room twice on a predicted passive turn from your opponent, as this will reset Trick Room's turns.</p> <h1>Team Options</h1> <p>Primal Groudon makes for an excellent partner for Cresselia, as it appreciates Skill Swap to reset Desolate Land and make it immune to Ground-type attacks, which it's otherwise weak to. Gravity also increases Precipice Blade's otherwise undesirable accuracy and allows it to hit Flying-types and foes with Levitate. Primal Kyogre equally values Skill Swap and Gravity for resetting its weather and increasing Origin Pulse's accuracy. Restricted Trick Room setters Dialga and Palkia can both take advantage of Trick Room and set it up again later in the battle should Cresselia have fainted by that time, therefore making Cresselia less important to preserve. Xerneas can dispatch opposing Dark-types that threaten Cresselia with its Fairy Aura-boosted attacks. Mega Mawile is another Fairy-type that can handle opposing Dark-types, and it operates well under Trick Room. Mega Kangaskhan works great both in and out of Trick Room and can help Cresselia set it up with Fake Out. Amoonguss's Rage Powder also helps Cresselia set up Trick Room, and its low Speed stat allows it to take advantage of it by putting faster threats to sleep with Spore. Landorus-T can use Earthquake freely beside Cresselia thanks to Levitate. Moreover, its Intimidate ability patches up Cresselia's often weaker physical bulk, and it can pivot out on the turn Trick Room is used with U-turn to make way for a more appropriate Trick Room sweeper.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Carbonific", "user_id": 233942}], "teams": [{"name": "Quality checked by", "members": [{"username": "Ksh13", "user_id": 257422}, {"username": "Jio", "user_id": 22788}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}, {"username": "Empress", "user_id": 175616}]}]}
  },
  "Raichu": {
    "overview": "<p>While not particularly intimidating, Raichu possesses a number of unique qualities that allow it to stand out in the VGC 2016 metagame. Its access to Fake Out and high Speed stat are its most noticeable traits, as these make it the fastest Fake Out user in the format barring Weavile. Its high Speed stat also comes in handy as a result of its access to Encore, which can be used to lock foes into a move. Furthermore, Lightning Rod is another way in which Raichu can support its teammates, as it prevents allies from being harmed by Electric-type attacks or from being paralyzed by the likes of Thunder Wave and Nuzzle. As an Electric-type with access to a strong physical STAB move in Volt Tackle, it also serves as an effective check to Primal Kyogre, one of the format's most dominant restricted Pokemon. Raichu is not the only Electric-type capable of supporting its team, however, and it therefore faces severe competition from Thundurus, which has access to Prankster, and Manectric, which competes with Raichu as a Lightning Rod user.</p>",
    "comments": "<h1>Other Options</h1> <p>Raichu is a fairly straightforward Pokemon, and it therefore doesn't see a lot of variance in the set it uses. However, Endeavor can be used alongside Focus Sash to bring an opposing Pokemon down to 1 HP once its Focus Sash has been broken, but this can be difficult to pull off given the number of priority users in the metagame. Using Fling with King's Rock is an option to allow the possibility of making foes flinch after the first turn, but Weavile is generally the better user of this combination. Helping Hand is a good move on almost all Pokemon capable of learning it, including Raichu, but given the large variety in potential users, there's almost always another Pokemon that can more easily give up a moveslot for it. Teeter Dance can be used if you have access to the Japanese event that featured it, but it has the Static ability and therefore cannot support its teammates with Lightning Rod. Air Balloon is an interesting option that helps keep Raichu on the field longer against Primal Groudon, particularly if heavy rain is up, since it's then immune to Groudon's Fire-type moves as well. Finally, if you don't mind dropping Encore, Assault Vest can be an effective choice that improves Raichu's special bulk dramatically</p> <h1>Checks and Counters</h1> <p><strong>Ground-type Pokemon</strong>: Ground-types are immune to Raichu's Electric-type attacks and can hit Raichu super effectively. Primal Groudon is the biggest threat to Raichu, as Fake Out and Feint are generally Raichu's only means of harming it. Likewise, Landorus-T isn't threatened at all by Raichu and can eliminate it with Earthquake.</p> <p><strong>Grass-type Pokemon</strong>: Grass-types take little damage from Raichu's Electric-type attacks and frequently have other qualities that are problematic for Raichu. Amoonguss makes for an effective check given that it's able to redirect Encore and Raichu's Electric-type attacks with ease using Rage Powder. Ferrothorn is also an issue due to its Iron Barbs breaking Raichu's Focus Sash. It also gets a power boost to Gyro Ball should Raichu target it with Nuzzle.</p> <p><strong>Mega Kangaskhan</strong>: While Mega Kangaskhan should be concerned about being Encored into Fake Out or paralyzed with Nuzzle, it can easily OHKO Raichu with its high-powered attacks. Parental Bond even allows it to do so through Raichu's potential Focus Sash.</p> <p><strong>Dialga</strong>: Dialga takes very little damage from any of Raichu's attacks, and it can OHKO Raichu in return with its Dragon-type STAB moves. It also cares little about Nuzzle, as it's frequently used as a Trick Room attacker and would therefore move sooner under Trick Room's effect when inflicted with paralysis.</p> <p><strong>Faster Pokemon</strong>: Since Raichu is very frail, any Pokemon faster than it such as Weavile or Mewtwo can usually eliminate Raichu in a single hit.</p>",
    "sets": {
      "Support": {
        "description": "<h1>Moves</h1> <p>Fake Out is a staple of VGC play as a result of it making the foe flinch, allowing a partially free turn for your team to get the upper hand in terms of momentum. Volt Tackle is generally the superior option to Thunderbolt, as this allows Raichu to better check Primal Kyogre, which has lower Defense than Special Defense. Nuzzle and Feint may be used interchangeably depending on the needs of Raichu's team. Nuzzle is useful as a form of speed control to paralyze foes, while Feint allows the player to fearlessly double target an opposing Pokemon, as well as break Focus Sash and pick off low-HP Pokemon. Finally, Encore is useful for restricting the foe's options on each turn by locking them into ineffectual moves. Protect may seem tempting given how frail Raichu is, but in such a momentum-based format as VGC 2016, sometimes having Raichu faint can result in a positive outcome by allowing a free switch into an allied restricted Pokemon.</p> <h1>Set Details</h1> <p>Magnet is recommended, as it allows Raichu to pick up the OHKO on 252 HP Primal Kyogre. Focus Sash may seem like a poor choice given that Raichu breaks it with the use of Volt Tackle, but granting it the ability to occasionally last an extra turn still makes Focus Sash useful. The Speed EVs are maximized in order to outpace as many foes as possible, most notably those in the base 100 Speed tier such as Mega Kangaskhan. Lightning Rod is chosen over Static due to its usefulness in shutting down Thundurus and other Thunder Wave users. Static could theoretically see use to get off a free paralysis onto foes while bluffing Lightning Rod, but this is inconsistent and therefore not recommended.</p> <h1>Usage Tips</h1> <p>Raichu should be played aggressively due to how aggressive the format is in general. The combination of support moves Raichu has access to allows it to put on an incredible amount of pressure on turn one, so it's best suited as a lead. Make good use of Nuzzle to spread paralysis, bearing in mind that it can't be stopped by Taunt like Thunder Wave and will allow your team to have the Speed advantage during the late-game. Make sure not to let Raichu faint too early if it's needed to defend partners like Rayquaza and Primal Kyogre from Electric-type attacks through the use of Lightning Rod. Try to avoid switching Raichu into attacks, as its lack of bulk means it's likely to take a severe amount of damage when doing so.</p> <h1>Team Options</h1> <p>Raichu typically sees the best use on teams featuring the combination of Rayquaza and Primal Kyogre, as it does an excellent job defending the duo from the likes of Thundurus and opposing Primal Kyogre. Xerneas and other setup sweepers such as Swords Dance Rayquaza and Power-Up Punch Mega Kangaskhan also appreciate Raichu's Fake Out to help them set up, as well as its Lightning Rod to prevent them from being paralyzed after doing so. Another group of Pokemon that enjoy Fake Out and Lightning Rod support are Tailwind setters such as Talonflame and Mega Salamence, which can more freely set up speed control for their entire team.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "kaori", "user_id": 245315}, {"username": "Carbonific", "user_id": 233942}], "teams": [{"name": "Quality checked by", "members": [{"username": "Jio", "user_id": 22788}, {"username": "Carbonific", "user_id": 233942}]}, {"name": "Grammar checked by", "members": [{"username": "Empress", "user_id": 175616}, {"username": "P Squared", "user_id": 168392}]}]}
  },
  "Kangaskhan": {
    "overview": "<p>Mega Kangaskhan is not only one of the best choices for a Mega Evolution but also one of the strongest Pokemon in the format. Its base 100 Speed allows it to outrun the majority of unboosted Pokemon. Its access to Fake Out and Sucker Punch means that even foes that outspeed it aren't necessarily problematic. Fake Out also provides excellent support to a variety of Pokemon, making Mega Kangaskhan more of a team player than most other offensive powerhouses. Its additional access to coverage options like Fire Punch and Hammer Arm can make it unpredictable to deal with. The aforementioned moves combined with its incredible ability, Parental Bond, and access to high Base Power moves like Double-Edge let Mega Kangaskhan outright OHKO many foes, including Focus Sash users such as Smeargle and Thundurus. However, Parental Bond worsens its matchup against foes like Iron Barbs Ferrothorn or those with Rocky Helmet. Finally, Mega Kangaskhan's Normal typing grants it very few resistances, making it difficult to switch in without taking an undesirable amount of damage.</p>",
    "comments": "<h1>Other Options</h1> <p>Ice Punch provides Mega Kangaskhan with the ability to OHKO 4x Ice-weak foes such as Landorus-T and Mega Salamence even through Intimidate. Fire Punch helps to check foes such as Ferrothorn and Scizor, which can otherwise prove to be problematic. Crunch can be used in place of Sucker Punch if hitting Ghost-types reliably is more important than priority. However, bear in mind that Ghost-types such as Gengar can still outspeed and burn Mega Kangaskhan with Will-O-Wisp before it has a chance to strike back. Hammer Arm can be used on Trick Room teams to help slow down Mega Kangaskhan as a result of the Speed drop the move causes. A Brave nature and 0 Speed IVs accomplish something similar, as they make Mega Kangaskhan more effective under the effect of Trick Room. However, this is generally not necessary, as Mega Kangaskhan has access to priority moves in Fake Out and Sucker Punch.</p> <h1>Checks and Counters</h1> <p><strong>Fighting-type Pokemon</strong>: Fighting-types such as Mienshao, Infernape, and Terrakion can all outspeed and OHKO Mega Kangaskhan with their super effective STAB moves. All three also have access to Quick Guard, which can block Mega Kangaskhan's attempts to use Fake Out and Sucker Punch. Mienshao also has access to the ability Inner Focus, which prevents it from flinching.</p> <p><strong>Intimidate and Burns</strong>: Intimidate users such as Salamence and Landorus-T reduce Mega Kangaskhan's Attack by one stage when sent out. Will-O-Wisp users such as Gengar, Sableye, and Giratina-O can also reduce Mega Kangaskhan's damage output by inflicting burn on it.</p> <p><strong>Faster Pokemon</strong>: Low Kick Life Orb Weavile, Aura Sphere Mewtwo, and Low Kick Greninja can all outspeed and OHKO Mega Kangaskhan with their super effective moves. It's worth noting that while Mewtwo is weak to Sucker Punch, it is not OHKOed by the move and therefore trades positively against Mega Kangaskhan.</p> <p><strong>Encore</strong>: Encore users such as Liepard, Whimsicott, and Raichu can lock Mega Kangaskhan into an ineffectual Fake Out, making it a dead weight on the field until it switches out.</p> <p><strong>Ability Removal</strong>: Skill Swap users such as Cresselia, Gengar, and Bronzong can steal Mega Kangaskhan's Parental Bond away from it, hampering Mega Kangaskhan's damage output. Worry Seed Whimsicott can also replace Parental Bond with Insomnia, equally reducing Mega Kangaskhan's damage output significantly.</p> <p><strong>Chip Damage</strong>: Iron Barbs Ferrothorn and foes holding a Rocky Helmet such as Amoonguss and Togekiss can inflict significant chip damage to Mega Kangaskhan as a result of Parental Bond triggering those effects twice.</p>",
    "sets": {
      "All-Out Attacker": {
        "description": "<h1>Moves</h1> <p>Double-Edge is Mega Kangaskhan's STAB move of choice, as it makes it as immediately threatening as possible. However, Return is still a viable alternative if you're running a bulkier EV spread and therefore find the recoil associated with Double-Edge undesirable. Low Kick is useful for hitting Steel-types that resist Double-Edge, like Ferrothorn and Dialga, super effectively and for dealing significant damage to opposing Mega Kangaskhan. Sucker Punch provides the set with a strong priority attack to hit faster foes before they can strike. Fake Out imparts a great deal of utility, as it gives Mega Kangaskhan's partner a partially free turn to attack or set up while a foe is unable to move. You may also opt to use Protect over any of Low Kick, Sucker Punch, or Fake Out if you prefer Mega Kangaskhan to have the ability to defend itself for a turn.</p> <h1>Set Details</h1> <p>Inner Focus is chosen to prevent Kangaskhan from being flinched by opposing Fake Out users, thereby preventing the loss of a turn. Scrappy can also be used in order to hit uncommon Ghost-types. A Jolly nature and 252 Speed EVs are used to allow Mega Kangaskhan to outrun as many foes as possible. The remaining 252 EVs are placed into Attack to allow it to hit as hard as possible. Alternatively, a spread of 4 HP / 172 Atk / 76 Def / 4 SpD / 252 Spe can be run if you'd like Mega Kangaskhan to have the ability to survive opposing Jolly Mega Kangaskhan's Low Kick and are willing to sacrifice some of its damage output to accomplish this. An Adamant nature is viable to increase Mega Kangaskhan's damage output, but this then doesn't allow it to outspeed foes such as positive-natured base 90 Speed Pokemon.</p> <h1>Usage Tips</h1> <p>This set aims to deal as much damage as possible with strong attacks. Leading with Kangaskhan is usually a good idea, as it can then use Fake Out to gain early momentum. Be aware of situations where Double-Edge's recoil would put Mega Kangaskhan into KO range of a foe's attack. Using Sucker Punch against a faster Primal Kyogre or Primal Groudon, potentially as a result of speed control such as Trick Room, may be wise to reduce the damage of a potential Water Spout or Eruption. Be aware of Kangaskhan's lower base Speed in comparison to its Mega Evolution on the turn it Mega Evolves to avoid being caught off guard as it's outsped. However, you may also wish to intentionally delay Mega Evolving in order to remain slower for a turn if you anticipate Trick Room. Remember that not Mega Evolving is also an option in order to make use of Inner Focus or Scrappy. Don't be afraid of switching Mega Kangaskhan out, as preserving the option to use Fake Out later on may be useful.</p> <h1>Team Options</h1> <p>Fake Out makes setup sweepers like Geomancy Xerneas and Swords Dance Groudon or Scizor good partners, as it gives them the ability to set up more safely. For a similar reason, this also makes Smeargle a good partner, as Fake Out can make it easy for it to get off a Dark Void. Dark-types like Yveltal and Weavile can help Mega Kangaskhan beat opposing Ghost-types that it finds problematic. Yveltal's Dark Aura is also able to power up Mega Kangaskhan's Sucker Punch. Speed control from Pokemon such as Thunder Wave Thundurus is valuable for helping Mega Kangaskhan deal with faster foes. Talonflame resists the STAB moves of and can KO opposing Fighting-types, and it also provides a form of speed control in Tailwind. Psychic-types such as Cresselia and Meowstic likewise resist Fighting-type attacks and provide various support. For example, Cresselia has access to speed control in the form of Trick Room and can boost Mega Kangaskhan's attacks with Helping Hand. Meowstic's Safeguard protects Mega Kangaskhan from status and can combine this with a Swagger aimed at it to boost Mega Kangaskhan's Attack stat.</p>"
      },
      "Power-Up Punch": {
        "description": "<h1>Moves</h1> <p>Return is Mega Kangaskhan's strongest and most consistent attack without any drawbacks, making it optimal for this set. Double-Edge's power is not necessary at +2 Attack and the recoil can end Mega Kangaskhan's sweep early, making it a generally poorer choice. Thanks to Parental Bond, Power-Up Punch boosts Mega Kangaskhan's Attack by two stages per use, granting it the power to easily sweep through teams. Sucker Punch provides a means of hitting faster foes and thereby improves Mega Kangaskhan's chances of sweeping through them with minimal risk. Fake Out provides utility by giving Mega Kangaskhan's partner a free turn to attack or maneuver into a better position. If you'd prefer Mega Kangaskhan had the ability to defend itself for a turn, Protect can alternatively be used in place of Fake Out.</p> <h1>Set Details</h1> <p>Inner Focus prevents Kangaskhan from flinching and losing a turn. Scrappy can be used instead if you'd prefer the ability to Fake Out Ghost-types, although you should be aware that they're less common in VGC16 than they have been in previous years. A Jolly nature and 252 Speed EVs allow Mega Kangaskhan to outspeed the majority of foes. The remaining EVs are invested into Attack to allow Mega Kangaskhan to hit as hard as possible after the former goal has been met. A spread of 4 HP / 172 Atk / 76 Def / 4 SpD / 252 Spe is notable for allowing Mega Kangaskhan to survive opposing Jolly Mega Kangaskhan's Low Kick should you be willing to give up the appropriate Attack EVs. An Adamant nature improves Mega Kangaskhan's damage output, but it leaves Mega Kangaskhan more reliant on Sucker Punch to deal with faster foes.</p> <h1>Usage Tips</h1> <p>This set aims to get Mega Kangaskhan into a position where it can set up with Power-Up Punch and then proceed to sweep. Don't use Power-Up Punch if the opponent has counters, as it's a weak move if you don't then capitalize on the boosts in the following turns with either Return or Sucker Punch. Try to particularly focus your game plan around eliminating Will-O-Wisp and Intimidate users, as they're the most likely candidates to prevent Mega Kangaskhan's sweep. Remember against Primal Groudon and Primal Kyogre that Sucker Punch can reduce the damage of Water Spout and Eruption should they be faster as a result of speed control such as Trick Room. Base Kangaskhan is slower than its Mega Evolution, so be aware of this on the turn you choose to Mega Evolve. Also bear in mind the option of not Mega Evolving immediately in order to make use of Inner Focus or Scrappy.</p> <h1>Team Options</h1> <p>Follow Me and Rage Powder users are important because they increase Mega Kangaskhan's chances of successfully setting up with Power-Up Punch. Those that resist Fighting-type moves, such as Amoonguss, Togekiss, and Clefairy, make for particularly good redirection users. Smeargle also has access to Follow Me, and its Dark Void provides more opportunities to help Mega Kangaskhan set up. Mega Kangaskhan also has Fake Out to help Smeargle safely get off Dark Void. Furthermore, Smeargle can then use Transform on your boosted Mega Kangaskhan, leaving you with two +2 Mega Kangaskhan to put on double the offensive pressure. Dark-types such as Yveltal and Weavile are valuable because they provide checks to opposing Ghost-types. Additionally, Yveltal's Dark Aura powers up Mega Kangaskhan's Sucker Punch. Talonflame provides a check to opposing Fighting-types and a form of speed control in Tailwind. Psychic-types such as Cresselia and Meowstic also resist Fighting-type moves and have a variety of helpful support moves. Cresselia has multiple options for speed control, and its Helping Hand can boost Mega Kangaskhan's attacks. Meowstic can use Safeguard to prevent status such as paralysis and burn from hindering Mega Kangaskhan's sweep.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Carbonific", "user_id": 233942}], "teams": [{"name": "Quality checked by", "members": [{"username": "Jio", "user_id": 22788}, {"username": "Ksh13", "user_id": 257422}]}, {"name": "Grammar checked by", "members": [{"username": "frenzyplant", "user_id": 185509}, {"username": "Haund", "user_id": 193885}]}]}
  },
  "Crobat": {
    "overview": "<p>Crobat stands out as one of the most reliable leads of the metagame. Its outstanding base 130 Speed, which allows it to outspeed every relevant Pokemon bar Mewtwo and Mega Gengar, is complemented by a wide utility movepool that includes moves such as Taunt, Tailwind, and Quick Guard. Taunt, in particular, is especially useful, as it allows Crobat to function as a reliable check to other leads such as Smeargle, which has lower Speed and often runs status moves only. In addition to these unique traits, Crobat's decent defensive typing makes it a good check to Xerneas, as it resists Fairy-type attacks while also being able to stop Geomancy thanks to Taunt. However, Crobat's utility diminishes throughout the game, as its mediocre 85 / 80 / 80 bulk doesn't allow it to repeatedly switch into moves that it doesn't resist. It is also heavily reliant on its teammates, as it doesn't have any offensive presence besides Super Fang, which deals less damage each turn and cannot KO foes at all. Lastly, Crobat faces competition as a fast utility-based Pokemon from Talonflame: the latter has an optimal base Speed, also has access to Quick Guard and Taunt, and can set up Tailwind before getting Taunted by a Prankster user thanks to Gale Wings. However, Crobat's Inner Focus makes it immune to Fake Out, and its access to Haze gives it a better matchup against setup sweepers.</p>",
    "comments": "<h1>Other Options</h1> <p>Haze or Whirlwind can be run over Quick Guard as an emergency move against setup sweepers and Moody Smeargle, although these are better dealt with in other ways. Haze, in particular, is also effective against the Follow Me + Geomancy combination. Brave Bird can be used as an alternative and more reliable source of damage, but Crobat's uninvested Attack stat is too low to weaken foes significantly. If running Brave Bird, a Jolly nature and 31 Attack IVs should be used as well. Hypnosis can work well in conjunction with Crobat's great Speed, but its unreliability makes the move not worth using; however, it can be run as a niche strategy with specific teammates, such as Gravity Sableye.</p> <h1>Checks and Counters</h1> <p><strong>Powerful Attackers</strong>: Crobat's bulk is only mediocre, and it cannot take repeated hits from powerful attackers such as Mega Rayquaza, Primal Groudon, and Mega Kangaskhan.</p> <p><strong>Mewtwo and Mega Gengar</strong>: Mewtwo and Mega Gengar, although not very common, can Speed tie with Crobat and OHKO it with ease; the latter is also immune to Super Fang.</p> <p><strong>Ghost-types</strong>: If not running Brave Bird, Crobat has no way of damaging Ghost-types such as Mega Gengar, Giratina, Sableye, and Giratina-O. Sableye, in particular, has access to Prankster and can bypass Crobat's Speed and Taunt. Moreover, a leading duo of Sableye and Mega Gengar can make Crobat useless while the two Ghost-types deal with its partner.</p> <p><strong>Mental Herb</strong>: Pokemon running Mental Herb can avoid Taunt and proceed to cripple Crobat or its partner. In particular, most Trick Room setters can also nullify Crobat's great Speed and the Speed boost from Tailwind.</p>",
    "sets": {
      "Utility Support": {
        "description": "<h1>Moves</h1> <p>Super Fang removes 50% of the foe's health without taking into consideration its typing and resistances, allowing Crobat to easily deal with bulky foes such as Primal Kyogre and Primal Groudon. Tailwind doubles the Speed of Crobat and its allies for four turns, turning slower offensive teammates into fast threats. Taunt prevents Pokemon such as Cresselia and Smeargle from using their own status moves, and it works extremely well in conjunction with Crobat's great Speed. Haze lets Crobat reset stat changes, notably allowing it to counter Xerneas. Quick Guard protects Crobat's partner from common priority moves such as Mega Kangaskhan's Fake Out, Mega Mawile's Sucker Punch, and Rayquaza's Extreme Speed.</p> <h1>Set Details</h1> <p>Maximum HP investment allows Crobat to survive some weak or unresisted attacks, while 252 Speed EVs and a Timid nature are necessary to ensure it moves before its foes. A Lum Berry helps against status conditions, in particular sleep and paralysis, and allows Crobat to reliably check Smeargle by absorbing one Dark Void and Taunting it the following turn. Mental Herb can be used as an alternative item, as it nullifies a Taunt coming from Prankster users, such as Sableye, or faster Pokemon. An EV spread of 44 HP / 236 Def / 228 Spe is a viable option to always avoid being OHKOed by Mega Kangaskhan's Double-Edge.</p> <h1>Usage Tips</h1> <p>Crobat should be used as a lead to disrupt the opposing team as soon as possible. Use Taunt if Crobat is against defensive Pokemon or setup sweepers; otherwise, either start spamming Super Fang to damage the foes as much as possible or set up Tailwind to better deal with the opponent's team the following turns. If Crobat and its partner are against common users of priority moves, such as Mega Kangaskhan, consider using Quick Guard as well. Crobat can also be used to secure a sweep for a teammate mid- or late-game; however, keep in mind that it should be brought in only after a teammate has fainted or on a predicted resisted move, as its subpar bulk doesn't allow it to survive particularly powerful hits.</p> <h1>Team Options</h1> <p>Powerful wallbreakers benefit the most from Tailwind's Speed boost and the consistent damage dealt by Super Fang. Mega Kangaskhan, in particular, makes for an exceptionally good partner, as it can help Crobat use its moves more safely thanks to Fake Out and can KO most foes after Super Fang damage with a Parental Bond-boosted Double-Edge. A leading duo consisting of Crobat and Smeargle can provide an early advantage for its teammates, as the former can set up Tailwind while the latter uses a protecting move the first turn, and then they can proceed to spam Super Fang and Dark Void the following turn. On a similar note, Crobat and Mega Gengar fare well against most Pokemon combinations, including the common Smeargle and Xerneas. Bulky offensive Pokemon such as Primal Groudon and Primal Kyogre are also good options, as they can take advantage of Tailwind while also maintaining some defensive presence.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Haund", "user_id": 193885}], "teams": [{"name": "Quality checked by", "members": [{"username": "Ksh13", "user_id": 257422}, {"username": "Jio", "user_id": 22788}]}, {"name": "Grammar checked by", "members": [{"username": "P Squared", "user_id": 168392}, {"username": "Lumari", "user_id": 232216}]}]}
  },
  "Smeargle": {
    "overview": "<p>Smeargle is a centralizing Pokemon in the VGC metagame due to its utility and ability to shut down both foes with Dark Void. It has an amazing support movepool that allows Pokemon such as Mega Kangaskhan and Xerneas to set up more easily. Dark Void, however, is the best support move Smeargle can learn and the main reason why you should use Smeargle. Moody can be a very useful ability, as if Smeargle gets one Speed boost, it becomes a huge threat that can fire off a fast Dark Void, so even faster foes will have trouble stopping it; however, a Speed drop allows foes to easily outspeed and KO Smeargle. Smeargle also has horrible defenses and a bad Speed tier, which leaves it outsped and KOed by many Pokemon in the metagame. Smeargle's Speed tier also leaves it vulnerable to fast Taunt users.</p>",
    "comments": "<h1>Other Options</h1> <p>A Choice Scarf set can be used to get a fast Dark Void off; however, this makes Smeargle dead weight after it fires off a Dark Void and is really weak to Prankster Taunt. Helping Hand can be used to boost the power of Smeargle's partner's attacks. Magic Coat is useful in stopping opposing Smeargle by bouncing back Dark Void. Smeargle can use Role Play on a Primal partner to reset their weather. King's Shield can punish physical attackers for attacking Smeargle by lowering their Attack by two stages. Wide Guard can be used to block common spread moves such as Precipice Blades and Origin Pulse. Crafty Shield can be used to protect your team from opposing Taunt and Dark Void. Own Tempo can be used if you don't like having to risk the negative effects of Moody. A low-level Smeargle can be used to get a really fast Dark Void off under Trick Room; this set also uses Endeavor for some offensive presence. Mental Herb can be used to make Smeargle immune to Taunt; this, however, makes Smeargle very easy to KO, as it does not have a Focus Sash.</p> <h1>Checks and Counters</h1> <p><strong>Crobat</strong>: Crobat can outspeed Smeargle and Taunt it. Crobat is also immune to flinching from Fake Out and often carries a Lum Berry, nullifying sleep from Dark Void.</p> <p><strong>Mega Kangaskhan</strong>: Mega Kangaskhan can outspeed Smeargle and OHKO it through its Focus Sash thanks to Parental Bond</p> <p><strong>Status Prevention</strong>: Status prevention stops Smeargle from using Dark Void, which is what it does best; some moves that do this are Taunt, Magic Coat, Substitute, and Safeguard. Lum Berry can also be used to stop Dark Void but is a bit unreliable, as it has a one-time use. Mega Mewtwo Y in particular is faster than Choice Scarf Smeargle and is immune to Dark Void thanks to Insomnia.</p> <p><strong>Spread Attacks</strong>: Spread attacks make it easier to double target Smeargle, and they will still do damage to its partner.</p>",
    "sets": {
      "Lady Luck (Support)": {
        "description": "<h1>Moves</h1> <p>Dark Void puts both foes to sleep, which can allow Smeargle's partner to set up. Spiky Shield can stop incoming Fake Out or Taunt and damages foes that target Smeargle with physical attacks. Follow Me can redirect attacks away from Smeargle's partner, which is especially useful if its partner is setting up; furthermore, it is also Smeargle's most consistent option to support its team, as it doesn't have to rely on the shaky accuracy of Dark Void. Fake Out can create free turns for partners to set up or finish off a foe. Wide Guard can be used to stop common spread attacks such as Origin Pulse and Precipice Blades.</p> <h1>Set Details</h1> <p>252 Speed EVs with a Timid nature allow Smeargle to be as fast as possible. 252 Defense EVs allow Smeargle to survive some weaker physical hits such as Mega Kangaskhan's Power-Up Punch. 252 HP EVs should be used if Smeargle is running Transform, as its HP stays the same after it uses the move. Focus Sash is used because Smeargle cannot survive many attacks without it. Moody is the preferred ability, as even though it can be unreliable, a single accuracy or Speed can boost can win a game.</p> <h1>Usage Tips</h1> <p>Smeargle is generally used as a lead to get off an immediate Dark Void. It is not good to switch Smeargle into attacks, as it is quite frail; it is reasonable, however, to switch Smeargle in on Ghost-type attacks or after a partner has fainted. Using Spiky Shield on the first turn can be good if there is a Fake Out or Taunt user that Smeargle's partner can KO. Dark Void has a 36% chance of missing one target, so it is better to make a different play if you don't have to take that risk.</p> <h1>Team Options</h1> <p>Almost any Pokemon that can apply good offensive pressure appreciates Smeargle's support. Mega Kangaskhan is one of the best partners for Smeargle, as it provides Fake Out support while Smeargle can help it set up with Dark Void. Xerneas appreciates Dark Void to help it set up Geomancy. Tailwind setters such as Crobat and Talonflame can set up Tailwind for Smeargle, which can allow it to get a faster Dark Void off. Partners with Quick Guard can be useful in stopping Prankster Taunt and Fake Out, and they also help with Brave Bird from Talonflame.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Mishimono", "user_id": 274814}], "teams": [{"name": "Quality checked by", "members": [{"username": "Ksh13", "user_id": 257422}, {"username": "Jio", "user_id": 22788}]}, {"name": "Gramamr checked by", "members": [{"username": "Haund", "user_id": 193885}, {"username": "Empress", "user_id": 175616}]}]}
  },
  "Mawile": {
    "overview": "<p>Mega Mawile is a terrifying threat in VGC. Its powerful STAB Play Rough and priority in Sucker Punch serve it well in tearing down anything in its way. It has decent bulk backed up by Intimidate, allowing it to take some hits particularly well, and its defensive typing gives it a good matchup against foes like Mega Kangaskhan, most Xerneas, and most Dragons, which are all very common in VGC. Its low Speed allows it to take advantage of the effects of Trick Room very well. These things make Mega Mawile a very reliable asset to many teams. However, Mega Mawile can't hit threats such as Primal Groudon and Ferrothorn for much damage, and those will quickly punish Mega Mawile for it. It can't take hits from most of the restricted legendaries well, especially special attacks; Primal Kyogre gets the OHKO at all times and Xerneas can do more than 70% with Moonblast after a Geomancy boost. These things definitely hold Mawile back, but they are heavily outweighed by its very unique matchups and brute force.</p>",
    "comments": "<h1>Other Options</h1> <p>Stone Edge or Rock Slide can hit Crobat, Ho-Oh, and occasionally Talonflame hard, though it may not get a chance to hit the latter two before they hit Mawile with a powerful Sacred Fire or Flare Blitz. Using Swords Dance over Iron Head can greatly increase the power of Sucker Punch and Play Rough, allowing Mega Mawile to KO virtually everything in one hit. Fire Fang allows Mawile to hit other Steel-types, more specifically hitting even the bulkiest Ferrothorn for an OHKO. An alternate EV spread for faster sets in 60 HP / 252 Atk / 196 Spe with an Adamant nature can be used to outspeed Mega Salamence while under Tailwind.</p> <h1>Checks and Counters</h1> <p><strong>Intimidate and Burns</strong>: Intimidate from Pokemon such as opposing Mawile and Landorus-T can dampen Mega Mawile's power, while Will-O-Wisp and other less conventional methods of causing burns can more greatly impact its damage output.</p> <p><strong>Offensive Typing Advantage</strong>: Most Ground- and Fire-types like Landorus-T and Ho-Oh can easily KO Mawile, but they should be aware of Mawile's Sucker Punch.</p> <p><strong>Amoonguss</strong>: Amoonguss can redirect all of Mawile's attacks easily, and it underspeeds Mawile under Trick Room and can use Spore on it.</p> <p><strong>Primal Pokemon</strong>: Primal Kyogre and Primal Groudon outspeed and deal devastating damage to Mega Mawile, requiring Mawile to resort to Sucker Punch unless it is under Tailwind or Trick Room.</p>",
    "sets": {
      "Bulky Attacker": {
        "description": "<h1>Moves</h1> <p>Play Rough is Mega Mawile's main STAB move, hitting almost everything for great amounts of damage. It also has the perk of being boosted when Xerneas is out. Sucker Punch is one of the most powerful priority moves in the game, and it is boosted when in the presence of Yveltal. Iron Head covers Xerneas better than Play Rough, but it doesn't hit much else. It also serves as Mega Mawile's only STAB move with perfect accuracy, an area that Play Rough tends to fail in often. Protect lets it avoid hits for one turn, which is very useful for stalling out certain conditions and allowing a partner to get rid of a threat.</p> <h1>Set Details</h1> <p>The EVs allow Mawile to hit with as much force as possible while taking as many hits as possible. Mawile can run 0 IVs in Speed with a Brave nature to perform better under Trick Room if that is the type of team you are running it on. Intimidate helps stabilize Rayquaza, Groudon, and all other physical attackers for both Mawile and its teammate to work better.</p> <h1>Usage Tips</h1> <p>Mega Mawile should most often be lead with a Trick Room or Tailwind setter, as those conditions last for a fair portion of the game and greatly increase its offensive presence. When in play, Mega Mawile generally can just attack. There are Pokemon that resist Mega Mawile's attacks, but they too take significant damage, so any free hit at all is great. The only exception to this rule is Primal Groudon, which takes Play Roughs and Iron Heads far too easily.</p> <h1>Team Options</h1> <p>Teammates that cover Primal Groudon well are very useful for Mega Mawile, such as Kyurem-W and even your own Primal Groudon. Primal Kyogre gets a very honorable mention as a partner to Mega Mawile due to its sheer power with Origin Pulse, which stops Primal Groudon and Ho-Oh easily. Any provider of speed control is very useful for Mawile, such as Cresselia with Trick Room or Yveltal with Tailwind. Redirection from a Pokemon such as Amoonguss or Togekiss can help secure a KO without having Mawile take lots of damage from single-target attacks. Anything that despises Rayquaza or Yveltal can really benefit from having Mega Mawile as a partner. This includes a variety of Pokemon, mostly the Primal Pokemon and some other restricted legendaries. Yveltal's and Xerneas's abilities boost the power of Mega Mawile's attacks, with Yveltal being a decent Primal Groudon check as well as a supportive option and Xerneas being a much more offensive yet more Primal Groudon-weak option.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Derivatives", "user_id": 237342}], "teams": [{"name": "Quality checked by", "members": [{"username": "Ksh13", "user_id": 257422}, {"username": "Serapis", "user_id": 228266}]}, {"name": "Grammar checked by", "members": [{"username": "P Squared", "user_id": 168392}, {"username": "Lumari", "user_id": 232216}]}]}
  },
  "Salamence": {
    "overview": "<p>Mega Salamence is one of the most defining non-restricted Pokemon in VGC 2016, boasting sky-high stats that rival those of restricted Pokemon in addition to having solid offensive and supportive presence. Its base 145 Attack and base 120 Special Attack, combined with its boosted Flying-type STAB attacks due to Aerilate, turn it into a fearsome attacker. The number of Pokemon that resist Flying in VGC 2016 is fairly low, making Salamence's assaults difficult to wall. It possesses an extremely high base 120 Speed , outrunning much of the metagame; it notably outruns Mega Rayquaza, serving as a solid check. Mega Salamence also comes with solid physical bulk, having excellent 95 HP / 130 Defense to enable it to take hits from notable physical attackers in the metagame such as Mega Kangaskhan and Talonflame. Immunity to Ground and a resistance to Fire crucially make it a good Primal Groudon check, especially against physical ones. All of this is further bolstered by having Intimidate in its base forme, providing excellent support before it opts to Mega Evolve and unleash its terror. With numerous appealing traits, Mega Salamence is very easy to fit in various team archetypes.</p> <p>Despite its many compelling qualities, Salamence's special bulk is rather average, and it can take very heavy damage from some of the powerful special attacks that it resists, such as Primal Groudon's Eruption and Primal Kyogre's Origin Pulse or Water Spout. Its crippling weaknesses to Ice, Dragon, and Fairy means that it is often in danger of being swiftly OHKOed, as they are all very common attacking types in VGC 2016. Its amazing Speed can backfire under Trick Room (but don't stop yourself from slapping Mega Salamence on a Trick Room team!), and it lacks a priority attack, making it somewhat vulnerable to Prankster.</p>",
    "comments": "<h1>Other Options</h1> <p>Hydro Pump allows Salamence to pick up a surprise OHKO on Primal Groudon when harsh sunlight is not present on the field. It can also deal significant damage to Mega Mawile and Landorus-T. Snore allows it to take a Dark Void and still be relevant, threatening a KO on Smeargle on the following turn to ensure it doesn't get another turn to fire off another Dark Void or roll the dice with Moody. Sleep Talk can also allow it to take a Dark Void. Its payoff potential is far greater than Snore, but it is subject to multiple RNG rolls from its random targeting and choice of moves.</p> <p>Dragon Dance turns Mega Salamence into a fearsome sweeper, given the strength and safety of its STAB Return or Double-Edge. However, it loses some utility, depending on what move it gives up in order to accommodate for this playstyle. Dragon Dance is also not very easy to set up due to all the powerful attacks flying around in this metagame. Earthquake provides Salamence with a way to hit Steel-types such as Aegislash, Dialga, and Mega Mawile and is another source of spread damage. Unlike Salamence's Fire-type attacks, Earthquake is not hindered by weather, but it being a spread move reduces its power. Roost extends Mega Salamence's lifespan, but the fast-paced format and prevalence of extremely powerful special attacks make this goal difficult to accomplish. Giga Impact OHKOes uninvested Kyogre and can potentially even OHKO Xerneas. The recharge turn, however, can easily be extremely devastating for Salamence and its team. Use it with extreme caution.</p> <h1>Checks and Counters</h1> <p><strong>Steel-type Pokemon</strong>: Not all Steel-type Pokemon can handle Mega Salamence, but there are a few notable exceptions, such as Dialga, Mega Mawile, and Aegislash. Dialga resists Double-Edge and Hyper Voice and doesn't take too much from Draco Meteor. In return, it can OHKO with its own Draco Meteor or Dragon Pulse or set up Trick Room to nullify Salamence's Speed advantage for the next few turns. Mega Mawile resists Flying and is immune to Dragon, only fearing the somewhat rare Flamethrower or Fire Blast, neither of which can OHKO and it can retaliate with Play Rough. Aegislash's high bulk in Shield forme, combined with its resistances to Flying- and Dragon- type moves, allow it to tank Mega Salamence's attacks extremely easily. It can 2HKO back with Shadow Ball. Additionally, should Mega Salamence carry a super effective move, it risks the possibility of Aegislash holding a Weakness Policy, allowing it to OHKO Mega Salamence back with a +2 Shadow Ball. Aegislash must be careful to not be hit in its Blade forme, however. Bronzong can Skill Swap Aerilate away from Mega Salamence and leave it with a useless Levitate, heavily crippling its offensive presence.</p> <p><strong>Xerneas</strong>: Xerneas is immune to Draco Meteor and is not OHKOed by Double-Edge. It can proceed to OHKO Salamence with Moonblast or set up Geomancy. However, Double-Edge will still leave a huge dent, rendering Xerneas vulnerable to revenge killing. Keep in mind that this may be a favorable trade for the Salamence user, and be careful when doing this trade when Xerneas may be needed to cover other Pokemon on the opposing team.</p> <p><strong>Cresselia</strong>: Cresselia is bulky enough to avoid being 2HKOed by Double-Edge and can deal heavy damage back with Ice Beam. Like Dialga, it can also set up Trick Room.</p> <p><strong>Primal Kyogre</strong>: Although Double-Edge deals a lot of damage, Primal Kyogre can survive a hit and OHKO with Ice Beam. Primal Kyogre also has no issues handling pure special variants.</p> <p><strong>Thundurus</strong>: Thundurus resists Mega Salamence's Flying-type attacks and can take a Draco Meteor if it invests in Special Defense. It can paralyze Mega Salamence with Thunder Wave or remove it with Hidden Power Ice.</p> <p><strong>Faster Users of Ice-type Attacks</strong>: Pokemon such as Mewtwo, Mega Mewtwo Y, Weavile, Greninja, and Choice Scarf Kyurem-W are all faster than Mega Salamence and can OHKO it with an Ice attack. Keep in mind that Weavile without Life Orb will not OHKO Mega Salamence if it is Intimidated.</p> <p><strong>Speed Control</strong>: Mega Salamence's high Speed can be turned against it by Trick Room. Thunder Wave also cripples it greatly, and its 4x weakness to Ice means that Icy Wind from almost anything will surely leave a dent. It also lacks priority attacks to bypass them. The primary user of Icy Wind is Gengar.</p> <p><strong>Surprise Ice-type Attacks</strong>: Mega Gengar, Primal Groudon, and Mega Kangaskhan can normally be beaten by Mega Salamence, but they may carry Ice-type attacks; Hidden Power Ice for the first two, and Ice Beam or Ice Punch for Mega Kangaskhan. Mega Gengar carrying Hidden Power Ice is somewhat common, and it also can trap Mega Salamence with Shadow Tag.</p>",
    "sets": {
      "Mixed Attacker": {
        "description": "<h1>Moves</h1> <p>Hyper Voice is a reliable, moderately powerful spread move; Mega Salamence will be using it fairly liberally to weaken multiple targets. Double-Edge deals a significant amount of single-target damage and makes Mega Salamence difficult to wall by specially bulky Pokemon such as Primal Kyogre and Ho-Oh. It is also Salamence's most powerful move in terms of raw power (excluding the extremely situational Hyper Beam and Giga Impact). It also swiftly removes Amoonguss and punishes Xerneas for trying to set up Geomancy in front of Mega Salamence. Furthermore, it allows Mega Salamence to continue having significant offensive presence after its Special Attack is reduced from Draco Meteor. Protect is a necessity, as Mega Salamence's weaknesses are very exploitable, and helps prolong its terror. Mega Salamence is not a Pokemon that regrets sacrificing a moveslot for Protect as Double-Edge and Hyper Voice combined grants Salamence an overwhelming majority of the power it needs to succeed.</p> <p>Mega Salamence's final moveslot is actually quite flexible. However, due to how strong its Hyper Voice and Double-Edge are, this does not mean that Mega Salamence suffers from a four-moveslot syndrome; rather, this moveslot is often used as a form of reinforcement. Draco Meteor is often preferred because Mega Salamence can OHKO Mega Rayquaza with it, taking advantage of its superior base Speed. It also deals heavy damage to Thundurus, Dialga, and Primal Groudon, and it destroys opposing Mega Salamence. Teams that do not feel the need to swiftly remove Mega Rayquaza with Mega Salamence can opt for various different moves. Tailwind provides speed control, while Substitute can protect Mega Salamence for an extended period of time and punish overly defensive play. Mega Salamence can also use Fire Blast or Flamethrower to threaten the Steel-type Pokemon that normally give it some trouble, such as Mega Mawile and Aegislash.</p> <h1>Set Details</h1> <p>Salamencite is required for Salamence to Mega Evolve.</p> <p>252 Speed EVs allow Mega Salamence to be as fast as possible, outrunning Mega Rayquaza and Whimsicott. It is also useful before it Mega Evolves to outrun maximum Speed Xerneas and Yveltal and Speed tie with Mega Kangaskhan.</p> <p>The Special Attack investment is variable. 252 Special Attack EVs maximize Hyper Voice and Draco Meteor damage, but Mega Salamence has several other benchmarks it can hit with less:</p> <ul> <li>124 Special Attack EVs allow it to KO 4 HP / 0 SpD Primal Groudon with Draco Meteor and Hyper Voice. It also allows Mega Salamence to 3HKO 252 HP / 0 SpD Groudon with Hyper Voice.</li> <li>Approximately 176 Special Attack EVs are required to OHKO minimum bulk Kyurem-W with Draco Meteor. This also allows it to 2HKO 4 HP / 0 SpD Mega Gengar with Hyper Voice.</li> <li>Only 36 Special Attack EVs are required to OHKO Mega Rayquaza with Draco Meteor.</li> </ul> <p>Likewise, its Attack stat has several benchmarks. Here are some examples:</p> <ul> <li>60 Attack EVs allow it to OHKO 252 HP / 0 Def Primal Kyogre with Helping Hand-boosted Double-Edge.</li> <li>76 Attack EVs allow it OHKO 0 HP / 0 Def Xerneas with the same boost.</li> <li>108 Attack EVs allow it to 2HKO 4 HP / 0 Def Primal Groudon with Double-Edge.</li> <li>252 Attack EVs allow it to 2HKO 252 HP / 0 Def Primal Kyogre with Double-Edge at -1 Attack.</li> </ul> <p>Mega Salamence can also invest in bulk to better take certain powerful attacks, such as Mega Kangaskhan's Double-Edge and Ho-Oh's Life Orb-boosted Brave Bird. With the help of Intimidate, some physical bulk investment allows it to not be 2HKOed by those attacks. Naive is the preferred nature to preserve Mega Salamence's high physical bulk, allowing it to avoid being 2HKOed by Primal Groudon's Rock Slide for example. Hasty is viable, however, if you are more concerned about taking Special Attacks. For example, Timid Primal Groudon's Flamethrower will never 2HKO Mega Salamence, and Timid Xerneas will often fail to OHKO with Dazzling Gleam.</p> <h1>Usage Tips</h1> <p>It may be a wise idea to not Mega Evolve early to preserve Intimidate. Intimidate is an extremely valuable ability; do not sacrifice it if you do not plan to attack immediately. If you see a bad matchup, it is a good idea to switch Salamence out without Mega Evolving so it can fire off Intimidates at more opportune moments. Try saving its teammates with it.</p> <p>Mega Salamence can be used quite flexibly due to its relatively safe and powerful moves and can be brought in at any point in the game. It can be used recklessly to distract opponents from your team's wincons, as Mega Salamence is a deadly threat that requires quick addressing. It can leave numerous dents early-game for its team's restricted Pokemon to clean up. Likewise, Mega Salamence itself can be a solid wincon thanks to its high Speed and deadly attacks. Knowing when to preserve or sacrifice Mega Salamence comes with practice.</p> <h1>Team Options</h1> <p>Primal Groudon helps check Flying-resistant Pokemon like Thundurus and Mega Mawile and can also check Xerneas. Mega Salamence can help check Landorus-T and opposing Primal Groudon in return. Primal Kyogre appreciates the Intimidate support and Salamence's ability to heavily damage or even outright remove Pokemon such as Ferrothorn and Amoonguss and it appreciates Mega Salamence's ability to check Primal Groudon. Xerneas appreciates the Intimidate support and can set up Geomancy more safely, even against a usual check like physical Primal Groudon.</p> <p>Ferrothorn checks Xerneas and Weavile, while Mega Salamence checks Primal Groudon and Talonflame. Beware that the combination will not stop them if they are both on the field, and having Primal Kyogre in the back is recommended. Ho-Oh becomes a powerful tank with the help of Salamence's Intimidate. It also removes Mega Mawile and checks Xerneas. Be careful of the double Rock weakness, however.</p> <p>Overall, Salamence's versatility allows it to fit into a lot of teams. You don't have to worry about a specific partner for Mega Salamence. Just don't stack up too many weaknesses with it. Because Mega slots are less of a premium in VGC 2016 due to restricted Pokemon being primary sources of offense, running a secondary Mega Evolution is not a bad idea at all and is often recommended. Mega Salamence is often seen with Mega Kangaskhan, as they are the two most powerful non-restricted Mega Evolutions in the game.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Jibaku", "user_id": 1779}], "teams": [{"name": "Quality checked by", "members": [{"username": "DaAwesomeDude1", "user_id": 228280}, {"username": "Jio", "user_id": 22788}]}, {"name": "Grammar checked by", "members": [{"username": "P Squared", "user_id": 168392}, {"username": "Lumari", "user_id": 232216}]}]}
  },
  "Kyogre": {
    "overview": "<p>Primal Kyogre is one of the most defining Pokemon in the format thanks to its high stats and ability to provide unabating weather. Primordial Sea offers game-changing team support to almost every Pokemon in the game and turns Primal Kyogre into one of the best answers to Primal Groudon's devastating Fire-type attacks. While Origin Pulse and Water Spout have downsides with regards to accuracy and consistency, respectively, in combination with the damage boost from rain, they grant Primal Kyogre the potential to deal a ridiculous amount of spread damage. When compared to Primal Groudon, Primal Kyogre has no 4x weakness, making it more difficult to eliminate. This is especially true when you take into account Primal Kyogre's extreme bulk, particularly specially, and its wide range of viable EV spreads that are able to patch up the few weaknesses it has. Its physical bulk is not so high that it doesn't fear boosted attacks from the likes of Mega Kangaskhan and Mega Salamence, though. A final word of caution is that should Primal Groudon gain the upper hand in the weather war, Primal Kyogre is often stuck just firing off Ice Beam.</p>",
    "comments": "<h1>Other Options</h1> <p>Although Kyogre is usually being supported by its teammates, Thunder Wave and Icy Wind are options to provide speed control. Thunder Wave in particular is good for neutering threats like Xerneas, Mega Salamence, and Rayquaza even if they boost their Speed or switch out. Roar can force a Geomancy-boosted Xerneas to switch out, which prevents a potential sweep. Roar also has higher priority than Trick Room, so it can be used to phaze Trick Room setters before they can set it up, with the plus side of not being stopped by Mental Herb or Lum Berry, which are common items on them. Keep in mind that Roar only switches out a Pokemon if there are more than two Pokemon remaining, so if the target is one of the opponent's last two, it will be ineffective. Calm Mind can bolster Kyogre's already high special stats, but most of the time Kyogre is better off attacking than boosting. It is not as impactful as Primal Groudon's Swords Dance or Xerneas's Geomancy. An EV spread of 252 SpA / 252 Spe with a Timid nature on Primal Kyogre is viable, but it is extremely vulnerable to some powerful physical moves in the game. In particular, Mega Rayquaza and Mega Kangaskhan can threaten an OHKO with Dragon Ascent and Double-Edge, respectively.</p> <h1>Checks and Counters</h1> <p><strong>Primal Groudon</strong>: Primal Groudon can generally freely switch into Kyogre, and its Desolate Land ability removes Kyogre's ability to fire off strong Water attacks. This forces Kyogre to rely more on Ice Beam for its damage output. However, if Primal Kyogre is the one switching into Primal Groudon, it will have the upper hand and threaten an easy OHKO on Primal Groudon with its Water-type attacks.</p> <p><strong>Xerneas</strong>: Xerneas outspeeds Kyogre and can set up a Geomancy to boost its Special Defense before Kyogre can get off an attack. While Geomancy-boosted Xerneas does massive damage, it is worth noting that Kyogre will survive a +2 Moonblast from full health.</p> <p><strong>Strong Physical Attackers</strong>: Mega Kangaskhan, Mega Salamence, and Rayquaza all threaten Kyogre due to their massive Attack stat, which hits Kyogre's weak point because its Defense is much lower than its Special Defense. Raichu can threaten Primal Kyogre with Volt Tackle, OHKOing less bulky variants.</p> <p><strong>Grass-type Pokemon</strong>: Amoonguss and Ferrothorn both resist Kyogre's STAB Water-type moves. Amoonguss threatens Kyogre with Grass Knot and Spore, while Ferrothorn threatens with Power Whip and potentially stalling out Kyogre with Leech Seed. Ludicolo sports a 4x resistance to Water and is not weak to Ice Beam and Thunder. With Swift Swim or Rain Dish, it can take advantage of Primordial Sea to be either incredibly fast or difficult to knock out, respectively. Ludicolo can also deal heavy damage back to Kyogre with a STAB Grass Knot.</p> <p><strong>Dialga and Palkia</strong>: Both Pokemon resist Kyogre's Water-type attacks and are not weak to Ice Beam or Thunder. They can both retaliate with Thunder, potentially 2HKOing Primal Kyogre. Without Thunder, however, both Dialga and Palkia may struggle to defeat Kyogre, as its Special Defense is incredibly high.</p> <p><strong>Lapras</strong>: If Primal Kyogre lacks Thunder, Lapras can easily wall it thanks to Water Absorb and a 4x resistance to Ice. However, Kyogre's special bulk is so high that Freeze-Dry is only a 4HKO on it. If Kyogre carries Thunder, it will 3HKO Assault Vest Lapras.</p>",
    "sets": {
      "Bulky Special Attacker": {
        "description": "<h1>Moves</h1> <p>Spread Water-type attacks are a staple on Primal Kyogre, with its two best options being Water Spout and Origin Pulse. Water Spout is the stronger attack at maximum HP, with a Base Power of 150, but its power decreases with Primal Kyogre's HP. Origin Pulse has a unvarying 110 Base Power, but its 85 percent accuracy makes it riskier. Ice Beam allows Primal Kyogre to still chunk threats while Desolate Land is negating its Water-type attacks, in addition to threatening KOs on Dragons such as Mega Rayquaza and Mega Salamence. Thunder allows Primal Kyogre to deal heavy damage to opposing Primal Kyogre as well as obscure Primal Kyogre checks such as Lapras and Ludicolo. If running Thunder, it is recommended to have Origin Pulse instead of Water Spout, as Primal Kyogre appreciates both a consistent STAB move and a spread move. Scald is an option should you fear Wide Guard or want a STAB move with invariable Base Power and 100% accuracy. Protect allows Primal Kyogre to be shielded for a turn so that it may scout for moves, block Fake Out, and stall out opposing field conditions.</p> <h1>Set Details</h1> <p>Blue Orb is used primarily to deal with Primal Groudon's Desolate Land by replacing it with Primordial Sea. Defensively, the EVs prevent an OHKO from Raichu's Zap Plate-boosted Volt Tackle and Mega Rayquaza's Choice Band-boosted Dragon Ascent the majority of the time, in addition to making Jolly Primal Groudon's Precipice Blades a 3HKO. 76 Special Attack EVs ensure that Water Spout will OHKO uninvested Mega Kangaskhan. When not using Water Spout, maximizing Defense is recommended to make Yveltal's Black Glasses-boosted Foul Play a 3HKO and to minimize the chance that both Adamant Primal Groudon's Precipice Blades and Talonflame's Life Orb-boosted Brave Bird will 2HKO. A Modest nature is used to boost Primal Kyogre's damage output. It's also required to 2HKO opposing Primal Kyogre with Thunder. A Quiet nature and 0 Speed IVs can be used instead to outrun as many foes as possible under Trick Room. Other EV spreads are viable too. For example, 252 HP / 60 Def / 196 SpA lets Primal Kyogre survive Mega Rayquaza's Life Orb-boosted Dragon Ascent and OHKO uninvested Xerneas with Water Spout. Bold and Relaxed natures may also be considered, as both grant even more physical bulk, ensuring that not even Adamant Primal Groudon's Precipice Blades can 2HKO. They also allow survival against combination attacks such as Jolly Mega Kangaskhan's Double-Edge with Timid Primal Groudon's Earth Power, or a Sucker Punch from both Life Orb Yveltal and Mega Mawile. When Primal Kyogre is utilized with Icy Wind support, other Speed benchmarks can be considered. 12 Speed EVs ensure that it can outrun base 100s after an Icy Wind, and 132 EVs allow Primal Kyogre to outrun -1 Mega Salamence.</p> <h1>Usage Tips</h1> <p>Try to keep Primal Kyogre in the back if you spot Primal Groudon at Team Preview. You want to look for opportunities to send Primal Kyogre in against Primal Groudon in order to win the weather war. Primal Groudon will most likely try to do the same, so try to bait it out by using Pokemon such as Ferrothorn and Thundurus. Be careful of its powerful Precipice Blades when switching in, though; having an Intimidate partner such as Salamence or Landorus-T switch in prior can help soften the blow significantly. If your opponent lacks a Primal Groudon, or if you have weather-canceling Pokemon such as Rayquaza on your team, Primal Kyogre can instead be lead aggressively to exert pressure early. When a possible Wide Guard user is on the field, play it safe and opt for single-target attacks.</p> <h1>Team Options</h1> <p>Partnering Primal Kyogre with checks to Primal Groudon is necessary given that it's Primal Kyogre's greatest opposition. Landorus-T is effective in this role given that it hits Primal Groudon super effectively, is immune to Ground thanks to its Flying typing, and has Intimidate to soften Primal Groudon's physical attacks. Primal Groudon itself can also pair well with Primal Kyogre, since this grants you maximum weather control, and their high bulk opens up a great deal of switching potential. Primal Groudon covers Primal Kyogre's weakness to Electric and can eliminate Ferrothorn easily, and Primal Kyogre helps take on Water-type attacks when the sunlight isn't up in addition to threatening opposing Ground-types with its STAB moves. The challenge of using such a duo is to ensure that Primal Groudon's Desolate Land won't cripple Primal Kyogre, and vice versa.</p> <p>While Primal Kyogre has access to Ice Beam, checks to Grass-types such as Amoonguss are still welcome. Flying-types such as Rayquaza, Mega Salamence, and Talonflame are the main candidates for this, as they're able to check them offensively with their potent STAB moves. The former two are particularly useful, as they also check Primal Groudon. Rayquaza can negate the effects of harsh sunlight with Air Lock and Delta Stream and deal great damage with Draco Meteor, and Mega Salamence can Intimidate Primal Groudon and hit it hard with Hyper Voice. Mega Salamence and Talonflame also join other Flying-types such as Crobat and Togekiss in their potential to provide Tailwind support, which is valuable given Primal Kyogre's otherwise middling Speed stat. Finally, Zapdos, while unable to check Grass-types, can also provide Tailwind support and can deal with Water-types, which Primal Kyogre might otherwise struggle to damage.</p> <p>Thundurus is another Electric-type that can provide speed control in the form of Thunder Wave. It also joins Zapdos in being a great user of Hidden Power Water, which KOs Primal Groudon when Primal Kyogre or Rayquaza is switched in. Gengar is another good Hidden Power Water user and can provide speed control with the likes of Icy Wind, which is able to affect both foes at once. Cresselia likewise makes a great user of Icy Wind and, further, gets access to other forms of speed control such as Thunder Wave and Trick Room. Trick Room in general is a great answer to Primal Kyogre's middling Speed stat because it generally prefers to be run slow and bulky anyway. Dialga, Palkia, Gothitelle, and Bronzong are all viable alternative setters should you prefer any of them. Dialga is notable because it provides a switch-in and check to Electric-type attackers. Palkia loves the boost from rain, as it powers it up to such an extent that it can even OHKO unboosted Xerneas with a Life Orb-boosted Hydro Pump. Gothitelle's Shadow Tag is able to trap in foes and lock down the weather, similarly to Mega Gengar.</p> <p>Finally, Bronzong, as a Steel-type, appreciates Primal Kyogre's Primordial Sea ability thanks to it nullifying one of its weaknesses in Fire. Bronzong also joins Cresselia in having access to Skill Swap, which, when used on Primal Kyogre, will reset the weather in its favor and make Primal Kyogre immune to Ground. Bronzong is also not the only Steel-type that enjoys having its weakness to Fire temporarily eliminated. Ferrothorn and Mega Mawile are otherwise difficult to handle under heavy rain, and both are able to OHKO Xerneas with their Steel-type STAB moves even after a Geomancy boost, since they're physical attackers. They also both function excellently under Trick Room.</p>"
      },
      "Choice Scarf": {
        "description": "<h1>Moves</h1> <p>The HP-dependent Water Spout is Kyogre's primary STAB move, as it takes advantage of the blinding Speed granted by Choice Scarf to clean up foes with large spread damage before they can strike. Origin Pulse is also used because it allows Kyogre to still deal significant spread damage if it has sustained prior injury and Water Spout is therefore weaker. Ice Beam nails Dragon- and Grass-types such as Mega Salamence, Rayquaza, and Amoonguss, which resist Water-type attacks. Hydro Pump grants significant single-target damage as a means of bypassing Wide Guard. It also OHKOes Mega Kangaskhan in the rain. Thunder deals with opposing Kyogre and Lapras. Scald functions as a more accurate, but weaker, alternative to Hydro Pump that also has a chance to burn checks like Ferrothorn.</p> <h1>Set Details</h1> <p>This set is relatively straightforward. Choice Scarf is chosen because it's the only viable item on non-Primal Kyogre, and with it, Kyogre becomes a powerful cleaner. Items other than Blue Orb simply do not grant as much benefit as Choice Scarf does. Maximum Special Attack EVs and a Modest nature are used in order to bolster Kyogre's damage output as much as possible. The remaining EVs are then dumped into Speed to make it as fast as possible.</p> <h1>Team Options</h1> <p>Rayquaza is a mandatory teammate, as Primal Groudon otherwise hard counters Choice Scarf Kyogre. Drizzle cannot override Desolate Land, so Choice Scarf Kyogre cannot revenge kill Primal Groudon under these conditions. Quick Guard users such as Talonflame and Crobat protect Kyogre from dangerous priority moves that look to take advantage of its poor Defense stat and its reliance on Speed. Some of these threatening moves include Mega Kangaskhan's Fake Out and Sucker Punch, Mega Mawile's Sucker Punch, Thundurus's Thunder Wave, and Mega Rayquaza's Extreme Speed. Talonflame and Crobat can also provide Tailwind support, ensuring that Kyogre will maintain its Speed advantage against foes under their Tailwind. Feint users such as Weavile, Hitmontop, and Raichu are recommended to break Wide Guard, allowing Kyogre to fire off Water Spout freely. Trick Room countermeasures are also important for this Kyogre set, as it's extremely vulnerable to Trick Room. Amoonguss can threaten Trick Room teams thanks to its low Speed and Spore, and it supports Kyogre by redirecting damage away with Rage Powder.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Jibaku", "user_id": 1779}, {"username": "Carbonific", "user_id": 233942}], "teams": [{"name": "Quality checked by", "members": [{"username": "Jio", "user_id": 22788}, {"username": "blarajan", "user_id": 59999}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}, {"username": "P Squared", "user_id": 168392}]}]}
  },
  "Rayquaza": {
    "overview": "<p>Rayquaza is one of the most dangerous restricted Pokemon in the format, boasting nearly unparalleled offensive prowess thanks to its Mega Evolution. Mega Rayquaza's dual base 180 offenses are the highest combined offenses in the format, and with its diverse movepool, it can threaten everything in the metagame. A high base 115 Speed complements Mega Rayquaza's offenses well, only leaving it outsped by a few unboosted threats such as Mega Salamence and Weavile. As the only Mega to have the freedom of choosing its item, Rayquaza is also easy to fit on teams with another Mega such as Kangaskhan or Gengar, and it's one of few viable Mega Evolutions to be a threat without needing to Mega Evolve. Dragon / Flying is a great typing as well, allowing Mega Rayquaza to switch into most attacks from both Primal Groudon and Primal Kyogre. Both Air Lock and Delta Stream are incredibly useful abilities that further increase its ability to effectively check both Primals by allowing to shift the weather war in its favor, and unlike the Primals, Mega Rayquaza isn't hindered greatly by the loss of its weather. Delta Stream also lets Mega Rayquaza support its Flying-type teammates, reducing the damage they take from Rock-, Electric-, and Ice-type moves.</p> <p>However, Mega Rayquaza suffers from a few flaws that keep it from being omnipresent to the same degree as Groudon, Kyogre and Xerneas. While Dragon Ascent is incredibly dangerous with few viable Steel- or Rock-types to switch into it, the stat drops and Life Orb recoil make it much easier to KO Mega Rayquaza despite its respectable bulk and numerous useful resistances. A Fairy-type weakness also makes Xerneas a big threat for Rayquaza if it can't Mega Evolve before Xerneas comes in. Rayquaza's base 95 Speed before it Mega Evolves is solid among most restricted legendaries, but it still leaves it outsped by key threats including Salamence, Timid Xerneas, and Jolly Mega Kangaskhan. This sometimes forces it to rely on Protect to safely Mega Evolve, which can be taken advantage of by the opponent. Rayquaza is also always used on a team with the intent to use its Mega Evolution, so while it's no less dangerous than Mega Kangaskhan or Mega Salamence, the restriction of two legendaries limits it somewhat in terms of team archetypes it can fit on.</p>",
    "comments": "<h1>Other Options</h1> <p>Flamethrower is a safer alternative to Overheat if missing is a concern. The Steel-types that Overheat hits are still hit hard by Flamethrower, though it can miss out on OHKOs against bulkier Ferrothorn and Mega Mawile, especially if Mega Rayquaza lacks Life Orb. Earth Power KOes Mega Mawile while also hitting Primal Groudon without the risk of missing like Draco Meteor. However, unless Mega Rayquaza is needed to hit both of these, it's better off with either Overheat or Draco Meteor, since Earth Power is much weaker against other threats. Earthquake is a coverage option on the Swords Dance set that lets Mega Rayquaza hit Steel-types like Mega Mawile, Dialga, and Aegislash, though this is difficult to fit on a set, since that means giving up Extreme Speed or Protect, which are both very important. Lum Berry is an option on the Swords Dance set that gives Mega Rayquaza a buffer against status moves such as Dark Void and Thunder Wave, allowing it to set up more easily. However, the power drop from Life Orb and the lack of a safety net that Focus Sash offers make it a less popular choice than those items. Choice Band lets Mega Rayquaza hit incredibly hard without having to worry about Life Orb recoil, at the cost of being locked into a move and losing out on Protect. Dragon Ascent is a very safe move to be locked into as well due to how few threats resist it, and a boosted Extreme Speed is deceptively powerful. Most Pokemon that run bulky spreads also use Life Orb Mega Rayquaza as a benchmark, so the extra power is effective at picking up surprise OHKOs on bulky variants of Xerneas and Primal Kyogre. However, the inability to use Protect can be taken advantage of once the surprise factor is gone.</p> <h1>Checks and Counters</h1> <p><strong>Xerneas</strong>: Xerneas does not take Dragon Ascent very well and risks a possible OHKO if it doesn't run any bulk investment, but it can outspeed Rayquaza before it Mega Evolves and threatens it with Moonblast or Dazzling Gleam even without setting up. After a Geomancy, Mega Rayquaza struggles to win unless Xerneas has been put in range of Extreme Speed. However, Timid Xerneas is unlikely to OHKO it with an unboosted Dazzling Gleam after a round of Life Orb recoil. It must also be wary of Focus Sash Mega Rayquaza, as the combination of Dragon Ascent and Extreme Speed has a good chance to KO Xerneas.</p> <p><strong>Mega Salamence</strong>: Salamence outspeeds Rayquaza before and after they both Mega Evolve, so it can threaten to OHKO it with Draco Meteor. Even if it comes in after Rayquaza has Mega Evolved, it can just use Protect to safely Mega Evolve itself and gain the Speed advantage. Intimidate also reduces Mega Rayquaza's damage output, though Salamence must be wary of Mega Rayquaza hitting it with a Draco Meteor of its own. Redirection support also forces Mega Salamence to use Hyper Voice, which is unable to beat Mega Rayquaza unless it's been weakened.</p> <p><strong>Status Ailments</strong>: Mega Rayquaza is very vulnerable to status moves; Thunder Wave from Thundurus and Dark Void from Smeargle are big problems for it, since it can't do much to prevent them unless it runs a Lum Berry. However, Extreme Speed can still pressure many of these status users and a paralyzed Mega Rayquaza can still be threatening with Extreme Speed if it sets up, since it can no longer be put to sleep.</p> <p><strong>Steel-types</strong>: Mega Rayquaza struggles with Steel-types if it lacks Overheat or Earth Power, so Dialga, Mega Mawile, and Aegislash can check it effectively. Mega Mawile in particular has Intimidate before it Mega Evolves and it's often used under Trick Room, which gives Mega Rayquaza a difficult time. Ferrothorn still takes huge damage from Dragon Ascent due to its Grass-typing, though if it doesn't get KOed it can retaliate with Gyro Ball.</p> <p><strong>Priority Moves</strong>: Mega Rayquaza outprioritizes all relevant priority users with Extreme Speed, but if they're not in range of being KOed by it, Talonflame, Mega Kangaskhan, and Weavile can pick it off with their respective priority moves after Dragon Ascent drops.</p>",
    "sets": {
      "Mixed Attacker": {
        "description": "<h1>Moves</h1> <p>Dragon Ascent is necessary to Mega Evolve and it's Rayquaza's best STAB move, doing incredible damage to anything that doesn't resist it. Extreme Speed gives Rayquaza a powerful priority move that beats out Talonflame, Kangaskhan, and Prankster users attempting to hit it with Thunder Wave, and it also mitigates Mega Rayquaza's vulnerability to speed control from the opposing team. Draco Meteor is a secondary STAB option that does massive damage even with no investment, hitting other Dragon-types and OHKOing uninvested Primal Groudon while also letting Mega Rayquaza work around Intimidate a bit. Overheat hits Steel-types like Mega Mawile, which otherwise checks Rayquaza, while OHKOing Ferrothorn and having a chance to OHKO Aegislash. Waterfall is a much more reliable move against any Primal Groudon variant and doesn't risk missing like Draco Meteor. However, this is generally only used when Mega Rayquaza is paired with Primal Kyogre, as Mega Rayquaza benefits from the rain with Waterfall. The utility diminishes greatly without Primal Kyogre, since unlike Draco Meteor, it can no longer hit Primal Groudon if sun is up. Protect is important in the last slot to let Rayquaza scout out for threatening moves, since it will often be targeted due to its average bulk and its dangerous power. It also lets Rayquaza safely Mega Evolve to get past its average Speed before Mega Evolution.</p> <h1>Set Details</h1> <p>Maximum Attack and Speed investment maximize Mega Rayquaza's damage output while ensuring it's as fast as possible. The leftover EVs are placed in Special Attack for Draco Meteor and Overheat, though they can be moved to Special Defense if you're running Waterfall. A Speed-boosting nature is important to take advantage of Mega Rayquaza's fantastic Speed tier and prevents it from being outsped by Timid Primal Groudon and Primal Kyogre on the turn it Mega Evolves. Naive lets Rayquaza handle priority moves better to avoid being revenge killed as easily, and guarantees that Weavile can't OHKO with Icicle Crash after one round of Life Orb damage if Strong Winds are active, as well as surviving Double-Edge from Jolly Mega Kangaskhan after one round of Life Orb recoil. This all assumes that Mega Rayquaza hasn't already suffered Defense drops from Dragon Ascent, though. Alternatively, Hasty lets Rayquaza switch into Primal Groudon's Eruption and Primal Kyogre's Origin Pulse more comfortably, which is useful since it's one of few Pokemon that can comfortably switch into both. Unboosted Dazzling Gleam from Timid Xerneas also has a much lower chance of OHKOing Hasty Mega Rayquaza after one round Life Orb recoil. A Jolly nature is only used with Waterfall, since the Special Attack investment is not important in this case.</p> <p>Life Orb capitalizes on Mega Rayquaza's offenses and is important for helping it secure OHKOs, such as with Draco Meteor against Primal Groudon and with Dragon Ascent against uninvested Primal Kyogre. The extra power also lets Rayquaza hit Pokemon hard even without Mega Evolving so that it can comfortably be brought into battle with a different Mega Evolution. Focus Sash has a noticeable power drop compared to Life Orb but can be useful for letting Mega Rayquaza serve as an emergency check to boosted Xerneas due to Dragon Ascent's power and Extreme Speed's priority. It also functions as a safe buffer that lets Mega Rayquaza clean more effectively late-game after the rest of the team has weakened the opposing team while also mitigating the issue of Mega Rayquaza falling to a single strong hit after repeated Dragon Ascent drops, which can be critical in such a fast-paced format.</p> <h1>Usage Tips</h1> <p>Mega Rayquaza's strengths lie in the ability to punch holes in everything; it has the power and Speed to threaten the entire metagame after Mega Evolving, so capitalizing on that is vital. Mega Evolving early can put immense pressure on the opponent, and even Xerneas is greatly threatened if Rayquaza manages to Mega Evolve before it can come in and set up, since Xerneas can be KOed after very little prior damage. Likewise, saving Rayquaza until late-game is effective, since it's very hard to stop once a team has been weakened. Rayquaza doesn't need to try to sweep the entire team though; sometimes one crucial OHKO is all it needs to have done its job successfully.</p> <p>While Rayquaza's bulk is somewhat average, its typing coupled with Air Lock and Delta Stream makes it one of the best Primal switch-ins in the format, so don't be too afraid to switch it into dangerous moves if the opportunity presents itself. The freedom of being a Mega Evolution with the ability to hold any item also means Mega Rayquaza can freely be brought along even with a secondary Mega Evolution without compromising its strengths much. Non-Mega Rayquaza still has dual 150 offenses, so it's more than capable of threatening teams with a Life Orb without Mega Evolving if the second Mega Evolution is desired.</p> <h1>Team Options</h1> <p>Primal Kyogre is one of Mega Rayquaza's most popular partners, as Mega Rayquaza lets Primal Kyogre fire off Origin Pulse and Water Spout more freely and put huge pressure on Primal Groudon attempting to switch in out of fear of Rayquaza coming in to negate its harsh sunlight. Mega Rayquaza also helps beat Primal Kyogre's best switch-ins such as Ferrothorn and Amoonguss. However, Air Lock will also negate the rain boost from Primal Kyogre, so be aware of the various weather interactions when both are on the field. Xerneas appreciates Mega Rayquaza's ability to threaten Primal Groudon and Steel-types, giving Xerneas less trouble when it's attempting to sweep and also cleaning up late-game if Xerneas can't finish the job. Xerneas also makes up for Mega Rayquaza's lack of spread damage while also beating Mega Salamence. Ho-Oh handles Xerneas very comfortably for Rayquaza due to its monstrous Special Defense, and it also appreciates Delta Stream to lessen the damage of Rock Slide.</p> <p>Tailwind support from Talonflame or Crobat helps Mega Rayquaza outspeed Mega Salamence and boosted Xerneas. Priority Brave Bird from Talonflame is also useful for helping bring something into KO range for one of Mega Rayquaza's attacks and can put more pressure on Xerneas, while Crobat offers Taunt support to prevent Xerneas from setting up and keep Smeargle in check. Both also benefit from Delta Stream to take Rock-, Electric-, and Ice-type moves more comfortably. Likewise, Landorus-T appreciates Delta Stream to reduce the threat of Hidden Power Ice and provides utility in the form of Intimidate while being able to freely use Earthquake alongside Mega Rayquaza. Steel-types like Aegislash and Ferrothorn threaten Xerneas, while Mega Rayquaza threatens Primal Groudon for them. Thundurus does a great job at supporting Mega Rayquaza with Prankster Thunder Wave to cover Xerneas and Salamence and has Taunt to deter Smeargle, while Mega Rayquaza's Delta Stream removes its weaknesses to make it more difficult to beat.</p> <p>Redirection from Togekiss or Amoonguss can be deadly against teams that lack many answers to Mega Rayquaza and notably prevents Mega Salamence from taking it out reliably. Amoonguss handles Xerneas with Spore and Clear Smog, whereas Togekiss benefits greatly from Delta Stream and is also immune to Dragon-type moves aimed at Rayquaza. Mega Gengar functions as a great secondary Mega Evolution that has a better matchup against Xerneas. Both Gengar and Rayquaza are still good without Mega Evolving, so bringing both is not overly limiting either. Weavile is also popular as a Fake Out partner, and it also provides Feint support while threatening Mega Salamence with Icicle Crash. Feint lets Rayquaza safely break through anything trying to Protect, and Weavile is the only Feint user that outspeeds Mega Rayquaza, which allows it to use Extreme Speed more freely in front of Quick Guard users. This also provides valuable, albeit minor, chip damage to secure KOs against threats investing in bulk to otherwise survive a hit from Mega Rayquaza, and it can turn rolls into safe KOs. The combination of Mega Rayquaza and Weavile is also one of the few pairs that can stop Mental Herb Cresselia from setting up Trick Room.</p>"
      },
      "Swords Dance": {
        "description": "<h1>Moves</h1> <p>While Mega Rayquaza generally does not need boosting moves, it can utilize Swords Dance to function as powerful wincon that's difficult to stop once it gets a chance to set up. Dragon Ascent is Mega Rayquaza's primary STAB move and necessary for Mega Evolution, and it also OHKOes anything that doesn't resist it after a boost. There are few relevant threats in the format that resist Flying, including Thundurus, Mawile, and Dialga, so it provides fantastic neutral coverage. Extreme Speed is a powerful priority move that outprioritizes all common priority users, and since Rayquaza is faster than all redirection users, this makes it difficult to stop it from picking off threats with a boosted Extreme Speed, even under Trick Room, which Mega Rayquaza normally hates dealing with. Protect is useful for scouting out moves and letting Rayquaza Mega Evolve more reliably. It's also good for baiting attacks after setting up with Swords Dance, as the opponent will likely want to target Mega Rayquaza before it starts breaking through the opposing team.</p> <h1>Set Details</h1> <p>Maximum Attack and Speed investment is necessary to take advantage of Mega Rayquaza's incredible offensive stats; defensive investment is counterintuitive with Life Orb and Dragon Ascent drops. The leftover EVs are placed in Special Defense. A Jolly nature ensures that Mega Rayquaza outspeeds Timid Primal Groudon and Primal Kyogre before Mega Evolving and prevents it from being outsped by the Pokemon edging right below its Speed range such as Infernape, Raichu, Liepard, and opposing Mega Rayquaza. However, Adamant can be used for the extra power, since Mega Rayquaza still outspeeds all restricted legendaries bar Mewtwo, which outspeeds Mega Rayquaza regardless of its nature. However, this comes at the cost of being outsped by maximum Speed Primals on the turn it Mega Evolves. Adamant also ensures that +2 Dragon Ascent will always OHKO standard Cresselia, since most don't run full Defense investment, while also having a much larger chance of OHKOing uninvested Xerneas before setting up.</p> <p>Life Orb gives Rayquaza a noticeable power boost, which is necessary for securing the aforementioned KOs. Life Orb also guarantees that +2 Dragon Ascent OHKOes 252 HP Primal Groudon. While Focus Sash gives up Life Orb's greater power, it lets Mega Rayquaza set up more comfortably and makes it easier to clean the opposing team even if there's no redirector to protect it, assuming it hasn't already taken damage from spread moves. This makes Mega Rayquaza more difficult to stop once it sets up, since the opponent won't even be able to double target it if Mega Rayquaza is KOing a foe each turn.</p> <h1>Usage Tips</h1> <p>Swords Dance Mega Rayquaza will often try to clean up teams, so it's effective later in the game once its checks have been weakened. However, Mega Rayquaza can still finish off many threats even without a boost after just a bit of prior damage, so setting up isn't always necessary late-game. As dangerous as a boosted Rayquaza is, it doesn't need to prioritize setting up every game. Dragon Ascent still does huge damage without setting up, and Extreme Speed offers utility in the form of a priority move that outprioritizes other priority users and redirection. Setting up early is also a viable approach, as it can put huge pressure on checks like Xerneas and forces the opponent to play more aggressively to try to take Mega Rayquaza down. Mega Rayquaza will often be paired with a Fake Out user or redirection to help it set up, so taking advantage of this pressure is vital, since a well-supported Mega Rayquaza is difficult to take down, especially for teams that lack Xerneas.</p> <h1>Team Options</h1> <p>This set greatly benefits from redirection to help it find more setup opportunities. Amoonguss and Togekiss are both good options for this, as the former checks Xerneas effectively while the latter offers Tailwind and an immunity to Draco Meteor from Dragon-types like Salamence. Fake Out users such as Weavile and Raichu help ease setup as well. Both also have Feint to break through an opponent trying to Protect itself from Mega Rayquaza, and the chip damage reduces the risk of a foe surviving a hit from Mega Rayquaza otherwise. Mega Rayquaza appreciates Steel-types to threaten Xerneas like Ferrothorn and Aegislash. Aegislash forces mind games with Wide Guard, while Ferrothorn doesn't suffer as much attacking into Xerneas using Protect. In return, Mega Rayquaza threatens Primal Groudon, though it can't OHKO it without a Swords Dance boost. Similarly, Mega Rayquaza lacks the moveslot to cover Steel-types, so Pokemon that can threaten them such as Landorus-T, Talonflame, and Ho-Oh make for effective teammates. Talonflame and Ho-Oh both pressure Xerneas from trying to set up due to their Fairy resistance and strong physical attacks, and they can offer Tailwind support to allow Mega Rayquaza to outspeed a boosted Xerneas. Landorus-T offers Intimidate support while also being able to use Earthquake alongside Mega Rayquaza. All three also benefit from Delta Stream to remove some of their weaknesses, and they appreciate Mega Rayquaza's ability to check Primal Kyogre. Crobat functions similarly to Talonflame by providing Tailwind support, and it has Super Fang to help Mega Rayquaza threaten opposing Xerneas. Super Fang in general makes Mega Rayquaza's job of cleaning late-game much easier too.</p> <p>Xerneas pairs well with Mega Rayquaza to form an aggressive core of setup sweepers. They both have enough power to muscle through their usual checks together, though this combination lacks a reliable way to beat Steel-types without support, especially if they can't find an opportunity to set up. Primal Kyogre can fire off Origin Pulse and Water Spout more safely with Rayquaza's Air Lock to threaten Primal Groudon switch-ins. Air Lock also nullifies Primal Kyogre's rain boost, though the ability to keep Primal Groudon hesitant to switch in outweighs that drawback. Mega Rayquaza helps Kyogre break past Ferrothorn and Amoonguss as well, which otherwise prove problematic for it. Paralysis support from Thundurus helps Mega Rayquaza beat faster threats such as Mega Salamence and Weavile. It also benefits from Delta Stream removing its troublesome Ice weakness and appreciates Mega Rayquaza's ability to threaten Primal Groudon, which walls Thundurus otherwise. Mega Gengar deals with Xerneas and functions as an effective secondary Mega Evolution to handle matchups that Rayquaza struggles with. It's also possible to safely bring both Mega Evolutions along due to the fact that either one is still effective without Mega Evolving.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Psynergy", "user_id": 248085}], "teams": [{"name": "Quality checked by", "members": [{"username": "DaAwesomeDude1", "user_id": 228280}, {"username": "Jio", "user_id": 22788}]}, {"name": "Grammar checked by", "members": [{"username": "Haund", "user_id": 193885}, {"username": "Lumari", "user_id": 232216}]}]}
  },
  "Bronzong": {
    "overview": "<p>Like other generations before, Bronzong finds its home among legendary Pokemon, providing key immunities and resistances that other common support Pokemon don't have. The arrival of Xerneas has helped Bronzong's viability, as it is one of the best support Pokemon that resist Fairy-type moves and is the only viable Trick Room setter to do so, and it can hit a boosted Xerneas back hard with a high-powered Gyro Ball. With weather control being such a dominant factor in VGC16 battles, Bronzong enjoys the immunities that the Primal weathers bring, and its Skill Swap can help manipulate them further, as Bronzong fits well onto teams that make heavy use of the Primals. As a Psychic-type Trick Room setter, Bronzong has a lot to live up to with Cresselia around, but its main strength lies in its rare Steel / Psychic typing combined with a large support movepool and good defensive stats. Unfortunately, Bronzong is easy to wear down, as it has no recovery outside of items, isn't as bulky as Cresselia, and misses out on a few of Cresselia's support moves such as Helping Hand and Icy Wind. Despite its advantages, Bronzong suffers from many of the same problems as Cresselia, such as its passiveness and reliance on its partners to deal damage, as well as struggling against teams that make use of Yveltal's Dark Aura to increase the damage of their Dark-type attacks.</p>",
    "comments": "<h1>Other Options</h1> <p>Explosion lets Bronzong deal some chip damage and bring in a teammate for free after getting Trick Room set up, helping retain momentum. Imprison is another option if you want to mess up opposing Trick Room setters, but Bronzong struggles to find a moveslot to fit it in. For abilities, Heatproof is an option for Primal Groudon-centric teams, as few opponents will try to use Precipice Blades on a Bronzong unless they are also targeting Bronzong's partner, and a more physically defensive EV spread will allow Bronzong to survive anything an opposing Primal Groudon could throw at it. A spread of 252 HP / 108 Def / 148 SpD with a Relaxed nature will allow Bronzong to survive an opposing Jolly Primal Groudon's Precipice Blades. If you don't want to use Heatproof, a spread of 252 HP / 124 Def / 132 SpD will allow Bronzong to survive a -1 Primal Groudon's Fire Punch under harsh sunlight. Bronzong can also use a Brave nature and an EV spread with maximum Attack to deal much more damage to Xerneas and increase the chance of OHKOing it before it can use Geomancy.</p> <h1>Checks and Counters</h1> <p><strong>Dark-type Pokemon</strong>: Most Dark-type Pokemon can immediately eliminate Bronzong before it has a chance to move. Weavile is a popular lead that will annihilate Bronzong with Knock Off, and Yveltal (and teams that take advantage of its Dark Aura) will give Bronzong a hard time.</p> <p><strong>Fire-type Pokemon</strong>: Bronzong can't do very much to Fire-type Pokemon besides put them to sleep with Hypnosis. Primal Groudon can either use Fire Punch on Bronzong to eliminate it or take advantage of Gravity to use Precipice Blades on it and its teammates. Talonflame can use Flare Blitz on Bronzong, and Ho-Oh laughs at it with Sacred Fire.</p> <p><strong>Primal Kyogre</strong>: Bronzong can't do much back to Primal Kyogre besides put it to sleep, and most of Primal Kyogre's attacks will 2HKO Bronzong unless you have harsh sunlight active.</p> <p><strong>Amoonguss</strong>: Another common support Pokemon, Amoonguss can redirect Gyro Ball away from partners (especially Xerneas), doesn't take much damage from the move due to its low Speed, and can put Bronzong to sleep with Spore.</p> <p><strong>Dialga</strong>: Not only is Dialga a very bulky and slow Pokemon, but it also often carries a Fire-type move such as Flamethrower and can either take advantage of any Trick Room that Bronzong tries to set up or reverse its effects with its own Trick Room.</p> <p><strong>Intimidate</strong>: Bronzong already doesn't have a stellar damage output, and Intimidate neuters it further, making it harder for Bronzong to deal with the threats that it's meant to. One example of this is Mega Salamence, as it is a popular teammate for Xerneas because Geomancy will boost Xerneas's Special Defense and Salamence's Intimidate will effectively boost Xerneas's Defense. Landorus-T can take advantage of Gravity and use Earthquake on Bronzong. Mawile can also cripple Bronzong with Intimidate, but it can't do much damage to it unless you give Mawile the opportunity to use Sucker Punch.</p>",
    "sets": {
      "Trick Room Setter": {
        "description": "<h1>Moves</h1> <p>Trick Room is a requirement on this set, as setting it is Bronzong's only viable role in VGC16. Gyro Ball lets Bronzong hit Xerneas hard, especially after it has a Geomancy boost, and it also does respectable damage to other fast targets such as Crobat and Mega Salamence. Skill Swap is great for weather control and for giving your Primal Groudon Levitate, removing its single weakness under harsh sunlight. Hypnosis is another option to put foes to sleep and helps give Bronzong some offensive presence if Gyro Ball isn't doing much damage, but it has shaky accuracy unless you use it under Gravity. Gravity lets Bronzong pair well with Primal Groudon, helping it fire off perfectly accurate Precipice Blades that hit opposing Levitate users and Flying-types. It also increases the accuracy of Dark Void. Safeguard is also an option if your team struggles with status ailments (especially sleep), as it pairs well with Lum Berry to nullify Dark Void. Lastly, if you don't have a Primal Groudon on your team or otherwise don't need Gravity support, Protect is never a bad choice to avoid Fake Out and other moves.</p> <h1>Set Details</h1> <p>Lum Berry allows Bronzong to set up Trick Room while ignoring the threat of Dark Void, and it also helps it avoid random burns and Swaggers. Mental Herb is also an option to allow Bronzong to function without having to worry about Taunt or Encore, but the most popular users of those moves, Crobat, Thundurus, Whimsicott, and Raichu, are easily dispatched with Gyro Ball or Bronzong's common partners, such as Primal Groudon. A Sassy nature and 0 Speed IVs give it minimum Speed to take maximum advantage of Trick Room and to increase Gyro Ball's Base Power. The HP and Special Defense EVs allow Bronzong to survive two Moonblasts from a +2 Timid Xerneas, an Overheat from Life Orb Mega Rayquaza, or a full-strength Water Spout from Modest Kyogre, with the rest placed in Defense for added overall bulk. Levitate lets Bronzong dodge Ground-type attacks such as the common Precipice Blades, and it can be passed to a partner if Bronzong has Skill Swap.</p> <h1>Usage Tips</h1> <p>Bronzong can work well as a lead when supported by a partner with Fake Out or redirection to help get Trick Room up safely, and it can put immediate pressure onto an opponent who leads with Xerneas and Smeargle. If you don't lead with Bronzong, its high number of resistances allow it to easily switch in, and it also lets you decide whether you even want to have Trick Room as your game plan, as it may turn out that your opponent is able to take advantage of your Trick Room if you set it up too early. Gravity is best used with Primal Groudon so it can start firing off Precipice Blades more safely, and it also makes Bronzong's own Hypnosis far more accurate so it can keep up the pressure. If your opponent isn't being aggressive enough, Hypnosis can be used to put foes to sleep and buy free turns for your teammates or as a last-ditch effort outside of Gravity. Either use Skill Swap to make your own Primal Groudon harder to knock out by giving it Levitate, or use it preemptively if you predict that your opponent will be switching in their own Primal Kyogre or Mega Rayquaza. If you are facing a Cresselia that also has Skill Swap, however, it will move after Bronzong under Trick Room and will undo your weather changes. Bronzong can't do much damage to slower targets such as Cresselia and Amoonguss, so it must rely on its teammates to KO them instead. Bronzong can do a surprising amount of damage to fast or frail targets like Xerneas, Mewtwo, and Crobat, so it isn't as passive as some other support Pokemon.</p> <h1>Team Options</h1> <p>Bronzong pairs excellently with Primal Groudon and Primal Kyogre, as they both usually want a teammate with speed control, and Bronzong appreciates their offensive presence. Primal Groudon loves the Gravity support, as it lets it use Precipice Blades with impunity, and it also appreciates being Skill Swapped Levitate. Primal Kyogre likes the additional Xerneas check that Bronzong provides as well as weather control from Skill Swap, and Bronzong enjoys the heavy rain to make it immune to Primal Groudon's Fire STAB moves. Bronzong also works well on the common and popular Xerneas + Groudon teams, as it can help make the mirror matchup easier. A teammate with Fake Out is recommended to help Bronzong set up Trick Room, such as Mega Kangaskhan or Smeargle. Smeargle can also use Follow Me to redirect Ghost-type attacks away from Bronzong, and it appreciates the accuracy boost that Gravity provides. Mega Salamence is also a good teammate, since the pair don't share any weaknesses and resist most attacks that the other is weak to. Mega Salamence is also good at dealing damage to opposing Primals, which Bronzong struggles with, and Bronzong helps check Xerneas for Mega Salamence. Bronzong also has difficulty with Dark-types such as Weavile and Yveltal, so having a teammate that can deal with them is also recommended, such as Mega Mawile or Xerneas.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Pyritie", "user_id": 61477}], "teams": [{"name": "Quality checked by", "members": [{"username": "Carbonific", "user_id": 233942}, {"username": "Jibaku", "user_id": 1779}]}, {"name": "Grammar checked by", "members": [{"username": "Empress", "user_id": 175616}, {"username": "Lumari", "user_id": 232216}]}]}
  },
  "Weavile": {
    "overview": "<p>Weavile's excellent Speed tier gives it access to the fastest Fake Out in the metagame and the ability to remove the foes' items with Knock Off before they can act. This is particularly useful against Pokemon such as Power Herb Xerneas and most Sitrus Berry users such as Dialga and Palkia; however, unless Weavile uses Knock Off as Xerneas switches in, Xerneas can just use Moonblast immediately, OHKOing Weavile if its Focus Sash has been broken or activating it if it is still intact. Weavile's typing and STAB combination allow it to deal with threats such as Mega Salamence and Rayquaza easily, greatly damaging them with Icicle Crash even after an Attack drop from Intimidate and OHKOing Salamence if it decides not to Mega Evolve. Although Weavile's typing isn't horrible offensively, it doesn't grant it a significant defensive presence; furthermore, Weavile's bulk is extremely low, leaving it vulnerable even to resisted Ghost-, Ice-, and Dark-type attacks and to most priority attacks, such as Fake Out and Sucker Punch. Weavile is also susceptible to priority status moves such as Thunder Wave from Prankster Thundurus, as losing its Speed advantage often makes Weavile useless. Lastly, even though its STAB combination isn't resisted by many Pokemon, if Weavile can't hit the foe super effectively, it struggles to deal with bulky Pokemon, especially Primal Groudon and Primal Kyogre.</p>",
    "comments": "<h1>Other Options</h1> <p>Protect can be used to scout for the foes' moves and, if well-timed, buy more time for Weavile's partner to act without much pressure. Ice Punch can be used instead of Icicle Crash as a more reliable Ice-type STAB move, but the loss in power is quite noticeable. Foul Play is an alternative to Knock Off that deals more damage to physical attackers, but the utility Knock Off provides is usually superior. Ice Shard and Taunt are viable moves if your team really needs them, but it is hard to drop one of Weavile's other moves to use them.</p> <h1>Checks and Counters</h1> <p><strong>Priority</strong>: Priority attacks such as Rayquaza's Extreme Speed and Mega Kangaskhan's Fake Out and Sucker Punch can hit Weavile before it acts and heavily damage it.</p> <p><strong>Bulky Pokemon</strong>: Bulky Pokemon, such as Primal Kyogre, Primal Groudon, Scizor, and Suicune, don't take much damage from any of Weavile's attacks unless they hit them super effectively and can hit it hard in return.</p> <p><strong>Primal Groudon</strong>: Primal Groudon doesn't take much damage from any of Weavile's moves and can either inflict status on it or just hit it hard.</p> <p><strong>Mega Mawile</strong>: Mega Mawile resists both of Weavile's STAB attacks and takes little damage from Low Kick, while it can retaliate with a super effective Steel- or Fairy-type move.</p> <p><strong>Mega Kangaskhan</strong>: Mega Kangaskhan can avoid flinching thanks to Inner Focus and can potentially nullify the effect of Weavile's Focus Sash with Parental Bond.</p>",
    "sets": {
      "Offensive Focus Sash": {
        "description": "<h1>Moves</h1> <p>Fake Out is a great utility move that prevents the target from acting, letting Weavile's partner set up or deal with the foe without much pressure. Knock Off removes the foe's item and works especially well against certain Pokemon such as Power Herb Xerneas, Sitrus Berry Dialga and Palkia, and Shuca Berry Dialga. Icicle Crash is a decently powerful STAB move that allows Weavile to easily deal with some of the most relevant Pokemon of the metagame, such as Mega Salamence and Rayquaza. Feint provides great utility, allowing Weavile to break through Protect and Quick Guard. Weavile is also the only Feint user that acts before Mega Rayquaza's Extreme Speed, allowing the latter to use the move after Weavile has broken the foe's Quick Guard. Low Kick provides additional coverage and can be used if you need answers to certain Pokemon such as Dialga and Mega Kangaskhan.</p> <h1>Set Details</h1> <p>Maximum Attack and Speed investment alongside a Jolly nature ensures that Weavile hits as hard and as fast as possible, whereas 4 HP EVs slightly increase Weavile's bulk. Focus Sash is almost a necessity, as Weavile won't be able to survive any attack most of the times. However, Life Orb can be used if more power is preferred, but it leaves Weavile even more vulnerable to priority moves. Pressure is the chosen ability, as Pickpocket is too unreliable to be competitively viable.</p> <h1>Usage Tips</h1> <p>Weavile has to be brought onto the field safely, either in a leading position or after a teammate has fainted. Weavile should also be used against Trick Room setters such as Cresselia and Dialga, as it can deal fairly well with most of them thanks to the combination of Fake Out and its other moves. More generally, use Fake Out as soon as Weavile is on the battlefield to prevent one of the foes from acting and allow Weavile's partner to set up or deal with the foes more easily. If running it, use Protect to scout for the opponent's intentions; however, Protect is usually quite risky to use, as it gives the foes the opportunity to set up Tailwind, Trick Room, or boosting moves.</p> <h1>Team Options</h1> <p>Primal Kyogre greatly benefits from Weavile being able to deal with Thundurus and physical attackers such as Mega Salamence and Rayquaza. On a similar note, Xerneas appreciates Weavile's Fake Out support to set up more easily, as well as its ability to deal with the two Dragons. Like for any other Fake Out user, wallbreakers can take advantage of one of the foes not moving; Primal Kyogre, Primal Groudon, Rayquaza, and Mega Kangaskhan are good teammates for this. Allied Mega Salamence and Rayquaza can take advantage of Weavile dealing with opposing Dragons, which also allows them to avoid mind games and Speed ties. Yveltal can be used to form a powerful Dark-type core thanks to Dark Aura, but the duo is very weak to common threats such as Xerneas.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Haund", "user_id": 193885}], "teams": [{"name": "Quality checked by", "members": [{"username": "Jio", "user_id": 22788}, {"username": "Ksh13", "user_id": 257422}]}, {"name": "Grammar checked by", "members": [{"username": "fleurdyleurse", "user_id": 195877}, {"username": "Lumari", "user_id": 232216}]}]}
  },
  "Liepard": {
    "overview": "<p>Liepard is a unique Prankster user in the VGC 2016 metagame. Its access to status moves such as Fake Tears and Encore and a faster Fake Out than Mega Kangaskhan and the uncommon Meowstic allows Liepard to perform a useful role on many teams. Liepard also has access to STAB Foul Play, which only few other threats can boast. However, it has terrible bulk and requires Foul Play to deal much damage. It has severe four-moveslot syndrome, making it difficult to fit what moves you might want onto it. It is also slower than Thundurus and Whimsicott, which also have Prankster, making it difficult to avoid getting Taunted or Encored itself.</p>",
    "comments": "<h1>Other Options</h1> <p>Liepard has a very wide movepool, allowing it to remain very effective while running a multitude of sets. Role Play can be used to reset a partner Primal Pokemon's weather, which can help against the opposite Primal Pokemon and Mega Rayquaza. Liepard can run both Encore and Swagger by dropping the second moveslot for the other move. Charm and Snarl can be used to decrease the opponent's offensive stats, but they take up a useful moveslot and can be useless in many cases. Protect can punish Pokemon that think they can quickly double target Liepard to get rid of it, but it takes up a useful moveslot. Assist allows Liepard to use a move such as Dark Void from its own team's Smeargle, but is completely random unless Liepard's teammates have mostly moves which Assist does not affect. Knock Off or Sucker Punch with a Jolly nature and maximized EVs in Attack can work as an alternative to Foul Play. However, these two moves are very unreliable, as Liepard has a mediocre Attack stat and both moves deal little to no damage to most restricted legendaries, whereas Foul Play can deal much more.</p> <h1>Checks and Counters</h1> <p><strong>Utility</strong>: Liepard does particularly well against slower utility Pokemon but when facing a faster Pokemon such as Thundurus or Whimsicott, it fears getting Taunted or Encored. If Liepard runs Encore over Taunt, it can be easy bait for Follow Me or Rage Power users. Quick Guard users are also dangerous, as they can force Liepard to use Foul Play and prohibit Liepard from carrying out its job.</p> <p><strong>Strong Attacks</strong>: Liepard has very low HP and bulk and cannot take more than one hit from most threats. Special attackers in particular pose great threat, as Liepard's Foul Play will not hit them for as much damage as it would normally deal to a physical attacker.</p> <p><strong>Mega Kangaskhan</strong>: While Liepard can manipulate an opposing Mega Kangaskhan into being incapable of doing anything with Fake Out, a Mega Kangaskhan that is played smartly can nab a clean KO on Liepard with either of its Fighting- or Normal-type attacks, as Parental Bond ignores the target's Focus Sash. As it has Inner Focus before Mega Evolving, Mega Kangaskhan might also attempt to avoid an otherwise inevitable Fake Out flinch from Liepard.</p>",
    "sets": {
      "Prankster Support": {
        "description": "<h1>Moves</h1> <p>Fake Out allows Liepard to stop opposing threats from getting off attacks or stop Pokemon from using a move such as Thunder Wave or Trick Room. Foul Play is Liepard's damaging option and deals high amounts of damage to restricted legendaries, and its power is increased due to the raising of the foe's Attack stat by Swagger. Encore lets Liepard lock the target into moves like Protect and Trick Room, while Swagger gives Liepard a decent chance at stopping Pokemon from attacking that turn as well as on later turns, but at the cost of reliability. Taunt can make Smeargle incapable of doing anything while prohibiting the use of Geomancy, Follow Me, and any form of speed control bar Icy Wind. Fake Tears, on the other hand, lowers the target's Special Defense by two, significantly increasing the damage output of Liepard's partner's special attacks. Thunder Wave is a final option that allows Liepard to cripple fast threats that could otherwise sweep the team such as Xerneas and Mega Rayquaza.</p> <h1>Set Details</h1> <p>The given Speed EVs allow Liepard to outspeed as much as possible; the remaining EVs are put into HP to improve bulk, as there is no other stat for them to be invested in. A Timid nature is used because Liepard does not utilize either of its attacking stats. Focus Sash lets it live longer when it faces restricted legendaries that aim to get rid of Liepard. Prankster gives Liepard's status moves priority in order to make it easier to carry out its role.</p> <h1>Usage Tips</h1> <p>Liepard functions well as a lead, as Fake Out can provide a good amount of momentum for the team. Liepard should always have a strong partner out with it in order to not lose momentum. If Liepard is carrying Encore, it should usually use Fake Out on the strong attacker and Encore on its supportive partner the next turn, unless facing Smeargle. In that case, it would use Fake Out on Smeargle instead. If Liepard is carrying Taunt, it should use it on the foe to prevent it from getting up anything too dangerous, such as Trick Room or Gravity. Be aware of potential Quick Guard users such as Crobat or Talonflame, as they may stop Liepard from using anything but Foul Play. It might not be best to bring Liepard in a game against a Quick Guard user.</p> <h1>Team Options</h1> <p>Liepard does very well with strong special attackers such as Primal Kyogre and Xerneas due to it providing Fake Tears support, increasing the damage that either one deals. Setup attackers such as Geomancy Xerneas and Swords Dance Primal Groudon greatly appreciate the Fake Out support, as well as Tailwind setters such as Mega Salamence and Talonflame. Yveltal is also a notable partner, as Dark Aura boosts the power of Foul Play, which can be strengthened by Swagger boosts, and both Liepard and Yveltal can run it effectively. Lastly, Ditto can effectively switch in on foes that have had their Attack stats raised by Swagger and copy the boosts. Liepard itself likes Pokemon that can deal with Mega Kangaskhan, such as Mega Gengar or Mega Salamence, as well as checks to Quick Guard users, which can be any restricted legendary.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Derivatives", "user_id": 237342}], "teams": [{"name": "Quality checked by", "members": [{"username": "Jio", "user_id": 22788}, {"username": "Carbonific", "user_id": 233942}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}, {"username": "GatoDelFuego", "user_id": 91628}]}]}
  },
  "Whimsicott": {
    "overview": "<p>Whimsicott's ability Prankster allows it to act as a reliable support Pokemon. Its wide supporting movepool complements this well, featuring moves such as Tailwind, Encore, Safeguard, Taunt, and Grass Whistle. This variety of options makes Whimsicott fairly unpredictable; however, this also makes it suffer from four-moveslot syndrome, meaning it is forced to leave out some important moves and adapt its set depending on the team's needs. Whimsicott has a mediocre typing: it is weak to attacks coming from common Pokemon such as Primal Groudon and Mega Rayquaza, but it also resists types such as Water and Dark and is immune to Dragon, giving it a small advantage over threats such as Primal Kyogre, Yveltal, and most Dragons if played correctly. However, most of these Pokemon have a way of hitting Whimsicott super effectively, via either a secondary STAB move or a coverage move. Whimsicott's Grass typing also makes it immune to a common redirection move in Rage Powder, making it a great answer to Amoonguss. Whimsicott's bulk is very low, though, and doesn't allow it to provide any significant defensive presence, although Focus Sash somewhat makes up for this. As any other support Pokemon, Whimsicott is entirely reliant on its teammates, has little offensive presence, and can hardly win if it is the last Pokemon left on the field.</p>",
    "comments": "<h1>Other Options</h1> <p>Grass Knot can be used as an alternative attacking option, as it reaches its full power against common threats such as Primal Kyogre and Primal Groudon, dealing significant damage to them. Grass Whistle can be considered because it has priority thanks to Prankster, although its awful accuracy makes it not worth using in most cases. Swagger can be used in conjunction with Safeguard in order to give a physically attacking partner a free boost in Attack. Beat Up works well if Whimsicott is paired with Terrakion, as the move can boost the latter's Attack to sky-high levels without damaging it significantly. Worry Seed is a viable option to negate key abilities such as Mega Kangaskhan's Parental Bond, Mega Salamence's Aerilate, Cresselia's Levitate, and Primal Groudon's Desolate Land. Trick Room is an option if Whimsicott is used on dedicated Trick Room teams, and the loss of Whimsicott's Speed advantage is inconsequential, since it will use moves with priority most of the times. Whimsicott can further aid its partner with Helping Hand, and the combination of Prankster and Focus Sash ensures that almost nothing can stop it from using the move; this can be particularly dangerous considering the high number of powerful moves in the tier. Mental Herb can be used instead of a Focus Sash to avoid being Taunted one time, though very few Pokemon can Taunt Whimsicott if it chooses to use a priority status move.</p> <h1>Checks and Counters</h1> <p><strong>Mega Kangaskhan</strong>: Mega Kangaskhan's access to Parental Bond renders Whimsicott's Focus Sash useless. However, it must be wary of getting locked into Fake Out.</p> <p><strong>Trick Room</strong>: Trick Room nullifies Tailwind's Speed boost, and most Trick Room setters, such as Cresselia and Bronzong, run Mental Herb, so Taunt will not be useful against them. However, Whimsicott can use priority Encore the following turn to lock them into the same move.</p> <p><strong>Priority Attacks</strong>: Talonflame's higher Speed means that it can use Brave Bird before getting locked into Tailwind by Encore and proceed to KO Whimsicott without trouble. Furthermore, Talonflame's Fire / Flying typing makes it take almost no damage from any of Whimsicott's attacking moves. Rayquaza has access to Extreme Speed, which has higher priority than any of Whimsicott's moves; however, it has to be wary of Moonblast.</p> <p><strong>Spread Move Users</strong>: Attackers with spread moves, such as Primal Groudon, Primal Kyogre, Xerneas, and Mega Salamence, are particularly troublesome, as they make it much easier to deal with Whimsicott's Focus Sash.</p> <p><strong>Taunt</strong>: If Whimsicott gets Taunted, it is forced to either stay on the field and provide little utility or switch out, potentially making a teammate take an unwanted hit.</p>",
    "sets": {
      "Utility": {
        "description": "<h1>Moves</h1> <p>Tailwind doubles Whimsicott's and its teammates' Speed, and Prankster ensures it is set up safely. Encore locks the foe into a move, ideally a status one, preventing it from being useful for the following three turns. It is particularly helpful to deal with Protect users, Fake Out users such as Mega Kangaskhan, Geomancy Xerneas, and most Trick Room and Tailwind setters. Moonblast is a reliable STAB move that hits the likes of Mega Rayquaza and Yveltal super effectively. The Special Attack drop chance can be useful too. Endeavor pairs well with Focus Sash, being able to bring the foe down to 1 HP after Whimsicott has been hit by a move that would otherwise KO it. Protect scouts for the foes' moves and stalls out Trick Room. Safeguard can be used to prevent Whimsicott's team from being inflicted with status, and it is especially useful against Smeargle, one of the most common leads. Alternatively, Taunt can prevent the foes from using their own status moves and can prevent sweepers, such as Geomancy Xerneas, from setting up.</p> <h1>Set Details</h1> <p>252 Speed EVs and a Timid nature maximize Whimsicott's already excellent Speed. Maximum HP investment alongside 4 Defense EVs increases Whimsicott's overall bulk, though it still doesn't allow Whimsicott to tank repeated attacks. Prankster gives priority to any of Whimsicott's non-attacking moves, allowing it to act before faster threats such as Talonflame and Mewtwo and turning it into an incredible supportive Pokemon. Focus Sash allows Whimsicott to survive at least one hit, ensuring it either sets up Tailwind or uses Encore successfully.</p> <h1>Usage Tips</h1> <p>Whimsicott should almost always be used as a lead in order to set up Tailwind as soon as possible and gain an early advantage for its teammates. Furthermore, Whimsicott has a decent matchup against common leads such as Smeargle and Crobat, since it can lock them into their status moves thanks to Encore or prevent them from using status moves with Taunt. Whimsicott does not have much offensive presence, but a well-timed Endeavor after it has been brought down to 1 HP in conjunction with minimal offensive support from its partner can KO most common threats such as Primal Groudon, Primal Kyogre, and Mega Rayquaza.</p> <h1>Team Options</h1> <p>Powerful wallbreakers such as Primal Kyogre, Mega Rayquaza, and Primal Groudon make for excellent partners, as they can take advantage of Tailwind to quickly weaken the opposing team. In particular, Pokemon with powerful spread moves such as Primal Kyogre's Origin Pulse make for especially good teammates, as Whimsicott's Encore will often force switches, and few Pokemon are not 2HKOed by such powerful attacks. Setup sweepers such as Swords Dance Primal Groudon, Swords Dance Rayquaza, and Geomancy Xerneas can take advantage of the free turns provided by Encore to set up more easily, and they can also rely on an immunity to status thanks to Safeguard, if Whimsicott is running it. Fake Out users, most notably Mega Kangaskhan, can form a leading duo with Whimsicott, which appreciates being able to set up Tailwind with much less pressure. Mega Gengar can trap a foe affected by Encore and use Disable on it, effectively rendering it completely useless.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Haund", "user_id": 193885}], "teams": [{"name": "Quality checked by", "members": [{"username": "Jio", "user_id": 22788}, {"username": "Carbonific", "user_id": 233942}]}, {"name": "Grammar checked by", "members": [{"username": "fleurdyleurse", "user_id": 195877}, {"username": "Lumari", "user_id": 232216}]}]}
  },
  "Amoonguss": {
    "overview": "<p>Amoonguss should be the first Pokemon under consideration when redirection is required, as it's often the best suited for it. Likewise, its low Speed and access to Spore make it valuable when Trick Room support, or a counter to Trick Room, is needed. Regenerator is an excellent ability for keeping Amoonguss healthy throughout battles, although it's comparably not as strong as it has been in previous years as a result of a more offensive metagame making switches more punishing. It also has excellent natural defenses which, when combined with resistances to common types such as Fairy and Water, generally allow it to take hits very well. However, its typing is a double-edged sword, as it also causes Amoonguss to be weak against Fire and Flying, which creates issues against common foes such as Primal Groudon and Mega Rayquaza. Furthermore, while Spore is a great move, preparing against Smeargle's Dark Void is so common that it inadvertently hurts Amoonguss's ability to put foes to sleep, as well-constructed teams are generally prepared against status. You should also be aware that Amoonguss is almost entirely a team player, as it lacks offensive presence despite Grass Knot's often high Base Power. It should also be ensured that Amoonguss is not outclassed on a specific team by other redirectors such as Togekiss and Clefairy, which might situationally be more appropriate picks.</p>",
    "comments": "<h1>Other Options</h1> <p>Giga Drain remains an option if you'd prefer Amoonguss to be able to regenerate health at the cost of a reduced damage output. Sludge Bomb deals more consistent damage than Clear Smog, and helps to check opposing Fairy-types. Foul Play deals good damage to foes with high Attack and is therefore particularly useful in checking setup sweepers, but Amoonguss doesn't get STAB from it, so its damage output can be disappointing compared to that of other users of the move. Hidden Power Fire can be used to help deal with Steel-types such as Ferrothorn, but its damage output is quite pitiful. Gastro Acid and Worry Seed provide a form of weather control by removing the effects of Primordial Sea and Desolate Land, and they can additionally be used to neuter foes that rely on their abilities such as Mega Kangaskhan and Mega Mawile. After You provides a form of speed control under Trick Room, as it allows normally faster allies to move after Amoonguss when used. A more physically defensive spread such as 252 HP / 252 Def / 4 SpD with a Relaxed nature and Rocky Helmet better deals with physical attackers, but the reverse is usually preferred. Sitrus Berry is another option, as it improves Amoonguss's longevity by recovering 25% of its total health and in doing so prevents a number of 2HKOs. Black Sludge and Leftovers provide an alternative to Sitrus Berry if it's in greater competition on a teammate as a result of the Item Clause. Coba Berry and Occa Berry are useful if your team is particularly threatened by foes like Talonflame. While Focus Sash might seem strange on such a bulky Pokemon, it can be useful to survive a single very powerful attack such as Mega Rayquaza's Dragon Ascent or Primal Groudon's Eruption.</p> <h1>Checks and Counters</h1> <p><strong>Flying-type Pokemon</strong>: Flying-types such as Rayquaza, Talonflame, and Mega Salamence can all OHKO Amoonguss and, moreover, 4x resist Grass. Rayquaza checks it particularly well, as Extreme Speed is on the same +2 priority bracket as Rage Powder, making it unable to be redirected outside of Trick Room. It also commonly holds a Lum Berry, which blocks a single use of Spore.</p> <p><strong>Fire-type Pokemon</strong>: Fire-types such as Primal Groudon, Ho-Oh, and Infernape deal super effective damage to Amoonguss with their Fire-type STAB moves. Primal Groudon notably has access to Eruption, which can target Amoonguss's allies regardless of Rage Powder due to being a spread attack. Ho-Oh also commonly uses Substitute, which blocks the effects of Spore.</p> <p><strong>Ice-type Pokemon</strong>: Ice-types such as Kyurem-W and Weavile can OHKO Amoonguss when holding a boosting item such as Life Orb. Kyurem-W is particularly dangerous to Amoonguss when seen on Gravity teams, as it can then ignore Rage Powder and hit Amoonguss's teammate with Blizzard due to it being a spread move.</p> <p><strong>Status Prevention</strong>: Taunt users such as Crobat, Liepard, and Thundurus can almost entirely shut down Amoonguss by limiting it to damaging moves. Substitute users such as Gengar and Aegislash can block the use of Spore against them. Safeguard users such as Meowstic, Whimsicott, and Cresselia can make their teammates immune to status like sleep. Crafty Shield users such as Klefki and Smeargle can block Spore from being used against their side of the field for a turn. Worry Seed users such as Whimsicott and opposing Amoonguss can change their ally's ability to Insomnia, making them immune to sleep. Pokemon holding Safety Goggles aren't affected by Rage Powder or Spore, making it easy for them to deal with Amoonguss. Lum Berry and Chesto Berry prevent a single attempt at putting the holder to sleep. Sleep Talk users such as Talonflame can continue to use their moves despite being put to sleep.</p>",
    "sets": {
      "Support": {
        "description": "<h1>Moves</h1> <p>Rage Powder is the main reason to use Amoonguss, as it protects Amoonguss's allies against single-target moves by redirecting them. Spore is the most reliable method of putting foes to sleep available and is therefore a great move for debilitating foes. Spore is also an excellent check to opposing Trick Room setters, as they'll be put to sleep before they can use the move as a result of its negative priority. Grass Knot provides an offensive option that has a high Base Power against the format's often very heavy Pokemon, in particular dealing excellent damage to Primal Kyogre. Clear Smog is used almost exclusively to counter Xerneas, as it removes the stat boosts gained from Geomancy. It can also help deal with other setup sweepers such as Power-Up Punch Mega Kangaskhan. Protect provides the option of shielding Amoonguss for a turn, allowing its partner a turn to maneuver.</p> <h1>Set Details</h1> <p>Mental Herb can be used to block a single use of Taunt, as this could otherwise shut down Amoonguss's ability to support its team. Lum Berry is an alternative item that helps to check Smeargle, as Amoonguss can use Spore to shut it down while its teammate uses Protect. A Lum Berry also grants the swift removal of Thunder Wave paralysis and freezes from Ice-type attacks that get fired towards it and its partner. Regenerator is Amoonguss's better ability, as the healing it provides allows Amoonguss to remain healthy late-game. A notable downside to its alternative, Effect Spore, is that it interferes with Amoonguss's ability to use Spore if the foe is poisoned, for example. A Speed-reducing nature and 0 Speed IVs are used to allow Amoonguss to move sooner under the effect of Trick Room, as its low base Speed means it doesn't mind the loss in Speed even when operating outside of Trick Room. 244 HP EVs and 60 Defense EVs allow Amoonguss to take a Double-Edge from Jolly Mega Kangaskhan. A Sassy nature is chosen, with the remaining EVs placed in Special Defense, to increase Amoonguss's ability to check the many special attackers that it faces, such as Primal Kyogre and Xerneas.</p> <h1>Usage Tips</h1> <p>While Amoonguss works well at most stages of the game, it generally prefers being used early-game the most. This ensures Regenerator's recovery will be used more often, and prevents a supporter with low offensive presence, such as Amoonguss, from having to close out the game. You'll typically want to avoid using attacking moves over Rage Powder or Spore, as Amoonguss's damage output is poor. An exception, however, is when Amoonguss is being threatened by Taunt, as you might want to attack to avoid wasting a turn. Take opportunities to switch Amoonguss out if it has taken damage or is being threatened, as Regenerator will heal it for doing so. However, it's also sometimes fine to let Amoonguss faint to a big hit, as it might have already done its job in doing so. This then allows a potentially more appropriate partner to switch in for free, continuing your team's momentum. Be aware that neither Rage Powder nor Spore will function against Grass-types or foes holding Safety Goggles.</p> <h1>Team Options</h1> <p>Trick Room setters such as Cresselia, Dialga, and Palkia can help Amoonguss take advantage of its low Speed stat by reversing the turn order. Primal Groudon appreciates Amoonguss's ability to deal with Primal Kyogre and, in the case of a special attacking variant, protect it from chip damage to maintain Eruption's high Base Power. Primal Kyogre similarly enjoys having Electric-type attacks such as Thunderbolt redirected, particularly to preserve its HP for Water Spout. In return, Primal Kyogre's Primordial Sea makes Amoonguss immune to Fire-type attacks, which it's otherwise weak to. Furthermore, Amoonguss has tools to keep Xerneas in check, which Primal Kyogre would otherwise struggle with. Flying-types such as Ho-Oh and Yveltal also appreciate being defended against Electric-type attacks. Setup sweepers such as Geomancy Xerneas and Power-Up Punch Mega Kangaskhan have an easier time using their moves safely with Amoonguss available to redirect attacks away from them. Mega Kangaskhan synergizes with Amoonguss particularly well, as Amoonguss resists the Fighting-type moves Mega Kangaskhan is weak to. Mewtwo is quite physically frail and therefore enjoys being safer in the face of physical attacks, especially Sucker Punch, which will fail when Rage Powder is used.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Carbonific", "user_id": 233942}], "teams": [{"name": "Quality checked by", "members": [{"username": "Jio", "user_id": 22788}, {"username": "Ksh13", "user_id": 257422}]}, {"name": "Grammar checked by", "members": [{"username": "P Squared", "user_id": 168392}, {"username": "GatoDelFuego", "user_id": 91628}]}]}
  },
  "Landorus": {
    "overview": "<p>Landorus's above-average Speed and wide array of coverage moves allow it to threaten many common Pokemon in the VGC 2016 metagame. It most notably finds its place as a check to Primal Groudon, as Landorus is one of the few Pokemon capable of reliably OHKOing it. That's about where its positive qualities end, however. Landorus's frailty means that even strong neutral attacks are likely to OHKO it. It's also relatively one dimensional, making it fairly predictable. Furthermore, Landorus having a completely useless ability in Sand Force means that it often finds itself lacking in damage output on neutral hits. Teams preparing for Primal Groudon so heavily doesn't do Landorus any favors either, as it may struggle to make good use of its Ground-type STAB moves. Finally, it faces competition from its alternative forme, Landorus-T, which is generally the better Ground-type attacker, thanks in part to Intimidate making it a better team supporter.</p>",
    "comments": "<h1>Other Options</h1> <p>Knock Off is probably the strongest of Landorus's other options, as it allows for the removal of Xerneas's Power Herb before it can use Geomancy, locking it into the move for another turn. Knock Off is also effective coverage against Cresselia and Gengar, two Pokemon that Landorus would otherwise struggle to deal much damage to. Stone Edge and Rock Slide can be useful for damaging foes such as Ho-Oh and Talonflame, which are hit 4x super effectively by them, and even Crobat as well, but be aware that both moves have less than perfect accuracy. Psychic can be an effective means to eliminate foes such as Amoonguss and Gengar. Focus Blast hits Mega Kangaskhan and Ferrothorn hard, but its poor accuracy leaves something to be desired. U-turn can be effective for momentum, allowing you to, for example, switch in a Primal Pokemon on the same turn Landorus switches out in order to regain control of the weather. Role Play can serve as a more direct option to control the weather when used on an allied Primal Pokemon. Finally, if Life Orb is already being used on a teammate, Expert Belt is a reasonable alternative, as Landorus will mostly be focusing on super effective hits anyway.</p> <h1>Checks and Counters</h1> <p><strong>Water-type Pokemon</strong>: Water-types are often bulky enough to take Landorus's Ground-type attacks with ease and, in addition to their super effective STAB moves, frequently carry Ice-type attacks like Ice Beam and Icy Wind to hit it for massive damage. Primal Kyogre, while threatened by Grass Knot, can easily eliminate Landorus in a single hit. Palkia is also a notable check to Landorus, as its Dragon typing means it's not threatened by Grass Knot. Ludicolo is threatened by Sludge Bomb but is otherwise easily able to switch into Landorus's Ground-type attacks thanks to its Grass typing and can then proceed to OHKO Landorus.</p> <p><strong>Ice-type Pokemon</strong>: As Landorus is 4x weak to Ice, it stands to reason that Ice-type Pokemon are effective counters to Landorus. Weavile is the most notable example of this, as its high Speed and access to Icicle Crash mean it can easily OHKO Landorus. Kyurem frequently holds a Choice Scarf and can therefore outspeed and OHKO Landorus with either Ice Beam or Blizzard depending on whether Gravity is up or not.</p> <p><strong>Faster Pokemon</strong>: Any Pokemon with Ice-type attacks that outspeed Landorus threaten it. Greninja gains STAB on Ice Beam as a result of Protean and can therefore scare Landorus. Mewtwo also has access to Ice Beam and has an easy time eliminating Landorus from the field. Mega Rayquaza, while not often able to hit Landorus super effectively, still outspeeds it and deals massive damage with moves such as Dragon Ascent and Draco Meteor.</p> <p><strong>Speed Control</strong>: As one of Landorus's most important traits is its better-than-average Speed, eliminating this through the use of speed control strips it of its effectiveness. Tailwind is one means of doing this, as even the slowest of Pokemon can often outpace Landorus after their Speed is doubled. Trick Room from users such as Cresselia can prove equally as effective.</p>",
    "sets": {
      "Special Attacker": {
        "description": "<h1>Moves</h1> <p>Earth Power is the main reason to use Landorus, as it allows it to eliminate all but the bulkiest of Primal Groudon sets. Earth Power also heavily damages common foes such as Aegislash and OHKOes most variants of Mega Mawile. Hidden Power Ice offers excellent coverage against the Flying-type foes immune to Earth Power such as Landorus-T, Mega Salamence, and Rayquaza, and it OHKOes all three of them if they are not investing in bulk. Delta Stream can make Mega Rayquaza problematic, however, as it will prevent Hidden Power Ice from being a guaranteed 2HKO. Grass Knot is used primarily to hit Primal Kyogre super effectively, dealing a large chunk of damage to it. Alternatively, Sludge Bomb can be used to deal significant amounts of damage to Xerneas, provided it hasn't already set up Geomancy. Protect is important to shield Landorus from attacks while its partner eliminates a threat or maneuvers into a better position.</p> <h1>Set Details</h1> <p>Life Orb is the recommended item, as it's necessary to improve Landorus's otherwise poor damage output up to acceptable levels. It's unfortunately stuck with Sand Force as an ability instead of its much better, but illegal, ability in Sheer Force. Sand is almost impossible to set up as a result of the Primal weather conditions not allowing it be active, so don't expect to ever receive its boost. A Timid nature and 252 Speed EVs are needed to allow Landorus to outpace the base 100 Speed tier, which is one of the biggest reasons to use Landorus in the first place. Special Attack EVs are maximized in order for Landorus to hit as hard as possible.</p> <h1>Usage Tips</h1> <p>Landorus should generally be brought out in the late-game, after an ally Pokemon has fainted, in order to decrease the number of options its targets have to switch out to. This also helps Landorus eliminate the opponent's Pokemon after they've been softened up over the course of the battle. Making predictions when using Landorus is almost always necessary due to the large number of Pokemon it threatens, forcing switches. This also makes Landorus a very high-risk, high-reward Pokemon that can end up doing nothing if played incorrectly. An example prediction would be using Hidden Power Ice to hit a Ground-weak foe, as the opponent will often attempt to switch to a Flying-type to avoid Earth Power. Be cautious around Electric-types, as while they might seem like easy prey for Landorus, they frequently carry Hidden Power Ice themselves, making them dangerous foes.</p> <h1>Team Options</h1> <p>Whimsicott and Crobat make for effective partners for Landorus due to their Tailwind support, which allows Landorus to outpace ordinarily faster foes such as Mega Salamence and Mega Rayquaza. Whimsicott's Fake Tears and Crobat's Super Fang also help Landorus pick up OHKOs on Pokemon like Mega Kangaskhan and Primal Kyogre, which it would otherwise miss out on. Xerneas is another good partner, as it appreciates Landorus's Ground-type STAB attacks for eliminating checks such as Aegislash, Mega Mawile, and Primal Groudon. In terms of defensive support for Landorus, Dark- and Ghost-types such as Yveltal, Weavile, and Gengar are useful for checking Cresselia, which is a problematic Pokemon thanks to its access to Levitate and Ice Beam. Sporting additional means to combat Primal Kyogre is also useful, so Grass- and Electric-types such as Ferrothorn and Raichu are also great partners.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Demantoid", "user_id": 264687}, {"username": "Carbonific", "user_id": 233942}], "teams": [{"name": "Quality checked by", "members": [{"username": "Jio", "user_id": 22788}, {"username": "Carbonific", "user_id": 233942}]}, {"name": "Grammar checked by", "members": [{"username": "Empress", "user_id": 175616}, {"username": "P Squared", "user_id": 168392}]}]}
  },
  "Kyurem-White": {
    "overview": "<p>As the strongest Ice-type Pokemon in the game, Kyurem-W holds a unique niche in the VGC 2016 metagame as a reliable answer to bothersome Flying-type Pokemon such as Mega Salamence, Crobat, Yveltal, and Thundurus. Kyurem-W especially finds its placing on Gravity teams, where it can throw out 100% accurate Blizzards and Draco Meteors. A solid offensive movepool with moves such as Fusion Flare, Draco Meteor, and Earth Power grants Kyurem-W superb type coverage. Respectable bulk allows it to take a plethora of attacks despite usually having no extra investment. Base 95 Speed is good even without a Choice Scarf, as it can outspeed both Primals and other Legendaries, such as Ho-Oh, Zekrom, and Dialga. However, Kyurem-W doesn't enjoy fighting Xerneas both before and after a Geomancy boost. Furthermore, it has a miserable time taking on a combination of Kyogre and a Steel-type, as Primordial Sea negates Fusion Flare. Kyurem-W usually has to switch out after launching a Draco Meteor, which can kill your momentum and thus is extremely detrimental in such a volatile format.</p>",
    "sets": {
      "Choice Scarf": {
        "description": "<h1>Moves</h1> <p>Blizzard is one of Kyurem-W's strongest STAB moves and is used best when under Gravity. Blizzard's accuracy is increased substantially under the effects of Gravity, which makes it pretty spammable, as you can launch Blizzards with perfect accuracy that can OHKO most of the Flying-types while doing significant damage to their partners. Ice Beam will be Kyurem-W's most used move outside of Gravity and is extra effective against the common support Flying-types in the format, such as Crobat. Ice Beam also has a guaranteed chance to OHKO non-bulky Yveltal, whereas Blizzard is a roll due to it being a spread move. Draco Meteor is Kyurem-W's strongest move and is good for OHKOing problematic Pokemon quickly, but it lowers Kyurem-W's Special Attack and forces you to switch most of the time. Fusion Flare is an excellent tool against Steel-types such as Ferrothorn, Scizor, Bronzong, and Mega Mawile, as it is able to OHKO or 2HKO all of them. Earth Power deals the most damage to Primal Groudon and Dialga, but being locked into a Ground-type move is troublesome with all the Flying-types in the metagame.</p> <h1>Set Details</h1> <p>The spread is simple and allows Kyurem-W to outspeed the majority of the threats in the format and hit as hard as possible. Maximum Speed is essentially for Speed tying with opposing Choice Scarf Kyurem-W. You can run 4 HP / 12 Def / 252 SpA / 236 Spe to outspeed Mega Sceptile, which is a relevant enough threat in the format, while giving Kyurem-W an extra three points in Defense to take physical hits slightly better. Choice Scarf is the item of choice here, as it allows Kyurem-W to outspeed Crobat, Yveltal, and Mega Salamence and OHKO them all with Ice Beam. A Modest nature with maximum Special Attack EVs allows Kyurem-W to deal as much damage as possible while also getting important KOs such as the OHKO on Mega Rayquaza with Ice Beam, the OHKO on offensive Yveltal with Ice Beam, and the 2HKO on Mega Kangaskhan with Blizzard.</p> <h1>Usage Tips</h1> <p>Kyurem-W can make a fantastic lead in order to combat the usual Flying-type leads like Crobat and Thundurus. Since Choice Scarf prevents Kyurem-W from protecting itself, make sure to keep it safe from hindrances such as Fake Out and Thunder Wave by either switching or having a partner that deflects those moves. Be careful with using Draco Meteor, as there are plenty of scary Pokemon that can take full advantage of free turns. Make sure that you have safe switch-ins on your team should Kyurem-W need to switch out. Try to avoid bringing Kyurem-W against obvious Trick Room teams because it will just be a liability. If using Gravity, make sure Kyurem-W is on the field as soon as possible when Gravity goes up, as it makes effective use of Gravity due to Blizzard. Make sure to scout for Wide Guard before you begin to fire off Blizzards as well. Late-game, Kyurem-W is a solid option that can come in and start cleaning up weakened opponents with ease.</p> <h1>Team Options</h1> <p>Primal Groudon is a solid partner that can punch holes through teams, which lets Kyurem-W clean up with fast Ice Beams. Primal Groudon also appreciates having annoying Flying-types dealt with so that it can use Precipice Blades to its heart's content. Sableye's access to Prankster Gravity means that it can set up priority Gravity, which is ideal for Choice Scarf Kyurem-W. Sableye also has access to Feint, which is good for helping Kyurem-W break down teams by removing their ability to protect against it. Meowstic also has access to Prankster Gravity, but it also has other tools such as Safeguard to combat Dark Void and Charm to whittle down Groudon and Kangaskhan. Mega Kangaskhan also enjoys Pokemon like Mega Salamence and Crobat quickly dealt with while providing free turns and openings with Fake Out. Crobat appreciates having other Crobat taken out so it doesn't have to deal with opposing Tailwind shenanigans. It also excels at taking on Xerneas and Smeargle with Taunt and Haze, which is great for Kyurem-W, as it hates to deal with a Geomancy-boosted Xerneas and Smeargle with access to Follow Me and Wide Guard.</p> <h1>Other Options</h1> <p>Life Orb is a viable set that lets Kyurem-W dish out incredible damage to everything in the format. However, the drawback is that Kyurem-W can get outsped by a number of threats and OHKOed by them before accomplishing much. Focus Sash is cool for guaranteeing that Kyurem-W can survive a turn in order to get off a vicious hit, but its damage output is weakened and it loses out on outspeeding faster Pokemon. Kyurem-W has the strongest Icy Wind in the format, which not only deals hefty damage but also provides much needed speed control. Dragon Pulse is an alternative to Draco Meteor if the Special Attack drops and accuracy don't suit you. Focus Blast can be used over Fusion Flare, as Gravity mitigates its low accuracy, and it hits Ferrothorn and Mega Kangaskhan hard.</p> <h1>Checks and Counters</h1> <p><strong>Steel-type Pokemon</strong>: Scizor, Ferrothorn, Bronzong, Dialga, and Mega Mawile can all shut down Kyurem-W with their respective STAB moves. However, they should each be cautious of Kyurem-W's coverage options, as Fusion Flare and Earth Power can deal massive damage in return.</p> <p><strong>Xerneas</strong>: Xerneas can withstand most of Kyurem-W's attacks and OHKO it in return with a Moonblast. Xerneas can also simply set up a Geomancy and then outspeed Kyurem-W and OHKO it.</p> <p><strong>Primal Kyogre</strong>: Though Primal Kyogre can't do too much damage to Kyurem-W, it can take on all of its attacks very well. Primal Kyogre can also whittle Kyurem-W down with multiple Origin Pulses, burn it with Scald, or invalidate its Choice Scarf with a paralysis from Thunder</p> <p><strong>Speed Control</strong>: Seeing that Kyurem-W relies on its Choice Scarf, opposing speed control tactics such as Thunder Wave, Icy Wind, Tailwind, and Trick Room are very detrimental.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Jio", "user_id": 22788}], "teams": [{"name": "Quality checked by", "members": [{"username": "Carbonific", "user_id": 233942}, {"username": "Jibaku", "user_id": 1779}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}, {"username": "Rare Poison", "user_id": 197616}]}]}
  },
  "Talonflame": {
    "overview": "<p>Despite its mediocre offensive and defensive stats, Talonflame is able to maintain its viability in the VGC 2016 metagame thanks to Gale Wings. The ability to set Tailwind and strike with high Base Power moves such as Brave Bird, both with priority, is a valuable niche. Talonflame's Speed stat is also so naturally high that it doesn't necessarily have to set Tailwind if it must make use of Flare Blitz. This Speed also comes in handy in combination with Quick Guard, as not only can it shut down prominent priority users like Thundurus, but it can stop even the fastest Fake Out users such as Weavile, which would ordinarily prove a difficult task given that these moves are on the same priority bracket. Talonflame's other viable options are great for keeping the opponent guessing too, as leaving moves such as Taunt and Will-O-Wisp unaccounted for could result in its foes being crippled.</p>",
    "comments": "<h1>Other Options</h1> <p>Will-O-Wisp can be used to burn physical attackers such as Mega Kangaskhan and to inflict chip damage on bulky foes such as Bronzong and Cresselia. Snatch allows Talonflame to steal opposing Tailwind and setup moves, but bear in mind that this doesn't work on Geomancy. Swords Dance provides Talonflame a means of setting up, but Talonflame's frailty means it's unlikely to KO consecutive foes. A Sharp Beak can be used over Life Orb if you want to reduce recoil, but given that Talonflame is unlikely to survive long anyway, it's generally fruitless. Choice Band boosts Talonflame's damage output even higher than Life Orb, but this makes the use of support moves more difficult. Alternatively, Lum Berry can be used to block status such as sleep induced by Dark Void. Finally, using a bulkier EV spread such as 100 HP / 124 Atk / 4 Def / 28 SpD / 252 Spe to survive attacks such as +2 Timid Xerneas's Moonblast and opposing Talonflame's Life Orb-boosted Brave Bird is possible, but the drop in power is significant.</p> <h1>Checks and Counters</h1> <p><strong>Electric-type Pokemon</strong>: Electric-types such as Thundurus, Raichu, and Zapdos resist Brave Bird and hit Talonflame with their super effective STAB moves. The former two should be wary of Quick Guard blocking their Prankster moves and Fake Out, respectively, though. Zapdos is the most notable of the three, as it's the bulkiest and can match Talonflame's Tailwind with that of its own. Static also means it has a chance to paralyze Talonflame.</p> <p><strong>Mega Rayquaza</strong>: Mega Rayquaza's access to Extreme Speed means it can move before Talonflame's Brave Bird thanks to its higher priority bracket. It also resists Fire, allowing it to get onto the field against Talonflame more safely.</p> <p><strong>Intimidate</strong>: Intimidate users such as Salamence and Landorus-T reduce Talonflame's Attack by one stage when switched in, reducing its damage output significantly. Landorus-T is particularly dangerous, as its access to Rock Slide means it can eliminate Talonflame from the field easily as a result of its 4x weakness to Rock-type attacks.</p> <p><strong>Quick Guard</strong>: Opposing Quick Guard users such as Crobat are able to prevent the use of Brave Bird for a turn.</p>",
    "sets": {
      "Offensive Support": {
        "description": "<h1>Moves</h1> <p>Brave Bird is Talonflame's main attacking move given that it has STAB, high Base Power, and priority. Flare Blitz serves as Talonflame's secondary STAB move and has the potential to hit even harder than Brave Bird when boosted by Primal Groudon's Desolate Land. It often sees use against that which resist Flying like Electric-types or against Steel-types such as Mega Mawile. Tailwind allows Talonflame to double the Speed stat of its team for three turns, and it does so with priority thanks to Gale Wings. Quick Guard protects Talonflame and its partner from priority moves like Fake Out and Prankster Encore and Taunt. If you don't find yourself needing Quick Guard, then Taunt can be used in this slot instead to prevent the use of status moves such as Dark Void. Alternatively, if the support is not needed, then Protect is recommended in order to provide Talonflame with the ability to shield itself for a turn.</p> <h1>Set Details</h1> <p>A Life Orb boosts Talonflame's damage output as much as possible while still allowing it to switch moves. Gale Wings grants priority to Talonflame's Flying-type moves. The 252 Attack EVs and an Adamant nature are used for much the same reason as Life Orb, with the remaining EVs being placed into Speed. Investment in bulk isn't recommended, as the recoil from Brave Bird and Flare Blitz combined with that of Life Orb will render most defensive benchmarks pointless. A Jolly nature is a fine alternative it you'd prefer to block Fake Out from particularly fast users such as Weavile and to set Tailwind before Prankster Thundurus's Taunt.</p> <h1>Usage Tips</h1> <p>Talonflame will typically want to be brought in during the early-game to set up speed control for its partners to sweep under. Leading with a Fake Out user is common, so expect your opening play to consist of Quick Guard followed by Tailwind on the next turn. After Tailwind is set up, provided a partner doesn't need to be defended by Quick Guard against crippling Prankster moves, you'll generally want to spam Brave Bird and Flare Blitz until Talonflame faints, and you can get a free switch into a potentially more appropriate partner that's in reserve.</p> <h1>Team Options</h1> <p>Primal Groudon makes for an excellent partner, as Talonflame appreciates its Desolate Land to boost the power of Flare Blitz, while Primal Groudon enjoys operating under Tailwind primarily to outspeed opposing Primal Pokemon. Primal Kyogre equally enjoys Talonflame's presence for sweeping under Tailwind, and while Talonflame's Flare Blitz will be nullified by Primordial Sea, it's still able to help it out offensively by taking care of the Grass-types that Primal Kyogre struggles against. Mega Kangaskhan is also a great teammate, as Fake Out's ability to make foes flinch can help Talonflame set up Tailwind freely. Smeargle is likewise a possible Fake Out user and is particularly devastating under Tailwind with its ability to put the opposing team to sleep with Dark Void. Mega Mawile is another Pokemon that greatly appreciates Tailwind to patch up its otherwise low Speed stat. Xerneas appreciates Talonflame's Quick Guard to block Prankster Taunt, Encore, and Thunder Wave, which would otherwise impair its ability to set up and sweep. Mega Rayquaza operates very much the same way with its high Speed and potential to set up Swords Dance, and its Delta Stream ability protects Talonflame against Rock- and Electric-type attacks, while Talonflame deals with opposing Steel-types with its Flare Blitz. Bear in mind that both Rayquaza and Talonflame frequently hold Life Orb, so Focus Sash should most likely be used on Rayquaza in the event that they're paired together.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "cgyc", "user_id": 310105}, {"username": "Carbonific", "user_id": 233942}], "teams": [{"name": "Quality checked by", "members": [{"username": "Jio", "user_id": 22788}, {"username": "Ksh13", "user_id": 257422}]}, {"name": "Grammar checked by", "members": [{"username": "Rare Poison", "user_id": 197616}, {"username": "Empress", "user_id": 175616}]}]}
  },
  "Xerneas": {
    "overview": "<p>Xerneas graces the battlefield as one of the most devastating setup sweepers ever to be allowed in VGC. Geomancy is Xerneas's signature move and its most formidable set, as Xerneas is more than capable of sweeping through a team after the boosts. Not only does Xerneas sport a solid base 131 Special Attack, but it also possesses respectable HP and defensive stats that allow it to take most hits very well. Base 99 Speed is also a handy in a format where the majority of the restricted Pokemon are sitting between base 90 and 95 Speed. Furthermore, Xerneas's ability, Fairy Aura, grants it decent offensive pressure, which is especially handy when you find yourself not able to set up a Geomancy. Unfortunately, while it possesses a number of strengths, it also has to deal with a number of flaws. Xerneas doesn't have many viable options against Poison-, Steel-, and Fire-types besides throwing boosted Fairy-type moves at them. While base 99 Speed is nice, Xerneas can still be outsped by faster Pokemon such as Mega Kangaskhan. Also, the threat of Geomancy makes it very vulnerable to countermeasures such as Taunt, Encore, Gyro Ball, Thunder Wave, and Trick Room. While Xerneas isn't a deciding factor for using these moves, their existence makes Geomancy a bit less effective. Despite these flaws, Xerneas remains as a top threat in the VGC '16 format and should be respected as such.</p>",
    "comments": "<h1>Other Options</h1> <p>Psyshock or Psychic is there if you want a coverage option against Crobat, Amoonguss, Gengar, and any other relevant Poison-types. If you want an offensive set without Geomancy, you can use Life Orb or Choice Specs as a way for Xerneas to just dish out massive damage from the get go. However, keep in mind that the Geomancy set is infinitely better than every other offensive option Xerneas has. If you want to use a more supportive set, then Thunder Wave, Gravity, and Heal Pulse are options. Misty Terrain can be utilized to keep Xerneas and its grounded teammates safe from status moves such as Dark Void, but is hardly worth the moveslot. Thunder is an interesting move if you have a Kyogre on your team, as it hits Talonflame and Ho-Oh harder than Moonblast. Thunder also nails Crobat and opposing Kyogre.</p> <h1>Checks and Counters</h1> <p><strong>Steel-Types</strong>: Ferrothorn, Aegislash, and Scizor all give Xerneas a hard time. Ferrothorn and Aegislash are able to OHKO Xerneas after a Geomancy boost with Gyro Ball and take a boosted Moonblast pretty well. Scizor can also OHKO Xerneas with a Swords Dance-boosted Bullet Punch before Xerneas can do anything.</p> <p><strong>Poison-Types</strong>: Amoonguss, Crobat, and Gengar all do a good job of punishing Xerneas. Amoonguss can easily tank most of Xerneas's hits and Spore it or even Clear Smog away a Geomancy boost. Crobat can Taunt Xerneas and prevent a Geomancy from happening or Whirlwind it away. Gengar can deal tons of damage with a Sludge Bomb before Xerneas can Geomancy and is then guaranteed to take a hit after that with its Focus Sash.</p> <p><strong>Primal Groudon</strong>: Groudon's typing and bulk allow it to take on Xerneas's STAB moves quite well. Groudon can then retaliate with its own STAB moves to deal massive damage back to Xerneas. Groudon can even Roar Xerneas out as it uses Geomancy.</p> <p><strong>Ho-Oh</strong>: Ho-Oh possesses massive HP and Special Defense, which allow it to shrug off Xerneas's attacks with ease, and can heal off the damage whenever with Recover. Ho-Oh can also 2HKO Xerneas with Brave Bird or inflict a burn with Sacred Fire and hinder its chance to sweep.</p> <p><strong>Disruption</strong>: Because Xerneas relies on Geomancy a lot, disruption moves such as Fake Out, Encore, Taunt, Whirlwind, and Haze really mess up Xerneas's gameplan since they prevent Geomancy that turn or nullify it altogether.</p>",
    "sets": {
      "Geomancy": {
        "description": "<h1>Moves</h1> <p>Geomancy is Xerneas's signature move and can turn Xerneas into a fast and destructive sweeper that is capable of wiping the opposing team in an instant. Moonblast is Xerneas's strongest STAB move and, when boosted by Geomancy, hits absurdly hard. Dazzling Gleam is a second STAB move and is recommended for its ability to threaten two Pokemon at once. Protect is there to save Xerneas from harm for that turn and give its partner a chance to take out any threats to Xerneas. Xerneas doesn't have many other viable coverage options, but +2 Grass Knot is capable of 2HKOing even the bulkiest Primal Groudon imaginable and OHKOing 4 HP / 0 SpD Primal Kyogre. Hidden Power Ground is also nice for threatening Poison-, Steel-, and Fire-types, barring those with an immunity such as Crobat, Gengar, Talonflame, and Ho-Oh.</p> <h1>Set Details</h1> <p>Power Herb is the only viable option, as it grants Xerneas an instant Geomancy boost. This simple EV spread allows Xerneas to hit hard as possible and, without a Geomancy boost, to outspeed a number of threats. A Modest nature can be used for more raw power, but then Xerneas risks being slower than Groudon, Kyogre, Rayquaza, and Kyurem that are running a positive Speed nature. A bulkier spread consisting of 44 Def / 212 SpA / 252 Spe allows Xerneas to tank a Life Orb Dragon Ascent from Mega Rayquaza.</p> <h1>Usage Tips</h1> <p>Instead of mindlessly clicking Geomancy on the first turn versus an opposing lead dedicated to messing up Xerneas, you're often better off preserving your wincon until later in the game. Don't be trigger happy with Geomancy as there are plenty of tools that work against it. Xerneas's STAB moves are plenty strong to soften up enemies, which can allow for other partners to clean up. If you can, try to prevent Xerneas from taking too much damage as there are plenty of priority users in the format waiting to pick off a weakened Xerneas.</p> <h1>Team Options</h1> <p>Primal Groudon is by far the best teammate Xerneas could ask for. Primal Groudon's typing allows it to eliminate troublesome Poison- and Steel-types that exist to ruin Xerneas's sweep. Additionally, Kangaskhan is a solid teammate since it has access to Fake Out, which can grant Xerneas a free turn to set up Geomancy. Kangaskhan is also really good at punching holes through opposing teams, allowing Xerneas to clean up without the use of Geomancy at times. Smeargle is another interesting partner for Xerneas since it not only possesses Fake Out, but also has plenty of other tricks. Smeargle can utilize Follow Me to redirect single target moves or Dark Void to put both opponents to sleep. Both of these grant Xerneas extra free turns to do whatever it pleases. Other redirection users such as Amoonguss and Togekiss make fantastic partners for Xerneas, as they're able to redirect single target attacks to keep Xerneas from harm. Salamence is another solid partner for Xerneas since it checks Primal Groudon pretty well and also has Intimidate to buffer physical attacks against Xerneas, making it slightly easier to set up Geomancy. Primal Kyogre also checks Primal Groudon, and can even abuse Xerneas's Geomancy with a Psych Up.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Jio", "user_id": 22788}], "teams": [{"name": "Quality checked by", "members": [{"username": "Serapis", "user_id": 228266}, {"username": "Ksh13", "user_id": 257422}]}, {"name": "Grammar checked by", "members": [{"username": "Lemonade", "user_id": 67440}, {"username": "piikachuu", "user_id": 190864}]}]}
  },
  "Yveltal": {
    "overview": "<p>Yveltal fills a unique offensive support role unlike any other restricted Pokemon in the format. Its offensive power is hard to check, as there are not many popular Pokemon that resist Dark-type moves, and it can OHKO bulky Trick Room setters such as Bronzong and Cresselia. Yveltal supports its teammates with just its presence through Dark Aura, which boosts the power of Dark-type moves such as Sucker Punch, or through moves like Snarl. Its typing gives it two immunities, making it easy to fit onto teams. Unfortunately this typing is also Yveltal's biggest weakness, as it makes Yveltal weak to some of the most popular offensive types in VGC16 such as Fairy and Ice, and outside of obscure moves, Yveltal can't hit their users back super effectively. Yveltal is also weak to common spread moves like Dazzling Gleam and doesn't resist Eruption or Water Spout. Occasionally Yveltal's ability can backfire onto its own teammates, since it boosts the foe's Dark-type moves as well. Base 99 is an awkward Speed tierwhile it's useful against many of the other slower restricted Pokemon, it isn't good enough to prevent Yveltal from being outsped by other crucial threats.</p>",
    "comments": "<h1>Other Options</h1> <p>164 Speed with a Jolly nature allows Yveltal to outspeed base 100s that don't have a Speed-boosting nature. Oblivion Wing might seem useful on a dedicated support set to deal more damage to Grass-types and help recover HP, but its Base Power is low and Yveltal doesn't like giving up one of its other Dark-type moves. If you really want recovery to help Yveltal stick around longer and aren't using an Assault Vest, Roost is better. Yveltal has an interesting support movepool, with moves like Taunt and Tailwind, but it doesn't really have a free moveslot to give up for one of them.</p> <h1>Checks and Counters</h1> <p><strong>Fairy-type Pokemon</strong>: Most Fairies don't take much damage from anything Yveltal can throw at them. Mega Mawile has a large amount of bulk, and its base forme has Intimidate to weaken some of Yveltal's moves, while Xerneas uses Yveltal as setup bait.</p> <p><strong>Ice-type Pokemon</strong>: Ice-types such as Kyurem-W and Weavile often scare Yveltal out with a powerful Ice move. Weavile can also use Yveltal's Dark Aura against its teammate.</p> <p><strong>Terrakion</strong>: Terrakion can throw around powerful Rock Slides to hit Yveltal super effectively, take advantage of Dark-type attacks with its resistances and Justified ability, and also use Quick Guard to block Sucker Punches on its teammates.</p> <p><strong>Intimidate and Burns</strong>: Burns and Intimidate will lower Yveltal's damage output, making it far less of a threat, as it will no longer be able to pick up the OHKOs that it otherwise would be able to. Burn will also lower Yveltal's own Foul Play damage, whereas the opponent's Intimidates will not have this effect. A teammate's Intimidate will lower Yveltal's Foul Play damage, however.</p> <p><strong>Speed Control</strong>: Yveltal relies on being faster than other restricted Pokemon to deal massive amounts of damage to them before it gets hit back. While Yveltal does have enough bulk to take a hit or two, having its Speed reduced through paralysis or moves like Icy Wind turns Yveltal into easy prey for all of the high-powered attacks being flung around by other restricted Pokemon; this forces Yveltal to rely on Sucker Punch to get the first hit in. Electric-type Pokemon that use paralysis such as Thundurus and Raichu can also hit Yveltal super effectively.</p> <p><strong>Faster Priority Moves</strong>: Yveltal relies on Sucker Punch to deal damage to faster targets, but Extreme Speed, faster priority moves, and even Quick Guard will completely nullify the attack.</p>",
    "sets": {
      "Offensive": {
        "description": "<h1>Moves</h1> <p>Knock Off deals incredible amounts of damage, even OHKOing the likes of Cresselia. Sucker Punch lets Yveltal finish off Pokemon that its other moves couldn't and helps it clean up late-game. Foul Play seems strange on an offensive set, as it doesn't use Yveltal's own Attack stat, but it does more damage than Knock Off would to Primal Kyogre, Primal Groudon, and Mega Evolutions with high Attack stats. It also makes Yveltal not as affected by opposing Intimidate. This set is relatively frail, so Protect helps Yveltal stay around longer.</p> <h1>Set Details</h1> <p>Life Orb boosts the power of all of Yveltal's attacks at the cost of HP, helping obliterate targets that wouldn't be knocked out otherwise. Dark Aura helps boost the power of Yveltal's Dark-type moves as well as those of its teammates. Maximum Speed is used for Speed tying with Xerneas and other Yveltal. 252 EVs are dumped into Attack, making Yveltal hit as hard as possible, and the remaining EVs go into HP.</p> <h1>Usage Tips</h1> <p>Yveltal is effective against many team archetypes and performs well at all points in a battle. Be careful against teams that have a Xerneas, however, as Yveltal is almost useless against it. This Yveltal set is strong against teams that rely on Cresselia or Bronzong for speed control and positioning. Being able to knock them out in one hit with Knock Off can completely eliminate a team's supporting options for the rest of the battle.</p> <h1>Team Options</h1> <p>Many players will try to exploit Yveltal's Fairy or Ice weakness, so Pokemon like Primal Groudon, Scizor, and Ferrothorn that can deal with Xerneas and Ice-types make for excellent teammates. Dark Aura allows partners such as Mega Mawile or Mega Kangaskhan to get a boost to their Dark-type attacks. A teammate's Swagger can be used to increase the damage of Foul Play. Wide Guard can help block powerful spread moves like Dazzling Gleam and Rock Slide. Primal Kyogre can usually pressure a lot of Yveltal's checks and counters, and the raw power that both of them bring makes it very hard to deal with. However, they both have a weakness to Electric-type attacks and neither enjoys dealing with a boosted Xerneas.</p>"
      },
      "Assault Vest": {
        "description": "<h1>Moves</h1> <p>Foul Play allows Yveltal to punish heavy physical attackers and Pokemon that boost their Attack, like Swords Dance Rayquaza and Power-Up Punch Mega Kangaskhan, and deals heavy damage to all the restricted Pokemon that naturally have high Attack stats. Dark Pulse is a more consistent damage option that hits Pokemon with low attack for more damage, isn't affected by burn or a teammate's Intimidate, and can make slower targets flinch. Snarl lowers both of the foes' Special Attack and gets some chip damage, which is very useful against Pokemon such as Primal Groudon and Primal Kyogre, as it decreases the power of Eruption and Water Spout. Sucker Punch allows Yveltal to get the edge against faster Pokemon and secure safe revenge kills. Oblivion Wing makes Yveltal much harder to KO and deals good damage to Pokemon such as Scrafty and Hitmontop.</p> <h1>Set Details</h1> <p>Assault Vest adds a ton of special bulk without sacrificing EVs, allowing Yveltal to survive moves such as a +2 Dazzling Gleam from Xerneas and a maximum-strength Water Spout from Primal Kyogre in the rain. Using Sucker Punch on a set with an Attack-reducing nature seems strange, but it already does a load of damage even when uninvested and doesn't dig into Yveltal's defenses like a nature such as Naive would. Dark Aura is mandatory, as it is Yveltal's only ability and adds more damage potential to Yveltal's and its teammates' Dark-type moves. 84 Speed with a Timid nature allows Yveltal to outspeed base 90 Pokemon that aren't using a Speed-increasing nature, such as Primal Groudon and Primal Kyogre. The rest of the EVs go into HP and Defense for more bulk, but they are very customizable on this set. Change them to outspeed more Pokemon or deal more damage as your team needs it.</p> <h1>Usage Tips</h1> <p>As Yveltal is good in most team match ups, it can be brought along to most games, but it has to be wary around teams that have Xerneas. Yveltal can be used both in the lead or in the back. Foul Play will help chunk away damage for a later sweep from a teammate, Snarl will deal chip damage and reduce the power of the foes' attacks, Oblivion Wing helps Yveltal stick around longer, and Sucker Punch can help clean up late-game.</p> <h1>Team Options</h1> <p>Prankster users such as Liepard can use Swagger to double Foul Play's damage output. Yveltal hates to deal with any Fairy-type, so Steel-types like Mega Mawile, Ferrothorn, and Bronzong are great partners. These Steel-types also help cover Yveltal's weakness to Ice-types. Primal Groudon is also a great partner, as it is a good Fairy and Electric check. A Lightning Rod user can help redirect Thunder Waves and other Electric-type moves, especially if Yveltal is paired with Primal Kyogre. Wide Guard can also help block Xerneas's Dazzling Gleam, Primal Groudon's Eruption, and various Rock Slides. Yveltal's presence boosts the power of any Dark-type move, which teammates such as Mega Kangaskhan and Mega Mawile can take advantage of to get their Sucker Punches boosted. Be wary of boosting Dark-type moves from foes, however. Intimidate support can help Yveltal stay alive for even longer, but it will cut into the damage Yveltal can deal with Foul Play. If this is an issue, use Dark Pulse instead.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Pyritie", "user_id": 61477}], "teams": [{"name": "Quality checked by", "members": [{"username": "Serapis", "user_id": 228266}, {"username": "blarajan", "user_id": 59999}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}, {"username": "Rare Poison", "user_id": 197616}]}]}
  }
}