{
  "Pikachu": {"sets": [{"name": "Imposter"}]},
  "Gengar": {
    "comments": "<h1>Other Options</h1> <p>Substitute can be used to decrease Mega Gengar's reliance on Substitute-passing Wonder Guard users, as well as being able to reset a Substitute if it was broken to continue sweeping. Boomburst can be used as another attack to Imposter-proof effectively, and it allows Gengar to hit foes behind a Substitute. However, this option is not recommended, as Gengar can typically clear foes with its standard moveset effectively. King's Shield can be used as an option to counter -ate Speed users, lowering their Attack while avoiding a turn of potential priority damage.</p> <h1>Checks and Counters</h1> <p><strong>Pursuit: Pursuit users—namely Huge Power Dark-types like Mega Gyarados, Mega Tyranitar, and Yveltal—and -ate Speed users like Kyurem-B can force 50-50s every time they come in on Mega Gengar. However, they can usually only come in once or twice before getting put into KO range by Judgment. A few other, less prevalent Pursuit users like Wonder Guard Skuntank and Drapion might need Knock Off and Pursuit to adequately force 50-50s versus Mega Gengar.</p> <p><strong>Wonder Guard Blissey and Mega Audino: Because Mega Gengar usually has to pick between Sludge Wave and Secret Sword, Mega Gengar may not be able to break Blissey that check Sludge Wave sets and Mega Audino that check Secret Sword sets. However, the opponent has to scout Mega Gengar's coverage move first, as not knowing which move Mega Gengar has chosen as coverage makes it very unsafe for both Blissey and Mega Audino to come in. Sometimes, Mega Gengar runs both coverage moves to check both.</p> <p><strong>Prankster Pokemon</strong>: Prankster Pokemon like Giratina can threaten Mega Gengar's boosts or lure it into attacking into a Destiny Bond, instantly KOing both Pokemon.</p> <p><strong>-ate Speed Users: -ate Speed users such as Pixilate Mega Diancie and Refrigerate Kyurem-B are able to outspeed Mega Gengar with STAB Extreme Speed and threaten it with Pursuit as it switches out.</p> <p><strong>Special Walls: Special walls like Wonder Guard Primal Kyogre and Magic Guard Ho-Oh can survive a hit from +2 Mega Gengar, threatening to OHKO it back through its paper-thin defenses. Additionally, self-status-inflicting sets like Toxic Orb Ho-Oh prevent Gengar from putting them to sleep, allowing them to become crippled, well as being freely switching into Dark Void.</p> ",
    "sets": [
      {
        "name": "Mold Breaker",
        "description": "<p>Mold Breaker Mega Gengar is a strong sweeper that effectively does its job with the combination of Shell Smash and powerful Spooky Plate-boosted Judgment. Spooky Plate-boosted Judgment used in tandem with a partial Ghost typing makes Mega Gengar one of the most Imposter-proof Mold Breaker sweepers, as using Judgment without a Plate equipped makes it a Normal-type move. Sludge Wave is a strong STAB move that lets Mega Gengar beat common Fairy-types such as Xerneas and Mega Audino. Secret Sword allows Mega Gengar to attack Normal- and Dark-types, which resist or are immune to Judgment, while also offensively pressuring specially defensive support Pokemon like non-Imposter Chansey, Mega Gyarados, and Yveltal. In the last moveslot, Dark Void or Spore can effectively shut down switch-ins, generating more time to let Mega gengar set up or fire off more high-powered STAB moves. Notably, Mega Gengar benefits from putting Prankster Pokemon that intend to remove its boosts or KO it with a well-timed Destiny Bond to sleep. A Modest nature gives Mega Gengar a slight boost in power over Timid, but unboosted Modest Mega Gengar risks being outsped by rarer threats such as maximum Speed Arceus and Mega Rayquaza.</p> <p>Mega Gengar most effectively functions in combination with a Substitute-passing Wonder Guard pivot, allowing it to freely switch in and set up a Shell Smash. Additionally, Mega Gengar benefits from slow pivots that can build momentum by switching it in against a poorly matched opposing Pokemon. Switch-ins equipped with a Focus Sash have the greatest chance of countering Mega Gengar, so entry hazard setters like Wonder Guard Arceus and Mega Scizor are strongly recommended as teammates. Additionally, because of the lack of recovery, Mega Gengar struggles to survive long games without Wish and Defog support from Wonder Guard users and high-HP support Pokemon like Giratina, Xerneas, and Arceus. Finally, item removal support can give Mega Gengar the upper hand, namely by removing Safety Goggles from foes so Mega Gengar can put them to sleep or immobilizing bulky Pokemon that resist Mega Gengar's moves by Tricking a Choice item onto them.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 506113, "username": "BahamutLagoon"}, {"user_id": 569731, "username": "NToTheN"}]}, {"name": "Grammar checked by", "members": [{"user_id": 241023, "username": "Kris"}]}], "writtenBy": [{"user_id": 226455, "username": "berry"}]}
  },
  "Arceus": {
    "comments": "<h1>Other Options</h1> <p>For support Wonder Guard Arceus, an alternate EV Spread of 248 HP / 148 Def / 96 SpD / 16 Spe and a Bold nature can be used alongside Knock Off to soft check Mold Breaker Mega Gengar. This EV spread allows Arceus to survive +2 Mega Gengar's Sludge Wave after Stealth Rock while also avoiding the KO from +2 Secret Sword. This is noteworthy, as every other Normal-type Wonder Guard user bar Meloetta struggles versus unscouted Mega Gengar. Alternatively, a fully specially defensive EV spread with a Calm nature can be used alongside Knock Off to check other Plate + Judgment Mold Breaker sweepers such as Mega Diancie and Mega Sceptile while still checking Mega Gengar lacking Secret Sword. However, such a set sacrifices Arceus's ability to scout Primal Groudon, Mega Rayquaza, and other physical attackers effectively. 0 Speed EVs and IVs and a Relaxed nature can be used alongside Parting Shot or Baton Pass to provide slow pivoting support to Arceus’s team. However, Arceus is usually outclassed by Slaking in this role, comma since Arceus's naturally high Speed means it is still undersped by most opposing slow pivots such as Xerneas and Primal Kyogre.</p> <p>Like all support Wonder Guard users, Arceus has a panoply of useful utility options available to it. Spikes, Toxic Spikes, and Sticky Web are alternative entry hazard options over Stealth Rock. Glare and Will-O-Wisp can be used to punish incoming Mold Breaker users and Huge Power users, while Dark Void, Spore, and Taunt are all decent options with Arceus's good Speed tier. Whirlwind helps versus some setup sweepers, synergizes well with Stealth Rock and, perhaps more importantly, forces out Substitute + Baton Pass Wonder Guard users like Xerneas. Keep in mind, however, that all of the aforementioned options can be reflected with a timely Magic Bounce switch in and leave Arceus very vulnerable to Taunt. Nuzzle is an alternative to Glare that trades the ability to paralyze Wonder Guard users and Primal Groudon for a better matchup against Magic Bounce users and Taunt users. Similarly, Perish Song is an alternative to Whirlwind that has a slightly worse matchup versus Wonder Guard Subsitute + Baton Pass users, but isn't reflected by the aforementioned Magic Bounce. Magic Coat is another option to reflect entry hazards, sleep moves from Mold Breaker users, and Sing, Gastro Acid, Taunt, and Spider Web from No Guard users. Finally, Steam Eruption can also be used over a utility move to OHKO standard Primal Groudon sets and to 2HKO Mega Diancie, although it hits very few targets otherwise and has very limited PP.</p> <p>Safety Goggles improve Arceus's matchup versus Mold Breaker users that run Spore and can give Arceus a leg up versus Imposter users if Arceus itself opts to use Spore. Any of the seventeen Plates are options to give Arceus an immunity to Trick. Chesto Berry is an extremely niche option that can be used alongside the aforementioned Knock Off to make Arceus a more consistent check to Mold Breaker Mega Gengar. Lastly, Chople Berry is another very fringe option that can allow Arceus to survive a singular Drain Punch from Huge Power Mega Mewtwo X. However, note that all of these options leave Wonder Guard Arceus very vulnerable to Shadow Tag users, so consider running them alongside a pivoting move such as Baton Pass or Parting Shot to give Arceus counterplay versus trapping.</p> <p>For Mold Breaker Arceus, a Timid nature can be run to outpace Modest Mega Gengar, Adamant Mega Mewtwo X, and Mega Rayquaza running a positive Speed nature, letting Arceus heavily damage or KO them with Judgment. On sets that opt for King's Shield, an EV spread of 240 HP / 252 SpA / 16 Spe can be used to maximize bulk while still outspeeding Adamant Primal Groudon before Shell Smash, as outpacing threats such as Choice Band Mega Rayquaza before setup is less of a concern. Alternatively, a spread of 132 HP / 252 SpA / 124 Spe can be used for additional bulk and outpacing Jolly Primal Groudon and other positive nature base 90 Speed Pokemon.</p> <p>Mold Breaker Arceus can opt to use a third coverage move in the last moveslot—such as Secret Sword, Earth Power, or Steam Eruption—but doing so makes Arceus more reliant on its teammates to set up safely and can make Imposter-proofing more difficult. Recover is another option, especially on teams with Pursuit + Huge Power teammates, that capitalizes on Arceus’s good bulk and ability to overwhelm teams once opposing Giratina are removed. Stealth Rock takes advantage of Boomburst's ability to force switches. Items such as Safety Goggles, Leftovers, Lum Berry, and Mental Herb are options—alongside a coverage move over Judgment—that can ease setup on teams with Huge Power + Pursuit users, but they are almost never worth sacrificing the immunity to Trick and the additional power that Spooky Plate or Dread Plate and Judgment provide.</p> <p>It's also worth noting that on teams with three or more Arceus—often refered to as spam teams—fringe Arceus sets such as Prankster, No Guard, Choice Band Huge Power, Huge Power Fake Out + Extreme Speed, Fist Plate Wonder Guard Shell Smash, Spooky Plate Multitype, and Magic Bounce have significantly increased viability.</p> <h1>Checks and Counters</h1> <p><strong>Powerful Fighting Coverage: Powerful Fighting-type attacks from Huge Power and Protean users will force Wonder Guard Arceus out. In particular, Huge Power Mega Mewtwo X can OHKO Arceus with any of its STAB attacks, even OHKOing Chople Berry Arceus with Low Kick or Close Combat.</p> <p><strong>Prankster Giratina</strong>: Like most defensive Wonder Guard users, Prankster Giratina can come in on virtually every variation of Wonder Guard support Arceus and force it out with Encore or chip it with Will-O-Wisp or Curse. And while Prankster Giratina doesn't want to come in on a powerful Ghost- or Dark-type Judgment, its presence, particularly alongside a Normal- or Dark-type teammate, prevents Mold Breaker variants of Arceus from freely using Boomburst or Shell Smash. However, Giratina can be overwhelmed if Mold Breaker Arceus puts it to sleep or uses Taunt as it switches in, which gives it chances to set up with Shell Smash.</p> <p><strong>Trick</strong>: Unless it's holding a Plate, Trick users can hinder Wonder Guard Arceus for the entirety of the match. Since most Arceus sets forgo a pivoting move, it’s even more of a momentum sink with a Choice item than other support Wonder Guard users. In addition, loss of its Shed Shell leaves Arceus especially vulnerable to being removed by Shadow Tag users.</p> <p><strong>Taunt</strong>: Taunt shuts Wonder Guard Arceus down completely unless it chooses to run non-status utility options such as Knock Off, Nuzzle, and Steam Eruption.</p> <p><strong>Choice Item Mold Breaker Users</strong>: Powerful Mold Breaker users like Choice Band Primal Groudon, Choice Band Mega Rayquaza, and Choice Specs Mega Mewtwo Y can all force Arceus out; Primal Groudon's V-create OHKOes after Stealth Rock, Mega Rayquaza can wear Arceus down and waste its Recover PP with repeated usage of Dragon Ascent, and Mega Mewtwo Y's Psycho Boost OHKOes after Stealth Rock.</p> <p><strong>Revenge Killers</strong>: Unless Mold Breaker Arceus is carrying King's Shield, -ate Speed users such as Pixilate Mega Diancie and Aerilate Mega Rayquaza can force it out. In particular, 252 HP EV Mega Diancie can survive a +2 Boomburst and +2 Ghost-type Judgment, and it is even less threatened by Dread Plate variants. On the other hand, Huge Power Mega Gyarados, another very popular revenge killer, needs all five hits of Water Shuriken to connect in order to revenge kill -1 Defense Arceus—though Arceus still needs to be wary of Sucker Punch variants.</p> <p><strong>Faster Powerful Attackers: Powerful attackers that outpace Arceus, such as Mega Mewtwo Y and Mega Mewtwo X, can threaten to OHKO Mold Breaker Arceus and force it out. In addition, Mold Breaker Arceus is also vulnerable to OHKO moves from faster No Guard users like Mega Mewtwo Y and Mega Manectric.</p> <p><strong>Offensive Shadow Tag Users: Fast and powerful Shadow Tag users, such as Mega Mewtwo X and Choice Scarf Primal Groudon, can trap and KO Mold Breaker Arceus, especially if Arceus is chipped or running few defensive EVs.</p> <p><strong>Special Walls</strong>: Mold Breaker Arceus has trouble breaking through specially defensive titans such as Blissey and RegenVest users like Yveltal and Primal Kyogre. While rare and vulnerable to Spore or Dark Void, RegenVest users can annoy Arceus by phazing it with Circle Throw, using Nuzzle, or pivoting out to a revenge killer or Prankster user; Wonder Guard Blissey can disrupt Arceus with Glare or Whirlwind.</p> ",
    "sets": [
      {
        "name": "Wonder Guard Support",
        "description": "<p>A unique combination of excellent bulk, high Speed, and only one weakness makes Arceus a strong choice for a support Wonder Guard user. Like all support Wonder Guard users, Arceus has some flexibility with the utility moves it can run. Stealth Rock gives Arceus a way to make progress in nearly every game, especially since Wonder Guard users inherently force switches against many non-Mold Breaker foes. Gastro Acid is another option that takes advantage of Arceus's good Speed tier to wall slower Mold Breaker foes such as Adamant Primal Groudon and Mega Tyranitar, as well as halving the power of any Huge Power users Arceus finds itself facing. It can also pressure opposing Wonder Guard users, especially those using Baton Pass, as Gastro Acid's ability suppression is passed as well. Defog and Aromatherapy are extremely valuable utility moves on nearly every team composition. However, if either one is already being provided by a teammate, then King's Shield can be used as a scouting tool versus foes like Mega Mewtwo X and to improve Arceus's matchup versus Choice Band Mold Breaker users like Primal Groudon and Mega Rayquaza. In addition, King's Shield makes Wish a more reliable recovery option for Arceus. On sets lacking King's Shield, however, Recover is usually preferred for its immediacy and reliability. Shed Shell is the preferred item so that Arceus can escape being trapped by Shadow Tag users. A physically defensive EV spread effectively scouts physical Mold Breaker users such as Choice Band Primal Groudon and Mega Rayquaza; 16 Speed EVs allow Arceus to outpace Adamant Primal Groudon and neutralize it with Gastro Acid.</p> <p>Many team structures appreciate the utility Arceus can provide. However, since Arceus doesn't provide pivoting support effectively, Wonder Guard users that can do so, such as Substitute + Baton Pass Xerneas, form effective Wonder Guard cores with Arceus. In addition, Arceus itself appreciates Xerneas's Substitutes giving it additional turns to utilize its utility moves or to force out opposing Mold Breaker users with Gastro Acid. In return, Arceus can scout Mold Breaker Mega Gengar and neutralize Mold Breaker Primal Groudon with Gastro Acid, two of Wonder Guard Xerneas's most common switch-ins. Thanks to its singular weakness to Fighting, Wonder Guard Arceus also makes an excellent teammate for Huge Power, Protean, and Parental Bond teammates such as Mega Mewtwo X, Mega Mewtwo Y, and Mega Latios lacking Fighting attacks, as it can serve as a swtich-in to Imposter users. Finally, because of Arceus's own vulnerability to Fighting-type attackers like Huge Power Mega Mewtwo X, teammates that match up well against it, such as Aerilate Mega Rayquaza, Pixilate Mega Diancie, Wonder Guard Xerneas and Mega Gardevoir, and Prankster Will-O-Wisp Giratina, are appreciated.</p> "
      },
      {
        "name": "Mold Breaker + Shell Smash",
        "description": "<p>With its powerful STAB Boomburst, immunity to Trick and Knock Off, straightforward Imposter-proofing, excellent bulk, and good Speed tier, Mold Breaker Arceus is an excellent option for a Shell Smash sweeper. Boomburst's STAB-augmented 140 Base Power allows Arceus to OHKO and 2HKO large swathes of the metagame at +2—the only exceptions being Ghost-types and extremely specially bulky Pokemon, such as Wonder Guard Blissey and the rare Assault Vest Primal Kyogre. Either Spooky Plate or Dread Plate give Judgment near-perfect coverage alongside Boomburst and, due to an Arceus-specific mechanic, also grants Arceus an immunity to Trick and Knock Off. Both also make it easy to Imposter-proof, as a Ghost-type teammate can cover any Imposter user that lacks a Plate item. Spooky Plate gives Arceus better overall coverage, as the only relevant threat that resists both Ghost and Normal is Mega Tyranitar, while Dread Plate eases prediction against teams that have both Prankster Giratina and a Normal- or Dark-type, such as Wonder Guard Slaking or Mega Audino. Arceus's final moveslot is devoted to disruption, aiding it either in setting up a Shell Smash or in continuing a sweep. Dark Void and Spore create setup opportunities by inflicting sleep; Spore has perfect accuracy and makes Imposter-proofing even easier with a Safety Goggles teammate, though it's worse against opposing Safety Goggles users, Mega Abomasnow, and the rare Wonder Guard Ludicolo. Taunt aids Arceus primarily versus Prankster Giratina and Wonder Guard Blissey, which otherwise come in on Arceus without too much difficulty and force it out with Encore and Whirlwind, respectively. Finally, King's Shield can halt -ate Speed users like Mega Rayquaza and Mega Diancie attempting to stop Arceus’s sweep. 216 Speed EVs are used to outpace neutral-natured Mega Rayquaza.</p> <p>Mold Breaker Arceus fits best on balance and offense teams that can give it opportunities to set up. In particular, Substitute + Baton Pass Wonder Guard Xerneas and Mega Gardevoir are excellent teammates, as they both give Arceus free turns with Substitute and threaten Prankster Giratina for it with their powerful Moonblasts. Similarly, No Guard-using teammates, such as Mega Mewtwo Y and Mega Lopunny, generate free turns for Arceus by forcing in Wonder Guard users with their OHKO moves. Huge Power Dark-types, such as Mega Gyarados and Mega Tyranitar, also make strong teammates for Pursuit trapping the metagame's premier Ghost-type, Giratina, allowing Arceus to use Boomburst more freely. Mold Breaker Arceus also appreciates having at least one Ghost-type teammate, such as Giratina, Wonder Guard Mega Sableye, Wonder Guard Dusclops, or Mega Gengar, to efficiently Imposter-proof it. Secret Sword Mega Gengar is a particularly noteworthy partner on offense teams for providing good role compression; it can be a second Mold Breaker sweeper, Imposter-proof both itself and Arceus, and threaten common switch-ins to Arceus like Prankster Giratina and Wonder Guard Blissey. Level 2 Wonder Guard Mega Sableye both provides an extremely slow pivot with Baton Pass and efficiently Imposter-proofs Dark Void variants of Arceus thanks to its Flame Orb—which many methods to Imposter-proof Spore Arceus, like Safety Goggles, can't do.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 226455, "username": "berry"}, {"user_id": 515077, "username": "Mbouchon"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}, {"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 562267, "username": "Daylight"}]}
  },
  "Gardevoir": {
    "comments": "<h1>Other Options</h1> <p>An alternate EV Spread of 80 Def / 252 SpA / 176 Spe with a Timid nature can be used to outspeed Jolly Primal Groudon and other maximum Speed base 90 Pokemon before Mega Gardevoir uses Shell Smash, in addition to giving it the ability to survive Choice Band Adamant Mold Breaker Primal Groudon’s Extreme Speed before Mega Gardevoir uses Shell Smash and non-Choice Band Extreme Speed after a Shell Smash. This spread, however, is generally only worth using in tandem with either Water coverage like Scald or Steam Eruption or on niche Choice Specs Mold Breaker sets with Psycho Boost that can OHKO Primal Groudon without requiring a boost first. Thanks to Mega Gardevoir’s physical frailty, further defensive investment is generally inadvisable.</p> <p>Mega Gardevoir has a wide range of other viable coverage options; Bug Buzz hits Psychic-type Wonder Guard users, Aura Sphere hits Normal-type Wonder Guard users not named Blissey harder than Secret Sword, Scald OHKOes Primal Groudon, and Giga Drain hits Water-type Wonder Guard users while also providing recovery. Gastro Acid is also an option over a coverage move to allow Mega Gardevoir to break through Wonder Guard users of any type at the somewhat steep cost of an additional turn to do so. In addition, while Stealth Rock is hard to fit, Mega Gardevoir’s ability to threaten out the format’s most popular Magic Bouncers—Giratina and Yveltal—make it a reliable entry hazard setter.</p> <p>Mega Gardevoir is also a very competent user of Substitute + Baton Pass Wonder Guard sets, but faces fierce competition from the much bulkier Xerneas for this role. However, it is worth noting that Mega Gardevoir specifically utilizes Glare and Shell Smash variants of these sets just as efficiently, if not better, than Xerneas can in many scenarios. Mold Breaker sets with either Choice Specs or Shell Smash are also a niche option. However, the former faces steep competition with Choice Specs Mega Mewtwo Y and even the rare Choice Specs Mega Diancie and the latter is only useful over similar Mega Diancie sets if STAB Stored Power or Psystrike is greatly desired.</p> <h1>Checks and Counters</h1> <p><strong>Strong Physical Attackers: Mega Gardevoir’s physical frailty means it cannot switch into or stomach any reasonably strong physical hits bar Fighting type attacks. A Choice Band or Huge Power boosted hit that makes it through Mega Gardevoir’s Wonder Guard will almost always KO. In addition, super effective priority moves such as Shadow Sneak and Bullet Punch—most frequently seen on Shadow Tag and Huge Power Regigigas and Slaking sets—bypass Gardevoir’s Wonder Guard and KO it outright.</p> <p><strong>Mega Gengar: Mold Breaker Mega Gengar puts a lot of pressure on Mega Gardevoir, outspeeding and OHKOing it with Spooky Plate Judgment or Sludge Wave. However, Mega Gengar cannot switch into Mega Gardevoir effectively, especially if Gardevoir is carrying Spooky Plate or is already boosted.</p> <p><strong>Opposing Wonder Guard</strong>: Because Wonder Guard sweepers are inherently matchup dependent, Wonder Guard users that Mega Gardevoir is not packing the correct coverage move for will force it out.</p> <p><strong>Item Removal</strong>: Trick, Switcheroo, and Mold Breaker Knock Off can severely impede Mega Gardevoir’s ability to do its job, removing one third of its coverage as well as its ability to beat Imposter users.</p> <p><strong>Plate Imposter Users</strong>: While rare and very suboptimal outside of a matchup into offensive Wonder Guard Mega Gardevoir or Xerneas (or Mold Breaker Mega Gengar, in the case of Spooky Plate), Imposter Pokemon holding an Iron Plate or Spooky Plate directly counter this set and can be difficult to deal with.</p> ",
    "sets": [
      {
        "name": "Wonder Guard Shell Smash",
        "description": "<p>Mega Gardevoir’s excellent Psychic / Fairy typing and high base 165 Special Attack make it one of the best options for a Wonder Guard Shell Smash sweeper. Judgment and either Iron Plate or Spooky Plate allow this set to beat Imposter users, as well as Fairy-type or Psychic-type Wonder Guard users, respectively. Thanks to the evergreen popularity of Wonder Guard Xerneas, Iron Plate is usually preferred, but Spooky Plate does have additional utility outside of hitting Psychic-type Wonder Guard users—notably +2 Spooky Plate Judgment OHKOes Mega Mewtwo X, Mega Mewtwo Y, and Mega Latios, as well as standard Primal Groudon after Stealth Rock. The remaining moveslots are dedicated to coverage for breaking as many Wonder Guard cores and Mold Breaker switch-ins as possible and are, as a result, quite flexible and very team-dependent. Grass Knot and Freeze-Dry are powerful coverage options that, most notably, allow this set to beat the ever popular Wonder Guard Primal Kyogre. On Iron Plate sets, Grass Knot is usually preferred for the OHKO on Primal Groudon after Stealth Rock at +2. Freeze-Dry nails a broader range of threats, however, including OHKOing Wonder Guard Gyaradosite Gyarados and Mega Rayquaza. Moonblast is a powerful STAB move that is often Mega Gardevoir’s best option against non-Wonder Guard switch-ins and also OHKOes the somewhat common Wonder Guard Mega Sableye. It also OHKOes standard Giratina sets even at just +1. Secret Sword and Lava Plume smack Normal and Bug / Steel type Wonder Guards, respectively, while Earth Power is notable for hitting both Electric Wonder Guard users and netting a guaranteed KO against Primal Groudon at +2. Mix and match these (or other) coverage options according to your team’s needs and current metagame trends. A Modest nature is preferred to secure several key KOs such as Mega Mewtwo X and Mega Rayquaza, but a Timid nature is an option if outpacing Timid Xerneas is desired.</p> <p>Wonder Guard Shell Smash Mega Gardevoir fits well on both balance and offensive teams as a powerful wincon. Physical Mold Breakers, though valuable on nearly every team structure in ORAS Pure Hackmons, are especially important teammates for Mega Gardevoir, breaking through the Wonder Guard users Mega Gardevoir’s chosen coverage moves may not pierce. Choice Band Primal Groudon is especially noteworthy for its excellent offensive synergy with Mega Gardevoir, as well as its ability to obliterate opposing Wonder Guard users with its STAB V-create. Fast and powerful Mold Breaker users such as Mega Mewtwo Y and especially Mega Gengar can make it very difficult for Gardevoir to get a Shell Smash up, so teammates such as Yveltal, Mega Gyarados, Wonder Guard Meloetta, Arceus carrying Knock Off, and various -ate Speed users like Mega Rayquaza and Mega Abomasnow are appreciated. Many of these Pokemon are also good entry hazard setters, and Mega Gardevoir appreciates Stealth Rock support to turn many of its already favorable rolls, such as +2 Spooky Plate Judgment or Grass Knot into 240 HP Primal Groudon, into guaranteed KOs. Aromatherapy support from support Wonder Guard partners with complementary typing such as Primal Kyogre, Meloetta, Slaking, and Mega Scizor, among others, is also appreciated to prevent Toxic or Will-O-Wisp from putting a timer on Mega Gardevoir’s sweep. Defog and Wish support from these teammates can also offset any chip Mega Gardevoir might take throughout a game, making its job as a late-game cleaner and wincon more flexible.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 515077, "username": "Mbouchon"}, {"user_id": 226455, "username": "berry"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 562267, "username": "Daylight"}]}
  },
  "Beedrill": {"sets": [{"name": "Support WG"}]},
  "Chansey": {"sets": [{"name": "Imposter"}]},
  "Gyarados": {"sets": [{"name": "Pursuit Trapper"}, {"name": "Gyaradosite Sweeper"}]},
  "Mewtwo": {"sets": [{"name": "Huge Power (Mewtwo-Mega-X)"}, {"name": "Shadow Tag (Mewtwo-Mega-X)"}, {"name": "Shell Smash Sweeper (Mewtwo-Mega-X)"}, {"name": "Protean (Mewtwo-Mega-Y)"}, {"name": "Huge Power (Mewtwo-Mega-Y)"}, {"name": "Choice Specs (Mewtwo-Mega-Y)"}, {"name": "Scarf No Guard (Mewtwo-Mega-Y)"}, {"name": "Sash No Guard (Mewtwo-Mega-Y)"}, {"name": "Offensive WG (Mewtwo-Mega-Y)"}, {"name": "SubPass WG (Mewtwo-Mega-Y)"}, {"name": "Support WG (Mewtwo-Mega-Y)"}, {"name": "Shadow Tag (Mewtwo-Mega-Y)"}]},
  "Scizor": {"sets": [{"name": "Support WG"}]},
  "Blissey": {"sets": [{"name": "Support WG"}]},
  "Tyranitar": {"sets": [{"name": "Shell Smash Sweeper"}, {"name": "Pursuit Trapper"}]},
  "Swampert": {"sets": [{"name": "SubPass WG"}, {"name": "Support WG"}]},
  "Slaking": {"sets": [{"name": "Support WG"}, {"name": "Huge Power Revenge Killer"}, {"name": "Shadow Tag Revenge Killer"}]},
  "Sableye": {"sets": [{"name": "FEAR WG"}, {"name": "Support WG"}]},
  "Manectric": {"sets": [{"name": "SubPass WG"}]},
  "Latios": {"sets": [{"name": "Protean"}, {"name": "Mold Breaker Sweeper"}, {"name": "Shadow Tag"}]},
  "Kyogre": {"sets": [{"name": "Support WG", "description": "<p>A physically defensive spread, with a Bold or Relaxed nature, may also be run to check Primal Groudon slightly harder.</p> "}]},
  "Groudon": {
    "comments": "<h1>Other Options</h1> <p>Primal Groudon can use Glare, Nuzzle, or Thunder Wave as disruption, as once opposing Giratina is fully paralyzed, Primal Groudon usually grabs a KO; however, running paralysis makes properly Imposter-proofing more difficult. Sheer Cold is another option; while it is inherently luck-dependent, over the course of a game it has a good chance of eliminating opposing Giratina, making Primal Groudon much more threatening for the rest of the game. Precipice Blades and Diamond Storm are fringe options that can be run on the last two moveslots. Having a stronger Ground-type STAB move allows Primal Groudon to OHKO Mega Tyranitar and Primal Groudon after Stealth Rock, and Primal Kyogre, Xerneas, and offensive Arceus after Shell Smash; Diamond Storm, on top of potentially increasing Primal Groudon's physical bulk, is then necessary to hit Flying-types like Mega Rayquaza, Ho-Oh, and Yveltal, all of which it can OHKO after Shell Smash. However, the additional utility gained from having 3 support moves makes running these moves not worth it most of the time. Sacred Fire is an option over King's Shield or V-create, spreading burns against offensive switch-ins as well as OHKOing Substitute + Baton Pass Wonder Guard Xerneas after a Shell Smash, but does not synergize well with Spore or Dark Void and only slightly helps against opposing Giratina. Running Knock Off allows Primal Groudon to threaten Giratina not running Griseous Orb harder when boosted, and synergizes well with Spore by removing Safety Goggles; however, this leaves Primal Groudon exceptionally difficult to Imposter-proof. Primal Groudon can opt to invest more in Speed at the cost of bulk; 56 Speed EVs allow Primal Groudon to outspeed Choice Scarf Shadow Tag Primal Groudon after a Shell Smash, 148 Speed EVs allow it to outspeed Deoxys-S after a boost, and maximum Speed investment (with an Adamant nature) allows Primal Groudon to outspeed opposing Mega Mewtwo Y, Mega Mewtwo X, and Mega Gengar after a Shell Smash and V-create.</p> <h1>Checks and Counters</h1> <p><strong>Prankster Giratina: Prankster Giratina can check Primal Groudon well in tandem with a revenge killer that threatens Primal Groudon, especially when running Safety Goggles. It can then severely diminish Primal Groudon's offensive presence with Glare, force it out with Encore, or predict a switch and chip opposing switch-ins with Curse. However, Primal Groudon running Dark Void can power through Giratina, so running Prankster Giratina as the only check isn't recommended.</p> <p><strong>Imposter users</strong>: Due to its general reliance on Thousand Arrows, Primal Groudon is notoriously difficult to Imposter-proof. Without an exceptionally powerful revenge killer such as Huge Power Mega Gyarados or a healthy Prankster Giratina, opposing Imposter users can make progress and potentially countersweep; however, teams running Dark Void Primal Groudon are susceptible to Imposter countersweeps, even with a healthy Giratina. Choice Scarf Imposter users are slightly more manageable, as they are stuck using Thousand Arrows or V-Create, but are still very threatening nonetheless.</p> <p><strong>Huge Power Mega Gyarados: Mega Gyarados is bulky enough to come in on unboosted Primal Groudon, and can force 50-50s with Water Shuriken and a Huge Power-boosted Pursuit; however, this mindgame is somewhat eased if Primal Groudon runs King's Shield, and Mega Gyarados is incentivized into using Water Shuriken, as Primal Groudon staying in on Pursuit would prove disastrous.</p> <p><strong>Other Revenge Killers</strong>: Other Revenge Killers can also threaten Primal Groudon, though they struggle to do so to the same extent that Mega Gyarados is able to. Although they dislike switching into Primal Groudon multiple times, Refrigerate Mega Abomasnow and Kyurem-B, Aerilate or Gale Wings Mega Rayquaza, and Huge Power Slaking or Regigigas running Water Shuriken can force unboosted Primal Groudon out. However, all but Mega Abomasnow and special Gale Wings Mega Rayquaza, and Slaking or Regigigas with Water Shuriken and a boosting item, will fail to reliably force out boosted Primal Groudon with King's Shield. Some Choice Scarf No Guard users, like Mega Mewtwo Y, Mega Aerodactyl and Deoxys-S, outspeed any Primal Groudon even after a Shell Smash, so they can reliably force Primal Groudon out after either coming in on a prediction, with pivoting support, or after a teammate has fainted. Additionally, Choice Scarf Shadow Tag users, like Mega Rayquaza and Mega Mewtwo Y, can outspeed slower Primal Groudon sets even after a boost and OHKO with a special Water-type move.</p> <p><strong>Faster Hard Hitters: In a 1v1 scenario, faster Pokemon that are sufficiently strong, such as Huge Power Mega Mewtwo X, Protean Mega Latios, or Choice Specs Mega Mewtwo Y or Mega Rayquaza, can force Primal Groudon out. Additionally, offensive Shadow Tag users running moves that can threaten unboosted Primal Groudon, such as Mega Latios running Earth Power or Surf, Mega Mewtwo Y running Surf, or Choice Scarf Mega Rayquaza or Choice Band Mega Aerodactyl with Crabhammer, will usually trap and eliminate it if it is unboosted. However, none these Pokemon, bar Choice Scarf Mega Mewtwo Y and Mega Rayquaza, can take on a boosted Primal Groudon, and cannot reliably switch in on unboosted Primal Groudon.</p> <p><strong>Water Coverage: Pokemon that Primal Groudon often switches in on, like Xerneas, Wonder Guard Mega Mewtwo Y, and Mega Manectric, can run Water-type moves to catch it off guard and OHKO it.</p> <p><strong>Grass-type Defensive Pokemon: While very rare, Primordial Sea Grass-types like Leavanny, Tangrowth, and Chesnaught can come in on standard Primal Groudon and wall it easily. However, some Grass-types, like Leavanny, are susceptible to being Pursuit trapped by Mega Gyarados.</p> ",
    "sets": [
      {
        "name": "Physical Shell Smash Sweeper",
        "description": "<p>With its amazing physical bulk, incredible offensive typing, ridiculous Attack stat, nifty immunity to the otherwise problematic Will-O-Wisp, and great synergy with other metagame titans, Primal Groudon is the single most threatening offensive Pokemon in the metagame. Every team must prepare for Primal Groudon heavily in the teambuilder, and most teams use one defensive check and one offensive check. Spore or Dark Void allows Primal Groudon to set up against its most common switch-in, Giratina; Spore has 100% accuracy and allows for Imposter-proofing with Safety Goggles Prankster Giratina, while Dark Void affects opposing Safety Goggles users. Stealth Rock is another option, as Primal Groudon forces numerous switches and can use the free turn to set entry hazards. Taunt lets Primal Groudon consistently beat Giratina, which almost always runs four status moves, but is far less useful against its other checks like Primal Kyogre. Shell Smash allows Primal Groudon to boost both its Attack and Speed in a single turn, synergizing well with disruption in Spore, Dark Void, or Taunt. Thousand Arrows is virtually unresisted in the metagame, meaning Primal Groudon can often run a single attack and have tremendous flexibility with its moveset. King's Shield creates mind games with opposing revenge killers, often rendering them null as a threat; V-create is another good choice that allows Primal Groudon to immediately threaten bulky unresisted foes, such as Wonder Guard Slaking, Mega Audino, and Cresselia, much more effectively, forcing them out more often. Primal Groudon has several options for its item; Leftovers synergizes particularly well with King's Shield and increases Primal Groudon's longevity, Lum Berry potentially gifts Primal Groudon a free turn to set up, and Mental Herb allows Primal Groudon to set up against Prankster Giratina lacking Glare or Spore much more easily, nearly always forcing a sack. Mold Breaker allows Primal Groudon to ignore Wonder Guard, allowing it to take full advantage of Thousand Arrows's amazing neutral coverage. The given spread maximizes physical bulk while allowing Primal Groudon to outspeed Pokemon with 150 base Speed, such as Deoxys-Attack and Mega Aerodactyl, after a Shell Smash; an Adamant nature further increases Primal Groudon's offensive prowess, allowing it to 2HKO Giratina after Shell Smash.</p> <p>Primal Groudon fits on nearly every team structure, as its combination of base stats, great STAB moves, and ability to threaten other top metagame threats' checks make it too good to forgo. Prankster Giratina is Primal Groudon's best partner, as it can Imposter-proof Primal Groudon and use Will-O-Wisp or Glare to grant Primal Groudon more opportunities to set up. Giratina also has the option of running Destiny Bond, which is especially useful against Huge Power Mega Gyarados, a common switch-in to Primal Groudon. Despite its impressive bulk, Primal Groudon appreciates being brought in safely by Substitute + Baton Pass users like Wonder Guard Xerneas and Magic Bounce Giratina. Specially offensive Mold Breaker users like Mega Diancie, Choice Specs Mega Rayquaza, and Dialga are great partners to threaten Giratina. In particular, Dialga is an excellent partner, as it can check Gale Wings users and Mega Gyarados lacking Sucker Punch, two common revenge killers to Primal Groudon. Offensive Wonder Guard users, like Xerneas, Mega Gardevoir, and Mega Lucario, are also quite good at forcing out most revenge killers that otherwise take full advantage of unboosted Primal Groudon. As Giratina is Primal Groudon's greatest obstacle, Huge Power Mega Gyarados is a great partner; it can also potentially force out a chipped Imposter user. Physically defensive Wonder Guard Primal Kyogre, as well as Wonder Guard Mega Swampert, are good partners as well due to their ability to check unboosted Imposter users; the latter can also run a Substitute + Baton Pass set to allow offensive teammates to set up more easily. Lastly, Shadow Tag Mega Mewtwo X is a good partner, as with bulk investment it can survive Lum Berry Huge Power Mega Gyarados's Sucker Punch and OHKO back with a Fighting-type attack.</p> "
      },
      {"name": "Choice Band Mold Breaker"},
      {"name": "Choiced Shadow Tag"},
      {"name": "Shell Smash Sweeper WG"},
      {"name": "Choice Scarf Mold Breaker"},
      {"name": "Support WG"},
      {"name": "Baton Pass WG"},
      {"name": "Choice Band Revenge Killer"},
      {"name": "Huge Power Coverage"},
      {"name": "Special Shell Smash Sweeper"}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 569731, "username": "NToTheN"}, {"user_id": 235009, "username": "Ransei"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 515077, "username": "Mbouchon"}]}
  },
  "Rayquaza": {
    "comments": "<h1>Other Options</h1> <p>Dragon Claw threatens Prankster Giratina more effectively than Dragon Ascent; however, it is hard to fit and usually not worth it over a coverage option. Additionally, Gear Grind has better rolls than Dragon Ascent to OHKO the common Xerneas, but it mostly isn't worth it because Dragon Ascent usually OHKOes Xerneas anyway. V-Create is a powerful alternative to Sacred Fire, KOing Mega Steelix after minor chip damage and making Mega Rayquaza slightly easier to imposter-proof; however, its drawbacks mean Mega Rayquaza is usually forced out after using the move once, and it doesn't spread status like Sacred Fire does. A Jolly nature can be used to outspeed opposing neutral nature Mega Rayquaza, Modest Arceus, and Timid Mega Diancie and Mega Latios, though the extra pressure Adamant brings against Prankster Giratina is usually better. Mega Rayquaza can also use entry hazards like Spikes and Stealth Rock, as it often forces many switches. Waterfall and Steam Eruption are more accurate alternatives to Crabhammer, but they do not KO Mega Tyranitar after rocks like Crabhammer does. Close Combat can be used to hit Normal-types like Arceus and Slaking, but is outclassed by Sacred Fire in most cases. Thousand Arrows is another decent option, which hits the Electric-types that resist Mega Rayquaza's Dragon Ascent, but is also usually outclassed by Sacred Fire.</p> <h1>Checks and Counters</h1> <p><strong>Prankster Giratina: Prankster Giratina is one of the few Pokemon that can switch in on Choice Band Mega Rayquaza and live to tell the tale. While Choice Band-boosted Dragon Ascent 2HKOes it, it can heal and PP stall with its priority recovery. Additionally, priority status moves like Glare can hinder Mega Rayquaza's ability to consistently threaten foes later in the game. Additionally, some Prankster Giratina sets elect to run Destiny Bond, which can make a Mega Rayquaza sweep short.</p> <p><strong>Shadow Tag</strong>: Offensive Shadow Tag users, like Mega Mewtwo X and Mega Mewtwo Y, can consistently trap and KO Mega Rayquaza with their powerful attacks. Additionally, Perish Song trappers such as Lugia and Arceus commonly run King's Shield, which can remove Rayquaza's strongest asset in its high attack, as well as removing it with Perish Song.</p> <p><strong>Priority Users: Common priority users like Refrigerate Kyurem-B and Mega Abomasnow, Pixilate Mega Diancie, Aerilate Mega Rayquaza, Extreme Speed Regigigas, and Huge Power + Sucker Punch Dark-types can reliably KO Mega Rayquaza after Dragon Ascent's defense drops. These threats can effectively force a coinflip scenarios, KOing Rayquaza with priority if it stays in and getting good dama with Pursuit if it decides to switch out.</p> <p><strong>Stealth Rock: Stealth Rock heavily punishes Mega Rayquaza due to its pivot-heavy playstyle, chipping it every time it switches in. However, Stealth Rock is rather difficult to consistently keep on the field, as a teammate with Defog can remove Stealth Rock then potentially bring Mega Rayquaza in with a pivot move.</p> <p><strong>King's Shield Users</strong>: Activating King's Shield with a contact move potentially nullifies Mega Rayquaza's ability to break walls and secure KOs. However, King's Shield users must be healthy, as well as sufficiently bulky enough, to switch into Mega Rayquaza and hamper its offensive prowess.</p> <p><strong>Imposter</strong>: Defense drops from Dragon Ascent mean that Imposter users can effectively force out Mega Rayquaza, even if they don't hold a Choice Band.</p> ",
    "sets": [
      {
        "name": "Choice Band + Mold Breaker",
        "description": "<h1>Moves</h1> <p>Mega Rayquaza uses its sky-high Attack stat primarily to obliterate foes with its STAB Dragon Ascent, which deals huge damage to everything that doesn't resist it. Sacred Fire is used to hit Steel-type Pokemon, such as Wonder Guard Mega Scizor, Registeel, and Mega Steelix; it also finds great utility in its 50% burn chance, which constantly chips at bulky switch-ins like Prankster Giratina while weakening opposing Imposter users. Precipice Blades is another good option, OHKOing Mold Breaker Mega Tyranitar from full health and Primal Groudon after Stealth Rock. Crabhammer can be used to OHKO Primal Groudon and KO Mega Tyranitar after Stealth Rock, while Trick invalidates would-be checks like King's Shield users and Giratina by forcing them to stick to one status move. Extreme Speed is a great option for picking off weakened foes, especially with Mega Rayquaza's high Attack stat and Choice Band. U-turn takes advantage of Mega Rayquaza demanding switch-ins, as it allows you to conserve momentum. Mega Rayquaza's Mold Breaker allows it threaten opposing Wonder Guard users, letting it keep momentum even more effectively.</p> <p>Rayquaza's most common check is Prankster Giratina, so naturally anything that can beat it pairs well with Mega Rayquaza. Mega Gyarados is an amazing option, as it can force coinflip scenarios against Giratina with its Huge Power-boosted Pursuit and Knock Off. Special Mold Breaker users like Mega Gengar and Mega Diancie can continuously pressure Giratina. Mega Gengar in particular is amazing for its Speed, which lets it take care of fast threats that Mega Rayquaza can't; notably it Speed ties with Mega Mewtwo X and outspeeds opposing Mega Rayquaza, Timid Mega Latios, and Timid Mega Diancie. Slow pivots like Mega Audino, Mega Scizor, and Cresselia, allow Mega Rayquza to get into the field safely, capitalizing on its potential to pressure many Pokemon with its devastating attacks once in. Mega Rayquaza also appreciates the help from Aromatherapy and Defog users like Primal Kyogre and Mega Audino to remove status and Stealth Rock. This set can also be paired with a Choice Specs Mold Breaker Mega Rayquaza as not only do they defeat each other's checks, but the opponent lack reliable counterplay due to not knowing which set is in. Mega Rayquaza pairs well with -ate Speed Pokemon because it takes advantage of their ability to force opposing Wonder Guards users in.</p> "
      },
      {"name": "Choice Specs Mold Breaker"},
      {"name": "Aerilate Revenge Killer"},
      {"name": "Choiced Shadow Tag"},
      {"name": "Gale Wings Revenge Killer"}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 226455, "username": "berry"}, {"user_id": 515077, "username": "Mbouchon"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 569731, "username": "NToTheN"}]}
  },
  "Deoxys-Attack": {"sets": [{"name": "Huge Power"}, {"name": "Choice Specs Mold Breaker"}]},
  "Deoxys-Speed": {"sets": [{"name": "Scarf No Guard"}, {"name": "Sash No Guard"}]},
  "Lopunny": {"sets": [{"name": "Scarf No Guard"}, {"name": "Sash No Guard"}]},
  "Skuntank": {"sets": [{"name": "Support WG"}]},
  "Lucario": {
    "comments": "<h1>Other Options</h1> <p>An alternate EV spread of 68 Atk / 252 SpA / 188 Spe alongside Bolt Strike is an option to OHKO physically defensive Primal Kyogre at +2 while still outpacing Jolly Primal Groudon. Similarly, a spread of 176 Atk / 252 SpA / 80 Spe with a Rash nature is an option alongside either Bolt Strike or Power Whip to OHKO Primal Kyogre while outpacing maximum speed Adamant Primal Groudon. A Timid or Naive nature is another option to outpace the somewhat rare Timid Mega Latios and Timid Mega Diancie.</p> <p>Flame Plate is an option over Fist Plate to hit Bug- and Steel-type Wonder Guard users. However, using Flame Plate means that Mega Lucario sacrifices the ability to hit Normal-type Wonder Guard users and OHKO Primal Groudon at +2 unless it also sacrifices its ability to beat Imposter users. Earth Plate is also an option over Fist Plate that trades hitting Normal-type Wonder Guard users for Electric-type Wonder Guard users while retaining the ability to KO Primal Groudon at +2. However, this version of the set faces fierce competition from Dialga, which has superior bulk, higher Special Attack, and lacks a Fire weakness.</p> <p>Mega Lucario also has a handful of other coverage options it can utilize. Bug Buzz does better against Cresselia than Knock Off, allowing Lucario to avoid mind games against King's Shield variants. Play Rough and Moonblast are both alternatives to hit Wonder Guard Mega Sableye; however, the former is an alternative to Knock Off that also OHKOes Mega Latios, while the latter offers similar coverage and hits harder overall. Scald can be used to OHKO Primal Groudon. Gastro Acid is an option to allow Mega Lucario to break through Wonder Guard users of any type at the somewhat steep cost of an additional turn to do so.</p> <h1>Checks and Counters</h1> <p><strong>Fissure: Like all Ground-weak Wonder Guard users, Mega Lucario is vulnerable to the somewhat uncommon but still very dangerous Fissure.</p> <p><strong>Strong Attackers</strong>: Mega Lucario is very frail both specially and physically. If a powerful unresisted attack pierces its Wonder Guard, Mega Lucario will almost certainly be KOed. In addition, all three of Mega Lucario’s weaknesses are to very common attacking types, which means that most teams have multiple attackers that can bypass Mega Lucario's Wonder Guard. In particular, Mega Lucario is weak to both of Primal Groudon's STAB attacks. Faster Mold Breaker attackers, such as Mega Mewtwo Y and Mega Gengar, as well as those that can tank a hit, such as Protean Mega Latios, are all highly threatening to Mega Lucario.</p> <p><strong>Opposing Wonder Guard: Because Wonder Guard sweepers are inherently matchup dependent, Wonder Guard users that Mega Lucario is not packing the correct coverage moves for will force it out.</p> <p><strong>Item Removal</strong>: Trick, Switcheroo, and Mold Breaker Knock Off can severely impede Mega Lucario's ability to do its job, removing one-third of its coverage as well as its ability to beat Imposter users.</p> <p><strong>Offensive Shadow Tag Users</strong>: Offensive Shadow Tag users such as Primal Groudon or Mega Mewtwo X can pivot in on unboosted Mega Lucario and OHKO it. Very few offensive Shadow Tag users do not carry an attacking move that can KO Mega Lucario.</p> <p><strong>Prankster Giratina</strong>: Unless Mega Lucario is already boosted and just used a move that Giratina does not resist while it switches in, Prankster Giratina can come in freely on Mega Lucario and annoy it with Will-O-Wisp or Glare.</p> ",
    "sets": [
      {
        "name": "Wonder Guard Shell Smash",
        "description": "<p>Mega Lucario's decent typing for an offensive Wonder Guard user, quadruple resistance to Stealth Rock, strong attacking stats, and good base 112 Speed make it a powerful option for a Wonder Guard Shell Smash sweeper. The combination of Judgment and Fist Plate is a huge boon to Mega Lucario, allowing it to defeat Imposter users, Normal-type Wonder Guard users, and allowing it OHKO Primal Groudon after one Shell Smash. Flash Cannon and Gear Grind are both powerful STAB moves that hit Fairy-type Wonder Guard users. Flash Cannon's superior accuracy makes it the more consistent option and is slightly stronger against standard Wonder Guard Mega Audino. Gear Grind, on the other hand, is noticeably better against Wonder Guard Xerneas and Mega Gardevoir, breaking the former's Substitutes and outright OHKOing the latter without a boost. The final moveslot is flexible, as it is both metagame- and team-dependent, but notable options include: Freeze-Dry, Grass Knot, and Knock Off. Freeze-Dry and Grass Knot both do well against Water-type Wonder Guard users like Primal Kyogre. The former's greater coverage usually make it the preferred option, but Grass Knot's increased Base Power versus certain targets such as Whirlwind Primal Kyogre is valuable as well. Knock Off is a useful option, as it OHKOes Mega Latios at +2. Without Knock Off, Mega Latios can take any other hit from Lucario—even at +2—and OHKO back. Knock Off also gives Mega Lucario a way of damaging Psychic- and Ghost-type Wonder Guard users and has the additional utility of removing items, making switch-ins without Wonder Guard less safe. A Rash nature is preferred if physical attacks are used; otherwise, a Modest nature is preferred.</p> <p>Mega Lucario fits best on balance and offense teams in need of a wincon and late-game cleaner. However, Mega Lucario differs from similar Wonder Guard Shell Smash sweepers like Mega Gardevoir and Xerneas, most notably because of its Fissure weakness, meaning that it appreciates teammates that can scout potential opposing No Guard users, such as Imposter users and slow pivots with Wonder Guard that don't share weaknesses with Mega Lucario, such as Cresselia, Slaking, and Primal Kyogre. In addition, a Flying-type teammate, such as Mega Rayquaza, can also help alleviate Mega Lucario’s Fissure weakness, as Sheer Cold + Fissure No Guard users are uncommon. Mega Lucario is also limited in its ability to beat certain Wonder Guard users, namely those weak to Fire- and Ground-type moves, without compromising its ability to beat Imposter users. As a result, Mega Lucario benefits from Choice Band Mold Breaker teammates that can break opposing Wonder Guard cores such as Primal Groudon and Mega Rayquaza. Offensive Shadow Tag teammates—Primal Groudon in particular—are also worth a mention, as they can trap and KO the Wonder Guard users Mega Lucario can't touch. Substitute + Baton Pass Wonder Guard users are also useful teammates, as they can give Mega Lucario additional opportunities to use Shell Smash and provide it some breathing room versus opposing Shadow Tag Primal Groudon, which would otherwise trap and KO Lucario. Finally, Mega Lucario also appreciates Aromatherapy, Defog, and Wish support from teammates such as the aforementioned slow pivoting Wonder Guard users to make its job as a wincon and late-game cleaner easier.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 226455, "username": "berry"}, {"user_id": 515077, "username": "Mbouchon"}]}, {"name": "Grammar checked by", "members": [{"user_id": 241023, "username": "Kris"}]}], "writtenBy": [{"user_id": 562267, "username": "Daylight"}]}
  },
  "Abomasnow": {"sets": [{"name": "Refrigerate Revenge Killer"}]},
  "Dialga": {"sets": [{"name": "Shell Smash Sweeper"}]},
  "Regigigas": {"sets": [{"name": "Huge Power Revenge-Killer"}, {"name": "Shadow Tag Revenge Killer"}]},
  "Giratina": {"sets": [{"name": "Prankster"}, {"name": "Magic Bounce"}]},
  "Cresselia": {
    "comments": "<h1>Other Options</h1> <p>116 Speed EVs can be used outpace and escape Huge Power Yveltal's Pursuit, though doing so comes at the cost of Cresselia's survivability versus Mold Breaker users, as well as the ability to underspeed minimum Speed Wonder Guard Arceus. A specially defensive set, though hard to justify when Cresselia is so effective at scouting physically offensive Mold Breakers, is also an option to improve Cresselia's matchup against Choice Specs Mold Breaker users and to let it survive a single Bug Buzz from Protean Latios. Colbur Berry is another option to improve Cresselia's matchup against Pursuit trappers, allowing it to risk the 50 / 50 a single time versus Mega Gyarados; however, forgoing Shed Shell comes at the cost of increased vulnerability to Shadow Tag users like Perish Song Lugia. Safety Goggles is another option that can allow Cresselia to soft check some Spore Mold Breaker Shell Smash sweepers alongside either Whirlwind or Glare—although it similarly leaves Cresselia vulnerable to Shadow Tag users. Mail is a final option to make Cresselia immune to Trick.</p> <p>Though a little difficult to fit, Glare is an option to punish Mold Breaker users like Mega Gengar that Cresselia lures in. Similarly, Will-O-Wisp is an option to cripple incoming Huge Power users, continuously chip special attackers lacking recovery, and to limit the number of times Substitute + Baton Pass users like Xerneas and Mega Mewtwo Y can use Substitute. Substitute can be used alongside Baton Pass, but this role is typically filled better by less passive Wonder Guard users, such as Xerneas. Perish Song is an alternative to Whirlwind to put any opponent, but especially Whirlwind-immune Substitute + Baton Pass Magic Bounce users, on a timer. Magic Coat is an option to reflect sleep moves from Mold Breaker users like Primal Groudon looking to use Cresselia as a setup opportunity, as well as Parting Shot and Stealth Rock from -ate Speed users like Mega Abomasnow and Sing, Gastro Acid, Taunt, and Spider Web from No Guard users. Finally, a set with both King's Shield and Baton Pass is viable, but it severely limits the utility Cresselia can offer its team.</p> <h1>Checks and Counters</h1> <p><strong>Huge Power Pursuit: Despite measures to mitigate Cresselia's weakness to Pursuit, it is still very vulnerable to Huge Power Pursuit users like Mega Gyarados and Yveltal. Even if running additional speed EVs to outpace Yveltal, Cresselia still has to be wary of being trapped while paralyzed or afflicted with a Speed drop from Sticky Web, especially since Cresselia is often the team's cleric and entry hazard remover. Sets lacking Baton Pass have to be played even more carefully in a matchup versus Huge Power Pursuit.</p> <p><strong>Knock Off</strong>: Thanks to its Dark-type weakness, Cresselia is vulnerable to having its Shed Shell removed by Knock Off, leaving it vulnerable to Shadow Tag users, or just being outright KOed by Dark-type Huge Power users.</p> <p><strong>Trick</strong>: Unless it's holding Mail, Trick users can hinder Cresselia for the entirety of the match, forcing it to either use Baton Pass or relinquish momentum.</p> <p><strong>Powerful Mold Breaker Users</strong>: Shell Smash Mold Breakers like Mega Gengar, Mega Tyranitar, Mega Diancie, and Arceus can swap in on nearly every Cresselia set risk free use it as setup fodder. In addition, if Cresselia forgoes King's Shield, it's also forced out without much difficulty by Choice Band Primal Groudon.</p> <p><strong>Prankster Giratina: Like is the case with most defensive Wonder Guard users, Prankster Giratina can come in on virtually every Cresselia set and force it out with Encore, chip it with Will-O-Wisp, or leave it vulnerable to Pursuit trapping with Glare.</p> <p><strong>Unfavorable Matchup</strong>: Despite its impressive bulk, like any Wonder Guard user, Cresselia is still vulnerable to being OHKOed by powerful foes carrying the right coverage such as Beat Up Huge Power Mega Mewtwo X and Bug Buzz Protean Mega Latios. King's Shield variants of Cresselia, however, can scout the aforementioned foes and somewhat mitigate the disadvantage of an unfavorable matchup.</p> ",
    "sets": [
      {
        "name": "Support Wonder Guard",
        "description": "<p>Thanks to its titanic bulk, decent Speed tier, and good pure Psychic typing, Cresselia is an excellent support Wonder Guard user, reliably providing cleric support, Wish passing, entry hazard removal, entry hazard setting, and pivoting support for its teammates. In addition to the utility a pivoting move provides, Baton Pass also allows Cresselia to escape its greatest enemy—Pursuit—provided it is faster than its foe. Thankfully, Cresselia is naturally faster than the most common Pursuit user, Huge Power Mega Gyarados. Alternatively, King's Shield eases Cresselia's matchup versus Pursuit users while also improving Cresselia's matchup against powerful physical foes like Choice Band Mold Breaker Mega Rayquaza. Defog and Aromatherapy are extremely valuable support options on the majority of team structures, but if another teammate is carrying either one, Cresselia can also opt to support its team with Stealth Rock instead. Whirlwind is another option that synergizes well with entry hazards and allows Cresselia to force out Substitute + Baton Pass Wonder Guard users like Xerneas. Finally, recovery is essential for this set to function. Recover's immediate recovery is usually superior on sets lacking King's Shield, while Wish allows Cresselia to support its teammates and has good synergy with both King's Shield and Baton Pass. Shed Shell is the preferred item, as it makes Cresselia much more resilient against Shadow Tag users, requiring a teammate to remove its item with Trick or Knock Off before it can be trapped. A physically defensive EV spread is used to better scout Choice Band Mold Breaker users, as Cresselia's typing and natural bulk allow it to switch into the likes of Choice Specs Mega Mewtwo Y and Mega Rayquaza once even without investment. A Bold Nature and 31 Speed IVs allow Cresselia to outspeed opposing Mega Gyarados with no Speed EVs, allowing it to escape Mega Gyarados's Pursuit with Baton Pass. Alternatively, if vulnerability to Pursuit trappers isn't a concern, a Relaxed nature and 0 Speed IVs can be used to allow Cresselia to underspeed other common slow pivots such as Xerneas and Primal Kyogre.</p> <p>Like is the case with all support Wonder Guard users, most teams benefit from the utility Cresselia can provide in the form of Aromatherapy, entry hazard removal or setting, pivoting, and Wish passing. In addition, Cresselia can also support Huge Power or Protean teammates lacking a Dark-, Bug-, or Ghost-type attack as a switch-in for them against Imposter users. Cresselia can similarly support Choice Specs Mega Mewtwo Y and Mega Rayquaza against Imposter users. Wonder Guard Xerneas is a particularly notable teammate for Cresselia, as it has an excellent matchup against Huge Power Mega Gyarados and other Pursuit trappers in addition to forming a strong Wonder Guard core with it. Alternatively, Cresselia can also pair well with offensive Wonder Guard users like Mega Lucario and Shell Smash Xerneas thanks to their positive matchup into Pursuit users, as well as Cresselia's own ability to effectively compress the roles of cleric and defogger. Offensive Shadow Tag users that aren't weak to Water, such as a Choice Band Mega Mewtwo X, also make effective teammates for Cresselia, as they can trap and remove the aforementioned Mega Gyarados. Ironically, Cresselia's greatest nemeses—Huge Power Dark-types like Mega Gyarados, Mega Tyranitar, and Yveltal—are also stellar teammates for it, serving as offensive checks against Shell Smash Mold Breaker users, especially with Sucker Punch. Similarly, -ate Speed users such as Mega Rayquaza and Mega Abomasnow are also excellent teammates for that same ability to check and revenge kill Shell Smash Mold Breaker users. In addition, -ate Speed users are excellent entry hazard setters and can either form a entry hazard stacking core with Cresselia or free up a moveslot for Whirlwind or other utility move.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 515077, "username": "Mbouchon"}, {"user_id": 226455, "username": "berry"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 562267, "username": "Daylight"}]}
  },
  "Audino": {
    "comments": "<h1>Other Options</h1> <p>Mega Audino can run Knock Off to fully dismantle Mega Gengar, weaken opposing Mega Latios, and remove Prankster Giratina's Safety Goggles for offensive teammates running Spore. Whirlwind and Perish Song are options that can be used when threatening Mold Breaker sweepers like Primal Groudon try to switch into Mega Audino or when Wonder Guard users like Xerneas try to pass a Substitute to a teammate. This isn't as common because Mega Audino can either just predict a switch and pivot to Pokemon more suited to deal with sweepers, or it can be pressured by the Mold Breaker sweeper through continuous status infliction. U-turn is an alternative pivot move that can maintain momentum against Taunt users such as Mold Breaker Primal Groudon and slightly chip physically frail Mold Breaker users coming in, such as Mega Mewtwo Y. However, the loss of momentum against opposing Wonder Guard users usually isn't worth it. A Lum Berry can help Mega Audino heal from sleep or bad poison from Toxic Spikes, but its one-time use can prove inefficient. Wonder Guard is best for longevity, but Prankster and Magic Bounce give Mega Audino more flexibility to run support moves. OHKO moves can be useful as a shock factor to offensive threats and can OHKO opposing No Guard users, but they almost always aren't worth running due to being inconsistent. Mega Audino can also use hazards to punish opposing switch-ins. Lastly, Mega Audino can run a variety of other support moves like Glare, Chatter, and Will-O-Wisp to help advance its teammates further.</p> <h1>Checks and Counters</h1> <p><strong>Unfavorable Matchup: Various Pokemon including Huge Power Mega Mewtwo X, Protean Mega Latios, Protean Mega Mewtwo Y, and Wonder Guard Xerneas often run super effective coverage moves against Mega Audino to force it out.</p> <p><strong>Giratina</strong>: Giratina can be sent out against Mega Audino to run Curse against it, as Curse can be passed by Baton Pass. Additionally, a Giratina with Magic Bounce would not be able to let Mega Audino run Parting Shot in to escape and a Prankster Giratina can force Mega Audino out with Encore. However, Prankster Giratina must be careful when using Curse against Mega Audino with Parting Shot, as Mega Audino using the move the same turn Giratina uses Curse prevents Curse from affecting it, while Giratina is left less healthy.</p> <p><strong>Mold Breaker Shell Smash Users</strong>: Mold Breaker users carrying Shell Smash can use Mega Audino's passivity to set up on it. They can also put Mega Audino to sleep with Spore or Dark Void—the former requires Safety Goggles to block more than once, while the latter cannot be consistently blocked by any item—or inflict chip damage with a powerful attack. However, some Mold Breaker users, such as Mega Gengar lacking a Poison-type STAB move, struggle to get past Mega Audino without getting lucky with sleep.</p> <p><strong>Shadow Tag Perish Trappers</strong>: Mega Audino without Shed Shell is very vulnerable to removal by Shadow Tag users. If swapped in on any move bar Baton Pass or Parting Shot, the Shadow Tag user can Encore Mega Audino, set three layers of Spikes, and remove it with Perish Song.</p> <p><strong>Taunt Users</strong>: Taunt shuts down all Mega Audino sets bar those using U-turn, Magic Coat, or non-status utility moves like Nuzzle and Knock Off.</p> ",
    "sets": [
      {
        "name": "Wonder Guard Support",
        "description": "<p>Though it has an opportunity cost in not being able to be run with Wonder Guard Xerneas, Mega Audino is a premier Wonder Guard user in the Pure Hackmons metagame due to having an amazing defensive typing, being a very slow pivot, and being able to soft-check the likes of Mega Gengar lacking a Poison-type STAB move and Mega Latios lacking Shell Smash. Mega Audino can make use of either Recover to keep itself healthy or Wish with its high HP stat to keep both its teammates and itself healthy, though relying on Wish to heal makes it significantly more difficult to retain momentum. Aromatherapy and Defog are two of the best forms of support any defensive Wonder Guard user can offer its teammates. The former cures Mega Audino and its teammates of status ailments that they would otherwise be annoyed with, while the latter helps to minimize the amount of chip damage that offensive teammates take over the course of the game. King's Shield gives Mega Audino the chance to scout offensive Pokemon that like to switch into it, such as Huge Power Mega Mewtwo X and Mold Breaker Mega Rayquaza, as well as allowing Mega Audino to force out many variants of said switch-ins after an Attack drop. Magic Coat helps Mega Audino's longevity by reflecting back status-inflicting moves like Spore, Dark Void, Will-O-Wisp, and Glare, as well as moves that would otherwise force Mega Audino out, like Taunt and Encore. A pivoting move is almost always required for Mega Audino to retain momentum for its team; Parting Shot is a solid option that can weaken offensive switch-ins, but it causes Mega Audino to struggle to maintain momentum against teams with a Magic Bounce user; however, Baton Pass is the preferred option due to its high PP and freedom pivoting. Mega Audino wants to be as physically bulky as possible in order to scout and pivot out of powerful physical attackers such as Mega Mewtwo X and Primal Groudon; a Relaxed nature with maximum HP and Defense investment and minimum Speed IVs help Mega Audino perform this function of a defensive cleric, soft-check specific Mold Breaker users, and act as a slow pivot. Shed Shell is the preferred item to prevent Mega Audino from being removed by Shadow Tag users, while Safety Goggles helps Mega Audino against Spore users like Mold Breaker users and Prankster Giratina.</p> <p>Mega Audino should only be used in rare semi-stall teams, bulky balance teams, and teams with enough offensive pressure to prefer the defensive roles Xerneas cannot perform as well in. Semi-stall is rare due to limits in teambuilding, but these teams can have Ho-Oh and Mega Steelix cover Mega Audino's weaknesses. Glass cannons, such as Mold Breaker Mega Gengar, Mold Breaker Mega Diancie, and Choice Band Mold Breaker Mega Rayquaza, appreciate Mega Audino's ability to bring them onto the field safely. In addition, these Pokemon also all appreciate Mega Audino's ability to clear entry hazards and cure status. Mega Audino also Imposter-proofs most offensive teammates lacking Poison-type and Steel-type moves, including Mold Breakers like Mega Rayquaza, Mega Latios, Dialga, and Mega Tyranitar. Mega Audino's vulnerability to Mold Breaker Primal Groudon and coverage attackers like Mega Mewtwo X and Mega Latios in an unfavorable matchup makes -ate Speed users like Mega Rayquaza, Kyurem-B, and Mega Abomasnow valuable teammates. Notably, Mega Abomasnow is able to revenge kill the majority of Primal Groudon sets thanks to its resistance to Thousand Arrows, a powerful Boomburst, and Primal Groudon not being able to fit in a Fire-type STAB move and King's Shield on the same set. Mega Audino appreciates being part of most Wonder Guard cores. Cresselia, Mega Scizor, and Mega Manectric are all great examples of solid Wonder Guard partners, since Mega Audino compresses a lot of utility into one teamslot and carries distinct weaknesses. SubPass Wonder Guard users like Mega Swampert and Primal Groudon make for strong partners, since they appreciate the support Wish Mega Audino gives while providing the main support Mega Audino cannot offer. Offensive Shell Smash Wonder Guard sweepers like Mega Lucario and Primal Groudon also pair well with it. Finally, King's Shield Mega Audino can form a solid Wonder Guard core with Wonder Guard users weak to contact moves like Blissey and specially defensive Primal Kyogre.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 562267, "username": "Daylight"}, {"user_id": 569731, "username": "ntothen"}, {"user_id": 515077, "username": "Mbouchon"}]}, {"name": "Grammar checked by", "members": [{"user_id": 241023, "username": "Kris"}]}], "writtenBy": [{"user_id": 235009, "username": "Ransei"}]}
  },
  "Kyurem-Black": {"sets": [{"name": "Refrigerate Revenge-Killer"}]},
  "Genesect": {"sets": [{"name": "Offensive WG"}]},
  "Xerneas": {
    "comments": "<h1>Other Options</h1> <p>Substitute + Baton Pass Xerneas is extremely versatile, with many available options for the first moveslot. Shell Smash is a great option, as it sharply increases both offensive stats and Speed which it can then pass to a teammate. If running Shell Smash, an alternative spread of 248 HP / 184 SpA / 76 Spe with a Modest nature ensures that Xerneas outspeeds Deoxys-S lacking Choice Scarf after a Shell Smash. Alternative support for the rest of the team, namely Defog and Aromatherapy, are also decent options. Spikes is a workable option over Stealth Rock, as two of the most prominent Flying-types, Mega Rayquaza and Yveltal, are both weak to Moonblast; Toxic Spikes and Sticky Web provide great support as well, although Mega Gengar or Wonder Guard Poison-types like Skuntank and Drapion can come in and soak up Toxic Spikes without much difficulty. Steam Eruption is workable coverage that allows Xerneas to OHKO Primal Groudon, though it doesn't threaten much apart from Primal Groudon; if running Steam Eruption, an alternative spread of 72 HP / 252 SpA / 184 Spe with a Modest nature allows Xerneas to outspeed and OHKO Adamant Primal Groudon. Wish is an option over Recover, taking advantage of Xerneas's large HP stat to heal large portions of teammates' health, but running it makes it more difficult for Xerneas to heal itself safely. King's Shield is a niche option that allows Xerneas to force out Choice Band Mold Breaker Mega Rayquaza, as it is OHKOed by Dragon Ascent with minimal chip otherwise. Spore is usable over Dark Void due to its higher accuracy, but doesn't affect passive Wonder Guard users with Safety Goggles like Primal Kyogre and Cresselia; Safety Goggles is an option on Xerneas if running Spore. Knock Off is a fringe option that potentially removes Leftovers and Lum Berry from Primal Groudon and threatens Plate users like Mega Gengar, Mold Breaker Mega Diancie, and Dialga if Xerneas has a Substitute up. Magic Coat helps to burn Prankster Giratina's Encore PP and bounces back Whirlwinds, but faces stiff competition from Taunt. Gastro Acid can be used on the switch to remove Mold Breaker users' ability, allowing Xerneas a free turn to set up Substitute in most instances. Finally, Mail can be run on Xerneas to prevent Trick users from crippling it, but sets running Mail are generally forced into running Recover in the first moveslot.</p> <h1>Checks and Counters</h1> <p><strong>Primal Groudon: Mold Breaker Primal Groudon, especially variants running Leftovers, can force Xerneas out with relative ease due to its resistance to Moonblast and offensive presence. However, Xerneas sets running Glare and Dark Void can cripple Primal Groudon sets not running Lum Berry, and rare Steam Eruption sets OHKO it.</p> <p><strong>Choice Item Mold Breaker Users</strong>: Choice item Mold Breaker Pokemon, especially ones with extremely powerful STAB moves like Primal Groudon, Mega Rayquaza, and Mega Mewtwo Y, are generally powerful enough to force Xerneas out. However, they can usually only come in on slow pivoting, as most Choice item Mold Breaker users must be wary of Xerneas's Moonblast.</p> <p><strong>Shadow Tag Users: Shadow Tag users can trap Xerneas, which primarily runs Leftovers, and eliminate it one way or another. Bulky perish trappers, like Lugia and Arceus, can set up three layers of Spikes and remove Xerneas if pivoted in on when Xerneas uses anything bar Glare, Dark Void, or Baton Pass. Offensive Shadow Tag users, most notable among them Mega Mewtwo X, can KO Xerneas with coverage moves like Gunk Shot, Gear Grind, or Sludge Wave. However, Shadow Tag users require pivoting to get in safely against sets running Glare or Dark Void, and often only secures a KO against Xerneas users that play carelessly. Xerneas variants running Shed Shell are much more resistant to Shadow Tag users, and require considerable support to threaten.</p> <p><strong>Trick Users: Trick users, especially Pokemon that Xerneas ordinarily comes in on like No Guard users, Wonder Guard Mega Beedrill, and rare Choice item Wonder Guard users, can severely hinder Xerneas's ability to support its team by giving it a detrimental item. Choice items virtually force Xerneas into using Baton Pass, due to losing momentum if using any other move, and Black Sludge effectively puts it on a timer. However, rare Mail variants are immune to Trick.</p> <p><strong>Whirlwind Wonder Guard Users: Wonder Guard users running Whirlwind, such as Primal Kyogre, Slaking, and Cresselia, can force Xerneas out and disrupt its ability to pass Substitutes to teammates. However, Xerneas can somewhat circumvent this if it is running Glare, as it can pass Substitutes if the foe is fully paralyzed for one turn.</p> <p><strong>Magic Bounce Users Not Weak To Moonblast: While fairly rare, Magic Bounce users that resist Moonblast, such as Registeel, Mega Steelix, and Mega Venusaur, can prevent most Xerneas sets from supporting its team through any means other than passing a Substitute. However, these Magic Bounce users are generally setup bait for Xerneas sets running Shell Smash unless they run Perish Song.</p> <p><strong>Wonder Guard Shell Smash Sweepers: Three of the best Wonder Guard Shell Smash sweepers are Xerneas, Mega Gardevoir, and Mega Lucario, and virtually every single Shell Smash set runs coverage for Fairy-type Wonder Guard users like Xerneas and Mega Audino. However, in a 1v1 scenario, Xerneas variants with Glare can survive a hit and cripple the opposing Wonder Guard Shell Smash user with paralysis.</p> <p><strong>Unfavorable Matchup: If the Xerneas user gets an unfavorable matchup against opposing Huge Power, Protean, or rare Parental Bond users, careful play must be accomplished to bring either Prankster Giratina or a powerful revenge killer, such as Sucker Punch Mega Gyarados, in and force the offensive Pokemon out. While rare, No Guard sets fishing for coverage, if granted a favorable matchup, require extremely offensive play by revenge killers and Mold Breaker users to have a chance at winning before the opponent does.</p> ",
    "sets": [
      {
        "name": "Substitute + Baton Pass Wonder Guard",
        "description": "<p>Wonder Guard Xerneas is the most threatening and versatile Wonder Guard user in the metagame thanks to its great defensive and offensive typing, respectable offensive stats, and versatile Speed tier. The first moveslot is extremely customizable, as Xerneas's offensive typing forces out most Magic Bounce users. Stealth Rock provides a way to chip opposing switch-ins, while Glare often nets free turns and can make Shell Smash sweepers more manageable by sharply reducing their Speed. While Recover faces stiff competition from the aforementioned two moves and isn't as easy to justify on Leftovers variants, it is nevertheless an excellent option on Shed Shell sets due to greatly increasing Xerneas's longevity. Taunt prevents Wonder Guard users from phasing Xerneas with Whirlwind and Prankster users from preventing Xerneas from passing Substitutes to teammates; Dark Void generates even more free turns than Glare does, although it's not as accurate and a well-timed Magic Bounce switch in puts Xerneas to sleep instead. Substitute, in tandem with Baton Pass, almost always allows Mold Breaker teammates one extra turn to safely set up, disrupt its check, or heavily damage opposing switch-ins. Baton Pass in itself is also a fantastic option, as Xerneas's offensive presence forces a wide variety of metagame threats out, often generating momentum for its team. Moonblast sets Xerneas apart from most other Wonder Guard users, as it's an amazing STAB option that threatens Giratina, Mega Rayquaza, Mega Mewtwo X lacking coverage for Xerneas, and weakened Mega Latios, allowing Xerneas to force opposing Wonder Guard users in in a wide variety of situations. Leftovers is generally preferred to allow for passive recovery on Xerneas and synergizes well with Substitute; Shed Shell can be run on Recover sets, however, as it prevents Xerneas from being easily removed by offensive Shadow Tag users. The given spread maximizes Xerneas's bulk, as well as Substitute's HP amount, while also forcing Pokemon weak to Fairy-type attacks out, such as Prankster Giratina, Mega Mewtwo X, and Mega Rayquaza; minimum Speed maximizes Baton Pass's effectiveness, as pivoting after the opposing Pokemon moves ensures that the user's switch-in comes in safely.</p> <p>Substitute + Baton Pass Xerneas works best on balance and bulky offense builds with teammates that appreciate being passed a Substitute, as well as defensive teammates that take care of what threatens Xerneas. In particular, the ubiquitous Primal Groudon + Giratina + Wonder Guard Xerneas core works extremely well, as Xerneas can pass Substitutes to Primal Groudon, Primal Groudon forces opposing Giratina in, and Giratina comes in on Huge Power-boosted Poison- and Steel-type attacks while simultaneously Imposter-proofing most Primal Groudon sets. Special Mold Breaker users, especially physically frailer ones like Mega Gengar, Mega Latios, Mega Diancie, and Mega Sceptile, also appreciate Substitute + Baton Pass support from Xerneas. Additionally, Xerneas also fits well on dual Mega Mewtwo X teams, as Mega Mewtwo X dislikes having to risk taking damage from Sucker Punch Mega Gyarados, being chipped by Shadow Tag Slaking and Regigigas, and, on sets lacking Lum Berry, getting burned by Prankster Giratina. Xerneas's most common switch-in in Primal Groudon can be taken advantage of by running defensive checks such as Prankster Giratina or the rare Mega Slowbro, offensive checks like Huge Power Mega Gyarados, or soft-checks that are also good support options like physically defensive Wonder Guard Primal Kyogre. Good revenge-killers to Primal Groudon, such as the aforementioned Mega Gyarados, Imposter Chansey, and Refrigerate Mega Abomasnow, also excel as partners to Xerneas. Mega Gyarados also doubles as a check to the most prevalent Shadow Tag Perish trapper in Lugia. Lastly, No Guard users, which often force opposing Wonder Guard users in, are great partners to Xerneas, as most of the time they provide fodder for Xerneas to use Substitute. Last but not least, Xerneas can be paired with other Xerneas in spam teams if running Recover on the first moveslot, with possible abilities on teammates being Mold Breaker, Huge Power, Pixilate, No Guard, and Prankster.</p> "
      },
      {"name": "SmashPass WG"},
      {"name": "Shell Smash Sweeper WG"},
      {"name": "Support WG"},
      {"name": "Mold Breaker Sweeper"}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 226455, "username": "berry"}, {"user_id": 506113, "username": "BahamutLagoon"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 515077, "username": "Mbouchon"}]}
  },
  "Yveltal": {"sets": [{"name": "Magic Bounce"}, {"name": "Poison Heal"}, {"name": "Pursuit Trapper"}]},
  "Diancie": {"sets": [{"name": "Pixilate Revenge Killer"}, {"name": "Shell Smash Sweeper"}]}
}