{
  "Pikachu": {"sets": [{"name": "Imposter"}]},
  "Gengar": {"sets": [{"name": "Mold Breaker Sweeper"}]},
  "Arceus": {"sets": [{"name": "Support WG"}, {"name": "Shell Smash Sweeper"}]},
  "Gardevoir": {
    "comments": "<h1>Other Options</h1> <p>An alternate EV Spread of 80 Def / 252 SpA / 176 Spe with a Timid nature can be used to outspeed Jolly Primal Groudon and other maximum Speed base 90 Pokemon before Mega Gardevoir uses Shell Smash, in addition to giving it the ability to survive Choice Band Adamant Mold Breaker Primal Groudon’s Extreme Speed before Mega Gardevoir uses Shell Smash and non-Choice Band Extreme Speed after a Shell Smash. This spread, however, is generally only worth using in tandem with either Water coverage like Scald or Steam Eruption or on niche Choice Specs Mold Breaker sets with Psycho Boost that can OHKO Primal Groudon without requiring a boost first. Thanks to Mega Gardevoir’s physical frailty, further defensive investment is generally inadvisable.</p> <p>Mega Gardevoir has a wide range of other viable coverage options; Bug Buzz hits Psychic-type Wonder Guard users, Aura Sphere hits Normal-type Wonder Guard users not named Blissey harder than Secret Sword, Scald OHKOes Primal Groudon, and Giga Drain hits Water-type Wonder Guard users while also providing recovery. Gastro Acid is also an option over a coverage move to allow Mega Gardevoir to break through Wonder Guard users of any type at the somewhat steep cost of an additional turn to do so. In addition, while Stealth Rock is hard to fit, Mega Gardevoir’s ability to threaten out the format’s most popular Magic Bouncers—Giratina and Yveltal—make it a reliable entry hazard setter.</p> <p>Mega Gardevoir is also a very competent user of Substitute + Baton Pass Wonder Guard sets, but faces fierce competition from the much bulkier Xerneas for this role. However, it is worth noting that Mega Gardevoir specifically utilizes Glare and Shell Smash variants of these sets just as efficiently, if not better, than Xerneas can in many scenarios. Mold Breaker sets with either Choice Specs or Shell Smash are also a niche option. However, the former faces steep competition with Choice Specs Mega Mewtwo Y and even the rare Choice Specs Mega Diancie and the latter is only useful over similar Mega Diancie sets if STAB Stored Power or Psystrike is greatly desired.</p> <h1>Checks and Counters</h1> <p><strong>Strong Physical Attackers: Mega Gardevoir’s physical frailty means it cannot switch into or stomach any reasonably strong physical hits bar Fighting type attacks. A Choice Band or Huge Power boosted hit that makes it through Mega Gardevoir’s Wonder Guard will almost always KO. In addition, super effective priority moves such as Shadow Sneak and Bullet Punch—most frequently seen on Shadow Tag and Huge Power Regigigas and Slaking sets—bypass Gardevoir’s Wonder Guard and KO it outright.</p> <p><strong>Mega Gengar: Mold Breaker Mega Gengar puts a lot of pressure on Mega Gardevoir, outspeeding and OHKOing it with Spooky Plate Judgment or Sludge Wave. However, Mega Gengar cannot switch into Mega Gardevoir effectively, especially if Gardevoir is carrying Spooky Plate or is already boosted.</p> <p><strong>Opposing Wonder Guard</strong>: Because Wonder Guard sweepers are inherently matchup dependent, Wonder Guard users that Mega Gardevoir is not packing the correct coverage move for will force it out.</p> <p><strong>Item Removal</strong>: Trick, Switcheroo, and Mold Breaker Knock Off can severely impede Mega Gardevoir’s ability to do its job, removing one third of its coverage as well as its ability to beat Imposter users.</p> <p><strong>Plate Imposter Users</strong>: While rare and very suboptimal outside of a matchup into offensive Wonder Guard Mega Gardevoir or Xerneas (or Mold Breaker Mega Gengar, in the case of Spooky Plate), Imposter Pokemon holding an Iron Plate or Spooky Plate directly counter this set and can be difficult to deal with.</p> ",
    "sets": [
      {
        "name": "Wonder Guard Shell Smash",
        "description": "<p>Mega Gardevoir’s excellent Psychic / Fairy typing and high base 165 Special Attack make it one of the best options for a Wonder Guard Shell Smash sweeper. Judgment and either Iron Plate or Spooky Plate allow this set to beat Imposter users, as well as Fairy-type or Psychic-type Wonder Guard users, respectively. Thanks to the evergreen popularity of Wonder Guard Xerneas, Iron Plate is usually preferred, but Spooky Plate does have additional utility outside of hitting Psychic-type Wonder Guard users—notably +2 Spooky Plate Judgment OHKOes Mega Mewtwo X, Mega Mewtwo Y, and Mega Latios, as well as standard Primal Groudon after Stealth Rock. The remaining moveslots are dedicated to coverage for breaking as many Wonder Guard cores and Mold Breaker switch-ins as possible and are, as a result, quite flexible and very team-dependent. Grass Knot and Freeze-Dry are powerful coverage options that, most notably, allow this set to beat the ever popular Wonder Guard Primal Kyogre. On Iron Plate sets, Grass Knot is usually preferred for the OHKO on Primal Groudon after Stealth Rock at +2. Freeze-Dry nails a broader range of threats, however, including OHKOing Wonder Guard Gyaradosite Gyarados and Mega Rayquaza. Moonblast is a powerful STAB move that is often Mega Gardevoir’s best option against non-Wonder Guard switch-ins and also OHKOes the somewhat common Wonder Guard Mega Sableye. It also OHKOes standard Giratina sets even at just +1. Secret Sword and Lava Plume smack Normal and Bug / Steel type Wonder Guards, respectively, while Earth Power is notable for hitting both Electric Wonder Guard users and netting a guaranteed KO against Primal Groudon at +2. Mix and match these (or other) coverage options according to your team’s needs and current metagame trends. A Modest nature is preferred to secure several key KOs such as Mega Mewtwo X and Mega Rayquaza, but a Timid nature is an option if outpacing Timid Xerneas is desired.</p> <p>Wonder Guard Shell Smash Mega Gardevoir fits well on both balance and offensive teams as a powerful wincon. Physical Mold Breakers, though valuable on nearly every team structure in ORAS Pure Hackmons, are especially important teammates for Mega Gardevoir, breaking through the Wonder Guard users Mega Gardevoir’s chosen coverage moves may not pierce. Choice Band Primal Groudon is especially noteworthy for its excellent offensive synergy with Mega Gardevoir, as well as its ability to obliterate opposing Wonder Guard users with its STAB V-create. Fast and powerful Mold Breaker users such as Mega Mewtwo Y and especially Mega Gengar can make it very difficult for Gardevoir to get a Shell Smash up, so teammates such as Yveltal, Mega Gyarados, Wonder Guard Meloetta, Arceus carrying Knock Off, and various -ate Speed users like Mega Rayquaza and Mega Abomasnow are appreciated. Many of these Pokemon are also good entry hazard setters, and Mega Gardevoir appreciates Stealth Rock support to turn many of its already favorable rolls, such as +2 Spooky Plate Judgment or Grass Knot into 240 HP Primal Groudon, into guaranteed KOs. Aromatherapy support from support Wonder Guard partners with complementary typing such as Primal Kyogre, Meloetta, Slaking, and Mega Scizor, among others, is also appreciated to prevent Toxic or Will-O-Wisp from putting a timer on Mega Gardevoir’s sweep. Defog and Wish support from these teammates can also offset any chip Mega Gardevoir might take throughout a game, making its job as a late-game cleaner and wincon more flexible.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 515077, "username": "Mbouchon"}, {"user_id": 226455, "username": "berry"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 562267, "username": "Daylight"}]}
  },
  "Beedrill": {"sets": [{"name": "Support WG"}]},
  "Chansey": {"sets": [{"name": "Imposter"}]},
  "Gyarados": {"sets": [{"name": "Pursuit Trapper"}, {"name": "Gyaradosite Sweeper"}]},
  "Mewtwo": {"sets": [{"name": "Huge Power (Mewtwo-Mega-X)"}, {"name": "Shadow Tag (Mewtwo-Mega-X)"}, {"name": "Shell Smash Sweeper (Mewtwo-Mega-X)"}, {"name": "Protean (Mewtwo-Mega-Y)"}, {"name": "Huge Power (Mewtwo-Mega-Y)"}, {"name": "Choice Specs (Mewtwo-Mega-Y)"}, {"name": "Scarf No Guard (Mewtwo-Mega-Y)"}, {"name": "Sash No Guard (Mewtwo-Mega-Y)"}, {"name": "Offensive WG (Mewtwo-Mega-Y)"}, {"name": "SubPass WG (Mewtwo-Mega-Y)"}, {"name": "Support WG (Mewtwo-Mega-Y)"}, {"name": "Shadow Tag (Mewtwo-Mega-Y)"}]},
  "Scizor": {"sets": [{"name": "Support WG"}]},
  "Blissey": {"sets": [{"name": "Support WG"}]},
  "Tyranitar": {"sets": [{"name": "Shell Smash Sweeper"}, {"name": "Pursuit Trapper"}]},
  "Swampert": {"sets": [{"name": "SubPass WG"}, {"name": "Support WG"}]},
  "Slaking": {"sets": [{"name": "Support WG"}, {"name": "Huge Power Revenge Killer"}, {"name": "Shadow Tag Revenge Killer"}]},
  "Sableye": {"sets": [{"name": "FEAR WG"}, {"name": "Support WG"}]},
  "Manectric": {"sets": [{"name": "SubPass WG"}]},
  "Latios": {"sets": [{"name": "Protean"}, {"name": "Mold Breaker Sweeper"}, {"name": "Shadow Tag"}]},
  "Kyogre": {"sets": [{"name": "Support WG", "description": "<p>A physically defensive spread, with a Bold or Relaxed nature, may also be run to check Primal Groudon slightly harder.</p> "}]},
  "Groudon": {"sets": [{"name": "The Don (Physical Shell Smash Sweeper)"}, {"name": "Choice Band Mold Breaker"}, {"name": "Choiced Shadow Tag"}, {"name": "Shell Smash Sweeper WG"}, {"name": "Choice Scarf Mold Breaker"}, {"name": "Support WG"}, {"name": "Baton Pass WG"}, {"name": "Choice Band Revenge Killer"}, {"name": "Huge Power Coverage"}, {"name": "Special Shell Smash Sweeper"}]},
  "Rayquaza": {"sets": [{"name": "Choice Band Mold Breaker"}, {"name": "Choice Specs Mold Breaker"}, {"name": "Aerilate Revenge Killer"}, {"name": "Choiced Shadow Tag"}, {"name": "Gale Wings Revenge Killer"}]},
  "Deoxys-Attack": {"sets": [{"name": "Huge Power"}, {"name": "Choice Specs Mold Breaker"}]},
  "Lopunny": {"sets": [{"name": "Scarf No Guard"}, {"name": "Sash No Guard"}]},
  "Skuntank": {"sets": [{"name": "Support WG"}]},
  "Lucario": {"sets": [{"name": "Shell Smash Sweeper WG"}]},
  "Abomasnow": {"sets": [{"name": "Refrigerate Revenge Killer"}]},
  "Dialga": {"sets": [{"name": "Shell Smash Sweeper"}]},
  "Regigigas": {"sets": [{"name": "Huge Power Revenge-Killer"}, {"name": "Shadow Tag Revenge Killer"}]},
  "Giratina": {"sets": [{"name": "Prankster"}, {"name": "Magic Bounce"}]},
  "Cresselia": {"sets": [{"name": "Support WG"}]},
  "Audino": {"sets": [{"name": "Support WG"}]},
  "Kyurem-Black": {"sets": [{"name": "Refrigerate Revenge-Killer"}]},
  "Genesect": {"sets": [{"name": "Offensive WG"}]},
  "Xerneas": {"sets": [{"name": "SubPass WG"}, {"name": "SmashPass WG"}, {"name": "Shell Smash Sweeper WG"}, {"name": "Support WG"}, {"name": "Mold Breaker Sweeper"}]},
  "Yveltal": {"sets": [{"name": "Magic Bounce"}, {"name": "Poison Heal"}, {"name": "Pursuit Trapper"}]},
  "Diancie": {"sets": [{"name": "Pixilate Revenge Killer"}, {"name": "Shell Smash Sweeper"}]}
}