{
  "Heatran": {
    "overview": "<p>Heatran's amazing typing and ability let it wall many metagame threats including Mega Charizard Y, Tapu Lele, Cresselia, Amoonguss, and Sylveon. It's high Special Attack allows to deal good damage to most pokemon with its spread Heat Wave which has great coverage with Earth Power. Heatran's prominence can work against it as some of the pokemon it is supposed to check will run a Ground-type Hidden Power just to get past it. Heatran also has a poor match up against threats like Landorus-T and Tapu Fini.</p> <p>Below is a sample set. This set is likely to be standard, but it will be expanded upon and updated as the metagame progresses.</p>",
    "sets": {
      "Standard Heatran": {
        "description": "<ul> <li>Heat Wave is Heatran's main STAB attack chunking most pokemon even with spread reduction. Flamethrower could also used as a 100% accurate, single target alternative.</li> <li>Earth Power provides great coverage with Fire-type attacks. It hits opposing Heatran super effectively and Water-types neutrally.</li> <li>The last move is highly flexible and varies by team. Flash Cannon eliminates Fairy-types such as Tapu Lele and Sylveon more quickly than Heat Wave. Substitute can easily be set up with Heatran's numerous resistances and high bulk. A Heatran behind a Substitute is very difficult for many teams to take out. Hidden Power Ice can be used to eliminate Landorus-T and Mega Salamence.</li> <li>Shuca Berry allows Heatran to survive one unboosted Earthquake from Landorus-T. It also lets Heatran have a better match up against opposing Heatran. Leftovers should be used with Substitute to provide passive recovery. Firium Z gives a powerful Fire-type move that can get around Wide Guard.</li> <li>Modest is the preferred nature to give Heatran more power, but Timid can be used to have the best chance in Heatran mirrors and outspeed Jolly Breloom and Tapu Bulu. Bulkier spreads can also be used especially on Trick Room teams.</li> <li>Partners that can deal with Water-types and Landorus-T are especially crucial when using Heatran. Electric-Types such as Tapu Koko and Zapdos can hit Water-types super effectively. Amoonguss can redirect Water-types attacks and put Landorus-T to sleep even when Electric or Misty Terrain are active.</li> </ul>"
      }
    }
  },
  "Aegislash": {
    "overview": "<p>Aegislash's unique Stance Change ability is a great fit for doubles, making it a great bulky attacker that can heavily punish physical attackers with an Attack drop from King's Shield, and is very difficult to wall thanks to Ghost's great neutral coverage.. Aegislash is arguably one of the best tanky users of Substitute, and its also excellent at stopping spread attackers with Wide Guard. However, Aegislash's reliance on King's Shield to regain bulk can make it overly predictable, especially in the face of its common weaknesses such as Fire, Dark, and Ground.</p> <p>Below is a sample set. This set is likely to be the standard, but it will be expanded upon and updated as the metagame progresses.</p>",
    "sets": {
      "Bulky Attacker": {
        "description": "<ul> <li> <p>King's Shield is needed for letting Aegislash return to its shield forme and protecting it from attacks.</p> </li> <li> <p>Shadow Ball is by far Aegislash's best STAB, having the least resists.</p> </li> <li> <p>Flash Cannon works well for hitting Fairy-types like Sylveon and Tapu Bulu harder than Shadow Ball.</p> </li> <li> <p>Substitute takes advantage of physical attacker's attempts to avoid King's Shield, making Aegislash much harder to take down. Wide Guard is an excellent support move for blocking spread attacks, and Shadow Sneak lets Aegislash pick off weakened threats.</p> </li> <li> <p>Leftovers is the best choice for sets that use Substitute due to keeping Aegislash's health up. Weakness Policy can be used to get an extremely powerful attack in against the weaker super effective moves.</p> </li> <li> <p>Ghostium Z lets Aegislash deal serious damage with Z-Shadow Ball, notably OHKOing Mega Salamence. Steelium Z can be used with Z-Flash Cannon if Mega Kangaskhan is especially worrisome.</p> </li> <li> <p>A Quiet Nature and 0 Speed IVs ensures that Aegislash will underspeed Celesteela, which is important in case it uses Flamethrower. It also makes Aegislash a usable mixed attacker. If using Substitute, consider running Speed EVs and a Modest nature to outspeed Celesteela and block its Leech Seed with Substitute.</p> </li> <li> <p>Strong Fire-types such as Mega Charizard Y and Heatran are a major problem for Aegislash, so consider pairing it with a partner that deals with either of those two well.</p> </li> <li> <p>Dark-types are also problematic for Aegislash, even though it can hit all of them hard with Flash Cannon, so partners that deal with those can also be beneficial. LandorusT is especially good, since Intimidate helps it soak attacks for Weakness Policy, and Wide Guard will let Aegislash avoid Earthquake without using King's Shield.</p> </li> <li> <p>If using Wide Guard, consider pairing Aegislash with Pokemon that have a difficult time with common spread attacks, such as Mega Charizard Y.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "Theorymon", "user_id": 29010}], "teams": [{"name": "Quality checked by", "members": [{"username": "Carbonific", "user_id": 233942}]}, {"name": "Grammar checked by", "members": [{"username": "Demantoid", "user_id": 264687}]}]}
  },
  "Cresselia": {
    "overview": "<ul> <li>Cresselia is a staple of the Battle Spot Doubles format and one of its best tanks with its insane 120/120/130 defenses.</li> <li>It has a great ability in Levitate, making it immune to all Ground-type moves thusmaking it a great switch-in to Landorus-T and other Tectonic Rage users.</li> <li>With its respectable Speed tier, Cresselia can be effective in and out of Trick Room.</li> <li>A relatively low Special Attack stat means a lot of times it can be a sitting duck.</li> <li>With only weak Psychic- and Ice-type attacks, Cresselia is easily walled by Dark- and Steel-type Pokemon.</li> </ul>",
    "comments": "<h1>Other Options</h1> <ul> <li>Dual Screens gives Cresselia amazing utility and increases the bulk of its entire team.</li> <li>Toxic and Moonlight are great options for 1v1 situations with opposing bulky walls that teammates cannot break.</li> <li>Thunder Wave can be used as a permanent form of speed control, thought it has less accuracy than Icy Wind and is blocked by Misty Terrain.</li> <li>Iapapa Berry is restores health once Cresselia drops below 25%, and the extra recovery can swing momentum in tight games.</li> </ul> <h1>Checks and Counters</h1> <p><strong>Steel-types</strong>: Most Steel-type Pokemon, such as Heatran, Celesteela, Aegislash, and Metagross, completely wall out all of Cresselia's attacks aside from a potential Hidden Power Ground and will eventually wear it down.</p> <p><strong>Ghost-types: While most Ghost-types don't resist Psychic-type attacks, Pokemon like Mimikyu and Aegislash can absorb a few hits and either set up or go for big damage with attacks like Never-Ending-Nightmare. In the case of Alolan Marowak, Psychic does minimal damage while Shadow Bone does lots to even the bulkiest of Cresselia.</p> <p><strong>Dark-types: Dark-types are immune to Psychic and hit Cresselia hard with their STAB attacks, and the bulkiest of them, such as Alolan Muk and Tyranitar, are not going to take much damage from Ice Beam.</p> <p><strong>Toxic/Perish Song: Cresselia is the epitome of staying power. So when faced with Toxic or Perish Song, which dictates how long it has to remain on the field, its role is made worthless.</p>",
    "sets": {
      "Trick Room": {
        "description": "<h1>Moves</h1> <ul> <li>Cresselia is one of the bulkiest Pokemon that learns Trick Room, which it uses to assist its strong, bulky partners, flipping the turn order in each priority bracket.</li> <li>Psychic provides a reliable STAB attack that does decent damage to a wide variety of Pokemon. Psyshock, on the other hand, trades some power to hit Pokemon with weaker physical defense for more damage.</li> <li>Ice Beam is for hitting Pokemon that resist Psychic-type attacks or are very weak to Ice-type attacks, such as Salamence and Landorus-T.</li> <li>Skill Swap takes away useful abilities such as Intimidate, Aerilate, and Parental Bond and gives Levitate to teammates such as Heatran.</li> <li>Helping Hand boosts the power of Cresselia's teammates, and can turn 2HKOs into OHKOs.</li> </ul> <h1>Set Details</h1> <ul> <li>Cresselia's great staying power makes it an obvious choice for setting up Trick Room.</li> <li>Mental Herb prevents the likes of Taunt and Encore from stopping Cresselia's setup, which are common ways to prevent Trick Room.</li> <li>The EV spread is used to patch up Cresselia's slightly weaker Defense.</li> <li>Sitrus Berry maximizes the chances of setting Trick Room a second time, which can be game winning.</li> <li>Leftovers is the best item for long term recovery and increasing the amazing staying power that Cresselia already possesses.</li> </ul> <h1>Usage Tips</h1> <ul> <li>It's advised to not bring Cresselia against teams with dedicated Trick Room answers, such as Amoonguss.</li> <li>Use Team Preview to judge the Speed of the opposing team, if it is on the faster end, lots of times it won't be as defensive, and Cresselia and its partners can just tear through the opposing team.</li> <li>Watch out for Pokemon such as Aegislash and Tyranitar that can one-shot Cresselia with their insanely strong super effective Z-moves.</li> </ul> <h1>Team Options</h1> <ul> <li>Amoonguss is one of the classic partners for Trick Room Cresselia, as its great bulk allows it to sponge hits rather easily with Rage Powder while Cresselia sets up. Then, Amoonguss is able to put things to sleep with Spore while other Pokemon get to work.</li> <li>Tyranitar is slow and very powerful, and complements Cresselia well by hitting Ghost types that it doesn't enjoy facing, and OHKOing some Dark-types with Superpower.</li> <li>Mega Kangaskhan, while not necessarily a slow Pokemon, can be built to be slow and assist Cresselia with setting up Trick Room using Fake Out.</li> <li>Conkeldurr is one of the strongest and slowest Pokemon in the metagame, and having something like Cresselia to support its power complements it really well.</li> <li>Heatran can be run with a slow and bulky set as well, which means it can take advantage of Trick Room and can cover Cresselia's bad Steel-type matchup with strong Fire-type STAB attacks. Cresselia can also utilize Skill Swap to give Heatran Levitate, removing its 4x weakness to Ground.</li> </ul>"
      },
      "Calm Mind": {
        "description": "<h1>Moves</h1> <ul> <li>Cresselia is very deadly after a Calm Mind boost, as the majority of the offensive attackers in the format are specially oriented.</li> <li>Psychic is the strongest Psychic STAB Cresselia learns, and the damage output drastically increases with a few Calm Minds. Calm Mind can also negate the slight power drop of Psyshock, if hitting Pokemon with less Defense is more desired.</li> <li>Icy Wind can be used as team support, while Ice Beam deals strong damage to Pokemon that have an exploitable Ice Weakness and is a guaranteed OHKO on Landorus-T and Salamence at +1 Special Attack.</li> <li>Moonlight keeps Cresselia on the field longer, which is vital for a set that thrives on setting up for multiple turns.</li> <li>Hidden Power Ground hits Steel-types, especially Heatran.</li> <li>Moonlight keeps Cresselia on the field longer, which is vital for a set that thrives on setting up for multiple turns.</li> </ul> <h1>Set Details</h1> <ul> <li>Kee Berry is used to give Cresselia a way to increase both its defenses. Electric Seed and Grassy Seed also boost Defense if you have Tapu Koko or Tapu Bulu, respectively, as a teammate.</li> <li>Leftovers can increase longevity and recovery.</li> <li>This EV spread maximizes Defense, as with Calm Mind it's easy to boost Special Defense and very quickly have a prolific mixed wall.</li> <li>Rocky Helmet makes physical attackers wary of hitting Cresselia and also makes it easier to pick up KOs once it has racked up a few boosts.</li> </ul> <h1>Usage Tips</h1> <ul> <li>This set is at its best when used against teams with lots of Special attackers and few Dark- and Ghost-type Pokemon that threaten its setup.</li> <li>Identifying which Pokemon are the threats to Cresselia and removing them is a key strategy, as then Cresselia becomes a win condition by itself.</li> <li>With Kee Berry especially, it's good to stack Intimidate or switch in on weak physical attacks such as Fake Out to gain quick Defense boosts while lowering your opponent's damage output.</li> <li>Calm Mind Cresselia isn't as effective against teams that run rain, sand, or hail due to the fact that Moonlight recovers less HP than it would normally, which severely cuts Cresselia's staying power.</li> </ul> <h1>Team Options</h1> <ul> <li>Heatran is one of the best partners for Cresselia, as it can easily remove Steel-types, that Cresselia struggles with using strong Fire STAB attacks or Earth Power.</li> <li>Landorus-T makes a great pairing for Cresselia, complementing its bulk with Intimidate and removing opposing Steel-types. Landorus-T also has the ability to use Earthquake freely due to Cresselia's Levitate.</li> <li>Tapu Fini, though it doesn't give Cresselia immunity to status effects, covers Cresselia as a way to deal with Heatran and can potentially support Cresselia with Heal Pulse.</li> <li>Mega Kangaskhan and Cresselia make a great duo of bulky attackers, hitting from both the special and physical sides.</li> <li>With Drought, Mega Charizard Y gives Cresselia greater recovery from Moonlight, and obliterates all Steel-types, not named Heatran.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "flarz", "user_id": 227616}], "teams": [{"name": "Quality checked by", "members": [{"username": "Demantoid", "user_id": 264687}, {"username": "Psynergy", "user_id": 248085}]}, {"name": "Grammar checked by", "members": [{"username": "talkingtree", "user_id": 232101}]}]}
  },
  "Suicune": {
    "overview": "<ul> <li>Suicune is one of the bulkiest Water-type Pokemon in the metagame, along with Tapu Fini and Milotic, as it is easily able to tank hits like Mega Salamence's Double-Edge and Tapu Lele's Psychic.</li> <li>Base defensive stats of 100 / 115 / 115 give Suicune considerable bulk, being nearly on par with that of Cresselia.</li> <li>Suicune's selective support movepool consists of Snarl for disruption, as well as Icy Wind and Tailwind. Due to its exceptional natural bulk, Suicune is an ideal setter of Tailwind to provide your team some speed control.</li> <li>Even though Suicune primarily plays a supportive role in most teams, it is capable of taking out popular threats like Landorus-T, Mega Salamence, and Heatran with ease.</li> <li>However, Z-Moves pose a major problem for Suicune, as they are capable of OHKOing it unless you invest a lot of EVs into its defensive stats.</li> <li>Pokemon like Tapu Koko and Tapu Bulu can easily KO Suicune with their respective STAB moves, and Ferrothorn simply walls it with its typing. Suicune also struggles against bulky Steel-types like Celesteela and Aegislash.</li> <li>While Suicune may seem to be outclassed by Tapu Fini, it finds a niche in some teams as a potential support Pokemon that can provide a form of speed control.</li> </ul>",
    "comments": "<h1>Other Options</h1> <ul> <li>Aguav Berry may be used instead of Sitrus berry to regain larger amounts of HP. However, there is the risk of being KOed easily if Suicune's HP fails to go below 25% to trigger the Berry's activation.</li> <li>Calm Mind can be used to further boost Suicune's Special Defense but is outclassed by Tapu Fini due to the latter's coverage options and typing. Icy Wind can give this set a niche over Tapu Fini by providing an additional means of speed control.</li> <li>Another utility move that can be used is Mirror Coat, which can potentially OHKO Tapu Koko, considering Suicune survives their attack first. However, this isn't recommended in every team due to the popularity of Z-Moves, many of which OHKOing Suicune.</li> <li>Chesto Berry + Rest has always been a popular strategy due to Suicune's lack of recovery options and could be viable once Tailwind is set up for fast recovery. The only risk in using this set is that this is a one-time strategy, and it puts Suicune at a major disadvantage if used for a second time.</li> <li>Last but not least, Roar can be used to counter Trick Room teams and to phaze setup strategies like Extreme Evoboost Eevee and Curse Snorlax.</li> </ul> <h1>Checks and Counters</h1> <p><strong>Electric-types</strong>: Popular Electric-type Pokemon like Tapu Koko and Zapdos can easily KO Suicune with their STAB moves, and Suicune isn't able to do much damage to them, and it must rely on Tailwind for a Speed advantage.</p> <p><strong>Grass-types: Powerful Grass-type Pokemon like Tapu Bulu, Kartana, Ferrothorn, and Venusaur can KO Suicune with Grass-type moves and should be handled with caution.</p> <p><strong>Bulky Steel-types: Bulky Steel-type Pokemon like Celesteela and Aegislash wall Suicune with their bulk, and they can stall it out with Leech Seed and Toxic, respectively.</p> <p><strong>Z-Moves: Like most of the Pokemon, Suicune is vulnerable to powerful Z-Moves, like Tapu Lele's Shattered Psyche and Tapu Koko's Gigavolt Havoc, and is usually OHKOed by them.</p>",
    "sets": {
      "Tailwind Offense": {
        "description": "<h1>Moves</h1> <ul> <li>Tailwind is Suicune's primary asset that differs it from other popular Water-type Pokemon. It is Suicune's main form of speed control, allowing its teammates to outspeed and KO opposing threats efficiently.</li> <li>Snarl is used for disruption, weakening the opponent's special attackers, like Tapu Koko and Tapu Lele. This comes in handy when Tailwind ends, as Suicune can set it up again with minimal consequence. Protect can be used in this slot as well to scout for incoming Z-Moves.</li> <li>Ice Beam serves as a way to OHKO Mega Salamence and Landorus-T and also deals a decent amount of damage to Grass-type Pokemon like Tapu Bulu. Icy Wind can be used in this slot for additional speed control, although it's not necessary.</li> <li>Scald serves as Suicune's only STAB move in this set and can be used to either fish for the 30% burn chance or to greatly damage Fire-type Pokemon like Heatran.</li> </ul> <h1>Set Details</h1> <ul> <li>244 EVs are invested in HP to maximize bulk, which allows Suicune to survive Timid Tapu Koko's Thunderbolt in Electric Terrain. Using 244 EVs instead of 252 also ensures that Sitrus Berry activates once Suicune's HP reduces to half of its maximum HP.</li> <li>116 Special Attack EVs with a Modest nature ensure that Suicune OHKOes 4 HP Mega Salamence 100% of the time with Ice Beam.</li> <li>28 EVs are invested in Speed to outspeed Adamant maximum Speed Landorus-T once Tailwind is set up (20 EVs do the same job). The set also Speed creeps Pokemon that are EV trained to outspeed Choice Scarf Landorus-T.</li> <li>Sitrus Berry is used as the held item to further increase Suicune's longevity, which often comes in handy, as it allows the player to set up a second Tailwind if needed.</li> <li>244 HP EVs and 92 Defense EVs guarantee that Suicune has a 99.6% chance to survive two of Jolly Mega Salamence's Double-Edges after Sitrus Berry recovery.</li> <li>Similarly, 244 HP EVs and 28 Special Defense EVs ensure that Modest Tapu Lele's Psychic in Psychic Terrain is a 2HKO 97.7% of the time after Sitrus Berry recovery.</li> <li>Rocky Helmet can be used to deal some residual damage to physical attackers like Mega Kangaskhan and Mega Salamence.</li> <li>This set is ran with a Modest nature to secure some OHKOs, as listed above. The offensive EVs combined with a Modest nature deal decent damage to Mega Kangaskhan as well.</li> <li>Alternatively, a Bold nature can be run with an EV spread of 244 HP / 4 Def / 212 SpA / 28 SpD / 20 Spe, which makes Jolly Mega Salamence's Double-Edge a guaranteed 3HKO after Sitrus Berry recovery.</li> </ul> <h1>Usage Tips</h1> <ul> <li>Suicune is used as a support Pokemon primarily and can switch to a more offensive playstyle once Tailwind is set up.</li> <li>It is often advisable to switch Suicune into an incoming Fake Out from Mega Kangaskhan to take maximum advantage of Rocky Helmet. Similarly, Suicune can be safely switched into Ice- and Water-type moves to regain some momentum.</li> <li>Thanks to being a bulky Water-type Pokemon, Suicune does well against rain teams and can either set up Tailwind or use Snarl to weaken their offense.</li> <li>The primary strategy when using Suicune is to try and set up Tailwind. Once succeeded, it can give your Pokemon enormous momentum.</li> <li>Snarl is recommended if Suicune can't hit anything for decent damage, as it helps weaken the foes.</li> </ul> <h1>Team Options</h1> <ul> <li>Suicune is often paired with Mega Kangaskhan, as the latter gives Suicune Fake Out support, and does well once Tailwind is set up, easily OHKOing threats like Terrakion and Landorus-T.</li> <li>Tapu Lele makes a great partner to Suicune, as Psychic Terrain helps block opposing Fake Out and Prankster Taunt. Non-Choice Scarf Tapu Lele appreciates speed control to outspeed faster Pokemon like Choice Scarf Landorus-T. This also enables Suicune to use Psychic Seed, which boosts Suicune's Special Defense, allowing it to tank hits like special Gigavolt Havoc. This strategy almost always allows Suicune to set up a Tailwind, after which the duo can demolish opposing teams.</li> <li>Like previous formats, Breloom can be used with Suicune to use fast Spores, which is usually a reliable way to shut down Trick Room strategies. However, one has to be careful when facing Tapu Koko or Tapu Fini, as Misty Terrain and Electric Terrain prevent grounded Pokemon from being put to sleep.</li> <li>Tapu Bulu also works here, as it easily OHKOes popular Water-type Pokemon like Tapu Fini, which otherwise completely wall Suicune.</li> <li>Middling Speed Pokemon like Sylveon benefit from Tailwind's Speed boost, allowing them to spam strong moves, which deals massive damage to opposing Pokemon.</li> <li>Fire-type Pokemon like Heatran and Charizard can work well with Suicune, as they take out Grass-types, which usually threaten it.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "Mr.GX", "user_id": 239881}], "teams": [{"name": "Quality checked by", "members": [{"username": "Psynergy", "user_id": 248085}, {"username": "Demantoid", "user_id": 264687}]}, {"name": "Grammar checked by", "members": [{"username": "Kris", "user_id": 241023}]}]}
  },
  "Pelipper": {
    "overview": "<p>Pelipper's stats are very mediocre, but the addition of Drizzle has made it into a much more reasonable threat. With a STAB Hurricane, Pelipper excels over Politoed as an offensive rain setter that is capable of hitting Grass-types hard, which have traditionally given rain teams problems. It also has access to Tailwind, providing great offensive support. However, Pelipper completely relies on Drizzle to function, becoming much easier to deal with when the weather is changed. It also has a 4x weakness to Electric, which when combined with its stats, make it have a hard time running a bulky set compared to Politoed.</p> <p>Below is a sample set. This set is likely to be the standard, but it will be expanded upon and updated as the metagame progresses.</p>",
    "sets": {
      "Offensive Rain Support": {
        "description": "<ul> <li>Hurricane is an excellent STAB attack under the rain, perfect for dealing serious damage to Grass-types.</li> <li>Scald is a reliable Water-type attack to use, but Hydro Pump deals much more damage.</li> <li>Tailwind is an excellent speed control move, and ensures that your Swift Swim partner won't be the only fast teammate.</li> <li>Although hard to fit in, Wide Guard can be useful for blocking spread attacks such as Rock Slide.</li> <li>Focus Sash will usually ensure Pelipper gets Tailwind up, and gets around its iffy special bulk. Despite the low Speed stat, maximizing it lets Pelipper take advantage of Tailwind.</li> <li>If you see Charizard or slower weather changes such as Tyranitar or Torkoal in team preview, consider putting Pelipper in the back, since the removal of the rain makes Pelipper much easier to deal with.</li> <li>Swift Swim teammates should almost always be considered, with the two most common choices being Kingdra and Ludicolo.</li> <li>Pelipper's rain setting powers make it a great teammate for Pokemon that are weak to Fire, such as Steel-type Pokemon.</li> <li>Lightning Rod support can come in handy against Electric-types, though note that some such as Tapu Koko may carry Discharge to get around this.</li> <li>Consider packing some anti Trick Room measures, since they can make Tailwind backfire.</li> <li>Since Pelipper has a Ground-type immunity, pairing it with users of Earthquake is a good idea to consider.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "Theorymon", "user_id": 29010}], "teams": [{"name": "Quality checked by", "members": [{"username": "Demantoid", "user_id": 264687}]}]}
  }
}