{
  "Gallade": {"sets": [{"name": "Offensive Support"}]},
  "Tapu Koko": {"sets": [{"name": "Z-Move"}, {"name": "Assault Vest"}]},
  "Tapu Lele": {"sets": [{"name": "Choice Scarf"}]},
  "Tapu Fini": {"sets": [{"name": "Support"}]},
  "Venusaur": {"sets": [{"name": "Offensive Chlorophyll"}]},
  "Gengar": {"sets": [{"name": "Trapper"}, {"name": "Perish Trapper"}]},
  "Kangaskhan": {
    "overview": "<p>Thanks to its excellent respectable base 125 Attack combined with powerful moves like Double-Edge and Low Kick, Mega Kangaskhan establishes itself as a potent attacker in VGC 2019. Additionally, its access to the fastest viable Fake Out, as well as other utility moves like Roar and Sucker Punch, let it be a great supportive presence. Arguably, Mega Kangaskhan’s best tool comes in the form of Bite, which offers an absurd 51% flinch rate when combined with the second hit from Parental Bond. Additionally, Scrappy in its base forme, as well as Bite and Sucker Punch, allows it to put pressure on Ghost-types like Lunala and Mega Gengar. Mega Kangaskhan is commonly paired with Xerneas to assist in setting up with Geomancy, and Primal Groudon, which appreciates the support in order to freely use its full power Eruption, thanks to flinches from Fake Out and Bite. Mega Kangaskhan often prefers to lead into games with a supportive partner like Tornadus to grab early-game momentum with Fake Out and Tailwind. While powerful, Mega Kangaskhan still struggles with Steel-types like Mega Metagross, Stakataka, and Ferrothorn if lacking Low Kick. Other faster Pokemon such as Mega Salamence, Ultra Necrozma, and Mega Rayquaza can all outspeed and put instant pressure on it. Mega Kangaskhan is also quite weak to Intimidate, as it drastically reduces its damage output, often forcing the user to play for Bite flinches and rely on luck to keep an advantage.</p> ",
    "sets": [
      {
        "name": "Fast Attacker",
        "description": "<p>Fake Out's guaranteed flinch gives Mega Kangaskhan's partners more time to set up. STAB Double-Edge deals strong consistent damage making use of Parental Bond, letting Mega Kangaskhan 2HKO Pokemon like Xerneas and Primal Kyogre. Bite forces the opponent to respect the possibility of being flinched every turn while the user is often inclined to play for it. Low Kick allows Mega Kangaskhan to OHKO Pokemon like Stakataka as well as chunk Incineroar, Ferrothorn, and Primal Kyogre without the recoil from Double-Edge. Sucker Punch is an alternative to Low Kick as it lets Mega Kangaskhan get the jump on faster Ghost-types like Mega Gengar as well as enabling it to take out any low HP targets before they can move. Roar lets Mega Kangaskhan force out Trick Room setters and boosted Xerneas. Mega Kangaskhan always wants to invest in Speed first, as it naturally outruns common restricted Pokemon like Xerneas and Yveltal at maximum Speed, while also giving it the fastest Bite possible. Scrappy lets Kangaskhan utilize Fake Out on Ghost-types before Mega Evolving, allowing it to hit Pokemon like Lunala and Mimikyu as well as break Shadow Shield and Disguise.</p> <p>Mega Kangaskhan is often paired with Xerneas to enable it to set up with Geomancy with Fake Out and Bite while pressuring Steel-types like Stakataka with an OHKO from Low Kick. Mega Kangaskhan also is paired with strong spread attackers like Primal Kyogre and Primal Groudon which can opt for a fatal Water Spout and Eruption. It is commonly led with Pokemon that can utilize speed control like Tornadus and Whimsicott so they can grab momentum early on and sweep with powerful restricted Pokemon in the back. This lets Mega Kangaskhan do its job as effectively as possible, as it allows it to lead and grab momentum for a team in comparison to making it a solely offensive juggernaut reserved in the back for late-game.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 501951, "username": "zeefable"}, {"user_id": 517038, "username": "Giokio"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Estronic"}]}], "writtenBy": [{"user_id": 552835, "username": "TheKingVillager"}]}
  },
  "Ditto": {"sets": [{"name": "Imposter"}]},
  "Aerodactyl": {"sets": [{"name": "Offensive Support"}]},
  "Snorlax": {"sets": [{"name": "Belly Drum"}]},
  "Crobat": {"sets": [{"name": "Tailwind Support"}]},
  "Jumpluff": {"sets": [{"name": "Chlorophyll Support"}]},
  "Umbreon": {"sets": [{"name": "Support"}]},
  "Smeargle": {"sets": [{"name": "Utility"}]},
  "Ho-Oh": {"sets": [{"name": "Offensive Tailwind"}]},
  "Shedinja": {"sets": [{"name": "Wonder Guard Wall"}]},
  "Mawile": {"sets": [{"name": "Offensive"}]},
  "Medicham": {"sets": [{"name": "All-out Attacker"}]},
  "Salamence": {"sets": [{"name": "Tailwind"}]},
  "Metagross": {"sets": [{"name": "Offensive"}]},
  "Kyogre": {"sets": [{"name": "Special Attacker"}]},
  "Groudon": {
    "overview": "<p>Primal Groudon is an insanely threatening Pokemon in VGC 2019 largely thanks to its superb offensive typing and high attacking stats coupled with its only weakness to Ground thanks to Desolate Land and solid natural bulk, making it both a force to be reckoned with offensively and a behemoth to remove defensively. Its access to two excellent spread moves, Precipice Blades and Eruption, make it capable of being a physical or special attacking powerhouse. Primal Groudon also acts as one of the best Xerneas checks in the metagame, since it resists its Fairy-type attacks and can threaten back with Precipice Blades, Fire Punch, or Overheat. Ironically enough, it's also one of the best Xerneas enablers in the metagame, as it pressures every Steel-type, as well as Amoonguss and Incineroar, all of which are sizeable roadblocks for Xerneas. However, its dominance is actually one of its biggest drawbacks, as using Primal Groudon results in playing a lot of mirror matches where games can be decided entirely on EV spreads or which player has an active Tailwind. The player must also be vigilant to win the weather war against Primal Kyogre because any Water-type attack is going to have no trouble OHKOing Primal Groudon. Dragon-types and faster special attackers such as Mega Salamence, Mega Rayquaza, Lunala, and Ultra Necrozma also match fairly well against it, as they can either wall it outright or deal devastating blows before it gets to move.</p> ",
    "sets": [
      {
        "name": "Bulky Physical Attacker",
        "description": "<p>Precipice Blades is Primal Groudon's best Ground STAB move, as the potential damage output is too high to consider more accurate moves with lower payoff such as Earthquake and Stomping Tantrum. It's powerful enough to OHKO Tapu Koko at -1 Attack and specially defensively Incineroar otherwise. Fire Punch serves as a more reliable STAB option that's capable of OHKOing Grass- and Steel-types such as Amoonguss, Mega Metagross, and Kartana under Desolate Land. Swords Dance allows Primal Groudon to boost its already sky-high Attack to insane levels, letting it OHKO Xerneas with +2 Fire Punch and counteract Intimidate. Dragon Claw is a good coverage option for Mega Salamence and Mega Rayquaza, which would otherwise wall it. Substitute allows Primal Groudon to block Intimidate and Spore while also giving it more freedom to attack, as it can safely sponge a hit from Primal Kyogre or opposing Primal Groudon that it would not have been able to otherwise. 108 HP and 252 Special Defense EVs guarantee that Primal Groudon will always survive an Earth Power from opposing Modest Primal Groudon, while 148 Attack EVs let Primal Groudon always OHKO 4 HP Mega Rayquaza at -1 Defense with Dragon Claw.</p> <p>Bulky Primal Groudon typically plays games at a slower pace because it isn't sweeping everything in a matter of turns, so pairing it with Pokemon like Incineroar, Tapu Fini, and Amoonguss, which thrive in this playstyle, is advised. A Pokemon to help with the Primal Groudon mirror match is advised, usually in the form of Mega Salamence or Groundium Z Landorus-T + Mega Gengar, as the former can wall it outright, while the latter can trap and remove it with Tectonic Rage. Primal Groudon is a great partner for Xerneas and Ultra Necrozma, as it can remove Incineroar, Mega Metagross, and Celesteela.</p> "
      },
      {
        "name": "Special Attacker",
        "description": "<p>Eruption is Primal Groudon's best way to deal damage quickly, 2HKOing anything that doesn't resist Fire when at full power. Earth Power complements Eruption by hitting common Fire-resistant Pokemon like Incineroar and opposing Primal Groudon, but it's important to chip Incineroar into KO range; otherwise, its 50% Berry will be activated should it be holding one. Overheat is another extremely powerful Fire-type STAB move Primal Groudon makes perfect use of, as it can OHKO Xerneas before it boosts with Geomancy and isn't reliant on its remaining HP unlike Eruption. Roar trades the attacking option to be a one-time check to boosted Xerneas, as it can take the Moonblast and then phaze it. Protect is necessary for conserving HP and keeping Primal Groudon safe from faster attackers for a turn, including Z-Move users like Lunala and Ultra Necrozma. Hidden Power Ice has limited usefulness, but it is justifiable for hitting Mega Salamence and Mega Rayquaza. A Timid nature with 252 Speed EVs is generally preferred to be as fast as possible, ensuring you Speed tie at worst with opposing Primal Groudon, but running Modest nets a guaranteed OHKO on 4 HP Xerneas with Overheat, as well as way better rolls on bulky Primal Groudon with Earth Power.</p> <p>Because special attacking Primal Groudon focuses on Speed and power rather than bulk, it plays better on fast-paced teams that match its tempo. This is typically in the form of Mega Kangaskhan and Tornadus, which open games fast with Fake Out and Tailwind to get the ball rolling. Mega Salamence can also be a great partner for it, as it checks opposing Primal Groudon. Xerneas and Ultra Necrozma enjoy its ability to threaten Steel-types, though the latter prefers physical Primal Groudon more often due to it matching up better against Incineroar.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 552835, "username": "TheKingVillager"}, {"user_id": 294287, "username": "Raineko"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Estronic"}]}], "writtenBy": [{"user_id": 501951, "username": "zeefable"}]}
  },
  "Rayquaza": {"sets": [{"name": "Swords Dance"}, {"name": "Mixed Attacker"}]},
  "Lopunny": {"sets": [{"name": "Offensive"}]},
  "Lucario": {"sets": [{"name": "Offensive"}]},
  "Palkia": {"sets": [{"name": "Offensive Trick Room"}]},
  "Whimsicott": {"sets": [{"name": "Tailwind Support"}]},
  "Amoonguss": {"sets": [{"name": "Support"}, {"name": "TurboShroom"}]},
  "Ferrothorn": {"sets": [{"name": "Leech Seed"}]},
  "Tornadus": {"sets": [{"name": "Tailwind"}]},
  "Landorus-Therian": {"sets": [{"name": "Offensive"}]},
  "Xerneas": {"sets": [{"name": "Geomancy"}]},
  "Yveltal": {"sets": [{"name": "Assault Vest"}, {"name": "Offensive"}]},
  "Incineroar": {
    "overview": "<p>Incineroar is the peak of utility in VGC 2019. It frequently finds its way onto any and every team composition, as it is blessed with an insane toolkit of Fake Out, Intimidate, U-turn, and Roar, providing so much for so little opportunity cost. Incineroar is the perfect Pokemon to enable VGC 2019's top threats, supporting Xerneas with Fake Out and Intimidate, pivoting in and out to help Primal Kyogre win the weather war against Primal Groudon, or using Roar on an opposing Xerneas to stop its sweep. What Incineroar does best, though, is making sure matches aren't just outmuscling your opponent, since its toolkit naturally requires games to play at a slower pace. The importance of Intimidate cannot be understated, as VGC 2019 is full of strong physical attackers like Mega Rayquaza, Primal Groudon, and Mega Salamence; as such, it is often momentum-shifting to turn an OHKO from one of these juggernauts into a 2HKO. It also adds a key Ghost resistance to many teams looking to improve their matchups against Lunala and Mega Gengar, as well as Fire-type coverage to ensure that any team can hit Ferrothorn and Celesteela. However, Incineroar is not without flaws; notably, its typing gives it two detrimental weaknesses to Ground and Water, meaning it matches up negatively against both Primal Kyogre and Primal Groudon. Additionally, it has to invest heavily in Special Defense if it wants to take on Xerneas, meaning Incineroar's offensive presence—and overall performance—are typically only as good as the Pokemon it enables.</p> ",
    "sets": [
      {
        "name": "Utility",
        "description": "<p>Fake Out lets Incineroar flinch a threatening foe to secure its partner a safe turn. Flare Blitz is Incineroar's main attacking option, which heavily damages Amoonguss, Kartana, and Mega Metagross. U-turn lets it pivot out and come back in later in the game for additional Intimidate and Fake Out support. Knock Off balances power with utility, as it hits decently hard while removing items from foes, namely Figy Berry and the rest of the 50% recovery Berries. Snarl works well for lowering the damage output of special attackers like Lunala, Ultra Necrozma, and Tapu Koko. 236 HP and Special Defense EVs let Incineroar always survive Xerneas's +2 Moonblast, allowing Incineroar to phaze it with Roar or threaten it offensively with Flare Blitz. If using Assault Vest, an EV spread of 252 HP / 164 Atk / 92 SpD should be used instead, as it cleanly survives +2 Moonblast while also taking Origin Pulse from standard Primal Kyogre in rain.</p> <p>It is not a stretch to say that Incineroar can fit on every team composition in the metagame; its toolkit is just that valuable for any archetype, as Primal Groudon and Primal Kyogre appreciate its pivoting to help win weather wars, Xerneas and Mega Rayquaza have a much easier time setting up with Fake Out and Intimidate support, and Lunala and Ultra Necrozma get a switch-in to Menacing Moonraze Maelstrom or Light That Burns the Sky for the mirror matchups. One important usage tip is that Incineroar very much likes to pivot in and out of the battlefield often, so only stay in and attack with moves not U-turn or Fake Out when absolutely necessary.</p> "
      },
      {
        "name": "Incinium Z",
        "description": "<p>Fake Out grabs momentum, as it grants Incineroar's partner a safer turn to attack or set up. Darkest Lariat is required for Malicious Moonsault, Incineroar's signature Z-Move, which can OHKO Lunala and Ultra Necrozma at -1 Attack. Darkest Lariat also has the benefit of outdamaging Knock Off against Mega Evolved Pokemon, Z-Move users, Primal Kyogre, and Primal Groudon. U-turn lets Incineroar safely pivot to partners that can more appropriately handle the current situation, being particularly useful for weather wars, bringing in Steel-types on Xerneas, or additional Intimidate support against Primal Groudon. Flare Blitz hits Ferrothorn, Kartana, and Xerneas, while Roar lets Incineroar force out Geomancy-boosted Xerneas and Trick Room users like Stakataka and Lunala. 156 Attack EVs and an Adamant nature always let Incineroar OHKO Lunala at -1 with Malicious Moonsault, while 252 HP and 100 Special Defense EVs allow it to survive standard Xerneas's Dazzling Gleam.</p> <p>Since Incineroar invests offensively to be an effective Z-Move user, it loses out on the relevant Special Defense investment to make it a solid Xerneas check. Because of this, it should be paired with Pokemon such as bulky Primal Groudon, Haze Tapu Fini, and Stakataka, which all give Xerneas a hard time. It also loses to both Primal Groudon and Primal Kyogre, and it is frequently paired with Mega Salamence and Kartana as a result. It can also work on Kyogre-based teams, but it is advised to pair it with Mega Metagross and a second source of Fairy resistance, which is still a solid enough means of checking Xerneas.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 552835, "username": "TheKingVillager"}, {"user_id": 294287, "username": "Raineko"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 501951, "username": "zeefable"}]}
  },
  "Mimikyu": {"sets": [{"name": "Offensive Trick Room"}]},
  "Kommo-o": {"sets": [{"name": "Clangorous Soulblaze"}]},
  "Solgaleo": {"sets": [{"name": "Trick Room"}]},
  "Lunala": {"sets": [{"name": "Utility"}, {"name": "Trick Room"}, {"name": "Psych Up"}]},
  "Nihilego": {"sets": [{"name": "Rockium Z"}]},
  "Celesteela": {"sets": [{"name": "Offensive Leech Seed"}]},
  "Kartana": {"sets": [{"name": "Grassium Z"}]},
  "Necrozma-Dusk-Mane": {"sets": [{"name": "Ultra Necrozma"}, {"name": "Trick Room"}]},
  "Necrozma-Dawn-Wings": {"sets": [{"name": "Ultra Necrozma"}]},
  "Stakataka": {"sets": [{"name": "Trick Room Support"}, {"name": "Offensive"}]}
}