{
  "Gallade": {"sets": [{"name": "Offensive Support"}]},
  "Tapu Koko": {"sets": [{"name": "Z-Move"}, {"name": "Assault Vest"}]},
  "Tapu Lele": {"sets": [{"name": "Choice Scarf"}]},
  "Tapu Fini": {"sets": [{"name": "Support"}]},
  "Venusaur": {"sets": [{"name": "Offensive Chlorophyll"}]},
  "Gengar": {"sets": [{"name": "Trapper"}, {"name": "Perish Trapper"}]},
  "Kangaskhan": {"sets": [{"name": "Utility"}]},
  "Ditto": {"sets": [{"name": "Imposter"}]},
  "Aerodactyl": {"sets": [{"name": "Offensive Support"}]},
  "Snorlax": {"sets": [{"name": "Belly Drum"}]},
  "Crobat": {"sets": [{"name": "Tailwind Support"}]},
  "Jumpluff": {"sets": [{"name": "Chlorophyll Support"}]},
  "Umbreon": {"sets": [{"name": "Support"}]},
  "Smeargle": {"sets": [{"name": "Utility"}]},
  "Ho-Oh": {"sets": [{"name": "Offensive Tailwind"}]},
  "Shedinja": {"sets": [{"name": "Wonder Guard Wall"}]},
  "Mawile": {"sets": [{"name": "Offensive"}]},
  "Medicham": {"sets": [{"name": "All-out Attacker"}]},
  "Salamence": {"sets": [{"name": "Tailwind"}]},
  "Metagross": {"sets": [{"name": "Offensive"}]},
  "Kyogre": {"sets": [{"name": "Special Attacker"}]},
  "Groudon": {"sets": [{"name": "Special Attacker"}, {"name": "Physical Attacker"}]},
  "Rayquaza": {"sets": [{"name": "Swords Dance"}, {"name": "Mixed Attacker"}]},
  "Lopunny": {"sets": [{"name": "Offensive"}]},
  "Lucario": {"sets": [{"name": "Offensive"}]},
  "Palkia": {"sets": [{"name": "Offensive Trick Room"}]},
  "Whimsicott": {"sets": [{"name": "Tailwind Support"}]},
  "Amoonguss": {"sets": [{"name": "Support"}, {"name": "TurboShroom"}]},
  "Ferrothorn": {"sets": [{"name": "Leech Seed"}]},
  "Tornadus": {"sets": [{"name": "Tailwind"}]},
  "Landorus-Therian": {"sets": [{"name": "Offensive"}]},
  "Xerneas": {"sets": [{"name": "Geomancy"}]},
  "Yveltal": {"sets": [{"name": "Assault Vest"}, {"name": "Offensive"}]},
  "Incineroar": {
    "overview": "<p>Incineroar is the peak of utility in VGC 2019. It frequently finds its way onto any and every team composition, as it is blessed with an insane toolkit of Fake Out, Intimidate, U-turn, and Roar, providing so much for so little opportunity cost. Incineroar is the perfect Pokemon to enable VGC 2019's top threats, supporting Xerneas with Fake Out and Intimidate, pivoting in and out to help Primal Kyogre win the weather war against Primal Groudon, or using Roar on an opposing Xerneas to stop its sweep. What Incineroar does best, though, is making sure matches aren't just outmuscling your opponent, since its toolkit naturally requires games to play at a slower pace. The importance of Intimidate cannot be understated, as VGC 2019 is full of strong physical attackers like Mega Rayquaza, Primal Groudon, and Mega Salamence; as such, it is often momentum-shifting to turn an OHKO from one of these juggernauts into a 2HKO. It also adds a key Ghost resistance to many teams looking to improve their matchups against Lunala and Mega Gengar, as well as Fire-type coverage to ensure that any team can hit Ferrothorn and Celesteela. However, Incineroar is not without flaws; notably, its typing gives it two detrimental weaknesses to Ground and Water, meaning it matches up negatively against both Primal Kyogre and Primal Groudon. Additionally, it has to invest heavily in Special Defense if it wants to take on Xerneas, meaning Incineroar's offensive presence—and overall performance—are typically only as good as the Pokemon it enables.</p> ",
    "sets": [
      {
        "name": "Utility",
        "description": "<p>Fake Out lets Incineroar flinch a threatening foe to secure its partner a safe turn. Flare Blitz is Incineroar's main attacking option, which heavily damages Amoonguss, Kartana, and Mega Metagross. U-turn lets it pivot out and come back in later in the game for additional Intimidate and Fake Out support. Knock Off balances power with utility, as it hits decently hard while removing items from foes, namely Figy Berry and the rest of the 50% recovery Berries. Snarl works well for lowering the damage output of special attackers like Lunala, Ultra Necrozma, and Tapu Koko. 236 HP and Special Defense EVs let Incineroar always survive Xerneas's +2 Moonblast, allowing Incineroar to phaze it with Roar or threaten it offensively with Flare Blitz. If using Assault Vest, an EV spread of 252 HP / 164 Atk / 92 SpD should be used instead, as it cleanly survives +2 Moonblast while also taking Origin Pulse from standard Primal Kyogre in rain.</p> <p>It is not a stretch to say that Incineroar can fit on every team composition in the metagame; its toolkit is just that valuable for any archetype, as Primal Groudon and Primal Kyogre appreciate its pivoting to help win weather wars, Xerneas and Mega Rayquaza have a much easier time setting up with Fake Out and Intimidate support, and Lunala and Ultra Necrozma get a switch-in to Menacing Moonraze Maelstrom or Light That Burns the Sky for the mirror matchups. One important usage tip is that Incineroar very much likes to pivot in and out of the battlefield often, so only stay in and attack with moves not U-turn or Fake Out when absolutely necessary.</p> "
      },
      {
        "name": "Incinium Z",
        "description": "<p>Fake Out grabs momentum, as it grants Incineroar's partner a safer turn to attack or set up. Darkest Lariat is required for Malicious Moonsault, Incineroar's signature Z-Move, which can OHKO Lunala and Ultra Necrozma at -1 Attack. Darkest Lariat also has the benefit of outdamaging Knock Off against Mega Evolved Pokemon, Z-Move users, Primal Kyogre, and Primal Groudon. U-turn lets Incineroar safely pivot to partners that can more appropriately handle the current situation, being particularly useful for weather wars, bringing in Steel-types on Xerneas, or additional Intimidate support against Primal Groudon. Flare Blitz hits Ferrothorn, Kartana, and Xerneas, while Roar lets Incineroar force out Geomancy-boosted Xerneas and Trick Room users like Stakataka and Lunala. 156 Attack EVs and an Adamant nature always let Incineroar OHKO Lunala at -1 with Malicious Moonsault, while 252 HP and 100 Special Defense EVs allow it to survive standard Xerneas's Dazzling Gleam.</p> <p>Since Incineroar invests offensively to be an effective Z-Move user, it loses out on the relevant Special Defense investment to make it a solid Xerneas check. Because of this, it should be paired with Pokemon such as bulky Primal Groudon, Haze Tapu Fini, and Stakataka, which all give Xerneas a hard time. It also loses to both Primal Groudon and Primal Kyogre, and it is frequently paired with Mega Salamence and Kartana as a result. It can also work on Kyogre-based teams, but it is advised to pair it with Mega Metagross and a second source of Fairy resistance, which is still a solid enough means of checking Xerneas.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 552835, "username": "TheKingVillager"}, {"user_id": 294287, "username": "Raineko"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 501951, "username": "zeefable"}]}
  },
  "Mimikyu": {"sets": [{"name": "Offensive Trick Room"}]},
  "Kommo-o": {"sets": [{"name": "Clangorous Soulblaze"}]},
  "Solgaleo": {"sets": [{"name": "Trick Room"}]},
  "Lunala": {"sets": [{"name": "Utility"}, {"name": "Trick Room"}, {"name": "Psych Up"}]},
  "Nihilego": {"sets": [{"name": "Rockium Z"}]},
  "Celesteela": {"sets": [{"name": "Offensive Leech Seed"}]},
  "Kartana": {"sets": [{"name": "Grassium Z"}]},
  "Necrozma-Dusk-Mane": {"sets": [{"name": "Ultra Necrozma"}, {"name": "Trick Room"}]},
  "Necrozma-Dawn-Wings": {"sets": [{"name": "Ultra Necrozma"}]},
  "Stakataka": {"sets": [{"name": "Trick Room Support"}, {"name": "Offensive"}]}
}