{
  "Tapu Lele": {
    "overview": "<p>When compared to the myriad of other Psychic-type wallbreakers like Mega Alakazam and Mega Latios, Tapu Lele sets itself apart from them thanks to its unique ability, Psychic Surge, and its punishing nature as a wallbreaker. Combined with its solid offensive stats and typing, Tapu Lele is a truly menacing wallbreaker that is very devastating to deal with for defensively oriented teams, as it can overwhelm Psychic-resistant Pokemon like Equilibra, Heatran, and Ferrothorn rather quickly. On the other hand, when holding a Choice Scarf, Tapu Lele has an excellent matchup against more offensive teams. However, Choice item sets are often reliant on prediction, as their tendency to spam Psychic-type moves leaves them open to Pursuit trappers like Mega Tyranitar and Weavile. Furthermore, Tapu Lele's average bulk and Speed tier leave it vulnerable to common Pokemon like Jumbao and Pajantom and also make it hard to consistently find opportunities to switch in.</p> ",
    "comments": "<h1>Other Options</h1> <p>Metronome is an option that can be run alongside another Z-Move user. Taunt can be run to deal with Trick Room teams reliably, but Tapu Lele's superior matchup against balanced teams with Calm Mind often overshadows this option.</p> <h1>Checks and Counters</h1> <p><strong>Steel-types</strong>: Steel-types like Celesteela, Jirachi, and Magearna are relatively unbothered by anything Tapu Lele can throw at them because they're not hit super effectively by Fighting-type moves. However, Celesteela and Jirachi take quite a lot from Choice Specs-boosted Hidden Power Fire. Other Steel-types such as Ferrothorn and Heatran can take an unboosted Focus Blast and Hidden Power Fire, respectively, and retaliate. Bulletproof Equilibra is immune to Focus Blast and commonly runs Protect for All-Out Pummeling. However, it can quickly be overwhelmed by Choice Specs sets.</p> <p><strong>Faster Pokemon: Tapu Lele is very susceptible to being revenge killed by faster Pokemon due to its relatively underwhelming bulk and Speed tier, being outsped by Pokemon such as Mega Alakazam, Mega Crucibelle, Pajantom, and Greninja. Choice Scarf variants will still be outrun by Choice Scarf Kartana, Greninja, and Kitsunoh.</p> <p><strong>Dark-types: Dark-types like Weavile, Mega Tyranitar, Ash-Greninja, and Colossoil can punish Tapu Lele that are locked into Psychic-type attacks. Particularly, Weavile, Mega Tyranitar, and Colossoil can Pursuit trap Tapu Lele, ensuring that it is KOed. However, they struggle against Calm Mind variants of Tapu Lele because they can switch up moves.</p> <p><strong>Specially Defensive Walls: Tangrowth can comfortably scout Choice Specs and Choice Scarf Tapu Lele without being punished too much thanks to Regenerator, while Chansey is relatively unfazed by Choice Scarf variants, but it is still susceptible to Choice Specs-boosted Psyshock. Both have to be wary of Calm Mind variants, however, which can use them as bait.</p> ",
    "sets": [
      {
        "name": "Choice Specs",
        "description": "<h1>Moves</h1> <p>Although having both Psychic and Psyshock on the set may look weird, they serve vastly different purposes. Notably, Psychic deals insane amounts of damage to Pokemon like Landorus-T, while Psyshock can 3HKO specially defensive Steel-types like Celesteela, Heatran, and Magearna and 2HKO Chansey. Hidden Power Fire does a lot to other Steel-types like Ferrothorn, while being more reliable than Focus Blast. Additionally, Focus Blast's ability to break through Heatran isn't really needed with Psyshock already doing a lot to it.</p> <h1>Set Details</h1> <p>Choice Specs turns Tapu Lele into a frightening wallbreaker that is capable of breaking through specially defensive Steel-types with the sheer force behind its Psychic-type attacks. A Timid nature is run to outspeed Landorus-T as well as Aurumoth and Speed tie with Kyurem-B and opposing Tapu Lele.</p> <h1>Usage Tips</h1> <p>Tapu Lele has a very good matchup against bulkier teams, being capable of overwhelming traditional Psychic-type answers relatively easily. Against these types of teams, it should seek to pave the way for another teammate early- to mid-game with its Psychic-type attacks. However, it should be noted that bulkier teams commonly carry a combination of a Steel- and Dark-type Pokemon to pivot around Tapu Lele, so prediction is necessary. This is especially important if the opposition has a Pursuit trapper like Weavile or Mega Tyranitar, which can heavily punish Tapu Lele locked into one of its Psychic-type moves, so make sure to use Moonblast if they're predicted to switch in. In similar vein, if Tapu Lele does choose to lock itself into a Psychic-type move and the opponent doesn't switch in their Dark-type, it must switch out the next turn. Against more offensive teams, Tapu Lele can be used to take a hit from Pokemon like Choice Specs Greninja thanks to its decent Special Defense stat and retaliate.</p> <h1>Team Options</h1> <p>Pivots like Magearna, Tornadus-T, and Mega Crucibelle can bring Tapu Lele into play, as its generally lacking bulk leaves a lot to be desired when trying to switch in. Additionally, Tornadus-T tends to draw in passive Pokemon, which Tapu Lele can take advantage of, while Magearna and Mega Crucibelle appreciate Tapu Lele's ability to weaken Steel-types. Since Choice Specs Tapu Lele forces an absurd number of switches, Spikes support from Pokemon like Greninja, Ash-Greninja, Arghonaut, and Ferrothorn is optimal to maximize the benefit from this. Greninja can also lure and take out Pokemon like Celesteela and Magearna thanks to its wide movepool. Pokemon like Magnezone and Heatran, which can each pressure Steel-types very well, will enable Tapu Lele to play much more comfortably, not having to worry about using Hidden Power Fire as much as it would otherwise.</p> "
      },
      {
        "name": "Calm Mind",
        "description": "<h1>Moves</h1> <p>Psyshock in tandem with Calm Mind allows Tapu Lele to overwhelm Chansey, turning it into an effective stallbreaker. Focus Blast is run with Fightinium Z to heavily chunk Steel-types like Heatran and Ferrothorn. When backed up by a Calm Mind boost, All-Out Pummeling can even overwhelm weakened Steel-types that aren't weak to Fighting, such as Celesteela and Magearna. If Tapu Lele chooses to run Psychium Z instead of Fightinium Z, Hidden Power Fire should be used instead of Focus Blast to hit Ferrothorn reliably.</p> <h1>Set Details</h1> <p>Fightinium Z gives Tapu Lele access to a 190-Base Power All-Out Pummeling, allowing Tapu Lele to overwhelm Steel-types; additionally, it is much more reliable than having to hit Focus Blast against Heatran and Ferrothorn thanks to its improved accuracy. Psychium Z is an option instead of Fightinium Z, as it allows Tapu Lele to blow past Tangrowth while being almost as strong as All-Out Pummeling against Steel-types thanks to Psychic Surge. A Timid nature is preferred to outspeed Landorus-T and Speed tie with Kyurem-B and opposing Tapu Lele.</p> <h1>Usage Tips</h1> <p>Calm Mind should primarily be used to break through slow bulky teams that often leave opportunities for Tapu Lele to do so. Fightinium Z should be used to weaken Steel-types like Celesteela and Magearna for teammates like Mega Mawile and Mega Alakazam. Due to Tapu Lele's relative frailty, it should be brought in via VoltTurn support or aggressive switches. You can try to bluff a Choice item against teams with Dark- and Steel-types to surprise them with Moonblast and All-Out Pummeling, respectively. It should be noted that because Tapu Lele is not running a Choice item, it has the freedom to switch up moves, allowing it to attack what is in front of it, though it is still important to use the appropriate coverage move if a faster Pokemon like Weavile is anticipated to switch in.</p> <h1>Team Options</h1> <p>Pokemon like Mega Mawile, Mega Alakazam, Magearna, and Aurumoth appreciate Tapu Lele's ability to weaken Steel-types like Heatran, Ferrothorn, and Celesteela to ultimately sweep or break through the rest of the team. Pivots such as Tornadus-T and Mega Crucibelle, which also appreciate Tapu Lele's ability to weaken Steel-types, are particularly good partners to get Tapu Lele into play safely. It's particularly nice to pair Tapu Lele with Spikes setters like Ash-Greninja, Greninja, Ferrothorn, and Arghonaut, as Spikes heavily punish switches, which Tapu Lele will often force.</p> "
      },
      {
        "name": "Choice Scarf",
        "description": "<h1>Moves</h1> <p>Although Psyshock hits Chansey's weaker defense, it doesn't do enough, so Psychic is still preferred as a generally stronger option. Focus Blast hits Steel-types like Heatran and Ferrothorn. Nature's Madness allows Tapu Lele to chunk other Steel-types like Celesteela and Magearna, while Hidden Power Fire can be chosen for a more reliable option against Steel-types that take more damage from it like Ferrothorn and Kitsunoh.</p> <h1>Set Details</h1> <p>A Choice Scarf allows Tapu Lele to outspeed Pokemon like +1 Speed Aurumoth and Choice Scarf Landorus-T. Most notably, however, it massively improves Tapu Lele's matchup against offensive teams at the cost of its matchup against bulkier teams.</p> <h1>Usage Tips</h1> <p>Thanks to Choice Scarf, Tapu Lele is incredibly fast, allowing it to clean up easily against offensively inclined teams after some prior chip damage. However, be wary of locking yourself into Psychic if a Dark-type is present on the opposing team, as doing this will leave Tapu Lele susceptible, being unable to touch them. Instead, Tapu Lele should use coverage moves. Considering Tapu Lele's general lack of damage output from its Psychic-type moves, it's best to try and weaken Steel-types with Focus Blast, Nature's Madness, and Hidden Power Fire.</p> <h1>Team Options</h1> <p>Because of Tapu Lele's lacking damage output, it'll need Spikes support from Pokemon like Greninja, Ferrothorn, and Ash-Greninja to pick up KOes late-game. Considering that Choice Scarf Tapu Lele generally lacks the power to plow through Steel-types, Pokemon that can check them like Heatran are good teammates. Alternatively, you could even elect to use Mega Latios, which reliably checks Heatran and together with Tapu Lele can overwhelm Ferrothorn. In a similar vein, Magnezone can take care of Steel-types like Magearna and Ferrothorn. Another option is Mega Alakazam, particularly with Knock Off, as it can constantly wear down Steel-types and cripple them by removing their items.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 227784, "username": "snake_rattler"}, {"user_id": 208105, "username": "Jho"}, {"user_id": 298148, "username": "Mx"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "Lumari"}, {"user_id": 336073, "username": "Rabia"}]}], "writtenBy": [{"user_id": 395754, "username": "Jordy"}]}
  },
  "Pyroak": {
    "overview": "<p>With good bulk and access to reliable recovery in Synthesis, Pyroak is a decent defensive Pokemon in the metagame. Its Fire / Grass typing gives it resistances to common Steel-, Electric-, Grass-, and Fairy-type Pokemon like Magearna, Jumbao, Necturna, Ferrothorn, and Celesteela while also making it one of few reliable stops to Dragon Dance Naviathan, Krilowatt, Tapu Koko, Swords Dance Caribolt, and Mega Mawile.</p> <p>However, Pyroak is susceptible to every entry hazard, meaning it can be worn down quickly through repeated switches and can be troublesome to get into play. The weakness to Stealth Rock is particularly hazardous, as it significantly cuts into Pyroak's bulk and makes it much easier for Pokemon such as Colossoil and Hoopa-U to break through it. Furthermore, common Flying-, Rock-, and Poison-type attackers such as Tomohawk, Tornadus-T, Mega Tyranitar, and Mega Crucibelle can consistently force it out with their super effective attacks. Pyroak faces competition from Ferrothorn as a bulky Grass-type, which has an overall better defensive typing and offers Spikes. Finally, Pyroak fails to consistently set Stealth Rock due to the presence of Tornadus-T in the metagame.</p> ",
    "comments": "<h1>Other Options</h1> <p>Aromatherapy can be used to remove harmful status effects like burns and Toxic poison from teammates and Pyroak itself, but it generally struggles to find a moveslot for it. Will-O-Wisp is an option to spread burns to physical attackers much more reliably than Lava Plume, but it also competes with Pyroak's other moveslot heavily.</p> <h1>Checks and Counters</h1> <p><strong>Residual Damage</strong>: Stealth Rock deals heavy damage to Pyroak as it switches in, cutting into its survivability as a defensive Pokemon and making it much easier for attackers to OHKO or 2HKO it. Toxic also cuts into Pyroak's bulk by placing it on a timer, although it can be remedied through Aromatherapy.</p> <p><strong>Pajantom</strong>: Pajantom is completely immune to burns and poison from Pyroak thanks to Comatose, can disable Pyroak's recovery with Heal Block, and can trap it with Spirit Shackle, leaving Pyroak helpless to a Z-Move or Toxic damage.</p> <p><strong>Flying-types</strong>: Tomohawk and Tornadus-T can easily take Pyroak's attacks and force it out with their super effective Flying-type attacks while also being able to heal off damage with Roost and Regenerator, respectively. Cawmodore, Mega Pinsir, Landorus-T, and Hawlucha can threaten it out with their Flying-type STAB when boosted, but they cannot set up on it directly because of Lava Plume.</p> <p><strong>Mega Tyranitar: Mega Tyranitar is bulky enough to take any attack from Pyroak reliably, can force it out with the threat of Stone Edge and chip it with Pursuit, and can significantly cut into its recovery thanks to Sand Stream. Keep in mind, however, that it does not like being burned by Lava Plume.</p> <p><strong>Poison-types</strong>: Mega Crucibelle and Mollux can threaten out Pyroak with their super effective Poison-type attacks and are immune to Toxic. Mollux in particular is also immune to burns and tanks Lava Plume reliably. However, they both fear Earth Power, and Mega Crucibelle does not like to be burned.</p> <p><strong>Setup Sweepers Setup sweepers such as Calm Mind Clefable, Tapu Lele, Mega Latias, and Quiver Dance Volcarona can use it as setup bait.</p> <p><strong>Fire-types: While it must be wary of Earth Power, Heatran can switch into any of Pyroak's other attacks and shut it down with Taunt. Choice Specs Volkraken can threaten Pyroak out with its strong STAB attacks, but it can't take Earth Power repeatedly.</p> ",
    "sets": [
      {
        "name": "Defensive",
        "description": "<h1>Moves</h1> <p>Earth Power lets Pyroak hit Pokemon like Mega Crucibelle and Heatran super effectively. Pyroak is a very unreliable Stealth Rock setter, as its typing leaves it weak to Tornadus-T and most other hazard setters, but it can be run if there's no space to fit it elsewhere. Leech Seed can be used instead if one of Pyroak's teammates already provide this role, allowing Pyroak to passively sap away a foe's health and overall increasing Pyroak's longevity throughout the match.</p> <h1>Set Details</h1> <p>248 HP and 252 Defense EVs with a Bold nature help maximize Pyroak's physical bulk, allowing it to wall Pokemon such as Dragon Dance Naviathan, Kartana, and Caribolt. Alternatively, 248 HP EVs and 252 Special Defense EVs with a Calm nature can be used to maximize Pyroak's special bulk, helping it better take attacks from Magearna and Ash-Greninja.</p> <h1>Usage Tips</h1> <p>Switch Pyroak into resisted hits from Pokemon such as Tapu Koko, Ferrothorn, Kartana, Caribolt, and Magearna and use their switches to pressure the opposing team. Pyroak should pressure switch-ins by appropriately using Toxic, Leech Seed, and Lava Plume as they come in.  Pyroak is quite vulnerable to entry hazards, so it is important to use your entry hazard remover carefully, keeping it alive to consistently get Pyroak into battle safely. If a certain switch-in like Mega Crucibelle or Heatran is predicted, it is advised to use the appropriate coverage move to deal super effective damage to them.</p> <h1>Team Options</h1> <p>Pyroak requires the removal of entry hazards from the field, particularly Stealth Rock, to maintain its longevity. Thus, Defog users such as Tornadus-T and Zapdos are appreciated. They also appreciate Pyroak's ability to threaten common switch-ins to them. Electric-types like Krilowatt, Zapdos, and Tapu Koko make good partners, as they can check dangerous Flying-types like Tornadus-T, as well as Water-types such as Arghonaut, for Pyroak while it removes Ferrothorn and Jumbao, which can otherwise stop them cold. Pyroak is a potent stop to Fairy-types such as Tapu Koko and Jumbao, so Pokemon that like them removed such as Colossoil, Tomohawk, Pajantom, and Mega Latios appreciate the support that Pyroak gives.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 227784, "username": "snake_rattler"}, {"user_id": 395754, "username": "Jordy"}, {"user_id": 196588, "username": "cbrevan"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "Lumari"}, {"user_id": 231476, "username": "Fireflame"}]}], "writtenBy": [{"user_id": 339349, "username": "LucarioOfLegends"}]}
  },
  "Voodoom": {
    "overview": "<p>While Voodoom has access to Nasty Plot and sits in a respectable Speed tier, it faces many problems in the metagame. Voodoom needs a boost to hit anything appreciable, still doesn't hit especially hard after a boost, and doesn't have the bulk to set up multiple boosts, so it's hard to really get much damage off with it. Voodoom's STAB attacks also cannot break past setup deterrents like Arghonaut, Tomohawk, and Toxapex, meaning that sometimes it cannot even set up safely. Additionally, its abilities aren't particularly useful, as most Electric-types have some way to break through its average bulk. Thus, Voodoom is pretty much outclassed by every basically any relevant special attacker in the metagame. Not only do they have a better Special Attack stat, but they also provide their teams with better utility. For example, Tapu Lele provides Terrain control and has better STAB attacks, Ash-Greninja has access to Spikes and exerts more pressure with Battle Bond, Hoopa-U simply breaks defensive cores more easily, and Mega Alakazam has much more speed and access to Recover. Quiver Dance Aurumoth, Quiver Dance Volcarona, and Shift Gear Magearna are better special sweepers than Voodoom, as they can break open at least some of the aforementioned setup deterrents. Thus, Voodoom has no niche in the metagame.</p> ",
    "comments": "<h1>Other Options</h1> <p>Because the listed set is barely viable as is, Voodoom has no other options.</p> <h1>Checks and Counters</h1> <p><strong>Faster Pokemon</strong>: Pokemon that can outspeed Voodoom are the easiest way to get rid of it. Tornadus-T, Choice Band Syclant, Greninja, Mega Crucibelle, Mega Alakazam, Choice Scarf Jumbao, and Choice Scarf Volkraken are some examples of Pokemon that can OHKO it or neuter Voodom's attempt at accomplishing anything.</p> <p><strong>Setup Deterrents: Unaware Arghonaut and Haze Tomohawk and Toxapex discourage Voodoom from setting up at all, and they wall it even if it tries to set up, meaning Voodoom is a complete liability until these Pokemon are removed.</p> <p><strong>Fairy-types: Although Voodoom has access to Flash Cannon, most Fairy-types like Clefable, Tapu Lele, Jumbao, and Tapu Bulu can tank an unboosted Flash Cannon and OHKO it back.</p> <p><strong>Bulky Pokemon: Other bulkier Pokemon like Celesteela, Magearna, and Revenankh can tank Voodoom's moves and KO it.</p> ",
    "sets": [
      {
        "name": "Nasty Plot",
        "description": "<h1>Moves</h1> <p>After a Nasty Plot boost, Flash Cannon OHKOes Jumbao and Clefable. Thunderbolt and Psychic are alternative options that can break open Arghonaut, Toxapex, and Tomohawk, but then Voodoom is walled by Fairy-types.</p> <h1>Set Details</h1> <p>Life Orb is used to boost Voodoom's paltry offense to an acceptable level. While it could run a Z-Crystal, it's not worth using it on Voodoom over a teammate that can make better use of it.</p> <h1>Usage Tips</h1> <p>The best Voodoom can do is try to switch in early- to mid-game and try to wear down the opposing team. Switching into Choice Specs Tapu Koko's Volt Switch, Caribolt's Return, or Krilowatt's Thunderbolt allows Voodoom to get into play for free. If Voodoom can't safely set up a Nasty Plot and fire off an attack, it's better off double switching out, as using Nasty Plot will waste a turn. If the opponent's switch-in is bulky Jumbao or Clefable, set up to +2 and use Flash Cannon to lure and remove them.</p> <h1>Team Options</h1> <p>Dual screens Tapu Koko lets Voodoom set up more easily. Other setup sweepers like Aurumoth, Naviathan, Caribolt, and Hawlucha fit alongside Voodoom on this archetype. Stealth Rock setters like Focus Sash Landorus-T and Flyinium Z Tomohawk can help Voodoom break through opposing Pokemon more easily. Spikes setters such as Ash-Greninja, Ferrothorn, and Arghonaut can also help Voodoom achieve KOs. Voodoom can also make use of Sticky Web support from Ribombee, as many revenge killers like Choice Scarf Volkraken, Tapu Koko, and Ash-Greninja fail to outspeed it after the Speed drop. However, Voodoom allows Tornadus-T to switch in and use Defog freely, as even Thunderbolt doesn't OHKO Tornadus-T.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 208105, "username": "Jho"}, {"user_id": 339449, "username": "LucarioOfLegends"}, {"user_id": 395754, "username": "Jordy"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "Lumari"}, {"user_id": 273636, "username": "GMars"}]}], "writtenBy": [{"user_id": 227784, "username": "snake_rattler"}]}
  },
  "Equilibra": {"sets": [{"name": "Equilibra"}]},
  "Alakazam": {
    "overview": "<p>Mega Alakazam is one of the best special attackers in the tier thanks to its outstanding Speed stat that only leaves it outsped by Choice Scarf users. Additionally, it can take advantage of common Pokemon like Arghonaut, Heatran, and Mega Latios thanks to its typing, access to Recover, and ability; Trace allows Mega Alakazam to copy Heatran's Flash Fire and Mega Latios's Levitate, meaning that it can effectively wall Heatran lacking Corkscrew Crash and Mega Latios lacking Draco Meteor. Furthermore, Trace is an extremely useful tool against rain teams and also allows Mega Alakazam to copy a few other interesting abilities like Regenerator, Protean, and Soul-Heart. However, Mega Alakazam is extremely frail, leaving it susceptible to common Choice Scarf users like Kartana and Greninja.</p> ",
    "comments": "<h1>Other Options</h1> <p>Hidden Power Ice is an option to OHKO Ground-types like Garchomp, Landorus-T, and Gliscor while still being able to 2HKO Mega Latios after Stealth Rock damage. Thanks to Mega Alakazam's great matchup against rain teams due to its ability to Trace Swift Swim, Energy Ball can be used to take out Mega Swampert. However, both  options are very team specific and thus will rarely find a place in the last slot. Dazzling Gleam hits Mega Sableye and Hoopa-U, but offers very little else for coverage.</p> <h1>Checks and Counters</h1> <p><strong>Steel-types: Equilibra and Celesteela can easily wall Mega Alakazam, as they take very little damage from anything it can throw at them. However, they should be mindful of Knock Off, which greatly cripples them. Other Steel-types like Ferrothorn, Heatran, and Jirachi can take a hit and retaliate in return if needed.</p> <p><strong>Priority: Because of Mega Alakazam's frailty, it'll quickly fall over to priority attacks like Sucker Punch from Mega Mawile and Colossoil. Additionally it can quickly be worn down into range of priority moves from Mega Medicham, Weavile, and Ash-Greninja.</p> <p><strong>Dark-types: Mega Sableye can efficiently wall any Mega Alakazam that is lacking Dazzling Gleam. Although it's worn down quickly, Hoopa-U can also take a few hits if needed. Although not the most common, Mega Alakazam should watch out for Choice Scarf Weavile, which can outspeed and force it out.</p> <p><strong>Choice Scarf Users</strong>: Choice Scarf users like Kitsunoh, Greninja, Landorus-T, and Kartana outspeed Mega Alakazam and can exploit its underwhelming physical bulk and KO it.</p> <p><strong>Psychic-types: Although it can't switch in, Reuniclus can win in a one-on-one against Mega Alakazam thanks to Leftovers and Calm Mind. If Mega Alakazam isn't running Shadow Ball, the matchup becomes significantly easier for Pokemon like Aurumoth.</p> <p><strong>Specially Defensive Walls: Thanks to Chansey's great special bulk, it's relatively unbothered by anything Mega Alakazam can throw at it. However, it has to be wary of Knock Off, and it should be noted that Chansey can lose to Alakazam if it stays in its regular forme and starts building up boosts with Calm Mind. Other specially defensive walls like Jumbao and specially defensive Pajantom can also take any move from Mega Alakazam, though it should be noted that Jumbao is quickly pressured to heal up, putting momentum in Mega Alakazam's favor, while Pajantom lacks reliable recovery.</p> ",
    "sets": [
      {
        "name": "Spoonmaster (Standard)",
        "description": "<h1>Moves</h1> <p>Psychic is preferred over Psyshock to reliably 2HKO Landorus-T and physically defensive Clefable. Focus Blast allows Mega Alakazam to hit Steel- and Dark-types like Heatran, Ferrothorn, Weavile, and Mega Tyranitar, which are not bothered by Psychic. Recover enables Mega Alakazam to reliably take on Heatran and Mega Latios. Knock Off is run in the last slot to significantly cripple switch-ins like Equilibra, Celesteela, and Chansey, which rely on their item. Shadow Ball can be run instead so as to not be complete setup fodder to Reuniclus and hit Kitsunoh on the switch-in. Calm Mind turns Mega Alakazam into a potent wallbreaker.</p> <h1>Set Details</h1> <p>A Timid nature is preferred to outspeed Ash-Greninja and Modest Mega Alakazam. A Modest nature can be run to increase Mega Alakazam's wallbreaking prowess but will leave Mega Alakazam outsped by Timid Mega Alakazam. Magic Guard is chosen to ignore passive damage from sources such as entry hazards prior to Mega Evolving. Additionally, if Mega Alakazam is running Calm Mind, it can choose to not Mega Evolve and set up on Chansey, as Magic Guard ignores Toxic damage.</p> <h1>Usage Tips</h1> <p>Mega Alakazam is a very self-sufficient wallbreaker that can even sweep late-game thanks to its high Speed and Special Attack. It's best to try switching Mega Alakazam into Pokemon like Mega Latios, Heatran, and Arghonaut, although you should scout for Corkscrew Crash and Draco Meteor from Heatran and Mega Latios before comfortably switching in. From there, it's best to try to weaken the opposition with Mega Alakazam or potentially double switch out to a teammate, as Mega Alakazam will almost always force a switch after it switches in. The opportunity can also be used to recover health with Recover. You should ensure to remove priority users like Colossoil, Mega Mawile, and Mega Medicham from the game before trying to sweep with Mega Alakazam. Additionally, be wary of common Choice Scarf users like Kartana and Greninja, though Mega Alakazam can catch them on the switch with Shadow Ball and Focus Blast, respectively.</p> <h1>Team Options</h1> <p>Tapu Lele can form a powerful Psychic-type core with Mega Alakazam, as its ability Psychic Surge makes Mega Alakazam menacingly hard to switch into reliably. Tapu Lele also weakens shared checks, such as Steel-types, for Mega Alakazam. Additionally, Psychic Terrain shields Mega Alakazam from priority attacks. In return, Mega Alakazam can check a bunch of faster Pokemon for Tapu Lele like Tornadus-T and Greninja. Magnezone is very good at ensuring damage on Pokemon like Celesteela, Magearna, and Ferrothorn, which Mega Alakazam tends to struggle against. Other Pokemon that can force damage on Steel-types, such as Jumbao and Focus Blast Magearna, are also valued in this regard. Heatran can trap Chansey, consistently force out Steel-types, and pressure bulky Grass-types like Tangrowth and Jumbao, which Mega Alakazam can somewhat struggle against. Pivots such as Tornadus-T, Choice Scarf Kitsunoh, and Greninja can often force the opposition to switch and bring Mega Alakazam in with U-turn. Additionally, Tornadus-T tends to draw in Steel-types and can cripple them with Knock Off, making it easier for Mega Alakazam to consistently wear them down. Due to Mega Alakazam's potential to force many switches, it fits particularly nice on Spikes stacking teams with a setter like Greninja, Ferrothorn, or Arghonaut to set Spikes. Greninja is particularly notable because it can weaken Steel-types with Low Kick if that is desired. Lastly, if Mega Alakazam isn't running Shadow Ball, Dark-types like Weavile and Colossoil are good Pokemon to pair with it because they can consistently force out Psychic-types like Reuniclus and potentially Pursuit trap Kitsunoh.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 227784, "username": "snake_rattler"}, {"user_id": 231402, "username": "xavgb"}, {"user_id": 298148, "username": "Mx"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}, {"user_id": 232216, "username": "Lumari"}]}], "writtenBy": [{"user_id": 395754, "username": "Jordy"}]}
  },
  "Latios": {
    "overview": "<p>While Mega Latios competes with other offensive Psychic-types like Mega Alakazam and Tapu Lele, it sets itself apart from them with its Dragon typing, access to reliable recovery, and Levitate ability allow it to provide a consistent check to Pokemon like Arghonaut, Volkraken, Heatran, and Landorus-T. Its additional resistances and access to Recover also make it a lot easier for Mega Latios to switch into play, and thanks to this, it's very durable, unlike Tapu Lele. It further distinguishes itself from other Psychic-types like Tapu Lele and Mega Alakazam through its access to Earthquake, which allows it to consistently deal with Steel-types like Heatran and Magearna. However, it tends to struggle against other Steel-types like Celesteela and Ferrothorn, which Mega Alakazam and Tapu Lele can overwhelm over time with Focus Blast. Additionally, it's prone to getting Pursuit trapped by Weavile and Colossoil, as well as by Mega Tyranitar to a certain extent. Furthermore, Mega Latios struggles to deal with Fairy-types like Jumbao and Tapu Lele.</p> ",
    "comments": "<h1>Other Options</h1> <p>Hidden Power Fire is an option that can be run to pressure Ferrothorn and Mega Scizor, but Mega Latios has a hard time fitting it.</p> <h1>Checks and Counters</h1> <p><strong>Pursuit: Weavile is particularly threatening, as it outspeeds Mega Latios and can OHKO it with Icicle Crash, which means that Mega Latios will, more often than not, want to switch out and Weavile can trap it with Pursuit. Colossoil can also Pursuit trap Mega Latios and can punish it if it chooses to stay in to attack thanks to Sucker Punch. Lastly, Mega Tyranitar and Tyranitar can both Pursuit trap Mega Latios if it doesn't use Earthquake as they switch in. They should also be wary of Mega Latios staying in and using Earthquake, as it will significantly wear them down.</p> <p><strong>Steel-types: Steel-types like Ferrothorn and Celesteela can wall most Mega Latios. Ferrothorn must be wary of the rare Hidden Power Fire, however. Other Steel-types like Jirachi and Magearna can switch into any move other than Earthquake.</p> <p><strong>Fairy-types: Fairy-types can threaten Mega Latios tremendously with their STAB attacks. However, Mega Mawile and Magearna don't like taking an Earthquake, while Jumbao must watch out for Ice Beam. Choice Scarf Tapu Lele is a pretty reliable offensive check, but it fails to switch in consistently.</p> <p><strong>Faster Offensive Pokemon: Pokemon like Ash-Greninja, Mega Alakazam, Syclant, and Choice Scarf Kitsunoh can threaten Mega Latios with their respective STAB or coverage moves, but they can't reliably switch in. Additionally, not only does Mega Alakazam offensively check Mega Latios, it can also switch into non-Draco Meteor variants with relative ease.</p> <p><strong>Chansey: Thanks to its elephantine special bulk, Chansey is capable of taking anything Mega Latios can throw at it.</p> ",
    "sets": [
      {
        "name": "Mega Mixed Attacker",
        "description": "<h1>Moves</h1> <p>Earthquake allows Mega Latios to deal with Heatran while also letting it 2HKO Magearna and Mega Mawile as they switch in, as well as Mega Tyranitar after slight chip damage. Additionally, it OHKOes Mega Crucibelle, which Psychic is incapable of. Draco Meteor is run to prevent Mega Latios from letting Greninja, Weavile, Mega Alakazam, and Aurumoth switch in for free. Alternatively, Ice Beam can be run to effectively check Pokemon like Gliscor and Landorus-T. Additionally, it has a chance to 2HKO Jumbao. Recover notably allows Mega Latios to consistently check Heatran and Volkraken.</p> <h1>Set Details</h1> <p>A Hasty nature is preferred to a Naive nature to take on Volkraken and Heatran more comfortably.</p> <h1>Usage Tips</h1> <p>You should actively use Mega Latios's respectable bulk, resistances, and ability Levitate to check and switch into Pokemon like Heatran, Volkraken, Landorus-T, and Arghonaut. To consistently keep doing this, you should aim to keep Mega Latios as healthy as possible. Furthermore, Mega Latios should use the right coverage move if Pokemon like Magearna and Jumbao are expected to switch in, as it will be forced to switch out otherwise. You should also try to find a good balance between keeping Mega Latios healthy and picking the right move at the right time because it cannot be played offensively and defensively at the same time. Also, if Weavile is present on the opposing team, you should be extremely careful with using Mega Latios to pick up KOs, as it will always be able to Pursuit trap Mega Latios if it doesn't get hit by Draco Meteor as it switches in.</p> <h1>Team Options</h1> <p>Spikes setters like Ash-Greninja, Ferrothorn, and Arghonaut are particularly useful with Mega Latios, as the chip damage can consistently wear down Pokemon like Ferrothorn as Mega Latios forces them in. To add onto that, Ash-Greninja also forces damage on Ferrothorn, and Mega Latios can take advantage of checks to it like Arghonaut and Toxapex. Pokemon such as Ferrothorn and Celesteela that struggle with Fire-types like Heatran and Volkraken appreciate Mega Latios's ability to check them. Magnezone can consistently take out Steel-types like Celesteela and Ferrothorn that trouble Mega Latios. Furthermore, Magnezone and other Steel-types like Heatran and Magearna can also check Fairy-types like Jumbao and Clefable. Pokemon like Shift Gear Magearna and Quiver Dance Aurumoth are good teammates, as they appreciate Mega Latios's ability to weaken Pokemon like Magearna and Heatran.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 227784, "username": "snake_rattler"}, {"user_id": 298148, "username": "Mx"}, {"user_id": 208105, "username": "Jho"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}, {"user_id": 232216, "username": "Lumari"}]}], "writtenBy": [{"user_id": 395754, "username": "Jordy"}]}
  },
  "Weavile": {
    "overview": "<p>Weavile is the best Pursuit trapper in the CAP metagame thanks to its great Speed, allowing it to reliably check and trap Pokemon like Tornadus-T, Pajantom, and Mega Latios. Furthermore, it's a good offensive Shell Smash Necturna check thanks to its access to Ice Shard, while resisting Shadow Sneak thanks to its typing. Additionally, its great STAB combination alongside decently high-Base Power moves like Knock Off and Icicle Crash makes it pretty threatening to switch into for most Pokemon. However, Weavile is forced to use either Choice Band or Choice Scarf to reliably OHKO -1 Necturna, which will leave it vulnerable once it locks itself into one move. While its typing is good offensively, Weavile is also worn down easily due to its susceptibility to entry hazards in general. Furthermore, its awful defensive typing makes it very hard to reliably get Weavile into play, which often has to be done through VoltTurn support or on predicted switches.</p> ",
    "comments": "<h1>Other Options</h1> <p>Pressure is an option that can be run to scout whether Landorus-T is using a Choice Scarf or not, but more often than not, Weavile will not want to reveal its own Speed. A Choice Scarf set can reliably revenge kill Necturna and Aurumoth; furthermore, it can also Pursuit trap Mega Alakazam. Because this set is very fast, it doesn't need Ice Shard and thus has room to run Punishment instead, which does significant damage to Kartana. However, it should be noted that this set doesn't have as much offensive pressure as Choice Band sets because it's pretty weak, despite being able to run an Adamant nature.</p> <h1>Checks and Counters</h1> <p><strong>Bulky Water-types: Bulky Water-types like Arghonaut and Toxapex can completely wall Weavile and use it as bait to set Spikes and Toxic Spikes, respectively. However, neither likes getting its item removed by Knock Off.</p> <p><strong>Residual Damage: Due to Weavile's terrible defensive typing and bulk, it will quickly be worn down by entry hazards and weaker attacks like Giga Drain from Tangrowth.</p> <p><strong>Steel-types: Steel-types like Magearna, Mega Mawile, and Mega Scizor are usually not bothered by Knock Off and can use Weavile to set up with Shift Gear, Calm Mind, or Swords Dance. Although it can't switch in safely, Choice Scarf Kartana can outspeed and KO Weavile. However, it must be wary of Choice Scarf Weavile.</p> <p><strong>Faster Pokemon: Pokemon that are faster than Weavile like Mega Alakazam, Ash-Greninja, and Choice Scarf Volkraken can easily pressure and force out Weavile, but they can't consistently switch into it.</p> ",
    "sets": [
      {
        "name": "Choice Band",
        "description": "<h1>Moves</h1> <p>Pursuit allows Weavile to take out Pokemon like Mega Latios, Pajantom, and Choice-locked Tapu Lele while also ensuring that it gets off damage on Tornadus-T if it is expected to switch out. Knock Off is a spammable move that can remove important items from Pokemon like Arghonaut, Chansey, and Assault Vest Magearna. Ice Shard is notably used to KO Necturna after it has used Shell Smash. It can also potentially pick off weakened faster threats like Mega Alakazam and Tapu Koko.</p> <h1>Set Details</h1> <p>Choice Band is preferred over Life Orb because Weavile can't OHKO -1 Necturna with Ice Shard otherwise. Additionally, Weavile tends to get chipped down very fast with its susceptibility to Life Orb recoil and entry hazards. Pickpocket is preferred over Pressure to not reveal anything about Weavile's Speed against Pokemon like Landorus-T.</p> <h1>Usage Tips</h1> <p>Weavile should look to spam Knock Off early-game to cripple checks like Arghonaut and Assault Vest Magearna as well as check for Z-Moves, which can make playing around Pokemon like Magearna significantly easier. Due to Weavile's inability to directly switch into play on Pokemon it wants to Pursuit trap like Mega Latios and Pajantom, you should look to switch it into play on predicted switches on these Pokemon. Be wary of Stealth Rock, however, as it severely cuts into Weavile's health. It should be noted that Weavile can switch into most Pajantom lacking Outrage. While Weavile is threatened by Pokemon like Tapu Lele and Kitsunoh, they often run Choice items, meaning that if they lock themselves into a Psychic-type or Ghost-type move, they can be Pursuit trapped if you directly switch in Weavile. In a similar vein, Weavile should be switched into Necturna if it's predicted to set up.</p> <h1>Team Options</h1> <p>Weavile's ability to remove Pokemon such as Mega Latios and Pajantom from the match makes Pokemon like Mega Medicham, Smokomodo, and Volkraken good teammates, as they generally tend to struggle against them. Because Weavile is worn down so easily by entry hazards, Defoggers that can easily remove them like Tornadus-T and Zapdos are good teammates. Ash-Greninja is a great Pokemon to pair with Weavile, since it appreciates Weavile's ability to remove the items from checks like Toxapex, Arghonaut, and Magearna. While Weavile can punish Arghonaut with Knock Off, Pokemon that can further punish it like Mega Mawile, Tornadus-T, and Magearna are notable teammates, as Arghonaut will still be able to take on Weavile. Pokemon that can check Magearna and Mega Mawile like Heatran and your own Assault Vest Magearna are valuable teammates because these Pokemon will often attempt to use Weavile as bait to switch in. Necturna is an option that benefits from Weavile because it forces Choice Scarf users like Greninja and Kitsunoh to lock into Ice Beam and Shadow Strike, respectively, which Weavile can take advantage of and Pursuit trap them for Necturna.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 231402, "username": "xavgb"}, {"user_id": 227784, "username": "snake_rattler"}, {"user_id": 298148, "username": "Mx"}]}, {"name": "Grammar checked by", "members": [{"user_id": 231476, "username": "Fireflame"}, {"user_id": 232216, "username": "Lumari"}]}], "writtenBy": [{"user_id": 395754, "username": "Jordy"}]}
  },
  "Reuniclus": {
    "overview": "<p>Reuniclus is an excellent Calm Mind user in SM CAP that is capable of taking advantage of prominent passive Pokemon like Toxapex, Celesteela, and Ferrothorn. Thanks to Magic Guard, it is invulnerable to passive damage, making it an incredibly potent sweeper against more passive teams when paired with Spikes. Reuniclus also has a legitimate defensive use as well, as it is one of the few good checks to some very threatening and prominent wallbreakers such as Mega Medicham and Knock Off Mega Alakazam. There is one major downside to Reuniclus: its Speed tier. Because it is so slow, it has to take major hits before moving and can be forced into having to click Recover a lot, which can put it into some very awkward positions.</p> ",
    "comments": "<h1>Other Options</h1> <p>Signal Beam is a viable option together with Colbur Berry because it beats Hoopa-U while still hitting other Dark-types like Weavile and Mega Tyranitar for respectable damage. It is, however, a much worse option because the difference in damage is very notable, especially for only hitting one additional target. Psychium Z may be used to give Reuniclus a strong nuke while limiting the damage Reuniclus takes from strong Knock Off users like Weavile. However, with how highly contested Z-Moves are in SM CAP, it is oftentimes undesirable.</p> <h1>Checks and Counters</h1> <p><strong>Mega Scizor: Mega Scizor is considered one of the best checks to Reuniclus. It is not weak to Focus Blast and it is resistant to Psyshock, and it is consistently able to stay healthy and force out Reuniclus thanks to Roost and Swords Dance in combination with U-turn.</p> <p><strong>Dark-types</strong>: Although Reuniclus very typically runs Colbur Berry, weaker Knock Off users like Tornadus-T can get rid of it. If its Colbur Berry has been consumed, Dark-types like Mega Tyranitar, Weavile, Hoopa-U, and Ash-Greninja are very solid checks to Reuniclus. Mega Sableye completely walls the combination of Psyshock and Focus Blast, but will lose to various coverage moves due to the disappointing damage it does back to Reuniclus.</p> <p><strong>Strong Wallbreakers: Because of how slow Reuniclus plays, Reuniclus is generally prone to being overwhelmed by strong wallbreakers like Mega Mawile and Kyurem-B. Kyurem-B is so strong that it can outright OHKO Reuniclus with its STAB Subzero Slammer.</p> ",
    "sets": [
      {
        "name": "Calm Mind",
        "description": "<h1>Moves</h1> <p>Psyshock is Reuniclus's preferred STAB move because it gives Reuniclus the upper hand against other Calm Mind users like Mega Latias and opposing Reuniclus. Focus Blast lets Reuniclus pressure Dark-types such as Weavile and Mega Tyranitar as well as Steel-types like Excadrill and Levitate Equilibra. If you do not value beating other Calm Mind users with Reuniclus, Psychic is a viable option; it is most helpful for dealing with physically bulky Pokemon like Swords Dance Gliscor. Psychic should be run with Life Orb so that Reuniclus can still beat Chansey. At the cost of losing its ability to pressure Dark-types such as Weavile and Mega Tyranitar without entry hazards, Shadow Ball can be run instead of Focus Blast to immediately pressure Psychic-types like Tapu Lele and Mega Alakazam while still hitting Steel-types neutrally. Energy Ball may also be used over Focus Blast to hit Mega Swampert while still doing considerable damage to Mega Tyranitar.</p> <h1>Set Details</h1> <p>Colbur Berry helps Reuniclus deal with prominent Dark-types such as Weavile and Mega Tyranitar. Life Orb is a viable option that can be used for a more immediate offensive presence if dealing with Dark-types is not necessary. The extra damage output makes a difference in the Calm Mind war against Mega Latias and potentially opposing Reuniclus. 44 Speed EVs allow Reuniclus to outspeed Toxapex, which can otherwise beat it with Haze and its incredible bulk. The rest of the EVs are dumped into Defense to check Mega Medicham and Mega Lopunny. It is also useful for some other moves like Earthquake from defensive Landorus-T and various weak U-turns.</p> <h1>Usage Tips</h1> <p>It is imperative that you play a smart and patient game with Reuniclus. Be absolutely sure to wear down or remove Pokemon like Mega Mawile, Mega Scizor, and Pajantom before attempting to sweep with Reuniclus. You should focus on setting up entry hazards to achieve this early-game. While doing this, it is important to be mindful of Reuniclus's HP because it may have difficulty checking Pokemon like Mega Medicham while tanking weaker physical attacks such as defensive Landorus-T's Earthquake. If given the opportunity, it is wise to try and KO Dark-types such as Weavile and Mega Tyranitar with Focus Blast if Colbur Berry is intact. Removing these Pokemon make sweeping with Reuniclus much easier and more comfortable. Try to use passive Pokemon like Ferrothorn, Toxapex, and Celesteela as setup bait. These Pokemon cannot do much to it and present the perfect opportunity to start setting up and overwhelming the opposition.</p> <h1>Team Options</h1> <p>Pursuit trappers such as Mega Tyranitar and Weavile are the most popular teammates for Reuniclus because they are capable of weakening or outright removing Psychic-types like Mega Latias, Hoopa-U, and opposing Reuniclus from the game, making it much easier for Reuniclus to sweep. Spikers like Ferrothorn and Arghonaut are also powerful teammates for Reuniclus, as Spikes help wear down foes quickly, putting Reuniclus into a winning position faster. Magnezone is a valuable teammate to trap and KO Mega Scizor, which is oftentimes the only stopgap to Reuniclus for bulky offense teams.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 273339, "username": "Lasen"}, {"user_id": 517892, "username": "pannuracotta"}]}, {"name": "Grammar checked by", "members": [{"user_id": 277988, "username": "dex"}]}], "writtenBy": [{"user_id": 395754, "username": "Jordy"}]}
  },
  "Tornadus-Therian": {
    "overview": "<p>Tornadus-T is the premier offensive pivot in the CAP metagame thanks to its solid Speed coupled with decent natural bulk and Regenerator. Furthermore, it's the best Defogger in the metagame thanks to its solid matchup against common entry hazard setters like Arghonaut and its ability to force many switches, which gives it many opportunities to Defog while being able to pivot out of unfavorable matchups against hazard setters like Mega Crucibelle and Mega Diancie. While its Special Attack is only average, it's particularly annoying to switch into due to the combination of Knock Off and U-turn, allowing Tornadus-T to constantly generate momentum. Furthermore, thanks to its wide movepool, which includes moves like Taunt, Focus Blast, and Heat Wave, it can circumvent usual answers like Toxapex, Mega Tyranitar, and Magearna, respectively. On top of its utility, Tornadus-T is also one of the best checks to Pokemon like Mega Medicham and Kartana thanks to its Speed and typing. However, it can still be overwhelmed by them via coverage moves and Z-Moves. Tornadus-T also is quite susceptible to Pursuit trappers like Weavile as well as Mega Tyranitar and Tyranitar, which are extremely popular, depending on its moveset. Additionally, it somewhat suffers from four-moveslot syndrome because it can't fit all the moves it wants on one set.</p> ",
    "comments": "<h1>Other Options</h1> <p>Life Orb can be run on offensive Tornadus-T variants if its team already has another Z-Move user and desires a wallbreaker that can cripple bulky Steel-types; however, Z-Moves are often preferred on offensive Tornadus-T, and having to repeatedly switch into Stealth Rock while firing off Life Orb-boosted attacks may wear it down quickly, regardless of Regenerator. Expert Belt can be used on bulkier Tornadus-T variants to bluff offensive variants at the cost of no longer punishing contact move users. Hidden Power Ground can be run to pressure Mega Crucibelle and Heatran, but Tornadus-T often prefers other items.</p> <h1>Checks and Counters</h1> <p><strong>Electric-types: Electric-types like Tapu Koko, Zapdos, Cyclohm, and Rotom-W can easily switch into Tornadus-T thanks to their resistance to Hurricane and access to reliable recovery. Additionally, Zapdos and Cyclohm can punish the use of Knock Off and U-turn with their ability Static. Although it doesn't appreciate getting its item removed, Krilowatt's great natural bulk allows it to switch into Tornadus-T quite a few times throughout the match. Similarly, Caribolt can pressure Tornadus-T with its Electric-type moves, but it can't reliably switch in.</p> <p><strong>Pursuit: Pursuit users like Weavile, Mega Tyranitar, and Tyranitar can force out Tornadus-T and heavily weaken it with Pursuit. Additionally, Mega Tyranitar is capable of keeping Stealth Rock up against Tornadus-T. However, Mega Tyranitar and Tyranitar should be wary of All-Out Pummeling.</p> <p><strong>Flying-resistant Pokemon: Flying-resistant Pokemon that aren't bothered by Knock Off like Mega Crucibelle, Mega Diancie, and Z-Move Magearna are solid answers to Tornadus-T because it can do very little to them if it doesn't predict correctly. Additionally, Mega Crucibelle and Mega Diancie are capable of keeping Stealth Rock up against Tornadus-T, as it is threatened out by them, which will severely hinder its ability to check other Pokemon. Mega Crucibelle and Magearna should be wary of getting hit by Hidden Power Ground or Heat Wave on the switch.</p> <p><strong>Faster Offensive Pokemon: Pokemon such as Ash-Greninja, Greninja, and Mega Alakazam cannot switch into Tornadus-T, but they can easily force it out. Choice Scarf users like Tapu Lele and Volkraken force Tornadus-T out if they switch in on it, but they are afraid of Knock Off and are easily worn down.</p> <p><strong>Specially Defensive Walls: Tornadus-T can't do much to specially defensive walls like Toxapex and Chansey. However, they should be wary of getting their item removed by Knock Off as well as Taunt, which allows Tornadus-T to beat these Pokemon in the long run.</p> ",
    "sets": [
      {
        "name": "Assault Vest",
        "description": "<h1>Moves</h1> <p>Knock Off is a fantastic way to punish Tornadus-T's checks that wish to switch into it, such as Heatran and Celesteela. U-turn allows Tornadus-T to pivot out of threatening scenarios and regain HP with Regenerator while also providing a free switch in to a teammate, such as Kyurem-B, Mega Alakazam, or Magearna. Heat Wave OHKOs Cawmodore and hits the Steel-types that would otherwise wall it, such as Ferrothorn and Equilibra, while 2HKOing Magearna and Mega Mawile. Sludge Bomb is an option over Hurricane to OHKO uninvested Jumbao, but Hurricane's damage output is usually more appreciated.</p> <h1>Set Details</h1> <p>232 Speed EVs with a Timid nature allow Tornadus-T to outspeed Jolly Cawmodore and effectively check it. 80 HP EVs allows Tornadus-T to avoid being OHKOed by Jumbao's Twinkle Tackle after Stealth Rock. It also guarantees that it is not 2HKOed by Mega Alakazam's Psychic and Pixie Plate Jumbao's Moonblast if Stealth Rock isn't up. The rest of the EVs are put into Special Attack to always OHKO Cawmodore and Tomohawk and 2HKO uninvested Manaphy after Stealth Rock.</p> <h1>Usage Tips</h1> <p>Tornadus-T is valuable throughout the game because it can safely scout special attackers like Jumbao, Mega Alakazam, and Tapu Lele while using Knock Off to punish switch-ins and U-turn to accumulate chip damage and pivot into a more favorable matchup. If it's at full health, Tornadus-T survives Cawmodore's +6 Bullet Punch and can outspeed and OHKO it with Heat Wave. It can also offensively check offensive Grass-types such as Tapu Bulu and Kartana and threaten them both out.</p> <h1>Team Options</h1> <p>Assault Vest Tornadus-T can fit on most teams, but is mostly encountered on bulky offense. Tornadus-T pairs well with U-turn and Volt Switch users such as Mega Scizor, Tapu Koko, and Rotom-W to keep momentum. Ground-types such as Equilibra and Landorus-T will absorb the Electric- and Rock-type attacks thrown Tornadus-T's way, while Tornadus-T can answer the Grass-types that beat them. Defoggers such as Mega Scizor and Rotom-W and spinners such as Equilibra can remove Stealth Rock so that Tornadus-T can remain at full health. Other Regenerator users such as Tangrowth and Toxapex can form very potent Regenerator cores with Tornadus-T, alleviating some of the pressure from one another by mutually checking threats such as Jumbao and Kartana. Wallbreakers such as Mega Alakazam, Kyurem-B, and Mega Mawile appreciate Tornadus-T bringing them in safely with U-turn.</p> "
      },
      {
        "name": "Bulky Pivot",
        "description": "<h1>Moves</h1> <p>Tornadus-T is an outstanding user of Knock Off because it tends to draw in Pokemon like Zapdos, Celesteela, and Toxapex, which don't appreciate getting their item removed. Taunt can be run to break through bulkier checks like Toxapex and, ultimately, balanced teams. Heat Wave is an option to more steadily wear down Steel-types like Magearna, Celesteela, and Ferrothorn.</p> <h1>Set Details</h1> <p>Rocky Helmet is run to punish U-turn users like Landorus-T and Kitsunoh. 252 HP EVs notably allow Tornadus-T to check Kartana and Choice Scarf Landorus-T more comfortably as well as Necturna lacking Stone Edge.</p> <h1>Usage Tips</h1> <p>You should actively look to punish contact move users like Landorus-T and Kartana with Tornadus-T. Tornadus-T should attempt to generate momentum for its team by using U-turn or Defog on a forced switch on the opposing side. To punish incoming Flying-resistant Pokemon like Celesteela and Zapdos, Tornadus-T should use Knock Off to cripple them.</p> <h1>Team Options</h1> <p>Tornadus-T should primarily be used on bulkier teams as a reliable measure for Pokemon like Landorus-T and Grass-types as well as a Defogger. Because Tornadus-T tends to struggle with Electric-types, bulky Grass-types like Tangrowth, Jumbao, and Ferrothorn should be run to check them. Tornadus-T's tendency to invite in Magearna and Toxapex and cripple them with Knock Off and its ability to take advantage of Pokemon like Jumbao and Arghonaut makes Ash-Greninja, which struggles against them, an excellent partner. Similarly, Mega Crucibelle and offensive Psychic-types like Tapu Lele and Mega Alakazam tend to struggle to break through bulkier Steel-types like Magearna and Celesteela, so Tornadus-T's tendency to draw them in and cripple them with Knock Off makes it a good teammate for them. Checks to Rock-types like Mega Tyranitar, Mega Crucibelle, and Mega Diancie like Arghonaut and Ferrothorn are important because Tornadus-T will be forced out by  them very easily.</p> "
      },
      {
        "name": "Z-Move Pivot",
        "description": "<h1>Moves</h1> <p>Knock Off is an excellent move to run on Tornadus-T that makes it much harder to switch into because it can cripple common switch-ins like Zapdos and Celesteela. Furthermore, Tornadus-T also tends to draw in blanket specially defensive walls like Ferrothorn, Toxapex, and Chansey, which don't appreciate getting their item removed either. U-turn can be run instead of Knock Off, but this makes Tornadus-T easier to switch into overall. Taunt can be run to prevent walls like Toxapex and Chansey from using their passive recovery moves, allowing Tornadus-T to break bulkier teams much better. Heat Wave is another option that can be run, which notably prevents Shift Gear Magearna from setting up against Tornadus-T for free and also gives Tornadus-T a consistent way to wear down Celesteela. Lastly, Focus Blast + Fightinium Z can be run instead of U-turn to blow past Heatran, Mega Tyranitar, and Tyranitar.</p> <h1>Set Details</h1> <p>Flyinium Z lets Tornadus-T blow past Pokemon like Landorus-T and means that it doesn't have to rely on Hurricane's shaky accuracy once, overall making it much more threatening if timed correctly.</p> <h1>Usage Tips</h1> <p>Tornadus-T should be used as a pivot to check Pokemon like Arghonaut and Kartana and remove entry hazards continuously. Generally speaking, U-turn or Defog should be used against Pokemon that Tornadus-T tends to force out like Tangrowth, Arghonaut, and Landorus-T to gain momentum. Use Knock Off on incoming Flying-resistant Pokemon like Celesteela, Magearna, and Zapdos to cripple them for the remainder of the match. Make sure to time Tornadus-T's use of its Z-Move right against Pokemon like opposing Tornadus-T and Clefable, which it otherwise can't KO.</p> <h1>Team Options</h1> <p>Tornadus-T fits on most bulky offensive and balanced teams as a Defog user and offensive pivot. It pairs particularly well with bulky Grass-types like Jumbao, Ferrothorn, and Tangrowth because they can check Electric-types like Tapu Koko, which Tornadus-T tends to struggle against. It should be noted that Tornadus-T and Tangrowth also form a very powerful Regenerator core. Heatran is an outstanding partner for Tornadus-T. Not only does it appreciate Tornadus-T's ability to remove Spikes, but it also appreciates U-turn to switch in safely. Tornadus-T can wear down bulky Steel-types, so Pokemon like Mega Crucibelle, Tapu Lele, and Mega Alakazam are good partners because of this. Additionally, because Crucibelle doesn't want to Mega Evolve early on thanks to its ability Regenerator, they also form an excellent Regenerator core. Ash-Greninja also is an excellent partner because Tornadus-T can take advantage of Pokemon like Jumbao and Arghonaut, which it has a hard time dealing with. It also appreciates U-turn support and Tornadus-T's ability to remove Toxapex's and Magearna's item. Lastly, Mega Crucibelle checks like Arghonaut, Hippowdon, and Ferrothorn are appreciated because if Tornadus-T ever predicts incorrectly while Mega Crucibelle switches in, it will be forced out.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 231402, "username": "xavgb"}, {"user_id": 298148, "username": "Mx"}, {"user_id": 227784, "username": "snake_rattler"}, {"user_id": 517892, "username": "pannuracotta"}, {"user_id": 395754, "username": "Jordy"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "Lumari"}, {"user_id": 273636, "username": "GMars"}, {"user_id": 277988, "username": "dex"}]}], "writtenBy": [{"user_id": 395754, "username": "Jordy"}, {"user_id": 273339, "username": "Lasen"}]}
  },
  "Greninja": {
    "overview": "<h1>Greninja</h1> <p>Thanks to Greninja's great Speed, diverse movepool, and access to Protean, it's one of the premier offensive threats in the CAP metagame, being capable of pressuring offensive and bulky teams alike. This also gives it the freedom to pick its checks and counters. It also has access to Spikes, and thanks to its wide movepool, it's capable of pressuring Tornadus-T, the most common Defogger in the metagame, only adding to the overall pressure it exerts. However, Greninja is really frail and easy to wear down between entry hazards and Life Orb recoil. In addition to this, Greninja suffers from mild four-moveslot syndrome, as it can't always fit all the coverage it wants. Despite its great Speed, it's still outsped by offensive Pokemon like Mega Alakazam and Tapu Koko as well as Choice Scarf users like Kitsunoh and Volkraken, so it can be picked off quite easily.</p> <h1>Ash-Greninja</h1> <p>Ash-Greninja's decent offensive typing coupled with high Special Attack and Speed lets it take on many common Pokemon such as Landorus-T, Mega Crucibelle, Colossoil, and Mega Latios. It also has access to Water Shuriken, which lets it threaten faster Pokemon as well as Trick Room teams and is a decent STAB move post-Battle Bond, and Spikes. It's rather weak before transformation, however, meaning it needs to KO something to become threatening and may experience trouble breaking past Pokemon such as Ferrothorn and Krilowatt early-game. Additionally, the prevalance of bulky Grass- and Water-types such as Jumbao, Tangrowth, Arghonaut, and Toxapex can make it hard for Greninja to get a KO. Greninja is also frail, which may make it hard to switch into play.</p> ",
    "comments": "<h1>Other Options</h1> <section><h1>Greninja</h1> <p>Because of Greninja's wide movepool, it has a wide variety of moves that it can plausibly run. Groundium Z can be run alongside Dig to reliably overwhelm Pokemon like Magearna and Toxapex, but it leaves Greninja unable to really wear down Ferrothorn and completely walled by Celesteela. Additionally, Dig is incredibly easy to play around considering the popularity of Flying-types and Levitate users. Another option for a Z-Crystal would be Waterium Z with Hydro Pump, which allows Greninja to OHKO Pokemon like Mega Medicham and Mega Mawile. U-turn can be used to ease prediction and gain momentum in unfavorable matchups, but Greninja would usually rather break down walls on its own. Instead of Spikes, Toxic Spikes can be run to allow Greninja's teammates to pressure Pokemon like Tangrowth and Arghonaut more, but Spikes are often harder to deal with for the opponent and are generally much more useful on most builds.</p> <h1>Ash-Greninja</h1> <p>U-turn can be used to pivot, scout your opponent's answers to Greninja, and avoid having to trade Spikes with Arghonaut. However, it provides very little utility when compared to Spikes. Gunk Shot can be used to pressure Jumbao and Tapu Bulu, but its inaccuracy makes it a generally inferior option to Ice Beam.</p> </section><h1>Checks and Counters</h1> <section><h1>Greninja</h1> <p><strong>Set-dependent Switch-ins: Thanks to its wide movepool, Greninja has no true counters. However, it also cannot fit all of its moves on one set, so there will always be counters to certain sets. Arghonaut and Toxapex can wall any variant of Greninja that's lacking Extrasensory.</p> <p><strong>Faster Offensive Pokemon</strong>: Because Greninja is extremely frail, it's extremely susceptible to faster offensive Pokemon like Mega Alakazam, Tapu Koko, and Weavile. Mega Alakazam is particularly dangerous because it's able to Trace Greninja's Protean, which turns it into an absolutely menacing wallbreaker that is almost impossible to deal with defensively. Additionally, common Choice Scarf users like Kitsunoh, Volkraken, and Jumbao can easily pressure Greninja.</p> <p><strong>Priority: Because of Greninja's frailty, priority users like Mega Medicham, Mega Pinsir, and Mega Mawile can quickly neuter Greninja.</p> <p><strong>Mega Sableye: Mega Sableye manages to prevent Greninja from setting up Spikes, and it can live most attacks that Greninja can throw at it with relative ease. Additionally, it can cripple non-Z-Move sets with Knock Off.</p> <h1>Ash-Greninja</h1> <p><strong>Chansey</strong>: Thanks to Chansey's enormous bulk, it can easily take all of Ash-Greninja's attacks.</p> <p><strong>Bulky Water-types</strong>: Bulky Water-types such as Arghonaut, Toxapex, and Gastrodon deter Greninja from mindlessly using Hydro Pump. These Pokemon can easily take Dark Pulse as well thanks to their bulk or typing. Toxapex and Gastrodon are, however, susceptible to multiple layers of Spikes. Krilowatt can take Dark Pulse twice and isn't fazed by Spikes, but it lacks reliable recovery and is thus prone to getting worn down over time.</p> <p><strong>Bulky Grass-types: Greninja can't mindlessly use its Water-type STAB moves as long as Grass-types are around. Jumbao resists both of Greninja's STAB moves and can easily KO it in return. Additionally, it can set up sun thanks to Drought, which weakens Hydro Pump. It should be wary of the rare Ice Beam and even rarer Gunk Shot, though. Assault Vest Tangrowth  takes very little damage from Dark Pulse and isn't 2HKOed by Ice Beam. Mega Venusaur also takes little damage from anything Greninja can throw at it, but it is susceptible to Spikes and Dark Pulse and won't last long due to Synthesis's lackluster PP. Ferrothorn can switch into Greninja but lacks reliable recovery and is prone to getting overwhelmed.</p> <p><strong>Mollux: Mollux is immune to Hydro Pump and doesn't take much damage from Greninja's Dark Pulse, but it's worn down quickly by both Stealth Rock and Spikes, which can put it in 2HKO range.</p> <p><strong>Faster Pokemon</strong>: Faster Pokemon such as Mega Alakazam and Mega Lopunny threaten Greninja with their respective coverage and STAB moves but are susceptible to Water Shuriken once weakened. Choice Scarf users such as Kartana, Kitsunoh, Greninja, and Volkraken threaten Greninja but have to be wary of Water Shuriken, too. Tapu Koko outspeeds Greninja but is outsped by Ash-Greninja.</p> <p><strong>Strong Priority Moves: Pokemon like Mega Pinsir and Mega Medicham threaten Greninja with their respective priority moves, although a healthy Greninja can take at least one. Caribolt can KO Greninja with Quick Attack after prior chip damage. It also discourages Greninja from using Hydro Pump thanks to its typing.</p> </section>",
    "sets": [
      {
        "name": "Protean Attacker",
        "description": "<h1>Moves</h1> <p>Hydro Pump allows Greninja to hit Pokemon such as Equilibra, Kitsunoh, and Heatran. Ice Beam is a good option to pressure Tornadus-T, the most common Defogger, which will often want to keep Spikes off the field. Additionally, it nets good damage against Grass-, Ground-, and Dragon-types like Tangrowth, Necturna, Jumbao, Mega Garchomp, and Pajantom. Extrasensory allows Greninja to pressure Arghonaut and Toxapex, which can otherwise win entry hazard wars against Greninja quite easily. However, Gunk Shot can be run to handle Jumbao better. Additionally, Gunk Shot hits Tapu Lele and Tangrowth harder than any other move. Alternatively, Dark Pulse is an option on Metronome variants to punish slower Calm Mind users like Reuniclus and Mega Latias, which may attempt to boost past Greninja by increasing their Special Defense otherwise.</p> <h1>Set Details</h1> <p>A Hasty nature is used to outspeed Tornadus-T, and it is preferred over a Naive nature to switch into Heatran a little better. Life Orb increases Greninja's overall damage output, allowing it to net massive damage on Pokemon like Celesteela, Arghonaut, and Toxapex, but it comes at the cost of being worn down quickly. Expert Belt is an alternative option that can be run to increase Greninja's damage output against Pokemon like Heatran, Arghonaut, and Toxapex without taking recoil damage. Metronome is an option to gradually build up damage against Calm Mind users like Reuniclus and Mega Latias with Dark Pulse. It also means Toxapex and Arghonaut can't possibly try and stall Extrasensory Greninja out with Life Orb recoil. With this item, you will want maximum Special Attack investment.</p> <h1>Usage Tips</h1> <p>To make optimal use out of Greninja, you should attempt to set Spikes or pressure checks like Arghonaut, Toxapex, and Jumbao whenever it forces a switch. However, be wary of attacking too often, because Life Orb recoil will quickly rack up in tandem with damage from entry hazards. Although its bulk is quite poor, Greninja can be used to switch into Heatran once or twice to check it. However, generally speaking, you should not bring Greninja directly into play. Instead, try and bring it in on predicted switches and with VoltTurn support. If Greninja is running Fightinium Z, be careful of using it immediately, because your opponent might scout for it.</p> <h1>Team Options</h1> <p>Psychic-types like Mega Alakazam and Tapu Lele benefit greatly from Greninja's presence; they massively appreciate Spikes because of the amount of switches they force. If Greninja is not running Extrasensory itself, these Pokemon become even more important to take advantage of Arghonaut and Toxapex. For similar reasons, setup sweepers like Magearna, Necturna, and Mega Mawile also benefit greatly from Greninja's presence. Because Greninja is so frail, it's often optimal to pair it with VoltTurn users like Krilowatt and Tornadus-T to bring it into play safely. Special wallbreakers such as Volkraken, Magearna, and Mega Latios also capitalize on Greninja's ability to weaken Chansey, the best blanket check to special attackers in general.</p> "
      },
      {
        "name": "Choice Specs",
        "description": "<h1>Moves</h1> <p>Surf is a solid alternative to Hydro Pump if its perfect accuracy is desired. However, it does miss out on crucial KOs against Pokemon such as Tapu Koko and Tapu Lele. Water Shuriken is a strong, reliable priority STAB move once Battle Bond has been activated and lets Ash-Greninja threaten weakened sweepers such as Hawlucha and Kartana. Spikes pressures defensive answers such as Jumbao, Tangrowth, Arghonaut, and Toxapex. Ice Beam can be used to pressure bulky Jumbao, but leaves Ash-Greninja hopelessly walled by the aforementioned bulky Water-types. It also provides no team support whatsoever, unlike Spikes. Toxic can be run instead of Spikes to cripple common switch-ins like Arghonaut, Jumbao, and Tangrowth, but Spikes provides more support overall.</p> <h1>Set Details</h1> <p>Choice Specs enhances Greninja's otherwise rather mediocre Special Attack and lets it KO an opposing Pokemon and subsequently transform more easily.</p> <h1>Usage Tips</h1> <p>Play aggressively with Greninja pre-transformation to weaken targets in order to activate Battle Bond. If running Spikes, use it if there is a Water-resistant Pokemon such as Jumbao, Tangrowth, Arghonaut, or Toxapex present. Once multiple layers of Spikes are set, use Dark Pulse to consistently put pressure on these Pokemon. Water Shuriken is inconsistent pre-transformation, so try to use it minimally before transforming. Greninja is too frail to bring in on direct attacks; you should instead try to bring it into play with VoltTurn support or on a predicted switch.</p> <h1>Team Options</h1> <p>Tapu Koko, Krilowatt, and Kartana appreciate the support Ash-Greninja provides with Spikes and can pressure bulky Water-types. Additionally, the former two can get Ash-Greninja in with U-turn or Volt Switch. Stealth Rock setters such as Garchomp, Landorus-T, and Heatran can aid Ash-Greninja in pressuring bulky Grass- and Water-types. Other strong wallbreakers such as Tapu Lele and Mega Alakazam can put additional pressure on bulky Grass- and Water-types and benefit from Spikes. Pokemon that can take advantage of Grass-types, like Tornadus-T and Aurumoth are excellent partners, as Ash-Greninja will struggle to deal with Grass-types on a consistent basis. Pelipper can set rain for Greninja on rain teams, which makes its Hydro Pump and Water Shuriken ridiculously strong, and can safely bring Greninja in with a slow U-turn.</p> "
      },
      {
        "name": "Lead",
        "description": "<h1>Moves</h1> <p>Taunt is run to prevent Greninja from becoming setup bait for Pokemon like Aurumoth and Magearna. Additionally, it prevents Defog from Pokemon that Greninja can't really touch, like Rotom-W. Ice Beam is particularly important for this set to put offensive pressure on Defog users like Tornadus-T and Zapdos. It also pressures Ground- and Grass-types like Landorus-T, Garchomp, Jumbao, and Necturna. Toxic Spikes is the preferred fourth move to wear down bulkier foes like Arghonaut and Tangrowth for Greninja's teammates. Alternatively, Hidden Power Fire can be run to deal with Ferrothorn and Magearna.</p> <h1>Set Details</h1> <p>A Focus Sash is mandatory to guarantee that Greninja gets to set up entry hazards at the start of a match.</p> <h1>Usage Tips</h1> <p>Because Greninja is a lead for hyper offensive teams, it's pretty straightforward to use. However, against Pokemon like Mega Sableye and dual screens Tapu Koko, consider not leading with Greninja, because they can prevent it from setting entry hazards. Greninja should aim to set multiple layers of Spikes and Toxic Spikes and pressure Defog users like Tornadus-T to keep them up early-game. If the majority of the opposition is grounded, one layer of Spikes is often enough to pressure these teams. After that, if the opposition does not have a Poison-type like Toxapex or Amoonguss, Greninja should often prioritize setting up Toxic Spikes.</p> <h1>Team Options</h1> <p>Greninja should primarily be used on hyper offensive builds that can force many switches and thus make optimal use of Spikes. Greninja pairs particularly well with other leads that can set Stealth Rock like Landorus-T and Excadrill to form an entry hazard stacking core on these type teams. This set excels with teammates that make use of Spikes. Thus, setup sweepers like Magearna, Necturna, and Hawlucha are optimal on these kind of teams because they can force many switches and benefit greatly from Spikes damage.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 231402, "username": "xavgb"}, {"user_id": 298148, "username": "Mx"}, {"user_id": 264912, "username": "G-Luke"}, {"user_id": 339349, "username": "LucarioOfLegends"}]}, {"name": "Grammar checked by", "members": [{"user_id": 331519, "username": "CryoGyro"}, {"user_id": 273636, "username": "GMars"}, {"user_id": 232216, "username": "Lumari"}]}], "writtenBy": [{"user_id": 395754, "username": "Jordy"}]}
  },
  "Toxapex": {
    "overview": "<p>Toxapex is a defensive staple in the SM CAP metagame, as it checks key Pokemon in the tier like Jumbao, Arghonaut, Mega Lopunny, and Weavile. Regenerator lets it safely scout foes like Tornadus-T, Greninja, and Kartana. Toxapex also has access to a plethora of good defensive utility moves like Scald, Toxic Spikes, and Haze. However, due to Toxapex's defensive potency, it often has to check multiple opposing Pokemon, which can cause it to get overwhelmed in the long term.</p> ",
    "comments": "<h1>Other Options</h1> <p>Baneful Bunker is a solid option that eases prediction by punishing physical attackers like Weavile, Mega Medicham, and Caribolt. However, the opportunity cost from not running Toxic or any of its other utility moves is noticeable. Defense investment can be used to better handle physical attackers like Mega Mawile, Kartana, and Weavile. However, without Special Defense investment, it no longer handles Jumbao. This forces you to run Toxapex alongside a Pokemon which does, like Chansey or Tornadus-T. A Payapa Berry can be used to punish Mega Medicham and Tapu Lele and use Haze against Reuniclus and Mega Latias in a pinch. However, it's a very situational item, rendered completely useless in matchups where Toxapex does not have to face a Psychic-type. Shed Shell can also be run to let Toxapex escape trapping attempts from Heatran and Pajantom. Finally, Light Screen can be run to better take on Tapu Koko, Krilowatt, and Equilibra while providing some support for Toxapex's teammates, but is extremely hard to find room for.</p> <h1>Checks and Counters</h1> <p><strong>Psychic-types: Psychic-types like Tapu Lele, Mega Medicham, and Mega Alakazam all threaten Toxapex out, but none of them appreciate being statused when switched in. Reuniclus deserves a special mention, as it's able to switch in completely for free without minding being statused or losing its Colbur Berry.</p> <p><strong>Ground-types: Ground-type foes such as Landorus-T and Equilibra threaten Toxapex with their powerful Ground-type attacks. However, neither of them want to switch into a super effective Scald and risk a burn. Gliscor can use Toxapex as setup fodder once its Toxic Orb has been activated, shrugging off Scald damage and recovering HP while doing so.</p> <p><strong>Electric-types and Electric-type coverage: Electric-types like Krillowatt, Tapu Koko, and Caribolt threaten to OHKO Toxapex with their STAB moves, but they cannot safely switch in on Toxic or Knock Off. Kyurem-B, Clefable, and Mega Mawile can all run Electric-type coverage to beat Toxapex.</p> ",
    "sets": [
      {
        "name": "The Pex",
        "description": "<h1>Moves</h1> <p>Scald allows Toxapex to mitigate its passivity, punishing attackers like Mega Tyranitar and Mega Mawile with Scald burns. Haze thwarts setup attempts from Necturna, Reuniclus, and Magearna and prevents Toxapex from being setup fodder. Toxic gives it a way to punish switch-ins like Rotom-W, Tapu Lele, Jumbao, and Tornadus-T. Knock Off can be used instead to force progress by removing items from Krilowatt, Weavile, Chansey, and Reuniclus. Another option is Toxic Spikes, which help setup sweepers like Mega Latias, Reuniclus, and Gliscor by wearing down their checks in Chansey, Mega Tyranitar, and Jumbao.</p> <h1>Set Details</h1> <p>The EV spread maximizes Toxapex's special bulk to let it handle Jumbao, Magearna, and Tornadus-T better, with the given Defense investment allowing it to always survive a +2 Leaf Blade from Kartana two Choice Band Knock Offs from Weavile, as well as counter Mega Lopunny. Regenerator and Black Sludge keep Toxapex healthy throughout the game, which lets it check Manaphy and Volcarona.</p> <h1>Usage Tips</h1> <p>Switching Toxapex into resisted hits ensures that it can get on the field safely without having to use Recover, allowing it to spread status and disrupt the opposing team. Toxapex can also pivot into passive foes such as Chansey, Celesteela, and Arghonaut, as their low damage output is negated by Regenerator. Furthermore, using Regenerator to scout Choice Item users like Greninja, Weavile, and Victini lets Toxapex switch into a more appropriate answer, depending on what move they lock into. Additionally, Toxapex can also scout what item the opponent's Greninja is holding, though it must be wary of Tectonic Rage off of Dig. Toxapex can also switch into Tornadus-T and threaten it with Knock Off or Toxic.</p> <h1>Team Options</h1> <p>Pokemon that resist or are immune to Electric such as Gliscor, Mega Latias, Equilibra, and Ferrothorn make for stellar teammates, as they're able to check the Electric-types that bother Toxapex. Ground-resistant or -immune Pokemon like Celesteela, Tornadus-T, and Jumbao can switch into Ground-type attacks from Equilibra, Landorus-T, and Gliscor, which threaten Toxapex. Psychic-types like Mega Alakazam, Reuniclus, and Tapu Lele threaten Toxapex, so Pokemon like Heatran, Mega Tyranitar, and Weavile are great teammates alongside it. Tyranitar and Weavile are especially notable, as their Pursuit support is greatly appreciated by Toxapex to remove Psychic-types that threaten it. Mega Scizor is a solid teammate, as it helps patch Toxapex's negative matchup versus Kyurem-B. Regenerator cores with Tangrowth and Tornadus-T are incredibly hard to consistently break through, as they cover each other's weaknesses.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 273339, "username": "Lasen"}, {"user_id": 297859, "username": "quziel"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}]}], "writtenBy": [{"user_id": 517892, "username": "pannuracotta"}]}
  },
  "Magearna": {"sets": [{"name": "Shift Gear"}]},
  "Syclant": {
    "overview": "<p>Syclant has good mixed offensive stats, a good movepool, and a fantastic Speed stat that lets it outpace most Pokemon in the metagame like Mega Latios, which allows it to be either a physical wallbreaker or an offensive pivot. It has access to Spikes, which can be put down to pressure Pokemon. Its Ice / Bug typing works great offensively, allowing it to hit huge threats in the tier such as Tornadus-T and Tangrowth with its STAB attacks. Syclant also makes great use of its Ground-type coverage attacks to lure in and KO Pokemon that resist its dual STAB moves, such as Heatran and Magearna. U-turn goes nicely with Syclant's high Speed, as it is able to pressure most of its switch-ins while gaining momentum for the team. Its unique ability Mountaineer gives it a useful immunity to Stealth Rock as well as Rock-type coverage like Garchomp's Stone Edge, whereas access to Ice Shard allows its Choice Band set to take care of Shell Smash Necturna. However, Syclant has thin defenses that leave it vulnerable to priority moves from Pokemon like Mega Mawile, and it cannot switch well into most attacks. It also has a poor defensive typing that leaves it with many crippling weaknesses to Pokemon like Tornadus-T, Celesteela, and Choice Scarf Jumbao. Furthermore, despite its high Speed stat, Syclant can easily be revenge killed by faster Pokemon like Greninja, Tapu Koko, Mega Alakazam, and Choice Scarf users like Kitsunoh and Volkraken. Syclant also has a hard time against Arghonaut, which can take any of Syclant's attacks and wall it, and faces some competition from Weavile, which has access to Knock Off and Pursuit and can also revenge kill Necturna. Furthermore, it also faces competition from Greninja as a Spikes setter due to the latter's higher Speed, wider movepool, and ability Protean.</p> ",
    "comments": "<h1>Other Options</h1> <p>Tail Glow can be run to make Syclant obscenely powerful. However, it is still unable to break Arghonaut, and due to Syclant's frailty, it's relatively hard to set up safely. Taunt can be used to stop Spikes users like Arghonaut or setup sweepers like Gyarados. However, this means Syclant has to drop its Ground-type coverage and can no longer take care of Fire-types like Heatran. Stone Edge can be used to hit Pokemon like Kyurem-B and Mega Charizard Y; however, this again means that Syclant has to drop Earth Power or Earthquake, which makes it miss out on hitting Pokemon like Heatran, Toxapex, Magearna, and Kitsunoh.</p> <h1>Checks and Counters</h1> <p><strong>Arghonaut: Arghonaut walls Syclant completely and ignores its Tail Glow boost thanks to its ability Unaware. If Syclant does not use U-turn on Arghonaut's switch in, Arghonaut will set its own Spikes.</p> <p><strong>Faster Pokemon</strong>: Faster Pokemon like Greninja, Tapu Koko, Mega Alakazam, and Weavile and Choice Scarf Pokemon like Kitsunoh, Volkraken, Tapu Lele and Jumbao outpace Syclant and can take care of it with their STAB moves.</p> <p><strong>Priority: Priority moves like Sucker Punch from Mega Mawile or Colossoil and Bullet Punch from Mega Scizor can take care of Syclant after a bit of prior damage due to its frail defenses.</p> <p><strong>Bulky Attackers: Bulky attackers like Kyurem-B, Gyarados, Suicune, and Mega Swampert can take any attack from Syclant and set up or retaliate.</p> <p><strong>Steel-types: Steel-type Pokemon like Celesteela, Mega Scizor, and Ferrothorn easily wall Focus Sash Syclant and can easily take care of it with their Steel-type attacks. However, Celesteela and Ferrothorn dont like taking Life Orb or Choice Band Syclant's Ice-type moves due to taking neutral damage from them. Ferrothorn also has to watch out for Superpower. Magearna can easily tank Earth Power and OHKO Syclant, but it is threatened immensely by Earthquake.</p> <p><strong>Fire-types: Due to its 4x weakness to Fire-type attacks and inability to use STAB moves to deal with Fire-types, Syclant finds itself checked and revenged killed rather easily while Choice-locked. This creates mind games when Syclant decides on using an Ice-type attack or not in a match. An example of a Fire-type that stops Syclant from freely using these attacks is Volcarona, as it can easily switch into Syclant and start setting up.</p> <p><strong>Chansey: Chansey can wall Syclant's Focus Sash and Life Orb variants; however, Chansey has a harder time against Choice Band and Tail Glow variants of Syclant.</p> ",
    "sets": [
      {
        "name": "Choice Band",
        "description": "<h1>Moves</h1> <p>Syclant's Earthquake enables it to hit Poison-, Fire-, and Steel-types like Toxapex, Heatran, and Magearna super effectively. Ice Shard is mainly used to OHKO Shell Smash Necturna after setting up. Superpower can be run over Earthquake to allow Syclant to hit Chansey and maintain coverage for Heatran, but this leaves Syclant walled by Toxapex, Magearna, and Kitsunoh.</p> <h1>Set Details</h1> <p>Choice Band allows Syclant to maximize U-turn's damage as it pivots out and allows it to OHKO Necturna with Ice Shard after it has used Shell Smash. A Jolly nature is key for outspeeding Pokemon like Mega Latios and Mega Diancie. Mountaineer is the preferred ability to prevent Syclant from taking Stealth Rock damage.</p> <h1>Usage Tips</h1> <p>Use U-turn early-game if Syclant cannot take care of the Pokemon in front of it and to see what the opponent's answer to Syclant is. U-turn is its main way of gaining momentum for its team off of Pokemon it threatens out like Tangrowth and Mega Latios. Also, it should use U-turn on Arghonaut to get in a Pokemon that threatens it to prevent Arghonaut from setting up Spikes for free. Try to get Syclant in on a predicted switch, a Pokemon fainting, or from a pivot Pokemon like Krilowatt or Tornadus-T because Syclant cannot take attacks well. However, Syclant can switch into weaker attacks like specially defensive Pajantom's Spirit Shackle in a pinch. Use Earthquake on a predicted switch to Heatran or Toxapex. Taking care of priority move users like Mega Mawile and Colossoil should be prioritized because they can severely weaken or KO Syclant due to its poor defenses.</p> <h1>Team Options</h1> <p>Teams that lack a revenge killer for Necturna appreciate Choice Band Syclant for its ability to KO -1 Defense Necturna with Ice Shard. Notably, teams that use Choice Scarf Kitsunoh to keep faster foes in check appreciate Syclant, as Kitsunoh is OHKOed by Shadow Sneak from +2 Necturna. Entry hazards from Ferrothorn and Mega Tyranitar are nice because they allow Syclant to further pressure switch-ins and limit how many times a foe can switch. Ash-Greninja appreciates the pressure Syclant places on Jumbao, Tangrowth, and Toxapex. Fire-types like Volkraken and Heatran help with troubling Steel-types like Celesteela and Ferrothorn. Psychic-type wallbreakers like Mega Alakazam, Tapu Lele, and Mega Medicham take advantage of Arghonaut while appreciating Syclant's ability to force switches and bring them in with U-turn. Mega Alakazam and Tapu Lele also appreciate the fact that Syclant forces damage on Steel-type checks.  U-turn and Volt Switch users like Mega Crucibelle, Tornadus-T, and Krilowatt can help get Syclant in safely and form a powerful offensive core with it. These three Pokemon can take care of Pokemon that Syclant struggles with like Tapu Koko and Celesteela. Defoggers like Tornadus-T are also good to pair with Syclant to get rid of Spikes for it.</p> "
      },
      {
        "name": "Offensive Spikes",
        "description": "<h1>Moves</h1> <p>Syclant can take care of Fire- and Poison-types like Heatran and Toxapex with Earthquake. Earth Power can be used over Earthquake to get KOs that Earthquake cannot, such as against Naviathan and Mega Mawile.</p> <h1>Set Details</h1> <p>A Naive nature is preferred to a Hasty Nature, as it allows Syclant to avoid the 2HKO from Garchomp's Earthquake. Life Orb is Syclant's main item of choice to further its damage output in order to 2HKO Toxapex and Calm Mind + Pain Split Magearna with Earthquake and OHKO Mega Crucibelle with Earth Power. Focus Sash can be used to guarantee one layer of Spikes or to stop a sweeper like Hawlucha.</p> <h1>Usage Tips</h1> <p>Try not to directly switch in Syclant unless it is into Garchomp, into Mega Crucibelle's Stone Edge, or into a weaker attack like a specially defensive Pajantom's Spirit Shackle, as it is very frail. Instead, allow Syclant to come in either by a pivot Pokemon, on a predicted switch, or from a Pokemon fainting. Syclant can set up Spikes on a predicted switch because it pressures Pokemon like Mega Latios and Mega Crucibelle or when its Focus Sash is not needed to provide an emergency stop to setup sweepers like Hawlucha, Cawmodore, and a weakened Aurumoth. Use U-turn to allow Syclant to pivot out of Arghonaut as well as early-game to gain momentum and see what the opponent's check to Syclant is. Try to knock out priority users, as Syclant's poor defenses will leave it heavily damaged or KOed from the likes of Sucker Punch from Mega Mawile and Bullet Punch from Mega Scizor. It must also be wary of using U-turn when there is a Ferrothorn on the opposing team, as recoil from Life Orb and Iron Barbs wears down Syclant and breaks Focus Sash if Syclant is not running Life Orb.</p> <h1>Team Options</h1> <p>Slower pivots like Landorus-T and Mega Scizor are good to pair with this Pokemon because of their slow U-turn, which allows Syclant to avoid getting damaged. Magnezone is also good for its ability to trap annoying Steel-types that Syclant struggles with like Mega Scizor and Ferrothorn. Mega Crucibelle is a nice fast pivot Pokemon to pair with Syclant, as Mega Crucibelle can set Stealth Rock to pressure Pokemon into switching in. Stealth Rock users in general like Ferrothorn and Heatran are nice to pair with Syclant, as the chip damage pressures and limits switch-ins. In particular, Heatran appreciates Syclant's ability to switch in on Garchomp, giving nice synergy to the hazard stacking core. Psychic-types like Tapu Lele, Mega Medicham, and Mega Alakazam can help with Ferrothorn and Celesteela, and both appreciate Syclant thanks to its U-turn and Spikes. Fire-types like Volkraken and Heatran help with Pokemon that Syclant cannot touch well like Celesteela and Mega Scizor. Electric-types like Krilowatt and Tapu Koko can form a VoltTurn core with Syclant and appreciate Spikes support.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 395754, "username": "Jordy"}, {"user_id": 298148, "username": "Mx"}, {"user_id": 227784, "username": "snake_rattler"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "martha"}, {"user_id": 232216, "username": "Lumari"}]}], "writtenBy": [{"user_id": 393488, "username": "Yami"}]}
  },
  "Revenankh": {"sets": [{"name": "Dual Status", "description": "<p>Revenankh has a niche as a status spreader that checks common offensive threats. With Triage Drain Punch, it pressures Ash-Greninja, Mega Crucibelle, Syclant, and Weavile, and with Triage Moonlight, it will usually heal before the opponent can attack. Access to Glare, Will-O-Wisp, and Toxic allows Revenankh to cripple the opponents team in the way that best supports its teammates. However, Revenankh finds itself forced out by common offensive and defensive Pokemon like Mega Alakazam, Tornadus-T, Toxapex, Snaelstrom and Jumbao, which go unpunished if Revenankh doesnt choose the right status move on the switch-in.</p> <p>This analysis is a work in progress, see here for more information.</p> "}]},
  "Fidgit": {
    "overview": "<p>Fidgit is the face of Trick Room in CAP. With Persistent, Fidgit's Trick Room is extended by two turns, letting Trick Room attackers wreak havoc longer without being interrupted, which makes Trick Room one of the metagame's most effective team archetypes. Furthermore, with good defensive stats and a unique typing, Fidgit can set up Trick Room multiple times per battle and act as a Tapu Koko check. However, Fidgit lacks reliable recovery, meaning it can be worn down quickly. Additionally, Fidgit's damage output is passable only if hitting super effectively, so it has to play rather aggressively to maintain momentum.</p> ",
    "comments": "<h1>Other Options</h1> <p>Persistent + Tailwind can be run for Tailwind teams, as Persistent grants two extra turns to Tailwind, but these teams lack good secondary setters. If Trick Room Fidgit is not paired with Tapu Bulu and does not run Sludge Bomb, Earthquake is generally a better move to run, as it wears down Mega Crucibelle, Volkraken, and Magearna faster than Earth Power. Mental Herb can be run on the Trick Room set to circumvent Taunt counterleads, but Iapapa Berry's recovery is generally more useful.</p> <h1>Checks and Counters</h1> <p><strong>Taunt: Because Fidgit is very reliant on utility moves, Taunt users like Heatran, Tornadus-T, Tomohawk, and Tapu Koko annoy it. It is especially annoying for Trick Room Fidgit due to the move's negative priority. However, Fidgit can threaten Heatran and Tapu Koko with Earth Power, and the niche Mental Herb set can bypass Taunt once entirely.</p> <p><strong>Psychic-types: Fidgit struggles against faster Psychic-types, as it has very limited counterplay to them. Though it can survive Psychic from Mega Alakazam and Mega Latios, it's rather helpless against Tapu Lele.</p> <p><strong>Strong Wallbreakers: Strong wallbreakers that can OHKO bulky Trick Room Fidgit place massive pressure on Fidgit to set up Trick Room effectively, as its teammates don't appreciate taking their attacks either. Some examples include Ash-Greninja, Choice Specs Volkraken, and Kyurem-B.</p> <p><strong>Ground-types: Ground-types like Garchomp, Landorus-T, and Gliscor hit Fidgit super effectively with their STAB moves, while Fidgit can't really pressure them back.</p> <p><strong>Bulky Pokemon: Fidgit's low offensive presence leaves it unable to break past bulky Pokemon like Chansey or Ferrothorn. However, they are easy for Fidgit to use U-turn against and do not appreciate a stray Taunt.</p> ",
    "sets": [
      {
        "name": "Trick Room",
        "description": "<h1>Moves</h1> <p>Earth Power is a Ground-type STAB attack that isn't weakened by Tapu Bulu's Grassy Terrain and chips down Heatran, Magearna, Mega Crucibelle, and Volkraken. Rapid Spin prevents the opponent from stacking entry hazards, allowing Fidgit's teammates more freedom to switch. Stealth Rock can be utilized by another teammate such as Mega Camerupt to improve the team's matchup against stall teams, as Fidgit can rarely set up Stealth Rock with the presence of Mega Sableye. In this case, Spikes can be run to stack with the teammate's Stealth Rock. Sludge Bomb is another option that deals heavy damage to Jumbao and Tapu Bulu, which can punch holes into Trick Room teams.</p> <h1>Set Details</h1> <p>Investing 172 Special Defense EVs alongside a Calm nature allows Fidgit to survive many special attacks, including Mega Alakazam's Psychic and Choice Scarf Volkraken's Hydro Pump. 80 Defense EVs let Fidgit survive Choice Band Syclant's Icicle Crash and Earthquake from Landorus-T and Garchomp, as well as giving it a chance to survive Mega Medicham's Zen Headbutt. Iapapa Berry's burst recovery allows Fidgit to set Trick Room reliably even later in the match.</p> <h1>Usage Tips</h1> <p>During Team Preview, scan the opposing team for Taunt users like Tapu Koko, Heatran, and Tomohawk and for powerful wallbreakers like Tapu Lele, Volkraken, Greninja, and Mega Alakazam. The opponent may try to use these Pokemon as anti-leads, so be wary of leading with Fidgit. When leading, Fidgit will want to use Trick Room while it's healthy, so set Trick Room first. If the opponent leads with Heatran or Tapu Koko against Fidgit, use Earth Power instead of Trick Room to punish these Taunt users. Fidgit's offensive move should be used only when it can wear down or KO a relevant threat; otherwise, it's better to use a utility move or switch out. Sometimes, Stealth Rock cannot be set up immediately during the first few turns of the battle. Instead, look for an opening mid-game for Fidgit to come back in and use it, as it's usually more important that Fidgit preserve its HP to set up Trick Room later in the match and to switch to an offensive teammate as soon as possible. If running Spikes, most of the time it is worth setting only one layer at a time. When Fidgit is low on health, it can be sacked to give an offensive teammate a free switch in.</p> <h1>Team Options</h1> <p>This set should be used exclusively on Trick Room teams. The best secondary Trick Room setter that pairs with Fidgit is Slowking, due to its ability to take on Volkraken, wide coverage, and access to Future Sight. Magearna is another option for a Trick Room setter, as it checks Psychic-types and has a much better match up with Pajantom. Standard Trick Room attackers appreciate Fidgit's extended Trick Room. Mega Mawile is the best Trick Room attacker, and Mega Camerupt paired with Pursuit Escavalier, Hoopa-U, and Crawdaunt are also great options. Swords Dance Tapu Bulu provides offensive presence and Grassy Terrain, which is very useful for Trick Room teams because it weakens Earthquake and provides passive recovery, and acts as an Ash-Greninja check. Drought Jumbao provides sun support for Mega Mawile's Fire Fang and Mega Camerupt's Fire Blast and improves Trick Room's matchup with rain teams. Jumbao also has access to Healing Wish and supplies powerful special moves that can break more physically defensive walls.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 196588, "username": "cbrevan"}, {"user_id": 298148, "username": "Mx"}, {"user_id": 395754, "username": "Jordy"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "Lumari"}, {"user_id": 195877, "username": "fleurdyleurse"}]}], "writtenBy": [{"user_id": 227784, "username": "snake_rattler"}]}
  },
  "Stratagem": {
    "overview": "<p>Stratagem's niche lies in its ability to check Tornadus-T, the best Defog user in the metagame, without consuming its team's Mega slot. With Fairium Z, Stratagem can simultaneously avoid losing its item to Tornadus-T's Knock Off and break past Arghonaut with careful play. Combined with a blistering Speed tier, decent Special Attack, and access to Stealth Rock, Stratagem seems like an ideal Stealth Rock setter for offensive teams. However, other Rock-types like Mega Crucibelle, Mega Diancie, and Mega Tyranitar generally outclass Stratagem, as they can switch into Tornadus-T more often due to their better bulk and resistances. They also bring more utility to their teams with a secondary STAB move and some combination of more power, pivoting ability, entry hazard deterrence, and Pursuit. On top of all that, Tornadus-T often run Focus Blast or Superpower for Equilibra, which makes it hard for Stratagem to check Tornadus-T reliably. Additionally, Stratagem's low bulk means it can't switch in too many times, further diminishing what it can bring to its team.</p> ",
    "comments": "<h1>Other Options</h1> <p>Stratagem doesn't have any other viable options.</p> <h1>Checks and Counters</h1> <p><strong>Choice Scarf Users</strong>: While Choice Scarf users like Volkraken, Tapu Lele, Jumbao, Kitsunoh, and Greninja can't switch in reliably, these Pokemon force Stratagem out, forcing it to find another opportunity to switch in.</p> <p><strong>Naturally Fast Pokemon: Mega Alakazam can switch into Stratagem a few times and nearly OHKO it back with Psychic. Ash-Greninja can outspeed and OHKO Stratagem as well. Tapu Koko Speed ties with Stratagem, making it risky to attack.</p> <p><strong>Sturdy Walls: Chansey, Revenankh, and Gastrodon wall Stratagem barring extremely niche options like Trick and Energy Ball. Celesteela and Jumbao can wall Stratagem if it opts for Earth Power as well.</p> <p><strong>Bulky Attackers: Pokemon that can take a hit and retaliate can generally KO or force out Stratagem. Mega Crucibelle is nearly OHKOed by Earth Power but generally takes Stratagem's other moves well. Offensive Pajantom can tank a Dazzling Gleam and retaliate with its Z-Move as well, while specially defensive Pajantom can also tackle Stratagem, especially if Stratagem has used Twinkle Tackle.</p> <p><strong>Priority: Priority users like Mega Mawile, Ash Greninja, Weavile, Syclant, Colossoil, and Caribolt can pick off a weakened Stratagem before it can attack, but they have a hard time switching into Stratagems coverage moves.</p> ",
    "sets": [
      {
        "name": "Offensive Stealth Rock",
        "description": "<h1>Moves</h1> <p>Paleo Wave, Stratagem's signature move, allows Stratagem to reliably pressure Tornadus-T, the metagame's most prominent Defog user. Dazzling Gleam gives Stratagem a chance to break past Arghonaut and hits specially bulky Pokemon like Mega Latios and Pajantom. Fire Blast 2HKOes Celesteela and defensive Jumbao, 3HKOes Equilibra, OHKOes Ferrothorn after some chip damage, and discourages Necturna from using Stratagem as setup bait. On the other hand, Earth Power reliably OHKOes Heatran and 2HKOes Mega Crucibelle and Tapu Koko, but these Pokemon are chipped down by Paleo Wave.</p> <h1>Set Details</h1> <p>Running Timid allows Stratagem to Speed tie with Tapu Koko and outspeed Weavile, Greninja, and Syclant. Fairium Z allows Stratagem to break past Arghonaut and Mega Sableye and ensures that Stratagem can switch into Tornadus-T's Knock Off reliably.</p> <h1>Usage Tips</h1> <p>Since Stratagem's main role is to take on the ubiquitous Tornadus-T, preserve its health specifically to switch into Tornadus-T if the opponent has one. However, U-turn can wear down Stratagem over a battle, so double switching into Tornadus-T can help to preserve its HP. The occasional Focus Blast variant can lure and KO Stratagem, so make sure to scout for the set first. Use Stratagem's Ground-type immunity to dissuade Landorus-T and Smokomodo from using Earthquake against Ground-weak teammates. However, if Landorus-T isn't pressured to use Earthquake, it's more likely to use U-turn to maintain momentum. If the opponent's switch-in can be 2HKOed, use that coverage move to retain momentum. Otherwise, use Stealth Rock on the forced switch. Using Stratagem's Z-Move at the right time is crucial. Make sure to use it if an opposing Arghonaut will faint or can't recover the damage or if Mega Latios, Pajantom, or other targets will be OHKOed. Late-game, Stratagem can spam Paleo Wave to clean up a weakened team if faster threats are eliminated, unless a coverage move will get the KO.</p> <h1>Team Options</h1> <p>Since using Mega Mawile, Mega Alakazam, Mega Medicham, or Mega Latios precludes the use of Mega Crucibelle, Mega Tyranitar, or Mega Diancie, Stratagem can be paired with these Mega Pokemon to reliably keep up Stealth Rock against Tornadus-T. Spikes setters like Ferrothorn and Greninja can stack entry hazards with Stratagem, quickly chipping down the opposing team. U-turn users like Tornadus-T, Landorus-T, and Kitsunoh help Stratagem come in more easily, and they appreciate Stratagem's Stealth Rock support. Pokemon like Choice Scarf Volkraken, Ash-Greninja, and Volcarona appreciate Stratagem's ability to remove opposing Arghonaut with Twinkle Tackle and hazard support, as this paves the way for a sweep.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 298148, "username": "Mx"}, {"user_id": 395754, "username": "Jordy"}, {"user_id": 339449, "username": "LucarioOfLegends"}]}, {"name": "Grammar checked by", "members": [{"user_id": 447027, "username": "frostration"}, {"user_id": 231476, "username": "Fireflame"}]}], "writtenBy": [{"user_id": 227784, "username": "snake_rattler"}]}
  },
  "Arghonaut": {
    "overview": "<p>Arghonaut is one of the best bulky Water-types in the CAP metagame, as it's capable of handling some of the most threatening Pokemon around such as Volkraken, Heatran, and Syclant. It also provides its team with valuable Spikes and potential Circle Throw support, which can quickly weaken the opposition. Its vast movepool lets it run quite a few different attacking moves such as Earthquake, Knock Off, and Circle Throw, letting it personalize its sets to better fit its team. Arghonaut's Unaware prevents it from being setup fodder for threats like Mega Charizard X and Naviathan. Its great bulk allows it to act as either a mixed or a special wall depending on your team's needs. However, Arghonaut is vulnerable to some very common threats like Mega Mawile, Mega Latios, Mega Alakazam, and Tornadus-T. Despite its great movepool and ability, it is still rather passive, and depending on the moves it runs, it can be bait for Pokemon like Tapu Lele and Mega Mawile. Finally, Arghonaut faces competition from Toxapex, which trades Unaware, Spikes, and a better matchup against Mega Tyranitar and Colossoil for the ability to wall offensive Tomohawk, Tornadus-T, and Magearna, Toxic Spikes, and greater resistance to being worn down thanks to Regenerator.</p> ",
    "comments": "<h1>Other Options</h1> <p>An Iapapa Berry can be used on more offensive teams to allow Arghonaut to gain back 50% of its health once without losing momentum by using Recover. Scald can be used to spread burns, but it uses Arghonaut's underwhelming Special Attack, and it can be an outright liability if you burn something like Tomohawk, as that would make it immune to Toxic. Gunk Shot can be used to lure in Jumbao and Tapu Bulu and also hits other Fairy- and Grass-types for heavy damage, but it's almost always outclassed by other moves. Ice Punch deals significant damage to Landorus-T and still breaks Necturna's Substitutes, but there is very little reason to run it otherwise.</p> <h1>Checks and Counters</h1> <p><strong>Psychic-types: Tapu Lele, Aurumoth, Mega Latios, Mega Latias, Mega Alakazam, and Mega Medicham threaten to deal severe damage to or outright OHKO Arghonaut, although most of them are too fragile to be switching in recklessly, especially disliking Knock Off, and can also be easily worn down by Spikes and Toxic.</p> <p><strong>Fairy-types: Mega Mawile, Clefable, and Mega Diancie beat Arghonaut with their STAB moves, and only Unaware Clefable cares about Toxic.</p> <p><strong>Electric-types: Tapu Koko, Krilowatt, Zapdos, and Caribolt force Arghonaut out, though the first two must be wary of Earthquake, and all of them can be crippled by Knock Off or Toxic.</p> <p><strong>Flying-types: Flying-types are an issue for Arghonaut, both offensively and defensively. Mega Pinsir, Flyinium Z Tornadus-T, and Landorus-T can threaten to OHKO it, and the latter two can even remove Spikes by using Defog. Defensive Tomohawk is another nuisance, especially if Arghonaut lacks Toxic.</p> <p><strong>Grass-types: Jumbao and Tapu Bulu can usually come in for free, only fearing Toxic and the rare Gunk Shot, and scare Arghonaut out with their STAB moves. Kartana can threaten Arghonaut with Leaf Blade, although it dislikes switching into Knock Off or Circle Throw. Ferrothorn dislikes losing its Leftovers, but is only 4HKOed by Circle Throw, can set up its own hazards or Leech Seed, and 2HKOes Arghonaut with Power Whip.</p> <p><strong>Toxic and Toxic Spikes: Poison severely hampers Arghonaut's durability by putting it on a timer, so Pokemon that usually carry Toxic or Toxic Spikes, like Equilibra, Gliscor, and Toxapex are huge threats.</p> ",
    "sets": [
      {
        "name": "Support",
        "description": "<h1>Moves</h1> <p>Knock Off is necessary to prevent Shell Smash Necturna from freely setting up a Substitute and potentially winning the game. Circle Throw allows Arghonaut to phaze foes to rock up Spikes damage and serve as an emergency check to setup sweepers that would otherwise beat it like Cawmodore, Hawlucha, and Reuniclus. Earthquake OHKOes Heatran after a bit of prior damage while dealing significant damage to Mega Mawile, Krilowatt, and Tapu Koko. Toxic is a more defensively oriented choice that cripples bulky threats like Jumbao and Zapdos.</p> <h1>Set Details</h1> <p>164 Defense EVs allow Arghonaut to avoid a 2HKO from Reuniclus's Psyshock and Choice Band Pajantom's Spirit Shackle. The rest of the EVs are invested in Special Defense with a Careful nature to better check threats like Volkraken and Greninja while living uninvested Reuniclus's Shattered Psyche. If your team can already check the aforementioned physical attackers, maximum Special Defense can be used to minimize the damage taken from Choice Specs Volkraken, even allowing Arghonaut to always survive its Hidden Power Grass on the switch when at full health. Unaware allows Arghonaut to better check setup sweepers like Naviathan.</p> <h1>Usage Tips</h1> <p>Early in the game, prioritize setting up Spikes to pressure the opponent's team or Knock Off to cripple any switch-in. Avoid setting up multiple layers until the opponent's entry hazard control is worn down unless you need the extra pressure. Circle Throw can be spammed after Spikes is set to wear down the opposition. If Earthquake is run, it should be used to take care of threats like Heatran and Volkraken or surprise an Electric-type switching in like Tapu Koko or Krilowatt. However, it should be used carefully, as it can let dangerous threats like Tomohawk, Tornadus-T, Mega Latios, and Mega Latias come in freely. If Arghonaut is required to stop a certain threat like Cawmodore or Hawlucha, which usually only get one chance at sweeping, prioritize keeping Arghonaut at full health so that it can phaze the sweeper before getting KOed. Always try to avoid switching Arghonaut in if Spikes or Toxic Spikes is on the field, as it will be quickly worn down. When using Toxic, wait for a clear chance to hit a vulnerable foe, preferably a bulky Pokemon that would otherwise be hard to deal with; Arghonaut has the bulk to take even some uninvested super effective attacks, so it doesn't have to play aggressively. If you use Toxic too soon, the opponent will become much more cautious and instead send in Pokemon not affected by the move.</p> <h1>Team Options</h1> <p>Bulky Grass-types like Jumbao, Tangrowth, and Ferrothorn are some of the best possible teammates for Arghonaut, as they can check  Electric-types, while Arghonaut handles Heatran and Volkraken in return. The latter two can also use Stealth Rock to further stack up entry hazards. Steel-types can check a lot of types that threaten Arghonaut, resisting Flying, Fairy, and Psychic, and appreciate Arghonaut taking on Ground- and Fire-types. Besides the aforementioned Ferrothorn, Heatran, Celesteela, and Equilibra are great picks for this role. Ground-types such as Landorus-T, Colossoil, and Gliscor can dissuade the opponent from spamming Electric-type moves and appreciate Arghonaut's ability to check Greninja and Syclant. Powerful wallbreakers like Mega Mawile, Mega Medicham, Kyurem-B, and Tapu Lele can force switches and become even more dangerous with Spikes helping them wear down their checks. VoltTurn users such as Tornadus-T, Krilowatt, and Tapu Koko benefit a lot from the extra damage provided by Spikes. Spinblockers can help keep Spikes up, particularly against Tomohawk. Specially defensive Pajantom and Kitsunoh are some of the best choices for this role.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 227784, "username": "snake_rattler"}, {"user_id": 395754, "username": "Jordy"}, {"user_id": 339349, "username": "LucarioOfLegends"}]}, {"name": "Grammar checked by", "members": [{"user_id": 331519, "username": "CryoGyro"}, {"user_id": 232216, "username": "Lumari"}]}], "writtenBy": [{"user_id": 298148, "username": "Mx"}]}
  },
  "Kitsunoh": {
    "overview": "<p>Thanks to its typing and solid Speed tier when backed up by a Choice Scarf, Kitsunoh is one of the best offensive checks to many dangerous common offensive Pokemon like Aurumoth, Mega Alakazam, Tapu Lele, and Mega Medicham. Kitsunoh keeps up momentum thanks to its access to U-turn, which also helps it escape from incoming Pursuit trappers. On the other hand, Kitsunoh's low stats outside of its Speed severely limit the viability of other sets, making it rather one-dimensional. Its underwhelming bulk means that it can only switch into the Pokemon it wants to check a few times per game, as powerful attacks like Mega Crucibelle's Stone Edge and Tapu Lele's Psychic will still deal significant damage. Its mediocre Attack stat means that Kitsunoh usually fails to deal with bulky Pokemon and requires significant chip damage to revenge kill targets not weak to its STAB moves, as threats such as Volkraken can avoid being KOed by coverage like Earthquake. On top of that, because of its typing and the fact that it usually runs a Choice Scarf set, Kitsunoh is very vulnerable to Pursuit, as trappers like Weavile, Mega Tyranitar, and Colossoil can easily dispose of Kitsunoh if it doesn't constantly use U-turn. Additionally, Kitsunoh has to be wary of Shadow Sneak from Necturna, a Pokemon that it often wants to check.</p> ",
    "comments": "<h1>Other Options</h1> <p>Foul Play is an option to revenge kill Cawmodore but has little use otherwise. A defensive set can better utilize Kitsunoh's typing and its wide array of utility options like Defog, Will-O-Wisp, and Wish. However, even with investment, Kitsunoh's defenses are lacking, and it is very hard to fit the moves it needs on one set. For these reasons, this set only fits on stall builds that have trouble with Mega Medicham and Mega Crucibelle.</p> <h1>Checks and Counters</h1> <p><strong>Pursuit trappers: Mega Tyranitar, Colossoil, and Weavile are the biggest threats to Kitsunoh, as their mere presence forces it to play very carefully to avoid being trapped. Colossoil can also play mind games with Sucker Punch to KO Kitsunoh before it can move if it tries to stay in. However, they need to be careful about U-turn, which Kitsunoh will use as much as possible when they are present, and are also threatened by Meteor Mash.</p> <p><strong>Walls: Because Kitsunoh lacks firepower, generic physical walls like Arghonaut, Tomohawk, Cyclohm, and Zapdos can easily deal with Kitsunoh and are not even threatened by super effective coverage, although they can be crippled by Trick.</p> <p><strong>Bulky Ground-types: Landorus-T, Garchomp, and Gliscor immediately threaten Kitsunoh out with Earthquake and have enough bulk to avoid taking too much damage from most of Kitsunoh's attacks.</p> <p><strong>Fire-types: Volkraken, Heatran, and Smokomodo can easily dispatch of Kitsunoh with their STAB moves but have a hard time switching in because of the threat of Earthquake. However, if Kitsunoh reveals Meteor Mash, they are usually safe switch ins. Volcarona can't switch in, but in addition to the threat of its Fire-type moves, it can also set up with Quiver Dance if Kitsunoh chooses to switch out.</p> <p><strong>Other Bulky Attackers: Pokemon like Tornadus-T and Mega Mawile can't switch in easily but threaten Kitsunoh with Knock Off and Sucker Punch, respectively, and Kitsunoh fails to KO them even with the appropriate coverage. Additionally, Rocky Helmet variants of Tornadus-T can punish the use of U-turn.</p> <p><strong>Offensive Pressure: Because Kitsunoh's defenses are mediocre and it's used to soft check powerful threats like Mega Crucibelle and Mega Alakazam, it can be worn down very quickly if the opponent maintains offensive pressure, either by repeatedly using powerful resisted attacks or by wearing Kitsunoh down with entry hazards. This can render Kitsunoh unable to do its job effectively.</p> ",
    "sets": [
      {
        "name": "Choice Scarf",
        "description": "<h1>Moves</h1> <p>Shadow Strike, Kitsunoh's signature move, is a decent Ghost-type STAB move that allows Kitsunoh to revenge kill Mega Alakazam and Aurumoth. U-turn is required because Kitsunoh is forced out very easily early-game, so it needs to be able to pivot out out of those situations. The last slot is very situational in general and really depends on what you want Kitsunoh to do: Trick allows it to cripple walls, Toxic allows it to cripple Pokemon like Arghonaut without giving up its item, and lastly, Earthquake allows it to hit Heatran, Magearna, and Volkraken consistently.</p> <h1>Set Details</h1> <p>36 Special Defense EVs are used to always avoid the 2HKO from unboosted Tapu Lele's Psychic.</p> <h1>Usage Tips</h1> <p>While Kitsunoh's typing gives it plenty of opportunities to switch into resisted attacks, it should only do so when necessary, as strong resisted moves like Tapu Lele's Psychic will wear it down very quickly. Kitsunoh should use U-turn liberally early- and mid-game to keep momentum and pivot out of unfavorable situations to an appropriate teammate. Be particularly cautious against Pursuit trappers, as they can put Kitsunoh in a checkmate situation if it doesn't lock on a move capable of threatening them. This means that even if Kitsunoh manages to grab a KO, they will then be able to eliminate Kitsunoh right afterwards. For this reason, Kitsunoh should try to avoid using Shadow Strike as much as possible when these threats are on the opposing team, and instead focus on using U-turn and Meteor Mash. Remember that because of its low base Attack, Kitsunoh needs threats like Aurumoth, Tornadus-T, and Magearna weakened before it can revenge kill them. Kitsunoh should use Trick to cripple bulky switch-ins when its Choice Scarf is no longer useful. However, it's particularly important to avoid using it if you are facing threats like Aurumoth and Mega Alakazam, which will require Kitsunoh to use the extra Speed provided by Choice Scarf.</p> <h1>Team Options</h1> <p>Entry hazard setters are indispensable to help Kitsunoh KO opposing Pokemon. Heatran, Mega Crucibelle, Mega Diancie, and Mega Tyranitar are great picks for Stealth Rock setters thanks to their good matchup against Tornadus-T, the most common Defogger in the metagame. Spikes are another way to wear down the opposing team, so Arghonaut, Ferrothorn, and Greninja are good options too. Tornadus-T provides a valuable Ground-type immunity, can use Defog to clear entry hazards, and can use U-turn while threats like Mega Crucibelle and Mega Diancie come in, putting Kitsunoh in a good position as it switches in. Fighting-types like Arghonaut, Mega Medicham, and Tomohawk pair well with Kitsunoh, pressuring Dark-types while Kitsunoh checks Psychic- and Fairy-types for them. Fairy-types are another way to threaten Dark-types, so Magearna and Tapu Lele are also good teammates. Finally, wallbreakers like Mega Alakazam, Flame Orb Colossoil, and Aurumoth appreciate Kitsunoh letting them in for free with U-turn and can break most walls that trouble Kitsunoh. Thanks to its typing, Kitsunoh is capable of supporting Steel-types like Heatran, Ferrothorn, and Magearna that are quickly worn down by Focus Blast from offensive Psychic-types like Mega Alakazam and Tapu Lele, which is especially useful considering the pressure that these Pokemon exert.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 227784, "username": "snake_rattler"}, {"user_id": 395754, "username": "Jordy"}, {"user_id": 231402, "username": "xavgb"}]}, {"name": "Grammar checked by", "members": [{"user_id": 231476, "username": "Fireflame"}, {"user_id": 232216, "username": "Lumari"}]}], "writtenBy": [{"user_id": 298148, "username": "Mx"}]}
  },
  "Cyclohm": {"sets": [{"name": "Physically Defensive"}]},
  "Colossoil": {
    "overview": "<p>Colossoil is a powerful physical attacker that can function as either a hard-hitting wallbreaker or a specially inclined tank. Guts turns Colossoil into a powerhouse, allowing it to break through even dedicated checks such as Tomohawk and Jumbao with Facade while also giving Colossoil strong priority with Sucker Punch and a powerful Pursuit, which allows it to crack teams open with proper prediction. Its second ability, Rebound, bounces back status moves on the turn it switches in, which can prevent entry hazards from being set up with the right prediction. However, Colossoil can't fit everything it wants into its four moveslots, as it needs Earthquake and Knock Off, so it has to pick between Sucker Punch, Pursuit, Facade, Rapid Spin, and U-turn. Additionally, its middling Speed combined with its poor matchup against common offensive threats like Hawlucha, Tapu Koko, Ash-Greninja, and Jumbao means that Colossoil can struggle against offense. Finally, Colossoil faces competition as a Pursuit trapper from Weavile and Mega Tyranitar, as the former has an easier time revenge killing threats thanks to its higher Speed and doesn't need to play mind games with Necturna to beat it thanks to Ice Shard, while the latter has a better matchup against Tornadus-T and also serves as a solid Stealth Rock setter.</p> ",
    "comments": "<h1>Other Options</h1> <p>A Choice Scarf set can be used to give Colossoil a much better matchup against faster threats like Mega Crucibelle and Tapu Koko. It also provides a valuable way to check faster Pokemon and can revenge kill Cawmodore with Foul Play after it uses Belly Drum, as a boosted Bullet Punch fails to KO from full health.</p> <h1>Checks and Counters</h1> <p><strong>Tomohawk: Defensive Tomohawk can switch into anything but Facade with impunity and then use Colossoil to set up Stealth Rock or Rapid Spin safely, although it dislikes losing its item. Offensive sets are easier to wear down but can outspeed Adamant Colossoil and KO it with Focus Blast.</p> <p><strong>Landorus-T</strong>: Defensive Landorus-T can switch into Colossoil several times and either threaten it out with Earthquake or use it to set up Stealth Rock or use Defog. Choice Scarf and Z-Crystal variants can also check Colossoil, but they must be wary of switching into Facade. Choice Scarf sets also have to watch out for Knock Off, since it's a 2HKO with Sucker Punch after Stealth Rock if Guts is activated.</p> <p><strong>Grass-types</strong>: Jumbao and Tapu Bulu can tank any attack aside from Guts-boosted Facade with relative ease and force Colossoil out with their super effective STAB moves. Kartana and Caribolt can't switch in easily but can reliably revenge kill Colossoil with their STAB moves as long as they are not in range of Sucker Punch.</p> <p><strong>Water-types: Arghonaut can switch into a Dark-type move and threaten Colossoil out; however, it is 2HKOed by a Guts-boosted Earthquake. Offensive Water-types such as Volkraken and both Greninja formes outspeed and OHKO Colossoil, but must be wary of switching in.</p> <p><strong>Faster Attackers: Due to its mediocre Speed, many offensive threats, such as Tapu Lele and Tornadus-T, are capable of forcing Colossoil out.</p> ",
    "sets": [
      {
        "name": "Flame Orb",
        "description": "<h1>Moves</h1> <p>Facade is the preferred choice in the last moveslot, as it provides Colossoil with a powerful neutral coverage move, allowing it to break through would-be checks such as Tomohawk, Landorus-T, and Jumbao with the right prediction. Pursuit can be used to capitalize on Colossoil's power to remove or heavily weaken Pokemon it often forces out, such as Pajantom, Heatran, Equilibra, and Chansey. U-turn is another alternative to keep up momentum.</p> <h1>Set Details</h1> <p>Flame Orb is the optimal item for an offensive set, because it reliably activates Guts. A Jolly nature is preferred to outspeed Landorus-T and to Speed tie with Pokemon such as Tapu Lele and Kyurem-B. Alternatively, an Adamant nature can be run to make it easier to break past Mega Scizor and Arghonaut.</p> <h1>Usage Tips</h1> <p>Get Colossoil in on Pokemon it can force out like Heatran, Magearna, Aurumoth, and Mega Tyranitar as soon as you can and start throwing out Guts-boosted Knock Offs and Earthquakes to create holes in the opposing team. As Colossoil's power can force out many slower Pokemon, Colossoil can punish them through Pursuit or U-turn. If you're facing a Tomohawk, you can fully expect to see them switch in to keep Colossoil's impact to a minimum. You can use this predictability to remove its item with Knock Off the first time it switches in and then use Facade to deal severe damage to it or U-turn to pivot into a teammate that can threaten it. Pursuit is also incredibly useful here, because it can force the Pokemon switching out into Tomohawk to take severe damage. It's also very important to have a good read on your opponent in case they try to play around Sucker Punch and Pursuit. Turn the tables on your opponent by using the threat of a Sucker Punch to force a switch, and then take a chunk out of the retreating Pokemon with Pursuit. Likewise, be aware of Pokemon such as Greninja, Shell Smash Necturna, and Choice Band Syclant, which can play around Sucker Punch through entry hazards, setup moves, faster priority, or Substitute.</p> <h1>Team Options</h1> <p>Entry hazards are the name of the game with Colossoil, as it rapidly breaks down defensive cores after a layer of hazards. Stealth Rock setters such as Mega Crucibelle, Mega Diancie, Landorus-T, and Ferrothorn all have synergy with Colossoil, as they can check Fighting-, Grass-, and Water-types. Syclant and both Greninja formes work well as offensive Spikes setters, and they appreciate Colossoil's ability to wear down Arghonaut. They can also give you opportunities to bring Colossoil in with U-turn. Other offensive Ground-types, such as Landorus-T, appreciate Colossoil's ability to wear down checks like Jumbao. In return, Landorus-T can potentially net an OHKO on Tomohawk with Supersonic Skystrike. Powerful special attackers such as Tapu Koko, Tapu Lele, Volkraken, Mega Alakazam, and Magearna are good choices too, as they can pressure physically defensive walls such as Landorus-T and Tomohawk.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 395754, "username": "Jordy"}, {"user_id": 339349, "username": "LucarioOfLegends"}, {"user_id": 227784, "username": "snake_rattler"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "martha"}, {"user_id": 232216, "username": "Lumari"}]}], "writtenBy": [{"user_id": 196588, "username": "cbrevan"}, {"user_id": 298148, "username": "Mx"}]}
  },
  "Krilowatt": {
    "overview": "<p>Krilowatt acts as a great wallbreaker and pivot thanks to its wide coverage and good Speed tier. It also sports a phenomenal ability in Magic Guard and has an absurdly high HP stat, allowing it to switch in and out of the battle often while keeping momentum with Volt Switch, which gives Krilowatt a way to pivot out of bulky Grass-types and special walls that want to switch in. Its solid base 105 Speed tier allows it to outpace threats such as Jumbao and Pajantom, and its great HP stat allows it to blanket check a wide variety of Pokemon. However, despite its wide coverage, it is overly reliant on Life Orb to do sizable damage due to its relatively low Special Attack stat; because of this, it doesn't appreciate Knock Off, which makes it a mediocre Tornadus-T check. Furthermore, if Krilowatt is not hitting something super effectively, its damage output is rather underwhelming.</p> ",
    "comments": "<h1>Other Options</h1> <p>Scald is an option for a Water-type STAB move that can spread burns, but Krilowatt would rather have access to Surf's higher Base Power.</p> <h1>Checks and Counters</h1> <p><strong>Bulky Grass-types</strong>: Bulky Grass-types such as defensive Jumbao, Ferrothorn, and Assault Vest Tangrowth can all take Ice Beam from Krilowatt and threaten it out with their Grass-type STAB moves. The majority of these Pokemon allow Krilowatt to safely pivot out except Jumbao, which outspeeds Krilowatt when running Choice Scarf. Additionally, a healthy Necturna can set up against Krilowatt.</p> <p><strong>Chansey: Chansey can wall Krilowatt and heal off the damage or set up Stealth Rock and wear down Krilowatt with Seismic Toss. However, it's easily taken advantage of with Volt Switch.</p> <p><strong>Ground-types</strong>: Ground-type Pokemon such as Colossoil and Landorus-T can all threaten Krilowatt with their super effective STAB attacks  however, they have a hard time switching in directly due to Surf and Ice Beam. Gastrodon completely walls Krilowatt.</p> <p><strong>Faster Attackers: Faster attackers such as Mega Alakazam, Syclant, Ash-Greninja, Choice Scarf Tapu Lele, and Mega Lopunny can pick off Krilowatt by virtue of their good offenses and coverage, but Krilowatt can tank their moves if it is at high health.</p> <p><strong>Bulky Attackers: Bulky attackers such as Kyurem-B, Mega Tyranitar, Mega Mawile, and Magearna can all shrug most moves that Krilowatt uses and hit it back hard.</p> ",
    "sets": [
      {
        "name": "All-out Attacker",
        "description": "<h1>Moves</h1> <p>Ice Beam targets prominent Ground-types such as Landorus-T and Garchomp, 2HKOes the likes of offensive Jumbao, Pajantom, and Necturna, and wears down Tangrowth and Jumbao significantly. Earth Power can be used if hitting Levitate Equilibra isn't as important, allowing Krilowatt to hit Assault Vest Magearna, Tapu Koko, and Mega Mawile.</p> <h1>Set Details</h1> <p>A Timid nature maximizes Krilowatt's Speed, allowing it to outspeed base 100s such as Mega Medicham as well as key threats such as Pajantom.</p> <h1>Usage Tips</h1> <p>Volt Switch should be used early-game to lure in and pivot out of Krilowatt's checks such as Ferrothorn and Assault Vest Magearna. Prediction is essential when using Krilowatt, as its wide coverage allows it to hit Pokemon such as Tapu Koko, Tangrowth, and Magearna super effectively. Thanks to its incredibly high natural bulk, Krilowatt can be used to soft check offensive Pokemon like Mega Alakazam and Kyurem-B. However, through doing so, it's quickly worn down and may struggle to switch into play later.</p> <h1>Team Options</h1> <p>Pokemon with Volt Switch or U-turn such as Rotom-W, Syclant, and Tornadus-T complete a good VoltTurn core alongside Krilowatt, helping your team keep up momentum. Flying-types such as Tornadus-T and Mega Pinsir are great partners for Krilowatt, as they can take the Grass- and Ground-type attacks that Krilowatt fears. Entry hazard setters such as Heatran and Mega Tyranitar help Krilowatt achieve certain KOs against foes such as Tapu Koko, Cawmodore, and Magearna. However, Krilowatt especially benefits from Spikes support from Pokemon like Syclant, Ash-Greninja, Ferrothorn, and Greninja, as Spikes can consistently wear down switch-ins like Jumbao, allowing Krilowatt to overwhelm them. When using Krilowatt, it's essential that you have another Tornadus-T check like Magearna or Rotom-W to deal with it, as Krilowatt will always risk losing its Life Orb if it attempts to check Tornadus-T. Due to Krilowatt's inability to threaten stall teams, stallbreakers such as Tapu Lele and Mega Mawile are good partners to deal with them. Krilowatt is also a fairly good pivot and status absorber, helping these Pokemon switch into play.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 227784, "username": "snake_rattler"}, {"user_id": 395754, "username": "Jordy"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "Lumari"}, {"user_id": 336073, "username": "Rabia"}]}], "writtenBy": [{"user_id": 196075, "username": "MeepBard"}]}
  },
  "Tomohawk": {
    "overview": "<p>As a Flying-type that can control entry hazards, Tomohawk massively competes with Tornadus-T, which is much faster, does not have to waste turns healing up, can cripple checks with Knock Off, and can generate momentum with U-turn. However, Tomohawk has a few unique niches that allow it to contend with Tornadus-T. For one, it has access to STAB-boosted Focus Blast and can usually afford to run it on offensive sets, whereas Tornadus-T struggles to fit it, which makes it easier to deal with common Steel-types such as Magearna, Heatran, and Celesteela. Additionally, Tomohawk can act as an emergency check to setup sweepers thanks to its access to Prankster and Haze. However, bulky support sets are very passive and thus tend to create free turns for common scary wallbreakers such as Kyurem-B, Mega Alakazam, and Pajantom. It also fails to check many common setup sweepers like Magearna, Reuniclus, and Tapu Lele reliably. Access to Prankster Healing Wish also allows Tomohawk to support hyper offense teams well, and its access to both Rapid Spin and Stealth Rock helps it control hazards. However, Tomohawk tends to have a bad matchup against common Defoggers like Tornadus-T and Tapu Fini, often making it a suboptimal choice to set Stealth Rock. Lastly, the combination of Hurricane and Focus Blast is rather unreliable, but the high Base Power is necessary for Tomohawk to hit appreciably hard.</p> ",
    "comments": "<h1>Other Options</h1> <p>A specialized offensive support set consisting of Hurricane and Stealth Rock and two of Healing Wish, Memento, Taunt, and Haze with Flyinium Z or Focus Sash can be run on hyper offensive teams. These teams appreciate Tomohawk's ability to to set Stealth Rock, give a sweeper a second chance at sweeping, provide setup opportunities, and check opposing sweepers, preventing them from getting out of control. While this set is fairly customizable, it really only fits well on purely offensive teams. An offensive set with Intimidate can be run to allow Tomohawk to tank more hits while firing off its powerful STAB moves, but losing out on Prankster is often not worth it. An offensive set using Life Orb and Nature Power, which is affected by Prankster, can be run to finish off weakened threats like Mega Latios before they move. The combination of Substitute with Toxic, Haze, or Taunt with 212 HP EVs can be used to annoy teams that rely on Toxic to deal with Tomohawk. The HP investment makes sure that Chansey will fail to break Tomohawk's Substitute with one Seismic Toss.</p> <h1>Checks and Counters</h1> <p><strong>Psychic-types: Psychic-types like Mega Alakazam, Tapu Lele, Mega Latios, and Hoopa-U can OHKO Tomohawk with ease. They can tank defensive Tomohawk's Hurricane easily but have a harder time against offensive variants' Hurricane and Supersonic Skystrike. Notably, Mega Latios and Mega Alakazam have access to reliable recovery, making them a lot more consistent answers than Tapu Lele and Hoopa-U. Mega Medicham and Aurumoth can 2HKO defensive and OHKO offensive variants of Tomohawk, but they must be wary of its Flying-type STAB moves. Although uncommon, Assault Vest Slowking is one of offensive Tomohawk's most reliable counters thanks to its massive special bulk and Regenerator.</p> <p><strong>Fairy-types: Mega Diancie, Mega Mawile, and Magearna don't really mind Hurricane or Air Slash because of their secondary typings and almost always carry STAB moves that can severely hurt Tomohawk, but they might not like taking a Focus Blast. Clefable and Jumbao take advantage of defensive Tomohawk's passivity and threaten it out with Moonblast; however, both are pressured by Hurricane.</p> <p><strong>Flying-types: Tornadus-T, opposing Tomohawk, and Mega Pinsir can OHKO all Tomohawk variants that don't have Coba Berry. Although defensive Tomohawk can tank their Z-Moves with Coba Berry, Flyinium Z Landorus-T or Gyarados can still break through defensive Tomohawk with Knock Off support.</p> <p><strong>Electric-types: Tapu Koko and Zapdos have the resistances to deal with offensive Tomohawk adequately and defensive Tomohawk well, and Tomohawk is forced out by their Electric-type STAB moves. Krilowatt has incredible natural bulk, allowing it to come in on Tomohawk's Flying-type STAB moves with ease, though it's 2HKOed by offensive Tomohawk's Focus Blast and does not have any reliable recovery. Caribolt, while a generally less reliable defensive check, can overwhelm defensive variants of Tomohawk with Magnet-boosted Return and Quick Attack.</p> <p><strong>Toxic: Toxic users like Gliscor and Toxapex wear down defensive Tomohawk significantly, forcing it out.</p> <p><strong>Other Wallbreakers: Volkraken, Ash-Greninja, Kyurem-B, and Heatran have the wallbreaking power necessary to break apart defensive Tomohawk, but they struggle to switch directly into offensive variants. Pajantom stands out because it does not use raw power to break through defensive Tomohawk; instead, it traps it with Spirit Shackle and consistently wears it down with Heal Block.</p> ",
    "sets": [
      {
        "name": "Offensive Support",
        "description": "<h1>Moves</h1> <p>STAB Focus Blast is what grants Tomohawk its niche over Tornadus-T, notably hitting Steel-types like Heatran and Ferrothorn for super effective damage while also heavily damaging other Flying-type answers such as Mega Tyranitar, Krilowatt, and Rotom-W. Haze is generally preferred for this seteven if Tomohawk can't outlast a sweeper's unboosted attacks, simply removing the boosts can swing momentum back into Tomohawk's team's favor. Alternatively, since Tomohawk has a good matchup against common entry hazard setters like Heatran, Arghonaut, and Ferrothorn, Rapid Spin can be run if its team needs hazard control. It should also be noted that Tomohawk is extremely good at pressuring Necturna and Pajantom, the best spinblockers in the metagame. If Tomohawk needs to act as a stallbreaker, Taunt can be used to shut down defensive Pokemon such as Chansey and Celesteela.</p> <h1>Set Details</h1> <p>With a Timid nature, Tomohawk outspeeds Timid Heatran, Modest Tapu Lele, and Adamant Colossoil. Flyinium Z is the preferred item because it allows Tomohawk to fire off 100% accurate Supersonic Skystrike, notably KOing Pajantom and Mega Latios after minor chip damage. It also OHKOes Caribolt and lets Tomohawk act as a great Knock Off switch-in. Life Orb can be used on Taunt sets to 2HKO Mega Sableye and OHKO Mega Aggron, Pokemon that are found mostly on stall teams. 29 HP IVs should be run with Life Orb to minimize recoil damage. A Modest nature is an option for extra power, but it misses out on outspeeding a few important Pokemon like Timid Heatran, Jolly Hoopa-U, and Adamant Colossoil.</p> <h1>Usage Tips</h1> <p>You should evaluate which Pokemon Tomohawk should use its Supersonic Skystrike on from Team Preview, as teams will commonly have multiple checks to Tomohawk, such as Mega Latios and Pajantom, so it's worth considering which Pokemon could prove to be more troublesome in the long run. Haze should be used as an emergency check to dangerous sweepers, namely Magearna, Tapu Lele, and Aurumoth, at the expense of potentially having to sacrifice Tomohawk. Tomohawk can switch into and immediately remove the entry hazards of Pokemon like Arghonaut, Ferrothorn, and Snaelstrom thanks to its favorable matchup against them. Use Taunt against bulky Pokemon like Chansey and Celesteela to prevent them from recovering HP or crippling Tomohawk with status, respectively. Doing this is especially useful in the stall matchup.</p> <h1>Team Options</h1> <p>Stealth Rock support from Pokemon such as Mega Diancie, Heatran, and Mega Tyranitar is important for Tomohawk to KO Pajantom and Mega Latios with Supersonic Skystrike on the switch. Sturdy Steel-types such as Celesteela and Magearna are excellent teammates because of Tomohawk's general weakness to Psychic- and Fairy-type Pokemon. Bulky Grass-types such as Jumbao and Ferrothorn can check Tapu Koko and Krilowatt for Tomohawk, which it tends to struggle against. Additionally, Ferrothorn can set Spikes for Tomohawk and checks Kyurem-B. Pursuit trappers such as Mega Tyranitar and Weavile can dispose of Pokemon like Mega Latios and Pajantom, allowing Tomohawk to use its Z-Move to nuke other Pokemon. Electric-types like Tapu Koko and Rotom-W are good teammates for their ability to take on Tornadus-T, which Tomohawk struggles against.</p> "
      },
      {
        "name": "Defensive Support",
        "description": "<h1>Moves</h1> <p>Defensive Tomohawk can remove entry hazards with Rapid Spin many times throughout the match, but it struggles to really pressure hazard setters. Tomohawk can use Stealth Rock instead of Rapid Spin if its team already has an hazard remover. However, it should be noted that Tomohawk matches up poorly against common hazard removers, namely Tornadus-T and Tapu Fini, meaning that it does struggle to reliably keep hazards up. Hurricane is a powerful move that allows Tomohawk to OHKO Mega Pinsir, Hawlucha, and opposing offensive Tomohawk while 2HKOing Arghonaut. Air Slash is an alternative option with better accuracy but is notably weaker and does not permit Tomohawk to hit any of the benchmarks mentioned earlier.</p> <h1>Set Details</h1> <p>Investment in physical bulk notably allows Tomohawk to deal with Pokemon such as Smokomodo and Kartana more easily. Coba Berry allows Tomohawk to tank Supersonic Skystrike from Landorus-T and Gyarados with ease, allowing it to wall these Pokemon. It also buys a free turn to tank Aerilate Return from Mega Pinsir, Hurricane from opposing Tomohawk, and Acrobatics from Hawlucha, giving Tomohawk a chance to retaliate with Hurricane or Air Slash. Rocky Helmet deals chip damage to contact attackers, discouraging the opponent from using U-turn against Tomohawk. Icium Z allows Tomohawk to Haze away boosts and heal at the same time, allowing it to neutralize a sweeper without risking Tomohawk fainting.</p> <h1>Usage Tips</h1> <p>You should identify setup sweepers such as Necturna and Kartana at Team Preview, which Tomohawk should attempt to check throughout the match with the combination of Haze and Roost. Tomohawk will often force these Pokemon out, so it can use Rapid Spin or Stealth Rock against them without much of a drawback. If Pokemon like Mega Latios, Mega Alakazam, and Magearna are anticipated to switch in, Tomohawk should switch out to prevent a loss of momentum. Coba Berry variants should be wary of Knock Off from Pokemon like Colossoil and Kartana if there's a threat that Tomohawk needs Coba Berry to check, such as Flyinium Z Landorus-T.</p> <h1>Team Options</h1> <p>Pursuit trappers such as Weavile, Mega Tyranitar, and Colossoil benefit from Tomohawk, which often gives free turns to common Pokemon like Mega Latios, Pajantom, and Tornadus-T, which are susceptible to Pursuit. Defensive Steel-types like Celesteela can check troublesome Psychic- and Fairy-types such as Mega Latios, Clefable, and Mega Diancie. Jumbao and Ferrothorn can check Tapu Koko and Krilowatt, which can take advantage of Tomohawk's passivity. Since this set does not carry Fighting-type coverage, Heatran checks such as Mega Latios, Gliscor, and Mega Tyranitar are important teammates. Defensive Electric-types like Rotom-W, Cyclohm, and Zapdos are good teammates for Tomohawk because they can take on Flying-types like Tornadus-T, which Tomohawk tends to struggle against.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 227784, "username": "snake_rattler"}, {"user_id": 208105, "username": "Jho"}, {"user_id": 298148, "username": "Mx"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "Lumari"}, {"user_id": 273636, "username": "GMars"}]}], "writtenBy": [{"user_id": 395754, "username": "Jordy"}]}
  },
  "Necturna": {
    "overview": "<p>Necturna is one of the most threatening sweepers on teams that aim to stack entry hazards and continually wear down the opposition. Necturna fits particularly well on these teams because it will often need chip damage on the opposition to efficiently sweep. While its typing is amazing offensively, it's also pretty good defensively, granting Necturna resistances to Electric, Water, and Ground and an immunity to Normal and Fighting, allowing it to set up on Pokemon like Tapu Koko, Gliscor, and Chansey. However, Necturna has a hard time setting up initially because of its susceptibility to faster Pokemon like Tornadus-T and Heatran. In addition, it's vulnerable to priority from Pokemon like Weavile and Syclant because of Shell Smash's defense drops. Although Necturna can use Shadow Sneak to pick off weakened faster Pokemon, it's still outsped by common Choice Scarf users like Tapu Lele and Victini even after setting up with Shell Smash.</p> ",
    "comments": "<h1>Other Options</h1> <p>A Belly Drum set is an option that can sweep much earlier than Shell Smash variants thanks to its massively improved damage output. However, because of the fact that Belly Drum cuts into Necturna's HP, combined with this set's reliance on Shadow Sneak to deal with anything faster, it's often seen as unreliable. A Choice Band set can be run to act more as a wallbreaker and to lure traditional answers with moves like V-create, Bolt Strike, and Dragon Ascent. Necturna is quite slow, though, so it's often unreliable at breaking walls. Necturna can drop Shadow Claw and Ghostium Z in favor of running Rockium Z along with Stone Edge to take on Tornadus-T more reliably, but the fact that Necturna won't be able to deal with weakened Steel-types by itself is rather undesirable.</p> <h1>Checks and Counters</h1> <p><strong>Flying- and Fire-types: Flying- and Fire-types like Tornadus-T, Hawlucha, and Heatran are capable of outspeeding Necturna and can prevent it from using Shell Smash. However, if Necturna has already used Shell Smash, these Pokemon can struggle to check it, especially if Never-Ending Nightmare hasn't been used yet. Hawlucha, however, can even outspeed a boosted Necturna if Unburden is activated.</p> <p><strong>Tomohawk: Tomohawk is the best defensive check to Necturna, being capable of removing Necturna's boosts with Haze, negating damage with Roost, and retaliating with its Flying-type STAB moves.</p> <p><strong>Choice Scarf Users</strong>: Choice Scarf users like Volkraken, Jumbao, Weavile, and Kartana are not particularly bothered by even a boosted Shadow Sneak and can easily OHKO Necturna after it has used Shell Smash. They're really easy to wear down over time, though, leaving them susceptible to a boosted Shadow Sneak.</p> <p><strong>Cyclohm: Cyclohm has the bulk necessary to take even a boosted Never-Ending Nightmare, and it can even retaliate with Flamethrower and Ice Beam.</p> <p><strong>Priority</strong>: Priority from Pokemon like Weavile, Syclant, Mega Mawile, and Mega Pinsir can OHKO Necturna after it has set up. They must be wary of Shadow Sneak, though, because they're easy to wear down into range of a boosted Shadow Sneak. Additionally, Mega Mawile is rather unreliable, as Sucker Punch fails if Necturna uses Shadow Sneak.</p> <p><strong>Multiple Z-Move Targets: Necturna will often want to use its Z-Move on Pokemon like Ferrothorn, Celesteela, Magearna, and Tornadus-T. If you have a combination of these Pokemon, Necturna will often find itself incapable of sweeping because it can't overwhelm all these Pokemon on its own.</p> ",
    "sets": [
      {
        "name": "Shell Smash",
        "description": "<h1>Moves</h1> <p>Power Whip allows Necturna to deal with Pokemon like Toxapex and Arghonaut. Although it's quite weak and may appear to be an odd pick on a sweeper that boosts its Speed, Shadow Sneak is incredibly important; most notably, it allows Necturna to deal with Pokemon that are faster than it even at +2, such as Mega Alakazam and Choice Scarf Kitsunoh. It also allows Necturna to pick off Choice Scarf Volkraken once weakened.</p> <h1>Set Details</h1> <p>204 Speed EVs allow Necturna to outspeed Mega Lopunny after it has used Shell Smash. Ghostium Z allows Necturna to break through bulky Steel-types like Celesteela, Magearna, and Ferrothorn, which could otherwise check it pretty well.</p> <h1>Usage Tips</h1> <p>Necturna should be played very patiently, as it needs as much chip damage on its checks as possible to ultimately sweep, so don't rush it and attempt to sweep early-game. From there, Necturna can use its defensive typing to set up on Pokemon like Tapu Koko and Gliscor, which have no practical way of harming its ability to sweep. If the foe has a defensive Tomohawk, Necturna will be unable to sweep. However, you can use this to your advantage to position teammates like Magearna and Mega Alakazam in a favorable position.</p> <h1>Team Options</h1> <p>Necturna fits on a wide variety of teams, ranging from bulky offense to hyper offense to even balance. Because Necturna really benefits from Spikes quickly wearing down the opposition, setters like Greninja, Ash-Greninja, Ferrothorn, and Arghonaut are excellent partners. Stealth Rock setters that can keep entry hazards up against Tornadus-T, such as Mega Tyranitar, Heatran, and Mega Diancie, are also good partners. Most notably, Stealth Rock allow Necturna to KO bulky Tornadus-T with a boosted Shadow Claw, allowing it to save its Z-Move. Stealth Rock also quickly wear down Volkraken, allowing Necturna to KO it with a Shell Smash boost after it switches into it two times. Mega Alakazam can wear down Steel-types like Celesteela and Magearna into range of Necturna's boosted Shadow Claw. Pokemon like Magearna, Mega Alakazam, and Caribolt can take advantage of Tomohawk, which is by far the best defensive counter to Necturna. Lastly, dual screens Tapu Koko synergizes really well with Necturna on hyper offensive teams, granting it many more opportunities to set up.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 231402, "username": "xavgb"}, {"user_id": 264912, "username": "G-Luke"}, {"user_id": 227784, "username": "snake_rattler"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}, {"user_id": 232216, "username": "Lumari"}]}], "writtenBy": [{"user_id": 395754, "username": "Jordy"}]}
  },
  "Mollux": {
    "overview": "<p>Mollux is a niche pick for rain teams that can provide utility by spreading status, being a secondary rain setter, and walling or threatening common rain answers such as Jumbao, Tomohawk, Ferrothorn, and Celesteela. Mollux's typing grants it an immunity to both poison and burn along with many resistances, which, in addition to its good special bulk, access to Recover, Water-type immunity, and passive healing in rain, enables it to stay healthy during a match while also answering the threats it needs to. While it may possess many resistances, its weakness to many common offensive types means it is unable to check many of the metagame's top offensive threats such as Landorus-T, Crucibelle, and Mega Alakazam. Finally, its susceptibility to Spikes and Stealth Rock severely limits its opportunities to switch in and hampers its ability to check some threats it otherwise would be able to such as Ash-Greninja.</p> ",
    "comments": "<h1>Other Options</h1> <p>Mollux can run Stealth Rock or Toxic Spikes, but it does not pressure entry hazard removers well. Heal Bell is another option that can be run over Rain Dance or Rapid Spin, but it is useful in far fewer circumstances.</p> <h1>Checks and Counters</h1> <p><strong>Pajantom</strong>: Pajantom is specially bulky, resists Mollux's most common attacks, is immune to status, often carries Earthquake, and can trap and wear down Mollux with its specially defensive set.</p> <p><strong>Heatran</strong>: Heatran is immune to both of Mollux's STAB attacks and threatens it with Earth Power, though it can't switch into Thunder too many times and doesn't appreciate being paralyzed.</p> <p><strong>Ground-type Pokemon and Coverage</strong>: Ground-types like Colossoil, Landorus-T, and Garchomp can OHKO Mollux, though they risk being burned switching in. Many Pokemon such as Arghonaut, Syclant, Krilowatt, and Mega Pinsir also carry Ground type coverage.</p> <p><strong>Psychic-types: While it is able to just barely survive most special Psychic-type attacks, Mollux is very threatened by Psychic-types such as Tapu Lele, Mega Alakazam, Mega Medicham, Hoopa-U, and Reuniclus and Psychic-type coverage from Pokemon such as Extrasensory Greninja and Psychic Volcarona.</p> <p><strong>Strong Physical Attackers: Because it is a special wall, Mollux isn't able to take many unresisted physical attacks. Crucibelle in particular forces out Mollux and can pivot with U-turn, healing with Regenerator and providing momentum for its team. Other physical attackers like Necturna, Hawlucha, and Caribolt possess strong neutral attacks that threaten Mollux. However, most of these Pokemon need to careful of being statused or damaged upon switching in.</p> ",
    "sets": [
      {
        "name": "Specially Defensive",
        "description": "<h1>Moves</h1> <p>Sludge Bomb allows Mollux to OHKO Jumbao, which can be difficult for rain teams to deal with otherwise. Lava Plume has a chance to OHKO Ferrothorn outside of rain and can also be used to spread burns, though it is severely weakened when rain is up. Thunder lets Mollux do damage to Heatran in addition to hitting Toxapex and Tomohawk for more damage than its STAB moves and also helps it beat Celesteela while rain is up. Rain Dance allows Mollux to be an effective secondary rain setter. Rapid Spin can be used to remove entry hazards, but Mollux is not an ideal hazard remover, as it has poor matchups against many common Stealth Rock setters.</p> <h1>Usage Tips</h1> <p>Mollux should be brought in on resisted hits against Pokemon that it either walls or checks like Jumbao and Ferrothorn and then take advantage of the switches it causes. It can put pressure on its switch-ins like Mega Crucibelle, Heatran, and Landorus-T by threatening to spread status or deal significant chip damage. Mollux can also use this turn to set up rain against Pokemon that Pelipper and Tomohawk can't set up against repeatedly or at all such as Magearna, Tapu Koko, and Zapdos. Stealth Rock makes Mollux unable to switch in repeatedly, so it should be kept off the field or else Mollux will fail to check what it needs to. Some Pokemon that would otherwise be walled by Mollux, such as Jumbao, often run Ground-type coverage, so they should be scouted for by teammates or by double switching out to another Pokemon that can take that move.</p> <h1>Team Options</h1> <p>Mollux fits best on rain teams, where it can patch up some weaknesses and benefit from the passive healing while also providing a valuable Water-type immunity. Along with being the best rain setter in the tier, Pelipper is a great teammate for Mollux, as it also provides a Ground-type immunity and can remove entry hazards with Defog. Mega Swampert is a must-have on a rain team and partners well with Mollux, appreciating its 4x Grass-type resistance, ability to soak up Scald, and ability to set up rain. Mega Swampert is also able to switch into Rock-types that threaten Mollux, most notably Mega Crucibelle, though it has to be careful of the occasional Wood Hammer. Tomohawk appreciates Mollux's ability to check Fairy-types and can provide utility to rain teams by being a secondary setter or, if Mollux is the secondary rain setter of the team, using the freed-up moveslot to run another move like Rapid Spin or Focus Blast. Because it is the best Defogger in the tier and works well on rain teams, Tornadus-T is a great Pokemon to have on a team with Mollux. As another common pick for rain teams, Ash-Greninja appreciates Mollux's ability to check Jumbao, Toxapex, Ferrothorn, and non-Earthquake Arghonaut. Similarly, Volkraken pairs well with Mollux due to its ability to check the aforementioned Toxapex and Arghonaut. Ferrothorn has good defensive synergy with Mollux, being able to check many Pokemon that threaten it, such as Mega Latios and Mega Crucibelle. Tapu Koko is a great addition to a rain team that Mollux can support by dealing with some of the bulky Grass-types Tapu Koko struggles against, like Jumbao, clearing the way for it to spam its Electric Terrain-boosted Thunder.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 227784, "username": "snake_rattler"}, {"user_id": 208105, "username": "Jho"}, {"user_id": 395754, "username": "Jordy"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}, {"user_id": 232216, "username": "Lumari"}]}], "writtenBy": [{"user_id": 190866, "username": "Frostbiyt"}]}
  },
  "Aurumoth": {"sets": [{"name": "Tail Glow"}]},
  "Malaconda": {
    "overview": "<p>Malaconda theoretically compresses lots of utility, like Knock Off and paralysis support, into one teamslot, but overall, it's ineffective at executing any of them. While it resists Ash-Greninja and Necturna's STAB moves, has high special bulk, and has a wide support movepool, its awful typing, low speed, and lack of offensive presence make it unviable. It also can't run all the moves it wants to like Rapid Spin, Power Whip, and Pursuit. Simply put, Malaconda is outclassed: Choice Scarf Weavile, Mega Lopunny, and Choice Scarf Greninja are better at revenge killing Shell Smash Necturna, Choice Scarf Jumbao can revenge kill both Necturna and Ash-Greninja, Tangrowth can pivot more effectively while also providing Knock Off support, and Tornadus-T and Equilibra are much more effective entry hazard removers.</p> ",
    "sets": [{"name": "Utility", "description": "<p>Malaconda can support its teammates by paralyzing threatening Pokemon like Tornadus-T and Heatran, removing items like Leftovers from Celesteela and Equilibra, and revenge killing Shell Smash-boosted Necturna. However, Malaconda's pathetic speed and susceptibility to chip damage mean that it's usually better to run other Pokemon like Serperior, Tangrowth, Jumbao, and Weavile that more successfully perform some of the roles Malaconda attempts to do. Black Glasses is necessary for Sucker Punch to revenge kill Necturna after Shell Smash's Defense drop, as well as Mega Alakazam and weakened Pajantom. While Malaconda could run Harvest + Sitrus Berry, such a set makes Malaconda even more passive and can be unreliable.</p> "}],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 298148, "username": "Mx"}, {"user_id": 208105, "username": "Jho"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "Lumari"}]}], "writtenBy": [{"user_id": 227784, "username": "snake_rattler"}]}
  },
  "Cawmodore": {
    "overview": "<p>Cawmodore is an offensive threat that makes use of its access to Belly Drum alongside a strong defensive typing in Steel / Flying and access to Volt Absorb to set up on Pokemon such as Landorus-T, Ferrothorn, Mega Scizor, Mega Pinsir, and certain Tapu Koko sets. Cawmodore's high Speed and access to STAB Acrobatics and priority Bullet Punch allow it to OHKO nearly every wall in the metagame once set up while also preventing faster Pokemon such as Syclant and Mega Alakazam from revenge killing it easily. However, Cawmodore's movepool and mediocre Attack stat mean it is rather one-dimensional, and it can't afford to leverage its unboosted self in the way other setup sweepers such as Aurumoth, Necturna, and Hawlucha can. Cawmodore really only gets one chance to set up, and if it loses too much HP, either from taking hits or from Stealth Rock damage, it will be unable to do so. This in turn makes Cawmodore a matchup-dependent Pokemon, as it struggles to function in the presence of checks such as Tomohawk, Greninja, and Choice Scarf Volkraken.</p> ",
    "comments": "<h1>Other Options</h1> <p>A Salac Berry set with Substitute / Belly Drum / Acrobatics / Drain Punch is plausible and allows Cawmodore to outspeed and defeat some of the checks to its regular set, including Greninja and Choice Scarf Volkraken. On this set, only 29 HP IVs should be used so that Cawmodore's HP will be a number divisible by 4 and its Salac Berry will be consumed after one Substitute and Belly Drum. However, this set is more difficult to set up with than the standard Sitrus Berry set due to the heightened vulnerability to priority and a reliance on getting a free turn to set Substitute up.</p> <h1>Checks and Counters</h1> <p><strong>Physically Defensive Electric-types: Physically defensive Cyclohm can tank Cawmodore's Acrobatics, restore its HP, and OHKO Cawmodore with Flamethrower. Zapdos can take a hit from Cawmodore and get a chance to KO it using Heat Wave.</p> <p><strong>Unaware Users: Pokemon that have access to Unaware, such as Arghonaut, Quagsire, and Clefable can all tolerate damage from Cawmodore and recover health. While Arghonaut will still take substantial damage from Acrobatics, it can phaze Cawmodore with Circle Throw.</p> <p><strong>Tomohawk: Physically defensive Tomohawk is able to check Cawmodore thanks to its access to Prankster and Haze. Sets that run Rocky Helmet will be able to get rid of Cawmodore via chip damage and continuous use of Roost.</p> <p><strong>Faster Special Attackers</strong>: Choice Scarf Volkraken can easily take a Bullet Punch and OHKO Cawmodore with its STAB moves. Tapu Lele can KO Cawmodore with Hidden Power Fire, and Psychic Terrain prevents Cawmodore from using Bullet Punch. Greninja and Ash-Greninja can take a boosted Bullet Punch and KO Cawmodore in return.</p> ",
    "sets": [
      {
        "name": "Belly Drum",
        "description": "<h1>Moves</h1> <p>Drain Punch provides vital coverage to hit Heatran while also letting Cawmodore recover health. Bullet Punch is primarily for OHKOing Pokemon faster than Cawmodore, such as Syclant and Mega Alakazam.</p> <h1>Set Details</h1> <p>Volt Absorb is used to get rid of Cawmodore's Electric-type weakness, instead allowing it to set up on Tapu Koko sets lacking Hidden Power Fire. Sitrus Berry allows Cawmodore to both power up Acrobatics and regain HP immediately after setting up. 4 HP EVs are necessary to bring Cawmodore's HP up to an even number so that it consumes its Sitrus Berry after using Belly Drum. A Jolly nature is needed to outspeed Pokemon that resist Bullet Punch like Krilowatt.</p> <h1>Usage Tips</h1> <p>Do not let Cawmodore get damaged until it can set up. Because of the nature of Belly Drum, it only gets one real chance to do this. Cawmodore can use its decent defensive typing and ability to switch in on Pokemon like Landorus-T, Ferrothorn, and Mega Scizor to get free setup opportunities. Leverage Cawmodore's presence to force an opponent to play more conservatively with their Cawmodore checks, thereby making them easier to predict. If Cawmodore is unable to set up, settle for using it without boosts, such as by picking off faster Pokemon with Bullet Punch.</p> <h1>Team Options</h1> <p>Tapu Koko is an excellent teammate for Cawmodore, as dual screens sets drastically improve Cawmodore's ability to set up and allow it to avoid revenge KOs from checks such as Greninja. Tapu Koko also can bait in Pokemon like Landorus-T, Chansey, and Ferrothorn and pivot out to Cawmodore, providing it with an opportunity to set up. Spikes Greninja and Ash-Greninja are also good teammates to help weaken teams into Cawmodore's KO range. Toxic Spikes from Pajantom pressures Arghonaut and Cyclohm, potentially to the point where Cawmodore will be able to break through them. Kyurem-B's wallbreaking potential allows it to take out Tomohawk and Cyclohm. In return, Cawmodore can set up on notable stops to Kyurem-B like Ferrothorn and Mega Scizor. Ground-type Pokemon like Landorus-T and Colossoil are good for drawing out Pokemon such as Landorus-T, Ferrothorn, and Tapu Bulu that Cawmodore can set up on. Also, Flyinium Z Landorus-T can remove Arghonaut. Entry hazard removal from Pokemon like Tomohawk, Tornadus-T, Tapu Koko, and Landorus-T is important for Cawmodore because it doesn't want to be worn down.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 196588, "username": "cbrevan"}, {"user_id": 227784, "username": "snake_rattler"}, {"user_id": 298148, "username": "Mx"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "Lumari"}, {"user_id": 447027, "username": "frostration"}]}], "writtenBy": [{"user_id": 215253, "username": "EpicUmbreon29"}, {"user_id": 196588, "username": "cbrevan"}, {"user_id": 395754, "username": "Jordy"}]}
  },
  "Volkraken": {
    "overview": "<p>Volkraken's powerful STAB combination and excellent Special Attack allow it to pressure nearly all teams. With Analytic, Volkraken can punish its switch-ins by turning 3HKOs into 2HKOs and near-OHKOs into OHKOs. These traits combined with U-turn help Volkraken become an excellent Choice item user. Volkraken can better pressure offensive teams with Choice Scarf and punch holes into bulky cores with Choice Specs. Its good natural bulk and defensive typing also allow it to switch into common defensive Pokemon like Jumbao and Celesteela without getting worn down too quickly.</p> <p>However, common bulky Water- and Dragon-types like Arghonaut, Toxapex, Mega Latios, and Pajantom are able to wall Volkraken's Choice Scarf set, while faster offensive threats like Tapu Koko and Mega Crucibelle can force out the Choice Specs set. However, U-turn can be used to circumvent these answers. Furthermore, Stealth Rock's chip damage compromises Volkraken's otherwise respectable bulk and limits opportunities to switch in. Finally, Volkraken's reliance on Choice items makes it reliant on prediction, allowing common cores like Heatran + Jumbao to take advantage of it.</p> ",
    "comments": "<h1>Other Options</h1> <p>Scald can be used for its perfect accuracy and burn chance. However, the extra power of Hydro Pump or Surf is generally preferred.</p> <h1>Checks and Counters</h1> <p><strong>Chansey</strong>: The only way Volkraken can come close to 2HKOing Chansey is with a Choice Specs-, Analytic-, and weather-boosted STAB move. Volkraken can also U-turn against a Chansey switching in. Otherwise, Chansey is safe to stall out Volkraken, cripple it with Toxic, and set Stealth Rock.</p> <p><strong>Bulky Water-types</strong>: Toxapex can stomach anything that Volkraken throws at it, stalling it out with Recover and setting Toxic Spikes. Similarly, Arghonaut can reliably heal, set Spikes, and use Knock Off to remove Volkraken's item, though it has to watch out for Toxic. Gastrodon is a niche option that walls Volkraken as well and pressures it into not using Hydro Pump. Pokemon like Krilowatt and Rotom-W can tank a hit from Volkraken and retaliate, but they aren't consistent answers. Note that appropriate weather-, Analytic- and Choice Specs-boosted STAB moves can invalidate these checks, especially with Stealth Rock damage. Also, U-turn allows Volkraken to pivot out of any of these.</p> <p><strong>Dragon-types: Mega Latios can reliably check Choice Scarf Volkraken and recover the damage. While it can't switch into Choice Specs Volkraken multiple times, it can outspeed and 2HKO with Earthquake. Offensive Pajantom is in a similar situation, though it doesn't have recovery, which allows it to switch in only once safely. Specially defensive Pajantom, though, can potentially PP stall Volkraken, generating free turns to use Spirit Shackle. Cyclohm can switch into Choice Scarf variants and wall them and can stall Choice Specs Volkraken with Slack Off, but it cannot switch in directly. However, U-turn allows Volkraken to escape these threats.</p> <p><strong>Punishing Choice Lock: Pokemon that can punish Volkraken for choosing the wrong STAB move can effectively deal with it. Protect users like Celesteela, Ferrothorn, Heatran, and Mega Diancie can scout which move Volkraken chose to use and react accordingly. Mega Tyranitar and Assault Vest Tyranitar can switch into Fire Blast or Flamethrower and chip Volkraken with Pursuit. Assault Vest Tangrowth can switch into Hydro Pump, heal the damage with Regenerator, and shift momentum back into its team's favor. Necturna can set up against Volkraken locked into Hydro Pump and can potentially boost past Choice Scarf Volkraken's Speed tier by the time it has switched back in. However, these strategies are prediction heavy, so while they can be sufficient, they aren't perfectly reliable, as Volkraken can always choose the right move.</p> <p><strong>Faster Pokemon: Though Choice Scarf Volkraken outspeeds the unboosted metagame, other Choice Scarf users, including Jumbao, Kitsunoh, and Greninja, can outspeed and revenge kill it, though they need some prior damage to reliably KO. Choice Specs Volkraken is vulnerable to a good portion of the faster metagame, including Mega Crucibelle, Tapu Koko, Ash-Greninja, and Mega Diancie. Tornadus-T can use Knock Off against Choice Scarf Volkraken and Supersonic Skystrike against Choice Specs variants.</p> <p><strong>Powerful Priority: While these moves require some chip damage, Sucker Punch from Mega Mawile and Flame Orb Colossoil as well as Caribolt's Quick Attack can take down Volkraken.</p> ",
    "sets": [
      {
        "name": "Choice Scarf",
        "description": "<h1>Moves</h1> <p>Fire Blast OHKOes non-bulky Aurumoth at +1. Hydro Pump is used over Surf to have a chance to OHKO Mega Crucibelle, 2HKO Mega Tyranitar, and more reliably KO Heatran without even factoring in a potential boost from Analytic. U-turn allows Volkraken to pivot out of its few switch-ins like Toxapex, Arghonaut, Mega Latios, and Pajantom. Flamethrower is a more accurate STAB attack than Fire Blast, which allows it to clean up teams more reliably. It also improves Volkraken's matchup against Celesteela and Ferrothorn, which can quickly deplete Volkraken's Fire Blast PP with Protect. However, Surf is an alternative to Flamethrower, allowing Volkraken to clean up teams with Garchomp better. Toxic is an option that allows Volkraken to cripple Suicune, Gastrodon, and Arghonaut on the switch, but giving up one of Volkraken's other moves is very hard, and Volkraken can easily use U-turn on these switch-ins. Memento is an option if Volkraken is paired with Shell Smash Necturna, as Volkraken naturally draws in Pokemon like Arghonaut, Krilowatt, and Mega Latios that Necturna can set up easily against when they're at -2.</p> <h1>Set Details</h1> <p>Timid allows Volkraken to outspeed +1 Aurumoth, +2 Necturna, and Mega Alakazam. While Analytic may seem odd on a Choice Scarf Pokemon, it ensures that Volkraken OHKOes Mega Crucibelle on the switch with Hydro Pump and chips down offensive switch-ins like Krilowatt more effectively.</p> <h1>Usage Tips</h1> <p>Volkraken should primarily be used to revenge kill setup sweepers like Aurumoth, Necturna, and Magearna. Though Volkraken has excellent bulk for an offensive Pokemon, it's best to switch it into resisted attacks like Jumbao's Moonblast, Choice Band Weavile's Icicle Crash, and Heatran's Magma Storm, as it is easily worn down by entry hazards. However, do not be afraid to switch Volkraken into a neutral hit if it can clean up a weakened team. Early-game, Volkraken should use U-turn to scout the opponent's response to it, as well as chip it down with entry hazard damage. U-turn is also used best if the opponent has a healthy core like Heatran + Tangrowth that can punish Volkraken for locking itself into a move. If running Toxic, cripple Volkraken's switch-ins with it as soon as possible. Mid- to late-game, once its checks and counters are weakened or taken out, using the appropriate STAB move is best. Beware of locking into Hydro Pump if a Necturna is present on the opposing team, as it can set up easily against Volkraken in this scenario. Also, switching into Knock Off users like Tangrowth and Ferrothorn can be dangerous, as Volkraken's effectiveness severely diminishes without its Choice Scarf.</p> <h1>Team Options</h1> <p>Defog support from Tornadus-T, Rotom-W, or Tapu Fini is necessary to alleviate Volkraken's weakness to Stealth Rock. Pursuit trappers like Mega Tyranitar and Weavile trap a good portion of Volkraken's checks like Pajantom, Mega Latios, and Chansey. Mega Tyranitar's amazing bulk and access to Stealth Rock make it the most attractive option, but Weavile's high speed and access to priority make it a solid choice as well. Tapu Koko, Kartana, and Tapu Lele pressure bulky Water-types like Arghonaut and Toxapex, making it harder for them to check Volkraken. Stealth Rock allows Volkraken to pick up KOs more easily, making Mega Crucibelle, Mega Diancie, or Garchomp an indispensable partner. Similarly, Spikes setters like Arghonaut and Ferrothorn and Toxic Spikes setters like Toxapex are useful. Strong physical wallbreakers like Pajantom, Mega Medicham, and Mega Mawile can pivot in with Volkraken's U-turn and power through special tanks while appreciating Volkraken's ability to revenge kill naturally fast Pokemon. Shell Smash Necturna appreciates Volkraken's Memento support, as it draws in Pokemon that Necturna can set up against easily.</p> "
      },
      {
        "name": "Choice Specs",
        "description": "<h1>Moves</h1> <p>Flamethrower is Volkraken's most consistent STAB move, sporting perfect accuracy. Its high PP allows Volkraken to attack Celesteela and Ferrothorn without worrying about Protect stalling out Fire Blast's PP. Hydro Pump's explosive power can shred many Fire-resistant Pokemon, OHKOing Mega Tyranitar after Stealth Rock damage and 2HKOing Assault Vest Tyranitar. Fire Blast's extra Base Power allows Volkraken to OHKO even the bulkiest Assault Vest Tangrowth all the time, dent switch-ins more effectively than Flamethrower, and even 2HKO Chansey factoring in Stealth Rock, a boost from Analytic, and weather. U-turn allows Volkraken to pivot out of Pokemon like Arghonaut, Chansey, and Toxapex, which will otherwise be able to tank Volkraken's STAB moves without weather boosts.</p> <h1>Set Details</h1> <p>A Modest nature is chosen for maximizing power, but Timid can be run to outspeed unboosted Aurumoth and Z-Move Landorus-T. Analytic allows Volkraken to punish its switch-ins more effectively, turning 3HKOs into 2HKOs against some of the bulkiest Pokemon in the metagame.</p> <h1>Usage Tips</h1> <p>Getting Volkraken onto the field by using aggressive double switches or switching into a wall it outspeeds and forces out like Celesteela or Heatran is crucial, as Volkraken will be primed to rip a hole in the opposing team. Early-game, it's best to use U-turn while its sturdy counters like Toxapex and Chansey are healthy. Using Flamethrower is generally the safest option due to its perfect accuracy, but Hydro Pump's coverage or Fire Blast's extra power should be used against the appropriate predicted switch-in like Mega Tyranitar or Krilowatt. Using Hydro Pump against a team with a healthy Necturna can be dangerous, as that provides it with a free setup opportunity.</p> <h1>Team Options</h1> <p>Due to the ubiquity of Arghonaut and Toxapex on balance teams, weather support allows Choice Specs Volkraken to be most effective. Volkraken fits onto rain teams with Pelipper and Mega Swampert, OHKOing Ferrothorn and even annihilating Toxapex under rain. Volkraken also pairs well with Choice Scarf Jumbao, appreciating its solid Speed tier and Drought support, which also allows Volkraken to work past most of its counters. Defog support from Tornadus-T and Landorus-T allows Volkraken to switch in more easily. Pursuit users like Weavile, Colossoil, and Mega Tyranitar can trap Dragon-types like Pajantom and Mega Latios. Stealth Rock support from Pokemon like Landorus-T, Mega Diancie, and Mega Crucibelle is crucial, allowing Volkraken to use the safer Flamethrower even more often. Spikes support from Greninja and Ferrothorn is also appreciated, as well as Toxapex's Toxic Spikes support. Physical wallbreakers like Mega Mawile, Kartana, and Pajantom can tear through Volkraken's specially defensive checks, while Volkraken can tear through their physically defensive checks, including Landorus-T and Jumbao.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Previous versions by", "members": [{"user_id": 264912, "username": "G-Luke"}]}, {"name": "Quality checked by", "members": [{"user_id": 298148, "username": "Mx"}, {"user_id": 395754, "username": "Jordy"}, {"user_id": 231402, "username": "xavgb"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}, {"user_id": 232216, "username": "Lumari"}]}], "writtenBy": [{"user_id": 227784, "username": "snake_rattler"}]}
  },
  "Plasmanta": {
    "overview": "<p>Plasmanta can take advantage of Substitute to capitalize on its ability to force out Grass- and Fairy-types and use the appropriate coverage more easily. Additionally, its unique Electric / Poison typing allows it to break past Jumbao and Tangrowth, which most Electric-types cannot do easily. Despite these positives, Plasmanta is basically unviable and should not be considered for most serious teams. Plasmanta requires its STAB moves and Hidden Power coverage to hit the metagame effectively, and its STAB attacks are easy to play around due to the ubiquity of Ground- and Steel-types, while Hidden Power is easy to punish due to the low Base Power. Without Volt Switch, Plasmanta struggles to gain momentum as well as other Electric-types like Krilowatt and Tapu Koko. It's stuck in an awkward Speed tier of 100, falling short of one of its hardest counters, Pajantom. No recovery outside of Leftovers prevents even a well-played Plasmanta from consistently checking Grass- and Fairy-types like it's supposed to. Furthermore, offensive Pokemon that it would otherwise want to check such as Tapu Koko and Tornadus-T are special attackers, which prey on its pitiful special bulk. Finally, defensive Pokemon that Plasmanta can break open like Arghonaut, Jumbao, and Tangrowth commonly run Ground-type coverage, further limiting its opportunities to switch in.</p> ",
    "comments": "<h1>Other Options</h1> <p>Plasmanta can run Taunt or Encore over Substitute, but these are generally inferior because they don't ease prediction as Substitute does.</p> <h1>Checks and Counters</h1> <p><strong>Faster Attackers</strong>: Pokemon that commonly appear on teams wear down Plasmanta quickly before it can set up a Substitute. Tornadus-T nearly KOes Plasmanta with Hurricane + Supersonic Skystrike and OHKOes with Hidden Power Ground. Syclant and Greninja demolish Plasmanta with Earthquake and Ice Beam. Ash-Greninja and Choice Scarf Volkraken can use their secondary STAB moves to bypass Plasmanta's Storm Drain and KO it. Pajantom can avoid being 2HKOed by Hidden Power Ice and OHKO back with Earthquake.</p> <p><strong>Chansey: Chansey easily walls Plasmanta, and while it fears odd options like Taunt and Encore, Plasmanta rarely runs these moves.</p> <p><strong>Psychic-types</strong>: With naturally high Special Defense, Mega Latios, Hoopa-U, and Mega Alakazam can generally take Plasmanta's hits well enough to retaliate, but they hate being crippled by poison. Mega Medicham Speed ties with Plasmanta and OHKOes it with Zen Headbutt but doesn't like to take repeated hits. Choice Scarf Tapu Lele cannot switch into Sludge Bomb but soundly OHKOes Plasmanta otherwise.</p> <p><strong>Ground-types: Gliscor and Landorus-T need to avoid Hidden Power Ice, but they can OHKO Plasmanta otherwise. Fidgit and Colossoil can take a couple of rounds of Hidden Power Ice and OHKO with Earth Power or Earthquake. However, if Plasmanta reveals to be Hidden Power Fire, these Pokemon are very safe switch-ins. Equilibra and Gastrodon can switch into Plasmanta quite easily and force it out as well.</p> <p><strong>Steel-types: Though Ferrothorn cannot break Plasmanta's Substitute easily, it can use Plasmanta as fodder for setting up entry hazards and isn't forced out unless Plasmanta runs Hidden Power Fire. Magearna, while usually running resisted coverage, nearly OHKOes with +1 Twinkle Tackle and Hidden Power Ground and 2HKOes with +1 Ice Beam. Kitsunoh and Heatran don't appreciate repeated hits from Thunderbolt but can OHKO Plasmanta easily with Earthquake and Earth Power.</p> ",
    "sets": [
      {
        "name": "Substitute + 3 Attacks",
        "description": "<h1>Moves</h1> <p>Substitute not only eases prediction for the Plasmanta user but also allows Plasmanta to scout for Choice Scarf from Pokemon like Landorus-T and lets Plasmanta beat Ferrothorn cleanly if it opts to run Hidden Power Fire. Thunderbolt is used over Discharge to reliably 2HKO Arghonaut and OHKO Tornadus-T. Hidden Power Fire 2HKOes Ferrothorn, which would otherwise wall Plasmanta, and reliably OHKOes Kartana. It's also Plasmanta's best available way to damage Equilibra. Alternatively, Hidden Power Ice 2HKOes Gliscor and Mega Garchomp, and OHKOes most Landorus-T sets.</p> <h1>Set Details</h1> <p>48 HP EVs prevent Ferrothorn's Knock Off from breaking Plasmanta's Substitute. Running a Timid nature allows Plasmanta to outspeed non-Choice Scarf Tapu Lele, offensive Jumbao, and maximum Speed Landorus-T.</p> <h1>Usage Tips</h1> <p>Switching into Pokemon like Caribolt, Toxapex, and Kartana ensures Plasmanta will take as little damage as possible when switching in, though it should be wary of Knock Off from Toxapex and Kartana. Once in, it is generally best to use Substitute on the forced switch to gauge the opponent's best response to Plasmanta. Also, it eases prediction, which Plasmanta would be very reliant on. Then, use the appropriate coverage move to damage the switch-in or fish for a poison with Sludge Bomb. However, if the opponent has a hard counter to Plasmanta like Smokomodo or Chansey, it's usually best to double switch out. Opponents will likely be careful not to use Water-type moves with Choice Scarf Volkraken or Ash-Greninja when Plasmanta is alive. Use this to your advantage, limiting these powerful wallbreakers' actions.</p> <h1>Team Options</h1> <p>Despite the fact that Plasmanta can lure some Ground-types and take them out with Hidden Power Ice, Ground-type checks like Jumbao, Tangrowth, Tornadus-T, and Landorus-T are vital. Psychic-type checks like Celesteela, Magearna, and Ferrothorn are also necessary. Entry hazard setters like Greninja and Landorus-T help Plasmanta better punish switches, and hazard removers like Tornadus-T and Kitsunoh improve its ability to switch in. Pursuit trappers like Weavile, Mega Tyranitar, and Colossoil trap many of Plasmanta's checks like Mega Latios, Pajantom, and Tapu Lele Choice-locked into Psychic. Because Plasmanta draws in Ferrothorn, Pokemon that appreciate it worn down like Tapu Lele and Magearna are useful teammates. If Plasmanta is not running Hidden Power Fire, though, Pokemon like Heatran and Volkraken that like Ferrothorn to switch in make for good partners. Similarly, Necturna, Mega Pinsir, Gyarados, and Aurumoth appreciate Plasmanta's ability to lure out Ground-types.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 395754, "username": "Jordy"}, {"user_id": 298148, "username": "Mx"}, {"user_id": 208105, "username": "Jho"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}, {"user_id": 232216, "username": "Lumari"}]}], "writtenBy": [{"user_id": 227784, "username": "snake_rattler"}]}
  },
  "Naviathan": {
    "overview": "<p>Naviathan is one of the best sweepers on entry hazard stacking teams, thanks to its fantastic typing and access to a good boosting move in Dragon Dance. Guts and strong coverage options like Icicle Crash allow Naviathan to break through most of the metagame after a boost, making it a threatening Pokemon against bulky offense and balance teams. Additionally, its Speed tier allows it to outspeed common Choice Scarf users like Tapu Lele and Volkraken after a Dragon Dance boost, and its good physical bulk allows it to tackle Choice Scarf Kitsunoh pretty reliably. Naviathan notably acts as a Fairy-, Flying-, and Ice-type answer and sets up on Mega Crucibelle, which is important for these teams. However, the combination of neutral attacks and burn damage from Flame Orb wears it down rather quickly, meaning it is KOed easily. This means it cannot switch into attacks very easily and requires good opportunities to switch in to set up properly. Additionally, Naviathan competes with Magearna, which has significantly better special bulk, also resists Fairy-, Flying-, and Ice-type moves, and can snowball with Soul-Heart.</p> ",
    "comments": "<h1>Other Options</h1> <p>Thunder Punch can be run for a greater chance to break past Arghonaut and to hit Celesteela harder, but it's hard to find a moveslot for it. Heavy Slam can be run over Icicle Crash, OHKOing Magearna after a boost while maintaining coverage for Necturna and Pajantom. However, this weakens Naviathan's matchup against Electric- and Grass-types like Zapdos, Cyclohm, and Tangrowth. Naviathan can run a stallbreaking set with Calm Mind, Taunt, and Slack Off, but one-move coverage and low speed make it struggle offensively, and the ubiquity of Cyclohm on stall teams makes it hard for Naviathan to break these teams anyway.</p> <h1>Checks and Counters</h1> <p><strong>Bulky Grass-types: Ferrothorn and Pyroak are good answers to Naviathan, as the former can wear it down with Iron Barbs and Leech Seed, while the latter can chip it with Earth Power or Roar it out.</p> <p><strong>Fighting-types: Arghonaut ignores Naviathan's boosts and can phaze it, but Guts-boosted Facade wears Arghonaut down fast. Tomohawk can Haze away Naviathan's boosts and stall it out, chipping it down with Rocky Helmet. While offensive variants can also remove Naviathan's boosts, Naviathan can 2HKO them back with an unboosted Facade. Hawlucha can outspeed Naviathan and nail it with High Jump Kick.</p> <p><strong>Electric-types: Zapdos and Cyclohm threaten Naviathan with Discharge and can tank an Icicle Crash in a pinch. Krilowatt outspeeds and OHKOes Naviathan before it sets up and can tank a +1 Facade if extremely healthy. Rotom-W can tank a hit from boosted Naviathan and retaliate with Volt Switch, although this doesn't quite KO Naviathan. Tapu Koko can only check Naviathan before it sets up. A healthy Magnezone can take a +1 Waterfall and OHKO back. Magnet Caribolt 2HKOes Naviathan with Quick Attack and can nearly OHKO it in the Electric Terrain that an opposing Tapu Koko sets up.</p> <p><strong>Ground-types: While Landorus-T, Smokomodo, and Fidgit have to watch out for Icicle Crash and Waterfall, their STAB moves can OHKO Naviathan before it sets up.</p> <p><strong>Offensive Pressure: The easiest way to prevent Naviathan from setting up is to deny it free setup opportunities. Choice Band Syclant, Greninja, Mega Diancie, and Fightinium Z Tornadus-T are some examples of Pokemon that wear down Naviathan too much to survive a few turns of burn damage.</p> ",
    "sets": [
      {
        "name": "Dragon Dance",
        "description": "<h1>Moves</h1> <p>Facade ensures that Naviathan isn't walled by Water-types. After a Dragon Dance boost, it OHKOes Greninja, Volkraken, and Slowking and 2HKOes Toxapex, Rotom-W, and Krilowatt. With some prior chip damage, it can even 2HKO Arghonaut. Icicle Crash rounds off Naviathan's coverage, OHKOing Jumbao and Necturna and 2HKOing Ferrothorn after some prior chip damage.</p> <h1>Set Details</h1> <p>A Jolly nature allows Naviathan to outspeed Tapu Lele, Volkraken, Aurumoth, Landorus-T, and Jumbao. Because most of these Pokemon commonly Choice Scarf or boost their Speed, Naviathan can safely outspeed them after a boost as well. However, an Adamant nature can be run for a greater chance to 2HKO mixed defensive Arghonaut while still outspeeding Timid Mega Alakazam at +1.</p> <h1>Usage Tips</h1> <p>Naviathan performs best after the opposing team has been weakened so that it can clean up with its rather immediate power. Not setting up until Ferrothorn and Pyroak are weakened is ideal, as Naviathan needs a bit of chip damage to break through them. If Ferrothorn uses Protect, use Dragon Dance on that turn. Because Naviathan is extremely vulnerable to chip damage, avoid switching into Spikes or a neutral attack or setting up against a healthy Leech Seed user. Facade should be used against neutral targets, as it's stronger than Waterfall. However, if Facade doesn't net a KO, using Waterfall or Icicle Crash to fish for a flinch can turn games back into Naviathan's favor.</p> <h1>Team Options</h1> <p>Light Screen + Reflect Tapu Koko allows Naviathan to set up much more easily, allowing it to gain more than one Dragon Dance if played carefully and reach its maximum potential. Aurumoth complements Naviathan well, switching into the Ground- and Fighting-types that prevent Naviathan from setting up. In return, Naviathan can switch into Pokemon like Mega Crucibelle and non-Focus Blast Tornadus-T and use them as setup bait. Stealth Rock users like Landorus-T and Excadrill and Spikes users like Greninja help wear down the opposing team faster, letting Naviathan net more KOs more easily. Magnezone can trap and remove Ferrothorn and Celesteela altogether. Pajantom can also trap Tomohawk, Pyroak, and Zapdos with Spirit Shackle and remove them with Toxic or a Z-Move. Shell Smash Necturna weakens Steel-types like Ferrothorn and Magearna, making it easier for Naviathan to sweep. In return, Naviathan can set up on Tornadus-T and Syclant if it's Choice-locked into an Ice-type move. Hawlucha is an excellent late-game cleaner for screens teams in case Naviathan or Aurumoth's sweep ends early.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 64801, "username": "HeaLnDeaL"}, {"user_id": 298148, "username": "Mx"}, {"user_id": 395754, "username": "Jordy"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "Lumari"}, {"user_id": 336073, "username": "Rabia"}]}], "writtenBy": [{"user_id": 227784, "username": "snake_rattler"}]}
  },
  "Crucibelle": {
    "overview": "<p>With excellent pre- and post-Mega Evolution abilities in Regenerator and Magic Guard, a solid typing, and a good movepool, Mega Crucibelle finds itself a niche as an offensive pivot in the metagame. Its typing is very potent offensively, hitting a large majority of the metagame for at least neutral damage, and gives it plenty of opportunities to switch into Pokemon like Tornadus-T, Jumbao, and Clefable. It's also a pretty consistent Stealth Rock setter, as it has a favorable matchup against Tornadus-T, which is the best Defogger in the metagame. Furthermore, its access to U-turn enables Mega Crucibelle to pivot out of unfavorable positions against common Pokemon like Arghonaut and Ferrothorn. It should be noted that Tangrowth and Jumbao, two Pokemon that Mega Crucibelle would often want to take advantage of, often run Ground-type coverage to prevent it from switching in for free. Additionally, defensive Pokemon such as Heatran and Arghonaut, Pokemon that Mega Crucibelle fails to OHKO without adequate chip damage, often do so as well.</p> ",
    "comments": "<h1>Other Options</h1> <p>Coil is an option to turn Mega Crucibelle into a much more consistent late-game cleaner. However, Mega Crucibelle is so effective at setting Stealth Rock that this option is often foregone in favor of Stealth Rock. Wood Hammer is also an option that can be run to overwhelm bulky Water-types like Arghonaut and bulky Ground-types like Hippowdon.</p> <h1>Checks and Counters</h1> <p><strong>Steel-types: Mega Aggron is the best counter to Mega Crucibelle, reliably taking anything that Mega Crucibelle might throw at it. However, Mega Aggron rarely fits on teams outside of stall teams. Mega Scizor is a solid check to Mega Crucibelle, as it can avoid a 2HKO from Stone Edge and can pressure Mega Crucibelle with Bullet Punch. Ferrothorn can easily switch into Stone Edge and Gunk Shot, but it is prone to getting worn down and can be taken advantage of with U-turn. Naviathan is often found on hyper offensive teams and can reliably set up on Mega Crucibelle. Similarly to Naviathan, Magearna can also use Mega Crucibelle as setup bait and Pain Split variants can defensively check it quite well. While Mega Mawile and Kartana lack reliable recovery, they can switch into Mega Crucibelle a few times and threaten to KO it.</p> <p><strong>Ground-types: Fidgit can use Mega Crucibelle to set up Trick Room or entry hazards without much repercussion, though it is generally worn down quickly. Landorus-T has enough bulk to take a few Stone Edges from Mega Crucibelle and can even outspeed it with a Choice Scarf; however, it's worn down very fast. Hippowdon is one of the most self-sufficient answers to Mega Crucibelle thanks to its access to reliable recovery, but it's very passive and thus easy to take advantage of. It should be noted that Hippowdon struggles to switch into Mega Crucibelle consistently because if Toxic Spikes is up, Mega Crucibelle uses Gunk Shot, or Mega Crucibelle has revealed Toxic, the threat of getting poisoned puts a lot of pressure on it.</p> <p><strong>Arghonaut: Arghonaut can reliably switch into Stone Edge, but it must be careful of Gunk Shot poison and can be taken advantage of with U-turn.</p> <p><strong>Faster Attackers</strong>: Choice Scarf users such as Kitsunoh, Tapu Lele, and Volkraken can easily KO Mega Crucibelle with their STAB moves and outspeed Mega Crucibelle. Mega Alakazam, Mega Diancie, Kartana, Mega Latios and Ash-Greninja naturally outspeed Mega Crucibelle and can hit it with their super effective STAB moves. Thanks to Syclant's ability, Mountaineer, it can attempt to switch into Mega Crucibelle's Stone Edge; however, it's far too frail to take any other attack.</p> <p><strong>Cyclohm and Toxapex: Toxapex and Physically defensive Cyclohm are decent blanket checks to Mega Crucibelle. They can both switch into Mega Crucibelle and threaten to afflict it with a status ailment and have enough physical bulk to avoid getting 2HKOed by Mega Crucibelle.</p> ",
    "sets": [
      {
        "name": "Offensive Pivot",
        "description": "<h1>Moves</h1> <p>Gunk Shot allows Mega Crucibelle to pressure Fighting-types like Arghonaut and Tomohawk with its significant chance to poison. Toxic Spikes can also be run instead of Stealth Rock to cripple grounded checks like Arghonaut, Revenankh, and Hippowdon and to put more pressure on the opposing team as a whole.</p> <h1>Set Details</h1> <p>4 HP investment maximizes Crucibelle's Regenerator recovery. Regenerator pairs particularly well with U-turn, allowing Crucibelle to consistently pivot early-game while keeping it healthy. Magic Guard further bolsters Mega Crucibelle's role as an offensive pivot, making it completely immune to entry hazard, Rough Skin, Iron Barbs, and Rocky Helmet damage.</p> <h1>Usage Tips</h1> <p>Early-game, Crucibelle should not Mega Evolve, as Regenerator allows it to consistently stay healthy while softening up checks for itself late-game. However, if the opponent only has softer checks to Mega Crucibelle, such as Arghonaut and Landorus-T, it should look to Mega Evolve early to apply more pressure. U-turn and Stealth Rock are easily the best moves to use with Crucibelle early-game, allowing it to constantly gain momentum against checks like Ferrothorn, Landorus-T, and Arghonaut. While Mega Crucibelle can try to take advantage of Tangrowth and Jumbao, it has to be wary of Earthquake or Hidden Power Ground, so you should scout for these moves first. Once Crucibelle has Mega Evolved, Stone Edge is the move it will want to use the most to break down weakened walls. Alternatively, Mega Crucibelle should use Gunk Shot to fish for poison against checks such as Arghonaut and Landorus-T. It should be noted that, due to Stone Edge's poor PP, it should be used very rarely until Mega Crucibelle's checks are weakened enough because using it early will enable players to potentially PP stall it.</p> <h1>Team Options</h1> <p>Spikes setters like Arghonaut, Ferrothorn, and Greninja can form strong entry hazard stacking cores with Mega Crucibelle. Spikes are particularly useful to consistently wear down Steel-types. Arghonaut and Ferrothorn also provide solid checks to Ash-Greninja as well as to Choice Scarf Volkraken and Tapu Lele, respectively. Additionally, Greninja can take advantage of bulky Ground-types, which Mega Crucibelle tends to force in and U-turn out on. Magnezone can trap Ferrothorn and other troublesome Steel-types for Mega Crucibelle, which is particularly useful to spam Stone Edge and Gunk Shot late-game. In a similar vein, Magearna and Fightinium Z Tapu Lele can get rid of Steel-types like Ferrothorn and can take advantage of Fighting-type checks like Arghonaut as well. In return, they appreciate Mega Crucibelle's ability to pivot them into play. Bulky Grass-types like Jumbao and Tangrowth pair incredibly well with Mega Crucibelle because of their ability to check Ground- and Water-types. They appreciate Mega Crucibelle's ability to check Tornadus-T in return. Tornadus-T pairs particularly well with Mega Crucibelle, as they form a very solid hazard control core. Tornadus-T can also take advantage of bulky Fighting-types like Arghonaut and Tomohawk.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 227784, "username": "snake_rattler"}, {"user_id": 208105, "username": "Jho"}, {"user_id": 298148, "username": "Mx"}]}, {"name": "Grammar checked by", "members": [{"user_id": 273636, "username": "GMars"}, {"user_id": 232216, "username": "Lumari"}]}], "writtenBy": [{"user_id": 395754, "username": "Jordy"}]}
  },
  "Kerfluffle": {
    "overview": "<p>Kerfluffle possesses a very scary STAB combination in Fairy / Fighting, which is dangerous to deal with for most of the metagame, apart from Poison-types and dedicated special walls. Thanks to its typing, Kerfluffle has a good chance against bulky teams that rely on Pokemon like Heatran and Ferrothorn to check Fairy-types, which it can force out and capitalize on with Parting Shot. To add onto that, it has access to Taunt, which particularly improves its matchup against bulkier teams and most notably shuts down Toxapex, the best bulky Poison-type in the metagame. However, despite all this, Kerfluffle still struggles to make a name for itself in the CAP metagame, as it faces major competition from Tapu Lele and Tapu Koko, which outclass it as a wallbreaker and offensive pivot, respectively. Additionally, it's outsped by Mega Alakazam, Tornadus-T, and Greninja, some of the most prominent Pokemon in the CAP metagame. Lastly, it's easily worn down if it's actively pivoting around because it's susceptible to every entry hazard.</p> ",
    "comments": "<h1>Other Options</h1> <p>Darkinium Z can be run instead of Fightinium Z to provide Kerfluffle's teammates with a secondary chance via Z-Parting Shot. However, it makes it much harder for Kerfluffle to break through teams. Z-Celebrate is another option that can turn Kerfluffle into a late-game sweeper. Despite its decent damage output, though, it heavily relies on chip damage and staying healthy, meaning that it will be useless for most of the game.</p> <h1>Checks and Counters</h1> <p><strong>Faster Offensive Pokemon</strong>: Fast Pokemon like Tornadus-T, Mega Alakazam, and Greninja can easily outspeed Kerfluffle and OHKO it. Additionally, Kerfluffle struggles against Choice Scarf users like Kitsunoh and Kartana, which can OHKO it too.</p> <p><strong>Steel-types not weak to Fighting: Steel-types like Celesteela and Magearna can easily shrug off Moonblast and are not particularly bothered by Focus Blast, though they are quickly worn down into range of All-Out Pummeling.</p> <p><strong>Specially Defensive Walls: Specially defensive walls like Jumbao and Assault Vest Tangrowth can switch into Kerfluffle pretty comfortably, though Jumbao must be wary of Sludge Bomb.</p> <p><strong>Poison-types: Although the former two can be easily shut down by Taunt, Poison-types such as Toxapex, Fidgit, and Amoonguss can easily take Moonblast and Focus Blast. Furthermore, Kerfluffle must also be wary of Sludge Bomb from Fidgit.</p> <p><strong>Fire-types: Volcarona, Mega Charizard Y, and Moltres are examples of Fire-types that can force out Kerfluffle, but due to their crippling Stealth Rock weakness, they cannot consistently do so.</p> ",
    "sets": [
      {
        "name": "Offensive Pivot",
        "description": "<h1>Moves</h1> <p>Parting Shot is the main appeal to using Kerfluffle, allowing it to act as a fast pivot that can punish Pokemon with stat drops. Taunt is the preferred fourth move, as it allows Kerfluffle to shut down Toxapex and Chansey. As a result, it enables Kerfluffle to break stall teams, depending on how patiently it is used. Sludge Bomb is also an option that can be run if Jumbao is an issue, but Kerfluffle can easily use Parting Shot to punish Jumbao with another teammate, leaving Sludge Bomb as a generally less desirable option.</p> <h1>Set Details</h1> <p>Fightinium Z allows Kerfluffle to bust through Steel-types like Magearna and Celesteela once they're sufficiently weakened. Natural Cure is preferred to Aroma Veil because it allows Kerfluffle to shrug off burns from Toxapex. A Timid nature is preferred to a Modest nature to outspeed Pokemon like Kartana, Mega Latios, and Mega Crucibelle.</p> <h1>Usage Tips</h1> <p>Early-game, Kerfluffle should attempt to wear down Pokemon like Magearna and Celesteela and pivot out of them with Parting Shot. Continue doing this until said Pokemon are worn down into range of All-Out Pummeling, though be wary of Protect from Celesteela. However, Kerfluffle is quite prediction reliant against teams that use a combination of one of the aforementioned Steel-types and Tornadus-T or Mega Alakazam, for example, because they will leave Kerfluffle guessing what is going to come in. You should utilize Parting Shot more efficiently in these matchups to ease prediction and punish whatever is expected to switch in. You should actively try to use Kerfluffle's resistances to Dark and Rock to switch in and take advantage of Pokemon like Weavile and Mega Tyranitar. Although Kerfluffle has a good matchup against various bulkier teams, if there's a Pokemon like Moltres present on the opposing team, you should immediately use Taunt, since Kerfluffle can't 2HKO it but also can't afford to Taunt it once it has switched in because Flamethrower does heavy damage.</p> <h1>Team Options</h1> <p>Because Kerfluffle struggles to regularly pick up KOs but still manages to force switches, Spikes setters like Greninja, Ash-Greninja, and Syclant are optimal to pair it with. Kerfluffle fits perfectly into offensive pivoting cores with Pokemon like Tornadus-T, Mega Crucibelle, and Assault Vest Magearna to constantly pressure the opposition. Despite Kerfluffle's high Speed stat, it's still pressured by Psychic-types like Mega Alakazam and Choice Scarf Tapu Lele, so you will need Steel-types like Celesteela and Assault Vest Magearna to keep them in check. It also struggles against Fairy-types like Jumbao if it's not running Sludge Bomb, so having Pokemon like Mega Crucibelle and Mega Mawile is extremely useful to take advantage of them. Additionally, it's important to have Knock Off users like Tornadus-T to punish Toxapex. Because teams tend to rely on Steel-types to check Fairy-types, Kerfluffle pairs up quite well with Mega Alakazam, which struggles to break past most Steel-types.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 227784, "username": "snake_rattler"}, {"user_id": 231402, "username": "xavgb"}, {"user_id": 208105, "username": "Jho"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}, {"user_id": 232216, "username": "Lumari"}]}], "writtenBy": [{"user_id": 395754, "username": "Jordy"}]}
  },
  "Pajantom": {
    "overview": "<p>Pajantom's niche lies in its access to Spirit Shackle, which allows it to trap opposing Pokemon and prevent double switches. Its Speed tier ensures that it can outspeed Mega Medicham and Choice Specs Tapu Lele if invested, as well as most defensive Pokemon if it opts to run its slower, bulkier set. Pajantom can trap such defensive Pokemon, including Toxapex, Tomohawk, and Clefable, and remove them with a Z-Move without fear of the target switching out. With its wide movepool, this set can essentially pick its checks and counters. Alternatively, a specially defensive variant is a good blanket trapper for most defensive Pokemon and check to powerful Fire-types like Heatran and Volkraken. Pajantom has a lot of defensive utility, as its many resistances and good bulk allow it to tank weak moves from Pokemon like Tomohawk, Toxapex, Zapdos, and Reuniclus. Additionally, Comatose confers a status immunity to Pajantom, which helps against Toxapex and Lava Plume Heatran. Pajantom's greatest weakness is to Pursuit trapping, making it hard to get multiple KOs when the opposing team has a Weavile, Colossoil, or Mega Tyranitar. Also, Pajantom has no recovery outside of Leftovers, so it can be worn down very fast without team support.</p> ",
    "comments": "<h1>Other Options</h1> <p>Pajantom can set Toxic Spikes and trap Poison-types that switch in to absorb them, providing multiple layers of team support. Additionally, Pajantom isn't a Poison-type like most Toxic Spikes setters, which can be favorable for Poison-type teammates like Mega Crucibelle, which don't want to stack weaknesses. Groundium Z can be employed to OHKO Mega Tyranitar after it switches into Spirit Shackle.</p> <h1>Checks and Counters</h1> <p><strong>Pursuit Users: Weavile, Mega Tyranitar, and Colossoil force Pajantom to play very carefully. Although they might not have the easiest time switching into offensive sets, the specially defensive set can't do much to them aside from chipping them with resisted Spirit Shackle or landing Toxic. Colossoil can use Sucker Punch to make the matchup even more dicey, while Weavile naturally outspeeds and threatens Pajantom with Icicle Crash as well.</p> <p><strong>Faster Pokemon: Many Pokemon can come in on Pajantom and threaten it by simply outspeeding. Greninja, Syclant, and Krilowatt threaten with Ice Beam, while Mega Latios can threaten it with Draco Meteor. Choice Scarf users like Jumbao and Tapu Lele also threaten Pajantom with STAB Moonblast. However, they have a hard time switching in directly.</p> <p><strong>Steel-types: Mega Scizor is one of Pajantom's sturdiest checks, as it can tank any of Pajantom's moves, and threaten Pajantom out with Bullet Punch or Knock Off. Ferrothorn and Celesteela can tank Spirit Shackle quite well and heal with Leech Seed, but Ghostium Z sets can power through them. Additionally, these Steel-types have to watch out for Heal Block.</p> <p><strong>Bulky Fairy-types: Clefable and Jumbao can tank Pajantom's Spirit Shackle with ease, wear it down with Moonblast, and heal with Soft-Boiled or Shore Up. Additionally, Clefable ignores Toxic damage. However, they must play carefully around Heal Block, Never-Ending Nightmare, and Corkscrew Crash.</p> <p><strong>Knock Off: Arghonaut, Toxapex, Kartana, and Tornadus-T can use super effective Knock Off against specially defensive Pajantom, which heavily damages it and removes Leftovers, its only form of recovery. While Pajantom can scout for Knock Off using Protect, it's still forced to switch out.</p> ",
    "sets": [
      {
        "name": "Z-Crystal Trapper",
        "description": "<h1>Moves</h1> <p>Trapping foes with Spirit Shackle allows Pajantom to fire off its Z-Move safely. Earthquake is a reliable attack that 2HKOes Magearna and Krilowatt and OHKOes Mega Diancie, Tapu Koko, and Heatran. Ice Punch 2HKOes Landorus-T and bulky Jumbao after some chip damage as well as 2HKOing Colossoil. If Pajantom runs Dragonium Z, Outrage should replace Earthquake or Ice Punch. Iron Tail over Earthquake or Ice Punch with Steelium Z is a more specific option to remove Clefable and Jumbao, as they are nearly OHKOed by Corkscrew Crash. Heal Block denies the opposing Pokemon's recovery, making it significantly easier to wear down and KO.</p> <h1>Set Details</h1> <p>A Jolly nature is preferred to outspeed Tapu Lele, Zapdos, and Mega Medicham. Ghostium Z is Pajantom's best option for wearing down Steel-types that aren't weak to Earthquake, like Celesteela and Ferrothorn. Also, Pajantom can use this Z-Move to overcome bulky Fairy-types like Clefable and Jumbao in combination with Heal Block pressure. Dragonium Z instead removes most defensive Pokemon like Toxapex, Zapdos, and Tomohawk as well as significantly weakening Mega Tyranitar, while OHKOing Colossoil on the switch.</p> <h1>Usage Tips</h1> <p>Early-game, it's best to spam Spirit Shackle, wearing down the opposing team and giving Pajantom's teammates safer switches by preventing double switches. In doing so, you can read what the opponent's answers to Pajantom are. Even though this set aims to trap more defensive switch-ins, offensive switch-ins generally have a harder time tanking hits from Pajantom. This means defensive answers are more likely to switch in, despite the looming threat of the trap, allowing Pajantom to wear them down or perform a double switch. Using Heal Block after the opponent is trapped makes it easier for Pajantom to wear Pokemon down into Z-Move KO range. Preventing Ferrothorn and Celesteela from having their Leech Seed recovery is essential. Once the defensive check has been sufficiently worn down, use Pajantom's Z-Move to eliminate it for a teammate. Although it may be tempting to use the Z-Move immediately for damage, the set fails to do its job if the wall is able to heal the damage from the Z-Move. Take the necessary measures, such as using Heal Block or performing the trap later in the game when the wall is more weakened, to ensure Pajantom successfully removes the defensive Pokemon. Even if the team doesn't have a defined defensive backbone, Pajantom is able to disrupt offensive momentum with Spirit Shackle and use its coverage and Z-Move on switch-ins. Pay particular attention to Pursuit users. If the opponent has one, it's important not to let Pajantom give these Pokemon a free switch in. If Pajantom gets a KO, it leaves itself vulnerable to the Pursuit user. Slower Pursuit trappers like Colossoil, Mega Tyranitar, and Tyranitar can be removed with Devastating Drake, though Colossoil commonly runs Sucker Punch. A healthy Weavile can switch into and survive Earthquake, Ice Punch, or Spirit Shackle, so switching out as it comes in is generally a better play. It is important to identify whether or not Pajantom is still needed after removing the defensive Pokemon; if it is, preserve it and remove the Pursuit trapper before making any KOs with it.</p> <h1>Team Options</h1> <p>Choice Scarf Magnezone is one of the best teammates for Pajantom, as Pajantom lures and prevents Steel-types from switching out, which Magnezone can then trap and beat. Magnezone can also take out troublesome Fairy-types like Clefable and Jumbao for Pajantom. In return, Pajantom can trap bulky Pokemon that don't care about Magnezone, including Tangrowth and Zapdos. Heatran is another option for a double trapping core, as its Magma Storm also limits the opposing team's options. As a bonus, Heatran takes care of Steel- and Fairy-types, allowing Pajantom to run Dragonium Z and Ice Punch more easily. In return, Pajantom can remove Pokemon like Arghonaut and Trace Jumbao for Heatran. Sweepers appreciate Pajantom's support; however, the sweeper cannot also rely on a Z-Crystal. Mega Mawile appreciates Ghostium Z Pajantom removing Celesteela. Offensive Spikes and Stealth Rock setters like Greninja, Syclant, Landorus-T, and Mega Diancie can help wear down defensive Pokemon into Z-Move KO range faster. In return, Pajantom can remove the defensive Pokemon that wall these offensive setters. Defog Tornadus-T, Landorus-T, and Tapu Koko can clear hazards, preventing Pajantom from being worn down over the match. Teammates that can deal with Pursuit trappers like Colossoil, Tyranitar, and Weavile prevent Pajantom from being trapped itself. Examples include Arghonaut, Jumbao, and Mega Scizor.</p> "
      },
      {
        "name": "Specially Defensive Trapper",
        "description": "<h1>Moves</h1> <p>Spirit Shackle traps and weakens defensive Pokemon. Notably, the chip damage against Toxapex is enough to remove it efficiently. Even without Attack investment, Spirit Shackle still OHKOes Tapu Lele and Mega Medicham, allowing Pajantom to OHKO them on the switch. Protect allows Pajantom to scout for Knock Off users, gain an extra turn of Leftovers recovery, and rack up Toxic damage. Heal Block denies a trapped Pokemon from recovering, forcing Pokemon like Tomohawk to submit to Toxic and Spirit Shackle damage.</p> <h1>Set Details</h1> <p>Comatose prevents Pajantom from being worn down by Toxapex's Toxic and Heatran's Lava Plume, saving valuable HP. Leftovers is Pajantoms only source of recovery, which allows it to heal as Toxic damage racks up on the opposing Pokemon.</p> <h1>Usage Tips</h1> <p>Bulky Pajantom focuses on whittling down usual switch-ins with Toxic and denying their recovery, rather than overloading a Pokemon with damage. Spirit Shackle should be used against Pokemon that can't do much damage to Pajantom switching in. It might be better to use Toxic on a predicted switch-in like Greninja, which doesnt care about Spirit Shackle damage. Using Protect against potential Knock Off users like Toxapex and Arghonaut ensures Pajantom won't lose its Leftovers. If Knock Off is revealed, Pajantom cannot stay in safely. Also, Protect can scout against Choice item users like Tapu Lele, Syclant, and Ash-Greninja, making them easier to play around. Use Toxic to wear down trapped switch-ins such as Tomohawk and Zapdos, following up with Heal Block to prevent recovery and Protect to stall for damage and heal with Leftovers. Against Pokemon immune to Toxic like Toxapex, use Heal Block and repeated Spirit Shackle to remove them. Pajantom can switch into defensive Tomohawk or Excadrill to spinblock or soak up a weak attack. However, offensive Tomohawk's Hurricane heavily compromises Pajantoms ability to switch in later. Using Heal Block against a weakened Clefable or Jumbao might seem risky, but if it chooses a recovery move, it wastes the turn and leave itself vulnerable to Pajantom's teammates.</p> <h1>Team Options</h1> <p>Pajantom naturally lures in Steel-types like Celesteela, Mega Scizor, and Ferrothorn, so it appreciates partners that beat them. By having teammates that defeat Steel-types efficiently, Pajantom can more easily trap and wear down the opposing team with Toxic. Magnezone pairs well as a dual trapping core, ensuring that Ferrothorn and Celesteela are eliminated and that Mega Scizor must U-turn. Strong Fire-types like Firium Z Heatran, Mega Charizard X, and Heatran and Ground-types like Colossoil, Landorus-T, and Gliscor generally have a positive matchup against these Steel-types as well. Pajantom also lures in Fairy-types like Clefable and Jumbao, so good switch-ins that can capitalize on trapped Fairy-types are excellent partners. Equilibra is an excellent switch-in, tanking Moonblast with its naturally high Special Defense, forcing a switch with Flash Cannon, and put pressure with Doom Desire. Double Dance Magearna gets a free turn to use Shift Gear and begin its sweep. Celesteela forms a strong defensive core with Pajantom, as Pajantom can deal with strong Fire-types and Celesteela has a good matchup against Fairy- and Steel-types and can apply more residual damage with Leech Seed. Pajantom's largest weakness is easily Pursuit trapping, which forces it to perform double switches while a Pursuit trapper is healthy. Therefore, Pokemon with a positive matchup against Colossoil, Tyranitar, and Weavile are mandatory teammates. Mega Scizor, Tomohawk, Jumbao, Clefable deal with some or all of these Pokemon effectively and provide other utility that Pajantom appreciates. Wish users like Clefable and Jumbao give Pajantom recovery outside of Leftovers. Stealth Rock setters such as Heatran, Landorus-T, and Clefable and Spikes setters like Arghonaut and Greninja help Pajantom wear down the opposing team faster. Toxic Spikes setters like Toxapex allow Pajantom not to have to spend as many turns using Toxic. Although Pajantom appreciates entry hazard removal, it vastly prefers teammates with Rapid Spin so that opposing hazards can stay up. Tomohawk and Colossoil both work well in this regard. However, Defog users like Landorus-T and Tornadus-T also work. Since Pajantom excels at wearing down or removing essential members of balance cores, wallbreakers like Ash-Greninja and Mega Pinsir and sweepers like Shift Gear Magearna make for good teammates.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 339349, "username": "LucarioOfLegends"}, {"user_id": 395754, "username": "Jordy"}]}, {"name": "Grammar checked by", "members": [{"user_id": 331519, "username": "CryoGyro"}, {"user_id": 232216, "username": "Lumari"}]}], "writtenBy": [{"user_id": 227784, "username": "snake_rattler"}]}
  },
  "Jumbao": {
    "overview": "<p>Jumbao is an incredibly diverse and powerful choice for any balance or offense team, SM CAP's defining Pokemon. Its excellent typing and bulk allow it to single-handedly check many dominant threats such as Mega Tyranitar, Ash-Greninja, and Caribolt. Trace, Drought, and high Special Attack let it play both defensively and offensively. Trace gives Jumbao incredible flexibility, letting it switch freely into Heatran lacking Toxic and Steel-type coverage while exploiting common abilities like Regenerator, Swift Swim, and Beast Boost. With Drought, Jumbao can muscle past Steel-types like Equilibra and Celesteela, which many teams rely on to check Fairy-types, with sun-boosted Flame Burst. Although Jumbao is checked by two common defensive pivots in Tornadus-T and Toxapex, it can still plow through many teams with its powerful attacks and outstanding bulk. Jumbao's one major downfall is its middling Speed, which leaves it vulnerable to revenge killers like Weavile and Mega Alakazam.</p> ",
    "comments": "<h1>Other Options</h1> <p>Jumbao can utilize a Choice Scarf alongside Healing Wish and Solar Beam + Drought to land surprise KOs on faster Pokemon like offensive Tornadus-T, Weavile, and Tapu Koko while supporting teammates like Kartana, Mega Mawile, and Equilibra; however, this set is generally quite telegraphed.</p> <h1>Checks and Counters</h1> <p><strong>Toxapex: Toxapex is easily able to tank any of Jumbao's attacks and threaten it with Toxic.</p> <p><strong>Tornadus-T</strong>: Tornadus-T freely switches into Jumbao's standard attacks and forces it out with Hurricane or Sludge Bomb. Offensive Tornadus-T must be wary of switching into Twinkle Tackle from offensive Jumbao. Twinkle Tackle even OHKOes defensive variants without Assault Vest after Stealth Rock.</p> <p><strong>Bulky Steel-types</strong>: Bulky Steel-types like Ferrothorn, Mega Scizor, and Equilibra counter Wish Jumbao, which reveals itself by activating Trace. Equilibra is especially effective, as it can use Jumbao to initiate Doom Desire, limiting Jumbao's future ability to get onto the field.</p> <p><strong>Specially Bulky Pokemon: Pokemon like Reuniclus, Chansey, and Gastrodon can stomach Jumbao's powerful special attacks and heal off any damage taken. Gastrodon must beware of the odd Jumbao set that runs a Grass-type attack, however.</p> <p><strong>Faster Pokemon: Weavile, Victini, Mega Pinsir, and Kartana all outspeed and threaten to OHKO Jumbao with their super effective STAB moves; however, all of them but Victini must scout to see if Jumbao is using a Choice Scarf. Other faster Pokemon like Mega Medicham and Mega Lopunny can KO Jumbao if it has been properly chipped; however, chipping Jumbao can be difficult given its access to Wish and Shore Up and its overall high bulk.</p> ",
    "sets": [
      {
        "name": "Wish",
        "description": "<p>Wish affords Jumbao ridiculous longevity and excellent utility, as it can easily keep itself and its teammates healthy throughout a match. Furthermore, Wish helps Jumbao's teammates switch into its few counters. Hidden Power Ground is used to hit Heatran and Toxapex super effectively. Fairium Z is the preferred item for pressuring Tornadus-T and allowing Jumbao to absorb Knock Off from Arghonaut and Gliscor; however, Pixie Plate lets a teammate be the Z-Move user without compromising Jumbao's offensive presence. The given EVs allow it to outspeed Hoopa-U while almost always 2HKOing Heatran after Stealth Rock with Hidden Power Ground.</p> <p>Due to Jumbao's excellent bulk and versatility, it fits well on pretty much any team archetype that is not stall or hyper offense. Equilibra and Toxapex are excellent defensive options that both appreciate Jumbao easing their switches in with Wish. Equilibra notably pressures Poison-types like Toxapex with Earth Power, while Toxapex can switch into Tornadus-T. Tornadus-T itself is a good teammate for Jumbao, as it can switch into Steel-types like Equilibra and Ferrothorn, while Jumbao can pressure Mega Tyranitar for it. Mega Alakazam pressures faster Pokemon, and it notably forces Toxapex out. Reuniclus and Tapu Lele are other Psychic-types that pair well with Jumbao, pressuring Steel-types with Focus Blast; Tapu Lele additionally enjoys Jumbao's Wish. Weavile is another good choice for a fast partner, as it can hit Reuniclus and Celesteela particularly hard. Celesteela, Mega Tyranitar, and Heatran all appreciate the Wish support Jumbao provides; Mega Tyranitar is particularly notable, as its sand increases Shore Up's recovery.</p> "
      },
      {
        "name": "Offensive",
        "description": "<p>Jumbao can use its near-perfect coverage and high Special Attack to run a more offensive set. Sun-boosted Flame Burst hits Steel-types like Ferrothorn, Equilibra, Celesteela, and Magearna extremely hard. Hidden Power Ground hits Heatran quite hard and also KOes Toxapex if it has been chipped sufficiently. Fairium Z allows Jumbao to break through Tornadus-T after Stealth Rock and a bit more chip damage.</p> <p>Jumbao fits on many teams because it breaks through a number of the tier's walls like Mega Tyranitar and Ferrothorn. Victini is a notable partner, as it appreciates Jumbao setting sun for its V-create. Psychic-types like Mega Alakazam and Tapu Lele can pressure Toxapex. Both of these Pokemon enjoy Jumbao hitting Steel-types like Ferrothorn and Mega Mawile with Flame Burst. Tornadus-T is an excellent teammate, pivoting in Jumbao with U-turn and supporting it with Knock Off. Water-types like Toxapex and Gastrodon help cover Jumbao's weakness to Fire-types. Toxapex sports amazing longevity and walls opposing Choice Scarf Jumbao, while Gastrodon notably beats Victini and Heatran. Stealth Rock allows Jumbao to more consistently break through Tornadus-T, so setters like Ferrothorn, Heatran, and Landorus-T are appreciated teammates.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 517892, "username": "pannuracotta"}, {"user_id": 395754, "username": "Jordy"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 277988, "username": "dex"}]}
  },
  "Caribolt": {
    "overview": "<p>Caribolt holds a unique niche within the metagame as a physically inclined Electric-type sweeper thanks to Galvanize turning its Normal-type moves into STAB Electric attacks. It fits well on hyper offensive builds, providing the playstyle with a strong physical sweeper that is not easily revenge killed thanks to its access to STAB priority. Because of a powerful Grass-type STAB move in Power Whip, Caribolt can easily break past most Ground-types, including Garchomp and Colossoil, that would threaten to absorb its Electric attacks. However, due to its neutrality to both Ground and Flying in combination with its frail nature, Caribolt has much less defensive utility in comparison to other Grass- and Electric-types, with Grass-types like Necturna being able to switch in on an Earthquake while Electric-types like Rotom-W can easily pivot into Tornadus-T's Hurricane, limiting it to hyper offensive builds. It also has trouble dealing with Grass- and Dragon-type Pokemon like Jumbao, Tangrowth, and Mega Latias, as they wall its STAB combination and can usually retaliate hard with their own strong attacks. Finally, Caribolt faces steep competition from other sweepers on hyper offense such as Necturna and Aurumoth, both of which have greater bulk to set up more easily and are more powerful attackers.</p> ",
    "comments": "<h1>Other Options</h1> <p>Utilizing Double-Edge and Normalium Z, Caribolt can attempt to lure in and blow away counters with a +2 Breakneck Blitz, which sounds great on paper but generally fails in practice thanks to most of Caribolt's checks being able to stomach the hit and heal off the damage. Pajantom is also notably immune to Breakneck Blitz. Horn Leech paired with Life Orb can be slotted over Power Whip as a means of regaining health while simultaneously doing damage through a sweep, but the drastic drop in power is generally not worth it, as it notably fails to OHKO Swords Dance Garchomp or offensive Landorus-T after Stealth Rock damage, thus defeating the point of running Grass STAB in the first place. Boomburst may seem appealing, but Caribolt's low Special Attack stat, weak coverage options, and lack of a suitable means to boost its Special Attack or access to special priority mean that more often than not special attacking sets are just very disappointing. While Caribolt does have access to Galvanize Rapid Spin in order to spin on Ghost-types, it struggles not only to fit this on its moveset but also to fit on hyper offense with that strategy.</p> <h1>Checks and Counters</h1> <p><strong>Cyclohm: With outstanding physical bulk, access to reliable recovery, a 4x resistance to its Electric STAB, and a resistance to its Grass STAB, Cyclohm is undeniably Caribolt's best counter in the metagame. Cyclohm can take minimal damage from Caribolt's attacks, can easily 2HKO it with its commonplace coverage moves in Flamethrower and Ice Beam, and can punish switch-ins with Discharge paralysis or a potential Toxic.</p> <p><strong>Grass-types</strong>: Thanks to their resistance to both of Caribolt's STAB types and their excellent bulk, most of the metagame's resident Grass-types have little to fear from Caribolt. Tangrowth and Jumbao can both easily take a hit and hit back hard with Sludge Bomb and Moonblast, respectively. Unfortunately, Ferrothorn, due to its lack of meaningful ways to punish Caribolt, can be set up on and overwhelmed. Necturna is also able to use Caribolt as setup bait thanks to having decent bulk and taking little damage from its STAB attacks but drops to a +2 Return if Electric Terrain is present.</p> <p><strong>Dragon-types: Dragon-types like Kyurem-B, Mega Latias, and Pajantom can switch in on an unboosted Caribolt and threaten it out. However, once boosted, Kyurem-B and Pajantom cannot switch into Caribolt's attacks, being swiftly OHKOed by +2 Magnet-boosted Return after Stealth Rock damage.</p> <p><strong>Faster Pokemon and Priority: Due to Caribolt only having meager bulk, any strong attacks can deal heavy damage to it, so faster Pokemon like Mega Alakazam and Mega Crucibelle as well as Choice Scarf users like Kitsunoh, Tapu Lele, and Jumbao can revenge kill it. These Pokemon should, however, be mindful of Caribolt's priority, as most of them take heavy damage from +2 Quick Attack. Landorus-T, Tapu Lele, and Jumbao get a special mention thanks to their resistance to Quick Attack or outright immunity to priority and ability to OHKO Caribolt in kind. In addition, Pokemon like Choice Band Syclant and Choice Band Weavile can outpace Caribolt, bypass Quick Attack with their own Ice Shard, and eliminate it.</p> ",
    "sets": [
      {
        "name": "Swords Dance",
        "description": "<h1>Moves</h1> <p>Quick Attack allows Caribolt to pick off weakened foes and hit Choice Scarf Pokemon such as Volkraken and Kitsunoh as well as naturally faster Pokemon like Tornadus-T, which would otherwise revenge kill it, hard. Double-Edge can also be slotted over Return for even greater damage output, but it comes with a steep recoil penalty, which is often not worth the slight increase in damage. Knock Off can also be run instead of Power Whip to hit Dragon-types like Pajantom and Mega Latios that would otherwise wall Caribolt for super effective damage. This also improves its matchup against Necturna, with +2 Knock Off having a high chance to OHKO it. This does, however, leave Caribolt at a great disadvantage against Ground-type foes and does nothing to alleviate its matchup against Cyclohm.</p> <h1>Set Details</h1> <p>A Jolly nature ensures that Caribolt outpaces threats such as Garchomp, Tapu Lele, and Krilowatt and deals with them accordingly. Magnet is the preferred item, as it strengthens Caribolt's main STAB moves without having any innate drawbacks.</p> <h1>Usage Tips</h1> <p>Caribolt should generally be saved for late-game once its checks have been severely weakened or eliminated. However, in certain circumstances, a healthy Caribolt can be used to weaken a Jumbao or Ferrothorn early-game for a teammate. If the opponent has a Tangrowth or Cyclohm on the field, it is generally best to reign in Caribolt and play very conservatively, as it will only give free switches for these Pokemon and generate momentum for the opposing team, meaning it is within the best interest to aggressively double switch into an appropriate answer if it they are present. Once these Pokemon have been dealt with, let Caribolt set up on Pokemon that it easily forces out, such as Arghonaut and Celesteela, as these Pokemon cannot risk being OHKOed by a Galvanize-boosted Return.</p> <h1>Team Options</h1> <p>Caribolt fits best on hyper offensive teams, where its offensive capabilities are often more highly favored than its rather lacking defensive assets. It greatly appreciates Tapu Koko, as it provides Electric Terrain to power up Caribolt's Electric attacks, provides screens to help Caribolt set up Swords Dance more easily, and can utilize U-turn to bring in Caribolt while saving momentum. Double Dance Magearna is also an excellent partner, as it punishes Choiced-locked Ice-types like Weavile by using them as setup bait, while Caribolt is a sweeper that handles traditional Magearna checks like Celesteela and Toxapex, allowing Magearna to keep the Z-Move slot on the team. Caribolt benefits from Stealth Rock, as it helps with key matchups, like OHKOing bulky Magearna and Mega Alakazam at +2 with Return and Quick Attack respectively. Solid Stealth Rock setters that pair well with Caribolt include lead Landorus-T and suicide lead Excadrill. Caribolt also likes having Spikes on the field to ensure 2HKOs on the likes of bulky Magearna, so Greninja partners well with it. Caribolt in addition helps get rid of Arghonaut and Toxapex, which would otherwise be an annoyance for Greninja. Pokemon that can handle Grass-types for Caribolt are generally a must for it, as they can easily soak up its boosted STAB attacks, so Pokemon such as Mega Pinsir and Hawlucha are excellent partners.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 395754, "username": "Jordy"}, {"user_id": 231402, "username": "xavgb"}, {"user_id": 298148, "username": "Mx"}]}, {"name": "Grammar checked by", "members": [{"user_id": 273636, "username": "GMars"}, {"user_id": 232216, "username": "Lumari"}]}], "writtenBy": [{"user_id": 264912, "username": "G-Luke"}]}
  },
  "Smokomodo": {
    "overview": "<p>Thanks to its typing, Smokomodo serves as a soft check to many dangerous threats like Heatran, Magearna, and Tapu Koko. Its typing also allows it to hit almost the entire metagame for neutral damage, which, alongside Morning Sun and Toxic, turns Smokomodo into a decent balance breaker capable of dismantling many common balance cores such as Heatran + Tangrowth. However, Smokomodo has to rely on Toxic to threaten Pokemon like Rotom-W, Mega Latios, and Mega Latias, which easily counter it otherwise. Smokomodo's Ground weakness means that it is also easily forced out by Ground-types like Landorus-T, Garchomp, and Gliscor and needs to watch out for coverage from the likes of Heatran, Tangrowth, and Arghonaut. On top of that, its average bulk allows some Magearna sets to overwhelm it with their Z-Move or coverage moves even despite its typing advantage. Furthermore, despite the good coverage of Smokomodo's STAB moves, many threats like Tornadus-T and Volkraken can easily take advantage of one of them and then force it out, making it very prediction reliant. Lastly, because of Smokomodo's middling speed and bulk, many faster offensive threats like Pajantom, Mega Diancie, and Mega Alakazam are capable of easily forcing it out.</p> ",
    "comments": "<h1>Other Options</h1> <p>Technician can be used alongside Hidden Power Ice in order to lure in and take out Ground-types like Landorus-T, Garchomp, and Gliscor, although it doesn't do much besides that. Smokomodo can also act as a Stealth Rock setter, but it has a bad matchup against common entry hazard removers such as Tornadus-T and Rotom-W. Additionally, using any of these options means giving up either Toxic or Taunt, which significantly worsens Smokomodo's ability to threaten passive Pokemon.</p> <h1>Checks and Counters</h1> <p><strong>Ground-immune Pokemon: Mega Latios, Mega Latias, and Rotom-W take little damage from any of Smokomodo's attacks and scare it out with their super effective moves, although they must be wary of Toxic. Rocky Helmet Tornadus-T can take a Flare Blitz relatively well while Smokomodo is worn down very quickly by Rocky Helmet damage and Flare Blitz recoil. Offensive sets can't take Flare Blitz very well, but once they are in, they can still threaten Smokomodo with their powerful Hurricane.</p> <p><strong>Water-types: Arghonaut can tank most of Smokomodo's moves and deals heavy damage with Earthquake; however, it can be crippled by Toxic, and Taunt can prevent it from freely using Recover and allows Smokomodo to overwhelm it over time. Choice Scarf Volkraken is capable of switching into Flare Blitz but needs to watch out for Earthquake. Ash-Greninja can force Smokomodo out, but it can't switch in directly.</p> <p><strong>Ground-types: Gliscor and Landorus-T avoid the 2HKO from Flare Blitz and always OHKO after Flare Blitz recoil, although the lack of recovery from the latter means it can only switch in once. Garchomp doesn't like taking an Earthquake, but it outspeeds Smokomodo, forcing it out immediately. However, all three need to watch for the rare Technician-boosted Hidden Power Ice.</p> <p><strong>Other Faster Pokemon</strong>: Pokemon like Krilowatt, Mega Crucibelle, Mega Diancie, and Mega Alakazam can force out Smokomodo thanks to their superior speed, although most of them will require some previous damage in order to KO.</p> ",
    "sets": [
      {
        "name": "Balance Breaker",
        "description": "<h1>Moves</h1> <p>Toxic cripples most Pokemon that wouldn't take much damage from Smokomodo's other moves such as Rotom-W, Arghonaut, and Mega Latios. Morning Sun allows Smokomodo to avoid being worn down by weak or resisted moves such as Chansey's Seismic Toss and Heatran's Magma Storm as well as recover health lost from entry hazards damage and Flare Blitz recoil. Taunt is an option over Toxic to shut down walls like Chansey by preventing them from recovering their health.</p> <h1>Set Details</h1> <p>Iapapa Berry is the preferred item, as it can pull Smokomodo out of low HP after using Flare Blitz or taking a hit without losing momentum by using Morning Sun. Metronome is an alternative choice that works well with the relatively spammable nature of Smokomodo's STAB moves.</p> <h1>Usage Tips</h1> <p>Smokomodo should switch in against threats that can't deal much damage to it like Tapu Koko, Celesteela, defensive Jumbao, and Zapdos. It should also attempt to check Magearna, although it needs to be careful, as Magearna's powerful attacks can easily overwhelm it over time, especially with help from entry hazards. Toxic and Taunt should be used against incoming checks like Arghonaut, Rotom-W, and Mega Latios to cripple them or prevent them from healing. Taunt should also be used to shut down passive Pokemon like Chansey and Zapdos more easily. As long as the opponent has Pokemon capable of playing around Smokomodo, always choose which move to use carefully, as picking the wrong one can let dangerous threats like Volkraken and offensive Tornadus-T in very easily. If the opponent has a healthy Rocky Helmet Tornadus-T, cripple it with Toxic. Then, consider double switching to a teammate that can handle it instead of trying to attack it directly the next time it switches in, as the damage from Rocky Helmet combined with Flare Blitz recoil wears down Smokomodo too quickly, while Tornadus-T will regain its health when it switches out thanks to Regenerator.</p> <h1>Team Options</h1> <p>Levitate users can take advantage of the Ground-type moves that Smokomodo tends to bait, so Rotom-W and Mega Latios are good teammates. Flying-types like Tornadus-T also work well for the same reason, and they also appreciate Smokomodo checking Electric-types like Tapu Koko and Zapdos. Weavile can help Smokomodo by removing Mega Latios and Tornadus-T with Pursuit. Additionally, it can also remove Arghonaut's Leftovers, making it easier to break for Smokomodo. Electric-types like Krilowatt and Tapu Koko are able to take advantage of Tornadus-T and Arghonaut, making them good options to pair with Smokomodo. Grass-types like Jumbao and Necturna can take advantage of the Ground- and Water-type moves that Smokomodo tends to attract, such as Choice Scarf Volkraken's Hydro Pump and Garchomp's Earthquake, and appreciate its ability to check Heatran and Celesteela. Ferrothorn might only resist Water-type moves, but it can set up entry hazards to make it easier for Smokomodo to break walls. Arghonaut and Ash-Greninja are other Spikes setters that complement Smokomodo, as the first one provides your team with a valuable Water-type resistance, while the latter appreciates Smokomodo checking Grass-type like Tangrowth and wearing down Arghonaut with Toxic.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 395754, "username": "Jordy"}, {"user_id": 208105, "username": "Jho"}, {"user_id": 227784, "username": "snake_rattler"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}, {"user_id": 232216, "username": "Lumari"}]}], "writtenBy": [{"user_id": 298148, "username": "Mx"}]}
  },
  "Snaelstrom": {
    "overview": "<p>Snaelstrom's respectable bulk is offset by its lack of reliable recovery, weakness to Stealth Rock, and general passivity. Despite Snaelstrom being one of the sturdiest checks to Equilibra, it struggles to find a place on most teams due to its overreliance on the combination of Poison Heal and Spiky Shield for recovery. This makes Snaelstrom incredibly easy to wear down and very easy for common threats such as Tornadus-T and Krilowatt to take advantage of. This is further amplified by its poor typing, which gives it a weakness to Stealth Rock and makes it difficult for Snaelstrom to come in often. On top of this, Snaelstrom's typing also means it cannot effectively check Heatran, which many other bulky Water-types can. As a result, Snaelstrom is severely outclassed, particularly by specially defensive Kommo-o which provides a Water-type resistance and Stealth Rock support while also beating Equilibra and boasting a better matchup versus common Pokemon such as Heatran, Ash-Greninja, and Kartana.</p> ",
    "sets": [
      {
        "name": "Physically Defensive",
        "description": "<p>This set aims to make use of Snaelstrom's ability to come in on Equilibra and use it as an opportunity to either set up Stealth Rock or spread status with Scald and Toxic. Scald allows Snaelstrom to have some form of offensive presence, deterring threats such as Kartana and Mega Tyranitar from switching into it directly. The given bulk allows Snaelstrom to take two hits from Choice Band Kartana most of the time, giving it more chances to burn it with Scald. Alternatively, Snaelstrom can run maximum Special Defense with a Calm nature in order to more consistently wear down defensive Tornadus-T and non-Trace Jumbao. Due to Snaelstrom's poor typing, it cannot consistently check Pokemon such as Heatran, Ash-Greninja, and Volkraken. As a result of this, other defensive Water-types such as Toxapex, Arghonaut, and Rotom-W are often preferred. On top of this, other Stealth Rock setters such as Tomohawk and the aforementioned Kommo-o share Snaelstrom's ability to beat Equilibra while also being better checks to threats such as Kartana, Excadrill, Mega Tyranitar, and Heatran.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 227784, "username": "snake_rattler"}, {"user_id": 298148, "username": "Mx"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "Lumari"}]}], "writtenBy": [{"user_id": 208105, "username": "Jho"}]}
  }
}