{
  "Venusaur": {
    "sets": {
      "Tank": {},
      "Bulky Attacker": {
        "outdated": true,
        "description": "<h1>Set Information</h1> <p>Mega Drain lets Mega Venusaur threaten out Pokémon like Rhydon and Poliwrath and gives it much-needed recovery. Leech Seed gives additional recovery alongside Mega Drain and lets Mega Venusaur take advantage of high-HP targets like Snorlax, Mew, and Melmetal. Sleep Powder, when landed, gives Mega Venusaur an opportunity to safely use Leech Seed or your team a chance to take advantage of that sleeping Pokémon. Sleep Powder is also very hard to switch into given the scarcity of Grass-types, and the few that exist do not appreciate taking a Sludge Bomb. Toxic is another status option and is often essential for beating Pokémon like Mew and Zapdos, which otherwise switch into Mega Venusaur fairly safety. Sludge Bomb is Mega Venusaur's secondary STAB attack and its main tool for damage dealing. Its higher Base Power and chance to poison let Mega Venusaur pressure neutral targets like Mew, Zapdos, and Mega Charizard X and Y. Bold is the preferred nature to allow Mega Venusaur to more reliably check physical threats like Mega Gyarados and Alolan Dugtrio, although Modest can be chosen to increase Mega Venusaur's offensive presence, letting it 2HKO Zapdos more easily, 2HKO Nidoking, and pressure Mew more effectively.</p> <h1>Usage Tips</h1> <p>Mega Evolving Venusaur early on can be important to raise its Defense enough to check threatening Pokemon. If you predict a Stealth Rock user like Sandslash or Rhydon as your opponent's lead, you can lead with Venusaur or switch it in to force them out and achieve Mega Evolution. Since Melmetal is a common response to Mega Venusaur, if you can predict it to switch in, landing Leech Seed allows you to sap large amounts of health from it, providing recovery for Mega Venusaur and the Pokemon you use to switch into Melmetal. If Mega Venusaur is running Sleep Powder, be aware of what Pokemon your opponent would use as sleep fodder, and consider if it is better to put their fodder to sleep or predict the switch and take advantage of it. Don't recklessly use Mega Venusaur as a defensive pivot; if it loses health to U-turn and Stealth Rock damage and is forced out, it can be difficult to reliably get that health back.</p> <h1>Team Options</h1> <p>Mega Venusaur invites in Melmetal, and Reflect Zapdos can always come in on Melmetal's Ice Punch when it is afflicted with Leech Seed and comfortably heal back up, making it a great partner. Mega Venusaur also threatens out Ground-types like Sandslash and Rhydon, which will attempt to wall Zapdos. Alolan Muk appreciates Mega Venusaur, as it can handle physical attackers like Mega Gyarados and Alolan Dugtrio, while Alolan Muk deals with Psychic-type Pokemon that would threaten Mega Venusaur like Mew, Mega Alakazam, and Starmie. Chansey is another example of good synergy, handling dedicated special attackers admirably. Powerful attackers like Dragonite and Melmetal are important as well, as they can capitalize on key defensive Pokemon being put to sleep. Melmetal also provides extra bulk to take pressure off Mega Venusaur and resists Psychic, traits shared by Mew, which can pivot into and out of Venusaur's bad matchups.</p>"
      }
    }
  },
  "Charizard": {
    "sets": {
      "Phazer X": {},
      "Special Attacker X": {
        "outdated": true,
        "description": "<h1>Moves</h1> <p>Fire Blast OHKOes Melmetal while dealing considerable damage to threats like Alolan Muk, Mega Venusaur, and Mew. Dragon Pulse is another STAB move that threatens unboosted Dragonite, as well as dealing more damage to Pokemon that resist Fire Blast, such as Rhydon, Mega Gyarados, Poliwrath, and Starmie on the switch. Will-O-Wisp threatens to cripple physically offensive threats such as Rhydon, Poliwrath, and Mega Aerodactyl. Roost gives Mega Charizard X a form of recovery, keeping it healthy so it can continue spreading burns with Will-O-Wisp. A Timid nature allows Mega Charizard X to be as fast as possible and Speed tie with Mew and Zapdos.</p> <h1>Usage Tips</h1> <p>Mega Charizard X should aim to Mega Evolve as soon as possible, especially before Stealth Rock is set. It can accomplish this by forcing switches against Pokemon like Melmetal, Mega Venusaur, and Alolan Exeggutor. From there, it can go for an offensive move or use Roost to heal itself from Stealth Rock damage. If predicting the opponent to bring in Rhydon, Mega Aerodactyl, or Alolan Muk expecting Mega Charizard X to go for an offensive move, it would be a good idea to go for Will-O-Wisp to burn it. While it is by no means a frail Pokemon, Mega Charizard X should ideally be brought in with the help of a pivot like Zapdos or Mew, after a teammate has fainted, or with an aggressive double switch. It can also come in on moves it is immune to or weak, resisted attacks, such as Mew's Will-O-Wisp, Eevee-S's Sizzly Slide, and Zapdos's Thunderbolt. It also should never be afflicted with status conditions; Toxic from Pokemon like Alolan Muk, Rhydon, Poliwrath, Zapdos, and Snorlax puts it on a timer and wears it down further along with Stealth Rock damage, while paralysis from Pokemon like Starmie and Mega Gyarados can cut its Speed and potentially leave it unable to do anything for a turn.</p> <h1>Team Options</h1> <p>Despite Mega Charizard X's decent Speed tier, it is still outpaced by prominent threats such as Mega Alakazam and Starmie. Bold Starmie can spread paralysis with Thunder Wave, and Eevee-S can run Buzzy Buzz to help circumvent this issue as well as Sparkly Swirl in the case that Mega Charizard X is afflicted with a status condition. Other Pokemon like Alolan Muk and Snorlax can check these revenge killers too. Mega Charizard X absolutely needs an answer to Rock- and Ground-type Pokemon if it is to sweep late-game. Starmie, Poliwrath, and Alolan Exeggutor are good teammates to consider for this role. Physically offensive Pokemon like Melmetal, Rhydon, and Poliwrath can easily punch holes in special walls like Snorlax and Alolan Muk. These Pokemon also benefit from Mega Charizard X's immunity to Will-O-Wisp. Having a teammate that can pivot, such as Zapdos or Mew, would be a good idea, since Mega Charizard X needs to safely come into battle. Zapdos can also directly switch into Earthquake for Mega Charizard X. Pokemon like Dragonite, Snorlax, and Clefable appreciate Mega Charizard X's ability to threaten Melmetal so they can spam their STAB moves more freely.</p>"
      },
      "Wallbreaker Y": {
        "outdated": true,
        "description": "<h1>Set Description</h1> <p>Fire Blast is the move Mega Charizard Y aims to be using as much as possible, dealing massive damage to almost every Pokemon in the metagame. Air Slash provides coverage for Poliwrath and deals heavy damage to most Water- and Dragon-types that could otherwise switch in. Flamethrower is more reliable than Fire Blast when the latter's power is not needed, such as when picking off weakened targets. Earthquake is great for beating Pokemon that can otherwise check Mega Charizard Y, as it 2HKOes Chansey and is guaranteed to OHKO Alolan Muk after Fire Blast. Substitute allows Mega Charizard Y to avoid being statused and makes it harder to pressure, but it must be used carefully, as its HP cost adds up quickly with Stealth Rock damage. Roost is absolutely vital, as Mega Charizard Y's Stealth Rock weakness otherwise prevents it from being able to switch in repeatedly. A Timid nature forces a Speed tie with Mew and Zapdos, giving Mega Charizard Y the potential to 2HKO them without being hit if they switch into it. A Naive nature is preferred if using Earthquake in order to reliably KO Alolan Muk after a Fire Blast.</p> <h1>Usage Tips</h1> <p>Leading with Mega Charizard Y in matchups where you expect a lead that it can heavily threaten is a great plan, as it lets Mega Charizard Y exert pressure without having to switch into Stealth Rock. Your opponent is far more likely to expect Mega Charizard X when they see Charizard at Team Preview. As a result, they may make plays you can exploit; for example, they may try to take on Charizard one-on-one with Mew instead of Zapdos. Keeping Charizard from Mega Evolving for as long as possible allows you to make the most of this bluff. You should only switch Mega Charizard Y in on foes it forces out or can safely use Roost against. Bringing it in via pivoting or after a KO is generally preferred to avoid adding to Stealth Rock damage. In the rare scenario that Stealth Rock isn't set, Mega Charizard Y can be used much more liberally as a switch-in to resisted attacks. If you are in a position where Mega Charizard Y can pick up a KO and still have half its health left so that it can switch in later, attacking is generally the best option; otherwise, consider using Roost. Many teams lack good switch-ins to Mega Charizard Y. Keep this in mind to force the opponent to give up key team members, creating opportunities for Mega Charizard Y's offensive teammates.</p> <h1>Team Options</h1> <p>Stealth Rock support is heavily appreciated by Mega Charizard Y, guaranteeing a 2HKO on Alolan Muk and punishing its popular revenge killing options like Mega Aerodactyl and Mega Beedrill. Alolan Dugtrio, Rhydon, and Nidoqueen are especially good choices to set Stealth Rock due to their positive matchups against Zapdos and respectable offensive presences to maintain pressure. Poliwrath is an extremely valuable teammate due to Mega Charizard Y's weak matchup against Mega Gyarados and issues with healthy Rock-types. Melmetal provides a sturdy answer to Mega Aerodactyl and Mega Beedrill while not sacrificing offensive momentum. Using Electrode as a lead usually prevents the opponent from starting the game with Stealth Rock, allowing Mega Charizard Y an opening to deal massive damage before it is set. However, Electrode must usually sacrifice itself to do this. Offensive cleaners that can soften the opposing team for Mega Charizard Y or exploit the holes it breaks, such as Starmie, Gengar, and the aforementioned Alolan Dugtrio, make for great partners. Alolan Muk and Snorlax check most Mew variants well, reducing the need to risk Speed ties against it. They also check Starmie, Gengar, and Mega Alakazam, which outspeed and threaten Mega Charizard Y.</p>"
      }
    }
  },
  "Beedrill": {
    "overview": "<p>Mega Beedrill is one of the fastest Pokemon available, with the strongest U-turn in the tier. This enables it to easily wear down opposing switch-ins such as Melmetal and Rhydon while pivoting to other counterplay to set up a late-game win for itself or a teammate. Mega Beedrill checks and forces out many prevalent threats such as Mew, Starmie, and Alolan Dugtrio. The primary downsides of using Mega Beedrill are its vulnerability to Stealth Rock and its frailty. Keeping Stealth Rock off the field for as long as possible greatly helps its longevity and can prevent it from being picked off by weaker priority from Pokemon such as Dugtrio that it would check at full health. Mega Beedrill will likely rack up Stealth Rock damage due to being forced to switch out against threats that it cannot OHKO and will OHKO it back, which makes the prevention of Stealth Rock all the more important for Mega Beedrill's continued usefulness.</p>",
    "comments": "<h1>Other Options</h1> <p>X-Scissor provides a Bug STAB move to use if switching Beedrill out is not optimal. It also does more damage than U-turn and can KO some Pokemon such as Mew from higher HPs.</p> <h1>Checks and Counters</h1> <p><strong>Melmetal</strong>: While it does not appreciate switching in multiple times, Melmetal does not take much damage from any of Mega Beedrill's attacks and can OHKO back with almost any attack. It can be knocked out by Drill Run if it is weakened, however.</p> <p><strong>Stealth Rock</strong>: Stealth Rock severely limits Mega Beedrill's ability to pivot throughout the game and should be kept off the field for as long as possible.</p> <p><strong>Mega Aerodactyl</strong>:  Mega Aerodactyl can switch into any of Mega Beedrill's moves and outspeed and OHKO it while being able to maintain longevity with Roost.</p> <p><strong>Rhydon</strong>: Rhydon does not get 2HKOed by any of Beedrill's moves and can set up Stealth Rock to gradually damage it for the rest of the game.</p> <p><strong>Priority</strong>: Beedrill can be picked off at relatively high HP by many priority users such as Alolan Dugtrio and the less common Pikachu-S.</p>",
    "sets": {
      "Offensive Pivot": {
        "description": "<h1>Set Information</h1> <p>U-turn does heavy damage to Pokemon such as Mew and Starmie as well as respectable damage to switch-ins such as Melmetal and Rhydon to weaken them into KO range of Mega Beedrill's other coverage moves or its teammates' attacks. Poison Jab is Mega Beedrill's second STAB attack, which is important to hit Pokemon that resist U-turn such as Zapdos and Poliwrath. Poison Jab also comes with a chance to poison foes, which can help wear down your opponent's team even more. Drill Run provides excellent coverage to hit Melmetal and Rhydon for solid damage on a predicted switch. It also OHKOes Alolan Dugtrio from full health. Roost is used to heal off Stealth Rock damage on a predicted switch by the opponent while also maintaining Mega Beedrill's ability to pivot with U-turn in the longer run, taking advantage of the switches Mega Beedrill will force as opportunity to heal. An Adamant nature is chosen because Mega Beedrill only misses out on outspeeding Modest Mega Alakazam and Adamant Mega Aerodactyl, which are quite rare. A Jolly nature can be used to outspeed these threats, but the power difference is noticeable. 29 HP IVs allow Mega Beedrill to switch into Stealth Rock four times without fainting.</p> <h1>Usage Tips</h1> <p>Early-game, attempt to wear down Mega Beedrill's checks with U-turn while gaining momentum for yourself. Beedrill generally shouldn't be brought in on any attack because of its frailty, so another U-turn or Teleport user is ideal to bring it in such as Mew, Zapdos, or Alolan Exeggutor. Try to keep Stealth Rock off the field for as long as possible, as it wears down Beedrill extremely fast because of U-turn bringing it in and out of the field very frequently. Playing aggressively and clicking Drill Run on predicted switches to Melmetal or Rhydon can also pay off if you have another sturdy switch-in to them that you can bring in with U-turn on the next turn, as this wears them down much faster than just spamming U-turn.</p> <h1>Team Options</h1> <p>Dragonite is a very potent partner of Mega Beedrill because of its ability to clean late-game after Beedrill wears down Melmetal into range of its Earthquake. Rhydon is the preferred Ground-type to pair with Mega Beedrill because of its ability to take on Mega Aerodactyl as well as consistently set Stealth Rock for Beedrill to take advantage of. Mew is an excellent partner for Beedrill because of its ability to form a U-turn core with it by coming in on common Pokemon such as Poliwrath and Melmetal that had previously switched into Beedrill's U-turn. Mega Beedrill can also help check threats to Mew such as Mega Gyarados and Gengar. Alolan Exeggutor is a good partner for a similar reason to Mew, being able to beat Poliwrath and do heavy damage to Melmetal while potentially making use of Teleport to bring Mega Beedrill right back in or dish out an attack depending on the situation.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Hayburner", "user_id": 291554}], "teams": [{"name": "Quality checked by", "members": [{"username": "Fantasy/Nightmare", "user_id": 32219}, {"username": "dhelmise", "user_id": 241023}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}]}]}
  },
  "Pikachu-Starter": {
    "overview": "<p>Pikachu-S, unlike Eevee-S, doesn't have any significant niche in the metagame. While it has good Speed, a great priority move in Zippy Zap, a powerful STAB attack, and good coverage in Splishy Splash and Floaty Fall, its other stats leave it unable to leave a mark. It severely lacks power due to the lack of items, most importantly Light Ball, and is too frail to take even a single hit from many of the top Pokemon in the metagame. Due to these issues, Pikachu-S is generally outclassed by options such as Zapdos, Electrode, and other priority users, as well as other niche options such as Jolteon, which provides more power with an even better Speed tier.</p>",
    "sets": {"Standard Attacker": {"description": "<p>Thunderbolt is Pikachu-S's most spammable STAB attack. Zippy Zap lets it pick off significantly weakened threats such as Mega Aerodactyl, Mega Alakazam and Mega Beedrill. Splishy Splash and Floaty Fall let Pikachu-S hit common Electric-type answers such as Rhydon, Nidoqueen, Alolan Dugtrio, and Mega Venusaur for super effective damage, as well as spreading paralysis decently well; however, only Rhydon is OHKOed by any of these, and it is the only relevant Pokemon Pikachu-S can reliably OHKO at all. Alternately, Calm Mind lets Pikachu-S at least leave a dent in otherwise impassable answers like Mew. A Naive nature is used to let Pikachu-S outpace Alolan Dugtrio and Starmie without sacrificing any power that it so direly needs.</p>"}},
    "credits": {"writtenBy": [{"username": "Eve", "user_id": 375272}], "teams": [{"name": "Quality checked by", "members": [{"username": "Ivy", "user_id": 173336}, {"username": "McCoolDude", "user_id": 469684}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}]}]}
  },
  "Raichu-Alola": {"sets": {"Wallbreaker": {}}},
  "Sandslash": {
    "overview": "<p>Sandslash is a decent Stealth Rock user, using its solid bulk and defensive typing to set up the entry hazard on Pokemon like Mega Beedrill, Mega Aerodactyl, and Zapdos. In addition, unlike its main competitors in Nidoqueen and Rhydon, Sandslash's Ground neutrality allows it to check threatening Pokemon like the aforementioned Ground-types and Alolan Dugtrio. However, Sandslash has very lacking special bulk, leaving it vulnerable to common Pokemon like Starmie, Mega Alakazam, and both Mega Charizard X and Mega Charizard Y. It's hard to justify Sandslash over Rhydon sometimes due to its lower Attack stat and lack of Rock typing, making it more passive overall. It also doesn't check Zapdos as well as Nidoqueen or Rhydon due to the former's Toxic immunity and the latter's super effective STAB Rock Slide.</p>",
    "comments": "<h1>Other Options</h1> <p>An Adamant nature can be used to give Sandslash more offensive presence, but it makes it harder to check foes like Mega Beedrill and Mega Aerodactyl. Swords Dance can be used over Toxic to allow Sandslash to break through Zapdos on its own, as well as making it a better answer to Melmetal, but it's generally inferior to the hit-and-run nature of Toxic and leaves Sandslash helpless against Mew. If running Swords Dance, Sandslash should use an Adamant nature to maximize its offensive presence, giving it better odds of KOing Melmetal at +2.</p> <h1>Checks and Counters</h1> <p><strong>Water-types</strong>: Bulky Water-types like Poliwrath, Mega Gyarados, and Starmie can all cause issues for Sandslash, being able to take its attacks and threaten it out with their own. Starmie in particular is a problem, as its access to Recover allows it to heal off Earthquake damage, and it can OHKO Sandslash with Scald.</p> <p><strong>Grass-types</strong>: Grass-types like Mega Venusaur, Exeggutor, and Alolan Exeggutor take very little damage from any of Sandslash's attacks, and Mega Venusaur is also immune to Toxic. All three can threaten Sandslash out or just knock it out with Mega Drain.</p> <p><strong>Mew</strong>: Mew's bulk and neutrality to all of Sandslash's moves make it a good check to Sandslash, capable of switching in and healing off the damage from Earthquake. However, it must be wary of Toxic.</p> <p><strong>Special Attackers</strong>: While they cannot switch into Sandslash, Mega Charizard X, Mega Charizard Y, and Mega Alakazam can easily prey on Sandslash's mediocre special bulk by hitting it with their strong STAB moves.</p>",
    "sets": {
      "Stealth Rock": {
        "description": "<h1>Set Information</h1> <p>Stealth Rock is important for every team, and Sandslash is a reliable setter of the entry hazard thanks to its great physical bulk. Earthquake is a reliable STAB move that hits Pokemon like Nidoqueen and Alolan Muk very hard. Rock Slide gives Sandslash great neutral coverage with its STAB Earthquake, hitting Pokemon like Dragonite, Zapdos, and Mega Charizard Y for super effective damage. Toxic allows Sandslash to cripple Pokemon that would otherwise take it on, like Starmie, Mew, and Reflect Zapdos. An Impish nature is chosen over Adamant to give Sandslash an easier time switching into the likes of Rhydon and Mega Beedrill.</p> <h1>Usage Tips</h1> <p>Sandslash can come in on Pokemon like Mega Aerodactyl and Rhydon to try to find opportunities to set up Stealth Rock. Toxic should be used liberally early-game to cripple Sandslash's main checks like Mew and Starmie. Once Sandslash has managed to set up Stealth Rock, it can start throwing off attacks to weaken switch-ins like Poliwrath, Mega Gyarados, and Zapdos.</p> <h1>Team Options</h1> <p>Pokemon that can deal with bulky Water-types and Mew are important teammates, as Sandslash can't get through them on its own. Zapdos is a good teammate that can easily muscle past Pokemon like Starmie, Poliwrath, and Mega Gyarados, and it appreciates the support Sandslash's Stealth Rock provides as well as its ability to check Mega Aerodactyl. Alolan Muk can check Psychic-types like Mega Alakazam, Starmie, and Mew for Sandslash, and it enjoys Sandslash's ability to handle Pokemon like Mega Aerodactyl and Alolan Dugtrio. Mew is a great teammate that can check many Pokemon Sandslash struggles with Pokemon like Mega Venusaur and Starmie; Mega Venusaur can also check Water-types, but it has trouble with Starmie and Mew. Melmetal can check Pokemon like Mega Alakazam for Sandslash and spread paralysis, giving Sandslash an easier time against fast Pokemon like both Mega Charizard X and Mega Charizard Y.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Lily", "user_id": 481709}], "teams": [{"name": "Quality checked by", "members": [{"username": "Eve", "user_id": 375272}, {"username": "McCoolDude", "user_id": 469684}, {"username": "Vengeance417", "user_id": 198446}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}, {"username": "Rabia", "user_id": 336073}]}]}
  },
  "Sandslash-Alola": {
    "overview": "<p>Alolan Sandslash stands out as one of the only priority sweepers in the format thanks to its access to Swords Dance and Ice Shard. Ice is a great offensive typing that allows it to hit prominent Pokemon such as Zapdos, Mega Venusaur, and Dragonite hard, while decent physical bulk and a wide array of resistances give it good chances to set up and allow it to function as one of the few Steel-type tanks in the game. However, Alolan Sandslash's Speed stat and special bulk force it to rely a lot on Ice Shard to sweep, forcing it to be mostly played late-game. Furthermore, Ice / Steel gives it a double weakness to Fire and Fighting and a weakness to Ground, making Alolan Sandslash very weak to common coverage moves.</p>",
    "comments": "<h1>Other Options</h1> <p>Alolan Sandslash happens to learn the valuable Stealth Rock, but it would need to lose either coverage or the ability to sweep if forced in. Facade can be used to 2HKO Mew after a burn and a Swords Dance boost. Toxic is useful for crippling Mew on the switch.</p> <h1>Checks and Counters</h1> <p><strong>Poliwrath</strong>: Poliwrath is one of Alolan Sandslash's worst matchups possible, as it resists its STAB attacks and easily OHKOes it with Superpower.</p> <p><strong>Water-types</strong>: A resistance to Alolan Sandslash's Ice-type STAB moves makes Water-types hard to pick off, even if Earthquake can deal decent damage. Starmie and Mega Gyarados are the most prominent examples.</p> <p><strong>Fire-types</strong>: Although less common, Fire-types can easily switch-in and OHKO Alolan Sandslash as long as they avoid Earthquake. Prominent examples include Mega Charizard X and Arcanine.</p> <p><strong>Coverage Moves</strong>: Alolan Sandslash's two prominent 4x weaknesses to Fighting- and Fire-type attacks make it fairly easy to OHKO for users of these attacks, with the most prominent examples being Mew and Melmetal.</p> <p><strong>Special Attackers</strong>: Alolan Sandslash's Special Defense is poor, so as long as opposing special attackers aren't weakened, they'll usually 2HKO or OHKO Alolan Sandslash with their STAB attacks.</p>",
    "sets": {
      "Priority Sweeper": {
        "description": "<h1>Set Information</h1> <p>Swords Dance gives Alolan Sandslash a much-needed boost in Attack to sweep. Ice Shard lets Alolan Sandslash sweep through weakened teams after a boost and makes it an excellent revenge killer against Dragonite. Earthquake offers some vital coverage, 2HKOing Melmetal after a boost and dealing massive damage to Alolan Muk even without a boost. Ice Punch is Alolan Sandslash's most powerful viable attack, which is useful for hitting Gyarados on the switch as well as OHKOing Sandslash and having a 68% chance to OHKO non-Impish Rhydon after Stealth Rock when boosted.</p> <h1>Usage Tips</h1> <p>Since Alolan Sandslash is so reliant on Ice Shard to sweep, it's usually best to save sending out Alolan Sandslash until late-game, when sweeping with it becomes a feasible win condition. There are a few times where Alolan Sandslash can revenge kill certain Pokemon with Ice Shard, particularly Pokemon weak to it such as Dragonite. Switching into Alolan Sandslash early is acceptable in these cases, though setting up Swords Dance is risky. While Alolan Sandslash has an excellent range of resistances, keeping it as healthy as possible increases the chances of sweeping by allowing it to take one big hit without resorting to priority, such as Melmetal's Earthquake.</p> <h1>Team Options</h1> <p>Stealth Rock setters are extremely important, since chip damage is key to setting up a sweep for Alolan Sandslash. Mew is an excellent example thanks to its Fighting-type resistance and ability to deal with Poliwrath. Other options like Aerodactyl, Rhydon, and Alolan Dugtrio still work, though you should note that the latter two share a lot of checks with Alolan Sandslash. Starmie and Mega Gyarados are particularly good options for covering Alolan Sandslash's Fire-type weakness (and Fighting-type weakness in Starmie's case). You'll want some checks to some of Alolan Sandslash's biggest threats if you want to sweep. Poliwrath is one of the most notable ones due to its Ice-type resistance and good defensive typing, but Water-types in general such as Starmie and Mega Gyarados can be problematic, and general defensive coverage against Fighting-, Fire-, and Ground-type attacks is recommended. This makes Zapdos an excellent teammate for its resistance to Fighting- and Ground-type attacks and ability to hit Water-types hard. Psychic-types such as Mew and Starmie often scare Poliwrath out, though they must watch out for Toxic, while a Poliwrath of your own will do fairly well against Mega Gyarados and Fire-types. While it shares a Fire-type weakness, Mega Venusaur does particularly well against Poliwrath and Mega Gyarados.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Theorymon", "user_id": 29010}], "teams": [{"name": "Quality checked by", "members": [{"username": "Eve", "user_id": 375272}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}, {"username": "Astra", "user_id": 240732}]}]}
  },
  "Nidoqueen": {
    "sets": {
      "Stealth Rock": {},
      "Defensive": {
        "outdated": true,
        "description": "<h1>Moves</h1> <p>Earthquake is crucial to slam Pokemon such as Alolan Muk, Mega Charizard X, and Chansey for major damage while also chipping Melmetal. Toxic has phenomenal synergy with Earthquake, as it can hurt Steel- and Poison-type Pokemon that are immune to Toxic, and it has perfect accuracy thanks to Nidoqueen's Poison typing. Super Fang is an amazing support move that dishes out heavy chip damage to healthier targets. Ice Beam provides solid coverage against Flying-types such as Dragonite, Aerodactyl, and Zapdos while also hurting Sandslash and Alolan Exeggutor. Ice Beam is used over Ice Punch to dish out more damage against Reflect variants of Zapdos while also ignoring the Attack-lowering effect of burn. If Nidoqueen's team lacks a Stealth Rock setter, the move can be used in the fourth slot to provide extra support. A Relaxed nature is preferred when using Ice Beam to get the most out of its damage output; otherwise, an Impish nature can be used, which allows Nidoqueen to outspeed neutral-natured Poliwrath.</p> <h1>Usage Tips</h1> <p>As one of LGPE OU's best checks to Alolan Muk and Zapdos, Nidoqueen should switch into these threats. Utilize both Toxic and Super Fang early-game to start whittling down the opposing team as soon as possible. With the number of switches Nidoqueen forces, these moves are very safe to use. Stealth Rock is best used when forcing something out or against a slower Pokemon. It's not ideal to use it against a faster threat, since Nidoqueen will unnecessary chip damage or be stopped by Taunt. Be wary of the number of times Nidoqueen switches into attacks throughout the course of the match. With no reliable recovery options and a mediocre Speed tier, it can be taken advantage of to create offensive momentum, especially against U-turn variants of Zapdos.</p> <h1>Team Options</h1> <p>Gyarados has great synergy with Nidoqueen, as pre-Mega Gyarados can switch into Ground-type moves aimed at it, while Mega Gyarados checks Psychic-types such as Alakazam and Starmie; meanwhile, Nidoqueen shields Gyarados from Electric-type moves. Nidoqueen appreciates the free switches Mega Beedrill provides through U-turn so that it can switch into Melmetal safely and whittle it down with Earthquake and Super Fang. Mega Beedrill also threatens Mew, Starmie, and Modest Mega Alakazam with its super effective Bug-type attacks. Fast sweepers like Mega Alakazam and Mega Aerodactyl appreciate Nidoqueen's ability to whittle down their checks with Toxic and Super Fang, which eases their job of cleaning weakened teams late-game. Pokemon that are threatened by Alolan Muk such as Starmie, Mew, Zapdos, and Mega Alakazam all take solace from Nidoqueen's ability to switch into it fairly easily.</p>"
      }
    }
  },
  "Nidoking": {
    "overview": "<p>Nidoking's amazing typing lets it check prominent Pokemon such as Zapdos and Alolan Muk, gives a helpful Stealth Rock resistance, and makes it immune to both Toxic and Thunder Wave. Unfortunately, Nidoqueen shares these traits and outclasses it defensively, and Alolan Dugtrio overshadows it in terms of Speed and therefore often in offensive presence. Nidoking therefore acts as a versatile midground choice with greater power than both, greater Speed than Nidoqueen, and a better movepool and tanking ability than Alolan Dugtrio. Its reduced bulk compared to Nidoqueen gives Nidoking a worse matchup against many common metagame threats such as Alolan Dugtrio, Melmetal, and Mega Charizard X, but its range of attacking options and solid power make it near impossible to consistently switch into. Due to its increased offensive capability, it is less prone than Nidoqueen to being exploited by Pokemon like Cloyster and Gyarados, which can use Nidoqueen for a somewhat free turn. Before its set is properly scouted, many major metagame threats risk heavy damage from one of Nidoking's coverage options or being hamstrung by its perfectly accurate Toxic.</p>",
    "comments": "<h1>Other Options</h1> <p>Superpower pressures Nidoking to switch out after use, but it KOes Snorlax after Earthquake, OHKOes Alolan Sandslash, OHKOes Eevee-S after Stealth Rock damage, and deals significant damage to Mega Gyarados. Surf guarantees an OHKO on Rhydon and Golem, which can otherwise take a hit and hit hard in return. Ice Beam is a slightly weaker alternative to Ice Punch that more reliably KOes Alolan Exeggutor after Stealth Rock damage and Sandslash after Earthquake. Substitute's HP cost can hinder Nidoking's ability to repeatedly switch into the likes of Zapdos and Alolan Muk, and the move can come at the cost of coverage, but it greatly eases the prediction typically required to handle Nidoking's switch-ins. Dragon Tail is hard to fit, but with good prediction, it can chip down and rack up Stealth Rock damage on switch-ins such as Starmie, Gyarados, and Mew. A Jolly or Naive nature can be used to guarantee that Nidoking outspeeds uncommon Jolly or Timid variants of Mega Gyarados and Mega Venusaur, but the power decrease is significant and decreases Nidoking's potential as a wallbreaker in most matchups.</p> <h1>Checks and Counters</h1> <p><strong>Mew</strong>: Mew is able to switch into any Nidoking set and threaten it out with Psychic or Scald. However, it must be wary of a potential Toxic when switching in or Megahorn if it is weakened.</p> <p><strong>Mega Gyarados</strong>: Though Nidoking can potentially OHKO Gyarados with Thunderbolt if it switches in before Mega Evolving, Mega Gyarados can stomach Nidoking's Earthquake and Ice Punch and threaten an OHKO with Waterfall.</p> <p><strong>Bulky Water-types</strong>: Starmie is capable of switching in on Earthquake or Ice Punch and recovering off the damage while heavily threatening Nidoking with its STAB moves, although it must be wary of switching into Megahorn. Poliwrath, Mega Blastoise, and Vaporeon have even less immediate fear of Nidoking, but they lack recovery and can be outsped, making them more vulnerable to fainting to repeated hits.</p> <p><strong>Fast Revenge Killers</strong>: Though Nidoking's coverage largely lacks safe switch-ins, its middling Speed tier allows it to be easily revenge killed by fast attackers like Mega Aerodactyl, Mega Alakazam, and Alolan Dugtrio.</p> <p><strong>Mega Venusaur</strong>: Mega Venusaur cannot switch in and safely handle Nidoking on-on-one, but if given safe entry, such as from Zapdos's U-turn, it can beat Nidoking while remaining relatively healthy overall.</p>",
    "sets": {
      "Wallbreaker": {
        "description": "<h1>Set Description</h1> <p>Earthquake is a spammable STAB option, hitting almost any grounded target hard and punishing Zapdos's Roost attempts. Ice Punch does great damage to Flying- and Grass-types, such as Zapdos, Dragonite, and Alolan Exeggutor, that can handle Earthquake. Toxic is a good midground option when you are unsure of the opponent's switch-in and a reliable means of threatening Mew, which can easily shrug off Earthquake. Alternatively, Megahorn can be used to catch certain switch-ins, KOing a weakened Mew, usually OHKOing Starmie, and 2HKOing Mega Gyarados. Stealth Rock provides invaluable support for any team not packing another setter and aids Nidoking in breaking targets such as Zapdos and Melmetal, while Toxic or Thunderbolt can be opted for instead if they are not already being run. Thunderbolt with a Naughty nature takes advantage of Gyarados that are hesitant to Mega Evolve and become vulnerable to Earthquake and Megahorn, usually OHKOing it after Stealth Rock, and can also OHKO Cloyster, which otherwise uses Nidoking as setup fodder. Adamant is the preferred nature for Nidoking when not running Thunderbolt, notably giving it extremely favorable odds to 2HKO Melmetal on the switch with Earthquake.</p> <h1>Usage Tips</h1> <p>Nidoking is best used as a wallbreaker that can be adapted to any strategy and soften defensive backbones for its teammates. Its true strength comes from its unpredictable coverage, often in the form of moves not listed on its main set that are specifically tailored for luring in and taking out Pokemon your team struggles with. As a result, it's generally best to not reveal information about your set until it is necessary. Nidoking outspeeds many Pokemon that would try to come in to scare it out or set Stealth Rock. In those cases, predicting is unnecessary, as Nidoking can simply hit them the next turn. If running Stealth Rock, Nidoking should be played more conservatively until it successfully sets up the entry hazard; if not, it can be used more recklessly, but it should still be preserved if needed to answer Zapdos. Setting Stealth Rock against Zapdos is ideal, as it is unable to significantly punish Nidoking for doing so. Nidoking can be brought in fairly safely versus Pokemon such as Zapdos, Alolan Muk, and Electrode, as they rarely carry moves that can significantly threaten it. While it can be tempting to sacrifice a heavily weakened Nidoking, its decent Speed tier, resistance to Stealth Rock, and powerful Earthquake mean that it can still be valuable for revenge killing tanks like Rhydon and Melmetal.</p> <h1>Team Options</h1> <p>Mega Beedrill and Zapdos are amazing partners for Nidoking, luring in and pivoting on Pokemon such as Melmetal, Rhydon, and Nidoqueen that Nidoking can then heavily threaten with Earthquake. Mew appreciates Nidoking as a partner that can absorb Toxic for it, making its defensive roles easier to perform, while Nidoking appreciates U-turn granting it safe entry against Mew's switch-ins such as Alolan Muk and Zapdos. Mew can also soft check threats like Starmie and Alolan Dugtrio. Pokemon such as Starmie and Poliwrath greatly benefit from Nidoking freely switching into every move from Zapdos bar Drill Peck and dishing out strong attacks. Starmie also has synergy with Nidoking, switching into Alolan Dugtrio and opposing Poliwrath, while Poliwrath can provide a valuable switch-in for Mega Gyarados if Nidoking needs to be preserved. Melmetal makes for a great teammate, as it can handle Mega Aerodactyl and Mega Alakazam. In return, Nidoking can be switched into Zapdos that attempt to check Melmetal. Mega Aerodactyl and Mega Alakazam also appreciate Nidoking's support in weakening foes into range of their attacks and crippling Mew with Toxic.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "McCoolDude", "user_id": 469684}, {"username": "Eve", "user_id": 375272}], "teams": [{"name": "Quality checked by", "members": [{"username": "Eve", "user_id": 375272}, {"username": "Vengeance417", "user_id": 198446}, {"username": "Lily", "user_id": 481709}]}, {"name": "Grammar checked by", "members": [{"username": "Astra", "user_id": 240732}, {"username": "Lumari", "user_id": 232216}]}]}
  },
  "Clefable": {
    "sets": {
      "Stealth Rock Lead": {},
      "Calm Mind": {
        "outdated": true,
        "description": "<h1>Set Description</h1> <p>Calm Mind allows Clefable to improve its rather mediocre Special Attack stat and function better as a wallbreaker. Thunder Wave allows Clefable to cripple Pokemon like Starmie, Mega Alakazam, and Mega Aerodactyl. Fire Blast is a powerful coverage option that allows Clefable to potentially OHKO Melmetal at +1, but Flamethrower can be used in its place for consistency. Stealth Rock allows Clefable to wear down its checks such as Melmetal and Alolan Muk for it to handle them more easily, and its offensive presence allows it to be a reliable Stealth Rock setter on offensive teams. Thunder Wave can be used instead on teams with another Stealth Rock user.</p> <h1>Usage Tips</h1> <p>Since this particular set is focused on its role as a wallbreaker, it is best utilized early- or mid-game. Clefable should almost always set up on passive Pokemon such as defensive Mew or Pokemon it forces out like Alolan Exeggutor and Dragonite. If an opponent has Melmetal on their team and you predict that they’re going to switch into it, use Calm Mind and Fire Blast on to OHKO it after some minimal chip damage. Clefable’s main priority should be setting Stealth Rock early-game, particularly if the opponent has a Pokemon it really struggles to get through that happens to be weak to Stealth Rock, such as Moltres or Mega Charizard Y. Clefable can also take advantage of the lack of common Poison-type moves on Pokemon such as Alolan Muk and Nidoqueen and wallbreak them.</p> <h1>Team Options</h1> <p>Clefable fits on balance teams that have the capability to handle its checks. Chansey makes for a decent partner, since it can check Pokemon like Gengar and Mega Alakazam and safely pivot to bring Clefable in with Teleport; in return, Clefable can check Fighting-types like Poliwrath and switch into U-turn. Wallbreakers like Gengar, Melmetal, and Mega Gyarados appreciate Clefable setting Stealth Rock to help wear down their switch-ins. Similarly, late-game cleaners such as Mega Aerodactyl, Mega Alakazam, and Dragonite appreciate Stealth Rock wearing down foes for them to clean more easily, and they also really appreciate how good Clefable is at forcing damage on Melmetal. Since Clefable is walled by special walls such as Chansey and Snorlax, checks to them like Poliwrath and Melmetal are appreciated. Finally, since Melmetal beats Clefable one-on-one, checks to it like Mega Charizard X, Mew, and Sandslash are appreciated. Mega Charizard X can check Mega Venusaur for Clefable, Mew can handle Nidoqueen, and Sandslash is able to run Stealth Rock, allowing Clefable to run Thunder Wave alongside Calm Mind.</p>"
      }
    }
  },
  "Ninetales-Alola": {
    "overview": "<p>Alolan Ninetales is a niche setup sweeper in LGPE OU. It's one of the few Pokemon with access to Nasty Plot, which, alongside its unique typing that gives it solid coverage with just its STAB moves, makes it quite threatening on paper. Its ability to outrun Pokemon like Mew and Zapdos helps with this, and access to support moves that give it setup opportunities like Encore and Hypnosis makes it even scarier, as it can potentially incapacitate one of its counters. Unfortunately, its low Special Attack means that even after a boost, it's too weak to OHKO most targets. Its attacks have a low Base Power, too, which doesn't help matters at all. On top of all this, it doesn't have a great way to hit Steel-types, which is massively problematic in a metagame dominated by Melmetal. All of this combined means that Alolan Ninetales is pretty hard to justify on a team and leaves it generally outclassed by similar setup sweepers like Mega Alakazam and Nasty Plot Mew, as well as other niche setup sweepers such as Alolan Persian and Alolan Raichu.</p>",
    "comments": "<h1>Other Options</h1> <p>Alolan Ninetales has a very shallow movepool, so there isn't much else it can do. Ice Shard can be used over Dark Pulse to help with revenge killing Dragonite, but Alolan Ninetales has an awful Attack stat, so it doesn't really do that much damage. Blizzard can be used over Dark Pulse too, being a very powerful attack that outdamages a super effective Dark Pulse if the target doesn't resist Ice, and it also outdamages a neutral Dark Pulse on the likes of Melmetal. Its accuracy can be disappointing, though.</p> <h1>Checks and Counters</h1> <p><strong>Steel-types</strong>: Melmetal is a perfect counter to Alolan Ninetales, being able to stomach any of its hits and OHKO it in return with Double Iron Bash. While Alolan Sandslash can't OHKO Alolan Ninetales, it can take attacks and retaliate with Earthquake for some damage.</p> <p><strong>Poison-types</strong>: Alolan Muk is a good defensive answer to Alolan Ninetales, using its great special bulk to tank hits and do a lot of damage in return with Fire Blast or the rare Poison Jab. Mega Beedrill and Gengar can't switch into Alolan Ninetales, but they can both outspeed and revenge kill it with their STAB attacks.</p> <p><strong>Fire-types</strong>: While rare, certain Fire-types can handle Alolan Ninetales quite well. Mega Charizard X and Mega Charizard Y can both stomach a boosted hit and OHKO Alolan Ninetales in return with their STAB attacks, while Arcanine can handle multiple hits and hit it very hard in return.</p> <p><strong>Special Walls</strong>: Snorlax and Chansey take very little damage from any of Alolan Ninetales's attacks, even after a boost. They can be crippled by Hypnosis, but beyond that, Alolan Ninetales can't do much to pressure them, and they can slowly knock it out with Seismic Toss or Facade.</p> <p><strong>Faster Revenge Killers</strong>: Alolan Ninetales is fast, but plenty of Pokemon are faster. Mega Alakazam and Starmie can revenge kill a weakened Alolan Ninetales, while Mega Aerodactyl can knock it out from full. They must all be wary of switching into Alolan Ninetales, though.</p>",
    "sets": {
      "Nasty Plot": {
        "description": "<h1>Set Information</h1> <p>Nasty Plot boosts Alolan Ninetales's Special Attack to threatening levels, allowing it to break through frailer Pokemon and clean up weakened teams. Ice Beam nets good coverage on the tier and hits Pokemon like Rhydon and Nidoqueen very hard. Dazzling Gleam is used a secondary STAB attack that breaks through Dark-types like Mega Gyarados. Dark Pulse is the most consistent option in the last slot, getting a harder hit on Mew and Melmetal. Encore can also be used, as locking a foe into a move like Stealth Rock can give Alolan Ninetales setup opportunities. Hypnosis is another option, potentially incapacitating a check like Melmetal; its shaky accuracy makes it unreliable, though.</p> <h1>Usage Tips</h1> <p>Bring Alolan Ninetales in via VoltTurn support or on double switches; it's not bulky enough to switch into anything, and its poor defensive typing doesn't help it. Bringing it in when a teammate faints works too. Try to set up on Pokemon that cannot OHKO Alolan Ninetales like Sandslash, Substitute Mega Gyarados, and Zapdos. Don't set up until Pokemon like Melmetal and Mew have been weakened significantly, as they can easily grind Alolan Ninetales's sweep to a halt. If a faster revenge killer like Mega Beedrill or Mega Aerodactyl is still alive on the opponent's team, try to take it out before attempting to sweep.</p> <h1>Team Options</h1> <p>Good Melmetal checks are always necessary, but this is doubly true when using Alolan Ninetales. Pokemon like Mega Gyarados, Zapdos, and Poliwrath are all great teammates for this reason. Contrarily, teammates that appreciate Melmetal being weakened like Dragonite, Mega Beedrill, and Mega Aerodactyl are excellent, as Alolan Ninetales is one of the most reliable ways of forcing chip damage on Melmetal. Melmetal itself is also a good teammate, being able to handle Pokemon like Mega Beedrill and Mega Aerodactyl for Alolan Ninetales. Starmie is a good teammate thanks to its ability to handle Fire-types like Mega Charizard X, as well as acting as a backup check to Melmetal. Nasty Plot Mew is an effective teammate that shares many checks with Alolan Ninetales; this means that they can break through Pokemon like Melmetal and Alolan Muk for each other, enabling their partner's sweep. Stealth Rock support is helpful when using Alolan Ninetales, as many of its best offensive checks like Mega Aerodactyl are weak to it. Setters like Rhydon, Sandslash, and Nidoqueen are all good teammates. Dual screens support from Electrode can be helpful to give Alolan Ninetales more setup opportunities, as the boost in bulk makes Alolan Ninetales quite tough to take down.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Lily", "user_id": 481709}], "teams": [{"name": "Quality checked by", "members": [{"username": "Eve", "user_id": 375272}, {"username": "Vengeance417", "user_id": 198446}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}, {"username": "Astra", "user_id": 240732}]}]}
  },
  "Dugtrio-Alola": {"sets": {"Standard": {}}},
  "Primeape": {
    "overview": "<p>Primeape distinguishes itself among the various Fighting-types in LGPE OU by virtue of its access to U-turn, allowing it to function as a fearsome pivot that can take advantage of common checks such as Mew and Zapdos. This, in tandem with Primeape's access to plentiful coverage options and a strong Low Kick, gives it a decent niche as an all-out attacker. Furthermore, Primeape's decent Speed tier enables it to be effective against common foes like Dragonite and Gyarados. However, its Speed stat is not amazing and leaves it susceptible to prominent threats such as Mega Alakazam, Mega Aerodactyl, and Starmie. Furthermore, Primeape faces competition from other Fighting-types such as Poliwrath, Machamp, and Hitmonlee that possess better defensive or offensive capabilities.</p>",
    "comments": "<h1>Other Options</h1> <p>Poison Jab threatens Clefable, but the loss of better coverage moves or U-turn is not ideal. Bulk Up can turn Primeape into a fearsome offensive presence, but it is generally inconsistent due to Primeape's subpar Speed stat and mediocre defenses. Toxic is able to cripple Mew as it switches in, but Primeape struggles to fit the move.</p> <h1>Checks and Counters</h1> <p><strong>Mew</strong>: Mew outspeeds Primeape and can cripple it with Will-O-Wisp or KO it with Psychic. However, Mew should be wary of potentially switching into a U-turn or being inflicted with Toxic poison.</p> <p><strong>Faster Revenge Killers</strong>: Although Mega Alakazam, Starmie, and Mega Aerodactyl cannot directly switch into Primeape due to the fear of U-turn or Ice Punch, they can easily outspeed and revenge kill it.</p> <p><strong>Zapdos</strong>: Zapdos takes minimal damage from Low Kick and can 2HKO Primeape with Drill Peck. However, it dislikes switching into an Ice Punch or Rock Slide and must be wary of carelessly using Roost due to Earthquake.</p> <p><strong>Mega Venusaur</strong>: Mega Venusaur's impressive bulk allows it to absorb hits—even Ice Punch—from Primeape and 2HKO it back with Mega Drain or Sludge Bomb.</p>",
    "sets": {
      "All-out Attacker": {
        "description": "<h1>Set Information</h1> <p>Low Kick is Primeape's most powerful STAB move, 2HKOing Melmetal and Rhydon while also dealing with prominent threats such as Mega Gyarados and Snorlax. Ice Punch OHKOes Dragonite and pressures Zapdos, Nidoqueen, and Mega Venusaur. Earthquake allows Primeape to break through common foes like Mega Charizard X, Alolan Muk, and Gengar; deals more damage to neutral targets like Mew on a missed prediction; and can potentially threaten Zapdos after Roost. Thunder Punch serves as coverage for Water-types such as Gyarados, Poliwrath, and Vaporeon and OHKOes Mega Charizard Y after Stealth Rock damage. U-turn allows Primeape to function as an offensive pivot, establishing momentum by switching out against checks such as Mew and Zapdos. An Adamant nature is preferred for the damage output, although a Jolly nature can be utilized to outspeed Nidoking and neutral-natured variants of Mew and Zapdos.</p> <h1>Usage Tips</h1> <p>Primeape is best utilized early- and mid-game as a wallbreaker, threatening common Stealth Rock setters such as Rhydon, Nidoqueen, and Alolan Dugtrio with super effective coverage to prevent Stealth Rock from being set up. Primeape should utilize U-turn to retain offensive momentum, allowing it to escape from checks such as Mew and Zapdos while bringing in a suitable answer such as Alolan Muk against the former or Rhydon against the latter. Furthermore, Primeape can take advantage of its various coverage options to weaken its numerous checks, although that requires careful predictions.</p> <h1>Team Options</h1> <p>Alolan Muk synergizes well with Primeape, serving as a check to Psychic-types such as Mew, Mega Alakazam, and Starmie. In return, Primeape can threaten Rhydon, Alolan Dugtrio, and Melmetal, which give Alolan Muk trouble. Partners like Starmie can switch into the aforementioned foes and weaken them, ensuring that Primeape can KO them consistently. Ground-types such as Nidoqueen, Alolan Dugtrio, and Rhydon provide Stealth Rock support to weaken foes while serving as checks to Zapdos, with Alolan Dugtrio also checking the aforementioned Psychic-types. Melmetal and the aforementioned Rhydon also function as physical walls against notable revenge killers such as Mega Aerodactyl. Powerful wallbreakers and sweepers such as Mega Alakazam, Mega Beedrill, and Gengar can take advantage of U-turn from Primeape to safely switch into battle and threaten its checks such as Mega Venusaur and Mew. Mega Beedrill is a notable partner, providing U-turn support to safely bring Primeape into battle while Primeape can return the favor by pressuring Melmetal.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "DC", "user_id": 449990}], "teams": [{"name": "Quality checked by", "members": [{"username": "Vengeance417", "user_id": 198446}, {"username": "Eve", "user_id": 375272}, {"username": "Lily", "user_id": 481709}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}, {"username": "Empress", "user_id": 175616}]}]}
  },
  "Poliwrath": {
    "overview": "<p>Poliwrath makes for a solid glue Pokemon in LGPE OU thanks to its unique defensive typing and decent overall bulk, which allow it to handle many top threats such as Alolan Dugtrio, Rhydon, and, most importantly, Mega Gyarados and Melmetal. Poliwrath also has a solid offensive movepool, including strong STAB attacks in Superpower and Waterfall, coverage moves like Earthquake, and more consistent methods of damaging the foe like Seismic Toss and Low Kick. However, the presence of Psychic-types such as Starmie, Mega Alakazam, and Mew and Flying-types such as Zapdos and Dragonite makes Poliwrath a complete liability at times. It is also weak to Electric-type moves, which are quite common in the metagame, and its rather mediocre Speed tier gives Pokemon such as Zapdos and Starmie the potential to easily take it out. Lastly, Poliwrath lacks reliable recovery, so it is prone to being worn down over time.</p>",
    "comments": "<h1>Other Options</h1> <p>Poliwrath has access to Hypnosis, which is rare among Pokemon of its type and can be utilized to cripple common switch-ins like Mega Venusaur. It's rather inaccurate, though. Ice Punch can serve as a good coverage move against Dragonite and Mega Venusaur, but it otherwise has little use. Rest can be used in conjunction with Eevee-S to give Poliwrath recovery, but it isn't the most reliable, since at minimum this strategy takes four turns to execute. A more defensive set can be utilized to take advantage of Poliwrath's good bulk and defensive typing, but this set often lacks firepower and as such can be quite passive.</p> <h1>Checks and Counters</h1> <p><strong>Psychic-types</strong>: Pokemon such as Mew and Starmie can easily outspeed Poliwrath and take it out, in addition to not taking much damage from Poliwrath's moves. They do fear Toxic, however.</p> <p><strong>Dragonite</strong>: Dragonite doesn't appreciate Toxic or the niche Ice Punch, but it can switch in on Poliwrath's other moves and take advantage of it by setting up with Agility.</p> <p><strong>Electric-types</strong>: Zapdos is one of the most notable counters to Poliwrath, as it resists Poliwrath's Fighting-type STAB attacks, is immune to Ground, outspeeds it, and can easily take it out with Thunderbolt. Electrode doesn't like switching into most of Poliwrath's moves, but it similarly can outspeed Poliwrath and 2HKO with Thunderbolt.</p> <p><strong>Mega Venusaur</strong>: Mega Venusaur can tank any hit from Poliwrath and easily recover with Mega Drain. It is also immune to Toxic.</p>",
    "sets": {
      "Tank": {
        "description": "<h1>Set Information</h1> <p>Strong STAB options such as Superpower and Waterfall allow Poliwrath to not remain too passive in a match. Alternatively, Low Kick can be used over Superpower as a reliable option against Pokemon like Melmetal, Mega Gyarados, and Snorlax and avoids lowering Poliwrath's stats, although one must note it's not the strongest attack against certain Pokemon like Eevee-S. Scald similarly can be used over Waterfall with a Relaxed nature to deal as much damage as Earthquake on Melmetal, hit physically defensive Pokemon harder, and spread burns, which can be devastating to many of the Pokemon Poliwrath checks. Toxic is used to cripple common switch-ins to Poliwrath like Mew, Starmie, and Zapdos. Seismic Toss provides a more reliable method of damage output against Pokemon that resist Poliwrath's STAB moves like Clefable and Mega Venusaur, in addition to being a damaging move that's still reliable when Poliwrath gets burned. Alternatively, Earthquake is notable for hitting Alolan Muk and Mega Charizard X. An Impish nature is used to increase Poliwrath's bulk, giving it more opportunities to switch into the Pokemon it checks without lowering its damage output or Speed. However, when using Scald over Waterfall, Relaxed is preferred, which still gives a Defense boost while dropping Speed, one of Poliwrath's less important stats.</p> <h1>Usage Tips</h1> <p>Poliwrath's resistances to Steel, Rock, and Dark and good bulk can be utilized to easily switch it in on Pokemon like Melmetal and Mega Gyarados. Superpower is mainly used as a strong attacking option if there are no better options. It is recommended to switch out Poliwrath after Superpower has been used, since the stat drops make Poliwrath easier to take advantage of. Earthquake is generally to be used when a Pokemon like Alolan Muk or Gengar is switching in rather than as a regular attack. When against Melmetal, Poliwrath can use either Scald or Earthquake to soften it up before using Superpower. However, one must be wary of Thunder Punch.</p> <h1>Team Options</h1> <p>Alolan Muk can take advantage of the Psychic-types that generally counter Poliwrath thanks to its Dark typing, in addition to being a reliable check to Gengar. In return, Poliwrath can handle Pokemon such as Mega Gyarados and Melmetal. Eevee-S's Sparkly Swirl can be used to heal status off Poliwrath, as Poliwrath doesn't like being paralyzed or burned. It also means that Poliwrath can more freely utilize moves like Rest. Mega Aerodactyl or even regular Aerodactyl can take care of the Flying-types that Poliwrath struggles with while also setting up Stealth Rock to increase the potency of Poliwrath's damage output.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Melons-N-Soda", "user_id": 206635}], "teams": [{"name": "Quality checked by", "members": [{"username": "Theorymon", "user_id": 29010}, {"username": "Eve", "user_id": 375272}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}, {"username": "Rabia", "user_id": 336073}]}]}
  },
  "Alakazam": {
    "overview": "<p>Alakazam and its Mega counterpart are both terrifying revenge killers that can swiftly sweep teams, especially late-game. An outstanding base 150 Speed stat after Mega Evolving enables Mega Alakazam to outspeed the entire metagame bar Mega Aerodactyl and Electrode, which both Speed tie it. Mega Alakazam also packs great power alongside a decent special movepool to complement it, with options such as Shadow Ball and Dazzling Gleam alongside its STAB attack allowing it to hit the majority of the metagame for at least neutral damage. Calm Mind further increases its offensive prowess to frightening levels. Unfortunately, despite great Special Defense, Mega Alakazam bears little to no defensive presence due to abysmal HP and Defense, meaning it will often rely on foddering a teammate or pivoting in order to come in safely. Checks such as Melmetal and Alolan Muk are seen on a majority of teams, meaning that Mega Alakazam can often struggle to break through teams carrying the aforementioned threats unless they have been significantly worn down.</p>",
    "comments": "<h1>Other Options</h1> <p>Substitute can be a great way to punish switches, as it allows Mega Alakazam to get off at least two hits in the majority of cases. However, foregoing coverage options can hamper Mega Alakazam's ability to dent checks such as Alolan Muk and Melmetal. Encore can be used to lock opposing Pokemon into non-harmful moves such as Stealth Rock and recovery options as well as generally weak moves that do not dent Mega Alakazam greatly. However, as with Substitute, Mega Alakazam often lacks the ability to pull off this option without risking a worse matchup against its checks.</p> <h1>Checks and Counters</h1> <p><strong>Alolan Muk</strong>: Alolan Muk is one of the only viable Dark-types in the tier apart from Mega Gyarados, meaning it can switch into Mega Alakazam's STAB Psychic safely, while its additional Poison typing offers it a neutrality to Dazzling Gleam. However, Alolan Muk is prone to being worn down and can be chipped enough to the point where Mega Alakazam can KO.</p> <p><strong>Alolan Dugtrio</strong>: Alolan Dugtrio can threaten to revenge kill Mega Alakazam with Sucker Punch before it even has the chance to retaliate, however it cannot switch into Mega Alakazam's coverage moves safely unless it is at near full health.</p> <p><strong>Melmetal</strong>: While Melmetal may not posses the greatest Special Defense, its typing still offers it the chance to tank STAB Psychic from Mega Alakazam at least twice, while it can OHKO Mega Alakazam with its own STAB move in return. However, Shadow Ball can still severely dent Melmetal, especially if Mega Alakazam is offered the chance to set up a Calm Mind.</p> <p><strong>Chansey and Snorlax</strong>: Chansey and Snorlax's high special bulk enables them to switch into Mega Alakazam comfortably, as they can usually avoid being 2HKOed, while the former can cripple Mega Alakazam via Thunder Wave, and the latter can threaten to OHKO it with Facade. However, Snorlax's lack of reliable recovery means it cannot switch into Mega Alakazam repeatedly.</p> <p><strong>Mega Gyarados</strong>: Once Mega Evolved, Mega Gyarados can check Mega Alakazam by switching into Psychic and Shadow Ball with little remorse and threaten to OHKO it in return with Crunch. However, it must look out for Dazzling Gleam, especially when Stealth Rock is up, as Mega Alakazam can easily 2HKO it.</p>",
    "sets": {
      "Wallbreaker": {
        "description": "<h1>Set Information</h1> <p>Psychic is Mega Alakazam's most powerful STAB option and can break through the majority of its targets while providing a small chance to lower the foe's Special Defense to ease breaking through it. Dazzling Gleam hits Alolan Muk for neutral damage, providing Mega Alakazam the chance to chip it down every time it is forced in. It also has the added benefit of 2HKOing Mega Gyarados after Stealth Rock damage, enabling Mega Alakazam to circumvent an otherwise nuisance to it. Shadow Ball complements Psychic well, targeting Steel- and Psychic-types such as Melmetal and Mew that resist Psychic. Calm Mind can boost Mega Alakazam's offensive presence even further, enabling it to sweep late-game once checks such as Alolan Muk and Melmetal have been significantly weakened. Recover can be useful as a means to increase Mega Alakazam's longevity; however, its poor defenses deny it many chances from doing so often. Furthermore, using Recover forces Mega Alakazam to forego one of its coverage options, meaning that it can have a much more difficult time sweeping when dealing with opposing checks. A Timid nature enables Mega Alakazam to outspeed as many threats as possible alongside letting it Speed tie with Mega Aerodactyl. A Modest nature can be used to offer Mega Alakazam the chance to score 2HKOs against the likes of Melmetal and Snorlax after Stealth Rock. However, this leaves Mega Alakazam outsped by Mega Beedrill and loses out on the Speed tie against Mega Aerodactyl and Electrode.</p> <h1>Usage Tips</h1> <p>Mega Alakazam should not be directly switched into attacks, as the majority of moderately strong attackers threaten to OHKO it. Therefore, it is advised to bring it in safely through slow pivoting or by foddering off another teammate. While Mega Alakazam should be spamming its STAB attack the majority of the time, Dazzling Gleam and Shadow Ball should be used to target common switch-ins such as Alolan Muk and Melmetal which Mega Alakazam often forces in and can chip down severely with repeated attacks. Calm Mind should be used versus special attackers or when Mega Alakazam can force a switch out, as its meager defenses dissuade it from stacking boosts safely. Additionally, Mega Alakazam shouldn't set up until checks such as Alolan Muk and Snorlax are in range of boosted attacks, preventing any halts in a sweep. Beware of priority users such as Sucker Punch Alolan Dugtrio, as it can threaten to KO Mega Alakazam before it can even inflict any damage itself.</p> <h1>Team Options</h1> <p>Team members such as Nidoqueen and Poliwrath that can help deal with checks such as Alolan Muk and Melmetal are much appreciated. Other offensive threats such as Dragonite, Melmetal, and Alolan Dugtrio can help apply pressure to Mega Alakazam's common switch-ins, while they appreciate Mega Alakazam's ability to revenge kill threatening foes such as Mega Beedrill and Starmie. Alolan Dugtrio also provides Stealth Rock support, which can get crucial chip damage on the opposing team. Pivots such as Mew and Zapdos enable Mega Alakazam to come in more frequently without needing to sacrifice another teammate in order to bring it safely. Mew can also effectively lure in and remove some of Mega Alakazam's checks such as Alolan Muk when running coverage options such as Earthquake and set up moves such as Bulk Up, increasing Mega Alakazam's sweeping potential.</p>"
      }
    },
    "credits": {"writtenBy": [], "teams": [{"name": "Quality checked by", "members": [{"username": "Hayburner", "user_id": 291554}, {"username": "Theorymon", "user_id": 29010}, {"username": "Eve", "user_id": 375272}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}, {"username": "Rabia", "user_id": 336073}]}]}
  },
  "Machamp": {
    "overview": "<p>Machamp has a lot of competition as a niche Fighting-type Pokemon in LGPE OU, with Poliwrath providing greater defensive utility thanks to its additional Water typing, Hitmonlee having a more spammable STAB move in High Jump Kick and a better Speed tier, and Primeape providing an effective pivot with its access to U-turn. What Machamp offers is a midground between Poliwrath and Hitmonlee, with very similar bulk to Poliwrath and attacking power similar to Hitmonlee—in fact, its coverage moves hit harder than Hitmonlee's thanks to its superior Attack stat. This extra level of offensive threat compared to Poliwrath makes it better at forcing Mew to switch in and risk taking a Toxic. Its lack of a Water typing also has upsides defensively and notably allows it to trade blows with standard Zapdos and Mega Venusaur far better than Poliwrath can. These traits combine to make Machamp a respectable tank that excels at handling many Pokemon one-on-one and is capable of specifically threatening popular Pokemon like Melmetal, Rhydon, Snorlax, and Alolan Muk. Machamp's main downside is its extremely poor matchup against Mew, which comfortably counters it even when inflicted with Toxic and is on almost every competitive team. Having such a consistent switch-in greatly limits Machamp's ability to perform the damage trades it is used for, but when supported by its teammates against Mew it can still perform respectably.</p>",
    "comments": "<h1>Other Options</h1> <p>Poison Jab can be used to hit Clefable hard and occasionally poison a switch-in such as Mew, but it is extremely hard to justify over any standard option due to how redundant it is otherwise. Encore can be used to catch opposing Pokemon off guard by, for example, locking them into using Earthquake or Roost and then exploiting that with the likes of Swords Dance Dodrio, but Machamp's slowness and tendency to force offensive responses make it quite poorly suited for this role. Rock Slide deals great damage to Mega Charizard Y and Moltres, but this is fairly unimportant, as these Pokemon are destroyed by Stealth Rock and can potentially have their Roosts punished by Earthquake. Thunder Punch deals the most damage to Starmie and Poliwrath out of any of Machamp's options, handily 2HKOing both after Stealth Rock damage and making it hard for Starmie to safely use Recover, but Earthquake 2HKOes Starmie lacking Reflect after Stealth Rock damage anyway and Poliwrath is hit almost as hard by Low Kick while not posing much of a threat in return. Facade can enable Machamp to threaten Scald Mew, especially if Mew is also taking Toxic damage, but it is entirely useless if Scald fails to burn Machamp and can be hard to fit on a moveset.</p> <h1>Checks and Counters</h1> <p><strong>Psychic-type Pokemon</strong>: Mew can take any of Machamp's attacks with ease, heal with Roost, and threaten back with Psychic, Scald, or Will-O-Wisp; it dislikes being inflicted with Toxic, but it counters Machamp even when that is accounted for. Mega Alakazam, Starmie, and Alolan Raichu don't take Earthquake as well as Mew does, but they can switch in on Machamp's STAB attack if necessary and threaten it with a powerful Psychic. Exeggutor can switch in on Machamp's STAB attack and Earthquake with ease and retaliate with Psychic or Sleep Powder, but it is a risky check, as it Speed ties with Machamp and is 2HKOed by Ice Punch.</p> <p><strong>Mega Aerodactyl</strong>: While not a switch-in, Mega Aerodactyl can pick off a weakened Machamp with Wing Attack quite easily. If the Machamp has set up with Bulk Up, however, this may prove more difficult.</p> <p><strong>Clefable</strong>: While many Pokemon can handle Machamp one-on-one, Clefable is unique among Pokemon that aren't Psychic-type for not being weak to any of Machamp's attacks, letting it avoid a 2HKO from any of its moves after Stealth Rock and retaliate with a strong super effective STAB Moonblast.</p> <p><strong>Mega Venusaur</strong>: Mega Venusaur can handle Machamp decently, resisting its STAB attack, tanking Ice Punch respectably, and threatening it with Sleep Powder, but it can struggle to do enough immediate damage in return to win one-on-one.</p>",
    "sets": {
      "Physical Wallbreaker": {
        "description": "<h1>Set Information</h1> <p>Low Kick, while weaker against many targets, is Machamp's most spammable STAB option and deals massive damage to Melmetal. Superpower is an alternative that isn't as spammable but guarantees a hard hit against anything that doesn't resist it, making it more suited to a hit-and-run playstyle. As such, it should never be used alongside Bulk Up. Ice Punch provides near-perfect coverage when paired with Machamp's STAB attack, most importantly threatening Zapdos and Mega Venusaur. Earthquake OHKOes Gengar, 2HKOes Starmie and Mega Charizard X, does more to Alolan Muk and Nidoqueen than any other option, and punishes Zapdos using Roost, making it the best option for maximizing Machamp's immediate offensive capabilities. Bulk Up can be quite fearsome if Mew is dealt with, making Machamp capable of feats such as OHKOing Melmetal with Low Kick, but Machamp's low Speed means that sweeping is very unlikely, and it requires smart use in order to be effective. The same is true for Substitute, which lets Machamp more safely punish predicted switches or guard against revenge killing. Toxic is vital for punishing Mew, which can otherwise easily switch in and wall Machamp with no risk, and also improves Machamp's ability to threaten Zapdos and Starmie.</p> <h1>Usage Tips</h1> <p>Machamp's low number of resistances means that it isn't a good switch-in to most Pokemon, but its solid bulk makes it capable of taking on prominent Pokemon such as Rhydon, Melmetal, and Mega Gyarados one-on-one. As such, it is often most effective when provided safe entry via a slow U-turn or after a KO. Opponents may try to use Zapdos, Mew, and Starmie as midground switch-ins that can heal off hits; predicting this and using Toxic greatly increases Machamp's effectiveness. As most other bulky Pokemon are slower than Machamp or don't heavily threaten it, predicting them to switch in is not as vital. When facing down healthy Melmetal and Rhydon, Bulk Up can be used to guarantee an OHKO on them on the following turn while taking as little damage as possible in the process—however, if damage on these targets is important for teammates, it may be smarter to immediately attack them, as they would be likely to switch out after you use Bulk Up.</p> <h1>Team Options</h1> <p>Machamp struggles immensely with Psychic-type Pokemon, and as a result their best answer, Alolan Muk, makes for a great teammate. In return, Alolan Muk appreciates Machamp's ability to threaten Ground-types like Nidoqueen, Rhydon, and Alolan Dugtrio one-on-one. Machamp benefits greatly from U-turn users that can help it switch into favorable matchups safely, most notably Mew and Zapdos; these two in particular greatly appreciate Machamp's proficiency at tackling the likes of Mega Gyarados, Alolan Muk, Alolan Dugtrio, and Nidoqueen one-on-one, which are some of their most prominent switch-ins. Mew can also provide Stealth Rock support to help in wearing down Machamp switch-ins like Zapdos and opposing Mew. Mega Beedrill is another pivot and can make use of Machamp to apply further pressure to its most common defensive answers, namely Melmetal and Rhydon, and put Zapdos in range of its Poison Jab. In return, Machamp greatly appreciates Mega Beedrill's ability to outspeed and threaten its best answer, Mew, with massive damage. Melmetal is a great secondary measure for handling Mega Alakazam and Wing Attack Mega Aerodactyl, two Pokemon that Machamp fears, and in turn it appreciates not being the team's only tank so its valuable HP can be preserved.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Eve", "user_id": 375272}], "teams": [{"name": "Quality checked by", "members": [{"username": "Collette", "user_id": 520031}, {"username": "dhelmise", "user_id": 241023}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}, {"username": "Astra", "user_id": 240732}]}]}
  },
  "Victreebel": {
    "overview": "<p>Victreebel is a decent, if unreliable, setup wallbreaker. Thanks to its access to Sleep Powder and a powerful Grass-type STAB attack, it is capable of scaring out many prominent Pokemon, including common Stealth Rock setters like Rhydon and Sandslash, and setting up with Swords Dance. It even has Sucker Punch in order to pick off frail or weakened Pokemon that could otherwise outspeed and KO it, like Mega Alakazam and Starmie. Victreebel's main flaw is its lack of coverage, which leaves it walled and destroyed by the omnipresent Melmetal. Outside of its offenses, Victreebel's stats are extremely lacking, meaning most fast Pokemon can KO it easily if they survive a Sucker Punch, and most bulky Pokemon can do the same if they survive Power Whip.</p>",
    "comments": "<h1>Other Options</h1> <p>Leech Life is an option for Victreebel over Poison Jab or Sleep Powder, as combined with Swords Dance, the recovery it provides can allow Victreebel to survive an extra attack from tanks like Alolan Muk. However, the move's typing does not do Victreebel many favors offensively, and dropping STAB move for it is generally not recommended.</p> <h1>Checks and Counters</h1> <p><strong>Melmetal</strong>: Melmetal can take any attack Victreebel throws at it, even at +2. It also threatens an OHKO after Stealth Rock with Double Iron Bash.</p> <p><strong>Gengar</strong>: Gengar commonly carries Will-O-Wisp and resists all of Victreebel's STAB attacks, allowing it to shut down Victreebel without being consistently beaten by Sucker Punch. In addition, Gengar can take advantage of a predicted Sucker Punch or Sleep Powder by setting up Substitute and become difficult to remove without sacrificing a Pokemon.</p> <p><strong>Dragonite</strong>: Dragonite can use its resistance to Power Whip to set up Agility and heal off any damage with Roost, though it must be wary of taking a Sleep Powder or +2 Poison Jab.</p> <p><strong>Mew</strong>: Mew is the only viable Psychic-type in the tier that is not OHKOed by a +2 Sucker Punch. It also frequently carries Taunt, Roost, and Will-O-Wisp to stop Victreebel from punishing it with Sleep Powder or Sucker Punch.</p> <p><strong>Drill Peck Zapdos</strong>: Zapdos resists Power Whip, has excellent bulk, and carries Roost, so it can frequently stop Victreebel from running rampant.</p> <p><strong>Mega Aerodactyl</strong>: If Mega Aerodactyl is carrying Wing Attack, it is capable of OHKOing Victreebel after Stealth Rock. However, Mega Aerodactyl must be cautious, as attempting to outplay Sucker Punch with Roost can lead to a guaranteed OHKO from Power Whip, even if Victreebel has not set up.</p>",
    "sets": {
      "Swords Dance": {
        "description": "<h1>Set Description</h1> <p>Sucker Punch allows Victreebel to overcome its poor Speed stat by outprioritizing the faster Pokemon that attempt to deal with it offensively such as Mega Venusaur, Mega Beedrill, Starmie, and Mega Alakazam. Power Whip threatens Pokemon like Rhydon, Golem, and Sandslash with an OHKO and forces them out. Swords Dance allows Victreebel to attain an immense Attack stat and forces the opponent to play around the possibility of a +2 Sucker Punch and a +2 Power Whip at the same time. While somewhat unreliable, Sleep Powder allows Victreebel to put any non-Grass-type out of commission as it comes in to deal with Victreebel, granting it turns to set up and become extremely offensively threatening. Poison Jab forgoes these turns in favor of a strong, spammable STAB move that can be useful against slower teams and notably helps with KOing weakened Zapdos and Dragonite. While an Adamant nature is preferred for its significant power increase, a Jolly nature can be useful for avoiding a Speed tie with Poliwrath and outspeeding neutral natured Nidoqueen and Eevee-S.</p> <h1>Usage Tips</h1> <p>Victreebel is generally very prediction reliant and only becomes truly threatening versus neutral targets when it has set up with Swords Dance. Due to this, Victreebel should be brought in versus Stealth Rock or Toxic users that are slower than it, like Rhydon and Poliwrath, on the turn they use their status moves. Setting up Victreebel when there are obvious Grass-type answers like Venusaur on your opponent's team is a good idea, as at +2, Victreebel can beat them one-on-one with Sucker Punch if Stealth Rock is up. If your opponent lacks a Grass-type but has an otherwise excellent switch-in for Victreebel, like Charizard or Melmetal, using Sleep Powder can not only shut down a potent threat but also give you several turns to swap around or boost. In situations where the opposing Pokemon is in range of a Sucker Punch and you've already revealed it, using Sleep Powder or Power Whip can be a good way to punish a cheeky switch.</p> <h1>Team Options</h1> <p>Mega Aerodactyl appreciates Victreebel's ability to draw in Melmetal and Venusaur and chip them into range of its moves with Power Whip and Sucker Punch, respectively. Zapdos benefits from Victreebel's ability to pressure Ground-types like Rhydon and Sandslash, and, in return, Victreebel appreciates Zapdos's U-turn for free entry into a favorable matchup against incoming Ground-types. In addition, Zapdos is one of the only Pokemon in the metagame that can switch into all of Melmetal's attacks, which Victreebel lets in for free. Mega Beedrill is a powerful U-turn user that can bring Victreebel into favorable matchups, as it tends to bait in Rhydon. It also appreciates Victreebel's ability to lure in Melmetal and put it to sleep, hindering its ability to counter Mega Beedrill throughout the game.</p> <p>Alolan Dugtrio, Mega Charizard X, and Sandslash particularly appreciate Starmie being removed, which Victreebel is capable of baiting in and OHKOing with a +2 Sucker Punch. Other Water-types, like Mega Gyarados and Vaporeon, can be heavily pressured by Victreebel, but it generally cannot safely come in on either.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "McCoolDude", "user_id": 469684}], "teams": [{"name": "Quality checked by", "members": [{"username": "Eve", "user_id": 375272}, {"username": "Vengeance417", "user_id": 198446}, {"username": "Lily", "user_id": 481709}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}, {"username": "Rabia", "user_id": 336073}]}]}
  },
  "Golem": {
    "overview": "<p>Golem competes with Rhydon as a Stealth Rock setter due to the two of them having identical typing and similar Attack and physical bulk. It distinguishes itself from Rhydon with its access to Explosion, allowing it to devastate most of its switch-ins while maintaining offensive momentum. Furthermore, a slightly higher Speed stat allows it to outspeed Sassy Alolan Muk while running an Impish nature. However, Rhydon's better HP and Attack stats let it perform better as a Stealth Rock setter and physical wall throughout a battle. Golem's selling point in Explosion and otherwise worse offensive presence mean that the user often has to sacrifice their Ground-type to leave a significant mark, leaving them more vulnerable to threats like Zapdos, Mega Beedrill, and Mega Aerodactyl and making Golem the less reliable option for this role overall.</p>",
    "comments": "<h1>Other Options</h1> <p>Thunder Punch and Fire Punch provide coverage against Water- and Grass-types, respectively. However, Golem cannot take full advantage of both moves due to its low Speed, making them fairly unreliable when compared to Explosion. Toxic can be utilized to cripple switch-ins to Golem such as Mew, Poliwrath, and Starmie.</p> <h1>Checks and Counters</h1> <p><strong>Water-types</strong>: Water-types such as Mega Gyarados, Poliwrath, and Starmie outspeed Golem and pressure it immensely with their STAB moves. Starmie is a notable counter, exploiting Golem's poor special bulk with Scald and shrugging off Earthquake damage with Recover. However, all three of them should be wary of directly switching into an Explosion or Toxic.</p> <p><strong>Grass-types</strong>: Grass-types such as Mega Venusaur and Alolan Exeggutor take minimal damage from Golem and can KO it with Mega Drain. The former is also immune to Toxic, making it harder to bypass.</p> <p><strong>Status</strong>: Will-O-Wisp from Gengar and Mew weaken Golem's offensive capabilities, while Toxic from Pokemon such as Zapdos and Nidoking puts it on a timer, limiting its ability to switch in and check these threats.</p> <p><strong>Mew</strong>: Mew outspeeds Golem and can OHKO it with Scald. Furthermore, it can limit Golem's offensive and Stealth Rock setting capabilities with other options such as Will-O-Wisp and Taunt.</p>",
    "sets": {
      "Stealth Rock": {
        "description": "<h1>Set Information</h1> <p>Stealth Rock allows Golem to fulfill its role as an entry hazard setter and support its teammates. Earthquake is a spammable STAB move that threatens Alolan Muk, Rhydon, Melmetal, and Gengar. Rock Slide complements Earthquake by serving as coverage against prominent threats such as Mega Aerodactyl, Mega Beedrill, and Zapdos. Explosion provides immense damage against most targets and generates momentum by allowing you to switch in a check or counter to the foe. An Impish nature increases Golem's overall longevity, while Adamant increases the effectiveness of Explosion and notably allows Golem to reliably OHKO Zapdos and Mega Aerodactyl after Stealth Rock damage with Rock Slide.</p> <h1>Usage Tips</h1> <p>Ideally, Golem should be utilized early-game to set up Stealth Rock as soon as possible. It can switch in on foes such as Zapdos and Mega Beedrill to safely get up Stealth Rock, wearing down future pivots. However, Golem should be wary of switching directly into U-turn. After getting up Stealth Rock, Golem can be preserved as a check to the aforementioned Zapdos and Mega Beedrill. Golem can lure in opposing Water-types such as Poliwrath and Starmie and can utilize Explosion or Toxic to weaken them for the remainder of the battle.</p> <h1>Team Options</h1> <p>Water-types such as Poliwrath and Starmie threaten Golem; checks to them such as Zapdos and Mega Venusaur are appreciated, allowing Golem to safely get up Stealth Rock. Offensive threats such as Mega Beedrill, Mega Charizard Y, Mega Gyarados, and Starmie appreciate Golem's ability to wear down and check Zapdos. Burn spreaders such as Mew, Eevee-S, and Gengar impair opposing threats such as Melmetal and Poliwrath, allowing Golem to potentially avoid a KO. Mew is a notable partner, threatening Mega Venusaur with Psychic and crippling Starmie with Will-O-Wisp while stopping recovery with Taunt. Snorlax can complement Golem by serving as a special wall and status absorber, empowering its own Facade. Melmetal possesses great synergy with Golem, checking Mega Beedrill and Mega Aerodactyl, allowing Golem to utilize Explosion without compromising the team's defensive backbone.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "DC", "user_id": 449990}], "teams": [{"name": "Quality checked by", "members": [{"username": "Vengeance417", "user_id": 198446}, {"username": "Eve", "user_id": 375272}, {"username": "McCoolDude", "user_id": 469684}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}, {"username": "Astra", "user_id": 240732}]}]}
  },
  "Dodrio": {
    "overview": "<p>Dodrio is a niche setup sweeper, carving itself a place in the meta thanks to its solid Speed tier, decent Attack stat, and access to Swords Dance. After it has attained a boost, Dodrio can cleave through weakened teams with ease thanks to its strong Drill Peck and good coverage in Jump Kick. Unfortunately for Dodrio, getting that boost in the first place can be quite the challenge thanks to its poor bulk and lacking defensive utility, and even if it manages to set up a Swords Dance, it can struggle to break through common Pokemon like Zapdos, Melmetal, and Rhydon. It's also outsped by some of the fastest Pokemon in the metagame, like Mega Aerodactyl, Starmie, and Mega Beedrill, all of which can revenge kill it; the latter must be wary of a boosted Quick Attack, though. This typically results in Dodrio struggling to find a place on teams over other setup sweepers like Mega Alakazam and Mew.</p>",
    "comments": "<h1>Other Options</h1> <p>Facade can be used over Drill Peck as a stronger Normal-type STAB move that can also take advantage of status, giving Dodrio the ability to power through some Pokemon it'd otherwise struggle with like Zapdos and Will-O-Wisp Mew. Forgoing Drill Peck leaves Dodrio totally walled by Gengar, though, and means it struggles to break through Mega Venusaur and Poliwrath. Thrash can be used over Quick Attack on teams with heavy paralysis support, with its raw power allowing Dodrio to crush common checks like Zapdos and Mew, but its lock-in effect can be dangerous if the opponent still has a Pokemon like Melmetal or Gengar. Toxic can also be used to lure Pokemon like Zapdos and Mew, but once again, Dodrio struggles to fit the move.</p> <h1>Checks and Counters</h1> <p><strong>Zapdos</strong>: Zapdos is Dodrio's best counter, taking very little damage from any of its attacks and threatening it back with a strong Thunderbolt. It can switch into Dodrio at any point in the game and use it as an opportunity to heal any damage it may have taken with Roost.</p> <p><strong>Melmetal</strong>: Melmetal takes next to nothing from any of Dodrio's STAB attacks and can stomach a boosted Jump Kick thanks to its titanic physical bulk. It can then smack Dodrio in return with a powerful Double Iron Bash.</p> <p><strong>Ground-types</strong>: Ground-types like Sandslash and Nidoqueen can easily switch into Dodrio and threaten it with Toxic or Rock Slide, being able to tank a boosted Drill Peck thanks to their solid bulk. A healthy Rhydon can also check Dodrio, but must be wary of a boosted Jump Kick.</p> <p><strong>Faster Pokemon</strong>: Pokemon like Mega Aerodactyl, Mega Alakazam, and Starmie are all capable of revenge killing Dodrio, with the former also being able to switch into it. They must be wary of a boosted Quick Attack if they have been weakened, though.</p>",
    "sets": {
      "Swords Dance": {
        "description": "<h1>Set Information</h1> <p>Swords Dance boosts Dodrio's Attack to frightening levels, enabling its sweep. Drill Peck is a strong STAB attack that allows Dodrio to break through many physically bulky Pokemon, like Mega Venusaur, Poliwrath, and Mega Charizard X. Quick Attack is a useful tool that prevents Dodrio from being revenge killed by the likes of Mega Beedrill and Mega Alakazam. Jump Kick provides great coverage with Dodrio's STAB attacks, hitting Pokemon like Melmetal, Rhydon, and Alolan Sandslash for massive damage.</p> <h1>Usage Tips</h1> <p>Dodrio is a straightforward Pokemon. Finding setup opportunities for Dodrio can be difficult, but it can be done on Pokemon that cannot OHKO it like Alolan Exeggutor, Poliwrath, and Snorlax; it should be wary of Toxic, though. Dodrio also forces switches against the likes of Mega Venusaur and Victreebel, giving it chances to boost up with Swords Dance. Try to weaken Dodrio's most common checks in Melmetal, Mew, and Zapdos before setting it up, as Dodrio cannot break these Pokemon alone and will usually faint when trying to. If needed, Dodrio can be used early-game to weaken these Pokemon for teammates like Dragonite, giving them opportunities to sweep later on.</p> <h1>Team Options</h1> <p>Ground-types that can help with Melmetal and Zapdos like Sandslash and Nidoqueen are excellent partners for Dodrio, as it cannot break these threats without support. These Pokemon can also land a Toxic on Mew, making it much more difficult for Mew to reliably check Dodrio. Nidoqueen in particular is a very helpful partner, weakening opposing Pokemon with Super Fang and putting them in range of Dodrio's attacks. Dragonite can be used alongside Dodrio, as they share many checks like Rhydon and Sandslash and can often break through them when paired together. Dodrio can be used on teams that feature dual screens support from Electrode. The added bulk allows Dodrio to set up on many more Pokemon, like Mega Gyarados, Mega Charizard Y, and Mega Beedrill. Electrode can also prevent Stealth Rock from going up with Taunt, with its blistering Speed ensuring it outspeeds all Stealth Rock setters other than Mega Aerodactyl, which it Speed ties with. Mew is a great teammate that can switch into and deal with Pokemon that frustrate Dodrio, like Zapdos, and ensure they remain weakened with Taunt preventing their recovery moves. It can also check Melmetal, burning it with Will-O-Wisp or Scald or just weakening it with Flamethrower. Thunder Wave support is extremely useful for Dodrio, preventing revenge killing from the likes of Starmie and Mega Alakazam. Common users like Melmetal, Starmie, and Mega Gyarados all pair well with Dodrio for this reason.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Lily", "user_id": 481709}], "teams": [{"name": "Quality checked by", "members": [{"username": "Vengeance417", "user_id": 198446}, {"username": "Eve", "user_id": 375272}, {"username": "McCoolDude", "user_id": 469684}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}, {"username": "Astra", "user_id": 240732}]}]}
  },
  "Muk-Alola": {
    "sets": {
      "Special Tank": {},
      "Specially Defensive": {
        "outdated": true,
        "description": "<h1>Set Information</h1> <p>Crunch is Alolan Muk's Dark-type STAB move, which allows it to threaten one of the most dangerous Mega Evolutions in the tier in Mega Alakazam, as well as other Psychic-types like Starmie and Mew. Fire Blast is used to damage Melmetal effectively. Mega Drain take advantage of some of Alolan Muk's checks, namely Poliwrath and Rhydon, while also granting it recovery. Alolan Muk uses Toxic to set a timer on bulky foes such as Mew and Zapdos, which is especially useful because its accuracy is boosted through its Poison typing. Rest can be opted for over Toxic as a means of restoring its health, but this leaves Alolan Muk vulnerable to setup sweepers such as Calm Mind Mega Alakazam and Nasty Plot Mew; moreover, this move usually would require support from Eevee-S's Sparkly Swirl because of the time it takes for Alolan Muk to wake up. Facade can also be used in the last moveslot to deal extra damage when afflicted with a status condition and is especially beneficial against Will-O-Wisp Mew, despite it being worn down by a potential Toxic as well. A Sassy nature bolsters Alolan Muk's defensive capabilities without sacrificing any power while still letting it be faster than foes such as Rhydon and Melmetal.</p> <h1>Usage Tips</h1> <p>Alolan Muk should be kept as healthy as possible in order to threaten powerful special attackers such as Mega Alakazam, Gengar, and Starmie. If Alolan Muk is using Rest, it should avoid being taken advantage of by setup sweepers such as Calm Mind Mega Alakazam and Nasty Plot Mew. Alolan Muk should avoid powerful physical attackers such as Mega Beedrill and Dragonite because of its very poor physical bulk. It should also be cautious of Eevee-S, as its ability to burn it through Sizzly Slide and sap away at its health through Sappy Seed make it a nuisance to remove.</p> <h1>Team Options</h1> <p>Alolan Muk greatly appreciates Eevee-S's support, as it has the capability to heal its status conditions through Sparkly Swirl, burn some of its physical checks such as Dragonite and Mega Gyarados through Sizzly Slide, and even provide it with residual recovery by virtue of Sappy Seed. This especially holds true for Rest variants of Alolan Muk. Physically defensive foes such as Melmetal, Poliwrath, and Mega Venusaur can sponge powerful physical attacks for Alolan Muk and can share the burden of sponging other special attacks from foes such as Mega Alakazam and Gengar if need be. Alolan Muk appreciates Flying-types such as Dragonite and Zapdos, as they cover its weakness to Ground-type moves. Psychic-types such as Mew and Mega Alakazam can also be paired with Alolan Muk, as they can heavily threaten common Fighting-types such as Poliwrath. In return, Alolan Muk can threaten opposing Psychic-types for Mew and Mega Alakazam.</p>"
      }
    }
  },
  "Cloyster": {
    "overview": "<p>Cloyster's viability is solely carried by Shell Smash, which lets it outspeed the entire unboosted metagame and double its offensive stats in a single turn. To complement this, it has strong STAB options that cover each other well and a Defense stat that lets it set up in front of many physical attackers, notably tanking any hit from Melmetal after Stealth Rock, as well as from Dragonite and Mega Aerodactyl. It also has Self-Destruct, which lets it sacrifice itself to OHKO or heavily damage Pokemon that could otherwise take it on like Alolan Muk and Mega Gyarados. Unfortunately, Cloyster's poor offensive movepool utilizes its lower Special Attack stat and leaves it unable to meaningfully damage Water-type Pokemon without using Self-Destruct, which can make handling it quite easy. Its abysmal special bulk limits its setup opportunities, and it faces competition from Omastar, which is vulnerable to revenge killing from the metagame's fastest Pokemon due to its poor Speed but is much more powerful and can even support its team with Stealth Rock.</p>",
    "comments": "<h1>Other Options</h1> <p>Cloyster's limited movepool does not offer it many options. Running Hydro Pump and Surf on the same set can offer both power and reliability, but dropping Self-Destruct is not recommended. Ice Shard is also an option, capable of picking off weakened Pokemon that outspeed Cloyster like Mega Beedrill, boosted Dragonite, and Mega Aerodactyl, but its low Base Power makes it a poor option for sweeping compared to Cloyster's standard attacking moves.</p> <h1>Checks and Counters</h1> <p><strong>Water-types</strong>: Starmie, Poliwrath, Mega Gyarados, and the rare Mega Blastoise can deal with Cloyster well. Ice Beam and Hydro Pump will do very little to them, but boosted Self-Destruct will OHKO Starmie and do massive damage to the others, which cannot recover that lost health.</p> <p><strong>Specially Bulky Pokemon</strong>: Alolan Muk, Mew, Melmetal, Chansey and Snorlax can stomach a Hydro Pump, though Mew and Melmetal must be healthy and don't appreciate losing that much health. Alolan Muk, Chansey, and Snorlax are bulky enough to take more than one boosted Hydro Pump but must be careful of Self-Destruct.</p> <p><strong>Priority</strong>: When priority move users like Alolan Dugtrio's Sucker Punch are present, Cloyster should avoid being put into their KO range, as they will end Cloyster's sweep swiftly without it getting the chance to do damage. Also beware of the rare Pikachu-S, as it can take Cloyster out with some prior damage using its STAB priority.</p>",
    "sets": {
      "Shell Smash": {
        "description": "<h1>Set Information</h1> <p>Shell Smash lets Cloyster outspeed fast Pokemon such as Mega Aerodactyl and Mega Alakazam and boost its damage output to KO Pokemon like Nidoqueen and Zapdos. Hydro Pump somewhat mitigates Cloyster's low Special Attack, while Surf is a somewhat weaker option that lets Cloyster accurately finish off Pokemon that resist Ice Beam where Hydro Pump is not necessary; it also deals reliable damage to Pokemon when needed and allows Cloyster to be a more consistent wincon. Ice Beam offers a 100% accurate STAB attack that prevents Grass-types and Dragonite from walling Cloyster. Self-Destruct takes advantage of the Attack boost from Shell Smash to blow past special walls like Alolan Muk, Snorlax, and Chansey as well as Water-types like Mega Gyarados, Starmie, and Poliwrath.</p> <h1>Usage Tips</h1> <p>Do not use Cloyster early on, as your opponent will be able to use their best or most convenient check and finish Cloyster off with minimal harm to their team. Cloyster performs much better later on, when its answers are limited and it can potentially use Self-Destruct on your opponent's counterplay and open the door for another Pokemon to win. When using Self-Destruct, be mindful of how much your opponent would be rewarded for predicting Self-Destruct and saving their check, as it might be worthwhile to predict this and simply use another attack. A key to using Cloyster is deciding whether it will be more effective to have Cloyster weaken walls such as Alolan Muk and Melmetal to support its fast, offensive teammates or to wallbreak with said teammates to enable a sweep with Cloyster. This is largely dependent on your matchup— if your opponent has multiple healthy checks to Cloyster, attempting to sweep with it is unadvised.</p> <h1>Team Options</h1> <p>Cloyster is a spectacular partner for Mega Alakazam, as all of Alakazam's defensive checks are commonly used to check a boosted Cloyster. Cloyster can put these Pokemon into KO range of Mega Alakazam's coverage with Hydro Pump, or outright remove them with Self-Destruct in the case of Snorlax and Alolan Muk. Cloyster can also capitalize on any wallbreaking that Mega Alakazam does to sweep later on. Starmie works well with Cloyster in a similar way, but it comes with more similar coverage and utility without taking a Mega slot. Pokemon that deal with the Water-types that stump Cloyster can be useful, and Zapdos matches up well against Mega Gyarados and Poliwrath. Nasty Plot Mew is also a great special attacker that can take advantage of Cloyster's ability to force damage on many of its best answers while also setting up freely on Poliwrath. Any Pokemon that appreciate the chunks of health Cloyster often rips out of Melmetal are options, most notably Mega Beedrill, Mega Aerodactyl, and Mega Gyarados. Mega Gyarados also pressures Water-types like Poliwrath.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Collette", "user_id": 520031}], "teams": [{"name": "Quality checked by", "members": [{"username": "Eve", "user_id": 375272}, {"username": "Lily", "user_id": 481709}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}, {"username": "CryoGyro", "user_id": 331519}]}]}
  },
  "Gengar": {
    "sets": {
      "Wallbreaker": {},
      "Special Attacker": {
        "outdated": true,
        "description": "<h1>Set Information</h1> <p>Shadow Ball is Gengar's main STAB move, being resisted by very few Pokemon and capable of 2HKOing common Pokemon such as Mew and Rhydon. Sludge Bomb is Gengar's strongest STAB move, capable of 2HKOing Zapdos after Stealth Rock and dealing respectable damage to many Pokemon that are immune to Shadow Ball such as Snorlax, Eevee-S, and Mega Kangaskhan. Thunderbolt rounds off Gengar's coverage, allowing it to hit Alolan Muk harder and deal super effective damage to common Water-types such as Poliwrath and Mega Gyarados. Will-O-Wisp can be used to cripple solid checks to Gengar such as Alolan Muk and Mega Gyarados. Substitute eases prediction and can be used against sacrificial switch-ins to hinder future revenge killing attempts. Substitute also allows Gengar to deal with Mega Venusaur much more easily. Mega Drain can be considered as a coverage option, landing a surprise OHKO on Rhydon and Golem while also 2HKOing Sandslash and providing Gengar with some form of recovery to increase its longevity. A Timid nature is crucial for Gengar to outspeed Mew, Charizard, and Zapdos and function most effectively in its wallbreaker role.</p> <h1>Usage Tips</h1> <p>Gengar is rather frail and can be somewhat difficult to bring in safely; the best ways to get Gengar in are through predicted double switches, teammates fainting, passive foes, attacks that Gengar resists or is immune to, and momentum gained from U-turn and Teleport. Gengar is usually best utilized early- or mid-game to wallbreak and open up the door for your wincons. Gengar is best used to fire off attacks to maximize its wallbreaking capabilities, denting the opposing team and taking advantage of its limited switch-in options. Use Will-O-Wisp if you anticipate the opponent switching into one of Gengar's main checks, such as Alolan Muk, to cripple it. It is advised for Gengar to switch out of stronger physical attackers instead of trying to burn them head-on; examples include Nidoqueen and Snorlax, which can still easily 2HKO Gengar with Earthquake even after a burn.</p> <h1>Team Options</h1> <p>Due to Gengar's role as a wallbreaker, it usually finds itself on offensively oriented teams with dedicated wincons; Agility Dragonite is a great example, as it appreciates Gengar's ability to threaten and weaken common checks to it such as support Mew and Melmetal. Mega Gyarados can also function as a late-game cleaner and provide a crucial check to Mega Alakazam.</p> <p>Zapdos provides great utility for Gengar, being able to set Reflect to help mitigate its frailty and pivot it in safely with U-turn. Zapdos is also a check to Mega Gyarados and Melmetal. Poliwrath stands out as a partner with good defensive synergy, being one of the best Mega Gyarados checks available while also checking Ground-types, Melmetal, and Snorlax for Gengar; in return, Gengar is able to offensively deal with Mew and switch into Pokemon such as Mega Venusaur that Poliwrath naturally struggles against.</p> <p>Mew sets Stealth Rock early-game and provides safe switches in via U-turn to increase Gengar's effectiveness as a wallbreaker; Scald Mew supports Gengar particularly well because it can threaten Ground-types, notably OHKOing Rhydon and Golem. Melmetal is able to provide Thunder Wave support, making it easier for Gengar to pick off frail Pokemon that would usually be faster than it, and checks Mega Beedrill and Mega Aerodactyl. In return, Gengar is able to offensively deal with Mew and Zapdos. Alolan Muk provides a much-needed check to Mega Alakazam and deals with Rhydon and Golem due to Mega Drain; however, it and Gengar are both vulnerable to Ground-types, so additional support against them is strongly appreciated.</p>"
      }
    }
  },
  "Electrode": {
    "overview": "<p>Electrode stands out in LGPE OU as one of the fastest Pokemon in the metagame, only tying with Mega Aerodactyl and Mega Alakazam. It is also, without question, the swiftest support Pokemon around. Electrode's capabilities of setting up dual screens, using Taunt to stop Stealth Rock from going up, and crippling threats with Thunder Wave before the majority of the metagame can even move make it a valuable asset for offensive teams. However, outside of its great Speed, the rest of its stats are lackluster by LGPE OU standards. Electrode relies on Reflect and Light Screen to withstand multiple attacks throughout the match, as it's helplessly frail without them. As an Electric-type, it's offensively outclassed by Zapdos, which sports much greater attacking stats, Drill Peck to deal with Grass-types, and U-turn for keeping momentum.</p>",
    "comments": "<h1>Other Options</h1> <p>Explosion, when running a Jolly nature, can be used instead of Foul Play or Thunderbolt to gain offensive momentum by allowing a teammate to come in safely after Electrode has served its purpose, and it can heavily chip Pokemon Electrode normally wouldn’t be able to hit very hard, such as Chansey, Nidoqueen, Mega Venusaur, and Sandslash. Toxic can put Pokemon such as Mew, Rhydon, Zapdos, and Chansey on a timer, but it's hard to justify using it on Electrode's moveset over its more consistent options.</p> <h1>Checks and Counters</h1> <p><strong>Ground-types</strong>: Ground-types such as Rhydon, Nidoqueen, and Alolan Dugtrio are immune to Thunderbolt, should Electrode run it, and can OHKO in return with STAB Earthquake or 2HKO it with Reflect up. This forces Electrode to choose whether to use Taunt to prevent the usage of Stealth Rock or Reflect to survive the incoming attack. Alolan Dugtrio is 2HKOed by Foul Play, however.</p> <p><strong>Grass-types</strong>: Grass-types such as Mega Venusaur, Victreebel, Exeggutor, and Alolan Exeggutor easily take most of what Electrode can throw at them. However, Exeggutor is 2HKOed by Foul Play after Stealth Rock, and none of these Pokemon appreciate being paralyzed by Thunder Wave. Victreebel must also watch out for a potential Foul Play after a Swords Dance boost, which will use Victreebel's boosted Attack against it and dish out major damage.</p> <p><strong>Special Walls</strong>: Special walls, including Chansey, Snorlax, and Alolan Muk, hardly take any damage from Electrode's attacks and can stall out Reflect and Light Screen turns in front of it. Snorlax in particular can hit Electrode very hard with Earthquake, and Chansey beats Electrode with Seismic Toss. Electrode that opt for Foul Play over Thunderbolt will also have a difficult time getting past Alolan Muk, which can retaliate with Crunch. Chansey must watch out for the rare Explosion, however, as Electrode can use Taunt to stop it from using Soft-Boiled and then Explosion to put it at a dangerously low amount of health.</p>",
    "sets": {
      "Fast Support": {
        "description": "<h1>Set Description</h1> <p>Reflect and Light Screen are used to support Electrode's teammates and increase Electrode's longevity, ensuring it can at least act for one more turn before fainting. Thunder Wave can cripple fast offensive Pokemon such as Mega Alakazam, Mega Aerodactyl, Mega Beedrill, and Starmie. Foul Play allows Electrode to damage Ground-type Pokemon, most notably being able to 2HKO Alolan Dugtrio. Alternatively, STAB Thunderbolt hits Mega Aerodactyl, Mega Gyarados, Starmie, and Mega Charizard Y super effectively while also damaging Melmetal more than Foul Play, but it leaves Electrode completely walled by Ground-types.</p> <h1>Usage Tips</h1> <p>Electrode can be used as a lead to set up dual screens, use Taunt to prevent Stealth Rock and other status moves from being used, and cripple fast Pokemon with Thunder Wave if running it. It's an effective lead against opposing leads such as Aerodactyl, Mew, and Clefable, since it is faster than all of them unless Aerodactyl Mega Evolves, and Taunt can stop whatever status moves they plan to use. Prioritize setting up whichever of Reflect or Light Screen is appropriate for the foe in front of Electrode. Leading against Ground-types such as Rhydon, Nidoqueen, and Alolan Dugtrio can put Electrode in a tricky situation, so it's wise to lead with a different Pokemon that can handle them more easily. Saving Electrode for a later point in the match can be beneficial to get off a critical move before going down, such as a last-ditch Thunder Wave against Mega Beedrill to have a teammate revenge kill it the next turn or one of Reflect or Light Screen to help setup sweepers (spacing) withstand heavier hits.</p> <h1>Team Options</h1> <p>Setup sweepers such as Mega Pinsir and Alolan Sandslash utilize the added defensive bulk from Electrode’s dual screens to safely set up with Swords Dance and also take advantage of Thunder Wave slowing down the opposing team to ensure a potential sweep. Nasty Plot and Bulk Up variants of Mew also appreciate dual screens support, becoming virtually unstoppable thanks to its already impressive bulk being augmented by this support. Frailer Pokemon such as Mega Beedrill, Mega Aerodactyl, Starmie, and Gengar highly appreciate Electrode's lightning-fast dual screens support letting them take hits that they normally wouldn't take very well. Even bulkier Pokemon such as Melmetal, Mew, Zapdos, and Nidoqueen appreciate dual screens, which let them become near-impenetrable defensive threats. Stealth Rock-weak Pokemon such as non-Mega Gyarados, Mega Charizard X and Y, and Dragonite appreciate Electrode's efforts to prevent Stealth Rock from going up with Taunt. If Thunder Wave is being used, slower wallbreakers such as Mega Gyarados and Melmetal greatly benefit from the speed control. Ground-types are the bane of Electrode's existence and are capable of setting Stealth Rock in front of Electrode if it prioritizes Reflect over Taunt or as it switches out. Taunt Mew makes for an excellent stopgap to Ground-type Stealth Rock setters, especially if it also runs Scald.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Vengeance417", "user_id": 198446}], "teams": [{"name": "Quality checked by", "members": [{"username": "Eve", "user_id": 375272}, {"username": "McCoolDude", "user_id": 469684}, {"username": "Lily", "user_id": 481709}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}, {"username": "Astra", "user_id": 240732}]}]}
  },
  "Exeggutor": {
    "overview": "<p>Exeggutor finds a slight niche in LGPE OU as a powerful special attacker that threatens common foes such as Poliwrath and Rhydon. Furthermore, it can utilize Sleep Powder and Leech Seed to cripple its switch-ins such as Melmetal, Mew, and Alolan Muk. However, Exeggutor suffers from multiple flaws, ranging from its horrible typing and lackluster Speed to the inaccuracy of its utility options. Exeggutor's severe weakness to the omnipresent U-turn essentially causes it to forfeit momentum against common threats such as Mega Beedrill, Zapdos, and Mew. Additionally, it faces competition from other Grass- and Psychic-types such as Alolan Exeggutor, Mega Venusaur, Mew, Mega Alakazam, and Starmie that offer better typing, bulk, and Speed or power.</p>",
    "comments": "<h1>Other Options</h1> <p>Stun Spore allows Exeggutor to provide speed control, slowing down foes such as Dragonite, Mega Charizard X, and Mega Charizard Y that are capable of switching into its STAB moves. Toxic is a notable alternative over Leech Seed to weaken Snorlax and Chansey, but it leaves Exeggutor more susceptible to Melmetal and Alolan Muk. Teleport can be used to lure foes like Melmetal and bring in their checks like Mega Charizard X and Nidoqueen to give them free opportunities to wallbreak, but it leaves Exeggutor susceptible to being worn down. Protect synergizes with Leech Seed and can be used to accrue more residual damage on the foe, while Substitute provides Exeggutor with more opportunities to use Sleep Powder.</p> <h1>Checks and Counters</h1> <p><strong>U-turn Users</strong>: Although they should be wary of switching directly into Sleep Powder, U-turn users such as Mega Beedrill and Zapdos can OHKO or heavily dent Exeggutor, making it difficult for it to employ its attacking or utility moves. Zapdos is also capable of tanking a Mega Drain or Psychic and can retaliate with Drill Peck.</p> <p><strong>Poison-types</strong>: Poison-types such as Alolan Muk, Gengar, and Mega Venusaur pressure Exeggutor. Alolan Muk is capable of directly switching into Exeggutor due to its Psychic immunity and pressuring it with Crunch. Although Gengar and Mega Venusaur fear Psychic, they both outspeed Exeggutor, resist Mega Drain, and can pressure Exeggutor with their STAB moves, with Mega Venusaur also ignoring Sleep Powder and Leech Seed.</p> <p><strong>Melmetal</strong>: Melmetal resists both of Exeggutor's STAB moves and can retaliate with a powerful Double Iron Bash. However, it does not appreciate Sleep Powder or Leech Seed.</p> <p><strong>Mew</strong>: Mew is capable of beating Exeggutor in a one-on-one scenario, utilizing the combination of Taunt, Roost, and Will-O-Wisp to prevent the usage of Sleep Powder and Leech Seed and wear it down with residual damage.</p> <p><strong>Specially Defensive Walls</strong>: Specially defensive walls such as Snorlax and Chansey take minimal damage from Exeggutor. In return, Chansey is capable of crippling Exeggutor with Toxic, while Snorlax can fire off a strong Facade.</p>",
    "sets": {
      "Utility": {
        "description": "<h1>Set Information</h1> <p>Mega Drain threatens Water- and Ground-types such as Starmie, Poliwrath, and Rhydon. Psychic complements Mega Drain by hitting Poison-types such as Nidoqueen, Mega Venusaur, and Gengar. Sleep Powder is a powerful yet inaccurate tool to cripple switch-ins from foes that take minimal damage from Exeggutor's STAB moves such as Melmetal, Mew, and Alolan Muk. Leech Seed provides residual healing while weakening the aforementioned foes plus Chansey and Snorlax. A Modest nature is preferred, allowing Exeggutor to always OHKO Starmie with Mega Drain after Stealth Rock and conferring better damage rolls against Poliwrath with Psychic, potentially KOing it after Stealth Rock.</p> <h1>Usage Tips</h1> <p>Exeggutor should be safely brought into battle as soon as possible to put a foe to sleep, giving you several free turns to establish momentum by attacking, switching, or using Leech Seed. Furthermore, Exeggutor can switch into and pressure Stealth Rock setters such as Rhydon and Sandslash, preventing them from putting up entry hazards. Try to avoid taking unnecessary damage, as preserving HP on Exeggutor potentially grants it multiple opportunities to utilize Sleep Powder and Leech Seed. Be wary of potential coverage options from Pokemon that Exeggutor checks such as Toxic from Poliwrath and Ice Beam from Starmie, which can limit its effectiveness.</p> <h1>Team Options</h1> <p>Ground-types such as Nidoqueen, Rhydon, and Sandslash can take advantage of Exeggutor luring in Melmetal and Alolan Muk and putting them to sleep to set Stealth Rock or fire off a strong Earthquake while also serving as crucial checks to foes such as Mega Beedrill, Mega Aerodactyl, and Zapdos. In return, Exeggutor threatens Water-types such as Starmie and Poliwrath that proves troublesome for the Ground-types. Fire-types such as Mega Charizard X, Mega Charizard Y, and Moltres appreciate Exeggutor deterring the aforementioned Ground-types from setting Stealth Rock and providing them more opportunities to attack, threatening Exeggutor checks such as Melmetal and Mega Pinsir in return. Poliwrath is a notable partner, taking on checks to Exeggutor such as Chansey, Melmetal, and Snorlax; in turn, Exeggutor provides measures against checks such as Starmie, Mega Slowbro, and Mega Alakazam.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "DC", "user_id": 449990}], "teams": [{"name": "Quality checked by", "members": [{"username": "Vengeance417", "user_id": 198446}, {"username": "Lily", "user_id": 481709}, {"username": "Eve", "user_id": 375272}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}, {"username": "Astra", "user_id": 240732}]}]}
  },
  "Exeggutor-Alola": {
    "sets": {
      "Phazer": {},
      "Offensive Pivot": {
        "outdated": true,
        "description": "<h1>Set Information</h1> <p>Mega Drain is Alolan Exeggutor's main way of keeping itself healthy throughout a match. Flamethrower is used to 2HKO Melmetal. Dragon Pulse rounds out Flamethrower's coverage, since together, these two moves cover almost everything in LGPE OU. Teleport can allow Alolan Exeggutor to bring in a teammate safely, while Hypnosis can be used to stop certain threats like Alolan Muk to allow another teammate to safely set up and sweep. Stun Spore could alternatively be used to paralyze Alolan Muk so that another teammate like Rhydon can outspeed it. A Modest nature allows Alolan Exeggutor to hit as hard as possible.</p> <h1>Usage Tips</h1> <p>Alolan Exeggutor can support its team all throughout the match thanks to its ability to keep itself healthy with Mega Drain. Alolan Exeggutor should come in battle after a teammate has fallen, with the help of another pivot, or against Pokemon it can reliably stop such as Rhydon, Poliwrath without Ice Punch, and Gyarados. From there, Alolan Exeggutor should use its high offenses and wide movepool to begin wallbreaking for its team. Alolan Exeggutor can also lure Melmetal into battle if it spams its STAB moves throughout the match and attempt to catch it off guard with Flamethrower. If a Pokemon such as Alolan Muk, Snorlax, or Dragonite should attempt to switch into Alolan Exeggutor, it can attempt to catch these switch-ins off guard by using either Teleport to escape the bad matchup or Hypnosis to put them to sleep so that another teammate can come in and threaten these Pokemon. Try to avoid Toxic if possible, as Alolan Exeggutor's time wallbreaking is cut short by Toxic poison, by bringing in a Pokemon that can deal with status such as Alolan Dugtrio, Alolan Muk, or Snorlax.</p> <h1>Team Options</h1> <p>Alolan Exeggutor fits on teams that need a decent pivot or a wallbreaker. Pokemon like Snorlax, Clefable, and Dragonite appreciate Alolan Exeggutor checking Melmetal so that they can spam their STAB moves much more often. Pokemon like Alolan Dugtrio, Mega Aerodactyl, and Rhydon can threaten out special walls such as Alolan Muk and Snorlax for Alolan Exeggutor. All of these Pokemon can also supply Stealth Rock so that Alolan Exeggutor has an easier time breaking walls. Alolan Dugtrio can also directly switch into Toxic from Pokemon like Zapdos and Snorlax. Offensive teammates such as Gengar, Melmetal, and Mew appreciate Alolan Exeggutor safely bring them into battle with Teleport. Other pivots such as Zapdos and Mega Beedrill make good teammates, since they can form a pivoting core with Alolan Exeggutor. In return, Alolan Exeggutor can help deal with Melmetal and Rhydon, which both of these Pokemon can have issues breaking. Eevee-S can make a decent partner for Alolan Exeggutor, since it can keep it healthy by using Sparkly Swirl to eliminate status conditions that Alolan Exeggutor might have sustained such as Toxic poison. Other Pokemon that can switch into Toxic for Alolan Exeggutor such as Snorlax, Alolan Muk, and Melmetal are also recommended teammates.</p>"
      }
    }
  },
  "Hitmonlee": {
    "overview": "<p>Hitmonlee's good Attack stat, good enough Speed to outpace most defensive Pokemon, and exclusive access to the extremely powerful High Jump Kick let it perform admirably as a wallbreaker, being strong enough to OHKO even Rhydon. Hitmonlee's coverage in Rock Slide and Earthquake lets it threaten would-be answers like Zapdos and Nidoqueen, while Toxic allows it to lure in and cripple Mew, which would otherwise wall it. Unfortunately, Hitmonlee's physical bulk is extremely poor, leaving it entirely unable to switch in on many of the physical attackers it aims to pressure, such as Melmetal, Rhydon, and Mega Gyarados, as well as weaker Pokemon like Nidoqueen and Poliwrath. Due to its middling Speed, Hitmonlee also is vulnerable to a plethora of popular revenge killers, including Mega Beedrill, Alolan Dugtrio, and Starmie. It is also vitally outrun and threatened by prominent Pokemon in the base 100 Speed tier, namely Mew, Zapdos, and Mega Charizard X, and Mega Charizard Y, regardless of its nature, and it struggles to significantly threaten Mega Venusaur at all.</p>",
    "comments": "<h1>Other Options</h1> <p>Poison Jab provides coverage for Clefable, but it comes at the expense of coverage for more relevant Pokemon. Facade can be used to exploit status, but its power is lacking, as it is unable to 2HKO Mew even when Hitmonlee is statused. Substitute can potentially protect Hitmonlee from revenge killing attempts after it claims a KO, but it can be difficult to set up and maintain.</p> <h1>Checks and Counters</h1> <p><strong>Mew and Starmie</strong>: Mew and Starmie can switch in and heal off any damage Hitmonlee does to them while also threatening it with status or Psychic. However, both must be wary of Toxic, which will limit their effectiveness.</p> <p><strong>Zapdos</strong>: Zapdos isn't hurt too badly by High Jump Kick and can threaten Hitmonlee in return with Thunderbolt or Drill Peck, but it dislikes being afflicted with Toxic, can be threatened by Bulk Up variants as it switches in, and has to be careful when using Roost due to High Jump Kick and Earthquake dealing massive damage.</p> <p><strong>Mega Venusaur</strong>: Mega Venusaur can comfortably tank any attack from Hitmonlee and fire its own back. This exchange will, however, leave it significantly weakened.</p> <p><strong>Revenge Killers</strong>: Mega Beedrill, Mega Aerodactyl, Alolan Dugtrio, and Mega Alakazam are examples of Pokemon that can comfortably revenge kill Hitmonlee.</p> <p><strong>Gengar</strong>: While Gengar is OHKOed by Earthquake, its presence alone can dissuade Hitmonlee from freely spamming High Jump Kick.</p>",
    "sets": {
      "Wallbreaker": {
        "description": "<h1>Set Description</h1> <p>Hitmonlee's High Jump Kick is a spammable STAB move thanks to the rarity of Protect and Ghost-types. Rock Slide's coverage complements High Jump Kick, allowing Hitmonlee to threaten Flying-types such as Zapdos. Earthquake provides coverage for Poison-types like Nidoqueen and Gengar, is Hitmonlee's strongest attack versus Mega Venusaur, and acts as a more reliable option for picking off weakened targets due to its perfect accuracy. Toxic lets Hitmonlee lure in and cripple Mew, saving it from being complete fodder. Alternatively, Bulk Up allows Hitmonlee to more easily break targets like Starmie lacking Psychic and Zapdos lacking Drill Peck, as well as augmenting its lacking Defense to potentially survive revenge killing attempts from the likes of Alolan Dugtrio, Mega Aerodactyl lacking Wing Attack, and Mega Beedrill, but dropping Toxic means Hitmonlee will require support to deal with Mew. An Adamant nature is preferred due to the rarity of relevant Pokemon, most notably Jolly Mega Gyarados, that a Jolly nature would let Hitmonlee outrun.</p> <h1>Usage Tips</h1> <p>Hitmonlee should be brought in as often as possible throughout a game in order to maximize the amount of damage it can deal to the opposing team. This can be done with good predictions or support in the form of U-turn or Teleport. If it is safe to do so, going for Toxic early in a battle in order to status troublesome Pokemon like Mew and Zapdos as they switch in can give you a great advantage. Spamming High Jump Kick is a viable option, as it greatly wears down any switch-ins alongside Stealth Rock. As a result, coverage can be reserved for when it is absolutely necessary or for hard predictions.</p> <h1>Team Options</h1> <p>As a wallbreaker, Hitmonlee greatly appreciates Stealth Rock support in order to help wear down would-be answers. Nidoqueen, Rhydon, and Alolan Dugtrio can all provide this support while also acting as great responses to Zapdos. Melmetal and the aforementioned Rhydon are very useful teammates, being able to switch in on physical attacks aimed at Hitmonlee from the likes of Mega Aerodactyl and Mega Beedrill. Both also act as very effective wallbreakers, forming a powerful offensive core with Hitmonlee that can help soften the opposing team. Late-game sweepers like Dragonite, Mega Alakazam, and Alolan Sandslash greatly benefit from Hitmonlee's ability to wear down the opponent's defensive core in advance. Alolan Muk exploits Mew, Hitmonlee's most common answer, as well as helping to take on other Psychic-types like Mega Alakazam and Starmie. Mega Gyarados can also fill a similar role, trading a better typing for greater firepower and its own Water resistance. Pivots utilizing U-turn make for great teammates, allowing Hitmonlee to switch in safely on Pokemon it can threaten. Mew, Zapdos, and Mega Beedrill are the best examples, with all three often drawing in Pokemon vulnerable to High Jump Kick, such as Mega Gyarados, Rhydon, and Melmetal.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Eve", "user_id": 375272}], "teams": [{"name": "Quality checked by", "members": [{"username": "Vengeance417", "user_id": 198446}, {"username": "Lily", "user_id": 481709}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}, {"username": "Astra", "user_id": 240732}]}]}
  },
  "Rhydon": {
    "sets": {
      "Substitute": {},
      "Bulky Stealth Rock": {
        "outdated": true,
        "description": "<h1>Set Information</h1> <p>Stealth Rock is Rhydon's main niche in the metagame, allowing it to permanently cripple Pokemon weak to Rock-type attacks including Mega Beedrill and Mega Charizard X. Rock Slide and Earthquake hit everything in the tier for neutral or super effective damage and hit hard coming off Rhydon's high Attack stat. Toxic is able to cripple bulky switch-ins that may otherwise be able to switch into anything else on the set, such as Poliwrath and Mew. An Impish nature maximizes Rhydon's defensive potential, allowing it to take hits easier from the likes of Dragonite and Mega Beedrill. On the other hand, Jolly allows Rhydon to outspeed Alolan Muk, which has a chance to OHKO Rhydon with Mega Drain.</p> <h1>Usage Tips</h1> <p>Rhydon should attempt to get Stealth Rock on the field as soon as possible. Ideally, Rhydon should remain healthy in your party as a backup defensive check to foes like Zapdos. Its ability to come into Zapdos safely gives it time to set up Stealth Rock after forcing a switch. After Stealth Rock has been set up, Rhydon's enormous base 130 Attack stat and Rock typing allow it to switch directly into foes it beats and deal powerful neutral damage to switch-ins using its STAB Rock Slide and Earthquake. Toxic can be used on predicted switches to threats like Poliwrath that could otherwise force Rhydon out, effectively crippling them and allowing another team member to take care of it.</p> <h1>Team Options</h1> <p>Pokemon that can threaten out Water-types such as Mega Venusaur and Zapdos help beat Rhydon's counters so that it can come in freely to set up Stealth Rock to help the team. In addition, the reverse is true for Water-type teammates, which appreciate Rhydon's ability to take down Zapdos so that they can switch in freely. Paralysis and burn spreaders like Melmetal and Mew help Rhydon either outspeed and dismantle a faster threat or survive certain hits from threats such as opposing Melmetal and Mega Gyarados. Mew in particular can check threats to Rhydon such as Starmie, Poliwrath, and Mega Venusaur.</p>"
      }
    }
  },
  "Chansey": {
    "overview": "<p>Chansey is one the best specially defensive walls around thanks to its massive HP and Special Defense stats. Thanks to its bulk and access to Soft-Boiled to keep itself healthy, it is able to take on special attackers lacking physical moves such as Mega Alakazam, Starmie, Mega Charizard X, and Mega Charizard Y. Chansey also is an effective status inducer with either Toxic or Thunder Wave due to how effective it is at forcing switches and access to utility moves like Teleport, can be very useful to gain momentum for the team and bring its teammates in safely against any of it's checks. However, a terrible Defense stat makes Chansey unable to take any physical attacks well; Pokemon like Mega Beedrill, Melmetal, Mega Gyarados, and Snorlax can OHKO it with their attacks. Chansey also struggles with potential mixed attackers like Mega Charizard Y and Mega Venusaur for the same reason, being 2HKOed by their Earthquake. It even struggles against weak physical attacks from Zapdos and Mew, two Pokemon it is supposed to check, being heavily dented by their U-turn, and gets shut down by Calm Mind Mew, as Taunt turns it into setup fodder.</p>",
    "comments": "<h1>Other Options</h1> <p>Stealth Rock can be used if the team needs a Stealth Rock setter; however, this makes Chansey more passive, as it becomes unable to either spread status around to impair threats such as Rhydon, Poliwrath, Mega Beedrill, and Mega Aerodactyl or to gain momentum for the team with Teleport. Shadow Ball can be used to enable Chansey to break Gengar's Substitute and take care of it; however, it does not do much else. Reflect is an alternative to Teleport that lets Chansey take weaker physical attacks better and support its team in taking hits from physical attackers, most notably Melmetal, but it is often inferior to simply bringing in an answer to a physical threat via Teleport. Sing can let Chansey put a switch-in out of commission, but it is often too unreliable to be worth risking.</p> <h1>Checks and Counters</h1> <p><strong>Physical Attackers</strong>: Physical attackers such as Melmetal, Mega Aerodactyl, Mega Beedrill, and Mega Gyarados can OHKO Chansey with their STAB attacks due to Chansey's minuscule Defense stat.</p> <p><strong>Offensive Pressure</strong>: Calm Mind Mew gives Chansey trouble due to Taunt shutting down its utility moves. U-turn from Mew and Zapdos can shut down momentum from Chansey, as it takes a lot of damage from U-turn due to its terrible Defense.</p> <p><strong>Poliwrath</strong>: Poliwrath can OHKO Chansey with STAB Superpower or Low Kick.</p> <p><strong>Ground-types</strong>: Nidoqueen, Alolan Dugtrio, Rhydon, and Nidoking are problems for Chansey, as all of these Pokemon are immune to Toxic and Thunder Wave and can heavily dent Chansey with Earthquake.</p> <p><strong>Mixed Attackers</strong>: Mixed attackers such as Mega Charizard X, Mega Charizard Y, Mega Blastoise, and Gengar can lure in Chansey and KO it with their physical attacks.</p>",
    "sets": {
      "Specially Defensive Wall": {
        "description": "<h1>Set Information</h1> <p>Toxic can be used to wear down threats that try to switch into Chansey such as Mega Aerodactyl, as well as bulky Pokemon like Poliwrath, Zapdos, and Rhydon. It also allows Chansey to directly combat special attackers utilizing recovery, such as Mega Alakazam and Nasty Plot Mew. Thunder Wave can be used to slow down fast Pokemon like Gengar, Mega Alakazam, and Mega Beedrill as well as hinder Pokemon that are immune to Toxic like Melmetal and Alolan Muk, making it easier for Chansey's teammates to take care of them. Teleport allows Chansey to safely pivot away from special attackers it can sponge hits from, keeping up momentum in the face of potential physically offensive switch-ins that Chansey can't handle. A Calm nature is used in order for Chansey to be as specially bulky as possible to soak up attacks from Pokemon like Mega Alakazam, Starmie, and Mega Charizard Y on the switch for its teammates.</p> <h1>Usage Tips</h1> <p>Chansey can be used early- or mid-game to force its threats to come out and use Teleport to gain momentum on them or spread Toxic or Thunder Wave. Switch Chansey into special attackers like Zapdos, Mega Alakazam, and Starmie or bring it in on a predicted switch. Use Teleport on a predicted switch to a Pokemon that can threaten Chansey, like Melmetal, Mega Gyarados, or Mega Beedrill, so a teammate can come in and take care of it. Use Toxic or Thunder Wave on predicted switches, the former to put a timer on Pokemon such as Zapdos, Poliwrath, and Rhydon, and the latter to slow down offensive switch-ins like Mega Gyarados and Gengar. Chansey can also use Seismic Toss in order to chip down Pokemon that commonly can switch into it such as Melmetal, Zapdos, and Alolan Sandslash. Be careful around potential mixed attackers such as Mega Charizard Y, Zapdos, and Mega Venusaur, as Chansey gets 2HKOed by a physical attack from these. Do not leave Chansey in on Mew if it has Taunt, as Chansey will get chipped down and be unable to heal itself. Chansey should also be wary of a potential U-turn from Mew, as it can heavily dent it. Do not let Chansey get hit by Toxic, as this will impair its ability to take special attacks and wear it down a lot faster.</p> <h1>Team Options</h1> <p>Many Pokemon appreciate Chansey soaking up all special attacks for them and providing them a safe switch-in with Teleport. Chansey appreciates Zapdos and Mega Venusaur being able to come in and tank a variety of physical attacks, including Fighting-type attacks from Poliwrath. Both of them can also help take care of Mega Gyarados, a major threat to Chansey. Mew is great to pair with Chansey because it can handicap powerful physical attackers like Melmetal, Mega Gyarados, and Dragonite with Will-O-Wisp. Rhydon acts as a great answer to Zapdos, checks many physical attackers including Mega Aerodactyl and Mega Beedrill, and has a potent offensive presence to help offset the passivity of the more defensive teams Chansey often appears on. Melmetal appreciates Chansey walling special attacks from Zapdos, Gengar, and Starmie that it does not take well and getting it in safely with Teleport to threaten physical attackers. On more offensive teams, Mega Beedrill can benefit from Chansey safely pivoting it into Mew to fire off attacks. If Chansey is running Thunder Wave, teammates that can spread Toxic are useful; Poliwrath is proficient at this, as it threatens most Pokemon immune to the move, and it also helps take on threats to Chansey such as Melmetal and Rhydon.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Scholar", "user_id": 393488}], "teams": [{"name": "Quality checked by", "members": [{"username": "Vengeance417", "user_id": 198446}, {"username": "Eve", "user_id": 375272}]}, {"name": "Grammar checked by", "members": [{"username": "Astra", "user_id": 240732}, {"username": "Lumari", "user_id": 232216}]}]}
  },
  "Starmie": {
    "sets": {
      "Special Attacker": {},
      "Offensive": {
        "outdated": true,
        "description": "<h1>Moves</h1> <p>Scald is a reliable STAB move that can burn incoming checks such as Alolan Muk and Mega Gyarados. Surf is slightly stronger, allowing Starmie to deal more chip damage to most of the metagame while leaving room for it to spread other status conditions like poison and paralysis without burn getting in the way. Alternatively, Hydro Pump is Starmie's strongest Water-type STAB move, which can 2HKO Mega Charizard X after Stealth Rock damage. However, its shaky accuracy can be a hindrance at times. Ice Beam provides solid coverage against Venusaur, Zapdos, Dragonite, and the rare Alolan Exeggutor. Thunderbolt is Starmie's strongest option against Mega Gyarados, and it can also 2HKO opposing Starmie, 2HKO Poliwrath after Stealth Rock damage, and OHKO Cloyster. Thunder Wave provides speed control for Starmie's team, crippling faster threats so Starmie and its slower teammates can get the jump on them later in the match. Toxic is another viable status move that puts checks such as Chansey and Mew on a timer. Recover provides Starmie with reliable recovery, keeping it healthy throughout the match. A Timid nature allows Starmie to be as fast as possible, letting it Speed tie with opposing Starmie and outspeed Alolan Dugtrio, Mega Pinsir, Gengar, and everything slower. A Bold nature is a viable alternative that lets Starmie tank physical attacks better from Pokemon such as Melmetal, Nidoking, and Dragonite, preventing the latter's Outrage from OHKOing it after Stealth Rock damage. Furthermore, it still allows Starmie to outspeed base 100s such as Mew, Zapdos, and Mega Charizard X.</p> <h1>Usage Tips</h1> <p>Thanks to Starmie's above-average Speed tier, it works well as an anti-lead against slower leads such as Mew, Nidoqueen, and Rhydon, being able to cripple Mew with Toxic or Thunder Wave and hit Nidoqueen and Rhydon with super effective Water-type attacks. When running Scald, it's generally safe to use it consistently in an attempt to spread burns throughout the match; however, watch out for Facade users like Snorlax. Use Recover to heal Starmie throughout the match, but be wary of the momentum it can sap at times by offering a free switch to offensive checks like Mega Alakazam and Mega Gyarados. While Starmie serves as a great offensive check to Alolan Dugtrio, be wary of its Sucker Punch, which can hit Starmie super effectively and knock it out if it's been weakened enough.</p> <h1>Team Options</h1> <p>Physical threats such as Mega Aerodactyl, Mega Beedrill, Melmetal, and Snorlax appreciate Starmie's ability to take on certain physically defensive tanks such as opposing Melmetal and Rhydon. In return, all four of these Pokemon carry Ground-type coverage moves for Alolan Muk and can also deal with the majority of Starmie's other common checks. Ground-type Pokemon including Alolan Dugtrio, Rhydon, and Nidoqueen are immune to Electric-type moves and serve as great switch-ins to Zapdos. Nidoqueen, in particular, also happens to be one of the best switch-ins to Alolan Muk in the LGPE OU metagame, something Starmie truly appreciates due to its susceptibility to Toxic and Crunch. Zapdos appreciates Starmie's ability to threaten the many Ground-types in the metagame. In return, Zapdos checks Mega Gyarados and can help wear down shared checks such as Alolan Muk and Snorlax.</p>"
      }
    }
  },
  "Pinsir": {
    "sets": {
      "Stealth Rock": {},
      "Swords Dance": {
        "outdated": true,
        "description": "<h1>Set Information</h1> <p>Swords Dance boosts Mega Pinsir's Attack stat to frighteningly high levels, enabling it to smash through the likes of Zapdos and Melmetal without prediction. X-Scissor is Mega Pinsir's STAB attack of choice, dishing out serious pain to Pokemon such as Mega Gyarados, Mew, and Mega Alakazam, especially after a boost. Earthquake provides valuable coverage against the Pokemon that resist X-Scissor, hitting Melmetal, Mega Charizard X, Rhydon, and Nidoqueen super effectively while also being Mega Pinsir's strongest attack against Poliwrath. Rock Slide hurts the many Flying-types that threaten Mega Pinsir, including Zapdos, Dragonite, Mega Aerodactyl on the switch, and Mega Charizard Y. A Jolly nature is used to outrun Mew, Zapdos, and Mega Charizard X and Y. 29 HP IVs allow Mega Pinsir to take Stealth Rock damage twice without fainting.</p> <h1>Usage Tips</h1> <p>Bringing Mega Pinsir in before Stealth Rock is up is generally a viable strategy whenever possible. As most Pokemon that can revenge kill Mega Pinsir are OHKOed by its attacks, the opponent will often hesitate with switching them directly in; this can provide a good opportunity to set up and then OHKO the opposing Pokemon. While it is uncommon for Mega Pinsir's revenge killers to be removed early in a battle, if this does happen, or the opponent simply lacks them entirely, Mega Pinsir can sweep with relative ease; otherwise, it is usually limited to one or two KOs. Set up with Swords Dance against Pokemon Mega Pinsir can force out, including Alolan Muk, Mew, and Mega Gyarados, but be wary of potential status moves from these Pokemon. Take advantage of the superior defensive typing of Pinsir's base forme before Mega Evolving. If a Pokemon is within range of being knocked out from an attack by base form Pinsir, don't Mega Evolve on the same turn when going for the attack. If Pinsir is forced out after knocking out an opposing Pokemon, Pinsir won't take more damage from Stealth Rock the next time it comes in.</p> <h1>Team Options</h1> <p>Mew is an excellent partner for Mega Pinsir. It can utilize Taunt to stop Stealth Rock from going up, use U-turn to bring Mega Pinsir in safely, check common answers to Mega Pinsir such as Melmetal and Poliwrath, and threaten common Stealth Rock setters such as Nidoqueen, Rhydon, and Alolan Dugtrio with Psychic and Scald. Starmie also threatens many of the metagame's Stealth Rock setters, and it can utilize Thunder Wave to cripple faster Pokemon. Starmie can also act as a soft check to Mega Aerodactyl, especially when running a Bold nature, and can viably use dual screens to give Mega Pinsir an easier time setting up. Nidoqueen can handle any potential Rock or Electric attacks aimed at Mega Pinsir and can consistently set up Stealth Rock, helping Mega Pinsir to secure various OHKOs.</p>"
      }
    }
  },
  "Gyarados": {
    "sets": {
      "Tank": {},
      "Wallbreaker / Cleaner": {
        "outdated": true,
        "description": "<h1>Set Information</h1> <p>Waterfall gets STAB and can also be used to fish for flinches when outspeeding the opposing Pokemon. Crunch makes Mega Gyarados a reliable check to Psychic-type Pokemon and can also cause useful Defense drops. Earthquake allows Mega Gyarados to hit Alolan Muk, Melmetal, and Poliwrath harder than its STAB moves. Substitute allows Mega Gyarados to avoid status conditions from the likes of Eevee-S and Melmetal and also gives it a safe spot to hide from weak attacks. Mega Gyarados's ability to force switches also makes it easier to set it up. Alternatively, Thunder Wave can be used to slow down the opposing Pokemon and annoy them with Waterfall flinches and paralysis and also aids Mega Gyarados's teammates later in the game. An Adamant nature allows Mega Gyarados to hit harder, as the Pokemon it 2HKOes, such as Dragonite, rarely run a +Speed nature as well.</p> <h1>Usage Tips</h1> <p>Mega Gyarados should be used primarily to wallbreak and clean the opposing team thanks to its high Attack. Additionally, it can be used as a lead against potential Stealth Rock setters bar Mew, which can outspeed and burn it. If it's the only Gengar and Mega Alakazam check on the team, Mega Evolving as soon as possible is recommended. If predicting a switch, Mega Gyarados should use Substitute to have an easier time wearing down the switch-in. Substitute can also be used against Pokemon that cannot hit it hard or against status-inducing moves, such as Melmetal's Thunder Wave. Mega Gyarados should be switched in when predicting the foe to use a resisted move, such as a Water- or Ice-type move from Cloyster, a Steel-type move from Melmetal, or a Psychic-type move from Mega Alakazam, Starmie, and Mew. However, it should avoid switching into common status inducers such as Eevee-S. Finally, it is recommended to keep Mega Gyarados as healthy as possible so it can switch in multiple times and do its job properly.</p> <h1>Team Options</h1> <p>Zapdos is a good teammate to consider, as it can lure in Ground-types like Rhydon, Nidoqueen, and Alolan Dugtrio and safely bring in Mega Gyarados with U-turn, which can use this as opportunity to clean. It also deals well with annoying threats to Mega Gyarados such as Mega Venusaur and Poliwrath. Ground-types, such as Rhydon, Alolan Dugtrio, and Nidoqueen, can switch into Electric-type moves that threaten Mega Gyarados and can also set up Stealth Rock, which helps Mega Gyarados to break the opposing team. A late-game sweeper, such as Nasty Plot Mew or Agility Dragonite, appreciates Mega Gyarados's ability to wear down foes as well. An additional check to Psychic-types, like Snorlax or Melmetal, is recommended to reduce the burden on Mega Gyarados to check them, especially in the event it is used for something else.</p>"
      }
    }
  },
  "Eevee-Starter": {
    "overview": "<p>Eevee-S stands out as the only Pokemon capable of getting rid of status, thanks to the incredible Sparkly Swirl. Combine this with access to status-spreading moves that cannot be blocked by Taunt such as Sizzly Slide, Sappy Seed, and Buzzy Buzz, and you have an excellent support Pokemon. However, Eevee-S's unremarkable typing, low offensive power, poor defensive stats, and lack of immediate recovery mean it doesn't last long on the battlefield. Eevee-S's low survivability further means that its valuable cleric powers can only be used so many times per match.</p>",
    "comments": "<h1>Other Options</h1> <p>Baddy Bad is an interesting alternative to Sizzly Slide that can also be used in conjunction with it to avoid a 2HKO from Melmetal that lack Superpower. However, Eevee-S has a hard time fitting it in its moveset.</p> <h1>Checks and Counters</h1> <p><strong>Venusaur and Mega Venusaur</strong>: Despite Eevee-S's access to Sizzly Slide, Venusaur's immunity to Sappy Seed is very problematic for Eevee-S, especially since Venusaur can use Sleep Powder to ruin its cleric abilities. Even worse, it can outspeed Eevee-S and cripple it with Sleep Powder if using a Timid nature.</p> <p><strong>Mew</strong>: Mew benefits from getting burned, since this protects it from Toxic, and Roost means a burn won't reduce its survivability by much. Meanwhile, Psychic does plenty of damage to Eevee-S. Mew is also capable of setting up on Eevee-S with Nasty Plot.</p> <p><strong>Zapdos</strong>: Zapdos benefits from getting burned almost as much as Mew for the similar reason of shielding it from Toxic, while Thunderbolt will always 2HKO Eevee-S. Zapdos is also a common user of Substitute, which takes advantage of predicted Sappy Seeds.</p> <p><strong>Mega Charizard X</strong>: Not only does Mega Charizard X not care about burns, it also has Roost to shrug off Sappy Seed and has plenty of power to KO Eevee-S. It must watch out for Buzzy Buzz, however.</p> <p><strong>Facade users</strong>: Pokemon such as Snorlax, Melmetal, and Alolan Muk can get themselves intentionally burned, giving them an easy way to KO Eevee-S with boosted Facade.</p> <p><strong>Eevee-S</strong>: Opposing Eevee-S dramatically reduce your own Eevee-S's ability to effectively spread status due to their own usage of Sparkly Swirl.</p> <p><strong>Faster Offensive Pokemon</strong>: Due to Eevee-S's mediocre Speed stat, it's fairly easy to revenge kill. Special attackers are especially problematic, since they don't particularly care about getting burned by Sizzly Slide.</p> <p><strong>Substitute</strong>: Getting Substitute up against Eevee-S can be devastating due to its low damage output and habit of using resisted moves to inflict status. Common examples include Mega Gyarados and Gengar.</p>",
    "sets": {
      "Cleric": {
        "description": "<h1>Set Information</h1> <p>Sparkly Swirl is Eevee-S's status-relieving attack. Sappy Seed potentially lets Eevee-S restore some of its own or its teammates' health while also aiding Eevee-S in some matchups, such as against Snorlax, Zapdos, and Mew. Sappy Seed is also notable for doing good damage to Rhydon, Mega Gyarados, and Poliwrath. Sizzly Slide allows Eevee-S to spread burns and punish physical attackers that would otherwise switch in such as Melmetal, Dragonite, and Alolan Muk. Protect pairs well with Sappy Seed, letting Eevee-S stall while restoring additional health. Buzzy Buzz may conflict with spreading burns, but its ability to spread paralysis is very useful against common specially offensive switch-ins such as Mega Alakazam and Starmie. Glitzy Glow is also notable for being the only way to buffer Eevee-S against special attacks while being a decent support option in general.</p> <p>A Jolly nature allows Eevee-S to outspeed some slower Pokemon that often use neutral Speed natures, such as Dragonite and Venusaur. While lowering Eevee-S's Special Attack may seem strange, its special attacks aren't used for damage output, so higher general bulk is far more preferable. A Careful nature is also a reasonable option for better Special Defense, potentially allowing Eevee-S to avoid a 2HKO from Zapdos or Mew after Stealth Rock damage.</p> <h1>Usage Tips</h1> <p>When Eevee-S is safely in and your team is status free (usually early-game), its main job is to spread status. Eevee-S is most safe to do this against slower foes such as Alolan Muk. Note, though, that even burned foes like Melmetal can still inflict significant damage against Eevee-S. When up against slower physical attackers, Eevee-S should usually burn them first with Sizzly Slide and then use Sappy Seed. However, against Pokemon that benefit from being burned, such as Mew and Zapdos, use Sappy Seed if Eevee-S must stay in. Also note that some Pokemon such as Melmetal and Snorlax may use Facade to take advantage of burns.</p> <p>Eevee-S's main purpose may be to lift status from your team, but don't be reckless with it. Eevee-S doesn't last very long, so use Sparkly Swirl either when Eevee-S isn't in much danger or if lifting status from certain teammates is more important than Eevee-S's safety. Additionally, be wary of Substitute use if you're forced to keep Eevee-S in on unfavorable matchups. If facing common Substitute users such as Mega Gyarados and Gengar, consider using a move that may break their Substitute instead of inflicting favorable status.</p> <h1>Team Options</h1> <p>Eevee-S's cleric powers make using Rest a viable option for teammates, so pairing bulky Pokemon that lack recovery with Eevee-S is a great idea. Melmetal, Alolan Muk, and Snorlax are particularly good options for this, but Poliwrath is also notable for helping against Mega Gyarados. Dragonite is an especially good partner for Eevee-S; not only does it resist the occasional Fighting-type attack aimed at Eevee-S, but Eevee-S's Sparkly Swirl support also makes Dragonite far less scared of status, meaning it can be more effectively used as a tank when it's unable to sweep.</p> <p>U-turn users are a helpful way to get Eevee-S in safely. Zapdos is an excellent example and benefits from Toxic removal due to its use of Roost. Mew also does a good job of getting Eevee-S in with U-turn, and as a bonus, it often lures Alolan Muk in for Eevee-S to take advantage of. Mega Beedrill is a more offensive alternative that can potentially put its checks like Melmetal in a position to get burned.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Theorymon", "user_id": 29010}], "teams": [{"name": "Quality checked by", "members": [{"username": "Yoshi", "user_id": 322194}, {"username": "Hayburner", "user_id": 291554}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}, {"username": "CryoGyro", "user_id": 331519}]}]}
  },
  "Omastar": {"sets": {"Shell Smash": {}}},
  "Aerodactyl": {
    "overview": "<p>Mega Aerodactyl is an offensive powerhouse in  LGPE OU  due to a combination of a high Attack stat, a phenomenal Speed stat, and enough coverage to hit a large portion of the metagame for super effective damage. As Electrode and Mega Alakazam are the only two Pokemon that can even Speed tie with it, Mega Aerodactyl can often sweep a softened team without taking any hits. However, its typing makes it vulnerable to Stealth Rock and priority moves like Aqua Jet and Ice Shard. Due to its mediocre bulk, it can also struggle with breaking past bulkier Pokemon like Melmetal and Mega Gyarados, as it generally will not survive a super effective STAB attack after Stealth Rock damage. Because its STAB attacks have relatively low Base Power, Mega Aerodactyl generally struggles to sweep before chip damage has been spread across the opposing team. Mega Aerodactyl generally does its best work in a late-game cleanup, when its threats are properly softened.</p>",
    "comments": "<h1>Other Options</h1> <p>Replacing Wing Attack or Crunch with Roost will give Mega Aerodactyl some longevity and offset repeated switches into Stealth Rock, but it sacrifices the ability to deal with common late-game threats like Mega Alakazam, Poliwrath, Mega Venusaur, Mew, and Starmie. Taunt can allow Mega Aerodactyl to temporarily stop Stealth Rock and other status moves, but Mega Aerodactyl risks being hit hard if your opponent did not select one of those moves. Wing Attack could be replaced with Fly in order to deal more damage in a single hit, but Wing Attack has a higher overall damage output and can't be exploited as easily.</p> <h1>Checks and Counters</h1> <p><strong>Melmetal</strong>: Melmetal's tremendous HP, excellent Defense, and good defensive typing allow it to shrug off all of Mega Aerodactyl's STAB attacks and only leave it slightly vulnerable to Earthquake. Its monstrous Attack stat and signature move, Double Iron Bash, will allow it to OHKO Mega Aerodactyl after Stealth Rock even while burned.</p> <p><strong>Bulky Offensive Pokemon</strong>: Rhydon, Mega Gyarados, Poliwrath, and Starmie can all take at least one attack from Mega Aerodactyl even after Stealth Rock damage and threaten it with an OHKO from their STAB attacks.</p> <p><strong>Bulky Status Users</strong>: Mew, Clefable and Starmie can survive an attack from Mega or regular Aerodactyl and cripple it with paralysis or burn in Mew's case.</p>",
    "sets": {
      "Mega Attacker": {
        "description": "<h1>Set Information</h1> <p>Rock Slide allows Mega Aerodactyl to KO threats like Zapdos, Dragonite, and opposing Aerodactyl after Stealth Rock damage and has respectable neutral coverage over the tier. Threats like Dragonite only require a small amount of chip damage before Rock Slide will reliably OHKO them. Earthquake gives Mega Aerodactyl a method of responding to threats like Rhydon and Melmetal, doing over 50% to the former and over 33% to the latter. Crunch allows Mega Aerodactyl to have a favorable matchup with Mega Alakazam (which either needs to win a Speed tie and land a critical hit, or survive a near-guaranteed OHKO and win a Speed tie on the next turn) and Starmie. Wing Attack allows Aerodactyl to threaten foes that otherwise give it trouble due to their bulk or typing, such as Mega Venusaur and Poliwrath. Roost is an option that allows Mega Aerodactyl to restore its HP if necessary and tank moves that would normally hit it super effectively. The preferred nature is Jolly, as it improves Aerodactyl's odds versus standard Mega Alakazam, Mega Beedrill, and Electrode while also allowing it to outspeed the rare Modest Mega Alakazam. However, Adamant allows Mega Aerodactyl to secure many KOs more easily while only opening it up to being consistently outsped by the aforementioned Pokemon and opposing Mega Aerodactyl—of which, only opposing Mega Aerodactyl can OHKO it after Stealth Rock damage.</p> <h1>Usage Tips</h1> <p>Pokemon that check Mega Aerodactyl will usually be extremely heavy hitters, so it can be difficult to bring a teammate in on their attacks and expect it to do anything other than get KOed on the next turn. This means that this set is generally reserved for late-game unless your opponent has failed to set up Stealth Rock or doesn't have any Pokemon with super effective priority moves or an equal Speed tier. Mega Aerodactyl can also act as an effective revenge killer due to its perfect neutral coverage and amazing Speed, so don't be afraid to use it earlier on if a situation calls for it. Mega Aerodactyl's mediocre bulk and focus on speedy physical attacks mean that burn and paralysis will largely render it useless. Thus, it’s generally not safe to bring it in on or leave it in against a foe that threatens these status ailments and isn't in its KO range. Finally, this set requires a fair amount of chip damage on bulky foes like Rhydon, Melmetal, Clefable, and Mega Gyarados. Keep this in mind when selecting teammates, as often, a teammate merely needs to get a single attack off on one of these threats to bring it into KO range of Mega Aerodactyl's coverage moves.</p> <h1>Team Options</h1> <p>Because of the limited number of Pokemon that can survive an attack from Mega Aerodactyl after a small amount of chip damage and Stealth Rock, it has a very diverse range of potential teammates. Starmie, Poliwrath, and Zapdos are excellent options, as they can easily answer and chip down Mega Aerodactyl's main threats. Pokemon with strong Fire-type attacks are always appreciated by Mega Aerodactyl, as they can chip Melmetal into Earthquake's KO range. Mega Aerodactyl truly appreciates Stealth Rock support because many  foes that would otherwise check Aerodactyl, like the common Zapdos, will be taken out by a single Rock Slide after Stealth Rock damage. Nidoqueen is especially effective, as it can set up Stealth Rock against Zapdos and spread consistent chip damage with Super Fang. Dragonite's standard Agility set can support Mega Aerodactyl extremely effectively as well, as they both can lure in and damage Melmetal to help out the other.</p>"
      },
      "Stealth Rock Setter": {
        "description": "<h1>Set Information</h1> <p>Aerodactyl can reliably set up Stealth Rock thanks to its great Speed. Taunt allows Aerodactyl to block status-inducing moves, Stealth Rock, and setup moves from slower foes. The combination of Rock Slide and Earthquake hits most of the metagame hard and allows Aerodactyl to have some offensive presence.</p> <h1>Usage Tips</h1> <p>While it is capable of being played as a suicide Stealth Rock lead, this is generally a poor play, as Aerodacty's speed tier and type coverage are generally able to be of use at several points in a match. Finding an opportunity to switch in Aerodactyl for free and using Taunt to block a predicted status move will usually provide the opportunity to set Stealth Rock while maintaining Aerodactyl's health. Alolan Dugtrio, Alolan Muk, and a healthy non-Body Slam Snorlax are all generally safe options to bring Aerodactyl in on.</p> <h1>Team Options</h1> <p>This is an ideal partner for a team focused on Mega Gyarados. Mega Gyarados has a huge weakness to Mega Beedrill, but Mega Aerodactyl answers it easily and allows Gyarados to preserve its resistance to Mega Beedrill's U-turn. In addition, Mega Gyarados plugs the weak spots Aerodactyl has to Starmie and Rhydon. As Gyarados and Aerodactyl share an Electric weakness, it's usually beneficial to have a Ground-type, such as Nidoqueen. The chosen Ground-type also appreciates Aerodactyl providing Stealth Rock, as it gives it room to increase its coverage. Reflect Zapdos also synergizes well with this flexible Aerodactyl set, as an incoming Melmetal provides an opportunity for Zapdos to set up Reflect for the rest of the team.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "McCoolDude", "user_id": 469684}], "teams": [{"name": "Quality checked by", "members": [{"username": "Theorymon", "user_id": 29010}, {"username": "Eve", "user_id": 375272}, {"username": "Ivy", "user_id": 173336}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}, {"username": "Empress", "user_id": 175616}]}]}
  },
  "Snorlax": {
    "sets": {
      "Special Tank": {},
      "Tank": {
        "outdated": true,
        "description": "<h1>Set Information</h1> <p>Facade is Snorlax's strongest STAB move and provides a safeguard against burns and status, ensuring it does massive damage to any foe that doesn't resist the move. Earthquake is used to hit Pokemon that resist Facade such as Melmetal, Gengar, and Rhydon. Toxic can break down bulky Pokemon such as Poliwrath, Rhydon, and Mew. It also can put offensive Pokemon such as Mega Alazazam, Dragonite, and Zapdos on a timer. Fire Blast and Surf can be used in the fourth moveslot for a chance to 2HKO Melmetal and Rhydon, respectively. These moves are especially helpful if Snorlax is burned. Self-Destruct can also put a dent into Pokemon like Dragonite, Poliwrath, and Mew. Rest can be run in the fourth moveslot, but only if Eevee-S is on Snorlax's team. A Sassy nature allows Snorlax to be a mixed tank that can 2HKO almost every Pokemon in the metagame. Careful should only be used if Snorlax runs Self-Destruct.</p> <h1>Usage Tips</h1> <p>Snorlax is a tank designed to come in on special attackers such as Zapdos, Gengar, and Mew. It can also come in on status-inducing moves such as Will-O-Wisp and Toxic from these Pokemon, Scald from Starmie or Mega Slowbro, and Sizzly Slide from Eevee-S or with the help of U-turn from a teammate like Zapdos or Mega Beedrill. However, it is generally best to preserve Snorlax's health so that it can switch into a strong special attacker such as Mega Alakazam. Early in the match, Snorlax can break walls with Facade so that other teammates can have an easier time if certain threats have been dented or knocked out. After it has been afflicted with status, Snorlax should aim to spam Facade as much as possible because this move deals a massive amount of damage to any foe that doesn't resist it. If Snorlax's HP is relatively low or if there is a potentially problematic Pokemon on the opposing team like Mega Beedrill, Mew, or Dragonite, it can be a good idea to use Self-Destruct to deal a considerable amount of damage to these Pokemon or even knock them out. Although Snorlax is meant to take status conditions, keep in mind the drawbacks of them: Toxic poison depletes its amazing bulk over time and burns can weaken its offensive pressure with its other moves. Snorlax does not want to be asleep or paralyzed: sleep turns Snorlax into a sitting duck, and full paralysis can cost Snorlax a potential KO. Do not let Snorlax stay in on physically offensive Pokemon like Melmetal, Dragonite, and Poliwrath: these Pokemon threaten Snorlax out of the battle by targeting its weaker Defense.</p> <h1>Team Options</h1> <p>Because of its poor Defense, pairing Snorlax with a physically bulky Pokemon like Melmetal, Rhydon, Mega Venusaur, Mew, or Mega Slowbro could be a good idea. Having a special attacker like Mew, Mega Venusaur, or Starmie on Snorlax's side can help it deal with physically defensive Pokemon. Mega Beedrill and Zapdos can also make for good partners, since they can bring Snorlax into battle with  U-turn. Zapdos can also help check Melmetal for Snorlax, especially if it is not running Fire Blast. Pokemon like Rhydon, Melmetal, and Mega Aerodactyl appreciate Snorlax's ability to take special hits and burns from Scald. Eevee-S can also help Snorlax by healing its status conditions with Sparkly Swirl so that it can use its other physical moves like Earthquake and Self-Destruct more safely or by providing further support with Sizzly Slide and Sappy Seed. Eevee-S is practically mandatory if Snorlax runs Rest.</p>"
      }
    }
  },
  "Zapdos": {"sets": {"Pivot": {}}},
  "Dragonite": {
    "sets": {
      "Agility": {},
      "Agility Cleaner": {
        "outdated": true,
        "description": "<h1>Set Information</h1> <p>Agility allows Dragonite to outspeed any foe it faces, and Roost allows Dragonite to take advantage of its good defensive stats and notably improves its defensive typing for the turn, a factor that lets it heal off powerful attacks such as Mega Aerodactyl's Rock Slide. Outrage is Dragonite's most powerful attack and provides the main damage output in most scenarios. Earthquake provides good super effective or neutral coverage versus all relevant Outrage responses. Adamant is the absolute best nature for this set, as it helps guarantee KOs versus weakened foes, and extra bulk is generally unnecessary. Jolly might seem good at first glance, as it allows Dragonite to outrun foes such as Eevee-S, Nidoqueen, and Adamant Mega Gyarados before a boost, but extra power is useful in more scenarios.</p> <h1>Usage Tips</h1> <p>Dragonite is best saved for the end of the battle when defensive Pokemon and notable threats to it are weakened or outright removed from play, but it can be used earlier on to pick up KOs with Earthquake if necessary. If an opportunity arises late-game for Dragonite to set up, you should generally take it. Dragonite can set up on a good number of Pokemon thanks to its natural bulk and Roost, so don't be afraid to bring it in on foes like Mega Gyarados, Zapdos, Mega Venusaur and Snorlax when the stage is set for it. Use Agility as soon as possible unless Dragonite naturally outspeeds the opponent's remaining Pokemon or you predict a switch to a healthy check. Make liberal use of Roost where sensible to keep Dragonite out of range of more threatening attacks from anything that can still take a hit, such as Rock Slide from Rhydon. Don't lock Dragonite into Outrage until absolutely necessary or it is safe to do so. If Dragonite looks to be unable to clean, don't be afraid to use it as a tank. Its bulk, Roost, and solid damage output let it deal with many common Pokemon like Alolan Muk, Zapdos, and Gengar if necessary.</p> <h1>Team Options</h1> <p>Mega Beedrill is a very effective partner for Dragonite thanks to the two sharing several common switch-ins, enabling it to force important damage on them in preparation for Dragonite's sweep. In certain matchups, they can even assume reversed roles, with Dragonite utilizing its high damage output earlier on to weaken foes for Mega Beedrill. This works especially well versus teams that rely on Melmetal to check both, as it will be weakened for an easy late-game sweep. This is most significant in matchups where Dragonite isn't given good setup opportunities. Mega Aerodactyl is a good partner for similar reasons to Mega Beedrill, having a better Speed tier, the option of providing Stealth Rock, and defensive value in exchange for weaker STAB and a lack of U-Turn. Poliwrath makes for a good defensive teammate thanks to its good matchup versus Ice-types, Rock-types, and Melmetal. Melmetal itself is also a great teammate, resisting all of Dragonite's weaknesses and appreciating Dragonite's resistances while also providing a response to fast Mega Evolutions like Mega Aerodactyl, Mega Alakazam, and Mega Beedrill, which can threaten Dragonite before it sets up.</p>"
      }
    }
  },
  "Mew": {
    "overview": "<p>Mew is an extremely dominant force in the LGPE OU metagame, excelling in almost every regard. Its 100 Speed tier lets it outpace a huge number of relevant Pokemon and sets the boundary for what is considered fast. Mew also has some of the best mixed bulk in the entire game, enough to avoid a reliable OHKO from any unboosted attack, while also being backed up by reliable recovery. As a result, it can effectively wall or at worst check a majority of the metagame with the right set. Its offenses are average by the metagame's standards but are enough to let it deal respectable damage both physically and specially. The Psychic typing is great, exploiting the low number of Pokemon that resist it greatly while also not having too many noteworthy weaknesses. Mew's movepool is possibly its most notorious feature, however; with amazing coverage options both physically and specially, great utility, and setup options that bolster its decent offenses as well as the aforementioned recovery Roost provides, Mew is extremely versatile and can run more viable sets than any other Pokemon by a large margin, excelling in most of the roles it assumes. Despite its numerous oppressive qualities, Mew does have significant weaknesses that keep it from being overwhelming. Most Mew sets are extremely vulnerable to being worn down by Toxic, and some faster Mega Evolutions such as Mega Beedrill and Mega Pinsir can dispatch of most sets easily after minimal prior damage. However, Mew can almost always get around these issues via team support or niche moveset options.</p>",
    "comments": "<h1>Other Options</h1> <p>A Bulk Up set can be used to catch people expecting special variants off guard, but it is generally less powerful than the aforementioned special sets. Ice Beam can be used on the Nasty Plot set instead of Psychic for superior coverage, but it sacrifices important raw power. Mew sets using Will-O-Wisp can instead use Toxic or Thunder Wave depending on what suits your team best, but burn is generally the most useful status for Mew in order to wall specific physical threats. A Calm Mind set with multiple attacks can be run similarly to the standard Nasty Plot set; however, the greater boost provided in fewer turns by Nasty Plot is generally more desirable for such sets. Mew has two possible dual setup variants in Calm Mind + Barrier and Bulk Up + Amnesia paired with Rest and a single attacking move, but these are prone to being knocked out by critical hits while trying to set up and generally take too long to become effective in a battle. Self-Destruct can be used as a way to lure special walls, opening up opportunities for special sweepers, but this can be risky to pull off and sacrifices Mew entirely. Dual screens provides valuable team support and can even be paired with Transform; when the correct screen is up, Transform will allow Mew to take on foes one-on-one that may otherwise give it trouble. However, a set without Transform severely lacks utility outside of setting screens, a feat Electrode often pulls off better. Furthermore, while interesting, Transform sets can often be redundant; Mew can beat many Pokemon one-on-one anyway and is often better than whatever it could Transform into.</p> <h1>Checks and Counters</h1> <p><strong>Alolan Muk</strong>: Alolan Muk is immune to Psychic and does a good job of dealing with Nasty Plot sets especially—while defensive pivot Mew can burn Muk, it might be afflicted with Toxic in return.</p> <p><strong>Mega Beedrill</strong>: Mega Beedrill can reliably dispatch of Mew after some chip damage, hitting it very hard with U-turn or X-Scissor. It must be wary of Psychic or a burn, though.</p> <p><strong>Mega Pinsir</strong>: Mega Pinsir outspeeds Mew and threatens it with an X-Scissor while also providing the double threat of setting up a Swords Dance on a switch.</p> <p><strong>Mega Charizard X</strong>: Mega Charizard X absorbs Will-O-Wisp, and if running Toxic, it can wear down defensive Mew effectively.</p> <p><strong>Snorlax and Chansey</strong>: Snorlax and Chansey do a good job of sponging attacks from standard Mew sets, with Chansey statusing them in return and Snorlax threatening an extremely powerful Facade if burned.</p> <p><strong>Toxic</strong>: Other Pokemon that may let Mew switch in safely, such as Poliwrath, often run Toxic to severely lower its longevity.</p>",
    "sets": {
      "Defensive Pivot": {
        "description": "<h1>Set Information</h1> <p>Psychic is this set's best mono-attacking option thanks to its significant damage output versus the majority of the metagame. Will-O-Wisp is great for allowing Mew to easily deal with most physical attacks, while Flamethrower gives Mew a good way to immediately threaten Melmetal for teams especially vulnerable to it. Roost is key to the set's survivability, allowing Mew to be used liberally throughout the match and wall out many threatening Pokemon. U-turn allows Mew to gain momentum, either to escape an unfavorable matchup or to give the user better offensive pressure versus the opposing Pokemon. Taunt allows Mew to protect itself from common counterplay in Toxic at the cost of U-turn's momentum. A Timid nature allows Mew to act first and therefore safely heal, pivot or use Will-O-Wisp in more matchups, while Bold sacrifices a few of those matchups for a better defensive presence that allows it to more safely deal with threats such as Melmetal.</p> <h1>Usage Tips</h1> <p>Mew should generally be brought in versus Pokemon that either are unable to deal significant damage to it or are weak to Psychic. Once it's in, you can use Psychic to put on immediate pressure, burn the opponent if they are a physical attacker that may be problematic for your team, heal Mew if it is safe and necessary to do so, or use U-turn if you expect a switch to something that can deal with Mew. Mew can be used for checking many offensive threats that can't hit it with a super effective STAB attack in a pinch, such as Mega Aerodactyl, Dragonite, Rhydon and Starmie. It can also be used to threaten a burn on Melmetal, but it will take a lot of damage in the process. Always make sure to keep Mew healthy enough to deal with key threats that the rest of your team might struggle with. Trying to avoid getting statused helps greatly with this.</p> <h1>Team Options</h1> <p>While this set fits on almost any team composition and as a result works well with most things, there are a few Pokemon that synergize especially well with Mew. Zapdos appreciates Mew's ability to check and threaten Alolan Dugtrio, Nidoqueen, Nidoking, and Rhydon and completes an effective U-turn core. Melmetal benefits from Mew's ability to take Fighting-, Fire-, and Ground-type attacks and the safe switches U-turn provides while itself providing a useful Toxic immunity. Alolan Muk provides a great response to Mega Alakazam, which otherwise gives Mew a lot of trouble, and also provides a Toxic immunity.</p>"
      },
      "Nasty Plot": {
        "description": "<h1>Set Information</h1> <p>Psychic and Thunderbolt are usually the best options for this set's attacks, providing strong unresisted coverage among common Pokemon other than the frail Alolan Dugtrio. Fire Blast gives Mew a better matchup versus Alolan Dugtrio, Melmetal, and Alolan Sandslash as well as providing unresisted coverage for niche options like Exeggutor and Magneton, but it comes at the expense of either coverage for Mega Gyarados and Starmie or longevity in Roost. Nasty Plot allows Mew to quickly boost its damage output to very threatening levels. Roost makes setting up versus weaker attackers a safe option. A Timid nature is heavily recommended, giving Mew better odds of victory versus Pokemon with base 100 Speed. Modest's damage increase doesn't change many matchups enough to be worthwhile.</p> <h1>Usage Tips</h1> <p>Mew should ideally be kept healthy until opposing special tanks are weakened and potential revenge killers are either knocked out or paralyzed; it can win quite easily in such a scenario. Bring Mew in versus a Pokemon that it can force out, such as Venusaur or Poliwrath. You can also bluff a Will-O-Wisp in order to get more setup opportunities. Use this first turn to set up. If your Mew is still healthy and is pressured to either switch or be knocked out, don't be afraid to preserve it; Mew's bulk means it can set up multiple times in some games. This set isn't as negatively affected by Toxic as other Mew sets, as Pokemon that rely on Toxic to damage Mew may give it multiple setup opportunities and as a result the potential to knock out several Pokemon before fainting.</p> <h1>Team Options</h1> <p>Nidoqueen is an especially effective partner for Nasty Plot Mew, as Stealth Rock damage paired with Super Fang puts many bulky Pokemon in range of boosted attacks. It also checks Alolan Muk and Chansey quite effectively. Electrode provides extremely useful support by threatening paralysis on Pokemon that outspeed Mew and bolstering Mew's bulk to ridiculous levels with dual screens. Thunder Wave Melmetal provides further paralysis support while also checking Mega Aerodactyl and Mega Beedrill, two Pokemon that can revenge kill Nasty Plot Mew. Mega Aerodactyl provides an offensive check to Mega Beedrill while also appreciating Mew's ability to break holes in the opponent's team earlier in the game itself.</p>"
      },
      "Calm Mind": {
        "description": "<h1>Set Information</h1> <p>Scald is the best attack for this set, having high PP, no immunities, and the chance to burn physical threats that may otherwise give it trouble. Calm Mind bolsters Mew's offensive and defensive presence, allowing it to deal better with strong special attackers such as Gengar and Mega Alakazam that may otherwise give it trouble. Taunt prevents Mew from being disrupted by status such as Toxic poison and paralysis from slower foes, both of which can ruin this set's effectiveness, while Roost provides vital longevity. A Timid nature is recommended, allowing Mew to outspeed and Taunt as many Pokemon as possible in order to avoid having its sweep ended by Toxic.</p> <h1>Usage Tips</h1> <p>If your opponent has an Alolan Muk, attempting to get a Scald burn on it early in the game is advised. Be careful to not let it land a Toxic on Mew unless you have Eevee-S for support, as this will completely shut it down for the rest of the match. If you expect a slower opponent to try and inflict a harmful status on Mew or use their own setup, use Taunt to prevent it. Due to Mew's bulk, this is entirely safe against many Pokemon. When in a position where Mew can't be immediately 2HKOed or statused, you can start to set up Calm Mind. Use Roost when necessary. Once you've set up enough, start attacking. If the opponent has a defensive pivot Mew or a standard Mega Charizard X, try to bait them into burning your Mew—being burned is good for any Mew set, as it prevents Toxic, but especially for this one.</p> <h1>Team Options</h1> <p>Nidoqueen and Nidoking make great partners for this Mew set thanks to their Toxic immunity and positive matchup versus Alolan Muk. Eevee-S provides much appreciated cleric support to enable more reckless play. Mega Aerodactyl's ability to offensively check Mega Beedrill  is appreciated by this set as much as any other.</p>"
      },
      "Stealth Rock": {
        "description": "<h1>Set Information</h1> <p>Scald is the most common mono-attacking option for Stealth Rock Mew, compressing damage and the potential to burn into a single slot. Stealth Rock is provides invaluable support for this set's teammates. U-turn allows this set to act as a pivot, which helps combat its relative passivity, while Taunt shuts down other Stealth Rock leads such as Nidoqueen as well as miscellaneous Toxic users. Roost keeps Mew healthy throughout the match, allowing it to check threats such as Mega Aerodactyl despite its set being focused on setting Stealth Rock. A Timid nature allows Mew to set up Stealth Rock before being attacked by as many Pokemon as possible, making it optimal for this set.</p> <h1>Usage Tips</h1> <p>This set is usually most effective as a lead; nothing can reliably OHKO Mew, and it has a solid Speed tier, so it almost always gets to set up Stealth Rock. Your priority should usually be setting up Stealth Rock. However, if an opportunity to gain a significant advantage appears, such as being able to OHKO Rhydon, you should consider taking it first. Try not to entirely sacrifice Mew if possible, as there's a good chance it could be useful later in the game as a defensive measure. If you expect the opponent to switch a physical attacker such as Alolan Muk, Mega Gyarados, or Melmetal in on Mew, you can try to burn it with Scald.</p> <h1>Team Options</h1> <p>Pairing another Pokemon that is often used to set up Stealth Rock with this Mew helps to make the set less obvious, decreasing the chance of the opponent expecting a Mew lead and responding accordingly. Alolan Dugtrio, Nidoking, and Nidoqueen are especially good options thanks to their decent Speed and positive matchups versus Alolan Muk. Fast offensive Mega Evolutions that come in often throughout a game, most notably Mega Beedrill, are especially good partners for a reliable Stealth Rock setter, as they enjoy having their answers being further worn down. Mega Beedrill's ability to help respond to opposing Gengar is notable, as experienced players may be aware that Gengar can switch in on Mew's Scald and force a bad situation.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Eve", "user_id": 375272}], "teams": [{"name": "Quality checked by", "members": [{"username": "Ivy", "user_id": 173336}, {"username": "McCoolDude", "user_id": 469684}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}]}]}
  },
  "Melmetal": {
    "sets": {
      "Tank": {},
      "Offensive Tank": {
        "outdated": true,
        "description": "<h1>Set Information</h1> <p>Double Iron Bash is a powerful, spammable STAB move that has the added chance of causing flinch to Melmetal's foes, which may come in handy when combined with Thunder Wave support. Earthquake covers Fire- and Steel-type Pokemon that would likely want to switch into Melmetal's STAB attack. Thunder Punch lets Melmetal cover Water-type switch-ins such as Gyarados, Starmie, and Poliwrath. Superpower may be used instead as a more powerful option against Mega Gyarados and opposing Melmetal specifically, although the reduced stats after every use tend to force Melmetal out. Ice Punch works great in conjunction with Thunder Punch, forming solid BoltBeam coverage that may defeat common switch-ins such as Zapdos. Rest is a form of semi-reliable recovery, although it requires mandatory support via Eevee-S thanks to Sparkling Swirl, as Melmetal becomes too vulnerable otherwise. Facade can be used as a means to work around status moves that are commonly inflicted onto Melmetal, especially when facing common users such as Mew, Starmie, and Eevee-S. An Adamant nature enables Melmetal to dish out as much damage as possible, most notably having a better chance to 2HKO Poliwrath and Mega Gyarados with Thunder Punch. Impish can be used as an alternative to better take on threats such as Mega Beedrill and Mega Aerodactyl. Careful is another option as a nature to help improve Melmetal's poor special bulk; however, Melmetal still struggles to take on threats such as Gengar and Mew.</p> <h1>Usage Tips</h1> <p>Thanks to Melmetal's phenomenal physical bulk, it can often be brought in against the majority of physical attackers in the tier, with the best examples being Mega Beedrill, Mega Gyarados, and Snorlax. However, Melmetal must always be wary of coverage options such as Earthquake, Drill Run, and Fire Blast, which can threaten to wear it down significantly. Melmetal tends to spam Double Iron Bash the majority of the time due to its significant damage output against any foe that does not resist it; however, coverage moves such as Thunder Punch and Ice Punch should be used to dent common Pokemon that resist Steel, like Poliwrath and Zapdos. Rest should be reserved for when Melmetal gets low on health or inflicted by status, as otherwise the burden of bringing in Eevee-S in order to remove the sleep ailment becomes too much of a burden.</p> <h1>Team Options</h1> <p>Melmetal pairs well with offensive threats that appreciate its ability to take on physical hits in a pinch. Notable examples include Mega Alakazam, Mega Beedrill, and Dragonite, as they can help take on threats to Melmetal such as Starmie, Mew, and Alolan Dugtrio. Mew is also a solid partner for Melmetal, as it can take physical hits for Melmetal that may wear it down overtime if it is forced to come in too frequently. Mew can also provide support via slow U-turn pivoting, enabling Melmetal to come in without risking taking a hit. Defensive Water-types such as Mega Gyarados, Poliwrath, and Starmie can form a solid defensive core with Melmetal, as they can help check Fire- and Ground-types. Flying-types such as Mega Aerodactyl and Zapdos are also appreciated, as they can come in on Earthquake, a common coverage move carried by the majority of physical attackers in the tier, while Melmetal can switch in on Rock-type moves. Eevee-S is a mandatory partner if Melmetal is using Rest, as it becomes too passive otherwise.</p>"
      }
    }
  }
}