{
  "Gardevoir": {
    "overview": "<ul> <li> <p>Mega Gardevoir sets itself apart from other Fairy-type threats like Tapu Lele with its access to Pixilate-boosted Hyper Voice and Trick Room. These moves allow Mega Gardevoir to function as an offensive Trick Room user that can simultaneously apply pressure to two foes.</p> </li> <li> <p>Mega Gardevoir's ability to threaten problematic foes to Trick Room teams like Amoonguss also differentiates it from other Trick Room users like Cresselia and Mimikyu.</p> </li> <li> <p>Mega Gardevoir is also capable of providing unique team support. Trace copies foes' abilities, and this can come in handy against foes like Landorus-T and Salamence, or scouting foes' abilities. The moveset can also be adjusted to employ utility moves like Will-O-Wisp, Taunt, and Destiny Bond.</p> </li> <li> <p>As a Trick Room user, Mega Gardevoir's low physical bulk and high Speed can be detrimental. Mega Gardevoir is easily overwhelmed by a myriad of common physical attackers even when running bulk investment, and it is slower than foes like Tapu Bulu and Porygon2 under Trick Room. This leaves Mega Gardevoir somewhat reliant on its teammates to effectively function, and this combines with the fact that Mega Gardevoir takes up a Mega slot to make it somewhat of a Pokemon that must be built around.</p> </li> <li> <p>Gardevoir has little to do against Steel-types like Mega Metagross, Aegislash, Heatran, and Ferrothorn due to them resisting its STAB combination.</p> </li> <li> <p>While Mega Gardevoir may seem to be able to run a fast, offensive attacker set, its susceptibility to priority moves and the presence of faster threats like Kartana, Tapu Koko, and Mega Gengar make any sets other than Trick Room hard to justify over other threats like Tapu Lele.</p> </li> </ul>",
    "sets": {
      "Trick Room": {
        "description": "<ul> <li> <p>Trick Room allows Mega Gardevoir to take an effective countermeasure against faster teams, which it would easily be taken down against. Bulk investment and Mega Gardevoir's general offensive power aid its ability to set up Trick Room against a considerable portion of the metagame.</p> </li> <li> <p>Hyper Voice nets sizable damage on many neutral foes despite the lack of much investment due to Mega Gardevoir's high Special Attack and a boost from Pixilate. It is the most effective option for Mega Gardevoir to deal with Dragon-types like Mega Salamence.</p> </li> <li> <p>Psychic hits a number of important foes that are resistant to Pixilate-boosted Hyper Voice, such as Mega Charizard Y, Amoonguss, and Nihilego for high damage. Psyshock is an alternative to OHKO the latter two and generally hit specially defensive foes like Snorlax harder at a cost of slightly less power.</p> </li> <li> <p>Mega Gardevoir's role as a Trick Room setter, access to a spread attack, and frailty entice attacks from foes often. Protect therefore makes a good option to temporarily guard it from offensive pressure.</p> </li> <li> <p>The given EV spread ensures that Mega Gardevoir survives two Earthquakes from Jolly Landorus-T and a Sludge Bomb from Mega Gengar. 36 Special Attack EVs allow Mega Gardevoir to benefit the most from its Special Attack-boosting nature.</p> </li> <li> <p>An alternative Relaxed nature works if Mega Gardevoir will have to survive Double-Edge from Mega Salamence and avoid the 2HKO from Adamant Landorus-T's Earthquake.</p> </li> <li> <p>36 Speed EVs can be run with a Modest or Bold nature so that Mega Gardevoir can outspeed everything up to Jolly Choice Scarf Landorus-T with Tailwind support.</p> </li> <li> <p>Various slow physical attackers can work with Mega Gardevoir to take down each other's checks while running rampant when Trick Room is active. Incineroar is a notable partner for easing Mega Gardevoir's attempt to set up Trick Room by weakening foes with Intimidate and using Fake Out.</p> </li> <li> <p>Other slow teammates like Snorlax, Tyranitar, and Araquanid can take advantage of Trick Room. All of them can run viable countermeasures to deal with Steel-types and specially defensive foes.</p> </li> <li> <p>Landorus-T is a viable teammate that also appreciates Trick Room due to its middling Speed. It offensively checks some of Mega Gardevoir's biggest checks like Mega Metagross, Aegislash, and Heatran.</p> </li> <li> <p>Tailwind is also a viable option to support Mega Gardevoir. Offensive teams often lack a proper way to deal with Gardevoir and therefore the Speed boost from Tailwind makes it notoriously difficult to deal with. Zapdos is a viable setter due to its ability to threaten Celesteela and keep Calm Mind Tapu Fini in check, while Kartana is a good teammate thanks to it threatening Steel-types with Sacred Sword and specially defensive foes.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "Lotus", "user_id": 434601}], "teams": [{"name": "Quality checked by", "members": [{"username": "Jio", "user_id": 22788}, {"username": "Carbonific", "user_id": 233942}]}, {"name": "Grammar checked by", "members": [{"username": "P Squared", "user_id": 168392}]}]}
  },
  "Heatran": {
    "sets": {
      "All-out Attacker": {"description": "<p>This set aims to maximize Heatran’s offensive potential. In the third moveslot, Flash Cannon acts as a single-target STAB move that checks Fairy-types such as Tapu Lele and Gardevoir. Hidden Power Ice checks Landorus-T and Mega Salamence; it is quite useful for Heatran to hold a Shuca Berry for the former. Solar Beam should be used with Grassium Z to check Water-types such as Tapu Fini and Suicune. Firium Z provides a strong single-target Fire-type attack. The EVs let Heatran survive Landorus-T’s Earthquake with Shuca Berry; use 252 SpA / 252 Spe with another item. Additionally, bulky spreads can be used with speed control such as Tailwind and Trick Room.</p>"},
      "Substitute": {"description": "<p>Substitute is easy for Heatran to set up thanks to its many resistances, and helps it avoid super effective attacks such as Earth Power in the Heatran mirror. Leftovers compensates for the HP lost to Substitute, although Shuca Berry gives Heatran the flexibility to survive attacks such as Landorus-T’s Earthquake without its use. The EVs ensure Landorus-T’s Rock Slide cannot break Heatran’s Substitute. Fake Out users such as Mega Kangaskhan pair well with this set, as they improve its ability to set up Substitute safely. Tapu Bulu’s Grassy Terrain can mitigate damage from Earthquake and recovers the health Heatran loses to Substitute.</p>"}
    },
    "credits": {"writtenBy": [{"username": "Carbonific", "user_id": 233942}], "teams": [{"name": "Quality checked by", "members": [{"username": "Charlotte", "user_id": 159382}]}, {"name": "Grammar checked by", "members": [{"username": "GatoDelFuego", "user_id": 91628}]}]}
  },
  "Aegislash": {
    "sets": {
      "Bulky Attacker": {"description": "<p>Aegislash is one of the best Steel-types in the format thanks to Stance Change shifting it between extreme bulk and offensive at will. Wide Guard is often appreciated given how common spread moves are, but Shadow Sneak can be used if Aegislash's team isn't weak to them or already has a user of the move. Ghostium Z is the preferred item, as it's not reliant on a foe activating it and reduces the damage received from Knock Off. Speed is minimized to reduce the chance Aegislash has of receiving damage in its vulnerable Blade forme after attacking. Hydreigon is a good partner, as it has perfect defensive synergy with Aegislash.</p>"},
      "Substitute": {"description": "<p>Substitute makes a great fit for Aegislash, as it's both difficult to break through in Shield forme and helps Aegislash maintain offensive pressure in its vulnerable Blade forme. A two-attack approach is common, although Ghost having such great neutral coverage allows Flash Cannon to be dropped for utility in the form of Wide Guard or Toxic. Not minimizing Speed is preferred on Substitute Aegislash, as this lets it use Substitute and Toxic before base 60 Speed Pokemon. Fake Out users such as Mega Kangaskhan make good teammates for this set, as they’re able to create opportunities for it to use Substitute.</p>"}
    },
    "credits": {"writtenBy": [{"username": "Carbonific", "user_id": 233942}], "teams": [{"name": "Quality checked by", "members": [{"username": "Charlotte", "user_id": 159382}]}, {"name": "Grammar checked by", "members": [{"username": "GatoDelFuego", "user_id": 91628}]}]}
  },
  "Tapu Koko": {
    "sets": {
      "3 Attacks + Protect": {"description": "<p>Electric Terrain boosting Electric attacks and low defensive stats incentivize Tapu Koko to go for an all-out offensive set, and Electrium Z and Life Orb provide the greatest increase to damage output while letting Tapu Koko retain the ability to switch moves. Volt Switch is useful to switch out of dangerous situations, though Taunt stops speed control such as Tailwind and Trick Room. Dazzling Gleam is quite weak, but is useful in being both a spread and secondary STAB move. Hidden Power Ice primarily takes care of Landorus-T. Pelipper makes for a good teammate, as it can check Grass- and Ground-type foes which care little for Electric attacks.</p>"},
      "Choice Specs": {"description": "<p>Choice Specs maximizes Tapu Koko’s consecutive damage output, allowing Tapu Koko to deal a great deal of damage even when pivoting out with Volt Switch. Dazzling Gleam is often preferred in the third moveslot for providing a STAB spread move, despite being weak. Hidden Power Ice is an alternative for foes such as Landorus-T, although using it disallows the use of Hidden Power Fire to hit the likes of Ferrothorn. Grass Knot has a chance to OHKO troublesome foes such as Tyranitar and Swampert. As this set lacks Protect, Intimidate users such as Landorus-T and Salamence can be valuable to help Tapu Koko remain on the field for longer.</p>"}
    },
    "credits": {"writtenBy": [{"username": "Carbonific", "user_id": 233942}], "teams": [{"name": "Quality checked by", "members": [{"username": "Charlotte", "user_id": 159382}]}, {"name": "Grammar checked by", "members": [{"username": "GatoDelFuego", "user_id": 91628}]}]}
  },
  "Tapu Lele": {
    "overview": "<p>Tapu Lele is a powerhouse in VGC 2018, throwing out extremely powerful Psychic Terrain boosted STAB attacks, and supporting its team by blocking priority with its Terrain (most notably Fake Out, which is extremely useful early in the game). However, Tapu Lele isn't a particularly bulky or fast Pokemon, and it's unable to deal with every Steel-type at once.</p> <p>Below are some sample sets. These sets are likely to be standard, but they will be expanded upon and updated as the metagame progresses.</p>",
    "sets": {
      "Offensive": {
        "description": "<ul> <li>Psychic is Tapu Lele's powerful STAB of choice, while Moonblast deals more damage when Psychic Terrain is gone and smashes through Dark-types.</li> <li>Thunderbolt deals good damage to Celesteela, while Hidden Power Ground slams Heatran. Shadow Ball deals good damage to Aegislash (though watch out for Weakness Policy) and can pick off Mega Metagross under Tailwind or Trick Room. Taunt can be good against Trick Room set up.</li> <li>Psychium Z lets Tapu Lele unleash its powerful Z-Psychic, which is powerful enough to OHKO fast Assault Vest Landorus-T. If you're especially desperate to take out Amoonguss, it also OHKOes through Payapa Berry.</li> <li>Life Orb lets Tapu Lele deal more consistent damage. Most notably, it gives Modest Tapu Lele a 75% chance to OHKO maximum HP Heatran.</li> <li>A Modest nature gives Tapu Lele more power, but a Timid nature is useful for outspeeding Landorus-T that lack a Choice Scarf, and Modest Mega Charizard Y. Bulkier spreads are viable if using Psychium Z.</li> <li>Pay attention to when Psychic Surge comes up against other Pokemon with activation abilities, as this will reveal what Pokemon is faster. This is especially handy for revealing if Landorus-T has a Choice Scarf if using Timid Tapu Lele.</li> <li>Consider pairing Tapu Lele with Pokemon that defeat Steel-types, since Tapu Lele can't cover them all with one moveset. Celesteela, Heatran, Mega Metagross, Aegislash, and Focus Sash Bisharp are important ones to consider defeating.</li> <li>Intimidate support comes in handy to help patch up Tapu Lele's mediocre Defense stat.</li> <li>Mega Metagross deserves special mention as a teammate, since Psychic Terrain gives Zen Headbutt a ton of power, and Psychic Surge reveals if Landorus-T has a Choice Scarf or not.</li> </ul>"
      },
      "Choice Scarf": {"description": "<ul> <li>Choice Scarf allows Tapu Lele to blast through fast threats with Psychic. Moonblast is great for OHKOing Mega Salamence and Hydreigon.</li> <li>Dazzling Gleam gives Tapu Lele a spread attack, which can clean up late game despite being relatively weak.</li> <li>Hidden Power Ground 2HKOes Heatran, while Thunderbolt does reasonable damage against Celesteela.</li> <li>Note that because of how activation abilities work, leading with Tapu Lele will often reveal that it has a Choice Scarf if sent out against slower Pokemon with activation abilities such as Tapu Koko or Choice Scarf Landorus-T.</li> <li>A Timid nature ensures that Tapu Lele outspeeds Jolly Choice Scarf Landorus-T, but a Modest nature does give it more power.</li> <li>Steel-types such as Celesteela, Mega Metagross, and Heatran are especially problematic since Tapu Lele locks itself into moves, so consider pairing Tapu Lele with Pokemon that give them trouble.</li> </ul>"}
    },
    "credits": {"writtenBy": [{"username": "Theorymon", "user_id": 29010}], "teams": [{"name": "Quality checked by", "members": [{"username": "Demantoid", "user_id": 264687}]}]}
  },
  "Tapu Bulu": {
    "sets": {
      "Z-Move": {"description": "<p>Tapu Bulu’s high Attack stat and access to powerful moves in Wood Hammer and Superpower make it well able to fire off exceptionally strong Z-Moves. Even outside of this role, though, Wood Hammer is often Tapu Bulu’s move of choice, as it’s boosted by Grassy Terrain and the recoil is less of an issue thanks to Terrain recovery and the ability to use Horn Leech later in battle. Good teammates are often those that appreciate Grassy Terrain reducing the damage of Earthquake. Heatran and Tyranitar are particularly good examples of this, as they further appreciate the removal of Water-types and Low Kick Mega Kangaskhan.</p>"},
      "Assault Vest": {"description": "<p>Tapu Bulu’s bulk in combination with recovery from Horn Leech and Grassy Terrain makes it an excellent Assault Vest user. The EVs and nature maximize recovery from Grassy Terrain while letting Tapu Bulu take Modest Mega Charizard Y’s Heat Wave and OHKO it back with Rock Slide and outrun uninvested Milotic. Tapu Bulu has limited alternatives for offensive coverage, although Stone Edge is an option over Rock Slide if you’d prefer to trade accuracy for a better chance to OHKO bulky Fire-types. Drizzle Politoed makes a good partner for mitigating Tapu Bulu’s Fire weakness, and Ground-weak allies such as Mega Mawile appreciate Grassy Terrain.</p>"}
    },
    "credits": {"writtenBy": [{"username": "Carbonific", "user_id": 233942}], "teams": [{"name": "Quality checked by", "members": [{"username": "Charlotte", "user_id": 159382}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}]}]}
  },
  "Tapu Fini": {
    "sets": {
      "Calm Mind": {"description": "<p>An immunity to status through Misty Terrain makes Tapu Fini an excellent Calm Mind user. The spread survives Landorus-T’s Tectonic Rage, and OHKOes back with +1 Muddy Water, as well as Timid Tapu Koko’s Thunderbolt. Leftovers and Sitrus Berry are viable alternative items, although rarely heal as much as a 50% Berry does over the course of a battle. Intimidate users such as Mega Salamence and Landorus-T make excellent partners, as they can reduce the damage Tapu Fini receives from physical attackers. The aforementioned Pokemon are also useful in order to check Grass- and Electric-types, respectively, with their STAB moves.</p>"},
      "Choice Specs": {"description": "<p>Choice Specs boosts Tapu Fini’s initially underwhelming damage output to acceptable levels, making it more immediately threatening and reducing the need for support from teammates. This set utilizes a straightforward EV spread and has few alternate move choices; Hydro Pump, Ice Beam, and Haze are all possibilities, but often weaker than those listed on the set. Cresselia makes a good partner, as it appreciates foes like Heatran being removed, and can use Helping Hand to boost Tapu Fini’s damage output further. A Heatran of your own has in common with Cresselia the ability to check Amoonguss, which walls Tapu Fini’s attacks.</p>"}
    },
    "credits": {"writtenBy": [{"username": "Carbonific", "user_id": 233942}], "teams": [{"name": "Quality checked by", "members": [{"username": "Charlotte", "user_id": 159382}]}, {"name": "Grammar checked by", "members": [{"username": "GatoDelFuego", "user_id": 91628}]}]}
  },
  "Cresselia": {
    "sets": {
      "Trick Room": {"description": "<p>Cresselia is one of the bulkiest Trick Room setters and therefore one of the most reliable. Ice Beam is a common coverage move for picking up the OHKO on Landorus-T and Mega Salamence. Alternatively, while Icy Wind might seem paradoxical on a Trick Room set, utilizing them both allows an incredible degree of flexibility in speed control. The last slot is largely filler; Helping Hand is generally useful, Hidden Power Ground hits troublesome Steel-types like Heatran, and Toxic deals with bulky foes like Porygon2. Psychium Z allows the use of Z-Trick Room to stop Taunt, or a big attack in Z-Psychic, and also limits damage from Knock Off.</p>"},
      "Calm Mind": {"description": "<p>Calm Mind remains a strong option despite an uptake in the use of Toxic. Psychic is the preferred STAB move for its superior power, but Psyshock allows Cresselia to hit more specially defensive foes hard. The given nature and EVs aim to maximize Cresselia’s mixed walling capabilities, although a spread such as 244 HP / 108 Def / 68 SpA / 4 SpD / 84 Spe can be adopted to help beat foes such as Mega Salamence by outspeeding and 2HKOing Adamant variants with Icy Wind and making Jolly Salamence’s Double-Edge a 3HKO. Mega Charizard Y makes a good partner to deal with Steel-types and boost the healing of Moonlight with sun.</p>"}
    },
    "credits": {"writtenBy": [{"username": "Carbonific", "user_id": 233942}], "teams": [{"name": "Quality checked by", "members": [{"username": "Charlotte", "user_id": 159382}]}, {"name": "Grammar checked by", "members": [{"username": "GatoDelFuego", "user_id": 91628}]}]}
  },
  "Venusaur": {
    "sets": {
      "Venusaurite": {"description": "<p>After Mega Evolving, Mega Venusaur gains exceptional defensive stats and an ability that indirectly removes two of its weaknesses in Thick Fat, making it a great late-game wincon once its checks have been removed early-game. The given EVs allow it to survive two Life Orb-boosted Earthquakes from Landorus-T and Mega Gardevoir’s Psychic, maximize the benefit of a Modest nature, and let it outspeed base 130s under Tailwind. Removing threats like Tapu Lele and Mega Salamence is key to Mega Venusaur’s survival, so Steel-types such as Aegislash and Heatran are immensely helpful in this respect.</p>"},
      "Sun Attacker": {"description": "<p>Chlorophyll Venusaur outpaces the entire unboosted metagame when paired with Drought Mega Charizard Y. Grass Pledge is an option when Mega Charizard Y is using Fire Pledge, as their combined use creates a sea of fire that removes 12.5% of both foes’ health for four turns. That said, Energy Ball is the more flexible alternative. Sleep Powder is great support, albeit inaccurate and stopped by Electric and Misty Terrain. Hidden Power Ice lets Venusaur check foes such as Landorus-T and Mega Salamence, which sun teams typically have issues with. Venusaur struggles against Heatran, so ensure you have a check to it such as Landorus-T or Terrakion.</p>"}
    },
    "credits": {"writtenBy": [{"username": "Carbonific", "user_id": 233942}], "teams": [{"name": "Quality checked by", "members": [{"username": "Charlotte", "user_id": 159382}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}]}]}
  },
  "Charizard": {
    "overview": "<p>Mega Charizard Y is a dangerous spread attacker, dealing massive damage with Sun-boosted Heat Waves. Unlike most Fire-types, Water-types have trouble with Mega Charizard Y because of Drought and Solar Beam. However, Mega Charizard Y heavily relies on the sun to deal damage, and it has an unfortunate weakness to Electric-type attacks, and a 4x weakness to the ever common Rock Slide.</p> <p>Below is a sample set. This set is likely to be the standard, but it will be expanded upon and updated as the metagame progresses.</p>",
    "sets": {
      "Drought Attacker": {
        "description": "<ul> <li> <p>Heat Wave is Mega Charizard Y's powerful spread attack, while Solar Beam has no charge up turn under the sunlight, letting Mega Charizard Y slam Water-types like Rotom-W and Milotic.</p> </li> <li> <p>Overheat is insanely powerful, OHKOing threats such as Tapu Lele and fast Assault Vest Landorus-T, though at the cost of halving Special Attack. Flamethrower can be used if Mega Charizard Y just needs to OHKO regular Landorus-T.</p> </li> <li> <p>Hidden Power Ground is Mega Charizard Y's best way around Heatran, 2HKOing bulky varients at worst, and OHKOing fast offensive Heatran.</p> </li> <li> <p>Modest gives Mega Charizard Y the most power, but Timid can be used to outspeed Jolly Landorus-T and Timid Tapu Lele.</p> </li> <li> <p>If Politoed, Pelipper, Tyranitar, or Alolan Ninetales are seen in team preview, consider holding off on Mega Evolving right away, since if these switch in at the right time, Mega Charizard Y becomes much easier to check, especially if Pelipper or Politoed bring the rain.</p> </li> <li> <p>Rock Slide is a serious problem for Mega Charizard Y. Consider Intimidate support to help it take weaker ones at least once. Wide Guard support can work well too, letting Mega Charizard Y stay in the field in the face of Rock Slide.</p> </li> <li> <p>Mega Charizard Y also hates Electric-type Pokemon such as Tapu Koko and Thundurus. While Lightning Rod support can be helpful, it doesn't stop Discharge. Consider bringing Electric-type resistances to switch into.</p> </li> <li> <p>Mega Charizard Y does great with Pokemon that use Earthquake thanks to its Ground-type immunity, and it also helps out against Water-types thanks to Drought and Solar Beam.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "Theorymon", "user_id": 29010}], "teams": [{"name": "Quality checked by", "members": [{"username": "Charlotte", "user_id": 159382}]}]}
  },
  "Raichu": {
    "overview": "<ul> <li> <p>Despite its underwhelming stats, Raichu possesses a solid niche in VGC due to its expansive pool of support options and access to Lightning Rod, which lets it be an excellent support partner for Water-types like Tapu Fini and Pelipper and Flying-types like Mega Charizard Y.</p> </li> <li> <p>Raichu's good Speed allows it to quickly disrupt foes in various ways with support moves like Fake Out and Encore, letting its teammates safely set up boosts or Tailwind reliably.</p> </li> <li> <p>These near-exclusive traits set Raichu apart from other Lightning Rod users like Mega Manectric, Alolan Marowak, and Togedemaru.</p> </li> <li> <p>While Raichu easily handles any relevant Electric-types thanks to Lightning Rod, its horrid bulk leaves it unable to reliably take hits without relying on Focus Sash or its teammates' Intimidate. The fact that Raichu has a hard time justifying Protect in its moveset further worsens its problem with survivability.</p> </li> <li> <p>Raichu's offensive presence is meager, as it struggles to deal significant damage without resorting to a Z-Move and struggles to effectively deal with common Electric-type checks. Therefore, Raichu functions the best when running a dedicated support set.</p> </li> </ul>",
    "sets": {
      "Fast Utility": {
        "description": "<ul> <li> <p>Raichu's superb Speed stat makes it one of the fastest Fake Out users, and it can provide its teammate a turn to safely make a move.</p> </li> <li> <p>Encore locks a foe into the same move for three turns, potentially forcing them to repeatedly use an unfavorable move or switch out.</p> </li> <li> <p>Thunderbolt is the strongest STAB move, while Volt Switch is slightly weaker but can be used to take advantage of forced switches and generate momentum.</p> </li> <li> <p>Hidden Power Ice targets Landorus-T, but note that unboosted Hidden Power Ice is too weak to OHKO Landorus-T from full HP.</p> </li> <li> <p>Protect guards Raichu from attacks for a turn and let its teammates handle a problematic foe.</p> </li> <li> <p>Feint breaks foes' Protect or Detect, leaving them vulnerable to Raichu's teammates. It also proves to be useful with breaking Focus Sashes and securing the success of a Z-Move.</p> </li> <li> <p>Nuzzle paralyzes non-Ground- and Electric-type foes and reduces their Speed, leaving them vulnerable to slower and powerful attackers like Incineroar and Landorus-T.</p> </li> <li> <p>Focus Sash allows Raichu to survive a potential KO and generally aids it by improving its chances of survivability. Electrium Z can be used to provide Raichu with more offensive presence by letting it use Gigavolt Havoc. While the damage output may not seem great at a first glance, Gigavolt Havoc is capable of doing massive damage after teammates like Tapu Koko used Discharge to activate Raichu's Lightning Rod.</p> </li> <li> <p>Ensure that Raichu is providing sufficient support for its teammates. This means Fake Out should be used against problematic foes in the beginning and faster threats and Choice Scarf users should be taken down or crippled by Nuzzle. Scouting a foe with Protect and locking them into a wrong move with Encore can also provide good setup opportunities for Raichu's teammates.</p> </li> <li> <p>Pokemon that are weak to Electric-type moves, such as Mega Charizard Y, Gyarados, Braviary, and Pelipper, can be paired with Raichu due to its Lightning Rod. They also can switch into Ground-types aimed at Raichu thanks to their immunity to Ground. Tapu Fini and Azumarill also appreciate Lightning Rod.</p> </li> <li> <p>Various Pokemon with setup options can take advantage of free turns that Raichu generates with Fake Out, Encore, and even full paralysis after Nuzzle. Setup sweepers like Mega Salamence and Gyarados can set up without fearing Electric-type moves while discouraging Earthquake from foes, while slower threats like Incineroar can effectively combat faster foes after Raichu paralyzes them.</p> </li> </ul>"
      },
      "Bulky Utility": {
        "description": "<ul> <li> <p>Raichu's high Speed allows it to make other Fake Out users like Incineroar and Mega Kangaskhan flinch. Fake Out's general utility proves to be useful for Raichu's teammate, as they gain a free turn to safely set up.</p> </li> <li> <p>Nuzzle paralyzes non-Ground- and Electric-type foes, crippling their Speed. Electroweb is an alternative option to provide a general speed control against two foes at the same time, and it can provide speed control even when Misty Terrain is active. Both of them are viable utilities for Raichu to utilize as support options, and they can't be prevented with Taunt.</p> </li> <li> <p>Volt Switch lets Raichu pivot out and switch to another teammate and preserve momentum.</p> </li> <li> <p>Feint removes the effect of Protect and Detect from a foe, leaving them vulnerable to Raichu's teammates. Especially if Raichu's teammate is a Z-Move user, Feint helps ensuring that a foe will take massive damage from Z-Move after their protection is broken.</p> </li> <li> <p>Knock Off rids foes of an item, and it is useful for getting rid of foes' items and scouting possible Z-Crystals. Ridding foes like Cresselia, Gastrodon, and Tapu Fini of their item and removing pinch Berries also greatly reduces their longevity and overall defensive presence.</p> </li> <li> <p>This set is dedicated to make Raichu as bulky as possible with an Assault Vest and heavy investment in HP. The given EV spread allows Raichu to survive -1 Adamant Mega Kangaskhan's Double-Edge from full HP, survive Ludicolo's rain-boosted Hydro Vortex, and avoid the 2HKO from Timid Mega Charizard Y's Heat Wave. 76 Speed EVs and a Timid nature allow Raichu to outspeed neutral-natured base 100 Speed Pokemon.</p> </li> <li> <p>Pokemon like Mega Charizard Y, Tapu Fini, Gyarados, and Pelipper enjoy Raichu's Lightning Rod and ability to render the likes of Tapu Koko and Zapdos ineffective. They also notably force Ground-types like Landorus-T to refrain from using their STAB moves.</p> </li> <li> <p>Practically any Pokemon with mediocre Speed appreciates Raichu's useful speed control and Fake Out that improves their matchup against faster foes. Tailwind setters and setup sweepers also enjoy the various utility options Raichu can provide. Slower and bulkier Pokemon like Incineroar and Landorus-T can take advantage of Raichu's speed control and hindrance of various physical walls, while Mega Salamence and Gyarados can have significantly better setup conditions with Raichu's support. Their Intimidate also improves Raichu's durability further by compensating for Raichu's pitiful Defense stat, while Assault Vest improves Raichu's matchup against special attackers.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "Lotus", "user_id": 434601}], "teams": [{"name": "Quality checked by", "members": [{"username": "Carbonific", "user_id": 233942}, {"username": "Darkmalice", "user_id": 23736}]}, {"name": "Grammar checked by", "members": [{"username": "Fireflame", "user_id": 231476}]}]}
  },
  "Clefairy": {"sets": {"Support": {"description": "<p>Friend Guard Clefairy has a niche as a redirector in its ability to reduce the damage its partner receives from spread damage. The EVs make Timid Mega Charizard Y’s Heat Wave and Landorus-T’s Earthquake a 3HKO. Icy Wind is a good speed control option, although Trick Room teams can make use of After You thanks to Clefairy’s low Speed. Heal Pulse is often chosen for its synergy with Friend Guard, especially on PerishTrap teams, where Shadow Tag Mega Gengar and Gothitelle must remain healthy to maintain the trap. Setup sweepers such as Quiver Dance Volcarona and Dragon Dance Mega Salamence also appreciate Clefairy.</p>"}}, "credits": {"writtenBy": [{"username": "Carbonific", "user_id": 233942}], "teams": [{"name": "Quality checked by", "members": [{"username": "Charlotte", "user_id": 159382}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}]}]}},
  "Ninetales-Alola": {
    "overview": "<ul> <li> <p>Alolan Ninetales boasts the ability to check popular metagame titans like Landorus-T, Mega Salamence, Pelipper, Ludicolo, and Gastrodon.</p> </li> <li> <p>Furthermore, having the combination of Aurora Veil and Snow Warning enables it to easily support its team by reducing the damage done to them. This may be useful to make walls like Celesteela even harder to take down or to make it even easier for Pokemon like Snorlax to set up.</p> </li> <li> <p>Although Alolan Ninetales checks multiple common Pokemon, it is also checked by many common Pokemon, including Aegislash, Mega Charizard Y, and Tyranitar. Furthermore, the latter two can easily change the weather, making it harder for Alolan Ninetales to set up Aurora Veil.</p> </li> <li> <p>A mediocre Special Attack stat makes it difficult for Alolan Ninetales to do much damage to any Pokemon it doesn't hit super effectively.</p> </li> </ul>",
    "sets": {
      "Hail Setter": {
        "description": "<ul> <li> <p>Blizzard is Alolan Ninetales's go-to STAB move, never missing in hail and dealing damage to both opposing Pokemon.</p> </li> <li> <p>Freeze-Dry allows Alolan Ninetales to deal super effective damage to Water-type Pokemon, a trait that is especially handy against Pelipper, Ludicolo, and Gastrodon. Furthermore, as it's a single-target move, it gives Alolan Ninetales a move to use when faced against Wide Guard.</p> </li> <li> <p>Aurora Veil gives Alolan Ninetales and its teammates damage reduction against both physical and special attacks, improving their staying power.</p> </li> <li> <p>Protect allows Alolan Ninetales to protect itself from attacks like Mega Metagross's Iron Head and Aegislash's Flash Cannon while its teammate takes care of these Pokemon.</p> </li> <li> <p>Icy Wind allows Alolan Ninetales to provide speed control for its team, making it an option if its team struggles to find a place to put speed control.</p> </li> <li> <p>Alolan Ninetales can also make use of Encore to lock foes into status moves like Substitute and Protect and potentially force switches.</p> </li> <li> <p>Alolan Ninetales should run an EV spread of 4 HP / 252 SpA / 252 Spe with a Timid nature, as it needs as much power and speed as it can get. Furthermore, defensive investment is unlikely to prove beneficial, given its subpar bulk sans Aurora Veil.</p> </li> <li> <p>Snow Warning is obligatory, seeing as hail enables the use of Aurora Veil and turns Blizzard into a reliable attack.</p> </li> <li> <p>Focus Sash is the preferred item on Alolan Ninetales, given that it enables it to survive attacks it wouldn't otherwise take, including Kartana's Smart Strike and Mega Metagross's Iron Head.</p> </li> <li> <p>Light Clay extends the duration of Aurora Veil from five turns to eight turns. This may be considered on more defensively oriented and setup-focused teams that can truly reap the benefits of an extended duration of Aurora Veil.</p> </li> <li> <p>As Aurora Veil enhances the bulk of Alolan Ninetales and its teammates, it makes Alolan Ninetales a solid consideration on teams that use setup Pokemon like Snorlax and Calm Mind Tapu Fini or rock-solid defensive Pokemon like Celesteela and Ferrothorn.</p> </li> <li> <p>Given Alolan Ninetales's vulnerability to Steel-type Pokemon like Celesteela and Aegislash, it should be paired with Fire- and Ground-type Pokemon like Landorus-T, Heatran, and Volcarona that can take care of them.</p> </li> <li> <p>Since Mega Charizard Y and Tyranitar are both difficult for Alolan Ninetales, given their ability to completely block Aurora Veil, lower Blizzard's accuracy, and OHKO it altogether, it is a good idea to use Pokemon like Landorus-T and Terrakion with it—the former should be used with Choice Scarf and Rock Slide to even be considered a check to Mega Charizard Y, though.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "Adamant Zoroark", "user_id": 102162}], "teams": [{"name": "Quality checked by", "members": [{"username": "Carbonific", "user_id": 233942}, {"username": "Charlotte", "user_id": 159382}]}, {"name": "Grammar checked by", "members": [{"username": "Fireflame", "user_id": 231476}]}]}
  },
  "Marowak-Alola": {
    "overview": "<ul> <li> <p>Alolan Marowak, despite being overshadowed by other Fire-types such as Heatran and Incineroar as well as other Lightning Rod users such as Manectric and Raichu, finds its niche in dishing out heavy damage under Trick Room while providing Lightning Rod support.</p> </li> <li> <p>Thick Club combined with decent coverage lets Alolan Marowak use strong attacks on the entire metagame</p> </li> <li> <p>Its Ghost typing allows it to be a pseudo-counter to Gothitelle + Snorlax and Cresselia + Snorlax, the most common Trick Room compositions.</p> </li> <li> <p>Its defensive stats are not terrible, but they result in Alolan Marowak often being knocked out, and it relies on Snarl to survive many special attacks</p> </li> <li> <p>Choice Specs Tapu Fini and Landorus-T can heavily threaten Alolan Marowak with spread moves</p> </li> <li> <p>Although Alolan Marowak is Trick Room reliant to get massive damage off, it is still undersped by notable threats such as Amoonguss, Mega Camerupt, and Snorlax</p> </li> <li> <p>Alolan Marowak lacks item flexibility; without Thick Club, Alolan Marowak's damage becomes laughable, so it is very weak to Knock Off</p> </li> </ul>",
    "sets": {
      "Offensive Lightning Rod": {
        "description": "<ul> <li> <p>Flare Blitz is incredibly powerful, netting KOs on most super effective targets such as Metagross, Celesteela, Ferrothorn, Aegislash, and Amoonguss, even at -1</p> </li> <li> <p>Shadow Bone provides coverage, threatens Cresselia, Tapu Lele, and Gothitelle, and is especially useful against Aegislash because Shadow Bone is a non-contact move, thus avoiding King's Shield Attack drop</p> </li> <li> <p>Low Kick allows Alolan Marowak to knock out Pokemon such as Tyranitar, Heatran, Kangaskhan, and Snorlax that might otherwise wall it</p> </li> <li> <p>Bonemerang nets KOs on Shuca Berry Heatran and also breaks Focus Sash. However, Low Kick is a better option in most cases</p> </li> <li> <p>An EV spread of 236 HP / 28 Atk / 4 Def / 236 SpD with a Sassy nature allows Alolan Marowak to still guarantee KOs on bulky Aegislash, Celesteela, and Metagross with Flare Blitz and survive maximum Attack Landorus-T's Earthquake, maximum Attack Tyranitar's Crunch, fully invested Aegislash's Shadow Ball, and Life Orb Tapu Lele's Psychic under Psychic Terrain. However, after taking these attacks, Alolan Marowak will likely faint due to Flare Blitz recoil or weather damage, so be careful</p> </li> <li> <p>Tapu Fini is almost a requirement for Alolan Marowak, as Misty Terrain prevents Amoonguss from completely neutering Alolan Marowak with Spore. Tapu Fini also threatens Incineroar, Landorus-T, and Scrafty, three of Alolan Marowak's least favorite matchups</p> </li> <li> <p>Alolan Marowak benefits enormously from Trick Room setters such as Cresselia and Porygon2, as they cover weaknesses to Landorus-T and allow Alolan Marowak to take advantage of its low Speed stat. Porygon2 can also Ally Switch Ghost moves and Z-Moves away from Alolan Marowak</p> </li> <li> <p>Bulkier Alolan Marowak sets especially love partnering with Landorus deterrents such as Porygon2 and Milotic, as much of their Attack investment has been traded for added bulk</p> </li> <li> <p>It is generally not a good idea to lead with Alolan Marowak, as having it hidden away from opponents provides extra pressure and dissuades them from using Electric-type attacks</p> </li> <li> <p>In general, Alolan Marowak should always be the third or fourth Pokemon you select, switching in only to redirect Electric moves, receive hefty Snorlax Returns, or resist Fairy, Ice, and Fire attacks. However, against Trick Room teams, Alolan Marowak can be led immediately to put pressure on Trick Room setters and sweepers from turn one.</p> </li> <li> <p>Because of Alolan Marowak's immunity to both Electric and Normal, as well as resisting Fairy and Fire, you can switch it safely into common Pokemon such as Tapu Koko, Snorlax, Heatran, and Mega Charizard Y</p> </li> <li> <p>Take note that Mega Charizard Y still does hefty damage with sun-boosted Fire-type moves, especially if you are not running bulky Alolan Marowak</p> </li> <li> <p>Against the popular pairing of Zapdos and Landorus-T, it is generally not a good idea to switch Alolan Marowak in, as the opponent can freely click Earthquake. However, if you are setting up Trick Room on the same turn, Alolan Marowak can tank the Earthquake and begin pressuring both Landorus-T and Zapdos the following turn or sweeping.</p> </li> <li> <p>Alolan Marowak also matches up poorly against sand teams; however, with Trick Room up, Alolan Marowak can easily KO Tyranitar and Excadrill with Low Kick.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "ansena", "user_id": 372170}], "teams": [{"name": "Quality checked by", "members": [{"username": "Jio", "user_id": 22788}, {"username": "Carbonific", "user_id": 233942}]}, {"name": "Grammar checked by", "members": [{"username": "Fireflame", "user_id": 231476}]}]}
  },
  "Kangaskhan": {"sets": {"All-out Attacker": {"description": "<p>This set intends to maximize the benefit of Parental Bond in becoming as immediately threatening as possible. Consequently, a spread of 252 Atk / 252 Spe and using Double-Edge is the most common approach, although utilising a bulkier spread with Frustration is an option. For example, 164 HP / 228 Atk / 116 Spe outspeeds positive-natured base 70s and ensures Low Kick OHKOes foes such as Heatran and Hydreigon. This can be taken further with 228 HP / 228 Atk / 28 Def / 4 SpD / 20 Spe, which outpaces neutral base 70s and survives attacks such as Landorus-T’s Tectonic Rage and Choice Specs Hydreigon’s Draco Meteor.</p>"}}, "credits": {"writtenBy": [{"username": "Carbonific", "user_id": 233942}], "teams": [{"name": "Quality checked by", "members": [{"username": "Charlotte", "user_id": 159382}]}, {"name": "Grammar checked by", "members": [{"username": "GatoDelFuego", "user_id": 91628}]}]}},
  "Snorlax": {
    "overview": "<ul> <li> <p>With a low base Speed of 30 that makes it one of the slowest Pokemon in VGC, Snorlax functions very well under Trick Room both as a Trick Room sweeper and against opposing Trick Room teams. It notably Speed ties with Amoonguss.</p> </li> <li> <p>With base defenses of 160 / 65 / 110 and the combination of Gluttony, Wiki Berry, and Recycle, it is very bulky and often requires a lot of effort to KO. Though its lower Defense can be exploited, it can be mitigated somewhat by supporting Snorlax with an Intimidate user like Landorus-T or Incineroar.</p> </li> <li> <p>Snorlax can either threaten OHKOs on most of the metagame after a single Belly Drum or opt for a slower boosting but harder to take down set utilizing Curse, often letting Snorlax function as a team's wincon.</p> </li> <li> <p>Many teams have moves that prevent setup sweepers (including Snorlax) from setting up, such as Taunt, Haze, Roar, and Clear Smog, or Knock Off, which removes Snorlax's Berry and renders Recycle useless. Due to this, and its low Speed, Snorlax often needs support such as Trick Room, Fake Out and/or redirection moves to truly shine.</p> </li> <li> <p>Snorlax is reliant on a coverage move such as High Horsepower or Fire Punch to break through specific Pokemon, most notably Ghost-type Pokemon such as Aegislash. The choice of coverage move (or lack thereof) can lead it to being checked by certain Pokemon, such as Kartana and Drifblim without Fire Punch and Tyranitar and Heatran without High Horsepower.</p> </li> </ul>",
    "sets": {
      "DrumLax": {
        "description": "<ul> <li> <p>Belly Drum lets Snorlax OHKO most of the metagame after a boost. Return is the basic STAB move that Snorlax will be attacking with a majority of the time. High Horsepower and Fire Punch hit the Ghost-types that it otherwise wouldn't be able to touch like Mega Gengar and Aegislash and OHKO many Pokemon that resist its Normal STAB attacks at +6 like Mega Metagross. After Belly Drum, High Horsepower OHKOes Tyranitar and even Shuca Berry Heatran, whilst Fire Punch OHKOes Drifblim, non-Focus Sash Kartana, Celesteela, and Ferrothorn. High Horsepower is generally preferred over Fire Punch, as it has better neutral coverage alongside Return.</p> </li> <li> <p>Protect is a strong option to allow Snorlax to stall while a teammate either sets Trick Room or sets up board position or for protection against a predicted Z-Move. Typically Protect should not be dropped in most cases unless you have redirection and Fake Out support to help set up Snorlax. Recycle, bringing back Wiki Berry, effectively functions as a 50% HP recovery move and can be used to take advantage of opposing passive play or when both the opposing Pokemon do little to threaten Snorlax.</p> </li> <li> <p>The combination of Wiki Berry and Gluttony enables Snorlax to immediately regain the 50% HP lost from using Belly Drum, preserving its bulk. Wiki Berry is chosen over other 50%-healing Berries to confuse potential Adamant Bug Bite users like Mega Scizor.</p> </li> <li> <p>The EVs and nature focus on Snorlax's weaker physical bulk whilst providing an even HP number so that Wiki Berry activates after using Belly Drum and ensuring that Tapu Lele's Shattered Psyche cannot OHKO Snorlax in Psychic Terrain. Even with only 4 Attack EVs, Snorlax will OHKO all but the bulkiest of Pokemon and those that resist its STAB attacks—in fact, 252 HP / 4 Def Cresselia has a 62.5% chance to be OHKOed by Return! Minimum Speed makes Snorlax faster under Trick Room.</p> </li> <li> <p>Snorlax can switch in either on weak hits or after a KO, or it can be used as a lead. It should only use Belly Drum if the user feels confident it can then sweep the opposing team (usually mid- or late-game); otherwise, it is safer to either deal chip damage to the opponent with its attacking moves or switch it out and attempt to sweep later.</p> </li> <li> <p>Strong teammates including Trick Room setters such as Cresselia, Gothitelle, and Mimikyu for speed control, Intimidate users such as Landorus-T, Incineroar, and Mega Manectric to mitigate its weaker Defense stat, Fake Out or redirection users such as Incineroar, Amoonguss, and Clefairy to help set up, and Tapu Fini to provide status protection through Misty Terrain.</p> </li> </ul>"
      },
      "CurseLax": {
        "description": "<ul> <li> <p>Curse Snorlax requires less support from the rest of the team than DrumLax, as it does not sacrifice its HP to boost its Attack and also boosts its Defense in the process. However, it is more susceptible to opposing Pokemon's Intimidate lowering its Attack stat and may need multiple boosts before it has sufficient Attack to sweep your opponent. This set trades power for not having to be as committed to setting up as Belly Drum Snorlax.</p> </li> <li> <p>Double-Edge is preferred over Return for the higher damage. With Curse boosting Defense without cutting Snorlax's HP, the recoil isn't as harmful as on a DrumLax set. Return is still viable as a non-recoil STAB attack, however. High Horsepower and Fire Punch both offer useful coverage against Pokemon that resist or are immune to Snorlax's STAB move. High Horsepower is generally preferred over Fire Punch, as it deals more damage against targets weak to both moves like Mega Metagross. High Horsepower is better against Mega Gengar, Tyranitar, and Heatran, whilst Fire Punch is better against Kartana, Celesteela, and Drifblim. Recycle takes advantage of the Defense boosts and helps Snorlax set up multiple Curses.</p> </li> <li> <p>The EVs give Double-Edge a near-guaranteed 2HKO on 236 HP / 116 Def Zapdos without a Curse boost and then maximize its weaker Defense stat. Curselax does not need to run as much Defense investment as DrumLax because of Curse enabling more Attack investment. Minimum Speed is preferred to make Snorlax as slow as possible under Trick Room.</p> </li> <li> <p>Gluttony and Wiki Berry enable an automatic 50% HP recovery when Snorlax loses half its HP, which can be reactivated with Recycle.</p> </li> <li> <p>Snorlax should attempt to sweep mid- to late-game when its threats have been weakened or removed, coming in either after a free switch or on a weak attack like Cresselia's Ice Beam. Afterwards it should usually set up Curse once or twice to boost its stats before attempting to sweep, using Recycle as needed after Wiki Berry has been used to bring it back.</p> </li> <li> <p>This Snorlax requires less team support than Belly Drum Snorlax. However, it still benefits from Trick Room setters such as Cresselia and Gothitelle, and Tapu Fini, which protects Snorlax from status with Misty Terrain, in particular burn and poison. Incineroar threatens Kartana, which can bypass Snorlax's Curse boosts with Sacred Sword, and can switch into Tapu Lele's Shattered Psyche (which in Psychic Terrain threatens an OHKO on Snorlax), whilst providing Fake Out and Intimidate support to help Snorlax set up.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "Bright Size", "user_id": 327904}, {"username": "Darkmalice", "user_id": 23736}], "teams": [{"name": "Quality checked by", "members": [{"username": "Jio", "user_id": 22788}, {"username": "Carbonific", "user_id": 233942}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}]}]}
  },
  "Zapdos": {
    "overview": "<ul> <li> <p>Thanks to its above-average bulk and decent Speed, Zapdos is one of the best Tailwind setters in VGC.</p> </li> <li> <p>Zapdos's typing is pretty good defensively, leaving it with some good resistances and immunity to Ground-type attacks. Unfortunately, Zapdos has a weakness to the very common Rock Slide.</p> </li> <li> <p>It can survive strong neutral attacks such as Mega Kangaskhan's Double-Edge, super effective hits such as Mega Tyranitar's Rock Slide, and even some Z-Moves like Incineroar's Malicious Moonsault, but it is unable to take on any stronger attacks.</p> </li> <li> <p>Pressure allows Zapdos to leech PP from low-PP moves such as Tapu Bulu's Stone Edge.</p> </li> <li> <p>On the offensive side, Zapdos faces competition from faster and stronger Pokemon like Thundurus-T, Mega Manectric, and Tapu Koko. Zapdos sets itself apart from them with its bulk, and, unlike Mega Manectric, Zapdos doesn't use a Mega slot.</p> </li> </ul>",
    "sets": {
      "Offensive Tailwind": {
        "description": "<ul> <li> <p>Tailwind doubles your team's Speed for three turns. It helps Pokemon with mediocre Speed outspeed faster foes.</p> </li> <li> <p>Thunderbolt is the STAB move, hitting Water- and Flying-types such as Politoed and Celesteela.</p> </li> <li> <p>Hidden Power Ice hits Landorus-T and Mega Salamence hard.</p> </li> <li> <p>Detect allows Zapdos to survive strong attacks and double targets. Heat Wave is a spread move that hits Grass-types, especially Ferrothorn, hard.</p> </li> <li> <p>Electrium Z is necessary for the powerful 175-Base Power Gigavolt Havoc, which has a big chance to OHKO +1 Tapu Fini with some chip damage.</p> </li> <li> <p>The given EV spread with Modest nature gives Zapdos much offensive presence. With this spread, Zapdos OHKOes uninvested Landorus-T and usually OHKOes Naive Mega Salamence with Hidden Power Ice, while it survives Jolly Mega Metagross's Zen Headbutt under Psychic Terrain and Timid Mega Charizard Y's sun-boosted Flamethrower. A Timid nature with 4 Def / 252 SpA / 252 Spe also can be used, as it Speed ties with other positive-nature base 100s like Mega Charizard Y and 2HKOes no-bulk Mega Metagross with Heat Wave, though with this EV spread Zapdos loses a lot of bulk.</p> </li> <li> <p>You should use Zapdos either early- or mid-game to provide speed control for your team. Leading with Zapdos is fine because it brings Zapdos onto the field safely.</p> </li> <li> <p>Don't overrate Zapdos's bulk; switch it out from possible super effective moves or Z-Moves. Alternatively, use Detect.</p> </li> <li> <p>Zapdos appreciates Wide Guard support because it is weak to the multi-target Rock Slide. Aegislash is decent teammate because it can provide Wide Guard support and switch into Rock-type attacks. In return, Zapdos can freely switch into Ground-type attacks.</p> </li> <li> <p>Fake Out support from the likes of Incineroar and Scrafty helps Zapdos to setup Tailwind more easily.</p> </li> <li> <p>Steel-types such as Mega Metagross and Kartana work with Zapdos well because they threaten Tyranitar, one of the best Zapdos counters. Zapdos can take on Water-types such as Tapu Fini and switch into Ground-type attacks. These Pokemon also appreciate the speed control provided by Tailwind.</p> </li> </ul>"
      },
      "Terrain Abuser": {
        "description": "<ul> <li> <p>Tailwind provides speed control for your team for three turns.</p> </li> <li> <p>Thunderbolt hits Flying- and Water-types like Celesteela and Tapu Fini.</p> </li> <li> <p>Hidden Power Ice with Thunderbolt provides good coverage. It hits Mega Salamence and Landorus-T for a large amount of damage. Heat Wave is a spread move that hits Grass-types such as Amoonguss harder than Hidden Power Ice.</p> </li> <li> <p>Roost increases Zapdos's longevity and allows it to stay on the field for more time.</p> </li> <li> <p>Misty Seed and Psychic Seed increase Zapdos's special bulk by one stage in Misty and Psychic Terrain, respectively.</p> </li> <li> <p>The given EV spread with the Modest nature allows Zapdos to survive Tapu Lele's Shattered Psyche in Psychic Terrain when Zapdos's Seed is activated and outpace +1 base 100s under Tailwind. Also, Zapdos 2HKOes most standard variants of Tapu Fini with Thunderbolt.</p> </li> <li> <p>You must be careful with switches because Terrain Seeds are consumed after activating, and without a Special Defense boost, Zapdos loses a lot of special bulk. Before bringing Zapdos into the field with the Terrain that activates its Seed, you should eliminate or weaken Pokemon that can force it out.</p> </li> <li> <p>You must have Tapu Lele or Tapu Fini in your team, depending on Zapdos's Seed.</p> </li> <li> <p>Steel-types such as Kartana and Mega Metagross can take on Pokemon that are very threatening to Zapdos such as Tyranitar, while Zapdos freely switches into Ground-type attacks for them. Mega Metagross is particularly useful if you run Psychic Seed Zapdos, as Psychic Terrain will strengthen Mega Metagross's Zen Headbutt alongside with activating Zapdos's Psychic Seed.</p> </li> <li> <p>Intimidate support from the likes of Incineroar, Scrafty, and Landorus-T helps Zapdos to take on physical attacks more easily. Scrafty deserves a special mention because it provides both Fake Out and Intimidate support and threatens Tyranitar.</p> </li> </ul>"
      },
      "Bulky Tailwind": {
        "description": "<ul> <li> <p>Tailwind helps Zapdos's teammates to outspeed many foes for three turns.</p> </li> <li> <p>Thunderbolt is the strongest of Zapdos's attacks and hits Water- and Flying-types.</p> </li> <li> <p>Hidden Power Ice gives Zapdos coverage for Landorus-T and Mega Salamence, while the multi-target Heat Wave helps Zapdos to knock out Grass- and Steel-types like Mega Metagross and Ferrothorn.</p> </li> <li> <p>Roost heals half of Zapdos's HP, increasing its longevity. Detect helps to reveal opposing Pokemon's moves and allows Zapdos to survive double targeting.</p> </li> <li> <p>Wiki Berry and Sitrus Berry heal 50% or 25% when Zapdos is at 25% or 50%, respectively. Wiki Berry is  generally more useful because it restores more HP, but Sitrus Berry is less risky.</p> </li> <li> <p>The given EV spread with a Calm nature enables Zapdos to be 3HKOed by Adamant Landorus-T's Rock Slide, survive Ludicolo's rain-boosted Hydro Vortex 15 out of 16 times, and outspeed +1 base 100s under Tailwind. Alternatively, a Modest nature can be used for more power in exchange for special bulk.</p> </li> <li> <p>This Zapdos set is good for teams that don't wish to rely on a Seed or that don't have place for Tapu Fini or Tapu Lele.</p> </li> <li> <p>Steel-types are good teammates. Aegislash and Celesteela provide additional utility in Wide Guard, which protects Zapdos from Rock Slide and other multi-target moves.</p> </li> <li> <p>Intimidate and Fake Out support from the likes of Incineroar, Scrafty, and Hitmontop is appreciated by Zapdos, as it helps Zapdos to survive more physical attacks and set up Tailwind.</p> </li> <li> <p>Tyranitar can be a good teammate for Zapdos because they cover each other's weaknesses pretty well.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "Egor", "user_id": 439341}], "teams": [{"name": "Quality checked by", "members": [{"username": "Jio", "user_id": 22788}, {"username": "Carbonific", "user_id": 233942}]}, {"name": "Grammar checked by", "members": [{"username": "P Squared", "user_id": 168392}]}]}
  },
  "Azumarill": {
    "sets": {
      "Belly Drum": {"description": "<p>Azumarill is the only viable Pokemon in the format with access to Belly Drum and a priority attack, making it a great setup sweeper. Sitrus Berry and HP EVs that grant an even number of HP are used so that Azumarill can remain healthy after Belly Drum’s use. The 4 Defense EVs ensure Azumarill survives Mega Salamence’s Double-Edge. Fake Out Mega Kangaskhan makes an excellent partner, as it can immobilize a foe hindersome to Azumarill’s setup such as a Taunt user. Redirection support from the likes of Rage Powder Amoonguss, which resists Electric, and Follow Me Togekiss, which can redirect the moves of Grass-types, can also keep Azumarill unharmed.</p>"},
      "Assault Vest": {"description": "<p>Azumarill’s natural bulk combined with Assault Vest makes it a good switch-in to common special attackers. The aforementioned means this set should avoid the lead position, where it’s unavailable to switch in and vulnerable to Intimidate. The given EVs importantly allow Azumarill to survive Adamant Mega Salamence’s Double-Edge. This set is commonly utilized on sand teams featuring Tyranitar and Mega Salamence, as Azumarill can easily switch into the Water- and Ice-type attacks aimed at them. The same goes for Landorus-T, whose Intimidate combined with Salamence’s access to the same ability compensates for Azumarill’s lower Defense.</p>"}
    },
    "credits": {"writtenBy": [{"username": "Carbonific", "user_id": 233942}], "teams": [{"name": "Quality checked by", "members": [{"username": "Charlotte", "user_id": 159382}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}]}]}
  },
  "Kingdra": {
    "overview": "<ul> <li> <p>Kingdra is one of the best rain sweepers available thanks to its good offensive typing and access to spread Muddy Water, both of which also help to distinguish itself from Ludicolo.</p> </li> <li> <p>Kingdra's solid Water / Dragon typing also leaves it with few weaknesses, though its mediocre bulk makes it vulnerable to strong neutral hits.</p> </li> <li> <p>Ordinarily uncommon support options, such as Disable and Quash, give Kingdra the flexibility to support its team when necessary.</p> </li> <li> <p>Kingdra's STAB moves are resisted by common threats, most notably Tapu Fini and Ferrothorn.</p> </li> <li> <p>Kingdra is highly reliant on rain due to its middling Speed and lackluster damage output outside of rain, which causes a loss of momentum if the opponent activates other weather or gains a Speed advantage from Tailwind or Trick Room.</p> </li> </ul>",
    "sets": {
      "Rain Sweeper": {
        "description": "<ul> <li> <p>Muddy Water is a powerful STAB spread move under rain that also has a decent chance to lower the accuracy of its targets. Generally, this move will be spammed until a foe is put into KO range of another move.</p> </li> <li> <p>Draco Meteor serves as a secondary STAB move to hit Water-resistant foes and beat Dragon-types, such as opposing Kingdra and Mega Salamence.</p> </li> <li> <p>Ice Beam can be used to KO Dragon- and Grass-types without worrying about Misty Terrain or the Special Attack drop from Draco Meteor, although running this leaves Kingdra walled by bulky Water-types.</p> </li> <li> <p>Hydro Pump is valuable as a strong single-target STAB attack, finishing off targets that Muddy Water can't KO and letting Kingdra bypass Wide Guard Celesteela and Aegislash, which otherwise wall it.</p> </li> <li> <p>Rain Dance allows Kingdra to set up independently, improving momentum by making it unnecessary to switch your weather setter in and out to maintain field presence.</p> </li> <li> <p>Protect can be used to shield Kingdra while its partner removes a threat, punishes double targets, and scouts a foe’s actions.</p> </li> <li> <p>The given EV spread and nature allow Kingdra to hit as hard and as fast as possible, with the four Special Defense EVs ensuring Download users like Porygon2 don't receive a Special Attack boost.</p> </li> <li> <p>Waterium Z enables the use of Hydro Vortex, which is notable in providing a perfectly accurate Water-type move as much as in providing a strong one. Alternatively, Life Orb gives Kingdra a more consistent damage boost.</p> </li> <li> <p>If your opponent doesn't have weather setters, such as Tyranitar and Mega Charizard Y, Kingdra makes a perfect lead to punch holes early in the opposing team. If they have a setter, consider removing it before sending out Kingdra.</p> </li> <li> <p>Partners with the Drizzle ability are required to activate Swift Swim. Pelipper grants Tailwind and the ability to hit Grass-types, while Politoed offers Helping Hand support and more bulk.</p> </li> <li> <p>Since Kingdra relies heavily on its Speed advantage, running Taunt on at least one teammate to stop Tailwind and Trick Room is recommended.</p> </li> <li> <p>Running Pokemon with strong Fire- and Electric-type moves, such as Incineroar and Tapu Koko, respectively, is encouraged to avoid Ferrothorn and Celesteela late-game, as they largely wall Kingdra's attacks.</p> </li> <li> <p>Mega Gengar is a good teammate, as it's able to use Shadow Tag to trap and remove Grass-types, bulky Water-types, and opposing weather setters, making it easier for Kingdra to sweep.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "Heliodor", "user_id": 355886}, {"username": "Carbonific", "user_id": 233942}], "teams": [{"name": "Quality checked by", "members": [{"username": "Jio", "user_id": 22788}, {"username": "Carbonific", "user_id": 233942}]}, {"name": "Grammar checked by", "members": [{"username": "A Cake Wearing A Hat", "user_id": 388157}]}]}
  },
  "Suicune": {
    "overview": "<ul> <li> <p>Suicune serves as an excellent bulky support Pokemon that is capable of providing a reliable form of speed control consistently.</p> </li> <li> <p>Its solid bulk and only two weaknesses allow Suicune to tank a wide range of attacks and make it an excellent switch-in to Heatran, Volcarona, Tapu Fini, rain teams, and sand teams.</p> </li> <li> <p>Suicune further sets itself apart from other bulky Water-types by possessing valuable support options such as Snarl, Tailwind, and Roar. Combined with its excellent bulk, it can apply these moves consistently throughout the battle.</p> </li> <li> <p>The abundance of Z-Moves and Tapu Koko makes using Suicune harder, as there are now much easier ways to KO it, and as such, they need to be played around carefully.</p> </li> <li> <p>Tapu Fini and Milotic give Suicune competition in the bulky Water-type role, as they possess somewhat similar levels of bulk and have far more useful abilities.</p> </li> </ul>",
    "sets": {
      "Offensive Support": {
        "description": "<ul> <li> <p>Tailwind is the speed control of choice, as it doubles your entire team's Speed and helps outspeed threats like Choice Scarf Landorus-T, Mega Metagross, and Quiver Dance Volcarona after a boost.</p> </li> <li> <p>Scald serves as Suicune's primary STAB move, dealing sufficient damage to the likes of Heatran, Tyranitar, Excadrill, and Incineroar and having a 30% chance to burn the opposing Pokemon, effectively crippling physical attackers.</p> </li> <li> <p>Ice Beam guarantees OHKO on Mega Salamence and non-Assault Vest Landorus-T, both of which are popular Pokemon in VGC 2018.</p> </li> <li> <p>As an additional form of speed control, Icy Wind can be used over Ice Beam on bulkier variants, but it lacks offensive pressure.</p> </li> <li> <p>Snarl helps weaken your opponent's special attackers and increases your team's longevity. Combined with an Intimidate user, it helps weaken both your opponent's physically and specially offensive capabilities. As an alternative, Protect can be used over Snarl to scout for incoming Z-Moves and stall out Trick Room or your opponent's Tailwind.</p> </li> <li> <p>Mago Berry is Suicune's item of choice, as it greatly helps with longevity, healing 50% of its HP.</p> </li> <li> <p>A Calm Nature with 252 HP and 20 Special Defense EVs gives Suicune a great deal of special bulk and allows it to tank Z-Moves like Tapu Lele's Shattered Psyche and Heatran's Bloom Doom after a Snarl, and it can also survive boosted special attacks like Tapu Fini's Moonblast and Volcarona's Giga Drain.</p> </li> <li> <p>212 Special Attack EVs allow Suicune to always OHKO uninvested Mega Salamence with Ice Beam and 2HKO Heatran with Scald.</p> </li> <li> <p>252 HP and 4 Defense EVs allow Suicune to survive 252 Attack Jolly Kartana's Leaf Blade and gives Suicune more overall bulk when combined with a Mago Berry.</p> </li> <li> <p>20 Speed EVs allow Suicune to outspeed Adamant Choice Scarf Landorus-T in Tailwind, and the remaining EVs were dumped into Special Defense for general bulk.</p> </li> <li> <p>Mega Kangaskhan is an excellent teammate, as it helps Suicune set up Tailwind thanks to its Fake Out support and takes out opposing Tapu Koko with Parental Bond-boosted Double-Edge.</p> </li> <li> <p>Mega Salamence goes well with Suicune, as it helps take down Grass-type Pokemon, which otherwise threatens Suicune, and provides Intimidate support prior to its Mega Evolution.</p> </li> <li> <p>Incineroar has great synergy with Suicune, providing Fake Out support so Suicune can set up Tailwind safely, serving as a Grass-type check, and having access to Intimidate to weaken any physical attackers.</p> </li> <li> <p>Tapu Bulu is an efficient Terrain setter that goes well with Suicune, OHKOing Tapu Koko and bulky Water-type Pokemon like Tapu Fini with its Terrain-boosted Grass-type attacks, while also providing recovery with Grassy Terrain.</p> </li> <li> <p>Landorus-T serves as an amazing switch-in to Electric-type attacks meant for Suicune, thus giving your team great momentum.</p> </li> <li> <p>Offensive Pokemon like Tapu Lele, Volcarona, and Heatran appreciate speed control and thus make good teammates for Suicune.</p> </li> <li> <p>While Mago Berry might be the most used item on Suicune, other sets with Psychic Seed or Grassy Seed can be used with Tapu Lele and Tapu Bulu, respectively.</p> </li> <li> <p>Roar can be considered over Snarl to phaze bulky setup sweepers like Snorlax, Azumarill, and Tapu Fini.</p> </li> <li> <p>Alternatively, Mirror Coat can be used to OHKO bulky special attackers with ease after tanking one of their moves. This works especially well against Soundproof Kommo-o, which is unaffected by Snarl and Roar.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "Mr.GX", "user_id": 239881}], "teams": [{"name": "Quality checked by", "members": [{"username": "Jio", "user_id": 22788}, {"username": "Charlotte", "user_id": 159382}]}, {"name": "Grammar checked by", "members": [{"username": "autumn", "user_id": 384270}]}]}
  },
  "Tyranitar": {
    "sets": {
      "Choice Scarf": {"description": "<p>Choice Scarf is the most common choice of item for Tyranitar, as it lessens dependence on speed control from partners. A Jolly nature is used, as it’s needed to outrun positive-natured base 110s. Typically this set will be selecting Rock Slide as a result of its STAB spread damage and 51% chance to make at least one foe flinch; deviation will occur only against specific threats such as Wide Guard Aegislash, Landorus-T, and opposing Tyranitar. This set is a component of a popular sand core featuring Sand Rush Excadrill and Mega Salamence, known for its ability to deal massive amounts of spread damage before the foe can move.</p>"},
      "Trick Room Attacker": {"description": "<p>When paired with a Trick Room user such as Mega Gardevoir or Cresselia, Tyranitar’s low Speed can be alleviated without sacrificing its bulk and item slot. The items presented are roughly equivalent in viability, so pick whichever you’d prefer. Darkinium Z provides more immediate damage, notably having a chance to OHKO even the bulkiest Cresselia. Weakness Policy is easily activated with Tyranitar’s myriad of weaknesses but excellent bulk, and it allows Tyranitar to deal massive spread damage at +2 Attack with Rock Slide. Rage Powder Amoonguss is a good partner for redirecting Fighting-type moves away.</p>"},
      "Dragon Dance": {"description": "<p>Mega Tyranitar’s increased bulk and speed allow it to more effectively pull off a Dragon Dance set. A Jolly nature and maximum Speed EVs are typically non-negotiable, as they allow Mega Tyranitar to outpace prominent foes such as Mega Salamence and Mega Gengar after a Dragon Dance. The remaining EVs are commonly invested in Attack, although a spread of 252 HP / 4 Atk / 252 Spe can be adopted for more bulk. Rage Powder Amoonguss makes for an excellent partner, as it can help with setup, notably redirecting and resisting Fighting-type moves. Likewise, Sand Rush Excadrill gains Speed from sand and eliminates Fairy-types.</p>"}
    },
    "credits": {"writtenBy": [{"username": "Carbonific", "user_id": 233942}], "teams": [{"name": "Quality checked by", "members": [{"username": "Charlotte", "user_id": 159382}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}]}]}
  },
  "Blaziken": {
    "sets": {
      "Mega Physical Attacker": {"description": "<p>Generally speaking, Blaziken should not be a team’s first choice of Mega Evolution; however, since Mega Blaziken possesses a physical damage output comparable to Life Orb Blaziken with a 20-point increase in base Speed, it does still have a niche. Low Kick is typically the superior Fighting-type STAB move, as it has a high Base Power against common targets such as Mega Kangaskhan and Heatran and doesn’t drop Attack. However, Superpower is more effective against light foes such as Politoed and Ludicolo. Utilizing support partners like Rage Powder Amoonguss and Storm Drain Gastrodon is essential to preserving Mega Blaziken’s health.</p>"},
      "Mixed Attacker": {"description": "<p>Fire and Fighting having great super effective coverage together, and Speed Boost allowing Blaziken to outpace the majority of the unboosted metagame, makes Blaziken a good check to many common threats. The given EVs allow Superpower to OHKO 4 HP Mega Kangaskhan and Hidden Power Ice to OHKO Mega Salamence while letting Blaziken outspeed Landorus-T. These are good examples of Pokemon mixed Blaziken is able to check for partners such as Hydreigon. Accompanying Blaziken with Water-type checks such as Tapu Koko and Amoonguss is also a good idea, as Blaziken struggles against these.</p>"}
    },
    "credits": {"writtenBy": [{"username": "Carbonific", "user_id": 233942}], "teams": [{"name": "Quality checked by", "members": [{"username": "Charlotte", "user_id": 159382}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}]}]}
  },
  "Swampert": {"sets": {"Swampertite": {"description": "<p>Mega Swampert’s high Attack gives it a niche over other Swim Swim users such as Ludicolo and Kingdra. Ice Punch is typically the best coverage move for Water-resistant Dragon- and Grass-types such as Salamence and Amoonguss, although Superpower hits Mega Kangaskhan and Ferrothorn and Rock Slide OHKOes Mega Charizard Y as it attempts to reset sun. Damp is chosen over the useless Torrent in case Explosion is used as Swampert switches in. The EVs and nature let Mega Swampert outpace Choice Scarf Landorus-T in rain while maximizing Attack. Drizzle Pelipper is often the preferred ally over Politoed due to its Ground immunity.</p>"}}, "credits": {"writtenBy": [{"username": "Carbonific", "user_id": 233942}], "teams": [{"name": "Quality checked by", "members": [{"username": "Charlotte", "user_id": 159382}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}]}]}},
  "Ludicolo": {
    "overview": "<ul> <li> <p>Ludicolo is the premier rain sweeper of VGC 2018, having just enough Speed and Special Attack to become a potent threat under gloomy skies.</p> </li> <li> <p>It also has above average coverage for a Water-type, being among the few to hit Tapu Fini hard thanks to its Grass-type STAB.</p> </li> <li> <p>Fake Out is an excellent selling point as well, since under the rain, few Pokemon can offer a faster flinch than Ludicolo.</p> </li> <li> <p>It even has a good Special Defense stat, which makes Ludicolo trickier for special attackers to KO than expected.</p> </li> <li> <p>However, Ludicolo has a poor Defense stat, which lets bulky physical attackers revenge kill it easily.</p> </li> <li> <p>Ludicolo is highly reliant on rain to function. Without rain support, it's hard to justify it over bulkier offensive Water-types such as Tapu Fini.</p> </li> </ul>",
    "sets": {
      "Rain Sweeper": {
        "description": "<ul> <li> <p>Hydro Pump is extremely powerful in the rain, especially when used with Waterium Z. Hydro Vortex coming from Ludicolo in the rain is capable of OHKOing bulky offensive threats such as Mega Kangaskhan and Mega Metagross.</p> </li> <li> <p>Although it doesn't take advantage of Waterium Z nearly as well, Scald is a more reliable option than Hydro Pump overall, and its burn chance can come in handy, especially when carrying Assault Vest.</p> </li> <li> <p>Ice Beam gives Ludicolo a way to OHKO Mega Salamence, Garchomp, and non-Assault Vest Landorus-T regardless of the weather, in addition to hitting Naganadel and Hydreigon hard. It's also Ludicolo's only way of dealing reasonable damage to Grass-types such as Tapu Bulu and Amoonguss.</p> </li> <li> <p>Energy Ball is Ludicolo's most consistently powerful Grass-type STAB attack, notably 2HKOing maximum HP Tapu Fini. However, Giga Drain is a reasonable alternative for the healing it gives Ludicolo, at the cost of power.</p> </li> <li> <p>Fake Out is an incredible option for causing foes to flinch on Ludicolo's first turn out as long as Psychic Terrain isn't up. However, Protect is a reasonable alternative for dodging powerful attacks.</p> </li> <li> <p>Waterium Z gives Ludicolo a one-time chance to drown most Pokemon that don't resist Water-type attacks, especially if using Hydro Pump.</p> </li> <li> <p>Assault Vest takes advantage of Ludicolo's good Special Defense stat, letting it survive surprising attacks. If using Assault Vest, a bulkier spread of 92 HP / 4 Def / 124 SpA / 124 SpD / 164 Spe can be considered. This spread still has enough Special Attack to OHKO Mega Salamence with Ice Beam, and it can survive some powerful attacks, such as Kartana's Leaf Blade, Tapu Lele's Shattered Psyche, and Jolly Mega Kangaskhan's Double-Edge.</p> </li> <li> <p>Another EV spread to consider for Assault Vest Ludicolo is 204 HP / 20 Def / 124 SpA / 76 SpD / 84 Spe. This still allows Ludicolo to outspeed base 130 Speed Pokemon in the rain such as Tapu Koko and Mega Gengar, in exchange for much more bulk. For example, Life Orb Tapu Koko will fail to 2HKO this Ludicolo with Thunderbolt, and it even survives Modest Tapu Lele's Shattered Psyche.</p> </li> <li> <p>Life Orb gives Ludicolo a consistent power boost at the cost of its health. Most notably, this lets Ice Beam OHKO Naganadel and fast Assault Vest Landorus-T and lets Scald OHKO Nihilego in the rain. However, the recoil makes Ludicolo easy to wear down.</p> </li> <li> <p>Swift Swim and a Modest nature are required for Ludicolo to blast through most Pokemon. Maximum Special Attack and Speed investment is fine if using Waterium Z or Life Orb to maximize damage output.</p> </li> <li> <p>A Timid nature can be used to outspeed Jolly Choice Scarf Kartana, Modest Choice Scarf Naganadel, and Timid Choice Scarf Blacephalon, but this does result in a significant power loss.</p> </li> <li> <p>Since Ludicolo is a rain sweeper, rain setters are required teammates. Pelipper is a great choice, since it hits Amoonguss and Tapu Bulu hard and is able to set up Tailwind to deal with fast Choice Scarf users.</p> </li> <li> <p>Politoed is a reasonable option due to its support movepool and its ability to viably use a Choice Scarf. Politoed can also run Focus Blast and Fightinium Z to deal severe damage to Ferrothorn, a common problem for rain teams.</p> </li> <li> <p>Putting Rain Dance on Pokemon such as Gothitelle or Cresselia can be an effective way to surprise opposing weather setters, though it should be a backup option rather than the main way of setting up rain.</p> </li> <li> <p>Ludicolo teams will need a way to deal with Mega Charizard Y and, to a lesser extent, Torkoal, since sun cripples Ludicolo's offensive capabilities. Preparing for Tyranitar and Alolan Ninetales can be a good idea too.</p> </li> <li> <p>Ludicolo especially hates Trick Room due to its reliance on Swift Swim. Taunt users such as Tapu Koko and Tapu Lele can be useful, or even having a Trick Room user of your own such as Cresselia can help for resetting Trick Room.</p> </li> <li> <p>Prepare for bulky Grass-types such as Ferrothorn, Tapu Bulu, and Amoonguss, since they are able to survive Ludicolo's assaults with little issue and hit it hard. Ferrothorn is especially troubling, since it isn't weak to Pelipper's Hurricane.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "Theorymon", "user_id": 29010}], "teams": [{"name": "Quality checked by", "members": [{"username": "Carbonific", "user_id": 233942}, {"username": "Jio", "user_id": 22788}]}, {"name": "Grammar checked by", "members": [{"username": "A Cake Wearing A Hat", "user_id": 388157}]}]}
  },
  "Pelipper": {"sets": {"Drizzle": {"description": "<p>Pelipper and Politoed are the only two users of Drizzle in the format and, given that the former is more offensive, it typically sees the most use. A Ground immunity and access to STAB Hurricane and Tailwind are the main contributing factors. Scald is often the better Water-type STAB move given its accuracy and chance to burn, although Brine takes advantage of Pelipper’s low Speed in dealing massive damage to a foe already harmed by its partner. Swift Swim users such as Ludicolo and Mega Swampert are obvious beneficiaries of rain. Steel-types such as Metagross and Ferrothorn appreciate it weakening Fire-type moves.</p>"}}, "credits": {"writtenBy": [{"username": "Carbonific", "user_id": 233942}], "teams": [{"name": "Quality checked by", "members": [{"username": "Charlotte", "user_id": 159382}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}]}]}},
  "Breloom": {
    "overview": "<ul> <li> <p>Breloom's viability has sharply decreased since VGC 2015.</p> </li> <li> <p>Electric and Misty Terrain both block Spore, and Breloom is arguably outclassed by Tapu Bulu and Kartana as a Grass-type physical attacker.</p> </li> <li> <p>Technician is still a fantastic ability on Breloom, powering up many of its main attacking moves such as Bullet Seed, Mach Punch, and Rock Tomb.</p> </li> <li> <p>Breloom still has a niche as the fastest Spore user outside of Smeargle, and the only Pokemon that can both put enemies to sleep and hit hard.</p> </li> <li> <p>Breloom requires both Tailwind from its team and denial of opposing speed control to fully function.</p> </li> </ul>",
    "sets": {
      "Offensive Spore": {
        "description": "<ul> <li> <p>Spore is the main reason to use Breloom over Tapu Bulu or Kartana.</p> </li> <li> <p>Mach Punch is a powerful priority move, boosted by STAB and Technician.</p> </li> <li> <p>Bullet Seed is Breloom's main attacking move, dealing good damage as well as breaking Focus Sash and Sturdy.</p> </li> <li> <p>Protect takes advantage of Breloom's tendency to be double targeted and can potentially allow for a free Tailwind.</p> </li> <li> <p>Jolly is the preferred nature because many Pokemon are EVed specifically to outspeed neutral-natured base 70s, but Adamant can be used if you are confident with speed control.</p> </li> <li> <p>Breloom works best as a lead paired with a Tailwind setter, since its threat of Spore forces the opponent to respect it. Ideally, Breloom should take advantage of its Speed to use Spore on as many things as possible so that its teammates can sweep.</p> </li> <li> <p>Breloom also functions well as part of a Fire/Water/Grass core - for example, with Suicune and Heatran.</p> </li> <li> <p>Tapu Lele is another great partner for Breloom because Psychic Terrain protects Breloom from priority, especially Fake Out, and overrides the Spore-blocking Electric and Misty Terrains. However, be aware that Psychic Terrain will also prevent Breloom from using Mach Punch against grounded enemies.</p> </li> </ul>"
      },
      "Choice Scarf": {"description": "<ul> <li> <p>A Jolly nature paired with a Choice Scarf allows Breloom to reach 201 Speed, outspeeding maximum Speed base 130 Pokemon such as Tapu Koko.</p> </li> <li> <p>Spore quickly puts a foe to sleep to allow for Breloom's partner to attack or set up.</p> </li> <li> <p>Superpower is Breloom's most consistent move and can OHKO 4 HP / 0 Def Mega Kangaskhan.</p> </li> <li> <p>Rock Tomb is mainly used to OHKO Charizard and Volcarona, along with damaging other Flying-types.</p> </li> <li> <p>Ideally, Breloom should be used as a lead so that it can quickly use Spore and grab momentum for its team. Choice Scarf Breloom is best used alongside Pokemon that set up to sweep, such as Quiver Dance Volcarona and Dragon Dance Mega Tyranitar.</p> </li> <li> <p>Tapu Lele is a fantastic partner as well due to its ability to block Fake Out.</p> </li> </ul>"}
    },
    "credits": {"writtenBy": [{"username": "lucariomaster2", "user_id": 183719}], "teams": [{"name": "Quality checked by", "members": [{"username": "Jio", "user_id": 22788}, {"username": "Carbonific", "user_id": 233942}]}, {"name": "Grammar checked by", "members": [{"username": "P Squared", "user_id": 168392}]}]}
  },
  "Mawile": {"sets": {"All-out Attacker": {"description": "<p>Mega Mawile's Huge Power grants it the highest Attack stat in the game, only not being used immediately when Intimidate will be useful later. Steel / Fairy typing is a boon defensively, as its two weaknesses can be mitigated by partners such as Drizzle Politoed or Pelipper and Tapu Bulu. Consequently, Mega Mawile is often found on semi-Trick Room teams with the aforementioned Pokemon alongside Swift Swim Kingdra or Ludicolo and Trick Room Cresselia or Gothitelle, which, respectively, take advantage of rain and compensate for Mawile's low Speed. Utilize Rock Slide over Play Rough if Fire-types like Charizard and Volcarona are problematic.</p>"}}, "credits": {"writtenBy": [{"username": "Carbonific", "user_id": 233942}], "teams": [{"name": "Quality checked by", "members": [{"username": "Charlotte", "user_id": 159382}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}]}]}},
  "Camerupt": {
    "overview": "<ul> <li> <p>With one of the lowest Speed stats at base 20, Mega Camerupt can play in Trick Room teams very well.</p> </li> <li> <p>Its decent bulk allows Mega Camerupt to take on some strong neutral attacks such as Mega Kangaskhan's Double-Edge and Mega Salamence's Draco Meteor.</p> </li> <li> <p>Mega Camerupt's high Special Attack and ability Sheer Force allow it to hit for large amounts of damage. Mega Camerupt can OHKO Mega Metagross and 2HKO Tapu Lele.</p> </li> <li> <p>Mega Camerupt is checked by the very common Tapu Fini due to its 4x weakness to Water-type attacks and Tapu Fini's good special bulk. Mega Camerupt is also threatened by Landorus-T, which can OHKO it with Earthquake.</p> </li> <li> <p>Mega Camerupt faces competition from Heatran even on full Trick Room teams and from Mega Charizard Y on semi-Trick Room teams, as they are also Fire-types that can spam Heat Wave. The former is particularly notable due to it not using a Mega slot.</p> </li> </ul>",
    "sets": {
      "Trick Room Attacker": {
        "description": "<ul> <li> <p>Heat Wave is a good STAB spread move that hits Grass- and Steel-types such as Tapu Bulu, Kartana, and Celesteela, which has an immunity to Earth Power, hard. Heat Wave also gets a power boost from Sheer Force. Eruption does slightly more damage than Heat Wave, has higher accuracy, and has synergy with Grassy Terrain recovery, but Heat Wave is more consistent because Eruption's damage depends on Mega Camerupt's HP. Mega Camerupt is able to threaten the Grass-types that resist Ground with its STAB Fire-type moves.</p> </li> <li> <p>Earth Power is a single target move that can hit Steel- and Rock-types such as Aegislash, particularly if it runs Wide Guard, and Tyranitar for heavy damage.</p> </li> <li> <p>Nature Power in Grassy Terrain transforms into Energy Ball, which is a good answer for opposing Water-types. Flamethrower is a single target move that can hit Wide Guard Celesteela. It's also useful as a backup move if Mega Camerupt is using Eruption and is low on HP. Fire Blast OHKOes specially defensive Amoonguss and Celesteela, but its bad accuracy makes it less consistent than Flamethrower.</p> </li> <li> <p>Protect is a very important move. It allows Mega Camerupt to protect itself from double targeting and gives it a free turn for a teammate.</p> </li> <li> <p>Solid Rock is the pre-Mega ability of choice because it reduces damage from super effective attacks and allows Camerupt to switch into attacks more freely.</p> </li> <li> <p>The given EV spread with a Quiet nature and 0 Speed IVs maximizes Mega Camerupt's damage output and minimizes its Speed, which is important for successful use under Trick Room.</p> </li> <li> <p>Mega Camerupt is good mid-game when Trick Room is set up and threats are weakened or eliminated. Mega Camerupt can also be used early-game to punch holes in the opposing team, but Trick Room must be set up.</p> </li> <li> <p>For successful use, Mega Camerupt requires Trick Room, so a Trick Room setter such as Porygon2, Gothitelle, or Oranguru is necessary in tandem with Mega Camerupt. Oranguru works especially well because with Instruct, it can provide Mega Camerupt with two attacks instead of one.</p> </li> <li> <p>Tapu Bulu is an excellent teammate because it sets up Grassy Terrain, which turns Nature Power into Energy Ball and weakens Earthquake. Tapu Bulu is useful outside of Trick Room if you failed to set it up. In return, Mega Camerupt can take on Poison-type attacks and threatens Steel-types.</p> </li> <li> <p>Ferrothorn is also a good teammate. It can take on Water-types such as Tapu Fini, switch into Ground-type attacks, and function under Trick Room. In return, Mega Camerupt can freely switch into a Fire-type attack.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "Egor", "user_id": 439341}], "teams": [{"name": "Quality checked by", "members": [{"username": "Carbonific", "user_id": 233942}, {"username": "Jio", "user_id": 22788}]}, {"name": "Grammar checked by", "members": [{"username": "Fireflame", "user_id": 231476}]}]}
  },
  "Salamence": {
    "sets": {
      "Mixed Attacker": {"description": "<p>High attacking stats and access to Double-Edge and Hyper Voice make Mega Salamence a great mixed attacker, which is a big advantage it has over common alternative Mega Evolutions. Draco Meteor is typical in the third slot to deal with Electric-types such as Zapdos and opposing Dragon-types, but Tailwind offers Salamence’s team speed control if this is unnecessary. The given EV spread OHKOes uninvested Tapu Lele with Double-Edge. Tyranitar is a good partner for this set, as it covers Aegislash and Cresselia, which Mega Salamence struggles to deal with. Aegislash is nice defensively given it can switch into all of Salamence’s weaknesses.</p>"},
      "Dragon Dance": {"description": "<p>Mega Salamence’s great defenses as well as Intimidate give it an easy time in setting up Dragon Dance. The EVs let Mega Salamence outrun Choice Scarf Tapu Lele at +1, survive Cresselia’s Ice Beam and Tyranitar’s Ice Punch, and maximize the benefit of an Adamant nature. With Double-Edge, they also ensure the move OHKOes Tapu Fini at +1, although the recoil damage associated with the move reduces the value in defensive investment. A Jolly nature with a 252 Atk / 252 Spe spread is an option if you’d prefer more Speed. Redirectors such as Follow Me Clefairy make good partners by keeping Mega Salamence unhindered.</p>"}
    },
    "credits": {"writtenBy": [{"username": "Carbonific", "user_id": 233942}], "teams": [{"name": "Quality checked by", "members": [{"username": "Charlotte", "user_id": 159382}]}, {"name": "Grammar checked by", "members": [{"username": "GatoDelFuego", "user_id": 91628}]}]}
  },
  "Metagross": {"sets": {"All-out Attacker": {"description": "<p>Mega Metagross's high overall base stats make it solid choice for a Mega Evolution. Its pre-Mega ability in Clear Body also stops Intimidate; you may even wish to delay Mega Evolving for a turn if you anticipate an Intimidate user switching in. Mega Metagross's traits are complemented by allies such as Drizzle Politoed and Pelipper, whose rain dampens Fire moves, and Tapu Lele, whose Psychic Terrain raises Zen Headbutt's damage further. Tapu Koko can also be an effective partner for boosting Thunder Punch and making Bullet Punch less likely to be blocked. Finally, Hydreigon is also a notable partner due to perfect defensive synergy.</p>"}}, "credits": {"writtenBy": [{"username": "Carbonific", "user_id": 233942}], "teams": [{"name": "Quality checked by", "members": [{"username": "Charlotte", "user_id": 159382}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}]}]}},
  "Gastrodon": {
    "overview": "<ul> <li> <p>One of the main allures of Gastrodon is its ability Storm Drain, which grants it an immunity to Water and acts as a critical Water-type move deterrent that benefits many of its potential teammates. This makes users of Muddy Water like Tapu Fini think twice before using the move, as they risk raising the Special Attack of Gastrodon while also negating non-spread Water-type attacks, such as those from Milotic and Araquanid.</p> </li> <li> <p>Storm Drain often helps against rain teams, as it redirects Water-type moves from teammates so that they can threaten the sweeper. Due to the prevalence of Ludicolo on rain teams, Gastrodon is more of a check than a counter most of the time.</p> </li> <li> <p>Gastrodon has a solid defensive typing that grants it resistances to a variety of types and an immunity to Electric-type moves, leaving only a 4x weakness to Grass. Gastrodon finds itself as a defensive glue on many teams due to the large number of Pokemon it checks, such as Incineroar, Landorus-T, Tapu Koko, Heatran, Nihilego, Zapdos, Mega Gengar, and Mega Manectric.</p> </li> <li> <p>Despite having great Health and Special Defense stats, the poor Defense of Gastrodon limits its tanking potential. It can be heavily damaged by strong physical attackers such as Mega Kangaskhan, Mega Mawile, and Zen Headbutt Mega Metagross or OHKOed by some Z-Moves such as Tectonic Rage from Landorus-T or Excadrill.</p> </li> <li> <p>Gastrodon has low Speed and rarely will outspeed anything even with Tailwind up, though this makes it all the more valuable against Trick Room teams.</p> </li> <li> <p>Gastrodon faces competition when it comes to being a rain check from Ferrothorn, as Ferrothorn doesn’t have to worry about being OHKOed by Ludicolo and can threaten it or its teammates back with moves such as Power Whip. In addition Gastrodon faces competition from Tapu Fini for the bulky Water role on various teams, as Tapu Fini has access to many more moves such as Calm Mind and Heal Pulse and it has more bulk, Speed, and Special Attack.</p> </li> </ul>",
    "sets": {
      "Bulky Attacker": {
        "description": "<ul> <li> <p>Earth Power provides an accurate STAB attack that allows Gastrodon to threaten Pokemon such as Tapu Koko, Incineroar, and Heatran.</p> </li> <li> <p>Ice Beam hits many Pokemon for super effective damage, such as Mega Salamence, Landorus, and Zapdos, and has strong neutral coverage alongside Earth Power.</p> </li> <li> <p>The option of Clear Smog allows Gastrodon to win the one-on-one versus Calm Mind Tapu Fini and allows it to clear away any threatening boosts on opposing Pokemon. This makes Gastrodon less susceptible to becoming setup bait. Recover can give reliable recovery outside of the Wiki Berry to allow Gastrodon to be a nuisance throughout the game. Scald provides another spammable STAB move that has a decent 30% chance to burn, though the other two moves in the set give the necessary coverage to not usually need it.</p> </li> <li> <p>Protect grants Gastrodon the ability to allow its partners to deal with its checks while keeping itself safe.</p> </li> <li> <p>Wiki Berry improves Gastrodon's longevity and grants it a form of recovery should it not run Recover.</p> </li> <li> <p>The EVs on this set guarantee an OHKO on 4 HP / 0 SpD Mega Salamence with Ice Beam and prevents Gastrodon from being 2HKOed by a 252 Atk Adamant Landorus-T Earthquake, a 252 SpA Modest Aegislash-Blade Shadow Ball and a 252 SpA Mega Gengar Shadow Ball</p> </li> <li> <p>26 Speed IVs allow Gastrodon to underspeed Aegislash by one point to OHKO with Earth Power. Gastrodon can run a Quiet nature with 0 Speed IVs to be more threatening on Trick Room teams or against them.</p> </li> <li> <p>Gastrodon should be switched in on moves it resists or is immune to, especially predicted Water-type moves to use its Water deterring abilities to the fullest. Gastrodon can be kept on the field alongside Pokemon weak to Water-types attacks in order to discourage Water-type attackers from using attacks that could hit its teammate.</p> </li> <li> <p>Gastrodon enjoys Pokemon such as Incineroar and Landorus-T as teammates, as they can weaken physical threats with Intimidate and appreciate Gastrodon's ability to deter Water-types.</p> </li> <li> <p>Gastrodon is often run with Pokemon such as Mega Metagross and Tapu Lele, as both enjoy a rain check, a way to remove Steel-types like Heatran and Mega Metagross lacking Zen Headbutt, and Gastrodon checking metagame threats like Incineroar and Landorus-T.</p> </li> <li> <p>Gastrodon also appreciates Pokemon such as Incineroar, Charizard, and Zapdos with Heat Wave that can threaten Grass-types.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "Luckyboy123", "user_id": 393838}], "teams": [{"name": "Quality checked by", "members": [{"username": "Jio", "user_id": 22788}, {"username": "Carbonific", "user_id": 233942}]}, {"name": "Grammar checked by", "members": [{"username": "Eien", "user_id": 100418}]}]}
  },
  "Lopunny": {
    "overview": "<ul> <li> <p>Thanks to Scrappy, Mega Lopunny boasts the almost unique ability to use Fake Out against Ghost-type Pokemon like Mega Gengar and Mimikyu, breaking the latter's Disguise for free, as well as granting it unresisted STAB coverage. Furthermore, aside from Ludicolo in rain and Alolan Raichu in Electric Terrain, Mega Lopunny has the fastest Fake Out in the format, making it an extremely reliable user of the move.</p> </li> <li> <p>It also has additional support capacity in Encore and Fake Tears, allowing it to lock opposing Pokemon into an undesirable move and lower an enemy's Special Defense for an ally.</p> </li> <li> <p>Mega Lopunny also boasts the ability to heavily damage Incineroar, OHKOing it if unaffected by Intimidate and taking a massive chunk of health even after Intimidate, giving it a niche as a Fake Out user that can pressure it.</p> </li> <li> <p>However, all things considered, Mega Lopunny has very few options for its moveset, making it very predictable.</p> </li> <li> <p>Additionally, it has mediocre bulk and relatively low damage output for a Mega Evolution, making it hard to justify the opportunity cost involved with using it as a team's Mega Evolution; if a team wishes to have it, that team must be able to capitalize on its ability to provide disruption support while simultaneously pressuring Pokemon like Incineroar, Snorlax, and Tyranitar.</p> </li> </ul>",
    "sets": {
      "Fake Out Support": {
        "description": "<ul> <li> <p>Fake Out is Mega Lopunny's essential support move, enabling it to assist its ally by stopping a foe from moving for the first turn it's out.</p> </li> <li> <p>Return is the attack that Mega Lopunny will be using under most circumstances, as it does solid damage risk-free.</p> </li> <li> <p>High Jump Kick, while risky due to causing a loss of half its health if it misses or lands into Protect, enables Mega Lopunny to handle Incineroar, Kartana, Snorlax, and Tyranitar, the former two of which do not mind the other Fighting-type coverage options Mega Lopunny has, such as Low Kick.</p> </li> <li> <p>Encore allows Mega Lopunny to lock a foe into moves like Protect and Substitute, punishing opponents for playing passively. Additionally, Encore allows Mega Lopunny to punish opponents for attempting to use Protect to avoid Fake Out or High Jump Kick.</p> </li> <li> <p>After You allows Mega Lopunny to take advantage of its high Speed stat to allow a slower ally like Tapu Fini or Celesteela to move sooner.</p> </li> <li> <p>Fake Tears drops a foe's Special Defense by two stages; although Mega Lopunny does not benefit directly from this, this allows it to support a teammate, for example by potentially turning Zapdos's Thunderbolt against Tapu Fini from a 2HKO into an OHKO.</p> </li> <li> <p>Mega Lopunny may use Ice Punch in order to secure more damage against Landorus-T and Mega Salamence, although this is extremely situational, as Mega Lopunny still loses one-on-one against both of them.</p> </li> <li> <p>Although base Lopunny's ability will not matter in most cases, Limber is the best one to pick; as it prevents Lopunny from being paralyzed, it may have some situational usefulness prior to Mega Evolving.</p> </li> <li> <p>A simple EV spread of 4 HP / 252 Atk / 252 Spe will suffice for Mega Lopunny; its bulk is too mediocre for defensive investment to be likely to make a difference, and it needs all of the power and speed it can get its hands on.</p> </li> <li> <p>A Jolly nature is chosen because it allows Mega Lopunny to outspeed Tapu Koko, Mega Salamence, and +1 Mega Tyranitar.</p> </li> <li> <p>Mega Lopunny's disruption tactics with Fake Out and Encore make it easier for Pokemon like Tapu Fini and Volcarona to set up Calm Mind and Quiver Dance, respectively, and for Pokemon like Zapdos to set up Tailwind, making these Pokemon excellent teammates. Additionally, Tapu Fini and Zapdos match up well against Landorus-T and Mega Salamence, two Pokemon that Mega Lopunny hates facing.</p> </li> <li> <p>Should Mega Lopunny opt for After You, slow Pokemon that stand to benefit the most from it make for excellent partners; Snorlax and Celesteela are good examples.</p> </li> <li> <p>Strong special attackers like Tapu Koko, Volcarona, and Zapdos benefit from Mega Lopunny running Fake Tears, as this support allows them to more easily break through Pokemon like Calm Mind Tapu Fini and Misty or Psychic Seed Celesteela.</p> </li> <li> <p>Thanks to Mega Lopunny checking Pokemon like Kartana, Incineroar, and Tyranitar, Tapu Lele makes for a very solid partner, albeit counterintuitively given the fact that Psychic Terrain conflicts with Fake Out.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "Adamant Zoroark", "user_id": 102162}], "teams": [{"name": "Quality checked by", "members": [{"username": "Darkmalice", "user_id": 23736}, {"username": "Carbonific", "user_id": 233942}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}]}]}
  },
  "Rotom-Heat": {
    "overview": "<ul> <li> <p>While Rotom-H generally wouldn't be your first choice as a fire type, as many other Pokemon do the job overall much better, its typing and ability Levitate grant it a niche in some teams. However, it struggles to find a place in many others, as it faces stiff competition from the sea of Fire-types available, especially since Incineroar gained access to Intimidate.</p> </li> <li> <p>Rotom-H hard walls many popular Pokemon, such as Celesteela, Ferrothorn, Mega Charizard Y, and many, many more.</p> </li> <li> <p>Rotom-H's access to multiple support moves like Will-O-Wisp and Thunder Wave, as well as acceptable bulk with investment make supportive movesets viable, although this is not as effective as previous seasons due to the prevalence of Tapu Fini.</p> </li> <li> <p>Unfortunately, Rotom-H's only Fire-type STAB move is Overheat, which halves its Special Attack, forcing it to switch out in most situations.</p> </li> <li> <p>Rotom-H is also very predictable, as 9 times out of 10 it will be running some variation of Thunderbolt, Overheat, and Hidden Power Ice.</p> </li> <li> <p>While 50 / 107 / 107 bulk certainly isn't terrible, it's still very underwhelming without heavy investment. A strong neutral hit, such as Mega Kangaskhan's Return will almost always 2HKO Rotom-H. With bulk investment, however, Rotom-H's damage output drops like a brick.</p> </li> </ul>",
    "sets": {
      "Offensive": {
        "description": "<ul> <li> <p>Overheat is an essential STAB move for Rotom-H, as it does not have any other Fire-type moves to choose from.</p> </li> <li> <p>Thunderbolt is the most reliable of Rotom-H's Electric-type STAB moves, as it has 100% accuracy and a decent Base Power.</p> </li> <li> <p>Hidden Power Ice is necessary to check Landorus-T and Mega Salamence.</p> </li> <li> <p>Will-O-Wisp is great to cripple physical attackers like Mega Kangaskhan.</p> </li> <li> <p>Protect is always useful in VGC, as it allows stalling through Trick Room and weather and making predictions.</p> </li> <li> <p>Wiki Berry provides a one-time 50% boost in health. Alternatively, Electrium Z lets Rotom-H OHKO 180 HP / 148+ SpD Celesteela and chunk many Pokemon of a significant portion of their health.</p> </li> <li> <p>With 108 Special Attack EVs, Rotom-H OHKOes 252 HP Amoonguss and knocks Azumarill into a health range where it can't use Belly Drum after Sitrus Berry recovery.</p> </li> <li> <p>12 Speed EVs lets Rotom-H outrun uninvested Rotom-W, and Landorus-T in Tailwind.</p> </li> <li> <p>The bulk EVs let Rotom-H survive +1 Tyranitar's Rock Slide or Tapu Fini’s Muddy Water, along with preventing a 2HKO from Landorus-T's Rock Slide.</p> </li> <li> <p>Rotom-H is very flexible in regards to Speed EVs. Modify this spread to suit your team.</p> </li> <li> <p>Rotom-H should be used as a \"pivot\". Switch it in on resisted attacks and force the opponent to switch through Rotom's excellent typing.</p> </li> <li> <p>Grass-types such as Ferrothorn form a sturdy core with Rotom-H, as they deal with Rotom-H's only two weaknesses. In return, Rotom-H either walls or destroys many popular Fire-types that threaten Grass-types.</p> </li> <li> <p>Water-types such as Gyarados and Milotic are also great partners for Rotom-H, for they remove the two largest users of Rock Slide in the game, Landorus-T and Tyranitar, while Rotom-H can nuke Grass-types and remove Mega Charizard Y.</p> </li> <li> <p>If you are running Will-O-Wisp, you should not use Tapu Fini on your team, as it prevents burns. If you need a Tapu to override opposing Terrains, Tapu Lele would be your best choice, as Rotom-H can't make use of Tapu Koko's Electric Terrain well due to its low Speed.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "R-B-Y", "user_id": 295522}], "teams": [{"name": "Quality checked by", "members": [{"username": "Jio", "user_id": 22788}, {"username": "Carbonific", "user_id": 233942}]}, {"name": "Grammar checked by", "members": [{"username": "P Squared", "user_id": 168392}]}]}
  },
  "Rotom-Wash": {
    "overview": "<ul> <li> <p>Rotom-W, once one of the top dogs of VGC in years prior, has rather fallen from grace. The introduction of Z-Moves and Island Guardians have made Rotom-W's already somewhat mediocre bulk more noticeable, and Tapu Fini's Misty Terrain has made Rotom-W's support moveset less useful.</p> </li> <li> <p>However, Rotom-W still has a great typing with only one weakness, Grass, and a myriad of resistances; its ability also grants it an immunity to Ground.</p> </li> <li> <p>Rotom-W is no slouch offensively either; Water and Electric coverage backed by 105 Special Attack hits many popular Pokemon for super effective damage.</p> </li> <li> <p>Rotom-W faces stiff competition as a bulky Water-type with Tapu Fini, and as an Electric-type with Zapdos, both of which are overall better at their jobs. This can make it difficult to justify the use of Rotom-W on a team.</p> </li> <li> <p>Rotom-W’s only Water-type move is Hydro Pump, which relies on an iffy 80% accuracy to hit.</p> </li> </ul>",
    "sets": {
      "Offensive Support": {
        "description": "<ul> <li> <p>Hydro Pump is essential to all Rotom-W movesets, as it is Rotom-W's only Water-type move.</p> </li> <li> <p>Thunderbolt is a reliable Electric-type STAB move with decent power.</p> </li> <li> <p>Will-O-Wisp is great for crippling the many physical attackers in this metagame, but the introduction of Tapu Fini and its Misty Surge ability has made this unreliable.</p> </li> <li> <p>Electroweb is a great option for speed control, offering accuracy and efficacy under Misty Terrain over Thunder Wave.</p> </li> <li> <p>Protect is always very useful in VGC, as it allows stalling through weather and terrains, as well as capitalizing on double targets by allowing Rotom-W’s partner to take out a threat while it defends itself.</p> </li> <li> <p>Wiki Berry greatly extends Rotom-W’s longevity by providing a one-time HP boost. Alternatively, Sitrus Berry could be used for its far greater window of activation.</p> </li> <li> <p>Waterium Z is great for upping Rotom-W’s offensive presence with a powerful and 100% accurate Water-type STAB move.</p> </li> <li> <p>The defensive nature and EVs let Rotom-W survive a multitude of powerful attacks, including Jolly Mega Metagross' Zen Headbutt in Psychic Terrain, an Adamant Mega Kangaskhan's Double Edge, -1 Adamant Kartana's Leaf Blade, and -1 Adamant Tapu Bulu's Horn Leech. It also ensures that Rotom-W avoids a 2HKO by Jolly Tyranitar's Rock Slide with sandstorm damage, an OHKO by Timid Mega Charizard Y’s Solar Beam in sun, and a 2HKO by 252 Atk Incineroar Darkest Lariat. The rest is dumped in Special Attack, with the one point leftover put in Speed.</p> </li> <li> <p>If running Electroweb, an alternate spread is 252 HP / 44 Def / 52 SpA / 60 SpD / 100 Spe with a Modest nature. This outspeeds base 110s after they're hit with Electroweb and 2HKOes both 252 HP / 100 SpD Assault Vest Incineroar and 252 HP Milotic, at the cost of fainting to Mega Charizard Y’s Solar Beam. The rest is dumped in Special Defense.</p> </li> <li> <p>Rotom-W is very flexible when it comes to EVs; adjust them to suit your team.</p> </li> <li> <p>Assault Vest is another viable item, especially since Tapu Fini was introduced. For Assault Vest Rotom-W, a set of Electroweb, Hydro Pump, Thunderbolt, and Volt Switch is recommended.</p> </li> <li> <p>Reflect is a good alternative to Will-O-Wisp, if your team is really struggling with Tapu Fini.</p> </li> <li> <p>Ally Switch can be used in place of Protect, as Rotom-W has an incredibly useful typing that allows it to utilize Ally Switch well. It also has the potential to catch your opponents off guard, as Ally Switch is relatively uncommon.</p> </li> <li> <p>Use Rotom-W as a straightforward pivot. Switch it in on resisted attacks and start attacking, or force the opponent to switch through its typing.</p> </li> <li> <p>Many Pokemon pair well with Rotom-W. Landorus-T is a great partner, as Rotom-W handily removes Flying- and Water-types and is immune to its Earthquake. Steel-types like Metagross and Ferrothorn also appreciate Rotom-W, as it handles Fire- and Ground-types easily. Fire-types can deal with Rotom-W’s only weakness, Grass, and appreciate the annihilation of Water-, Ground-, and Rock-types.</p> </li> <li> <p>When running Will-O-Wisp an Island Guardian on your team other than Tapu Fini is necessary to remove Misty Terrain, which denies Rotom-W’s ability to burn.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "R-B-Y", "user_id": 295522}], "teams": [{"name": "Quality checked by", "members": [{"username": "Carbonific", "user_id": 233942}, {"username": "Jio", "user_id": 22788}]}, {"name": "Grammar checked by", "members": [{"username": "talkingtree", "user_id": 232101}]}]}
  },
  "Excadrill": {"sets": {"Sand Rush": {"description": "<p>When Excadrill has its Sand Rush activated by Tyranitar’s Sand Stream, it becomes one of the fastest spread attackers in the format. Earthquake is the primary move, as it inflicts the most damage overall, although Iron Head deals more single-target damage, and Rock Slide’s chance to make the foe flinch can bail Excadrill out of tricky situations. Groundium Z is the preferred item for circumventing Wide Guard and dealing more than two Earthquakes worth of damage in a single turn, although Life Orb’s more consistent boost makes it a viable alternative. Airborne partners such as Mega Salamence are valuable to allow the free use of Earthquake.</p>"}}, "credits": {"writtenBy": [{"username": "Carbonific", "user_id": 233942}], "teams": [{"name": "Quality checked by", "members": [{"username": "Charlotte", "user_id": 159382}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}]}]}},
  "Conkeldurr": {"sets": {"Assault Vest": {"description": "<p>While Conkeldurr struggles against common Fairy- and Psychic-types, its high Attack stat and great coverage, including priority Mach Punch, keep it relevant. Conkeldurr’s Speed means Assault Vest is often the best item, preserving its health long enough to check foes like Heatran and Mega Charizard Y. The EVs make Landorus-T’s Earthquake and Mega Charizard Y’s Heat Wave a 3HKO and let Drain Punch OHKO 4 HP Mega Kangaskhan. The IVs let Conkeldurr underspeed Aegislash. Heatran is a good partner to check Tapu Lele and Mega Salamence. Intimidate users such as Salamence and Landorus-T can also patch up Conkeldurr’s lower Defense.</p>"}}, "credits": {"writtenBy": [{"username": "Carbonific", "user_id": 233942}], "teams": [{"name": "Quality checked by", "members": [{"username": "Charlotte", "user_id": 159382}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}]}]}},
  "Scrafty": {
    "overview": "<ul> <li> <p>Scrafty is the bulkiest of the Fake Out users while also sporting Fake Out and Intimidate support, which leaves it easily one of the best supporters in VGC.</p> </li> <li> <p>Scrafty's low base 58 Speed allows it to underspeed and threaten to OHKO several large metagame threats such as Aegislash, Heatran, and Tyranitar. This makes Scrafty an ideal candidate for Trick Room teams looking for a Pokemon to help ensure Trick Room gets set.</p> </li> <li> <p>Dark / Fighting typing is a double-edged sword in perfectly countering Tyranitar, having great STAB coverage, and granting an immunity to Prankster but also leaving Scrafty crucially 4x weak to Fairy-type attacks.</p> </li> <li> <p>Scrafty unfortunately struggles to provide much offensive pressure due to a base 90 Attack and Knock Off as its strongest Dark-type STAB option.</p> </li> <li> <p>It is threatened by some of the top threats in the game, including all of the island guardians, Mega Salamence, Mega Gardevoir, and Mega Mawile.</p> </li> </ul>",
    "sets": {
      "Offensive Support": {
        "description": "<ul> <li> <p>Fake Out helps to allow a teammate to set up Trick Room, Tailwind, or a Substitute. Fake Out also helps to safely pivot out your other Pokemon to better your matchup against the opponent.</p> </li> <li> <p>Knock Off stops the opposing Pokemon from healing with 50% Berries and can also weaken other Pokemon such as Eviolite Porygon2 and Chansey.</p> </li> <li> <p>Low Kick is the recommended Fighting-type STAB move, as it allows Scrafty to OHKO 4 HP Heatran and Stakataka and 2HKO Mega Kangaskhan, Incineroar, Ferrothorn, and Snorlax after Figy Berry recovery. Drain Punch is a runner up, being the more defensive option that will help to keep Scrafty around longer.</p> </li> <li> <p>Ice Punch is the coverage move of choice, as it hits Pokemon such as Landorus-T and Mega Salamence super effectively; it has an 80% chance to OHKO Landorus-T if Scrafty is not Intimidated. Detect also becomes an option when Figy Berry is used; it allows Scrafty to absorb a Z-Move or stall out weather, Terrain, Tailwind, or Trick Room.</p> </li> <li> <p>Rock Tomb, Super Fang, and Foul Play are options should Scrafty want to target specific threats (such as Volcarona and Mega Charizard Y in the case of Rock Tomb) or just generally do more damage to Pokemon it can't hit super effectively, like Zapdos and Suicune. Foul Play is great for more defensive variants of Scrafty that want to hit Landorus-T, Belly Drum Snorlax, and Metagross harder. Lastly, Snarl is another option in the fourth slot to help weaken opposing special attackers, which can often force a switch from the opponent due to Scrafty's already impressive special bulk.</p> </li> <li> <p>Assault Vest Scrafty can survive a plethora of attacks, including Hyper Voice from Mega Salamence, Dazzling Gleam from Life Orb Tapu Koko, Hurricane from Pelipper, Hydro Vortex from Ludicolo under rain, and Overheat from Mega Charizard Y under sun. Scrafty can also opt to run Figy Berry, which is the superior item when Scrafty is needed to face more physically attacking foes such as Landorus-T, Mega Kangaskhan, and Mega Metagross. However, it should be noted that Figy Berry Scrafty will be KOed by many of the special hits it normally would survive with Assault Vest.</p> </li> <li> <p>252 HP and 252 Attack EVs maximize Scrafty's balance of bulk and offense. 4 Special Defense EVs will give opposing Download Porygon2 an Attack boost as opposed to a Special Attack boost.</p> </li> <li> <p>Adamant is often the best nature for Scrafty when outside of Trick Room. This allows Scrafty to move before and threaten to KO certain minimum Speed sweepers such as Tyranitar, Alolan Marowak, and Heatran.</p> </li> <li> <p>Brave with a 0 IV in Speed is recommended when Scrafty is paired with a Trick Room user to be as slow as possible. Brave Scrafty also has the added benefit of underspeeding all Aegislash by two Speed points and therefore attacking after Aegislash has switched to Blade forme. Knock Off OHKOes Aegislash 87% of the time.</p> </li> <li> <p>An alternate EV spread of 252 HP / 156 Atk / 4 Def / 92 SpD / 4 Spe with a Careful or Sassy nature will always survive Overheat from Mega Charizard Y in the sun. This spread works well to balance more between physical and special defense at the sacrifice of offensive pressure. Scrafty does have access to Foul Play, which would be the recommended Dark-type STAB move for this set to alleviate the weakened offenses.</p> </li> <li> <p>Scrafty is an excellent choice for Trick Room teams, as the combination of Fake Out, Knock Off, and Fighting coverage can threaten several threats to Trick Room setters such as Aegislash, Tyranitar, and Hydreigon. A core of Scrafty, Cresselia, and Stakataka is one of the most reliable ways to ensure Trick Room gets set.</p> </li> <li> <p>Stakataka and Scrafty alone form a very reliable and offensive Trick Room duo capable of winning entire games if Trick Room is set.</p> </li> <li> <p>Gothitelle and Mega Gengar appreciate Scrafty's Intimidate and Fake Out to help weaken and distract the opponent to allow for either Trick Room or Perish Song. Scrafty running Snarl + Gothitelle + Mega Mawile can become an extremely hard core to play against, as the multiple Intimidates and Snarls will make it very difficult for the opponent to KO anything. Eject Button can also be run to allow for two Intimidates in one turn if Scrafty is hit.</p> </li> <li> <p>Mega Gardevoir is a great complementary offensive Trick Room setter alongside Scrafty. Mega Gardevoir appreciates Intimidate and strong Fighting-type coverage to handle common Steel-type Pokemon such as Ferrothorn and Stakataka, which prey on Gardevoir's poor physical defense.</p> </li> <li> <p>Substitute users such as Aegislash and Heatran appreciate Scrafty's Fake Out causing a foe to flinch, which provides them the chance to get Substitute up or safely attack a threat late in the game. This also often pairs well on Trick Room teams, as common threats like Hydreigon, Tapu Lele, and Metagross often will lose the matchup to either Aegislash or Heatran coupled with Scrafty.</p> </li> <li> <p>Scrafty pairs well with weather setters such as Mega Charizard Y and Pelipper thanks to its ability to counter Tyranitar effectively.</p> </li> <li> <p>Scrafty is naturally not a very offensive Pokemon, and the main set is your strongest and most viable way of utilizing it. Scrafty can be modified to be more defensive if the team calls for it, like shown in the alternate EV spread. Scrafty can fit onto a variety of teams with minimal support, but Scrafty does appreciate the removal of Fairy-type and Flying-type attacks from Pokemon like the island guardians, Mega Gardevoir, Mega Mawile, Mega Salamence, Pelipper, Togekiss, Azumarill, and Mimikyu.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "Netherious", "user_id": 300598}], "teams": [{"name": "Quality checked by", "members": [{"username": "Carbonific", "user_id": 233942}, {"username": "Jio", "user_id": 22788}]}, {"name": "Grammar checked by", "members": [{"username": "P Squared", "user_id": 168392}]}]}
  },
  "Gothitelle": {
    "overview": "<ul> <li> <p>Gothitelle is one of the most dangerous Trick Room setters you can face in VGC 2018 thanks to its above-average bulk and access to the very intimidating Shadow Tag.</p> </li> <li> <p>Shadow Tag allows Gothitelle to not only set up Trick Room but also become one half of the well-known Perish Trap combination alongside Mega Gengar.</p> </li> <li> <p>Gothitelle synergizes well with some of the top Trick Room attackers in the game like Mega Mawile, Azumarill, and Snorlax.</p> </li> <li> <p>A decent movepool gives Gothitelle access to support moves such as Heal Pulse, Taunt, Tickle, Skill Swap, Recycle, and Ally Switch.</p> </li> <li> <p>Its Psychic typing leaves Gothitelle weak to Ghost-, Dark-, and Bug-type attacks. While Gothitelle's bulk is above average,  it isn't enough to survive some of the bigger hits Trick Room setters like Cresselia and Porygon2 can take.</p> </li> <li> <p>Gothitelle typically only run one attacking move, which leaves it extremely weak to Taunt and being ignored. Gothitelle will not do much damage to Pokemon that aren't weak to Psychic-type attacks.</p> </li> </ul>",
    "sets": {
      "Trick Room Trapper": {
        "description": "<ul> <li> <p>Trick Room is a necessity for Gothitelle to allow its teammates to become the fastest attackers on the field.</p> </li> <li> <p>Protect allows Gothitelle to scout out Z-Moves and stall out Perish Song turns.</p> </li> <li> <p>Psychic or Psyshock prevents Gothitelle from being completely shut down by Taunt and deals significant damage to Pokemon like Amoonguss, which  is often used as a check to Trick Room teams. Psychic does more damage thanks to its higher Base Power, but Psyshock is an option to do more damage to Pokemon like Assault Vest Landorus-T, specially defensive Amoonguss, and Assault Vest Ludicolo.</p> </li> <li> <p>The  fourth slot is open to mainly whatever fits your team best. Helping Hand is great once Trick Room is up, as Gothitelle can help its teammates do large damage. Heal Pulse will help to keep your teammates alive while they attack. Helping Hand is best for teams lacking true offensive power and Heal Pulse helps to keep  offensive power going.</p> </li> <li> <p>Gothitelle appreciates the recovery from Aguav Berry, but a Sitrus Berry can be used to survive hits that Aguav won't activate from. For example, the combination of Mega Metagross's Iron Head and Tapu Lele's Moonblast will often KO Gothitelle with Aguav Berry whereas Sitrus Berry will survive with ease. Mental Herb gives Gothitelle the ability to escape Taunt and still get Trick Room up, although Gothitelle will often appreciate recovery more.</p> </li> <li> <p>Shadow Tag is a necessity,  as it is the main reason to use Gothitelle over other Trick Room setters.</p> </li> <li> <p>A Sassy nature makes Gothitelle as slow as possible for Trick Room and helps to boost its already good Special Defense.</p> </li> <li> <p>The given EV spread allows Gothitelle to survive a rain-boosted Hydro Vortex from Ludicolo and recover enough health with an Aguav Berry to survive any teammate attack from a Pelipper or Politoed. Mega Charizard Y's Overheat will never OHKO under the sun. After Intimidate, Gothitelle will also survive a Tectonic Rage from Landorus-T.</p> </li> <li> <p>Gothitelle does have access to the ability Competitive, which would make for a surprise deterrent to Intimidate users, but it is significantly weaker than other Competitive and Defiant users  that do the job much better, like Milotic and Bisharp.</p> </li> <li> <p>Ally Switch and Skill Swap are runner-up to Helping Hand and Heal Pulse for the  fourth slot. Ally Switch can force a lot of mind games but can very quickly become predictable. Skill Swap can allow you to pass the torch for Perish trap teams, passing on Shadow Tag to a healthier teammate to bridge the turns  until Perish Song activates.</p> </li> <li> <p>Tickle, Taunt, and Fake Tears are also great move options for the last slot, but in most situations,  Helping Hand and Heal Pulse will be the most reliable.</p> </li> <li> <p>Gothitelle appreciates the support of Intimidate users or Pokemon that can deal with strong Dark- and Ghost-type attacks from Pokemon such as Tyranitar, Hydreigon, Incineroar, Aegislash, and Mega Gengar.</p> </li> <li> <p>Scrafty and Mega Mawile are excellent teammates that fit the bill, but Mega Mawile must be wary of Flamethrower from Hydreigon and Flare Blitz from Incineroar. Bringing the two of these on the same team with Gothitelle will form a really solid core that can spread Intimidate and Snarl to weaken the foes into oblivion.</p> </li> <li> <p>Snorlax is another great partner for Gothitelle that can take advantage of a good matchup and set up Belly Drum or several Curses and become untouchable. Snorlax and Gothitelle form a dangerous combination  that can obliterate unprepared teams. Shadow Tag can often trap the opponent in a poor  matchup for them to face a Snorlax, such as with more defensively inclined Pokemon like Zapdos and Suicune on the field, allowing Snorlax to set up and sweep. Be careful with the aforementioned Pokemon, as they can run Roar to phaze out Gothitelle or Snorlax.</p> </li> <li> <p>Gothitelle also fits the bill for Perish trap teams where Shadow Tag users are far and few between. Politoed is a great Perish Song user that has relatively decent staying power. Politoed also pairs up well with Mega Mawile, providing rain support to weaken Fire-type attacks.</p> </li> <li> <p>In general, Fake Out users like Scrafty, Incineroar, and Hitmontop all have synergy with Gothitelle. Scrafty and Hitmontop provide Intimidate, and Incineroar can offer a great ability in Intimidate and a strong Fire attack in Flare Blitz to fend off Amoonguss, Tapu Lele, and Tapu Koko to prevent them from taunting or immobilizing Gothitelle before Trick Room can be set up.</p> </li> <li> <p>Gothitelle can take most non-super effective Z-Moves and recover back health thanks to its Aguav Berry. Gothitelle's biggest weakness is being ignored while teammates are targeted. It is very important for Gothitelle to provide accurate support, so make sure to analyze the set and change what works best for your team. Gothitelle can provide support on a variety of Trick Room or Perish trap teams.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "Netherious", "user_id": 300598}], "teams": [{"name": "Quality checked by", "members": [{"username": "Jio", "user_id": 22788}, {"username": "Charlotte", "user_id": 159382}]}, {"name": "Grammar checked by", "members": [{"username": "autumn", "user_id": 384270}]}]}
  },
  "Amoonguss": {
    "overview": "<ul> <li> <p>Amoonguss is the premier redirection user of this format thanks to its insane bulk. It also is a nice check, or accompaniment, to Trick Room teams with its low speed and access to Spore, and it can punish setup users with Clear Smog.</p> </li> <li> <p>Regenerator is an amazing ability, allowing Amoonguss to regain solid amounts of health and stay healthy late-game.</p> </li> <li> <p>Amoonguss's great natural bulk allows it to survive many neutral Z-Moves and many other moves, but it struggles against Terrain- and sun-boosted moves from Tapu Lele and Mega Charizard Y, respectively.</p> </li> <li> <p>When thinking of redirection, Amoonguss is the first one to go to. Although Clefairy and Togekiss are other options, Amoonguss's access to Spore has made it more of a popular choice.</p> </li> <li> <p>Amoonguss isn't known to be offensive, but its STAB moves chunk the Tapu group and some Water-types, which is important given their prevalence.</p> </li> </ul>",
    "sets": {
      "Bulky Support": {
        "description": "<ul> <li> <p>Rage Powder is a necessity for all Amoonguss sets and allows moves to be redirected towards its bulky self.</p> </li> <li> <p>Spore puts foes to sleep, which renders them temporarily useless. Due to Amoonguss's low speed, it severely punishes threats in Trick Room this way before they can act.</p> </li> <li> <p>Clear Smog does decent damage and also resets opposing Pokemon's stat changes to zero. This should be used against Belly Drum Snorlax or Competitive Milotic.</p> </li> <li> <p>Sludge Bomb chunks both Grass- and Fairy-types such as Ludicolo, the Tapu group, and Gardevoir.</p> </li> <li> <p>Giga Drain allows Amoonguss to recover health whilst doing solid damage. It also deals large chunks of damage to Milotic and Mega Swampert.</p> </li> <li> <p>Protect is a staple move in VGC and should be used to scout out for moves, defend Amoonguss, or allow an ally to remove a threat.</p> </li> <li> <p>The EVs combined with a Sassy nature allow Amoonguss to survive a sun-boosted Heat Wave from Mega Charizard Y and guarantees Landorus-T's Earthquake to deal less than 50% of damage.</p> </li> <li> <p>Wiki Berry maximizes recovery. However, if you do not want to risk it not being activated, you can go with a Sitrus Berry.</p> </li> <li> <p>An alternative, more physically bulky option to go with is available with a Relaxed nature and an EV spread of 244 HP / 196 Def / 68 SpD. These can be used to survive a non-Terrain-boosted Zen Headbutt from Mega Metagross.</p> </li> <li> <p>Tapu Koko and Tapu Fini are minor threats to Amoonguss, as their Terrains make Spore unusable against grounded Pokemon. However, Amoonguss does decent damage to Tapu Fini with both Sludge Bomb and Giga Drain, and it can redirect Electric-type moves from Tapu Koko and easily take them.</p> </li> <li> <p>Amoonguss forms a nice duo with Mega Kangaskhan and Tyranitar to defend them against incoming Fighting-type moves they are weak to. In addition to this, Tyranitar can safely set up with Dragon Dance with the assistance of redirection from Amoonguss.</p> </li> <li> <p>Amoonguss is a good lead, as it can be immediately threatening, and you shouldn't be overly concerned about it taking damage early-game, because its recovery tools will allow it to continue supporting its teammates late-game. You don't want to focus too much on recovery, because it is not very good if it remains as your last Pokemon. Sometimes sacrificing Amoonguss is alright if it saves its partner from a strong hit in doing so.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "xZorua", "user_id": 449309}], "teams": [{"name": "Quality checked by", "members": [{"username": "Carbonific", "user_id": 233942}, {"username": "Charlotte", "user_id": 159382}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}]}]}
  },
  "Ferrothorn": {
    "sets": {
      "Defensive": {"description": "<p>Ferrothorn’s presence can be a great late-game win condition thanks to its good defenses and recovery from Leech Seed. The EVs and nature ensure Gyro Ball OHKOes 4 HP Tapu Lele and that mixed Mega Salamence’s Double-Edge is a 3HKO, factoring in Leftovers recovery. Speed is minimized to maximize Gyro Ball’s damage. Ferrothorn functions well both on rain teams, thanks to the reduced damage from Fire attacks, and rain-weak teams, thanks to it checking Water-types such as Mega Swampert and Politoed easily. Other Fire-type checks such as Landorus-T and Tyranitar are also appreciated, with the latter’s sand even aiding late-game stall.</p>"},
      "Choice Band": {"description": "<p>While Ferrothorn is typically suited to defense, a Choice Band can boost its high-Base Power moves further and catch foes off guard. The combination of Gyro Ball, Power Whip, and Knock Off is common, though the final move is largely filler. Bulldoze lets Ferrothorn punish Fire-types expecting a free switch and provides speed control for its team, while Iron Head allows an alternative to Gyro Ball that hits even slower foes hard. Pelipper remains a solid teammate for handling Fire-type attackers, though Trick Room users such as Cresselia see additional value in allowing Ferrothorn to maintain offensive pressure over an extended period.</p>"}
    },
    "credits": {"writtenBy": [{"username": "Carbonific", "user_id": 233942}], "teams": [{"name": "Quality checked by", "members": [{"username": "Charlotte", "user_id": 159382}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}]}]}
  },
  "Hydreigon": {
    "overview": "<ul> <li> <p>Hydreigon functions as a strong special attacker thanks to its great offensive typing, base 125 Special Attack, and great coverage options.</p> </li> <li> <p>Although it is great offensively, Hydreigon suffers from a 4x weakness to Fairy and a 2x weakness to Fighting, forcing you to play very carefully around the Tapu Pokemon.</p> </li> <li> <p>Hydreigon sits at an awkward Speed tier of 98. Though not remarkably fast, it is certainly not slow either. However, it is crucially outsped by the likes of Mega Kangaskhan, Mega Metagross, and Kartana.</p> </li> </ul>",
    "sets": {
      "Special Attacker": {
        "description": "<ul> <li> <p>The EVs help take advantage of Hydreigon's Special Attack while also patching up its average Speed.</p> </li> <li> <p>Darkinium Z gives Hydreigon a very powerful one-time nuke, OHKOing Cresselia and Aegislash while dealing massive damage to most of the metagame that doesn't resist it.</p> </li> <li> <p>Life Orb gives Hydreigon a consistent damage boost to all attacks.</p> </li> <li> <p>Dark Pulse is Hydreigon's move of choice, as it deals heavy damage to common Pokemon such as Aegislash and Cresselia.</p> </li> <li> <p>Draco Meteor functions as a powerful attack that can deal very heavy damage at the cost of reducing Hydreigon's Special Attack by two stages.</p> </li> <li> <p>Tailwind provides a means of speed control for your team.</p> </li> <li> <p>Flamethrower hits Ferrothorn, Celesteela, and Amoonguss super effectively, but you can opt for its riskier alternative Fire Blast for more firepower at the cost of accuracy.</p> </li> <li> <p>Earth Power gives Hydreigon the opportunity to hit Incineroar, Tapu Koko, and Mega Mawile super effectively.</p> </li> <li> <p>The Timid nature can be swapped out for Modest for more damage overall at the cost of making Hydreigon slower than Timid Tapu Lele and Jolly Landorus-T.</p> </li> <li> <p>Hydreigon fits very well on Tapu Lele and Mega Metagross teams because it can stop key threats that both Tapu Lele and Mega Metagross dislike, such as Aegislash and Cresselia.</p> </li> <li> <p>Landorus-T provides Intimidate support and is able to freely use Earthquake thanks to Hydreigon's Levitate.</p> </li> <li> <p>Amoonguss is also a reliable partner thanks to its ability to redirect attacks and also check Fairy-types in one slot.</p> </li> </ul>"
      },
      "Choice Attacker": {
        "description": "<ul> <li> <p>Choice Specs allows Hydreigon to deal massive amounts of damage, while Choice Scarf lets it stay in a comfortable Speed tier, outspeeding multiple Pokemon including maximum Speed Pheromosa.</p> </li> <li> <p>A Timid nature is preferred with Choice Specs, as it bumps up Hydreigon's Speed without sacrificing damage. Choice Scarf Hydreigon uses a Modest nature because it already achieves a high Speed stat of 225, appreciating the boost in damage more.</p> </li> <li> <p>The EV spread lets Hydreigon hit hard and hit fast, two things that it wants to take advantage of.</p> </li> <li> <p>Choice Specs guarantees the OHKO on uninvested Mega Metagross with Dark Pulse and the OHKO on uninvested Landorus-T with Draco Meteor.</p> </li> <li> <p>The current moveset allows Hydreigon to fully take advantage of its offensive presence without sacrificing damage or coverage in return.</p> </li> <li> <p>Flash Cannon is a possible option to hit Fairy-types but is often outclassed by Hydreigon's other moves because it usually doesn't deal enough damage to become relevant.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "20mtrebu", "user_id": 435404}], "teams": [{"name": "Quality checked by", "members": [{"username": "Jio", "user_id": 22788}, {"username": "Charlotte", "user_id": 159382}]}, {"name": "Grammar checked by", "members": [{"username": "P Squared", "user_id": 168392}]}]}
  },
  "Volcarona": {
    "overview": "<ul> <li> <p>Volcarona boasts a great Special Attack and access to strong STAB moves in Flamethrower, Heat Wave, and Bug Buzz, which when combined with its Speed allows Volcarona to outspeed common threats such as Tapu Lele and non-Choice Scarf Landorus-T and dish out heavy damage.</p> </li> <li> <p>Good natural special bulk allows Volcarona to survive numerous special attacks like Choice Specs Tapu Fini's Muddy Water and Tapu Lele's Psychic in Psychic Terrain.</p> </li> <li> <p>Volcarona primarily functions as a setup sweeper; after using Quiver Dance, it can outspeed and KO threats such as Mega Metagross, Tapu Koko, Aegislash, and Adamant Choice Scarf Landorus-T.</p> </li> <li> <p>Access to decent coverage in Giga Drain and Bug Buzz helps Volcarona deal with bulky Water-types, Rock-types, and Cresselia that might otherwise wall Volcarona.</p> </li> <li> <p>Additionally, Volcarona gets access to some support options in Whirlwind, Tailwind, and Rage Powder.</p> </li> <li> <p>However, Volcarona is 4x weak to Rock-type moves, making it extremely susceptible to the incredibly common Rock Slide from Landorus-T and Tyranitar.</p> </li> <li> <p>Furthermore, Incineroar threatens Volcarona, as it can prevent Volcarona from setting up while entirely walling it.</p> </li> </ul>",
    "sets": {
      "Quiver Dance": {
        "description": "<ul> <li> <p>Flamethrower is Volcarona's primary means of offense and can OHKO a wide range of targets like Tapu Koko, bulky Tapu Bulu, Celesteela, and Aegislash after a Quiver Dance.</p> </li> <li> <p>Giga Drain helps Volcarona take on bulky Water-type Pokemon like Tapu Fini, Mega Swampert, and Gastrodon, notably 2HKOing the first at +1, and helps with longevity.</p> </li> <li> <p>Bug Buzz can be used over Giga Drain to deal with bulky Psychic-type Pokemon like Cresselia and Gothitelle, and it can also OHKO Mega Tyranitar after a couple boosts.</p> </li> <li> <p>Quiver Dance is Volcarona's setup option that boosts its Special Attack, Special Defense, and Speed after which it can proceed to sweep the opposing team.</p> </li> <li> <p>Protect is used to scout for potential Z-Moves and random Rock-type moves, as well as to stall out Tailwind and Trick Room.</p> </li> <li> <p>Flame Body threatens physical attackers like Mega Metagross, Mega Kangaskhan, and Kartana with its 30% burn chance, making Volcarona a threatening switch-in to them.</p> </li> <li> <p>Mago Berry lets Volcarona recover 50% of its HP while setting up Quiver Dance after tanking attacks like Mega Metagross's Zen Headbutt and Landorus-T's -1 Rock Slide, to retain momentum.</p> </li> <li> <p>A Modest nature combined with Quiver Dance boosts helps Volcarona OHKO various Pokemon like Tapu Koko, Aegislash, and Celesteela.</p> </li> <li> <p>220 HP and 4 Defense EVs helps Volcarona tank Mega Metagross's Zen Headbutt, Incineroar's Flare Blitz, and Landorus-T's -1 Rock Slide.</p> </li> <li> <p>220 HP and 76 Special Defense EVs allow Volcarona to survive Tapu Koko's Gigavolt Havoc in Electric Terrain 93.7% of the time.</p> </li> <li> <p>68 Special Attack EVs let Volcarona OHKO Tapu Koko with Flamethrower 93.8% of the time after a Quiver Dance boost and 2HKO Tapu Fini with boosted Giga Drains.</p> </li> <li> <p>Running 140 Speed EVs allows Volcarona to outspeed Mega Manectric after a Quiver Dance.</p> </li> <li> <p>Alternatively, 252 Special Attack and 252 Speed EVs can be used to outspeed maximum Speed Tapu Lele and non-Choice Scarf Landorus-T and deal a big chunk of damage to them.</p> </li> <li> <p>Aside from Mago Berry, Firium Z has seen some usage on more offensive sets to grab some quick KOs, giving Volcarona enough firepower to OHKO Mega Charizard in sun after a Quiver Dance.</p> </li> <li> <p>Fake Out users like Mega Kangaskhan, Alolan Persian, and Hitmontop pair well with Volcarona, helping it set up Quiver Dance effectively while minimizing the risk of it being KOed.</p> </li> <li> <p>Volcarona greatly appreciates Intimidate support to make up for its lack of physical bulk and help it tank super effective attacks like Landorus-T's Rock Slides. Landorus-T, Scrafty, and Hitmontop fill this role especially well, as the latter two have access to Fake Out for additional support.</p> </li> <li> <p>Wide Guard users like Aegislash, Celesteela, and Hitmontop help Volcarona avoid getting hit by spread moves such as the ever-popular Rock Slide and Muddy Water, which could otherwise threaten to 2HKO Volcarona.</p> </li> <li> <p>Water-type and Ground-type Pokemon like Tapu Fini, Suicune, and Landorus-T can take out Fire-type Pokemon like Heatran and Incineroar, both of which are often used to wall Volcarona.</p> </li> <li> <p>While Volcarona serves primarily as a setup sweeper, support sets with Tailwind and Rage Powder can be used to provide speed control for your team and to help other Pokemon like Azumarill and Snorlax set up with ease thanks to its redirection.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "Mr.GX", "user_id": 239881}], "teams": [{"name": "Quality checked by", "members": [{"username": "Jio", "user_id": 22788}, {"username": "Charlotte", "user_id": 159382}]}, {"name": "Grammar checked by", "members": [{"username": "P Squared", "user_id": 168392}]}]}
  },
  "Thundurus-Therian": {
    "overview": "<ul> <li> <p>Thundurus-T's base 101 Speed allows it to outpace base 100 Speed threats such as Mega Charizard Y and Mega Kangaskhan.</p> </li> <li> <p>Volt Absorb gives Thundurus-T an immunity to Electric-type attacks.</p> </li> <li> <p>Its pretty mediocre bulk doesn't allow it to take many attacks. It's able to survive weaker super effective hits such as Landorus-T's Rock Slide but unable to survive stronger neutral attacks such as Mega Kangaskhan's Double-Edge.</p> </li> <li> <p>Thundurus-T's weakness to common Ice- and Rock-type attacks further hinders its mediocre bulk.</p> </li> <li> <p>Thundurus-T has competition from Tapu Koko and Zapdos as an Electric-type. However, Thundurus-T sets itself apart from them with its movepool and the ability Volt Absorb.</p> </li> </ul>",
    "sets": {
      "3 Attacks + Protect": {
        "description": "<ul> <li> <p>STAB Thunderbolt hits Flying- and Water-types hard.</p> </li> <li> <p>Hidden Power Ice hits Ground- and Dragon-types such as Landorus-T and Hydreigon.</p> </li> <li> <p>Sludge Bomb hits Fairy-types such as Tapu Bulu and Tapu Koko.</p> </li> <li> <p>Focus Blast has bad accuracy but hits Rock- and Dark-types such as Tyranitar and Hydreigon very hard. It is most useful with Fightinium Z.</p> </li> <li> <p>Protect allows Thundurus-T to avoid double targeting and scout for Rock- and Ice-type attacks such as Tapu Bulu's Rock Slide and Tapu Fini's Ice Beam.</p> </li> <li> <p>Life Orb significantly increases damage output at the cost of HP. With a Life Orb boost, Thunderbolt can 2HKO Zapdos, Hidden Power Ice has a high chance to OHKO Assault Vest Landorus-T, and Sludge Bomb can OHKO Assault Vest Tapu Bulu. Electrium Z is necessary to use STAB Gigavolt Havoc, which can OHKO uninvested Mega Metagross. Fightinium Z turns Focus Blast into All-Out Pummeling, which OHKOes Mega Tyranitar.</p> </li> <li> <p>The given EV spread with a Timid nature allows Thundurus-T to hit as hard as possible and outpace many threats.</p> </li> <li> <p>Volt Absorb allows Thundurus-T to absorb Electric-type attacks and heal. This enables Thundurus-T to switch into Electric-type attacks frequently aimed at Pokemon such as Pelipper and Celesteela.</p> </li> <li> <p>Thundurus-T is good mid-game when its checks and faster threats are weakened or KOed. This will give Thundurus-T a chance to successfully sweep.</p> </li> <li> <p>If Thundurus-T lacks Sludge Bomb, Tapu Bulu easily checks it. In this case, a teammate who checks Tapu Bulu is necessary. Steel-types such as Mega Metagross, Aegislash, and Celesteela are good examples. They also check Rock-types such as Tyranitar if Thundurus-T lacks Focus Blast. In return, Thundurus-T can break through Water-types such as Tapu Fini and Suicune and freely switch into a Ground-type attack. Aegislash works with Thundurus-T especially well because it can provide Wide Guard support to protect Thundurus-T from Rock Slide and itself from Earthquake.</p> </li> </ul>"
      },
      "Choice Scarf": {
        "description": "<ul> <li> <p>Thunderbolt is Thundurus-T's main STAB move and the strongest move on the set. It hits Water- and Flying-types such as Tapu Fini, Azumarill, and Celesteela for a large amount of damage.</p> </li> <li> <p>Hidden Power Ice can OHKO non-Assault Vest Landorus-T and Mega Salamence.</p> </li> <li> <p>Sludge Bomb hits the Guardian Deities, especially Tapu Bulu, and other Fairy-types such as Mega Gardevoir for heavy damage.</p> </li> <li> <p>Volt Switch lets Thundurus-T to pivot out from very threatening Pokemon.</p> </li> <li> <p>Choice Scarf allows Thundurus-T to outspeed most of the metagame but locks it into one move. You should use Choice Scarf Thundurus-T carefully because being locked into the wrong move may be crucial.</p> </li> <li> <p>The given EV spread with a Timid nature maximizes Thundurus-T's Speed and damage output. 4 EVs in Defense gives Thundurus-T a 75% chance to survive maximum Attack Landorus-T's Rock Slide.</p> </li> <li> <p>Volt Absorb gives Thundurus-T an immunity to Electric-type attacks, so you can switch it into an Electric-type threat such as Tapu Koko. Thundurus-T's immunity to Ground-type attacks allows it to switch into Landorus-Tand other Pokemon that may use Ground-type attacks.</p> </li> <li> <p>You can use Choice Scarf Thundurus-T early-game to pressure your opponent. If there is a big threat such as Tyranitar, pivot out through Volt Switch.</p> </li> <li> <p>Thundurus-T appreciates Wide Guard support from the likes of Aegislash and Celesteela because it has a weakness to Rock Slide, which is multi-target move.</p> </li> <li> <p>Landorus-T is good teammate because it can freely use Earthquake when paired with Thundurus-T and provides Intimidate support. Thundurus-T can take on Water-types in return.</p> </li> <li> <p>Steel-types such as Celesteela, Mega Metagross, and Kartana work well with Thundurus-T, particularly on rain teams where their weakness to Fire-types is reduced. They can beat Rock-types such as Tyranitar, while Thundurus-T can freely switch into Ground-type attacks and take on Water-types, which can wall Steel-types except Kartana.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "Egor", "user_id": 439341}], "teams": [{"name": "Quality checked by", "members": [{"username": "Jio", "user_id": 22788}, {"username": "Charlotte", "user_id": 159382}]}, {"name": "Grammar checked by", "members": [{"username": "Fireflame", "user_id": 231476}]}]}
  },
  "Landorus-Therian": {
    "overview": "<p>Landorus-T's high usage has made it the face of Battle Spot Doubles, something most attributable to a level of versatility that allows it to fit on almost any team. The variety of sets Landorus-T can run is one aspect of this, as they're different enough to still catch foes off guard despite Landorus-T's popularity. Access to the universally appreciated Intimidate is just as much of a factor, as the team support it provides synergizes with Landorus-T's pivot playstyle. Specifically, though, Landorus-T stands above other Intimidate users by being the best Ground-type in the metagame. Ground-types are highly favored in Battle Spot Doubles for hitting common foes such as Tapu Koko and Heatran hard as well as for providing great neutral coverage. That said, while Landorus-T is the best Ground-type overall, others can be more situationally appropriate. Excadrill, for example, often works better on dedicated sand teams, as does Mega Swampert under rain. While it's seldom appropriate to have doubts about including Landorus-T on teams, this in itself also paints a target on Landorus-T's back; all competent teams should, and will, have multiple answers to it.</p>",
    "comments": "<h1>Other Options</h1> <p>Rock Tomb deals more damage to a single target than Rock Slide and grants Landorus-T speed control to support its teammates. Stone Edge is another Rock-type alternative. Its inaccuracy makes it inconsistent, but it can notably OHKO bulky Mega Charizard Y and offensive variants of Zapdos. Explosion, while sacrificial, is Landorus-T's strongest attack and works particularly well with a boosting item like Life Orb or Choice Band. Hammer Arm's initial damage is less than Superpower, but it can be used repeatedly without decreasing Attack, and the Speed decreases can be considered a bonus under Trick Room. A special set utilizing Earth Power and Hidden Power Ice is also an option, working especially well on teams that otherwise struggle against opposing Landorus-T. Choice Band can catch foes off guard with a substantial power boost, but being Choice locked with a middling Speed stat can leave Landorus-T quite vulnerable. Focus Sash allows Landorus-T to survive any one move without the need for defensive investment.</p> <h1>Checks and Counters</h1> <p><strong>Water-types</strong>: Water-types, particularly bulky ones such as Tapu Fini and Suicune, can threaten Landorus-T with their super effective STAB moves, and they frequently make use of Ice Beam or Icy Wind for coverage as well. Milotic is also notable, as its Competitive ability boosts its Special Attack when Landorus-T's Intimidate activates and it is often bulky enough to take multiple Earthquakes, although it's OHKOed by Tectonic Rage after chip damage.</p> <p><strong>Ice-types</strong>: While more check than counter against Choice Scarf variants of Landorus-T thanks to a Rock Slide weakness, Ice-types such as Alolan Ninetales and Weavile nevertheless have an easy time inflicting lethal damage. Bulky attackers such as Zapdos and Porygon2 can also retaliate with their own Ice-type moves.</p> <p><strong>Intimidate and Burns</strong>: As a physical attacker reliant on moves already weakened by spread damage reduction, Landorus-T is quite vulnerable to Intimidate users such as opposing Landorus-T and to Will-O-Wisp users such as Mimikyu.</p> <p><strong>Faster Pokemon</strong>: Pokemon that use Ice-type moves and are faster than Landorus-T such as Pheromosa and Nihilego check it. Ice Punch Mega Metagross outruns non-Choice Scarf variants and avoids Intimidate with its pre-Mega ability in Clear Body. Swift Swim users such as Ludicolo outpace Choice Scarf Landorus-T and OHKO it with rain-boosted STAB moves.</p> <p><strong>Tailwind and Trick Room</strong>: The momentum Landorus-T can gain is often by use of its Speed, so removing that with Tailwind users such as Zapdos and Trick Room users such as Cresselia eliminates this advantage. Bear in mind that these will be less effective against slower variants such as bulky Assault Vest.</p> <p><strong>Grassy Terrain</strong>: Tapu Bulu's Grassy Terrain reduces the damage of Landorus-T's Earthquake, neutering the majority of Landorus-T variants. Bear in mind that this reduction doesn't affect Tectonic Rage.</p> <p><strong>Wide Guard</strong>: Wide Guard users such as Aegislash and Celesteela prevent the use of Earthquake and Rock Slide. That said, they, particularly Aegislash, do need to be careful about Tectonic Rage.</p>",
    "sets": {
      "Choice Scarf": {
        "description": "<h1>Moves</h1> <p>Earthquake is Landorus-T's strongest STAB move, sporting good power and perfect accuracy, although it does also hit the partner. Rock Slide completes the SlideQuake combination, primarily hitting Flying-types super effectively, but it is also a means to hit Fire-types without damaging an ally. Its chance to flinch pairs well with Landorus-T's high Speed with Choice Scarf. U-turn hits threats such as Cresselia and provides a means of escaping bad matchups while inflicting chip damage. The increase in the amount of safe switching out Landorus-T can achieve is also valuable for reusing Intimidate. Superpower's high power and great super effective coverage make it valuable against foes such as Mega Kangaskhan and Kartana, and it provides a strong neutral single-target option with which to finish off weakened foes. Knock Off's utility and coverage might be tempting here, but it's not recommended, as it's a poor move to be locked into given its diminished power on the following turn.</p> <h1>Set Details</h1> <p>Intimidate, Landorus-T's only ability, offers support by dropping the Attack stats of both foes when switched in. Choice Scarf allows Adamant Landorus-T to outpace almost the entire unboosted metagame, barring Pheromosa. That said, if outpacing Pheromosa and other foes like Choice Scarf Tapu Lele is desired, a Jolly nature can be used at the cost of damage output. Maximizing Speed EVs may seem excessive, but given how common Landorus-T is, ensuring a Speed tie at worst is often worth it. Since Landorus-T aims to hit as hard and fast as possible, investing all remaining EVs in Attack is fine. The four remaining EVs are placed into Special Defense to guarantee survival against Timid Tapu Lele's Psychic. If you prefer more bulk, a spread such as 68 HP / 156 Atk / 4 Def / 100 SpD / 180 Spe with an Adamant nature is an option. This enables Landorus-T to 2HKO bulky Tapu Lele with Earthquake, outrun positive-natured base 130 Speed Pokemon, and survive non-STAB Ice Beam from Pokemon such as Cresselia and Politoed, which commonly run some investment to OHKO uninvested variants of Landorus-T.</p> <h1>Usage Tips</h1> <p>This set aims to be the backbone of a team by dealing damage before any other Pokemon and constantly switching to reuse Intimidate. It works particularly well in the lead position, as Intimidate is then activated for free, and even in a bad lead matchup, it can simply use U-turn to easily switch out. Be wary of using U-turn on a foe using Protect, though, as this prevents the switch and leaves Landorus-T vulnerable to the defending Pokemon's partner. One situation you'll want to think twice about leading with Landorus-T in is against Competitive or Defiant users such as Milotic and Bisharp, which receive a boost from Intimidate's Attack drop. Don't overly worry about switching into non-lethal attacks, as Choice Scarf Landorus-T's high Speed will often leave it unthreatened even after injury. Finally, if all else fails, remember that Rock Slide has a 51% chance of making at least one foe flinch and therefore makes a good last resort.</p> <h1>Team Options</h1> <p>Utilizing one of the Guardian Deities not named Tapu Bulu is recommended to remove Grassy Terrain, which reduces Earthquake's damage. Tapu Fini is a fine option, as it threatens opposing Landorus-T with its Water-type STAB moves, a trait shared with other Water-types such as Suicune. Another option is Tapu Koko, which, among other Electric-types such as Zapdos, can scare problematic Water- and Flying-type foes. Maximizing the number of airborne partners on the team by using allies such as Cresselia and Mega Charizard Y is useful to allow the free use of Earthquake without Protect; this is particularly valuable given Landorus-T's tendency to be Choice locked into Earthquake. Furthermore, Cresselia's access to Ice Beam and Icy Wind presents another means of eliminating opposing Landorus-T. Mega Charizard Y is also notable for threatening Grass-types resist Ground. Its Drought weakening the STAB moves of Water-type attackers and allowing the instant use of Solar Beam is as much of a boon. Grass-types of your own such as Rage Powder Amoonguss and Ferrothorn can also prove effective in stopping threatening Water-types thanks to redirection and a powerful STAB move in Power Whip, respectively.</p>"
      },
      "3 Attacks + Protect": {
        "description": "<h1>Moves</h1> <p>Earthquake's excellent spread damage makes it a staple of this set and enables the use of Tectonic Rage with Groundium Z. Rock Slide notably hits Ground-immune Flying-types and grants a spread attack that leaves allies unharmed. U-turn hits Grass-types and common foes such as Cresselia super effectively, but it is largely used to pivot out of bad scenarios and make Intimidate available next turn. Superpower's main use is to hit common foes such as Mega Kangaskhan, Shuca Berry Heatran, and Tyranitar. Knock Off can remove items from foes, which is particularly potent against Berry users such as Snorlax, though it also helps deal with foes such as Cresselia and Wide Guard Aegislash. Protect allows Landorus-T to shield itself to punish double targets and safely stall out undesirable field conditions. It being so uncommon on Landorus-T makes it especially strong, as foes will rarely play around it.</p> <h1>Set Details</h1> <p>Groundium Z transforms Earthquake into Tectonic Rage, dealing more than double the damage to a single target. Life Orb's consistent power boost is a good alternative if you have many Z-Crystal users on the team as is. Intimidate is a great ability, as it provides support by dropping both foes' Attack stats when Landorus-T is switched in. Jolly is often the better choice of nature, as it allows Landorus-T to outspeed foes such as neutral-natured base 100 Speed Pokemon, Arcanine, and Jolly Gyarados. That said, an Adamant nature can be situationally important for OHKOs such as with Tectonic Rage on Mega Kangaskhan. The set's aim is to outrun and deal as much damage to as many foes as possible, so EVs of 252 Atk / 252 Spe are recommended.</p> <h1>Usage Tips</h1> <p>This set functions less as a pivot and instead aims to capitalize on Choice Scarf's popularity by picking up surprise KOs. Foes lacking Protect such as Mega Kangaskhan make good targets for this, as do unsuspecting Shuca Berry Heatran. Landorus-T works well as a lead, as leading makes a great opportunity to activate Intimidate and gain early momentum. Be wary of Competitive and Defiant users such as Milotic and Bisharp from Team Preview, though, to avoid boosting their offensive stats. Once the battle begins, Landorus-T's goal is largely to use its spread attacks in Earthquake and Rock Slide until a foe is in KO range of its stronger single-target moves in Tectonic Rage and Superpower. In general, you should avoid switching Landorus-T directly into attacks, as this set lacks the speed of Choice Scarf variants and the added bulk of Assault Vest variants, although Intimidate's value will sometimes outweigh this factor. Take advantage of this being the only set that uses Protect; you'll occassionally want to save it against unsuspecting opponents until a pivotal moment, but bear in mind that Intimidate's ability prompt may give this away early.</p> <h1>Team Options</h1> <p>Earthquake is weakened by Tapu Bulu's Grassy Terrain, so using other Guardian Deities is wise in order to expel it. Tapu Fini accomplishes this and, like other Water-types such as Suicune, can deal with opposing Landorus-T. Tapu Koko is another option and, akin to Electric-types such as Zapdos, grants an offensive check to Water-types. As this set lacks Choice Scarf's Speed boost, speed control from Pokemon such as Tailwind Zapdos and Icy Wind Cresselia can be valuable to offset this. These Pokemon also join Mega Charizard Y as great examples of airborne allies that are immune to Earthquake. Mega Charizard Y also deals with the common Wide Guard Aegislash and weakens Water-types with Drought. Grass-types such as Ferrothorn and Kartana provide a more direct response to Water-types.</p>"
      },
      "Assault Vest": {
        "description": "<h1>Moves</h1> <p>Earthquake is Landorus-T's main means of offense, dealing good spread damage albeit targeting the partner. Rock Slide usefully harms Flying-types that are immune to Ground and is a spread attack that doesn't harm allies. Superpower has great super effective coverage, hitting common foes such as Mega Kangaskhan and Tyranitar. U-turn allows Landorus-T to pivot out of bad matchups, such as against Cresselia, and activate Intimidate later in the match. Knock Off has utility in removing items and hits potentially problematic foes such as Aegislash and Metagross hard.</p> <h1>Set Details</h1> <p>Assault Vest supports Landorus-T's role as a pivot by raising Special Defense, allowing it to switch into attacks more easily. Intimidate complements Assault Vest by allowing Landorus-T to take attacks well on both fronts. Jolly is generally the preferred nature for outpacing foes such as base 100 Speed Pokemon and Hydreigon, but an Adamant nature offers more damage if Speed is less important. While simple EVs may seem odd with Assault Vest, Landorus-T's natural bulk means further investment isn't strictly needed. That said, a spread such as 148 HP / 124 Atk / 4 Def / 4 SpD / 228 Spe with a Jolly nature is an option to ensure victory against Mega Charizard Y. It does so by allowing Landorus-T to outspeed and KO Modest Mega Charizard Y and survive Timid Mega Charizard Y's Overheat. This is in addition to OHKOing Tapu Koko with Earthquake and taking two of Jolly Mega Kangaskhan's Return and Araquanid's Liquidation with Intimidate. This set's bulk makes it most able to drop Speed EVs, so take advantage of this if you don't find the Speed as necessary, for example, on a Trick Room team, and prefer more bulk. For instance, dropping to 148 Speed EVs with an Adamant nature still lets Landorus-T outrun Modest Heatran, while zero EVs can be used to maximize bulk.</p> <h1>Usage Tips</h1> <p>Landorus-T works well at all game stages, but especially so as a lead thanks to Intimidate and access to U-turn. Using this set well is a balance of dealing maximum spread damage and keeping it available as a switch-in to attacks; most of that shouldn't be a problem, but since Landorus-T lacks recovery, severe blows may impede its ability to maintain a presence late-game. Strong special attackers such as Tapu Lele and Mega Charizard Y are the main culprits in regards to dealing more damage than is comfortable. Opponents will expect the more common Choice Scarf set, so maintaining that bluff until a critical moment can be valuable to catch your opponent off guard. Bear in mind that using U-turn on a foe using Protect prevents a switch and leaves Landorus-T vulnerable to the defending Pokemon's partner; if this risks excessive damage, it may be better to manually switch. Against potential Wide Guard users, it's often better to not risk momentum loss and use a move from either the third or fourth moveslots.</p> <h1>Team Options</h1> <p>Make use of a Guardian Deity not named Tapu Bulu to prevent Grassy Terrain from reducing the damage of Earthquake. Tapu Koko is great for this, since it can also check Water-types and use Taunt to stop speed control and Wide Guard. Zapdos and Thundurus-T are other Electric-type options and have the benefit that they're immune to Earthquake use. While airborne partners like the aforementioned are less crucial to this set because it can switch moves freely, they're nonetheless a bonus. Grass-types like Rage Powder Amoonguss and Ferrothorn can also check Water-types; the former is particularly useful through redirecting their moves. Ferrothorn also joins other Steel-types such as Aegislash and Mega Metagross in checking threatening Ice-types. Fire-types such as Mega Charizard Y and Heatran likewise check Ice-types, in addition to Wide Guard Aegislash. Mega Charizard Y, along with Cresselia and Hydreigon, is yet another example of a partner that is safe to use with Earthquake.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Carbonific", "user_id": 233942}], "teams": [{"name": "Quality checked by", "members": [{"username": "Demantoid", "user_id": 264687}, {"username": "Psynergy", "user_id": 248085}]}, {"name": "Grammar checked by", "members": [{"username": "CryoGyro", "user_id": 331519}, {"username": "Lumari", "user_id": 232216}]}]}
  },
  "Incineroar": {
    "overview": "<ul> <li> <p>Incineroar boasts the ability to check several Pokemon in the VGC metagame, including Cresselia, Aegislash, and Celesteela.</p> </li> <li> <p>It also provides invaluable Fake Out support, allowing it to disrupt opposing teams and support a teammate by immobilizing a foe for one turn.</p> </li> <li> <p>Intimidate adds to Incineroar's supportive capabilities, enabling it to lower the Attack stats of both opposing Pokemon. Furthermore, access to Snarl allows it to weaken special attackers as well.</p> </li> <li> <p>Despite its ability to check many popular Pokemon and its supportive capabilities, Incineroar is held back by its weakness to Landorus-T, which can easily reduce its damage output with Intimidate and deal significant damage to it with Earthquake.</p> </li> <li> <p>In addition, Incineroar's best Fire-type attack dealing recoil damage limits its staying power despite its solid bulk.</p> </li> </ul>",
    "sets": {
      "Fake Out Support": {
        "description": "<ul> <li> <p>Fake Out is one of Incineroar's main selling points, allowing it to immobilize foes for a turn. This has a multitude of applications, including breaking a foe's Focus Sash and enabling an ally to remain safe from a threatening foe for that turn.</p> </li> <li> <p>Flare Blitz is Incineroar's go-to Fire-type STAB move, enabling it to deal heavy damage to Pokemon like Celesteela, Ferrothorn, and Aegislash.</p> </li> <li> <p>In addition to dealing solid Dark-type damage, Knock Off enables Incineroar to remove items, especially items like Berries and Assault Vest, the removal of which makes the defensive Pokemon that carry them less threatening.</p> </li> <li> <p>Low Kick lets Incineroar deal damage to Tyranitar and Heatran, which otherwise don't mind facing it.</p> </li> <li> <p>Darkest Lariat allows Incineroar to use Malicious Moonsault, which scores OHKOs on Cresselia, Mega Charizard Y, and Mega Metagross, among others, depending on their EV spreads.</p> </li> <li> <p>Firium Z allows Incineroar to use Inferno Overdrive, which, along with giving it a strong, single-use Fire-type attack that deals no recoil damage, is a non-contact move, allowing it to be used into Aegislash's King's Shield without causing an Attack drop.</p> </li> <li> <p>If Incineroar is carrying Incinium Z or Iapapa Berry, Protect may be used in order to allow it to protect itself from a foe while its ally handles said foe.</p> </li> <li> <p>Incineroar may also consider using Snarl, which gives it additional utility in weakening special attackers like Tapu Koko and Tapu Lele.</p> </li> <li> <p>Taunt can also be a useful move, as it allows Incineroar to prevent Trick Room from being set up.</p> </li> <li> <p>Incineroar can also make use of U-turn to deal chip damage and switch out for another teammate. Thanks to Incineroar's low Speed, this helps that teammate switch in unscathed and allows Incineroar to refresh its Fake Out and Intimidate.</p> </li> <li> <p>Intimidate has immense utility, lowering the Attack stat of both opposing Pokemon any time Incineroar is sent out.</p> </li> <li> <p>An Adamant nature is used in order to improve Incineroar's damage output.</p> </li> <li> <p>Assuming Incineroar's held item is Assault Vest, the given EV spread ensures Tapu Koko never 2HKOes it with Thunderbolt.</p> </li> <li> <p>If Incineroar carries Incinium Z or Iapapa Berry instead of Assault Vest, the specially defensive benchmark is no longer relevant, so Incineroar should run a spread of 252 HP / 252 Atk / 4 SpD in those cases.</p> </li> <li> <p>Iapapa Berry may be used if Incineroar needs to carry a status move like Protect or Taunt but still wants an improvement in bulk. It also enables Incineroar to recover from Flare Blitz recoil, lessening the drawback from it.</p> </li> <li> <p>Given Incineroar's ability to check Pokemon like Celesteela and Aegislash, Pokemon like Mega Gardevoir and Kommo-o value its support.</p> </li> <li> <p>Pokemon like Milotic, Cresselia, and Suicune make for good partners for Incineroar, given that they have the ability to answer Landorus-T for it.</p> </li> <li> <p>Grass-types like Kartana and Electric-types like Tapu Koko handle Milotic, which boasts the ability to turn Incineroar into a liability thanks to Competitive, as well as other Water-types like Suicune and Tapu Fini that Incineroar can't handle on its own.</p> </li> <li> <p>Using one or two of Tapu Koko, Tapu Bulu, and Tapu Fini is recommended; although Incineroar is not too threatened by Tapu Lele itself, it still appreciates the removal of Psychic Terrain, given that Psychic Terrain prevents it from using Fake Out.</p> </li> <li> <p>Pokemon with moves like Tailwind and Trick Room, such as Suicune and Cresselia, appreciate Incineroar's Fake Out support, as Incineroar can immobilize a user of a move like Taunt that would prevent their setup. Incineroar also appreciates both of these forms of speed control, given its lackluster Speed stat.</p> </li> <li> <p>If using Incineroar alongside Tailwind, running 76 Speed EVs may be considered so as to allow Incineroar to outspeed Mega Metagross under Tailwind.</p> </li> <li> <p>If using Incineroar on a Trick Room team, make sure to use a Brave nature with 0 Speed IVs in order to ensure that Incineroar maximizes its benefit from Trick Room.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "Adamant Zoroark", "user_id": 102162}], "teams": [{"name": "Quality checked by", "members": [{"username": "Jio", "user_id": 22788}, {"username": "Charlotte", "user_id": 159382}]}, {"name": "Grammar checked by", "members": [{"username": "P Squared", "user_id": 168392}]}]}
  },
  "Pheromosa": {"sets": {"All-out Attacker": {"description": "<p>Pheromosa is an effective, albeit frail, attacker used on offensive teams to check problematic foes such as Landorus-T and Mega Kangaskhan. High Jump Kick is the more generally useful Fighting-type STAB move, as it has high Base Power and accuracy. The downside of taking recoil damage upon missing is also less of an issue for an already frail Pokemon like Pheromosa. Focus Blast can be used with Fightinium Z for a special attacking option that isn’t hindered by Intimidate. Tapu Lele is a good partner, as it prevents foes from finishing Pheromosa off with priority moves. Mega Charizard Y enjoys Landorus-T being accounted for.</p>"}}, "credits": {"writtenBy": [{"username": "Carbonific", "user_id": 233942}], "teams": [{"name": "Quality checked by", "members": [{"username": "Charlotte", "user_id": 159382}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}]}]}},
  "Celesteela": {"sets": {"Defensive": {"description": "<p>Celesteela’s defensive typing and stats make it well able to switch into attacks aimed at partners. Leech Seed and Leftovers complement this, and also make Substitute a good choice in the third moveslot. The given EVs let Celesteela OHKO 252 HP Tapu Lele and ensure Timid Tapu Lele’s Psychic doesn’t break Celesteela’s Substitute. When Wide Guard’s utility is preferred, use 244 HP / 28 Atk / 156 Def / 76 SpD / 4 Spe for general bulk that still results in Beast Boost increasing Special Defense. Ground-types such as Landorus-T make good partners, as they beat threatening Electric- and Fire-types, and can Earthquake freely alongside a Flying-type.</p>"}}, "credits": {"writtenBy": [{"username": "Carbonific", "user_id": 233942}], "teams": [{"name": "Quality checked by", "members": [{"username": "Charlotte", "user_id": 159382}]}, {"name": "Grammar checked by", "members": [{"username": "GatoDelFuego", "user_id": 91628}]}]}},
  "Kartana": {
    "overview": "<p>Kartana is a monstrously strong as well as fast attacker that, thanks to Beast Boost, can become even scarier as it racks up Attack boosts with each KO inflicted. Even with its limited attacking toolkit, rarely running more than just Leaf Blade and Sacred Sword, it still manages to pressure metagame staples such as Tapu Fini and Snorlax. It can also provide speed control for its team with Tailwind or set up with moves like Swords Dance and Substitute, both of which put a great deal of pressure on the opposing Pokemon. Unfortunately, Kartana's paper-thin Special Defense will leave it easily OHKOed by even weak special attacks such as Porygon2's boosted Ice Beam or Mega Salamence's Hyper Voice. Additionally, Kartana also struggles with Fire-types like the commonplace Incineroar and Charizard, as well as Flying-types like Zapdos and Mega Salamence, which it cannot hit hard.</p>",
    "sets": {
      "Focus Sash": {
        "description": "<p>Leaf Blade is Kartana's primary STAB move, as it hits several Pokemon like Tapu Fini and Politoed for super effective damage and does considerable damage to neutral targets like Tapu Koko and Tapu Lele. Sacred Sword hits Pokemon like Porygon2, Mega Kangaskhan, and Snorlax for massive damage while also ignoring Defense and evasion stat changes. Combined with Focus Sash, Kartana can usually push out a Tailwind early-game to gain the Speed advantage for the party, or as a last ditch effort while it hangs on with 1 HP. Swords Dance is an alternative to Tailwind that lets Kartana become an unstoppable offensive threat if left unattended for too long. Detect helps preserve Kartana or bait foes when it's barely hanging on, and it bypasses Imprison users running Protect. Focus Sash lets Kartana focus all of its EVs in Attack and Speed.</p> <p>Focus Sash Kartana pairs up well with Mega Charizard Y. Kartana’s coverage allows it to cut down Pokemon like Tyranitar and Politoed, which pose a threat to Mega Charizard Y as well as the sun it brings. Tailwind also allows for the two to outrun foes like Tapu Koko and Choice Scarf Landorus-T to sweep with powerful physical and special attacks. Kartana also pairs well with Tapu Fini and Incineroar, as these two are strong switch-ins to make up for its weaknesses, as well as providing it Fake Out and Misty Terrain. Tapu Lele's Psychic Terrain protects Kartana from priority moves like Fake Out and Sucker Punch breaking its Focus Sash prematurely, making it a strong partner as well.</p>"
      },
      "Z-Move": {
        "description": "<p>Leaf Blade is your primary STAB move to cut down bulky Water-types like Tapu Fini and Milotic, as well as about anything that doesn't resist it. With Grassium Z, Bloom Doom takes quick KOs on Pokemon like Landorus-T and ensures OHKOs on Pokemon like Tapu Fini, which can survive Leaf Blade at -1 Attack. Sacred Sword lets Kartana hit Normal-types and Steel-types for more damage than Leaf Blade, and All-Out Pummeling with Fightinium Z lets it break through some of the bulkiest Pokemon in the format like Snorlax, Porygon2, Incineroar, and Heatran, which can all withstand several Sacred Swords. Substitute allows Kartana to preserve itself and take hits it would never realistically survive. Substitute also has the added benefit of blocking Intimidate. Swords Dance similarly lets Kartana counteract Intimidate and snowball through teams unmatched. Tailwind lets Kartana and its team outrun fast Pokemon like Tapu Koko, Choice Scarf Landorus-T, and Ludicolo under rain, as well as allowing it to nuke those threats with a powerful Z-Move before they get the chance to move. All three of these third-moveslot moves allow Kartana to capitalize on positions where its offensive pressure forces the opponent to play safely. Detect shields Kartana from any unfavorable attacks that might OHKO it; however, the given EV spread lets Kartana survive some of the format’s strongest special attacks like Tapu Lele Psychic and Life Orb Tapu Koko Thunderbolt. It can also withstand Gigavolt Havoc from Tapu Koko with Electric Terrain removed.</p> <p>Z-Move Kartana prefers partners that it can clear paths for, or that help it set up. Incineroar and Tapu Fini provide valuable Fake Out for setup and bulky switch-ins for the frail Kartana. Electric-types like Tapu Koko and Zapdos also make good partners, as they can use strong Electric-type attacks to help put Pokemon like Incineroar and Tapu Fini in range for Kartana to pick off, as well as helping defeat Mega Charizard Y. Mega Gengar is a superb partner, as Shadow Tag lets Kartana easily pick off trapped foes, and it can assist Kartana with strong special attacks, high Speed, and support moves like Icy Wind. Mega Kangaskhan lets Kartana set up with Fake Out, and the two can push through teams together with powerful physical attacks.</p>"
      },
      "Bulky Berry": {
        "description": "<p>Leaf Blade is Kartana's main attack, as it is powerful and reliable. Sacred Sword lets Kartana hit Steel-types like Stakataka and Bisharp, as well as bulkier targets like Incineroar. Tailwind lets Kartana boost its Speed considerably, as this set is only built to outrun 252 Speed Landorus-T. Substitute gives Kartana a strong option to preserve itself and more chances to activate its Aguav Berry, since its HP is divisible by four. Detect lets Kartana also preserves it, as well as helping it take most Z-Moves, which other sets cannot shrug off as easily even with a quarter of the initial power. The given bulky EV spread helps Kartana pave through foes at a slower pace. While slowing it, the Adamant nature lets it keep up with 252 Attack Kartana, and bulk investment lets it survive what no other Kartana can, like Mega Gengar Shadow Ball and Tapu Koko Gigavolt Havoc in Electric Terrain. Aguav Berry's longevity complements this the slow pace of this set perfectly to boot.</p> <p>Due to this Kartana's lacking Speed investment, it often prefers to be paired with speedy Pokemon. Mega Gengar and Choice Scarf Landorus-T make fast, strong partners that help Kartana with their abilities as well, allowing it to survive longer and push out more attacks. Tapu Koko and Nihilego are fast and also can pressure threats like Mega Charizard Y and Zapdos that outspeed Kartana with Z-Move OHKOs.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "TheKingVillager", "user_id": 552835}], "teams": [{"name": "Quality checked by", "members": [{"username": "zee", "user_id": 501951}, {"username": "Giokio", "user_id": 517038}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Naganadel": {
    "sets": {"Offensive Tailwind": {"description": "<p>Naganadel is largely unremarkable, though its access to Tailwind remedies this. Sludge Bomb is the main attacking move, while the options in the third move slot cover foes that resist it. Flamethrower is often preferred, although Hidden Power Ground covers Heatran. Focus Sash ensures Tailwind can be used when against Choice Scarf users, and guarantees Naganadel a hit afterwards. Life Orb and Poisonium Z give Naganadel the ability to OHKO Tapu Fini and Tapu Lele respectively. Fake Out users such as Mega Kangaskhan help provide the opportunity to use Tailwind. Mega Charizard Y appreciates the removal of the Tapu Fini and Tapu Koko and benefits greatly from Tailwind.</p>"}},
    "credits": {"writtenBy": [{"username": "Carbonific", "user_id": 233942}], "teams": [{"name": "Quality checked by", "members": [{"username": "Charlotte", "user_id": 159382}]}, {"name": "Grammar checked by", "members": [{"username": "GatoDelFuego", "user_id": 91628}]}]}
  },
  "Stakataka": {
    "sets": {"Offensive Trick Room": {"description": "<p>Stakataka’s high Attack and low Speed make it an excellent offensive Trick Room setter. In the fourth moveslot, Wide Guard can replace Protect to shield against Earthquake and defend partners such as Mega Charizard Y from Rock Slide. A Lonely nature and 17 Defense IVs ensure Beast Boost increases Attack when a foe is KOed, although Brave and maximum Defense IVs are an option if you’d prefer a chance of survival against attacks such as Landorus-T’s Earthquake and Tyranitar’s Low Kick. Cresselia is recommended as a secondary Trick Room setter on hard Trick Room teams, as it can set Trick Room in the face of Fighting- and Ground-type moves from foes such as Landorus-T and Mega Kangaskhan.</p>"}},
    "credits": {"writtenBy": [{"username": "Carbonific", "user_id": 233942}], "teams": [{"name": "Quality checked by", "members": [{"username": "Charlotte", "user_id": 159382}]}, {"name": "Grammar checked by", "members": [{"username": "GatoDelFuego", "user_id": 91628}]}]}
  },
  "Blacephalon": {
    "overview": "<ul> <li> <p>Blacephalon is among the fastest usable Fire-types in VGC, and its access to Beast Boost and Heat Wave can allow it to sweep through weakened teams.</p> </li> <li> <p>Blacephalon has enough Special Attack to deal serious damage, even before a Beast Boost</p> </li> <li> <p>Ghost is a good secondary offensive typing that allows Blacephalon to hit Cresselia and Tapu Lele hard and avoid Fake Out, with the exception of Scrappy Kangaskhan's Fake Out.</p> </li> <li> <p>Blacephalon's defenses are pathetic, with most strong neutral hits at least 2HKOing it.</p> </li> <li> <p>Blacephalon has a poor offensive movepool that mostly limits it to Fire- and Ghost-type coverage in addition to a Hidden Power, so it'll almost always be walled by something.</p> </li> <li> <p>Blacephalon becomes much easier to handle when rain is up, which is fairly common in VGC.</p> </li> </ul>",
    "sets": {
      "Choice Scarf": {
        "description": "<ul> <li> <p>With a Choice Scarf, Blacephalon will outspeed many prominent threats, such as Tapu Koko, Choice Scarf Landorus-T, and Mega Salamence.</p> </li> <li> <p>Heat Wave is Blacephalon's spread move of choice. Mind Blown may be tempting, but it's extremely awkward to be locked into, since it 2HKOes Blacephalon and hits your teammate.</p> </li> <li> <p>Shadow Ball is Blacephalon's strongest Ghost-type attack, 2HKOing offensive Cresselia and being Blacephalon's strongest attack in the rain.</p> </li> <li> <p>Hidden Power Ice is hard to pass up, since it OHKOes offensive Landorus-T and Mega Salamence. Hidden Power Ground can be used to severely damage Heatran, but the move doesn't take advantage of Choice Scarf as well.</p> </li> <li> <p>Blacephalon will need a single target Fire-type attack to deal with Wide Guard. Flamethrower is the most reliable option, OHKOing Mega Metagross, but Fire Blast offers extreme power at the cost of accuracy.</p> </li> <li> <p>While Blacephalon can be used early-game to pressure certain leads, it often works best late-game where it can use Heat Wave to clean weakened teams or get a reliable Beast Boost.</p> </li> <li> <p>Pairing Blacephalon with sun support is a good idea, making its Fire-type STAB moves extremely powerful and Water-types more manageable. Mega Charizard Y is an easy option for this due to Drought, but manual users of Sunny Day such as Cresselia and Whimsicott can also work to surprise rain teams.</p> </li> <li> <p>Tapu Lele is another teammate to consider, since its Psychic Terrain blocks deadly Sucker Punches from the likes of Mega Kangaskhan, and it can scout for leading Choice Scarf Landorus-T for Blacephalon to target.</p> </li> </ul>"
      },
      "Special Attacker": {
        "description": "<ul> <li> <p>Heat Wave is Blacephalon's most reliable spread attack.</p> </li> <li> <p>Shadow Ball hits Cresselia hard, especially if using Ghostium Z, and is also a good STAB to use if it's raining.</p> </li> <li> <p>Hidden Power Ice gets an OHKO on Mega Salamence and offensive Landorus-T, while Substitute helps Blacephalon against Sucker Punch. Flamethrower can also be used as a back-up Fire-type attack if Wide Guard is in play from the likes of Celesteela or Aegislash, while Overheat is a more powerful option for use with Firium Z.</p> </li> <li> <p>Protect allows Blacephalon to take advantage of its tendency to become the target of attacks.</p> </li> <li> <p>Ghostium Z allows Blacephalon to OHKO offensive Cresselia, and deal 81% minimum to specially defensive Cresselia.</p> </li> <li> <p>Life Orb is a reliable item for dealing extra damage, at the cost of the recoil making Blacephalon more vulnerable to weak priority attacks.</p> </li> <li> <p>Firium Z is also an acceptable option, especially if Overheat or Mind Blown is chosen as a secondary Fire-type attack, since Inferno Overdrive from these base moves will OHKO Mega Kangaskhan.</p> </li> <li> <p>Speed control of some sort is highly recommended for Blacephalon, since this helps it deal with common speedy Pokemon such as Tapu Koko and Choice Scarf Landorus-T. Tailwind is a prime example of this, with plenty of possible users such as Mega Charizard Y, Suicune, and Mega Salamence. Icy Wind from the likes of Cresselia and Tapu Fini can also be useful.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "Theorymon", "user_id": 29010}], "teams": [{"name": "Quality checked by", "members": [{"username": "Charlotte", "user_id": 159382}, {"username": "Demantoid", "user_id": 264687}, {"username": "Jio", "user_id": 22788}, {"username": "Carbonific", "user_id": 233942}]}, {"name": "Grammar checked by", "members": [{"username": "talkingtree", "user_id": 232101}]}]}
  }
}