{
  "Tapu Lele": {
    "overview": "<p>The incredible ability Psychic Surge allows Tapu Lele to act as a check to Extreme Speed users and gives it the ability to support priority-weak members of its team. Psychic Terrain also gives a potent boost to Psychic-type attacks, which alongside strong STAB moves and an excellent Special Attack stat makes Tapu Lele extremely difficult to switch into and allows it to effectively break defensive cores. However, a low base Speed means it can still be outpaced even with Sticky Web support or Diancite's Speed boost. Tapu Lele's lack of useful coverage options also means it has difficulty dealing with most Steel-type Pokemon, although it can wear them down with powerful resisted attacks.</p>",
    "comments": "<h3>Other Options</h3> <p>Thunderbolt is an option on the Diancite set to hit Metagross and Skarmory harder, but it is generally inferior to other options. Taunt may be used to prevent recovery, but most defensive Pokemon that can answer Tapu Lele have Magic Bounce, so its utility is largely limited to anti-leading Sticky Web teams. Hidden Power Fire may be used to beat Buzzwole and Kartana, but it's too weak to seriously threaten most other Steel-type Pokemon, and the latter is OHKOed by Psychic in Psychic Terrain, leaving it little niche over Focus Blast. Terrain Extender may be used to support Psychic spam team archetypes with additional Terrain turns but has little utility outside of those teams.</p> <h3>Checks and Counters</h3> <p><strong>Steel-type Pokemon</strong>: The likes of Necrozma-DM, Metagross, Aggronite Mew, and Magearna can give Tapu Lele issues. Steel-type Pokemon resist both of Tapu Lele's STAB attacks, and it lacks any reliable coverage options to take them out. Most Steel-type Pokemon can threaten Tapu Lele with an OHKO, and several also have recovery to do so throughout the match. Most Steel-type Pokemon have difficulty switching into the Lucarionite set, however, particularly after a Calm Mind boost. Even those with a secondary Psychic typing that allows them to wall Tapu Lele's attacks more reliably do not appreciate the damage taken from Nature's Madness.</p> <p><strong>Lunala</strong>: Lunala resists Psychic-type attacks and takes Moonblast with ease thanks to Shadow Shield and its excellent bulk. While it is weak to Shadow Ball, Shadow Shield prevents that from OHKOing it, and it can OHKO Tapu Lele in return with its powerful Moongeist Beam.</p> <p><strong>Faster Pokemon</strong>: While the Diancite set is extremely fast, Pokemon that outspeed it such as Diancite Shaymin-S, Diancite Terrakion, and Choice Scarf Xerneas, are all major threats to it thanks to its extremely low bulk. The Lucarionite set is outsped by more Pokemon, but thanks to its adequate special bulk after setting up it is generally only weak to faster physical attackers, and it can still outpace most of the metagame with Sticky Web support.</p> <p><strong>Psychic-type Pokemon</strong>: Psychic-type Pokemon, such as Mew, Azelf, and Victini, resist Tapu Lele's Psychic-type attacks and can take every coverage attack bar Shadow Ball reasonably well. While they have difficulty switching into Tapu Lele or forcing it out after boosts, they serve as solid checks and can impede its sweep.</p> <p><strong>Specially Defensive Tanks</strong>: Specially defensive tanks such as Blissey and Ho-Oh can give Tapu Lele some trouble if it doesn't run Psyshock, but if it does they have severe difficulties taking it on.</p>",
    "sets": {
      "Diancite Sweeper": {
        "description": "<h4>Moves</h4> <p>Psychic is Tapu Lele's primary STAB attack; it can threaten many common offensive Pokemon such as Landorus-T and Terrakion with an OHKO and deals heavy damage to almost any switch-in, while Psyshock trades raw power for the ability to hit specially defensive Pokemon and thus better deal with the likes of Blissey, opposing Calm Mind users, and specially defensive Magearna. Moonblast is a weaker secondary STAB attack that allows Tapu Lele to handle Dark-type Pokemon such as Yveltal and Weavile as well as deal additional damage to the likes of Zygarde. Nature's Madness removes half of the foe's HP, allowing Tapu Lele to wear down or cripple would-be switch-ins such as Magearna without having to activate Diancite and give up Psychic Surge. Calm Mind is another option that boosts Tapu Lele's Special Attack and Special Defense to allow it to break most defensive teams and decrease the need to predict switches. Shadow Ball hits Lunala, Mew, and Necrozma-DM hard, but it deals little damage unless it hits super effectively. Focus Blast hits Steel-type Pokemon, deals solid damage to Blissey, and rounds out Tapu Lele's perfect coverage if used alongside Shadow Ball, but it is generally inferior to the above options.</p> <h4>Set Details</h4> <p>Psychic Surge powers up Tapu Lele's Psychic-type moves, even after it Mega Evolves, and allows it to take on priority users such as Extreme Speed Zygarde and Entei despite its paper-thin defenses. Diancite increases Tapu Lele's Special Attack and Speed at the cost of its defenses and gives it the excellent Magic Bounce ability after Mega Evolving, which gives Tapu Lele free opportunities to switch in against many defensive Pokemon and allows it to better take on Toxic or Confide Blissey. 252 Speed EVs, a Timid nature, and Diancite's additional 60 Base Speed allow Tapu Lele to outpace almost the entire unboosted metagame and a large portion of its setup sweepers, particularly threatening offensive Pokemon such as Kartana. 252 Special Attack EVs maximize Tapu Lele's damage output.</p> <h4>Usage Tips</h4> <p>When using Tapu Lele to revenge kill boosted Altarianite Zygarde, attempt to make sure it is not running a Jolly nature with Return; any other set at +1 can be beaten, but Jolly Return will simply OHKO Tapu Lele and continue the sweep largely unimpeded. Once Tapu Lele Mega Evolves, its chance to sweep offense is on a timer; while it is still a very effective Pokemon, Tapu Lele outside of Psychic Terrain is far easier to switch into or revenge kill. For this reason, it can often be worthwhile to refrain from Mega Evolving until necessary. Use Nature's Madness to hit would-be switch-ins, as it ignores type resistances and can cripple checks like Magearna and Double Dance Necrozma-DM that lack reliable recovery. If you need to boost, attempt to do so on passive Pokemon such as Blissey, on Pokemon Tapu Lele forces out such as Terrakion, or on weak special attackers such as support Arceus formes and Manectite Mew. Tapu Lele is too frail to readily switch in, but in a pinch, it can come in on an Extreme Speed or Fighting-type attack pre-Mega Evolution or on status moves such as Toxic post-Mega Evolution.</p> <h4>Team Options</h4> <p>Ho-Oh switches into and takes on most of the Steel-type Pokemon that give Tapu Lele trouble, such as Magearna, Necrozma-DM, and Aggronite Mew. In return, Tapu Lele punishes reckless Stealth Rock plays and can take on annoying threats such as Terrakion for Ho-Oh. Despite the clash between Extreme Speed and Psychic Terrain, Entei makes a great partner for Tapu Lele; it can take on annoying Steel-type Pokemon and takes pressure off Tapu Lele to revenge kill Altarianite Zygarde, while in return Tapu Lele gives the defensive Pokemon that like to switch into Entei trouble. Stealth Rock users such as Primal Groudon, Terrakion, Shuckle, and Landorus-T are great for wearing down switch-ins such as Mew and breaking Lunala's Shadow Shield for Tapu Lele. Darkrai appreciates Tapu Lele's Psychic Terrain, which allows it to take on opposing Pixilate Extreme Speed users with ease, and enjoys Tapu Lele's ability to put pressure on Pokemon such as Blissey, Ho-Oh, and Magearna; in return, Darkrai takes on Pokemon like Mew that give Tapu Lele trouble and can weaken their shared checks to let Tapu Lele clean. Azelf and Ultra Necrozma appreciate the boost to their Psychic-type attacks that Tapu Lele provides; the latter also enjoys protection from Pixilate Extreme Speed, which would otherwise readily revenge kill it. Pivots such as Magearna, Yveltal, Mandibuzz, and Gliscor are handy to get Tapu Lele in safely, as it has difficulty switching into even resisted attacks.</p>"
      },
      "Lucarionite Wallbreaker": {
        "description": "<h4>Moves</h4> <p>Calm Mind boosts Tapu Lele's Special Attack to absurd levels, allowing it to OHKO even bulky Pokemon such as support Primal Groudon, support Arceus formes, and Ho-Oh after a single boost. Psychic is Tapu Lele's primary STAB attack and allows it to blow past essentially every Pokemon that does not resist it. Moonblast hits Dark- and Psychic-type Pokemon and gives Tapu Lele a slightly stronger STAB option after Psychic Terrain runs out. Psyshock hits specially defensive Pokemon such as Blissey, Ho-Oh, and Sablenite Magearna for extra damage. Focus Blast is another option to deal with Steel-type Pokemon a bit better, but it is weaker than Tapu Lele's Psychic-type attacks against almost all Pokemon.</p> <h4>Set Details</h4> <p>Psychic Surge powers up Tapu Lele's Psychic-type moves, even after it Mega Evolves, and makes it almost impossible to switch into. Lucarionite boosts Tapu Lele's Speed and Special Attack stats and grants it the ability Adaptability, which increases the power of its STAB moves. 252 Speed EVs and Lucarionite allow Tapu Lele to outpace essentially every defensive Pokemon and many offensive ones.</p> <h4>Usage Tips</h4> <p>Bring Tapu Lele in on Pokemon it forces out, such as Gliscor, Toxapex, and Altarianite Zygarde. While Sticky Web is invaluable against offense, most bulky teams are slow enough that Tapu Lele can do without it. If there's a chance Tapu Lele may be forced to switch out, it can be advantageous to refrain from Mega Evolving to keep Psychic Surge for later on. Don't be afraid to set up against teams with Magearna; at +1, Tapu Lele can 2HKO even Sablenite Magearna if they don't use Pain Split, and Tapu Lele is specially bulky enough to take a hit at +1 Special Defense readily. It can sometimes be a good idea to sacrifice Tapu Lele to allow another Pokemon such as Ultra Necrozma to sweep an opposing team without being revenge killed by Extreme Speed users.</p> <h4>Team Options</h4> <p>Shuckle can set Sticky Web for Tapu Lele, allowing it to outpace almost the entire metagame and aid it in sweeping past offensive teams. Azelf can deal with annoying Steel-type Pokemon with Fire Blast, is a huge benefit in Sticky Web mirror matches, and appreciates the extra power on Psyshock for taking on Blissey and Ho-Oh once it Mega Evolves. Tapu Lele can also force the opponent to switch in and weaken shared checks for Azelf such as Lunala and Blue Orb Magearna. Terrakion deals with special walls that might otherwise annoy Tapu Lele such as Ho-Oh and can use Taunt to prevent Defog or recovery. Primal Groudon checks the likes of Aggronite Mew and Magearna for Tapu Lele and can set Stealth Rock to break Lunala's Shadow Shield. Tapu Lele, meanwhile, can take on Dragon-type Pokemon such as Giratina and Zygarde-C that give Primal Groudon trouble. Other Psychic-type Pokemon such as Ultra Necrozma and Choice Specs Lunala appreciate the power boost from Psychic Terrain, and can in turn aid in wearing down their shared answers such as Magearna. Ho-Oh is useful for dealing with Steel-type Pokemon that Tapu Lele cannot readily break, such as Necrozma-DM and Aggronite Mew.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 297239, "username": "Quantum Tesseract"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 376369, "username": "astralydia"}, {"user_id": 324242, "username": "in the hills"}, {"user_id": 257571, "username": "Andyboy"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "Lumari"}, {"user_id": 53214, "username": "JockeMS"}]}]}
  },
  "Blissey": {
    "overview": "<p>With Sablenite, Blissey becomes an extremely bulky wall that can sponge unboosted attacks from the likes of Primal Groudon, Magearna, and Darkrai. Because of this, Blissey can be used as a wall that can shrug off damage while providing support for its team. Blissey's pure Normal typing is also quite helpful, as it is only weak to Fighting. Furthermore, Magic Bounce from Sablenite, not only helps prevent entry hazards but also prevents it from being affected by direct status. However, due to Blissey's lackluster offensive stats, many offensive threats are able to utilize it as a setup opportunity. Blissey's passive nature also renders it useless against most opposing Magic Bounce users. However, all things considered, Blissey is still the premier wall in the tier due to its sheer defensive capabilities.</p>",
    "comments": "<h3>Other Options</h3> <p>Calm Mind can be run in tandem with Ice Beam and Thunderbolt to allow Blissey to become an offensive threat, but such a set is generally outclassed by other Sablenite users, such as Nasty Plot Sablenite Mew. Slowbronite can give Blissey a larger defensive boost, but the loss of Magic Bounce and 50 Special Defense is generally a bad trade off. Healing Wish can also be used to provide team support but is generally hard to pull off and can end up being a waste of a moveslot. A more specially defensive EV spread can be run to take on special attackers better, but the Special Defense boost is quite measly and comes at a large cost of leaving Blissey extremely susceptible to any physical hit.</p> <h3>Checks and Counters</h3> <p><strong>Fighting-types</strong>: Lucarionite Terrakion and Lucarionite Keldeo pose giant threats to Blissey with their STAB fighting moves, allowing them to break through Blissey's strong defenses.</p> <p><strong>Physical Setup</strong>: Swords Dance Primal Groudon, Swords Dance Salamencite Landorus-T, and Dragon Dance Zygarde all have the power to break past Blissey with repeated boosts. Due to Blissey's relatively passive nature, it can become setup fodder for these sweepers.</p> <p><strong>Steel-types</strong>: Defensive Steel-types, such as Aggronite Mew and Blue Orb Skarmory, do not really mind Blissey's attacks and are immune to Toxic. Offensive Steel-types such as Metagrossite Kartana and Necrozma-DM can overpower Blissey with Swords Dance.</p> <p><strong>Powerful Physical Attacks</strong>: While there are not many physical attackers that can 2HKO Blissey unboosted, Red Orb Victini can do so with V-create and thus heavily threatens it.</p> <p><strong>Offensive Pressure</strong>: Offensive Pokemon in general such as Primal Groudon, Zygarde, and Entei pressure Blissey and leave it stuck recovering, limiting its ability to provide support.</p> <p><strong>Mold Breaker</strong>: Gyaradosite threats, such as Toxapex and Shuckle, ignore Blissey's Magic Bounce and can threaten to wear it down with Toxic or set entry hazards.</p>",
    "sets": {
      "Sablenite Support": {
        "description": "<h4>Moves</h4> <p>Soft-Boiled is Blissey's primary way of recovery, restoring 50% of its maximum health and allowing Blissey to remain healthy throughout the match. Seismic Toss is used for reliable damage but comes at the cost of being unable to hit Ghost-types. Psywave is an option that does variable damage and can be used over Seismic Toss due to the ability to hit Ghost-types, notably Lunala and Arceus-Ghost. However, it cannot hit Dark-types such as Darkrai and Weavile. Toxic is used to wear down opposing threats, chipping them over time. Confide is an option to counteract special setup sweepers that do not mind Toxic by reducing their Special Attack such as Cameruptite Magearna and Substitute Calm Mind Lunala. Heal Bell allows Blissey to act as a cleric and provide team support by curing status. Stealth Rock is an option to chip opposing threats. Wish can be run over Soft-Boiled along with Protect in the last slot to provide team support through large passing recovery, yet it makes Blissey more passive.</p> <h4>Set Details</h4> <p>252 HP EVs combined with 252 Defense EVs allow Blissey to avoid the 2HKO from the majority of physical attackers in the tier. 4 Special Defense EVs are used to take on special threats better, such as Red Orb Raikou. A Relaxed nature is selected along with 19 Speed IVs to further increase Blissey's Defense while allowing it to underspeed Sablenite Magearna to prevent it from pivoting freely with Volt Switch. Natural Cure is the ability of choice prior to Mega Evolving to allow Blissey to remove status in the case it becomes afflicted with status before Mega Evolving. If Psywave is run, Healer should be the ability, as Psywave is illegal with Natural Cure.</p> <h4>Usage Tips</h4> <p>Mega Evolving early is important to not only increase Blissey's bulk but also gain Magic Bounce to prevent Stealth Rock and status moves. Keep Blissey healthy throughout the game to allow it to stop opposing threats such as support Primal Groudon and Ho-Oh. As Blissey is fairly passive, try not become overreliant on it to stop threats, as it may eventually be used as setup fodder by the likes of Swords Dance Primal Groudon and Howl Entei. Confide allows Blissey to beat opposing Calm Mind users that do not mind Psywave or Seismic Toss, notably Calm Mind + Refresh Arceus formes, but it should be used only after they use Calm Mind. Against bulkier teams, Heal Bell can ensure a healthy team and increase longevity. Utilize Toxic to wear down offensive threats such as Landorus-T and Darkrai and put them on a timer, but be wary of opposing magic bouncers. If Wish is run, large amounts of recovery can be passed to teammates such as Primal Groudon and Altarianite Zygarde.</p> <h4>Team Options</h4> <p>Aggronite Buzzwole is a premier teammate that provides a physical wall to stop many threats that Blissey cannot, such as Dragon Dance Zygarde and Swords Dance Necrozma-DM. Blissey helps Buzzwole out by checking special attackers. Likewise, Aggronite Mew can provide similar support along with Will-O-Wisp to cripple many physical attackers. Manectite Mew can also act as a blanket check to many physical attackers. Venusaurite and Manectite Zapdos check many physical attackers and appreciate Blissey's ability to prevent Stealth Rock. Venusaurite Gliscor and Arceus-Ground can keep Primal Groudon and Terrakion in check, two threats that heavily threaten Blissey. Arceus-Fairy and Altarianite Zygarde are solid teammates to help keep Terrakion and Darkrai in check, both of which can overpower Blissey. Ditto is a fantastic teammate to discourage setup sweepers from setting up, neutering one of the primary ways to beat Blissey.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 314467, "username": "Catalystic"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 376369, "username": "astralydia"}, {"user_id": 231402, "username": "xavgb"}, {"user_id": 297239, "username": "Quantum Tesseract"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "Lumari"}, {"user_id": 241023, "username": "dhelmise"}]}]}
  },
  "Groudon": {
    "overview": "<p>Primal Groudon serves as one of the most potent threats in the metagame thanks to the sheer number of roles it can take on at once due to its great offensive and supportive movepools, amazing typing under the harsh sun, and exceptional stats. Access to moves such as Stealth Rock and Swords Dance alongside powerful offensive STAB options in Precipice Blades and Overheat enables Primal Groudon to disrupt the majority of threats in the metagame, permitting it to fit in numerous teams that value the immense offensive support it can provide. Due to its well-balanced stat spread, it can perform well both offensively and defensively no matter its EV investment, meaning it can be quite the unpredictable threat unless properly scouted for beforehand. Its typing allows it to check Fairy-, Electric-, Steel-, and Fire-types, meaning it can provide resistance against prominent threats such as Entei, Raikou, Magearna, Xerneas, and Victini. Its ability, Desolate Land, also provides it with an immunity to Water-type moves, making it even more difficult to properly break through as a result under the harsh sunlight, as it checks common Blue Orb users such as Primal Kyogre, Golisopod, and Skarmory. This same typing, however, leaves it weak to a common offensive type in Ground, meaning certain threats such as Gliscor, Landorus-T, Lucarionite Zygarde, Arceus-Ground, and opposing Primal Groudon can properly break through it. It also relies on the harsh sunlight to check certain threats such as Golisopod and Primal Kyogre, leaving it vulnerable to Blue Orb users. A lack of reliable recovery also severely hinders Primal Groudon's defensive sets, as it tends to get worn down quite easily when considering its susceptibility to entry hazard chip damage and its tendency to be pivoted into multiple attacks.</p>",
    "comments": "<h3>Other Options</h3> <p>The combination of Rest + Swords Dance turns Primal Groudon into a potent stallbreaker that can set up against threats such as Blissey and Arceus-Fairy without the fear of being worn down by Toxic. However, the use of this set often requires cleric support as a result. Primal Groudon may choose to opt for a devastating setup sweeping set that features both Rock Polish and Swords Dance, turning it into an incredibly difficult threat to account for both offensively and defensively. However, Primal Groudon rarely finds the opportunity to set up both boosting moves in a game due to the pressure from opposing offensive threats deterring the overall effectiveness of the set. Fire Punch can be run on offensive sets opposed to specially offensive Fire-type moves in order for Primal Groudon to easily break through walls such as Blissey; however, the mixed offensive potential of the former options makes Primal Groudon more difficult to properly check defensively. Sets utilizing the combination of RestTalk + Lava Plume may be used on more defensive teams, providing them a strong check to threats like Magearna. Toxic can be incorporated on Swords Dance sets to cripple Primal Groudon's checks in Arceus-Dragon and Giratina-O. However, this is often not needed, because Primal Groudon can already break through most walls when boosted. Specially offensive coverage moves such as Thunder, Hidden Power Ice, and Earth Power may all be placed on mixed sets to lure in specific threats such as Blue Orb Skarmory, Golisopod, and Lucarionite Zygarde; however, it causes Primal Groudon to be more easily checked by specially defensive walls like Blissey alongside sturdy Fire-resistant Pokemon like Venusaurite Zapdos.</p> <h3>Checks and Counters</h3> <p><strong>Ground-types</strong>: Ground-types such as Arceus-Ground, Landorus-T, and Gliscor can all threaten to heavily dent or outright KO Primal Groudon through their STAB attacks. However, they all must be careful switching in against Primal Groudon's STAB moves, as they can risk being KOed themselves, especially by offensive Primal Groudon sets.</p> <p><strong>Dragon-types</strong>: Dragon-types such as Zygarde, Giratina, Arceus-Dragon, and Mega Salamence can all both offensively and defensively check Primal Groudon, depending on the set they choose to run. They all resist Primal Groudon's Fire-type STAB moves and usually can take on its other coverage options unless it chooses to opt for Hidden Power Ice .</p> <p><strong>Flying-types</strong>: Apart from being completely immune to Primal Groudon's Ground-type STAB moves, Flying-types such as Arceus-Flying, Venusaurite Mandibuzz, Zapdos, and Ho-Oh can all handle most of Primal Groudon's other coverage moves. However, they must be wary of certain offensive options such as Stone Edge, Smack Down, and Hidden Power Ice.</p> <p><strong>Mixed Defensive Walls</strong>: Defensive threats such as Sablenite Blissey, Venusaurite Hippowdon, and support Arceus formes can all take on Primal Groudon's attacking options and threaten to either cripple it with their status options or heavily dent it through their own STAB moves. However, Primal Groudon can easily muscle through the aforementioned threats if it manages to set up a Swords Dance boost or get Toxic off to cripple them.</p> <p><strong>Blue Orb Users</strong>: Pokemon that often carry Blue Orb such as Golisopod, Primal Kyogre, and Skarmory can all switch into Primal Groudon's Fire-type moves thanks to the heavy rain and proceed to threaten it out with either their Water-type STAB moves or status moves like Toxic. However, they cannot be relied on entirely, as Primal Groudon can easily revert the weather to the harsh sunlight when it comes in.</p> <p><strong>Toxic</strong>: Toxic can severely hinder Primal Groudon if it lacks cleric support from its teammates due to its lack of reliable recovery, and common users such as Arceus-Fairy and Golisopod can often lure in Primal Groudon and cripple it.</p>",
    "sets": {
      "Stealth Rock + Swords Dance": {
        "description": "<h4>Moves</h4> <p>Stealth Rock provides both Primal Groudon and its teammates with immense support by chipping down opposing threats. Swords Dance enables Primal Groudon to break through some of its checks that may attempt to wall it such as Hippowdon and Sablenite Blissey, meaning it can set up and keep entry hazards on the opposing side more reliably. Precipice Blades acts as Primal Groudon's primary STAB move, dealing a significant amount of damage against most targets with the slight drawback of it being inaccurate. Earthquake can be used as a more reliable option; however, the decrease in power can be noticeable at times especially when facing threats such as Buzzwole, Arceus-Ground, and Mew. Rock-type coverage complements Primal Groudon's STAB Ground-type moves perfectly, hitting the Flying-and Grass-types that would attempt to switch into Precipice Blades such as Mega Salamence and Celebi. Smack Down is useful in grounding Flying-types and Pokemon with Levitate such as Skarmory and Latiasite Toxapex, respectively, so that Primal Groudon can hit them with its Ground-type STAB move the following turn. Stone Edge is a much more powerful option that can deal more immediate damage against threats where the effects of Smack Down would not matter as much, such as Ho-Oh and Golisopod.</p> <h4>Set Details</h4> <p>This set calls for maximized investment in Attack EVs with an Adamant nature to fully capitalize on Primal Groudon's amazing offensive presence, allowing it to 2HKO the likes of Lucarionite Zygarde and Altarianite Landorus-T with Precipice Blades. The given Special Defense and HP investment ensures that Primal Groudon can survive a +2 Focus Blast from Xerneas as well as avoid being KOed by Altarianite Landorus-T's Earthquake and Arceus-Ground's Judgment. More Speed investment can be given to enable Primal Groudon to outpace certain threats such as Necrozma-DM, Gliscor, and opposing Primal Groudon; however, forfeiting defensive investment means that it can struggle to properly check the threats it's supposed to. Alternatively, Primal Groudon can run more Special Defense by forfeiting investment in Attack to better check threats such as Magearna and Primal Kyogre. Red Orb is required for Primal Reversion, turning Groudon into a devastating wallbreaker with Desolate Land to activate harsh sunlight and blessing it with a crucial immunity to Water-type moves that permits it to come into threats it otherwise would be unable to such as Golisopod and Manaphy.</p> <h4>Usage Tips</h4> <p>Stealth Rock should be set up as soon as possible, as the extra chip damage it provides can be extremely beneficial in breaking through the opposing team much more consistently. Primal Groudon can often find the opportunity to set it up due to the numerous switches it can force when facing threats such as Magearna and Raikou. However, one must be mindful of potential Magic Bounce users that can reflect Stealth Rock such as Blissey, Mew, and Buzzwole. In this case, Primal Groudon should primarily attempt to properly break through the aforementioned threats by using its attacking moves or setting up a Swords Dance so that it can threaten common Sablenite users subsequently on the switch. Smack Down can be properly used to lure in and exploit threats that can switch into Primal Groudon's Ground-type STAB moves such as Zapdos, Latiasite Toxapex, and Skarmory, as it can scare out the aforementioned threats after grounding them, potentially giving it an opportunity to setup entry hazards or boost its Attack via Swords Dance.</p> <h4>Team Options</h4> <p>Primal Groudon appreciates partners that can check opposing Ground-types such as Zapdos, Skarmory, and Golisopod, as the aforementioned Pokemon cover Primal Groudon's sole weakness. Special attackers such as Magearna, Lunala, Darkrai, and Tapu Lele appreciate Primal Groudon's ability to break through walls like Blissey, Sablenite Magerana, and Gyaradosite Toxapex, while the aforementioned wallbreakers can dent walls that Primal Groudon may struggle with such as Hippowdon, Buzzwole, and Giratina. Other physical wallbreakers can help apply additional offensive pressure to Primal Groudon's checks, overwhelming the opposing team. Good examples include Terrakion, Ho-Oh, Entei, and Lucarionite Zygarde. While Primal Groudon can switch into certain neutral special attacks due to the small investment in special bulk, it can still be easily worn down if repeatedly brought in against threats such as Magearna and Raikou. Therefore, teammates that can ease its burden such as Entei and Aggronite Mew may be beneficial as well. Pokemon that can use Primal Groudon's checks as setup fodder may also be handy in potentially securing a sweep late-game as well, while Primal Groudon is able to cover their own checks as a result. Good examples of this include Celebi, Giratina-O, and Altarianite Zygarde. Entry hazard removal or reflection from partners such as Arceus-Fairy, Sablenite Blissey, and Mew can aid Primal Groudon in coming in more frequently, as it can avoid entry hazard chip damage. Blissey is particularly useful, as it can provide both Wish and Heal Bell support for Primal Groudon as well, increasing its longevity immensely.</p>"
      },
      "Defensive Support": {
        "description": "<h4>Moves</h4> <p>Stealth Rock is a great utility move that provides both Primal Groudon and its teammates immense support by chipping down opposing threats. Precipice Blades acts as Primal Groudon's primary STAB move, allowing it to target the Fire-, Steel-, and Electric-types it's intended to check such as Raikou, Victini, and Magearna while still dealing consistent damage against most neutral targets. Overheat is a powerful secondary STAB option especially under the harsh sunlight that can break through threats that would like to come into Primal Groudon's Ground-type attacks such as Arceus-Ground and Aggronite Buzzwole. The burst damage also aids Primal Groudon in providing immediate offensive momentum to its team, as it usually forces out offensive threats due to the fear of Overheat. Lava Plume is a more reliable yet considerably weaker option that provides Primal Groudon the chance to burn its targets, letting it check physical threats slightly better. Toxic is a great utility move that can cripple opposing walls such as Gliscor, Mew, and most support Arceus formes, preventing them from switching into Primal Groudon repeatedly throughout the match. Primal Groudon can run Roar over either Overheat or Toxic to phaze certain setup boosting threats such as Manaphy, Xerneas, and Altarianite Zygarde, preventing the aforementioned threats from sweeping its team. However, it generally offers much less utility compared to its other supportive options, making it less desirable as a result.</p> <h4>Set Details</h4> <p>160 EVs are invested in Defense with a Relaxed nature to ensure that Primal Groudon avoids the 2HKO from threats such as Lucarionite Terrakion and Necrozma-DM. The rest of its EVs are invested in both HP and Special Defense to turn Primal Groudon into a respectable specially defensive tank that can check certain attackers such as Magearna, Azelf, Raikou, and Manaphy more consistently, allowing it to avoid the 2HKO from their coverage moves. Primal Groudon can still choose to run maximum investment in Special Defense with a Sassy nature to better check threats such as Manaphy, Magearna, and Volcarona, but the lack in physically defensive investment means that certain physical wallbreakers like Kartana and Zeraora have a slightly easier time breaking through it. Desolate Land sets harsh sunlight, granting Primal Groudon a crucial immunity to Water-type moves, permitting it to come into threats it otherwise would be unable to such as Golisopod and Manaphy. Red Orb is required to undergo Primal Reversion, granting Groudon an additional Fire typing that lets it check Fairy- and Fire-types.</p> <h4>Usage Tips</h4> <p>Primal Groudon is best used as a defensive pivot that is able to come in against most specially attacking threats such as Raikou, Azelf, Magearna, and Volcarona, force them out, and proceed to set up Stealth Rock reliably. However, due to Primal Groudon's lack of reliable recovery, it is advised to preserve its HP as much as possible so it can pivot in against threats such as Entei and Magearna without being worn down. Therefore, sacrificing a teammate may be necessary at times to bring in Primal Groudon safely. Moreover, Primal Groudon should set Stealth Rock whenever it is able to force a switch, as it can otherwise be worn down rather quickly if it chooses to set it up versus threats such as Terrakion and Kartana. Overheat is best used to hit key targets that would like to switch into Precipice Blades such as Zapdos, Arceus-Ground, and Landorus-T. However, one should not mindlessly spam the move, as the drop in Special Attack often forces Primal Groudon out alongside the fear of potentially letting in Blue Orb users in for free. Toxic should be used to cripple opposing defensive walls such as Venusaurite Zapdos and Arceus-Fairy, severely hampering their longevity as they come in in an attempt to check Primal Groudon. Be mindful of common Magic Bounce users such as Mew, Mandibuzz, and Blissey, as they can reflect Stealth Rock and Toxic, which can leave Primal Groudon in an unfavorable spot.</p> <h4>Team Options</h4> <p>Checks to opposing Ground-types such as Manectite Mew, Skarmory, and Giratina-O can all be useful partners for Primal Groudon, as they help deal with the threats that can break through it like Lucarionite Zygarde, Arceus-Ground, Landorus-T, and Gliscor. Wallbreakers that can capitalize on Primal Groudon's ability to set up Stealth Rock such as Kartana, Tapu Lele, and Zygarde may be considered as well due to the entry hazard chip weakening down their respective checks. Entry hazard removal can be very useful for Primal Groudon, as it is often pivoted in against many attacks, and the chip damage can wear it down significantly. Good partners for this role include Mew, support Arceus formes, and Zapdos. Due to Primal Groudon's ability to check most Magearna variants, teammates that are otherwise weak to Magearna such as Darkrai, Tapu Lele, and Arceus-Fairy pair well with it. Cleric support from teammates like Blissey and Magearna is also recommended due to Primal Groudon's tendency to be statused by the threats it usually comes in against such as Arceus-Fairy and Golisopod. Blissey is especially useful for passing Wish to Primal Groudon, which can help increase its longevity immensely.</p>"
      },
      "Mixed Offensive": {
        "description": "<h4>Moves</h4> <p>Stealth Rock provides immense support by chipping down opposing threats. Swords Dance is an alternative option if another teammate already has Stealth Rock, enabling Primal Groudon to break through its checks such as Sablenite Mew and Hippowdon after one setup boost. It also helps Primal Groudon in covering threats that would otherwise check a purely mixed set such as Landorus-T due to it acting as a hybrid of its previous sets. Precipice Blades acts as a primary Ground-type STAB move that hits most neutral targets incredibly hard even when unboosted. Overheat is Primal Groudon's secondary STAB option that decimates the majority of its physical checks such as Arceus-Ground, Buzzwole, and Skarmory under the harsh sunlight, making Primal Groudon incredibly difficult to properly account for defensively. Eruption is a slightly more powerful option that can be used instead, as it does not lower Primal Groudon's offensive capabilities after every use; however, it relies on it staying relatively healthy. Stone Edge is a great coverage option that lets Primal Groudon target Flying-types that would like to come in against its Ground-type STAB moves such as Zapdos, Ho-Oh, and Pinsirite Entei. Smack Down may be used instead with the added benefit of grounding the aforementioned Flying-types so that Primal Groudon can target them with its Ground-type moves the following turn. However, it inflicts much less damage overall. Hidden Power Ice is another useful coverage option that can be run in the last slot to lure in and take out common Dragon-type switch-ins such as Pinsirite Zygarde, Mega Salamence, Zygarde-C, and Rayquaza, all of which can stomach Primal Groudon's STAB moves. Toxic is a useful utility option that may be used to cripple some of Primal Groudon's most common switch-ins, which include Manectite Mew, Gliscor, and Giratina-O, deterring them for the rest of the match.</p> <h4>Set Details</h4> <p>EVs are fully invested in Primal Groudon's Special Attack and Speed in order to maximize its offensive capabilities. A Naughty nature is preferred, as the reduced Defense from a Lonely nature would give Primal Groudon a slightly harder time checking threats such as Entei and Kartana, and it still lets Primal Groudon hit as hard as possible both physically and specially. A Naive nature may also be used to maximize Primal Groudon's Speed, letting it outpace threats such as Adamant Altarianite Zygarde and Manectite Magearna. A Naive nature also allows it to outspeed threats such as Lucarionite Terrakion and Lunala with Sticky Webs support. However, the extra boost in power provided by a Naughty nature is usually more useful in most cases. Desolate Land provides Primal Groudon with a crucial immunity to Water-type moves and a boost to its Fire-type STAB moves, letting it deal colossal damage to most neutral targets. Red Orb is required to allow Groudon to undergo Primal Reversion, turning it into a devastating wallbreaker.</p> <h4>Usage Tips</h4> <p>This Primal Groudon set aims at punching holes through the opposing team by utilizing its amazing mixed offensive potential to break through the majority of defensive threats in the tier. This means that Primal Groudon should primarily be using its STAB moves throughout the beginning of the match in order to wear down opposing walls for its teammates. Stealth Rock should be used when Primal Groudon can force and incoming check to switch in, as it can leave itself in a disadvantageous position if it decides to use the utility option versus common Magic Bounce users such as Blissey and Mew alongside other defensive threats that can threaten to wear it down immensely like Gliscor and opposing Primal Groudon. If Primal Groudon is carrying Swords Dance, it can exploit the switches it forces as an opportunity to set up and potentially break through its aforementioned checks. Primal Groudon should utilize its Fire-type STAB move when luring in threats that would otherwise appreciate coming in against Precipice Blades such as Hippowdon, Aggronite Buzzwole, and Landorus-T. Primal Groudon should not utilize Overheat too liberally, as otherwise it will be forced to switch out because of the Special Attack drops. If running Eruption, Primal Groudon should prioritize conserving its health to maximize the power of its Fire-type STAB move. Toxic is a great way to punish incoming defensive threats that can take on any of Primal Groudon's attacking options; however, be mindful of potential Magic Bounce users again, as Primal Groudon does not appreciate having the status condition afflicted upon itself.</p> <h4>Team Options</h4> <p>Additional wallbreakers such as Cameruptite Magearna and Tapu Lele can help provide additional offensive pressure to Primal Groudon's checks like Lucarionite Zygarde, Giratina, and Latiasite Toxapex, while the aforementioned threats also appreciate Primal Groudon's ability to set up Stealth Rock in return. Checks to opposing Ground-types, which include Gliscor, Golisopod, and Ho-Oh, can be extremely useful for Primal Groudon, as they can help cover its sole weakness when factoring in the effects of the harsh sunlight. Sticky Web support from setters like Shuckle may also be useful in order to enable Primal Groudon to outpace threats such as Terrakion, Kartana, and Tapu Lele; however, it should be noted that Primal Groudon should be running a Naughty nature if used in conjunction with Sticky Web. Partners that can set up Stealth Rock may be necessary if Primal Groudon chooses to forego the option itself, as the extra entry hazard chip damage can be crucial at times to secure certain 2HKOs against targets such as Mew and Zygarde. Good setters include Terrakion, Landorus-T, and Skarmory. Alternatively, team members that can remove entry hazards such as Arceus-Ground, Zapdos, and Mew aid Primal Groudon by removing entry hazards that can wear it down over time. Partners that can combat offensive Sticky Web teams may also provide utility considering Primal Groudon's weakness to the aforementioned archetype. Good examples include Altarianite Zygarde, Pinsirite Kartana, and Yveltal. Cleric and Wish support from partners like Blissey, Magearna, Shaymin-S, and Jirachi can be used to great effect especially if Primal Groudon is running Eruption due to its lack of reliable recovery, prolonging its longevity immensely and increasing the power of its STAB move as well.</p>"
      },
      "Mixed Rock Polish": {
        "description": "<h4>Moves</h4> <p>Rock Polish enhances Primal Groudon's Speed to respectable levels, enabling it to outpace key threats such as Diancite Tapu Lele, Terrakion, and Darkrai after one boost. Fire Blast is an incredibly powerful STAB move when used in conjunction with the harsh sunlight, permitting Primal Groudon to heavily dent most neutral targets that it hits, including most support Arceus formes. Precipice Blades acts as Primal Groudon's secondary STAB move, hitting the specially defensive walls that otherwise stomach its primary STAB move such as Blissey and opposing defensive Primal Groudon for considerable damage. Hidden Power Ice is a great coverage option that covers the Dragon and Flying-types that can otherwise wall Primal Groudon's STAB moves such as Zygarde, Mega Salamence, and Giratina-O. Stone Edge may be used instead to hit specific targets such as Ho-Oh and Golisopod for more considerable damage; however, Hidden Power Ice generally provides more coverage.</p> <h4>Set Details</h4> <p>EVs are fully invested in Primal Groudon's Special Attack and Speed in order to maximize its offensive capabilities. A Naughty nature is preferred, as the reduced Defense from a Lonely nature would give Primal Groudon a slightly harder time checking threats such as Entei, and it still lets Primal Groudon hit as hard as possible both physically and specially. The Speed investment allows Primal Groudon to outspeed Necrozma-DM without any boosts and outspeed key threats such as Lucarionite Terrakion and Ultra Necrozma with Sticky Web support. Desolate Land amps up the power of Primal Groudon's Fire-type moves, letting it hit most neutral targets incredibly hard under the harsh sunlight. It also lets Primal Groudon soak up any Water-type moves used against it, enabling it to check threats it would otherwise be unable to like Primal Kyogre and Manaphy. Red Orb is equipped to allow Groudon to undergo Primal Reversion, turning it into one of the best mixed wallbreakers in the tier.</p> <h4>Usage Tips</h4> <p>Primal Groudon should only set up once checks such as Venusaurite Hippowdon, Blissey, Ho-Oh, Lunala, Gliscor, and Arceus-Ground have been properly weakened beforehand, as it can otherwise lose the offensive momentum it needs if the aforementioned threats are kept relatively healthy beforehand. Its STAB moves should be spammed the majority of the time due to how much damage they can do against most neutral targets, where coverage options such as Hidden Power Ice and Stone Edge should be used to hit threats such as Zygarde and Ho-Oh, respectively.</p> <h4>Team Options</h4> <p>Due to this set's lack of Stealth Rock, partners that can set up the entry hazard are extremely beneficial, as they can wear down Primal Groudon's checks in Ho-Oh, Golisopod, and Zapdos. Good setters include Landorus-T, Arceus-Fairy, and Terrakion. Offensive threats such as Tapu Lele, Kartana, and Darkrai appreciate Primal Groudon's ability to break through most defensive cores, where the aforementioned threats can often clean up late-game once Primal Groudon has broken down walls such as Mew and Skarmory. Partners that can cover Primal Groudon's sole weakness to Ground-type threats when factoring in the effects of Desolate Land such as Golisopod, Landorus-T, and Pinsirite Cobalion may be useful, as they provide Primal Groudon a fail-safe option in covering Pokemon such as Arceus-Ground and opposing Primal Groudon. Entry hazard removers like Zapdos and Arceus-Ground can provide utility in eliminating the entry hazard chip damage that may severely weaken Primal Groudon throughout the match and leave it prone to being revenge killed. They also relieve it from the potential Speed drop of Sticky Web, which can otherwise hamper its sweeping capabilities.</p>"
      }
    },
    "credits": {"writtenBy": [], "teams": [{"name": "Quality checked by", "members": [{"user_id": 376369, "username": "astralydia"}, {"user_id": 324242, "username": "in the hills"}, {"user_id": 297239, "username": "Quantum Tesseract"}]}, {"name": "Grammar checked by", "members": [{"user_id": 148071, "username": "Electrolyte"}, {"user_id": 232216, "username": "Lumari"}]}]}
  },
  "Weavile": {
    "overview": "<p>Weavile's unique Dark / Ice typing carves it out a niche in Mix and Mega, and its high Attack stat, combined with its Ice typing and access to Fake Out, makes it a decent holder of Glalitite. Weavile can effectively use its STAB-boosted Pursuit to threaten some of the Pokemon that it beats and deal valuable chip damage to common Pokemon that it forces out. Weavile carries a good Speed stat that it can use to outspeed many of the Pokemon that it wants to revenge kill. Weavile also gets great Refrigerate-boosted priority in both Fake Out and Feint, and it can use Swords Dance to increase its wallbreaking capabilities. Despite these positive traits, Weavile has abysmal bulk and can't switch into any substantial attacks, which is compounded by its weakness to Stealth Rock. Weavile often has lackluster coverage versus Ice-resistant foes as well, and it is heavily reliant on its Ice-type STAB moves to deal damage.</p>",
    "comments": "<h3>Other Options</h3> <p>A set featuring Lucarionite can turn Weavile into a powerful Pursuit trapper. However, this set does not get Refrigerate and will have to rely on Icicle Crash and Ice Shard as its Ice-type attacks. Throat Chop is also a must on this set. Taunt can be used to stop Defoggers and Taunt Arceus but is often ineffective when dealing with Pokemon with Magic Bounce.</p> <h3>Checks and Counters</h3> <p><strong>Magearna</strong>: Magearna is Weavile's most prominent counter, taking extremely little from Weavile's attacks and being able to either KO it or use it as setup fodder.</p> <p><strong>Entei</strong>: Entei, particularly the most common Altarianite variant, is another extremely solid check to Weavile, being able to OHKO it with -ate Extreme Speed while resisting its STAB attacks.</p> <p><strong>Buzzwole</strong>: Aggronite Buzzwole causes a lot of issues for Weavile, as it takes next to nothing from Weavile's attacks and can easily OHKO in return.</p> <p><strong>Other Steel-types</strong>: Steel-types like Necrozma-DM, Aggronite Mew, and Metagross are extremely troublesome for Weavile, as they resist its primary way of dealing damage.</p> <p><strong>Other Fire-types</strong>: Fire-types like Volcarona, Victini, and other Red Orb holders also resist Ice, meaning that Weavile will have trouble beating them.</p> <p><strong>Water-types</strong>: Though uncommon, Water-types like Keldeo and Kyogre resist Ice as well, making Weavile and its teammates open to being hit by a powerful attack.</p>",
    "sets": {
      "Glalitite Attacker": {
        "description": "<h4>Moves</h4> <p>Fake Out is Refrigerate-boosted; it provides Weavile with a great way to revenge kill Pokemon weak to Ice, particularly Zygarde, and it breaks Lunala's Shadow Shield. Swords Dance boosts Weavile's Attack to extreme levels, giving it significant wallbreaking potential. Frustration is Weavile's most spammable attack, having no drawbacks while being Refrigerate- and STAB-boosted. Double-Edge allows Weavile deal greater damage at the cost of taking recoil damage; for example, it is able to 2HKO offensive variants of Primal Groudon and 4HKO Cameruptite Magearna. Double-Edge also pressures Steel-types significantly more than Frustration, but it should not be run with Pursuit. Pursuit allows Weavile to trap Pokemon that it can beat like Lunala while also threatening or damaging the Pokemon it forces out, such as Landorus-T and Zygarde, with its other attacks. Feint is a secondary form of priority but is often somewhat weak. Feint is used over Quick Attack, as it allows Weavile to finish off Zygarde before getting hit with Extreme Speed due to Feint's +2 priority. Throat Chop can be used as another STAB-boosted attack to help deal with some Ice-resistant Pokemon while not having to deal with the lackluster damage of unboosted Pursuit.</p> <h4>Set Details</h4> <p>Maximum Speed investment along with a Jolly Nature allows Weavile to outspeed as many Pokemon as possible. After Mega Evolving, Weavile is able to outspeed Pokemon like non-Diancite Terrakion, Red Orb Shaymin-S, and Darkrai. 252 Attack EVs along with Weavile's increased Attack from Glalitite ensure that Weavile hits as hard as possible. Refrigerate is the main draw of this set, boosting the power of Weavile's Normal-type moves as well as changing them to Ice-type, thus adding an extra STAB boost.</p> <h4>Usage Tips</h4> <p>Weavile should be used to revenge kill a huge amount of the Ice-weak Pokemon in the tier, such as Zygarde, Landorus-T, and most Flying-types. Fake Out should be used to damage Pokemon that outspeed Weavile, allowing it to either pick off weakened foes or get chip damage before switching out. Swords Dance should be used to allow Weavile to function as a wallbreaker and setup sweeper, but Weavile's lacking defenses often make it difficult to set up. Pursuit should be used both against Ghost- and Psychic-types that Weavile can force out, such as Lunala and Azelf, and to get useful chip damage on the Ice-weak Pokemon that it forces out. Weavile needs to avoid opposing priority itself, as its pitiful defenses leave it extremely vulnerable. Weavile should boost with caution, only after all opposing priority users and faster Pokemon have been removed.</p> <h4>Team Options</h4> <p>Weavile appreciates Pokemon that can beat the Steel- and Fire-types that it has trouble breaking. Some great examples of these Pokemon include Primal Groudon, Terrakion, Entei, Victini, and Zygarde. Primal Groudon and Golisopod help take care of the Fire-types that Weavile struggles with. Weavile also appreciates Pokemon such as Tapu Koko, Kartana, and Shaymin-S that beat the Water-types that it dislikes. Weavile's weakness to Stealth Rock is troublesome, so entry hazard removal from the likes of Arceus-Fairy, Gliscor, Arceus-Ground, and Zapdos can help preserve Weavile. Pokemon holding Diancite or Sablenite such as Terrakion and Magearna, respectively, are useful teammates because their Magic Bounce ability is helpful to bounce back hazards.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 357488, "username": "DurzaOffTopic"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 376369, "username": "astralydia"}, {"user_id": 297239, "username": "Quantum Tesseract"}, {"user_id": 377367, "username": "Mark K"}]}, {"name": "Grammar checked by", "members": [{"user_id": 241023, "username": "dhelmise"}, {"user_id": 388157, "username": "A Cake Wearing A Hat"}]}]}
  },
  "Arceus-Ground": {
    "overview": "<p>Arceus-Ground is a solid defensive threat, boasting base 120 in every stat and access to Recover and support options such as Defog, Will-O-Wisp, and Toxic. Arceus-Ground is also a strong special attacking threat with access to Calm Mind to break through defensive Pokemon. It can be a valuable check to common -ate Extreme Speed, beating Altarianite Entei and most Altarianite Zygarde with its support set.  STAB Judgment allows Arceus-Ground to threaten top Pokemon such as Magearna and Primal Groudon, and when paired with Ice Beam, it grants it near-unresisted coverage. While Arceus-Ground is potent at checking offensive Pokemon such as Primal Groudon and Zygarde, it is susceptible to their status options such as Toxic, Arceus-Ground requires team support. Because Ice Beam is weak, Arceus-Ground can struggle to break Pokemon that are not affected by or resist Judgment such as Ho-Oh, Latiasite Magearna, and Sablenite Buzzwole.</p>",
    "comments": "<h3>Other Options</h3> <p>A Perish trapper set with Whirlpool can be very potent in trapping bulky Pokemon on stall teams, but it misses out on coverage and support moveslots required for most teams. On the support set, you can run Stealth Rock if needed, though it is widely outclassed by Primal Groudon or Landorus. Only run this if you have no better options for Stealth Rock. A Swords Dance set can be run; while it is generally outclassed by Zygarde, Landorus, and Garchomp, it does have the niche of having Recover as an option to increase setup opportunities, while being able to surprise checks like Ho-Oh with Stone Edge to pull off a sweep.</p> <h3>Checks and Counters</h3> <p><strong>Ho-Oh</strong>: Ho-Oh is able to come in on Arceus-Ground very easily and threaten with either Toxic or Curse. With Regenerator and recovery, Ho-Oh can almost indefinitely check Arceus-Ground.  Even Brave Bird is enough to annoy Arceus-Ground, especially from Choice Band sets.</p> <p><strong>Pinsirite Entei</strong>: Similarly to Ho-Oh, Entei is able to come in on Arceus-Ground by virtue of its typing and bulk, and although it lacks the recovery Ho-Oh does, it is a much stronger offensive threat that can take advantage of both of Arceus-Ground's sets.</p> <p><strong>Bulky Flying-types</strong>: Other bulky Flying-types such as Sablenite Mandibuzz and Sablenite or Venusaurite Zapdos can wall Arceus-Ground's Calm Mind set and either force it out with Whirlwind or threaten to cripple it with Toxic.</p> <p><strong>Latiasite Users</strong>: Latiasite Toxapex is one of the best checks to Arceus-Ground, as it can completely stop it from setting up with Haze and forces it out with Scald and Toxic, while Latiasite  Magearna can either set up against it as well with Calm Mind or steal its stat boosts with Heart Swap.</p> <p><strong>Pinsirite Steels</strong>: Pinsirite Steel-types such as Magearna and Metagross can all do a number against the Calm Mind set, although they all fear Will-O-Wisp from the Support set.</p> <p><strong>Kartana</strong>: While Kartana cannot come in on Arceus-Ground's attacks, any time it is in against it, it can threaten to OHKO it with Leaf Blade.</p> <p><strong>Bug Types</strong>: Bulky Bug-type attackers such as Venusauritem Sablenite, Blue Orb and Buzzwole and Blue Orb Golisopod that resist Arceus-Ground's coverage can come in on it to set up and break it or, in Golisopod's case, just come in and break it.</p> <p><strong>Toxic</strong>: Bulky Toxic users such as Sablenite Blissey and Lunala threaten Arceus-Ground and stump its setup potential. Primal Kyogre seriously threatens both of Arceus-Ground's sets, as it can come in while taking light chip and threaten to OHKO with Origin Pulse. While it is not an ideal check due to lack of recovery, it certainly hinders Arceus-Ground's ability to sweep.</p> <p><strong>Calm Mind Lunala</strong>: While not the best check, Calm Mind Lunala does win out in a Calm Mind war against Arceus-Ground and is very prevalent in the metagame.</p>",
    "sets": {
      "Calm Mind": {
        "description": "<h4>Moves</h4> <p>Judgment is Arceus-Ground's strongest STAB attack, and it severely damages a good portion of the metagame. Ice Beam is great coverage, allowing Arceus-Ground to hit Flying-types that are immune to its STAB attack and super effectively hit other Ground-types. Calm Mind allows Arceus-Ground to set up on a good portion of the metagame. These boosts make it harder to break with special attackers such as Lunala and Darkrai and give it insane wallbreaking capabilities, allowing it to break through all but a few defensive Pokemon. Recover is Arceus-Ground's best form of recovery and increases its longevity, allowing it to defensively check Pokemon better while giving it more opportunities to break teams. Thunderbolt or Thunder can alternatively be used over Ice Beam to break through checks such as Pinsirite Magearna, Latiasite Toxapex, Ho-Oh, and Calm Mind Water-types like Sablenite Slowbro and Primal Kyogre.</p> <h4>Set Details</h4> <p>124 Speed EVs are used to outpace maximum Speed base 90 Pokemon such as Primal Groudon and Primal Kyogre. The rest of the EVs are put into HP and Defense to maximize Arceus-Ground's defensive potential. Alternatively, you can use a spread of 252 HP / 160 Def / 92 Spe with a Timid nature to outpace less common threats such as Red Orb Victini and Raikou, though it decreases Arceus-Ground's defensive potential. A spread of 252 HP / 240 Def / 16 Spe is also noteworthy, as it maximizes Arceus-Ground's defensive potential at the cost of some Speed.</p> <h4>Usage Tips</h4> <p>Arceus-Ground is susceptible to Toxic, so be careful against defensive threats; it might be worthwhile to scout Primal Groudon's set if possible beforehand.  Arceus-Ground can utilize its Ground typing in order to get free switches on Pokemon such as Magearna's Volt Switch.  It is best to set up once defensive checks such as bulky Flying-types like Ho-Oh and Mandibuzz have been weakened or eliminated; Stealth Rock is a great tool to have up if you want to set up. Even unboosted, Arceus-Ground can defensively check Pokemon such as Swords Dance Primal Groudon and Lucarionite Zygarde, so don't be afraid to bring it in against these threats as well. On that note, it is important to keep Arceus-Ground healthy to maximize its defensive potential.</p> <h4>Team Options</h4> <p>Pinsirite Magearna is an amazing offensive partner to Arceus-Ground; while they do share a few defensive checks such as Zapdos, Pinsirite Magearna does cover a good amount of its checks and provides great support with Heal Bell, allowing Arceus-Ground more chances to set up. Toxapex is a great partner to Arceus-Ground, with its Latiasite set coming in against its checks such as opposing Latiasite Toxapex and defensive Ho-Oh while relieving pressure on Arceus-Ground as a counter to Primal Groudon running Toxic or Fire coverage and its Gyaradosite set providing Toxic Spikes support to wear down defensive checks. Other Calm Mind users such as Lunala and Tapu Lele are good partners to Arceus-Ground to form a Calm Mind core that covers each other's checks. Altarianite Zygarde can sponge Water-type attacks decently and is great at keeping offensive threats such as Terrakion and Darkrai in check. It's important to pair these with a Kartana check, as it can threaten both heavily. Pokemon with Magic Bounce such as Sablenite Blissey, Mandibuzz, and Slowbro also pair nicely with Arceus-Ground, as they discourage opposing Pokemon from using Toxic on it.</p>"
      },
      "Support": {
        "description": "<h4>Moves</h4> <p>Judgment is Arceus-Ground's main STAB attack and is boosted by its Earth Plate, allowing it to severely damage a good portion of the metagame. Recover is Arceus-Ground's best form of recovery and increases its longevity, allowing it to defensively check Pokemon better. Ice Beam allows Arceus-Ground it to hit Flying-types that are immune to its STAB attack such as Mandibuzz and Zapdos and hit Lucarionite Zygarde super effectively. Will-O-Wisp allows Arceus-Ground to better check physical attackers better and properly check Altarianite Zygarde and Pinsirite Zeraora. Defog can be used to give Arceus-Ground another support niche in entry hazard removal, though Arceus-Ground can struggle with status, losing a bit of its defensive niche in the process. Toxic can be used over Will-O-Wisp to cripple defensive switch-ins such as Ho-Oh, non-Sablenite Buzzwole, and other Arceus formes. Refresh can also be used to check defensive Primal Groudon sets that carry Toxic.</p> <h4>Set Details</h4> <p>16 Speed EVs are used to outpace maximum Speed, neutral-nature base 90 Speed Pokemon such as Primal Groudon and Primal Kyogre. The rest of the EVs are put into HP and Defense to maximize Arceus-Ground's defensive potential. An alternative spread of 252 HP / 132+ Def / 124 Spe can be used to allow Arceus-Ground to properly check Jolly base 90 Speed Pokemon such as Primal Groudon.</p> <h4>Usage Tips</h4> <p>Arceus-Ground is susceptible to status, so if you aren't running Refresh or don't have Heal Bell support, it is incredibly important to not let it get poisoned. Restore Arceus-Ground's health against Pokemon that don't threaten it such as Tyranitar and Aggronite Buzzwole. Arceus-Ground doesn't appreciate any chip from entry hazards, so it's important to keep entry hazards off the field to stop offensive Pokemon from potentially breaking Arceus-Ground. Arceus-Ground is still a strong special attacker, so it can still threaten offensive Pokemon and discourage threats such as Kartana from switching in.</p> <h4>Team Options</h4> <p>Sablenite Magearna is an amazing partner, as it can bounce back entry hazards and status moves while defensively checking a lot of the Pokemon Arceus-Ground struggles with.  In return, Arceus-Ground provides a check to the Ground-types that threaten Magearna. Altarianite Entei is a good partner to Arceus-Ground, as it keeps faster foes at bay for Arceus-Ground while Arceus-Ground can defensively check Pokemon that Entei can't break such as Primal Groudon and Arceus-Rock. Buzzwole utilizes Aggronite, Sablenite, and Blue Orb to check Kartana and other attackers that Arceus-Ground struggles to handle such as Terrakion and Darkrai. However, if Buzzwole is using any Mega Stone besides Aggronite, these two can struggle to handle Pinsirite Steel-types such as Metagross, Magearna, and Cobalion. Pinsirite Magearna is a great partner, as it can support the team with access to Heal Bell while offensively pressuring the other team.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 324242, "username": "in the hills"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 257571, "username": "Andyboy"}, {"user_id": 231402, "username": "xavgb"}, {"user_id": 297239, "username": "Quantum Tesseract"}]}, {"name": "Grammar checked by", "members": [{"user_id": 297659, "username": "deetah"}, {"user_id": 232216, "username": "Lumari"}]}]}
  },
  "Victini": {
    "overview": "<p>Red Orb Victini is a dangerous wallbreaker capable of circumventing conventional physical walls like Buzzwole, Gliscor, Toxapex, and Arceus-Ground. Its Desolate Land allows it to come into Water-type attacks with ease. However, giving Victini Red Orb means that Primal Groudon is unavailable for the team. Victini is capable of wearing down common Fire switch-ins, like Primal Groudon, but it isn't capable of outright beating them without running certain coverage. Several of Victini's moves have low PP, making them hard to spam in long matches. Victini's Speed is unaffected by Primal Reversion, which means that it is somewhat slow compared to other threats in Mix and Mega.</p>",
    "comments": "<h3>Other Options</h3> <p>Metagrossite allows Victini to boost the power of Bolt Strike, hit Blue Orb and Red Orb users harder and have stronger contact moves overall but forgoes being a mixed attacker. Lucarionite allows Victini to retain a mixed attacker role and powers up Psychic, which hits different Blue Orb targets such as Buzzwole, but such a Victini cannot force out Blue Orb users. Psychic is an option to hit both Blue Orb users and Giratina, but Bolt Strike handles most Blue Orb users already and isn't resisted by Steel. Fusion Bolt and Fusion Flare are weaker but more accurate than Bolt Strike and Blue Flare.</p> <h3>Checks and Counters</h3> <p><strong>Dragon-types</strong>: Many common Dragon-types, like Arceus-Dragon and Giratina, easily handle Victini. Other Dragon-types like Zygarde-C and Mega Salamence must be wary of Glaciate.</p> <p><strong>Ground-types</strong>: Ground-types holding Venusaurite, Primal Groudon, and Lucarionite Zygarde easily handle the different Fire-type moves from Victini, although Glaciate threatens the Ground-types that are 4x weak to Ice.</p> <p><strong>Blue Orb users</strong>: Blue Orb users like Skarmory and Magearna can switch into V-create and Blue Flare with impunity, although Bolt Strike can punish some of them.</p> <p><strong>Fire-types</strong>: Fire-types like Entei and Primal Groudon can easily tank V-create or Blue Flare and retaliate with a super effective move. Victini can wear those down throughout the match, however.</p> <p><strong>Faster Pokemon with Super Effective Coverage</strong>: Faster Pokemon like Diancite Darkrai and Terrakion are able to outspeed and OHKO Victini with super effective moves.</p> <p><strong>Lunala</strong>: Lunala can tank a hit if Shadow Shield is active and strike back with super effective attack.</p> <p><strong>Pursuit</strong>: Pursuit users like Weavile can come in after Victini has gotten a Defense drop from V-create and threaten to KO it.</p>",
    "sets": {
      "Red Orb": {
        "description": "<h4>Moves</h4> <p>V-create is capable of dealing massive damage to neutral targets under harsh sun. Bolt Strike hits Blue Orb users that might attempt to switch into V-create or Blue Flare such as Golisopod and Skarmory. Blue Flare is able to better hit physical walls like Hippowdon. Glaciate hits Ground-types like Zygarde, Landorus-T, and Gliscor for super effective damage and can make Victini faster than switch-ins. Work Up enables Victini to hit even harder. Taunt shuts down Shuckle and helps Victini break certain Dragon-types, like Giratina without Dragon Tail. It also prevents defensive Pokemon such as Gliscor from recovering their health against Victini. U-turn is an option that allows Victini to pivot at the cost of missing out on coverage or utility.</p> <h4>Set Details</h4> <p>A Hasty nature is best for Victini's mixed attacker role. Red Orb lets Victini hit hard with V-create and Blue Flare thanks to the excellent stats boosts and Desolate Land given. An alternative spread of 160 HP / 252 Atk / 24 SpA / 72 Spe with a Lonely nature lets it beat Z-Geomancy Xerneas, taking an uninvested Moonblast after a drop from V-create, and makes it bulkier.</p> <h4>Usage Tips</h4> <p>Victini should be used aggressively, since its consistent checks are not common. Standard Fire switch-ins will often find themselves 3HKOed by its coverage. Despite its low PP, V-create is usually the safest option to use if in doubt thanks to its general power. Bolt Strike should be used in case of a predicted Blue Orb user switch-in, like Skarmory or Golisopod Blue Flare is better used for physical walls like Zapdos, Manectite Mew, Gliscor, and Hippowdon, as it's able to take advantage of their lower Special Defense and has a chance to burn them. It also doesn't drop Victini's Speed, allowing it to stay in and attack again. Work Up should be used when it's safe, such as on forced switches against Mew or Blue Orb users. If running Taunt, Victini can act as an anti-lead against Shuckle.</p> <h4>Team Options</h4> <p>While Victini breaks a lot of walls, it's not capable of doing it as easily if it gets chipped every time it comes in, so Defog support from teammates like Giratina and Arceus-Fairy is appreciated. Dragon-types wall Victini fairly easily, so any Pokemon that can threaten them out such as Xerneas, Tapu Lele, and Altarianite Zygarde are appreciated. Victini can also pair with a Blue Orb user, such as Kyogre, to create a core that pressures Dragon-types. Magearna is an exceptional teammate to Victini, as it is capable of taking advantage of the switch-ins that Victini forces and not many Pokemon are capable of walling both. Ground-types like Lucarionite Zygarde, Gliscor, and Arceus-Ground are good teammates, as they are capable of pivoting into a weakened Primal Groudon and deal with it.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 400313, "username": "Sectonia"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 376369, "username": "astralydia"}, {"user_id": 231402, "username": "xavgb"}, {"user_id": 324242, "username": "in the hills"}]}, {"name": "Grammar checked by", "members": [{"user_id": 331519, "username": "CryoGyro"}, {"user_id": 232216, "username": "Lumari"}]}]}
  },
  "Mandibuzz": {
    "overview": "<p>Sablenite turns Mandibuzz into a wall that is able to withstand attacks from threatening offensive breakers such as Lunala, Kartana, and Primal Groudon, and access to Foul Play prevents passivity against physical threats. By virtue of its Dark typing and access to reliable recovery, it is one of the best defensive checks to Lunala and is thus mainly used as a dependable special wall. Magic Bounce, which is acquired upon Mega Evolving, grants Mandibuzz an immunity to status from defensive Pokemon such as support Arceus formes and defensive Primal Groudon. Furthermore, combined with access to Defog, it allows Mandibuzz to perform well in entry hazard control. With U-turn, it functions as a reliable slow pivot that can provide its teammates with free opportunities to switch in. However, a weakness to Stealth Rock can be detrimental to Mandibuzzs ability to perform the aforementioned roles. Further, Mandibuzz is easily offensively pressured by most teams due to the abundance of Altarianite users such as Zygarde and Entei as well as the existence of Terrakion and Magearna. Boosted super effective coverage moves such as Ice Beam from Darkrai and Moonblast from Lunala can also overwhelm it. Finally, while it can't freely switch in, if Primal Groudon manages to preserve its HP, its Swords Dance and Eruption sets can muscle through Mandibuzz.</p>",
    "comments": "<h3>Other Options</h3> <p>Metagrossite can be used as a means to outspeed Lunala and slightly increase Mandibuzz's offensive presence, particularly on teams where Sablenite is unavailable. Other defensive Mega Stones like Venusaurite and Manectite could be considered, but the absence of Magic Bounce is usually detrimental to Mandibuzz, as it becomes much more vulnerable to status and Stealth Rock.</p> <h3>Checks and Counters</h3> <p><strong>Altarianite Users</strong>: Zygarde and Entei threaten Mandibuzz with their powerful Fairy STAB attacks, and Mandibuzz can do next to nothing in return.</p> <p><strong>Terrakion</strong>: All of Terrakions viable sets threaten Mandibuzz with a guaranteed 2HKO from Stone Edge. They can also use Swords Dance on a predicted Roost, but Diancite and Pinsirite variants need to be wary, since Foul Play OHKOes them at +2. Additionally, non-Mega Evolved Terrakion is a deterrent to the use of Foul Play because of its ability Justified.</p> <p><strong>Magearna</strong>: No move from Mandibuzz can threaten Magearna, which can easily pressure it. Cameruptite sets can freely set up and 2HKO Mandibuzz with BoltBeam coverage at +1, whereas Sablenite and Manectite versions threaten it with Fleur Cannon. Moreover, since Sablenite sets are potentially slower, they can capitalize on Mandibuzzs U-turn with their own Volt Switch, effectively regaining all momentum unless a Ground-type Pokemon is brought in. Pinsirite Magearna can OHKO Mandibuzz with Explosion at +1, but it must be wary of Foul Play when setting up.</p> <p><strong>Fairy-types</strong>:  Fairy-types such as Lucarionite Tapu Lele and Arceus-Fairy heavily pressure Mandibuzz. Tapu Lele's Moonblast is a guaranteed 2HKO, whereas Mandibuzz can only 3HKO back with Foul Play, and Judgment from Arceus-Fairy deals significant damage to Mandibuzz, 2HKOing it at +1. Toxic variants of Mandibuzz can at least put Arceus-Fairy on a timer at the expense of chip damage, but Defog variants are devoid of any means to retaliate.</p> <p><strong>Primal Kyogre</strong>: Primal Kyogre can threaten Mandibuzz with a 2HKO from Origin Pulse. It can set up with Calm Mind on Roost attempts to clean more easily, but it must be wary of Foul Play 3HKOing.</p> <p><strong>Calm Mind Arceus-Ground</strong>: Arceus-Ground can freely set up as well as recover any lost HP when it faces Mandibuzz. Interestingly enough, Toxic variants of Mandibuzz can prevent this by inflicting status.</p> <p><strong>Electric-types</strong>: Electric-types such as Pinsirite Zeraora and Red Orb Raikou can 2HKO Mandibuzz with their respective STAB attacks. While Mandibuzz 2HKOes Zeraora back with Foul Play, it fails to threaten Raikou as effectively.</p> <p><strong>Other Rock-types</strong>: While relatively uncommon, Pokemon like Arceus-Rock, Diancite Archeops, and Tyranitar all pressure Mandibuzz significantly. Namely, Archeops threatens to OHKO it with Head Smash, and Tyranitar can 2HKO it with Stone Edge. Further, non-Toxic variants of Mandibuzz have no means of pressuring Arceus-Rock, while it can heavily chip Mandibuzz with Judgment in return.</p> <p><strong>Status</strong>: Poison and burn, whether reflected by Magic Bounce users or Synchronize Mew, inflicted through Magic Bounce by Gyaradosite users, inflicted via moves such as Scald and Lava Plume, or inflicted before Mandibuzz Mega Evolves, can severely cripple it, hampering its sustainability.</p>",
    "sets": {
      "Sablenite Utility": {
        "description": "<h4>Moves</h4> <p>Foul Play avoids passivity against physical attackers, OHKOing +2 Kartana and dealing heavy damage to Swords Dance Primal Groudon. It can also hit some specially offensive targets for heavy damage, such as Lunala and Diancite Tapu Lele. The latter is severely chipped and even has a chance to be OHKOed after the Defense drops from its Mega Evolution. Roost provides reliable recovery; the loss of the Flying type is hardly ever detrimental, as Ground-type attackers are usually faster than Mandibuzz and thus cannot take advantage of it. U-turn grants Mandibuzz the ability to perform as a slow pivot that cant be restrained by a Ground-type switch-in, giving it the edge over Volt Switch users in generating momentum. Defog is run as an entry hazard countermeasure. Toxic could work as a means to pressure offensive Mandibuzz switch-ins as well as Arceus formes if the team already has another Defogger. However, extreme care should be taken in using this move to avoid it being bounced back by an opposing Magic Bounce user.</p> <h4>Set Details</h4> <p>248 HP EVs combined with 252 Special Defense EVs turn Mandibuzz into a sturdy special wall, maximizing its ability to take special attacks like Overheat from Primal Groudon and Moonblast from Lunala. The HP EVs maximize the number of times Mandibuzz can switch into Stealth Rock. A Sassy nature and 0 Speed IVs give Mandibuzz its slowest possible U-Turn, letting a teammate switch in more safely. Big Pecks is run to avoid the occasional Defense drop from moves like Golisopod's Liquidation. An alternative set with a spread of 248 HP / 100 Def / 160 SpD and a Relaxed nature can also be run as a way to better check physical attackers like Kartana and Stone Edge Primal Groudon. The drop in special bulk does, however, cause Mandibuzz to be 2HKOed by +1 Moonblast from Lunala.</p> <h4>Usage Tips</h4> <p>Mega Evolving Mandibuzz early is important to increase its overall bulk, gain Magic Bounce to block status moves, and properly avoid opposing entry hazards. Foul Play should be used as the primary offensive move. It heavily pressures Lunala, Ho-Oh, most Diancite users, and relevant Necrozma formes. Additionally, it deals significant damage to physical attackers on the switch, as long as they dont resist the move. Foul Play can also be used to punish foes that boosted their Attack, like Shift Gear Pinsirite Magearna, Swords Dance Metagrossite Kartana, and Swords Dance Primal Groudon. However, the damage received by a boosted physical move from these threats will invalidate Mandibuzz's ability to properly check other breakers. Thus, it is imperative to understand which Pokemon among the aforementioned poses the biggest threat to the rest of the team in order to choose which wallbreaker Mandibuzz ought to check. If a non-Mega Evolved Terrakion is found on the opposing team, it is important to be wary of using Foul Play, as it has very few switch-ins after a Justified boost. U-turn should be used as a means to punish predicted switches and generate momentum. It can also be utilized against passive foes to gain a free switch for a wallbreaker. However, switching is preferred to using U-turn if the opponent has the potential to deal heavy damage to Mandibuzz in a situation where the latters health should be preserved, such as against Altarianite users, Terrakion, and Zeraora. Roost should be used copiously to keep Mandibuzz healthy throughout the game and allow it to consistently check opposing threats. However, Roost may give threatening Pokemon like Nasty Plot Darkrai a free setup turn. In such cases, the recovery may have to be delayed in favor of U-turn. In situations where Mandibuzz is weakened while claiming momentum with U-turn, finding an opportunity to get it back in on a predicted switch to a Pokemon that doesn't pressure it can let it safely use Roost. Defog is to be used according to the entry hazard matchup on both sides. Beware, however, that if Mandibuzz is the only Defogger on the team, switching out without clearing Stealth Rock may deprive it of a quarter of its HP.</p> <h4>Team Options</h4> <p>Primal Groudon is a good partner for Mandibuzz, as it can switch in on Fairy-types like Magearna, Xerneas, and Altarianite Entei as well as Primal Kyogre and Zeraora, all of which pressure Mandibuzz. In exchange, Mandibuzz can take on Lunala and Darkrai as well as serve as a pivot against Arceus-Ground and Manectite Mew, thus taking pressure off Primal Groudon. Manectite Mew forms a functional defensive core with Mandibuzz, as it covers three of the most dangerous threats to it in Altarianite Zygarde, Altarianite Entei, and Terrakion. Alternatively, Aggronite Mew worsens the Entei and Terrakion matchup but does a better job at checking Pinsirite users like Magearna and Kartana, which heavily threaten Mandibuzz. It returns the favor by checking Lunala and Darkrai, both of which otherwise dismantle Mew. Will-O-Wisp Arceus-Ground has good synergy with Mandibuzz, checking the most prominent Altarianite users in the tier in Zygarde and Entei, while the latter is able to check Kartana and Lunala. Terrakion punishes other Sablenite users like Blissey and Zapdos, against which Mandibuzz is relatively powerless. In addition, Terrakion really capitalizes on the free switches Mandibuzz provides it with, as it is otherwise very difficult to bring it safely on the field. Still, it should be noted that both Pokemon are particularly weak to Fairy-types like Altarianite users and Arceus-Fairy. Altarianite Entei works as an offensive check to Altarianite Zygarde and Terrakion and is able to punish boosted Darkrai. Mandibuzz synergizes well with it, with its Ground immunity allowing it to take on Primal Groudon, a Pokemon that greatly hinders Entei, and the ability to help it switch in freely. Arceus-Fairy is another solid check to both Altarianite Zygarde and non-Pinsirite Terrakion, and in return appreciates Mandibuzz checking Lunala, Necrozma-DM, and Kartana to an extent. However, both are noticeably weak to non-Pinsirite Magearna variants. Finally, Kartana pairs well with Mandibuzz, as it takes advantage of Altarianite Zygarde and Arceus-Fairy. In return, Mandibuzz provides extra opportunities for Kartana to come in safely and break down teams with its slow U-turn.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 331804, "username": "Gman"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 231402, "username": "xavgb"}, {"user_id": 257571, "username": "Andyboy"}, {"user_id": 297239, "username": "Quantum Tesseract"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "Lumari"}, {"user_id": 336073, "username": "Rabia"}]}]}
  },
  "Terrakion": {
    "overview": "<p>Terrakion is a fearsome wallbreaker that can decimate balance and stall teams thanks to its amazing STAB attacks that offer it almost perfect coverage alongside great natural power, cementing itself as a popular threat on offensive teams. After Mega Evolving with Lucarionite, Terrakion can single-handedly break through most walls in the tier, while Diancite enables it to outspeed the majority of the unboosted metagame. Thus, Terrakion is a difficult threat to check both defensively and offensively. Terrakion may also run utility options such as Swords Dance, Stealth Rock, and Taunt or even change its typing entirely by running Pinsirite, further enhancing its capabilities in disrupting the opposing team apart from simply wallbreaking with its STAB moves alone and preventing usual checks such as Primal Groudon and Buzzwole from withstanding its attacks. However, Terrakion is susceptible to most forms of priority due to its low defenses, especially when holding Diancite, meaning it can often be forced out by offensive threats such as Zygarde and Entei. An unfortunate weakness to common types such as Fairy, Ground, Fighting, and Water leaves Terrakion unable to switch in against most offensive threats, while Pinsirite variants' susceptibility to Stealth Rock means they can have limited opportunities to come in safely. The presence of common bulky threats such as Manectite Magearna, Arceus-Fairy, and Lunala also hampers Terrakion's capability to break through balance teams, since they can threaten Terrakion with an OHKO if they have not been worn down a bit in advance or if Terrakion is unable to acquire a Swords Dance boost. As is the case, Terrakion may require some additional support from its teammates at times to perform its role; however, it can still apply enough offensive pressure on opposing teams to independently dismantle most defensive cores regardless.</p>",
    "comments": "<h3>Other Options</h3> <p>Metagrossite may be run as an alternative Mega Stone option, providing Terrakion with a great boost in Speed compared to Lucarionite without lowering its bulk compared to Diancite. However, the notable decrease in power due to the lack of access to Adaptability when considering Terrakion's Rock-type STAB move makes the option less favorable overall. Lopunnite can also be run to increase Terrakion's wallbreaking power significantly while also letting it spam its Fighting-type STAB moves much more safely thanks to Scrappy. However, the slower Speed and damage output compared to its other Mega Stone choices means Terrakion fails to check offensive threats such as Manaphy and Tapu Lele as well as break through sturdy walls such as Buzzwole and Hippowdon. An Adamant nature may be run on either set when paired with Sticky Web support, as Terrakion can deal as much damage as possible while still outspeeding key threats such as maximum Speed Arceus formes, Keldeo, and Ultra Necrozma. However, the required support makes the option less desirable overall.</p> <h3>Checks and Counters</h3> <p><strong>Physically Defensive Walls</strong>: Physically bulky threats such as Hippowdon, Mew, Giratina, and Buzzwole may all come into Terrakion's attacks and threaten to either cripple it with their status moves or heavily damage it with their own STAB moves. However, Terrakion may be able to potentially break through the aforementioned threats through factors such as entry hazard chip damage, an Attack boost from Swords Dance, or simply crippling them with utility moves such as Taunt or Toxic.</p> <p><strong>Fairy-types</strong>: Fairy-types such as Altarianite Zygarde, Altarianite Landorus-T, and Arceus-Fairy can all switch into Terrakion's Fighting-type STAB attacks and proceed to KO it with their own STAB moves. However, they all fear coming into a potential Stone Edge, while Arceus-Fairy also can be crippled via Taunt and Toxic on the switch.</p> <p><strong>Priority Moves</strong>: Offensive threats that commonly run powerful priority moves such as Zygarde, Weavile, Entei, and Genesect can all offensively check Terrakion, especially if it runs Diancite. However, it is worth noting that they cannot safely come in against Terrakion without risking being OHKOed.</p> <p><strong>Faster Threats</strong>: Terrakion can be offensively checked by a couple of threats such as Diancite Tapu Lele, Zeraora, Kartana, and Darkrai, as all aforementioned examples can threaten to KO Terrakion from full health.</p> <p><strong>Status Moves</strong>: Status such as burn or paralysis can severely cripple Terrakion, disabling it from wallbreaking appropriately through its lowered Attack or Speed. This means Terrakion must be wary against threats that commonly run moves such as Will-O-Wisp, Discharge, and Scald such as Giratina, Mew, and Zapdos. Poison damage may also wear down Terrakion to the point where it can be KOed by certain attacks such as Earthquake from Gliscor and Earth Power from Mew, limiting its wallbreaking potential as well. However, it is worth noting that Diancite sets can bounce back moves such as Will-O-Wisp and Toxic thanks to Magic Bounce.</p>",
    "sets": {
      "Lucarionite Wallbreaker": {
        "description": "<h4>Moves</h4> <p>Close Combat is Terrakion's strongest Fighting-type STAB move, dealing incredible amounts of damage to any unresisted foe, especially in conjunction with the Adaptability boost from Lucarionite, with the only cost being its defenses lowering after every use. Stone Edge acts as Terrakion's secondary STAB option, letting it hit the Flying- and Ghost-types such as Landorus-T and Lunala that resist or are immune to Terrakion's other STAB move. Swords Dance further enhances Terrakion's wallbreaking capabilities, letting it dismantle just about every defensive threat in the metagame after it acquires a single boost, notably giving it the chance to OHKO threats such as Primal Groudon, Gliscor, Arceus-Ghost, and Arceus-Fairy after Stealth Rock damage. Taunt is a great utility move that provides Terrakion with the ability to shut down common defensive threats that rely on their own status moves to be effective, such as non-Sablenite Mew, Arceus-Ghost, and Toxapex. It is a notable user of the move due to how well it can force the aforementioned Pokemon to come in, potentially crippling them from responding appropriately. Substitute can be used as an alternative to punish the switches that Terrakion tends to force, enabling it to either safely spam its STAB moves or use Swords Dance by protecting it from status and some phazing moves such as Toxic, Will-O-Wisp, and Dragon Tail alongside other miscellaneous abilities such as Intimidate. Stealth Rock can be considered as an option, as Terrakion's capability in forcing out common Sablenite defensive walls such as Blissey and Magearna means it can usually keep up hazards on the opposing side of the field reliably, and it can usually capitalize on the momentum it gains when setting up the entry hazard.</p> <h4>Set Details</h4> <p>Lucarionite boosts Terrakion's Attack and Speed and also grants it the ability Adaptability upon Mega Evolution, transforming it into one of the most threatening wallbreakers in the metagame as a result. Its EVs are fully invested in Attack and Speed with a Jolly nature in order to maximize Terrakion's wallbreaking capabilities, letting it deal the most amount of damage and outspeed as many threats as possible, such as Arceus and Landorus-T. Justified provides little utility before Mega Evolution, as Dark-type moves are rather uncommon in the metagame, and Terrakion's rather low defenses disables it from coming in against most threats that could carry these type of moves anyway.</p> <h4>Usage Tips</h4> <p>Try to Mega Evolve Terrakion as soon as possible, as letting it wallbreak early on in the game can help its teammates break through opposing walls much more easily. Terrakion's meager defenses mean it cannot really come in against most offensive threats, so Terrakion should usually be coming in on the battlefield through pivoting from its teammates or potential aggressive double switching. It should also take caution in staying in against threats that commonly run priority moves such as Zygarde and Entei, as they can threaten to revenge kill Terrakion if it is even slightly chipped. Terrakion should be using utility moves early on in the game, as its ability to force in walls can enables it to punish threats such as Mew, Gliscor, and support Arceus formes, as they come into moves such as Swords Dance and Substitute. Even when facing a threat that may completely wall Terrakion, such as Arceus-Fairy or Mew, Terrakion should be utilizing Taunt to cripple the aforementioned threats as they attempt to recover their health. Once they have been appropriately weakened, Terrakion may proceed to spam its STAB attacks more reliably as a result.</p> <h4>Team Options</h4> <p>Pokemon that can break through Terrakion's checks, such as Altarianite Zygarde and Entei are much appreciated, as they can help check opposing offensive threats while Terrakion can help break through walls such as support Arceus formes and Mew in return. Other offensive threats that appreciate Terrakion's ability in breaking down specially defensive walls such as Blissey, Magearna, and Toxapex make excellent teammates for Terrakion, and these threats can help break through physically defensive threats in return. Good examples include Pokemon like Lunala, Raikou, Tapu Lele, and Shaymin-S. Pokemon that can provide slow pivoting such as Magearna and Gliscor also work great in conjunction with Terrakion, as they can safely bring in Terrakion, providing it with many more opportunities to wallbreak successfully. Defensive pivots such as Toxapex, Ho-Oh, Mew, and Arceus-Fairy can help check the threats that Terrakion may be unable to reliably break through without prior chip damage, such as Primal Groudon and Buzzwole, in addition to common -ate ability Extreme Speed users such as Zygarde and Entei that threaten to revenge kill Terrakion. Mew and Arceus-Fairy also provide the added benefit of setting up Stealth Rock, enabling Terrakion to break through its checks more easily and free up a potential moveslot for other utility options.</p>"
      },
      "Diancite Cleaner": {
        "description": "<h4>Moves</h4> <p>Close Combat is Terrakion's strongest Fighting-type STAB move, dealing incredible amounts of damage to any unresisted foe with the only drawback being that its defenses are lowered after every use. Stone Edge acts as Terrakion's secondary STAB option, rounding off its coverage almost perfectly by hitting Flying- and Ghost-types that resist Close Combat. Stealth Rock is a great utility move, as Terrakion's ability to force out common Sablenite defensive walls such as Blissey and Magearna means it can usually keep up hazards on the opposing side of the field reliably. Toxic is another great utility move that disrupts Terrakion's most common switch-ins such as non-Sablenite Mew, Buzzwole before it Mega Evolves, and Venusaurite Gliscor, crippling the aforementioned threats and making them much easier to break through later on in the game. Swords Dance can be used to further boost Terrakion's walbreaking prowess, letting it OHKO certain walls such as defensive Primal Groudon, support Arceus-Ground, and Magearna after a single boost. Taunt is an option to cripple defensive threats such as Mew and Giratina, enabling Terrakion to break through the aforementioned threats due to them not being able to utilize their utility options.</p> <h4>Set Details</h4> <p>Diancite boosts Terrakion's attacking power and provides it a great boost in Speed, enabling it to outspeed the majority of threats in the metagame after Mega Evolving. However, this comes with the cost of lowering Terrakion's defenses, leaving it more susceptible to priority attacks. Magic Bounce also lets Terrakion punish threats that try to utilize status moves against it, meaning it can disrupt passive threats more aggressively. The EVs are fully invested in Attack and Speed with a Jolly nature in order to maximize Terrakion's wallbreaking capabilities, letting it deal the most damage and outspeed as many threats as possible, such as Kartana, Tapu Lele, and Tapu Koko. Justified provides little utility before Mega Evolution, as Dark-type moves are rather uncommon in the metagame, and Terrakion's rather low defenses disables it from coming in against most threats that could carry these type of moves anyway.</p> <h4>Usage Tips</h4> <p>Terrakion should try Mega Evolving only when necessary, as the lowered defenses provided by Diancite often leaves it prone to revenge killing, meaning you should assure yourself that it absolutely needs the extra Attack and Speed in order to revenge kill the opposing threat before proceeding to Mega Evolve. While Terrakion can bounce back entry hazards through its ability, it should still be wary against coming against most setters such as Gliscor, Mew, Primal Groudon, and Arceus-Fairy, as the lowered defenses provided by Diancite means that Terrakion can be threatened to be OHKOed by the aforementioned threats. Even if Terrakion should be spamming its STAB moves the majority of the time, utility moves such as Stealth Rock, Toxic, and Swords Dance can be used when Terrakion ensures a switch in from the opponent into a more defensive Pokemon, enabling it to capitalize on the opportunity that its offensive presence provides. Be wary of threats that commonly run priority moves such as Weavile, Entei, and Zygarde, as they can all threaten to revenge kill Terrakion, especially when considering its decreased bulk after Mega Evolving. Building on the previous point, Terrakion should only be coming in on aggressive double switches or by slow pivoting provided by its teammates, as it can be OHKOed by most offensive threats it if comes into an attack directly. Thanks to the great boost in Speed provided by the Diancite, Terrakion can act as a means of checking faster foes after coming in from a potential sacrificing of a teammate, outpacing threats such as Lucarionite Zygarde even after a Dragon Dance boost.</p> <h4>Team Options</h4> <p>Teammates that can provide additional offensive pressure work great in tandem with Terrakion, helping it break through its checks such as Buzzwole, Mew, and Skarmory. Such threats include Primal Groudon, Zygarde, and Ultra Necrozma. Specially offensive threats like Xerneas, Volcarona, and Tapu Lele that can capitalize on Terrakion's ability to break through common specially defensive threats such as Blissey and Magearna make great teammates, as they may break through physical walls in return. Slow pivoting from partners such as Magearna and Mew can help bring Terrakion in more safely, giving it the chance to perform its role without being threatened by attacks from opposing offensive threats. Other offensive threats that can take advantage of Terrakion's ability to keep Stealth Rock on the opposing side of the field such as Kartana, offensive Magearna, and Volcarona also make great partners for Terrakion, as they have a much easier time breaking through walls such as Ho-Oh and Red Orb Raikou.</p>"
      },
      "Pinsirite": {
        "description": "<h4>Moves</h4> <p>Return is Terrakion's most reliable and powerful STAB option when boosted by Aerilate, enabling it to break through checks to Lucarionite variants such as Arceus-Fairy and Sablenite Buzzwole. Earthquake pairs wonderfully with Terrakion's Flying-type STAB attacks, targeting Steel-, and Rock-types that resist its main STAB option, such as Magearna, Arceus-Rock, and Aggronite Mew. Swords Dance enables Terrakion to muscle through checks such as Mandibuzz, Manectite Magearna, and bulky Arceus formes. Stone Edge can be considered as a secondary STAB option, mainly targeting the likes of Zapdos, Pinsirite Magearna, and Mandibuzz. Facade enables Terrakion to exploit its tendency to get statused by foes such as Ho-Oh, Mew, Will-O-Wisp Arceus formes, Pinsirite Entei, and Toxapex and proceed to deal significant amounts of damage with boosted attacks. This is significant when considering the burn status, as Terrakion can be severely crippled if it does not carry Facade to compensate for the Attack drop. Quick Attack is a useful option when combating faster foes, as Terrakion can threaten to KO weakened targets such as Diancite Darkrai, Kartana, and opposing Terrakion. This can be especially useful against Diancite users, as the decrease in bulk upon Mega Evolution enables foes such as the aforementioned Darkrai and Terrakion to be OHKOed at +2 after Stealth Rock. Taunt is a great tool in shutting down common walls and preventing the likes of Aggronite Mew and bulky Arceus formes from statusing Terrakion while preventing attempts to recover or set up entry hazards. However, this means Terrakion must rely on predictions in order to avoid the negative effects of status as opposed to Facade, which enables it to switch into threats such as Ho-Oh more safely. Substitute can capitalize on Terrakion's ability to force many switches, helping it set up more securely or fire off hits against faster foes without the fear of being revenge killed. Stealth Rock is an alternative utility option that enables Terrakion to support its teammates, and Terrakion is a great user of the move thanks to its ability to force out opposing Pokemon quite well and its great matchup versus common Defoggers such as Mandibuzz and Sablenite users such as Blissey.</p> <h4>Set Details</h4> <p>Pinsirite provides Terrakion with the necessary typing change and stat boosts to turn it into a threatening wallbreaker and lure, while Aerilate allows it to utilize Flying-type STAB attacks. Its newfound secondary typing can also help it check dangerous threats such as Rock Polish Primal Groudon, Ho-Oh, and Noivern while potentially enabling it to bait Ground-types into using their STAB moves before it Mega Evolves. Thus, Terrakion can secure ample opportunities to set up or fire off a powerful attack. This new typing also elevates Terrakion's wallbreaking potential, as it can now face off against threats such as Arceus-Fairy and Arceus-Ground without fearing super effective STAB moves while easing its matchup versus common revenge killers such as Altarianite Zygarde and Entei. Justified is a niche ability before Mega Evolving, potentially enabling Terrakion to get Attack boosts off Dark-type STAB moves from the likes of Mandibuzz, Darkrai, and Gyaradosite Toxapex.</p> <h4>Usage Tips</h4> <p>Knowing when to Mega Evolve is crucial when using Pinsirite Terrakion, as the change in typing and boosts in stats can change its matchups versus threats such as Primal Groudon, Ho-Oh, and Noivern. However, it must be noted that Terrakion should only be switching into Ho-Oh if it carries Facade, as otherwise getting burned via Sacred Fire is too costly. Generally, Terrakion should preserve its secondary Fighting typing when facing off against opposing walls such as Mandibuzz and Gyaradosite Toxapex in order to take advantage of their common coverage options such as Foul Play for the former and Payback for the latter. Furthermore, Terrakion should hold off on Mega Evolving if the new typing is not needed to check certain threats, as the lure factor it brings can often catch many of Terrakion's conventional checks off guard and ease a potential sweep. While Terrakion can effectively sweep after obtaining a Swords Dance boost, it is advised to properly wear down checks such as Zapdos, Latiasite Magearna, and Kartana to prevent Terrakion from being revenge killed. Therefore, spamming its STAB and coverage options against the aforementioned threats or double switching to appropriate teammates in order to gain momentum is vital to secure a sweep late-game. Substitute is best used when forcing a switch against threats that cannot target Terrakion for significant damage once it has Mega Evolved, such as defensive Primal Groudon, Pinsirite Entei, and Ho-Oh. Terrakion does not have the best bulk, so bringing it in via slow pivoting, through double switches, or after sacrificing a teammate is important in order to sustain it. If running Facade, Terrakion can be used to switch into common status spreaders such as Ho-Oh and Giratina to potentially secure a sweep late-game with boosted attacks.</p> <h4>Team Options</h4> <p>Defensive teammates such as Manectite Magearna, Mandibuzz, and Defog Lunala that can threaten out opposing offensive checks to Terrakion such as Altarianite Zygarde, Kartana, and Tapu Lele are extremely beneficial. Manectite Magearna and Mandibuzz can also provide slow pivoting, which Terrakion benefits from greatly. Offensive checks such as Entei, Ho-Oh, and Calm Mind Lunala to the aforementioned threats are also appreciated. Other wallbreakers such as Kartana, Primal Groudon, and Tapu Lele can apply additional offensive pressure towards Terrakion's checks, forming a potent offensive core that can be hard to counteract defensively. Entry hazard counteraction is key to sustain Terrakion's health after it Mega Evolves, whether it be through a Sablenite user or a Defog supporter. Examples of such partners may include Zapdos, Blissey, Slowbro, and Arceus-Ground. Terrakion also appreciates entry hazard support of its own to weaken checks such as Zapdos and Lunala, which common Stealth Rock setters such as Primal Groudon, Red Orb Mew, Mamoswine and Arceus-Fairy, can supply while synergizing with Terrakion offensively as well.</p>"
      }
    },
    "credits": {"writtenBy": [], "teams": [{"name": "Quality checked by", "members": [{"user_id": 376369, "username": "astralydia"}, {"user_id": 231402, "username": "xavgb"}, {"user_id": 297239, "username": "Quantum Tesseract"}, {"user_id": 324242, "username": "in the hills"}, {"user_id": 257571, "username": "Andyboy"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}, {"user_id": 400292, "username": "asa"}, {"user_id": 232216, "username": "Lumari"}, {"user_id": 336073, "username": "Rabia"}]}]}
  },
  "Toxapex": {
    "overview": "<p>Toxapex is a unique and highly diverse wall that can utilize its regular ability Regenerator to serve as a far more efficient pivot, scout attacks, and remain healthy without using Recover constantly. This Pokemon can support teams as both a physical and special tank through the use of Latiasite and Gyaradosite, and it is a good fit for a wide variety of builds due to its ability to check a wide range of threats with each of its Mega Stones and spread status with Scald, Toxic, and Toxic Spikes. Latiasite variants check Pokemon such as Primal Groudon, Entei, Arceus-Ground, and Golisopod with their fantastic bulk, great defensive typing, and Levitate ability. Gyaradosite allows Toxapex to stop a new scope of threats that would give Latiasite sets problems such as Lunala and Giratina-O with its new Poison / Dark typing and harass bulky Magic Bounce users like Sablenite Mandibuzz and Blissey with its Mold Breaker Toxic and Toxic Spikes. However, poor offensive stats make Toxapex passive and susceptible to being set up on by powerful cleaners such as Zygarde, Kartana, Terrakion, and Darkrai.</p>",
    "comments": "<h3>Other Options</h3> <p>Toxapex has no applicable or worthwhile other options.</p> <h3>Checks and Counters</h3> <p><strong>Zygarde</strong>: Zygarde's STAB Thousand Arrows is problematic to both Toxapex sets, as it is a Ground-type attack that ignores Levitate and allows Zygarde to easily muscle past Toxapex. Lucarionite Zygarde is the primary menace wielding this attack, but Toxapex can't even switch into Altarianite Zygarde on a turn it Dragon Dances for fear of being 2HKOed.</p> <p><strong>Red Orb Powerhouses</strong>: Red Orb users like Azelf, Victini, Raikou, and Taunt or Substitute Darkrai are immune to Latiasite Toxapex's only means of attacking and can easily muscle past it with Electric- or Psychic-type coverage. Taunt or Substitute Red Orb Darkrai is able to shut down both Toxapex movesets entirely and set up on them to win one-on-one.</p> <p><strong>Psychic-type Coverage</strong>: Psychic-types such as Tapu Lele, Azelf, Lunala, Ultra Necrozma, and the occasional Psychic-wielding Mew can easily sponge any hits Latiasite Toxapex wishes to throw at them and in turn threaten it out with powerful super effective Psychic-type attacks. However, Tapu Lele, Lunala, Mew, and special Ultra Necrozma struggle horribly against Gyaradosite Toxapex.</p> <p><strong>Sablenite Users</strong>: Sablenite Zapdos, Magearna, Blissey, and Mew are able to switch into anything Latiasite Toxapex wishes to do and easily stall it out by wearing it down with Electric- or Psychic-type coverage and Seismic Toss. Toxapex can attempt to cripple these Pokemon with a Scald burn, but this will do little to hinder their ability to counter it. Although they effectively wall out Latiasite Toxapex, Sablenite walls are practically helpless against Gyaradosite Toxapex.</p> <p><strong>Steel-types</strong>: Steel-types such as Magearna, Aggronite Mew, Metagross, Necrozma-DM, and Cobalion prevent Toxapex from spreading Toxic poison and once again force it into the position of fishing for burns with Scald or using a 50-Base Power Payback. Although Latiasite Toxapex can hinder physical Steel-types more effectively than Gyaradosite with a Scald burn and can actually manage Double Dance Necrozma-DM, these Pokemon can still pressure Toxapex by setting up with Swords Dance.</p> <p><strong>Ground-types</strong>: Ground-types such as Primal Groudon, the aforementioned Zygarde, Arceus-Ground, Mamoswine, Gliscor, and Excadrill all exploit Gyaradosite Toxapex's sole Ground weakness and can set up, set Stealth Rock, or remove Toxic Spikes in Excadrill and Gliscor's case. Although Latiasite Toxapex can wall Arceus-Ground, Mamoswine, Gliscor, Mega Evolved Excadrill, and usually Primal Groudon, these Pokemon still force it to Mega Evolve to acquire Levitate and thus discard its useful Regenerator ability. Smack Down Primal Groudon overwhelms both Toxapex sets with ease.</p> <p><strong>Offensive Cleaners</strong>: Kartana and Terrakion can exploit Gyaradosite Toxapex's weak STAB Payback and use it as setup fodder to begin tearing through teams.</p>",
    "sets": {
      "Gyaradosite Toxic Spikes": {
        "description": "<h4>Moves</h4> <p>Mold Breaker + Toxic is an exceptionally lethal combination that allows Toxapex to freely spread poison, particularly against teams that rely on bulky Sablenite users such as Mandibuzz, Blissey, and Mew to bounce back entry hazards and status. Recover is Toxapex's primary means of remaining healthy to wall Pokemon like Diancite Tapu Lele and Giratina-O. Gyaradosite Toxapex's Mold Breaker Toxic Spikes cannot be blocked by Magic Bounce, allowing it to spread this devastating hazard with ease and effectively apply immense pressure to opposing teams. Payback is Toxapex's newly acquired STAB attack that allows it to mercilessly pressure Lunala with a 4x super effective attack. The doubled Base Power lets it hit surprisingly hard on turns Toxapex moves last in conjunction with the boosted Attack stat and can work alongside Toxic to continuously chip down Giratina, Blissey, Mew, and Tapu Lele. Haze is a secondary option that allows Toxapex to annoy Calm Mind Magearna and Darkrai without Taunt or Substitute and fully wall Nasty Plot Sablenite Mew. However, forgoing any attacking moves adds to Toxapex's already problematic passivity and can prove to be highly unwieldy, and foregoing Toxic Spikes on Gyaradosite Toxapex erases the primary support it offers teams, making it a very specific niche.</p> <h4>Set Details</h4> <p>Maximum HP and Special Defense investment with a Careful nature allows Toxapex to wall Lunala and Mew, check Diancite Tapu Lele, and easily switch in on support Arceus formes outside of Arceus-Ground to begin setting Toxic Spikes. 0 Speed IVs with a Sassy nature is an alternative option that helps maximize Paybacks power by allowing Toxapex to move second more often, notably against Cameruptite Magearna under Trick Room, also preventing it from setting up by using Haze. Even when utilizing Toxic Spikes, Regenerator is the preferred ability over Merciless, as pivoting with Regenerator is an essential component to keeping Toxapex healthy if Mega Evolving isn't immediately necessary. Gyaradosite grants Toxapex the phenomenal Poison / Dark typing, which gives it an immunity to Psychic and a resistance to Lunala's Ghost-type STAB attack. Other benefits include a sizable increase in bulk and the acquisition of the Mold Breaker ability. This ability flips Toxapex from a Pokemon that was previously constantly harassed by bulky Sablenite users like Blissey, Mandibuzz, and Mew to a menace for these exact Pokemon with its Mold Breaker Toxic and Toxic Spikes.</p> <h4>Usage Tips</h4> <p>Gyaradosite Toxapex is a Pokemon that thrives off of passivity in teams. It should switch into Pokemon such as Lunala, Blissey, Mandibuzz, Sablenite or Manectite Mew, and support Arceus-Water, -Fairy, and -Rock to sponge special hits and begin stacking Toxic Spikes. This Pokemon possesses a highly desirable role as a special wall that can heavily punish teams that allow it to come in and spread such a crippling entry hazard freely. If there is a Magic Bounce user or a Psychic- or Ghost-type present, do not hesitate to Mega Evolve Toxapex to allow it to put up hazards without fear and wall threats that its regular Water / Poison typing can't handle. However, if possible, attempt to preserve the Regenerator ability, as it is incredibly useful for maintaining Toxapex's health and providing it with additional turns to cripple teams with Toxic and Toxic Spikes instead of being forced to rely on Recover to remain healthy. Although Toxapex can contribute quite a bit to a variety of teams with its exceptional Toxic Spikes setting ability and, ironically, a means of absorbing opposing Toxic Spikes through its rare Poison typing, its only ways of immediately hitting opposing Pokemon are Toxic and Payback. Powerful wallbreakers like Terrakion, Zygarde, Kartana, and Substitute Darkrai can exploit Toxapex's poor offensive presence by setting up and blowing past it. Therefore, it is important to avoid staying in and passively chipping away at these Pokemon while they grow increasingly more dangerous and to switch into an appropriate countermeasure instead.</p> <h4>Team Options</h4> <p>The primary beneficiary of Toxapex's Toxic Spikes is Zygarde. This Pokemon punishes Poison- and Steel-type Pokemon attempting to evade being poisoned by Toxic Spikes with its powerful STAB Thousand Arrows, and in turn, Toxic Spikes apply immense pressure to many of Zygarde's common checks such as Sablenite Buzzwole, Arceus-Ground, Arceus-Fairy, and Manectite Mew. Sablenite Buzzwole is a fantastic defensive partner that can help prevent Toxapex's passivity from being a liability by checking some of the most powerful wallbreakers in Darkrai, Terrakion, Lucarionite Zygarde, Swords Dance Primal Groudon, and Kartana while benefiting from Toxapex's Psychic immunity and general ability to sponge hits from Lunala, Tapu Lele, and Arceus-Fairy. Mew is a Pokemon that appreciates Toxapex's ability to take on Lunala, Giratina-O, Blissey, and Mandibuzz. In return, Manectite Mew is capable of tackling Zygarde and Swords Dance Primal Groudon.</p>"
      },
      "Latiasite Defensive": {
        "description": "<h4>Moves</h4> <p>Scald is Toxapex's only attack and will usually be used with the hope of a burn in mind, particularly against Steel-type Pokemon and Magic Bounce users that arent affected by Toxic. Recover is Toxapex's primary recovery option, allowing it to remain healthy even after losing the Regenerator ability after it Mega Evolves. Haze allows Toxapex to neutralize boosts and effectively wall Pokemon like Swords Dance Primal Groudon without Smack Down, Calm Mind Arceus-Ground, Golisopod, and Necrozma-DM. Toxic is utilized to cripple and continuously wear down Pokemon Toxapex wishes to check as well as Pokemon that wish to switch in on it and force it out. Toxic Spikes can also be utilized to help alleviate Toxapex's passivity and offer additional support to its teammates by pressuring and wearing down grounded Pokemon. However, they can easily be blocked by Magic Bounce users, particularly if Toxapex is Mega Evolved, as it wont be able to absorb any potentially reflected Toxic Spikes. The absence of Toxic also puts Toxapex in the unwieldy situation of being completely walled by Red Orb Pokemon and adds to Toxapex's passivity problem by leaving it unable to properly pressure Defoggers without resorting to fishing for Scald burns.</p> <h4>Set Details</h4> <p>Maximum HP and Defense investment with a Bold nature allows Toxapex to switch in and sponge physical hits from Primal Groudon, Entei, Buzzwole, Mamoswine, and Genesect. Regenerator grants Toxapex vastly improved longevity before it Mega Evolves. Latiasite bolster's Toxapex's formidable defenses, significantly increases Scald's power, and eliminates a prior weakness to Ground-type attacks by granting it an immunity with Levitate.</p> <p>Usage Tips</p> <p>========</p> <p>It is often essential to refrain from Mega Evolving Toxapex too early to preserve its Regenerator ability as long as possible, allowing it to switch in more freely. However, if Toxapex is the only answer to Pokemon like Primal Groudon, Mamoswine, and Arceus-Ground, do not hesitate to Mega Evolve early-game to allow it to freely switch in on Ground-type attacks without fear. When using this Pokemon, always be wary of Smack Down Primal Groudon. This Pokemon leverages this coverage option specifically for Pokemon like Latiasite Toxapex, as it negates its Levitate ability and allows Primal Groudon to severely cripple or knock it out the following turn. Besides knowing when to Mega Evolve, Toxapex is very easy to use. Simply switch it into a Pokemon it walls and take advantage of the opportunity to spread burns with Scald or poison foes with Toxic or Toxic Spikes. However, Toxapex is very passive, as Scald is its only means of attacking. This STAB attack can harass opposing Pokemon with the potential burn chance, but it will rarely promise immediate damage, so one must understand when Toxapex can properly wall an opposing Pokemon and when it must switch out to avoid being overwhelmed by foes such as Magearna and Darkrai. It is important to keep Toxapex healthy particularly after it Mega Evolves, as it will rarely be outspeeding anything, and without the additional health gain from pivoting with Regenerator, it will be very difficult to bring it back in if it is severely weakened. Haze should be used to immediately halt setup and is usually utilized alongside Recover and Toxic to keep Toxapex healthy and wear down setup Pokemon.</p> <h4>Team Options</h4> <p>Because Toxapex is such a phenomenal switch-in to Altarianite Extreme Speed users such as Entei and Genesect, Pokemon that are revenge killed by these Pokemon such as Terrakion and Darkrai appreciate Toxapex's support. Terrakion also appreciates Toxapex's ability to wall one of its few counters in Arceus-Fairy. Magearna is a partner that benefits from Toxapex's ability to wall Entei, Primal Groudon, Arceus-Ground, and Mamoswine and generally sponge Fire- and Ground-type attacks. In return, Magearna is capable of checking a wide range of Pokemon that threaten and annoy Toxapex such as Tapu Lele, Darkrai, Mandibuzz, and, if running Latiasite, Ultra Necrozma. Primal Groudon appreciates Toxapex's ability to wall opposing Primal Groudon, Mamoswine, Arceus-Ground, Golisopod, and the occasional Blue Orb Buzzwole. In turn, Toxapex benefits from Primal Groudon's ability to switch in and force out Electric-types like Zeraora and Raikou as well as annoying Steel-types like Magearna that don't allow Toxapex to freely spread Toxic poison and force it to passively fish for burns with Scald instead. Arceus-Ground is another Ground-type that enjoys Toxapex's ability to sponge Water- and Ice-type attacks and Toxic that would otherwise cripple it and in return checks Electric-types, Magearna, and Zygarde. Ho-Oh is a fellow Regenerator user that can stall out bulkier passive builds through repeatedly pivoting with Toxapex and effectively wasting PP while remaining healthy. It can also help check Pokemon that threaten Toxapex such as Kartana, Tapu Lele, Azelf, and Darkrai. In return, Ho-Oh greatly appreciates Toxapex's ability to sponge Water-type attacks from the likes of Golisopod, Manaphy without Psychic, and Arceus-Water and serve as a check for Pokemon like Arceus-Rock and Stone Edge Entei.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 257571, "username": "Andyboy"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 324242, "username": "in the hills"}, {"user_id": 231402, "username": "xavgb"}, {"user_id": 297239, "username": "Quantum Tesseract"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "Lumari"}, {"user_id": 336073, "username": "Rabia"}]}]}
  },
  "Golisopod": {
    "overview": "<p>As one of the premier Blue Orb attackers in Mix and Mega, Golisopod is one of the best offensive wallbreakers. Golisopod's Liquidation, backed by a strong base 175 Attack after the Blue Orb boost as well as Primordial Sea, punches holes in many walls in the tier. Furthermore, Aqua Jet allows it to also serve as a revenge killer to pick off faster threats and weakened attackers. A key resistance to Ground-type moves and a Fire immunity as it switches in give it many opportunities to come in against opposing threats. Unfortunately, a poor base 40 Speed stat leaves Golisopod vulnerable to faster attackers. In addition, the one-dimensional nature of Golisopod's attacks can make it predictable and easy to check. Golisopod also fails to 2HKO bulky walls unboosted, limiting its ability as a wallbreaker.</p>",
    "comments": "<h3>Other Options</h3> <p>First Impression is an option to inflict heavy STAB damage on the first turn out on threats such as Lucarionite Zygarde but is not reliable enough due to it only being usable on the first turn. Leech Life can be used to give Golisopod longevity but is usually not worth it, as the recovery is usually negligible.</p> <h3>Checks and Counters</h3> <p><strong>Red Orb Users</strong>: Red Orb Users, such as Primal Groudon, Victini, Volcarona, and Raikou, all threaten to switch in on Golisopod's Water-type moves and nullify them with Desolate Land. However, many of them should be wary of Drill Run.</p> <p><strong>Water-resistant Pokemon</strong>: Latiasite Toxapex, Mega Salamence, Arceus-Water, and Giratina resist Liquidation and are not affected greatly by Golisopod's coverage options.</p> <p><strong>Bulky Walls</strong>: Aggronite Buzzwole, Sablenite Zapdos, and Aggronite Mew can avoid the 2HKO from Golisopod's Liquidation and retaliate.</p> <p><strong>Pinsirite Users</strong>: Pinsirite users like Zygarde, Entei, Genesect, Magearna, and Metagross all outspeed Golisopod and OHKO it with super effective Aerilate-boosted STAB moves.</p> <p><strong>Powerful Offensive Threats</strong>: Altarianite Zygarde, Lunala, Ultra Necrozma, Diancite Shaymin-S, and Diancite Tapu Lele do not appreciate switching in on Liquidation, but they can check Golisopod with powerful offensive moves.</p> <p><strong>Stealth Rock</strong>: Golisopod does not enjoy taking 25% damage on entry from Stealth Rock, which can quickly wear it down.</p> <p><strong>Status</strong>: Burn and poison damage wear down Golisopod quickly. Furthermore, burn halves Golisopod's attack, rendering it feeble.</p>",
    "sets": {
      "Blue Orb Attacker": {
        "description": "<h4>Moves</h4> <p>Liquidation is Golisopod's primary STAB attack, dealing heavy damage to foes that do not resist Water-type moves. Aqua Jet allows it to pick off faster threats and revenge kill weakened Pokemon, including Lucarionite Terrakion and Lucarionite Zygarde. Swords Dance allows Golisopod to boost its Attack to break past many bulky walls such as Sablenite Blissey and bulky Arceus formes. Drill Run hits many of Golisopod's switch-ins, such as Primal Groudon and Red Orb Victini, for good damage. Toxic can be used to wear down many walls like Arceus-Fairy in tandem with Liquidation. Spikes, likewise, can be used to deal damage on entry and can be set on many of Golisopod's switch-ins, such as Latiasite Toxapex and Aggronite Buzzwole.</p> <h4>Set Details</h4> <p>Blue Orb gives Golisopod access to Primordial Sea, canceling out Fire-type attacks and giving Golisopod's Water-type STAB attacks a boost. In addition, the +50 Attack boost and +20 Special Defense boost give it additional power and a slight increase in bulk. An Adamant nature and 252 Attack EVs maximize Golisopod's offensive capabilities. 252 HP EVs are used to maximize overall bulk, and 4 Special Defense EVs slightly increase Golisopod's special bulk.</p> <h4>Usage Tips</h4> <p>Golisopod should be utilized early-game to break and chip walls with its powerful Liquidation while keeping Red Orb users such as Primal Groudon and Victini in check. Aqua Jet should be utilized to damage switch-ins and revenge kill weakened threats throughout the game, such as Darkrai and Lucarionite Zygarde. Utilization of Golisopod's Ground and Fire resistances should give it many opportunities to switch into offensive threats such as Primal Groudon and nullify them. If Spikes or Toxic is opted for, it can be used early on to slowly wear down opposing walls such as Venusaurite Zapdos. Entry hazards should be kept off Golisopod's side to prevent it from losing defensive value. Swords Dance should be used sparingly, as Red Orb users can easily come in on the turn the Golisopod boosts and shut it down. Keeping Golisopod unstatused is quite important, as once statused, it loses much of its ability to neuter the aforementioned threats.</p> <h4>Team Options</h4> <p>Primal Groudon appreciates Golisopod breaking down many of its checks, such as Blue Orb Skarmory and Arceus-Ground, and in turn it can set Stealth Rock to weaken Golisopod's checks, such as Aggronite Buzzwole and Sablenite Zapdos, as well. Lucarionite Terrakion heavily threatens many of Golisopod's checks, including Red Orb Victini and Sablenite Zapdos, and can form an offensive core with Golisopod. Altarianite Zygarde, Diancite Tapu Lele, and Metagrossite Kartana appreciate Golisopod's ability to wear down checks and give them opportunities to sweep. Lunala and Cameruptite Magearna act as special attackers that can work in tandem with Golisopod to break opposing defensive cores. Sablenite users such as Mew, Blissey, and Zapdos bounce back entry hazards and status moves, giving Golisopod more chances to switch in. Defog support from Venusaurite Gliscor and support Arceus formes also helps prevent Stealth Rock being set up on Golisopod's side. Arceus-Fairy and Aggronite Buzzwole check the variety of Zygarde formes and provide additional defensive utility. Arceus-Ground and Venusaurite Gliscor can check Primal Groudon, which is one of the premier switch-ins to Golisopod.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 314467, "username": "Catalystic"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 297239, "username": "Quantum Tesseract"}, {"user_id": 376369, "username": "astralydia"}, {"user_id": 231402, "username": "xavgb"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}, {"user_id": 232216, "username": "Lumari"}]}]}
  },
  "Buzzwole": {
    "overview": "<p>Aggronite Buzzwole is a great physical wall thanks to its excellent defensive typing in Bug / Steel. It has great utility moves that are suitable for its role of a physical wall including Lunge, Bulk Up, and Roost. It also boasts a useful resistance to Pixilate Extreme Speed after Mega Evolution, making it a check to threats with the move like the notable Altarianite Zygarde. Upon Mega Evolution, it has only one weakness and a plethora of resistances, allowing it to fearlessly take more physical hits than it could before. For example, it then easily takes on Glalitite users and Altarianite users. It is a unique wall in the fact that it isn't passive; it cannot be easily used as setup fodder, and in some situations it can use its offensive presence to become a wincon late-game. Filter is useful for fighting against defensive Pokemon carrying Fire-type moves, but is much less help against offensive Pokemon with Fire-type coverage. Unfortunately, Buzzwole's Special Defense is still low after Mega Evolving. While it can still be used to take on weak special attackers, it will struggle to take anything from the likes of Lunala and Blastoisinite Darkrai.</p>",
    "comments": "<h3>Other Options</h3> <p>Toxic can be run to cripple switch-ins, but there is little room for it, and it doesnt always help. Blue Orb is helpful for Buzzwole's defenses and grants an immunity to Fire, although it suffers from not having a better defensive typing and weaknesses to -ate users. Offensive sets like a Metagrossite set with the spread 80 HP / 252+ Atk / 176 Spe and running three attacks or two attacks + Toxic can work, but Buzzwole can easily lose to -ate users without Aggronite. Ice Punch allows Buzzwole to handle Ground-types, like Landorus-T, but loses out on coverage for Steel-types. While Buzzwole could choose to run Ice Punch over Lunge, it then loses to certain defensive setup Pokemon like Sablenite Nasty Plot Mew and Calm Mind Arceus formes. Leech Life can be run over Lunge for semi-reliable recovery, but Lunge has better utility. While Sablenite might seem like a good idea to greatly increase Buzzwole's Special Defense, it's often better used by a teammate.</p> <h3>Checks and Counters</h3> <p><strong>Fire-types</strong>: Many Fire-types, including Ho-Oh and Entei, hit Buzzwole for super effective damage. Several Fire-types are also naturally mixed, such as Primal Groudon or Red Orb Victini. However, Ho-Oh must be running an offensive set in order to reliably threaten out Buzzwole.</p> <p><strong>Special Attackers</strong>: Many special attackers, including Primal Kyogre and Lunala, can hit Buzzwole hard and easily force it out. Any special attacker that also doesn't mind Bug and Ground coverage, like Calm Mind Arceus-Ground and -Flying, can also come in freely.</p> <p><strong>Status</strong>: Burns annoy Buzzwole a lot, since it won't be able to force out as many threats, such as Substitute Zygarde, while burned. Paralysis is also dangerous, since Buzzwole appreciates being active every turn against certain threats, like Swords Dance Kartana.</p> <p><strong>Physical Walls</strong>: Opposing physical walls such as Gliscor and Zapdos can easily wall Buzzwole, leaving it unable to do much against them.</p> <p><strong>Taunt</strong>: Taunt renders Buzzwole incapable of checking certain setup sweepers like Cobalion, which requires Roost and Bulk Up.</p>",
    "sets": {
      "Physical Wall": {
        "description": "<h4>Moves</h4> <p>Roost provides reliable recovery, allowing Buzzwole to stay healthy through the match and continue to check what it needs to check. Bulk Up lets Buzzwole increases its Defense, helping it take physical hits much better, and its Attack, forcing out Pokemon that don't threaten it like Altarianite Zygarde and Blue Orb Golisopod. Lunge decreases the foe's Attack, making it useful for weakening Pokemon that Buzzwole checks. Iron Head gives Buzzwole a STAB move that hits Fairy-types super effectively, notably beating Z-Geomancy Xerneas, although Lunges Attack drop is usually more appreciated. Earthquake makes Buzzwole able to hit Red Orb users such as Victini and Azelf on the switch and threaten Steel-types. Drain Punch provides semi-reliable recovery and pressures Blissey.</p> <h4>Set Details</h4> <p>Aggronite changes Buzzwole's Fighting typing to Steel, allowing Buzzwole to better check many physical threats and lose many of its former weaknesses. Filter is helpful when fighting defensive Pokemon, as many of them cannot successfully force it out even with Fire-types attacks. The EVs used and an Impish nature maximize physical bulk, allowing Buzzwole to do its job better. An alternative spread of 248 HP / 116 Atk / 144 Def with an Impish nature allows Buzzwole to 2HKO Metagrossite Kartana with Drain Punch, 2HKO other defensive Pokemon like Sablenite Mew with Lunge, and have increased general offensive presence. The loss in bulk might not be worth it, however.</p> <h4>Usage Tips</h4> <p>Buzzwole should be used to take physical hits, so switch it into threatening physical attackers. However, be careful of mixed attackers and foes with Fire coverage. Buzzwole should use Bulk Up when its safe to do so, such as against a Lucarionite Zygarde without Dragon Tail, as Bulk Up will aid it in its job to wall threats. Lunge helps Buzzwole set up, and should be used often when faced with physical threats. Lunge also gives Buzzwole the ability to take on setup sweepers and weakens incoming switch-ins, which could make them easier to deal with for Buzzwole. Buzzwole needs to be healthy to keep checking many different physical threats like Kartana and Lucarionite Zygarde, so using Roost often isn't a bad idea. Buzzwole can easily check several different -ate users, although it has an unfortunate neutrality to Flying. As such, be careful around Aerilate users, as they may be able to break through Buzzwole eventually. Taunt can shut down Buzzwole very easily, so be careful around users of it like Cobalion and Terrakion, as Buzzwole may require Roost or Bulk Up to safely beat those users. Buzzwole has a Bug / Fighting typing before Mega Evolution, which changes what it can switch into safely. For example, Altarianite users are obviously dangerous to switch into while Fighting-type.</p> <h4>Team Options</h4> <p>Buzzwole dislikes having to take special attacks, so partners like Blissey and Magearna help it a lot. Blissey deserves a special mention, as it forms a great core with Buzzwole, easily taking any special attacks while Buzzwole takes physical attacks for Blissey. Red Orb users inherently force out Buzzwole, so partners that can do likewise to Red Orb users, like Golisopod and Primal Kyogre, are appreciated. Lucarionite Zygarde also pairs well with Buzzwole for this purpose, and Buzzwole is able to serve as a way to Imposter-proof Zygarde when facing a Ditto. Clerics are appreciated, as burns and paralysis really hurt Buzzwole's offensive presence. Blissey is a notable partner for this purpose. Buzzwole really dislikes being chipped every time it comes in, so Defog users are nice partners. Mega Salamence, Arceus-Fairy, and Gliscor are possible partners for this purpose. Terrakion can easily break through Mega-Evolved Buzzwole, so teammates that can handle it are highly appreciated. Giratina and Arceus-Fairy are excellent checks. Buzzwole does not appreciate Fire-type moves at all, so switch-ins to those are wanted. Dragon-types like Arceus-Dragon and Mega Salamence are usable, but Blue Orb users like Golisopod and Magearna are particularity helpful.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 400313, "username": "Sectonia"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 297239, "username": "Quantum Tesseract"}, {"user_id": 376369, "username": "astralydia"}, {"user_id": 231402, "username": "xavgb"}]}, {"name": "Grammar checked by", "members": [{"user_id": 331519, "username": "CryoGyro"}, {"user_id": 91628, "username": "GatoDelFuego"}]}]}
  },
  "Kartana": {
    "overview": "<p>Kartana is a threatening Pokemon in Mix and Mega because it makes good use of its already high Attack, decent Speed, and unique movepool to utilize Tough Claws from Metagrossite. After Mega Evolving, Metagrossite Kartana's base 191 Attack and 149 Speed allow it to outspeed and 2HKO most of the Mix and Mega metagame, including threats like Weavile, Landorus-T, unboosted Zygarde, and Lucarionite Terrakion. Kartana's useful Grass / Steel typing leaves it with a notable resistance to Fairy-type moves like Altarianite Zygarde's Extreme Speed, as well as leaving it with a key resistance to Water-type moves, allowing it to win against Golisopod one-on-one if needed. When Kartana's typing is combined with its base 151 Defense stat after Mega Evolving, Kartana is able to survive powerful resisted attacks more easily as well. However, Kartana's Grass / Steel typing also leaves it with a huge weakness to the common Fire type, which means that it is easily forced out by Primal Groudon as well as Entei and Victini if it isn't running Return. On top of that, by virtue of being a physical attacker, Kartana is easily taken on by physical walls like Zapdos, Will-O-Wisp Mew, and Aggronite Buzzwole, and with mediocre Special Defense, Kartana is left extremely susceptible to almost all special moves.</p>",
    "comments": "<h3>Other Options</h3> <p>Kartana can run Lopunnite over Metagrossite for a bigger Attack boost after Mega Evolving and a type change to Grass / Fighting to gain STAB from Sacred Sword to eliminate both the need for Smart Strike and the worry of Ghost-types switching in thanks to Scrappy; however, Lopunnite makes Kartana slower, frailer, and weaker to more types, especially -ate Extreme Speed from Pokemon like Altarianite Zygarde. If you're running Kartana on a Sticky Web team, you can opt to use Lucarionite or Aerodactylite over Metagrossite, as they both provide larger Attack boosts while remaining nearly the same in regard to bulk and abilities; however, note that if the Sticky Web on the foe's side of the field is removed or never gets set up, Kartana becomes more susceptible to being outsped and KOed. Despite the Speed drop, Smart Strike from Lucarionite Kartana 2HKOes Cameruptite Magearna and is therefore a great choice for offense teams that are prone to a counter sweep. Make note that Lucarionite Kartana also runs Substitute over Sacred Sword to potentially block status and to prevent it from being phazed with Dragon Tail. In addition to Lucarionite and Aerodactylite, Kartana can run Pinsirite with Return to get an Aerilate-boosted Flying-type STAB move for better type coverage. While running Defog over Smart Strike or Return might seem like a good option, it severely restricts Kartana's coverage and causes it to miss out on a lot of key KOs.</p> <h3>Checks and Counters</h3> <p><strong>Aggronite Buzzwole</strong>: Aggronite Buzzwole can completely invalidate almost anything that Kartana attempts to do to it due to its immunity to Toxic after Mega Evolving, meaning that bulkier teammates cannot Toxic stall it for Kartana.</p> <p><strong>Fire-types</strong>: Fire-types like Primal Groudon, Entei, and Victini are able to switch in on Kartana on a resisted hit and KO in return with their respective Fire-type STAB moves; however, Entei and Victini are 2HKOed by Return.</p> <p><strong>Status</strong>: Mew and Arceus-Ghost can cripple Kartana by burning it with Will-O-Wisp, and certain targets like Zygarde and Zygarde-C can paralyze Kartana with Glare, making it easy to revenge kill.</p> <p><strong>Bulky Flying-types</strong>: Bulky Flying-types, namely Zapdos and Mandibuzz, are able to easily take one of Kartana's hits and, in Zapdos's case, either force it out or KO it with Heat Wave, and in Mandibuzz's case, threaten to OHKO it with Foul Play. Rarer Flying-types like Arceus-Flying also take care of Kartana relatively easily with STAB moves like Judgment, as well as the surprise factor that they present.</p> <p><strong>Magearna</strong>: Even though Kartana is able to eventually break through Magearna with enough boosts from Swords Dance, Cameruptite Magearna is able to either set up Trick Room to force Kartana out, outspeed and KO it due to its pitiful special bulk, or utilize Pain Split with its attacking moves to wear down Kartana and its teammates.</p> <p><strong>Bulky Dragon-types</strong>: Bulky Dragon-types like Arceus-Dragon and Giratina-O can annoy Kartana by either burning it with Will-O-Wisp or OHKOing it with Shadow Ball.</p> <p><strong>Faster Attackers</strong>: Diancite users, specifically Terrakion, Shaymin-S, and Tapu Lele, are able to outspeed and KO Kartana if they don't have Sticky Web up on their side, and even if Sticky Web is up in Shaymin-S's instance, its Flying typing makes it immune Sticky Web, so it still outspeeds Kartana. However, none of the Diancite users are able to safely switch in on Kartana and risk being OHKOed if they do so. Choice Scarf users like Ditto also pose a threat to Kartana because even if Sticky Web is up on Ditto's side, it can transform into Kartana to copy Kartana's stat changes to get rid of a lowered Speed stat and then outspeed and KO.</p>",
    "sets": {
      "Metagrossite": {
        "description": "<h4>Moves</h4> <p>Leaf Blade is Kartana's main STAB move and 2HKOes Golisopod, offensive Primal Groudon, and Lucarionite Zygarde after Mega Evolving. Sacred Sword is Kartana's best coverage move, most notably 2HKOing Sablenite Blissey after Stealth Rock as well as OHKOing it after a Swords Dance, hitting every Steel-type for at least neutral damage, and providing otherwise decent neutral coverage. Return is preferred over Smart Strike because it provides decent neutral coverage as well, and it allows Kartana to deal with Pokemon that it otherwise can't, such as Volcarona, Zapdos, Entei, and Victini. Smart Strike can be used over Return, though, because it's Kartana's strongest Steel-type STAB move and has a chance to OHKO Altarianite Zygarde without any prior chip damage while also guaranteeing an OHKO after Stealth Rock. Swords Dance allows Kartana to boost its Attack to monstrous levels in order to change some key 2HKOs into OHKOs such as against defensive Primal Groudon to prevent it from being forced out.</p> <h4>Set Details</h4> <p>Maximum Attack EVs and access to Tough Claws after Mega Evolving let Kartana hit as hard as possible, notably OHKOing Weavile and Altarianite Zygarde, and Metagrossite, maximum Speed EVs, and a Jolly nature allow Kartana to become stronger, faster, and bulkier in order to outspeed and beat them. Beast Boost is Kartana's only ability prior to Mega Evolving, but it can be useful for a free boost before Mega Evolving against weakened foes.</p> <h4>Usage Tips</h4> <p>Before Mega Evolving Kartana, try to use it as a revenge killer against slower foes in order for it to utilize Beast Boost for free Attack boosts. Use Kartana as a fast revenge killer against offensive teams after Mega Evolving to take care of weakened Altarianite Zygarde and Lucarionite Terrakion. Unless Kartana has already set up, avoid leaving it in against healthy Fire-types like Primal Groudon, Entei, Victini, and Red Orb Shaymin-S due to its 4x weakness to Fire-type moves, and be wary about leaving Kartana in against bulky special attackers like Magearna and Lunala. Try to set up Swords Dance after opposing faster or bulkier special attackers like Magearna and Diancite Shaymin-S have been weakened or removed to decrease Kartana's risk of being forced out. Use more passive Pokemon like Venusaurite Gliscor as setup fodder for Swords Dance to enable Kartana to deal with physically bulky Pokemon like defensive Primal Groudon more easily. Kartana is still easily KOed despite its nice Defense, so try to use Swords Dance on predicted switches or against more passive Pokemon like Toxapex and the previously mentioned Gliscor.</p> <h4>Team Options</h4> <p>Stealth Rock setters like Shuckle, Primal Groudon, and Landorus-T are appreciated because Kartana enjoys having as much chip damage dealt to the opposing team as possible to make its job easier. Shuckle is also greatly appreciated due to its ability to set up Sticky Web because Kartana appreciates being able to outspeed foes like Diancite Terrakion. Kartana's special bulk is abysmal, so specially bulky Pokemon like Ho-Oh and Magearna make for good teammates; Ho-Oh is especially useful because it has great type synergy with Kartana, covering Kartana's weakness to Fire-type moves from defensive Primal Groudon while Kartana covers Ho-Oh's weakness to Rock-type moves and physical Water-type moves. Kartana is extremely weak to Fire-type moves; this can be mitigated by having Blue Orb users like Golisopod, Magearna, and Primal Kyogre as teammates. Golisopod is also helpful because it offers utility in the form of Spikes. While not as common, Kartana has issues with Fighting-types like Diancite Terrakion and Keldeo when Sticky Web isn't up, so Altarianite users like Zygarde and Entei are good teammates. Even though Kartana doesn't take much damage from Stealth Rock and is immune to Toxic Spikes, it still loses a significant amount of health from Spikes and can have its effectiveness hindered by a potential Sticky Web being set up on its side of the field, so hazard control from Defoggers like Gliscor, Zapdos, and various Arceus formes is helpful. Venusaurite Gliscor and Zapdos are also useful because they have Thick Fat after Mega Evolving to help Kartana deal with Fire-types, and their type combinations and bulk allow them to deal with Fighting-types as well. Slow pivots like Gliscor, Sablenite Zapdos, and Sablenite Mandibuzz are also helpful to get Kartana in safely to force out more Pokemon for free setup opportunities, and they can use Toxic + Roost to help weaken and stall foes that Kartana struggles with.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 241023, "username": "dhelmise"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 376369, "username": "astralydia"}, {"user_id": 297239, "username": "Quantum Tesseract"}, {"user_id": 324242, "username": "in the hills"}]}, {"name": "Grammar checked by", "members": [{"user_id": 388157, "username": "A Cake Wearing A Hat"}, {"user_id": 148071, "username": "Electrolyte"}]}]}
  },
  "Magearna": {
    "overview": "<p>With a great defensive and offensive typing, solid base stats, and a handful of moves to take advantage of, Magearna is widely considered one of the most versatile threats M&amp;M. Its Fairy / Steel typing enables it to check a wide arrange of offensive threats in the tier, with the most notable being Tapu Lele, Kartana, and opposing Magearna. Adding onto this, the additional bulk and useful abilities that Mega Stones such as Manectite and Pinsirite provide enable Magearna to check a wider array of threats such as Arceus-Ground, Terrakion, Zeraora, and Altarianite Zygarde. Its supportive movepool is also noteworthy, where moves such as Pain Split and Volt Switch enable it to sustain its health while wearing down checks and grabbing momentum easily. Access to Shift Gear and a powerful Physical move such as Return combined with the lack of solid Flying-resistant Pokemon in M&amp;M also enables Magearna to employ a setup Shift Gear set in combination with Pinsirite, further enhancing its versatility as an offensive threat. It's especially potent as a setup sweeper because of its resistance to Extreme Speed from Pokemon like Pinsirite and Altarianite Entei, which are some of the main revenge killing options in the metagame. This versatility also makes Magearna very hard to consistently check; its checks vary greatly on the set it is running. For example, Arceus-Ground can check Manectite Magearna but will struggle greatly against Pinsirite Magearna. However, supportive Magearna sets can be stopped cold by the omnipresent Primal Groudon, which not only resists both its STAB moves but also can prevent it from pivoting by blocking its use of Volt Switch. Beyond that, Magearna can also be pressured very heavily by various other Pokemon such as Necrozma-DM, Lucarionite Terrakion, and Lucarionite Zygarde, necessitating additional support from its team to properly account for these threats. It's also worth noting that the lack of reliable recovery can also hamper Magearna's ability to stay healthy throughout the course of a match; Pain Split can be taken advantage of by the foe to recover their own health, making it an unreliable move.</p>",
    "comments": "<h3>Other Options</h3> <p>Sablenite Magearna can also be used as a great special wall that can annoy status spreaders as well. However, this set does not see as much success and is quite uncommon due to it struggling to bypass common entry hazard setters such as Primal Groudon and Terrakion. Latiasite variants can also utilize both a pivot and bulky Calm Mind + Pain Split set to great success, being able to counteract checks such as Arceus-Ground, Landorus, and Mamoswine and utilize them as setup fodder after Mega Evolving. However, such sets are generally outclassed by both Manectite and Pinsirite variants of Magearna due to their ability to better handle a wide array of threats. Manectite variants can also employ a Calm Mind + Pain Split set, utilizing Fleur Cannon and Thunderbolt as their attacking moves in order to turn Magearna into a potent bulky setup sweeper. Such sets should utilize an EV spread of 252 HP / 212 Def / 44 SpA with a Bold nature to enable Magearna to still check Pokemon like Kartana and Terrakion.</p> <h3>Checks and Counters</h3> <p><strong>Primal Groudon</strong>: Primal Groudon is one of the most common and effective Magearna checks in the metagame, resisting its Fleur Cannon and preventing it from gaining momentum via Volt Switch while threatening to OHKO it in return. However, Pinsirite Magearna can effectively wear down Primal Groudon very quickly, ultimately making it hard for it to switch in frequently.</p> <p><strong>Steel-types</strong>: Threats such as Aggronite Mew, Necrozma-DM, and opposing Magearna can check Magearna quite well and threaten to heavily wear it down or utilize it as setup fodder. It is worth noting that Substitute + Pinsirite Magearna can utilize Aggronite Mew as setup fodder instead.</p> <p><strong>Arceus-Ground</strong>: Arceus-Ground can check Manectite variants of Magearna relatively well, being capable of switching into its moves at high health and forcing it to switch out. However, it is important to note that Arceus-Ground can easily be used as setup fodder for Pinsirite sets.</p> <p><strong>Strong Wallbreakers</strong>: Teams with strong wallbreakers such as Lucarionite Terrakion, Pinsirite Entei, and Lunala can overwhelm Magearna very quickly due to its lack of reliable recovery. However, none of them can switch into Magearna comfortably.</p> <p><strong>Fire-types</strong>: Ho-Oh, Entei, and Victini can all threaten to OHKO Magearna through their STAB attacks and can easily switch into Manectite Magearna, though they are constantly at risk of losing momentum to Volt Switch. Pinsirite Magearna can also overwhelm them pretty quickly, especially as they are susceptible to being worn down by Stealth Rock.</p> <p><strong>Electric-types</strong>: Zeraora and Zapdos can be a huge nuisance to Pinsirite variants of Magearna, switching into their Flying-type STAB attacks with ease and proceeding to check it. It is worth noting that Zeraora can easily be overwhelmed if it repeatedly switches into Return due to its lack of recovery, though.</p>",
    "sets": {
      "Manectite Pivot": {
        "description": "<h4>Moves</h4> <p>Fleur Cannon enables Magearna to consistently check Pokemon such as Terrakion and Altarianite Zygarde. However, the drop in Special Attack often forces Magearna out after each use. Hidden Power Fire is mainly employed to OHKO Kartana, as well as deal damage to opposing Pinsirite Magearna without being forced to switch out. Volt Switch prevents Magearna from losing momentum too easily and enables it to safely bring its teammates in thanks to its rather low Speed tier. Pain Split enables Magearna to recover health against targets with a large HP stat such as Blissey, Primal Groudon, and Arceus-Ground. Heart Swap can be run over Hidden Power Fire if Kartana is adequately covered to better check other Pokemon that may attack it with special attacks, such as Calm Mind Arceus-Fairy and Slowbro.</p> <h4>Set Details</h4> <p>Maximum HP and Defense investment with a Bold nature in combination with Intimidate from Manectite is important in allowing Magearna to check the likes of Kartana, Terrakion, Altarianite Zygarde, and Zeraora.</p> <h4>Usage Tips</h4> <p>Primal Groudon is the most prominent Pokemon in the metagame, and Magearna oftentimes loses momentum against it. When facing Primal Groudon, be sure to not use Volt Switch too liberally, as it can let up momentum very quickly. Instead, you should aim to wear it down with Fleur Cannon or directly pivot to another teammate, such as Zygarde or Arceus-Ground. While Intimidate and Magearna's great physical bulk do enable it to check a large range of physical attackers, Magearna must be cautious when switching into the likes of Terrakion and Zygarde, as both threats often carry Lucarionite, which makes them powerful enough to quickly overwhelm it. Scouting for such variants is strongly advised beforehand in order to preserve Magearna's health as much as possible. Pain Split is best used when Magearna is at a low amount of HP. Checks such as Blissey and Arceus-Ground can quickly provide it with a great amount of recovery as they attempt to switch into it, so make sure to use it on forced switches in these situations. You should be very careful of using Fleur Cannon too liberally, as Magearna becomes incredibly passive once its Special Attack is dropped. It's also worth noting that you should be careful of Substitute from Pokemon such as Zygarde, as they can force Magearna out with the Special Attack drops.</p> <h4>Team Options</h4> <p>Partners that can handle Primal Groudon are extremely important, as Magearna often enables it to come in freely. Therefore, Pokemon such as Mandibuzz, Primal Kyogre, Arceus-Ground, and Slowbro can be useful to pair with Magearna. Mandibuzz deserves a highlight because Magearna can aid it in checking Fairy-types and form a VoltTurn core with it. Checks to physically offensive threats such as Lucarionite Terrakion, Entei, and Ho-Oh can be important, as they can otherwise overwhelm Magearna. Notable options include Lunala, Primal Groudon, and Slowbro. Offensive partners that can take advantage of Magearna's pivoting capabilities such as Terrakion, Tapu Lele, and Kartana can also be beneficial, as Magearna can often get them into play safely multiple times throughout the match and thus aid them in wallbreaking. Special walls such as Blissey and Gyaradosite Toxapex can help Magearna handle threats such as Tapu Lele and Lunala. Arceus-Ground can also be a nuisance to Magearna, as it can switch into Fleur Cannon with ease and proceed to use Magearna as setup fodder. Teammates such as Arceus-Water, Slowbro, Ho-Oh, and Pinsirite Entei are great partners to deal with Arceus-Ground.</p>"
      },
      "Pinsirite": {
        "description": "<h4>Moves</h4> <p>Shift Gear enables Magearna to turn into a potent setup sweeper, providing it with enough Speed after one boost to outspeed almost the entire unboosted metagame. Return is a powerful and reliable STAB move after Mega Evolving, and the metagame's lack of Pokemon that resist Flying enables Magearna to deal great amounts of damage to the majority of unboosted targets. Substitute can be a great way for Magearna to punish switch-ins such as Aggronite Mew and Primal Groudon variants lacking Fire-type moves, effectively turning them into setup fodder after Mega Evolving. This combined with Pain Split makes Magearna a major nuisance for the majority of walls in the metagame to deal with. Explosion is an alternative option that allows Magearna to immediately overwhelm many checks after the use of Shift Gear, such as Primal Groudon. It also enables Magearna to provide momentum for its teammates. Pain Split provides a semi-reliable recovery option that can let Magearna set up against the likes of Blissey and Arceus-Ground without getting worn down.</p> <h4>Set Details</h4> <p>140 EVs are placed into Speed for Magearna to outspeed Diancite Terrakion and anything slower after using Shift Gear once. The rest of its EVs are allocated towards Attack and HP with an Adamant nature to enhance its wallbreaking prowess and bulk. Pinsirite provides Magearna with a Flying typing and Aerilate, which allows it to overwhelm many of its typical checks such as Arceus-Ground.</p> <h4>Usage Tips</h4> <p>The type change that is involved with Magearna's Mega Evolution can be extremely crucial in securing a sweep in many cases. It's best to save Mega Evolving until situations where Magearna can utilize the type change to lure in its checks, such as Arceus-Ground, and catch them off guard, which will provide it with a free opportunity to set up without repercussion. Before attempting to sweep, it is important that you play patiently and try to wear down checks such as Primal Groudon into range of a +1 Return. Substitute should be used to punish switch-ins like Primal Groudon and Victini, which will need to use Overheat or V-create, respectively, in order to break it, weakening them for teammates to take advantage of. Explosion can should primarily be used in scenarios where Magearna is worn down and can cripple checks to its partners and provide momentum simultaneously. Pain Split can be used strategically to cripple common switch-ins such as Primal Groudon if Magearna has already been worn down previously.</p> <h4>Team Options</h4> <p>This variant of Magearna can often be placed on offensive teams due to the role compression it provides by acting as a setup sweeper that can also check threats such as Tapu Lele, Landorus, and Calm Mind Arceus-Ground. Primal Groudon pairs excellently with Magearna, providing Stealth Rock support while also checking many threats to Magearna such as Entei, Zeraora, and Manectite Magearna. Other offensive partners like Terrakion, Lunala, Tapu Lele, and Zygarde can aid Magearna in overwhelming shared checks like Primal Groudon and Slowbro. This synergy becomes especially notable when Magearna is running Explosion. Entry hazard control is very important due to Magearna's tendency to be worn down rather quickly. Therefore, partners such as Mandibuzz, Lunala, Arceus-Ground, and Sablenite users such as Slowbro can be quite effective.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 395754, "username": "Jordy"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 297239, "username": "Quantum Tesseract"}, {"user_id": 324242, "username": "in the hills"}, {"user_id": 376369, "username": "astralydia"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "Lumari"}, {"user_id": 336073, "username": "Rabia"}]}]}
  },
  "Zeraora": {
    "overview": "<p>Zeraora is a potent offensive threat with its great Attack and ability to outspeed threats such as Blastoisinite and Red Orb Darkrai, Metagrossite Kartana, and Diancite Tapu Lele. A Pinsirite set gives it a strong Electric/Flying STAB type combination, allowing it to harass many common Pinsirite answers such as Skarmory, Pinsirite Magearna, Terrakion, and Cobalion. Pinsirite also boosts Zeraora's Attack and already blazing Speed to great levels, allowing it to check Pokemon like Kartana, Salamencite Noivern, and Pinsirite Magearna. Its STAB allows it to beat defensive Pokemon like Arceus-Water, Ho-Oh, and Sablenite Buzzwole, while Taunt allows Zeraora to get past Pokemon like Aggronite Buzzwole and support Arceus. Fake Out enables Zeraora to Mega Evolve safely and scout for the opposing side, as well as help for your team keep faster foes in check. However, due to its weakness to Stealth Rock after Mega Evolving, it can get worn down quickly. Zeraora also lacks recovery, which means that it is unable to repeatedly switch in on the Pokemon that it checks.</p>",
    "comments": "<h3>Other Options</h3> <p>A Glalitite set can serve as lure against the Ground-types that can typically check Zeraora such as Arceus-Ground and Zygarde. Lopunnite is another option, as it gives Zeraora a great boost in Speed and Attack and Fighting-type STAB on Close Combat. However, it is checked by defensive Pokemon such as Buzzwole and Mew as well as offensive Pokemon such as Altarianite Zygarde. Facade can be used over Fake Out or Taunt to take advantage of Will-O-Wisp Arceus formes and Aggronite Mew that attempt to check it.</p> <h3>Checks and Counters</h3> <p><strong>Arceus-Rock</strong>: Arceus-Rock is quite possibly the best Pinsirite Zeraora check you can ask for, as it able to tank any attack Pinsirite Zeraora can go for and retaliate with a Will-O-Wisp or Judgment. However, it must be wary of the potential Lopunnite Zeraora.</p> <p><strong>Ground-types</strong>: Ground-types such as defensive Primal Groudon and Arceus-Ground can tank a Return and can fire back with Overheat or Will-O-Wisp, respectively. However, physical Primal Groudon sets that lack Stone Edge struggle to check Zeraora after a Bulk Up boost.</p> <p><strong>Defensive Magearna</strong>: Manectite and Latiasite Magearna are able to tank a boosted or an unboosted Plasma Fists, respectively, and can fire back with a Fleur Cannon.</p> <p><strong>Strong Priority</strong>: Extreme Speed users such as Zygarde, Entei, and Genesect can pick off a weakened Zeraora, as its defenses are not the best.</p>",
    "sets": {
      "Pinsirite Sweeper": {
        "description": "<h4>Moves</h4> <p>Return is Zeraora's main STAB move, which hits targets that resist or are immune to Electric-type moves such as Zygarde and Kartana hard. Plasma Fists threatens Water- and Flying-types such as Pinsirite Magearna, Primal Kyogre, and Arceus-Water. Bulk Up improves Zeraora's chances of cleaning and allows it to take less damage from Altarianite Zygarde and Entei. Fake Out allows Zeraora to Mega Evolve safely turn one as well as granting it a priority move. It also improves Zeraora's ability to revenge kill weakened Terrakion and Darkrai. Taunt allows Zeraora to prevent status moves and stop defensive Pokemon like Aggronite Buzzwole, Manectite Mew, and support Arceus formes from recovering.</p> <h4>Set Details</h4> <p>Pinsirite gives Zeraora a great ability in Aerilate, greater Attack and Speed, and a fantastic secondary Flying typing. Jolly is recommended to outspeed threats like Metagrossite Kartana and Diancite Tapu Lele. Volt Absorb is Zeraora's only ability, but it does provide some utility against some Pokemon such as Zapdos and even other Zeraora.</p> <h4>Usage Tips</h4> <p>This set's function is as a sweeper capable of cleaning up late-game once Zeraora's checks have been removed, as well as a reliable revenge killer for Kartana, Terrakion, and Lunala after they have been previously damaged. Zeraora should be brought in on a U-turn or Volt Switch or after a Pokemon is sacrificed so that it is able to force out threats such as Primal Kyogre. Zeraora primarily should set up on defensive Pokemon that it can force out with its STAB attacks, such as Sablenite Buzzwole and Skarmory. Zeraora is also able to set up on the likes of Metagrossite Kartana on more offensive teams. Zeraora's typing after Mega Evolving is important for checking Pokemon like Kartana and Sablenite Buzzwole as well as providing it a Ground immunity, so Zeraora should Mega Evolve as early as possible with the help of Fake Out.</p> <h4>Team Options</h4> <p>This set would fit best on offensive teams due to its ability to sweep late-game and prevent opposing cleaners from running through your team in return. Sticky Web and Stealth Rock support from teammates like Shuckle and Primal Groudon can be useful for letting Zeraora outspeed fast foes more easily and wearing down bulky foes, and Primal Groudon can also check Magearna. Defoggers such as Skarmory and Sablenite Mandibuzz can get rid of Stealth Rock for Zeraora to keep it healthy and giving it more chances to set up or attack. Special wallbreakers such as Lunala, Darkrai, and Primal Kyogre pair well with Zeraora, as they can come in on Pokemon that would check Zeraora and start wallbreaking. Physical threats like Altarianite Zygarde and Kartana also make good teammates, as they can work together with Taunt Zeraora to break down physical walls. If Zeraora is not running Fake Out, it's good to have an Altarianite Pokemon such as Zygarde or Entei to be able to check Diancite Darkrai and keep faster foes in check more reliably.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 231422, "username": "The Strap"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 324242, "username": "in the hills"}, {"user_id": 231402, "username": "xavgb"}, {"user_id": 257571, "username": "Andyboy"}]}, {"name": "Grammar checked by", "members": [{"user_id": 53214, "username": "JockeMS"}, {"user_id": 232216, "username": "Lumari"}]}]}
  }
}