{
  "Zapdos": {"sets": [{"name": "Fast Offensive"}]},
  "Tyranitar": {"sets": [{"name": "Life Orb"}]},
  "Togekiss": {"sets": [{"name": "Follow Me Offensive"}, {"name": "Follow Me + Tailwind"}]},
  "Victini": {"sets": [{"name": "Mixed Life Orb"}]},
  "Whimsicott": {"sets": [{"name": "Tailwind Setter"}]},
  "Tornadus": {"sets": [{"name": "Offensive Tailwind Setter"}]},
  "Kyurem-Black": {"sets": [{"name": "Assault Vest"}, {"name": "Chople Berry"}, {"name": "Weakness Policy"}]},
  "Genesect": {"sets": [{"name": "Mixed Life Orb"}]},
  "Zygarde": {"sets": [{"name": "Haban Dragon Dance"}, {"name": "Choice Scarf"}]},
  "Tapu Fini": {"sets": [{"name": "Weakness Policy"}]},
  "Nihilego": {"sets": [{"name": "Power Herb"}]},
  "Pheromosa": {"sets": [{"name": "Special Life Orb"}, {"name": "Physical Life Orb"}]},
  "Naganadel": {"sets": [{"name": "Life Orb"}]},
  "Zeraora": {"sets": [{"name": "Electroweb"}]},
  "Rillaboom": {"sets": [{"name": "Life Orb"}, {"name": "Assault Vest"}]},
  "Cinderace": {"sets": [{"name": "Life Orb"}]},
  "Indeedee-F": {"sets": [{"name": "Follow Me Support"}]},
  "Urshifu-Rapid-Strike": {"sets": [{"name": "Life Orb"}]},
  "Regieleki": {
    "comments": "<h1>Other Options</h1> <p>Regieleki can also run more defensive sets, running Light Screen and/or Reflect to help it and its partner live attacks and KO back, but they are not widely successful due to the prevalence of Encore Whimsicott and their lack of offensive pressure. Regieleki can also be an offensive Electric Terrain attacker with Rising Voltage alongside Pincurchin, which practically guarantees Electric Terrain with its slow Speed, letting Regieleki tear through opponents without effective resistance to Electric-type moves. This style of team is not widely seen because Pincurchin stacks Regieleki’s weaknesses to priority Tailwind and Electric-resistant or immune foes, putting extra pressure on the remaining two teammates to cover for all of these Pokemon.</p> <h1>Checks and Counters</h1> <p><strong>Ground-types: Regieleki's best move to hit Ground-type Pokemon is Hyper Beam, which does not do enough to OHKO most relevant Ground types, even with Regieleki's decent Special Attack. Zygarde and Landorus-T, the two most common Ground-types, both threaten OHKOs in return with their Ground-type STAB attacks.</p> <p><strong>Dragon-types: Dragon-types, such as Naganadel and Kyurem-B, resist Electric, and are not OHKOed by Hyper Beam either. They also threaten OHKOs or massive amounts of damage in return.</p> <p><strong>Prankster and Gale Wings Tailwind: Priority Tailwind from Whimsicott, Tornadus, or Talonflame takes away Regieleki's Speed advantage, allowing Pokemon that are usually slower than it to outspeed and OHKO Regieleki before it can damage them.</p> ",
    "sets": [
      {
        "name": "Life Orb",
        "description": "<p>Regieleki’s access to Electroweb and amazing base 200 Speed make it one of 2v2 Doubles's premier means of speed control. Electroweb is especially devastating in 2v2 Doubles because the changes in Speed take effect immediately, as opposed to at the end of the turn. Thunder is used, despite its shaky accuracy, for bulkier targets that Thunderbolt cannot reliably OHKO. For example, it always OHKOes offensive Genesect if it hits. 228 Speed EVs allows Regieleki to outspeed opponents such as Zapdos-Galar and Victini at +1 speed or when Regieleki is at -1 Speed. The Special Attack is for maximum damage. The rest of the EVs are extra, and can be moved into Speed for the Regieleki mirror matchup if desired.</p> <p>Regieleki is often paired with teammates that benefit from the excellent speed control it provides, such as Genesect, Pheromosa, and Regidrago. Regieleki's teammates will also cover for common Pokemon that resist or are immune to its Electric-type attacks, such as Naganadel, Zygarde, and Landorus-T. Common Pokemon that fill this role are Kyurem-B, Urshifu-R, and Cinderace.</p> "
      },
      {
        "name": "Choice Scarf",
        "description": "<p>One of Regieleki's biggest weaknesses is being OHKOed before it can move after opposing Prankster Whimsicott or Tornadus sets Tailwind up. However, when holding a Choice Scarf, Regieleki will outspeed nearly everything in the format despite Tailwind and drop their Speed with Electroweb before they move. Hyper Beam is used as a means of hitting Ground-, Grass- and Dragon-type Pokemon, like Zygarde, Whimsicott, and Landorus-T with a burst of damage before being KOed. This Regieleki has the EVs to survive +0 Bug Buzz from Defensive Life Orb Genesect, and outspeed Tornadus in Tailwind with some extra Speed to spare.</p> <p>Choice Scarf Regieleki pairs well with Pokemon that struggle against Prankster Tailwind, such as Pheromosa and Naganadel. Choice Scarf Regieleki is especially great with Pheromosa because Electroweb allows Pheromosa to outspeed -1 Speed Genesect in Tailwind, nabbing a surprise KO on it with Close Combat after Electroweb. Choice Scarf Regieleki struggles against the Ground- and Dragon-types of the tier, most notably Kyurem-B, Landorus-T, Zygarde, and Naganadel. Pheromosa, Kyurem-B, Naganadel, Urshifu-R, and other Pokemon with similar offensive typings generally deal with these Pokemon well with the amazing speed control Regieleki provides.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 457210, "username": "Le Creme Brule"}, {"user_id": 430787, "username": "PA"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 518399, "username": "Itchy"}]}
  }
}