{
  "Empoleon": {"sets": {"Entry Hazard Control": {}}},
  "Blastoise": {"sets": {"Shell Smash Sweeper": {}}},
  "Nidoking": {
    "overview": "<p>Nidoking's presence in the BDSP OU metagame is marked by its powerful, Sheer Force boosted moves. Between its good STAB combination, wide variety of coverage moves, and the large number of Pokemon threatened by its strong attacks, such as Heatran and Clefable, it naturally performs well against balance and stall teams. However, Nidoking can struggle against more offensive teams thanks to its underwhelming Speed tier and weakness to common offensive typings like Water, Ground and Psychic. Furthermore, even in good matchups it can feel a bit prediction reliant, as the opponent can pivot around its moves into a faster threat.</p>",
    "sets": {
      "Wallbreaker": {
        "description": "<p>Ice Beam mainly hits Gliscor and Garchomp, but it is generally a good middle ground-option to hit Dragon- and Ground-types in general, such as Dragonite, Donphan, and Latias. Flamethrower is used to OHKO Scizor and Skarmory, as well as ease prediction against Steel-types. A Timid nature allows Nidoking to outspeed Timid Heatran, Jolly Feraligatr and Adamant Lucario, but the power boost Modest provides can be appealing to some teams.</p> <p>Nidoking mainly fits on balance and bulky offense, as it is a useful tool for dismantling bulkier teams. Due to its poor defensive profile, Nidoking can struggle to get onto the field; therefore, it appreciates pivoting support from teammates such as Rotom-W and Scizor. The former can even switch into Water types that might give Nidoking trouble, while the latter can do the same for Psychic types. It also pairs well with more offensive pivots, like Choice Band Infernape, who can pressure Blissey, the best answer to Nidoking. Entry Hazards can amplify Nidoking's wallbreaking potential, and as such, setters like Heatran and Skarmory are great partners. Dragon-types like Dragonite and Latias enjoy the pressure Nidoking puts on Clefable and Steel-types.</p> <h4>Other Options</h4> <p>Nidoking can run Focus Punch over Flamethrower to lure in and heavily damage Blissey, leaving it unable to answer it anymore. However, the lack of any use beyond this specific matchup makes the reliability of Flamethrower more valuable for most teams. Toxic Spikes can help wear down some of its checks like the afromentioned Blissey, as well as Slowking, while supporting its teammates. However, this can limit Nidoking's wallbreaking capabilities. A Focus Sash set with Stealth Rock is another option, as Nidoking beats Gliscor, one of the best Defoggers in the tier, and can get something done even in unfavorable matchups. However, dropping Life Orb leaves Nidoking unable to net some important KOs, such as against Scizor and Rotom-W. Nidoking can also run Thunderbolt as another useful coverage option to hit bulky Water types that might otherwise give it trouble, like Milotic and Slowking, but those targets aren't common enough to warrant the move's usage most of the time.</p> <h4>Checks and Counters</h4> <p><strong>Revenge Killers</strong>: Due to its average speed and middling bulk, a lot of fast Pokémon can easily revenge kill Nidoking, such as Latias, Garchomp, Weavile, and Starmie. Crawdaunt and Azumarill can OHKO it with Aqua Jet.</p> <p><strong>Blissey</strong>: Blissey is by far the best answer to Nidoking, easily tanking all its moves aside from the rare Focus Punch while sporting reliable recovery in Soft-Boiled. While it can be overwhelmed through team support, it is often a hard stop to anything Nidoking does.</p> <p><strong>Water-types</strong>: Some Water-types, like Slowking or Milotic, can switch into most of Nidoking's attacks and threaten it back with their Water STAB moves. Choice Scarf Rotom-W can switch into anything but Sludge Wave, outspeed it and threaten it with Hydro Pump.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 504171, "username": "VTMagno"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 277988, "username": "dex"}, {"user_id": 279858, "username": "Lalaya"}]}, {"name": "Grammar checked by", "members": [{"user_id": 277988, "username": "dex"}]}]}
  },
  "Clefable": {
    "overview": "<p>Defensive Clefable is a staple for bulkier teams, as it blanket checks a myriad of setup sweepers such as Feraligatr, Garchomp, and Azumarill courtesy of its ability Unaware. Furthermore, its amazing Fairy typing allows it to pivot into Dragon-type STAB moves from the aforementioned Garchomp, Latias, and Dragonite, forcing them out. With Thunder Wave to debilitate the likes of Heatran or Flamethrower to punish other Steel-types, Clefable isn't easy to safely pivot into. Its access to utility moves such as Wish, Aromatherapy, and Stealth Rock makes it extremely customizable to support a team's needs. Calm Mind also turns it into a solid wincon for slower teams and makes it overall less passive. However, Clefable's reliance on Wish + Protect to sustain itself long-term renders it extremely passive and easily exploitable by prominent threats such as Magnezone and Nidoking. Furthermore, its overall bulk is fairly mediocre, meaning strong unboosted attacks such as Choice Band Infernape's Flare Blitz and Choice Specs Latias's Psychic completely demolish it. Moreover, it is easily chipped down by entry hazards, which make it a shaky blanket check if the team lacks sufficient entry hazard removal. However, Clefable is hard to pass up on due to its success against a lot of prominent sweepers, and its minor issues are easily fixed by its partners, making it a top-tier choice on more balanced teams.</p>",
    "comments": "<h3>Other Options</h3> <p>Moonlight might seem tempting as an immediate recovery option that doesn’t require Protect; however, its extremely limited PP makes it detrimental in the long term. A Magic Guard set utilizing a Life Orb can turn Clefable into a potent attacker, making use of its amazing coverage options such as Focus Blast for Heatran, Ice Beam for Gliscor, and Thunderbolt for Skarmory. Despite that, being forced to run Moonlight for recovery makes Clefable much easier to overwhelm, and this set loses much of the defensive utility that Unaware brings over Magic Guard. Aromatherapy is an option if teams desperately need a cleric; however, it bothering Gliscor and having very specific usage make it a mediocre option. A set with Stored Power and Calm Mind or Cosmic Power can sweep unprepared teams, but it is extremely matchup dependent, as it is walled by Dark-types and easily pressured by status. Cosmic Power + Charge Beam is a similar option, but it forfeits a lot of Clefable's defensive capabilities and is extremely inconsistent.</p> <h3>Checks and Counters</h3> <p><strong>Steel-types</strong>: Offensive Steel-types such as Magnezone, Heatran, and Lucario easily force Clefable out, but they are easily worn down and the latter three hate Thunder Wave. Clefable is normally unable to break past Scizor, but Scizor dislikes being paralyzed and Calm Mind sets can break past it in the long term. Further, all of these Steel-types bar Heatran fall to Flamethrower.</p> <p><strong>Residual Damage</strong>: Entry hazards easily put Clefable into range of being overwhelmed by the foes it is supposed to check. If Clefable gets statused, it becomes much easier to break through as well, as burn chip damage negates the passive Leftovers recovery, paralysis makes its Wish + Protect much more inconsistent, and Toxic prevents it from stonewalling setup sweepers.</p> <p><strong>Strong Attackers</strong>: Due to its mediocre bulk, Clefable can easily be broken through by powerful wallbreakers such as Choice Band Infernape, Life Orb Garchomp, and Choice Specs Latias.</p> <p><strong>Taunt / Trick / Whirlwind User</strong>: Due to Clefable's passiveness, it is easily shut down by Taunt from Pokemon like Heatran and Gliscor. Trick + Choice Scarf from the likes of Rotom-W also makes it much easier to take advantage of, and Choice Scarf prevents it from consistently healing. Lastly, phazing from the likes of Whirlwind Skarmory prevents Clefable from recovering properly.</p>",
    "sets": {
      "Defensive": {
        "description": "<h4>Set Description</h4> <p>Wish and Protect provide Clefable reliable recovery that can also allow it to sustain its teammates for longer games. Calm Mind turns Clefable into a dangerous cleaner, especially against weakened teams late-game; if it uses Unaware, then it will have the edge against other Calm Mind users whose boosts get ignored. With Thunder Wave, Clefable can paralyze Heatran on the switch, supporting slower threats like offensive Scizor and Breloom that may be stymied by it. Aromatherapy is useful to relieve its team from the effects of status, and it is especially useful if Clefable is using Unaware because these variants hate getting worn down and being forced to use Wish. If another Pokemon cannot run Stealth Rock, then Clefable can set the entry hazard up itself with its useful defensive profile. Clefable also tends to lure in Steel-types like Scizor, which hate getting blasted by Flamethrower. A physically defensive set with Unaware is the standard, ensuring that threats that can boost their attack like Dragonite, Garchomp, and Feraligatr cannot make their way through it. However, a specially defensive Magic Guard set is more useful against special attackers like Starmie, Alakazam, and Latias. Specially defensive Clefable is not completely safe against the uncommon Life Orb Psyshock from Alakazam, which threatens to break through it, but it is not OHKOed and can cripple it with paralysis, which is favorable for the Clefable. Additionally, Magic Guard Clefable absorbs status like Rotom-W's Will-O-Wisp very nicely, and it completely ignores Spikes and Toxic Spikes.</p> <h4>Team Options</h4> <p>While physically defensive Clefable can stuff boosting physical sweepers, it is not perfect against all physical attackers; Life Orb Garchomp and Crawdaunt as well as Choice Band Azumarill and Weavile can still break through it. Therefore, pairing it with other defensive Pokemon that can handle the other attacks that Clefable cannot take is good; Rotom-W is an example that can take many of these foes' attacks. Steel-type attackers like Scizor and Lucario threaten out Clefable well, so checks to them like Heatran for the former and Garchomp for the latter are appreciated. Gliscor is an especially reliable Lucario check and can even soft-check bulky Swords Dance variants of Scizor. These Pokemon are also able to set up Stealth Rock, freeing Clefable from having to do so. Defensive Pokemon that lack reliable recovery, such as Rotom-W and Heatran, appreciate Clefable being able to heal them with Wish. Fast offensive Pokemon like Weavile, Garchomp, and Latias appreciate the fact that they can fall back on Clefable when being forced out by a Fighting- or Dragon-type; in exchange, these offensive Pokemon can revenge kill wallbreakers like Nidoking that give Clefable trouble. Unaware Clefable also dislikes entry hazards that wear it down; Defoggers like Gliscor, Latias, and Scizor and Rapid Spin Starmie can help with this. All of the Defoggers, especially Gliscor, are particularly good against Roserade, which switches into Clefable, threatens it out with STAB Sludge Bomb, and lays down Spikes and Toxic Spikes that cut into Unaware Clefable's longevity. Specially defensive Magic Guard Clefable gives up its ability to handle physical attackers, so teammates like Tangrowth and Skarmory that can do so are mandatory. Tangrowth is a better option against Water-types such as Crawdaunt and Azumarill, while Skarmory is superior against Weavile and Dragonite; both handle Garchomp equally well. In exchange, they can fall back on Clefable to take on Starmie and Latias that would destroy them.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 529732, "username": "adem"}, {"user_id": 555379, "username": "Tbolt"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 409438, "username": "Savouras"}, {"user_id": 593115, "username": "igiveuponaname"}, {"user_id": 279858, "username": "Lalaya"}, {"user_id": 327020, "username": "TyCarter"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny"}, {"user_id": 517429, "username": "Adeleine"}]}]}
  },
  "Alakazam": {
    "overview": "<p>Alakazam is a premier wallbreaker in BDSP OU, tearing holes through slower teams lacking a hard counter. Alakazam's high Speed tier lets it outspeed other prominent threats such as Infernape and Starmie, forcing them out with its superb coverage. Furthermore, Magic Guard gives Alakazam a myriad of benefits, such as preventing it from being worn down by entry hazards, preserving its Focus Sash, and mitigating Life Orb recoil. Furthermore, counterplay to Alakazam differs depending on what item it is running; using a Life Orb denies nearly all defensive counterplay options through its sheer power, while running a Focus Sash prevents Alakazam from being instantly revenge killed, which is often enough for it to break apart more offensive teams. However, Alakazam is not without its flaws, as its physical bulk is extremely poor, causing it to be revenge killed easily and limiting its setup opportunities. Moreover, its reliance on Focus Blast to deal with Dark- and Steel-types means just one miss can ruin it. Additionally, while Alakazam has a strong offensive presence, it rarely ever threatens to OHKO foes without a boost, meaning if Focus Sash has been broken or it is known to be using a Life Orb, multiple Pokemon can just tank a hit from it and OHKO it back.</p>",
    "comments": "<h3>Other Options</h3> <p>Recover gives Alakazam the chance to heal off weak hits and use passive Pokemon like non-Calm Mind and non-Thunder Wave Blissey as complete setup fodder while restoring its Focus Sash should it get chipped. However, Alakazam's pitiful bulk makes this option rarely relevant in practice. Dazzling Gleam gives Alakazam a consistent option to hit Dark-types without Focus Blast's chance to miss; however, it is much weaker and leaves Alakazam helpless against some Steel-types. If Shadow Ball is replaced, Alakazam becomes unable to break Jirachi and opposing Alakazam, making Dazzling Gleam a much worse option regardless of what move is dropped. Encore can lock Pokemon into a non-damaging move, giving Alakazam or its teammates free setup turns; however, it is inconsistent and can very rarely be used. Taunt is usable on hyper offense teams to prevent entry hazards or dual screens from going up from slower leads like Azelf and Skarmory while preventing the likes of Scizor and Skarmory from recovering. It can also deny Defog from Scizor and Gliscor, helping teammates like Lucario and Feraligatr sweep more easily.</p> <h3>Checks and Counters</h3> <p><strong>Steel-types</strong>: Scizor walls Focus Sash variants of Alakazam, while Life Orb variants require getting a sequence correct and landing multiple Focus Blasts, making Scizor as close to a counter as you can get. Heatran can switch into Alakazam's Psychic-type STAB moves and Shadow Ball a few times and force it out; however, it can lose if Alakazam uses Nasty Plot or Focus Blast as it switches in. Similarly, Jirachi can switch into Alakazam's Psychic-type STAB move and Focus Blast; however it loses if Alakazam sets up with Nasty Plot or hits it with Shadow Ball on the switch.</p> <p><strong>Revenge Killing</strong>: Faster Pokemon like Weavile and Choice Scarf Garchomp can revenge kill Alakazam, although they are unable to safely switch into it directly. Beat Up and Dual Chop, respectively, bypass Alakazam's Focus Sash if it has one, making them much more consistent at checking it. Priority such as Dragonite and Lucario's Extreme Speed and Crawdaunt's Aqua Jet easily remove Alakazam due to its poor physical bulk; however, they are unable to switch into it. To add onto that, Focus Sash variants of Alakazam can live one hit from full HP and potentially KO these Pokemon back. As such, this requires Alakazam to either be chipped or scouted first in order to consistently revenge kill it.</p>",
    "sets": {
      "Nasty Plot": {
        "description": "<p>Psychic is Alakazam's STAB move of choice due to its higher Base Power; however, Psyshock allows Alakazam to break through special walls such as Gastrodon and Blissey much more easily, especially with a Life Orb. Focus Blast lets Alakazam nail the Steel- and Dark-types that would otherwise wall it such as Tyranitar, Scizor, and Heatran. Shadow Ball deals with opposing Psychic-types such as opposing Alakazam, and Jirachi, which can switch into Focus Blast and Alakazam's Psychic-type STAB move. Magic Guard benefits Alakazam no matter which item it is running; if running Life Orb, Magic Guard prevents its recoil; if running Focus Sash, Magic Guard preserves it in the face of entry hazards. Life Orb can be used to wallbreak much more effectively, notably allowing Alakazam to 2HKO Scizor with Focus Blast after Stealth Rock chip. Focus Sash in turn provides a one-time safety net for Alakazam to setup for free or revenge kill something safely.</p> <p>Alakazam fits best on offense and bulky offense teams, as both archetypes are fast-paced enough to take advantage of Alakazam punching holes in opposing walls while still maintaining the ability to safely bring it in multiple times. Due to Alakazam's frailty, it greatly appreciates slow pivoting from Pokemon such as Gliscor, Rotom-W, and Scizor to bring it in safely. Stealth Rock support from the aforementioned Gliscor, Heatran, and Garchomp are extremely useful, as they allow Alakazam to break through its checks more easily. Azelf is a solid partner, as it can form an exceptionally potent Psychic Spam core, weakening their shared checks. The likes of Weavile, Nidoking, and Nasty Plot Rotom-W work well with Alakazam to wallbreak for each other. A strong defensive core is also appreciated alongside Alakazam, as it invites in powerful revenge killers like Weavile. Focus Sash Alakazam works exceptionally well on hyper offense teams with partners such as Feraligatr, Azumarill, and Lucario, as it provides a one-time countermeasure to opposing sweepers and can clean weakened teams due to its high Speed tier, all while Focus Sash prevents it from being revenge killed by priority. Clefable also can assist Scizor in checking the likes of Garchomp and Weavile on balance teams, as Scizor can get easily overwhelmed.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 529732, "username": "adem"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 277988, "username": "dex"}, {"user_id": 279858, "username": "Lalaya"}]}, {"name": "Grammar checked by", "members": [{"user_id": 277988, "username": "dex"}]}]}
  },
  "Slowbro": {"sets": {"Defensive Pivot": {}}},
  "Cloyster": {"sets": {"Shell Smash Sweeper": {}}},
  "Weezing": {"sets": {"Defensive Utility": {}}},
  "Starmie": {
    "overview": "<p>Starmie is a diverse presence both offensively and defensively in BDSP OU. Its high Speed, great coverage, and Analytic ability make offensive Starmie a frightening sight for offensive teams, which struggle to repeatedly handle its powerful attacks over the course of a game. Meanwhile, it can invest into its bulk to provide Rapid Spin support for threats like Weavile that hate Stealth Rock while checking foes like Heatran. While Starmie is a powerful offensive threat, its poor bulk when not given investment means that it has little defensive utility, and as a result, it cannot safely enter the field on attacks. This also means that it gets revenge killed easily by faster foes like Alakazam and Weavile and Choice Scarf users like Rotom-W, Celebi, and Garchomp. Defensive Starmie can be rather passive and gives free turns to Pokemon that don't care about its attacking moves, including Alakazam and Rotom-W; however, Starmie can threaten status that gives these foes pause. Finally, special tanks and walls like Celebi, Mew, and Blissey can shrug off Starmie's attacks and use it as an opportunity to gain momentum with U-turn, remove entry hazards with Defog, and set up Stealth Rock of their own.</p>",
    "comments": "<h3>Other Options</h3> <p>Thunder Wave can see use on Starmie, as it is a useful option that can slow down fast Dragon-types for slower teammates like Togekiss. However, it is hard to fit on offensive Starmie, which would prefer the extra coverage or Recover, and defensive Starmie's best switch-ins are Pokemon that don't care about paralysis, making it less effective on it.</p> <h3>Checks and Counters</h3> <p><strong>Rotom-W</strong>: Rotom-W resists Hydro Pump and Ice Beam and isn't scared of Thunderbolt, especially if it is specially defensive, and can use it to gain momentum with Volt Switch. However, it dislikes Life Orb Psychic on the switch.</p> <p><strong>Bulky Water-types</strong>: Defensive Starmie struggles to damage bulky Water-types like Milotic and Starmie without Scald burns. However, offensive Starmie can finish off weakened Water-types with its strong Thunderbolt, though Milotic can occasionally use Mirror Coat to punish this. Certain Water-types like Gastrodon and Water Absorb Quagsire don't fear Hydro Pump or Thunderbolt, though they fear a potential Life Orb Psychic and are not common choices on teams.</p> <p><strong>Bulky Grass-types</strong>: While they dislike switching into Ice Beam, Roserade and Celebi have the special bulk to take Starmie's hits and use it as an opportunity to set up entry hazards or threaten Starmie back with their STAB moves. Roserade dislikes taking Life Orb Psychic, however.</p> <p><strong>Special Walls</strong>: Blissey and specially defensive Mew shrug off even Analytic Life Orb Hydro Pump and can set up Stealth Rock or pivot out with Volt Switch. Specially defensive variants of Clefable switch in nicely to Starmie, especially if it uses Magic Guard to ignore entry hazards and Scald burns.</p> <p><strong>Revenge Killers</strong>: Starmie is frail, especially without any HP investment, so Pokemon that outspeed it, be it because they are naturally faster like Weavile and Alakazam or they have a Choice Scarf like Rotom-W, Celebi, and Garchomp, can threaten lethal damage to it. This also includes priority like Extreme Speed from Dragonite and Lucario and Quick Attack from offensive Scizor. However, Starmie resists other common forms of priority in Aqua Jet, Bullet Punch, and Mach Punch.</p>",
    "sets": {
      "Offensive": {
        "description": "<h4>Set Description</h4> <p>Offensive Starmie uses its coverage and Speed to terrorize many offensive teams that struggle to handle it. Hydro Pump, Ice Beam, and Thunderbolt together provide excellent coverage. Life Orb Hydro Pump on the switch is so powerful that it threatens to 2HKO foes that don't resist it, including the likes of Scizor and physically defensive Clefable. Ice Beam threatens Dragon- and Grass-types like Latias and Celebi, and Thunderbolt hits Water-types like Milotic. Recover gives Starmie a means to extend its assault on the opposing team on forced switches, making it unreliable to play around it with Life Orb recoil, Psychic is its most powerful move for Rotom-W while also hitting Roserade for more damage, and Rapid Spin can be used to remove entry hazards while providing Starmie a means to outspeed revenge killers. 29 HP IVs let Starmie take less damage from Life Orb recoil.</p> <h4>Team Options</h4> <p>Starmie fits well on offensive and balanced teams that can shore up Starmie's poor defensive presence. Scizor and Rotom-W are excellent teammates to Starmie, as they can use pivoting moves that bring in Starmie safely. Scizor is able to check Weavile, Latias, Alakazam, and Grass-types and tends to draw in Heatran, which Starmie severely threatens. Rotom-W is able to damage Water-types like Milotic and Suicune so that Starmie can finish them off with its Thunderbolt. Fairy-types like Clefable can take Dark- and Dragon-type attacks from the likes of Weavile and Latias. Steel-types like Heatran and the aforementioned Scizor check Dragon- and Grass-types like Latias and Celebi; Heatran is able to set up Stealth Rock, which makes Starmie's attacks more difficult to handle. Grass-types take advantage of bulky Water-types that can withstand Thunderbolt at high HP; Celebi is able to pivot Starmie in with U-turn, while Roserade can spread sleep and set up Spikes, which enables Starmie even more. Walls are great at taking attacks from Choice Scarf revenge killers on balance teams; Gliscor and Tangrowth shrug off physical attacks from Choice Scarf Pokemon like Garchomp, while Blissey takes on special Choice Scarf attackers like Celebi and Latias. Offensive Starmie is vulnerable to status because it doesn't use Natural Cure, so clerics like Aromatherapy Blissey and Clefable give it recourse against them.</p>"
      },
      "Defensive": {
        "description": "<h4>Set Description</h4> <p>Defensive Starmie is primarily a spinner that reliably denies Heatran and Garchomp from keeping Stealth Rock on its side of the field. This is further aided by the fact that Ghost-types are uncommon in BDSP OU, so when it uses Rapid Spin, entry hazards are likely to be gone. It is also a decent check to Infernape, though it should be cautious around Choice Band U-turn. Scald lets Starmie spread status that makes attackers wary of switching into it, making it less passive. Ice Beam lets it threaten Dragon- and Grass-types that would otherwise switch into Scald, including Latias, Roserade, and Celebi, while Thunderbolt lets it threaten Water-types like Milotic and opposing Starmie that aren't immediately fearful of Scald. 216 Speed EVs and a Timid nature let Starmie outspeed Latias.</p> <h4>Team Options</h4> <p>Defensive Starmie is a useful teammate for Pokemon weak to Stealth Rock, including Weavile, Togekiss, and Dragonite. These Pokemon also find easy entry on Celebi, which is a Stealth Rock setter that Starmie cannot reliably deny entry hazards from. Teammates that deter Grass-types like Scizor and Heatran are great Starmie teammates, as the rather weak Starmie can be exploited by these Grass-types for momentum or hazards. Because Starmie handles hazard removal, teammates that could use Defog can drop the move and adopt more threatening options; for example, bulky Scizor can drop Defog for Swords Dance, letting it threaten weakened teams more effectively. Starmie can effectively form Fire / Water / Grass cores with Heatran and Celebi, and these Pokemon provide a team stability against most threats in the metagame in conjunction with a Fairy-type like Clefable or Togekiss. Skarmory and Roserade can set Spikes and check foes that threaten Starmie; Skarmory handles Scizor, while Roserade handles Electric- and Grass-types. Starmie, in return, checks Fire-types that they struggle against. They also appreciate the fact that Starmie removes hazards that dig into them while leaving hazards that they set up unperturbed.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 555379, "username": "Tbolt"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 593115, "username": "igiveuponaname"}, {"user_id": 327020, "username": "TyCarter"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Dragonite": {
    "overview": "<p>Dragonite, thanks to its high Attack, good typing, Multiscale, and large movepool, is a powerful wallbreaker and sweeper. Its typing provides it with excellent defensive utility, lending it resistances to common attacking types like Fire, Fighting, and Grass, making it a solid answer to threats like Breloom and Infernape. Furthermore, Extreme Speed and Dragon Dance make Dragonite a powerful late-game cleaner. Though Dragonite is able to beat most of its checks thanks to Earthquake and Fire Punch, its weaknesses to Stealth Rock and status as well as reliance on prediction hampers its longevity and effectiveness throughout the game. Furthermore, Dragonite is susceptible to being revenge killed by faster threats like Latias or Weavile and is walled by Clefable. Lastly, it suffers from the ubiquity of other, faster Dragon-type Pokemon like Garchomp and Latias.</p>",
    "comments": "<h3>Other Options</h3> <p>Dragonite, with its fantastic bulk, can also provide a good amount of utility for its teammates. As a Defogger, it beats common entry hazard setters like Heatran, Skarmory and Gliscor in addition to being a very solid check to both Infernape and Breloom thanks to its combination of Ice Beam, Fire Blast, and Earthquake, while Roost lets Dragonite recover Multiscale and increases Dragonite's longevity considerably. However, its weakness to Stealth Rock and Ice-type moves as well as its overreliance on Multiscale is very detrimental to the effectiveness of any defensive set.</p> <h3>Checks and Counters</h3> <p><strong>Fairy-types</strong>: Fairy-type Pokemon such as Clefable and Togekiss are able to switch into Dragonite in most scenarios and deter it from using its Dragon-type STAB moves. Togekiss is also immune to Earthquake, whereas Unaware Clefable stops any sweeping attempts.</p> <p><strong>Ice-types and Ice-type Coverage</strong>: Life Orb Mamoswine and Choice Band Weavile are able to OHKO Dragonite with Icicle Crash through Multiscale and with Ice Shard if Multiscale is broken. However, neither of them are able to switch into Dragonite, and Extreme Speed has higher priority than Ice Shard, so they have to act with caution.</p> <p><strong>Steel-types</strong>: Steel-type Pokemon such as Scizor, Jirachi, Skarmory, and Heatran prevent Dragonite from using its most powerful STAB move, Outrage. Heatran can even take advantage of Outrage to try to fish for a Flame Body burn. However, they are all vulnerable to Dragonite's coverage moves like Earthquake and Fire Punch.</p> <p><strong>Stealth Rock</strong>: Much of Dragonite's bulk comes from Multiscale. In addition to being weak to Stealth Rock, the entry hazard breaks Multiscale, effectively deterring Dragonite from entering the field.</p> <p><strong>Rotom-Wash</strong>: Rotom-W can cripple Dragonite if it doesn't use Lum Berry with Will-O-Wisp or Thunder Wave while also being immune to Earthquake. However, if Dragonite is locked into Outrage, Rotom-W cannot effectively cripple it, as Dragonite is still able to 2HKO Rotom-W through burn.</p> <p><strong>Revenge Killers</strong>: Using Outrage lets threats like Mamoswine, Azumarill, and Latias easily revenge kill Dragonite.</p>",
    "sets": {
      "Choice Band": {
        "description": "<p>Outrage is Dragonite’s most powerful STAB move, 2HKOing common physically bulky Pokemon like Tangrowth, Slowbro and Gliscor. As Outrage locks Dragonite into the move for multiple turns, Earthquake is a good mid-ground option because it hits Heatran and Jirachi super effectively while hitting Scizor and Clefable neutrally. Extreme Speed is a powerful tool that can clean up or revenge kill weakened faster pokemon like Starmie or Latias while circumventing Ice Shard from Weavile and Mamoswine. Fire Punch allows Dragonite to OHKO Scizor, while Dragon Claw it a secondary STAB option that avoids Outrage's downsides. Iron Tail is also an option to 2HKO Clefable but has very limited application outside of this matchup in addition to its bad accuracy. An Adamant nature helps Dragonite hit as hard as possible, while a Jolly nature can be used to outspeed Adamant Lucario and faster Gliscor variants.</p> <p>Choice Band Dragonite fits with most offensive teams that appreciate its wallbreaking and cleaning prowess as well as its defensive utility, especially since it doesn’t need much support to function. Dragonite likes to have Magnezone or Heatran for a partner, as they both put pressure on Steel- and Fairy-types, while Dragonite is able to switch into opposing Ground-, Fighting- and Fire-type moves from Infernape and Gliscor. In addition, Dragonite pairs well with fellow Dragon-types like Latias and Garchomp that share the same checks and counters, allowing them to work together to break through them. Dragonite benefits from Stealth Rock setters such as Heatran or Jirachi; the latter also provides Doom Desire, which helps Dragonite to break would-be checks like Clefable. Alongside it, a Defogger or a spinner such as Gliscor, Scizor or Starmie prevents Dragonite from being worn down too quickly. Finally, Dragonite combines well with other wallbreakers like Infernape, Lucario, and Breloom that appreciate Dragonite's ability to weaken shared checks like Gliscor, while Dragonite can take advantage of their ability to pressure Pokemon like Latias, Clefable and Steel-types to use Outrage more easily.</p>"
      },
      "Dragon Dance": {
        "description": "<p>Dragon Dance Dragonite is a sweeper that trades off immediate power for better sweeping potential. One Dragon Dance allows Dragonite to outspeed many common foes such as Garchomp and Latias. Outrage is the STAB move of choice for its high power and neutral coverage. Earthquake allows Dragonite to clear through Steel-types such as Heatran or Jirachi, while Extreme Speed ensures Dragonite can punish potential revenge killers such as Choice Scarf Latias and Weavile. Lum Berry protects Dragonite from burn or paralysis and cures Outrage-induced confusion that would otherwise make its sweep uncertain. As an other option, Yache Berry, in combination with Multiscale, gives Dragonite opportunities to set up on Pokemon running Ice-type attacks such as Starmie and Slowbro in a pinch while preventing Mamoswine and Weavile from revenge killing Dragonite in case its Multiscale gets broken and it cannot set up enough.</p> <p>Dragon Dance Dragonite requires a lot of support to realize its full potential. Keeping the field free of Stealth Rock is mandatory to preserve Multiscale for as long as possible. Teammates like Gliscor and Starmie can remove entry hazards, while Taunt users like Azelf and lead Skarmory can prevent the opponent from getting Stealth Rock up in the first place. In addition, Azelf can set up dual screens or Stealth Rock, while Skarmory can set both Stealth Rock and Spikes. Setting up Stealth Rock is essential, as it enables Dragonite to OHKO Weavile most of the time and 2HKO utility Togekiss with Extreme Speed after one boost. Due to the absence of Fire Punch, Magnezone is particularly valuable, as it traps defensive Skarmory and prevents it from phazing Dragonite with Whirlwind. More generally, Lucario and Nidoking are powerful wallbreakers that are able to effectively damage Fairy- and Steel-types such as Scizor and Unaware Clefable that would otherwise prevent Dragonite from sweeping. Also, Pokemon such as Latias and Alakazam like Dragonite's ability to severely damage shared checks like Weavile and Scizor for their own sweeping attempt.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 510459, "username": "Xilefi"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 277988, "username": "dex"}, {"user_id": 529732, "username": "adem"}]}, {"name": "Grammar checked by", "members": [{"user_id": 277988, "username": "dex"}]}]}
  },
  "Mew": {"sets": {"Utility": {}}},
  "Feraligatr": {
    "overview": "<p>Feraligatr is one of the metagame's most potent sweepers. Sheer Force and Dragon Dance combined make Feraligatr extremely powerful, it has good coverage in Crunch and Ice-type attacks to hit almost the entire metagame at least neutrally, and its decent bulk and typing allow it to set up in most games. These traits make Feraligatr consistently threatening, as it is often extremely dangerous to offensive teams while still taking a decent chunk out of many defensive builds. However, Feraligatr's Speed tier is somewhat disappointing, as it loses to Choice Scarf users, especially dedicated revenge killers such as Latias and Rotom formes. Additionally, certain physical walls can deal with Feraligatr, such as Celebi and Rotom-W.</p>",
    "comments": "<h3>Other Options</h3> <p>A Swords Dance set makes Feraligatr extremely powerful and potentially make it game ending to some defensive teams, but it loses much of its use against offense. Aqua Jet could be run on such a set to mitigate this issue, but Feraligatr would lose access to a crucial coverage move. Additionally, Crawdaunt does this set better, having a powerful STAB Knock Off and much more power.</p> <h3>Checks and Counters</h3> <p><strong>Water-types</strong>: Poliwrath is one of the best answers to Feraligatr, resisting all its moves and taking them rather comfortably, even after boosts. Milotic is another great answer, as it can keep itself healthy with Recover and remove boosts with Haze. Rotom-W is more susceptible to chip damage, but defensive sets are good checks when healthy, and Choice Scarf sets can revenge kill or status it. Azumarill and Crawdaunt also resist all of Feraligatr's attacks, and they threaten it offensively in return, although they are shaky switch-ins due to +1 Waterfall easily 2HKOing them.</p> <p><strong>Select Physical Walls</strong>: Tangrowth can take any hit from a boosted Feraligatr at full health and OHKO it in return, although it can be chipped into Ice Beam range by entry hazards. Unaware Clefable can take one hit and retaliate, but it cannot take down Feraligatr on its own if hazards are up.</p> <p><strong>Revenge Killers</strong>: Choice Scarf users such as Rotom-C, Garchomp, and Latias can all potentially revenge kill Feraligatr, as can priority users such as Dragonite and Infernape; however, all of them except for the Rotom formes need Feraligatr to be chipped beforehand in order to take it down.</p>",
    "sets": {
      "Dragon Dance Sweeper": {
        "description": "<p>Feraligatr's Dragon Dance set uses its coverage and power to threaten many of the metagame's best Pokemon. Crunch hits Slowbro, Latias, and Starmie. It also hits threats such as Rotom-W, Milotic, and Empoleon neutrally, which can let Feraligatr get past them if they have been chipped significantly. Ice Punch is boosted by Dragon Dance and hits Grass- and Dragon-types such as Breloom, Garchomp, Dragonite, and Celebi. Ice Beam isn't boosted by Dragon Dance, but it still hits many of these targets while also doing significantly more damage to Tangrowth; Ice Beam will always KO Tangrowth after Stealth Rock and one layer of Spikes, while Ice Punch maxes out at around 65% with one boost. However, Ice Beam does significantly less to targets such as Celebi and Roserade. Life Orb and Sheer Force team up to give Feraligatr excellent damage output; all of Feraligatr's offensive moves get boosted by Sheer Force, meaning it will never take Life Orb recoil. A Jolly nature is recommended to outrun Weavile after a boost. Adamant can be considered for maximum damage output, but the loss of power is notable when attempting to deal with threats such as Clefable and Rotom-W. A Naive nature should be used if running Ice Beam.</p> <p>Feraligatr is a great choice for hyper offense teams, as it can team up with other hyper offense sweepers to form an exceptionally threatening offensive core. Notably, Feraligatr and other Water-type sweepers, such as Azumarill and Cloyster, can beat down each other's checks, such as Rotom-W and Celebi. Other hyper offense teammates, such as Lucario, Swords Dance Garchomp, Focus Sash Breloom, and Swords Dance Scizor, can open holes for Feraligatr to clean up later or take advantage of the holes it opens up. Swords Dance Scizor and Lucario are especially nice, as they pressure Weavile, while Focus Sash Breloom can mess with Clefable. A lead such as Azelf or Skarmory can support the team with entry hazards or dual screens. It is also possible to use Feraligatr on a standard offense or bulky offense team. Feraligatr greatly appreciates Spikes support from teammates like Roserade on such teams; Roserade can also help by dealing with Water-types like Rotom-W and Milotic. Other ways to pressure these Water-types include Power Herb + Solar Beam Heatran, Rotom-W, and Celebi.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 475916, "username": "Sputnik"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 277988, "username": "dex"}, {"user_id": 279858, "username": "Lalaya"}, {"user_id": 369076, "username": "Tuthur"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}]}
  },
  "Azumarill": {
    "overview": "<p>Azumarill graces BDSP OU as either a terrifying, hard-to-scout Belly Drum sweeper or a strong wallbreaker with Choice Band. Huge Power, STAB priority in Aqua Jet, and a rarely-resisted STAB combination back up its offense, while its Water / Fairy typing helps it switch into prominent Dragon-types and some offensive threats. Azumarill is generally a strong option for hyper offense and standard offense teams, since Aqua Jet is handy in the priority-heavy BDSP OU metagame, and it switches into offensive foes such as Feraligatr, Weavile, and Infernape to quickly wreak havoc. However, it needs support to stay healthy —especially if using Belly Drum— and to handle certain threats. Its low Speed leaves it vulnerable defensively despite its decent bulk and Aqua Jet, and it needs help to pressure the common Breloom and Rotom-Wash, which massively threaten it in return. Azumarill's main set, Belly Drum + Sitrus Berry, also struggles to beat Unaware Clefable, a common defensive glue Pokemon that it can't 2HKO. Still, Azumarill usually only needs one window of opportunity to either sweep or put a dent in the opposition.</p>",
    "comments": "<h3>Other Options</h3> <p>Belly Drum Azumarill can run an alternative EV spread of 92 HP / 252 Atk / 164 Spe with an Adamant nature. This spread improves its bulk while still outspeeding defensive Skarmory. Facade is a niche alternative to Superpower for Choice Band Azumarill that allows it to still be functional if it is burned.</p> <h3>Checks and Counters</h3> <p><strong>Grass-types</strong>: Defensive Tangrowth can switch into Choice Band Azumarill, but it has to scout Azumarill's set, since Belly Drum lets Play Rough OHKO it. Breloom falls to Play Rough but resists Aqua Jet and outspeeds Azumarill, letting it revenge kill Azumarill with Seed Bomb or Bullet Seed. It can also use Spore and then set up. Shaymin forces Azumarill out with Seed Flare and can stomach +6 Aqua Jet; however, it cannot switch into Choice Band Play Rough unless it has Defense investment.</p> <p><strong>Rotom-W</strong>: Rotom-W can cripple Azumarill with Will-O-Wisp, resists Aqua Jet, and easily threatens massive damage with Volt Switch or Thunderbolt. While Rotom-W doesn't like to take a Play Rough on the switch, Azumarill can only outspeed even uninvested Rotom-W with a suboptimal Jolly nature.</p> <p><strong>Bulky Water-type Pokemon</strong>: Quagsire with Unaware can avoid 2HKOs from Belly Drum Azumarill and stall it out with Toxic barring Waterfall flinches, but it does struggle against the Choice Band set, which cleanly 2HKOes it. Empoleon can phaze Belly Drum Azumarill one time, but it fares much better against the Choice Band set, as it can take all its attacks besides Superpower. Milotic naturally outspeeds Azumarill and wipes out its Belly Drum boost with Haze. Milotic struggles against the Choice Band set, though, since Play Rough 2HKOes unless Marvel Scale is active. Azumarill, regardless of the set, fears a Scald burn when facing bulky Water-types in general.</p> <p><strong>Revenge Killers</strong>: Most offensive threats can damage Belly Drum Azumarill enough that it either can't set up or enters KO range for most priority moves. Azumarill's most notable revenge killers are Latias, and Starmie, which can safely take a +6 Aqua Jet, even with chip damage, and OHKO Azumarill. Focus Sash Alakazam can also check Azumarill in a pinch, being able to deal with the Choice Band set with two Psychic hits, provided Azumarill isn't locked into Aqua Jet.</p> <p><strong>Faster Priority</strong>: Lucario, Dragonite, and offensive Scizor can pick off weakened Azumarill with priority before it can use Aqua Jet. Choice Band Dragonite can even take a Play Rough from Choice Band Azumarill, 2HKOing in return with Extreme Speed.</p>",
    "sets": {
      "Belly Drum": {
        "description": "<p>This set is designed for Azumarill to clean up late-game or heavily cripple the opposition. Once set-up Aqua Jet is its go-to move for most situations thanks to its priority. Sitrus Berry helps Azumarill beat priority revenge killers and take a hit while setting up. Mystic Water is an alternative to strengthen Aqua Jet and give a small chance to 2HKO Unaware Clefable with Waterfall. Azumarill can set up against a Latias Choiced locked into Draco Meteor or Surf, or on a Garchomp locked into Outrage. After setting up, Azumarill does need to worry about phazers like full-health Skarmory and maximally physically defensive Empoleon, but it can blow past chipped Skarmory and other Empoleon sets.</p> <p>Azumarill works best on hyper offense teams, where it can immediately threaten a sweep after a turn of setup. This set does get checked by Unaware Clefable, which is a common blanket check for the numerous setup sweepers in the tier, so a teammate like Lucario that can deal with it is great. Azumarill will need teammates that can handle Shaymin and Breloom, since both can take an Aqua Jet at +6 and threaten it with an OHKO. The most important tip with using this set is to, before sweeping, use teammates to wear down or take out Pokemon that avoid the OHKO from +6 Aqua Jet. For example, Choice Scarf users such as Infernape can wear down Starmie, and Latias with U-Turn. Scizor's U-Turn threatens to OHKO those threats and can get Azumarill into the game safely without losing momentum. Alakazam and Weavile both threaten Starmie, and Latias with their superior Speed. Garchomp is another great teammate for Azumarill to provide Stealth Rock and also deal with Magnezone, which outspeeds Azumarill and threatens it before Belly Drum. Azelf, and suicide lead Skarmory support Azumarill and its hyper offense teammates with dual screens and entry hazards. Focus Sash Alakazam, Breloom, and Dragonite are notable late-game cleaners that appreciate Azumarill's wallbreaking ability, which makes their roles easier.</p>"
      },
      "Choice Band": {
        "description": "<p>Choice Band makes Azumarill a potent immediate wallbreaker with very few switch-ins, which forces frightening predictions. Even Slowbro has a modest chance to get 2HKOed by Play Rough after Stealth Rock. The most notable difference from Belly Drum Azumarill is that this set beats the premier Unaware users of the tier: Clefable and Quagsire. Choice Band Azumarill's fourth move of choice is Superpower, which can take out Steel-types such as Empoleon, Lucario, and Magnezone on the switch.</p> <p>Choice Band Azumarill struggles against bulky Grass-types. Weavile can handle Shaymin and Tangrowth alongside Starmie, and Latias. Infernape can pivot Azumarill in with U-Turn alongside beating the Grass-types of the tier. Garchomp switches into Volt Switch and Electric-type moves in general, along with providing Stealth Rock for offense teams. Scizor pivots Azumarill in and tends to invite in Heatran and Infernape, which Azumarill performs well against. Rotom-W and Gliscor are notable defensive pivots that Azumarill works well with thanks to their Will-O-Wisp support and Electric immunity, respectively. Focus Sash Alakazam appreciates Choice Band Azumarill bulldozing the opposition and weakening its checks so it can clean up.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 327020, "username": "TyCarter"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 277988, "username": "dex"}, {"user_id": 279858, "username": "Lalaya"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}]}
  },
  "Quagsire": {"sets": {"Unaware": {}}},
  "Slowking": {"sets": {"Defensive Pivot": {}}},
  "Scizor": {
    "overview": "<p>Scizor cements itself as one of BDSP OU's most important Pokemon thanks to its solid stats and defensively useful typing, letting it fit on many teams with ease. It is by far the most common check to offensive threats such as Latias, Weavile, and Alakazam. It can act as a defensive pivot thanks to a slow U-turn, helping position its teammates that would have issues hitting the field, and with a Technician-boosted Bullet Punch, it can revenge kill weakened foes. Swords Dance gives Scizor's defensive sets a stronger late-game presence and turns offensive sets into unparalleled threats. However, Scizor's 4x weakness to Fire makes it extremely vulnerable to metagame staples such as Heatran and Infernape as well as leaving it prone to Fire-type coverage from the likes of Garchomp, Mew, and Togekiss. Scizor is also deathly afraid of Magnezone, which can trap it with Magnet Pull and cleanly 2HKO it with Thunderbolt.</p>",
    "comments": "<h3>Other Options</h3> <p>With some Attack investment and a Metal Coat as its item, Scizor can run a set functionally similar to the defensive set, trading bulk and Leftovers recovery for more immediate power and greater sweeping potential. Similarly, a Choice Band set with maximum Attack and Speed investment can be used to give Scizor immediate power and maximize its revenge killing capabilities with Bullet Punch. However, the lack of bulk investment and inability to heal with Roost makes such a set difficult to fit on teams and wield effectively, seeing as it cannot perform its defensive duties when doing so. Defog can be used over Swords Dance on the defensive set if Scizor's team is in need of entry hazard removal. Without access to Swords Dance, Scizor can more freely run minimum Speed, as it isn't filling the role of a wincon and is thus not as bothered by Tangrowth's Knock Off and Sleep Powder. This, however, is generally not recommended, as Scizor can be quite passive without the ability to boost its Attack with Swords Dance, and its poor matchups against common hazard setters such as Heatran and Garchomp make it difficult for Scizor to keep hazards off the field. A fully specially defensive spread with a Careful or Sassy nature can also be considered when running Defog if the team is in need of a sturdier check to Life Orb Alakazam.</p> <h3>Checks and Counters</h3> <p><strong>Fire-type Pokemon and Coverage</strong>: Common Fire-type Pokemon such as Heatran and Infernape resist Scizor's STAB moves and can threaten to OHKO it in return with their own STAB moves. Heatran in particular is capable of punishing Scizor's contact moves with a potential burn thanks to its Flame Body ability. In addition, Pokemon such as Garchomp, Togekiss, Mew, and more can opt to run Fire-type coverage in order to reliably threaten Scizor and other Steel-types.</p> <p><strong>Magnezone</strong>: Magnezone is able to trap Scizor with its Magnet Pull ability and force large amounts of damage onto it, being able to cleanly 2HKO defensive variants and OHKO offensive variants with minimal chip damage from entry hazards.</p> <p><strong>Bulky Water-type Pokemon</strong>: Water-types such as Rotom-W, Suicune, and Milotic can take Scizor's Bullet Punch with ease and can threaten to cripple it with a burn from Will-O-Wisp or, in the case of the latter two, Scald. Rotom-W can also cripple Scizor with a Choice item thanks to Trick. However, they all must be wary of switching into U-turn, especially the former two, as they lack recovery outside of Leftovers.</p> <p><strong>Skarmory</strong>: Skarmory's exceptional physical bulk and typing make it a solid answer to Scizor, as it walls the defensive set and uses it as an opportunity to lay down entry hazards. It can also act as a stopgap to the offensive Swords Dance set, taking less than half from +2 Brick Break and phazing Scizor with Whirlwind.</p>",
    "sets": {
      "Defensive": {
        "description": "<h4>Set Description</h4> <p>Defensive Scizor is a great choice on bulky offense and balance teams, which appreciate the defensive utility it brings to the table as well as the role compression it offers as an excellent slow, defensive pivot and wincon in one slot. Technician-boosted Bullet Punch is a great tool for revenge killing purposes, which also helps Scizor compensate for its low Speed. Swords Dance lets Scizor serve as a solid sweeper, with its boosted Bullet Punch being difficult to stop late-game. Swords Dance is also helpful for letting Scizor break past foes it would otherwise struggle to do meaningful damage to one-on-one such as Gliscor and opposing Scizor. The given EV spread ensures Scizor survives two Throat Chops from Choice Band Weavile from full health while also guaranteeing it can withstand two Surfs from Choice Specs Latias after Stealth Rock damage. A Relaxed nature can be considered instead of an Impish nature alongside lowered Speed IVs in order to underspeed opposing Scizor and retain the momentum advantage in mirror matches. Scizor would still want to be faster than Tangrowth though, as it would allow Scizor to pivot out with U-turn before it could be hit with Knock Off or Sleep Powder, which puts Scizor's ability to act as a wincon in jeopardy.</p> <h4>Team Options</h4> <p>Water-type Pokemon such as Rotom-W, Starmie, and Crawdaunt make for excellent partners, as they are able to threaten Fire-types such as Heatran and Infernape, which Scizor often tends to invite in. Ground-types such as Garchomp and Gliscor also serve as good partners to Scizor for similar reasons while also being able to provide entry hazard support, either by setting them up or in the case of the latter, removing them with Defog. Other pivots such as the aforementioned Rotom-W and Gliscor as well as the likes of Infernape and Celebi make for good partners, as they are able to rack up tons of damage against opponents in a VoltTurn chain in conjunction with hazards. Pokemon that can threaten Unaware Clefable are also appreciated, as Scizor can have difficulty breaking past it one-on-one when not running any Attack investment. Heatran and Roserade are two prime examples of such Pokemon, as they are both able to threaten Clefable directly with their STAB moves as well as reliably lay down hazards that help wear it down. Roserade can also help wear down bulky Water-types that would otherwise annoy Scizor. Frail offensive teammates such as Weavile and offensive Starmie also appreciate Scizor's slow pivoting capabilities, seeing as they would otherwise struggle to hit the field consistently.</p>"
      },
      "Offensive Swords Dance": {
        "description": "<h4>Set Description</h4> <p>Offensive Scizor is a solid choice for hyper offensive teams that want to make use of its typing and plethora of powerful priority moves to pummel opposing teams into a paste after a Swords Dance boost. Bullet Punch is Scizor's main move, being able to OHKO even the likes of Garchomp after a boost and a bit of entry hazard chip damage. Brick Break is useful coverage in order to hit Steel-types such as Heatran, Magnezone, Skarmory, and opposing Scizor, with it being able to OHKO the former two and 2HKO defensive Scizor after a boost. Quick Attack is another Technician-boosted priority move that targets faster Steel-resistant threats such as Infernape and offensive Starmie, OHKOing them at +2 after Stealth Rock damage. X-Scissor can be considered over Quick Attack in order to help Scizor break past slower, bulkier Pokemon that would otherwise be able to withstand its other moves such as Milotic, defensive Rotom-W, and Tangrowth. The listed EV spread maximizes Scizor's Attack while also ensuring it outspeeds Modest Magnezone; 32 HP EVs boost Scizor's bulk a little bit while also minimizing recoil damage from Life Orb, with the last remaining EVs dumped into its Special Defense.</p> <h4>Team Options</h4> <p>Hyper offense leads such as Focus Sash Azelf and Custap Berry Skarmory make for good partners, as the entry hazards they lay down are instrumental in chipping down foes, making it easier for Scizor to sweep teams. Similarly, Scizor appreciates teammates such as Azelf, Latias, and Espeon that can set up dual screens to let it set up more safely. Latias's access to Healing Wish also benefits Scizor, as it can give it a second shot at threatening the opposing team. Teammates that can pressure Heatran and Magnezone such as Lucario, Garchomp, Dragonite, and Belly Drum Azumarill are especially valuable for Scizor, as its sweeps are otherwise cut short by the presence of these two Pokemon. Scizor, in turn, aids its teammates by checking Pokemon its allies would otherwise struggle with such as Unaware Clefable and Weavile for Garchomp and Dragonite as well as Grass-types and Latias for Azumarill.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 593115, "username": "igiveuponaname"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 327020, "username": "TyCarter"}, {"user_id": 600739, "username": "Skitty (Skittyrox)"}]}, {"name": "Grammar checked by", "members": [{"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Skarmory": {
    "overview": "<p>Skarmory's excellent defensive typing and impressive physical bulk give it an important role in BDSP OU as a check to some of the tier's most common physical attackers like Breloom and Weavile. It is a great Spiker due to its ridiculous physical bulk, longevity, and its ability to beat common Defoggers like Gliscor and Scizor. Whirlwind further cements Skarmory as an excellent defensive centerpiece against the onslaught of physical sweepers common to the tier like Lucario and Feraligatr. Skarmory is not even limited to a defensive role; it also fits on common hyper offense structures as a dedicated lead due to its access to the combination of Spikes, Stealth Rock, and Taunt, ensuring that it can get up as many entry hazards as it can while denying opposing entry hazards. Despite its strength as a wall, Skarmory can be taken advantage of by special attackers like Latias and Starmie; Starmie can even spin its Spikes away. Skarmory is often forced to Whirlwind setup sweepers like Garchomp, leaving it weakened. It is weak to common coverage types in Electric and Fire, and it is extremely vulnerable to the ever-present Magnezone if its Shed Shell is removed. Furthermore, its face stiff competition as a suicide lead from Azelf, which boasts higher Speed and Explosion.</p>",
    "comments": "<h3>Other Options</h3> <p>Skarmory can run Defog over Spikes on its defensive set, but this is generally better accomplished by Gliscor, and the value Spikes provides is usually greater. Taunt can be run of the defensive set to prevent Scizor, Blissey, and Clefable from recovering and, in Scizor's case, removing Skarmory's Spikes; however, Taunt is hard to justify over any of Skarmory's other moves. Stealth Rock is an option over Brave Bird on the defensive set to layer even more entry hazards, but this leaves Skarmory helpless in the face of Tangrowth and Celebi.</p> <h3>Checks and Counters</h3> <p><strong>Electric-types</strong>: Though Skarmory usually runs Shed Shell to evade Magnezone's Magnet Pull, it often switches into Knock Off users like Tangrowth and Gliscor; once Shed Shell has been removed or if Skarmory is running a different item, Magnezone is free to trap and KO it. Outside of Magnezone, Pokemon like Raikou, Rotom-W, and Rotom-C pressure Skarmory while maintaining momentum with STAB Volt Switch. Raikou can set up with Calm Mind and Substitute on Skarmory, while Rotom-W can similarly set up with Nasty Plot.</p> <p><strong>Fire-types and Fire-type Coverage</strong>: Fire-types like Infernape and Heatran force Skarmory out with their strong STAB moves. Heatran is particularly good at pressuring Skarmory, as it does not mind switching into Brave Bird and can punish it with a Flame Body burn. Fire-type coverage from Pokemon like Nidoking, Dragonite, and Garchomp is similarly scary. Azelf commonly runs Flamethrower and, more importantly, Taunt, which shuts down lead Skarmory.</p> <p><strong>Strong Special Attackers</strong>: Pokemon like Latias, Alakazam, Starmie, and Togekiss not only commonly carry super effective coverage, but can simply power through Skarmory due to its middling special bulk. Latias and Starmie deserve special mention for being able to remove Skarmory's Spikes with Defog and Rapid Spin.</p> <p><strong>Crawdaunt</strong>: Crawdaunt is the rare physical attacker that has the necessary strength to outright 2HKO Skarmory, making it a particularly dangerous foe if Skarmory is a team's only physically defensive wall.</p>",
    "sets": {
      "Defensive Spikes": {
        "description": "<p>Skarmory can use its impressive physical bulk to set up Spikes in the face of common Defoggers like Scizor and Gliscor. Despite incurring recoil, Brave Bird is Skarmory's best option for pressuring Tangrowth and Breloom. Whirlwind is incredibly helpful at preventing common physical setup sweepers like Feraligatr, Cloyster, Dragonite, and Lucario from boosting past Skarmory; it also racks up chip damage from Spikes. Shed Shell is the preferred item, as it lets Skarmory escape Magnezone's Magnet Pull, which many teams rely on to handle Skarmory. However, if Magnezone is not a concern, Leftovers improves Skarmory's matchup into hard-hitting physical attackers like Lucario. Sturdy importantly lets Skarmory always live one hit from full, ensuring that it can always revenge kill or phaze a sweeper that has gotten out of hand if Skarmory is healthy.</p> <p>Skarmory fits best on balance or stall teams that appreciate its ability to wall a number of common physical Pokemon. Stacking Stealth Rock with Skarmory's Spikes is an effective strategy to whittle way the health of Pokemon like Heatran that threaten Skarmory. Blissey and Gliscor can both set Stealth Rock; Blissey can easily switch into the special attacks that forces Skarmory out, while Gliscor can deal with Fire- and Electric-types like Infernape and Heatran that pressure Skarmory. Gliscor, along with Tangrowth, are excellent Knock Off absorbers, a quality that Skarmory greatly appreciates, as losing its Shed Shell leaves it completely helpless against Magnezone. Tangrowth can also effectively switch into Crawdaunt, which is one of the rare physical attackers with enough strength to overpower Skarmory. Skarmory is especially devastating when paired with a VoltTurn core, which forces Spikes damage onto foes repeatedly by pivoting, making teammates like Rotom-W and Scizor are great options. Clefable is a good partner for dealing with special setup sweepers like Alakazam and Latias that Skarmory cannot effectively phaze. Similarly, on stall teams, Quagsire is a good option for dealing with the few physical setup sweepers, namely Lucario and Dragonite, that are capable of powering through Skarmory. Starmie is an excellent partner for removing just the opponent's entry hazards with Rapid Spin and switching into Heatran; Starmie is particularly valuable in mirror matchups, allowing Skarmory to trade Spikes with opposing Skarmory without seriously hindering its own team.</p>"
      },
      "Suicide Lead": {
        "description": "<p>The basis for this set is fairly straightforward: set up as many entry hazards as possible before Skarmory gets KOed. Taunt helps prevent opposing entry hazards from going up and stops slower Defog users like Scizor and Gliscor from removing Skarmory's own entry hazards. Brave Bird is a particularly helpful tool for generating momentum; if the opponent lets Skarmory set up all of its entry hazards, Skarmory can simply KO itself with Brave Bird recoil to safely get in a teammate. A Custap Berry, in conjunction with Sturdy, ensures that Skarmory can usually get up at least two layers of entry hazards before getting KOed.</p> <p>Suicide lead Skarmory fits best on hyper offense teams that appreciate it getting up entry hazards early while preventing foes from doing the same. Setup sweepers like Lucario, Feraligatr, and Breloom appreciate Skarmory's entry hazards chipping foes into range of their boosted attacks. Lucario, in particular, needs Stealth Rock up to OHKO Latias with +2 Extreme Speed and Tangrowth and Skarmory with +2 Close Combat, while Skarmory's ability to deny opposing entry hazards benefits Breloom by keeping its Focus Sash intact. Focus Sash Alakazam can be troublesome, as Magic Guard preserves its Focus Sash; accordingly, teammates like Choice Scarf Garchomp and Weavile are excellent choices for pressuring it. Skarmory is unable to block faser foes like Azelf and Roserade from setting up entry hazards, so Rapid Spin support from Starmie can be potentially helpful if denying opposing entry hazards is key, such as when using Dragonite and Focus Sash Breloom.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 277988, "username": "dex"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 369076, "username": "Tuthur"}, {"user_id": 529732, "username": "adem"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}]}
  },
  "Donphan": {"sets": {"Offensive Spinner": {}}},
  "Blissey": {
    "overview": "<p>Blissey is standard on stall teams and something to consider on other bulky teams for its ability to wall almost every special attacker, even strong ones like Latias and Starmie. It doubles up as a status absorber and can work as a defensive win condition that beats most stallbreakers with its Calm Mind set or support its team with its utility set. However, Blissey's passivity can be exploited by physical attackers like Azumarill, Lucario, Mamoswine, and Breloom. Furthermore, even Blissey cannot deal with some of the most problematic special attackers, such as Life Orb Alakazam and stallbreaker Heatran.</p>",
    "comments": "<h3>Other Options</h3> <p>Counter can surprise weaker physical attackers like Gliscor and Defog Scizor, and Healing Wish can give a wallbreaker or sweeper on a balance team a second chance. Both take away too much utility for most teams, however.</p> <h3>Checks and Counters</h3> <p><strong>Physical Attackers</strong>: Blissey's lacking physical bulk means any physical wallbreaker will easily defeat it. Examples include Crawdaunt, Lucario, Infernape, Breloom, and Mamoswine; only Lucario and Infernape fear Thunder Wave.</p> <p><strong>Stallbreakers</strong>: Most stallbreaking Pokemon have Blissey in mind and are prepared to remove it. Nasty Plot Togekiss, Calm Mind and Stored Power Latias rip apart stall and are only checked by Calm Mind Blissey. Stallbreaker Heatran traps Blissey with Magma Storm and Taunt. However, Heatran will struggle versus boosted Calm Mind Blissey. Note that Heatran can lure and remove common switch-ins like Gliscor or Gastrodon, so scouting its set is essential. Rotom formes threaten to cripple Blissey with Trick and then use Nasty Plot unopposed.</p> <p><strong>Life Orb Alakazam</strong>: Nasty Plot Alakazam can OHKO Blissey with +2 Psyshock and cleanly 2HKOes with Focus Blast, while Blissey can only threaten it back with Thunder Wave.</p>",
    "sets": {
      "Utility": {
        "description": "<p>With almost no relevant Ghost-types, Seismic Toss provides good neutral damage against all foes. Blissey makes a good Stealth Rock setter due to its longevity granting many opportunities to set them up. Thunder Wave cripples fast attackers such as Infernape and Latias. Heal Bell is an alternative for clerical support but makes Blissey much easier to switch into. Also, teams running Blissey often need Thunder Wave support, so if you run Heal Bell, you should have Thunder Wave elsewhere on your team. Blissey has no problems beating special attackers with uninvested Special Defense, so physical bulk is maximized for staying in against weaker physical attackers like specially defensive Scizor and better taking on Psyshock Alakazam. Coverage moves such as Ice Beam for Gliscor, Garchomp, and Breloom, Thunderbolt to chip Water-types, and Flamethrower for Scizor may also be run if you need to lure them.</p> <p>Blissey fits well on stall and balance teams due to its ability to blanket check special attackers and its great support moveset. Its team must compensate for its physical weakness with solid physical walls such as Tangrowth, Slowbro, and Clefable. Also, a separate check to Alakazam in Scizor, and other priority users like Azumarill, or a faster Pokemon like Weavile or Choice Scarf Dual Chop Garchomp is needed. Gliscor and Starmie provide important entry hazard removal and also beat stallbreaker Heatran. Gliscor makes an especially good partner, as it checks Life Orb Alakazam, blocks Volt Switch, and can check Heatran or almost any physical attacker depending on its set. If you are not running Gliscor, be sure to have a Ground-type to block Volt Switch from Magnezone and the Rotom formes. Sticky Hold Gastrodon is a good option for invalidating Trick from Choice Scarf Rotom-W.</p>"
      },
      "Calm Mind": {
        "description": "<p>Calm Mind Blissey shuts down most bulky special sweepers like Latias and Togekiss, which can break through other Blissey, and threatens to win late-game. Offensive coverage is necessary to beat the sweepers; Ice Beam and Seismic Toss are preferred, while Thunderbolt is used to hit bulky Water-types that can PP stall Seismic Toss. Seismic Toss is ultimately preferred for its greater use against unboosted foes. Blissey has no problems beating special attackers with uninvested Special Defense, so physical bulk is maximized for staying in against weaker physical attackers like specially defensive Scizor and better taking on Psyshock Alakazam.</p> <p>Calm Mind Blissey only fits well on stall due to its reduced utility and unique ability to beat such a wide range of special attackers and stallbreakers. Blissey requires strong physical walls to check the variety of Pokemon that threaten it. Unaware Clefable is a good check to setup sweepers like Azumarill, Feraligatr, and Dragonite, and Gliscor, Slowbro, and Skarmory are effective against Lucario. Tangrowth checks Breloom, in particular, and offers a backup answer to Lucario. Tangrowth and defensive Shaymin help against Water-type wallbreakers Crawdaunt, Feraligatr, and Azumarill. Skarmory is a particularly effective partner, checking Weavile, Mamoswine, Lucario, and Feraligatr, while offering the entry hazard support missing from Calm Mind Blissey. For Choice Band wallbreakers like Infernape, Mamoswine, and Azumarill, Slowbro is an effective check, though it needs a partner that resists Fairy-type attacks like Skarmory to consistently check Azumarill. Gliscor again makes a good partner, offering Defog support and checking Lucario and Infernape, though most variants will get 2HKOed by Choice Band Flare Blitz. Another option would be Poliwrath, which is one of the few true counters to the stallbreaking menace Crawdaunt and a check to Feraligatr. Specially defensive Scizor fills the necessary role of Alakazam switch-in and appreciates not having to endure other special assaults. Other essential support includes an entry hazard remover like Gliscor or Starmie, a Ground-type to keep Volt Switch users from freely gaining momentum, and a Heatran switch-in like like Slowbro or Gliscor. Heatran should be scouted first, however.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 511926, "username": "melancholy0"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 369076, "username": "Tuthur"}, {"user_id": 279858, "username": "Lalaya"}]}, {"name": "Grammar checked by", "members": [{"user_id": 331519, "username": "CryoGyro"}, {"user_id": 277988, "username": "dex"}]}]}
  },
  "Raikou": {"sets": {"Choice Specs": {}, "Calm Mind": {}}},
  "Suicune": {"sets": {"Substitute + Protect": {}}},
  "Tyranitar": {"sets": {"Choice Band": {}, "Stealth Rock": {}}},
  "Breloom": {
    "overview": "<p>Breloom is one of BDSP OU's iconic physical wallbreakers. Its sky-high Attack and insane movepool, highlighted by Spore, make it incredibly difficult to switch into. Using Technician gives Breloom both strong priority in Mach Punch and insane wallbreaking potential with Bullet Seed. Breloom can also run a SubPunch Poison Heal set to punish Pokemon like Skarmory that normally switch into it. Each ability's set needs different counterplay, and Breloom even has niche sets that require their own answers. However, Breloom relies mightily on Mach Punch to break through faster Pokemon due to its low Speed; unfortunately, Alakazam, which outspeeds and OHKOes it, resists Mach Punch. It is also forced out by common wallbreakers like Dragonite and Infernape. While Spore is threatening, the opponent can sacrifice a Pokemon as sleep fodder, reducing the pressure Breloom exerts; furthermore, physically defensive Gliscor is easily capable of switching into Spore—and Breloom in general—once its Toxic Orb activates. Despite Breloom's Grass typing, its most common set cannot stay in on the most common Water-type in the tier, Rotom-W, for fear of Will-O-Wisp. Common physically defensive walls like Clefable and Tangrowth switch into Breloom quite easily. Despite all this, though, Breloom remains a hallmark of the tier.</p>",
    "comments": "<h3>Other Options</h3> <p>Breloom is capable of running a Choice Band set for a more immediate offensive presence; however, its sweeping potential is much lower than the Swords Dance set's, and due to Breloom's mediocre bulk, it is forced out by many of the tier's offensive Pokemon. A Choice Scarf set can be run to land Spore on faster targets while breaking through Focus Sash Alakazam; however, this set relies mightily on its surprise factor, and it is not as consistent as other Choice Scarf users like Rotom-W and Garchomp. A bulky Bulk Up set with Poison Heal can turn Breloom into a threatening sweeper that is difficult to get rid of, but this set is walled by the same Pokemon as the Swords Dance set without providing nearly as much power.</p> <h3>Checks and Counters</h3> <p><strong>Tangrowth and Roserade</strong>: Tangrowth is Breloom's single true counter. It can switch into any of Breloom's moves, especially Spore, and force it out with Sludge Bomb, all while staying healthy with Regenerator. Roserade resists both of Breloom's STAB moves, ignores Spore, and forces it out with Sludge Bomb; however, due to its lower physical bulk, it can be chipped into range of +2 Mach Punch.</p> <p><strong>Physically Defensive Walls</strong>: Clefable, Gliscor, and Skarmory can switch into Breloom and either force it out or safely pivot into a revenge killer. Spore can make these Pokemon less consistent at switching into Breloom, however, though Gliscor ignores it once Toxic Orb activates. It should be noted that Gliscor does not directly offensively pressure Breloom, so it can struggle to deal with the Swords Dance set. Togekiss resists both of Breloom's STAB moves and forces it out with Air Slash.</p> <p><strong>Revenge Killers</strong>: Weavile, Infernape,  Alakazam, and Azelf all outspeed Breloom and force it out with their super effective STAB moves. Infernape, on the other hand, must be wary of getting chipped into range of Mach Punch. Dragonite outspeeds Breloom if it is Jolly, resists all of Breloom's STAB moves, and can hit it very hard with Extreme Speed or Fire Punch.</p> <p><strong>Status</strong>: Burn from Rotom-W and paralysis from Clefable severely limits Breloom's wallbreaking and sweeping capabilities. Rotom-W can still be 2HKOed by Bullet Seed after burn, however. Poison Heal Breloom is immune to these status conditions once its Toxic Orb activates, but, as a result, it is much more weak to them before it activates.</p>",
    "sets": {
      "Swords Dance": {
        "description": "<p>Swords Dance turns Breloom into a powerful wallbreaker and sweeper. Combined with Technician, Mach Punch and Bullet Seed can break through many of the tier's offensive threats. Spore serves two purposes: it makes Breloom harder to switch into and it gives Breloom the free turns it needs to set up. Rock Tomb is an option that provides excellent neutral coverage; however, it can be difficult to justify over any of Breloom's other moves. Life Orb greatly increases Breloom's sweeping and wallbreaking prowess; however, Focus Sash is a powerful option on hyper offense teams, particularly when leading Breloom, giving it a guaranteed free turn to set up or use Spore.</p> <p>Because Breloom is forced out by Psychic-types like Alakazam, Jirachi and Scizor are excellent teammates, switching into these threats and pivoting Breloom in safely with U-turn. Starmie can remove entry hazards with Rapid Spin. Heatran notably pressures Clefable, Roserade, and Tangrowth lacking Earthquake. Rotom-W can bait Tangrowth in and cripple it with Trick or Will-O-Wisp; it also can provide Breloom a free switch with Volt Switch. Breloom cannot effectively pressure Rotom-W before having set up for fear of Will-O-Wisp; accordingly, teammates like Alakazam are appreciated. Breloom is best paired with offensive partners like Lucario, Dragonite, Garchomp, and Infernape that take advantage of Spore and the holes Breloom punches in opposing walls.</p>"
      },
      "SubPunch": {
        "description": "<p>This set takes advantage of the many switches Breloom forces to set up Substitute land powerful Focus Punches on foes. Substitute, in conjunction with Poison Heal, lets Breloom circumvent the chip damage its other sets often take. Spore helps it break through physically bulky Pokemon like Skarmory and Scizor with Focus Punch. Seed Bomb hits the Water-types that resist Focus Punch like Slowbro, Starmie, and Azumarill. Facade is an option over Seed Bomb that provides better overall neutral coverage but makes Mismagius a counter and loses an OHKO on Crawdaunt. The given Speed investment allows Breloom to outspeed Adamant Crawdaunt and KO it with Seed Bomb, while the bulk investment lets Breloom's Substitute tank Gliscor's U-turn without breaking.</p> <p>SubPunch Breloom appreciates pivot support from Scizor, Gliscor, and Rotom-W to set up Substitute on foes like defensive Rotom-W and Gliscor. Magnezone is a helpful teammate for trapping and KOing Skarmory and dealing massive damage to Scizor. Heatran pressures Tangrowth and can switch into Clefable. Starmie is another wallbreaker that pairs well with Breloom, as it can pressure many of the Pokemon that Breloom fears such as Gliscor and Tangrowth.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 277988, "username": "dex"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 369076, "username": "Tuthur"}, {"user_id": 241023, "username": "dhelmise"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}]}
  },
  "Crawdaunt": {"sets": {"All-out Attacker": {}, "Choice Band": {}}},
  "Milotic": {"sets": {"Physically Defensive": {}}},
  "Salamence": {"sets": {"Choice Scarf": {}, "Setup Sweeper": {}}},
  "Latias": {
    "overview": "<p>Latias is one of the most versatile Pokemon in the BDSP OU metagame. Latias's amazing Speed and great offensive STAB combination, only resisted by Steel, make its Choice Specs set a premier wallbreaker. Furthermore, Surf and Thunderbolt let it break through would-be checks, making it extremely formidable. Its solid defensive typing, amazing all-around bulk, and plethora of support moves such as Defog, Healing Wish, and Thunder Wave make it a great support Pokemon. Additionally, Calm Mind sets can quickly snowball through weakened teams or punch massive holes with +1 Draco Meteors, utilizing Latias's amazing bulk to consistently find setup opportunities. However, each of Latias's sets has its own issues: the Choice Specs set is quite prediction reliant and needs support to break through certain hard checks, support sets have coverage issues and oftentimes get overwhelmed from having to handle too many foes, and the Calm Mind set lacks immediate power and coverage options. Nonetheless, Latias remains one of the most adept—and flexible—Pokemon in the tier.</p>",
    "comments": "<h3>Other Options</h3> <p>Latias can run a bulkier Calm Mind set utilizing Stored Power and potentially Substitute, which makes it a late-game cleaner. However, this set needing multiple turns to get going makes it reliant on good matchups and lots of support. The Choice Specs set can also run Defog if it is desperately needed; however, the immensely valuable competing options make it generally not worth using. Wish is an interesting option on support variants that can greatly help partners with no or inconsistent recovery, such as Heatran and Rotom-W, although it is hard to justify using it over any of Latias's other options.</p> <h3>Checks and Counters</h3> <p><strong>Steel-types</strong>: Specially defensive Scizor easily pivots into all Latias sets, as even Choice Specs sets require major chip damage to 2HKO Scizor with Surf. Other Steel-types such as Heatran and Jirachi can also pivot into Latias safely, although the former fears variants with Surf, and teammates can easily take advantage of the latter due to its inconsistent or lacking recovery.</p> <p><strong>Blissey</strong>: Calm Mind Blissey stonewalls Latias and heals itself of any damage. However, if lacking Calm Mind, Blissey relies on multiple full paralyses from Thunder Wave to beat Calm Mind variants of Latias.</p> <p><strong>Tyranitar</strong>: Tyranitar can comfortably switch into Latias a few times, although it is prone to being worn down, and it dislikes Surf variants.</p> <p><strong>Revenge Killers</strong>: Pokemon such as Weavile, Choice Scarf Garchomp, Choice Scarf Heracross, and Alakazam can revenge kill Latias, but they are all unable to switch in safely.</p> <p><strong>Fairy-types</strong>: Unaware Clefable checks Calm Mind variants of Latias relatively well; however, Choice Specs variants can easily break through it with minor chip damage. Togekiss can pivot in on Choice-locked Latias's Draco Meteor and force it out, although it is unable to switch into it safely otherwise.</p>",
    "sets": {
      "Calm Mind": {
        "description": "<p>Calm Mind is Latias's most common set, and for good reason. Latias's amazing bulk for an offensive Pokemon, coupled with great STAB moves, makes it hard to stop once it gets going. Draco Meteor alongside Psychic provides near-unresisted coverage, except for Steel. However, Calm Mind can let Latias break through Steel-types if they're thoroughly weakened. Roost provides longevity for Latias, which is integral for making use of Latias's bulk. Dragon Pulse is an option over Draco Meteor for a drawback-free Dragon-type STAB attack at the cost of power.</p> <p>Calm Mind Latias works best on bulky offense and balance teams that can wear down Steel-types such as Heatran, Jirachi, and Scizor so it can cleave through the opposition. Spikes support from the likes of Roserade and Skarmory helps wear down these grounded foes. Gliscor is a useful teammates that checks Steel-types. Heatran itself is a great partner, as it forces out the aforementioned Steel-types, and it can also burn Scizor and Jirachi using U-turn on it, making them much easier to break through with Latias. Magnezone is an excellent partner, being able to trap and remove Scizor, Calm Mind Latias's biggest stop. Weavile works extremely well with it, forcing damage on Scizor and Heatran while luring in Water-types such as Rotom-W and Milotic for Latias to take advantage of.</p>"
      },
      "Choice Specs": {
        "description": "<p>Boasting near-unresisted, powerful STAB moves alongside great other options, Choice Specs Latias is an exceptional wallbreaker. Draco Meteor provides immediate power, and since Choice-locked Latias is unlikely to stay in for long, the Special Attack drop is a minor drawback. Surf is the optimal coverage option, providing the best midground option for Steel-, Fairy-, and Dark-types while nailing Heatran. Healing Wish is the best option for its last moveslot, as it means Latias isn't dead weight even in matchups where it is impossible to wallbreak, providing a second life for its teammates. Thunderbolt gives Latias another coverage move that hits Azumarill, Skarmory, and Togekiss harder while still hitting Steel-types hard. Roost gives Latias a bit more longevity, but locking into it lets foes easily take advantage of Latias.</p> <p>Due to its lack of consistent recovery, Choice Specs Latias pairs extremely well with solid pivots such as Rotom-W, Scizor, and U-turn Gliscor. Fire-types such as Heatran and Infernape pair extremely well with Latias, as they take advantage of the Steel-types it brings in, and they pivot out of Dragon- and Water-types to safely bring Latias in. Infernape, in particular, is an astounding offensive partner, as it gets Latias in safely with U-turn on Pokemon like Slowbro and Gliscor while forcing out Scizor and Blissey. Stealth Rock from Heatran and Garchomp helps Latias break down its checks like Clefable and Scizor, which it repeatedly draws in with its frequent switches. Lastly, other Dragon-types such as Garchomp and Dragonite form a potent Dragon spam core with Latias, overwhelming their shared checks in Steel- and Fairy-types like Scizor, Clefable, and Skarmory.</p>"
      },
      "Defensive": {
        "description": "<p>Latias runs a solid support set by virtue of its solid defensive typing bolstered by Levitate. Latias is a great Defogger thanks to its excellent matchup against most Stealth Rock users and immunity to other enrty hazards. Thunder Wave can be used if Defog isn't needed, and it can cripple common switch-ins such as Scizor, Clefable, and Tyranitar. Healing Wish is an option on more offensive teams that lets Latias preserve momentum while giving a second opportunity for its teammate. Thunderbolt prevents it from being setup fodder to the likes of Azumarill and Togekiss. Surf lets Latias threaten Heatran and deter Tyranitar from switching in. Ice Beam is an option that hits Gliscor while still OHKOing Garchomp. Draco Meteor is a strong STAB option that hits even neutral targets hard and still lets Latias nail Dragon-types, but its Special Attack drop makes Latias pretty passive.</p> <p>Scizor is an amazing partner to defensive Latias, as it deals with Fairy-, Ice-, and Dragon-types such as Clefable, Weavile, and opposing Latias while appreciating Latias's Defog support. Heatran can threaten the aforementioned Fairy-, Ice-, and Dragon-types while also pressuring Steel-types such as Scizor for Latias. In return, Latias takes advantage of the Water- and Ground-types that Heatran draws in. Gliscor is solid to comfortably check Fire-types like Infernape and Heatran alongside Latias, and it appreciates Latias dealing with Grass-types such as Breloom and Celebi for it.</p>"
      },
      "Choice Scarf": {
        "description": "<p>Choice Scarf Latias is a efficient revenge killer on more offensive teams, which appreciate it providing a fast Healing Wish while revenge killing boosted threats like Dragonite and Alakazam. Draco Meteor and Psychic hit almost everything for at least neutral damage, giving the coverage and power for Latias to revenge kill threats such as Choice Scarf Garchomp and boosted Feraligatr. Healing Wish is the main advantage over other revenge killers, giving a teammate the longevity to clean up late-game. Due to Latias having a good matchup against most Stealth Rock setters as well as high Speed, it can provide emergency Defog support. Surf provides a midground option, neutrally hitting Steel-types in particular, alongside Fairy-types. Thunder Wave gives Latias a way to cripple switch-ins such as Scizor, Clefable, and Tyranitar, which can be crucial for its teammates to break through them.</p> <p>Choice Scarf Latias fits best on offensive teams that appreciate its role compression. Setup sweepers such as Lucario, Alakazam, and Garchomp are prime partners alongside Latias, which weakens their checks for them to clean up. Water-types such as Azumarill and Feraligatr work especially well with Latias, as they appreciate it checking Grass- and Water-types like Celebi, Rotom-W, and Breloom, while they pivot into Weavile for Latias.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 529732, "username": "adem"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 487308, "username": "BT89"}, {"user_id": 277988, "username": "dex"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}, {"user_id": 523866, "username": "UT"}]}]}
  },
  "Jirachi": {"sets": {"Utility": {}}},
  "Infernape": {
    "overview": "<p>Infernape is a menacing addition to offensive teams with its solid Speed tier, powerful dual STAB moves, and access to U-turn. Said STAB combination is almost unresisted in the tier and allows Infernape to prey on staples like Scizor, Heatran, Blissey and Magnezone. Infernape is a very good pivot that can pressure checks like Latias and Starmie with U-turn, form a great VoltTurn core with Volt Switch users such as Rotom-W and Magnezone, and bring frailer attackers like Weavile, Nidoking, and Alakazam in safely. Infernape also packs great options like Stealth Rock, Mach Punch for priority against Weavile and Aqua Jet Crawdaunt, Thunder Punch for Water-types like Starmie and Azumarill, and Grass Knot to break through Gastrodon and Quagsire. However, the combination of Infernape’s poor bulk, vulnerability to entry hazards, and drawbacks on its main STAB moves leave it lacking in longevity, often being worn down fairly quickly and unable to switch into non-resisted attacks. Its Speed tier, while solid, leaves it outpaced by key threats like Latias, Starmie, and Alakazam, in addition to being vulnerable to priority users like Extreme Speed Lucario and Aqua Jet Azumarill.</p>",
    "comments": "<h3>Other Options</h3> <p>Infernape can utilize a Choice Scarf set, which trades power in exchange for outpacing all relevant Choice Scarf users bar Latias, crucially outpacing non-Choice Scarf Latias, Alakazam, and Starmie while still dealing significant damage to them with U-turn; this allows it to act as a solid revenge killer versus offensive teams. However, Infernape lacks the raw power to stand out as a Choice Scarf user, leaving it easily walled. Swords Dance Infernape is an option for hyper offense teams thanks to its solid matchup versus Tangrowth as well as its synergy with Water-type sweepers such as Dragon Dance Feraligatr and Belly Drum Azumarill, though it does face competition from the overall stronger Swords Dance Lucario and Garchomp, and its priority option in Mach Punch is rather mediocre for a sweeper given the prominence of Psychic-types. Infernape can run a lead set on hyper offense teams with strong STAB options in Close Combat, Overheat, and a self-sacrificial Flare Blitz, plus options like Taunt and U-turn. However, it is generally outclassed as a Stealth Rock lead by Azelf and Custap Berry Skarmory due to Azelf's greater Speed and Skarmory's access to Spikes and better flexibility thanks to Sturdy + Custap Berry.</p> <h3>Checks and Counters</h3> <p><strong>Ground-types</strong>: Non-mixed Infernape is forced to rely on Flare Blitz to break Gliscor, which quickly wears it down; even Choice Band Flare Blitz can only 2HKO Gliscor if catching it as it switches in. Gliscor, meanwhile, is guaranteed to OHKO Infernape back after just one round of Stealth Rock damage.</p> <p><strong>Fast Psychic-types</strong>: Fast Psychic-types like Starmie and Alakazam can easily revenge kill non-Choice Scarf variants of Infernape, forcing it to rely more on U-turn. This can easily pressure Infernape if entry hazards are up, damaging its already poor longevity. Latias similarly threatens to outpace and KO Infernape while also being able to repeatedly take hits thanks to its resistance to Infernape's STAB combination alongside solid bulk and recovery in Roost.</p> <p><strong>Bulky Water-types</strong>: Slowbro can easily counter Choice Band Infernape without Thunder Punch and mixed Infernape lacking Grass Knot, forcing Infernape to U-turn constantly and threatening its incoming teammate with a Scald burn. Defensive Rotom-W can switch into its Fire STAB moves and force it out, but it gets destroyed by item-boosted Close Combats. Azumarill does not want to switch into Infernape aggressively, as it still takes significant damage from even resisted attacks from the Choice Band variant, but it can scare it out with Aqua Jet or threaten to set up with Belly Drum.</p> <p><strong>Priority users</strong>: Infernape's mediocre bulk means it struggles to deal with priority bar Ice Shard and Bullet Punch, with Extreme Speed and Aqua Jet being particularly good against it. Even threats weak to Infernape, such as Lucario and Breloom, can KO it safely with boosted priority.</p> <p><strong>Dragon-types</strong>: Infernape struggles to break Dragonite without Stone Edge and is often forced to predict it coming in with U-turn to avoid becoming setup fodder. Mixed sets can struggle to break Garchomp, requiring full Attack investment and a boosting item to reliably 2HKO with Close Combat; Garchomp’s Rough Skin also compounds Infernape’s issues with longevity.</p> <p><strong>Chip Damage</strong>: Between Flare Blitz recoil, Life Orb recoil, and repeated switches with entry hazards up, Infernape is highly vulnerable to being worn down quickly, meaning that bulkier teams can cause it to wear itself down with proper prediction. This, in conjunction with mediocre bulk, means that it dislikes switching into even resisted attacks.</p>",
    "sets": {
      "Choice Band": {
        "description": "<p>Choice Band Infernape is notable for its immediate raw power and respectable Speed tier, using its very powerful Flare Blitz and Close Combat to deal massive damage to anything that does not resist its STAB combination; Close Combat deals heavy damage to much of the tier and destroys the likes of Heatran, Rotom-W, and Blissey, while Flare Blitz allows it to tear through bulky Pokemon such as Tangrowth. U-turn lets Infernape pivot out of unfavorable matchups such as Garchomp and Dragonite. Iron Fist-boosted Mach Punch grants Infernape priority, safely dealing with Weavile and Crawdaunt after minimal chip damage, while Thunder Punch can remove Water-types like Slowbro and Azumarill, which resist Infernape’s STAB combination. On the other hand, Blaze pairs nicely with Flare Blitz due to the move's recoil, allowing Infernape to hit harder against trickier enemies such as Gliscor and Clefable.</p> <p>While fast, Infernape is outpaced by key threats like Latias, Starmie, and Alakazam, so it fits best on offensive teams packing fast partners, especially frailer teams that benefit from Choice Band Infernape's ability to scare out walls like Tangrowth, Blissey, and Clefable and create opportunities with U-turn for threats such as Alakazam and Crawdaunt. Offensive Starmie and Weavile are particularly great partners that provide the team with extra speed control and can break bulky Ground types that Infernape can’t safely take on one-on-one like Gliscor, while Infernape deals with Weavile and Scizor. Starmie can also provide Rapid Spin support to alleviate Infernape's weakness to entry hazard damage and improve its longevity. Outside of frailer offense and balanced offense teams, Choice Band Infernape's breaking ability versus Tangrowth and Clefable greatly benefits physically attacking teammates like Azumarill and offensive Garchomp. Of particular note on these teams, Infernape forms a scary VoltTurn core with Rotom-W, as the two are great at wearing down and luring in each other's defensive answers; Slowbro and Gliscor can be forced to switch out if Infernape uses U-turn, while Blissey must carefully consider switching into Rotom-W. This allows the core to place constant pressure on the opponent while also putting the opposing team into range of their offensive teammates, namely the aforementioned frailer threats and priority users like Extreme Speed Dragonite and Ice Shard Mamoswine. Infernape also benefits greatly from hazard support such as Stealth Rock Garchomp or Spikes Skarmory to further boost its wallbreaking ability, with just one round of hazard chip ensuring the KO on Crawdaunt with Mach Punch or Azumarill with Thunder Punch. Finally, Infernape appreciates partners that can take attacks from the tier's Psychic-types like specially defensive Scizor and Blissey.</p>"
      },
      "Mixed Attacker": {
        "description": "<p>Mixed Infernape specializes in breaking apart defensive cores and teams, using its solid Speed tier and ability to beat common Defoggers in Gliscor and Scizor to reliably set Stealth Rock, helping its teammates to break checks more easily and chipping switch-ins like Dragonite while being less prediction reliant. Life Orb-boosted Overheat allows Infernape to bypass defensive Pokemon like physically defensive Gliscor and Unaware Clefable, being the preferred Fire STAB move over Flare Blitz to prevent Infernape from wearing itself down too fast. Close Combat still powers through Blissey and Heatran, while U-turn lets it pivot out of threats it can’t break like Latias. Grass Knot is another solid option to better circumvent threats like Slowbro and Gastrodon on top of its usual advantageous matchups. Infernape can also slot in Mach Punch to pick off faster offensive threats like Weavile and Choice Scarf Rotom-W late-game, as well as prevent Crawdaunt from revenge killing it. Blaze is the preferred ability to further boost Overheat late-game, especially if not running Mach Punch, with Life Orb helping boost its damage output, though Focus Sash is also an option on Stealth Rock variants to guarantee entry hazards get set up. A Naive nature is recommended so Infernape can get the most damage out of its attacks without being left weaker to priority from Breloom and Lucario. All variants of this set will run max Speed, but the exact EVs vary depending on which fourth move is run; the listed spread ensures Infernape can OHKO specially defensive Heatran with Close Combat and usually 2HKO utility Gliscor and Togekiss after Stealth Rock with Overheat, as well as letting Grass Knot maximize damage against its intended targets. Mach Punch variants run 28 Special Attack to keep the 2HKO versus Gliscor and sink the rest into Attack to get maximum damage from Mach Punch.</p> <p>Mixed Infernape is generally best suited for offense teams that appreciate its ability to lure and take out common defensive staples like Gliscor and Slowbro, allowing offensive teammates such as Garchomp and Dragonite to wallbreak more easily. This set's precise approach to breaking also benefits frailer attackers like Weavile and Alakazam and frees up attackers like Rotom-W by eliminating their specific counters such as Gastrodon. Pivoting support from U-turn allows Infernape to safely bring in frailer teammates such as Weavile, Starmie, and Alakazam and form an annoying VoltTurn core with Rotom-W to generate momentum for the team and help weaken shared checks such as Latias. If not running Stealth Rock, mixed Infernape prefers hazard support to help it wallbreak more easily from Pokemon such as Garchomp or Mamoswine, while also appreciating hazard removal like Rapid Spin Starmie or Defog Gliscor to prevent it from getting worn down too quickly.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 520762, "username": "okispokis"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 529732, "username": "adem"}, {"user_id": 277988, "username": "dex"}, {"user_id": 510459, "username": "Xilefi"}]}, {"name": "Grammar checked by", "members": [{"user_id": 571069, "username": "Dead by Daylight"}, {"user_id": 232216, "username": "Lumari"}]}]}
  },
  "Staraptor": {"sets": {"Choice Band": {}, "Choice Scarf": {}}},
  "Roserade": {"sets": {"Spikes": {}}},
  "Gastrodon": {"sets": {"Specially Defensive": {}}},
  "Mismagius": {"sets": {"Setup Sweeper": {}, "Taunt + Will-O-Wisp": {}}},
  "Garchomp": {
    "overview": "<p>Garchomp is a fantastic offensive Pokemon between its massive Attack stat, great Speed tier that lets it outrun much of BDSP OU, powerful STAB combination, and impressive natural bulk, which lets it trade favorably with other offensive Pokemon and find easy setup opportunities with Swords Dance. Coverage moves in Fire Blast and Stone Edge bolster its offensive presence even further, allowing it to crush would-be answers like Skarmory, Tangrowth, and Togekiss. Garchomp even has access to Stealth Rock and a useful ability in Rough Skin, which both make it even more effective at wearing down the opposition for itself and its teammates, providing utility outside of its amazing wallbreaking. All of this combines to make Garchomp a fantastic wallbreaker, potential wincon, and offensive utility Pokemon in one package. However, Garchomp is hindered by common Ice- and Dragon-type moves from Weavile, Mamoswine, and Latias, and its Speed tier, while great, is still beat by prominent offensive threats such as Starmie, Infernape, and Latias. Furthermore, its standard sets can struggle to break through healthy defensive Pokemon such as Slowbro, Clefable, and Togekiss, but these flaws are nowhere near enough to dethrone it as one of the best Pokemon around.</p>",
    "comments": "<h3>Other Options</h3> <p>Garchomp can use both Swords Dance and Stealth Rock at the same time, compressing its wallbreaking and utility capabilities into a single set; however, this comes at the expense of coverage, which limits how threatening it can be in some matchups. A set with Swords Dance, Substitute, and a Salac Berry can potentially break games open by stopping offensive teams from revenge killing Garchomp, sweeping through teams with ease, but it has the same problem of taking up a coverage moveslot. Choice Band Garchomp boasts impressive immediate power, but Life Orb's power boost is usually more than enough for it to wallbreak effectively, and Choice Band requires much more precise play, as Garchomp's STAB moves have common immunities.</p> <h3>Checks and Counters</h3> <p><strong>Faster Pokemon</strong>: Weavile and Starmie both outspeed and threaten to cleanly OHKO Garchomp, but neither can comfortably switch into its attacks. Latias does the same and can potentially switch in on a predicted Earthquake. Mamoswine, while not actually faster, can OHKO Garchomp with a priority Life Orb-boosted Ice Shard. Life Orb Alakazam can KO a weakened Garchomp, and Focus Sash Alakazam can beat Garchomp lacking Dual Chop one-on-one at the expense of its Focus Sash, if needed.</p> <p><strong>Bulky Fairy-type Pokemon</strong>: Physically defensive Clefable can handle Swords Dance Garchomp one-on-one if it switches in safely thanks to Unaware, and it totally walls Choice Scarf Garchomp while healthy—however, it must be used carefully, as Life Orb-boosted Earthquake will 2HKO it after Stealth Rock damage. Togekiss entirely walls standard Garchomp sets, but it must be wary of Stone Edge. Both can also guarantee the removal of a Garchomp that is locked into using Outrage.</p> <p><strong>Bulky Water-type Pokemon</strong>: A healthy Slowbro can survive a boosted Earthquake from Swords Dance Garchomp and OHKO it back with Ice Beam after minimal prior damage, although this will fail against Yache Berry sets. Rotom-W can punish Choice Scarf Garchomp for using Earthquake; defensive Rotom-W sets also force Swords Dance Garchomp to lock into Outrage, and Choice Scarf Rotom-W hinders it with a burn or Trick. However, Rotom-W can't consistently switch into Garchomp's Dragon-type moves and is easily worn down, making it an inconsistent check. Milotic can handle Choice Scarf Garchomp quite well, but it can't stand up to Swords Dance or Life Orb variants. A healthy Azumarill or Feraligatr can usually tank a hit from an unboosted Garchomp and OHKO it back in a pinch.</p> <p><strong>Physically Bulky Pokemon</strong>: Tangrowth and Skarmory easily take either of Garchomp's STAB attacks, and the former can put it to sleep in a pinch, while the latter can phaze Garchomp with Whirlwind. However, they both falter against Fire Blast sets and are inconsistent checks, as the former relies on Sleep Clause not being activated, while the latter can easily get worn down by repeated boosted Outrages or Stone Edges.</p>",
    "sets": {
      "Mixed Stealth Rock": {
        "description": "<p>Garchomp is a very efficient Stealth Rock user with a mixed attacking set, consistently setting Stealth Rock on the tier's best Defog users like Gliscor and Scizor while luring in and KOing possible checks, like Slowbro, Tangrowth, and Skarmory. Draco Meteor lets Garchomp dent physical walls, such as the aforementioned Slowbro and Rotom-W, while providing a Dragon-type STAB move that can't be punished as easily as Outrage. Fire Blast deals with Tangrowth and Skarmory, preventing them from taking advantage of Garchomp. Lastly, Earthquake lets it still effectively check Heatran and Infernape. A Hasty nature can be run over Naive to check Heatran better, but it makes Infernape slightly harder to deal with. Life Orb lets Garchomp 2HKO would-be checks like Gliscor, Rotom-W, and Celebi, while Yache Berry allows Garchomp to survive hits like Starmie's Ice Beam and Mamoswine's Ice Shard in a pinch, KOing them back.</p> <p>Garchomp fits best on bulky offense and offense teams that appreciate its short-term defensive capabilities and consistent Stealth Rock setting. Physical wallbreakers like Infernape, Breloom, and Weavile are potent partners alongside Garchomp, as they can take advantage of Garchomp luring in and potentially removing physical walls like Slowbro, Tangrowth, and Skarmory. Roserade is an excellent partner to set Spikes, forming a formidable entry hazard-stacking core with Garchomp. Steel-types such as Scizor and Heatran can deal with Ice- and Dragon-types such as Weavile and Latias that force out Garchomp. Garchomp in return takes Fire-type attacks from the likes of Heatran and Infernape directed at them.</p>"
      },
      "Mixed Swords Dance": {
        "description": "<p>Swords Dance turns Garchomp into an effective wallbreaker and wincon versus slower teams, utilizing Fire Blast to nail would-be checks to a solely physical set. Fire Blast complements Garchomp's dual STAB moves nicely, as it deals massive damage to all of Scizor, Tangrowth, Skarmory, and Breloom. Stone Edge is an alternative option that specifically targets Togekiss, which otherwise walls this set. Life Orb is this set's primary item, as it provides vital extra power versus the aforementioned Fire Blast victims and importantly allows Garchomp to 2HKO physically defensive Unaware Clefable switching in. Yache Berry has merit for Garchomp to survive Mamoswine's Ice Shard, Starmie's Ice Beam, and other Ice-type moves from various defensive Pokemon such as Slowbro and Milotic, 2HKOing them in return with a boosted Earthquake.</p> <p>Garchomp usually functions best on offensive teams as a potent wallbreaker or expected wincon. Latias makes for a potent offensive pairing with Garchomp, as it threatens the physically bulky Pokemon that Garchomp struggles with, and Garchomp can threaten the likes of Scizor, Heatran, and Jirachi in return. Furthermore, they also form a potent Dragon-type offensive core that can overwhelm their shared checks, with Latias also valuing Yache Berry sets removing Weavile and Mamoswine for it. Weavile and Breloom are also excellent partners, as they greatly appreciate Garchomp luring in and potentially removing Skarmory and Tangrowth for them. Swords Dance Scizor and Azumarill easily clean up the opposing team after Garchomp has punched holes in it.</p>"
      },
      "Choice Scarf": {
        "description": "<p>Choice Scarf Garchomp is an effective late-game cleaner and revenge killer thanks to its impressive raw power and coverage as well as its above-average base Speed to outspeed a lot of other Choice Scarf users. Fire Blast threatens potential switch-ins such as Tangrowth and Skarmory, which would otherwise stonewall it. Dual Chop allows Garchomp to bypass Alakazam's Focus Sash for a clean OHKO and break through Dragonite's Multiscale, as well as providing a Dragon-type attack that doesn't lock Garchomp in, while Stone Edge deals with Togekiss, which is a complete stop to this set otherwise. A Naughty nature is generally preferred to not weaken Fire Blast, notably securing the 2HKO on Tangrowth after Regenerator, but an Adamant nature can be used if the extra power from Fire Blast isn't needed. Garchomp does not use a Speed-increasing nature, as it wouldn't outspeed any new relevant Pokemon.</p> <p>Choice Scarf Garchomp fits best on offensive teams with strong wallbreakers, such as Weavile, Infernape, and Belly Drum Azumarill, that can punch holes in the opposing team for it to easily clean up late-game. Other offensive Dragon-types such as Latias, Dragonite, and Salamence make solid teammates, as they wear down shared checks such as Clefable, Scizor, and Skarmory. Magnezone is an exceptional partner, as it removes Steel-types such as Scizor and Skarmory, which prevent Garchomp from spamming its STAB moves. Furthermore, solid Steel-types such as Heatran and Scizor can pivot into the Ice- and Fairy-types that can force out Garchomp.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 375272, "username": "Eve"}, {"user_id": 529732, "username": "adem"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 409438, "username": "Savouras"}, {"user_id": 279858, "username": "Lalaya"}, {"user_id": 369076, "username": "Tuthur"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}]}
  },
  "Lucario": {
    "overview": "<p>Lucario is an impressively powerful sweeper on hyper offense teams. Close Combat is enough to let it outright destroy common physically defensive walls like Skarmory and Tangrowth at +2 alongside entry hazard support, and access to Extreme Speed and STAB Meteor Mash let it handle Pokemon that commonly cause hyper offense teams to struggle like Latias, Alakazam, and Unaware Clefable. However, Lucario relies heavily on Stealth Rock and Spikes support to bring foes like Latias, Infernape, and Skarmory into range of its boosted attacks. Furthermore, Lucario's frailty, compounded with Life Orb recoil, puts it on a timer when it tries to sweep, especially if it has to eat a hit in order to set up. Lucario's Speed tier also does it no favors, often forcing it to rely on Extreme Speed. Finally, Lucario struggles to deal with the omnipresent Gliscor, which can switch into it and OHKO it with Earthquake.</p>",
    "comments": "<h3>Other Options</h3> <p>Lucario has no viable move alternatives. A Choice Band set replacing Swords Dance with Crunch can be utilized but is ultimately less effective.</p> <h3>Checks and Counters</h3> <p><strong>Physically Bulky Pokemon</strong>: Gliscor, Latias, and Slowbro can switch into unboosted Lucario and force it out with Earthquake, Psychic, and Flamethrower or Scald. Slowbro is particularly good at this, as its typing, massive physical bulk, and access to Regenerator mean that Lucario will almost never break through it. Stall teams without Gliscor can rely on Quagsire to revenge kill Lucario; however, it is 2HKOed by Close Combat on the switch.</p> <p><strong>Revenge Killers</strong>: If entry hazards are kept off the field, strong wallbreakers like Latias, Dragonite, and Focus Sash Breloom can effectively revenge kill Lucario. Focus Sash Alakazam is a particularly notable foe, as it can keep its Focus Sash intact with Magic Guard, making it quite consistent at revenge killing Lucario. Garchomp is able to comfortably survive a +2 Extreme Speed and KO back with Earthquake.</p> <p><strong>Offensive Pressure</strong>: Lucario relies on boosting and its Life Orb to meaningfully pressure faster threats; accordingly, hitting Lucario as it sets up reduces its effectiveness, as Life Orb recoil puts a timer on its sweep. Without a Swords Dance boost, Lucario cannot meaningfully threaten faster Pokemon like Latias and Infernape, so make sure to never let it set up for free.</p> <p><strong>Entry Hazard Removal</strong>: Lucario relies immensely on Stealth Rock and Spikes from Skarmory to OHKO Pokemon like Latias, Skarmory, and Tangrowth. Removing these entry hazards leaves Lucario easily revenge killed by the aforementioned threats if they are kept healthy.</p>",
    "sets": {
      "Swords Dance": {
        "description": "<p>Swords Dance lets Lucario break through a number of defensive threats with its Life Orb-boosted Close Combat. Close Combat absolutely destroys bulky Pokemon like Rotom-W and Skarmory, OHKOing both after Stealth Rock. Meteor Mash separates Lucario from other setup sweepers, as it is uniquely capable of hitting Unaware Clefable super effectively. Meteor Mash is also incredibly useful for picking off weakened Gliscor while potentially giving Lucario the boost it needs to sweep. After a Swords Dance boost, Extreme Speed easily OHKOes faster Pokemon that would normally force Lucario out, notably OHKOing Infernape and Latias after Stealth Rock. An Adamant nature is near-required to OHKO Latias with Extreme Speed at +2 after Stealth Rock; however, a Jolly nature can be used if outspeeding Timid Rotom-W is necessary. Justified lets Lucario come in on a predicted Knock Off from Tangrowth or Throat Chop from Weavile to get an Attack boost, which all but ensures its sweep.</p> <p>Lucario fits best on hyper offense teams that can break holes for it to potentially sweep late-game. Lead Skarmory is an excellent partner, as Lucario needs Stealth Rock on the field to guarantee an OHKO on Latias, Infernape, and Starmie with +2 Extreme Speed. The Spikes Skarmory provides is also beneficial, chipping Pokemon like Garchomp and Tangrowth into range of its boosted attacks. Lucario should be paired with wallbreakers that can soften up the enemy team for it to an eventually sweep like Breloom, Dragonite, Feraligatr, and Alakazam. Breloom is particularly good, as it can give Lucario a free setup opportunity with Spore, while Alakazam notably forces Latias out. Azelf is an interesting teammate option that can keep opposing entry hazards off the field with its fast Taunt and weaken foes like Gliscor and Latias with Psychic and U-turn, respectively. Azelf can also run a lead set to support Lucario, setting up either Stealth Rock or dual screens, both of which ease Lucario's sweeping attempts. Water-types like Feraligatr, Cloyster, and Azumarill can set up on and force out Gliscor, which is the most common switch-in to Lucario. Lucario greatly appreciates speed control in the form of Sticky Web or paralysis spam, as these playstyles enable Lucario to pick up KOs with Close Combat on normally faster foes that can tank +2 Extreme Speed like Garchomp and Jolly Mamoswine.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 277988, "username": "dex"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 529732, "username": "adem"}, {"user_id": 279858, "username": "Lalaya"}]}, {"name": "Grammar checked by", "members": [{"user_id": 241023, "username": "dhelmise"}]}]}
  },
  "Hippowdon": {"sets": {"Utility": {}}},
  "Weavile": {
    "overview": "<p>Weavile is an excellent revenge killer in BDSP OU. Its amazing Speed tier is one of its biggest advantages, as it is faster than the entire unboosted metagame, allowing it to outspeed the likes of Latias, Alakazam, and Garchomp; this and its access to priority make it a solid late-game cleaner. Its great offensive typing and power also gives it some wallbreaking prowess. All of these assets make it a near unstoppable threat, able to burst through common checks such as Scizor and Heatran with Assurance. However, Weavile's susceptibility to Stealth Rock and frailty mean it requires solid entry hazard removal and slow pivoting to bring it in safely in order for it to wallbreak. Its frailty also makes it prone to strong priority from Infernape, Breloom, and Lucario, rendering its high Speed useless. Furthermore, it can still get walled by Pokemon like physically defensive Scizor, Skarmory, and Poliwrath, although the former is uncommon and the latter two are rarely seen outside of stall.</p>",
    "comments": "<h3>Other Options</h3> <p>A set utilizing Swords Dance alongside Never-Melt Ice or a Life Orb can also be used in order to clean in late-game scenarios more easily, although its lack of longevity with a Life Orb, alongside its difficulty in setting up, make it a suboptimal choice outside of certain hyper offense structures. Brick Break or Focus Punch can be run to nail Heatran and Lucario without requiring Stealth Rock chip damage; however, the former option is extremely weak and doesn't do enough to Heatran to justify using it, and the latter is extremely inconsistent and prediction reliant.</p> <h3>Checks and Counters</h3> <p><strong>Steel-types</strong>: Steel-type Pokemon such as Scizor and Heatran can pivot into and force out Weavile, as they resist its Ice-type STAB moves and don't take too much from Throat Chop; the former is able to heal off any damage it takes with Roost, while the latter threatens Weavile with a Flame Body burn. However, they both quickly falter to Assurance after taking entry hazard damage and Beat Up. Skarmory outright walls Weavile, as it takes negligible damage from all of Weavile's attacks and can heal with Roost.</p> <p><strong>Fairy-types</strong>: Fairy-types such as Azumarill and physically defensive Clefable can comfortable switch into Weavile's Dark-type STAB move and either resist or can heal off its Icicle Crash. However, the former is easily worn down due to its lack of recovery, and the latter barely lives 2 Icicle Crashes and doesn't even OHKO Weavile, making both fairly shaky checks. Furthermore, both fear a stray Poison Jab.</p> <p><strong>Fighting-types</strong>: Both Infernape and Lucario can switch into Weavile a few times and force it out with their STAB moves due to their typings; however, their mediocre bulk and lack of recovery make them far from consistent. Breloom is unable to safely switch into Weavile due to it fearing Weavile's Ice-type STAB moves; however, it forces Weavile out with Mach Punch.</p> <p><strong>Priority</strong>: Priority moves such as Infernape and Breloom's Mach Punch, Scizor's Bullet Punch, Crawdaunt's Aqua Jet, and Lucario and Dragonite and Lucario's Extreme Speed are extremely threatening to Weavile, as they take advantage of its poor physical bulk while ignoring its high Speed. Infernape, Breloom, and Scizor easily OHKO Weavile without any prior damage; however, the rest require minor chip damage, such as Stealth Rock, to KO it.</p>",
    "sets": {
      "Choice Band": {
        "description": "<p>Throat Chop is Weavile's strongest Dark-type STAB option, as well as its most spammable move, taking advantage of the tier's lack of formidable Dark-resistant Pokemon. Icicle Crash deals with the few Pokemon that can switch into Weavile's Throat Chop, such as Togekiss and Clefable, as well as allowing Weavile to consistently force out the likes of Gliscor and Garchomp. Ice Shard lets it revenge kill faster boosted Pokemon and Choice Scarf users such as +1 Dragonite, Garchomp, and Latias. Assurance is Weavile's best option for its last moveslot, as it can KO Scizor and Heatran after Stealth Rock as well as heavily dent Skarmory. Poison Jab is another option that lets Weavile chunk Fairy-types such as Azumarill and Clefable much harder, although it doesn't have much use outside of that. Beat Up can also be run on more offensive teams; this works extremely well with teammates that have high Attack stats, providing Weavile with an extremely powerful STAB option that lets it break past would-be checks such as Skarmory and Heatran with ease and kill Focus Sash Alakazam.</p> <p>Weavile works best on bulky offense teams that can provide it with sufficient pivot support and entry hazard removal to enable it to wallbreak successfully. Pokemon like Rotom-W, Scizor, and Gliscor that can easily bring Weavile in safely via slow pivoting are solid partners. Solid entry hazard removal such as Rapid Spin from Starmie and Defog from Scizor and Gliscor are amazing alongside Weavile, as they vastly improve its longevity. A strong defensive backbone formed from Pokemon such as Latias, Slowbro, and Tangrowth is helpful to absorb the strong priority moves directed at Weavile such as Mach Punch and Extreme Speed. Magnezone, specifically, is a stellar partner, as it removes Steel-types such as Scizor and Skarmory, making Weavile much harder to deal with defensively. Other physical attackers such as Garchomp and Breloom work well with Weavile, as they can overwhelm their shared checks together.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 529732, "username": "adem"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 279858, "username": "Lalaya"}, {"user_id": 241023, "username": "dhelmise"}]}, {"name": "Grammar checked by", "members": [{"user_id": 277988, "username": "dex"}]}]}
  },
  "Magnezone": {
    "overview": "<p>Magnezone's powerful ability Magnet Pull lets it eliminate or heavily chip defensive Steel-types in Skarmory and Scizor, which many teams rely on to check some of the tier's most powerful offensive Pokemon like Latias and Weavile. It is an incredibly strong attacker in its own right, firing off powerful Flash Cannons and Thunderbolts that pressure most of the tier. However, Ground-types can switch into Thunderbolt and Volt Switch, sapping all of of Magnezone's momentum. Magnezone's reliance on Choice Specs means that, once it has successfully trapped and KOed its Steel-type target, it is forced to switch out or be sacrificed, often costing the team momentum. This is exacerbated by Volt Switch failing to pressure specially defensive Scizor, one of Magnezone's main targets. Magnezone's low Speed leaves it forced out by many of the tier's numerous offensive Pokemon, and it is unable to trap some Steel-types like Jirachi and invested Heatran effectively due to their bulk. Additionally, both Scizor and Skarmory can run a Shed Shell to render Magnezone's niche null and void.</p>",
    "comments": "<h3>Other Options</h3> <p>If trapping opposing Steel-types is not needed, Magnezone can drop Magnet Pull for Analytic to become an even more fearsome special wallbreaker. However, there are many other special wallbreakers, namely Latias, Alakazam, Starmie, and even Azelf, that offer more utility, a better Speed tier, and better coverage, making this option niche at best.</p> <h3>Checks and Counters</h3> <p><strong>Shed Shell</strong>: Both Scizor and Skarmory can run Shed Shell to negate Magnet Pull, rendering Magnezone's niche null and void. However, Shed Shell can be removed by Knock Off from teammates.</p> <p><strong>Ground-types</strong>: Gliscor, Garchomp, Mamoswine, and Donphan can revenge kill Magnezone if it is locked into an Electric-type move and block Volt Switch; however, they loathe switching into Flash Cannon. Gastrodon, on the other hand, is a particularly good Magnezone check, as it can easily switch into all of Magnezone's moves due to its typing and special bulk.</p> <p><strong>Blissey</strong>: Blissey can switch into Magnezone and effectively force it out with Seismic Toss. However, switching into repeated Volt Switches will leave Blissey unable to check other special attackers.</p> <p><strong>Revenge Killers</strong>: Many offensive Pokemon outspeed Magnezone and force it out. Latias resists Thunderbolt and Volt switch and can hit Magnezone with a powerful Surf. Infernape resists Flash Cannon and forces Magnezone out with Close Combat and Flare Blitz. Breloom resists Thunderbolt and Volt Switch and can use Magnezone to set up or fire off a Spore. Lucario forces Magnezone out with Close Combat and can set up if it's locked into Flash Cannon. Dragonite OHKOes Magnezone with Earthquake and heavily pressures it with Fire Punch. None of these Pokemon appreciate switching into Magnezone's powerful attacks, however.</p>",
    "sets": {
      "Choice Specs": {
        "description": "<p>Magnezone's game plan is fairly straightforward: trap a Steel-type and either KO or heavily damage it with Thunderbolt. Volt Switch is useful for keeping momentum while KOing targets if Skarmory's Sturdy is broken or if Scizor has been chipped into its range as well as for pivoting on specially bulky Pokemon like Latias and Blissey. Flash Cannon hits incoming Ground-types like Gliscor and Garchomp that attempt to block Magnezone's Volt Switch. Tri Attack is a generally good middle-ground move to hit Ground-types and Water-types without the need to predict, as well as for hitting Electric-types like Rotom-C and Raikou neutrally. Explosion is instead useful for generating momentum on offensive teams once Magnezone is no longer needed, heavily damaging a foe and getting in a teammate for free. Discharge is an option to fish for a paralysis on specially defensive Heatran and Latias. A Timid nature is preferred so that Magnezone outspeeds offensive Adamant Scizor and defensive Rotom-W; however, a Modest nature can be used to KO Scizor with less chip damage.</p> <p>Many Pokemon appreciate Magnezone eliminating Steel-type foes like Skarmory and Scizor. Latias is perhaps its best partner, as many teams rely on Scizor to check Latias. Physical wallbreakers like Dragonite, Garchomp, Azumarill, and Weavile, which need Skarmory out of the picture to effectively function, make for excellent choices as well. Azumarill and Weavile can also take advantage of the Ground-types like Donphan and Gliscor Magnezone invites in, while Dragonite and Garchomp appreciate Magnezone threatening Clefable, Togekiss, and Rotom-W. Knock Off users like Donphan, Gliscor, and Tangrowth can bait in Scizor and Skarmory and remove a potential Shed Shell from them, ensuring that Magnezone can successfully trap them; they also are good defensive answers to Ground-types like Garchomp and Gliscor, which force Magnezone out once it has trapped something. Stealth Rock from Gliscor and Clefable ensures that Sturdy won't let Skarmory set an entry hazard on Magnezone before falling. Magnezone works well with U-turn users that bait in Skarmory and Scizor like Gliscor and Scizor.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 277988, "username": "dex"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 529732, "username": "adem"}, {"user_id": 369076, "username": "Tuthur"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}]}
  },
  "Tangrowth": {
    "overview": "<p>Tangrowth's Grass typing and physical bulk allow it to counter several dangerous Water-types such as Feraligatr, Crawdaunt, and Rotom-W as well as the dangerous Breloom. Regenerator and Giga Drain keep Tangrowth healthy while it uses utility moves like Knock Off and Sleep Powder to deter the opponent from pivoting around it. Due to its bad special bulk, Tangrowth is very vulnerable to strong special attacks and chip damage, which is why it competes with Poliwrath, which spreads Scald burns, racks up entry hazard damage with Circle Throw, counters Weavile and Mixed Crawdaunt, and checks Infernape. It also faces competition from fellow Grass-type Shaymin, which offers higher speed, letting it check Pokemon like Belly Drum Azumarill, higher special bulk, letting it shrug off Crawdaunt's Sludge Bomb, and Aromatherapy while staying healthy with Rest and Natural Cure. Despite this, Tangrowth manages to set itself apart thanks to its superior movepool and higher physical bulk, earning itself a solid role on balance.</p>",
    "comments": "<h3>Other Options</h3> <p>Tangrowth sports a myriad of moves that it can experiment with over standard ones; for example, Power Whip can be used over Giga Drain thanks to its higher Base Power, though it lacks the accuracy and healing of Giga Drain. Brick Break can be run to lure in and OHKO Weavile; however, it is generally inferior to Earthquake outside of this matchup. Stun Spore can be run over Sleep Powder to spread paralysis; however, Sleep Powder is generally more impactful. Leech Seed can be used to further punish switch-ins and help Tangrowth stay healthy, but it sacrifices coverage in doing so.</p> <h3>Checks and Counters</h3> <p><strong>Strong Special Attacks</strong>: Tangrowth's low Special Defense makes it vulnerable to strong special attacks from Pokemon like Alakazam and Latias. Furthermore, physical attackers like Garchomp and Crawdaunt can run special coverage for it.</p> <p><strong>Flying-Type Pokemon and Coverage</strong>: Staraptor, Brave Bird Skarmory, Air Slash Shaymin, and Togekiss all exert pressure on Tangrowth, forcing it to switch out. This gives them opportunities to fire off strong attacks or set up on the forced switch.</p> <p><strong>Ice-Type Pokemon and Coverage</strong>: Weavile and Mamoswine deal a lot of damage to Tangrowth with Icicle Crash and Freeze-Dry, respectively, forcing it out, and exploiting the opportunity to fire off a strong attack. Starmie's Ice Beam renders Tangrowth unable to check it, as it deals too much damage to it. Blissey can abuse Tangrowth's passivity and lack of a physical move to set up with Calm Mind or pressure it with Ice Beam.</p> <p><strong>Fire-Types</strong>: Infernape's Overheat and Choice Band Flare Blitz and Heatran's Fire-type moves threaten to OHKO Tangrowth, forcing it out. However, neither want to switch into it, as it threatens them with Knock Off and Earthquake.</p>",
    "sets": {
      "Physically Defensive": {
        "description": "<p>Knock Off allows Tangrowth to hit dangerous special attackers and cripple them by getting rid of Heatran and Latias's items while OHKOing Alakazam outright. Earthquake expands on Tangrowth's coverage, allowing it to hit Magnezone, Heatran, and Jirachi, while Sleep Powder allows it to put its switch-ins out of commission, further discouraging the opponent from pivoting around it. Sludge Bomb allows Tangrowth to check opposing Grass-types like Breloom, Shaymin, and Rotom-C, this is particularly important against Breloom, as Tangrowth is immune to Spore. It also allows Tangrowth to spread poison around to rack up incremental damage. Tangrowth's lack of an item makes it an excellent Knock Off absorber; it is forced to not run an item because it otherwise can't take a Swords Dance boosted Knock Off from Life Orb Crawdaunt.</p> <p>Tangrowth generally pairs up with fellow defensive Pokemon that patch its weaknesses. Blissey checks Latias and other special attackers. Gliscor provides a very good Heatran and Magnezone check while also defogging for Tangrowth, while Tangrowth makes up for Gliscor's weakness to Water-types like Azumarill, Feraligatr, and Rotom-W. Clefable provides an excellent Weavile check and can lure in Swords Dance Scizor and KO it with Flamethrower, as Tangrowth tends to struggle with it. Rotom-W checks Heatran, Mamoswine, Weavile, and Swords Dance Scizor while pivoting Tangrowth in with Volt Switch. Starmie spins entry hazards away, allowing Tangrowth to stay healthy in the face of the powerful physical attackers it needs to check. Tangrowth also pairs very well with fellow Regenerator Pokemon Slowbro, making a Regenerator corethat covers each other's weaknesses thanks to the type synergy; for example, Slowbro checks Infernape, while Tangrowth checks Crawdaunt and Feraligatr.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 553481, "username": "H momento"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 277988, "username": "dex"}, {"user_id": 369076, "username": "Tuthur"}]}, {"name": "Grammar checked by", "members": [{"user_id": 277988, "username": "dex"}]}]}
  },
  "Togekiss": {"sets": {"Nasty Plot": {"description": "<p>180 Speed EVs allow Togekiss to outspeed Adamant Breloom and Timid Magnezone. A more offensive spread of 80 HP / 252 SpA / 176 Spe with a Timid nature that outspeeds Jolly Breloom can also be used.</p>"}, "Choice Scarf": {}}},
  "Gliscor": {"sets": {"Utility": {}, "Swords Dance": {}}},
  "Mamoswine": {
    "overview": "<p>Mamoswine is a great wallbreaker in BDSP OU due to its excellent STAB combination and an insane Attack stat that makes it nearly unwallable. It makes great use of Life Orb, as its huge Attack stat and unique Ice-type priority move in Ice Shard allow it to finish off Dragon-types and can also be useful for chipping down neutral targets into KO range for other attacks. It can also make use of Substitute to ease prediction, with the drawback of less damage output. Unfortunately, while Mamoswine's typing is advantageous offensively, it's lacking defensively with no defensive utility outside of Thick Fat and an Electric immunity. Mamoswine is unable to capitalize off of this, as it can't consistently come in on Volt Switch from common Electric-types such as Rotom-W, while fellow Ground-type wallbreaker Garchomp can. Mamoswine's STAB moves, while good, can easily be played around. Combined with a mediocre Speed stat, this makes Mamoswine very prediction-reliant without Substitute compared to other, more reliable wallbreakers such as Crawdaunt, Azumarill, Infernape, Garchomp, and Breloom. Mamoswine's weaknesses also leave it vulnerable to common priority such as Aqua Jet, Mach Punch, and Bullet Punch from Crawdaunt, Azumarill, Infernape, and Scizor. Mamoswine also has great competition in the form of Garchomp, as the latter is often used over Mamoswine because of its higher consistency and better defenses. However, although Mamoswine possesses a great deal of weaknesses, its strength more than makes up for the effort needed, as Mamoswine's STAB combination makes switching into it effectively very tough, as most switch-ins get 2HKOed.</p>",
    "comments": "<h3>Other Options</h3> <p>Mamoswine is capable of becoming a Stealth Rock lead that can counter some of the lead metagame with Focus Sash and Oblivious; however, it's usually better to run the wallbreaker set, as it offers more power and can still be used as a Stealth Rock setter. Mamoswine can use Choice Band, as it's very powerful. However, it's often dismissed in favour of Life Orb, as they have similar damage output. Mamoswine can also use Choice Scarf to get rid of its speed issue; however, not getting to switch up Mamoswine's moves isn't ideal, and not getting a big damage boost makes it inferior to Choice Band, which is already unviable. Mamoswine can switch Freeze-Dry for Icicle Spear to OHKO Dragonite, even with Multiscale intact, as well as SubPunch Breloom; however, its inconsistency makes it less useful than Icicle Crash.</p> <h3>Checks and Counters</h3> <p><strong>Rotom-W</strong>: Rotom-W is one of the only counters to Mamoswine. It doesn't get affected by Earthquake and Icicle Crash bounces right off it, while it can OHKO Mamoswine back with Hydro Pump and even burn Mamoswine with Will-O-Wisp if it needs to. However, Rotom-W must be wary of switching in on Freeze-Dry, as with Stealth Rock chip, it can 2HKO Rotom-W, making it unable to switch in again.</p> <p><strong>Skarmory</strong>: Skarmory is one of the only walls to Mamoswine, as it doesn't take too much damage from Icicle Crash while having reliable recovery in Roost. However, although Icicle Crash doesn't do enough damage to 2HKO Skarmory outright, a deadly flinch chance means that Mamoswine might be able to break through with enough flinches and luck.</p> <p><strong>Bulky Water-types</strong>: Bulky Water-types such as Slowbro, Gastrodon, and Milotic all tank non-Choice Band Mamoswine's hits and can either possibly OHKO or burn Mamoswine. Gastrodon needs to be wary of Freeze-Dry, as it's a 4x super effective move. Slowbro and Milotic can both shrug off Freeze-Dry, however.</p> <p><strong>Faster Pokemon and Priority</strong>: While faster Pokemon like Starmie, Lucario, Alakazam, and Infernape can't switch into Mamoswine's attacks, all of them outspeed Mamoswine and are able to OHKO it. Priority users such as Crawdaunt and Scizor can also 2HKO Mamoswine, with the former being able to OHKO it after Stealth Rock chip.</p> <p><strong>Residual Damage</strong>: As Mamoswine usually runs Life Orb, it will get worn down with entry hazards damage, as Mamoswine will typically switch out a lot of times. Substitute Mamoswine doesn't have this issue, however, as it has Leftovers to heal itself back up.</p>",
    "sets": {
      "Life Orb Attacker": {
        "description": "<p>Earthquake and Icicle Crash are very strong STAB moves that can take care of many slower Pokemon such as Togekiss, Heatran, and Magnezone. Ice Shard is useful for revenge killing Dragon-type threats such as Latias, Garchomp, and Dragonite while also being useful to revenge kill other Ice-weak targets such as Breloom, Gliscor, and Shaymin. Freeze-Dry is useful to deal major damage to Rotom-W on the switch in, usually making it unable to check Mamoswine again alongside Stealth Rock chip, and it is also useful for dealing with Quagsire. Stealth Rock provides good role compression, as Mamoswine can beat common Defoggers such as Gliscor and Latias. Life Orb is the preferred item, as it boosts Mamoswine's wallbreaking potential by a decent amount, although it has the drawback of recoil. Never-Melt Ice is a strong alternative, as it retains the power boost for Ice-type moves but doesn't have the drawback of recoil. Jolly is the preferred nature, as it outspeeds Jolly Feraligatr and Breloom, but an Adamant nature can be used, as Mamoswine still outspeeds threats such as Modest Heatran and bulky Gliscor while boosting priority damage. A Naive nature can be used to strengthen Freeze-Dry without much compromise.</p> <p>Mamoswine fits best on offensive teams, as it is able to guarantee damage on Scizor and Clefable, which can be capitalized on by Pokemon such as Feraligatr, Breloom, and Latias. Mamoswine appreciates pivots that help it get onto the battlefield such as Scizor and Rotom-W. Mamoswine capitalizes on entry hazards; as such, Stealth Rock from Garchomp or Heatran and Spikes from Roserade or Skarmory help it break more easily. Mamoswine appreciates Latias healing it back to full health with Healing Wish, as Life Orb recoil is a big weakness that Mamoswine has to deal with. Grass-types such as Rotom-C and Shaymin can cover for Mamoswine's Water weakness relatively well. Sweepers such as Feraligatr, Azumarill, Lucario, and offensive Scizor also appreciate Freeze-Dry Mamoswine, as it is able to lure in and KO Rotom-W and Slowbro, which are often their greatest counters. Rapid Spin support from Starmie can also help reduce the amount of residual damage Mamoswine takes, and in return, Starmie can force out Skarmory while removing the Spikes it sets up.</p>"
      },
      "Substitute": {
        "description": "<p>Mamoswine being extremely prediction-reliant is ultimately one of its biggest downfalls; however, Mamoswine can circumvent this issue by using Substitute to provide a layer of defense to fall back on, as well as an immunity to status conditions. Ice Shard is useful if a foe survives a hit, as this set lacks power. Icicle Crash and Earthquake are a beautiful offensive pairing, as the majority of the metagame will be 2HKOed. Leftovers is usually the item of choice, as it will help Mamoswine heal off Substitute's recoil, but Never-Melt Ice is also useful if it needs the extra firepower. Adamant is Mamoswine's preferred nature, as it allows it to gain a bit power back from not having Life Orb. However, a Jolly nature is also an option to outspeed Jolly Feraligatr and Breloom.</p> <p>Substitute Mamoswine is best paired with Pokemon that can eliminate its most common counter, Rotom-W. Pokemon such as Breloom, Latias, Tangrowth, and Shaymin can do the job. Additionally, Pokemon that can get rid of entry hazards such as Latias, Gliscor, Scizor, and Starmie make Mamoswine's job a lot easier. Late-game cleaners such as Life Orb Scizor, Choice Band Dragonite, Swords Dance Lucario, and Feraligatr also benefit immensely from Mamoswine's wallbreaking potential. Mamoswine also appreciates Latias healing it back to full HP with Healing Wish.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 571463, "username": "james boter"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 487308, "username": "BT89"}, {"user_id": 277988, "username": "dex"}, {"user_id": 409438, "username": "Savouras"}]}, {"name": "Grammar checked by", "members": [{"user_id": 571069, "username": "Dead by Daylight"}, {"user_id": 384270, "username": "autumn"}]}]}
  },
  "Rotom-Wash": {
    "overview": "<p>Rotom-W is one of the best defensive pivots in the tier due to its access to numerous utility options such as Will-O-Wisp, Thunder Wave, and Volt Switch and its solid defensive stats and typing. Its auspicious typing, combined with Levitate, allows it to check common threats such as Scizor, Weavile, Feraligatr, and Mamoswine. It is easily able to maintain offensive momentum by threatening Ground-types such as Gliscor, Garchomp, and Mamoswine with Will-O-Wisp or Hydro Pump. It can also act as a potent stall breaker with Nasty Plot and Trick combined with Choice Scarf, leaving common stall Pokemon that would otherwise beat like Clefable, Blissey, and Tangrowth exploitable by itself and hard-hitting teammates like Swords Dance Breloom and Swords Dance Garchomp. Choice Scarf Rotom-W is also a great revenge killer, able to OHKO threats like Crawdaunt and Belly Drum Azumarill or, in a pinch, save the day with a burn on Swords Dance sweepers like Garchomp and Lucario. Its great offensive potential and defensive utility make it a staple on bulky offense teams. However, Rotom-W has a poor HP stat, which, when combined with its lack of reliable recovery, leaves it susceptible to being worn down by hazards and status throughout the course of a match. Because of this vulnerability to chip damage, it is unable to consistently check threats like Scizor, Feraligatr, and Mamoswine in the long term. Rotom-W's Speed tier without its Choice Scarf leaves much to be desired, and sets lacking Thunder Wave are walled by Latias.</p>",
    "comments": "<h3>Other Options</h3> <p>Due to Rotom-W's limited offensive movepool, there is very little possible move variation. Reflect can be run on the defensive set to act as a stronger check to Feraligatr, Azumarill, and Mamoswine. More Speed investment can be used on the Leftovers set, letting it outspeed Pokemon like Scizor, Mamoswine, and Nidoking. However, with lower defensive investment, it is a less reliable answer to threats like Feraligatr and Weavile. It also loses its ability to consistently act as a slow pivot. A specially defensive spread can be used to more reliably answer Starmie and Heatran. However, this makes it less able to check physical attackers, namely Feraligatr and Mamoswine.</p> <h3>Checks and Counters</h3> <p><strong>Grass-types</strong>: Rotom-W is unable to do any meaningful damage to Tangrowth outside of burning it. Poison Heal Breloom can use Rotom-W to set up Substitute. However, non-Poison Heal Breloom does not like switching into Will-O-Wisp, and Rotom-W can simply pivot on Breloom with Volt Switch regardless of its set.</p> <p><strong>Dragon-types</strong>: Although it has to exercise caution while switching in, Garchomp can threaten to OHKO Rotom-W with Outrage after some minor chip damage. However, Garchomp dislikes tanking a Hydro Pump and being burnt by Will-O-Wisp.</p> <p><strong>Chip Damage</strong>: Rotom-W's low HP stat and a lack of reliable recovery leave it heavily susceptible to being worn down by hazards. Will-O-Wisp from opposing Rotom-W is also a major threat, as it becomes a far less consistent check to the likes of Scizor, Feraligatr and Mamoswine.</p> <p><strong>Specially Defensive Pokemon</strong>: Gastrodon is one of the best counters to Rotom-W, as it is immune to Volt Switch and does not mind getting burned, and can burn Rotom-W back with Scald. It can even afford to run Sticky Hold to deny Trick from Choice Scarf variants. Blissey takes little from anything Rotom-W can throw at it and can either use it as set up fodder with Calm Mind or wear it down with Seismic Toss. However, Blissey is absolutely crippled by Trick.</p>",
    "sets": {
      "Defensive": {
        "description": "<p>Hydro Pump is used to hit Ground-types like Garchomp, Gliscor, and Mamoswine that attempt to block Volt Switch. Will-O-Wisp lets Rotom-W cripple physical attackers like Azumarill, Feraligatr, and Scizor. Thunder Wave debilitates Pokemon that rely on their high Speed like Weavile and Alakazam, making them easier to revenge kill. Protect can be used to scout Choice item users like Azumarill while also being able to rack up extra Will-O-Wisp damage and gain more recovery from Leftovers. Alternatively, Discharge can be used for a second Electric STAB that has a nasty 30% paralysis rate, and a higher base power that allows it to KO threats like Belly Drum Azumarill. However, it indirectly inhibits Will-O-Wisp, as if Discharge paralyzes a strong physical attacker like Scizor or Tyranitar, it can prove to be a liability. Both Will-O-Wisp and Thunder Wave can be run at the same time to give Rotom-W more flexibility in terms of spreading status, but this is not generally recommended. 8 Speed EVs allow Rotom-W to outspeed Adamant Crawdaunt.</p> <p>This set fits on bulky offense and balance teams where it acts as a slow pivot, safely bringing in strong offensive teammates while checking Heatran, Mamoswine, and Feraligatr. Heatran is a good partner, dealing with Pokemon that check Rotom-W like Tangrowth and Clefable while also providing Stealth Rock support. In return, Heatran appreciates Rotom-W's ability to beat Water- and Ground-types like Slowbro, Mamoswine, and Gliscor. Scizor can check Latias while appreciating Rotom-W checking Heatran and forming a VoltTurn core. Strong offensive Pokemon like Alakazam, Breloom, and Garchomp are able to take advantage of the offensive momentum Rotom-W generates while also appreciating Rotom-W's ability to chip foes, softening them up for the late-game.</p>"
      },
      "Choice Scarf": {
        "description": "<p>Choice Scarf Rotom-W reliably revenge kills Azumarill and Crawdaunt and outspeeds and threatens common threats like Feraligatr and Weavile. Volt Switch allows Rotom-W to gain momentum while bringing in teammates safely. Hydro Pump is effective at thwarting Ground-types that are immune to Volt Switch such as Gliscor, Garchomp, and Mamoswine while also threatening Pokemon such as Tyranitar. Trick cripples passive walls such as Clefable, Tangrowth, and Blissey. It also greatly annoys setup sweepers like Garchomp and Breloom. Will-O-Wisp is an option that lets Rotom-W cripple Garchomp, Scizor, Weavile, and Feraligatr while also threatening Pokemon such as Tangrowth and Tyranitar. Nasty Plot allows Rotom-W to become a potent wallbreaker after it sheds its Choice Scarf due to its good bulk making it difficult to revenge kill and good STAB coverage.</p> <p>Choice Scarf Rotom-W best fits on offense, bulky offense, and balance teams that appreciate its role compression as a Ground-immune offensive pivot and revenge killer that can maintain momentum. Scizor is an excellent teammate since it makes an excellent VoltTurn core with Rotom-W and it checks strong special attackers like Alakazam, which would otherwise overwhelm and force Rotom-W out. Gliscor is another great partner, as it also creates a VoltTurn core with Rotom-W and provides Stealth Rock and Knock Off support to allow Rotom-W to better wear down Blissey. In return, Rotom-W checks Water- and Ice-types like Feraligatr, Azumarill, Weavile, and Mamoswine for Scizor and Gliscor. Heatran is another excellent partner, as it checks Pokemon that can force out Rotom-W, such as Tangrowth and Latias, while also providing Stealth Rock support. In return, Rotom-W is able to come in on Ground-types such as Garchomp and Mamoswine. Entry hazard removal from the likes of Gliscor and Starmie is great for Rotom-W, as it increases Rotom-W's longevity. Since Choice Scarf Rotom-W is unable to consistently check Water-types like Azumarill and Feraligatr, additional checks to them such as Tangrowth and Shaymin are appreciated.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 487308, "username": "BT89"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 279858, "username": "Lalaya"}, {"user_id": 529732, "username": "adem"}]}, {"name": "Grammar checked by", "members": [{"user_id": 277988, "username": "dex"}]}]}
  },
  "Rotom-Mow": {"sets": {"Choice Scarf": {}}},
  "Azelf": {"sets": {"Dual Screens Lead": {}, "Stealth Rock Lead": {}, "Offensive Pivot": {}}},
  "Heatran": {"sets": {"Offensive Stealth Rock": {}, "Defensive Stealth Rock": {}}},
  "Shaymin": {"sets": {"Defensive Utility": {}, "Choice Specs": {}, "SubSeed": {}}}
}