{
  "Clefable": {
    "sets": [
      {
        "name": "Utility",
        "description": "<p>Clefable's Fairy typing, respectable bulk, and immunity to residual damage like Toxic make it a solid choice for either a defensive spinner or a Stealth Rock setter, finding many opportunities to come onto the field and matching up particularly well against common entry hazard setters like Seismitoad, Mudsdale, and Hippowdon as a spinner. Glare spreads paralysis, warding off wallbreakers like Gengar and Melmetal and providing speed control for slower wallbreakers such as Tyranitar and Buzzwole. Alternatively, Clefable's deep movepool allows it to run a vast array of other utility options; Teleport can bring the aforementioned wallbreakers in with ease, for example, matching up better against slower threats like Galarian Slowking and Ferrothorn, which Glare is less effective against. Knock Off is also a good option, removing items such as Leftovers and Heavy-Duty Boots to drastically reduce the longevity of Pokemon like Heatran and Zeraora. Trick in conjunction with Sticky Barb can be used in a similar manner, albeit only one time. Clefable can use both Stealth Rock and Rapid Spin on the same moveset for maximum role compression, although it loses any ability to deter aforementioned switch-ins like Gengar and Heatran in the process. The same holds true of both Aromatherapy and Wish, which are greatly appreciated by offensive tanks like Tornadus-T, Melmetal, and Heatran. VoltTurn cores with Pokemon such as Rotom-W and Aerodactyl greatly appreciate Rapid Spin Clefable only removing opposing hazards, while Spikes setters like Seismitoad can form a hazard-stacking core with Stealth Rock Clefable. Skarmory and Ferrothorn are also very notable hazard setters, as they can handle physical wallbreakers like Choice Band Tyranitar and Aerodactyl that punch through Clefable with ease. Similarly, Clefable struggles to take on strong special attackers like Keldeo and Rotom-H, so specially defensive teammates like Assault Vest Toxapex and Slowking are recommended.</p> "
      },
      {
        "name": "Calm Mind",
        "description": "<p>Calm Mind Clefable takes advantage of passive switch-ins like Corviknight, Gastrodon, and Ferrothorn lacking Grav Apple to accumulate multiple boosts, making itself a capable sweeper that can be difficult to take down. Rapid Spin offers entry hazard removal and bolsters Clefable's Speed stat, notably letting it outpace Choice Band Tyranitar after one boost and positive-natured base 95s like Obstagoon and Kyurem after two. Rapid Spin also invites in many hazard setters Clefable can boost against like Mudsdale and the aforementioned Gastrodon; since it pressured hazard setters, Calm Mind also makes it easier to keep hazards off the field. Glare is used to hinder threats like Fire Lash Cinderace and Nidoking that Clefable may force in after garnering boosts. An additional coverage move such as Flamethrower, Stored Power, or Thunder can be used instead to more immediately pressure Fairy-resistant walls such as Ferrothorn, Corviknight, and non-Assault Vest Toxapex, making Clefable a more independent sweeper but reducing its utility. 12 Speed EVs are used to outpace uninvested Tyranitar. Clefable pairs well with bulky Pokemon like Skarmory and Toxapex that benefit from its offensive presence, and in turn they can set hazards to wear down foes and switch into strong wallbreakers like Choice Band Tyranitar and Urshifu-R, that force Clefable out. Clefable is hard stopped by Toxapex carrying Haze or Clear Smog, and without Flamethrower it can't meaningfully damage offensive Fairy-resistant Pokemon like Melmetal and Excadrill, so teammates that can remove or weaken these threats such as offensive Rotom-H and Rocky Helmet Ferrothorn are greatly appreciated.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 324242, "username": "in the hills"}, {"user_id": 517892, "username": "pannuracotta"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}], "writtenBy": [{"user_id": 407249, "username": "Greybaum"}]}
  },
  "Slowbro": {"sets": [{"name": "Defensive Pivot"}]},
  "Gengar": {
    "sets": [
      {
        "name": "Choice Specs",
        "description": "<p>Gengar is a powerful wallbreaker thanks to its high Special Attack and Speed stats combined with access to strong STAB moves, such as Moongeist Beam, which allows Gengar to 2HKO walls like non-Assault Vest Toxapex and Seismitoad. Sludge Wave hits threatening Fairy- and Grass-types such as Clefable and Rillaboom super effectively. Nasty Plot can be used instead of Sludge Wave to set up on walls crippled through Trick, such as Blissey, since Ghost- and Fighting-type coverage take care of almost all threats. Focus Blast gives Gengar an option to hit Ghost-resistant foes like Tyranitar, Chansey, and Porygon2. Gengar fits well on offensive teams that appreciate its ability to quickly remove threats and hinder opposing walls with Trick. Bulkier Pokemon such as Clefable and Seismitoad particularly enjoy having it knock out Pokemon that they are too passive to remove themselves. Pokemon like Thundurus-T and Rotom-H who are threatened by Tyranitar also benefit from Gengar's ability to 2HKO it. Due to its frailty, Gengar appreciates defensive teammates like Ferrothorn and Buzzwole that can take strong hits from threatening Pokemon like Aerodactyl, Cinderace, and Weavile, as well as pivots such as Corviknight, Toxapex, and Tornadus-T that can safely bring it in.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 517892, "username": "pannuracotta"}, {"user_id": 324242, "username": "in the hills"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 439018, "username": "Theia"}]}
  },
  "Gyarados": {"sets": [{"name": "Dragon Dance"}]},
  "Aerodactyl": {
    "sets": [
      {
        "name": "Choice Band",
        "description": "<p>Aerodactyl is a very threatening wallbreaker with its high-powered STAB attacks in Head Smash and Brave Bird that come with no drawbacks thanks to Rock Head. Accelerock lets Aerodactyl revenge kill faster Pokemon like Zeraora, Choice Scarf users like Latios, Hydreigon, and Rotom-W, as well as faster setup sweepers like Salamence, Gyarados, and Dracozolt. It's also useful in beating other, slower priority users that may try to revenge kill Aerodactyl. Earthquake ensures an OHKO versus Heatran and good damage on Toxapex and Tyranitar. Fire Fang does the most damage versus Ferrothorn, and Toxic whittles down checks like Mudsdale and Seismitoad over time. Many offensive Pokemon, like Zeraora and Cinderace, appreciate the huge amounts of damage Aerodactyl can force onto walls like Ferrothorn and Mudsdale. Delayed moves like Future Sight and Doom Desire from Slowking and Heatran add an extra oomph to its attacks which net it OHKOs easier. Entry hazard support from Ferrothorn and Seismitoad also helps it secure more KOs. Aerodactyl's Stealth Rock weakness makes entry hazard removal like Clefable and Corviknight solid to use alongside it. Knock Off support to remove Rocky Helmet from checks like Mudsdale and Corviknight, as well as pivots that can bring Aerodactyl in safely, like Toxapex and Tornadus-T, can keep it healthy.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 517892, "username": "pannuracotta"}, {"user_id": 324242, "username": "in the hills"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}, {"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 539897, "username": "iapt"}]}
  },
  "Slowking": {"sets": [{"name": "RegenVest"}]},
  "Tyranitar": {"sets": [{"name": "Offensive"}, {"name": "Choice Band"}]},
  "Salamence": {"sets": [{"name": "Dragon Dance"}]},
  "Hippowdon": {"sets": [{"name": "Defensive"}]},
  "Weavile": {"sets": [{"name": "Swords Dance"}, {"name": "Choice Band"}]},
  "Rotom-Heat": {"sets": [{"name": "Defensive Pivot"}]},
  "Rotom-Wash": {"sets": [{"name": "Defensive Pivot"}]},
  "Heatran": {"sets": [{"name": "Offensive"}, {"name": "Defensive"}]},
  "Excadrill": {
    "sets": [
      {
        "name": "Sand Sweeper",
        "description": "<p>Excadrill is one of the most threatening sweepers in STABmons, pressuring many defensive cores and outpacing offensive Pokemon like Zeraora, Cinderace, and Terrakion when sand is active. Earthquake and Thousand Waves are usually interchangeable, with Earthquake having more power but Thousand Waves trapping opponents and generating momentum. Additionally, Thousand Waves is not weakened by Grassy Terrain from Rillaboom. Sunsteel Strike lets Excadrill beat Fairy-types and wear down Ground-resistant Pokemon, and Rapid Spin clears entry hazards. Swords Dance makes Excadrill a powerful sweeper in sand, while Shore Up allows Excadrill to take on a more supportive role with Rapid Spin. A Jolly nature lets Excadrill revenge kill Pokemon like Nidoking and Mamoswine outside of sand, but an Adamant Nature provides Excadrill with a ton of power to let it break walls like Buzzwole after just a bit of prior damage. Leftovers is the preferred item to provide passive recovery and offset chip damage from stray hits and Rocky Helmet. Alternatively, Metal Coat makes Sunsteel Strike even more threatening against walls after chip damage. Tyranitar or Hippowdon are mandatory teammates to provide sand. Excadrill requires partners like Rotom-W, Thundurus-T, and Crawdaunt that can deal with both bulky Water- and Ground-types like Slowbro and Hippowdon and its biggest checks, Corviknight, Celesteela, and Skarmory. Dracozolt helps Excadrill overwhelm Ground-types while beating Steel- and Flying-types, making it a staple on sand teams. Defensive Water-types like Toxapex and Slowbro can also help as pivots into Ground- and Flying-types while generating momentum for Excadrill with Flip Turn and Teleport, respectively.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 324242, "username": "in the hills"}, {"user_id": 464398, "username": "LBDC"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 511624, "username": "Fc"}]}
  },
  "Seismitoad": {
    "sets": [
      {
        "name": "Defensive Pivot",
        "description": "<p>Seismitoad is an incredibly effective pivot thanks to its fantastic bulk which lets it check physical attackers like Zeraora and Tyranitar. Furthermore, its fantastic typing lets it handle the likes of Heatran and Dracozolt, and thanks to Water Absorb, it's also a fantastic check to Water-types like Rotom-W, Keldeo, and Urshifu-R. Seismitoad's excellent defensive profile gives a plethora of opportunities to set up entry hazards, which is why Spikes is preferred over Stealth Rock. However, Stealth Rock is an option if the team already has another Spikes setter. Shore Up allows Seismitoad to stay healthy throughout a game, so that it can check Pokemon like Cinderace and Zeraora long-term. Thousand Waves allows Seismitoad to trap Pokemon such as Toxapex and Tyranitar. Toxic is an alternative to Thousand Waves that punishes switch-ins like Rotom-W, Tornadus-T, and opposing Seismitoad, allowing partners like Heatran, Keldeo, and Aerodactyl to potentially break through them. Rocky Helmet can be used to further spread chip damage onto Pokemon such as Zeraora, Cinderace, and Buzzwole, while Heavy-Duty Boots prevents Seismitoad from being pressured by entry hazards while switching in on wallbreakers. Wallbreakers like Cinderace and Aerodactyl pressure Pokemon that want to switch into Seismitoad's Flip Turn, like Ferrothorn and Tornadus-T. 0 Speed IVs and EVs and a Relaxed nature can be used for a slower Flip Turn, underspeeding Pokemon like Clefable to better bring in wallbreakers like Aerodactyl.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 517892, "username": "pannuracotta"}, {"user_id": 324242, "username": "in the hills"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 528036, "username": "Sulo"}]}
  },
  "Ferrothorn": {
    "sets": [
      {
        "name": "Utility",
        "description": "<p>Ferrothorn's excellent defensive typing, great stat spread, and wide utility movepool make it a premier entry hazard setter in STABmons. Grav Apple is the primary STAB move, offering consistent damage, allowing Ferrothorn to break through defensive Pokemon like Clefable and Sylveon with repeated Defense drops, and breaking Gyarados's Substitute. Anchor Shot can be used to trap foes like Hippowdon and Zeraora, with stat drops from Grav Apple and Strength Sap heavily helping Ferrothorn remove these targets from play. Knock Off is an alternative utility option that can be used to remove Leftovers and Heavy-Duty Boots from the likes of Heatran, Tornadus-T, and Rotom-H, cutting into their longevity and making them more vulnerable to Ferrothorn's hazards. Other viable utility options include Toxic, which further cripples switch-ins like Rotom-H but in return leaves Ferrothorn helpless against Steel-types like Corviknight and the aforementioned Heatran, and Aromatherapy, which is useful on defensive teams that benefit from Ferrothorn taking a cleric role. Ferrothorn fits best on balance teams, with defensive Water-types like Toxapex and Slowking offering fantastic type synergy, soaking up strong Fire- and Fighting-type attacks from Cinderace and Keldeo. Ferrothorn deals with threats like Zeraora and Rillaboom in return. Stealth Rock users like Tyranitar and Clefable form a strong hazard core with Ferrothorn, with the former heavily pressuring Rotom-H and also greatly appreciating the chip damage that Spikes provides, while the latter can reliably remove hazards and handle Fighting-types like Buzzwole, which Ferrothorn has trouble with. Wallbreakers like Thundurus-T, Reuniclus, and Aerodactyl make for good partners, profiting off Ferrothorn's hazards and ability to check faster revenge killers like Weavile and Zeraora.</p> "
      },
      {
        "name": "Cotton Guard",
        "description": "<p>Cotton Guard turns Ferrothorn into a formidable wall, checking many of the tier's strongest setup sweepers including Excadrill, Dracozolt, and Gyarados. It also makes for a solid wincon thanks to Cotton Guard increasing the damage output of Body Press. Spikes synergizes excellently with this strategy, as Ferrothorn can use the threat of boosted Body Press to force out common entry hazard removers like Corviknight and Tornadus-T. Strength Sap allows Ferrothorn to further challenge physical attackers that may otherwise muscle through Cotton Guard boosts. Alternatively, Anchor Shot can be used instead of Spikes, trapping Pokemon like Hippowdon, Clefable, and opposing Ferrothorn that may otherwise exploit an unboosted Ferrothorn to set up hazards. Ferrothorn makes great use of Leftovers's passive recovery, notably using it to avoid a 2HKO from Aerodactyl's Brave Bird. Chople Berry can be run to let Ferrothorn lure in Fighting-types like Urshifu-R, Buzzwole, and Terrakion. Ferrothorn fits best on balance and offense teams that require a blanket check to physical attackers, and their offensive cores can make full use of Spikes chip damage and weaken foes into range of Body Press. VoltTurn Pokemon like Rotom-H and Thundurus-T are therefore great options, as are strong wallbreakers that can remove Heavy-Duty Boots, like Tyranitar and Weavile. Rapid Spin users are also appreciated for removing opposing hazards without removing Ferrothorn's Spikes, with Sylveon and Calm Mind Clefable being two particularly notable examples that also offer a Fighting resistance.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 517892, "username": "pannuracotta"}, {"user_id": 324242, "username": "in the hills"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}], "writtenBy": [{"user_id": 407249, "username": "Greybaum"}]}
  },
  "Tornadus-Therian": {"sets": [{"name": "Offensive Pivot"}, {"name": "RegenVest"}, {"name": "Defog"}]},
  "Thundurus-Therian": {"sets": [{"name": "Offensive"}, {"name": "Stallbreaker"}]},
  "Toxapex": {"sets": [{"name": "Defensive"}]},
  "Buzzwole": {"sets": [{"name": "Offensive"}, {"name": "Choice Scarf"}, {"name": "Defensive"}]},
  "Zeraora": {
    "sets": [
      {
        "name": "Bulk Up",
        "description": "<p>With a blisteringly fast Speed tier and strong Electric typing, Zeraora reliably pressures many offensive and defensive threats alike, generating Bulk Up opportunities on Pokemon such as Urshifu-R, Tornadus-T, Slowbro, and Corviknight. Close Combat is Zeraora's primary coverage move and strongest option for hitting Electric-resistant Pokemon, notably hitting Ferrothorn and Excadrill for super effective damage. Knock Off removes Heavy-Duty Boots from offensive Thundurus-T and physically defensive walls like Seismitoad and Buzzwole, giving Zeraora a better chance of breaking through them. Leftovers is a viable option over Heavy-Duty Boots, allowing Zeraora to gain passive recovery while setting up, but Heavy-Duty Boots is typically preferred, as Zeraora is often forced into a hit-and-run role until the opposing team is sufficiently weakened.</p> <p>Zeraora is best paired with Spikes support, with Skarmory in particular walling Grass- and Ground-types like Tangrowth and Mudsdale that give it trouble. Seismitoad is also excellent for this role, forming a VoltTurn core with Zeraora and benefiting from its ability to pressure Defog users like Corviknight and Tornadus-T. Rillaboom and Buzzwole are also very strong pivots that pair well with Zeraora, pressuring Ground-types like Gastrodon and Seismitoad while luring in Flying-types that Zeraora can accumulate boosts against. Lastly, Victini can be a great partner, with dual screens giving Zeraora an easier time using Bulk Up while Zeraora offers a safety net against fast breakers like Aerodactyl.</p> "
      },
      {
        "name": "Offensive Pivot",
        "description": "<p>Zeraora uses its mixed offenses and uncontested Speed tier to pose as a threatening offensive pivot, forcing out other fast threats like Aerodactyl and Terrakion with its strong physical coverage and utilizing Volt Switch to gain momentum on switch-ins like Rotom-H and Buzzwole. Close Combat and Grass Knot are Zeraora's most reliable coverage moves, doing significant damage to many of the tier's Electric-resistant Pokemon, particularly Ground-types like Excadrill, Seismitoad, and Mudsdale. Its ability to force these opponents out allows Zeraora to use Volt Switch with much more ease. Alternatively, Knock Off can be used to remove longevity increasing items like Heavy-Duty Boots and Leftovers from Pokemon like Thundurus-T and Nidoqueen, respectively, as well as minimizing the residual damage taken from Rocky Helmet users such as Buzzwole and Ferrothorn. Knock Off also synergizes well with Volt Switch, with the moves working in tandem to quickly put foes in range of Zeraora's stronger attacks. Toxic is an alternative option that can hit all of the above targets bar Nidoqueen, but the prevalence of Shore Up among Zeraora's switch-ins makes it difficult to maintain chip damage, resulting in Zeraora being much more reliant on its teammates to make progress.</p> <p>Grass Knot still fails to significantly damage Gastrodon in addition to aforementioned Electric-resistant Pokemon like Rotom-H and Thundurus-T, so wallbreakers like Tyranitar, Kyurem, and Latios are fantastic teammates, with Tyranitar in particular greatly appreciating Zeraora's ability to lure and remove physically defensive Ground-types. Keldeo is another strong example, pressuring the above Pokemon and forming a VoltTurn core with Flip Turn and greatly appreciating Zeraora's ability to pressure Water-types like Slowking and Seismitoad. If using Knock Off, reliable entry hazard setters are vital for weakening switch-ins; Skarmory and Ferrothorn fill this role well and provide an answer to Sand Rush Excadrill, one of the few Pokemon in the tier that can reliably outpace Zeraora, while also switching into Ground-types like the aforementioned Seismitoad. Similarly, Tornadus-T can form an excellent VoltTurn core with Zeraora, weakening shared answers like Rotom-H and maintaining damage on physically defensive walls like Clefable and Seismitoad with Taunt.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 464398, "username": "LBDC"}, {"user_id": 511624, "username": "fc"}]}, {"name": "Grammar checked by", "members": [{"user_id": 226455, "username": "berry"}, {"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 407249, "username": "Greybaum"}]}
  },
  "Cinderace": {
    "sets": [
      {
        "name": "Pivot",
        "description": "<p>Cinderace is an effective wallbreaker and pivot thanks to its access to Fire Lash and a STAB-boosted U-turn via Libero, chipping away at even bulky walls as their Defense gets dropped. High Jump Kick pressures Heatran and does the most damage to Seismitoad and Tyranitar, which can't hit a Fighting-type Cinderace super effectively. Zen Headbutt can deal with Toxapex after a Fire Lash, while Court Change is very useful as a means of entry hazard control, especially against offense teams. Offensive Water-types like Keldeo and Urshifu-R heavily benefit from Cinderace slowly wearing the aforementioned Pokemon down with U-turn and its coverage, allowing them to wallbreak far more effectively. Cinderace can't effectively break Hippowdon, especially if it holds Rocky Helmet, so a strong entry hazard-stacking core with Ferrothorn and Seismitoad is appreciated. Seismitoad can also serve as a slow pivot with Flip Turn to bring Cinderace in more easily. Faster Pokemon like Zeraora and Weavile, Choice Scarf users like Urshifu-R, and Accelerock users like Terrakion and Tyranitar also help Cinderace against faster but frail targets such as Tornadus-T, Aerodactyl, and Alakazam.</p> "
      },
      {
        "name": "Choice Band",
        "description": "<p>Choice Band Cinderace is a powerful force in the metagame, applying heavy pressure to defensive cores with its raw power. Sacred Fire threatens switch-ins with a burn, heavily limiting the natural longevity of walls like Seismitoad. U-turn is good long term for pivoting and dealing small bits of damage, while High Jump Kick and Zen Headbutt hit the entire tier for at least neutral damage. Heatran and Toxapex are the primary targets of those moves, respectively, but both are more risky due to their miss chance and the existence of Ghost-types like Runerigus able to punish the use of High Jump Kick. Choice Band makes Cinderace quite prediction reliant, meaning bulky cores made of Pokemon like Toxapex and Hippowdon can give it some trouble. Future Sight users such as Slowbro and Slowking assist Cinderace greatly, as Pokemon that could switch into Sacred Fire like the aforementioned Toxapex and Hippowdon would then be 2HKOed after taking a Future Sight. Strong wallbreakers like Dragon Energy Latios, Nidoking, and Kyurem can also very easily punch holes in the opposing team after a physically defensive wall like Slowbro is forced to take a U-turn from Cinderace. Without Heavy-Duty Boots, Choice Band Cinderace is very susceptible to opposing entry hazards, especially if a wall like Hippowdon switches in to check it and set them, so entry hazard control from the likes of Corviknight and Clefable also helps greatly.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 324242, "username": "in the hills"}, {"user_id": 464398, "username": "LBDC"}]}, {"name": "Grammar checked by", "members": [{"user_id": 297659, "username": "deetah"}]}], "writtenBy": [{"user_id": 511624, "username": "Fc"}]}
  },
  "Corviknight": {
    "sets": [
      {
        "name": "Defog",
        "description": "<p>Thanks to its high Defense stat and typing, Corviknight serves as a good physical wall and pivot, as well as an entry hazard remover with Defog and good matchups against entry hazard setters like Mudsdale and Clefable. Anchor Shot can be used alongside Pressure to trap opposing Pokemon and quickly drain their PP; it's also vital in pressuring Fairy-types like Clefable and Sylveon. Taunt can also be run alongside Anchor Shot to quicken the removal of Pokemon running setup or status moves. U-turn allows Corviknight to pivot on switch-ins like Rotom-W and Heatran and can bring in strong teammates to keep pressure. It can run a Relaxed nature with minimal Speed to have slower pivots, but this comes at the cost of not being able to outspeed Clefable, Celesteela, and Tyranitar. Alternatively, the combination of Iron Defense and Body Press can be used to leverage Corviknight's high Defense and deal damage to both offensive Pokemon like Tyranitar and Excadrill and opposing walls like Ferrothorn. Defensive Pokemon like Seismitoad appreciate Corviknight's ability to remove entry hazards and keep them from being worn down by chip damage, while offensive Pokemon like Keldeo, Aerodactyl, and Gengar like its ability to switch into physical hits and pivot them safely in. Corviknight's average Special Defense and weakness to common offensive types Electric and Fire means that it appreciates teammates that are able to absorb hits from common threats like Heatran and Zeraora, such as Thundurus-T, Toxapex, Mudsdale, and Seismitoad.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 517892, "username": "pannuracotta"}, {"user_id": 324242, "username": "in the hills"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 439018, "username": "Theia"}]}
  },
  "Dracozolt": {"sets": [{"name": "Dragon Dance"}, {"name": "Substitute"}]},
  "Urshifu-Rapid-Strike": {"sets": [{"name": "Choice Scarf"}, {"name": "No Retreat"}]}
}