{
  "Blastoise": {"sets": [{"name": "Shell Smash Sweeper"}]},
  "Nidoking": {"sets": [{"name": "Wallbreaker"}]},
  "Clefable": {"sets": [{"name": "Utility"}]},
  "Alakazam": {
    "overview": "<p>Alakazam is a premier wallbreaker in BDSP OU, tearing holes through slower teams lacking a hard counter. Alakazam's high Speed tier lets it outspeed other prominent threats such as Latios, Infernape, and Starmie, forcing them out with its superb coverage. Furthermore, Magic Guard gives Alakazam a myriad of benefits, such as preventing it from being worn down by entry hazards, preserving its Focus Sash, and mitigating Life Orb recoil. Furthermore, counterplay to Alakazam differs depending on what item it is running; using a Life Orb denies nearly all defensive counterplay options through its sheer power, while running a Focus Sash prevents Alakazam from being instantly revenge killed, which is often enough for it to break apart more offensive teams. However, Alakazam is not without its flaws, as its physical bulk is extremely poor, causing it to be revenge killed easily and limiting its setup opportunities. Moreover, its reliance on Focus Blast to deal with Dark- and Steel-types means just one miss can ruin it. Additionally, while Alakazam has a strong offensive presence, it rarely ever threatens to OHKO foes without a boost, meaning if Focus Sash has been broken or it is known to be using a Life Orb, multiple Pokemon can just tank a hit from it and OHKO it back.</p> ",
    "comments": "<h1>Other Options</h1> <p>Recover gives Alakazam the chance to heal off weak hits and use passive Pokemon like non-Calm Mind and non-Thunder Wave Blissey as complete setup fodder while restoring its Focus Sash should it get chipped. However, Alakazam's pitiful bulk makes this option rarely relevant in practice. Dazzling Gleam gives Alakazam a consistent option to hit Dark-types without Focus Blast's chance to miss; however, it is much weaker and leaves Alakazam helpless against some Steel-types. If Shadow Ball is replaced, Alakazam becomes unable to break Jirachi and opposing Alakazam, making Dazzling Gleam a much worse option regardless of what move is dropped. Encore can lock Pokemon into a non-damaging move, giving Alakazam or its teammates free setup turns; however, it is inconsistent and can very rarely be used. Taunt is usable on hyper offense teams to prevent entry hazards or dual screens from going up from slower leads like Azelf and Skarmory while preventing the likes of Scizor and Skarmory from recovering. It can also deny Defog from Scizor and Gliscor, helping teammates like Lucario and Feraligatr sweep more easily.</p> <h1>Checks and Counters</h1> <p><strong>Steel-types: Scizor walls Focus Sash variants of Alakazam, while Life Orb variants require getting a sequence correct and landing multiple Focus Blasts, making Scizor as close to a counter as you can get. Heatran can switch into Alakazam's Psychic-type STAB moves and Shadow Ball a few times and force it out; however, it can lose if Alakazam uses Nasty Plot or Focus Blast as it switches in. Similarly, Jirachi can switch into Alakazam's Psychic-type STAB move and Focus Blast; however it loses if Alakazam sets up with Nasty Plot or hits it with Shadow Ball on the switch.</p> <p><strong>Revenge Killing: Faster Pokemon like Weavile and Choice Scarf Garchomp can revenge kill Alakazam, although they are unable to safely switch into it directly. Beat Up and Dual Chop, respectively, bypass Alakazam's Focus Sash if it has one, making them much more consistent at checking it. Priority such as Dragonite and Lucario's Extreme Speed and Crawdaunt's Aqua Jet easily remove Alakazam due to its poor physical bulk; however, they are unable to switch into it. To add onto that, Focus Sash variants of Alakazam can live one hit from full HP and potentially KO these Pokemon back. As such, this requires Alakazam to either be chipped or scouted first in order to consistently revenge kill it.</p> ",
    "sets": [
      {
        "name": "Nasty Plot",
        "description": "<p>Psychic is Alakazam's STAB move of choice due to its higher Base Power; however, Psyshock allows Alakazam to break through special walls such as Gastrodon and Blissey much more easily, especially with a Life Orb. Focus Blast lets Alakazam nail the Steel- and Dark-types that would otherwise wall it such as Tyranitar, Scizor, and Heatran. Shadow Ball deals with opposing Psychic-types such as Latios, opposing Alakazam, and Jirachi, which can switch into Focus Blast and Alakazam's Psychic-type STAB move. Magic Guard benefits Alakazam no matter which item it is running; if running Life Orb, Magic Guard prevents its recoil; if running Focus Sash, Magic Guard preserves it in the face of entry hazards. Life Orb can be used to wallbreak much more effectively, notably allowing Alakazam to 2HKO Scizor with Focus Blast after Stealth Rock chip. Focus Sash in turn provides a one-time safety net for Alakazam to setup for free or revenge kill something safely.</p> <p>Alakazam fits best on offense and bulky offense teams, as both archetypes are fast-paced enough to take advantage of Alakazam punching holes in opposing walls while still maintaining the ability to safely bring it in multiple times. Due to Alakazam's frailty, it greatly appreciates slow pivoting from Pokemon such as Gliscor, Rotom-W, and Scizor to bring it in safely. Stealth Rock support from the aforementioned Gliscor, Heatran, and Garchomp are extremely useful, as they allow Alakazam to break through its checks more easily. Latios and Azelf are also solid partners, as they can form an exceptionally potent Psychic Spam core, weakening their shared checks. The likes of Weavile, Nidoking, and Nasty Plot Rotom-W work well with Alakazam to wallbreak for each other. A strong defensive core is also appreciated alongside Alakazam, as it invites in powerful revenge killers like Weavile. Focus Sash Alakazam works exceptionally well on hyper offense teams with partners such as Feraligatr, Azumarill, and Lucario, as it provides a one-time countermeasure to opposing sweepers and can clean weakened teams due to its high Speed tier, all while Focus Sash prevents it from being revenge killed by priority. Clefable also can assist Scizor in checking the likes of Garchomp and Weavile on balance teams, as Scizor can get easily overwhelmed.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 277988, "username": "dex"}, {"user_id": 279858, "username": "Lalaya"}]}, {"name": "Grammar checked by", "members": [{"user_id": 277988, "username": "dex"}]}], "writtenBy": [{"user_id": 529732, "username": "adem"}]}
  },
  "Slowbro": {"sets": [{"name": "Defensive Pivot"}]},
  "Cloyster": {"sets": [{"name": "Shell Smash Sweeper"}]},
  "Weezing": {"sets": [{"name": "Defensive Utility"}]},
  "Starmie": {"sets": [{"name": "Offensive Rapid Spin"}, {"name": "Defensive Rapid Spin"}]},
  "Dragonite": {"sets": [{"name": "Choice Band"}, {"name": "Setup Sweeper"}]},
  "Mew": {"sets": [{"name": "Utility"}]},
  "Azumarill": {"sets": [{"name": "Choice Band"}, {"name": "Belly Drum"}]},
  "Quagsire": {"sets": [{"name": "Unaware"}]},
  "Slowking": {"sets": [{"name": "Defensive Pivot"}]},
  "Scizor": {"sets": [{"name": "Defensive"}, {"name": "Offensive Swords Dance"}, {"name": "Choice Band"}]},
  "Skarmory": {"sets": [{"name": "Spikes Setter"}, {"name": "Suicide Lead"}]},
  "Blissey": {"sets": [{"name": "Calm Mind"}, {"name": "Utility"}]},
  "Raikou": {"sets": [{"name": "Choice Specs"}, {"name": "Calm Mind"}]},
  "Tyranitar": {"sets": [{"name": "Choice Band"}, {"name": "Stealth Rock"}]},
  "Crawdaunt": {"sets": [{"name": "All-out Attacker"}, {"name": "Choice Band"}]},
  "Milotic": {"sets": [{"name": "Physically Defensive"}]},
  "Salamence": {"sets": [{"name": "Choice Scarf"}, {"name": "Setup Sweeper"}]},
  "Latias": {"sets": [{"name": "Choice Scarf"}, {"name": "Defensive"}]},
  "Latios": {"sets": [{"name": "Choice Specs"}, {"name": "Setup Sweeper"}, {"name": "3 Attacks + Roost"}]},
  "Jirachi": {"sets": [{"name": "Utility"}]},
  "Roserade": {"sets": [{"name": "Spikes"}]},
  "Gastrodon": {"sets": [{"name": "Specially Defensive"}]},
  "Garchomp": {"sets": [{"name": "Mixed Attacker"}, {"name": "Choice Scarf"}]},
  "Lucario": {
    "overview": "<p>Lucario is an impressively powerful sweeper on hyper offense teams. Close Combat is enough to let it outright destroy common physically defensive walls like Skarmory and Tangrowth at +2 alongside entry hazard support, and access to Extreme Speed and STAB Meteor Mash let it handle Pokemon that commonly cause hyper offense teams to struggle like Latios, Alakazam, and Unaware Clefable. However, Lucario relies heavily on Stealth Rock and Spikes support to bring foes like Latios, Infernape, and Skarmory into range of its boosted attacks. Furthermore, Lucario's frailty, compounded with Life Orb recoil, puts it on a timer when it tries to sweep, especially if it has to eat a hit in order to set up. Lucario's Speed tier also does it no favors, often forcing it to rely on Extreme Speed. Finally, Lucario struggles to deal with the omnipresent Gliscor, which can switch into it and OHKO it with Earthquake.</p> ",
    "comments": "<h1>Other Options</h1> <p>Lucario has no viable move alternatives. A Choice Band set replacing Swords Dance with Crunch can be utilized but is ultimately less effective.</p> <h1>Checks and Counters</h1> <p><strong>Physically Bulky Pokemon</strong>: Gliscor, Latias, and Slowbro can switch into unboosted Lucario and force it out with Earthquake, Psychic, and Flamethrower or Scald. Slowbro is particularly good at this, as its typing, massive physical bulk, and access to Regenerator mean that Lucario will almost never break through it. Stall teams without Gliscor can rely on Quagsire to revenge kill Lucario; however, it is 2HKOed by Close Combat on the switch.</p> <p><strong>Revenge Killers: If entry hazards are kept off the field, strong wallbreakers like Latios, Dragonite, and Focus Sash Breloom can effectively revenge kill Lucario. Focus Sash Alakazam is a particularly notable foe, as it can keep its Focus Sash intact with Magic Guard, making it quite consistent at revenge killing Lucario. Garchomp is able to comfortably survive a +2 Extreme Speed and KO back with Earthquake.</p> <p><strong>Offensive Pressure: Lucario relies on boosting and its Life Orb to meaningfully pressure faster threats; accordingly, hitting Lucario as it sets up reduces its effectiveness, as Life Orb recoil puts a timer on its sweep. Without a Swords Dance boost, Lucario cannot meaningfully threaten faster Pokemon like Latios and Infernape, so make sure to never let it set up for free.</p> <p><strong>Entry Hazard Removal: Lucario relies immensely on Stealth Rock and Spikes from Skarmory to OHKO Pokemon like Latios, Skarmory, and Tangrowth. Removing these entry hazards leaves Lucario easily revenge killed by the aforementioned threats if they are kept healthy.</p> ",
    "sets": [
      {
        "name": "Swords Dance",
        "description": "<p>Swords Dance lets Lucario break through a number of defensive threats with its Life Orb-boosted Close Combat. Close Combat absolutely destroys bulky Pokemon like Rotom-W and Skarmory, OHKOing both after Stealth Rock. Meteor Mash separates Lucario from other setup sweepers, as it is uniquely capable of hitting Unaware Clefable super effectively. Meteor Mash is also incredibly useful for picking off weakened Gliscor while potentially giving Lucario the boost it needs to sweep. After a Swords Dance boost, Extreme Speed easily OHKOes faster Pokemon that would normally force Lucario out, notably OHKOing Infernape and Latios after Stealth Rock. An Adamant nature is near-required to OHKO Latios with Extreme Speed at +2 after Stealth Rock; however, a Jolly nature can be used if outspeeding Timid Rotom-W is necessary. Justified lets Lucario come in on a predicted Knock Off from Tangrowth or Throat Chop from Weavile to get an Attack boost, which all but ensures its sweep.</p> <p>Lucario fits best on hyper offense teams that can break holes for it to potentially sweep late-game. Lead Skarmory is an excellent partner, as Lucario needs Stealth Rock on the field to guarantee an OHKO on Latios, Infernape, and Starmie with +2 Extreme Speed. The Spikes Skarmory provides is also beneficial, chipping Pokemon like Garchomp and Tangrowth into range of its boosted attacks. Lucario should be paired with wallbreakers that can soften up the enemy team for it to an eventually sweep like Breloom, Dragonite, Feraligatr, and Alakazam. Breloom is particularly good, as it can give Lucario a free setup opportunity with Spore, while Alakazam notably forces Latios out. Azelf is an interesting teammate option that can keep opposing entry hazards off the field with its fast Taunt and weaken foes like Gliscor and Latios with Psychic and U-turn, respectively. Azelf can also run a lead set to support Lucario, setting up either Stealth Rock or dual screens, both of which ease Lucario's sweeping attempts. Water-types like Feraligatr, Cloyster, and Azumarill can set up on and force out Gliscor, which is the most common switch-in to Lucario. Lucario greatly appreciates speed control in the form of Sticky Web or paralysis spam, as these playstyles enable Lucario to pick up KOs with Close Combat on normally faster foes that can tank +2 Extreme Speed like Garchomp and Jolly Mamoswine.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 529732, "username": "adem"}, {"user_id": 279858, "username": "Lalaya"}]}, {"name": "Grammar checked by", "members": [{"user_id": 241023, "username": "Kris"}]}], "writtenBy": [{"user_id": 277988, "username": "dex"}]}
  },
  "Hippowdon": {"sets": [{"name": "Utility"}]},
  "Weavile": {
    "overview": "<p>Weavile is an excellent wallbreaker in BDSP OU by virtue of its great offensive typing and sheer power. Its amazing Speed tier is one of its biggest advantages, as it is faster than the entire unboosted metagame, allowing it to outspeed the likes of Latios, Alakazam, and Garchomp. All of these assets make it a near unstoppable wallbreaker, able to burst through common checks such as Scizor and Azumarill with Assurance and Poison Jab, respectively. However, Weavile's susceptibility to Stealth Rock and frailty mean it requires solid entry hazard removal and slow pivoting to bring it in safely in order for it to wallbreak. Its frailty also makes it prone to strong priority from Infernape, Breloom, and Lucario, rendering its high Speed useless. Furthermore, it can still get walled by Pokemon like physically defensive Scizor, Skarmory, and Poliwrath, although the former is uncommon and the latter two are rarely seen outside of stall.</p> ",
    "comments": "<h1>Other Options</h1> <p>A set utilizing Swords Dance alongside Never-Melt Ice or a Life Orb can also be used in order to clean in late-game scenarios more easily, although its lack of longevity with a Life Orb, alongside its difficulty in setting up, make it a suboptimal choice outside of certain hyper offense structures. Brick Break or Focus Punch can be run to nail Heatran and Lucario without requiring Stealth Rock chip damage; however, the former option is extremely weak and doesn't do enough to Heatran to justify using it, and the latter is extremely inconsistent and prediction reliant.</p> <h1>Checks and Counters</h1> <p><strong>Steel-types: Steel-type Pokemon such as Scizor and Heatran can pivot into and force out Weavile, as they resist its Ice-type STAB moves and don't take too much from Throat Chop; the former is able to heal off any damage it takes with Roost, while the latter threatens Weavile with a Flame Body burn. However, they both quickly falter to Assurance after taking entry hazard damage and Beat Up. Skarmory outright walls Weavile, as it takes negligible damage from all of Weavile's attacks and can heal with Roost.</p> <p><strong>Fairy-types: Fairy-types such as Azumarill and physically defensive Clefable can comfortable switch into Weavile's Dark-type STAB move and either resist or can heal off its Icicle Crash. However, the former is easily worn down due to its lack of recovery, and the latter barely lives 2 Icicle Crashes and doesn't even OHKO Weavile, making both fairly shaky checks. Furthermore, both fear a stray Poison Jab.</p> <p><strong>Fighting-types: Both Infernape and Lucario can switch into Weavile a few times and force it out with their STAB moves due to their typings; however, their mediocre bulk and lack of recovery make them far from consistent. Breloom is unable to safely switch into Weavile due to it fearing Weavile's Ice-type STAB moves; however, it forces Weavile out with Mach Punch.</p> <p><strong>Priority: Priority moves such as Infernape and Breloom's Mach Punch, Scizor's Bullet Punch, Crawdaunt's Aqua Jet, and Lucario and Dragonite and Lucario's Extreme Speed are extremely threatening to Weavile, as they take advantage of its poor physical bulk while ignoring its high Speed. Infernape, Breloom, and Scizor easily OHKO Weavile without any prior damage; however, the rest require minor chip damage, such as Stealth Rock, to KO it.</p> ",
    "sets": [
      {
        "name": "Choice Band",
        "description": "<p>Throat Chop is Weavile's strongest Dark-type STAB option, as well as its most spammable move, taking advantage of the tier's lack of formidable Dark-resistant Pokemon. Icicle Crash deals with the few Pokemon that can switch into Weavile's Throat Chop, such as Togekiss and Clefable, as well as allowing Weavile to consistently force out the likes of Gliscor and Garchomp. Ice Shard lets it revenge kill faster boosted Pokemon and Choice Scarf users such as +1 Dragonite, Garchomp, and Latias. Assurance is Weavile's best option for its last moveslot, as it can KO Scizor and Heatran after Stealth Rock as well as heavily dent Skarmory. Poison Jab is another option that lets Weavile chunk Fairy-types such as Azumarill and Clefable much harder, although it doesn't have much use outside of that. Beat Up can also be run on more offensive teams; this works extremely well with teammates that have high Attack stats, providing Weavile with an extremely powerful STAB option that lets it break past would-be checks such as Skarmory and Heatran with ease and kill Focus Sash Alakazam.</p> <p>Weavile works best on bulky offense teams that can provide it with sufficient pivot support and entry hazard removal to enable it to wallbreak successfully. Pokemon like Rotom-W, Scizor, and Gliscor that can easily bring Weavile in safely via slow pivoting are solid partners. Solid entry hazard removal such as Rapid Spin from Starmie and Defog from Scizor and Gliscor are amazing alongside Weavile, as they vastly improve its longevity. A strong defensive backbone formed from Pokemon such as Latias, Slowbro, and Tangrowth is helpful to absorb the strong priority moves directed at Weavile such as Mach Punch and Extreme Speed. Magnezone, specifically, is a stellar partner, as it removes Steel-types such as Scizor and Skarmory, making Weavile much harder to deal with defensively. Other physical attackers such as Garchomp and Breloom work well with Weavile, as they can overwhelm their shared checks together.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 279858, "username": "Lalaya"}, {"user_id": 241023, "username": "Kris"}]}, {"name": "Grammar checked by", "members": [{"user_id": 277988, "username": "dex"}]}], "writtenBy": [{"user_id": 529732, "username": "adem"}]}
  },
  "Magnezone": {
    "overview": "<p>Magnezone's powerful ability Magnet Pull lets it eliminate or heavily chip defensive Steel-types in Skarmory and Scizor, which many teams rely on to check some of the tier's most powerful offensive Pokemon like Latios and Weavile. It is an incredibly strong attacker in its own right, firing off powerful Flash Cannons and Thunderbolts that pressure most of the tier. However, Ground-types can switch into Thunderbolt and Volt Switch, sapping all of of Magnezone's momentum. Magnezone's reliance on Choice Specs means that, once it has successfully trapped and KOed its Steel-type target, it is forced to switch out or be sacrificed, often costing the team momentum. This is exacerbated by Volt Switch failing to pressure specially defensive Scizor, one of Magnezone's main targets. Magnezone's low Speed leaves it forced out by many of the tier's numerous offensive Pokemon, and it is unable to trap some Steel-types like Jirachi and invested Heatran effectively due to their bulk. Additionally, both Scizor and Skarmory can run a Shed Shell to render Magnezone's niche null and void.</p> ",
    "comments": "<h1>Other Options</h1> <p>If trapping opposing Steel-types is not needed, Magnezone can drop Magnet Pull for Analytic to become an even more fearsome special wallbreaker. However, there are many other special wallbreakers, namely Latios, Alakazam, Starmie, and even Azelf, that offer more utility, a better Speed tier, and better coverage, making this option niche at best.</p> <h1>Checks and Counters</h1> <p><strong>Shed Shell: Both Scizor and Skarmory can run Shed Shell to negate Magnet Pull, rendering Magnezone's niche null and void. However, Shed Shell can be removed by Knock Off from teammates.</p> <p><strong>Ground-types: Gliscor, Garchomp, Mamoswine, and Donphan can revenge kill Magnezone if it is locked into an Electric-type move and block Volt Switch; however, they loathe switching into Flash Cannon. Gastrodon, on the other hand, is a particularly good Magnezone check, as it can easily switch into all of Magnezone's moves due to its typing and special bulk.</p> <p><strong>Blissey: Blissey can switch into Magnezone and effectively force it out with Seismic Toss. However, switching into repeated Volt Switches will leave Blissey unable to check other special attackers.</p> <p><strong>Revenge Killers</strong>: Many offensive Pokemon outspeed Magnezone and force it out. Latios resists Thunderbolt and Volt switch and can hit Magnezone with a powerful Surf. Infernape resists Flash Cannon and forces Magnezone out with Close Combat and Flare Blitz. Breloom resists Thunderbolt and Volt Switch and can use Magnezone to set up or fire off a Spore. Lucario forces Magnezone out with Close Combat and can set up if it's locked into Flash Cannon. Dragonite OHKOes Magnezone with Earthquake and heavily pressures it with Fire Punch. None of these Pokemon appreciate switching into Magnezone's powerful attacks, however.</p> ",
    "sets": [
      {
        "name": "Choice Specs",
        "description": "<p>Magnezone's game plan is fairly straightforward: trap a Steel-type and either KO or heavily damage it with Thunderbolt. Volt Switch is useful for keeping momentum while KOing targets if Skarmory's Sturdy is broken or if Scizor has been chipped into its range as well as for pivoting on specially bulky Pokemon like Latias and Blissey. Flash Cannon hits incoming Ground-types like Gliscor and Garchomp that attempt to block Magnezone's Volt Switch. Tri Attack is a generally good middle-ground move to hit Ground-types and Water-types without the need to predict, as well as for hitting Electric-types like Rotom-C and Raikou neutrally. Explosion is instead useful for generating momentum on offensive teams once Magnezone is no longer needed, heavily damaging a foe and getting in a teammate for free. Discharge is an option to fish for a paralysis on specially defensive Heatran and Latios. A Timid nature is preferred so that Magnezone outspeeds offensive Adamant Scizor and defensive Rotom-W; however, a Modest nature can be used to KO Scizor with less chip damage.</p> <p>Many Pokemon appreciate Magnezone eliminating Steel-type foes like Skarmory and Scizor. Latios is perhaps its best partner, as many teams rely on Scizor to check Latios. Physical wallbreakers like Dragonite, Garchomp, Azumarill, and Weavile, which need Skarmory out of the picture to effectively function, make for excellent choices as well. Azumarill and Weavile can also take advantage of the Ground-types like Donphan and Gliscor Magnezone invites in, while Dragonite and Garchomp appreciate Magnezone threatening Clefable, Togekiss, and Rotom-W. Knock Off users like Donphan, Gliscor, and Tangrowth can bait in Scizor and Skarmory and remove a potential Shed Shell from them, ensuring that Magnezone can successfully trap them; they also are good defensive answers to Ground-types like Garchomp and Gliscor, which force Magnezone out once it has trapped something. Stealth Rock from Gliscor and Clefable ensures that Sturdy won't let Skarmory set an entry hazard on Magnezone before falling. Magnezone works well with U-turn users that bait in Skarmory and Scizor like Gliscor and Scizor.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 529732, "username": "adem"}, {"user_id": 369076, "username": "Tuthur"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 277988, "username": "dex"}]}
  },
  "Tangrowth": {"sets": [{"name": "Physically Defensive"}]},
  "Togekiss": {"sets": [{"name": "Choice Scarf"}, {"name": "Utility"}]},
  "Mamoswine": {"sets": [{"name": "Stealth Rock Attacker"}, {"name": "Wallbreaker"}]},
  "Rotom-Wash": {
    "overview": "<p>Rotom-W is one of the best defensive pivots in the tier due to its access to numerous utility options such as Will-O-Wisp, Thunder Wave, and Volt Switch and its solid defensive stats and typing. Its auspicious typing, combined with Levitate, allows it to check common threats such as Scizor, Weavile, Feraligatr, and Mamoswine. It is easily able to maintain offensive momentum by threatening Ground-types such as Gliscor, Garchomp, and Mamoswine with Will-O-Wisp or Hydro Pump. It can also act as a potent stall breaker with Nasty Plot and Trick combined with Choice Scarf, leaving common stall Pokemon that would otherwise beat like Clefable, Blissey, and Tangrowth exploitable by itself and hard-hitting teammates like Swords Dance Breloom and Swords Dance Garchomp. Choice Scarf Rotom-W is also a great revenge killer, able to OHKO threats like Crawdaunt and Belly Drum Azumarill or, in a pinch, save the day with a burn on Swords Dance sweepers like Garchomp and Lucario. Its great offensive potential and defensive utility make it a staple on bulky offense teams. However, Rotom-W has a poor HP stat, which, when combined with its lack of reliable recovery, leaves it susceptible to being worn down by hazards and status throughout the course of a match. Because of this vulnerability to chip damage, it is unable to consistently check threats like Scizor, Feraligatr, and Mamoswine in the long term. Rotom-W's Speed tier without its Choice Scarf leaves much to be desired, and sets lacking Thunder Wave are walled by the Eon twins.</p> ",
    "comments": "<h1>Other Options</h1> <p>Due to Rotom-W's limited offensive movepool, there is very little possible move variation. Reflect can be run on the defensive set to act as a stronger check to Feraligatr, Azumarill, and Mamoswine. More Speed investment can be used on the Leftovers set, letting it outspeed Pokemon like Scizor, Mamoswine, and Nidoking. However, with lower defensive investment, it is a less reliable answer to threats like Feraligatr and Weavile. It also loses its ability to consistently act as a slow pivot. A specially defensive spread can be used to more reliably answer Starmie and Heatran. However, this makes it less able to check physical attackers, namely Feraligatr and Mamoswine.</p> <h1>Checks and Counters</h1> <p><strong>Grass-types: Rotom-W is unable to do any meaningful damage to Tangrowth outside of burning it. Poison Heal Breloom can use Rotom-W to set up Substitute. However, non-Poison Heal Breloom does not like switching into Will-O-Wisp, and Rotom-W can simply pivot on Breloom with Volt Switch regardless of its set.</p> <p><strong>Dragon-types: Latios takes very little from Rotom-W's attacks and threatens to OHKO it with Draco Meteor; however, it fears Thunder Wave. Although it has to exercise caution while switching in, Garchomp can threaten to OHKO Rotom-W with Outrage after some minor chip damage. However, Garchomp dislikes tanking a Hydro Pump and being burnt by Will-O-Wisp.</p> <p><strong>Chip Damage: Rotom-W's low HP stat and a lack of reliable recovery leave it heavily susceptible to being worn down by hazards. Will-O-Wisp from opposing Rotom-W is also a major threat, as it becomes a far less consistent check to the likes of Scizor, Feraligatr and Mamoswine.</p> <p><strong>Specially Defensive Pokemon</strong>: Gastrodon is one of the best counters to Rotom-W, as it is immune to Volt Switch and does not mind getting burned, and can burn Rotom-W back with Scald. It can even afford to run Sticky Hold to deny Trick from Choice Scarf variants. Blissey takes little from anything Rotom-W can throw at it and can either use it as set up fodder with Calm Mind or wear it down with Seismic Toss. However, Blissey is absolutely crippled by Trick.</p> ",
    "sets": [
      {
        "name": "Defensive",
        "description": "<p>Hydro Pump is used to hit Ground-types like Garchomp, Gliscor, and Mamoswine that attempt to block Volt Switch. Will-O-Wisp lets Rotom-W cripple physical attackers like Azumarill, Feraligatr, and Scizor. Thunder Wave debilitates Pokemon that rely on their high Speed like Latios and Alakazam, making them easier to revenge kill. Protect can be used to scout Choice item users like Azumarill while also being able to rack up extra Will-O-Wisp damage and gain more recovery from Leftovers. Alternatively, Discharge can be used for a second Electric STAB that has a nasty 30% paralysis rate, and a higher base power that allows it to KO threats like Belly Drum Azumarill. However, it indirectly inhibits Will-O-Wisp, as if Discharge paralyzes a strong physical attacker like Scizor or Tyranitar, it can prove to be a liability. Both Will-O-Wisp and Thunder Wave can be run at the same time to give Rotom-W more flexibility in terms of spreading status, but this is not generally recommended. 8 Speed EVs allow Rotom-W to outspeed Adamant Crawdaunt.</p> <p>This set fits on bulky offense and balance teams where it acts as a slow pivot, safely bringing in strong offensive teammates while checking Heatran, Mamoswine, and Feraligatr. Heatran is a good partner, dealing with Pokemon that check Rotom-W like Tangrowth and Clefable while also providing Stealth Rock support. In return, Heatran appreciates Rotom-W's ability to beat Water- and Ground-types like Slowbro, Mamoswine, and Gliscor. Scizor can check Latios and Latias while appreciating Rotom-W checking Heatran and forming a VoltTurn core. Strong offensive Pokemon like Alakazam, Breloom, Garchomp, and Latios are able to take advantage of the offensive momentum Rotom-W generates while also appreciating Rotom-W's ability to chip foes, softening them up for the late-game.</p> "
      },
      {
        "name": "Choice Scarf",
        "description": "<p>Choice Scarf Rotom-W reliably revenge kills Azumarill and Crawdaunt and outspeeds and threatens common threats like Feraligatr and Weavile. Volt Switch allows Rotom-W to gain momentum while bringing in teammates safely. Hydro Pump is effective at thwarting Ground-types that are immune to Volt Switch such as Gliscor, Garchomp, and Mamoswine while also threatening Pokemon such as Tyranitar. Trick cripples passive walls such as Clefable, Tangrowth, and Blissey. It also greatly annoys setup sweepers like Garchomp and Breloom. Will-O-Wisp is an option that lets Rotom-W cripple Garchomp, Scizor, Weavile, and Feraligatr while also threatening Pokemon such as Tangrowth and Tyranitar. Nasty Plot allows Rotom-W to become a potent wallbreaker after it sheds its Choice Scarf due to its good bulk making it difficult to revenge kill and good STAB coverage.</p> <p>Choice Scarf Rotom-W best fits on offense, bulky offense, and balance teams that appreciate its role compression as a Ground-immune offensive pivot and revenge killer that can maintain momentum. Scizor is an excellent teammate since it makes an excellent VoltTurn core with Rotom-W and it checks strong special attackers like Latios and Alakazam, which would otherwise overwhelm and force Rotom-W out. Gliscor is another great partner, as it also creates a VoltTurn core with Rotom-W and provides Stealth Rock and Knock Off support to allow Rotom-W to better wear down Blissey. In return, Rotom-W checks Water- and Ice-types like Feraligatr, Azumarill, Weavile, and Mamoswine for Scizor and Gliscor. Heatran is another excellent partner, as it checks Pokemon that can force out Rotom-W, such as Tangrowth and Latios, while also providing Stealth Rock support. In return, Rotom-W is able to come in on Ground-types such as Garchomp and Mamoswine. Entry hazard removal from the likes of Gliscor and Starmie is great for Rotom-W, as it increases Rotom-W's longevity. Since Choice Scarf Rotom-W is unable to consistently check Water-types like Azumarill and Feraligatr, additional checks to them such as Tangrowth and Shaymin are appreciated.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 279858, "username": "Lalaya"}, {"user_id": 529732, "username": "adem"}]}, {"name": "Grammar checked by", "members": [{"user_id": 277988, "username": "dex"}]}], "writtenBy": [{"user_id": 487308, "username": "BT89"}]}
  },
  "Rotom-Mow": {"sets": [{"name": "Choice Scarf"}]},
  "Azelf": {"sets": [{"name": "Dual Screens Lead"}, {"name": "Stealth Rock Lead"}, {"name": "Offensive Pivot"}]},
  "Heatran": {"sets": [{"name": "Offensive Stealth Rock"}, {"name": "Defensive Stealth Rock"}]}
}