{
  "Venusaur": {
    "comments": "<h1>Other Options</h1> <section><h1>Grass</h1> <p>Knock Off can be used over Giga Drain and Leech Seed to remove items such as Blissey's Heavy-Duty Boots and Nidoking's Life Orb. However, the other two moves are more useful. Mega Venusaur can also run 92 Speed EVs to outpace Jolly Azumarill.</p> <h1>Poison</h1> <p>Earth Power can be used over Hidden Power Fire to OHKO Heatran. Mega Venusaur can run 252 HP / 160 Def / 96 Spe to outpace Jolly Azumarill.</p> </section><h1>Checks and Counters</h1> <section><h1>Grass</h1> <p><strong>Super Effective Coverage: While Mega Venusaur is bulky, it still can not take super effective attacks that well, especially special moves such as Latios's Psychic, Tornadus-T's Hurricane, Blacephalon's Fire Blast, and Kyurem's Ice Beam. Mega Venusaur can rarely do anything in return, since they all at least 2HKO it.</p> <p><strong>Wallbreakers: Powerful Choice-locked attackers such as Choice Specs Hydreigon and Choice Band Victini can easily tear through Mega Venusaur's defenses.</p> <p><strong>Setup Sweepers: Due to Mega Venusaur's more defensive nature, some setup sweepers can easily take advantage of it, such as Dragon Dance Dragonite and Swords Dance Excadrill. However, they need to be careful of certain attacks; Mega Venusaur can cripple Dragonite with poison through Sludge Bomb and chip down Excadrill with Leech Seed or Hidden Power Fire.</p> <p><strong>Stallbreakers: Taunt users such as Gliscor and Kommo-o can prevent Mega Venusaur from recovering and wear it down to a point where they can take it out.</p> <h1>Poison</h1> <p><strong>Psychic-types: Psychic-types such as Tapu Lele, Latios, and Latias can take care of Mega Venusaur with Psychic.</p> <p><strong>Flying-types: Flying-types such as Tornadus-T, Zapdos, Dragonite, and Corviknight can outpace and either 2HKO or OHKO Mega Venusaur.</p> <p><strong>Wallbreakers: Pokemon like Mega Charizard Y, Choice Specs users like Hydreigon and Kyurem, Choice Band users such as Victini, Dragonite, and Mamoswine, and Life Orb users like Landorus can take care of Mega Venusaur with their powerful attacks.</p> <p><strong>Setup Sweepers: Setup sweepers like Dragonite, Mega Latias, and Corviknight can set up on Mega Venusaur and take care of it with their boosted STAB attacks.</p> <p><strong>Stallbreakers: Heatran, Mew, and Gliscor carry Taunt, which keeps Mega Venusaur from using Synthesis and Leech Seed, and take care of it with their attacks.</p> </section>",
    "sets": [
      {
        "name": "Defensive (Grass)",
        "description": "<p>Mega Venusaur acts as a wall for Grass teams, checking threats such as Nidoking and Mega Diancie. Thick Fat crucially helps Mega Venusaur take attacks from Pokemon such as Choice Scarf Victini and Mamoswine. Sludge Bomb is Mega Venusaur's main attack and nails Grass- and Fairy-types like Rillaboom and Alolan Ninetales while doing neutral damage to threats such as Dragonite. Sludge Bomb can also be used to fish for poison against foes such as Mega Sableye, Landorus-T, and Zapdos, making them easier to wear down. Giga Drain allows it to take on threats such as Mamoswine while also gaining back health. Leech Seed can be used over Giga Drain, notably allowing setup sweepers such as Celebi and Decidueye to set up more easily. Hidden Power Fire provides meaningful damage against Steel-types such as Mega Scizor, Ferrothorn, and Bisharp. Synthesis allows Mega Venusaur to stay healthy throughout the match; it should continually use Synthesis to stay at full health so it can constantly switch into different attackers, such as Mega Lopunny and Mimikyu. 16 Speed EVs let Mega Venusaur outspeed Adamant Azumarill.</p> <p>All of Mega Venusaur's teammates appreciate its ability to take on so many threats, such as Mega Diancie, Mega Scizor, and Buzzwole, while also clearing the field of Toxic Spikes. Additionally, Leech Seed on top of the type's natural ability to hazard stack wears down foes quickly. Ferrothorn forms the defensive core of the team with Mega Venusaur, switching into Psychic-type attacks, setting hazards such as Stealth Rock and Spikes, and taking on threats such as Weavile with Gyro Ball. Mega Venusaur can take Fighting-type attacks for Ferrothorn such as Terrakion's Close Combat. Whimsicott can take on Dragon-type Pokemon such as Kyurem, Hydreigon, and Kommo-o with Moonblast for Mega Venusaur, notably switching into Dragonite's Outrage. It can also cripple various threats such as Blissey, Porygon2, and Choice Band Victini by removing their items. All of Mega Venusaur's offensive teammates such as Breloom, Celebi, Rillaboom, Tapu Bulu, and Zarude appreciate its ability to wear down foes such as Mandibuzz, allowing them to better clean late-game. Breloom can take on Dark- and Steel-type Pokemon for Mega Venusaur such as Hydreigon, Heatran, and Excadrill with Swords Dance + Mach Punch and take on Flying-types such as Celesteela with Continental Crush. Celebi can take on Poison- and Fighting-type Pokemon such as Nidoking, Toxapex, and Kommo-o as well as threats such as Heatran with Earth Power. Celebi can also opt to run Hidden Power Fire alongside Earth Power to handle Steel teams better. Rillaboom generally threatens offensive Pokemon such as Mega Gallade, Landorus, and Nihilego with Grassy Glide in Grassy Terrain. Tapu Bulu can also summon Grassy Terrain and takes on Steel- and Flying-type Pokemon such as Ferrothorn, Bisharp, and Zapdos with Close Combat and Stone Edge. Rillaboom and Tapu Bulu's Grassy Terrain helps Venusaur stay healthy and take Earthquakes from Pokemon like Excadrill more easily. Zarude can handle Psychic-type Pokemon such as Alakazam and Tapu Lele and pivot into status conditions due to Jungle Healing, preventing Mega Venusaur from being worn down.</p> "
      },
      {
        "name": "Defensive (Poison)",
        "description": "<p>Mega Venusaur is a great defensive Pokemon for Poison teams thanks to its decent movepool, recovery in two reliable forms, and amazing defensive typing, which allow it to threaten Water-types like Mega Swampert and Keldeo and come in on Electric-types such as Tapu Koko and Magnezone. Its great bulk allows it to also take on physical attackers such as Mega Lopunny and Excadrill. Giga Drain hits Ground-, Rock-, and Water-types like Hippowdon, Gastrodon, Azumarill, Terrakion, and Mega Diancie. Sludge Bomb is Mega Venusaur's strongest STAB option that greatly dents Fairy-and Grass-types like Tapu Koko, Tapu Bulu, and Rillaboom. It is also useful for its 30% poison chance against specially defensive walls like Mega Sableye, Mantine, and Zapdos. Mega Venusaur can use Leech Seed over Sludge Bomb to give it and its teammates passive recovery. Hidden Power Fire makes does good damage to Excadrill and prevents Mega Venusaur from being fodder for Mega Scizor's setup and Ferrothorn's entry hazards. Synthesis keeps Mega Venusaur healthy throughout the match. Venusaur gains Thick Fat upon Mega Evolution, which halves damage taken from Fire- and Ice-type attacks from Blacephalon, Greninja, and Alolan Ninetales, and it also prevents a 2HKOfrom Choice Scarf Victini 's V-create. 16 Speed EVs are used to outpace Adamant Azumarill. The remaining EVs maximize Mega Venusaur's physical bulk so it can tank physical attacks from Pokemon such as Landorus-T, Mega Lopunny, and Excadrill.</p> <p>Toxapex forms a great defensive core with Mega Venusaur, providing Haze to check setup sweepers that exploit Mega Venusaur such as Dragonite, Aegislash, Volcarona, and Mega Scizor. It switches into Mega Charizard Y and pressures the opposition with Toxic Spikes and Scald as well. Mega Venusaur in return can check Electric-types like Zeraora and Tapu Koko and switch into Ground-type attacks from Gastrodon and Hippowdon. Nihilego can set Stealth Rock and take care of Fire- and Flying-types like Mega Charizard Y, Tornadus-T, and Zapdos. Nidoking can also provide Stealth Rock support while also being a great wallbreaker that can 2HKO Mega Sableye using Earth Power, and break through Heatran + Celesteela. Nidoking can also beat Flying-types such as Zapdos and Gliscor, and in return, Mega Venusaur can switch into Ice- and Water-types like Weavile and Urshifu-R. Levitate Galarian Weezing gives the team immunity to Dragon and Ground as well as support in Will-O-Wisp and Defog. Drapion can set Toxic Spikes and switch into Psychic-type attacks from Tapu Lele, Latias, and Latios and Pursuit trap them. Alolan Muk is another Dark-type option that can use Curse, Rest, and Knock Off to take care of Psychic-types. Both Dark-types switch into Ghost-type attacks from Pokemon such as Gengar as well. Galarian Slowking can help against special attackers such as Kyurem and switch in on Psychic-types like Tapu Lele, Latios, and Alolan Raichu.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Grass analysis by", "members": [{"user_id": 305839, "username": "maroon"}]}, {"name": "Poison analysis by", "members": [{"user_id": 393488, "username": "Yami"}]}, {"name": "Quality checked by", "members": [{"user_id": 321991, "username": "Mateeus"}, {"user_id": 320110, "username": "Harpp"}, {"user_id": 473171, "username": "DugZa"}, {"user_id": 305839, "username": "maroon"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}, {"user_id": 384270, "username": "martha"}]}], "writtenBy": [{"user_id": 305839, "username": "maroon"}]}
  },
  "Charizard": {
    "comments": "<h1>Other Options</h1> <section><h1>Fire</h1> <p>Thunder Punch can be used to hit Pelipper, Slowbro, and Tapu Fini super effectively while still hitting Toxapex hard, but Mega Charizard X prefers Earthquake's coverage against Tyranitar and Heatran or Roost's reliable recovery.</p> </section><h1>Flying</h1> <p>Defog can be used over Roost, since Mega Charizard Y threatens common entry hazard setters such as Swampert, Hippowdon, Nidoking, and Jirachi. Tailwind is an option to use on more offensive Flying-type teams, as it gives Mega Charizard Y cleaning potential and lets it outspeed and beat Pokemon like Tapu Koko and Zeraora. Hidden Power Electric can be used to beat certain Flying-type Pokemon like Mantine and Pelipper; however, Mega Charizard Y has to give up a valuable moveslot that will be more useful in general.</p> <h1>Checks and Counters</h1> <section><h1>Fire <p><strong>Stealth Rock: Stealth Rock chips off a quarter of Mega Charizard X's health when it switches in, and half before it Mega Evolves, which limits the number of times it can switch in.</p> <p><strong>Status</strong>: Paralysis makes Mega Charizard X easily revenge killed, whereas Toxic puts it on a timer.</p> <p><strong>Physical Walls</strong>: Physical walls like Hippowdon and Swampert can easily take hits and use Whirlwind or Roar to phaze Mega Charizard X. Hippowdon and Swampert can also threaten it with Earthquake.</p> <p><strong>Bulky Water-types</strong>: Mega Charizard X cannot bypass bulky Water-types without a good number of boosts, and they can potentially wear it down with Toxic or Scald should it not have Roost. Some examples are Mega Slowbro, Sap Sipper Azumarill, and Tapu Fini.</p> <p><strong>Revenge Killers: Revenge killers such as Choice Scarf Terrakion and Latios can easily revenge kill Mega Charizard X, even after a Dragon Dance.</p> </section><h1>Flying</h1> <p><strong>Weather Setters</strong>: Opposing weather setters like Pelipper give Mega Charizard Y some trouble by taking away its sun, weakening its Fire-type moves and making Solar Beam risky to use.</p> <p><strong>Electric-type Pokemon</strong>: Faster Electric-type Pokemon such as Zeraora, Thundurus-T, Tapu Koko, and Alolan Raichu have no trouble beating Mega Charizard Y with their Electric-type STAB moves; however, none can safely switch in against it.</p> <p><strong>Revenge Killers: Hard hitters and faster Pokemon like Nihilego, Terrakion, Garchomp, and Choice Scarf Excadrill can beat Mega Charizard Y or severely weaken it to the point where it won't be able to effectively wallbreak .</p> <p><strong>Stealth Rock: Due to its typing, having Stealth Rock significantly limits the number of times Mega Charizard Y can switch into battle to wallbreak and makes it easier to check.</p> <p><strong>Specially Defensive Pokemon</strong>: Specially defensive Pokemon such as Toxapex, Mantine, and Blissey easily wall Mega Charizard Y and can cripple it with Toxic to wear it down.</p> <p><strong>Status: Toxic poison and paralysis from Pokemon like Toxapex and Zapdos greatly hinder Mega Charizard Y, as Toxic puts it on a timer, gradually wearing it down and making it easier to beat, while paralysis slows it down, making it easier to revenge kill.</p> ",
    "sets": [
      {
        "name": "Dragon Dance (Fire)",
        "description": "<p>Mega Charizard X is a great asset for Fire teams because Dragon Dance makes it a fearsome setup sweeper that threatens types such as Water and Dragon, that Fire naturally struggles against. It can outspeed Mega Aerodactyl and Choice Scarf Hydreigon after one Dragon Dance and Mega Charizard X can outpace Sand Rush Excadrill in sand and Regieleki after two. Outrage can be used to hit other Dragon-types such as Hydreigon and Kyurem and Fire-resistant foes like Slowbro and Swampert; however, being locked into it and confused can be taken advantage of by Pokemon such as Azumarill. Dragon Claw is Mega Charizard X's more reliable but less powerful Dragon-type STAB move. Roost can be used to give Mega Charizard X longevity throughout the game and heal off Flare Blitz recoil, whereas Earthquake hits Heatran, Tyranitar, and Toxapex. 252 EVs in Speed alongside a Jolly nature allow Mega Charizard X to outspeed common threats like Excadrill and Hydreigon.</p> <p>Torkoal can set up Stealth Rock and remove entry hazards from Mega Charizard X's side thanks to Rapid Spin while fueling its Flare Blitz by setting up sun. Rotom-H can set up Light Screen and Reflect so Mega Charizard X can set up safely. Rotom-H can also remove Stealth Rock with Defog and bring Mega Charizard X in safely with Volt Switch. Cinderace as a teammate can wallbreak through diverse walls Mega Charizard X struggles against, such as Tyranitar and Toxapex, by virtue of its coverage moves in High Jump Kick and Zen Headbutt. Blacephalon can help Mega Charizard X by breaking through physical walls such as Hippowdon and Porygon2 with its Choice Specs set. Infernape's Fighting typing allows it to threaten the likes of Tyranitar, Heatran, and Porygon2, with the former two being hard for Mega Charizard X to beat without Earthquake. Choice Scarf Infernape and Choice Scarf Blacephalon can be used against huge threats like Choice Scarf Nihilego. Volcanion can be used to check Rock- and Ground-type Pokemon such as Hippowdon and Rhyperior, and Water Absorb lets it beat Tapu Fini and Azumarill with Sludge Wave. Volcarona can form a sweeping core with Mega Charizard X by removing some of its checks like Mega Slowbro and Gastrodon. In return, Mega Charizard X can take out Pokemon like Mantine and Blissey for Volcarona.</p> "
      },
      {
        "name": "Wallbreaker (Flying)",
        "description": "<p>Mega Charizard Y is a phenomenal wallbreaker thanks to its massive Special Attack stat and its ability Drought, which let it deal heavy damage to Fire-resistant foes like Garchomp and Hydreigon and cleanly 2HKO defensive Pokemon such as Mega Sableye, Zapdos, and Mew. It also has a decent movepool consisting of moves like Solar Beam and Focus Blast, which lets it take on some of the Pokemon that can take Fire-type attacks. Mega Charizard Y's presence on Flying-type teams also improves the matchups against types like Steel, Ice, and Ground. Fire Blast hits super hard thanks to the boost from Drought and deals with pesky Steel-type Pokemon such as Ferrothorn, Celesteela, and Skarmory. Solar Beam deals with Water- and Ground-type Pokemon such as Rotom-W, Swampert, and Hippowdon. Focus Blast helps Mega Charizard Y beat problematic Pokemon for it like Heatran and Tyranitar that can reliably stomach other moves . Roost allows it to keep itself healthy and threaten balance cores more such as those of Water and Psychic teams. Maximum Special Attack and Speed investment with a Timid nature allows Mega Charizard Y to hit as hard as possible and outspeed Pokemon like Choice Specs Tapu Lele and Speed tie with other base 100 Speed Pokemon such as Mew and Galarian Zapdos. Blaze is the preferred ability before Mega Evolving so Charizard does not take any unnecessary damage from opposing sun. Charizardite Y is used as an item to Mega Evolve Charizard.</p> <p>Defoggers like Mantine, Skarmory, Mandibuzz, and Zapdos can reliably clear Stealth Rock for Mega Charizard Y while also providing it with other utility support. Mantine also covers Water-type attacks for it from Pokemon like Urshifu-R and Barraskewda. Since Mega Charizard Y struggles to get past dedicated special walls like Toxapex, Blissey, and Araquanid, teammates like Landorus-T and Dragonite are good, as they can break apart such Pokemon. Landorus-T also provides Mega Charizard Y with an immunity from Electric-type attacks and wallbreak with its Swords Dance set or check threats like Tapu Koko with its Choice Scarf set. Dragonite, on the other hand, loves Mega Charizard Y dealing with Steel-type Pokemon for it; in return, it can muscle past Pokemon like Alolan Muk and Toxapex with its Choice Band set and revenge kill faster threats like Alolan Raichu with Extreme Speed. As Mega Charizard Y is threatened by faster Pokemon such as Nihilego, Terrakion, and Garchomp, teammates like Corviknight, Celesteela, and Skarmory help to have, and they provide a Rock-type neutrality. They all also provide various utility support like Defog, Toxic + Leech Seed, and Stealth Rock to keep Mega Charizard Y safer and to help wear down teams. Other special attackers such as Landorus, Tornadus-T, and Thundurus-T are also decent teammates, as they all can weaken shared checks like Blissey, Heatran, Toxapex, and Tyranitar. Focus Sash Aerodactyl is a good teammate on hyper offensive Flying-type teams to provide it with Stealth Rock and Tailwind support. Gliscor can help stallbreak defensive Pokemon like Blissey and Toxapex for Mega Charizard Y while also providing it with an Electric-type immunity and taking on Pokemon like Zeraora.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Fire analysis by", "members": [{"user_id": 513419, "username": "The gaming attack"}]}, {"name": "Flying analysis by", "members": [{"user_id": 320110, "username": "Harpp"}]}, {"name": "Quality checked by", "members": [{"user_id": 473171, "username": "DugZa"}, {"user_id": 321991, "username": "Mateeus"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 513419, "username": "The gaming attack"}, {"user_id": 320110, "username": "Harpp"}]}
  },
  "Raichu-Alola": {
    "comments": "<h1>Other Options</h1> <section><h1>Electric</h1> <p>Psyshock is an option over Psychic to deal significantly more damage to Blissey, especially if Alolan Raichu is using Nasty Plot. Choice Specs may also be used to further increase Alolan Raichu's damage output and prevent any recoil damage from Life Orb, but being locked into a move is generally not worthwhile. Volt Switch can wear down foes and bring in other teammates safely, but dropping a coverage move like Grass Knot or Focus Blast leaves Alolan Raichu walled by more Pokemon. Hidden Power Ice can be used to OHKO Landorus-T, Landorus, and Gliscor.</p> </section><h1>Checks and Counters</h1> <section><h1>Electric</h1> <p><strong>Priority Moves: Priority moves like Extreme Speed, Ice Shard, and Fake Out from the likes of Dragonite, Zygarde-10%, Mamoswine, and Mega Lopunny are able to easily force out Alolan Raichu by taking advantage of its poor bulk.</p> <p><strong>Specially Defensive Walls: Walls like Blissey, Alolan Muk, and Celebi are able to absorb attacks from Alolan Raichu and threaten it back. Alolan Muk is also able to punish Alolan Raichu for switching out with Pursuit.</p> <p><strong>Electric-resistant Pokemon: Pokemon that resist Electric-type moves such as Rillaboom, Celebi, Tapu Bulu, and Latias are able to take many hits from Rising Voltage, giving Alolan Raichu a difficult time to spam the move.</p> </section>",
    "sets": [
      {
        "name": "Terrain Sweeper (Electric)",
        "description": "<p>Alolan Raichu is one of the best ways for Electric teams to handle fast threats thanks to Surge Surfer, outspeeding the entire metagame under Tapu Koko's Electric Terrain. Rising Voltage's power is significantly boosted under Electric Terrain, letting Alolan Raichu break past foes that don't resist it or are not specially bulky and be an effective sweeper as well. Psychic is useful for hitting notable Fighting- and Poison-type threats to Electric teams such as Kommo-o, Mega Venusaur, and Nidoking. Grass Knot provides important coverage for Ground-types such as Hippowdon, Gastrodon, Swampert, and Seismitoad. Nasty Plot is an option over Grass Knot if a teammate like Rotom-C already has Grass-type coverage, allowing Alolan Raichu to set up on foes it can force out like Pelipper, Toxapex, and Celesteela, making it a sufficient wallbreaker as well. Focus Blast can KO many important targets including Hydreigon, Excadrill, Tyranitar, Diggersby, and Ferrothorn after chip damage. Maximum Speed investment with a Timid nature allows Alolan Raichu to outspeed Keldeo, Alolan Ninetales, and Landorus outside of Electric Terrain. A Modest nature can be used instead to increase damage output while still being very fast under Electric Terrain. Life Orb is used to increase Alolan Raichu's otherwise underwhelming damage output so it can sweep better. Alolan Raichu is very frail, so it should generally avoid switching in recklessly after Electric Terrain has been set up and instead come in safely from teammates' pivoting.</p> <p>Tapu Koko is needed in order to set Electric Terrain for Alolan Raichu so it can clean teams or weaken foes. It also provides an immunity against Dragon-type moves from foes like Garchomp, Latios, and Mega Altaria, and it can beat problematic Dark-types like Bisharp thanks to its STAB Dazzling Gleam. Zeraora can deal with specially defensive walls such as Blissey and Celebi that Alolan Raichu struggles with. Alolan Golem and Magnezone can trap problematic Steel-types like Ferrothorn and Scizor with Magnet Pull and KO them. Alolan Golem is also able to set up Stealth Rock to chip foes for Alolan Raichu. Tapu Koko, Rotom-W, Rotom-H, and Regieleki are able to pivot into Alolan Raichu with Volt Switch and weaken foes, giving it more opportunities to sweep. Bulky partners such as Zapdos and Rotom-W are able to take powerful attacks or priority moves for Alolan Raichu, provide support with Defog, and switch in on Ground-type attacks. However, Rotom-W has to be wary of Mold Breaker Excadrill. Additionally, Zapdos is able to check Tapu Bulu, which disrupts Electric Terrain and checks Alolan Raichu freely due to its typing.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 320110, "username": "Harpp"}, {"user_id": 473171, "username": "DugZa"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 491896, "username": "Rotten"}]}
  },
  "Nidoking": {
    "comments": "<h1>Other Options</h1> <section><h1>Poison</h1> <p>Nidoking can run Fire Blast over Flamethrower, as the extra Base Power lets it OHKO Melmetal and 2HKO specially defensive Celesteela, while dealing more chip damage to neutral targets. However, due to its lower PP count and worse accuracy, it is riskier than Flamethrower. Substitute is a neat option for Nidoking to ease prediction; however, it limits Nidoking's wallbreaking potential, as it takes the place of an important coverage slot.</p> </section>",
    "sets": [
      {
        "name": "Wallbreaker (Poison)",
        "description": "<p>Flamethrower, in tandem with Earth Power, pressures Steel-type Pokemon; it notably wrecks Ferrothorn, a Pokemon that Poison generally struggles to break through. Furthermore, Ice Beam and Thunderbolt make for excellent coverage across the metagame; Ice Beam alleviates matchup pressure against Ground- and Flying-type teams, which contain hard-to-break Pokemon such as Hippowdon and defensive Gliscor. Thunderbolt helps combat Water and Flying teams, notably hitting foes like Tapu Fini and Mantine, allowing Nidoking to make progress. Stealth Rock can be used as an option over Thunderbolt to further increase pressure on the opposing team with entry hazards, as not many Poison-types can learn the move.</p> <p>Amoonguss and Mega-Venusaur assist Nidoking by switching into revenge killers such as Excadrill and Landorus-Therian, status them with sleep and poison, and switch into the Water-type attacks aimed at Nidoking. Alolan Muk is able to combat Pokemon that easily pivot into Nidoking such as Slowking and Blissey while also providing an important Psychic immunity. Muk also appreciates Nidoking's presence, as Nidoking pressured Pokemon that Alolan Muk fails to beat such as Hippowdon and Celesteela. If Stealth Rock is used over Thunderbolt, Gengar and Nihilego are good teammates, as they can both utilize Electric- and Grass-type coverage to make up for Nidoking loses upon dropping Thunderbolt. Crobat, Toxapex, and Galarian Slowking make for exceptional teammates that all appreciate NIdoking's Electric immunity. Crobat is immune to Ground-type attacks and can revenge kill foes such as Mega Gallade, Keldeo and Greninja. Toxapex can pivot into the Water- and Ice-type attacks that force Nidoking out while providing Toxic Spikes support. Finally, Galarian Slowking provides Future Sight support, which makes Nidoking's offensive pressure even harder to handle. Future Sight allows Nidoking to even break Pokemon such as opposing Mega-Venusaur. Galarian Slowking can also switch into Nidoking revenge killers such as Keldeo or Tapu Lele.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Poison analysis by", "members": [{"user_id": 510532, "username": "cy"}]}, {"name": "Quality checked by", "members": [{"user_id": 321991, "username": "Mateeus"}, {"user_id": 305839, "username": "maroon"}]}, {"name": "Grammar checked by", "members": [{"user_id": 277988, "username": "dex"}]}], "writtenBy": [{"user_id": 510532, "username": "cy"}]}
  },
  "Ninetales-Alola": {
    "comments": "<h1>Other Options</h1> <section><h1>Ice</h1> <p>Blizzard can be used over Encore to enable Alolan Ninetales to nab an OHKO on Mega Pinsir; however, without Encore, it cannot force setup sweepers such as Bisharp and hazard settlers like Galarian Corsola to lock into uility moves. Heavy-Duty Boots is a niche option to avoid taking Stealth Rock damage. Choice Scarf is another option that enables Alolan Ninetales to outpace Mega Lopunny, Mega Gallade, and Choice Scarf Terrakion, but this means fewer turns of Aurora Veil and making it harder for setup sweepers like Alolan Sandslash and Cloyster to setup.</p> </section><h1>Checks and Counters</h1> <section><h1>Ice</h1> <p><strong>Steel-types: Alolan Ninetales has trouble dealing with Steel-types like Mega Scizor, Jirachi, and Excadrill due to resisting both of Alolan Ninetales's moves and can take care of it with Bullet Punch and Iron Head.</p> <p><strong>Super Effective Attacks: Fire-types like Mega Charizard X, Blacephalon, and Cinderace are able to tank any of Alolan Ninetales attacks and OHKO it. Mega Charizard Y and Torkoal can also prevent Aurora Veil from being set up thanks to Drought. Fast Rock-types like Mega Aerodactyl and Mega Diancie are able to OHKO Alolan Ninetales with their STAB attacks. Poison-types like Gengar are able to OHKO Alolan Ninetales with Sludge Wave.</p> <p><strong>Special Walls: Special Defensive walls such as Blissey and Empoleon can take any of Alolan Ninetales attacks, and take care of it with their attacks or using Toxic.</p> <p><strong>Stealth Rock: Alolan Ninetales is greatly hindered by Stealth Rock, which limits the times it can switch in to provide hail and Aurora Veil.</p> <p><strong>Revenge Killers</strong>: Fast Pokemon like Mega Lopunny and Mega Gallade along with Choice Scarf users like Greninja, Terrakion, and Excadrill can easily outpace and take care of Alolan Ninetales.</p> </section>",
    "sets": [
      {
        "name": "Aurora Veil (Ice)",
        "description": "<p>Alolan Ninetales is a great asset to Ice-type teams due to summoning hail and using Aurora Veil to allow its teammates to take less damage from attacks. Alolan Ninetales's Fairy typing is good to threaten Fighting- and Dark-types like Keldeo and Mega Sableye with STAB Moonblast, and it has a great Speed tier to outpace Pokemon such as Keldeo and Terrakion. Freeze-Dry is used to hit Water-types such as Swampert, Pelipper, Mantine, and Gastrodon. Encore allows Alolan Ninetales to lock entry hazard settlers and setup sweepers like Galarian Corsola, Torkoal, and Bisharp into non-damaging moves. Light Clay is used to maintain Aurora Veil for eight turns, and Snow Warning is needed to summon hail. 252 Special Attack EVs make Alolan Ninetales hit as hard as possible. A Timid nature with 252 Speed EVs is vital for Alolan Ninetales to outpace Keldeo and Hydreigon.</p> <p>All teammates appreciate Alolan Ninetales providing Aurora Veil to help take attacks and its Moonblast threatening Keldeo and Terrakion. Alolan Sandslash loves Alolan Ninetales summoning hail to enable Slush Rush, allowing it to outpace Mega Aerodactyl and Mega Diancie. Alolan Ninetales in return can take care of Landorus and Nidoking outside hail. Avalugg is a great wall that can come in on Excadrill's and Bisharp's attacks and take care of them with Body Press. It can also use Rapid Spin to get rid of entry hazards that prevent Alolan Ninetales from repeatedly coming in. Cloyster is a great partner, as it loves the support from Aurora Veil to safety set up and sweep and can take care of troublesome Rock- and Fire-types once it set up, like Mega Tyranitar, Mega Aerodactyl, Mega Charizard Y, and Victini. Piloswine is also a great partner that can take care of Volcarona and Mega Charizard Y thanks to Thick Fat and provide Stealth Rock. Mamoswine is another option, as it can also provide Stealth Rock support, takes neutral damage from Fire- and Rock-type attacks and helps against Rock-, Fire-, Steel- and Poison-types like Tyranitar, Heatran, Magnezone, and Toxapex. Kyurem is a great wallbreaker; helps out Alolan Ninetales by taking care of troublesome Steel-types such Heatran, Excadrill, and Magnezone with Earth Power; and helps out in the Water-type matchup with Freeze-Dry to 2HKO Toxapex, which Alolan Ninetales has trouble beating. Choice Scarf Galarian Darmanitan is a great wallbreaker and a great way to take care of troubling Steel-types like Excadrill, Heatran, and Jirachi that threaten Alolan Ninetales out. Choice Scarf Weavile is a great check to a set-up Cloyster thanks to Foul Play and troublesome Ghost- and Psychic-types like Gengar, Blacephalon, Victini and Jirachi thanks to Knock Off and Pursuit. Knock Off is also useful to get rid of Heavy-Duty Boots from Blissey, Leftovers from Tyranitar, and Eviolite from Porygon2.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Ice analysis by", "members": [{"user_id": 393488, "username": "Yami"}]}, {"name": "Quality checked by", "members": [{"user_id": 473171, "username": "DugZa"}, {"user_id": 305839, "username": "maroon"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}]}], "writtenBy": [{"user_id": 393488, "username": "Yami"}]}
  },
  "Ditto": {
    "comments": "<h1>Other Options</h1> <section><h1>Normal</h1> <p>Changing Ditto's happiness from 255 to 0 lets it beat Pokemon like Mega Altaria and Diggersby if they run Frustration, but not if they run Return. An IV spread of 30 Def / 30 SpD / 0 Spe can be used to revenge kill Pokemon like Volcarona and Thundurus-T with Hidden Power Rock on more hyper offensive Normal teams.</p> </section><h1>Checks and Counters</h1> <section><h1>Normal</h1> <p><strong>Defensive Sweepers: Ditto cannot properly counter defensive sweepers like Calm Mind Mega Slowbro, Suicune, and Mega Latias and CurseRest Steelix due to it only having 5 PP.</p> <p><strong>Hawlucha: Ditto cannot copy Hawlucha's Speed boost from Unburden or transform if it is behind a Substitute.</p> <p><strong>Status</strong>: Burn halves Ditto's Attack, causing it to be less effective in revenge killing physical attackers, poison lowers its longevity overtime, and paralysis prevents it from revenge killing due to its Speed drop.</p> <p><strong>Substitute:</strong> Ditto cannot transform into Pokemon behind a Substitute. Some examples of Pokemon that use Substitute are Keldeo, Blacephalon, and Magnezone.</p> <p><strong>Trick Room: Ditto has a hard time dealing with Trick Room setters like Hatterene and Stakataka, which are slower than Ditto because of its Choice Scarf.</p> </section>",
    "sets": [
      {
        "name": "Revenge Killer",
        "description": "<p>Ditto is one of the best ways for Normal teams to handle fast threats, as Imposter mirrors opposing Pokemon's stats and Choice Scarf makes Ditto outspeed them. With Ditto in battle, Pokemon like Volcarona, Mega Altaria, and Kommo-o are pressured from setting up because it can steal stat boosts to countersweep, and Imposter means Sticky Web has no effect on it. Ditto can also exploit support Pokemon like Zapdos and Blissey to recover with Roost or Soft-Boiled and entry hazard removers like Pelipper and Coalossal to clear hazards. It can also safely switch into Mega Sableye's Knock Off to trade Speed for move freedom, and it ignores defensive Celesteela's Toxic. However, Ditto's 5 PP per move and Choice lock give it a hard time beating defensive sweepers like CurseRest Mega Steelix and Calm Mind Mega Slowbro. Choice Scarf is required for Ditto to revenge kill setup sweepers like Swords Dance Excadrill and Mega Lopunny and Speed tie with opposing Choice Scarf Pokemon like Nihilego and Landorus-T. Ditto cannot copy HP, so investing 252 EVs into HP helps it a lot, and 0 Speed IVs and a Relaxed nature allow it to not transform and lose PP against mirrored Ditto. The mentioned IV spread allows it to have HP Fire to trap and KO Magnezone.</p> <p>Defensive Pokemon like Staraptor, Blissey, and Porygon2 appreciate Ditto because it can revenge kill setup Pokemon like Dragon Dance Altaria and Bulk Up Cinderace that will try to break and setup on them. Ditto appreciates Pokemon with pivoting moves, like Teleport Blissey and Porygon2 and U-Turn Staraptor, to allow it to come in safely. Staraptor helps with Fighting-types with its part Flying typing and Intimidate, and it has Defog to clear entry hazards for when Ditto comes in. Ditto does not appreciate being statused in any form, so Blissey as a teammate can absorb status thanks to Natural Cure. Offensive Pokemon like Mega Lopunny, Diggersby, Heliolisk, and Indeedee-M are appreciated, as they can remove defensive Pokemon Ditto cannot revenge kill. Mega Lopunny's Close Combat helps with Pokemon like Tyranitar and Mamoswine, and its Encore to helps with defensive sweepers like the aforementioned Steelix and Calm Mind Mega Slowbro. Diggersby helps with Electric-, Rock-, and Steel-types like Zapdos, Coalossal, and Aegislash with Earthquake and can revenge kill faster Pokemon like Zeraora and Cinderace with Quick Attack. Indeedee-M helps with Fighting- and Poison-types like Keldeo and Toxapex with Expanding Force and prevents priority moves like Mach Punch from working thanks to Psychic Terrain. Heliolisk helps with Water- and Flying-types like Celesteela, Toxapex, and Mantine with Thunderbolt and has Dry Skin to offer Water immunity for the team.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Normal analysis by", "members": [{"user_id": 481576, "username": "roxiee"}]}, {"name": "Quality checked by", "members": [{"user_id": 473171, "username": "DugZa"}, {"user_id": 321991, "username": "Mateeus"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 481576, "username": "roxiee"}]}
  },
  "Aerodactyl": {
    "comments": "<h1>Other Options</h1> <section><h1>Flying</h1> <p>Mega Aerodactyl's fast Taunt can be used to stop entry hazard setters like Hippowdon, Skarmory, and Krookodile as well as prevent walls like Toxapex, Galarian Corsola, and Porygon2 from using recovery moves; however, Mega Aerodactyl values all of its moveslots and Flying-type teams have better Taunt users. Fire Fang is also an option to hit Steel-type Pokemon like Ferrothorn and Forretress harder than any move on the set. Dual Wingbeat can be used over Dragon Dance to beat Pokemon like Kommo-o, Mega Gallade, and Mega Venusaur.</p> </section><h1>Checks and Counters</h1> <section><h1>Flying</h1> <p><strong>Defensive Pokemon: Sturdy defensive Pokemon like Porygon2, Galarian Corsola, and Ferrothorn have little to fear from Mega Aerodactyl, as they can take it on even after a Dragon Dance, cripple it with status moves, and proceed to wear it down.</p> <p><strong>Status Moves</strong>: Being a physical attacker, Mega Aerodactyl fears burns from Scald and Will-O-Wisp, which leave it unable to do any significant damage. Paralysis from Thunder Wave and Discharge leaves it severely crippled, as it makes it slower and therefore a lot easier to handle.</p> <p><strong>Steel-type Pokemon</strong>: Mega Aerodactyl, in general, has trouble beating Steel-type Pokemon such as Aegislash, Celesteela, Ferrothorn, and Melmetal, as, due to their good bulk, they can take any unboosted move and severely damage it back.</p> <p><strong>Priority Moves: Mega Aerodactyl is weak to common priority moves like Bullet Punch, Aqua Jet, and Ice Shard from Pokemon such as Scizor, Azumarill, and Mamoswine, which can OHKO it or severely weaken it.</p> <p><strong>Bulky Water-types: Bulky Water-type Pokemon like Swampert, Slowbro, and Gastrodon give a hard time to Mega Aerodactyl, as it cannot hit them with super effective attacks and risk being burned by Scald.</p> </section>",
    "sets": [
      {
        "name": "Offensive",
        "description": "<p>Mega Aerodactyl's high Attack stat, stellar Speed stat, and good offensive typing make it a solid offensive Pokemon for Flying-type teams. Its great Speed also lets it outspeed and handle fast threats like Tapu Koko, Zeraora, and Weavile. Its access to Dragon Dance lets Mega Aerodactyl increase its already good Attack stat to even greater levels and outspeed extremely fast Pokemon such as Choice Scarf Greninja, Regieleki, and Excadrill in the sand, making it considerably harder to revenge kill. Stealth Rock can also be used over Dragon Dance for role compression, especially when Mega Aerodactyl's teammates are not carrying it. Its high Speed stat lets it set Stealth Rock quickly against types like Flying, Dragon, and Fire and threaten their entry hazard removers. Stone Edge hits much of the metagame for good damage right off the bat, especially with Rock's good coverage. When boosted by Dragon Dance, it scores 2HKOs on Pokemon such as Slowbro and Mega Venusaur after minor chip damage. Earthquake in tandem with Stone Edge improves Mega Aerodactyl's coverage and lets it hit Pokemon such as Aegislash and Toxapex reliably. It also takes care of Electric-type Pokemon such as Tapu Koko, Magnezone, and Zeraora without relying on Stone Edge to hit. Tough Claws-boosted Ice Fang lets Mega Aerodactyl take care of bulky Ground- and Dragon-type Pokemon like Gliscor, Landorus, and Garchomp. Stone Edge + Ice Fang synergizes well in the Dragon matchup, as it can hit every viable Dragon-type for super effective damage. Pursuit, which is also boosted by Tough Claws, can be used over Ice Fang to handle threats to Flying-type teams such as Choice Band Victini, Mega Latias, and Latios.</p> <p>Mega Aerodactyl is vulnerable to Electric-type Pokemon like Alolan Raichu in Electric Terrain and Regieleki, so teammates like Gliscor and Landorus can cover that weakness. Gliscor can provide stallbreaking support to wear down walls and absorb status for Mega Aerodactyl, while Landorus is a formidable wallbreaker to beat physical walls like Toxapex, Porygon2, Galarian Corsola, and Hippowdon. Additionally, both can also utilize Stealth Rock so Mega Aerodactyl can use Dragon Dance to be more threatening. Ice- and Rock-type Pokemon like Choice Scarf Galarian Darmanitan, Weavile, Nihilego, and Terrakion also threaten Mega Aerodactyl, so teammates like Corviknight, Celesteela, and Skarmory can handle them; in return, Mega Aerodactyl can deal with problematic Fire-type Pokemon like Victini and Mega Charizard Y. Corviknight can act as a great wincon with its Bulk Up set after Mega Aerodactyl has weakened the team, while Skarmory can also take on physical threats like Mega Scizor, Mega Sharpedo, and Excadrill. They both also provide Defog support to help with Mega Aerodactyl's Stealth Rock weakness. Celesteela, on the other hand, can take care of Steel-type Pokemon with Flamethrower or wear down teams for Mega Aerodactyl with Toxic + Leech Seed support and check Mega Diancie. Special attackers such as Thundurus-T and Tornadus-T can take care of Water-type Pokemon such as Swampert, Toxapex, and Urshifu-R that are problematic for Mega Aerodactyl. Mantine and Mandibuzz are also decent teammates to take on Water- and Ghost-type threats like Kingdra and Aegislash; the former provides Mega Aerodactyl with an important Water-type immunity while the latter provides pivoting with U-turn and Knock Off support. A wallbreaker like Dragonite can weaken shared checks like Toxapex for Mega Aerodactyl and appreciates Stealth Rock support for a late-game sweep.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 473171, "username": "DugZa"}, {"user_id": 305839, "username": "Maroon"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 320110, "username": "Harpp"}]}
  },
  "Zapdos": {
    "comments": "<h1>Other Options</h1> <section><h1>Electric</h1> <p>Heat Wave can be used over Toxic on Zapdos's SubToxic set as it allows Zapdos to hit Grass- and Steel-types like Ferrothorn, Rillaboom, and Mega Scizor. Hurricane is an option over Defog on its Support set to hit Mega Venusaur to improve the Grass matchup. Roost is an option on its Choice Specs set to give Zapdos more longevity throughout the match. The downside of this is losing momentum wasting a turn recovering and being Choice-locked into a passive move.</p> <h1>Flying</h1> <p>Choice Specs Zapdos with Hurricane can be utilized to take down threats such as Hippowdon and Mega Venusaur, but Flying-type teams generally prefer Zapdos's defensive utility, and Thundurus-T is generally better offensively.</p> </section><h1>Checks and Counters</h1> <section><h1>Electric</h1> <p><strong>Dragon-types: Dragon-type Pokemon like Latios and Mega Altaria resist Zapdos's Discharge and Heat Wave and can recover the damage off with Recover or Roost. However, they do not like dealing with Hurricane from Choice Specs Zapdos.</p> <p><strong>Walls: Defensive Pokemon like Blissey, Porygon2, and Mega Venusaur can recover with Soft-Boiled, Recover, and Synthesis, respectively, which makes them hard for Zapdos to get rid of.</p> <p><strong>Stallbreakers: Zapdos is unable to recover with Roost, get rid of entry hazards, or use Toxic if it gets taunted by Pokemon like Hydreigon, Mew, and Gliscor.</p> <p><strong>Status: Toxic heavily cripples Zapdos by putting it on a timer, while Will-O-Wisp negates its Leftovers recovery.</p> <p><strong>Super Effective Attacks</strong>: Ice-type STAB attacks from Pokemon like Weavile and Kyurem and Rock-type STAB attacks from Mega Diancie and Terrakion can KO Zapdos.</p> <p><strong>Wallbreakers: Choice Scarf Tapu Lele, Choice Band Victini, and Choice Specs Hydreigon have no problem dealing with Zapdos.</p> <h1>Flying</h1> <p><strong>Stallbreakers: Pokemon like Gliscor and Hydregion can use Taunt to shut down Zapdos from using Toxic and Roost, making it less effective. Zapdos can especially struggle against Gliscor due to the fact that it can tank any of Zapdos's attacks with ease and further benefits from Toxic due to Poison Heal.</p> <p><strong>Opposing Walls</strong>: Walls like Blissey, Mega Venusaur, and Heatran are tough for Zapdos to break through, as Blissey can remove status with Natural Cure, while the latter two can't be poisoned but they have to be careful of paralysis from Discharge. Walls like Swampert and Celesteela can be tough for specially defensive variants, but they struggle against SubToxic variants.</p> <p>*<em>Wallbreakers: Zapdos struggles against wallbreakers such as Choice Specs Blacephalon, Mega Lopunny, and Zygarde-10%, which easily break past it due to their strong STAB moves or super effective coverage moves; Mega Lopunny can even handle Zapdos behind Substitute thanks to Triple Axel.</p> <p><strong>Setup Sweepers: Zapdos variants lacking Heat Wave can allow Steel-type Pokemon like Excadrill and Mega Scizor to set up for free, while non-Toxic variants can allow Pokemon like Mega Charizard X and Volcarona to set up, although they do not like Discharge paralysis.</p> <p><strong>Status: Toxic poison and burn negate Leftovers recovery and make it difficult for Zapdos to wall opposing foes.</p> <p><strong>Super Effective Coverage</strong>: Zapdos struggles against Pokemon having Ice- and Rock-type attacks like Mamoswine and Terrakion, especially physical attackers due to its rather unimpressive physical bulk.</p> </section>",
    "sets": [
      {
        "name": "Defensive (Electric)",
        "description": "<p>Zapdos is one of the best defensive Pokemon for Electric teams due to its ability to deal with Ground- and Grass-types like Excadrill, Landorus-T, Rillaboom, and Tapu Bulu with its Flying typing, provide Defog support to remove entry hazards, and keep itself healthy with Roost. Volt Switch is used to pivot teammates in, whereas Discharge is used to spread paralysis on Pokemon like Latias and Mega Venusaur, which are threats to Electric teams. Heat Wave is required for Zapdos to damage common Steel- and Grass-types like Ferrothorn, Excadrill, Rillaboom, and Mega Scizor. Pressure allows Zapdos to stall out defensive Pokemon like Ferrothorn, Toxapex, and Mew, and Static allows it to potentially paralyze Pokemon that tend to use contact moves like Victini, Tapu Bulu, and Mega Lopunny. 80 Speed EVs with a Timid nature allow Zapdos to outpace Pokemon like Diggersby, Tapu Bulu, and Bisharp, while 252 HP and 176 Defense EVs allow it to take on physical attackers like Rock Slide Excadrill and Waterfall Mega Swampert.</p> <p>All of Zapdos's teammates appreciate its utility in removing entry hazards thanks to Defog and its ability to check Steel- and Grass-types like Excadrill, Ferrothorn, and Rillaboom with Heat Wave. Tapu Koko and Alolan Raichu form a great offensive core, and because of their high Speed, they can check faster threats like Hydreigon and Mega Diancie. In return, Zapdos pivots them in safely with Volt Switch. Tapu Koko can notably defeat Dragon-types like Mega Altaria and Kommo-o with Dazzling Gleam, while Alolan Raichu can beat Poison-types like Mega Venusaur and Nihilego with Psychic. Magnezone can get rid of Ice-types that threaten Zapdos, like Kyurem and Weavile, with Flash Cannon while in return, Zapdos can switch into Fighting-types like Mega Gallade and Hawlucha. Alolan Golem also helps Zapdos with Ice-types like Alolan Ninetales and Weavile with its Rock-type STAB attacks. Rotom-W forms a defensive core with Zapdos and provides Will-O-Wisp support to cripple physical attackers, while both pivot teammates in with Volt Switch. Rotom-W can also switch into threatening Fire- and Water-types like Victini, Greninja, and Urshifu-R. Zeraora and Thundurus help with bulky Pokemon that Zapdos cannot harm like Blissey and Porygon2 and Dark-, Ice-, and Rock-types such as Tyranitar, Piloswine, and Nihilego while Zapdos's Volt Switch brings them in safely. Rotom-C is a nice special attacker that deals with Ground / Water Pokemon like Gastrodon and Seismitoad that Zapdos has a hard time getting rid of. Regieleki is a powerful wallbreaker with Choice Specs that can outspeed threats like Latios and Volcarona, and is a beast in Electric Terrain. Both Rotom-W and Rotom-C provide a secondary Ground immunity but aren't reliable checks to Mold Breaker Excadrill.</p> "
      },
      {
        "name": "SubToxic (Electric)",
        "description": "<p>Zapdos's unique Speed tier and decent bulk allow it to function well with a SubToxic set while also being a crucial Ground-type immunity thanks to its Flying typing. Substitute allows Zapdos to avoid being affected by status ailments like poison and burn from Pokemon like Mega Sableye and Ferrothorn while also coordinating well with Pressure and recovering with Roost to increase longevity. Discharge is Zapdos's primary STAB attack and it's used over Thunderbolt to increase odds of paralysis on Poison- and Steel-types like Mega Venusaur and Ferrothorn that aren't affected by Toxic while also making it harder for Pokemon to revenge kill it. Toxic is required to beat Ground-type Pokemon like Hippowdon, Seismitoad, and Gastrodon along with opposing walls and bulky Pokemon Mega Latias and Porygon2. Heavy-Duty Boots negates Stealth Rock damage, while Leftovers helps Zapdos recover behind Substitute. Pressure helps stall out moves with low PP like Stone Edge, Diamond Storm, and Hydro Pump. Maximum EVs in Speed with a Timid nature allow Zapdos to outpace Pokemon like non-Choice Scarf Landorus-T and Tapu Lele, while 248 HP EVs are used over 252 HP EVs to allow it to set up Substitute four times and increase its overall bulk.</p> <p>Alolan Golem helps with Ice-types that threaten Zapdos like Kyurem and Alolan Ninetales with its Rock-type STAB attacks and Stealth Rock, while in return Zapdos's part Flying typing helps it switch into Ground- and Fighting-types like Gastrodon, Excadrill, Mega Gallade, and Hawlucha. Tapu Koko helps with Fighting-, Dragon-, and Dark-types like Terrakion, Kommo-o, and Hydreigon with Dazzling Gleam, and with Alolan Raichu, they both help Zapdos with faster threats it cannot deal with like Terrakion and Zarude. Magnezone traps and eliminates Steel-types like Ferrothorn and Jirachi with Hidden Power Fire and Body Press that Zapdos cannot damage, while also hitting Ice- and Fairy-type Pokemon like Mamoswine and Tapu Bulu with Flash Cannon. Zeraora and Thundurus help with Dark-, Ice-, and Rock-types like Weavile, Mamoswine, and Tyranitar and notable defensive Normal-types like Blissey and Porygon2 with Close Combat and Superpower, respectively. Zeraora can also get rid of troubling Grass-types like Mega Venusaur and Tapu Bulu with Z-Bounce. Zapdos appreciates Rotom-W pivoting it in safely with Volt Switch, spreading status with Will-O-Wisp and Toxic, hitting Ground- and Rock-types like Nidoking, Landorus-T, and Alolan Golem with Hydro Pump, and providing an additional Ground immunity thanks to Levitate. Its also able to switch into Fire- and Water-types like Cinderace and Greninja.</p> "
      },
      {
        "name": "Choice Specs (Electric)",
        "description": "<p>Zapdos is a great offensive option on Electric teams because of its high Special Attack enhanced by Choice Specs, which allows it to serve as an effective wallbreaker and offensive pivot. Hurricane is amazing because it gives Electric a way to effectively hit bulky Grass-types like Mega Venusaur, Rillaboom, and Cradily, which can be an overall difficult matchup. It's also useful against Dragon-types like Latias and Mega Altaria. Heat Wave allows it to take on Ice-, Steel-, and Grass-types such as Glastrier, Excadrill, Mega Scizor, and Ferrothorn. Hidden Power Ice allows Zapdos to hit Dragon- and Ground-types like Dragonite, Garchomp, and Landorus super effectively. Thunderbolt is an option for a stronger Electric STAB, though it is hard to justify using it over Hidden Power Ice. Volt Switch allows Zapdos to pivot into its teammates to gain momentum throughout the match. Thunderbolt can also be run if Hidden Power Ice is being used in the third slot, but pivoting with Volt Switch is generally more useful. Choice Specs increases Zapdos's wallbreaking potential, and 252 Speed EVs let it outspeed Timid Heatran and Tapu Lele.</p> <p>Choice Specs Zapdos doesn't run Roost normally, so using Rotom-W as an entry hazard remover with Defog over Pain Split is more favorable. Rotom-W acts as an Ice-type resist, forms a Ground-immune core with Zapdos, and notably helps with Fire- and Ground-types like Heatran and Mamoswine with Hydro Pump. Alolan Golem sets Stealth Rock and helps with Ice-types like Kyurem and Alolan Ninetales that threaten Zapdos with its Rock-type attacks, and in return Zapdos can get rid of Grass- and Ground-types like Breloom, Rillaboom, and Mega Garchomp that can KO Alolan Golem. Magnezone is a nice Fairy resist that deals with Ice- and Rock-types like Mamoswine, Kyurem, and Mega Diancie that threaten Zapdos with Flash Cannon. Zeraora and Thundurus can check Normal-, Dark-, Ice-, and Rock-types like Porygon2, Blissey, Weavile, Mamoswine, and Tyranitar with their respective Fighting-type attacks. Tapu Koko and Alolan Raichu are great offensive options and because of their high Speed, they can check faster threats like Mega Diancie and Zarude, while Zapdos can generate momentum and bring them in with Volt Switch. Tapu Koko deals with Dragon-, Fighting-, and Dark-types such as Kommo-o, Mega Latios, Terrakion, and Hydreigon thanks to Dazzling Gleam, and Alolan Raichu deals with Poison-types like Mega Venusaur and Nihilego.</p> "
      },
      {
        "name": "SubToxic (Flying)",
        "description": "<p>Zapdos is an excellent user of Pressure stall with Toxic and Roost. Substitute helps it avoid status and stall most Pokemon with Toxic and Roost. Toxic helps Zapdos beat defensive Pokemon like Avalugg and Porygon2 while also putting offensive threats like Landorus-T and Tapu Lele on a timer. Toxic also helps wear down Ground-types such as Gastrodon and Swampert. Discharge has a nice chance to paralyze opposing Pokemon, which makes it tougher for them to KO Zapdos, and also hits Poison- and Steel-types like Toxapex and Celesteela. Discharge paralysis can also provide speed control against Pokemon like Choice Scarf Greninja. Heavy-Duty Boots allows Zapdos to switch in without worrying about its Stealth Rock weakness, while Leftovers provide passive recovery. Maximum Speed investment with a Timid nature helps Zapdos outspeed threats such as Mimikyu, Suicune, and Tapu Bulu. 248 HP EVs allows Zapdos to set up 4 Substitutes and maximize the health of the Substitute.</p> <p>Flying teams appreciate Zapdos's ability to annoy offensive threats such as Scizor and weaken walls like Porygon2. Zapdos should set up Substitute on passive Pokemon such as Klefki, Mandibuzz, and Toxapex and stall them out. It should try to spread Toxic on the opposing team early to make it easier to stall late-game. Zapdos should avoid getting statused and getting its item removed by Knock Off or Corrosive Gas, as both limit its ability to function as a wall. Celesteela acts as a great partner for Zapdos with its ability to take on Ice- and Rock-type attacks while also having Flamethrower to hit Steel-types like Ferrothorn and Excadrill, which Zapdos can struggle with. Leech Seed and Toxic from Celesteela further help in removing pressure from Zapdos. Mega Aerodactyl also works great alongside Zapdos, as it can KO Ice-types with Stone Edge, use Pursuit to deal with threats like Victini, and provide Stealth Rock support. Landorus-T and Gliscor are both good Electric-immune partners, with Choice Scarf Landorus-T also dealing with faster threats and bringing Zapdos in with U-turn and Gliscor acting as a status absorber and forming a good stallbreaker core with Zapdos. Setup sweepers such as Dragon Dance Mega Aerodactyl and Dragonite appreciate Zapdos's ability to weaken teams, allowing them to pull off an easier late-game sweep. Tornadus-T is also an excellent partner with U-turn to bring in Zapdos, Heat Wave and Focus Blast to KO Steel-types, and Knock Off to remove items. It can also act as an offensive Defogger in case Zapdos gets hit by Knock Off or is running Leftovers. Leftovers Zapdos also appreciates Defog support from Mantine, which can act as a switch-in to special Ice-type attacks and has Haze for setup sweepers. Pokemon such as Landorus, Mega Charizard Y, and Moltres can help Zapdos deal with Steel-types such as Ferrothorn and specially defensive Heatran.</p> "
      },
      {
        "name": "Specially Defensive (Flying)",
        "description": "<p>Specially defensive Zapdos is an excellent pick on Flying-type teams due to its ability to switch into threatening special attackers such as Choice Scarf Latias, Gengar, and Magnezone and provide Defog support for its teammates. Volt Switch helps Zapdos pivot and maintain momentum, while Discharge deals with Pokemon like Celesteela and Toxapex better and does not force Zapdos to switch out. Heat Wave hits Steel-types like Excadrill and Ferrothorn. Toxic can be used on teams with reliable way of dealing with Steel-types, as it helps put threats like Diggersby and Garchomp on a timer, which otherwise can deal with Zapdos's other moves, and deals with walls like Porygon2. Heavy-Duty Boots allows Zapdos to safely switch in throughout the battle without worrying about its Stealth Rock weakness. Defog in conjunction with Pressure can stall out Stealth Rock's PP. Static is an alternative to have an easier time spreading paralysis, especially in conjunction with Discharge. 80 Speed EVs along with a Timid nature helps Zapdos outspeed Pokemon such as Jolly Diggersby, maximum Speed Heatran, and Tapu Bulu. Maximum HP investment and 176 Special Defense EVs allows Zapdos to take multiple hits from Pokemon such as Gengar and Latias.</p> <p>All of Zapdos's teammates appreciates its Electric neutrality allowing it to switch in against special attacks like Thunderbolt from unboosted Mega Latios. Zapdos should try to come in on a predicted Stealth Rock use to decrease its PP, use Volt Switch to bring in teammates safely, and avoid getting statused or having its Heavy-Duty Boots removed by Knock Off. Stealth Rock-weak teammates such as Mega Aerodactyl and Mega Charizard Y greatly appreciate Defog support from Zapdos. Celesteela is a great partner alongside Zapdos, as it can switch in against Ice- and Rock-type attacks thanks to its excellent typing and wear down teams with Leech Seed and Toxic. Leech Seed's additional healing is also greatly appreciated by Zapdos. Mantine forms a great defensive core with Zapdos, with Mantine appreciating Zapdos's ability to switch in on Electric-type moves and Zapdos benefitting from Mantine tanking Ice-type moves. Mantine also switches into powerful Water-type attacks like Keldeo's Hydro Pump, and Zapdos running Defog allows Mantine to be less passive and run other moves such as Toxic. Haze from Mantine further helps Zapdos against setup sweepers. Pokemon like Mega Aerodactyl, Mega Charizard Y, and Landorus-T appreciates Zapdos's ability to bring them safely in with Volt Switch; in return, the former two can KO Ice-types, while the latter can KO Rock-types. Mega Aerodactyl can also Pursuit trap Pokemon such Victini and Trick Latios, which threatens Zapdos. Landorus and Mega Charizard Y help in breaking through walls, like Hippowdon and Heatran, for Zapdos, making it easier to wear down offensive threats. They also help in dealing with Poison- and Steel-types like Mega Venusaur and Ferrothorn if Zapdos is running Toxic over Heat Wave. Tornadus-T can also act as a secondary Defogger and forms a great pivoting core with Volt Switch Zapdos while also taking on Pokemon like Mega Venusaur, which Zapdos struggles with.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Electric analysis by", "members": [{"user_id": 481576, "username": "roxiee"}]}, {"name": "Flying analysis by", "members": [{"user_id": 475881, "username": "Thunder"}]}, {"name": "Quality checked by", "members": [{"user_id": 473171, "username": "DugZa"}, {"user_id": 491896, "username": "Rotten"}, {"user_id": 321991, "username": "Mateeus"}, {"user_id": 473171, "username": "DugZa"}]}, {"name": "Grammar checked by", "members": [{"user_id": 301217, "username": "Bandkrook"}, {"user_id": 449990, "username": "DC"}]}], "writtenBy": [{"user_id": 481576, "username": "roxiee"}, {"user_id": 475881, "username": "Thunder"}]}
  },
  "Dragonite": {"sets": [{"name": "Dragon Dance (Dragon)"}, {"name": "Choice Band (Dragon)"}]},
  "Crobat": {
    "comments": "<h1>Other Options</h1> <section><h1>Poison</h1> <p>Toxic is a niche option over Taunt or U-turn due to Crobat's high Speed allowing it to cripple threats like Kyurem and Landorus. However, Taunt and U-turn are almost always better.</p> </section><h1>Checks and Counters</h1> <section><h1>Poison</h1> <p><strong>Revenge Killers: Despite Crobat's amazing Speed tier, faster revenge killers like Choice Scarf Greninja and Mega Aerodactyl can easily take advantage of its mediocre defensive stats and KO it.</p> <p><strong>Super Effective Coverage: Crobat is susceptible to common Ice-, Psychic-, Electric-, and Rock-type Pokemon like Kyurem, Latios, Tapu Koko, and Mega Diancie, as they deal super effective damage to Crobat with their powerful STAB moves. Pokemon like Tapu Koko and Mega Diancie in particular also resist Brave Bird.</p> <p><strong>Status: Paralysis significantly hinders U-turn Crobat's ability to function as a reliable bulky and fast pivot on Poison teams and allows it to easily be outpaced by opposing threats, while burn halves the damage output of Brave Bird.</p> <p><strong>Steel-types</strong>: Most Steel-type Pokemon like Celesteela, Heatran, and Skarmory take very little damage from Brave Bird and can damage or cripple Crobat in return.</p> </section>",
    "sets": [
      {
        "name": "Utility (Poison)",
        "description": "<p>Despite facing competition from Galarian Weezing as a Defog user, Crobat's amazing Speed tier, access to U-turn and Taunt, and ability to better deal with threats like Mega Gallade and Choice Scarf Excadrill make it a great utility Pokemon for Poison teams. Brave Bird deals with major threats to Poison teams in the form of Mega Gallade and Mega Pinsir. Defog allows Crobat to remove entry hazards like Stealth Rock and Spikes for its teammates, while Roost serves as reliable recovery, providing longevity for Crobat throughout the game. Taunt allows Crobat to pressure walls like Blissey and Hippowdon by blocking recovery while also preventing utility Pokemon such as Swampert and Klefki from setting up hazards and using all sorts of status moves. Taunt also ensures Toxapex's Toxic Spikes stays up against opposing Defog users like Staraptor. U-turn can be opted over Taunt, improving Crobat as a fast pivot instead. Heavy-Duty Boots prevents Crobat from taking Stealth Rock damage upon entry. 192 Speed EVs along with a Jolly nature allow Crobat to outspeed key threats like Greninja, Tornadus, and Alakazam, while 48 Attack EVs ensure that it OHKOes Mega Gallade with 4 Defense EVs after Stealth Rock damage. 252 HP EVs and the remaining EVs going in Defense increase Crobat's bulk.</p> <p>All of Crobat's teammates appreciate Crobat's Ground immunity Defog. Toxapex provides a great defensive switch-in against a majority of attacks directed at Crobat, notably resisting Ice. Toxapex can also provide Haze and Toxic Spikes support. Mega Venusaur is a great teammate for Crobat, dealing with Electric-type attack and Pokemon like Tapu Koko and Rotom-W that threaten it. Mega Venusaur can also act as a reliable secondary Ground-type switch-in, and, together with Toxapex, is able to provide an extremely reliable defensive core that may switch into almost any attack directed at Crobat. Drapion and Alolan Muk act as the much needed sources of Psychic immunity, additionally being able to Pursuit trap and defeat threatening Psychic-types for Crobat, like Choice Scarf Latios and Tapu Lele. They can also aid greatly in the Ghost-type matchup by safely switching into and Pursuit trapping threats like Gengar and Blacephalon. Drapion can also provide Toxic Spikes support, while Alolan Muk can opt for a Curse set which is an extremely effective late-game sweeper. Nidoking is an excellent special wallbreaker that is able to beat the Steel-types like Ferrothorn and Heatran that wall Crobat while serving as the best source Electric immunity Poison has to offer. Nihilego is a great asset in the Flying matchup and is the best available Choice Scarf user for Poison-type teams. Lastly, Assault Vest Galarian Slowking reliably checks some key threats like Kyurem and Choice Specs Zapdos that otherwise pose a significant threat to Crobat and Poison teams more broadly.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Poison analysis by", "members": [{"user_id": 473171, "username": "DugZa"}]}, {"name": "Quality checked by", "members": [{"user_id": 321991, "username": "Mateeus"}, {"user_id": 305839, "username": "maroon"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 473171, "username": "DugZa"}]}
  },
  "Azumarill": {
    "comments": "<h1>Other Options</h1> <section><h1>Fairy</h1> <p>Azumarill can opt to run Sitrus Berry if a different teammate like Tapu Bulu runs a Z-Crystal. However, Normalium Z is the more reliable way to ensure it successfully uses Belly Drum. Azumarill can also chose to run Brick Break in lieu of Play Rough, as it better deals with Steel-type Pokemon, namely Melmetal, which otherwise withstands any of Azumarill's attacks even after Belly Drum. Substitute may be used over Play Rough in order to let Azumarill set up on Pokemon that rely on status moves to deal with it, like Torkoal and Mega Sableye, but Play Rough is generally preferred due to it hitting useful targets. Return along with a Jolly nature can be used to better deal with Galarian Weezing and Mega Venusaur, significantly improving the Poison-type matchup.</p> </section><h1>Checks and Counters</h1> <section><h1>Fairy</h1> <p><strong>Water-resistant Pokemon: Pokemon that resist Azumarill's Aqua Jet such as Latios and Serperior can withstand Aqua Jet even after Belly Drum and KO Azumarill with their STAB moves or super effective coverage options. Even many walls that resist Water, like Mega Venusaur, Celebi, and Rotom-W, can outspeed Azumarill and KO it with super effective STAB moves before Azumarill can use Knock Off or Play Rough.</p> <p><strong>Haze Users and Phazers: Mantine can outspeed Azumarill and remove its boosts with Haze, while Azumarill fails to reliably set up Belly Drum against Toxapex, as it removes the move's boosts with Haze and proceeds to easily deal with unboosted Azumarill. In the same vein, Azumarill fails to reliably set up against phazers like Hippowdon and Skarmory.</p> <p><strong>Status: All status conditions significantly hinder Azumarill's ability to act as a reliable offensive threat. Burn makes it significantly weaker, paralysis prevents it from outspeeding threats like Porygon2 it otherwise would, and poison puts it on a timer, wearing it down quickly in conjunction with Belly Drum's health drop.</p> <p><strong>Psychic Terrain: Due to Azumarill's below average Speed stat, it heavily relies on Aqua Jet. As a result, Tapu Lele's Psychic Terrain can hamper Azumarill greatly and make it much more easily revenge killed.</p> </section>",
    "sets": [
      {
        "name": "Belly Drum (Fairy)",
        "description": "<p>An amazing Attack stat thanks to Huge Power, access to priority in Aqua Jet and Belly Drum to further take advantage of its amazing Attack stat, and a decent typing cement Azumarill as an effective physical attacker that helps greatly in matchups such as Fire, Ground, and Steel. Aqua Jet allows it to deal with faster threats like Volcarona and Mamoswine, making up for its subpar Speed stat. Knock Off hits Psychic- and Ghost-types like Jirachi and Aegislash for super effective damage, and it's able to OHKO Steel-types like Ferrothorn and Celesteela and bulky walls like Toxapex with minor or no chip damage after Belly Drum. Play Rough is a stronger STAB option that deals with Dragon- and Dark-types such as Kommo-o and Mandibuzz. Maximum Speed EVs make Azumarill as fast as possible, outspeeding threats such as Dragalge and Melmetal. Normalium Z is Azumarill's preferred item, as it nullifies chip damage taken prior to using Belly Drum while also preventing Azumarill from being crippled by Knock Off, as opposed to Sitrus Berry. The added perk of Normalium Z is that Azumarill can use Belly Drum without it to use Z-Belly Drum later, either recovering its HP back to full if it didn't switch out.</p> <p>Klefki pairs up exceptionally well with Azumarill. Klefki acts as a much needed Poison immunity and provides dual screens support and Spikes support, the former allowing Azumarill to set up more easily and the latter chipping down foes for it. Tapu Koko helps greatly in the Flying- and Water-type matchups, while Mega Diancie is able to bounce off entry hazards as well as status moves directed at Azumarill. Mega Diancie can also provide Stealth Rock support, which helps it further improve the Fire- and Flying-type matchups, and aid in matchups like Poison, Steel, and Electric thanks to a wide range of coverage options in Psychic, Mystical Fire, and Earth Power. Tapu Bulu is a great asset in the Water-, Electric- and Ground-type matchups. Tapu Lele is not only a great wallbreaker when equipped with a Choice Specs, but also a great help against Poison-types such as Mega Venusaur and Galarian Weezing that threaten Azumarill. Mimikyu helps greatly in the Ghost- and Psychic-type matchups, dealing with Pokemon like Aegislash and Tapu Lele. Lastly, Togekiss synergizes well with Azumarill, as it deals with Grass-types troublesome to Azumarill, like Mega Venusaur and Ferrothorn, while Azumarill in return deals with Rock-type threats to Togekiss.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Fairy analysis by", "members": [{"user_id": 473171, "username": "DugZa"}]}, {"name": "Quality checked by", "members": [{"user_id": 491896, "username": "Rotten"}, {"user_id": 305839, "username": "maroon"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 473171, "username": "DugZa"}]}
  },
  "Steelix": {
    "comments": "<h1>Other Options</h1> <section><h1>Ground</h1> <p>Mega Steelix can opt for a Careful nature over an Impish nature for increased special bulk against threats like Latios at the cost of some physical bulk on teams that have more reliable ways to deal with Azumarill.</p> </section><h1>Checks and Counters</h1> <section><h1>Ground</h1> <p><strong>Steel-resistant Pokemon: Most Steel-resistant Pokemon such as Heatran, Toxapex, and Ferrothorn have little to no trouble switching in against Mega Steelix and can easily take advantage of Heavy Slam being its only attacking move.</p> <p><strong>Water-types: Water-type Pokemon such as Mega Slowbro, Keldeo, and Suicune can freely switch in against Mega Steelix, take very little damage from Heavy Slam, and threaten to use Mega Steelix as setup bait. Even water-types that can't set up like Kingdra can easily deal with Mega Steelix with their super effective STAB moves, especially if they're special attackers.</p> <p><strong>Special Wallbreakers: Due to its mediocre Special Defense stat, strong special attackers such as Landorus and Volcarona can OHKO Mega Steelix with ease.</p> <p><strong>Stallbreakers: Stallbreakers such as Mew and Gliscor easily break through Mega Steelix, as it heavily relies on its utility moves in Curse, Rest, and Sleep Talk. Taunt from either can completely shut down Mega Steelix, while Mew can also threaten to burn it with Will-O-Wisp.</p> <p><strong>Haze and Phazers: As Mega Steelix heavily relies on Curse boosts, common Haze users such as Toxapex and Mantine and phazers such as Hippowdon and Skarmory disrupt its attempts to sweep.</p> </section>",
    "sets": [
      {
        "name": "Curse (Ground)",
        "description": "<p>An unparalleled Defense stat, a great defensive typing, and access to Curse make Mega Steelix a strong defensive setup sweeper in the Monotype metagame, easily dealing with Fairy, Normal, and Dragon teams. In conjunction with Mega Steelix's sky-high Defense stat, a single Curse boost allows it to survive attacks such as V-create from Choice Band Victini and Close Combat from +2 Mega Gallade. Heavy Slam nails Fairy-types like Tapu Bulu and Mega Diancie while dishing out large amounts of damage against neutral targets, allowing it to deal with most of the tier after a few boosts. Rest allows Mega Steelix to maintain longevity and cure any burns when against passive Pokemon such as Mandibuzz, Mega Sableye, and Klefki. Sleep Talk synergizes well with Rest, allowing it to potentially further set up with Curse or fire off a powerful Heavy Slam even when asleep, preventing foes from taking advantage of Rest. Due to its already sky-high Defense stat, maximum HP and Special Defense EVs are invested to increase Mega Steelix's special bulk, allowing it to better deal with special attackers like Latios and Alolan Ninetales. An Impish nature is used to ensure Mega Steelix survives a +6 Aqua Jet from Azumarill, KOing it back with Heavy Slam.</p> <p>Gastrodon and Seismitoad act as great teammates, as they both provide a much needed immunity to Water-type attacks and are able to deal with threats to Mega Steelix, such as Mega Slowbro and Mantine. Landorus synergizes well with Mega Steelix, as it comfortably deals with some of Mega Steelix's checks in Toxapex, Ferrothorn, and Heatran while also acting as a great special wallbreaker. Mamoswine can deal with troublesome Ground-, Flying- and Dragon-type Pokemon such as Landorus, Zapdos, and Garchomp while also providing a form of priority thanks to Ice Shard. Nidoking works well with Mega Steelix, as it can better address the threat posed by Steel- and Flying-types that deal with Mega Steelix, such as Ferrothorn and Celesteela, by virtue of its wide coverage boosted by Sheer Force. Excadrill provides a way to check faster foes such as Cinderace and also deals with offensive threats such as Heatran while providing secondary hazard control thanks to Rapid Spin; it is also able to act as reliable wallbreaker with Swords Dance. Garchomp can form a strong physical wallbreaker core in tandem with Mega Steelix, since Swords Dance lets it break past some of Mega Steelix's checks in Mantine and Toxapex. Gliscor can cripple both offensive and defensive Pokemon thanks to Knock Off and Taunt, which Mega Steelix appreciates greatly, while also removing troublesome Spikes with Defog. Hippowdon can be a great teammate, as it sets up sand, activating Mega Steelix's Sand Force, while also providing Stealth Rock support.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Ground analysis by", "members": [{"user_id": 473171, "username": "DugZa"}]}, {"name": "Quality checked by", "members": [{"user_id": 305839, "username": "maroon"}, {"user_id": 321991, "username": "Mateeus"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "martha"}, {"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 473171, "username": "DugZa"}]}
  },
  "Scizor": {
    "comments": "<h1>Other Options</h1> <p>Bug</p> <p>U-turn as an option over Bug Bite or Dual Wingbeat can hit hard and generate momentum simultaneously, but Mega Scizor usually prefers the latter one because of its wallbreaking capabilities.</p> <h1>Checks and Counters</h1> <p>Bug</p> <p><strong>Fire-types and Fire-type Coverage: Fire-types such as Cinderace and Victini can very easily take care of Mega Scizor, as they can shrug off Bullet Punch and OHKO it due to its massive weakness to Fire. Additionally, Pokemon that use Fire-type coverage moves like Dragonite, Garchomp, and Mega Venusaur can also beat Mega Scizor.</p> <p><strong>Status: Being a physical attacker, Mega Scizor is highly susceptible to burns, since it halves its Attack stat and makes it much more easier to handle. Pokemon such as Galarian Corsola and Mega Sableye as well as Scald burns from Toxapex are some things Mega Scizor should watch out for. Paralysis also cripples Mega Scizor, forcing it to use its coverage moves last.</p> <p><strong>Physically Defensive Pokemon: Sturdy physical walls like Porygon2 and Toxapex can take care of Mega Scizor rather easily with Hidden Power Fire from the former and Haze or Scald burn from the latter. However, Porygon2 should watch out for a boosted Superpower, while Toxapex should be careful of boosted Dual Wingbeat, which cleanly 2HKOes it.</p> <p>**Steel-types **: Mega Scizor has a lot of trouble getting past certain Steel-types like Celesteela, Skarmory, and Magnezone. Celesteela and Skarmory can beat it with Flamethrower and Whirlwind + Rocky Helmet chip damage, respectively, while Magnezone can trap and beat it with Hidden Power Fire.</p> <p><strong>Zapdos: Zapdos is a good check to Mega Scizor, as it resists all of its moves except Knock Off, which does not OHKO it after a Swords Dance boost, and it can cleanly OHKO Mega Scizor with Heat Wave.</p> ",
    "sets": [
      {
        "name": "Offensive Swords Dance (Bug)",
        "description": "<p>Its high Attack stat, great defensive typing, good overall bulk, and priority STAB in Bullet Punch alongside Swords Dance make Mega Scizor a threatening setup sweeper. Swords Dance allows Mega Scizor to boost its already great Attack stat to even greater heights, making it capable of threatening types like Fairy, Normal, and Dragon after a single boost. A STAB move in priority Bullet Punch, which is further boosted by its ability Technician, allows it to sweep teams easily once boosted. Additionally, it also lets Mega Scizor bypass its mediocre Speed stat and take care of faster Pokemon like Landorus, Tapu Koko, and Mega Medicham. Bug Bite lets Mega Scizor deal with Pokemon that resist Bullet Punch such as Rotom-W, Gastrodon, and Swampert. Dual Wingbeat is an option that allows Mega Scizor to score crucial rolls such as the 2HKO on Toxapex, OHKO on Mega Venusaur at +2, and OHKO on Keldeo and Urshifu-R while unboosted. Superpower when boosted lets Mega Scizor deal with some of its checks like Skarmory, Celesteela, and Porygon2. Knock Off can be used as well to remove items from defensive Pokemon such as Porygon2 and Galarian Corsola, which makes it easier for Mega Scizor to deal with them late-game. Knock Off also hits Aegislash hard, which otherwise takes little damage from its other moves. Maximum Attack investment with an Adamant nature allows Mega Scizor to hit as hard as possible, whereas maximum Speed investment lets it outspeed Pokemon such as Mandibuzz and Rotom-W. Scizorite as item lets Scizor Mega Evolve to gain additional bulk and power.</p> <p>Volcarona appreciates Mega Scizor as a teammate greatly, since Mega Scizor can deal with special walls and faster Rock-types such as Blissey, Tyranitar, and Nihilego, respectively, that can be an obstacle for Volcarona. In return, Volcarona takes care of Steel-types such as Corviknight, Celesteela, and Skarmory that are hard for Mega Scizor to get past. It can also specifically beat Zapdos, which otherwise checks Mega Scizor comfortably. Araquanid can sponge Fire-type attacks aimed at Mega Scizor from Pokemon such as Heatran, Mega Charizard Y, and Volcarona while also providing Sticky Web support so that Mega Scizor can outspeed more threats. Buzzwole and Heracross with a Choice Scarf and Stone Edge can take on threats like Choice Band Victini and Mega Charizard Y for the team, and they also appreciate Mega Scizor breaking down walls like Hippowdon when boosted by Swords Dance and make cleaning late-game much easier for the aforementioned revenge killers. Galvantula does well against Water- and Flying-type teams that are usually a trouble for Mega Scizor; it can provide Sticky Web support, too. Forretress can provide entry hazard support in the form of Stealth Rock, Spikes, and Toxic Spikes while also providing hazard removal in the form of Rapid Spin and Volt Switch support to bring Mega Scizor safely into the battle. Guts Heracross as a teammate can soften walls like Mandibuzz and Toxapex for an easier Mega Scizor sweep while absorbing troublesome burns for it.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 321991, "username": "Mateeus"}, {"user_id": 473171, "username": "DugZa"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}]}], "writtenBy": [{"user_id": 320110, "username": "Harpp"}]}
  },
  "Shuckle": {
    "comments": "<h1>Other Options</h1> <section><h1>Rock</h1> <p>Shuckle may opt to run Toxic to cripple walls like Mantine and Porygon2. However, it comes at the cost of forgoing Encore, which prevents Shuckle from being used as setup bait.</p> </section><h1>Checks and Counters</h1> <section><h1>Rock</h1> <p><strong>Magic Bounce: Magic Bounce users like Mega Diancie and Mega Sableye bounce off all of Shuckle's utility moves and take little to no damage whatsoever from Knock Off. While Mega Diancie needs to be wary of a full HP Final Gambit, Mega Sableye is completely immune to it, therefore always beating Shuckle.</p> <p><strong>Taunt Users: Taunt users like Hydreigon, Mew, and Gliscor prevent Shuckle from setting up any entry hazards after Mental Herb has been used. However, Shuckle in return threatens to remove Toxic Orb from Gliscor with Knock Off.</p> <p><strong>Steel-types: Steel-type Pokemon such as Excadrill and Mega Scizor deal with Shuckle with ease. Excadrill in particular can get rid of any entry hazards set up by Shuckle, and it also ignores Sturdy due to Mold Breaker. However, they need to be wary of Encore when using Swords Dance.</p> <p><strong>Water-types: Water-type Pokemon like Tapu Fini and Urshifu-R can deal with Shuckle without much trouble. Tapu Fini can at least prevent Stealth Rock from going up due to Taunt, while Choice Band Urshifu-R can threaten to OHKO Shuckle with Surging Strikes, as it renders Sturdy useless. Other Water-types, like Keldeo, can easily defeat Shuckle with their super effective STAB moves.</p> </section>",
    "sets": [
      {
        "name": "Utility (Rock)",
        "description": "<p>Shuckle plays an integral role on every Rock team due to its access to Sticky Web and the ability to reliably set it up against most Pokemon due to its access to Sturdy, paving the way for Rock's only viable playstyle, Sticky Web Offense. Sticky Web drops foes' Speed by one stage, which greatly benefits Shuckle's teammates such as Terrakion, Nihilego, and Mega Diancie and allows them to deal with faster threats such as Choice Scarf Excadrill and Greninja. Stealth Rock helps wear down foes upon switch in, most notably breaking Focus Sash and Sturdy from Pokemon such as Cloyster and Skarmory. Encore prevents setup sweepers such as Mega Gallade, Azumarill, and Volcarona from using Shuckle as setup bait. It also helps deal with defensive walls like Toxapex by forcing them into using utility moves. Knock Off helps get rid of items such as Heavy-Duty Boots, Eviolite, and Choice Scarf from Pokemon like Blissey, Porygon2, and Landorus-T. Removing Heavy-Duty Boots also further improves the effectiveness of the hazards Shuckle sets. Final Gambit can be opted for over Encore, as it provides great momentum gain after hazards are set up. Mental Herb allows Shuckle to ignore Taunt from Pokemon such as Aerodactyl, Cobalion, and Tapu Fini for a single turn allowing it to reliably set up at least one entry hazard. 248 HP EVs and 252 Defense EVs along with an Impish nature maximizes Shuckle's physical bulk and minimizes damage taken by Stealth Rock. Sturdy ensures Shuckle survives a hit from full HP, allowing it to set up hazards against powerful wallbreakers like Choice Specs Aegislash.</p> <p>Mega Diancie pairs well with Shuckle, bouncing off entry hazards and Taunt while also being able to make the most of Shuckle's Sticky Web and Stealth Rock support. The former helps Mega Diancie outspeed threats such as Choice Scarf Excadrill and Mega Lopunny, while the latter chips threats, allowing it to successfully net more KOs. Much like Mega Diancie, Choice Scarf Terrakion appreciates Shuckle reliably setting up Sticky Web to outspeed faster threats, such as Sand Rush Excadrill and Choice Scarf Greninja. Terrakion can also run Swords Dance to make the most out of Sticky Web, as Swords Dance further improves its wallbreaking abilities and helps greatly in matchups such as Steel and Normal. Nihilego can be a threatening teammate against Fairy, Flying, and Water teams when paired with Shuckle's entry hazards thanks to a great ability in Beast Boost and a wide range of coverage options. Tyranitar can provide sand support, bolstering Shuckle's already high Special Defense stat, allowing it to take special hits better, while also improving the Psychic and Ghost matchups greatly due to its STAB-boosted Crunch and Pursuit. Alolan Golem pairs well with Shuckle thanks to an amazing ability in Magnet Pull, allowing it to deal with threats such as Mega Scizor, which it even outspeeds after Sticky Web. Shell Smash Omastar appreciates hazards set up by Shuckle, as they allow it to outspeed most threats and not worry about Sturdy and Focus Sash.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Rock analysis by", "members": [{"user_id": 473171, "username": "DugZa"}]}, {"name": "Quality checked by", "members": [{"user_id": 305839, "username": "maroon"}, {"user_id": 321991, "username": "Mateeus"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "martha"}, {"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 473171, "username": "DugZa"}]}
  },
  "Corsola-Galar": {
    "comments": "<h1>Other Options</h1> <section><h1>Ghost</h1> <p>Haze can be run in order to discourage setup sweepers such as Volcarona and Mega Latias from setting up on Galarian Corsola with ease. However, it is extremely hard to use over other useful moves like Will-O-Wisp or Strength Sap.</p> </section><h1>Checks and Counters</h1> <section><h1>Ghost</h1> <p><strong>Super Effective Coverage: Dark- and Ghost-types such as Hydreigon, Gengar, and Aegislash threaten Galarian Corsola by heavily damaging it with their super effective moves.</p> <p><strong>Stallbreakers: Stallbreakers such as Bulk Up Zarude, Gliscor, and Kommo-o completely shut down Galarian Corsola by disabling its status moves and denying recovery, forcing it out or making it forced to use Night Shade.</p> <p><strong>Magic Bounce: Magic Bounce users such as Mega Diancie, Mega Sableye, and Hatterene shut down Galarian Corsola by reflecting its status moves, preventing it from recovering with Strength Sap or crippling foes with Will-O-Wisp.</p> <p><strong>Powerful Wallbreakers: While Galarian Corsola's bulk is impressive, it is nailed by very powerful wallbreakers such as Choice Specs Kyurem and Mega Charizard Y.</p> <p><strong>Knock Off: Knock Off users such as Zeraora, Pelipper, and Mamoswine can threaten Galarian Corsola by removing its Eviolite, making it significantly easier to deal with.</p> <p><strong>Poison: Toxic from Pokemon such as Zapdos, Celesteela, and Gastrodon can significantly wear down Galarian Corsola during a match, limiting its ability to check foes consistently.</p> </section>",
    "sets": [
      {
        "name": "Physically Defensive (Ghost)",
        "description": "<p>Galarian Corsola serves as one of Ghost's primary walls due to its excellent Eviolite-boosted bulk and great utility moves in Night Shade, Will-O-Wisp, and Strength Sap, letting it handle threatening physical attackers such as Excadrill, Mega Lopunny, and Garchomp. Additionally, it compresses the role of a valuable entry hazard setter with Stealth Rock. Night Shade prevents Galarian Corsola from being completely passive, breaking Substitute from foes like Zapdos and Calm Mind Keldeo while wearing down foes like Excadrill and Garchomp much more quickly. Will-O-Wisp inflicts burns on physical attackers like Mega Swampert, Dragonite, and Mega Aerodactyl, making it much easier to deal with them. Strength Sap also cripples the aforementioned physical attackers while providing Galarian Corsola with a source of recovery. Cursed Body can be potentially useful in order to disable strong attacks that may defeat Galarian Corsola. Maximum HP and Defense investment with a Bold nature is needed in order to handle the likes of Choice Band Excadrill, Galarian Darmanitan, and Terrakion better. Galarian Corsola is extremely vulnerable to Knock Off, so it should be wary of switching into users that carry it like Zeraora, Mega Gallade, and Landorus-T.</p> <p>All teammates appreciate Galarian Corsola's ability to take on dangerous physical attackers while setting Stealth Rock. Mega Sableye forms a great defensive core with Galarian Corsola, as it provides a useful Dark neutrality, absorbs Knock Off, and prevents entry hazards like Spikes and Toxic Spikes from being set with Magic Bounce. Additionally, it deals with foes like Nidoking, Blacephalon, and SubToxic Aegislash. Mimikyu is an amazing teammate, as it helps greatly in the Dark and Dragon matchups by pressuring foes like Mandibuzz, Mega Sableye, and Kommo-o for Galarian Corsola. Swords Dance Aegislash can defeat opposing walls that Galarian Corsola struggles to deal with, like Porygon2 and Blissey, making it an amazing partner. SubToxic Aegislash can be used instead to provide a way to deal with special attackers like Kyurem, Tapu Lele, and Choice Specs Latios. Choice Specs Gengar is a great wallbreaker that breaks apart opposing walls such as Toxapex, Heatran, and Mega Venusaur while absorbing Toxic Spikes for Galarian Corsola. Choice Scarf Blacephalon is a useful revenge killer that forces out threatening Steel-types such as Ferrothorn, Celesteela, and Mega Scizor while outspeeding major threats to Galarian Corsola such as Zarude and Tapu Koko.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Ghost analysis by", "members": [{"user_id": 491896, "username": "Rotten"}]}, {"name": "Quality checked by", "members": [{"user_id": 305839, "username": "maroon"}, {"user_id": 473171, "username": "DugZa"}]}, {"name": "Grammar checked by", "members": [{"user_id": 262594, "username": "Milak"}]}], "writtenBy": [{"user_id": 491896, "username": "Rotten"}]}
  },
  "Porygon2": {
    "comments": "<h1>Other Options</h1> <section><h1>Normal</h1> <p>Porygon2 can run Toxic over Hidden Power Fire or Teleport to pose an even bigger threat versus Water-, Flying-, and Ground-type teams by crippling Slowking, Zapdos, and Gastrodon, respectively. However, losing either standard move isn't desired. With Trace, Foul Play can be used over Discharge as a way to broadly check setup sweepers, but Discharge's coverage and paralysis chance are greatly appreciated, and the sweepers it checks can be dealt with Ditto or Porygon2's other moves.</p> </section><h1>Checks and Counters</h1> <section><h1>Normal</h1> <p><strong>Status: Toxic poison puts Porygon2 on a timer, greatly reducing its overall effectiveness as a wall. Burns, while much less of an issue, still hamper Porygon2's defensive capabilities by taking away its health continuously due to its lack of passive recovery.</p> <p><strong>Knock Off and Trick</strong>: Knock Off users like Bisharp and Mega Sableye remove Porygon2's Eviolite, diminishing its sky-high bulk and making it much more vulnerable. In addition to doing that, Trick from Choice-locked Pokemon like Latios and Blacephalon also locks Porygon2 into a single move, turning it into a liability.</p> <p><strong>Stallbreakers: Stallbreakers like Taunt Mew and SubToxic Zapdos can easily beat Porygon2 by either disabling its Recover or PP stalling it.</p> <p><strong>Powerful Wallbreakers: Although Porygon2's insane bulk on both sides lets it take on most wallbreakers, extremely powerful ones like Choice Band Victini and Choice Specs Tapu Lele easily shred it by scoring clean 2HKOes with their STAB moves.</p> <p><strong>Fighting-types: Fighting-types like Terrakion and Mega Gallade are able to easily take down Porygon2 by virtue of their STAB super effective attacks. However, Porygon2 is able to take a hit from most and retaliate with paralysis from Discharge.</p> <p><strong>Setup Sweepers: Certain setup sweepers like Mega Latias and Mega Gallade use Porygon2 as setup fodder, easily powering through it once they rack up a few boosts.</p> </section>",
    "sets": [
      {
        "name": "The Duck (Normal)",
        "description": "<p>Porygon2 is the premier physically defensive wall available for Normal teams due to its combination of stellar bulk, reliable recovery, and a movepool that's able to keep important threats in check. Recover is Porygon2's go-to move, allowing it to stay healthy and provide its utility throughout the match. Ice Beam works as Porygon2's main attack, keeping key Ice-weak targets like Dragonite, Gliscor, and Landorus-T at bay. Discharge has a decent chance to cripple the opposition with paralysis while dealing good damage to Pokemon such as Pelipper, Celesteela, and Gyarados. It also forms the BoltBeam coverage alongside Ice Beam, which is capable of heavily denting Flying teams. Hidden Power Fire rounds off the set, enabling Porygon2 to nail Steel-types that take little from its other moves like Ferrothorn, Mega Scizor, and Mega Steelix. Alternatively, Teleport allows Porygon2 to work as a defensive pivot, generating momentum for the team at the cost of further coverage. Download is the preferred ability for Porygon2, reducing its overall passiveness and further threatening Flying-, Water-, Dragon-, and Steel-type teams should it get a Special Attack boost. However, one can opt for Trace to copy and take advantage of defensive abilities like Toxapex's Regenerator, Dragonite's Multiscale, and Landorus-T's Intimidate. Max HP and Defense investments in tandem with a Bold nature and Eviolite bolster Porygon2's physical bulk, permitting it to shrug assaults from the likes of Mega Sharpedo and Choice Band Excadrill. Eviolite in particular also lets Porygon2 take special attacks from Pokemon like Nidoking and Hydreigon with relative ease, despite the lack of EVs in Special Defense.</p> <p>Together, Blissey and Porygon2 form a stellar defensive core for Normal teams that can stop most attackers in their tracks. Blissey can comfortably stomach attacks from special wallbreakers like Landorus and Mega Charizard Y that easily bypass Porygon2 and absorb status aliments for it by virtue of Natural Cure. In return, Porygon2 takes on powerful physical attackers like Dragonite and Mega Sharpedo for Blissey, and the pair can form an extremely effective pivoting backbone should Porygon2 be running Teleport. Ditto is an excellent teammate as well, as it can easily revenge kill sweepers that may use Porygon2 as setup fodder such as Swords Dance Excadrill and Z-Belly Drum Azumarill. It also switches into walls that beat Porygon2 one-on-one like Mega Sableye and Blissey by copying themselves and, thus, their status move immunities. Wallbreakers like Mega Lopunny and Diggersby greatly appreciate Porygon2's bulk to shrug off priority moves and its Teleport for them to come into the field safely. In return, they can beat threats to Porygon2 like Heatran, Mega Sableye, and Tyranitar. Mega Lopunny can also absorb Knock Offs for Porygon2. Defog users like defensive Staraptor and Mega Pidgeot remove entry hazards, allowing Porygon2 to better perform its walling and support duties by coming into the field unscathed. The former also takes hits from dangerous Fighting-types like Infernape and Heracross for Porygon2 and brings it safely into the field with U-turn, while the latter revenge kills Fighting-types and threatens Steel-types like Bisharp and Ferrothorn. Lastly, Porygon-Z's wide array of possible coverage moves allows it to threaten Psychic-types and certain Steel-types Porygon2 struggles dealing with.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Normal analysis by", "members": [{"user_id": 321991, "username": "Mateeus"}]}, {"name": "Quality checked by", "members": [{"user_id": 473171, "username": "DugZa"}, {"user_id": 305839, "username": "maroon"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 321991, "username": "Mateeus"}]}
  },
  "Blissey": {
    "comments": "<h1>Other Options</h1> <p><strong>Normal</strong></p> <p>Thunder Wave sounds appealing to cripple offensive threats like Gengar and Kommo-o that can switch in freely on Blissey. However, using it means giving up Stealth Rock utility, and most Thunder Wave targets are halted just as well by Toxic. Aromatherapy or Heal Bell lets Blissey act as a cleric for the team, but Blissey can just absorb status via Natural Cure anyways.</p> <h1>Checks and Counters</h1> <p><strong>Normal</p> <p><strong>Fighting-types</strong>: Fighting-types like Mega Gallade and Terrakion can OHKO Blissey with no problem at all while not fearing anything from it bar the rare Thunder Wave.</p> <p><strong>Ghost-types: Ghost-types like Mimikyu and Alolan Marowak are immune to Seismic Toss, meaning Toxic-less Blissey can do nothing to them but Teleport out. Mega Sableye and Gengar deserve a special mention because they're immune to both Seismic Toss and Toxic while being able to remove Blissey's Heavy-Duty Boots with Knock Off and Trick, respectively.</p> <p><strong>Setup Sweepers: Setup sweepers like Mega Scizor, Dragonite, and Tapu Fini typically use Blissey as setup fodder and can proceed to easily break through it.</p> <p><strong>Physical Wallbreakers: Powerful physically-oriented wallbreakers like Tapu Bulu, Galarian Darmanitan, and Victini all bypass Blissey with ease due to its only average physical bulk.</p> <p><strong>Stallbreakers: Common stallbreakers like Mew and Gliscor can render Blissey's status moves useless with Taunt and easily recover off Seismic Toss damage.</p> <p><strong>Trick and Knock Off: Trick users like Latios and Blacephalon minimize Blissey's utility throughout the match by restricting it with a Choice item. Knock Off removes Heavy-Duty Boots from Blissey, making it vulnerable to entry hazard chip and, thus, hindering its effectiveness as a defensive pivot.</p> ",
    "sets": [
      {
        "name": "The Blob (Normal)",
        "description": "<p>Thanks to its colossal HP, sky-high special bulk, and wide array of utility moves, Blissey is one of the best walls in the National Dex Monotype metagame and a must-have on balanced Normal teams. Teleport turns Blissey into an incredibly good defensive pivot as well, taking advantage of its ability to switch into special attackers it walls, like Greninja and Nidoking, to maintain momentum for the team by bringing attackers in safely. Soft-Boiled increases Blissey's longevity, allowing it to support its team throughout the match. Seismic Toss deals consistent damage, enabling Blissey to weaken most of the threats it walls while making it not fully stopped by Taunt. Lastly, Stealth Rock weakens opposing teams gradually, which helps offensive Pokemon like Diggersby and Mega Lopunny net crucial KOs. However, Toxic can be used to further diminish Blissey's passiveness by heavily crippling defensive and offensive threats alike, such as Zapdos and Hydreigon. Maximum HP and Defense investments with a Bold nature are needed to patch Blissey's physical frailty, ensuring it can comfortably shrug weaker physical hits from the likes of Choice Scarf Excadrill and Mega Diancie. Natural Cure lets Blissey absorb status aliments for the team. Heavy-Duty Boots prevents entry hazard damage, which gives Blissey better Teleport pivoting that sets it apart from the bulkier Chansey.</p> <p>All of Blissey's teammates appreciate its supportive and slow pivoting capabilities. Porygon2 stands out as Blissey's best partner because it can easily soak physical hits Blissey is unable to, including from threats like Mega Sharpedo and Mega Scizor, while also being able to pivot out with Teleport. In return, Blissey absorbs status for Porygon2 and takes on special threats that bypass it such as Landorus and Volcarona, making the pair a formidable defensive backbone for Normal teams. Defensive Staraptor is also a good teammate given it switches in on physical Fighting-types such as Terrakion and Infernape for Blissey. It also has access to U-turn to keep momentum in tandem with Blissey's Teleport. Ditto patches Blissey's general vulnerability to setup sweepers like Dragonite and Cloyster by KOing them after it gets brought into the field via Teleport. It also helps Blissey massively against walls that beat it one-on-one like Celesteela and Toxic Toxapex. Mega Lopunny can threaten Ghost-types like Mega Sableye with its access to Scrappy, and Mega Pidgeot beats most Fighting-types that threaten Blissey such as Mega Gallade. Both Mega Pokemon can also form a pivoting core with Blissey due to their fast U-turns and moves to threaten Steel-types like Ferrothorn. Wallbreakers like Diggersby and Heliolisk all appreciate Blissey bringing them safely into the field with Teleport and weakening their targets with its Stealth Rock or Toxic support. In the same vein, Porygon-Z can more easily pull off a sweep with Blissey's aforementioned perks.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Normal analysis by", "members": [{"user_id": 321991, "username": "Mateeus"}]}, {"name": "Quality checked by", "members": [{"user_id": 305839, "username": "maroon"}, {"user_id": 473171, "username": "DugZa"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 321991, "username": "Mateeus"}]}
  },
  "Tyranitar": {
    "comments": "<h1>Other Options</h1> <section><h1>Dark</h1> <p>Rock Blast can be used over Rock Slide to break Substitute from Kyurem and Zapdos and prevents PP stalling. Toxic and Protect can be used to spread status and wear down foes such as Porygon2 and Mantine.</p> </section><h1>Checks and Counters</h1> <section><h1>Dark</h1> <p><strong>Super Effective Attacks: Despite having boosted Special Defense in sand, Tyranitar can easily get overwhelmed by super effective attacks. Fighting-type attacks particularly will take down Tyranitar with ease, thus it is forced to switch out to a teammate such as Mega Sableye.</p> <p><strong>Status: Tyranitar can easily get worn down by poison, taken advantage of if its paralyzed, or have its Leftovers cancelled out by being burned.</p> <p><strong>Rock-resistant Pokemon</strong>: Pokemon such as Excadrill, Melmetal, and Gastrodon resist Tyranitar's main STAB attacks and force it out.</p> <p><strong>Physical Walls: Hippowdon, Porygon2, and Mega Venusaur take little damage from Tyranitar's STAB attacks and threaten to cripple or KO it, leaving Tyranitar vulnerable.</p> </section>",
    "sets": [
      {
        "name": "Specially Defensive (Dark)",
        "description": "<p>Tyranitar plays a pivotal role for Dark teams by acting as the primary Stealth Rock setter, helping break Focus Sash and Sturdy for its teammates and being able to tank most special attacks thanks to having a boosted Special Defense in sand. Rock Slide lets it take care of many threats to Dark teams such as Volcarona, Tornadus-T, and Mega Charizard Y. Heavy Slam gives Tyranitar the ability to take on Tapu Lele and Hatterene, while Fire Blast hits most Steel-type physical walls such as Ferrothorn, Skarmory, and Mega Scizor that would otherwise wall Tyranitar. Tyranitar can cripple faster foes that don't get OHKOed by Rock Slide with Thunder Wave such as Latios and Dragonite. Leftovers gives Tyranitar some passive recovery that increases its longevity. Maximum HP and Special Defense gives Tyranitar as much special bulk as possible, allowing it to tank almost any unboosted special attack in sand. Sassy nature is preferred if Fire Blast is chosen over Heavy Slam.</p> <p>All of Tyranitar's teammates appreciate Stealth Rock and Thunder Wave support. Hydreigon especially helps in the Poison and Steel matchups as a Substitute + Nasty Plot sweeper or a faster teammate for an edge in the Dragon matchup. Mega Sableye is a great choice as a Mega Evolution and can act in tandem with Tyranitar, since it is immune to Fighting and can keep entry hazards off your side of the field while spreading burns with Will-O-Wisp. Greninja can be geared to help in any matchup and runs a variety of different sets including Choice Specs, Choice Scarf, Grassium-Z, Icium-Z or Expert Belt. Choice Specs is particularly helpful in the Dragon and Flying matchups, while Grassium-Z is great in the Water and Ground matchups. Icium-Z helps break defensive Celesteela after an Ice Beam, and Extrasensory with Expert Belt can break through Toxapex and Mega Venusaur, which give Tyranitar a lot of trouble. Choice Scarf Greninja can revenge kill opposing Choice Scarf users such as Latios, Latias, and Landorus-T as well as Mega Aerodactyl. Toxic Spikes can be fitted into any of these sets to support entry hazard stacking. Mandibuzz can help check physical setup sweepers such as Dragonite and Mega Scizor, and is also able to clear entry hazards with Defog. Alolan Muk is extremely helpful with taking on pesky Fairy-types and can take advantage of Fairy teams' passive Pokemon such as Klefki to set up with Curse. Zarude is another great teammate that gives an edge in the Water and Ground matchups since it becomes very dangerous after one or two Bulk Ups, and Weavile could be helpful versus Flying with its hard hitting STAB Ice-type attacks. Bisharp is a strong physical attacker that can set up with Swords Dance and provides great priority in Sucker Punch.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Dark analysis by", "members": [{"user_id": 340084, "username": "adjustments"}]}, {"name": "Quality checked by", "members": [{"user_id": 305839, "username": "maroon"}, {"user_id": 473171, "username": "DugZa"}]}, {"name": "Grammar checked by", "members": [{"user_id": 301217, "username": "Bandkrook"}]}], "writtenBy": [{"user_id": 340084, "username": "adjustments"}]}
  },
  "Swampert": {
    "comments": "<h1>Other Options</h1> <section><h1>Water</h1> <p>On defensive Swampert, a Relaxed nature and 0 Speed IVs allow it to be as slow as possible when pivoting with Flip Turn against Pokemon such as Hippowdon, giving it the most opportunities to safely bring in its teammates. Toxic can be used over Stealth Rock on Mega Swampert, allowing it to nail checks such as Rotom-W and break them later in the match. Superpower can be used over Flip Turn on Mega Swampert to better check threats such as Ferrothorn and Zarude.</p> </section><h1>Checks and Counters</h1> <section><h1>Water</h1> <p><strong>Grass-types: Grass-types such as Mega Venusaur, Rillaboom, and Ferrothorn can OHKO Swampert with their STAB attacks and easily tank any attack it tries to throw at them. However, slower, frail Grass-type Pokemon such as Breloom can be handled with Ice Punch.</p> <p><strong>Physical Walls: Physical walls such as Skarmory and Mandibuzz can easily tank any attack Swampert has, but Mandibuzz needs to be careful of Toxic.</p> <p><strong>Status: Swampert does not appreciate being burned or poisoned, as the former reduces its damage output, while the latter limits its time in battle. While rare, Mega Swampert can also be paralyzed by Stun Spore users such as Whimsicott.</p> <p><strong>Wallbreakers: Pokemon such as Choice Band Urshifu, Choice Specs Latios, and Tapu Koko can threaten Swampert with their STAB attacks and coverage moves. However, rain allows it to outspeed a majority of wallbreakers and OHKO or severely dent them with its attacks.</p> <p><strong>Opposing Weather Setters: Since Mega Swampert relies on rain for its Speed with Swift Swim, opposing weather setters such as Tyranitar, Hippowdon, and Torkoal prevent it from doing its job. Mega Charizard Y and Alolan Ninetales in particular can also OHKO Mega Swampert with Solar Beam and Freeze-Dry. Since rain also increases the power of Waterfall, changing the weather from rain reduces its wallbreaking capacity; this is especially true with sun, since it reduces damage done by Water-type attacks.</p> <p><strong>Revenge Killers: Fast revenge killers such as Choice Scarf Latios and Choice Band Barraskewda can all outspeed and revenge kill Mega Swampert in rain. Other Pokemon such as Greninja can easily outspeed and OHKO it outside of rain.</p> </section>",
    "sets": [
      {
        "name": "Defensive (Water)",
        "description": "<p>Swampert's part-Ground typing grants it an invaluable immunity to Electric attacks, making it the premier Stealth Rock setter for Water teams. Stealth Rock can chip down foes for its teammates while breaking Sturdy on Pokemon such as Skarmory. Earthquake allows Swampert to significantly damage Electric-types such as Regieleki and Zeraora. Flip Turn allows Swampert to generate momentum for Water teams and safely bring in teammates. Alternatively, Scald can be used to fish for burns against Pokemon such as Ferrothorn and Tapu Bulu; however, the momentum is more appreciated. Roar allows Swampert to force out physical setup sweepers such as Mega Altaria and Dragon Dance Dragonite. Toxic is an option over Roar, as it allows Swampert to cripple foes such as Zapdos, Rotom-W, and Mega Latias by putting them on a timer. Leftovers grants Swampert a form of passive recovery. Maximum HP and Defense investment alongside an Impish nature allows it to be as physically bulky as possible and better take on threats such as Zeraora and Mega Scizor.</p> <p>All of Swampert's teammates appreciate it granting the type an Electric immunity, setting Stealth Rock, and generating momentum by bringing them in safely with Flip Turn. Toxapex provides a Grass neutrality for Swampert and can take attacks such as Mega Venusaur's Giga Drain and Ferrothorn's Power Whip. Additionally, it can sponge attacks such as Latios's Draco Meteor and recover off damage thanks to Regenerator + Recover, form a hazard stacking core with Swampert with Toxic Spikes, cripple Flying-types like Zapdos with Toxic, OHKO Tapu Bulu with Sludge Bomb, and threaten Calm Mind Tapu Fini with Poison Jab. Tapu Fini provides a Dragon immunity; prevents Swampert from being vulnerable to status with Misty Terrain; stallbreaks with Taunt; and can break past Kyurem with Choice Scarf Moonblast, which otherwise destroys Swampert. Slowking provides a switch-in to powerful Psychic-type attacks such as Choice Specs Tapu Lele's Psychic and can sponge attacks with Regenerator. Greninja can take on Dragon- and Grass-types such as Dragonite and Celebi with Ice Beam, beat Fairy-type Pokemon such as Tapu Koko with Gunk Shot, and revenge kill foes with its Choice Scarf set. Urshifu-R can take on Kyurem, Mandibuzz, and Ferrothorn with Close Combat. Rotom-W can cripple physical attackers such as Mega Altaria with Will-O-Wisp, allowing it to phaze them with Roar more easily. Slowking, Greninja, Urshifu-R, and Rotom-W can all form some sort of momentum-grabbing core with Swampert due to their access to Teleport, U-turn, and Volt Switch. Rotom-W and Mantine can switch into Ground-type attacks from foes like Landorus-T and Sand Rush Excadrill and clear entry hazards with Defog. Mega Sharpedo can act as a late-game sweeper in matchups such as Psychic and Flying by breaking through threats such as Celebi, Deoxys-S, and Landorus.</p> "
      },
      {
        "name": "Swiftly Swimming (Water)",
        "description": "<p>Mega Swampert is a blessing to rain teams by providing an Electric immunity, being able to set Stealth Rock, and using Swift Swim alongside Pelipper's rain. Rain-boosted Waterfall allows it to better take on Pokemon like Celesteela and Zapdos, especially thanks to the added flinching chance. Earthquake allows it to take on Electric-, Poison-, and Steel-type Pokemon such as Zeraora, Toxapex, and Melmetal. Ice Punch allows Mega Swampert to target Grass-, Flying-, and Dragon-type Pokemon such as Breloom, Dragonite, and Garchomp. Stone Edge is an alternative to nail Mantine, which otherwise walls Mega Swampert. Flip Turn allows Mega Swampert to generate momentum by pivoting on a predicted switch, allowing it to bring in a better teammate such as Greninja to take on the foe. Alternatively, Stealth Rock allows Mega Swampert to chip down Pokemon such as Rotom-W and Dragapult, in turn making them easier to revenge kill. Swift Swim doubles its Speed under rain, allowing it to outpace threats such as Volcarona after a Quiver Dance and Choice Scarf Excadrill. Maximum Speed and Attack investment alongside a Jolly nature allows it to outpace threats such as Adamant Tapu Bulu.</p> <p>Pelipper is an essential teammate, as it sets rain for Mega Swampert, enabling Swift Swim and allowing it to act as a revenge killer and powerful wallbreaker. In addition to setting rain, Pelipper can also nuke Grass-types such as Mega Venusaur with Hurricane, utilize a defensive set with Heavy-Duty Boots to safely pivot in Mega Swampert with U-turn, provide a Ground immunity, and clear entry hazards with Defog. Urshifu-R forms a physical wallbreaking core with Mega Swampert, being able to break past Steel-, Dark-, Ice-, and Normal-type Pokemon such as Ferrothorn, Mandibuzz, Kyurem, and Porygon2. In addition, Urshifu-R can form a pivoting core with Mega Swampert due to U-turn. Greninja can break past Water- and Flying-type Pokemon like opposing Swampert, Mantine, and Landorus with Grass Knot, Hidden Power Electric, and Ice Beam and set Toxic Spikes for Mega Swampert. Choice Scarf Tapu Fini prevents Mega Swampert from being vulnerable to status due to Misty Terrain, provides a Dragon immunity, and can revenge kill Dragon-type Pokemon such as Kyurem and Choice Specs Latios with Moonblast. Additionally, Choice Scarf Tapu Fini can cripple a defensive Pokemon such as Skarmory or Celesteela with Trick, allowing Mega Swampert to then beat them down with ease. Kingdra is a fellow Swift Swim user that can take advantage of Dragon-types and revenge kill them with Draco Meteor and Ice Beam while threatening Grass-type Pokemon such as Zarude with Hurricane. Kingdra can also break past physical walls such as Skarmory for Mega Swampert, and in return, Mega Swampert can break past special walls such as Blissey. Barraskewda is another Swift Swim user that can break down its shared checks with Mega Swampert such as Skarmory with its physical Water-type moves, take on Pokemon such as Kyurem with Close Combat, and pivot it in safely with Flip Turn. Manaphy can break past physical walls and checks to Mega Swampert such as Skarmory, Dragonite, and Mega Venusaur thanks to its wallbreaking potential with Tail Glow and great coverage moves. Additionally, thanks to its ability Hydration, it can absorb status for Mega Swampert then use Rest, effectively allowing it to act as a stallbreaker. One of Slowking and Toxapex are typically present on rain teams due to their ability Regenerator, allowing them to act as tanks while being able to pivot out with Teleport or Eject Button, respectively, safely bringing in Mega Swampert. Slowking eases the Psychic matchup, while Toxapex eases the Grass matchup and provides Toxic Spikes. Empoleon can alternatively be used because it can clear entry hazards with Defog, provides a resistance to Dragon- and Psychic-type attacks such as Draco Meteor and Psychic from Latios, and can act as the Stealth Rock setter.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Water analysis by", "members": [{"user_id": 305839, "username": "maroon"}]}, {"name": "Quality checked by", "members": [{"user_id": 473171, "username": "DugZa"}, {"user_id": 491896, "username": "Rotten"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}]}], "writtenBy": [{"user_id": 305839, "username": "maroon"}]}
  },
  "Sableye": {
    "comments": "<h1>Other Options</h1> <section><h1>Dark</h1> <p>Toxic can be used over Will-O-Wisp or Protect to wear down foes more quickly, but those two moves are generally more appreciated.</p> <h1>Ghost</h1> <p>Mega Sableye can opt to run Dazzling Gleam in lieu of Protect to better deal with threats like Urshifu-S and Hydreigon while also preventing Pokemon such as Keldeo and Kommo-o from taking advantage of Mega Sableye's passiveness. Toxic can also be used over Protect to help against Pokemon like Volcarona, which is otherwise free to set up. Metal Burst can be used in the last slot to take Mega Diancie's Moonblast and OHKO back. Foul Play can be used instead of Knock Off to deal with physical attackers like Mega Charizard X and Cinderace with ease. However, that results in Mega Sableye being unable to do any meaningful damage against Pokemon with poor Attack stats.</p> </section><h1>Checks and Counters</h1> <section><h1>Dark</h1> <p><strong>Fairy-types: Strong Fairy-type attacks such as Mega Diancie's and Tapu Lele's Moonblasts easily beat Mega Sableye, and it can't do anything to Mega Diancie in return.</p> <p><strong>Wallbreakers: Powerful wallbreakers such as Choice Specs Latios and Choice Band Victini can muscle past Mega Sableye with their powerful STAB moves in Draco Meteor and V-Create.</p> <p><strong>Setup Sweepers: Setup sweepers can take advantage of Mega Sableye's passive nature and use it as setup bait. Suicune is a great example, hiding behind a Substitute and proceeding to stack Calm Mind boosts. However, physical attackers should be careful of setting up, as they can be punished by Will-O-Wisp.</p> <p><strong>Mold Breaker: Mold Breaker allows lead Excadrill to set Stealth Rock on Mega Sableye or Choice Scarf Excadrill to cripple it with Toxic, allowing it to be worn down with more ease. Mega Gyarados can also take advantage of Mega Sableye by shutting it down with Taunt and setting up Dragon Dance without punishment.</p> <h1>Ghost</h1> <p><strong>Fairy-types: Fairy-type Pokemon like Mega Diancie, Mega Altaria, and Tapu Lele are able to KO Mega Sableye with their powerful STAB moves after some minor chip damage.</p> <p><strong>Special Setup Sweepers: Setup sweepers like Calm Mind Tapu Lele, Substitute + Calm Mind Suicune, and Volcarona use Mega Sableye as setup fodder.</p> <p><strong>Wallbreakers</strong>: Strong wallbreakers like Choice Band Victini and Choice Specs Regieleki have no trouble taking care of Mega Sableye after very little chip damage.</p> </section>",
    "sets": [
      {
        "name": "Defensive (Dark)",
        "description": "<p>Mega Sableye is a staple on balanced Dark teams, constantly taking on powerful attacks as a wall, providing an immunity to Fighting, deflecting entry hazards and status due to Magic Bounce, and crippling foes with its utility moves in Knock Off and Will-O-Wisp. Knock Off allows Mega Sableye to remove items such as Porygon2's Eviolite, Mantine's Heavy-Duty Boots, Nidoking's Life Orb, and Landorus-T's Choice Scarf. Will-O-Wisp cripples physical attackers such as Excadrill, Buzzwole, and Dragonite, letting your team more easily handle them. Protect allows Mega Sableye to scout attacks from Choice-locked Pokemon, such as Choice Scarf Galarian Darmanitan and Choice Band Victini, then switch accordingly. Protect also allows Sableye to Mega Evolve safely. Mega Sableye's Special Defense EVs notably let it take Earth Power from Nidoking, remove its Life Orb, and then take a second Earth Power. The Defense investment helps it take on Mega Aerodactyl and Landorus-T better.</p> <p>All of Mega Sableye's teammates appreciate its immunity to Fighting, ability to deflect entry hazards and status, and ability to switch into threats such as Choice Scarf Terrakion. Mandibuzz and Tyranitar form a powerful defensive core with Mega Sableye. Mandibuzz provides a Ground immunity and Defog support, and it help Mega Sableye check physical setup sweepers with Foul Play. It also walls threats such as Mega Lopunny for Mega Sableye. Tyranitar, on the other hand, is the specially defensive part of the core that also sets Stealth Rock and can cripple threats such as Landorus with Toxic. Its great special bulk lets it take on threats such as Volcarona. Greninja can take on a very wide variety of foes with its powerful coverage and set Toxic Spikes, helping Mega Sableye wear down foes with that much more ease. Zarude can take on Water-type Pokemon that threaten Mega Sableye such as Keldeo and Urshifu-R with a Chople Berry and other threats such as Tapu Fini and Azumarill. Hydreigon can act as a revenge killer with Choice Scarf and take on omni-boosted Kommo-o with Draco Meteor or break through walls such as Mega Venusaur with Choice Specs Draco Meteor.</p> "
      },
      {
        "name": "Utility (Ghost)",
        "description": "<p>Great defensive stats and recovery, an amazing ability in Magic Bounce, neutrality against Dark-type attacks, and absorbing Knock Off allow Mega Sableye to thrive as one of the best defensive Pokemon available for Ghost-type teams. Knock Off cripples all kinds of item-reliant Pokemon, including Heavy-Duty Boots Volcarona, Life Orb Landorus and Nidoking, and Eviolite Porygon2. Will-O-Wisp makes physical attackers like Mega Gallade and Terrakion much easier to wall. Protect lets Sableye safely Mega Evolve against major threats such as Mega Diancie while also scouting Choice-locked attackers like Tapu Koko. Prankster is the ability of choice on pre-Mega Evolution Sableye for priority status moves if necessary. The given HP and Special Defense EVs allow Mega Sableye to avoid an OHKO from Choice Specs Tapu Koko's Dazzling Gleam and a 2HKO from Life Orb Nidoking's Earth Power, assuming Sableye uses Knock Off after the first Earth Power.</p> <p>All of Mega Sableye's teammates appreciate its ability to switch into Dark-type moves and reflect entry hazards, Toxic, and Thunder Wave. Galarian Corsola forms a formidable defensive core with Mega Sableye, namely dealing with significant threats in Mega Lopunny, Choice Band Excadrill, and Swords Dance Garchomp. Together, they reliably switch into most attacks directed at their offensive teammates. Aegislash further complements this defensive core as a reliable specially defensive wall with its SubToxic set Poison immunity. Aegislash also greatly aids against Fairy- and Ice-types like Mega Diancie, Tapu Lele, and Alolan Ninetales. Mimikyu is an amazing offensive teammate that helps against Dark-types like Hydreigon and Dragon-type Pokemon such as Latios, Hydreigon, and Kommo-o. Blacephalon helps greatly against Steel-, Grass-, and Ice-types like Celesteela, Ferrothorn, and Galarian Darmanitan and is able to act as a reliable revenge killer with Choice Scarf, outspeeding and taking care of some of Mega Sableye's threats like Mega Lopunny and Tapu Koko. Gengar is another great offensive teammate that wallbreaks with Choice Specs and is a great asset in matchups like Fairy. Lightning Rod Alolan Marowak proves to be a good teammate, as it blocks Electric-type moves from the likes of Tapu Koko and Regieleki.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Dark analysis by", "members": [{"user_id": 305839, "username": "maroon"}]}, {"name": "Ghost analysis by", "members": [{"user_id": 473171, "username": "DugZa"}]}, {"name": "Quality checked by", "members": [{"user_id": 321991, "username": "Mateeus"}, {"user_id": 320110, "username": "Harpp"}, {"user_id": 305839, "username": "maroon"}, {"user_id": 491896, "username": "Rotten"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}, {"user_id": 331519, "username": "CryoGyro"}]}], "writtenBy": [{"user_id": 305839, "username": "maroon"}, {"user_id": 473171, "username": "DugZa"}]}
  },
  "Torkoal": {
    "comments": "<h1>Other Options</h1> <h1>Fire</h1> <p>Body Press can be used to take on Rock-type threats like Mega Tyranitar and Terrakion. Toxic is an option over Yawn and helps against foes like Swampert, Porygon2, and Mantine. Heavy-Duty Boots as item is an option to keep Torkoal more healthy throughout the battle, especially when Mega Charizard Y is a teammate for additional Drought support.</p> <h1>Checks and Counters</h1> <h1>Fire</h1> <p><strong>Special Attackers: Owing to its mediocre Special Defense stat, Torkoal is easily overwhelmed by special attackers such as Latios, Blacephalon, Hydreigon, and Gengar, which can heavily dent or KO it.</p> <p><strong>Special Walls: Special walls and defensive Pokemon like Blissey and Toxapex have no trouble taking on Torkoal, as they can whittle it down with Seismic Toss and Scald + Toxic, respectively. Blissey can also use Teleport to go into an appropriate teammate to deal with Torkoal and gain momentum. On the other hand, Toxapex can set up Toxic Spikes.</p> <p><strong>Wallbreakers: Insanely strong wallbreakers like Landorus and Diggersby can easily break apart Torkoal, and it cannot switch in against them safely during battle.</p> <p><strong>Dragon-types: Since Torkoal's only commonly run attack is Lava Plume, it struggles to do anything meaningful against Dragon-type Pokemon like Hydreigon, Kyurem, and Latios that can deal heavy damage to it in return or use setup moves to exploit this.</p> <p><strong>Water-types Water-type Pokemon like Pelipper, Swampert, and Kingdra have almost nothing to fear from Torkoal and can effectively take it down.</p> ",
    "sets": [
      {
        "name": "Utility Support",
        "description": "<p>Torkoal's ability Drought, good physical bulk, and utility moves like Stealth Rock and Rapid Spin make it a premier support Pokemon on Fire-type teams. Stealth Rock lets Torkoal wear down opposing teams, making it easier for its offensive teammates to wallbreak. Rapid Spin keeps troublesome entry hazards like Stealth Rock and Sticky Web away, which can plague the entire team. Lava Plume is the only attacking move on the set, hits decently hard with sun support, and is used to fish for burns against physical attackers like Mimikyu, Mega Lopunny, and Zeraora. Yawn is a good move to force foes to switch out, letting Torkoal set up Stealth Rock or clear hazards with Rapid Spin. It also threatens setup sweepers like Dragonite and Mega Gallade and gives opportunities to teammates like Volcarona and Mega Charizard X to set up. Due to the role compression that Torkoal provides, it is essential to keep it around for its Drought and hazard removal support. Maximum HP and Defense investment with a Bold nature makes Torkoal as bulky as possible, allowing it to take on physical attackers like Mega Lopunny, Mega Gallade, and Dragonite a lot better. Heat Rock increases the number of active sun turns for Torkoal's teammates to use boosted Fire-type moves.</p> <p>Any Fire-type team appreciates the support Torkoal brings to the team. Pokemon like Cinderace, Blacephalon, Victini, Volcarona, and Mega Charizard X benefit massively from sun support, since it lets them use boosted, hard-to-wall Fire-type attacks. They also appreciate Stealth Rock and Rapid Spin support to have an easier time wallbreaking and safely setting up. Specially defensive Heatran is also a good partner to Torkoal because it can sponge special hits for it from the likes of Latios and Tapu Lele and check Nihilego for the team thanks to its Rock neutrality. Volcanion provides an important immunity to Water-type attacks, which lets it check Belly Drum Azumarill, and secondary hazard removal with Defog, taking pressure off from Torkoal. Alolan Marowak can cover Electric-type attacks for Torkoal from threats like Tapu Koko, Regieleki, and Alolan Raichu. It can also break apart defensive types like Poison with sun support and a Swords Dance boost. Mega Charizard Y is also a decent teammate that brings in secondary Drought support to the team and helps improve matchups like Water and Ground.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 473171, "username": "DugZa"}, {"user_id": 305839, "username": "maroon"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}]}], "writtenBy": [{"user_id": 320110, "username": "Harpp"}]}
  },
  "Altaria": {
    "comments": "<h1>Other Options</h1> <section><h1>Dragon</h1> <p>Facade can be used on the Dragon Dance set over Return due to Mega Altaria frequently getting status ailments, but without status, it is weaker than Return and usually not worthwhile.</p> </section><h1>Checks and Counters</h1> <section><h1>Dragon</h1> <p><strong>Steel-types: Steel-types like Jirachi and Excadrill can outpace Mega Altaria and take care of it with Iron Head. Pokemon like Celesteela, Aegislash, and Ferrothorn can tank any attacks from Mega Altaria and take care of it with their attacks. Mega Scizor is also a problem because it can take care of boosted Mega Altaria with Bullet Punch.</p> <p><strong>Poison-types: Poison-types such as Mega Venusaur and Galarian Weezing can take a boosted attack from Mega Altaria and KO it with Sludge Bomb or hinder it with Will-O-Wisp.</p> <p><strong>Phazers and Haze: Phazers and Haze users like Skarmory and Toxapex can get rid of Mega Altaria's boosts.</p> <p><strong>Fairy-types: Mega Diancie, Mimikyu, and Tapu Lele can outpace a unboosted Mega Altaria and OHKO it with their STAB attacks.</p> <p><strong>Ditto: Ditto is able to copy Mega Altaria's boosts and reverse sweep.</p> </section>",
    "sets": [
      {
        "name": "Dragon Dance (Dragon)",
        "description": "<p>Mega Altaria is a fearsome setup sweeper thanks to its good bulk and Roost enabling it to set up with Dragon Dance, and its ability Pixilate makes it dominate Dark and Dragon matchups. It also gives Dragon-type teams a much needed Dragon immunity for mirror matchups. After Dragon Dance, Mega Altaria can outpace and take care of Tapu Koko, Mega Lopunny, and non-Choice Scarf Greninja. Earthquake is used to hit Pokemon like Alolan Muk, Toxapex, and Heatran.</p> <p>Teammates like Latias, Latios, and Hydregion love Mega Altaria for threatening Dark and Fighting-types like Mega Sableye, Hydregion, and Terrakion. Garchomp is a much needed partner to take care of Steel-types like Excadrill and Mega Scizor. It also take care of Poison-types like Toxapex and provide Stealth Rock support. Pokemon such as Hydregion and Kommo-o are vital to handle Steel-types that Mega Altaria cannot beat like Celesteela, Jirachi, and Skarmory. Dragonite can help with walls such as Blissey and Celesteela if running Choice Band or can use Dragon Dance to take care of Pokemon like Heatran and Mega Venusaur. Mega Altaria has trouble with Poison-types like Toxapex and Mega Venusaur, so it loves partners like Latios and Latias, which can also provide Defog support to get rid of troublesome entry hazards. Zygarde-10% and Duraludon greatly help against Fairy teams, taking care of Mega Diancie and Tapu Lele, which unboosted Mega Altaria struggles against.</p> "
      },
      {
        "name": "Bulky Dragon Dance (Dragon)",
        "description": "<p>Dragon Dance is able to turn Dark, Fighting, and Dragon matchups in Mega Altaria's favor while outpacing threats like Greninja and Keldeo after one Dragon Dance. Refresh is the preferred move in the last slot that allows Mega Altaria to freely set up on Pokemon that run status-inducing moves like Mega Sableye, Blissey, Porygon2, and Klefki. Heal Bell can be ran over Refresh to heal teammates' status as well. Natural Cure lets Altaria absorb status for teammates before Mega Evolving. 252 HP EVs allow Mega Altaria to set up on Porygon2 and Latias, while 16 Defense EVs allows Mega Altaria to be as bulky as possible. 240 EVs in Speed outpace Diggersby and Adamant Choice Band Dracovish.</p> <p>All teammates love Mega Altaria for coming in on Dragon-type attacks, taking care of Mega Sableye and the defensive core of Blissey and Porygon2, and using Heal Bell. Mega Altaria loves Garchomp for taking care of Steel-types like Excadrill and Mega Scizor. Garchomp can also provide Stealth Rock support to make Mega Altaria able to sweep better. Pokemon like Hydregion and Kommo-o to take care of Steel-types like Celesteela, Melmetal, and Jirachi. Mega Altaria has trouble with Poison-types like Mega Venusaur and Nidoking, so Latias and Kyurem are great partners. Mega Altaria has trouble with strong and fast Fairy-types like Mega Diancie and Tapu Koko, so Choice Scarf Duraludon and Dragagle can take care of them. Latios and Latias are great Defog users, while Latias can also use Healing Wish. Dragalge is good to provide Mega Altaria with Toxic Spikes, improving the Fairy matchup and making it easier for Mega Altaria to sweep.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Dragon analysis by", "members": [{"user_id": 393488, "username": "Yami"}]}, {"name": "Quality checked by", "members": [{"user_id": 473171, "username": "DugZa"}, {"user_id": 320110, "username": "Harpp"}]}, {"name": "Grammar checked by", "members": [{"user_id": 331519, "username": "CryoGyro"}]}], "writtenBy": [{"user_id": 393488, "username": "Yami"}]}
  },
  "Latias": {
    "comments": "<h1>Other Options</h1> <section><h1>Psychic</h1> <p>Latias may opt to run Trick to cripple defensive checks such as Galarian Corsola, Mantine, and Celesteela. However, Latias's other moves prove to be more beneficial in most cases. Latias may also run Thunder Wave to cripple faster threats that it fails to revenge kill reliably like Mega Aerodactyl and Volcarona, allowing other teammates like Victini to deal with them without much trouble. Soul Dew is an item option to gain some power and not be Choice-locked, but using it means Latias can no longer reliably revenge kill threats like Choice Scarf Blacephalon, +1 Mega Sharpedo, and Porygon-Z after Z-Conversion.</p> <h1>Dragon</h1> <p>Soul Dew frees Latias from being Choice-locked and boosts its STAB moves, allowing it to perform its utility roles better. However, Latias will no longer provide speed control or check sweepers such as Mega Sharpedo and Mega Charizard X. Trick is an option over Defog, but your team loses access to Latias's reliable entry hazard removal. Mega Latias can use other options with Calm Mind but most are less potent than the BoltBeam combination. Stored Power and Refresh can be used to sweep Electric, Normal, and Fighting teams more easily and Stored Power synergizes well with Calm Mind, becoming stronger after each boost, but Dragon teams prefer the BoltBeam combination and can deal with said matchups in other ways.</p> </section><h1>Checks and Counters</h1> <section><h1>Psychic</h1> <p><strong>Dark-types: Dark-type Pokemon can freely switch in on Latias locked into Psychic, and specially defensive Tyranitar and Bisharp also take very little damage from Draco Meteor. The former threatens to cripple Latias with Thunder Wave or Toxic, while the latter can set up with Swords Dance or OHKO Latias with Knock Off.</p> <p><strong>Pursuit: Latias falls prey to common Pursuit trappers such as Scizor, Drapion, and Alolan Muk. It is almost always forced to switch out against these threats, especially if it is locked into Draco Meteor, and Pursuit can OHKO or severely weaken it as a result.</p> <p><strong>Steel-types: Steel-type Pokemon like Celesteela, Ferrothorn, and Heatran resist both of Latias's STAB options, allowing them to freely switch in against it. However, they should be wary of Trick sets that can easily render them useless. On the other hand, Steel-types like Mega Scizor and Aegislash outright use Latias as setup bait.</p> <p><strong>Fairy-types: Fairy-types like Clefable and Azumarill are immune to Draco Meteor and in return threaten to KO Latios with their super effective Fairy-type STAB moves. Certain Fairy-types like Tapu Lele and Klefki resist Psychic as well; the former threatens to OHKO with Moonblast, while the latter can cripple Latias with Thunder Wave.</p> <p><strong>Status: Toxic puts Latias on a timer, forcing it to switch out often to prevent excessive damage while Thunder Wave negates Latias's role as a Choice Scarf user and makes it easily revenge killed by threats like Dragonite and Hydreigon.</p> <p><strong>Walls: Specially defensive walls like Blissey, specially defensive Mandibuzz, and Mantine switch in against Latias with ease. However, they need to watch out for sets that utilize Trick, as it easily shuts them down completely.</p> <h1>Dragon</h1> <p><strong>Fairy-types: While Latias can hit Fairy-types with Psychic, they easily shrug it off, and Latias risks being OHKOed by Moonblast from Mega Diancie or Play Rough from Mimikyu.</p> <p><strong>Pursuit Trappers: If Latias is locked into Defog, Alolan Muk and Mega Aerodactyl can trap and potentially OHKO it with Pursuit.</p> <p><strong>Steel-types</strong>: Steel-types resist both of Latias's STAB attacks and many of them easily set up on it, such as Bisharp, Aegislash, and Excadrill, forcing Latias to switch.</p> <p><strong>Dark-types: Dark-types can heavily dent Mega Latias without receiving enough damage in return. Tyranitar's great bulk and power make it one of the best checks to Mega Latias.</p> <p><strong>Walls</strong>: Chansey, Mandibuzz, Hippowdon, and Aegislash can recover easily from Latias's STAB attacks, thus forcing it to switch.</p> <p><strong>Status: Toxic and paralysis are devastating for Mega Latias and can either put it on a timer, stopping it from sweeping, and dent its Speed.</p> </section>",
    "sets": [
      {
        "name": "Choice Scarf (Psychic)",
        "description": "<p>A decent defensive typing, above-average speed tier, access to great utility moves in Defog, Healing Wish, and Trick, and good offensive and defensive stats makes Latias a premier Choice Scarf user and revenge killer on Psychic-type teams. Despite the downside of the Special Attack drop, forcing Latias to switch out more often than not, Draco Meteor acts as Latias's strongest STAB move, allowing it to revenge kill major threats to Psychic-type teams such as Mega Sharpedo and Blacephalon while also aiding greatly in the Dragon-type matchup. Psychic acts as Latias's secondary STAB option, preventing it from being completely shut down by Fairy-types, while also dealing with common Poison- and Fighting-types such as Nidoking, Toxapex, and Terrakion. Defog removes troublesome entry hazards such as Stealth Rock and Toxic Spikes, easing pressure off of other offensive teammates like Tapu Lele and Victini. Healing Wish sets Latias apart from Latios, and it especially benefits strong wallbreakers such as Choice Band Victini and Choice Specs Tapu Lele, giving them a second round of breaking through opposing teams. Maximum Speed EVs along with a Timid nature and Choice Scarf allow Latias to outspeed key threats such as +1 Mega Sharpedo, Choice Scarf Blacephalon, and Mega Lopunny. Levitate is Latias' only ability, providing immunity against Ground-type attacks, Spikes, Toxic Spikes, and Sticky Web.</p> <p>Latias appreciates teammates like Mega Gallade and Victini, as they help deal with troublesome Steel-types and special walls such as Ferrothorn, Celesteela, Blissey, and Mantine. Mega Gallade also helps in the Dark matchup, dealing with key threats like Hydreigon and Tyranitar, while Victini helps against Bug-types such as Scizor and Volcarona. Latias in return can revenge kill threats to them such as Mega Lopunny, Tapu Koko, and Blacephalon and also provide Healing Wish support. Victini also appreciates Latias playing the role of Choice Scarf user, which allows Victini to utilize other sets such as Heavy-Duty Boots, Z-Celebrate, and Choice Band. Latias also benefits from teammates like Tapu Lele and Hatterene that deal with opposing Dragon-types and are capable of switching into Dragon-type moves due to their Fairy typing. They also help greatly in the Dark matchup, OHKOing threats like Hydreigon and Weavile. Slowbro provides a good defensive pivot that sponges physical attacks from Landorus-T, Excadrill, and Garchomp directed at Latias, and it can safely bring Latias into the game thanks to Teleport. Slowbro also provides an Ice resistance against opposing Pokemon such as Cloyster and Galarian Darmanitan. Steel-type teammates like Metagross and Jirachi resist common Dragon-, Ice-, and Fairy-type moves directed at Latias while also providing Stealth Rock support, which allows Latias to secure crucial OHKOs, against Pokemon such as Terrakion, Blacephalon, and Mega Sharpedo. Furthermore, Jirachi can cripple offensive and defensive threats to Latias such as Greninja and Mantine with Thunder Wave and Toxic, respectively. Magic Guard + Focus Sash Alakazam and Colbur Berry Celebi can help deal with common threats like Bisharp, Mega Scizor, and Mega Sharpedo that Latias struggles against.</p> "
      },
      {
        "name": "Choice Scarf (Dragon)",
        "description": "<p>Draco Meteor is Latias's strongest move, letting Latias revenge kill frailer Pokemon such as Greninja after Stealth Rock and Blacephalon as well as opposing Dragon-types such as Hydreigon. Psychic is reliable and does consistent damage to threats weak to it, such as Mega Lopunny, Mega Venusaur, Kommo-o, and Galarian Weezing, while also being able to clean up late-game. Healing Wish restores weakened important teammates, like a worn down Mega Altaria against Dark, which could lead to a late-game sweep. Levitate provides immunity to Spikes, Toxic Spikes, and Sticky Web, allowing Latias to clear them easily with Defog. Choice Scarf and a Timid nature ensure Latias can provide speed control.</p> <p>All of Latias's teammates benefit from its speed control, removal of entry hazards, and Healing Wish utility. Garchomp is a great lead to pair with Latias, since it can reliably set entry hazards and wear physical attackers down with Rough Skin or set up with Swords Dance, which enables Latias to clean late-game. Duraludon provides a Fairy-type neutrality, sets entry hazards, and cripples foes with Thunder Wave. Dragonite benefits from Defog and Healing Wish keeping Multiscale intact, and it is also the only Dragon-type with access to priority in the form of Extreme Speed, which can be used to clean up threats to Dragon teams such as Greninja and Weavile. Latias also benefits from pairing with Mega Altaria, which prevents the opponent from spamming Dragon-type moves in the Dragon mirror. Mega Altaria also assists in the Dark matchup against Greninja after a Dragon Dance, Hydreigon, Urshifu, and Mega Sableye. Kommo-o is helpful in the Steel and Dark matchups but also can help break down Normal's walls, such as Blissey and Porygon2. Hydreigon can deal with Ghost-, Steel-, and Psychic-type threats that check Latias, such as Ferrothorn, Aegislash, and Jirachi. Kyurem provides a valuable Ice-type neutrality and handles walls that Latias struggles with, such as Mandibuzz and Gliscor, while also dealing with bulky Water-types thanks to Freeze-Dry. Also, with Latias filling the need for speed control, you are free to run Choice Specs Latios or Mega Latios. Both are potent wallbreakers, breaking through specially defensive walls that Latias and other teammates struggle with breaking, such as Mantine.</p> "
      },
      {
        "name": "Bulky Calm Mind (Dragon)",
        "description": "<p>Mega Latias can be a very potent wincon on Dragon teams due to its fantastic combination of bulk, Speed, and the notorious famous BoltBeam coverage, which allows it to be effective in many matchups such as Flying, Water, Ground, and Dragon. Calm Mind enables Mega Latias to clean weakened teams and handle Mega Diancie and Greninja after a few boosts, which otherwise threaten it. Roost is to boost its longevity so it can use Calm Mind throughout the match. Thunderbolt threatens a majority of Water-types and Flying-types, making said matchups easier. Ice Beam hits Ground-types and opposing Dragon-types super effectively. Try to use Mega Latias conservatively early-game to damage key threats weak to either Ice Beam or Thunderbolt. Only attempt a sweep once all of its checks are weakened. Levitate is Mega Latias's only ability and can be incredibly helpful in the Ground matchup. Maximum investment in Speed and HP in tandem with a Timid nature allows Mega Latias to become as fast as possible, outpacing threats like Landorus and Keldeo, while taking advantage of its fantastic bulk to set up Calm Mind more easily.</p> <p>Mega Latias is most used as a wincon, so teammates that can help it sweep are appreciated. Dragalge provides Toxic Spikes support to help wear down Mega Latias's checks for it to sweep late-game and can also switch into Fairy-type attacks for it. Stealth Rock support from Duraludon or Garchomp is similarly helpful to weaken the few checks Mega Latias has. Mega Latias is walled by the majority of Steel-types; therefore, Pokemon that can defeat Steel-types such as Hydreigon and Kommo-o are useful. In particular, Kommo-o can form a sweeping core while taking on types that Mega Latias can't do much against, such as by taking on Blissey on Normal and Tyranitar on Dark. Hydreigon also notably helps in Ghost-type matchups. Latios can outspeed threats faster than Mega Latias and blow away hazards with Defog. Dragonite can beat fast threats to Mega Latias such as Gengar and Greninja, as it provides a priority move in Extreme Speed and Multiscale.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Psychic analysis by", "members": [{"user_id": 473171, "username": "DugZa"}]}, {"name": "Dragon analysis by", "members": [{"user_id": 340084, "username": "adjustments"}, {"user_id": 512812, "username": "WolfishOne"}]}, {"name": "Quality checked by", "members": [{"user_id": 321991, "username": "Mateeus"}, {"user_id": 305839, "username": "maroon"}, {"user_id": 473171, "username": "DugZa"}, {"user_id": 320110, "username": "Harpp"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 340084, "username": "adjustments"}, {"user_id": 512812, "username": "WolfishOne"}, {"user_id": 473171, "username": "DugZa"}]}
  },
  "Gastrodon": {
    "comments": "<h1>Other Options</h1> <p><strong>Ground</strong></p> <p>Heavy-Duty Boots can be used over Leftovers so Gastrodon doesn't have to worry about being worn down from Spikes or Toxic Spikes. You can also opt for a specially defensive spread that helps in walling Hydreigon and Tapu Lele, but Gastrodon would no longer wall physical threats such as Secret Sword Keldeo and Excadrill.</p> <h1>Checks and Counters</h1> <p><strong>Ground</p> <p><strong>Grass-type Pokemon and Attacks</strong>: Rillaboom, Ferrothorn, and Mega Venusaur brush off all of Gastrodon's attacks and OHKO it back with a STAB move. Additionally, Mega Charizard Y and Alolan Raichu often carry Grass-type coverage in Solar Beam and Grass Knot that either OHKOes or does serious damage to Gastrodon.</p> <p><strong>Wallbreakers: Powerful wallbreakers such as Mega Latios, Hydreigon, and Tapu Lele can power through Gastrodon with their STAB attacks, outputting more damage than Gastrodon can recover.</p> <p><strong>Toxic: Being badly poisoned wears Gastrodon down very quickly and hinders its performance as a wall.</p> <p><strong>Taunt and Trick</strong>: Gastrodon relies on its recovery to act as a wall, but Taunt users such as Tornadus-T and Kommo-o can shut it down and force it to switch; the latter can set up and sweep with Clangorous Soulblaze. Pokemon like Latios and Gengar can utilize Trick to give Gastrodon unwanted Choice items, making it difficult for it to do much.</p> ",
    "sets": [
      {
        "name": "Defensive Wall (Ground)",
        "description": "<p>Recover gives Gastrodon reliable recovery and lets it fulfill the role of a wall. Scald's potential burn specifically threatens physical sweepers such as Dragonite and Excadrill. Earth Power makes Gastrodon able to take on Steel-types, such as Excadrill and Heatran, and Toxapex after a Storm Drain boost. Earthquake is an option that OHKOes Alolan Raichu and breaks the Substitutes of Keldeo and Mega Gallade, making it more difficult for them to setup. Toxic lets Gastrodon spread status and cripple opposing walls that brush off or are unaffected by its STAB moves, such as Rotom-W, Staraptor, and Porygon2. Clear Smog prevents threatening setup sweepers from setting up, such as Azumarill, Kommo-o, and Latias. Storm Drain in conjunction with Gastrodon's typing gives Ground teams a valuable Water immunity and Ice neutrality. The EV spread and Bold nature give Gastrodon as much physical bulk as possible; a Relaxed nature is preferred if you opt for Earthquake.</p> <p>Gastrodon fits on both sand and non-sand Ground teams, as all Ground-types appreciate its immunity to Water and Ice neutrality. On sand teams, Hippowdon is a good physical wall and sand setter to pair with Gastrodon because it can set entry hazards and phaze with Whirlwind. Excadrill can spin away entry hazards such as Toxic Spikes that are a detriment to Gastrodon's longevity and break through foes that have been worn down from Gastrodon's Toxic or Scald burn. Landorus makes a great teammate on both sand and non-sand teams to wallbreak and take on Grass- and Steel-types that Gastrodon is unable to, such as Mega Venusaur and Celesteela, thanks to its Gravity support and Sheer Force and Life Orb-boosted Earth Power. Mamoswine gives Ground teams another Ice switch-in due to Thick Fat, can take on Dragon- and Flying-types that wear Gastrodon down such as Latios and Zapdos, and has access to priority in Ice Shard that can break Dragonite's Multiscale. Mega Garchomp is another great teammate that survives an Aqua Jet from Azumarill after a Belly Drum and OHKOes it with Earthquake. Mega Steelix is a viable option that helps Gastrodon specifically in the Fairy and Ice matchups, since it can take on Tapu Bulu and Galarian Darmanitan with relative ease.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Ground analysis by", "members": [{"user_id": 340084, "username": "adjustments"}]}, {"name": "Quality checked by", "members": [{"user_id": 473171, "username": "DugZa"}, {"user_id": 305839, "username": "maroon"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 340084, "username": "adjustments"}]}
  },
  "Lopunny": {
    "comments": "<h1>Other Options</h1> <section><h1>Normal</h1> <p>Mega Kick can be used as a Normal-type STAB move if the extra power is desired. Particularly, Mega Kick is able to OHKO Tapu Lele while unboosted and 2HKO Toxapex and Mega Venusaur at +1. However, its accuracy is extremely undesired, and, most of the time, Return scores the same KOs in a more reliable fashion. On the wallbreaker set, Focus Punch is a viable option to surprise some of Mega Lopunny's switch-ins like Celesteela and Skarmory, but it is very prediction reliant and using it means dropping a generally more useful move. Similarly, Substitute fits in over Encore, making Mega Lopunny harder to revenge kill while taking advantage of the switches it forces to get setup opportunities. It also shines in the Normal matchup because of its buffer against Ditto, but Encore's general utility is usually preferred.</p> </section><h1>Checks and Counters</h1> <section><h1>Normal</h1> <p><strong>Status: All status aliments greatly compromise Mega Lopunny's effectiveness. Paralysis takes away its amazing Speed tier, leaving it vulnerable to be outsped and KOed by a myriad of opposing Pokemon. Burn halves its Attack stat, turning it into a liability throughout the match. Last but not least, Toxic poison gradually wears it down.</p> <p><strong>Physical Walls</strong>: Although the wallbreaker set can bypass them if well played, physical walls like Hippowdon and Mega Venusaur easily shrug off Mega Lopunny's moves and can severely damage it back or just replenish their health. Toxapex and Slowbro deserve a special mention because aside from stopping unboosted Mega Lopunny in its tracks, they can also threaten to burn it with Scald.</p> <p><strong>Faster Pokemon: Faster revenge killers like Zeraora, Mega Aerodactyl, and Choice Scarf Terrakion outspeed and OHKO Mega Lopunny with their super effective moves. If Mega Lopunny is weakened enough, Pokemon like Choice Scarf Excadrill and Greninja can easily dispose of it.</p> <p><strong>Psychic-types: Psychic-types like Mega Gallade and Victini can take any attack Mega Lopunny launches at them and, in return, are able to defeat it. However, if they're slower, U-turn can do sizable chip damage to them.</p> <p><strong>Fairy-types: Fairy-types such as Clefable, Mega Altaria, and Tapu Fini are able to shrug off Mega Lopunny's damaging moves and can beat it with their Fairy-type STAB attacks. Frailer ones like Tapu Koko and Tapu Bulu do need to be wary of Return and Triple Axel respectively, though.</p> </section>",
    "sets": [
      {
        "name": "All-out Attacker (Normal)",
        "description": "<p>A high Attack stat coupled with exceptional coverage and an incredible Speed tier that outpaces major threats such as Tapu Koko, Cinderace, and Greninja makes Mega Lopunny a very strong offensive Pokemon for Normal teams. Fake Out lets Mega Lopunny move first, inflicting chip damage on faster offensive targets like Zeraora and Choice Scarf Greninja and putting Pokemon like Keldeo and Tapu Bulu in KO range from its other moves. Close Combat is Mega Lopunny's go-to attack, nailing Rock-, Steel-, and Dark-type Pokemon such as Tyranitar, Ferrothorn, and Mega Sableye. It also 2HKOes most neutral targets by virtue of its raw power. Triple Axel beautifully complements Close Combat, enabling Mega Lopunny to beat Dragon-types like Dragonite and Garchomp while also turning it into a threat against Dark, Flying, and Ground teams by OHKOing Gliscor and Landorus, as well as 2HKOing Mandibuzz, Zapdos, and specially defensive Hippowdon. U-turn rounds off the set, taking advantage of the walls like Slowbro and Torkoal Mega Lopunny forces onto the field as a way to generate momentum for the team while whittling down the opposition. Maximum Attack and Speed investment alongside a Jolly nature bolsters Mega Lopunny's offensive potential. Limber should be used as the pre-Mega ability because it grants Lopunny a useful immunity to paralysis before Mega Evolving. Scrappy gives Mega Lopunny perfect neutral coverage by letting it hit Ghost-types with its STAB moves and lets it ignore Intimidate from Staraptor and Landorus-T.</p> <p>All of Mega Lopunny's teammates benefit from its capability to take on Steel-, Ghost-, and Rock-type Pokemon that are problematic for Normal teams. Blissey is a great partner, as it can absorb status for Mega Lopunny with its Natural Cure, supply Stealth Rock support, and bring it safely onto the field via Teleport. In return, Mega Lopunny shreds the likes of Mega Sableye and Ferrothorn and is able to comfortably switch into undesired Knock Offs for it. Diggersby forms an exceptional offensive core with Mega Lopunny; with its extreme power, it can defeat certain defensive Pokemon like Toxapex, Slowbro, and Mega Venusaur that stop Mega Lopunny cold. Conversely, Mega Lopunny revenge kills threats faster than Diggersby such as Nidoking and Greninja and can bring it safely onto the field with U-turn. Choice Scarf Ditto is able to outspeed and either beat or force out threats to Mega Lopunny like Mega Aerodactyl and Mega Altaria. Defensive Staraptor shrugs off physical Fighting-type attacks directed at Mega Lopunny such as Choice Scarf Terrakion's Close Combat, blows away entry hazards with Defog, and has U-turn to form a pivoting core with it. Similarly, Porygon2's sheer bulk enables it to comfortably tank attacks from revenge killers like Choice Scarf Excadrill and safely Teleport out, getting Mega Lopunny into battle unscathed as a result. With its Ghost-type Z-Conversion set, Porygon-Z can eliminate Psychic-types like Celebi and physical walls like Skarmory for Mega Lopunny.</p> "
      },
      {
        "name": "Wallbreaker (Normal)",
        "description": "<p>Mega Lopunny's access to Power-Up Punch and Encore in conjunction with its offensive perks lets it run a wallbreaking set that can effectively threaten popular defensive cores in the metagame like Steel's Aegislash + Heatran + Celesteela and Dark's Mega Sableye + Mandibuzz + Tyranitar. Power-Up Punch boosts Mega Lopunny's already high Attack stat to astronomical levels while not being stopped by Taunt. Encore is a very useful tool to lock slower Pokemon like Jirachi and Mantine into support or recovery moves, giving Mega Lopunny free setup opportunities with Power-Up Punch or valuable momentum for the team. Return is Mega Lopunny's most reliable STAB move and its main way to dish out damage; after a boost, it can 2HKO most physical walls that don't resist it, such as Zapdos and Clefable, as well as OHKO frailer Pokemon like Nidoking and Volcarona. Close Combat complements Mega Lopunny's perfect coverage, nailing bulky Steel- and Rock-types that resist Return, such as Aegislash and Cradily, as well as Dark-types like Hydreigon. Maximum Attack and Speed EVs with a Jolly nature make Mega Lopunny as powerful and fast as possible. Limber is Lopunny's pre-Mega ability, which grants it a useful paralysis immunity before it Mega Evolves. Scrappy gives Mega Lopunny perfect STAB neutral coverage while also enabling it to break through Intimidate Pokemon like Staraptor and Landorus-T by ignoring its effect.</p> <p>Balanced Normal teams greatly appreciate the role compression this Mega Lopunny set provides by being a very effective hole puncher and revenge killer in one slot. Because of this, Z-Conversion Porygon-Z stands out as its best offensive partner, as they form an offensive core capable of covering most matchups. Porygon-Z fondly benefits from Mega Lopunny removing Dark-types and specially defensive Pokemon like Alolan Muk and Gastrodon. In return, Porygon-Z defeats bulky Psychic- and Ghost-types like Jirachi and Galarian Corsola as well as physical walls such as Celesteela and Mega Venusaur. Blissey is a great partner as well, since it can absorb troublesome status conditions with its Natural Cure, set up Stealth Rock so Mega Lopunny can score crucial KOs, and safely bring it onto the field with Teleport. Ditto is able to pick off faster Pokemon that threaten to revenge kill Mega Lopunny, such as Excadrill under sand and Zeraora. Defensive Staraptor switches into physical Fighting-types like Choice Scarf Buzzwole and Infernape, keeps entry hazards off the field with Defog, and can safely get Mega Lopunny in with its U-turn, allowing Mega Lopunny to enter the battlefield unscathed. Porygon2's insane bulk makes it a great switch-in to priority moves such as Mamoswine's Ice Shard and Dragonite's Extreme Speed and opposing revenge killers like Choice Scarf Greninja that can pick off a weakened Mega Lopunny. It can shrug off these assaults and Teleport out, reliably bringing Mega Lopunny back in.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Normal analysis by", "members": [{"user_id": 321991, "username": "Mateeus"}]}, {"name": "Quality checked by", "members": [{"user_id": 473171, "username": "DugZa"}, {"user_id": 305839, "username": "maroon"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}]}], "writtenBy": [{"user_id": 321991, "username": "Mateeus"}]}
  },
  "Hippowdon": {
    "comments": "<h1>Other Options</h1> <section><h1>Ground</h1> <p>Hippowdon can opt to run Eject Button, as it helps bring teammates safely into the field, specifically Excadrill, once sand has been set up. Hippowdon can also choose to run Toxic in lieu of Whirlwind or Stealth Rock, but only if a teammate is running Stealth Rock in the case of the latter. An EV spread of 252 HP / 128 Def / 128 SpD can be used to better take special attacks, notably letting Hippowdon withstand a Fire Blast or Solar Beam from Mega Charizard Y from full while avoiding a OHKO and 2HKO, respectively, from Grass Knot and Hidden Power Ice against Tapu Koko.</p> </section><h1>Checks and Counters</h1> <section><h1>Ground</h1> <p><strong>Water-types: Hippowdon is easily dealt with by strong Water-type Pokemon like Greninja, Mega Swampert, and Urshifu-R with their super effective STAB moves, while defensive Water-types like Mantine and Gastrodon can threaten it with Scald while Hippowdon fails to do much in return.</p> <p><strong>Grass-types: Not only do Grass-types like Serperior, Tapu Bulu, and Rillaboom resist Earthquake, but they also threaten to KO Hippowdon with their respective Grass-type STAB options. Defensive Grass-types like Mega Venusaur take very little damage from Earthquake and in return deal large amounts of damage with Giga Drain, and Ferrothorn can set up Stealth Rock or Spikes against Hippowdon with ease.</p> <p><strong>Special Wallbreakers: Due to its average Special Defense stat, special attackers like Tapu Lele, Volcarona, and Latios can break through Hippowdon with their strong coverage and STAB moves.</p> <p><strong>Weather Setters: Opposing weather setters like Pelipper and Alolan Ninetales make Hippowdon a less reliable sand setter for its teammates. Pelipper and Alolan Ninetales can also threaten to KO Hippowdon with their super effective STAB Water- and Ice-type moves, respectively.</p> <p><strong>Status: Burn and poison cripple Hippowdon's ability to function as a reliable wall. Toxic puts Hippowdon on a timer, making it more easily dealt with by foes, while burn negates Leftovers recovery and reduces its damage output from Earthquake.</p> </section>",
    "sets": [
      {
        "name": "Physically Defensive (Ground)",
        "description": "<p>Summoning sand on switch-in and having an amazing Defense stat, in conjunction with access to utility moves such as Stealth Rock, Slack Off, and Whirlwind, make Hippowdon a great wall for any sand-based Ground-type team. Stealth Rock most notably helps against Flying- and Bug-types and breaks Focus Sash and Sturdy for Hippowdon's teammates to break through their users more easily. Earthquake deals solid damage and prevents Hippowdon from being completely useless against Taunt users such as Kommo-o. Slack Off in tandem with Leftovers provides reliable recovery for Hippowdon, increasing its longevity throughout the game. Whirlwind phazes setup sweepers such as Mega Scizor and Mega Altaria that try to take advantage of Hippowdon while also forcefully chipping down foes when combined with Stealth Rock. Maximum HP and Defense EVs along with a Impish nature allow Hippowdon to be as physically bulky as possible to deal with physical attackers such as Bisharp, Mega Lopunny, and Excadrill.</p> <p>Excadrill is Hippowdon's best teammate, greatly benefits from Hippowdon's sand doubling its speed thanks to Sand Rush. Excadrill can also deal with threats like Kyurem, Tapu Lele, and Tapu Bulu for Hippowdon under sand and get rid of Spikes and Toxic Spikes for it with Rapid Spin. Seismitoad and Gastrodon can freely switch in against any Water-type move directed at Hippowdon, and Seismitoad can deal with Azumarill, while Gastrodon can use Clear Smog to deal with setup sweepers such as Kommo-o that Hippowdon falls short against. Mega Garchomp also appreciates sand set up by Hippowdon which further increases the damage done by its Rock- and Ground-type attacks. Landorus can break through Grass-type teams, deal with Grass-type threats like Ferrothorn and Tapu Bulu and also provide the team with a solid special wallbreaker. It can also set up Gravity, helping against Flying-types like Celesteela and Skarmory. Mega Steelix is a great teammate, as it can switch in against physical attackers that Hippowdon is threatened by, like Tapu Bulu, while also aiding greatly in matchups such as Dragon, Normal, and Fairy. Much like Landorus, Nidoking can act a great special attacker, breaking through Flying-, Water-, and Steel-type teams through its great Sheer Force-boosted coverage options in Flamethrower, Thunderbolt, and Ice Beam. Nidoking can also provide Toxic Spikes support, which helps greatly in matchups like Psychic and Fairy. Mamoswine is a great teammate that can improve the Flying-, Grass-, and Dragon-type matchups while also providing a semi-reliable switch-in against Ice-type attacks directed at Hippowdon thanks to Thick Fat. Gliscor is a great stallbreaker and absorber of status moves directed at Hippowdon, and it can opt to run Defog if necessary, providing a means of hazard control.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Ground analysis by", "members": [{"user_id": 473171, "username": "DugZa"}]}, {"name": "Quality checked by", "members": [{"user_id": 491896, "username": "Rotten"}, {"user_id": 305839, "username": "maroon"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 473171, "username": "DugZa"}]}
  },
  "Mamoswine": {
    "comments": "<h1>Other Options</h1> <section><h1>Ground</h1> <p>A Jolly nature allows Mamoswine to outspeed offensive Heatran, but it doesn't outspeed anything else significant because Mamoswine can already KO foes like Nidoking with Ice Shard, and it has less breaking power without Adamant. Choice Scarf turns Mamoswine into a decent revenge killer that can outspeed the likes of Tapu Koko, Zeraora, and Barraskewda without rain, but it loses a ton of extra damage output without Choice Band, making it more difficult to wallbreak.</p> </section><h1>Checks and Counters</h1> <section><h1>Ground</h1> <p><strong>Physically Defensive Walls: Physically defensive walls such as Mega Slowbro, Skarmory, and Swampert are able to take attacks from Mamoswine and wear it down with Scald, Body Press, or Flip Turn, respectively. However, Swampert's lack of reliable recovery means that it can easily be pressured by Mamoswine's teammates.</p> <p><strong>Status: Burn significantly reduces Mamoswine's damage output, leaving it unable to function as a wallbreaker. Toxic consistently wears Mamoswine down, making it difficult for it to stay in the field for a long time.</p> <p><strong>Water-types</strong>: Offensive Water-types such as Mega Swampert, Urshifu-R, and Mega Gyarados can outspeed Mamoswine and KO it with their STAB moves. Bulky Water-types such as Tapu Fini, Slowbro, Swampert, and Suicune are able to tank attacks from Mamoswine and 2HKO it with Scald, with Tapu Fini and Suicune outspeeding Mamoswine as well.</p> <p><strong>Rotom-W: Rotom-W is one of the most consistent checks to Mamoswine, being immune to its Earthquake due to Levitate and resisting its Icicle Crash. Rotom-W is able to either KO Mamoswine with a powerful Hydro Pump or cripple it or another teammate with Will-O-Wisp or Toxic.</p> <p><strong>Fighting-types</strong>: Fighting-types like Heracross, Mega Gallade, Terrakion, and Kommo-o after a boost can all outspeed Mamoswine and KO it with their STAB moves.</p> <p><strong>Revenge Killers: Mamoswine sits at a mediocre Speed tier for an offensive Pokemon, making it outsped and KOed by a myriad of powerful revenge killers such as Mega Lopunny, Keldeo, Tapu Lele, Blacephalon, and Rillaboom due to Grassy Glide.</p> </section>",
    "sets": [
      {
        "name": "Choice Band (Ground)",
        "description": "<p>Mamoswine's good Attack stat and daunting STAB combination make it an excellent wallbreaker that can help against types like Flying and Dragon, which are otherwise poor matchups for Ground teams. Icicle Crash allows it to get rid of Mandibuzz, Tapu Bulu, and Dragonite. Ice Shard provides useful priority for fast threats like Landorus, Hydreigon, Latias, and Latios, especially if they are weakened. Superpower is a useful move for targeting Ferrothorn and Porygon2; however, Knock Off gets rid of items like Eviolite, Leftovers, and Heavy-Duty Boots from Pokemon such as Galarian Corsola, Porygon2, Celesteela, and Blissey. An Adamant nature paired with a Choice Band maximizes Mamoswine's damage output, letting it pick off weakened threats with Ice Shard better and have a better chance of KOing a weakened Celesteela or Corviknight. Thick Fat is the preferred ability to give Ground teams a useful resistance to Ice-type attacks. Generally, Mamoswine should be used to wallbreak types like Flying, Poison, and Dragon early-game, and it can clean weakened teams with Ice Shard late-game.</p> <p>Hippowdon is a great partner, as it tanks hits for Mamoswine due to its good bulk, can phaze out threatening foes like Mega Scizor and Mega Gallade with Whirlwind, and provide Stealth Rock and Sand Stream support, which gives Mamoswine an easier time sweeping late-game by racking chip damage on foes. Landorus is an essential wallbreaker, as it can not only break through physically defensive foes like Slowbro and Mega Sableye for Mamoswine, but utilize Gravity in order to make Mamoswine's Earthquake useful against threats like Celesteela, Rotom-W, and Corviknight. Gastrodon and Seismitoad can absorb Water-type attacks for Mamoswine; Gastrodon has access to reliable recovery, and Seismitoad can outspeed and threaten Azumarill as well as use its higher physical bulk to take attacks from Pokemon like Barraskewda more easily. Excadrill is a dangerous sweeper under Hippowdon's sand due to Sand Rush, which allows it to outspeed fast threats like Mega Lopunny and Terrakion for Mamoswine, and it provides Rapid Spin support while breaking past physically defensive foes like Mega Sableye, Porygon2, and Avalugg with Steelium Z and Swords Dance. Garchomp can break through most walls due to Swords Dance and Dragonium Z while weakening Celesteela with Fire Fang and providing a useful neutrality to Water- and Grass-type attacks. Mega Garchomp can destroy foes like Celesteela and Ferrothorn with Fire Blast while living an Aqua Jet from +6 Azumarill and threatening it back with a Sand Force-boosted Earthquake. Mega Steelix is a powerful bulky sweeper with Curse that can also live a hit from +6 Azumarill's Aqua Jet and threaten it back with Heavy Slam, and it also threatens other foes like Tapu Bulu and Rillaboom.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Ground analysis by", "members": [{"user_id": 491896, "username": "Rotten"}]}, {"name": "Quality checked by", "members": [{"user_id": 473171, "username": "DugZa"}, {"user_id": 305839, "username": "maroon"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 491896, "username": "Rotten"}]}
  },
  "Gallade": {
    "comments": "<h1>Other Options</h1> <section><h1>Psychic</h1> <p>Mega Gallade can opt to run Bulk Up and Drain Punch in lieu of Swords Dance and Close Combat; Drain Punch acts as a form of passive recovery, while Bulk Up makes Mega Gallade even tougher for physical attackers to deal with. However, the immediate damage output from Swords Dance and Close Combat is generally preferred. Substitute may be used to help Mega Gallade set up against passive Pokemon like Toxapex while avoiding status conditions from foes like Mega Sableye and Rotom-W, and it is opted for on Bulk Up sets, but it forces Mega Gallade to give up Knock Off or Shadow Sneak which are preferred in most cases.</p> </section><h1>Checks and Counters</h1> <section><h1>Psychic</h1> <p><strong>Fairy-types: Fairy-type Pokemon like Mega Diancie and Mimikyu can threaten to OHKO Mega Gallade with their powerful STAB moves. However, Mega Diancie needs to be wary of Mega Gallade winning the speed tie, while Mimikyu is easily threatened if Disguise is broken. Bulky Fairy-types like Hatterene can also check Mega Gallade effectively.</p> <p><strong>Ghost-types: Ghost-type Pokemon such as Gengar and Choice Scarf Blacephalon can outspeed and OHKO Mega Gallade with their Ghost-type STAB moves. However, they need to be wary of Shadow Sneak.</p> <p><strong>Physically Defensive Walls: Physically defensive walls such as Mega Slowbro and Mega Sableye can easily switch in against Mega Gallade and proceed to burn it with Scald or Will-O-Wisp, respectively. Mega Sableye in particular is immune to both of Mega Gallade's STAB options and takes reduced damage from Knock Off, completely walling Mega Gallade.</p> <p><strong>Revenge Killers: Faster revenge killers such as Mega Lopunny, Zeraora, Tapu Koko, and Choice Scarf Latios can all threaten to KO Mega Gallade after very little chip damage. However, Pokemon weak to Shadow Sneak like Latios need to watch out for it.</p> <p><strong>Status: All forms of status can cripple Mega Gallade greatly. Poison puts Mega Gallade on a timer, limiting its ability to act as a reliable wallbreaker. Paralysis allows Mega Gallade to easily be revenge killed. Burn greatly weakens it as a wallbreaker.</p> </section>",
    "sets": [
      {
        "name": "Swords Dance (Psychic)",
        "description": "<p>An excellent Speed tier, a sky-high Attack stat, and a great secondary type in Fighting that aids greatly against Steel and Dark teams make Mega Gallade an amazing physical wallbreaker on Psychic teams. Swords Dance allows Mega Gallade to further increase its already high Attack stat, allowing it to easily break through a majority of teams and walls like Celesteela. Close Combat is Mega Gallade's primary STAB option, dealing with troublesome Steel-, Dark-, Normal-, and Rock-types like Bisharp, Zarude, Porygon2, and Tyranitar. Zen Headbutt allows it to deal with Poison- and Fighting-types like Mega Venusaur, Toxapex, and Keldeo. Psycho Cut can be used in lieu of Zen Headbutt at the cost of some Base Power as a more accurate option that also avoids damage from Rocky Helmet and Rough Skin, as well as Poison from Toxapex's Baneful Bunker. Knock Off helps against opposing Psychic-types like Slowbro and Victini that resist both of Mega Gallade's STAB options while also helping with Ghost-types like Galarian Corsola and Aegislash. Knock Off also gets rid of items like Leftovers and Heavy-Duty Boots, crippling the foe as a result. Shadow Sneak can be used instead of Knock Off as a form of priority that also helps against fast Psychic- and Ghost-types like Latios and Choice Scarf Blacephalon. However, Knock Off is generally preferred for the increased power against bulky Psychic- and Ghost-types like Slowbro and Galarian Corsola, and Shadow Sneak proves to be counter-productive when paired with Tapu Lele. Justified, prior to Mega Evolution, allows Gallade to switch into weak Dark-type moves like Mega Sableye's Knock Off and gain an Attack boost. Maximum Speed investment along with a Jolly nature makes Mega Gallade outspeed threats like Choice Specs Blacephalon, Keldeo, and Landorus.</p> <p>All of Mega Gallade's teammates appreciate its ability to deal with Dark-types like Hydreigon and Mega Tyranitar. Steel-types like Jirachi and Metagross pair up well with Mega Gallade, as they deal with Fairy-types like Mega Diancie and Clefable that threaten it, and they can better handle Dragon-type attacks like Draco Meteor from Latios and Latias while also being able to provide Stealth Rock support. Victini and Mega Gallade form a formidable physical wallbreaking core while also synergizing well against Steel teams, as Victini deals with threats like Celesteela, while Mega Gallade in return takes care of Heatran reliably. Latios and Latias act as the most reliable Choice Scarf users on Psychic-type teams and can provide Defog support. Latias in particular can provide Healing Wish support for Mega Gallade, which it appreciates greatly. Fairy-types like Hatterene and Tapu Lele further improve the Dark matchup while also dealing with Dragon-type threats like Mega Altaria and Dragonite. Slowbro provides a reliable defensive pivot, can act as a reliable Fire-resistant Pokemon against Pokemon like Cinderace, and is also able to bring Mega Gallade safely into the field thanks to Teleport. Celebi is a great teammate, as it reliably deals with Water- and Ground-types that threaten Mega Gallade such as Mega Swampert and Excadrill. Deoxys-S breaks through Flying-type teams thanks to its BoltBeam coverage in conjunction with Nasty Plot. Albeit not common, Meloetta can provide a reliable switch-in against Ghost-type attacks directed at Mega Gallade from the likes of Gengar and Blacephalon.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Psychic analysis by", "members": [{"user_id": 473171, "username": "DugZa"}]}, {"name": "Quality checked by", "members": [{"user_id": 305839, "username": "maroon"}, {"user_id": 491896, "username": "Rotten"}]}, {"name": "Grammar checked by", "members": [{"user_id": 262594, "username": "Milak"}, {"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 473171, "username": "DugZa"}]}
  },
  "Rotom-Wash": {
    "comments": "<h1>Other Options</h1> <section><h1>Electric</h1> <p>Toxic can be used over Will-O-Wisp to cripple Rotom-W's checks such as Gastrodon, Seismitoad, and Kommo-o, putting them on a timer during a match. However, this restricts Rotom-W's ability to cripple physical attackers like Tapu Bulu and Rillaboom. Rotom-W can run a physically defensive set if Choice Specs Zapdos is used in order to live an Earthquake from Mold Breaker Excadrill at full health and KO it with Hydro Pump.</p> </section><h1>Checks and Counters</h1> <section><h1>Electric</h1> <p><strong>Grass-types: Grass-types such as Rillaboom, Tapu Bulu, and Mega Venusaur can pose huge threats to Rotom-W, as they resist both of its STAB moves and threaten it back with their STAB moves. However, physical Grass-types don't appreciate being burned by Will-O-Wisp on the switch.</p> <p><strong>Dragon-types: Dragon-types such as Mega Altaria, Kommo-o, and Hydreigon can easily threaten Rotom-W, as they also resist both of its STAB moves and can set up on it with ease. Mega Altaria can also circumvent status moves like Will-O-Wisp due to Refresh, which allows it to easily set up with Dragon Dance.</p> <p><strong>Specially Defensive Walls: Specially defensive walls such as Blissey, Celebi, and Alolan Muk can tank numerous hits from Rotom-W and threaten it with their moves, forcing it out as a result.</p> <p><strong>Stallbreakers: Stallbreakers such as Bulk Up Zarude and Kommo-o are large threats to Rotom-W, as they can take both of its STAB moves with ease and freely set up on it without worrying about status moves due to Taunt.</p> <p><strong>Residual Damage: Residual damage such as burn, Toxic, and Stealth Rock can take advantage of Rotom-W's lack of reliable recovery, which negatively impacts its longevity during a match. Burn notably cancels out Rotom-W's Leftovers recovery.</p> <p><strong>Mold Breaker Excadrill</strong>: Excadrill's access to Mold Breaker lets it ignore Levitate and completely break through Rotom-W with Earthquake. However, it's unable to come in on a Hydro Pump or Will-O-Wisp. However, physically defensive variants of Rotom-W can live an Earthquake from Excadrill at full health and KO it with Hydro Pump.</p> <p><strong>Gastrodon and Seismitoad</strong>: Gastrodon and Seismitoad can easily switch in on Rotom-W's Hydro Pump due to their access to Storm Drain and Water Absorb, respectively, while blocking its Volt Switch due to their Ground typing. Gastrodon can then cripple Rotom-W with Toxic, while Seismitoad can weaken Rotom-W with Grass Knot. However, both are put on a timer by Toxic if Rotom-W is running it, which limits their ability to switch in freely.</p> </section>",
    "sets": [
      {
        "name": "Defensive Pivot (Electric)",
        "description": "<p>Rotom-W is a great defensive pivot for Electric teams thanks to its good bulk, Water typing, and Levitate, which combine to let it handle threats like Sand Rush Excadrill, Mamoswine, and Gliscor while threatening them with a powerful STAB Hydro Pump. Additionally, its Water typing means it can check Fire- and Water-types such as Blacephalon, Victini, and Urshifu-R that are otherwise difficult to deal with for Electric teams. Volt Switch can bring in offensive teammates like Tapu Koko, Regieleki, and Zeraora safely in a match. It also works very well in tandem with Hydro Pump, as Rotom-W can pressure numerous Ground-types and prevent them from blocking Volt Switch. Will-O-Wisp cripples physical attackers like Mega Gallade, Weavile, and Garchomp, and it is especially effective against switch-ins like Tapu Bulu and Rillaboom. Pain Split is helpful if Rotom-W is weakened, healing off of high-HP foes such as Blissey. Alternatively, Defog may be used to let Rotom-W act as an entry hazard remover on teams should Zapdos lack Defog. Leftovers gives Rotom-W a form of recovery outside of Pain Split, making it weakened less easily. 44 Speed EVs are used in order to outspeed Jolly Azumarill, while 252 HP and 212 Special Defense EVs along with a Calm nature make Rotom-W more effective against special attackers such as Blacephalon, Greninja, and Choice Specs Pelipper.</p> <p>All teammates benefit from Rotom-W's typing allowing it to notably check Ground-, Fire-, and Water-types such as Sand Rush Excadrill, Mamoswine, Blacephalon, and Urshifu-R, as Electric teams otherwise have limited defensive checks to these Pokemon. Zapdos forms an excellent defensive core with Rotom-W, as Zapdos can deal with Grass-types that give Rotom-W trouble such as Tapu Bulu, Rillaboom, and Ferrothorn. Additionally, Zapdos can take on Mold Breaker Excadrill, which is very problematic for Rotom-W and the rest of Electric teams. Choice Specs Zapdos can also be used to break through additional Grass-types like Mega Venusaur and Cradily with a powerful STAB Hurricane. Tapu Koko and Play Rough Zeraora can deal with numerous Dragon-types that Rotom-W heavily struggles against such as Kommo-o, Mega Latias, and Hydreigon. Additionally, Tapu Koko can pressure troublesome Ground-types for Rotom-W like Gastrodon, Seismitoad, and Swampert with Grass Knot. Zeraora pressures specially defensive walls such as Blissey and Galarian Slowking for Rotom-W. Alolan Raichu can take on threats like Mega Venusaur due to its Psychic typing while utilizing Grass Knot in order to defeat Ground-types that give Rotom-W trouble, such as Gastrodon, Seismitoad, and Swampert. Regieleki appreciates Rotom-W's ability to eliminate most Ground-types with Hydro Pump, giving it a great opportunity to break through the opposing team with its powerful Electric-type moves. Alolan Golem and Magnezone can trap and eliminate Steel-types such as Mold Breaker Excadrill and Ferrothorn, with both often being immune to Excadrill's Earthquake due to Air Balloon.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Electric analysis by", "members": [{"user_id": 491896, "username": "Rotten"}]}, {"name": "Quality checked by", "members": [{"user_id": 305839, "username": "maroon"}, {"user_id": 473171, "username": "DugZa"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 491896, "username": "Rotten"}]}
  },
  "Heatran": {"sets": [{"name": "Offensive (Steel)"}, {"name": "Specially Defensive (Steel)"}]},
  "Victini": {"sets": [{"name": "Choice Band (Psychic)"}, {"name": "Choice Scarf (Psychic)"}]},
  "Excadrill": {
    "comments": "<h1>Other Options</h1> <section><h1>Steel</h1> <p>Leftovers or Focus Sash may be used on Swords Dance Excadrill to improve its longevity and or better ensure at least one KO, but both lower its ability to threaten Flying-types.</p> </section>",
    "sets": [
      {
        "name": "Choice Scarf (Steel)",
        "description": "<p>Excadrill is Steel's go-to revenge killer with its excellent Ground- and Rock-type coverage, which makes it a solid wincon against Fire, Electric, and Poison teams. Earthquake works well with Excadrill's ability, Mold Breaker, allowing it to threaten Rotom-W and Galarian Weezing. Rock Blast may be used over Rock Slide to get past Substitutes from Kyurem and Dragonite's Multiscale, but the damage is highly inconsistent. Toxic allows Excadrill to put Mega Sableye, a huge roadblock for Steel teams, on a timer due to Mold Breaker, in addition to punishing common switch-ins such as Landorus-T, Slowbro, and Porygon2. Rapid Spin removes entry hazards without clearing the hazards Steel teams stack. A Choice Scarf with a Jolly nature lets Excadrill outspeed threats such as unboosted Volcarona, Victini, and Zeraora and boosted Kommo-o.</p> <p>Ferrothorn provides Excadrill with a switch-in to Water-types like Mega Swampert and Slowbro, and it helps Excadrill break through defensive cores with Stealth Rock and Spikes support. Corviknight, Skarmory, or Celesteela provides Excadrill with a Ground immunity. Corviknight can give it a safe switch-in with U-turn and threaten Fighting-types with Brave Bird, Skarmory can set entry hazards so that Excadrill can force progress against bulkier teams, and Celesteela threatens Grass-types like Ferrothorn, Rillaboom, and Zarude with Flamethrower. In return, Excadrill provides an Electric immunity and can take on threats such as Choice Band Zeraora and Tapu Koko. Aegislash and Heatran provide a Fighting and Fire immunity, respectively, and can switch into most special attacks aimed at Excadrill. Heatran, in particular, can nullify V-create from Choice Scarf Victini, which outspeeds Excadrill and poses a huge threat to Steel teams. Wallbreakers such as Bisharp, Mega Scizor, and Choice Specs Aegislash can pressure physical walls such as Porygon2, Slowbro, and Mega Venusaur, which helps Excadrill clean opposing Normal, Psychic, and Poison teams late-game.</p> "
      },
      {
        "name": "Swords Dance (Steel)",
        "description": "<p>With Swords Dance, Excadrill becomes a threatening sweeper and late-game cleaner, as it can break through bulky Pokemon such as Toxapex, Melmetal, and Mandibuzz. Rock Slide deals with Flying-types that switch into Excadrill such as Crobat, Zapdos, and Mega Charizard Y. Rapid Spin boosts Excadrill's Speed, letting it take advantage of forced switches and outspeed checks such as Gengar, Zeraora, and Mega Charizard Y. Rockium Z allows Excadrill to bypass checks in Celesteela and Mandibuzz, as well as ensuring the OHKO on both Mega Charizard X and Mega Charizard Y.</p> <p>Ferrothorn can take on Water- and Ground-type moves from Urshifu-R and Mega Swampert aimed at Excadrill, and it also sets entry hazards to help Excadrill break down the opposing team. Aegislash provides a Fighting immunity and can weaken checks such as Slowbro and Mantine with Toxic. Heatran provides a Fire immunity and can check threats like Victini and Volcarona, which Swords Dance Excadrill cannot due to not running Choice Scarf. Corviknight and Skarmory provide a Ground immunity and can check Fighting-types such as Terrakion. Alternatively, Celesteela may be used as the Ground-immune partner, as it can handle offensive threats such as Rillaboom and Mega Diancie that Excadrill struggles with. These Ground-immune teammates also lure in Electric-types such as Tapu Koko and Magnezone, which Excadrill can set up on. Choice Scarf Magnezone forms a good wallbreaking core with Excadrill, as it removes Steel-types like Skarmory and Ferrothorn that Excadrill struggles with, as well as removing threats like Keldeo and Urshifu-R. Jirachi and Mega Scizor benefit from Excadrill's wallbreaking abilities, as they can clean late-game against Poison and Flying teams and Dragon and Fighting teams, respectively.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Steel analysis by", "members": [{"user_id": 542526, "username": "Neko"}]}, {"name": "Quality checked by", "members": [{"user_id": 305839, "username": "maroon"}, {"user_id": 290520, "username": "felines"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 542526, "username": "Neko"}]}
  },
  "Darmanitan-Galar": {
    "comments": "<h1>Other Options</h1> <section><h1>Ice</h1> <p>Galarian Darmanitan has no other viable options.</p> </section><h1>Checks and Counters</h1> <section><h1>Ice</h1> <p><strong>Physically Defensive Walls</strong>: While Galarian Darmanitan has amazing damage output, it struggles to get past extremely bulky physical walls such as Galarian Corsola, Mega Slowbro, and Porygon2, especially if it's running Choice Scarf. As a result, they are able to wear it down with their status or attacking moves. However, Choice Band variants of Galarian Darmanitan can 2HKO these walls.</p> <p><strong>Rotom-W: Rotom-W is an extremely effective check to Galarian Darmanitan; it resists both Icicle Crash and Flare Blitz, is immune to Earthquake due to Levitate, and threatens to wear it down with Hydro Pump or cripple it with Will-O-Wisp.</p> <p><strong>Status</strong>: Burn greatly hinders Galarian Darmanitan's wallbreaking. Paralysis leaves it more easily revenge killed, and Toxic puts it on a timer; both problems are worsened by its fragility and vulnerability to entry hazards.</p> <p><strong>Priority Moves</strong>: Offensive Pokemon carrying priority moves like Rillaboom, Bisharp, and Dragonite can take advantage of Galarian Darmanitan's middling bulk. However, Pokemon carrying weaker priority moves like Zygarde-10% need it to be heavily chipped before attempting to KO it.</p> <p><strong>Revenge Killers: Choice Scarf Galarian Darmanitan can be promptly OHKOed by faster Choice Scarf users like Blacephalon, Terrakion, Latias, and Nihilego. Choice Band Galarian Darmanitan is outsped and OHKOed by a plethora of offensive threats like Tapu Koko, Mega Lopunny, Mega Aerodactyl, and Hydreigon, so it must be extremely wary of them.</p> </section>",
    "sets": [
      {
        "name": "Choice Scarf (Ice)",
        "description": "<p>Galarian Darmanitan is one of the best revenge killers on Ice teams due to its amazing coverage moves and generally high Attack stat boosted by Gorilla Tactics, which make it a decent wallbreaker as well. Flare Blitz lets Galarian Darmanitan KO Steel-types such as Celesteela, Aegislash, Ferrothorn, and Corviknight, which are massive threats to Ice teams. Earthquake provides good coverage against Toxapex, Heatran, and Torkoal, which otherwise completely wall Galarian Darmanitan. Earthquake is also useful for SubToxic Aegislash, as it doesn't activate King's Shield, unlike Flare Blitz. U-turn safely brings in a teammate to deal with a check to Galarian Darmanitan like Rotom-W or Galarian Corsola. Maximum Speed investment along with a Jolly nature allows Galarian Darmanitan to outspeed foes like Mega Aerodactyl, Choice Scarf Landorus-T, and Choice Scarf Excadrill. Galarian Darmanitan should be used to clean weakened teams late-game once bulky walls such as Porygon2 and Swampert are severely weakened or removed. Due to its poor bulk and vulnerability to entry hazards, notably Stealth Rock, it should avoid switching in excessively.</p> <p>Alolan Ninetales is useful in order to deal with bulky Water-types that pressure Galarian Darmanitan such as Tapu Fini, Rotom-W, and Mega Slowbro with Freeze-Dry, as well as Fighting-types like Keldeo. Additionally, it provides valuable support with Aurora Veil. Avalugg is an extremely useful defensive teammate to deal with physical threats that outspeed Galarian Darmanitan such as Choice Scarf Weavile, Mega Swampert in rain, and Barraskewda in rain. It also removes entry hazards for it with Rapid Spin. Defensive Cloyster can also remove entry hazards and provides Spikes and Toxic Spikes support. Choice Specs Kyurem deals with physically defensive walls such as Porygon2, Galarian Corsola, and Swampert for Galarian Darmanitan due to its power and amazing coverage. Mamoswine is a good offensive partner with Galarian Darmanitan, crippling its usual checks like Galarian Corsola and Porygon2 with Knock Off while acting as a secondary way to deal with Steel teams. It also appreciates Galarian Darmanitan forcing out Steel-types like Celesteela, Ferrothorn, and Skarmory, which Mamoswine needs chip damage on to successfully KO. Piloswine can be used instead as a great wall to deal with Fire-types like Choice Scarf Blacephalon and Volcarona thanks to the combination of Thick Fat and Eviolite. It also provides Stealth Rock support for Galarian Darmanitan while dealing with other special attackers like Tapu Koko, Nihilego, and Alolan Raichu. Choice Scarf Weavile can greatly help in the Ghost and Psychic matchups, dealing with faster Choice Scarf users like Latias, Jirachi, and Blacephalon.</p> "
      },
      {
        "name": "Choice Band (Ice)",
        "description": "<p>Choice Band Galarian Darmanitan is one of the most lethal wallbreakers on Ice teams due to its Gorilla Tactics-boosted Attack, allowing it to easily break through types with defensive cores such as Dark, Normal, and Poison. Flare Blitz OHKOes troublesome Steel-types like Celesteela, Aegislash, Ferrothorn, and Skarmory after Stealth Rock damage. Earthquake lets Galarian Darmanitan deal with key targets such as Heatran, Toxapex, and Torkoal. U-turn is useful to bring in teammates safely while maintaining offensive momentum. Maximum Speed investment with a Jolly nature lets Galarian Darmanitan outspeed foes such as Mega Garchomp, Nidoking, and unboosted Kommo-o. Galarian Darmanitan should be used as an early-game wallbreaker to take advantage of types with defensive Pokemon, like Dark, Normal, Poison, and punch holes in the opposing team.</p> <p>Alolan Ninetales is a great teammate to deal with troublesome Fighting-types such as Mega Gallade, Keldeo, and Urshifu-R for Galarian Darmanitan, as well as Dark-types that outspeed it such as Hydreigon and Choice Scarf Weavile, while providing Aurora Veil support. Avalugg is an amazing defensive partner, as it deals with physical attackers that outspeed and KO Galarian Darmanitan like Zeraora, Mega Aerodactyl, and Mega Swampert while also providing Rapid Spin support. Piloswine is an excellent specially defensive wall that can deal with special Fire-types like Volcarona and Blacephalon due to Thick Fat and Eviolite. It also provides Stealth Rock support and deals with additional special attackers that outspeed and threaten Galarian Darmanitan like Latios, Hydreigon, and Thundurus-T. Choice Specs Kyurem can defeat extremely bulky physical walls for Galarian Darmanitan like Galarian Corsola and Porygon2, easing pressure off of it. It also breaks through bulky Water-types like Swampert, Mega Slowbro, and Rotom-W with Freeze-Dry. Choice Scarf Weavile deals with threatening Ghost- and Psychic-types like Gengar, Latias, and Latios.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Ice analysis by", "members": [{"user_id": 491896, "username": "Rotten"}]}, {"name": "Quality checked by", "members": [{"user_id": 305839, "username": "maroon"}, {"user_id": 473171, "username": "DugZa"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 491896, "username": "Rotten"}]}
  },
  "Ferrothorn": {
    "comments": "<h1>Other Options</h1> <section><h1>Steel</h1> <p>Ferrothorn can run Stealth Rock instead of Spikes if no other Pokemon on the team has it or it is paired with Skarmory, which can set up its own Spikes. However, it is outclassed as a Stealth Rock setter by Heatran. Knock Off, Toxic, and Thunder Wave have a lot of utility and disadvantage many of Ferrothorn's switch-ins. Knock Off removes valuable items such as Eviolite from Porygon2; Toxic cripples certain bulky switch-ins such as Torkoal, Kyurem, and Landorus-Therian; Thunder Wave cripples fast threats such as Cinderace and Volcarona. It should be noted that running one of these moves forces Ferrothorn to forgo one of its other valuable move slots.</p> </section><h1>Checks and Counters</h1> <section><h1>Steel</h1> <p><strong>Fire-types and Coverage: Because of Ferrothorn's 4x weakness to Fire, it gets OHKOed by most STAB Fire-type attacks. Even Pokemon with common Fire-type coverage moves such as Nidoking or Clefable can OHKO or 2HKO Ferrothorn.</p> <p><strong>Fighting-types and Coverage: Although Ferrothorn is not as weak to Fighting-types as it is to Fire-types, many Fighting-types such as Keldeo and Galarian Zapdos threaten to OHKO it. Ferrothorn can, however, use Protect to scout which of these Pokemon are using Choice sets. Breloom is particularly threatening, as it is not vulnerable to any attack from Ferrothorn and can even set up Swords Dance in front of it. Ferrothorn also must be wary of Fighting-type coverage moves such as Focus Blast from Tapu Lele.</p> <p><strong>Stallbreakers: As Ferrothorn is a very passive Pokemon, certain stallbreakers such as Gliscor easily take advantage of it, although frail stallbreakers such as Urshifu-R will not want to switch in directly and risk a Leech Seed or Power Whip.</p> <p><strong>Magnet Pull: Magnezone and the less common Alolan Golem can trap Ferrothorn and get rid of it with Hidden Power Fire or Fire Punch, respectively, so they must be carefully played around, though Alolan Golem should be wary of Power Whip.</p> <p><strong>Mega Sableye: Mega Sableye bounces back Ferrothorn's Spikes and Leech Seed and tanks Power Whip, especially after Ferrothorn is burned by a potential foe like Galarian Corsola.</p> <p><strong>Wallbreakers: Certain wallbreakers such as Choice Specs Pelipper, Galarian Moltres, and Mega Garchomp power through Ferrothorn even with Leech Seed recovery. Galarian Moltres even sets up on Ferrothorn freely, although it does have to be cautious of being worn down by Leech Seed or crippled by Toxic or Thunder Wave.</p> </section>",
    "sets": [
      {
        "name": "Defensive (Steel)",
        "description": "<p>Ferrothorn is a great defensive pivot for Steel teams because of its excellent defensive typing, which packs a valuable resistance to Water- and Electric-type attacks, good bulk, and ability to provide entry hazards for its team. Leech Seed is Ferrothorn's main form of recovery and inflicts passive damage on opposing threats such as Toxapex. With Protect, Ferrothorn gets an extra turn of Leech Seed and Leftovers recovery and the ability to scout Choice item users like Diggersby, Mamoswine, and Blacephalon. Power Whip hits Ground- and Water-types; it OHKOes Mega Swampert, Seismitoad, and Gastrodon, and heavily damages Urshifu-R, Excadrill, and Keldeo. It also makes Ferrothorn less passive in general, as it can hit frail offensive threats like Tapu Koko and Tapu Lele hard. Spikes provides a great way to capitalize on other defensive Pokemon that like to switch into Ferrothorn, such as Heatran. The EV spread gives Ferrothorn enough Special Defense to withstand a Focus Blast from Landorus most of the time, and enough Defense to increase its overall effectiveness against physical threats like Choice Band Excadrill and Zeraora.</p> <p>Every Pokemon on a Steel teams benefits from Ferrothorn's ability to pivot into most Water- and Electric-types and set up Spikes to wear down the opposing team. Flying-types like Celesteela, Skarmory, and Corviknight switch into Fighting-types like Mega Gallade for Ferrothorn. In return, they gain from Ferrothorn checking threats such as Tapu Koko and Kingdra. Heatran is also one of the best partners for Ferrothorn, as it pivots into Fire-type attacks that usually greatly threaten Ferrothorn and beats opposing Steel-types that wall Ferrothorn like Skarmory. Ferrothorn then switches into Water-type attacks in Heatrans stead. Aegislash also helps with Ferrothorn's weaknesses, as it is immune to Fighting-type attacks, and prevents Rapid Spin from removing Ferrothorn's Spikes. Due to its typing, bulk, and ability to set up, Mega Scizor checks certain Fighting-types such as Mega Lopunny. In return, Mega Scizor excels with Spikes support from Ferrothorn, as it becomes that much easier to sweep with Bullet Punch later in the game. Z-Happy Hour Jirachi and Bisharp are other similar late-game sweepers that capitalize off of Ferrothorn's Spikes support and chip damage. Jirachi's Psychic typing makes it a good answer to troublesome Fighting-types like Keldeo and Kommo-o, while Bisharp takes on Psychic- and Ghost-type foes such as Latias, Aegislash, and Latios. Magnezone traps and removes opposing Steel-types like Celesteela, which threatens Ferrothorn with Flamethrower, and opposing Ferrothorn, which may set up its own entry hazards. Scarf Excadrill revenge kills Fire-types like Blacephalon, provides a secondary check to Electric-types, and pairs well with Ferrothorn's resistance to Water-types and Spikes support for cleaning up late-game.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Steel analysis by", "members": [{"user_id": 290520, "username": "Felines"}]}, {"name": "Quality checked by", "members": [{"user_id": 321991, "username": "Mateeus"}, {"user_id": 491896, "username": "Rotten"}]}, {"name": "Grammar checked by", "members": [{"user_id": 192841, "username": "dave"}]}], "writtenBy": [{"user_id": 290520, "username": "Felines"}]}
  },
  "Mandibuzz": {
    "comments": "<h1>Other Options</h1> <section><h1>Dark</h1> <p>Toxic can be used over U-turn to cripple defensive Pokemon like Porygon2, Hippowdon, and Avalugg; however, Mandibuzz then misses out on U-turn, which is very much appreciated thanks to it being able to swing in momentum for free against a predicted switch-in. Taunt is also an option over U-turn to prevent walls like Toxapex, Blissey, and Celesteela from using status moves, helping Mandibuzz wear them down. Knock Off can be used over Foul Play to annoy walls like Toxapex, Porygon2, and Blissey, but without Foul Play, Mandibuzz cannot punish threatening setup sweepers like Azumarill and Mega Gallade.</p> </section><h1>Checks and Counters</h1> <section><h1>Dark</h1> <p><strong>Fairy-types: Fairy-types like Mega Diancie, Tapu Lele, and Hatterene have little to no trouble beating Mandibuzz.</p> <p><strong>Status: As a defensive Pokemon that is intended to be used for longer games, Mandibuzz finds itself susceptible to statuses like Toxic poison and paralysis. Toxic puts it on a timer, while paralysis can prevent it from performing its role effectively.</p> <p><strong>Super Effective Attacks</strong>: Super effective attacks from Pokemon like Alolan Raichu, Terrakion, and Galarian Darmanitan can make Mandibuzz extremely weakened or even OHKO it.</p> <p><strong>Wallbreakers: Mandibuzz has trouble facing extremely powerful wallbreakers like Mega Heracross and Greninja, which can break it apart easily.</p> <p><strong>Stallbreakers: Common stallbreakers like Gliscor and Mew can completely shut down Mandibuzz with Taunt, cripple it with Toxic or Will-O-Wisp, and prevent it from recovering its health.</p> <p><strong>Walls: Mandibuzz struggles to get past certain walls on its own such as Toxapex, Amoonguss, and Zapdos, as even Taunt variants cannot stop them due to their massive bulk.</p> </section>",
    "sets": [
      {
        "name": "Defensive Pivot (Dark)",
        "description": "<p>Thanks to its good defensive stats, neutrality against Fighting- and Bug-type attacks, and good utility moves, Mandibuzz performs the role of a premiere utility support Pokemon for Dark-type teams, making it usable even on hyper offense archetypes. Foul Play lets Mandibuzz greatly damage physical attackers like Mega Gallade, Dragonite, and Victini while also punishing setup sweepers like Mega Scizor, Mega Charizard X, and Excadrill. Roost allows Mandibuzz to keep itself healthy, giving it longevity and thus allowing it to be an effective defensive pivot throughout the game. Defog is a good utility move that is greatly appreciated by teammates of Mandibuzz, as it keeps them safe from entry hazards like Sticky Web and Toxic Spikes that may plague the entire team. Lastly, U-turn lets Mandibuzz gain momentum on a predicted switch-in against it and bring in an appropriate teammate in the battle safely. 16 Speed EVs let it outspeed Adamant Belly Drum Azumarill and check it with Foul Play. The rest of the EVs are invested into HP and Defense to optimize its overall bulk. Heavy-Duty Boots is used as an item so that Mandibuzz can freely switch in without getting chipped down by Stealth Rock, making it harder for the opposing team to wear it down. Overcoat makes Mandibuzz immune to Spore from Breloom and Amoonguss while also keeping it safe from sand and hail damage.</p> <p>Teammates like Weavile and Greninja like Mandibuzz switching in against physical attacks aimed at them from Pokemon like Excadrill and it creating momentum with U-turn to bring them in safely as well as clearing entry hazards away and allowing them to wallbreak foes much more effectively. Specially defensive Tyranitar can form a defensive core with Mandibuzz, since it can take on special attacks aimed at Mandibuzz while also providing Stealth Rock and Thunder Wave support. Mega Sableye takes the pressure off of Mandibuzz and can check threats like Mega Gallade that can otherwise break apart Dark-type teams, additionally bouncing back any status move aimed at Mandibuzz from Pokemon like Gastrodon and Swampert. It also does great against opposing entry hazard setters like Tyranitar, Blissey, and Ferrothorn. Hydreigon can take care of walls like Toxapex and Hippowdon that Mandibuzz can struggle against. Alolan Muk and Bisharp can cover Fairy-types like Clefable. The former can also absorb special attacks aimed at Mandibuzz well and act as a good wincon when running Curse, while the latter is a good setup sweeper and wallbreaker against defensive types like Poison. Zarude can cover Water-type teams and beat threatening Pokemon like Urshifu-R.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 473171, "username": "DugZa"}, {"user_id": 305839, "username": "maroon"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}]}], "writtenBy": [{"user_id": 320110, "username": "Harpp"}]}
  },
  "Volcarona": {
    "comments": "<h1>Other Options</h1> <section><h1>Bug</h1> <p>Flamethrower can be used over Fire Blast due to its higher accuracy and PP, but Fire Blast is preferred due to its higher power and stronger Inferno Overdrive. After a Quiver Dance boost, Fire Blast also guarantees OHKOs against threats like Landorus-T and Zeraora while Flamethrower is a very low roll to OHKO. Hidden Power Electric can work over Hidden Power Ground to deal with Mantine better, but then Volcarona struggles against Heatran. Bug Buzz can be used in the last moveslot as a secondary STAB move that deals with Dark- and Psychic-types such as Hydregion and Latias, but Volcarona's teammates already takes care of those Pokemon adequately. Roost can also be used for extra longevity but it generally prefers its coverage moves to effectively sweep teams.</p> </section><h1>Checks and Counters</h1> <section><h1>Bug</h1> <p><strong>Status: Status such as paralysis and Toxic poison greatly cripples Volcarona as a sweeper, with paralysis leaving it revenge killed even with Speed boosts.</p> <p><strong>Revenge Killers</strong>: Faster Choice Scarf users such as Nihilego and Terrakion are able to OHKO Volcarona even after a Quiver Dance due to their high Speed stats and super effective attacks.</p> <p><strong>Priority Users: Pokemon such as Azumarill and Mega Pinsir threaten to KO Volcarona after some prior chip damage thanks to their strong priority moves.</p> <p><strong>Haze Users and Phazers: Pokemon such as Mantine and Empoleon are tough for Volcarona to break through, as they can live a hit and remove its boosts with Haze and Roar, respectively, although Empoleon needs to be careful of a Inferno Overdrive KOing it after some prior chip damage.</p> <p><strong>Specially Defensive Pokemon: Special walls such as Blissey, Mantine, Araquanid, and specially defensive Tyranitar take very little damage from Volcarona's attacks, and the former two can threaten it with Toxic, while the latter two can OHKO it with their STAB moves. Volcarona lacking Hidden Power Ground struggles greatly against Heatran, which takes little or no damage from any of Volcarona's moves while threatening it with Toxic.</p> <p><strong>Stealth Rock: Volcarona running a Z-Crystal instead of Heavy-Duty Boots struggles greatly to switch in and set up with Stealth Rock up.</p> </section>",
    "sets": [
      {
        "name": "Quiver Dance (Bug)",
        "description": "<p>Great Special Attack and Speed alongside access to Quiver Dance make Volcarona one of the best setup sweepers in the metagame, helping Bug in tough matchups such as Steel, Electric, and Poison. Fire Blast hits walls such as Gliscor and Mandibuzz hard and beats Steel-types such as Celesteela and Ferrothorn. Psychic helps Volcarona in dealing with troublesome Poison types such as Toxapex. Hidden Power Ground bypasses Heatran after its Air Balloon has been popped, which can otherwise wall it. Giga Drain can be used instead to nail bulky Water- and Ground-types such as Gastrodon, Slowking, and Hippowdon while also granting a bit of recovery. Heavy-Duty Boots allows Volcarona to switch in throughout the game despite its huge Stealth Rock weakness. Volcarona should try setting up against a passive Pokemon like Toxapex or Mandibuzz once its checks such as Mantine are weakened or KOed, allowing it to pull off a clean sweep. Maximum Speed investment with a Timid nature allows Volcarona to outspeed Pokemon like Tapu Lele and Mimikyu unboosted while outspeeding Choice Scarf users such as Excadrill and Landorus-T after a Quiver Dance boost.</p> <p>Choice Scarf users like Buzzwole and Heracross are great partners to revenge kill faster threats such as Garchomp and Mega Lopunny. Volcarona in return can weaken opposing teams, allowing them to clean with Beast Boost and Moxie boosts, respectively. Heracross can also Pursuit trap offensive Heatran and pop its Air Balloon, thus allowing Volcarona to KO it with Hidden Power Ground, while Buzzwole helps against Dragon- and Ground-types like Landorus and Zygarde-10% with Ice Punch. Shuckle provides Stealth Rock and Sticky Web support; Stealth Rock chips foes while also breaking Focus Sash and Sturdy, while Sticky Web allows Volcarona to outspeed Choice Scarf users like Greninja and Nihilego after a boost. Araquanid can switch into strong special Water-type attacks directed towards Volcarona while also checking Fire-types such as Mega Charizard Y that resist Volcarona's coverage. Galvantula is also helpful in beating Water- and Flying-types such as Toxapex and Mantine. Furthermore, both Araquanid and Galvantula can also provide Sticky Web support. Scizor is great to deal with Rock-types like Tyranitar and Mega Diancie and Pursuit trap threats to Volcarona such as Choice Scarf Latias, and Choice Band Victini after the V-Create Speed drop. Mega Scizor also forms a great offensive core with Volcarona, taking on special walls such as Blissey while Volcarona handles physical ones such as Celesteela and Hippowdon. Mega Pinsir is helpful against Choice Scarf users like Keldeo and Zarude, which could threaten Volcarona, with its strong priority in Quick Attack while also beating special walls like Tyranitar for it. Scolipede helps deal with offensive Fire- and Rock-types like Blacephalon and Nihilego due to its coverage.</p> "
      },
      {
        "name": "Z-Move (Bug)",
        "description": "<p>Teams with good entry hazard removal can use a Z-Crystal of choice on Volcarona instead of Heavy-Duty Boots, which lets it work as a wallbreaker that breaks through Pokemon like Hippowdon and Toxapex after a Quiver Dance boost. Quiver Dance notably allows Volcarona to outspeed threats like Tapu Koko and Zygarde-10% after a boost. Fire Blast hits neutral targets such as Zapdos for good damage while nailing Grass- and Steel-types like Ferrothorn and Aegislash. Firium Z turns Fire Blast into a one-time nuke in form of Inferno Overdrive, allowing it to OHKO Pokemon such as Mega Venasaur and specially defensive Zapdos after a boost. Volcarona running Firium Z uses Hidden Power Ground to better deal with Steel-type teams by beating Heatran, while Psychium Z variants run Psychic to for strong Shattered Psyche that bypasses one of its biggest checks in Toxapex. Giga Drain helps in hitting bulky Water-types like Slowking and Swampert while acting as a semi-reliable form of recovery. Volcarona should avoid switching in when Stealth Rock is up or getting poisoned or paralyzed, as both greatly harm its sweeping potential. Its checks like Mantine and Tyranitar should also be taken care of before it attempts to pull off a sweep. Maximum Speed investment alongside a Timid nature makes Volcarona outspeed threats like Choice Scarf Excadrill after a boost and Speed tie other base 100s like Galarian Zapdos unboosted.</p> <p>Armaldo and Forretress are mandatory teammates for Z-Move Volcarona, as they can clear Stealth Rock with Rapid Spin while providing their own Stealth Rock support, giving Volcarona an easier time securing KOs. Armaldo can check Fire-types like Choice Scarf Victini with Stone Edge, while Forretress can further bring in Volcarona safely with a slow Volt Switch and also takes on Rock-types such as Terrakion with Gyro Ball. Mega Scizor is great to take on threating Pokemon such as Mega Diancie, Nihilego, and Terrakion with Bullet Punch while also beating special walls such as Mantine and Tyranitar that Volcarona struggles with. Choice Scarf Heracross or Buzzwole further helps Volcarona in dealing with faster threats such as Mega Lopunny and Zarude. Additionally, Heracross can Pursuit trap offensive Heatran and Victini, popping the former's Air Balloon for Volcarona running Hidden Power Ground and potentially removing the latter after a V-Create, while Buzzwole can help against troublesome Dragon- and Flying-types such as Garchomp and Landorus-T with Ice Punch. Mega Heracross is good with Volcarona lacking Hidden Power Ground, as it can take on Heatran. It also forms a good wallbreaking core with Volcarona, helping in the Dark, Normal, and Rock matchups, which Volcarona puts little work in. Specially defensive Araquanid can be useful in dealing with Fire-types such as opposing Volcarona and Mega Charizard Y. Sticky Web support from the likes of Araquanid and Galvantula is greatly appreciated, as it allows Volcarona to outspeed troublesome Pokemon like Choice Scarf Nihilego and Greninja at +1. Choice Band Scizor is an offensive pivot for Volcarona that Pursuit traps Choice Band Victini after V-Create.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Bug analysis by", "members": [{"user_id": 475881, "username": "The Thunderbirds"}]}, {"name": "Quality checked by", "members": [{"user_id": 473171, "username": "DugZa"}, {"user_id": 321991, "username": "Mateeus"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 475881, "username": "The Thunderbirds"}]}
  },
  "Cobalion": {
    "comments": "<h1>Other Options</h1> <section><h1>Fighting</h1> <p>Cobalion can opt for Rocky Helmet in lieu of Leftovers to chip down and punish U-turn users like Mega Scizor and other physical attackers. Both Chople Berry and Occa Berry are options as well, mainly helping against threats like Mega Lopunny and Victini, respectively. However, any other item means that Cobalion loses its only method of recovery. Cobalion can also opt for a more offensive set with Life Orb. However, its middling offensive stats usually leave it unable to do any significant damage.</p> </section><h1>Checks and Counters</h1> <section><h1>Fighting</h1> <p><strong>Burns: Burns heavily cripple Cobalion, reducing its already-low damage output and negating its recovery from Leftovers.</p> <p><strong>Stallbreakers</strong>: Stallbreakers such as Zarude, Mew, and Gliscor have little to no trouble dealing with Cobalion, as Iron Head does very little damage to them.</p> <p><strong>Wallbreakers: Despite Cobalion'ns decent defensive stats, powerful wallbreakers like Choice Specs Tapu Koko and Mega Gallade that outspeed it can comfortably deal large amounts of damage to it with their powerful STAB moves.</p> </section>",
    "sets": [
      {
        "name": "Utility (Fighting)",
        "description": "<p>A good Speed tier, an amazing Defense stat, good utility moves in Taunt, Stealth Rock, and Thunder Wave, and an amazing secondary typing in Steel make Cobalion one of the best defensive pivots Fighting has to offer. Stealth Rock primarily helps against threats weak to it like Choice Specs Zapdos and Alolan Ninetales. Cobalion's decent defensive stats and good Speed mean it can successfully set Stealth Rock more often than not. Iron Head helps against Fairy-types that threaten Fighting-type teams like Mega Diancie and Tapu Lele. Taunt blocks foes from using Taunt and recovery moves, as well as blocking their own entry hazards or Defog to remove Cobalion's Stealth Rock. Thunder Wave is used to cripple faster offensive threats that Cobalion fails to do much against like Deoxys-S and Latios. Volt Switch can be used in lieu of Thunder Wave, making Coballion a great defensive pivot while maintaining offensive momentum. Justified allows it to switch into weak Dark-type attacks from the likes of Mandibuzz and gain an Attack boost. A Jolly nature allows Cobalion to outspeed key threats like both Urshifu-R, Kyurem, Hydreigon, non-Choice Scarf Blacephalon, and Tapu Lele while Speed tying with Pokemon such as Keldeo and Terrakion.</p> <p>All of Cobalion's teammates appreciate it reliably setting up Stealth Rock while also being able to paralyze faster foes for them. Terrakion and Keldeo reliably deal with Fire-types like Volcarona and Victini that threaten Cobalion. Keldeo can also threaten Ground-types that threaten Cobalion such as Landorus and Excadrill. Both Terrakion and Keldeo also appreciate. Volt Switch Cobalion reliably pivoting into them, as do Mega Gallade and Kommo-o looking for good setup opportunities. Mega Gallade also eases matchups such as Poison and Steel where Cobalion fails to do anything significant, and Kommo-o has Taunt to take on opposing walls like Toxapex and Celesteela that deal with Cobalion. Urshifu-S, Heracross, and Buzzwole fit well on Fighting teams because they aid greatly in the Psychic-type matchup. Hawlucha is able to ease the Fighting-type mirror matchup while taking care of Fighting-types that threaten Cobalion, like opposing Keldeo and Choice Scarf users such as Heracross and Buzzwole. Lastly, Breloom can be opted for on certain teams to ease matchups such as Ground and Water where Cobalion fails to do anything of significance besides setting Stealth Rock.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Type analysis by", "members": [{"user_id": 473171, "username": "DugZa"}]}, {"name": "Quality checked by", "members": [{"user_id": 491896, "username": "Rotten"}, {"user_id": 305839, "username": "maroon"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 473171, "username": "DugZa"}]}
  },
  "Landorus": {
    "comments": "<h1>Other Options</h1> <section><h1>Ground</h1> <p>Rock Polish enables Landorus to outspeed foes like Choice Scarf Blacephalon, Choice Scarf Greninja, and Tapu Koko, making it an excellent sweeper. Calm Mind can be used to increase Landorus's power to extreme levels, letting it better damage walls like Swampert and Mega Venusaur. Rock Slide allows Landorus to nail Flying-types like Mantine, Zapdos, and Mega Charizard Y without relying on Gravity. However, replacing Focus Blast with either move makes Landorus unable to deal with foes that it would otherwise beat, such as Hydreigon, Kyurem, and Porygon2. Replacing Gravity, on the other hand, makes Landorus unable to support its teammates or handle Pokemon like Skarmory and Celesteela.</p> </section><h1>Checks and Counters</h1> <section><h1>Ground</h1> <p><strong>Specially Defensive Walls: Specially defensive walls like Blissey and Slowking can act as sturdy checks to Landorus; Blissey can wear it down with Seismic Toss and Toxic, and Slowking can hit it with Scald. Slowking is also able to shrug off the damage Landorus inflicts due to Regenerator. However, Blissey has a chance of getting 2HKOed by Focus Blast.</p> <p><strong>Water-types: Defensive Water-types such as Slowbro, Tapu Fini, and Gastrodon can withstand an Earth Power from Landorus and force it out by dealing heavy damage to it with their STAB moves, while offensive Water-types such as Greninja, Mega Swampert, and Keldeo all outspeed and KO Landorus.</p> <p><strong>Ice-types: Ice-types like Alolan Ninetales, Weavile, and Choice Scarf Galarian Darmanitan all outspeed and threaten Landorus, while Mamoswine can revenge kill it using Ice Shard. However, slower ones like Kyurem and Piloswine take a lot from Focus Blast, and all Ice-types need to be careful of switching into it.</p> <p><strong>Faster Pokemon: Due to Landorus's only average Speed stat, faster Pokemon like Mega Gallade, Latios, and Blacephalon all force Landorus to switch out, as they can otherwise deal huge amounts of damage to it with their STAB moves. However, Landorus can outspeed and dispatch most revenge killers with Rock Polish.</p> </section>",
    "sets": [
      {
        "name": "Wallbreaker (Ground)",
        "description": "<p>Landorus is the premier special wallbreaker on Ground teams, capable of beating troublesome foes like Ferrothorn, Tapu Bulu, and Porygon2 through its amazing coverage moves boosted by the combination of Sheer Force and Life Orb. Earth Power is Landorus's most powerful move, pressuring walls like Mega Sableye, Slowbro, and Gastrodon. Sludge Wave threatens the Grass-types that resist Earth Power, such as Tapu Bulu and Celebi, while OHKOing Fairy-types such as Tapu Lele and Hatterene. Focus Blast nails Dark-, Ice-, and Normal-types, like Hydreigon, Kyurem, and Porygon2, while hitting Skarmory without relying on Gravity and targeting Ferrothorn. Gravity removes Ground immunities from foes that would otherwise check Landorus such as Celesteela, Rotom-W, and Zapdos, making Landorus's Earth Power and its teammates' Ground-type STAB moves much more spammable. It also ensures Focus Blast always lands, heightening Landorus's reliability in the Normal, Dark, and Steel matchups. Life Orb works well in tandem with Sheer Force, which negates Life Orb's recoil and adds to its damage boost. A Timid nature is needed in order for Landorus to outspeed common foes like Victini, Tapu Lele, and Hydreigon.</p> <p>Excadrill pairs extremely well with Landorus, as it can deal with specially defensive walls that Landorus struggles with, such as Blissey and Slowking, while outspeeding fast threats to Landorus like Choice Scarf Weavile, Tapu Koko, and Mega Lopunny when under sand. In return, Landorus can provide valuable support to Excadrill with Gravity, letting it beat its usual checks like Skarmory, Celesteela, and Porygon2, in addition to dealing with physically defensive foes such as Porygon2 and Mega Sableye for it. Hippowdon provides a switch-in against certain foes that can outspeed and threaten Landorus such as Mega Gallade, Cinderace, and Garchomp. It also wears down most foes with Stealth Rock and Sand Stream, which Landorus generally appreciates. Gastrodon and Seismitoad both switch completely freely into Water-type attacks from the likes of Mega Swampert, Keldeo, and Mantine for Landorus. Gastrodon is also able to reliably take and heal off most other moves from Water-types thanks to its high bulk and Recover, while Seismitoad is one of the best ways for Ground teams to offensively deal with them. Mamoswine deals with troublesome Dragon-types such as Latias, Mega Latios, and Dragonite as well as Flying-types that Landorus relies on Gravity in order to beat, like Zapdos and Dragonite. Garchomp and Mega Garchomp are fearsome wallbreakers that pressure specially defensive walls like Blissey and Slowking while providing a Water neutrality. Mega Steelix's absurdly high Defense stat and Steel typing make it a fierce bulky sweeper with Curse that can consistently check Azumarill and take on Grass-, Normal-, and Dragon-types for Landorus, such as Rillaboom, Blissey, and Mega Altaria.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Ground analysis by", "members": [{"user_id": 491896, "username": "Rotten"}]}, {"name": "Quality checked by", "members": [{"user_id": 473171, "username": "DugZa"}, {"user_id": 321991, "username": "Mateeus"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 491896, "username": "Rotten"}]}
  },
  "Landorus-Therian": {"sets": [{"name": "Choice Scarf (Flying)"}, {"name": "Defensive Pivot (Flying)"}, {"name": "Dual Dance (Flying)"}]},
  "Aegislash": {"sets": [{"name": "Specially Defensive (Ghost)"}, {"name": "Swords Dance (Ghost)"}, {"name": "Choice Specs (Ghost)"}, {"name": "Specially Defensive (Steel)"}, {"name": "Choice Specs (Steel)"}, {"name": "Swords Dance (Steel)"}]},
  "Klefki": {
    "comments": "<h1>Other Options</h1> <p><strong>Fairy</strong></p> <p>Fairy Lock can be used to bring in a setup sweeper to take advantage of a trapped foe if Klefki is about to faint, though you miss out on entry hazards or other utility.</p> <h1>Checks and Counters</h1> <p><strong>Fairy</strong></p> <p><strong>Magic Bounce</strong>: Mega Diancie, Mega Sableye, and Hatterene can all bounce back Thunder Wave and Spikes, leaving Klefki only being able to set up dual screens.</p> <p><strong>Taunt + Trick users: Since Klefki has primarily utility moves, it can be completely shut down by Taunt users such as Tornadus-T, Mew, and Heatran. Mew can also remove Klefki's Light Clay with Knock Off, shortening the duration of its dual screens. Latios, Rotom-W, and Gengar are examples of Pokemon that can utilize Trick to give Klefki unwanted Choice items, locking it into one move and making it unable to set up past that.</p> <p><strong>Defog Users: Defog users such as Mantine can easily clear entry hazards and dual screens off the battlefield, but it needs to be wary of getting crippled by Thunder Wave. Some users, however, such as Gliscor, Rotom-W and Mandibuzz are immune to Thunder Wave, leaving Klefki unable to do anything against them.</p> <p><strong>Super Effective Attacks: Fire- and Ground-types have hard-hitting STAB attacks that can power through Klefki easily, not giving it enough time to fully set up dual screens or Spikes. Mega Charizard Y can OHKO Klefki behind Light Screen with a sun-boosted Fire Blast.</p> ",
    "sets": [
      {
        "name": "Dual Screens (Fairy)",
        "description": "<p>Klefki provides great support to Fairy teams with priority dual screens and Spikes thanks to its ability Prankster. Foul Play checks physical setup sweepers such as Mega Scizor, Dragonite, and Mimikyu. Thunder Wave can be used to cripple opposing threats such as Mega Charizard Y, Mega Aerodactyl, Nihilego, and Cinderace. Klefki's defensive typing is appreciated by Fairy teams, since it is immune to Poison-type attacks and can take on Steel-type attacks such as Mega Scizor's Bullet Punch comfortably. Maximum HP and Defense investment with a Bold nature ensures Klefki has as much physical bulk as possible.</p> <p>All of Klefki's teammates appreciate everything it provides, most notably setup sweepers. Azumarill is a good pairing, since it can take on Ground-types and safely set up with Belly Drum alongside Normalium Z or Sitrus Berry behind dual screens. Swords Dance Tapu Bulu is also able to take on Ground-types and appreciates dual screens as well, since it is easy for it to get off Substitute and set up. Mimikyu benefits from dual screens, as it can survive a few extra turns after setting up, even after its Disguise is broken. Mega Diancie makes for another great teammate to pair with Klefki because it can bounce back opposing entry hazards and has good coverage such as Mystical Fire to pick off Ferrothorn and other bulky Steel-types thanks to chip damage from Spikes. Wallbreakers such as Choice Specs Tapu Lele and Choice Band Tapu Bulu appreciate Klefki's ability to cripple threats that would normally outspeed them, such as Gengar and Mega Aerodactyl. Tapu Koko can be used as a pivot to get Klefki on the battlefield safely if switching in with it is not optimal. Clefable can also provide extra utility in the form of setting Stealth Rocks and item removal with Knock Off.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Fairy analysis by", "members": [{"user_id": 340084, "username": "adjustments"}]}, {"name": "Quality checked by", "members": [{"user_id": 321991, "username": "Mateeus"}, {"user_id": 305839, "username": "maroon"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}]}], "writtenBy": [{"user_id": 340084, "username": "adjustments"}]}
  },
  "Avalugg": {
    "comments": "<h1>Other Options</h1> <section><h1>Ice</h1> <p>Mirror Coat works well in tandem with Sturdy, allowing Avalugg to unexpectedly OHKO foes when it's at full health such as Magnezone, Keldeo, and Heatran, which all threaten Ice teams. Iron Defense allows Avalugg to consistently wall threats such as Mega Lopunny, Mega Scizor, and Alolan Golem while simultaneously boosting the power of Body Press. Toxic can slowly put offensive foes on a timer, but is hard to fit.</p> </section><h1>Checks and Counters</h1> <section><h1>Ice</h1> <p><strong>Fire-types: Fire-types such as Volcarona, Victini, Blacephalon, and Mega Charizard Y can KO Avalugg with their powerful STAB moves.</p> <p><strong>Fighting-types: Fighting-types such as Keldeo, Mega Gallade, Kommo-o, and Terrakion can deal a good amount of damage to Avalugg with their STAB moves. However, after an Iron Defense boost, Avalugg can withstand a few hits from Terrakion and retaliate with a boosted Body Press.</p> <p><strong>Steel-types: Steel-types such as Aegislash, Celesteela, and Heatran can beat Avalugg with ease. Aegislash completely walls Avalugg and can stall it with Substitute and Toxic or set up with Swords Dance, Celesteela defeats it with Leech Seed, Toxic, and Flamethrower, and Heatran has Fire-type STAB moves.</p> <p><strong>Rock-types: If Avalugg lacks a move they fear, then Rock-types such as Mega Tyranitar, Alolan Golem, and Mega Aerodactyl force Avalugg to take their powerful STAB moves. Nihilego is an especially great check to Avalugg, since it's a special attacker. However, Avalugg can beat Mega Aerodactyl with Avalanche and the other aforementioned Rock-types with Body Press.</p> <p><strong>Status: Toxic wears down Avalugg, making it harder for it to check Pokemon. Burn's Attack drop makes it difficult for Avalugg to apply pressure on Pokemon.</p> <p><strong>Special Attackers</strong>: Avalugg's Special Defense stat is poor, making it vulnerable to many prominent special attackers in the tier, such as Tapu Koko, Landorus, Blacephalon, Tapu Lele, and Latios to name a few.</p> <p><strong>Ghost-types: Ghost-types spinblock Avalugg and are immune to Body Press, limiting Avalugg without Avalanche to Roar and Recover. A few Ghost-types, such as Aegislash, Blacephalon, and Gengar, can completely force Avalugg out.</p> </section>",
    "sets": [
      {
        "name": "Defensive Rapid Spin (Ice)",
        "description": "<p>Avalugg's incredible physical bulk, access to reliable recovery, and Rapid Spin make it a defensive staple that can deal with threats to Ice teams such as Excadrill, Bisharp, Tyranitar, and Mega Aerodactyl. Rapid Spin allows Avalugg to remove opposing entry hazards for its teammates. Roar phazes setup sweepers like Mimikyu and Mega Altaria that Avalugg cannot touch with Body Press, or Mega Tyranitar if it runs Avalanche. Body Press works well in conjunction with Avalugg's high Defense stat, letting it hit Steel-, Dark-, and Rock-types such as Ferrothorn, Excadrill, Bisharp, and Tyranitar. However, Avalanche allows Avalugg to deal good damage to Zapdos, Landorus, and Tapu Bulu that it otherwise relies on Roar to handle. Heavy-Duty Boots is invaluable, as it provides an immunity to entry hazards, especially Stealth Rock, to prevent Avalugg from being chipped and breaking its Sturdy. Avalugg should generally avoid status aliments such as Toxic and getting hit by Knock Off, since it will be too weakened to check the aforementioned Pokemon. Sturdy allows Avalugg to survive moves from powerful attackers like Hydreigon, Keldeo, and Victini, successfully using Rapid Spin against them.</p> <p>All of Avalugg's teammates appreciate its defensive utility, especially since Ice teams are vulnerable to entry hazards. Alolan Ninetales can deal with Fighting-types such as Kommo-o, Keldeo, and Mega Gallade. Additionally, it provides defensive support through Aurora Veil, giving Avalugg an opportunity to wall threats such as Mega Lopunny, Terrakion, Excadrill, and Bisharp. Choice Scarf Weavile is particularly useful for revenge killing Ghost-types such as Aegislash, Blacephalon, Gengar, and Spectrier that spinblock Avalugg, trapping them with Pursuit. Piloswine forms a nice defensive core with Avalugg; Thick Fat and Eviolite let Piloswine take on Fire-types such as Volcarona, Blacephalon, and Mega Charizard Y, it can set Stealth Rock to let Avalugg chip down foes with Roar, and it can absorb attacks from most special attackers like Tapu Koko, Alolan Raichu, Hydreigon, and Nihilego. Galarian Darmanitan is capable of revenge killing Steel-types like Aegislash, Celesteela, and Heatran with the combination of Flare Blitz and Earthquake, especially if it's running a Choice Scarf. Cloyster especially appreciates Rapid Spin support from Avalugg, as it can preserve its occasional Focus Sash and get an easier sweep with Shell Smash.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Ice analysis by", "members": [{"user_id": 491896, "username": "Rotten"}]}, {"name": "Quality checked by", "members": [{"user_id": 321991, "username": "Mateeus"}, {"user_id": 305839, "username": "maroon"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 491896, "username": "Rotten"}]}
  },
  "Diancie": {
    "comments": "<h1>Other Options</h1> <section><h1>Fairy</h1> <p>Rock Polish can be used to make Mega Diancie into a setup sweeper. When using it, customize Mega Diancie's attacks to take on certain types you want it to act as a wincon against. Stealth Rock can be used over a coverage move but is difficult to justify.</p> </section><h1>Checks and Counters</h1> <section><h1>Fairy</h1> <p><strong>Super Effective Coverage: If Mega Diancie cannot OHKO a Pokemon with super effective coverage such as Mega Steelix, it will most likely drop in one hit due to its poor natural defenses.</p> <p><strong>Revenge Killers: Faster Pokemon such as Choice Scarf Excadrill and Greninja can easily outspeed and OHKO Mega Diancie with their STAB moves and coverage, respectively.</p> <p><strong>Priority Attackers: Pokemon such as Mega Scizor and Azumarill can threaten to OHKO Mega Diancie with their priority attacks in Bullet Punch and Aqua Jet due to its poor natural defenses.</p> <p><strong>Special Walls: Since Mega Diancie primarily relies on its special attacks, specially defensive Pokemon capable of taking Diamond Storm can easily wall it, such as Celesteela.</p> </section>",
    "sets": [
      {"name": "All-out Attacker (Rock)"},
      {
        "name": "All-out Attacker (Fairy)",
        "description": "<p>Mega Diancie is a phenomenal asset to Fairy teams, with Magic Bounce to deflect entry hazards and status, wide coverage, and good offensive prowess backed by a great natural Speed tier. Moonblast is Mega Diancie's most spammable attack, taking on Pokemon such as Mega Sableye, Latios, and Keldeo. Diamond Storm allows Mega Diancie to hit Pokemon such as Volcarona, Tornadus-T, and Alolan Ninetales for super effective damage and fish for Defense boosts. Mystical Fire targets Steel-type Pokemon such as Ferrothorn and Celesteela switching in, and Mega Scizor if it attempts to use Swords Dance on Mega Diancie. Alternatively, Psychic hits Poison-type Pokemon such as Mega Venusaur. Diamond Storm + Psychic gives Mega Diancie 2HKO all Poison-type Pokemon as well. Hidden Power Ice allows Mega Diancie to take on Gliscor and Landorus. Earth Power, in conjunction with Mystical Fire, can be used instead for Mega Diancie to be very effective against Steel teams: it OHKOes Heatran, Excadrill, and Magnezone, hits Aegislash the hardest, and takes on threats such as weakened Mega Steelix. Diamond Storm + Mystical Fire + Hidden Power Ice allows Mega Diancie to hit all Flying-type Pokemon for super effective damage. Maximum Special Attack and Speed EVs, alongside a Naive nature, allow Mega Diancie to be as fast as Latios and hit as hard as possible specially while not decreasing Diamond Storm's damage output. Clear Body allows Diancie to ignore Sticky Web prior to Mega Evolution.</p> <p>All of Mega Diancie's teammates appreciate its offensive prowess and access to Magic Bounce, especially because Fairy teams tend not to carry entry hazard removal. Klefki can set Spikes for Mega Diancie, allowing it to break through Pokemon such as Focus Sash Garchomp, and checks setup sweepers like Mega Scizor thanks to Foul Play. Additionally, screens from Klefki make Mega Diancie harder to revenge kill. On top of that, Klefki can paralyze faster threats such as Mega Aerodactyl for it. Tapu Koko can take on threats to Mega Diancie such as Celesteela while also stallbreaking against Pokemon such as Mega Venusaur with Taunt, allowing Mega Diancie to take it out with Psychic. Tapu Lele can take on Poison-type Pokemon such as Toxapex and Nidoking for Mega Diancie. Additionally, it sets Psychic Terrain, preventing priority moves such as Mega Scizor's Bullet Punch from OHKOing Mega Diancie. Tapu Bulu can take on Electric-, Ground-, and Water-type Pokemon for Mega Diancie such as Tapu Koko, Hippowdon, and Swampert with its Grass-type STAB moves, as well as providing passive recovery due to Grassy Terrain. Azumarill can help Mega Diancie take on Fire teams and handles Ground- and Steel-type Pokemon for it with Aqua Jet, and Brick Break to take out Melmetal, after Belly Drum. Mimikyu can easily take on Psychic teams for Mega Diancie after a Swords Dance, OHKO bulkier Pokemon with boosted Shadow Claw, and OHKO faster Pokemon like Choice Scarf Latias with boosted Shadow Sneak. Togekiss can be used to take on Grass-type Pokemon for Mega Diancie, such as Rillaboom, Mega Venusaur, and Ferrothorn, which Fairy teams struggle with. Togekiss can also help break past Steel-type Pokemon such as Melmetal with its coverage in Fire Blast and Aura Sphere. Clefable can provide Stealth Rock support for Mega Diancie to secure crucial damage rolls against the likes of Excadrill and Gliscor.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Fairy analysis by", "members": [{"user_id": 305839, "username": "maroon"}]}, {"name": "Quality checked by", "members": [{"user_id": 321991, "username": "Mateeus"}, {"user_id": 473171, "username": "DugZa"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 305839, "username": "maroon"}]}
  },
  "Toxapex": {
    "comments": "<h1>Other Options</h1> <section><h1>Water</h1> <p>Poison Jab targets Calm Mind Tapu Fini, while Sludge Bomb targets Tapu Bulu. Knock Off can be used to cripple Pokemon such as Galarian Corsola; all three options are niche options that can be used over Scald. Eject Button can be used on rain teams, allowing Toxapex to effectively generate momentum for the team without unnecessarily risking the offensive Pokemon while still regaining health through Regenerator.</p> </section><h1>Checks and Counters</h1> <section><h1>Water</h1> <p><strong>Super Effective Coverage: Super Effective STAB attacks such as Latios's Psychic, Landorus-T's Earthquake, and Thundurus-T's Thunderbolt easily break through Toxapex.</p> <p><strong>Stallbreakers: Taunt and Trick users such as Gliscor and Latias prevent Toxapex from freely using its utility moves, hindering its ability to act as a wall.</p> <p><strong>Wallbreakers: Strong attackers with neutral coverage such as Choice Band Rillaboom easily beat Toxapex.</p> </section>",
    "sets": [
      {"name": "Defensive (Poison)"},
      {"name": "Icium Z + Haze (Poison)"},
      {
        "name": "Defensive (Water)",
        "description": "<p>Toxapex is the premier defensive pivot for Water teams, as its good utility options and natural bulk alongside Regenerator allow it to constantly switch in through the game and support its teammates. Scald prevents Toxapex from becoming too passive while also allowing it to fish for burns against physical threats such as Rillaboom. Recover allows Toxapex to stay healthy through the match, especially alongside Regenerator recovery. Toxic Spikes allow Toxapex to support its offensive teammates by poisoning and chipping grounded foes. Toxic Spikes are especially useful in matchups such as Fairy, Psychic, and Dragon. Toxic, on the other hand, allows Toxapex to hit Flying-types and Levitate users such as Zapdos, Mega Latias, and Hydreigon, which can be a problem for Water teams. Haze allows Toxapex to check setup sweepers such as Dragon Dance Mega Charizard X, Autotomize Celesteela, and Swords Dance Aegislash. Baneful Bunker can be used to scout Choice-locked attackers such as Choice Specs Tapu Koko, gain recovery, and further take advantage of Toxic. Baneful Bunker can also help provide useful chip against physical attackers such as Mega Lopunny. Regenerator allows Toxapex to act as a sponge by switching into attacks and regaining health upon switching out.</p> <p>Toxapex's teammates appreciate its ability to act as a defensive pivot, remove Toxic Spikes from the field, and set its own Toxic Spikes. Slowking and Toxapex forms a great Regenerator core; under Toxapex's Toxic Spikes, Future Sight from Slowking is nearly impossible for opposing Pokemon to handle. Slowking also acts as a specially defensive wall for Toxapex and provides a crucial resistance to Psychic-type attacks such as Tapu Lele's Psychic and Future Sight. Pelipper, Mantine, and Rotom-W are important teammates to Toxapex, as they provide Ground immunities and Defog. Mantine allows Toxapex to use Baneful Bunker, as it can check Azumarill with Haze. Mantine's Haze also allows it to check a plethora of other setup sweepers such as Nasty Plot Hydreigon and Volcarona. Swampert provides Electric immunity and Stealth Rock. Additionally, it can also take on Electric-types such as Zeraora with Earthquake. Offensive teammates such as Greninja, Mega Swampert, Urshifu-R, and Mega Sharpedo appreciate Toxapex's ability to wear down the opposing team, allowing them to clean up late-game. Defensive setup sweepers such as Calm Mind Suicune and Mega Slowbro also appreciate Toxic Spikes. They can specifically take advantage of their bulk and Toxic poison to set up with more ease. Gastrodon and Empoleon are other defensive teammates that can help Toxapex wear down the foe. Empoleon can remove items with Knock Off, while Gastrodon can run Sticky Hold, allowing it to switch into Trick for Toxapex. Gastrodon also provides immunity to Electric-type attacks directed at Toxapex.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Water analysis by", "members": [{"user_id": 305839, "username": "maroon"}]}, {"name": "Quality checked by", "members": [{"user_id": 321991, "username": "Mateeus"}, {"user_id": 473171, "username": "DugZa"}]}, {"name": "Grammar checked by", "members": [{"user_id": 449990, "username": "DC"}]}], "writtenBy": [{"user_id": 305839, "username": "maroon"}]}
  },
  "Mimikyu": {
    "comments": "<h1>Other Options</h1> <section><h1>Ghost</h1> <p>Wood Hammer can be used instead of Drain Punch or Shadow Claw to let Mimikyu lure in and OHKO bulky Water / Ground Pokemon such as Swampert, Gastrodon, and Seismitoad. However, it has generally no purpose outside of that, making it less useful than Drain Punch or Shadow Claw. Mimikyu can run Mimikium Z or Ghostium Z to nuke walls that would otherwise wall it, like Hippowdon and Toxapex, after a Swords Dance boost. However, without using either of these Z-Moves, Mimikyu is much weaker without Life Orb.</p> <h1>Fairy</h1> <p>An Adamant nature can be opted for over Jolly, but it comes at the cost of underspeeding some key threats, such as Tapu Lele and Excadrill.</p> </section><h1>Checks and Counters</h1> <section><h1>Ghost</h1> <p><strong>Physically Defensive Walls: Walls such as Toxapex, Avalugg, and Hippowdon are very threatening to Mimikyu. Toxapex can get rid of its Swords Dance boosts with Haze while threatening to burn it with Scald, Avalugg wears it down with Avalanche, and Hippowdon can phaze it with Whirlwind and also wear it down with Earthquake.</p> <p><strong>Revenge Killers: Revenge killers that can take a Shadow Sneak such as Greninja, Weavile, and Choice Scarf Tapu Lele due to Psychic Terrain can deal with Mimikyu. Weavile's Triple Axel can also break through Disguise. However, Mimikyu can defeat these revenge killers bar Weavile if Disguise is intact.</p> <p><strong>Status: Burn heavily cripples Mimikyu making it unable to revenge kill or sweep properly. Toxic puts it on a timer, making it worn down easily in conjuction with Life Orb. Paralysis significantly slows down Mimikyu, making it unable to outspeed a lot of foes and easily revenge killed.</p> <p><strong>Phazers</strong>: Because Mimikyu is mainly reliant on Swords Dance in order to sweep, Haze and Whirlwind users like Mantine, Toxapex, Hippowdon, and Skarmory can easily deal with it by forcing it out.</p> <p><strong>Mold Breaker: Mold Breaker Excadrill is particularly threatening to Mimikyu, as it ignores Disguises and OHKOes it with Iron Head or Earthquake. However, it doesn't like switching into Drain Punch. Mega Gyarados is also a threat to Mimikyu, as it can OHKO it after a Dragon Dance boost and stay in its regular form to set up and avoid taking super effective damage from Play Rough.</p> <h1>Fairy</h1> <p><strong>Physical Walls: Mimikyu is easily walled by physical walls such as Skarmory, Celesteela and Porygon2 due to its middling Attack stat, and the latter two can threaten to KO with Heavy Slam and Foul Play, respectively.</p> <p><strong>Haze Users and Phazers: Due to its mediocre Attack stat, Mimikyu heavily relies on Swords Dance to break through opposing teams. Therefore, Haze users such as Toxapex and phazers such as Skarmory and Hippowdon greatly disrupt it.</p> <p><strong>Revenge Killers</strong>: Due to Mimikyu's below-average HP and defensive stats, it can easily be dealt with by faster revenge killers such as Urshifu, Zarude, and Mega Lopunny. However, Mimikyu can deal with said threats if Disguise is intact.</p> <p><strong>Steel-types: Steel-types such as Celesteela and Mega Scizor are able to deal shrug off any hits from Mimikyu and revenge kill it with their strong Steel-type STAB moves, while Choice Scarf Excadrill outspeeds and OHKOes Mimikyu through Disguise thanks to Mold Breaker.</p> <p><em>Status*: All status conditions severely cripple Mimikyu's effectiveness as a sweeper. Burn greatly weakens it, poison puts it on a timer, and paralysis makes it easier to revenge kill.</p> </section>",
    "sets": [
      {
        "name": "Swords Dance (Ghost)",
        "description": "<p>Mimikyu is an invaluable asset for Ghost teams thanks to its part-Fairy typing allowing it to act as a key wincon in the Dark, Fighting, and Dragon matchups, access to Swords Dance, and excellent coverage. Additionally, Disguise lets Mimikyu act as a potent revenge killer as well, giving it an opportunity to handle extremely threatening foes such as Hydreigon, Weavile, and boosted Kommo-o while blanket checking most other Pokemon. Swords Dance boosts Mimikyu's underwhelming damage output to high levels, and it can be used on Pokemon that it forces out such as Mega Sableye, Tyranitar, and Mandibuzz. Drain Punch hits Steel-types like Heatran, Ferrothorn, and Magnezone super effectively while providing Mimikyu with passive recovery. Shadow Claw can be used instead to deal much more damage to walls like Galarian Corsola, Aegislash, and Slowbro. After a Swords Dance boost, Shadow Sneak OHKOes faster threats like Blacephalon, Gengar, and Alolan Raichu while KOing weakened foes such as Barraskewda, Tapu Koko, and Victini. However, be cautious of using Shadow Sneak against Victini if Psychic Terrain is up. Maximum Speed investment with a Jolly nature is used to outspeed Pokemon like Kyurem, Nidoking, and Tapu Lele. Mimikyu should avoid switching into attacks in order to preserve Disguise. It is also best used as a late-game cleaner once walls are weakened.</p> <p>All Ghost teams appreciate Mimikyu's ability to deal with Dark- and Dragon-types and act as a potent late-game wincon. Mega Sableye and Galarian Corsola both provide a defensive backbone for Mimikyu, switching into powerful attacks for it. Mega Sableye provides a useful neutrality to Ghost and Dark, absorbs Knock Off for Mimikyu, deals with threatening attackers like Blacephalon and Nidoking, and deflects troublesome entry hazards like Spikes and Toxic Spikes with Magic Bounce. Swords Dance Aegislash is a great teammate due to its ability to deal with or weaken walls like Galarian Weezing, Porygon2, and Celesteela for Mimikyu. SubToxic Aegislash can also be used to wear down walls like Hippowdon and Porygon2 with Toxic, which Mimikyu appreciates. Choice Specs Gengar takes on physically defensive walls such as Toxapex, Galarian Weezing, and Skarmory, making it a useful teammate. Additionally, Gengar absorbs Toxic Spikes for Mimikyu. Choice Scarf Blacephalon can also take on walls like Galarian Weezing and Skarmory while revenge killing foes that pose a threat to Mimikyu like Choice Scarf Excadrill and Choice Scarf Galarian Darmanitan. While uncommon, Alolan Marowak provides a handy Electric immunity against foes like Tapu Koko and Regieleki, making it helpful.</p> "
      },
      {
        "name": "Swords Dance (Fairy)",
        "description": "<p>Mimikyu plays a pivotal role on Fairy teams thanks to its almost perfect coverage between its STAB moves and its unique ability in Disguise, which lets it revenge kill certain key offensive threats such as Azumarill, Victini, and Tapu Koko or freely setup Swords Dance and sweep through already weakened teams with ease. Swords Dance boosts Mimikyu's average Attack stat and, in conjunction with Disguise, allows it to act as a potent late-game wincon. Play Rough is Mimikyu's strongest attack and allows it to deal with dangerous Dragon-, Dark-, and Fighting-type threats such as Hydreigon, Greninja, and Terrakion. Shadow Claw allows Mimikyu to deal with opposing Ghost-types and Psychic-types such as Blacephalon, Gengar, Tapu Lele, and Victini. Shadow Sneak further enhances Mimikyu as a formidable late-game sweeper, being able to deal with weakened threats and OHKO threats like Gengar, Blacephalon, and Latios after a Swords Dance boost, making Mimikyu a key wincon in the Psychic- and Ghost-type matchups. Maximum Speed investment along with a Jolly nature allows Mimikyu to outspeed key threats in Tapu Lele, Nidoking and Excadrill. Life Orb helps ameliorate Mimikyu's subpar Attack stat while also ensuring Shadow Sneak does considerable damage.</p> <p>Klefki pairs exceptionally well with Mimikyu, as it provides dual screens support, Spikes support, and a Poison-type immunity. Spikes helps weaken foes, allowing Mimikyu to sweep late-game without much trouble, while dual screens make Mimikyu an even more reliable setup sweeper. Klefki can also provide Thunder Wave support, crippling threats that outspeed Mimikyu like Mega Aerodactyl and Mega Lopunny. Mega Diancie helps greatly in the Fire-, Flying-, and Ice-type matchups while also providing Stealth Rock support to chip down foes. Mega Diancie's Magic Bounce also blocks entry hazards such as Spike and Toxic Spikes that could easily cripple Mimikyu. Tapu Koko teams up well with Mimikyu, mostly because it deals with walls such as Skarmory, Celesteela, and Toxapex that can deal with Mimikyu without much trouble while also helping greatly in the Flying- and Water-type matchups. Tapu Bulu is able to break through Mimikyu's walls such as Hippowdon and defensive Water-types such as Toxapex and Swampert. Tapu Lele has useful wallbreaking capabilities with Choice Specs, dealing with Mimikyu's defensive checks such as Toxapex, while also aiding in the Poison matchup. Belly Drum Azumarill pairs well with Mimikyu as a secondary sweeper, mainly helping in the Steel matchup, which Mimikyu struggles in greatly. Togekiss is able to break through defensive Grass-types like Mega Venusaur and Ferrothorn for Mimikyu.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Ghost analysis by", "members": [{"user_id": 491896, "username": "Rotten"}]}, {"name": "Fairy analysis by", "members": [{"user_id": 473171, "username": "DugZa"}]}, {"name": "Quality checked by", "members": [{"user_id": 305839, "username": "maroon"}, {"user_id": 473171, "username": "DugZa"}, {"user_id": 491896, "username": "Rotten"}]}, {"name": "Grammar checked by", "members": [{"user_id": 262594, "username": "Milak"}, {"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 491896, "username": "Rotten"}, {"user_id": 473171, "username": "DugZa"}]}
  },
  "Kommo-o": {
    "comments": "<h1>Other Options</h1> <section><h1>Dragon</h1> <p>Kommo-o has no other viable options.</p> </section><h1>Checks and Counters</h1> <section><h1>Dragon</h1> <p><strong>Fairy-types</strong>: Fairy-types such as Tapu Lele, Tapu Koko, Mega Diancie, and Mimikyu all can take any of Kommo-o's attacks, block Kommonium Z, and take care of it with their STAB attacks.</p> <p><strong>Psychic-types: Psychic-types such as Mega Gallade, Alakazam, Alolan Raichu, and Mega Gardevoir all can outpace Kommo-o and take care of it with their STAB attacks. Bulkier Psychic-types like Hatterene and Slowking can tank many attacks from Kommo-o and use their super effective STAB moves to take care of it.</p> <p><strong>Faster Pokemon: Faster Pokemon such as Mega Altaria, Choice Scarf Greninja, and Latios can outpace and OHKO Kommo-o with super effective attacks.</p> <p><strong>Status: Kommo-o being paralyzed makes it unable to outpace key Pokemon like Hydregion even after setting up with Kommonium Z, while Toxic puts it on a timer for the rest of the game.</p> </section>",
    "sets": [
      {
        "name": "Mixed Setup Sweeper (Dragon)",
        "description": "<p>Kommo-o is one of the best setup sweepers on Dragon thanks to Kommonium Z allowing it to omni-boost with Clanging Scales, and its useful coverage moves allow it to threaten various types such as Steel, Dark, Normal, and Poison. Clanging Scales is needed to use Kommonium Z, and it is also useful to hit Pokemon behind a Substitute such as Zapdos and Suicune. Drain Punch allows Kommo-o to take care of troubling Normal-, Steel-, Ice-, and Dark-types such as Blissey, Heatran, Mamoswine, and Tyranitar while giving it some passive recovery. Flamethrower goes well with its Fighting typing, as it enables Kommo-o to take care of other Steel- and Ice-types such as Mega Scizor, Corviknight, and Avalugg. Taunt is used to avoid phazing from Whirlwind users like Skarmory and Hippowdon and Toxapex's Haze, along with blocking Toxic from Pokemon like Aegislash and Blissey. Clangorous Soul is an option over Taunt to boost Kommo-o's stats even further, but it makes Kommo-o prone to being phazed by Mantine and a healthy Skarmory and has a huge drawback of costing a third of its HP. Soundproof is used to make Ditto and opposing Kommo-o unable to revenge kill Kommo-o with Clanging Scales. A Naive nature with 252 Speed EVs allows it to outpace Pokemon like Mamoswine, speed tie with Nidoking, and outspeed Mega Lopunny and Zeraora after using Kommonium Z.</p> <p>Garchomp is great to pair with Kommo-o, as it can set up Stealth Rock and take care of Pokemon like Jirachi for it. Kyurem is great to help beat Water-types that can hinder Kommo-o like Tapu Fini and Greninja with Freeze-Dry. Dragalge can provide Toxic Spikes to make it easier for Kommo-o to sweep in Normal- and Dark-type matchups and can use Flip Turn to safely bring in Kommo-o. Dragalge's Poison typing also allows it to come into special Fairy-type attacks from Tapu Koko and Tapu Fini and take care of them with Sludge Wave. Dragalge can also absorb Toxic Spikes to protect Kommo-o from being poisoned. Mega Altaria pairs well with Kommo-o, forming a Dark-type breaking core with Mega Altaria taking care of Mega Sableye and Mandibuzz while Kommo-o takes care of Bisharp. Latias is great speed control for Dragon teams, as it can take care of Keldeo, Mega Swampert, and Cloyster after it uses Shell Smash. It is also useful to get rid of entry hazards with Defog and bring back Kommo-o to full health with Healing Wish. Mega Latias is a great teammate for Kommo-o, as it can help greatly in the Flying-type matchup by taking care of Tornadus-T and Zapdos thanks to its BoltBeam coverage. Hydreigon helps greatly in the Psychic- and Ghost-type matchups taking care of threats like Blacephalon and Celebi. Hydreigon can also bring Kommo-o in with U-turn.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Dragon analysis by", "members": [{"user_id": 393488, "username": "Yami"}]}, {"name": "Quality checked by", "members": [{"user_id": 491896, "username": "Rotten"}, {"user_id": 473171, "username": "DugZa"}]}, {"name": "Grammar checked by", "members": [{"user_id": 168392, "username": "P Squared"}]}], "writtenBy": [{"user_id": 393488, "username": "Yami"}]}
  },
  "Tapu Koko": {
    "comments": "<h1>Other Options</h1> <section><h1>Electric</h1> <p>Tapu Koko can opt for Expert Belt in lieu of Choice Specs to switch moves freely, further improving the Water- and Flying-type matchups. However, it generally appreciates the extra wallbreaking power provided by Choice Specs more, as it better deals with Dragon-type threats. Tapu Koko can also opt for a utility pivot set with Thunderbolt, Hidden Power Ice, U-turn, and Taunt along with Heavy Duty Boots. U-turn allows it to pivot out, even against Ground-types, and bring in its teammates, while Taunt helps against walls that rely on recovery such as Porygon2.</p> <h1>Fairy</h1> <p>Heavy-Duty Boots can be run over Magnet to make Tapu Koko less prone to being worn down by entry hazards, but it misses out on an extra boost to its Electric-type attacks. Grass Knot can be used over Taunt to hit Water-types such as Swampert and Gastrodon, but Tapu Koko would no longer be able to effectively shut down walls. Choice Specs allows Tapu Koko to become a fearsome wallbreaker, but it will be Choice-locked and the Flying matchup becomes tougher because the opponent can scout more easily. Shuca Berry is another option that eases Tapu Koko's ability to take on threatening Ground-types such as Gliscor and Landorus.</p> </section><h1>Checks and Counters</h1> <section><h1>Electric</h1> <p><strong>Ground-types: Ground-type Pokemon like Mamoswine, Seismitoad, and Gastrodon that shrug off most of Tapu Koko's attacks can switch in against it and KO it with their STAB move,s while faster Ground-types like Choice Scarf Landorus-T and Sand Rush Excadrill outspeed and OHKO Tapu Koko with Earthquake. However, Ground-types like Hippowdon and Seismitoad need to be wary of Grass Knot, while Landorus and Gliscor fall against Hidden Power Ice.</p> <p><strong>Grass-types: Defensive Grass-types like Mega Venusaur, Ferrothorn, and Cradily can comfortably switch in against any of Tapu Koko's attacks and lose little to no HP in the process. Mega Venusaur in particular can threaten to KO it with Sludge Bomb.</p> <p><strong>Special Walls: Specially defensive walls like Blissey and Alolan Muk can switch in against Tapu Koko, and Blissey can threaten to cripple it with status moves like Toxic, while Alolan Muk can threaten it with Poison Jab.</p> <p><strong>Revenge Killers: Faster threats like Choice Scarf Greninja, Choice Scarf Blacephalon, and Mega Aerodactyl that outspeed Tapu Koko threaten to revenge kill and OHKO it with their super effective coverage options after minor chip damage.</p> <h1>Fairy</h1> <p><strong>Ground-types: Hippowdon, Excadrill, Gastrodon, and Swampert are examples of Ground-types that take very little damage from Hidden Power Ice and can OHKO Tapu Koko with Earthquake.</p> <p><strong>Electric-resistant Pokemon</strong>: Since Thunderbolt is Tapu Koko's main form of damage, it is forced out by anything that resists it.</p> <p><strong>Special Walls</strong>: Walls such as Blissey, Ferrothorn, and Tyranitar take little damage from Tapu Koko's strongest attacks, but they dislike being afflicted by Taunt.</p> <p><strong>Revenge Killers: Tapu Koko is prone to being revenge killed by fast foes like Mega Aerodactyl and Choice Scarf Greninja with their coverage moves such as Earthquake and Gunk Shot, respectively.</p> </section>",
    "sets": [
      {
        "name": "Choice Specs (Electric)",
        "description": "<p>An amazing ability in Electric Surge that sets up Electric Terrain, bolstering Electric-type attacks of both itself and its teammates, along with an above average Speed tier and a great secondary typing in Fairy makes Tapu Koko a primary threat on Electric-type teams. Thunderbolt is amplified thanks to Electric Terrain. Dazzling Gleam helps deal with troublesome Dragon-, Fighting-, and Dark-type Pokemon such as unboosted Mega Altaria, Mega Gallade, and Zarude. Hidden Power Ice deals with troublesome Ground-types like Landorus and Gliscor, which freely switch in against Electric-type attacks. Volt Switch allows Tapu Koko to act as a great offensive pivot to maintain offensive pressure while to bring teammates safely into the field. Grass Knot can be used to better deal with Ground-types like Hippowdon and Swampert, which otherwise freely switch in against Tapu Koko. 4 Defense EVs ensure Tapu Koko always survives an Earthquake from Gliscor at full HP. Maximum Special Attack investment along with Choice Specs makes Tapu Koko a reliable wallbreaker, while maximum Speed along with a Timid nature ensures it outspeeds Pokemon like Weavile and Cinderace.</p> <p>Zapdos is a great teammate for Tapu Koko, as it provides a much needed Ground immunity and Defog support while also dealing with physical threats like Mega Scizor, Rillaboom, and Tapu Bulu. Defog helps Tapu Koko pivot freely, but Choice Specs Zapdos can also be a great teammate, as it comfortably deals with bulky Grass-types like Mega Venusaur and Cradily. Rotom-W provides a secondary Ground immunity with Levitate, can deal with Ground-types like Hippowdon and Mamoswine thanks to Hydro Pump, provides a switch-in against Fire- and Water-types like Choice Scarf Blacephalon and Mega Swampert, and cripples physical attackers like Mega Swampert thanks to Will-O-Wisp. Alolan Raichu easily benefits the most from Electric Terrain set up by Tapu Koko while also using it to revenge kill faster threats like Sand Rush Excadrill, Choice Scarf Greninja, and Mega Aerodactyl, which Tapu Koko fails to deal with. Alolan Raichu's Psychic can beat troublesome Poison-types like Mega Venusaur, while Focus Blast can get rid of troublesome walls like Ferrothorn, for Tapu Koko and Grass Knot can cover for Tapu Koko not running a move. Tapu Koko in return deals with troublesome Dark- and Dragon-types like Krookodile and Mega Latias. Zeraora is the best available physical attacker for Electric-type teams and can help greatly in the Normal-, Ghost-, and Dragon-type matchups thanks to Close Combat, Knock Off, and Play Rough, respectively, while also dealing with walls in Blissey and Ferrothorn that Tapu Koko falls short against. Choice Specs Regieleki pairs well as a monstrous wallbreaker with Rising Voltage when paired with Tapu Koko's Electric Terrain, being able to 2HKO major threats to Tapu Koko such as Mega Venusaur and Blissey and providing a secondary hazard control thanks to Rapid Spin. Magnezone is able to trap and deal with Steel-types that Tapu Koko fails to do anything significant against, such as Excadrill and Ferrothorn, and act as a reliable switch-in to Poison-type attacks directed at Tapu Koko. Similar to Magnezone, Alolan Golem is capable of trapping and dealing with the aforementioned troublesome Steel-types while also being able to provide Stealth Rock support.</p> "
      },
      {
        "name": "Pivot (Fairy)",
        "description": "<p>Tapu Koko is the fastest Fairy-type available and is a great offensive pivot. Thunderbolt is Tapu Koko's most consistent special STAB attack and has a high damage output thanks to boosts from Electric Terrain and Magnet. Hidden Power Ice lets Tapu Koko hit Ground-types that would otherwise be problematic for Fairy teams, such as Landorus and Gliscor. U-turn gives Tapu Koko a way to pivot other teammates in reliably and generate momentum. Taunt is great utility to help Tapu Koko shut down walls such as Zapdos and Blissey, making it easier to bring in a teammate that handles them effectively. Maximum Special Attack and Speed investment allows Tapu Koko to hit as hard and pivot as fast as possible, and 4 Defense EVs let it survive an Earthquake from defensive Gliscor at full health.</p> <p>Tapu Koko's role as a pivot is appreciated by all of its teammates. Klefki provides a much-needed Poison-type immunity and can be brought in safely to reliably set dual screens and entry hazards that can wear down foes for Tapu Koko to clean up late-game. Tapu Lele makes for a great teammate because it's a powerful wallbreaker that can power through specially defensive walls Tapu Koko struggles with, such as Swampert, with its STAB attacks. Tapu Bulu takes on most Ground-types that Tapu Koko struggles with, such as Hippowdon, Gastrodon, and Swampert. Azumarill provides valuable priority in Aqua Jet and is also a very strong setup sweeper with Belly Drum while being able to take on all of the Ground-types that Tapu Koko struggles with. Mega Diancie is another good teammate because it can keep entry hazards off of your side that would otherwise wear Tapu Koko down, and it synergizes well with Tapu Koko in the Flying and Fire matchups. Mimikyu is able to break through the Psychic and Ghost teams, and Togekiss helps break through bulky threatening Grass-types such as Mega Venusaur.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Electric analysis by", "members": [{"user_id": 473171, "username": "DugZa"}]}, {"name": "Fairy analysis by", "members": [{"user_id": 340084, "username": "adjustments"}]}, {"name": "Quality checked by", "members": [{"user_id": 473171, "username": "DugZa"}, {"user_id": 305839, "username": "maroon"}, {"user_id": 491896, "username": "Rotten"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}, {"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 340084, "username": "adjustments"}, {"user_id": 473171, "username": "DugZa"}]}
  },
  "Tapu Lele": {"sets": [{"name": "Choice Specs (Fairy)"}, {"name": "Calm Mind (Fairy)"}]},
  "Buzzwole": {
    "comments": "<h1>Other Options</h1> <section><h1>Bug</h1> <p>Buzzwole can opt to run Poison Jab to better deal with Pokemon on Fairy teams like Tapu Bulu, Azumarill, and Tapu Fini. However, its other coverage options prove to be more beneficial in most scenarios.</p> </section><h1>Checks and Counters</h1> <section><h1>Bug</h1> <p><strong>Physically Defensive Walls: Physically defensive walls like Skarmory and Celesteela comfortably switch into and damage or cripple Buzzwole.</p> <p><strong>Revenge Killers: Faster revenge killers like Mega Aerodactyl and Choice Scarf Latios have little to no trouble with dealing with Buzzwole with their super effective STAB options.</p> <p><strong>Special Attackers: Due to Buzzwole's below average Special Defense stat, it is easily threatened by most special attackers like Tapu Koko and Gengar.</p> <p><strong>Status: All status conditions hinder Buzzwole's ability to function as a revenge killer. Burns halve Buzzwole's Attack, poison puts Buzzwole on a timer, and paralysis halves Buzzwole's Speed.</p> </section>",
    "sets": [
      {
        "name": "Choice Scarf (Bug)",
        "description": "<p>Beast Boost, amazing physical bulk, and a wide range of coverage options make Buzzwole a potent revenge killer for Bug teams. Close Combat deals with threats to Bug teams such as Heatran, Dragon Dance Mega Tyranitar, Mega Lopunny, Terrakion, and Kyurem. Stone Edge is primarily used to nail threatening Flying- and Fire-types in the form of Mantine, Mega Charizard Y, Volcarona, and Cinderace. Ice Punch helps against Ground- and Dragon-types like Landorus, Gliscor, Garchomp, and Dragonite. Leech Life is a secondary STAB option that aids greatly against threatening Psychic-types such as Celebi while also providing a form of passive recovery. Earthquake can be used instead of Leech Life for further coverage against Rock-, Steel-, and Poison-types like Mega Diancie, Aegislash, and Gengar and can force Toxapex out, especially specially defensive variants.</p> <p>Buzzwole synergizes well with Volcarona. Buzzwole takes care of Volcarona's checks like Blissey and Tyranitar, while Volcarona in return deals with physically defensive walls like Celesteela and Mega Sableye. They also form a great core against Steel as Buzzwole deals with Heatran, allowing Volcarona to sweep through the rest of the team. Mega Scizor and Scizor pair up well with Buzzwole because they deal with faster threats like Choice Scarf Nihilego and Galarian Darmanitan with Bullet Punch. Particularly, Mega Scizor is able to break through certain physical walls such as Mega Venusaur and Clefable, while Choice Band Scizor can Pursuit trap faster threats to Buzzwole like Choice Scarf Latios and Latias. Armaldo and Forretress provide reliable entry hazard control for Buzzwole while also setting up their own Stealth Rock and provide a neutrality against Flying-type attacks. Armaldo also takes neutral damage from Fire-type attacks and has Knock Off, while Forretress provides Spikes support and can safely bring Buzzwole into the field thanks to Volt Switch. Galvantula is able to provide Sticky Web support, allowing Buzzwole to outspeed threats it otherwise wouldn't like Zeraora and Choice Scarf Blacephalon. Galvantula also helps greatly against Water and Flying. Swords Dance Mega Pinsir acts as a reliable wallbreaker, weakening walls like Hippowdon and Mandibuzz for Buzzwole to clean up late-game. Araquanid reliably switches into Fire-type Pokemon like Mega Charizard Y, Blacephalon, and Volcarona and is able to set Sticky Web as well. Scolipede pairs well with Buzzwole because it aids greatly in matchups like Fairy and Psychic. Shuckle can be used as a reliable setter of Sticky Web and Stealth Rock on more offensive teams thanks to Sturdy.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Bug analysis by", "members": [{"user_id": 473171, "username": "DugZa"}]}, {"name": "Quality checked by", "members": [{"user_id": 321991, "username": "Mateeus"}, {"user_id": 491896, "username": "Rotten"}]}, {"name": "Grammar checked by", "members": [{"user_id": 331519, "username": "CryoGyro"}]}], "writtenBy": [{"user_id": 473171, "username": "DugZa"}]}
  },
  "Celesteela": {"sets": [{"name": "Leech Seed Tank (Flying)"}, {"name": "Autotomize Sweeper (Flying)"}, {"name": "Leech Seed Tank (Steel)"}, {"name": "Autotomize Sweeper (Steel)"}]},
  "Zeraora": {
    "comments": "<h1>Other Options</h1> <section><h1>Electric</h1> <p>Expert Belt can be used over Choice Band to let Zeraora switch between moves, which can be more useful situationally in matchups like Dark, Steel, and Fairy. However, it loses significant damage output without Choice Band, which decreases its effectiveness against walls like Porygon2 and Galarian Weezing. On the Flyinium Z set, Drain Punch can be used over Close Combat to provide increased longevity while still hitting foes like Tyranitar and Excadrill hard. However, this comes at the cost of much less damage against bulkier targets like Ferrothorn, Heatran, and Porygon2.</p> </section><h1>Checks and Counters</h1> <section><h1>Electric</h1> <p><strong>Ground-types: Defensive Ground-types such as Hippowdon, Gastrodon, and Gliscor can tank any of Zeraora's attacks and force it out with their STAB moves, while offensive Ground-types like Choice Scarf Excadrill, Choice Scarf Landorus-T, and Mega Swampert in rain can revenge kill it. However, Excadrill must be wary of Close Combat or Drain Punch from Zeraora, while Garchomp and Mega Garchomp must be wary of Play Rough.</p> <p><strong>Physically Defensive Walls: Physically defensive walls such as Galarian Weezing, Porygon2, and Zapdos generally threaten Zeraora, as it struggles to land very powerful hits on them, being crippled by Will-O-Wisp from Galarian Weezing or worn down by their attacks as a result. However, Choice Band Zeraora can heavily dent Galarian Weezing on the switch if it's running Iron Tail, and Porygon2 and Zapdos don't like their items being removed by Knock Off. Porygon2 also fears a boosted Close Combat.</p> <p><strong>Residual Damage: Entry hazards wear down Zeraora greatly during a match. Status moves such as Will-O-Wisp and Toxic significantly cripple Zeraora; the former halves the power of its attacking moves, and the latter puts it on a timer.</p> <p><strong>Faster Pokemon</strong>: Revenge killers such as Choice Scarf Victini, Sand Rush Excadrill, and Choice Scarf Greninja can outspeed and inflict heavy damage on Zeraora with their STAB moves.</p> <p><strong>Grass-types: Grass-types such as Mega Venusaur, Tapu Bulu, and Rillaboom are major threats to Zeraora, as they are able to tank most of its attacks with ease. Mega Venusaur can wear it down with its STAB moves and put it to sleep using Sleep Powder, while Tapu Bulu and Rillaboom are able to OHKO Zeraora with their STAB attacks. However, they are all KOed by a boosted Supersonic Skystrike from the Flyinium Z set, so they must be cautious. Some Grass-types like Ferrothorn and Zarude can also be dented by Close Combat, making them unreliable answers to Zeraora.</p> </section>",
    "sets": [
      {
        "name": "Choice Band (Electric)",
        "description": "<p>Zeraora is the premier physical wallbreaker for Electric teams thanks to its solid Attack stat, amazing coverage options, and amazing Speed tier, being able to pressure specially defensive walls such as Blissey, Alolan Muk, and Piloswine that are otherwise extremely difficult to handle for Electric teams. Close Combat threatens key Steel-, Dark-, and Normal-types such as Heatran, Tyranitar, and Diggersby. Play Rough helps a ton in the Dragon matchup, targeting Dragon-types such as Kommo-o, Mega Altaria, and Garchomp. Additionally, it nails the likes of Buzzwole, Mega Latias, and Mega Sableye. Iron Tail can be used instead to severely damage Fairy-types that Zeraora lures in like Tapu Bulu and Galarian Weezing. Knock Off notably provides coverage against Ghost- and Psychic-types like Blacephalon, Latias, and Latios while removing Eviolite from bulky threats such as Porygon2 and Galarian Corsola. Choice Band maximizes Zeraora's ability to threaten types like Dark, Dragon, and Normal. Maximum Speed investment with a Jolly nature allows Zeraora to outspeed key threats like Greninja and Mega Lopunny as well as Barraskewda outside of rain.</p> <p>All teammates appreciate Zeraora dealing with specially defensive walls like Blissey, Alolan Muk, and Piloswine, especially since it's one of the only viable physical attackers on Electric teams. Tapu Koko can deal with troublesome Ground-types like Gliscor and Landorus with Hidden Power Ice, as well as Hippowdon, Gastrodon, and Seismitoad with Grass Knot, which Zeraora appreciates. Additionally, it can take on Dragon-types like Kommo-o, unboosted Mega Altaria, and unboosted Mega Latias for Zeraora if it isn't running Play Rough. Alolan Raichu's Psychic typing lets it deal with threatening Poison-types to Zeraora such as Mega Venusaur and Galarian Weezing, and it also utilizes Grass Knot to beat Ground-types like Hippowdon, Gastrodon, and Seismitoad. When under Electric Terrain, it also outspeeds and handles the likes of Sand Rush Excadrill, Choice Scarf Greninja, and Mega Swampert in rain, which all outspeed and threaten Zeraora. Zapdos can deal with Ground- and Grass-types like Excadrill, Rillaboom, and Tapu Bulu while removing entry hazards that may cripple Zeraora with Defog. With its Choice Specs set, it is able to power through the defensive Grass- and Ground-types, such as Mega Venusaur and Swampert, that Zeraora hates. Zapdos or Rotom-W can provide a Ground immunity, with the latter forcing out Ground-types like Hippowdon, Mamoswine, and Gliscor with a powerful STAB Hydro Pump and keeping certain revenge killers in check for Zeraora, such as Choice Scarf Blacephalon and Choice Scarf Galarian Darmanitan. Both Magnezone and Alolan Golem can trap and eliminate or weaken certain Steel-types like Excadrill and Ferrothorn, giving Zeraora a better shot at breaking through Steel teams. Notably, Magnezone's Steel typing lets it take on Pokemon like Latias while making it a switch-in against Fairy- and Poison-type attacks, and Alolan Golem can provide Stealth Rock support.</p> "
      },
      {
        "name": "Flyinium Z (Electric)",
        "description": "<p>Flyinium Z Zeraora capitalizes on luring in and KOing the Grass-types that typically trouble Electric teams, such as Mega Venusaur, Tapu Bulu, and Rillaboom, making it a fearsome physical wallbreaker and setup sweeper. Bulk Up lets Zeraora set up in front of Pokemon like Ferrothorn, Mega Scizor, and Tyranitar, making it deadly in matchups like Steel and Dark by becoming difficult to wall and revenge kill after a couple of boosts. Close Combat provides important coverage against foes such as Blissey, Heatran, and Ferrothorn. Bounce is required in the last moveslot to use Supersonic Skystrike, powerful Flying-type coverage that makes Zeraora very threatening against Grass and Poison teams. Maximum Speed investment with a Jolly nature allows Zeraora to outspeed fast foes like Choice Scarf Tapu Bulu and Mega Lopunny, as well as Barraskewda outside of rain.</p> <p>All teammates on Electric teams appreciate Flyinium Z Zeraora luring in and removing troublesome Grass-types, like Mega Venusaur and Tapu Bulu, while still retaining the ability to defeat specially defensive walls such as Blissey and Tyranitar. Tapu Koko can handle Dragon-types such as Kommo-o, Mega Latias, and unboosted Mega Altaria, which are especially troublesome for Zeraora. Additionally, it can beat annoying Ground-types for Zeraora such as Landorus-T and Gliscor with Hidden Power Ice, as well as Hippowdon, Gastrodon, and Seismitoad with Grass Knot. Alongside Zeraora, Alolan Raichu can put a lot of pressure on Poison-types such as Mega Venusaur and Galarian Weezing due to its Psychic typing, while also beating Ground-types such as Hippowdon, Gastrodon, and Seismitoad with Grass Knot. Additionally, it outspeeds almost the entire metagame under Electric Terrain, which crucially lets it handle threats that outspeed even Zeraora like boosted Kommo-o, Kingdra in rain, and Sand Rush Excadrill. Tapu Koko, Alolan Raichu, and Regieleki can all handle physically bulky checks to Zeraora like Porygon2 and Galarian Corsola as well. Zapdos provides a Ground immunity for threats like Excadrill while removing entry hazards for Zeraora. It can also dispose of defensive Ground-type threats such as Mega Steelix with its Choice Specs set. Rotom-W forces out Ground-types like Hippowdon, Mamoswine, and Gliscor due to Levitate and its powerful STAB Hydro Pump. It also keeps certain faster Pokemon like Choice Scarf Victini, Barraskewda, and Choice Scarf Galarian Darmanitan in check for Zeraora. Both Magnezone and Alolan Golem can trap and eliminate or weaken Steel-types like Excadrill and Ferrothorn, giving Zeraora an even better shot at breaking through Steel teams. Magnezone's Steel typing also lets it provide a switch-in against Fairy-, Dragon-, and Poison-type attacks, and Alolan Golem can provide Stealth Rock support.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Electric analysis by", "members": [{"user_id": 491896, "username": "Rotten"}]}, {"name": "Quality checked by", "members": [{"user_id": 321991, "username": "Mateeus"}, {"user_id": 473171, "username": "DugZa"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 491896, "username": "Rotten"}]}
  },
  "Cinderace": {
    "comments": "<h1>Other Options</h1> <section><h1>Fire</h1> <p>On the Offensive Pivot set, Court Change can replace High Jump Kick or Gunk Shot as a way to get rid of entry hazards for Fire teams, notably Stealth Rock, while taking advantage of opposing field effects such as Reflect or Light Screen. However, stripping away coverage defeats the purpose of the set, which is to immediately threaten types like Fairy, Psychic, and Dark with its moves. Fire teams also already have entry hazard removal in Torkoal and dual screens Rotom-H, making it unneeded most of the time. Electro Ball can be a very powerful niche move , OHKOing Pelipper and surprising Slowbro and Toxapex on the switch, but it doesn't do much outside of this. Choice Scarf allows Cinderace to act as a great revenge killer, outspeeding other Choice Scarf users such as Terrakion, Galarian Darmanitan, and Tapu Lele as well as the likes of Cloyster after a Shell Smash boost, Mega Swampert under rain, Tapu Koko, and Mega Aerodactyl. However, Cinderace suffers from being locked into one move, as its true power comes from its Libero-enhanced versatility.</p> </section><h1>Checks and Counters</h1> <section><h1>Fire</h1> <p><strong>Bulky Water-types: Bulky Water-types like Slowbro, Swampert, and Toxapex can comfortably take most hits Cinderace throws at them and retaliate with their Water-type attacks, eventually taking Cinderace out. However, Bulk Up Cinderace can break through Swampert with a few boosts, and Toxapex must be wary of Shattered Psyche.</p> <p><strong>Physical Walls: Physically bulky Pokemon such as Hippowdon, Staraptor, and Galarian Corsola are all very capable of taking on Cinderace and threatening it back with status or attacks.</p> <p><strong>Super Effective Coverage: Cinderace's measly defenses allow any super effective moves from Pokemon like Hippowdon, Azumarill, Landorus-T, and Terrakion to easily OHKO it.</p> <p><strong>Dragon-types: Dragon-types like Garchomp, Dragonite, and Mega Latias can easily stomach most of Cinderace's moves and, in return, they can heavily damage it back due to Cinderace's frailty. However, certain ones like Latios, Mega Altaria, and Kyurem must be wary of. super effective coverage.</p> <p><strong>Revenge Killers: Fast, hard-hitting Pokemon that can survive a Sucker Punch such as Tapu Koko, Tornadus-T, Weavile, and Greninja threaten Cinderace and its teammates.</p> <p><strong>Status: Paralysis and burn ~once Libero changes its type from Fire~ cripple Cinderace's offensive potential. Also, Toxic puts its on a timer.</p> </section>",
    "sets": [
      {
        "name": "Bulk Up (Fire)",
        "description": "<p>Bulk Up Cinderace's great Speed tier and excellent Libero-boosted coverage moves allow it to threaten a myriad of types like Steel, Dark, and Normal. Its powerful STAB moves can be used to force switches, which can be utilized as a chance for Cinderace to Bulk Up to become even more threatening. Pyro Ball is Cinderace's most reliable move, nailing Steel- and Grass-types like Aegislash and Ferrothorn, and neutral targets such as Clefable while avoiding Rocky Helmet, Baneful Bunker, and King's Shield due to its lack of contact. High Jump Kick complements Pyro Ball's coverage, allowing Cinderace to hit certain Dark-, Steel-, and Normal-types hard, such as Tyranitar, Heatran, and Porygon2. Sucker Punch provides counterplay against frailer Pokemon that outspeed Cinderace, such as Choice Scarf Latios, Barraskewda, Choice Scarf Blacephalon, Alolan Raichu under Electric Terrain, and weakened Mega Aerodactyl. However, Zen Headbutt is an alternative alongside Psychium Z to let Cinderace lure in and OHKO threats to Fire teams such as Toxapex, Mega Diancie, Urshifu-R, and Keldeo with Shattered Psyche. Bulk Up Cinderace should be used as either a mid-game wallbreaker or as a sweeper, utilizing its great coverage moves boosted by Libero in order to break through teams.</p> <p>Mega Charizard X and Volcarona are both very potent setup sweepers that benefit from Cinderace getting rid of walls such as Toxapex and Tyranitar. In particular, boosted Mega Charizard X also defeats Dragon-types that threaten Cinderace like Garchomp and Mega Latias. Rotom-H is a great teammate to Cinderace, as it can set dual screens to help Cinderace set up while safely bringing it in with Volt Switch, or it can work as a Nasty Plot wallbreaker that can beat defensive Water- and Flying-types like Toxapex and Moltres for Cinderace. It also switches into Electric-types like Tapu Koko and Regieleki, but it needs to rely on Pain Split to keep itself healthy. Mega Charizard Y breaks through the physically defensive walls that can give Cinderace trouble such as Galarian Corsola and Slowbro. In return, Cinderace beats the special walls that Mega Charizard Y struggles against such as Blissey and Heatran. Blacephalon can soften up bulky Pokemon like Hippowdon and Gastrodon with its Choice Specs set or sweep late-game while wielding a Choice Scarf. Stallbreaker Heatran can trap and remove walls like Toxapex and Zapdos with Magma Storm, as well as checking offensive Rock-types like Mega Aerodactyl and Choice Scarf Nihilego by virtue of its Steel typing. Torkoal is able to set up Stealth Rock for Cinderace and provide sun support via Drought, enabling Cinderace's Pyro Ball to hit even harder. Choice Scarf Infernape is a very useful revenge killer that can dispose of threats that outspeed and OHKO Cinderace, such as the aforementioned Choice Scarf Nihilego and Greninja, while Choice Band Infernape is able to weaken bulky Pokemon like Rotom-W and Gliscor, relieving the pressure on Cinderace and allowing it to set up easier. If Cinderace is using Heavy-Duty Boots, Z-Celebrate Victini is a great teammate that takes advantage of Cinderace checking common checks to it such as defensive Heatran and Chansey. Conversely, Victini can heavily damage Pokemon Cinderace has trouble hitting effectively, such as Toxapex, Mega Venusaur, Mantine, and Tapu Fini.</p> "
      },
      {
        "name": "Offensive Pivot (Fire)",
        "description": "<p>Cinderace's great Speed tier, generous movepool, and great ability in Libero allow for an effective pivot set that can immediately threaten teams vulnerable to its coverage. Pyro Ball hits most foes decently while avoiding contact-based side effects. U-turn allows Cinderace to pivot out of the various defensive switches it forces while generating momentum and dealing solid damage. High Jump Kick targets the bulky Normal-, Rock-, and Dark-types that shrug off Pyro Ball such as Porygon2, Rhyperior, and Tyranitar. Alongside Pyro Ball, it creates a fearsome combination that hits all Steel-types in the metagame super effectively, making Cinderace a great tool in the Steel matchup. Gunk Shot can be run instead, hitting pesky Fairy-types and certain Fire-resistant Pokemon such as Azumarill, Tapu Fini, Araquanid, and Mantine. Sucker Punch allows Cinderace to revenge kill faster weakened threats like Zeraora, Barraskewda, and Choice Scarf Latias. Maximum Speed EVs let Cinderace outspeed and beat threats like Gengar, Tapu Lele, and Hydreigon.</p> <p>This Cinderace set is an all-out attacker rather than a reliable sweeper or wallbreaker, so it's best paired with Pokemon that capitalize on the offensive pressure it generates. Torkoal is a great partner to Cinderace, providing sun support and laying down Stealth Rock so Cinderace can net more KOs. Choice Band Victini and Infernape are fellow pivots capable of wearing down physically defensive Pokemon such as Rotom-W, Hippowdon, and Mega Venusaur so Cinderace has an easier time versus them. Similarly, Mega Charizard Y breaks down some of the physical walls that annoy Cinderace like Mega Slowbro and Swampert while also setting sun for it. In return, it appreciates Cinderace breaking common special walls, like Blissey and Heatran, and forcing out some of its offensive checks like Mega Diancie. Sweepers like Mega Charizard X and Z-move Volcarona also appreciate Cinderace beating the likes of Azumarill ~if running Gunk Shot, Tyranitar, and Heatran so they have an easier time cleaning against Fairy, Dark, and Steel teams, respectively. They also benefit from Cinderace's U-turn getting them safely into the field. Volcanion is another hard hitter that synergizes well with Cinderace because of its Water immunity, dealing with Pokemon such as Tapu Fini and Seismitoad while additionally KOing Pokemon such as Toxapex and Hippowdon.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Fire analysis by", "members": [{"user_id": 475589, "username": "Illecent Excaliburn"}]}, {"name": "Quality checked by", "members": [{"user_id": 32199, "username": "Mateeus"}, {"user_id": 491896, "username": "Rotten"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 475589, "username": "Illecent Excaliburn"}]}
  }
}