{
  "Ivysaur": {
    "comments": "<h3>Other Options</h3> <p>Ivysaur can run a stallbreaker set with Knock Off, Giga Drain, Sludge Bomb, and Synthesis with an EV spread of 80 HP / 252 SpA / 176 Spe and a Modest nature to break past bulky walls. However, Tangela outclasses Ivysaur in this role with its superior bulk and Special Attack. Ivysaur can run Knock Off with 16 Attack EVs over Sludge Bomb to hit Lampent, but it is unable to OHKO Eviolite sets. Substitute can be used to set up on more passive Pokemon such as Clefairy and Shadow Ball Galarian Corsola.</p> <h3>Checks and Counters</h3> <p><strong>Fire-types</strong>: Fire-types like Raboot and Lampent can force Ivysaur out with their powerful STAB moves, although they don't like switching in on Knock Off or Sludge Bomb.</p> <p><strong>Priority Users</strong>: Ivysaur can be revenge killed by priority users such as Piloswine and First Impression Fraxure while it is setting up or after it has been significantly chipped down.</p> <p><strong>Focus Sash Abra</strong>: While Ivysaur always survives Abra's Psychic from full HP, it can be easily revenge killed if it is weakened or sun it not up.</p> <p><strong>Flying-types</strong>: Rufflet and Vullaby can tank any hit from Ivysaur and retaliate with their STAB moves. However, they are vulnerable to Stealth Rock and are usually unable to OHKO a healthy Ivysaur.</p>",
    "sets": {
      "Sun Sweeper": {
        "description": "<p>The combination of Growth and Chlorophyll enables Ivysaur to be one of the most threatening sweepers in NFE. After a Growth and Stealth Rock damage, Solar Beam has a 93% chance to OHKO Eviolite Electabuzz, OHKOes a plethora of offensive Pokemon such as Gurdurr and Galarian Linoone, and 2HKOes every single Pokemon that does not resist Grass. While weaker, Giga Drain lets Ivysaur retain its bulk while sweeping, making it less likely to be revenge killed by Ice Shard Piloswine. Giga Drain is also able to be used after sun turns are over. Weather Ball gives Ivysaur a coverage move to hit Ferroseed and Klang, as well as other Steel-types for super effective damage, while also hitting Vullaby for significant damage. Sludge Bomb lets Iyvsaur do substantial amounts of damage outside of sun. Sleep Powder helps Iyvsaur set up on troublesome switch-ins like Galarian Corsola, and Rufflet, while Synthesis heals Iyvsaur, increasing its longevity without resorting to Giga Drain. The EV spread gives Iyvsaur enough speed to outspeed the entire unboosted metagame along with Choice Scarf Lampent under sun.</p> <p>Vulpix is Ivysaur's most important teammate, as it automatically sets up sun whenever it switches in. Additional sun sweepers are helpful, whether it's other Chlorophyll Pokemon such as Tangela or Fire-types like Lampent, Charmeleon, and Raboot. Ivysaur is especially vulnerable to Steel-types outside of sun, so the aforementioned Fire-types are useful for breaking past these threats. Some form of entry hazard removal is also recommended, as Ivysaur can be worn down by entry hazards rather quickly, so Hattrem or Wartortle is a good partner. Particularly, specially defensive Wartortle is a good partner, as it helps check Fire-types such as Lampent and Charmeleon while being able to pivot with Flip Turn. Shell Smash Wartortle with Weather Ball is a more offensive teammate option as well.</p>"
      },
      "Defensive Wall": {}
    },
    "credits": {"writtenBy": [{"user_id": 484270, "username": "hayedenn"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 355753, "username": "Eris"}, {"user_id": 231074, "username": "S1nn0hC0nfirm3d"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}, {"user_id": 449990, "username": "DC"}]}]}
  },
  "Charmeleon": {"sets": {"Choice Specs": {}}},
  "Wartortle": {
    "comments": "<h3>Other Options</h3> <p>Shell Smash Wartortle may opt for Aura Sphere so that it can break past Steel-type checks like Ferroseed and Klang, but its damage output is lacklustre. It can also utilise Weather Ball on sun teams to hit these targets. Nicher attacks like Water Spout and Zen Headbutt have some merit, but are generally too situational to justify over its better coverage or utility options. Instead of Toxic on defensive sets, Wartortle can opt for Yawn or Haze to either pair well with the slow Flip Turn, or check some setup sweepers like Combusken and Duosion. There's also the possibility for Wartortle to be specially defensive so that it may check Magmar and Lampent better.</p> <h3>Checks and Counters</h3> <p><strong>Grass-types</strong>: Thwackey can revenge kill Wartortle with a priority Grassy Glide, and Wartortle has a hard time breaking through defensive Grass-types like Roselia and Ferroseed without prior chip damage.</p> <p><strong>Special Walls</strong>: Shell Smash Wartortle won't be able to sweep when Mareanie and Ferroseed are still around, as they can wall its offensive attacks. They also discourage utility Wartortle by affecting it with residual damage.</p> <p><strong>Special Wallbreakers</strong>: Electabuzz uses super effective STAB attacks to break through defensive variants of Wartortle, and can pressure offensive ones before they have the chance to set up. Electabuzz is especially notable for being able to take a hit from Wartortle after a Shell Smash, although it must be wary of Surf boosted by Torrent.</p> <p><strong>Residual Damage</strong>: Without reliable recovery, Wartortle can be quickly worn down by Toxic and entry hazards; the latter can be particularly damning, as Wartortle is unable to reliably keep hazards off the field against Ferroseed or Mareanie and can be worn down by continuously switching into Spikes or poison damage.</p>",
    "sets": {
      "Shell Smash Sweeper": {
        "description": "<p>Great bulk, good typing, and access to Shell Smash make Wartortle a solid sweeper. Shell Smash bolsters Wartortle's mediocre Special Attack to wallbreaking levels, with the Speed investment allowing it to outspeed the entire unboosted tier in addition to a positive natured Combusken and Lampent at +1 Speed. Hydro Pump helps Wartortle clean up teams, albeit with shaky accuracy; after a Shell Smash, it also secures important 2HKOs on Pokemon like physically defensive Galarian Corsola and physically defensive Mareanie. Surf is a safer STAB option that, while not as strong, won't miss at a crucial moment. Ice Beam rounds out Wartortle's coverage, allowing it to hit Grass- and Dragon-type Pokemon such as Roselia and Fraxure. The last slot is adaptable to what a team needs. Substitute allows Wartortle to set up easily against passive Pokemon like Slowpoke and can put Wartortle in range of Torrent, providing it with access to a much stronger STAB move. Alternatively, Rapid Spin provides Wartortle with a form of entry hazard removal if the team needs it.</p> <p>Wartortle should be used mid- to late-game to sweep vulnerable teams. To this end, Pokemon that commonly counter Wartortle such as Ferroseed and Mareanie should be put in range of a KO before attempting to set up Shell Smash, lest they threaten Wartortle out with Bullet Seed or Haze respectively. Knock Off users such as Tangela and Gurdurr make for excellent partners, as they can often force the aforementioned Pokemon onto the field and remove their Eviolite with Knock Off. Similarly, Electric-types like Electabuzz and Pikachu pair nicely with Wartortle, as they can damage shared counters like Ferroseed and Roselia, and Wartortle in return pressures the Ground-types like Marshtomp that they might otherwise struggle to deal with. Wartortle is pressured by priority users, notably Pikachu and Thwackey, so Pokemon that can limit their switchin opportunities like Spikes Ferroseed and Toxic Spikes Koffing pair well with Wartortle. Lastly, it can often be difficult to set up Shell Smash multiple times throughout a battle, so Wish and Healing Wish support from Pokemon like Clefairy and Hattrem greatly benefit Wartortle in this regard.</p>"
      },
      "Utility Pivot": {
        "description": "<p>As a physical wall, Wartortle faces stiff competition with Galarian Corsola and Tangela, but it makes up for its lack of recovery with a utility-centric movepool and useful Fire-type resistance. Rapid Spin functions as entry hazard removal when up against physical attackers like Raboot, Piloswine, and Galarian Linoone. Wartortle also acts as a pivot with Flip Turn when checking these attackers, allowing it to generate momentum against switch-ins. Scald also threatens to burn physical attackers Wartortle checks and deters spinblockers like Lampent, while Seismic Toss offers more pressure against bulkier Pokemon like Koffing, Hattrem, and Ferroseed. Toxic pressures opposing walls such as Galarian Corsola, Tangela, and Vullaby, with the former being notable as an ineffective spinblocker if it gets worn down by Toxic damage.</p> <p>It is often best to pair Wartortle with additional pivots that appreciate it as a switch-in to physical attackers and for removing entry hazards. To this end, offensive pivots like Thwackey, Raboot, and Electabuzz make for great partners. Special walls like Klang and Ferroseed check Kadabra and Gastly for Wartortle, while in return, Wartortle can switch into attacks from Magmar and Piloswine. These Steel-types also work as Toxic switch-ins for Wartortle, and partners like Koffing, Roselia, and Hattrem can either absorb or prevent opposing attempts to set Toxic Spikes. Both offensive and defensive Grass-types check Wartortle, as it has little to deter them, but it can at least avoid them by pivoting out into wallbreakers like Lampent, Choice Band Piloswine, and Raboot. Finally, support from Wish and Healing Wish users like Clefairy, Togetic, and Hattrem combat Wartortle's lack of recovery, allowing it function more effectively throughout the match.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 301990, "username": "Calucha"}, {"user_id": 231074, "username": "S1nn0hC0nfirm3d"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 355753, "username": "Eris"}, {"user_id": 226429, "username": "Jett"}, {"user_id": 426495, "username": "3molgasm"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "Lumari"}, {"user_id": 240732, "username": "Astra"}]}]}
  },
  "Clefairy": {
    "comments": "<h3>Other Options</h3> <p>Calm Mind Clefairy makes for an excellent late-game sweeper. Physically defensive Clefairy tends to be the most reliable as a wall, but specially defensive Clefairy has a niche in checking Hattrem and Electabuzz. An offensive set with Life Orb and additional coverage attacks like Ice Beam can surprise as a wallbreaker, notably hurting walls like Vullaby and Tangela, but generally is less effective compared to faster wallbreakers.</p> <h3>Checks and Counters</h3> <p><strong>Poison-types</strong>: Strong Poison-types like Roselia, Ivysaur, and Gastly prey on the passivity of Clefairy, and defensive examples like Mareanie and Koffing wall it out.</p> <p><strong>Steel-types</strong>: Clefairy has a hard time detering Steel-types like Ferroseed, Klang, and Metang, but Ferroseed cannot deal with Flamethrower.</p> <p><strong>Wallbreakers</strong>: Any wallbreaker that doesn't mind Clefairy's usual coverage like Rufflet, Raboot, Lampent, and Lairon can switch in against it and break past its defenses.</p>",
    "sets": {
      "Utility": {
        "description": "<p>With a solid defensive typing, above average bulk, and Magic Guard to absorb status, Clefairy makes for a great physical defensive wall which provides teams with reliable utility. Moonblast is Clefairy's primary attack, dealing solid damage to common Fighting- and Dark-types such as Gurdurr, Vullaby, and Machoke, although it should be wary of Machoke's Heavy Slam. Soft-Boiled gives Clefairy the longevity to be a reliable defensive wall throughout the game as well as a scouting tool. Knock Off removes opposing Eviolites, weakening the defensive capability of foes like Klang and Hattrem. Thunder Wave cripples setup sweepers like Wartortle and faster attackers like Thwackey that try to take advantage of Clefairy's passive nature. Alternatively, if the team is lacking a Stealth Rock user, Clefairy can fulfill that role while Flamethrower can be used to deal some damage to Steel-types such as Ferroseed, which typically switch in on Clefairy.</p> <p>Clefairy should use Soft-Boiled to remain as healthy in order reliably check physical threats like Piloswine and Fraxure. Clefairy's Eviolite should be preserved, as it requires its item to perform its role as a wall. If Clefairy is running Stealth Rock, it should only try to set it up once an opposing Hattrem is removed. Knock Off should be used often early-game to remove as many Eviolites as possible to help with cleaners like Gurdurr and Wartortle. Wallbreakers, such as Rufflet and Piloswine, also appreciate Knock Off support as well as Clefairy's ability to lower the speed of opposing Pokemon with Thunder Wave. Specially defensive walls like Klang, Mareanie, and Ferroseed make for solid partners and are reliable switch-ins to Gastly so that Clefairy is not as easily revenge killed by it. Clefairy is very passive and works best when paired with U-turn and Parting Shot users such as Raboot and Galarian Linoone to avoid losing too much momentum.</p>"
      },
      "WishPass": {
        "description": "<p>Clefairy is a reliable Wish passer due to its great HP stat, defensive typing, and Teleport for slow pivoting. Moonblast is this set's only attacking move, dealing with Dark-, Dragon-, and Fighting-types and stopping it from being completely susceptible to Taunt. Wish can heal both Clefairy and its teammates like Machoke and Hattrem that lack recovery. Protect allows Clefairy to guarantee it receives its Wish as well as scout common Choice item holders such as Raboot and Hattrem. Alternatively, Moonlight works for its instantaneous recovery.</p> <p>Clefairy should switch into physical attackers, such as Gurdurr and Piloswine, or relatively passive Pokemon like Galarian Corsola in order to heal its teammates safely. Wallbreakers that lack recovery such as Lampent, Piloswine, and Raboot all benefit from the healing provided by Clefairy to enable them to switch in more reliably; these three may also switch into anticipated Poison- and Steel-type attacks that target Clefairy. Fighting- and Fire-types like Gurdurr and Raboot can cover for Clefairy's Steel-type weakness, and in return Clefairy is able to keep them healthy. Clefairy's passivity makes it vulnerable to setup sweepers like Klang and Wartortle, so use Teleport to safely bring in wallbreakers and revenge killers like Raboot and Thwackey to deal with these sweepers.</p>"
      },
      "Calm Mind": {}
    },
    "credits": {"writtenBy": [{"user_id": 226429, "username": "Jett"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 355753, "username": "Eris"}, {"user_id": 231074, "username": "S1nn0hC0nfirm3d"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "Lumari"}]}]}
  },
  "Abra": {
    "sets": {
      "Life Orb": {
        "description": "<p>Life Orb + Magic Guard with decent Special Attack and Speed makes Abra a threat for many walls in the tier. Magic Guard prevents Life Orb recoil while armoring Abra against status and entry hazard chip damage. Shadow Ball hits Galarian Corsola, Lampent, and Duosion. Dazzling Gleam is important for coverage against Dark-types such as Vullaby, Galarian Linoone, and Morgrem. Abra's last moveslot is flexible: Knock Off debilitates special walls such as Vullaby, Ferroseed, and Klang, which normally switch into Abra, while Substitute reduces the need for prediction when the foe is going to switch out, and Seismic Toss deals consistent damage against Steel-type Pokemon such as Ferroseed and Klang. Another set option worth using is Focus Sash + Counter. This combination brings less raw power than Life Orb Abra, but Magic Guard keeps Focus Sash safe through entry hazards, letting Abra survive against and KO physical attackers that would otherwise OHKO it.</p> <p>Due to Abra's frailty, it needs resilient teammates such as Galarian Corsola, Roselia, Ferroseed, and Clefairy, which can handle some common revenge killers that force Abra out such as Electabuzz, Raboot, Galarian Linoone, and Thwackey. Moreover, these aformentioned walls can also set entry hazards, which make Abra's checks less able to switch into its attacks. Abra has good synergy with Pokemon such as Tangela and Vullaby that some have Knock Off to debilitate two of its main switch-ins, named Vullaby and Ferroseed. Abra's own Knock Off can hinder its common switch-ins such as Vullaby, Clefairy, and Ferroseed, clearing the path to wallbreak for teammates such as Piloswine, Raboot, and Lampent. VoltTurn cores such as Raboot + Electabuzz help bring Abra into the field against walls such as Galarian Corsola and Roselia, which are scared of Abra's special attacks. Slow pivots such as Vullaby and Wartortle can also help, bringing Abra in against common walls such as Clefairy and Roselia, respectively.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 451786, "username": "Mirbro"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 543866, "username": "5Dots"}, {"user_id": 484270, "username": "hayedenn"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}]}
  },
  "Machoke": {
    "comments": "<h3>Other Options</h3> <p>A Bulk Up set with either Substitute or Encore makes for a decent stallbreaker. Encore in particular deals with setup users sweepers like Duosion, which sometimes uses Acid Armor to set up on Machoke.</p> <h3>Checks and Counters</h3> <p><strong>Physical Walls</strong>: Common physical walls in Tangela, Galarian Corsola, and Koffing make for great switch-ins to Machoke, and they even have an edge against Flame Orb variants thanks to Tangela outspeeding it and Koffing carrying Neutralizing Gas.</p> <p><strong>Psychic-types</strong>: Faster Psychic-types like offensive Hattrem and Abra make for good revenge killers against Machoke but could succumb to Bullet Punch from offensive sets if they are too weakened. Defensive Hattrem and Slowpoke check defensive and all-out attacker sets but should watch out for Machoke's Flame Orb set.</p> <p><strong>Fairy-types</strong>: Clefairy and Togetic sponge Machoke's Close Combat and Knock Off while striking back with their STAB moves. However, they worry about switching into Heavy Slam from offensive sets.</p> <p><strong>Faster Wallbreakers</strong>: Machoke has a poor Speed tier, allowing common wallbreakers such as Choice Specs Lampent, Choice Band Thwackey, and Rufflet to revenge kill it with little to no prior chip damage.</p>",
    "sets": {
      "Physically Defensive": {
        "description": "<p>Physically defensive Machoke differentiates itself from other walls like Gurdurr and Clefairy thanks to Dynamic Punch allowing it to greatly pressure foes and switch-ins. Knock Off enables it to pressure Pokemon that resist or are immune to Dynamic Punch such as Duosion, Hattrem, and Lampent and remove opposing Eviolites, making Dynamic Punch a much scarier move to switch into. Rest gives Machoke better longevity and reliability in checking physical wallbreakers like Raboot, Thwackey, and Piloswine. Sleep Talk notably provides extra Dynamic Punch PP. This set can opt for 44 Speed EVs to outspeed base 50 Speed Pokemon like Metang, Piloswine, and Marshtomp.</p> <p>Machoke can be used early- and mid-game to heavily pressure the opponent's team with Knock Off and Dynamic Punch's confusion. Machoke should only be brought in against physical threats it can take multiple hits from, like Raboot, Thwackey, Galarian Linoone, and Combusken, as being quickly forced to use Rest and Sleep Talk gives foes chances to set up. Because Machoke has trouble staying in on special attacks, walls like Klang, Mareanie, and Clefairy make for good teammates. Special attackers like Duosion, Gastly, and Electabuzz greatly benefit from Machoke's Knock Off support and ability to deal with Steel-types in Klang and Ferroseed. In return, these Pokemon can better pressure Poison- and Fighting-types like Mareanie, Koffing, and Gurdurr, which can slow Machoke down.</p>"
      },
      "Bulky Attacker": {
        "description": "<p>Machoke is a great pick thanks to its solid bulk and unstoppable coverage, but is generally outclassed by Gurdurr. Knock Off allows Machoke to hit Ghost- and Psychic-types like Hattrem and Lampent, while also debilitating its checks like Galarian Corsola by removing their Eviolite. Bullet Punch picks off faster threats like Galarian Linoone and Fraxure once they get worn down. Earthquake offers coverage for Mareanie and Neutralizing Gas Koffing, while Heavy Slam can hit physically defensive Fairy-types like Clefairy and Togetic that would otherwise wall this set. 44 Speed EVs allow Machoke to be faster than uninvested Piloswine, and the remaining HP and Attack investment solidifies Machoke's role as a bulky attacker.</p> <p>Machoke can work as an early-game lead, as it can threaten every Pokemon with its coverage while being hard to take down itself. However, Machoke is relatively slow, and wallbreakers like Choice Specs Lampent threaten it; try having fast revenge killers like Raboot and Drakloak as teammates for support. While Machoke takes physical hits well on its own, it can be worn down easily from residual damage, so pairing it with Tangela, Vullaby, and Mareanie can help alleviate pressure on it to check physical attackers. Special wallbreakers like Choice Specs Electabuzz and Roselia can be paired with Machoke to help break the physical walls it is unable to like Galarian Corsola, Koffing, and Charjabug.</p>"
      },
      "Flame Orb": {
        "description": "<p>With the extra speed and power that this set provides, Machoke makes an excellent wallbreaker. Flame Orb with Guts boosts Machoke's Attack to high levels, meaning not much outside of Koffing can safely switch into Machoke. Machoke can OHKO Piloswine with Close Combat and is nearly guaranteed to 2HKO Galarian Corsola with Knock Off after Stealth Rock damage. Bullet Punch can threaten faster Pokemon like Abra and Roselia, meaning they cannot revenge kill Machoke if they get worn down enough. Facade is a high Base Power general coverage option, whereas Heavy Slam can break Fairy-types like Clefairy and Togetic once their Eviolite has been removed.</p> <p>Entry hazard support from Piloswine, Roselia, and Ferroseed help provide the chip damage Machoke needs to 2HKO walls like Galarian Corsola. Even more helpful, Sticky Web support from users like Charjabug lets Machoke revenge kill more targets like Raboot and Choice Band Piloswine. Without Eviolite, Machoke is much more vulnerable and benefits from being brought in safely by pivots like Galarian Linoone and Klang; pivoting support also helps for triggering Flame Orb safely. Faster attackers like stallbreaker Tangela and Choice Specs Hattrem threaten this Machoke set more than usual; either they need to be significantly weakened to be put in Bullet Punch KO range, or Machoke should have support from faster teammates like Galarian Linoone and Gastly to help punish them. Cleaners like Wartortle and Fraxure can finish up games after Machoke dents their respective checks.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 231074, "username": "S1nn0hC0nfirm3d"}, {"user_id": 355753, "username": "Eris"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 226429, "username": "Jett"}, {"user_id": 355753, "username": "Eris"}, {"user_id": 231074, "username": "S1nn0hC0nfirm3d"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}, {"user_id": 449990, "username": "DC"}]}]}
  },
  "Slowpoke": {
    "comments": "<h3>Other Options</h3> <p>Thanks to Teleport and Regenerator, Slowpoke can function as a setter for teams that want Sunny Day or Trick Room support. Psychic is another attack to consider to hit Gurdurr and Koffing immediately compared to Future Sight, and can beat Wartortle when used with investment into Special Defense.</p> <h3>Checks and Counters</h3> <p><strong>Grass-types</strong>: The most abundant of its weaknesses, Grass-types like Thwackey, Tangela, and Roselia all have strong STAB attacks to break through Slowpoke, though none appreciate having status inflicted upon them.</p> <p><strong>Special Wallbreakers</strong>: Slowpoke is unable to effectively take hits from Electabuzz, Gastly, and Lampent, and notably gives Future Sight Duosion free switchin opportunities when running Thunder Wave.</p> <p><strong>Knock Off</strong>: While Slowpoke is able to tank hits from Gurdurr and Vullaby, it ultimately gets worn down by the attack and is less effective as a wall thereafter.</p> <p><strong>Substitute</strong>: Slowpoke is fairly reliant on status to pressure Pokemon, and as such, Substitute users like Klang, Wartortle and Rufflet can massively punish Slowpoke as its attacks are too weak for it to break the Substitute on its own.</p>",
    "sets": {
      "Physical Wall": {
        "description": "<p>Slowpoke is an excellent defensive pivot that can switch in against many common offensive threats such as Gurdurr, Piloswine, and Raboot. Teleport enables Slowpoke to gain momentum for its teammates, allowing it to bring in wallbreakers safely and simultaneously recovering its health with Regenerator. Scald pressures Piloswine, of which Slowpoke is an excellent check for, and spreads burns to wear down switchins like Ferroseed and Tangela. Otherwise, Future Sight pairs well with Gurdurr and Thwackey to discourage Poison-types like Roselia from switching in to take the hit. Toxic is valuable for crippling bulky Pokemon such as Vullaby, Tangela, and Galarian Corsola, as well as pressuring Wartortle lacking Substitute. Thunder Wave can be used to cripple fast threats like Thwackey. Yawn helps Slowpoke gain momentum with Teleport, forcing the foe to either switch out or be put to sleep. Lastly, Slowpoke may opt for both Future Sight and Scald and solely rely on the latter for spreading status.</p> <p>Slowpoke's special bulk is not as good as its physical bulk, meaning it gets forced out by strong special attackers such as Electabuzz, Lampent, and Tangela. Thus, specially defensive walls like Ferroseed, Roselia, and Klang are excellent partners, since they can soak up hits and patch Slowpoke's Grass and Electric weaknesses while also shoring up Slowpoke's inability to handle Wartortle. In return, Slowpoke can tank attacks from Raboot and Piloswine and act as a Knock Off absorber against users unable to break it like Gurdurr and Mareanie. Slowpoke is best paired with wallbreakers like Fraxure, Choice Band Raboot, and Flame Orb Gurdurr, since Teleport can bring them in safely. Additional Regenerator walls like Tangela and Mareanie when paired with Slowpoke forms a defensive core that can sponge most hits and take advantage of their passive recovery.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 231074, "username": "S1nn0hC0nfirm3d"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 355753, "username": "Eris"}, {"user_id": 226429, "username": "Jett"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}]}]}
  },
  "Gastly": {
    "comments": "<h3>Other Options</h3> <p>The immediate power of Choice Specs is usually preferred, although Life Orb is a consideration to avoid Pokemon with immunities to Gastly’s coverage like Rufflet and Klang from switching in freely. Gastly opts for coverage like Energy Ball or Psychic instead of Trick if the team relies on it to target threats like Palpitoad or Roselia. Another option is Hex, which works if the team has many status users. Choice Scarf also is a viable option as a revenge killer to Abra.</p> <h3>Checks and Counters</h3> <p><strong>Special Walls</strong>: Ferroseed, Klang, and Mareanie prevent Gastly from sweeping, but ought to watch out for Trick and Destiny Bond attempts.</p> <p><strong>Revenge Killers</strong>: Gastly is so frail that almost anything faster, like Raboot and Electabuzz, are great options for revenge killing it. Strong priority users like Choice Band Thwackey and Piloswine OHKO Gastly as well.</p> <p><strong>Dark-types</strong>: While Gastly is locked into Ghost-type attacks, Vullaby, Krokorok, and Galarian Linoone make for good checks, but are unreliable due to fearing Dazzling Gleam.</p>",
    "sets": {
      "Choice Specs": {
        "description": "<p>Gastly is powerful enough to threaten most slower targets, but being extremely frail makes it vulnerable to priority from bulky attackers like Piloswine and Thwackey. Gastly thus is best used breaking walls like Galarian Corsola and Tangela that are weak to its STAB attacks. Dazzling Gleam hits Dark- and Fighting-types, particularly Vullaby and Hakamo-o. Trick debilitates switch-ins to Gastly like Roselia, Klang, and Mareanie, while Destiny Bond takes advantage of its poor bulk to take down attackers like Machoke and Piloswine that it cannot OHKO. A Timid nature hardly affects the scope of Gastly’s Speed tier, only relevantly netting it niche revenge kill opportunities against Adamant Raboot, Choice-locked Thwackey, and opposing Gastly at the cost of wallbreaking power.</p> <p>Without any bulk to rely on in most cases, its best to preserve Gastly for safe switch-ins on the targets it preys on. This makes offensive pivots like Raboot, Thwackey, and Electabuzz great partners, as they bait in physical walls like Galarian Corsola and Tangela for Gastly to punish; the latter two additionally provide Knock Off support to soften up more targets like Vullaby and Koffing for Gastly to break. Sticky Web support from Charjabug broadens Gastly’s revenge kill opportunities to include faster threats like Drakloak and Abra, and its Volt Switch makes it an additional pivot for Gastly to enjoy as well. Other slow pivots, such as Volt Switch Klang and Teleport Clefairy, can also bring Gastly in safely whilst covering for their Psychic- and Dark-type weaknesses, respectively. Tangela and Ferroseed are walls Gastly relies on as a defensive backbone once its threatened by faster or priority attackers like Galarian Linoone, Thwackey, and Piloswine. In return, Gastly’s immunities to Toxic and Fighting-type attacks grant it an opportunity for it to come in unscathed if its wall teammates are targeted by these moves.</p>"
      },
      "Wallbreaker": {}
    },
    "credits": {"writtenBy": [{"user_id": 231074, "username": "S1nn0hC0nfirm3d"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 407249, "username": "Greybaum"}, {"user_id": 226429, "username": "Jett"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}]}]}
  },
  "Koffing": {
    "comments": "<h3>Other Options</h3> <p>Levitate is a valid alternative that enables Koffing to counter Piloswine, but it is rarely worth using when compared to the utility Neutralizing Gas provides. A specially defensive spread makes Koffing a solid check to Roselia and Tangela, but it matches up poorly against other common special attackers and has a far harder time switching into physical attackers like Gurdurr and Thwackey.</p> <h3>Checks and Counters</h3> <p><strong>Special Attackers</strong>: Duosion, Lampent, and Wartortle can all take advantage of Koffing's poor special bulk by threatening it with strong neutral STAB moves or by setting up. Lampent is especially notable for being able to remove Koffing's Toxic Spikes with Rapid Spin.</p> <p><strong>Residual Damage</strong>: Koffing's lack of recovery outside of Pain Split means that entry hazards and burns severely limit its ability to reliably check physical attackers.</p> <p><strong>Stallbreakers</strong>: Taunt users such as Galarian Linoone and Electabuzz can prevent Koffing from setting up Toxic Spikes and using Pain Split to recover health. Sweepers that use Substitute such as Rufflet and Klang can also take advantage of its passivity.</p>",
    "sets": {
      "Physically Defensive": {
        "description": "<p>Koffing serves as a reliable Toxic Spikes setter that can consistently take on Pokemon such as Raboot, Gurdurr, and Thwackey. Pain Split keeps Koffing healthy and allows it to often outlast the opponent's hazard control to ensure that Toxic Spikes stay up in the long run. Thief is used to remove Eviolite from the opponent while simultaneously allowing Koffing to better check Knock Off users like Thwackey and Gurdurr, while Will-O-Wisp can alternatively be used to cripple physical attackers and walls like Piloswine, Ferroseed, and Mareanie. Neutralizing Gas provides a huge amount of utility for Koffing and makes it far more reliable as a Toxic Spikes setter, negating Hattrem's Magic Bounce. It also makes it far easier to wear down Regenerator and Magic Guard users like Tangela and Clefairy, respectively. Additionally, because it can nullify Guts, Neutralizing Gas Koffing is one of the very few Pokemon that can switch into Flame Orb variants of Gurdurr and Machoke.</p> <p>Koffing should be paired with teammates that can take full advantage of Toxic Spikes support. Pokemon with Protect or Substitute, like Substitute + Calm Mind Lampent and Wish + Protect Clefairy, become far more dangerous once their foes are poisoned. Piloswine is a particularly good beneficiary of Toxic Spikes, as it can dissuade opposing Poison-types like Roselia and Mareanie from switching in and most of its switch-ins are vulnerable to poison. Pivots like Electabuzz, Thwackey, and Galarian Linoone benefit from Koffing's ability to pressure Tangela thanks to Neutralizing Gas cancelling out Regenerator and can keep it low by pivoting into Koffing. Koffing's greatest enemies are grounded Poison-types like Roselia and Mareanie, which can absorb its Toxic Spikes. Hattrem can prevent these Pokemon from setting up hazards and force them out, and Future Sight Duosion can gain momentum to put out strong offensive pressure. Good defensive partners for Koffing are special walls like Ferroseed and Marshtomp, as they can defeat common special attackers like Wartortle and Electabuzz that force Koffing out.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 225453, "username": "MAMP"}, {"user_id": 226429, "username": "Jett"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 355753, "username": "Eris"}, {"user_id": 231074, "username": "S1nn0hC0nfirm3d"}]}, {"name": "Grammar checked by", "members": [{"user_id": 302985, "username": "lotiasite"}]}]}
  },
  "Tangela": {
    "comments": "<h3>Other Options</h3> <p>Tangela can opt for Special Defense investment to reliably check strong Volt Switch users like Electabuzz and Klang, but this makes it less of a blanket check to physical attacks. Tangela can also function as setup sweeper outside of sun teams with Substitute and Growth, but this requires it to give up important coverage in Sludge Bomb or utility in Knock Off. Thief is an alternative to Knock Off when Tangela is the main switch-in to Knock Off and lets Tangela steal an Evolite from a foe.</p> <h3>Checks and Counters</h3> <p><strong>Specially Bulky Pokemon</strong>: Vullaby, Roselia, and Ferroseed are capable of taking multiple hits from Tangela and immune to its Stun Spore and Sleep Powder.</p> <p><strong>Poison-types</strong>: Tangela has little in its movepool to deter Roselia and Koffing and must rely on Knock Off and status moves to punish them. Their attacks force out Tangela, and Koffing's Neutralizing Gas also prevents recovery from Regenerator. It should be noted that Koffing's poor special bulk means it must be wary of switching in multiple times.</p> <p><strong>Fire-types</strong>: Fire Blast from Lampent and Combusken obliterates Tangela and prevents sun sets from sweeping, provided Tangela has not yet used Growth.</p> <p><strong>Special Attackers</strong>: Even with its Eviolite and HP investment, Tangela's special bulk is very poor, and it should avoid staying in on special attackers like Electabuzz and Drakloak.</p> <p><strong>Rufflet</strong>: Rufflet is a physical wallbreaker that OHKOes Tangela or uses Tangela's defensives sets as setup fodder. Substitute Rufflet can also block Sleep Powder and Stun Spore.</p>",
    "sets": {
      "Physically Defensive": {
        "description": "<p>Tangela is one of the best physical walls in the tier thanks to its sky-high Defense paired with Eviolite and Regenerator, giving Tangela amazing longevity. Giga Drain can further increase Tangela's longevity and hit Water- and Ground-types such as defensive Wartortle, Palpitoad, and Piloswine. Alternatively, Leaf Storm can 2HKO Piloswine and OHKO Wartortle. Knock Off is an excellent utility move for Tangela, removing Eviolite Galarian Corsola, Gurdurr, and Thwackey. Knock Off can also threatening Ghost-types like Lampent and Gastly from switching into Tangela safely. Toxic is an option that can be used over Knock Off for crippling bulky Pokemon like Galarian Corsola and Vullaby. Sludge Bomb is to hit Fairy- and Grass-types, namely Clefairy, Thwackey, and opposing Tangela. Synthesis provides reliable recovery for Tangela so it won't need to rely on Regenerator, while Leech Seed can be used for passive recovery, while also getting chip in against Raboot.</p> <p>While Tangela has immense physical defense, it has mediocre Special Defense, so special attackers such as Lampent, Roselia, and Wartortle can tear through Tangela. Special defensive walls such as Klang, Vullaby, and Mareanie all pair well with Tangela due to them being able to take on the aforementioned special attackers. Grass-types that aren't hit super effectively by Sludge Bomb or are immune to Toxic, namely Ferroseed, Roselia, and Ivysaur, can cause Tangela trouble; Ferroseed and Roselia can set Spikes against it, while Ivysaur can threaten it with Sludge Bomb and Weather Ball in sun. Therefore, having checks that can safely switch into these Pokemon, such as Magmar, Klang, and Vullaby, that can threaten them out or remove their entry hazards is encouraged. Fire-types, specifically Lampent and Raboot, although not being able to directly switch into Tangela due to fear of Knock Off, still pose a huge threat to Tangela, so Water-types such as Marshtomp and Wartortle are good partners.</p>"
      },
      "Chlorophyll Sweeper": {
        "description": "<p>Tangela is a good choice for sun teams since it has a good Speed tier, great offensive stats, and most importantly good bulk, but competes with Ivysaur and its better coverage. Growth increases Tangela's Attack and Special Attack by two stages under sun, making it a threatening sweeper. Giga Drain takes care of Ground- and Water-types such as Piloswine, Wartortle, and Slowpoke, while also providing it recovery. Solar Beam can be used over Giga Drain for more damage output to OHKO Piloswine and Hattrem with minimal chip, as well as 2HKO Galarian Corsola, at the cost of only being able to use it under sun. Sludge Bomb hits Fairy- and Grass-types, namely Clefairy, Morgrem, Thwackey, and opposing Tangela. Knock Off is to remove Eviolite from bulky Pokemon such as Vullaby, Roselia, Galarian Corsola, and Mareanie. Synthesis provides Tangela reliable recovery if it isn't running Giga Drain. 64 Speed EVs allow Tangela to outspeed Scarf Lampent and +1 Combusken when sun is active, in addition to outpacing the whole unboosted tier.</p> <p>Tangela needs sun support to function, and Drought Vulpix is the best Pokemon to do so. Additional sun sweepers like Ivysaur and Charmeleon should be paired with Tangela to form an offensive core. Tangela also appreciates Pokemon that can prevent entry hazards from being set, such as Hattrem, as well as entry hazards setters themselves like Piloswine and Galarian Corsola. Fire-types like Lampent and Raboot go well with Tangela, since they can break Steel-types such as Ferroseed and Klang, and in return, Tangela can break Water-types such as Slowpoke and Mareanie.</p>"
      },
      "Offensive": {
        "description": "<p>Offensive Tangela is able to compress several roles thanks to its amazing natural physical bulk and Regenerator letting it reliably check the likes of Gurdurr and Thwackey and ability to provide incredible offensive pressure with its potent Leaf Storm and an expansive utility movepool. Knock Off into Leaf Storm nets KOs on neutral targets such as Hattrem, Gurdurr, and Electabuzz. Alternatively, Giga Drain provides Tangela with some recovery and does not induce a Special Attack drop, but gives up immediate power. Sludge Bomb hits Grass-resistant Pokemon such as Thwackey and Vullaby and lets Tangela break past Clefairy. Lastly, Sleep Powder and Stun Spore cripple incoming switch-ins such as Lampent even though Roselia and Vullaby are not affected by them. 176 Speed EVs lets Tangela outspeed Adamant Piloswine and Adamant Machoke.</p> <p>Tangela should aim to use Knock Off and Sleep Powder or Stun Spore to cripple expected switch-ins during the early-game before breaking past foes with its STAB Leaf Storm. Since Tangela lacks the coverage to deal with Steel-types, Fire- and Fighting-types like Lampent, Raboot, Gurdurr, and Machoke make for great partners. Tangela struggles against Gastly and Ivysaur, and sun teams in general, so Pokemon that can pressure these threats, such as Vullaby, Roselia, and Drakloak, make for good teammates. Special walls like Klang, Marshtomp, and Galarian Corsola help mitigate Tangela's weakness to special attackers such as Lampent and Roselia. Entry hazards from Piloswine, Roselia, and Mareanie also help to wear down foes into Tangela's KO range. Tangela often struggles to make progress until Vullaby has been removed, so pairing Tangela with Pokemon that can pressure it, such as Electabuzz and Piloswine, is essential.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 418753, "username": "pazza"}, {"user_id": 226429, "username": "Jett"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 355753, "username": "Eris"}, {"user_id": 425492, "username": "Tack"}, {"user_id": 231074, "username": "S1nn0hC0nfirm3d"}, {"user_id": 407249, "username": "Greybaum"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}, {"user_id": 449990, "username": "DC"}]}]}
  },
  "Electabuzz": {
    "comments": "<h3>Other Options</h3> <p>Electabuzz can also function as a dual screens setter on offensive teams by using a moveset of Reflect, Light Screen, Volt Switch, and Thunderbolt or Taunt and while carrying Light Clay. Discharge can also be used instead of Thunderbolt to have better chances of paralyzing the foe; additionally, Thunder Wave is an option over Toxic allowing for better speed control.</p> <h3>Checks and Counters</h3> <p><strong>Ground-types</strong>: Ground-types like Piloswine, Marshtomp, Gabite, and Palpitoad can all easily switch into Electabuzz, as they stop it from pivoting out with Volt Switch or using Thunderbolt, as well as threatening it out with their super effective Ground-type attacks; however, all of them can be inconsistent, as none of them can recover lost health, rendering them weak to being chipped by Electabuzz's coverage or Toxic.</p> <p><strong>Specially Defensive Pokemon</strong>: Pokemon like Clefairy, Ferroseed, and Galarian Corsola can all handle Electabuzz's STAB attacks; however, all of them are susceptible to Taunt, as it stops them from recovering their health back.</p> <p><strong>Revenge Killers</strong>: Thwackey and Choice Scarf Krokorok can outspeed or use priority moves against Electabuzz to revenge kill it; however, none of them enjoy switching in on Electabuzz.</p>",
    "sets": {
      "Offensive Pivot": {
        "description": "<p>With the fastest Speed tier in the metagame, Electabuzz is one of the best offensive pivots in NFE, where it utilizes pivoting in Volt Switch and coverage to wear down opposing threats. Psychic functions as a coverage move to wear down Ground-types including Marshtomp, Piloswine, and Gabite. Focus Blast is used to hit Steel-types, predominantly Ferroseed, while Toxic can cripple walls and switch-ins like Galarian Corsola, Tangela, and the aforementioned Ground-types. Taunt prevents walls like Clefairy and Ferroseed from using status or recovering HP. Eviolite lets Electabuzz more sustainably take attacks, while Heavy-Duty Boots gives extra longevity when pivoting and negates Sticky Web's Speed drop.</p> <p>As a fast pivot, Electabuzz works well with other pivots, notably physical ones that can keep up momentum and offensive pressure like Raboot, Thwackey, and Vullaby. Thwackey is also able to threaten out Marshtomp and Piloswine, while Vullaby provides hazard removal in Defog along with a Ground-type immunity and reliable chip damage through Knock Off; all the aforementioned partners can also carry Taunt to block foes from recovering lost health. Knock Off users like Tangela, Mareanie, and Gurdurr also work well with Electabuzz, as they remove Eviolites from opposing walls, making it easier for Electabuzz to wallbreak. Entry hazard setters, notably Toxic Spikes setters like the aforementioned Mareanie and Koffing, work amazingly with Electabuzz and other pivots, as they can greatly take advantage of Toxic damage. Electabuzz is also easily worn down, even when carrying Eviolite, so having slow pivots like Slowpoke and Clefairy can allow it to safely switch in; furthermore, Clefairy can provide Wish support for Electabuzz and its partners to stay healthy.</p>"
      },
      "Defensive Pivot": {},
      "Choice Specs": {
        "description": "<p>Choice Specs Electabuzz functions quite similarly to the pivot set but imposes more offensive pressure by dealing more damage, having chances of OHKOing Mareanie, Raboot, and Piloswine after Stealth Rock damage. The extra power of Choice Specs also allows Electabuzz to 2HKO threats like Hattrem, Galarian Linoone, and Eviolite Raboot with Thunderbolt. Toxic can still be used to chip specially defensive walls like Galarian Corsola, stopping them from switching in too freely, while Teleport can work to build up momentum by bringing in the appropriate check when expecting an Electric-immune switch-in from the opponent.</p> <p>Knock Off users like Gurdurr, Vullaby, and Thwackey work great with Electabuzz, as they can easily put threats in range of its attacks through removing Eviolites and wearing them down; Vullaby and Thwackey can also pivot, extending momentum for the team. Offensive entry hazard setters like Piloswine, Krokorok, and Roselia also pair greatly, as they can impose immediate pressure along with setting entry hazards for consistent chip damage. Revenge killers and late-game sweepers such as Thwackey, Lampent, and Fraxure can pick up from Electabuzz's wallbreaking and revenge kill opposing threats. Being Choice locked means Electabuzz should be making sure to hit possible switch-ins, like using Focus Blast against Vullaby when opposing Ground-types are still healthy.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 355753, "username": "Eris"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 231074, "username": "S1nn0hC0nfirm3d"}, {"user_id": 226429, "username": "Jett"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}]}
  },
  "Omanyte": {"sets": {"Shell Smash": {}}},
  "Chinchou": {"sets": {"Special Pivot": {}}},
  "Togetic": {
    "comments": "<h3>Other Options</h3> <p>Defog Togetic can provide its team with more utility by functioning as a cleric when using Heal Bell as its fourth move, allowing its teammates to be freed of status. Togetic can also carry Thunder Wave to cripple opposing threats and slow them down. Nasty Plot Togetic could swap Dazzling Gleam for Draining Kiss in order to recover lost health, while Psychic can also be an option instead of Psyshock to reliably OHKO Koffing.</p> <h3>Checks and Counters</h3> <p><strong>Ice-types</strong>: Ice-types like Piloswine have no trouble breaking through Togetic through their super effective STAB attacks. Furthermore, special attackers with Ice-type coverage like Wartortle can also break Togetic down with Ice Beam.</p> <p><strong>Electric-types</strong>: Electabuzz has no trouble pressuring and OHKOing Togetic with Thunderbolt or Volt Switch.</p> <p><strong>Poison-types</strong>: Poison-types like Roselia, Koffing, and Mareanie can easily switch in and get rid of Defog Togetic through status and moves like Toxic and Sludge Bomb. Koffing and Mareanie can also remove Togetic's Eviolite through Corrosive Gas and Knock Off, respectively. However, these checks struggle against Nasty Plot Togetic, fearing Psychic-type coverage.</p> <p><strong>Special Attackers</strong>: Special attackers such as Choice Specs Electabuzz, Lampent, and Duosion can easily revenge kill Togetic while enduring very little damage in return.</p> <p><strong>Toxic Users</strong>: When not carrying Heal Bell, Togetic can easily be worn down and made unreliable by Toxic users like Ferroseed, defensive Wartortle, and Metang.</p>",
    "sets": {
      "Defog": {
        "description": "<p>Togetic functions as a physical wall and entry hazard remover in the NFE metagame. Being able to pressure out threats like Machoke, Galarian Linoone, and Thwackey allows Togetic to find use on multiple team archetypes. Defog is Togetic's primary asset, allowing it to remove entry hazards like Sticky Web and Stealth Rock from crippling its teammates. Dazzling Gleam is used to attack Fighting-, Dark-, and Dragon-types like Machoke, Vullaby, and Hakamo-o, preventing the former two from using Knock Off and the latter from setting up. Flamethrower enables Togetic to hit entry hazard setters like Charjabug and Ferroseed. Toxic can also be an option to cripple walls like Galarian Corsola, Marshtomp, and Piloswine that may take advantage of Togetic's passiveness. A spread of 248 HP / 252 Def / 8 SpD paired with a Bold nature enables Togetic to reliably wall physical wallbreakers like Choice Scarf Rufflet, Thwackey, and Raboot. Togetic is still bulky enough on the special side to check threats including Choice Scarf Lampent and Drakloak.</p> <p>As bulky as Togetic may be, it is also fairly passive and therefore works better on defensive builds like balance and bulky offense. Since Togetic's strongest asset is Defog, Pokemon who are weak to entry hazards like Lampent, Rufflet, and Choice Band Raboot can benefit from it. Togetic can easily be taken advantage of by set up sweepers like Klang, Wartortle, and Lampent, so having other defensive Pokemon like Machoke, Ferroseed, and Mareanie is heavily encouraged. Teammates like Gurdurr, Hattrem, and Ferroseed pair up well with Togetic due to their ability to threaten Ice- and Poison-types like Piloswine, Roselia, and Koffing. Ferroseed can also serve as an entry hazard setter, while Hattrem can heal Togetic through Healing Wish.</p>"
      },
      "Nasty Plot": {
        "description": "<p>Nasty Plot Togetic is a great wallbreaker in the metagame by being able to pressure and beat defensive cores like Ferroseed + Mareanie and Vullaby and Roselia through its coverage in Dazzling Gleam, Flamethrower, and Psyshock. Roost can also be used to recover lost health from entry hazards like Stealth Rock or chip damage from opposing threats. A Modest nature enables Togetic to really put a dent through the opponent's team, while maximum Speed investment allows it to outspeed all of the aforementioned walls as well as other threats like bulky Gurdurr and Hattrem.</p> <p>Togetic functions best on offensive archetypes, especially Sticky Webs teams, as Sticky Web enables it to outspeed threats like Thwackey, Krokorok, and Gabite. Therefore, Charjabug makes for an ideal partner for Togetic, as it is the metagame's premier Sticky Web setter it also compensates by allowing Togetic a free switch-ins through Volt Switch. Knock Off users such as Machoke, Galarian Linoone, and Thwackey are also helpful, as they can remove Eviolites and enable Togetic to easily put in dents through the opponent's team. Other common Sticky Web abusers like Lampent, Choice Band Piloswine, and Raboot are also good wallbreaking partners. As a Flying-type, Togetic is heavily pressured by Stealth Rock and therefore likes partners that can prevent or remove them, such as Hattrem and Wartortle. Furthermore, Hattrem can also heal back Togetic's lost health or remove its potential status ailment through Healing Wish.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 355753, "username": "Eris"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 226429, "username": "Jett"}, {"user_id": 407249, "username": "Greybaum"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}]}]}
  },
  "Piloswine": {
    "comments": "<h3>Other Options</h3> <p>Toxic may catch walls off guard, like Galarian Corsola and Slowpoke, but Piloswine has a hard time giving up one of its Ice-type attacks or Stealth Rock to fit it. Curse can be used to boost Piloswine's Attack stat without locking it into a move, but a lack of recovery makes it hard for Piloswine to pull off a sweep.</p> <h3>Checks and Counters</h3> <p><strong>Physical Walls</strong>: Piloswine has a hard time breaking through physically defensive walls like Clefairy, Hattrem, Levitate Koffing, and RestTalk Machoke, as they recover off its damage and outstall it, although they all have to be wary of the Choice Band set.</p> <p><strong>Tanks</strong>: Gurdurr, Tangela, and Wartortle trade hits well with Piloswine, and Gurdurr also has Defog to combat its Stealth Rock attempts. However, they struggle checking Choice Band Piloswine as effectively.</p> <p><strong>Revenge Killers</strong>: Thwackey and Raboot are some of the best revenge killers to Piloswine. Others like Electabuzz and Fraxure may need Piloswine chipped, and they must be kept healthy to avoid being KOed by Ice Shard.</p>",
    "sets": {
      "Stealth Rock": {
        "description": "<p>Piloswine is a great tank, and it's a great Stealth Rock user thanks to its significant bulk and ability to threaten anti-entry hazard Pokemon like Hattrem and Vullaby. High Horsepower is standard to hit as hard as possible in Grassy Terrain, but Earthquake can be opted for if this is not a concern. Icicle Crash and Icicle Spear both threaten Grass- and Flying-type Pokemon like Thwackey, Roselia, and Vullaby, although Icicle Crash is usually preferred for its consistent damage output and the luck factor of flinching Pokemon such as Hattrem and Clefairy, preventing their recovery. Ice Shard does considerable damage to faster Pokemon like Fraxure, Hakamo-o, and Rufflet, which lets Piloswine keep offensive presence even if it gets worn down, despite its low Speed.</p> <p>Piloswine can easily lose its defensive potential if hit by Knock Off from the likes of Vullaby and Ferroseed. If choosing to stay in against these targets, make sure that either Piloswine can afford to lose its Eviolite or that chipping them down is essential to the team's path to winning. Piloswine should avoid setting up Stealth Rock if the opponent's Hattrem is healthy, as it can block Stealth Rock; instead, Piloswine should predict its switch and attack it with High Horsepower or switch into a wallbreaker like Lampent. Pokemon resistant or immune to Fighting like Galarian Corsola, Clefairy, and Koffing can punish Gurdurr and Machoke for Piloswine. Ferroseed and Mareanie also pair well with Piloswine, as they can hit Hattrem with Knock Off, allowing Piloswine to overcome it.</p>"
      },
      "Choice Band": {
        "description": "<p>Piloswine can use its almost completely unresisted STAB combination to be a devastating wallbreaker with Choice Band. For example, Earthquake can 2HKO common Pokemon like Clefairy, Hattrem, and Ferroseed that might not expect the boosted damage and try to switch in. Ice Shard always OHKOes Gastly, as well as offensive Roselia after Stealth Rock damage. Superpower hits opposing Piloswine and Ferroseed very hard, guaranteeing a 2HKO on the former. With full Speed investment, Piloswine can outspeed and revenge kill slower targets like Marshtomp and Hattrem once they have been weakened or lost their Eviolite. High Horsepower can be used instead of Earthquake to maintain power in Grassy Terrain, but the loss in damage does make it harder to secure KOs against bulkier Pokemon like Wartortle.</p> <p>Piloswine cannot break through most walls on its own, and it relies on Knock Off support from Mareanie and Clefairy to debilitate bulkier Pokemon like Tangela and Wartortle. On the other hand, if Piloswine loses its Choice Band due to opposing Knock Off users, it will lose its own wallbreaking potential. It should thus be paired with Knock Off switch-ins like Trick Clefairy, Covet Roselia, and Charjabug; Sticky Web support from Charjabug is also a plus for Piloswine, allowing it to outspeed threats such as Fraxure instead of relying on Ice Shard. Stealth Rock users like Ferroseed and Galarian Corsola help chip faster threats like Roselia into OHKO range of Ice Shard. Not running Eviolite can make Piloswine susceptible to revenge killers like Thwackey and Raboot; defensive pivots like Vullaby and Wartortle can help soften blows from these Pokemon while utilizing U-turn or Flip Turn to help bring Piloswine back in safely. Anti-entry hazard Pokemon like Hattrem, Vullaby, and Gurdurr help Piloswine preserve its health for extended wallbreaking.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 231074, "username": "S1nn0hC0nfirm3d"}, {"user_id": 451786, "username": "Mirbro"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 226429, "username": "Jett"}, {"user_id": 355753, "username": "Eris"}, {"user_id": 407249, "username": "Greybaum"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}]}
  },
  "Corsola-Galar": {
    "comments": "<h3>Other Options</h3> <p>Iron Defense + Weak Armor is another way for Calm Mind Galarian Corsola to set up and sweep, though it becomes much less of a physical wall and more vulnerable to wallbreakers as a result. Specially defensive variants soak up weaker special hits like Electabuzz's Volt Switch, but they aren't as effective as physically defensive sets due to Strength Sap deterring physical attackers, whereas many special attackers carry Taunt.</p> <h3>Checks and Counters</h3> <p><strong>Dark- and Ghost-types</strong>: Dark-types like Galarian Linoone and Zweilous pressure Galarian Corsola and can work around Wil-O-Wisp. Nasty Plot Morgrem is a wallbreaker that easily sweeps past Galarian Corsola. Offensive Ghost-types like Lampent and Gastly hit hard with Shadow Ball, but they don't like switching into Shadow Ball themselves.</p> <p><strong>Stallbreakers</strong>: Taunt from Electabuzz, Thwackey, and Galarian Linoone completely shuts down any utility moves from Galarian Corsola, which is especially a problem if it needs to recover. Other stallbreakers like Substitute Raboot and Rufflet block Strength Sap and use most variants of Galarian Corsola as setup fodder. Stallbreaker Tangela can remove Galarian Corsola's Eviolite, put it to sleep, and then KO it with Leaf Storm.</p> <p><strong>Hattrem</strong>: Magic Bounce blocks Strength Sap and Stealth Rock, so Galarian Corsola always has to be wary of Hattrem switching in.</p> <p><strong>Item Removal</strong>: Despite their meager damage output, Knock Off and Thief make Galarian Corsola much more susceptible to wallbreakers later on. This makes walls like Vullaby and Ferroseed harder for Galarian Corsola to deal with.</p> <p><strong>Toxic Poison</strong>: Pokemon like Piloswine and Rapid Spin Wartortle are able to pressure Galarian Corsola with Toxic as it switches in. Toxic also shuts down any sweeping attempts without Rest or Heal Bell support, and Toxic Spikes can be a problem for the same reasons.</p>",
    "sets": {
      "Physical Wall": {
        "description": "<p>With staggering bulk and a colorful movepool, Galarian Corsola works as a hard-to-break wall. Most physical attackers like Piloswine, Gurdurr, Heavy-Duty Boots Raboot, and Eviolite Thwackey have no way to break through Galarian Corsola on their own, and other defensive Pokemon like Hattrem and Marshtomp ought to watch out for Whirlpool + Night Shade. The main flaws of Galarian Corsola are its tendency to be worn down and reliance on shaky recovery, as while Strength Sap is great for neutering physical attackers, it is easily blocked by Magic Bounce, Taunt, and Substitute. This set also fosters Stealth Rock use thanks to both Galarian Corsola being a spinblocker and Whirlpool trapping vulnerable targets, making it risky to switch into Hattrem and Defoggers like Gurdurr. Otherwise, Will-O-Wisp is a common option to punish physical attackers for the long-term and cripple Swords Dance Thwackey.</p> <p>Other physical walls like Clefairy, Tangela, and Koffing are better suited at tanking Knock Off for Galarian Corsola; they can even utilize Thief or Trick to take advantage of this interaction. Vullaby, Galarian Linoone, Zweilous, and Metang all work to check Psychic-types like Duosion and Hattrem, and the former three also check Lampent and Gastly. Special walls like Marshtomp, Mareanie, and Duosion are crucial so that Galarian Corsola isn't beaten by Wartortle and Electabuzz. In return, Galarian Corsola checks troublesome physical attackers like Piloswine, Gurdurr, and Raboot. Hattrem often switches into Galarian Corsola to prevent recovery and Stealth Rock, so pair it with Vullaby, Choice Specs Lampent, and Duosion that can threaten it. Heal Bell Clefairy can remove sleep and poison from Galarian Corsola in case it ever stays in on Tangela and Toxic Piloswine.</p>"
      },
      "Calm Mind": {
        "description": "<p>Calm Mind Galarian Corsola is a defensive sweeper thanks to Calm Mind + Strength Sap, making it very hard to break with direct damage. Galarian Corsola can easily set up and sweep late-game so long as opposing stallbreakers and phazers are removed or worn down. Will-O-Wisp targets Galarian Linoone and allows Galarian Corsola to function as a competent physical wall to Piloswine and Thwackey mid-game. Ice Beam hits Rufflet and hurts other bulky Flying- and Grass-types like Roselia, Vullaby, and Tangela. Rest is an option over Strength Sap to combat Toxic and help stall late-game, but this will make Galarian Corsola far more vulnerable to being revenge killed by strong physical attackers. 44 Speed EVs make Galarian Corsola faster than Duosion and Clefairy, and the remaining EVs are invested to maximize physical bulk to complement Calm Mind boosts.</p> <p>Poison-types like Mareanie, Koffing, and Roselia support Galarian Corsola by both removing opposing Toxic Spikes and setting their own to wear down Dark-types and special walls. Ground-types like Piloswine and Marshtomp target Haze Mareanie and punish Taunt Electabuzz. Hattrem is another switch-in that counters Ferroseed. Knock Off users like Tangela, Thwackey, and Gurdurr lure in and cripple Roselia and Vullaby, making them more vulnerable to Galarian Corsola late-game. Water-types like Mareanie and Wartortle deal with Raboot, and Lampent, which otherwise may beat Galarian Corsola with stallbreaking and wallbreaking sets.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 231074, "username": "S1nn0hC0nfirm3d"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 226429, "username": "Jett"}, {"user_id": 270818, "username": "lepton"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}]}]}
  },
  "Combusken": {"sets": {"Specially Offensive": {}, "Swords Dance": {}}},
  "Marshtomp": {
    "comments": "<h3>Other Options</h3> <p>Marshtomp can forgo utility to become a more reliable wall with Rest + Sleep Talk, but this usually requires that another teammate has Stealth Rock instead. Seismic Toss is a plausible replacement for one of its attacks for more consistent damage against Defoggers, especially when paired with Toxic, and it also breaks Rufflet's Substitute. Whirlpool has a niche when paired with Toxic or Yawn, as it allows Marshtomp to severely wear down a Pokemon or guarantees the sleep from Yawn.</p> <h3>Checks and Counters</h3> <p><strong>Grass-types</strong>: Tangela and Thwackey can switch into Marshtomp's attacks and threaten it out with their Grass-type STAB attacks. Ferroseed can freely set up Spikes against Marshtomp.</p> <p><strong>Magic Bounce Users</strong>: Hattrem prevents Marshtomp from setting up Stealth Rock, reflects its status moves, and often carries Giga Drain.</p> <p><strong>Setup Sweepers</strong>: Rufflet and Duosion can use Marshtomp as setup fodder. The former has Substitute to avoid Marshtomp's status moves, while Duosion is immune to Toxic but must be wary of Yawn.</p> <p><strong>Residual Damage</strong>: Marshtomp is vulnerable to chip damage from entry hazards and status moves due to its lack of reliable recovery, which limits its ability to check offensive threats.</p>",
    "sets": {
      "Mixed Wall": {
        "description": "<p>Marshtomp's great defensive typing makes it a great wall and counter to Electabuzz. Gabite does compete in these roles, and it may appear to outclass Marshtomp with its better Speed and even better defensive typing. However, Marshtomp beating Ice Punch Electabuzz and checking Fire-types better makes it plenty worthwhile. With RestTalk, it can afford to take repeated hits and chip damage. It only needs Earthquake as an attack because, while it cannot harm most Flying- and Grass-types, using Stealth Rock when they switch in suffices as punishment. In the event the team can afford another Stealth Rock user, then Marshtomp could opt for Scald or Yawn instead to pressure foes with status, though neither are as effective as Stealth Rock. A mixed defensive EV spread works best, as Marshtomp does not need much special bulk to counter Electabuzz, whereas extra physical bulk helps with Raboot.</p> <p>Defoggers and Rapid Spin users like Vullaby and Wartortle often switch into Marshtomp when it uses Stealth Rock. Switching to an offensive teammate like Electabuzz, Choice Band Raboot, and Fraxure as they clear Stealth Rock is a great way to bring them in safely and preserve momentum; if they don't go for removal, then Marshtomp at least secured Stealth Rock to punish them later on. As for Hattrem and its Magic Bounce, use Dark-types like Galarian Linoone, Vullaby, and Zweilous to beat it, as well as offensive partners like Lampent and Thwackey that can switch into Giga Drain with no problem. Defensive partners that resist Grass are also a must; physical walls like Roselia, Tangela, Ferroseed, and Koffing complement Marshtomp in this vein by checking Thwackey.</p>"
      },
      "Special Wall": {
        "description": "<p>Thanks to an excellent defensive typing, Marshtomp excels as a special wall that checks Fire-types such as Lampent and specially offensive Combusken, blocks pivoting attempts from Electabuzz and Klang, and threatens foes with Earthquake. Toxic cripples common switch-ins such as Thwackey and Tangela. Alternatively, Yawn can be used to force switches and synergize with Stealth Rock to prevent Defoggers from removing entry hazards. It also punishes Ferroseed and Duosion, which are both immune to Toxic, from switching in. Marshtomp can also opt for a mixed spread of 252 HP / 152 Def / 104 SpD and an Impish nature to better handle Piloswine and Electabuzz, while still avoiding a 3HKO from Electabuzz.</p> <p>Marshtomp should aim to use its typing to force switches and set up Stealth Rock early-game and then focus on walling special attackers. Physical walls such as Koffing, Tangela, and Gurdurr benefit from Marshtomp checking special wallbreakers such as Gastly and Lampent; in return, they handle physical wallbreakers such as Thwackey and Gurdurr. Pokemon that provide entry hazard control like Gurdurr, Hattrem, and Vullaby keep Marshtomp from being quickly worn down by residual damage. As a wall that lacks reliable recovery, Marshtomp greatly appreciates support from Wish and Healing Wish users such as Clefairy and Hattrem. Pokemon that can check Grass-types such as Golbat, Roselia, and Koffing are solid partners, as they cover for Marshtomp's glaring 4x weakness.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 226429, "username": "Jett"}, {"user_id": 231074, "username": "S1nn0hC0nfirm3d"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 355753, "username": "Eris"}, {"user_id": 407249, "username": "Greybaum"}, {"user_id": 226429, "username": "Jett"}, {"user_id": 451786, "username": "Mirbro"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}, {"user_id": 449990, "username": "DC"}]}]}
  },
  "Linoone-Galar": {
    "comments": "<h3>Other Options</h3> <p>Choice Band sets give more breaking power to Galarian Linoone, and let it also take advantage of Switcheroo to cripple walls. Choice Scarf works for that aspect as well, although it is usually inferior to Toxic Orb sets due to the Choice-lock and innability to take advantage of Facade. Thunder Wave is an option for speed control that works well to deter Counter Abra and Shell Smash Wartortle.</p> <h3>Checks and Counters</h3> <p><strong>Fighting-types</strong>: By resisting Knock Off, Fighting-types like Machoke and Combusken are ample switch-ins to Galarian Linoone, and Gurdurr especially threatens it with its priority Mach Punch.</p> <p><strong>Physical Walls</strong>: Pokemon that function even after being hit by Taunt and Knock Off like Tangela, Clefairy, and Koffing prevent Galarian Linoone from capitalizing against them while they wear it down.</p> <p><strong>Slow Pivots</strong>: Defensive pivots like Charjabug, Vullaby, and Wartortle tank Galarian Linoone's attacks, and have pivoting attacks themselves to gain momentum against it.</p> <p><strong>Revenge Killers</strong>: Focus Blast from Electabuzz OHKOes Eviolite Galarian Linoone. Toxic Orb sets usually won't have to worry about faster Pokemon, but strong priority attackers like Thwackey and Piloswine become more of an issue.</p>",
    "sets": {
      "Eviolite Pivot": {
        "description": "<p>This set capitalizes on Galarian Linoone's fantastic utility movepool to shut down common walls such as Galarian Corsola and Ferroseed. Knock Off is a very coveted move in the tier, as it can remove Eviolite from defensive Pokemon such as Galarian Corsola, Tangela, and Mareanie, making them significantly less bulky and easier to deal with. Double-Edge is Galarian Linoone's best Normal STAB attack, hitting most of the tier for neutral damage and threatening Pokemon that tend to switch in on Knock Off such as Gurdurr. Taunt can be used to further cripple the aforementioned defensive walls, stopping them from getting up their respective entry hazards whilst also preventing them from spreading status. Parting Shot lets Galarian Linoone act as a pivot that can also weaken common wallbreakers such as Machoke.</p> <p>Pokemon that are able to switch into strong Fighting-types such as Gurdurr and Machoke make for great partners. These include physical walls like Galarian Corsola, Tangela, Koffing, and Clefairy. Galarian Corsola in particular makes for an exceptional partner to Galarian Linoone, as it can deal with strong wallbreakers whilst also providing entry hazard support, while Galarian Linoone is able to knock out checks to Galarian Corsola such as Hattrem and Gastly. Pokemon that are able to provide speed control or Sticky Web support such as Charjabug and Thunder Wave Clefairy tend to be good partners for Galarian Linoone to help it break past faster wallbreakers such as Abra and Choice Scarf Raboot. Pokemon with access to U-turn like Raboot and Thwackey also complement Galarian Linoone very well, as they form a pivoting core that helps create momentum in a battle.</p>"
      },
      "Toxic Orb Pivot": {
        "description": "<p>This set is a viable option to capitalize on Galarian Linoone's ability Quick Feet in conjuction with STAB Facade. As one of the fastest Pokemon in the tier, Galarian Linoone is able to use its STAB-boosted Facade offensively and revenge kill many threats such as Wartortle and Raboot. Protect gives Galarian Linoone a much easier time activating its Toxic Orb while also allowing it to stall out turns of Sun or Grassy Terrain. Switcheroo can be used to cripple switch-ins like Vullaby, Tangela, and physically defensive Machoke. Taunt lets it shut down common defensive Pokemon that rely on status moves like Galarian Corsola and Mareanie. Parting Shot gives Galarian Linoone an opportunity to switch out on its checks while making them weaker and easier to switch into.</p> <p>This set synergizes extremely well with strong wallbreakers that struggle with Galarian Corsola such as Gurdurr and Thwackey, as well as being able to knock out threats such as Lampent for defensive walls like Koffing and Tangela. Clerics such as Clefairy and Hattrem are especially notable partners, as they are also able to give Galarian Linoone much more longevity with the use of Wish and Healing Wish. Volt Switch and U-turn users such as Klang, Thwackey, and Electabuzz form VoltTurn cores with Galarian Linoone, which helps keep momentum in a battle, making them exceptional partners. Try to pivot into special wallbreakers that break through Machoke and Tangela, with Electabuzz and Lampent being great teammates for the job.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 462865, "username": "PH"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 231074, "username": "S1nn0hC0nfirm3d"}, {"user_id": 355753, "username": "Eris"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "Lumari"}]}]}
  },
  "Lairon": {
    "comments": "<h3>Other Options</h3> <p>Toxic cripples physical walls such as Tangela and Galarian Corsola. Eviolite Lairon can be used as an offensive Stealth Rock setter or Rock Polish sweeper, but it is considerably weaker than the Choice Band set.</p> <h3>Checks and Counters</h3> <p><strong>Special Attackers</strong>: Pokemon like Lampent, Electabuzz, and Tangela are able to OHKO the specially frail Lairon with their coverage moves or STAB attacks.</p> <p><strong>Fighting-types</strong>: Gurdurr, Machoke, and Combusken can easily OHKO Lairon. Gurdurr is also able to revenge kill Lairon with Mach Punch, though it is not a guaranteed OHKO.</p> <p><strong>Defensive Ground-types</strong>: Marshtomp, physically defensive Gabite, and the rare Hippopotas are able to switch into most of Lairon's attacks and can threaten it out.</p> <p><strong>Knock Off</strong>: Lairon isn't very strong without its Choice Band, so it needs to be careful of any Pokemon that potentially have Knock Off such as Tangela and Thwackey.</p>",
    "sets": {
      "Choice Band": {
        "description": "<p>Choice Band Lairon is one of the most threatening physical wallbreakers in the NFE metagame. With Rock Head, it is able to use Head Smash without taking recoil, 2HKOing physically defensive Clefairy, Hattrem, and Mareanie as well as every physical wall that does not resist Head Smash after losing Eviolite to Knock Off. Heavy Slam is primarily used to hit Fighting- and Ground-types such as Gurdurr and Gabite, which resist Head Smash, while having the added benefit of being 100% accurate. Superpower hits Steel-types such as Ferroseed and Klang as well as Marshtomp. Stealth Rock takes advantage of the switches Lairon forces, while Double Edge lets Lairon hit Marshtomp for neutral damage without lowering its Attack stat and is still a powerful move against Hattrem and Gurdurr.</p> <p>Lairon's role is to weaken walls enough to be picked off later on by late-game cleaners such as Electabuzz, Thwackey, Raboot, and Galarian Linoone. The former three are also able to bring in Lairon more easily with Volt Switch or U-turn. Pairing Lairon with Knock Off users such as Tangela, Gurdurr, or Mareanie makes it even more difficult for your opponent to switch things into Lairon. Entry hazard support from Pokemon like Clefairy, Ferroseed, and Koffing is also crucial, as it can chip common switch-ins such as Tangela, Marshtomp, and Gurdurr into a range of KO. Koffing and Clefairy are especially useful because they cover Lairon's Fighting-type weakness, and Clefairy can also check special attackers and bring Lairon in safely with Teleport. If using Stealth Rock on Lairon, be careful against Magic Bounce Hattrem</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 484270, "username": "hayedenn"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 226429, "username": "Jett"}, {"user_id": 355753, "username": "Eris"}]}, {"name": "Grammar checked by", "members": [{"user_id": 331519, "username": "CryoGyro"}]}]}
  },
  "Roselia": {
    "comments": "<h3>Other Options</h3> <p>Toxic Spikes can work in tandem with or in place of Spikes to wear down targets like Piloswine and Tangela. However, Toxic Spikes are foiled by other Poison-types like Mareanie, Koffing, and opposing Roselia while Spikes and offensive coverage are generally more effective at pressuring teams. Stun Spore is another status option over Sleep Powder, even though it is generally outclassed by the former.</p> <h3>Checks and Counters</h3> <p><strong>Flying-types</strong>: Vullaby is one of the main checks to Roselia, as it is able to reliably Defog and pressure Roselia with Knock Off and Brave Bird. Moreover, Vullaby is not affected by Sleep Powder due to Overcoat. Rufflet pressures Roselia with its super effective coverage, but struggle switching in on its attacks. Flying-type coverage such as Acrobatics on Thwackey also threatens Roselia once Eviolite is removed.</p> <p><strong>Steel-types</strong>: Roselia's STAB attacks are completely ineffective against Ferroseed, Klang, and Metang, but it may still set Spikes to wear them down.</p> <p><strong>Fire-types</strong>: Physically offensive attackers like Raboot and Combusken OHKO Roselia, while Lampent also threatens Roselia. Lampent is the only one that can really switch into Roselia. Torracat is also a threat that normally does not care about Spikes as it commonly runs Heavy-Duty Boots.</p>",
    "sets": {
      "Mixed Wall": {
        "description": "<p>With a mixed defensive EV spread, Roselia can check both physical and special attackers like non-Acrobatics Thwackey, Vullaby, Wartortle, and Electabuzz. Spikes provides great utility in pressuring opposing Pokemon such as Electabuzz, Piloswine, and Wartortle and wearing them down for Roselia to KO. Roselia is the best Spikes setter in NFE because it can switch into passive walls such as Tangela and Clefairy and threaten them with Sludge Bomb. Giga Drain is the main Grass-type STAB move, hitting Wartortle and Piloswine. Leaf Storm is sometimes used over Giga Drain for more immediate power against weakened walls such as Galarian Corsola and Duosion, even though it leaves Roselia useless afterwards. If there is another Wartortle check on the team, however, Covet may be used to potentially recover Roselia's Eviolite post-Knock Off. Sludge Bomb lets Roselia check opposing Grass-types like Tangela and Thwackey and pressure the likes of Vullaby and Hattrem with poison. Poison Point is preferred over Natural Cure, as it can poison Thwackey and Vullaby if they use their contact moves, and Roselia is immune to Toxic anyway.</p> <p>Roselia fits best on balance and bulky offense teams, which love Spikes. Roselia pairs well with special walls that can check Lampent such as Vullaby and Gabite. It also enjoys physical walls like Galarian Corsola, Clefairy, and Gurdurr which help checking Thwackey running Acrobatics, Galarian Linoone, and Raboot, though Galarian Corsola does not check Galarian Linoone. Moreover, both Clefairy and Galarian Corsola provide Stealth Rock, stacking entry hazard damage. Backup checks to special attackers like Thwackey for Wartortle, and Piloswine for Electabuzz, help prevent Roselia from being overwhelmed. Piloswine also provides Stealth Rock. Wallbreakers and setup sweepers such as Thwackey, Raboot, and Shell Smash Wartortle appreciate Spikes support. A long-term way to deter entry hazard removers is useful, like Electabuzz or Vullaby, which can threaten opposing Vullaby and punish Hattrem for trying to bounce back Spikes with Magic Bounce, respectively.</p>"
      },
      "Specially Defensive": {
        "description": "<p>Thanks to Roselia's great defensive typing and solid bulk, it can check Pokemon such as Tangela, Wartortle, and Electabuzz. Spikes provides great utility in pressuring opposing grounded Pokemon and sometimes putting them in range of Roselia's attacks. Giga Drain increases Roselia’s longevity while checking Wartortle. Sludge Bomb provides good coverage with Giga Drain, notably hitting Grass-types such as Thwackey and Tangela, while also fishing for poison against bulky foes like Vullaby and Galarian Corsola. Natural Cure is preferred over Poison Touch as it helps against status and Roselia is not expected to sponge physical attacks.</p> <p>Roselia fits best on balance and bulky offense builds thanks to its ability to provide its teammates with entry hazard support via Spikes. Roselia should switch in on special attackers that it checks such as Tangela and Wartortle and threaten them out. However, if the opposing team contains a Hattrem, Roselia should attack or double out on the predicted switch rather than set Spikes. Roselia pairs well with physical walls that can help mitigate its lack of physical defense such as Galarian Corsola, Clefairy, and Vullaby. Wallbreakers and setup sweepers that appreciate Spikes support such as Thwackey, Raboot, and Wartortle all pair well with it as well.</p>"
      },
      "Offensive Spikes": {
        "description": "<p>Roselia is commonly used as an offensive entry hazard setter due to its high Special Attack and ability to help offensive teammates like Fraxure and Raboot by putting other Pokemon in range of their attacks with Spikes. Sludge Bomb and Leaf Storm or Giga Drain are necessary STAB moves. Synthesis is an alternative to Giga Drain that provides even more longevity. Giga Drain allows Roselia to hit Pokemon like Mareanie and Gurdurr hard without dropping stats. Sleep Powder targets switch-ins and setup sweepers alike, such as Lampent, Hakamo-o, and Duosion, rendering them ineffective. Rest is another option that fits well with Natural Cure.</p> <p>Roselia functions as an offensive Spikes setter that performs best on balance and offensive teams. Offensive Pokemon appreciate the extra damage Spikes provides; thus, wallbreakers such as Thwackey, Raboot, and Galarian Linoone all pair well with it thanks to the amount of offensive pressure they apply. Stealth Rock support from Pokemon such as Piloswine, Galarian Corsola, and Clefairy all make it easier for Roselia to pressure Pokemon such as Vullaby. Roselia pairs well with Ghost-types such as Galarian Corsola thanks to their ability to spinblock and ability to switch into Raboot, which forces Roselia out. Roselia appreciates VoltTurn users such as Raboot and Electabuzz, as they capitalize on hazard pressure and bring Roselia in safely with pivot moves. Setup sweepers such as Thwackey, Wartortle, and Gurdurr all appreciate Roselia's ability to set Spikes, which weakens their respective checks such as opposing Roselia, Electabuzz, and Galarian Corsola, respectively.</p>"
      },
      "Choice Specs": {
        "description": "<p>Choice Specs allows Roselia to break through common walls such as Galarian Corsola, Vullaby, and opposing Roselia. Giga Drain provides Roselia with a form of recovery while also being a Grass-type STAB move that does not reduce its Special Attack. Shadow Ball allows Roselia to hit Lampent, and Drakloak while also being its best option for hitting Ferroseed. Extrasensory is an option over Shadow Ball should Roselia need to hit Grass-resistant Pokemon such as Hakamo-o and other Roselia.</p> <p>Choice Specs Roselia fits best on offensive and balance builds that lack a reliable wallbreaker. Slow pivots such as Teleport Clefairy and Slowpoke and U-turn Vullaby allow Roselia to switch in with ease. Additionally, Roselia can switch in on more passive Pokemon such as Galarian Corsola and Clefairy. Because of the Special Attack drop that Leaf Storm induces, it is best to use it against Pokemon that it can OHKO. Roselia appreciates Pokemon such as Galarian Corsola, Piloswine, and Slowpoke that can help mitigate its weakness to fast attackers such as Raboot and Electabuzz. Pokemon that can take advantage of Klang and Ferroseed, such as Gurdurr, Thwackey, and Lampent, can all prevent Roselia from being used as setup fodder.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 272450, "username": "BP"}, {"user_id": 451786, "username": "Mirbro"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 457453, "username": "85percent"}, {"user_id": 355753, "username": "Eris"}, {"user_id": 517892, "username": "pannu"}, {"user_id": 484270, "username": "hayedenn"}, {"user_id": 407249, "username": "Greybaum"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}, {"user_id": 517429, "username": "Adeleine"}, {"user_id": 523866, "username": "UT"}]}]}
  },
  "Vibrava": {"sets": {"Specially Defensive Pivot": {}}},
  "Dusclops": {"sets": {"Bulky Attacker": {}, "Defensive Wall": {}}},
  "Metang": {"sets": {"Stealth Rock": {}, "Choice Band": {}}},
  "Gabite": {
    "sets": {
      "Stealth Rock": {
        "description": "<p>Thanks to its distinct typing, decent Speed tier, and bulk provided by Eviolite, Gabite functions as a good Stealth Rock setter and special wall in the NFE metagame, notably checking Electabuzz. Its typing and ability in Rough Skin help it soft check threats such as Raboot, deterring it from clicking U-turn and Flare Blitz freely. Earthquake is its best STAB move, hitting Electabuzz, Raboot, and Lampent. Toxic debilitates Defog users such as Vullaby, which Gabite cannot hit with Earthquake, as well as checks such as Tangela, Wartortle, and Thwackey. Finally, Roar chips down teams alongside Stealth Rock while forcing out Defog users and Gabite checks. Rest can be used in tandem with clerics such as Aromatherapy Hattrem and Clefairy to keep Gabite healthy. The EVs are optimized to increase Gabite's bulk while still reaching 231 Speed, outspeeding Timid Lampent without a Choice Scarf. 220 EVs on Special Defense prevent the 3HKO from Electabuzz's Focus Blast, 2HKO from Duosion's Future Sight, and 2HKO from Choice Specs Lampent's Shadow Ball. Gabite can also run some more offensive sets, such as Choice Band with Scale Shot to outspeed non-boosted foes. These sets might work with their surprise factor to overwhelm some common checks to the specially defensive set, such as Thwackey.</p> <p>Roselia and Electabuzz pair well with Gabite because they can check Shell Smash Wartortle, which can use Gabite as a setup fodder or 2HKO with Ice Beam. Roselia can also check both Tangela and Thwackey, which threaten Gabite with Knock Off and Grass-type attacks. Thwackey's Grassy Terrain also weakens Earthquake, so pairing Gabite with Thwackey is not ideal. Hattrem is also annoying, as it can take on Earthquake quite easily and can deny all of Gabite's utility moves, so pairing Gabite with a Dark-type Pokemon such as Vullaby or Galarian Linoone is recommended. Finally, Piloswine can pick off Gabite with Ice Shard or threaten to OHKO it with Icicle Crash. Having a check for Piloswine such as Hattrem, Gurdurr, or Galarian Corsola is mandatory.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 451786, "username": "Mirbro"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 543866, "username": "5Dots"}, {"user_id": 484270, "username": "hayedenn"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}]}
  },
  "Munchlax": {
    "sets": {
      "RestTalk": {
        "description": "<p>Munchlax is a wall for special attackers like Electabuzz and Hattrem, notably countering Lampent due to Thick Fat and its Ghost immunity. The problem with Munchlax is it's very passive and competes with other special walls, like Marshtomp and Vullaby, that have more relevant typings and utility. Munchlax's unique perks are spreading Body Slam paralysis and phazing with Whirlwind, as most teams lack room for these traits. Full EV investment for its defenses strengthens Munchlax's bulk, since its HP is already quite high.</p> <p>Duosion is another special wall that pairs well with Munchlax for its Fighting resistance, passive recovery, and Future Sight support to pair with Whirlwind. Entry hazard setters like Piloswine, Roselia, and Ferroseed also enjoy Whirlwind and use Munchlax as a pivot against specially offensive Fire-types. For Raboot, which has High Jump Kick for Munchlax, it is best to have Water-types like Wartortle and Mareaine. Fighting-type switch-ins like Galarian Corsola, Clefairy, and Koffing are also warranted to check Gurdurr. Knock Off absorbers such as Clefairy and Tangela help preserve Munchlax's Eviolite, and they can run Trick or Thief, respectively, to regain their items. Munchlax staying in on walls like Roselia and Vullaby to spread Body Slam paralysis can be worth it when it's paired with wallbreakers like Flame Body Gurdurr and Hex Gastly. Most physical wallbreakers such as Piloswine, Thwackey, and Lairon running Choice Band can threaten it. Thus, pairing Munchlax with physical walls such as Galarian Corsola, Tangela, and Clefairy can be helpful too.</p>"
      },
      "Curse": {}
    },
    "credits": {"writtenBy": [{"user_id": 231074, "username": "S1nn0hC0nfirm3d"}, {"user_id": 451786, "username": "Mirbro"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 226429, "username": "Jett"}, {"user_id": 543866, "username": "5Dots"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}]}
  },
  "Woobat": {"sets": {"Grassy Terrain Sweeper": {}}},
  "Drilbur": {
    "sets": {
      "Entry Hazard Lead": {
        "description": "<p>The combination of Stealth Rock and Rapid Spin with Mold Breaker allows Drilbur to set up Stealth Rock against Hattrem, the tier's premier Magic Bounce user. Focus Sash allows Drilbur to take a hit against faster foes and guarantee that Stealth Rock goes up before it faints. Toxic hits bulky Pokemon like Vullaby and Wartortle, as well as Ghost-types like Galarian Corsola that may attempt to spinblock against Drilbur; Galarian Corsola can also set up Stealth Rock itself after switching in.</p> <p>Drilbur pairs well with dual screens setters such as Electabuzz and Morgrem, as it can lead on hyper offense teams and set up Stealth Rock. Electabuzz, in particular, is able to set up screens and threaten the Vullaby or Wartortle that may want to remove Stealth Rock. Setup sweepers that appreciate support from screens such as Shell Smash Wartortle, Swords Dance Thwackey, and Bulk Up Raboot are good partners. Sticky Web hyper offense teams can also use Drilbur as their main lead. In these teams, both Charjabug and Cutiefly can set up Sticky Web. Moreover, naturally slow but bulky and offensively potent Pokemon like Machoke, Choice Band Piloswine, and Choice Specs Lampent can adequately take advantage of Sticky Web. Overall, hyper offensive teams built around Grassy Terrain can also benefit from Drilbur. Thwackey can set up the Grassy Terrain and then Pokemon such as Bulk Up Raboot, Swirlix, Woobat, and Thwackey itself can take advantage of it with Grassy Seed, boosting their defenses and Acrobatics damage in the case of both Raboot and Thwackey. Nonetheless, Drilbur has some issues in trying to get Stealth Rock up against fast Taunt users such as Electabuzz, Galarian Linoone, and Thwackey, with Electabuzz and Galarian Linoone switching out afterwards and Thwackey threatening it. Wartortle is the perfect counter to Drilbur, as it can deny Stealth Rock with Rapid Spin and break Focus Sash. Piloswine and Thwackey can also limit Drilbur's utility with their respective STAB attacks, though they need first to break Focus Sash. Pokemon such as Electabuzz can switch in against Wartortle and gain momentum. Shell Smash Wartortle and Bulk Up Raboot can also take advantage of Piloswine and Thwackey, respectively, using them as setup fodder.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 451786, "username": "Mirbro"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 484270, "username": "hayedenn"}, {"user_id": 543866, "username": "5Dots"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}]}]}
  },
  "Gurdurr": {
    "sets": {
      "Bulk Up": {
        "description": "<p>Bulk Up enhances Gurdurr's already solid offensive capabilities and allows it to function as a mid- to late-game sweeper, with Drain Punch keeping Gurdurr healthy and allowing it to garner boosts against physical attackers like Raboot and Piloswine. Knock Off is Gurdurr's best coverage move, hitting Fighting-resistant Pokemon like Galarian Corsola and Hattrem for massive damage while also making it easier to break through other Pokemon like Clefairy and Mareanie by removing their Eviolite. Mach Punch rounds off the set, helping to take out weakened faster attackers like Electabuzz and Rufflet. Ice Punch can be used over either of the last two moves, reducing Gurdurr's offensive utility but in turn giving it a way to more immediately damage Roselia and still hit neutral targets for respectable damage. The Speed investment allows Gurdurr to outpace uninvested Piloswine and Hattrem, although this can be invested into bulk if preferred.</p> <p>Gurdurr can struggle to get past physically defensive walls like Tangela, Clefairy, and Galarian Corsola; other physical attackers like Galarian Linoone, Raboot, and Piloswine can assist in breaking down these shared answers while the latter two also greatly benefit from Gurdurr removing foe's items. Similarly, special attackers like Roselia and Duosion can increase Gurdurr's breaking potential with Spikes and Future Sight support, respectively, and can switch into the aforementioned walls with ease. Hattrem is also a notable teammate, as it can wall Mareanie and prevent Galarian Corsola from healing with Strength Sap.</p>"
      },
      "Defog": {
        "description": "<p>As a Defog user, Gurdurr has a solid matchup against common entry hazard setters like Piloswine and Ferroseed. It also finds opportunities to Defog as a bulky offensive threat, forcing out physical attackers unable to trade hits with it like Raboot and Galarian Linoone. Knock Off further increases its utility by crippling switch-ins. Toxic shores up Gurdurr's otherwise poor matchup into Galarian Corsola, but Ice Punch and High Horsepower are alternatives that help against Poison-type entry hazard setters in Roselia, Koffing, and Mareanie. The defensive investment allows Gurdurr to take two hits from Choice Band Raboot's High Jump Kick after Stealth Rock while also avoiding a 3HKO from Piloswine and other variants of Raboot, with the rest invested into Attack to increase Gurdurr's damage output.</p> <p>Gurdurr's best teammates will vary depending on the fourth slot chosen; when using Toxic, Gurdurr will have a difficult time against the aforementioned Poison-types, so Pokemon that can pressure these or use them as setup fodder like Lampent, Ferroseed, and Duosion are fantastic partners. On the other hand, Pokemon that can assist in pressuring Galarian Corsola like Hattrem and Roselia are very desirable when foregoing Toxic, with the latter in particular being useful for absorbing Toxic Spikes, which Gurdurr has a difficult time clearing.</p>"
      },
      "Flame Orb": {
        "description": "<p>Guts-boosted Gurdurr is a force to be reckoned with; it trades Eviolite and Drain Punch for the power and coverage of Close Combat and Facade, allowing it to 2HKO physically defensive walls like Clefairy, Mareanie, and Slowpoke with ease. Mach Punch rounds off the set by finishing off weakened faster attackers like Raboot and Electabuzz. Unfortunately, Gurdurr still struggles to break through certain physically defensive walls like Tangela and Koffing, and without Eviolite, Gurdurr becomes much more vulnerable to faster Pokemon like Electabuzz and Raboot.</p> <p>Charjabug is an excellent teammate for providing Gurdurr with Sticky Web support, slowing down wallbreakers like Lampent that would otherwise force Gurdurr out and using a slow Volt Switch to bring Gurdurr in safely and activate its Flame Orb. Other slow pivots like Slowpoke and Clefairy similarly are very useful and further support Gurdurr with moves like Future Sight, Thunder Wave, and Healing Wish to augment its offensive potential. Offensive pivots are similarly useful, with Electabuzz luring in specially defensive Pokemon like Duosion for Gurdurr to burst through and Thwackey providing passive recovery with Grassy Terrain and benefitting from Gurdurr breaking down shared checks like Roselia and Koffing.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 231074, "username": "S1nn0hC0nfirm3d"}, {"user_id": 407249, "username": "Greybaum"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 407249, "username": "Greybaum"}, {"user_id": 355753, "username": "Eris"}, {"user_id": 451786, "username": "Mirbro"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}]}
  },
  "Palpitoad": {
    "comments": "<h3>Other Options</h3> <p>With Sludge Bomb, 100 Special Attack EVs could be opted instead to guarantee a 2HKO on Tanglea after Stealth Rock damage. RestTalk sets offer recovery so that Palpitoad can wall throughout the game; they tend to be less worthwhile as Palpitoad sacrifices two vallauble supportive moves for this recovery. Specially defensive spreads are able to wall Electabuzz more consistently.</p> <h3>Checks and Counters</h3> <p><strong>Grass-types</strong>: Any offensive Grass-type like Tangela, Thwackey, and Roselia can outspeed and OHKO Palpioad. Furthermore, they make for good switch-ins agaianst it, with Roselia especially being unfazed by its status attempts.</p> <p><strong>Setup Sweepers</strong>: Rufflet, Gurdurr, Duosion, and Clefairy are examples of sweepers that are bulky enough to setup and break Palpitoad, and have work arounds or immunities to Toxic. Lampent has potential coverage in Energy Ball to targets Palpitoad as well.</p> <p><strong>Magic Bounce</strong>: Hattrem prevents Palpitoad from setting up Stealth Rock, and may even opt for Giga Drain to be immensely threatening to Palpitoad.</p> <p><strong>Residual Damage</strong>: Palpitoad lacks reliable recovery, and will be worn down from status, U-turn, and Knock Off. Attackers like Electabuzz and Raboot have a decent chance of sweeping by wearing down Palpitoad.</p>",
    "sets": {
      "Stealth Rock": {
        "description": "<p>Palpitoad's well-rounded stats and great Water / Ground typing help it fit on teams as a viable physical wall. It can set up Stealth Rock early-game and threaten other entry hazard users like Piloswine and Koffing with its STAB attacks. Earth Power can nail common physical attackers like Klang and Raboot that Palpitoad has no problem switching into. Scald has a chance to burn physical attackers like Thwackey and Fraxure that may switch in on Palpitoad and can also wear down defensive Pokemon that lack recovery like Hattrem and Charjabug. On the other hand, Sludge Bomb nails Grass-types like Tangela and Thwackey; the latter otherwise could Substitute safely on Palpitoad. Toxic is great for crippling walls that shrug off Palpitoad's attacks like Galarian Corsola and Togetic.</p> <p>Palpitoad is a good check to some physical attackers, but its lack of recovery and immediate firepower makes it vulnerable to multiple foes. Palpitoad should avoid setting up Stealth Rock if Magic Bounce users are on the opposing team, as Hattrem especially can shrug off Palpitoad's attacks and threatens back with Giga Drain. Try pairing it with Dark- and Steel-types like Galarian Linoone and Klang to help with these situations. Palpitoad also struggles against other entry hazard setters like Ferroseed and Roselia, so having anti-entry hazard Pokemon like Hattrem and Vullaby is worthwhile. Additionally, being 4x weak to Grass-type attacks is dangerous, which walls like Ferroseed, Roselia, Vullaby, and Charjabug can all help patch; in return, Palpitoad functions as a Fire-type switch-in for these three. As Palpitoad worries about strong special wallbreakers like Abra, special walls like Galarian Corsola and Klang can help make a defensive backbone for the rest of the team. Palpitoad is also susceptible to being worn down from status, Knock Off, and multiple physical attacks. Try to either have other physical walls with reliable recovery and support with Wish and Heal Bell from users like Clefairy.</p>"
      },
      "Special Wall": {}
    },
    "credits": {"writtenBy": [{"user_id": 231074, "username": "S1nn0hC0nfirm3d"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 226429, "username": "Jett"}, {"user_id": 355753, "username": "Eris"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "Lumari"}]}]}
  },
  "Krokorok": {
    "comments": "<h3>Other Options</h3> <p>Krokorok can also carry Toxic on its sets to better wear down switch-ins like Tangela and Gurdurr.</p> <h3>Checks and Counters</h3> <p><strong>Gurdurr</strong>: Gurdurr counters both Krokorok set by being able to switch in repeatedly and OHKOing it with STAB attacks. Furthermore, Gurdurr can remove Stealth Rock through Defog.</p> <p><strong>Grass-types</strong>: Thwackey and Tangela have no trouble switching into Krokorok and OHKOing it with their STAB attacks.</p> <p><strong>Physical Walls</strong>: Clefairy, Machoke, and Charjabug can usually switch into Krokorok multiple times and block its progress.</p> <p><strong>Special Wallbreakers</strong>: Lead Krokorok relies on Intimidate and its moderate Speed to secure Stealth Rock, so faster special attackers like Focus Blast Electabuzz, fast Tangela, and Lampent can take it out. However, none can switch into Krokorok and greatly fear the Choice Scarf set.</p> <p><strong>Revenge Killers</strong>: Pokemon like Choice Scarf Raboot and Shell Smash Wartortle are able to revenge kill Krokorok with strong coverage.</p>",
    "sets": {
      "KrokoRocks (Stealth Rock Lead)": {
        "description": "<p>Krokorok provides Stealth Rock and early momentum as a lead. Hattrem is ineffective as a form of entry hazard prevention due to it fearing a STAB Knock Off, while Taunt targets Defog users like Vullaby and Togetic. Taunt also prevents opposing entry hazards such as Stealth Rock from Galarian Corsola and Piloswine, Sticky Web from Charjabug, Toxic Spikes from Koffing, and Spikes from Ferroseed. Intimidate along with Krokorok's defensive investment allows it to survive an attack followed by priority when up against Piloswine and Machoke. The remaining Speed investment and a Jolly nature let Krokorok outspeed Modest Roselia along with other slower attackers like Lampent and Marshtomp.</p> <p>Use Krokorok as a lead and supplement it with offensive teammates that preserve the momentum it gains early-game. Sweepers like Thwackey and Lampent appreciate Stealth Rock pressuring Vullaby, as well as Knock Off both weakening Marshtomp, Piloswine, and Galarian Corsola. Roselia is particularly potent as a partner, not only for providing additional entry hazard pressure with Spikes, but also for checking threats to Krokorok like Thwackey, Tangela, Wartortle. Faster attackers like Raboot and Thwackey revenge kill Krokorok and are immune to entry hazard damage with Magic Guard and Heavy-Duty Boots, respectively. It is best then to pair Krokorok with cleaners like Klang, Wartortle, and Fraxure to deal with them, as well as forms of speed control such as Hattrem and Charjabug. To help preserve Krokorok, pick teammates that resist Ice or are immune to Fighting like Klang, Galarian Corsola, and Lampent; the two Ghost-types are additionally compatible as spinblockers.</p>"
      },
      "Choice Scarf": {
        "description": "<p>Krokorok differentiates itself from other offensive Ground-types like Piloswine by being the only one with enough Speed to outspeed the entire unboosted metagame with Choice Scarf. It's a good revenge killer and lead on offensive teams that checks Raboot, Electabuzz, and Metang with Earthquake and sets up Stealth Rock when they switch out. Knock Off removes Eviolite from Earthquake switch-ins like Tangela, Clefairy, and Gurdurr. Stone Edge hits Flying-type and Defog users like Vullaby, Rufflet, and Togetic, which usually can sustain Knock Off.</p> <p>Choice Scarf Krokorok can fulfill different roles depending on what is needed, whether it is to sweep, revenge kill, or set entry hazards. Krokorok will, however, find itself commonly forced out by locking itself in the wrong move or by being unable to get through common physical walls like Tangela and Gurdurr, making special wallbreakers such as Electabuzz, Roselia, and Lampent great partners. Krokorok is also quite frail, making pivots like Thwackey and Electabuzz great partners, and they can also force out Water-types like Wartortle and encourage Steel-types like Klang or Metang to switch in. These partners are also checked by Grass-types, so having Flying- and Fire-types like Vullaby, Raboot, and Lampent is greatly appreciated. Krokorok is also greatly pressured by priority users like Piloswine, making physically defensive walls like Tangela, Machoke, and Galarian Corsola pivotal.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 231074, "username": "S1nn0hC0nfirm3d"}, {"user_id": 355753, "username": "Eris"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 355753, "username": "Eris"}, {"user_id": 468904, "username": "SBPC"}, {"user_id": 226429, "username": "Jett"}, {"user_id": 231074, "username": "S1nn0hC0nfirm3d"}]}, {"name": "Grammar checked by", "members": [{"user_id": 331519, "username": "CryoGyro"}]}]}
  },
  "Dwebble": {
    "comments": "<h3>Other Options</h3> <p>Rock Tomb over Stone Edge with a Jolly nature is beneficial for getting an edge against faster Taunt users like Electabuzz and Galarian Linoone, as Dwebble chips them down and outspeeds afterwards, but it comes at the cost of losing a strong STAB attack. Weak Armor with Focus Sash provides more Speed so that Dwebble has a better matchup against some leads like Electabuzz and Raboot, but the lack of an Eviolite combined with the Defense drop makes Dwebble less reliable for setting entry hazards against Pokemon like Clefairy and Piloswine.</p> <h3>Checks and Counters</h3> <p><strong>Gurdurr</strong>: By resisting both of Dwebble's attacks, using Defog to clear entry hazards, and stopping Shell Smash sweeps with Mach Punch, Gurdurr is a consistent counter to Dwebble. Dwebble's best bet is to be paired with sweepers that require Gurdurr's Eviolite removed to sweep, or else it will be squandered versus it.</p> <p><strong>Special Attackers</strong>: Dwebble's special bulk is unsalvageable, and practically any offensive special attacker can 2HKO it.</p> <p><strong>Water-types</strong>: Wartortle stomachs Dwebble's attacks while hitting back hard, and after Sturdy activates, it uses Rapid Spin to remove any entry hazards. Mareanie and Marshtomp threaten with Scald, but they may lose their Eviolite in the process.</p> <p><strong>Bulky Leads</strong>: Bulkier Pokemon like Tangela and Gabite are able to take on Dwebble, although they could be annoyed by Knock Off and are unable to prevent Dwebble's first entry hazard attempt. Piloswine and Thwackey apply here as well, and they also have strong priority to punish Shell Smash.</p>",
    "sets": {
      "Entry Hazard Setter": {
        "description": "<p>Dwebble can set entry hazards and apply pressure against Defog users and Magic Bounce Pokemon, namely Vullaby and Hattrem. It can set both Stealth Rock and Spikes for early-game pressure against other common leads like Piloswine, Clefairy, and Charjabug. Shell Smash gives Dwebble an opportunity to put a large dent into the opposing team while outspeeding faster special attackers like Electabuzz and Gastly.</p> <p>Use Dwebble as a lead to set entry hazards immediately or boost with Shell Smash for early momentum. Entry hazards are usually more worthwhile when Dwebble faces Electabuzz, as its strong Volt Switch into a priority user like Gurdurr or Thwackey would invalidate its wallbreaking attempts. Spinblockers like Drakloak and Lampent are good teammates for Dwebble, since they can prevent its entry hazards from being removed, while Pokemon like Electabuzz and Piloswine pressure Defog users. Setup sweepers like Klang and Fraxure appreciate the chip damage to wear down their checks. Other offensive Pokemon such as Raboot and Thwackey pair well with Dwebble, since they can provide momentum after entry hazards have been set down, while Dwebble can weaken walls such as Galarian Corsola, Tangela, and Ferroseed.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 418753, "username": "pazza"}, {"user_id": 231074, "username": "S1nn0hC0nfirm3d"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 231074, "username": "S1nn0hC0nfirm3d"}, {"user_id": 355753, "username": "Eris"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}]}]}
  },
  "Gothorita": {"sets": {"Nasty Plot": {}}},
  "Duosion": {
    "comments": "<h3>Other Options</h3> <p>Duosion can utilize an offensive Trick Room set to sweep weakened teams, but it still struggles with its limited coverage. Setup sets can forgo Acid Armor for Thunder or Toxic, allowing Duosion to break through Dark-types like Vullaby, but this leaves it very vulnerable to physical wallbreakers. Thunder Wave can also be used on its Future Sight set to cripple faster threats such as Wartortle and Raboot.</p> <h3>Checks and Counters</h3> <p><strong>Dark-types</strong>: Dark-types counter Duosion with their Psychic immunity and punish it with Knock Off. However, Choice Scarf Krokorok can be outstalled if Duosion has a prior opportunity to boost, and Dark-types must be wary of switching into Toxic from Future Sight Duosion.</p> <p><strong>Special Wallbreakers</strong>: Strong Pokemon like Choice Specs Lampent and Electabuzz can switch into Duosion and threaten it before it has a chance to raise its Special Defense enough to outstall them.</p> <p><strong>Stallbreakers</strong>: Trick and Switcheroo users like Lampent and Gastly completely shut down Duosion's sweeping attempts. The same can be said to a lesser extent for Taunt and Encore users like Galarian Linoone and Electabuzz.</p> <p><strong>Phazers</strong>: Haze Mareanie and Roar Gabite are examples of phazers that stop Duosion from sweeping, but they have to worry about Psyshock or letting Duosion set up too much.</p>",
    "sets": {
      "Defensive Sweeper": {
        "description": "<p>Due to its boosting options in Acid Armor and Calm Mind, its ability Magic Guard, and access to Recover, Duosion is a great defensive sweeper. These attributes make Toxic users and non-setup attackers like Clefairy, Piloswine, and Raboot unable to break boosted Duosion, while it breaks walls like Galarian Corsola, Klang, and Ferroseed after enough setup to make Stored Power a nuke. Unfortunately, Duosion's only coverage here is Psychic-typed, meaning any Dark-type like Vullaby and Galarian Linoone completely walls it. Psyshock over Stored Power is an option to threaten certain targets like Mareanie and Roselia with less setup required, and also beats opposing Duosion that lack it, but has notably less potential power-wise.</p> <p>As a win condition, Duosion should only be sent out to set up late-game when its checks are eliminated. Dark-types like Galarian Linoone, Vullaby, and Morgrem pose as counters due to their Psychic-type immunity, and should be dispatched by offensive attackers like Gurdurr, Raboot, and Thwackey. Alternatively, Duosion stalls out weaker Dark-types with the support of Toxic and Toxic Spikes teammates like Mareanie and Roselia. Wallbreakers and offensive setup sweepers such as Lampent, Fraxure, and Thwackey have en edge by breaking or out-boosting Duosion. Support from defensive teammates such as Piloswine, Ferroseed, and Tangela is appreciated for checking these threats, and they appreciate Duosion dealing with Koffing and Gloom. Duosion’s setup attempts are stopped by faster Taunt and Encore users such as Galarian Linoone, Vullaby, and Clefairy; use these occurrences as an opportunity to safely bring in offensive teammates like Machoke, Electabuzz, and Lampent.</p>"
      },
      "Future Sight": {
        "description": "<p>With Regenerator and boasting the highest Special Attack stat in the metagame, Duosion acts as a great defensive pivot and one of the better users of Future Sight. Future Sight is a potent attack that limits switch-ins, while Psychic offers upfront damage to pressure Roselia, Gurdurr, and Tangela. Toxic wears down Dark-types and specially defensive walls like Galarian Corsola, which are expecting to check Double Dance Duosion. Thunder, on the other hand, specifically targets Vullaby and Galarian Linoone for immediate damage. Magic Guard is an alternative to Regenerator that provides Duosion with an immunity to residual damage, but the passive recovery is normally preferred for defensive purposes. Max Special Defense lets it wall common threats such as Electabuzz and Wartortle.</p> <p>Duosion should switch into weak attacks from passive Pokemon such as Clefairy and Marshtomp in order to heal itself and use Future Sight. Duosion works best when paired with Pokemon that can take advantage of Future Sight threatening out their would-be checks, like Gurdurr, Machoke, Thwackey, and Raboot. Fighting-types also have the added benefit of being able to switch into Galarian Linoone, Klang, and Ferroseed, which do not mind Duosion's Future Sight, while their checks like Galarian Corsola, Clefairy, Koffing, and Tangela cannot afford to switch into them due to the threat of Future Sight. Dark-types like Vullaby and Galarian Linoone help to keep Ghost- and Psychic-types such as Lampent, Gastly, and Hattrem in check, which can threaten Duosion or switch into Future Sight respectively. Vullaby and Galarian Linoone can also remove Eviolites, making Duosion's Future Sight more punishing to switch into. Since Duosion can use Future Sight to not only limit but force switch-ins, entry hazard setters such as Ferroseed, Piloswine, and Mareanie make for great partners, with the latter's Toxic Spikes' poison spreading much quicker. Pokemon like Thwackey and Combusken can clean much easier with the help of Duosion's ability to wear down multiple Pokemon throughout a game.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 231074, "username": "S1nn0hC0nfirm3d"}, {"user_id": 226429, "username": "Jett"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 407249, "username": "Greybaum"}, {"user_id": 355753, "username": "Eris"}, {"user_id": 231074, "username": "S1nn0hC0nfirm3d"}]}, {"name": "Grammar checked by", "members": [{"user_id": 229690, "username": "queez"}, {"user_id": 449990, "username": "DC"}]}]}
  },
  "Ferroseed": {
    "comments": "<h3>Other Options</h3> <p>Ferroseed can use Thunder Wave to cripple faster threats, but Toxic is often more punishing. Ferroseed can also use Rest to regain health, but must be paired with Aromatherapy users like Hattrem and Clefairy to do so.</p> <h3>Checks and Counters</h3> <p><strong>Fire-types</strong>: Ferroseed's huge weakness to Fire means that it goes down easily to attackers like Raboot and Lampent, although neither appreciate switching into Knock Off.</p> <p><strong>Wallbreakers</strong>: Physical attackers like Fraxure and Thwackey can muscle through Ferroseed, and the likes of Gurdurr and Machoke can switch in relatively easily.</p> <p><strong>Residual Damage</strong>: Leech Seed is Ferroseed's best recovery, making it unable to recover in the face of Hattrem or Grass-types, and it becomes vulnerable to being chipped down and unable to check special attackers in the long run.</p>",
    "sets": {
      "Specially Defensive": {
        "description": "<p>Ferroseed makes for an amazing special wall thanks to its high natural bulk and solid defensive typing. Knock Off can be used to remove items, most notably Eviolite, from common switch-ins like Gurdurr, Hattrem, and Lampent. Bullet Seed is Ferroseed's primary attacking move, as it allows Ferroseed to beat out Shell Smash Wartortle while also doing damage to other Water-types like Marshtomp. Alternatively, Gyro Ball lets it deal consistent damage to faster targets such as Thwackey and Galarian Linoone, and Toxic can be used to threaten bulky walls like Galarian Corsola and Vullaby. Leech Seed gives Ferroseed some longevity while also chipping away at the health of aforementioned switchins like Gurdurr. 0 Speed IVs and a Sassy nature should be used when running Gyro Ball to maximize its damage output.</p> <p>Galarian Corsola and Marshtomp are excellent defensive partners, covering Ferroseed’s Fighting- and Fire-type weaknesses respectively. They can also run Stealth Rock, forming a strong hazard core with Ferroseed, with Galarian Corsola also being able to act as a spinblocker. Vullaby and Lampent are both able to deal with Hattrem, which allows Ferroseed to freely set up entry hazards. Ferroseed should avoid trying to set up hazards until opposing hazard control, notably Gurdurr and Hattrem, has been removed and should instead use Leech Seed or Knock Off to cripple them. Wallbreakers such as Lampent and Fraxure benefit greatly from Ferroseed's hazards and their utility in wearing down opposing Pokemon. Ferroseed is susceptible to being worn down due to a lack of reliable recovery, so teammates like Piloswine and Electabuzz are valuable in checking special attackers once Ferroseed is weakened.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 226429, "username": "Jett"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 468904, "username": "SBPC"}, {"user_id": 231074, "username": "S1nn0hC0nfirm3d"}]}, {"name": "Grammar checked by", "members": [{"user_id": 241023, "username": "dhelmise"}]}]}
  },
  "Klang": {
    "comments": "<h3>Other Options</h3> <p>Toxic works well on defenisve sets over Gear Grind as a means to threaten Fire-types and walls like Marshtomp and Tangela, but it becomes much less threatening to the Psychic-types its meant to check. Additional utility options on sweeping sets are Iron Defense and Magnet Rise, which allows Klang to setup on offensive targets like Thwackey and Piloswine at the cost of coverage. Choice Specs can be used to break down physically defensive Pokemon Klang lures like Tangela but is often reliant on Steel Beam to do damage and suffers defensively from not being able to frequently switch into Psychic-types like Hattrem and Duosion.</p> <h3>Checks and Counters</h3> <p><strong>Fire-types</strong>: By resisting Klang's STAB attacks, Raboot, Combusken, Lampent, and Torracat are great switch-ins and revenge killers to Klang.</p> <p><strong>Steel-types</strong>: Klang has ineffective for opposing Steel-types, with Earthquake Metang and Iron Barbs Ferroseed concerning it the most.</p> <p><strong>Water-types</strong>: Klang usually cannot sweep against Marshtomp and Mareanie, although offensive variants of Klang can pressure standard Mareanie with a boosted Wild Charge.</p> <p><strong>Physical Walls</strong>: Many of the meta's physically defensive Pokemon like Galarian Corsola, Gabite, Gurdurr, and Machoke can take on Klang with their bulk, although the rare Choice Specs Klang can dent them.</p>",
    "sets": {
      "Sleepy Gears": {
        "description": "<p>By virtue of its solid pure Steel typing that grants it a useful resistance to Stealth Rock and Psychic- and Grass-type moves, Klang is able to run a specially defensive set that turns it into a very sturdy switch-in to some of NFE's top special attackers, including Roselia, Hattrem, and Duosion. The combination of Rest and Sleep Talk gives Klang much-needed longevity to sponge hits from them, as well as the ability to ignore burns from Galarian Corsola. The last move will usually be Shift Gear, which allows Klang to sweep unprepared teams if given an opportunity to set up, as well as exploiting the lack of Steel-resistant Pokemon in the tier. Otherwise, Volt Switch is a great option to increase Klang's defensive utility by generating momentum. The EV spread allows Klang to outspeed Electabuzz after a single Shift Gear boost, although this should instead be invested into Special Defense when running Volt Switch.</p> <p>Klang fits on all kinds of teams as one of the best switch-ins to common special attackers like Roselia, Hattrem, and Duosion. Shift Gear is best kept for late-game after walls like Galarian Corsola and Machoke have been dealt with, or to force out walls like non-Leech Seed Tangela. A premier partner for Klang is Gurdurr, because many of its checks - particularly, Clefairy, Tangela, and Koffing - are walled by Klang. All of these Pokemon also form a great core with Klang because they can take Fighting-type attacks for Klang. Grass-types like Thwackey and Roselia make good partners for Volt Switch Klang to target Piloswine and Marshtomp so that it may pivot freely.</p>"
      },
      "Offensive Shift Gear": {
        "description": "<p>Maximizing its Attack stat, Klang turns Gear Grind into a powerful STAB attack that will dent anything that doesn't resist it, especially after a Shift Gear boost, with the exception of defensive walls like Galarian Corsola, physically defensive Machoke, Ferroseed, and Marshtomp. Wild Charge is mainly necessary to dispose of opposing Mareanie, as well as hitting Steel-resistant threats such as Wartortle, Lampent, and Raboot. Substitute is Klang's best way of breaking past Galarian Corsola by blocking incoming Will-O-Wisps and Strength Saps, although it can opt for Volt Switch to weaken the likes of Raboot and Gurdurr and generate momentum instead. A spread of 136 Speed and 120 HP EVs is ran to better take hits from special attackers like Roselia and Duosion.</p> <p>Klang still has some trouble taking repeated hits; therefore, it fits onto more aggressive teams that can make use of its unparalleled sweeping capabilities. Klang is strong, but not enough to take out most of the metagame with only one boost. For that reason, it greatly appreciates all forms of residual damage. Entry hazards are excellent support for Klang; Spikes support from Roselia and Ferroseed greatly increases Klang's chances of sweeping by notably whittling the HP of opposing Lampent and Electabuzz down. Excellent partners for Klang also include Knock Off users such as Tangela and Mareanie, which remove the Eviolite from Fighting-types as well as Galarian Corsola, rendering them all more susceptible to being swept by a boosted Klang.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 286018, "username": "Ktütverde"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 226429, "username": "Jett"}, {"user_id": 231074, "username": "S1nn0hC0nfirm3d"}]}, {"name": "Grammar checked by", "members": [{"user_id": 241023, "username": "dhelmise"}]}]}
  },
  "Lampent": {
    "comments": "<h3>Other Options</h3> <p>For more immediate power, Lampent can opt for a Choice Specs set, which lets it 2HKO special walls such as Clefairy and Wartortle after their Eviolite has been removed, although it is at the cost of being very easy to revenge kill. Psychic allows Lampent to 2HKO Gurdurr and Mareanie after a Calm Mind boost or if holding a Choice Specs. Will-O-Wisp is a niche option to cripple physical attackers such as Vullaby and Marshtomp, which may try to switch in on it.</p> <h3>Checks and Counters</h3> <p><strong>Ground-types</strong>: Many Ground-types have favorable match ups against Lampent, with Gabite and Krokorok outspeeding non-Choice Scarf variants and Marshtomp and Piloswine being bulky enough to withstand an attack and OHKO it in return.</p> <p><strong>Water-types</strong>: Bulky Water-types like Mareanie, Wartortle, and Marshtomp threaten Lampent with their STAB attacks or Haze, preventing it from sweeping them. They have to watch out for Psychic or Energy Ball, though.</p> <p><strong>Dark-types and Knock Off</strong>: Vullaby and Galarian Linoone can switch into any of Lampent's attacks and force it out. Powerful attackers such as Thwackey are able to revenge kill non-Choice Scarf variants of Lampent with Knock Off.</p> <p><strong>Normal-type Walls</strong>: While these examples are niche, it should be noted that Trace Porygon and Munchlax hard counter Lampent, although they all dislike switching into Trick.</p>",
    "sets": {
      "Choice Scarf": {
        "description": "<p>With a Choice Scarf, Lampent outspeeds the entire unboosted metagame and generates offensive pressure with the help of its unresisted STAB combination. Lampent's unique typing makes it difficult for many priority users to revenge kill it, as it is immune to Gurdurr's Mach Punch and resists Thwackey's Grassy Glide and Piloswine's Ice Shard. Trick cripples common defensive switch-ins like Mareanie and Clefairy, which Lampent cannot break past with attacks alone. Calm Mind lets Lampent function as a potent setup sweeper once it has given away its Choice Scarf. Energy Ball, which hits Marshtomp and Wartortle, and the more accurate Fire-type STAB move Flamethrower are also valid alternatives in the last slot.</p> <p>As a Choice Scarf user, Lampent should look to offensively check fast Pokemon such as Abra and Thwackey, and it should be primarily used for late-game cleaning and revenge killing purposes. Trick can cripple walls like Mareanie and Clefairy after the fast foes have been removed. Lampent should be paired with a Rapid Spin or Defogger such as Vullaby, Wartortle, or Gurdurr to overcome its weakness to entry hazards. Slow pivots like Clefairy, Slowpoke, and the aforementioned Wartortle help to bring Lampent in safely and have the added benefit of being able to cover for its Dark- and Water-type weaknesses. Knock Off support from Tangela, Vullaby, and Ferroseed, as well as entry hazard users like Metang and Roselia, help to weaken opposing Pokemon into Lampent's KO range. Offensive partners like Choice Band Thwackey and Raboot keep walls at low health, giving Lampent a better chance at cleaning weakened teams.</p>"
      },
      "Substitute + Calm Mind": {
        "description": "<p>Lampent is a powerful wallbreaker in the NFE metagame thanks to its great offensive typing and high Special Attack stat. Calm Mind is used to boost Lampent's Special Attack, making it a threat against passive teams. At +1 Lampent can 2HKO threats like Machoke and Piloswine amongst others. Flamethrower is used to take down Grass-, Steel-, and Bug-types such as Thwackey, Tangela, Ferroseed, and Charjabug. Shadow Ball is used against Ghost- and Psychic-types, namely Galarian Corsola, Hattrem, and Abra. With Substitute, Lampent can easily set up against Pokemon that can't damage it, particularly Raboot, Klang, and defensive Pokemon like Charjabug and Roselia, allowing it to set up for free or KO aforementioned Pokemon. Eviolite is the preferred item, as it enables Lampent's Substitute to stay up, while Heavy-Duty Boots allow it to reliably get on the field without taking chip from entry hazards. 252 Speed EVs allow Lampent to outspeed slower targets like Gurdurr, Piloswine, and Tangela. Timid, however, should always be used when paired with Sticky Web, as it allows Lampent to outspeed the entire unboosted metagame.</p> <p>Lampent struggles against Dark-types like Vullaby and Galarian Linoone, which can easily switch in and force it out with Knock Off. Gurdurr, Machoke, and Charjabug are great partners, since they can deal with Dark-types and absorb Knock Off, while the former two can provide Knock Off support and Charjabug can set Sticky Web, making it easier for Lampent to sweep offensive teams. In return, Lampent can deal with Fire-types such as Raboot for Charjabug and can weaken walls, namely Tangela and Galarian Corsola for Gurdurr and Machoke. Lampent appreciates pivot support from Pokemon like Wartortle and Thwackey, as they can easily let Lampent in while also checking faster attackers like Raboot and Krokorok. If Lampent is not running Heavy-Duty Boots, then Defog and Rapid Spin users like Vullaby, Gurdurr, and Wartortle are greatly appreciated to circumvent Lampent's Stealth Rock weakness.</p>"
      },
      "Choice Specs": {}
    },
    "credits": {"writtenBy": [{"user_id": 226429, "username": "Jett"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 226429, "username": "Jett"}, {"user_id": 355753, "username": "Eris"}, {"user_id": 231074, "username": "S1nn0hC0nfirm3d"}]}, {"name": "Grammar checked by", "members": [{"user_id": 297659, "username": "deetah"}, {"user_id": 449990, "username": "DC"}]}]}
  },
  "Fraxure": {
    "comments": "<h3>Other Options</h3> <p>Taunt and Substitute are options that setup sets may want to entertain as options to break past walls like Galarian Corsola, Marshtomp, and Mareanie by avoiding status conditions. However, this comes at the cost of lacking coverage, and would allow more defensive targets to check Fraxure.</p> <h3>Checks and Counters</h3> <p><strong>Revenge Killers</strong>: Either Fraxure set will have the issues with its vulnerbility to faster Pokemon like Raboot and Electabuzz, although setup sets are able to boost past them. It should also watch out for strong priority users like Piloswine if it's worn down.</p> <p><strong>Physical Walls</strong>: Galarian Corsola, Koffing, and Machoke survive boosted hits from Fraxure and threaten it back with status conditions or confusion. Other walls like Clefairy and Metang are situational switch-ins depending on its coverage or what it's Choice-locked into.</p> <p><strong>Residual Damage</strong>: Fraxure is vulnerable to entry hazards and status conditions, meaning it could either be punished or unable to setup if it's too worn down.</p>",
    "sets": {
      "Choice Band": {
        "description": "<p>Fraxure is an incredible wallbreaker in the NFE metagame thanks to its high Attack stat and above average Speed, allowing it to outspeed other wallbreakers like Rufflet, Roselia, and Lampent. Outrage is Fraxure's strongest STAB attack, allowing it to 2HKO physical walls such as Galarian Corsola and physically defensive Machoke, while Dragon Claw is used to put switch-ins in range of Outrage without getting locked in. Superpower is used to hit Steel-types that resist Fraxure's STAB attacks like Ferroseed and Klang, while Stomping Tantrum is also an option that allows Fraxure to hit Metang and Klang without lowering its stats. First Impression is Fraxure's only priority move and is used to revenge kill threats, most notably Abra and Thwackey.</p> <p>Choice Band Fraxure functions best early- to mid-game by punching holes through the opponent's team. Outrage is Fraxure's strongest attack and usually its go-to move when Fairy-types are removed and Steel-types in are in range; therefore, it is encouraged to pair Fraxure with wallbreakers that can deal with these Pokemon, such as Roselia, Piloswine, and Raboot. Fraxure also benefits from entry hazard setters like Clefairy, Roselia, and Ferroseed, as they can put threats in range of being KOed. Fraxure can be revenge killed by Piloswine and faster attackers like Raboot and Electabuzz, so walls such as Galarian Corsola and Klang are good partners. Knock Off users like Tangela, Thwackey, and Vullaby are also good partners, as they can remove Eviolite from threats and put them in range for Fraxure to KO. They can also function as pivots, allowing Fraxure in safely.</p>"
      },
      "Setup": {
        "description": "<p>Fraxure can boost itself through Dragon Dance or Swords Dance in order to act as sweeper or wallbreaker. Swords Dance enables Fraxure to break through walls like Galarian Corsola and Tangela, while Dragon Dance allows Fraxure to outspeed the entire unboosted metagame. Outrage is Fraxure's main attack and strongest STAB move, allowing it to hit a large portion of the metagame, most notably Gurdurr, Mareanie, and Vullaby. Superpower enables Fraxure to OHKO Steel-types that otherwise easily sponge Outrage, like Ferroseed at +2. Stomping Tantrum can also be an option to hit Steel- and Fire-types like Metang, Klang, and Carkol without risking a Defense drop. Poison Jab is Fraxure's most reliable attack against Fairy-types like Clefairy and Togetic, which are immune to Outrage. Scale Shot allows Fraxure to break Focus Sash users like Abra while boosting its Speed, allowing it to outspeed the entire unboosted metagame.</p> <p>This Fraxure set functions best mid- to late-game where it can more easily set up and revenge kill threats that are in range. If Fraxure wants to clean with Dragon Dance, it should avoid spamming Outrage when Fairy- and Steel-types are still active and healthy, as they can easily end its sweep. Pokemon like Roselia and Gurdurr are great partners, as they can threaten these types respectively. Other wallbreakers such as Raboot and Choice Band Piloswine are also good additions, as they can weaken down the opposing team into Fraxure's range. Entry hazard setter like Galarian Corsola, Ferroseed, and Roselia are also good partners as they can help wear down threats with Stealth Rock or Spikes damage for threats to be in range of being KOed. Additionally, using Pokemon that can prevent hazards from being set like Hattrem is also encouraged, as Fraxure needs to be kept healthy to function properly. Hattrem can also heal Fraxure to full with Healing Wish to give it a second chance at sweeping. When running Swords Dance, Fraxure benefits from Sticky Web setters like Charjabug that can help lower the Speed of Choice Scarf users that may threaten Fraxure such as Krokorok and Lampent. Dual screens setters such as Morgrem are also good support, as they can help Fraxure set up more easily.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 355753, "username": "Eris"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 231074, "username": "S1nn0hC0nfirm3d"}, {"user_id": 407249, "username": "Greybaum"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}]}]}
  },
  "Mienfoo": {"sets": {"Defensive Pivot": {}}},
  "Rufflet": {
    "comments": "<h3>Other Options</h3> <p>Rufflet may opt for a Choice Scarf set with a Jolly Nature to act as a revenge killer, but this gives up the wallbreaking potential of its Choice Band set. Rufflet can also utilize Normal-type moves like Facade and Retaliate, but they require specific situations in order to match the sheer power of Brave Bird.</p> <h3>Checks and Counters</h3> <p><strong>Electabuzz</strong>: Electabuzz is faster than Rufflet and threaten it with Volt Switch. However, it cannot risk switching into an attack from Choice Band Rufflet.</p> <p><strong>Flying-resistant Foes</strong>: Klang, Lairon, Metang, and Carkol can check Choice Band Rufflet if it is locked into a move that isn't Close Combat. However, it should be noted that only Klang can reliably break past Substitute Rufflet; Rufflet can PP stall Lairon's inaccurate Head Smash with Substitute and Roost, and use Metang and Carkol as setup fodder. Honedge walls all of Rufflet's attacks and has Sacred Sword, which ignores Rufflet's Bulk Up boosts.</p> <p><strong>Taunt Users</strong>: Taunt Electabuzz and Galarian Linoone outspeed and stop Rufflet from setting up. Electabuzz also has Static to cripple Rufflet with paralysis.</p> <p><strong>Residual Damage</strong>: Stealth Rock limits the number of times Choice item Rufflet can switch in and forces Bulk Up sets to use Roost instead of setting up. Brave Bird recoil and, to a lesser extent, Gabite's Rough Skin and Ferroseed's Iron Barbs also wear down Rufflet,making it easier to revenge kill.</p>",
    "sets": {
      "Bulk Up": {
        "description": "<p>Bulk Up and Roost, backed by a solid Attack stat, make Rufflet a fantastic late-game sweeper and stallbreaker. Bulk Up boosts Rufflet's Attack and makes it difficult for physical attackers such as Raboot, Piloswine, and Fraxure to revenge kill it. Aerial Ace synergizes excellently with Hustle, as it receives the boost in power without the drawback of missing a foe. Substitute blocks status from Ferroseed and Hattrem. With the given EV spread, walls like Clefairy and Marshtomp are unable to break Substitute in one hit, and Rufflet is able to outspeed Adamant Piloswine. With a spread of 248 HP / 196 SpD / 64 Spe and a Careful Nature, and at the cost of setting up on walls, Agility lets Rufflet outpace fast special attackers such as Electabuzz, Galarian Linoone, Raboot, and Choice Scarf Lampent, which would otherwise revenge kill it.</p> <p>Rufflet should aim to setup on passive Pokemon but must be wary of their status moves and Knock Off, so slow pivots such as Clefairy, Slowpoke, and Klang help to bring Rufflet in risk-free. It is easier to pull off sweeps once Ice- and Electric-types have been removed, so consider pairing Rufflet with Pokemon like Raboot, Lampent, Gurdurr, Piloswine, Roselia, and Tangela. Entry hazard support from Pokemon like Ferroseed, Metang, and Roselia increase Rufflet's sweeping potential by wearing down foes. Entry hazard removal from Vullaby, Hattrem, Gurdurr, and Wartortle clear Stealth Rock, which would otherwise limit Rufflet's setup opportunities. Since Aerial Ace is Rufflet's only attack, it will struggle against Steel-types like Klang and Lairon, so Fighting- and Ground-types like Machoke, Marshtomp, and Gabite make for good teammates.</p>"
      },
      "Choice Band": {
        "description": "<p>Rufflet is a powerful wallbreaker thanks to the combination of Choice Band and Hustle boosting the power of its attacks significantly. Brave Bird lets Rufflet net 2HKO on walls such as Mareanie and Galarian Corsola. Close Combat hits Steel-types such as Klang and Lairon. Aerial Ace is a weaker STAB attack, but its perfect accuracy means Rufflet can use it for guaranteed damage. Finally, U-turn punishes slower Pokemon like Tangela and Hattrem and lets Rufflet pivot, making it less vulnerable to revenge killers.</p> <p>Rufflet should mainly use Brave Bird and U-turn to pick up KOs or keep momentum, while Close Combat is used nail incoming Steel-types on a predicted switch. Rufflet struggles to switch in to attacks due to its frailty, so it is a good idea to pair it with pivots such as Galarian Linoone, Electabuzz, and Slowpoke. Entry hazard removal from Pokemon like Vullaby, Hattrem, Gurdurr, and Wartortle is much appreciated, as they prevent Stealth Rock from wearing down Rufflet. Pokemon with item removal like Tangela and Koffing can remove Eviolites from walls like Galarian Corsola and Marshtomp, letting Rufflet OHKO them with Brave Bird. Rufflet is able to break past bulky physical walls like Tangela and Koffing for cleaners like Swords Dance Thwackey and Fraxure.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 226429, "username": "Jett"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 231074, "username": "S1nn0hC0nfirm3d"}, {"user_id": 407249, "username": "Greybaum"}]}, {"name": "Grammar checked by", "members": [{"user_id": 449990, "username": "DC"}]}]}
  },
  "Vullaby": {
    "comments": "<h3>Other Options</h3> <p>Toxic wears down entry hazard setters and common switch-ins like Piloswine, Gabite, and Electabuzz. Taunt shuts down bulky foes such as Duosion and Ferroseed. Running either of these moves requires Vullaby to give up important coverage or lose out on Defog. An EV spread of 248 HP / 212 SpD / 48 Spe can be used to outpace uninvested base 65 Speed Pokemon like Roselia and Hakamo-o. Whirlwind is another option that can be run in conjunction with Future Sight setters such as Duosion and Slowpoke to phaze Dark-types that switch into the activation of Future Sight. Physically defensive Impish variants with 248 HP / 84 Def / 176 Spe EVs can outpace Piloswine and stall it out with Toxic and Defog, while checking other physical attackers such as Raboot.</p> <h3>Checks and Counters</h3> <p><strong>Ice-types</strong>: Piloswine takes negligible damage from Vullaby's attacks and threatens it with a powerful STAB attack.</p> <p><strong>Physical Wallbreakers</strong>: Raboot, Rufflet, Fraxure, and Klang can break past Vullaby with their sheer strength or by setting up on it.</p> <p><strong>Electric-types</strong>: Electabuzz can threaten Vullaby with strong STAB attacks, but Vullaby can use Eviolite to negate the damage of a predicted Volt Switch with Roost and mitigate some of the lost momentum.</p> <p><strong>Residual Damage</strong>: Residual damage from Stealth Rock and poison limit Vullaby's ability to check special attackers like Roselia, Lampent, Duosion, and Tangela and force it to use Roost more often. Tangela and Roselia can even break Vullaby on their own with the help of Stealth Rock, poison from Sludge Bomb or Poison Point, and some prior chip damage. However, Roselia cannot switch in freely if Vullaby runs Brave Bird.</p>",
    "sets": {
      "Specially Defensive": {
        "description": "<p>With access to reliable recovery and a great defensive typing, Vullaby is one of the best special walls in the metagame, able to check common special attackers like Roselia, Lampent, Duosion, and Hattrem. Brave Bird lets Vullaby wear down Dark-resistant foes such as Gurdurr and specially defensive Clefairy, which could otherwise switch into Knock Off repeatedly. Alternatively, U-turn allows Vullaby to pivot out of bad matchups and safely bring in frailer teammates.</p> <p>Vullaby's two main roles are to check special attackers and clear entry hazards, but it should also look for opportunities to remove Eviolite with Knock Off during the early-game. If running U-turn, Vullaby should look to pivot away from incoming setup sweepers like Morgrem, as its passivity can be exploited by these Pokemon. Tangela, Koffing, and Gurdurr are good partners for Vullaby, as they check physical attackers such as Piloswine, Raboot, and Thwackey. Pokemon with a weakness to Stealth Rock such as Lampent, Raboot, and Rufflet enjoy the entry hazard removal and pivot support that Vullaby provides. Grass- and Ground-types like Ferroseed, Thwackey, Marshtomp, and Gabite can sponge attacks from Electric-types, while Water- and Fire-types such as Slowpoke, Wartortle, and Combusken can keep Ice-types at bay. Vullaby is one of the most reliable Tangela and Roselia switch-ins thanks to the immunity to Stun Spore and Sleep Powder provided by Overcoat and the resistance to Leaf Storm provided by its Flying typing; for this reason, it pairs well with Wartortle and Piloswine.</p>"
      },
      "Offensive": {}
    },
    "credits": {"writtenBy": [{"user_id": 226429, "username": "Jett"}, {"user_id": 451786, "username": "Mirbro"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 231074, "username": "S1nn0hC0nfirm3d"}, {"user_id": 355753, "username": "Eris"}, {"user_id": 407249, "username": "Greybaum"}]}, {"name": "Grammar checked by", "members": [{"user_id": 449990, "username": "DC"}, {"user_id": 375662, "username": "Isaiah"}]}]}
  },
  "Zweilous": {
    "sets": {
      "Substitute": {
        "description": "<p>Hustle is Zweilous' most significant trait, giving a massive power boost to its physical attacks. Crunch is a powerful STAB move that nails common physical walls such as Galarian Corsola and Hattrem. Substitute is set up when Zweilous forces the opponent to switch out, even though it is broken by common Pokemon such as Tangela, Vullaby, and Galarian Corsola. Body Slam hits opponents that resist Dark-type moves such as Clefairy, Vullaby, and Morgrem. Zen Headbutt hits Fighting-types such as Gurrdurr and Machoke and while also hitting Mareanie super effectively. Protect allows Zweilous to scout the opponent's move and get more Leftovers recovery which helps against Night Shade Galarian Corsola. The EV spread outspeeds uninvested walls such as Vullaby, Roselia, and Tangela.</p> <p>Zweilous requires good partners to work properly. First of all, because it has no Eviolite and mediocre Speed, many Pokemon such as Raboot, Piloswine, and Electabuzz can revenge kill it easily. Thus, it needs teammates such as Galarian Corsola that can sponge hits from these aforementioned threats. Clefairy is a notable check, as it avoids the 2HKO from any of Zweilous's moves and can OHKO back with Moonblast; Roselia and Ferroseed can check Clefairy and also provide Spikes support. Ferroseed also has Knock Off, which helps weaken potential Zweilous checks such as Gurdurr and Clefairy. Fighting-types such as Gurdurr and Machoke can remove items from checks such as Galarian Corsola and Clefairy, weakening them and allowing Zweilous to break through them more easily. VoltTurn cores such as Electabuzz and Thwackey can sometimes bring Zweilous against Roselia and allowing Zweilous to set Substitute as they are forced out.</p>"
      },
      "Choice Band": {}
    },
    "credits": {"writtenBy": [{"user_id": 451786, "username": "Mirbro"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 484270, "username": "hayedenn"}, {"user_id": 407249, "username": "Greybaum"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}]}
  },
  "Fletchinder": {
    "comments": "<h3>Other Options</h3> <p>Gale Wings with Dual Wingbeat offers additional countermeasures for Raboot and Gastly, but it requires maximum Attack investment and no chip damage on Fletchinder to reliably revenge kill them. An offensive set with Gale Wings, Swords Dance, Flame Charge, and potentially Acrobatics over Dual Wingbeat may sweep or stallbreak in some situations, but it is unreliable due to its frailty limiting setup opportunities. U-turn allows Fletchinder to be a defensive pivot, although it can be hard to justify over Flamethrower's offensive merits.</p> <h3>Checks and Counters</h3> <p><strong>Special Attackers</strong>: Fletchinder's bulk largely revolves around its good typing against a select few physical pivots, and it's left vulnerable to special attackers like Electabuzz, Galarian Mr. Mime, and Lampent</p> <p><strong>Water-types</strong>: Mareanie and Marshtomp have Scald to hurt Fletchinder, and Wartortle hits hard with Hydro Pump or can pivot out on it with Flip Turn.</p> <p><strong>Bulky Attackers</strong>: Due to its mediocre bulk, Fletchinder is checked by physical attackers like Gurdurr, Piloswine, and Machoke. Ground-types that carry Stone Edge like Gabite and Krokorok are also troublesome, even if they become afflicted with burn.</p> <p><strong>Hattrem</strong>: One wall that Fletchinder cannot stop from recovering is RestTalk Hattrem, which outstalls it completely and may even bounce back Toxic on the switch.</p> <p><strong>Residual Damage</strong>: Stealth Rock is a huge problem for Eviolite Fletchinder, and the same can be applied for Heavy-Duty Boots variants if they suffer a Knock Off from Thwackey. Fletchinder also relies on Taunt to prevent opposing Toxic attempts from walls, which would jeopardize its bulk as well.</p>",
    "sets": {
      "Defensive Support": {
        "description": "<p>A unique defensive typing of Fire / Flying gives Fletchinder an edge against physically offensive pivots like Raboot and Thwackey. This typing comes at the cost of having to run Heavy-Duty Boots to negate its crippling Stealth Rock vulnerability, preventing it from having comparable bulk to the rest of NFE's walls, or requiring extensive anti-entry hazard support if it opts for Eviolite. Flamethrower is the preferred attack for Fletchinder, as strong coverage for Steel-types and Tangela is relevant for breaking defensive cores. Taunt also helps with stallbreaking and preventing Galarian Corsola and Clefairy from recovering. Fletchinder can cripple physical attackers like Piloswine and Klang with Will-O-Wisp, while Toxic wears down walls like Galarian Corsola and Marshtomp. Flame Body is preferred for the opportunity to passively inflict burn when switching into U-turn users. With 132 Speed EVs and a Timid nature, Fletchinder manages to be faster than Adamant Thwackey while preserving enough bulk to wall Raboot.</p> <p>If Fletchinder equips Eviolite, it is imperative to pair it with teammates that provide Stealth Rock prevention or removal like Hattrem, Golbat, and Wartortle. While it can prevent Stealth Rock itself with Taunt, Fletchinder should further pressure setters with offensive support from Thwackey and Galarian Mr. Mime. Walls like Ferroseed, specially defensive Wartortle, and Mareanie make up for Fletchinder's Water weakness, while it in return helps wall and punish Raboot and Thwackey. Knock Off switch-ins like Tangela and Gurdurr help preserve Feltchinder's invaluable item. Fletchinder fails to reliably check Gurdurr and Piloswine, so it should enlist support of physical walls like Tangela and Clefairy. Conversely, Drakloak and Marshtomp help deal with special wallbreakers like Lampent and Electabuzz and rely on Fletchinder—especially Eviolite variants—to check Vullaby and Ferroseed. Heal Bell support from clerics like Clefairy lets Fletchinder recover from Toxic.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 231074, "username": "S1nn0hC0nfirm3d"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 425492, "username": "Tack"}, {"user_id": 355753, "username": "Eris"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}]}]}
  },
  "Swirlix": {
    "sets": {
      "Grassy Seed Sweeper": {
        "description": "<p>Swirlix sees use on Grassy Terrain hyper offense as a cleaner. Despite being frail and not that strong, its perfect coverage and multiple ways of boosting make up for its low stats. Draining Kiss, while weak, provides enough recovery for Swirlix to have a chance at beating Piloswine, Galarian Corsola, and Marshtomp. Flamethrower hits Steel- and Grass-types like Ferroseed, Roselia, and Tangela. Thunderbolt is great for Water-types like Wartortle and Mareanie, though Energy Ball has good synergy with Grassy Terrain and nails Piloswine. The suggested EV investment allows Swirlix to outspeed the entire unboosted metagame after Unburden triggers and maximizes Draining Kiss recovery on bulkier threats with no HP investment. If Swirlix opts not to be a sweeper, then a suicide lead set with Sticky Webs and Misty Explosion functions on hyper offense.</p> <p>Naturally, Thwackey is a mandatory teammate to provide Grassy Terrain. It also offers Knock Off support, to cripple Roselia, Tangela, and Koffing. More item removal support from Gurdurr, Vullaby, Ferroseed, and Galarian Linoone is warranted because Swirlix will require most threats to lose their Eviolite before it has a chance to sweep. Vullaby, Galarian Linoone, and Ferroseed will deal with Toxic Duosion. In return, Swirlix can handle Gurdurr. Swirlix is also a great beneficiary of Toxic Spikes from Koffing and Mareanie, as they help it take down bulkier threats like Future Sight Duosion. Toxic Spikes also synergize well when stalling with Draining Kiss recovery; the extra chip damage makes up for Draining Kiss's low Base Power. Swirlix's attempts to sweep can come to a grinding halt against Haze Mareanie and Galarian Corsola, but even if Swirlix cannot sweep itself, it may still position other sweepers like Wartortle, Acrobatics Raboot, and Thwackey to pick up where it left off.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 231074, "username": "S1nn0hC0nfirm3d"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 226429, "username": "Jett"}, {"user_id": 451786, "username": "Mirbro"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}]}]}
  },
  "Torracat": {
    "comments": "<h3>Other Options</h3> <p>Physical Torracat sets offer a stronger U-turn on top of a stronger Fire-type attack in Flare Blitz, but the added recoil only wears down Torracat further. Physical sets may also try Swords Dance, Bulk Up, and Flame Charge for boosting, and Power Trip also pairs with these sets as powerful coverage. While Choice Scarf Torracat has a fast Intimidate and Parting Shot for checking physical sweepers, it is often inferior to the faster and stronger Choice Scarf Raboot.</p> <h3>Checks and Counters</h3> <p><strong>Water-types</strong>: Defensive Water-types like Mareanie, Wartortle, and Marshtomp wall Torracat and punish back with Scald or Flip Turn. The latter two may struggle with Toxic, however.</p> <p><strong>Ground-types</strong>: Torracat is forced to pivot out on slower Ground-types like Piloswine, Gabite, and Palpitoad while they're healthy, and is revenge killed by Choice Scarf Krokorok.</p> <p><strong>Entry Hazards</strong>: Without Heavy-Duty Boots, Torracat is vulnerable to being worn down by entry hazards as it lacks recovery and will take damage often due to being a pivot.</p>",
    "sets": {
      "Bulky Pivot": {
        "description": "<p>Torracat is one of NFE's niche pivots thanks to its decent Speed tier combined with its ability Intimidate, allowing it to pressure physical threats like Thwackey and Gurdurr. U-turn is Torracat's main pivoting attack, allowing it to inflict a small amount of chip damage on its foe; however, Parting Shot can be used instead, as it can weaken opposing damage output and allow for a partner to come in without risking too much damage. Taunt allows Torracat to prevent walls like Galarian Corsola, Mareanie, and Clefairy from recovering, setting entry hazards, and setting up. Overheat is Torracat's strongest attack, allowing it to hit Grass-, Bug-, and Steel-types like Tangela, Charjabug, and Ferroseed and OHKOing them after Stealth Rock. Flamethrower can also be an option when paired with Nasty Plot, allowing Torracat to stallbreak threats like Galarian Corsola and Clefairy. Will-O-Wisp enables Torracat to threaten physical attackers like Piloswine, while Toxic is also an option, as it cripples walls like Palpitoad and Gabite. Eviolite is prefered for the extra bulk for walling Thwackey, while Heavy-Duty Boots is an option so that Torract relies less on ant-entry hazard support.</p> <p>Torracat fits well on balance teams, as it can prolong momentum and offensive pressure. Torracat is great at applying pressure through U-turn or Parting Shot by luring in threats like Mareanie and Galarian Corsola; therefore, carrying Pokemon that can utilize that pressure like Electabuzz and Thwackey is helpful, as they can deal with these threats and keep up momentum. Stealth Rock and other entry hazards are also one of Torracat's biggest weaknesses if it opts for Eviolite, thus having consistent entry hazard removal from Pokemon like Hattrem, Vullaby, and Wartortle is essential. In addition, carrying entry hazard setters like Piloswine, Ferroseed, and Marshtomp can help Torracat's role by luring in threats like Machoke and Hattrem, forcing their health to be chipped down. Torracat is also very susceptible to Fire- and Water-type checks like Lampent, Mareanie, and Wartortle; therefore, pairing it with Water- and Grass-types like specially defensive Palpitoad, Vullaby, and Roselia is encouraged. Furthermore, Knock Off users like Thwackey, Galarian Linoone, and Krokorok are good partners to wear down threats and revenge kill opposing Pokemon.</p>"
      },
      "Swords Dance": {}
    },
    "credits": {"writtenBy": [{"user_id": 355753, "username": "Eris"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 231074, "username": "S1nn0hC0nfirm3d"}, {"user_id": 407249, "username": "Greybaum"}]}, {"name": "Grammar checked by", "members": [{"user_id": 297659, "username": "deetah"}]}]}
  },
  "Charjabug": {
    "comments": "<h3>Other Options</h3> <p>X-Scissor is a more accurate Bug-type attack compared to Skitter Smack at the cost of no utility against special attackers. Charjabug can also use Light Screen to support its team, but cannot afford to sacrifice its bulk to use Light Clay and typically finds more use out of Thunder Wave or Toxic than from the limited turns of Light Screen.</p> <h3>Checks and Counters</h3> <p><strong>Fire-types</strong>: Fire-types like Raboot, Carkol, and Lampent pose a huge threat to Charjabug, especially the latter two with their Choice Specs variants OHKOing it.</p> <p><strong>Hattrem</strong>: Magic Bounce Hattrem denies any Sticky Web attempt from Charjabug and can hit it hard with Mystical Fire, but must be careful not to switch into Skitter Smack, as Charjabug is able to win in a one-on-one scenario at the cost of the majority of its health.</p> <p><strong>Stallbreakers</strong>: Taunt users like Galarian Linoone and Electabuzz prevent Sticky Web attempts, while offensive stallbreakers like Shift Gear Klang and Bulk Up Rufflet can abuse Charjabug's passivity.</p> <p><strong>Entry Hazards</strong>: As much as Charjabug wants to function as a slow pivot throughout the game, it struggles to remain healthy with its entry hazard vulnerability, particularly its crippling Stealth Rock weakness.</p>",
    "sets": {
      "Sticky Web": {
        "description": "<p>Charjabug is the premier Sticky Web user in the metagame thanks to its solid Bug / Electric typing letting it threaten Hattrem and pivot out of common Defog users with Volt Switch. It's also blessed with a solid Defense stat and a resistance to Fighting, which lets it switch into Gurdurr and Machoke with relative ease. Skitter Smack is Charjabug's primary attack due to its ability to cripple special attackers that may switch in such as Lampent and Hattrem while also being powerful enough to 2HKO Choice Specs variants of the latter. Volt Switch lets Charjabug generate momentum and safely switch out of setup sweepers such as Combusken, Klang, and Fraxure, which all would otherwise use it as setup fodder. Lastly, Toxic allows Charjabug to cripple Defog users like Vullaby and Gurdurr in addition to opposing hazard setters like Galarian Corsola and Piloswine. Alternatively, Thunder Wave allows Charjabug to cripple Vullaby, and can lower the Speed of Pokemon that are unaffected by Sticky Web such as Drakloak and Klang.</p> <p>Charjabug should aim to set up Sticky Web as early in the game as possible, although it should be wary of Magic Bounce if Hattrem is present on the opponent's team. After Sticky Web has been set, Charjabug can freely spread status and use Volt Switch to pivot into strong breakers to take advantage. Wallbreakers like Machoke, Rufflet, and Gastly make great use of the speed control that Charjabug provides and benefit greatly from its ability to bring them in safely with a slow Volt Switch, the latter also being an offensive spinblocker. Charjabug has no reliable recovery and is very prone to being worn down, so pairing it with Wish users like Clefairy and Togetic can increase its longevity; the aforementioned Fairy-types also function as great physically defensive walls and can alleviate some pressure from Charjabug. Charjabug's weakness to entry hazards limits the number of times it is able to switch in, so Rapid Spin users like Wartortle can be beneficial. Spikes users such as Carkol, Roselia, and Ferroseed not only form solid entry hazard-stacking cores but can act as specially defensive walls covering Charjabug's mediocre special bulk.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 226429, "username": "Jett"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 355753, "username": "Eris"}, {"user_id": 231074, "username": "S1nn0hC0nfirm3d"}]}]}
  },
  "Mareanie": {
    "comments": "<h3>Other Options</h3> <p>Toxic over Toxic Spikes punishes targets like Marshtomp and Tangela immediately rather than relying on an entry hazard to status them. Sludge Bomb damages and also spreads status on targets like Vullaby and Thwackey to prevent them from switching in as easily, but Knock Off is usually better for the general utility. As a physical wall, Mareanie is more reliable at checking Pokemon like Gurdurr and Raboot. However, specially defensive sets already check these attackers and are overall more effective.</p> <h3>Checks and Counters</h3> <p><strong>Psychic-types</strong>: Mareanie usually fails as a special wall when up against Duosion and Hattrem, as they target its Psychic weakness and have either immunities or Magic Bounce to work around Toxic Spikes.</p> <p><strong>Ground-types</strong>: Especially without Scald, Ground-types like Piloswine, Marshtomp, and Krokorok are switch-ins to Mareanie that hit hard with Earthquake.</p> <p><strong>Wallbreakers</strong>: Many of the meta’s strongest attackers like Choice Band Piloswine, Choice Specs Electabuzz, and Choice Band Thwackey break through Mareanie with their STAB attacks.</p>",
    "sets": {
      "Special Wall": {
        "description": "<p>Mareanie functions as a great special wall thanks to its multiple recovery options and supportive coverage. Recover gives Mareanie the opportunity to regain its HP immediately, while its ability Regenerator can help Mareanie regain HP when pivoting. Scald can burn physical attackers like Piloswine and Thwackey, while Toxic Spikes offers an opportunity to spread status against vulnerable teams once opposing Poison-types are eliminated. Knock Off debilitates walls like Vullaby and Galarian Corsola and also threatens special wallbreakers like Lampent and Galarian Corsola. Haze prevents some sweepers such as Shell Smash Wartortle, RestTalk Klang, and Calm Mind Lampent from setting up and breaking past Mareanie.</p> <p>Mareanie should be played as defensive pivot that switches into attackers like Lampent and Raboot in order to force them out. Try pairing Mareanie with physically defensive Pokemon like Galarian Corsola, Clefairy, and Tangela to help deal with attackers like Thwackey, Gurdurr, and Electabuzz. Clefairy and Galarian Corsola also form a great entry hazard-stacking core with Toxic Spikes Mareanie, with the former luring in Hattrem for a Knock Off, and the latter trapping and removing Hattrem with Whirlpool to let Mareanie spam its status moves far more freely. Other bulky Pokemon like Gurdurr and Klang appreciate Mareanie scouting stronger attacks for them, as it can easily switch into Moonblast and Flamethrower from Clefairy and Lampent, respectively. While Mareanie has a weakness to Earthquake, it could be worthwhile to stay in and use Knock Off on tanks that use Earthquake, such as Piloswine and Marshtomp, if removing their Eviolite is essential for the team’s win condition; in these cases, pair Mareanie with offensive sweepers like Electabuzz and Raboot. Otherwise, Ground-type checks such as Thwackey and Galarian Corsola can help. Late-game, it could be beneficial to sack Mareanie by spamming Haze in the face of Shell Smash Wartortle or Dragon Dance Fraxure so that they do not sweep and remain slow enough to be revenge killed by offensive teammates like Electabuzz and Piloswine.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 231074, "username": "S1nn0hC0nfirm3d"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 355753, "username": "Eris"}, {"user_id": 226429, "username": "Jett"}]}, {"name": "Grammar checked by", "members": [{"user_id": 229690, "username": "queez"}]}]}
  },
  "Hakamo-o": {
    "comments": "<h3>Other Options</h3> <p>RestTalk sets can work as decent special walls for Tangela, Lampent, and Roselia, and fulfill the role of a phazer with Dragon Tail. Swords Dance with Scale Shot can take advantage of the unique setup oppertunities Hakamo-o offers, but is notably weaker than its competition in Fraxure. Hakamo-o can try different coverage over Substitute to target specific checks like Earthquake for Mareanie or Rock Slide for Vullaby, but it loses its niche as a sweeper that can setup on many walls unable to touch it behind its Substitute.</p> <h3>Checks and Counters</h3> <p><strong>Fairy-types</strong>: Even with Iron Head, defensive Fairy-types like Clefairy and Togetic are good checks to Hakamo-o as they compromise its setup attempts with their STAB attacks.</p> <p><strong>Psychic-types</strong>: Offensive checks to Hakamo-o include strong Psychic-types like Abra, and even slower ones like Hattrem and Duosion are threatening as well if they're healthy.</p> <p><strong>Physical Walls</strong>: Hakamo-o has a hard time dealing with physical walls like Galarian Corsola, Mareanie, and RestTalk Machoke, but these checks are less reliable if they lose their Eviolite or are chipped.</p> <p><strong>Faster Wallbreakers</strong>: Before setting up, Hakamo-o is stuck at a middling Speed, so faster wallbreakers like Fraxure, Electabuzz, Dazzling Gleam Gastly, and Acrobatics Thwackey jeopardize its sweeping attempts.</p>",
    "sets": {
      "Substitute + Dragon Dance": {
        "description": "<p>Hakamo-o's solid bulk, ability Bulletproof, and defensive typing allow it to check a variety of offensive threats, including Roselia, Lampent, and Thwackey, although it must be wary of Grassy Seed Acrobatics sets from the latter. It can take advantage of these Pokemon to set up with Dragon Dance, which helps compensate for its middling Speed and Attack stats and allows it to sweep late-game. Substitute provides Hakamo-o with even more opportunities to set up, as it can set up a Substitute in front of Pokemon like Tangela, Shadow Ball Galarian Corsola, and Ferroseed to boost up without fear of getting statused or having its Eviolite removed by Knock Off. Dual Chop can be used in place of Dragon Claw to KO Focus Sash Abra after a Dragon Dance and damage foes like Lampent through a Substitute, but the imperfect accuracy and increased chance of triggering Galarian Corsola's Cursed Body make it a risky option. Drain Punch helps to compensate for the HP lost when setting up Substitute and makes it very difficult for Hakamo-o to be worn down low enough to be knocked out by a priority move. Alternatively, Iron Head can be used to KO weakened Fairy-types after a boost, especially if their Eviolite has been removed. Bulletproof makes Hakamo-o immune to Koffing's Sludge Bomb and Lampent's Shadow Ball, which makes it an effective check to both of those Pokemon and gives it more chances to set up.</p> <p>Hakamo-o struggles a lot against Fairy-types like Clefairy and Togetic, particularly if it isn't running Iron Head, and needs foes like Galarian Corsola and Haze Mareanie to be weakened before it can sweep. As such, Gurdurr, Tangela, and Machoke make for great teammates for Hakamo-o, as they use Knock Off to remove Eviolites from physical walls, and Machoke variants with Heavy Slam or Flame Orb + Facade can lure in and KO or heavily weaken Fairy-types. A Steel-type like Klang can check the aforementioned Fairy-types as well as Psychic-types like Duosion and Abra, which force Hakamo-o out. Choice Band Thwackey partners nicely with Hakamo-o, as it can bring it in safely via U-turn against Tangela, Koffing, and Ferroseed, which Hakamo-o can set up against, or wear them down shared checks like Galarian Corsola with Knock Off. The passive recovery from Grassy Terrain that Thwackey provides allows Hakamo-o to stay healthy as it cuts its HP for Substitute. Entry hazard setters like Roselia, Koffing, and Metang help wear down targets like Electabuzz and Piloswine so they are less likely to check Hakamo-o late-game.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 225453, "username": "MAMP"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 407249, "username": "Greybaum"}, {"user_id": 226429, "username": "Jett"}]}, {"name": "Grammar checked by", "members": [{"user_id": 297659, "username": "deetah"}]}]}
  },
  "Thwackey": {
    "comments": "<h3>Other Options</h3> <p>A set utilizing Grassy Seed and Acrobatics provides strong coverage against checks like Vullaby and Roselia, but is less consistent for setting up due to the lack of an Eviolite. More investment into HP instead of Speed gives Thwackey an edge against faster attackers like Electabuzz and Raboot, although it may then be vulnerable to more attackers like Roselia and Lampent. Utility options like Taunt or Leech Seed instead of Swords Dance could be considered to cripple Flying-types like Vullaby, although the lack of boosting can result in underwhelming damage. Drain Punch can be used on the Swords Dance set to do more immediate damage to Ferroseed, but leaves Thwackey with no way to pivot on common Grass-resists like Koffing and Tangela.</p> <h3>Checks and Counters</h3> <p><strong>Poison-types</strong>: Roselia, Koffing, and Ivysaur easily switch into Thwackey, and can still function as checks despite potentially taking a Knock Off from it.</p> <p><strong>Fire-types</strong>: Faster Fire-types like Raboot, Combusken, and Choice Scarf Lampent resist Grassy Glide and easily revenge kill Thwackey. However, they struggle switching in, and can be jeopardized by chip damage from entry hazards making them vulnerable to U-turn.</p> <p><strong>Physcial Walls</strong>: Walls that resist Grass like Tangela, Galarian Corsola, and Charjabug do well to deter Thwackey's sweeping attempts. Vullaby and Galarian Corsola also work, but can be weakened into range of Thwackey if not careful.</p>",
    "sets": {
      "Swords Dance": {
        "description": "<p>Access to priority in Grassy Glide and a great ability in Grassy Surge allows Thwackey to perform as both a Swords Dance wallbreaker and priority sweeper. Grassy Glide lets Thwackey threaten faster threats like +2 Wartortle and Galarian Linoone, and it can also find opportunities to use Swords Dance on passive Pokemon like Clefairy, Mareanie, and Ferroseed. U-turn is used to pivot on Grass-resists like Roselia and Tangela, while Knock Off offers coverage for Lampent and an option to debilitate Thwackey's aforementioned checks in Roselia, Tangela, and Koffing.</p> <p>The effects of Grassy Surge linger even after Thwackey has left the field, so plan teammates accordingly to benefit from its effects. Stealth Rock users like Clefairy and Piloswine help wear down Grass-resistant targets like Roselia, Vullaby, and Charjabug; with Piloswine, make sure to opt for High Horsepower instead of Earthquake due to Grassy Terrain. Grass- and Poison-types like Tangela, Ivysaur, and Koffing stand in Thwackey's way and need to be eliminated for it to have a chance of cleaning. Try pairing Thwackey with special wallbreakers like Lampent and Wartortle to help target these walls, and in return, Thwackey can weaken special walls like Ferroseed and Klang with Knock Off. Status conditions plague Thwackey, so having support to remove Toxic Spikes, like Mareanie, Koffing, and Vullaby can be useful. Hattrem is also notable for its access to Healing Wish, combating status conditions and HP lost when Thwackey sets up. Special sweepers in Wartortle and Morgrem set up on on physical walls like Galarian Corsola and Vullaby, which applies immense pressure on Thwackey's checks when played offensively.</p>"
      },
      "Choice Band": {
        "description": "<p>Choice Band powers up Thwackey immediately, which potently wears down its checks and threatens to OHKO targets like Gastly and Piloswine. The Choice-lock simultaneously punishes Thwackey when locking into unfavorable coverage, though, and the lack of an Eviolite makes it much more frail. Knock Off benefits from the risen power by securing an OHKO and 2HKO on Lampent and Roselia after Stealth Rock, respectively. Wood Hammer is a nuke when boosted by Grassy Terrain, denting slower targets like Hattrem, Gabite, and Clefairy. Drain Punch offers variety and recovery when Steel-types like Ferroseed and Klang switch in anticipating a Grass-type attack. U-turn picks off vulnerable targets while pivoting out and notably is super effective against Tangela.</p> <p>Use Thwackey mid-game as a wallbreaker and scout thanks to its raw power and utility. It can pivot out on its checks with U-turn like Roselia, Tangela, Vullaby, and Koffing to bring in special wallbreakers and stallbreakers like Electabuzz and Lampent safely. Alternatively, if Thwackey is paired with additional physical attackers like Raboot and Piloswine, Thwackey could use Knock Off when the aforementioned walls switch in to soften them up for the team. Fire-types like Lampent and Raboot target the Grass-types that wall Thwackey, and in return, it revenge kills Wartortle, Marshtomp, and Piloswine. Thwackey works in tandem with more pivoting support from Wartortle, Clefairy, and Galarian Linoone to generate momentum and find opportunities to get in on the walls it breaks; the former two act as slow pivots to bring Thwackey in safely for revenge killing attackers like Wartortle and Flame Orb Machoke. Stealth Rock support from setters like Piloswine, Galarian Corsola, and Clefairy is essential for crucial damage output against opposing Lampent, Roselia, and Mareanie, while also punishing Flying-types like Vullaby and Rufflet, which comfortably switch into Thwackey's attacks.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 231074, "username": "S1nn0hC0nfirm3d"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 226429, "username": "Jett"}, {"user_id": 355753, "username": "Eris"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}]}]}
  },
  "Raboot": {
    "comments": "<h3>Other Options</h3> <p>An offensive pivot set with Heavy-Duty Boots works great for revenge killing and as an offensive pivot. Choice Scarf is an option so that Raboot can outspeed faster threats such as Galarian Linoone and Kadabra. When paired with Thwackey, Bulk Up Raboot may opt for Grassy Seed and Acrobatics, and have a better match up against some targets like Lampent and Machoke. Gunk Shot is worthwhile coverage for hitting Clefairy and Togetic, but usually Flare Blitz suffices while preserving more valuable coverage.</p> <h3>Checks and Counters</h3> <p><strong>Physical Walls</strong>: Walls like Clefairy, Koffing, Gabite, and defensive Machoke are able to stomach hits from Raboot and punish with status or strong attacks. Gabite also punishes U-turn attempts thanks to Rough Skin.</p> <p><strong>Water-types</strong>: Mareanie, Marshtomp, Wartortle, and Palpitoad are valid switch-ins to Flare Blitz, and are bulky enough to tank the rest of its coverage while healthy.</p> <p><strong>Revenge Killers</strong>: Raboot struggles to sweep when up against  revenge killers that aren't detered by Sucker Punch like Electabuzz and Choice Scarf Krokorok.</p> <p><strong>Lampent</strong>: Lampent's resistances and immunities allow it to counter most Raboot variants by setting up on them, but fails to check against Assurance sets.</p>",
    "sets": {
      "Choice Band": {
        "description": "<p>Raboot cements itself as a prominent wallbreaker in NFE thanks to its ability Libero and high power coverage moves. Flare Blitz allows it to break past Pokemon such as specially defensive Clefairy, Roselia, and Klang. High Jump Kick targets Pokemon that can withstand Flare Blitz like Gabite and Piloswine. Sucker Punch provides Raboot with priority, allowing it to handle faster threats like Kadabra and Galarian Mr. Mime. Alternatively, Assurance can be an option to reliably hit checks like Lampent, which would otherwise force Raboot out. U-turn allows Raboot to act as an offensive pivot and switch out against checks such as bulky Machoke and Wartortle.</p> <p>Choice Band Raboot functions best early- to mid-game where it can punch holes through the opponent's team. Raboot is an offensive pivot weak to Stealth Rock, so it appreciates entry hazard prevention and removal from Pokemon such as Hattrem, Wartortle, and Golbat to ensure it stays healthy. Hattrem is a particularly good partner thanks to it being able to get Raboot back to full health with Healing Wish and heavily threaten defensive Machoke and common entry hazard setters such as Piloswine and Palpitoad. Alternatively, entry hazard support from the likes of Piloswine, Roselia, and Ferroseed help Raboot break past bulkier foes that may try and switch in, such as Galarian Corsola. Pivots such as Vullaby, Electabuzz, and Galarian Linoone form a VoltTurn core while also supporting Raboot. Galarian Linoone can addtionally lure in walls and remove their Eviolites with Knock Off, and additional Knock Off support from Gurdurr and Clefairy is also recommended. Setup sweepers such as Wartortle, Klang, and Thwackey value Raboot's ability to weaken or remove their Grass-type checks such as Tangela, Ferroseed, and Roselia.</p>"
      },
      "Offensive Pivot": {},
      "Bulk Up": {
        "description": "<p>Bulk Up allows Raboot to threaten defensive Pokemon such as Clefairy, although it still struggles with Strength Sap Galarian Corsola and Haze Mareanie. Flare Blitz deals solid damage to multiple threats in NFE such as Gurdurr, Hattrem, and Tangela. Sucker Punch is an absolute necessity on Raboot, threatening faster Pokemon like Electabuzz and Drakloak. High Jump Kick provides Raboot with a coverage option that targets foes such as Carkol, Piloswine, and Galarian Linoone. U-turn can be used over High Jump Kick to pivot out of unfavorable matchups such as Galarian Corsola, Mareanie, and Wartortle. Eviolite preserves Raboot's bulk, while Heavy-Duty Boots allows Raboot to not rely on entry hazard removal before setting up.</p> <p>Raboot is most effective mid- to late-game where it can more easily set up and sweep against opposing Fairy- and Fire-types, as well as Pokemon such as Klang. Raboot appreciates entry hazards, so Pokemon such as Piloswine, Ferroseed, and Roselia pair well with it. Raboot is often pressured by opposing Water-types, so checks such as Klang, Tangela, and the previously mentioned Roselia make for good teammates. Special wallbreakers such as Electabuzz, Lampent, and Gastly can threaten physically defensive walls that check Raboot such as Marshtomp, Galarian Corsola, and Mareanie. Because Raboot is weak to entry hazards, it values Pokemon that can remove them such as Golbat, Vullaby, and Wartortle.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 272450, "username": "BP"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 355753, "username": "Eris"}, {"user_id": 231074, "username": "S1nn0hC0nfirm3d"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}]}]}
  },
  "Hattrem": {
    "comments": "<h3>Other Options</h3> <p>Hattrem may opt for Life Dew and another coverage move over Rest and Sleep Talk on its physically defensive set to avoid being overly passive. However, the recovery from Rest lets Hattrem perform its entry hazard deterrent role more reliably. A Timid nature allows Hattrem to outspeed maximum Speed Piloswine and Klang, as well as Jolly Machoke, but these foes are rare, and the additional power from a Modest nature is generally preferred.</p> <h3>Checks and Counters</h3> <p><strong>Ghost-types</strong>: Offensive Ghost-types such as Gastly and Lampent easily 2HKO Hattrem with Shadow Ball.</p> <p><strong>Dark-types</strong>: Vullaby and Galarian Linoone can switch into Hattrem and force it out with Knock Off. However, Galarian Linoone must be wary of Dazzling Gleam.</p> <p><strong>Setup Sweepers and Wallbreakers</strong>: Pokemon like Klang, Duosion, and Rufflet can break past Hattrem with their immediate power or by setting up.</p> <p><strong>Knock Off</strong>: Strong Knock Off users such as Thwackey and stallbreaker Tangela threaten Hattrem.</p>",
    "sets": {
      "RestTalk": {
        "description": "<p>Thanks to its amazing ability Magic Bounce, Hattrem can reflect any attempts of Stealth Rock and Spikes used by Pokemon such as Piloswine and Ferroseed. Rest and Sleep Talk provides Hattrem with important recovery, allowing it to be a valid physical wall and entry hazard deterrent throughout the match. Mystical Fire hits Ferroseed and helps to circumvent Hattrem's mediocre Special Defense by letting it beat Clefairy. Giga Drain targets common Stealth Rock setters such as Marshtomp and Piloswine while also giving Hattrem a bit of recovery outside of Rest.</p> <p>Pokemon with a Stealth Rock weakness such as Lampent, Rufflet, and Eviolite Raboot benefit from Hattrem's ability to bounce back entry hazards, which provides them with more setup opportunities and adds important chip damage to aid them in sweeping. Hattrem also dissuades Galarian Corsola from recovering with Strength Sap, which helps wallbreakers such as Thwackey and Raboot break past it. Despite its defensive investment, Hattrem should not be heavily relied on as a wall, as it has unreliable recovery, and should mainly be used to switch into entry hazard setters. Pairing Hattrem with defensive Pokemon such as Clefairy, Gurdurr, and Vullaby is a good idea, as they cover its weakness to Dark- and Ghost-type attacks and prevent it from getting overwhelmed by attacks.</p>"
      },
      "Support": {
        "description": "<p>While Hattrem's main role is as an entry hazard deterrent, it can also assist its teammates with various utility moves. Giga Drain hits Marshtomp and Krokorok hard while also providing recovery, letting Hattrem avoid a 2HKO from Piloswine with the given EV spread. Mystical Fire 2HKOes Ferroseed. Hattrem can opt for Nuzzle over one of the coverage moves to cripple faster sweepers that may attempt to switch into it, such as Morgrem and Thwackey. Healing Wish allows Hattrem to continue supporting the team after the opposing entry hazard setter has been removed. 12 Speed EVs let Hattrem outspeed uninvested base 50 Speed Pokemon, which is particularly important for Piloswine.</p> <p>It is recommended that you pair Hattrem with a Defogger or spinner such as Vullaby or Wartortle, as it is worn down very easily and lacks solid recovery. Entry hazard removal also helps to combat Hattrem's inability to reflect Neutralizing Gas Koffing's Toxic Spikes. Pokemon that are worn down by recoil moves and weak to entry hazards such as Raboot and Rufflet benefit greatly from Hattrem's Healing Wish and ability to keep the field clear of entry hazards. Fighting-types such as Gurdurr and Machoke cover for Hattrem's Dark-type weakness. In return, Hattrem threatens Galarian Corsola and provides speed control with Nuzzle. Dark-types like Vullaby and Galarian Linoone check faster Ghost-types such as Gastly and Lampent.</p>"
      },
      "Choice Specs": {
        "description": "<p>Choice Specs Hattrem plays off the fact that Hattrem is commonly used as a defensive Pokemon to pick up KOs against targets like Gurdurr, Mareanie, and Tangela with their Eviolites removed. Mystical Fire targets Steel-types such as Ferroseed, Metang, and Klang and 2HKOes Charjabug. Dazzling Gleam helps take down Dark-types such as Vullaby, Galarian Linoone, and Krokorok. Healing Wish can be used to restore a teammate to full health when Hattrem's wallbreaking is no longer needed. Alternatively, Dark Pulse lets it beat Galarian Corsola and opposing Hattrem.</p> <p>Since Hattrem is a special wallbreaker, it should be paired with physical wallbreakers and setup sweepers that appreciate the removal of physical walls, like Raboot and Thwackey. Knock Off users such as Gurdurr and Tangela increase Hattrem's wallbreaking prowess while also absorbing Knock Off for it; in return, Hattrem beats Koffing and Galarian Corsola. Hattrem is relatively frail without Eviolite, so slow pivots such as Charjabug and Clefairy can bring it in safely. Hattrem also benefits from the former's Sticky Web, as it is not a fast wallbreaker. Faster Pokemon such as Gastly and Morgrem easily revenge kill Hattrem with their STAB attacks, so it is important to have switch-ins like Ferroseed and Klang to deal with these Pokemon.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 231074, "username": "S1nn0hC0nfirm3d"}, {"user_id": 226429, "username": "Jett"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 226429, "username": "Jett"}, {"user_id": 231074, "username": "S1nn0hC0nfirm3d"}, {"user_id": 355753, "username": "Eris"}]}, {"name": "Grammar checked by", "members": [{"user_id": 449990, "username": "DC"}]}]}
  },
  "Morgrem": {
    "comments": "<h3>Other Options</h3> <p>A Choice Specs set is immediately powerful and utilizes Trick, although the Nasty Plot set tends to be more consistent at wallbreaking, and  has Sucker Punch to make it harder to revenge kill. Choice Scarf is effective at revenge killing fast Pokemon weak to Morgrem's STAB attacks like Abra and Galarian Linoone.</p> <h3>Checks and Counters</h3> <p><strong>Poison-types</strong>: Roselia and Mareanie resist Morgrem's Fairy-type coverage, and are bulky enough to stop setup sets.</p> <p><strong>Steel-types</strong>: Bulky Steel-types like Ferroseed, Klang, and Metang pressure the frail Morgrem. However, Ferroseed and Metang are less reliable in stopping Nasty Plot sets that carry Mystical Fire and Dark Pulse.</p>",
    "sets": {
      "Screens": {
        "description": "<p>Morgrem is commonly known for being the best screen setter in NFE. Its ability, Prankster, allows it to use a status move before usually fainting or being attacked. Light Screen and Reflect are moves used to support Morgrem's teammates and are also used to compensate for Morgrem's average bulk and lack of Eviolite. Thunder Wave is Morgrem's best status move, allowing it to target faster attackers that can otherwise be a threat such as Raboot and Shell Smash Wartortle. Morgrem can also use Taunt to shut down walls like Galarian Corsola and Ferroseed and prevent Vullaby and Togetic from clearing dual screens with Defog. Dazzling Gleam is Morgrem's best damaging move that hits common wallbreakers like Gurdurr, Fraxure, and Galarian Linoone. 192 SpA allows for Morgrem to OHKO Flame Orb Machoke after Stealth Rock damage while 128 Speed EVs allow Morgrem to outspeed Flame Orb Machoke.</p> <p>Morgrem best functions early- to late-game as a support to offensive teams and usually is best paired with wallbreakers and set up sweepers, as the provided longevity allows them to tank opposing attacks better. Pokemon like Raboot, Flame Orb Machoke, Choice Band Piloswine, Thwackey, and Wartortle are especially good under screen support. You should try to avoid bringing Morgrem in on Pokemon that commonly run Knock Off, as you want to have your dual screens last for longer; alternatively, if it can afford to, Morgrem's resistance to Knock Off helps it switch into Galarian Linoone and Gurdurr for teammates. Additionally, offensive entry hazard setters like Piloswine, Roselia, and Drilbur are good partners, as they can keep an offensive pressure up while also benefiting the rest of the team by putting threats in range of attacks.</p>"
      },
      "Nasty Plot": {
        "description": "<p>Morgrem is one of NFE's best setup wallbreakers thanks to its access in to Nasty Plot and great STAB attacks allowing it to break down walls like Galarian Corsola, Tangela, and Vullaby. Morgrem's typing also allows it to set up on threats like Hattrem and Duosion, while its middling Speed takes advantage of slower threats like Machoke, Fraxure, and Lampent with its STAB attacks. Sucker Punch enables Morgrem to OHKO faster attackers like Abra and Gastly that otherwise easily get rid of Morgrem with their coverage. Burning Jealousy is also an option to better handle Steel- and Grass-types like Klang, Ferroseed, and Roselia. Morgrem's double resistance to Dark-type attacks allows it to be a good switch-in to Knock Off, which in turn offers an opportunity to steal the Eviolite off checks like Clefairy and Mareanie thanks to Pickpocket.</p> <p>While Morgrem can be a great wallbreaker, it is very reliant on Nasty Plot and therefore takes up a turn or two before fulfilling its role completely. Morgrem has trouble breaking specially defensive walls like Mareanie, Clefairy, and Klang, so use strong physical attackers like Piloswine and Raboot to prevent these walls from blocking Morgrem. Knock Off support from users like Gurdurr, Vullaby, and Thwackey is also recommended, as they enable Morgrem to sweep without depending as much on Nasty Plot. Entry hazard setters like Koffing, Ferroseed, and Piloswine are additionally great partners, as their hazards inflict status or chip down opposing Pokemon for Morgrem's sweep. Morgrem falls into a Speed tier where it gets easily get revenge killed by faster attackers that can tank Sucker Punch, so having a Sticky Web setter like Charjabug is appreciated; furthermore, Charjabug also safely switches Morgrem in with Volt Switch to punish Machoke and Hattrem.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 355753, "username": "Eris"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 226429, "username": "Jett"}, {"user_id": 231074, "username": "S1nn0hC0nfirm3d"}]}, {"name": "Grammar checked by", "members": [{"user_id": 216033, "username": "Winry"}, {"user_id": 240732, "username": "Astra"}]}]}
  },
  "Drakloak": {
    "comments": "<h3>Other Options</h3> <p>By utilizing Hex and status options in Thunder Wave and Will-O-Wisp, Drakloak functions as a check to mutliple offensive attackers like Thwackey and Raboot. Substitute sets may also take advantage of these status moves along with Disable to wall Pokemon that only have one worthwhile attack against Drakloak like Gurdurr. Physical sets take advantage of Drakloak's better Attack compared to its Special Attack at the cost of less utility and generally worse coverage.</p> <h3>Checks and Counters</h3> <p><strong>Special Walls</strong>: Pokemon with good special bulk like Clefairy, Roselia, and Togetic wall out Drakloak's attacks. Other special walls like Klang, Ferroseed, and Roselia can take most hits from Drakloak, but struggle switching into Fire Blast.</p> <p><strong>Dark-types</strong>: Vullaby and Morgrem use their bulk and resistances to take out Drakloak. Faster Dark-types like Toxic Orb Galarian Linoone and Choice Scarf Krokorok can OHKO Drakloak with Knock Off.</p> <p><strong>Tanks</strong>: Drakloak is generally weak, which makes it lose trades against tanks like Gurdurr, Machoke, and especially Piloswine with its priority in Ice Shard.</p> <p><strong>Revenge Killers</strong>: While Drakloak is naturally fast, it can be revenge killed by Choice Scarf users like Gastly and Krokorok as well as priority from Piloswine.</p>",
    "sets": {
      "Fast Utility": {
        "description": "<p>Hex Drakloak functions as an offensive pivot in the NFE metagame where its aim is to spread status in Will-O-Wisp or Thunder Wave to threats like Thwackey and Raboot, crippling their damage output or Speed. Hex in combination with these allows walls like Galarian Corsola and Mareanie to be broken down easily, and U-turn gives Drakloak the opportunity to pivot out of the field to generate momentum or when threats are not yet in range of its attacks. Fire Blast enables Drakloak to force out Steel-types like Ferroseed that may try to switch into Drakloak and take advantage of it by setting hazards up. Draco Meteor, on the other hand, can be used to output strong damage against the general metagame as well as to hit Pokemon that resist Hex or are immune to the status of choice like Galarian Linoone, Electabuzz, and Piloswine. Infiltrator enables Drakloak to bypass Substitute users like Lampent whilst also ignoring Light Screen and Aurora Veil.</p> <p>Holding the second highest Speed in the metagame, Drakloak enjoys being paired with other pivots like Thwackey, Electabuzz, and Raboot that value momentum and take advantage of statused threats. Slow Pokemon like Gurdurr and Piloswine really benefit from this, as the spread of paralysis allows them to outspeed the general metagame and impose a better offensive presence. Drakloak's biggest downfall is its low damage output, especially against threats that have not been inflicted with status yet, so having multiple Knock Off and Toxic users like Ferroseed, Thwackey, and Mareanie is beneficial to Drakloak, as they allow it to click Hex more liberally. Drakloak isn't particularly bulky either and lacks recovery, which endorses entry hazard damage as one of its downfalls. As such, having Wish passers like Clefairy or Healing Wish users like Hattrem is a good way to keep Drakloak's longevity intact, especially as Hattrem can prevent entry hazards from being set and has a good matchup against Stealth Rock setters like Piloswine that can easily beat Drakloak. In return, Drakloak can paralyze Vullaby, which easily switches into Hattrem, and limit its ability to use Roost.</p>"
      },
      "Choice Specs": {
        "description": "<p>The main appeal of Drakloak is its impressive Speed that puts it above the entire unboosted metagame barring Electabuzz. As a result, Drakloak will almost always be able to move first and thus can act as a revenge killer and wallbreaker at the same time. Choice Specs boosts its mediocre Special Attack to acceptable levels and turns Draco Meteor into a powerful attack able to take out weakened foes and punch holes through would-be switch-ins such as Piloswine, Galarian Linoone, and Machoke. Shadow Ball is a more spammable STAB move and targets notable threats including Galarian Corsola, Duosion, and Hattrem. Fire Blast is Drakloak's best option against Ferroseed and Klang, which otherwise fear little from it. Finally, U-turn eases prediction and allows Drakloak to generate momentum by pivoting into the appropriate teammate depending on the opponent's play. Infiltrator and Clear Body are both useful abilities and the choice between them depends on your preference. The former offers security against Substitute users such as Lampent and screens-based offense teams, whereas the latter improves Drakloak's match up against Sticky Web teams and allows it to play aggressively by switching in against a predicted Mystical Fire or Parting Shot from Hattrem or Galarian Linoone, respectively.</p> <p>Use Drakloak as a revenge killer. It is particularly recommended to choose it if your team desperately needs speed control, particularly from a Pokemon that can pressure faster Pokemon like Thwackey and Raboot. Take it into account if you also want a way of breaking past Galarian Corsola and Tangela. Drakloak appreciates being paired with ways of weakening opposing Pokemon so that it has an easier time revenge killing. For that reason, Knock Off support from the likes of Gurdurr, Mareanie, and Ferroseed is very useful to get rid of Eviolites. Ferroseed can also set up Spikes, which improves Drakloak's ability to break down walls in tandem with U-turn. Conversely, Drakloak is signifigantly vulnerable to Knock Off itself, and should have partners like Trick Clefairy and Covet Roselia that can switch into this attack. Since Drakloak's Special Attack is lackluster, having another wallbreaker is recommended; in this regard, Rufflet, Choice Specs Roselia, and Choice Band Raboot are excellent choices.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 355753, "username": "Eris"}, {"user_id": 286018, "username": "Ktütverde"}, {"user_id": 226429, "username": "Jett"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 355753, "username": "Eris"}, {"user_id": 231074, "username": "S1nn0hC0nfirm3d"}, {"user_id": 407249, "username": "Greybaum"}]}, {"name": "Grammar checked by", "members": [{"user_id": 241023, "username": "dhelmise"}, {"user_id": 302985, "username": "lotiasite"}]}]}
  }
}