{
  "Weezing-Galar": {
    "comments": "<h1>Other Options</h1> <p>Taunt can be used to entirely shut down entry hazard attempts from Hippowdon, Swampert and Skarmory, but Galarian Weezing gets more benefit from Will-O-Wisp and Flamethrower. Toxic Spikes may be used to bother Pokemon like Mega Altaria, Swampert, and Krookodile; however, the prevalence of Steel-types, ungrounded Pokemon, and Heavy-Duty Boots users makes this a questionable option. Nihilego is also a much better Toxic Spikes user, as it is much less passive and pressures common Defoggers like Salamence better. Aromatherapy provides another layer of support, but Will-O-Wisp and Flamethrower make Galarian Weezing a lot less passive. Corrosive Gas can punish common switch-ins such as Celesteela and Aegislash, but, much like Aromatherapy, it is hard to fit.</p> <h1>Checks and Counters</h1> <p><strong>Steel-types: Aegislash, Scizor, and Cobalion heavily threaten Galarian Weezing with their STAB moves. They neither want to switch into Flamethrower nor be burnt by Will-O-Wisp, however.</p> <p><strong>Psychic-types: Slowking, Galarian Slowbro, Azelf, Reuniclus, and Necrozma pressure Galarian Weezing with their STAB attacks. They also do not care much about being burnt, and Galarian Slowbro further cannot be poisoned. Future Sight from it and Slowking also prevents Galarian Weezing from checking physical wallbreakers such as Buzzwole, Mienshao, and Krookodile.</p> <p><strong>Strong Special Attackers: Aegislash, Nihilego, Moltres, and Rotom-H can survive Galarian Weezing's attacks and consistently force it. Bar Nihilego, however, they must be careful of status from one of Sludge Bomb or Will-O-Wisp.</p> ",
    "sets": [
      {
        "name": "Defensive",
        "description": "<p>Galarian Weezing's solid physical bulk, unique typing, and great utility options make it a sufficient defensive Pokemon, perfectly capable of checking a myriad of Fighting-, Dark-, Fairy-, and Grass-type Pokemon such as Buzzwole, Mienshao, Krookodile, Mega Altaria, and Zarude. Levitate additionally allows Galarian Weezing to switch into Ground-type foes and attacks like Swampert, Hippowdon, and Mega Altaria's and Salamence's Earthquakes, as well as avoiding Spikes damage. However, its lack of reliable recovery leaves it worn down easily. Its low special bulk also leaves it at the mercy of powerful special attackers like Aegislash, Nihilego, Moltres, and Rotom-H. Galarian Weezing also faces harsh competition from other defensive Poison-types such as Amoonguss and Galarian Slowbro, which have Regenerator and more offensive support options like Spore and Future Sight, respectively. Pain Split gives recovery but, while it works better due to Galarian Weezing's low HP stat, it is still unreliable. Galarian Weezing makes solid use of Defog because it can check Rhyperior, Krookodile, and Hippowdon, preventing them from reliably keeping up Stealth Rock. Will-O-Wisp cripples physical threats like Mega Altaria, Zarude, Buzzwole, and Rhyperior. Flamethrower is an alternative option to hit Steel-type Pokemon such as Scizor, Aegislash, and Skarmory, allowing Galarian Weezing to consistently keep the latter's Spikes off the field. Black Sludge is useful to compensate for Pain Split's unreliability. Rocky Helmet may be used to double down on chipping physical attackers like Mega Altaria, Zeraora, Swampert, and Buzzwole, but it makes Galarian Weezing even easier to wear down.</p> <p>Galarian Weezing fits best on balance teams, which appreciate its role compression of checking Dark-, Fighting-, and Grass-type Pokemon alongside removing entry hazards. Steel-type Pokemon such as Scizor, Aegislash, and Celesteela take Psychic-type attacks from Pokemon such as Galarian Slowbro, Azelf, and Reuniclus, and in return, Galarian Weezing handles Fighting-types like Buzzwole and Mienshao. They also check Nihilego, one of Galarian Weezing's best checks and one of the few Stealth Rock setters it cannot use Defog against. Dark-types such as Zarude and Krookodile also pressure Psychic-types, and they benefit similarly from Galarian Weezing checking the aforementioned Fighting-types. The aforementioned Celesteela, as well as other specially bulky Pokemon such as Hippowdon, Slowking, and Assault Vest Tangrowth, helps Galarian Weezing take on special attackers such as Aegislash, Nihilego, and Moltres. Slowking in particular likes Galarian Weezing handling Zarude and Krookodile for it. Fire-types such as Moltres, Rotom-H, and Volcanion help take care of Steel-types like Celesteela, Aegislash, and Scizor, especially if Galarian Weezing lacks Flamethrower, and it handles Ground-types like Swampert, Rhyperior, Hippowdon, and Krookodile for them.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 535121, "username": "Pubo"}, {"user_id": 546157, "username": "Arishem"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}], "writtenBy": [{"user_id": 508532, "username": "TheShowdownHoedown"}]}
  },
  "Moltres": {"sets": [{"name": "Offensive"}]},
  "Azumarill": {
    "comments": "<h1>Other Options</h1> <p>An Assault Vest set with the same moves as the Choice Band set makes Azumarill a tank that can repeatedly check special attackers such as Keldeo. However, it lacks the wallbreaking power of Choice Band or Belly Drum Azumarill. A Sap Sipper set with Whirlpool, Protect, and Perish Song may be used to check some Grass-types such as Zarude that Azumarill normally cannot beat, as well as trapping and eliminating certain defensive Pokemon, but it is far less consistent than Huge Power Azumarill. SubToxic Aegislash is a good partner for Perish Song Azumarill that appreciates the removal of Zarude.</p> <h1>Checks and Counters</h1> <p><strong>Grass-types: Grass-type Pokemon such as Zarude, Amoonguss, Tangrowth, and Roserade resist Aqua Jet and can KO Azumarill with their STAB attacks. However, Amoonguss and Tangrowth cannot stomach Belly Drum Azumarill's Play Rough or Knock Off, while Roserade must remain healthy to take +6 Aqua Jet.</p> <p><strong>Electric-types: While they generally cannot switch into Azumarill, Electric-types such as Zeraora, Mega Manectric, and Rotom-W can easily revenge kill Azumarill with a STAB move or use Volt Switch to gain momentum as Azumarill is forced out. Rotom-W can even take a boosted Aqua Jet if healthy, but Volt Switch is commonly its only Electric-type attack, meaning it usually lacks the option to stay in after KOing Azumarill.</p> <p><strong>Volcanion: Volcanion deserves special mention among counters, as it outspeeds Azumarill, is immune to Water, and resists Fairy. It can either threaten a burn with Steam Eruption or deal serious damage with Sludge Bomb.</p> <p><strong>Faster Water-resistant Pokemon:</strong> Faster Pokemon that resist Water, such as Mega Altaria and Urshifu-R, can generally take a boosted Aqua Jet if healthy and retaliate.</p> <p><strong>Physically Bulky Pokemon: Some Pokemon with exceptional physical bulk, such as Mega Aggron and Mega Steelix, can survive any hit at full health from Azumarill and proceed to revenge kill it</p> ",
    "sets": [
      {
        "name": "Belly Drum",
        "description": "<p>Courtesy of Huge Power doubling its Attack and priority Aqua Jet, Belly Drum Azumarill is a monstrous offensive powerhouse that is capable of flattening weakened teams with only a single turn of setup. After a Belly Drum, Aqua Jet blows through most fast targets that do not resist it, with only healthy, physically bulky Pokemon such as Buzzwole and Cobalion surviving. Even unboosted, Azumarill's Aqua Jet helps hyper offense teams keep threats such as Meteor Beam Nihilego and Terrakion in check, while its typing enables it to check Urshifu-R for them. Play Rough and Knock Off afford Azumarill coverage and immense wallbreaking ability, and they will demolish slower targets that resist Aqua Jet, with the former OHKOing Tangrowth at +6 and the latter OHKOing Amoonguss. Normalium Z is the preferred item so Azumarill can set up via Z-Belly Drum no matter its health, provided it can survive the turn at half health. However, if your team already has another Z-Move user, Sitrus Berry may also be used. The 4 HP EVs are particularly important with Sitrus Berry to ensure it activates after a Belly Drum. A Jolly nature may be considered to outspeed Pokemon invested to outspeed Adamant Azumarill, such as Seismitoad, but the loss in power generally makes it suboptimal.</p> <p>Belly Drum Azumarill often finds itself on hyper offense teams, which appreciate it wallbreaking early-game for a teammate and cleaning late-game. Belly Drum Azumarill greatly appreciates entry hazard support to secure OHKOs at +6, such as against Celesteela, so teammates such as Deoxys-D and lead Azelf should be considered. Galarian Moltres is a good partner for Azumarill, as it can handle some of the Grass-types such as Zarude that Azumarill can struggle with. Azumarill and Fire Blast Mega Altaria can weaken and break down each other's checks, such as Skarmory, Celesteela, and Aegislash. Mega Altaria provides resistances to Grass and Electric and can also deal with Zarude. Swords Dance Bisharp is another hyper offense staple that synergizes well with Azumarill. Often Azumarill can KO or set up on the Fighting-type Pokemon that check Bisharp, especially a Keldeo locked into Secret Sword. In return, Bisharp can set up on a Choice Band Scizor that just locked itself into Bullet Punch to revenge kill Azumarill. Finally, Bisharp can use its boosted Sucker Punch to weaken Urshifu-R into +6 Aqua Jet range. Partners that can weaken other fast Water-resistant Pokemon such as Zarude and Rotom-W into +6 Aqua Jet range, such as Bulk Up Zeraora, are greatly appreciated as well.</p> "
      },
      {
        "name": "Choice Band",
        "description": "<p>Choice Band Azumarill forgoes sweeping potential for immediate wallbreaking power. Due to its perfect accuracy, Liquidation is the main move, and it slams almost anything that does not resist it for massive damage. Choice Band Azumarill also wields an incredibly strong Aqua Jet that can revenge kill Nihilego, as well as chipped frail Pokemon such as Mienshao and Azelf. Choice Band-boosted Aqua Jet can also clean up late-game. This powerful priority is one selling point of Azumarill that differentiates it from competing Water-type wallbreakers such as Keldeo, Primarina, and Urshifu-R. However, generally, these faster competitors are easier to fit onto a team. Play Rough is Azumarill's strongest move and pummels many Pokemon resistant to Water, such as Tangrowth, Mega Altaria, and Rotom-W. Play Rough also strongly discourages Fairy-weak Pokemon like Salamence and Rocky Helmet Buzzwole from switching in and absorbing Liquidation. Knock Off provides good coverage alongside Play Rough against targets such as Slowking, Galarian Slowbro, and Aegislash, and aids progress against the enemy team by removing the target's item. However, Ice Punch can be used instead to 2HKO Amoonguss and slightly chipped Tangrowth. An Adamant nature is preferred, as it enables Azumarill to almost always 2HKO Skarmory with Stealth Rock up.</p> <p>Choice Band Azumarill often slots best on offense and bulky offense teams, particularly those with pivot support to enable it to hit the field many times and launch its powerful attacks. Therefore, pivots in Scizor, Mega Manectric, and Zeraora may be good teammates. Scizor also helps against Zarude, which forces Azumarill out, and may lure in Pokemon that punish U-Turn like Flame Body Moltres, which Azumarill can exploit. Zeraora provides a valuable Electric immunity to help patch up Azumarill's Electric weakness, especially against Volt Switch users such as Rotom-W and opposing Mega Manectric. In return, Azumarill greatly helps against bulky Ground-types like Hippowdon that would usually annoy Zeraora. Mega Manectric may lure in and destroy bulky Grass-types like Tangrowth and Amoonguss, which especially helps if Azumarill is not running Ice Punch. Moltres is another pivot that can deal with them, so it can be considered too. Moltres often lures in Rock-types such as Nihilego and Rhyperior, as well, which Azumarill can take advantage of. Swampert can check the Electric-types that attempt to revenge kill Azumarill, such as Zeraora and Mega Manectric, as well as provide momentum with Flip Turn.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 535121, "username": "Pubo"}, {"user_id": 546157, "username": "Arishem"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}], "writtenBy": [{"user_id": 272785, "username": "nimzowitsch"}]}
  },
  "Slowking": {
    "comments": "<h1>Other Options</h1> <p>Colbur Berry allows Slowking to pivot out of Dark-types while also patching up its vulnerability to Pursuit and Knock Off, but it is very matchup reliant overall, and letting hazards undermine its pivoting capabilities is generally not a worthwhile trade-off. Toxic can be used to cripple other support Pokemon and walls like Rotom-W and Assault Vest Reuniclus, but it is hard to fit due to the importance of Slowking's other moves.</p> <h1>Checks and Counters</h1> <p><strong>Dark-types: Zarude resists Scald, easily OHKOes Slowking with Power Whip, and can even heal off status with Jungle Healing. Bisharp and Krookodile can even Pursuit trap Slowking in addition to threatening it with STAB Knock Off, although both should be wary of a potential Scald burn.</p> <p><strong>Grass-types: Grass-types like Amoonguss, Tangrowth and Roserade can often come in on Slowking to make progress because Slowking can't directly threaten them with anything, barring Thunder Wave on Roserade. Most notably, these Grass-types scare it with the possibility of landing Sleep moves on it, poisoning it with Sludge Bomb, or using Knock Off in Tangrowth's case. Roserade can also freely set up Spikes or 2HKO Slowking with Life Orb Giga Drain. However, none of these Pokemon barring Assault Vest Tangrowth should be taking Future Sight.</p> <p><strong>Electric-types: Electric-types such as Zeraora and Mega Manectric threaten Slowking with their respective STAB moves or break it down with pivoting moves. However, both fear Scald burns when switching into it.</p> <p><strong>Bug-types: While they must be careful around Scald, Bug-types such as Scizor and Buzzwole can threaten to OHKO Slowking with their STAB moves if given the opportunity. Scizor commonly running U-turn even allows it to pivot out as Slowking switches to preserve momentum, while having access to Pursuit means that it can also land significant damage as Slowking switches.</p> <p><strong>Physical Wallbreakers: Pokemon like Dragon Dance Mega Altaria and Salamence can take advantage of Slowking's mediocre Defense stat to overpower it with boosted attacks, while others such as offensive Scizor, Bisharp and Tapu Bulu, can even do so without needing to set up. However, none of these Pokemon appreciate a burn from Scald or paralysis from Thunder Wave.</p> <p><strong>Aegislash: Aegislash is easily able to threaten Slowking with Ghost-type STAB moves or use it as setup fodder, with Scald unable to break a Substitute from Substitute + Toxic sets. The more offensive variants of Aegislash such as Spell Tag and Swords Dance need to watch out for a burn or Thunder Wave while trying to take advantage of Slowking, however.</p> <p><strong>Passive Damage</strong>: Even with Regenerator, Toxic forces Slowking to use Slack Off more and is also common on Pokemon that it checks or tries to gain momentum on, like Hippowdon and defensive Moltres. Knock Off users like Nihilego, Tangrowth and Deoxys-D can limit the number of Pokemon Slowking can switch into regularly with hazards up.</p> ",
    "sets": [
      {
        "name": "Defensive Pivot",
        "description": "<p>Thanks to its great special bulk, good defensive typing, and access to Regenerator, Slowking can consistently pivot into and check several dangerous special attackers such as Choice Specs Primarina, offensive Moltres, and Defog Salamence. This is very useful for easing the burden on its team to play around these threats throughout the game. Scald, besides being a STAB attack, has a burn chance to stop Dark-types such as Bisharp and Krookodile from getting too comfortable in attempting to Pursuit trap Slowking. It also potentially cripples other Pokemon like Scizor and Aegislash, which may try to exploit its passivity. Thunder Wave expands its defensive versatility against Pokemon like Meteor Beam Celesteela and Nihilego, which may try to set up on it. Crippling them saves Slowking from constantly relying on bringing another teammate in against them, which requires Teleport to do safely; and thus risking a foe attack. Future Sight can be used in conjunction with Teleport to build up momentum for its offensive teammates like Urshifu-R and Zeraora, and create advantageous scenarios for them by pressuring their usual checks such as physically defensive Tangrowth and Buzzwole. Heavy-Duty Boots lets it pivot without damage from entry hazards. The given EV spread allows Slowking to survive a Knock Off from non-Choice Band Krookodile while maximizing its special bulk and HP gained from Regenerator. A Sassy nature and 0 Speed IVs maximize the odds of Teleport going last in mirror matches. A physically defensive spread can be used to help Slowking's team pivot around Mienshao and Urshifu-R more effectively, but Slowking's weakness to Pursuit and common coverage moves from these Pokemon, like Knock Off and U-turn, prevent it from doing this consistently.</p> <p>Slowking easily bringing in strong wallbreakers and scouting the Pokemon it can switch into is highly important to various forms of offense and bulky offense. Wallbreakers such as Urshifu-R, and Bisharp enjoy the free entry from Teleport making up for their defensive shortcomings, in addition to Future Sight dissuading checks like Amoonguss and Buzzwole from switching in. Similarly grateful are the late-game cleaners commonly supporting these Pokemon like Dragon Dance Mega Altaria, Swords Dance Scizor, and Bulk Up Zeraora. Slowking is very weak to Dark- and Bug-type attackers in Scizor, Zarude and Krookodile, so Pokemon that can cover them like Skarmory, Buzzwole, and Galarian Weezing make for good choices, and they appreciate Slowking's ability to switch into Fire-, Flying-, and Psychic-type attacks respectively. Skarmory is especially notable, as its Spikes and phazing combine with Slowking's Future Sight to rack up chip damage on Pokemon that need to stay healthy, like Mega Aggron and Swampert. Amoonguss and Tangrowth can form nice Regenerator cores with Slowking and provide coverage against Electric- and Grass-types such as Zeraora, Mega Manectric, and Tapu Bulu. Fire-types like Moltres and Rotom-H can threaten Grass-types while appreciating Slowking switching into Water-types like Primarina and Keldeo. Finally, Slowking's initial passivity may leave it susceptible to getting overwhelmed by some of the Pokemon it is supposed to check, so a backup defensive teammate like Rotom-H that can take advantage of the moves Slowking forces Pokemon to lock into, such as Hurricane from Moltres or Moonblast from Primarina, can help.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 282732, "username": "Niadev"}, {"user_id": 535121, "username": "Pubo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}], "writtenBy": [{"user_id": 546157, "username": "Arishem"}]}
  },
  "Scizor": {
    "comments": "<h1>Other Options</h1> <p>Choice Band propels Scizor's naturally high Attack stat to obscene levels, with boosted Knock Off and U-turn being very threatening against unprepared teams, and Choice Band Bullet Punch can devastate common offensive Pokemon like Dragon Dance Mega Altaria and Salamence. Such a set can also use Pursuit to trap and weaken Pokemon such as Nihilego and Slowking for teammates such as offensive Moltres to take advantage of.</p> <p>Defog can be used over Swords Dance on the defensive set, as Scizor is a decent Defogger. However, Defog makes it more passive and sacrifices its versatility, locking it into being a defensive glue Pokemon. Buginium Z on bulky sets can be used to let Scizor lure in and KO certain switch-ins like Amoonguss, Rotom-W, and Bisharp after a boost. Protective Pads is also a very good item, bypassing Rocky Helmet and Flame Body from Skarmory and Moltres, respectively, but it is situational.</p> <h1>Checks and Counters</h1> <p><strong>Fire-type Pokemon and Coverage: Fire-types such as Moltres, Rotom-H, and Volcanion completely shut down Scizor, as they resist both of its STAB attacks and can OHKO it in return. However, if they lose their Heavy-Duty Boots to Knock Off, they may struggle to consistently handle it with Stealth Rock up. Scizor also fears Fire-type coverage from Pokemon such as Mega Altaria and Hatterene. It normally takes advantage of both, but Fire-type coverage can potentially KO it for getting too careless.</p> <p><strong>Flying-type Pokemon: Skarmory's and Celesteela's great typing and Salamence's Intimidate completely shut down Scizor offensively, with all three taking any attack comfortably. Skarmory can set up Spikes, punish it thanks to Rocky Helmet, and use it as setup fodder thanks to Iron Defense and Body Press. While Celesteela isn’t as annoying, it can OHKO Scizor with Flamethrower and use Leech Seed on the switch. Finally, Salamence can threaten Scizor with Flamethrower. However ,Salamence and Celesteela must be wary of Knock Off, which makes them less reliable overall.</p> <p><strong>Residual Damage and Burn: Scizor hates taking chip damage from Rocky Helmet users like Buzzwole and burns from Pokemon like Moltres, which can force it to use Roost more often. Burn is especially annoying because a weakened Bullet Punch makes it more difficult for Scizor to check Pokemon like Mega Altaria and Nihilego.</p> <p><strong>Water-types: Water-types such as Urshifu-R, Rotom-W, and Jellicent are very good checks to Scizor. Urshifu-R resists both of Scizor's STAB moves and forces it out, while Rotom-W and Jellicent can burn it with Will-O-Wisp, preventing it from safely setting up. However, they all don't like Knock Off.</p> <p><strong>Electric-types: Electric-types such as Zeraora and Mega Manectric can outspeed and threaten Scizor, OHKOing it with Overheat in the latter's case, while resisting Bullet Punch.</p> <p><strong>Steel-types: Steel-types such as Bisharp and Cobalion resist both of Scizor's STAB moves. Both can also use it as setup fodder. Cobalion in particular can be very threatening if Scizor lacks U-turn because Justified punishes Knock Off. However, neither of them appreciate losing their item, and they must be wary of Superpower.</p> ",
    "sets": [
      {
        "name": "Bulky Swords Dance",
        "description": "<p>Due to its good typing, solid bulk, and strong priority move, Scizor plays both defensive and offensive roles by checking and setting up on dangerous Pokemon such as Mega Altaria, Nihilego, and Tapu Bulu. It also sets up on a lot of passive Pokemon like Tangrowth lacking Hidden Power Fire and Hippowdon. These setup opportunities, in conjunction with Bullet Punch, make it very threatening late-game when its checks are weakened. Bullet Punch gives good damage while revenge killing faster threats, such as Terrakion and Nihilego, and pressuring Fairy-types such as Mega Altaria and Hatterene. Roost gives Scizor some much-needed staying power, which helps it set up and check Pokemon like Aegislash and Mega Altaria more often. Knock Off is a great utility move, removing important items like Moltres's Heavy-Duty Boots and Skarmory's Rocky Helmet, and allows Scizor to threaten Aegislash. On the other hand, U-turn takes advantage of the many switches Scizor forces against Pokemon such as Zarude and Tangrowth, preserving momentum. U-turn can bring in partners like Volcanion and Rotom-H on Scizor's checks, such as Skarmory and Celesteela. Heavy-Duty Boots and Leftovers are comparably effective at keeping Scizor healthy. The given EV spread lets Scizor avoid a 2HKO from Krookodile's Earthquake, outspeed uninvested Alomomola, and, with the Adamant nature, always OHKO Nihilego with Bullet Punch after Stealth Rock damage.</p> <p>This Scizor set fits best on offense and bulky offense teams, acting as defensive glue and a threatening late-game cleaner. Stealth Rock helps Scizor pressure its checks, especially when used alongside Knock Off to remove opposing Heavy-Duty Boots and Leftovers. Thus, Pokemon such as Swampert, Rhyperior, and Seismitoad have good synergy with Scizor, and they can all deal with Fire-type Pokemon, while Scizor is able to pressure Grass-type Pokemon like Tangrowth and Amoonguss for them. Some Fire-type answer is mandatory, as Scizor will struggle to beat Pokemon like Moltres, so Primarina, Rotom-H, and Rotom-W are also very good partners. If Scizor has U-turn, wallbreakers like Choice Specs Primarina and Terrakion appreciate the safe entry on Pokemon such as Salamence, Skarmory, and Moltres. Strong pivots like Urshifu-R and Mega Manectric can also form a VoltTurn core with Scizor, pressuring major roadblocks to it like Skarmory and Moltres, while Scizor can pressure Mega Altaria and Salamence for them in return. Aegislash is also an interesting partner, as it can cripple shared checks such as Moltres with Toxic.</p> "
      },
      {
        "name": "Offensive Swords Dance",
        "description": "<p>This offensive set makes Scizor a very powerful wallbreaker or scary cleaner. Even without bulk investment, Scizor's good natural bulk and excellent defensive typing let it soft check a plethora of dangerous threats to hyper offense, such as Mega Altaria and Nihilego, as well as giving it multiple opportunities to set up. Bullet Punch deals a lot of damage against Pokemon that don't resist as well as patching up Scizor's middling Speed stat. Superpower allows Scizor to hurt Steel-types, such as Cobalion and Celesteela. Knock Off hits Aegislash and Slowking while pressuring Pokemon like Celesteela and Skarmory by removing their item. Quick Attack might seem underpowered as a secondary option, but it's a very good one nonetheless, as lets Scizor finish off weakened Steel-resistant Pokemon such as Urshifu-R, Keldeo, and Rotom-H. Dual Wingbeat can also be used in the last moveslot to threaten Pokemon that withstand its other moves like Amoonguss, Tangrowth, and Buzzwole. Life Orb allows Scizor to get some crucial KOs, notably allowing +2 Superpower to OHKO specially defensive Swampert and OHKO specially defensive Celesteela after Stealth Rock.</p> <p>This Scizor set fits best on hyper offense teams, as they can provide the support it needs. Entry hazard support is mandatory to help Scizor grab more KOs, such as the specially defensive Celesteela example above, so a suicide lead like Azelf or Krookodile makes a good teammate. Scizor also appreciates Pokemon that share checks with it, as, together, they can easily wear down the checks or even nail them with specialized lure options. Dragon Dance Salamence, and for example, can run Fire Blast to pressure Steel-types like Skarmory and Celesteela, which normally check both it and Scizor. Salamence can also deal with Fire-type Pokemon that even Quick Attack Scizor struggles to beat. In the same way, Necrozma can also lure in Steel-types thanks to Heat Wave. Dual screens support helps Scizor set up, making Grimmsnarl a good teammate. Azumarill has particularly great type synergy with Scizor, as Scizor can beat Grass-type Pokemon that Azumarill struggles against like Roserade and Tapu Bulu, while Azumarill can deal with Fire-type Pokemon like Moltres and Chandelure in return. Finally, Scizor appreciates other Pokemon that are able to deal with or weaken its common checks in Moltres and Skarmory, for example Meteor Beam Celesteela and Meteor Beam Nihilego.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 535121, "username": "Pubo"}, {"user_id": 546157, "username": "Arishem"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}], "writtenBy": [{"user_id": 515767, "username": "Ryuji-Sempai"}]}
  },
  "Skarmory": {
    "comments": "<h1>Other Options</h1> <p>Skarmory has access to a variety of utility moves. Iron Defense + Body Press can let it be a bulky wincon and better handle Bisharp and Scizor, but it's very vulnerable to special attackers and gives Aegislash a free switch in. If the team lacks a user, Stealth Rock can be used alongside Spikes, compressing both entry hazards in one Pokemon. Safety Goggles can be used to block powder moves like Spore from Amoonguss and Sleep Powder from Roserade to easily set Spikes against them.</p> <h1>Checks and Counters</h1> <p><strong>Fire-type Pokemon and Coverage: Moltres and Rotom-H can easily switch in and KO Skarmory with their Fire-type STAB moves. However, said Pokemon don't appreciate Toxic. Fire-type coverage from Pokemon that Skarmory is supposed to check like Mega Altaria and Salamence also threatens it greatly due to its low Special Defense.</p> <p><strong>Electric-types: Rotom-W, Rotom-H, Zeraora, and Mega Manectric can force out Skarmory with their STAB moves or generate momentum with Volt Switch. The former two can even remove Skarmory's Spikes with Defog or cripple it with Will-O-Wisp, negating its Sturdy.</p> <p><strong>Special Attackers: Due to Skarmory's low Special Defense, powerful special attackers like Primarina, Aegislash, and Volcanion can force it out or even KO it with ease.</p> <p><strong>Taunt and Magic Bounce Users: Taunt users such as Deoxys-D and Krookodile and Magic Bounce Hatterene completely deny Skarmory's Spikes. The former two can even set their own entry hazards, while Hatterene can use it as setup fodder. However, Krookodile should be aware of Body Press and Deoxys-D hates getting poisoned. Protective Pads Urshifu-R can use also use Taunt to prevent Skarmory from using Roost, potentially securing a win late-game.</p> ",
    "sets": [
      {
        "name": "Defensive",
        "description": "<p>Skarmory's great Defense stat, reliable recovery in Roost, and amazing defensive typing let it consistently check physical attackers like Scizor and Mega Altaria. Since Skarmory forces out a lot of common threats, it can easily use those turns to set Spikes to wear down defensive Pokemon such as Aegislash, Scizor, Amoonguss, and Tangrowth, paving the way for a late-game sweeper like Mega Altaria. Whirlwind forces out setup sweepers like Mega Altaria, Scizor, and Bulk Up Zarude. It also synergizes well with Spikes by forcing chip damage on switch-ins like Mega Manectric and Aegislash. Toxic is a solid alternative to Whirlwind, reducing the amount of times Defoggers such as Rotom-W, Moltres, and Salamence can safely use Defog. Body Press makes use of Skarmory's excellent Defense by threatening Zarude and Bisharp. Alternatively, Brave Bird is an option to immediately threaten Pokemon like Amoonguss and Urshifu-R. Rocky Helmet punishes U-turn attempts from Urshifu-R lacking Protective Pads, Scizor, and Zarude, being especially useful at deterring the former's Surging Strikes.</p> <p>Skarmory fits best on balance and bulky offense teams as a solid check to physical attackers and a Spiker with Whirlwind to help Pokemon such as Urshifu-R wallbreak. Hippowdon is an amazing partner, as its Stealth Rock lets them form a great entry hazard-stacking core, especially since Hippowdon can consistently deal with and wear down Defoggers that threaten Skarmory like Rotom-H and Moltres with sand and Toxic. Hippowdon can also check Electric-types such as Mega Manectric for Skarmory, while the latter can easily check Grass-types like Zarude and Tapu Bulu. On more offensive structures, Swampert can perform a similar role by setting Stealth Rock and checking Fire-types, and Flip Turn also lets it safely bring Skarmory into Grass-types. However, Swampert lacks reliable recovery and gets easily worn down by status and hazards, making Hippowdon the superior choice in most cases. Grass-types like Amoonguss and Tangrowth can deal with problematic Water- and Electric-types like Primarina, Rotom-W, and Zeraora. Slowking, Rotom-W, and Moltres can deal with Fire-types that force Skarmory out like Volcanion and opposing Moltres. Since Skarmory has a poor matchup against common Defoggers such as Rotom-W and Rotom-H, Pokemon that can lure in and cripple them like Zeraora are appreciated. Zeraora can use Knock Off to remove Leftovers from Rotom-W and Heavy-Duty Boots from Rotom-H. Stallbreakers like Deoxys-D and Hatterene completely shut down Skarmory, denying its Spikes, so Dark-types that can pressure them like Bisharp are appreciated. Finally, late-game sweepers and strong wallbreakers like Urshifu-R, Primarina, and Zeraora enjoy Skarmory's Spikes constantly weakening defensive answers like Swampert, Scizor, Tangrowth, and Amoonguss, putting them in range of their attacks late-game.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 282732, "username": "Niadev"}, {"user_id": 546157, "username": "Arishem"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}], "writtenBy": [{"user_id": 535121, "username": "Pubo"}]}
  },
  "Swampert": {"sets": [{"name": "Defensive Pivot"}]},
  "Manectric": {
    "comments": "<h1>Other Options</h1> <p>Toxic may be used instead of Hidden Power to cripple both Ground-types like Swampert and Dragon-types, but it suffers from a lack of immediate damage against either.</p> <h1>Checks and Counters</h1> <p><strong>Ground-types: Ground-types block Mega Manectric's Volt Switch and threaten it with super effective damage. Hippowdon in particular is a hard counter, as Mega Manectric cannot 2HKO it and takes heavy damage from Earthquake. Other Ground-types such as Nidoking often cannot come in safely but easily OHKO Mega Manectric, while it cannot OHKO them back in return. Furthermore, Mega Manectric's Hidden Power type also determines many matchups: without Hidden Power Grass, Ground-types like Swampert stonewall Mega Manectric, while without Hidden Power Ice, Ground-types such as Gligar are hard counters.</p> <p><strong>Dragon-types: Mega Manectric without Hidden Power Ice struggles to break through certain Dragon-types, which can sometimes even use it as setup fodder. Mega Altaria resists every other relevant move Mega Manectric has, and more defensive sets aren't even 2HKOed by Hidden Power Ice. While Dragonite does not resist Thunderbolt, its Multiscale-boosted bulk makes it very difficult to overpower.</p> <p><strong>Special Walls: Special walls that don't fear Mega Manectric's STAB or coverage moves, such as Assault Vest Galarian Slowbro and Assault Vest Reuniclus, easily stall it out. However, they cannot block it from pivoting with Volt Switch.</p> <p><strong>Rotom-H: Rotom-H resists every one of Mega Manectric's moves, allowing it to freely stall Mega Manectric out or set up on it. However, Rotom-H cannot block Volt Switch.</p> <p><strong>Entry Hazards</strong>: Mega Manectric's nature as a pivot and inability to hold Heavy-Duty Boots make it very vulnerable to entry hazards wearing it down.</p> ",
    "sets": [
      {
        "name": "Offensive Pivot",
        "description": "<p>A blistering base 135 Speed, an excellent ability in Intimidate, and access to Volt Switch make Mega Manectric one of Nat Dex UU's premier offensive pivots and revenge killers. It's capable of outspeeding and KOing a plethora of common threats, from Cobalion to Moltres. Thunderbolt provides Mega Manectric with a strong STAB move that doesn't require it to switch out after using. Overheat is used as coverage against Grass-types such as Amoonguss and Roserade; however, Flamethrower can be used instead to avoid Overheat's Special Attack drop and lower accuracy. However, the lower power does lead to losing out on certain KOs, such as Zarude after Stealth Rock. Hidden Power Grass is used to hit many Ground-types for high damage, notably nailing Swampert and Rhyperior, while Hidden Power Ice targets certain other Ground-types such as Gligar, as well as Dragon-types such as Salamence. Lightning Rod allows Manectric to block opposing Volt Switches before Mega Evolving.</p> <p>Mega Manectric best fits on offense teams, notably VoltTurn teams, looking for an offensive pivot and revenge killer. Other pivots such as Scizor and Zarude form potent VoltTurn cores with Mega Manectric, as they grant each other opportunities to safely come in and threaten each other's checks. They can also serve as lures for each other, with Mega Manectric luring in Grass-types such as Zarude and Tangrowth for Scizor to deal with, for example, while Scizor and Zarude can lure in troublesome threats such as Moltres and Skarmory for Mega Manectric. The frequent switching also benefits Regenerator users such as Amoonguss. Wallbreakers such as Urshifu-R and Nidoking greatly appreciate Mega Manectric's ability to get them in easily, while in return they can break through the walls Mega Manectric struggles with, such as Assault Vest Galarian Slowbro and Hippowdon. Entry hazard removers, like Moltres and Rotom-W, can mitigate Mega Manectric's tendency to be worn down by entry hazards due to its lack of Heavy-Duty Boots. Pokemon that threaten Ground-types like Hippowdon and Gligar, such as Primarina, can fix the holes left in Mega Manectric's coverage depending on which Hidden Power type it chose. Additionally, if not running Hidden Power Ice, checks to Dragon-types like Mega Altaria, such as the aforementioned Scizor, complement Mega Manectric greatly.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 546157, "username": "Arishem"}, {"user_id": 535121, "username": "Pubo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}], "writtenBy": [{"user_id": 535530, "username": "Gangsta Spongebob"}]}
  },
  "Altaria": {"sets": [{"name": "Dragon Dance"}, {"name": "Offensive", "description": "<p>Alternate EV Spread: 248 HP / 36 Def / 124 SpA / 100 Spe</p> "}, {"name": "Utility"}, {"name": "Defensive Dragon Dance"}]},
  "Salamence": {"sets": [{"name": "Special Attacker"}, {"name": "Dragon Dance"}]},
  "Hippowdon": {"sets": [{"name": "Specially Defensive"}, {"name": "Physically Defensive"}]},
  "Rhyperior": {"sets": [{"name": "Stealth Rock"}]},
  "Tangrowth": {"sets": [{"name": "Assault Vest", "description": "<p>Alternate EV Spread: 252 HP / 56 Def / 200 SpD with a Relaxed Nature</p> "}, {"name": "Physically Defensive"}]},
  "Rotom-Heat": {"sets": [{"name": "Nasty Plot", "description": "<p>Alternate EV Spread: 248 HP / 8 Def / 252 Spe when running Pain Split</p> "}, {"name": "Defensive Pivot"}]},
  "Amoonguss": {"sets": [{"name": "Physically Defensive"}, {"name": "Specially Defensive"}]},
  "Mienshao": {"sets": [{"name": "Choice Scarf"}, {"name": "Life Orb"}]},
  "Terrakion": {"sets": [{"name": "Swords Dance"}, {"name": "Choice Band"}]},
  "Aegislash": {
    "comments": "<h1>Other Options</h1> <p>Choice Band supplies physical Aegislash some much-needed power, allowing it to 2HKO walls such as Celesteela and Galarian Moltres commonly used to check it, and such a set can slot in Pursuit to maximize Aegislash's typing and trap Pokemon such as Nihilego and Slowking. This role can open the door for other Pokemon such as offensive Moltres to thrive. However, this set is extremely susceptible to being Pursuit trapped itself and will struggle to consistently damage the likes of Intimidate users like Salamence and Krookodile, as well as Moltres due to Flame Body and Rotom-W due to Will-O-Wisp. Similarly, Choice Specs can be used over Spell Tag or Ghostium Z for the extra power boost, notably allowing Shadow Ball to 2HKO Assault Vest Tangrowth and specially defensive Hippowdon after Stealth Rock, but this set is similarly to vulnerable to Pursuit trapping and revenge killing attempts due to lacking King's Shield. Furthermore, it's often unnecessary with how Toxic is already able to wear down these targets. A bulkier Swords Dance set with Leftovers and King's Shield can also work, as this allows gives Aegislash solid defensive utility while not being checked by the same pool of Pokemon, but it has an inconsistent damage output against bulky pivots, since it is very slow, easy to exploit, and fairly weak without a boost. Lastly, Autotomize + Weakness Policy can be used to give Aegislash a shot to sweep against weaker super effective moves such as Flamethrower from Salamence, since it can then outspeed and threaten to KO Pokemon such as Krookodile and Nidoking. This set is unreliable though, since it is almost always forced to take a hit beforehand in order to try and activate its Weakness Policy, and it's still easily being KOed by Choice Scarf users such as Zarude and priority moves from the likes of Bisharp and Azumarill afterwards.</p> <h1>Checks and Counters</h1> <p><strong>Specially Defensive Steel-types: Bulky Steel-types such as defensive Celesteela and defensive Scizor are especially bothersome for most Aegislash sets, since they are immune to Toxic, don't mind most of its attacks, and can then proceed to wear down Aegislash with Flamethrower or Knock Off, respectively. However, none of these Pokemon can take boosted physical attacks reliably, and Scizor will also struggle to take repeated Shadow Balls from Spell Tag or Ghostium Z variants of Aegislash.</p> <p><strong>Dark-types: Aegislash can't do much of note against Dark-types such as Galarian Moltres, Zarude, Bisharp, and Krookodile once they get in. It often runs Close Combat to punish them for getting too careless, but they cripple or nail Aegislash in return, staying healthy with Rest or Jungle Healing in the case of the former two. Choice Band Bisharp also stands out for trapping Aegislash with Pursuit, since Defiant will counteract the Attack drop from King's Shield, making Aegislash unable to scout its move and safely switch out beforehand. Krookodile can threaten Aegislash similarly while using Taunt to shut down setup or stalling attempts, but it must also be wary of switching into Toxic or any of Aegislash's coverage moves.</p> <p><strong>Mixed Walls:</strong> Mixed walls such as Assault Vest Tangrowth, defensive Moltres, Swampert, and Gligar all have the bulk and longevity needed to hinder most Aegislash sets from consistently making progress throughout the game, since these Pokemon can also threaten to cripple or KO Aegislash in return. However, most of these Pokemon can easily be knocked into KO range by Aegislash's offensive sets with prior chip damage, and the former three will also get worn down quickly by the combination of King's Shield + Toxic.</p> <p><strong>Burn and Knock Off: Since bulkier Aegislash sets often rely on recovery from Leftovers, burn or Knock Off can severely compromise it, making it much easier to wear down with constant attacks and Stealth Rock damage. To make matters worse, these threats can also be found on Pokemon such as Slowking, Nihilego, and Deoxys-D that Aegislash is otherwise free to take advantage of, making switching in a much scarier prospect. Spell Tag variants don't like losing their item either, since they will no longer be able to 2HKO Pokemon such as Amoonguss and Scizor with Shadow Ball.</p> ",
    "sets": [
      {
        "name": "Substitute + Toxic",
        "description": "<p>Incredible base stats, an amazing defensive typing, and a nearly unresisted STAB combination make Aegislash one of the most versatile and dominant forces in the metagame. Its immense bulk in Shield forme and many resistances create crucial setup opportunities against common Pokemon such as Nihilego lacking Knock Off and Skarmory, and this moveset allows it to wear down and outlast most of its checks with ease. Substitute exploits passive Pokemon, invalidates status inducers like Scald Slowking and Spore Amoonguss, eases prediction, and racks up Toxic damage on Pokemon like Assault Vest Tangrowth and Krookodile lacking Taunt. King's Shield complements all of this by racking up Leftovers recovery and even more Toxic damage, as well as scouting potentially lethal attacks from Choice-locked foes like Primarina, Zarude, and Pursuit users such as Choice Band Scizor and Krookodile. Shadow Ball threatens the few Pokemon unaffected by Toxic, such as Skarmory and Magic Guard Reuniclus. 176 Speed EVs allow Aegislash to outrun Azumarill.</p> <p>This set's ability to force damage on some of its usual checks and other important bulky targets makes it a solid fit on team styles from balance to semi-stall. Walls such as Tangrowth and Hippowdon can use Knock Off or set up entry hazards to increase the amount of passive damage that Aegislash can spread, and they also provide extra defensive integrity against possible answers to Aegislash, like Zeraora and Krookodile. Fire-types like Moltres and Rotom-H appreciate Aegislash wearing down specially defensive Ground-types like Hippowdon, Swampert and Gastrodon, and in return, they can handle Steel-types such as Scizor and Celesteela while pivoting Aegislash into their few counters in Nihilego and Slowking. Powerful wallbreakers, such as Life Orb Buzzwole and Life Orb Mienshao, can also handle Steel-types while providing extra coverage against the offensive Pokemon that don't mind this set, like non-Choice Scarf Zarude and Bisharp. Finally, Defog support from the likes of Rotom-W, Salamence, and Volcanion improves Aegislash's longevity and gives it more chances to set up Substitutes by taking Spikes damage out of the picture. These Defoggers also appreciate Aegislash consistently wearing down bulky pivots such as Assault Vest Tangrowth and Slowking in return.</p> "
      },
      {
        "name": "Wallbreaker",
        "description": "<p>Aegislash can sacrifice some of its defensive capabilities to become a terrifying early- and mid-game wallbreaker, easily entering the battlefield against the likes of Nihilego and Deoxys-D to cause havoc. Its near-perfect coverage and offensive item allow it to power through makeshift checks in Amoonguss and Scizor commonly used to switch around Aegislash. Close Combat is used to hit Dark-types that resist Shadow Ball, preventing Pokemon like Zarude and Bisharp from taking advantage of it. Toxic cripples other Pokemon like Assault Vest Tangrowth and Moltres, putting them into range of Shadow Ball and Never-Ending Nightmare, especially because King's Shield racks up poison damage. King's Shield is additionally valuable to limit revenge killing attempts from other offensive Pokemon such as Mienshao and Krookodile. Spell Tag is the item of choice on this set, allowing Shadow Ball to 2HKO Amoonguss and bulky Scizor trying to pivot into it with negligible drawback. Alternatively, Ghostium Z gives Aegislash access to a potentially devastating Never-Ending Nightmare, outright KOing bulkier Pokemon like Hippowdon and Swampert that have already taken a Shadow Ball after Stealth Rock, However, lacking Spell Tag stops Aegislash from threatening other pivots and reaching certain benchmarks consistently, which generally makes Aegislash more unreliable as a wallbreaker. Maximum Speed investment gives Aegislash the best possible chance at beating opposing Aegislash, as well as giving it the jump on other notable targets like Gligar and Seismitoad. A Modest nature is used as to not worsen Aegislash's impressive bulk, as Close Combat still hits Dark-types for reasonable damage.</p> <p>This set excels on bulky offense and balance teams that can afford to stay on the backfoot to provide Aegislash the openings it needs to get in safely and wallbreak, and they appreciate its good matchups versus certain threats such as Deoxys-D and Nihilego. Pivots such as Moltres and Zeraora are great options to generate momentum for Aegislash, as they can also pressure checks like Assault Vest Tangrowth and Swampert with STAB moves or Knock Off, respectively, greatly limiting their ability to switch into Aegislash. This set can still struggle to break through certain specially defensive Pokemon like Celesteela and Galarian Moltres, so strong physical wallbreakers like Urshifu-R and Mamoswine are much appreciated. Stealth Rock support from the likes of Swampert and Nihilego is very useful for allowing Aegislash's Shadow Ball to 2HKO Pokemon like Amoonguss and Hippowdon. Finally, late-game cleaners such as Dragon Dance Mega Altaria and Swords Dance Scizor should be used in order to take advantage Aegislash pressuring their common roadblocks in Amoonguss and Assault Vest Tangrowth.</p> "
      },
      {
        "name": "Bulky Attacker",
        "description": "<p>Aegislash's great attacking stats and solid defensive presence allows it to act as a potent mixed attacker. This set's longevity helps it survive attacks from a huge portion of the offensive metagame when its health is managed properly, with even Pokemon like Salamence and Tapu Bulu running super effective coverage struggling to consistently wear it down unscathed. Toxic cripples Pokemon such as Salamence and Krookodile attempting to switch in and weaken it. King's Shield, besides racking up heavy Toxic damage and maximizing Leftovers recovery, scouts otherwise dangerous attacks from Choice-locked Pokemon such as Primarina and Keldeo. Shadow Ball hits popular Pokemon like opposing Aegislash, Galarian Slowbro, and Skarmory, dealing solid damage and providing great coverage against the metagame at large. Close Combat punishes Dark-types trying to pivot into Shadow Ball or Toxic, like Zarude and Bisharp. Alternatively, Flash Cannon avoids dropping Aegislash's defenses, making it less vulnerable to revenge-killing attempts, while also allowing it to deal with the likes of Mega Altaria, Terrakion and Tapu Bulu better. However, it leaves Aegislash completely blanked by Bisharp and serves little additional use. 44 Speed EVs allow Aegislash to outspeed uninvested Scizor and Alomomola.</p> <p>This set fits best on bulky offense teams, which appreciate its unique blend of defensive flexibility and offensive capability. Since Aegislash is very reliant on Leftovers recovery, teammates that can absorb Knock Off for it such as Mega Altaria and Amoonguss make for good choices. Other offensive Pokemon such as Zeraora, Urshifu-R, and Mamoswine can whittle down or remove common roadblocks to this set in Celesteela and Galarian Moltres. Zeraora is especially notable, as it shares common switch-ins with Aegislash in Assault Vest Tangrowth, Swampert, and Krookodile, and it can use Knock Off or coverage options in Grass Knot and Close Combat to force in and weaken these switch-ins for it. Defensive pivots like Moltres and Slowking let Aegislash enter the field safely, preserving its HP while appreciating its ability to check Pokemon such as Nihilego and Terrakion in return. Finally, late-game cleaners such as Choice Scarf Mienshao and Nasty Plot Azelf enjoy having Aegislash to wear down and threaten bulky Psychic-types in Deoxys-D and Reuniclus, which would normally prevent them setting up and sweeping late-game.</p> "
      },
      {
        "name": "Swords Dance",
        "description": "<p>Swords Dance Aegislash is a menacing wallbreaker and offensive terror on fast-paced teams. It can easily get going against the plethora of Pokemon that its typing allows it to safely set up on, ranging from the likes of Terrakion lacking Earthquake to Choice-locked Scizor. Due to its enormous bulk for a sweeper in Shield forme, Aegislash becomes very useful at supporting its team against dangerous revenge killers such as Nihilego and Choice Scarf Mienshao, helping to preserve the sweeping chances of other setup teammates like Meteor Beam Celesteela and Dragon Dance Mega Altaria. Shadow Claw deals good neutral damage against the majority of the tier at +2. Close Combat is Aegislash's strongest physical attack overall, gives Aegislash perfect coverage, and hits the Dark-types like Zarude and Krookodile that Shadow Claw misses out on. Shadow Sneak provides Aegislash with useful priority that stops Pokemon such as Zeraora, Azelf, and Azumarill from revenge killing it safely. Ghostium Z allows Aegislash to OHKO walls such as Hippowdon and Celesteela after a boost, somewhat making up for its terrible bulk in Blade forme by removing the need to take an attack from these Pokemon. It also KOes Pokemon like Assault Vest Tangrowth and defensive Scizor often sent to check special Aegislash sets. Air Balloon can be a very good alternative that gives Aegislash setup opportunities against Pokemon like Hippowdon and Rhyperior relying on Earthquake, although that set's lack of initial power can often leave much to be desired against other walls.</p> <p>This set can be a valuable addition to offense or hyper offense teams, providing a strong wallbreaker and setup sweeper with impeccable defensive utility against some of the archetype's biggest threats in Nihilego and Terrakion. Pivots such as Moltres, Rotom-W, and Swampert can help bring Aegislash onto the field safely, preserving its health to set up for it to take super effective hits such as Zarude's Darkest Lariat and Mega Altaria's Fire Blast in a pinch. Additional setup sweepers like Nasty Plot Rotom-H and Galarian Moltres appreciate Aegislash wearing down Pokemon such as Nihilego and Rhyperior for them to overpower late-game. Faster Pokemon that can hit Aegislash hard while not minding Shadow Sneak, such as Urshifu-R and Krookodile, are massive threats, so other offensive Pokemon like Mega Altaria and Tapu Bulu that can deal with them, make for good teammates. Both also appreciate Aegislash setting up on and wearing down shared checks in Tangrowth and Celesteela, for them to take advantage of afterwards. Tapu Bulu in particular stands out for providing Grassy Terrain, weakening Earthquakes and providing Aegislash with passive recovery to support its setup. Lastly, entry hazards can greatly benefit Aegislash; Roserade and Deoxys-D provide Spikes, and the latter alongside other options such as Nihilego and Krookodile can set up Stealth Rock. Both hazards secure more KOs and stop Skarmory from using Sturdy to phaze a boosted Aegislash. While Ribombee provides Sticky Web support to stop faster Pokemon such as Urshifu-R and Nidoking from revenge killing it.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 535121, "username": "Pubo"}, {"user_id": 282732, "username": "Niadev"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}], "writtenBy": [{"user_id": 546157, "username": "Arishem"}]}
  },
  "Primarina": {"sets": [{"name": "Choice Specs"}, {"name": "Calm Mind"}]},
  "Ribombee": {
    "comments": "<h1>Other Options</h1> <p>Skill Swap lets Ribombee set up Sticky Web in Hatterene's face. However, this is often not worth dropping U-Turn or a status move. Hidden Power Fire can be used to allow Ribombee to lure Scizor, but much like Skill Swap, it is also not worth replacing Ribombee's other moves for it.</p> <h1>Checks and Counters</h1> <p><strong>Steel-types: Scizor, Aegislash, Celesteela, Mega Aggron, and Mega Steelix all take very little damage from Ribombee's attacks, although Celesteela dislikes Stun Spore.</p> <p><strong>Fire-types: Ribombee cannot do much damage to Fire-types like Moltres, Rotom-H, Volcanion, and Salazzle, but most of them dislike Stun Spore or Toxic. The former three can also Defog Ribombee's Sticky Web away.</p> <p><strong>Poison-types: Ribombee is completely walled by Poison-type foes like Amoonguss, Nihilego, Galarian Slowbro, Nidoqueen, and Tentacruel. Tentacruel can additionally remove RIbombee's Sticky Web with Rapid Spin while Nihilego and Nidoqueen can freely set up Stealth Rock or Toxic Spikes.</p> ",
    "sets": [
      {
        "name": "Sticky Web Lead",
        "description": "<p>Ribombee's breakneck Speed, workable offensive prowess, and the ability to threaten many of the tier's Defoggers like Rotom-W, Salamence, Mandibuzz and Mega Altaria make it the metagame's best user of Sticky Web. Additionally, Ribombee's tremendous Speed tier and access to Fairy STAB allow it to outpace and threaten offensive Pokemon like Urshifu-R, Terrakion, and Zygarde-10% that would otherwise be troublesome for Sticky Web teams to face. However, Ribombee struggles to consistently keep Sticky Web up against other entry hazard removers like Moltres, Rotom-H, Tentacruel, and Galarian Weezing. Sticky Web teams are also quite inconsistent, as many Pokemon in the metagame are either levitating or are wearing Heavy-Duty Boots. Ribombee is also unable to do significant damage to many metagame staples like Scizor, Amoonguss, Aegislash, and the aforementioned Moltres and Celesteela. Stun Spore heavily punishes setup sweepers that may attempt to take advantage of Ribombee, like Nihilego and Celesteela. Toxic puts Pokemon like Hippowdon, Swampert, and Rotom-H on a timer, softening them up and allowing Ribombee's teammates to break through them more easily. Toxic additionally pressures Defog Moltres. Focus Sash allows Ribombee to set up Sticky Web even in the face of faster revenge killers like Choice Scarf Mienshao and Mega Manectric.</p> <p>Ribombee only fits on hyper offense teams, as they can make the most of Ribombee's Sticky Web with many wallbreakers and sweepers. Life Orb Scizor is a great partner, as Sticky Web mitigates its poor speed and Scizor can threaten still-faster threats with Bullet Punch; Scizor also checks Nihilego, which is otherwise problematic for Sticky Web teams. Necrozma is also a good partner, as its powerful Meteor Beam and Photon Geyser OHKO Moltres and Tentacruel, allowing Ribombee to keep its Sticky Web active, while also providing Stealth Rock. Wallbreakers such as Bulk Up Urshifu-R, Diggersby, and Nidoking can use their frighteningly powerful attacks to the fullest under Sticky Web, as they are much to revenge kill. Nidoking, while heavily fearing Knock Off, also helps somewhat against Zeraora. Nasty Plot Rotom-H appreciates being much more difficult to revenge kill and provides a crucial immunity to Ground thanks to Levitate. Bisharp is another powerful wallbreaker with middling Speed that greatly benefits from Sticky Web, and possesses the ability to deter Defog attempts thanks to Defiant. Additionally, its powerful STAB Knock Off is great for softening up the opposition and Sucker Punch assists in revenge killing faster foes that are not affected by Sticky Web such as Zeraora. Bisharp and Rotom-H are also offensive checks to Scizor, an otherwise annoying Pokemon for hyper offense teams to face. Dragon Dance Mega Altaria and Belly Drum Azumarill are additionally good options, as the former handles Zeraora and they both handle Urshifu-R, although they must be careful of Ice Punch and being worn down, respectively. Mamoswine is a good teammate, as it threatens Salamence with Ice Shard and pressures Steel-types that Ribombee dislikes such as Aegislash and Mega Aggron. Mamoswine also checks hail teams, which would otherwise be a massive pain for Sticky Web teams. Autotomize Celesteela is among the greatest setup sweepers on hyper offense and greatly appreciates Sticky Web slowing down foes like Choice Scarf Mienshao and Keldeo; it can also check Scizor.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 546157, "username": "Arishem"}, {"user_id": 535121, "username": "Pubo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 508532, "username": "TheShowdownHoedown"}]}
  },
  "Nihilego": {"sets": [{"name": "Meteor Beam"}, {"name": "Utility"}]},
  "Celesteela": {"sets": [{"name": "Defensive Leech Seed"}, {"name": "Autotomize Sweeper"}]},
  "Zeraora": {"sets": [{"name": "Pivot"}, {"name": "Bulk Up"}]},
  "Dracozolt": {"sets": [{"name": "Sand Rush"}, {"name": "Substitute Z-Move"}]},
  "Urshifu-Rapid-Strike": {"sets": [{"name": "Choice Band"}, {"name": "Protective Pads + Taunt"}, {"name": "Bulk Up"}]},
  "Zarude": {"sets": [{"name": "Z-Move"}, {"name": "Pivot"}, {"name": "Choice Scarf"}]}
}