{
  "Blastoise": {
    "overview": "<p>With a kit tailor-made for enabling partners, Blastoise stands out as DOU's definitive pure support pick. Access to all of Fake Out, Follow Me, and a pivot move in Flip Turn makes Blastoise incredibly effective at controlling the board and generating space for teammates to operate. Its respectable defenses leave it quite adept at soaking up attacks for its team; its pure-Water typing can be a mixed bag, though, only truly vulnerable to Grass-types such as Rillaboom but giving little in meaningful resistances. Blastoise generally fits best in fast, aggressive teams that feature threatening setup sweepers such as Dragon Dance Dragapult, Nasty Plot Spectrier, and Quiver Dance Volcarona. While Blastoise does compete with Amoonguss as a redirector and Tapu Fini as a bulky Water-type, it can be a better fit for borderline hyper offensive compositions hat prefer its dynamic, positioning-oriented arsenal over slow, controlling utility of Amoonguss's Spore and Tapu Fini's terrain control. Most glaringly, though, Blastoise's focus on sponging hits can let strong attackers like Urshifu-R and Zygarde simply overwhelm it or ignore the redirection; its lack of any offensive presence whatsoever means its partners must be threatening enough to make the support count.</p> ",
    "comments": "<h1>Other Options</h1> <p>Safety Goggles is one of the best alternatives on Blastoise purely for hard countering Amoonguss, as it renders Spore ineffective alongside Follow Me. Blastoise also has more niche alternatives for its fourth move in Helping Hand, Icy Wind, and Life Dew.</p> ",
    "sets": [{"name": "Follow Me Support", "description": "<ul> <li> <p>Fake Out and Follow Me let Blastoise keep its team safe, making them its primary tools for providing support.</p> </li> <li> <p>Flip Turn lets Blastoise act as a pivot, utilizing its bulk and relatively low Speed to effectively provide safe switches for teammates; it also makes Fake Out available again for later.</p> </li> <li> <p>Toxic pressures bulky threats such as Porygon2 and Kyurem-B, making up for Blastoise's lack of offensive presence, while Roar can be quite nifty for phazing and denying Trick Room setups.</p> </li> <li> <p>The EV spread is primarily focused on Defense to help Blastoise deal with the likes of Urshifu-R, Rillaboom, and Kyurem-B much more reliably, with the investment in its special bulk, in conjunction with its Sitrus Berry, handily letting it survive two Expanding Forces from Necrozma in Psychic Terrain.</p> </li> </ul> "}],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 501951, "username": "zeefable"}, {"user_id": 294304, "username": "emma"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finalnd"}]}], "writtenBy": [{"user_id": 215000, "username": "Memoric"}]}
  },
  "Weezing-Galar": {"sets": [{"name": "Neutralizing Gas"}]},
  "Chansey": {"sets": [{"name": "Bulky Utility"}]},
  "Zapdos": {
    "overview": "<p>Zapdos offers a premium speed control option in Tailwind backed by a great 100 base Speed, making it a reliable user of the move. Its Electric typing offensively covers Urshifu-R, Volcanion, and Tapu Fini, while its Flying type allows it to defensively cover Rillaboom and Genesect. Zapdos' high Special Attack and ability to pivot out of the field means it is rarely passive as a support Pokemon. These traits and respectable bulk place it as a useful glue on fast-paced teams, supporting offensive behemoths such as Urshifu-R and Kyurem-B. On these types of teams, it faces competition from other Tailwind users such as the speedier and more offensive Naganadel, though its Volt Switch and durability set it apart. Zapdos is plagued by some poor matchups into tier mainstays such as Kyurem-B, Zygarde, and Diancie. Additionally, most of Zapdos's utility comes from its relatively fast Tailwind, meaning Taunt and Trick Room will render its main strength useless.</p> ",
    "comments": "<h1>Other Options</h1> <p>Heat Wave can be useful coverage for OHKOing Genesect and providing spread damage, though replacing Hurricane leaves Zapdos quite desperate for power in the face of bulkier opponents such as Rillaboom and completely blanked by Zygarde. Safety Goggles allows Zapdos to switch into and completely ignore opposing Amoonguss, but the loss of Sitrus Berry recovery is noticeable. A all-out rain attacking set with Life Orb, carrying Thunder as its Electric-type STAB move, turns Zapdos into a major threat that also carries useful speed control. Whirlwind can be used to force out foes that have accumulated stat boosts or are setting Trick Room.</p> ",
    "sets": [
      {
        "name": "Offensive Tailwind",
        "description": "<ul> <li> <p>Volt Switch offers a decently powerful and accurate STAB move that OHKOs Urshifu-R while giving Zapdos a pivoting option. This is quite important for bringing in strong offensive threats shortly after Zapdos has set Tailwind.</p> </li> <li> <p>Hurricane is Zapdos's primary damage-dealing option, slamming Rillaboom for a super effective hit while offering a strong neutral hit on Pokemon such as Zygarde and Kyurem-B.</p> </li> <li> <p>Tailwind is Zapdos's main niche, allowing Pokemon with otherwise middling Speed stats such as Heatran and Zygarde to outspeed the vast majority of the tier, and pushing faster teammates to unmatched Speeds.</p> </li> <li> <p>Protect allows Zapdos to dance around the opponent's dangerous moves and let its user to maneuver themselves into a better position.</p> </li> <li> <p>Sitrus Berry allows Zapdos to survive a Choice Band Surging Strikes from Urshifu-R and gives it general longevity.</p> </li> <li> <p>Static can inflict game-changing status against attacking Rillaboom, Genesect, and Urshifu-R, the latter of which hits three times with Surging Strikes.</p> </li> <li> <p>The given EV spread and nature maximizes Zapdos' speed, allowing it to outspeed Urshifu-R and Speed tie with opposing Zapdos and Mew. More bulk can be added to survive specific attacks—a spread of 232 HP / 24 SpA / 252 Spe can be used to survive a Modest Choice Specs Dragapult Draco Meteor and a Jolly Choice Band Urshifu-R Surging Strikes without Sitrus Berry.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 294304, "username": "emma"}, {"user_id": 215000, "username": "Memoric"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 230771, "username": "qsns"}]}
  },
  "Zapdos-Galar": {
    "overview": "<p>Hailing from the Crown Tundra, the regional variant of Zapdos distinguishes itself as a strong, fast attacker thanks to its good Speed and great STAB combination. Galarian Zapdos also has the benefit of being a physical attacker that punishes Intimidate attempts with its Defiant ability, which makes it even stronger. Its Fighting / Flying typing grants it an excellent STAB combination that threatens many excellent Pokemon such as Rillaboom, Urshifu-R, Kyurem-B, and Incineroar. In particular, Galarian Zapdos is one of the best Rillaboom counters thanks to its resistance to Grass-type moves and ability to OHKO it with Brave Bird. This makes it one of the best partners for Tapu Fini, which greatly appreciates one of its greatest threats being removed. Another great teammate is Zygarde, who also loves Galarian Zapdos handling Rillaboom, along with it discouraging Intimidate from the likes of Incineroar and Landorus-T. Thanks to the combination of its base 100 Speed and the boost from Choice Scarf, Galarian Zapdos is able to outspeed Kyurem-B after a Dragon Dance, as well as common users of Choice Scarf, most notably Genesect. Galarian Zapdos's ability to consistently be the fastest Pokemon on the field is invaluable for bulkier teams that can struggle against more offensive teams. However, Galarian Zapdos struggles against the same bulkier teams, as Pokemon with high Defense like Tapu Fini and Diancie are mainstays on those teams, and Galarian Zapdos can struggle to break past them. Its damage can also be lackluster against neutral targets without a rare Defiant boost. Galarian Zapdos's poor defenses also make it dead weight against opposing speed control, and its reliance on Choice Scarf makes it very susceptible to Fake Out putting it in a vulnerable situation, along with the move lock being easily exploited. On top of that, it faces stiff competition from fellow Fighting-type Urshifu-R, which indirectly ignores Intimidate via Surging Strikes, while also being able to ignore Protect thanks to Unseen Fist.</p> ",
    "comments": "<h1>Other Options</h1> <p>Choice Band and Life Orb are both options to increase Galarian Zapdos's damage output, but they make it very reliant on speed control as it no longer outspeeds Pokemon like Zeraora and Dragapult. Steel Wing OHKOs Diancie with Choice Band and has a good chance to with Life Orb, however, it's an exploitable move to lock into and has little usage otherwise.</p> ",
    "sets": [
      {
        "name": "Choice Scarf",
        "description": "<ul> <li> <p>Brave Bird and Close Combat are Galarian Zapdos's main STAB moves due to their high Base Power and ability to threaten several of the top Pokemon in the tier, like Rillaboom, Kyurem-B, and Urshifu-R. Brave Bird is the preferable attack to lock into, as it's the least exploitable of the two.</p> </li> <li> <p>Blaze Kick allows Galarian Zapdos to OHKO Genesect, while Low Sweep lets it provide immediate speed control for its teammates, thanks to Generation 8's dynamic speed mechanics.</p> </li> <li> <p>U-turn keeps momentum by taking advantage of Galaran Zapdos's switch-ins and can be used to pivot out of unfavorable situations.</p> </li> <li> <p>Choice Scarf allows Galarian Zapdos to immediately outspeed the vast majority of the metagame, even other users of Choice Scarf like Genesect, while the EV spread maximizes its offensive prowess.</p> </li> <li> <p>Defiant allows Galarian Zapdos to punish Intimidate and other methods of dropping stats, such as Icy Wind from Kyurem-B.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 501951, "username": "zeefable"}, {"user_id": 243662, "username": "Yoda2798"}]}, {"name": "Grammar checked by", "members": [{"user_id": 229690, "username": "queez"}]}], "writtenBy": [{"user_id": 531334, "username": "dnagerbdager"}]}
  },
  "Mew": {
    "overview": "<p>Mew is one of the most versatile support choices in the Doubles OU metagame, thanks to its large movepool, decent bulk and relatively high Speed. Its main uses are providing Tailwind, setting up entry hazards like Stealth Rock, and helping Pokemon such as Dragon Dance Zygarde and Kyurem-B set up with moves like Fake Out and Pollen Puff. Mew is often used as a lead, to set up either speed control or hazards early on, or as a mid-game Tailwind enabler. Pokemon with strong spread moves, such as Choice Band Zygarde and Heatran, benefit from Mew's ability to reliably set Tailwind. Pokemon such as Genesect, Incineroar, and Tyranitar can threaten Mew with super effective attacks; teammates such as Heatran, Zygarde, and Urshifu-R can make use of Tailwind to put pressure on these threats. Due to an average Special Attack stat and lack of strong moves, Mew finds itself lacking in offensive pressure, which can allow opponents to reposition their Pokémon or set up.</p> ",
    "comments": "<h1>Other Options:</h1> <p>Other solid coverage moves include Flamethrower to hit Genesect and Earth Power to hit Volcanion and Heatran, depending on what the team is weak to. Coaching can support Zygarde, Kyurem-B, Urshifu-R, and other Pokemon, but it cuts into more valuable moves. Mew also has use as a setup sweeper, carrying Nasty Plot or Power Herb and Meteor Beam, although its Special Attack can be lackluster at times. Safety Goggles is another option over Sitrus Berry; it allows Mew to ignore Spore and Rage powder, although this is generally less useful and typically not worth the sacrifice of longevity. Taunt is a way to help against Trick Room, Tailwind, Spore, and other status moves.</p> ",
    "sets": [
      {
        "name": "Tailwind Support",
        "description": "<ul> <li> <p>Fake Out can generate free turns for your allies to switch, set up speed control, or attack safely. Besides Zeraora, Mew is the fastest relevant Fake Out user in the tier, allowing for more control against other Fake Out users.</p> </li> <li> <p>Ice Beam is Mew’s offensive option, hitting Zygarde and Landorus-T for 4x damage and chipping other common threats such as Rillaboom.</p> </li> <li> <p>Pollen Puff heals allies and goes through Substitute, which benefits setup Pokemon such as Dragon Dance Zygarde and Kyurem-B, as well as Pokemon like Eruption Heatran that appreciate HP boosts. However, you lose out on either Fake Out utility or Ice Beam coverage.</p> </li> <li> <p>Tailwind enables slower teammates such as Heatran, Volcanion, and Zygarde to become real threats by outspeeding Pokemon such as Urshifu-R, Dragapult, Zeraora, and Rillaboom.</p> </li> <li> <p>Stealth Rock weakens Pokemon such as Kyurem-B and Volcanion, putting them in range of KOs, and can dissuade opponents from making switches, lest they rack up too much chip damage.</p> </li> <li> <p>Sitrus Berry increases Mew's longevity, turning a 2HKO from Rillaboom's Wood Hammer into a 3HKO, for example.</p> </li> <li> <p>Maximum Speed investment allows Mew to set Tailwinds before Kyurem-B, Tapu Lele, and Urshifu-R move, allowing slower teammates to outspeed them immediately. The Speed also allows Mew to outspeed Zygarde and hit it with Ice Beam.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 243662, "username": "Yoda2798"}, {"user_id": 501951, "username": "zeefable"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 546393, "username": "Crunchman"}]}
  },
  "Politoed": {"sets": [{"name": "Drizzle Support"}]},
  "Kingdra": {
    "overview": "<p>While Kingdra does stand out as the best Swift Swim attacker in SS DOU, it still leaves a lot to be desired. Its Speed in rain gives it a notable amount of utility, as it can pin down faster, frailer foes while it breaks the opposing team with strong rain-boosted Muddy Waters. In particular, Kingdra excels in using its offensive presence to give its teammates space and clean up weakened teams. However, it has multiple awkward matchups in the metagame, including against DOU's top threats in Rillaboom, Tapu Fini, and Kyurem-B, and its average Special Attack stat can at times feel lacking, which is a major downside, as it offers no utility outside of purely attacking. Kingdra, in particular, faces stiff competition as a Water-type attacker in rain from Urshifu-R, which boasts noticeably better power output and coverage, an improved matchup against Trick Room, more relevant utility in the ability to force trades with Unseen Fist, and most importantly a non-reliance on rain to be effective; while Kingdra does offer blazing Speed and a better match-up against fast Dragon-types in Dragapult and Naganadel, its Speed is also easily compensated for by the rain archetype's many Tailwind-setting Flying-type options in Tornadus and Zapdos, and its need for Speed also leaves it much more vulnerable in the face of opposing speed control. Kingdra's reliance on keeping its rain setter available, as it is very lacking as an attacker without it, on top of its other flaws, ultimately makes it quite awkward to run on rain teams.</p> ",
    "comments": "<h1>Other Options</h1> <p>Choice Specs is an option in order to amplify Kingdra's damage output even further, taking advantage of the fact that it only really needs its Water-type STAB moves to do its job while also niftily avoiding Life Orb's recoi. However, the set's inability to switch moves and run Protect viably can also leave it quite punishable, especially with Fake Out and other priority moves being particularly awkward to play against. Substitute is an option over one of Kingdra's coverage moves in order to block Fake Outs and Grassy Glide from Rillaboom, though losing one of its coverage moves can also make breaking through teams more difficult.</p> ",
    "sets": [
      {
        "name": "Swift Swim Attacker",
        "description": "<ul> <li> <p>Muddy Water is Kingdra's primary attacking option, as it hits both foes with significant rain-boosted damage.</p> </li> <li> <p>Hurricane is Kingdra's best option to hit Grass-type switch-ins such as Rillaboom and Amoonguss for super effective damage, and it is also nifty for sniping Urshifu-R.</p> </li> <li> <p>Draco Meteor is used to decimate Dragon-types that may otherwise be able to stomach a rain-boosted Water-type attack and hit back hard such as Kyurem-B, Dragapult, and Naganadel, though be wary, as it also weakens Kingdra considerably, squandering the already limited turns of rain.</p> </li> <li> <p>Hydro Pump is an option over either coverage move to decimate neutral targets such as Zeraora, Necrozma, and Metagross, which otherwise easily survive a Muddy Water, at the cost of being worse against either Grass-types and Rillaboom or Dragon-types.</p> </li> <li> <p>Protect lets Kingdra be safe for a turn, which is handy for giving teammates time to position around it and stalling out threatening field conditions such as opposing Tailwind and Trick Room.</p> </li> <li> <p>Life Orb in conjunction with the given EV investment and Modest nature is geared towards maximizing Kingdra's offensive presence, with Swift Swim letting it outrun practically the entire metagame under rain, getting the jump on Zeraora and Dragapult as well as Choice Scarf users such as Genesect and Galarian Zapdos.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 501951, "username": "zeefable"}, {"user_id": 294304, "username": "emma"}]}, {"name": "Grammar checked by", "members": [{"user_id": 241023, "username": "Kris"}]}], "writtenBy": [{"user_id": 215000, "username": "Memoric"}]}
  },
  "Porygon2": {
    "overview": "<p>Porygon2 manages to stand out as a reliable Trick Room setter and threatening late-game wincon thanks to its Eviolite-boosted defenses, access to Recover, and single weakness in Fighting. Download can allow it to provide some offensive pressure with its good coverage in Thunderbolt and Ice Beam should it get a Special Attack boost. Porygon2 is appreciated on semi-Trick Room teams. On these teams, Rillaboom provides Fake Out support and checks Urshifu-R, while Volcanion and Diancie benefit from Trick Room, with Diancie being a secondary setter. However, if lacking a Download boost, Porygon2 can find itself being ignored due providing subpar offensive pressure. Porygon2 also has to be cautious of Knock Off from Incineroar and Toxic from Blastoise, which can severely cripple it. Despite having one weakness, Porygon2 can be OHKOed by Life Orb Urshifu-R and overwhelmed by combinations of strong attacks from Pokemon like Zygarde and Heatran.</p> ",
    "comments": "<h1>Other Options</h1> <p>Icy Wind Porygon2 fits on more offensive teams that do not need Trick Room support. It can also use Ally Switch to cause the opponent to pay attention to it or make unnecessary reads, which can rectify its passivity problem. However, running Ally Switch means you need to give up either valuable coverage or pressure with Toxic.</p> ",
    "sets": [
      {
        "name": "Trick Room",
        "description": "<ul> <li> <p>Ice Beam is a good coverage option that allows Porygon2 to hit foes such as Rillaboom, Zygarde, and Dragapult. In combination with Thunderbolt, it can hit the entire tier for at least neutral damage.</p> </li> <li> <p>Thunderbolt enables Porygon2 to pressure Tapu Fini, Volcanion, and Urshifu-R with super effective damage, while Toxic puts bulky walls like Assault Vest Kyurem-B and Porygon2, and setup sweepers such as Dragon Dance Kyurem-B and Calm Mind Tapu Fini outside of Misty Terrain, on a timer.</p> </li> <li> <p>Recover enables Porygon2 to stay healthy and consistently set up Trick Room, making it difficult to remove late-game once its main checks have been removed, such as Urshifu-R and Heatran.</p> </li> <li> <p>Trick Room makes Porygon2 an excellent form of speed control, as it can turn the tables against faster threats such as Urshifu-R and deters setup sweepers like Dragon Dance Kyurem-B from setting up. Allies in Volcanion and Diancie benefit greatly from Trick Room support, as they then underspeed the majority of the metagame.</p> </li> <li> <p>Download can often boost Porygon2's Special Attack due to the prevalence of Zygarde and Urshifu-R, which greatly improves its special moves, allowing it to OHKO Urshifu-R, Zygarde, and Dragapult at +1.</p> </li> <li> <p>The given EV spread allows Porygon2 to OHKO Zygarde and Dragapult at +1, as well as making Choice Band Zygarde's Thousand Arrows into a 4HKO and Modest Charcoal Heatran only able to 3HKO.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 294304, "username": "emma"}, {"user_id": 501951, "username": "zeefable"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 491200, "username": "Light Sanctity"}]}
  },
  "Tyranitar": {"sets": [{"name": "Bulky Attacker"}]},
  "Ludicolo": {"sets": [{"name": "Rain Attacker"}]},
  "Pelipper": {"sets": [{"name": "Offensive Rain Setter"}]},
  "Torkoal": {"sets": [{"name": "Sun Attacker"}]},
  "Metagross": {"sets": [{"name": "Utility"}]},
  "Heatran": {"sets": [{"name": "Fast Attacker"}]},
  "Cresselia": {"sets": [{"name": "Calm Mind"}]},
  "Excadrill": {"sets": [{"name": "Sand Rush"}, {"name": "Mold Breaker"}]},
  "Whimsicott": {"sets": [{"name": "Prankster Support"}]},
  "Amoonguss": {
    "overview": "<p>Amoonguss is one of the best support Pokemon in the metagame, capable of redirecting attacks with Rage Powder or putting foes to sleep with Spore. It is bulky enough to live most attacks, and the added survivability from Regenerator allows it to perform its role repeatedly throughout a match. Additionally, Pollen Puff ensures Amoonguss's teammates can also remain healthy. Setup Pokemon, such as Dragon Dance Zygarde or Kyurem-B and Calm Mind Tapu Fini, benefit the most from Amoonguss's support and can make up for its minimal damage output. Due to its low Speed and Spore, Amoonguss also works well both with and against Trick Room teams, as it can then send most Pokemon to sleep before they move. Trick Room users such as Porygon2 and Diancie also appreciate the redirection support while setting it. Despite being able to stomach most hits, Amoonguss must be wary of Fire-types such as Heatran and Incineroar as well as Psychic-types such as Tapu Lele and Necrozma, requiring teammates to deal with them such as Urshifu-R and Heatran, respectively. The presence of Misty Terrain hampers Amoonguss's Spore, so terrain setters such as Tapu Lele and Indeedee-F, or Metagross with Steel Roller, are essential to remove it. Opposing Grass-types such as Rillaboom, or Pokemon holding Safety Goggles, can also be troublesome, as immunity to powder moves lets them mostly ignore Amoonguss and attack its partner. Blastoise, its biggest competitor as a redirector, doesn't share this drawback.</p> ",
    "comments": "<h1>Other Options</h1> <p>Resist berries such as Occa and Papaya allow Amoonguss to live certain attacks that it would not otherwise. Eject Button lets Amoonguss redirect a hit and then immediately switch out, e.g. for helping to set Trick Room or Tailwind and then getting an attacker in to benefit right away. However, Eject Button can be awkward if Amoonguss intends to use Spore and gets forced out instead or needs to redirect two attacks. Another option is Rocky Helmet, which provides chip damage on physical attackers such as Urshifu-R, Rillaboom, and Genesect. These alternate item choices are not as generally useful as the recovery from Sitrus Berry, though. Clear Smog is a weaker Poison-type STAB move compared to Sludge Bomb, but it can be used instead to help deal with opposing setup. A Grass-type STAB move such as Energy Ball could also be considered, but it cannot effectively hit the Pokemon immune to Spore, while the Pokemon it does hit harder than Sludge Bomb are vulnerable to Spore, so there is little reason to use it.</p> ",
    "sets": [
      {
        "name": "Rage Powder Support",
        "description": "<ul> <li> <p>Sludge Bomb is Amoonguss's primary offensive option, hitting Tapu Fini as well as Grass-types like Rillaboom, which are immune to Spore. Protect can be used instead to scout for moves such as Choice Scarf Genesect locking into Ice Beam, but this leaves Amoonguss quite passive.</p> </li> <li> <p>Pollen Puff heals Amoonguss's partner.</p> </li> <li> <p>Rage Powder keeps partners safe from attacks and is most effective when used alongside setup Pokemon, or while setting field conditions such as Trick Room and Tailwind.</p> </li> <li> <p>Besides critically putting foes out of action, Spore helps ensure Amoonguss is not too passive while on the field.</p> </li> <li> <p>Sitrus Berry complements Amoonguss's bulk, turning many would-be 2HKOs into 3HKOs instead, such as Ice Beam from non-Life Orb Kyurem-B.</p> </li> <li> <p>Regenerator also helps Amoonguss's longevity on switching out, which can let it give future utility even when at low health.</p> </li> <li> <p>The given EV spread and nature, combined with Sitrus Berry, allow Amoonguss to live two Heat Waves from Volcanion, with the remaining EVs placed in Defense. 28 Speed IVs let it underspeed Diancie to move first under Trick Room while still being able to outspeed foes with the help of speed control.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 501951, "username": "zeefable"}, {"user_id": 294304, "username": "emma"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 243662, "username": "Yoda2798"}]}
  },
  "Landorus-Therian": {"sets": [{"name": "Intimidate Pivot", "description": "<ul> <li>The EV spread is geared towards allowing Landorus-T to survive a +1 Meteor Beam from Nihilego and KO back with Earth Power. The leftover EVs are dumped onto Defense.</li> </ul> <p>This is a sample set while we are currently working on analyses in <a href=\"http://www.smogon.com/forums/forums/doubles-ou-analyses.541/\">Contributions and Corrections</a>.</p> "}]},
  "Kyurem-Black": {
    "overview": "<p>Kyurem-B is blessed with the combination of solid mixed attacking capabilities, good defensive stats—which make it difficult to remove, a potent boosting option in Dragon Dance, and excellent coverage moves in Fusion Bolt and Earth Power, making it one of the most threatening forces in Doubles OU. It can be used on almost any team due to its universally beneficial combination of offensive pressure and utility, utility both in outright checking threats like Rillaboom and Zygarde and even speed control from Icy Wind. Its monstrously strong Dragon Dance set is also one of the most potent wincons in the tier, especially when paired with Fake Out and redirection support from the likes of Incineroar and Amoonguss, though it struggles against Trick Room Pokemon, particularly Diancie. Unfortunately, Kyurem-B's relatively average Speed tier leaves it outrun by checks like Urshifu-R and Genesect, which can hit it for super effective damage. Additionally, its poor defensive typing leaves it open to multiple powerful fringe attacks such as Galarian Zapdos's Close Combat, Nihilego's Meteor Beam, and Metagross's Steel Roller.</p> ",
    "comments": "<h1>Other Options</h1> <p>Kyurem-B can use a Life Orb mixed attacking or Choice Band physical set to have a stronger immediate offensive presence; however, the former gets worn down fairly quickly with recoil, while the latter can be taken advantage of based on the move it locks in to. Freeze-Dry can be used over Fusion Bolt to avoid running a Defense-lowering nature and hit Water-types that aren't weak to Electric like Kingdra and Dracovish. Like Leftovers, Heavy-Duty Boots can be useful for preserving its health, but it is useless if the opponent isn't using entry hazard. Dragon Tail phazes Trick Room setters and setup sweepers like Porygon2 and Dragon Dance Kyurem-B, respectively, though it cannot be used on Diancie. Flash Cannon can hit Diancie but serves little purpose otherwise.</p> ",
    "sets": [
      {
        "name": "Dragon Dance",
        "description": "<ul> <li> <p>Dragon Dance boosts Kyurem-B's already sky-high Attack. Additionally, it outruns the entire unboosted metagame at +1 Speed, and it even outruns the likes of Heatran in Tailwind and Choice Scarf Genesect at +2.</p> </li> <li> <p>Icicle Spear is Kyurem's main attack, OHKOing the likes of Zygarde and Dragapult unboosted while also scoring OHKOs on Rillaboom and Zapdos at +1 with at least three hits.</p> </li> <li> <p>Fusion Bolt gives Kyurem-B great coverage, hitting Water-types like Tapu Fini and Urshifu-R, as well as Steel-types such as Heatran and Genesect that resist Icicle Spear.</p> </li> <li> <p>Protect is necessary for keeping Kyurem-B safe from attacks like Necrozma's Meteor Beam and Fake Out from Incineroar and Rillaboom, in addition to providing a turn to bring in supportive partners like Amoonguss and Incineroar.</p> </li> <li> <p>Leftovers can be very useful because Kyurem-B often gets worn down when attempting to set up Dragon Dances. Chople Berry lets it take a Close Combat from any variant of Urshifu-R, allowing it to use Dragon Dance to then outspeed and OHKO it back with Fusion Bolt.</p> </li> <li> <p>With 136 Attack EVs and an Adamant nature, Kyurem-B will always OHKO Zygarde with two hits from Icicle Spear, while maximum Speed investment allows it to tie Adamant Zygarde unboosted and outrun Dragapult and Zeraora at +1 Speed.</p> </li> </ul> "
      },
      {"name": "Assault Vest", "description": "<ul> <li> <p>Ice Beam is a very reliable STAB move, hitting numerous common Pokemon such as Landorus-T, Zygarde, Rillaboom, and Zapdos for super effective damage, while Fusion Bolt makes good use of Kyurem-B's great Attack stat, hitting Water-types like Volcanion and Tapu Fini.</p> </li> <li> <p>Earth Power is an excellent coverage move, hitting Fire- and Steel-types including Heatran, Incineroar, and Metagross.</p> </li> <li> <p>Icy Wind provides a means of speed control while also 2HKOing the likes of Zygarde and Dragapult through redirection.</p> </li> <li> <p>The EV spread, combined with Assault Vest, allows Kyurem-B to outspeed maximum Speed Adamant Zygarde and survive a Draco Meteor from Choice Specs Dragapult.</p> </li> </ul> "}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 243662, "username": "Yoda2798"}, {"user_id": 294304, "username": "emma"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 501951, "username": "zeefable"}]}
  },
  "Genesect": {"sets": [{"name": "Choice Scarf"}, {"name": "Assault Vest"}]},
  "Zygarde": {"sets": [{"name": "Choice Band"}, {"name": "Dragon Dance"}]},
  "Diancie": {
    "overview": "<p>Diancie shines as one of the best Trick Room setters and beneficiaries due to its high offensive and defensive stats, low Speed, strong typing, and access to Diamond Storm, fitting the unique role of a reliable Trick Room setter that can also deal out massive damage. Offensively, Rock has minimal resistances and hits common Pokemon like Kyurem-B and Incineroar super effectively. While its typing might leave it with four common weaknesses, its outstanding defensive stats mean that it can usually take a hit and activate Weakness Policy. Diancie fits best on semi-Trick Room compositions, where it takes advantage of its low Speed and can set up Trick Room multiple times and start shredding holes in the opponent's team with Diamond Storm, stacking Defense boosts to make it much harder to get rid of. Clear Body also lets it ignore Intimidate, making it very hard to stop once it gets going. Volcanion makes for an excellent partner, as it helps remove Grass- and Steel-types such as Rillaboom and Genesect for Diancie, which in return provides reliable speed control. Rillaboom's Fake Out makes Trick Room easier to set up and its powerful Grass-type STAB moves help against Urshifu-R and Tapu Fini. In return, Diancie takes care of Fire-types and Kyurem-B. Diancie struggles quite a bit outside of Trick Room, where its poor Speed leaves it vulnerable to super effective hits from the likes of Urshifu-R, Rillaboom, Zygarde, and Genesect, the first ignoring any Defense boosts Diancie might accumulate and the second having strong priority to hit first even if Trick Room is active. Diancie is also hard walled by Metagross, and must always worry about its strong Steel-type STAB moves threatening an OHKO. Furthermore, it can struggle to break past bulkier Pokemon such as Tapu Fini and Amoonguss even under Trick Room, the latter of which is able to land Spore freely if Diancie isn't using Safety Goggles.</p> ",
    "comments": "<h1>Other Options</h1> <p>Body Press can be used over Moonblast to synergize well with Defense boosts from Diamond Storm, but it needs said boosts to be most effective and Diancie then loses out on coverage for Urshifu-R and Zygarde. It also doesn't benefit from any potential Weakness Policy boosts. Play Rough is another alternative to Moonblast that's stronger, but it risks missing and the power difference is typically not needed, especially if Diancie gets the Weakness Policy boost. Babiri, Rindo, Shuca, and Passho Berry are all options to make sure Diancie lives a certain hit on specific teams and Mental Herb can be used to ignore Taunt once, but these items are less useful overall than Weakness Policy or Safety Goggles.</p> ",
    "sets": [
      {
        "name": "Trick Room Attacker",
        "description": "<ul> <li> <p>Diamond Storm is a strong spread STAB attack with minimal resistances in the tier and hits Pokemon such as Kyurem-B and Incineroar super effectively. Successfully gaining Defense boosts also aids Diancie against physical attackers such as Rillaboom and Zygarde.</p> </li> <li> <p>Moonblast covers common Diamond Storm switch-ins such as Urshifu-R and Zygarde.</p> </li> <li> <p>Trick Room is an excellent form of speed control that lets Diancie control the pace of the game. It is useful for letting both itself and its partners move first while also deterring setup from Dragon Dance Kyurem-B and Zygarde.</p> </li> <li> <p>Protect keeps Diancie safe for a turn while a support teammate, such as a Fake Out or redirection user, switches in to aid in setting up Trick Room.</p> </li> <li> <p>Weakness Policy works well with Diancie's phenomenal bulk and weaknesses to common types such as Water and Grass. Safety Goggles ignores Spore and redirection attempts from Amoonguss, one of the best Pokemon against Trick Room.</p> </li> <li> <p>Clear Body lets Diancie ignore Intimidate and Parting Shot from Incineroar, rending standard means of decreasing damage from physical attackers useless.</p> </li> <li> <p>A Sassy nature lets Diancie live a Steam Eruption from Volcanion and usually move first under Trick Room when combined with minimum Speed IVs. The remaining EVs are dumped into Attack to boost Diamond Storm. A Brave nature can be used instead of Sassy to hit as hard as possible. Additionally, 104 EVs can be shifted from Attack to Special Attack to secure the OHKO on Urshifu-R with Moonblast.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 243662, "username": "Yoda2798"}, {"user_id": 215000, "username": "Memoric"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 294304, "username": "emma"}]}
  },
  "Volcanion": {"sets": [{"name": "Bulky Attacker"}]},
  "Incineroar": {
    "overview": "<p>The combination of an excellent ability, access to valuable utility moves, and solid stats makes Incineroar one of the best pivots in the tier. It fits well on a variety of team structures because of its great defensive utility being appreciated on most archetypes. Specifically, setup threats such as Calm Mind Tapu Fini and Dragon Dance Kyurem-B appreciate its ability to generate safe turns, while strong offensive Pokemon such as Zygarde and Urshifu-R value the slow and safe switch-in generated through Parting Shot. However, Incineroar faces competition from other Fire-types such as Volcanion and Heatran, and it has rough matchups against common Pokemon such as Tapu Fini and Zygarde. It is also easily worn down pivoting in and out, especially since it rarely can fit Protect in its repertoire.</p> ",
    "comments": "<h1>Other Options</h1> <p>Heavy-Duty Boots and Assault Vest are options over Sitrus Berry for either immunity to entry hazards or more special bulk, but they are usually not worth over the healing Sitrus Berry provides. When running Assault Vest, use U-turn over Parting Shot, but the minimal damage is usually less helpful than Parting Shot's stats drops, so you shouldn't use it unless needed. Safety Goggles lets it act as a more reliable check to Amoonguss, but it leaves Incineroar with no healing. Taunt shuts down any Trick Room setters, but it's hard to justify using over any of Incineroar's usual moves, which have much more utility overall.</p> ",
    "sets": [
      {
        "name": "Pivot",
        "description": "<ul> <li> <p>Fake Out can provide space for your partner to boost its stats, provide speed control, switch, or attack.</p> </li> <li> <p>Flare Blitz is a strong STAB move that hits Pokemon such as Rillaboom, Amoonguss, and Genesect for super effective damage. Despite little investment, it still hits hard due to Flare Blitz's high Base Power, which is worth the recoil.</p> </li> <li> <p>Knock Off is a great utility move because removing items is always beneficial. Specifically, it can remove important items such as Eviolite on Porygon2, Assault Vest on Kyurem-B, and Leftovers on Tapu Fini.</p> </li> <li> <p>Parting Shot allows you to grab momentum while also enabling recycling of Fake Out and Intimidate. It also has the added bonus of crippling common switch-ins such as Urshifu-R and Volcanion.</p> </li> <li> <p>The EV spread allows Incineroar to survive a Steam Eruption from Volcanion and OHKO Dragapult with Knock Off. EVs can be moved to Speed to outpace threats in Tailwind.</p> </li> <li> <p>Sitrus Berry provides burst healing which helps Incineroar in pivoting in and out. It also gives it good odds to survive two Choice Band Zygarde Thousand Arrows at -1.</p> </li> <li> <p>Intimidate weakens most opposing physical attackers on the switch in, notably Dragon Dance Kyurem-B and Zygarde, often forcing them out to reset their own stats.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 188164, "username": "MajorBowman"}, {"user_id": 215000, "username": "Memoric"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Estronic"}]}], "writtenBy": [{"user_id": 294304, "username": "emma"}]}
  },
  "Tsareena": {"sets": [{"name": "Assault Vest", "description": "<ul> <li>The EV spread maximizes Speed while also allowing Tsareena to survive a +1 Sludge Bomb from Nihilego.</li> </ul> "}, {"name": "Sitrus Berry + Taunt", "description": "<ul> <li>The EV spread lets Tsareena take two Sacred Swords from 4 Atk Kartana without the need of a Sitrus Berry, and it also lets Tsareena survive a Choice Specs Draco Meteor from Dragapult.</li> </ul> <p>These are sample sets while we are currently working on analyses in <a href=\"http://www.smogon.com/forums/forums/doubles-ou-analyses.541/\">Contributions and Corrections</a>.</p> "}]},
  "Kommo-o": {"sets": [{"name": "Omnibooster"}, {"name": "Iron Defense"}]},
  "Tapu Koko": {"sets": [{"name": "Choice Specs Attacker"}]},
  "Tapu Lele": {
    "overview": "<p>Tapu Lele is an asset to teams with its Psychic Terrain providing a large boost to Psychic-type moves, blocking Fake Out and other priority, and removing other Terrains, which means it puts strong offensive pressure on opposing teams. Tapu Lele works best on Psychic-type spam and semi-Trick Room structures alongside teammates such as Necrozma that appreciate Psychic Terrain vastly boosting Expanding Force. Amoonguss is also a solid partner due to Tapu Lele removing opposing Misty Terrain, which blocks its Spore. However, Tapu Lele is held back by its middling Speed tier, which, while high enough to outspeed threats such as Choice Band Zygarde, is still vulnerable to attackers such as Urshifu-R and Dragapult. It is also generally quite weak due to the prevalence of opposing Terrain control as well as the the lack of a boosting item and significant Special Attack investment. Furthermore, its inability to break through Steel-type Pokemon such as Heatran, Genesect, and Metagross means it needs offensive support from Pokemon such as Urshifu-R and Zygarde. Tapu Lele also faces competition from Indeedee-F as a Psychic Terrain setter, which has less offensive prowess but provides much more in terms of support to teams.</p> ",
    "comments": "<h1>Other Options</h1> <p>Tapu Lele can run a Choice Scarf or a Choice Specs set with a fully offensive EV spread, but this comes at the cost of being locked into one move, losing Taunt, and being much less effective at maintaining Psychic Terrain. Life Orb is also an option to boost Tapu Lele’s power while still maintaining its utility and ability to switch moves. However, it cuts into Tapu Lele’s bulk drastically and therefore makes it worse at doing its job as a pivot, leaving it generally much worse than Pixie Plate.</p> ",
    "sets": [
      {
        "name": "Bulky Taunt",
        "description": "<ul> <li> <p>Psychic is Tapu Lele’s main STAB option, giving it a strong attack boosted by Psychic Terrain to threaten the likes of Urshifu-R and Amoonguss. Psyshock can be run to deal with Calm Mind Tapu Fini better but at the cost of some Base Power.</p> </li> <li> <p>Moonblast which hits Pokemon such as Zygarde and Kyurem-B harder and helps deal with foes Psychic can't hit neutrally like Incineroar. In conjunction with Psychic, it gives Tapu Lele the ability to hit every type at least neutrally besides Steel.</p> </li> <li> <p>Taunt shuts down Trick Room setters such as Diancie and Porygon2 and stops redirection from Pokemon such as Blastoise. Furthermore, it also allows Tapu Lele to stop Pokemon such as Calm Mind Tapu Fini from setting up on it. Tapu Lele can also use Taunt on Tailwind setters such as Mew and Zapdos, but this is difficult, as they generally outspeed it.</p> </li> <li> <p>Protect keeps Tapu Lele safe while its partner uses speed control, and it also allows Tapu Lele to scout moves.</p> </li> <li> <p>The given EV spread allows Tapu Lele to outspeed Choice Band Zygarde and avoid the 2HKO from Thousand Arrows with a Sitrus Berry.</p> </li> <li> <p>A Sitrus Berry is used to increase Tapu Lele’s longevity during matches, letting it last long enough to provide Terrain support. An Eject Button can also be used to preserve it while also maintaining momentum, allowing it to bring in its teammates with ease. If running Eject Button, Tapu Lele should shift its Defense EVs to Special Attack.</p> </li> <li> <p>Tapu Lele can take on a more offensive role with Pixie Plate, using a spread of 212 HP / 144 SpA / 152 Spe and a Timid nature to OHKO Zygarde. However, this makes Tapu Lele less effective at pivoting in and out.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 294304, "username": "emma"}, {"user_id": 243662, "username": "Yoda2798"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 529732, "username": "adem"}]}
  },
  "Tapu Fini": {
    "overview": "<p>Tapu Fini is an important asset of balance teams thanks to its defensive and offensive utility, which stems from its typing and ability. A Water / Fairy typing lets it easily take attacks from the likes of Heatran, Urshifu-R, and Volcanion, especially when considering its great natural bulk, which also allows it to take neutral attacks from the likes of Zygarde and Dragapult relatively well. In return, it can threaten the aforementioned Pokemon back with its STAB moves, giving it offensive utility as well. Misty Surge allows Tapu Fini to exert Terrain control, with Misty Terrain removing priority from Rillaboom's Grassy Glide and turning Necrozma's Expanding Force into a single target move. Misty Terrain also has the benefit of blocking Amoonguss's Spore and weakening Dragon-type moves from the likes of Dragapult and Kommo-o. Tapu Fini can take advantage of Pokemon it walls with a Calm Mind set, which lets it function as a dangerous wincon while maintaining its defensive and offensive utility. It can also take on a support role and utilize its great support movepool with moves like Heal Pulse and Nature's Madness. The Calm Mind set can take a bit to get going and relies on Leftovers to keep it healthy, while the support set is mostly passive. Further, both sets have a tendency to be and share a considerable weakness to one of the best Pokemon in the tier, Rillaboom. It threatens Tapu Fini with its powerful STAB Grassy Glide and resets Misty Terrain. Tapu Fini also has a tendency to get overwhelmed and chipped while it switches in to take resisted hits and change the terrain, a problem made worse by its lack of instant recovery. Pokemon that can handle Rillaboom make excellent partners for Tapu Fini. Kyurem-B and Incineroar in particular are great partners, as Tapu Fini beats Urshifu-R for them as well.</p> ",
    "comments": "<h1>Other Options</h1> <p>Choice Specs and Choice Scarf can both exert immediate offensive pressure as well as potentially pick up a surprise KO. Trick is an option on both sets and can cripple its switch-ins like Rillaboom. However, both items are generally less consistent than the Calm Mind or Support sets. Muddy Water is an option over Nature's Madness on the support set to hit Heatran, but it has a lower overall damage output.</p> ",
    "sets": [
      {
        "name": "Calm Mind",
        "description": "<ul> <li> <p>Muddy Water and Moonblast allow Tapu Fini to effectively exert offensive pressure the opposing team. Moonblast is a single target move that hits many threats like Urshifu-R, Zygarde, and Kommo-o, while Muddy Water hits both targets and nails Pokemon that aren't too threatened by Moonblast like Heatran and Incineroar. However, both need boosts to become significantly threatening.</p> </li> <li> <p>Tapu Fini can set up Calm Mind on a wide variety of Pokemon, like Volcanion and the aforementioned Urshifu-R and Heatran. Keep in mind that this will force a lot of attention on Tapu Fini, which can open up a hole for a teammate.</p> </li> <li> <p>Protect allows Tapu Fini to accumulate Leftovers recovery safely, along with bringing in a teammate that can better support it, such as a Fake Out user like Zeraora.</p> </li> <li> <p>Leftovers recovery is greatly appreciated, as it helps Tapu Fini switch in more, and it's likely to spend several turns on the field attacking or using Calm Mind.</p> </li> <li> <p>Summoning Misty Terrain makes it considerably harder to prevent Tapu Fini from setting up via moves like Toxic.</p> </li> <li> <p>144 Special Attack EVs let Tapu Fini always OHKO Urshifu-R with Moonblast. The Defense EVs and Bold nature allow it to take more physical hits, which Calm Mind doesn't help against, such as Pokemon like Zygarde and Fusion Bolt Kyurem-B. EVs can be shifted from Defense to Speed to outspeed certain threats with speed control.</p> </li> </ul> "
      },
      {
        "name": "Support",
        "description": "<ul> <li> <p>Moonblast hits Fairy-weak Pokemon like Zygarde and Urshifu-R and can claim KOs against foes weakened by Nature's Madness.</p> </li> <li> <p>Nature's Madness weakens foes for Tapu Fini or its teammates to pick off.</p> </li> <li> <p>Icy Wind allows Tapu Fini to provide speed control for its teammates along with punishing and forcing switches.</p> </li> <li> <p>Heal Pulse is particularly useful for Pokemon that lack recovery and and take a lot of hits like defensive Kyurem-B, along with setup sweepers like Dragon Dance Zygarde.</p> </li> <li> <p>Taunt is also an option over ether Icy Wind or Heal Pulse, as it can prevent Trick Room, Tailwind, and other status moves from Pokemon slower than Tapu Fini. However, it can be useless against faster Tailwind setters like Zapdos.</p> </li> <li> <p>Sitrus Berry's burst recovery is preferred over Leftovers's gradual recovery due to this set's tendency to repeatedly switch in-and-out of battle</p> </li> <li> <p>Summoning Misty Terrain is great against Pokemon that rely on Terrain, like Necrozma and Rillaboom.</p> </li> <li> <p>144 Special Attack EVs allow Tapu Fini to always OHKO Urshifu-R with Moonblast. The Defense EVs and Bold nature are used to increase its lower Defense. EVs can be shifted to outspeed certain threats in Tailwind or after Icy Wind.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 294304, "username": "emma"}, {"user_id": 501951, "username": "zeefable"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 531334, "username": "dnagerbdager"}]}
  },
  "Nihilego": {
    "overview": "<p>While Nihilego shines in DOU as a menacing attacker that can quickly turn a game in its favor, it is particularly held back by its one-dimensional nature, lacking coverage, and vulnerability to the tier's various physical threats. Its access to the combination of STAB-boosted Meteor Beam and Beast Boost make it quite dangerous, with the ability to completely dominate the game off a single KO being its main selling point. This is supplemented by its impressive offensive stats, as its base 127 Special Attack is quite high and its Speed allows it to outrun a large swathe of the metagame, only beaten by the likes of Zeraora, Dragapult, and Naganadel. Outside of purely attacking, though, Nihilego can only really utilize its astounding Special Defense to soak some special hits in a pinch; it otherwise offers no team-wide utility whatsoever, which means it's completely useless in opposing speed control, as it wouldn't be able to safely attack. Its paper-thin Defense leaves it prey to the likes of Rillaboom, Urshifu-R, and Zeraora, and it's also completely walled by Zygarde and Metagross. Fake Out and redirection support from Incineroar, Rillaboom, Blastoise, and Amoonguss can be handy in giving it the space to operate, with Incineroar also having Intimidate to hide Nihilego's low Defense, while the likes of Dragapult, Kyurem-B, and Genesect help in making up for Nihilego's lacking coverage. Most glaring, though, is how predictable Nihilego can be, as it practically needs Meteor Beam to be truly threatening, and its set is also essentially telegraphed due to needing both reliable STAB moves and having a lacking movepool.</p> ",
    "comments": "<h1>Other Options</h1> <p>Stealth Rock and Toxic Spikes, used either with Meteor Beam or on a dedicated set with Focus Sash, can give Nihilego the utility it needs to shine in cases where it can't offensively, though they would also exacerbate Nihilego's already existing flaws as an attacker. Dazzling Gleam can be an option to hit Zygarde and Kommo-o as well as for having a spread move to clean with if sufficient Special Attack boosts are accumulated, though neither of Nihilego's STAB moves are easy to give up. Sludge Wave can be used similarly and is a bit stronger due to STAB, but it hitting teammates makes it tough to use effectively.</p> ",
    "sets": [
      {
        "name": "Meteor Beam Attacker",
        "description": "<ul> <li> <p>Meteor Beam, in conjunction with Power Herb, gives Nihilego insane burst damage with a Special Attack boost.</p> </li> <li> <p>Beast Boost lets Nihilego snowball through teams, pairing well with Meteor Beam, as Nihilego instantly gets to +2 Special Attack if it KOes.</p> </li> <li> <p>Power Gem and Sludge Bomb are reliable STAB attacks typically used to get KOs post-Meteor Beam, with Sludge Bomb being the default move for its higher power and Power Gem being handy for hitting Steel-types such as Heatran and Genesect as well as targets such as Kyurem-B, Zapdos, and Volcanion super effectively.</p> </li> <li> <p>Protect gives Nihilego safety as its team maneuvers around current positions, and it can be particularly handy in stalling out field conditions such as Tailwind and Trick Room.</p> </li> <li> <p>The given EV investment maximizes Nihilego's offensive presence, with the Speed in particular letting it get the jump on base 100 Speed Pokemon such as Zapdos and Mew as well as Urshifu-R.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 243662, "username": "Yoda2798"}, {"user_id": 294304, "username": "emma"}]}, {"name": "Grammar checked by", "members": [{"user_id": 297659, "username": "deetah"}]}], "writtenBy": [{"user_id": 215000, "username": "Memoric"}]}
  },
  "Celesteela": {"sets": [{"name": "Bulky Leech Seed", "description": "<ul> <li>The EV Spread allows Celesteela to survive a Thunderbolt from Choice Specs Tapu Koko in Electric Terrain.</li> </ul> <p>This is a sample set while we are currently working on analyses in <a href=\"http://www.smogon.com/forums/forums/doubles-ou-analyses.541/\">Contributions and Corrections</a>.</p> "}]},
  "Necrozma": {
    "overview": "<p>Necrozma is one of the most powerful attackers in Doubles OU, threatening to 2HKO the entire tier with Expanding Force under Psychic Terrain at +1, which it can easily get to with the combination of Power Herb and Meteor Beam. With many common Psychic-resistant and -immune Pokemon in the metagame such as Heatran and Incineroar folding to its coverage options like Earth Power and Meteor Beam, Necrozma can easily plow through teams once if it gets the necessary support. It fits best of on hyper offense builds where the goal is to win games in as few turns as possible. Psychic Terrain support, which powers up Expanding Force and blocks priority, is critical to Necrozma's success, making either Tapu Lele or Indeedee-F mandatory teammates. Pokemon that can break through Steel- and Dark-types such as Urshifu-R and Heatran also make excellent partners, enabling Necrozma to keep using Expanding Force without worry. While Necrozma can end games once it gets going, it can be slowed down in multiple ways. Rillaboom and Tapu Fini can reliably switch in multiple times and reset Terrain, which heavily weakens Expanding Force, with the former also threatening Necrozma with Fake Out. Opposing Tailwind setters such as Zapdos and Mew also work well against it, as well as other forms of speed control users such as Icy Wind Kyurem-B and Trick Room Diancie. Additionally, while Pokemon such as Incineroar, Heatran, and Metagross must fear Necrozma's coverage, they can all switch into Expanding Force and slow it down.</p> ",
    "comments": "<h1>Other Options</h1> <p>Trick Room gives Necrozma a way to control its own Speed and decide the pace of the game, but it comes at the cost of valuable coverage. Weakness Policy is another way to boost that has a bigger payoff, but it's less reliable and Necrozma loses the one-time Meteor Beam nuke. Heat Wave is an alternative coverage option that's better against Genesect, but it is generally inferior to Earth Power's ability to hit Heatran and Incineroar. Stealth Rock can be used to secure chip damage on incoming foes, notably Incineroar, but it can be a momentum loss to uses and Necrozma prefers using its coverage to take down its foes.</p> ",
    "sets": [
      {
        "name": "Power Herb",
        "description": "<ul> <li> <p>Expanding Force is a decimating STAB attack under Psychic Terrain that is able to 2HKO almost the entire tier after a Special Attack boost, including threats such as Assault Vest Kyurem-B. It also has the added benefit of hitting both foes when Psychic Terrain is up, though keep in mind that it's much weaker if a different Terrain is active.</p> </li> <li> <p>Meteor Beam, in conjunction with Power Herb, boosts Necrozma's Special Attack by one stage and cripples common switch-ins such as Assault Vest Kyurem-B and Incineroar.</p> </li> <li> <p>Earth Power hits many common Psychic-resistant and -immune Pokemon such as Heatran, Metagross, and Incineroar for super effective damage.</p> </li> <li> <p>Protect shields Necrozma for a turn, letting its partner reposition, set Tailwind, or target one of Necrozma's checks. It can also be used for stalling out adverse field conditions, such as Trick Room and opposing Tailwind.</p> </li> <li> <p>Prism Armor helps keep Necrozma safe from Dragapult and Genesect's STAB moves. Notably, Necrozma can always take a Choice Specs-boosted Shadow Ball from Dragapult at full health.</p> </li> <li> <p>A Modest nature is preferred to maximize Necrozma's damage output, but Timid can be used to always outspeed Heatran. A Quiet nature, along with shifting EVs from Speed to HP and lowering its Speed IVs, can be used if Necrozma is on a Trick Room-oriented build.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 501951, "username": "zeefable"}, {"user_id": 215000, "username": "Memoric"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Estronic"}]}], "writtenBy": [{"user_id": 294304, "username": "emma"}]}
  },
  "Zeraora": {"sets": [{"name": "Utility"}]},
  "Rillaboom": {
    "overview": "<p>Rillaboom is among the best pivots in the metagame thanks to its excellent ability, useful utility moves, and strong priority STAB attack. Grassy Surge lets Rillaboom set Grassy Terrain on switch-in, providing passive healing for teammates and slowing down threats that benefit from Psychic Terrain such as Necrozma. Grassy Glide is given priority and boosted by Grassy Terrain, letting Rillaboom soft check a wide variety of threats regardless of Speed, such as boosted Dragon Dance Zygarde and Diancie under Trick Room, as well as picking off any Pokemon low on health. Rillaboom works well on a variety of team archetypes thanks to the sheer utility it provides. For example, structures that rely on Trick Room or setup appreciate Rillaboom’s ability to create safe turns through the use of Fake Out, while the latter also appreciates Grassy Terrain's passive healing to keep wincons healthy. Volcanion and Urshifu-R synergize well with Rillaboom, as they remove Fire-types and Kyurem-B, respectively, and in return, Rillaboom checks Water-types such as Tapu Fini. Rillaboom is not without faults, though; its Grass typing leaves it with a plethora of weaknesses that are exposed by common Pokemon such as Kyurem-B and Genesect, and it can be tricky to use alongside other Terrain setters. It's also worn down quickly by pivoting in and out, especially with entry hazards up, as it typically has no recovery besides Grassy Terrain and doesn't carry Protect, leaving it open to being attacked every turn and susceptible to double targets.</p> ",
    "comments": "<h1>Other Options</h1> <p>Superpower is an option over Wood Hammer to hit Heatran and Kyurem-B, while High Horsepower secures an OHKO on Heatran and is better against Metagross, but it leaves Rillaboom toothless against Kyurem-B. If using High Horsepower, Rillaboom can also run a more offensive spread with a Jolly nature to always outspeed Heatran. Knock Off is also available to hit Dragapult, but all three alternatives mean missing out on your most powerful STAB attack. Eject Button is an option to switch in, set Terrain, and immediately pivot out to a strong attacker on more offensive teams if keeping up momentum is preferred over longevity. A Choice Band set can deal massive damage, notably securing the OHKO on Urshifu-R with Grassy Glide under Grassy Terrain, but it loses out on Fake Out and overall support value. Miracle Seed is another option to make sure Rillaboom can OHKO Urshifu-R while retaining Fake Out, but it's significantly weaker than Choice Band and generally inferior to Assault Vest and Eject Button besides from that one benchmark.</p> ",
    "sets": [
      {
        "name": "Bulky Pivot",
        "description": "<ul> <li> <p>Fake Out puts one of the opponent’s Pokemon out of commission for a turn, giving your partner a safe turn to create progress.</p> </li> <li> <p>Grassy Glide is a strong priority STAB move under Grassy Terrain that hits Water- and Rock-types such as Tapu Fini, Urshifu-R, and Diancie for super effective damage. It also can pick off faster threats such as Urshifu-R and Nihilego as well as Diancie under Trick Room.</p> </li> <li> <p>Wood Hammer is Rillaboom's strongest attack that is most useful for hitting slower, bulkier targets such as Tapu Fini, Blastoise, and Diancie outside of Trick Room. It also threatens an OHKO on Zeraora and a 2HKO on Zygarde under Grassy Terrain, which Grassy Glide can't do.</p> </li> <li> <p>U-turn helps make Rillaboom an excellent pivot by being able to switch out of disadvantageous positions and bring in a Pokemon with a better matchup. It also does a solid amount of damage to opposing Rillaboom.</p> </li> <li> <p>The given EVs, combined with Assault Vest, let Rillaboom survive a +1 Sludge Bomb from Nihilego, Charcoal-boosted Eruption from Heatran, and +1 U-turn from Genesect. The rest of the EVs are dumped into Attack to hit as hard as possible. EVs can be shifted from Defense to Speed to outspeed threats such as Zeraora under Tailwind.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 501951, "username": "zeefable"}, {"user_id": 215000, "username": "Memoric"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Estronic"}]}], "writtenBy": [{"user_id": 294304, "username": "emma"}]}
  },
  "Hatterene": {"sets": [{"name": "Offensive Trick Room"}]},
  "Indeedee-F": {"sets": [{"name": "Follow Me Support"}]},
  "Dracovish": {"sets": [{"name": "Choiced Attacker"}]},
  "Dragapult": {
    "overview": "<p>Dragapult is useful on a wide variety of teams for its great typing and Speed. Its Dragon / Ghost typing lets it switch into Pokemon like Urshifu-R, and Heatran. It's also a great offensive typing, as Ghost-type moves are virtually unresisted in the metagame bar Pokemon like Incineroar and Porygon2, and Dragon-type moves hit many important targets like Kyurem-B and Zygarde. Its Speed allows it to outpace the vast majority of the unboosted metagame. These qualities allow it to handle many great Pokemon like Urshifu-R, and Zygarde, along with other Pokemon like Rillaboom and Necrozma. Its Choice Specs set can apply pressure instantly, while conversely, its Dragon Dance set can end a game outright if given the freedom to set up. However, Dragapult is heavily relies on its Speed, and its lack of bulk can give it trouble with speed control and switching in. Both sets can also feel underwhelming at times, as the Choice Specs set has to make use of Dragapult's mere base 100 Special Attack, while the Dragon Dance set is reliant on getting boosts to become threatening and lacks reliable STAB moves. As a result, it can struggle to break bulkier Pokemon like Porygon2 and Amoonguss, and it falls easily to faster attackers like Choice Scarf Genesect and Dragon Dance-boosted Kyurem-B. Dragapult also loathes Tapu Fini, as Misty Terrain severely limits Dragapult's offensive pressure, and Tapu Fini can OHKO it after minimal chip. This weakness to Tapu Fini makes Rillaboom a prime partner for the drake; Rillaboom can change the Terrain and provide openings for Dragapult to set up via Fake Out. Blastoise is a good partner for the Dragon Dance set, as it packs both Fake Out and Follow Me. Diancie is also another good partner for Dragapult, as it handles Kyurem-B and Incineroar well.</p> ",
    "comments": "<h1>Other Options</h1> <p>Dragon Fang is an option over Life Orb on the Dragon Dance set, as it boosts Dragapult's main source of damage without the recoil, but is significantly weaker. Thunderbolt can be run in the fourth slot to hit Water- and Flying-types like Tapu Fini and Galarian Moltres. While it does 2HKO Tapu Fini, it is generally an inferior option to U-turn or Hydro Pump.</p> ",
    "sets": [
      {
        "name": "Special Attacker",
        "description": "<ul> <li> <p>Dragapult's dual STAB moves provide great neutral coverage against the majority of the tier, if not hitting them super effectively. Draco Meteor in particular is used for high burst damage and hitting bulky Dragon types like Zygarde and Kyurem-B, while Shadow Ball deals more consistent damage and is minimally resisted in the tier, making it a safer STAB move to lock into if Dragapult needs to attack consecutively.</p> </li> <li> <p>Flamethrower allows Dragapult to hit Grass- and Steel- types such as Rillaboom, Amoonguss, and Genesect. Genesect is OHKOed, while Rillaboom and Amoonguss are dented by it. Fire Blast has less than perfect accuracy, but it guarantees a 2HKO on Rillaboom and Amoonguss.</p> </li> <li> <p>U-turn can allow Dragapult to keep momentum, as its great Speed and ability to force switch-ins often grant it solid opportunities to rotate out, while Hydro Pump allows Dragapult to hit Heatran, Incineroar, and Diancie.</p> </li> <li> <p>Life Orb is also an option over Choice Specs, giving Dragapult the option to switch moves, but reducing its overall longevity and cutting into its power noticeably. If running Life Orb, the fourth slot should go to Protect.</p> </li> <li> <p>Infiltrator allows Dragapult to attack Volcanion and Zygarde hiding behind Substitute.</p> </li> <li> <p>A Timid nature is needed to Speed tie against other Dragapult, while Modest is also an option to hit considerably harder, and guarantees the 2HKO on Heatran with Shadow Ball.</p> </li> </ul> "
      },
      {
        "name": "Dragon Dance",
        "description": "<ul> <li> <p>Dragon Claw is the more consistent option for single target damage, while Dragon Darts hits both targets and can potentially deal more single target damage thanks to its smart targeting, causing it to avoid targeting a Fairy-type or Pokemon using Protect, which makes both hits attack a singular target.</p> </li> <li> <p>Phantom Force is Dragapult's most powerful Ghost-type STAB move that allows it to dodge incoming attacks and break Protect for itself and its allies, creating some valuable openings. However, its charging turn leaves the opponent open to appropriately responding to the incoming attack, such as with Normal-type switch-ins like Porygon2 and Indeedee or attacks after Phantom Force for the KO.</p> </li> <li> <p>Dragon Dance brings Dragapult's Attack to impressive levels, making it an immensely dangerous sweeping threat after a single boost. At +1, Dragapult OHKOes Zygarde with Dragon Claw, and it can OHKO Urshifu-R with Phantom Force at +2. The extra Speed can also help in certain scenarios, such as outspeeding Zygarde in Tailwind after a boost.</p> </li> <li> <p>Protect allows Dragapult to avoid potentially dangerous moves and gives it a better opportunity to set up by allowing allies such as Blastoise and Rillaboom to come to its aid with Follow Me and Fake Out.</p> </li> <li> <p>Life Orb boosts Dragapult's power significantly, allowing it to KO foes like bulky Necrozma with Phantom Force and Defensive Kyurem-B with Dragon Claw, at +1 Attack.</p> </li> <li> <p>Clear Body's primary function is to block Intimidate, but it can also come in handy for some stat-lowering moves such as Parting Shot and Icy Wind.</p> </li> <li> <p>A Jolly nature is required to outspeed Zygarde in Tailwind at +1.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 501951, "username": "zeefable"}, {"user_id": 294304, "username": "emma"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Estronic"}]}], "writtenBy": [{"user_id": 531334, "username": "dnagerbdager"}]}
  },
  "Urshifu-Rapid-Strike": {
    "overview": "<p>Urshifu-R is one of the most threatening offensive Pokemon in Doubles, possessing a monstrous base 130 Attack, a great offensive typing, and the unique ability to bypass most traditional defensive counterplay such as Intimidate, Protect, and Defense boosting thanks to the combination of Unseen Fist ignoring protection and Surging Strikes's guaranteed critical hits. This makes it one of the strongest candidates to answer metagame staples like Kyurem-B, Incineroar, Porygon2, and Diancie. Due to Urshifu-R's excellent offensive prowess, defensive answers are limited to mainly just Amoonguss and Tapu Fini, two Pokemon that resist all of its STAB attacks. Instead, it is often answered offensively by the likes of Rillaboom, Dragapult, and Necrozma. Urshifu-R is held back by a fairly middling Speed tier, meaning pairing it with speed control and priority will be very helpful. As such, Zapdos and Naganadel are excellent partners, providing Tailwind support and a way to match up well against Water-types. Other examples of good teammates include Tapu Lele and Indeedee-F for providing Psychic Terrain, which keeps Urshifu-R safe from priority moves like Fake Out and Grassy Glide, and Heatran, which is excellent for hitting Grass-types.</p> ",
    "comments": "<h1>Other Options</h1> <p>Urshifu-R can outrun the entire unboosted metagame with a Choice Scarf; however, this comes at a significant decrease in power, as it loses its ability to OHKO Porygon2 and Genesect. An Adamant nature can be used to deal even more damage, but runs the risk of being outsped by Jolly Kyurem-B, Timid Tapu Lele, and opposing Urshifu-R.</p> ",
    "sets": [
      {
        "name": "Offensive",
        "description": "<ul> <li> <p>Surging Strikes is incredibly free to use thanks to its guaranteed critical hits bypassing any form of damage reduction, like Intimidate. It can easily pick up OHKOs on Incineroar, Landorus-T, and Diancie.</p> </li> <li> <p>Close Combat is Urshifu-R's strongest attack, possessing the rare ability to OHKO Kyurem-B and Porygon2. Even neutral foes like Rillaboom and Volcanion will take a large amount of damage from it.</p> </li> <li> <p>Ice Punch is useful for securing the OHKO on Zygarde and Dragapult, while Aqua Jet is reliable priority that can pick off foes with low Defense like Volcarona and Nihilego.</p> </li> <li> <p>U-turn is a decently hard-hitting move that allows Urshifu-R to pivot out of unfavorable situations. This can be especially useful for the opposing Grass-types it baits in, letting it switch out to proper checks. Protect is important on Life Orb sets for keeping Urshifu-R safe from the Grass- and Electric-type attacks that it often baits in.</p> </li> <li> <p>A Choice Band and maxed out Attack EVs allow Urshifu-R to make the most out of its offensive potential, notably scoring the OHKO on physically defensive Porygon2, which Life Orb sets cannot. However, Life Orb allows Urshifu-R to switch moves and run Protect, but comes at the cost of recoil. 252 Speed EVs and a Jolly nature let Urshifu-R outspeed base 95s like Kyurem-B and Tapu Lele.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 188164, "username": "MajorBowman"}, {"user_id": 243662, "username": "Yoda2798"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 501951, "username": "zeefable"}]}
  },
  "Spectrier": {"sets": [{"name": "Fast Attacker"}]}
}