{
  "Cresselia": {"sets": {"Skill Swap": {}, "Icy Wind": {}, "Choice Scarf": {}, "Defensive Kee Berry": {}, "Fast Kee Berry": {}}},
  "Venusaur": {"sets": {"Substitute + Leech Seed": {}, "Custap Berry": {}}},
  "Blastoise": {"sets": {"Life Orb": {}, "Wacan Berry": {}}},
  "Nidoking": {"sets": {"Life Orb": {}, "Choice Scarf": {}}},
  "Clefable": {"sets": {"Rocky Helmet": {}, "Sitrus Berry": {}}},
  "Ninetales": {"sets": {"Life Orb": {}, "Choice Specs": {}}},
  "Ninetales-Alola": {"sets": {"Encore + Disable": {}, "Life Orb": {}}},
  "Arcanine": {"sets": {"Assault Vest": {}, "Sitrus Berry": {}, "Choice Band": {}, "Choice Scarf": {}}},
  "Tentacruel": {"sets": {"Assault Vest": {}}},
  "Slowbro-Galar": {"sets": {"Weakness Policy": {}}},
  "Gengar": {"sets": {"Life Orb": {}, "Choice Specs": {}}},
  "Marowak-Alola": {"sets": {"Lightning Rod": {}}},
  "Chansey": {
    "sets": {
      "Stall": {
        "description": "<p>Chansey is one of the bulkier walls by virtue of high HP and Eviolite, walling many prominent special attackers such as Primarina, Magnezone, and Volcanion. Toxic helps dispatch threats that can heal up on Chansey such as defensive Arcanine, Roost Kyurem, and non-Rest Togekiss. Soft-Boiled helps to keep Chansey at high HP while slowly whittling down the foe with the combination of Seismic Toss and Toxic. While Chansey's physical bulk is not nearly as good as its special bulk, the given EV investment allows for its to be as physically bulky as possible, giving it the best chance to survive a hit from Choice item Haxorus, Choice Scarf Galarian Darmanitan, and non-Swords Dance Landorus-Therian, to OHKO them with Counter. Charm is an option over Counter to handle physical attackers that would like to set up on Chansey such as Shell Smash Crustle, Swords Dance Landorus-Therian, and non-Taunt Bulk Up Zeraora. Charm should be used to PP stall and negate boosts from the foe's setup moves to a point where any combination of Chansey's moves will win. Do note that replacing Counter with Charm usually results in losing matchups against Choice Band users such as Landorus-Therian and Choice Band Zeraora, which can 2HKO Chansey through Charm.</p> <p>Chansey is taken advantage of by Choice item attackers with Trick such as Cresselia, Porygon-Z, and Tapu Fini. Toxic can assist in dealing certain anti-stall measures such as Encore and Trick Togekiss and some Fake Tears Sylveon. Versus Sylveon it is optimal to use Toxic on the first turn, then Seismic Toss, then Soft-Boiled, and finally Seismic Toss to avoid being KOed by Hyper Beam at -6. Good teammates for Chansey are attackers that don't care about Trick and are able to retaliate, such as Assault Vest or Choice item Metagross and Aromatisse. Chansey also doesn't appreciate faster Taunt users such as Spectrier and Corviknight, as they PP stall Chansey and slowly chip it down. Good partners that alleviate this weakness include Choice Scarf Galarian Darminatan and Zeraora.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 480297, "username": "zioziotrip"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 317056, "username": "dogknees"}, {"user_id": 276708, "username": "Ginger Princess"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}]}]}
  },
  "Gyarados": {"sets": {"Choice Band": {}, "Dragon Dance": {}}},
  "Zapdos": {
    "sets": {
      "Maranga Berry + Eerie Impulse": {
        "description": "<h4>Set Description</h4> <p>The combination of Substitute and Roost allows Zapdos to stall out foes by decreasing their PP. Thunderbolt helps versus Trick + Choice Scarf and Encore users like Togekiss and Primarina, respectively. However, this set uniquely beats Pokemon like Choice Specs Porygon-Z and Volcanion as well, using Eerie Impulse to survive their strong hits.</p> <h4>EVs</h4> <p>76 Speed EVs with a Timid nature get the jump on Modest Porygon-Z, and the special bulk allows Zapdos to survive Draco Meteor from Modest Choice Specs Naganadel. The remaining EVs are put in Defense to help versus Pokemon like Choice Band Kartana and Assault Vest Arcanine.</p> <h4>Usage Tips</h4> <p>Against SubSeed Rillaboom, use Substitute turn 1 to block Leech Seed, but use Roost against faster special attackers like Naganadel to capitalize on the Maranga Berry boost. Eerie Impulse helps Zapdos survive hits from slower special attackers such as Choice Specs Porygon-Z. Instead of a status move, Zapdos should use Thunderbolt versus Encore users like Primarina, as well as faster Taunt or Trick users such as Tapu Fini and Togekiss.</p>"
      },
      "Offensive Life Orb": {
        "description": "<h4>Set Description</h4> <p>Life Orb Zapdos OHKOes prominent threats with its STAB Hurricane, like both Urshifu formes and Volcarona. Heat Wave provides a super effective move against Steel-types like Magnezone and Ferrothorn. Thunderbolt allows Zapdos to beat Pokemon like Togekiss, Volcanion, and Primarina, but Thunder may be used instead to OHKO bulky Primarina. Protect provides insurance against Custap Berry users like Galarian Moltres and Primarina, while Laser Focus + Heat Wave beats Registeel. Metal Sound helps versus Calm Mind stall Pokemon like Cresselia.</p> <h4>EVs</h4> <p>Maximum Speed EVs let Zapdos outspeed both Urshifu formes and Speed tie with other base 100 Speed Pokemon like opposing Zapdos, Volcarona, and Entei. The HP and Special Defense investment is used to tank Overheat from Volcanion after Life Orb recoil.</p> <h4>Usage Tips</h4> <p>Usually use Hurricane on neutral targets, as it will do the most damage, and use super effective moves when applicable. If running Thunderbolt, use it versus Primarina, and use Protect if it doesn't OHKO to safeguard against Custap Berry sets. Laser Focus should be used turn 1 versus stall Pokemon like Registeel.</p>"
      },
      "Eerie Impulse + Life Orb": {"description": "<h4>Set Description</h4> <p>Zapdos combines its defensive and offensive utility in this set. Eerie Impulse and Roost allow it to survive hits from slower special attackers like Choice Specs Porygon-Z, Volcanion, and Primarina. Charge Beam improves the Cresselia matchup, as it can boost Zapdos's Special Attack and has a lot of PP. Hurricane hits both Urshifu formes for super effective damage while providing a high damage output overall.</p> <h4>EVs</h4> <p>232 Speed EVs with the Timid nature get the jump on both Urshifu formes, and the 96 Special Defense EVs allow Zapdos to survive a Hyper Beam from Choice Specs Porygon-Z after an Eerie Impulse.</p> <h4>Usage Tips</h4> <p>Use Eerie Impulse against threatening special attackers such as Porygon-Z. When attacking, use the strongest move, except against Cresselia. There, use Charge Beam in tandem with Eerie Impulse and Roost until Zapdos can do considerable damage with Hurricane.</p>"},
      "PP Stall": {
        "description": "<h4>Set Description</h4> <p>Zapdos can effectively stall out foes' PP with its ability Pressure and Substitute + Protect. Substitute can block status moves from Pokemon like SubSeed Celesteela and Rillaboom. Protect lets Zapdos scout the foe's move. Toxic is extremely useful to KO foes more quickly and cripple other stall Pokemon lacking Rest, like stall Cresselia or Gastrodon. Thunderbolt prevents Zapdos from being a fully passive option. It can deal super effective damage to Trick + Choice Scarf and Taunt users such as Togekiss and Tapu Fini.</p> <h4>EVs</h4> <p>Maximum Speed investment allows Zapdos to Speed tie other base 100 Speed Pokemon like Entei, Volcarona, and opposing Zapdos and Galarian Zapdos. The 200 HP EVs allow Substitute to be used five times, and the remaining EVs are put in Defense to reduce damage from opposing Struggle.</p> <h4>Usage Tips</h4> <p>Use Protect first to quickly start stalling and block status moves, then use Substitute to block the foe's next move. Zapdos can continue this cycle until their PP is depleted. Toxic can be used when behind a Substitute, putting foes on a timer. Thunderbolt should be used against Trick + Choice Scarf or Taunt users like Togekiss and Tapu Fini, as well as Primarina due to Encore.</p>"
      },
      "Choice Specs": {"description": "<h4>Set Description</h4> <p>Thunderbolt and Hurricane are strong STAB moves that KO top-tier Pokemon like Togekiss, Tapu Fini, and both Urshifu formes. Heat Wave hits Steel-types like Ferrothorn, Magnezone, and certain Metagross sets hard, while Charge Beam improves the Cresselia matchup. Static can potentially cripple physical attackers such as Arcanine and Urshifu-R. Pressure can be used to potentially bluff a stall set.</p> <h4>EVs</h4> <p>This set runs maximum Speed EVs to Speed tie other base 100 Speed Pokemon like Entei, Volcarona, and opposing Zapdos and Galarian Zapdos.</p> <h4>Usage Tips</h4> <p>Usually, use the strongest move for the target, but against Cresselia, use Charge Beam so Zapdos can keep up with Cresselia's Calm Mind boosts.</p>"},
      "Custap Berry": {}
    },
    "credits": {"writtenBy": [], "teams": [{"name": "Quality checked by", "members": [{"user_id": 430787, "username": "PA"}, {"user_id": 501918, "username": "Here Comes Team Charm!"}, {"user_id": 249890, "username": "zo"}, {"user_id": 579035, "username": "glitched"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}]}
  },
  "Zapdos-Galar": {"sets": {"Custap Berry": {}, "Weakness Policy": {}, "Choice Band": {}, "Assault Vest": {}}},
  "Moltres": {"sets": {"Maranga Berry Stall": {}}},
  "Moltres-Galar": {
    "comments": "<h3>Other Options</h3> <p>Galarian Moltres may also use Sitrus Berry to beat Assault Vest Entei or Wacan Berry to beat Regieleki.</p>",
    "sets": {
      "Custap Berry": {
        "description": "<h4>Set Description</h4> <p>Galarian Moltres is a bulky special attacker that uses Special Attack boosts from Berserk and Nasty Plot to overwhelm its opponents. Its typing allows it to beat Dragapult, Cresselia, Spectrier, and both Urshifu formes with STAB Fiery Wrath and Hurricane. Endure + Custap Berry provides a free turn versus most Pokemon to attack, setup Nasty Plot, or use Endure on frail offensive Pokemon like Choice item Galarian Darmanitan. Galarian Moltres has good matchups against Pokemon like stall Azumarill, some Ferrothorn, and most Celesteela thanks to Nasty Plot.</p> <h4>EVs</h4> <p>140 HP and 248 Defense EVs allow Galarian Moltres to survive Outrage from Adamant Choice Band Haxorus and Fishious Rend from Adamant Choice Scarf Dracovish. The remaining EVs are put into Special Attack for maximum damage output.</p> <p>An alternate EV spread of 80 HP / 192 Def / 124 SpA / 112 Spe with a Modest nature has a better SubSeed Celesteela and Taunt Corviknight matchup, but has worse matchups versus Haxorus and Dracovish. The Defense EVs survive Close Combat from Choice Band Urshifu, while the HP EVs allow Galarian Moltres to live Choice Specs Volcanion's Overheat. The Speed investment is for Celesteela while the remaining EVs are put in Special Attack.</p> <h4>Usage Tips</h4> <p>Against Pokemon that cannot threaten to OHKO Galarian Moltres, such as Haxorus, Urshifu, and Naganadel, it should attack on turn 1. An exception to this is Celesteela, where Galarian Moltres should use Nasty Plot once and 2HKO with Fiery Wrath afterward. Against foes that threaten to OHKO Galarian Moltres, such as Galarian Darmanitan, Endure allows it to survive the hit and OHKO back.</p> <p>When facing foes that both have the option of OHKOing Galarian Moltres or not, such as Porygon-Z and Life Orb Dracovish, Galarian Moltres can either use Endure against a move that would otherwise OHKO, or predict that the foe will play around it and use an attacking move or Nasty Plot to save Endure for the next turn. Some prediction is also required versus Metagross, since Nasty Plot should be used on Weakness Policy variants, while Fiery Wrath is used on other variants.</p>"
      },
      "Assault Vest": {
        "description": "<h4>Set Description</h4> <p>Assault Vest Galarian is strong against special attackers, such as Magnezone, Volcanion, and non-Life Orb Porygon-Z. It is also strong against common Custap Berry users, such as Magnezone and Sawk. Snarl has reliable matchups against Porygon-Z, Magnezone, Volcanion, and Heatran.</p> <h4>EVs</h4> <p>The HP and Defense investment enables Galarian Moltres to survive a Meteor Mash from +2 Adamant Metagross.</p> <p>The Special Defense allows it to beat Choice Specs Magnezone. The Speed investment is for Modest Magnezone, and the remaining EVs are put into Special Attack.</p> <h4>Usage Tips</h4> <p>Against an opposing Porygon-Z, Galarian Moltres should use Snarl on turn 1, Fiery Wrath on turn 2, and Sucker Punch on turn 3. Against an opposing Metagross, Galarian Moltres should use Fiery Wrath turn 1. If the damage reveals Assault Vest Metagross, then it should use another Fiery Wrath and then use Sucker Punch on turn 3. If the opposing Metagross either is a Weakness Policy or Choice Band set, Galarian Moltres should use Sucker Punch immediately afterward. Against an opposing Magnezone, Galarian Moltres should use Snarl on the first two turns, Fiery Wrath on turn 3, and Sucker Punch on turn 4.</p>"
      },
      "Rocky Helmet": {
        "description": "<h4>Set Description</h4> <p>Rocky Helmet Galarian Moltres uses Nasty Plot and Taunt to have better matchups versus stall Pokemon, such as Ferrothorn and Chansey, and physical attackers, such as Assault Vest Metagross and specially defensive Haxorus, while still hitting Dark-, Ghost-, Fighting-, and Grass-types with its STAB moves.</p> <h4>EVs</h4> <p>The HP and Defense EVs allow Galarian Moltres to not be 2HKOed by Gyro Ball from non-Adamant Ferrothorn while maximizing odds against Choice Scarf Volcanion. The Special Attack allows Galarian Moltres to OHKO most Ferrothorn sets after a Nasty Plot, a boost from Berserk, and a turn of Rocky Helmet damage. The remaining EVs are put in Speed.</p> <h4>Usage Tips</h4> <p>Against an opposing Ferrothorn, Galarian Moltres should use Nasty Plot on turn 1, Taunt on turn 2, and Hurricane on turn 3. Against an opposing Chansey, Galarian Moltres should always use Taunt on turn 1, Nasty Plot on turn 2, and Fiery Wrath on turn 3. If Chansey uses Seismic Toss once during the first three turns, Galarian Moltres can use Taunt again and use Fiery Wrath twice to secure the win. If Chansey uses Seismic Toss twice during the first three turns, Galarian Moltres should use Taunt on turn 4 and Hurricane on turn 5 to secure the win. If Chansey uses Seismic Toss on all three of the first three turns, Galarian Moltres should use Fiery Wrath on turn 4 to secure the win. However, against specially defensive Chansey sets, some prediction is required with when to use Taunt.</p> <p>Some prediction is also required against Metagross, as Galarian Moltres should use Nasty Plot against Weakness Policy variants and Fiery Wrath against all other sets.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 579035, "username": "glitched"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 234355, "username": "DEG"}]}, {"name": "Grammar checked by", "members": [{"user_id": 493772, "username": "bellchime"}, {"user_id": 523866, "username": "UT"}]}]}
  },
  "Azumarill": {
    "comments": "<h3>Other Options</h3> <p>Azumarill can use Belly Drum to destroy stall Pokemon like Registeel and Galarian Corsola, but it loses longevity and is inconsistent. With either alternate EV spread of the Assault Vest set, Azumarill can use Iron Tail on the Assault Vest set to have a more reliable matchup versus Sylveon. Scald is also an option on stall Azumarill for a better matchup against foes that can boost past Azumarill's Charm, like Swords Dance Garchomp and Iron Defense + Body Press Ferrothorn, although this can be inconsistent due to it relying on burns.</p>",
    "sets": {
      "Choice Band": {
        "description": "<h4>Set Description</h4> <p>Huge Power and Choice Band boost Azumarill's Attack to demolish foes. Liquidation and Play Rough hit type-weak and neutral targets like Arcanine, Garchomp, Tapu Lele, and Metagross hard. Aqua Jet is used for Pressure Entei and Nihilego, while Iron Tail is used for Fairy-types like Aromatisse and Sylveon. Knock Off is for better odds against Spectrier and Aegislash. Azumarill is very good for dealing with soft checks to Fairy-types such as Goodra and Tyranitar due to it hitting physically, unlike most viable Fairy-types. Choice Band guarantees it KOes most of its targets.</p> <h4>EVs</h4> <p>The bulk EVs allow Azumarill to survive Choice Band Urshifu's Poison Jab and non-Choice Specs Sylveon's Hyper Beam. The 6 Speed IVs let it underspeed Aegislash, hitting its Blade forme after it attacks.</p> <h4>Usage Tips</h4> <p>Against Entei, you want to use Aqua Jet, since using Liquidation can make Azumarill run out of PP against Protect + Substitute variants.</p>"
      },
      "Assault Vest": {
        "description": "<h4>Set Description</h4> <p>Assault Vest allows Azumarill to survive strong and super effective special attackers that it previously could not handle, such as Magnezone and Primarina. Superpower beats Magnezone and non-Reflect and non-Choice Specs Porygon-Z. Dig can be used to greatly improve the odds to beat Naganadel while still beating Magnezone. Aqua Jet picks off weakened foes, Custap Berry users, and Sturdy users like Magnezone, Garchomp, Primarina, and Porygon-Z.</p> <h4>EVs</h4> <p>The bulk investment and Assault Vest allow Azumarill to survive Choice Specs Magnezone's Thunderbolt and Choice Band Urshifu's Poison Jab. The rest is dumped into Attack, notably improving your odds against Togekiss, Primarina, Magnezone, and Garchomp.</p> <p>An alternate spread of 88 HP / 168 Atk / 252 SpD with a Careful  nature lets Azumarill tank Choice Specs Porygon-Z's Hyper Beam while maximizing Attack.</p> <h4>Usage Tips</h4> <p>Using the highest damaging move will most likely give you the win. Against low health foes, especially Custap Berry + Sturdy users like Sawk and Magnezone, you should always use Aqua Jet to KO them. Against opponents like Aromatisse, Gardevoir, or Ninetales-Alola which may be using Encore and Disable together, you should alternate between Play Rough and Liquidation to secure the matchup. Specifically against Gardevoir, if put in a situation where Azumarill has a move disabled and Gardevoir can click Encore the next turn without the move failing, Azumarill should click Aqua Jet so that it cannot be forced to Struggle. However, against Salazzle, Azumarill should instead switch between Liquidation and Aqua Jet to avoid being forced to struggle. Against Sawk and non-Choice Band Crustle, prediction is required with using Aqua Jet and either Liquidation or Play Rough to avoid the foe's Counter OHKOing Azumarill.</p>"
      },
      "Stall": {
        "description": "<h4>Set Description</h4> <p>This set stalls out would-be checks such as Celesteela and Grass types such as Rillaboom, Zarude, and some Tapu Bulu sets. Amnesia and Charm both weaken incoming attacks, eventually letting Azumarill chip foes down with Seismic Toss. Icy Wind can be used over Seismic Toss to beat Aggron and secure the matchup against all Tapu Bulu sets, and Rest provides recovery and removes status conditions, such as Entei's Toxic. Additionally, Sap Sipper gives Azumarill an immunity to incoming Grass-type attacks from foes like Rillaboom, Tapu Bulu, and Zarude, and it prevents Leech Seed users like Whimsicott from taking advantage of Azumarill's passivity.</p> <h4>EVs</h4> <p>The Defense investment allows Azumarill to survive a Poison Jab followed by a Charm-weakened Poison Jab from Choice Band Urshifu, as well as the best odds of defeating Galarian Darmanitan, since having maximum Defense EVs does not change the roll. The rest of the EVs are dumped into Special Defense for improved odds to beat Timid Porygon-Z and Choice Specs Spectrier. Minimizing Azumarill's Attack helps to lower confusion self-damage, which slightly improves the matchup against foes like Galarian Moltres.</p> <h4>Usage Tips</h4> <p>Against Tapu Fini, Azumarill should use Amnesia once and then repeatedly use Seismic Toss. This takes advantage of Tapu Fini's tendency to Iron Defense immediately against Azumarill. By boosting its Special Defense, Azumarill lowers the healing Tapu Fini gets from Draining Kiss, so it cannot outheal Azumarill's Seismic Toss. When facing Entei, you should continuously use Seismic Toss to beat it reliably. When using Icy Wind against Aggron, Azumarill should use Icy Wind turn 1. If Aggron uses Head Smash, Rest should be used until the foe faints from recoil damage. If Aggron uses any other move, Azumarill should use a combination of Charm and Rest to stall out Aggron's pp instead.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 576556, "username": "fake tom numbers"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 518399, "username": "Itchy"}, {"user_id": 545212, "username": "luser"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}]}
  },
  "Quagsire": {"sets": {"Rocky Helmet": {}}},
  "Slowking-Galar": {"sets": {"Choice Specs": {}}},
  "Steelix": {"sets": {"Choice Band": {}, "Weakness Policy": {}, "Iron Defense + Body Press": {}}},
  "Corsola-Galar": {"sets": {"Stall": {}}},
  "Skarmory": {"sets": {"Stall": {}}},
  "Porygon2": {"sets": {"Eerie Impulse": {}}},
  "Blissey": {"sets": {"Choice Specs": {}, "Assault Vest": {}}},
  "Raikou": {"sets": {"Pressure Stall": {}}},
  "Entei": {
    "comments": "<h3>Other Options</h3> <p>Assault Vest Entei can use Pressure over Inner Focus to bluff stall, but generally Inner Focus is better to maintain consistency versus Togekiss, Arcanine, and random moves with flinch chances like Galarian Moltres's Fiery Wrath.</p> <p>Entei can run a Life Orb set with Inner Focus, EVs of 184 HP / 92 Atk / 16 Def / 216 Spe, and an Adamant nature for a more reliable matchup against Togekiss, Avalugg, Steelix, and Zapdos, using a moveset of Sacred Fire / Extreme Speed / Will-O-Wisp / Eruption; Bulldoze can be slotted in over Will-O-Wisp to beat Heatran. Life Orb Entei sees far less usage due to its few upsides and lower consistency in practice than Assault Vest.</p>",
    "sets": {
      "Pressure Stall": {
        "description": "<h4>Set Description</h4> <p>Pressure stall Entei can easily beat many slower attackers, such as Choice Specs Volcanion, Venusaur, Dracozolt, and Assault Vest Goodra, while also dealing with some faster attackers like Zarude, Pheromosa, and Kartana well. Leftovers is mandatory to create more Substitutes. Protect and Substitute stall out opposing attacks easily, such as Urshifu-S's Wicked Blow and Volcanion's Steam Eruption, and Protect adds Leftovers healing to make more Substitutes. Sacred Fire can turn tough matchups versus Pokemon like Zeraora into winning ones with a single burn; on the other hand, Flare Blitz can be used for a more reliable Galarian Darmanitan matchup and more PP, which can help versus some opposing stall Pokemon like Galarian Corsola. Toxic is standard on Pressure stall Pokemon like Entei to take advantage of foes that require setup to OHKO them, such as Volcarona and opposing stall Pokemon like Chansey. Laser Focus is a potential option to defeat Registeel, since critical hits ignore Registeel's Defense boosts through Iron Defense.</p> <h4>EVs</h4> <p>252 Defense EVs give the best possible odds to beat Adamant Choice Scarf Galarian Darmanitan. 252 Speed EVs with a Jolly nature Speed tie Zapdos, Galarian Zapdos, and opposing Entei, and they outspeed all base 95s, most notably Galarian Darmanitan and Tapu Lele.</p> <h4>Usage Tips</h4> <p>Against a vast majority of Pokemon, the win path is usually stalling out their super effective moves via Pressure's doubled PP consumption, Substitute, and Protect. Toxic assists in this task versus Pokemon that don't rely on direct attacks to win, such as Chansey and stall Cresselia, or Pokemon that are too weak to OHKO Entei, like Zapdos. Versus Registeel, if you run Laser Focus, use Laser Focus turn 1 and then alternate between your Fire-type attack and it, or use Substitute turn 2 instead if Counter is revealed.</p>"
      },
      "Assault Vest": {
        "description": "<h4>Set Description</h4> <p>Assault Vest Entei chooses to tank hits and outdamage its targets. Inner Focus is used to defeat Choice Scarf Togekiss and non-Choice Band Arcanine. Sacred Fire can be used for the 50% burn chance, but Flare Blitz is generally better for its higher damage and PP, defeating Venusaur and Aromatisse far more reliably. Bulldoze is mandatory to deal with Pokemon such as Heatran, Assault Vest Arcanine, and Spectrier. Eruption deals incredible damage to Pokemon with low Special Defense, such as Steelix, Registeel, and Avalugg, while making the Aromatisse matchup more consistent. Stone Edge, however, can be used instead to deal with Kee Berry Volcarona and Rotom-H. Extreme Speed is an excellent, high-damage move that deals with Custap Berry users and Air Balloon Heatran.</p> <h4>EVs</h4> <p>The Special Defense and HP investment lets Entei tank two Earth Powers from Modest Heatran. With a Jolly nature, 216 Speed EVs outspeed Adamant Choice Band Galarian Darmanitan, and Entei still defeats Venusaur if using Flare Blitz. An Adamant nature can be used instead to make the Aromatisse matchup more consistent, but this loses out on the Galarian Darmanitan matchup.</p> <p>An alternative EV spread of 8 HP / 76 Atk / 208 Def / 216 Spe with a Jolly nature gives a more reliable Galarian Darmanitan matchup, tanking Jolly Choice Scarf Darmanitan's Earthquake.</p> <h4>Usage Tips</h4> <p>Use Extreme Speed on Air Balloon Pokemon like Heatran. Sacred Fire is used on targets that instantaneously lose when burned, such as Zeraora. Use Eruption versus Aromatisse if you think it is physically defensive, and Flare Blitz or Sacred Fire otherwise. Eruption is also used for Steelix and Avalugg. Entei is fairly straightforward outside of these scenarios; the most effective move usually wins.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 249890, "username": "zo"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 518399, "username": "Itchy"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}]}
  },
  "Suicune": {"sets": {"PP Stall": {}, "Assault Vest": {}}},
  "Tyranitar": {"sets": {"Assault Vest": {}, "Custap Berry": {}, "Choice Band": {}, "Chople Berry": {}}},
  "Celebi": {"sets": {"Choice Specs": {}, "Choice Scarf": {}, "Leech Seed Stall": {}}},
  "Blaziken": {"sets": {"Weakness Policy": {}}},
  "Swampert": {"sets": {"Assault Vest": {}, "Petaya Berry": {}, "Chilan Berry": {}}},
  "Gardevoir": {"sets": {"Choice Scarf": {}, "Encore + Disable": {}}},
  "Shedinja": {"sets": {"Protective Pads": {}}},
  "Aggron": {"sets": {"Choice Band": {}, "Choice Scarf": {}, "Custap Berry": {}}},
  "Torkoal": {"sets": {"Sitrus Berry": {}, "Air Balloon": {}}},
  "Salamence": {"sets": {"Choice Scarf": {}}},
  "Metagross": {
    "comments": "<h3>Other Options</h3> <p>Metagross can run an Occa Berry set using Meteor Mash, Bullet Punch, Rock Tomb, and Earthquake with an EV spread of 184 HP / 252 Atk / 40 Def / 32 Spe, which lets it survive Adamant Dracozolt's Bolt Beak. This set hopes to lure in Heatran, which it beats by landing Rock Tomb into Earthquake. However, this set is a very situational lure, so it isn't recommended.</p>",
    "sets": {
      "Assault Vest": {
        "description": "<h4>Set Description</h4> <p>Meteor Mash, besides nailing Steel-weak targets like Sylveon and Tapu Lele, is Metagross's best neutral STAB move for targets like Azumarill and Porygon-Z. Bullet Punch finishes off weakened foes and is extremely useful for KOing Sturdy or Custap Berry users like Sawk, Magnezone, and Primarina. Earthquake hits Steel- and Electric-types like Tapu Koko, most Zeraora, and Magnezone. Ice Punch hits non-Choice Band Landorus-T and Landorus, Zapdos, Dragapult, and some Garchomp. Power-Up Punch is a useful alternative for better matchups against Iron Defense Tapu Koko and Iron Defense Tapu Fini. Assault Vest offers reliability versus the aforementioned Primarina and Landorus, and it lets Metagross survive super effective hits from Pokemon like Hydreigon.</p> <h4>EVs</h4> <p>Assault Vest with 204 HP and 144 Special Defense EVs allows Metagross to survive Sparking Aria twice from Choice Specs Primarina. The HP EVs also allow Metagross to survive Life Orb Zeraora's Knock Off after Bulk Up. The remaining EVs are dumped into Attack for better KO odds versus Dragapult.</p> <h4>Usage Tips</h4> <p>There are some matchups that are a bit different than using the highest damaging move. For example, against Crustle you use Bullet Punch turn 1 because it can use Counter, and then KO it with Meteor Mash the next turn. Versus Tapu Fini, use Meteor Mash instead of Power-Up Punch turn 1 to avoid getting locked into Power-Up Punch by Trick. Against Tapu Koko, use Earthquake turn 1, and if it uses Iron Defense, start using Power-Up Punch until Earthquake can 2HKO it. Against Encore + Disable users like Gardevoir, Alolan Ninetales, and Aromatisse, always use Meteor Mash turn 1, and use Bullet Punch turn 2 to avoid being forced to use Struggle. Against Togekiss, you should use Bullet Punch turn 1 to scout its set. If it's Kee Berry or Babiri Berry, you should use Power-Up Punch turn 2 and then use Meteor Mash turn 3. Even if it uses Encore turn 2, you can still finish it off by using Bullet Punch when Metagross's Encore ends. If it's another Togekiss set, you can use Meteor Mash turn 2 to finish it off.</p>"
      },
      "Weakness Policy": {
        "description": "<h4>Set Description</h4> <p>Weakness Policy is beneficial for Kartana, opposing Metagross, and Zeraora. Meteor Mash hits neutral targets like Haxorus and Regidrago hard. Bullet Punch finishes off weakened foes and Custap Berry users such as Sylveon and Magnezone. Earthquake hits Steel- and Electric-types like Regieleki and Carracosta. Psychic may seem like an odd choice, but it helps versus a few foes that Zen Headbutt wouldn't beat, such as Counter Sawk, Iron Defense Urshifu-R, Kartana, and Avalugg. Endure helps against Galarian Darmanitan and Choice Band Dragapult. Weakness Policy surprises many Pokemon that Metagross can tank supereffective hits from and KO back, such as Assault Vest Entei and Choice Band Steelix.</p> <h4>EVs</h4> <p>248 HP EVs and 28 Defense EVs ensure that Metagross beats Haxorus. The remaining EVs are dumped into Attack to reliably beat all Regidrago sets. Metagross can run 8 Speed IVs to still outspeed Azumarill and have a better chance at activating Weakness Policy against Incineroar or some variants of Tyranitar, and it can even run 0 Speed IVs for a better opposing Metagross matchup. However, Metagross will lose reliably versus Primarina with less Speed investment.</p> <h4>Usage Tips</h4> <p>Against Crustle you should use Bullet Punch turn 1 because it can use Counter, and then KO it with Meteor Mash the next turn. Against Encore + Disable users like Gardevoir, Alolan Ninetales, and Aromatisse, always use Meteor Mash turn 1, and use Bullet Punch turn 2 to avoid being forced to use Struggle. Against Galarian Darmanitan, you should use Endure to survive Flare Blitz and KO back with +2 Bullet Punch. Against Dragapult, you should use Endure on turn 2 if Phantom Force is used, and use Bullet Punch on turns where Phantom Force will not hit. However, other Dragapult sets like Choice Specs will beat you, so be wary of that.</p>"
      },
      "Choice Band": {
        "description": "<h4>Set Description</h4> <p>Equipped with a Choice Band, Metagross can demolish Pokemon that check other sets like Regidrago and Zeraora. Meteor Mash hits neutral targets like Porygon-Z hard while also hitting targets like Aromatisse super effectively. Bullet Punch beats Galarian Darmanitan and Earthquake beats Zeraora, Magnezone, and some Arcanine and Incineroar sets. Trick beats various stall Pokemon like Cresselia, Galarian Corsola, and Ferrothorn. Ice Punch allows it to KO Garchomp and bulky Regidrago sets, while Zen Headbutt hits offensive Urshifu-R and Galarian Zapdos.</p> <h4>EVs</h4> <p>The HP EVs ensure Metagross survives Custap Berry Dracozolt's Bolt Beak, and the Special Defense EVs allow it to survive Dragon Energy into Draco Meteor from Custap Berry Regidrago. The remaining EVs are dumped into Attack for better damage versus Togekiss and Regidrago. However, an alternative spread of 252 Atk / 4 SpD / 252 Spe with a Jolly nature allows it to outspeed neutral-nature base 80 Speed Pokemon, like Regidrago. Here, maximum Attack gives it the best KO odds versus Tyranitar. If you are running these EVs, you should run Thunder Punch as the fourth move for a better Celesteela matchup.</p> <h4>Usage Tips</h4> <p>Most of the time, using the strongest move is the best option. If running Trick, always use it against stall Pokemon like Galarian Corsola and Corviknight. Against Encore + Disable Pokemon like Alolan Ninetales, always use Bullet Punch instead of Meteor Mash to avoid getting locked into Struggle. Bullet Punch OHKOes some Pokemon such as Galarian Darmanitan, Weavile, and Archeops, so you should always use it to avoid the risk of getting KOed first. Against Zeraora, using Earthquake will always OHKO unless Zeraora uses Knock Off. In that case, you can use Bullet Punch turn 2 to KO it.</p>"
      },
      "Choice Scarf": {
        "description": "<h4>Set Description</h4> <p>With a Choice Scarf, Metagross can surprise and outspeed numerous threats that normally beat it like Landorus-T and SubSeed Venusaur. Meteor Mash hits neutral targets like Porygon-Z hard and nails Steel-weak targets such as Sylveon and Tapu Lele. Earthquake hits Electric-types like Dracozolt and Tapu Koko, while Trick is used for stall Pokemon like Galarian Corsola and Cresselia. Ice Punch beats most Garchomp, Landorus, and Landorus-T, while Thunder Punch can be used to hit Choice Scarf Tapu Fini.</p> <h4>EVs</h4> <p>The HP EVs allow Metagross to survive Hydro Pump from Choice Specs Tapu Fini and Earthquake from Jolly Choice Scarf Garchomp. The Speed EVs allow it to outspeed base 110s like Latios. An alternative spread of 240 HP / 28 Atk / 96 Def / 144 Spe can be used with Rest in the last moveslot for a more defensive approach, letting it survive Jolly Choice Scarf Galarian Darmanitan's attacks and outspeed other Galarian Darmanitan sets. Also, it will have a better matchup versus stall Pokemon like Chansey, Blissey, and Sap Sipper Azumarill because of Rest.</p> <h4>Usage Tips</h4> <p>Using the highest damaging move most of the time works. Use Trick on Pokemon that cannot deal high damage, like Tapu Bulu, Togekiss, and stall Pokemon like Galarian Corsola and Corviknight, locking them into their low-damage or status moves.</p>"
      },
      "Air Balloon": {
        "description": "<h4>Set Description</h4> <p>Air Balloon allows Metagross to beat Ground-types that usually counter it, like both Landorus formes, Garchomp, and Rhyperior. Meteor Mash hits targets like Rhyperior and Kyurem. Ice Punch hits the aforementioned Ground-types while also hitting Grass-types like Rillaboom. Earthquake hits Steel- and Electric-types like Magnezone and Zeraora, and Bullet Punch finishes off weakened foes and Custap Berry users like Sawk, Magnezone, and Crustle.</p> <h4>EVs</h4> <p>The HP EVs allow Metagross to survive Knock Off from Choice Band Landorus-T, while the Speed EVs are used for opposing Metagross and certain Carracosta sets. The remaining EVs are dumped into Attack for damage against Regidrago.</p> <h4>Usage Tips</h4> <p>Against Encore + Disable users like Gardevoir, Alolan Ninetales, and Aromatisse, always use Meteor Mash turn 1, and use Bullet Punch turn 2 to avoid being forced to use Struggle. Against Crustle, you use Bullet Punch turn 1 because it can use Counter, and then KO it with Meteor Mash the next turn. Against Aggron, you should use Bullet Punch turn 1 so that Metal Burst doesn't KO Metagross, and finish it off turn 2 with Earthquake.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 576556, "username": "fake tom numbers"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 518399, "username": "Itchy"}, {"user_id": 500233, "username": "Frailty"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}]}
  },
  "Regirock": {"sets": {"Choice Band": {}}},
  "Regice": {"sets": {"Charge Beam": {}, "Counter": {}}},
  "Registeel": {"sets": {"Iron Defense + Amnesia": {}, "Counter + Amnesia": {}, "Assault Vest": {}}},
  "Latias": {"sets": {"Weakness Policy": {}}},
  "Latios": {"sets": {"Choice Specs": {}, "Choice Scarf": {}}},
  "Roserade": {"sets": {"Substitute + Leech Seed": {}, "Life Orb": {}}},
  "Gastrodon": {"sets": {"Chilan Berry": {}, "Leftovers": {}}},
  "Garchomp": {
    "comments": "<h3>Other Options</h3> <p>Garchomp can utilize a set with Haban Berry for Dragon-types like Naganadel and Dracovish. This set runs an EV spread of 248 HP / 48 Atk / 40 Def / 92 SpD / 80 Spe with the moves Swords Dance, Scale Shot, Earthquake, and Poison Jab. The defensive investment allows Garchomp to survive both Outrage and Fishious Rend from Adamant Choice Scarf Dracovish,  as well as Draco Meteor from Modest Choice Specs Naganadel, while the Speed investment outspeeds base 80 Speed Pokemon like Venusaur and Regidrago. Swords Dance + Poison Jab on this set can defeat Fairy-types like Tapu Bulu, while Scale Shot handles most Dragon-types, including Dracovish. Garchomp can also run Fling on Choice Band sets in the fourth moveslot to break Heatran or Metagross's Air Balloon, KOing them with Earthquake in the following turn.</p>",
    "sets": {
      "Custap Berry": {
        "description": "<h4>Set Description</h4> <p>Garchomp aims to surprise Pokemon such as Galarian Darmanitan, Naganadel, and Dragapult; the combination of Endure and Custap Berry allows it to move first and OHKO with its STAB moves. Outrage is also used to beat Dragon-types like Kommo-o that are naturally slower. Earthquake lets Garchomp beat Electric- and Fire-types like Zeraora, Tapu Koko, Regieleki, and Volcanion. Swords Dance gets past stall Pokemon like Chansey and Galarian Corsola.</p> <h4>EVs</h4> <p>96 HP EVs allow Garchomp to survive Outrage from Life Orb Zeraora, while the 44 Special Defense EVs let it take Steam Eruption from Choice Specs Volcanion. 120 Speed EVs are used to outspeed base 85 Speed Pokemon like Kommo-o, and 248 Attack EVs allow for better OHKO odds versus Galarian Darmanitan. Alternatively, an EV spread of 176 HP / 112 Atk / 80 Def / 120 Spe secures the matchup versus Choice Band Zeraora, as it takes Outrage, though the reduced Attack does not let Garchomp OHKO Galarian Darmanitan.</p> <h4>Usage Tips</h4> <p>Using Earthquake on turn 1 is usually the best option versus Zeraora and Volcanion, as Garchomp tanks most of their hits, but Choice Band Outrage from Zeraora OHKOes Garchomp unless it has the alternate EV spread, so some prediction is required. Using Endure is the best option against Pokemon that OHKO it, like Galarian Darmanitan, Dragapult and Naganadel. When in Custap Berry range, Outrage will OHKO these targets before they can move. Swords Dance should be used twice or thrice versus stall like Chansey or Galarian Corsola, respectively.</p>"
      },
      "Choice Band": {
        "description": "<h4>Set Description</h4> <p>Choice Band Garchomp deals gargantuan amounts of damage, with Outrage beating Dragon-types such as Goodra, opposing Garchomp, and non-Choice Scarf Haxorus while also heavily damaging neutral targets like Venusaur. Earthquake OHKOes many Fire- and Steel-types including Entei, most Metagross, and Aegislash. Fire Fang helps versus Steel-types that are not weak to Earthquake such as Ferrothorn, Kartana, and some Celesteela. Stone Edge lets it win versus prominent Pokemon like Togekiss more often. On the other hand, Poison Jab beats Tapu Bulu and non-Kebia Berry Whimsicott, so it can be considered.</p> <h4>EVs</h4> <p>252 Speed EVs are used to Speed tie other Garchomp and outspeed base 100 Speed Pokemon like Entei, Volcarona, and Zapdos. The remaining EVs are invested into Attack to improve matchups versus Choice Scarf Togekiss and defensive Volcarona.</p> <h4>Usage Tips</h4> <p>Choice Band Garchomp is relatively straightforward to use, as either STAB attack will usually deal massive damage. Coverage for Fairy-types like Togekiss and Whimsicott should be used as necessary.</p>"
      },
      "Life Orb": {
        "description": "<h4>Set Description</h4> <p>This set allows Garchomp to switch between its STAB and utility move options while retaining high damage output. Swords Dance allows it to boost versus foes like Tapu Bulu and Spectrier, which normally check Garchomp with Disable and Will-O-Wisp respectively, and then KO them. Life Orb-boosted Earthquake OHKOes Pokemon like Zeraora and Heatran. Scale Shot acts as a secondary boosting move by increasing Garchomp's Speed. It also counters stall Pokemon like Pressure Entei by breaking through Substitute. Poison Jab deals with Fairy-types like Tapu Bulu, whereas Outrage increases reliability versus Zapdos.</p> <h4>EVs</h4> <p>The 192 HP EVs secure the matchup versus Choice Specs Magnezone, as Garchomp survives Hyper Beam even after Life Orb recoil, and also assist versus stall Pokemon like Galarian Corsola and Registeel, ensuring that Night Shade and Seismic Toss take five hits to KO. 68 Defense EVs and the HP investment allow Garchomp to survive Outrage from Choice Band Zeraora. The 136 Speed EVs let Garchomp outspeed some faster Pokemon after Scale Shot, most notably Entei and Spectrier, while also outspeeding Pokemon like Dracozolt without the Speed boost.</p> <h4>Usage Tips</h4> <p>When versus Zeraora, use Earthquake, as you survive a Choice Band-boosted Outrage. Use Scale Shot versus Magnezone and other Sturdy users like Crustle to avoid risking Weakness Policy or Counter activation, respectively, and KO with Earthquake on turn 2. Scale Shot can also be used versus faster Pokemon like Entei and Spectrier to outspeed and KO in the following turns. The main use of Swords Dance is to break past passive stall Pokemon like Galarian Corsola and Registeel, as they cannot do enough damage before Garchomp KOes them. However, it also lets Garchomp KO some Pokemon more quickly, like Spectrier, as Swords Dance after a Scale Shot allows Garchomp to KO on turn 3.</p>"
      },
      "Choice Scarf": {
        "description": "<h4>Set Description</h4> <p>Choice Scarf Garchomp is able to outspeed many of its checks like Galarian Darmanitan and Togekiss, as well as opposing Dragon-types like Dragapult, OHKOing them with Stone Edge or Outrage. Earthquake is a strong STAB move that hits Electric-types like Zeraora and Tapu Koko hard, while Outrage deals with neutral targets like Zapdos and Spectrier. Flamethrower secures matchups versus Grass-types like Kartana and some Ferrothorn sets, which usually check Garchomp, while Poison Jab provides more reliability versus Togekiss and has the added bonus of beating non-Kebia Berry Whimsicott.</p> <h4>EVs</h4> <p>This set runs 252 Speed EVs in order to outspeed Galarian Darmanitan, Togekiss, and Kartana. If running Poison Jab over Flamethrower, the 4 Special Attack EVs can be used in a different stat, and the nature should be changed to Jolly over Naive.</p> <h4>Usage Tips</h4> <p>The vast majority of the time, Choice Scarf Garchomp wins by using the appropriate high-damage move. Stone Edge should be used over Outrage for Galarian Darmanitan, as its higher damage matters versus some bulkier sets. If running Poison Jab over Flamethrower, use it on Togekiss over Stone Edge for its higher accuracy. Flamethrower should only be used against Pokemon that are quadruply weak to it, like Ferrothorn and Kartana. Against other Grass-types like Rillaboom and Venusaur, Outrage will do higher damage.</p>"
      },
      "Haban Berry": {}
    },
    "credits": {"writtenBy": [], "teams": [{"name": "Quality checked by", "members": [{"user_id": 249890, "username": "zo"}, {"user_id": 518399, "username": "Itchy"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}]}
  },
  "Weavile": {"sets": {"Life Orb": {}, "Liechi Berry + Pickpocket": {}}},
  "Magnezone": {"sets": {"Custap Berry": {}, "Choice Specs": {}, "Weakness Policy": {}}},
  "Rhyperior": {"sets": {"Choice Band": {}, "Anti-Galarian Darmanitan": {}, "Anti Magnezone": {}}},
  "Togekiss": {
    "comments": "<h3>Other Options</h3> <p>Mental Herb instead of Maranga Berry sacrfices certain matchups like Volcanion for the ability to beat Taunt and Encore users such as Spectrier and Gardevoir. Additionally a Charm + Kee Berry set allows Togekiss to answer slower physical threats such as Metagross, Aggron, Rhyperior, and Glastrier by reducing their attack and healing with Roost, slowly chipping them down with Counter or Air Slash. A Choice Specs set sacrifices some of Togekiss's Speed for more power, being able to break down bulky Pokemon like Volcanion quickly and reliably because you don't need as many flinches. This set can also run Grass Knot as a niche move to catch Pokemon like Rhyperior and Swampert. Nasty Plot is another option that can be used over Encore on Thunder Wave variants. Nasty Plot can help against stall users like Kyurem and Leftovers Gastrodon, if running Encore. Resist Berry sets usually are paired with Counter. Babiri Berry, for example, can lure Pokemon like Metagross or Kartana by surviving a hit and using Counter. It can also run other Berries such as Wacan Berry, Charti Berry, and even Yache Berry for threats such as Choice Band Zeraora, Choice Band Landorus-T, and Galarian Darmanitan respectively. However, Togekiss often has to sacrifice a lot of matchups to run these sets due to it needing to dedicate nearly all of its resources to run them. This makes these sets relatively niche and often saved for tournament play.</p>",
    "sets": {
      "Maranga Berry + Thunder Wave": {
        "description": "<h4>Set Description</h4> <p>Togekiss makes use of tactical RNG manipulation through Serene Grace, Air Slash, and paralysis to immobilize and break down foes. Maranga Berry allows it to more reliably wall many special attackers such as Primarina, Sylveon, and Volcanion. Thunder Wave is useful for speed control in addition to making immobilizing foes more reliable. Roost paired with paralysis allows Togekiss to fish for paralysis turns while recovering, which increases reliability even more. Encore is useful for locking stall Pokemon such as stall Cresselia and Corsola-G into their setup moves, as well as bulky offensive setup Pokemon like Galarian Moltres, Primarina, and Fake Tears Sylveon by locking them into their status moves.</p> <h4>EVs</h4> <p>The EVs allow Togekiss to survive Choice Specs Pixilate Sylveon's Hyper Beam and outspeed Choice Scarf Tapu Fini and Adamant Choice Scarf Haxorus after Thunder Wave. 52 Defense EVs maximize reliability against Assault Vest Arcanine and certain Dracovish sets.</p> <p>An alternative spread of 96 HP / 140 SpA / 20 SpD / 252 Spe with a Timid nature allows Togekiss to defeat Magnezone with Mystical Fire. The EV spread allows Togekiss to defeat Choice Specs Volcarona and outspeeds bulky Tapu Fini variants as well as other Maranga Togekiss.</p> <h4>Usage Tips</h4> <p>Most matchups with Maranga Berry Togekiss begin with Togekiss using Thunder Wave Turn 1. However, against certain Trick users such as Cresselia and Choice Scarf Tapu Fini, it is safest to use Encore Turn 1. This locks you into Encore again but nets you a free move Turn 3 to use Air Slash, which locks you into Air Slash for the final turn of Encore on Turn 4, resetting the cycle. If the foe uses an attacking move Turn 1 and deals less than half of Togekiss's health, it is generally safe to spam Roost and fish for paralysis turns before going for flinches with Air Slash. This keeps Togekiss from dropping to a stray critical hit as well as not risking being caught by priority or some other gimmick such as a surprise Custap Berry user. If the foe uses a setup or status move such as Calm Mind, Swords Dance, or Substitute, Togekiss should usually use Encore to lock them into their move so they can safely break them down without needing to deal with flinch and paralysis chances as long as Togekiss outspeeds. Where Togekiss shouldn't use Encore is against Pokemon like Aromatisse. Instead, Togekiss should spam Air Slash in hopes of getting lucky and flinching Aromatisse down without being locked into Struggle by Encore and Disable.</p>"
      },
      "Choice Scarf": {
        "description": "<h4>Set Description</h4> <p>Choice Scarf allows Togekiss to outspeed Pokemon such as Dragapult, Kartana, and non-Choice Scarf Tapu Fini. This pairs nicely Trick, which works to beat stall Pokemon such as non-AV Registeel while also locking Pokemon like stall Azumarill into a move. For coverage moves, Dazzling Gleam reliably takes out threats like Haxorus and Dracozolt, while Fire Blast can be used for Ferrothorn and Kartana.</p> <h4>EVs</h4> <p>Maximum Special Attack and Speed EVs allow Togekiss to do as much damage as possible and outspeed as many Pokemon as possible.</p> <p>Alternatively, 16 HP / 236 SpA / 12 SpD / 244 Spe can be used to outspeed Dragapult and survive a Flash Cannon from Aegislash.</p> <h4>Usage Tips</h4> <p>Generally, this set is pretty simple to use. Use Air Slash when Togekiss needs to flinch a Pokemon like Naganadel or Volcanion that would KO it otherwise. Use Dazzling Gleam or Fire Blast when either of them more reliably wins the matchup such as against Garchomp or Ferrothorn, respectively. Trick is for opposing setup Pokemon as well as Pokemon like Tapu Fini, Dragapult, and Primarina that can't reliably 2HKO Togekiss. This allows Togekiss to outheal with Roost and makes the matchup more reliable in the long run.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 503725, "username": "clerica"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 430787, "username": "PA"}, {"user_id": 501918, "username": "Here Comes Team Charm!"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}]}]}
  },
  "Mamoswine": {"sets": {"Choice Band": {}, "Life Orb": {}, "Choice Scarf": {}}},
  "Porygon-Z": {
    "comments": "<h3>Other Options</h3> <p>Porygon-Z can utilize a set with Chople Berry for Zeraora and Fighting-types like both Urshifu formes. This set runs an EV spread of 88 Def / 252 SpA / 168 Spe with a Modest nature and the moves Hyper Beam, Uproar, Agility, and Nasty Plot or Icy Wind. 88 Defense EVs allow Porygon-Z to survive a Plasma Fists from Choice Band Zeraora and use Agility turn 1 to outspeed and OHKO with Hyper Beam. Icy Wind can help out versus Sawk to break Sturdy and then KO with Hyper Beam.</p>",
    "sets": {
      "Choice Specs": {
        "description": "<h4>Set Description</h4> <p>Choice Specs-boosted Hyper Beam is able to OHKO many top-tier Pokemon like Aromatisse, Cresselia, and Assault Vest Arcanine. Uproar can be beneficial against Whimsicott and Pressure Entei, which try to stall Porygon-Z out with Substitute. Thunderbolt beats Corviknight, and Ice Beam hits Garchomp and Dragapult. Trick + Recover + Nasty Plot allows Porygon-Z to shut down stall Pokemon like Chansey. Dark Pulse helps beat non-Assault Vest Metagross and is an option to hit Spectrier.</p> <h4>EVs</h4> <p>252 Speed EVs are used to outspeed Tapu Fini, Dracovish, Kommo-o, and some other Porygon-Z. An alternate EV spread of 68 Def / 184 SpA / 252 Spe reliably beats Garchomp with Ice Beam, as the 68 Defense EVs prevent the KO from Custap Berry Garchomp's Outrage.</p> <h4>Usage Tips</h4> <p>Hyper Beam is usually the best choice versus a neutral target like Azumarill or Cresselia, as it will do more damage than super effective coverage moves thanks to Adaptability. If Entei's Pressure is not revealed on turn 1, Porygon-Z should click Hyper Beam over Uproar, since Entei is using Inner Focus with Assault Vest instead of Substitute.</p> <p>For coverage moves like Thunderbolt, Ice Beam, and Dark Pulse, it's best to use them on Pokemon like Celesteela and Spectrier, as they either resist or are immune to Hyper Beam. Nasty Plot Porygon-Z can use Trick and set up until Hyper Beam OHKOes Chansey.</p>"
      },
      "Custap Berry": {
        "description": "<h4>Set Description</h4> <p>This Porygon-Z set aims to surprise Pokemon like Galarian Darmanitan, Naganadel, and opposing Porygon-Z by using Endure + Custap Berry. Hyper Beam deals an extreme amount of damage to Pokemon like Rillaboom, Tapu Fini, and Volcanion. Nasty Plot enables Porygon-Z to set up against stall Pokemon like Chansey and better damage foes like Sylveon and Primarina. Uproar helps versus Substitute users like Whimsicott and stall Entei, while Thunderbolt is helpful against Corviknight and Celesteela. Ice Beam hits Garchomp and Naganadel.</p> <h4>EVs</h4> <p>The defensive investment allows Porygon-Z to survive a Fake Out into Grassy Glide from Life Orb Rillaboom. The HP in specific lets it reliably beat Timid Choice Specs Tapu Fini. 216 Speed EVs are for base 85 Speed Pokemon without a boosting nature, such as Rillaboom, Cresselia, and Tapu Fini.</p> <h4>Usage Tips</h4> <p>Endure is the best move on turn 1 versus threats that can OHKO Porygon-Z like Galarian Darmanitan, Choice item Urshifu-S and Urshifu-R, and also Naganadel. Then, while in Custap Berry range, it can OHKO back with Hyper Beam or Ice Beam. If running Uproar, it should be used against Pokemon like Whimsicott turn 1 to bypass their Substitute and KO them before they can stall.</p>"
      },
      "Choice Scarf": {
        "description": "<h4>Set Description</h4> <p>Choice Scarf Porygon-Z outspeeds fast threats like Zeraora and also other, slower Choice Scarf users in Dracozolt and Togekiss, OHKOing them with Hyper Beam. Trick + Recover effectively shuts down the likes of Chansey and Galarian Corsola. Dark Pulse hits Ghost-types like Spectrier and Galarian Corsola, while Ice Beam can be beneficial for Landorus-T especially with Assault Vest, and Garchomp.</p> <h4>EVs</h4> <p>This set runs maximum Speed investment to outspeed Zeraora and base 80 Speed or less Choice Scarf users like Togekiss, Dracozolt, and Dracovish. Maximum Special Attack allows it to get better KO odds  versus Volcanion and stall Zapdos. A Modest nature improves its chances versus Maranga Berry Zapdos; however, it will not outspeed Choice Scarf Togekiss and Zeraora.</p> <h4>Usage Tips</h4> <p>Dark Pulse hits Ghost-types like Spectrier and Galarian Corsola for supereffective damage and Ice Beam helps versus Ground-types like Garchomp and Landorus. Using Trick + Recover and repeatedly clicking Hyper Beam wins versus Chansey.</p>"
      },
      "Life Orb": {
        "description": "<h4>Set Description</h4> <p>This set has most of the same monstrous wallbreaking power that Porygon-Z is known for, but with the freedom to switch between its STAB attacks and utility options. Nasty Plot allows it to counter Mirror Coat users like Gastrodon and Assault Vest Swampert. Uproar secures the win versus Pressure stall Pokemon like Substitute + Protect Zapdos, Entei, Corviknight, and SubSeed users like Whimsicott. Substitute overwhelms hard stall Pokemon like Unaware Pyukumuku. Recover can increase Porygon-Z's longevity versus Pokemon like Seismic Toss Chansey, and Dark Pulse lets it hit Spectrier.</p> <h4>EVs</h4> <p>92 Special Defense EVs allow Porygon-Z to survive an Overheat from Choice Scarf Volcanion and OHKO back. With 176 Speed EVs, it outspeeds neutral-natured base 80 Speed Pokemon like Regidrago and Togekiss.</p> <h4>Usage Tips</h4> <p>Substitute should be used turn 1 versus Gastrodon to avoid moves like Mirror Coat and Clear Smog, then Nasty Plot on turn 2 lets Porygon-Z OHKO with Hyper Beam. However, if Gastrodon uses Amnesia turn 1, then Nasty Plot should be repeated until Porygon-Z reaches +6 and then Uproar is an OHKO or 2HKO, even after Chilan Berry. This same strategy should be used for Corviknight, as Nasty Plot boosted Hyper Beam OHKOes. However, if they use Substitute too, Nasty Plot should be used twice so that Uproar will at worst 2HKO.Substitute is the best move on turn 1 versus Pyukumuku to stop Mirror Coat then Uproar can be used for a 2HKO. Recover helps versus stall Pokemon like Seismic Toss Chansey, as Porygon-Z can boost up with Nasty Plot and heal off the damage to KO with Hyper Beam.</p>"
      },
      "Rocky Helmet": {
        "description": "<h4>Set Description</h4> <p>This set punishes slower physical attackers that normally check Porygon-Z like Aggron, Rhyperior, and Metagross through Reflect + Rocky Helmet, chipping down their health until they are in Hyper Beam KO range. Nasty Plot can help versus some stall Pokemon or just bolster Hyper Beam's damage even more, while Recover helps Porygon-Z outlast its foes.</p> <h4>EVs</h4> <p>64 Defense EVs are so that Porygon-Z can survive three Choice Band Aggron Heavy Slams after Reflect, and the 188 Speed EVs allow it to outspeed Metagross. Maximum Special Attack is for the best Hyper Beam damage versus the aforementioned Pokemon.</p> <h4>Usage Tips</h4> <p>Reflect versus slower physical threats, like Aggron and Metagross, allows Porygon-Z to tank their hits and then use Recover until they are chipped down from Rocky Helmet. Hyper Beam should be used when it will OHKO the foe. Nasty Plot can reduce the turns needed to stall out foes like Aggron while also lowering the chances that Porygon-Z falls to a critical hit. It can also help Hyper Beam eventually OHKO versus stall Pokemon like Chansey, with Recover helping Porygon-Z set up.</p>"
      }
    },
    "credits": {"writtenBy": [], "teams": [{"name": "Quality checked by", "members": [{"user_id": 558869, "username": "Nick"}, {"user_id": 518399, "username": "Itchy"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}]}
  },
  "Rotom-Heat": {"sets": {"Choice Specs": {}, "Choice Scarf": {}, "Stall": {}}},
  "Rotom-Wash": {"sets": {"Choice Specs": {}, "Kee Berry": {}, "Life Orb": {}}},
  "Heatran": {"sets": {"Air Balloon Offensive": {}, "Choice Scarf": {}, "Air Balloon Defensive": {}, "Custap Berry": {}, "Choice Specs": {}}},
  "Excadrill": {"sets": {"Life Orb": {}}},
  "Conkeldurr": {"sets": {"Life Orb": {}}},
  "Seismitoad": {"sets": {"Choice Band": {}}},
  "Sawk": {"sets": {"Custap Berry": {}, "Choice Band": {}, "Choice Scarf": {}}},
  "Whimsicott": {"sets": {"Babiri Berry": {}, "Occa Berry": {}, "Kebia Berry": {}}},
  "Krookodile": {"sets": {"Choice Band": {}, "Assault Vest": {}}},
  "Darmanitan": {"sets": {"Choice Scarf": {}, "Choice Band": {}}, "credits": {"writtenBy": [{"user_id": 481177, "username": "maki"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 474883, "username": "Waylaid"}, {"user_id": 317056, "username": "dogknees"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}]}]}},
  "Darmanitan-Galar": {
    "sets": {
      "Choice Band": {
        "description": "<h4>Set Description</h4> <p>Galarian Darmanitan uses its great Attack, decent Speed tier, Gorilla Tactics, and Choice Band to OHKO as many opponents as possible before they can move. Either Icicle Crash or Ice Punch can be used; Ice Punch has perfect accuracy, but Icicle Crash has more power, notably securing matchups against Bulk Up Zarude, Rocky Helmet Aromatisse, and physically bulky Tapu Lele. Icicle Crash also has a 30% flinch chance, allowing Galarian Darmanitan to potentially beat Sturdy users and bulkier threats like Crustle and Aromatisse. Giga Impact OHKOes many bulkier Pokemon such as Sylveon and Primarina and even has a chance to OHKO physically defensive Tapu Fini. Flare Blitz does massive damage to Steel-types, notably OHKOing Registeel and non-Occa Berry Celesteela, and also helps Galarian Darmanitan defeat slower Volcarona sets. The last move is usually one of Superpower, Earthquake, or Iron Head. Superpower helps against Tyranitar, Air Balloon Heatran, bulky Kyurem and Chansey, Earthquake beats some Arcanine and Sitrus Berry Volcanion more reliably, and Iron Head reliably beats Aromatisse.</p> <h4>EVs</h4> <p>Adamant is usually preferred, as it performs better versus bulkier Pokemon, like Tapu Fini and Aromatisse. The 4 Special Defense EVs block Pokemon with the ability Download, most notably Porygon2, from getting +1 Special Attack.</p> <p>On bulkier spreads, Giga Impact is less valuable, since it lacks the necessary Attack investment to OHKO Tapu Fini. However, it is still valuable versus Sylveon and Primarina.</p> <p>An alternative spread of 88 Atk / 244 Def / 176 Spe outspeeds Rillaboom and survives Celesteela's uninvested Heavy Slam and Life Orb Rillaboom's Fake Out + Grassy Glide.</p> <p>An alternative spread of 8 HP / 116 Atk / 132 SpD / 252 Spe survives Choice Scarf Togekiss's Fire Blast and Choice Specs Tapu Fini's Hydro Pump so that it can KO them with Icicle Crash and two Earthquakes, respectively.</p> <h4>Usage Tips</h4> <p>If Galarian Darmanitan does not have Iron Head, it should use Icicle Crash or Ice Punch against Aromatisse, rather than Giga Impact. Even though Giga Impact has a chance to OHKO, it has better odds to 2HKO with Ice Punch or Icicle Crash + Struggle. Galarian Darmanitan is 2HKOed by Moonblast and Rocky Helmet damage from Aromatisse, which means that if Aromatisse dodges or survives Giga Impact turn 1 and uses Trick Room, it can use Moonblast, disable Giga Impact as it recharges, and use Moonblast again to KO Galarian Darmanitan.</p> <p>With the defensive spread, use Icicle Crash or Ice Punch versus Celesteela instead of Flare Blitz. This ensures that Celesteela will not KO Galarian Darmanitan afterwards, and the Ice-type moves 2HKO most Celesteela.</p>"
      },
      "Choice Scarf": {
        "description": "<h4>Set Description</h4> <p>Icicle Crash is Galarian Darmanitan's strongest STAB option. Superpower beats non-Chople variants of Porygon-Z, Urshifu-S, and Kyurem. Earthquake is for Nihilego, Entei, and Zeraora. The last move is more variable, depending on the needs of the team; Flare Blitz for a better Celesteela and Metagross matchup, Thrash for Choice Scarf Tapu Fini, Rock Slide for Volcarona, or Lash Out for Spectrier.</p> <h4>EVs</h4> <p>Galarian Darmanitan runs maximum Speed and a Speed-boosting nature to outspeed Choice Scarf Porygon-Z and Pheromosa. The leftover 4 EVs are put into Special Defense so Download users like Porygon2 get an Attack boost instead of a Special Attack boost.</p> <p>An Adamant nature instead of a Jolly nature helps versus Heatran, but loses out on Timid Choice Scarf Kyurem and Porygon-Z, as well as other Galarian Darmanitan.</p> <p>An alternative spread of 160 Atk / 112 Def / 236 Spe and an Adamant nature allows Galarian Darmanitan to survive Jolly Garchomp's Stone Edge and Adamant Garchomp's Outrage, so this spread is fairly reliable versus Choice Scarf and Custap Berry Garchomp.</p> <p>If using Thrash, consider an EV spread of 4 HP / 144 Atk / 104 SpD / 252 Spe to survive Choice Specs Tapu Fini's Hydro Pump.</p> <h4>Usage Tips</h4> <p>In nearly every matchup, use the move that does the most damage to come out on top.</p>"
      },
      "Zen Mode": {
        "description": "<h4>Set Description</h4> <p>Icicle Crash and, after activating Zen Mode, Flare Blitz are Galarian Darmanitan's strongest STAB options. In most matchups, Zen Mode is triggered when Galarian Darmanitan uses Endure on an attack that would otherwise OHKO it, activating both Zen Mode and the Salac Berry. To round out this set, Galarian Darmanitan-Z can use Encore to lock opponents into non-damaging moves, such as Endure. Reversal is another option, which can defeat Kyurem and Heatran.</p> <h4>EVs</h4> <p>Adamant is the preferred nature, as base 135 Speed and at +1 Speed outspeeds all relevant threats.</p> <h4>Usage Tips</h4> <p>When Galarian Darmanitan-Z can outspeed and OHKO an opponent, such as Venusaur and Ferrothorn, Galarian Darmanitan should just attack turn 1. Other matchups, where Darmanitan is outsped and OHKOed, like versus Pheromosa and Kartana, Galarian Darmanitan should use Endure, activate the Salac Berry, and OHKO the next turn.</p> <p>Note that Galarian Darmanitan-Z is much weaker without Gorilla Tactics, so it does not KO bulkier Pokemon that it normally expects to like Regidrago.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 518399, "username": "Itchy"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 501918, "username": "Here Comes Team Charm!"}, {"user_id": 509647, "username": "Mishlef"}, {"user_id": 474883, "username": "Waylaid"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}]}
  },
  "Crustle": {
    "comments": "<h3>Other Options</h3> <p>Another item option for Shell Smash Crustle is White Herb to safely set up against Breaking Swipe Regidrago, physically defensive Landorus-T, and fast Rock Tomb Dracovish. Make sure you are slower than Regidrago to have White Herb go into effect on Breaking Swipe's Attack drop and not on the Defense and Special Defense drops of Shell Smash. Solar Blade can be used on the Choice Band set to lure Pokemon such as Swampert, Gastrodon, and Quagsire.</p>",
    "sets": {
      "Shell Smash": {
        "description": "<h4>Set Description</h4> <p>The combination of Sturdy and Mental Herb allows Crustle to safely set up against nearly any Pokemon without the threat of Taunt, Encore, or being OHKOed. Sturdy allows Crustle to live at least one hit from Pokemon such as Celesteela, Galarian Darmanitan, Volcanion, Volcarona, Kyurem, and non-Mold Breaker Haxorus, and due to the immense power of Rock Wrecker, they will be OHKOed after a Shell Smash boost. Mental Herb allows Crustle to safely Shell Smash against Encore Aromatisse and Taunt users such as Whimsicott. Rock Blast is used to break past Substitute users such as Entei, Zapdos, or Whimsicott to avoid Rock Wrecker's recharge turn. For the fourth moveslot, Counter is often used to beat Choice item Dracovish, non-Mold Breaker Haxorus, and some Zeraora sets. X-Scissor is occasionally used over Counter to beat Trick Cresselia and Zarude consistently. Lum Berry can be used to consistently beat Yawn Sylveon and can help in the Will-O-Wisp Volcanion matchup.</p> <h4>EVs</h4> <p>Maximum Speed investment allows Crustle to outspeed most of the metagame after a Shell Smash, while maximum Attack gives it the best rolls to OHKO a non-Defense invested Porygon-Z. Mental Herb Crustle can also use a Jolly Nature with the same EVs to outspeed Electric Seed Tapu Koko after a Shell Smash and KO it with Rock Wrecker.</p> <h4>Usage Tips</h4> <p>Crustle's main strategy is to utilize the combination of Sturdy and Shell Smash to set up without being OHKOed, and OHKO back with Rock Wrecker. Crustle can also use the combination of Shell Smash and Rock Blast to break past Substitute Pokemon like Zapdos or Entei. Against Pokemon such as Primarina or Sylveon, which can potentially run Custap Berry, you may want to Shell Smash twice to avoid clicking Rock Wrecker on Endure. It is important to note that due to Crustle's low Speed tier, it will not be able to outspeed Zeraora or Dragapult at +2 Speed.</p>"
      },
      "Choice Band": {
        "description": "<h4>Set Description</h4> <p>With Choice Band, Crustle is able to OHKO Pokemon such as Porygon-Z without Reflect, Primarina, and offensive Azumarill. Rock Blast is used to break through Substitute Pokemon like Zapdos, Entei, and Volcarona, while Earthquake secures the Zeraora and Aegislash matchups. Choice Band Crustle has several options for the last move: Heavy Slam consistently beats Aromatisse and Sylveon, X-Scissor is used to beat Zarude and Trick Cresselia, and Counter beats Choice item attackers such as Dracovish, Urshifu-S, and Garchomp.</p> <h4>EVs</h4> <p>232 HP and 24 Def EVs allow Crustle to survive Choice Band Haxorus's Outrage. 29 Speed IVs, along with a Brave Nature allow Crustle to underspeed Aegislash and OHKO its Blade Forme.</p> <h4>Usage Tips</h4> <p>Choice Band Crustle is very straightforward; in nearly every matchup you should use the strongest move, whether it is Rock Wrecker, Heavy Slam, or Earthquake. The one exception to this is against Substitute Pokemon, where Rock Blast is better.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 558869, "username": "Nick"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 518399, "username": "Itchy"}, {"user_id": 474883, "username": "Waylaid"}]}, {"name": "Grammar checked by", "members": [{"user_id": 277988, "username": "dex"}]}]}
  },
  "Carracosta": {"sets": {"Power Herb": {}}},
  "Archeops": {"sets": {"Life Orb": {}, "Choice Band": {}, "Choice Scarf": {}}},
  "Reuniclus": {"sets": {"Stored Power": {}}},
  "Escavalier": {"sets": {"Assault Vest": {}, "Sitrus Berry": {}}},
  "Jellicent": {"sets": {"Maranga Berry": {}, "Choice Scarf": {}}},
  "Ferrothorn": {
    "sets": {
      "Iron Defense + Chople Berry": {
        "description": "<h4>Set Description</h4> <p>Thanks to its incredible mixed bulk, Ferrothorn can handle many top-tier threats such as Primarina, Tapu Fini, and Magnezone. Holding a Chople Berry allows it to beat Fighting-types such as Pheromosa, non-Fire Punch Sawk, and Urshifu-R.</p> <p>Gyro Ball is typically Ferrothorn's strongest move and helps it deal with Fairy-types such as Sylveon, Tapu Lele and, Diancie. Iron Defense + Body Press allows Ferrothorn to deal with threats such as Zeraora without Blaze Kick and Chansey, increasing both its physical bulk and Body Press's power.</p> <p>For its final moveslot, it can either run Leech Seed or Power Whip. Leech Seed lets you beat Assault Vest and Haban Berry Regidrago, Assault Vest Landorus-T, and Iron Defense Registeel. Power Whip allows Ferrothorn to hit Water-types like Tapu Fini and Primarina.</p> <h4>EVs</h4> <p>248 HP and 52 Defense EVs with a Relaxed nature allow Ferrothorn to survive a Choice Band-boosted Close Combat from Jolly Choice Band Haxorus; 28 Attack EVs ensure that Ferrothorn OHKOes Haxorus after Iron Barbs damage and the Defense drop. The Special Defense EVs are for Custap Berry and Rocky Helmet Porygon-Z,  as well as Gardevoir if Ferrothorn has Leech Seed. 0 Speed IVs is used to maximize the damage of Gyro Ball.</p> <p>Another EV spread is 248 HP / 160 Def / 100 SpD. This bulks a Hyper Beam from Choice Specs Porygon-Z and 2HKOes with Body Press.</p> <h4>Usage Tips</h4> <p>Pokemon such as Tapu Fini and Metagross can use Trick to give Ferrothorn a Choice item. To handle this, Ferrothorn should use a damaging move against these Pokemon (removed E accent) turn 1. Against Encore + Disable Alolan Ninetales, Ferrothorn should use Gyro Ball turn one, and it should use either Power Whip or Leech Seed next turn to avoid wasting a turn due to Disable. This guarantees a win against both Encore + Disable and Life Orb variants of Alolan Ninetales. Against Zeraora, Ferrothorn should use Iron Defense on the first turn, which lets it survive the second turn and then KO with Body Press due to Close Combat Defense drops. If you believe your opponent is running a defensive Urshifu-R, use Iron Defense on the first turn to not get KOed by Body Press. However, if you suspect Urshifu-R is offensive, use Power Whip on the first turn instead to OHKO it after Close Combat. Be mindful that some Pokemon may run Fire-type coverage for Ferrothorn's 4x weakness to deal with it, such as Zeraora, Urshifu-R, Dragapult, and Dracozolt.</p>"
      },
      "Custap Berry": {
        "description": "<h4>Set Description</h4> <p>The combination of Endure + Custap Berry allows Ferrothorn to survive a hit that would KO and move first the next turn. Gyro Ball, which is often Ferrothorn's strongest move, helps beat Pokemon such as Galarian Darmanitan, Togekiss, and Sylveon. Payback helps Ferrothorn beat Pokemon like non-Choice Specs Magnezone, Metagross, and Trick + Choice Scarf Cresselia. Revenge helps the Magnezone matchup and helps Ferrothorn beat Aggron. Leech Seed solidifies the Aromatisse and Regidrago matchups by allowing Ferrothorn to survive longer and set up further Swords Dances.</p> <h4>EVs</h4> <p>240 HP EVs, 52 Defense EVs, and a Relaxed nature allow Ferrothorn to survive Fire Fang from Choice Band Garchomp.</p> <h4>Usage Tips</h4> <p>If a Pokemon's attack will bring Ferrothorn to 25% or less health, it can set up a Swords Dance on the first turn and use its Custap Berry to move first on the next turn. This strategy can be used against Zeraora, Landorus without Protect, and Rillaboom. Against potential Encore users, Ferrothorn should use a damaging move to avoid being locked into Swords Dance or Endure. Against Choice Scarf Togekiss, usually use Endure the first turn to predict their Fire-type coverage and then Gyro Ball on the second turn. However, Togekiss can also use Trick or Encore on the first turn. To avoid this, Ferrothorn can use Gyro Ball on the first turn. Against Alolan Ninetales, Ferrothorn should use Gyro Ball into Power Whip to prevent Disable and Encore from forcing it to use Struggle. Against Aromatisse, Ferrothorn should use Leech Seed on the first turn due to Gyro Balls low damage output; due to its HP investment, it can beat Aromatisse even after Aromatisse locks it into Leech Seed or makes it use Struggle. Custap Berry Ferrothorn can beat Choice Band Garchomp by clicking Swords Dance into Gyro Ball, and it beats Regidrago by using Gyro Ball first to avoid being OHKOed by a combination of Dragon Energy and Draco Meteor.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 489963, "username": "SwordIsBored"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 415626, "username": "LeCehlou"}, {"user_id": 474883, "username": "Waylaid"}, {"user_id": 430787, "username": "PA"}, {"user_id": 518399, "username": "Itchy"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}]}
  },
  "Chandelure": {"sets": {"Custap Berry": {}}},
  "Haxorus": {
    "comments": "<h3>Other Options</h3> <p>For both Choice Band and Choice Scarf sets, Haxorus can run Rivalry as its ability for a small niche to beat gender locked Pokemon that would normally be hard counters. A female Choice Scarf and Choice Band Haxorus can beat Choice Scarf Cresselia and Chansey, respectively. A male Choice Scarf Haxorus can beat Landorus. A downside to this is that it can be inconsistent versus a lot of Pokemon, as their gender is chosen at random.</p>",
    "sets": {
      "Choice Band": {
        "description": "<h4>Set Description</h4> <p>Haxorus is the only viable Unnerve user, allowing it to bypass Custap Berry and resistance Berries, making it a Dragon-type that effectively defeats other Dragon-types. Additionally, its pure Dragon typing allows it to take on a lot of Pokemon in the metagame, such as Regidrago and Rillaboom. Thanks to its high Attack stat and strong moves, it breaks past Pokemon like Volcanion, Tapu Bulu, and Volcarona. Mold Breaker can be used instead of Unnerve to beat Pokemon such as Magnezone, Sawk, Aggron, and, if Haxorus has Aqua Tail, Rhyperior.</p> <p>Outrage is a strong STAB attack that can be used against other Dragon-types, like Regidrago, Goodra, and Kommo-o, or other Pokemon that take neutral damage such as Volcanion, Volcarona, and Rillaboom. Low Kick and Superpower are used to avoid the Special Defense stat drops from Close Combat: Low Kick and Superpower are used to beat Heatran and Magnezone, while Superpower is used with an Adamant nature to have a better matchup against Urshifu-S and Chansey but with a worse matchup against Ferrothorn. Iron Tail OHKOes Sylveon and threatens Fairy-types like non-Choice Scarf Tapu Lele and some Togekiss. Earthquake beats a few Metagross and Tapu Koko sets. Poison Jab beats Tapu Bulu, threatens a few Tapu Koko sets, and is more reliable versus Whimsicott. First Impression can be used for Regieleki, Hydreigon, and Zarude, while Aqua Tail is used with Mold Breaker to beat Rhyperior. Counter can beat Play Rough Arcanine and some Metagross sets.</p> <h4>EVs</h4> <p>Maximum Attack and Speed investment makes Haxorus as fast and powerful as possible. A Jolly nature allows Haxorus to outspeed non-Choice Scarf Galarian Darmanitan, non-Choice Scarf Porygon-Z, and non-Choice Scarf Tapu Lele. Alternatively, an Adamant nature can be used to beat Venusaur and Jellicent. An alternate EV spread of 8 HP / 164 Atk / 160 SpD / 176 Spe with an Adamant nature can be used to survive special attacks from the likes of Landorus and Regieleki.</p> <h4>Usage Tips</h4> <p>Choice Band Haxorus is very straightforward use the super effective move or the move that does the most damage on a neutral target.</p>"
      },
      "Choice Scarf": {
        "description": "<h4>Set Description</h4> <p>Choice Scarf allows Haxorus to outpace common Pokemon that would normally outspeed and KO it, most notably Choice Scarf Galarian Darmanitan, Choice Scarf Porygon-Z, and maximum Speed Dragapult. Unnerve lets Haxorus beat Custap Berry users like Porygon-Z and Galarian Zapdos, while Mold Breaker beats Sturdy Pokemon like Magnezone, Aggron, and some Sawk. Outrage is a strong STAB attack for Dragon-types like Dragapult and Goodra, and Earthquake beats Magnezone and some Metagross sets. Low Kick avoids the stat drops from Close Combat, but Superpower with an Adamant nature can be used instead to beat frail Urshifu-S and beat most Magnezone. Poison Jab beats Whimsicott and Choice Scarf Togekiss lacking Dazzling Gleam, while Counter beats Play Rough Arcanine and a few Metagross sets.</p> <h4>EVs</h4> <p>Maximum Attack and Speed investment makes Haxorus as fast and powerful as possible. A Jolly nature allows Haxorus to outspeed and OHKO threats like Jolly Choice Scarf Galarian Darmanitan, Timid Choice Scarf Porygon-Z, and Dragapult, while an Adamant nature is better versus Regidrago and Kommo-o.</p> <h4>Usage Tips</h4> <p>Choice Scarf Haxorus is very straightforward use the super effective move or the move that does the most damage on a neutral target.</p>"
      },
      "Custap Berry": {
        "description": "<h4>Set Description</h4> <p>Custap Berry allows Haxorus to beat Regidrago and fast, frail attackers like Galarian Darmanitan and Naganadel in one set. Swords Dance helps Haxorus break through slower threats like Metagross, Chansey, and Assault Vest Registeel. Unnerve helps Haxorus beat opposing Custap Berry and resistance Berry users like Regidrago, while Mold Breaker allows Haxorus beat Sturdy Pokemon such as Magnezone, Aggron, and Sawk.</p> <h4>EVs</h4> <p>The Defense EVs allow Haxorus to survive a Meteor Mash from Adamant Choice Band Metagross. The Speed investment is for Jolly Dracovish and Dracozolt, and the remaining EVs are put in Attack for the best Regidrago matchup.</p> <h4>Usage Tips</h4> <p>Against Pokemon that cannot threaten to OHKO Haxorus, such as Regidrago and Rillaboom, Haxorus should attack turn 1. Against a foe that threatens to OHKO Haxorus, such as Galarian Darmanitan, Endure allows Haxorus to take the hit and OHKO back. Use Swords Dance against Chansey turn 1, then use Superpower on turn 2. Use Swords Dance against Metagross turn 1, then use Earthquake turn 2. However, if Metagross is revealed to have Choice Scarf, and the damage dealt is less than 75%, Haxorus should use Endure turn 2 and Earthquake turn 3, activating its Custap Berry to move first.</p>"
      },
      "Life Orb": {"description": "<h4>Set Description</h4> <p>The combination of Swords Dance and Life Orb boost Haxorus's Attack to high levels, allowing it to effectively break defensive Pokemon. Outrage is a strong STAB move, and Superpower hits Steel-types like Magnezone and Registeel. Taunt and Swords Dance combined allows Haxorus to beat Pokemon like Registeel, Chansey and Galarian Corsola, while Dragon Dance and Poison Jab allow Haxorus to beat some Tapu Koko sets, Whimsicott, and Tapu Bulu.</p> <h4>EVs</h4> <p>The HP and Special Defense EVs allow Haxorus to survive a Hyper Beam from Modest Choice Specs Regieleki. The Speed investment is for Jolly Dracovish and Dracozolt, and the remaining EVs are put in Attack for maximum damage output.</p> <h4>Usage Tips</h4> <p>If running Taunt, Haxorus should use it turn 1 on stall Pokemon like Registeel, Chansey, and Galarian Corsola, then boost its Attack stat to an appropriate level to secure an OHKO or 2HKO.</p>"}
    },
    "credits": {"writtenBy": [{"user_id": 579035, "username": "glitched"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 518399, "username": "Itchy"}]}, {"name": "Grammar checked by", "members": [{"user_id": 467437, "username": "Dawn of Ares"}, {"user_id": 384270, "username": "autumn"}]}]}
  },
  "Durant": {"sets": {"Life Orb": {}, "Entrainment": {}}},
  "Hydreigon": {"sets": {"Choice Specs": {}, "Choice Scarf": {}, "Haban Berry": {}}},
  "Volcarona": {"sets": {"Kee Berry": {}, "Life Orb": {}, "Custap Berry": {}, "Choice Specs": {}}},
  "Terrakion": {"sets": {"Weakness Policy": {}}},
  "Thundurus-Therian": {"sets": {"Choice Specs": {}, "Assault Vest": {}}},
  "Landorus": {"sets": {"Fast Life Orb": {}, "Bulky Life Orb": {}, "Choice Specs": {}, "Choice Band": {}}},
  "Landorus-Therian": {"sets": {"Assault Vest": {}, "Fast Choice Band": {}, "Bulky Choice Band": {}, "Offensive Life Orb": {}, "Defensive Life Orb": {}, "Lum Berry": {}, "Choice Scarf": {}, "Jaboca Berry": {}}},
  "Kyurem": {"sets": {"Choice Specs": {}, "Haban Berry Stall": {}, "Haban Berry Offensive": {}, "Assault Vest": {}, "Chople Berry": {}, "Choice Scarf": {}, "Roseli Berry": {}, "Weakness Policy": {}}},
  "Keldeo": {"sets": {"Sitrus Berry": {}}},
  "Diggersby": {"sets": {"Life Orb": {}}},
  "Talonflame": {"sets": {"Kee Berry": {}}},
  "Aegislash": {"sets": {"Weakness Policy": {}, "Physical Life Orb": {}, "Special Life Orb": {}, "Air Balloon": {}}},
  "Aromatisse": {"sets": {"Defensive Rocky Helmet": {}, "Bulky Rocky Helmet": {}, "Bulky Wiki Berry": {}}},
  "Slurpuff": {"sets": {"Cotton Guard + Belly Drum": {}}},
  "Sylveon": {
    "comments": "<h3>Other Options</h3> <p>A Babiri Berry gives Yawn Sylveon a fighting chance against Pokemon like Choice Band Tyranitar, Aggron, Steelix, and Kartana, though the more popular Steel-types, such as Celesteela, Metagross, Ferrothorn, and Registeel, remain insurmountable walls.</p> <p>Yawn sets with Fake Tears and Hyper Beam can run Life Orb for maximum offensive power. This set can punch holes in threats that ordinarily would wall Sylveon, beating bulky Ferrothorn and bulky Celesteela with two Fake Tears into Hyper Beam; note that these foes might wake up early so you may have to play around a potential Endure. This option can also OHKO Pokemon that would normally be able to tank a single move, such as Azumarill and bulky Tapu Bulu. An EV spread of 252 HP / 48 Def / 172 SpA / 36 SpD with a Quiet nature and 29 Speed IVs lets Sylveon survive Choice Specs Sylveon's Hyper Beam as well as maximum Attack Ferrothorn's Gyro Ball while still outspeeding typical Chansey and Azumarill sets. The remaining EVs have been put into Special Attack for the best chance to beat physically defensive Aromatisse.</p>",
    "sets": {
      "Choice Specs": {
        "description": "<h4>Set Description</h4> <p>With Choice Specs, Sylveon can break out immensely powerful moves on the first turn of battle. Hyper Voice is a good move against frail Pokemon like Regieleki, common Substitute users like Dragapult and Whimsicott, and common Endure users like Garchomp. Hyper Beam OHKOes neutral targets like physically defensive Aromatisse and Landorus. Echoed Voice beats Substitute Zapdos variants lacking Eerie Impulse, as well as certain specially bulky Trick Cresselia sets. Mystical Fire is a coverage option that beats Ferrothorn. Psyshock handles Power Herb Nihilego, and Draining Kiss has niche usage against Kommo-o, which can block all of Sylveon's other moves with Substitute and Soundproof, as well as Custap Berry and Choice Scarf variants of Sawk, which cannot 2HKO Sylveon after it heals.</p> <h4>EVs</h4> <p>The HP EVs allow Sylveon to tank Choice Specs Landorus's Sludge Wave. Special Attack is maxed out to grant the best possible chances against targets like Assault Vest Goodra, Landorus, and non-Psychic Seed Tapu Lele. The Speed investment allows Sylveon to always outpace Adamant Rhyperior. The remainder is put in Defense for the best survival odds against Choice Band Garchomp's Earthquake.</p> <p>Alternatively, Sylveon can run a bulky spread of 224 HP / 148 SpA / 136 SpD with a Calm nature. This allows it to tank Adamant Choice Band Dragapult's Phantom Force, as well as Choice Specs Naganadel's Sludge Wave. If ran alongside Psyshock, it notably allows Sylveon to tank a hit from any Nihilego set and OHKO it back.</p> <h4>Usage Tips</h4> <p>In general, Choice Specs Sylveon has a simple gameplan: use Hyper Voice. Hyper Beam should be used against Pokemon which have the potential to KO Sylveon before it can attack a second time, such as Azumarill, Goodra, and Landorus-T. The remaining moves are very situational and should not be used outside of their listed matchups.</p> <p>Choice Specs Sylveon commonly finds itself in uncertain matchups against Custap Berry users. Custap Berry Primarina, for instance, beats a Sylveon using Hyper Beam by opening with Endure. However, if Sylveon uses Hyper Voice, Primarina wins by using Moonblast followed by Endure then KOing with a Torrent-boosted Hydro Cannon. As such matchups are effectively coin flips, no advice allows for consistent victories.</p>"
      },
      "Custap Berry": {
        "description": "<h4>Set Description</h4> <p>With Endure and a Custap Berry, Sylveon can survive powerful attacks like Choice Specs Porygon-Z's Hyper Beam, Choice Band Galarian Darmanitan's Giga Impact, and Choice Specs Naganadel's Sludge Wave, then retaliate with a powerful attack. Hyper Beam OHKOes the aforementioned Pokemon and helps against Goodra and Aromatisse. Hyper Voice is useful against Substitute users like Dragapult and Whimsicott and Sturdy Pokemon like Crustle and Sawk, while Fake Tears offers an anti-stall tool to be used against Sap Sipper Azumarill, defensive Chansey, and Cresselia sets without Trick or Skill Swap.</p> <h4>EVs</h4> <p>Maximum Special Attack allows for optimal odds against Trick Togekiss and Tapu Koko. The Defense EVs allow Sylveon to always survive Adamant Life Orb Urshifu-R's Surging Strikes. The remainder of the EVs are put in Speed to try and outspeed other base 60s, like Primarina and opposing Sylveon, as well as possible.</p> <h4>Usage Tips</h4> <p>Broadly speaking, Sylveon should use Hyper Voice or Fake Tears on turns it's not at risk of getting OHKOed, and it should go for Endure followed by Hyper Beam on turns where it is. However, against Pokemon with priority moves, like Azumarill and Urshifu-R, it is not possible to safely drop to 1 HP. Sylveon should also beware of using Hyper Beam on Endure from Pokemon like Tyranitar and Rhyperior; instead, it should use Fake Tears if you predict Endure. Unlike most Custap Berry users, Sylveon should use Endure turn one against Regieleki, as it will always survive and consume its Custap Berry next turn, whereas attacking runs the risk of fainting to Electro Ball. While Sylveon beats most Choice-locked Dragon types, it loses to Choice Scarf Dracovish and Dracozolt, as their signature moves' power is less on turns where Sylveon uses Endure, and it is consequently not put into Custap Berry range. The optimal play in these matchups is to use Endure twice in a row, giving Sylveon a 1/3 chance to activate its Custap Berry.</p>"
      },
      "Yawn": {
        "description": "<h4>Set Description</h4> <p>Sylveon is the best Yawn user and, in fact, the best sleep inducer in the whole SS 1v1 metagame, as it boasts good bulk, powerful attacks, and potentially a very solid setup move. A Mental Herb allows Sylveon to safely use Yawn versus Taunt and Encore users like Aromatisse, Primarina, Spectrier, Togekiss and Gardevoir. Hyper Voice is able to beat Substitute users like Dragapult and Whimsicott, but Hyper Beam's higher damage offers reliability versus Pokemon like Choice Scarf Galarian Darmanitan and Modest Porygon-Z without a boosting item. Fake Tears notably gives the set a shot at beating Maranga Berry Corviknight, which is otherwise a hard Sylveon counter. The move also helps versus walls like Tapu Koko and Sap Sipper Azumarill.</p> <h4>EVs</h4> <p>The HP EVs allow Sylveon to survive Choice Specs Regieleki's Electro Ball. The Defense EVs let it tank Surging Strikes from Adamant Choice Band Urshifu-R. The remaining EVs have been put in Special Attack to improve odds versus Pokemon like Primarina and Togekiss.</p> <h4>Usage Tips</h4> <p>When a foe is on their third sleep turnthus guaranteed to wake up next turnand is impossible to KO in a single move, it is usually advantageous for Sylveon to re-apply Yawn's drowsinessusing Protect against slower foes so that they can wake upas this yields several additional turns.</p> <p>Beware of Pokemon potentially carrying Trick, like Togekiss, Porygon-Z, Cresselia, and Telepathy Tapu Fini, and do not use Yawn or Fake Tears against an unknown set. Protect may be used to scout for this eventuality, though at the risk of being set up onit is often safer to simply attack.</p> <p>Note that Tapu Koko's Electric Terrain and Tapu Fini's Misty Terrain both prevent sleep, making Yawn a waste of a turn against these Pokemon. Likewise, Yawn should not be used against Porygon-Z, as that Pokemon commonly runs Uproar. Finally, both Urshifu formes ignore Protect with their ability. Do not use Yawn against these Pokemon, as there is no guarantee Sylveon will be able to survive until the foe falls asleep.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 501918, "username": "Here Comes Team Charm!"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 579035, "username": "glitched"}, {"user_id": 501592, "username": "Nunnbetter"}]}, {"name": "Grammar checked by", "members": [{"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Goodra": {"sets": {"Standard": {}, "Counter": {}}},
  "Avalugg": {"sets": {"Stall": {}, "Bulky Band": {}, "Fast Band": {}}},
  "Zygarde": {"sets": {"Weakness Policy": {}, "Life Orb": {}}},
  "Diancie": {"sets": {"Weakness Policy": {}, "Choice Specs": {}}},
  "Volcanion": {
    "comments": "<h3>Other Options</h3> <p>Volcanion can run Life Orb to help improve the Celesteela and Sylveon matchups even further, using a moveset of Overheat, Steam Eruption, Sludge Wave, and Flame Charge. Sludge Wave is used over Sludge Bomb because Volcanion doesn't need the extra poison chance, since Sylveon would do enough damage to KO -2 Volcanion with the additional Life Orb recoil.</p> <p>Choice Band Volcanion can lure in Pokemon that would normally beat it, such as Tapu Lele, Spectrier, and Togekiss with a moveset of Liquidation, Overheat, Flare Blitz, and Heavy Slam, although some of its matchups are a bit unreliable.</p>",
    "sets": {
      "Choice Specs": {
        "description": "<h4>Set Description</h4> <p>Volcanion carries a niche in 1v1 with its unique typing and good bulk, which gives it very good matchups versus two common type cores in 1v1: Fairy + Fire + Steel and Fire + Water + Grass. Sludge Bomb is used over Sludge Wave for the greater poison chance, which helps in the Sylveon matchup. Earth Power can be used for opposing Volcanion, and Hyper Beam for most Haxorus, while Fling and Water Pulse can be used for Avalugg and Pressure stall Entei, respectively.</p> <h4>EVs</h4> <p>248 HP EVs and 108 Defense EVs let Volcanion survive Fake Out + Wood Hammer from Adamant Life Orb Rillaboom, as well as Earthquake from Adamant Choice Band Haxorus. The Special Defense allows it to take a Hyper Beam at -2 Special Defense from Modest Sylveon. The Speed investment outspeeds Adamant Rhyperior and some Metagross. The remaining EVs are dumped into Special Attack.</p> <h4>Usage Tips</h4> <p>Choice Specs Volcanion is fairly straightforwardOverheat is almost always advised if both of Volcanion's STAB moves are neutral against the foe. If running Fling, use it versus Avalugg turn 1, then Overheat turn 2.</p>"
      },
      "Sitrus Berry": {
        "description": "<h4>Set Description</h4> <p>Sitrus Berry Volcanion trades the raw power of Choice Specs for better matchups against a few physical attackers, most notably Aggron, Sawk, Avalugg, and some Dracovish. Sitrus Berry secures the positive matchup against Choice Band Sawk and Assault Vest Urshifu-S, and it helps against Registeel. Will-O-Wisp beats various physical attackers, and Haze helps versus Registeel and Spectrier.</p> <h4>EVs</h4> <p>The HP and Defense EVs allow Volcanion to survive Fake Out + Wood Hammer from Adamant Life Orb Rillaboom. The Speed investment outspeeds Adamant Aggron, and the rest of the EVs are dumped into Special Attack.</p> <h4>Usage Tips</h4> <p>Against opposing Aggron, Avalugg, and Sawk, Volcanion should use Will-O-Wisp turn 1 to break Sturdy and survive a hit, then Overheat on turn 2 to KO or Steam Eruption against Aggron to minimise misses. To beat Urshifu-S, first use Will-O-Wisp to make sure it won't 2HKO Volcanion, then use Steam Eruption, and then Overheat to maximize damage output and minimize miss chances. However, if the damage Volcanion takes reveals Urshifu-S to have Choice Band, Overheat should be used immediately after Will-O-Wisp to KO it.</p>"
      },
      "Choice Scarf": {
        "description": "<h4>Set Description</h4> <p>Choice Scarf Volcanion outspeeds and surprises some of its checks like Landorus, Nihilego, Pressure Entei, and Galarian Darmanitan. Earthquake OHKOes Nihilego, while Heavy Slam beats most Tapu Lele. Fling can also be used for Avalugg.</p> <h4>EVs</h4> <p>The HP and Defense allow Volcanion to survive Jolly Choice Scarf Galarian Darmanitans Earthquake, with the HP giving some special bulk too. The Speed investment is for opposing Nihilego. The rest of the EVs are dumped into Special Attack.</p> <p>An alternate EV spread of 144 HP / 152 Def / 20 SpA / 192 Spe with a Modest nature can be used to tank an Earthquake from Adamant Choice Scarf Galarian Darmanitan. 72 HP / 64 Def / 180 SpA / 192 Spe and a Modest nature can be used to more reliably beat Assault Vest Glastrier, maximising Special Attack while still surviving Earthquake from Choice Band Avalugg.</p> <h4>Usage Tips</h4> <p>Choice Scarf Volcanion is very straightforward to useif both of Volcanion's STAB moves are neutral against the foe, Overheat is almost always recommended. If Volcanion has Fling, it should be used turn 1 against an opposing Avalugg, then Overheat turn 2 to KO.</p>"
      },
      "Custap Berry": {
        "description": "<h4>Set Description</h4> <p>Custap Berry Volcanion gains positive matchups against Pokemon like Porygon-Z and Custap Berry Tapu Lele. Flame Charge helps beat Celesteela, SubSeed Venusaur, and opposing Custap Berry Pokemon, while Heavy Slam beats most Tapu Lele. Earthquake is mainly used for Nihilego.</p> <h4>EVs</h4> <p>The HP and Defense investment allows Volcanion to survive an Earthquake from Choice Band Avalugg, while the Speed investment allows it to outspeed base 90 Speed Pokemon such as Porygon-Z, Moltres and Galarian Moltres. An alternate EV spread of 248 HP / 132 Def / 128 SpA with Earthquake can provide a somewhat reasonable Zeraora matchup.</p> <h4>Usage Tips</h4> <p>Endure is almost always the best move turn 1 versus threats that can OHKO Volcanion, like Galarian Darmanitan and Porygon-Z. Then, after activating Custap Berry, it can OHKO back with the appropriate move. Against Avalugg, Volcanion should use a physical move turn 1, breaking Avalugg's Sturdy without letting it land Mirror Coat. Against Venusaur, Volcanion should use Flame Charge turn 1 to reliably beat all of its sets. If the alternate EV spread is used, Volcanion can freely use Earthquake turn 1 against opposing Zeraora. If Zeraora uses Knock Off, then use Earthquake turn 2. If Zeraora uses Plasma Fists turn 1, some prediction is required. Volcanion must use Endure on Plasma Fists or Earthquake on Knock Off. However, if Zeraora's Plasma Fists brings Volcanion below 25%, you can simply use Earthquake turn 2 because Custap Berry will activate.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 579035, "username": "glitched"}, {"user_id": 541106, "username": "Adam3560"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 518399, "username": "Itchy"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}]}
  },
  "Incineroar": {"sets": {"Weakness Policy": {}, "Assault Vest": {}, "Chople Berry": {}}},
  "Primarina": {"sets": {"Custap Berry": {}, "Sitrus Berry": {}, "Choice Specs": {}, "Wacan Berry": {}, "Pixie Plate": {}, "Mental Herb": {}}},
  "Toxapex": {"sets": {"Air Balloon": {}, "Black Sludge": {}}},
  "Salazzle": {"sets": {"Life Orb": {}, "Encore + Disable": {}}},
  "Golisopod": {"sets": {"Assault Vest": {}}},
  "Pyukumuku": {"sets": {"Counter + Mirror Coat": {}}},
  "Type: Null": {"sets": {"Stall": {}}},
  "Silvally-Fairy": {"sets": {"Mixed Attacker": {}}},
  "Silvally-Grass": {"sets": {"Mixed Defensive": {}}},
  "Silvally-Poison": {"sets": {"Substitute + Reversal": {}}},
  "Silvally-Water": {"sets": {"Iron Defense": {}}},
  "Kommo-o": {"sets": {"Sitrus Berry": {}, "Haban Berry": {}, "Yache Berry": {}}},
  "Tapu Koko": {"sets": {"Electric Seed Stall": {}, "Charge + Wild Charge": {}, "Life Orb": {}, "Thief": {}, "Electric Seed Offensive": {}}},
  "Tapu Lele": {"sets": {"Psychic Seed": {}, "Custap Berry": {}, "Choice Specs": {}, "Weakness Policy": {}, "Choice Scarf": {}, "Anti-Magnezone": {}}},
  "Tapu Bulu": {
    "comments": "<h3>Other Options</h3> <p>Tapu Bulu can run an EV spread of 248 HP / 80 Atk / 88 Def / 76 SpD / 16 Spe with an Impish nature. The Special Defense and HP EVs allow it to tank Fire Blast from Choice Specs Timid Dragapult. If running Dazzling Gleam for Urshifu-S, then the spread of 176 HP / 132 Atk / 144 Def / 56 Spe with Impish nature allows Tapu Bulu to tank a Poison Jab from Choice Band Urshifu-S. In the fast Grassy Seed set, Taunt can be a valuable option for Tapu Bulu to defeat Iron Defense Registeel.</p>",
    "sets": {
      "Defensive Grassy Seed": {
        "description": "<h4>Set Description</h4> <p>The combination of Grassy Seed, Grassy Surge, and Tapu Bulu's highly competitive typing allows it to defeat common physical attackers like both Urshifu formes, Azumarill, Choice Scarf Galarian Darmanitan, and Zeraora. Wood Hammer allows Tapu Bulu to defeat Water-types like Primarina, Tapu Fini, and Huge Power Azumarill while also dealing a good amount of damage to neutral targets such as Zeraora thanks to the boost from Grassy Surge. Horn Leech helps in matchups where the provided recovery makes a difference, such as Custap Berry Sawk and some Glastrier sets, although Wood Hammer is a better option to secure rolls such as OHKOing Choice Band Urshifu-R and Choice Specs Tapu Fini. Disable helps against threatening Choice item attackers such as Choice Scarf Galarian Darmanitan and Choice Band Landorus-T. Leech Seed and Synthesis provide reliable recovery; Leech Seed combined with Wood Hammer allows Tapu Bulu to have a better matchup against Aromatisse, while Synthesis is another option that works well with Disable against foes like non-Choice Scarf Metagross. In the final moveslot, Taunt prevents stall Pokemon like Chansey from using Toxic, and Dazzling Gleam completely shatters Urshifu-S. The combination of Taunt + Disable allows Tapu Bulu to secure the win against common stall threats like Kee Berry Cresselia and Sap Sipper Azumarill, the latter of which is commonly used to defeat Grass-types. Bulk Up boosts allow Tapu Bulu to defeat Custap Berry Aggron and, in conjunction with Taunt, break through bulky Pokemon like opposing Tapu Bulu.</p> <h4>EVs</h4> <p>The Defense and HP investments allow Tapu Bulu to survive Choice Band Aggron's Heavy Slam. 56 Speed EVs is important to let Tapu Bulu outspeed Adamant Choice Band Aggron and Crustle.</p> <h4>Usage Tips</h4> <p>This set serves a diverse role in the metagame; for example, it is able to defeat stall Pokemon like Kee Berry and non-Icy Wind Leftovers Cresselia with the combination of using Taunt on the first turn and then using Disable on the only attack Cresselia has, forcing it to use Struggle. Tapu Bulu is also reliable against physical attackers that can't tank multiple Wood Hammer boosted by Grassy Surge, such as Zeraora, while its typing allows it to secure the win against threats like Urshifu-R and Rhyperior. However, there are a few matchups that are not straightforward: Against Crustle, opening with Leech Seed negates its Sturdy ability, ensuring that a follow-up Wood Hammer secures the KO; since Crustle doesn't survive Wood Hammer after using Shell Smash, this sequence guarantees the win. Against Chansey, you should be aware of Counter and Toxic, so Tapu Bulu should use Taunt on the first turn and then Leech Seed + Disable on the Seismic Toss, only clicking Wood Hammer when Chansey is in KO range to avoid Counter. Disable can be used to defeat Choice Band Arcanine and Choice Scarf Galarian Darmanitan, as the Grassy Seed boost and the EVs in Defense allow Tapu Bulu to tank a Flare Blitz and Icicle Crash, respectively. Using Disable the first turn, followed by a recovery move like Leech Seed or Synthesis, allows Tapu Bulu to win both matchups via forcing them to use Struggle. Tapu Bulu defeats most Urshifu-S sets with Dazzling Gleam. In the case of not running Dazzling Gleam, be aware that Choiced Urshifu-S could lure Tapu Bulu in with Poison Jab, which 2HKOes it. Therefore, if you suspect this kind of lure, use Disable on the first turn to secure the win. Choice Scarf Haxorus also threatens Tapu Bulu with Poison Jab, so Disable on the first turn is the right move in this matchup too. Against Azumarill, Tapu Bulu can safely use Wood Hammer on the first turn, and if it's Sap Sipper, Tapu Bulu wins by using the combination of Taunt + Disable. Tapu Bulu can defeat Aromatisse if running Leech Seed, as it secures the win by using Wood Hammer turn one and Leech Seed turn two.</p>"
      },
      "Fast Grassy Seed": {
        "description": "<h4>Set Description</h4> <p>This Tapu Bulu set aims to outspeed and defeat Pokemon that the defensive set struggles against, such as Magnezone and Icy Wind Cresselia, thanks to the combination of Substitute + Disable. Leech Seed alongside Grassy Surge provides Tapu Bulu with reliable recovery, draining health from bulky foes that are not threatened by Tapu Bulu's STAB move, such as Registeel. Leech Seed + Wood Hammer allows Tapu Bulu to defeat Aromatisse. Substitute synergizes well with Leech Seed, as this combination allows Tapu Bulu to defeat slower Pokemon like Assault Vest Registeel. Wood Hammer OHKOes Water-type foes like Primarina and non-stall Azumarill, as well as dealing a decent amount of damage to neutral targets like Urshifu-S and Dracovish thanks to Grassy Surge.</p> <h4>EVs</h4> <p>Running 160 HP EVs helps Tapu Bulu tank any attack from Choice Specs Tapu Fini, while 28 Defense EVs allow Tapu Bulu to easily survive Blaze Kick from Choice Band Zeraora and Poison Jab from both Choice Scarf Urshifu-S and Choice Scarf Haxorus. The Speed EVs help Tapu Bulu outrun Magnezone and Celesteela.</p> <h4>Usage Tips</h4> <p>The primary goal of this set is to effectively utilize Substitute + Disable to block and neutralize incoming attacks from slower foes that would otherwise threaten Tapu Bulu with overwhelming damage. Tapu Bulu should use Substitute on the first turn against Magnezone using Flash Cannon, followed by Disable and Leech Seed to secure the win. Substitute on the first two turns is a safe option to scout Magnezone's set if you are not sure about it being Choice Specs, as Metal Sound Magnezone can defeat Tapu Bulu. The same sequence applies to matchups like Choice Band Steelix and Choice Band Aggron. Against faster threats like Choice Scarf Haxorus running Poison Jab, Tapu Bulu should use Disable first and Leech Seed the turn after. Tapu Bulu secures the win against Assault Vest Registeel by using Leech Seed on the first turn, Substitute until it can't use Substitute anymore due to low HP, and then Wood Hammer; the damage on the final turn is enough thanks to Leech Seed wearing Registeel down.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 564420, "username": "Lialiabeast"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 501592, "username": "Nunnbetter"}, {"user_id": 509647, "username": "Mishlef"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}, {"user_id": 637479, "username": "red fintans"}]}]}
  },
  "Tapu Fini": {"sets": {"Leftovers": {}, "Sitrus Berry": {}, "Choice Scarf": {}, "Anti-Galarian Darmanitan": {}, "Anti-Volcanion": {}, "Choice Specs": {}}},
  "Nihilego": {"sets": {"Fast Power Herb": {}, "Defensive Power Herb": {}, "Choice Specs": {}}},
  "Buzzwole": {"sets": {"Occa Berry": {}, "Choice Band": {}}},
  "Pheromosa": {"sets": {"Choice Band": {}, "Choice Specs": {}}},
  "Celesteela": {
    "sets": {
      "Standard Occa Berry": {},
      "Fast Occa Berry": {},
      "Custap Berry": {},
      "Life Orb": {},
      "Choice Band": {
        "description": "<h4>Set Description</h4> <p>Celesteela's access to a diverse array of powerful physical moves makes it a good Choice Band user. Heavy Slam OHKOes Pokemon like Aromatisse, Tapu Lele, and Naganadel. Megahorn beats non-Kee Berry Cresselia and secures the Zarude matchup. Earthquake gives solid odds versus Assault Vest Registeel, Aggron, and Metagross. Superpower ensures Celesteela can reliably beat Tyranitar. A Defense-invested Porygon-Z can survive Heavy Slam and KO Celesteela with +2 Life Orb Hyper Beam or Thunderbolt, but Superpower's higher damage OHKOes these sets. Flamethrower handles Iron Defense Ferrothorn and non-Mirror Coat Avalugg. Seed Bomb beats Water / Ground type Pokemon like Gastrodon and Quagsire.</p> <h4>EVs</h4> <p>The HP and Defense EVs ensure that Choice Band Aggron will never OHKO Celesteela with Head Smash, allowing Celesteela to finish it off with an Earthquake after recoil. The Special Defense EVs guarantee that Celesteela will always survive a Fire Blast from Choice Specs Modest Naganadel. 8 Speed EVs allow Celesteela to outspeed fast Choice Band Steelix, which can otherwise 3HKO with Fire Fang. The remaining EVs have been invested in Attack for the best possible chances against Porygon-Z.</p> <h4>Usage Tips</h4> <p>As most of its moves have no secondary effects, Choice Band Celesteela is very straightforward to use: simply opt for the most damaging move. Note that versus Aggron, it is best to avoid stat drops, and versus Assault Vest Registeel, a careful balance must be struck between 2HKOing it and minimizing potential Counter damage, which makes Earthquake the move of choice over Superpower in both of those matchups.</p>"
      },
      "Anti-Primarina": {
        "description": "<h4>Set Description</h4> <p>A Custap Berry Primarina with Encore can generally beat any Celesteela set. However, with a Mental Herb, Celesteela can lure one of its most powerful hard counters, using Leech Seed to get around Endure and Heavy Slam to 2HKO Primarina. Flamethrower helps against Steel-types like Ferrothorn and Metagross, and Protect grants extra turns of Leech Seed recovery, which comes in handy against Haxorus and Choice Specs Landorus.</p> <h4>EVs</h4> <p>The Attack, HP, and Defense EVs allow Celesteela to survive any two attacks from Haxorus, including Adamant Choice Band Low Kick, and beat it by clicking Leech Seed, Protect, Heavy Slam, and then Protect again. The Special Defense EVs do the same for two Focus Blasts from Choice Specs Landorus. The remaning 16 EVs have been placed in Speed for the best chance to outspeed Primarina.</p> <h4>Usage Tips</h4> <p>Versus Primarina, use Leech Seed followed by Heavy Slam. Using Heavy Slam twice risks putting a faster Primarina in Torrent range while taking significant chip damage from Moonblast, while using Heavy Slam followed by Leech Seed can be punished by a faster set with Encore. The only problem for this strategy is posed by Sitrus Berry sets, which can survive two rounds of Leech Seed damage and two Heavy Slams to wind up in Torrent range. If Primarina is slower, stalling out two extra turns with Protect prevents this from happening, but caution should be taken that Primarina does not use Calm Mind during those turns. Make sure to use Protect whenever a Primarina with an unknown item ends up below 25% HP, to play around a potential Custap Berry.</p> <p>Generally, Celesteela should use Leech Seed on the first turn of combat, then alternate Protect with attacks. This maximizes Leech Seed drain and thus recovery. Thanks to Celesteela's Mental Herb, this strategy is viable even against Taunt users like Galarian Moltres. However, remain wary of Trick Pokemon like Porygon-Z and Tapu Fini. Scouting with Protect can be used to help decide on the proper move versus those.</p>"
      },
      "Anti-Urshifu": {
        "description": "<h4>Set Description</h4> <p>By running a very physically defensive set with Sitrus Berry, Celesteela can beat powerhouses like non-Reversal Urshifu-S, Shell Smash Crustle, and Choice Band Sawk. Air Slash breaks Crustle's Sturdy and KOes frail Urshifu-S, Urshifu-R, and Sawk after two rounds of Leech Seed damage. Flamethrower beats Steel-types like Ferrothorn and Metagross. Heavy Slam is a strong STAB move that hits Pokemon like Togekiss, Sylveon, and Tapu Fini.</p> <h4>EVs</h4> <p>The Defense and HP EVs give Celesteela the best possible odds to survive two Wicked Blows from Adamant Choice Band Urshifu-S if it uses Leech Seed on the first turn. 12 Attack EVs maximize Celesteela's chances to beat Primarina, Liquidation Belly Drum Azumarill, and Choice Scarf Togekiss.</p> <h4>Usage Tips</h4> <p>Celesteela should use Leech Seed on the first turn of combat, followed by Air Slash, to beat almost any Urshifu-S, Urshifu-R, or Sawk set. Against Crustle, it should open with Air Slash to avoid a potential Counter. Heavy Slam is generally the best choice versus Choice Scarf Togekiss, as it prevents Celesteela from being locked into a weak move by Trick and still has a chance to beat Togekiss using Fire Blast.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 501918, "username": "Here Comes Team Charm!"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 579035, "username": "glitched"}, {"user_id": 501592, "username": "Nunnbetter"}]}, {"name": "Grammar checked by", "members": [{"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Kartana": {"sets": {"Life Orb": {}, "Choice Band": {}, "Choice Scarf": {}}},
  "Naganadel": {"sets": {"Choice Specs": {}, "Life Orb": {}}},
  "Blacephalon": {"sets": {"Choice Specs": {}, "Choice Scarf": {}}},
  "Zeraora": {
    "sets": {
      "Choice Band": {
        "description": "<h4>Set Description</h4> <p>Plasma Fists OHKOes most Urshifu-R, Celesteela, Tapu Fini, and non-Custap Berry Primarina, and as an added bonus it makes Normal-type moves Electric-type, which lets Zeraora absorb them with Volt Absorb. This is useful versus non-Choice Scarf Porygon-Z. Knock Off defeats Dragapult and Spectrier and has good odds to win against Naganadel. Play Rough OHKOes Urshifu-S and non-Choice Scarf Haxorus. Close Combat OHKOes Galarian Darmanitan, non-Chople Berry Tyranitar, and some Heatran. Outrage beats many Dragon-types, such as Dracovish, Dracozolt, and occasionally Goodra. It also guarantees beating Naganadel, but Knock Off is usually adequate there, as Modest Naganadel's Draco Meteor only occasionally OHKOes Zeraora. Blaze Kick OHKOes Ferrothorn and Kartana.</p> <h4>EVs</h4> <p>The Speed investment and the Jolly nature are for opposing Zeraora and Dragapult; the Special Defense is for surviving Choice Specs-boosted Hyper Beam from Regieleki.</p> <h4>Usage Tips</h4> <p>Choice Band Zeraora is quite straightforward; use the move that does the most damage.</p>"
      },
      "Assault Vest": {"description": "<h4>Set Description</h4> <p>Zeraora can hold an Assault Vest to take on various special attackers, such as Sylveon and Porygon-Z, which other sets typically struggle with. Knock Off allows Zeraora to defeat all Haxorus with Outrage and Heatran with Close Combat. Iron Tail helps out versus Sylveon and Aromatisse; it 2HKOes bulky Sylveon, and Iron Tail + Plasma Fists 2HKOes Aromatisse. Fire Punch OHKOes Kartana and 2HKOes Ferrothorn.</p> <h4>EVs</h4> <p>The HP investment allows Zeraora to survive Porygon-Z's Hyper Beam; the Defense investment is for Choice Scarf Haxorus's Earthquake. The Speed is for outspeeding base 110 Speed Pokemon, such as Archeops and Latios.</p> <h4>Usage Tips</h4> <p>In most matchups, use the move that does the most damage.</p> <p>Against Haxorus and Heatran, use Knock Off and then a super effective move. This removes any counterplay option they may have, including a Choice Scarf or a Custap Berry.</p>"},
      "Life Orb": {
        "description": "<h4>Set Description</h4> <p>Close Combat is for various Fighting-weak Pokemon, such as Choice Band Galarian Darmanitan and non-Chople Berry Tyranitar. Taunt + Bulk Up allows Zeraora to break through walls like Chansey, Registeel, and Galarian Corsola.</p> <h4>EVs</h4> <p>The EV spread allows Zeraora to survive Choice Specs Regieleki's Hyper Beam and non-Life Orb or Choice Band Urshifu-R's Surging Strikes into Aqua Jet.</p> <h4>Usage Tips</h4> <p>Life Orb Zeraora aims to deal as much damage as possible while occasionally removing opposing counterplay with Taunt and Bulk Up.</p> <p>Against passive Pokemon such as Chansey, Registeel, and Galarian Corsola, Zeraora should use Taunt turn 1 for the best chance to win. Zeraora wins against Chansey with the following sequence: Taunt to block Charm or Toxic, then two Bulk Ups, and then Close Combat. To shut down stall Registeel, use Taunt, and then use Bulk Up three times to OHKO it with Close Combat. If Registeel reveals Earthquake, it is Assault Vest Registeel, so a +2 Close Combat will OHKO if Zeraora survives long enough..</p> <p>Versus Regieleki, use Bulk Up and then Close Combat so that Choice Specs-boosted Hyper Beam doesn't KO Zeraora after Life Orb recoil.</p> <h4>Other Options</h4> <p>Weakness Policy Zeraora is a somewhat common Metagross lure, since all other sets are quite unreliable against it. With an EV spread of 8 HP / 176 Atk / 176 Def / 148 Spe, an Adamant nature, and Bulk Up + Knock Off, it defeats all Metagross variants bar Jolly Choice Scarf.</p> <p>Air Balloon Zeraora with Fake Out and Outrage defeats some Ground-types and some strong Pokemon with Ground-type coverage, such as Landorus, Nidoking, Galarian Darmanitan, and Haxorus.</p> <p>Quick Attack or Protect on Life Orb Zeraora allows it to check Custap Berry users like Primarina better.</p> <p>A special Zeraora set can lure in a few answers to Zeraora, but it is usually not advisable. If a team requires it, use Fake Out + Thunderbolt for Avalugg, Grass Knot for Swampert and Rhyperior, and Thunder for Crustle.</p>"
      },
      "Weakness Policy": {},
      "Special Life Orb": {}
    },
    "credits": {"writtenBy": [{"user_id": 518399, "username": "Itchy"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 249890, "username": "zo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}]}
  },
  "Rillaboom": {"sets": {"Life Orb": {}, "Grassy Seed": {}, "Assault Vest": {}, "SubSeed": {}}},
  "Raboot": {"sets": {"Bulky Offense": {}}},
  "Corviknight": {"sets": {"Iron Defense Stall": {}, "Substitute Stall": {}}},
  "Toxtricity": {"sets": {"Life Orb": {}}},
  "Grimmsnarl": {"sets": {"Choice Band": {}, "Bulk Up": {}}},
  "Dracozolt": {"sets": {"Choice Scarf": {}, "Life Orb": {}, "Custap Berry": {}}},
  "Dracovish": {"sets": {"Life Orb": {}, "Custap Berry": {}, "Choice Scarf": {}}},
  "Dragapult": {
    "comments": "<h3>Other Options</h3> <p>Choice Band Dragapult can exchange Dragon Darts for Breaking Swipe, which, paired with an EV spread of 116 Atk / 156 Def / 236 Spe, allows Dragapult to secure the Crustle matchup.  This also makes Dragapult more reliable versus Arcanine, since Dragapult can sometimes survive an Outrage from maximum Attack Arcanine, allowing Dragapult to KO back with Outrage. The Speed investment allows Dragapult to outspeed Adamant Crustle at +2, so it can use Breaking Swipe freely. However, Choice Band Crustle can still win, so be careful.</p> <p>Will-O-Wisp + Hex Dragapult can switch out Weakness Policy for Sitrus Berry to give it more reliability against Avalugg, although this is not often recommended, as this severely weakens the Landorus-T matchup, especially Assault Vest variants. It is also possible to exchange Substitute / Protect or Disable for Draco Meteor or other coverage moves to fit the specific needs of the team.</p> <p>By far the most common variation on Will-O-Wisp + Hex Dragapult uses Dragon Dance + Outrage instead of Disable to catch Zeraora off guard. With an EV spread of 176 HP / 24 Atk / 252 Def / 56 Spe and an Impish nature, Dragapult can survive Jolly Zeraora's Choice Band Outrage and OHKO it with Outrage at +3. The Speed investment allows Dragapult to outspeed Garchomp at +0 and Regieleki at +1.</p> <p>Choice Scarf Dragapult with an EV spread of 252 SpA / 16 SpD / 240 Spe, a Modest nature, Fire Blast, and Draco Meteor lures in checks to other sets such as Choice Scarf Darmanitan and Choice Scarf Haxorus and OHKOes them. However, the limitations of the Choice Scarf without additional boosts make this set lackluster overall.</p>",
    "sets": {
      "Choice Band": {
        "description": "<h4>Set Description</h4> <p>Choice Band Dragapult hits foes hard with Phantom Force and Outrage. Phantom Force beats Spectrier, most Metagross, and most Cresselia. Outrage threatens slower Dragon-types such as Naganadel and non-Choice Scarf Haxorus and Pokemon that can't OHKO Dragapult like Volcanion, Urshifu-R, and Volcarona. Dragon Darts allows Dragapult to bypass Haban Berry users such as Garchomp. Fire Blast beats Kartana and non-Custap Berry Ferrothorn, while U-turn beats Zarude. Clear Body gives Dragapult the edge against Intimidate + Bulldoze Arcanine and Bulldoze Entei, while Infiltrator makes Dragapult reliable versus SubSeed users such as Whimsicott and Venusaur.</p> <h4>EVs</h4> <p>The given EV spread and an Adamant nature allow Dragapult to outspeed Naganadel and give it the best odds to OHKO Metagross and Landorus-T. 4 Special Defense EVs slightly improve Dragapult's odds to survive an Ice Beam from Modest Choice Scarf Porygon-Z. A Jolly nature is better against other Dragapult and some Zeraora.</p> <h4>Usage Tips</h4> <p>Against slower Dragon-types, Dragon Darts is usually the superior move because the first hit activates the foe's Haban Berry, allowing the second hit to be full power. Due to the 2 turn nature of Phantom Force, Endure users with priority moves can slowly chip down Dragapult, most notably Endure + Bullet Punch Metagross and Endure + Grassy Glide Rillaboom. Kee Berry + Moonlight Cresselia also wins, since it can out-heal Phantom Force at +1 Defense.</p>"
      },
      "Will-O-Wisp + Hex": {
        "description": "<h4>Set Description</h4> <p>Will-O-Wisp + Hex Dragapult uses its high Speed and Weakness Policy to beat slower physical attackers. Substitute and Disable allow Dragapult to beat Choice-locked attackers. Additionally, if Dragapult is hit by a super effective move that does not OHKO it, such as Tapu Koko's Dazzling Gleam, it can fire off a 130-Base Power Hex at +2. The versatility of this set is very appealing: with Will-O-Wisp, Substitute, and Disable, Dragapult can win a lot of unexpected matchups such as against Choice Band Urshifu-S, Avalugg, and non-Lum Berry Landorus-T.</p> <h4>EVs</h4> <p>The Speed investment allows Dragapult to outspeed Jolly Choice Scarf Dracovish and Dracozolt so that it can safely use Substitute against them. The HP and Defense investment give Dragapult the best odds to survive burned Choice Band Avalugg's Icicle Spear.</p> <h4>Usage Tips</h4> <p>Against most physical attackers such as Landorus-T, Rhyperior, and Aggron, it is safest to use Will-O-Wisp turn 1. This weakens their attacks and allows Dragapult to break Sturdy or play more confidently around a potential Custap Berry on future turns. Using Substitute after Will-O-Wisp racks up burn damage, putting foes into KO range of a boosted Hex. Additionally, when facing the likes of Choice Specs Naganadel, using Substitute + Disable forces the foe to use Struggle. Disable is also helpful if a Pokemon usually only runs one move to hit Dragapult hard, such as Dazzling Gleam Tapu Bulu.</p>"
      },
      "Curse": {
        "description": "<h4>Set Description</h4> <p>Curse Dragapult has a much better matchup versus bulkier Pokemon because Curse does consistent damage over time and Disable denies recovery. Substitute and Phantom Force buy turns for Dragapult to whittle down foes with Curse. Protect also buys extra turns against moves that can bypass Substitute, such as Rhyperior and Crustle's Rock Blast and Sylveon's Hyper Voice. Additionally, having Substitute or Protect + Disable allows Dragapult to retain its matchup versus many Choice item users. Furthermore, many Pokemon may only have one move that can OHKO Dragapult, which can be Disabled to let Curse damage build up. Clear Body is used to help increase Dragapult's reliability against Bulldoze Entei.</p> <h4>EVs</h4> <p>The Speed investment and a Jolly nature are for outspeeding Choice Scarf Dracovish and Dracozolt, while the rest of the EVs are put into Defense for the best chances against the likes of Choice Band Rock Blast Aggron.</p> <p>An alternative EV spread of 244 HP / 4 Def / 100 SpD / 160 Spe with a Jolly nature can be used as well. The HP EVs make it so that Curse activates Sitrus Berry, so Dragapult can use Substitute five times with Sitrus Berry's recovery. 160 Speed EVs and a boosting nature allow Dragapult to outspeed Spectrier. The Special Defense investment almost always allows Dragapult to survive Choice Specs Magnezone's Flash Cannon after Curse and Sitrus Berry. The final 4 EVs are put into Defense to marginally help with Rock Blast from Aggron or Crustle.</p> <h4>Usage Tips</h4> <p>Curse Dragapult has many unintuitive matchups due in large part to its flexibility and varied lines of play that Substitute, Disable, and Curse afford it.</p> <p>For example, against Magnezone, Dragapult should use Curse turn 1. If Flash Cannon does about 65%, it is Choice Specs Magnezone. Dragapult should then use Disable followed by Phantom Force. Otherwise, Dragapult should use Substitute followed by Phantom Force.</p> <p>Against Entei, it is important to pay attention to its ability. If Entei reveals Pressure, this indicates Pressure stall Entei, which means Dragapult should use Substitute turn 1 followed up by Curse because Pressure stall Entei does not often run moves that can break past its Substitute. However, if no ability is revealed, this indicates Assault Vest Entei, which means that Dragapult should use Curse turn 1 followed by Substitute, Disable, and Phantom Force.</p> <p>Against Aggron, Dragapult should use Substitute turn 1 followed by Disable to force Choice Band Aggron to use Struggle. On turn 3, Dragapult should use Substitute followed by two Phantom Forces, although this makes Aggron not take Struggle recoil during recharge turns.</p> <p>Finally, Curse Dragapult does run into some mind games versus certain Pokemon like Spectrier. Turn 1 is fairly straightforward: Spectrier will reveal Hex or Shadow Ball, and Dragapult should use Substitute. Next, Dragapult can either use Disable to win if the opponent uses Hex again or use Substitute again turn 2 as Spectrier uses Taunt, which will win with Phantom Force. Neither turn 2 play is clearly better.</p>"
      },
      "Choice Specs": {
        "description": "<h4>Set Description</h4> <p>Choice Specs Dragapult uses its good offensive typing, good coverage, and amazing Speed to hit as much of the tier as possible super effectively. Shadow Ball solidifies its otherwise surprisingly shaky matchups versus Psychic-types like Cresselia and non-Assault Vest Metagross. Draco Meteor OHKOes non-Choice Scarf Haxorus, Naganadel, non-Assault Vest Urshifu-R and Urshifu-S, Zarude, and Porygon-Z.  Fire Blast or Flamethrower allow Dragapult to have a super effective move against Steel-types like Ferrothorn and Choice Specs Magnezone. Fire Blast's additional Base Power greatly improves the Tapu Bulu matchup, but Flamethrower can be run for better reliability versus Ferrothorn. Finally, Hydro Pump gives Dragapult the ability to beat Pokemon such as Heatran and some Rhyperior. Infiltrator is the preferred ability in order to be reliable versus SubSeed users such as Whimsicott and Venusaur and helps against Substitute + Protect users such as Entei.</p> <h4>EVs</h4> <p>4 Special Defense EVs help with the Choice Specs Magnezone matchup. A Modest nature is generally preferred, as even with Choice Specs and high Base Power moves, Dragapult's only average Special Attack can lead it to come up short against the likes of Tapu Bulu. However, a Timid nature can be ran to outspeed Choice Scarf Dracozolt and Dracovish as well as Speed tie with other Dragapult.</p> <h4>Usage Tips</h4> <p>Choice Specs Dragapult is fairly straightforward. However, it is important to note that similar to many other Choice item users, Dragapult can be susceptible to Custap Berry users such as Garchomp and Dracovish. Additionally, resistance Berries are a threat to this Dragapult set in particular, notably Haban Berry Dragon-types, as Draco Meteor is often not strong enough to KO them through Haban Berry.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 509647, "username": "Mishlef"}, {"user_id": 518399, "username": "Itchy"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 558869, "username": "Nick"}, {"user_id": 249890, "username": "zo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 467437, "username": "Dawn of Ares"}, {"user_id": 384270, "username": "autumn"}]}]}
  },
  "Urshifu": {
    "comments": "<h3>Other Options</h3> <p>Life Orb Urshifu can be used with a 252 Atk / 4 SpD / 252 Spe EV spread, an Adamant nature, and Wicked Blow / Close Combat / Sucker Punch / Bulk Up to defeat most Rillaboom. Wicked Blow 2HKOes SubSeed Rillaboom, while Wicked Blow + Sucker Punch 2HKOes Life Orb Rillaboom.</p>",
    "sets": {
      "Assault Vest": {
        "description": "<h4>Set Description</h4> <p>Assault Vest Urshifu-S performs amazing feats such as surviving Choice Specs Naganadel's Draco Meteor, letting it counter Pokemon such as Porygon-Z, Regieleki, and Cresselia and gain general reliability versus Pokemon that can adapt to its other movesets, like Spectrier and Dragapult. Superpower is used instead of Close Combat to avoid the Special Defense drop, which would make Urshifu-S lose to Chople Berry Porygon-Z. Stone Edge lets Urshifu-S beat Volcarona and Volcanion. Poison Jab can be used instead to beat most Tapu Bulu sets as well as non-Kebia Berry Whimsicott with Moonblast. Ice Punch could also be considered, as it helps Urshifu-S beat Garchomp consistently.</p> <h4>EVs</h4> <p>128 HP and 116 Special Defense EVs allow Urshifu-S to survive Thunder from Choice Specs Regieleki, Hyper Beam from Modest Choice Scarf Porygon-Z, and Close Combat from Adamant Choice Scarf Haxorus. The rest of the EVs are put into Attack. If surviving Haxorus's Close Combat is not necessary, you may remove all HP investment and run 184 Special Defense EVs for more Attack. This keeps the same matchups against Regieleki and Porygon-Z, but it can only survive Close Combat from Jolly Scarf Haxorus instead.</p> <h4>Usage Tips</h4> <p>Against Substitute + Disable Dragapult and Will-O-Wisp + Disable Spectrier sets, you should use Sucker Punch after an initial Wicked Blow to avoid Wicked Blow being disabled. Besides Dragapult, most matchups involve using the super effective move or Wicked Blow + Sucker Punch.</p>"
      },
      "Bulky Chople Berry": {
        "description": "<h4>Set Description</h4> <p>Bulky Chople Berry Urshifu-S beats Galarian Darmanitan, a Pokemon Urshifu-S normally struggles against, all while gaining new positive matchups with its massive bulk investment. Bulk Up allows Urshifu-S to perform its usual stallbreaking duties, easily dealing with Galarian Corsola, Chansey, Corviknight, and Registeel while granting extra security in matchups versus Pokemon such as Landorus-T and Rhyperior. Counter gives Urshifu-S the option to play defensively as an offensive Pokemon, easily tanking attacks such as Choice Band Pheromosa's High Jump Kick, Adamant Choice Scarf Haxorus's Close Combat even if Unnerve prevents the Berry from being eaten and Assault Vest Arcanine's Play Rough, delivering a devastating Counter afterwards.</p> <h4>EVs</h4> <p>The Defense and HP investment allows Urshifu-S to survive Choice Band Galarian Darmanitan's Giga Impact, with all remaining EVs going into Attack. An alternative spread of 252 Atk / 4 SpD / 252 Spe with a Jolly nature and the moves Wicked Blow / Close Combat / Sucker Punch / Bulk Up can be used instead for a more reliable matchup against opposing Urshifu, Sawk, and non-Choice Scarf Porygon-Z.</p> <h4>Usage Tips</h4> <p>Wicked Blow is an excellent move to use on Pokemon that can't be hit super effectively otherwise, in addition to dealing heavy damage to Sturdy users like Magnezone, Aggron, and Crustle, matchups where using Close Combat could lose. Close Combat should be used on Pokemon that Urshifu-S OHKOes with it, most notably Tyranitar. Sucker Punch is a good way to secure a win against opposing Custap Berry users and can force foes like non-Choice Specs Volcarona into terrifying coinflip scenarios. Bulk Up is used for general stallbreaking and making matchups easier to approach, in particular beating Pokemon that rely on Counter to win, such as Chansey, Rhyperior, and Swampert. Counter can be used instead to more reliably win matchups against Choice Band Pheromosa, Choice Scarf users like Haxorus, Play Rough Arcanine, Dracovish, and Life Orb Rillaboom. It is is worth noting that certain Dragapult sets may be running Substitute + Disable; thus, it is advisable to use Sucker Punch after using Wicked Blow to avoid Wicked Blow being disabled.</p>"
      },
      "Custap Berry": {
        "description": "<h4>Set Description</h4> <p>Custap Berry Urshifu-S's purpose is, generally speaking, a lure set to catch players off guard. Its main allure is turning many unwinnable matchups into coinflips, such as Choice Band Zeraora with Play Rough, Porygon-Z, and Celesteela. While giving up Sucker Punch can be detrimental, the addition of an extremely strong Reversal benefits Urshifu-S greatly, OHKOing many threats at maximum power like Zeraora, Regidrago, Volcanion, most Celesteela, and Garchomp. Endure is an absolute staple on all Custap Berry sets in 1v1 for its ability to guarantee the Berry's activation.</p> <h4>EVs</h4> <p>The Special Defense EVs in conjunction with 168 HP EVs allow Urshifu-S to survive Air Slash from non-Choice Specs Celesteela while the HP lets it survive Choice Scarf Dracovish's Fishious Rend. The Speed investment has Urshifu-S outpace Adamant base 75 Speed Pokemon such as Dracovish and Dracozolt. All extra EVs go into Attack.</p> <h4>Usage Tips</h4> <p>Most of the time, you will want to use Endure on incoming big hits, such as Draco Meteor from Choice Specs Dragapult, Hyper Beam from Porygon-Z, and Superpower or Giga Impact from Galarian Darmanitan. Urshifu-S has a massive advantage in that the only way for foes to prevent the Custap Berry's activation is with priority or their own Endure, since Urshifu-S's ability, Unseen Fist, allows it to bypass all forms of protection. Thus, it breaks through Pokemon such as Life Orb Kartana and Life Orb Dracovish, which carry Protect for other Custap Berry users. Bulk Up secures core matchups such as Assault Vest Swampert, Registeel, Corviknight, Rhyperior, and Steelix, among others. Substitute + Disable Dragapult sets can attempt to neutralize Wicked Blow, which should be countered by using Endure on turn 2.</p>"
      },
      "Choice Band": {
        "description": "<h4>Set Description</h4> <p>Choice Band Urshifu-S hits very hard, being able to defeat many frail Pokemon like Regieleki with a single Sucker Punch. Fling is used in the last moveslot to deal with Disable shenanigans from Dragapult and Spectrier by using Fling + Wicked Blow. Ice Punch can be used to defeat unusually bulky variants of Garchomp.</p> <h4>EVs</h4> <p>Maximum Speed investment is used to outrun base 80 Speed Pokemon at minimum, such as Venusaur and Regidrago. The choice of nature depends on if you need Urshifu-S to either outspeed base 95 Speed Pokemon, most notably non-Choice Scarf Tapu Lele and Choice Band Galarian Darmanitan, or use the raw power to OHKO threats like Landorus-T with Wicked Blow.</p> <h4>Usage Tips</h4> <p>Use the super effective move, or use Wicked Blow on neutral targets like Landorus-T, Volcanion, and Regidrago. For Regieleki, use Sucker Punch to OHKO most variants. Use Fling if your opponent has a Dragapult and you suspect it is a Substitute + Disable variant; Fling may also be used versus Sturdy Pokemon such as Magnezone, Aggron, and Crustle. Choice Band Urshifu-S is a good choice into teams whose main way of dispatching offensive threats is with a bulky wall, such as Registeel or Chansey.</p>"
      },
      "Choice Scarf": {
        "description": "<h4>Set Description</h4> <p>Choice Scarf Urshifu-S outspeeds the entire offensive metagame, excluding opposing Choice Scarf users and Regieleki. This lets it catch certain Pokemon, such as Dragapult, by surprise, smashing it with a very swift Wicked Blow, while Close Combat OHKOes Galarian Darmanitan cleanly. Choice Scarf Urshifu-S has a nice amount of variety in its final two moveslots; as a third move, Fire Punch melts Ferrothorn and Pheromosa, but Fling can be used instead in matchups where not being Choice-locked would be very helpful, such as against Corviknight and Registeel. Fling is best used with Bulk Up in the last moveslot since it retains Urshifu-S's immensely useful ability to break stall Pokemon. In the final moveslot, Ice Punch easily shatters Landorus-T and Garchomp, Stone Edge clobbers Volcarona, and Poison Jab deals with non-Kebia Berry variants of Whimsicott carrying Moonblast.</p> <h4>EVs</h4> <p>EVs are completely maxed out in Attack and Speed in order to hit as hard and fast as possible, with a Jolly nature making matchups such as Pheromosa and Volcarona very favorable.</p> <h4>Usage Tips</h4> <p>Choice Scarf Urshifu does well into teams where the opponent's counter to offensive Pokemon is another offensive Pokemon, most notably taking advantage of people who tend to run Choice Scarf Galarian Darmanitan or Dragapult to fulfill this role. Occasionally, you may need to use Fling versus stall Pokemon like Galarian Corsola, Chansey, Corviknight, and Registeel and use Bulk Up afterward if it's on the set.</p>"
      },
      "Life Orb": {}
    },
    "credits": {"writtenBy": [{"user_id": 249890, "username": "zo"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 518399, "username": "Itchy"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}, {"user_id": 375662, "username": "Isaiah"}]}]}
  },
  "Urshifu-Rapid-Strike": {"sets": {"Iron Defense + Body Press": {}, "Life Orb": {}, "Choice Band": {}, "Assault Vest": {}, "Wacan Berry": {}}},
  "Zarude": {"sets": {"Weakness Policy + Encore": {}, "Weakness Policy + Snarl": {}, "Assault Vest": {}, "Choice Scarf": {}}},
  "Regieleki": {
    "comments": "<h3>Other Options</h3> <p>Running Thunderbolt over Electro Ball is an option, giving Regieleki a reliable Electric-type STAB move that cannot miss. However, this comes at the cost of several significant matchups, like Aromatisse and Registeel, which is generally not worth the slight increase in accuracy in those few matchups where it matters.</p> <p>Regieleki can run a fast specially defensive stall set with a Maranga Berry, Substitute, Eerie Impulse, Rest, and Thunder Cage. This allows it to lure some would-be counters like Sylveon, Nihilego, Goodra, and Mirror Coat Avalugg while retaining solid matchups against most other special attackers. However, this set loses to many physical attackers, and the bulk requirements mean that several Choice Scarf users can now outspeed Regieleki.</p>",
    "sets": {
      "Choice Specs": {
        "description": "<h4>Set Description</h4> <p>Regieleki's amazing Speed stat and powerful Electric-type moves give it an unique niche in the metagame. Thunder Cage is its main STAB move, dealing solid damage and beating Endure users like Primarina, Blaziken, and Porygon-Z. Thunder deals more damage, which matters against Pokemon like Spectrier. Hyper Beam deals with some frail Pokemon that resist Electric, like Naganadel, Haxorus, and opposing Regieleki. Electro Ball covers for a few slow Pokemon like Registeel and specially defensive Aromatisse.</p> <h4>EVs</h4> <p>252 SpA EVs let Regieleki maximize its damage output, while 252 Speed EVs let it tie opposing Regieleki and maximize Electro Ball damage. The remaining EVs are put in Defense, as most priority moves and the few Choice Scarf users that outspeed Regieleki skew physically.</p> <h4>Usage Tips</h4> <p>Regieleki's matchups are simple: figure out what move can OHKO and use it. Against potential Endure users like Primarina and Galarian Moltres, Regieleki should use Thunder Cage to KO them with trapping damage if they use Endure. In situations where Thunder Cage deals sufficient damage to KO, it should be used over Thunder, as it has a smaller risk to miss.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 501918, "username": "Here Comes Team Charm!"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 442711, "username": "Mubs"}, {"user_id": 520168, "username": "Murm"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}]}]}
  },
  "Regidrago": {
    "comments": "<h3>Other Options</h3> <p>Regidrago can run a Weakness Policy set for slow Ice-types like Glastrier and Avalugg, which other Regidrago sets cannot reliably defeat. This set runs an EV spread of 12 HP / 132 Atk / 204 Def / 48 SpD / 112 Spe with the Impish nature and the moves Breaking Swipe, Outrage, Draco Meteor, and Dragon Dance or Scale Shot. The physical bulk allows Regidrago to survive a Choice Band Avalugg's Avalanche and KO it back with Draco Meteor. This set also beats non-Choice Band Glastrier by using Breaking Swipe, surviving any follow-up attack, then finishing it off with a +2 Outrage. The Special Defense and Speed EVs allow Regidrago to survive Nihilego's Meteor Beam and outspeed it at +1. With these EVs, Regidrago also outspeeds other Pokemon like Entei and Zapdos after Scale Shot. Running Dragon Dance on this set helps with the Chansey matchup, but Scale Shot helps more versus a greater variety of Pokemon.</p>",
    "sets": {
      "Haban Berry": {
        "description": "<h4>Set Description</h4> <p>Scale Shot is used to outspeed foes and then deal immense damage to them the following turn with Outrage or Drago Meteor. It also breaks potential Substitutes and gives a +1 Speed boost, letting Regidrago outspeed Pokemon like Entei, Zapdos, and Volcarona. Outrage OHKOes many Dragon-types such as Naganadel and Dragapult after surviving their attacks with Haban Berry. Breaking Swipe + Draco Meteor improves the Avalugg matchup, as at -1 Attack, Regidrago survives an Icicle Spear and has favorable odds to tank an Avalanche. Then, Regidrago KOes back with Draco Meteor due to Avalugg's bad Special Defense.</p> <h4>EVs</h4> <p>With 96 Speed EVs and a Speed boost from Scale Shot, Regidrago outspeeds base 100 Speed Pokemon like Entei and the Zapdos formes. The Defense investment alongside Haban Berry allows Regidrago to tank a Dragon Darts from Choice Band Dragapult, and the Special Defense investment allows Regidrago to survive Draco Meteor from Modest Choice Specs Naganadel.</p> <p>An alternative EV spread of 88 HP / 252 Def / 24 SpA / 144 SpD with a Bold nature can be run to beat Choice Band Zeraora. It does not have the Speed investment that the main spread has, though, so it won't outspeed base 100 Speed Pokemon after Scale Shot. This set should run Dragon Energy over Draco Meteor to deal more consistent damage to Rhyperior, Volcanion, and Swampert while also retaining some stallbreaking capabilities.</p> <h4>Usage Tips</h4> <p>Scale Shot should be used turn 1 versus faster stall Pokemon, especially Entei and Zapdos, since +1 Regidrago outspeeds and 2HKOes them with Outrage.</p> <p>Breaking Swipe should be used to reduce Avalugg's or Crustle's Attack and break their Sturdy ability; Regidrago survives their attacks at -1 and KOes either with Draco Meteor afterwards.</p>"
      },
      "Assault Vest": {
        "description": "<h4>Set Description</h4> <p>Draco Meteor is usually used on turn 1, followed by Outrage on turn 2, since it does more damage than a -2 Draco Meteor. Dragon Energy deals more damage to targets like Volcanion and Rhyperior. Scale Shot helps Regidrago outspeed foes like SubSeed Rillaboom, breaking potential Substitutes as well. Assault Vest helps Regidrago secure matchups that it would lose otherwise, including Choice Specs Porygon-Z and Choice Specs Kyurem.</p> <h4>EVs</h4> <p>8 Speed EVs allow Regidrago to outspeed base 85 Speed Pokemon such as Cresselia and Rillaboom after a Scale Shot. With the bulk investment, Regidrago survives two Wicked Blows from maximum Attack Urshifu-S without an Attack-boosting nature and a Hyper Beam from Choice Specs Porygon-Z.</p> <p>An alternate EV spread of 12 HP / 204 Def / 8 SpA / 248 SpD / 36 Spe with a Bold nature and Breaking Swipe over Outrage secures the Choice Band Avalugg matchup. The Speed is for outspeeding Porygon-Z after a Scale Shot, and the Special Defense allows Regidrago to survive Nihilego's Acid Spray into Meteor Beam.</p> <h4>Usage Tips</h4> <p>Against Substitute users and base 85 Speed Pokemon, use Scale Shot first and follow up with one of your stronger STAB attacks.</p> <p>When versus Porygon-Z, use Draco Meteor on turn 1 because it almost always KOes. If Porygon-Z survives, then Outrage can be used on turn 2 while Porygon-Z recharges after Hyper Beam. If using the alternate spread, Scale Shot should be used turn 1 versus Porygon-Z because it has less Special Attack investment, though this is a losing sequence if Porygon-Z uses Trick because Scale Shot does not reliably 2HKO.</p> <p>Another matchup where Regidrago should use Draco Meteor on turn 1 is Urshifu-S; it should OHKO all variants except for Assault Vest, which can be dealt with by using Outrage on turn 2.</p>"
      },
      "Custap Berry": {
        "description": "<h4>Set Description</h4> <p>Regidrago aims to gain surprise wins versus Pokemon such as Galarian Darmanitan that would otherwise KO it using Endure and a Custap Berry. Draco Meteor deals consistent damage to most targets like Zeraora, Galarian Darmanitan, and Dragapult after Regidrago is in Custap Berry range. Scale Shot is used to shut down some stall Pokemon like SubSeed Rillaboom, Breaking Swipe helps in the Zeraora matchup, and Outrage helps versus most Tyranitar and non-Kee Berry Volcarona. Dragon Energy hits slower foes like Volcanion and Rhyperior for heavy damage.</p> <h4>EVs</h4> <p>The Defense investment lets Regidrago survive an Avalanche from Choice Band Aggron and gives it good chances to avoid the 2HKO from Urshifu-S's unboosted Wicked Blow, while the Special Attack investment alongside a Modest nature allows Regidrago to always 2HKO most Assault Vest Urshifu sets with Draco Meteor.</p> <h4>Usage Tips</h4> <p>Use Endure versus Pokemon that threaten to OHKO Regidrago, such as Galarian Darmanitan, Naganadel, Dragapult, and Haxorus. Some of these threats have some counterplay; Dragapult can run Substitute, Life Orb Naganadel can run Protect, and Haxorus can nullify Regidrago's Custap Berry with Unnerve.</p> <p>If running Breaking Swipe, it should be used against Zeraora turn 1 to reduce its Attack. Use Outrage against Tyranitar because it does more damage than Regidrago's other moves. When low on HP, Draco Meteor or Outrage should always be used over Dragon Energy.</p>"
      },
      "Choice Band": {
        "description": "<h4>Set Description</h4> <p>This set aims to lure Steel-types that normally beat Regidrago while retaining many of its core matchups. Outrage deals heavy neutral or super effective damage to foes. Scale Shot bypasses Substitutes and lets Regidrago outspeed base 100 Speed Pokemon like Zapdos. Regidrago uses Fire Fang to OHKO Kartana and 2HKO Ferrothorn and Magnezone and Crunch to 2HKO Metagross.</p> <h4>EVs</h4> <p>The Defense and HP investment allows Regidrago to survive two unboosted Meteor Mashes from Metagross so it can use Crunch to 2HKO. 96 Speed EVs allow Regidrago to outspeed neutral-natured Magnezone and 2HKO with Fire Fang, while the Special Defense investment allows Regidrago to survive two Flash Cannons from it. The remaining EVs go into Attack for maximizing damage output into various targets, most notably Celesteela.</p> <h4>Usage Tips</h4> <p>Using this Regidrago set is rather straightforward, as Outrage will usually be used or the respective coverage move for Steel-type Pokemon.</p> <p>However, Regidrago should use Scale Shot to outspeed certain base 100 Speed Pokemon and below, like Entei and SubSeed Rillaboom, breaking their Substitute while dealing damage.</p>"
      }
    },
    "credits": {"writtenBy": [], "teams": [{"name": "Quality checked by", "members": [{"user_id": 518399, "username": "Itchy"}, {"user_id": 430787, "username": "PA"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}]}]}
  },
  "Glastrier": {"sets": {"Assault Vest": {}, "Custap Berry": {}, "Choice Band": {}, "Life Orb": {}}},
  "Spectrier": {
    "comments": "<h3>Other Options</h3> <p>Sitrus Berry + Taunt can run an alternative spread of 240 HP / 232 Def / 4 SpA / 32 Spe with a Timid nature and the moves Will-O-Wisp / Hex / Taunt / Calm Mind or Haze to reliably beat Galarian Darmanitan, Garchomp, and Rillaboom, surviving 2 Grassy Glide and a Knock Off from a burned +2 Rillaboom while outrunning Jolly Garchomp. Calm Mind is a generally better move, while Haze reliably beats Rillaboom.</p>",
    "sets": {
      "Sitrus Berry + Taunt": {
        "description": "<h4>Set Description</h4> <p>Spectrier has an excellent niche in 1v1 as a setup Pokemon that can easily beat other setup Pokemon using Will-O-Wisp, Calm Mind, and Taunt. Spectrier's usage as a very potent two-turn nuke is applicable, being able to deal with Pokemon such as Aggron, Magnezone, and Naganadel. With Calm Mind and Will-O-Wisp, Spectrier can easily deal with Pokemon that rely on one type of attack, burning physical attackers like Galarian Darmanitan, Haxorus, and Aggron while boosting its Special Defense in front of special attackers like Landorus. Taunt is used to shut down stall Pokemon such as Registeel, Chansey, and Cresselia. Hex pairs very well with Will-O-Wisp thanks to burn doubling Hex's Base Power, but Shadow Ball provides consistent damage versus Pokemon immune to burn, like Heatran, Volcanion, and Misty Surge Tapu Fini. Shadow Ball is also more consistent because it does not rely on Will-O-Wisp, since it is inaccurate and is shut down by Trick users like Choice Scarf Tapu Fini and Choice Scarf Togekiss.</p> <h4>EVs</h4> <p>184 HP EVs combines with 24 Special Defense EVs for Spectrier to survive two Earth Powers from Timid Choice Specs Landorus after a Calm Mind boost, and 52 Defense EVs allow it to survive two Outrage from Jolly Choice Band Garchomp. 184 Speed EVs allow Spectrier to outrun Timid Naganadel. All remaining EVs go into Special Attack for better damage rolls against Galarian Darmanitan and Haxorus.</p> <h4>Usage Tips</h4> <p>Spectrier's most basic sequence is Will-O-Wisp turn 1 into Hex turn 2. However, sometimes Will-O-Wisp is just too risky, such as when facing Nasty Plot Life Orb Naganadel. Aside from move choice, Spectrier is very straightforward to use. Thanks to its excellent natural special bulk, it often doesn't need to use Calm Mind in front of other special attackers. Exceptions include using Calm Mind when facing opposing setup, such as Calm Mind Tapu Fini, and using Calm Mind to make matchups against Magnezone and Naganadel more reliable. Taunt defeats stall Cresselia by denying its Moonlight recovery and Calm Mind boosts while shutting down Chansey and Registeel hard, since they can't hit Spectrier with their attacks. Versus Chansey, use Taunt and then Will-O-Wisp so that burn damage will eventually KO it.</p>"
      },
      "Sitrus Berry + Disable": {
        "description": "<h4>Set Description</h4> <p>Disable Spectrier matches up superbly against Choice item users and forgoes the nuclear power of a turn 2 Hex for consistency versus hard-hitting Pokemon like Choice Specs Sylveon, Haxorus, Landorus-T, and Tapu Lele. Disable is incredible in its ability to instantaneously win games if it faces a Choice-locked Pokemon, like Choice Band Landorus-T or Choice Specs Sylveon. The choice between Will-O-Wisp and Substitute depends on how much reliability is needed beating physical attackers with multi-hit moves such as Rhyperior and Crustle, as well as opposing Choice Scarf users like Haxorus, versus how much reliability is needed against  Choice-locked Pokemon that don't run multi-hit moves such as Choice Specs Tapu Lele and Pokemon that rely on stat debuffs from Acid Spray to win like Goodra and Nihilego.</p> <h4>EVs</h4> <p>240 HP EVs with 16 Special Defense EVs allow Spectrier to survive a Hyper Beam from Choice Specs Sylveon, in addition to giving as much physical bulk as possible for opposing Struggle. Maximum Speed with a Timid nature is used to Speed tie with opposing maximum Speed Spectrier.</p> <h4>Usage Tips</h4> <p>Will-O-Wisp should be used in conjunction with Disable to beat opposing Choice-locked physical attackers, like Haxorus, Rhyperior, Avalugg, and Choice Band Dracovish. Substitute is also useful alongside Disable to defeat Choice Band users not running multi-hit moves, as well as some Trick users like Choice Scarf Metagross.</p>"
      },
      "Choice Specs": {
        "description": "<h4>Set Description</h4> <p>Choice Specs Spectrier, also called \"Specstrier\", is a simple set. High Special Attack and solid neutral coverage allow it to mow through many Pokemon. Uproar defeats Whimsicott, Mud Shot destroys Heatran and Nihilego, and Hyper Beam obliterates most Rillaboom and Urshifu-R.</p> <h4>EVs</h4> <p>120 HP EVs allows Spectrier to survive a Life Orb Grassy Glide from Rillaboom, while the Special Defense EVs grant it the ability to survive Nihilego's Meteor Beam. 132 Speed EVs outruns base 100 Pokemon like Entei and Galarian Zapdos.</p> <h4>Usage Tips</h4> <p>Use the super effective move. Uproar in particular helps versus Whimsicott, while Mud Shot beats Nihilego and Heatran lacking Choice Scarf. Hyper Beam OHKOes several neutral targets where Shadow Ball may not be enough, like most Urshifu-R, Rillaboom, and Volcanion. Choosing between using Shadow Ball or Hyper Beam is a matter of whether Spectrier needs to avoid the recharge turn or not. Generally, Choice Specs Spectrier does well against teams that use Pokemon with low Special Defense to defeat Spectrier, like most Rillaboom and frail Urshifu variants.</p>"
      },
      "Weakness Policy": {
        "description": "<h4>Set Description</h4> <p>Spectrier's weakness to Zeraora is patched up quite nicely with its Weakness Policy set. Calm Mind can be used to offer more reliability versus hard-hitting special attackers such as Magnezone, but Disable provides the opportunity to win matchups against slower Choice Band users, like Galarian Darmanitan and Dracovish, that may not get OHKOed by a double damage Hex. Mud Shot deals solid damage after a +2 boost, 2HKOing even Assault Vest Zeraora while also dealing with all Heatran sets except Air Balloon, which loses to Hex into Mud Shot instead. Weakness Policy is also handy versus common Knock Off users, like Assault Vest Landorus-T and Choice Scarf Sawk.</p> <h4>EVs</h4> <p>The HP and Defense EVs let Spectrier survive a Knock Off from Choice Band Zeraora, while the Speed EVs let it outpace Jolly Kartana. All remaining EVs go into Special Attack for better damage rolls against Galarian Darmanitan.</p> <h4>Usage Tips</h4> <p>Weakness Policy's activation lets Spectrier easily turn the tables on a would-be counter in Zeraora. Defeating Zeraora is as simple as using Mud Shot twice. Outside of this, however, the main gameplan is to use Will-O-Wisp turn 1 so that Hex turn 2 deals double damage, which reliably defeats numerous physical attackers, such as Metagross, Kartana, Urshifu-R, and Rhyperior. If running Calm Mind, it should be used against threats such as Kyurem and Volcanion, which threaten to deal massive damage with their STAB attacks; otherwise, if using Disable, utilize it to shut down opposing Choice-locked foes.</p>"
      },
      "Life Orb": {}
    },
    "credits": {"writtenBy": [{"user_id": 249890, "username": "zo"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 518399, "username": "Itchy"}]}, {"name": "Grammar checked by", "members": [{"user_id": 467437, "username": "Dawn of Ares"}, {"user_id": 384270, "username": "autumn"}]}]}
  }
}