{
  "Alakazam": {"sets": [{"name": "Psychic Surge"}]},
  "Slowbro": {"sets": [{"name": "Defensive"}]},
  "Chansey": {"sets": [{"name": "Defensive"}]},
  "Zapdos": {"sets": [{"name": "Utility"}, {"name": "Offensive"}]},
  "Zapdos-Galar": {"sets": [{"name": "Magic Guard"}, {"name": "Choiced Attacker"}]},
  "Moltres": {"sets": [{"name": "Magic Guard"}, {"name": "Desolate Land"}]},
  "Mew": {"sets": [{"name": "Physically Defensive"}, {"name": "Cosmic Power"}]},
  "Heracross": {"sets": [{"name": "Choice Band"}]},
  "Skarmory": {"sets": [{"name": "Defensive"}]},
  "Blissey": {"sets": [{"name": "Defensive"}]},
  "Tyranitar": {"sets": [{"name": "Specially Defensive"}]},
  "Swampert": {"sets": [{"name": "Physically Defensive"}, {"name": "Specially Defensive"}]},
  "Milotic": {"sets": [{"name": "Assault Vest"}]},
  "Latios": {"sets": [{"name": "Calm Mind"}, {"name": "Choice Specs"}]},
  "Jirachi": {"sets": [{"name": "Assault Vest"}, {"name": "Magic Guard"}]},
  "Garchomp": {"sets": [{"name": "Swords Dance"}, {"name": "Choice Scarf"}]},
  "Lucario": {"sets": [{"name": "Magic Guard"}]},
  "Hippowdon": {"sets": [{"name": "Defensive"}]},
  "Togekiss": {"sets": [{"name": "Triage"}]},
  "Mamoswine": {"sets": [{"name": "Adaptability"}]},
  "Azelf": {
    "comments": "<h1>Other Options</h1> <p>Psyshock can be used to deal more damage to Assault Vest Swampert, Chansey, and Blissey. Azelf's coverage moves besides Fire Blast are generally not worth using.</p> <h1>Checks and Counters</h1> <p><strong>Chansey and Blissey: Azelf, like many other Pokemon, has trouble breaking Chansey and Blissey, as Expanding Force is a 4HKO on both of them. Psyshock can be used to improve this matchup, but it still doesn't 2HKO. This means that Azelf has to rely on Knock Off or Trick to remove their items and pivoting via U-turn to slowly weaken the two.</p> <p><strong>Zarude</strong>: Zarude is one of the most common Dark-types in the tier, meaning that it can switch in on a Expanding Force and then get a free turn. This creates a coinflip situation on whether your opponent will switch to it every time you bring out Azelf. Further, it has priority that can OHKO Azelf, which won't be able to change moves anyway.</p> <p><strong>Genesect and Heatran</strong>: Similarly to Zarude, both Genesect and Heatran take Azelf's Expanding Forces well This gives them free turns to set up or get powerful attacks off, respectively, forcing Azelf to pivot and predict well. Fire Blast greatly improves this matchup, dealing very good damage to both of them.</p> <p><strong>Terrain Users</strong>: Users of Grassy or Electric Terrain are problems for Azelf, as taking away its Psychic Terrain just about halves Azelf's damage output.</p> ",
    "sets": [
      {
        "name": "Psychic Surge",
        "description": "<p>Azelf has a unique role in AAA as a fast Expanding Force user with both pivoting in U-turn and utility moves such as Trick and Knock Off, which help punish defensive switch-ins like Corviknight and Blissey. Azelf is one of the fastest Pokemon in the tier, which, paired with the probability it pivots with U-turn, is very dangerous in a momentum-reliant tier like AAA. Equipped with a Choice Scarf, Azelf is able to outspeed Adamant Unburden-boosted Kommo-o, as well as outspeeding naturally fast Pokemon such as Tapu Koko, Talonflame and Barraskewda. This makes it a very reliable revenge killer, but Choice Specs is another option to better Azelf as a fast special wallbreaker. Azelf's ability Psychic Surge makes it a blanket check to many Triage and standard priority users, particularly Togekiss and Tapu Bulu. A Hasty nature takes advantage of Azelf's great speed Speed tier without sacrificing damage from U-turn or Knock Off.</p> <p>Azelf can fit on most teams because of its ability to check Triage and standard priority users while still being an offensive threat. Its less-than-ideal bulk means it appreciates slow pivots from a Pokemon like Swampert or Corviknight to get in safely. Azelf is vulnerable to entry hazards and being slowly worn down, as it lacks recovery as well. It's also weak to Pokemon that can double switch into Expanding Force and force a switch by threatening a KO back, such as Heatran. This, coupled with its tendency to force in special walls, means it pairs very well with Fighting-types such as Terrakion and Kommo-o, which can threaten the Steel- and Dark-types Azelf struggles to break through.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 375662, "username": "Think"}, {"user_id": 523866, "username": "UT"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 525446, "username": "DuckeryDoodle"}]}
  },
  "Heatran": {"sets": [{"name": "Desolate Land"}, {"name": "Mold Breaker"}]},
  "Excadrill": {"sets": [{"name": "Water Absorb"}]},
  "Conkeldurr": {"sets": [{"name": "Triage"}, {"name": "Choice Band"}]},
  "Ferrothorn": {"sets": [{"name": "Utility"}]},
  "Bisharp": {"sets": [{"name": "Swords Dance"}]},
  "Mandibuzz": {"sets": [{"name": "Defensive"}]},
  "Hydreigon": {"sets": [{"name": "Choice Scarf"}]},
  "Volcarona": {"sets": [{"name": "Quiver Dance"}]},
  "Cobalion": {"sets": [{"name": "Regenerator"}, {"name": "Magic Guard"}]},
  "Terrakion": {"sets": [{"name": "Choice Band"}]},
  "Thundurus": {"sets": [{"name": "Magic Guard"}]},
  "Landorus": {"sets": [{"name": "Sheer Force"}]},
  "Landorus-Therian": {"sets": [{"name": "Regenerator"}, {"name": "Regenerator"}]},
  "Genesect": {"sets": [{"name": "Choice Scarf"}, {"name": "Sheer Force"}]},
  "Talonflame": {
    "comments": "<h1>Other Options</h1> <p>Talonflame's movepool is shallow, but there are a few other options. U-turn can be run over Swords Dance, or more rarely Flare Blitz, to generate momentum even against teams that have solid answers to it, which is always valuable. Talonflame can also conceivably drop Flare Blitz for Will-O-Wisp to cripple some of its switch-ins like Swampert, but the increased coverage is usually preferred.</p> <h1>Checks and Counters</h1> <p><strong>Primordial Sea Electric-types: Primordial Sea Zapdos and Tapu Koko both have the bulk and typing to switch into Talonflame and force it out with their Electric-type attacks. They also have pivoting and reliable recovery to consistently annoy Talonflame over the course of the match.</p> <p><strong>Flash Fire Corviknight: Talonflame can't hit Corviknight neutrally, and Corviknight can do more than 50% to Talonflame with Brave Bird or use U-turn to bring in a faster threat safely.</p> <p><strong>Unaware</strong>: Unaware Mandibuzz and Mew comfortably avoid being 2HKOed and ignore Swords Dance boosts. However, in a longer game, Talonflame can feasibly stall them out of recovery PP, especially if they lack the ability to punish Talonflame themselves with Foul Play or Thunder Wave.</p> <p><strong>Prankster Toxapex: Similarly to the Unaware checks above, Toxapex can prevent Talonflame from sweeping as long as it has PP for Recover; additionally, it can remove Talonflame’s Life Orb with Knock Off, which reduces its power considerably. It can also be stalled out of recovery in a longer game, however.</p> <p><strong>Tapu Fini</strong>: Tapu Fini is already found on many teams and can help check Talonflame, but it cannot beat Talonflame by itself. It will lose if it switches into a Brave Bird or Swords Dance, as it is 3HKOed by unboosted Brave Bird and cannot OHKO back with Scald.</p> ",
    "sets": [
      {
        "name": "Magic Guard Attacker",
        "description": "<p>Talonflame has found a welcoming home in Generation 8 Almost Any Ability, being an attacker with good power and coverage that is hard to wear down. In a metagame that has few viable Rock-types, Talonflame's STAB moves provide fantastic coverage, with the only common resistant foes being Primordial Sea Zapdos or Tapu Koko and Flash Fire Corviknight. Thanks to its high Base Power moves and Life Orb, which have their recoil negated by Magic Guard, Talonflame hits surprisingly hard despite having a low Attack stat. For reference, fully physically defensive Swampert cannot safely switch into Talonflame if it is below 80% health, as it risks getting 2HKOed by Brave Bird. Talonflame possesses a great Speed tier for AAA, leaving it only outspeed by Barraskewda, Tapu Koko, and the rare Zamazenta-C. Additionally, it resists every common Triage move and Grassy Glide, making it difficult to revenge kill with priority. Swords Dance amplifies Talonflame's offensive presence, and it can often find time to set up safely against either offensive threats it forces out, like Volcarona and Zarude, or defensive stalwarts that are unable to KO it back like Corviknight and most Mew. Its power, access to setup, and longevity make it particularly effective at breaking down bulkier teams. Talonflame does really need to run maximum Attack and Speed with Jolly to maximize its offensive capabilities.</p> <p>Talonflame fits well on bulky offense or balance teams that want offensive pressure without having to provide much support. Since it is immune to all entry hazards, Talonflame doesn't require hazard control, and Magic Guard means it can't be worn down by stray Toxics or Rocky Helmets (although it does fear paralysis). Since its bulk is not fantastic, it does appreciate slow pivots like Swampert and Corviknight to bring it in safely; in exchange, it forces out foes like Cinderace or Volcarona that may have tried to come in on them. There are some common switch-ins that frustrate Talonflame, however; Primordial Sea Zapdos in particular can't be hit neutrally and forces it out, so teammates that can handle Zapdos like RegenVest Swampert, Blissey, and Silvally-Dragon are always appreciated. Additionally, while Talonflame is fast, most Choice Scarf users Choice Scarf users and a few faster threats—Tapu Koko and Barraskewda—can revenge kill it reliably. Good revenge killers or solid switch-ins to those are strongly advised; Choice Scarf Azelf is especially notable as a great revenge killer that lets Talonflame in often with U-turn.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 375662, "username": "Think"}, {"user_id": 450411, "username": "Atha"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 523866, "username": "UT"}]}
  },
  "Volcanion": {"sets": [{"name": "Choice Specs"}]},
  "Incineroar": {"sets": [{"name": "Assault Vest"}]},
  "Toxapex": {"sets": [{"name": "Prankster"}]},
  "Golisopod": {"sets": [{"name": "Triage"}]},
  "Silvally-Dragon": {"sets": [{"name": "Assault Vest"}]},
  "Dhelmise": {"sets": [{"name": "Grassy Surge"}, {"name": "Grassy Surge"}]},
  "Kommo-o": {"sets": [{"name": "Triage"}, {"name": "Galvanize"}, {"name": "Unburden Sweeper"}]},
  "Tapu Koko": {"sets": [{"name": "Magic Guard"}, {"name": "Primordial Sea"}, {"name": "Screen Setter"}]},
  "Tapu Lele": {"sets": [{"name": "Sheer Force"}, {"name": "Triage"}]},
  "Tapu Bulu": {"sets": [{"name": "Triage"}]},
  "Tapu Fini": {
    "comments": "<h1>Other Options</h1> <p>Dauntless Shield is an option instead of Regenerator in order to add to Tapu Fini's bulk, but it comes at the cost of lacking reliable recovery outside of Leftovers. Ice Beam can be slotted in over any of the slashed moves, but outside of dealing high damage to Landorus-T and Garchomp it has limited usefulness.</p> <h1>Checks and Counters</h1> <p><strong>Ability-changing Moves: Carriers of moves like Skill Swap, Gastro Acid, and Worry Seed that change or suppress opposing Pokemon's abilities such as Blissey, Chansey, Mew, Toxapex, and Ferrothron can threaten to remove Tapu Fini's passive recovery from Regenerator entirely. That being said, all of them have to be wary of being crippled by Knock Off.</p> <p><strong>Desolate Land Fire-types: Desolate Land users such as Moltres and Heatran are immune to Scald and can carry Solar Beam to easily 2HKO Tapu Fini. Heatran gets a special mention because it doesn't mind its item being removed by Tapu Fini in exchange for being able to trap and KO with Magma Storm. Volcarona use can Quiver Dance repeatedly in the face of Tapu Fini, and offensive variants can 2HKO even with unboosted Solar Beam or Giga Drain.</p> ",
    "sets": [
      {
        "name": "Regenerator Pivot",
        "description": "<p>Tapu Fini's access to utility moves such as Defog, Haze, and Knock Off allows it to excel as a defensive pivot to a wide array of attackers. The combination of Moonblast and Knock off in particular enables Tapu Fini to cripple Heavy Duty Boots and Assault Vest users while retaining a strong Fairy-type STAB move. A Water / Fairy typing with 70/ 115 / 130 bulk also allows Tapu Fini to serve as a blanket check to prominent physical attackers like Garchomp, Barraskewda, and Terrakion; the use of Rocky Helmet serves as a means for Tapu Fini to switch in and passively limit the amount of times they can attack successfully. Leftovers allows Tapu Fini to slightly increase its passive recovery so that it doesn't have to switch immediately versus opposing attackers. Maximum HP and Defense EVs with a Bold nature mean that Tapu Fini can maximize its physical bulk as much as possible. Tapu Fini also serves as one of the most effective counters to Barraskewda, as it can easily restore chip damage from Flip Turn with Regenerator while punishing Barrskewda with Rocky Helmet. Because common Stealth Rock users such as Swampert and Garchomp don't tend to carry moves that are immediately threatening to Tapu Fini, it's able to Defog Stealth Rock away consistently with the option of also removing potential Swords Dance boosts or threatening to burn with Scald. Tapu Fini also retains the ability to check setup sweepers in general: Quiver Dance Volcarona for example can be dealt with to an extent by resetting its stat changes with Haze, but Tapu Fini is not the most reliable long-term answer to them. Knock Off can also be used to potentially remove useful items like Leftovers and Rocky Helmet from Pokemon that rely on them, making Tapu Fini a very versatile utility user.</p> <p>Tapu Fini fits onto virtually any type of team; it can work on balance, offense, and even stall. Magic Bounce Blissey gets a special mention because it pairs with Tapu Fini notably well by preventing entry hazards and checking special attackers that would otherwise give Tapu Fini trouble like Tapu Koko and Heatran. Ground-types such as Swampert and Garchomp enjoy having Tapu Fini as a teammate because they cover for its weakness to Electric-type attacks and can make progress by going for Stealth Rock. Tapu Fini also largely benefits from teammates like Mandibuzz, Zapdos, and Moltres that can patch up its weakness to Grass-type attacks from common users such Volcarona, Tapu Bulu, and Zarude. It's also worth noting that despite being a Water-type, Tapu Fini struggles versus especially powerful Fire-type attacks from Pokemon like Choice Specs Volcanion and offensive Heatran, so Flash Fire and Primordial Sea users like Corviknight and Zapdos can alleviate the pressure for it.</p> "
      },
      {"name": "Choice Scarf"}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 475804, "username": "The Number Man"}, {"user_id": 523866, "username": "UT"}]}, {"name": "Grammar checked by", "members": [{"user_id": 241023, "username": "Kris"}]}], "writtenBy": [{"user_id": 375662, "username": "Think"}]}
  },
  "Nihilego": {"sets": [{"name": "Regenerator"}, {"name": "Unburden Sweeper"}]},
  "Cinderace": {"sets": [{"name": "Choice Band"}, {"name": "Magic Guard"}]},
  "Corviknight": {"sets": [{"name": "Defensive"}]},
  "Barraskewda": {
    "comments": "<h1>Other Options</h1> <p>Choice Scarf can be used to make Adamant Barraskewda faster than the entire unboosted metagame. However, using Choice Scarf instead of Choice Band severely limits Barraskewda's potential to KO, as it already outspeeds a majority of the format.</p> <p>Psychic Fangs is another coverage option, but its uses are limited to only hitting Toxapex. However, it only has a small chance to 2HKO, and Prankster Recover immediately heals any significant damage.</p> <p>Magic Guard + Life Orb sets, while significantly weaker, help solve Barraskewda's biggest issue of longevity by bypassing hazards and Rocky Helmet. It offers much less breaking power, but better sustainability if that is what your team needs.</p> <h1>Checks and Counters</h1> <p><strong>Toxapex: Toxapex is Barraskewda's worst nightmare, sporting sky-high physical bulk and a resistance to Water moves. Its chance to burn with Scald and access to Prankster healing and status-inducing moves mean it will usually come out on top.</p> <p><strong>Water-immune Pokemon</strong>: Desolate Land and abilities that grant Water immunity are able to completely sap Barraskewda's momentum.</p> <p><strong>Bulky Water-type Checks</strong>: Pokemon that resist Water and aren't weak to Barraskewda's coverage options, such as Tapu Fini, are almost always free to switch in and heal the damage done.</p> <p><strong>Rocky Helmet Users: One of Barraskewda's largest weaknesses is residual damage, and Rocky Helmet users such as Mew, Tapu Fini, Swampert, and Corviknight are able to punish Barraskewda for using Flip Turn. This damage racks up over the course of the game, making Barraskewda less of a threat.</p> ",
    "sets": [
      {
        "name": "Choice Band",
        "description": "<p>Barraskewda is a strong offensive pivot, revenge killer, and late-game cleaner with powerful rain-boosted STAB moves and an incredible Speed tier. Flip Turn is an especially deadly move as Barraskewda can pivot out while massively damaging non-Water-immune checks like Swampert. Barraskewda's other strong STAB moves in Liquidation and Aqua Jet mean that the opponent has to keep their Water-resistant Pokemon healthy so that their team isn't completely overwhelmed. Barraskewda's coverage moves are mostly used as insurance against Water Absorb users like Excadrill and Desolate Land users such as Heatran. Close Combat is the best coverage option due to its high Base Power and ability to hit Heatran and Ferrothorn hard. Drill Run is another option to hit Toxapex and bulky Heatran harder.</p> <p>Barraskewda is often paired with special powerhouses like Sheer Force Tapu Lele, Psychic Surge Azelf, and specially offensive Genesect, which succeed versus Pokemon that check Barraskewda like Tapu Fini and Corviknight. The combination of their special prowess and Barraskewda's pivoting leads to deadly offensive cores. Barraskewda commonly finds itself on VoltTurn cores, synergizing well with Genesect, Landorus-T, and offensive Zapdos. Barraskewda also benefits from teammates that check Fire-types and cover its Desolate Land weakness like Nihilego and Garchomp, which can punish them by setting entry hazards. Since Barraskewda's main job as a pivot and revenge killer involves a lot of switching, it benefits from entry hazard removers and slow pivots. Defensive pivots such as Swampert and Landorus-T are able to preserve momentum and set up entry hazards. softening up foes. Dauntless Shield Mew and Intimidate Corviknight are great partners because of their physical bulk, reliable recovery, and Defog. On Barraskewda's own team, Pokemon like Tapu Fini offer Defog, while Magic Bounce users such as Blissey and Mew act as entry hazard deterrents with the option to run slow pivot moves such as Teleport, U-turn, and Volt Switch.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 375662, "username": "Think"}, {"user_id": 475804, "username": "The Number Man"}]}, {"name": "Grammar checked by", "members": [{"user_id": 331519, "username": "CryoGyro"}, {"user_id": 241023, "username": "Kris"}]}], "writtenBy": [{"user_id": 226455, "username": "berry"}, {"user_id": 523866, "username": "UT"}]}
  },
  "Zarude": {
    "comments": "<h1>Other Options</h1> <p>Adamant Tough Claws is rarely run, as Zarude loses priority on Grassy Glide, leaving it unable to revenge kill any attacker, as well as losing passive recovery and Terrain control. On the other hand, however, it provides a decent power boost on all other moves and makes Darkest Lariat very spammable: it now 2HKOes non-Intimidate Corviknight, Zapdos, and Heatran, easing prediction and pivoting.</p> <h1>Checks and Counters</h1> <p><strong>Steel-types: Corviknight, especially Intimidate variants, takes minimal damage from Zarude; Cobalion outspeeds and forces out Zarude while recovering any chip damage via Regenerator; and other Steel-types like Ferrothorn require noticeable chip damage for non-Close Combat Zarude to break through them.</p> <p><strong>Flying-types: Resisting Grassy Glide, common Flying-types like Zapdos, Togekiss, and Mandibuzz can either outspeed and force out Zarude or completely wall it.</p> <p><strong>Faster Pokemon: Zarude often finds itself unable to threaten common fast pivots with Grassy Glide, such as Choice Scarf Genesect and Talonflame. Both carry super effective moves to hit Zarude in return. Additionally, Zarude is forced out by U-turn users given its glaring 4x Bug weakness, especially Azelf, which replaces its Grassy Terrain with Psychic Terrain: this often gives free momentum to offensive pivots, as they can freely use U-turn without taking Grassy Glide.</p> ",
    "sets": [
      {
        "name": "Offensive Pivot",
        "description": "<p>Zarude is a formidable offensive pivot and doubles as one of the strongest priority users in the metagame. With Choice Band and a Terrain-boosted Grassy Glide, Zarude can force out the majority of relevant wallbreakers, such as Tapu Koko and Azelf, as they risk getting OHKOed. U-turn capitalizes on the switches Zarude forces, bringing in offensive partners like Heatran and Blacephalon. Power Whip is the strongest STAB move available, OHKOing or 2HKOing common defensive pivots like Swampert, Tapu Fini, Zapdos, and Toxapex. Darkest Lariat is a spammable STAB move that also bypasses Dauntless Shield boosts, scoring 2HKOs on Heatran, Mew, and Moltres. However, Close Combat is a strong alternative over either Power Whip or Darkest Lariat, allowing it to break through specific checks like Ferrothorn and Incineroar. A Jolly nature puts it above Zapdos and Garchomp, among others, that it can 2HKO on the switch. However, this is not essential; using an Adamant nature instead boosts Zarude's already strong priority move, notably giving a better chance to OHKO Tapu Koko.</p> <p>Zarude provides valuable utility including priority, Terrain control, and passive recovery, making it a great fit on balance and bulky offense teams. As Zarude cannot switch into most attackers, a strong defensive core often helps bring it in safely. Zarude also handily beats Swampert and Tapu Fini, making it a great partner for a multitude of wallbreakers, such as Heatran, Blacephalon, Zapdos, and Tapu Koko. In return, Zarude gives them good switch-in opportunities by using U-turn on the Steel-types it invites in, mainly Corviknight and Cobalion. Zarude appreciates any teammates that can set entry hazards, chipping down foes like Tapu Koko, Ferrothorn, and Corviknight into OHKO or 2HKO range. Teammates carrying Rocky Helmet such as Corviknight and Swampert also provide chip damage, and they can notably punish offensive pivots freely clicking U-turn on Zarude; Wandering Spirit Corviknight is especially valuable, as it can nullify opposing Regenerator on a U-turn. Lastly, teammates running Knock Off are useful to remove opposing Rocky Helmet and Heavy-Duty Boots, respectively allowing Zarude to attack more freely and better chip walls—especially Flying-types—in combination with hazards.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 375662, "username": "Think"}, {"user_id": 523866, "username": "UT"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 476520, "username": "lph"}]}
  }
}