{
  "Kyogre": {"overview": "<p><a href=\"https://www.smogon.com/forums/threads/series-10-viability-rankings.3688166/\">Viability Ranking: A+</a></p> <p>This is a sample set. We are currently working on proper analyses in <a href=\"https://www.smogon.com/forums/forums/vgc-analyses.643/\">Contributions &amp; Corrections</a>.</p> ", "sets": [{"name": "Mystic Water"}, {"name": "Choice Item"}]},
  "Groudon": {
    "sets": [
      {
        "name": "Life Orb Attacker",
        "description": "<p>Groudon threatens nearly the whole metagame with its Ground- and Fire-type coverage from its base 150 Attack stat; additionally, its solid natural bulk makes it difficult to remove quickly. Drought strengthens Groudon's Heat Crash and weakens Water-type attacks from Pokemon such as Kyogre and Urshifu-R, which can completely turn Groudon's matchup against these Pokemon around. Precipice Blades is very strong, capable of OHKOing Incineroar, Entei, and Tapu Lele while 2HKOing most other neutral targets. Heat Crash takes advantage of Groudon's massive weight to beat Grass-types such as Rillaboom, Tsareena, and Amoonguss. Swords Dance can offset Intimidate from the likes of Landorus-T and Incineroar and boost Groudon's Attack to insane levels, for example OHKOing Xerneas with +2 Precipice Blades. Substitute is an option over Swords Dance making it more difficult for Pokemon like Rillaboom to threaten Groudon. Life Orb gives Groudon a much appreciated power boost, allowing it to OHKO Zacian-C with Precipice Blades, Amoonguss, and Calyrex-S.</p> <p>Groudon's relatively average base 90 Speed often leaves it reliant on speed control such as Trick Room from Porygon2 and Stakataka, Electroweb from Regieleki, or Tailwind from Talonflame and Whimsicott. As Groudon is vulnerable to Grass-types such as Rillaboom and Venusaur, Fire-types like Incineroar and Volcarona pair well with it, and they also advantage of sun with their Fire-type attacks. Even in sun, Kyogre threatens Groudon for massive damage, so be sure to add Grass- and Electric-type teammates such as Assault Vest Rillaboom, Regieleki, and Venusaur to help check it. Venusaur is especially notable, as Drought enables its Chlorophyll, letting it outspeed the entire unboosted metagame and threaten Sleep Powder, as well as giving it access to a Fire-type Weather Ball. Tsareena is another solid teammate, keeping Groudon safe from priority attacks like Fake Out and Grassy Glide while threatening opposing Grass-types with Triple Axel.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 501951, "username": "zeefable"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 541847, "username": "Yourwelcomethanku"}]}
  },
  "Whimsicott": {"overview": "<p><a href=\"https://www.smogon.com/forums/threads/series-10-viability-rankings.3688166/\">Viability Ranking: A-</a></p> <p>This is a sample set. We are currently working on proper analyses in <a href=\"https://www.smogon.com/forums/forums/vgc-analyses.643/\">Contributions &amp; Corrections</a>.</p> ", "sets": [{"name": "Tailwind Support"}]},
  "Amoonguss": {
    "sets": [
      {
        "name": "Utility",
        "description": "<p>Amoonguss's good bulk and good utility make it a great support Pokemon with the tools to deal with the majority of the metagame. Clear Smog resets the boosts of Geomancy Xerneas and Cosmic Power Eternatus. Amoonguss will always carry Rage Powder, redirecting powerful attacks such as Zacian's Behemoth Blade and Regieleki's Thunder away from its common allies like Xerneas and Kyogre. Spore is used to disrupt the enemy team with sleep while also breaking Trick Room setups. Other options are Pollen Puff to heal your own Pokemon and Grass Knot to hit Groudon and Kyogre hard. Amoonguss will usually carry a Mental Herb to shake off Taunt from threats such as Whimsicott, Tornadus, and Incineroar, but it can also run an Occa Berry to survive Groudon's Heat Crash, Volcarona's Overheat, and Incineroar's Flare Blitz and put them to sleep in return. Regenerator provides Amoonguss longevity, while its EV spread makes it survive a +1 Behemoth Blade from Zacian-C and a Hurricane from Tornadus, although it can never survive a Calyrex-S Expanding Force. Unfortunately, Amoonguss's low offensive presence makes it rely heavily on its partners to deal significant damage. This makes Volcarona and Rillaboom often preferred over it.</p> <p>Amoonguss is a great partner for Zacian-C and Xerneas, since both Pokemon appreciate its redirection and support for setting up or preserving their health. Kyogre is another good option, since its rain weakens Fire-type moves. Fire-types such as Entei and Incineroar are also appreciated, since they can power through opposing Grass-types like Rillaboom and Tsareena easily, which can disrupt Amoonguss because they're immune to Rage Powder and Spore. Landorus, Palkia, and Urshifu-R are other good allies to KO opposing Fire-type Pokemon such as Incineroar and Volcarona.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 294287, "username": "Raineko"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 541609, "username": "Evelyie"}]}
  },
  "Mienshao": {"overview": "<p><a href=\"https://www.smogon.com/forums/threads/series-10-viability-rankings.3688166/\">Viability Ranking: A-</a></p> <p>This is a sample set. We are currently working on proper analyses in <a href=\"https://www.smogon.com/forums/forums/vgc-analyses.643/\">Contributions &amp; Corrections</a>.</p> ", "sets": [{"name": "Offensive Utility"}]},
  "Volcarona": {"overview": "<p><a href=\"https://www.smogon.com/forums/threads/series-10-viability-rankings.3688166/\">Viability Ranking: A</a></p> <p>This is a sample set. We are currently working on proper analyses in <a href=\"https://www.smogon.com/forums/forums/vgc-analyses.643/\">Contributions &amp; Corrections</a>.</p> ", "sets": [{"name": "Utility", "description": "<p>The EV Spread allows Volcarona to survive a Surging Strikes from Urshifu-R.</p> "}]},
  "Tornadus": {
    "sets": [
      {
        "name": "Tailwind Support",
        "description": "<p>Tornadus utilizes Prankster to support its team with priority status moves and hits opposing Pokemon hard with its strong STAB Hurricane. Hurricane has 100% accuracy when paired with a Rain setter such as Kyogre, which is a common teammate. Tailwind allows Kyogre to outspeed Regieleki, Zacian-C, and Calyrex-S. Tailwind also allows Tsareena, another common teammate, to outspeed Landorus and Kyogre. Taunt prevents Trick Room from users such as Stakataka while also shutting down Spore from Amoonguss and Geomancy from Xerneas. Tornadus can run Icy Wind or Rain Dance over Protect; however, it loses its ability to avoid Fake Out and can easily be OHKOed by Pokemon such as Regieleki. Icy Wind provides coverage and speed control, comfortably 2HKOing Pokemon such as Landorus and letting Tornadus control the game's pace if hit by taunt. Rain Dance is useful when playing against Groudon and Torkoal, resetting the weather for Kyogre and weakening Groudon's Heat Crash and Torkoal's Eruption. Focus Sash allows Tornadus to survive Regieleki's Thunderbolt and Volt Switch as well as powerful moves such as Kyogre's Water Spout. Mental Herb allows it to ignore Taunt and Encore and still utilize Tailwind and Taunt for its team. Wacan Berry stops Regieleki's Thunderbolt from OHKOing Tornadus and lets another teammate utilize focus sash. Life Orb allows Tornadus to OHKO Pokemon such as Volcarona and Landorus but hinders its survivability and demands running Icy Wind over Protect.</p> <p>Tornadus and Kyogre work well together because Tornadus threatens opposing Grass-types for Kyogre and allows it to outspeed Regieleki with Tailwind. Regieleki poses a major threat to Tornadus and Kyogre, so Pokemon that can deal with it such as Tsareena, Rillaboom, and Landorus are very good choices for teammates. Tsareena is a great partner for Tornadus, as it shuts down opposing Fake Out, allowing Tornadus to more safely set up Tailwind. Rillaboom offers Fake Out to assist Tornadus in setting up Tailwind, and it can take out Regieleki with Grassy Glide. Landorus offers Electric immunity and can OHKO Regieleki and Zacian-C, Pokemon that Tornadus cannot handle.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 294287, "username": "Raineko"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 510629, "username": "Mustash"}]}
  },
  "Thundurus": {
    "overview": "<p><a href=\"https://www.smogon.com/forums/threads/series-10-viability-rankings.3688166/\">Viability Ranking: A-</a></p> ",
    "sets": [
      {
        "name": "Prankster Support",
        "description": "<p>Thundurus's excellent status moves such as Eerie Impulse and Scary Face backed by Prankster make it one of the most consistent support options in the metagame. Additionally, its defensive typing allows it to stand up to the likes of Zacian-C and Rillaboom quite nicely. Even without Special Attack investment, Thunderbolt will bring Urshifu-R down to its Focus Sash and always 2HKO offensive Kyogre. Eerie Impulse is vital for crippling threatening special attackers such as Xerneas, Calyrex-S, and Kyogre, though be sure to watch out for Tsareena's Queenly Majesty and Psychic Terrain, as they block Thundurus's status moves due to prankster. Taunt can shut down Pokemon heavily reliant on status moves such as Volcarona, Amoonguss, and Porygon2. Scary Face gives Thundurus a reliable form of speed control, though Thunder Wave can be used to fish for full paralyses at the cost of being ineffective against Electric- and Ground-types. Sitrus Berry and Mago Berry improve Thundurus's longevity, whereas Safety Goggles allows it to circumvent Rage Powder users such as Amoonguss and Volcarona while also blocking Amoonguss's Spore. Thundurus is rather passive and slow-paced, so it works well with Pokemon like Incineroar and Rillaboom that match its tempo; however, it's important to remember that it needs offensive partners such as Zacian-C, Calyrex-S, and Urshifu-R to do the heavy lifting when it comes to dealing damage.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 517038, "username": "Giokio"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 501951, "username": "zeefable"}]}
  },
  "Landorus": {"overview": "<p><a href=\"https://www.smogon.com/forums/threads/series-10-viability-rankings.3688166/\">Viability Ranking: A</a></p> <p>This is a sample set. We are currently working on proper analyses in <a href=\"https://www.smogon.com/forums/forums/vgc-analyses.643/\">Contributions &amp; Corrections</a>.</p> ", "sets": [{"name": "Offensive"}]},
  "Xerneas": {
    "overview": "<p><a href=\"https://www.smogon.com/forums/threads/series-10-viability-rankings.3688166/\">Viability Ranking: A</a></p> ",
    "sets": [
      {
        "name": "Geomancy",
        "description": "<p>Xerneas is one of the most threatening wincons in the metagame thanks to the combination of Geomancy, Power Herb, and Fairy Aura turning it into a cleaning machine upon setup. Moonblast is Xerneas's strongest single-target option, capable of OHKOing Calyrex-S, physically defensive Incineroar, and Groudon at +2. Dazzling Gleam gives Xerneas a spread move option, useful for cleaning up weakened foes and circumventing redirection users like Volcarona and Indeedee-F. The HP investment allows Xerneas to always survive a Water Spout from Modest Choice Scarf Kyogre, while the Special Attack investment guarantees an OHKO on unboosted 4 HP Xerneas. Maximum Speed investment with a Timid nature is crucial for outspeeding the plethora of Pokemon in or around the base 90 Speed tier, such as Groudon, Kyogre, Urshifu-R, and Tapu Lele.</p> <p>Xerneas needs a safe turn to set up Geomancy, and, as such, appreciates Pokemon like Incineroar, Rillaboom, and Volcarona that can support it with Fake Out or redirection. Additionally, the aforementioned Fire-types help it pressure two of its most common checks, Amoonguss and Zacian-C. Thundurus can cripple Xerneas with Eerie Impulse and Scary Face, so having a priority blocker like Tsareena, Indeedee-F, or Tapu Lele is helpful to allow Xerneas to set up safely. Landorus is also an excellent Xerneas partner, as it cleanly OHKOes common Xerneas checks such as Entei, Stakataka, Incineroar, and Zacian-C with Earth Power.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 517038, "username": "Giokio"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 501951, "username": "zeefable"}]}
  },
  "Incineroar": {
    "sets": [
      {
        "name": "Physically Defensive",
        "description": "<p>A staple in VGC, Incineroar once again reigns as the best utility Pokemon in Series 10. Incineroar has a plethora of utility options including Fake Out, Parting Shot, Taunt, and Snarl that allow it to control the field and disrupt the opposing Pokemon. Fake Out allows it to pin down a threat on the enemy team. Parting Shot allows it to safely switch in another Pokemon, partly in thanks to its low Speed, while lowering the enemy's offensive stats, allowing Incineroar to take a hit before pivoting out. Flare Blitz hits Pokemon such as Rillaboom, Zacian-C, and Tsareena for heavy damage. Taunt shuts down Pokemon such as Whimsicott, Porygon2, and Amoonguss. Snarl lets Incineroar pressure special attackers such as Regieleki, Calyrex-S, and Regieleki. Darkest Lariat nails Pokemon that are weak to it, including Calyrex-S, Indeedee-F, and Latias, and even pressures Defense-boosting Pokemon such as Cosmic Power Eternatus.</p> <p>Thanks to the amount of utility that Incineroar provides, it is able to fit on virtually any team and do well. The given EVs let it survive Sacred Sword from Zacian-C, Surging Strikes from Jolly maximum Attack Urshifu-R, and Close Combat from Mienshao with a 94% chance. Alternatively, Incineroar can run an EV spread of 236 HP / 36 Def / 236 SpD with a Careful nature, allowing it to survive a +2 Moonblast from Timid Xerneas.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 294287, "username": "Raineko"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 547596, "username": "Helios of Sun"}]}
  },
  "Tsareena": {
    "sets": [
      {
        "name": "Assault Vest",
        "description": "<p>Tsareena's Queenly Majesty allows it to protect allies from priority attacks, and its solid 120 Attack and respectable movepool allow it to provide good damage output. Power Whip is Tsareena's main STAB move, allowing it to OHKO Kyogre and Tapu Fini and 2HKO Calyrex-S and Xerneas. U-turn, paired with Tsareena's relatively slow Speed can grant safe switches for Restricted partners like Kyogre and Groudon . High Jump Kick hits Stakataka, Incineroar and Urshifu-S and Triple Axel threatens Landorus, Tornadus, Rillaboom and Whimsicott. The given EV spread, paired with Assault Vest allows Tsareena to survive a Moonblast from Modest +2 Xerneas. Kyogre makes a great ally to Tsareena, setting up the rain so Fire-types like Incineroar can't OHKO it, while Tsareena shuts down Grassy Glide from Rillaboom and Eerie Impulse from Thundurus, as well as checking Regieleki. Tsareena also pairs well with Lunala and Calyrex-S, as it protects them from Sucker Punch and Shadow Sneak from threats like Urshifu-S and Aegislash. Tsareena also pairs nicely with Incineroar and Regieleki, as it covers their weaknesses to Water- and Ground-types and forms a nice pivoting core.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 501951, "username": "zeefable"}]}, {"name": "Grammar checked by", "members": [{"user_id": 241023, "username": "kris"}]}], "writtenBy": [{"user_id": 541609, "username": "Evelyie"}]}
  },
  "Stakataka": {
    "overview": "<p><a href=\"https://www.smogon.com/forums/threads/series-10-viability-rankings.3688166/\">Viability Ranking: A-</a></p> ",
    "sets": [
      {
        "name": "Offensive Trick Room",
        "description": "<p>Stakataka's high Defense, excellent defensive typing, and great movepool allow it to be a key force in the Series 10 metagame. Its Gyro Ball hits almost the entire metagame at full power thanks to its low Speed and is excellent for checking Xerneas. Body Press lets Stakataka 2HKO Incineroar while being unaffected by Intimidate, and only gets stronger with each KO it takes thanks to Beast Boost raising Stakataka's Defense. Trick Room helps versus the mostly fast-paced meta, and can turn the battle in Stakataka's favor extremely quickly. Finally, Wide Guard is able to ward off threatening spread moves such as Astral Barrage, Water Spout, Electroweb, and Precipice Blades. Wide Guard can be switched out for Protect to avoid Fake Outs and other hits or Rock Slide for situations where teams need Rock-type coverage against Pokemon such as Yveltal and Volcarona. Chople Berry helps Stakataka survive Fighting-type hits from Urshifu-S, Urshifu-R, Mienshao, and Zacian-C. Safety Goggles can be an option to deal with Spore Amoonguss and Sleep Powder Venusaur, as well as ignoring Rage Powder from Amoonguss and Volcarona. Lastly, for more offensive variants, Life Orb is an option, boosting the power of Stakataka's already powerful attacks. The given EV spread allows Stakataka to survive a Helping Hand-boosted +2 Moonblast from Xerneas or a Life Orb- and Helping Hand-boosted Astral Barrage from Calyrex-S, as well as a chance of living Close Combat from Choice Band Urshifu-S and Urshifu-R should it be holding Chople Berry. Some Stakataka choose to use an offensively oriented EV spread with 252 HP / 252 Atk / 4 SpD, especially if holding Life Orb.</p> <p>Stakataka loves Fake Out users to help it set up Trick Room, so Incineroar and Rillaboom work magnificently —Rillaboom more so, as they cover each other's weaknesses very well. Stakataka also appreciates redirection to help with setting up Trick Room, so Indeedee-F, Volcarona, and Amoonguss are great with it as well. Stakataka also pairs well with Groudon and Palkia, as Stakataka covers Xerneas and Yveltal for them and uses Wide Guard to block threatening spread moves. Groudon covers Stakataka's Water weakness with Drought, while Palkia covers Stakataka's Ground weakness with STAB Water-type attacks to threaten Groudon, Landorus, and Landorus-T.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 501951, "username": "zeefable"}]}, {"name": "Grammar checked by", "members": [{"user_id": 241023, "username": "Kris"}]}], "writtenBy": [{"user_id": 541946, "username": "Br0Sk1llz"}]}
  },
  "Rillaboom": {
    "overview": "<p><a href=\"https://www.smogon.com/forums/threads/series-10-viability-rankings.3688166/\">Viability Ranking: A+</a></p> ",
    "sets": [
      {
        "name": "Assault Vest",
        "description": "<p>Rillaboom's good matchup against restricted Pokemon such as Kyogre and Xerneas, and its Grassy Terrain-boosted Grassy Glide, makes it a great Pokemon in the format. Grassy Glide allows Rillaboom to immediately check faster threats such as Regieleki and Urshifu-R while being its primary STAB move. Wood Hammer can OHKO Nihilego, bulky Kyogre, and Groudon while avoiding Tsareena's Queenly Majesty. Knock Off is an alternative move to get rid of items such as Xerneas's Power Herb and Incineroar's Figy Berry while also threatening Calyrex-S and Shedinja. Fake Out is a great tool for regaining momentum, stopping opposing setup such as Tornadus's Tailwind while leaving their users open for attacks from Rillaboom's allies. U-turn lets Rillaboom pivot in and out while recycling its Fake Out and Grassy Terrain. This EV spread, together with the Assault Vest, allows Rillaboom to live +2 Xerneas's Moonblast and comfortably take Calyrex-S's Astral Barrage.</p> <p>Rillaboom can partner with everything and do well due to its pressure and damage, but notable Restricted partners are Zacian-C and Xerneas, since they appreciate Fake Out pressure to set up Substitute or Geomancy, respectively. Groudon also appreciates Rillaboom, since it keeps Kyogre in check. As for non-Restricted partners, Fire-types such as Incineroar and Entei are appreciated to break through Grass-types that could wall Rillaboom, such as Tsareena and Amoonguss. Urshifu-R and Landorus are also good partners, since they can easily deal with Incineroar and Volcarona.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 294287, "username": "Raineko"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 541609, "username": "Evelyie"}]}
  },
  "Zacian-Crowned": {
    "overview": "<p><a href=\"https://www.smogon.com/forums/threads/series-10-viability-rankings.3688166/\">Viability Ranking: A+</a></p> ",
    "sets": [
      {
        "name": "Offensive",
        "description": "<p>Zacian-C's monstrous stats, solid defensive typing, and immediately threatening power due to Intrepid Sword make it one of the best Restricted Pokemon in the Series 10 metagame. Behemoth Blade is a consistent STAB move that makes swift work of the likes of Xerneas and Tapu Lele while even threatening OHKOs on neutral targets such as Calyrex-S and Landorus. Sacred Sword and Close Combat let Zacian-C dent Pokemon that resist its Behemoth Blade such as Incineroar, Regieleki, and Entei. Sacred Sword is noticeably weaker than Close Combat; however, the lack of defense dropping can be crucial for Zacian-C's longevity. On the other hand, Close Combat is useful for OHKOing Stakataka and physically defensive Incineroar at +1 Attack. Substitute is an excellent move for Zacian-C, keeping it safe from Intimidate, Fake Out, and status, and it capitalizes well on opponents looking to play around it defensively. Play Rough as a third attack notably hits the likes of Thundurus, Urshifu-R, and Zapdos, which don't particularly mind taking a Behemoth Blade or Fighting-type coverage move. Swords Dance is a fringe option that gives Zacian-C another way to counteract Intimidate, and it typically gives the user an excuse to invest more in its bulk. The given EV spread simply allows Zacian-C to make four Substitutes, with the Attack investment still allowing it to always OHKO 4 HP Calyrex-S with Behemoth Blade.</p> <p>Zacian-C works best when it can be brought into battle safely, and, as such, it appreciates being paired with pivots like Incineroar, Rillaboom, and Regieleki. These pivots can also provide it with various means of offensive support such as Fake Out, Electroweb, Dark-type coverage for Calyrex-S, and Grass- and Electric-type coverage for Kyogre. Landorus, Urshifu-R, and Landorus-T all pressure Incineroar, which is great for keeping Zacian-C's Attack as high as possible while in battle. It is worth noting, however, that Zacian-C is a fairly low-maintenance Pokemon and can work with almost any viable Pokemon as a partner.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 294287, "username": "Raineko"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 501951, "username": "zeefable"}]}
  },
  "Urshifu": {
    "sets": [
      {
        "name": "Offensive",
        "description": "<p>Urshifu-S is a very threatening Pokemon with its Unseen Fist ignoring Protect, which makes it significantly harder to play around, alongside its base 130 Attack and Wicked Blow being unaffected by Intimidate. Wicked Blow ignoring Intimidate lets Urshifu-S click an attack unfazed by the likes of Incineroar and Landorus-T, and it also nails Calyrex-S, Lunala, and Indeedee-F. Sucker Punch is strong priority that threatens an OHKO on Calyrex-S and a 2HKO on Regieleki. Detect is used over Protect to deal with Imprison users that run Protect such as Zacian-C and Calyrex-S. Focus Sash is the preferred item on Urshifu-S due to its poor Special Defense and weaknesses, which would let Pokemon like Xerneas, Urshifu-R, and Zacian-C OHKO it otherwise. Life Orb gives Urshifu-S significantly more power, letting it OHKO Tornadus and physically defensive Incineroar. Choice Scarf lets it outpace Mienshao, Calyrex-S, and Nihilego, and Choice Band gives it the power to OHKO Landorus and specially defensive Incineroar after Intimidate. Choice item sets have the awful drawback of not being able to use Detect, making them significantly easier to play around.</p> <p>Urshifu-S appreciates Tailwind support from common users such as Tornadus and Whimsicott to outspeed threats to itself such as Mienshao, Regieleki, and Nihilego. Zacian-C is good alongside Urshifu-S for its ability to thwart Yveltal, Xerneas, and Tapu Fini, while Urshifu-S can hit Incineroar and Landorus-T for Zacian-C. Regieleki can help keep Urshifu-R and Mienshao in check for Urshifu-S as well giving it speed control with Electroweb. Fake Out users such as Rillaboom, Incineroar, and Gothitelle are fearsome alongside Urshifu-S due to Fake Out pinning down threats such as Xerneas, Landorus, and Zacian-C, allowing Urshifu-S to target the opposition more freely with its Protect-ignoring attacks.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 294287, "username": "Raineko"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 541847, "username": "yourwelcomethanku"}]}
  },
  "Urshifu-Rapid-Strike": {"overview": "<p><a href=\"https://www.smogon.com/forums/threads/series-10-viability-rankings.3688166/\">Viability Ranking: A+</a></p> <p>This is a sample set. We are currently working on proper analyses in <a href=\"https://www.smogon.com/forums/forums/vgc-analyses.643/\">Contributions &amp; Corrections</a>.</p> ", "sets": [{"name": "Offensive"}]},
  "Regieleki": {
    "sets": [
      {
        "name": "Focus Sash",
        "description": "<p>Regieleki's astounding Speed and powerful Electric-type moves fueled by Transistor, along with it providing speed control with Electroweb, make it an excellent speedy attacker. Transistor allows Regieleki to hit deceptively hard and greatly threaten Pokemon like Kyogre and Tornadus. Thunderbolt 2HKOes Zacian-C and Urshifu-S, along with OHKOing any Urshifu-R without Focus Sash. Volt Switch is weaker than Thunderbolt, but it allows Regieleki to quickly switch out of disadvantageous situations and take advantage of opposing switches while still dealing damage, and it synergizes well with other pivoting Pokemon like Rillaboom and Incineroar. Electroweb is especially useful when considering Regieleki's great Speed, which allows it to lower the Speed of Pokemon like Calyrex-S before they can even move. Focus Sash circumvents Regieleki's poor bulk, and Protect allows it to preserve that Focus Sash. Regieleki is useless against Ground-types such as Landorus, so Pokemon that can handle them relatively well like Urshifu-R, Rillaboom, and Kyogre make great partners for it. Pokemon that appreciate it's speed control like Groudon are also good teammates, especially because Regieleki handles Kyogre for Groudon quite well. Regieleki's great Speed and offensive utility make it beneficial to almost any team archetype in the metagame.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 501951, "username": "zeefable"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 531334, "username": "dnagerbadger"}]}
  },
  "Calyrex-Shadow": {"overview": "<p><a href=\"https://www.smogon.com/forums/threads/series-10-viability-rankings.3688166/\">Viability Ranking: A+</a></p> <p>This is a sample set. We are currently working on proper analyses in <a href=\"https://www.smogon.com/forums/forums/vgc-analyses.643/\">Contributions &amp; Corrections</a>.</p> ", "sets": [{"name": "Offensive"}, {"name": "Choice Item"}]}
}