{
  "Charmander": {
    "sets": {
      "Sun Wallbreaker": {
        "description": "<p>Charmander's only viable set is as a sun attacker; under sun, Charmander's Solar Power-boosted Fire-type moves deal massive damage. Weather Ball is Charmander's most spammable STAB attack in sun, while Overheat and Fire Blast allow it to clean weakened teams even without sun. Finally, because Charmander does not have any coverage moves and sun teams often struggle to fit a Spore absorber, Sleep Talk allows it to fulfill the role of a sleep absorber. Choice Scarf allows Charmander to outspeed the entire unboosted metagame and common Choice Scarf users like Mudbray, Porygon, and Magnemite. Charmander requires sun support from Vulpix. It can break down shared checks for other Fire-types and benefit from other sun sweepers like Ponyta weakening Water-types like Frillish and Mareanie, which are challenging Pokemon to chip down. Fighting-types that lure Mareanie and remove its Eviolite, like Mienfoo and Timburr, also help Charmander. Diglett helps trap Pokemon like the aforementioned Mareanie, Ponyta, and Staryu.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "yellowfin", "user_id": 416460}], "teams": [{"name": "Quality checked by", "members": [{"username": "DC", "user_id": 449990}]}, {"name": "Grammar checked by", "members": [{"username": "DC", "user_id": 449990}]}]}
  },
  "Sandshrew-Alola": {
    "sets": {"Hail Sweeper": {"description": "<p>Alolan Sandshrew finds a niche in LC as a hail sweeper due to the sheer power of Triple Axel, which lets it power through Pokemon like Mienfoo, Koffing, and Natu. Earthquake threatens Ice-resistant foes such as Mareanie, Ponyta, and Pawniard. With Rapid Spin and Swords Dance, Alolan Sandshrew can capitalize on setup opportunities and quickly snowball out of control. Wide Lens significantly improves Triple Axel's accuracy. Hail support from Snover or Amaura is necessary to facilitate a sweep. Trappers such as Wynaut and Diglett can help remove threats to hail teams; Wynaut deals with Timburr and its pesky Mach Punch, while Diglett can remove Mareanie and Fire-types like Ponyta and Vulpix.</p>"}},
    "credits": {"writtenBy": [{"username": "DC", "user_id": 449990}], "teams": [{"name": "Quality checked by", "members": [{"username": "gali", "user_id": 107567}]}, {"name": "Grammar checked by", "members": [{"username": "dex", "user_id": 277988}]}]}
  },
  "Vulpix": {
    "comments": "<h1>Other Options</h1> <p>Extrasensory hits Mareanie for super effective damage, but it is quite weak coming from Vulpix's low Special Attack. Encore can stop setup sweepers and take advantage of Water-types stalling out sun turns with Recover. Protect is useful for blocking Fake Out and First Impression, but it also wastes a valuable sun turn. Memento supports setup sweepers like Tyrunt. Will-O-Wisp can punish physical attackers like Onix and Mienfoo, but it is usually better to attack such foes.</p> <h1>Checks and Counters</h1> <p><strong>Ponyta</strong>: Ponyta is not threatened by any of Vulpix's attacks and, with Flash Fire, it can even grow stronger by switching into a STAB move. It can also use Flame Charge to turn the tables on sun teams and hit them with its boosted Flare Blitz. Ponyta must beware Hypnosis, though.</p> <p><strong>Water-types</strong>: Staryu outspeeds non-Choice Scarf Vulpix, while Frillish and Mareanie have the bulk to switch in and use Recover to stall out sun turns. Staryu and Frillish must beware Energy Ball, though, and Staryu and Mareanie can be picked off by Eject Pack Overheat sets paired with Diglett.</p> <p><strong>Trappers</strong>: Most variants of Diglett can trap and remove non-Choice Scarf Vulpix, although they cannot comfortably switch in. Eviolite and Choice Scarf Diglett deserve special mention; Eviolite Diglett can take a hit and remove Vulpix reliably, while Choice Scarf Diglett outspeeds even Choice Scarf Vulpix and can threaten sun teams as a whole. Although less reliable, Trapinch has the bulk to take a hit from Vulpix and KO it back with Earthquake.</p> <p><strong>Onix</strong>: Onix takes Vulpix's STAB moves well, OHKOes it with Earthquake, and can force uncomfortable turns against non-Choice Scarf Vulpix by Speed tying it. Onix is OHKOed by Energy Ball, though, and can be beaten if it loses the Speed tie.</p> <p><strong>Stealth Rock</strong>: Stealth Rock limits Vulpix's longevity and makes it especially vulnerable to priority moves from foes like Mienfoo, Grookey, and Trapinch.</p>",
    "sets": {
      "Sun Setter": {
        "description": "<p>Vulpix is LC's only automatic sun setter and supports dangerous Fire-types like Charmander and Ponyta. Weather Ball is Vulpix's most reliable STAB move under sun. Overheat deals massive damage to any neutral target and can safely bring in fragile threats when paired with Eject Pack. Fire Blast is a notable option on non-Eject Pack sets to provide a consistent attack outside of sun. Energy Ball hits Water-types and Onix. Hypnosis can cripple important switch-ins like Mareanie and Frillish, but its accuracy makes it unreliable. Flame Charge is another option to take advantage of sacrifices and forced switches, especially to avoid being trapped by Diglett. Heat Rock is the best item for dedicated sun teams, while Eject Pack works best in tandem with a single Fire-type teammate.</p> <p>Both Charmander and Ponyta become fearsome threats under Vulpix's sun and are the main reasons to run this set. Diglett supports sun offense by reliably setting Stealth Rock and trapping Mareanie, Staryu, and opposing trappers. Natu prevents Stealth Rock from being set up, which increases the longevity of Vulpix and its teammates. Timburr is a reliable entry hazard remover in the tier with its bulk and Defog. This set works well when paired with an Eject Button user that can pivot into attacks and give safe entry to Ponyta and Charmander; Trubbish is an option because its Sticky Hold guarantees that the item will work, even against Knock Off.</p>"
      },
      "Choice Scarf": {"description": "<p>Choice Scarf Vulpix is a fast, powerful threat that outspeeds most of the tier and works as a strong cleaner. Overheat is an extremely strong STAB move that can take out bulkier, unsuspecting switch-ins. Energy Ball hits Water-types and Onix. Fire Blast is a strong alternative STAB move that hits hard when against Koffing's Neutralizing Gas and outside of sun.</p> <p>Diglett is an invaluable partner for its ability to trap Mareanie, Ponyta, and sometimes Staryu. Trapinch can guarantee the removal of Ponyta. Natu can deter Stealth Rock from being set and preserve valuable health for Vulpix, letting it survive priority moves like Grookey's Grassy Glide. Grookey threatens Water-types and Onix, and it can lure in Fire-weak checks like Foongus to pivot Vulpix in with U-turn.</p>"}
    },
    "credits": {"writtenBy": [{"username": "goldenghost", "user_id": 32350}], "teams": [{"name": "Quality checked by", "members": [{"username": "gali", "user_id": 107567}, {"username": "DC", "user_id": 449990}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Diglett": {
    "comments": "<h1>Other Options</h1> <p>Lead Diglett is an option on hyper offense teams as a lead that can guarantee Stealth Rock and Memento. Choice Scarf Diglett outspeeds the entire metagame, including +2 Porygon, +1 Tyrunt, and +1 Ponyta, and can be used as a backstop against opposing Diglett and other fast threats with Final Gambit.</p> <h1>Checks and Counters</h1> <p><strong>Grookey</strong>: Grookey only fears the rare Sludge Bomb and can punish Diglett's presence with its hard-hitting STAB moves, Knock Off, U-turn, and Swords Dance, all of which can grant momentum and force difficult predictions. Grassy Terrain also severely weakens Earthquake and can make trapping difficult.</p> <p><strong>Opposing Arena Trap Users</strong>: Opposing Diglett and Trapinch can take out Diglett before it traps its main target, and thus it must be deployed carefully when facing them to maximize its value.</p> <p><strong>Bulky Pokemon</strong>: Bulky threats like healthy Mienfoo, Porygon, and Staryu can take advantage of Diglett after a trap, tolerating its attacks to garner momentum and force hard predictions.</p>",
    "sets": {
      "Air Balloon": {
        "description": "<p>Air Balloon Diglett can guarantee the removal of dangerous threats and defensive stalwarts like Ponyta, Focus Sash Abra, and Mareanie while eluding opposing Arena Trap users with Air Balloon. Air Balloon also allows it to trap opposing Diglett. Final Gambit is a powerful option that sacrifices Diglett to guarantee KOs on low-health foes. Beat Up KOes Focus Sash Abra with five hits and hits Galarian Ponyta and Natu hard while Diglett's teammates are healthy. Rock Slide nails both Larvesta and Natu. Substitute can be used to more reliably trap Pawniard, while Sucker Punch provides priority to teams that lack it. Diglett can run Stealth Rock, but it will rarely find turns to set it up due to its frailty. Protect is a notable option that blocks Mienfoo's Fake Out and Trapinch's First Impression, letting Diglett preserve its Air Balloon.</p> <p>Air Balloon Diglett works best with teammates that fear opposing Diglett like Ponyta and Abra without Shed Shell, and, against non-Air Balloon Diglett, it can punish the opponent for trapping one of these threats by counter-trapping their Diglett. Diglett removing important defensive Pokemon like Pawniard and Mareanie is also beneficial to Abra, Porygon, and Mienfoo. Mienfoo can force in targets like Mareanie and bring in Diglett safely to trap them with U-turn. Arena Trap means Diglett does not have traditional counters, but Grookey can heavily punish Diglett after it traps a foe, and Shed Shell Abra can evade Arena Trap. Bulky Poison-types like Koffing and Foongus, as well as Natu, can cover the Grookey matchup, while Frillish, Ferroseed, and Pawniard can slow down Abra.</p>"
      },
      "Eviolite": {
        "description": "<p>Eviolite Diglett trades the flexibility of Air Balloon and the power of Life Orb for bulk and reliability, as Eviolite lets it take a hit from foes like Mareanie, Pawniard, and non-Life Orb Abra and Diglett to secure a KO. Beat Up KOes Focus Sash Abra with five hits and threatens Galarian Ponyta and Natu while Diglett's teammates are healthy. Final Gambit trades Diglett for a KO or major damage against bulky foes like Ferroseed. Memento can aid setup sweepers, especially Dragon Dance Tyrunt. Rock Slide nails both Larvesta and Natu. Stealth Rock is an option for role compression, and Diglett's ability to trap its foes prevents Natu from blocking Stealth Rock. Earth Power helps Diglett trap foes like Mareanie and Ponyta while Grassy Terrain is active. The given investment in Special Defense helps Diglett more reliably trap threats like Abra.</p> <p>Eviolite Diglett works well with teams that want to guarantee a KO against a foe that other sets cannot reliably defeat, including Pawniard for hard hitters like Abra, Porygon, and Calm Mind or Cosmic Power Natu. This set works in tandem with Salac Berry Magnemite, as it reliably sets Stealth Rock while being able to switch into Ferroseed's Giga Drain, letting it use Memento to secure Magnemite's trap and setup. This set is vulnerable to Grookey, which does heavy damage to Diglett and forces it out, and to opposing Arena Trap users, especially Trapinch. Bulky Poison-types like Koffing and Foongus, along with Natu, cover the matchup against Grookey, while Grookey itself or Staryu can take advantage of Trapinch.</p>"
      },
      "Life Orb": {
        "description": "<p>Life Orb Diglett accepts maximum frailty in return for maximum power, and its sheer strength allows it to trap a wide array of enemies without Eviolite, even including chipped Mienfoo and Foongus. Earthquake is very powerful with Life Orb, while Beat Up KOes Focus Sash Abra in four hits and threatens Galarian Ponyta, Natu, and Frillish while Diglett's teammates are healthy. Substitute allows Diglett to avoid Pawniard's Sucker Punch to reliably trap it. Rock Slide hits Natu and Larvesta, while Sucker Punch can KO Grookey and Choice Scarf users like Porygon and Vulpix at low health. Protect blocks Mienfoo's Fake Out and Trapinch's First Impression, and hitting Trapinch with Earthquake before fainting can be invaluable to limiting the threat it poses to the rest of the team. Sludge Bomb is notable for its ability to weaken Grookey, one of Diglett's better checks.</p> <p>Life Orb Diglett can threaten almost any defensive core with its power, but teammates like Mienfoo, Porygon, Abra, and Natu especially benefit from its ability to remove Mareanie and Pawniard. This set can also support teams weaker against Mienfoo because Diglett can trap and remove it after Knock Off and chip damage. Trapinch and Air Balloon Diglett are the main roadblocks for this set, as they will always trap and KO Diglett after it gets its own KO. Grookey also punishes Diglett, but it must be wary of Sucker Punch when at low health. Grookey and Staryu can take advantage of Trapinch and Diglett, while Koffing, Foongus, and Natu check Grookey.</p>"
      },
      "Special Focus Sash": {
        "description": "<p>This set is specifically to trap Grookey. Diglett can use Earth Power over Earthquake to not be hampered by Grassy Terrain and remove key components of the opponent's team, such as Pawniard and Mareanie. Sludge Bomb OHKOes non-Eviolite Grookey and hits niche threats like Morelull. Final Gambit allows Diglett to heavily damage an enemy when it doesn't have to remove Grookey, such as Ferroseed, Porygon, or Staryu. Memento can aid setup sweepers, especially Dragon Dance Tyrunt. Protect lets Diglett keep Focus Sash intact through Stealth Rock if Grassy Terrain is active. It also blocks Mienfoo's Fake Out.</p> <p>Pokemon weak to Grookey, such as Carvanha, Abra, Tyrunt, Shellos, and Staryu, greatly benefit from Diglett removing it. Grookey itself is a good teammate, as Grassy Terrain can offset Stealth Rock chip. Porygon and Abra benefit from Diglett removing opposing Steel-types, and Mienfoo benefits from the removal of Mareanie. When not facing Grookey, Final Gambit's guaranteed removal of weakened threats like Staryu and Trace Porygon helps out teammates such as Ponyta and Mudbray.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "goldenghost", "user_id": 32350}, {"username": "TheShoddyStrawman", "user_id": 585065}], "teams": [{"name": "Quality checked by", "members": [{"username": "DC", "user_id": 449990}, {"username": "Berks", "user_id": 255030}, {"username": "gali", "user_id": 107567}]}, {"name": "Grammar checked by", "members": [{"username": "dex", "user_id": 277988}, {"username": "Adeleine", "user_id": 517429}, {"username": "DC", "user_id": 449990}]}]}
  },
  "Meowth": {
    "overview": "<p>Meowth is a niche revenge killer with the combination of Technician-boosted Fake Out + Feint to handle Choice Scarf users like Vulpix, Porygon, and Mienfoo offensively. It can also check frail fast threats like Abra and Grookey. It also has a great matchup against hyper offense teams like sun, Spikes-stack, and dual screens due to its ability to waste turns and cripple frail sweepers. Meowth can threaten bulkier Pokemon such as Koffing and Staryu with Fake Out into Double-Edge, if these have been chipped or hit with Knock Off beforehand, allowing it to threaten bulky offense teams. However, Meowth is extremely frail and vulnerable to fainting if it cannot KO the foe, and priority users like Grookey can easily revenge kill it if they survive Feint. Pokemon with Regenerator such as Mareanie and Foongus, as well as Steel-types like Pawniard and Ferroseed, can play around Meowth to negate progress. Most importantly, however, Meowth is almost entirely outclassed as a revenge killer by Grookey, which has much stronger priority in Grassy Glide and can opt to run Fake Out if necessary.</p>",
    "comments": "<h1>Other Options</h1> <p>Aerial Ace gives Meowth a better matchup against Fighting-types like Mienfoo and Timburr. A Naive or Jolly nature can be run to hit 19 Speed. However, Meowth already has a good matchup against 19 and 18 Speed Pokemon with Fake Out and Feint, and it misses out on the power of an Attack-boosting nature.</p> <h1>Checks and Counters</h1> <p><strong>Steel-types</strong>: Since Pawniard, Ferroseed, and Magnemite resist Meowth's STAB moves and aren't weak to Water Pulse, they use it as a free turn for entry hazards, setup, or Volt Switch.</p> <p><strong>Bulky Priority Users</strong>: Pokemon like Pawniard and Trapinch can tank Fake Out + Feint and retaliate with their own priority, so Meowth cannot use Double-Edge. Because Meowth often gets worn down quickly, even weak priority like Mienfoo's Fake Out can threaten it late-game.</p> <p><strong>Fighting-types</strong>: Timburr and Mienfoo can survive or prevent Fake Out + Double-Edge and OHKO or hit it with Mach Punch. Less common Fighting-types such as Croagunk can also force it out. Fighting-types must be wary of Aerial Ace, however.</p> <p><strong>Choice Scarf Users</strong>: Choice Scarf users like Mienfoo, Porygon, and Vulpix can threaten Meowth out after it has used Fake Out.</p>",
    "sets": {
      "All-out Attacker": {
        "description": "<h1>Moves</h1> <p>Fake Out helps to soften up Pokemon and revenge kill most weakened foes without Protect. If it is not enough to KO these, Feint can finish the job. Fake Out also breaks Sturdy and Focus Sash reliably, as well as helping against opposing priority users, such as weakened Timburr. Double-Edge is Meowth's strongest move; combined with Fake Out, it turns Meowth into a powerful wallbreaker, but it should be used sparingly due to the large amounts of recoil it can rack up. Water Pulse hits Onix, Dwebble, and Archen. With Fake Out, Meowth can beat SturdyJuice Onix and Dwebble as well. U-turn can be run over Water Pulse to escape bad matchups against Pokemon like Pawniard and Ferroseed. Additionally, not many Pokemon can tank Fake Out into Double-Edge, so Meowth can force many switches. It can take advantage of this to maintain momentum with U-turn. Knock Off can be run to weaken its checks, as Meowth can lure in Fighting- and Steel-types like Timburr and Ferroseed, which don't appreciate losing their Eviolite. Knock Off also prevents Regenerator cores from blocking Meowth.</p> <h1>Set Details</h1> <p>Technician increases the power of Meowth's low BP moves, and Life Orb is used to boost its otherwise lacking power. 36 SpA EVs allow Meowth to KO Archen after Fake Out chip damage, and 19 HP IVs are used to limit Life Orb recoil. A Naughty nature strengthens Meowth's STAB moves and doesn't weaken Water Pulse, but U-turn variants should run an Adamant nature and an EV spread of 236 Atk / 76 Def / 196 Spe.</p> <h1>Usage Tips</h1> <p>Meowth is extremely frail, so it shouldn't switch into attacks. Instead, aim to get it into the field through slow U-turns, double switches, or revenge killing opportunities. Faster Pokemon like Abra can run Protect—try to scout their sets to use Meowth's priority effectively. Feint can break through Protect, leaving them vulnerable to another Feint. Meowth can take the most advantage of its toolkit mid- or late-game when the opposing team is sufficiently weakened, so take care to preserve it until then. Always try to scout Onix and Dwebble to ensure you don't hit Weak Armor sets with Fake Out or Sturdy sets with Water Pulse. Making the right choice can potentially mean eliminating an entry hazard lead. U-turn variants should try to predict when Steel- and Fighting-types that wall Meowth, such as Pawniard and Timburr, might come in to maintain momentum.</p> <h1>Team Options</h1> <p>Entry hazard setters like Dwebble, Ferroseed, and Onix synergize well with Meowth chipping the opponent's team, especially if it carries U-turn. Knock Off users like Pawniard and Mienfoo allow Meowth to threaten even bulky teams, as few itemless Pokemon can take Fake Out into Double-Edge after entry hazards. Meowth appreciates having pivots such as Mienfoo and Grookey to guarantee a safe switch-in, chip foes, and maintain offensive momentum. If running Water Pulse, try pairing it with Pokemon that appreciate the removal of Rock-types like Ponyta to form wallbreaking cores. Meowth is entirely walled by Steel-types such as Pawniard, Ferroseed, and Magnemite, so partners like Mienfoo, Timburr, and Trapinch can take care of these.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "zizalith", "user_id": 410251}], "teams": [{"name": "Quality checked by", "members": [{"username": "DC", "user_id": 449990}, {"username": "Nineage", "user_id": 195129}, {"username": "goldenghost", "user_id": 32350}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}, {"username": "DC", "user_id": 449990}]}]}
  },
  "Abra": {
    "comments": "<h1>Other Options</h1> <p>Energy Ball OHKOes Onix and targets other problematic foes like Staryu, Frillish, Drilbur, and Trapinch. Abra can opt to run a dual screens set, consisting of Reflect, Light Screen, Thunder Wave, and Teleport with Light Clay, but it is outclassed by Natu in this role. Knock Off is a niche option to cripple checks such as Ferroseed, Frillish, and Munchlax on the switch. Dazzling Gleam is an option to hit both Fighting-types and Pawniard, easing prediction, but it is generally outclassed by other coverage options.</p> <h1>Checks and Counters</h1> <p><strong>Pawniard</strong>: Pawniard is one of the best checks to Abra thanks to its immunity to Psychic and ability to threaten Abra with Sucker Punch. It can force out Abra and use that opportunity to set Stealth Rock. However, Pawniard should be wary of Abra's coverage options.</p> <p><strong>Ferroseed</strong>: Ferroseed resists Psychic and threatens Abra with Thunder Wave and Knock Off. However, Ferroseed should be wary of Fire Punch.</p> <p><strong>Priority Attacks</strong>: Priority attacks are often the best ways to handle Abra, as they prevent it from getting a hit off. Strong priority like Grookey's Grassy Glide and Pawniard's Sucker Punch can KO, while weaker priority like Timburr's Mach Punch can break Abra's Focus Sash, leaving it vulnerable to faster attackers.</p> <p><strong>Choice Scarf Users</strong>: Choice Scarf users like Vulpix, Porygon, and Mienfoo outspeed and KO Abra. Choice Scarf Magnemite is notable, as it resists Psychic and doesn't enable Counter. However, Abra is able to check some of these Choice Scarf users with an intact Focus Sash; it also does not give Download Porygon a Special Attack boost, which makes it harder for Porygon to sweep.</p> <p><strong>Trappers</strong>: Diglett, especially Eviolite Diglett, can trap and eliminate Abra with Beat Up or Earthquake. Trapinch can take a hit from Abra and KO it in return while also potentially breaking Focus Sash with Feint. However, they are less reliable against Shed Shell Abra.</p>",
    "sets": {
      "Shed Shell": {
        "description": "<p>Shed Shell mitigates one of the most effective ways to remove Abra in trappers, making it a fearsome offensive threat. Shadow Ball hits Psychic-types like Galarian Ponyta, Natu, and opposing Abra and Frillish. Both Focus Punch and Fire Punch target Steel-types; Focus Punch OHKOes Pawniard, while Fire Punch heavily dents Ferroseed. Substitute takes advantage of Abra forcing switches to give it an extra layer of protection while also making it easier to use Focus Punch. Alternatively, Abra can forgo Substitute and fit both Focus Punch and Fire Punch to be less prediction reliant. Inner Focus helps Abra in the lead matchup by preventing it from flinching due to Mienfoo's Fake Out and letting it potentially set up with Substitute.</p> <p>Abra is best utilized as an early- and mid-game wallbreaker and late-game cleaner. Shed Shell allows Abra to be played more aggressively, as it doesn't have to fear getting trapped. It also lets Abra be utilized as a lead to beat lead Mienfoo, giving insurance if Mienfoo pivots to a trapper. Fighting-types such as Mienfoo and Timburr pressure Steel-types like Pawniard and Ferroseed; in return, Abra handles Poison-types like Foongus, Mareanie, and Koffing. Knock Off support from Mienfoo, Ferroseed, and Pawniard allows Abra to KO foes like Foongus and Mareanie with Psychic; Ferroseed and Pawniard also help check problematic foes like Choice Scarf Porygon. Trappers such as Diglett and Trapinch can remove Pawniard, Ferroseed, and opposing Diglett.</p>"
      },
      "Focus Sash": {
        "description": "<p>Shadow Ball hits opposing Psychic-types and Frillish. Protect blocks Fake Out from Mienfoo and First Impression from Trapinch, preserving Focus Sash and preventing the latter from KOing Abra. Counter synergizes with Focus Sash to potentially revenge kill Pokemon Abra otherwise struggles to KO like Grookey and Pawniard, while Thunder Wave cripples switch-ins like Pawniard and serves as a safety net against Choice Scarf users and setup sweepers.</p> <p>Abra is best utilized as an early- and mid-game wallbreaker and late-game cleaner. It is very important that Focus Sash is preserved until the late-game, as Abra often will be the best option to revenge kill setup sweepers. Fighting-types such as Mienfoo and Timburr complement Abra really well, pressuring Steel-types like Pawniard and Ferroseed; in return, Abra is able to handle Poison-types like Foongus, Mareanie, and Koffing, which limit the effectiveness of the Fighting-types. The aforementioned Poison-types are also solid partners, absorbing priority attacks such as Grookey's Grassy Glide and Timburr's Mach Punch and preserving Abra's Focus Sash. Knock Off support from Mienfoo, Timburr, and Pawniard allows Abra to KO foes like Foongus and Mareanie with Psychic. Trappers such as Diglett and Trapinch can remove Pawniard, Ferroseed, and opposing Diglett. Abra synergizes well with other special attackers like Galarian Ponyta and Porygon to overwhelm opposing Steel-types.</p>"
      },
      "Life Orb": {
        "description": "<p>Life Orb Psychic severely damages most targets. Shadow Ball hits Frillish and opposing Psychic-types. Drain Punch is used with 36 Attack EVs to let Abra lure in and OHKO Pawniard, while Fire Punch 2HKOes Ferroseed. Substitute allows Abra to take advantage of a forced switch and fire off an extra attack while also letting it avoid Pawniard's Sucker Punch. Alternatively, Protect blocks Mienfoo's Fake Out and Trapinch's First Impression and bluffs Abra's Focus Sash set. Inner Focus is a notable alternative over Magic Guard that lets Abra ignore flinch from Mienfoo's Fake Out in the lead matchup and KO it.</p> <p>Life Orb Abra is best utilized as an early- and mid-game wallbreaker, taking advantage of its incredible damage output to weaken opposing defensive cores. However, it should be played carefully, especially against teams with trappers, as Life Orb Abra is incredibly vulnerable to being trapped and removed. Abra fits on Spikes-stacking offense teams, taking advantage of Dwebble's and Ferroseed's Spikes weakening foes into KO range of its powerful attacks. Trappers such as Diglett and Trapinch can eliminate the troublesome Pawniard and Ferroseed, as well as opposing trappers. On less offensive team structures, playing Abra more passively and bluffing Focus Sash can be beneficial, as it causes the opponent to be more cautious. Knock Off absorbers such as Timburr and Mienfoo, as well as defensive cores like Ferroseed + Mareanie and Staryu + Foongus, can help Abra handle opposing Dark-types and Choice Scarf users like Porygon and Vulpix. Grass-resistant foes like Foongus, Koffing, and Ponyta are also appreciated, helping Abra against Grookey. Abra has good synergy with other special attackers like Porygon and Staryu due to their ability to wear down shared checks like Ferroseed and Frillish.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "DC", "user_id": 449990}], "teams": [{"name": "Quality checked by", "members": [{"username": "gali", "user_id": 107567}, {"username": "goldenghost", "user_id": 32350}]}, {"name": "Grammar checked by", "members": [{"username": "dave", "user_id": 192841}, {"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Tentacool": {"sets": {"Defensive Utility": {}}},
  "Ponyta": {
    "comments": "<h1>Other Options</h1> <p>Solar Blade is run on sun teams for its excellent coverage against Water-types and Onix. Hypnosis can completely cripple a single foe, but it is unreliable and Ponyta cannot usually spare a moveslot for it.</p> <h1>Checks and Counters</h1> <p><strong>Trappers</strong>: Ponyta is extremely vulnerable to trappers due to its Ground weakness and only decent bulk. Diglett naturally outspeeds and OHKOes Ponyta, but it is unable to revenge kill if Ponyta has boosted its Speed with Flame Charge. Trapinch survives any one attack and can OHKO Ponyta in return but fears Will-O-Wisp.</p> <p><strong>Onix</strong>: Onix can survive a High Horsepower, takes little from Ponyta's other attacks, and can retaliate with super effective STAB attacks. However, it cannot repeatedly switch into High Horsepower, is crippled by Will-O-Wisp, and does not check Ponyta on sun teams, where it carries Solar Blade.</p> <p><strong>Bulky Water-types</strong>: Water-types such as Staryu, Mareanie, and Frillish are some of the few Fire-resistant foes in the metagame and can force Ponyta out with their super effective STAB attacks. However, all three fear Wild Charge, and Mareanie fears High Horsepower.</p> <p><strong>Chip Damage</strong>: Even with Berry Juice, Ponyta is worn down quickly by a combination of recoil from its attacks, Stealth Rock damage, and priority attacks such as Mienfoo's Fake Out.</p>",
    "sets": {
      "Berry Juice Attacker": {
        "description": "<p>Berry Juice Ponyta is a dangerous wallbreaker with its combination of power, Speed, and coverage. Wild Charge hits Water-types like Staryu, Frillish, and Mareanie for super effective damage. Flame Charge lets Ponyta clean late-game and avoid being revenge killed by Diglett. High Horsepower hits Rock-types such as Onix and Tyrunt, as well as opposing Fire-types. Berry Juice is used to increase Ponyta's longevity, as it is worn down quickly by Stealth Rock and recoil from its attacks. Flame Body punishes priority from foes such as Mienfoo and Grookey and lets Ponyta avoid being walled by Trace Porygon. Flash Fire is a viable alternative that provides Ponyta with a useful Fire immunity that boosts the power of its STAB moves and gives Ponyta an excellent matchup against sun teams.</p> <p>This Ponyta set can be used to wallbreak mid-game or clean late-game, with the latter role mitigating its vulnerability to chip damage. Grookey makes a good partner, as it can check Water- and Ground-types for Ponyta and weaken Diglett's and Trapinch's Earthquakes; it also appreciates Ponyta's breaking through common defensive cores such as Ferroseed + Mareanie. Fast Water-types have good offensive synergy with Ponyta, which handles Grookey for them; Carvanha can lure in exploitable foes such as Ferroseed and safely bring Ponyta in with Flip Turn, while Staryu can threaten foes like Mareanie and Onix and provide Rapid Spin support. Knock Off support from teammates like Mienfoo, Pawniard, and Ferroseed softens checks like Mareanie to help Ponyta sweep late-game. Ponyta is often seen on sun teams together with Vulpix and Charmander, where Ponyta helps to break through the three Fire-types' shared counters with its power and strong coverage. A teammate capable of counter-trapping opposing Diglett, such as Trapinch, Air Balloon Diglett, or Trace Porygon, gives Ponyta much more flexibility against teams using Diglett; an ally Diglett can also trap Staryu and Mareanie. Finally, Natu is a good teammate for its ability to deny Stealth Rock.</p>"
      },
      "Eviolite": {
        "description": "<p>This set combines bulk and Speed to check a variety of threats such as Grookey and Mienfoo. Will-O-Wisp lets Ponyta cripple these foes, as well as common switch-ins like Onix and revenge killers like Trapinch. Morning Sun keeps Ponyta healthy so it can outlast its checks once they have been burned. Flame Charge makes Ponyta difficult to check offensively and neutralizes the threat of Diglett. High Horsepower is an alternative that provides well-rounded coverage against threats like Mareanie and Onix. Flame Body is preferred to punish physical attacks like Mienfoo's Fake Out or U-Turn or Grookey's Grassy Glide.</p> <p>Eviolite Ponyta is one of the metagame's most effective Grookey counters; thus, it pairs well with Grookey-weak teammates like Staryu, Carvanha, and Abra. Grookey takes advantage of the Water- and Ground-types that threaten Ponyta. Staryu can also handle these foes in addition to providing Rapid Spin support. Teammates such as Tyrunt and offensive Porygon appreciate Ponyta spreading burns against foes such as Mienfoo, Grookey, and Onix. Natu helps keep Stealth Rock off the field for Ponyta. Counter-trappers such as Trapinch, Air Balloon Diglett, and Trace Porygon can remove opposing Diglett.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "gali", "user_id": 107567}], "teams": [{"name": "Quality checked by", "members": [{"username": "goldenghost", "user_id": 32350}, {"username": "DC", "user_id": 449990}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Ponyta-Galar": {
    "comments": "<h1>Other Options</h1> <p>Substitute can be used to avoid Sucker Punch and status moves from the likes of defensive Porygon. Berry Juice works well with it, and it removes the need to run Morning Sun. Galarian Ponyta can also make use of its decent Attack stat with powerful moves like Wild Charge, Zen Headbutt, Play Rough, Low Kick, and High Horsepower. Wild Charge targets foes like Natu and Frillish. High Horsepower and Low Kick target Steel-types, OHKOing the troublesome Pawniard after Stealth Rock. However, Play Rough, as well as Dazzling Gleam, provide redundant coverage in practice, with moves like Low Kick covering relevant Dark-types better.</p> <h1>Checks and Counters</h1> <p><strong>Pawniard</strong>: Pawniard is a serious threat to Galarian Ponyta, as it can eliminate it with either Sucker Punch or Knock Off. Galarian Ponyta can deal with Pawniard with its coverage moves like High Horsepower, Low Kick, and Mystical Fire; however, Mystical Fire does activate Pawniard's Defiant.</p> <p><strong>Carvanha</strong>: Carvanha can easily switch into Calm Mind Galarian Ponyta, as it is immune to Psychic, threatens it offensively, and can pivot with Flip Turn.</p> <p><strong>Trappers</strong>: Diglett can trap Galarian Ponyta and threaten it with Earthquake and Beat Up, though it cannot switch in. Trapinch can threaten Galarian Ponyta using priority in First Impression, and its bulk lets it survive most hits from Galarian Ponyta.</p> <p><strong>Special Walls</strong>: Frillish and Munchlax can keep Galarian Ponyta in check and give it a hard time setting up with Calm Mind. Frillish can cripple it with Will-O-Wisp and threaten it with Hex, while Munchlax can set up with Curse and paralyze it with Body Slam.</p> <p><strong>Slowpoke</strong>: Slowpoke resists both of Galarian Ponyta's listed attacks, taking them well even after Calm Mind boosts. Slowpoke can paralyze it with Thunder Wave or pivot to a threat using Teleport.</p>",
    "sets": {
      "Calm Mind": {
        "description": "<p>Thanks to its great Speed and Calm Mind, Galarian Ponyta is a decent special setup sweeper. Calm Mind helps Galarian Ponyta set up on foes like Koffing. Mystical Fire hits Steel-types such as Ferroseed and Pawniard hard, and it also helps Galarian Ponyta set up on special attackers like Natu by lowering their Special Attack. Morning Sun gives Galarian Ponyta good longevity and allows it to set up Calm Mind more easily. Pastel Veil eases set up, especially against Poison-types.</p> <p>Calm Mind Galarian Ponyta is best used late-game as a cleaner. However, its physical bulk isn't good, and therefore it can get easily trapped by the likes of Diglett or removed by strong physical attackers like Grookey. Trapinch is a solid partner, as it can deal with opposing trappers and eliminate troublesome Pawniard. Fighting-types like Mienfoo and Timburr can lure in Poison-types for Galarian Ponyta to eliminate and force out foes like Pawniard, as well as absorb Knock Off for it. Walls like Ferroseed can deal with Dark-types such as Carvanha. Grookey and Pawniard synergize well with Galarian Ponyta by dealing with checks like Frillish, and in return, Galarian Ponyta can pressure Fighting- and Poison-types.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Lialiabeast", "user_id": 564420}], "teams": [{"name": "Quality checked by", "members": [{"username": "gali", "user_id": 107567}, {"username": "goldenghost", "user_id": 32350}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}, {"username": "dex", "user_id": 277988}]}]}
  },
  "Slowpoke": {
    "comments": "<h1>Other Options</h1> <p>Future Sight allows Slowpoke to assist wallbreakers, especially when paired with a teammate like Mienfoo, which lures in Poison-types. Fire Blast hits Grass- and Steel-types, most notably Ferroseed, super effectively.</p> <h1>Checks and Counters</h1> <p><strong>Pawniard</strong>: Pawniard is immune to Psychic and can 2HKO Slowpoke with its powerful Knock Off or set Stealth Rock as it switches out. However, Pawniard can be crippled by Thunder Wave or Scald or removed using Teleport to switch into a trapper.</p> <p><strong>Grookey</strong>: Grookey forces Slowpoke out with its powerful Grass-type STAB attacks. However, it cannot safely switch in on Psychic or Thunder Wave.</p> <p><strong>Ferroseed</strong>: Ferroseed takes almost nothing from Psychic, does not care about Thunder Wave, and can cripple Slowpoke with Knock Off or set up Stealth Rock. It can be taken advantage of with Teleport or hit hard by Fire Blast, however.</p> <p><strong>Strong Special Attackers</strong>: Powerful special attackers like Abra, Download Porygon, and Staryu can 2HKO Slowpoke with coverage options such as Shadow Ball and Thunderbolt. Magnemite also OHKOes it with STAB Thunderbolt. These threats, bar Magnemite, are crippled by Thunder Wave, and Slowpoke can pivot into them if it comes in on a non-super effective attack.</p> <p><strong>Carvanha</strong>: Carvanha is immune to Psychic and can force Slowpoke out with the threat of Crunch. However, it is completely crippled by Thunder Wave.</p> <p><strong>Frillish</strong>: Frillish takes almost nothing from Slowpoke's attacks and threatens back with the combination of Will-O-Wisp + Hex. However, Slowpoke can shrug off a Hex if it is not statused and pivot into a teammate with Teleport.</p>",
    "sets": {
      "Pivot": {
        "description": "<p>Slowpoke is a decent pivot thanks to its great bulk, Regenerator, and Teleport, which allow it to safely bring in a teammate. Psychic hits opposing Poison- and Fighting-types like Koffing and Mienfoo super effectively; Scald is an alternative that can cripple checks like Pawniard and Grookey with a burn. Thunder Wave spreads paralysis against foes such as Abra and Ponyta. The given EV spread ensures that Slowpoke maximizes Regenerator recovery and avoids the OHKO from powerful attacks like Grookey's Grassy Glide and Pawniard's Knock Off.</p> <p>Frail attackers like Ponyta and Choice Scarf Porygon appreciate Slowpoke bringing them in safely with Teleport. Mienfoo synergizes very well with Slowpoke; the two form a strong pivoting Regenerator core, with Mienfoo switching into Knock Off and Slowpoke pivoting into foes like Natu and Ponyta. Bulky Grass-types like Ferroseed and Foongus pair well with Slowpoke; Ferroseed handles strong special attackers like Porygon and Abra, while Foongus is one of the metagame's best Grookey answers. Teleport synergizes well with a trapper like Diglett or Trapinch, allowing Slowpoke's team to safely remove threats like Pawniard and Ferroseed.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "gali", "user_id": 107567}], "teams": [{"name": "Quality checked by", "members": [{"username": "goldenghost", "user_id": 32350}, {"username": "DC", "user_id": 449990}]}, {"name": "Grammar checked by", "members": [{"username": "UT", "user_id": 523866}, {"username": "deetah", "user_id": 297659}]}]}
  },
  "Magnemite": {
    "comments": "<h1>Other Options</h1> <p>Magnemite can run a bulky Magnet Pull set that effectively removes both Ferroseed and Pawniard. This set holds an Eviolite and runs Iron Defense, Charge Beam, Flash Cannon, and Rest. However, it is not very useful outside of this specific role and is usually outclassed by Trapinch.</p> <h1>Checks and Counters</h1> <p><strong>Ground-types</strong>: Ground-types are immune to Magnemite's Electric-type STAB moves, blocking its Volt Switch pivoting, and can OHKO it with their STAB attacks. Diglett and Trapinch can both trap Magnemite while outspeeding it or surviving an attack and OHKOing in return. Mudbray can come in on an Electric-type attack and threaten Magnemite's team with its powerful attacks.</p> <p><strong>Fighting-types</strong>: Fighting-types such as Mienfoo and Timburr OHKO Magnemite with their STAB attacks. They are especially threatening to Berry Juice variants due to Knock Off. However, they don't like taking a hit from Magnemite.</p> <p><strong>Ponyta</strong>: Ponyta outspeeds and OHKOes Berry Juice sets and outspeeds Choice Scarf sets after a Flame Charge. However, it is hit hard by Magnemite's Electric-type STAB attacks.</p> <p><strong>Grass-types</strong>: Grass-types are often an opponent's primary checks to Magnemite thanks to their Electric resistance. Ferroseed resists all of Magnemite's attacks and can force it out with Knock Off, Foongus can put it to sleep with Spore, and Grookey outspeeds and threatens it with Drain Punch. However, Magnemite resists their STAB attacks and can threaten Foongus and Grookey with Steel-type attacks.</p>",
    "sets": {
      "Choice Scarf": {
        "description": "<p>Choice Scarf Magnemite is a powerful hit-and-run attacker that outspeeds almost the entire metagame. Volt Switch punishes opposing switch-ins with chip damage and grabs momentum. Steel Beam is Magnemite's most powerful attack, OHKOing most neutral targets after minimal prior damage. A Timid nature is preferred to ensure Magnemite outspeeds Choice Scarf Porygon. A Modest nature is a viable alternative that increases many of Magnemite's damage rolls. Analytic helps Magnemite punish the switches it forces, especially with Volt Switch.</p> <p>Staryu is a great partner for Magnemite that can switch into Ponyta, Onix, and Mudbray and help wear down shared checks like Ferroseed. Fighting- and Poison-types are already present on most teams and can reliably switch into Magnemite's checks. Frail attackers like Ponyta and Abra appreciate Volt Switch to soften up foes and bring them in safely. This set is very easy to trap with Diglett or Trapinch, especially if it is locked into an Electric-type attack, so be very careful when facing teams with one of these Pokemon; a trapper of your own like Air Balloon Diglett or Trace Porygon thus makes a good partner.</p>"
      },
      "Berry Juice": {
        "description": "<p>Berry Juice Magnemite is a powerful offensive pivot that checks threats such as Porygon and Abra. Volt Switch lets Magnemite escape unfavorable matchups and generate momentum using its survivability and the switches it forces. Flash Cannon doesn't force Magnemite out and prevents Ground-types from freely switching in. Recycle in tandem with Berry Juice allows Magnemite to fully heal continually, giving it nearly unmatched longevity. Endure lets it survive any hit when chip damage deactivates Sturdy. Reaching 1 HP with either Endure or Sturdy activates Berry Juice, fully healing Magnemite and reactivating Sturdy. Recycle lets these cycles be used continually. Steel Beam is Magnemite's strongest attack, OHKOing almost everything that doesn't resist it, and its recoil can be mitigated by Berry Juice. Thunderbolt gives Electric-type coverage without forcing a switch and is slightly stronger than Flash Cannon.</p> <p>Fighting- and Poison-types such as Mienfoo and Koffing are mandatory in order to absorb Knock Off for Magnemite, which makes Recycle fail. Staryu checks Ponyta and Mudbray and can remove Stealth Rock. Grookey is an excellent partner; it shares several Magnemite checks such as Ferroseed and Ponyta, can keep its Sturdy intact with Grassy Terrain, and can check Ground-types. Frail attackers such as Ponyta and Abra appreciate Magnemite getting them in safely with Volt Switch.</p>"
      },
      "Trapper": {
        "description": "<p>This Magnemite set traps and sets up on the common Ferroseed, serving as a wincon. Substitute allows it to safely activate Salac Berry. Charge Beam boosts Magnemite's Special Attack and is weak enough to boost all the way to +6 before KOing Ferroseed. Flash Cannon provides almost perfect neutral coverage and OHKOes anything that doesn't resist it when boosted to +6. Rest allows Magnemite to PP stall Ferroseed and stay healthy for an eventual sweep.</p> <p>Pokemon that can lure in Ferroseed, such as Porygon, Abra, and Water-types, are essential partners for setting up a Magnemite sweep; even if it is unable to fully sweep, these Pokemon appreciate Ferroseed being removed. Eviolite Diglett can reliably switch into Ferroseed, provide Memento support to ensure Ferroseed cannot break Magnemite's Substitute, break opposing Abra's Focus Sash, and guarantee Stealth Rock against teams with Natu. This set struggles against Pawniard teams, so your team should prepare to handle Pawniard by bringing a Fighting-type such as Mienfoo.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "gali", "user_id": 107567}], "teams": [{"name": "Quality checked by", "members": [{"username": "DC", "user_id": 449990}, {"username": "goldenghost", "user_id": 32350}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}, {"username": "DC", "user_id": 449990}]}]}
  },
  "Farfetch’d-Galar": {
    "sets": {
      "Choice Scarf": {"description": "<p>Final Gambit gives Galarian Farfetch'd a unique niche on teams with Mienfoo. If it can't clean late-game with its powerful STAB Close Combat, good coverage, and Choice Scarf, Final Gambit lets it remove a check for another teammate to sweep. Final Gambit, with this EV spread, OHKOes Mareanie after Stealth Rock, Koffing, and Mienfoo, three potential checks to Galarian Farfetch'd; however, it should be used carefully to avoid a disadvantageous trade. Natu is a very effective team partner for Galarian Farfetch’d, able to block entry hazards with Magic Bounce to allow a full strength Final Gambit. Natu, and other Pokemon checked by Steel-types like Abra, Staryu, and Porygon, all appreciate Galarian Farfetch’d pressuring Steel-types. They can pressure Poison-types in return.</p>"},
      "Life Orb": {"description": "<p>When equipped with a Life Orb, Galarian Farfetch'd is an incredibly strong wallbreaker that can defeat common Fighting-type switch-ins due to its sheer power. Knock Off weakens switch-ins such as Koffing and Mareanie, leaving them vulnerable to be 2HKOed by Close Combat after slight chip damage. Brave Bird hits Fighting-types, Larvesta, and Foongus. Quick Attack can finish off low health, faster Pokemon such as Focus Sash Abra brought down to 1 HP, as well as low health Diglett, and Carvanha. Galarian Farfetch'd can form a Fighting spam core with Mienfoo or Timburr to help break down opposing Fighting-type checks, such as Koffing. Pivots such as Larvesta and Trace Porygon can use U-turn or Teleport, respectively, to get Galarian Farfetch'd onto the field to fire off its powerful attacks, as well as helping with its lack of defensive utility.</p>"}
    },
    "credits": {"writtenBy": [{"username": "yellowfin", "user_id": 416460}, {"username": "Shandeur", "user_id": 580548}], "teams": [{"name": "Quality checked by", "members": [{"username": "DC", "user_id": 449990}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Shellder": {
    "sets": {"Shell Smash": {"description": "<p>Shellder is a niche Shell Smash user in LC. Skill Link is what makes Shellder a powerful force, turning Icicle Spear and Rock Blast into threatening moves. After using Shell Smash, Ice Shard allows Shellder to preempt Grookey, which would otherwise KO it with its own priority in Grassy Glide. Liquidation prevents Steel-types such as Pawniard and Magnemite from checking Shellder. Protect defends Shellder against Mienfoo's Fake Out and Trapinch's First Impression. An Adamant nature maximizes the chance of KOing Grookey with Ice Shard, and an Impish nature makes setting up easier for non-Ice Shard sets. Diglett is an amazing partner for Shellder, as it traps and removes troublesome Steel-types like Magnemite; Diglett can also run Memento, giving Shellder a great chance to come in safely and start setting up. Knock Off users such as Mienfoo and Grookey can remove Eviolite from defensive Pokemon for Shellder.</p>"}},
    "credits": {"writtenBy": [{"username": "Lialiabeast", "user_id": 564420}], "teams": [{"name": "Quality checked by", "members": [{"username": "Fiend", "user_id": 208173}, {"username": "Berks", "user_id": 255030}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Onix": {
    "comments": "<h1>Other Options</h1> <p>Body Press hits Ferroseed harder than Onix's other moves, as well as Porygon on sets without Dragon Dance, but beware that it does not pair well with Weak Armor's Defense drops. Taunt completely shuts down Koffing and certain setup sweepers like Shellos. Protect lets Onix use Grassy Terrain to heal off Stealth Rock damage and also helps the matchup against Mienfoo by punishing High Jump Kick.</p> <h1>Checks and Counters</h1> <p><strong>Trappers</strong>: Trapinch and Diglett trap and KO Onix effectively, and Trapinch especially has enough bulk to switch into it. Diglett can run Earth Power to avoid triggering Weak Armor. However, neither can OHKO Onix with Earthquake, and Diglett loses to +1 Dragon Dance Onix.</p> <p><strong>Staryu</strong>: Staryu outspeeds Onix, OHKOes it easily, and removes Stealth Rock with Rapid Spin. However, Staryu is not quite bulky enough to switch into Onix without Eviolite consistently, and it can be overpowered by Dragon Dance Head Smash sets.</p> <p><strong>Fighting-types</strong>: Bulky Fighting-types like Mienfoo and Timburr give Onix trouble by switching into its moves well and threatening with a super effective STAB move or Knock Off. Timburr additionally can revenge kill a weakened Onix with Mach Punch. Both can be worn down without Eviolite, though, and broken through by Dragon Dance sets.</p> <p><strong>Bulky Grass-types</strong>: Ferroseed and Foongus are bulky Grass-types that can switch into Onix with relative ease and OHKO it with Giga Drain. Both can take advantage of forcing Onix out by setting hazards and spreading status with Thunder Wave and Spore, respectively. However, both Grass-types can be worn down and overwhelmed, especially by Dragon Dance sets, without their Eviolite.</p> <p><strong>Grookey</strong>: Grookey can almost always revenge kill Onix with Grassy Glide and can take advantage of a forced switch with Knock Off, U-turn, and Swords Dance. Grassy Terrain also significantly weakens Onix's Earthquake. However, Grookey cannot reliably switch in to Onix, as it takes heavy damage from Onix's Rock-type moves.</p> <p><strong>Strong Special Attackers</strong>: Though foes like Porygon and Abra cannot switch into Onix well, both threaten to KO it with their powerful attacks. Porygon especially can OHKO with Ice Beam and use Onix to reliably boost its Special Attack with Download.</p>",
    "sets": {
      "SturdyJuice": {
        "description": "<p>Onix is both a reliable Stealth Rock setter and an excellent safety net against threatening foes like Ponyta and Tyrunt. High Horsepower is the STAB move of choice when Onix is paired with Grookey. Onix is an excellent Stealth Rock user because of its Speed, bulk, and ability to threaten Natu. Explosion does major damage to neutral foes and can be used to prevent setup from the likes of Porygon and Grookey or recovery from Timburr's Drain Punch. Endure lets Onix guarantee recovery with Berry Juice after it has taken chip damage. Sturdy and Berry Juice pair excellently, allowing Onix to take powerful hits and heal to full.</p> <p>Onix pairs well with teammates that want to guarantee Stealth Rock against Natu. Ferroseed is a valuable partner that can switch into Water-types, Abra, and Porygon, while Onix can switch into Ponyta and Koffing and allow it to run Spikes. Grookey is a strong teammate because it needs Stealth Rock support to beat Natu and benefits from Onix handling Ponyta, though it does necessitate the use of High Horsepower over Earthquake. Frillish handles threatening attackers like Staryu and Porygon well. Bulky Poison-types like Koffing and Mareanie handle Fighting-types well, and Koffing and Foongus check Grookey. Natu reliably switches into Grass-types and Mudbray.</p>"
      },
      "Dragon Dance": {
        "description": "<p>Dragon Dance Onix is a dangerous sweeper that outspeeds most common Choice Scarf users at +1 and uses its bulk to set up on common foes like Koffing and Choice-locked Porygon. Head Smash can overwhelm even bulky foes like Staryu at +1. High Horsepower should be used if paired with Grookey. Explosion lets Onix heavily damage foes it cannot OHKO, such as Timburr. This set can run Stealth Rock for role compression, as Onix is still an effective setter.</p> <p>This set wants teammates that can handle the foes it cannot reliably break through, such as Ferroseed, Foongus, Timburr, and Grookey. Koffing can check both Grass-types and Fighting-types and deny Regenerator recovery for Foongus and Mienfoo, wearing them down. Trapinch and Focus Sash Diglett can sometimes trap Grookey, though Grookey often runs Protect to deny Trapinch's First Impression. Knock Off support from Mienfoo, Ferroseed, Mareanie, and Pawniard helps soften foes into KO range at +1. This set is still bulky and can form a solid defensive core with Frillish and Ferroseed.</p>"
      },
      "Weak Armor": {
        "description": "<p>Weak Armor Onix is a defensive stalwart that reliably sets Stealth Rock while also checking Koffing and Ponyta well. High Horsepower is the STAB move of choice when paired with Grookey. Onix is a great Stealth Rock setter because of its ability to threaten Natu, which might otherwise deny hazards with Magic Bounce. Explosion lets Onix deal heavy damage, especially against bulky foes like Timburr and Foongus. Weak Armor lets Onix switch into physical threats like Ponyta and outspeed them after taking a hit.</p> <p>This set is beneficial to teammates that need reliable Stealth Rock setting, especially against Natu. Grookey and Abra appreciate this, as Stealth Rock lets both handle Natu more reliably, though the former necessitates the use of High Horsepower. Ferroseed appreciates Onix handling Koffing, Ponyta, and Natu, and it in turn handles Staryu, Porygon, and Frillish for Onix. Onix's Stealth Rock also allows Ferroseed to run Spikes. Frillish also handles special attackers like Staryu and Porygon well. Foongus and Koffing check Grookey and Fighting-types, and Koffing can also threaten Ferroseed and Foongus. Natu can switch into Mudbray, Ferroseed, and Foongus reliably.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "goldenghost", "user_id": 32350}], "teams": [{"name": "Quality checked by", "members": [{"username": "DC", "user_id": 449990}, {"username": "gali", "user_id": 107567}]}, {"name": "Grammar checked by", "members": [{"username": "DC", "user_id": 449990}]}]}
  },
  "Lickitung": {"sets": {"Defensive": {}}},
  "Koffing": {
    "comments": "<h1>Other Options</h1> <p>Thief allows Koffing to recover its Eviolite if it takes Knock Off and make progress against checks like Frillish and Natu. Memento on offense teams allows Koffing to support teammates such as Tyrunt. Clear Smog prevents setup sweepers like Galarian Ponyta from setting up on Koffing. Levitate is a niche option on teams that are weak to Ground-types, but it is almost never worth sacrificing the ability to force progress against Mienfoo.</p> <h1>Checks and Counters</h1> <p><strong>Chip Damage</strong>: Koffing's lack of reliable recovery leaves it vulnerable to being worn down throughout a match by Stealth Rock damage and repeatedly switching into foes such as Mienfoo and Grookey. Pain Split partially mitigates this weakness, but it is unreliable at healing Koffing.</p> <p><strong>Mudbray</strong>: Mudbray forces Koffing out with the threat of Earthquake, taking a chunk out of a teammate or setting Stealth Rock; the RestTalk set can switch in with near impunity. However, Mudbray can be worn down with Fire Blast and is crippled by Will-O-Wisp.</p> <p><strong>Psychic-types</strong>: Abra, Natu, and Galarian Ponyta force Koffing out with the threat of Psychic; the latter can also set up on Koffing. However, none of them can safely switch into Koffing, and Neutralizing Gas breaks Abra's Focus Sash if Stealth Rock is up.</p> <p><strong>Rock-types</strong>: Onix and Tyrunt resist all of Koffing's attacks and threaten it with Earthquake and Psychic Fangs. They can both set up with Dragon Dance, and Onix can set Stealth Rock. However, both can be crippled with Will-O-Wisp.</p> <p><strong>Porygon</strong>: Porygon can OHKO Koffing with Psychic and severely dent it with its other attacks. Agility sets can also set up on Koffing. However, Neutralizing Gas prevents Porygon's Download from activating, and it will not activate if Porygon KOes Koffing.</p> <p><strong>Frillish</strong>: Frillish shrugs off Koffing's attacks and can heal off any damage or chip Koffing with its STAB attacks. However, Koffing can 2HKO with Thunderbolt if Frillish has been chipped or had its Eviolite removed.</p>",
    "sets": {
      "Tank": {
        "description": "<p>Koffing is Little Cup's premier physical tank. It can counter dangerous threats like Mienfoo and Grookey with its combination of good bulk, useful defensive typing, and Neutralizing Gas while opening up holes in opposing teams with its excellent coverage. Sludge Bomb is a powerful and reliable STAB move that can further chip foes with its high poison chance. Fire Blast is often Koffing's best midground attack, hitting Steel-types such as Ferroseed and Pawniard super effectively and doing decent damage to Ground-types like Mudbray and Eviolite Diglett. Will-O-Wisp cripples many of Koffing's best answers, such as Natu and Tyrunt, as well as generally good threats such as Mienfoo. Thunderbolt hits common switch-ins like Mareanie, Staryu, and Natu for super effective damage. Pain Split allows Koffing to stay healthy enough to repeatedly check foes like Mienfoo, and it's often the most reliable way of damaging bulky foes like Frillish. Neutralizing Gas denies Regenerator recovery from foes such as Mienfoo and Mareanie, allowing it to consistently make progress, while also making it immune to trapping. 156 Speed EVs allow Koffing to outspeed opposing Mareanie. Koffing can viably run a range of EV spreads, like a bulkier spread with HP investment or maximum Speed to tie Pawniard.</p> <p>Koffing's ability to make progress against Mienfoo is invaluable to a wide range of teammates, from Steel-types such as Pawniard and Ferroseed to sweepers like Carvanha and Swords Dance Grookey. Grookey in particular makes an excellent partner for Koffing; it handles opposing Ground-types and Frillish while providing passive recovery, while Koffing can check opposing Poison-types and wallbreak. Steel-types like Ferroseed and Pawniard are important teammates for switching into opposing Psychic-types and Porygon. Natu can switch into opposing Natu and Mudbray and serve as a secondary Grookey check. Pokemon that can check Ground- and Rock-types, such as Staryu, also make great teammates. Onix has good defensive synergy with Koffing and can sweep teams when opposing Mienfoo are weakened.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "gali", "user_id": 107567}], "teams": [{"name": "Quality checked by", "members": [{"username": "goldenghost", "user_id": 32350}, {"username": "DC", "user_id": 449990}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}, {"username": "DC", "user_id": 449990}]}]}
  },
  "Staryu": {
    "comments": "<h1>Other Options</h1> <p>Staryu can run a Life Orb set to take advantage of its power and coverage, but it is extremely frail and vulnerable to being trapped by Diglett. Flip Turn or Teleport can be used to pivot out of unfavorable matchups; Flip Turn deals chip damage, while Teleport ensures that Staryu's teammate gets in unscathed. Finally, Staryu can serve as a dual screens setter on hyper offense, taking advantage of its higher Speed than other common setters like Natu.</p> <h1>Checks and Counters</h1> <p><strong>Ferroseed</strong>: Ferroseed resists all of Staryu's attacks bar Ice Beam and can set up Stealth Rock on it or cripple a teammate with Thunder Wave. However, it can be worn down throughout a match, especially if paired with a powerful special attacker like Abra or Porygon.</p> <p><strong>Grookey</strong>: Grookey threatens to OHKO Staryu with Grassy Glide and can set up Swords Dance while forcing it out. However, it is severely damaged by Ice Beam and fears being burned by Scald.</p> <p><strong>Foongus</strong>: Foongus freely switches into Staryu's STAB attacks, heals off any damage with Regenerator, and can deal heavy damage with Giga Drain or cripple one of Staryu's teammates with Spore. However, Analytic Staryu can 2HKO it with Ice Beam or Psychic.</p> <p><strong>Frillish</strong>: Frillish shrugs off most of Staryu's attacks and can heal off any damage or threaten Staryu with Will-O-Wisp + Hex. It can completely shut down Staryu with Cursed Body. However, it can be 2HKOed with prior damage or if it switches into an Analytic-boosted Thunderbolt with Stealth Rock up.</p> <p><strong>Electric-type Attacks</strong>: Electric-type STAB attacks from foes such as Magnemite can OHKO Staryu, while coverage moves such as Ponyta's Wild Charge and opposing Staryu's Thunderbolt can make it tough for Staryu to check these foes.</p> <p><strong>Diglett</strong>: Diglett can trap and remove a weakened Staryu with Earthquake, or it can guarantee an OHKO with Final Gambit and minimal prior damage. However, it cannot switch into Staryu safely and cannot revenge kill if it has a Rapid Spin Speed boost.</p>",
    "sets": {
      "Offensive": {
        "description": "<p>Staryu is one of Little Cup's few viable offensive Water-types thanks to its high Speed, good coverage, and reliable recovery. Thunderbolt hits Water-types like Mareanie, Frillish, and opposing Staryu, as well as Natu, for super effective damage. Ice Beam hits opposing Grass-types and is Staryu's best option against Ferroseed, while Psychic instead hits opposing Mienfoo and Poison-types super effectively. This set can run Rapid Spin over one of its coverage attacks, letting Staryu support its teammates with entry hazard control or act as a cleaner. Analytic lets Staryu deal extra damage to switch-ins, most notably netting a 2HKO on Foongus, as well as Frillish after Stealth Rock.</p> <p>Offensive Staryu is a useful soft check to a wide range of foes, from passive special attackers like Natu and Mareanie to dangerous offensive threats like Mudbray and Ponyta. A reliable answer to bulky Grass-types like Ferroseed and Foongus is important for Staryu to be effective; Natu is a great teammate because it handles both of these threats. Ponyta has great offensive and defensive synergy with Staryu; it handles Grass-types, while Staryu takes care of Water-types and Onix. Trapinch can trap and remove Ferroseed. Fire-weak teammates like Ferroseed and Pawniard appreciate Staryu's ability to switch into opposing Ponyta. Poison-types like Koffing and Foongus can handle Grookey, while Staryu checks opposing Ground-types. If running Rapid Spin, Larvesta makes an ideal teammate, handling Grass-types and benefitting from Staryu keeping Stealth Rock off the field.</p>"
      },
      "Defensive": {
        "description": "<p>Defensive Staryu is a reliable entry hazard remover and answer to opposing Water- and Ground-types. If teammates adequately handle Water-types, Thunder Wave can be run over Thunderbolt to cripple threats like opposing Staryu and Abra. 116 HP EVs let Staryu more reliably check threats such as Natu if Stealth Rock is up, as well as avoid the OHKO from Diglett's Final Gambit. Natural Cure gives Staryu a pseudo-immunity to status from foes like Frillish and from attacks like Scald and Sludge Bomb.</p> <p>This set removing Stealth Rock helps teammates like Ponyta. Larvesta in particular makes a fantastic teammate; it needs Stealth Rock off the field to be effective and is one of the best counters to Grass-types in the metagame, while Staryu can handle opposing Water-types. Koffing checks Grass-types and Mienfoo while benefiting from Staryu spinning and checking Ground-types. Natu works in tandem with Staryu to keep entry hazards off the field and can check Ferroseed, Foongus, and Grookey.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "gali", "user_id": 107567}], "teams": [{"name": "Quality checked by", "members": [{"username": "goldenghost", "user_id": 32350}, {"username": "DC", "user_id": 449990}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Porygon": {
    "comments": "<h1>Other Options</h1> <p>Shadow Ball hits Psychic-types and Frillish hard while dealing decent damage to Ferroseed.</p> <h1>Checks and Counters</h1> <p><strong>Steel-types</strong>: Steel-types like Pawniard, Ferroseed, and Magnemite resist Porygon's best moves and threaten it back with some combination of Knock Off, Thunder Wave, and offensive pressure. Berry Juice Pawniard and Magnemite are especially effective at absorbing hits. However, Pawniard and Ferroseed can be worn down, especially by the right coverage moves and given their lack of reliable recovery, and Magnemite is frail without Berry Juice. All three also must be wary of trappers.</p> <p><strong>Frillish</strong>: Frillish is immune to Tri Attack, does not fear Ice Beam or Psychic, has tremendous special bulk, and cannot be trapped, giving it an excellent matchup against offensive Porygon. It can be beaten by Thunderbolt, though, if it has lost its Eviolite.</p> <p><strong>Munchlax</strong>: Munchlax easily tanks Porygon's attacks, outheals its damage with Recycle and Berry Juice, and threatens it back with Body Slam and Curse. It cannot check Porygon if it loses Berry Juice to Knock Off, though, and Trapinch can remove it.</p> <p><strong>Denying Download Boosts</strong>: Often, the most effective way to limit offensive Porygon is by using EV spreads providing higher Special Defense than Defense, which make Download give useless Attack boosts. Several offensive threats such as Abra, Diglett, Ponyta, and Galarian Ponyta do this by default. Though not standard, some bulky Pokemon like Foongus, Ferroseed, and Ponyta can afford such an EV spread to reduce Porygon's effective points of entry.</p>",
    "sets": {
      "Defensive": {
        "description": "<p>Trace and great natural bulk allow Porygon to serve as one of the tier's best walls. Teleport lets Porygon use its bulk to safely pivot in offensive threats. The choice of coverage move depends on what you prefer to check; Ice Beam hits a wider swath of the tier for neutral damage and hits Diglett and Trapinch super effectively, while Psychic threatens Poison-types. Thunder Wave shuts down would-be threats, almost none of which can OHKO Porygon, including opposing Porygon, Galarian Ponyta, and Abra. Trace lets Porygon shut down Flash Fire Ponyta, switch into Regenerator users like Mareanie and Foongus consistently, and counter-trap Diglett and Trapinch. The given defensive investment lets Porygon take hits from powerful threats like Life Orb Abra, Download Porygon, and Flame Body Ponyta.</p> <p>This set is a defensive jack-of-all-trades that can soft check many threats. Abra and Ponyta appreciate it counter-trapping Arena Trap users. Both Cosmic Power and Calm Mind Natu appreciate Porygon's ability to spread paralysis, especially against Pawniard. Porygon is vulnerable to Fighting-types like Mienfoo and Timburr and thus partners well with Poison-types like Koffing and Mareanie. Pawniard and other Knock Off users can also limit Porygon's effectiveness, but they fear Thunder Wave and can be pivoted into by Mienfoo or trapped by Trapinch and Diglett.</p>"
      },
      "Agility": {
        "description": "<p>Agility Porygon trades immediate offense for sweeping prowess. Porygon's bulk allows it to set up against weaker foes like Mareanie and Natu. Eviolite + Recover strengthens this ability, though offensive support is mandatory to cover for the reduced coverage. Ice Beam hits Ferroseed and most of the tier for strong neutral damage while hammering bulky foes like Mudbray and Onix. Psychic cleans through Mienfoo and weakened Poison-types. Berry Juice frees Recover's moveslot for another coverage move, like Thunderbolt, which stops healthy Pawniard and Frillish from preventing a sweep. However, it makes Porygon more vulnerable to Knock Off from Mareanie and strong priority from Grookey. Maximum Speed investment lets Porygon outspeed Choice Scarf Mienfoo and Vulpix after Agility.</p> <p>This set pairs well with special attackers like Abra, Natu, and Galarian Ponyta, which pressure Pawniard and Ferroseed, and it often relies on them wearing down its checks early- and mid-game. Knock Off users like Mienfoo, Pawniard, and Mareanie can remove Eviolite and bring important targets like Mienfoo and Poison-types into OHKO range. Pawniard, Ferroseed, and Frillish make sweeping difficult by taking Porygon's attacks well. Trapinch and Diglett can weaken or eliminate the Steel-types, while Grookey can make progress against Frillish teams. Diglett can also use Memento to guarantee a safe Agility for Porygon.</p>"
      },
      "Choice Scarf": {
        "description": "<p>Porygon is the tier's most effective Choice Scarf user because of its great damage output and coverage moves, which let it effectively clean up weakened teams. Tri Attack is Porygon's strongest choice, while Ice Beam is often most spammable, dealing a chunk of damage to Ferroseed and hitting other neutral targets hard with a Download boost. Both attacks carry a status chance, which sometimes lets Porygon bypass its checks. Thunderbolt is Porygon's best option to hit Pawniard and Frillish. Psychic threatens Mienfoo and Poison-types, OHKOing the former's standard set at +1. Trick is an alternative that trades Porygon's Speed to limit defensive checks like Ferroseed and Frillish in certain matchups.</p> <p>This set has tremendous synergy with other fast special attackers like Abra, Natu, and Galarian Ponyta by pressuring their shared checks like Pawniard and, in Abra's case, Ferroseed. Mienfoo is an effective partner because it can freely use Knock Off to weaken bulky foes into OHKO range and, with U-turn, can pivot on exploitable Poison-types it lures in like Koffing. Mienfoo also switches into and threatens defensive Porygon checks like Pawniard, Frillish, and the special sponges Ferroseed and Munchlax. Trapinch and Diglett can trap Steel-types and Munchlax, although foe Trapinch and Diglett deter and punish Porygon's Thunderbolt. Grookey can effectively punish Frillish.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "goldenghost", "user_id": 32350}], "teams": [{"name": "Quality checked by", "members": [{"username": "DC", "user_id": 449990}, {"username": "gali", "user_id": 107567}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}, {"username": "CryoGyro", "user_id": 331519}]}]}
  },
  "Omanyte": {
    "overview": "<p>Omanyte is a powerful setup sweeper in LC thanks to Shell Smash and a very good movepool that allows it to hit almost every Pokemon super effectively. It also works very well as an entry hazard setter, providing Stealth Rock and Spikes support. Omanyte's typing and bulk allow it to switch into prominent metagame forces like Choice-locked Vulpix and boost its stats or set entry hazards. However, Omanyte's viability is severely hindered by the presence of Grookey and Timburr, which can easily remove it with strong priority moves.</p>",
    "comments": "<h1>Other Options</h1> <p>Omanyte can run Rock Blast on the Shell Smash set with a different EV spread of 36 Atk / 36 Def / 196 SpA / 236 Spe and a Rash nature to deal with Focus Sash Abra; however, dropping a less niche coverage move is not ideal. Scald is an option on the entry hazard set to potentially burn switch-ins such as Staryu and Ferroseed, although it is inconsistent and significantly weaker than Hydro Pump. Substitute helps Shell Smash Omanyte avoid status and provides safer opportunities to set up, while Protect allows Omanyte to ignore Fake Out and First Impression and punish High Jump Kick from Mienfoo.</p> <h1>Checks and Counters</h1> <p><strong>Grass-types</strong>: Grassy Glide from Grookey is Omanyte's greatest threat, and Foongus can prevent the Shell Smash set from setting up while also threatening the entry hazard set; however, both of them dislike Ice Beam or Blizzard on the switch. Ferroseed, on the other hand, can live any hit from Omanyte after Shell Smash and recover all the damage with Giga Drain while also being able to safely switch in against the entry hazard set, making it a very effective counter.</p> <p><strong>Abra</strong>: With Focus Sash, Abra can survive a hit from the Shell Smash set and KO Omanyte thanks to the Special Defense drop. However, Abra needs to be careful of Knock Off.</p> <p><strong>SturdyJuice Users</strong>: Sturdy Magnemite and the rare SturdyJuice Onix can tank any attack from Shell Smash Omanyte at full HP and revenge kill it with super effective attacks. However, they fail to counter it if entry hazards are on the field, unless they're running Endure and have Berry Juice intact. They also can't safely switch into Omanyte due to the threat of Knock Off.</p> <p><strong>Priority Users</strong>: Grookey, Timburr, Pawniard, and Trapinch can easily revenge kill or heavily damage Omanyte after Shell Smash.</p>",
    "sets": {
      "Shell Smash Sweeper": {
        "description": "<h1>Moves</h1> <p>Shell Smash makes Omanyte threatening, doubling both its Special Attack and Speed. Hydro Pump KOes most non-Water-resistant targets and has a high chance to KO foes like Mienfoo after Shell Smash. Surf is an alternative that's more accurate but requires notably more prior damage to get KOs. Ice Beam hits Grass-types like Foongus and Grookey, and it's the best move to hit Ferroseed, as well as being a safer option to hit Natu and Ground-types. Earth Power allows Omanyte to OHKO Mareanie and hit Staryu.</p> <h1>Set Details</h1> <p>A Modest nature is preferred for damage output, as Omanyte does not need a Timid nature to outspeed Choice Scarf users like Mienfoo after Shell Smash. Eviolite and Shell Armor give it more opportunities to set up.</p> <h1>Usage Tips</h1> <p>Omanyte should be used as a late-game sweeper that sets up after its checks and counters are damaged or removed. In particular, Ferroseed, Grookey, and Timburr should be removed, as they can survive a hit and revenge kill Omanyte after Shell Smash. Omanyte's typing doesn't allow it to set up in front of many common Pokemon, but the best ones are Choice-locked Vulpix and Choice-locked Porygon.</p> <h1>Team Options</h1> <p>Trapinch is the best partner on balance teams because it traps and removes Omanyte's strongest counters in Grookey and Ferroseed, as well ass being able to deal with Pawniard. Ponyta is another option to remove these counters. Fighting-resistant foes like Koffing and Foongus, or the more niche Spritzee, help against Mienfoo and especially Timburr with its threatening Mach Punch. Ferroseed is a good counter to Focus Sash Abra and SturdyJuice Magnemite and can cripple them with Knock Off, which is a good move to have on various team members to weaken Staryu and opposing Ferroseed. Omanyte can also fit on dual screens hyper offense teams, usually using Natu as a dual screens setter; common partners on this team structure are Swords Dance Grookey and Pawniard.</p>"
      },
      "Entry Hazard Setter": {
        "description": "<h1>Moves</h1> <p>Hydro Pump is Omanyte's best offensive move, being able to threaten any neutral target after a Speed boost. Knock Off weakens switch-ins that might come in to stop the Shell Smash set, especially bulky ones like Mareanie, Staryu, and Ferroseed. Spikes in combination with Stealth Rock can be very effective at forcing passive damage on the opposing team, especially if Omanyte's partners can prevent or punish entry hazard removal. Blizzard hits Grass-types like Grookey and Foongus on the switch, while Ice Beam is a safer but considerably weaker option. Toxic Spikes helps against hyper offense teams, which rarely use Poison-types.</p> <h1>Set Details</h1> <p>Defense investment with Eviolite allows Omanyte to more easily switch in multiple times, avoiding the OHKO from strong super effective attacks like Earthquake from Life Orb Diglett and High Jump Kick from Eviolite Mienfoo. 13 Speed is enough to outspeed the entire unboosted metagame after a Weak Armor boost, as well as most common Choice Scarf users. The Speed boost provided by Weak Armor allows it to generate offensive pressure or set multiple layers of entry hazards. Another possible EV spread alongside Grookey is 156 HP / 196 SpA / 156 Spe with a Timid nature; it allows Omanyte to survive all the needed hits, like Earthquake from Diglett and Mudbray, under Grassy Terrain while also getting an extra point in Special Attack.</p> <h1>Usage Tips</h1> <p>Omanyte is a common pick on entry hazard-stacking hyper offense teams as a dedicated lead, setting at least Stealth Rock and a layer of Spikes against most opposing leads. It is best utilized early- and mid-game by safely switching into common Pokemon like Choice-locked Vulpix and Porygon to set entry hazards. Omanyte should always get on the field through a pivot move or by switching into a resisted hit, preferably physical attacks to get the Weak Armor boost. If the matchup is not favorable and the opponent can KO Omanyte before it can do anything, the main goal is to try and set one or two layers of Spikes before it's removed from the game.</p> <h1>Team Options</h1> <p>On hyper offense teams, good sweepers and wallbreakers like Grookey, Choice Scarf Mudbray, and Life Orb Abra appreciate Omanyte's ability to set entry hazards and weaken their targets. On balance teams, it needs teammates that can switch into Grookey, so Foongus, Koffing, and Ponyta are good picks. Omanyte also benefits from pivot moves that allow it to come on the field safely, like U-turn from Mienfoo and Volt Switch from Magnemite. Pawniard punishes Defog attempts, while Magnemite, Tyrunt, and Grookey pressure common entry hazard control measures like Natu and Staryu; also, Diglett can trap the latter.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Albi", "user_id": 490348}, {"username": "DC", "user_id": 449990}], "teams": [{"name": "Quality checked by", "members": [{"username": "zizalith", "user_id": 410251}, {"username": "DC", "user_id": 449990}, {"username": "goldenghost", "user_id": 32350}]}, {"name": "Grammar checked by", "members": [{"username": "DC", "user_id": 449990}, {"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Kabuto": {"sets": {"Support": {}}},
  "Chinchou": {"sets": {"Offensive Pivot": {}}},
  "Natu": {
    "comments": "<h1>Other Options</h1> <p>Calm Mind is an option on the bulky attacker set to increase Natu's wallbreaking capabilities and let it OHKO Pawniard at +1. Shadow Ball lets Natu hit opposing Psychic-types super effectively, but it is more situational than Natu's other options. Giga Drain OHKOes the uncommon Onix and is Natu's best option for damaging Mudbray and Staryu. Substitute is a viable option on setup sets, easing prediction and getting around Pawniard's Sucker Punch. Natu can run a Life Orb set on hyper offense teams, but it is usually outclassed by Abra due to the latter's greater Speed and power.</p> <h1>Checks and Counters</h1> <p><strong>Psychic-types</strong>: Opposing Natu are one of the best switch-ins to Natu, blocking Thunder Wave and taking little from its attacks. Abra and Galarian Ponyta can threaten Natu with super effective coverage but fear Thunder Wave. All of these Pokemon are also hit hard by Shadow Ball.</p> <p><strong>Stealth Rock</strong>: Stealth Rock cripples Natu and makes it much harder to switch into opposing threats. However, Magic Bounce allows Natu to prevent foes such as Ferroseed from setting Stealth Rock.</p> <p><strong>Knock Off</strong>: Most Knock Off users can 2HKO Natu, with Pokemon such as Mienfoo and Grookey threatening to OHKO with prior chip damage. Pokemon such as Mareanie and Ferroseed that Natu is supposed to check can deal significant damage with Knock Off.</p> <p><strong>Porygon</strong>: Offensive Porygon outspeeds and OHKOes Natu with its Download-boosted attacks, but it is crippled by Thunder Wave. Defensive Porygon takes little from any of Natu's attacks and copies Magic Bounce with Trace to bounce its Thunder Wave back.</p> <p><strong>Pawniard</strong>: Pawniard OHKOes Natu with its Dark-type STAB attacks and can set up Stealth Rock as it forces Natu out. However, it doesn't like being paralyzed and is 2HKOed by Heat Wave.</p> <p><strong>Onix</strong>: Onix can shrug off Natu's attacks with Berry Juice, force it out with its Rock-type STAB attacks, and set Stealth Rock. However, it must watch out for the uncommon Giga Drain.</p> <p><strong>Electric-type Attacks</strong>: Thunderbolt from foes such as Koffing and Staryu can severely damage Natu, while Electric-types such as Magnemite can OHKO it outright.</p>",
    "sets": {
      "Bulky Attacker": {
        "description": "<p>Natu's good typing, decent bulk, and excellent coverage make it one of Little Cup's premier offensive pivots. Psychic hits Little Cup's myriad of Fighting- and Poison-types for super effective damage. Heat Wave OHKOes Grookey and hits Steel-types like Pawniard and Ferroseed. Roost provides reliable recovery, making it a more effective answer to threats such as Koffing. U-turn helps Natu gain momentum off of the switches it forces, while Thunder Wave cripples common switch-ins like Pawniard and Porygon. Eviolite lets Natu stomach powerful neutral attacks such as Mudbray's Heavy Slam. Magic Bounce blocks Stealth Rock and allows Natu to safely switch into the likes of Ferroseed and Foongus. The EVs prevent Porygon from getting a Special Attack Download boost.</p> <p>While an effective soft check to Fighting- and Poison-types, Natu is not a great switch-in to them, as they can threaten it with Knock Off or, in the case of the latter, poisoning from Sludge Bomb. Poison-types such as Mareanie and Koffing can safely switch into these attacks, while Natu can soft check Psychic-types and Mudbray for them. Steel-types such as Ferroseed and Pawniard can switch into threats such as Porygon and Abra and set up Stealth Rock. Special attackers that struggle to break through Ferroseed such as Abra and Staryu appreciate Natu's ability to switch into it. Fighting-types such as Mienfoo can absorb Knock Off and force out Pawniard and Porygon for Natu.</p>"
      },
      "Setup Sweeper": {"description": "<p>This Natu set sets up on passive foes such as Foongus to sweep the opposing team. Cosmic Power greatly increases Natu's bulk. Stored Power should be used with Cosmic Power for more damage output, but it requires Natu to gain several boosts first. Heat Wave 2HKOes Steel-types. Roost provides recovery, allowing Natu to set up on foes such as Mareanie that cannot 2HKO it.</p> <p>This Natu set greatly appreciates Pawniard and fast Knock Off users such as Mienfoo being removed; Diglett and Trapinch thus make great partners. Mienfoo can absorb Knock Off and lure in opposing Poison-types that Natu can set up on, and it can pivot into Natu with U-turn. Steel-types such as Ferroseed handle opposing Porygon and Abra and support a Natu sweep with Stealth Rock and Thunder Wave. Poison-types such as Koffing and Mareanie handle Mienfoo, ensuring Natu can set up safely.</p>"},
      "Dual Screens Support": {"description": "<p>This Natu set supports its teammates by setting Reflect and Light Screen. Teleport ensures one of Natu's teammates can get into play unscathed after dual screens are set. Thunder Wave cripples opposing setup sweepers trying to take advantage of Natu's passivity. Psychic is a viable option in this moveslot if offensive presence is desired. The given EV spread allows Natu to survive Mienfoo's Knock Off from full health.</p> <p>A suicide lead that can set Stealth Rock, paralyze the foe, and sacrifice itself to get Natu in safely makes a great teammate, as Natu can then ensure dual screens get up. Steel Beam Pawniard and Memento Diglett are good examples of this. Setup sweepers such as Tyrunt and Swords Dance Grookey that appreciate the extra bulk Natu's screens provide make ideal teammates.</p>"},
      "Life Orb": {
        "description": "<p>This set trades support and bulk for immediate offensive presence, turning Natu into a threatening special attacker. With the extra power from Life Orb, Heat Wave cleanly OHKOes most teams' Psychic switch-ins, notably Berry Juice Pawniard and Ferroseed. Sucker Punch can finish off faster targets like Abra, although Natu must be wary of Substitute. Shadow Ball is an option to reliably hit opposing Natu and secure a 2HKO against Frillish. Substitute can help ease predictions after forced switches from Koffing and Ferroseed while also avoiding Sucker Punch from Pawniard.</p> <p>Natu is a good lure to eliminate opposing Steel-types like Pawniard, which helps Abra, Porygon, Carvanha, and Galarian Ponyta by removing their biggest checks. Another form of hazard control like Staryu, Drilbur, or Defog Timburr is helpful since Natu won't be able to effectively deter hazards due to its increased frailty. Faster attackers like Ponyta and Staryu force out Natu, so solid defensive answers like Mareanie and Ferroseed can help check and switch into those threats. Natu also enjoys pivots like Mienfoo to get it in safely because it cannot switch into many hits without taking heavy damage.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "gali", "user_id": 107567}, {"username": "Charis_Akins", "user_id": 588203}], "teams": [{"name": "Quality checked by", "members": [{"username": "DC", "user_id": 449990}, {"username": "goldenghost", "user_id": 32350}, {"username": "Fiend", "user_id": 208173}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}, {"username": "Lunaflare", "user_id": 430518}, {"username": "UT", "user_id": 523866}]}]}
  },
  "Elekid": {"sets": {"Offensive": {}}},
  "Treecko": {"sets": {"Sweeper": {}}},
  "Carvanha": {
    "comments": "<h1>Other Options</h1> <p>Liquidation is stronger than Flip Turn for hyper offense teams, where Carvanha doesn't need to pivot as much. Aqua Jet picks off weakened threats without needing a Speed boost. Destiny Bond over Protect lets Carvanha eliminate a counter such as Ferroseed and Foongus, letting a teammate like Grookey sweep teams. However, losing out on Protect leaves it extremely vulnerable to First Impression and Fake Out. Substitute can ease up prediction, but it forces Carvanha to lose out on coverage. Carvanha can run a special moveset to have a better matchup against Pawniard, but it has to use Hydro Pump for STAB, making it unreliable.</p> <h1>Checks and Counters</h1> <p><strong>Priority</strong>: Priority attacks such as Timburr's Mach Punch and Grookey's Grassy Glide force Carvanha out without letting it use Flip Turn. Other priority users such as First Impression Trapinch and Fake Out Mienfoo forces Carvanha to use Protect, letting smart opponents double switch on the Protect into a teammate that threatens Carvanha out.</p> <p><strong>Ferroseed and Pawniard</strong>: Ferroseed can take a few hits from Carvanha and weaken it down with Iron Barbs. Pawniard can take Carvanha's hits but can be worn down by repeated Flip Turns.</p> <p><strong>Bulky Foes</strong>: Mienfoo, Foongus, and Mareanie have high physical bulk and take on Carvanha well, but they must worry about Psychic Fangs and are OHKOed without Eviolite. They also have to worry about Flip Turn into Koffing, which blocks their recovery from Regenerator.</p>",
    "sets": {
      "Physical Sweeper": {
        "description": "<p>Carvanha is a good wallbreaker and late-game cleaner thanks to its high Attack, Speed Boost, and almost unresisted STAB combination, outspeeding fast Pokemon like Abra, Diglett, and Choice Scarf Porygon after a Speed boost. Flip Turn lets Carvanha pivot out against Pokemon it can't OHKO like Mienfoo, Pawniard, and Porygon while still wearing its foes down. Crunch hits a majority of the metagame for at least neutral damage. Psychic Fangs is important coverage against Mienfoo and Poison-types like Foongus and Koffing, allowing Carvanha to OHKO them after Knock Off or prior chip damage. Protect guarantees a Speed Boost activation and blocks Fake Out and First Impression from Pokemon like Mienfoo and Trapinch. 9 HP IVs give Carvanha 1 HP recoil from Life Orb and 36 Special Defense EVs make Porygon's Download boost its Attack rather than its Special Attack.</p> <p>Carvanha's frailty means that it benefits greatly from teammates that switch into its checks well. Koffing is a fantastic partner, as it switches very well into Mienfoo's and Grookey's attacks, and its Neutralizing Gas negates Mienfoo's Regenerator, helping Carvanha wear it down. Larvesta is also a great switch-in to both, punishing them with Flame Body, and can pivot Carvanha in safely with a slow U-turn. It also helps against Ferroseed and Pawniard. Trapinch traps and revenge kills non-Protect Grookey with First Impression, and it can take out Pawniard or a weakened Ferroseed with Superpower. Natu checks Ferroseed, Foongus, and Mareanie, forcing them out and pivoting Carvanha in safely. Knock Off support from Mienfoo, Ferroseed, and Pawniard can remove Eviolite from Mienfoo and Poison-types to let Carvanha OHKO those threats. Entry hazard support from Dwebble and Ferroseed wears down Pokemon that can usually take a hit from Carvanha, like Mienfoo, Foongus, and Ferroseed, with the latter also checking Porygon.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "romanji", "user_id": 524894}], "teams": [{"name": "Quality checked by", "members": [{"username": "goldenghost", "user_id": 32350}, {"username": "DC", "user_id": 449990}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Trapinch": {
    "comments": "<h1>Other Options</h1> <p>Crunch hits Natu hard, which can otherwise set up or gain momentum by pivoting. Rock Slide hits Natu as well as Larvesta, though Larvesta will usually exit with U-turn. Giga Drain OHKOes Onix and helps preserve Trapinch's health against opposing Trapinch and Diglett. Protect can be used to scout Choice item attackers like Porygon, and it also blocks Fake Out, First Impression, and Onix's Explosion.</p> <h1>Checks and Counters</h1> <p><strong>Grookey</strong>: Grookey can take advantage of Trapinch to get easy turns for Knock Off, U-turn, or even Swords Dance. Grassy Terrain also weakens Earthquake, sometimes preventing key KOs against Grookey's teammates. Grookey must fear First Impression, though almost all Grookey run either Protect or enough bulk to survive one hit.</p> <p><strong>Natu</strong>: Natu fears almost none of Trapinch's attacks, cannot be trapped, and can make progress with its attacks and U-turn. It can sometimes even go for the win with Calm Mind or Cosmic Power, which Trapinch can do little to stop. The niche Crunch and Rock Slide are options to hit it.</p> <p><strong>Foongus</strong>: Foongus is difficult to trap and can punish Trapinch by putting one of its teammates to sleep with Spore. Trapinch can outspeed Foongus, though, and deal heavy damage once Foongus has lost its Eviolite.</p> <p><strong>Water-types</strong>: Staryu and Frillish force out Trapinch with their STAB moves and can make progress with their coverage moves or by spreading burns; Frillish also cannot be trapped. Staryu can sometimes be picked off at low health with First Impression, though this is rare because Staryu can recover.</p> <p><strong>Chip Damage</strong>: As Trapinch is slow, it relies on its bulk to trap key foes, and not staying healthy can prevent it from performing its role. Trapinch must be selectively deployed, as trapping Pawniard or Diglett will prevent it from later trapping Ponyta or Tyrunt and vice versa. Onix, for example, can't escape Trapinch but can use Explosion to chip it.</p>",
    "sets": {
      "Trapper": {
        "description": "<p>Trapinch is a bulky trapper that can guarantee KOs on important defensive foes, like Pawniard and Ferroseed, while also providing a safety net against fearsome attackers like Ponyta, Diglett, and Tyrunt. First Impression is powerful priority that hits Galarian Ponyta, Grookey, and Abra super effectively and also picks off other weakened threats, though beware that many of these foes run Protect to block it. Superpower OHKOes Pawniard and does heavy damage to Ferroseed, Porygon, and Munchlax. Feint lets Trapinch secure KOs on Focus Sash Abra and occasionally beat Protect users. Trapinch's EV spread is highly customizable depending on what its team needs; the given investments let it outspeed most Ferroseed and Foongus while providing decent mixed bulk. A spread with 156 HP and 236 Defense EVs and an Impish nature lets Trapinch reliably switch into and beat Pawniard, while 156 HP and 156 Special Defense EVs with a Careful nature lets it survive +1 Ice Beam from Porygon.</p> <p>Porygon, Frillish, and Psychic-types appreciate Trapinch reliably trapping Steel-types; special attackers also benefit from it trapping Munchlax. Trapper-weak attackers like Ponyta and Abra benefit from Trapinch trapping and deterring Diglett and opposing Trapinch, and Ponyta also enjoys the removal of Onix. Natu and Koffing appreciate Trapinch as a safety net against Tyrunt and, in return, both check Grookey. Foongus enjoys the removal of Steel-types while checking Grookey and Water-types for Trapinch. Fighting-types and Poison-types appreciate Trapinch removing Abra.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "goldenghost", "user_id": 32350}], "teams": [{"name": "Quality checked by", "members": [{"username": "DC", "user_id": 449990}, {"username": "Coconut", "user_id": 150971}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Shellos": {
    "sets": {"Curse Sweeper": {"description": "<p>In a metagame renowned for its fast pace, Shellos stands out for its longevity and ability to slowly crawl towards a defensive sweep. Curse and Amnesia allow it to set up and become almost impossible to beat, and Facade capitalizes on Curse's Attack boost, as well as any status it acquires when setting up. Facade is favoured because of its neutral coverage and the relative infrequency of Ghost-types. With the given bulk investment, Shellos can beat even Ferroseed one-on-one. However, Shellos's reliance on a Normal-type attack means it requires support from users of Dark-type coverage, such as Pawniard and Mienfoo, to help with Frillish and other Ghost-types. It also needs Poison-type support from Koffing or Foongus to deal with Grookey. Natu can switch into Foongus and force it out, which can otherwise be problematic.</p>"}},
    "credits": {"writtenBy": [{"username": "EnzoLapras", "user_id": 381336}], "teams": [{"name": "Quality checked by", "members": [{"username": "goldenghost", "user_id": 32350}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Stunky": {
    "sets": {"Wallbreaker": {"description": "<p>Stunky finds a niche in LC as a wallbreaker with a useful Psychic immunity, which allows it to soft check tier staples such as Abra and Natu. Sucker Punch makes Stunky much more difficult to revenge kill by faster foes such as Diglett and Choice Scarf Porygon. Play Rough hits Fighting-types such as Mienfoo, as well as Carvanha, while Fire Blast covers Pawniard and Ferroseed. Stunky is vulnerable to being trapped by foes like Diglett and Trapinch, so Pokemon that can pressure them are necessary. Trace Porygon can take advantage of a double switch to remove these foes, while Grookey threatens both trappers immediately with Grassy Glide, as well as setting up Grassy Terrain to reduce the damage that Earthquake would do. It should also be mentioned that Grookey should always run Protect in order to effectively deal with Trapinch's First Impression when paired with Stunky.</p>"}},
    "credits": {"writtenBy": [{"username": "TheShoddyStrawman", "user_id": 585065}, {"username": "DC", "user_id": 449990}], "teams": [{"name": "Quality checked by", "members": [{"username": "DC", "user_id": 449990}]}, {"name": "Grammar checked by", "members": [{"username": "deetah", "user_id": 297659}]}]}
  },
  "Munchlax": {
    "sets": {"Defensive": {"description": "<p>Munchlax's natural bulk allows it to check some of LC's strongest special attackers, such as Porygon and Abra. With Thick Fat, it is also a hard counter to the tier's Fire-types, which makes it a soft check to sun teams. Curse allows Munchlax to be a strong setup sweeper, and it finds setup opportunities against foes such as Natu. Body Slam is preferred for its ability to paralyze common switch-ins such as Mienfoo, but Facade allows Munchlax to deal extra damage after absorbing status from moves such as Scald and Sludge Bomb. Fire Punch hits Steel-types such as Ferroseed and Pawniard. The combination of Berry Juice and Recycle helps Munchlax consistently check special attackers and set up with Curse. Munchlax is typically paired with Koffing or Larvesta to help wear down or burn Mienfoo. These foes also help Munchlax by absorbing Knock Off and dealing with troublesome foes such as Grookey and Pawniard.</p>"}},
    "credits": {"writtenBy": [{"username": "wesh papillon", "user_id": 481831}], "teams": [{"name": "Quality checked by", "members": [{"username": "Fiend", "user_id": 208173}, {"username": "DC", "user_id": 449990}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Croagunk": {
    "sets": {"Nasty Plot": {"description": "<p>Croagunk finds a niche in LC as a specially-attacking Fighting-type with useful resistances to Grookey and opposing Fighting-types like Mienfoo and Timburr. However, its middling bulk and lack of recovery make Croagunk susceptible to getting chipped and render it unable to check these Pokemon multiple times, especially if it gets hit by Knock Off. Croagunk is also vulnerable to trappers such as Diglett and Trapinch. Dry Skin allows Croagunk to switch in safely on threats such as Mareanie and non-Psychic Staryu and use them as setup fodder with Nasty Plot. Vacuum Wave gives Croagunk a way to finish off weakened foes while also allowing it to avoid risking the powerful but inaccurate Focus Blast. The best partners for Croagunk include Pawniard and Ferroseed, which help deal with Psychic-types, and countertrappers such as Air Balloon Diglett and Trace Porygon.</p>"}},
    "credits": {"writtenBy": [{"username": "jns0808", "user_id": 536936}], "teams": [{"name": "Quality checked by", "members": [{"username": "DC", "user_id": 449990}]}, {"name": "Grammar checked by", "members": [{"username": "DC", "user_id": 449990}]}]}
  },
  "Snover": {"sets": {"Hail Setter": {"description": "<p>Snover finds a niche in LC thanks to Snow Warning enabling a threatening sweeper in Alolan Sandshrew. Giga Drain complements Blizzard by hitting Water-types like Frillish and Staryu. Ice Shard revenge kills weakened foes like Abra, while Protect allows Snover to block Mienfoo's Fake Out and scout Choice-locked Pokemon like Mudbray. Mareanie is a notable partner on hail teams due to its ability to check Fire- and Fighting-types, like Ponyta and Mienfoo, in one teamslot. Trappers like Diglett and Wynaut can remove threats like Staryu, Mareanie, and Timburr.</p>"}}, "credits": {"writtenBy": [{"username": "carti", "user_id": 597360}], "teams": [{"name": "Quality checked by", "members": [{"username": "gali", "user_id": 107567}]}, {"name": "Grammar checked by", "members": [{"username": "DC", "user_id": 449990}]}]}},
  "Drilbur": {
    "comments": "<h1>Other Options</h1> <p>Drilbur can opt to run a bulkier spread of 116 HP / 76 Atk / 196 Def / 120 Spe with an Impish Nature to better counter Pokemon like Tyrunt. Another option is replacing Rock Slide with Rock Tomb, exchanging some power for speed control. Alternatively, moves like Poison Jab to hit Grookey and Morelull on the switch, Toxic to cripple Shellos and Cosmic Power Natu, and Swords Dance to potentially sweep can be used instead.</p> <h1>Checks and Counters</h1> <p><strong>Grookey</strong>: Grookey can switch in safely against Drilbur unless it is running the rare Poison Jab. Once it is in, Grookey threatens a KO with priority Grassy Glide and can punish a switch with U-turn.</p> <p><strong>Water-types</strong>: Drilbur does poorly into most Water-types. Frillish can easily tank Drilbur's attacks, can block Rapid Spin, and can do huge damage back. Carvanha and Staryu both outpace Drilbur and KO it easily, and Shellos can set up on it for free unless Drilbur is carrying the niche Toxic.</p>",
    "sets": {
      "Fast Utility": {
        "description": "<p>Drilbur is a useful role-compression choice in Little Cup, able to both set and remove entry hazards. Mold Breaker means that, unlike other Stealth Rock users, Drilbur does not have to fear Natu's Magic Bounce. Furthermore, having the rare Rapid Spin makes Drilbur one of the most efficient entry hazard removers in the tier and lets it boost its Speed for late-game cleaning. High Horsepower is slightly weaker and less accurate than Earthquake, but allows Drilbur to work better with Grookey. Rock Slide hits Flying- and Bug-types such as Natu and Larvesta. Finally, its Ground typing makes it a comfortable switch-in to Poison-types like Koffing, eating any of its attacks and forcing it out.</p> <p>Drilbur makes a fantastic partner for Ferroseed, as they form a potent hazard stacking core with Stealth Rock, Spikes, and Rapid Spin; additionally, Ferroseed checks the Water-types that threaten Drilbur. Fighting-types like Mienfoo and Iron Fist Timburr also greatly appreciate having Drilbur on their side, as it counters Koffing and can reliably set Stealth Rock to cripple Larvesta. Drilbur struggles against Grass-type Pokemon, meaning it has high synergy with Fire- and Poison-types like Larvesta and Koffing, which also appreciate Drilbur removing entry hazards. It also struggles against Water-types, making Electric- and Grass-type Pokemon like Magnemite and Grookey good choices for teammates.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Drifting", "user_id": 342456}], "teams": [{"name": "Quality checked by", "members": [{"username": "DC", "user_id": 449990}, {"username": "gali", "user_id": 107567}]}, {"name": "Grammar checked by", "members": [{"username": "UT", "user_id": 523866}]}]}
  },
  "Timburr": {
    "comments": "<h1>Other Options</h1> <p>Bulk Up with 156 Special Defense EVs turns Timburr into a dangerous wincon, but it still struggles to break through Poison-types and is almost complete deadweight against Natu. Ice Punch 2HKOes Foongus after Knock Off or minimal prior damage. Running an EV spread of 196 Atk / 236 Def / 76 Spe with an Adamant nature improves Timburr's matchup against foes like Mienfoo, and it still outspeeds Frillish and Trace Porygon.</p> <h1>Checks and Counters</h1> <p><strong>Natu</strong>: Natu 4x resists Timburr's STAB attacks, outspeeds it, and hits hard with Psychic. It can be worn down with Stealth Rock support and fears Knock Off and Thunder Punch, though.</p> <p><strong>Koffing</strong>: Koffing takes little from Timburr's attacks and can beat it one-versus-one. However, Timburr can wear it down, especially when paired with Mienfoo or Grookey.</p> <p><strong>Mareanie</strong>: Mareanie completely walls Timburr lacking Thunder Punch and outlasts it with Recover and Regenerator. Thunder Punch and Bulk Up sets can muscle through it, though.</p> <p><strong>Abra</strong>: Abra outspeeds Timburr, OHKOes it with Psychic, and can shrug off Mach Punch. It cannot safely switch in on Timburr's other attacks, however.</p> <p><strong>Foongus</strong>: Foongus shrugs off Timburr's Fighting-type attacks and can cripple it with Spore. However, Timburr can lure it in and then 2HKO it with Ice Punch.</p>",
    "sets": {
      "Bulky Attacker": {
        "description": "<p>Timburr is a niche pick thanks to its great bulk and access to rare moves like Mach Punch and Defog. Mach Punch picks off dangerous threats like Porygon, Carvanha, and Tyrunt. Defog makes Timburr one of the metagame's more reliable entry hazard removers; alternatively, if removal is not needed, Thunder Punch allows Timburr to break past common checks like Mareanie. Iron Fist boosts the power of most of Timburr's attacks, while Guts allows it to absorb status and gives it a stronger matchup against threats like Frillish and Larvesta. The EV spread allows Timburr to outspeed Mareanie.</p> <p>Timburr is an inferior choice to Mienfoo for most teams due to the latter's more powerful STAB move in High Jump Kick, much greater survivability, and pivot move in U-turn; however, some hyper offense teams appreciate Timburr's greater bulk and role compression with Mach Punch and Defog. Entry hazard-stacking teams featuring Dwebble and multiple wallbreakers are some examples, as are sun offense teams. Timburr can also be used together with Mienfoo in a Fighting spam core. Steel-types like Pawniard and Ferroseed are important teammates to check Psychic-types. Grookey shares checks like Natu and Poison-types with Timburr, and Grookey can work in tandem with it to break through these checks. Special attackers like Abra, Porygon, and Staryu appreciate Timburr handling Steel-types. Diglett can threaten Poison-types, especially Mareanie if Timburr is lacking Thunder Punch.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "gali", "user_id": 107567}], "teams": [{"name": "Quality checked by", "members": [{"username": "DC", "user_id": 449990}, {"username": "Fiend", "user_id": 208173}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Venipede": {"sets": {"Spikes Setter": {"description": "<p>Venipede's ability to outspeed common entry hazard removers and match up well against common leads, such as Mienfoo and Abra, give it a niche in LC as a Spikes setter on hyper offense. Pin Missile and Endeavor further let Venipede weaken foes for its teammates. The EVs allow Venipede to outspeed the unboosted metagame at +1 Speed while also surviving some powerful attacks, such as Natu's Psychic. Strong attackers like Abra, Carvanha, and Ponyta benefit from Spikes wearing down their checks such as Ferroseed and Mareanie. Partners such as Pawniard and Staryu, which can pressure Natu, are also very useful to have.</p>"}}, "credits": {"writtenBy": [{"username": "Bella", "user_id": 567483}], "teams": [{"name": "Quality checked by", "members": [{"username": "gali", "user_id": 107567}, {"username": "DC", "user_id": 449990}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}},
  "Cottonee": {
    "sets": {"Memento": {"description": "<p>Cottonee has good support moves and Prankster, which allows it to provide opportunities for setup sweepers on hyper offense teams with Memento. Cottonee's typing lets it check some of the biggest issues for hyper offense teams in Mienfoo and Grookey. It also enables Grookey by luring and crippling Ferroseed and Koffing with Knock Off. Encore and Defog give Cottonee a bit more flexibility by allowing it to provide additional setup opportunities for teammates and help teammates such as Tyrunt switch in safely. Cottonee pairs well with Memento Diglett as a secondary Memento user; together, they can provide setup opportunities for multiple setup sweepers. The best teammate for Cottonee is a setup sweeper whose setup it facilitates, like Swords Dance Grookey and Tyrunt.</p>"}},
    "credits": {"writtenBy": [{"username": "jns0808", "user_id": 536936}], "teams": [{"name": "Quality checked by", "members": [{"username": "gali", "user_id": 107567}, {"username": "DC", "user_id": 449990}]}, {"name": "Grammar checked by", "members": [{"username": "DC", "user_id": 449990}]}]}
  },
  "Dwebble": {
    "sets": {
      "Entry Hazard Setter": {"description": "<p>Dwebble finds a solid niche in LC as an entry hazard setter on hyper offense thanks to having access to both Stealth Rock and Spikes. The combination of Knock Off and Rock Blast gives Dwebble a great matchup against Natu, the tier's most common entry hazard prevention, and makes it hard for Natu to reliably deny its entry hazards. Knock Off gives more utility to Dwebble, crippling lead Pokemon such as Mienfoo and spinners such as Staryu and Drilbur. Counter can be used surprise foes such as Mienfoo, but it is hard to fit. Weak Armor prevents spinners from reliably Dwebble's entry removing hazards. Offensive Pokemon such as Abra, Carvanha and Ponyta as well as setup sweepers like Tyrunt and Agility Porygon, appreciate hazard support from Dwebble to help overwhelm their checks such as Ferroseed and Staryu. Grookey threatens Staryu and can revenge kill weakened foes with Grassy Glide.</p>"},
      "Shell Smash": {"description": "<p>With Shell Smash, Dwebble can become a scary offensive presence fast due to its decent STAB combination and access to Sturdy, giving it easier setup opportunities. However, as a setup sweeper, Dwebble is generally outclassed by Tyrunt, and it struggles against Grookey. Earthquake has great synergy with Rock Blast, providing perfect neutral coverage while also targeting Rock-resistant foes like Pawniard and Onix. Knock Off can remove an item from opposing Ferroseed. Entry hazard setters like Ferroseed and Pawniard are helpful, as they can wear down foes for Dwebble to clean late-game. Memento Diglett can assist Dwebble by letting it more easily set up against a foe of its choice. Pivots like Mienfoo and Natu provide Dwebble safe switch-in opportunities. The latter can also thwart entry hazards, helping maintain Dwebble's Sturdy.</p>"}
    },
    "credits": {"writtenBy": [{"username": "BT89", "user_id": 487308}, {"username": "Bella", "user_id": 567483}], "teams": [{"name": "Quality checked by", "members": [{"username": "DC", "user_id": 449990}]}, {"name": "Grammar checked by", "members": [{"username": "deetah", "user_id": 297659}, {"username": "DC", "user_id": 449990}]}]}
  },
  "Tirtouga": {"sets": {"Defensive": {}, "Shell Smash": {}}},
  "Archen": {
    "sets": {
      "Choice Scarf": {
        "description": "<p>Choice Scarf Archen finds a niche as a cleaner and offensive pivot, outspeeding the unboosted metagame and posing a major threat with its ability to capitalize on forced switches. Dual Wingbeat is especially threatening due to the potency of Flying STAB in LC, and it also breaks Focus Sash from Abra and Diglett. Earthquake hits Flying-resistant foes like Pawniard, Onix, and Tyrunt and bulky walls such as Koffing and Mareanie. U-turn allows Archen to take advantage of forced switches or pivot on would-be checks. Knock Off helps Archen break down defensive Pokemon such as Porygon and Ferroseed, while Rock Blast hits Larvesta without risking a Flame Body burn and also breaks through Focus Sash Abra.</p> <p>Choice Scarf Archen should clean or sweep weakened foes late-game, coming onto the field via slow pivoting or as a revenge killer. This set should also utilize U-turn and Knock Off to accumulate chip damage on forced switch-ins. Due to Defeatist, Choice Scarf Archen mandates entry hazard control, such as Rapid Spin from Drilbur or Staryu, to pivot freely. Magic Bounce Natu provides secondary insurance against hazards and checks Ferroseed. Mienfoo and Grookey help prevent hazards by checking Steel-types like Ferroseed and Pawniard. Archen appreciates Koffing and Larvesta keeping threatening priority attacks from Grookey, Timburr, and Pawniard in check. In turn, Archen can help break down opposing Koffing. Pivoting from Mienfoo, Grookey, Larvesta, and Porygon helps Archen enter the field safely. Trappers like Diglett and Trapinch can beat Stealth Rock setters and Flying-type checks such as Pawniard and Onix. Archen pairs well with strong special attackers like Porygon and Abra to overwhelm Steel-type switch-ins.</p>"
      },
      "Berry Juice": {
        "description": "<p>Berry Juice Archen capitalizes on Archen's ability to force switches by becoming a dangerous wallbreaker. Head Smash is very powerful but has recoil; recoil can activate Berry Juice for Acrobatics, but it can also put Archen into Defeatist range. Acrobatics synergizes with Berry Juice and has higher damage output, but Dual Wingbeat deals more immediate damage and breaks Focus Sash. Earthquake deals solid damage to Flying-resistant foes like Pawniard, Onix, and Tyrunt. Heat Wave allows Archen to beat Ferroseed while providing mid-ground coverage for Pawniard and Magnemite. Protect blocks Fake Out from Mienfoo and First Impression from Trapinch, stalls out Grassy Terrain turns against Grookey, and punishes High Jump Kick from Mienfoo. Substitute allows Archen to capitalize on forced switches, avoid status moves and Sucker Punch from Pawniard, and threaten faster offensive threats like Diglett, Abra, and Staryu while also synergizing with Berry Juice.</p> <p>Pivoting, specifically from Mienfoo and Grookey, is important for Berry Juice Archen to set up on switch-ins such as Larvesta and Foongus. In turn, Archen helps break down Koffing, but be careful with Grassy Terrain decreasing the power of Earthquake. Berry Juice Archen is limited by Stealth Rock and appreciates entry hazard control from Drilbur, Staryu, and Natu. Koffing checks strong priority from Grookey and Timburr. Mienfoo, Grookey, and Larvesta can check and remove Pawniard. Larvesta also deters and punishes Grookey and Pawniard with Flame Body. Trappers like Diglett and Trapinch can trap Stealth Rock setters and Flying-type checks such as Pawniard and Onix. Strong special attackers like Abra and Porygon appreciate Berry Juice Archen's ability to help break through Steel-types.</p> <h1>Other Options</h1> <p>Archen can lure in Ground- and Rock-type switch-ins and hit them with Aqua Tail, OHKOing non-Sturdy Onix and punishing Mudbray, though these foes are less common. Rock Tomb punishes forced switches for Archen's teammates. Stealth Rock and Defog can be used on forced switches, but Archen matches up poorly against Rapid Spin Drilbur and Staryu and prefers to wallbreak.</p> <h1>Checks and Counters</h1> <p><strong>Bulky Rock-, Steel-, and Ground-types</strong>: Pokemon such as Onix, Pawniard, and Mudbray can switch into Archen's STAB moves and KO it, but they must be wary of its coverage options.</p> <p><strong>Priority Users</strong>: Priority users such as Grookey, Timburr, and Pawniard can limit Archen's effectiveness by putting it into Defeatist range. Grookey in particular threatens to OHKO Archen with Grassy Glide after Stealth Rock.</p> <p><strong>Faster Offensive Threats</strong>: Naturally faster Pokemon such as Abra, Staryu, and Diglett; Choice Scarf users like Mienfoo, Magnemite, and Porygon; and +1 Carvanha, Tyrunt, and Ponyta outspeed and threaten non-Choice Scarf Archen.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "zeroouttathere", "user_id": 519108}], "teams": [{"name": "Quality checked by", "members": [{"username": "DC", "user_id": 449990}, {"username": "Berks", "user_id": 255030}]}, {"name": "Grammar checked by", "members": [{"username": "DC", "user_id": 449990}, {"username": "P Squared", "user_id": 168392}]}]}
  },
  "Trubbish": {
    "sets": {"Spikes": {"description": "<p>Trubbish holds a small niche as a Spikes setter on sun teams thanks to its decent bulk and good ability that allow it to facilitate offensive momentum for its teammates. Trubbish's typing allows it to function as a decent check to Fighting-types like Mienfoo and Timburr. Drain Punch provides coverage against Steel-types like Pawniard and Ferroseed as well as Tyrunt. Explosion chips down threats such as Mienfoo, Mareanie, Staryu, and Natu and provides momentum. Giga Drain hits Pokemon like Onix, Staryu, and Frillish. Sticky Hold guarantees that Eject Button will activate, allowing Trubbish to create offensive momentum for teammates on sun teams. Vulpix, Ponyta, and Charmander appreciate being brought in safely by Trubbish and benefit from its Spikes support. Stealth Rock Diglett can trap foes that Trubbish weakens, like Mareanie, Staryu, and Mienfoo, and also provide additional entry hazard support.</p>"}},
    "credits": {"writtenBy": [{"username": "BT89", "user_id": 487308}], "teams": [{"name": "Quality checked by", "members": [{"username": "DC", "user_id": 449990}]}, {"name": "Grammar checked by", "members": [{"username": "DC", "user_id": 449990}]}]}
  },
  "Foongus": {
    "comments": "<h1>Other Options</h1> <p>Foongus can run more Speed EVs to outspeed foes like Timburr and Mareanie while helping in the Foongus mirror. 124 HP EVs make it easier to deal with threats like Mudbray. Foongus's movepool isn't good, and it is usually limited to the four listed moves. Stun Spore and Clear Smog can be used as alternative move options, but they are extremely situational; Stun Spore cripples multiple foes, and Clear Smog prevents setup sweepers like Galarian Ponyta from setting up on Foongus.</p> <h1>Checks and Counters</h1> <p><strong>Ferroseed</strong>: Ferroseed is probably the most effective check against Foongus, as it resists Giga Drain and is immune to Sludge Bomb and Spore. It can easily switch into Foongus and start setting its entry hazards or remove Foongus's Eviolite with Knock Off. Ferroseed paired with Mienfoo can be very difficult for Foongus to make progress against.</p> <p><strong>Other Steel-types</strong>: Steel-types like Magnemite and Pawniard resist both of Foongus's listed attacks, and Pawniard also threatens it with Knock Off. However, none of them appreciate Spore.</p> <p><strong>Natu</strong>: Natu is a troublesome check to Foongus, as it is immune to Spore due to Magic Bounce and can hit Foongus with super effective moves. Cosmic Power and Calm Mind Natu can also set up on Foongus. However, Natu can be worn down by Sludge Bomb, and it doesn't appreciate getting poisoned by it.</p> <p><strong>Koffing</strong>: Koffing resists both Foongus's STAB moves, does a lot of damage in return, and wears down Foongus with Neutralizing Gas.</p> <p><strong>Psychic-types</strong>: Psychic-types such as Abra, Galarian Ponyta, and Psychic coverage from Staryu threaten Foongus, but they dislike Spore.</p> <p><strong>Fire-types</strong>: Fire-types such as Ponyta, Vulpix, and Charmander threaten Foongus offensively but have a difficult time switching into Spore and Sludge Bomb.</p>",
    "sets": {
      "Tank": {
        "description": "<p>Foongus is one of the best walls in LC, being able to take on dangerous threats like Mienfoo, Diglett, and Grookey with its combination of decent bulk, amazing typing, and Spore. Spore cripples a non-Grass-type foe, preventing setup sweepers like Tyrunt from performing their role, and it gives Foongus's teammates a chance to switch in safely. Giga Drain and Synthesis provide recovery and both increase Foongus's longevity. Regenerator lets it pivot into opposing threats like Mienfoo and Mareanie repeatedly. The given EV spread denies Porygon from getting a Special Attack boost from Download.</p> <p>Foongus forms a great defensive core with bulky Water-types such as Frillish and Staryu, as it checks physical threats like Grookey for them; in return, they check Fire-types like Ponyta and Vulpix. Frillish also checks the troublesome Natu. Mienfoo forms a great Regenerator core with Foongus, and it can eliminate annoying Steel-types like Pawniard and Ferroseed. Fire-types like Ponyta are also a solid choice for dealing with Steel-types. Natu and Trapinch are both reliable partners to deal with the troublesome Ferroseed; Natu punishes its entry hazards and status moves with Magic Bounce, while Trapinch can trap and eliminate it. Foongus struggles against Psychic-types like Abra, so Pawniard makes a great teammate for it. Pawniard in return benefits from Foongus's ability to deal with Fighting-types.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Lialiabeast", "user_id": 564420}], "teams": [{"name": "Quality checked by", "members": [{"username": "goldenghost", "user_id": 32350}, {"username": "DC", "user_id": 449990}]}, {"name": "Grammar checked by", "members": [{"username": "DC", "user_id": 449990}, {"username": "dex", "user_id": 277988}]}]}
  },
  "Frillish": {
    "comments": "<h1>Other Options</h1> <p>Psychic can beat one of Frillish's checks, Mareanie, and also can deal heavy damage to Fighting-types. Strength Sap can provide more recovery than Recover against certain foes, but is inconsistent and risks activating Pawniard's Defiant.</p> <h1>Checks and Counters</h1> <p><strong>Ferroseed</strong>: Ferroseed is an effective Frillish check, thanks to its Water resistance and general bulk. It also threatens Frillish with Knock Off and Giga Drain, taking turns spent on Recover to set entry hazards. However, it has to be careful of being burned by Scald or Will-O-Wisp, which strengthens Hex.</p> <p><strong>Carvanha</strong>: Carvanha is the best offensive check to Frillish, due to the pressure its powerful Crunch exerts. However, its frailty and fear of burns mean it cannot switch in easily.</p> <p><strong>Grookey</strong>: Similarly to Carvanha, Grookey can threaten Frillish with its powerful super-effective attacks, but it can't switch into Frillish safely.</p> <p><strong>Pawniard</strong>: Pawniard is one of the biggest threats to Frillish with Knock Off. Although it must be generally wary of Will-O-Wisp and Scald, it can still cause issues for Frillish when burned.</p> <p><strong>Magnemite</strong>: Magnemite threatens Frillish with its super effective Electric-type attacks and can preserve momentum with Volt Switch.</p> <p><strong>Super Effective Coverage</strong>: Frillish needs to be careful even against threats it is supposed to check. Ponyta and Psychic-types like Abra and Natu can have Wild Charge or Shadow Ball. It should also be cautious of Knock Off from other Pokemon, such as Mienfoo and Mareanie. Pokemon like Koffing, Staryu, and Porygon also pose a threat with Thunderbolt.</p>",
    "sets": {
      "Special Tank": {
        "description": "<p>Frillish is a tank that can shrug off powerful special hits and take physical hits decently well. Frillish's typing makes it a deterrent for Porygon and Mienfoo, preventing them from spamming Tri Attack and Ice Beam or High Jump Kick. Its Fire resistance causes issues for sun teams as well. Scald and Will-O-Wisp make physical attackers with good matchups such as Pawniard and Grookey hesitant to switch into Frillish in fear of a burn. Burns also empower Hex, which hits statused unresisted targets very hard. Cursed Body lets Frillish sometimes win one-on-one against lesser offensive threats like Mienfoo or Staryu by disabling their super effective moves.</p> <p>Pokemon that appreciate Frillish's presence include Grookey and Steel-types such as Pawniard and Ferroseed, since they are weak to Fire-types, which Frillish can switch into repeatedly. Fighting-types such as Mienfoo and Timburr appreciate Frillish's ability to deal with Psychic-types like Abra and Natu. They return the favor by switching into Steel-types that cause Frillish trouble. Fire-types like Ponyta and Poison-types like Koffing and Foongus are the best ways to deal with Grookey and Ferroseed, which force Frillish out. Morelull deserves a special mention for its ability to reliably switch into Carvanha, and it can also help spread status to let Frillish deal more damage with Hex.</p>"
      },
      "Choice Scarf": {
        "description": "<p>With a Choice Scarf, Frillish outspeeds the entire unboosted metagame, becoming an excellent attacker and revenge killer with some surprise factor. Water Spout devastates most Pokemon when Frillish is at full health, while Hydro Pump deals less damage initially but is stronger at lower HP. Shadow Ball deals good damage to Psychic-types such as Abra and Natu, as well as opposing Frillish, and is Frillish's best option against Ferroseed. Ice Beam can be used to hit Grass-types such as Grookey and Morelull. However, the fourth move slot is flexible; Trick can be used to debilitate walls such as Ferroseed and Trace Porygon.</p> <p>Frillish does not enjoy entry hazards weakening Water Spout, so Pokemon such as Drilbur and Natu that can provide hazard control make excellent teammates. Dark-types and Knock Off users also naturally scare out Frillish, so Fighting-types such as Mienfoo and Timburr are useful. Trappers such as Trapinch trap Steel-types that can counter Frillish, such as Pawniard. Grookey and Ferroseed completely counter Frillish, so Fire-types such as Ponyta and Poison-types such as Koffing are helpful teammates.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "jns0808", "user_id": 536936}, {"username": "Bella", "user_id": 567483}], "teams": [{"name": "Quality checked by", "members": [{"username": "DC", "user_id": 449990}, {"username": "goldenghost", "user_id": 32350}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}, {"username": "CryoGyro", "user_id": 331519}]}]}
  },
  "Ferroseed": {
    "comments": "<h1>Other Options</h1> <p>Ferroseed can use an alternative EV spread that drops bulk to reach 9 Speed. 9 Speed beats paralyzed 17 Speed Pokemon, which is especially useful against Mienfoo. Revenge is an option to beat Salac Berry Magnet Pull Magnemite; it 2HKOes, overcoming Rest. Revenge Ferroseed also beats Pawniard, LC's only other Stealth Rock setter. Explosion Ferroseed can be used on teams that need a last resort option to KO threats like paralyzed Mienfoo and Natu. Bullet Seed helps Ferroseed beat Magnet Pull Magnemite, and it can do more damage to neutral targets like Natu after Roost, but it leaves Ferroseed without Giga Drain's recovery.</p> <h1>Checks and Counters</h1> <p><strong>Natu</strong>: Natu can switch into Ferroseed's status moves with Magic Bounce and threaten massive damage with Heat Wave. Ferroseed users must be careful of allowing Natu to impede progress; however, it doesn't appreciate Knock Off.</p> <p><strong>Fire- and Fighting-types</strong>: Mienfoo, a tier staple, can heavily damage Ferroseed with High Jump Kick, and Fire-type hits from Ponyta and Vulpix cleanly OHKO Ferroseed. These Pokemon do not appreciate being paralyzed by Thunder Wave or getting their items removed by Knock Off, however.</p> <p><strong>Coverage</strong>: Galarian Ponyta, Abra, and Koffing can run Mystical Fire, Fire Punch, or Fire Blast to heavily damage Ferroseed and prevent it from checking them over the course of a game. Mareanie's Knock Off compromises Ferroseed's walling ability.</p>",
    "sets": {
      "Defensive Support": {
        "description": "<p>Ferroseed is one of the LC metagame's best walls, being able to sponge neutral hits from strong threats like Staryu, Abra, and Porygon and then spread Thunder Wave. Ferroseed checks two of LC's three prominent Poison-types, Foongus and Mareanie, with resistance or immunity to their STAB attacks and Foongus's Spore. Ferroseed's Knock Off takes advantage of forcing out the Pokemon it checks, supporting teammates by removing Eviolite from common checks like Natu and Mienfoo. Ferroseed is one of the few viable Stealth Rock setters and can also be used to set Spikes.</p> <p>Ferroseed creates an effective defensive core with Poison-types like Koffing and Mareanie, checking the strong special attackers that threaten them while also benefitting from them checking strong Fighting-type attackers, like Mienfoo. Frillish and the aforementioned Mareanie also help Ferroseed by checking Fire-types like Ponyta and Vulpix. Frillish and Natu help deal with opposing Natu, which has Magic Bounce and Heat Wave to very effectively deal with Ferroseed. Ferroseed can struggle to check Fire Punch Abra and Trick Porygon, and Mareanie's Knock Off can also weaken it. Partners like Diglett and Porygon can help check or remove them. Magnet Pull Magnemite traps and sets up on Ferroseed; Ground-type teammates like Diglett, Trapinch, and Mudbray can deter these sweeps.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "yellowfin", "user_id": 416460}], "teams": [{"name": "Quality checked by", "members": [{"username": "gali", "user_id": 107567}, {"username": "DC", "user_id": 449990}]}, {"name": "Grammar checked by", "members": [{"username": "CryoGyro", "user_id": 331519}, {"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Mienfoo": {
    "comments": "<h1>Other Options</h1> <p>Choice Band sets dole out absurd amounts of damage, as Reckless High Jump Kick 2HKOes Foongus and Mareanie without Eviolite. Acrobatics is an option to threaten Foongus and opposing Mienfoo after losing Eviolite. Swords Dance boosts Mienfoo's power to extreme heights, but Mienfoo lacks the Speed to sweep. Stone Edge nails Larvesta, and it also deals good damage to Natu as well.</p> <h1>Checks and Counters</h1> <p><strong>Koffing</strong>: Koffing takes little damage from any of Mienfoo's attacks, threatens with Will-O-Wisp, and can wear it down over the course of the match, as Neutralizing Gas blocks Regenerator. Koffing can be whittled down by repeated hits and its lack of reliable healing, though.</p> <p><strong>Mareanie</strong>: Mareanie resists High Jump Kick and U-turn, can switch in repeatedly with Regenerator, and can make progress with Knock Off and Scald burns. It must be wary of U-turn bringing in Diglett or special attackers like Abra and Porygon.</p> <p><strong>Foongus</strong>: Foongus resists High Jump Kick, stays healthy with Regenerator, and punishes Mienfoo's team with Spore. However, Foongus can struggle mightily to make progress when Mienfoo is paired with Ferroseed or, to a lesser extent, Natu.</p> <p><strong>Flame Body</strong>: Flame Body users like Larvesta and Eviolite Ponyta can burn Mienfoo for using moves recklessly. However, both are threatened by U-turn bringing in Diglett.</p> <p><strong>Psychic-type Pokemon and Coverage</strong>: While Abra, Galarian Ponyta, and Choice Scarf Porygon cannot switch into Mienfoo, they outspeed and OHKO it. Natu fears Knock Off but can force uncomfortable turns with STAB Psychic. Staryu sometimes carries Psychic as well, and it can severely threaten Mienfoo that lack Eviolite.</p>",
    "sets": {
      "Bulky Pivot": {
        "description": "<p>Mienfoo is an extremely versatile and durable Pokemon that can serve as a lead, defensive pivot, and offensive wallbreaker over the course of a game. U-turn lets Mienfoo take advantage of the switches it forces while maintaining offensive momentum and healing itself with Regenerator. Knock Off softens up switch-ins like Mareanie and Koffing and hits Natu and Frillish hard. Fake Out is valuable for wearing down Choice Scarf users and sweepers while also providing free chip damage against most foes. Taunt is an alternative that blocks Poison-type checks from recovering while also shutting down defensive sweepers like Shellos and status moves from Foongus and Koffing. While the given EV spread is reliable for its physical bulk and its guarantee of a Speed tie with opposing Mienfoo and Natu, Mienfoo's versatility allows a wide variety of investments. These include a spread with 236 Attack EVs instead of Defense for wallbreaking power and running no Speed investment to use U-turn after other Mienfoo.</p> <p>Mienfoo fits well on virtually every team, but it pairs especially well with Diglett, which benefits from U-turn to trap checks like Mareanie, and Koffing, which can wear down Regenerator users with Neutralizing Gas. Mienfoo is an invaluable partner for Pokemon that are forced out by Pawniard like Abra, Porygon, and Natu. Abra and Natu also punish Mienfoo's Poison-type checks like Foongus and Koffing after U-turn.</p>"
      },
      "Choice Scarf": {
        "description": "<p>Choice Scarf Mienfoo is a major threat that outspeeds most of the tier while dealing severe damage and offering sweeping potential. Reckless High Jump Kick will OHKO or 2HKO any neutral target. U-turn lets Mienfoo scout the opposing team and allows teammates to punish the Poison-types it forces in. Knock Off wears down those Poison-types to set up for a later sweep, and it also hits Galarian Ponyta, Natu, and Frillish hard. Close Combat should be used when the additional power of High Jump Kick is not needed and the stat drops are not a concern.</p> <p>Choice Scarf Mienfoo pairs well with Timburr, which can perform the duties of a bulky Fighting-type while both Pokemon overwhelm the opposing Poison-type. Diglett is a valuable partner for its ability to trap Poison-types. Beyond the usual checks, this set is vulnerable to Natu and Frillish, as they punish its STAB moves and thus make it extremely difficult for Mienfoo to operate offensively. Pawniard is a valuable partner, as it checks both. Knock Off Grookey and Shadow Ball Abra can also pressure them.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "goldenghost", "user_id": 32350}], "teams": [{"name": "Quality checked by", "members": [{"username": "DC", "user_id": 449990}, {"username": "Berks", "user_id": 255030}]}, {"name": "Grammar checked by", "members": [{"username": "CryoGyro", "user_id": 331519}, {"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Golett": {
    "sets": {"Choice Scarf": {"description": "<p>Golett is a niche Choice Scarf sweeper in LC with decent typing and strong Ground + Ghost + Fighting coverage. No Guard allows Golett to utilize powerful attacks like Poltergeist, Earthquake, and Dynamic Punch without missing, allowing Golett to demolish most potential switch-ins with a good prediction. The fourth move is rarely used and flexible, but Rock Slide is preferred to hit Eviolite-less Natu and Larvesta. When using Golett, Knock Off is both beneficial and detrimental; it brings foes into Golett's KO range, but it also makes Poltergeist inconsistent. Golett pairs well with Koffing, which can suppress Regenerator from Mienfoo and Mareanie, and offensive entry hazard setters like Dwebble and Pawniard. It also benefits from Pokemon that can handle Grookey and Carvanha, like Larvesta and Morelull.</p>"}},
    "credits": {"writtenBy": [{"username": "Drifting", "user_id": 342456}], "teams": [{"name": "Quality checked by", "members": [{"username": "Acehunter1", "user_id": 430377}, {"username": "DC", "user_id": 449990}]}, {"name": "Grammar checked by", "members": [{"username": "DC", "user_id": 449990}]}]}
  },
  "Pawniard": {
    "comments": "<h1>Other Options</h1> <p>Pawniard can run a set with Eviolite and more Speed investment, but it is less effective at handling the special attackers Pawniard checks. A suicide lead set with Inner Focus, Focus Sash, Thunder Wave, and Steel Beam can be run on hyper offense teams to reliably set Stealth Rock. Thunder Wave is also an option on bulky sets to paralyze Mienfoo on the switch. Swords Dance is an option to overwhelm foes like bulky Poison-types at +2, though Pawniard's middling Speed limits its sweeping potential. Low Sweep beats other Pawniard and slows Mienfoo on the switch. Psycho Cut allows Pawniard to nail Mienfoo on the switch.</p> <h1>Checks and Counters</h1> <p><strong>Mienfoo</strong>: Mienfoo is the most common Pokemon in the tier and also one of most reliable switch-ins to Pawniard, as it resists Knock Off, outspeeds Pawniard, and OHKOes it easily. After forcing Pawniard out, Mienfoo can take advantage with Knock Off and U-turn, and it can maintain its longevity with Regenerator. However, Mienfoo can be worn down by repeatedly switching into Iron Head and is vulnerable to Thunder Wave. Inner Focus Pawniard can also punish Mienfoo for using Fake Out when it is at low health.</p> <p><strong>Timburr</strong>: Timburr has the physical bulk to switch into Pawniard with little fear and reliably OHKOes it with Mach Punch. It can also heal off damage from Pawniard with Drain Punch and take advantage of forcing a switch by using Knock Off and its coverage. However, Timburr can be worn down by repeated switches into Iron Head, and it may struggle to recover enough health with Drain Punch.</p> <p><strong>Fighting-type Coverage</strong>: Abra, one of Pawniard's most important foes to check, can turn the tables and OHKO it with Focus Punch or Submission. Galarian Ponyta and opposing Pawniard can also run Fighting-type coverage to surprise it. Psychic-types must make risky predictions or use Substitute to safely attack Pawniard, though.</p> <p><strong>Trappers</strong>: Diglett and especially Trapinch can trap Pawniard on a double switch or after a KO. Trapinch is sometimes bulky enough to hard switch into Pawniard, though it can still lose to Iron Head flinches and frailer sets must beware switching into Knock Off. Life Orb Diglett runs Substitute to avoid the threat of Sucker Punch and safely trap. Both must beware losing too much health from trapping it, though, as this may limit their effectiveness against more threatening targets later.</p> <p><strong>Fire-type Pokemon and Coverage</strong>: Ponyta, Vulpix, and Charmander outspeed and easily OHKO Pawniard, though they must fear Sucker Punch. Koffing, Natu, and Galarian Ponyta run Fire-type coverage to wear down Pawniard, though Berry Juice helps it avoid 2HKOs from these moves, and Mystical Fire also triggers Defiant.</p>",
    "sets": {
      "Berry Juice": {
        "description": "<p>Pawniard is one of Little Cup's best Stealth Rock setters, and it fills an invaluable role as a defensive Steel-type, checking powerful special attackers like Porygon and Abra. STAB Knock Off provides invaluable team support by removing Berry Juice and Eviolite and bringing foes into KO range of Pawniard's teammates. Iron Head is important for hitting Fighting-types hard on the switch, and it can sometimes bypass Pawniard's checks with its flinch chance. Berry Juice, a Careful nature, and the given EV spread help Pawniard avoid 2HKOs from hard hitters like Porygon and Staryu. Defiant lets Pawniard take advantage of stat drops from Galarian Ponyta's Mystical Fire and Abra's Shadow Ball, while Inner Focus prevents flinches from opposing Pawniard and weakened Mienfoo using Fake Out for chip damage.</p> <p>Pawniard is a great switch-in into dangerous special attackers like Porygon, Abra, and Galarian Ponyta, and thus it pairs well with bulky Poison-types and Mienfoo, which fear OHKOs from them. It is also the most reliable Stealth Rock setter against Natu, which fears Knock Off, thus helping offensive threats like Abra and Grookey that need Stealth Rock to reliably beat Natu. Pawniard needs a partner that can handle Mienfoo and Timburr, and bulky Poison-types like Koffing, Mareanie, and Foongus do this well. Frillish and Diglett help against Fire-types like Ponyta and Vulpix while also providing backup against Abra that carry Fighting-type coverage. Pawniard is vulnerable to Diglett and Trapinch, so a partner like Grookey or Staryu that takes advantage of these trappers is recommended.</p>"
      },
      "Choice Scarf": {
        "description": "<p>Pawniard is a powerful revenge killer thanks to its amazing Attack stat and above average Speed. Knock Off is an incredibly strong STAB move that also weakens most of its defensive checks by removing key items. Iron Head is a consistently strong STAB move that hits Mienfoo and also threatens Rock-types such as Tyrunt. Beat Up allows Pawniard to defeat Abra and non-Eviolite Diglett, breaking their Focus Sash or Substitute, and gives it the option to hit Larvesta without risking a Flame Body burn. Meanwhile, Brick Break hits other Steel-types super effectively and gets rid of screens. Sucker Punch is also a good option, as it allows Pawniard to revenge kill Choice Scarf users like Archen and certain threats at +1 Speed like Ponyta. Psycho Cut is a decent alternative, as it 2HKOes Mienfoo and itemless Mareanie after Stealth Rock. Maximum Speed investment outpaces +1 Tyrunt and most other common Choice Scarf users.</p> <p>Choice Scarf Pawniard pairs very well with Koffing, as Koffing helps wear Mienfoo down and Pawniard checks Tyrunt. Since Pawniard appreciates Stealth Rock support to provide crucial KOs against targets like Natu and Ponyta, Drilbur and Diglett are valuable partners; Diglett can also trap Mareanie and Larvesta, which can otherwise shrug off Pawniard's attacks with their bulk and recovery. Choice Scarf Pawniard can be overwhelmed by common special attackers such as Natu, Staryu, and Porygon, so a secondary check to these threats is helpful. Ferroseed helps check the aforementioned Pokemon, except Natu, and also provides Stealth Rock. Trace Porygon is able to check said threats, counter trap Trapinch, which is very problematic for Pawniard, and provide great pivoting support with Teleport. Additionally, Frillish synergizes well with Pawniard thanks to its ability to check most special attackers and Fire-types without stacking a Fighting weakness.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "goldenghost", "user_id": 32350}, {"username": "NotDake", "user_id": 572102}], "teams": [{"name": "Quality checked by", "members": [{"username": "gali", "user_id": 107567}, {"username": "DC", "user_id": 449990}, {"username": "Acehunter1", "user_id": 430377}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}, {"username": "UT", "user_id": 523866}, {"username": "Isaiah", "user_id": 375662}]}]}
  },
  "Larvesta": {
    "comments": "<h1>Other Options</h1> <p>Larvesta can run a Choice Scarf set with more Speed investment to take advantage of its fast and strong U-turn and Flare Blitz, and this set can even carry Morning Sun to serve as a defensive pivot once it loses its item; however, this set is especially vulnerable to Stealth Rock because of its difficulty recovering. A set with 9 Speed is an option to underspeed Timburr and Koffing to bring in frail attackers with U-turn, but this set is more vulnerable to Koffing and Mareanie. Zen Headbutt hits Fighting- and Poison-types for super effective damage, which is especially useful against Mareanie and Koffing. Wild Charge does solid damage to Water-types.</p> <h1>Checks and Counters</h1> <p><strong>Stealth Rock</strong>: Stealth Rock greatly limit Larvesta's ability to take hits. Larvesta should always be paired with entry hazard removers and controllers like Staryu and Natu to make setting Stealth Rock difficult.</p> <p><strong>Diglett</strong>: Diglett outspeeds and traps weakened Larvesta with Earthquake or Rock Slide. Though Diglett cannot switch in, it can take advantage of Mienfoo's or Grookey's U-turn to surprise and eliminate Larvesta. However, even Rock Slide does not OHKO Eviolite Larvesta without prior chip damage.</p> <p><strong>Water-types</strong>: Staryu, Mareanie, and Frillish hit Larvesta super effectively without fearing Flare Blitz or a burn, and the latter two also resist U-turn. Larvesta can turn the tables on Staryu and Mareanie, though, by using U-turn into Diglett, and the rare Wild Charge hits all three for major damage.</p> <p><strong>Ponyta</strong>: Ponyta cannot be burned, takes very little from Larvesta's attacks, and can use Flame Charge or deal heavy damage to Larvesta with Flare Blitz. However, it must watch out for Larvesta's ability to pivot into a trapper with U-turn.</p> <p><strong>Rock-types</strong>: Onix outspeeds Larvesta, OHKOes it with Rock Blast or Head Smash, and reliably sets Stealth Rock. Tyrunt also outspeeds standard Larvesta, can OHKO it with Rock Blast, and can set up with Dragon Dance on a forced switch. Both are greatly weakened by a burn, though, and can be taken advantage of by U-turn.</p>",
    "sets": {
      "Physically Defensive Pivot": {
        "description": "<p>Larvesta has a defensive niche in LC for shutting down the fearsome Mienfoo and Grookey more reliably than any other counter thanks to its reliable healing, ability to punish careless attacks with Flame Body burns, and great defensive typing without many common weakness. U-turn lets Larvesta slow pivot on opposing Pokemon or the switches it forces, safely bringing in powerful teammates. Will-O-Wisp guarantees a burn on targets that have not been burned by Flame Body, which is invaluable for rendering physical attackers useless. The given EV spread lets Larvesta almost always avoid the OHKO from Life Orb Diglett's Rock Slide, and it has enough Speed to outpace standard Koffing.</p> <p>Entry hazard control is absolutely necessary when using Larvesta, as Stealth Rock deals 50% damage to it. Staryu is almost mandatory, as it can reliably use Rapid Spin and has great defensive synergy with Larvesta. Alternatively, Timburr is a reliable Defog user. To complement hazard removal, Natu can prevent teams from setting Stealth Rock with Magic Bounce, notably shutting down Ferroseed, which Staryu struggles against. Grookey-weak Pokemon like Staryu, Mudbray, and Onix appreciate Larvesta countering and burning Grookey. Fast, frail attackers like Abra, Carvanha, and Choice Scarf Porygon appreciate Larvesta's ability to switch into Grookey and its slow U-turn. Diglett can trap Ponyta and Water-types like Mareanie and Staryu, especially after U-turn.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "goldenghost", "user_id": 32350}], "teams": [{"name": "Quality checked by", "members": [{"username": "Acehunter1", "user_id": 430377}, {"username": "DC", "user_id": 449990}]}, {"name": "Grammar checked by", "members": [{"username": "TuffLuxx", "user_id": 517249}]}]}
  },
  "Bunnelby": {"sets": {"Wallbreaker": {}}},
  "Pancham": {"sets": {"Wallbreaker": {"description": "<p>Pancham finds a niche in LC on Fighting-spam teams with Mienfoo. Its powerful Zen Headbutt allows Pancham to beat Poison-types like Koffing, Mareanie, and Foongus, distinguishing it from Timburr. Pancham can also either augment its Attack with Swords Dance or be a serviceable pivot with Parting Shot. Pancham partners well with Pawniard as it answers Porygon as well as Psychic-types such as Abra and Natu. Grookey is also an excellent partner for Pancham because it can revenge kill Pokemon such as Carvanha and Abra. Sludge Bomb Diglett can lure in and remove Grookey, which usually causes issues for Fighting-spam teams.</p>"}}, "credits": {"writtenBy": [{"username": "Peachy07", "user_id": 557247}], "teams": [{"name": "Quality checked by", "members": [{"username": "DC", "user_id": 449990}]}, {"name": "Grammar checked by", "members": [{"username": "DC", "user_id": 449990}]}]}},
  "Spritzee": {
    "sets": {
      "Defensive": {
        "description": "<p>Spritzee is the only viable user of Wish in LC, allowing it to heal both itself and its teammates. Unfortunately, giving up two turns to use Wish and Protect in a metagame where maintaining momentum is important can be costly. Covet lets Spritzee potentially steal an Eviolite from switch-ins such as Ferroseed and Koffing once its own Eviolite has been removed. Alternatively, Psychic can be run to hit Poison-types, such as Koffing and Foongus, on the switch. 12 Speed EVs allow Spritzee to outspeed Foongus. Ferroseed partners well with Spritzee, as Spritzee checks Fighting-types and Natu for Ferroseed and offers Wish. In exchange, Ferroseed deals with certain Poison-type checks such as Foongus and can set entry hazards, punishing Pokemon that try to switch into Spritzee and force it out, such as Koffing and Ponyta. Psychic-types, such as Natu, and Pokemon with strong Psychic-type coverage, such as Porygon, are also good choices for dealing with Poison-types. Fighting-types, such as Mienfoo and Timburr, also pair well with Spritzee, as they can take advantage of the Steel-types Spritzee draws in and benefit from Wish healing.</p>"
      },
      "Nasty Plot": {"description": "<p>This set gives Spritzee the chance to act as a late-game sweeper. With no Speed investment, zero Speed IVs, and a Quiet nature, Spritzee hits 6 Speed, which lets it outspeed every relevant Pokemon under Trick Room. After a Nasty Plot boost, Psychic OHKOes Pokemon such as Koffing, Foongus, and Mareanie after Stealth Rock. Steel-types, such as Pawniard outside of Trick Room and Ferroseed, present issues for this set, so Spritzee benefits from teammates that can deal with them, such as Ponyta and Mienfoo. Mienfoo can also serve as a pivot to bring Spritzee into play through U-turn. Fire-types such as Ponyta also beat this set, so trappers such as Diglett and Trapinch make for good teammates. Trapinch itself can even take advantage of Trick Room.</p>"}
    },
    "credits": {"writtenBy": [{"username": "aurora", "user_id": 109385}], "teams": [{"name": "Quality checked by", "members": [{"username": "DC", "user_id": 449990}]}, {"name": "Grammar checked by", "members": [{"username": "deetah", "user_id": 297659}]}]}
  },
  "Skrelp": {"sets": {"Special Attacker": {}}},
  "Tyrunt": {
    "comments": "<h1>Other Options</h1> <p>Crunch can be used to beat Frillish and Slowpoke, but Tyrunt usually can't afford to fit it. Thunder Fang can hit all bulky Water-types decently hard, but its low power makes it miss out on KOs after one boost. Ice Fang is a niche coverage option to hit would-be checks like Drilbur and Morelull.</p> <h1>Checks and Counters</h1> <p><strong>Bulky Ground-types</strong>: Trapinch, Mudbray, and Onix survive any move of +1 Tyrunt and threaten to KO it with Earthquake. Trapinch in particular is painful, as Arena Trap prevents Tyrunt from switching out and First Impression can take out a weakened Tyrunt before it can inflict damage.</p> <p><strong>Priority</strong>: Pokemon with strong priority moves, like Grookey, Pawniard, and Timburr, can take Tyrunt out if it gets too chipped while setting up and/or lowers its defenses by using Close Combat.</p> <p><strong>Bulky Water-types</strong>: Pokemon like Staryu, Frillish, and Slowpoke will almost always survive Rock Blast from full health. The first can hit Tyrunt with Ice Beam, while the other two can cripple it with status.</p>",
    "sets": {
      "Dragon Dance Sweeper": {
        "description": "<p>Tyrunt aims to sweep late-game with Dragon Dance after its checks have been weakened. Rock Blast KOes Natu after a boost with three hits or more, and it's Tyrunt's strongest option against most neutral targets. After one boost, Psychic Fangs KOes Mienfoo and Foongus, as well as bulky variants of Koffing and Mareanie after Stealth Rock damage. Close Combat KOes Pawniard and Porygon after a boost, and it hits Ferroseed and Onix hard. Fire Fang KOes Ferroseed after one boost while still hitting Pawniard, and it has the added benefit of not lowering Tyrunt's defensive stats, making it less susceptible to priority revenge killers.</p> <p>Tyrunt appreciates entry hazard support from Pokemon like Pawniard, Dwebble, and Diglett to break through bulkier foes. Memento Diglett also helps Tyrunt set up safely. Pawniard can lure in a Trapinch, sacrificing itself to weaken Trapinch with Knock Off, preventing it from beating Tyrunt later in the game. Grassy Terrain from Grookey weakens Earthquake from Diglett and Trapinch. Pokemon that deal with Timburr, like Koffing and Mareanie, are necessary to switch into Mach Punch for Tyrunt. Carvanha appreciates Tyrunt forcing the opponent to keep their Grookey and Staryu at high HP, which allows it to better damage the opposing team with Flip Turn. Dual screens Natu can be used to grant even safer setup opportunities.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Kipkluif", "user_id": 315003}], "teams": [{"name": "Quality checked by", "members": [{"username": "DC", "user_id": 449990}, {"username": "goldenghost", "user_id": 32350}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Amaura": {"sets": {"Choice Scarf": {}, "Screens Setter": {}}},
  "Mareanie": {
    "comments": "<h1>Other Options</h1> <p>Covet allows Mareanie to recover its Eviolite and cripple a foe after taking a Knock Off, but it is less reliable at making progress than Knock Off. Iron Defense can turn Mareanie into a wincon and makes it harder for Diglett to trap it. Toxic Spikes can cripple much of the metagame, but it is rarely useful because most teams have a Poison-type to absorb it. When using Toxic Spikes, it is optimal to set only one layer, as LC's low HP values and frequent switches cause regular poison to do more damage than Toxic poison.</p> <h1>Checks and Counters</h1> <p><strong>Diglett</strong>: Mareanie's Ground weakness makes it very vulnerable to being trapped by Diglett. Mareanie is bulky enough to survive an Earthquake or Earth Power from non-Life Orb sets though, so Diglett requires prior damage or Knock Off support to ensure the OHKO.</p> <p><strong>Psychic-type Pokemon and Coverage</strong>: Psychic-types force Mareanie out with their super effective attacks. Abra can OHKO Mareanie outright, Natu grabs momentum with U-turn, and Galarian Ponyta can set up on it. Psychic-type coverage from foes such as Staryu and Porygon can also threaten Mareanie. However, none of these foes appreciate switching into Knock Off or Sludge Bomb.</p> <p><strong>Mudbray</strong>: Mudbray outspeeds Mareanie and OHKOes it with its Ground attacks. However, Mudbray must be careful not to take a Scald, which hits it hard and can cripple it with a burn.</p> <p><strong>Koffing</strong>: Koffing denies Mareanie Regenerator recovery and hits it hard with Thunderbolt. However, it does not appreciate switching into Scald or Knock Off.</p> <p><strong>Bulky Grass-types</strong>: Ferroseed resists Mareanie's STAB combination and can make progress through Knock Off, Thunder Wave, or Stealth Rock. Foongus heals off any damage and threatens it with Spore. Mareanie can make progress against these foes with Knock Off or Scald burns.</p> <p><strong>Electric-type Pokemon and Coverage</strong>: Magnemite OHKOes Mareanie, while coverage from foes such as Porygon, Staryu, and Ponyta severely dents it. However, these foes are crippled by Knock Off and cannot safely switch in.</p>",
    "sets": {
      "Wall": {
        "description": "<p>Mareanie is a sturdy physical wall that is extremely tough to wear down thanks to its good bulk, solid defensive typing, and multiple forms of recovery in Regenerator and Recover. Scald can cripple physical attackers like Mienfoo and Pawniard with its high burn chance. Sludge Bomb hits Water-resistant foes like Grookey and Foongus and can also spread poison. Knock Off makes progress against common switch-ins like Ferroseed and opposing Mareanie. Maximum Defense investment allows Mareanie to avoid the 2HKO from Life Orb Grookey's Grassy Glide after Stealth Rock.</p> <p>Mareanie is one of the best Mienfoo checks in the metagame; thus, Fighting-weak teammates such as Porygon and Steel-types appreciate it. Steel-types such as Pawniard and Ferroseed form a strong defensive core with Mareanie, checking Psychic-types and Porygon, while Mareanie handles Mienfoo and Fire-types. Mareanie appreciates Grookey providing passive healing and weakening Diglett's Earthquake with Grassy Terrain. Natu switches into Ground-types and is a secondary Grookey check. Strong special attackers like Abra and Porygon appreciate Mareanie providing Knock Off support against Ferroseed.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "gali", "user_id": 107567}], "teams": [{"name": "Quality checked by", "members": [{"username": "goldenghost", "user_id": 32350}, {"username": "DC", "user_id": 449990}]}, {"name": "Grammar checked by", "members": [{"username": "DC", "user_id": 449990}, {"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Mudbray": {
    "comments": "<h1>Other Options</h1> <p>Counter, which should be used alongside Berry Juice, trades a coverage move for a surprise KO on physical attackers like Mienfoo. Facade is an option, usually on Choice Scarf Mudbray, to maintain offensive pressure after Mudbray has been burned by an attack like Koffing's Will-O-Wisp.</p> <h1>Checks and Counters</h1> <p><strong>Grookey</strong>: With its ability to set up Grassy Terrain, which reduces the power of Earthquake, and deal massive damage with Grassy Glide, Grookey is easily one of the biggest checks to Mudbray. However, Grookey cannot switch in multiple times, as it takes a lot of damage from Heavy Slam and Close Combat.</p> <p><strong>Natu</strong>: While it takes considerable damage from Heavy Slam, Natu can outlast Mudbray with Roost and prevent it from setting Stealth Rock and using Earthquake.</p> <p><strong>Water-types</strong>: Bulky Water-types such as Staryu, Frillish, and Slowpoke can switch into Mudbray and punish it with Scald, although they take a lot of damage from Earthquake if they lose their Eviolite. Offensive Water-types such as Carvanha and Life Orb Staryu can bypass Mudbray's ability to tank hits and OHKO it.</p> <p><strong>Air Balloon Diglett</strong>: Air Balloon Diglett can exploit Choice Scarf Mudbray if it is locked into a Ground-type attack by trapping and subsequently KOing it.</p>",
    "sets": {
      "Stealth Rock": {
        "description": "<p>Mudbray's natural bulk allows it to safely set Stealth Rock against many different Pokemon. Close Combat threatens Ferroseed, while Heavy Slam covers Natu and Grookey. Alternatively, Rock Slide can hit Natu harder, but it is weaker against Grookey. High Horsepower can be used instead of Earthquake to do more damage in Grassy Terrain, but it is less accurate than Earthquake and can be unreliable at times. Eviolite is usually preferred to maximize Mudbray's bulk, but Berry Juice can provide it with much-needed recovery.</p> <p>Stealth Rock Mudbray is amazing on certain offensive teams, as it allows Steel-types like Pawniard and Ferroseed to forgo Stealth Rock for other utility options. Furthermore, its ability to switch into Koffing is appreciated by certain defensive cores such as Mareanie + Ferroseed. Mudbray greatly struggles against Grookey and should be paired with partners such as Koffing, Natu, and Foongus that handle it. It also has difficulty beating Natu one-on-one consistently, so checks such as Frillish and your own Natu are good options.</p>"
      },
      "Choice Scarf": {
        "description": "<p>Mudbray is one of LC's best Choice Scarf users, as it outspeeds another popular Choice Scarf user in Porygon. This allows Mudbray to threaten KOs on fast, offensive threats like Abra, Ponyta, and Diglett. Mudbray's coverage moves seek to pave the way for its late-game sweep with Earthquake. Close Combat greatly damages Ferroseed and prevents Mudbray from being taken advantage of by Air Balloon Diglett. Heavy Slam provides great neutral coverage against foes like Natu and Grookey, while Rock Slide can be used to deal slightly more damage to Natu and for a useful flinch chance.</p> <p>Choice Scarf Mudbray fits well with other threats like Porygon to overwhelm shared checks like Ferroseed or to take advantage of Mudbray's checks like Grookey and Natu. Mudbray is relatively frail and appreciates pivot support from Mienfoo and Natu, as they can provide it a free switch into Pokemon like Koffing and Pawniard. It is imperative that Mudbray be played carefully around Air Balloon Diglett, as recklessly using Earthquake or High Horsepower to KO a foe like Mareanie can leave Mudbray trapped.</p>"
      },
      "RestTalk": {"description": "<p>A RestTalk set greatly improves Mudbray's longevity, allowing it to beat several Pokemon, such as Mienfoo and Natu, one-on-one. It can even survive hits from threatening special attackers such as Abra thanks to its Special Defense investment and retaliate with a powerful hit. Heavy Slam is the best coverage to hit Flying-types and Ground-immune foes like Air Balloon Diglett.</p> <p>RestTalk Mudbray usually finds itself on more offensive teams like Fighting spam as a way to keep offensive momentum and provide a much-needed defensive backbone. Grookey is still a terror for Mudbray, so pairing it with Koffing, Foongus, and Natu is recommended. RestTalk Mudbray also struggles against Water-types such as Frillish and Staryu because they can take advantage of it using Rest or force it out. As such, partners like Pawniard and Ferroseed are recommended; they also help it by checking threats like Abra and Porygon.</p>"}
    },
    "credits": {"writtenBy": [{"username": "wesh papillon", "user_id": 481831}], "teams": [{"name": "Quality checked by", "members": [{"username": "gali", "user_id": 107567}, {"username": "goldenghost", "user_id": 32350}]}, {"name": "Grammar checked by", "members": [{"username": "DC", "user_id": 449990}, {"username": "dex", "user_id": 277988}]}]}
  },
  "Morelull": {
    "sets": {"Defensive": {"description": "<p>Morelull's niche over Foongus is being a check to Fighting-types and Grookey that isn't weak to Psychic, letting it also check Psychic Fangs Tyrunt and Carvanha. Morelull also offers teams key resistances to Ground- and Dark-type moves. Effect Spore gives Morelull a chance to punish Pokemon using contact moves, such as Flip Turn Carvanha and Mienfoo. Foongus and Ferroseed both wall Morelull and are immune to Spore; Natu can deal with these Pokemon thanks to Magic Bounce and Heat Wave. Morelull is greatly threatened by Poison-types such as Koffing and Mareanie and Fire-types such as Ponyta and Vulpix. Ground-types such as Diglett and Onix and Water-types such as Frillish and Staryu can deal with these Pokemon. In return, they benefit from Morelull dealing with Grookey and Staryu.</p>"}},
    "credits": {"writtenBy": [{"username": "aurora", "user_id": 109385}], "teams": [{"name": "Quality checked by", "members": [{"username": "Fiend", "user_id": 208173}, {"username": "Acehunter1", "user_id": 430377}]}, {"name": "Grammar checked by", "members": [{"username": "DC", "user_id": 449990}]}]}
  },
  "Sandygast": {"sets": {"Defensive": {}}},
  "Grookey": {
    "comments": "<h1>Other Options</h1> <p>Grookey's Wood Hammer is one of the strongest unboosted attacks in the tier and can deal surprisingly heavy damage to even bulky Grass-resistant foes like Koffing. Fake Out can help wear down speedy threats like Choice Scarf Porygon with extra priority.</p> <h1>Checks and Counters</h1> <p><strong>Foongus</strong>: Foongus does not fear Grookey's attacks and can repeatedly switch in thanks to Regenerator. It threatens Grookey back with Sludge Bomb and can punish switches with Spore. Foongus must beware the rare Grassy Seed + Acrobatics set, though, and it can be frustrated by U-turn into Koffing or Ferroseed.</p> <p><strong>Koffing</strong>: Koffing resists Grookey's Grassy Glide and has impressive physical bulk to take multiple hits from it. Koffing is vulnerable to being chipped down over the course of a match by attacks and entry hazards, but it can recover with Pain Split.</p> <p><strong>Natu</strong>: Natu resists Grassy Glide and threatens back with Heat Wave and U-turn. It takes heavy damage from Knock Off, though, and must beware switching into or facing Grookey below full health, especially with Stealth Rock up.</p> <p><strong>Fire-types</strong>: Ponyta, Larvesta, and Vulpix all resist Grassy Glide and easily KO Grookey in return. Flame Body makes Larvesta and occasionally Ponyta especially troublesome, as both can punish Grookey for attacking carelessly with a burn, which renders it useless. Vulpix and Berry Juice Ponyta cannot comfortably switch in, though, as they fear Knock Off.</p> <p><strong>Trappers</strong>: Despite all sets preparing for First Impression, Grassy Terrain weakening Earthquake, and Grassy Glide providing priority, Grookey must still worry about Trapinch and Diglett in certain circumstances. Trapinch can revenge kill weakened Eviolite Grookey with First Impression, while Diglett can run a set with Sludge Bomb and Focus Sash to guarantee a KO against Life Orb Grookey.</p>",
    "sets": {
      "Life Orb": {
        "description": "<p>Life Orb Grookey is both a powerful wallbreaker and a crucial safety net thanks to having the tier's strongest priority attack in its Grassy Glide. Knock Off does heavy damage to Natu and softens Foongus, Koffing, and Ponyta on the switch, all of which wall Grookey otherwise. Drain Punch OHKOes Pawniard and hits Ferroseed and Magnemite hard. U-turn is an alternative that deals decent damage to Foongus and allows Grookey to pivot, bringing in trappers or powerful attackers that take advantage of its checks. Protect blocks Trapinch's First Impression and Mienfoo's Fake Out, and it can be used to heal off Life Orb and entry hazard damage with extra Grassy Terrain turns.</p> <p>Grookey forms a formidable offensive core with Mienfoo, as they both wear down opposing Poison-types, especially Koffing. Ponyta threatens Foongus for Grookey, which handles Water-types and inhibits Diglett and Trapinch's trapping with Grassy Terrain. Natu and Ferroseed switch into Foongus well, and Koffing also handles Foongus while blocking its Regenerator with Neutralizing Gas and wearing it down. Natu and Koffing pressure Ferroseed as well. Abra and Porygon provide offensive synergy by beating Natu and bulky Poison-types. Frillish, Staryu, and Mareanie check Fire-types, and Mareanie especially appreciates Grassy Terrain weakening Earthquake. Pawniard provides invaluable Stealth Rock support and is the most reliable setter against Natu.</p>"
      },
      "Eviolite": {
        "description": "<p>Eviolite Grookey trades power for reliable bulk to survive important attacks like Abra's Psychic, Natu's Heat Wave, Trapinch's First Impression, and Diglett's Sludge Bomb. Knock Off hits Natu hard while softening Foongus, Koffing, and Ponyta. Drain Punch OHKOes Pawniard and deals solid damage to Ferroseed and Magnemite. U-turn lets Grookey pivot off checks like Koffing and Foongus. Swords Dance is an option that takes advantage of this set's survivability to sweep.</p> <p>This set's decent bulk makes it a good fit for teams that lack a Ground-immune Pokemon, as it can check Mudbray and Diglett in a pinch. Grookey and Mienfoo work together to wear down opposing Poison-types for one another. Koffing handles Foongus well and can wear it down off a Grookey U-turn by blocking Regenerator with Neutralizing Gas. Ponyta can capitalize on Foongus and enjoys Grassy Terrain weakening Earthquake from Diglett and Trapinch. Ferroseed hard counters Foongus, while Natu checks Foongus and Koffing and can form part of a U-turn core with Grookey. Abra and Porygon are both strong special attackers that can take advantage of bulky Poison-types and Natu. Staryu, Frillish, and Mareanie handle Fire-types, and Mareanie additionally benefits from Grassy Terrain weakening Diglett's Earthquake.</p>"
      },
      "Grassy Seed": {
        "description": "<p>Grassy Seed Grookey acts as a decently strong wallbreaker and late-game cleaner. The combination of Grassy Surge and Grassy Seed empowers Acrobatics, allowing Grookey to muscle through checks like Mienfoo and Larvesta as well as opposing Grass-types in Foongus, Grookey, and Morelull. Drain Punch provides good coverage against Ferroseed and OHKOes Pawniard. Knock Off is a noteworthy mention that lets +2 Grookey OHKO Natu, but it worsens Grookey's matchup against Pawniard. The Defense boost from Grassy Seed allows Grookey to survive Trapinch's First Impression.</p> <p>This set works exceptionally well when paired up with Mienfoo, which can bring Grookey in safely with U-turn and help soften up checks in Koffing, Natu, and Ponyta. Diglett can trap Mareanie and Ponyta so that Grookey has an easier time sweeping. Psychic-types in Abra and Natu work great alongside Grookey, beating Poison-types such as Koffing and Mareanie. Stealth Rock Pawniard is a great partner that can beat Natu and benefit from Grassy Terrain weakening Earthquake. Tyrunt can take advantage of Fire-types like Vulpix, and it similarly appreciates the Grassy Terrain support.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "goldenghost", "user_id": 32350}, {"username": "Lasen", "user_id": 273339}], "teams": [{"name": "Quality checked by", "members": [{"username": "DC", "user_id": 449990}, {"username": "gali", "user_id": 107567}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}, {"username": "DC", "user_id": 449990}]}]}
  },
  "Scorbunny": {
    "sets": {
      "All-out Attacker": {
        "description": "<p>This set seeks to take advantage of Scorbunny's ability to single-handedly take down one of LC's most prominent defensive cores in Ferroseed + Spritzee while also maintaining the ability to pivot out of common switch-ins, such as Mareanie, and give Scorbunny's teammates more opportunities for advantageous matchups. Bring Scorbunny in on Grass- and Steel-types and use the pressure of its super effective STAB moves due to Libero to use U-Turn to pivot out of the opponent's switch-in to control momentum and keep exerting pressure on the opponent. High Jump Kick gives Scorbunny the ability to hit incoming Rock-types, though it does not possess the raw power to OHKO them in most cases. As a result, it's generally better to hold off on using High Jump Kick until the foe takes enough chip damage via U-turn and hazard damage. Sucker Punch is also an option if your team already has sufficient Rock-type answers elsewhere to provide Scorbunny with a way of getting off some damage against faster Pokemon such as Diglett and Galarian Ponyta. Berry Juice is the preferred item for Scorbunny, as it provides greater longevity by allowing Scorbunny to combat being worn down by hazards as it pivots in and out of the fight.</p> <p>Pokemon who appreciate Scorbunny's ability to deal with Ferroseed and Spritzee, such as Shellder or Onix synergize quite well with Scorbunny. Additionally, Pokemon that can capitalize off of the free switch in opportunities that Scorbunny provides, such as Corphish or Mudbray, are quite appealing teammates. Trappers like Diglett and Trapinch are often able to easily remove common answers to Scorbunny, such as Mareanie. A pivot such as Chinchou is also a great option to form a nice VoltTurn core. Chinchou can also pile the pressure on Frillish and other Water-type Scorbunny switch-ins that aren't opposing Chinchou. Ferroseed and other hazard setters are great teammates, as the chip damage provided via their hazards can be crucial in wearing down and ultimately busting through opposing teams. Lastly, hazard removal from the likes of Staryu, for example, will allow Scorbunny to not be worn down as easily and remain a threat, thus being able to apply pressure throughout a match.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Joltage", "user_id": 242047}], "teams": [{"name": "Quality checked by", "members": [{"username": "Merritt", "user_id": 213064}, {"username": "zizalith", "user_id": 410251}]}, {"name": "Grammar checked by", "members": [{"username": "dhelmise", "user_id": 241023}]}]}
  }
}