{
  "Blastoise": {"sets": [{"name": "Shell Smash Sweeper"}]},
  "Nidoking": {
    "overview": "<p>Nidoking's presence in the BDSP OU metagame is marked by its powerful, Sheer Force boosted moves. Between its good STAB combination, wide variety of coverage moves, and the large number of Pokemon threatened by its strong attacks, such as Heatran and Clefable, it naturally performs well against balance and stall teams. However, Nidoking can struggle against more offensive teams thanks to its underwhelming Speed tier and weakness to common offensive typings like Water, Ground and Psychic. Furthermore, even in good matchups it can feel a bit prediction reliant, as the opponent can pivot around its moves into a faster threat.</p> ",
    "sets": [
      {
        "name": "Wallbreaker",
        "description": "<p>Ice Beam mainly hits Gliscor and Garchomp, but it is generally a good middle ground-option to hit Dragon- and Ground-types in general, such as Dragonite, Donphan, Latios and Latias. Flamethrower is used to OHKO Scizor and Skarmory, as well as ease prediction against Steel-types. A Timid nature allows Nidoking to outspeed Timid Heatran, Jolly Feraligatr and Adamant Lucario, but the power boost Modest provides can be appealing to some teams.</p> <p>Nidoking mainly fits on balance and bulky offense, as it is a useful tool for dismantling bulkier teams. Due to its poor defensive profile, Nidoking can struggle to get onto the field; therefore, it appreciates pivoting support from teammates such as Rotom-W and Scizor. The former can even switch into Water types that might give Nidoking trouble, while the latter can do the same for Psychic types. It also pairs well with more offensive pivots, like Choice Band Infernape, who can pressure Blissey, the best answer to Nidoking. Entry Hazards can amplify Nidoking's wallbreaking potential, and as such, setters like Heatran and Skarmory are great partners. Dragon-types like Dragonite and Latios enjoy the pressure Nidoking puts on Clefable and Steel-types.</p> <h1>Other Options</h1> <p>Nidoking can run Focus Punch over Flamethrower to lure in and heavily damage Blissey, leaving it unable to answer it anymore. However, the lack of any use beyond this specific matchup makes the reliability of Flamethrower more valuable for most teams. Toxic Spikes can help wear down some of its checks like the afromentioned Blissey, as well as Slowking, while supporting its teammates. However, this can limit Nidoking's wallbreaking capabilities. A Focus Sash set with Stealth Rock is another option, as Nidoking beats Gliscor, one of the best defoggers in the tier, and can get something done even in unfavorable matchups. However, dropping Life Orb leaves Nidoking unable to net some important KOs, such as against Scizor and Rotom-W. Nidoking can also run Thunderbolt as another useful coverage option to hit bulky Water types that might otherwise give it trouble, like Milotic and Slowking, but those targets aren't common enough to warrant the move's usage most of the time.</p> <h1>Checks and Counters</h1> <p><strong>Revenge Killers: Due to its average speed and middling bulk, a lot of fast Pokémon can easily revenge kill Nidoking, such as Latios, Garchomp, Weavile, and Starmie. Crawdaunt and Azumarill can OHKO it with Aqua Jet.</p> <p><strong>Blissey: Blissey is by far the best answer to Nidoking, easily tanking all its moves aside from the rare Focus Punch while sporting reliable recovery in Soft-Boiled. While it can be overwhelmed through team support, it is often a hard stop to anything Nidoking does.</p> <p><strong>Water-types</strong>: Some Water-types, like Slowking or Milotic, can switch into most of Nidoking's attacks and threaten it back with their Water STAB moves. Choice Scarf Rotom-W can switch into anything but Sludge Wave, outspeed it and threaten it with Hydro Pump.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 277988, "username": "dex"}, {"user_id": 279858, "username": "Lalaya"}]}, {"name": "Grammar checked by", "members": [{"user_id": 277988, "username": "dex"}]}], "writtenBy": [{"user_id": 504171, "username": "VTMagno"}]}
  },
  "Clefable": {"sets": [{"name": "Utility"}]},
  "Alakazam": {
    "overview": "<p>Alakazam is a premier wallbreaker in BDSP OU, tearing holes through slower teams lacking a hard counter. Alakazam's high Speed tier lets it outspeed other prominent threats such as Infernape and Starmie, forcing them out with its superb coverage. Furthermore, Magic Guard gives Alakazam a myriad of benefits, such as preventing it from being worn down by entry hazards, preserving its Focus Sash, and mitigating Life Orb recoil. Furthermore, counterplay to Alakazam differs depending on what item it is running; using a Life Orb denies nearly all defensive counterplay options through its sheer power, while running a Focus Sash prevents Alakazam from being instantly revenge killed, which is often enough for it to break apart more offensive teams. However, Alakazam is not without its flaws, as its physical bulk is extremely poor, causing it to be revenge killed easily and limiting its setup opportunities. Moreover, its reliance on Focus Blast to deal with Dark- and Steel-types means just one miss can ruin it. Additionally, while Alakazam has a strong offensive presence, it rarely ever threatens to OHKO foes without a boost, meaning if Focus Sash has been broken or it is known to be using a Life Orb, multiple Pokemon can just tank a hit from it and OHKO it back.</p> ",
    "comments": "<h1>Other Options</h1> <p>Recover gives Alakazam the chance to heal off weak hits and use passive Pokemon like non-Calm Mind and non-Thunder Wave Blissey as complete setup fodder while restoring its Focus Sash should it get chipped. However, Alakazam's pitiful bulk makes this option rarely relevant in practice. Dazzling Gleam gives Alakazam a consistent option to hit Dark-types without Focus Blast's chance to miss; however, it is much weaker and leaves Alakazam helpless against some Steel-types. If Shadow Ball is replaced, Alakazam becomes unable to break Jirachi and opposing Alakazam, making Dazzling Gleam a much worse option regardless of what move is dropped. Encore can lock Pokemon into a non-damaging move, giving Alakazam or its teammates free setup turns; however, it is inconsistent and can very rarely be used. Taunt is usable on hyper offense teams to prevent entry hazards or dual screens from going up from slower leads like Azelf and Skarmory while preventing the likes of Scizor and Skarmory from recovering. It can also deny Defog from Scizor and Gliscor, helping teammates like Lucario and Feraligatr sweep more easily.</p> <h1>Checks and Counters</h1> <p><strong>Steel-types: Scizor walls Focus Sash variants of Alakazam, while Life Orb variants require getting a sequence correct and landing multiple Focus Blasts, making Scizor as close to a counter as you can get. Heatran can switch into Alakazam's Psychic-type STAB moves and Shadow Ball a few times and force it out; however, it can lose if Alakazam uses Nasty Plot or Focus Blast as it switches in. Similarly, Jirachi can switch into Alakazam's Psychic-type STAB move and Focus Blast; however it loses if Alakazam sets up with Nasty Plot or hits it with Shadow Ball on the switch.</p> <p><strong>Revenge Killing: Faster Pokemon like Weavile and Choice Scarf Garchomp can revenge kill Alakazam, although they are unable to safely switch into it directly. Beat Up and Dual Chop, respectively, bypass Alakazam's Focus Sash if it has one, making them much more consistent at checking it. Priority such as Dragonite and Lucario's Extreme Speed and Crawdaunt's Aqua Jet easily remove Alakazam due to its poor physical bulk; however, they are unable to switch into it. To add onto that, Focus Sash variants of Alakazam can live one hit from full HP and potentially KO these Pokemon back. As such, this requires Alakazam to either be chipped or scouted first in order to consistently revenge kill it.</p> ",
    "sets": [
      {
        "name": "Nasty Plot",
        "description": "<p>Psychic is Alakazam's STAB move of choice due to its higher Base Power; however, Psyshock allows Alakazam to break through special walls such as Gastrodon and Blissey much more easily, especially with a Life Orb. Focus Blast lets Alakazam nail the Steel- and Dark-types that would otherwise wall it such as Tyranitar, Scizor, and Heatran. Shadow Ball deals with opposing Psychic-types such as opposing Alakazam, and Jirachi, which can switch into Focus Blast and Alakazam's Psychic-type STAB move. Magic Guard benefits Alakazam no matter which item it is running; if running Life Orb, Magic Guard prevents its recoil; if running Focus Sash, Magic Guard preserves it in the face of entry hazards. Life Orb can be used to wallbreak much more effectively, notably allowing Alakazam to 2HKO Scizor with Focus Blast after Stealth Rock chip. Focus Sash in turn provides a one-time safety net for Alakazam to setup for free or revenge kill something safely.</p> <p>Alakazam fits best on offense and bulky offense teams, as both archetypes are fast-paced enough to take advantage of Alakazam punching holes in opposing walls while still maintaining the ability to safely bring it in multiple times. Due to Alakazam's frailty, it greatly appreciates slow pivoting from Pokemon such as Gliscor, Rotom-W, and Scizor to bring it in safely. Stealth Rock support from the aforementioned Gliscor, Heatran, and Garchomp are extremely useful, as they allow Alakazam to break through its checks more easily. Azelf is a solid partner, as it can form an exceptionally potent Psychic Spam core, weakening their shared checks. The likes of Weavile, Nidoking, and Nasty Plot Rotom-W work well with Alakazam to wallbreak for each other. A strong defensive core is also appreciated alongside Alakazam, as it invites in powerful revenge killers like Weavile. Focus Sash Alakazam works exceptionally well on hyper offense teams with partners such as Feraligatr, Azumarill, and Lucario, as it provides a one-time countermeasure to opposing sweepers and can clean weakened teams due to its high Speed tier, all while Focus Sash prevents it from being revenge killed by priority. Clefable also can assist Scizor in checking the likes of Garchomp and Weavile on balance teams, as Scizor can get easily overwhelmed.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 277988, "username": "dex"}, {"user_id": 279858, "username": "Lalaya"}]}, {"name": "Grammar checked by", "members": [{"user_id": 277988, "username": "dex"}]}], "writtenBy": [{"user_id": 529732, "username": "adem"}]}
  },
  "Slowbro": {"sets": [{"name": "Defensive Pivot"}]},
  "Cloyster": {"sets": [{"name": "Shell Smash Sweeper"}]},
  "Weezing": {"sets": [{"name": "Defensive Utility"}]},
  "Starmie": {"sets": [{"name": "Offensive Rapid Spin"}, {"name": "Defensive Rapid Spin"}]},
  "Dragonite": {"sets": [{"name": "Choice Band"}, {"name": "Setup Sweeper"}]},
  "Mew": {"sets": [{"name": "Utility"}]},
  "Azumarill": {
    "overview": "<p>Azumarill graces BDSP OU as either a terrifying, hard-to-scout Belly Drum sweeper or a strong wallbreaker with Choice Band. Huge Power, STAB priority in Aqua Jet, and a rarely-resisted STAB combination back up its offense, while its Water / Fairy typing helps it switch into prominent Dragon-types and some offensive threats. Azumarill is generally a strong option for hyper offense and standard offense teams, since Aqua Jet is handy in the priority-heavy BDSP OU metagame, and it switches into offensive foes such as Feraligatr, Weavile, and Infernape to quickly wreak havoc. However, it needs support to stay healthy %mdash;especially if using Belly Drum— and to handle certain threats. Its low Speed leaves it vulnerable defensively despite its decent bulk and Aqua Jet, and it needs help to pressure the common Breloom and Rotom-Wash, which massively threaten it in return. Azumarill's main set, Belly Drum + Sitrus Berry, also struggles to beat Unaware Clefable, a common defensive glue Pokemon that it can't 2HKO. Still, Azumarill usually only needs one window of opportunity to either sweep or put a dent in the opposition.</p> ",
    "comments": "<h1>Other Options</h1> <p>Belly Drum Azumarill can run an alternative EV spread of 92 HP / 252 Atk / 164 Spe with an Adamant nature. This spread improves its bulk while still outspeeding defensive Skarmory. Facade is a niche alternative to Superpower for Choice Band Azumarill that allows it to still be functional if it is burned.</p> <h1>Checks and Counters</h1> <p><strong>Grass-types: Defensive Tangrowth can switch into Choice Band Azumarill, but it has to scout Azumarill's set, since Belly Drum lets Play Rough OHKO it. Breloom falls to Play Rough but resists Aqua Jet and outspeeds Azumarill, letting it revenge kill Azumarill with Seed Bomb or Bullet Seed. It can also use Spore and then set up. Shaymin forces Azumarill out with Seed Flare and can stomach +6 Aqua Jet; however, it cannot switch into Choice Band Play Rough unless it has Defense investment.</p> <p><strong>Rotom-W: Rotom-W can cripple Azumarill with Will-O-Wisp, resists Aqua Jet, and easily threatens massive damage with Volt Switch or Thunderbolt. While Rotom-W doesn't like to take a Play Rough on the switch, Azumarill can only outspeed even uninvested Rotom-W with a suboptimal Jolly nature.</p> <p><strong>Bulky Water-type Pokemon</strong>: Quagsire with Unaware can avoid 2HKOs from Belly Drum Azumarill and stall it out with Toxic barring Waterfall flinches, but it does struggle against the Choice Band set, which cleanly 2HKOes it. Empoleon can phaze Belly Drum Azumarill one time, but it fares much better against the Choice Band set, as it can take all its attacks besides Superpower. Milotic naturally outspeeds Azumarill and wipes out its Belly Drum boost with Haze. Milotic struggles against the Choice Band set, though, since Play Rough 2HKOes unless Marvel Scale is active. Azumarill, regardless of the set, fears a Scald burn when facing bulky Water-types in general.</p> <p><strong>Revenge Killers: Most offensive threats can damage Belly Drum Azumarill enough that it either can't set up or enters KO range for most priority moves. Azumarill's most notable revenge killers are Latias, and Starmie, which can safely take a +6 Aqua Jet, even with chip damage, and OHKO Azumarill. Focus Sash Alakazam can also check Azumarill in a pinch, being able to deal with the Choice Band set with two Psychic hits, provided Azumarill isn't locked into Aqua Jet.</p> <p><strong>Faster Priority: Lucario, Dragonite, and offensive Scizor can pick off weakened Azumarill with priority before it can use Aqua Jet. Choice Band Dragonite can even take a Play Rough from Choice Band Azumarill, 2HKOing in return with Extreme Speed.</p> ",
    "sets": [
      {
        "name": "Belly Drum",
        "description": "<p>This set is designed for Azumarill to clean up late-game or heavily cripple the opposition. Once set-up Aqua Jet is its go-to move for most situations thanks to its priority. Sitrus Berry helps Azumarill beat priority revenge killers and take a hit while setting up. Mystic Water is an alternative to strengthen Aqua Jet and give a small chance to 2HKO Unaware Clefable with Waterfall. Azumarill can set up against a Latias Choiced locked into Draco Meteor or Surf, or on a Garchomp locked into Outrage. After setting up, Azumarill does need to worry about phazers like full-health Skarmory and maximally physically defensive Empoleon, but it can blow past chipped Skarmory and other Empoleon sets.</p> <p>Azumarill works best on hyper offense teams, where it can immediately threaten a sweep after a turn of setup. This set does get checked by Unaware Clefable, which is a common blanket check for the numerous setup sweepers in the tier, so a teammate like Lucario that can deal with it is great. Azumarill will need teammates that can handle Shaymin and Breloom, since both can take an Aqua Jet at +6 and threaten it with an OHKO. The most important tip with using this set is to, before sweeping, use teammates to wear down or take out Pokemon that avoid the OHKO from +6 Aqua Jet. For example, Choice Scarf users such as Infernape can wear down Starmie, and Latias with U-Turn. Scizor's U-Turn threatens to OHKO those threats and can get Azumarill into the game safely without losing momentum. Alakazam and Weavile both threaten Starmie, and Latias with their superior Speed. Garchomp is another great teammate for Azumarill to provide Stealth Rock and also deal with Magnezone, which outspeeds Azumarill and threatens it before Belly Drum. Azelf, and suicide lead Skarmory support Azumarill and its hyper offense teammates with dual screens and entry hazards. Focus Sash Alakazam, Breloom, and Dragonite are notable late-game cleaners that appreciate Azumarill's wallbreaking ability, which makes their roles easier.</p> "
      },
      {
        "name": "Choice Band",
        "description": "<p>Choice Band makes Azumarill a potent immediate wallbreaker with very few switch-ins, which forces frightening predictions. Even Slowbro has a modest chance to get 2HKOed by Play Rough after Stealth Rock. The most notable difference from Belly Drum Azumarill is that this set beats the premier Unaware users of the tier: Clefable and Quagsire. Choice Band Azumarill's fourth move of choice is Superpower, which can take out Steel-types such as Empoleon, Lucario, and Magnezone on the switch.</p> <p>Choice Band Azumarill struggles against bulky Grass-types. Weavile can handle Shaymin and Tangrowth alongside Starmie, and Latias. Infernape can pivot Azumaril in with U-Turn alongside beating the Grass-types of the tier. Garchomp switches into Volt Switch and Electric-type moves in general, along with providing Stealth Rock for offense teams. Scizor pivots Azumarill in and tends to invite in Heatran and Infernape, which Azumarill performs well against. Rotom-W and Gliscor are notable defensive pivots that Azumarill works well with thanks to their Will-O-Wisp support and Electric immunity, respectively. Focus Sash Alakazam appreciates Choice Band Azumarill bulldozing the opposition and weakening its checks so it can clean up.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 277988, "username": "dex"}, {"user_id": 279858, "username": "Lalaya"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 327020, "username": "TyCarter"}]}
  },
  "Quagsire": {"sets": [{"name": "Unaware"}]},
  "Slowking": {"sets": [{"name": "Defensive Pivot"}]},
  "Scizor": {
    "overview": "<p>Scizor is a defining Pokemon in BDSP OU due to its amazing typing, bulk, and versatility alongside its decent coverage. It's easy to fit on teams, checking common wallbreakers in Alakazam and Weavile. It can be a slow defensive pivot, thanks to U-turn, a defensive Swords Dance cleaner late-game, or a dangerous offensive Swords Dance sweeper; the former two even can be compressed onto the same set. However, Scizor finds itself too reliant on Bullet Punch to deal damage, which allows Steel-resistant Pokemon such as Skarmory, Heatran, and Lucario to take advantage of it. Scizor is also vulnerable to the common Magnezone, which can trap and easily deal heavy damage to it. Scizor has a quadruple weakness to Fire, allowing Pokemon such as Garchomp, Clefable, and Togekiss to run Fire-type coverage, bait in Scizor, and OHKO it. Furthermore, defensive Scizor is setup fodder against the likes of Feraligatr, Dragonite, and Nasty Plot Rotom-W.</p> ",
    "comments": "<h1>Other Options</h1> <p>Scizor can run a Choice Band set with an EV spread of 252 Atk / 4 Def / 252 Spe, a Jolly or Adamant Nature, and a moveset of Bullet Punch, U-turn, Brick Break, and Roost. This set can serve as a wincon on bulky offense or balance teams, but Scizor is severely outclassed by other Choice Band users, as a Choice-locked Scizor is easier to deal with. A 252 HP / 156 Def / 100 SpD set with Shed Shell as the item can be used, strictly on balance, to semi-check Latios and escape Magnezone's Magnet Pull. However, this is rarely run as Scizor prefers Leftovers much more.</p> <h1>Checks and Counters</h1> <p><strong>Fire-type Pokemon: Infernape and Heatran can switch into Scizor and effortlessly OHKO it with their STAB moves. However, Scizor can get momentum off of them with U-turn. Heatran must watch out for Brick Break, and Infernape may be OHKOed by boosted Quick Attack and is liable to taking chip damage. Similarly, the likes of Azelf, Togekiss, Clefable, and Garchomp can bait in Scizor and OHKO it with a Fire-type coverage move.</p> <p><strong>Magnezone: Magnezone can trap Scizor and 2HKO it with Choice Specs Thunderbolt. However, Magnezone does need to watch out for Brick Break, which can 2HKO it.</p> <p><strong>Water-type Pokemon</strong>: Rotom-W, Slowbro, Starmie, and Milotic switch into Scizor and check it reliably. Rotom-W can status Scizor with Thunder Wave and Will-O-Wisp or 2HKO it with a boosted Hydro Pump. Slowbro and Milotic wall defensive Scizor forever and can use Scald to burn it, with Slowbro even capable of 2HKOing it with Flamethrower. Similarly, Life Orb Starmie can switch in and 2HKO Scizor with Hydro Pump, but it must watch out for U-turn, which can 2HKO it.</p> <p><strong>Steel-type Pokemon: Pokemon like Skarmory and Lucario can switch into Scizor and comfortably check it. Skarmory can freely set up entry hazards on Scizor and can also use Taunt to prevent it from using Defog. Lucario can use Scizor as a free chance to set up Swords Dance, proceeding to OHKO it.However, Lucario must watch out for Brick Break.</p> ",
    "sets": [
      {
        "name": "Defensive",
        "description": "<p>Technician-boosted Bullet Punch makes up for Scizor's low Speed tier, as it can be a reliable revenge killer. U-turn is the other STAB move of choice to slowly pivot and safely bring in other teammates. Swords Dance allows Scizor to become a sweeper or a late-game cleaner, using priority Bullet Punch to sweep. Defog is another option if your team already has a setup sweeper or lacks a Defogger. Alternatively, a spread of 252 HP / 156 Def / 100 SpD can be used to check Weavile more reliably.</p> <p>Scizor appreciates Defoggers like Gliscor and Latias to allow it to come onto the field more comfortably. Scizor is quadruply weak to Fire, so Fire-resistant Pokemon such as Latias, Starmie, and Rotom-W pair well with it. Starmie and Rotom-W are amazing with Scizor, as they threaten Infernape, Heatran, Skarmory, and Lucario. Additionally, Rotom-W and Gliscor are slow pivots and can form potent VoltTurn cores with it. Dangerous wallbreakers like Garchomp, Infernape, and Crawdaunt benefit from Scizor's slow U-turn allowing them free entry. Weavile, Alakazam, and Mamoswine also benefit from this, as they struggle to enter the field at times. Scizor finds it hard to deal with Magnezone Ground-types like Gliscor and Garchomp provide reliable counterplay against it. Scizor struggles greatly with setup sweepers like Nasty Plot Rotom-W, Feraligatr, and Dragonite, so Unaware Clefable makes a good partner to handle them Scizor struggles to dealing with the majority of bulky Water-types like Rotom-W, Slowbro, and Milotic, so partners like Shaymin and Rotom-C are helpful to deal with these checks, and Scizor can check the likes of Weavile for them. Shaymin can provide Healing Wish if Scizor is at very low HP and Rotom-C can cripple Scizor's checks with Trick Tangrowth can also help check Rotom-W, but due to its lacking Special Defense it is a lot shakier at doing so.</p> "
      },
      {
        "name": "Offensive Swords Dance",
        "description": "<p>Quick Attack is another priority move used as coverage, as it is also boosted by Technician and can hit the likes of Rotom-W and Infernape. Brick Break deals with Magnezone and Heatran, OHKOing both after a Swords Dance. The EVs allow Scizor to outspeed Modest Magnezone, and maximum Attack investment with an Adamant nature notably enables Scizor to 2HKO the likes of Gliscor and Skarmory after a Swords Dance.</p> <p>This set fits best on hyper offense teams, which value Scizor's Steel typing and priority moves. Dual screens setters such as Azelf and Espeon allow Scizor to set up and sweep more easily. Azelf can provide Taunt and Explosion to stop other leads in their tracks and provide momentum, while Espeon provides Magic Bounce and Yawn to annoy other leads and deny entry hazards reliably. Hazard setters such as Focus Sash Azelf, Focus Sash Mamoswine, Custap Berry Skarmory, and Roserade can put Pokemon in range of Scizor's attacks, like putting Infernape in range of a boosted Quick Attack. Setup sweepers like Lucario, Infernape, Dragonite, and Breloom also provide setup and priority, wearing down threats reliably and creating insane offensive pressure, They can also take out the Fire-types that Scizor lures in, such as Heatran and Infernape, or weaken them with priority moves for Scizor to take them out later on. Similarly, Feraligatr takes care of these Fire-types, and it also forcibly chips bulky Water-types despite lacking priority. Offensive entry hazard removers like Starmie and Donphan not only keep the pressure on the opponent, but also allow Scizor to enter the field without harming its ability to sweep.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 279858, "username": "Lalaya"}, {"user_id": 277988, "username": "dex"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}, {"user_id": 277988, "username": "dex"}]}], "writtenBy": [{"user_id": 573472, "username": "ATowerFalledXD"}]}
  },
  "Skarmory": {"sets": [{"name": "Spikes Setter"}, {"name": "Suicide Lead"}]},
  "Blissey": {
    "overview": "<p>Blissey is standard on stall teams and something to consider on other bulky teams for its ability to wall almost every special attacker, even strong ones like Latios and Starmie. It doubles up as a status absorber and can work as a defensive win condition that beats most stallbreakers with its Calm Mind set or support its team with its utility set. However, Blissey's passivity can be exploited by physical attackers like Azumarill, Lucario, Mamoswine, and Breloom. Furthermore, even Blissey cannot deal with some of the most problematic special attackers, such as Life Orb Alakazam and stallbreaker Heatran.</p> ",
    "comments": "<h1>Other Options</h1> <p>Counter can surprise weaker physical attackers like Gliscor and Defog Scizor, and Healing Wish can give a wallbreaker or sweeper on a balance team a second chance. Both take away too much utility for most teams, however.</p> <h1>Checks and Counters</h1> <p><strong>Physical Attackers: Blissey's lacking physical bulk means any physical wallbreaker will easily defeat it. Examples include Crawdaunt, Lucario, Infernape, Breloom, and Mamoswine; only Lucario and Infernape fear Thunder Wave.</p> <p><strong>Stallbreakers: Most stallbreaking Pokemon have Blissey in mind and are prepared to remove it. Nasty Plot Togekiss, Calm Mind Latios, and Stored Power Latias rip apart stall and are only checked by Calm Mind Blissey. Stallbreaker Heatran traps Blissey with Magma Storm and Taunt. However, Heatran will struggle versus boosted Calm Mind Blissey. Note that Heatran can lure and remove common switch-ins like Gliscor or Gastrodon, so scouting its set is essential. Rotom formes threaten to cripple Blissey with Trick and then use Nasty Plot unopposed.</p> <p><strong>Life Orb Alakazam: Nasty Plot Alakazam can OHKO Blissey with +2 Psyshock and cleanly 2HKOes with Focus Blast, while Blissey can only threaten it back with Thunder Wave.</p> ",
    "sets": [
      {
        "name": "Utility",
        "description": "<p>With almost no relevant Ghost-types, Seismic Toss provides good neutral damage against all foes. Blissey makes a good Stealth Rock setter due to its longevity granting many opportunities to set them up. Thunder Wave cripples fast attackers such as Infernape and Latios. Heal Bell is an alternative for clerical support but makes Blissey much easier to switch into. Also, teams running Blissey often need Thunder Wave support, so if you run Heal Bell, you should have Thunder Wave elsewhere on your team. Blissey has no problems beating special attackers with uninvested Special Defense, so physical bulk is maximized for staying in against weaker physical attackers like specially defensive Scizor and better taking on Psyshock Alakazam. Coverage moves such as Ice Beam for Gliscor, Garchomp, and Breloom, Thunderbolt to chip Water-types, and Flamethrower for Scizor may also be run if you need to lure them.</p> <p>Blissey fits well on stall and balance teams due to its ability to blanket check special attackers and its great support moveset. Its team must compensate for its physical weakness with solid physical walls such as Tangrowth, Slowbro, and Clefable. Also, a separate check to Alakazam in Scizor, and other priority users like Azumarill, or a faster Pokemon like Weavile or Choice Scarf Dual Chop Garchomp is needed. Gliscor and Starmie provide important entry hazard removal and also beat stallbreaker Heatran. Gliscor makes an especially good partner, as it checks Life Orb Alakazam, blocks Volt Switch, and can check Heatran or almost any physical attacker depending on its set. If you are not running Gliscor, be sure to have a Ground-type to block Volt Switch from Magnezone and the Rotom formes. Sticky Hold Gastrodon is a good option for invalidating Trick from Choice Scarf Rotom-W.</p> "
      },
      {
        "name": "Calm Mind",
        "description": "<p>Calm Mind Blissey shuts down most bulky special sweepers like Latios and Togekiss, which can break through other Blissey, and threatens to win late-game. Offensive coverage is necessary to beat the sweepers; Ice Beam and Seismic Toss are preferred, while Thunderbolt is used to hit bulky Water-types that can PP stall Seismic Toss. Seismic Toss is ultimately preferred for its greater use against unboosted foes. Blissey has no problems beating special attackers with uninvested Special Defense, so physical bulk is maximized for staying in against weaker physical attackers like specially defensive Scizor and better taking on Psyshock Alakazam.</p> <p>Calm Mind Blissey only fits well on stall due to its reduced utility and unique ability to beat such a wide range of special attackers and stallbreakers. Blissey requires strong physical walls to check the variety of Pokemon that threaten it. Unaware Clefable is a good check to setup sweepers like Azumarill, Feraligatr, and Dragonite, and Gliscor, Slowbro, and Skarmory are effective against Lucario. Tangrowth checks Breloom, in particular, and offers a backup answer to Lucario. Tangrowth and defensive Shaymin help against Water-type wallbreakers Crawdaunt, Feraligatr, and Azumarill. Skarmory is a particularly effective partner, checking Weavile, Mamoswine, Lucario, and Feraligatr, while offering the entry hazard support missing from Calm Mind Blissey. For Choice Band wallbreakers like Infernape, Mamoswine, and Azumarill, Slowbro is an effective check, though it needs a partner that resists Fairy-type attacks like Skarmory to consistently check Azumarill. Gliscor again makes a good partner, offering Defog support and checking Lucario and Infernape, though most variants will get 2HKOed by Choice Band Flare Blitz. Another option would be Poliwrath, which is one of the few true counters to the stallbreaking menace Crawdaunt and a check to Feraligatr. Specially defensive Scizor fills the necessary role of Alakazam switch-in and appreciates not having to endure other special assaults. Other essential support includes an entry hazard remover like Gliscor or Starmie, a Ground-type to keep Volt Switch users from freely gaining momentum, and a Heatran switch-in like like Slowbro or Gliscor. Heatran should be scouted first, however.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 369076, "username": "Tuthur"}, {"user_id": 279858, "username": "Lalaya"}]}, {"name": "Grammar checked by", "members": [{"user_id": 331519, "username": "CryoGyro"}, {"user_id": 277988, "username": "dex"}]}], "writtenBy": [{"user_id": 511926, "username": "melancholy0"}]}
  },
  "Raikou": {"sets": [{"name": "Choice Specs"}, {"name": "Calm Mind"}]},
  "Tyranitar": {"sets": [{"name": "Choice Band"}, {"name": "Stealth Rock"}]},
  "Crawdaunt": {"sets": [{"name": "All-out Attacker"}, {"name": "Choice Band"}]},
  "Milotic": {"sets": [{"name": "Physically Defensive"}]},
  "Salamence": {"sets": [{"name": "Choice Scarf"}, {"name": "Setup Sweeper"}]},
  "Latias": {"sets": [{"name": "Choice Scarf"}, {"name": "Defensive"}]},
  "Latios": {
    "overview": "<p>Latios is the most threatening and dominant Pokemon in BDSP OU. Latios's monstrous Special Attack stat, high Speed, solid all-around bulk with a great offensive typing, and plethora of coverage and utility options let it pick and choose its checks, making it the premier wallbreaker in the tier. The lack of convenient, durable Steel- and Fairy-types makes Latios's attacks extremely hard to punish, with most of the few Pokemon that switch into its STAB attacks such as Heatran and Jirachi getting demolished by its coverage options. However, all of Latios's individual sets have their minor problems, with the Choice Specs set being quite prediction reliant, the Calm Mind set lacking immediate power and coverage options, and the 3 Attacks + Roost set being quickly worn down by Life Orb recoil.</p> ",
    "comments": "<h1>Other Options</h1> <p>A Choice Scarf set makes Latios a solid revenge killer; however, it doesn't stand out in this role and is very easily walled. Defog is an option on Choice item sets for emergency entry hazard removal, but dropping a coverage option for this is extremely suboptimal. Lastly, other coverage options such as Energy Ball, Ice Beam, and Thunderbolt can be used to nail Pokemon like Gastrodon, Gliscor, and Empoleon, respectively.</p> <h1>Checks and Counters</h1> <p><strong>Steel-types: Specially defensive Scizor hard walls Latios, as it needs a lot of prior chip damage and good play for even the Choice Specs set to overwhelm. The likes of Heatran, Jirachi, and Empoleon can pivot in on its Choice-locked STAB attacks somewhat consistently, although they can easily get worn down and fear its coverage options.</p> <p><strong>Blissey: Calm Mind Blissey hard counters all Latios variants with ease, pivoting into it and healing off all the damage dealt. However, Blissey lacking Calm Mind can struggle against Calm Mind variants of Latios, as it relies on multiple full paralyses from Thunder Wave to beat it.</p> <p><strong>Fairy-types</strong>: Fairy-types such as Azumarill, Clefable, and Togekiss can all pivot into a Choice-locked Dragon-STAB attack and force Latios out, although they are unable to deal with its other moves.</p> <p><strong>Revenge Killers: Faster Pokemon such as Weavile, Alakazam, and Choice Scarf Garchomp all easily revenge kill Latios, but they are unable to switch into it. Furthermore, if Latios has been worn down, strong priority moves such as Choice Band Dragonite's Extreme Speed can also pick it off.</p> ",
    "sets": [
      {
        "name": "Choice Specs",
        "description": "<p>Choice Specs is Latios's most common set, and for good reason. Its powerful STAB Draco Meteor dents even resistant Pokemon such as Heatran. Psychic nails the Fairy-types that switch into Draco Meteor such as Clefable and Togekiss, and it's a strong attack without drawbacks. Surf is Latios's best coverage option, dissuading Heatran from switching in on its STAB attacks and breaking through Scizor after minor chip damage. Dragon Pulse lacking Draco Meteor's drawbacks makes it useful against frailer targets that do not require Draco Meteor's sheer power to break through, and locking into a Dragon-type move is oftentimes much more favorable than Psychic. Sleep Talk, on the other hand, allows Latios to switch into Breloom's Spore and force it out, letting Latios check it in the short term.</p> <p>Choice Specs Latios fits on offensive teams that don't mind its decreased longevity and greatly appreciate its wallbreaking. Although it has great bulk for an offensive Pokemon, Choice Specs Latios still lacks longevity, so pivots such as Scizor, Rotom-W, and Gliscor work extremely well with it. Stealth Rock from Garchomp, Heatran, and Jirachi can put would-be checks such as Scizor in range of Latios's attacks, and it also wears down more short-term countermeasures like Heatran and Jirachi. Other Dragon-types like Garchomp and Dragonite are phenomenal partners, working with Latios to wear down their shared checks. Infernape, in particular, is an astounding offensive partner, as it gets Latios in safely with U-turn on Pokemon like Slowbro and Gliscor while forcing out Scizor and Blissey. Lastly, Magnezone helps remove pesky Steel-types, namely Scizor, allowing Latios to punch holes much more consistently.</p> "
      },
      {
        "name": "Calm Mind",
        "description": "<p>Calm Mind Latios becomes a terrifying wallbreaker after a boost, muscling through would-be checks such as Blissey lacking Calm Mind while cleaning slower teams. Draco Meteor hits even resistant targets hard after a boost, but it removes Calm Mind's Special Attack boosts, so Dragon Pulse is an option too. Psychic deals with the Fairy-types that pivot into its Dragon-type STAB move, notably scoring a 2HKO on Unaware Clefable, which walls this set unless it switches into Psychic. Roost lets Latios soft check the likes of Breloom and Rotom-W over the course of the match, as well as making sure it can wallbreak and attempt to sweep multiple times.</p> <p>Calm Mind Latios works best on bulky offense teams that can wear down Steel-types such as Heatran, Jirachi, and Scizor so it can cleave through the opposition. Spikes support from Roserade and Skarmory can wear down Heatran and Jirachi extremely quickly, as well as chip Scizor constantly so Latios can eventually overwhelm it. Heatran can potentially burn Scizor with Flame Body, which is extremely helpful in wearing it down. Magnezone is also an exceptional partner, as it can trap and remove the aforementioned Scizor, which might also remove Spikes with Defog. Other Dragon-types like Garchomp and Dragonite appreciate Steel- and Fairy-types being worn down or KOed. Garchomp, and the aforementioned Heatran, also can set Stealth Rock, forming a potent entry hazard-stacking core with a Spiker.</p> "
      },
      {
        "name": "3 Attacks + Roost",
        "description": "<p>3 Attacks + Roost Latios fits coverage to nail checks such as Jirachi and Heatran while still possessing the longevity due to Roost to check the likes of Breloom and Rotom-W throughout the game. Draco Meteor and Psychic hits the entire tier at least neutrally barring Steel-types. Earthquake threatens an immediate OHKO on specially defensive Heatran and a 2HKO on Jirachi after minor chip damage, such as if it switches into Draco Meteor. Surf, on the other hand, lets Latios potentially break through chipped Scizor while still dealing with Heatran, albeit less effectively. Roost lets it heal off Life Orb recoil and consistently pressure the opposing team throughout the match. A Naive nature should only be used with Earthquake to not lower its damage against the aforementioned Heatran and Jirachi.</p> <p>3 Attacks + Roost Latios fits especially well on DragMag and offensive teams, luring in and weakening or outright removing Heatran or Jirachi, which allows its other Dragon-type partners to click their Dragon-type STAB moves more often. It also lets teammates such as Weavile, offensive Scizor, and Togekiss wallbreak much more consistently. Magnezone, as always, is a great partner, removing the one Steel-type Latios is unable to break past consistently in Scizor, letting it use its STAB moves more often. Lastly, pivots such as Infernape, Gliscor, and Rotom-W help get it in safely, as it is prone to getting worn down quickly.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 279858, "username": "Lalaya"}, {"user_id": 277988, "username": "dex"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}, {"user_id": 277988, "username": "dex"}]}], "writtenBy": [{"user_id": 529732, "username": "adem"}]}
  },
  "Jirachi": {"sets": [{"name": "Utility"}]},
  "Roserade": {"sets": [{"name": "Spikes"}]},
  "Gastrodon": {"sets": [{"name": "Specially Defensive"}]},
  "Garchomp": {"sets": [{"name": "Mixed Attacker"}, {"name": "Choice Scarf"}]},
  "Lucario": {
    "overview": "<p>Lucario is an impressively powerful sweeper on hyper offense teams. Close Combat is enough to let it outright destroy common physically defensive walls like Skarmory and Tangrowth at +2 alongside entry hazard support, and access to Extreme Speed and STAB Meteor Mash let it handle Pokemon that commonly cause hyper offense teams to struggle like Latios, Alakazam, and Unaware Clefable. However, Lucario relies heavily on Stealth Rock and Spikes support to bring foes like Latios, Infernape, and Skarmory into range of its boosted attacks. Furthermore, Lucario's frailty, compounded with Life Orb recoil, puts it on a timer when it tries to sweep, especially if it has to eat a hit in order to set up. Lucario's Speed tier also does it no favors, often forcing it to rely on Extreme Speed. Finally, Lucario struggles to deal with the omnipresent Gliscor, which can switch into it and OHKO it with Earthquake.</p> ",
    "comments": "<h1>Other Options</h1> <p>Lucario has no viable move alternatives. A Choice Band set replacing Swords Dance with Crunch can be utilized but is ultimately less effective.</p> <h1>Checks and Counters</h1> <p><strong>Physically Bulky Pokemon</strong>: Gliscor, Latias, and Slowbro can switch into unboosted Lucario and force it out with Earthquake, Psychic, and Flamethrower or Scald. Slowbro is particularly good at this, as its typing, massive physical bulk, and access to Regenerator mean that Lucario will almost never break through it. Stall teams without Gliscor can rely on Quagsire to revenge kill Lucario; however, it is 2HKOed by Close Combat on the switch.</p> <p><strong>Revenge Killers: If entry hazards are kept off the field, strong wallbreakers like Latios, Dragonite, and Focus Sash Breloom can effectively revenge kill Lucario. Focus Sash Alakazam is a particularly notable foe, as it can keep its Focus Sash intact with Magic Guard, making it quite consistent at revenge killing Lucario. Garchomp is able to comfortably survive a +2 Extreme Speed and KO back with Earthquake.</p> <p><strong>Offensive Pressure: Lucario relies on boosting and its Life Orb to meaningfully pressure faster threats; accordingly, hitting Lucario as it sets up reduces its effectiveness, as Life Orb recoil puts a timer on its sweep. Without a Swords Dance boost, Lucario cannot meaningfully threaten faster Pokemon like Latios and Infernape, so make sure to never let it set up for free.</p> <p><strong>Entry Hazard Removal: Lucario relies immensely on Stealth Rock and Spikes from Skarmory to OHKO Pokemon like Latios, Skarmory, and Tangrowth. Removing these entry hazards leaves Lucario easily revenge killed by the aforementioned threats if they are kept healthy.</p> ",
    "sets": [
      {
        "name": "Swords Dance",
        "description": "<p>Swords Dance lets Lucario break through a number of defensive threats with its Life Orb-boosted Close Combat. Close Combat absolutely destroys bulky Pokemon like Rotom-W and Skarmory, OHKOing both after Stealth Rock. Meteor Mash separates Lucario from other setup sweepers, as it is uniquely capable of hitting Unaware Clefable super effectively. Meteor Mash is also incredibly useful for picking off weakened Gliscor while potentially giving Lucario the boost it needs to sweep. After a Swords Dance boost, Extreme Speed easily OHKOes faster Pokemon that would normally force Lucario out, notably OHKOing Infernape and Latios after Stealth Rock. An Adamant nature is near-required to OHKO Latios with Extreme Speed at +2 after Stealth Rock; however, a Jolly nature can be used if outspeeding Timid Rotom-W is necessary. Justified lets Lucario come in on a predicted Knock Off from Tangrowth or Throat Chop from Weavile to get an Attack boost, which all but ensures its sweep.</p> <p>Lucario fits best on hyper offense teams that can break holes for it to potentially sweep late-game. Lead Skarmory is an excellent partner, as Lucario needs Stealth Rock on the field to guarantee an OHKO on Latios, Infernape, and Starmie with +2 Extreme Speed. The Spikes Skarmory provides is also beneficial, chipping Pokemon like Garchomp and Tangrowth into range of its boosted attacks. Lucario should be paired with wallbreakers that can soften up the enemy team for it to an eventually sweep like Breloom, Dragonite, Feraligatr, and Alakazam. Breloom is particularly good, as it can give Lucario a free setup opportunity with Spore, while Alakazam notably forces Latios out. Azelf is an interesting teammate option that can keep opposing entry hazards off the field with its fast Taunt and weaken foes like Gliscor and Latios with Psychic and U-turn, respectively. Azelf can also run a lead set to support Lucario, setting up either Stealth Rock or dual screens, both of which ease Lucario's sweeping attempts. Water-types like Feraligatr, Cloyster, and Azumarill can set up on and force out Gliscor, which is the most common switch-in to Lucario. Lucario greatly appreciates speed control in the form of Sticky Web or paralysis spam, as these playstyles enable Lucario to pick up KOs with Close Combat on normally faster foes that can tank +2 Extreme Speed like Garchomp and Jolly Mamoswine.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 529732, "username": "adem"}, {"user_id": 279858, "username": "Lalaya"}]}, {"name": "Grammar checked by", "members": [{"user_id": 241023, "username": "Kris"}]}], "writtenBy": [{"user_id": 277988, "username": "dex"}]}
  },
  "Hippowdon": {"sets": [{"name": "Utility"}]},
  "Weavile": {
    "overview": "<p>Weavile is an excellent wallbreaker in BDSP OU by virtue of its great offensive typing and sheer power. Its amazing Speed tier is one of its biggest advantages, as it is faster than the entire unboosted metagame, allowing it to outspeed the likes of Latios, Alakazam, and Garchomp. All of these assets make it a near unstoppable wallbreaker, able to burst through common checks such as Scizor and Azumarill with Assurance and Poison Jab, respectively. However, Weavile's susceptibility to Stealth Rock and frailty mean it requires solid entry hazard removal and slow pivoting to bring it in safely in order for it to wallbreak. Its frailty also makes it prone to strong priority from Infernape, Breloom, and Lucario, rendering its high Speed useless. Furthermore, it can still get walled by Pokemon like physically defensive Scizor, Skarmory, and Poliwrath, although the former is uncommon and the latter two are rarely seen outside of stall.</p> ",
    "comments": "<h1>Other Options</h1> <p>A set utilizing Swords Dance alongside Never-Melt Ice or a Life Orb can also be used in order to clean in late-game scenarios more easily, although its lack of longevity with a Life Orb, alongside its difficulty in setting up, make it a suboptimal choice outside of certain hyper offense structures. Brick Break or Focus Punch can be run to nail Heatran and Lucario without requiring Stealth Rock chip damage; however, the former option is extremely weak and doesn't do enough to Heatran to justify using it, and the latter is extremely inconsistent and prediction reliant.</p> <h1>Checks and Counters</h1> <p><strong>Steel-types: Steel-type Pokemon such as Scizor and Heatran can pivot into and force out Weavile, as they resist its Ice-type STAB moves and don't take too much from Throat Chop; the former is able to heal off any damage it takes with Roost, while the latter threatens Weavile with a Flame Body burn. However, they both quickly falter to Assurance after taking entry hazard damage and Beat Up. Skarmory outright walls Weavile, as it takes negligible damage from all of Weavile's attacks and can heal with Roost.</p> <p><strong>Fairy-types: Fairy-types such as Azumarill and physically defensive Clefable can comfortable switch into Weavile's Dark-type STAB move and either resist or can heal off its Icicle Crash. However, the former is easily worn down due to its lack of recovery, and the latter barely lives 2 Icicle Crashes and doesn't even OHKO Weavile, making both fairly shaky checks. Furthermore, both fear a stray Poison Jab.</p> <p><strong>Fighting-types: Both Infernape and Lucario can switch into Weavile a few times and force it out with their STAB moves due to their typings; however, their mediocre bulk and lack of recovery make them far from consistent. Breloom is unable to safely switch into Weavile due to it fearing Weavile's Ice-type STAB moves; however, it forces Weavile out with Mach Punch.</p> <p><strong>Priority: Priority moves such as Infernape and Breloom's Mach Punch, Scizor's Bullet Punch, Crawdaunt's Aqua Jet, and Lucario and Dragonite and Lucario's Extreme Speed are extremely threatening to Weavile, as they take advantage of its poor physical bulk while ignoring its high Speed. Infernape, Breloom, and Scizor easily OHKO Weavile without any prior damage; however, the rest require minor chip damage, such as Stealth Rock, to KO it.</p> ",
    "sets": [
      {
        "name": "Choice Band",
        "description": "<p>Throat Chop is Weavile's strongest Dark-type STAB option, as well as its most spammable move, taking advantage of the tier's lack of formidable Dark-resistant Pokemon. Icicle Crash deals with the few Pokemon that can switch into Weavile's Throat Chop, such as Togekiss and Clefable, as well as allowing Weavile to consistently force out the likes of Gliscor and Garchomp. Ice Shard lets it revenge kill faster boosted Pokemon and Choice Scarf users such as +1 Dragonite, Garchomp, and Latias. Assurance is Weavile's best option for its last moveslot, as it can KO Scizor and Heatran after Stealth Rock as well as heavily dent Skarmory. Poison Jab is another option that lets Weavile chunk Fairy-types such as Azumarill and Clefable much harder, although it doesn't have much use outside of that. Beat Up can also be run on more offensive teams; this works extremely well with teammates that have high Attack stats, providing Weavile with an extremely powerful STAB option that lets it break past would-be checks such as Skarmory and Heatran with ease and kill Focus Sash Alakazam.</p> <p>Weavile works best on bulky offense teams that can provide it with sufficient pivot support and entry hazard removal to enable it to wallbreak successfully. Pokemon like Rotom-W, Scizor, and Gliscor that can easily bring Weavile in safely via slow pivoting are solid partners. Solid entry hazard removal such as Rapid Spin from Starmie and Defog from Scizor and Gliscor are amazing alongside Weavile, as they vastly improve its longevity. A strong defensive backbone formed from Pokemon such as Latias, Slowbro, and Tangrowth is helpful to absorb the strong priority moves directed at Weavile such as Mach Punch and Extreme Speed. Magnezone, specifically, is a stellar partner, as it removes Steel-types such as Scizor and Skarmory, making Weavile much harder to deal with defensively. Other physical attackers such as Garchomp and Breloom work well with Weavile, as they can overwhelm their shared checks together.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 279858, "username": "Lalaya"}, {"user_id": 241023, "username": "Kris"}]}, {"name": "Grammar checked by", "members": [{"user_id": 277988, "username": "dex"}]}], "writtenBy": [{"user_id": 529732, "username": "adem"}]}
  },
  "Magnezone": {
    "overview": "<p>Magnezone's powerful ability Magnet Pull lets it eliminate or heavily chip defensive Steel-types in Skarmory and Scizor, which many teams rely on to check some of the tier's most powerful offensive Pokemon like Latios and Weavile. It is an incredibly strong attacker in its own right, firing off powerful Flash Cannons and Thunderbolts that pressure most of the tier. However, Ground-types can switch into Thunderbolt and Volt Switch, sapping all of of Magnezone's momentum. Magnezone's reliance on Choice Specs means that, once it has successfully trapped and KOed its Steel-type target, it is forced to switch out or be sacrificed, often costing the team momentum. This is exacerbated by Volt Switch failing to pressure specially defensive Scizor, one of Magnezone's main targets. Magnezone's low Speed leaves it forced out by many of the tier's numerous offensive Pokemon, and it is unable to trap some Steel-types like Jirachi and invested Heatran effectively due to their bulk. Additionally, both Scizor and Skarmory can run a Shed Shell to render Magnezone's niche null and void.</p> ",
    "comments": "<h1>Other Options</h1> <p>If trapping opposing Steel-types is not needed, Magnezone can drop Magnet Pull for Analytic to become an even more fearsome special wallbreaker. However, there are many other special wallbreakers, namely Latios, Alakazam, Starmie, and even Azelf, that offer more utility, a better Speed tier, and better coverage, making this option niche at best.</p> <h1>Checks and Counters</h1> <p><strong>Shed Shell: Both Scizor and Skarmory can run Shed Shell to negate Magnet Pull, rendering Magnezone's niche null and void. However, Shed Shell can be removed by Knock Off from teammates.</p> <p><strong>Ground-types: Gliscor, Garchomp, Mamoswine, and Donphan can revenge kill Magnezone if it is locked into an Electric-type move and block Volt Switch; however, they loathe switching into Flash Cannon. Gastrodon, on the other hand, is a particularly good Magnezone check, as it can easily switch into all of Magnezone's moves due to its typing and special bulk.</p> <p><strong>Blissey: Blissey can switch into Magnezone and effectively force it out with Seismic Toss. However, switching into repeated Volt Switches will leave Blissey unable to check other special attackers.</p> <p><strong>Revenge Killers</strong>: Many offensive Pokemon outspeed Magnezone and force it out. Latios resists Thunderbolt and Volt switch and can hit Magnezone with a powerful Surf. Infernape resists Flash Cannon and forces Magnezone out with Close Combat and Flare Blitz. Breloom resists Thunderbolt and Volt Switch and can use Magnezone to set up or fire off a Spore. Lucario forces Magnezone out with Close Combat and can set up if it's locked into Flash Cannon. Dragonite OHKOes Magnezone with Earthquake and heavily pressures it with Fire Punch. None of these Pokemon appreciate switching into Magnezone's powerful attacks, however.</p> ",
    "sets": [
      {
        "name": "Choice Specs",
        "description": "<p>Magnezone's game plan is fairly straightforward: trap a Steel-type and either KO or heavily damage it with Thunderbolt. Volt Switch is useful for keeping momentum while KOing targets if Skarmory's Sturdy is broken or if Scizor has been chipped into its range as well as for pivoting on specially bulky Pokemon like Latias and Blissey. Flash Cannon hits incoming Ground-types like Gliscor and Garchomp that attempt to block Magnezone's Volt Switch. Tri Attack is a generally good middle-ground move to hit Ground-types and Water-types without the need to predict, as well as for hitting Electric-types like Rotom-C and Raikou neutrally. Explosion is instead useful for generating momentum on offensive teams once Magnezone is no longer needed, heavily damaging a foe and getting in a teammate for free. Discharge is an option to fish for a paralysis on specially defensive Heatran and Latios. A Timid nature is preferred so that Magnezone outspeeds offensive Adamant Scizor and defensive Rotom-W; however, a Modest nature can be used to KO Scizor with less chip damage.</p> <p>Many Pokemon appreciate Magnezone eliminating Steel-type foes like Skarmory and Scizor. Latios is perhaps its best partner, as many teams rely on Scizor to check Latios. Physical wallbreakers like Dragonite, Garchomp, Azumarill, and Weavile, which need Skarmory out of the picture to effectively function, make for excellent choices as well. Azumarill and Weavile can also take advantage of the Ground-types like Donphan and Gliscor Magnezone invites in, while Dragonite and Garchomp appreciate Magnezone threatening Clefable, Togekiss, and Rotom-W. Knock Off users like Donphan, Gliscor, and Tangrowth can bait in Scizor and Skarmory and remove a potential Shed Shell from them, ensuring that Magnezone can successfully trap them; they also are good defensive answers to Ground-types like Garchomp and Gliscor, which force Magnezone out once it has trapped something. Stealth Rock from Gliscor and Clefable ensures that Sturdy won't let Skarmory set an entry hazard on Magnezone before falling. Magnezone works well with U-turn users that bait in Skarmory and Scizor like Gliscor and Scizor.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 529732, "username": "adem"}, {"user_id": 369076, "username": "Tuthur"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 277988, "username": "dex"}]}
  },
  "Tangrowth": {
    "overview": "<p>Tangrowth's Grass typing and physical bulk allow it to counter several dangerous Water-types such as Feraligatr, Crawdaunt, and Rotom-W as well as the dangerous Breloom. Regenerator and Giga Drain keep Tangrowth healthy while it uses utility moves like Knock Off and Sleep Powder to deter the opponent from pivoting around it. Due to its bad special bulk, Tangrowth is very vulnerable to strong special attacks and chip damage, which is why it competes with Poliwrath, which spreads Scald burns, racks up entry hazard damage with Circle Throw, counters Weavile and Mixed Crawdaunt, and checks Infernape. It also faces competition from fellow Grass-type Shaymin, which offers higher speed, letting it check Pokemon like Belly Drum Azumarill, higher special bulk, letting it shrug off Crawdaunt's Sludge bomb, and Aromatherapy while staying healthy with Rest and Natural Cure. Despite this, Tangrowth manages to set itself apart thanks to its superior movepool and higher physical bulk, earning itself a solid role on balance.</p> ",
    "comments": "<h1>Other Options</h1> <p>Tangrowth sports a myriad of moves that it can experiment with over standard ones; for example, Power Whip can be used over Giga Drain thanks to its higher Base Power, though it lacks the accuracy and healing of Giga Drain. Brick Break can be run to lure in and OHKO Weavile; however, it is generally inferior to Earthquake outside of this matchup. Stun Spore can be run over Sleep Powder to spread paralysis; however, Sleep Powder is generally more impactful. Leech Seed can be used to further punish switch-ins and help Tangrowth stay healthy, but it sacrifices coverage in doing so.</p> <h1>Checks and Counters</h1> <p><strong>Strong Special Attacks: Tangrowth's low Special Defense makes it vulnerable to strong special attacks from Pokemon like Alakazam, Latios, and Latias. Furthermore, physical attackers like Garchomp and Crawdaunt can run special coverage for it.</p> <p><strong>Flying-Type Pokemon and Coverage: Staraptor, Brave Bird Skarmory, Air Slash Shaymin, and Togekiss all exert pressure on Tangrowth, forcing it to switch out. This gives them opportunities to fire off strong attacks or set up on the forced switch.</p> <p><strong>Ice-Type Pokemon and Coverage: Weavile and Mamoswine deal a lot of damage to Tangrowth with Icicle Crash and Freeze-Dry, respectively, forcing it out, and exploiting the opportunity to fire off a strong attack. Starmie's Ice beam renders Tangrowth unable to check it, as it deals too much damage to it. Blissey can abuse Tangrowth's passivity and lack of a physical move to set up with Calm Mind or pressure it with Ice Beam.</p> <p><strong>Fire-Types: Infernape's Overheat and Choice Band Flare Blitz and Heatran's Fire-type moves threaten to OHKO Tangrowth, forcing it out. However, neither want to switch into it, as it threatens them with Knock Off and Earthquake.</p> ",
    "sets": [
      {
        "name": "Physically Defensive",
        "description": "<p>Knock Off allows Tangrowth to hit dangerous special attackers and cripple them by getting rid of Heatran, Latios, and Latias's items while OHKOing Alakazam outright. Earthquake expands on Tangrowth's coverage, allowing it to hit Magnezone, Heatran, and Jirachi, while Sleep Powder allows it to put its switch-ins out of commission, further discouraging the opponent from pivoting around it. Sludge bBomb allows Tangrowth to check opposing Grass-types like Breloom, Shaymin, and Rotom-C, this is particularly important against Breloom, as Tangrowth is immune to Spore. It also allows Tangrowth to spread poison around to rack up incremental damage. Tangrowth's lack of an item makes it an excellent Knock Off absorber; it is forced to not run an item because it otherwise can't take a Swords Dance boosted Knock Off from Life Orb Crawdaunt.</p> <p>Tangrowth generally pairs up with fellow defensive Pokemon that patch its weaknesses. Blissey checks tier monster Latios and other special attackers. Gliscor provides a very good Heatran and Magnezone check while also defogging for Tangrowth, while Tangrowth makes up for Gliscor's weakness to Water-types like Azumarill, Feraligatr, and Rotom-W. Clefable provides an excellent Weavile check and can lure in Swords Dance Scizor and KO it with Flamethrower, as Tangrowth tends to struggle with it. Rotom-W checks Heatran, Mamoswine, Weavile, and Swords Dance Scizor while pivoting Tangrowth in with Volt Switch. Starmie spins entry hazards away, allowing Tangrowth to stay healthy in the face of the powerful physical attackers it needs to check. Tangrowth also pairs very well with fellow Regenerator Pokemon Slowbro, making a Regenerator corethat covers each other's weaknesses thanks to the type synergy; for example, Slowbro checks Infernape, while Tangrowth checks Crawdaunt and Feraligatr.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 277988, "username": "dex"}, {"user_id": 369076, "username": "Tuthur"}]}, {"name": "Grammar checked by", "members": [{"user_id": 277988, "username": "dex"}]}], "writtenBy": [{"user_id": 553481, "username": "H momento"}]}
  },
  "Togekiss": {"sets": [{"name": "Choice Scarf"}, {"name": "Utility"}]},
  "Mamoswine": {"sets": [{"name": "Stealth Rock Attacker"}, {"name": "Wallbreaker"}]},
  "Rotom-Wash": {
    "overview": "<p>Rotom-W is one of the best defensive pivots in the tier due to its access to numerous utility options such as Will-O-Wisp, Thunder Wave, and Volt Switch and its solid defensive stats and typing. Its auspicious typing, combined with Levitate, allows it to check common threats such as Scizor, Weavile, Feraligatr, and Mamoswine. It is easily able to maintain offensive momentum by threatening Ground-types such as Gliscor, Garchomp, and Mamoswine with Will-O-Wisp or Hydro Pump. It can also act as a potent stall breaker with Nasty Plot and Trick combined with Choice Scarf, leaving common stall Pokemon that would otherwise beat like Clefable, Blissey, and Tangrowth exploitable by itself and hard-hitting teammates like Swords Dance Breloom and Swords Dance Garchomp. Choice Scarf Rotom-W is also a great revenge killer, able to OHKO threats like Crawdaunt and Belly Drum Azumarill or, in a pinch, save the day with a burn on Swords Dance sweepers like Garchomp and Lucario. Its great offensive potential and defensive utility make it a staple on bulky offense teams. However, Rotom-W has a poor HP stat, which, when combined with its lack of reliable recovery, leaves it susceptible to being worn down by hazards and status throughout the course of a match. Because of this vulnerability to chip damage, it is unable to consistently check threats like Scizor, Feraligatr, and Mamoswine in the long term. Rotom-W's Speed tier without its Choice Scarf leaves much to be desired, and sets lacking Thunder Wave are walled by Latias.</p> ",
    "comments": "<h1>Other Options</h1> <p>Due to Rotom-W's limited offensive movepool, there is very little possible move variation. Reflect can be run on the defensive set to act as a stronger check to Feraligatr, Azumarill, and Mamoswine. More Speed investment can be used on the Leftovers set, letting it outspeed Pokemon like Scizor, Mamoswine, and Nidoking. However, with lower defensive investment, it is a less reliable answer to threats like Feraligatr and Weavile. It also loses its ability to consistently act as a slow pivot. A specially defensive spread can be used to more reliably answer Starmie and Heatran. However, this makes it less able to check physical attackers, namely Feraligatr and Mamoswine.</p> <h1>Checks and Counters</h1> <p><strong>Grass-types: Rotom-W is unable to do any meaningful damage to Tangrowth outside of burning it. Poison Heal Breloom can use Rotom-W to set up Substitute. However, non-Poison Heal Breloom does not like switching into Will-O-Wisp, and Rotom-W can simply pivot on Breloom with Volt Switch regardless of its set.</p> <p><strong>Dragon-types: Although it has to exercise caution while switching in, Garchomp can threaten to OHKO Rotom-W with Outrage after some minor chip damage. However, Garchomp dislikes tanking a Hydro Pump and being burnt by Will-O-Wisp.</p> <p><strong>Chip Damage: Rotom-W's low HP stat and a lack of reliable recovery leave it heavily susceptible to being worn down by hazards. Will-O-Wisp from opposing Rotom-W is also a major threat, as it becomes a far less consistent check to the likes of Scizor, Feraligatr and Mamoswine.</p> <p><strong>Specially Defensive Pokemon</strong>: Gastrodon is one of the best counters to Rotom-W, as it is immune to Volt Switch and does not mind getting burned, and can burn Rotom-W back with Scald. It can even afford to run Sticky Hold to deny Trick from Choice Scarf variants. Blissey takes little from anything Rotom-W can throw at it and can either use it as set up fodder with Calm Mind or wear it down with Seismic Toss. However, Blissey is absolutely crippled by Trick.</p> ",
    "sets": [
      {
        "name": "Defensive",
        "description": "<p>Hydro Pump is used to hit Ground-types like Garchomp, Gliscor, and Mamoswine that attempt to block Volt Switch. Will-O-Wisp lets Rotom-W cripple physical attackers like Azumarill, Feraligatr, and Scizor. Thunder Wave debilitates Pokemon that rely on their high Speed like Weavile and Alakazam, making them easier to revenge kill. Protect can be used to scout Choice item users like Azumarill while also being able to rack up extra Will-O-Wisp damage and gain more recovery from Leftovers. Alternatively, Discharge can be used for a second Electric STAB that has a nasty 30% paralysis rate, and a higher base power that allows it to KO threats like Belly Drum Azumarill. However, it indirectly inhibits Will-O-Wisp, as if Discharge paralyzes a strong physical attacker like Scizor or Tyranitar, it can prove to be a liability. Both Will-O-Wisp and Thunder Wave can be run at the same time to give Rotom-W more flexibility in terms of spreading status, but this is not generally recommended. 8 Speed EVs allow Rotom-W to outspeed Adamant Crawdaunt.</p> <p>This set fits on bulky offense and balance teams where it acts as a slow pivot, safely bringing in strong offensive teammates while checking Heatran, Mamoswine, and Feraligatr. Heatran is a good partner, dealing with Pokemon that check Rotom-W like Tangrowth and Clefable while also providing Stealth Rock support. In return, Heatran appreciates Rotom-W's ability to beat Water- and Ground-types like Slowbro, Mamoswine, and Gliscor. Scizor can check Latios and Latias while appreciating Rotom-W checking Heatran and forming a VoltTurn core. Strong offensive Pokemon like Alakazam, Breloom, and Garchomp are able to take advantage of the offensive momentum Rotom-W generates while also appreciating Rotom-W's ability to chip foes, softening them up for the late-game.</p> "
      },
      {
        "name": "Choice Scarf",
        "description": "<p>Choice Scarf Rotom-W reliably revenge kills Azumarill and Crawdaunt and outspeeds and threatens common threats like Feraligatr and Weavile. Volt Switch allows Rotom-W to gain momentum while bringing in teammates safely. Hydro Pump is effective at thwarting Ground-types that are immune to Volt Switch such as Gliscor, Garchomp, and Mamoswine while also threatening Pokemon such as Tyranitar. Trick cripples passive walls such as Clefable, Tangrowth, and Blissey. It also greatly annoys setup sweepers like Garchomp and Breloom. Will-O-Wisp is an option that lets Rotom-W cripple Garchomp, Scizor, Weavile, and Feraligatr while also threatening Pokemon such as Tangrowth and Tyranitar. Nasty Plot allows Rotom-W to become a potent wallbreaker after it sheds its Choice Scarf due to its good bulk making it difficult to revenge kill and good STAB coverage.</p> <p>Choice Scarf Rotom-W best fits on offense, bulky offense, and balance teams that appreciate its role compression as a Ground-immune offensive pivot and revenge killer that can maintain momentum. Scizor is an excellent teammate since it makes an excellent VoltTurn core with Rotom-W and it checks strong special attackers like Alakazam, which would otherwise overwhelm and force Rotom-W out. Gliscor is another great partner, as it also creates a VoltTurn core with Rotom-W and provides Stealth Rock and Knock Off support to allow Rotom-W to better wear down Blissey. In return, Rotom-W checks Water- and Ice-types like Feraligatr, Azumarill, Weavile, and Mamoswine for Scizor and Gliscor. Heatran is another excellent partner, as it checks Pokemon that can force out Rotom-W, such as Tangrowth and Latios, while also providing Stealth Rock support. In return, Rotom-W is able to come in on Ground-types such as Garchomp and Mamoswine. Entry hazard removal from the likes of Gliscor and Starmie is great for Rotom-W, as it increases Rotom-W's longevity. Since Choice Scarf Rotom-W is unable to consistently check Water-types like Azumarill and Feraligatr, additional checks to them such as Tangrowth and Shaymin are appreciated.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 279858, "username": "Lalaya"}, {"user_id": 529732, "username": "adem"}]}, {"name": "Grammar checked by", "members": [{"user_id": 277988, "username": "dex"}]}], "writtenBy": [{"user_id": 487308, "username": "BT89"}]}
  },
  "Rotom-Mow": {"sets": [{"name": "Choice Scarf"}]},
  "Azelf": {"sets": [{"name": "Dual Screens Lead"}, {"name": "Stealth Rock Lead"}, {"name": "Offensive Pivot"}]},
  "Heatran": {"sets": [{"name": "Offensive Stealth Rock"}, {"name": "Defensive Stealth Rock"}]}
}