{
  "Nidoking": {
    "sets": {
      "Offensive": {
        "description": "<p>Nidoking uses its incredible coverage and Sheer Force to be a terrifying special wallbreaker. Earth Power is an excellent go-to move that forces out slower, Ground-weak Pokemon like Toxapex and Heatran and 2HKOes common walls like Seismitoad and Ferrothorn. Gunk Shot can be used to outright 2HKO Blissey and deal massive damage to other special walls like Slowking, which improves the stall matchup, while Shell Side Arm is good for chunking Blissey and dealing consistent damage to Pokemon like Rotom-W. Gunk Shot's only drawback is the lower accuracy, making it slightly inconsistent in important situations. Ice Beam deals with Hippowdon and Tornadus-T, and Flamethrower deals with Steel- and Flying-types, rounding out Nidoking's perfect coverage on every Pokemon. Alternatively, Thunderbolt hits Slowking, Tornadus-T, and various Steel- and Flying types, but Ice Beam and Flamethrower are more effective. Nidoking typically uses a Rash nature to amplify its power as much as possible, but a Naive nature can be used to outspeed Pokemon like Adamant Excadrill, Jolly Buzzwole, and Timid Heatran. It should be noted that Nidoking's Poison typing can allow it to switch in on predicted Toxic from foes like Heatran and defensive Buzzwole. Nidoking can also switch in against Electric-types like Zeraora and Rotom-H. That being said, Nidoking doesn't like being chipped, so pivots like Corviknight, Cinderace, Rotom-W, and Tornadus-T allow it to get in more easily to wallbreak more often. Fast cleaners and wallbreakers are also appreciated as teammates to make up for Nidoking's lackluster speed, so Weavile, Cinderace, and Aerodactyl are all great partners.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 511624, "username": "Fc"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 517892, "username": "pannu"}, {"user_id": 464398, "username": "LBDC"}]}, {"name": "Grammar checked by", "members": [{"user_id": 375662, "username": "Isaiah"}]}]}
  },
  "Clefable": {
    "sets": {
      "Utility": {
        "description": "<p>Clefable's Fairy typing, respectable bulk, and immunity to residual damage like Toxic make it a solid choice for either a defensive spinner or a Stealth Rock setter, finding many opportunities to come onto the field and matching up particularly well against common entry hazard setters like Seismitoad, Mudsdale, and Hippowdon as a spinner. Glare spreads paralysis, warding off wallbreakers like Gengar and Melmetal and providing speed control for slower wallbreakers such as Tyranitar and Buzzwole. Alternatively, Clefable's deep movepool allows it to run a vast array of other utility options; Teleport can bring the aforementioned wallbreakers in with ease, for example, matching up better against slower threats like Galarian Slowking and Ferrothorn, which Glare is less effective against. Knock Off is also a good option, removing items such as Leftovers and Heavy-Duty Boots to drastically reduce the longevity of Pokemon like Heatran and Zeraora. Trick in conjunction with Sticky Barb can be used in a similar manner, albeit only one time. Clefable can use both Stealth Rock and Rapid Spin on the same moveset for maximum role compression, although it loses any ability to deter aforementioned switch-ins like Gengar and Heatran in the process. The same holds true of both Aromatherapy and Wish, which are greatly appreciated by offensive tanks like Tornadus-T, Melmetal, and Heatran. VoltTurn cores with Pokemon such as Rotom-W and Aerodactyl greatly appreciate Rapid Spin Clefable only removing opposing hazards, while Spikes setters like Seismitoad can form a hazard-stacking core with Stealth Rock Clefable. Skarmory and Ferrothorn are also very notable hazard setters, as they can handle physical wallbreakers like Choice Band Tyranitar and Aerodactyl that punch through Clefable with ease. Similarly, Clefable struggles to take on strong special attackers like Keldeo and Rotom-H, so specially defensive teammates like Assault Vest Toxapex and Slowking are recommended.</p>"
      },
      "Calm Mind": {
        "description": "<p>Calm Mind Clefable takes advantage of passive switch-ins like Corviknight, Gastrodon, and Ferrothorn lacking Grav Apple to accumulate multiple boosts, making itself a capable sweeper that can be difficult to take down. Rapid Spin offers entry hazard removal and bolsters Clefable's Speed stat, notably letting it outpace Choice Band Tyranitar after one boost and positive-natured base 95s like Obstagoon and Kyurem after two. Rapid Spin also invites in many hazard setters Clefable can boost against like Mudsdale and the aforementioned Gastrodon; since it pressured hazard setters, Calm Mind also makes it easier to keep hazards off the field. Glare is used to hinder threats like Fire Lash Cinderace and Nidoking that Clefable may force in after garnering boosts. An additional coverage move such as Flamethrower, Stored Power, or Thunder can be used instead to more immediately pressure Fairy-resistant walls such as Ferrothorn, Corviknight, and non-Assault Vest Toxapex, making Clefable a more independent sweeper but reducing its utility. 12 Speed EVs are used to outpace uninvested Tyranitar. Clefable pairs well with bulky Pokemon like Skarmory and Toxapex that benefit from its offensive presence, and in turn they can set hazards to wear down foes and switch into strong wallbreakers like Choice Band Tyranitar and Urshifu-R, that force Clefable out. Clefable is hard stopped by Toxapex carrying Haze or Clear Smog, and without Flamethrower it can't meaningfully damage offensive Fairy-resistant Pokemon like Melmetal and Excadrill, so teammates that can remove or weaken these threats such as offensive Rotom-H and Rocky Helmet Ferrothorn are greatly appreciated.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 407249, "username": "Greybaum"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 324242, "username": "in the hills"}, {"user_id": 517892, "username": "pannu"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}]}
  },
  "Slowbro": {"sets": {"Defensive Pivot": {}}},
  "Cloyster": {
    "sets": {
      "Shell Smash Sweeper": {
        "description": "<p>Cloyster is a terrifying sweeper on hyper offense, utilizing the unique combination of Shell Smash, Skill Link, and Water Shuriken to snowball through teams with ease. With an incredibly high Defense stat, it gets many opportunities to set up on Pokemon like Seismitoad and Weavile. Water Shuriken always hits five times thanks to Skill Link, and it preempts Accelerock users like Aerodactyl and Terrakion after Shell Smash, preventing Cloyster from being revenge killed as easily. It also lets Cloyster reliably deal with weakened Choice Scarf users like Gengar, as well as naturally faster Pokemon like Zeraora. Freeze-Dry hits bulky Water-types like Rotom-W and Toxapex, which would otherwise wall it completely. Icicle Spear provides stronger neutral coverage for bulky Pokemon like Ferrothorn, Blissey, and Clefable, and it being physical lets Cloyster better threaten Kyurem and Sylveon. Life Orb gives Cloyster the extra power it needs to break past bulky walls like Galarian Slowking and Buzzwole. 88 Speed EVs let Cloyster outspeed Aerodactyl, and 29 HP IVs minimize Life Orb recoil. Teammates like Buzzwole and Mimikyu can soften up teams for Cloyster to clean up. Cloyster's ability to remove Water-types like Toxapex and Rotom-W massively benefits teammates that tend to struggle against them, like Urshifu-R and Scizor. Due to entry hazards severely cutting into Cloyster's longevity and making it vulnerable to priority moves, entry hazard control is very important. Taunt leads like Mew and Heatran can prevent hazards from going up in the first place, and offensive entry hazard removers like Obstagoon, Tornadus-T, and Diggersby can remove them.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 528036, "username": "Sulo"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 324242, "username": "in the hills"}, {"user_id": 517892, "username": "pannu"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}]}
  },
  "Gengar": {
    "sets": {
      "Choice Specs": {
        "description": "<p>Gengar is a powerful wallbreaker thanks to its high Special Attack and Speed stats combined with access to strong STAB moves, such as Moongeist Beam, which allows Gengar to 2HKO walls like non-Assault Vest Toxapex and Seismitoad. Sludge Wave hits threatening Fairy- and Grass-types such as Clefable and Rillaboom super effectively. Nasty Plot can be used instead of Sludge Wave to set up on walls crippled through Trick, such as Blissey, since Ghost- and Fighting-type coverage take care of almost all threats. Focus Blast gives Gengar an option to hit Ghost-resistant foes like Tyranitar, Chansey, and Porygon2. Gengar fits well on offensive teams that appreciate its ability to quickly remove threats and hinder opposing walls with Trick. Bulkier Pokemon such as Clefable and Seismitoad particularly enjoy having it knock out Pokemon that they are too passive to remove themselves. Pokemon like Thundurus-T and Rotom-H who are threatened by Tyranitar also benefit from Gengar's ability to 2HKO it. Due to its frailty, Gengar appreciates defensive teammates like Ferrothorn and Buzzwole that can take strong hits from threatening Pokemon like Aerodactyl, Cinderace, and Weavile, as well as pivots such as Corviknight, Toxapex, and Tornadus-T that can safely bring it in.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 439018, "username": "Theia"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 517892, "username": "pannu"}, {"user_id": 324242, "username": "in the hills"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}]}
  },
  "Gyarados": {
    "sets": {
      "Offensive": {
        "description": "<p>Thanks to its high Attack and decent Speed, Gyarados serves as a strong wallbreaker, with powerful STAB moves like Surging Strikes threatening common defensive Pokemon like Clefable and Hippowdon. Dragon Dance further bolsters its offensive presence, letting it overwhelm the likes of Toxapex and Ferrothorn, as well as outspeeding revenge killers like Zeraora, Gengar, and Choice Scarf Latios at +2. Dragon Ascent is a powerful STAB move that allows Gyarados to pressure Water-resistant and immune foes like Ferrothorn and Seismitoad. Substitute protects it from revenge killers like Accelerock Tyranitar and Aerodactyl, Toxic from Seismitoad and Heatran, and Strength Sap from Ferrothorn, instead using these Pokemon as setup fodder. Power Whip can be run instead of Substitute to deal more damage to defensive Water-types like Rotom-W and Seismitoad. Leftovers provides passive recovery that allows Gyarados to use Substitute more times, but Heavy-Duty Boots is preferred on non-Substitute sets to prevent Stealth Rock damage. Pokemon like Aerodactyl and Zeraora that struggle to harm walls like Gastrodon and Mudsdale appreciate Gyarados's ability to pressure them. Teammates like Excadrill and Rillaboom check the Rock- and Electric-types that threaten Gyarados. Entry hazard setters like Diggersby and Mew are also good teammates to wear down opposing Pokemon like Celesteela and make it easier for Gyarados to KO them.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 439018, "username": "Theia"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 517892, "username": "pannu"}, {"user_id": 324242, "username": "in the hills"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}]}
  },
  "Aerodactyl": {
    "sets": {
      "Choice Band": {
        "description": "<p>Aerodactyl is a very threatening wallbreaker with its high-powered STAB attacks in Head Smash and Brave Bird that come with no drawbacks thanks to Rock Head. Accelerock lets Aerodactyl revenge kill faster Pokemon like Zeraora, Choice Scarf users like Latios, Hydreigon, and Rotom-W, as well as faster setup sweepers like Salamence, Gyarados, and Dracozolt. It's also useful in beating other, slower priority users that may try to revenge kill Aerodactyl. Earthquake ensures an OHKO versus Heatran and good damage on Toxapex and Tyranitar. Fire Fang does the most damage versus Ferrothorn, and Toxic whittles down checks like Mudsdale and Seismitoad over time. Many offensive Pokemon, like Zeraora and Cinderace, appreciate the huge amounts of damage Aerodactyl can force onto walls like Ferrothorn and Mudsdale. Delayed moves like Future Sight and Doom Desire from Slowking and Heatran add an extra oomph to its attacks which net it OHKOs easier. Entry hazard support from Ferrothorn and Seismitoad also helps it secure more KOs. Aerodactyl's Stealth Rock weakness makes entry hazard removal like Clefable and Corviknight solid to use alongside it. Knock Off support to remove Rocky Helmet from checks like Mudsdale and Corviknight, as well as pivots that can bring Aerodactyl in safely, like Toxapex and Tornadus-T, can keep it healthy.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 539897, "username": "iapt"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 517892, "username": "pannu"}, {"user_id": 324242, "username": "in the hills"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}, {"user_id": 523866, "username": "UT"}]}]}
  },
  "Slowking": {
    "sets": {
      "Assault Vest": {
        "description": "<p>Slowking is a formidable specially defensive pivot that uses its good defensive typing, wide coverage, and ability to pivot with Flip Turn to check threats like Keldeo, Latios, and Heatran. With Assault Vest, Slowking can check a plethora of special attackers like Alakazam, Heatran, and Cloyster. Flip Turn helps Slowking gain momentum against switch-ins like Hydreigon, Rotom-W, and Kyurem by bringing in the likes of Terrakion, Aerodactyl, and other attackers that struggle with switching in safely. Flip Turn also helps Slowking check setup sweepers it cannot beat on its own, like Clefable and Sylveon, by pivoting in powerful wallbreakers like Nidoking and Melmetal to force them out. Future Sight helps Slowking's teammates break through their checks. Steam Eruption does heavy damage to neutral targets like Clefable and Tornadus-T and can threaten burns against physical attackers attempting to switch in like Rillaboom and Dracozolt. Scald can also be used, as while it's noticeably weaker, its higher PP count is better suited for bulkier teams. Grass Knot lets Slowking hit Seismitoad, which otherwise threatens to wall and potentially trap Slowking. Flamethrower can be run to catch Ferrothorn off guard and check Cotton Guard variants. Lastly, Psystrike is a solid STAB move that lets Slowking do immediate damage to Toxapex and Urshifu-R, but gives up a coverage option. The EV spread lets Slowking avoid the 2HKO from offensive Tornadus-T and +1 Urshifu-R's Close Combat, while the rest is put in Special Defense to be a better special pivot. Offensive threats like Aerodactyl and Kyurem that struggle to get onto the field safely appreciate Slowking's pivoting support. As a special wall, Slowking is noticeably weaker on the physical side against physical attackers like Aerodactyl, Rillaboom, and Terrakion; physically defensive teammates like Ferrothorn and Buzzwole can help patch this weakness up. The latter can also switch into Dark-types like Tyranitar and Weavile, which otherwise pressure Slowking immensely. Slowking is usually unable to KO Calm Mind sweepers like Reuniclus and Clefable, so it needs a teammate to pivot to like Melmetal, Tyranitar, or Nidoking that can break through them. Electric-types like Zeraora and Thundurus-T pressure Slowking heavily, so checks to these like Mudsdale, Ferrothorn, and Tyranitar are great teammates. Lastly, physical wallbreakers like Urshifu-R and Cinderace really appreciate Slowking's Future Sight support to pressure switch-ins like Toxapex, Rotom-W, and Mudsdale.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 517892, "username": "pannu"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 407249, "username": "Greybaum"}, {"user_id": 464398, "username": "LBDC"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 375662, "username": "Isaiah"}]}]}
  },
  "Tyranitar": {
    "sets": {
      "Offensive": {
        "description": "<p>Tyranitar is an incredibly threatening wallbreaker thanks to its high Attack stat and powerful attacking moves. Diamond Storm is a reliable Rock-type move, and Defense boosts can let it stomach hits from Seismitoad and Tornadus-T. Head Smash deals significantly more damage, notably netting KOs on Toxapex and Clefable at the cost of taking recoil damage, making it less spammable. Knock Off removes items from switch-ins like Seismitoad, Ferrothorn, and Buzzwole. Accelerock lets Tyranitar deter faster threats like Cinderace, Aerodactyl, and Gyarados from revenge killing it. It can also be used to pick off faster foes like Salamence, Thundurus-T, and Weavile. Spikes can be run to take advantage of the free turns Tyranitar generates by forcing out opposing Pokemon. Taunt is another option to prevent checks such as Clefable and Seismitoad from recovering. The EV spread lets it outspeed uninvested Buzzwole while optimizing its bulk and reducing Life Orb recoil. Walls like Mudsdale and Seismitoad are great for switching into foes that get a free switch in when Tyranitar tries to mitigate chip damage with Shore Up. Entry hazard removers like Clefable and Tornadus-T are also great for helping Tyranitar's longevity throughout longer games. Tyranitar breaking through common defensive Pokemon makes it an excellent teammate alongside fast cleaners like Cinderace, Aerodactyl, and Zeraora.</p>"
      },
      "Utility": {
        "description": "<p>Tyranitar's excellent natural bulk, further bolstered by Sand Stream's Special Defense boost, makes it a good defensive check to threats like Thundurus-T, Gengar, and Kyurem. Notably, it's less passive than other checks to these Pokemon thanks to its incredible Attack stat. Shore Up lets Tyranitar stay healthy throughout longer games. It's also an incredible entry hazard setter, having access to both Spikes and Stealth Rock and pressuring the tier's most common Defoggers. The entry hazard of choice is greatly dependent on Tyranitar's teammates; with teammates like Ferrothorn, Excadrill, and Seismitoad that prefer to set up Spikes, Stealth Rock is preferred. However, teammates like Clefable and Heatran that only get Stealth Rock appreciate Spikes more. Parting Shot can be used to safely pivot in teammates like Dracozolt and Reuniclus. Sand Stream benefits bulky Ground-types like Seismitoad and Gastrodon by increasing their recovery with Shore Up and also enables Sand Rush sweepers like Excadrill and Dracozolt. If Tyranitar is paired up with a lot of Pokemon that benefit from Sand Stream, Smooth Rock could be considered over Leftovers. Teammates to help mitigate Tyranitar's weakness to Water- and Ground-types like Toxapex, Ferrothorn, and Rotom-W are valuable. The EV spread lets it outspeed Corviknight and optimizes Attack and HP.</p>"
      },
      "Choice Band": {
        "description": "<p>Choice Band makes Tyranitar a fierce wallbreaker, taking full advantage of its powerful STAB combination. Knock Off is incredibly difficult to switch into unless it's resisted. Head Smash threatens to KO most Dark-resistant Pokemon like Clefable, Buzzwole, and Hydreigon. Diamond Storm can be run as well to avoid recoil damage. Accelerock is a good option against faster foes like Cinderace and Weavile. Sucker Punch is a notably stronger priority move than Accelerock, getting clutch KOs against the likes of Zygarde-10%, Gengar, and Latios. However, it does require some prediction. Beat Up can be used to significantly damage Skarmory, Ferrothorn, and Toxapex without taking chip from Rocky Helmet and Iron Barbs. However, it's a very team specific move, as it needs to be paired up with teammates that have a high Attack stat to function. Pivots to help safely bring Tyranitar onto the field are very important, as it lacks any recovery. Toxapex, Tornadus-T, and Seismitoad can all help pivot in Tyranitar safely into foes like Reuniclus, Zapdos, and Gastrodon. Future Sight support from Slowking and Galarian Slowking is also appreciated to help it break through physical walls like Buzzwole and Mudsdale.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 517892, "username": "pannu"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 324242, "username": "in the hills"}, {"user_id": 511624, "username": "Fc"}]}, {"name": "Grammar checked by", "members": [{"user_id": 375662, "username": "Isaiah"}, {"user_id": 523866, "username": "UT"}]}]}
  },
  "Salamence": {
    "sets": {
      "Dragon Dance": {
        "description": "<p>Salamence's high Attack and Speed make it a powerful offensive threat, utilizing Dragon Dance to outspeed other offensive Pokemon like Zeraora and Gengar after one boost. Its typing gives it opportunities to setup against Grass- and Fire-types such as Rillaboom Choice-locked into Grassy Glide and Victini. Dragon Ascent is a powerful STAB attack that allows Salamence to threaten walls like Clefable and Seismitoad with 2HKOs at +1. Earthquake hits Flying-resistant foes like Tyranitar and Melmetal super effectively, while Dragon Darts can be used instead to hit foes like Rotom-W and Thundurus-T. Roost improves Salamence's longevity; it is possible to run Dragon Darts over Roost, but only on hyper offense teams. Heavy-Duty Boots prevents Stealth Rock damage from wearing it down. Moxie turns Salamence into a potent sweeper, particularly late-game as Attack boosts allow it to easily take out weakened foes. Intimidate instead puts more pressure on physically offensive foes and gives Salamence more opportunities to set up against physical attackers like Cinderace and Zeraora. Pokemon such as Terrakion and Urshifu-R that fear revenge killers like Rillaboom appreciate Salamence's ability to switch into and threaten them. Salamence appreciates these Fighting-type teammates in return, as they can threaten revenge killers like Tyranitar and Weavile that threaten Salamence. Teammates like Diggersby that can set entry hazards are valuable to chip opposing Pokemon and make them easier to KO.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 439018, "username": "Theia"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 324242, "username": "in the hills"}, {"user_id": 464398, "username": "LBDC"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}]}
  },
  "Latios": {
    "sets": {
      "Choice Scarf": {
        "description": "<p>Latios is one of the best Choice Scarf users, able to revenge kill threatening offensive Pokemon such as Buzzwole, Terrakion, and Urshifu-R. Psystrike heavily damages Blissey and Galarian Slowking, while Photon Geyser lets it better beat Buzzwole and Toxapex. Clanging Scales hits most of the metagame for at least neutral damage, threatening opposing Latios and Hydreigon and KOing Kyurem behind a Substitute. Trick cripples defensive Pokemon such as Ferrothorn, Clefable, and Blissey. On more offensive teams, Healing Wish can be used to heal offensive threats like Nidoking and Gyarados to threaten the opposing team again. Mystical Fire is Latios's best option to hit Steel-types like Ferrothorn and Corviknight, while Aura Sphere is its best option against Tyranitar and Heatran. Latios appreciates defensive teammates such as Toxapex that are able to switch into Buzzwole's First Impression and Pokemon such as Tyranitar that can switch into Gengar. Strong attackers such as Melmetal and Sylveon make great teammates, as they are able to deal with checks like Clefable, Tyranitar, and Weavile. Latios can also opt to run Choice Specs to improve its damage output, but Choice Scarf is usually preferred to better serve as a revenge killer.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 525446, "username": "Ducky"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 324242, "username": "in the hills"}, {"user_id": 517892, "username": "pannu"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 528036, "username": "Sulo"}]}]}
  },
  "Hippowdon": {"sets": {"Defensive": {}}},
  "Weavile": {
    "sets": {
      "Swords Dance": {
        "description": "<p>Weavile is a threatening cleaner with Swords Dance, having a near-unresisted STAB combination that can break through a lot of common walls like Seismitoad and Slowking. Boosted Triple Axel is the main way of damaging foes; Weavile just has to be careful around Rocky Helmet users like Buzzwole and Clefable. Knock Off is Weavile's best move against Ice-resistant foes like Toxapex, Heatran, and Melmetal. It also removes Rocky Helmets from foes like Corviknight, Clefable, and Buzzwole, letting Weavile use Triple Axel against them more freely. Furthermore, Weavile's Knock Off removing Heavy-Duty Boots helps out entry hazard setters a lot, making Ferrothorn and Seismitoad using Spikes and Stealth Rock much more effective against bulkier teams that can normally ignore them . Ice Shard helps pick off fast revenge killers like Choice Scarf Latios and weakened Zeraora. If a team has suitable defensive counterplay to fast revenge killers, Low Kick can be used as a way to deal much more damage to Ferrothorn, Heatran, and Melmetal. Offensively, Accelerock heavily limits Weavile, as Tyranitar, Aerodactyl, and Terrakion can all revenge kill it. This makes Seismitoad a good defensive teammate that can both get Weavile in and absorb Rock-type moves. The main stops to Weavile even when boosted are Ferrothorn, Buzzwole, and Toxapex because they can tank a hit and OHKO it in return. This makes Pokemon like Nasty Plot Tornadus-T with Heat Wave, Swords Dance Blaziken, and Cinderace strong partners. In return, Knock Off weakens walls like Rotom-W so they can clean late-game as well.</p>"
      },
      "Choice Band": {
        "description": "<p>Choice Band Weavile is an incredible wallbreaker, 2HKOing most Pokemon and requiring minimal chip damage to 2HKO even the bulkiest of walls like Buzzwole. Knock Off and Triple Axel are very spammable against teams that can't punish contact moves, and Weavile can still get around that with Knock Off for Rocky Helmet and Beat Up for Iron Barbs. Ice Shard is strong enough to pick off most offensive Pokemon, making it very valuable against teams using sweepers like Salamence, Galarian Moltres, and Rillaboom. Beat Up is nearly impossible to switch into for Pokemon that don't resist it and have recovery, but it mandates teammates with high Attack stats to make the most out of it. Alternatively, Low Kick does more damage to Ferrothorn while also hitting opposing Weavile, Melmetal, and Tyranitar, but it is generally less useful than Beat Up's general high damage output. An Adamant nature further accentuates the wallbreaking capabilities that Weavile has, allowing it to always 2HKO specially defensive Heatran with Knock Off, but a Jolly nature allows it to outspeed Tornadus-T, Gengar, and Latios, which can otherwise survive an Ice Shard and revenge kill it. Jolly also lets it outspeed Cinderace to threaten it with Knock Off. Strong entry hazard control is important, but a majority of the Rapid Spin and Defog users like Clefable and Corviknight have low Attack, so while they are good partners for Low Kick sets, Beat Up sets would prefer options like Thundurus-T and Tornadus-T. Other high Attack Pokemon like Buzzwole and Rillaboom, which can also pivot, are strong partners to help wear down physical walls for each other.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 511624, "username": "Fc"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 324242, "username": "in the hills"}, {"user_id": 517892, "username": "pannu"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}]}]}
  },
  "Rotom-Heat": {"sets": {"Defensive Pivot": {}}},
  "Rotom-Wash": {
    "sets": {
      "Defensive": {
        "description": "<p>Rotom-W serves as a premier defensive pivot thanks to its high Defense, typing, and Levitate allowing it to check strong Pokemon like Excadrill and Tornadus-T. Volt Switch allows Rotom-W to safely pivot out of threats like Rillaboom and Buzzwole and bring in teammates to pressure them. Scald deters switch-ins like Zeraora and Dracozolt by threatening them with burn. Roost gives Rotom-W consistent recovery, while Strength Sap better checks setup sweepers like Excadrill and Salamence, though it becomes less effective with repeated uses. Rotom-W's last move is flexible based on preference and team composition; Toxic wears down other defensive Pokemon and threatening setup sweepers, while Apple Acid hits Seismitoad and weakens opposing special walls with Special Defense drops. Defog lets Rotom-W serve as an entry hazard remover and has good matchups against many common entry hazard setters. 56 Speed EVs outspeeds Adamant Tyranitar and pivots safely out of strong moves such as Head Smash. More Speed EVs can be invested to outspeed threats like Buzzwole and Heatran, but this comes at the cost of cutting further into its bulk. Offensive Pokemon like Gengar, Weavile, and Keldeo appreciate Rotom-W's ability both to take physical hits and bring them in safely. Rotom-W struggles with special walls like Blissey and appreciates physically offensive teammates that can remove them, such as Aerodactyl and Terrakion, as well as teammates such as Corviknight that can switch into Grass-types like Rillaboom.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 439018, "username": "Theia"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 517892, "username": "pannu"}, {"user_id": 324242, "username": "in the hills"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}]}
  },
  "Heatran": {
    "sets": {
      "Specially Defensive": {
        "description": "<p>Heatran's potent defensive typing, good offensive movepool, and great bulk make it a premier defensive Pokemon in STABmons. It can come in on a bevy of Pokemon like Clefable and Ferrothorn and force them out effectively. Magma Storm threatens the aforementioned Pokemon as well as Corviknight and Melmetal, letting Heatran set up Stealth Rock when they switch out. Earth Power lets Heatran hit Galarian Slowking, Tyranitar, opposing Heatran, and Toxapex for more reliable damage. Toxic debilitates switch-ins like Rotom-W, Seismitoad, and Latios, making it even harder to check Heatran over a long game. The combination of Magma Storm and Toxic also allows Heatran to spread huge amounts of residual damage. Doom Desire is an option over Toxic that enables dangerous wallbreakers like Keldeo and Buzzwole, forming dangerous offensive cores and making huge progress. Taunt blocks entry hazards and completely shuts down Pokemon like Blissey and Rotom-H, denying their recovery and making them easier to wear down. Heatran threatening a multitude of entry hazard removers, including Corviknight and Clefable, makes it an incredibly good user of Stealth Rock as well. King's Shield scouts Choice-locked attackers like Cinderace and Terrakion, lets Heatran recover more from Leftovers, and pairs nicely with both Toxic and Doom Desire to stall turns. The Attack drop also lets Heatran stay in on physical attackers like Tyranitar and force them out or take the subsequent attack with ease. However, Taunt and Stealth Rock provide more consistent utility against a variety of threats and are therefore preferred.</p> <p>Leftovers keeps Heatran healthy over the course of a game, letting it check Pokemon like Latios and Calm Mind Clefable long-term. 128 Speed EVs allow Heatran to outspeed Adamant Tyranitar. Flame Body is preferred to punish physical attackers like Weavile and Tornadus-T, but if the team requires a better switch-in to the likes of Rotom-H and coverage moves like Celesteela's Flamethrower, Flash Fire can be used. Heatran pairs well with a wide variety of Pokemon, but teammates like Rotom-W and Latios that can shore up its bad matchups against Water-types like Seismitoad and Assault Vest Toxapex are good partners. Heatran is unable to immediately threaten Latios and Assault Vest Slowking; teammates like Weavile, Zeraora, and Tyranitar can, though. Wallbreakers like Aerodactyl and Terrakion heavily appreciate Doom Desire support, as the extra hit makes it more difficult for walls to switch in.</p>"
      },
      "Offensive": {
        "description": "<p>Heatran is an incredibly dangerous wallbreaker, capable of switching in on Pokemon like Latios, Clefable, and Scizor and firing off strong attacks in retaliation. It also puts immense pressure on common walls like Melmetal, Tyranitar, and Rotom-W. Earth Power is needed to significantly dent opposing Heatran, as well as wearing down Pokemon like Toxapex and Galarian Slowking. Magma Storm allows Heatran to spread residual damage, wearing down switch-ins like Hydreigon and Seismitoad. Doom Desire is excellent at facilitating other wallbreakers like Aerodactyl and Keldeo, making it harder for their checks like Mudsdale and Assault Vest Toxapex to switch in. It also forces out pivots like Tyranitar, Hydreigon, and Tornadus-T that could otherwise stay in on Heatran. Stealth Rock supports the team and chips Heatran's switch-ins. King's Shield allows Heatran to slowly accrue more Leftovers recovery, increasing its overall longevity, as well as dissuading Cinderace's High Jump Kick and scouting potential Choice item users like Aerodactyl, Terrakion, and Buzzwole. Afterwards, Heatran can safely pivot into their appropriate checks. Toxic is a solid alternative that greatly wears down checks like Rotom-W and Seismitoad, making it more difficult for them to switch in reliably. It also works great alongside Magma Storm.</p> <p>If forgoing Leftovers, Air Balloon lets Heatran switch into Ground-types like Mudsdale and avoid Ground-type coverage moves from Pokemon like Melmetal and opposing Heatran. A Timid nature can be used over Modest to outspeed Pokemon like Nidoking and Volcanion. Kyurem is a solid partner that can pressure Heatran checks like Rotom-W, Seismitoad, and Assault Vest Toxapex very well. Heatran pressures the likes of Celesteela, Corviknight, and Ferrothorn in return and can wear down Rotom-H with Toxic. Pivots like Rotom-W and Assault Vest Slowking bait in Ferrothorn for Heatran to take advantage of, and they can lure in and remove Seismitoad with Apple Acid and Grass Knot, respectively. Flame Body as its ability deters physical attackers like Dracozolt, Weavile, and Tyranitar from recklessly damaging it, though Flash Fire can be used to prevent Pokemon like Rotom-H from freely using their Fire-type STAB moves.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 528036, "username": "Sulo"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 324242, "username": "in the hills"}, {"user_id": 517892, "username": "pannu"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}]}
  },
  "Excadrill": {
    "sets": {
      "Sand Sweeper": {
        "description": "<p>Excadrill is one of the most threatening sweepers in STABmons, pressuring many defensive cores and outpacing offensive Pokemon like Zeraora, Cinderace, and Terrakion when sand is active. Earthquake and Thousand Waves are usually interchangeable, with Earthquake having more power but Thousand Waves trapping opponents and generating momentum. Additionally, Thousand Waves is not weakened by Grassy Terrain from Rillaboom. Sunsteel Strike lets Excadrill beat Fairy-types and wear down Ground-resistant Pokemon, and Rapid Spin clears entry hazards. Swords Dance makes Excadrill a powerful sweeper in sand, while Shore Up allows Excadrill to take on a more supportive role with Rapid Spin. A Jolly nature lets Excadrill revenge kill Pokemon like Nidoking and Mamoswine outside of sand, but an Adamant Nature provides Excadrill with a ton of power to let it break walls like Buzzwole after just a bit of prior damage. Leftovers is the preferred item to provide passive recovery and offset chip damage from stray hits and Rocky Helmet. Alternatively, Metal Coat makes Sunsteel Strike even more threatening against walls after chip damage. Tyranitar or Hippowdon are mandatory teammates to provide sand. Excadrill requires partners like Rotom-W, Thundurus-T, and Crawdaunt that can deal with both bulky Water- and Ground-types like Slowbro and Hippowdon and its biggest checks, Corviknight, Celesteela, and Skarmory. Dracozolt helps Excadrill overwhelm Ground-types while beating Steel- and Flying-types, making it a staple on sand teams. Defensive Water-types like Toxapex and Slowbro can also help as pivots into Ground- and Flying-types while generating momentum for Excadrill with Flip Turn and Teleport, respectively.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 511624, "username": "Fc"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 324242, "username": "in the hills"}, {"user_id": 464398, "username": "LBDC"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}]}
  },
  "Seismitoad": {
    "sets": {
      "Defensive Pivot": {
        "description": "<p>Seismitoad is an incredibly effective pivot thanks to its fantastic bulk which lets it check physical attackers like Zeraora and Tyranitar. Furthermore, its fantastic typing lets it handle the likes of Heatran and Dracozolt, and thanks to Water Absorb, it's also a fantastic check to Water-types like Rotom-W, Keldeo, and Urshifu-R. Seismitoad's excellent defensive profile gives a plethora of opportunities to set up entry hazards, which is why Spikes is preferred over Stealth Rock. However, Stealth Rock is an option if the team already has another Spikes setter. Shore Up allows Seismitoad to stay healthy throughout a game, so that it can check Pokemon like Cinderace and Zeraora long-term. Thousand Waves allows Seismitoad to trap Pokemon such as Toxapex and Tyranitar. Toxic is an alternative to Thousand Waves that punishes switch-ins like Rotom-W, Tornadus-T, and opposing Seismitoad, allowing partners like Heatran, Keldeo, and Aerodactyl to potentially break through them. Rocky Helmet can be used to further spread chip damage onto Pokemon such as Zeraora, Cinderace, and Buzzwole, while Heavy-Duty Boots prevents Seismitoad from being pressured by entry hazards while switching in on wallbreakers. Wallbreakers like Cinderace and Aerodactyl pressure Pokemon that want to switch into Seismitoad's Flip Turn, like Ferrothorn and Tornadus-T. 0 Speed IVs and EVs and a Relaxed nature can be used for a slower Flip Turn, underspeeding Pokemon like Clefable to better bring in wallbreakers like Aerodactyl.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 528036, "username": "Sulo"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 517892, "username": "pannu"}, {"user_id": 324242, "username": "in the hills"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}]}
  },
  "Ferrothorn": {
    "sets": {
      "Utility": {
        "description": "<p>Ferrothorn's excellent defensive typing, great stat spread, and wide utility movepool make it a premier entry hazard setter in STABmons. Grav Apple is the primary STAB move, offering consistent damage, allowing Ferrothorn to break through defensive Pokemon like Clefable and Sylveon with repeated Defense drops, and breaking Gyarados's Substitute. Anchor Shot can be used to trap foes like Hippowdon and Zeraora, with stat drops from Grav Apple and Strength Sap heavily helping Ferrothorn remove these targets from play. Knock Off is an alternative utility option that can be used to remove Leftovers and Heavy-Duty Boots from the likes of Heatran, Tornadus-T, and Rotom-H, cutting into their longevity and making them more vulnerable to Ferrothorn's hazards. Other viable utility options include Toxic, which further cripples switch-ins like Rotom-H but in return leaves Ferrothorn helpless against Steel-types like Corviknight and the aforementioned Heatran, and Aromatherapy, which is useful on defensive teams that benefit from Ferrothorn taking a cleric role. Ferrothorn fits best on balance teams, with defensive Water-types like Toxapex and Slowking offering fantastic type synergy, soaking up strong Fire- and Fighting-type attacks from Cinderace and Keldeo. Ferrothorn deals with threats like Zeraora and Rillaboom in return. Stealth Rock users like Tyranitar and Clefable form a strong hazard core with Ferrothorn, with the former heavily pressuring Rotom-H and also greatly appreciating the chip damage that Spikes provides, while the latter can reliably remove hazards and handle Fighting-types like Buzzwole, which Ferrothorn has trouble with. Wallbreakers like Thundurus-T, Reuniclus, and Aerodactyl make for good partners, profiting off Ferrothorn's hazards and ability to check faster revenge killers like Weavile and Zeraora.</p>"
      },
      "Cotton Guard": {
        "description": "<p>Cotton Guard turns Ferrothorn into a formidable wall, checking many of the tier's strongest setup sweepers including Excadrill, Dracozolt, and Gyarados. It also makes for a solid wincon thanks to Cotton Guard increasing the damage output of Body Press. Spikes synergizes excellently with this strategy, as Ferrothorn can use the threat of boosted Body Press to force out common entry hazard removers like Corviknight and Tornadus-T. Strength Sap allows Ferrothorn to further challenge physical attackers that may otherwise muscle through Cotton Guard boosts. Alternatively, Anchor Shot can be used instead of Spikes, trapping Pokemon like Hippowdon, Clefable, and opposing Ferrothorn that may otherwise exploit an unboosted Ferrothorn to set up hazards. Ferrothorn makes great use of Leftovers's passive recovery, notably using it to avoid a 2HKO from Aerodactyl's Brave Bird. Chople Berry can be run to let Ferrothorn lure in Fighting-types like Urshifu-R, Buzzwole, and Terrakion. Ferrothorn fits best on balance and offense teams that require a blanket check to physical attackers, and their offensive cores can make full use of Spikes chip damage and weaken foes into range of Body Press. VoltTurn Pokemon like Rotom-H and Thundurus-T are therefore great options, as are strong wallbreakers that can remove Heavy-Duty Boots, like Tyranitar and Weavile. Rapid Spin users are also appreciated for removing opposing hazards without removing Ferrothorn's Spikes, with Sylveon and Calm Mind Clefable being two particularly notable examples that also offer a Fighting resistance.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 407249, "username": "Greybaum"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 517892, "username": "pannu"}, {"user_id": 324242, "username": "in the hills"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}]}
  },
  "Terrakion": {
    "sets": {
      "Choice Band": {
        "description": "<p>Choice Band Terrakion is a devastating wallbreaker. It has high-powered STAB moves in Close Combat and Diamond Storm and an incredibly high Attack stat, further boosted by Choice Band, making it incredibly difficult to switch into safely. Close Combat allows Terrakion to blow past walls like Seismitoad and Ferrothorn, with even Pokemon resisting it like Tornadus-T and Clefable taking heavy damage. Diamond Storm reliably threatens the aforementioned Fighting-resistant Pokemon, but also others in Toxapex and Thundurus-T. Potential Defense boosts also make it harder for Pokemon like Cinderace and Zeraora to revenge kill it. Accelerock provides valuable revenge killing against the likes of Gyarados, Cinderace, and Aerodactyl. Earthquake hits Pokemon like Toxapex, Galarian Slowking, and Gengar harder than Diamond Storm does. Terrakion appreciates pivots like Slowking and Seismitoad that can bring it in safely. Clefable and Melmetal appreciate how well Terrakion pressures Steel-types. Clefable checks physically defensive Buzzwole, while Melmetal can wear down Terrakion checks like Mudsdale with Toxic, making it even more difficult to switch into. Future Sight and Doom Desire support from Slowking and Heatran compound this difficulty, dissuading switch-ins like Toxapex and Clefable, respectively. Late-game cleaners like Aerodactyl, No Retreat Urshifu-R, and Weavile are also solid partners, taking advantage of how well Terrakion breaks through opposing walls.</p>"
      },
      "No Retreat": {
        "description": "<p>No Retreat makes Terrakion a solid wincon, boosting bulk and Speed to make it harder to revenge kill. Being able to switch moves, as well as compounding No Retreat's Attack boost with Life Orb, also lets it break past would-be checks like Clefable, Mudsdale, Corviknight, and Toxapex. Swords Dance alongside No Retreat makes Terrakion immensely more threatening, but if the rest of the team does not pressure Pokemon like Galarian Slowking and Toxapex well enough, Earthquake is generally the better option. Shuca Berry is an option over Life Orb to set up on Pokemon like Mudsdale, and Lum Berry can be used to avoid status from Clefable and Toxapex. Wallbreakers like Gengar and Thundurus-T appreciate how well Terrakion pressures their checks in Tyranitar, Blissey, and Assault Vest Toxapex. In return, Gengar and Thundurus-T can soften up Terrakion checks like Seismitoad and physically defensive Buzzwole, letting it sweep late-game. Setup sweepers like Salamence and Mimikyu overwhelm opposing physical walls alongside Terrakion, forming dangerous attacking cores.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 528036, "username": "Sulo"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 517892, "username": "pannu"}, {"user_id": 324242, "username": "in the hills"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}]}
  },
  "Tornadus-Therian": {
    "sets": {
      "Offensive": {
        "description": "<p>Tornadus-T is an incredibly potent offensive pivot that is hard to switch into thanks to its strong STAB Dragon Ascent and good coverage moves. Knock Off lets Tornadus-T remove opposing items and wear down its switch-ins such as Rotom-H, Corviknight, and Mudsdale. U-turn generates momentum on Pokemon trying to switch into Tornadus-T and lets it safely pivot in teammates like Tyranitar, Gengar and Kyurem. Superpower lets it OHKO Tyranitar and heavily dent Steel-types like Heatran, Ferrothorn, and Excadrill. Defog can be run as an emergency entry hazard removal option. Lastly, Taunt lets Tornadus-T shut down Pokemon that rely on their status moves, like Clefable, Corviknight, Ferrothorn, and Hippowdon. Electric-, Rock, and Steel-types commonly switch into Tornadus-T, so pairing it up with Pokemon that help handle these, like Seismitoad, Toxapex, Aerodactyl, and Cinderace, make for a good core. Removing Heavy-Duty Boots, Assault Vest, and Rocky Helmet with Knock Off helps teammates like Buzzwole, Aerodactyl, and Keldeo beat opposing teams. Other pivots like Rotom-W and Cinderace form a VoltTurn core with Tornadus-T that maintains consisistent momentum.</p>"
      },
      "Assault Vest": {"description": "<p>Thanks to the longevity from Regenerator and extra bulk from Assault Vest, Tornadus-T can blanket check a lot of the tier's special attackers, like Gengar, Nidoking, and Keldeo. Focus Blast is its best move for damaging Steel-types like Heatran and Melmetal, as well as hitting Tyranitar on a switch in. Heat Wave can also be used to threaten Ferrothorn and Corviknight, but losing its super effective coverage against Heatran and Tyranitar isn't ideal. U-turn lets Tornadus-t safely pivot in its teammates, notably bringing in revenge killers like Cinderace, Gengar, and Hydreigon against special attackers it cannot beat. Physically offensive sets running Dragon Ascent and Superpower with a Jolly nature can also be used, notably giving Tornadus-T more damage output against Calm Mind sweepers like Clefable and Reuniclus.</p>"},
      "Defensive": {"description": "<p>Thanks to its good bulk and incredible longevity with Regenerator, Tornadus-T can also act as a fantastic defensive pivot. Furthermore, Tornadus-T has great utility moves to further improve its role: Knock Off allows it to cripple opponents like Rotom-W, Toxapex, and Heatran by removing their items, U-turn lets it safely pivot in teammates like Keldeo, Tyranitar, and Reuniclus., and Defog lets it remove entry hazards for its teammates, which is greatly appreciated by entry hazard-weak teammates like Kyurem and Aerodactyl. Alternatively, if your team already has entry hazard removal like Corviknight or Clefable, Toxic can be run to wear down Tornadus-T's switch-ins.</p>"},
      "Nasty Plot": {
        "description": "<p>Tornadus-T's incredible Speed tier, good longevity, and powerful Hurricane make it a great setup sweeper. Nasty Plot lets it bolster its Special Attack stat to incredible levels, allowing it to even break through the likes of Blissey, Thundurus-T, and Corviknight. Aeroblast is less powerful than Hurricane but can be used for its better accuracy. However, its low PP and damage output are unideal for a setup sweeper like Tornadus-T, which thrives in longer games. Focus Blast is the primary way to hit foes that resist Flying like Tyranitar, Heatran, and Rotom-W. Knock Off can be run to cripple switch-ins like Chansey, Assault Vest Toxapex, and Thundurus-T. Taunt can also be run to shut down the likes of Clefable, and Ferrothorn, and Transform Chansey. A more offensive spread with full investment in Special Attack can be used but makes Tornadus-T significantly less bulky and fails to check Pokemon like Buzzwole and Rillaboom. Weather Ball can be used over Knock Off or Taunt on weather teams to give Tornadus a powerful move to break through checks like Thundurus-T and Rotom-W.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 517892, "username": "pannu"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 324242, "username": "in the hills"}, {"user_id": 407249, "username": "Greybaum"}]}, {"name": "Grammar checked by", "members": [{"user_id": 375662, "username": "Isaiah"}, {"user_id": 523866, "username": "UT"}]}]}
  },
  "Thundurus-Therian": {
    "sets": {
      "Offensive": {
        "description": "<p>Thundurus-T's high base Special Attack and good offensive typing threatens super effective damage on many common defensive Pokemon such as Toxapex and Buzzwole. Thunder Cage and Aeroblast are its STAB moves of choice, with the former trapping the opponent and dealing residual damage, while the latter boasts a high Base Power. Thunderbolt is an option that offers move consistency than Thunder Cage, and Toxic can be run over Aeroblast to better hit Tyranitar and opposing Thundurus. Focus Blast hits the ever-present Tyranitar, which can often otherwise switch in freely, and hits Blissey and defensive Steel-types, like Ferrothorn and Heatran. Nasty Plot is another good option, allowing Thundurus-T to break through defensive checks. Roost allows Thundurus-T to stay healthy over the course of a game, letting it switch into weak moves like U-turn from Tornadus-T and act as a check to Zeraora. Thundurus-T appreciates defensive partners such as Ferrothorn and Mudsdale, as it is forced out by many common Pokemon such as Aerodactyl, Terrakion, and Latios. Strong physical attackers such as Buzzwole also make good partners, as they threaten Pokemon like Blissey and Tyranitar for Thundurus-T. Thundurus-T can also opt to invest EVs in HP and Defense to better check Pokemon such as Rillaboom and Excadrill. An alternate spread of 252 HP / 92 Def / 164 Spe with a Bold nature can be used to better check Rillaboom and Excadrill while still outspeeding Heatran.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 525446, "username": "Ducky"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 324242, "username": "in the hills"}, {"user_id": 517892, "username": "pannu"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}]}
  },
  "Kyurem": {
    "sets": {
      "Offensive": {
        "description": "<p>Kyurem is a fierce offensive threat that puts immense pressure on common defensive foes like Buzzwole and Mudsdale. Freeze-Dry lets Kyurem beat Water-types like Toxapex, Slowking, and Rotom-W that would otherwise wall it. Earth Power hits Steel-types like Melmetal and Heatran. Ice Beam is its best STAB against common walls like Clefable, Buzzwole, and Celesteela. Alternatively, Triple Axel alongside a Rash nature can be run to 2HKO Blissey and pressure Chansey and Tyranitar. Roost lets Kyurem stay healthy throughout longer games as well as switch into the likes of Rotom-W and Seismitoad more consistently. A Timid or Naive nature can be run to more reliably outspeed max speed Excadrill, Nidoking, and Rotom-W, but this significantly cuts down on Kyurem's damage. Similarly, Heavy-Duty Boots can eliminate Kyurem's entry hazard weakness but also cuts down on its power. Good pivots like Tornadus-T, Slowking, and Rotom-W make for fantastic teammates, as they can help Kyurem get onto the field safely. Entry hazard removal is also crucial to counteract Kyurem's Stealth Rock weakness; the likes of Clefable, Sylveon, and Corviknight are useful teammates in that regard. Wallbreakers like Cinderace and Melmetal that struggle against Water-types like Toxapex and Rotom-w appreciate Kyurem's ability to pressure them. Rock-types like Accelerock Tyranitar and Aerodactyl are immensely threatening against Kyurem, so Kyurem partners well with teammates that can help against them, like Mudsdale, Ferrothorn, and Urshifu-R; in addition, they can help against Steel-types like Melmetal, which can live a hit from and OHKO Kyurem.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 517892, "username": "pannu"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 464398, "username": "LBDC"}, {"user_id": 407249, "username": "Greybaum"}, {"user_id": 324242, "username": "in the hills"}]}, {"name": "Grammar checked by", "members": [{"user_id": 375662, "username": "Isaiah"}]}]}
  },
  "Keldeo": {
    "sets": {
      "Choice Specs": {
        "description": "<p>Keldeo's incredible Special Attack stat and STAB combination make it a potent wallbreaker when equipped with Choice Specs. It matches up positively against common top tier threats like Tyranitar, Heatran, and Excadrill. Furthermore, Keldeo's STAB moves have excellent neutral coverage; common Water-type checks like Ferrothorn and Seismitoad fear its Fighting-type attacks, while Fighting-resistant foes like Clefable and Tornadus-T cannot stomach Water Spout. Keldeo also has a solid Speed tier, outspeeding and threatening opposing wallbreakers like Nidoking, Thundurus-T, and Kyurem. Water Spout OHKOes common defensive foes like Corviknight and Buzzwole and even nets 2HKOs against frailer Water-resistant Pokemon like Rotom-W, Hydreigon, and Urshifu-R. Secret Sword does good damage against common Water-type checks like Seismitoad and Ferrothorn while also hitting special walls like Blissey and Gastrodon. Steam Eruption is a more reliable Water-type attack if Keldeo is at low health and can cripple some of its checks like Toxapex. Focus Blast gives Keldeo another strong STAB attack, OHKOing Rotom-W after Stealth Rock, Seismitoad after minor chip, and Ferrothorn outright, though its poor accuracy makes it less reliable. Alternatively, Water Shuriken can be used to revenge kill faster threats like Aerodactyl, Cinderace, and Sand Rush Excadrill. Due to its reliance on Water Spout, Keldeo appreciates teammates with entry hazard removal options like Tornadus-T, Corviknight, and Clefable, as they can prevent Keldeo from taking unnecessary entry hazard damage. Future Sight support from Slowking deters Assault Vest users that otherwise check Keldeo like Toxapex and Tornadus-T from switching in. Teammates that can pivot Keldeo into the field safely like Tornadus-T, Corviknight, and Toxapex are important to keep it healthy as it attempts to wallbreak. Paralysis support from teammates like Clefable and Melmetal can slow down faster foes like Tornadus-T, Aerodactyl, and Cinderace to prevent Keldeo from being revenge killed.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 493260, "username": "Marnie"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 517892, "username": "pannu"}, {"user_id": 324242, "username": "in the hills"}]}, {"name": "Grammar checked by", "members": [{"user_id": 375662, "username": "Isaiah"}, {"user_id": 523866, "username": "UT"}]}]}
  },
  "Toxapex": {
    "sets": {
      "The Pex": {
        "description": "<p>Toxapex is one of the best pivots in STABmons, thanks to Flip Turn. It's also a fantastic check to a lot of common attackers like Urshifu-R, Buzzwole, and non-Nasty Plot Tornadus-T. Flip Turn lets Toxapex generate momentum and pivot in wallbreakers like Kyurem, Aerodactyl, and Tyranitar. Moreover, Toxapex can almost always make progress against the opposing team; Toxic lets it wear down almost everything in the tier, notably Seismitoad, Gastrodon, and Rotom-W, which are otherwise fine switch-ins to it. Knock Off can also be ran to remove items from the likes of Ferrothorn and Clefable. Lastly, Scald can be run to try and burn physical attackers such as Excadrill; it also lets Toxapex status other Steel- and Poison-type Pokemon that are immune to Toxic, such as Ferrothorn, Corviknight, and opposing Toxapex. Haze lets Toxapex thwart setup sweepers like Clefable, Buzzwole, and Gyarados that attempt to use it as setup fodder. Depending on your team, it is also possible to drop Haze and run one of the aforementioned options, such as Scald or Toxic. Toxapex works best on more defensive teams and teammates like Buzzwole, Mudsdale, and Ferrothorn can help patch up its weaknesses against wallbreakers like Excadrill and Zeraora. A Relaxed nature alongside 0 Speed IVs make Toxapex as slow as possible for Flip Turn.</p>"
      },
      "Assault Vest": {
        "description": "<p>Toxapex can use its wide movepool and good bulk alongside Regenerator to be a fantastic special wall, further boosting its Special Defense with Assault Vest to check common Special Attackers like Keldeo, Gengar, and Cloyster. Poison Fang lets it potentially poison Tornadus-T, Kyurem, and Water-immune foes like Gastrodon and Seismitoad that try to switch into Flip Turn. Scald can also be used to try and deter physical attackers like Zeraora and Tyranitar and Steel-types like Ferrothorn from switching in. Knock Off lets Toxapex pressure the likes of Thundurus-T, Galarian Slowking, and Reuniclus while also doing good damage against Gengar and Slowking. Flip Turn lets it pivot out against wallbreakers it can'(apostrophe)t handle and safely get wallbreakers like Aerodactyl and Nidoking onto the field. Clear Smog lets it prevent sweepers like Calm Mind Clefable and Nasty Plot Tornadus-T from getting out of hand. Due to Toxapex mostly being used to handle special attackers, physical walls like Mudsdale, Cotton Guard Ferrothorn, and Buzzwole make for fantastic teammates as they cover each others weaknesses. Steel- and Dark-types like Corviknight and Tyranitar can also help it against Psychic-type foes like Reuniclus, Latios, and Future Sight Slowking. A Relaxed nature with 64 Defense EVs lets Toxapex avoid getting OHKOed by Zeraora while helping it take on other physical attackers like Rillaboom and Urshifu-R. 0 Speed IVs are used to ensure the slowest possible pivots with Flip Turn.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 517892, "username": "pannu"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 324242, "username": "in the hills"}, {"user_id": 464398, "username": "LBDC"}]}, {"name": "Grammar checked by", "members": [{"user_id": 375662, "username": "Isaiah"}, {"user_id": 523866, "username": "UT"}]}]}
  },
  "Mudsdale": {
    "sets": {
      "Defensive": {
        "description": "<p>Mudsdale is a solid Pokemon on defensive teams, blanket checking a wide variety of physical threats including Zeraora and Aerodactyl thanks to its Ground typing and useful ability. Stamina combined with its solid bulk also gives it an edge over other Ground-types like Hippowdon and Seismitoad, as it checks Fire Lash Cinderace. Shore Up lets it stay healthy throughout a game. Stealth Rock or Spikes provide entry hazard support, assisting wallbreakers like Aerodactyl, Clefable, and Reuniclus. Thousand Waves lets Mudsdale threaten the likes of Heatran, Toxapex, and Tyranitar and its trapping effect prevents the opponent from double switching. Body Press takes advantage of the Defense boosts from Stamina and lets Mudsdale force out Ferrothorn after enough boosts are accumulated. Toxic is an alternative that cripples switch-ins like Rotom-W, Thundurus-T, and Rillaboom. Ferrothorn is able to switch in on Seismitoad and Rotom-W and is able to run another move like Cotton Guard or Spikes because Mudsdale already sets Stealth Rock. Knock Off users like Tornadus-T and Clefable remove items like Heavy-Duty Boots and Leftovers from Pokemon like Tornadus-T and Corviknight, making it even harder to deal with Mudsdale's entry hazards. Clefable also provides solid entry hazard removal in Rapid Spin, keeping Spikes up for other teammates to take advantage of. Teammates that can cover Mudsdales common weaknesses, ranging from strong special attackers like Thundurus-T and Latios to Pokemon with strong super effective coverage like Keldeo and Cloyster, make for good teammates. The likes of Blissey, Heatran, Toxapex, and Ferrothorn all do this job well enough, as well.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 528036, "username": "Sulo"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 517892, "username": "pannu"}, {"user_id": 464398, "username": "LBDC"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}]}
  },
  "Buzzwole": {
    "sets": {
      "No Retreat": {"description": "<p>No Retreat Buzzwole is an incredibly dangerous sweeper on hyper offense, using its solid defensive typing to switch in on Pokemon like Rillaboom and Tyranitar and set up with ease. Close Combat hits incredibly hard at +1, OHKOing Pokemon like Rotom-W, Seismitoad, and Toxapex after minor chip damage. Earthquake allows Buzzwole to beat Toxapex and Galarian Slowking reliably while letting it KO weakened Pokemon without dropping stats, and Ice Punch makes Tornadus-T and Zapdos less safe as checks. Even when boosted, Buzzwole is entirely helpless against Pokemon like Clefable and opposing physically defensive Buzzwole. Therefore, Pokemon like Gengar, Heatran, and Zeraora make for solid partners, with Zeraora in particular overwhelming physical walls for Buzzwole and teammates like Gyarados, Mimikyu, and Scizor. Rotom-W pivots out on walls like Blissey and Ferrothorn, giving Buzzwole more chances to set up freely.</p>"},
      "Choice Band": {
        "description": "<p>Choice Band gives Buzzwole an immediate power boost, allowing it to break through bulky walls like Seismitoad, Corviknight, and Ferrothorn. First Impression provides Buzzwole with valuable revenge killing capabilities, KOing frail, faster threats like Zeraora, Latios, and Aerodactyl. Thunder Punch hits bulky Water- and Flying-types like Tornadus-T, Toxapex, and Gyarados, notably 2HKOing physically defensive Toxapex. U-turn lets Buzzwole pivot out on switch-ins like Clefable and Zapdos, letting a teammate like Gengar, Melmetal, or Heatran take advantage of them. Rotom-W forms a solid VoltTurn core with Buzzwole, with Rotom-W forcing in the likes of Ferrothorn and Blissey to pivot Buzzwole in on them, as well as pressuring physically defensive Toxapex. Future Sight and Doom Desire users like Galarian Slowking and Heatran are solid partners to dissuade Pokemon resistant to Fighting, like Toxapex and Tornadus-T, from switching in on Buzzwole. Future Sight's damage also lets Buzzwole break through Clefable. Spikes is incredibly useful for taking advantage of the switches that Buzzwole forces. Mudsdale and Seismitoad provide Spikes support, with Seismitoad even able to bring Buzzwole in through Flip Turn.</p>"
      },
      "Defensive Pivot": {
        "description": "<p>Defensive Buzzwole can switch in on a bevy of Pokemon, including Mudsdale, Tyranitar, Terrakion, and even opposing Buzzwole. It can then use U-turn to bring in a teammate or a defensive partner, or Toxic to punish switch-ins like Tornadus-T and Seismitoad. Roost allows Buzzwole to stay healthy and check threats long-term. Rocky Helmet with the aforementioned Toxic allows Buzzwole to spread enormous chip damage, wearing down walls to pave the way for Pokemon like Cinderace and Aerodactyl to clean up. This set has no way of beating Tornadus-T and Clefable, so Pokemon that can deal with them like Aerodactyl, Melmetal, and Tyranitar are incredibly solid partners. Specially defensive pivots like Slowking and Assault Vest Toxapex cover Buzzwole's weakness to special attackers like Keldeo and Latios, and they form a pivot core with it, making it easier to bring in wallbreakers like Aerodactyl, Tyranitar, and Gengar. Buzzwole checks Tyranitar and deals with Ferrothorn in return.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 528036, "username": "Sulo"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 324242, "username": "in the hills"}, {"user_id": 407249, "username": "Greybaum"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}]}
  },
  "Zeraora": {
    "sets": {
      "Bulk Up": {
        "description": "<p>With a blisteringly fast Speed tier and strong Electric typing, Zeraora reliably pressures many offensive and defensive threats alike, generating Bulk Up opportunities on Pokemon such as Urshifu-R, Tornadus-T, Slowbro, and Corviknight. Close Combat is Zeraora's primary coverage move and strongest option for hitting Electric-resistant Pokemon, notably hitting Ferrothorn and Excadrill for super effective damage. Knock Off removes Heavy-Duty Boots from offensive Thundurus-T and physically defensive walls like Seismitoad and Buzzwole, giving Zeraora a better chance of breaking through them. Leftovers is a viable option over Heavy-Duty Boots, allowing Zeraora to gain passive recovery while setting up, but Heavy-Duty Boots is typically preferred, as Zeraora is often forced into a hit-and-run role until the opposing team is sufficiently weakened.</p> <p>Zeraora is best paired with Spikes support, with Skarmory in particular walling Grass- and Ground-types like Tangrowth and Mudsdale that give it trouble. Seismitoad is also excellent for this role, forming a VoltTurn core with Zeraora and benefiting from its ability to pressure Defog users like Corviknight and Tornadus-T. Rillaboom and Buzzwole are also very strong pivots that pair well with Zeraora, pressuring Ground-types like Gastrodon and Seismitoad while luring in Flying-types that Zeraora can accumulate boosts against. Lastly, Victini can be a great partner, with dual screens giving Zeraora an easier time using Bulk Up while Zeraora offers a safety net against fast breakers like Aerodactyl.</p>"
      },
      "Offensive Pivot": {
        "description": "<p>Zeraora uses its mixed offenses and uncontested Speed tier to pose as a threatening offensive pivot, forcing out other fast threats like Aerodactyl and Terrakion with its strong physical coverage and utilizing Volt Switch to gain momentum on switch-ins like Rotom-H and Buzzwole. Close Combat and Grass Knot are Zeraora's most reliable coverage moves, doing significant damage to many of the tier's Electric-resistant Pokemon, particularly Ground-types like Excadrill, Seismitoad, and Mudsdale. Its ability to force these opponents out allows Zeraora to use Volt Switch with much more ease. Alternatively, Knock Off can be used to remove longevity increasing items like Heavy-Duty Boots and Leftovers from Pokemon like Thundurus-T and Nidoqueen, respectively, as well as minimizing the residual damage taken from Rocky Helmet users such as Buzzwole and Ferrothorn. Knock Off also synergizes well with Volt Switch, with the moves working in tandem to quickly put foes in range of Zeraora's stronger attacks. Toxic is an alternative option that can hit all of the above targets bar Nidoqueen, but the prevalence of Shore Up among Zeraora's switch-ins makes it difficult to maintain chip damage, resulting in Zeraora being much more reliant on its teammates to make progress.</p> <p>Grass Knot still fails to significantly damage Gastrodon in addition to aforementioned Electric-resistant Pokemon like Rotom-H and Thundurus-T, so wallbreakers like Tyranitar, Kyurem, and Latios are fantastic teammates, with Tyranitar in particular greatly appreciating Zeraora's ability to lure and remove physically defensive Ground-types. Keldeo is another strong example, pressuring the above Pokemon and forming a VoltTurn core with Flip Turn and greatly appreciating Zeraora's ability to pressure Water-types like Slowking and Seismitoad. If using Knock Off, reliable entry hazard setters are vital for weakening switch-ins; Skarmory and Ferrothorn fill this role well and provide an answer to Sand Rush Excadrill, one of the few Pokemon in the tier that can reliably outpace Zeraora, while also switching into Ground-types like the aforementioned Seismitoad. Similarly, Tornadus-T can form an excellent VoltTurn core with Zeraora, weakening shared answers like Rotom-H and maintaining damage on physically defensive walls like Clefable and Seismitoad with Taunt.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 407249, "username": "Greybaum"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 464398, "username": "LBDC"}, {"user_id": 511624, "username": "Fc"}]}, {"name": "Grammar checked by", "members": [{"user_id": 226455, "username": "berry"}, {"user_id": 523866, "username": "UT"}]}]}
  },
  "Cinderace": {
    "sets": {
      "Pivot": {
        "description": "<p>Cinderace is an effective wallbreaker and pivot thanks to its access to Fire Lash and a STAB-boosted U-turn via Libero, chipping away at even bulky walls as their Defense gets dropped. High Jump Kick pressures Heatran and does the most damage to Seismitoad and Tyranitar, which can't hit a Fighting-type Cinderace super effectively. Zen Headbutt can deal with Toxapex after a Fire Lash, while Court Change is very useful as a means of entry hazard control, especially against offense teams. Offensive Water-types like Keldeo and Urshifu-R heavily benefit from Cinderace slowly wearing the aforementioned Pokemon down with U-turn and its coverage, allowing them to wallbreak far more effectively. Cinderace can't effectively break Hippowdon, especially if it holds Rocky Helmet, so a strong entry hazard-stacking core with Ferrothorn and Seismitoad is appreciated. Seismitoad can also serve as a slow pivot with Flip Turn to bring Cinderace in more easily. Faster Pokemon like Zeraora and Weavile, Choice Scarf users like Urshifu-R, and Accelerock users like Terrakion and Tyranitar also help Cinderace against faster but frail targets such as Tornadus-T, Aerodactyl, and Alakazam.</p>"
      },
      "Choice Band": {
        "description": "<p>Choice Band Cinderace is a powerful force in the metagame, applying heavy pressure to defensive cores with its raw power. Sacred Fire threatens switch-ins with a burn, heavily limiting the natural longevity of walls like Seismitoad. U-turn is good long term for pivoting and dealing small bits of damage, while High Jump Kick and Zen Headbutt hit the entire tier for at least neutral damage. Heatran and Toxapex are the primary targets of those moves, respectively, but both are more risky due to their miss chance and the existence of Ghost-types like Runerigus able to punish the use of High Jump Kick. Choice Band makes Cinderace quite prediction reliant, meaning bulky cores made of Pokemon like Toxapex and Hippowdon can give it some trouble. Future Sight users such as Slowbro and Slowking assist Cinderace greatly, as Pokemon that could switch into Sacred Fire like the aforementioned Toxapex and Hippowdon would then be 2HKOed after taking a Future Sight. Strong wallbreakers like Dragon Energy Latios, Nidoking, and Kyurem can also very easily punch holes in the opposing team after a physically defensive wall like Slowbro is forced to take a U-turn from Cinderace. Without Heavy-Duty Boots, Choice Band Cinderace is very susceptible to opposing entry hazards, especially if a wall like Hippowdon switches in to check it and set them, so entry hazard control from the likes of Corviknight and Clefable also helps greatly.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 511624, "username": "Fc"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 324242, "username": "in the hills"}, {"user_id": 464398, "username": "LBDC"}]}, {"name": "Grammar checked by", "members": [{"user_id": 297659, "username": "deetah"}]}]}
  },
  "Corviknight": {
    "sets": {
      "Defog": {
        "description": "<p>Thanks to its high Defense stat and typing, Corviknight serves as a good physical wall and pivot, as well as an entry hazard remover with Defog and good matchups against entry hazard setters like Mudsdale and Clefable. Anchor Shot can be used alongside Pressure to trap opposing Pokemon and quickly drain their PP; it's also vital in pressuring Fairy-types like Clefable and Sylveon. Taunt can also be run alongside Anchor Shot to quicken the removal of Pokemon running setup or status moves. U-turn allows Corviknight to pivot on switch-ins like Rotom-W and Heatran and can bring in strong teammates to keep pressure. It can run a Relaxed nature with minimal Speed to have slower pivots, but this comes at the cost of not being able to outspeed Clefable, Celesteela, and Tyranitar. Alternatively, the combination of Iron Defense and Body Press can be used to leverage Corviknight's high Defense and deal damage to both offensive Pokemon like Tyranitar and Excadrill and opposing walls like Ferrothorn. Defensive Pokemon like Seismitoad appreciate Corviknight's ability to remove entry hazards and keep them from being worn down by chip damage, while offensive Pokemon like Keldeo, Aerodactyl, and Gengar like its ability to switch into physical hits and pivot them safely in. Corviknight's average Special Defense and weakness to common offensive types Electric and Fire means that it appreciates teammates that are able to absorb hits from common threats like Heatran and Zeraora, such as Thundurus-T, Toxapex, Mudsdale, and Seismitoad.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 439018, "username": "Theia"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 517892, "username": "pannu"}, {"user_id": 324242, "username": "in the hills"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}]}
  },
  "Dracozolt": {
    "sets": {
      "Sand Rush Sweeper": {
        "description": "<p>Due to its high Attack and Speed-doubling ability Sand Rush, Dracozolt is a strong wallbreaker on sand teams. Already able to outspeed nearly the entire metagame in sand, including Pokemon like Urshifu-R and Salamence, Dracozolt can outrun nearly any Pokemon with Dragon Dance while boosting its Attack. Dracozolt leverages this massive Speed to double the Base Power of Bolt Beak and tear through walls like Toxapex and Clefable. Dragon Darts hits Dragon-types like Latios and Salamence super effectively, and it hits Ground-types like Seismitoad. Fire Fang allows Dracozolt to threaten Steel-types like Ferrothorn and Excadrill. Substitute can be run instead of Fire Fang to protect Dracozolt from revenge killers and status, making it harder to switch around. If Substitute is run, Leftovers should replace Life Orb to allow Dracozolt more uses of Substitute. Dracozolt is appreciated by slower defensive teammates like Seismitoad and Skarmory for outspeeding and KOing opposing threats. Because Dracozolt relies on sand to perform effectively, a Sand Stream Pokemon like Tyranitar and Hippowdon is necessary. Spikes setters like Ferrothorn and Knock Off users like Tyranitar and Tornadus-T can wear down Ground-types, with Knock Off removing Heavy-Duty Boots to rack up Spikes damage, making them easier for Dracozolt to break through. Pokemon like Rillaboom and Rotom-Wash that can switch into Ground-type moves and offensively threaten Ground-types are also valuable, especially since Dracozolt's average defensive stats make it struggle to take hits. Dracozolt is also vulnerable to getting worn down by entry hazards on top of Life Orb recoil, so it appreciates entry hazard removers like Corviknight and Clefable. Excadrill is also a notably good partner for Dracozolt, as they both enjoy sand with Sand Rush and Excadrill can weaken opposing Ground-types for Dracozolt to finish off and vice versa.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 439018, "username": "Theia"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 517892, "username": "pannu"}, {"user_id": 511624, "username": "Fc"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}]}
  },
  "Urshifu-Rapid-Strike": {
    "sets": {
      "Protective Pads": {
        "description": "<p>With high Attack and Speed, Urshifu-R serves as a powerful offensive threat with STAB moves like Surging Strikes, which pressures walls like Hippowdon, Buzzwole, and Mudsdale while ignoring Defense boosts. Close Combat lets Urshifu-R threaten Steel-types like Ferrothorn and Melmetal, as well as broadly damaging Water-resistant foes like Hydreigon, Rotom-W, and Seismitoad. U-turn allows Urshifu-R to escape defensive Pokemon it struggles to break through, like Toxapex, while maintaining momentum. No Retreat can be used instead to turn it into a sweeper. However, since Urshifu-R will be unable to switch out after using No Retreat, it is wise to make sure defensive checks like Haze Toxapex have been removed beforehand. Urshifu-R has several options for its last moveslot: Taunt can stop opposing setup sweepers like Reuniclus or prevent Urshifu-R from taking a status move, Aqua Jet allows Urshifu-R to revenge kill weakened foes, notably Aerodactyl, and Thunder Punch gives coverage against Pokemon like Gyarados and Slowking that otherwise don't fear it. Using Protective Pads keeps Urshifu-R safe from chip damage from Iron Barbs and Rocky Helmet users, which is especially helpful against Ferrothorn, which could otherwise switch into Surging Strikes and chip Urshifu-R with every hit. Urshifu-R supports teammates like Thundurus-T and Rotom-H that struggle against Tyranitar and Ground-types. It benefits from teammates like Heatran and Rillaboom that can pressure opposing Grass- and Electric-types. Entry hazard setters like Ferrothorn and Seismitoad can help weaken checks such as Buzzwole. Due to its lack of recovery, Urshifu-R also benefits from entry hazard removers like Corviknight and Tornadus-T to keep it from getting worn down when pivoting. Urshifu-R can also be used on rain teams, where teammates like Pelipper and Kingdra benefit greatly from its ability to remove Ferrothorn.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 439018, "username": "Theia"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 324242, "username": "in the hills"}, {"user_id": 464398, "username": "LBDC"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}]}
  }
}