{
  "Cresselia": {
    "comments": "<h1>Other Options</h1> <p>Cresselia can hold Colbur Berry or Tanga Berry to reduce damage taken from Pokemon such as Incineroar, Pheromosa, and Genesect, but Sitrus Berry's instant healing is better in most matchups. Mental Herb can be used to bypass Pokemon that try to Taunt or Encore Cresselia such as Sableye and Victini.</p> <h1>Checks and Counters</h1> <p><strong>Steel-types: Cresselia is unable to damage Steel-types. Genesect can 2HKO it, and Celesteela can easily stall it with Leech Seed. Metagross and Heatran do much more damage to Cresselia then it can do back. Metagross is also unaffected by Cresselia's Calm Mind.</p> <p><strong>Dark-types: Incineroar and Tyranitar take very little or no damage from Cresselia's attacks and can threaten back with powerful Dark-type moves.</p> <p><strong>Taunt and Encore: Cresselia can be Taunted by Victini and Galarian Zapdos, preventing Calm Mind or Moonlight, while Sableye can use Encore against Cresselia. Both scenarios limit the longevity of Cresselia and make it considerably less useful in a battle. Mental Herb can help patch this weakness, though.</p>",
    "sets": [
      {
        "name": "Calm Mind",
        "description": "<p>Cresselia is a great defensive sweeper thanks to its tremendous bulk and solid defensive typing, which allow it to easily set up Calm Mind. Psyshock lets Cresselia threaten Pheromosa, Nihilego, Naganadel, and Galarian Zapdos. Moonlight provides Cresselia with recovery, allowing it to outlast foes such as Indeedee, Volcanion, and Tapu Lele. Ice Beam hits Zygarde, Landorus, Rillaboom, and Landorus-T. Icy Wind is a weaker alternative that provides speed control. Trick Room allows Cresselia and its teammates to move before faster foes. Helping Hand allows damaging partners like Diancie and Volcanion to OHKO Galarian Moltres and Assault Vest Rillaboom. Protect is an effective answer to Fake Out, allowing Cresselia to safely set Trick Room on turn 2. The Special Defense EVs ensure Cresselia survives a +1 Bug Buzz from Life Orb Genesect, while the Defense investment allows it to deal with physical attackers like Rillaboom better. Using a Calm nature is optimal for sets without Trick Room, while sets opting for Trick Room should use a Sassy nature to ensure Cresselia is as slow as possible.</p> <p>Cresselia is found on slow, bulky teams that appreciate Trick Room's or Icy Wind's speed control and Cresselia's ability to outlast foes. Fire-types such as Incineroar, Heatran, and Volcanion are great partners, since they deal with the Steel-types that Cresselia struggles against such as Genesect and Metagross. Volcanion in particular also defeats Incineroar. In return, Cresselia can deal with Landorus, Landorus-T, and Zygarde with Ice Beam or Icy Wind. Rock-types such as Diancie and Rhyperior also make fantastic partners, as they can defeat Incineroar and Galarian Moltres. In return, Cresselia can threaten Zygarde, Landorus, and Landorus-T with Ice Beam.</p>"
      }
    ],
    "credits": {"writtenBy": [{"username": "torterraxx", "user_id": 486970}], "teams": [{"name": "Quality checked by", "members": [{"username": "Reece", "user_id": 540482}, {"username": "Itchy", "user_id": 518399}]}, {"name": "Grammar checked by", "members": [{"username": "Rabia", "user_id": 336073}, {"username": "Itchy", "user_id": 518399}]}]}
  },
  "Blastoise": {"sets": [{"name": "Follow Me Support"}]},
  "Ninetales-Alola": {"sets": [{"name": "Offensive Hail Setter"}]},
  "Zapdos-Galar": {"sets": [{"name": "Fast Attacker"}]},
  "Moltres-Galar": {"sets": [{"name": "Bulky Offensive"}]},
  "Mew": {"sets": [{"name": "Defensive Set Up"}]},
  "Politoed": {"sets": [{"name": "Rain Setter"}]},
  "Kingdra": {"sets": [{"name": "Rain Offensive"}]},
  "Porygon2": {"sets": [{"name": "Defensive Trick Room Setter"}]},
  "Tyranitar": {
    "comments": "<h1>Other Options</h1> <p>Sand Stream is a somewhat viable ability for Tyranitar due to the increased Special Defense that sand gives it. In addition, sand can enable teammates such as Sand Rush Dracovish and Dracozolt by doubling their Speed, which is helpful in conjunction with their signature moves Fishious Rend and Bolt Beak. However, losing the ability to support teammates with Unnerve is not ideal. Heavy Slam can be used to OHKO Diancie, which many of Tyranitar's common teammates such as Pheromosa, Talonflame, and Togekiss struggle with.</p> <h1>Checks and Counters</h1> <p><strong>Fighting-types: Tyranitar's 4x weakness to Fighting makes Fighting-types a definite check to Tyranitar. Pokemon such as Pheromosa and Galarian Zapdos are hard for it to handle without teammate support.</p> <p><strong>Ground-types: Pokemon such as Zygarde and Landorus are able to hit Tyranitar super effectively with moves such as Thousand Arrows and Earth Power.</p> <p><strong>Rillaboom: Rillaboom is an especially difficult Pokemon for Tyranitar to deal with due to its Grassy Glide, which allows Rillaboom to OHKO Tyranitar first even if Tailwind is active.</p>",
    "sets": [
      {
        "name": "Fast Unnerve",
        "description": "<p>In 2v2 Doubles, Tyranitar primarily plays the role of a Tailwind beneficiary. Its convenient Speed tier, high Attack stat, and good coverage moves allow it to OHKO many prevalent Pokemon such as Pheromosa, Genesect, Naganadel, and Kyurem-B. Its typing allows it to deal with metagame staples such as Victini and Incineroar defensively. Secondarily, it provides utility by targeting the main redirectors in Indeedee-F and Togekiss, as well as negating foes' Berries with Unnerve—this is very important in 2v2 Doubles due to many Pokemon like Zygarde, Kyurem-B, Indeedee-F, and Togekiss using Berries. Crunch allows Tyranitar to OHKO the incredibly bulky Indeedee-F, while Stone Edge OHKOes Togekiss. Fire Punch allows Tyranitar to reliably OHKO Pheromosa and Genesect. Rock Slide also OHKOes Pheromosa while ignoring redirection, but in turn does less to Genesect. 252 Speed EVs allow Tyranitar to outspeed Pheromosa in Tailwind.</p> <p>Tyranitar's Unnerve allows Pheromosa to OHKO Chople Berry Kyurem-B and Tanga Berry Indeedee-F. Genesect is similarly able to OHKO Tanga Berry Indeedee with the help of Unnerve. Tyranitar's ability to OHKO two of the metagame's best Follow Me users helps teammates that struggle against redirection such as Dracovish and Naganadel. Tyranitar benefits from Talonflame's Gale Wings Tailwind, or from other fast Tailwind setters such as Naganadel, since Tyranitar outspeeds Pheromosa, Genesect, Kyurem-B, Naganadel, and Cinderace under Tailwind and OHKOes them all. Tyranitar pairs especially well with Talonflame, which can OHKO threats to Tyranitar such as Rillaboom and Amoonguss—a redirection user that Tyranitar cannot OHKO. Tyranitar also pairs well with redirection, since it has many common weaknesses. For this reason, Indeedee-F, Togekiss, and Amoonguss are all good partners.</p>"
      }
    ],
    "credits": {"writtenBy": [{"username": "Morgan", "user_id": 457210}, {"username": "Itchy", "user_id": 518399}], "teams": [{"name": "Quality checked by", "members": [{"username": "Reece", "user_id": 540482}, {"username": "Mubs", "user_id": 442711}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Sableye": {"sets": [{"name": "Prankster Support"}]},
  "Metagross": {"sets": [{"name": "Bulky Offensive"}]},
  "Weavile": {
    "comments": "<h1>Other Options</h1> <p>Ice Shard can be used to hit foes who outspeed Weavile, as well as KO Pheromosa with Fake Out into Ice Shard. Poison Jab can be used to have an easier time against Fairy-types such as Tapu Fini and non-Choice Scarf Tapu Lele, but gives up a chance to hit Steel-type Pokemon. Low Kick is another coverage option that allows Weavile to hit Dark-, Rock-, and Steel-types such as Heatran, and Tyranitar.</p> <h1>Checks and Counters</h1> <p><strong>Faster Foes and Speed control: Weavile struggles to function well when outsped, so it can have a hard time dealing with naturally fast Pokemon like Zeraora, Choice Scarf users such as Genesect, priority Tailwind from Talonflame, Icy Wind from Pheromosa, and Electroweb from Regieleki.</p> <p><strong>Intimidate: Pokemon with Intimidate make it much harder for Weavile to deal damage. Most commonly seen from Pokemon like Incineroar and Landorus-T, it can causes Weavile to miss out on some much needed KOs.</p> <p><strong>Fairy-types: Weavile heavily struggles to break through Fairy-types like Tapu Fini and Diancie, who can easily tank Weavile's STAB moves and OHKO back.</p> <p><strong>Steel-types: Weavile is walled by Steel-types such as Heatran, Genesect, and Ferrothorn, needing to run coverage in Low Kick or rely on its allies to make any progress against them.</p> <p><strong>Fire-types: Weavile fails to OHKO Fire-types like Cinderace and Incineroar, and is easily OHKOed by their Fire-type STAB moves.</p> <p><strong>Fighting-types: Fast Fighting-types like Pheromosa and Blaziken after a Speed Boost can outspeed and OHKO Weavile easily.</p>",
    "sets": [
      {
        "name": "Offensive Life Orb",
        "description": "<p>Weavile is a solid Pokemon in 2v2, thanks to its high Attack and Speed, and a great offensive typing. Weavile has the second-fastest Fake Out behind Zeraora, allowing it to almost always outspeed opposing Fake Out users. Icicle Crash is Weavile's main source of damage, picking up OHKOs on Galarian Moltres, Naganadel, and Regidrago. Triple Axel is a stronger STAB move, bypassing the effects of Yache Berry to pick up the OHKO on Zygarde, but is less consistent due to its lower accuracy. Knock Off is another strong STAB attack, removing items on Pokemon that rely on them like Porygon2 and Cresselia, as well as threatening OHKOs on Mew, Metagross, Victini, and Indeedee-F. Ice Shard allows it to pick up easy KOs on Zygarde and Landorus, as well as clean up anything that may have been weakened. 24 HP EVs minimizes Life Orb recoil, and 232 Speed with a Jolly nature outspeeds Naganadel.</p> <p>Weavile works very well on more offensive teams, as its high Speed and Attack pair well with much of the metagame. Due to Fake Out, Weavile helps slower, offensive allies such as Metagross get an attack off, clearing out threats to Weavile such as Diancie and Tyranitar, and in return Weavile can also remove Ground-type Pokemon that would threaten to KO Metagross. Weavile can also be used well with redirectors like Blastoise and Togekiss, allowing it to easily hit Pokemon that will OHKO your redirector, such as Rillaboom and Metagross. Without redirection, Weavile struggles to handle Pokemon like Zeraora and Choice Scarf Tapu Lele, as they will always outspeed and KO it. Other Pokemon that work well as teammates are Water-types such as Blastoise and Tapu Fini that help deal with opposing Fire-types, as well as Fairy-type Pokemon like Tapu Fini and Togekiss to deal with Fighting-type Pokemon. Another solid teammate is Galarian Zapdos, which is able to clear out Rock- and Steel-types, as well as dissuade Intimidate users such as Incineroar. Due to Weavile's poor bulk and defensive typing, it is incredibly weak to Pokemon that outspeed it. Pokemon like Regieleki, Zeraora, and Choice Scarf Tapu Lele make it extremely difficult for Weavile to get any attacks off, so Weavile can also benefit from immediate Tailwind support from Talonflame, which can also help deal with Fire-, Steel-, and Fighting-type Pokemon, especially hitting Pheromosa with a priority Brave Bird thanks to Gale Wings.</p>"
      }
    ],
    "credits": {"writtenBy": [{"username": "jeffdaboss", "user_id": 528912}], "teams": [{"name": "Quality checked by", "members": [{"username": "Reece", "user_id": 540482}, {"username": "Itchy", "user_id": 518399}]}, {"name": "Grammar checked by", "members": [{"username": "UT", "user_id": 523866}]}]}
  },
  "Togekiss": {"sets": [{"name": "Defensive Follow Me"}]},
  "Heatran": {"sets": [{"name": "Tailwind Offensive"}]},
  "Victini": {
    "comments": "<h1>Other Options</h1> <p>Victini sometimes opts for Blue Flare over V-create. Blue Flare has less Base Power, but it comes without V-create's stat drops. Blue Flare is also not weakened by Intimidate, and it allows Victini to go all-in with Special Attack EVs, hitting even harder with Expanding Force. Focus Blast for more damage against Incineroar is occasionally useful.</p> <p>Victini may also carry Choice Scarf, with Trick to neutralize passive Pokemon and Glaciate for speed control.</p> <h1>Checks and Counters</h1> <p><strong>Strong Attacks: Victini cannot OHKO Tapu Fini, Volcanion, Zygarde, Landorus, Regidrago, Dracovish, Nihilego, or Tyranitar. They all do much more in return.</p> <p><strong>Intimidate: Incineroar and Landorus-T reduce Victini's Attack, significantly reducing the power of V-create. They also both threaten it with their Ground- and Dark-type STAB attacks. Incineroar walls all of Victini's most common attacks, and Choice Scarf Landorus-T outspeeds it.</p> <p><strong>Follow Me: Blastoise and Togekiss are not OHKOed by V-create or Bolt Strike, so they can siphon away Victini's attack and enable an offensive partner.</p> <p><strong>Spread Moves: Victini is commonly paired with Follow Me users, such as Indeedee-F and Blastoise, to get its strong attacks off. Moves like Electroweb from Regieleki and Zeraora, Landorus-T's Earthquake, and Regidrago's Dragon Energy all make these pairings less effective.</p>",
    "sets": [
      {
        "name": "Life Orb",
        "description": "<p>Victini is central to Psychic Terrain teams, and it sees plenty of use on standard offense as well. Its all-around good stats and potent typing allow it to thrive against common Pokemon such as Genesect, Rillaboom, and Celesteela. Expanding Force deals boosted spread damage in Psychic Terrain, and it still does decent damage without the Terrain boost. Encore allows Victini to lock foes out of doing damage, such as Tailwind Talonflame, Fake Out Incineroar, and Iron Defense Mew, while Bolt Strike deals extra damage to Water-types such as Volcanion and Tapu Fini. Maximum Speed is important for outspeeding Genesect, Galarian Zapdos, and Kyurem-B.</p> <p>Victini threatens common Steel-types like Genesect and Celesteela for Psychic Terrain teams; it is practically required for the archetype. Indeedee-F complements Victini with Helping Hand, Follow Me, and automatic Psychic Terrain, allowing it to get multiple hits off and fire off boosted Expanding Forces. However, Victini is not limited to Psychic Terrain. Fast Pokemon like Zeraora and Regieleki are also great partners for Victini, since they remove Blastoise, Tapu Fini, and Volcanion and supplement Victini's average Speed with Electroweb. Assault Vest Genesect deals with Nihilego, Zygarde, Naganadel, and Regieleki, all of which threaten Victini due to their higher Speed stats and offensive capabilities. Kyurem-B beats Zygarde and benefits from Victini's good matchup versus many Steel-types. Victini also works well with Blastoise because it shields Victini from powerful attacks such as Tapu Fini's Hydro Pump and Regidrago's Draco Meteor with Follow Me. Rillaboom KOes Water- and Rock-types such as Blastoise and Tyranitar, and it provides Fake Out support, allowing Victini to get massive damage off with a correct prediction.</p>"
      }
    ],
    "credits": {"writtenBy": [{"username": "Itchy", "user_id": 518399}], "teams": [{"name": "Quality checked by", "members": [{"username": "Reece", "user_id": 540482}, {"username": "hayedenn", "user_id": 484270}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Ferrothorn": {"sets": [{"name": "Defensive Set Up"}]},
  "Landorus-Therian": {"sets": [{"name": "Choice Scarf"}]},
  "Kyurem-Black": {
    "comments": "<h1>Other Options</h1> <p>Kyurem-B can use a plethora of physical sets. Dragon Dance with Life Orb maximizes its offensive output and pairs well with redirection from Togekiss, Blastoise, or Indeedee-F. Instead of Life Orb, Babiri Berry and Haban Berry can be used to beat Dragon- and Steel-type threats such as Metagross and Naganadel. Power Herb is an option for a one turn Freeze Shock. On the offensive set, Haban Berry can be used to stave off Naganadel and Latios, and Life Orb is also an option. A Choice Scarf variant of Kyurem-B can lure in and surprise Naganadel, Pheromosa, and Zygarde; however, this set is fairly inconsistent, as it relies heavily on teammates removing Steel- and Water-types.</p> <h1>Checks and Counters</h1> <p><strong>Faster Threats and Fake Out: Fake Out from Pokemon such as Mew, Incineroar, and Rillaboom hinders Kyurem-B's chance of survival, especially Assault Vest Kyurem-B, which lacks Protect. Faster threats like Zeraora, Pheromosa, and Galarian Zapdos can each threaten Kyurem-B, while Zeraora can also use Fake Out.</p> <p><strong>Specially Defensive Threats: Specially bulky Pokemon such as Diancie, Cresselia, Tyranitar, and Porygon2 pose a large threat to Kyurem-B. Diancie and Tyranitar check it both defensively and offensively. Porygon2 and Diancie can set up Trick Room without taking much damage, leaving Kyurem-B vulnerable. Assault Vest Zeraora takes all of Kyurem-B's attacks and pressures it with Close Combat, Play Rough, or Fake Out. Choice Scarf Genesect 2HKOes Kyurem-B with Iron Head and takes very little from it.</p>",
    "sets": [
      {
        "name": "Offensive Chople Berry",
        "description": "<p>Kyurem-B's exceptional bulk and Chople Berry allow it to survive Fighting-type attacks from Life Orb Galarian Zapdos and Pheromosa to OHKO back. Freeze-Dry removes metagame staples such as Rillaboom, Dracovish, Tapu Fini, and Galarian Zapdos. Earth Power provides great coverage with Freeze-Dry, nailing Ice-resistant foes such as Heatran, Volcanion, and Metagross. Draco Meteor pressures Pokemon that shrug off its other moves such as Volcarona and opposing Kyurem-B, and it more reliably OHKOes Pheromosa. Protect ensures Kyurem-B's safety against Fake Out pressure while punishing foes that concentrate on KOing it.</p> <p>For partners, Togekiss provides Follow Me and Tailwind support and can stave off Fairy-types, such as Tapu Fini and Tapu Lele. In return, Kyurem-B checks Regieleki and staves off Volcanion. Regieleki blasts through bulky Water-types that Kyurem-B cannot KO, such as Blastoise, while slowing down Pheromosa and Naganadel with Electroweb. Kyurem-B breaks through Ground- and Grass-types like Zygarde and Rillaboom that can take Regieleki's STAB Electric-type attacks. Cinderace and Pheromosa both break through Steel-types that Kyurem-B hates, such as Metagross and Heatran. Cinderace also pressures Togekiss, which Kyurem-B greatly appreciates, and Kyurem-B's Freeze-Dry ameliorates Cinderace's weakness to Ground-types.</p>"
      },
      {
        "name": "Assault Vest",
        "description": "<p>Assault Vest Kyurem-B can easily take on threats such as Victini, Regieleki, and Galarian Moltres. It is seen on faster-paced teams to break through offensive teams by surviving long enough to OHKO their threats. Freeze-Dry 2HKOes physically defensive Tapu Fini and OHKOes Dracovish. Earth Power can OHKO offensive Heatran and 2HKOes Volcanion and non-Assault Vest Metagross. Icy Wind combined with 32 Speed EVs allows Kyurem-B to outrun Kartana and Latios. Draco Meteor provides great, strong coverage against Pokemon such as Volcarona and opposing Kyurem-B. 88 Special Defense EVs with the Assault Vest allow Kyurem-B to survive two full-health Eruptions from Charcoal Heatran, as well as comfortably surviving Life Orb Draco Meteor from Naganadel. 52 Defense EVs prevent OHKOs from Smart Strike from Kartana, Rock Slide from Tyranitar, and three hit Dragon Dance-boosted Scale Shot from Zygarde.</p> <p>Kyurem-B's greatest weakness is Fairy-type threats, such as Tapu Fini and Tapu Lele, which Regieleki or Metagross can offensively check. Rillaboom removes Psychic Terrain from Tapu Lele and provides Fake Out support for Kyurem-B. Kyurem-B is OHKOed by Galarian Zapdos, Pheromosa, and Cinderace, so Choice Scarf Tapu Lele is a great partner to outspeed and OHKO them. Also, Tapu Lele's Psychic Surge prevents Fake Out from Incineroar. Regieleki is a great option to outspeed common threats, as Kyurem-B can OHKO Ground- and Grass-types like Rillaboom, Zygarde, and Landorus-T that resist Electric, while Regieleki removes faster threats that pressure Kyurem-B such as Pheromosa and Galarian Zapdos.</p>"
      }
    ],
    "credits": {"writtenBy": [{"username": "Reece", "user_id": 540482}], "teams": [{"name": "Quality checked by", "members": [{"username": "Morgan", "user_id": 457210}, {"username": "Itchy", "user_id": 518399}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}, {"username": "UT", "user_id": 523866}]}]}
  },
  "Genesect": {
    "comments": "<h1>Other Options</h1> <p>Thunderbolt can be used to threaten Genesect's Water-type checks like Tapu Fini and Volcanion; however, it rarely has a moveslot to spare. Flamethrower can chip down opposing Steel-types such as Genesect, Metagross, Celesteela, and Ferrothorn, though it is very matchup specific.</p> <h1>Checks and Counters</h1> <p><strong>Fire-types: Incineroar, Heatran, and Volcanion all take little from Genesect's attacks and can OHKO it with ease.</p> <p><strong>Faster Threats: Genesect's Speed stat means that Cinderace, Regieleki, and Naganadel all outrun it and can threaten it.</p> <p><strong>Fake Out: Assault Vest Genesect is particularly weak to Fake Out from Pokemon like Mew, Rillaboom, and Incineroar due to its lack of Protect.</p>",
    "sets": [
      {
        "name": "Mixed Attacker",
        "description": "<p>Genesect is a premier threat due to its stellar offensive typing, which can threaten a large portion of the metagame. Bug Buzz can OHKO Rillaboom and non-Tanga Berry Indeedee-F, as well as dealing great damage against Tyranitar. Iron Head blasts through Nihilego and Diancie while dealing significant damage to Kyurem-B. Ice Beam can OHKO Zygarde, Landorus-T, and other Pokemon that can handle Genesect's STAB attack. 16 HP EVs with 128 Defense EVs allow Genesect to survive Pheromosa's Close Combat. 32 Attack EVs enable the 2HKO on physically defensive Togekiss with Iron Head.</p> <p>Genesect is usually seen on faster-paced teams that can offer speed control for is middling Speed stat. Zapdos and Mew each offer excellent Tailwind support, and Zapdos can threaten bulky Water-types Genesect dislikes such as Tapu Fini and Blastoise. Regieleki can eliminate Water-type Pokemon for Genesect, like Tapu Fini and Volcanion, while offering speed control with Electroweb so Genesect can beat Naganadel and Nihilego. Genesect can then threaten Grass- and Ground-types such as Rillaboom, Zygarde, and Landorus-T that Regieleki struggles with. Blastoise also gives phenomenal support with Follow Me and Fake Out, easily beating the Fire-types that hinder Genesect as well. In return, Genesect can OHKO Rillaboom.</p>"
      },
      {
        "name": "Assault Vest",
        "description": "<p>Genesect's great bulk with Assault Vest can surprise unsuspecting foes, such as Naganadel without Fire Blast, Nihilego, and Pheromosa. Iron Head is Genesect's main STAB attack and threatens Kyurem-B, Tapu Lele, and Nihilego which regular Genesect can not handle. Ice Beam is great coverage for Zygarde and Landorus while wearing down Togekiss and Zapdos with greater success than Life Orb. Bug Buzz enables Genesect to threaten Psychic-types such as non-Tanga Berry Indeedee-F and Mew. In addition, it checks the ever-present Rillaboom while chipping Metagross and Ferrothorn. 68 Speed EVs allow Genesect to outrun Naganadel after using Flame Charge and OHKO it with Ice Beam afterwards.</p> <p>Genesect is found alongside speed control teammates such as Regieleki and Zeraora, which utilize Electroweb; they also threaten Water- and Steel-type Pokemon like Tapu Fini, Volcanion, and Celesteela. In return, Genesect can OHKO threats like Naganadel, Nihilego, and Landorus-T. Additionally, Tailwind from Mew and Togekiss aids Genesect's mediocre Speed stat so it can threaten Zeraora and Nihilego. Water-types such as Blastoise, Tapu Fini, and Volcanion can check Fire-types like Incineroar and Victini, while Genesect can OHKO Rillaboom and Regieleki and threaten Kyurem-B.</p>"
      }
    ],
    "credits": {"writtenBy": [{"username": "Reece", "user_id": 540482}], "teams": [{"name": "Quality checked by", "members": [{"username": "Itchy", "user_id": 518399}, {"username": "PA", "user_id": 430787}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Talonflame": {
    "comments": "<h1>Checks and Counters</h1> <p><strong>Super Effective Attacks</strong>: Rock-types such as Diancie, Nihilego, and Tyranitar OHKO Talonflame with Rock-type moves and resist both of its attacks. Zeraora and Regieleki OHKO, resist Brave Bird, and naturally outspeed Talonflame, so they don't have to worry about Flare Blitz pre-Tailwind. Water-types like Tapu Fini and Kingdra + Politoed are particularly problematic for Talonflame, since many common partners do not cover them.</p> <p><strong>Opposing Speed Control: Speed-boosting weather abilities such as Kingdra's Swift Swim can match the Speed boost Tailwind provides. Icy Wind and Electroweb can slow down both Talonflame and its teammate, reducing Tailwind's boost. Trick Room punishes the use of Tailwind, allowing the opponent's Pokemon to almost always move first.</p> <p><strong>Fake Out</strong>: Fake Out pressures Talonflame to use Protect turn 1, so Zeraora and Incineroar exert pressure on Talonflame teams immediately. Talonflame does not want to lose Gale Wings priority, and its partner can be left vulnerable if it does not also use Protect, which limits defensive options on turn 2.</p>",
    "sets": [
      {
        "name": "Tailwind Support",
        "description": "<p>Talonflame is one of the best speed control options because of Gale Wings + Tailwind and its excellent Speed tier. Tailwind provides an instant Speed boost to partners such as Regidrago, Cinderace, Genesect, and both Landorus formes, allowing them to outpace foes that would otherwise threaten them or Talonflame such as Naganadel, Zeraora, and Regieleki. Brave Bird is a powerful STAB move used to damage foes such as Galarian Zapdos, Cinderace, Victini, Naganadel, and Pheromosa. Gale Wings provides Brave Bird with +1 priority at full health, allowing Talonflame to move before faster foes such as Pheromosa and Choice Scarf Landorus-T. Flare Blitz defeats Steel-types such as Metagross and Genesect and Ice-types such as Alolan Ninetales. Protect is an effective answer to Fake Out, allowing Talonflame to keep Gale Wings intact.</p> <p>Talonflame works very well on teams that appreciate Tailwind's instant Speed boost. Steel-types such as Genesect and Celesteela make excellent partners, as they're able to defeat Fairy- and Rock-types that Talonflame struggles with such as Tapu Fini, Diancie, and Nihilego. Genesect in particular loves Tailwind, since this allows it to get the jump on checks such as Landorus and Choice Scarf Landorus-T. Regidrago also appreciates Tailwind, which enables it to fire off devastating Dragon Energies. Talonflame can defeat most of the Steel-types that resist Regidrago's attacks such as Genesect, Celesteela, and Metagross. Both Landorus formes make excellent teammates, as they're able to defeat Rock- and Electric-types for Talonflame such as Nihilego and Zeraora, and both benefit from Tailwind greatly. Rillaboom shuts down Water-types like Kingdra, Politoed, and Tapu Fini, which otherwise tear through Talonflame teams.</p>"
      }
    ],
    "credits": {"writtenBy": [{"username": "torterraxx", "user_id": 486970}, {"username": "Itchy", "user_id": 518399}], "teams": [{"name": "Quality checked by", "members": [{"username": "Lumii", "user_id": 493772}, {"username": "Itchy", "user_id": 518399}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Zygarde": {"sets": [{"name": "Haban Dragon Dance"}, {"name": "Choice Scarf"}]},
  "Zygarde-Complete": {},
  "Diancie": {"sets": [{"name": "Offensive Trick Room Setter"}]},
  "Volcanion": {
    "comments": "<h1>Other Options</h1> <p>An alternate EV spread of 112 HP / 252 SpA / 144 Spe with a Modest nature can be used to outrun Zeraora in Tailwind, with the rest of EVs placed into HP to maintain maximum bulk. Volcanion can also have a Quiet Nature and 0 Speed IVs to be as fast as possible in Trick Room. Shuca Berry can be used to dampen Earth Power from Landorus or Thousand Arrows from Zygarde, but is usually not as useful as Wacan Berry.</p> <h1>Checks and Counters</h1> <p><strong>Specially Defensive Walls: Volcanion struggles to make progress against Porygon2 and Calm Mind Tapu Fini. Porygon2 can also Trace Water Absorb and set up Trick Room for a partner. Assault Vest Kyurem-B takes little damage from Heat Wave and can 2HKO Volcanion with either Bolt Strike or Earth Power. Cresselia can sponge Volcanion's hits and set up with Calm Mind or Trick Room and whittle it down.</p> <p><strong>Faster Pokemon: Volcanion's average Speed means that it is threatened by a plethora of offensive threats such as both Landorus formes, Zygarde, Nihilego, and Zeraora. However, they can still be outspeed and KOed with proper speed control.</p> <p><strong>Dragon-types: Naganadel, Latios, Regidrago, and Kyurem-B each resist Volcanion's STAB attacks; they each hit it hard in return with their respective STAB moves.</p>",
    "sets": [
      {
        "name": "Bulky Attacker",
        "description": "<p>Volcanion has earned its niche through its dual STAB combination naturally staving off prominent threats Genesect, Rillaboom, and Victini. Steam Eruption is Volcanion's most consistent STAB move, hitting metagame staples like Incineroar and Landorus super effectively, as well as threatening other physical attackers like Dracovish and Galarian Zapdos with a burn. Heat Wave allows Volcanion to hit Pokemon that resist Steam Eruption such as Ferrothron and Kyurem-B while also KOing common threats such as Genesect and non-Assault Vest Rillaboom. Earth Power can be used to OHKO Naganadel and hit Dracovish and opposing Volcanion harder. Overheat ensures maximum damage output against Pokemon such as Kyurem-B and Wide Guard Celesteela in exchange for being a single target move. Sludge Bomb hits Tapu Fini, Tapu Lele, and Togekiss super effectively, while the poison chance helps break Dracovish. Sitrus Berry maintains Volcanion's longevity., while Wacan Berry is an option to surprise unsuspecting Regieleki and Zeraora and OHKO them. Life Orb can be used if the aforementioned checks are covered to maximize damage.</p> <p>Volcanion's great typing and bulk means that it has few consistent checks outside of Regieleki and Kyurem-B. To patch up these weaknesses, Volcanion is usually paired with Tsareena, Diancie, or Naganadel to eliminate Electric- and Dragon-types. Fake Out pressure from Incineroar or Rillaboom helps cover for Volcanion's low Speed. Zygarde is also an excellent teammate, as it checks Regieleki, Zeraora, and Tyranitar for Volcanion, which in return beats bulky Grass- and Ground-types that hinder Zygarde. Metagross also checks those same Pokemon, while threatening Dragon-types Latios, Regidrago, and Kyurem-B. Tailwind support from Talonflame can beat Nihilego and Landorus which are OHKOed by Steam Eruption. Redirection from Amoonguss enables Volcanion to beat Electric-types and Thunderbolt Genesect.</p>"
      }
    ],
    "credits": {"writtenBy": [{"username": "Reece", "user_id": 540482}], "teams": [{"name": "Quality checked by", "members": [{"username": "Morgan", "user_id": 457210}, {"username": "Itchy", "user_id": 518399}]}, {"name": "Grammar checked by", "members": [{"username": "UT", "user_id": 523866}]}]}
  },
  "Incineroar": {
    "comments": "<h1>Other Options</h1> <p>Resistance Berries such as Chople Berry and Shuca Berry may be occasionally helpful for Incineroar, but there is not usually a reason to use them over Assault Vest.</p> <h1>Checks and Counters</h1> <p><strong>Strong Super Effective Attacks</strong>: Many strong attackers with super effective STAB moves, such as Pheromosa, Nihilego, and Volcanion, threaten massive damage onto Incineroar, even through Intimidate and Assault Vest. -1 Cinderace can still OHKO Incineroar.</p> <p><strong>Galarian Zapdos: Galarian Zapdos's Defiant means Incineroar's Intimidate gives it a +1 Attack boost, deterring Incineroar from being brought into battle.</p> <p><strong>Tapu Fini</strong>: Tapu Fini takes very little from any of Incineroar's attacks and does significantly more in return with Hydro Pump.</p>",
    "sets": [
      {
        "name": "Assault Vest",
        "description": "<p>Incineroar is the best Intimidate user in 2v2 Doubles and one of the top Fake Out users. With its incredible mixed bulk, it is no wonder that Assault Vest + Intimidate Incineroar makes up the defensive backbone of many teams. With the provided EV spread, it is able to survive nearly any single target attack, up to a +1 Meteor Beam from Nihilego or a -1 Close Combat from Pheromosa. Flare Blitz OHKOes various Pokemon, such as Genesect, Ferrothorn, and Pheromosa, even with no Attack investment. Knock Off provides higher damage output than Darkest Lariat, as well as utility by removing items, but Darkest Lariat is better against Grassy Seed Cresselia and Cosmic Power Mew. Earthquake OHKOes Nihilego and bypasses Follow Me, making Incineroar's matchup against Psychic Terrain teams even better—it also stops Victini, Indeedee-F, Genesect, and Hattrenne naturally. Close Combat can be used for Kyurem-B and other Incineroar if the team already handles Nihilego well.</p> <p>Incineroar's many positive qualities lend it useful to a variety of different Pokemon. It matches up well against Zeraora, Regieleki, and Rillaboom for Water-types such as Tapu Fini, Kingdra, and Politoed, and it checks Genesect and Victini for Grass-types like Rillaboom and Ferrothorn. In return, these teammates remove various Rock- and Ground-types such as Nihilego, Diancie, Zygarde, Landorus, and Landorus-T for Incineroar. Kyurem-B is a decent partner for Incineroar as well; it appreciates that Incineroar removes some of its common checks, like Genesect and Pheromosa, and supplements its tremendous bulk. Kyurem-B threatens Water-types like Tapu Fini and Ground-types like Zygarde for Incineroar. Regieleki and Zeraora also go well with Incineroar, despite their shared Ground weakness. They remove Water-types such as Tapu Fini, Volcanion, and Blastoise and fast threats like Cinderace, Galarian Zapdos, and Pheromosa. Incineroar also enjoys the speed control they provide, and its Intimidate weakens Rillaboom so they do not have to fear Grassy Glide. Bulky setup Pokemon like Celesteela, Cresselia, and Mew appreciate Intimidate supplementing their already tremendous bulk. All three also match up well versus various threats to Incineroar, such as Nihilego, Diancie, Volcanion, and Galarian Zapdos. Landorus and Tapu Fini ease the Incineroar mirror matchup and remove other checks like Volcanion and Diancie.</p>"
      }
    ],
    "credits": {"writtenBy": [{"username": "Itchy", "user_id": 518399}], "teams": [{"name": "Quality checked by", "members": [{"username": "Reece", "user_id": 540482}, {"username": "hayedenn", "user_id": 484270}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Tapu Fini": {"sets": [{"name": "Bulky Anti-Zeraora"}, {"name": "Choice Scarf"}]},
  "Nihilego": {"sets": [{"name": "Power Herb"}]},
  "Pheromosa": {
    "comments": "<h1>Other Options</h1> <p>A physically offensive Pheromosa variant can run 252 Attack EVs and 252 Speed EVs with a Naive nature and Triple Axel instead of Ice Beam. This makes Pheromosa overall stronger while exchanging the reliable Ice Beam for the more inconsistent Triple Axel.</p> <h1>Checks and Counters</h1> <p><strong>Tailwind and Faster Pokemon</strong>: Many foes can outspeed and OHKO Pheromosa in Tailwind. Regieleki can outspeed it without Tailwind and easily OHKO, even with Electroweb, as can Choice Scarf Pokemon such as Zygarde and Landorus-T.</p> <p><strong>Redirectors: Togekiss and Indeedee-F both redirect Pheromosa's attacks, letting their teammates easily OHKO it. In addition, both of these Pokemon can OHKO Pheromosa with Dazzling Gleam and Expanding Force, respectively.</p>",
    "sets": [
      {
        "name": "Mixed Life Orb",
        "description": "<p>Pheromosa's high mixed offenses and near-unmatched Speed allow it to cover various top-tier threats such as Zeraora, Naganadel, Nihilego, and Cinderace. Close Combat is Pheromosa's strongest move outside of the unreliable High Jump Kick, and it's easily able to OHKO frail Pokemon, even when not super effective. such as Zeraora and Nihilego. Bug Buzz is a secondary STAB move that is useful for Psychic-type Pokemon such as Indeedee-F and Grass-types like Rillaboom. Ice Beam provides coverage to OHKO Naganadel, Zygarde, and Landorus-T. 12 Special Attack EVs allow Ice Beam to OHKO Nagandel with the rest placed into Attack.</p> <p>Pheromosa's speed and strong Ice Beam allow it to deal with Ground-types for Regieleki and Naganadel for Genesect. The combination of Regieleki and Pheromosa is very dangerous, as their high Speed and power often leave both foes KOed before they can move. Genesect, be it running Assault Vest or Life Orb, can cover Pheromosa's bad matchups such as Choice Scarf Zygarde or Tapu Fini. The two complement each other due to their high damage outputs, and Genesect's substantial bulk covers Pheromosa's frailty quite well. Pheromosa struggles against redirection and Tailwind, as well as Pokemon with resistance Berries such as Tanga Berry Indeedee-F,and Chople Berry Kyurem-B. Redirectors such as Indeedee-F and Togekiss are good teammates, as they can also provide the redirection that Pheromosa desires while denying t foe redirection with Imprison. Talonflame is great to negate its Tailwind weakness by setting Tailwind themselves. Tyranitar stifles resistance Berries with Unnerve and also OHKOes redirectors in Indeedee-F and Togekiss, which pester Pheromosa.</p>"
      }
    ],
    "credits": {"writtenBy": [{"username": "Morgan", "user_id": 457210}], "teams": [{"name": "Quality checked by", "members": [{"username": "Mubs", "user_id": 442711}, {"username": "PA", "user_id": 430787}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Celesteela": {"sets": [{"name": "Leech Seed Stall"}]},
  "Naganadel": {
    "comments": "<h1>Other Options</h1> <p>Choice Scarf is also a strong option for Naganadel to outspeed and OHKO checks such as Regieleki, Pheromosa, and most other Choice Scarf users. However, without Protect, Naganadel is vulnerable to Fake Out and is more easily punished for incorrect predictions. Helping Hand is also an option to support partners such as Choice Scarf Zygarde, allowing it to OHKO Cinderace, Naganadel, and Kyurem-B. Offensive moves are usually more useful, however.</p> <h1>Checks and Counters</h1> <p><strong>Redirection: Naganadel is frail, and most common redirectors like Blastoise, Indeedee-F, and specially defensive Togekiss can survive any attack from it, after which the other foe is free to OHKO Naganadel.</p> <p><strong>Faster Pokemon: Pokemon that outspeed Naganadel such as Pheromosa and Choice Scarf users such as Zygarde and Landorus-T reliably OHKO it. In addition, Regieleki and Zeraora outspeed Naganadel and can use Electroweb to decrease its Speed.</p> <p><strong>Heatran: Naganadel lacks any way to significantly damage Heatran due to its typing and ability Flash Fire.</p> <p><strong>Special Walls</strong>: Porygon2, Cresselia, and Diancie all take very little from any of Naganadel's attacks. Additionally, Porygon2 and Diancie can set Trick Room for a partner, and Cresselia can set up with Calm Mind and has speed control with Icy Wind and Trick Room.</p>",
    "sets": [
      {
        "name": "All-out Attacker",
        "description": "<p>Draco Meteor is Naganadel's strongest move, allowing it to OHKO a large number of Pokemon such as Cinderace, Pheromosa, Zygarde, and Regieleki. Heat Wave OHKOes Life Orb Genesect and Pheromosa and provides spread damage. Sludge Bomb checks Fairy-types such as Tapu Lele, Tapu Fini, and Togekiss. Fire Blast OHKOes Assault Vest Genesect, and it deals significant damage to Celesteela and Metagross. The Timid nature lets Naganadel outspeed Cinderace and Galarian Zapdos.</p> <p>Naganadel can pair with a variety of Pokemon, as it has relatively few defensive checks. It naturally shores up the weaknesses of many Pokemon such as Tyranitar, Genesect, and Regieleki, since it OHKOes Rillaboom, Cinderace, and non-Haban Berry Zygarde and Kyurem-B. In return, Tyranitar threatens walls such as Incineroar, Indeedee-F, and Togekiss, Genesect deals with Psychic-types such as Indeedee-F, Hatterene, and Tapu Lele, and Regieleki removes Togekiss and Blastoise so they can't redirect Naganadel's attacks. Naganadel also benefits from redirection users like Togekiss and Indeedee-F, since they shield it from single target attacks from the likes of Metagross, Victini, and Volcanion. Choice Scarf Zygarde patches Naganadel's weak matchups against Zeraora, Talonflame, and Heatran and appreciates that Naganadel threatens Tapu Fini, Rillaboom, Genesect, and Ferrothorn. Victini covers most common Psychic- and Steel-types for Naganadel, but it amplifies Naganadel's weaknesses to various threats like Assault Vest Incineroar and Zygarde. Tailwind users such as Talonflame or speed control users, such as Electroweb Zeraora and Regieleki or Icy Wind Tapu Fini, supplement its already incredible Speed, allowing it to blitz by foes such as Pheromosa, Talonflame, and Regieleki. Talonflame + Regidrago threaten Naganadel together, but potential partners Tapu Fini and Diancie shut this strategy down.</p>"
      }
    ],
    "credits": {"writtenBy": [{"username": "Morgan", "user_id": 457210}, {"username": "Itchy", "user_id": 518399}], "teams": [{"name": "Quality checked by", "members": [{"username": "Reece", "user_id": 540482}, {"username": "hayedenn", "user_id": 484270}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Zeraora": {"sets": [{"name": "Electroweb"}]},
  "Rillaboom": {"sets": [{"name": "Life Orb"}, {"name": "Assault Vest"}]},
  "Rillaboom-Gmax": {},
  "Cinderace": {"sets": [{"name": "Life Orb"}]},
  "Cinderace-Gmax": {},
  "Indeedee-F": {
    "comments": "<h1>Other Options</h1> <p>Bulky Indeedee-F can use a Sitrus Berry if it isn't expecting to run into Dark- or Bug-type moves to give it more survivability, but these types of moves are very common, so it's generally better to run a weakness Berry. Choice Scarf Indeedee-F can run Energy Ball to deal with Tapu Fini and Gastrodon if it is being used with Pokemon that also struggle with those matchups, like Victini and Zygarde, but has no use outside of these matchups, so it is not useful in most scenarios.</p> <h1>Checks and Counters</h1> <p><strong>Dark-types: Dark-types are immune to Expanding Force, which a lot of Indeedee-F's partners try to use, so Pokemon such as Incineroar and Tyranitar can often invalidate Indeedee-F's strategies.</p> <p><strong>Steel-types: Indeedee-F struggles to deal damage to bulky Steel-types such as Metagross, Heatran, and Celesteela. Mystical Fire can be an option to surprise Steel-types, but it doesn't do significant damage to them.</p> <p><strong>Rillaboom: Rillaboom often needs its Grassy Terrain to be effective, so it will go to great lengths to be slower than Indeedee-F. Since Rillaboom has the same base Speed as Indeedee-F, it will run minimum Speed and set itself to level 99 or 98 to always underspeed Indeedee-F and make Grassy Terrain go up instead of Psychic Terrain.</p>",
    "sets": [
      {
        "name": "Bulky Support",
        "description": "<p>Indeedee-F's access to Psychic Surge and Follow Me makes it a premier redirection user in 2v2 Doubles. Psychic Surge allows it to block priority moves such as the ever-present Fake Out, giving its teammates a free turn 1. Follow Me lets Indeedee-F redirect attacks to itself, an essential strategy in 2v2 Doubles, to keep its hard-hitting partner alive for multiple turns; for example, it can stop Naganadel's Draco Meteor from hitting Zygarde and give Zygarde the opportunity to KO back. Expanding Force is Indeedee-F's best attacking move for cases where extra chip damage might be useful in finishing off the foe. Helping Hand is used when Indeedee-F's partner needs an increase in power to secure a KO on an opposing Pokemon; for example, it allows Choice Scarf Zygarde to secure the KO on Cinderace with Thousand Arrows. Protect is useful on Indeedee-F because the opponent will sometimes focus on Indeedee-F to eliminate the possibility of redirection, so Protect grants it extra survivability. It can also be useful to block a slower Rillaboom's Fake Out in Grassy Terrain. Fake Out can be used instead of Protect as a way to prevent Flying-types from using their first move, which is useful against top-tier threats like Tornadus's Tailwind and Togekiss's Follow Me, and also is useful for when the opponent prevents Indeedee-F's Terrain with Pokemon like Iron Ball Rillaboom. Iron Ball can be used to make Indeedee-F as slow as possible, giving it the best chance that its Terrain will go up after Rillaboom, as Rillaboom loses power and Grassy Glide priority when Grassy Terrain is not active. Imprison can be used to prevent opposing Indeedee-F and Togekiss from using Follow Me. Tanga and Colbur Berries can be used to survive hits from threats such as Genesect and Incineroar, respectively, which allows it to provide another turn of redirection, giving its partner two free turns ideally. Indeedee-F's EVs are designed to allow it to survive a hit from a standard Helping Hand Nihilego's Meteor Beam, with the rest in Defense.</p> <p>Indeedee-F is most commonly found on hyper offensive teams with strong attackers that can overpower both opposing Pokemon. Indeedee-F is often paired with Pokemon that can benefit from and use Expanding Force in its Terrain, such as Victini, which handles Steel-types such as Genesect and Celesteela, and Metagross, which can can use Weakness Policy to take advantage of spread moves such as Heat Wave and Earthquake that are commonly used against Indeedee-F. Other teammate options include Pokemon that benefit heavily from a free turn, such as Zygarde, which can set up with Dragon Dance and take care of Indeedee-F's checks like Tyranitar and Incineroar, and Nihilego, which appreciates the redirection to usually KO one foe with Meteor Beam. Indeedee-F's teammates often bring coverage for Dark-types that are immune to Expanding Force, such as Incineroar and Tyranitar, or Steel-types that Indeedee-F cannot beat such as Heatran and Celesteela. Common Pokemon that fill these roles include Pheromosa and Cinderace.</p>"
      },
      {
        "name": "Choice Scarf",
        "description": "<p>Choice Scarf is a viable option to run on Indeedee-F as a bluff to beat opponents expecting the support set. Expanding Force is Indeedee-F's main attack, as it does heavy damage to anything except Dark-types. Mystical Fire provides coverage against Steel-types such as Genesect and Metagross. Dazzling Gleam hits Dark-types that are commonly picked to counter Indeedee-F. Trick cripples passive opposing Pokemon such as Cresselia and Gastrodon. Follow Me is a viable alternative, as locking itself into Follow Me allows Indeedee-F to still protect its teammate. 252 Speed EVs and a Timid nature critically allow Indeedee-F to outspeed Pheromosa.</p> <p>Choice Scarf Indeedee-F works best on hyper offense teams, playing with expectations as an offensive version of a normally passive Pokemon. Indeedee-F benefits from fast teammates such as Cinderace and Pheromosa to bring powerful Fighting-type coverage for Steel- and Dark-types that will be able to survive Indeedee-F's attacks. If Indeedee-F is not running Follow Me, it will usually need bulkier teammates that can survive without redirection such as Life Orb Zygarde to beat Incineroar, Tyranitar, and Steel-types or bulky Weakness Policy Victini to take advantage of Pokemon like Zygarde using Thousand Arrows. Other bulky Fire-types such as Heatran and Volcanion can also accomplish this goal. Diancie is also a good option, as it beats Incineroar and Galarian Moltres, which usually wall Indeedee-F, as well as providing support through Helping Hand.</p>"
      }
    ],
    "credits": {"writtenBy": [{"username": "IBM", "user_id": 484118}], "teams": [{"name": "Quality checked by", "members": [{"username": "Reece", "user_id": 540482}, {"username": "Morgan", "user_id": 457210}]}, {"name": "Grammar checked by", "members": [{"username": "UT", "user_id": 523866}]}]}
  },
  "Dracovish": {"sets": [{"name": "Tailwind / Sand Offensive"}]},
  "Regieleki": {
    "comments": "<h1>Other Options</h1> <p>Regieleki can also run more defensive sets, running Light Screen and/or Reflect to help it and its partner live attacks and KO back, but they are not widely successful due to the prevalence of Encore Whimsicott and their lack of offensive pressure. Regieleki can also be an offensive Electric Terrain attacker with Rising Voltage alongside Pincurchin, which practically guarantees Electric Terrain with its slow Speed, letting Regieleki tear through opponents without effective resistance to Electric-type moves. This style of team is not widely seen because Pincurchin stacks Regieleki’s weaknesses to priority Tailwind and Electric-resistant or immune foes, putting extra pressure on the remaining two teammates to cover for all of these Pokemon.</p> <h1>Checks and Counters</h1> <p><strong>Ground-types: Regieleki's best move to hit Ground-type Pokemon is Hyper Beam, which does not do enough to OHKO most relevant Ground types, even with Regieleki's decent Special Attack. Zygarde and Landorus-T, the two most common Ground-types, both threaten OHKOs in return with their Ground-type STAB attacks.</p> <p><strong>Dragon-types: Dragon-types, such as Naganadel and Kyurem-B, resist Electric, and are not OHKOed by Hyper Beam either. They also threaten OHKOs or massive amounts of damage in return.</p> <p><strong>Prankster and Gale Wings Tailwind: Priority Tailwind from Whimsicott, Tornadus, or Talonflame takes away Regieleki's Speed advantage, allowing Pokemon that are usually slower than it to outspeed and OHKO Regieleki before it can damage them.</p>",
    "sets": [
      {
        "name": "Life Orb",
        "description": "<p>Regieleki’s access to Electroweb and amazing base 200 Speed make it one of 2v2 Doubles's premier means of speed control. Electroweb is especially devastating in 2v2 Doubles because the changes in Speed take effect immediately, as opposed to at the end of the turn. Thunder is used, despite its shaky accuracy, for bulkier targets that Thunderbolt cannot reliably OHKO. For example, it always OHKOes offensive Genesect if it hits. 228 Speed EVs allows Regieleki to outspeed opponents such as Zapdos-Galar and Victini at +1 speed or when Regieleki is at -1 Speed. The Special Attack is for maximum damage. The rest of the EVs are extra, and can be moved into Speed for the Regieleki mirror matchup if desired.</p> <p>Regieleki is often paired with teammates that benefit from the excellent speed control it provides, such as Genesect, Pheromosa, and Regidrago. Regieleki's teammates will also cover for common Pokemon that resist or are immune to its Electric-type attacks, such as Naganadel, Zygarde, and Landorus-T. Common Pokemon that fill this role are Kyurem-B, Urshifu-R, and Cinderace.</p>"
      },
      {
        "name": "Choice Scarf",
        "description": "<p>One of Regieleki's biggest weaknesses is being OHKOed before it can move after opposing Prankster Whimsicott or Tornadus sets Tailwind up. However, when holding a Choice Scarf, Regieleki will outspeed nearly everything in the format despite Tailwind and drop their Speed with Electroweb before they move. Hyper Beam is used as a means of hitting Ground-, Grass- and Dragon-type Pokemon, like Zygarde, Whimsicott, and Landorus-T with a burst of damage before being KOed. This Regieleki has the EVs to survive +0 Bug Buzz from Defensive Life Orb Genesect, and outspeed Tornadus in Tailwind with some extra Speed to spare.</p> <p>Choice Scarf Regieleki pairs well with Pokemon that struggle against Prankster Tailwind, such as Pheromosa and Naganadel. Choice Scarf Regieleki is especially great with Pheromosa because Electroweb allows Pheromosa to outspeed -1 Speed Genesect in Tailwind, nabbing a surprise KO on it with Close Combat after Electroweb. Choice Scarf Regieleki struggles against the Ground- and Dragon-types of the tier, most notably Kyurem-B, Landorus-T, Zygarde, and Naganadel. Pheromosa, Kyurem-B, Naganadel, Urshifu-R, and other Pokemon with similar offensive typings generally deal with these Pokemon well with the amazing speed control Regieleki provides.</p>"
      }
    ],
    "credits": {"writtenBy": [{"username": "Itchy", "user_id": 518399}], "teams": [{"name": "Quality checked by", "members": [{"username": "Morgan", "user_id": 457210}, {"username": "PA", "user_id": 430787}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Regidrago": {
    "comments": "<h1>Other Options</h1> <p>Regidrago can use Choice Scarf to hold its own when Tailwind has a bad matchup. When both sides are under Tailwind, Choice Scarf Regidrago will outspeed most foes such as Kyurem-B, Galarian Zapdos, Landorus-T, opposing Regidrago, and Timid Kingdra.</p> <h1>Checks and Counters</h1> <p><strong>Fairy-types: Fairy-types like Tapu Fini, Togekiss, and Diancie are immune to Regidrago’s Dragon-type moves. Tapu Fini can be especially problematic, as Misty Terrain halves the amount of damage Regidrago’s Dragon-type moves.</p> <p><strong>Steel-types: Steel-types like Celesteela and Metagross take little damage from Regidrago and deal formidable damage in return.</p>",
    "sets": [
      {
        "name": "Life Orb",
        "description": "<p>Regidrago's strong STAB moves like Dragon Energy and Draco Meteor combined with Dragon's Maw allows it to take down many threats. With a Life Orb, Regidrago can OHKO Zeraora, Cinderace, Tsareena, Regieleki, Pheromosa, Naganadel, Volcanion, and Victini with Dragon Energy or Draco Meteor. Fire Fang is used to 2HKO Ferrothorn, OHKO Genesect, and to chip Togekiss. A Naive nature improves Regidrago’s rain matchup, as it will outspeed Modest Kingdra when under Tailwind.</p> <p>Regidrago is seen on offensive teams that have ways to support its high damage output like Follow Me and Tailwind. Talonflame is a great partner, as it can use Flare Blitz to beat most Steel-types and use Tailwind to improve Regidrago’s Speed. In return, Regidrago beats both Landorus formes and Volcanion. Cinderace is a good partner for Regidrago, as it can beat Steel- and Fairy-types such as Genesect, Celesteela, Metagross, non-Choice Scarf Tapu Fini, and Togekiss that Regidrago struggles against. Cinderace benefits from Regidrago, as it beats checks such as Volcanion, Zygarde, and Incineroar. Steel-types like Celesteela, Genesect, and Metagross like having Regidrago around, as it beats the Fire-types such as Cinderace and Volcanion that they struggle against. Regidrago benefits from Steel-types like Celesteela and Genesect as they beat most Fairy-types such as Tapu Fini and Togekiss that Regidrago has trouble against. Fast Electroweb and Icy wind users such as Regieleki, Zeraora, and Pheromosa also make great partners for Regidrago, as they allow Regidrago to outspeed its opponents and in the case of Regieleki and Zeraora, beat Tapu Fini. Rillaboom beats Regidrago checks such as Tapu Fini, provides valuable Fake Out support, and beats Zeraora. Regidrago appreciates redirection users such as Amoonguss and Indeedee-F as they protect Regidrago from Draco Meteor and Ice-type moves.</p>"
      }
    ],
    "credits": {"writtenBy": [{"username": "Orangex", "user_id": 594122}], "teams": [{"name": "Quality checked by", "members": [{"username": "Itchy", "user_id": 518399}, {"username": "Reece", "user_id": 540482}]}, {"name": "Grammar checked by", "members": [{"username": "UT", "user_id": 523866}]}]}
  }
}