{
  "Zapdos": {"sets": [{"name": "Fast Offensive"}]},
  "Tyranitar": {"sets": [{"name": "Life Orb"}]},
  "Togekiss": {"sets": [{"name": "Follow Me Offensive"}, {"name": "Follow Me + Tailwind"}]},
  "Victini": {"sets": [{"name": "Mixed Life Orb"}]},
  "Whimsicott": {"sets": [{"name": "Tailwind Setter"}]},
  "Kyurem-Black": {
    "comments": "<h1>Other Options</h1> <p>Kyurem-B can use a plethora of physical sets. Dragon Dance with Life Orb maximizes its offensive output and pairs well with redirection from Togekiss, Blastoise, or Indeedee-F. Instead of Life Orb, Babiri Berry and Haban Berry can be used to beat Dragon- and Steel-type threats such as Metagross and Naganadel. Power Herb is an option for a one turn Freeze Shock. On the offensive set, Haban Berry can be used to stave off Naganadel and Latios, and Life Orb is also an option. A Choice Scarf variant of Kyurem-B can lure in and surprise Naganadel, Pheromosa, and Zygarde; however, this set is fairly inconsistent, as it relies heavily on teammates removing Steel- and Water-types.</p> <h1>Checks and Counters</h1> <p><strong>Faster Threats and Fake Out: Fake Out from Pokemon such as Mew, Incineroar, and Rillaboom hinders Kyurem-B's chance of survival, especially Assault Vest Kyurem-B, which lacks Protect. Faster threats like Zeraora, Pheromosa, and Galarian Zapdos can each threaten Kyurem-B, while Zeraora can also use Fake Out.</p> <p><strong>Specially Defensive Threats: Specially bulky Pokemon such as Diancie, Cresselia, Tyranitar, and Porygon2 pose a large threat to Kyurem-B. Diancie and Tyranitar check it both defensively and offensively. Porygon2 and Diancie can set up Trick Room without taking much damage, leaving Kyurem-B vulnerable. Assault Vest Zeraora takes all of Kyurem-B's attacks and pressures it with Close Combat, Play Rough, or Fake Out. Choice Scarf Genesect 2HKOes Kyurem-B with Iron Head and takes very little from it.</p> ",
    "sets": [
      {
        "name": "Offensive Chople Berry",
        "description": "<p>Kyurem-B's exceptional bulk and Chople Berry allow it to survive Fighting-type attacks from Life Orb Galarian Zapdos and Pheromosa to OHKO back. Freeze-Dry removes metagame staples such as Rillaboom, Dracovish, Tapu Fini, and Galarian Zapdos. Earth Power provides great coverage with Freeze-Dry, nailing Ice-resistant foes such as Heatran, Volcanion, and Metagross. Draco Meteor pressures Pokemon that shrug off its other moves such as Volcarona and opposing Kyurem-B, and it more reliably OHKOes Pheromosa. Protect ensures Kyurem-B's safety against Fake Out pressure while punishing foes that concentrate on KOing it.</p> <p>For partners, Togekiss provides Follow Me and Tailwind support and can stave off Fairy-types, such as Tapu Fini and Tapu Lele. In return, Kyurem-B checks Regieleki and staves off Volcanion. Regieleki blasts through bulky Water-types that Kyurem-B cannot KO, such as Blastoise, while slowing down Pheromosa and Naganadel with Electroweb. Kyurem-B breaks through Ground- and Grass-types like Zygarde and Rillaboom that can take Regieleki's STAB Electric-type attacks. Cinderace and Pheromosa both break through Steel-types that Kyurem-B hates, such as Metagross and Heatran. Cinderace also pressures Togekiss, which Kyurem-B greatly appreciates, and Kyurem-B's Freeze-Dry ameliorates Cinderace's weakness to Ground-types.</p> "
      },
      {
        "name": "Assault Vest",
        "description": "<p>Assault Vest Kyurem-B can easily take on threats such as Victini, Regieleki, and Galarian Moltres. It is seen on faster-paced teams to break through offensive teams by surviving long enough to OHKO their threats. Freeze-Dry 2HKOes physically defensive Tapu Fini and OHKOes Dracovish. Earth Power can OHKO offensive Heatran and 2HKOes Volcanion and non-Assault Vest Metagross. Icy Wind combined with 32 Speed EVs allows Kyurem-B to outrun Kartana and Latios. Draco Meteor provides great, strong coverage against Pokemon such as Volcarona and opposing Kyurem-B. 88 Special Defense EVs with the Assault Vest allow Kyurem-B to survive two full-health Eruptions from Charcoal Heatran, as well as comfortably surviving Life Orb Draco Meteor from Naganadel. 52 Defense EVs prevent OHKOs from Smart Strike from Kartana, Rock Slide from Tyranitar, and three hit Dragon Dance-boosted Scale Shot from Zygarde.</p> <p>Kyurem-B's greatest weakness is Fairy-type threats, such as Tapu Fini and Tapu Lele, which Regieleki or Metagross can offensively check. Rillaboom removes Psychic Terrain from Tapu Lele and provides Fake Out support for Kyurem-B. Kyurem-B is OHKOed by Galarian Zapdos, Pheromosa, and Cinderace, so Choice Scarf Tapu Lele is a great partner to outspeed and OHKO them. Also, Tapu Lele's Psychic Surge prevents Fake Out from Incineroar. Regieleki is a great option to outspeed common threats, as Kyurem-B can OHKO Ground- and Grass-types like Rillaboom, Zygarde, and Landorus-T that resist Electric, while Regieleki removes faster threats that pressure Kyurem-B such as Pheromosa and Galarian Zapdos.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 457210, "username": "Morgan"}, {"user_id": 518399, "username": "Itchy"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}, {"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 540482, "username": "Reece"}]}
  },
  "Genesect": {"sets": [{"name": "Mixed Life Orb"}]},
  "Zygarde": {"sets": [{"name": "Haban Dragon Dance"}, {"name": "Choice Scarf"}]},
  "Tapu Fini": {"sets": [{"name": "Weakness Policy"}]},
  "Nihilego": {"sets": [{"name": "Power Herb"}]},
  "Pheromosa": {
    "comments": "<h1>Other Options</h1> <p>A physically offensive Pheromosa variant can run 252 Attack EVs and 252 Speed EVs with a Naive nature, running Lunge instead of Bug Buzz and Triple Axel instead of Ice Beam. This makes Pheromosa overall stronger while exchanging the reliable Ice Beam for the more inconsistent Triple Axel.</p> <h1>Checks and Counters</h1> <p><strong>Tailwind and Faster Pokemon</strong>: Many foes can outspeed and OHKO Pheromosa in Tailwind. Regieleki can outspeed it without Tailwind and easily OHKO, even with Electroweb, as can Choice Scarf Pokemon such as Zygarde and Landorus-T.</p> <p><strong>Redirectors: Togekiss and Indeedee-F both redirect Pheromosa's attacks, letting their teammates easily OHKO it. In addition, both of these Pokemon can OHKO Pheromosa with Dazzling Gleam and Expanding Force,respectively.</p> ",
    "sets": [
      {
        "name": "Mixed Life Orb",
        "description": "<p>Pheromosa's high mixed offenses and near-unmatched Speed allow it to cover various top-tier threats such as Zeraora, Naganadel, Nihilego, and Cinderace. Close Combat is Pheromosa's strongest move outside of the unreliable High Jump Kick, and it's easily able to OHKO frail Pokemon, even when not super effective. such as Zeraora and Nihilego. Bug Buzz is a secondary STAB move that is useful for Psychic-type Pokemon such as Indeedee-F and Grass-types like Rillaboom. Ice Beam provides coverage to OHKO Naganadel, Zygarde, Landorus-T, and Tornadus. 92 Attack EVs allow Pheromosa to OHKO Zeraora with Close Combat, and 164 Special Attack EVs allow Ice Beam to OHKO Tornadus.</p> <p>Pheromosa's speed and strong Ice Beam allow it to deal with Ground-types for Regieleki and Naganadel for Genesect. The combination of Regieleki and Pheromosa is very dangerous, as their high Speed and power often leave both foes KOed before they can move. Genesect, be it running Assault Vest or Life Orb, can cover Pheromosa's bad matchups such as Choice Scarf Zygarde or Tapu Fini. The two complement each other due to their high damage outputs, and Genesect's substantial bulk covers Pheromosa's frailty quite well. Pheromosa struggles against redirection and Tailwind, as well as Pokemon with resistance Berries such as Tanga Berry Indeedee-F, Chople Berry Kyurem-B, and Yache Berry Whimsicott. Redirectors such as Indeedee-F and Togekiss are good teammates, as they can also provide the redirection that Pheromosa desires while denying t foe redirection with Imprison. Whimsicott and Tornadus are great to negate its Tailwind weakness by setting Tailwind themselves. Tyranitar stifles resistance Berries with Unnerve and also OHKOes redirectors in Indeedee-F and Togekiss, which pester Pheromosa.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 442711, "username": "Mubs"}, {"user_id": 430787, "username": "PA"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 457210, "username": "Morgan"}]}
  },
  "Naganadel": {"sets": [{"name": "Life Orb"}]},
  "Zeraora": {"sets": [{"name": "Electroweb"}]},
  "Rillaboom": {"sets": [{"name": "Life Orb"}, {"name": "Assault Vest"}]},
  "Cinderace": {"sets": [{"name": "Life Orb"}]},
  "Indeedee-F": {"sets": [{"name": "Follow Me Support"}]},
  "Urshifu-Rapid-Strike": {"sets": [{"name": "Life Orb"}]},
  "Regieleki": {
    "comments": "<h1>Other Options</h1> <p>Regieleki can also run more defensive sets, running Light Screen and/or Reflect to help it and its partner live attacks and KO back, but they are not widely successful due to the prevalence of Encore Whimsicott and their lack of offensive pressure. Regieleki can also be an offensive Electric Terrain attacker with Rising Voltage alongside Pincurchin, which practically guarantees Electric Terrain with its slow Speed, letting Regieleki tear through opponents without effective resistance to Electric-type moves. This style of team is not widely seen because Pincurchin stacks Regieleki’s weaknesses to priority Tailwind and Electric-resistant or immune foes, putting extra pressure on the remaining two teammates to cover for all of these Pokemon.</p> <h1>Checks and Counters</h1> <p><strong>Ground-types: Regieleki's best move to hit Ground-type Pokemon is Hyper Beam, which does not do enough to OHKO most relevant Ground types, even with Regieleki's decent Special Attack. Zygarde and Landorus-T, the two most common Ground-types, both threaten OHKOs in return with their Ground-type STAB attacks.</p> <p><strong>Dragon-types: Dragon-types, such as Naganadel and Kyurem-B, resist Electric, and are not OHKOed by Hyper Beam either. They also threaten OHKOs or massive amounts of damage in return.</p> <p><strong>Prankster and Gale Wings Tailwind: Priority Tailwind from Whimsicott, Tornadus, or Talonflame takes away Regieleki's Speed advantage, allowing Pokemon that are usually slower than it to outspeed and OHKO Regieleki before it can damage them.</p> ",
    "sets": [
      {
        "name": "Life Orb",
        "description": "<p>Regieleki’s access to Electroweb and amazing base 200 Speed make it one of 2v2 Doubles's premier means of speed control. Electroweb is especially devastating in 2v2 Doubles because the changes in Speed take effect immediately, as opposed to at the end of the turn. Thunder is used, despite its shaky accuracy, for bulkier targets that Thunderbolt cannot reliably OHKO. For example, it always OHKOes offensive Genesect if it hits. 228 Speed EVs allows Regieleki to outspeed opponents such as Zapdos-Galar and Victini at +1 speed or when Regieleki is at -1 Speed. The Special Attack is for maximum damage. The rest of the EVs are extra, and can be moved into Speed for the Regieleki mirror matchup if desired.</p> <p>Regieleki is often paired with teammates that benefit from the excellent speed control it provides, such as Genesect, Pheromosa, and Regidrago. Regieleki's teammates will also cover for common Pokemon that resist or are immune to its Electric-type attacks, such as Naganadel, Zygarde, and Landorus-T. Common Pokemon that fill this role are Kyurem-B, Urshifu-R, and Cinderace.</p> "
      },
      {
        "name": "Choice Scarf",
        "description": "<p>One of Regieleki's biggest weaknesses is being OHKOed before it can move after opposing Prankster Whimsicott or Tornadus sets Tailwind up. However, when holding a Choice Scarf, Regieleki will outspeed nearly everything in the format despite Tailwind and drop their Speed with Electroweb before they move. Hyper Beam is used as a means of hitting Ground-, Grass- and Dragon-type Pokemon, like Zygarde, Whimsicott, and Landorus-T with a burst of damage before being KOed. This Regieleki has the EVs to survive +0 Bug Buzz from Defensive Life Orb Genesect, and outspeed Tornadus in Tailwind with some extra Speed to spare.</p> <p>Choice Scarf Regieleki pairs well with Pokemon that struggle against Prankster Tailwind, such as Pheromosa and Naganadel. Choice Scarf Regieleki is especially great with Pheromosa because Electroweb allows Pheromosa to outspeed -1 Speed Genesect in Tailwind, nabbing a surprise KO on it with Close Combat after Electroweb. Choice Scarf Regieleki struggles against the Ground- and Dragon-types of the tier, most notably Kyurem-B, Landorus-T, Zygarde, and Naganadel. Pheromosa, Kyurem-B, Naganadel, Urshifu-R, and other Pokemon with similar offensive typings generally deal with these Pokemon well with the amazing speed control Regieleki provides.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 457210, "username": "Morgan"}, {"user_id": 430787, "username": "PA"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 518399, "username": "Itchy"}]}
  }
}