{
  "Arcanine": {
    "sets": [
      {
        "name": "Choice Band",
        "description": "<p>Arcanine can use its powerful Fire-type STAB moves against many top threats in the metagame such as non-Occa Berry Whimsicott, Galarian Darmanitan, and Corviknight. In addition to this, its fantastic ability in Intimidate makes its good physical bulk better, allowing it to even face foes that can hit it super effectively such as Haxorus and Choice Scarf Excadrill. Flare Blitz is Arcanine's STAB move of choice, allowing it to OHKO Pokemon such as Rillaboom and Excadrill. Close Combat can help with handling and OHKOing Normal-, Rock-, and Dark-types such as Choice Specs Porygon-Z, Tyranitar, and non-Choice Specs Hydreigon, while Play Rough lets you OHKO Urshifu-S while still being able to OHKO non-Choice Specs Hydreigon. Outrage is useful for the plethora of Dragon-types in 1v1 such as Haxorus, Dracovish, and Dragapult, assuming they aren't holding a Haban Berry. Extreme Speed gives Arcanine a guaranteed matchup against Choice Scarf Togekiss as Arcanine 3HKOes with priority whilst Togekiss can only 3HKO back but lacks priority itself. Wild Charge can also be used for a better matchup against non-bulky Gyarados. The given HP and Special Defense investment allows Arcanine to avoid the OHKO from Timid Choice Specs Dragapult's Draco Meteor. The given Speed investment outspeeds Timid Choice Specs Porygon-Z. You can also use a simple spread with maximum Attack and Speed investment, which lets you OHKO non-bulky Urshifu-S with Close Combat at the cost of the Choice Specs Dragapult matchup.</p> <p>Water-types like bulky Assault Vest or Chilan Berry Primarina or Azumarill are great teammates due to their great coverage against Rock- and Ground-types like Crustle and Rhyperior. In return, Arcanine covers for Grass-types such as Rillaboom, Celebi and non-Occa Berry Whimsicott. In addition to this, Grass-types such as Rillaboom cover Arcanine's weaknesses in Rock-, Ground- and Water-types such as Rhyperior and Gastrodon, and Arcanine in return covers for some of their weaknesses such as Bug-types like Durant and certain opposing Grass-types like Venusaur.</p> "
      },
      {
        "name": "Defensive",
        "description": "<p>Arcanine is an excellent physical wall that can also counter some special attackers like Magnezone, Chandelure, and Aegislash. Intimidate combined with Arcanine's defensive utility in Will-O-Wisp and Burn Up lets it take physical hits from the likes of Galarian Darmanitan, non-Swords Dance Haxorus, and Choice Band Crustle. Will-O-Wisp is used to cripple physical attackers such as Diggersby as well as Sawk and Avalugg while also breaking their Sturdy. Arcanine uses Morning Sun to deal with Pokemon that may otherwise overwhelm it, like Choice Band Haxorus and Golisopod. Burn Up KOes Pokemon like Galarian Darmanitan and offensive Rillaboom and also removes Arcanine's Fire typing so that it is no longer weak to Rock-, Ground-, and Water-type attacks, which proves to be useful in matchups against non-Lum Berry Crustle, non-Swords Dance Rhyperior, and Adamant Choice Band Dracovish. Snarl is used to lower the Special Attack of Pokemon like Magnezone, Galarian Weezing, and Chandelure. Flamethrower deals consistent damage against threats Arcanine needs to hit more than once such as defensive Rillaboom, Taunt Zeraora, and Corviknight. Sitrus Berry gives Arcanine a source of immediate recovery to aid it in dealing with Choice Band Mold Breaker Haxorus and Assault Vest Kyurem so that it doesn't get knocked out after the first hit. Maximum Defense investment alongside 72 HP EVs with a Bold nature allows Arcanine to survive a Choice Band-boosted Earthquake from Jolly Galarian Darmanitan. 136 Speed EVs ensure that Arcanine is faster than Modest base 80 Speed Pokemon and below, such as Choice Specs Chandelure, offensive Venusaur, and Adamant Choice Band Dracovish and Diggersby. The leftover 48 EVs are invested into Special Attack to maximize the damage of Burn Up and Snarl. When using Flamethrower over Snarl, a spread of 244 HP / 136 Def / 8 SpA / 120 Spe should be used, which ensures Arcanine will always survive a Choice Specs-boosted Hyper Beam from Modest Magnezone while still surviving an Earthquake from Jolly Choice Band Galarian Darmanitan, though it comes at the expense of no longer outspeeding fully invested base 80 Speed Pokemon.</p> <p>Generally, Arcanine will find itself using Will-O-Wisp against physical attackers, although there are some matchups where this isn't ideal. Against non-Lum Berry Crustle, Choice Band Dracovish, and Choice Band Diggersby, Arcanine should use Burn Up to rid itself of its Fire typing followed by Will-O-Wisp and Morning Sun; this is because Burn Up is 100% accurate and achieves the same effect of halving damage as using Will-O-Wisp would, so you don't run the risk of losing on account of a miss. Certain defensive Primarina variants, like Assault Vest, can also be beaten by Arcanine through the use of Burn Up, Snarl, and Will-O-Wisp, but because Primarina can often run numerous varying techs, Arcanine shouldn't be relied on as a Primarina answer. Will-O-Wisp is also useful against special attackers like Magnezone, since it breaks its Sturdy so that Burn Up can then KO it. Will-O-Wisp also chips down Aegislash so that Burn Up can KO it after six turns of burn damage without risking the activation of its Weakness Policy. Against Choice Specs Magnezone, Arcanine should use Snarl to both break Sturdy and ensure that Arcanine will survive any hit. Pokemon like Sylveon, Primarina, and Choice Band Snorlax appreciate Arcanine's ability to handle hyper offensive threats like Choice Band Galarian Darmanitan, Adamant Choice Band Dracovish, and Rillaboom. In turn, these Pokemon help cover Arcanine's weakness to specially offensive threats like opposing Primarina, Hydreigon, and Kyurem. Arcanine struggles a bit when it comes to certain Encore and Taunt users like Primarina, Aromatisse, Kommo-o, and Corviknight if not running Flamethrower, so it appreciates the assistance provided by hyper offensive Pokemon like Choice Specs Porygon-Z, Choice Band Galarian Darmanitan, Salazzle, and Choice Specs Gengar. In return, Arcanine helps cover their weaknesses to bulky offense and Sturdy Pokemon like Assault Vest Azumarill, non-Swords Dance Rhyperior, Magnezone, Sawk, and Avalugg.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 480297, "username": "zioziotrip"}, {"user_id": 276708, "username": "Alakazam"}, {"user_id": 317056, "username": "dogknees"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Estronic"}, {"user_id": 297659, "username": "deetah"}]}], "writtenBy": [{"user_id": 451287, "username": "Krytocon"}, {"user_id": 239997, "username": "Rosa"}]}
  },
  "Slowbro": {
    "sets": [
      {
        "name": "Stall",
        "description": "<p>Thanks to its excellent defensive typing and great defensive stats, Slowbro is a threatening stall Pokemon in the 1v1 metagame. Its ability Oblivious helps it function as an effective PP staller, blocking Taunt from Pokemon like Corviknight, Haxorus, and Whimsicott. Iron Defense allows Slowbro to deal with physical powerhouses in the tier such as Galarian Darmanitan, Crustle, and Dracovish. Calm Mind covers Slowbro's mediocre Special Defense, which is useful against Pokemon such as Primarina and Salazzle, while also boosting the damage of Stored Power to defeat opposing stall Pokemon like Snorlax and Galarian Corsola. Slack Off allows Slowbro to heal damage taken while boosting its defensive stats. Rest is another recovery option that allows Slowbro to defeat Pokemon that use Toxic such as Chansey, but Slack Off is generally preferred to make it far less passive. Stored Power provides Slowbro with offensive capabilities that benefit from its defensive boosts, dealing with Pokemon such as Urshifu-R, Arcanine, and Kommo-o. The given EV spread with a Bold nature and the help of a Sitrus Berry is optimal for dealing with physical attackers like Haxorus and Galarian Darmanitan.</p> <p>Slowbro's main gameplan is to tank hits while setting up to improve its defensive capabilities. As such, Slowbro's passiveness leaves it vulnerable to Encore and Trick users like Primarina, Aromatisse, and Gardevoir. Against stall Rotom-W, use Calm Mind turn one, as Thunderbolt will deal less than 75% HP, activating Slowbro's Sitrus Berry. Afterwards, use Slack Off until it is around 80% health, then keep using Calm Mind and healing until Slowbro is at +3 and OHKO with Stored Power. Against any Zeraora variant, use Iron Defense immediately followed by Slack Off. From there, alternate between Slack Off and Iron Defense until Slowbro can 2HKO with Stored Power without getting 2HKOed itself. In terms of team options, Scyther is a fantastic partner to cover counters like Porygon-Z, Dragapult, Gardevoir, and Rillaboom. In return, Slowbro defeats Galarian Darmanitan and Crustle while also being extremely consistent against Zeraora. Fake Tears Sylveon is also a fantastic partner for Slowbro, due to its ability to take care of specially offensive threats like Primarina and Kyurem as well as Dark-types like Urshifu-S and Hydreigon. In return, Sylveon appreciates Slowbro handling Choice Band Crustle and Dracovish. Furthermore, Slowbro is quite slow, leaving it vulnerable to faster Pokemon like Choice Specs Porygon-Z and Rotom-H. Choice Scarf Porygon-Z and Goodra are good options to alleviate that weakness.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 480297, "username": "Zio"}, {"user_id": 317056, "username": "dogknees"}]}, {"name": "Grammar checked by", "members": [{"user_id": 302985, "username": "lotiasite"}]}], "writtenBy": [{"user_id": 430787, "username": "PA"}]}
  },
  "Chansey": {
    "sets": [
      {
        "name": "Stall",
        "description": "<p>Chansey is one of the bulkier walls by virtue of high HP and Eviolite, walling many prominent special attackers such as Primarina, Magnezone, and Volcarona. Toxic helps dispatch threats that can heal up on Chansey such as defensive Arcanine, Roost Kyurem, and non-Rest Slowbro. Soft-Boiled helps in matchups where the foe also has recovery to maintain health while Toxic whittles them down, which is particularly useful against Quiver Dance Volcarona, although Chansey will have to play around Substitute if Volcarona is running that. While Chansey's physical bulk is not nearly as good as its special bulk, the given EV investment allows for its to be as physically bulky as possible, letting it survive a hit from Choice item Haxorus, offensive Rillaboom, and Jolly Choice Scarf Galarian Darmanitan to OHKO them with Counter. Charm is an option over Counter to handle physical attackers that would like to set up on Chansey such as Shell Smash Crustle, Swords Dance Rhyperior, and Bulk Up Zeraora. Charm should be used to PP stall and negate boosts from the foe's setup moves to a point where any combination of Chansey's moves will win.</p> <p>Chansey is taken advantage of by Choice item attackers with Trick such as Rotom-H, Porygon-Z, and Gengar. Toxic can assist in dealing certain anti-stall measures such as Aromatisse and Fake Tears Sylveon; Chansey should use it before they are able to overly debilitate it with support moves like Encore + Disable and Fake Tears. Good teammates for Chansey are attackers that don't care about Trick and are able to retaliate, such as Choice Specs Magnezone and Choice Band Snorlax. Chansey also doesn't appreciate faster Taunt users such as Grassy Seed Rillaboom and Skarmory, as they PP stall Chansey and slowly chip it down. Good partners that alleviate this weakness include Substitute + Disable Dragapult and stall Arcanine.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 317056, "username": "dogknees"}, {"user_id": 276708, "username": "Alakazam"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Estronic"}]}], "writtenBy": [{"user_id": 480297, "username": "zio"}]}
  },
  "Snorlax": {
    "sets": [
      {
        "name": "Ron (Stall)",
        "description": "<p>This Snorlax set serves as a semi-stall Pokemon that beats many of the offensive threats in the 1v1 metagame, such as Galarian Darmanitan, Primarina, and non-Fling Choice item Haxorus. Counter deals with prominent physical attackers like offensive Rillaboom, non-Swords Dance Rhyperior, and Life Orb + three attacks Zeraora as well as Choice Band users such as Crustle and Azumarill. Amnesia utilizes Snorlax's fantastic Special Defense, which allows it to wall common Choice Specs users such as Magnezone, Sylveon, and Kyurem as well as miscellaneous specially oriented threats such as Salazzle and Volcarona. Snorlax also has access to many different coverage options that are interchangeable based on what its teammates are. Rock Tomb prevents Snorlax from being bait for Encore and Taunt users such as Primarina and Mandibuzz while also providing utility against Fire-types such as Choice item Rotom-H, Chandelure, and Volcarona. Defense Curl allows Snorlax to maximize its PP and fully commit to being a hard stall Pokemon, which helps secure the matchups against stall Kyurem and opposing non-Defense Curl Snorlax. Tackle allows it to maximize its PP while still being able to defeat other stall Pokemon such as Type: Null and Amnesia Slowbro. Double-Edge allows Snorlax to both beat certain Trick users such as Choice item Rotom-A and Choice Scarf Gardevoir while also inflicting recoil damage, which allows it to use Rest to maximize PP preservation. 252 HP and 252 Defense EVs along with an Impish nature allow Snorlax to have the best chance at taking a Choice Band-boosted Fishious Rend from Dracovish, and the extra 4 EVs are dumped into Special Defense. A Chople Berry allows Snorlax to take Fighting-type hits that would normally beat it such as a Superpower from Galarian Darmanitan or a Choice Band-boosted Close Combat from Conkeldurr.</p> <p>Overall, Snorlax is a straightforward Pokemon to use. However, there are a couple interesting matchups where setting up or clicking Counter immediately isn't optimal. Primarina is a good example of where you shouldn't immediately use Amnesia turn one. For Rock Tomb variants in matchups against Primarina and other known Encore or Taunt users, it is best to click Rock Tomb until Snorlax outspeeds the foe to prevent the opponent from locking Snorlax into Amnesia with Encore or disabling its setup moves with Taunt. Snorlax often struggles with setup Pokemon like Swords Dance Haxorus, Iron Defense Kommo-o, and Belly Drum Alolan Marowak as well as non-Choice item Fighting-types or ones that have a way to survive Counter like Reversal Hawlucha and Sturdy Sawk. Because of this, it often pairs well with Fairy-types such as Aqua Jet Primarina and bulky Quick Attack Sylveon. They are also able to take care of a lot of the counters like Urshifu-R and Sawk that normally beat Snorlax. Other good partners for Snorlax would include stallbreakers like Hex Dragapult and Choice item Rotom-A, both of which are able to deal with Pokemon that can outstall Snorlax such as Corviknight and Spite Galarian Corsola.</p> "
      },
      {
        "name": "Choice Band",
        "description": "<p>This set maximizes Snorlax's ability to tank hits and KO in return with its great coverage options. The 144 HP and 248 Defense investment lets Snorlax survive a Wood Hammer from Choice Band Rillaboom. The HP investment gives Snorlax ample bulk to survive Choice Scarf Porygon-Z's Hyper Beam, and the best possible odds to avoid a 2HKO from Choice Specs Magnezone. Giga Impact OHKOes neutral targets such as non-Stall Rotom-A. Its coverage options in Heavy Slam and Superpower hit Pokemon such as Sylveon, Porygon-Z, Hydreigon, and Ferrothorn for super effective damage. Counter lets Snorlax beat Choice item physical threats like Rillaboom, Choice Scarf Dracovish and Dracozolt, and Zeraora. Earthquake can be run in order to beat Alolan Marowak and Bulk Up Zeraora. Darkest Lariat can be used to beat Alolan Marowak and Choice Specs Dragapult. An alternative spread of 144 HP / 12 Atk / 248 Def / 104 SpD and a Careful nature can be run to also survive Choice Specs Porygon-Z and Choice Band Rillaboom, but will be unable to beat Trick + Recover variants of Porygon-Z. Lastly, a spread of 88 HP / 168 Atk / 252 SpD with an Adamant nature could be run to survive Choice Specs Porygon-Z and always OHKO even defensive Trick variants with Superpower, but will fail against physical attackers like Choice Band Rillaboom.</p> <p>Although Snorlax is a great physical attacker, it does lose to common physical threats such as Sawk, Choice Band Galarian Darmanitan, and Conkeldurr. This makes Fairy-type teammates such as Aromatisse and Chilan Berry Primarina great partners. They also appreciate Snorlax's ability to KO Steel-types such as Excadrill and Aegislash. Snorlax also pairs well with physical walls such as Galarian Corsola, as they have excellent defensive synergy, who in return appreciate Snorlax's ability to beat down wallbreakers like Sylveon or Swords Dance Excadrill.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 425798, "username": "pqs"}, {"user_id": 317056, "username": "dogknees"}, {"user_id": 457210, "username": "Le Creme Brule"}, {"user_id": 475993, "username": "Boat"}]}, {"name": "Grammar checked by", "members": [{"user_id": 297659, "username": "deetah"}, {"user_id": 336073, "username": "Rabia"}]}], "writtenBy": [{"user_id": 503725, "username": "smely socks"}, {"user_id": 442711, "username": "Mubs"}]}
  },
  "Zapdos": {
    "comments": "<h1>Other Options</h1> <p>Other options for Zapdos include running Leftovers over Maranga Berry for passive recovery and PP stalling alongside Roost, or something that exerts more offensive pressure such as the niche Choice Specs or Assault Vest. The Choice Specs set runs a faster EV spread of 220 HP / 12 Def / 24 SpA / 252 Spe with a Timid nature that lets it tank a Modest Choice Specs Draco Meteor from Dragapult and OHKO Haxorus with Hurricane. Its moveset consists of Thunder, Hurricane, Thunderbolt for a more accurate STAB move, and Heat Wave for coverage against Genesect and Ferrothorn. This set does lose to Disable users such as Spectrier and Pokemon with Sturdy such as Magnezone and Aggron, which the Maranga Berry set can win against.</p> <p>The Assault Vest set has an EV spread of 252 HP / 40 Def / 104 SpA / 16 SpD / 96 Spe with a Modest nature and the moves Heat Wave, Hurricane, Thunderbolt, and Ancient Power. The HP and Special Defense investments are for Choice Specs Necrozma, whereas the Defense investment guarantees the matchup versus bulky Urshifu-S if Hurricane hits; Thunderbolt can be used against Urshifu-R. The Speed investment allows you to outspeed bulkier sets for both Urshifu formes.</p> ",
    "sets": [
      {
        "name": "Maranga Berry",
        "description": "<h1>Set Description</h1> <p>Substitute and Roost help Zapdos stall and securely decrease the foe's PP. Thunderbolt is appreciated for Encore users like Primarina and Togekiss. Toxic, however, remains extremely useful and is needed on some teams to defeat Calm Mind users such as Necrozma, Stored Power Cresselia, and Unaware Clefable that break through Zapdos otherwise.</p> <p>Agility is preferred to have a cleaner matchup versus Regieleki and Zeraora, though this moveslot is more situational. Heat Wave can win against Ferrothorn, Kartana, and Genesect while also dealing super effective damage to threats such as Taunt Rillaboom and Metal Sound Magnezone. Hurricane can be used to deal with Urshifu-S but is unreliable and comes at the cost of having a shakier matchup versus Regieleki. Maranga Berry is main item for Zapdos to help it wall special attackers such as Necrozma and non-Choice Specs Sylveon reliably.</p> <h1>EVs</h1> <p>56 Speed EVs are used to outspeed Regieleki at +2, giving Agility sets a reliable matchup against it. This Speed tier also allows Zapdos to outspeed Adamant Dracozolt and Dracovish.</p> <p>The Special Defense investment along with a Calm nature allows Zapdos to live a Choice Specs Thunder from Regieleki as well as tanking a Hydro Cannon from Custap Berry Primarina. The rest of the EVs go into Defense to maximize physical bulk.</p> <h1>Usage Tips</h1> <p>In most cases, Zapdos will be clicking Substitute turn one to quickly start stalling and block any status moves from the likes of SubSeed Rillaboom and Galarian Corsola. Against locking moves such as Outrage, you should keep clicking Substitute until the move ends and then use Roost when the foe gets confused.</p> <p>Zapdos should use Thunderbolt instead of Substitute turn one against Encore users like Primarina and Togekiss, Trick users, and faster Taunt users like Tapu Fini. Against Pokemon like Regieleki and Zeraora, it is best to use Agility turn one to outspeed them on turn two, letting you click Roost and Substitute to PP stall them out.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 430787, "username": "PA"}, {"user_id": 501918, "username": "Here Comes Team Charm!"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 526135, "username": "doc1203"}]}
  },
  "Azumarill": {
    "sets": [
      {
        "name": "Assault Vest",
        "description": "<p>By virtue of its stellar Water / Fairy typing and good mixed bulk, Azumarill carves a niche as an offensive tank capable of dealing with top-tier threats like Choice item Porygon-Z, non-Roseli Berry Urshifu-R, and Haxorus. STAB Play Rough and Liquidation enable it to defeat Dragon- and Fire-types such as Haxorus, Kommo-o, and Volcarona. Aqua Jet gives Azumarill a way to pick off weakened foes like Choice item Rotom-H, Sawk, and Gardevoir. Superpower is an extremely important move in order to deal with Choice item Porygon-Z. The given EV spread ensures Azumarill will survive a Hyper Beam from Modest Choice Specs Porygon-Z and tank a Poison Jab from Jolly Choice Band Haxorus and Adamant Choice Band Urshifu-S. The rest of the EVs are put into Attack to maximize damage output. Alternatively, 132 HP / 124 Atk / 252 Def EVs with an Adamant nature let Azumarill survive a Choice Band Rock Wrecker from Crustle, but you lose the special bulk necessary to handle Choice Specs Porygon-Z. Since this alternative spread only defeats Choice Scarf Porygon-Z sets, Superpower becomes less of a necessity, meaning it can be replaced with Knock Off or Bulldoze instead, allowing Azumarill to defeat Substitute + Disable Dragapult or Magnezone.</p> <p>While Porygon-Z looks manageable at first glance with the help of Assault Vest, it sometimes runs a defensive Chople Berry set, utilizing Superpower's Attack drop to freely Recover and use Nasty Plot to reach +4 and OHKO Azumarill. Against Choice Band Sawk, it is best to use Aqua Jet turn one and then Play Rough, as it is likely that it is running Counter and will KO you if you use Play Rough, but there is the possibility of it using Poison Jab. Situations with the same guidelines include facing Alolan Marowak and Choice Band Crustle, if using the alternative spread. Despite being bolstered by Assault Vest, there are still special threats that Azumarill should try to avoid, like Choice Specs Primarina, Magnezone, and Porygon2. Azumarill enjoys having Kyurem as a partner, luring in threats such as Haxorus, Volcarona, and Urshifu-S, while Kyurem can deal with stall users like Slowbro, Mandibuzz, and Skarmory. Choice Specs Rotom-H also has great synergy with Azumarill, combating the likes of Chansey, Celebi, and Aegislash. In return, Azumarill can handle Dragon-types like Hydreigon and Kommo-o. Pokemon that can deal with physical wallbreakers pair well with Azumarill. Salazzle and Hawlucha are valued because of this, handling wallbreakers like Choice Band Galarian Darmanitan, Rillaboom, and Durant. In return, Azumarill can deal with Trick users like Choice item Rotom-H and Gardevoir. Due to Azumarill's mediocre Speed, it is often overwhelmed by faster Pokemon such as Rotom-W and Choice Band Diggersby. Therefore, faster Pokemon like Porygon-Z and Rillaboom pair well with it. In return, Azumarill can deal with bulky Dragon-types like Goodra, Unnerve Haxorus, and Assault Vest Kyurem.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 317056, "username": "Dogknees"}, {"user_id": 480297, "username": "Zioziotrip"}]}, {"name": "Grammar checked by", "members": [{"user_id": 297659, "username": "deetah"}]}], "writtenBy": [{"user_id": 430787, "username": "Poison Adhesive"}]}
  },
  "Corsola-Galar": {
    "sets": [
      {
        "name": "Stall",
        "description": "<p>Rest is used to recover HP after boosting and in order to remove status. It also is Galarian Corsola's primary tool for PP stalling. Amnesia is used to defend against special attackers lacking boosting moves like Kyurem and Weakness Policy Aegislash. Strength Sap doubles as both a recovery move and an Attack-lowering move, used to beat Pokemon like Dracovish, Choice item Excadrill, and Galarian Darmanitan. It should be used constantly against non-Trick Choice item Pokemon in order to heal off damage and fish for Cursed Body activations or stall until they can no longer deal significant damage. Night Shade is useful against Trick users, notably Rotom-H without much HP investment, which can be 3HKOed. It also is used to end a battle quickly, in order to avoid potential critical hits or secondary effects that stall often falls prey to. Will-O-Wisp can be used to shut down setup Pokemon like Crustle. Spite can be run in order to PP stall opposing PP stall Pokemon, like Meowstic and opposing non-Spite Galarian Corsola. The Defense investment and a Bold nature let Galarian Corsola take a Choice Band-boosted Fishious Rend from Adamant Dracovish, allowing Galarian Corsola to heal back up with Strength Sap. The rest of the EVs are dumped into Special Defense, which helps with rolls against Pokemon like Weakness Policy Aegislash. Galarian Corsola has many other benchmarks for its bulk: maximum HP and Defense maximizes Galarian Corsola's chance to beat Adamant Choice Band Dracozolt and rare four attacks Alolan Marowak. 252 HP and 148 Defense with a Bold nature can be run for Jolly Choice Band Dracozolt, while improving the Aegislash matchup further. 252 HP and 124 Special Defense is exactly what is needed to beat Aegislash, while 252 HP and 104 Special Defense with a Calm nature guarantees Galarian Corsola beats Dragapult. Generally, Galarian Corsola should set up with the respective defensive stat, heal off damage with Strength Sap or Rest, and then use Night Shade or Will-O-Wisp until the foe falls.</p> <p>Galarian Corsola struggles against Taunt users with significant damage output, like Life Orb Zeraora, and Taunt users with recovery, like Corviknight and Mandibuzz. Therefore, Taunt users like Whimsicott and Chople Berry Terrakion that can beat them serve as great partners. In return, Galarian Corsola can handle hyper offensive threats such as Galarian Darmanitan, Sawk, and Choice Item Excadrill. Dark-types, particularly Bisharp, non-Choice Scarf Hydreigon, Incineroar, and Mandibuzz are also particularly threatening against Galarian Corsola, as they can hit it super effectively and often carry Knock Off, Taunt, or setup options. To aid against then, Pokemon like Choice Band Crustle, Choice Band Galarian Darmanitan, and Primarina can all be used to beat the metagame's relevant Dark-types. Galarian Corsola can beat back threats like Arcanine and opposing Primarina in return. Lastly, certain Trick users like Gardevoir, Malamar, and heavily HP-invested Rotom-W can present a problem for Galarian Corsola, so Pokemon that do not mind being Tricked and can avoid the move altogether, like Excadrill and Whimsicott, can be good partners. In return, Galarian Corsola can handle Pokemon like Steelix, Galarian Darmanitan, and Choice item Haxorus for them.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 425798, "username": "pqs"}, {"user_id": 475993, "username": "Boat (phiwings99)"}]}, {"name": "Grammar checked by", "members": [{"user_id": 388157, "username": "A Cake Wearing A Hat"}]}], "writtenBy": [{"user_id": 276708, "username": "Alakazam"}]}
  },
  "Blissey": {
    "sets": [
      {
        "name": "Bulky Offense",
        "description": "<p>Blissey makes use of its great special bulk and versatile movepool to beat many special attackers in the 1v1 metagame. Hyper Voice is a solid STAB attack that bypasses Substitute, making it especially useful against Pokemon like PP stall Kyurem, Leech Seed Venusaur, and Moonblast Whimsicott. Shadow Ball hits Ghost-types like Chandelure and Gengar and has a 40% chance to lower the foe's Special Defense due to Serene Grace, while Flamethrower is useful against Steel-types like Magnezone, Ferrothorn, and non-Occa Berry Scizor. Calm Mind provides Blissey with offensive pressure and prevents it from losing to opposing Calm Mind users like Primarina as well as Amnesia users like Galarian Corsola. Scope Lens is useful versus stall Pokemon like Rotom-W, Galarian Corsola, and Slowbro, allowing Blissey to more easily score a critical hit in a longer game. A Timid nature with 216 Speed EVs allows Blissey to outspeed neutral-natured base 60 Speed Pokemon such as Primarina and Sylveon, while 52 Defense EVs let Blissey survive a Choice Band-boosted Bullet Punch from Scizor and avoid the 2HKO from Corviknight's Iron Head. An alternate EV spread of 52 Def / 252 SpA / 204 Spe with a Modest nature can also be used, which improves Blissey's odds versus bulky Pokemon like Yawn Sylveon and Togekiss while hitting the same defensive benchmarks. However, the reduced Speed makes it prone to losing to Speed-invested Modest Goodra, as well as a few uncommon sets such as fast Calm Mind + Encore Primarina or fast Body Press Magnezone.</p> <p>A few special attackers are capable of defeating Blissey and therefore deserve particular note. Porygon-Z can set up with Nasty Plot and use Eerie Impulse to minimize Blissey's damage. Choice Scarf Gardevoir utilizes Trick and Disable, only losing to an inconsistent Shadow Ball Special Defense drop or critical hit. Togekiss has positive chances to win thanks to its combination of Thunder Wave and Air Slash, while Choice Specs variants can simply spam Air Slash, which is also favorable to the opponent due to flinches. Additionally, Assault Vest Goodra can easily tank Blissey's moves and whittle it down using Acid Spray. While in most matchups Blissey can safely set up with Calm Mind turn one, against faster Pokemon with Encore or Trick, like Togekiss and Chandelure, Blissey should attack to prevent the possibility of getting locked into a non-damaging move. Taunt Whimsicott requires multiple successful 50/50s on Whimsicott's end, in order to simultaneously prevent Calm Mind boosting Hyper Voice and being hit from Flamethrower too often. Blissey also finds itself susceptible to many prominent physical attackers like Galarian Darmanitan, Urshifu-R, and Haxorus. As such, Blissey appreciates the support from Pokemon that are able to deal with these threats such as Crustle, defensive Arcanine, and Primarina. Despite Blissey's stallbreaking capabilities, it struggles to break past certain stall threats such as non-Defense Curl Snorlax and Chansey, which team options such as Curse Dragapult and Urshifu-R are able to manage.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 480297, "username": "zio"}, {"user_id": 317056, "username": "dogknees"}]}, {"name": "Grammar checked by", "members": [{"user_id": 297659, "username": "deetah"}]}], "writtenBy": [{"user_id": 501918, "username": "Here Comes Team Charm!"}]}
  },
  "Gardevoir": {
    "sets": [
      {
        "name": "Choice Scarf",
        "description": "<p>Gardevoir's high Special Attack and Special Defense along with its ability Trace and a number of good moves available to it make it a potent threat in the metagame. Psychic and Moonblast are Gardevoir's strongest STAB moves and synergize well with each other because they cover each other's type weakness. Choice Scarf allows Gardevoir to outspeed many potential threats such as Dragapult and non-Iron Tail Zeraora. Moonblast is used to OHKO Dragon-types like Dragapult and Dracovish. Psychic is used to cover Poison-types like Toxtricity and Gengar that Moonblast cannot hit supereffectively. The combination of Trick + Disable is used to beat Pokemon that have to set up such as Galarian Corsola. Trace helps against Pokemon like non-Iron Tail Zeraora and physical Intimidate users such as Arcanine.</p> <p>Gardevoir struggles with most Steel- and Ghost-types like Durant and Aegislash. Due to this, Ground-type Pokemon such as Gastrodon and Steelix synergize well with Gardevoir. In return, Gardevoir takes care of most Grass- and Water-types, such as Keldeo and Appletun, which Ground-types struggle to deal with. Dark-types like Hydreigon and Incineroar that can take care of Ghost-types such as Chandelure that Gardevoir is weak to are also good partners. Gardevoir also has a good matchup against most Fighting-types they lose to like Kommo-o and Conkeldurr.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 425798, "username": "pqs"}, {"user_id": 475993, "username": "Boat"}]}, {"name": "Grammar checked by", "members": [{"user_id": 302985, "username": "lotiasite"}]}], "writtenBy": [{"user_id": 475087, "username": "Inkreativ"}]}
  },
  "Magnezone": {
    "sets": [
      {
        "name": "Weakness Policy",
        "description": "<p>Thanks to its ability Sturdy, Magnezone beats most Choice item attackers, including Galarian Darmanitan, Urshifu-R, and Crustle. Thunderbolt and Flash Cannon are Magnezone's strongest STAB options, hitting Pokemon such as Primarina, Skarmory, and Fairy-types including Sylveon and Aromatisse, alongside Unnerve Haxorus. Electroweb allows it to beat opposing Sturdy Pokemon such as non-Choice Scarf Sawk whilst providing vital speed control against Pokemon like Eerie Impulse Porygon-Z and Dracovish. Metal Sound helps beat stall Pokemon like Type: Null and defensive Rotom-W, whilst Mirror Coat is an option to beat some special attackers Magnezone would otherwise be unable to deal with, such as opposing Choice Specs Magnezone. Magnezone's defensive investment allows it to live two Outrages from Choice Band Unnerve Haxorus and Surging Strikes from Choice Band Adamant Urshifu-R, and its Speed investment allows it to outspeed Wacan Berry Urshifu-R and Choice Band Urshifu-S after an Electroweb, alongside Speed tying other base 60 Speed Pokemon.</p> <p>While Magnezone beats most Water-types, Primarina can live a Thunderbolt and beat Magnezone with Torrent-boosted Sparkling Aria into Aqua Jet. So, Magnezone should use Electroweb on Turn 1 to avoid putting Primarina into Torrent range, and only then use Thunderbolt on Turn 2 for the KO. Assault Vest variants will unfortunately be able to beat Magnezone, so avoid this matchup. Against Urshifu-R, use Electroweb Turn 1, in order to beat both the common Choice Band variant and the viable Wacan Berry set, followed up by Thunderbolt. Be aware that the rare Choice Scarf Urshifu-R will require a Turn 1 Thunderbolt and will beat Magnezone if it uses Electroweb instead. While the Choice Band Rillaboom matchup seems cut and dry, Rillaboom can usually beat Magnezone without activating Weakness Policy by simply using Wood Hammer. Your opponent will have to misplay and assume a Choice Specs set. To prepare for this, always use Electroweb on the off chance that they do mispredict and use Superpower or High Horsepower. Magnezone struggles against Dragon-types such as Curse Dragapult, Mold Breaker Haxorus, Choice Scarf Dracovish, and Kommo-o. Because of this, Fairy-type partners such as Primarina and Sylveon are appreciated. They in turn enjoy Magnezone's support to deal with physical breakers such as Galarian Darmanitan and Crustle. Dragon-types such as Choice Scarf Unnerve Haxorus and Haban Berry Kommo-o are also good team options for Magnezone, being able to deal with the aforementioned Dragon-type threats that Magnezone cannot break through. In return, Magnezone beats Fairy-types like Sylveon and Aromatisse. Despite making use of Metal Sound, Magnezone is unable to KO Chansey in the 4 turns that it uses Seismic Toss. Teammates that can deal with Chansey include Fighting-types such as Urshifu-R, Urshifu-S, Sawk, and Conkeldurr, all of which subsequently appreciate Magnezone's ability to deter Fairy-types.</p> "
      },
      {
        "name": "Choice Specs",
        "description": "<p>Choice Specs Magnezone's STAB Thunderbolt and Flash Cannon hit Water- and Flying-type Pokemon like Primarina and Corviknight and Fairy-, Rock-, and Ice-type Pokemon like Sylveon, Crustle, and Galarian Darmanitan, respectively. Hyper Beam hits harder than either of Magnezone's STAB attacks against neutrally effective targets, like Choice Specs Porygon-Z, Dracovish, and Urshifu-S. Mirror Coat is useful against certain Choice item special attackers, like Chandelure and Gengar. Steel Beam can be used to OHKO specially defensive Aromatisse. Although relatively unreliable, Body Press is an option for the mirror Magnezone matchup. 80 HP and 68 Defense EVs are used to survive a Choice Band Urshifu-R's Surging Strikes, while 136 Speed is run to outspeed Adamant Crustle. The rest is put into Special Attack to maximize damage output.</p> <p>Magnezone will have issues against specially defensive walls that can easily sponge up Magnezone's attacks, such as Snorlax, Chansey, Porygon2, and Galarian Corsola. Magnezone therefore appreciates stallbreakers like Taunt Urshifu-S and Aromatisse, which can shut down these passive strategies and in return appreciate Magnezone's offensive pressure against opposing Urshifu-S and Aromatisse as well as against Urshifu-R. Magnezone also struggles with Mold Breaker Pokemon like Haxorus, Hawlucha, and Excadrill, as well as fellow Sturdy user Sawk, and thus also appreciates support from Pokemon like Substitute + Disable Dragapult, Aqua Jet Primarina, and Arcanine, which in return enjoy Magnezone's positive matchups against Pokemon like opposing Primarina, non-Babiri Berry Whimsicott, and Slowbro. Trick users like Rotom-A and Gardevoir also serve Magnezone well as partners, beating both the aforementioned specially defensive walls and some of the Mold Breaker Pokemon. They appreciate Magnezone's ability to handle Choice Band Galarian Darmanitan and Durant.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 276708, "username": "Alakazam"}, {"user_id": 317056, "username": "dogknees"}, {"user_id": 425798, "username": "pqs"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Estronic"}]}], "writtenBy": [{"user_id": 501316, "username": "zxgzxg"}, {"user_id": 276708, "username": "Alakazam"}]}
  },
  "Rhyperior": {
    "sets": [
      {
        "name": "Fast Choice Band",
        "description": "<p>Rhyperior uses its enormous Attack stat together with its high Base Power STAB moves to be a threat in the metagame. Rock Wrecker breaks through typical targets that are weak to it, such as Arcanine and Scyther, alongside neutral Pokemon such as Sylveon and Primarina. Earthquake is used to hit Electric- and Steel-types like Zeraora, Dracozolt, and non-Air Balloon Aegislash. Fling is used in tandem with Swords Dance to beat stall Pokemon such as Galarian Corsola, Snorlax, and Chansey. The Speed EVs allow Rhyperior to outspeed Centiskorch, while the Attack EVs make sure Rock Wrecker is able to OHKO most Primarina. The Special Defense and HP EVs allow Rhyperior to tank a Choice Specs-boosted Hyper Beam from Modest Porygon-Z. Rhyperior has a few alternative EV spreads to choose from. 236 HP / 44 Atk / 96 Def / 132 SpD with an Impish nature guarantees survival against Choice Band Galarian Darmanitan while still taking a Hyper Beam from Choice Specs Modest Porygon-Z. The unneeded remaining EVs are invested into Attack for maximum damage output. An anti-Choice Specs Magnezone set can also be used, with 72 HP EVs and 244 Special Defense EVs alongside a Careful nature guaranteeing survival against Choice Specs-boosted Flash Cannon. If this spread is used, Bulldoze will be required over Fling in order to outspeed Magnezone on turn 2.</p> <p>To beat stall Pokemon such as Galarian Corsola, Snorlax, and Chansey, use Fling to remove Choice Band, and then use Swords Dance to maximize Rhyperior's Attack stat. Fling should also be used against Crustle to break its Sturdy before finishing it off with Rock Wrecker. Fairy-types such as Aromatisse, Primarina, and Sylveon pair well with Rhyperior, since they can deal with Dragapult, Urshifu-R, and Slowbro. Rhyperior can deal with Steel-types like non-Air Balloon Aegislash, Magnezone, and Steelix that threaten the aforementioned Fairy-types. Dragapult is an excellent partner for Rhyperior, since it can cover its weakness to Water- and Grass-types such as Choice Band Dracovish, Rotom-W, Celebi, and Rillaboom. In return, Rhyperior deals with the aforementioned Fairy-types.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 480297, "username": "zioziotrip"}, {"user_id": 317056, "username": "dogknees"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Estronic"}]}], "writtenBy": [{"user_id": 418753, "username": "pazza"}]}
  },
  "Togekiss": {"sets": [{"name": "Thunder Wave MarangaBerry"}, {"name": "Choice Scarf"}]},
  "Porygon-Z": {
    "sets": [
      {
        "name": "Chople Berry",
        "description": "<p>This Porygon-Z set functions as a menacing wallbreaker due to Nasty Plot and a terrifying Adaptability-boosted STAB move in Hyper Beam. Nasty Plot boosts Porygon-Z's Special Attack to astronomical levels, letting it power through walls like Arcanine, Chansey, Corviknight, and Slowbro. Hyper Beam is Porygon-Z's strongest STAB move and can OHKO certain Pokemon without a boost, such as non-Unnerve Haxorus and Rillaboom. Eerie Impulse, when used with Recover, allows Porygon-Z to break through Primarina and Choice Specs Magnezone. 132 EVs in HP and 252 EVs in Defense alongside Chople Berry allow Porygon-Z to survive a Close Combat from Choice Band Urshifu-R, with Bold beating Adamant variants and Modest only beating Jolly variants, as well as an Outrage from Choice Band Mold Breaker Haxorus. 72 EVs in Speed are run to outspeed non-Jolly Corviknight as well as Pokemon like Choice Specs Modest Magnezone and bulky Rillaboom. The rest is put into Special Attack to maximize damage output. Alternatively, Porygon-Z can run Electroweb instead of Eerie Impulse and a spread of 92 HP / 252 Def / 28 SpA / 136 Spe to beat Choice Band Sawk and Avalugg while outspeeding Choice Band Adamant Dracovish. Another spread it can use is 184 HP / 248 Def / 32 SpA / 44 Spe with Speed Swap and Uproar replacing Eerie Impulse and Recover to reliably defeat Zeraora, stall Rotom-A, and Substitute users like Whimsicott.</p> <p>You want to think carefully when using this Porygon-Z set, as it has many matchups requiring specific play. Against Primarina, Porygon-Z should always use Eerie Impulse immediately to survive the possible Choice Specs Hydro Cannon. If it is an Assault Vest or Chilan Berry variant, Porygon-Z only needs to use Eerie Impulse until it's at -4, heal off damage taken shortly afterwards, Nasty Plot till at least +4, and OHKO with Hyper Beam. To figure out whether the Primarina is Choice Specs or not, if -2 Hydro Cannon deals 58% of damage or more against the standard EV spread, that indicates that it is using Choice Specs, so you can end the battle after one use of Nasty Plot instead of two. Against Choice Specs Magnezone, the same process comes into play; however, you do not need to set up with Nasty Plot, as Hyper Beam 2HKOes. Against stall Arcanine, use Nasty Plot once, as +1 Hyper Beam OHKOes even if they use Snarl. Usually, you will use Hyper Beam first against particular Pokemon that aren't naturally specially defensive, such as Choice Scarf Galarian Darmanitan and non-Unnerve Choice Band Haxorus. Porygon-Z appreciates Chilan Berry Primarina as a partner, which handles wallbreakers like opposing Choice item Porygon-Z, Choice Band Galarian Darmanitan, and Shell Smash Crustle. In return, Porygon-Z can deal with specially defensive Pokemon like Chansey, Slowbro, and Goodra. Porygon-Z is relatively frail even with this set's bulkier spread and cannot take many hits; thus, bulkier partners such as Magnezone and Arcanine are appreciated. Having partners that can take on Ghost-types like Dragapult, Galarian Corsola, and Gengar is imperative, as Porygon-Z has no moves capable of hitting them. Dark-types like Mandibuzz and Taunt Incineroar help alleviate this weakness. In return, Porygon-Z can handle one of their biggest issues: Urshifu-R.</p> "
      },
      {
        "name": "Choice Specs",
        "description": "<p>Porygon-Z is an extremely strong special attacker due to its high Special Attack and Adaptability, and when paired with Choice Specs, this makes it one of the biggest offensive threats in the metagame. Hyper Beam OHKOes threats like Togekiss, Sylveon, and Arcanine. Trick is mainly used against typical stall-oriented Pokemon such as Torment Skarmory, Chansey, and Galarian Corsola to lock them into one move, allowing Porygon-Z to set up with Nasty Plot and KO them once boosted, barring Galarian Corsola which will be PP stalled because Porygon-Z cannot touch it without Dark Pulse. Dark Pulse is able to defeat Alolan Marowak and non-Focus Blast Choice Scarf Gengar, Dark Pulse can also hit Ghost-types, which Hyper Beam can't touch, in specific Galarian Corsola and Alolan Marowak. Uproar can be used over Dark Pulse on lower Special Attack set's to 2HKO non-Mirror Coat Magnezone and Whimsicott. The given EVs allow Porygon-Z to survive Grassy Glide from Choice Band Rillaboom and outspeed non-Choice Scarf Dracozolt and Dracovish, as well as OHKO Alolan-Marowak. An alternative EV spread of 144 HP / 60 Def / 72 SpA / 232 Spe with a Modest nature can be run in order to survive Choice Scarf Chandelure and Modest Scarf Draco Meteor from Hydreigon. However, the drop in Special Attacker makes the Alolan-Marowak match up unreliable, and can hurt with rolls against particularly bulky threats, like uninvested Snorlax. Another EV spread of 4 HP / 200 Def / 72 SpA / 232 Spe can be used to beat Life Orb Rillaboom. Lastly, Porygon-Z can use a spread of 144 HP / 60 Def / 96 SpA / 208 Spe or 148 Def / 152 SpA / 208 Spe with the nature Timid to out speed Adamant Haxorus and Urshifu, alongside doing all that you did before, depending on which one you use. Choice Specs Porygon-Z in general can sacrifice investment in either bulk, power, or speed to beat or get close to beating specific threats, like Excadrill, or fully invest in Speed to speed tie other non-Choice Scarf Porygon-Z. Generally, due to the power Choice Specs gives to Porygon-Z, it has a lot more room to invest in either overwhelming offense or bulk.</p> <p>Trick should be used immediately against Pokemon such as Skarmory, Chansey, Galarian Corsola, and Crustle. Against Skarmory, simply rotate between Hyper Beam and Recover if they're running a damaging move; if you lock them into a status move, simply click Hyper Beam twice. Against Chansey, use Trick followed by Nasty Plot twice to get to +4 and then OHKO with Hyper Beam. Against Galarian Corsola, simply Trick and PP stall it, as it won't have any moves that can deal damage to Porygon-Z. Similarly to Galarian Corsola, Porygon-Z needs to PP stall Crustle. Regardless of what item you receive back, spam Recover until the foe runs out of PP. Due to the multi-hit nature of Rock Blast, the matchup is more favorable for Crustle but is not guaranteed If Crustle goes for Shell Smash on your Trick, simply click Hyper Beam twice, as they will be Choice-locked and unable to attack. Porygon-Z struggles against Fighting-type Pokemon and Pokemon with Fighting-type coverage such as Urshifu-R, Sawk, Hawlucha, and Haxorus. Fairy-type Pokemon, specifically Primarina and Sylveon, go well with Porygon-Z, since they can cover the Fighting-type weakness whilst simultaneously appreciating Porygon-Z's ability to deal with their threats such as Chansey, Rillaboom, Rotom-H as well as Poison-types such as Toxtricity and Venusaur. Porygon-Z needs to be wary of common Chilan Berry and Assault Vest users, mainly Primarina, so consider teammates such as Zeraora and Rillaboom.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 480297, "username": "zio"}, {"user_id": 317056, "username": "dogknees"}, {"user_id": 276708, "username": "Alakazam"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Estronic"}, {"user_id": 384270, "username": "martha"}]}], "writtenBy": [{"user_id": 430787, "username": "PA"}, {"user_id": 418753, "username": "pazza"}]}
  },
  "Rotom-Heat": {
    "sets": [
      {
        "name": "Choice Specs",
        "description": "<p>Rotom-H's role in the metagame is to be a powerful special attacker while also being a great stallbreaker withTrick. Overheat hits Steel- and Grass-types such as Aegislash, Corviknight, Ferrothorn, and Celebi. Thunderbolt hits Flying- and Water-types, such as Mandibuzz, Primarina, Milotic, and Toxapex. Trick is used to Choice-lock stall Pokemon like Galarian Corsola and Type: Null into setup moves so that they can't touch Rotom-H. Rest is used to recover HP against Pokemon that got Choice-locked into attacks like Galarian Corsola with Night Shade. The EVs allow Rotom-H to outspeed maximum Speed neutral-natured base 60s, like Incineroar, survive three Night Shades or Seismic Tosses from Galarian Corsola or Chansey, and stall it out with Rest after crippling it with Trick, and 2HKO Incineroar and Arcanine. Alternatively, a spread of 240 HP / 80 Def / 140 SpA / 48 Spe with a Bold Nature can be run, in order to always beat Urshifu-S, while still outspeeding base 60s. This will make the Primarina matchup much less reliable, however.</p> <p>Due to Rotom-H being a slow Fire-type, it is easily taken out by Rock-types and fast Water-types, such as Rhyperior, Tyranitar, Crustle, Keldeo, and Blastoise. Bulky Water-types such as Gastrodon and Pyukumuku can deal with this weakness. Rotom-H helps these Pokemon in return by being able to OHKO Grass-types like Ferrothorn, Venusaur, Rotom-C, and Celebi. Due to Rotom-H's attacks being Fire- and Electric-type, Dragon-types such as Haxorus, Hydreigon, and Dracovish can tank Rotom-H's attacks and KO it in return. Fighting-types such as Choice Specs Keldeo and bulky Choice Band Sawk can deal with these Dragon-types. In return, Rotom-H provides a check to both Flying- and Grass-types and also resists Electric-type attacks from Zeraora, Rotom-C, and Togedemaru.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 425798, "username": "pqs"}, {"user_id": 480297, "username": "zioziotrip"}]}, {"name": "Grammar checked by", "members": [{"user_id": 388157, "username": "A Cake Wearing A Hat"}]}], "writtenBy": [{"user_id": 418753, "username": "pazza"}]}
  },
  "Rotom-Wash": {
    "sets": [
      {
        "name": "Kee Berry",
        "description": "<p>Rotom-W has solid defensive stats that helps it check viable Pokemon in the metagame such as Choice Band Urshifu-R and Choice Scarf Haxorus. Eerie Impulse is used to drastically weaken special attackers such as Goodra and Primarina, while Will-O-Wisp cripples physical attackers such as Dracovish, Galarian Darmanitan, and non-Lum Berry Crustle. Rotom-W can use Rest after crippling the foe enough to avoid getting KOed before waking up. Thunderbolt is Rotom-W's only non-status attack and is mainly used to inflict chip damage. Alternatively, Rotom-W can use Hydro Pump to deal damage to Pokemon that aren't affected by Will-O-Wisp such as Arcanine and Incineroar, and it allows Rotom-W to damage Zerarora. This EV set alongside Thunderbolt allows Rotom-W to outstall Seismic Toss users, outspeed base 60 Speed Pokemon, OHKO uninvested Urshifu-R, and take a Choice Band-boosted Superpower from Ushifu-R and both Mold Breaker and Unnerve Choice Scarf Haxorus. When running Hydro Pump, the EV spread should be 240 HP / 220 Def / 48 Spe instead, which maintains Speed and maximizes defensive presence. This EV set is mainly to boost the percentage to survive certain highly-invested attacks such as Giga Impact from Galarian Darmanitan.</p> <p>This Rotom-W set is used as a stall set. The main idea is to cripple the foe with Will-O-Wisp or Eerie Impulse to the point where their attacks are unable to 2HKO Rotom-W so it can safely recover with Rest. After sufficiently crippling the foe, Rotom-W can use Will-O-Wisp's chip damage and its attacking move of choice to KO the foe. In certain cases, Rotom-W can use Thunderbolt or Hydro Pump without crippling the foe if it outright wins due to the matchup; it can use Thunderbolt to OHKO Gyarados or Hydro Pump to OHKO defensive Arcanine. There are some Pokemon that are able to KO Rotom-W before it sets up, such as Choice Band Haxorus and Sylveon. Thus, teammates such as Rillaboom, Galarian Darmanitan, and Magnezone work well with Rotom-W. Rotom-W is also very susceptible to Taunt users such as Incineroar and Trick users such as Porygon-Z, so Pokemon that are immune or aren't affected by these status moves such as Galarian Darmanitan work very well with Rotom-W. Rotom-W should be careful of Mold Breaker Pokemon such as Excadrill and Choice Band Haxorus that can use Earthquake while ignoring Levitate and Unnerve Haxorus, which can prevent Kee Berry from activating.</p> "
      },
      {
        "name": "Choice Scarf",
        "description": "<p>Rotom-W makes for an excellent Choice Scarf user with its great STAB combination, natural bulk, and access to Trick. Hydro Pump is Rotom-W's strongest STAB option, dealing with Pokemon that are weak to Water such as Arcanine, Diggersby, and Rhyperior along with neutral targets such as non-Mirror Coat Magnezone and Zeraora. Thunderbolt targets bulkier threats that Hydro Pump cannot break through such as Primarina and Urshifu-R. Trick can stop certain stall Pokemon such as Galarian Corsola and Type: Null by locking them into either a setup move or an attacking move that can't 3HKO, with Rotom-W using Rest at intervals in order to avoid getting KOed. The HP investment means Rotom-W will always survive three Night Shades from Galarian Corsola, and the Defense investment ensures survival against Choice Band Urshifu-S's Close Combat. The Speed investment with a Choice Scarf allows Rotom-W to outspeed +2 Adamant Crustle, while the remaining EVs are invested into Special Attack for maximum damage output.</p> <p>While Trick allows Rotom-W to beat most stall Pokemon, Whimsicott can use Substitute before Rotom-W can use Trick thanks to Prankster. Aromatisse can also easily take hits from Rotom-W or lock it into Trick with Encore if Rotom-W uses Trick to stop Aromatisse's Substitute + Disable strategy. Rotom-W struggles with specially defensive attackers, such as Sylveon and Snorlax, so it appreciates help from physical wallbreakers such as Rillaboom and Galarian Darmanitan. In return, Rotom-W checks the Fire-types that beat both Rillaboom and Galarian Darmanitan along with other threats such as Choice Band Skarmory and Sap Sipper Azumarill. Due to its lack of coverage, Rotom-W is walled by most Dragon- and Grass-types, so Fairy-types such as Primarina and Sylveon are appreciated to help with the former. In return, Rotom-W checks Steel-types such as Corviknight and Magnezone.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 480297, "username": "zio"}, {"user_id": 317056, "username": "dogknees"}, {"user_id": 276708, "username": "Alakazam"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Estronic"}, {"user_id": 302985, "username": "lotiasite"}]}], "writtenBy": [{"user_id": 205691, "username": "ForgottenOnes"}, {"user_id": 501316, "username": "zxgzxg"}]}
  },
  "Conkeldurr": {
    "sets": [
      {
        "name": "Flame Orb",
        "description": "<p>Conkeldurr uses its high Attack stat and sizeable bulk to act as a strong bulky offense Pokemon in the 1v1 metagame. Using Protect turn one allows Flame Orb to activate Guts for free against opponents like Galarian Darmanitan and Choice Specs Dragapult. A Guts-boosted Close Combat allows Conkeldurr to OHKO many Pokemon such as Hydreigon, Tyranitar, and Ferrothorn. Many matchups may require or benefit from Mach Punch, such as Sawk, Crustle, and Galarian Darmanitan. Against Crustle, use Mach Punch turn 1 instead of Protect or Close Combat, as this allows Conkeldurr to survive Counter and KO it the next turn with a Guts-boosted Close Combat. Against Sawk, use Mach Punch on turns 1, to avoid being OHKOed by Counter, and either use Close Combat if they used Counter, or use another Mach Punch if they used Close Combat. Using a Guts Boosted Mach Punch against Galarian Darmanitan removes the possibility of losing to Choice Band. The given HP and Special Defense investment allows Conkeldurr to tank a Draco Meteor from Choice Specs Dragapult, and the HP and Defense EVs allow Conkeldurr to tank Choice Scarf Dracovish. A Brave nature along with 29 IVs in speed allow Conkeldurr to underspeed minimum speed Aegislash, which allows it to hit it with a Guts-boosted Knock Off in its Blade forme. Guts and Flame Orb also have some defensive capabilities. Notably, Guts allows Conkeldurr to beat stall Rotom-A because it can ignore Will-O-Wisp, which is key to their defensive capabilities.</p> <p>Conkeldurr works well with Steel-type Pokemon such as Excadrill and Steelix that can defeat its Fairy-type counters such as Sylveon and Togekiss. In return, Conkeldurr can beat opposing Snorlax and Rotom-W. Conkeldurr also struggles with especially strong wallbreakers such as Choice Band Dracovish and Choice Band Dracozolt. Because of this, Pokemon such as Crustle and Strength Sap Galarian Corsola that can survive their attacks make good teammates. In return, Conkeldurr can beat many Steel-types such as Duraludon, and strong offensive Pokemon such as Choice Specs Dragapult. It also appreciates teammates such as Incineroar who can beat Psychic-types such as Gardevoir. In return, Conkeldurr can beat many Steel- and Ground-types such as Excadrill, Steelix, and Choice Band Bisharp.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 276708, "username": "Alakazam"}, {"user_id": 425798, "username": "pqs"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "The Dutch Plumberjack"}]}], "writtenBy": [{"user_id": 457210, "username": "Le Creme Brule"}]}
  },
  "Sawk": {
    "sets": [
      {
        "name": "Choice Band",
        "description": "<p>8 HP and 92 Defense EVs allow Sawk to always survive a Life Orb Earthquake from Jolly Excadrill. 180 Speed EVs with a Jolly nature allow Sawk to outspeed Adamant Excadrill. 228 Attack EVs are leftover and allows Sawk to have the most damage it can while still remaining bulky and fast enough to do its jobs. Close Combat is Sawk's best STAB move and works well with Sturdy, beating Pokemon like Galarian Darmanitan and Crustle. Knock Off allows Sawk to deal with the common Ghost-types in 1v1 such as Chandelure, Gengar, and Choice Specs Dragapult. Counter allows Sawk to take full advantage of its Sturdy ability, as it can survive a physical attack and OHKO the foe, which is useful against Dracovish and Dracozolt. Low Sweep enables Sawk to beat Electroweb Magnezone. Poison Jab allows Sawk to beat Whimsicott and offensive Sylveon. Fire Punch can be used to beat Scizor. Earthquake allows Sawk to OHKO Toxtricity.</p> <p>Good teammates for Sawk include Taunt users such as Mandibuzz and Corviknight as Sawk struggles with stall. In return, Sawk can beat many stall breakers such as Crustle, Dracozolt, and Galarian Darmanitan. Sawk pairs well with Steel-type Pokemon such as Excadrill and Aegislash, as it beats many Fire-, Fighting-, and Ground-types for them. In return, these Steel-types can beat the many Fairy-types that beat Sawk, such as Aromatisse and non Choice Specs or Quick Attack Sylveon.</p> "
      },
      {
        "name": "Choice Scarf",
        "description": "<p>Close Combat is the STAB move of choice, as not only is it the strongest Fighting move available, the Defense drops rarely matter. Every other move for Sawk acts as a coverage option. Knock Off is a strong option to cover Ghost-types like Dragapult, Gengar, and Chandelure. Poison Jab is helpful for beating Fairy-types, mainly Togekiss and non-Kebia Berry Whimsicott. Earthquake helps beat non-Fake Out Zeraora and Toxtricity. Fire Punch is a helpful option for picking off certain Bug-types like Durant and Scizor, while Thunder Punch can be used for Water-types like Gyarados. Jolly Nature helps Sawk outspeed Zeraora.</p> <p>Physically defensive Pokemon like Galarian Corsola, Arcanine, and Milotic are a serious threat to Sawk, as they can easily survive and respond to its attacks. Mold Breaker Haxorus and Neutralizing Gas Galarian Weezing also counter Sawk, as they can survive an attack and OHKO through Sturdy. Similarly, priority from Quick Attack Sylveon can 2HKO Sawk before Poison Jab can 2HKO Sylveon. Special attackers such as Goodra or Dragapult can help defeat physically defensive Pokemon and appreciate Sawk's ease in beating Steel- and Dark-types like Excadrill and Incineroar. Meanwhile, specific counters to Haxorus or Galarian Weezing such as Excadrill can be used to beat them, while Sawk beats opposing Ground- or Fire-types like Excadrill and Chandelure.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 475993, "username": "Boat"}, {"user_id": 425798, "username": "pqs"}, {"user_id": 276708, "username": "Alakazam"}]}, {"name": "Grammar checked by", "members": [{"user_id": 241023, "username": "Kris"}, {"user_id": 232216, "username": "The Dutch Plumberjack"}]}], "writtenBy": [{"user_id": 457210, "username": "Le Creme Brule"}, {"user_id": 316445, "username": "lost heros"}, {"user_id": 276708, "username": "Alakazam"}]}
  },
  "Whimsicott": {
    "sets": [
      {
        "name": "Leech Seed Stall",
        "description": "<p>Whimsicotts ability Prankster, along with the combination of Leech Seed, Substitute, and Protect, allows it to Leech Seed stall most non-Leech Seed-immune Pokemon, given that it can survive an attack. Protect and Substitute are essential to make the most of Leech Seed recovery, while Protect has the added bonus of being used to scout for moves such as Trick and Taunt, with Prankster Substitute and Taunt serving to neutralize those threats respectively. Taunt also serves the purpose of preventing the use of recovery from opposing Pokemon such as Galarian Corsola and stall Snorlax with the option of Moonblast to help against Pokemon that otherwise beat Whimsicott, such as Urshifu-S, Mandibuzz, and Grass-types such as Rillaboom and opposing Whimsicott. Occa Berry alongside 248 HP EVs, 152 Defense EVs, and a Bold nature allows Whimsicott to always survive Alolan Marowak's Flare Blitz and Choice Specs Rotom-H's Overheat at -2. The remaining EVs are invested into Special Defense for maximum special bulk. Babiri Berry is another option, allowing Whimsicott to set up on Steel-types such as Aegislash and Magnezone. If Babiri Berry is used, an alternative spread of 248 HP / 140 Def / 120 SpD is required to survive against the aforementioned Steel-types, as well as Moonblast from Choice Specs Primarina.</p> <p>When using Whimsicott, most positive matchups are won by using Leech Seed Turn 1 and alternating between clicking Protect and Substitute. If you survive the first hit, Leech Seed stalling with Protect into Substitute will usually let you regain around 25% every two turns, allowing you to avoid all damage behind a Protect or a Prankster Substitute until the foe has lost its HP. Protect should always be used immediately to scout for Trick from common Choice-item Pokemon such as Rotom-H and Togekiss. If Rotom-H uses Overheat instead of Trick, using Substitute twice on Overheat followed by Leech Seed is optimal to minimize Whimsicott's chance of losing to poor RNG. It should also be noted that Gardevoir is an outlier, as it is a Choice item Trick user that is able to defeat Whimsicott due to Trace, which allows for a Prankster Trick. Whimsicott primarily struggles with Grass-types that are immune to Leech Seed, so Fire-types such as Arcanine and Incineroar make great partners. Whimsicott, in return, helps with their weak matchups against Water-types such as Primarina and Dracovish. Whimsicott also struggles with Ice-types and Dark-types not weak to Moonblast such as Avalugg, Galarian Darmanitan, and Incineroar, making Fighting-types such as Urshifu-R and Sawk great partners. Whimsicott, in return, helps them against Fairy-types such as Primarina.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 474883, "username": "Waylaid"}, {"user_id": 317056, "username": "dogknees"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Estronic"}]}], "writtenBy": [{"user_id": 442711, "username": "Mubs"}]}
  },
  "Darmanitan": {
    "sets": [
      {
        "name": "Life Orb",
        "description": "<p>Life Orb Darmanitan solidifies itself as a huge offensive threat in the metagame thanks to its great ability in Sheer Force and high base Attack stat. Flare Blitz is Darmanitan's strongest physical STAB and Sheer Force-boosted move used to defeat prevalent Pokemon like Aegislash and Corviknight. Will-O-Wisp is crucial for allowing Darmanitan to defeat Pokemon with the ability Sturdy, such as Steelix and Choice Band Avalugg. Taunt helps Darmanitan break stall-oriented Pokemon like Galarian Corsola and Type: Null while solidifying its matchup with Yawn Sylveon. Superpower helps Darmanitan deal with Normal- and Dark-type Pokemon such as Porygon-Z and Tyranitar. 8 HP and 52 Defense EVs allow Darmanitan to survive a Adamant Choice Band Steelix's Earthquake after a burn. A Jolly nature with 216 Speed EVs allows Darmanitan to outspeed maximum Speed Choice Specs Porygon-Z. The remaining EVs are invested in Attack to maximize Darmanitan's damage.</p> <p>Darmanitan's Fire typing leaves it vulnerable to common Water-type Pokemon like Primarina and Rotom-W. As such, teammates with strong Grass-type coverage like Celebi and Rillaboom serve as great teammates for it. Darmanitan in return helps deal with Fairy-type Pokemon the previously listed Pokemon would have trouble with, such as Sylveon and Hatterene. Similarily, Dragon-type Pokemon like Kyurem and Kommo-o also make for great teammates, as they can also counter Water-type Pokemon like Rotom-W and Gastrodon and also appreciate Darmanitan's ability to beat most Fairy-type Pokemon. Fairy-type Pokemon themselves like Gardevoir and Sylveon also value Darmanitan's Fire-type coverage for defeating Steel-type threats like Aegislash and Corviknight. These Fairy-type Pokemon offer Darmanitan support in dealing with Dragon-type Pokemon that Darmanitan would otherwise be vulnerable to, like Dragapult and Kommo-o.</p> "
      },
      {"name": "Choice Scarf"}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 474883, "username": "Waylaid"}, {"user_id": 317056, "username": "dogknees"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Estronic"}]}], "writtenBy": [{"user_id": 481177, "username": "Maki's Fox"}]}
  },
  "Darmanitan-Galar": {
    "sets": [
      {
        "name": "Choice Band",
        "description": "<p>Galarian Darmanitan is a great wallbreaker with its excellent Attack, ability Gorilla Tactics, good Speed, and wide movepool. Icicle Crash allows Galarian Darmanitan to take care of Dragon- and Flying-type Pokemon such as Goodra and Mandibuzz. Flare Blitz makes Galarian Darmanitan able to take on Corviknight, Chople Berry Ferrothorn, and non-Occa Berry Whimsicott, while Earthquake OHKOes Alolan Marowak, Choice Specs Chandelure, and Aegislash, more reliably than Flare Blitz. Superpower is used to OHKO Chansey, non-Chople Berry variants of Incineroar, Tyranitar, and Snorlax, as well as Steel-types like bulky Choice Specs Duraludon. Giga Impact can be used as a powerful neutral move to beat Sylveon, Dracovish, Gastrodon, and non-Chilan Berry Primarina. Lastly, Stone Edge can be used over Earthquake to be able to OHKO stall Rotom-H. An alternative spread of 8 HP / 96 Atk / 168 Def / 236 Spe can be run in order to survive a Choice Band Rillaboom's Grassy Glide in Grassy Terrain, while still outspeeding base 80 Pokemon, like Mamoswine, at the cost of rolls against Pokemon like Gastrodon. 48 HP / 16 Atk / 244 Def / 200 Spe with a Jolly nature lets you tank a Choice Scarf Iron Head from Excadrill, while outspeeding non-Choice Scarf variants.</p> <p>Galarian Darmanitan struggles with fast Fire- and Steel-types such as Volcarona and Durant, so Rhyperior, Crustle, and Choice Specs Dragapult make great partners for it. In return, Galarian Damanitan can take care of Corviknight and Aegislash for them. Galarian Darmanitan also struggles with Choice Scarf Dragon-types such as Dracovish and Haxorus, so partners such as Primarina, Galarian Weezing, and Choice Scarf Hydreigon are good to have. In return, Galarian Darmanitan can take on certain stall threats like Type: Null and Snorlax for them. Galarian Darmanitan also needs partners like Galarian Corsola and Conkeldurr that can take on Crustle and Sawk. In return, Galarian Darmanitan beats Pokemon such as Togekiss and Whimsicott.</p> "
      },
      {
        "name": "Choice Scarf",
        "description": "<p>Galarian Darmanitan is one of the best physical attackers and Choice Scarf users due to its great ability in Gorilla Tactics, great Attack stat, above average Speed stat, and wide movepool. Icicle Crash allows Galarian Darmanitan to beat Dragapult, non-Yache Berry Whimsicott, and Choice Band Haxorus. Flare Blitz allows Galarian Darmanitan to take on Steel-types like Excadrill and Ferrothorn. Superpower lets Galarian Darmanitan beat Tyranitar, while Earthquake allows it to secure the OHKO against most Fire-types such as Chandelure and Alolan Marowak, most of the time. Stone Edge can be used over either Superpower or Earthquake in order to beat Rotom-H while still hitting the aforementioned Fire-types, but its shaky accuracy makes using Earthquake better in general. 8 HP and 180 Defense allows for Galarian Darmanitan to survive a Fishious Rend from non-Adamant Choice Band Dracovish, as well as a Grassy Glide from Choice Band Rillaboom, and an Iron Head from uninvested Corviknight after Flare Blitz recoil, while 224 Speed EVs allows it to outpace Timid or Modest Choice Scarf Porygon-Z, depending on Galarian Darmanitan's chosen nature. Adamant can help out with rolls against bulkier Pokemon like Mandibuzz. An alternative spread of maximum Attack and Speed can be run in order to speed tie other base 95s, while ensuring the best possible rolls against Pokemon like Mandibuzz.</p> <p>Galarian Darmanitan has trouble with Sturdy users such as Crustle, Avalugg, and Sawk, so partners such as Aromatisse and Choice Band Haxorus pair well with it. In return, Galarian Darmanitan can take on troubling Pokemon such as Dragapult, opposing Choice Band Haxorus, and Whimsicott for them. Galarian Darmanitan also struggles with bulky Pokemon such as King's Shield Aegislash, Corviknight, and Galarian Corsola, so partners such as Choice Specs Hydreigon and Volcarona help with these Pokemon. In return, Galarian Darmanitan can take on Dragapult, Whimsicott, and Excadrill. Galarian Darmanitan also has trouble with faster Choice Scarf Pokemon such as Haxorus and Hydreigon, so having partners such as Togekiss and Conkeludurr can be beneficial. In return, Galarian Darmanitan helps deal with threatening Pokemon like Corviknight.</p> "
      },
      {
        "name": "Zen Mode",
        "description": "<p>Endure allows Galarian Darmanitan to reliably activate Zen Mode and its Salac Berry, giving it massive boosts in Speed and Attack as well as a newfound partial Fire typing, notably allowing it to consistently beat other Galarian Darmanitan variants, Hydreigon, Durant, and Haxorus. Icicle Crash and Flare Blitz are Galarian Darmanitan-Z's strongest STAB options and hit threats such as Haxorus, Goodra, Hydreigon, and Dragapult, as well as Ferrothorn, Excadrill, and Durant respectively. The two moves also provide good neutral coverage, as the combination of them is only resisted by Fire- and Water-types, many of which Choiced Galarian Darmanitan struggles with anyway. The last moveslot has a couple of different options: Encore can shut down stallers like Galarian Corsola and physically defensive Corviknight, Reversal can potentially provide a 200-Base Power coverage move to blow away threats like Choice Band Snorlax and Dracovish, Substitute gives Galarian Darmanitan-Z the chance to beat Aegislash, and Earthquake provides a more reliable way to hit Chandelure. 180 Speed EVs ensure that Galarian Darmanitan-Z will outspeed Choice Scarf Gengar, Choice Scarf Durant, and everything slower after transforming into its Zen Mode forme and activating its Salac Berry. 116 Special Defense EVs ensure that Galarian Darmanitan-Z always tanks Choice Scarf Dragapult's Fire Blast. The remaining EVs are placed into Attack with an Adamant nature to maximize Galarian Darmanitan-Z's damage output.</p> <p>Since this set's main use is as a lure for opposing fast Choice Scarf users such as opposing Galarian Darmanitan, Gengar, and Haxorus, Pokemon that can lure in these threats, like Togekiss, make good partners for Galarian Darmanitan-Z. While Galarian Darmanitan-Z can beat Haxorus and opposing Galarian Darmanitan for Togekiss, Togekiss can in return beat Fighting-types like non-Choice Scarf Sawk and Conkeldurr and walls such as Galarian Corsola. Since Galarian Darmanitan-Z struggles heavily with Sturdy users like Sawk and Crustle, Primarina makes for a good partner; in return, Galarian Darmanitan-Z can beat threats like Venusaur, Diggersby, and Choice Band Galarian Darmanitan. Mandibuzz also acts as a good partner, as it lures in opposing Galarian Darmanitan while beating slower defensive threats that Galarian Darmanitan-Z struggles with, like Steelix, Taunt Whimsicott, and Galarian Corsola. Galarian Darmanitan-Z can cover opposing Galarian Darmanitan as well as Hyper Voice Togekiss in return.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 457210, "username": "Le Creme Brule"}, {"user_id": 425798, "username": "pqs"}, {"user_id": 276708, "username": "Alakazam"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "The Dutch Plumberjack"}, {"user_id": 302985, "username": "lotiasite"}]}], "writtenBy": [{"user_id": 393488, "username": "Yami"}, {"user_id": 485303, "username": "Notater"}]}
  },
  "Crustle": {
    "sets": [
      {
        "name": "Shell Smash Offense",
        "description": "<p>Crustle serves as one of the best Sturdy users in the 1v1 metagame. Crustle's access to the offensively strong Rock typing, alongside a powerful move in Rock Wrecker and utility options in Rock Blast and Shell Smash, gives it the potential to be one of the most powerful setup attackers in the metagame, utterly destroying nearly anything that does not resist Rock Wrecker, like Hydreigon, Aromatisse, and Snorlax, after a Shell Smash. Counter is incredibly useful for some physical attackers as well; Choice Scarf Dracovish and Dracozolt will beat Crustle if it uses Shell Smash, but will fall after being hit by Counter, as Crustle will always survive their attacks. Golisopod can also sometimes survive a Rock Wrecker from Crustle and is unsafe to set up against, but Crustle will still win by using Counter turn one by either KOing Golisopod or putting it in range of a Rock Wrecker. Crustle runs 128 HP and 20 Defense EVs in order to survive a Choice Band Iron Tail from Haxorus, as well as maximizing HP in order to get Choice Band Snorlax into Rock Wrecker range after a Counter. 164 Speed is run in order to outspeed Rock Tomb Dracovish after a Shell Smash. Lum Berry can be used to threaten Yawn Sylveon and Stall Rotom-A, whereas Mental Herb is very helpful against Taunt users like Haxorus and Whimsicott, both ensuring Crustle can set up with Shell Smash and threaten offensively.</p> <p>Crustle works well with frailer threats that need Sturdy support in order to beat the Pokemon they cannot threaten offensively. Pokemon like Dracovish, Dragapult, Galarian Darmanitan, and Dracozolt all appreciate Crustle's ability to tank hits from offensive threats like Choice Scarf Haxorus, non-Quick Attack Sylveon, and all of their ditto matchups. In return, these offensive powerhouses generally have a good matchup against the bulky stall Pokemon that can beat Crustle, like Corviknight and Arcanine. Crustle appreciates Pokemon that can also beat Steel-type Pokemon, that can generally survive any one attack Crustle can go for, even after a Shell SmashPokemon like Aegislash, Duraladon, Corviknight, Ferrothorn, and Bisharp can usually handle Crustle, although the physical Steel-types need to watch out for Counter. Therefore, Fire- and Fighting-types like Arcanine, Sawk, and Conkeldurr will be great partners for Crustle, as they can generally handle these Steel-type threats.</p> "
      },
      {
        "name": "Choice Band",
        "description": "<p>Crustle earns its place as one of the best threats in the 1v1 tier, being able to always beat non-Substitute Primarina, Zeraora, and Porygon-Z with its powerful Choice Band-boosted Rock Wrecker. Rock Blast, though relying on rolls for some of its matchups, will always take down Volcarona and FEAR Togedemaru, and can potentially take down opposing Shell Smash Crustle. Earthquake helps Crustle against non-Air Balloon Aegislash and Choice Band Steelix. Counter allows Crustle to take down Choice item threats like Urshifu-S, Dracovish, and Conkeldurr that would normally 2HKO Crustle and take one of its hits. Heavy Slam alternatively helps Crustle beat non-Babiri Berry Sylveon and Whimsicott more reliably. The given spread allows for Crustle to always survive the rare Choice Band-boosted Iron Tail from Mold Breaker Haxorus and KO them back with Rock Wrecker. 29 Speed IVs and a Brave nature allow Crustle to underspeed Aegislash and OHKO non-Air Balloon Blade forme variants. The rest of the EVs are invested into Attack to maximize Crustle's damage output, which helps it get the best roll against Pokemon such as Hydreigon, Dracovish, and Aromatisse.</p> <p>Stall Arcanine is an exception to the Fire-type Pokemon that Crustle can normally beat, since it can use Burn Up to lose its Fire typing and then stall you out with the combination of Will-O-Wisp and Morning Sun. Life Orb Salazzle is another exception due to it being able to bypass Sturdy with Fake Out and then almost always OHKO Crustle with Overheat. Pixie Plate Sylveon is an exceptional partner for Crustle due to it being able to break through a lot of Pokemon that Crustle normally can't beat, like stall and Sturdy users, while also generally beating a lot of Pokemon that resist Crustle's attacks. Pokemon that Sylveon can cover for Crustle include Dragapult, Urshifu-R, stall Azumarill, Rotom-W, Galarian Corsola, and Sawk, among other threats. Assault Vest Primarina is another Fairy-type that can be used as a teammate, able to take out threats such as Arcanine, Salazzle, and Skarmory, though it is more prone to stall Pokemon. Crustle in return can defeat Pokemon that Primarina and Sylveon struggle against such as Galarian Darmanitan, Zeraora, and Dracozolt.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 457210, "username": "Le Creme Brule"}, {"user_id": 425798, "username": "pqs"}, {"user_id": 317056, "username": "dogknees"}, {"user_id": 474883, "username": "Waylaid"}]}, {"name": "Grammar checked by", "members": [{"user_id": 241023, "username": "Kris"}, {"user_id": 297659, "username": "deetah"}]}], "writtenBy": [{"user_id": 276708, "username": "Alakazam"}, {"user_id": 425798, "username": "pqs"}]}
  },
  "Chandelure": {
    "sets": [
      {
        "name": "Choice Scarf",
        "description": "<p>Chandelure is an effective Choice Scarf user because it has the highest base Special Attack in the metagame, an average Speed stat, good coverage moves, and a great ability in Infiltrator that allows it to be a good Choice Scarf user. Shadow Ball is able to hit Gardevoir and Galarian Corsola super effectively. Overheat beats most Steel-types such as Aegislash, Ferrothorn, bulky Excadrill and Pokemon like Whimsicott. Trick is great to have against setup attackers such as Rotom-H. Energy Ball allows Chandelure to hit Water-types such as Gastrodon and Ground-types such as Choice Band Rhyperior. Rest allows Chandelure to beat Toxic Chansey. The EVs allow Chandelure to survive a Choice Band Talonflame's Brave Bird, and let Chandelure outspeed Choice Specs Dragapult. Infiltrator lets Chandelure bypass Substitute and beat Whimsicott.</p> <p>Chandelure struggles with faster Choice Scarf users such as Earthquake Galarian Darmanitan and Excadrill, so partners such as Choice Scarf Haxorus, Dragapult, and Sawk are needed to beat these. In return, Chandelure can take on Choice Scarf Gardevoir and Galarian Corsola. Chandelure also struggles with Ghost-types such Choice Scarf Gengar, so Pokemon like Excadrill and Snorlax are great partners. In return, Chandelure can take care of Choice Band Galarian Darmanitan for them. Chandelure also scannot beat Pokemon with Sturdy such as Sawk and Crustle, so partners such as Corviknight and Galarian Corsola are great to pair with it. Chandelure can take on Whimsicott for them.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 457210, "username": "AllFourtyOne"}, {"user_id": 425798, "username": "pqs"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "The Dutch Plumberjack"}]}], "writtenBy": [{"user_id": 393488, "username": "Yami"}]}
  },
  "Haxorus": {
    "sets": [
      {
        "name": "Swords Dance",
        "description": "<p>Using a combination of powerful moves and the greatest Attack stat in the metagame, Haxorus cements itself as a great wallbreaker. Outrage is Haxorus's strongest physical STAB move, being able to hit other Dragon-types like Hydreigon, Dracovish, and opposing non-Choice Scarf Haxorus. Against Rotom-A forms, use Outrage immediately, which will 2HKO Choice Item variants of Rotom-A, while also forcing stall variants to use Rest, allowing Haxorus to set up with Swords Dance. Close Combat is a coverage move for hitting Steel-, Ice-, and Dark-types, such as Duraludon, Galarian Darmanitan, and Incineroar. With Swords Dance alongside Laser Focus, Haxorus is able to beat stall Pokemon such as Toxapex, Ferrothorn, non-Foul Play Mandibuzz, and Gastrodon. Taunt is used mainly to beat Will-O-Wisp Galarian Corsola. The EVs alongside Haban Berry allow Haxorus to survive non-Choice Specs Hydreigon's Draco Meteor and Choice Scarf Dracozolt's Outrage. Haxorus runs maximum Speed investment in order to outspeed Choice Band Galarian Darmanitan and speed-tie other non-Choice Scarf Haxorus. The rest is put into Attack to maximize offensive output. Mold Breaker can be run in order to beat Magnezone and Sawk. Unnerve can be used to beat certain opposing Pokemon holding berries, like Haban Berry Goodra and Chople Berry Incineroar. Dragon Dance can also be used instead of Swords Dance in order to beat Zeraora.</p> <p>Haxorus struggles with Fairy-types such as Sylveon, Galarian Weezing, and Gardevoir, so Steel-type Pokemon such as Durant, Choice Band Excadrill, and Aegislash are good teammates. In return, Haxorus can deal with Fire-type Pokemon such as Darmanitan, Rotom-H, and Incineroar that threaten its partners. Haxorus is also weak to Ice-types such as Avalugg, Choice Scarf Galarian Darmanitan, and Weavile, so it's nice to have Fire-types such as Arcanine and Choice Specs Rotom-H that can deal with them. In return, Haxorus can deal with Water-types such as Rotom-W, Gastrodon, and Dracovish.</p> "
      },
      {
        "name": "Choice Band",
        "description": "<p>Haxorus is a solid physical wallbreaker in the 1v1 metagame thanks to its tremendous Attack stat and two great abilities in Unnerve, which lets it berry-using Pokemon like Haban Kyurem and Kommo-o, Chople Snorlax and Porygon-Z, and Kebia Whimsicott, and Mold Breaker, which allows it to bypass abilities such as Sturdy from Pokemon like Magnezone and Sawk. Additionally, Haxorus's access to high-Base Power moves like Outrage, Poison Jab, Close Combat, Aqua Tail, and Earthquake allows it to cover a variety of different threats in the metagame like Choice Band Dracovish, Whimsicott, all formes of Rotom, Whimsicott, Rhyperior, and Tyranitar. Generally, Haxorus should avoid other Choice Scarf users such as Galarian Darmanitan, Dracovish, and Togekiss, as they are all faster than it and can use their respective moves to take it out. It also should avoid bulky Pokemon like Corviknight, as it will lose easily.</p> <p>Bulky Pokemon like Sylveon, Vaporeon, and Tyranitar are helpful when handling fast Choice Scarf attackers like Dragapult, Hydreigon, and Togekiss. In return, they all appreciate Haxorus's ability to wallbreak stall Pokemon like defensive Rotom-H and Umbreon. Steel-types like Aegislash and Choice Scarf Durant help handle common Fairy-types like Sylveon and Togekiss. In return, Haxorus can handle the Ground-types that hinder them such as Excadrill, Choice Band Diggersby, and Steelix. Fire-types such as Chandelure and Arcanine are useful in handling the same Steel-type Pokemon like Corviknight and Aegislash. They, on the other hand, appreciate Haxorus's ability to handle Water-types like Rotom-W and Toxapex instead.</p> "
      },
      {
        "name": "Choice Scarf",
        "description": "<p>Outrage allows Haxorus to beat Dragon-types including Dragapult and Goodra. Close Combat allows Haxorus to take on Galarian Darmanitan and Tyranitar. Poison Jab is used to secure the OHKO against Whimsicott. Earthquake can be used to give Haxorus a way to beat Zeraora, having the best odds against Zeraora if Haxorus is running Adamant. Iron Tail can be run in order to OHKO Alolan Ninetales and offensive Sylveon. Using a Jolly nature with maximum Speed EVs and a Choice Scarf allows Haxorus to outpace Choice Scarf Galarian Darmanitan, a common sight in 1v1. Adamant can also be run in order to get the best possible odds against bulkier Dragon Pokemon like Haban Berry Kommo-o and Kyurem, or against bulky Choice Scarf Gardevoir. Mold Breaker can be run to OHKO Magnezone and Sawk, as well as beat stall Rotom-A with Earthquake. Unnerve is used to get past the commonplace Haban Berry users like Dragapult and Kommo-o.</p> <p>Haxorus struggles with taking on Fairy-types such as Sylveon and Aromatisse, so Steel- and Poison-types such as Aegislash and Galarian Weezing makes great partners for it. In return, Haxorus can take on Excadrill and Choice Band Dracovish for them. Haxorus also struggles with faster Choice Scarf Dragon-types such as Hydreigon, so Sylveon and Tyranitar help greatly with these threats. Haxorus also struggles against common stall and bulky Pokemon such as Rotom-W, Corviknight, Galarian Corsola, Arcanine, and Aegislash, so having partners to pressure them such as Choice Specs Chandelure and Gastrodon helps greatly in these matchups.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 457210, "username": "Le Creme Brule"}, {"user_id": 276708, "username": "Alakazam"}, {"user_id": 425798, "username": "pqs"}, {"user_id": 474883, "username": "Waylaid"}, {"user_id": 457703, "username": "Synonimous"}]}, {"name": "Grammar checked by", "members": [{"user_id": 241023, "username": "Kris"}, {"user_id": 388157, "username": "A Cake Wearing A Hat"}]}], "writtenBy": [{"user_id": 430787, "username": "Poison Adhesive"}, {"user_id": 393488, "username": "Yami"}, {"user_id": 418753, "username": "pazza"}]}
  },
  "Durant": {
    "sets": [
      {
        "name": "Choice Band",
        "description": "<p>Choice Band Durant utilizes its Hustle-boosted STAB moves along with coverage to OHKO a variety of the metagame's threats. First Impression's priority allows Durant to beat fast, prominent Pokemon such as Galarian Darmanitan, Haxorus, and Porygon-Z. However, this move has the downside of only working on the first turn out, making Durant susceptible to users of Protect and Fake Out, such as Rillaboom and Zeraora. Iron Head is STAB-boosted and is used to KO threats such as Sylveon, Avalugg, and Aromatisse. Superpower helps with Steesl-types such as Excadrill and Bisharp, or Choice Band Snorlax. Giga Impact should be used against Pokemon that either resist or don't take super effective damage from Durant's STAB moves and Superpower, such as Choice Specs Rotom-H and offensive Primarina. Although Hustle boosts Durant's power, it does so at the cost of accuracy, adding general unreliability and making matchups against Substitute users, like Whimsicott, less reliable.</p> <p>Durant is very weak to non-Fighting-weak Steel-types such as Aegislash and Corviknight. This makes Pokemon such as Rotom-H great partners and they appreciate Durant's ability to take on Water-types such as Primarina and Choice Band Dracovish. Durant is also extremely weak to Fire-type moves from the likes of Choice Scarf Chandelure, making Primarina and Milotic great partners. Primarina and Milotic also appreciate Durant's ability to KO Rotom-A. Durant also struggles with stall Pokemon such as Galarian Corsola, Type: Null, and Milotic, which makes Choice Scarf Gardevoir and Taunt Whimsicott great partners, and they appreciate Durant's Fighting coverage against Pokemon like Excadrill.</p> "
      },
      {
        "name": "Choice Scarf",
        "description": "<p>Choice Scarf Durant is able to use its Hustle-boosted Attack stat and high Speed for a Choice Scarf user to outspeed and KO most of the other prominent Choice Scarf users in the metagame, such as Hydreigon, Galarian Darmanitan, Dracovish, Duraludon, and Excadrill. Iron Head and X-Scissor are Durant's STAB moves, and they allow it to hit Dark-, Ice-, and Fairy-type Pokemon such as the Hydreigon, Galarian Darmanitan, and Sylveon. X-Scissor also allows Durant to beat Choice Scarf Dracovish because it can survive a Fishious Rend and 2HKO in return with X-Scissor. Stone Edge and Superpower allow Durant to hit Steel- and Fire-type Pokemon such as Duraludon, Excadrill, and Rotom-H super effectively. 12 HP EVs allows Durant to live a Choice Band Fishious Rend from Dracovish, and combined with 36 EVs in Special Defense allow Durant to survive a Shadow Ball from Choice Scarf Gengar. 208 Speed EVs with a Jolly nature allow Durant to outspeed Choice Scarf Modest Inteleon. Maximum Attack is run to OHKO Gengar guaranteed with Iron Head. The remaining EVs are invested into Speed, as Durant is too frail to EV for anything else defensively.</p> <p>Durant struggles to KO bulky Water-types such as Milotic and Toxapex so Pokemon that can handle them such as Dracozolt, and Whimsicott make good partners for Durant, and they also appreciate Durant's ability to remove Pokemon such as Gardevoir and Galarian Darmanitan, respectively. Other Pokemon that can work well with Durant are those that can deal with Fire-types such as Dracovish, Crustle, Milotic, and Toxapex. In return, Durant can remove the Grass-, Water-, and Steel-types that threaten them. Pokemon that can stomach special hits such as Goodra and Sylveon are also appreciated due to Durant's abysmal Special Defense, and they appreciate Durant's ability to remove the faster Pokemon that threaten them such as Choice Scarf Dracovish, Duraludon, and Excadrill. Sturdy users with Counter, such as Sudowoodo, Sawk, and Crustle, are also problematic to Durant, as they are guaranteed to survive a hit from it and can OHKO it in return, so checks to those Pokemon, such as Haxorus and Excadrill, work well with Durant, and Durant removes their checks such as Sylveon for Haxorus and Choice Scarf Dracovish for Excadrill.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 457210, "username": "Le Creme Brule"}, {"user_id": 425798, "username": "pqs"}, {"user_id": 276708, "username": "Alakazam"}]}, {"name": "Grammar checked by", "members": [{"user_id": 241023, "username": "Kris"}]}], "writtenBy": [{"user_id": 442711, "username": "Mubs"}, {"user_id": 444257, "username": "XinosXinos"}]}
  },
  "Hydreigon": {
    "sets": [
      {
        "name": "Haban Berry",
        "description": "<p>Nasty Plot makes Hydreigon one of the premiere special breakers in the tier, given its already strong STAB combination of Draco Meteor and Dark Pulse. Draco Meteor is for taking down Dragon-types such as Dracovish, Dracozolt, Kommo-o, and opposing non-Haban Berry Hydreigon. Dark Pulse is for hitting Ghost- and Psychic-types such as Chandelure and non-Dazzling Gleam Celebi. Nasty Plot allows for Hydreigon to boost its Special Attack, letting it break through bulkier Pokemon such as Type: Null, Aegislash, Galarian Corsola, and Silvally. Taunt allows for Hydreigon to break down bulkier Pokemon that rely on setting up, namely stall Snorlax and Gastrodon, whereas Fire Blast is coverage for Steel-types such as Bisharp, Excadrill, and Ferrothorn. Focus Blast can be run in order to OHKO Choice Band Diggersby, alongside most of the Steel-types mentioned, but is generally less reliable. Haban Berry is to tank other Dragon-type attacks such as Draco Meteor from Dragapult and Outrage from both Choice Scarf Dracovish and Dracozolt. The EVs are for tanking Draco Meteor from Choice Specs Dragapult and Low Kick from Adamant Dracozolt. 212 Speed EVs allow Hydreigon to outspeed Braviary. If you are running Fire Blast, you have to use the EV spread of 72 HP / 12 Def / 172 SpA / 252 Spe so you can outspeed and OHKO Adamant Galarian Darmanitan with Fire Blast. Alternatively, you can run 80 HP / 104 Def / 72 SpA / 252 Spe with a Timid nature, which lets Hydreigon live Low Kick from Dracozolt. Another EV set of 88 HP / 96 SpA / 72 SpD / 252 Spe could be used with a Timid nature, which lets you tank Modest Choice Specs Dragapult's Draco Meteor if you run Fire Blast. All of these spreads outspeed Choice Band Haxorus, non-Choice Scarf Galarian Darmanitan, and Modest Choice Specs Gengar.</p> <p>Hydreigon's Dark / Dragon typing makes it susceptible to Fairy-types such as Primarina, Sylveon, Aromatisse, and Gardevoir. Because of this, Steel- and Poison-types such as Ferrothorn, Durant, and Silvally-Poison work really well with Hydreigon. Hydreigon, in return, is able to take out stall Pokemon such as Rotom-W and Mandibuzz and offensive Pokemon like Excadrill and Adamant Choice Band Galarian Darmanitan. Hydreigon is also troubled by physical attackers such as Conkeldurr, Choice Scarf Galarian Darmanitan, Unnerve Choice Band, or Haban Berry Haxorus, and Avalugg. Fairy-types such as Primarina, Sylveon, and Aromatisse all pair well with Hydreigon, as they are able to cover Hydreigon's physical weaknesses, while Hydreigon can take on Poison-type threats such as Toxtricity and Silvally-Poison. Hydreigon is able to deal with these Pokemon by setting upon them and OHKOing or inflicting them with Taunt to prevent them from setting up.</p> "
      },
      {
        "name": "Choice Scarf",
        "description": "<p>With a great Special Attack, a decent Speed stat, and a good movepool Hydreigon makes it a decent Choice Scarf user that is able to outpace most Dragon-types such as Dracovish, Dracozolt, and Haxorus and beat these with Draco Meteor. Dark Pulse allows Hydreigon to be able to take care of and Ghost-types such as Chandelure. Fire Blast beats Galarian Darmanitan and most Steel-types like Excadrill and Ferrothorn. Focus Blast OHKOes Porygon-Z and Urshifu-S.</p> <p>Hydreigon struggles with Pokemon that are Fairy-type or run Fairy-type coverage such as Aromatisse and Indeedee-F, so Pokemon such as Choice Band Excadrill and Choice Band Haxorus are great partners because they can OHKO these two with their Steel-type attacks; in return it can take on Haxorus, Dracovish, and Ferrothorn for these. Hydreigon also struggles with Fighting- and Bug-types like Sawk and Golisopod, which partners such as Togekiss and Galarian Weezing can take on. In return, Hydreigon can take care of Excadrill and Galarian Darmanitan for these.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 457210, "username": "Le Creme Brule"}, {"user_id": 425798, "username": "pqs"}, {"user_id": 276708, "username": "Alakazam"}, {"user_id": 317056, "username": "dogknees"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "The Dutch Plumberjack"}, {"user_id": 240732, "username": "Estronic"}]}], "writtenBy": [{"user_id": 393488, "username": "Yami"}, {"user_id": 418753, "username": "pazza"}]}
  },
  "Kyurem": {"sets": [{"name": "Haban Berry"}, {"name": "Chople Berry"}, {"name": "Charti Berry"}, {"name": "Roseli Berry"}, {"name": "Choice Scarf"}]},
  "Genesect": {"sets": [{"name": "Life Orb"}, {"name": "Bulky Occa Berry"}]},
  "Diggersby": {
    "sets": [
      {
        "name": "Choice Band",
        "description": "<p>Choice Band Diggersby is used to beat bulkier threats like Sylveon and Snorlax without the need of a coverage move. Giga Impact and Earthquake are Diggersby's go-to STAB moves, which when combined with Huge Power, powers through bulky threats like Sylveon, Snorlax, Arcanine, and Incineroar. Wild Charge is used to strengthen Diggersby's matchups against Flying-types like Corviknight and Gyarados and should also be used against Primarina due to the higher accuracy and avoiding being revenge killed by Chilan Berry sets. Fire Punch covers Steel-types that Earthquake can't beat like Ferrothorn and Hustle Durant in the case that a move misses. The HP and Special Defense EVs provided are allocated to survive two Air Slashes from Choice Scarf Togekiss and one Overheat from Choice Scarf Chandelure. The Speed EVs are used to outspeed fast Cloyster and Bisharp, as well as maximum investment base 60s such as Incineroar and Primarina.</p> <p>Diggersby struggles with stall Pokemon like Galarian Corsola and Defensive Corviknight, so it works well with stallbreakers like Taunt Incineroar and Zeraora. In return, Diggersby can take on bulky offensive threats that counter them like Primarina, Venusaur, and Sylveon. Diggersby also suffers a great weakness to glass cannons that can outspeed and KO it with relative ease, such as Galarian Darmanitan, Dracovish, Dragapult, and Haxorus, so bulky teammates like Primarina, Avalugg, and Galarian Weezing are good partners. In return, Diggersby can again take on the aforementioned bulky offensive threats in Primarina, Venusaur, and Sylveon. Diggersby is also weak to Sturdy users like Sawk and Crustle, so Mold Breaker users like Excadrill, Hawlucha, and Haxorus make good partners. In return, Diggersby can take down bulky Fairy-types like Primarina for them.</p> "
      },
      {
        "name": "Choice Scarf",
        "description": "<p>Diggersby defines its place in the metagame with its ability, Huge Power, boosting all of its moves on this set to powerful levels. Earthquake and Giga Impact are very powerful STAB moves, allowing Diggersby to usually take on threats like Excadrill and Hydreigon. Fire Punch and Gunk Shot are coverage moves to take down miscellaneous threats that Diggersby can't take on otherwise, like Choice Band Durant and Togekiss. Choice Scarf gives Diggersby a needed Speed boost, though it loses out on the power it would otherwise get from Choice Band, not being to KO bulky Sylveon among other Pokemon.</p> <p>Diggersby's middling speed even with a Choice Scarf boost prevents it from beating incredibly fast threats like Dragapult, Choice Scarf Dracovish, and Haxorus. This makes bulky presences like Sylveon and Whimsicott good teammates for Diggersby, since they can effectively beat those Pokemon. In return, Diggersby can take down the ever-present Steel-types in the metagame, like Aegislash, Durant, and Excadrill. Diggersby also loses to Sturdy users, as they can easily take a hit from Diggersby and use Counter in return to secure the win. This allows Mold Breaker Pokemon like Excadrill and Haxorus to shine versus Crustle and Choice Band Sawk. Diggersby also loses to bulky Pokemon that can take a hit from it and KO or stall back, like Snorlax and Steelix. Wallbreakers like Sawk are good teammates for Diggersby because they can take down these threats. In return, Diggersby can take down Aegislash for them.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 457210, "username": "AllFourtyOne"}, {"user_id": 276708, "username": "Alakazam"}, {"user_id": 474883, "username": "Waylaid"}, {"user_id": 506856, "username": "Potatochan"}]}, {"name": "Grammar checked by", "members": [{"user_id": 302985, "username": "lotiasite"}, {"user_id": 241023, "username": "Kris"}]}], "writtenBy": [{"user_id": 425798, "username": "pqs"}]}
  },
  "Aegislash": {
    "sets": [
      {
        "name": "Weakness Policy",
        "description": "<p>Aegislash uses its hybrid of a defensive and offensive ability in Stance Change along with a decent movepool to define its place in the metagame. King's Shield is used to punish foes if they try to use a contact move on Aegislash, which helps secure the matchup against physical threats like Choice Scarf Galarian Darmanitan, Dracovish, and physical Arcanine. Shadow Ball and Flash Cannon are powerful STAB moves that are used to hit opposing Psychic-, Fairy-, and Ice-types, such as Gardevoir, Sylveon, and Galarian Darmanitan, alongside Choice-locked Dragapult. Shadow Sneak allows Aegislash to finish off faster Pokemon that have been whittled down by Aegislash's other moves. This is mainly used against Shell Smash Crustle and Sawk, as well as some other miscellaneous threats. 240 HP and 20 Defense EVs allow Aegislash to take a hit from Adamant Choice Scarf Excadrill. 248 Special Attack EVs and a Quiet nature allow Aegislash to output as much damage as possible, while also being able to undercut some other Aegislash on the mirror matchup. 0 Speed IVs allow Aegislash to Speed tie other Aegislash, in order to get a Weakness Policy boost.</p> <p>Aegislash will use Weakness Policy, combined with its excellent bulk in Shield Forme, to net wins against Haxorus, Zeraora, Hawlucha, Choice Scarf Excadrill, Choice Specs Dragapult, Choice Scarf Galarian Darmanitan after King's Shield, and Choice Scarf Hydreigon. Porygon-Z sometimes only runs Normal-type coverage, in which case Aegislash autowins, but Aegislash will fall to a combo of Trick into Shadow Ball or Dark Pulse. King's Shield is unfortunately only marginally effective at beating threatening contact Pokemon. Both Urshifu-S and Urshifu-R have the ability Unseen Fist, which ignores King's Shield, and physical Fire-types like Darmanitan, Incineroar, Centiskorch, and Alolan Marowak can avoid bypass King's Shield with their moves or abilities. King's Shield will also prove ineffective against monstrous physical powerhouses, like Choice Band Galarian Darmanitan, Dracovish, and Dracozolt, though the former can be beaten if Aegislash uses King's Shield twice. Despite being super effective against Ghost Pokemon, Aegislash will lose against all Ghost-type Pokemon except Choice item Dragapult. If Aegislash is undersped by a Pokemon, it will be helpless defensively, and will often lose even against Pokemon it can hit super effectively, like Choice Band Avalugg and Crustle, Snorlax, Steelix, and Rhyperior. Among Rock- and Ice-types, only Shell Smash Crustle, Terrakion, Eiscue, Alolan Ninetales, and Choice Scarf Galarian Darmanitan are relevant targets - the others, like Tyranitar and Kyurem, can win with their specific attributes. Aegislash has absolutely no stallbreaking ability, and thus all stall Pokemon should be avoided, outside of Slowbro, which can be KOed. Chilan Berry Primarina or Azumarill can be used to beat Fire- and Ground-type threats, alongside relevant Rock- and Ice-type Pokemon, and troublesome Dragons like Substitute + Disable Dragapult and non-Choice Scarf Hydreigon.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 457210, "username": "Le Creme Brule"}, {"user_id": 276708, "username": "Alakazam"}]}, {"name": "Grammar checked by", "members": [{"user_id": 241023, "username": "Kris"}]}], "writtenBy": [{"user_id": 425798, "username": "pqs"}]}
  },
  "Aromatisse": {
    "sets": [
      {
        "name": "Trick Room Disable",
        "description": "<p>Aromatisse serves as a bulky Fairy-type that utilizes Trick Room, Encore, and Disable to defeat hyper offensive threats such as Haxorus as well as certain stall Pokemon like Milotic and Rotom-W. 216 HP EVs and 136 Defense EVs allow Aromatisse to survive Choice Band Urshifu-R's Surging Strike, while 216 HP EVs and 156 Special Defense with a Calm Nature makes sure Aromatisse survives a Choice Specs Primarina's Hydro Cannon. Wiki Berry ensures it can survive Choice Band Struggle from Urshifu-R. Aroma Veil immunizes Aromatisse from moves like Taunt, Encore, and Disable. Moonblast hits many metagame-prevalent Pokemon like Dragapult and Choice Scarf Galarian Darmanitan. Aromatisse's remaining three moves are used to set up a combination that forces the foe to damage itself with Struggle. Trick Room allows Aromatisse to outspeed a Pokemon that would normally be faster than it like Choice Scarf Galarian Darmanitan and force it to struggle by using Encore and Disable, or just Disable if the foe is holding a Choice item. When predicting that a potential Choice item holder like Rotom-H or Togekiss will use Trick, use Encore to give Aromatisse two free turns of Moonblast, which will often secure the win.</p> <p>Against certain stall Pokemon such as Milotic and Dubwool, using Encore turn one followed by a sequence of Moonblast, Trick Room, Disable, and Encore allows you to lock the opposing Pokemon into Struggle for two turns to deal maximum damage. Against some stall Pokemon with Special Defense-boosting moves that do not resist Moonblast like Rotom-W, Snorlax, and Type: Null, Aromatisse can permanently lock them into a boosting move by using Encore turn one. After that, use Trick Room turn two and repeat each of the status moves whenever it expires until the opposing Pokemon breaks out of Encore before the last turn of Trick Room. Once you are at that turn, use Encore followed by Moonblast and Trick Room and repeat. Doing so in this order will allow you to refresh Trick Room and Encore continuously without giving the opposing Pokemon a chance to switch moves. If they instead attack, use Disable on the attacking move and then KO it with consecutive Moonblasts. Porygon-Z will involve mindgames, either predicting them to attack, in which case you use Trick Room, or Trick, in which case you Encore. Pokemon with a positive matchup against Fire-, Steel-, and Poison-type Pokemon that Aromatisse struggles with, such as Salazzle, Haxorus, Chansey, Urshifu-R, and Dragapult can be useful partners in order to assist Aromatisse.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 457210, "username": "Le Creme Brule"}, {"user_id": 276708, "username": "Alakazam"}]}, {"name": "Grammar checked by", "members": [{"user_id": 168392, "username": "P Squared"}]}], "writtenBy": [{"user_id": 481177, "username": "Maki's Fox"}]}
  },
  "Sylveon": {"sets": [{"name": "Custap Berry"}, {"name": "Yawn"}]},
  "Avalugg": {
    "sets": [
      {
        "name": "AvaTHUGG (Choice Band)",
        "description": "<p>Avalugg's absurdly high Defense stat along with a decent Attack stat and its ability Sturdy defines its place in the metagame. Avalugg can make good use of Body Press thanks to its aforementioned high Defense stat, being able to muscle through Dark- and Normal-types like Snorlax, Porygon-Z, Porygon2, Hydreigon, and Tyranitar, as well as Galarian Darmanitan and Excadrill. Icicle Spear reliably takes out Grass- and Dragon-types like Whimsicott, Haxorus, and Substitute + Disabe Dragapult, as well as FEAR Pokemon like Togedemaru. Mirror Coat, in combination with Sturdy and its very low Special Defense, lets Avalugg beat specially offensive Choice Item variants like Primarina and Dragapult. However, Mirror Coat is easy to work around if the opponent is not using a Choice Item, so keep that in mind. Heavy Slam takes advantage of Avalugg's high weight, taking down Fairy-types like Sylveon and Aromatisse. Earthquake can alternatively be used to take down the specific threats of non-Air Balloon Zeraora, Aegislash, Chandelure, and Toxtricity. Maximum Attack investment helps Avalugg do as much damage as possible, notably helping it take on Sylveon with Heavy Slam, and maximum Defense investment maximizes its physical bulk while also boosting the power of Body Press. An alternative EV spread of 248 HP / 36 Atk / 224 Def alongside an Impish nature allows Avalugg to avoid the 2HKO from Adamant Choice Scarf Dracovish's Fishious Rend and 2HKO it back with Body Press. If this spread is being run, avoid using Heavy Slam, as Avalugg can no longer reliably beat Sylveon.</p> <p>Avalugg will be unable to beat Weakness Policy Incineroar with Body Press, which can live a Body Press and 2HKO Avalugg after Weakness Policy. Avalugg will also be unable to reliably beat Kommo-o, who will boost their Defense with Iron Defense, making Icicle Spear deal minimal damage. Magnezone and Gardevoir are Choice Item special attackers that can beat Avalugg, thanks to Magnezone's Sturdy ability and Gardevoir's Sturdy after Trace. When applicable, do not use Icicle Spear, if Avalugg has a better coverage option at its disposal, due to its multi-hit nature. This applies to Pokemon like Togekiss and Hydreigon. Non-Electroweb Chople Berry Porygon-Z involves mindgames for Avalugg, as Avalugg needs to either Mirror Coat on an attack, or Body Press on a setup move. Avalugg struggles heavily with stall Pokemon, so Pokemon like Chansey, Mandibuzz, Corviknight, Arcanine, and Slowbro should be avoided. Taunt and Trick users can be run alongside Avalugg, like both Urshifu formes and Porygon-Z, in order to cover these weaknesses.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 276708, "username": "Alakazam"}, {"user_id": 480297, "username": "zioziotrip"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Estrnic"}]}], "writtenBy": [{"user_id": 425798, "username": "pqs"}]}
  },
  "Primarina": {
    "sets": [
      {
        "name": "Assault Vest",
        "description": "<p>Primarina's solid defensive stats paired with an Assault Vest allow it to take hits from even the strongest special attackers in the 1v1 tier, such as Porygon-Z, Sylveon, and offensive Rotom-H. Moonblast hits Dragon-types like Dragapult and Haxorus, Fighting-types like Kommo-o and Urshifu-S, non-Roseli Berry and Assault Vest variants of Urshifu-R, and most neutral targets such as Porygon-Z. Sparkling Aria deals with Fire-types such as Rotom-H, Salazzle, and non-Passho Berry Volcarona. Aqua Jet is used to finish off Sturdy users like Shell Smash Crustle and Sawk while also being generally useful for weakened foes such as Togekiss to avoid being hit with flinches from Air Slash. Hydro Cannon is useful for KOs that Sparkling Aria just can't quite reach, like Assault Vest Rhyperior. Energy Ball is useful against Pokemon with a 4x weakness to Grass such as non-Rindo Berry Gastrodon as well as opposing Primarina. 248 HP EVs and 148 Defense EVs allow Primarina to always survive a Choice Band-boosted Poison Jab from Haxorus, while 248 HP EVs along with 64 Special Defense EVs allow Primarina to survive a Choice Specs Hyper Beam from Porygon-Z; the rest of the EVs are dumped into Special Attack. An alternative spread of 248 HP / 80 Def / 40 SpA / 140 SpD with a Calm nature can also be run, which gives Primarina less defensive capabilities, only now living a Fishious Rend from Choice Band Dracovish, but now lets Primarina beat rare Uproar variants of offensive Choice Specs Porygon-Z. Torrent is the preferred ability, as it provides Primarina with situational boosts to its Water-type moves.</p> <p>Primarina will have issues with specially defensive walls such as Galarian Corsola and Snorlax, as using Assault Vest instead of a damage-boosting item prevents it from breaking down these threats due to their great natural bulk. Thus, Primarina appreciates teammates with stallbreaking capabilities, including Taunt users such as Skarmory, Haxorus, and Urshifu-S. Primarina threatens special attackers and faster Taunt users for Skarmory, bulky Dragon-types for Haxorus, and Fighting- and Fairy-types for Urshifu-S. Primarina also struggles with strong physical moves from many physical attackers in the metagame like Choice Band Galarian Darmanitan and Choice Band Crustle. Bear in mind that Choice Band Rhyperior often runs Speed investment, because it can afford to do so, which will allow it to beat Primarina. Physical walls like Avalugg, defensive Rotom-W, and Grassy Seed Rillaboom deals with the aforementioned threats, while Primarina handles threatening Dragon-types like Dragapult and Kommo-o for these Pokemon in return. Despite its type advantage, Primarina can't break through threats such as defensive Arcanine and Kyurem, as Arcanine utilizes Burn Up to rid itself of its Water-type weakness and follows up with Snarl and Morning Sun, while Kyurem can simply PP stall Primarina with the combination of Noble Roar and Roost. Teammates that handle these threats include options such as Urshifu-R and Fling + Swords Dance Haxorus.</p> "
      },
      {
        "name": "Choice Specs",
        "description": "<p>Primarina's great Special Attack and Special Defense, along with the wide variety of moves available to it and its decent defensive typing of Water / Fairy, allow it to be a potent threat in the metagame. Hydro Cannon, boosted with Choice Specs, can OHKO many threats such as Choice Scarf Galarian Darmanitan, physically defensive Corviknight, Incineroar, and Arcanine. Sparkling Aria is a less powerful alternate to Hydro Cannon, with its main upsides being that it doesn't have a recharge turn and can go through Substitutes. Sparkling Aria can take down the likes of Aegislash for Primarina. Moonblast is Primarina's most powerful Fairy-type move and is used to cover Dragon-types like non-Disable Dragapult, Dracovish, Haxorus, and Hydreigon. Energy Ball is a coverage move for Primarina which allows it to take on opposing Water-types for Primarina, such as non-Choice Specs Primarina, non-Thunderbolt stall Rotom-W, and Gastrodon. 248 HP and 148 Defense EVs allow Primarina to take an Poison Jab from Choice Band Haxorus and Choice Band Urshifu, while the 64 Special Defense combined with the aforementioned HP gives Primarina the bulk to take a Hyper Beam from Choice Scarf Porygon-Z. Alternatively, running 96 HP and 196 Special Defense alongside 156 Special Attack with a Modest Nature allows Choice Specs Primarina to beat Porygon-Z, even if their Choice Specs is removed through Trick. A spread of 252 HP / 232 Def / 20 SpA / 4 SpD with a Bold Nature can be run in order to survive a Rock Wrecker from Choice Band Crustle.</p> <p>Bulky Pokemon with Mirror Coat like Milotic and Avalugg take out Primarina with ease, so teammates that can counteract those Pokemon like Sylveon and Taunt Whimsicott make good partners for Primarina. In return for these teammates, Primarina can take down Steel-types that these are weak to like Corviknight and Excadrill. Primarina is also stopped in its tracks by Grass-types like Celebi, Ferrothorn, Rillaboom, Venusaur, and Whimsicott, so Fire-types like Arcanine and Salazzle can make good partners for Primarina, also allowing there to be a potential Fire / Water / Grass core. In return, Primarina can take out Water-types with its Energy Ball, such as Blastoise, non-Choice Specs Primarina, and Gastrodon. Primarina also loses Electric-types like Zeraora, Dracozolt, and Toxtricity, so Ground-types like Rhyperior and Choice Scarf Diggersby and Pokemon with Ground-type coverage like Conkeldurr and Choice Scarf Haxorus make good teammates for Primarina. In return, Primarina can take on Pokemon for the Ground-types like Blastoise, non-Choice Specs Primarina, Gastrodon, and Galarian Darmanitan. Stall Pokemon that can take advantage of Primarina like Galarian Corsola and Type: Null pose a threat to it, so wallbreakers like Taunt Corviknight and Incineroar are good teammates for Primarina. In return, Primarina can take down Choice Band Dracovish, Choice Scarf Rotom-H, and Keldeo for these teammates.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 276708, "username": "Alakazam"}, {"user_id": 480297, "username": "zioziotrip"}, {"user_id": 317056, "username": "dogknees"}, {"user_id": 425798, "username": "pqs"}]}, {"name": "Grammar checked by", "members": [{"user_id": 297659, "username": "deetah"}, {"user_id": 388157, "username": "A Cake Wearing A Hat"}]}], "writtenBy": [{"user_id": 451287, "username": "Krytocon"}, {"user_id": 425798, "username": "pqs"}]}
  },
  "Pyukumuku": {"sets": [{"name": "Stall"}]},
  "Togedemaru": {
    "sets": [
      {
        "name": "FEAR ME",
        "description": "<p>By employing the FEAR strategy, Togedemaru can use Sturdy to keep itself at 1 HP, Endeavor to simultaneously bring the foe down to 1 HP and heal itself back to full HP with Shell Bell, and Toxic or Spiky Shield to finally finish off the foe. This strategy can beat Pokemon such as Dracovish, Diggersby, and Sawk. This set's main purpose is psychological warfare; its presence instills fear into the opponent at Team Preview, making the user's own picking easier. The EVs are irrelevant due to the nature of being Level 1. Endeavor is crucial in order to bring the foe to 1 HP for Togedemaru to finish it off with Toxic or Spiky Shield. Toxic is Togedemaru's main way to finish off the foe. Note that if the foe uses Counter, Toxic should be used first before Endeavor. Spiky Shield is used to finish off the foe if they rely on contact moves, such as Sawk, Durant, and Conkeldurr. This is useful because unlike Toxic, Spiky Shield cannot miss, and it protects Togedemaru from moves like Knock Off, which removes Shell Bell, and Iron Head, which can cause Togedemaru to flinch. Additionally, Spiky Shield is also used to scout for Trick or Switcheroo from common Choice-item Pokemon such as Gardevoir, Rotom-W, Rotom-H, and Malamar. If Trick or Switcheroo is used, Encore can then be used to lock the foe into the move, allowing Togedemaru to freely use Endeavor and Toxic. Encore also allows Togedemaru to turn its matchup against Will-O-Wisp users like Arcanine into a coinflip. Berry Juice is another option over Shell Bell, allowing Togedemaru to consistently beat Counter users like Chansey while sacrificing matchups against some Sitrus Berry users like Arcanine. Alternatively, Disarming Voice can be used for its flawless accuracy and ability to hit Steel-types like non-Rock Blast Choice Band Steelix and Choice Specs Magnezone. However, Disarming Voice must be used with Shell Bell in order to bring the enemy to 1 HP. Togedemaru is completely helpless against anything that is immune to Endeavor, such as Dragapult, Galarian Corsola, and Zeraora after it uses Plasma Fists. Pokemon like Fake Tears Sylveon can help remedy this, along with beating Rest users like Type: Null and stall Rotom-W, while Togedemaru takes care of threats to Sylveon such as Dracovish and Diggersby. The FEAR strategy also gets ruined by Substitute, Encore, and Yawn users such as Volcarona, Aromatisse, and Sylveon. Choice Band Dracovish can take care of these threats as well as help with Taunt users like Corviknight and Mandibuzz that Togedemaru cannot break. In return, Togedemaru can defeat Pokemon like Sawk and non-Substitute Kyurem. Togedemaru is also weak to Pokemon that use Mold Breaker, such as Haxorus and Excadrill, so teammates like bulky Primarina can cover for them. Togedemaru in return beats Pokemon like Diggersby and Milotic for Primarina.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 480297, "username": "zio"}, {"user_id": 317056, "username": "dogknees"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Estronic"}]}], "writtenBy": [{"user_id": 470842, "username": "Eriey"}]}
  },
  "Kommo-o": {
    "sets": [
      {
        "name": "Haban Berry",
        "description": "<p>Kommo-o is a notable threat in 1v1 because of its versatility, as it is able to provide both offensive and defensive utility with the combination of Iron Defense and Body Press. These two moves allow Kommo-o to wall and takedown threats like Crustle, Rotom-W, and Snorlax. Clanging Scales is a STAB move for hitting Dragon-types such as Dracovish, Timid Choice item Dragapult, and Dracozolt. The fourth slot can either be Counter, used to beat Choice Band Urshifu-S and Urshifu-R, Taunt, which is used for shutting down stall Pokemon like Corviknight and Gastrodon, or Substitute, which is for walling most Sylveon variants, In this case, Soundproof grants Kommo-o immunity to Hyper Voice, although there are risks involved for variants that carry both Quick Attack and Hyper Beam. Haban Berry is used to tank other Dragon-type attacks, namely Draco Meteor from Dragapult and Outrage from Choice Band Dracovish and Choice Band Dracozolt. The HP investment is for tanking a Draco Meteor from Timid Choice Specs Dragapult, while the Special Attack investment is to ensure that Clanging Scales OHKOes non-Haban Berry Dracovish. The Speed investment is to outspeed Adamant Choice Band Diggersby and the rest is dumped into Defense with a Bold nature to maximize defensive and offensive capabilities. An alternative EV spread of 200 HP / 84 Def / 224 SpD with a Bold nature can be run in order to survive a Choice Scarf Hyper Beam from Porygon-Z, with the leftover EVs invested into Defense to maximize Body Press' power.</p> <p>Kommo-o's typing makes it extremely weak to Fairy-type attacks from Pokemon such as Gardevoir, Primarina, and Aromatisse. Steel- and Poison-types such as Durant, Togedemaru, and Silvally-Poison are good teammates since they can deal with these threats. Kommo-o is a good partner for Steel-types such as Ferrothorn and Corviknight, as it covers their weakness to Fire- and Fighting-type Pokemon such as Incineroar and Conkeldurr. Kommo-o struggles to deal with Ghost-types that can't be OHKOed by Clanging Scales, Pokemon that can 2HKO it such as Aegislash, Gengar and Chandelure, as well as Psychic-types that OHKO it such as Celebi and Gardevoir. As such, Pokemon with naturally high Special Defense like Choice Band Snorlax and Choice Specs Rotom-H make for generally good partners, since they can often take a hit and then OHKO back. Kommo-o is also weak to Ice-type moves from Pokemon such as Avalugg, Galarian Darmanitan, and offensive Kyurem, so Fire- and Rock-types such as Arcanine and Crustle are good partners for Kommo-o.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 480297, "username": "pqs"}, {"user_id": 317056, "username": "dogknees"}, {"user_id": 480297, "username": "zio"}]}, {"name": "Grammar checked by", "members": [{"user_id": 216033, "username": "Winry"}]}], "writtenBy": []}
  },
  "Tapu Koko": {
    "comments": "<h1>Other Options</h1> <p>Tapu Koko can run Dazzling Gleam on occasion over Thunderbolt covering Curse Dragapult and Zeraora, at the cost of doing less damage because of Dazzling Gleams lower Base Power and the loss of the Electric Terrain boost. Using Dazzling Gleam instead of Thunderbolt also makes matchups against Steel- and Fire-types, such as Aggron and Heatran, much longer, giving them more chances to get a critical hit, which would KO Tapu Koko through its boosts.</p> ",
    "sets": [
      {
        "name": "Electric Seed Stall",
        "description": "<h1>Set Description</h1> <p>Tapu Koko has a niche in 1v1 due to its ability to disrupt opposing Pokemon utilizing its useful status moves with its quick Speed. It gets access to reliable recovery in the form of Roost, which is essential to staying alive long enough to whittle down foes using Thunderbolt. Thunderbolt is usually used once foes can no longer damage Tapu Koko more quickly than it heals. Eerie Impulse shuts down many special attackers such as Tapu Lele, non-Choice Scarf Heatran, and Necrozma. Taunt is for a better matchup against opposing stall Pokemon, such as Registeel and Zapdos. It also stifiles setup Pokemon, like Nasty Plot Galarian Moltres, Fake Tears Sylveon, and Metal Sound Magnezone. With the above moves, combined with the immediate +1 Defense boost from Electric Surge and the Electric Seed, many slower Pokemon, such as Sawk and Necrozma, cannot KO it before it KOes them. Tapu Kokos moveslots can be flexible, and some teams may require Tapu Koko to drop Taunt for Iron Defense, beating more physical threats such as Rillaboom and Avalugg.</p> <h1>EVs</h1> <p>The Speed EVs on this set are for neutral-natured Choice Scarf Dracozolt and Dracovish. The HP investment ensures overall bulk, and the rest of the EVs are put in Special Defense, increasing the chances of Tapu Koko surviving against Choice Specs Porygon-Z and other special attackers after an Eerie Impulse.</p> <p>The Speed and Special Defense investments are customizable depending on what matchups Tapu Koko needs to cover. One such alternate option is a spread of 248 HP / 8 SpA / 156 SpD / 96 Spe with a Timid nature, which outspeeds Pokemon with base 110 Speed, such as Latios and Archeops, and survives Choice Specs Porygon-Zs Hyper Beam after an Eerie Impulse, with the rest of the EVs put in Special Attack to maximize the chance for Thunderbolt to 2HKO Porygon-Z.</p> <h1>Usage Tips</h1> <p>Playing with Tapu Koko can require some informed guesses about what moves and items the foe is running. Many Pokemon, like Jirachi and Togekiss, have Choice Scarf variants that run Trick, which could lock Tapu Koko into a status move. To prevent this, you should use Thunderbolt against potential Trick Pokemon on turn 1. One major exception to this rule is the Cresselia matchup, where Tapu Koko should use Taunt first because Choice Scarf Cresselia does not usually run enough Speed EVs to be faster than Tapu Koko. Using Taunt on Cresselia also prevents non-Choice item variants from using Calm Mind. Outside of these matchups, blocking setup Pokemon such as Volcorona or Zapdos with Taunt or using Eerie Impulse or Iron Defense to live attacks from Volcanion and Rillaboom is the best first course of action.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 501918, "username": "Here Comes Team Charm!"}, {"user_id": 520168, "username": "Murman"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 518399, "username": "Itchyy"}]}
  },
  "Necrozma": {"sets": [{"name": "Bulky Choice Specs"}, {"name": "Stored Power"}]},
  "Zeraora": {
    "sets": [
      {
        "name": "Choice Band",
        "description": "<p>Zeraora uses its blisteringly high Speed to prey on foes that normally depend on being faster, such as Dragapult, Dracovish, and Choice Band Galarian Darmanitan. Plasma Fists allows Zeraora to beat Flying- and Water-types like Corviknight, Mandibuzz, and Milotic, as well as frail Pokemon like Choice Band Galarian Darmanitan. Outrage is crucial to defeat Dragon-types such as Dragapult, Hydreigon, and Haxorus. Play Rough can be run to beat Dragon-types that run Haban Berry alongside Chople Berry Urshifu-S, but it has less accuracy and power, making OHKOs on Pokemon like Haxorus not guaranteed. Close Combat is useful for Pokemon like Modest Choice Scarf Porygon-Z, Urshifu-S, Tyranitar, and non-Choice Scarf Excadrill. Knock Off is used to OHKO Choice Scarf Chandelure and also to defeat Alolan Marowak and Gardevoir. Blaze Kick has limited use and can be run for Ferrothorn. Maximum Attack and Speed investment is run in order for Zeraora to OHKO Urshifu-S with Close Combat and outspeed both Dragapult and Modest Choice Scarf Porygon-Z. Alternatively, a spread of 8 HP / 156 Atk / 92 Def / 252 Spe can be run in order to survive an Earthquake from Choice Scarf Haxorus, but makes the Urshifu-S matchup less reliable.</p> <p>Zeraora unfortunately has middling Attack and loses to bulky offensive threats like Aegislash, Incineroar, and Avalugg. Pokemon like Milotic and stall Rotom-W can remedy this, while Zeraora covers Pokemon like Dracozolt and Dragapult. Zeraora is also weak to certain stall Pokemon like Galarian Corsola, Whimsicott, and Gastrodon, so Pokemon like Sylveon and Chandelure can help with facing them. In return, Zeraora can beat Pokemon like Dracovish and Choice Band Tyranitar.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 475993, "username": "Boat"}, {"user_id": 276708, "username": "Alakazam"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Estronic"}]}], "writtenBy": [{"user_id": 470842, "username": "Eriey"}]}
  },
  "Rillaboom": {"sets": [{"name": "Life Orb"}, {"name": "Grassy Seed"}, {"name": "SubSeed"}]},
  "Corviknight": {
    "sets": [
      {
        "name": "Physically Defensive",
        "description": "<p>Corviknight has a brilliant Flying / Steel typing and good mixed bulk, allowing it to act as a good check to several offensive threats such as Excadrill, Choice Scarf Sawk, and Choice Scarf Dracovish. Additionally, Corviknight's access to status moves like Iron Defense and Roost lets it beat most physical threats that can't 2HKO it, such as Sawk, Golisopod, and Durant. 248 HP and 100 Defense EVs allow Corviknight to avoid the 2HKO from Choice Scarf Dracovish after Sitrus Berry and Choice Scarf Galarian Darmanitan's Flare Blitz. 80 Special Defense, alongside the HP, lets Corviknight survive two Ice Beam from Choice Scarf Kyurem, letting Corviknight PP stall. The rest of the EVs are put into Speed, allowing Corviknight to outspeed non-Jolly Crustle and Gardevoir, if it receives a Choice Scarf through Trick. Generally, it's better to match Corviknight against physical threats that can't 2HKO it such as Crustle, Tyranitar, and Golisopod, as it can then use Iron Defense to bolster its Defense to the point where it can start to PP stall them via Pressure and use Roost to recover any incurred damage. Iron Head is Corviknight's main STAB move, and it allows Corviknight to hit Ice- and Fairy-types such as non-Choice Band Galarian Darmanitan, Whimsicott, and Gardevoir. Corviknight can also run Body Press, which will allow it to KO Choice Scarf Dracovish without waiting for it to run out of PP. This is expressly for the purpose of avoiding potential critical hits, and outside of this is wholly inferior to Iron Head. Corviknight can also handle Pokemon such as Choice Scarf Dragapult and Choice Scarf Hydreigon through using Pressure to PP stall Fire Blast and slowly recover health until the foe struggles. An alternative spread of 56 HP / 252 Def / 200 Spe can be run in order to outspeed Modest Sylveon, avoiding Yawn and Fake Tears shenanigans, while still almost always beating Choice Scarf Dracovish. Corviknight in general can run many different Speed benchmarks, depending on what it needs to get done, which can let it beat opposing Taunt users such as bulky Mandibuzz, bulky Kommo-o, or physical threats, like Choice Band Diggersby.</p> <p>Dragon-type Pokemon such as Dragapult, Hydreigon, and Haxorus appreciate Corviknight's ability to handle Ice- and Fairy-type Pokemon such as Galarian Darmanitan, and Sylveon. In return, they take advantage of the Fire- and Electric-type Pokemon that Corviknight struggles against, including Chandelure, Dracozolt, and Rotom-H. Galarian Darmanitan, in particular, pairs well with Corviknight, as it is able to check some Electric- and Dragon-type Pokemon such as Choice Specs Dragapult, Choice Specs Hydreigon, and Dracozolt. In return, Corviknight can handle Pokemon like Aegislash and Crustle and threaten the aforementioned Pokemon. Corviknight appreciates Electric-type Pokemon such as Dracozolt and Rotom-W, as they can handle Water-type Pokemon such as Dracovish and Inteleon, which Corviknight struggles to beat. On the other hand, the same Electric-types, benefit from Corviknight's typing and ability to defeat many Ground-types that would otherwise give them trouble, such as Rhyperior and Excadrill.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 457210, "username": "Le Creme Brule"}, {"user_id": 302951, "username": "Nalei"}]}, {"name": "Grammar checked by", "members": [{"user_id": 241023, "username": "Kris"}]}], "writtenBy": [{"user_id": 430787, "username": "PA"}]}
  },
  "Dracozolt": {
    "sets": [
      {
        "name": "Choice Scarf",
        "description": "<p>Dracozolt outspeeds and quickly KOes a significant portion of the metagame. Its ability Hustle contributes to a large portion of its power but makes using Dracozolt risky because it lowers the accuracy of Dracozolt's moves. Bolt Beak is an exceptionally powerful STAB-boosted attack; it deals with Flying-types like Corviknight and Mandibuzz, Water-types like Golisopod, Primarina, and Milotic, and generally Pokemon that do not resist it like Choice Band Galarian Darmanitan. A neutral Bolt Beak will do the most damage unless Outrage is super effective or a coverage move is four times super effective against a foe. Outrage hits Choice Band Haxorus and Choice Specs Hydreigon. Earthquake handles non-Choice Scarf Excadrill and Bisharp. Low Kick handles Choice Band Tyranitar, and Fire Fang beats Chople Berry Ferrothorn. Dracozolt's offensive capabilities are the focus of the given EV spread. An Adamant nature gives it even more power, helping most importantly against non-Life Orb Aegislash and bulky Sylveon.</p> <p>Dracozolt struggles with Fairy-types such as Galarian Weezing and Aromatisse, so Steel-types like Aegislash and Duraludon are good partners, and Dracozolt can take care of their weakness to Flying-types like Corviknight and Mandibuzz and Water-types like Milotic. Mold Breaker Pokemon, specifically Excadrill and Haxorus, are helpful against Sturdy and Disguise Pokemon, specifically Crustle and Sawk, and Dracozolt defeats some bulky Flying-types like Corviknight and Mandibuzz and Water-types like Golisopod. Other Dragon-types, most notably Dragapult and Choice Scarf Haxorus, can threaten Dracozolt by outspeeding it; these Pokemon can be beat back by walls such as Galarian Corsola, Fairy-types such as Galarian Weezing, Haban Berry Dragon-types such as Goodra, and to a lesser extent, Choice Scarf Galarian Darmanitan. Special wallbreakers such as Fake Tears Sylveon and Choice Specs Hydreigon complement Dracozolt by dealing with physical walls like Galarian Corsola and Duraludon, and in return, Dracozolt breaks down special walls like opposing Sylveon and Milotic. Dracozolt's weakness to Ground-types such as Rhyperior and Gastrodon can be covered by the likes of Corviknight and stall Rotom-W.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 457210, "username": "Le Creme Brule"}, {"user_id": 302951, "username": "Nalei"}]}, {"name": "Grammar checked by", "members": [{"user_id": 241023, "username": "Kris"}]}], "writtenBy": [{"user_id": 465905, "username": "Cantius"}]}
  },
  "Dracovish": {
    "sets": [
      {
        "name": "Choice Band",
        "description": "<p>Fishious Rend serves as a check-all to Pokemon slower than Dracovish, such as Sylveon, Chansey, Snorlax, and Aromatisse, as well as against Fire-types like Chandelure and Rotom-H and frailer Pokemon like Choice Scarf Galarian Darmanitan. Fishious Rend will actually do more damage than Outrage against slower opponents that resist it, so Outrage should only be used against potentially faster threats like Rotom-W and priority users like Golisopod. Psychic Fangs OHKOs Urshifu-R. Low Kick is only useful against Ferrothorn, doing marginally more damage than Fishious Rend, and Bisharp, which can avoid double damage with Sucker Punch. Dracovish runs 8 HP and 72 Defense EVs in order to survive a non-Adamant Choice Band Close Combat from Urshifu-R. 176 Speed investment is used to outspeed as many Pokemon as possible, and specifically non-Jolly Sirfetch'd and max Speed Crawdaunt. Maximum Attack is run to OHKO Chansey. Special Defense can be invested into Dracovish in order to lure in and beat bulky non-Choice Specs Primarina. It will require heavy investment with a Careful nature, and matchups against certain Pokemon will have to be sacrificed to gain good odds against bulky Primarina. For example, one can run a spread of 176 Atk / 196 SpD / 136 with a Careful nature, which has the Attack investment needed to OHKO Snorlax, and the Speed necessary to outspeed Sylveon, or a spread of 148 Atk / 196 SpD / 164 Spe with a Careful nature, which outspeeds uninvested Arcanine and has the Attack investment for Choice Scarf Galarian Darmanitan. Be aware that Dracovish won't be able to beat the rarer, more offensive variants of Primarina.</p> <p>Fishious Rend is notable for being able to beat Aegislash, which can normally beat physical attackers with King's Shield, and Primarina, given the appropriate Special Defense investment. Despite being Fire-types, faster Arcanine variants and Substitute Volcarona beat Dracovish, either by losing its Fire typing through Burn Up, knocking Dracovish out with Outrage, or activating Swarm and Petaya Berry and OHKOing with Bug Buzz. Sturdy Pokemon are usually slower than Dracovish, but beat Dracovish anyway, since they avoid being OHKOed, and thus Crustle, Magnezone, and Sawk should be avoided. Galarian Corsola can beat Dracovish, despite being slower, since their access to Strength Sap and Cursed Body can heal off damage dealt until Dracovish's Fishious Rend is disabled. Bulky Steel-types like Aegislash and Magnezone are generally appreciated as partners for Dracovish, who can generally handle offensive Fairy- and Dragon-type Pokemon like Togekiss and Kyurem, as well as fast offensive nukes like Galarian Darmanitan and Porygon-Z, and Galarian Corsola. Aqua Jet Chilan Berry Primarina can also be used as a partner to shore up Dracovish's weakness against Sturdy Pokemon, as well Dragon-type Pokemon, Porygon-Z, and Galarian Darmanitan.</p> "
      },
      {
        "name": "Choice Scarf",
        "description": "<p>Choice Scarf Dracovish functions as a decently fast wallbreaker that does well against frailer Pokemon. Choice Scarf compensates for Dracovish's meager base 75 Speed, allowing it to boost Fishious Rend's damage output. With a Strong Jaw-boosted Fishious Rend, Dracovish can deal massive damage to slower moderately bulky foes, such as Arcanine, Sylveon, and Choice Specs Porygon-Z. Outrage can be used to beat slower, non-Haban Berry Dragon-types that easily live a Fishious Rend, such as Choice Band Haxorus. Leech Life is used to beat Malamar. Low Kick is used to beat Bisharp, since it can otherwise use Sucker Punch on a Fishious Rend and nullify the double damage.</p> <p>Naturally, certain Pokemon that Dracovish can outspeed and beat with a Choice Scarf can turn the tables against Dracovish if they themselves run Choice Scarf. Pokemon like Galarian Darmanitan, Haxorus, Hydreigon, Gardevoir, and Togekiss can all win if use this item. Some offensive Pokemon that Dracovish can hit first with Fishious Rend or Dragon-types that don't use Haban Berry will be able to win regardless. Kyurem is naturally bulky enough to survive an Outrage with reasonable investment, Snorlax always runs large amounts of defensive investment, and Sturdy users like Crustle, Magnezone, and Sawk can all naturally avoid being OHKOed and threaten you in return. All stall Pokemon in general should be avoided, outside of Porygon2, which has no way to either threaten Dracovish or lessen damage taken, and is eventually knocked out. Fairy- and Steel-type Pokemon like Magnezone and Sylveon can be paired with Dracovish to make up for its weakness against problematic Dragon- and Fairy-type Pokemon. The two aforementioned Pokemon can also use Metal Sound and Fake Tears to help beat stall Pokemon.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 457210, "username": "Le Creme Brule"}, {"user_id": 475993, "username": "Boat"}, {"user_id": 425798, "username": "pqs"}, {"user_id": 457703, "username": "Synonimous"}]}, {"name": "Grammar checked by", "members": [{"user_id": 241023, "username": "Kris"}]}], "writtenBy": [{"user_id": 276708, "username": "Alakazam"}, {"user_id": 501316, "username": "zxgzxg"}]}
  },
  "Dragapult": {
    "sets": [
      {
        "name": "Choice Specs",
        "description": "<p>Draco Meteor is Dragapult's strongest attack and is STAB-boosted and used to KO both frail and non-Haban Berry Dragon-type Pokemon, like Dracovish and Choice Band Haxorus. Shadow Ball also receives a boost from STAB and hits Pokemon such as non-Choice Scarf Gengar, physically defensive Galarian Corsola, and Choice Specs Chandelure for super effective damage. Opposing Substitute + Disable Dragapult will also be threatened by Shadow Ball. Flamethrower is mostly used to hit Steel-types such as Corviknight, Excadrill, and Ferrothorn. Hydro Pump is an option that improves matchups against Arcanine and non-Assault Vest Rhyperior. Thunderbolt may be used to beat Gyarados. The given Speed EVs allow Dragapult to outspeed Pokeomon like Inteleon and Adamant Choice Scarf Diggersby, with a slight optimization to always live Choice Specs Flash Cannon from Magnezone.</p> <p>Dragapult does well on teams with walls such as Corsola, Corviknight, and Milotic, as it's able to take on many of the hardest-hitting Pokemon in the tier such as Choice Band Galarian Darmanitan, Dracovish, Choice Specs Hydreigon, which can brute through stall. In turn, Dragapult appreciates their ability to take on most Choice Scarf users that can outspeed it such as Hydreigon, Haxorus, and Sawk. Dragapult does not hit especially hard, so many Pokemon may run EVs to tank hits from it, such as Aegislash and Arcanine, which a Dragapult user should be aware of. Dragapult is very easy to use; with few exceptions, use the move the deals the most damage.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 457703, "username": "Synonimous"}, {"user_id": 457210, "username": "Le Creme Brule"}]}, {"name": "Grammar checked by", "members": [{"user_id": 241023, "username": "Kris"}]}], "writtenBy": [{"user_id": 302951, "username": "Nalei"}]}
  },
  "Urshifu": {"sets": [{"name": "Assault Vest"}, {"name": "Chople Berry"}]},
  "Spectrier": {"sets": [{"name": "Will-o-Wisp + Hex"}]}
}