{
  "Alakazam": {"sets": [{"name": "Psychic Surge"}]},
  "Slowbro": {"sets": [{"name": "Defensive"}]},
  "Chansey": {"sets": [{"name": "Defensive"}]},
  "Zapdos": {
    "comments": "<h1>Other Options</h1> <p>Zapdos does not have any other viable coverage moves other than Weather Ball. Volt Switch can be used over Thunder, as it allows Zapdos to run Weather Ball. Zapdos's EVs can vary significantly, mostly depending on what it wants to outspeed. As mentioned above, 72 Speed EVs allows Zapdos to outspeed Modest maximum Speed investment Heatran, allowing Zapdos to either pivot out via U-turn or deal a large amount damage with Weather Ball, while 56 Speed EVs allow Zapdos to outspeed Adamant Tapu Bulu and then KO it with Hurricane. Maximum Speed investment can also be run on Zapdos to help its team's matchup against Tapu Lele, Genesect, and Adamant Zarude. Additionally, Zapdos can opt to run a more defensive spread to better fit into its role as a check to physical attackers such as Talonflame. Defog can also be run on Zapdos, but it is usually not a good option, as Zapdos already struggles with fitting all of the moves it wants.</p> <h1>Checks and Counters</h1> <p><strong>Blissey: Blissey, one of the tier's most common special walls, is very problematic for Zapdos, as it takes very little damage from both Hurricane and Thunder. This means that without an extreme amount of luck, Zapdos is never able to break it.</p> <p><strong>Desolate Land Users</strong>: Many Desolate Land users are able to comfortably switch in on Zapdos, taking its rain away and reducing the accuracy of its STAB attacks to 50% while also changing Weather Ball from a super effective hit to a resisted one.</p> <p><strong>RegenVest</strong>: Pokemon holding Assault Vest are difficult for Zapdos to break, as they take very little damage from Zapdos's attacks and can heal themselves easily thanks to Regenerator. Most of them, such as Silvally-Dragon, Swampert, and Jirachi, resist or are immune to either Thunder or Hurricane, allowing them to slowly pivot out against Zapdos and bring in a powerful breaker that threatens Zapdos.</p> <p><strong>Offensive Rock- and Ice-types: While Zapdos is bulky enough to take neutral hits without much investment, it is still weak to powerful breakers with super effective STAB moves such as Terrakion and Mamoswine that usually outspeed and OHKO it.</p> <p><strong>Volt Absorb Corviknight: Zapdos has a very hard time breaking Volt Absorb Corviknight, as it either resists or is immune to both of its STAB moves and can slowly pivot against Zapdos with U-turn to bring in a breaker that threatens Zapdos out.</p> ",
    "sets": [
      {
        "name": "Primordial Sea",
        "description": "<p>Zapdos fills the role of a bulky Flying-type capable of both offensively and defensively checking many Pokemon in the AAA metagame, such as Talonflame, Desolate Land Heatran, Volcarona, and Moltres, as well as most Fighting-types including Kommo-o. Zapdos's STAB moves allow it to hit almost every relevant Pokemon for at least neutral damage while also having a 30% chance to cripple something with paralysis or confusion. Weather Ball is another attacking option, most notably hitting Desolate Land Heatran for significant damage. U-turn allows Zapdos to pivot out on a predicted switch to a counter, which is a great trait to have in a momentum-reliant tier like AAA and allows it to still make progress against teams with reliable answers to it. Roost gives Zapdos significant longevity and allows it to absorb hits over the course of a longer battle. Zapdos's EVs are very customizable and can be changed depending on what a team needs it to do. The given spread maximizes Zapdos's bulk and power while still outspeeding Modest Heatran.</p> <p>Zapdos can fit on many different team archetypes because of its ability to take neutral hits while threatening powerful attacks back. If Zapdos is not running Weather Ball, it is very weak to Desolate Land users such as Heatran, as it resists Hurricane and takes neutral damage from Thunder, as well as lowering the accuracy of both of those moves to 50% due to the harsh sun. Thus, Zapdos appreciates Pokemon such as Assault Vest Silvally-Dragon that can switch in on the Fire-types safely and then pivot out. Zapdos pairs very well with Pokemon that can threaten specially defensive Pokemon such as Blissey and Assault Vest Swampert that take neutral damage from its STAB attacks. Good partners for this include Zarude and Terrakion. These attackers pair very well with U-turn, as they are able to take advantage of the momentum Zapdos creates. In return, Zapdos can threaten their walls such as Corviknight and Kommo-o.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523886, "username": "UT"}, {"user_id": 524664, "username": "Osake"}]}, {"name": "Grammar checked by", "members": [{"user_id": 241023, "username": "Kris"}]}], "writtenBy": [{"user_id": 525446, "username": "DuckeryDoodle"}]}
  },
  "Zapdos-Galar": {"sets": [{"name": "Magic Guard"}, {"name": "Choiced Attacker"}]},
  "Moltres": {"sets": [{"name": "Magic Guard"}, {"name": "Desolate Land"}]},
  "Mew": {"sets": [{"name": "Physically Defensive"}, {"name": "Cosmic Power"}]},
  "Heracross": {"sets": [{"name": "Choice Band"}]},
  "Skarmory": {"sets": [{"name": "Defensive"}]},
  "Blissey": {"sets": [{"name": "Defensive"}]},
  "Tyranitar": {"sets": [{"name": "Specially Defensive"}]},
  "Swampert": {"sets": [{"name": "Physically Defensive"}, {"name": "Specially Defensive"}]},
  "Milotic": {"sets": [{"name": "Assault Vest"}]},
  "Latios": {"sets": [{"name": "Calm Mind"}, {"name": "Choice Specs"}]},
  "Jirachi": {"sets": [{"name": "Assault Vest"}, {"name": "Magic Guard"}]},
  "Garchomp": {"sets": [{"name": "Swords Dance"}, {"name": "Choice Scarf"}]},
  "Lucario": {"sets": [{"name": "Magic Guard"}]},
  "Hippowdon": {"sets": [{"name": "Defensive"}]},
  "Togekiss": {
    "comments": "<h1>Other Options</h1> <p>Aura Sphere can replace Psyshock or Flamethrower to give Togekiss more effective counterplay towards Heatran and Flash Fire Steel types like Ferrothorn. Three-attack Togekiss can drop the Roost slot and defensive utility to run both Psyshock and Fire Blast, allowing for a sweep versus a wider variety of teams in the late game. However, because it needs to rely on Draining Kiss for recovery instead of Roost, this set doesn't have as much longevity as the standard two attack set. Heavy Duty Boots can be run on Togekiss if it's put on a team without adequate entry hazard control, which helps keep its health topped off throughout the game, at the cost of significantly lower damage output.</p> <h1>Checks and Counters</h1> <p><strong>Offensive Fairy-resistant Pokemon: Fire- and Steel-type Pokemon like Volcarona, Heatran and Genesect resist Togekiss's main attacking option in Draining Kiss, outspeed it and threaten a KO. However, most of them don't have reliable recovery and can't come in on one of Togekiss's coverage moves.</p> <p><strong>Anti-setup Pokemon: Walls such as Prankster Toxapex and Unaware Chansey and Blissey act as full stops to the standard Togekiss sets. In general, Toxic users can easily stop Togekiss from sweeping and let it get KOed from Toxic + Life Orb recoil.</p> <p><strong>Specially Defensive Pivots: Regenerator pivots such as Assault Vest Swampert can switch into Togekiss and pivot into adequate revenge killers.</p> <p><strong>Priority Blockers: Fast Pokemon with priority-blocking abilities such as Azelf are immune to Togekiss's Triage-boosted Draining Kiss, preventing Togekiss from safely sweeping until they are removed from the match.</p> ",
    "sets": [
      {
        "name": "Triage",
        "description": "<p>Togekiss acts as a late-game sweeper capable of outspeeding every non-Triage Pokemon with its +3 priority-boosted recovery moves. Draining Kiss acts as Togekiss's main STAB move, and despite its Base Power, its damage output can be increased greatly with Life Orb and Nasty Plot. Togekiss is able to effectively outspeed the entire metagame, meaning Pokemon that can effectively revenge kill it are few and far between, being limited to Fairy resistant Pokemon and Dazzling or Psychic Surge Pokemon. This gives Togekiss a uniquely good matchup versus pivot-heavy bulky offense teams that do not carry an offensive Fire- or Steel- type. Togekiss is also able to set up on and brute-force its way through passive switch-ins such as Corviknight and non-Toxic Blissey. In the late game, Togekiss especially shines as a setup sweeper and wincon when the opponent's team is sufficiently weakened. Because Roost is also a healing move, it benefits from the +3 priority boost provided from Triage as well, allowing Togekiss to sponge some attacks with its above-average bulk and excellent typing and allowing it to act as a check to key threats such as Zarude and Garchomp. Due to Togekiss's narrow niche and need for heavy chip damage on Pokemon that resist its moves to execute a successful sweep, it should be considered as a specialist, only being brought in when a KO can be guaranteed or to pressure exceptionally weak foes out. For coverage moves, Togekiss mainly chooses between Flamethrower and Psyshock. Flamethrower allows it to pressure and beat Steel-types more effectively, while Psyshock allows Togekiss to put a dent into special walls like Blissey and Poison-types like Toxapex. A Modest nature with maximum Special Attack investment aim to maximize Togekiss's offensive capabilities; since it is priority-reliant, Speed and HP investment can be customized, but the current spread allows it to outpace defensive Heatran.</p> <p>Because of its fast Fairy-type attacks, Togekiss acts as an excellent teammate for those that struggle to outpace Dragon-, Fighting-, and Dark-types like Garchomp, Galarian Zapdos, and Zarude. Bulky pivots like Regenerator Swampert and Blissey are both able to weaken those fast threats while switching into Togekiss to clean up with Draining Kiss. Togekiss also pairs nicely with offensive powerhouses like Tinted Lens Latios and Primordial Sea Barraskewda, which can put easily exploitable dents into an opponent's team composition, giving Togekiss a greater opportunity to overwhelm the opponent in the endgame. Because Fire-types are going to be some of Togekiss's first switch-ins, Fire resist-resistant teammates to tank attacks from Fire-types like Volcarona and Heatran are essential teammates. Regenerator Garchomp and Swampert are good teammates to tank attacks while also setting up Stealth Rock. On a similar note, setup sweepers that share the same offensive checks also make great teammates for Togekiss—Sheer Force Genesect and Triage Tapu Bulu can help clear the way for Togekiss by threatening to sweep unless a Fire-type is brought in to revenge kill them, in which case they can chip it low enough that Togekiss can clean up in the lategame, or vice versa. Pokemon that are able to set up hazards and pivot out slowly are also essential teammates for Togekiss, as their hazards weaken Togekiss's offensive switch-ins and allow for more wiggle room for Togekiss to set up Nasty Plot and execute a sweep. Finally, physically offensive Ground-types like Landorus-T or Garchomp are able to threaten Togekiss's common Steel-type counters such as Assault Vest Jirachi, as well as harming specially defensive walls like Blissey, enabling Togekiss's late-game cleanup.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 475804, "username": "The Number Man"}, {"user_id": 375662, "username": "Isaiah"}, {"user_id": 524664, "username": "Osake"}]}, {"name": "Grammar checked by", "members": [{"user_id": 241023, "username": "Kris"}]}], "writtenBy": [{"user_id": 226455, "username": "berry"}, {"user_id": 523866, "username": "UT"}]}
  },
  "Mamoswine": {"sets": [{"name": "Adaptability"}]},
  "Azelf": {
    "comments": "<h1>Other Options</h1> <p>Psyshock can be used to deal more damage to Assault Vest Swampert, Chansey, and Blissey. Azelf's coverage moves besides Fire Blast are generally not worth using.</p> <h1>Checks and Counters</h1> <p><strong>Chansey and Blissey: Azelf, like many other Pokemon, has trouble breaking Chansey and Blissey, as Expanding Force is a 4HKO on both of them. Psyshock can be used to improve this matchup, but it still doesn't 2HKO. This means that Azelf has to rely on Knock Off or Trick to remove their items and pivoting via U-turn to slowly weaken the two.</p> <p><strong>Zarude</strong>: Zarude is one of the most common Dark-types in the tier, meaning that it can switch in on a Expanding Force and then get a free turn. This creates a coinflip situation on whether your opponent will switch to it every time you bring out Azelf. Further, non-Specs Fire Blast doesn't OHKO it, and it can OHKO in return with priority Grassy Glide.</p> <p><strong>Genesect and Heatran</strong>: Similarly to Zarude, both Genesect and Heatran take Azelf's Expanding Forces well. This gives them free turns to set up or get powerful attacks off, respectively, forcing Azelf to pivot and predict well. Fire Blast greatly improves this matchup, dealing very good damage to both of them.</p> <p><strong>Terrain Users</strong>: Users of Grassy or Electric Terrain are problems for Azelf, as taking away its Psychic Terrain just about halves Azelf's damage output.</p> ",
    "sets": [
      {
        "name": "Psychic Surge",
        "description": "<p>Azelf has a unique role in AAA as a fast Expanding Force user with both pivoting in U-turn and utility moves such as Trick and Knock Off, which help punish defensive switch-ins like Corviknight and Blissey. Azelf is one of the fastest Pokemon in the tier, which, paired with the probability it pivots with U-turn, is very dangerous in a momentum-reliant tier like AAA. Equipped with a Choice Scarf, Azelf is able to outspeed Adamant Unburden-boosted Kommo-o, as well as outspeeding naturally fast Pokemon such as Tapu Koko, Talonflame and Barraskewda. This makes it a very reliable revenge killer, but Choice Specs is another option to better Azelf as a fast special wallbreaker. Azelf's ability Psychic Surge makes it a blanket check to many Triage and standard priority users, particularly Togekiss and Tapu Bulu. A Hasty nature takes advantage of Azelf's great Speed tier without sacrificing damage from U-turn or Knock Off.</p> <p>Azelf can fit on most teams because of its ability to check Triage and standard priority users while still being an offensive threat. Its less-than-ideal bulk means it appreciates slow pivots from a Pokemon like Swampert or Corviknight to get in safely. Azelf is vulnerable to entry hazards and being slowly worn down, as it lacks recovery as well. It's also weak to Pokemon that can double switch into Expanding Force and force a switch by threatening a KO back, such as Heatran. This, coupled with its tendency to force in special walls, means it pairs very well with Fighting-types such as Terrakion and Kommo-o, which can threaten the Steel- and Dark-types Azelf struggles to break through.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 375662, "username": "Isaiah"}, {"user_id": 523866, "username": "UT"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 525446, "username": "DuckeryDoodle"}]}
  },
  "Heatran": {
    "comments": "<h1>Other Options</h1> <p>Regenerator can be used to increase Heatran's already significant longevity; however, Heatran loses some of its formidable offensive presence. Bulletproof can also be utilized as a check to Tapu Lele as well as powerful Weather Ball users such as Primordial Sea Primarina and Zapdos; however, Bulletproof sets can eventually be chipped down or hit with a powerful non-ballistic move. Heatran can use the combination of Iron Defense and Body Press to reliably beat Blissey without the use of Taunt, as well as making it very difficult to KO from the physical side. Desolate Land Heatran can opt to use either Choice Scarf or Choice Specs in conjunction with Eruption. The former allows Heatran to outspeed most of the unboosted metagame and catch many opposing Pokemon off-guard with an incredibly powerful Fire-type attack. Choice Specs allows Heatran to deal large chunks of damage to the tier's premier special walls, such as Blissey and Assault Vest Swampert. However, these items are less consistent because these sets are often prone to chip damage and can be played around once revealed.</p> <h1>Checks and Counters</h1> <p><strong>Fire-immune Pokemon: Primordial Sea users can greatly diminish Heatran's presence on the field, and often threaten a KO, Barraskewda and Zapdos being two of the most prominent examples. In the case of Desolate Land Heatran, Flash Fire Steel-types are able to almost completely wall Heatran.</p> <p><strong>Blissey: Blissey is capable of comfortably switching into Heatran's attacks, barring Taunt, and can pivot into a strong breaker that can force Heatran out. However, non-Magic Bounce Blissey can be trapped and crippled via Taunt by Heatran, and even those will be trapped and eliminated by Mold Breaker variants.</p> <p><strong>RegenVest Users</strong>: RegenVest Pokemon that resist Magma Storm, such as Garchomp and Silvally-Dragon, are capable of comfortably taking Heatran's attacks and either threatening it immediately or switching to a Pokemon that can.</p> <p><strong>Ground-types: Ground-types such as Garchomp and specially defensive Landorus-T can switch into Heatran's attacks and threaten it out with a powerful Earthquake.</p> <p><strong>Terrakion: Although Terrakion cannot always reliably switch into Heatran, it can take advantage of slow pivots to come in and threaten Heatran with its powerful attacks.</p> ",
    "sets": [
      {
        "name": "Desolate Land",
        "description": "<p>Desolate Land Heatran serves as a powerful weather attacker capable of dealing heavy damage, even to Pokemon that resist its moves. Desolate Land allows Heatran to switch in and override the opposing weather, allowing it to check opposing Primordial Sea users like Zapdos, as well as turning Heatran's Water weakness into an immunity. In addition to Desolate Land Heatran's offensive presence, its natural bulk and typing allow it to switch into and act as a soft check to various attackers such as Tapu Koko, Togekiss, and Genesect. Magma Storm is a powerful STAB move that enables Heatran to trap and eliminate Pokemon that would otherwise be able to switch into its Fire-type attacks comfortably, such as Tapu Fini and Assault Vest Swampert. Heatran is one of the most reliable Stealth Rock setters in the AAA metagame, as it pressures common Defoggers such as Corviknight and Tapu Fini. Toxic is useful for chipping down key Pokemon on the other team that may resist or be immune to Heatran's attacking moves, such as Primordial Sea Zapdos, while Taunt is useful to trap and eliminate non-Magic Bounce Blissey, a common roadblock for Heatran. Maximum Special Attack and Speed EVs with a Modest nature allow Heatran to hit as hard as possible, while a Timid nature allows Heatran to outspeed Pokemon that may try to outspeed Modest Heatran, such as Primordial Sea Zapdos. However, Heatran can opt for more defensive EVs and less Speed EVs if desired.</p> <p>Desolate Land Heatran is typically found on balance and bulky offense teams that appreciate its ability to reliably keep Stealth Rock up and pressure common defensive Pokemon. Grass-type attackers such as Zarude and Tapu Bulu enjoy Heatran handling Steel-types that they would otherwise have a difficult time breaking through, such as Corviknight and Ferrothorn. In addition, Fairy-type attackers such as Tapu Koko often have trouble with the Steel-types that Heatran deals with handily. Desolate Land Heatran can also deal with Pokemon such as Tapu Fini and Swampert, which many of the tier's attackers greatly appreciate. Heatran benefits from having teammates that can utilize Grassy Surge to weaken Earthquake from foes such as Garchomp, as well as increasing the passive recovery Heatran accumulates through Leftovers. Heatran enjoys having a teammate with a Ground immunity on its team, such as Corviknight, to switch into powerful Earthquakes. Corviknight and other Defoggers make good partners for Heatran to help it avoid chip damage from entry hazards. Heatran also has trouble with opposing users of Primordial Sea, such as Zapdos, Barraskewda, and Primarina, and appreciates Pokemon such as Blissey and Tapu Fini to switch into those threats.</p> "
      },
      {
        "name": "Mold Breaker Utility",
        "description": "<p>Mold Breaker Heatran is a versatile and powerful utility Pokemon. Mold Breaker enables it to set up Stealth Rock even against foes that utilize Magic Bounce, such as Blissey, and eliminate Steel-type Flash Fire users, such as Ferrothorn and Corviknight. Mold Breaker Heatran, while fulfilling its role as a reliable entry hazard setter, also functions as a check to many attackers in the tier, namely Togekiss, Tapu Koko, Latios, Azelf, and Genesect, due to its typing letting it resist or take neutral damage from their STAB attacks and common coverage options. Magma Storm serves as Heatran's only attack, but it comes with a trapping effect that allows Heatran to rack up passive damage, especially in conjunction with either Protect or Toxic. Stealth Rock, when combined with Mold Breaker, makes Heatran one of the most reliable hazard setters in the metagame. Toxic is used to add more residual damage to the opposing team and can be used to deter even resistances and immunities, such as Tapu Fini and Primordial Sea Zapdos, from switching into Heatran. Protect is a very useful move for Heatran, allowing it to accumulate recovery from Leftovers, increasing its longevity, as well as scouting commonly Choice-locked attackers and stalling out low-PP attacks, such as Terrakion's Close Combat; Protect also allows Heatran to rack up chip damage from Magma Storm and Toxic on the foe. Taunt can be used to trap and heavily damage or eliminate common Heatran switch-ins such as Blissey and Mew that are utilizing Teleport. Heatran's EV spread enables it to outspeed 0 Speed Tapu Fini, which allows Heatran to prevent Defog with Taunt while also maximizing its special bulk; however, the spread is adaptable to the needs of the team.</p> <p>Mold Breaker Heatran excels at setting up Stealth Rock, which makes it a great partner for Pokemon like Terrakion that achieve much more favorable rolls on common switch-ins with Stealth Rock active. Mold Breaker Heatran's presence benefits various attackers that typically have trouble breaking through Steel-types such as Ferrothorn, Corviknight, and even the less common Skarmory. These attackers can include Pokemon like Tapu Lele, Tapu Koko, and Grassy Surge Zarude. If utilizing Taunt, Heatran is able to trap and eliminate Blissey, which various special attackers such as Primarina and Tapu Lele love. Zarude forms a powerful duo with Mold Breaker Heatran, as Heatran greatly appreciates Zarude's Grassy Terrain to increase its passive recovery and weaken opposing Earthquakes, as well as appreciating Zarude's powerful priority to eliminate threats to Heatran such as Barraskewda and Primarina. Heatran appreciates other specially bulky Pokemon and their ability to serve as switch-ins to special attackers like Primordial Sea Zapdos and Primarina, and it appreciates Ground-immune Pokemon such as Landorus-T and Corviknight for their ability to switch into Earthquake.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 524664, "username": "Osake"}]}, {"name": "Grammar checked by", "members": [{"user_id": 241023, "username": "Kris"}]}], "writtenBy": [{"user_id": 539897, "username": "I am prtty trash"}]}
  },
  "Excadrill": {"sets": [{"name": "Water Absorb"}]},
  "Conkeldurr": {"sets": [{"name": "Triage"}, {"name": "Choice Band"}]},
  "Ferrothorn": {"sets": [{"name": "Utility"}]},
  "Bisharp": {"sets": [{"name": "Swords Dance"}]},
  "Mandibuzz": {"sets": [{"name": "Defensive"}]},
  "Hydreigon": {"sets": [{"name": "Choice Scarf"}]},
  "Volcarona": {
    "comments": "<h1>Other Options</h1> <p>Volcarona can forgo some survivability and use a Sheer Force Life Orb set, increasing its damage output significantly. However, this set lacks the utility of Magic Guard and Desolate Land, and it usually requires a lot of support to work. Bug Buzz is also usable with Desolate Land to hit Psychic- and Dark-types for super effective damage. Both sets can be used in either a defensive or an offensive way with appropriate EV spreads, depending of the needs of your team. Offensive Desolate Land can opt for Solar Beam to threaten more bulky Water-types such as Tapu Fini and Swampert. Lastly, Toxic can be used on the bulkier sets to weaken switch-ins such as Garchomp thoughout the game.</p> <h1>Checks and Counters</h1> <p><strong>RegenVest Pokemon: RegenVest users such as Garchomp and Silvally-Dragon are able to withstand Volcarona's attacks and threaten a KO back.</p> <p><strong>Primordial Sea Users: Pokemon such as Zapdos and Barraskewda threaten Volcarona with super effective moves and an immunity to Fire. Barraskewda often carries Aqua Jet and is able to revenge kill. Zapdos resists Volcarona's common attacks and can threaten it with Hurricane or Weather Ball.</p> <p><strong>Flash Fire Steel-types: Flash Fire users such as Ferrothorn and Corviknight can give Volcarona serious trouble, not allowing it to make progress.</p> <p><strong>Blissey: Blissey can seriously cripple Volcarona through the use of Toxic or Thunder Wave, either putting it on a timer or making it easier to revenge kill and less reliable. It is also able to tank many of Volcarona's moves even after several uses of Quiver Dance.</p> ",
    "sets": [
      {
        "name": "Desolate Land",
        "description": "<p>Volcarona is a strong setup sweeper with good defensive utility. It utilizes Desolate Land to stop common Flip Turn users such as Barraskewda and Swampert. Roost allows Volcarona to recover HP and set up multiple Quiver Dances, boosting past special walls and revenge killers. Flamethrower is a STAB and weather-boosted option, allowing it to deal good damage even without any boosts. Giga Drain is a useful move for hitting Pokemon such as Swampert and Barraskewda super effectively, as well as being a secondary way to recover HP. The EV spread allows Volcarona to check Sheer Force Tapu Lele while maintaining as much Speed as possible.</p> <p>Volcarona is often found on bulky offense teams with more than one Fire-type, so that they are able to break past each others' checks. Desolate Land blocks Flip Turn users from freely pivoting, which other common Fire-types such as Heatran and Cinderace greatly appreciate. Volcarona can have trouble getting through specially bulky Fire-resistant Pokemon such as RegenVest Silvally-Dragon and Garchomp. Therefore, it likes to have powerful physical teammates such as Terrakion as well as Pokemon that can chip these Pokemon, such as Mold Breaker Heatran through its use of Toxic, Magma Storm, and Protect. Volcarona can struggle to beat Primordial Sea Pokemon like Zapdos and appreciates teammates that can threaten Zapdos or switch into it, such as Blissey or specially defensive Garchomp. Finally, it appreciates having entry hazards to chip RegenVest users like Garchomp.</p> "
      },
      {
        "name": "Magic Guard",
        "description": "<p>Magic Guard Volcarona is a powerful and difficult-to-stop setup sweeper. Magic Guard, besides fixing its Stealth Rock weakness, allows Volcarona to use recoil-free Life Orb and avoid passive damage like Toxic. Quiver Dance, beyond just letting Volcarona sweep, gives it the capacity to beat premier special walls. Giga Drain is chosen to hit targets like Swampert, Barraskewda, and Tapu Fini for super effective damage and as a method of recovering HP. Psychic nails Pokemon like Toxapex, which would otherwise be a roadblock for Volcarona, as well as being its best option to hit Primordial Sea Zapdos. Bug Buzz is another option to beat soft checks such as Latias and to hit RegenVest Garchomp harder.</p> <p>Volcarona fits best on offensive teams with powerful wallbreakers such as Terrakion, Primarina, and Tapu Lele, using the holes they open to sweep. Volcarona can struggle to get past Flash Fire Steel-types such as Corviknight and Ferrothorn, and these wallbreakers can break them down in return. Volcarona is vulnerable to Barraskewda, as it always fears Aqua Jet, but a teammate like Tapu Fini can help this weakness. It also cannot directly switch into battle given its frailty and appreciates pivots such as Blissey to let it come in safely. Volcarona can have trouble KOing specially bulky Pokemon such as Blissey or RegenVest Silvally-Dragon and Garchomp, which often threaten it with paralysis or good damage. Due to this weakness, powerful physical attackers such as Terrakion, Cinderace, and Garchomp make good teammates. It can have difficulties getting past Primordial Sea users such as Zapdos, so it enjoys having Pokemon that can threaten or switch into Zapdos such as specially defensive Garchomp or Blissey. Lastly, Volcarona appreciates having entry hazards to accumulate extra chip damage on RegenVest Pokemon, making them easier to KO.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 524664, "username": "Osake"}, {"user_id": 523866, "username": "UT"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 539897, "username": "iapt"}]}
  },
  "Cobalion": {"sets": [{"name": "Regenerator"}, {"name": "Magic Guard"}]},
  "Terrakion": {
    "comments": "<h1>Other Options</h1> <p>Terrakion can run a Swords Dance set with either Tough Claws—with Megahorn to beat Mew—or Adaptability on more offensive teams to take advantage of the free turns it generates, but the Life Orb chip damage and increased risk of taking stray hits makes it less reliable on longer games against bulkier teams. A Sniper set with Laser Focus allows Terrakion to beat every common defensive switch in, but once the set is revealed the foe can stay in and attack to deny the Laser Focus turn.</p> <h1>Checks and Counters</h1> <p><strong>Dauntless Shield Users: Dauntless Shield Mew and Hippowdon are two of the few reliable switch ins to Adaptability Terrakion, as they are not 2HKOed by any move even with Stealth Rock up and can heal reliably, counter back with strong super effective attacks, or inflict Terrakion with status. However, they both must watch out for Toxic while switching in.</p> <p><strong>Nidoqueen, Palossand, and Doublade: While Terrakion threatens every common wall in the meta, it should be noted that dedicated walls for it do exist. Namely, Nidoqueen, Palossand, and Doublade and can reasonably check Terrakion over the course of a longer game.</p> <p><strong>Physically Defensive Choice Scarf Users</strong>: Choice Scarf Mew, Tapu Fini, and Galarian Zapdos are all able to take one hit from Terrakion and force it out or pivot in on it. With Regenerator, they are often able to do this multiple times per battle but can be overwhelmed if not kept at high HP.</p> <p><strong>Protect Users: Terrakion has a difficult matchup against defensive Pokemon that run Protect like Heatran and Tapu Fini as Protect both reveals which move Terrakion is locked into, enabling the opponent to pick the correct switch-in, and drains precious PP. Both of Terrakion's STAB moves have only 8 PP and are prone to being stalled out over the course of longer games, and Protect accelerates that. However, it can be risky to click Protect without sufficiently scouting if it's being used against setup Terrakion.</p> ",
    "sets": [
      {
        "name": "Choice Band Adaptability",
        "description": "<p>Terrakion is one of the most threatening physical breakers in AAA and is capable of battering through many defensive cores on its own. Rock- and Fighting-type STAB moves have near-perfect coverage by themselves, making Adaptability a fantastic damage amplifying ability for it. With a Choice Band equipped, very few defensive walls can safely switch into Terrakion. Dauntless Shield Mew is one of the most reliable answers as it is never 2HKOed by any of Terrakion's common moves without a critical hit, but even Dauntless Shield Corviknight fails to check Terrakion reliably as Stealth Rock damage is enough to let it get 2HKOed by Close Combat. Terrakion's base 108 Speed is enough to outpace all common defensive Pokemon and a number of common breakers, including Genesect and Tapu Lele, giving it plenty of Pokemon to force out if brought in via a slow pivot or after a KO. While Terrakion will almost always be using its STAB moves, Earthquake is a 100% accurate option to hit Toxapex without getting PP stalled, Megahorn lets Terrakion 2HKO Dauntless Shield Mew after Stealth Rock, and Toxic is a nice option to cripple walls that Terrakion cannot 2HKO like Dauntless Shield Mew and Hippowdon. Stealth Rock is also an option to let Terrakion get entry hazards up on a predicted switch if the opponent has a reliable answer to it. Terrakion runs maximum Speed and Attack investment with a Jolly nature to take advantage of its Speed tier and maximize the number of Pokemon it beats one-on-one.</p> <p>Terrakion fits well on bulky offense teams that can provide it with many opportunities to switch in and fire off strong attacks. While almost nothing can safely switch into Terrakion, it is also true that Terrakion does not want to switch in on many Pokemon either. Therefore, slow pivots like Corviknight, Swampert, and Blissey provide the safe switch in that Terrakion needs and make excellent teammates. Defensive pivots also make good teammates as Terrakion is often forced out after it gets a KO due to its mediocre bulk and only slightly above-average Speed. Good offensive teammates include fast physical attackers that like to take advantage of the weakened or broken defensive cores that Terrakion creates such as Barraskewda, Zarude, and Genesect. Other good offensive teammates include Azelf and Tapu Koko, as they can draw out and pivot on RegenVest Pokemon that Terrakion can beat easily; Azelf can also set up Psychic Terrain to protect Terrakion from Triage. Lastly, Terrakion appreciates entry hazard support, as many of its checks can only check it from high health, and hazards help whittle them down until they can no longer switch in.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 231750, "username": "motherlove"}, {"user_id": 524664, "username": "Osake"}]}, {"name": "Grammar checked by", "members": [{"user_id": 241023, "username": "Kris"}]}], "writtenBy": [{"user_id": 523866, "username": "UT"}]}
  },
  "Thundurus": {"sets": [{"name": "Magic Guard"}]},
  "Landorus": {"sets": [{"name": "Sheer Force"}]},
  "Landorus-Therian": {"sets": [{"name": "Regenerator"}, {"name": "Regenerator"}]},
  "Genesect": {"sets": [{"name": "Choice Scarf"}, {"name": "Sheer Force"}]},
  "Talonflame": {
    "comments": "<h1>Other Options</h1> <p>Talonflame's movepool is shallow, but there are a few other options. U-turn can be run over Swords Dance, or more rarely Flare Blitz, to generate momentum even against teams that have solid answers to it, which is always valuable. Talonflame can also conceivably drop Flare Blitz for Will-O-Wisp to cripple some of its switch-ins like Swampert, but the increased coverage is usually preferred.</p> <h1>Checks and Counters</h1> <p><strong>Primordial Sea Electric-types: Primordial Sea Zapdos and Tapu Koko both have the bulk and typing to switch into Talonflame and force it out with their Electric-type attacks. They also have pivoting and reliable recovery to consistently annoy Talonflame over the course of the match.</p> <p><strong>Flash Fire Corviknight: Talonflame can't hit Corviknight neutrally, and Corviknight can do more than 50% to Talonflame with Brave Bird or use U-turn to bring in a faster threat safely.</p> <p><strong>Unaware</strong>: Unaware Mandibuzz and Mew comfortably avoid being 2HKOed and ignore Swords Dance boosts. However, in a longer game, Talonflame can feasibly stall them out of recovery PP, especially if they lack the ability to punish Talonflame themselves with Foul Play or Thunder Wave.</p> <p><strong>Prankster Toxapex: Similarly to the Unaware checks above, Toxapex can prevent Talonflame from sweeping as long as it has PP for Recover; additionally, it can remove Talonflame’s Life Orb with Knock Off, which reduces its power considerably. It can also be stalled out of recovery in a longer game, however.</p> <p><strong>Tapu Fini</strong>: Tapu Fini is already found on many teams and can help check Talonflame, but it cannot beat Talonflame by itself. It will lose if it switches into a Brave Bird or Swords Dance, as it is 3HKOed by unboosted Brave Bird and cannot OHKO back with Scald.</p> ",
    "sets": [
      {
        "name": "Magic Guard Attacker",
        "description": "<p>Talonflame has found a welcoming home in Generation 8 Almost Any Ability, being an attacker with good power and coverage that is hard to wear down. In a metagame that has few viable Rock-types, Talonflame's STAB moves provide fantastic coverage, with the only common resistant foes being Primordial Sea Zapdos or Tapu Koko and Flash Fire Corviknight. Thanks to its high Base Power moves and Life Orb, which have their recoil negated by Magic Guard, Talonflame hits surprisingly hard despite having a low Attack stat. For reference, fully physically defensive Swampert cannot safely switch into Talonflame if it is below 80% health, as it risks getting 2HKOed by Brave Bird. Talonflame possesses a great Speed tier for AAA, leaving it only outspeed by Barraskewda, Tapu Koko, and the rare Zamazenta-C. Additionally, it resists every common Triage move and Grassy Glide, making it difficult to revenge kill with priority. Swords Dance amplifies Talonflame's offensive presence, and it can often find time to set up safely against either offensive threats it forces out, like Volcarona and Zarude, or defensive stalwarts that are unable to KO it back like Corviknight and most Mew. Its power, access to setup, and longevity make it particularly effective at breaking down bulkier teams. Talonflame does really need to run maximum Attack and Speed with Jolly to maximize its offensive capabilities.</p> <p>Talonflame fits well on bulky offense or balance teams that want offensive pressure without having to provide much support. Since it is immune to all entry hazards, Talonflame doesn't require hazard control, and Magic Guard means it can't be worn down by stray Toxics or Rocky Helmets (although it does fear paralysis). Since its bulk is not fantastic, it does appreciate slow pivots like Swampert and Corviknight to bring it in safely; in exchange, it forces out foes like Cinderace or Volcarona that may have tried to come in on them. There are some common switch-ins that frustrate Talonflame, however; Primordial Sea Zapdos in particular can't be hit neutrally and forces it out, so teammates that can handle Zapdos like RegenVest Swampert, Blissey, and Silvally-Dragon are always appreciated. Additionally, while Talonflame is fast, most Choice Scarf users Choice Scarf users and a few faster threats—Tapu Koko and Barraskewda—can revenge kill it reliably. Good revenge killers or solid switch-ins to those are strongly advised; Choice Scarf Azelf is especially notable as a great revenge killer that lets Talonflame in often with U-turn.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 375662, "username": "Isaiah"}, {"user_id": 450411, "username": "Atha"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 523866, "username": "UT"}]}
  },
  "Volcanion": {"sets": [{"name": "Choice Specs"}]},
  "Incineroar": {"sets": [{"name": "Assault Vest"}]},
  "Toxapex": {"sets": [{"name": "Prankster"}]},
  "Golisopod": {"sets": [{"name": "Triage"}]},
  "Silvally-Dragon": {
    "comments": "<h1>Other Options</h1> <p>Grass Pledge allows for immediate damage on Swampert, always 2HKOing physically defensive sets. However, this means Silvally-Dragon has to forgo coverage for Steel-types or its ability to threaten Volcarona with Rock Slide. Draco Meteor provides Silvally-Dragon with a strong STAB move that deters greedy Dragon-types like Garchomp and Kommo-o from setting up, but this leaves it walled by Steel-types.</p> <h1>Checks and Counters</h1> <p><strong>Fairy-types: Fairy-types like Tapu Koko, Primarina, and Tapu Lele all force out Silvally-Dragon due to their powerful STAB moves. While only a Pixilate Facade from Tapu Koko can OHKO Silvally-Dragon, all of them severely dent it. However, apart from Magic Guard Tapu Koko, all of them cannot switch into Silvally-Dragon for fear of getting crippled by Poison Fang, and even Magic Guard Tapu Koko can be pivoted on.</p> <p><strong>Wandering Spirit: Like many Regenerator users, Silvally-Dragon dislikes having its ability removed. This is especially troublesome considering the move it uses the most, U-turn, makes contact, meaning that Wandering Spirit will invalidate Regenerator.</p> <p><strong>Knock Off</strong>: Assault Vest heavily augments Silvally-Dragon's special bulk. Therefore, Knock Off from Pokemon like Ferrothorn, Azelf, and Toxapex limits Silvally-Dragon's ability to switch into what it wants to.</p> <p><strong>Residual Damage: Silvally-Dragon's only form of recovery is Regenerator, so forms of residual damage such as entry hazards, status, and random chip damage can quickly rack up if Silvally-Dragon is not managed properly.</p> ",
    "sets": [
      {
        "name": "RegenVest",
        "description": "<p>Silvally-Dragon's set of resistances, wide movepool, and great special bulk makes it a solid defensive pivot, most notably switching into Desolate Land and Primordial Sea users such as Heatran, Volcarona, Zapdos, and Volcanion. It is also netural to Psychic, allowing to safely scout Choice-locked Psychic Surge users like Azelf and Alakazam and pivot out. U-turn is the most important move on the set, allowing Silvally-Dragon to switch into an attacker and then pivot to an attacker or favorable matchup. Rock Slide hits Fire-types like Volcarona, which Silvally-Dragon can easily come in on. Poison Fang threatens Pokemon like Tapu Fini, Blissey, Kommo-o, and Swampert with a high chance of Toxic poison if they switch in. Flamethrower threatens Steel-types like non-Flash Fire Ferrothorn and Genesect. Assault Vest and Regenerator keep Silvally-Dragon bulky and healthy in conjunction with U-turn; it does not require a Dragon Memory or RKS System to maintain its Dragon typing. A Sassy nature and 0 Speed IVs ensure that Silvally-Dragon has the slowest U-turn possible to get teammates in safely, underspeeding Pokemon like Jirachi and Mew.</p> <p>Silvally-Dragon generally fits on balance and bulky offense builds, as powerful wallbreakers such as Tapu Lele, Terrakion, and Zarude appreciate coming in freely, while defensive support can take some pressure off. Since Steel covers all of Dragon's weaknesses, Steel-types like Jirachi and Corviknight are solid partners to pivot into threats like Tapu Lele, Garchomp, and Genesect with an Ice-type move. In return, Corviknight can remove entry hazards to support Silvally-Dragon's pivoting. Regenerator Genesect is also a solid partner, capable of checking Pokemon that force out Silvally-Dragon like Tapu Fini. They can form a powerful pivoting core that is highly resistant to chip damage. Offensive partners that can scare out the Fairy- and Dragon-types Sivally-Dragon dislikes, such as Zamazenta-C and Tapu Koko, are also good choices.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 375662, "username": "Isaiah"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 414072, "username": "Heracross2.0"}]}
  },
  "Dhelmise": {"sets": [{"name": "Grassy Surge"}, {"name": "Grassy Surge"}]},
  "Kommo-o": {"sets": [{"name": "Triage"}, {"name": "Galvanize"}, {"name": "Unburden Sweeper"}]},
  "Tapu Koko": {"sets": [{"name": "Magic Guard"}, {"name": "Primordial Sea"}, {"name": "Screen Setter"}]},
  "Tapu Lele": {"sets": [{"name": "Sheer Force"}, {"name": "Triage"}]},
  "Tapu Bulu": {"sets": [{"name": "Triage"}]},
  "Tapu Fini": {
    "comments": "<h1>Other Options</h1> <p>Dauntless Shield is an option instead of Regenerator in order to add to Tapu Fini's bulk, but it comes at the cost of lacking reliable recovery outside of Leftovers. Ice Beam can be slotted in over any of the slashed moves, but outside of dealing high damage to Landorus-T and Garchomp it has limited usefulness.</p> <h1>Checks and Counters</h1> <p><strong>Ability-changing Moves: Carriers of moves like Skill Swap, Gastro Acid, and Worry Seed that change or suppress opposing Pokemon's abilities such as Blissey, Chansey, Mew, Toxapex, and Ferrothron can threaten to remove Tapu Fini's passive recovery from Regenerator entirely. That being said, all of them have to be wary of being crippled by Knock Off.</p> <p><strong>Desolate Land Fire-types: Desolate Land users such as Moltres and Heatran are immune to Scald and can carry Solar Beam to easily 2HKO Tapu Fini. Heatran gets a special mention because it doesn't mind its item being removed by Tapu Fini in exchange for being able to trap and KO with Magma Storm. Volcarona can use Quiver Dance repeatedly in the face of Tapu Fini, and offensive variants can 2HKO even with unboosted Solar Beam or Giga Drain.</p> ",
    "sets": [
      {
        "name": "Regenerator Pivot",
        "description": "<p>Tapu Fini's access to utility moves such as Defog, Haze, and Knock Off allows it to excel as a defensive pivot to a wide array of attackers. The combination of Moonblast and Knock Off in particular enables Tapu Fini to cripple Heavy Duty Boots and Assault Vest users while retaining a strong Fairy-type STAB move. Tapu Fini's typing and bulk allow it to serve as a blanket check to prominent physical attackers like Garchomp, Barraskewda, and Terrakion; the use of Rocky Helmet serves as a means for Tapu Fini to switch in and passively limit the amount of times they can attack successfully. Leftovers allows Tapu Fini to slightly increase its passive recovery so that it doesn't have to switch immediately versus opposing attackers. Tapu Fini also serves as one of the most effective counters to Barraskewda, as it can easily restore chip damage from Flip Turn with Regenerator while punishing Barrskewda with Rocky Helmet. Because common Stealth Rock users such as Swampert and Garchomp don't tend to carry moves that are immediately threatening to Tapu Fini, it's able to Defog Stealth Rock away consistently with the option of also removing potential Swords Dance boosts or threatening to burn with Scald. Tapu Fini also retains the ability to check setup sweepers in general: Quiver Dance Volcarona for example can be dealt with to an extent by resetting its stat changes with Haze, but Tapu Fini is not the most reliable long-term answer to them. Knock Off can also be used to potentially remove useful items like Leftovers and Rocky Helmet from Pokemon that rely on them, making Tapu Fini a very versatile utility user.</p> <p>Tapu Fini fits onto virtually any type of team; it can work on balance, offense, and even stall. Magic Bounce Blissey gets a special mention because it pairs with Tapu Fini notably well by preventing entry hazards and checking special attackers that would otherwise give Tapu Fini trouble like Tapu Koko and Heatran. Ground-types such as Swampert and Garchomp enjoy having Tapu Fini as a teammate because they cover for its weakness to Electric-type attacks and can make progress by going for Stealth Rock. Tapu Fini also largely benefits from teammates like Mandibuzz, Zapdos, and Moltres that can patch up its weakness to Grass-type attacks from common users such Volcarona, Tapu Bulu, and Zarude. It's also worth noting that despite being a Water-type, Tapu Fini struggles versus especially powerful Fire-type attacks from Pokemon like Choice Specs Volcanion and offensive Heatran, so Flash Fire and Primordial Sea users like Corviknight and Zapdos can alleviate the pressure for it.</p> "
      },
      {"name": "Choice Scarf"}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 475804, "username": "The Number Man"}, {"user_id": 523866, "username": "UT"}]}, {"name": "Grammar checked by", "members": [{"user_id": 241023, "username": "Kris"}]}], "writtenBy": [{"user_id": 375662, "username": "Isaiah"}]}
  },
  "Nihilego": {"sets": [{"name": "Regenerator"}, {"name": "Unburden Sweeper"}]},
  "Cinderace": {"sets": [{"name": "Choice Band"}, {"name": "Magic Guard"}]},
  "Corviknight": {"sets": [{"name": "Defensive"}]},
  "Barraskewda": {
    "comments": "<h1>Other Options</h1> <p>Choice Scarf can be used to make Adamant Barraskewda faster than the entire unboosted metagame. However, using Choice Scarf instead of Choice Band severely limits Barraskewda's potential to KO, as it already outspeeds a majority of the format.</p> <p>Psychic Fangs is another coverage option, but its uses are limited to only hitting Toxapex. However, it only has a small chance to 2HKO, and Prankster Recover immediately heals any significant damage.</p> <p>Magic Guard + Life Orb sets, while significantly weaker, help solve Barraskewda's biggest issue of longevity by bypassing hazards and Rocky Helmet. It offers much less breaking power, but better sustainability if that is what your team needs.</p> <h1>Checks and Counters</h1> <p><strong>Toxapex: Toxapex is Barraskewda's worst nightmare, sporting sky-high physical bulk and a resistance to Water moves. Its chance to burn with Scald and access to Prankster healing and status-inducing moves mean it will usually come out on top.</p> <p><strong>Water-immune Pokemon</strong>: Desolate Land and abilities that grant Water immunity are able to completely sap Barraskewda's momentum.</p> <p><strong>Bulky Water-type Checks</strong>: Pokemon that resist Water and aren't weak to Barraskewda's coverage options, such as Tapu Fini, are almost always free to switch in and heal the damage done.</p> <p><strong>Rocky Helmet Users: One of Barraskewda's largest weaknesses is residual damage, and Rocky Helmet users such as Mew, Tapu Fini, Swampert, and Corviknight are able to punish Barraskewda for using Flip Turn. This damage racks up over the course of the game, making Barraskewda less of a threat.</p> ",
    "sets": [
      {
        "name": "Choice Band",
        "description": "<p>Barraskewda is a strong offensive pivot, revenge killer, and late-game cleaner with powerful rain-boosted STAB moves and an incredible Speed tier. Flip Turn is an especially deadly move as Barraskewda can pivot out while massively damaging non-Water-immune checks like Swampert. Barraskewda's other strong STAB moves in Liquidation and Aqua Jet mean that the opponent has to keep their Water-resistant Pokemon healthy so that their team isn't completely overwhelmed. Barraskewda's coverage moves are mostly used as insurance against Water Absorb users like Excadrill and Desolate Land users such as Heatran. Close Combat is the best coverage option due to its high Base Power and ability to hit Heatran and Ferrothorn hard. Drill Run is another option to hit Toxapex and bulky Heatran harder.</p> <p>Barraskewda is often paired with special powerhouses like Sheer Force Tapu Lele, Psychic Surge Azelf, and specially offensive Genesect, which succeed versus Pokemon that check Barraskewda like Tapu Fini and Corviknight. The combination of their special prowess and Barraskewda's pivoting leads to deadly offensive cores. Barraskewda commonly finds itself on VoltTurn cores, synergizing well with Genesect, Landorus-T, and offensive Zapdos. Barraskewda also benefits from teammates that check Fire-types and cover its Desolate Land weakness like Nihilego and Garchomp, which can punish them by setting entry hazards. Since Barraskewda's main job as a pivot and revenge killer involves a lot of switching, it benefits from entry hazard removers and slow pivots. Defensive pivots such as Swampert and Landorus-T are able to preserve momentum and set up entry hazards. softening up foes. Dauntless Shield Mew and Intimidate Corviknight are great partners because of their physical bulk, reliable recovery, and Defog. On Barraskewda's own team, Pokemon like Tapu Fini offer Defog, while Magic Bounce users such as Blissey and Mew act as entry hazard deterrents with the option to run slow pivot moves such as Teleport, U-turn, and Volt Switch.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 375662, "username": "Isaiah"}, {"user_id": 475804, "username": "The Number Man"}]}, {"name": "Grammar checked by", "members": [{"user_id": 331519, "username": "CryoGyro"}, {"user_id": 241023, "username": "Kris"}]}], "writtenBy": [{"user_id": 226455, "username": "berry"}, {"user_id": 523866, "username": "UT"}]}
  },
  "Zarude": {
    "comments": "<h1>Other Options</h1> <p>Adamant Tough Claws is rarely run, as Zarude loses priority on Grassy Glide, leaving it unable to revenge kill any attacker, as well as losing passive recovery and Terrain control. On the other hand, however, it provides a decent power boost on all other moves and makes Darkest Lariat very spammable: it now 2HKOes non-Intimidate Corviknight, Zapdos, and Heatran, easing prediction and pivoting.</p> <h1>Checks and Counters</h1> <p><strong>Steel-types: Corviknight, especially Intimidate variants, takes minimal damage from Zarude; Cobalion outspeeds and forces out Zarude while recovering any chip damage via Regenerator; and other Steel-types like Ferrothorn require noticeable chip damage for non-Close Combat Zarude to break through them.</p> <p><strong>Flying-types: Resisting Grassy Glide, common Flying-types like Zapdos, Togekiss, and Mandibuzz can either outspeed and force out Zarude or completely wall it.</p> <p><strong>Faster Pokemon: Zarude often finds itself unable to threaten common fast pivots with Grassy Glide, such as Choice Scarf Genesect and Talonflame. Both carry super effective moves to hit Zarude in return. Additionally, Zarude is forced out by U-turn users given its glaring 4x Bug weakness, especially Azelf, which replaces its Grassy Terrain with Psychic Terrain: this often gives free momentum to offensive pivots, as they can freely use U-turn without taking Grassy Glide.</p> ",
    "sets": [
      {
        "name": "Offensive Pivot",
        "description": "<p>Zarude is a formidable offensive pivot and doubles as one of the strongest priority users in the metagame. With Choice Band and a Terrain-boosted Grassy Glide, Zarude can force out the majority of relevant wallbreakers, such as Tapu Koko and Azelf, as they risk getting OHKOed. U-turn capitalizes on the switches Zarude forces, bringing in offensive partners like Heatran and Blacephalon. Power Whip is the strongest STAB move available, OHKOing or 2HKOing common defensive pivots like Swampert, Tapu Fini, Zapdos, and Toxapex. Darkest Lariat is a spammable STAB move that also bypasses Dauntless Shield boosts, scoring 2HKOs on Heatran, Mew, and Moltres. However, Close Combat is a strong alternative over either Power Whip or Darkest Lariat, allowing it to break through specific checks like Ferrothorn and Incineroar. A Jolly nature puts it above Zapdos and Garchomp, among others, that it can 2HKO on the switch. However, this is not essential; using an Adamant nature instead boosts Zarude's already strong priority move, notably giving a better chance to OHKO Tapu Koko.</p> <p>Zarude provides valuable utility including priority, Terrain control, and passive recovery, making it a great fit on balance and bulky offense teams. As Zarude cannot switch into most attackers, a strong defensive core often helps bring it in safely. Zarude also handily beats Swampert and Tapu Fini, making it a great partner for a multitude of wallbreakers, such as Heatran, Blacephalon, Zapdos, and Tapu Koko. In return, Zarude gives them good switch-in opportunities by using U-turn on the Steel-types it invites in, mainly Corviknight and Cobalion. Zarude appreciates any teammates that can set entry hazards, chipping down foes like Tapu Koko, Ferrothorn, and Corviknight into OHKO or 2HKO range. Teammates carrying Rocky Helmet such as Corviknight and Swampert also provide chip damage, and they can notably punish offensive pivots freely clicking U-turn on Zarude; Wandering Spirit Corviknight is especially valuable, as it can nullify opposing Regenerator on a U-turn. Lastly, teammates running Knock Off are useful to remove opposing Rocky Helmet and Heavy-Duty Boots, respectively allowing Zarude to attack more freely and better chip walls—especially Flying-types—in combination with hazards.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 375662, "username": "Isaiah"}, {"user_id": 523866, "username": "UT"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 476520, "username": "lph"}]}
  }
}