{
  "Clefable": {"sets": [{"name": "Unaware (HP, Def)"}, {"name": "Magic Guard (HP, Def, SpA)"}]},
  "Persian-Alola": {
    "comments": "<h1>Other Options</h1> <p>Roar is an option for phasing opposing setup sweepers such as Rayquaza; however, it's much more passive than Foul Play and forgoes Alolan Persian's good Speed tier. A more defensive spread can be used on the pivot set, but much of Alolan Persian's value comes from its unique Speed tier. Adamant can be run on the Choice Band set but leaves it outsped but common foes such as Kartana. Aerial Ace can be used over U-Turn as well to OHKO Buzzwole, however it has niche usage and removes Persian's ability to pivot. Fake Out is another option on Beat Up set, allowing it to act as a revenge killer.</p> <h1>Checks and Counters</h1> <p><strong>Fairy-types: Defensive Alolan Persian struggles to get past common Fairy-types in the tier including Clefable, Tapu Fini, and Tapu Koko, and it is instead forced to Parting Shot whenever they switch in. However, these walls do have to watch out for Switcheroo.</p> <p><strong>Special Attackers: Defensive Alolan Persian, while incredibly physically bulky, has little special bulk and is threatened out by most special attackers in the tier.</p> <p><strong>Fighting-types</strong>: Both defensive and offensive Alolan Persian sets are checked by common Fighting-types such as Zamazenta-C and Buzzwole. Both can switch into offensive Alolan Persian's powerful Beat Up, and neither are threatened by Foul Play or Knock Off from defensive sets. However, Buzzwole does have to watch out for the niche Aerial Ace.</p> <p><strong>Ability-Ignoring Moves and Abilities: Common gods such as Necrozma-DM and other niche gods such as Kyurem-B and Zekrom have either moves or abilities that ignore Alolan Persian's Fur Coat and thus can break it much easier.</p> ",
    "sets": [
      {
        "name": "Fur Coat Utility (Defense)",
        "description": "<p>Alolan Persian with Fur Coat and a Defense donation is a bulky pivot, able to take most neutral physical attacks comfortably while also maintaining momentum for its team with its high Speed and support moves in Parting Shot and Knock Off. Knock Off lets Alolan Persian take a more aggressive role, removing Leftovers and Rocky Helmet from common physical walls such as Ferrothorn and Skarmory and Heavy-Duty Boots from offensive Pokemon that might switch in like Tapu Koko. Parting Shot is a valuable pivoting move that makes it easier to bring in its teammates due to the attack drops provided. Toxic or Taunt can be used in the third slot depending on what your team values more. Toxic cripples common checks such as Tapu Koko and Buzzwole, while Taunt is useful in denying recovery from walls like Skarmory. This EV spread maximizes Alolan Persian's utility, with maximum Speed investment outspeeding key threats like Kartana, which it threatens with Foul Play. Heavy-Duty Boots is preferred over other items, as it maximizes Alolan Persian's role as a defensive pivot, letting it switch in as often as it can.</p> <p>Heavy-Duty Boots Alolan Persian fits best on balance and offensive teams that appreciate its role compression as a bulky fast pivot. Alolan Persian can take advantage of donations from various gods, with Fur Coat benefitting from any increase in Defense. One good partner is Groudon, which donates a hefty Defense stat while also checking common Alolan Persian switch-ins like Tapu Koko. Good receivers to pair with it include other Tapu Koko checks such as Gastrodon, as well as defensive Fairy checks including Ferrothorn and Heatran. As Alolan Persian can't properly deal with Fighting-types like Buzzwole, teammates that can deal with them like Landorus-T and Tornadus-T are necessary. Consistent entry hazard removal, such as from the Rotom formes and Landorus-T, is helpful to pair with Alolan Persian, as it wants to check common Knock Off users such as Weavile and Bisharp. Rotom-W, in particular, is a good pairing as it also resists Fire and Steel, checking strong attackers such as Victini and Necrozma-DM. Rillaboom is also a good partner, as it gives passive recovery to Alolan Persian with Grassy Terrain.</p> "
      },
      {
        "name": "Choice Scarf (Defense)",
        "description": "<p>Paired with a Choice Scarf, Alolan Persian becomes a potent revenge killer for balance teams looking to shore up their weakness to threatening setup sweepers and physical attackers such as Rayquaza, Weavile, and Kartana. Foul Play is Alolan Persian's primary attacking move, threatening to OHKO almost every physical sweeper at +1 or +2, while Knock Off gives it a less setup reliant way to make progress while also removing key items off of common switch-ins such as Clefable and Ferrothorn. Switcheroo lets Alolan Persian trade its Choice Scarf to its opponent, crippling an opposing wall or preventing a setup sweeper from ever setting up. Parting Shot rounds out its movepool, giving Alolan Persian a strong pivoting move that outspeed much of the relevant metagame, including Choice Scarf users like Kartana and Blacephalon. The EV spread reflects this, with maximum HP and Speed investment important to maintain Alolan Persian's role as a strong revenge killer while maximizing its bulk.</p> <p>Choice Scarf Alolan Persian fits best on offense and balance teams that appreciate its ability to emergency check the multitude of physical sweepers in the metagame; however, its lack of recovery makes it more suited to offensive teams. Because Alolan Persian is weak outside of Foul Play, it requires a team with strong wallbreakers to be effective. Kyogre and Rayquaza pair well with it due to their monstrous power and appreciation of Alolan Persian's pivoting ability. Alolan Persian cannot threaten many of the tier's special attackers such as Tapu Koko; pairing it with another Choice Scarf user such as Buzzwole can be helpful to maintain offensive pressure. Alolan Persian also cannot check many of the tier's Fighting-types such as Urshifu-R and Buzzwole, so pairing it with a switch-in for these Pokemon such as Clefable is a good idea.</p> "
      },
      {
        "name": "Beat Up (Attack)",
        "description": "<p>Alolan Persian can take the role of a strong Technician Beat Up user when put in the Attack slot. Technician Beat Up, when paired with a high Attack god such as Kyurem-B, becomes a powerful nuke, capable of 2HKOing most of the metagame. Knock Off is a strong secondary STAB option if a few of Alolan Persian's teammates are KOed or statused, while Gunk Shot and Switcheroo compete for the third slot. Gunk Shot is an option to hit Clefable and other Fairy-types, while Switcheroo can be used to cripple potential switch-ins such as Mandibuzz and Clefable. Parting Shot gives Alolan Persian another option to avoid common switch-ins, maintaining momentum and bringing in a teammate to threaten the opponent. Black Glasses can be used if you value being able to change moves, while Choice Band boosts Alolan Persian's damage output even higher, including Gunk Shot.</p> <p>A strong Attack donation is required to break common physical walls, so it should be paired with gods such as Calyrex-I, Zekrom, and Kyurem-B. Due to Beat Up's unique Base Power mechanics, Technican Alolan Persian fits best on dedicated teams that seek to maximize its Base Power. This includes avoiding teammates with low Attack stats like Clefable and Slowking. If Alolan Persian is not using Gunk Shot, it should be paired with a strong Steel- or Poison-type to break common Fairy walls such as Tapu Fini and Clefable; Nihilego and Kartana all work well. To make Beat Up as potent as possible, Alolan Persian should be paired with multiple strong physical attackers, such as Rillaboom, Galarian Zapdos, and Buzzwole. Landorus-T is a very good match thanks to its ability to deal with Zamazenta-C and Zeraora, which outspeed and OHKO Alolan Persian with ease. Choice Scarf Kartana is another common partner, being able to clean up after opposing physical walls have been weakened and also serve as a switch-in to Tapu Koko. Pairing Alolan Persian with special attackers such as Tapu Koko, Blacephalon, and Volcanion is also needed to bypass possible walls such as Zamazenta-C and Iron Defense Skarmory. These special attackers also have a high Attack, boosting the power of Beat Up. Spikes and Stealth Rock are also useful to pair with this set to help it pick up more KOs, so setters such as Cloyster and Landorus-T make good partners.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 525446, "username": "Ducky"}, {"user_id": 500884, "username": "longhiep341"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 484270, "username": "beauts"}]}
  },
  "Slowbro": {
    "comments": "<h1>Other Options</h1> <p>Slowbro can be used as a Trick Room setter on Trick Room teams thanks to its good bulk and pivoting. A offensive set with Nasty Plot, Psyshock, and Flamethrower can be used if Slowbro receives a Speed donation from a fast god such as Mewtwo or Zamazenta.</p> <h1>Checks and Counters</h1> <p><strong>Dark-types: Dark-types such as Weavile and Yveltal can force Slowbro out, and the latter can pivot with U-turn, generating even more momentum. However, these Pokemon fear getting burned by Scald, so they do not have a completely safe switch.</p> <p><strong>Offensive Grass-types: Offensive Grass-types such as Rillaboom, Kartana, and Dhelmise threaten to OHKO Slowbro and can use the free turn to set up with Swords Dance, making them even more threatening. Slowbro is able to threaten these Pokemon with a burn from Scald or hit by Ice Beam, so must be careful of switching in directly.</p> <p><strong>Electric-types: Zeraora, Tapu Koko, and Dracozolt are common Electric-type Pokemon which are able to pressure Slowbro with their STAB moves, with the former two being able to pivot on their own. These Pokemon hate being burned by Scald though, so can not switch in safely.</p> <p><strong>Offensive Pivots: Offensive pivots such as Victini and Tornadus-T are hard for Slowbro to check, as they can pivot out and prevent it from gaining momentum, especially if they can outdamage Slowbro's Regenerator due to its weakness to U-turn.</p> ",
    "sets": [
      {
        "name": "Defensive Pivot (Special Defense)",
        "description": "<p>Slowbro is one of the best defensive pivots thanks to its great mixed defensive stats with a Special Defense donation, Regenerator, and Teleport. Its good defensive typing allows it to switch into predicted STAB moves from Zamazenta-C and Volcanion. It can then use Teleport as the foe switches out, safely bringing a teammate into an advantageous position. Scald allows Slowbro to spread burns across the opposing team, possibly crippling physical attackers such as Rillaboom and Zeraora who could otherwise switch into Slowbro freely. Future Sight, mostly used in combination with Teleport, lets Slowbro support wallbreaking teammates, as it can force their checks to take Future Sight damage while trying to check them. Body Press is another option to deter possible switch-ins like Weavile, while Ice Beam nails Dragon-types like Garchomp. Slack Off keeps Slowbro healthy throughout the game, as Regenerator can often be out damaged due to Slowbro switching in repeatedly. For its item, Slowbro can choose between Leftovers and Heavy-Duty Boots, with Leftovers providing extra recovery while Heavy-Duty Boots allows Slowbro to dodge entry hazards while pivoting.</p> <p>Slowbro finds its home on balance and bulky offense teams where it can soft check a wide range of threats and provide safe entry to wallbreaking teammates. Slowbro pairs well with a wide variety of gods, but gods that can patch up its Special Defense like Zamazenta-C, Ho-Oh, and Necrozma-DM make especially great partners. Most wallbreakers like Zygarde-10% and Blacephalon make great teammates, as they appreciate Slowbro’s ability to help them safely switch into the field. Physical wallbreakers such as Zygarde-10% pair well with Slowbro, which can use Future Sight to threaten common checks to them like Buzzwole. Slowbro pairs well with Steel-types such as Necrozma-DM, as they resist the Grass-type moves that threaten Slowbro and provide the team with a solid physically defensive wall. Fighting-types such as Buzzwole are also good teammates, resisting Dark- and Bug-type attacks from Pokemon such as Weavile and Pheromosa that Slowbro can not switch into. Slowbro is not able to check every special attacker, as common Pokemon such as Tapu Koko commonly have an Electric-type move to hit Slowbro with, making switch-ins to these Pokemon such as Rotom-H necessary; they can also be checked with sufficient offensive pressure from teammates like Rillaboom and Dhelmise. Slowbro also has good physical defense and can be used as a soft check for certain physical attackers such as Urshifu-R and Necrozma-DM, but should not be confused with a physical wall.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 500884, "username": "longhiep341"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 525446, "username": "Ducky"}]}
  },
  "Ditto": {
    "comments": "<h1>Other Options</h1> <p>Since Ditto needs Choice Scarf to ensure its ability to revenge kill, it shouldn't run any other item.</p> <h1>Checks and Counters</h1> <p><strong>Substitute Sweepers</strong>: Ditto can't copy foes behind a Substitute, completely failing to threaten them.</p> <p><strong>Choice Scarf Users</strong>: Pokemon with Choice Scarf force a coinflip against Ditto, making it less reliable.</p> <p><strong>Bulky Setup Pokemon with Recovery</strong>: Ditto struggles to revenge kill bulky foes like Iron Defense Skarmory and Calm Mind Tapu Fini without critical hits.</p> <p><strong>Item Removal: Without Choice Scarf, Ditto risks losing the Speed tie against Pokemon it's supposed to check.</p> ",
    "sets": [
      {
        "name": "Revenge Killer (Any)",
        "description": "<p>Ditto is an effective revenge killer in the Godly Gift metagame thanks to its unique ability in Imposter, which, when combined with a Choice Scarf, allows it to outspeed any Pokemon without Choice Scarf or Unburden. Transformation copies donated stats, allowing Ditto to still outspeed Speed receivers and hit as hard as Attack receivers. Imposter's also useful against stall teams by effectively giving infinite PP and copying recovery moves. Ditto prefers having its Choice Scarf removed against stall teams to switch moves and maximize its PP stall capabilities. 252 HP EVs boost the only stat Ditto retains after Imposter activates, while 252 Special Attack EVs and a Quiet nature boost its Future Sight after transforming into a Pokemon like Slowking.</p> <p>Ditto almost exclusively finds its place on stall teams to handle offensive setup threats that its teammates struggle to handle. It struggles to switch in directly against most foes, so slow pivot moves make for great support. Examples include Teleport from Slowbro or Slowking and U-turn from Corviknight. Entry hazards prevent Ditto from switching in repeatedly, so teammates that can reliably remove them such as Mandibuzz and Ho-Oh are appreciated. Unaware users like Pyukumuku, Quagsire, and Clefable or Clear Smog users like Gastrodon and Amoonguss can handle bulky setup Pokemon with recovery, such as Calm Mind Galarian Slowking and Bulk Up Buzzwole, which outlast Ditto one-on-one. An ally with Regenerator, such as the aforementioned Slowbro or Ho-Oh, in tandem with Ditto can outstall defensive Regenerator Pokemon, effectively forcing them out. A defensive god with a high HP stat like Giratina theoretically complements Ditto well, but Ditto is able to go in any teamslot, especially the Attack and Special Attack slots, which stall teams don't benefit from much anyway. While the HP increase is beneficial, another bulky Pokemon can often take better advantage of it, usually Skarmory.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 484270, "username": "beauts"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}], "writtenBy": [{"user_id": 500884, "username": "longhiep341"}]}
  },
  "Moltres-Galar": {
    "comments": "<h1>Other Options</h1> <p>On teams with reliable entry hazard control, Galarian Moltres can use a Sitrus Berry to survive an otherwise 2HKO and activate Berserk twice. ChestoRest allows it to set up on status users reliably, but at the cost of a setup or STAB move, usually Hurricane or Agility.</p> <h1>Checks and Counters</h1> <p><strong>Tapu Koko</strong>: Tapu Koko resists both of Galarian Moltres's STAB moves and can retaliate, but it cannot always OHKO and must be wary of being worn down.</p> <p><strong>Tyranitar</strong>: Tyranitar also resists both of Galarian Moltres's STAB moves, can OHKO back with Stone Edge, and has the bulk to switch in multiple times.</p> <p><strong>Specially Defensive Unaware Walls</strong>: Specially defensive Clefable and Quagsire can ignore Nasty Plot boosts and threaten Galarian Moltres back with status. However, they need pretty substantial Special Defense donations to avoid the 2HKO from Hurricane, and both risk losing to confusion or a Fiery Wrath flinch.</p> ",
    "sets": [
      {
        "name": "Double Dance (Special Attack)",
        "description": "<p>Galarian Moltres is one of the most threatening sweepers on offensive teams thanks to its excellent STAB coverage, solid bulk, and ability to run Nasty Plot and Agility on the same set. Hurricane is its most powerful attack and has excellent coverage, blasting common specially defensive walls like Tangrowth and Ferrothorn. Fiery Wrath is a more consistent attack that lacks Hurricane's raw power, but provides crucial coverage against Necrozma-DM, Rotom-W, and Skarmory. Nasty Plot overwhelms bulkier teams and reduces the number of times Galarian Moltres needs to successfully hit Hurricane, and Agility lets Galarian Moltres outspeed revenge killers and all relevant Choice Scarf users, including Kartana. Thanks to its impressive bulk for a sweeper, Galarian Moltres can usually set up the boosting move of its choice, and with dual screens support or proper prediction, it can often get both. Heavy-Duty Boots helps preserve its HP to allow for easier setup. On teams with dual screens support, Galarian Moltres can use Weakness Policy instead of Heavy-Duty Boots. This, alongside its good bulk, lets it set up on a super effective attack and potentially boost its Special Attack and Speed in the same turn.</p> <p>Galarian Moltres fits best on hyper offense teams looking for a special attacking sweeper, although it fits on some balance teams as well. It has excellent synergy with many of the better offensive gods, including Mewtwo, Rayquaza, and Pheromosa, and can also pair up with slower ones like Kyogre. It appreciates dual screens from Tapu Koko on hyper offense teams to reliably set up both Nasty Plot and Agility, letting it blow through any potential switch-in. Since Galarian Moltres usually functions as a wincon, it appreciates wallbreaking teammates like Victini, Urshifu-R, and Kartana to help open up holes in the opposing defensive core. Additionally, entry hazard support from teammates like Cloyster, Ferrothorn, and Landorus-T helps wear down opposing Tapu Koko and Gastrodon. Since Galarian Moltres lacks any form of recovery, it appreciates pivots like Tapu Koko to get it in safely. While its coverage is amazing, it does miss a few key threats, namely Tapu Koko and Tyranitar, so reliable answers to wear them down like Landorus-T and Kartana are appreciated.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 500884, "username": "longhiep341"}, {"user_id": 484270, "username": "beauts"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}], "writtenBy": [{"user_id": 523866, "username": "UT"}]}
  },
  "Mewtwo": {
    "comments": "<h1>Other Options</h1> <p>Mewtwo can also use Choice Specs, but this set is easier to play around once it is revealed. Replacing Recover with another coverage move is another option. Mewtwo can also use a Weakness Policy and Calm Mind set, often on dual screens hyper offense, that serves as a powerful setup sweeper.</p> <h1>Checks and Counters</h1> <p><strong>Heatran</strong>: Mewtwo, even with Aura Sphere, can have difficulties dealing with Heatran, which can often trap and eliminate it easily using Magma Storm, Taunt, and Toxic.</p> <p><strong>Faster Revenge Killers</strong>: Pokemon like Pheromosa, Zamazenta, and their common Speed receivers such as Pangoro will be faster than Mewtwo and can often force it out.</p> <p><strong>Priority Users: Pokemon that can use priority moves, like Rillaboom and Yveltal, can force Mewtwo out after a little chip damage.</p> <p><strong>Neutral HP Receivers: Pokemon like Rotom-W, Tapu Fini, and Clefable aren't weak to most or any of Mewtwo's attacks, often letting them handle Mewtwo after a high HP donation.</p> ",
    "sets": [
      {
        "name": "Three Attacks",
        "description": "<p>Mewtwo is a threatening special attacker that takes advantage of its wide coverage and impressive Special Attack to dish out heavy damage to opposing teams. Mewtwo also has excellent stats to donate to its team, including base 154 Special Attack and 130 Speed, making it one of the best Speed donors to offensive teams. Especially since this set forgoes any boosting moves, Life Orb is recommended to still do respectable damage; Recover also helps offset its recoil, besides generally keeping Mewtwo healthy. Psystrike has solid neutral coverage and can bypass specially bulky walls like Ho-Oh and Assault Vest Tangrowth. Fire Blast hits common switch-ins to Psystrike like Necrozma-DM, Skarmory, and Kartana. Thunderbolt is Mewtwo's best way to handle bulky Water- and Flying-types like Slowbro, Tornadus-T, and Corviknight. Ice Beam hits Dragon- and Ground-types like Rayquaza and Groudon. Taunt gives Mewtwo a way to break through common switch-ins such as Clefable by preventing it from healing. Aura Sphere is an option here for super effective coverage on Heatran while still hitting Ferrothorn super effectively.</p> <p>Mewtwo's amazing Special Attack and Speed, as well as its solid HP and Attack, make it an excellent god for offensive teams. Pokemon like Galarian Moltres and Tapu Koko love to receive Mewtwo's high Special Attack stat, while numerous Pokemon, including Dhelmise and Volcanion, can become fast wallbreakers after receiving its Speed stat. Mewtwo should always be paired with such Special Attack and Speed receivers that complement its aggressive nature, as the three Pokemon form the backbone of the team. Mewtwo excels at wearing down teams, so cleaners like Kartana and Tapu Koko that can take advantage of this make good teammates. Mewtwo's frailty makes it easily forced out by priority users like Weavile, Rillaboom, and Yveltal, especially after it has taken a few rounds of Life Orb recoil. Teammates like Rotom-W, Landorus-T, and Corviknight can alleviate this weakness with both pivot support and entry hazard control, giving Mewtwo safe entry and stopping hazards from chipping it down even further.</p> "
      },
      {
        "name": "Nasty Plot",
        "description": "<p>Mewtwo is a fearsome setup sweeper with Nasty Plot and its array of coverage moves. Its high Special Attack and Speed stats make it a difficult Pokemon to check on its own, and these stats power up its teammates as well, making it a very threatening god. Nasty Plot transforms this baseline threat into an immediate threat to sweep, especially coupled with its great Speed tier. Psystrike is the STAB attack of choice, threatening common special switch-ins like Gastrodon and Ho-Oh. Fire Blast hits Steel-types that are unfazed by Psystrike like Necrozma-DM and Ferrothorn. Thunderbolt gives Mewtwo an option to hit bulky Water-types like Tapu Fini and Slowking, while Ice Beam hits Ground- and Dragon-types like Landorus-T, Giratina, and Rayquaza for heavy damage. Recover lets Mewtwo stay healthy throughout a game, healing off Life Orb recoil and any other chip damage sustained.</p> <p>Mewtwo is an excellent choice for offensive teams, helping Pokemon that appreciate its strong Special Attack and Speed, like Tapu Koko and Volcanion, as well as its respectable Attack and HP stats. Mewtwo likes to be pivoted into foes it can force out to safely set up Nasty Plot, so physical pivots like Zeraora, Victini, and Rillaboom—which also threaten Mewtwo's specially bulky checks—make great teammates. Despite Mewtwo's offensive prowess, it has middling bulk and can be revenge killed by priority or Choice Scarf users; bulky pivots like Rotom-W and Tornadus-T can switch into potential revenge killers and regain momentum. Mewtwo rarely has trouble beating foes offensively, but certain Pokemon like Heatran, Reuniclus, and Lunala can give it trouble. Partners like Galarian Moltres can help deal with these threats easily. Mewtwo appreciates entry hazard removal to help avoid chip damage, since it will often be switching in several times over the course of a game.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 484270, "username": "beauts"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}], "writtenBy": [{"user_id": 539897, "username": "iapt"}]}
  },
  "Slowking": {
    "comments": "<h1>Other Options</h1> <p>Trick Room can be ran over Future Sight, as Slowking is able to reliably set it and pivot to a wallbreaker. Ice Beam is also an option to pressure Zygarde-10% and Garchomp, but they are already pressured well by Scald. Dragon Tail can deter setup sweepers, but a slow pivot to a revenge killer is often just as good.</p> <h1>Checks and Counters</h1> <p><strong>Electric-types: Electric-types like Zeraora and Tapu Koko threaten Slowking with powerful, super effective STAB moves. However, Zeraora is crippled by burns from Scald.</p> <p><strong>Dark-types: Dark-types like Weavile and Galarian Moltres are immune to Future Sight and are capable of OHKOing Slowking.</p> <p><strong>Offensive Grass-types: Many Grass-types like Dhelmise, Kartana, and Rillaboom threaten Slowking with strong super effective STAB moves. The latter two also have access to Knock Off.</p> <p><strong>Strong Special Attackers: Slowking may have good mixed bulk, but it can still be overwhelmed by exceptionally strong special attackers like Tornadus-T.</p> ",
    "sets": [
      {
        "name": "Defensive Pivot (Defense)",
        "description": "<p>With a Defense donation to its name, Slowking possesses great mixed bulk. With superb durability, reliable recovery, and access to Teleport, Slowking cements itself as one of the best defensive pivots in the tier. Scald is the preferred STAB move, as its burn chance can chip down defensive Pokemon like Tangrowth and Ferrothorn and cripple physical attackers like Zeraora, Rillaboom, and Weavile that may try to switch in. Future Sight can force many Pokemon out to disrupt an opponent's momentum and also deals significant chunks of damage to neutral targets if it lands. It also allows Slowking to aid physical wallbreaking teammates by setting up Future Sight, slow pivoting them onto the field safely, and forcing the opposing physical wall to take Future Sight damage the same turn it switches in. Slack Off is necessary to keep Slowking healthy, as Regenerator is often not enough to keep it fully healthy. Teleport is an excellent way to bring in frail teammates safely, as Slowking has good matchups versus common Pokemon like Necrozma-DM, Heatran, Ho-Oh, and Calyrex-I and can switch into them and stomach a hit before pivoting out. Heavy-Duty Boots lets Slowking pivot around more freely, but Leftovers can be run if reliable entry hazard removal is present. Regenerator allows Slowking to still recover HP while pivoting out. A Relaxed nature alongside minimum Speed IVs ensure that Slowking will move last as often as possible and speed tie with Slowbro and opposing Slowking when pivoting.</p> <p>Slowking should receive its Defense stat from bulky gods like Necrozma-DM, Zamazenta-C, and Calyrex-I. Frail Pokemon like Zeraora and Weavile, as well as setup sweepers like Necrozma-DM, Kartana, and Mimikyu, love to be brought in by Teleport. Those same Pokemon also love Slowking's ability to spread burns, chipping walls and crippling physical attackers. Slowking pairs especially well with physical wallbreakers, as their checks are more significantly pressured by Future Sight. Slowking can force out Fire-types like Heatran and Victini locked into V-create, which is appreciated by Steel-type teammates like Ferrothorn and Skarmory. Slowking is vulnerable to Electric-types like Zeraora and Tapu Koko, so Ground-types like Landorus-T and Garchomp are good teammates. Slowking's Psychic typing makes it weak to Knock Off, teammates that resist Dark like Buzzwole, Clefable, and Tapu Fini are useful to have around. Slowking pairs well with other Regenerator users like Tornadus-T, Ho-Oh, and Tangrowth, as they can form infamous Regenerator cores and soft check a wide range of threats.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 525446, "username": "Ducky"}, {"user_id": 523866, "username": "UT"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 584907, "username": "Wes8888"}]}
  },
  "Skarmory": {
    "comments": "<h1>Other Options</h1> <p>Skarmory has a wide range of other status options available. Toxic allows it to punish switch-ins directly and rack up even more residual damage. Skarmory can also set Stealth Rock, but the limited distribution of Spikes makes Skarmory's access to that move more valuable. Taunt is an option to prevent setup and Defog, but Skarmory's low Speed makes it an unreliable option. Skarmory can also forgo Body Press or Brave Bird to run four utility moves, but this makes it exceedingly passive, except as a dedicated lead with Custap Berry where Roost is not needed. Skarmory can also run a specially defensive set, but this set is generally outclassed by Corviknight.</p> <h1>Checks and Counters</h1> <p><strong>Fire- and Electric-types: Even physical Fire- and Electric-types like Victini, Zeraora, and Dracozolt can reliably 2HKO Skarmory with their super effective STAB moves.</p> <p><strong>Taunt: Skarmory is vulnerable to Taunt, as it cannot recover, phaze, or set Spikes in front of Taunt users like Yveltal and Alolan Persian.</p> <p><strong>Pivots: Physical pivots like Landorus-T can draw Skarmory in and pivot to a special attacker that forces it out. Especially with Stealth Rock up, this can wear down Skarmory by denying it a chance to recover. Pivots are especially dangerous when paired with Magnezone.</p> <p><strong>Zygarde-10%: Thanks to Thousand Arrows, Zygarde is one of the few physical Ground-types that Skarmory cannot reliably check.</p> <p><strong>Strong Special Attackers: Even with augmented HP, Skarmory has poor special bulk and it can be 2HKOed by most special attackers such as Mewtwo and Galarian Molres.</p> ",
    "sets": [
      {
        "name": "Physical Wall (HP)",
        "description": "<p>Skarmory is the most reliable Spiker in the metagame and one of the sturdiest physical walls. With its amazing defensive typing, access to reliable recovery, and sky-high Defense, it is the perfect candidate for the HP teamslot. Skarmory is able to comfortably wall most physical threats, including Dhelmise, Bisharp, Excadrill, and Weavile. Body Press works off of its high Defense stat and threatens many of the Pokemon it walls, like Excadrill, but Brave Bird is an option for better neutral coverage and the ability to hit Ghost-types, especially Dhelmise, at the cost of taking recoil. Spikes punishes switch-ins and takes advantage of the free turns Skarmory generates. Iron Defense allows Skarmory to check setup sweepers as well, boosting alongside them while also powering up Body Press; Whirlwind is another option in the last moveslot to phaze set-up foes that Skarmory cannot KO. Rocky Helmet lets Skarmory punish physical attackers even more heavily, especially pivots that can otherwise wear down Skarmory, while Leftovers provides extra recovery. Maximum Defense investment is required to check the high-powered attackers common in Godly Gift and has the nice side effect of also powering up Body Press.</p> <p>Skarmory is a good option for stall and balance teams looking for a catch-all physical wall. Since most Uber Pokemon have a high base HP, Skarmory can work with a wide range of Gods, but some of the best fits are Giratina, Yveltal, and Kyurem-W. Wallbreakers like Victini and Zeraora appreciate Skarmory's Spikes, which help wear down their checks, and its ability to switch into would-be revenge killers that force them out, such as Landorus-T. Since Skarmory's Special Defense is poor, it appreciates bulky teammates like RegenVest Tangrowth and Gastrodon to sponge special hits aimed at it. Due to its Electric and Fire weaknesses, Skarmory is unable to wall Victini, Zeraora, and Dracozolt; reliable switch-ins to these foes like Hippowdown and Quagsire make good partners, especially since Skarmory covers their Grass weaknesses.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 517892, "username": "pannuracotta"}, {"user_id": 484270, "username": "beauts"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}], "writtenBy": [{"user_id": 523866, "username": "UT"}]}
  },
  "Tyranitar": {"sets": [{"name": "Specially Defensive (SpD)"}, {"name": "Dragon Dance (Spe)"}]},
  "Ho-Oh": {
    "comments": "<h1>Other Options</h1> <p>A specially defensive set can allow Ho-Oh to wall very powerful special attackers such as Kyurem-W or foes inheriting a high Special Attack stat such as offensive Tornadus-T but makes it unable to handle physical attackers, meaning it deals with a smaller pool of Pokemon than the physically defensive set. Choice Band Ho-Oh can run an alternative spread of 104 HP / 252 Atk / 152 Spe with an Adamant nature to outspeed neutral nature Heatran and Necrozma-DM at the cost of fairly significant HP investment. Ho-Oh can also run an offensive setup set with Curse, Recover, Sacred Fire, and Brave Bird to take advantage of its excellent bulk, power, and STAB coverage, but this forgoes much of its defensive utility.</p> <h1>Checks and Counters</h1> <p><strong>Knock Off: Knock Off users like Landorus-T, Kartana, and Tornadus-T can severely cripple Ho-Oh by removing its Heavy-Duty Boots, dramatically reducing its longevity if Stealth Rock is up. This weakness can be mitigated with other forms of hazard control such as Defog Rotom-Wash, which allows Ho-Oh to then reliably switch into these threats.</p> <p><strong>Electric- and Water-types: Ho-Oh is unable to reliably deal with common attackers like Zeraora and Volcanion due to their ability to hit it super effectively.</p> <p><strong>Rotom-W and Rotom-H: Rotom-W and -H resist both of Ho-Oh's STAB moves and are immune to Earthquake, making them reliable switch-ins. However, they do fear Toxic and are prone to being worn down in longer games.</p> <p><strong>Strong Wallbreakers</strong>: Zygarde-10%, Rayquaza, and Technician Alolan Persian can outspeed and 2HKO defensive Ho-Oh sets.</p> <p><strong>Rock-type Coverage: Ho-Oh needs to scout for Rock-type coverage from threats like Excadrill and Necrozma-DM; it is able to comfortably wall them if they lack it, but risks being KOed otherwise.</p> ",
    "sets": [
      {
        "name": "Defensive",
        "description": "<p>Ho-Oh is a great defensive pivot due to Regenerator, its good defensive stats, especially its Special Defense, and its many useful resistances to types such as Steel and Fire, letting it counter foes such as Buzzwole and Volcarona. Thanks to Sacred Fire and its choice of Toxic or Thunder Wave, it's very good at crippling switch-ins such as Landorus-T and Rotom-W with status, making it quite difficult to switch into. Flare Blitz can be used over Sacred Fire if more PP is valued. Ho-Oh can remove entry hazards from the field thanks to Defog and can do so while threatening the most popular Spikers, Skarmory and Ferrothorn, making it especially good at denying Spikes stacking. Recover is an option if alternate entry hazard control is available, giving it even more sustainability on top of Regenerator; Recover is preferred over Roost to maintain its immunity to Ground moves against foes like Gastrodon. Earthquake gives Ho-Oh the ability to counter Heatran, hitting it 4x super effectively while also doing more damage to Victini and Zekrom. Whirlwind allows Ho-Oh to phaze setup sweepers such as Calm Mind Clefable, Nasty Plot Tornadus-T, and Quiver Dance Volcarona before they get too dangerous, though Brave Bird can be used over Whirlwind, as it can take Volcarona out of the game completely and can hit Pokemon that switch into Sacred Fire such as Kyogre much harder. Defense investment allows Ho-Oh to become a mixed wall, allowing it to reliably deal with foes such as Buzzwole and even pivot around Choice Scarf Victini's Bolt Strike while still being able to cover special attackers such as Volcarona.</p> <p>As a god, Ho-Oh can donate its good defensive stats to its teammates and form cores by covering their weaknesses and providing entry hazard removal. As the only Uber with Regenerator, it has fantastic longevity and lends itself to balance and bulky offense teams. Bulky physical walls like Slowbro, Tangrowth, Hippowdon, and Buzzwole can use a Special Defense donation to become bulky mixed walls. Steel-types such as Ferrothorn and Excadrill appreciate Ho-Oh's ability to answer foes that threaten them like Buzzwole, Pheromosa, and Volcarona, while giving them improved defensive stats. Ferrothorn especially goes great with Ho-Oh as it can pair Leech Seed and Spikes with Ho-Oh's status spreading to force heavy chip damage onto the opposing team. On the other hand, Ho-Oh enjoys being paired with Grass-types such as Tangrowth that can deal with the Electric- and Water-types that threaten it; Tangrowth is also able to help check Zygarde-10%. It also pairs well with Ground-types such as Hippowdon, Landorus-T, and Gastrodon, as they can cover Ho-Oh's Electric weakness and like being donated a high Special Defense stat. Due to Ho-Oh's reliance on Heavy-Duty Boots, it needs teammates such as Buzzwole and Clefable that can absorb Knock Off for it.</p> "
      },
      {
        "name": "Choice Band",
        "description": "<p>Choice Band Ho-Oh utilizes its high-powered STAB moves, which have near-perfect coverage, and Regenerator to function as a durable wallbreaker. Even with minimal defensive investment, its excellent natural bulk, fantastic set of resistances, and Regenerator provide it with numerous opportunities to switch in against metagame staples like Buzzwole, Volcarona, and Galarian Moltres. Sacred Fire is the preferred Fire-type move thanks to its excellent burn chance threatening common switch-ins like Rotom-W. Brave Bird provides excellent coverage against the rest of the tier, notably hitting Dragon-types like Giratina that can comfortably tank Sacred Fire; Regenerator also helps offset Brave Bird's recoil. Earthquake rounds out Ho-Oh's coverage, hitting foes like Zekrom, Flash Fire Heatran, and Tyranitar that can stomach Ho-Oh's other attacks. Whirlwind is the primary option in the last slot, allowing Ho-Oh to serve as an emergency check to setup sweepers like Calm Mind Clefable that it cannot reliably KO; Flare Blitz is another option to provide a secondary, slightly stronger Fire-type move, as Sacred Fire's meager 8 PP can be stalled out. Maximizing Ho-Oh's HP and Attack allows it to use its good bulk and power to trade hits with the opposing team.</p> <p>Choice Band Ho-Oh is best suited to balance teams where its receivers can form a robust defensive core. Since Ho-Oh forgoes Heavy-Duty Boots for Choice Band, consistent entry hazard removal is mandatory. Defoggers such as Corviknight and Rotom-W and spinners such as Excadrill can reliably clear Stealth Rock and enjoy the increased HP and Special Defense Ho-Oh offers them. Ho-Oh is a reliable wallbreaker, especially given its favorable matchup with physically defensive stalwarts like Ferrothorn, Corviknight, and even Landorus-T, so fast cleaners like Zeraora and Kartana make fantastic partners. Ho-Oh cannot do meaningful damage to HP Rotom-W and Rotom-H, so teammates that can reliably threaten them like Zygarde-10% also make good partners. While Ho-Oh retains excellent bulk, it still prefers teammates like Slowbro, Rotom-W, and Landorus-T taking hits for it and pivoting it in safely. Ho-Oh is also slow, so teammates that can spread paralysis like Ferrothorn or reliably revenge kill faster threats like Zeraora make great partners.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 500884, "username": "longhiep341"}, {"user_id": 484270, "username": "beauts"}]}, {"name": "Grammar checked by", "members": [{"user_id": 277988, "username": "dex"}]}], "writtenBy": [{"user_id": 519233, "username": "Mossy Sandwich"}, {"user_id": 523866, "username": "UT"}]}
  },
  "Kyogre": {
    "comments": "<h1>Other Options</h1> <p>Calm Mind Kyogre has a myriad of other options it can run over Ice Beam. Toxic puts opposing walls, especially Gastrodon, on a timer and allows Kyogre to more easily stall them out. Thunder Wave cripples common offensive switch-ins like Rillaboom more consistently than Scald, and it can let Kyogre beat walls with recovery by fishing for a full paralysis. Protect is an option to maximize Leftovers recovery, force Choice-locked pivots to reveal what move they are locked into, and rack up Toxic damage against Gastrodon. Roar is an option to prevent slower phazers from forcing it out, and Sleep Talk allows Kyogre to be less passive while asleep. Kyogre can also run an offensive Calm Mind set with Scald, Ice Beam, and Thunder, but it is often an awkward mid-ground option between Choice Specs and defensive Calm Mind.</p> <h1>Checks and Counters</h1> <p><strong>Gastrodon: Gastrodon is able to reliably switch into all of Kyogre's attacks and has reliable recovery to outlast Choice item variants, but it can struggle to beat Calm Mind sets on its own. It also fears Toxic from Choice Specs Kyogre.</p> <p><strong>Assault Vest Grass-types</strong>: Assault Vest Tangrowth and Rillaboom are able to switch into Kyogre's Water Spout and force it out with their own STAB moves. However, they still have to watch out for Choice Specs-boosted Ice Beam.</p> <p><strong>Revenge Killers: Kyogre is very slow and can be forced out by powerful attacks from foes like Zeraora and Rillaboom. Even attacks that cannot OHKO it, like Zygarde-10%'s Thousand Arrows, are dangerous, as they severely cut into Water Spout's power.</p> <p><strong>Entry Hazards: Since Kyogre is heavily dependent on Water Spout for damage, any chip damage, especially from Stealth Rock and Spikes, reduces its power and makes it easier to wall.</p> ",
    "sets": [
      {
        "name": "Choice Specs",
        "description": "<p>Choice Specs Kyogre may have fairly mediocre stats as a donor, but it is a fierce wallbreaker that utilizes rain-boosted Water Spout to break opposing teams in two. Full power Water Spout OHKOes or, more rarely, 2HKOes the vast majority of the metagame; its semi-reliable switch-ins are limited to Water Absorb or Storm Drain users and exceptionally bulky Pokemon that resist Water, like Slowbro and Assault Vest Tangrowth. Even gods that resist Water like Kyurem-W are at risk of getting OHKOed. Origin Pulse is a still-powerful backup option if Kyogre is low on health, but the drop in power and accuracy is noticeable. Thunder is useful for hitting Water-types, especially Volcanion and opposing Kyogre, and Ice Beam is its best option to hit the aforementioned bulky Grass-types, as well as Dragon-types like Giratina and Kommo-o. Toxic is another option to cripple Gastrodon on the switch. Since Kyogre is able to overwhelm most foes without resorting to coverage moves, Choice Specs is its best option to maximize damage. A Modest nature is preferred to improve damage rolls against targets like Kyurem-W, especially since Kyogre has a fairly poor Speed tier even with Timid, but Timid is an option to at worst Speed tie other base 90 Speed gods like Groudon and opposing Kyogre, as well as reliably outspeeding Excadrill.</p> <p>Choice Specs Kyogre is a pure wallbreaker and requires dedicated team support to make the most of its abilities. Especially since Water Spout decreases in power with every bit of chip damage, Kyogre strongly appreciates pivots like Tapu Koko and Landorus-T bringing it onto the field safely. Entry hazards also severely cut into its longevity and power, so reliable Defoggers like Tornadus-T and Corviknight make excellent teammates; they can pivot it in safely as well. Conversely, entry hazard support from teammates like Clefable and Ferrothorn helps put bulkier foes like Kyurem-W into KO range of Kyogre. While Kyogre's Water Spout can overwhelm even bulky threats that resist Water, it cannot touch Water Absorb and Storm Drain users; Gastrodon, in particular, is the bane of Kyogre's existence. Teammates that can overwhelm Gastrodon like Grass Knot Tapu Koko make excellent partners. Tapu Koko also helps overwhelm or wear down Tangrowth, another common Kyogre check. Tapu Koko and other fast cleaners can also finish up the opposing team once Kyogre has broken the defensive core.</p> "
      },
      {
        "name": "Choice Scarf",
        "description": "<p>Choice Scarf Kyogre still possesses tremendous power with rain-boosted Water Spout and can use its newfound Speed tier to force out or revenge kill most unboosted foes. Water Spout is far and away Kyogre's most powerful attack and can OHKO most offensive Pokemon like Tapu Koko and Zeraora, and it still threatens to 2HKO a wide range of defensive stalwarts like Clefable without a boosting item. Origin Pulse provides Kyogre with a still-powerful STAB move after it has taken chip damage, but the drop in power and accuracy is very noticeable. It is often Kyogre's best option for cleaning late-game after it has taken chip damage. Thunder hits Water-types such as Volcanion, Tapu Fini, and opposing Kyogre for super effective damage, while Ice Beam allows it to revenge kill Rayquaza and Kommo-o, as well as fast Grass-types like Speed receiver Dhelmise and weakened Kartana. Without a damage-boosting item, however, Kyogre's coverage options lack power by Godly Gift standards and can still fail to 2HKO bulkier targets like Assault Vest Tangrowth.</p> <p>Choice Scarf Kyogre is a good revenge killer and secondary wallbreaker for balance and bulky offense teams, as it outspeeds all common unboosted Pokemon bar Regieleki and still possesses tremendous STAB power. Since Kyogre donates a powerful base 150 Special Attack but a measly base 90 Speed, it is easy to pair with a powerful special wallbreaker like Galarian Moltres to overwhelm the opposing defensive core, with Kyogre serving as the revenge killer and cleaner. Since Kyogre abhors chip damage, it loves to be brought in via pivoting from teammates like Rotom-W and Landorus-T. Both of them are also able to provide crucial Defog support, preventing entry hazards from cutting into Water Spout's power. Foes with Water Absorb and Storm Drain prevent Kyogre from freely using Water Spout, so teammates like Grass Knot Tapu Koko and Nidoqueen make great choices to overwhelm these threats. Bulky Grass-types like Assault Vest Tangrowth and Rillaboom stomach Water Spout, so teammates like Corviknight that can easily switch into both are recommended.</p> "
      },
      {
        "name": "Defensive Calm Mind",
        "description": "<p>Calm Mind Kyogre forgoes the immediate power of Water Spout and uses its titanic bulk to set up and overwhelm teams that cannot reliably threaten it, which includes many balance and stall teams. Scald is the STAB move of choice, as its excellent 30% burn chance deters would-be checks like Zeraora and Rillaboom from switching in. Several notable physical attackers are unable to break Kyogre's Substitute after a burn, like Garchomp and Weavile. Kyogre can also attempt to spread burns early in the game, as many teams won't be able to reliably 3HKO it if their primary physical attackers get burned. Calm Mind allows Kyogre to set up and overwhelm even the bulkiest of defensive cores, and after two boosts it is virtually impossible to 3HKO with special attacks. Rest is the primary option in the third moveslot to recover health and cure status, and it pairs excellently with Calm Mind's Special Defense boosts. Substitute is another option that blocks status in addition to Clear Smog, prevents phazing with Dragon Tail, and provides protection against critical hits, but it requires Kyogre to rely entirely on Leftovers for recovery. Ice Beam is Kyogre's best option for a secondary attack to hit Tangrowth and Gastrodon.</p> <p>Calm Mind Kyogre fits well on balance teams that want a bulky sweeper to overwhelm even the bulkiest of defensive cores. Unlike offensive Kyogre sets, Calm Mind Kyogre is able to boost past normal checks like Assault Vest Tangrowth lacking Power Whip and Gastrodon on its own, albeit at the cost of immediate power. Kyogre appreciates bulky teammates like Corviknight and Landorus-T that can switch into the Grass- and Electric-type attacks aimed at it, respectively. They both can also pivot Kyogre back onto the field to give it another chance to set up or fish for a burn. Kyogre is slow and also thus lacks a good Speed stat to donate, so strong revenge killers like Rillaboom are recommended; Rillaboom's Grassy Terrain also doubles Kyogre's passive recovery and aids in setup. Clerics like Clefable make great teammates, as they can either wake Kyogre after it uses Rest or remove an untimely Toxic that slipped in before Substitute.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 517892, "username": "pannuracotta"}, {"user_id": 500884, "username": "longhiep341"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}], "writtenBy": [{"user_id": 484270, "username": "beauts"}, {"user_id": 523866, "username": "UT"}]}
  },
  "Gastrodon": {
    "comments": "<h1>Other Options</h1> <p>Counter and Mirror Coat can surprise foes, but it's hard to justify replacing one of its moves. Similarly, while Curse potentially turns Gastrodon into a late-game wincon, it's not generally useful.</p> <h1>Checks and Counters</h1> <p><strong>Grass-type Pokemon and Coverage</strong>: Common Grass-types in Rillaboom and Kartana have no problem OHKOing Gastrodon with their STAB attacks, however they have to watch out for a burn if they switch in directly. Grass-type coverage options from Pokemon Gastrodon is supposed to check, like Giga Drain from Volcarona and Grass Knot from Tapu Koko, make Gastrodon unable to deal with them.</p> <p><strong>Wallbreakers: Since Gastrodon can only shore up Defense or Special Defense, it can be broken down by targeting its weaker defense stat. Special wallbreakers like Yveltal can 2HKO physically defensive Gastrodon, while physical wallbreakers such as Rayquaza and Weavile, even though they fear Scald, can deal with the specially defensive variant.</p> <p><strong>Mewtwo and Tapu Lele: Mewtwo and Tapu Lele can handle both variants of Gastrodon courtesy of their ability to target both its Defense and Special Defense.</p> <p><strong>Freeze-Dry users</strong>: Freeze-Dry from Kyurem-W dents Gastrodon and Choice Specs variants outright OHKO it. Other Pokemon such as Arctozolt and Ninetales-A also heavily damage Gastrodon with Freeze-Dry, however they might fail to 2HKO the specially defensive variant.</p> <p><strong>Substitute Setup Users Substitute can bypass Clear Smog's ability to deal with stat boosts, allowing Corviknight to setup on it.</p> ",
    "sets": [
      {
        "name": "Specially Defensive (Special Defense)",
        "description": "<p>Specially defensive Gastrodon stands out as one of the best special walls with a Special Defense donation thanks to its ability to deal with the most prominent special attackers in Tapu Koko. Scald discourages physical attackers like Rillaboom and Necrozma-DM from switching in by threatening them with a burn. Toxic cripples common defensive switch-ins, in particular Tangrowth and opposing Gastrodon. Clear Smog prevents bulky Pokemon with setup moves from muscling past it, especially Tapu Fini and Clefable, as they aren't afraid of Toxic. Earthquake can instead be used to better deal with Substitute users like Volcanion. Leftovers gives Gastrodon extra recovery and reduces the need to use Recover's PP. If opposing Spikes is a concern, then Heavy-Duty Boots is a viable alternative. Calm is the preferred nature on sets with Clear Smog, while Earthquake variant opts for Sassy to avoid reducing Earthquake's damage.</p> <p>Specially defensive Gastrodon is seen on balance and stall teams as a reliable special wall. Gods with great Special Defense such as Ho-Oh and Giratina pair well with Gastrodon. Ho-Oh is a common partner thanks to their defensive synergy; Ho-Oh can take on Kyurem-W and Grass-types, particularly Kartana and Ferrothorn, for Gastrodon while Gastrodon deals with Water- and Electric-types like Volcanion and Tapu Koko. Other answers to Grass-types, notably Skarmory and Volcarona, also make great teammates. Strong physically offensive Pokemon such as Rayquaza and Victini can easily break through Gastrodon, which Rotom-W can handle. If Gastrodon forgoes Heavy-Duty Boots, the aforementioned Ho-Oh, Rotom-W, and Skarmory can also provide Defog support. Answers to Psychic-types like Mewtwo and Tapu Lele, which can target Gastrodon's weaker Defense stat with Psystrike and Psyshock, respectively, are necessary, so Steel-types like Necrozma-DM and Heatran or Psychic-types like Slowbro are recommended. On stall teams, Whirlwind from Giratina prevents Substitute foes such as Corviknight from using Gastrodon as setup bait. Cleric support from Clefable is also appreciated to help Gastrodon stay healthy.</p> "
      },
      {
        "name": "Physically Defensive (Defense)",
        "description": "<p>Physically defensive Gastrodon can take on prominent physical threats such as Zeraora, Buzzwole, and Necrozma-DM while still being able to check several special attackers like Volcanion and Heavy-Duty Boots Tapu Koko. Scald discourages Steel-type Pokemon like Necrozma-DM, which don't fear Clear Smog, from trying to set up on Gastrodon and Grass-types like Rillaboom and Kartana from switching in thanks to its high burn chance. Clear Smog prevents non-Steel-types, notably Weavile and Buzzwole, from muscling through Gastrodon with their setup moves. Earthquake hits several Pokemon harder than Scald, among them Galarian Slowking and Heatran. Toxic is an alternative that cripples defensive Pokemon such as Tangrowth and Slowbro; however, frequent Scald burns make it not as effective, in addition to many of its checks having Regenerator remedying its usefulness. Rocky Helmet is preferred to punish contact moves, especially U-turn from the likes of Tapu Koko and Victini and Triple Axel from Weavile. Leftovers can be used instead to offset chip damage from entry hazards. Relaxed is the go-to nature to preserve Earthquake's damage, but Bold should be used instead if Toxic is chosen over Earthquake.</p> <p>Physically defensive Gastrodon is typically found on bulky balance teams. Gods with high Defense stats, such as Calyrex-I, Groudon, and Necrozma-DM, are required to maximize Gastrodon's physical bulk. Grass-types, in particular Kartana and Rillaboom, easily OHKO Gastrodon, so teammates that can deal with them like Skarmory and Necrozma-DM make good partners. While Gastrodon can take on some special attackers, strong special wallbreakers like Kyurem-W still can break through it, so special walls such as Reuniclus make great partners. Reuniclus also enjoys Gastrodon's ability to deal with Volcanion and Tapu Koko which it can't properly check. Entry hazards hinder Gastrodon's role, which makes Defog support from Skarmory and Tornadus-T valuable.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 484270, "username": "beauts"}, {"user_id": 523866, "username": "UT"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 500884, "username": "longhiep341"}]}
  },
  "Garchomp": {
    "comments": "<h1>Other Options</h1> <p>Garchomp can forgo Scale Shot or one of its coverage moves for Stealth Rock. Fire Blast and a Special Attack donation threaten some of its checks like Skarmory and Corviknight better. A defensive set with a Defense donation and Rocky Helmet is possible, but the reliance on Wish and cleric support makes it hard to justify. Life Orb can increase its damage output, although it makes Garchomp more prone to priority moves such as Grassy Glide. Similarly, an Adamant nature leaves it outsped by more offensive Pokemon post-donation, like Tapu Koko and Noivern, but is an option on Scale Shot sets.</p> <h1>Checks and Counters</h1> <p><strong>Physically Defensive Pokemon: Hippowdon, Buzzwole, Skarmory, Tangrowth, and Corviknight can switch in and sponge any attack from Garchomp if it hasn't set up. They can then disrupt its sweep attempt with Whirlwind, Toxic, Stun Spore, or setup of their own.</p> <p><strong>Unaware Walls: Pyukumuku, Clefable, and Quagsire have no trouble handling Garchomp thanks to ignoring its boosts and healing its damage.</p> <p><strong>Ice-type Coverage: Ice Beam from Tyranitar or Ice Punch from Buzzwole can surprise Garchomp and heavily damage it, if not outright OHKO.</p> <p><strong>Faster Pokemon and Priority Users: Pokemon with Choice Scarf like Tapu Lele or a Speed-boosting ability like Arctozolt can outspeed and revenge kill Garchomp before Scale Shot, but only then. Alternatively, priority moves such as Ice Shard from Mamoswine and Weavile and Grassy Glide from Rillaboom can take advantage of the Defense drops from Scale Shot.</p> <p><strong>Status: Garchomp struggles to do its job properly if it is statused. Burn cuts its damage in half, paralysis from Tangrowth or Amoonguss makes it far easier to outspeed and revenge kill, and poison puts its sweep on a timer.</p> ",
    "sets": [
      {
        "name": "Swords Dance (Speed)",
        "description": "<p>Garchomp is a dangerous setup sweeper with a better Speed stat under its belt. Swords Dance allows it to break past sturdy walls such as Corviknight and Landorus-T. Earthquake is strong and reliable, threatening common Pokemon such as Heatran and Galarian Slowking. Scale Shot allows Garchomp to attack while further raising its Speed, making it more difficult to revenge kill. Fire Fang targets Grass-type foes that can handle Earthquake like Tangrowth and Ferrothorn, as well as others like Skarmory and Corviknight, providing perfect neutral coverage alongside Earthquake and Scale Shot. Stone Edge can be used instead to heavily damage Yveltal, Mandibuzz, and Ho-Oh, with the former two heavily threatening Garchomp with Foul Play and the latter with a burn from Sacred Fire. Leftovers provides longevity as Garchomp sets up.</p> <p>Garchomp best fits on bulky offense teams as a late-game sweeper or hyper offense ones as a wallbreaker. A Speed donation from Zamazenta, Pheromosa, or Mewtwo helps it force more offensive Pokemon out such as Zygarde-10% and Noivern, allowing it to get a Swords Dance up more easily. Entry hazards, like Ferrothorn's Spikes and Heatran's Stealth Rock, compound damage throughout the game, putting Pokemon like Buzzwole and Slowking in Garchomp's KO range late-game. Magnezone can trap and eliminate Corviknight and Skarmory, making it a great partner. Special attackers that invite Heatran and Galarian Slowking in, especially those with a pivot move like Tapu Koko or Tornadus-T, are also great options. Pokemon such as Weavile and Kartana work with Garchomp to overwhelm shared checks, allowing one to sweep. The latter can also break past physically defensive Unaware walls like Clefable and Quagsire, which Garchomp can't get past. Dual screens support from the likes of Alolan Ninetales and Grimmsnarl helps Garchomp set up safely and remedies its Defense drop from Scale Shot. Scale Shot's inconsistency can make bulky Flying-type Pokemon, namely Ho-Oh and Landorus-T, troublesome, making teammates that can take advantage of them like Urshifu-R and Cloyster valuable. Psychic Surge from Tapu Lele can prevent priority attacks like Weavile's Ice Shard from exploiting Scale Shot's Defense drop.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 484270, "username": "beauts"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}], "writtenBy": [{"user_id": 500884, "username": "longhiep341"}]}
  },
  "Weavile": {
    "comments": "<h1>Other Options</h1> <p>With reliable entry hazard control, Weavile can run other items like Black Glasses and Life Orb to increase its wallbreaking power. Protective Pads is also an option to avoid Iron Barbs and Rough Skin damage.</p> <h1>Checks and Counters</h1> <p><strong>Fairy-types</strong>: Fairy-types such as Tapu Fini and Defensive Clefable completely wall Weavile lacking Poison Jab and force it out.</p> <p><strong>Speed Receivers: Weavile is slower than common fast gods like Pheromosa, Mewtwo, and Zamazenta-C, meaning their Speed receivers like Volcanion, Blacephalon, and Tapu Lele can easily revenge kill it.</p> <p><strong>Priority: Weavile's poor bulk leaves it vulnerable to being revenge killed with priority, such as Zygarde-10% Extreme Speed or Rillaboom's Grassy Glide if it is locked into a move other than Ice Shard.</p> ",
    "sets": [
      {
        "name": "Swords Dance (Attack, Defense, Special Defense)",
        "description": "<p>Between its high Speed, good STAB combination, strong Knock Off, and access to priority, Weavile makes a great late-game cleaner. Swords Dance capitalizes on the free turns Weavile generates by forcing out slower threats like Zygarde-10%, Landorus-T, and Tornadus-T, giving it the raw power necessary to break through opposing walls. Triple Axel is Weavile's most powerful move and hits common defensive stalwarts like Landorus-T, Tornadus-T, Giratina, and Yveltal. Knock Off has great coverage with Triple Axel and removes items, weakening common walls like Skarmory and Rotom-W that can otherwise withstand its attacks. Ice Shard is able to pick off weakened faster threats like Dragon Dance Rayquaza, Speed receiver Landorus-T, Scale Shot Garchomp, and any heavily weakened foe. Weavile can also forgo priority to run extra coverage in Poison Jab, which can bypass Tapu Fini, or Low Kick, which is its best option against Ferrothorn.</p> <p>Weavile likes to receive Attack from gods like Necrozma-DM, Rayquaza, and Zekrom; however, thanks to its already good Attack and Speed, it can let a teammate take these in-demand stats and still perform well with its base offenses. Tapu Koko is a great partner for Weavile, as it lures in and pivots on Ground-types like Landrous-T, giving Weavile a great entry point. Tapu Koko also threatens Tapu Fini and Skarmory, two of Weavile's better checks. Many powerful wallbreakers like Zygarde-10%, Victini, and Swords Dance Necrozma-DM love Weavile's ability to finish off foes with priority and its excellent Speed tier. Weavile is quite frail, so it likes being pivoted in by Pokemon like Slowking, Slowbro, and Landorus-T. Weavile also pairs well with entry hazard setters like Ferrothorn and Landorus-T, as its Knock Off removes Heavy-Duty Boots from foes and the extra chip damage helps put Weavile in a position to clean.</p> "
      },
      {
        "name": "Choice Band (Attack)",
        "description": "<p>Choice Band Weavile is a potent early-game wallbreaker. Triple Axel is Weavile's strongest Ice-type attack, which hits the plethora of Ground-, Flying-, and Dragon-types the tier has to offer. Ice Shard picks off fast Pokemon like Dragon Dance Rayquaza, Scale Shot Garchomp, Dragon Dance Zygarde-10%, and Agility Galarian Moltres, allowing Weavile to have extra utility as a revenge killer. Knock Off can cripple defensive switch-ins and also severely damages Psychic-types like Slowking, Slowbro, Victini, and Necrozma-DM. Beat Up is the preferred option in the last moveslot, as it has a more consistent Base Power than Knock Off early-game and with the right team structures can have devastating power. Low Kick targets Pokemon that are not weak to Weavile's other moves like Ferrothorn and Tyranitar, while Poison Jab is its best option against Tapu Fini.</p> <p>Choice Band Weavile needs the extra Attack gods like Necrozma-DM, Rayquaza, and Zekrom provide. Weavile should be played early and aggressively to put pressure on the opposing defensive core. Weavile can also force out slower offensive threats like Zygarde-10% and Victini. Since it is exceedingly frail, it appreciates offensive pivots like Tapu Koko and Zeraora bringing it in safely. It also has additional synergy with Electric-type attackers, as it heavily pressures opposing Ground- and Grass-types that can otherwise stomach their attacks. Weavile threatens common Defog users like Yveltal, Tornadus-T, and Landorus-T, which entry hazard setters like Skarmory, Ferrothorn, and Heatran appreciate. Weavile synergizes well with other fast wallbreakers like Nasty Plot Tornadus-T, Dragon Dance Zygarde-10%, and Tapu Koko who can finish off teams after Weavile has weakened them. Weavile is vulnerable to Stealth Rock, so it likes having Defog users like Corviknight, Tornadus-T, and Rotom-W around. Weavile also has trouble breaking past bulky Fairy- and Water-types, so it enjoys the presence of teammates like Kartana and Dhelmise that can deal with these threats.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 525446, "username": "Ducky"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 584907, "username": "Wes8888"}]}
  },
  "Tangrowth": {
    "comments": "<h1>Other Options</h1> <p>Occa Berry can be run on physically defensive Tangrowth as an emergency to heavily damage Victini and remove its Choice item or Heavy-Duty Boots. Leech Seed can help beat foes like Zamazenta-C more consistently, but it's hard to forgo one of its other moves. Rock Slide on the specially defensive set allows Tangrowth to beat offensive Volcarona and hits Ho-Oh for decent damage on the switch. An offensive set utilizing Chlorophyll, a Speed donation, Growth, and its great mixed offensive movepool can surprise foes, but Venusaur is usually better at this role.</p> <h1>Checks and Counters</h1> <p><strong>Flying-type Pokemon: Strong offensive Flying-types can muscle past Tangrowth with their powerful STAB attacks. Rayquaza can OHKO Tangrowth, while Ho-Oh, Yveltal and Tornadus-T take little damage from Tangrowth's attacks and can heal off any damage they do take. However, they can be crippled by Knock Off, Sludge Bomb, and Stun Spore.</p> <p><strong>Fire-type Pokemon and Coverage: Despite being unable to switch in directly due to Earthquake, Knock Off, and Stun Spore, Fire-types such as Heatran, Victini, and Reshiram easily overwhelm Tangrowth. Fire-type coverage from offensive threats like Groudon's Heat Crash also threatens it, especially if they are boosted.</p> <p><strong>Steel-type Pokemon: Most Steel-types are bulky enough to withstand Tangrowth's attacks and can use it to set up boosts or entry hazards if it lacks Focus Blast. Skarmory and Ferrothorn can freely set entry hazards in front of Tangrowth, while Necrozma-DM and Bulk Up Corviknight aren't even threatened by Focus Blast and simply use their recovery moves to continuously set up, with the former even taking advantage of Knock Off to activate Weakness Policy.</p> <p><strong>Passive damage: Even with Regenerator, Tangrowth is still prone to getting worn down, especially without Synthesis, considering its weakness to U-turn. Entry hazards and Toxic from Landorus-T and Heatran cause Tangrowth to struggle with Pokemon it's supposed to check like Tapu Koko.</p> <p><strong>Item Removal: Specially Defensive Tangrowth relies on its Assault Vest to take hits effectively, so Knock Off from Ferrothorn and opposing Tangrowth or Trick from Tapu Fini can leave it unable to handle powerful special wallbreakers such as Choice Specs Tapu Koko.</p> ",
    "sets": [
      {
        "name": "Assault Vest (Special Defense)",
        "description": "<p>Specially Defensive Tangrowth is one of the best walls in Godly Gift, courtesy of Regenerator, its high Defense, and a received Special Defense, which is further amplified with an Assault Vest. This allows it to be an amazing check to a handful of top-tier threats like Tapu Koko, and it can also switch into Zygarde-10%'s Thousand Arrows when necessary. Giga Drain gives Tangrowth passive recovery, while Power Whip lets Tangrowth damage Calm Mind users like Tapu Fini, which would otherwise set up on it. Knock Off deters switch-ins that rely on their items, notably Ho-Oh and Ferrothorn. Sludge Bomb lets Tangrowth check Grass-types like Dhelmise, opposing Tangrowth, and Rillaboom, while threatening to spread poison. Earthquake heavily damages Heatran, which otherwise would trap and eliminate Tangrowth, while also allowing Tangrowth to beat Electric-types such as Zeraora and Tapu Koko. Focus Blast prevents Zamazenta-C, Ferrothorn, and Kartana from boosting or setting entry hazards on Tangrowth.</p> <p>Tangrowth's amazing defensive capability and ability to support offensive threats make it a great addition to offensive and defensive teams alike. Most gods can greatly bolster Tangrowth's poor Special Defense stat, most notably Ho-Oh. The latter has especially great synergy with Tangrowth, since it can switch in on Fire-type attacks that threaten it like Victini's V-Create and Reshiram's Blue Flare, while Tangrowth takes on Electric- and Water-type Pokemon such as Gastrodon and Alolan Raichu; they also form a Regenerator core. Physical walls such as Skarmory benefit from Tangrowth's ability to deal with special attackers like Dialga and Rotom-W. Rotom-W forms a Grass / Fire / Water core together with Ho-Oh and Tangrowth, being able to handle myriad physical threats that the other two can't, including Victini, Rayquaza, and Kyurem-B. Offensive threats such as Tapu Koko and Zygarde-10% who share common switch-ins with Tangrowth, like opposing Tangrowth and Ferrothorn, take advantage of Tangrowth's ability to cripple them with Sludge Bomb and Knock Off. Magnezone traps various Steel-type Pokemon, most importantly Skarmory and Necrozma-DM, that Tangrowth can't threaten. Entry hazard removal from Pokemon like Excadrill and Rotom-W is necessary to prevent Tangrowth from getting worn down.</p> "
      },
      {
        "name": "Physically Defensive (Special Defense)",
        "description": "<p>Physically defensive Tangrowth can handle prominent physical attackers such as Zeraora, Zygarde-10%, and Rillaboom while still being able to switch in and scout for several Choice item special attackers like Choice Specs Tapu Koko, thanks to a Special Defense donation. Giga Drain deals decent damage and gives Tangrowth passive recovery. Knock Off deters would-be switch-ins such as Ho-Oh and helps avoid the 2HKO from especially strong physical attacks like Outrage from Zygarde-10%. Setup sweepers like Dragon Dance Necrozma-DM and Bulk Up Buzzwole can muscle past Tangrowth; Stun Spore is Tangrowth's only option against them, enabling other teammates to handle them. Focus Blast is Tangrowth's best move against Zamazenta-C and Kartana, which otherwise use it as setup fodder. If another teammate can already handle them effectively, Sludge Bomb can replace Focus Blast to cripple defensive Pokemon such as Giratina. Synthesis is another alternative that helps keep Tangrowth healthy without having to switch out or rely on Giga Drain. Rocky Helmet is the preferred item to punish contact moves, especially U-turn from the likes of Landorus-T and Urshifu-R. Heavy-Duty Boots helps against entry hazard stack teams or if the team lacks strong entry hazard control options.</p> <p>Physically defensive Tangrowth finds its home on bulky offense teams as a reliable wall. Most gods make for good teammates, but Ho-Oh and Zamazenta-C stand out thanks to their high Special Defense and defensive synergy with Tangrowth. Slow wallbreakers such as Victini and Obstagoon appreciate Tangrowth's ability to switch in against faster threats that force them out like Zygarde-10%. Grass-types such as Kartana and Rillaboom are problematic for Water-type partners such as Rotom-W, which Tangrowth can handle. Rotom-W, in particular, also deals with several physical threats that Tangrowth can't, namely Victini and Rayquaza. Bulky setup Pokemon, including Buzzwole and Steel-types like Necrozma-DM and Bulk Up Corviknight, can set up against Tangrowth even with Stun Spore, making a teammate that can handle these Pokemon a necessity. Ho-Oh can phaze with Whirlwind and burn them with Sacred Fire, while Rotom-W can cripple them with Trick and Will-O-Wisp. Magnezone can also trap these Steel-types and beat them one-on-one, making it a good partner. Excadrill, Ho-Oh, and Corviknight can clear entry hazards and relieve pressure for Tangrowth If it opts for Rocky Helmet over Heavy-Duty Boots.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 517892, "username": "pannuracotta"}, {"user_id": 525446, "username": "Ducky"}]}, {"name": "Grammar checked by", "members": [{"user_id": 277988, "username": "dex"}]}], "writtenBy": [{"user_id": 500884, "username": "longhiep341"}]}
  },
  "Rotom-Heat": {
    "comments": "<h1>Other Options</h1> <p>Toxic can be used to wear down bulky Pokemon such as Gastrodon, Ho-Oh, and Giratina over time, as well as check Volcarona, but Will-O-Wisp is generally preferred. Thunder Wave is also an option to aid slower wallbreakers, but makes it a worse check to Rillaboom.</p> <h1>Checks and Counters</h1> <p><strong>Gastrodon: Gastrodon resists Overheat and is immune to Volt Switch, and it does not care much about getting burned. Only Toxic Rotom-H can threaten it.</p> <p><strong>Dragon-Types</strong>: Giratina and Kyurem-W are able to consistently switch into Rotom-H without fearing its STAB moves or common status options. Kyurem-W can also threaten Rotom-H with Turboblaze Earth Power.</p> <p><strong>Knock Off: Rotom-H's reliance on Heavy-Duty Boots for longevity leaves it an easy target for Knock Off from the likes of Tangrowth, Rillaboom, and Zeraora.</p> <p><strong>Toxic Users: Toxic from Pokemon like Landorus-T and Heatran completely cripples Rotom-H and wears it down considerably, leaving it vulnerable to the Pokemon it's supposed to check.</p> ",
    "sets": [
      {
        "name": "Pivot (HP)",
        "description": "<p>Rotom-H's unique set of resistances and good bulk make it a potent specially defensive pivot, as it can switch into top special attackers like Tapu Koko and Heatran. Rotom-H excels at bringing teammates such as Tapu Lele and Zygarde-10% in safely with Volt Switch, as it threatens common Ground-types such as Landorus-T with Will-O-Wisp. Overheat, in addition to being Rotom-H's strongest attack, provides coverage against the numerous Grass- and Steel-types in the metagame like Tangrowth and Necrozma-DM. Will-O-Wisp also helps check Rayquaza and Rillaboom, which its excellent typing allows it to check without significant Defense investment. Pain Split allows Rotom-H to stay healthy, which is useful in longer games. It can also opt for Defog, since it matches up well into common entry hazard setters such as Landorus-T, Ferrothorn, and Necrozma-DM.</p> <p>Rotom-H fits best on bulky offense teams that have high HP gods, such as Yveltal, Mewtwo, and Kyurem-W. Yveltal is an especially good partner since it appreciates Rotom-H checking Tapu Koko. Other pivoting teammates like Tapu Koko, Landorus-T, and the aforementioned Yveltal form potent VoltTurn cores with Rotom-H. Strong wallbreakers such as Weavile, Tapu Lele, and Zygarde-10% appreciate Rotom-H bringing them onto the field safely. Grass-types such as Dhelmise and Rillaboom make excellent partners, as they threaten Rotom-H's number one enemy, Gastrodon. Knock Off severely threatens Rotom-H because of its reliance on Heavy-Duty Boots to not get worn down by Stealth Rock, so Knock Off switch-ins such as Buzzwole and Clefable make for great teammates. Finally, other special walls such as Tangrowth and Slowbro help cover special attackers that don't fear Rotom-H, like Kyurem-W and Volcanion.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 52544, "username": "Ducky"}]}, {"name": "Grammar checked by", "members": [{"user_id": 277988, "username": "dex"}]}], "writtenBy": [{"user_id": 528314, "username": "Plushietran"}]}
  },
  "Rotom-Wash": {
    "comments": "<h1>Other Options</h1> <p>Toxic can be run to wear down bulkier foes like Gastrodon, Tangrowth, Ho-Oh, and Lunala over time, but Rotom-W generally appreciates its other status spreading moves more. A specially defensive EV spread can be run to better check foes like Heatran, Volcarona, and Kyogre; however, Rotom-W is generally better off being physically defensive thanks to the plethora of major physical threats it can check. Choice Scarf Rotom-W can be an excellent revenge killer alongside slower gods, and it can also cripple slower foes with Trick. However, running Speed investment dramatically reduces Rotom-W's bulk, and there are generally better options for Choice Scarf users.</p> <h1>Checks and Counters</h1> <p><strong>Grass-types: Grass-types like Kartana, Ferrothorn, and Tangrowth can safely sponge any of Rotom-W's moves and can hit it back super effectively; however, they do dislike getting burned.</p> <p><strong>Wallbreakers: Powerful wallbreakers like Galarian Moltres, Zekrom, and Tapu Lele are potentially able to overpower Rotom-W. However, it can punish them with status and they cannot safely switch in.</p> <p><strong>Chip Damage: Stealth Rock severely burdens Rotom-W, as it gets worn down as it repeatedly switches in. Furthermore, Toxic from foes like Heatran, Giratina, and Gastrodon will wear down Rotom-W over time.</p> <p><strong>Dragon-types: Dragon-types like Hydreigon, Zygarde-10%, and both Kyurem formes resist Rotom-W's STAB attacks and can overpower it, but they must be cautious about switching into status moves or Volt Switch.</p> ",
    "sets": [
      {
        "name": "Defensive Pivot (HP)",
        "description": "<p>Rotom-W is one of the best defensive Pokemon in the metagame thanks to its great defensive stats, useful resistances, and plethora of moves that make it incredibly annoying to switch into. Thunder Wave cripples threats such as Yveltal, Volcarona, and Tapu Lele, while Will-O-Wisp ruins physical attackers such as Rayquaza, Necrozma-DM, and Bisharp. Volt Switch lets Rotom-W generate momentum on special walls like Ferrothorn, Tangrowth, and Giratina for free. Pain Split gives it a form of recovery, which can help in longer games. Defog is another option, as Rotom-W beats common entry hazard setters like Necrozma-DM, Landorus-T, and Heatran. Leftovers is the preferred item to give Rotom-W a form of passive recovery.</p> <p>Rotom-W fits best on bulky offense teams. It's best paired up with gods with high HP stats like Yveltal, Kyurem-W, and Ho-Oh. Other pivoting teammates like the aforementioned Yveltal, as well as Landorus-T, Zeraora, and Tapu Koko, are highly valued as they're able to keep up the momentum alongside Rotom-W. Powerful wallbreakers like Tapu Lele, Kartana, and Rayquaza also appreciate Rotom-W's pivoting and ability to spread status. Grass-types like Kartana, Ferrothorn, and Tangrowth are annoying for it, so pairing it up with Grass checks like Tornadus-T, Heatran, and Galarian Slowking make for good partnerships. Will-O-Wisp variants are vulnerable against special attackers like Mewtwo, Nidoking, and Tapu Lele, making specially defensive walls such as Galarian Slowking, Tangrowth, and Necrozma-DM fantastic teammates.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 525446, "username": "Ducky"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 517892, "username": "pannuracotta"}]}
  },
  "Heatran": {
    "comments": "<h1>Other Options</h1> <p>Scorching Sands is an option over Earth Power to spread burns, but the damage drop is noticeable and can make it miss out on KOs such as Tapu Koko and opposing Heatran. An offensive set consisting of Eruption, Earth Power, Ancient Power, and Solar Beam is possible on sun teams, however its reliance on staying at full HP and the lack of a pivot option from Groudon and Torkoal make it very inconsistent. Flame Body over Flash Fire potentially punishes physical Pokemon, especially if they pivot out with U-turn, but this makes Heatran more vulnerable to Fire-types like Ho-Oh and Victini.</p> <h1>Checks and Counters</h1> <p><strong>Ground-type Pokemon and Coverage: Unless Heatran has its Air Balloon intact, Ground-type moves will heavily damage if not OHKO it. Offensive Groudon and Excadrill can outspeed and OHKO the specially defensive variant, while Landorus-T and Zygarde-10% can take a hit and OHKO in return, with the latter also ignoring Air Balloon. However, none of these Pokemon can switch in safely. Earthquake from Ho-Oh and Tangrowth deters Heatran from switching in directly and trapping them.</p> <p><strong>Water-type Pokemon: Offensive Water-types like Kyogre and Urshifu-R threaten to OHKO Heatran with their powerful STAB attacks, and the latter also ignores Protect thanks to Unseen Fist. Defensive Water-type Pokemon like Gastrodon and Slowbro can muscle past or force mind game against Heatran. All of them still has to watch out for Toxic on the switch in though.</p> <p><strong>Offensive Pressure: Since Heatran usually needs a pivot from teammate to safely get in, offensive pressure prevents its partners like Landorus-T Rillaboom from safely using U-turn. Examples of Pokemon that can force these Pokemon out or pivot against them include Tornadus-T and Yveltal.</p> ",
    "sets": [
      {
        "name": "Specially Defensive (HP, Any)",
        "description": "<p>Thanks to its great typing and stats, Heatran is a good special tank that can check many Pokemon such as Volcarona and Kyurem-W without Earth Power. Magma Storm is a powerful Fire-type STAB move that also traps and deals chip damage, allowing Heatran to eliminate passive Pokemon like Clefable and Pyukumuku in conjunction with Taunt. Lava Plume is an option with better accuracy and PP that threatens a burn on potential switch-ins such as Rayquaza and Garchomp. Stealth Rock lets it support its teammates, and Heatran's ability to threaten common entry hazard removers allows it to keep it on the field frequently. Toxic cripples common switch-ins such as Gastrodon and Slowking and deals a lot of passive damage when stacked with Magma Storm. Earth Power is used to hit opposing Heatran, which otherwise wall it, as well as lessens the need to use Magma Storm's low PP against foes like Tapu Koko and Victini. Protect helps Heatran rack up passive damage as well as gain extra Leftovers recovery. It also scouts common Choice item Pokemon, like Zygarde-10% and Kyogre. Taunt is an option to prevent recovery moves and Teleport from defensive Pokemon, notably Clefable. Leftovers is the preferred item to give Heatran recovery, but Air Balloon is an aggressive option that lets it counter opposing Heatran, and also Dhelmise after it pops. If it is not in the Speed slot, 120 Speed EVs lets Heatran outspeed uninvested base 90 Pokemon, which are common thanks to powerful gods like Kyogre and Ho-Oh, in addition to Bold and Modest Magnezone. If Heatran does receive Speed, it can invest more fully in Special Defense.</p> <p>Specially Defensive Heatran thrives on bulky offense teams where it gets many opportunities to switch in. Many physically offensive Pokemon enjoy Stealth Rock to wear down their checks and counters, especially those with Knock Off to remove Heavy-Duty Boots like Weavile and Kartana. Moreover, Heatran threatens physical walls that they can't break though such as Skarmory and Ho-Oh. Special attackers like Kyurem-W and Tapu Koko can struggle against specially defensive cores, and Heatran can help soften these walls for them. Offensive and defensive pivots complement Stealth Rock well by racking up damage and give Heatran more opportunities to switch in. Examples of pivots include offensive Pokemon like Zeraora and Rillaboom and defensive Pokemon like Slowking and Corviknight. Rillaboom notably synergizes well with Heatran thanks to Grassy Terrain providing extra recovery and halving Earthquake damage. Heatran is unable to deal with some special wallbreakers, namely Kyogre and Volcanion, so Gastrodon can cover for Heatran well. Physical Ground- and Fighting-types dent Heatran, which Buzzwole, Tangrowth, and Landorus-T handle well.</p> "
      },
      {
        "name": "Offensive (Speed)",
        "description": "<p>Offensive Heatran specializes in trapping and getting rid of passive defensive Pokemon that can otherwise cause problems, such as Ho-Oh and Clefable. Magma Storm is its main Fire-type STAB attack that deals residual damage in addition to its high Base Power, allowing it to beat even Pokemon that resist it such as Giratina and Ho-Oh without Earthquake. Earth Power destroys opposing Heatran, which otherwise walls it completely. Toxic further increases its passive damage, helping against said foes and reducing the need to constantly waste Magma Storm's low PP. Taunt prevents the defensive Pokemon from using their recovery moves, pivoting out with Teleport, or phazing Heatran out with Roar and Whirlwind. Leftovers's passive recovery allows Heatran to more comfortably take on the defensive Pokemon. If opposing Heatran is a concern, Air Balloon lets Heatran wall it, as well as Ho-Oh opting for Earthquake over Brave Bird.</p> <p>Offensive Heatran finds its home on balance and bulky offense teams as a way to make progress against bulkier builds. Heatran usually doesn't like switching in directly, so pivots like Slowbro and Landorus-T enable it to safely get a favorable matchup. Late game cleaners like Choice Scarf Kartana and Tapu Lele appreciate having opposing walls removed or weakened. Water- and Ground-type Pokemon such as Kyogre and Excadrill threaten an OHKO on Heatran, which Grass-types like Tangrowth and Ferrothorn can handle. Rillaboom threatens fast offensive Pokemon, as well as provides Grassy Terrain to give Heatran additional recovery and weaken Earthquake damage. Fighting-type coverage from the likes of Zeraora and Kartana can be dealt with by partners like Clefable.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 525446, "username": "Ducky"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 500884, "username": "longhiep341"}]}
  },
  "Victini": {
    "comments": "<h1>Other Options</h1> <p>Glaciate can be used for speed control, but forces Victini to give up a coverage move, which makes it overall less threatening. It can run Trick Room so it doesn't have to worry about the Speed drop from V-create, but it is again forced to give up a coverage move and is underwhelming outside of Trick Room.</p> <h1>Checks and Counters</h1> <p><strong>Fire-types</strong>: Fire-types like Heatran and Ho-Oh can switch into V-create and force out Choice Band Victini. Ho-Oh, however, must fear Bolt Strike.</p> <p><strong>Bulky Water-types: Water-types such as Slowking and Slowbro can come in for free if Victini is locked into V-create, but must fear Bolt Strike, which 2HKOes them.</p> <p><strong>Knock Off: Knock Off from defensive Pokemon that Victini may try to switch into like Tangrowth severely hinders Victini's ability to pivot by making it vulnerable to Stealth Rock.</p> <p><strong>Faster Pokemon: Many fast wallbreakers such as Zeraora, Zygarde-10%, Weavile, and Garchomp can outspeed Victini and exploit its mediocre defensive typing. However, Zeraora and Weavile must beware Speed inheritor sets, as they are OHKOed by a faster V-create. Garchomp and Zygarde-10% must also be wary of Glaciate, which can severely dent them and put Victini within range to outspeed and KO them.</p> ",
    "sets": [
      {
        "name": "Wallbreaker (Attack / Speed)",
        "description": "<p>With solid all around stats and great moves at its disposal, Victini is an excellent wallbreaker and pivot. V-create is a very strong STAB move that deals massive damage to all neutral targets. Zen Headbutt is a nice secondary STAB move that hits foes that resist Fire like Volcanion and has good neutral coverage with V-create, and also does not reduce Victini's stats. U-turn allows Victini to keep up momentum after scoring a KO or on a predicted switch to a check like physically defensive Landorus-T. Bolt Strike is a great coverage move to hit Pokemon that resist V-create such as Slowking and Ho-Oh. Heavy-Duty Boots allows Victini to switch in more easily without worry about Stealth Rock and have the freedom to switch moves, but Choice Band deals incredible damage. Speed receivers should run Jolly to make the most of their new Speed stat, and Attack Adamant or Jolly.</p> <p>Victini loves to receive donations from gods with high Attack stats like Necrozma-DM, Rayquaza, and Groudon. Groudon's Drought also increases V-create's damage even further. Alternatively, it can receive Speed from fast gods like Mewtwo, Zamazenta, and Pheromosa. Many setup sweepers appreciate Victini's ability to bring them in with U-turn, such as Rayquaza and Bulk Up Zeraora. Necrozma-DM and Victini synergize well, with Victini checking bulky Steel-types and making great use of Necrozma-DM's Attack stat, and Necrozma-DM switching into defensive Knock Off users that threaten Victini, activating its Weakness Policy and threatening to sweep. Victini is prone to being outsped after using V-create, so Landorus-T, which is immune to Earthquake from Garchomp and walls Zeraora, is a good teammate to handle faster threats. Victini is crippled by Knock Off, so bulky Pokemon that can switch into it like Buzzwole are appreciated. Choice Band sets require excellent entry hazard removal, so reliable Defog users such as Corviknight, Skarmory, Ho-Oh, and Tornadus-T are a necessity. Victini also likes being pivoted in by Pokemon like Landorus-T, Slowking, and Tapu Koko.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 525446, "username": "Ducky"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 584907, "username": "Wes8888"}]}
  },
  "Excadrill": {
    "comments": "<h1>Other Options</h1> <p>A dedicated lead set with Stealth Rock, Rock Tomb, Rapid Spin, and Steel Beam is possible; however, it still struggles to keep Stealth Rock up against Pokemon such as Corviknight and Giratina. High Horsepower is an option if Rillaboom is run on the same team to prevent reduced Earthquake damage.</p> <h1>Checks and Counters</h1> <p><strong>Flying-types: Skarmory and Corviknight are the hardest counters to Excadrill, as they are immune to Toxic, resist its STAB moves, can threaten it with Body Press, and remove its Stealth Rock with Defog. Physically defensive Yveltal and Mandibuzz can also beat Excadrill thanks to Foul Play, and Landorus-T is neutral to Rock Slide and weakens Excadrill's attacks with Intimidate. However, they fear Toxic wearing them down.</p> <p><strong>Weather Control: Rayquaza and Groudon can nullify sand, then outspeed and easily OHKO Excadrill.</p> <p><strong>Physically bulky Pokemon: Pokemon with great physical bulk like Tangrowth, Buzzwole, and Slowking can easily take a boosted hit from Excadrill. The former can then retaliate with Earthquake, Focus Blast, or cripple it with Stun Spore, while the latter two can hit it super effectively with their STAB attacks. Pyukumuku and Quagsire can ignore all boosts Excadrill acquires and heal off all damage done. However, all of these Pokemon can get worn down by Toxic and sand damage.</p> ",
    "sets": [
      {
        "name": "Sand Rush (Defense, Special Defense, Speed)",
        "description": "<p>Sand Rush Excadrill is a dangerous sweeper under sand thanks to its high Attack and offensive typing. Earthquake is its main attack, OHKOing numerous offensive Pokemon such as Zeraora and Heatran. Rock Slide hits Pokemon that are immune to Ground, notably Ho-Oh and Yveltal. Swords Dance further boosts Excadrill's Attack, allowing it to break through sturdy physical walls such as Magic Guard Clefable and Ferrothorn. Iron Head is its secondary STAB option that hits some Pokemon like Kyurem and Landorus-T harder, and its flinch chance can be useful to take down foes Excadrill struggles with otherwise, like Landorus-T, Unaware Clefable, and Tangrowth. Rapid Spin instead gives it some utility by removing entry hazards while also giving it the potential to sweep outside of sand. Leftovers is the preferred item to increase Excadrill's longevity and utilize its great defensive typing; however, Life Orb can be used to increase its damage output at the cost of being more prone to getting worn down. Sand Rush lets Excadrill outspeed the entire unboosted metagame, even fast Choice Scarf users like Kartana. An Adamant nature maximizes its damage output, but Jolly is an option to outspeed Pheromosa and its Speed receiver outside of sand at +1 Speed.</p> <p>Excadrill's already great Attack and decent Speed make it flexible with what slot it can fit into. A sand setter is mandatory for Excadrill; Tyranitar is preferred, as it can act as a reliable switch-in to dangerous Pokemon like Yveltal, Kyurem-W, and Galarian Moltres once sand runs out, and it also provides Stealth Rock to chip Excadrill's checks and counters and can lure Landorus-T and KO it with Ice Beam. Dracozolt is another sand staple that can break physical walls that trouble Excadrill, especially Skarmory, Corviknight, and Ferrothorn. Together, they wear down Landorus-T for the other to break through. Magnezone can trap and eliminate these two Pokemon, which makes it a great teammate, although it does not provide much defensive utility. Sand cores are very susceptible to Ground- and Fighting-type attacks, so the rest of the team should focus on shoring up these weaknesses. Ho-Oh is immune to Ground, checks Tangrowth, and also provides great Attack for Dracozolt, Defense or Special Defense for Excadrill, and Speed for Tyranitar. Similarly, Rotom-W can handle Ground-type Pokemon and check other weather setters that would otherwise be problematic. Tangrowth and Buzzwole deal with Zygarde-10%, which can bypass Ho-Oh and Rotom-W's Ground immunities with Thousand Arrows. Clefable can switch in on Close Combat from Buzzwole and Zeraora and is also immune to sand chip damage thanks to Magic Guard.</p> "
      },
      {
        "name": "Specially Defensive (Special Defense)",
        "description": "<p>Specially defensive Excadrill is a good form of role compression, capable of setting Stealth Rock, clearing entry hazards, and checking prominent metagame threats, in particular, Tapu Koko. Earthquake is its primary STAB attack, hitting Alolan Raichu and Tapu Koko hard and can also discourage specially offensive Fire-types like Heatran and Volcanion from switching in. Rapid Spin removes entry hazards, and Excadrill's natural resistance to them means it can often switch in multiple times even without recovery. Toxic cripples switchins such as Tangrowth and Landorus-T. Stealth Rock complements Excadrill's ability to support its teammates and compress roles. Alternatively, if another teammate already has Stealth Rock, Excadrill can opt for Iron Head to better deal with Kyurem-W and Fairy-types like Clefable and Tapu Lele. Leftovers is Excadrill's only form of recovery, but Heavy-Duty Boots is also an option on more offensive teams if Spikes is a particular concern. Mold Breaker helps Excadrill threaten Rotom formes with Earthquake by bypassing Levitate and also eases prediction for Stealth Rock and Toxic by going through Magic Bounce. 32 Speed EVs allow it to outpace Modest Magnezone and Victini after V-Create.</p> <p>Specially defensive Excadrill fits best on offense teams as a utility Pokemon that serves as a Tapu Koko counter. It benefits from any Special Defense boost; however, gods with high Special Defense like Ho-Oh and Zamazenta ease its ability to take hits. Since Excadrill takes the Special Defense slot while still being weak to prominent special threats such as Volcanion, Slowking and Kyurem-W are helpful to shore up this weakness. Offensive threats enjoy Excadrill's ability to clear entry hazards and potentially land a Toxic on Landorus-T while still keeping entry hazards on the foe's side for them to more easily wallbreak. This is especially beneficial to those that tend to switch out repeatedly throughout a game like Victini and Rayquaza. Conversely, they threaten Skarmory, Ho-Oh, and Corviknight, which Excadrill struggles to take on. Rotom-W checks Rayquaza and Zamazenta-C, which would otherwise easily break Excadrill due to its low Defense.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 484270, "username": "beauts"}]}, {"name": "Grammar checked by", "members": [{"user_id": 277988, "username": "dex"}]}], "writtenBy": [{"user_id": 500884, "username": "longhiep341"}]}
  },
  "Ferrothorn": {"sets": [{"name": "Specially Defensive (HP)"}]},
  "Bisharp": {
    "comments": "<h1>Other Options</h1> <p>Bisharp can opt to hold a Choice Band to increase its wallbreaking ability, but it is a tough trade-off, as it means Bisharp can no longer run Swords Dance. Beat Up can be run with Choice Band to increase its damage output further. Low Kick threatens Steel-type Pokemon like Cobalion, which otherwise check Bisharp.</p> <h1>Checks and Counters</h1> <p><strong>Fast Offensive Pokemon: Bisharp is threatened by many offensive Pokemon that either Speed tie or outspeed it post-donation, such as Tapu Koko and Zeraora. However, many of these Pokemon are threatened by a boosted Sucker Punch.</p> <p><strong>Fighting-types: Fighting-types such as Zamazenta, Buzzwole, Urshifu-R, and Cobalion resist Bisharp's Dark-type attacks and are not threatened by Iron Head, and they force Bisharp out by threatening a KO.</p> <p><strong>Physical Walls: Physically defensive Pokemon such as Hippowdon, Quagsire, and Corviknight take very little damage from Bisharp's attacks and commonly carry moves such as Body Press or Earthquake that threaten it.</p> <p><strong>Psychic Surge: Psychic Surge removes Bisharp's ability to check faster Pokemon with Sucker Punch, so Pokemon such as Choice Scarf Tapu Lele can threaten it.</p> ",
    "sets": [
      {
        "name": "Swords Dance (Speed)",
        "description": "<p>A Speed donation from its god makes Bisharp a threatening sweeper and wallbreaker. Bisharp's high base Attack and Swords Dance let it threaten 2HKOs against a large portion of the metagame after a boost, including Landorus-T and Corviknight. Its Steel type helps it set up by giving switch-ins against Grass- and Psychic-type moves, which, combined with Defiant, gives it a niche over other common physical wallbreakers such as Kartana. Bisharp's dual STAB moves, Knock Off and Iron Head, hit most Pokemon for at least neutral damage. Sucker Punch gives it strong priority, allowing it to revenge kill weakened. foes. Black Glasses boosts most of Bisharp's attacks, and Life Orb's slight power upgrade isn't usually worth the recoil. However, Life Orb powers up Iron Head, notably guaranteeing a 2HKO against physically defensive Tangrowth. Defiant lets Bisharp benefit from opposing Intimidate users, including the ubiquitous Landorus-T, and also threaten opposing Defoggers and Sticky Webs teams. A Jolly nature and Attack investment are used to make the most of Bisharp's new Speed tier, but an Adamant nature can be used to increase its damage output, especially if receiving a less valuable Speed tier.</p> <p>Bisharp works best when paired with fast gods such as Mewtwo, Pheromosa, and Zamazenta. It appreciates slow pivots such as Slowbro and Corviknight to bring it in safely, as it can be worn down slowly over the course of a game. Although Bisharp is able to threaten Pokemon such as Skarmory and Corviknight, both of them can run Body Press, which OHKOes it. Thus, Bisharp appreciates Pokemon like Magnezone and Victini, which threaten Skarmory, Corviknight, and other checks to Bisharp such as Tapu Fini. Other fast offensive Pokemon such as Tapu Koko can force Bisharp out, so it pairs well with strong defensive Pokemon such as Ferrothorn and Landorus-T. These Pokemon can also provide entry hazards, which weaken Bisharp's checks and synergize with Defiant punishing Defoggers.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 484270, "username": "beauts"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}], "writtenBy": [{"user_id": 525446, "username": "Ducky"}]}
  },
  "Volcarona": {
    "comments": "<h1>Other Options</h1> <p>A more offensive Quiver Dance set with Fire Blast, Bug Buzz, and Giga Drain or Psychic is an option on more hyper offense teams. However it struggles to break Ho-Oh without significant support.</p> <h1>Checks and Counters</h1> <p><strong>Fire-type Pokemon: Ho-Oh and Heatran resist most of Volcarona's attacks and cripple it with Brave Bird or Toxic, respectively.</p> <p><strong>Dragon-type Pokemon: Giratina and Rayquaza take little damage from Volcarona and can phaze it with Dragon Tail or threaten an OHKO with Dragon Ascent, respectively.</p> <p><strong>Item Removal: Heavy-Duty Boots are required on Volcarona to avoid taking 50% from Stealth Rock. Knock Off users such as Rillaboom, Ferrothorn, and Kartana threaten to remove its item when Volcarona switches in. Clefable and Tapu Fini can also threaten to remove its item with Trick.</p> <p><strong>Status: Paralysis greatly limits Volcarona's ability to sweep. Toxic also prevents Volcarona from sweeping and makes it difficult to muscle through foes such as Giratina that it would otherwise threaten.</p> ",
    "sets": [
      {
        "name": "Bulky Quiver Dance (Defense)",
        "description": "<p>Volcarona's good defensive typing and Quiver Dance make it a threatening late-game sweeper. Its significant bulk with a Defense donation lets it find many opportunities to set up against passive Pokemon such as RegenVest Reuniclus and Slowbro, as well as offensive Pokemon such as Buzzwole and Zamazenta-C. Flamethrower is a consistent STAB move that lets it deal with common Steel- and Grass-types, notably Tangrowth and Skarmory, as Fire Blast's low PP and accuracy is not worth the extra power. Giga Drain is the preferred coverage to heavily damage Water-types, especially Gastrodon, which can use Clear Smog to erase all Quiver Dance boosts. Toxic hits common switch-ins such as Ho-Oh, wearing them down more easily over the course of a game. Roost lets Volcarona consistently act as a defensive wall and has great synergy with Flame Body, as it can fish for burns against the likes of Zeraora and Corviknight. Heavy-Duty Boots prevents entry hazards, especially Stealth Rock, from limiting its attempts to switch in. The given EV spread alongside a Timid nature helps Volcarona outrun Tapu Fini, as well as Pheromosa and its Speed receivers at +1.</p> <p>Volcarona is usually seen on balance and bulky offense builds as a late-game wincon. Gods with a high Defense stat like Necrozma-DM and Zamazenta-C greatly bolster Volcarona's defensive capabilities. However, even a lower donation from Rayquaza and Kyurem-W is appreciated. Water-types, notably Gastrodon and Rotom-W, appreciate Volcarona's ability to check Grass-types like Rillaboom and Kartana. While Volcarona has to watch out for Knock Off from both, it can potentially burn them, making them much easier to deal with. In return, they take care of opposing Fire-types, namely Ho-Oh, Heatran, and Victini. Rotom-W synergizes especially well with Volcarona, as it also provides Defog, which comes in handy if Volcarona has to take Knock Off, and deals with Rayquaza and Urshifu-R, which beat Volcarona prior to boosting. Teammates that can break Ho-Oh and Heatran are a must, as the aforementioned Water-types can't heavily damage them, which makes Zeraora and Zygarde-10% great partners.</p> "
      },
      {"name": "Offensive Quiver Dance (Defense, Special Attack)"}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 484270, "username": "beauts"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}, {"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 500884, "username": "longhiep341"}]}
  },
  "Tornadus-Therian": {
    "comments": "<h1>Other Options</h1> <p>Sludge Bomb or Toxic can be an option to further cripple its switch-ins like Gastrodon, and Sludge Bomb also heavily damages Tapu Koko. Grass Knot surprises Gastrodon and Groudon but is otherwise not very useful. A defensive set with either Rocky Helmet or Assault Vest is possible, however it's usually not worth it due to Tornadus-T's weakness to Stealth Rock. A physical set with Acrobatics and no item can surprise special walls, however its weakness to Rock is noticeable and requires a very specific team to work.</p> <h1>Checks and Counters</h1> <p><strong>Electric-type Pokemon: Zeraora and Tapu Koko are faster and can easily OHKO Tornadus-T. However, Zeraora doesn't want to switch in directly. Tapu Koko still fears the rare Sludge Bomb, but otherwise can restore its HP lost with Roost.</p> <p><strong>Faster Offensive Threats: While having decent bulk, many faster offensive Pokemon can still scare Tornadus-T out with their attacks such as Pheromosa, Mewtwo, and their Speed receivers, as well as Choice Scarf users like Kyurem-W. However, most of them can't switch in directly.</p> <p><strong>Specially Bulky Pokemon: Specially bulky Pokemon like Slowking and Gastrodon can deal with Tornadus-T well, and they can also deal with Nasty Plot with Dragon Tail and Clear Smog, respectively.</p> <p><strong>Knock Off: Once Tornadus-T loses its item, it becomes vulnerable to Stealth Rock and can struggle to check what it needs to repeatedly. Examples include Rillaboom, Tangrowth, and Landorus-T.</p> ",
    "sets": [
      {
        "name": "Defog (HP, Defense, Special Defense)",
        "description": "<p>Defog Tornadus-T is a great support Pokemon that provides consistent entry hazard removal and pivoting and also boasts a great Speed tier that outpaces Zygarde-10% and Alolan Persian. Hurricane hits Pokemon like Amoonguss and Landorus-T decently hard thanks to its high Base Power. Alternatively, Heat Wave ensures Tornadus-T can keep entry hazards off the field against Ferrothorn and Skarmory by forcing them out. Defog supports its teammates by preventing chip damage, and Tornadus-T can usually remove entry hazards multiple times thanks to Regenerator. U-turn helps it gain momentum on forced switches while also dealing chip damage. Knock Off deters switch-ins that rely on their items like Ho-Oh and and also helps deal with stall teams more effectively by forcing progress. Heavy-Duty Boots is required to negate Stealth Rock damage and let Tornadus-T switch in more comfortably. Timid is the preferred nature, as U-turn and Knock Off are mainly used for their utility.</p> <p>Defog Tornadus-T is a great option on almost all team archetypes, with the exception of hyper offense. It enjoys receiving HP or Defense, but can credibly do its job in any slot if needed. While matching up well against bulkier teams, Tornadus-T can be overwhelmed by strong offensive threats like Kyogre, Victini, and Tapu Koko, so running multiple bulky Pokemon is recommended. Landorus-T can form an entry hazard control core with Tornadus-T thanks to Stealth Rock and also deals with Electric-type Pokemon, namely Zeraora and Tapu Koko. Entry hazard setters like Ferrothorn and Heatran also synergize well with it. Ice-types such as Weavile and Kyurem-B threaten Tornadus-T, which can be taken care of by teammates like Zamazenta-C and Clefable. RegenVest users like Tangrowth and Slowking can take on special attackers like Kyogre and Dialga. Rotom-W checks a plethora of physical attackers such as Rayquaza, Victini, and Necrozma-DM; however, they are often both competing for the HP slot. Offensive Pokemon like Victini and Kyogre can take advantage of common defensive Pokemon that like to switch into Tornadus-T, such as Corviknight and Zamazenta-C. Those that tend to pivot or switch out multiple times throughout a game such as Victini and Tapu Koko also like having Stealth Rock removed in case they don't have Heavy-Duty Boots. A teammate that can take Knock Off is preferred. Zamazenta-C takes very little from Knock Off, and Clefable can also increase Tornadus-T's longevity with cleric support.</p> "
      },
      {
        "name": "Nasty Plot (Special Attack)",
        "description": "<p>With a Special Attack donation, Tornadus-T becomes a great special setup sweeper thanks to its coverage and Speed. It is also greatly helped out by Regenerator, which allows it to set up and attack multiple times and wear down its checks. Heavy-Duty Boots extends its longevity even further by negating its Stealth Rock weakness. Hurricane is its main STAB option, threatening slower offensive threats such as Rillaboom and Zygarde-10%. Nasty Plot further boosts its offensive capabilities and helps it break bulky special walls such as Reuniclus and Slowking. Focus Blast nails Steel- and Rock-types that can easily take Hurricane like Heatran, Ferrothorn, Excadrill, and Tyranitar. Heat Wave gives it a more reliable attack that still deals with most Steel-type Pokemon, notably Necrozma-DM, but misses out on Heatran and Tyranitar. Knock Off helps Tornadus-T remove key items from foes, especially Assault Vest and Heavy-Duty Boots, to wear down its checks and counters like Clear Smog Gastrodon and Ho-Oh, which can also help other teammates break them. U-turn instead keeps offensive momentum and is better against walls without Regenerator like Rotom-W and Heatran when combined with entry hazards. Taunt is another alternative that shuts down status and recovery moves from the likes of Gastrodon and Giratina. If Kyogre is a partner, Weather Ball is also viable to hit Heatran and Excadrill better.</p> <p>Bulky offense and balance teams appreciate Tornadus-T's ability to make progress and allow Tornadus-T to utilize Regenerator as much as possible. Gods with a high Special Attack like Kyurem-W and Dialga are a natural fit to bolster its Special Attack. Kyogre notably synergizes well with Tornadus-T thanks to Drizzle boosting Hurricane's accuracy. In turn, Kyogre enjoys its checks like Gastrodon, Ferrothorn, and Tangrowth getting worn down. Fast Electric-type Pokemon such as Tapu Koko and Zeraora outspeed and threaten to OHKO Tornadus-T, so answers to these like Tangrowth and Landorus-T are necessary. Ferrothorn notably also provides a switch-in against Weavile and Choice Scarf Kyurem-W. It can also check Tyranitar should Tornadus-T not run Focus Blast and complement its ability to pivot with either Stealth Rock or Spikes. Other partners with entry hazards like Heatran and Clefable also make for good teammates. Offensive Pokemon, especially those that can form a pivot core with Tornadus-T like Tapu Koko and Victini, keep the offensive pressure that Tornadus-T can provide. A Knock Off sponge should also be considered as Tornadus-T hates having its Heavy-Duty Boots removed, so Zamazenta-C and Clefable make good teammates.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 525446, "username": "Ducky"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 500884, "username": "longhiep341"}]}
  },
  "Landorus-Therian": {
    "comments": "<h1>Other Options</h1> <p>If donating HP or Defense to Landorus-T, a specially defensive EV spread lets it better check Pokemon such as Tapu Koko, but this is usually less consistent than the listed spread. Landorus-T can also invest in both of its defensive stats, making it a better mixed wall. Defensive sets can run 144 Speed EVs can be used to outspeed base 77 Pokemon such as Heatran and Necrozma-DM. Offensive sets can also run Choice Scarf, outspeeding common Pokemon such as Tapu Koko, Zeraora, and Zygarde-10%.</p> <h1>Checks and Counters</h1> <p><strong>Corviknight and Skarmory: Both Corviknight and Skarmory are immune to Landorus-T's STAB Earthquake and Toxic, do not fear its unboosted Stone Edge, and can clear Stealth Rock with Defog, allowing them to safely pivot out to a teammate that threatens Landorus-T. However, both may struggle versus Swords Dance sets without Iron Defense, or Whirlwind in Skarmory's case, and fear sets with Smack Down.</p> <p><strong>Ice-type Pokemon and Coverage</strong>: Ice-type Pokemon such as Weavile and Kyurem-W and coverage moves, such as Ice Beam from Nidoking and Tyranitar, heavily threaten Landorus-T. However, these Pokemon struggle to switch into Landorus-T directly.</p> <p><strong>Chip Damage: Chip damage from entry hazards and status is very annoying for Landorus-T, as it lacks reliable recovery and can be chipped down over the course of a game.</p> <p><strong>Strong Wallbreakers</strong>: Since Landorus-T lacks a reliable source of recovery, strong attackers like RIllaboom and Zygarde-10% can slowly beat it, as it can only switch into them a limited number of times.</p> ",
    "sets": [
      {
        "name": "Defensive (HP, Defense, Special Defense)",
        "description": "<p>Landorus-T is one of the best Pokemon in the metagame thanks to its great movepool, amazing ability, and good defensive stats. It's an amazing defensive pivot that can check various physical attackers such as Garchomp, Zeraora, and Excadrill, as well as reliably setting Stealth Rock. Earthquake makes Landorus-T less passive, as even when uninvested, its STAB-boosted Earthquake deals heavy damage to Ground-weak Pokemon such as Heatran and Tapu Koko. Knock Off weakens any Pokemon that switches in, making Landorus-T much more annoying to switch into, while Toxic is an alternative that cripples Pokemon like Tangrowth, Rotom-W, and opposing Landorus-T. U-turn allows it to safely pivot out of bad matchups, such as Corviknight, while also generating momentum for the team. Landorus-T finds ample opportunities to set Stealth Rock thanks to its ability to force switches; however, it can opt for Defog instead if its team needs an entry hazard remover. Leftovers is Landorus-T's only form of recovery, so it needs to be careful of Knock Off from Pokemon like Zeraora and other Landorus-T. 8 Speed EVs allow Landorus to outspeed Victini after a Speed drop, in addition to Modest and Bold Magnezone.</p> <p>Defensive Landorus-T fits best on bulky offense or balance teams, as it is a great check to many offensive threats in the short term, but it can often be worn down throughout longer games, making it a worse fit for stall teams. It enjoys any defensive stat boost, letting it fit with many gods such as Yveltal and Zamazenta-C. Zamazenta-C notably resists Ice to compensate for Landorus-T's 4x weakness. Landorus-T also pairs well with strong wallbreakers like Tapu Koko and Dhelmise, as they appreciate it pivoting them in safely and setting Stealth Rock to help them wear down their checks. Landorus-T can also check many fast offensive threats such as Zeraora and Zygarde-10%, which are problematic for slow wallbreakers, in particular Nidoking. Landorus-T is threatened by Water-types such as Urshifu-R and Rotom-W, so Grass-types such as Ferrothorn and Tangrowth make good partners. Landorus-T is susceptible to entry hazards wearing it down over longer games, so good Defoggers such as Rotom-W, Tornadus-T, and Corviknight are good teammates. Magnezone traps and removes Corviknight and Skarmory, two Pokemon that are impervious to Landorus-T's moves and can easily clear its Stealth Rock with Defog.</p> "
      },
      {
        "name": "Offensive (Speed)",
        "description": "<p>Landorus-T's high base 145 Attack and STAB Earthquake make it a powerful wallbreaker and threatening sweeper, especially with a Speed donation. Earthquake is Landorus-T's main attack, hitting many common Pokemon such as Tapu Koko, Nidoking, and Heatran for super effective damage, as well as hitting others such as Clefable and Ferrothorn for neutral damage. Stone Edge is used to hit Flying-types such as Corviknight and opposing Landorus-T for neutral damage, while Smack Down trades initial power for the ability to hit them with Earthquake next turn. Swords Dance boosts Landorus-T's already high Attack even further, letting it break through even sturdy defensive stalwarts, notably Ferrothorn and Magic Guard Clefable. Knock Off cripples its switch-ins and nails Psychic- and Ghost-type Pokemon, including Slowbro and Giratina, while Rock Polish boosts Landorus-T's donated Speed even higher, allowing it to more easily sweep. Life Orb is standard, but Soft Sand can be used to boost Earthquake's power to similar levels without the recoil. Leftovers is another option, trading damage output for easier setup and longevity.</p> <p>Offensive Landorus-T fits best on bulky or hyper offense teams, as it lacks the longevity needed for longer games and often only gets one chance to set up. Gods with high Speed stats such as Pheromosa, Zamazenta-C, and Mewtwo let Landorus-T outspeed or Speed tie many common Pokemon, such as Rayquaza, Kartana, and Tapu Koko. Defensive pivots such as Corviknight and Rotom-W can place it into favorable matchups safely. Ferrothorn and Heatran set entry hazards for Landorus-T while helping it beat Pokemon like Choice Scarf Kyogre and Weavile. Since Landorus-T has trouble breaking through Skarmory and Corviknight, Electric-type Pokemon like Tapu Koko and Zeraora are great partners, as they are able to both threaten them and pivot Landorus-T in with U-turn or Volt Switch. Magnezone is an especially great partner, as it can trap and OHKO Corviknight and Skarmory outright.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 500884, "username": "longhiep341"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}], "writtenBy": [{"user_id": 525446, "username": "Ducky"}]}
  },
  "Kyurem-White": {
    "comments": "<h1>Other Options</h1> <p>Stone Edge is an option to nail Ho-Oh, and Substitute can be used to ease predictions, but it is usually not worth sacrificing coverage for.</p> <h1>Checks and Counters</h1> <p><strong>Revenge Killers: Pokemon like Kartana, Bisharp, Tapu Koko, Zamazenta-C, and Tapu Lele are all capable of outspeeding and revenge killing non-Choice Scarf Kyurem-W, and some can revenge kill even that set.</p> <p><strong>Specially Bulky Water-types: When Kyurem-W is not carrying Freeze-Dry, specially defensive Water-types like Special Defense-receiving Gastrodon and HP-receiving Tapu Fini and Rotom-W can check it.</p> <p><strong>Ho-Oh: Ho-Oh is a special wall that is not hit super effectively by any of Kyurem-W's primary attacks and also donates an incredible Special Defense stat to a team member.</p> ",
    "sets": [
      {
        "name": "Choice Item Attacker",
        "description": "<p>Kyurem-W's power and type coverage make it difficult to switch into reliably. It offers very good stats for an offensive team, including a huge Special Attack and strong HP and Attack, as well as a usable Speed stat. Choice Specs makes Kyurem-W a truly fearsome wallbreaker, while a Choice Scarf allows it to act as a revenge killer. Draco Meteor deals significant damage to anything that does not resist it. Ice Beam hits bulky Grass- and Ground-types like Tangrowth and Landorus-T for heavy damage or an OHKO, and it's Kyurem-W's most consistent STAB attack, while Earth Power nails Heatran and Necrozma-DM. Freeze-Dry is a very useful tool, hitting Water-types like Rotom-W and Gastrodon that would otherwise annoy Kyurem-W. Fusion Flare covers Steel-types like Ferrothorn and Corviknight, as well as being slightly stronger against Necrozma-DM.</p> <p>Kyurem-W often fits best on offensive teams, where receivers like Nidoking and Tapu Koko can take advantage of its monstrous Special Attack stat and physical attackers like Mimikyu and Victini can receive its respectable Attack stat. Kyurem-W's high HP stat supports defensive pivots like Rotom-W and Landorus-T, which can help deliver it onto the field safely while removing Stealth Rock for it. It is also threatened by Fairy- and Fighting-types, so their switch-ins like Heatran, Ferrothorn, and Clefable make great partners for it, and their offensive checks like Kartana and Tapu Lele do as well. Since Kyurem-W is often Choice locked, it is relatively easy to force out. Due to this weakness, reliable defensive switch-ins such as Skarmory and Tangrowth make good teammates.</p> "
      },
      {
        "name": "Special Attacker",
        "description": "<p>Kyurem-W is a strong wallbreaker with great coverage that's difficult to switch into. It offers very strong stats to donate on offensive teams, donating monstrous Special Attack, strong HP and Attack, and respectable Speed. Heavy-Duty Boots especially helps with Kyurem-W's Stealth Rock weakness, while Life Orb gives it a damage increase without limiting its coverage flexibility with Choice Specs. Ice Beam is the primary attack, dealing good damage to neutral targets and heavily damaging Flying- and Grass-types like Yveltal, Rillaboom, and Tangrowth. Freeze-Dry is another option that allows for super effective damage on targets like Gastrodon and Rotom-W. Draco Meteor is its most powerful attack, heavily damaging Pokemon that resist its other attacks, such as Rotom-W. Roost enables Kyurem-W to have some longevity and break through its switch-ins over the course of longer games. Fusion Flare lets it get through Steel-types like Ferrothorn and Corviknight. The combination of Ice- and Fire-type coverage allows Kyurem-W to hit the majority of the tier for at least neutral damage.</p> <p>Kyurem-W fits best on offensive teams, where its teammates can take advantage of its great donated stats. Special attackers like Nidoking and Tapu Lele and physical attackers such as Victini and Zygarde-10% all benefit from its excellent attacking stats. Its strong HP stat benefits defensive Pokemon like Rotom-W and Ferrothorn, which offer pivot and entry hazard support, respectively. Kyurem-W is offensively threatened by Steel- and Fairy-types like Bisharp, Kartana, and Tapu Lele, so Pokemon like Heatran and Ferrothorn make good defensive partners. Kyurem-W appreciates strong entry hazard control from partners like Corviknight and Rotom-W if forgoing Heavy-Duty Boots. Additionally, Kyurem-W is relatively slow and easy to revenge kill with faster threats, so bulky teammates and fast revenge killers like Skarmory and Tapu Koko, respectively, make great partners.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 525446, "username": "Ducky"}, {"user_id": 523866, "username": "UT"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}], "writtenBy": [{"user_id": 539897, "username": "iapt"}]}
  },
  "Pangoro": {
    "comments": "<h1>Other Options</h1> <p>A Choice Band set with Scrappy, Close Combat, Knock Off, Gunk Shot, and Bullet Punch or Drain Punch can be effective, although Pangoro likes being able to switch moves. Iron Head can be used over Gunk Shot for its perfect accuracy and ability to OHKO Diancie, but it is significantly weaker.</p> <h1>Checks and Counters</h1> <p><strong>Choice Scarf Users: Due to Pangoro's middling defenses, it can be easily revenge killed by common Choice Scarf users such as Kartana and Blacephalon after a little chip damage.</p> <p><strong>Priority Moves: Due to Life Orb chip and the Defense drop from Close Combat, Choice Band Rillaboom and Rayquaza can threaten Pangoro out easily at -1 with their priority moves. Triage Comfey also threatens to revenge Pangoro whenever it switches in.</p> <p><strong>High-Defense Receivers: High Defense and HP receivers such as Skarmory and Corviknight can tank any of Pangoro's attacks and threaten an OHKO back with Body Press or Brave Bird. Clefable receiving Shuckle Defense can comfortably tank a Gunk Shot and OHKO with Moonblast.</p> ",
    "sets": [
      {
        "name": "Swords Dance (Speed)",
        "description": "<p>Pangoro is one of the most threatening sweepers in Godly Gift thanks to its fantastic STAB combination, Swords Dance, Mold Breaker, and Gunk Shot. Mold Breaker sets it apart from other Fighting-types in Godly Gift, as it allows Pangoro to bypass common Unaware walls such as Clefable and Quagsire receiving Defense. Knock Off and Close Combat are the STAB moves of choice, dealing significant damage to common physical walls such as Skarmory, Landorus-T, and Rotom-W. Gunk Shot hits Fairy-types that resist Pangoro's STAB combination such as Clefable, Tapu Fini, and Tapu Koko and OHKOes them at +2. Life Orb is the preferred item, however, items such as Black Belt and Black Glasses can be used if recoil damage is a concern.</p> <p>Pangoro pairs best with fast, offensive gods to maximize its effectiveness as a wallbreaker and sweeper. These include Zamazenta-C, Mewtwo, and Pheromosa. Pheromosa is a notable partner, as it is the fastest god in the tier, meaning Pangoro outspeeds all relevant non-Choice Scarf Pokemon bar Regieleki. Due to Pangoro's susceptibility to strong priority from Rayquaza, Zygarde-10%, and Weavile, Tapu Lele pairs well with it due to Psychic Surge. Tapu Lele can also bypass common Pangoro checks such as Clefable and Skarmory with its strong special attacks. Pangoro fits exceptionally well on hyper offense teams thanks to its amazing coverage and ability to break Unaware walls; it appreciates dedicated dual screens leads like Tapu Koko to help it set up Swords Dance. It also appreciates strong entry hazard support to maximize its wallbreaking effectiveness, so dedicated entry hazard leads like Landorus-T, Cloyster, and Klefki make good partners. Pangoro is weak to being revenge killed by Choice Scarf users such as Blacephalon and Kartana, so defensive Landorus-T and Rotom-Wash pair well in that role on less offensive teams. Pangoro is good at wearing down common Unaware and physically defensive walls that normally stop hyper offense teams, so pairing it with other sweepers such as Scolipede, Kartana, and Shell Smash Cloyster maximizes its effectiveness.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 517892, "username": "pannuracotta"}, {"user_id": 523866, "username": "UT"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 484270, "username": "beauts"}]}
  },
  "Yveltal": {
    "comments": "<p>Other Options</p> <p>=============</p> <p>Life Orb sets can opt to be physical with Knock Off, Sucker Punch, Roost and Taunt, however the lack of a better Flying-type move than Dual Wingbeat makes these sets unreliable against teams with solid Dark-type switch-ins. Life Orb sets can run Focus Blast to hit Tyranitar super effectively and chunk it down to allow teammates like Tapu Lele and Galarian Moltres to clean up after it, however, the opportunity cost of dropping either Sucker Punch or Heat Wave is usually too great. Physically defensive variants with moves like Foul Play, Roost, Defog, U-turn and Knock Off can be used to take advantage of Yveltal's good bulk.</p> <h1>Checks and Counters</h1> <p><strong>Bulky Fairy- and Dark-types: Pokemon that resist Dark-type moves and can survive its Flying-type moves as well such as Tapu Koko, Tyranitar, and Clefable are incredibly annoying for Yveltal to break through</p> <p><strong>Chip Damage: Since Yveltal is often running Life Orb or Choice Scarf, it is vulnerable to being worn down by recoil and Stealth Rock. Additionally, Yveltal likes to use its bulk to trade hits with foes, which is jeopardized if it takes too much damage.</p> <p><strong>Offensive Pressure</strong>: Speed receivers such as Volcanion and Tapu Lele, along with naturally fast threats such as Weavile, Pheromosa, and Tapu Koko, are able to threaten Yveltal out.</p> ",
    "sets": [
      {
        "name": "Special Attacker",
        "description": "<p>Offensive Yveltal is one of the strongest attackers in Godly Gift, and it's one of the premier gods for offensive and balance teams thanks to its ability to donate incredible HP and mixed attacking stats. The combination of Dark Pulse and Oblivion Wing hits a plethora of metagame staples for super effective damage, such as Necrozma-DM, Calyrex-I, Tangrowth, and Volcarona. Yveltal hits an overwhelming majority of the tier for at least neutral damage, chunking common walls like Rotom-W, Heatran, and Corviknight. Dark Pulse is one of the strongest Dark-type moves in the tier thanks to Dark Aura, and Oblivion Wing also provides much-welcome recovery to offset Life Orb recoil. Taunt lets Yvetal easily make progress against more defensive teams, shutting down Pokemon that rely on their status moves like Pyukumuku and Giratina, as well as denying the likes of Gastrodon, Vaporeon, and Corviknight recovery so that it can comfortably beat them. Roost can be used to provide reliable recovery. Heat Wave enables Yveltal to beat common Steel-types which can withstand its STAB moves, like Ferrothorn, Klefki, and Bisharp, and is its best option against Tapu Koko. Sucker Punch can also be used to give Yveltal the ability to revenge kill faster threats, like Dracozolt, Venusaur under weather, and Kartana. Sucker Punch should be run with a Mild nature. Yveltal can also run a Timid nature, as it outspeeds a plethora of common gods and their receivers, notably Rayquaza, Volcanion, and Landorus-T.</p> <p>Yveltal is best paired with Pokemon that take advantage of its high HP and offensive stats. Pokemon with low HP such as Rotom-W, Landorus-T, and Tornadus-T make great candidates for the HP slot. These defensive Pokemon have great synergy alongside Yveltal, as they're able to pivot it onto the field safely and provide much needed entry hazard removal, something Yveltal appreciates due to its Stealth Rock weakness. Yveltal pairs well with fast offensive receivers like Tapu Koko and Zeraora, as well as Attack receivers with powerful STAB moves like Zygarde-10% and Victini. Electric-types such as Zeraora and Magnezone can threaten Yveltal, so running checks such as Landorus-T, Tangrowth, and Ferrothorn make for a reliable defensive backbone. Similarly, Fairy-types like Tapu Koko and Clefable also pose an issue for Yveltal, so running Steel- and Poison-types to deal with them like Heatran, Kartana, and Nihilego helps against them. Yveltal appreciates Defog support from teammates like Rotom-W and Landorus-T to offset its weakness to Stealth Rock.</p> "
      },
      {
        "name": "Choice Scarf",
        "description": "<p>Choice Scarf Yveltal is an excellent revenge killer, outspeeding and checking faster Pokemon such as Victini, Zeraora, and Kartana, while also outspeeding the faster gods and their receivers like Pheromosa, Mewtwo, and Zamazenta-C. Furthermore, thanks to Foul Play, it's a check to most physical setup sweepers like Zekrom, Rayquaza, and Bisharp. Oblivion Wing threatens common Fighting- and Grass-types while also providing Yveltal with passive recovery. U-turn lets Yveltal wear down switch-ins such as Tapu Koko, Tyranitar, and Ferrothorn, as well as safely pivot in its teammates, notably hard to switch in wallbreakers like Zygarde-10%, Tapu Lele, and Volcanion. Defog can also be run as emergency entry hazard control for teammates like Tapu Lele, Mimikyu, and Blacephalon. Meanwhile, Toxic can be used to wear down the likes of Rotom-W, Tapu Koko, and Tyranitar that would otherwise check Yveltal, as well as put Pokemon like Galarian Moltres, Terrakion, and Groudon on a timer. Lastly, Knock Off should be considered, as it provides strong utility in removing items from bothersome walls such as Ho-Oh, Heatran, and Tapu Fini.</p> <p>Choice Scarf Yveltal is mostly an utility-based set on balance and bulky offense teams. It excels at supporting its teammates by donating its strong attacking stats to the likes of Zeraora, Tapu Koko, and Zygarde-10% and also being able to pivot them onto the field safely thanks to U-turn. Yveltal can also switch into Grass-, Ground-, and Psychic-type attacks from foes like Rillaboom, Landorus-T, and Mewtwo to cover for its teammates. Defog support from the likes of Rotom-W and Landorus-T help with Yveltal's weakness to Stealth Rock, as taking chip whenever it pivots in is very unideal. Checks to special attackers such as Heatran, Assault Vest Tangrowth, and Gastrodon help deal with damage from the special side so that Yveltal can focus on physical attackers.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 484270, "username": "beauts"}, {"user_id": 523866, "username": "UT"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 517892, "username": "pannuracotta"}]}
  },
  "Zygarde-10%": {
    "comments": "<h1>Other Options</h1> <p>Zygarde-10% can run a Coil or Dragon Dance set that, once set up, is a powerful sweeper, but lacks immediate power.</p> <h1>Checks and Counters</h1> <p><strong>Fast Revenge Killers</strong>: Weavile, Mewtwo, Tapu Koko, and other faster offensive Pokemon can threaten out Zygarde-10% easily.</p> <p><strong>Bulky Bug and Grass Pokemon: Pokemon like Buzzwole, physically defensive Tangrowth, and even Dhelmise can take at least one Thousand Arrows from Zygarde-10% and threaten to OHKO back.</p> ",
    "sets": [
      {
        "name": "Choice Band (Attack)",
        "description": "<p>Zygarde-10% is a strong wallbreaker that takes advantage of its naturally high Speed tier and the completely fair and balanced move that is Thousand Arrows. Thousand Arrows is Zygarde-10%'s primary attack, and with no immunities and few common resistances, it can safely fire off Choice Band-boosted attacks with little need for prediction. Toxic can chip down switch-ins to Zygarde-10%, like physically defensive Tangrowth and Buzzwole, while Glare is another option to potentially gain free turns while also helping out slower teammates. Extreme Speed is used to pick off weakened, faster targets like Zeraora, Weavile, and Speed receivers faster than Zygarde-10%. Outrage is Zygarde-10%'s single strongest move and useful for overpowering Giratina and Tangrowth but leaves it exceedingly vulnerable to being revenge killed.</p> <p>A god with a high Attack stat, like Kyurem-B, Rayquaza, or Necrozma-DM, is a necessity to pair with Zygarde-10%. Its ability to eliminate Electric- and Steel-type foes like Rotom-W and Heatran is a great asset on offense and bulky offense teams. Zygarde-10% cannot break through physically bulky Pokemon like Buzzwole or Ferrothorn on its own and appreciates having powerful special attackers like Tapu Koko and Volcanion that are capable of eliminating these checks. It is able to break through Skarmory and Corviknight, opening the way for teammates like Urshifu-R , Necrozma-DM, and Kartana. Pokemon like Kartana and Zeraora are able to take advantage of the holes Zygarde-10% opens up to finish off weakened teams. Due to Zygarde-10%'s poor bulk, it benefits from the presence of bulky walls like Rotom-W and Ferrothorn, which can provide entry hazard removal and offensive hazard support. Rotom-W, Slowking, and Landorus-T can act as pivots for it, allowing for safe entry onto the field.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 525446, "username": "Ducky"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 539897, "username": "iapt"}]}
  },
  "Volcanion": {
    "comments": "<h1>Other Options</h1> <p>Sludge Wave hits slightly harder than Sludge Bomb and allows Volcanion to beat Kommo-O, but Sludge Bomb's high poison chance is preferred. Solar Beam coupled with Power Herb surprises Gastrodon and Seismitoad and can OHKO after some chip damage. Choice Specs is an option to increase Volcanion's damage output, however this is not preferred due to it being unable to deal with common bulky Water- and Dragon-types such as Gastrodon and Giratina.</p> <h1>Checks and Counters</h1> <p><strong>Water-type Pokemon: Bulky Water-types, namely Slowbro and Gastrodon, don't fear much from Volcanion barring a poison and can simply recover lost HP.</p> <p><strong>Dragon-type Pokemon: By virtue of resisting both STAB moves from Volcanion, Dragon-types can hit back hard or PP stall it out. Zekrom and Rayquaza fear a burn, but Volcanion can't beat them one-on-one, while Giratina can deplete Volcanion's low PP pool quickly with Pressure.</p> <p><strong>Item Removal: Volcanion depends on Heavy-Duty Boots as it's vulnerable to all entry hazards, so Trick and Knock Off from Galarian Slowking, Weavile, and Tangrowth limit its switch in opportunities.</p> <p><strong>Faster Pokemon: If Volcanion receives Speed from slow gods like Dialga and Rayquaza, then faster Pokemon like Tapu Koko, Zeraora and Zygarde-10% can revenge kill it.</p> ",
    "sets": [
      {
        "name": "Offensive (Speed)",
        "description": "<p>Offensive Volcanion is a powerful and versatile attacker that has the tools to provide team support or circumvent its normal checks. Steam Eruption is a strong Water STAB attack that also has a high burn chance, which discourages foes that may try to take a hit and retaliate such as Rayquaza. Fire Blast hits Steel-type entry hazard setters like Skarmory and Necrozma-DM hard, as well as common Grass-types, namely Tangrowth and Rillaboom. Defog takes advantage of forced switches to clear entry hazards, and only a select few entry hazard setters, namely Seismitoad, can safely force Volcanion out. Earth Power hits Dialga, Heatran, and opposing Volcanion harder and can be used if there's another teammate with entry hazard removal. Sludge Bomb 2HKOes physically defensive Clefable and Tapu Fini, as well as potentially cripples switch-ins, in particular Gastrodon. Toxic is an alternative that pressures Gastrodon more but loses out on Clefable. Heavy-Duty Boots is the preferred item to help Volcanion switch in consistently, especially if it is the team's entry hazard remover. Choice Scarf allows it to pick off weakened threats, and its bulk allows it to take priority attacks such as Rayquaza's Extreme Speed and Yveltal's Sucker Punch. Timid is the preferred nature, especially on Choice Scarf variants, however Modest is an option on Heavy-Duty Boots set to make Volcanion hit harder.</p> <p>Bulky offense builds benefit from Volcanion's defensive utility, its ability to remove entry hazards reliably. Gods with a high Speed stat like Zamazenta-C and Mewtwo allow Volcanion to force more Pokemon like Tapu Koko out. Offensive wallbreakers that like to switch in multiple times enjoy Volcanion's Defog. For example, Zygarde-10%, Rayquaza, and Victini are often forced out by faster revenge killers after getting a KO, especially the latter two when they get stat drops from using their powerful attacks. Physical threats such as Buzzwole and Kartana struggle against Skarmory and Ho-Oh, which Volcanion can deal with. For Beat Up teams, Volcanion can provide a special attacker without heavily reducing Beat Up's power. If Volcanion is paired with a slow god like Rayquaza, it's forced out by faster Pokemon, of which Zeraora and Zygarde-10% stand out. Tangrowth comfortably stomachs any hit from them and can cripple them with Stun Spore to help Volcanion. It can also deal with bulky Water-types that Volcanion can't do much to, such as Gastrodon and Slowbro. Other Ground- and Electric-type checks like Landorus-T and Rotom-W also make for great partners.</p> "
      },
      {
        "name": "SubToxic (Speed)",
        "description": "<p>SubToxic Volcanion takes advantage of its common answers that rely on Toxic to beat it, especially Gastrodon and Vaporeon. Steam Eruption heavily damages common Pokemon such as Landorus-T and Heatran, and its high burn chance deters offensive switch-ins such as Rayquaza. Flamethrower targets Grass- and Steel-types such as Ferrothorn and Skarmory and is preferred over Fire Blast thanks to the much higher PP and perfect accuracy. Substitute blocks status moves, in particular Toxic, from various passive walls such as Necrozma-DM, Gastrodon without a Ground-type attack, Heatran, and Vaporeon. Toxic cripples said Gastrodon and Vaporeon and wears them down, eventually forcing them out. Leftovers is the item of choice to maximize the number of times Volcanion can set Substitute, while Heavy-Duty Boots lets Volcanion switch in more freely throughout the game if its team lacks reliable entry hazard control. If Volcanion does not need full Speed investment, slower spreads with 220 HP allow Substitute to take two Clear Smog from Gastrodon or two Magma Storm from defensive Heatran.</p> <p>SubToxic Volcanion fits best on bulky offense teams that appreciate its ability to wear down Pokemon with shared checks. Tapu Koko and Zeraora like having opposing Gastrodon and Seismitoad weakened to clean up late game. Volcanion's vulnerability to all entry hazards means it needs teammates with strong hazard deterrence if it opts out of Heavy-Duty Boots. Landorus-T has Defog and can also check Ground- and Electric-types like Excadrill and Zeraora. On the other hand, Hatterene can block all entry hazards altogether with Magic Bounce. If run alongside a slow god such as Dialga, checks to faster offensive Pokemon like Rayquaza and Victini are required. Rotom-W can take their STAB attacks and pivot out to Volcanion on common switch-ins like Ferrothorn. Grass-types such as Ferrothorn and Tangrowth check the aforementioned Ground- and Electric-types and thus synergize well with Volcanion; Rillaboom is also a great teammate, as it provides Grassy Terrain support to help keep Volcanion healthy.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 484270, "username": "beauts"}, {"user_id": 523866, "username": "UT"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 500884, "username": "longhiep341"}]}
  },
  "Mimikyu": {"sets": [{"name": "Swords Dance (Atk, Spe)"}]},
  "Dhelmise": {
    "comments": "<h1>Other Options</h1> <p>Dhelmise can equip Life Orb or Heavy-Duty Boots to give it the freedom to switch moves, but the extra power of Choice Band, plus the ability to to cripple a foe with Switcheroo, is usually preferred. Dhelmise also has access to Rapid Spin and Synthesis to provide entry hazard control and longevity, respectively, but due to its poor bulk it can rarely use either move. Anchor Shot is an option over Swords Dance to hit Yveltal neutrally and Clefable super effectively and works well with Switcheroo to trap and and PP stall passive walls that cannot threaten it.</p> <h1>Checks and Counters</h1> <p><strong>Yveltal: Yveltal resists both of Dhelmise's STAB moves, has reliable recovery, and can OHKO back with ease. It does not appreciate being given a Choice Band but is otherwise a hard wall to Dhelmise.</p> <p><strong>Other Dark-types</strong>: Alolan Persian, Galarian Moltres, and Tyranitar can all stomach Poltergeist and KO back. However, they lack recovery and are more short-term answers.</p> <p><strong>Skarmory: Skarmory with an HP donation effortlessly tanks any of Dhelmise's attacks but must watch out for Switcheroo.</p> <p><strong>Bulky Defense and HP Receivers</strong>: Clefable and Ferrothorn can switch in and retaliate with Knock Off, but they must be wary of Switcheroo or being worn down, respectively.</p> <p><strong>Faster Receivers: Dhelmise has awful bulk and is easily OHKOed by a vast majority of other common fast receivers including Pangoro, Volcanion, and Mamoswine. If they receive a higher Speed donation than Dhelmise does, it can easily be revenge killed.</p> ",
    "sets": [
      {
        "name": "Choice Band (Speed)",
        "description": "<p>Boasting high-powered STAB moves and a natural base 131 Attack, Dhelmise is an excellent candidate for a Speed donation from one of the faster gods. Ghost has amazing neutral coverage in Godly Gift; there are no relevant Normal-types, and only a few common Dark-types, namely Yveltal, Alolan Persian, and Galarian Moltres. As a result, Choice Band Dhelmise can often fire off Poltergeist with little prediction. Power Whip is slightly stronger and can provide useful coverage for Rotom-W and Tapu Fini. Switcheroo is useful for crippling passive walls that avoid being 2HKOed like HP Skarmory and Defense Clefable; it also helps against the rare itemless Giratina, which otherwise walls Dhelmise. Swords Dance pairs well with Switcheroo, as it helps Dhelmise power through fatter teams after crippling something with its Choice Band.</p> <p>Dhelmise can work on a wide variety of teams as long as it receives a good Speed donation. Mewtwo, Zamazenta-C, and Pheromosa are excellent gods, as they all provide base 130+ Speed, letting Dhelmise get the jump on most of the unboosted metagame. While Dhelmise has excellent coverage, it struggles against common Dark-types, most notably Yveltal; reliable checks like Tapu Fini and Tapu Koko are strongly recommended as teammates. Additionally, Dhelmise can struggle to break through Skarmory, Clefable, and Buzzwole due to their titanic bulk, so powerful Attack receivers like Zygarde-10%, Victini, and Zeraora make fantastic partners, as they can beat or at least cripple all of them with status. It is critically important to remember that Dhelmise has terrible synergy with Knock Off, as it renders the foe immune to Poltergeist; be very careful to not pair Dhelmise with teammates that rely on Knock Off to make progress like Tangrowth and Landorus-T. Dhelmise is easily revenge killed by Choice Scarf users, so bulky teammates like Skarmory and Tangrowth are recommended. Since Dhelmise has no form of recovery and often likes to switch in multiple times, reliable entry hazard control like Corviknight or Rotom-W is recommended.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 525446, "username": "Ducky"}, {"user_id": 484270, "username": "beauts"}]}, {"name": "Grammar checked by", "members": [{"user_id": 241023, "username": "Kris"}]}], "writtenBy": [{"user_id": 523866, "username": "UT"}]}
  },
  "Tapu Koko": {
    "comments": "<h1>Other Options</h1> <p>Tapu Koko can also use Grass Knot on its offensive pivot set to hit Gastrodon for super effective damage, but sacrificing Roost or U-turn is often not worth it. Light Clay and dual screens makes Tapu Koko a strong hyper offense lead when receiving HP. An HP donation can also be used to check Galarian Moltres and Yveltal more easily and is common when another teammate like Alolan Raichu can take advantage of Special Attack better. Calm Mind is an option to turn Tapu Koko into a strong wincon.</p> <h1>Checks and Counters</h1> <p><strong>Specially Defensive Ground-types: Pokemon like Gastrodon, Seismitoad, Excadrill, and Landorus-T are immune to Tapu Koko's primary STAB attack and often can force it out; however, the former two struggle with Grass Knot, while Landorus-T is susceptible to getting worn down.</p> <p><strong>Grass-types: Grass-types like Assault Vest Tangrowth, Ferrothorn, and Amoonguss can switch into Tapu Koko's attacks and force it out.</p> <p><strong>Faster Revenge Killers: Due to Tapu Koko's frailty, it can be revenge killed by Choice Scarf users and Pokemon receiving Speed from Zamazenta-C and Pheromosa, like Volcanion and Dhelmise.</p> ",
    "sets": [
      {
        "name": "Offensive Pivot (Special Attack)",
        "description": "<p>Tapu Koko is a strong offensive pivot that can take advantage of its great Speed tier and a Special Attack donation to supercharge its offensive output. Heavy-Duty Boots allows it to come onto the field freely without fearing chip damage from entry hazards, improving its ability to pivot effectively. Terrain-boosted Thunderbolt is Tapu Koko's strongest attack against neutral targets and deals super effective damage versus Pokemon like Tapu Fini and Corviknight. Dazzling Gleam lets Tapu Koko effectively check common offensive threats such as Zygarde-10, Rayquaza, and Weavile while also wearing down switch-ins that resist or are immune to Thunderbolt like Landorus-T, Tangrowth, and Nidoking. U-turn preserves momentum against its checks, taking advantage of switches forced by Tapu Koko's powerful attacks while also chipping down checks like Gastrodon. Roost allows it to stay healthy throughout a game, giving it more opportunities to come onto the field and deal damage, and also lets it function as a soft check to offensive Dark- and Flying-types like Galarian Moltres, Yveltal, and Tornadus-T.</p> <p>Gods that can donate a high Special Attack, like Mewtwo, Yveltal, and Kyurem-W, make great teammates for Tapu Koko. It appreciates powerful wallbreakers, like Dhelmise and Victini, that can weaken teams and allow it to clean up in the late-game. Tapu Koko also helps bring them onto the field with its frequent pivoting. Tapu Koko can struggle to beat specially defensive Pokemon like Gastrodon, Assault Vest Tangrowth, and Ferrothorn, which offensive Pokemon like Kartana, Weavile, and Victini can help eliminate. Tapu Koko has mediocre bulk and enjoys having a sturdy defensive core to back it up. Its weakness to Ground- and Poison-type attacks make Landorus-T, Skarmory, and Corviknight excellent partners that can handle these attacks, in addition to providing entry hazard and pivot support. Pokemon faster than Tapu Koko like Choice Scarf Kyogre and Kartana, Pheromosa, and fast Speed receivers such as Pangoro are threats, and Pokemon like Skarmory and Ferrothorn can safely switch into them.</p> "
      },
      {
        "name": "Choice Specs (Special Attack)",
        "description": "<p>Choice Specs Tapu Koko is a formidable wallbreaker, thanks to its reliable STAB attacks and a Special Attack donation. Combined with Choice Specs, its attacks are very difficult to switch into, barring very specially bulky Pokemon like Tangrowth. Thunderbolt is Tapu Koko's strongest attack, dealing super effective damage to Slowbro and Corviknight, as well as offering strong neutral coverage against defensive Pokemon like Clefable. Dazzling Gleam is its secondary STAB attack, hitting Landorus-T and other Pokemon immune to Electric like Zeraora for good damage, while also dealing super effective damage to Giratina and Kyurem-B. Volt Switch lets Tapu Koko get off strong damage even when pivoting, while U-turn is more reliable and deals more damage to Grass-types like Rillaboom. Grass Knot offers super effective coverage for Ground-types like Gastrodon and Hippowdon, which otherwise wall this set.</p> <p>Tapu Koko needs a god with a high Special Attack, such as Pheromosa, Mewtwo, and Rayquaza, in order to do its job. Kyogre makes an excellent teammate, as Tapu Koko can weaken shared checks like Ferrothorn and Gastrodon for Kyogre. Since it is often pivoting, especially in the early-game, partners like Weavile and Volcanion that can take advantage of common switch-ins like Landorus-T, Tangrowth, and Ferrothorn make excellent teammates. Gastrodon can deal with offensive Pokemon like Nidoking that may try to take advantage of Choice-locked Tapu Koko. Even with a bolstered Special Attack, some specially bulky Pokemon like Tangrowth, Gastrodon, and Excadrill give it issues. Powerful wallbreakers like Victini, Kartana, and Zygarde-10% can help deal with them, opening the way for Tapu Koko. Since it will often pivot in and out of the field, Pokemon that can offer entry hazard removal, like Landorus-T and Corviknight, make good teammates for Tapu Koko. These Pokemon also offer a solid defensive backbone to support Tapu Koko's frailty.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 517892, "username": "pannuracotta"}, {"user_id": 500884, "username": "longhiep341"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 539897, "username": "iapt"}]}
  },
  "Tapu Lele": {
    "comments": "<h1>Other Options</h1> <p>Tapu Lele can use Thunder for a less reliable but more potent option to hit Pokemon like Skarmory and Corviknight. Twisted Spoon is an alternative that offers similar power but has the advantage of being able to switch attacks. Choice Scarf sets are able to receive almost any stat and still perform their function. Life Orb lets Tapu Lele change moves while still having a high damage output, although it loses much of its longevity. Terrain Extender is an option on some hyper offense teams that are weaker to common priority users such as Extreme Speed Rayquaza.</p> <h1>Checks and Counters</h1> <p><strong>Necrozma-DM: Necrozma-DM resists both of Tapu Lele's STAB attacks and takes neutral damage from its coverage moves, making it able to force Tapu Lele out easily.</p> <p><strong>Faster Revenge Killers</strong>: Many faster Pokemon can force out non-Choice Scarf Tapu Lele. Examples include Tapu Koko, Pheromosa, Choice Scarf Kartana, and Zamazenta-C Speed receivers like Pangoro.</p> <p><strong>Specially Defensive Pivots: Specially defensive Pokemon like Slowking, Slowbro, and Assault Vest Tangrowth can scout Tapu Lele's Choice-lock and switch to an appropriate check without sacrificing too much of their own HP.</p> ",
    "sets": [
      {
        "name": "Choice Attacker (Speed, Special Attack)",
        "description": "<p>Tapu Lele is a powerful wallbreaker that becomes even more threatening with a Speed donation from gods like Zamazenta-C and Pheromosa. Choice Specs greatly increases its damage output, while Choice Scarf gives Tapu Lele unparalleled Speed, helping it make use of a more average Speed donation like from Yveltal. Terrain-boosted Psychic is its strongest attack, hitting Pokemon like Nidoking and Buzzwole for super effective damage and having good neutral damage against common defensive Pokemon like Clefable and Rotom-W. Moonblast offers good coverage versus gods like Giratina and Yveltal and receivers like Weavile. Focus Blast bypasses would-be checks like Heatran and Ferrothorn that resist its STAB combination. Tapu Lele has several options for its last moveslot. Psyshock is its best move against specially defensive stalwarts like Ho-Oh and Assault Vest Tangrowth, while Thunderbolt gives it a perfectly accurate option to hit Corviknight and Skarmory. Lastly, Future Sight allows Tapu Lele to support its teammates like Dhelmise and Pheromosa even if the opponent has a reliable check to Tapu Lele like Necrozma-DM.</p> <p>Tapu Lele should be paired with a god with high base Speed, such as Pheromosa, Zamazanta-C, or Mewtwo, to make the most of its powerful Special Attack. Since Steel-types resist its STAB combination and can often take advantage of its Choice-lock hyphen, teammates that punish Steel-types like Magnezone and Nidoking make great partners. Slow pivots like Corviknight and Slowbro make great teammates, as they allow Tapu Lele to enter the field safely. Its lackluster bulk makes its non-Choice Scarf sets easily forced out by revenge killers like Tapu Koko and Choice Scarf Kartana, so defensive Pokemon like specially defensive Landorus-T and Skarmory make good teammates. Wallbreakers like Victini and Nidoking appreciate Tapu Lele softening up checks and potentially providing Future Sight support. Entry hazard support from Pokemon like Skarmory and Landorus-T can help chip down its checks. Finally, Tapu Lele enjoys entry hazard removal from teammates like Corviknight and Landorus-T to help it switch in more easily and more often.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 484270, "username": "beauts"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 539897, "username": "iapt"}]}
  },
  "Tapu Fini": {
    "comments": "<h1>Other Options</h1> <p>A defensive set with support moves like Defog, Knock Off, and Taunt, while viable, is outclassed by Pokemon with recovery such as Corviknight and Ho-Oh. A trapping set without Choice Scarf featuring Whirlpool and Nature's Madness can whittle down passive Pokemon, however a lot of these carry pivot moves, in particular U-Turn, and Tapu Fini's weak offensive presence means even offensive threats like Tapu Koko can switch in and force it out. Iron Defense and Stored Power are alternate options on the boosting set, however that would make Tapu Fini vulnerable to more Pokemon like Heatran.</p> <h1>Checks and Counters</h1> <p><strong>Offensive Electric-type Pokemon: Electric-types like Zeraora and Tapu Koko threaten to deal massive damage to Tapu Fini provided that it hasn't boosted enough. However, they struggle to switch in directly if Tapu Fini is a Special Attack receiver.</p> <p><strong>Grass-type Pokemon: Defensive Grass-type Pokemon such as Amoonguss and Ferrothorn have no trouble beating Tapu Fini one-on-one. To a lesser extent, Assault Vest Tangrowth can beat Tapu Fini if it switches in directly on the turn it first uses Calm Mind. Regardless, they still need to watch out for Trick, which can cripple them. Offensive Grass-types like Rillaboom and Kartana also force it out, however they can't switch in repeatedly, especially Rillaboom, as it is vulnerable to a Scald burn.</p> <p><strong>Poison-type Pokemon: Galarian Slowbro and Galarian Slowking take little damage from Tapu Fini's attacks and can hit hard back in return. They also sometimes carry Black Sludge, which punishes Tapu Fini's Trick.</p> <p><strong>Fast Trick and Taunt: Calm Mind variants need multiple boosts to truly function so Taunt or Trick from a faster Pokemon can stop Tapu Fini's sweep. Examples include Slowking in the Speed slot and Mewtwo.</p> ",
    "sets": [
      {
        "name": "Calm Mind (HP, Special Attack)",
        "description": "<p>Calm Mind Tapu Fini is a dangerous wincon capable of setting up on passive Pokemon such as Giratina and Skarmory. It also has great bulk, especially if it receives HP, and a fantastic defensive typing, allowing it to check common attackers like Urshifu-R and Weavile. Calm Mind gradually boosts Tapu Fini's Special Defense, allowing it to shrug off weak special hits from the likes of Slowking and Clefable. Draining Kiss is preferred over Moonblast since it increases Tapu Fini's longevity and helps keep it out of range of being revenge killed by faster threats like Tapu Koko and Rayquaza. Taunt stops status effects, opposing setup, and phazing attempts aimed at Tapu Fini. Scald discourages Pokemon not protected by Misty Terrain from switching in and risking a burn, such as Rillaboom and Tornadus-T. 44 Speed EVs allow Tapu Fini to outrun common base 90 Speed Pokemon such as Ho-Oh, the aforementioned Giratina, and their Speed receivers.</p> <p>Tapu Fini fits best on bulkier builds that want a solid late-game wincon. Gods with a high HP stat like Yveltal and Ho-Oh make for great partners. They can also handle Grass-types that Tapu Fini struggles against such as Ferrothorn and Amoonguss. In return, Tapu Fini walls Weavile. Alternatively, a Special Attack donation from Kyurem-W or Dialga lessens the number of boosts needed to overwhelm the opposing team, which comes in handy against Clear Smog Gastrodon. Landorus-T also has great synergy with Tapu Fini, as it checks various Electric-type Pokemon such as Zeraora and Dracozolt. Entry hazards, especially Toxic Spikes, hinder Tapu Fini's ability to switch in, so entry hazard removal like Excadrill's Rapid Spin and Corviknight's Defog are necessary. Poison-type Pokemon such as Nihilego and Galarian Slowking beat Tapu Fini one-on-one if it doesn't have enough boosts, which sturdy special walls like Ho-Oh and Assault Vest Reuniclus can take on. If Gastrodon is a concern, offensive Tornadus-T invites it in and removes its Leftovers, allowing Tapu Fini to beat it. Magnezone traps and eliminates Ferrothorn, which is a common Tapu Fini answer, as well as Corviknight to prevent it from pivoting out against Tapu Fini.</p> "
      },
      {
        "name": "Choice Scarf (Special Attack)",
        "description": "<p>With a Choice Scarf, Tapu Fini outspeeds Pheromosa and its Speed receivers, making it a nice revenge killer when combined with a better Special Attack stat. Moonblast is its preferred Fairy STAB attack that deals great damage to many dangerous Ubers such as Yveltal and Kyurem-W, as well as frail receivers like Zeraora and Alolan Persian. Scald is more reliable and can threaten a burn on unprotected switch-ins such as Rillaboom and Corviknight, however Hydro Pump is still a usable alternative to increase its damage output. Trick cripples common defensive walls that can easily take Tapu Fini's attacks such as Gastrodon and Tangrowth. Taunt works well in tandem with Trick to deny recovery moves like Gastrodon's Recover and also prevent Slowbro and Slowking from using Teleport and gaining momentum. Whirlpool can surprise defensive Pokemon and potentially let Tapu Fini KO them should they lock themselves into an unfavorable move like entry hazards or Defog. Defog is another option if the team needs an entry hazard control option, which also helps Scald by removing Misty Terrain. While Misty Surge negates Tapu Fini's ability to spread burn, it also allows Tapu Fini to be played more aggressively by switching in directly against a predicted status inducing move or Rest.</p> <p>Choice Scarf Tapu Fini finds its place on bulky offense builds that enjoy its role compression. Gods with a high Special Attack stat like Yveltal and Dialga are great partners to maximize Tapu Fini's revenge kill capabilities. Yveltal and Dialga also have great defensive synergy with Tapu Fini, as the former can take on dangerous Grass-types like Rillaboom and Kartana while the latter can check Electric-types such as Zapdos. In turn, Tapu Fini can check Weavile and Pheromosa for them. Tangrowth handles a myriad of Grass- and Electric-type Pokemon Tapu Fini struggles with, and it also appreciates Misty Terrain to avoid status effects. Magnezone can capitalize on defensive Steel-types that have already been given a Choice Scarf, and also traps Ferrothorn, which is one of Tapu Fini's best counters. Bulky Pokemon with a setup option also like Misty Terrain to set up safely, which makes Kartana and Buzzwole great partners. If Tapu Fini doesn't run Defog, a teammate with an entry hazard removal option like Excadrill or Rotom-H is necessary.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 525446, "username": "Ducky"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 500884, "username": "longhiep341"}]}
  },
  "Buzzwole": {
    "comments": "<h1>Other Options</h1> <p>Substitute can be run on the Bulk Up set to set up more easily, but it can be hard to fit onto movesets. Taunt can shut down many defensive Pokemon but is similarly hard to fit. Offensive sets can opt to run a Life Orb to switch moves, but the loss in power compared to Choice Band, as well as the recoil, make it less than ideal. An EV spread of 248 HP / 8 Atk / 252 Spe on the Special Defense set allows Buzzwole to outspeed base 80 Speed Pokemon, but the loss of special bulk is noticeable.</p> <h1>Checks and Counters</h1> <p><strong>Flying-types</strong>: Ho-Oh and Tornadus-T can tank Close Combat, force Buzzwole out, and keep coming back for more due to Regenerator. Other Flying-types like Yveltal check it as well. However, they must be wary of a potential Ice Punch or Thunder Punch.</p> <p><strong>Fire-types: Fire-types like Heatran and Victini threaten to heavily damage Buzzwole and force it out. However, they both fear being outsped and KOed by Speed receiver sets.</p> <p><strong>Clefable: Clefable resists both of Buzzwole's STAB types, is not threatened by any of its coverage, and can take advantage of Buzzwole by setting up with Calm Mind.</p> ",
    "sets": [
      {
        "name": "Specially Defensive (Special Defense)",
        "description": "<p>With a Special Defense donation and Bulk Up, Buzzwole possesses immense bulk and wallbreaking power. Drain Punch is the go-to STAB move, giving Buzzwole even more longevity, while Close Combat has much higher damage output but lowers its defensive stats. Bulk Up allows Buzzwole to set up on passive threats like Body Press Corviknight, while Toxic can debilitate switch-ins like Slowking and opposing Buzzwole. Roost gives Buzzwole more staying power. Finally, Ice Punch hits Pokemon that resist Fighting like Landorus-T, Tornadus-T, and Zapdos, as does Thunder Punch, which targets Ho-Oh, Slowking, and Slowbro. Rocky Helmet takes advantage of Buzzwole's bulk to continuously chip foes, especially pivots like Landorus-T, but Leftovers is viable too.</p> <p>Buzzwole likes receiving a high Special Defense stat from gods like Ho-Oh and Necrozma-DM. Ho-Oh pairs particularly well with it, as it can switch into Fire-types like Heatran and Victini locked into V-create, as well as providing Defog. Pokemon like Tapu Koko and Rillaboom appreciate Buzzwole's ability to take out Steel-types like Ferrothorn and Kartana. Buzzwole is vulnerable to Flying-types like Ho-Oh, Yveltal, and Tornadus-T, so Pokemon that threaten them like Tapu Koko, Zeraora, and Weavile are appreciated. Pokemon like Necrozma-DM and Slowking-G can take out Fairy-types like Clefable that wall Buzzwole. Buzzwole also likes having entry hazard support from Pokemon like Landorus-T and Ferrothorn, as they chip down foes alongside Rocky Helmet and Toxic. Buzzwole is one of the few relevant Pokemon to resist Thousand Arrows and have reliable recovery, making it one of the best Zygarde-10% checks in the metagame. This greatly helps partners like Heatran.</p> "
      },
      {
        "name": "Choice Item Attacker (Speed)",
        "description": "<p>With a high Speed stat, Buzzwole is an offensive monster, especially with Beast Boost letting it snowball through opposing teams. Choice Band-boosted Close Combat OHKOes Steel-types like Ferrothorn and ravages all neutral targets. Ice Punch hits Flying-types that resist Close Combat like Landorus-T, Tornadus-T, and Rayquaza. Earthquake allows Buzzwole to take out Heatran and hit other Fire-types like Blacephelon and Victini hard. Leech Life is a decent Bug-type STAB move that restores HP and lets Buzzwole stay healthy throughout the match, as well as 2HKOing potential checks in Slowking and Slowbro. Choice Band is preferred, but Choice Scarf can be used to outspeed opposing Speed receivers, or if receiving Speed from a slower god.</p> <p>Buzzwole demands a high—or at least solid—Speed stat from gods like Zamazenta and Mewtwo; it is important to note that with base 130 Speed or higher, Beast Boost will raise Speed on each KO. For slower gods like Yveltal and Lunala, it will boost Attack, which makes Buzzwole very hard to defend against. When paired with powerful wallbreakers like Tapu Koko, Weavile, and Galarian Moltres, Buzzwole can quickly tear apart defensive cores. Buzzwole can consistently take out Steel-types like Ferrothorn and Heatran, which greatly helps Pokemon like Rillaboom and Tapu Koko. Buzzwole is weak to Flying-types, so Pokemon that can take them out like Tapu Koko and Zeraora, or check them like Heatran and Skarmory, are good to have around. Buzzwole needs to conserve its HP in order to sweep, so pivots like Slowking, Rotom-W, and Landorus-T are good to get it in safely. Buzzwole also appreciates entry hazards from the likes of Skarmory, Landorus-T, and Ferrothorn to put many foes into KO range.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 525446, "username": "Ducky"}, {"user_id": 523866, "username": "UT"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}], "writtenBy": [{"user_id": 584907, "username": "Wes8888"}]}
  },
  "Kartana": {
    "comments": "<h1>Other Options</h1> <p>Kartana can run Synthesis as its fourth move on Life Orb sets, helping it avoid being worn down over the course of a game, but sacrificing coverage. Aerial Ace is also an option to hit Buzzwole and Tangrowth super effectively. Protective Pads can also be used over Life Orb, trading damage output for avoiding damage from Rough Skin, Iron Barbs, and Rocky Helmet. A Timid Nature and 19 Attack IVs can also be used to have Beast Boost increase Kartana's Speed, turning it into a better sweeper at the cost of less initial damage.</p> <h1>Checks and Counters</h1> <p><strong>Physically Defensive Flying-types: Corviknight, Skarmory, and Ho-oh all resist both of Kartana's STAB moves, and can threaten it with either Body Press or Sacred Fire.</p> <p><strong>Physically Defensive Pokemon: Kartana has difficulty breaking through Amoongus, Tangrowth, and Buzzwole, which have enough Defense to check all of its sets.</p> <p><strong>Contact Effects</strong>: Contact effects such as Static, Flame Body, Iron Barbs, and Rocky Helmet make it difficult for Kartana to make progress.</p> <p><strong>Revenge Killers:</strong> Swords Dance sets can be revenge killed by faster threats such as Choice Scarf Victini and Zeraora. Choice Scarf sets can also be easily checked offensively, as opponents are able to take advantage of Kartana being locked into the same move.</p> ",
    "sets": [
      {
        "name": "Swords Dance (Special Defense)",
        "description": "<p>Kartana's monstrous 181 base Attack stat, boosted even further via Life Orb and Swords Dance, makes it a fantastic wallbreaker. Inheriting Special Defense makes it much less susceptible to chip damage from resisted attacks like Tapu Koko's Thunderbolt. Kartana's Speed tier also allows it to outspeed many common Pokemon including Yveltal, all Kyurem formes, and Volcarona. Swords Dance helps it beat would-be checks such as Landorus-T inheriting Defense. Leaf Blade is its main form of damage, hitting Water-types like Slowbro and Rotom-W super effectively and dealing large amounts of damage to neutral targets. Knock Off is used to damage Flying- and Fire-type Pokemon such as Corviknight, Ho-oh, and Volcarona, removing their items like Leftovers or Heavy-Duty Boots, respectively, allowing Kartana to wear them down more easily. Sacred Sword hits Steel-type Pokemon like Ferrothorn super effectively, while also Flying-type Pokemon who are neutral to Fighting such as Skarmory.</p> <p>Swords Dance Kartana fits best on offensive teams, as it is excellent at wearing down opposing walls like Landorus-T and Corviknight so another teammate can sweep. Kartana is able to work with most gods, but is most commonly paired with more offensive gods such as Yveltal and Rayquaza, comma as they can also take advantage of the pressure Kartana puts on opposing teams and provide Kartana with a solid Special Defense donation. However, it is important to understand that Kartana does not work with every god, such as Ho-oh, as Kartana does not have much longevity. Offensive entry hazard setters such as Cloyster make great partners, as entry hazards help wear down Kartana’s checks. Kartana also compliments entry hazard setters well by removing Heavy-Duty Boots from walls, especially Ho-oh. Teammates such as Zygarde-10% who share common checks with Kartana are useful, as together they can slowly wear down their shared checks until one of them has an opportunity to sweep or pick up multiple KOs. Kartana also pairs well with powerful cleaners such as Bisharp inheriting Speed and Weavile inheriting Attack, as they excel at capitalizing off of Kartana's wallbreaking power. While Kartana has a good Speed tier, it is still outsped by common offensive Pokemon such as Tapu Koko and Pheromosa, making other fast Pokemon such as Mewtwo or Choice Scarf users such as Tapu Lele good teammates.</p> "
      },
      {
        "name": "Choice Scarf (Special Defense)",
        "description": "<p>With a Choice Scarf, Kartana becomes a deadly late-game cleaner and revenge killer. Thanks to its high Attack and good Speed tier, it is able to outspeed and threaten to KO the majority of the tier's offensive threats like Weavile and Zeraora. With its Special Defense patched up, it also is able to stomach weak hits in the process, such as Rotom-W's Volt Switch and Tapu Koko's Thunderbolt. Leaf Blade OHKOes common Pokemon like Zygarde-10%., while Smart Strike threatens Fairy-types such as Tapu Lele and Clefable. Knock Off hits Flying-type switch-ins like Corviknight and Ho-Oh, who resist Kartana's STAB moves, and Sacred Sword hits Steel- and Flying-type Pokemon neutral to Fighting such as Heatran and Yveltal. Defog is an option to allow Kartana to serve as an emergency entry hazard remover.</p> <p>Choice Scarf Kartana fits well on bulky offense and balance teams which appreciate its ability to outspeed and revenge kill common threats. It is often paired with offensive gods such as Yveltal and Rayquaza, but can work with many different gods. The exception to this is that some gods with very high Special Defense stats such as Ho-oh and Zamazenta-C would much rather donate their Special Defense to a defensive Pokemon. Magnezone is a great partner, as it is able to trap and remove Steel-types that Kartana has trouble breaking. Powerful wallbreakers such as Swords Dance Weavile are also good partners, as they are able to help weaken Kartana's checks like Corviknight, making it easier to sweep late-game. Special attackers like Kyurem-W and Nidoking are also great partners for Kartana, as they can pressure physical walls such as physically defensive Tangrowth. Teammates who can use Future Sight such as Slowking and Slowbro also pair well with Kartana, taking advantage of the fact that many of Kartana's checks, such as Landorus-T and Skarmory, have lower Special Defense.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 484270, "username": "beauts"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 525446, "username": "Ducky"}]}
  },
  "Necrozma-Dusk-Mane": {
    "comments": "<h1>Other Options</h1> <p>Necrozma-DM can opt to run physically defensive set with a Rocky Helmet to more reliably wall physical threats like Rillaboom. Photon Geyser can be run over Earthquake on Necrozma-DM’s Dragon Dance set to target specific Pokemon like Nidoqueen, which threaten it with Ground-type moves, but is generally inferior to Earthquake’s coverage. Defensive sets can run Stealth Rock if their team lacks entry hazard setters, but being forced to give up one of its utility moves is usually not worth it.</p> <h1>Checks and Counters</h1> <p><strong>Bulky Ground-types: Physically defensive Ground-types like Landorus-T can switch into Necrozma-DM and threaten it with Earthquake. However, they should be wary of Toxic.</p> <p><strong>Water-types: Bulky Water-types like Slowking, Slowbro, Tapu Fini, and Rotom-W can wall Necrozma-DM, Tapu Fini being notable for blocking Toxic and the rest for being able to burn it. However, Slowking and Slowbro must be wary of Knock Off, and Tapu Fini can be 2HKOed by a +1 Sunsteel Strike from offensive sets.</p> <p><strong>Steel-types: Steel-types like Skarmory, Corviknight, and Ferrothorn resist Sunsteel Strike and take insignificant amounts of damage from Necrozma-DM’s coverage. Skarmory and Corviknight can set up on defensive Necrozma-DM with Bulk Up and Iron Defense, and Ferrothorn can eternally outlast it with a combination of Leech Seed, Protect, and Leftovers.</p> <p><strong>Setup Sweepers: Powerful setup sweepers like Garchomp and Rayquaza can overwhelm even defensive Necrozma-DM with strong super effective moves, threatening all variants with a +2 Earthquake or a +1 V-create, respectively.</p> <p><strong>Ho-Oh: Ho-Oh resists Sunsteel Strike, is immune to Earthquake, and can hit back hard with Sacred Fire. However, Ho-Oh must fear heavy damage from Stone Edge from offensive sets.</p> ",
    "sets": [
      {
        "name": "Dragon Dance",
        "description": "<p>Weakness Policy Necrozma-DM is a fearsome wallbreaker and mid- to late-game cleaner. Dragon Dance is an excellent tool to boost Necrozma-DM’s damage while also fixing its subpar Speed tier. Sunsteel Strike is a powerful STAB move that threatens most of the tier at +1. Necrozma-DM’s coverage options help break down common Pokemon that resist it, with Earthquake hitting Heatran and opposing Necrozma-DM and Stone Edge hitting Ho-Oh and Corviknight, which otherwise completely wall it. Prism Armor allows Necrozma-DM to shrug off super effective attacks and activate Weakness Policy more easily, putting it in a position to sweep.</p> <p>Necrozma-DM is best utilized on balance or bulky offense teams as a mid- or late-game cleaner, capable of shredding defensive cores after its checks have been removed. Necrozma-DM's solid defensive stats bolster teammates like Defensive Clefable and Assault Vest Tangrowth immensely, making for some very tough defensive cores. Many Pokemon such as Rillaboom, Victini, and Zeraora appreciate inheriting Necrozma-DM's high Attack stat and its ability to pressure common Pokemon such as Clefable. In turn, these Pokemon threaten the Water- and Steel-types that Necrozma-DM has trouble beating, such as Slowbro, Corviknight, and Skarmory. Necrozma-DM fears fast offensive Pokemon that carry super effective moves such as Rayquaza and Garchomp, whose sheer strength can overwhelm Necrozma-DM. Unaware users like Clefable are useful to ignore setup from these threats, and Pokemon with super effective priority such as Weavile can clean them up after chip.</p> "
      },
      {
        "name": "Specially Defensive",
        "description": "<p>Necrozma-DM's typing, bulk, and access to reliable recovery make it a great specially defensive wall. Sunsteel Strike lets Necrozma-DM still do respectable damage, and Knock Off is a handy utility move to punish common switch-ins like Ho-Oh and remove damage boosting items from wallbreakers. Toxic cripples defensive Pokemon like Rotom-W and Landorus-T, while Thunder Wave cripples switch-ins like Heatran. Earthquake provides good coverage to hit offensive switch-ins like Heatran, but generally isn’t as useful as spreading status. Morning Sun improves Necrozma-DM’s longevity greatly, but must be used sparingly, for it has very low PP. Leftovers is necessary to provide much needed passive recovery.</p> <p>Necrozma-DM can form well-rounded defensive cores with Pokemon such as Tangrowth and Buzzwole, who love to receive Necrozma-DM’s Special Defense stat. Both resist Ground, with the latter resisting Dark as well, which helps cover Necrozma-DM's weaknesses. Rotom-W and Necrozma-DM have good defensive synergy, with Rotom-W providing a resistance to Fire, an immunity to Ground, and sporting great bulk with an HP donation, while Necrozma-DM walls Grass-types such as Rillaboom, as it resists their STAB moves. Necrozma-DM is great at spreading status and removing items from switch-ins like Ho-Oh, which helps teammates that struggle with these threats pick up KOs on the weakened foes. Tapu Koko is a great Special Attack receiver to break past various Water-types that are not threatened by Necrozma-DM. Victini is a good choice to receive Attack and counter Steel-types such Skarmory and Corviknight, which wall Necrozma-DM and turn it into setup fodder, while also hitting Water-types with Bolt Strike.</p> "
      },
      {
        "name": "Bulky Booster",
        "description": "<p>This set combines Necrozma-DM's offensive and defensive utility to create something that can take a hit and hit back hard. Dragon Dance allows Necrozma-DM to become a threatening cleaner versus weakened teams, while Swords Dance is helpful to wallbreak early-game. Sunsteel Strike is an excellent STAB move with great power and good coverage. Knock Off has great neutral coverage with Sunsteel Strike and weakens its checks by removing their items, while Stone Edge hits Flying-types such as Ho-oh and Earthquake hits Steel-types such as Heatran. Morning Sun and Leftovers give Necrozma-DM respectable longevity, but Morning Sun must be rationed so its low PP doesn't run out. Maximum Attack and an Adamant nature maximize damage output while the Speed investment outspeeds base 100 Speed foes after a Dragon Dance.</p> <p>Pokemon such as Buzzwole and Tangrowth are excellent defensive presences if they receive Necrozma-DM's Special Defense stat, as they resist the Ground moves that threaten Necrozma-DM. Victini loves receiving Necrozma-DM's Attack stat and can threaten many Pokemon that Necrozma-DM can't beat like Ferrothorn and Skarmory. Entry hazard setters like Ferrothorn and Landorus-T help Necrozma-DM wear down its checks faster, with the latter being able to pivot it in with U-turn. This set struggles with Ground-types like Garchomp and Landorus-T, so teammates like Rotom-W, Landorus-T, and Skarmory are recommended. Skarmory and Ho-Oh are especially troublesome Pokemon for Necrozma-DM to face, as both resist Sunsteel Strike and wall sets that lack Stone Edge, so Electric-types like Tapu Koko and Zeraora that can handle these threats for Necrozma-DM, while also keeping up momentum with pivot moves, make great partners. Magnezone is also a valuable partner, as it traps and removes Skarmory and Corviknight.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 525446, "username": "Ducky"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 541143, "username": "senko"}, {"user_id": 584907, "username": "Wes8888"}]}
  },
  "Blacephalon": {
    "comments": "<h1>Other Options</h1> <p>Psyshock is an option on Choice Specs set to hit Gastrodon and Nihilego, but doesn't have much use otherwise. Rock Blast can lure and dent Ho-Oh, however Knock Off combined with Stealth Rock already prevents it from switching in multiple times. Even though Life Orb increases Blacephalon's damage output without locking it into a move, it reduces Blacephalon's already short longevity and thus should only be combined with Explosion to eliminate special walls.</p> <h1>Checks and Counters</h1> <p><strong>Tyranitar: Tyranitar resists both Blacephalon's STAB moves and can easily OHKO Blacephalon with its own STAB attack. However, its lack of a recovery option outside of Rest makes it prone to getting worn down by Toxic and Knock Off, especially in combination with entry hazards.</p> <p><strong>Specially Defensive Pokemon</strong>: Specially bulky Pokemon like Nihilego, Gastrodon, and Ho-Oh can take even Choice Specs-boosted hits from Blacephalon, and the latter two can heal off any damage dealt. They still hate receiving a Choice item, especially Ho-Oh if Stealth Rock is up.</p> <p><strong>Entry Hazards</strong>: Blacephalon's vulnerability to all entry hazards, especially Stealth Rock, means their presence makes it harder for it to repeatedly come in and wreak havoc.</p> <p><strong>Revenge Killers</strong>: Even when resisting most priority moves, Blacephalon's poor bulk makes it susceptible to being revenge killed by priority moves, such as Yveltal's Sucker Punch and Rillaboom's Grassy Glide, especially if it doesn't receive HP or Defense. If Blacephalon lacks a Speed donation, then faster Pokemon can also revenge kill it. Excadrill in sand and Choice Scarf Kartana both outspeed Choice Scarf Blacephalon. Bulky Pokemon that can take a hit like Landorus-T and Kyurem-W also threatens to OHKO Blacephalon.</p> ",
    "sets": [
      {
        "name": "Choice Item Attacker (Speed, Defense, HP)",
        "description": "<p>Blacephalon is a fearsome late-game cleaner thanks to its high Special Attack and fantastic offensive typing. Blacephalon is also a serious threat to snowball the other team, as (in most cases) Beast Boost will raise its Special Attack after a KO, allowing it to blow through weakened teams. Shadow Ball is its primary attack, hitting most of the metagame at least neutrally. Fire Blast has high Base Power and can dent many Pokemon that can take Shadow Ball such as Tangrowth, Yveltal, and Zamazenta-C. Flamethrower is an alternative, trading raw power for more accuracy and PP. Trick allows Blacephalon to cripple specially defensive foes that it can't do much against otherwise, namely Gastrodon and Tyranitar. On the last moveslot, Knock Off disrupts the foe's item, and is particularly useful against Ho-Oh when Stealth Rock is up. Knock Off also comes in handy to remove Assault Vest from RegenVest Pokemon that might stomach its attacks and switch out with little HP lost otherwise, in particular Tangrowth and Galarian Slowbro. Toxic instead puts foes on a timer and forces them to use their recovery move more often. Overheat is an alternative that helps it revenge kill weakened offensive threats better. Choice Scarf is usually the go-to item to outspeed fast offensive threats like Tapu Koko and Mewtwo. If Blacephalon gets a Speed donation from Zamazenta or Pheromosa, Choice Specs is preferred, as Beast Boost will increase its Speed after a KO.</p> <p>Choice Item Blacephalon acts as a cleaner and revenge killer on offensive builds. A Speed donation from fast gods such as Mewtwo, Zamazenta-C, and Pheromosa helps it outpace fast offensive Pokemon such as Weavile and Kartana; however, a better Defense or HP stat can also help Blacephalon avoid a KO from priority moves such as Rillaboom's Grassy Glide. Groudon can provide sun, which further boosts Blacephalon's Fire attacks. Specially offensive Pokemon like Tapu Koko enjoy Blacephalon's ability to cripple special walls like Gastrodon and Ho-Oh without taking up the Special Attack slot. They can also weaken Blacephalon's checks and counters, allowing it to pick up a KO more easily and snowball. Physical threats such as Kartana and Zamazenta-C struggle against sturdy walls like Buzzwole and Skarmory, which Blacephalon can handle. Entry hazards greatly limit Blacephalon's ability to switch in multiple times, so teammates with entry hazard removal such as Landorus-T and Rotom-W are required. Blacephalon complements entry hazards well by removing Heavy-Duty Boots with Trick or Knock Off, which makes Ferrothorn and Landorus-T great additions. Priority attacks like Yveltal's Sucker Punch and Rillaboom's Grassy Glide force Blacephalon out, so partners that can take them like Tapu Koko and Tornadus-T are appreciated. A counter to Tyranitar like Urshifu-R or Buzzwole is also necessary.</p> "
      },
      {
        "name": "Heavy-Duty Boots (Speed, Defense, HP)",
        "description": "<p>Heavy-Duty Boots Blacephalon is a very effective progress maker against bulkier teams that still possesses decent power. Shadow Ball is a reliable Ghost STAB attack that hits most Pokemon at least neutrally. Flamethrower is its secondary STAB move, dealing decent damage to Yveltal and Tangrowth. Fire Blast can be used instead, however its lower PP and accuracy are concerns when Blacephalon is often required to use it multiple times. Knock Off removes key items from common switch-ins, in particular Heavy-Duty Boots, Assault Vest, and Leftovers, to make them more vulnerable to chip damage. Toxic cripples Ho-Oh, Gastrodon, and Tyranitar, which otherwise can take Blacephalon's attacks with ease. Taunt prevents Clefable, which doesn't mind Toxic and loss of item, from using Soft-Boiled. Heavy-Duty Boots negates entry hazard damage that would quickly wear Blacephalon down.</p> <p>Heavy-Duty Boots Blacephalon's low defensive utility and capability to wallbreak short term means it should be built around as a secondary wincon. Zamazenta-C gives Blacephalon a much better Speed tier to threaten more offensive Pokemon out and thus opportunities to cripple switch-ins. It can also check two common priority users in Rillaboom and Yveltal. Pokemon who share checks with Blacephalon like Victini and Volcarona benefit from having opposing Ho-Oh and Gastrodon crippled. Bulky offensive threats such as Kyurem-W force it out, which makes it necessary to have a teammate that can handle their attacks like Tangrowth. Entry hazard support from Skarmory and Ferrothorn helps Blacephalon chip down opposing walls, especially with Knock Off to remove their Heavy-Duty Boots. Faster offensive Pokemon such as Zeraora and Pheromosa can OHKO Blacephalon, which can be taken care of by Clefable.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 525446, "username": "Ducky"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 500884, "username": "longhiep341"}]}
  },
  "Zeraora": {
    "comments": "<h1>Other Options</h1> <p>A setup set with Bulk Up can be run to turn Zeraora into a sweeper without much offensive counterplay, but due to its limited coverage, most Ground-types stop it from making progress. A special set with Choice Specs can throw off checks like Hippowdon and Gastrodon, but its lack of coverage overall and utility without Knock Off makes it a worse wallbreaker than Choice Band. Other forms of coverage like Play Rough for Dragon-types like Garchomp and Dracozolt or Grass Knot for Ground-types like Hippowdon and Gastrodon can help beat out some of its most common checks. Taunt Zeraora with donated HP from Gods like Yveltal may be run to improve its longevity as a pivot, but it loses most of its offensive presence and doesn’t last as long without a form of reliable recovery.</p> <h1>Checks and Counters</h1> <p><strong>Ground-types: Thanks to their immunity to Electric moves and high physical bulk, Ground-type Pokemon such as Hippowdon, Gastrodon, and Landorus-T can easily switch into Zeraora’s coverage and shut down any momentum by blocking Volt Switch. Knock Off can help chip these Pokemon down, but they are generally consistent switch-ins for most of the game.</p> <p><strong>Electric-types: Bulky Electric-types like Rotom-W and Rotom-H can check non-Choice Band Zeraora and cripple it with Will-O-Wisp, although Choice Band can 2HKO them with enough chip damage.</p> <p><strong>Grass-types: Grass-types like Ferrothorn, Tapu Bulu, Tangrowth, and Venusaur switch into Plasma Fists consistently and don't mind its other coverage. Ferrothorn, however, cannot switch into Close Combat from Choice Band, and Tangrowth and Tapu Bulu risk being crippled by Toxic.</p> <p><strong>Dragon-types: Dragon-types like Dialga, Zekrom, and Dracozolt resist Zeraora's Electric moves and don't fear its typical coverage options, making them consistent checks.</p> <p><strong>Faster Pokemon and Priority: Choice Scarf Pokemon like Tapu Lele and Pokemon with priority moves like Rillaboom can take advantage of Zeraora's poor bulk and threaten to OHKO it.</p> ",
    "sets": [
      {
        "name": "Choice Band (Attack)",
        "description": "<p>With one of the highest Speed stats in the game, Zeraora is both an excellent fast revenge killer and, with an Attack donation, a powerful wallbreaker. Plasma Fists allows Zeraora to threaten the prominent defensive Flying- and Water-types in the tier like Corviknight, Skarmory, Ho-Oh, Tapu Fini, and Slowking. It also hits most of the other common walls hard, breaking through Pokemon like Clefable and Heatran, as well as threatening to OHKO slower offensive Pokemon like Tapu Lele. Close Combat provides coverage for Pokemon that resist Plasma Fists like Ferrothorn and Excadrill, preventing them from switching in safely. Knock Off is an overall safe move that removes items from Zeraora’s switch-ins to limit their longevity, most notably Landorus-T and Rotom-H, who rely heavily on their items to consistently check it. Volt Switch creates momentum for the team and brings in a threat to Zeraora’s switch-ins.</p> <p>Zeraora fits best on fast-paced offensive teams with setup sweepers to take advantage of weakened defensive cores Zeraora creates. Most gods with high Attack like Rayquaza, Necrozma-DM, and Kyurem-B are great partners to donate Attack to Zeraora, allowing it to provide immediate wallbreaking power and setup opportunities for the gods. Other setup Pokemon like Garchomp and Weavile also appreciate the pressure Zeraora puts on bulky Water-types. Ground-types like Hippowdon, Gastrodon, and Landorus-T give Zeraora a hard time creating momentum with Volt Switch and can easily take its coverage moves, so Water-types like Rotom-W and Tapu Fini pair well. Dragon-types like Dialga, Zekrom, and Dracozolt prevent Zeraora from constantly using Plasma Fists, so Pokemon like Tapu Lele and Landorus-T support it well. Zeraora gets easily chipped down by entry hazards due to frequent pivoting, so hazard removers like Corviknight, Tapu Fini, and Excadrill are good partners. Entry hazard setters like Skarmory, Mew, and Ferrothorn help Zeraora wear down its checks and allow it to break more easily.</p> "
      },
      {
        "name": "Taunt Pivot (Attack)",
        "description": "<p>With its high Speed and threatening Electric moves, Zeraora pressures common Defoggers and generates momentum for the team. Taunt shuts down common Defoggers like Corviknight and Tapu Fini and prevents Pokemon like Clefable and Ferrothorn from setting entry hazards and healing. Volt Switch lets it keep up the pressure bringing in teammates consistently and has extra longevity due to Heavy-Duty Boots. Plasma Fists keeps Zeraora’s offensive presence and threatens prominent Water-type Pokemon like Tapu Fini and Slowking. Knock Off is useful for taking away Leftovers from its checks like Landorus-T, Gastrodon, and Ferrothorn, and improving the effectiveness of entry hazards by removing Heavy-Duty Boots off of Pokemon like Rotom-Heat, Slowbro, and Ho-Oh. Toxic gives Zeraora a way to punish its consistent checks like Landorus-T and Hippowdon.</p> <p>With immense pressure on Flying-types and Defoggers, Zeraora provides excellent support for entry hazard-stacking teams. Gods with high Attack like Rayquaza, Necrozma-DM, and Kyurem-B allow Zeraora to extert offensive pressure and appreciate its ability to control entry hazards. Spikers like Skarmory and Ferrothorn greatly appreciate Defog prevention and can easily set multiple layers of Spikes. Ground-types like Hippowdon and Landorus-T take very little damage from Zeraora’s attacks, so Water-types like Rotom-W and Tapu Fini are great partners to threaten them. Zeraora also relies much on Heavy-Duty Boots to stay healthy, so Pokemon like Skarmory and Clefable are great partners to switch into Knock Off without much drawback.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 525446, "username": "Ducky"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 541143, "username": "senko"}]}
  },
  "Corviknight": {"sets": [{"name": "Defog (SpD)"}, {"name": "Bulk Up (SpD)"}]},
  "Dracozolt": {
    "comments": "<h1>Other Options</h1> <p>Dracozolt can run a combination of Fire Spin and Substitute to trap passive Pokemon, get a Substitute up, and fire off powerful attacks unharmed. However, this forces Dracozolt to give up coverage and can be difficult to fit onto teams. Dracozolt can also use Speed donations from fast gods like Mewtwo, but it is generally underpowered for the role. Outrage 2HKOes sturdy defensive walls that aren't afraid of Bolt Beak, especially Landorus-T, but Dracozolt risks getting revenge killed by Fairy-types after. Hustle grants Dracozolt a massive power boost, but the accuracy drop makes it very inconsistent.</p> <h1>Checks and Counters</h1> <p><strong>Ground-types: Ground-types like Landorus-T are not threatened by Dracozolt's coverage and can take it out with a STAB Earthquake. However, they still have to watch out for the rare Outrage.</p> <p><strong>Priority Moves</strong>: Dracozolt racks up a lot of chip damage from its Life Orb, making it vulnerable to priority move users like Zygarde-10% and Weavile. Even if they do not KO, priority moves also weaken Bolt Beak and potentially let the target survive.</p> <p><strong>Faster Pokemon: Even with sand up, Dracozolt is still outsped by fast Choice Scarf users such as Blacephalon and Kartana. Rayquaza, Kyogre, and Groudon can also outspeed it by removing sand. However, with the exception of Groudon, these Pokemon struggle to get a safe switch-in and can't beat Dracozolt if it has Substitute up.</p> <p><strong>Tangrowth: Tangrowth, particularly mixed wall variants, barely takes any damage from Dracozolt's moves, can restore lost HP with Regenerator, and can hit it hard with Earthquake.</p> ",
    "sets": [
      {
        "name": "Sand Rush (Attack)",
        "description": "<p>With good coverage, Sand Rush, and STAB Bolt Beak, Dracozolt is a fearsome sand sweeper. Bolt Beak is Dracozolt's primary STAB attack and takes advantage of Sand Rush to usually go first, capable of breaking through common defensive Pokemon, notably Rotom-W and Necrozma-DM. Fire Blast hits Grass-types that resist Bolt Beak like Ferrothorn and Kartana, and it's also useful against the former and Skarmory to avoid contact damage from Iron Barbs and Rocky Helmet. Draco Meteor targets Dragon-types like Garchomp and Zekrom, which shrug off the other attacks, while also hitting Landorus-T hard; Dragon Claw is a more consistent option for teams that can reliably remove Landorus-T. In the last moveslot, Substitute eases predictions and blocks foes such as Rayquaza, Kyogre and Choice Scarf Kartana from easily revenge killing Dracozolt, while Taunt prevents recovery moves from defensive stalwarts that Dracozolt can't 2HKO, like Clefable receiving Shuckle's Defense and Gastrodon. Leftovers is preferred with Substitute, and Life Orb without it.</p> <p>Dracozolt likes receiving high Attack stats from gods like Ho-Oh and Calyrex-I. Ho-Oh stands out as a particularly good pick, as it can remove entry hazards, switch into Ground-types that threaten Dracozolt, and deal with Tangrowth, which walls Dracozolt. A sand setter in Tyranitar or Hippowdon is mandatory for Dracozolt to function; their Stealth Rock also aids Dracozolt in wearing down Tangrowth and Landorus-T. Fellow sand sweepers, most notably Excadrill, can create potent wallbreaking cores with Dracozolt, capable of quickly overwhelming many defensive Pokemon and tearing teams apart. Dracozolt also puts pressure on Skarmory and Corviknight, two Pokemon that Excadrill has a tough time getting past. Dracozolt is quite frail, so it appreciates pivots like Rotom-W bringing it in safely. Rotom-W also provides a switch-in to Rayquaza and Groudon, which can revenge kill Dracozolt. Similarly, Tangrowth deals with Kyogre, which poses a big threat to the sand core. Dracozolt is also quite susceptible to entry hazards because, when combined with Life Orb recoil, they accumulate a lot of chip damage very quickly. Therefore, it loves having hazard removers like the aforementioned Ho-Oh, Rotom-W, and Excadrill around.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 500884, "username": "longhiep341"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}], "writtenBy": [{"user_id": 584907, "username": "Wes8888"}]}
  },
  "Calyrex-Ice": {"sets": [{"name": "Substitute Leech Seed"}, {"name": "Choice Band"}, {"name": "Swords Dance"}]}
}