{
  "Clefable": {"sets": [{"name": "Stealth Rock"}]},
  "Dugtrio": {"sets": [{"name": "Choice Scarf Trapper"}]},
  "Tentacruel": {"sets": [{"name": "Defensive"}]},
  "Cloyster": {
    "overview": "<p>With both Spikes and good offensive pressure, Cloyster works as a potent suicide lead. Shell Smash combined with Focus Sash, Skill Link, and STAB Icicle Spear lets it reliably set up and OHKO leads like Excadrill and Slurpuff through their Focus Sashes. Its access to Rapid Spin is also valuable, compacting the role of entry hazard remover. Knock Off users such as Yveltal especially like Spikes because they can remove Heavy-Duty Boots, which helps them sweep later on. However, Cloyster is held back by its low Speed, making it susceptible to Taunt; also, its poor typing and defensive stats mean that it will be on the field only once most of the time. Finally, it faces severe competition with other leads, with Froslass and Aerodactyl having great Speed and Taunt for more consistent hazard setting, Shuckle having Sturdy + Mental Herb, and Galvantula and Ribombee having great Speed alongside paralysis.</p> ",
    "comments": "<h1>Other Options</h1> <p>Explosion can be used to inflict surprise high damage to any Pokemon that would like to Defog, in addition to preventing it from being used. Liquidation punishes Pokemon that resist Icicle Spear, but the average Attack of Cloyster means that any Pokemon not weak to Water will not take a lot of damage from it, even after Shell Smash. Toxic Spikes can be chosen as a better option against offensive teams.</p> <h1>Checks and Counters</h1> <p><strong>Necrozma-DM</strong>: With Necrozma-DM's astonishing bulk and Steel typing, Cloyster will do little to no damage to it, even when boosted. Moreover, it can set Stealth Rock easily, and its use of Rocky Helmet can spinblock Cloyster effectively.</p> <p><strong>Taunt</strong>: Leads like Grimmsnarl and Froslass can use Taunt before Cloyster can do anything, preventing it from setting up Spikes. Froslass is also immune to Rapid Spin and can set several layers of Spikes for its team before being taken down by Icicle Spear.</p> <p><strong>Fast Pivots: Pivots like Regieleki and Pheromosa can break Cloyster's Focus Sash with Volt Switch or U-turn and come back later in the game to use Rapid Spin. Their common use of Heavy-Duty Boots also means that they won't be damaged by Cloyster's Spikes.</p> <p><strong>Strong Attackers: Pokemon like Kyogre and Calyrex-S can limit Cloyster to a single layer of Spikes before KOing it or forcing it to switch. Calyrex-S also spinblocks Cloyster, and Choice Scarf sets can cripple it with Trick and outspeed it even after Shell Smash. Kyogre's Thunder can additionally paralyze Cloyster, but it's afraid of taking a boosted Explosion.</p> ",
    "sets": [
      {
        "name": "Suicide Lead",
        "description": "<p>Spikes is the main reason to use Cloyster. Shell Smash and Icicle Spear punish Pokemon that stay in on it without attacking such as Ho-Oh, Eternatus, and Ferrothorn; in addition, it is one of the fastest Pokemon in the metagame after Shell Smash. Rapid Spin stops other suicide leads like Excadrill, Slurpuff, and Aerodactyl from setting their entry hazards freely. A Jolly nature can be chosen over Adamant, at the cost of a bit of power, for boosted Cloyster to outspeed Choice Scarf Yveltal, Adamant Regieleki, and more generally any Choice Scarf users under base 110 Speed.</p> <p>Spikes is great support for heavily offensive teams, allowing threats like Zekrom, Groudon, and Kyogre to wear down their common checks, namely Necrozma-DM, Tangrowth, and Blissey. Fast Taunt users like Yveltal are also great, as they can prevent Spikes from being removed by slow Defoggers; plus, being able to spam Knock Off and thus remove Heavy-Duty Boots is great synergy with Spikes. Finally, Eternatus, especially its offensive set, appreciate Cloyster luring in Yveltal and Ho-Oh, as it severely punishes them with Meteor Beam.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 511624, "username": "Fc"}, {"user_id": 222996, "username": "Minority"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}, {"user_id": 240732, "username": "Estronic"}]}], "writtenBy": [{"user_id": 415367, "username": "Eledyr"}]}
  },
  "Ditto": {
    "sets": [
      {
        "name": "Ditto (Copycat)",
        "description": "<p>Ditto's one and only role in Ubers is to copy the opponent's Pokemon in order to function as the premier revenge killer in the metagame, able to steal the target's stat boosts on top of having a Speed boost from its Choice Scarf. It is undeniably one of the best Pokemon in the metagame for that very reason, as there are many Pokemon that can set up with ease, and Ditto is able to copy their boosts and beat most of them one-on-one. Ditto can also be useful against bulkier teams, as its PP refreshes every time it is switched out, so it can help in cases of PP wars. As Ditto is frail, you want it to be sent in safely versus offensive threats, so pairing it with the likes of Corviknight or other pivots can be a good idea. Although it is the best revenge killer the metagame has to offer, it still has its flaws in doing so against moves like Substitute and Imprison, as well as opposing Choice Scarf users and bulky setup sweepers. Also, keep in mind you cannot use Imposter on opposing Ditto that have already copied a Pokemon, and that Ditto negates the Speed reduction when it copies the opposing Pokemon while Sticky Webs are on your side.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 284369, "username": "Mysterious M"}, {"user_id": 222996, "username": "Minority"}]}, {"name": "Grammar checked by", "members": [{"user_id": 297659, "username": "deetah"}]}], "writtenBy": [{"user_id": 337099, "username": "Holy Ghost"}]}
  },
  "Aerodactyl": {"sets": [{"name": "Stealth Rocks Lead"}]},
  "Mewtwo": {"sets": [{"name": "Nasty Plot"}]},
  "Mew": {"sets": [{"name": "Lead"}]},
  "Xatu": {"sets": [{"name": "Magic Bounce"}]},
  "Shuckle": {"sets": [{"name": "Sticky Web Setter"}]},
  "Skarmory": {
    "overview": "<p>Skarmory's impressive Defense and great typing let it check the many physical attackers in the metagame. Skarmory has the movepool to support its team with entry hazards in Spikes, phazing in Whirlwind, and passive damage in Toxic. Sturdy allows it to get a desperation move if the situation calls for it. However, its subpar HP and Special Defense mean it crumbles to practically any special attack. Skarmory also struggles to fit all of its good utility moves and thus is often extremely passive, relying on Rocky Helmet and Body Press to deal any damage. Skarmory's Flying typing is a double-edged sword, making it neutral to Fighting and immune to Ground but a target for Electric coverage such as Zekrom's Bolt Strike and Xerneas's Thunder. It also faces stiff competition from other defensive Steel-types. Necrozma-DM checks Xerneas much better, Ferrothorn is a less passive Spikes setter and answers Kyogre, and Corviknight can be used as a Defogger.</p> ",
    "comments": "<h1>Other Options</h1> <p>If need be, Skarmory can run Stealth Rock. However, seeing how common other Stealth Rock setters are in the metagame and how difficult it is for Skarmory to find space, it's usually omitted. Defog seems good initially, but Skarmory then competes with Corviknight, which can also Pressure stall the opposition's Stealth Rock PP to come out on top long-term. Moreover, Defog clashes with Spikes. Iron Defense allows Skarmory to hit for significantly more damage with Body Press and counter physical setup sweepers such as Groudon and Necrozma-DM. However, Skarmory's meager base 70 Speed and difficulty finding a move to drop means it's situational at best. Taunt and Toxic can be used in tandem to maximize Skarmory's utility, but running only status moves on a Pokemon this slow means Taunt forces Struggle.</p> <h1>Checks and Counters</h1> <p><strong>Special Attackers: Almost any special attacker can overwhelm Skarmory, so threats such as Xerneas, Calyrex-S, and Kyogre can threaten it out with just their presence. None of them enjoy Toxic, however.</p> <p><strong>Zekrom: Zekrom's Teravolt allows it to bypass Skarmory's Sturdy and OHKO with Life Orb Bolt Strike, but it doesn't enjoy the residual damage it takes from Toxic or entry hazards.</p> <p><strong>Fire-type Attacks</strong>: Ho-Oh, Groudon, and Raquaza can use Fire-type moves to OHKO Skarmory, with the former two carrying a status move to pressure Skarmory's teammates and the latter having a myriad of attacks to break through cores.</p> <p><strong>Eternatus: Eternatus isn't bothered by any of Skarmory's options and can comfortably fire off its strong special attacks to 2HKO it.</p> <p><strong>Taunt</strong>: Skarmory's reliance on status moves makes it a perfect Taunt target for the likes of Yveltal and Mewtwo. They risk taking Toxic on the switch, though.</p> ",
    "sets": [
      {
        "name": "Defensive Spikes",
        "description": "<p>Roost provides reliable recovery to Skarmory, allowing it to consistently check physical attackers. Whirlwind phazes physical setup sweepers, even if they're behind a Substitute. Swords Dance users such as Groudon and Necrozma-DM are prime targets for Whirlwind. Combined with Spikes, it can rack up damage on grounded foes lacking Heavy-Duty Boots. Toxic lets Skarmory punish entry hazard removers such as Yveltal. It also damages common offensive switch-ins such as Ho-Oh and Kyogre. Body Press uses Skarmory's enormous Defense stat, nailing the likes of Yveltal after it uses Roost and Ferrothorn for significant damage. It also is useful in not making Skarmory complete fodder after Taunt. Rocky Helmet provides some much appreciated damage to most physical attackers and helps with Skarmory's passivity.</p> <p>Skarmory struggles with special attackers like Kyogre and Calyrex-S, so teammates such as Eternatus and Blissey are very appreciated. Stealth Rock setters form an entry hazard setting core with Skarmory. Tyranitar can set Stealth Rock and switch into Ho-Oh and Calyrex-S. Tangrowth and Groudon also pair up nicely, being able to take on some of the physical attackers that Skarmory cannot handle, namely Zygarde and Zekrom. Knock Off users such as Yveltal and Necrozma-DM can remove Heavy-Duty Boots, allowing Skarmory's Spikes to put in more work. Despite being a Steel-type, Skarmory can lose to Geomancy Xerneas. Bulky Ho-Oh and other Steel-types such as Necrozma-DM and Ferrothorn can effectively deal with Xerneas. Xerneas itself can either run a Geomancy set to beat Zygarde and Zekrom and benefit from Spikes or a defensive set with Aromatherapy in case Skarmory gets statused.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 50695, "username": "Manaphy"}, {"user_id": 274590, "username": "SiTuM"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Estronic"}, {"user_id": 331519, "username": "CryoGyro"}]}], "writtenBy": [{"user_id": 273339, "username": "Lasen"}]}
  },
  "Porygon2": {"sets": [{"name": "Defensive"}]},
  "Blissey": {"sets": [{"name": "Defensive", "description": "<p>If Confide and Teleport are used together, the ability Healer must be used as Natural Cure, Confide and Teleport are illegal together. These are sample sets that we plan to give more in-depth analysis when the rapidly changing metagame reaches a point of stability. Stay tuned!</p> "}]},
  "Tyranitar": {"sets": [{"name": "Specially Defensive"}]},
  "Lugia": {
    "overview": "<p>Lugia possesses some of the greatest bulk in the metagame backed up by one of the best defensive abilities in Multiscale. Its access to reliable recovery, a great Speed tier, and an extensive support movepool ensures that it can keep itself healthy with relative ease and effectively check various threats such as Zygarde, Groudon, and Rayquaza. Its walling capabilities, however, are entirely dependent on Multiscale, which makes Lugia very hard to utilize considering it must be kept at full health or else risk being taken down by the multitude of fast and strong wallbreakers in the metagame. Lugia also despises all status ailments and must avoid them at all costs, making cleric support with Lugia important and making it a natural fit on stall teams. While Heavy-Duty Boots is a godsend to rid Lugia of its weakness to Stealth Rock, it also means it lacks passive recovery and can't switch in on certain Pokemon it would otherwise beat, such as Landorus, in fear of Knock Off. Lugia's defensive typing also leaves much to be desired, giving it weaknesses to the extremely common Ghost- and Dark-type attacks. It also cannot deal with the best offensive and defensive threats in the metagame, being completely outclassed by Necrozma-DM and Lunala, both of which share Lugia's Psychic-type but have a much better secondary typing in Steel and Ghost, respectively. On more dedicated stall builds, Giratina is bulkier and can provide more for its team.</p> ",
    "comments": "<h1>Other Options</h1> <p>Defog allows Lugia to remove entry hazards so that it can free up a moveslot for another teammate, but since Necrozma-DM, the best Stealth Rock setter in the metagame, doesn't really care about Lugia, it's not advised.</p> <h1>Checks and Counters</h1> <p><strong>Yveltal: Yveltal can often outspeed Lugia and shut it down via Knock Off, Toxic, or Taunt. It doesn't want to switch in on a status move, however.</p> <p><strong>Ghost-types</strong>: Calyrex-S can consistently 2HKO Lugia even through Multiscale, takes little damage from Ice Beam, and can cure itself of status with Aromatherapy. Marshadow can break through Lugia's defenses as well. Giratina can status Lugia with either Will-O-Wisp or Toxic, while Giratina-O can opt for a strong Ghost-type STAB move to deal a ton of damage.</p> <p><strong>Necrozma-DM: Necrozma-DM can hit through Multiscale thanks to Sunsteel Strike, set up Stealth Rock in front of Lugia without fear of much, remove Lugia's Heavy-Duty Boots with Knock Off, or cripple Lugia with Thunder Wave or the rare Toxic. Offensive variants can set up with Dragon Dance in front of Lugia and chunk it with a boosted attack.</p> <p><strong>Steel-types</strong>:Ferrothorn, Skarmory, and Magearna can come in on Lugia and utilize their utility moves for free, whether that's setting up entry hazards, removing them, or providing cleric support, respectively. The former two can even threaten to status Lugia.</p> <p><strong>Residual Damage: Multiscale is the only reason Lugia is even remotely viable, so any way to consistently break it effectively cripples Lugia. Tyranitar's Sand Stream or damage from status conditions makes Lugia way less bulky.</p> ",
    "sets": [
      {
        "name": "Great Wall (Defensive)",
        "description": "<p>Roost is Lugia's most important move, ridding it of its Flying typing and thus its pesky weakness to Ice-, Electric-, and Rock-type attacks while also providing reliable recovery. Whirlwind allows Lugia to phaze out foes like Zygarde that are trying to set up. Ice Beam hits Ground- and Dragon-type foes for a considerable amount of damage, OHKOing Rayquaza after Stealth Rock and 3HKOing Zygarde-C while Lugia shrugs off their attacks. Toxic is Lugia's main way of dealing with the majority of the metagame; it should be used liberally against foes that are not Steel- or Poison-type to whittle them down and stall them out with Lugia's fantastic bulk. Thunder Wave is an option to incapacitate wallbreakers that try to switch in on Lugia, such as Calyrex-S and Urshifu-S, or the aforementioned Steel- and Poison-types, like Necrozma-DM and Eternatus. 96 Speed EVs are utilized so that Lugia can outspeed maximum Speed neutral-natured base 90s like Kyogre and Groudon, as well as maximum Speed Necrozma-DM.</p> <p>Lugia requires heavy team support, as it is extremely passive and is only seen on more stall-oriented builds. A switch-in to Yveltal is paramount, as it outspeeds Lugia and can cripple it with Knock Off, Taunt, or Toxic. Defensive Xerneas and Eternatus are great teammates, able to deal with anything Yveltal throws their way while also acting as consistent answers to Marshadow, a wallbreaker that Lugia cannot deal with. Ghost-types in general are a problem for Lugia, especially Calyrex-S. As such, Yveltal acts as a good answer to them. Lugia struggles against the premier Steel-types of the metagame in Necrozma-DM and Ferrothorn, so teammates that can beat them are appreciated. Physically defensive Eternatus can use Flamethrower to beat them both, shrugging off their hits and PP stalling them with Pressure. Ho-Oh can threaten them with Sacred Fire and can also remove entry hazards for Lugia with Defog if Lugia's Heavy-Duty Boots are removed. It also serves as a switch-in to Calyrex-S and Marshadow, scouting their sets. In return, Lugia can deal with Zygarde and Rayquaza, both of which give Ho-Oh trouble. Cleric support is necessary in case Lugia gets statused, so Blissey and Chansey make perfect teammates, removing status and acting as emergency switch-ins to Ghost-type attacks. Status absorbers such as Rest Zygarde and Giratina also work.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 511624, "username": "Fc"}, {"user_id": 432086, "username": "TrueNora"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Estronic"}, {"user_id": 33374, "username": "Muk"}]}], "writtenBy": [{"user_id": 273339, "username": "Lasen"}]}
  },
  "Ho-Oh": {
    "overview": "<p>Heavy-Duty Boots rids Ho-Oh of its most crippling flaw, its Stealth Rock weakness, making it a critical defensive Pokemon in the metagame. Thanks to Regenerator, its huge Special Defense, and good defensive typing, Ho-Oh is an important glue Pokemon for teambuilding, as it compresses a myriad of roles into one. Ho-Oh is able to check Xerneas lacking Ingrain, Marshadow without a Rock-type move, and be great backup check to Calyrex-S. It is able to consistently switch into Necrozma-DM, the most common Stealth Rock setter in the tier, and use Defog, giving its team good entry hazard control. Offensively, Ho-Oh is no slouch either, as the Choice Band set is underprepared for and is able to punch serious holes into the vast majority of teams. Ho-Oh has become such a metagame-defining force that it's often specifically prepared for in teambuilding; Ho-Oh’s massive weakness to Rock-type attacks can be easy to exploit, and it must constantly be on the lookout for Knock Off and Toxic users.</p> ",
    "comments": "<h1>Other Options</h1> <p>Curse sets are an option, but they generally just get statused or phazed. They are also easy to revenge kill due to their lowered Speed. Roost provides a more consistent source of recovery, although it is generally not needed thanks to Heavy-Duty Boots and Regenerator. Pressure is an option in combination with Roost to PP stall opposing Pokemon, but the opportunity cost of not having Regenerator is a severe detriment. Life Orb sets can be used similarly to how the Choice Band set is used, with the freedom to choose moves. Do note that, even with Regenerator, Life Orb and Brave Bird recoil can add up quickly.</p> <h1>Checks and Counters</h1> <p><strong>Rock-type Moves</strong>: Rock-type moves are often thrown on sets for the sole purpose of taking out Ho-Oh. Meteor Beam Eternatus, Rock Tomb Marshadow, Power Gem Dialga, and Stone Edge Necrozma-DM are a few examples of Pokemon you need to keep in mind when using Ho-Oh.</p> <p><strong>Eternatus: Eternatus doesn’t mind burns and can stall out defensive sets. Physically defensive sets can typically stomach Choice Band Ho-Oh, but specially defensive sets have to be extremely careful around it.</p> <p><strong>Zygarde-C</strong>: Defensive Zygarde-C with Rest will take anything Ho-Oh throws at it and status it in return. However, offensive Zygarde-C sets must be wary of status or a Choice Band Brave Bird on the switch.</p> <p><strong>Kyogre</strong>: Kyogre can come in on Sacred Fire or Defog and then proceed to use its strong attacks.</p> <p><strong>Zekrom</strong>: Zekrom hates status from Ho-Oh, but it is resistant to Ho-Oh’s STAB attacks and can threaten it with a powerful Bolt Strike.</p> <p><strong>Knock Off + Stealth Rock</strong>: Ho-Oh is limited if Stealth Rock has been set up, as it then needs to be wary of Knock Off from Pokemon like Yveltal, Necrozma-DM, Ferrothorn, and Tangrowth. Certain Stealth Rock setters, such as Groudon and Tyranitar, do not mind Ho-Oh switching in. Stealth Rock heavily limits Choice Band Ho-Oh.</p> <p><strong>Toxic: While the threat of Toxic is lowered thanks to Regenerator, its damage can add up, especially in late-game scenarios. The residual damage can prevent Ho-Oh from checking threats it otherwise could. Eternatus, Yveltal, Necrozma-DM, and opposing Ho-Oh all can badly poison Ho-Oh.</p> ",
    "sets": [
      {
        "name": "Defensive",
        "description": "<p>This is the standard Ho-Oh set. Sacred Fire is a great STAB attack, and it has an impressive 50% burn chance. However, you should be careful about using it, as its PP is low—and even lower against Eternatus switch-ins. Ho-Oh is a great user of Defog, as it is able to repeatedly come into Necrozma-DM. Toxic is a good option to stall out Pokemon that don’t particularly mind burns or are immune to them, such as Yveltal and opposing Ho-Oh. Thunder Wave is a great option for Eternatus, which is a very common switch-in that is immune to Toxic and not bothered by burns. Whirlwind is to phaze Xerneas, although it also has its uses for other setup sweepers such as Zygarde-C, Cosmic Power Eternatus, and Calyrex-S. However, you need to watch out for Ingrain Xerneas. Brave Bird is a strong secondary STAB option that hits Fire-resistant Pokemon like Eternatus and Kyogre much harder, and it helps with Sacred Fire's low PP. The given EV spread allows Ho-Oh to always survive a +2 Xerneas's Thunder, with the leftover EVs put into Defense to better deal with physical attackers such as Marshadow. If you run Thunder Wave, a spread of 248 HP / 192 Def / 52 SpD / 16 Spe should be used to let Ho-Oh outspeed Choice Specs Calyrex-S after paralysis.</p> <p>Smart switching is the key to using this set, both in terms of Regenerator recovery and scouting for status or Rock-type coverage moves. Marshadow, Xerneas, and Calyrex-S are too threatening to leave Ho-Oh as your only check to them. Choice Band Marshadow can 2HKO with Poltergeist or Spectral Thief, while Xerneas can threaten to KO Ho-Oh with a boosted Thunder if Ho-Oh has taken damage, or use Ingrain to prevent Ho-Oh from phazing it. Choice Specs Calyrex-S will 2HKO Ho-Oh outright. As such, Pokemon such as Yveltal, Necrozma-DM, Zarude, Buzzwole, Lunala, and Tangrowth make good defensive partners. Necrozma-DM can provide a solid defense against Ice-Types, Offensive Eternatus, and Xerneas, as well as give Stealth Rock and status support, while Yveltal will keep Calyrex-S at bay. Lunala, Buzzwole, and Tangrowth also offer good defense against Groudon, Zekrom, and Zygarde-C, while the latter two offer a good pivot against Marshadow. Eternatus and Blissey are excellent teammates for their ability to switch into Kyogre. All of the aforementioned Pokemon appreciate Ho-Oh's ability to serve as a backup check to the tier's biggest sweepers, as well as Defog. Zarude in particular likes Ho-Oh’s ability to Defog, as Zarude often replaces Yveltal on teams, and in return, Zarude can role compress a Calyrex-S check and Ground-type check into one. Ho-Oh can consistently switch into entry hazard setters such as Necrozma-DM and Ferrothorn and force them out, even if they hit it with Knock Off. However, if Ho-Oh hard switches into these Pokemon every time, it can becomd predictable and be taken advantage of by double switches. Ho-Oh must be wary of alternative setters of Stealth Rock, such as Groudon and Tyranitar. Having a secondary Defog user, such as Yveltal, can be useful for providing more security against such Pokemon, as well as against Sticky Web and other offensive playstyles, depending on your team structure. Alternatively, Ho-Oh can be used to free up moveslots on Pokemon such as Yveltal and Necrozma-DM, who now don’t need to run Defog or check Xerneas, respectively.</p> "
      },
      {
        "name": "Choice Band",
        "description": "<p>Choice Band Ho-Oh is one of the best wallbreakers in the tier, with most teams having to resort to offensive pressure, soft checks, and status to try to stop it. Brave Bird does massive damage to anything that resists Sacred Fire, and its recoil is minimized thanks to Regenerator. Earthquake rounds out Ho-Oh's coverage and is its strongest option against Eternatus and Zekrom. The last move is flexible. Whirlwind is generally preferred, as it gives Ho-Oh more defensive utility in phazing opposing Ho-Oh and Zygarde-C in a pinch. Flare Blitz does massive damage and is stronger than Sacred Fire; it also makes up for Sacred Fire’s low PP. Defog can be used in emergency situations to clear away Stealth Rock. The given EVs allow Ho-Oh to survive a +2 Xerneas Thunder, with the remaining EVs put into Attack to maximize Ho-Oh’s power. 16 Attacks EVs can be moved to Speed to make Ho-Oh faster than a paralyzed Calyrex-S. It's not advisable to go much faster than this, though, because Choice Band Ho-Oh functions best as an offensive tank, and it would rather not lose significant breaking power or the ability to check special threats.</p> <p>While this set is immensely strong, the major flaw is its vulnerability to Stealth Rock. Because of this, Choice Band Ho-Oh is usually a Pokemon that teams specifically build around. At least two Defog users are recommended: Yveltal, Lunala, Xerneas, Giratina, and Corviknight are good possible partners. Xatu is notable for having Magic Bounce and being able to switch into Stealth Rock setters such as Necrozma-DM repeatedly. Additionally, teammates that can lure and break through defensive Zygarde-C are appreciated. Groudon is a good partner for this, and it can also provide sun to make Ho-Oh even stronger and to lower Thunder's accuracy. Teammates that like Eternatus being gone, such as Marshadow, synergize well, as this set often breaks through Eternatus.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 511624, "username": "Fc"}, {"user_id": 222996, "username": "Minority"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}, {"user_id": 33374, "username": "Muk"}]}], "writtenBy": [{"user_id": 50695, "username": "Manaphy"}]}
  },
  "Shedinja": {"sets": [{"name": "Wonder Guard"}]},
  "Kyogre": {"sets": [{"name": "Choice Specs"}, {"name": "Choice Scarf"}, {"name": "Bulky Calm Mind"}]},
  "Groudon": {"sets": [{"name": "Double Dance"}, {"name": "Defensive Support"}, {"name": "Bulky Swords Dance"}]},
  "Rayquaza": {"sets": [{"name": "Dragon Dance"}, {"name": "Swords Dance"}, {"name": "Choice Band"}]},
  "Gastrodon": {"sets": [{"name": "Defensive"}]},
  "Tangrowth": {"sets": [{"name": "Defensive Pivot"}]},
  "Froslass": {
    "overview": "<p>Froslass is one of the premier entry hazard setters and dedicated leads in the tier. By virtue of its base 110 Speed and access to useful utility moves like Spikes, Taunt, and Destiny Bond, Froslass distinguishes itself as a more viable option than other Spikes setters like Mew and Cloyster. Icy Wind also allows it to slow down faster threats and prevent them from using Defog via Taunt or potentially trade with them via Destiny Bond. However, Froslass’s rather low bulk leaves it vulnerable to being easily KOed. Additionally, Froslass has difficulty defeating common Sticky Web setters on hyper offense teams like Slurpuff and Mental Herb Shuckle. Furthermore, although base 110 Speed is adequate, faster threats like Calyrex-S and Zacian can use Substitute in front of Froslass and proceed to cause problems to the hyper offense teams it is commonly utilized on.</p> ",
    "comments": "<h1>Other Options</h1> <p>Other status moves like Thunder Wave and Will-O-Wisp can be run over Destiny Bond or Icy Wind if a particular team benefits from it. However in most cases, this is suboptimal. Poltergeist can be used over Icy Wind or Shadow Ball as an option for a stronger attacking move. In this case, a Jolly Nature should be utilized instead.</p> <h1>Checks and Counters</h1> <p><strong>Faster Offensive Threats</strong>: Faster offensive threats like Calyrex-S and Zacian can take advantage of Froslass to use Substitute and potentially sweep hyper offense teams it is commonly featured on.</p> <p><strong>Ho-Oh: Thanks to Sacred Fire, Ho-Oh has a 50% chance of burning Froslass, negating its ability to potentially trade via Destiny Bond, and proceed to remove the entry hazards Froslass has set up with Defog.</p> <p><strong>Status Moves</strong>: Status moves like Toxic and Will-O-Wisp can bypass Focus Sash and make Froslass susceptible to being KOed before it gets to lay more than one layer of Spikes. Alternatively, Thunder Wave greatly reduces Froslass's overall effectiveness at setting up entry hazards and trading with a problematic foe.</p> <p><strong>Anti-Entry Hazard Pokemon</strong>: Faster users of Taunt such as Aerodactyl can completely prevent Froslass from setting up Spikes. Magic Coat leads like Slurpuff force mind games and can potentially bounce back Froslass's entry hazards and Taunt, putting its teammates in an extremely disadvantageous position. Furthermore, Magic Bounce users like Xatu can prevent Froslass from setting up Spikes, although it can 2HKO Xatu with Icy Wind.</p> ",
    "sets": [
      {
        "name": "Suicide Lead",
        "description": "<p>Taunt prevents slower Defoggers from removing Spikes, while Destiny Bond is used in conjunction with Taunt to potentially force a trade with an opposing threat. Finally, the attacking move of choice comes down to personal preference. In most cases, the speed control that Icy Wind provides offers more benefit and utility to the hyper offense teams that Froslass is commonly run on. However, Shadow Ball can be used over Icy Wind if Magic Bounce users like Xatu are a concern or if Substitute variants of Calyrex-S pose an issue to the team Froslass is being utilized on. Cursed Body could prove situationally useful, especially when facing Choice-locked foes. Maximum Speed EVs and a Timid nature are utilized to guarantee that Froslass outspeeds as many threats as possible while almost always setting up at least one layer of Spikes</p> <p>As Froslass is commonly featured on hyper offense teams, potential team options include offensive threats like Zacian and Zekrom, which pressure and overwhelm the Defoggers commonly found in the tier. Yveltal is another great partner to pair with Froslass, as it has access to Taunt, which can prevent slower Defoggers from removing any entry hazards Froslass set up. Additionally, Froslass can be paired with another entry hazard setter like Slurpuff or a screens setter like Grimmsnarl or Regieleki to form a utility core that allows a variety of setup sweepers like Dragon Dance Necrozma-DM, Geomancy Xerneas, Swords Dance Zacian, Dragon Dance Zekrom, and Double Dance Groudon to sweep more easily. Air Balloon can be run on any of the aforementioned sweepers if the matchup against Sticky Web teams is a concern. Furthermore, it should be noted that Froslass struggles against leads on Sticky Web teams such as Slurpuff and Mental Herb Shuckle. Thus, pairing Froslass with a fast Rapid Spin user like Pheromosa or Regieleki would greatly benefit the removal of entry hazards and facilitate a potential sweep from one of Froslass's teammates.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 511624, "username": "Fc"}, {"user_id": 50695, "username": "Manaphy"}]}, {"name": "Grammar checked by", "members": [{"user_id": 449990, "username": "DC"}, {"user_id": 232216, "username": "Lumari"}]}], "writtenBy": []}
  },
  "Dialga": {"sets": [{"name": "Support"}, {"name": "Choice Specs"}]},
  "Palkia": {"sets": [{"name": "All-Out-Attacker"}, {"name": "Defensive"}]},
  "Heatran": {"sets": [{"name": "Specially Defensive"}]},
  "Giratina": {"sets": [{"name": "Defensive"}]},
  "Giratina-Origin": {"sets": [{"name": "Physical Attacker"}, {"name": "Mixed Attacker"}]},
  "Excadrill": {"sets": [{"name": "Hazard Lead"}, {"name": "Sand Rush"}]},
  "Darmanitan-Galar": {"sets": [{"name": "Choice Scarf"}, {"name": "Belly Drum"}]},
  "Amoonguss": {"sets": [{"name": "Defensive"}]},
  "Galvantula": {"sets": [{"name": "Sticky Webs Setter"}]},
  "Ferrothorn": {"sets": [{"name": "Defensive"}]},
  "Reshiram": {
    "overview": "<p>Reshiram possesses a good offensive typing, great offensive stats, and an acceptable Speed tier, making it an extremely potent wallbreaker. It takes advantage of the prevalence of defensive Steel-types to blow holes through foes. However, Reshiram's typing is often a detriment defensively. Reshiram is susceptible to all entry hazards and weak to Stealth Rock, making it extremely easy to chip down. Its neutrality to Water means that other Dragon-types such as Eternatus and Palkia can fit onto teams much more easily. Similarly, Ho-Oh can take on Xerneas's Moonblast much better, leaving Reshiram's defensive capabilities completely overshadowed. All in all, Reshiram's biggest problem is the opportunity cost of running it on a team.</p> ",
    "comments": "<h1>Other Options</h1> <p>Heavy-Duty Boots removes Reshiram's weakness to entry hazards, particularly Stealth Rock. However, Reshiram prefers to maximize its damage with Life Orb. Reshiram can utilize Choice Scarf or Choice Specs to become a revenge killer or an even scarier wallbreaker, but being locked into Blue Flare or Draco Meteor leaves it easily checked by Kyogre and Xerneas, respectively. Toxic is an option to wear down some of Reshiram's checks, such as Tyranitar and Ho-Oh, for both Reshiram and its teammates, but the chance to OHKO Ho-Oh with Stone Edge instead is usually too good to pass up. Fighting-type coverage in Body Press or Focus Blast helps Reshiram take on Blissey and Tyranitar. Body Press 2HKOes both Pokemon after Stealth Rock, while Focus Blast can OHKO Tyranitar with some prior chip damage.</p> <h1>Checks and Counters</h1> <p><strong>Entry Hazards: Entry hazards, particularly Stealth Rock, limit Reshiram, as it gets chipped down extremely easily.</p> <p><strong>Revenge Killers</strong>: Calyrex-S, Choice Scarf Kyogre, and offensive Eternatus can all force Reshiram out by threatening to OHKO it.</p> <p><strong>Kyogre: Kyogre can set up rain to weaken Blue Flare's power, and bulkier sets can stomach a Draco Meteor. Offensive variants don't like the heavy damage that Draco Meteor inflicts on them, though.</p> <p><strong>Blissey</strong>: Blissey can take any one of Reshiram's attacks and recover its lost HP with Soft-Boiled while Reshiram aimlessly wastes its PP. It has to be wary of the rare Body Press, however.</p> <p><strong>Lunala</strong>: Lunala can both outspeed Reshiram and take on any of its hits, recovering off all the damage it has taken with Roost.</p> <p><strong>Tyranitar</strong>: Tyranitar can safely take on Reshiram's attacks and threaten it with Rock Blast or cripple it with Thunder Wave, but its lack of reliable recovery forces it to be cautious as to when it switches in, and it gets nailed by uncommon Fighting-type coverage.</p> ",
    "sets": [
      {
        "name": "Life Orb",
        "description": "<p>Blue Flare is Reshiram's primary attack, threatening almost all foes and breaking through the common defensive Steel-types of the metagame, with its only downside being its 85% accuracy. It can OHKO physically defensive Necrozma-DM and is guaranteed to 2HKO specially defensive Yveltal as well as Xerneas. Draco Meteor is also extremely powerful and hits the foes that resist Blue Flare, such as Eternatus, Tyranitar, and Kyogre. Roost allows Reshiram to recover in front of the Steel-types that it threatens out. Stone Edge OHKOes Ho-Oh with a roll or with prior damage. Maximum Speed with a Naive nature ensures that Reshiram Speed ties with other base 90s, giving it more opportunities to get its strong attacks off.</p> <p>Reshiram fits best on more offensive teams, playing the role of stallbreaker. It appreciates entry hazard support to soften its checks: Spikes from Cloyster or Froslass can put specially defensive Necrozma-DM and Geomancy Xerneas in OHKO range of Blue Flare. It also puts Zekrom in OHKO range of -2 Draco Meteor. Groudon is a fantastic partner for Reshiram, setting up sun to boost its Blue Flare, setting up Stealth Rock, answering Ground- and Rock-type attacks thrown its way, and paralyzing foes so that Reshiram can outspeed them. In return, Reshiram can threaten opposing Groudon and Zygarde with its attacks. Outside of hyper offense, Defog support from Yveltal or Ho-Oh is paramount, as Reshiram is extremely easy to chip down between its weakness to Stealth Rock and Life Orb recoil. Yveltal in particular can use Taunt to stop entry hazards from being set up.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 50695, "username": "Manaphy"}, {"user_id": 432086, "username": "TrueNora"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}, {"user_id": 33374, "username": "Muk"}]}], "writtenBy": [{"user_id": 273339, "username": "Lasen"}]}
  },
  "Zekrom": {
    "overview": "<p>Zekrom is one of the tier's best wallbreakers, wielding a terrifying Electric / Dragon STAB combination and access to Dragon Dance to further enhance its already great Attack and serviceable Speed. The vast number of Flying- and Dragon-types that dominate the metagame makes Zekrom a very scary prospect for any team without a dedicated answer to it. Moreover, Zekrom can be tailored to beat some of its checks, leaving the opponent to guess what move rounds out its moveset. Zekrom is also a potent stallbreaker thanks to its signature ability, Teravolt, which allows it to break walls such as Multiscale Lugia and Shedinja. However, without a Speed boost, Zekrom is easily outsped and disposed of by the multitude of Fairy- and Dragon-types in the metagame. Even with a Speed boost, it contests with common Choice Scarf users that either Speed tie with it such as Kyogre or outspeed it such as Calyrex-S and Yveltal, and Ditto, all of which OHKO it.</p> ",
    "comments": "<p>Other Options</p> <p>=============</p> <p>Giving Zekrom an Air Balloon allows it to set up Dragon Dance in front of some of its common checks, such as Necrozma-DM and Groudon, especially on teams that can set Reflect for it. Similarly, Magnet Rise lets Zekrom completely invalidate any Ground-type move thrown its way, but most Ground-types can still deal with it such as Roar or Toxic from Groudon and Thousand Arrows from Zygarde-C hitting regardless. Weather Ball with a Naive nature is an option when paired up with Groudon to hit the various Grass-types that wish to switch in like Tangrowth and Ferrothorn, but it requires Zekrom to come in while sun is still up and is also very prediction heavy. Outrage blows past Zygarde prior to Power Construct activating and has a much higher damage output against all targets, but the abundance of Fairy-types in the metagame means Zekrom being locked into it will end with it getting KOed the very next turn. A damage-reducing Berry in either Roseli or Shuca to sponge a Fairy- or Ground-type move respectively will let Zekrom take an otherwise super effective move, thus limiting the chances the opponent has of revenge killing it.</p> <h1>Checks and Counters</h1> <p><strong>Groudon: Groudon can take on Zekrom's physical hits with ease and threaten it out with its Ground-type attack. However, it needs to be wary of Draco Meteor.</p> <p><strong>Revenge Killers</strong>: Excadrill in sand and Choice Scarf Calyrex-S and Yveltal can all outspeed Zekrom and have a consistent way to OHKO it. Yveltal can also pick off a weakened Zekrom with Sucker Punch.</p> <p><strong>Dialga: Dialga resists Bolt Strike and, regardless of bulk investment, can take Zekrom's +1 Dragon Claw while threatening to OHKO it back with a strong Dragon-type move. If it's not invested in bulk, however, it must be wary of the rare Outrage.</p> <p><strong>Bulky Grass-types</strong>: Physically defensive Ferrothorn and Tangrowth can both switch into Zekrom, with the former being able to chip it slowly with Leech Seed and Iron Barbs or even boost alongside it, while the latter can use a Ground-type coverage move such as Earthquake or Bulldoze to dispose of it.</p> <p><strong>Lunala</strong>: Lunala outspeeds and can always switch in on Zekrom and take a boosted hit thanks to Shadow Shield. It can then cripple Zekrom with Will-O-Wisp, phaze it with Roar, or 2HKO it with Ice Beam or Moongeist Beam.</p> ",
    "sets": [
      {
        "name": "Dragon Dance",
        "description": "<p>Dragon Dance boosts Zekrom's already stellar damage output while also boosting its Speed so that it can outspeed fast revenge killers such as Calyrex-S, Palkia and Eternatus. A Jolly nature is run over Adamant to outspeed Calyrex-S. Bolt Strike allows Zekrom to secure 2HKOs against neutral targets such as Necrozma-DM while also guaranteeing OHKOs against Xerneas. Dragon Claw breaks past the Dragon-types that resist Bolt Strike. The final moveslot is open for what you wish to have Zekrom accomplish. Roost lets Zekrom stay healthy while getting chipped by its Life Orb and also provides some much-appreciated recovery on a predicted double switch, while Draco Meteor can be run with a Naive nature to deal with physical walls such as Groudon and Tangrowth that can stomach any other hit and force Zekrom out. A set combining Substitute and Leftovers aims to minimize the chance of Zekrom getting statused while also protecting it from Ferrothorn's Leech Seed.</p> <p>Zekrom appreciates being paired up with special attackers like Xerneas and Kyogre that can break past Zekrom's checks such as Groudon, physically defensive Ferrothorn, and Lunala, while they benefit from Zekrom threatening their respective checks. Sticky Web setters such as Shuckle and Slurpuff mitigate the need for Zekrom to boost its Speed and instead allow it to attack the opposition without fear of being outsped while also making Choice Scarf Calyrex-S outsped by a boosted Zekrom. Spikes support from the likes of Froslass and Ferrothorn punishes switching from the opponent, slowly whittling their team down. Ferrothorn in particular is a fantastic partner, as removing foes' items in a tier where Heavy-Duty Boots is prevalent makes hazard stacking an even more potent strategy.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 50695, "username": "Manaphy"}, {"user_id": 222996, "username": "Minority"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}, {"user_id": 302985, "username": "lotiasite"}]}], "writtenBy": [{"user_id": 273339, "username": "Lasen"}]}
  },
  "Landorus": {"sets": [{"name": "Wallbreaker"}]},
  "Landorus-Therian": {"sets": [{"name": "Defensive"}, {"name": "Choice Scarf"}]},
  "Kyurem-Black": {
    "overview": "<p>Kyurem-B is a niche Dragon Dance sweeper. It differentiates itself from other Dragon Dance sweepers like Zygarde-C and Zekrom through its Ice typing, which allows it to hit Ground-types such as Groudon and Zygarde-C super effectively. Neutrality to Ice Beam and access to Fusion Bolt also give it a better matchup against Kyogre than Dragon Dance Zygarde. However, Kyurem-B struggles to break through defensive Necrozma-DM, a very common threat. A Stealth Rock weakness and bad defensive typing negate any defensive utility Kyurem-B can bring, and it struggles to set up against faster foes like Eternatus and Xerneas that are able to outspeed and OHKO it. Even against passive and weaker Pokemon like Tangrowth and defensive Yveltal, Kyurem-B must be wary of status and utility moves, such as Sleep Powder and Foul Play.</p> ",
    "comments": "<h1>Other Options</h1> <p>Heavy-Duty Boots can be run to avoid entry hazards, notably Stealth Rock. However, as Kyurem-B is mainly run on hyper offense teams, which don't have much switching involved, other items are preferred.</p> <h1>Checks and Counters</h1> <p><strong>Necrozma-DM</strong>: Kyurem-B has a hard time dealing with defensive Necrozma-DM. It is bulky enough to take even +1 Fusion Bolt, can heal itself with Moonlight, and can threaten Kyurem-B with Sunsteel Strike. Furthermore, Necrozma-DM is one of the premier Stealth Rock setters in the metagame and can set up Stealth Rock without much trouble against Kyurem-B, preventing it from finding other opportunities to set up. However, offensive sets are less bulky and can be weakened heavily due to their lack of recovery.</p> <p><strong>Physically Defensive Walls</strong>: Buzzwole and defensive Xerneas aren't resistant to Ice but are bulky enough to tank a boosted Icicle Spear and hit back with Drain Punch and Moonblast, respectively. Lunala is faster than unboosted Kyurem-B and can cripple it with Will-O-Wisp, though it must be wary of a boosted Kyurem-B.</p> <p><strong>Offensive Pressure: Kyurem-B is slow without a boost. As such, moves like Eternatus's Dynamax Cannon and Marshadow's Close Combat can keep Kyurem-B in check by applying too much offensive pressure for it to be able to set up. Similarly, Stealth Rock can turn 3HKOs into 2HKOs and 2HKOs into OHKOs, like with defensive Ho-Oh's Brave Bird and Choice Specs Kyogre's Origin Pulse, respectively.</p> <p><strong>Revenge Killers: Choice Scarf users such as Calyrex-S, Xerneas, and Ditto can revenge kill Kyurem-B even after a Dragon Dance boost. Priority moves like Marshadow's Shadow Sneak and Urshifu-S's Sucker Punch can also revenge kill Kyurem-B if it is sufficiently weakened.</p> ",
    "sets": [
      {
        "name": "Dragon Dance",
        "description": "<p>After a Dragon Dance, Icicle Spear can almost always OHKO foes like Eternatus and Yveltal. In addition, Icicle Spear hits through Dragon Dance Zygarde-C's Substitute, allowing Kyurem-B to soft check it. Fusion Bolt is mandatory coverage, as it OHKOes Kyogre and is Kyurem-B's best move against Necrozma-DM. Roost lets Kyurem-B heal from chip damage and allows it to set up against defensive Groudon lacking Thunder Wave. Alternatively, Substitute lets Kyurem-B set up against passive Pokemon such as Tangrowth. It should be used alongside Leftovers so Kyurem-B can use Substitute several times in a game. Life Orb maximizes Kyurem-B's damage, allowing it to OHKO defensive Kyogre and OHKO Calyrex-S with only three hits from Icicle Spear. A Jolly nature is necessary to outspeed non-Choice Scarf Calyrex-S after a Dragon Dance.</p> <p>Kyurem-B is mostly relegated to hyper offense teams that are looking for a Dragon Dance sweeper with utility against Ground-types. Grimmsnarl can set dual screens with Prankster, allowing Kyurem-B and its teammates to set up more easily; similarly, a Stealth Rock setter like Excadrill or Mew can help to weaken the opposition for the team. Xerneas can form a good core with Kyurem-B, each weakening defensive Necrozma-DM for the other. Other offensive Pokemon like Marshadow, Meteor Beam Eternatus, and Calyrex-S can weaken the opposition for Kyurem-B.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 511624, "username": "Fc"}, {"user_id": 222996, "username": "Minority"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Estronic"}, {"user_id": 33374, "username": "Muk"}]}], "writtenBy": [{"user_id": 464398, "username": "LBDC"}]}
  },
  "Kyurem-White": {"sets": [{"name": "Life Orb"}, {"name": "Choice Specs"}]},
  "Genesect": {"sets": [{"name": "Choice Scarf"}]},
  "Slurpuff": {"sets": [{"name": "Webs Lead"}]},
  "Xerneas": {
    "overview": "<p>With Fairy Aura and Geomancy boosting its already strong Moonblast, Xerneas can become one of the most dangerous offensive sweepers in the metagame. Its coverage and utility options to prevent certain checks from beating it are all very great, giving it both versatility and effectiveness in all of its moveslots. Xerneas has fairly high natural bulk with a good typing, letting it also potentially wall many dangerous wallbreakers such as Zekrom, Zygarde, and Marshadow. Most of Xerneas's offensive power comes from Geomancy, though, meaning that if it is phazed or otherwise forced out, its effectiveness offensively is severely hurt, and defensive sets without it struggle to break through most walls in general.</p> ",
    "comments": "<h1>Other Options</h1> <p>Psyshock works as an option on Geomancy variants, letting Xerneas reliably break through Blissey and Amoonguss. This comes with Xerneas losing one of its utility options, all of which are very good, giving it a heavy opportunity cost. Focus Blast is similarly a usable coverage option, but it only hits a few targets like Ferrothorn. Defensive Xerneas can run Heavy-Duty Boots as the item, benefitting from it long term against entry hazard chip damage. The lack of recovery is quite noticeable, though, as Xerneas really likes recovering without having to use Rest. Xerneas can also opt to run a Choice Scarf set with Moonblast, Aromatherapy, Thunder Wave, and Defog, making it a fast revenge killer and support Pokemon with cleric and hazard control abilities. This set doesn't have the power backing of Geomancy or the bulk of defensive sets, though, making it harder to fit on teams overall.</p> <h1>Checks and Counters</h1> <p><strong>Necrozma-DM: Necrozma-DM is the premier Steel-type in the tier, and one of the best Xerneas checks. Specially defensive sets are able to beat even boosted Xerneas, and physically defensive and offensive sets can live a boosted hit and use Sunsteel Strike for massive damage if not an OHKO.</p> <p><strong>Special Walls</strong>: Blissey, Assault Vest Amoonguss, and Ferrothorn are all very strong checks to Xerneas given its standard moveset lacking coverage for them, chipping it down and removing Geomancy boosts with Blissey's Confide or Amoonguss's Clear Smog. Defensive Xerneas also is completely unable to break through these Pokemon, allowing them to easily take advantage of it.</p> <p><strong>Phazing</strong>: With offensive Xerneas's reliance on Geomancy for breaking many common defensive Pokemon, phazing effectively neutralizes it as a threat. Ho-Oh is the best at this role, with Lunala and Lugia also having the potential to stop its sweep.</p> <p><strong>Shedinja: Xerneas can only hit Shedinja with extremely niche moves.</p> ",
    "sets": [
      {
        "name": "Geomancy",
        "description": "<p>Power Herb Xerneas is a very dangerous sweeper, using its high Special Attack and Fairy Aura-boosted Moonblast to sweep teams after a Geomancy. Thunder is useful coverage for foes that shrug off Moonblast, most importantly Ho-Oh and Necrozma-DM. Substitute, Ingrain, and Aromatherapy are all very good support moves to complement the rest of its moveset. Substitute blocks potentially deadly status and lets Xerneas take any hit that could normally KO it, Ingrain prevents phazing and gives slight passive recovery—which can be crucial in the Ho-Oh matchup, and Aromatherapy clears status for Xerneas and its team, which is always beneficial with those being very common on Pokemon such as Eternatus and Necrozma-DM. 88 Speed EVs outrun Adamant Necrozma-DM with maximum Speed investment, as well as Jolly Marshadow if Xerneas switched into Sticky Web before using Geomancy. Leftover EVs go into Defense instead of HP because Geomancy already makes Xerneas very specially bulky.</p> <p>Strong special walls and Moonblast-resistant foes are some of the hardest obstacles for Xerneas. Physically offensive Yveltal with Taunt and Knock Off can support it on hyper offense teams, pressuring Blissey, Necrozma-DM, and Ho-Oh, removing Heavy-Duty Boots from the latter as to greatly hurt its longevity against Xerneas. Xerneas's incredible offensive presence lets it function well with a multitude of breakers to form a strong offensive core. Groudon and Zekrom add physically offensive pressure to complement Xerneas's special offense. Zygarde and Lunala are commonly used to check Groudon, which Xerneas can pressure, and Lunala and Necrozma-DM are common checks to Zekrom, which Zekrom and Xerneas can both work to overwhelm. Strong special lures on bulkier teams can assist Xerneas in sweeping also, working to overwhelm certain checks; Choice Specs Power Gem Dialga and Trick Calyrex-S can bait in and break down Ho-Oh, giving Xerneas a much easier time sweeping.</p> "
      },
      {
        "name": "Defensive",
        "description": "<p>RestTalk with Moonblast gives defensive Xerneas both the longevity and the ability to pressure certain offensive Pokemon that it needs to, letting it much more reliably beat targets like Zekrom, Marshadow, and Zygarde. Aromatherapy is amazing, as Sleep Talk can select it to wake Xerneas up early, while Defog is always welcome for entry hazard control, even though Xerneas loses to common hazard setters such as Necrozma-DM and Ferrothorn. Thunder Wave can sometimes be crucial for slowing down fast offensive threats. 252 Defense EVs lets Xerneas handle its main targets, with Leftovers for even more healing against them.</p> <p>Defensive Xerneas struggles to break through a lot of common defensive Pokemon, meaning it requires a good amount of offensive presence to support its passiveness. Necrozma-DM, Ho-Oh, Eternatus, and Blissey can all easily wall it, making Pokemon such as Zekrom, Dragon Dance Zygarde, and Marshadow incredible offensive partners to pressure these checks that also benefit from Aromatherapy. Xerneas also can't check a lot of Pokemon by itself, with threats such as Necrozma-DM and Calyrex-S being incredibly scary to face. Other defensive pivots that cover these Pokemon, most notably Yveltal for the former two and Ho-Oh to soft check all three, are greatly appreciated. Xerneas checking such dangerous threats as Zekrom and Zygarde is greatly appreciated by many defensive and offensive Pokemon alike weak to them. Ferrothorn can afford to run a specially defensive set to check Kyogre, since it doesn't have to work on beating those two Dragon-types, and Necrozma-DM is freed up a lot from not having to check Zekrom, so it can instead run a specially defensive set to cover bigger threats to it and Xerneas such as offensive Eternatus.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 50695, "username": "Manaphy"}, {"user_id": 274590, "username": "SiTuM"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}, {"user_id": 301217, "username": "Bandkrook"}]}], "writtenBy": [{"user_id": 511624, "username": "Fc"}]}
  },
  "Yveltal": {"sets": [{"name": "Specially Defensive", "description": "<p>Alternative spread of 72 HP / 252 SpD / 184 Spe with a Timid nature and Foul Play over Knock Off can be used in order to act as a Groudon check. If running U-turn, an alternative spread of 248 HP / 32 Atk / 228 SpD with an Adamant nature should be used, in order to break Calyrex-S's Substitute with U-turn. These are sample sets that we plan to give more in-depth analysis when the rapidly changing metagame reaches a point of stability. Stay tuned!</p> "}, {"name": "Special Oriented Attacker"}, {"name": "Physical Attacker"}, {"name": "Choice Scarf"}, {"name": "Choice Band"}]},
  "Zygarde": {"sets": [{"name": "Dragon Dance"}, {"name": "Defensive"}, {"name": "Thousand Waves"}]},
  "Toxapex": {"sets": [{"name": "Physically Defensive"}]},
  "Tapu Bulu": {"sets": [{"name": "Defensive"}]},
  "Solgaleo": {"sets": [{"name": "Specially Defensive"}]},
  "Lunala": {"sets": [{"name": "Defensive"}, {"name": "Power Herb"}]},
  "Buzzwole": {"sets": [{"name": "Physical Wall"}]},
  "Pheromosa": {"sets": [{"name": "Choice Band"}, {"name": "Offensive Pivot"}]},
  "Necrozma-Dusk-Mane": {"sets": [{"name": "Physically Defensive"}, {"name": "Defensive Dragon Dance"}, {"name": "Specially Defensive"}, {"name": "Offensive Dragon Dance"}]},
  "Necrozma-Dawn-Wings": {"sets": [{"name": "Power Herb"}]},
  "Magearna": {"sets": [{"name": "Specially Defensive"}]},
  "Marshadow": {"sets": [{"name": "Life Orb Attacker"}, {"name": "Choice Band"}]},
  "Naganadel": {"sets": [{"name": "Nasty Plot"}]},
  "Corviknight": {"sets": [{"name": "Physically Defensive"}]},
  "Grimmsnarl": {"sets": [{"name": "Dual Screens"}]},
  "Dracovish": {"sets": [{"name": "Choice Attacker"}]},
  "Zacian": {"sets": [{"name": "Choice Band"}, {"name": "Swords Dance"}]},
  "Zamazenta": {"sets": [{"name": "Choice Band"}]},
  "Zamazenta-Crowned": {"sets": [{"name": "Howl"}]},
  "Eternatus": {"sets": [{"name": "Specially Defensive"}, {"name": "Offensive"}]},
  "Urshifu": {"sets": [{"name": "Choice Band"}, {"name": "Bulk Up"}, {"name": "Choice Scarf"}]},
  "Zarude": {"sets": [{"name": "Defensive"}]},
  "Regieleki": {"sets": [{"name": "Offensive Hazard Control"}, {"name": "Electric Terrain Abuser"}]},
  "Spectrier": {"sets": [{"name": "Substitute"}]},
  "Calyrex-Ice": {"sets": [{"name": "Choice Band"}, {"name": "Substitute Attacker"}, {"name": "Trick Room"}]},
  "Calyrex-Shadow": {"sets": [{"name": "Choice Specs"}, {"name": "Choice Scarf"}, {"name": "Substitute + Leech Seed"}, {"name": "Nasty Plot"}]}
}