{
  "Venusaur": {
    "overview": "<p>Venusaur is an excellent Grass-type attacker when paired with sun setters like Torkoal. With a Chlorophyll boost, it can outspeed some of the metagame's fastest threats like Regieleki, Pheromosa, and Dragapult. Venusaur has an incredible offensive and supportive presence, as it can either wear down foes over the course of a game with G-Max Vine Lash and immobilize threats with a fast Sleep Powder. It also has access to both Max Quake and Max Ooze to boost its Special Defense and Special Attack in addition to its already great natural bulk. It's this wide array of options that can make Venusaur very hard to predict against. However, Venusaur is far less effective if sun is not active, meaning it can struggle against Pokemon with ways to change the weather like Pokemon with access to Max Rockfall or Max Hailstorm. Additionally, Sleep Powder's poor accuracy means that misses will occur somewhat often, putting Venusaur on the backfoot quickly. Its Grass typing also makes it a prime target for common Max Airstream users such as Zapdos and Galarian Moltres.</p> ",
    "comments": "<h1>Other Options</h1> <p>Coba Berry can be used as a fringe option to provide insurance against Max Airstream users like Zapdos and Thundurus if Focus Sash has already been taken on its team. Similarly, Weakness Policy can be used to turn the tides on Flying- and Fire-type attackers, but is useless without activation.</p> ",
    "sets": [
      {
        "name": "Chlorophyll",
        "description": "<ul> <li> <p>Leaf Storm is used to give Venusaur both a powerful G-Max Vine Lash and a strong STAB move to use while outside of Dynamax. Having a Grass-type move is essential for hitting the likes of Tapu Fini and Regirock. Frenzy Plant can be used for a stronger G-Max Vine Lash at the cost of a less reliable STAB attack while not Dynamaxed.</p> </li> <li> <p>Earth Power allows Venusaur to hit Incineroar and Steel-types such as Metagross and Stakataka while boosting its Special Defense with Max Quake, while Sludge Bomb can hit Grimmsnarl and boost its Special Attack with Max Ooze.</p> </li> <li> <p>Weather Ball is an excellent option for hitting both Steel-types and opposing Grass-types such as Kartana and Rillaboom. Unfortunately, its reliance on sun means it cannot always be used successfully.</p> </li> <li> <p>Sleep Powder is a way for Venusaur to immobilize major threats such as Dragapult and Regieleki while its partner goes on the offensive.</p> </li> <li> <p>Focus Sash is typically used alongside Sleep Powder to give Venusaur increased security in the event that it misses. Life Orb is more commonly used on three attacks + Protect sets that are looking to increase damage output and use Venusaur in Dynamax as often as possible.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 526614, "username": "DomarpVGC"}, {"user_id": 294287, "username": "Raineko"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}]}], "writtenBy": [{"user_id": 501951, "username": "zeefable"}]}
  },
  "Charizard": {
    "overview": "<p>When given the freedom to attack under sun, Charizard is one of the metagame's most threatening sweepers. With the high number of Grass- and Steel-type Pokemon currently seeing play, it has no hard time finding ideal targets to melt with its strong STAB moves, such as Metagross, Kartana, and Rillaboom. Charizard's damage output is insanely high, both because of its high Special Attack and Solar Power as well as the residual damage done at the end of each turn by G-Max Wildfire. Additionally, it can even boost its Speed and Special Defense thanks to Max Airstream and Max Quake. Unfortunately, Charizard has a hard time answering faster Electric-types such as Regieleki and Thundurus. Bulky Ground-types such as Garchomp and Landorus-T are also able to live its powerful attacks and retaliate with Max Rockfall.</p> ",
    "comments": "<h1>Other Options</h1> <ul> <li>Charti Berry is nice for surviving a Max Rockfall from Landorus-T and Garchomp, but is useless otherwise. A Choice Scarf set can be used to catch faster threats off guard, but it can't be abused when Dynamaxed.</li> </ul> ",
    "sets": [
      {
        "name": "Solar Power Gigantamax",
        "description": "<ul> <li> <p>Blast Burn makes for the strongest possible G-Max Wildfire, but Heat Wave gives Charizard a more consistent spread attacking option outside of Gigantamax. Whichever Fire-type move is chosen, G-Max Wildfire has no hard time destroying the likes of Metagross and Celesteela.</p> </li> <li> <p>Hurricane and Air Slash provide Charizard with access to Max Airstream, with the former offering more power and the latter more accuracy. Due to the high usage of Pokemon such as Rillaboom and Kartana, Charizard will find opportunities to use Max Airstream and grab a +1 Speed boost often.</p> </li> <li> <p>Scorching Sands is an option for access to Max Quake, allowing Charizard to hit the likes of Incineroar and Regieleki while boosting its Special Defense. Solar Beam lets Charizard effectively hit Water-types such as Tapu Fini and Lapras either in sun or with Max Overgrowth.</p> </li> <li> <p>The combination of Life Orb and Solar Power is used to ensure Charizard's attacks are as strong as possible. Since its goal is to deal heavy and fast damage, it typically does not mind the recoil from Solar Power and Life Orb. Safety Goggles can be used for teams that need dedicated counterplay to Venusaur and Amoonguss.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 294287, "username": "Raineko"}, {"user_id": 300598, "username": "Netherious"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "The Dutch Plumberjack"}]}], "writtenBy": [{"user_id": 501951, "username": "zeefable"}]}
  },
  "Blastoise": {
    "sets": [
      {
        "name": "Offensive",
        "description": "<ul> <li> <p>With its Gigantamax forme, Blastoise is a potent offensive Water-type threat that threatens Pokemon such as Incineroar and Landorus-T.</p> </li> <li> <p>Water Spout is Blastoise's primary STAB move, providing it with a strong spread move and a 150-Base Power G-Max Cannonade. Hydro Cannon is an alternative to Water Spout that provides a more consistent attacking option when not Dynamaxed.</p> </li> <li> <p>Ice Beam lets Blastoise stand up to Pokemon that would otherwise check it, such as Rillaboom, Zapdos, and Thundurus. While Blizzard is inaccurate, if Blastoise sets hail with Max Hailstorm, it can be a good option when not Dynamaxed. It also has the benefit of giving a stronger Max Move.</p> </li> <li> <p>Fake Out allows Blastoise to disrupt opposing Pokemon, possibly giving your Pokemon and ease pressure from its partner, while Shell Smash transforms it from a decent to an excellent attacker.</p> </li> <li> <p>Life Orb is Blastoise's primary item to boost its otherwise average offensive presence. Mystic Water is also used because its lack of recoil. White Herb can be used to reverse the Defense drops from Shell Smash. Blastoise's Speed investment allows it to outspeed Incineroar and Heatran.</p> </li> </ul> "
      },
      {
        "name": "Utility",
        "description": "<ul> <li> <p>With good overall bulk, decent defensive typing, and a great supportive movepool, Blastoise carves itself a niche as a good utility Pokemon. With Yawn, Fake Out, Haze and Icy Wind, Blastoise is able to disrupt the opposing Pokemon in multiple facets of the game.</p> </li> <li> <p>Scald is Blastoise's attacking move of choice due to its chance to burn, which is particularly relevant against prominent physical attackers such as Glastrier, Garchomp and Urshifu-S.</p> </li> <li> <p>Fake Out allows Blastoise to disrupt a Pokemon of its choice, either pinning it down for a KO or allowing a teammate to set up.</p> </li> <li> <p>Icy Wind's speed control against both opposing Pokemon is good for letting slower Pokemon outspeed faster threats like Regieleki and Spectrier.</p> </li> <li> <p>Haze is particularly potent against setup sweepers such as Swords Dance Garchomp and Nasty Plot Spectrier. It can also be used to reset negative stat changes to Blastoise's teammate, such as Attack drops from Intimidate.</p> </li> <li> <p>Yawn is a good support option to force either undesired switches or crippling status, and it is especially useful for punishing Dynamaxing.</p> </li> <li> <p>Sitrus Berry provides Blastoise with additional longevity, allowing it to perform its supportive role for longer. Wacan Berry allows Blastoise to take an attack from even the most threatening Electric-types, such as Regieleki. It is also useful for using Haze to clear an opposing Rotom's Nasty Plot boost.</p> </li> <li> <p>Blastoise's defensive investment allows it to survive Grassy Glide from Miracle Seed Rillaboom, and Volt Switch from Magnet Regieleki.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 294287, "username": "Raineko"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 547871, "username": "tqew"}]}
  },
  "Raichu": {
    "sets": [{"name": "Support", "description": "<ul> <li> <p>Raichu is a great supporting option for Electric-weak Dynamax attackers, using Lightning Rod to absorb Electric-type moves. Raichu also has access to a wide supporting movepool including, but not limited to, Fake Out, Nuzzle, and Eerie Impulse.</p> </li> <li> <p>Nuzzle is great to paralyze fast threats, allowing allies to outspeed them. Full paralyses can also stall out the opponent's Dynamax.</p> </li> <li> <p>Eerie Impulse and Charm are two moves that respectively lower foes' Special Attack and Attack by two stages. Eerie Impulse can cripple threats such as Venusaur, Celesteela, and Galarian Moltres, whereas Charm can cripple Landorus-T, Urshifu-S, and Cinderace.</p> </li> <li> <p>Volt Switch is a great momentum gaining move that can also trigger the Weakness Policy of allies such as Galarian Moltres and Gigantamax Lapras.</p> </li> </ul> "}],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 527416, "username": "Bananners7"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Estronic"}]}], "writtenBy": [{"user_id": 517038, "username": "Giokio"}]}
  },
  "Clefairy": {
    "sets": [
      {
        "name": "Support",
        "description": "<ul> <li> <p>Clefairy can provide amazing support to its teammates, whether it's from Follow Me, Friend Guard, or any of its other plethora of support options.</p> </li> <li> <p>Follow Me is an excellent move to support frailer teammates such as Spectrier and Urshifu-S, letting them attack free of charge. Follow Me can also absorb Max Moves, as all of them are single-targeting moves.</p> </li> <li> <p>Sing, while inconsistent, can be extremely deadly. Pokemon such as Metagross may Dynamax and target Clefairy's threatening partner, such as Dragapult or Spectrier, only to get put to sleep by Sing and effectively waste its Dynamax. However, Helping Hand is a more consistent alternative useful for increasing the damage output of Clefairy's teammate.</p> </li> <li> <p>Dazzling Gleam provides Clefairy with a spread move to pick off weakened foes as well as break Focus Sashes. Moonblast is a stronger alternative to Dazzling Gleam that can also drop the foe's Special Attack, but it doesn't have the benefit of being a spread move. Clefairy can also ditch any attacking moves and go with After You, which is useful for letting fast teammates such as Kartana and Thundurus still move first under Trick Room.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 901591, "username": "zeefable"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Estronic"}]}], "writtenBy": [{"user_id": 527416, "username": "Bananers7"}]}
  },
  "Marowak-Alola": {
    "sets": [
      {
        "name": "Offensive",
        "description": "<ul> <li> <p>With a brilliant unique item in Thick Club, a respectable Speed stat for Trick Room, and access to Lightning Rod, Alolan Marowak is a great offensive Pokemon for Trick Room and balance teams.</p> </li> <li> <p>Flare Blitz is Alolan Marowak's strongest Fire-type STAB move, responsible for handling common Fire-weak Pokemon such as Rillaboom, Celesteela, and Venusaur. Max Flare can also set sun for Alolan Marowak, boosting the power of its Fire-type move and mitigating its Water weakness.</p> </li> <li> <p>Shadow Bone is Alolan Marowak's most consistent Ghost-type STAB move that also comes with a chance to lower the foe's Defense, making its next hit even stronger; Poltergeist is a stronger alternative, but its lower accuracy and reliance on the opponent still having an item make it less consistent. These both provide access to Max Phantasm, lowering the opposing Pokemon's Defense for physically attacking partners such as Urshifu-R and Kartana and making Alolan Marowak increasingly more threatening as the drops stack.</p> </li> <li> <p>Bonemerang allows Alolan Marowak to notably beat Incineroar, as well as hitting Heatran and Coalossal 4x super effectively. It also gives Alolan Marowak Max Quake when Dynamaxed, patching up its otherwise meager Special Defense.</p> </li> <li> <p>Lightning Rod is the best ability for Alolan Marowak, as it allows it to support Electric-weak partners such as Celesteela and Tapu Fini nicely. It also redirects Eerie Impulse from Thundurus and Porygon2, letting special attacking partners such as Celesteela and Nihilego continue undeterred.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 501951, "username": "zeefable"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Estronic"}]}], "writtenBy": [{"user_id": 294287, "username": "Raineko"}]}
  },
  "Weezing": {
    "sets": [
      {
        "name": "Neutralizing Gas Support",
        "description": "<ul> <li> <p>Weezing should only be used with Regigigas due to Neutralizing Gas negating Slow Start.</p> </li> <li> <p>Clear Smog prevents setup sweepers such as Spectrier and Landorus-T from snowballing, as well as resetting Max Move boosts. Sludge Bomb deals more consistent damage but doesn't have the benefit of resetting the stats of the target.</p> </li> <li> <p>Taunt prevents attempts to cripple Weezing's most common partner, Regigigas, with status such as burn from Will-O-Wisp and sleep with Yawn. It also prevents Regigigas from being slowed down by Trick Room attempts from Porygon2 and Dusclops.</p> </li> <li> <p>Will-O-Wisp is great for crippling physical attackers such as Metagross, Glastrier and Urshifu-S.</p> </li> <li> <p>252 Speed EVs and Timid nature allow Weezing to outspeed notable Pokemon such as Metagross, Porygon2 and Gothitelle. The former is severely crippled by Will-O-Wisp and the latter two are stopped in their tracks by Taunt.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 501951, "username": "zeefable"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Estronic"}]}], "writtenBy": [{"user_id": 527416, "username": "Bananers7"}]}
  },
  "Lapras": {
    "overview": "<p>Lapras has anchored itself as a premier Dynamax candidate for many defensive teams in the metagame due to its Gigantamax form setting Aurora Veil through G-Max Resonance. Additionally, its offensive sets are strong enough to deal significant damage to several meta staples, like Garchomp, Incineroar, and Landorus-T. Bulkier Perish Song sets offer an alternative win condition if Lapras and its teammates are able to weather the three turns necessary. Lapras is reliant on Dynamax and often finds itself being insignificant on the field after it ends. Due to Lapras's relatively low base Special Attack, it sometimes struggles to pick up KOs, especially due to damage reduction through moves like Snarl and Light Screen. Lapras also dislikes taking hits before Aurora Veil goes up, as its bulk is significantly worse without it.</p> ",
    "sets": [
      {
        "name": "Offensive Gigantamax",
        "description": "<ul> <li> <p>Hydro Pump is the preferred Water-type STAB move as it helps make up for Lapras's low Special Attack, and its higher 140 Base Power Max Geyser is excellent for hitting Entei and Incineroar.</p> </li> <li> <p>Blizzard is preferred on this set so that Lapras gets access to the strongest possible G-Max Resonance, notably making a difference against the likes of Dragapult and Rillaboom.</p> </li> <li> <p>Thunder is used to give Lapras Max Lightning, hitting opposing Water-types like Tapu Fini and denying sleep from moves like Yawn and Spore that would otherwise disrupt it.</p> </li> <li> <p>Life Orb offers an immediate power boost at the cost of Lapras's bulk, whereas Weakness Policy can be used for a larger boost without the drawbacks of recoil, but its damage output will suffer without any boosts.</p> </li> <li> <p>Water Absorb lets Lapras function as a catch-all Water-type switch-in, whereas Shell Armor removes the chance of Lapras being struck by a Critical Hit. Notably this significantly reduces the damage from Urshifu-S's Wicked Blow.</p> </li> </ul> "
      },
      {"name": "Defensive Light Clay", "description": "<ul> <li> <p>Hydro Pump is preferred as Lapras wants the power from a 140 Base Power Max Geyser to hit Water-weak Pokemon like Incineroar.</p> </li> <li> <p>Freeze-Dry gives Lapras the consistent damage needed both in and out of Dynamax. Because this set is not focused on damage the secondary effect Freeze Dry offers is preferred. Additionally, it somewhat makes up for the lack of Thunder by hitting Water-types.</p> </li> <li> <p>Perish Song is an incredible endgame win condition due to the immense bulk of defensive Lapras teams under Aurora Veil.</p> </li> </ul> "}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 501951, "username": "zeefable"}, {"user_id": 493619, "username": "Dragonpiley007"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Estronic"}]}], "writtenBy": [{"user_id": 428483, "username": "Grandmas Cookin"}]}
  },
  "Zapdos": {
    "overview": "<p>Zapdos's powerful Max Airstream and good Speed stat allow it to be a potent offensive threat in the metagame. In addition, its typing lets it effectively check common Pokemon such as Tapu Fini, Rillaboom, and Kartana. However, as it has no way of increasing its damage output by itself, Zapdos tends to struggle against Snarl users such as Incineroar and screens from Grimmsnarl and Gigantamax Lapras. It also has a hard time dealing with Ground-types like Assault Vest Landorus-T and Garchomp.</p> ",
    "comments": "<h1>Other Options</h1> <p>Roost can replace Heat Wave and can be ran alongside Detect for increased longevity at the cost of coverage. Thunder is an option when running Zapdos with Politoed for a stronger Max Lightning at the cost of having two weather-reliant STAB moves. Similarly, Weather Ball can be rain over Heat Wave on rain teams for access to Max Geyser.</p> ",
    "sets": [
      {
        "name": "Offensive",
        "description": "<ul> <li> <p>Hurricane is a powerful secondary STAB move that lets Zapdos boost its Speed with Max Airstream when Dynamaxed as well as hit Grass-types like Rillaboom and Amoonguss.</p> </li> <li> <p>Heat Wave deals spread damage and hits Steel-types like Metagross and Kartana for super effective damage. It also lets Zapdos hit opposing Electric-types like Regieleki and Raichu.</p> </li> <li> <p>Detect allows Zapdos to protect itself when needed and is used over Protect to bypass Imprison users such as Indeedee-M, but Protect's higher PP is helpful against Urshifu-S locked into Sucker Punch. Alternatively, Roost can be used to recover health and stall the foe's Dynamax turns.</p> </li> </ul> <ul> <li> <p>Life Orb is the most commonly used item, but Safety Goggles is also a good choice because it is helpful against sleep inducers like Amoonguss and Venusaur.</p> </li> <li> <p>Static is chosen over Pressure, as it rarely ever affects the outcome of a game, while Static can trigger against Pokemon like Urshifu-S and Kartana.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 501951, "username": "zeefable"}, {"user_id": 294287, "username": "Raineko"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}]}], "writtenBy": [{"user_id": 493619, "username": "Piley"}]}
  },
  "Zapdos-Galar": {
    "sets": [
      {
        "name": "Offensive",
        "description": "<ul> <li> <p>Galarian Zapdos's strength lies in launching strong, Defiant-boosted attacks, preferably when Dynamaxed. It can rapidly become unstoppable with boosts from its STAB options in Dynamax, and these options combine to hit most Pokemon in the metagame at least neutrally.</p> </li> <li> <p>Brave Bird is a powerful STAB move that hits threats such as Rillaboom, Venusaur, and Amoonguss. Also, with Max Airstream, it can stack Speed boosts and gain momentum for the team.</p> </li> <li> <p>Close Combat lets Galarian Zapdos OHKO metagame staples like Incineroar, Glastrier, and Porygon2 with a Defiant boost. Alternatively, Thunderous Kick is an option to consider without drawbacks, but it is noticeably weaker initially than Close Combat. Both moves boost Attack as Max Knuckle in Dynamax, further helping Galarian Zapdos snowball.</p> </li> <li> <p>Stomping Tantrum gives Galarian Zapdos coverage to hit Regieleki and Torkoal. Taunt is useful to shut down the opponent's Trick Room or redirection attempts and gain momentum for the team.</p> </li> <li> <p>Throat Chop OHKOes Ghost-types like Spectrier and Dragapult when Galarian Zapdos Dynamaxes. Blaze Kick is an option to hit Celesteela and Metagross, but Stomping Tantrum is usually preferred for access to Max Quake.</p> </li> <li> <p>Assault Vest lets Galarian Zapdos take hits from special attackers such as Rotom-H more frequently outside of Dynamax. Life Orb gives it the immediate power needed to guarantee OHKOs on threats such as Incineroar and Glastrier without relying on Defiant boosts.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 517038, "username": "Giokio"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 514175, "username": "ttr"}]}
  },
  "Moltres-Galar": {
    "overview": "<p>Galarian Moltres's access to Nasty Plot, a boosting ability in Berserk, and a powerful Max Airstream make it a threat in the metagame. Max Airstream and Max Darkness are a powerful combination that boosts your Speed and lowers your foe's Special Defense, meaning that Galarian Moltres becomes more dangerous every turn. It also performs incredibly well against Spectrier, Rillaboom, and Kartana, resisting most of their moves and dealing serious damage with its own. However, it is often too reliant on Nasty Plot and Berserk boosts to deal serious damage, meaning it struggles against Eerie Impulse Porygon2 and Snarl users like Incineroar. Galarian Moltres's typing also exposes it to common threats such as Regieleki, Thundurus, and Glastrier.</p> ",
    "comments": "<h1>Other Options</h1> <p>Taunt can be used over Protect to stop Porygon2 from using Trick Room or Eerie Impulse, but Protect is often preferred to preserve Galarian Moltres's longevity. Sitrus Berry is useful for potentially allowing Berserk to activate a second time.</p> ",
    "sets": [
      {
        "name": "Nasty Plot",
        "description": "<ul> <li> <p>Fiery Wrath hits Psychic-types like Indeedee-F, Metagross, and Spectrier and has a useful 20% flinching chance. Max Darkness is really useful to lower foes' Special Defense and threaten them even more when Dynamaxed.</p> </li> <li> <p>Air Slash hits threats like Venusaur, Urshifu-S, and Rillaboom and allows Galarian Moltres to make up for its below average Speed, providing Speed boosts to it and its partner with Max Airstream while Dynamaxed. Hurricane can be used over Air Slash to get more power while sacrificing accuracy.</p> </li> <li> <p>Nasty Plot combined with Berserk allows Galarian Moltres to quickly boost its Special Attack and become a threatening offensive presence, capable of quickly sweeping its foes.</p> </li> <li> <p>Life Orb instantly boosts Galarian Moltres's damage output and reduces its reliance on Nasty Plot, whereas Weakness Policy can be used to provide even more stat boosting on bulkier spreads. Safety Goggles lets Galarian Moltres ignore Venusaur's and Amoonguss's powder moves.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 501951, "username": "zeefable"}, {"user_id": 493619, "username": "Piley"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}]}], "writtenBy": [{"user_id": 517038, "username": "Giokio"}]}
  },
  "Politoed": {
    "sets": [
      {
        "name": "Rain Setter",
        "description": "<ul> <li> <p>Politoed is the strongest rain setter in the metagame thanks to its amazing supporting movepool and survivability. Politoed is usually seen alongside Kingdra, forming a solid rain core able to threaten even the strongest staples of the metagame such as Dragapult, Glastrier, and Coalossal.</p> </li> <li> <p>Scald is capable of hitting metagame staples like Incineroar, Torkoal, and Landorus-T for good damage thanks to its power boost in rain. Scald can also cripple opposing physical attackers like Urshifu-S, Rillaboom, and Glastier with burns. Muddy Water is an option to ignore opposing redirection and spread accuracy drops, but its lower accuracy can be troublesome.</p> </li> <li> <p>Helping Hand gives a boost to Politoed's teammates when attacking. In particular, it helps Kingdra deal with sun teams, allowing it to OHKO Torkoal and Assault Vest Landorus-T in sun with Max Geyser.</p> </li> <li> <p>Perish Song can serve as a strong win condition late-game, as it can force wins on weakened teams that have only two members remaining. Perish Song can also be paired with Gothitelle, as its ability to trap foes can be extremely helpful against passive leads such as Porygon2 + Grimmsnarl. Alternatively, Icy Wind can be used to slow down faster threats such as Spectrier, Zapdos, and Garchomp.</p> </li> <li> <p>Sitrus Berry extends Politoed's survivability. Wacan Berry can be used instead to help Politoed endure Regieleki's Thunderbolt or Thundurus's Max Lighting, but Sitrus Berry is usually preferred, as it can be useful in many more situations. The given EV spread lets Politoed survive Assault Vest Rillaboom's Grassy Glide and Spectrier's Max Phantasm.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 294287, "username": "Raineko"}]}, {"name": "Grammar checked by", "members": [{"user_id": 297659, "username": "deetah"}]}], "writtenBy": [{"user_id": 517038, "username": "Giokio"}]}
  },
  "Umbreon": {
    "sets": [
      {
        "name": "Utility",
        "description": "<ul> <li> <p>Foul Play enables Umbreon to punish physical attackers like Metagross, Glastrier and Dragapult.</p> </li> <li> <p>Snarl is used in order to reduce the damage output of special attackers such as Spectrier and Tapu Fini.</p> </li> <li> <p>Moonlight allows Umbreon to stay in a match longer and, when combined with its supportive moves, can make it a solid wincon. Sun also boosts Moonlight's recovery.</p> </li> <li> <p>Yawn allows Umbreon to put the opponent's team in an unfavorable position by forcing both foes to switch out or be put to sleep. Taunt allows it to prevent Trick Room attempts from Poyrgon2 or Dusclops and sleep attempts from Amoongus or Venusaur. Helping Hand's support is especially appreciated because Umbreon is frequently paired with heavy-hitters, such as Charizard and Venusaur.</p> </li> <li> <p>Leftovers gives Umbreon increased longevity and Safety Goggles allows it to stand up to common sleep users in Venusaur and Amoongus.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 501951, "username": "zeefable"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 491200, "username": "Light Sanctity"}]}
  },
  "Kingdra": {
    "sets": [
      {
        "name": "Swift Swim Attacker",
        "description": "<ul> <li> <p>Thanks to its ability in Swift Swim, near unresisted STAB combination, and access to Hurricane for Max Airstream, Kingdra is a threatening candidate for Dynamax in the rain. Kingdra matches up well against some of the most common and powerful Pokemon in the format such as Incineroar and Landorus-T. However Kingdra does have a few flaws, such as its reliance on rain due to its average Special Attack and Speed. Additionally, bulkier Grass-types can trouble Kingdra, as they have the bulk to take any of its attacks and pressure it back.</p> </li> <li> <p>Muddy Water is often the preferred Water-type STAB option on Kingdra, as it is a powerful spread move in rain with a chance to lower accuracy. Hydro Pump is a stronger single target alternative that also offers a slightly stronger Max Geyser. These also allow Kingdra to set its own rain with Max Geyser in the absence of Politoed.</p> </li> <li> <p>Draco Meteor is Kingdra's strongest Dragon-type STAB option. Max Wyrmwind lowering the opposing Pokemon's Attack stat is useful in circumventing Kingdra's mediocre bulk.</p> </li> <li> <p>Hurricane hits Grass-types that would otherwise trouble Kingdra like Venusaur, Rillaboom, and Amoonguss. It also lets Kingdra boost its Speed with Max Airstream.</p> </li> <li> <p>Life Orb is Kingdra's best item, as it considerably boosts the power of its attacks for a small amount of recoil. Life Orb is essential to pick up KOs on Dynamaxed Dragapult and Venusaur. The given HP EVs are optimized so that Kingdra takes as little damage from Life Orb as possible. Swift Swim is needed for Kingdra to be a viable Pokemon, which makes Politoed a near obligatory teammate. A Timid nature and 172 Speed EVs let Kingdra outspeed Regieleki in rain.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 294287, "username": "Raineko"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Estronic"}]}], "writtenBy": [{"user_id": 541847, "username": "yourwelcomthank"}]}
  },
  "Porygon2": {
    "overview": "<p>Porygon2 is one of the most reliable choices for a Trick Room setter in the current metagame. Its one weakness to Fighting-type moves is very easy to account for, and its reliance on Eviolite means it almost never competes with teammates for a specific item slot. Its vast movepool makes it extremely customizable from team to team, ranging from an offensive coverage user to a dedicated Spectrier check and Trick Room setter. If given a Special Attack boost from Download, its offensive capabilities are also quite respectable, especially if it chooses to Dynamax. Unfortunately, due to the high damage output in a format with threats such as Regieleki and Urshifu-S, Porygon2 may sometimes be overwhelmed by strong foes before it can set Trick Room. It's also reliant on boosts for its offensive presence, meaning that without them the opponent can simply just ignore Porygon2's slot until its the last Pokemon remaining.</p> ",
    "comments": "<h1>Other Options</h1> <p>Icy Wind can be used to deal incremental chip damage to foes while also serving as an alternative form of speed control. An offensive Dynamaxed mixed attacking set with Giga Impact is excellent for catching the opponent off guard while making the most of either Download boost.</p> ",
    "sets": [{"name": "Trick Room Support", "description": "<ul> <li> <p>Tri Attack provides a more consistent attack across the board, as well as an increased chance to inflict status. It also serves as the base move for a hard-hitting Max Strike, which is useful for lowering foes' Speed.</p> </li> <li> <p>Ice Beam is effective for hitting the likes of Rillaboom, Landorus-T, and Zapdos for strong super effective damage. Eerie Impulse lets it cripple Special Attackers like Galarian Moltres and Tapu Fini.</p> </li> <li> <p>Recover is very important for keeping Porygon2 healthy over the course of a game and can be used repeatedly to stall out the foe's Dynamax.</p> </li> <li> <p>Trick Room is Porygon2's most consistent form of speed control. Thanks to its high bulk and one weakness, it's very difficult to deny Porygon2 from setting it up.</p> </li> </ul> "}],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 300598, "username": "Netherious"}, {"user_id": 493619, "username": "Dragonpiley007"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Estronic"}]}], "writtenBy": [{"user_id": 501951, "username": "zeefable"}]}
  },
  "Hitmontop": {
    "sets": [
      {
        "name": "Utility",
        "description": "<ul> <li> <p>Hitmontop serves as a utility-based Pokemon with access to tools such as Intimidate, Helping Hand, and Fake Out as well as momentum tools such as Feint and Quick Guard that allow its partner to achieve its goals undisturbed.</p> </li> <li> <p>Close Combat is the main source of damage for Hitmontop, allowing to effectively duel threats such as Urshifu-S and Glastrier.</p> </li> <li> <p>Wide Guard is capable of completely nullifying damage output from Kyogre, Groudon, and Expanding Force Calyrex-S. Feint provides the team with another supportive option, allowing highly offensive threats to have their damage output undisturbed. Quick Guard allows the team one-time protection against moves such as Fake Out, which can allow Pokemon that would otherwise be prone to Fake Out such as Zacian-C to do something with their turn.</p> </li> <li> <p>Eject Button is the most consistent method of pivoting with Hitmontop, allowing it to reset its Fake Out and Intimidate. Focus Sash and Coba Berry are alternatives that grant it some survivability against strong Flying-type threats such as Zapdos and Yveltal.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 501951, "username": "zeefable"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Estronic"}]}], "writtenBy": [{"user_id": 294287, "username": "Raineko"}]}
  },
  "Entei": {
    "sets": [
      {
        "name": "Support",
        "description": "<ul> <li> <p>Entei is a good supporting Pokemon that cannot flinch or be weakened by opposing Intimidate due to its ability Inner Focus.</p> </li> <li> <p>Sacred Fire is a strong STAB move with 50% burn chance that can heavily cripple physical attackers, such as Metagross and Dragapult, by halving their Attack.</p> </li> <li> <p>Extreme Speed is a strong priority move that can finish off weakened foes such as Focus Sash Regieleki and Whimsicott.</p> </li> <li> <p>Snarl is useful to soften damage taken by opposing special threats such as Venusaur, Tapu Fini, and Galarian Moltres.</p> </li> <li> <p>Bulldoze can provide speed control and trigger the Weakness Policy of Entei's allies, and it is great combined with Metagross and its ability Clear Body that prevents its Speed from dropping.</p> </li> <li> <p>Stone Edge is a useful coverage option that hits Flying-types such as Zapdos and Charizard while also being helpful to hit Incineroar.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 527416, "username": "Bananners7"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Estronic"}]}], "writtenBy": [{"user_id": 517038, "username": "Giokio"}]}
  },
  "Suicune": {
    "sets": [
      {
        "name": "Support",
        "description": "<ul> <li> <p>Suicune's great bulk and supporting options allow it to be a great help to its team with moves like Tailwind and Helping Hand. Additionally, it is a nuisance to the opposition with its damage-reducing moves such as Snarl and Scald.</p> </li> <li> <p>Scald is Suicune's Water-type move of choice, as it can severely cripple physical threats such as Glastrier and Metagross with its burn chance.</p> </li> <li> <p>Tailwind allows Suicune's teammates to outspeed fast threats such as Dragapult and Venusaur in sun. Tailwind works especially with Suicune because of its ability Inner Focus, preventing it from getting flinched.</p> </li> <li> <p>Snarl allows Suicune to neuter the damage of special attackers such as Spectrier, Charizard, and Tapu Fini.</p> </li> <li> <p>Ice Beam can hit Pokemon such as Landorus-T and Garchomp for massive damage, as well as Grass-types such as Rillaboom and Whimsicott that Suicune would otherwise struggle with. However, Suicune can also run Helping Hand to increase the damage output of its teammates.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 901591, "username": "zeefable"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Estronic"}]}], "writtenBy": [{"user_id": 527416, "username": "Bananers7"}]}
  },
  "Tyranitar": {
    "sets": [
      {
        "name": "Physical Attacker",
        "description": "<ul> <li> <p>Tyranitar makes an excellent Weakness Policy user thanks to its high Attack and weaknesses to common attacking types like Ground and Steel.</p> </li> <li> <p>Rock Side is a reliable spread move with a respectable damage output. It becomes the base move for Tyranitar's powerful Max Rockfall, easily destroying the likes of Thundurus, Zapdos, and Glastrier.</p> </li> <li> <p>Lash Out is great for punishing opposing Intimidate, as it doubles in power if Tyranitar's stats are lowered. Crunch works just as well if Tyranitar is paired with Intimidate deterrents like Thundurus. In general, teams appreciate Dark-type coverage to threaten Spectrier, Dragapult, and Indeedee-F.</p> </li> <li> <p>Superpower is Tyranitar's preferred filler move, notably allowing it to hit Urshifu-S and opposing Tyranitar for super effective damage while also boosting its Attack with Max Knuckle.</p> </li> <li> <p>Maximum HP investment allows it to consistently beat a variety of common threats including Charizard, Zapdos, and Spectrier.</p> </li> </ul> "
      },
      {
        "name": "Focus Sash Lead",
        "description": "<ul> <li> <p>Fast Tyranitar is an excellent aggressive lead. It is very effective for spreading paralysis and launching powerful hits early-game.</p> </li> <li> <p>Rock Slide lets Tyranitar hit for consistent spread damage and can potentially land crucial flinches.</p> </li> <li> <p>Jolly Tyranitar is a great Assurance user, as it is often paired with faster teammates like Thundurus and Dracovish, allowing Assurance to hit for double damage. Foul Play is also a strong choice against powerful physical attackers like Landorus-T and Defiant-boosted Thundurus.</p> </li> <li> <p>Thunder Wave can ruin unsuspecting enemy lead Pokemon, which is especially great if it can catch a foe as it Dynamaxes. This opens the door for Tyranitar's teammates to gain momentum and clean up late-game.</p> </li> <li> <p>Taunt works well to shut down attempts to cripple Tyranitar and its partners such as status spreading or Trick Room. Superpower is useful for hitting Kartana and opposing Tyranitar.</p> </li> <li> <p>252 Speed EVs and a Jolly nature give Tyranitar the best possible chances of crippling its desired target, while maximum Attack investment ensures it can still pack a punch. Focus Sash makes up for the lack of bulk investment.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 294287, "username": "Raineko"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Estronic"}]}], "writtenBy": [{"user_id": 501951, "username": "zeefable"}]}
  },
  "Torkoal": {
    "sets": [
      {"name": "Support", "description": "<ul> <li> <p>Torkoal is a reliable option to set sun for Charizard and Venusaur to wreak havoc with their abilities.</p> </li> <li> <p>Burning Jealousy is excellent for punishing Weakness Policy and Swords Dance users such as Metagross, Glastrier and Landorus-T.</p> </li> <li> <p>Body Press is Torkoal's primary offensive option. It his fairly hard, as Torkoal has a naturally high Defense stat.</p> </li> <li> <p>Yawn can cripple Dynamaxed Pokemon, which Torkoal struggles to deal with otherwise.</p> </li> </ul> "},
      {"name": "Offensive", "description": "<ul> <li> <p>Eruption is Torkoal's most powerful attack, being able to OHKO the likes of Metagross and Thundurus. It also gives Torkoal a 150 BP Max Flare, a powerful single-target attack and a way to reset sun.</p> </li> <li> <p>Heat Wave is a strong spread move that doesn't rely on Torkoal having high remaining HP, making it more reliable the longer Torkoal is on the field.</p> </li> <li> <p>Earth Power hits Rock- and Fire-types such as Nihilego, Incineroar, and Stakataka. Additionally, it can boost its Torkoal's rather poor Special Defense with Max Quake. Alternatively, Solar Beam hits types Water- and Rock-types such as Tapu Fini and Lapras. Max Overgrowth is useful for not being reliant on sun to dent opposing Water-types, and it can also override opposing terrains by summoning Grassy Terrain.</p> </li> </ul> "}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 501951, "username": "zeefable"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 527416, "username": "Bananers7"}]}
  },
  "Dusclops": {
    "sets": [
      {
        "name": "Trick Room Support",
        "description": "<ul> <li> <p>Massive defenses further boosted by Eviolite, immunity to Fake Out, few weaknesses, and a wide supportive movepool make Dusclops a solid Trick Room setter. Moves such as Ally Switch, Will-O-Wisp, and Haze make it great support for teammates like Stakataka, Torkoal, and Glastrier.</p> </li> <li> <p>Night Shade lets Dusclops deal consistent chip damage; it is chosen over other attacks due to Dusclops's poor offensive presence.</p> </li> <li> <p>Dusclops uses Pain Split well due to its low HP stat allowing for increased recovery against most Pokemon.</p> </li> <li> <p>Haze allows Dusclops to stop setup sweepers like Regirock, Rotom-W, and Tapu Fini from snowballing. Additionally, Haze can also remove Intimidate drops for physical teammates like Glastrier and Rhyperior, as well as clearing boosts from Trick Room checks such as Metagross and Celesteela. Will-O-Wisp cripples physical attackers like Metagross, Rillaboom, and Urshifu-R; alternatively, Ally Switch allows Dusclops to redirect powerful attacks to itself instead of its partner. This is especially useful for absorbing Max Moves, helped further by Dusclops's immunities to Fighting and Normal.</p> </li> <li> <p>Dusclops's EVs allow it to live Life Orb Max Darkness from Galarian Moltres and Life Orb Max Phantasm from Dragapult.</p> </li> <li> <p>Dusclops can run moves like Bulldoze, Brick Break, and Shadow Sneak to activate a teammate's Weakness Policy in place of its last move.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 501951, "username": "zeefable"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": "o", "username": "y"}, {}]}
  },
  "Metagross": {
    "overview": "<p>Metagross is a solid choice for a bulky attacker due to its insanely high Attack and its resistances to Grass-, Ice- and Fairy-type moves. Furthermore, it is one of the select few Pokemon that has Clear Body, which allows Metagross to stay safe from Intimidate or stat drops from opposing Max Moves. Its large number of resistances and its common weaknesses in Ground, Ghost, Dark, and Fire make it an excellent Weakness Policy user. Metagross appreciates Pokemon that can activate its Weakness Policy such as Spectrier and Tornadus. Despite all of its positive traits, Metagross can be shut down by Pokemon such as Gigantamax Charizard and Spectrier. It is also reliant on Dynamax to make the most of its offensive capabilities.</p> ",
    "comments": "<h1>Other Options</h1> <p>Zen Headbutt allows Metagross to target Pokemon such as Venusaur with a powerful Max Mindstorm whilst setting Psychic Terrain. Bullet Punch is a reliable priority option, but it cuts into Metagross's coverage. Assault Vest is another valid option to allow Metagross to stand up to special attackers like Spectrier and Rotom-H, but such a set is considerably less powerful than Weakness Policy.</p> ",
    "sets": [{"name": "Weakness Policy", "description": "<ul> <li> <p>Iron Head is Metagross's Steel-type attack of choice, as it can flinch foes and is perfectly accurate. Its powerful Max Steelspike is useful for boosting Metagross's already high Defense and can severely damage Glastrier and Grimmsnarl.</p> </li> <li> <p>Stomping Tantrum is used in order to break through Pokemon such as Incineroar and Regieleki with the added bonus of boosting Metagross's Special Defense through Max Quake.</p> </li> <li> <p>Rock Slide is able to hurt Pokemon such as Charizard and Zapdos while Metagross is Dynamaxed. Ice Punch can be run in order to punch holes through Ground- and Grass-types such as Landorus-T, Garchomp, and Rillaboom.</p> </li> </ul> "}],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 501951, "username": "zeefable"}, {"user_id": 294287, "username": "Raineko"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 491200, "username": "Light Sanctity"}]}
  },
  "Regirock": {
    "sets": [
      {
        "name": "Offensive",
        "description": "<ul> <li> <p>Regirock's massive physical bulk lets it easily take some of the strongest super effective physical attacks in the format, letting it use Weakness Policy effectively. Additionally, Regirock's Rock typing matches up well against many of the format's Flying-types, like Zapdos, Galarian Moltres, and Charizard.</p> </li> <li> <p>Rock Slide is a reliable STAB move that hits common threats like Zapdos, Thundurus, and Galarian Moltres for super effective damage while also providing a chance to flinch opposing Pokemon. Max Rockfall also sets up sand, improving Regirock's Special Defense.</p> </li> <li> <p>Drain Punch gives Regirock a form of recovery and a way to raise its Attack with Max Knuckle. Body Press is another option that takes advantage of its enormous Defense stat. However, it should be noted that Body Press should only be picked over Drain Punch on Curse sets, where Regirock can take advantage of the Defense boosts.</p> </li> <li> <p>Ice Punch is a great coverage move to hit Ground-types like Landorus-T and Garchomp, as well as Grass-types such as Rillaboom, Venusaur, and Amoonguss.</p> </li> <li> <p>Stomping Tantrum increases Regirock's Special Defense when turned into Max Quake while also giving it coverage against Steel-types such as Heatran and Metagross.</p> </li> <li> <p>Curse is an option that allows Regirock to set up against more passive Pokemon like Grimmsnarl and Incineroar. Both Protect and Curse can be run; however, Regirock will then miss out on crucial coverage.</p> </li> <li> <p>Weakness Policy allows Regirock to take advantage of its bulk to take super effective moves from Pokemon like Kartana and both Urshifu formes and in return fire off a +2 attack.</p> </li> <li> <p>236 HP EVs minimizes chip damage from moves like G-Max Vinelash while keeping as much HP as possible. 68 Speed EVs allow Regirock to outspeed Landorus-T when Tailwind is up. However, Regirock still is 1 point slower than base 60 Speed Pokemon like Incineroar, Grimmsnarl, and Porygon2. This means that it will underspeed these Pokemon when Trick Room is up, making Regirock very flexible in where it can function.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 527416, "username": "Bananers7"}]}, {"name": "Grammar checked by", "members": [{"user_id": 301217, "username": "Bandkrook"}]}], "writtenBy": [{"user_id": 526727, "username": "poogang"}]}
  },
  "Registeel": {
    "sets": [
      {
        "name": "Iron Defense",
        "description": "<ul> <li> <p>Thanks to Registeel's enormous defenses, it has established itself as a solid bulky Steel-type in the current metagame. It is capable of unleashing some of the most effective Body Presses in the game thanks to its base 150 Defense and access to Iron Defense. In addition to this, Registeel's Clear Body foils many attempts to bring its defenses back into check.</p> </li> <li> <p>Body Press is Registeel's primary source of damage due to its high Defense stat. It's vital in tackling Pokemon that typically check Registeel such as Incineroar, Heatran and Urshifu.</p> </li> <li> <p>Iron Defense and Amnesia are both responsible for making Registeel the defensive monster it is. In late game situations, their defense boosts are pivotal in making Registeel unbeatable by the rest of the opposing team.</p> </li> <li> <p>Protect is the primary option for the last slot that maximizes the recovery gained from Leftovers, allowing for better longevity. Rest is an option that gives Registeel a form of full recovery at the cost of being asleep for two turns. This is generally less of a problem for Registeel, however, due to its bulk.</p> </li> <li> <p>Leftovers is the best item for Registeel, as its tendency to stay on the field allows for maximum recovery, often more than alternatives such as Sitrus Berry.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 501951, "username": "zeefable"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Estronic"}]}], "writtenBy": [{"user_id": 294287, "username": "Raineko"}]}
  },
  "Garchomp": {
    "sets": [
      {
        "name": "Offensive",
        "description": "<ul> <li> <p>Due to Garchomp's excellent typing, Attack, and Speed, it has proven to be a threatening setup sweeper in VGC 2021. Its Ground typing gives it a crucial Electric immunity, allowing it to stand up to the mighty Regieleki and potentially set up with Swords Dance in its face.</p> </li> <li> <p>Stomping Tantrum is a reliable Ground-type STAB move for Garchomp which doesn't hit its teammate, unlike Earthquake. However, you can still go with Earthquake instead, which has the benefit of hitting both foes. On the other hand, it is also noteworthy that when Grassy Terrain is active, Earthquake's damage will be halved, while Stomping Tantrum's stays the same. Another noteworthy point is the fact that Earthquake and Stomping Tantrum both have the same Base Power when Garchomp is Dynamaxed.</p> </li> <li> <p>Rock Slide is a crucial coverage move for Garchomp, as it allows it to hit Pokemon such as Zapdos and Galarian Moltres that are immune to its Ground-type move of choice.</p> </li> <li> <p>Swords Dance allows Garchomp to boost its Attack and sweep through teams. Swords Dance is especially good to counter Intimidate, which is often used to suppress Garchomp's attacking presence. Dragon Claw is an option that to hit Dragon-types such as Kingdra and Dragapult while also providing a useful Attack reduction with Max Wyrmwind.</p> </li> <li> <p>Life Orb is useful for increasing Garchomps already massive damage output; however, Lum Berry can be used to prevent burn and sleep from crippling Garchomp. Alternatively, Safety Goggles can be used to completely shut down Venusaur and Amoonguss attempting to sleep Garchomp with Sleep Powder and Spore, respectively.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 294287, "username": "Raineko"}]}, {"name": "Grammar checked by", "members": [{"user_id": 262594, "username": "Milak"}]}], "writtenBy": [{"user_id": 527416, "username": "Bananers7"}]}
  },
  "Rhyperior": {
    "sets": [
      {
        "name": "Trick Room Attacker",
        "description": "<ul> <li> <p>Rhyperior uses its low Speed and sky-high Attack to be one of the most dangerous Trick Room attackers in VGC 2021. It also utilizes its excellent bulk combined with Solid Rock to take advantage of Weakness Policy. It is most often seen on Sun teams with a Trick Room setter, as it is able to remove common Venusaur checks such as Thundurus and Rotom-H.</p> </li> <li> <p>Rock Slide is a reliable STAB move to hit common Rock-weak Pokemon such as Zapdos, Galarian Moltres, and Incineroar. When Rhyperior is Dynamaxed, Max Rockfall sets sand, which improves Rhyperior's rather poor Special Defense.</p> </li> <li> <p>High Horsepower is Rhyperior's Ground-type STAB move of choice over Earthquake, as it doesn't hit teammates. It is able to hit Pokemon such as Metagross and Stakataka that resist its Rock Slide.</p> </li> <li> <p>Ice Punch is a crucial coverage move for Rhyperior, as it allows it to hit checks such as Garchomp and Landorus-T that would otherwise threaten it.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 517038, "username": "Giokio"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Estronic"}]}], "writtenBy": [{"user_id": 527416, "username": "Bananers7"}]}
  },
  "Togekiss": {
    "sets": [
      {
        "name": "Support",
        "description": "<ul> <li> <p>Togekiss's bulk and great defensive typing, as well as its variety of support options such as Yawn, Follow Me, and Helping Hand, allow it to be an excellent support Pokemon.</p> </li> <li> <p>Dazzling Gleam lets Togekiss break Focus Sashes and pick off weakened foes even through redirection. Dazzling Gleam also has a 1/8 chance to be a critical hit due to Super Luck, which can deal big damage. Alternatively, Air Slash can hit Pokemon such as Amoonguss and Venusaur harder as well as be a nuisance to slower Pokemon such as Porygon2 and Dusclops with a nasty 60% flinch rate when paired with Serene Grace.</p> </li> <li> <p>Follow Me allows frail teammates such as Urshifu-S and Kartana to fire off attacks without fear of getting blown away by a strong attack, even absorbing any Max Move because they are all single targeting. It also helps with status conditions aimed to cripple teammates, such as burn from Will-O-Wisp and sleep from Spore and Sleep Powder. Follow Me is also excellent at helping setup sweepers such as Rotom-W and Spectrier snowball.</p> </li> <li> <p>Yawn allows Togekiss to pressure Dynamaxed Pokemon to either switch or be put to sleep, either way leaving the opposition severely crippled. Togekiss can also go with Helping Hand, however, which is useful for increasing the damage production of teammates.</p> </li> <li> <p>Babiri Berry allows Togekiss to take attacks from Metagross and Kartana better, while Safety Goggles completely shuts down Sleep Powder and Spore attempts from Venusaur and Amoonguss. Alternatively, Wacan Berry allows it to take hits from Regieleki and Thundurus better.</p> </li> </ul> "
      },
      {
        "name": "Scope Lens",
        "description": "<ul> <li> <p>Togekiss's excellent offensive coverage, good bulk, and access to Follow Me allows it to be both a potent offensive and supportive presence. Due to its Super Luck and Scope Lens, it can break through many strong Pokemon, with its damage output very hard to slow down.</p> </li> <li> <p>Dazzling Gleam is a very reliable spread move, hitting through redirection cores like Clefairy + Spectrier and Dragapult +Amoonguss. When Dynamaxed,Max Starfall can OHKO Dragapult and Grimmsnarl and acts as Terrain control by setting Misty Terrain.</p> </li> <li> <p>Air Slash is a good secondary STAB that hits what Dazzling Gleam can't, specifically Fire- and Poison-types like Entei and Venusaur. It serves as the base move for Max Airstream, allowing Togekiss to boost its speed in order to outrun threats like of Dragapult, Cinderace, and Zapdos.</p> </li> <li> <p>Heat Wave gives Togekiss the ability to severely damage Pokemon that would otherwise wall it, such as Celesteela, Glastrier, and Kartana. It can also set sun with Max Flare, which is relevant if Togekiss is paired with Fire-types such as Incineroar, Torkoal, and Charizard. Protect can also be used over Heat Wave in order to keep Togekiss around longer and is helpful for stalling out Trick Room turns or a foe's Dynamax.</p> </li> <li> <p>Follow Me is useful for granting safe turns for Togekiss's allies, either by giving them a free turn to set up or helping them avoid a Max Move from an opposing Pokemon in order to attack back with their own powerful blow.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 901591, "username": "zeefable"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Estronic"}]}], "writtenBy": [{"user_id": 527416, "username": "Bananers7"}, {"user_id": 540374, "username": "Jomatoes"}]}
  },
  "Mamoswine": {
    "sets": [
      {
        "name": "Offensive",
        "description": "<ul> <li> <p>Mamoswine is one of the most threatening Pokemon in the metagame. Between its sky-high Attack stat, great offensive typing, and immunity to Intimidate because of Oblivious, it can blow massive holes in opposing teams.</p> </li> <li> <p>High Horsepower is the chosen Ground-type STAB move and is used over Earthquake as it doesn't hit Mamoswine's teammates. It hits Fire-types such as Incineroar and Entei, as well as Steel-types such as Heatran and Metagross, which would otherwise resist its Ice-type attacks. High Horsepower also turns into Max Quake if you choose to Dynamax Mamoswine, providing useful Special Defense buffs.</p> </li> <li> <p>Icicle Crash is chosen over Icicle Spear because of its consistency. It hit a variety of Pokemon for super effective damage, such as Zapdos, Landorus-T, and Dragapult.</p> </li> <li> <p>Ice Shard is very useful to pick off fast Focus Sash users such as Whimsicott and Regieleki.</p> </li> <li> <p>Mamoswine can run Life Orb to boost its already massive Attack, but it can also run Focus Sash to survive a hit against Pokemon such as Rillaboom and Venusaur.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 901951, "username": "zeefable"}]}, {"name": "Grammar checked by", "members": [{"user_id": 301217, "username": "Bandkrook"}]}], "writtenBy": [{"user_id": 527416, "username": "Bananers7"}]}
  },
  "Porygon-Z": {
    "sets": [
      {
        "name": "Dynamax Attacker",
        "description": "<ul> <li> <p>Porygon-Z makes use of its amazing Special Attack paired with Adaptability to threaten almost the entire metagame. While its attacking potential is one of the best, its low bulk, average Speed, and need to Dynamax to perform well are often a burden; therefore, it needs to be supported by a redirector such as Clefairy or Togekiss.</p> </li> <li> <p>Hyper Beam lets Porygon-Z unleash a 300 Base Power Max Strike, capable of shredding even bulky foes like Tapu Fini, Incineroar, and Grimmsnarl. Moreover, Max Strike lowers the foe's Speed, allowing Porygon-Z to outspeed Urshifu-R, Garchomp, and Galarian Moltres.</p> </li> <li> <p>Dark Pulse hits Ghost-types such as Spectrier and Dragapult that are immune to Hyper Beam while also lowering their Special Defense when Dynamaxed.</p> </li> <li> <p>Trick Room allows Porygon-Z to function on mixed archetypes that feature slow Pokemon such as Glastrier and Torkoal. Nasty Plot can be used as an alternative to boost Porygon-Z's Special Attack, but it isn't usually needed, as its immediate power is more than enough to threaten the majority of the metagame, and using Nasty Plot would require even more redirection support to function well.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 294287, "username": "Raineko"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Estronic"}]}], "writtenBy": [{"user_id": 517038, "username": "Giokio"}]}
  },
  "Rotom-Heat": {
    "overview": "<p>Rotom-H shines more than ever with the amount of Steel- and Grass-types in the current metagame, such as Rillaboom, Kartana, and Celesteela, all of which it can check. Its amazing defensive typing also lets it take on Glastrier, Metagross and Venusaur with relative ease. In addition, it becomes a threatening Pokemon under Dynamax after a Nasty Plot or two. However, it struggles against Pokemon such as Assault Vest Landorus-T, as well as against damage reductions such as Grimmsnarl's Light Screen and Incineroar's Snarl. Further, it relies on Nasty Plot to boost its comparatively meager Special Attack stat, meaning it often has matchups where it is unable to set up and simply dead weight.</p> ",
    "sets": [{"name": "Nasty Plot", "description": "<ul> <li> <p>Overheat allows Rotom-H to hit Steel- and Grass-types such as Rillaboom and Kartana. It is also able to change the weather as Max Flare during Dynamax.</p> </li> <li> <p>Nasty Plot is used to offset Overheats Special Attack drop as well as increase Rotom-H's damage output. Rotom-H is typically able to set up easily thanks to its typing.</p> </li> <li> <p>Safety Goggles is used to block sleep moves from Venusaur and Amoonguss, as well as Rage Powder from the latter. Sitrus Berry can be used instead to increase Rotom-Hs longevity.</p> </li> </ul> "}],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 493619, "username": "Piley"}, {"user_id": 501951, "username": "zeefable"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 517788, "username": "GimTomato"}]}
  },
  "Rotom-Wash": {
    "sets": [{"name": "Offensive", "description": "<ul> <li> <p>Rotom-W's typing lets it be a good defensive check to multiple top threats such as Tapu Fini, Lapras, and Charizard. However, it can also be a potent Dynamax sweeper when set up.</p> </li> <li> <p>Hydro Pump is a strong STAB move that can make quick work of Pokemon such as Incineroar, Coalossal, and Rotom-H. It also grants access to a powerful Max Geyser, which can be used to set rain.</p> </li> <li> <p>Thunderbolt hits Tapu Fini, Galarian Moltres, and Celesteela for big damage. Additionally, it can be used to set Electric Terrain, though it is worth mentioning that Rotom-W cannot take advantage of it due to Levitate.</p> </li> <li> <p>Rotom-W can easily set up Nasty Plots due to it being able to stonewall many top threats such as Landorus-T, Garchomp and Spectrier. This can allow it to easily set up sweeps, especially with redirection or Fake Out support from Amoonguss or Incineroar, respectively.</p> </li> </ul> "}],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 501951, "username": "zeefable"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Estronic"}]}], "writtenBy": [{"user_id": 527416, "username": "Bananers7"}]}
  },
  "Heatran": {
    "sets": [
      {
        "name": "Offensive",
        "description": "<ul> <li> <p>Heatran packs a high Special Attack and access to both Max Steelspike and Max Quake to boost both of its defenses, making it a potent special attacker that's equally difficult to take down.</p> </li> <li> <p>Heat Wave gives Heatran a consistent spread move while also serving as the base move for its powerful Max Flare. Its ability to set sun for itself is incredibly useful, strengthening its Fire-type attacks and covering for its Water weakness.</p> </li> <li> <p>Flash Cannon is useful for hitting the numerous Ice- and Fairy-types in the metagame like Glastrier, Clefairy, and Grimmsnarl. Heatran also appreciates the Defense boost from Max Steelspike, which allows it to take a Max Quake from Garchomp at +1 Defense.</p> </li> <li> <p>Earth Power complements Heatran's STAB move combination well by nailing Fire-types like Incineroar while also being helpful for hitting Regieleki and Nihilego.</p> </li> <li> <p>The Speed EVs allow Heatran to outrun Adamant Tyranitar as well as Pheromosa in Tailwind. The HP investment combined with a Shuca Berry allows it to easily survive a Max Quake from Landorus-T.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 517038, "username": "Giokio"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 501951, "username": "zeefable"}]}
  },
  "Regigigas": {
    "overview": "<p>With its enormous base 160 Attack stat, great defensive stats, and a single weakness, Regigigas rivals even Restricted Pokemon in terms of raw strength and bulk. Regigigas is even capable of firing off continuous 150 Base Power Max Strikes. It also has a fair amount of decent coverage moves including the elemental punches, High Horsepower, and Darkest Lariat. However, it has an obvious downside in Slow Start, making it extremely reliant on Weezing as a partner to remove this burden.</p> ",
    "sets": [
      {
        "name": "Offensive",
        "description": "<ul> <li> <p>Giga Impact provides a 150 Base Power Max Strike as Regigigas's primary damage dealing option that also drops the opposing Pokemon's Speed as an added bonus.</p> </li> <li> <p>High Horsepower is Regigigas's method of breaking through opposing Steel-types such as Metagross, Stakataka and Heatran that Giga Impact would otherwise struggle to hit. It also boosts its ally's Special Defense with Max Quake, which can be vital for extra survivability against Spectrier and Rotom-H.</p> </li> <li> <p>Ice Punch offers Regigigas a way of breaking through Pokemon such as Landorus-T and Garchomp much more easily. Thunder Punch, on the other hand, helps deal with many Pokemon weak to Electric such as Galarian Moltres and Tapu Fini, and it can also set Electric Terrain with Max Lightning to block sleep moves from Venusaur and Amoonguss.</p> </li> <li> <p>Protect lets Regigigas stall out a few turns of Slow Start when Weezing is not on the field.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 501951, "username": "zeefable"}, {"user_id": 300598, "username": "Netherious"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 294287, "username": "Raineko"}]}
  },
  "Cresselia": {
    "sets": [
      {
        "name": "Support",
        "description": "<ul> <li> <p>Ice Beam lets Cresselia hit Landorus-T, Garchomp, and Zapdos fairly hard while not having to invest in Special Attack. Icy Wind is useful for speed control, supporting middling-Speed Pokemon such as Heatran and Tapu Fini while also canceling out opposing Max Airstream.</p> </li> <li> <p>Cresselia makes excellent use of Trick Room thanks to its solid defenses and access to Levitate, both of which often make it hard to remove easily.</p> </li> <li> <p>Helping Hand is very useful for increasing Cresselia's partner's offensive pressure, as it typically has very little of its own. It pairs especially well with Pokemon like Glastrier that often get inflicted by Intimidate from Incineroar, making up for the Attack drop.</p> </li> <li> <p>Ally Switch allows Cresselia to sponge hits such as Max Moves that its partner would rather avoid. Moonblast OHKOes any Urshifu-S not carrying a Focus Sash. Psychic hits Urshifu-R, Venusaur, and Amoonguss, but it is very weak on neutral targets.</p> </li> <li> <p>Mental Herb ensures Cresselia can effectively set Trick Room without being disrupted by Taunt or Encore. Colbur Berry allows Cresselia to survive a Choice Band-boosted Wicked Blow from Urshifu-S, while Sitrus Berry gives it some nice recovery.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 294287, "username": "Raineko"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Estronic"}]}], "writtenBy": [{"user_id": 501951, "username": "zeefable"}]}
  },
  "Excadrill": {
    "sets": [
      {
        "name": "Offensive",
        "description": "<ul> <li> <p>With a solid base 135 Attack stat, ability in Sand Rush, and great typing, Excadrill can easily find its way onto any sand team. Excadrill's typing allows it to be a proficient Dynamax attacker, with its Max Quake and Max Steelspike boosting its defenses. This makes Tyranitar a brilliant partner, as, while in sand, Excadrill can outspeed any threat in the metagame.</p> </li> <li> <p>Earthquake is Excadrill's primary choice for a Ground STAB move, as it turns into a strong Max Quake while also being a decent spread option outside of Dynamax. High Horsepower is another option that has a higher single target Base Power at the cost of a small amount of accuracy; however, its main strength is that Grassy Terrain from Rillaboom doesn't decrease its power unlike Earthquake.</p> </li> <li> <p>Iron Head is Excadrill's strongest physical Steel-type move, allowing for defense boosts as Max Steelspike as well as offering the chance to flinch when not Dynamaxed.</p> </li> <li> <p>Rock Slide is a good coverage move for Excadrill that can help it overcome the likes of Charizard, Zapdos and, Galarian Moltres; it becomes the base for Max Rockfall, allowing Excadrill to set the sand in the absence of Tyranitar. It also enables the chance to flinch both opposing Pokemon due to Excadrill's blistering Speed when in sand.</p> </li> <li> <p>Swords Dance gives Excadrill the opportunity to become a potent setup sweeper, as well as the potential to undo any Intimidate drops from the likes of Incineroar or Landorus-T.</p> </li> <li> <p>Life Orb is the main item for Excadrill, as it allows for a consistent boost to its damage output at the cost of some recoil. Weakness Policy is a great alternative due to Excadrill's desire to Dynamax, giving it the necessary bulk in conjunction with the chance to boost its defenses. Focus Sash is a solid item for Excadrill due to its poor bulk outside of Dynamax, and it is best used alongside Swords Dance to give it a good opportunity for a turn of setup.</p> </li> <li> <p>An Adamant nature is best used when using Sand Rush, as partners such as Tyranitar can easily set sand for Excadrill making up for the lack of Speed-boosting nature. A Jolly nature with Mold Breaker can be considered to act as a check to Rotom-H and Rotom-W.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 501951, "username": "zeefable"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Estronic"}]}], "writtenBy": [{"user_id": 294287, "username": "Raineko"}]}
  },
  "Whimsicott": {
    "overview": "<p>In a metagame packed with multiple lightning-fast attackers, having reliable speed control can be the difference between a win and a loss, which is exactly what Whimsicott can consistently provide. It has seemingly unlimited options for support moves that can either enable its partner or disrupt the opposing Pokemon. Its Fairy-type STAB moves also certify it as an offensive threat capable of aiding its partner in powerful double targets or outright OHKOing Urshifu-S. However, as Whimsicott is so geared toward a supporting role, it's often reliant on its partner for to make progress in the game. A well-timed Trick Room from the opponent will pretty much ruin anything that Whimsicott hopes to set up as well.</p> ",
    "comments": "<h1>Other Options</h1> <p>Energy Ball is an option for an extra attacking move, though Whimsicott loses some if its supportive capability. Trick Room can be used for its surprise factor to counteract opposing speed control, but there are typically few chances to use it well. Charm is a solid option for crippling opposing physical attackers; however, Whimsicott would much rather spend its turn enabling its partner instead of annoying the opponent.</p> ",
    "sets": [
      {
        "name": "Tailwind Support",
        "description": "<ul> <li> <p>Moonblast is Whimsicott's preffered attacking option for doing significantly more damage to Garchomp and Galarian Moltres, but Dazzling Gleam has a niche in pairing well with strong Max Moves to pick up a KO and score some extra damage on the remaining foe.</p> </li> <li> <p>Whimsicott's Tailwind is practically guaranteed thanks to Prankster, allowing it and its partner to outspeed the metagame's fastest threats such as Regieleki, Dragapult, and Venusaur in sun.</p> </li> <li> <p>Helping Hand has a wider range of usefulness, being able to aid physical attackers and function within Psychic Terrain. Fake Tears, however, is recommend if Whimsicott is paired with strong special attackers like Spectrier and Zapdos.</p> </li> <li> <p>Protect keeps Whimsicott safe from Fake Outs aimed at it to prevent Tailwind from being set up. Alternatively, Taunt is notable for shutting down opposing support Pokemon including Amoonguss, Tornadus, and Porygon2.</p> </li> <li> <p>The combination of Switcheroo and Eject Button is useful for disrupting a foe's Dynamax, as they will be forced to switch out if the Eject Button is activated by a partner.</p> </li> <li> <p>Focus Sash is the recommended item, but as Whimsicott often finds its niche on hyper offensive teams, there's a very high chance that Focus Sash may already have been taken. In this case, Coba Berry makes for a solid replacement, allowing it to stomach a stray Max Airstream or Hurricane.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 294287, "username": "Raineko"}, {"user_id": 300598, "username": "Netherious"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "The Dutch Plumberjack"}]}], "writtenBy": [{"user_id": 501951, "username": "zeefable"}]}
  },
  "Gothitelle": {
    "sets": [
      {
        "name": "Trapper",
        "description": "<ul> <li> <p>Gothitelle makes use of Shadow Tag and its wide range of supportive moves such as Helping Hand and Fake Out to aid partners like Politoed, Kingdra, and Thundurus.</p> </li> <li> <p>Gothitelle can set up Trick Room fairly easily if it traps passive foes like Gigantamax Lapras, Porygon2, and Amoonguss. Offensive partners like Glastrier and Kingdra appreciate Shadow Tag easing prediction.</p> </li> <li> <p>Protect is important on Gothitelle, as it allows for it to keep the Shadow Tag trap. Generally, it will want to use Protect very often in order to keep itself safe for as long as possible. Psychic allows Gothitelle to generate some offensive pressure of its own.</p> </li> <li> <p>Focus Sash lets Gothitelle guarantee Trick Room in the face of powerful attacks like Max Phantasm from Dragapult and Max Darkness from Galarian Moltres. Mental Herb allows it to avoid being completely crippled by stray Taunt or Encore, while Lum Berry keeps it safe from status like Torkoal's Yawn and Amoonguss's Spore.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 294287, "username": "Raineko"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Estronic"}]}], "writtenBy": [{"user_id": 501951, "username": "zeefable"}]}
  },
  "Amoonguss": {
    "sets": [
      {
        "name": "Support",
        "description": "<ul> <li> <p>Amoonguss functions as a potent support Pokemon in the metagame, boasting amazing bulk and having access to a wide array of support options in redirection, recovery in Regenerator, and status infliction. Furthermore, its low Speed helps it function as a potential check to Trick Room attackers such as Porygon2 and Regirock.</p> </li> <li> <p>Amoonguss's primary means of offense comes in the form of Sludge Bomb, which can be used to thwart popular Fairy-type Pokemon such as Clefairy and Tapu Fini. Meanwhile, Pollen Puff is a good support move to help heal Amoonguss's partner Pokemon. Clear Smog can be used if the team struggles against setup sweepers like Tapu Fini, Spectrier, and Galarian Moltres.</p> </li> <li> <p>Spore is used to put opposing non-Grass-type Pokemon to sleep such as Torkoal, Clefairy, and Garchomp. Putting opposing Pokemon to sleep gives Amoonguss's teammates such as Landorus-T and Galarian Moltres free turns to set up and shut down a Dynamaxed Pokemon and helps stall out Trick Room.</p> </li> <li> <p>Rage Powder allows Amoonguss to redirect incoming attacks onto itself while allowing its partner Pokemon to set up or dish out damage. This is especially useful in the Dynamax format to soak up Max Moves.</p> </li> <li> <p>Coba Berry lets Amoonguss stay safe while facing Max Airstream users like Thundurus, Landorus-T, and Galarian Moltres. Focus Sash, on the other hand, can be used to survive any one move that could potentially OHKO Amoonguss.</p> </li> <li> <p>220 HP EVs, 188 Defense EVs, and a Relaxed nature let Amoonguss take Glastrier's Icicle Crash, while 0 Speed IVs allow it to underspeed Regirock, Porygon2, and some Glastrier variants.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 501951, "username": "zeefable"}]}, {"name": "Grammar checked by", "members": [{"user_id": 297659, "username": "deetah"}]}], "writtenBy": [{"user_id": 239881, "username": "Mr.GX"}]}
  },
  "Ferrothorn": {
    "sets": [
      {
        "name": "Iron Defense",
        "description": "<ul> <li> <p>With Ferrothorn's great defensive typing and solid natural bulk, it is able to be a consistent and very respectable win condition against many top threats, such as Porygon2 and Landorus-T.</p> </li> <li> <p>Body Press is Ferrothorn's sole offensive option. After Ferrothorn has used Iron Defense a few times, it's capable of putting dents in a majority of the metagame, including Rillaboom, Incineroar, and Kartana.</p> </li> <li> <p>Ferrothorn can easily set up Iron Defense in the face of many attackers. After an Iron Defense, it is basically untouchable by a majority of the physical Pokemon in the metagame, including Landorus-T and Glastrier.</p> </li> <li> <p>Leech Seed is a way for Ferrothorn to recover while slowly chipping at its foes. It is excellent for wearing down Pokemon without reliable recovery, like Dragapult and Thundurus.</p> </li> <li> <p>212 HP EVs maximize Leftovers recovery, while 252 Special Defense EVs allow Ferrothorn to better stand up to strong special attackers like Regieleki and Spectrier.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 501951, "username": "zeefable"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 527416, "username": "Bananers7"}]}
  },
  "Volcarona": {
    "sets": [{"name": "Utility", "description": "<ul> <li> <p>Volcarona's access to Rage Powder, Steel resistance, and Flame Body ability make it a good choice as a supportive Pokemon, as it is able to handle the likes of Zacian-C and Necrozma-DM with ease. It also comes with a hefty base 135 Special Attack stat that allows it to go on the offensive when needed.</p> </li> <li> <p>Overheat allows Volcarona to always ensure KOs on Jolly Zacian-C and Metagross. Heat Wave is a consistent spread option that doesn't drop Volcarona's Special Attack stat at the cost of lower Base Power.</p> </li> <li> <p>Struggle Bug allows Volcarona to reduce the impact of specially attacking threats such as Kyogre and Calyrex-S, whereas Will-O-Wisp cripples physical attackers such as Thundurus and Groudon.</p> </li> <li> <p>Focus Sash is the item of choice for Volcarona, allowing it to absorb at least two attacks if it uses Rage Powder immediately.</p> </li> </ul> "}],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 501951, "username": "zeefable"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 294287, "username": "Raineko"}]}
  },
  "Terrakion": {
    "sets": [
      {
        "name": "Offensive",
        "description": "<ul> <li> <p>Terrakion's great offensive typing, fairly high Attack stat, and base 108 Speed allows it to outpace and dominate some of the biggest threats in the metagame such as Zapdos, Galarian Moltres, Charizard and Urshifu-S. Beat Up users such as Dragapult and Whimsicott can also use Terrakion's Justified to boost its Attack to extremely high levels.</p> </li> <li> <p>Rock Slide is Terrakion's Rock-type STAB of choice, as it is a fairly consistent spread move with a chance to flinch that threatens opponents such as Galarian Moltres, Zapdos, and Torkoal. Max Rockfall can be used to break momentum of weather-based teams by setting up sand.</p> </li> <li> <p>Close Combat deals massive damage to opponents such as Urshifu-S, Glastrier, and Incineroar, but the drop in defenses can put Terrakion in a difficult situation. Using Close Combat is a good way to secure a hit, because Rock Slide can miss and ruin a game. Terrakion can also increase its Attack stat by using Max Knuckle in order to become even more threatening.</p> </li> <li> <p>Helping Hand is a great support move, as it gives a boost to Terrakion's teammates when attacking. In general, it helps offensive teammates such as Dragapult, Venusaur, and Torkoal deal with bulkier threats when Terrakion hasn't used Dynamax. Stomping Tantrum is a coverage option that hits metagame staples like Metagross. It can also be used to boost Special Defense when Dynamaxed.</p> </li> <li> <p>White Herb lets Terrakion stay on the field against Intimidate users, such as Incineroar and Landorus-T, it's useful to ignore drops in Terrakion's defenses from Close Combat. It also prevents Terrakion's stats from being lowered by Max Moves such as Max Wyrmwind and Max Phantasm once. Lum Berry allows Terrakion to shake off a multitude of status inducing attacks such as Dragapult's Will-O-Wisp, Amoonguss's Spore and Venusaur's Sleep Powder.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 517038, "username": "Giokio"}]}, {"name": "Grammar checked by", "members": [{"user_id": 301217, "username": "Bandkrook"}]}], "writtenBy": [{"user_id": 532762, "username": "Hervalt"}]}
  },
  "Tornadus": {
    "overview": "<p>In a metagame where Tailwind is more important than ever, Tornadus has solidified itself as a staple support Pokemon, mostly alongside Kyogre. Its access to Rain Dance and Taunt allows it to easily enable its partners while carrying a strong Hurricane for when Tornadus needs to go on the offensive. However, its Flying typing makes it much more vulnerable to getting shut down by Prankster Taunt or Fake Out due to its inability to make use of Terrains. Its support movepool is very limited, which can make it seem underwhelming as a utility Pokemon compared to Grimmsnarl or Amoonguss. Tornadus also faces heavy competition with Whimsicott as a Tailwind setter, since it's faster and has a bigger support movepool, so Tornadus is often limited to being used on teams utilizing Kyogre.</p> ",
    "comments": "<h1>Other Options</h1> <p>Icy Wind grants even more speed control on top of Tailwind, notably combating opposing attempts at Speed boosting from Max Airstream and Tailwind. Heat Wave gives Tornadus a spread move option and a strong way to hit Kartana. Brutal Swing helps activate Weakness Policy for partners such as Metagross and Solgaleo. Safety Goggles can be useful for denying sleep but is only useful if there's an Amoonguss or Venusaur on the opponent's team.</p> ",
    "sets": [{"name": "Tailwind Support", "description": "<ul> <li> <p>Hurricane's higher Base Power is preferred because of how often it finds itself with Kyogre. If it isn't with Kyogre however, Air Slash can be used to avoid Hurricane's shaky accuracy.</p> </li> <li> <p>Tailwind is very easy to set up thanks to Prankster, and it grants Tornadus and its partner the ability to outspeed even the likes of Regieleki and Calyrex-S.</p> </li> <li> <p>Taunt provides a means of shutting down supportive Pokemon like Amoonguss and Porygon2, while Rain Dance puts Kyogre at ease against other weather setters like Groudon and Torkoal.</p> </li> <li> <p>Focus Sash lets Tornadus take a heavy hit after getting Tailwind up, although Wacan Berry is a good alternative to survive an attack from the likes of Regieleki and Zapdos if a teammate is already using Focus Sash. Alternatively Mental Herb gives Tornadus a guaranteed way to set Tailwind in front of Whimsicott.</p> </li> </ul> "}],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 501951, "username": "zeefable"}, {"user_id": 493619, "username": "Dragonpiley007"}]}, {"name": "Grammar checked by", "members": [{"user_id": "userid1", "username": "username1"}]}], "writtenBy": [{"user_id": 408293, "username": "AustinXX555"}]}
  },
  "Thundurus": {
    "sets": [
      {
        "name": "Offensive",
        "description": "<ul> <li> <p>Defiant Thundurus is an excellent Pokemon to use in the face of common Intimidate users like Incineroar and Landorus-T. Its high Speed and Attack coupled with decent defenses make it hard to counter easily.</p> </li> <li> <p>Fly is used to give Thundurus access to Max Airstream, acting as both a powerful STAB move and a reliable means of speed control.</p> </li> <li> <p>Superpower lets Thundurus pummel Incineroar and Tyranitar, gives it a strong move to click in the face of Lightning Rod and allows it to boost its Attack with Max Knuckle.</p> </li> <li> <p>Lash Out is a solid filler option on Assault Vest sets, as it lets Thundurus use Max Darkness to lower foes' Special Defense, something special attacking teammates like Venusaur and Spectrier can capitalize on.</p> </li> <li> <p>Life Orb will allow Thundurus to notably OHKO Incineroar with Max Airstream at +1. Assault Vest is helpful for letting Thundurus better check prominent special attackers such as Spectrier and Tapu Lele.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 294287, "username": "Raineko"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Estronic"}]}], "writtenBy": [{"user_id": 501951, "username": "zeefable"}]}
  },
  "Landorus-Therian": {
    "overview": "<p>Access to Intimidate and a strong Ground / Flying typing as well as a high base 145 Attack stat have made Landorus-T one of the strongest Pokemon in the format. A metagame dominated by Fire- and Steel-types, such as Heatran and Metagross, allows it to shine even further due to the offensive pressure it puts on them. Because of this, Landorus-T also makes for an excellent Dynamax user, dishing out powerful Max Moves such as Max Airstream and Max Quake. Intimidate is a vital tool in as it allows the team to mitigate damage from strong physical threats such as Rillaboom and Kartana. However, Landorus-T packs a few significant downsides, including a 4x weakness to Ice, so it falls very quickly to Porygon2 and Glastrier. It is also very common for teams to include Pokemon with abilities such as Defiant and Competitive, such as Thundurus and Milotic, in order to punish Landorus-T for switching in.</p> ",
    "comments": "<h1>Other Options</h1> <p>Landorus-T makes for a decent Choice Scarf user, as it will outspeed both Dragapult and Cinderace and deal significant damage to them, though it is lacking in power. Landorus-T can utilize Choice Band for a stronger Earthquake but becomes useless in Dynamax.</p> ",
    "sets": [
      {
        "name": "Swords Dance",
        "description": "<ul> <li> <p>Earthquake allows Landorus-T to hit all of the popular Steel-type restricted Pokemon like Incineroar and Metagross for super effective damage. Max Quake is also an extremely powerful Max Move, allowing Landorus-T to boost its Special Defense while dishing out massive single target damage.</p> </li> <li> <p>Rock Slide is a great spread move that gives Landorus-T a better matchup against Flying-types such as Galarian Moltres and Zapdos while also allowing it to use Max Rockfall to change the weather in the face of sun or rain teams. Fly, on the other hand, is mostly used for a powerful Max Airstream, which lets Landorus-T boost its Speed while doing big damage to Grass-types like Amoonguss and Rillaboom.</p> </li> <li> <p>Swords Dance allows Landorus-T to stand up better against Dynamaxed threats such as Metagross. +2 Max Quake can even OHKO it before it gets any defensive boosts from its own Max Moves.</p> </li> <li> <p>Lum Berry is the preferred item due to the prevalence of Will-O-Wisp and Amoonguss's Spore in the metagame. This allows Landorus-T to switch into any status move and shrug it off for free. Life Orb allows Landorus-T to dish out increased damage but leaves it as a prime target for Will-O-Wisp and sleep moves.</p> </li> </ul> "
      },
      {
        "name": "Assault Vest",
        "description": "<ul> <li> <p>Earthquake allows Landorus-T to deal big damage to many of the most common Pokemon in the metagame such as Incineroar and OHKO Regieleki.</p> </li> <li> <p>Fly is mainly used when Landorus-T is Dynamaxed, as it allows it to fire off super strong STAB Max Airstreams. At +1 Speed, it can outspeed Thundurus, Kartana, Urshifu-S, and Urshifu-R. Fly can also be useful in some late-game situations outside of Dynamax when it can be used to force opposing Max Moves to miss while it is in the air. Superpower is sometimes an option when the team lacks a consistent means of hitting Kartana and Ferrothorn for super effective damage. Max Knuckle can also be nice for boosting Landorus-T's Attack stat.</p> </li> <li> <p>U-turn maximizes Landorus-T's pivoting potential by allowing it to Intimidate opposing Pokemon and then switch out into one of its teammates.</p> </li> <li> <p>This set leans into Landorus-T's defensive capabilities and allows it to act more as a pivot while still serving as a strong offensive option while Dynamaxed. The EV spread allows it to survive a variety of super effective moves while Dynamaxed, including -1 Attack Icicle Crash from Glastrier, Max Geyser from Rotom-W, and Surging Strikes from Urshifu-R.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 294287, "username": "Raineko"}, {"user_id": 501951, "username": "zeefable"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "martha"}]}], "writtenBy": [{"user_id": 362569, "username": "Jashsmash"}]}
  },
  "Incineroar": {
    "overview": "<p>Incineroar's bulk and dynamic movepool make it arguably the best supporting Pokemon in the format, primarily offering move options like Fake Out, Snarl, and Taunt and utilizing Intimidate and Parting Shot to weather the opponent's offensive. Its typing is perfect for checking the multitudes of Ghost- and Steel-type Pokemon dominating the metagame, like Spectrier and Kartana. The unique supportive options provided by Incineroar make it an easy inclusion for most teams. However, STAB moves from Rotom-W and Choice Band Urshifu-S and Urshifu-R will surely cause the cat to cower, and the prevalence of Fighting- and Ground-type coverage on common Pokemon, like Glastrier's Close Combat and Rillaboom's High Horsepower, enables them to continue hitting Incineroar fairly hard, even after an Attack drop from Intimidate. Incineroar's base 60 Speed also means it is outsped by the vast majority of the metagame.</p> ",
    "comments": "<h1>Other Options</h1> <p>Assault Vest can be used to better take strong special attacks from Regieleki or Tapu Fini. An Impish nature allows Incineroar to safely take Max Quake and Close Combat from Adamant Landorus-T and Urshifu-S, respectively. Will-O-Wisp and Burning Jealousy are options that punish common setup attackers such as Swords Dance Garchomp and Landorus-T. Will-O-Wisp has lower accuracy but will always burn when it hits. On the other hand, Burning Jealousy is a nice spread option for Incineroar, but it requires the foe to boost a stat in order to burn. Close Combat hits Dark-types like opposing Incineroar and Rock-types like Nihilego and Stakataka much harder than Flare Blitz. Incineroar's respectable base 115 Attack makes it a potential Dynamax candidate and, if running Close Combat, offers coveted Max Knuckle boosts. Weakness Policy is a fringe option that further amplifies the threat of Incineroar when Dynamaxed. 84 Speed EVs can be used to reach 91 Speed, outspeeding a fully invested Amoonguss.</p> ",
    "sets": [
      {
        "name": "Support",
        "description": "<ul> <li> <p>Flare Blitz is a necessity on Incineroar, providing relevant damage output against Grass- and Steel-types like Venusaur, Rillaboom, and Metagross. Incineroar's sizeable bulk mitigates the impact of the recoil.</p> </li> <li> <p>Parting Shot minimizes the damage the opponent's threats can dish out while resetting Intimidate and Fake Out. It combines well with Incineroar's low Speed as well, safely bringing a teammate in when the danger has passed.</p> </li> <li> <p>Taunt provides utility against opposing support Pokemon like Grimmsnarl and Porygon2. Darkest Lariat is a secondary damage option, useful for hitting Pokemon that shrug off Flare Blitz like Charizard and Rotom-W while also ignoring Defense boosts from Max Steelspike.</p> </li> <li> <p>Sitrus Berry is slightly preferred over Figy Berry because it activates more consistently. Safety Goggles allows Incineroar to better check Venusaur and Amoonguss. Shuca Berry gives Incineroar survivability against powerful Max Quakes from Garchomp, Landorus-T, and Mamoswine.</p> </li> <li> <p>The defensive investment allows Incineroar to take strong physical attacks like Urshifu-S's Close Combat after an Intimidate and powerful special attacks such as +2 Max Airstream from Galarian Moltres.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 294287, "username": "Raineko"}, {"user_id": 493619, "username": "Dragonpiley007"}, {"user_id": 501951, "username": "zeefable"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Estronic"}]}], "writtenBy": [{"user_id": 377427, "username": "smogon account"}]}
  },
  "Mimikyu": {
    "sets": [
      {
        "name": "Trick Room",
        "description": "<ul> <li> <p>With its Ghost typing and Disguise, Mimikyu is a unique supportive presence in the current metagame. Disguise allows Mimikyu to absorb a hit from the vast majority of the metagame, and then set Trick Room largely undeterred. It also comes with a good amount of other supportive options in Will-O-Wisp and Taunt.</p> </li> <li> <p>Shadow Sneak is Mimikyu's primary attacking move due to its middling Speed tier being less than ideal in Trick Room. Shadow Sneak can support partners such as Weakness Policy Metagross.</p> </li> <li> <p>Taunt is an option to lower the impact of opposing supportive Pokemon such as Porygon2 and Amoonguss. Play Rough serves as a method to overcome offensive Dark-types such as Galarian Moltres and Urshifu-S. Phantom Force is a higher Base Power Ghost-type option that can waste opposing Dynamax turns.</p> </li> <li> <p>Will-O-Wisp lets Mimikyu significantly reduce the damage output of the biggest physically attacking threats in the metagame such as Metagross, Thundurus, and Landorus-T.</p> </li> <li> <p>Mental Herb stops Taunt from blocking Trick Room a majority of the time.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 501951, "username": "zeefable"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 294287, "username": "Raineko"}]}
  },
  "Tapu Koko": {
    "sets": [
      {"name": "Special Attacker", "description": "<ul> <li> <p>Specially offensive Tapu Koko is a good choice for hitting the metagame's bulky Water-types like Kyogre, Lapras, and Tapu Fini. Its Speed tier gives it a notable leg up on other Electric-types like Rotom-W and Zapdos, as it can outrun the likes of Kartana and Thundurus.</p> </li> <li> <p>Thunderbolt is typically preferred as the Electric-type STAB move of choice, but Thunder can be used for a stronger Max Lightning and also has synergy with Kyogre thanks to Drizzle.</p> </li> <li> <p>Dazzling Gleam gives Tapu Koko a reliable spread move as well as a powerful Max Starfall, which is great for hitting Grimmsnarl and Dragapult.</p> </li> <li> <p>Volt Switch lets Tapu Koko quickly pivot into a partner while still doing respectable damage. This is particularly helpful for baiting Max Quake and then switching to a Ground-immune ally. Alternatively, Electroweb is useful for providing reliable speed control.</p> </li> </ul> "},
      {"name": "Physical Attacker", "description": "<ul> <li> <p>Physical Tapu Koko is notable for hitting many common Water- and Grass-type Pokemon like Kyogre and Rillaboom harder than special variants.</p> </li> <li> <p>Brave Bird is Tapu Koko's main coverage move, allowing it to hit Ground-types such as Groudon and Landorus-T while also boosting its Speed with Max Airstream.</p> </li> <li> <p>U-turn is used to let Tapu Koko act as a fast pivot.</p> </li> </ul> "}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 294287, "username": "Raineko"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}]}], "writtenBy": [{"user_id": 501951, "username": "zeefable"}]}
  },
  "Tapu Lele": {
    "sets": [
      {
        "name": "Choice Specs",
        "description": "<ul> <li> <p>Choice Specs Tapu Lele is a powerful attacker that additionally assists its teammates by blocking priority moves with Psychic Surge. As it sets up Psychic Terrain automatically and deals more damage with regular moves thanks to Choice Specs, it is typically only worth Dynamaxing Tapu Lele to tank a strong attack.</p> </li> <li> <p>Psychic is Tapu Lele's most powerful STAB move, capable of 2HKOing all but the bulkiest non-resistant Pokemon and even denting Dynamaxed Pokemon such as offensive Landorus-T and Thundurus.</p> </li> <li> <p>Moonblast lets Tapu Lele hit Incineroar decently hard and deals massive damage to other Dark-types like Urshifu-S, Galarian Moltres, and Grimmsnarl.</p> </li> <li> <p>Dazzling Gleam lets Tapu Lele damage both foes at once, which also notably allows it to bypass redirection.</p> </li> <li> <p>Shadow Ball deals heavy damage to Metagross and provides super effective coverage for opposing Psychic-types, such as Cresselia and opposing Tapu Lele, while Thunderbolt lets Tapu Lele hit Celesteela as hard as possible.</p> </li> <li> <p>A Timid nature with 252 Speed EVs allows Tapu Lele to outspeed the likes of Landorus-T, Galarian Moltres, and Rotom-H.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 501951, "username": "zeefable"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Estronic"}]}], "writtenBy": [{"user_id": 375272, "username": "Eve"}]}
  },
  "Tapu Fini": {
    "overview": "<p>Thanks to a wide array of set options, a generally good movepool and access to Misty Surge, Tapu Fini establishes itself as a true jack of all trades. Tapu Fini is typically used as a more supportive Pokemon, supporting the team with Misty Terrain which is helpful against common status spreaders such as Amoonguss, Venusaur, and Spectrier. Offensive Tapu Fini, thanks to its positive matchups against Galarian Moltres and Incineroar, is a very potent pick. Unfortunately, It also has weaknesses to some of the most common offensive presences in the metagame, most notably Regieleki, Zapdos and Kartana. What distinguishes Tapu Fini from the rest is the great ability and excellent utility as a bulky water.</p> ",
    "comments": "<h1>Other Options</h1> <p>Tapu Fini may also choose to use a Choice item such as Choice Scarf or Choice Specs. Choice Scarf allows Tapu Fini to outspeed a vast majority of the metagame with the exception of Regieleki and to often perform a useful role for the team. This may include dealing a good amount of damage to faster, but weaker Pokemon such as Cinderace, using Trick to lock the opponents into a single move, or using Soak to support team members such as Zapdos and Rillaboom and often help them take a KO. Choice Specs is used on fully offensive Tapu Fini, and its damage can be devastating to unprepared teams. These both, however, come at the risk of locking Tapu Fini into a single move for extended periods of time unless it switches, which often detracts from the versatility it usually provides.</p> ",
    "sets": [
      {
        "name": "Calm Mind",
        "description": "<ul> <li> <p>Moonblast is Tapu Fini's primary attacking move, hitting Pokemon such as Grimmsnarl, Galarian Moltres, and Urshifu-S for super effective damage and offers a chance to drop the foe's Special Attack.</p> </li> <li> <p>Muddy Water is often the preferred Water-type STAB move for Tapu Fini, as it is an effective spread option that can swing games with the chance to lower both opposing Pokemon's Accuracy. After a Calm Mind boost, it can also serve as a powerful base move for Max Geyser.</p> </li> <li> <p>Calm Mind allows Tapu Fini to survive Modest Magnet Regieleki's Thunderbolt and then KO it in return with Moonblast with just a single boost, as well as generally putting it at an advantage late-game with its raised Special Attack.</p> </li> <li> <p>Calm Mind Tapu Fini often needs a source of longevity due to its lack of worthwhile natural recovery. As a result, Leftovers is the primary item for Tapu Fini, as it often wants to stay on the field for longer periods of time. Its HP maximizes recovery off of a single turn of Leftovers healing . Sitrus Berry and Aguav Berry are also other options for one-time recovery, but in longer games Leftovers often gives more recovery altogether. Tapu Fini's Speed allows it to outspeed common base 100 Speed Pokemon such as Charizard and Zapdos when at +1, often from a partner's Max Airstream or Regieleki's Electroweb.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 501951, "username": "zeefable"}, {"user_id": 300598, "username": "Netherious"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "The Dutch Plumberjack"}]}], "writtenBy": [{"user_id": 294287, "username": "Raineko"}]}
  },
  "Nihilego": {
    "sets": [{"name": "Meteor Beam", "description": "<ul> <li> <p>Nihilego makes use of its good Speed tier and solid offensive typing to be a potent special attacker. It can quickly accrue Special Attack boosts and start a sweep thanks to the combination of Meteor Beam and Beast Boost.</p> </li> <li> <p>Meteor Beam is a powerful nuke option, capable of OHKOing Incineroar, Rotom-H, and Dynamaxed Thundurus. Power Herb is required to make sure Nihilego can use it instantly.</p> </li> <li> <p>Power Gem is a back up Rock-type STAB move, letting Nihilego continuously pressure Fire- and Flying-types after it has already used Meteor Beam. Trick Room on Nihilego is normally used to reverse opposing Trick Room, but it can also support slower attackers like Glastrier and Torkoal.</p> </li> </ul> "}],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 294287, "username": "Raineko"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Estronic"}]}], "writtenBy": [{"user_id": 501951, "username": "zeefable"}]}
  },
  "Pheromosa": {
    "sets": [
      {
        "name": "Fast Support",
        "description": "<ul> <li> <p>With a decent supportive movepool, great offensive stats, and the second highest base Speed of any Pokemon in the format, Pheromosa carves a niche in the current metagame as a dangerous supportive Pokemon that can hold its own.</p> </li> <li> <p>Close Combat is Pheromosa's main source of damage, being able to hit Fighting-weak Pokemon such as Incineroar and Urshifu-S for good damage. Due to Pheromosa's atrocious defenses, dropping them is very rarely relevant.</p> </li> <li> <p>Speed Swap is the primary reason to use Pheromosa. It's particularly potent when paired with Pokemon that have plenty of offensive pressure but lack Speed such as Glastrier and Eruption Torkoal.</p> </li> <li> <p>Coaching is a great supportive move that allows Pheromosa to substantially increase the damage output of physically attacking partners such as Glastrier, Thundurus, and Metagross.</p> </li> <li> <p>Triple Axel is the Ice-type move of choice, lending itself to Pheromosa's base 137 Attack stat and maximum Attack investment which can overcome Pokemon such as Zapdos and Galarian Moltres. Icy Wind is a great form of speed control due to Pheromosa's blistering Speed; on the other hand, Ice Beam is a good move that applies heavy pressure to Landorus-T.</p> </li> <li> <p>Due to Pheromosa's terrible defensive stats, Focus Sash is the only item worth running to allow Pheromosa to have multiple opportunities to perform its supportive role.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 501951, "username": "zeefable"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Estronic"}]}], "writtenBy": [{"user_id": 294287, "username": "Raineko"}]}
  },
  "Celesteela": {
    "sets": [
      {
        "name": "Offensive",
        "description": "<ul> <li> <p>Offensive Celesteela can provide a bulky Steel-type option to any team, as well as a potent Dynamax candidate that is capable of boosting its Defense with Max Steelspike or its Speed with Max Airstream. Beast Boost can also help it become a particularly potent offensive threat when left unchecked.</p> </li> <li> <p>Flash Cannon offers Celesteela a consistent way to overcome Glastrier, Grimmsnarl, and Nihilego while also providing it Max Steelspike to boost its Defense when Dynamaxed.</p> </li> <li> <p>Air Slash allows Celesteela to effectively handle threats such as Urshifu-S and Venusaur while also giving it Max Airstream to boost its Speed when Dynamaxed.</p> </li> <li> <p>Meteor Beam gives Celesteela access to Max Rockfall, allowing it to fire off a move that's particularly effective against Incineroar, Thundurus, and Charizard.</p> </li> <li> <p>Flamethrower allows Celesteela to overcome opposing Steel-types that would resist the rest of its moveset such as Kartana and Metagross.</p> </li> <li> <p>The given EV spread optimizes Celesteela's HP to be as high as possible while minimizing Life Orb recoil damage. Its Speed investment allows it to outspeed Thundurus and Kartana after a single Max Airstream.</p> </li> <li> <p>Life Orb allows Celesteela to make up for its average Special Attack stat by adding some additional firepower. Safety Goggles turns it into a hard counter for Amoonguss and Venusaur, as it blocks their sleep moves.</p> </li> </ul> "
      },
      {
        "name": "Leech Seed",
        "description": "<ul> <li> <p>Defensive Celesteela focuses on reaching an endgame where its bulk and consistent passive recovery make it completely unbeatable against the remainder of the opposing team. Additionally, any KOs it gets allows it to further boost its Special Defense with Beast Boost.</p> </li> <li> <p>Flash Cannon is Celesteela's primary source of damage, helping it overcome common Pokemon such as Grimmsnarl and Glastrier. Heavy Slam is an alternative that is capable of dealing substantial damage at a high Base Power due to Celesteela's weight, but it comes with a risk due to it failing against Dynamaxed Pokemon.</p> </li> <li> <p>Leech Seed gives Celesteela another source of recovery alongside Leftovers and a consistent win condition for endgames.</p> </li> <li> <p>Flamethrower is responsible for handling opposing Grass-types that would otherwise ignore Leech Seed such as Kartana and Rillaboom.</p> </li> <li> <p>Celesteela's EVs grant it the best chances when dueling Pokemon such as Urshifu-S and Spectrier in endgame situations.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 501951, "username": "zeefable"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Estronic"}]}], "writtenBy": [{"user_id": 294287, "username": "Raineko"}]}
  },
  "Kartana": {
    "overview": "<p>In a metagame dominated by Tapu Fini and Electric-types, Kartana stands out as one of the most reliable Grass-type options for any team. Its massive Attack stat coupled with high Speed and very useful Max Moves gives it the ability to tear through teams on its own. Even outside of Dynamax, Kartana's attacking prowess cannot be understated, especially once it has a Beast Boost or two under its belt. However, Kartana does possess a few downsides. However, its obvious weaknesses to Fire-types and strong special attacks often result in it getting KOed quickly.</p> ",
    "comments": "<h1>Other Options</h1> <p>Similarly to Aerial Ace, Giga Impact or Guillotine can be used as a speed control option in the form of Max Strike. However, because you are lowering the foes' Speed instead of boosting your own Pokemon's, any new Pokemon sent out onto the field will be unaffected.</p> ",
    "sets": [
      {"name": "Assault Vest", "description": "<ul> <li> <p>Smart Strike is used as a secondary STAB option to hit Fairy- and Ice-types such as Grimmsnarl and Glastrier. It is also useful for access to Max Steelspike for Defense boosting.</p> </li> <li> <p>Sacred Sword is Kartana's main coverage option, allowing it to hit the likes of Incineroar and Heatran. Access to Max Knuckle is also extremely helpful, as it negates Intimidate drops and can boost Kartana's Attack by two stages if it KOes an opponent.</p> </li> <li> <p>Aerial Ace is used for access to Max Airstream, providing both Kartana and its partner with a Speed boost. Notably, this allows Kartana to outspeed Modest Venusaur in sun.</p> </li> <li> <p>Maximum Special Defense investment coupled with an Assault Vest allows Kartana to take strong special attacks such as Galarian Moltres' Max Airstream and Regieleki's Max Lightning that it would be unable to otherwise.</p> </li> </ul> "},
      {
        "name": "Focus Sash",
        "description": "<ul> <li> <p>Smart Strike is necessary to hit the plethora of Fairy-type Pokemon in the metagame including Grimmsnarl, Whimsicott, and Clefairy, for as much damage as possible. If Kartana is Dynamaxed, the boosts to its Defense from Max Steelspike make it insanely durable physically.</p> </li> <li> <p>Sacred Sword complements Kartana's Grass and Steel STAB type combo to hit Incineroar, Heatran, and Urshifu-S hard. Any KOs achieved by using Max Knuckle will also raise its Attack by two stages instead of one via Beast Boost.</p> </li> <li> <p>Detect is mandatory on Focus Sash Kartana, as it is otherwise very susceptible to double targets from Fake Out and other strong special attacks such as Zapdos and Celesteela's Max Airstreams. Detect specifically is also unaffected by Imprison from Indeedee, which can only learn Protect.</p> </li> <li> <p>Focus Sash allows Kartana to not worry about compensating for its low Special Defense. Therefore, it can fully invest in its Attack, which is particularly helpful for netting higher rolls on Pokemon such as Tapu Fini and Glastrier.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 294287, "username": "Raineko"}, {"user_id": 526614, "username": "DomarpVGC"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 501951, "username": "zeefable"}]}
  },
  "Stakataka": {
    "overview": "<p>Stakataka's sky high Defense and rock bottom Speed allow it to be a very unique Trick Room setter in the current metagame. Twinned with its amazing bulk, Stakataka possesses a base 131 Attack stat and a great typing that allows it to duel common Fairy-types in metagame such as Clefairy and Grimmsnarl, as well as common Flying-type threats such as Zapdos and Galarian Moltres. Beast Boost is also an exceptional ability that allows Stakataka to either snowball offensively or become a great wall in front of foes. That being said, it also has some of the worst weaknesses in the current metagame with two 4x weaknesses to Ground and Fighting. Its low Speed also makes it incredibly reliant on Trick Room to be effective, often making it require redirection support from Indeedee-F or Amoonguss.</p> ",
    "comments": "<h1>Other Options</h1> <p>Stakataka can run alternative coverage moves such as Heat Crash and High Horsepower for dealing with opposing Steel-types such as Metagross and Heatran. However, this often means foregoing one of Stakataka's STAB moves, making it generally less effective overall.</p> ",
    "sets": [
      {
        "name": "Offensive",
        "description": "<ul> <li> <p>Gyro Ball is Stakataka's primary source of damage, with its extremely low Speed allowing it to hit for full power against almost the entirety of the metagame, but it is particularly potent against Regieleki and Spectrier. It can also be used to boost its Defense even further with Max Steelspike.</p> </li> <li> <p>Rock Slide is a nice STAB spread move for Stakataka that allows it to set the sand via Max Rockfall, patching up its Special Defense in the process. It is also the best move for Stakataka to hit Pokemon that resist Steel such as Charizard and Zapdos, which it would otherwise struggle to hit. Body Press uses Stakataka's enormous Defense stat to deal good damage to targets such as Incineroar and Ferrothorn, as well as boosting its Attack as far as 2 two stages when Dynamaxed thanks to Beast Boost. This also allows it to effectively ignore Intimidate.</p> </li> <li> <p>Trick Room allows Stakataka to serve as the team's form of speed control, while also benefitting from it itself due to being the slowest Pokemon in the current metagame.</p> </li> <li> <p>Protect is a consistent way to help increase the longevity of Stakataka, and it also allows it to avoid opposing Fake Out that would otherwise disrupt it from using Trick Room.</p> </li> <li> <p>The use of a Lonely nature and 17 Defense IVs allows Stakataka's Beast Boost to boost its Attack rather than its Defense.</p> </li> <li> <p>Shuca Berry helps Stakataka survive even the strongest Ground-type moves in the game such as Max Quake from Landorus-T and Garchomp. Weakness Policy exploits Stakataka's great physical bulk and common weaknesses in order to gain a +2 attack boost whereas Life Orb is a more consistent damage boost with a small amount of recoil, but these come at the cost of being more easily dealt with by these threats.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 501951, "username": "zeefable"}, {"user_id": 493619, "username": "Dragonpiley007"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Estronic"}]}], "writtenBy": [{"user_id": 294287, "username": "Raineko"}]}
  },
  "Rillaboom": {
    "overview": "<p>Rillaboom is a solid offensive pivot in the metagame due to its high Attack, excellent movepool, and amazing ability in Grassy Surge. With its strong Grass-type attacks like Grassy Glide and Wood Hammer, it can easily threaten metagame staples like Tapu Fini and Tyranitar. Additionally, it provides teams with a necessary Water-type check and solid support moves in Fake Out, Knock Off, and U-turn. However, it is hindered by its weaknesses to common Pokemon like Incineroar, Glastrier, and Thundurus. It is also crippled by Intimidate, which has a dominant presence in the metagame thanks to Landorus-T and Incineroar.</p> ",
    "comments": "<h1>Other Options</h1> <p>Taunt can be used on Miracle Seed sets to disrupt Amoonguss and Dusclops, which can stop Trick Room setup or Spore spam, but it is still less useful than other moves like Protect. Swords Dance can be used to further boost Rillaboom's offensive capabilities; however, it takes up a moveslot that would otherwise be used for extra coverage.</p> ",
    "sets": [
      {
        "name": "Utility",
        "description": "<ul> <li> <p>The combination of Grassy Glide and Grassy Terrain allows Rillaboom to make quick work of Pokemon like Tapu Fini and Rhyperior. When Gigantamaxed, it turns into G-Max Drum Solo, an insanely powerful STAB move.</p> </li> <li> <p>U-turn allows Rillaboom to pivot into a partner Pokemon that's more suited to take advantage of the current situation.</p> </li> <li> <p>Wood Hammer is a harder-hitting STAB move that can be used to hit slower Pokemon such as Porygon2 and Lapras, while Knock Off improves Rillaboom's supportive capabilities and heavily threatens Spectrier. Protect can be used to give Rillaboom extra longevity, as it can survive the turn and heal with Grassy Terrain recovery.</p> </li> <li> <p>Assault Vest gives Rillaboom more durability when facing special attackers like Regieleki and Lapras, while Miracle Seed grants it access to stronger Grass-type attacks and the freedom to use status moves like Protect.</p> </li> </ul> "
      },
      {
        "name": "Choice Band",
        "description": "<ul> <li> <p>Choice Banded Rillaboom is one of the most threatening priority users in the metagame, threatening insane damage with its powerful Grassy Terrain-boosted attacks. It is typically reluctant to Dynamax to make full use of its Choice Band, but it can do so in a pinch.</p> </li> <li> <p>Grassy Glide is Rillaboom's main STAB move, being easily spammable in Grassy Terrain thanks to its priority and solid power. Should Rillaboom need to Dynamax, it provides access to G-Max Drum Solo, allowing it to OHKO offensive Gigantamax Lapras.</p> </li> <li> <p>Wood Hammer is a more powerful option useful for hitting slower targets like Tapu Fini and bulkier Landorus-T variants.</p> </li> <li> <p>U-turn lets Rillaboom function as a hard-hitting pivot and is excellent for wearing down opposing Rillaboom.</p> </li> <li> <p>High Horsepower lets Rillaboom dent Fire- and Steel-types like Incineroar and Metagross, though Superpower can hit the latter harder, as well as Kartana and Ferrothorn for super effective damage, at the cost of dropping its Attack and Defense.</p> </li> <li> <p>An Adamant nature with 252 Attack EVs ensures Rillaboom can strike as hard as possible, OHKOing the likes of Tapu Fini and Urshifu-R with its Grassy Glide. A Jolly nature can be used to outspeed Adamant Landorus-T and max Speed Heatran at the cost of damage output.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 501951, "username": "zeefable"}, {"user_id": 294287, "username": "Raineko"}, {"user_id": 527416, "username": "Bananers7"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}, {"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 541224, "username": "He-who-is-not-to-be-named"}]}
  },
  "Cinderace": {
    "sets": [
      {
        "name": "Offensive",
        "description": "<ul> <li> <p>Thanks to its high Attack and Speed as well as plenty of Max Moves to boost its and its partner's stats, Cinderace can be a threatening Dynamax candidate. Its wide movepool allows it to pressure numerous metagame staples such as Rillaboom, Porygon2, and Incineroar.</p> </li> <li> <p>Pyro Ball is the preferred Fire-type STAB move, as it has recoil while still being quite powerful.</p> </li> <li> <p>Bounce gives Cinderace access to a powerful Max Airstream, letting it boost its Speed while doing massive damage to Venusaur and Urshifu-S. Giga Impact provides similar speed control and more power in Max Strike; however, the opponent can switch out to reset their Speed drop at any time.</p> </li> <li> <p>Iron Head allows Cinderace to boost its Defense with a powerful Max Steelspike while also hitting Grimmsnarl and Clefairy. Alternatively, Sucker Punch acts as both a priority option and a way to drop the foes' Special Defense with Max Darkness, which is quite appreciated by strong special attackers like Tapu Lele.</p> </li> <li> <p>High Jump Kick pummels Incineroar and Porygon2 and also lets Cinderace negate Intimidate drops with Max Knuckle.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 294287, "username": "Raineko"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}]}], "writtenBy": [{"user_id": 501951, "username": "zeefable"}]}
  },
  "Coalossal": {
    "sets": [
      {
        "name": "G-Max Offensive",
        "description": "<ul> <li> <p>With Steam Engine and an insane Gigantamax move in G-Max Volcalith, Coalossal threatens to become one of the fastest and most potent attackers in the metagame. When combined with a Surf user such as Dragapult or an Aqua Jet user such as Urshifu-R, Coalossal can easily maximize its Speed and gain a significant offensive boost from Weakness Policy.</p> </li> <li> <p>Heat Wave is the Fire-type STAB move of choice due to it being a consistent spread move. It can also be used to set sun as Max Flare, which helps to mitigate Coalossal's otherwise severe weakness to Water. Said sun does remove Solar Beam's charge turn, but Solar Beam will usually be used as Max Overgrowth anyway.</p> </li> <li> <p>Meteor Beam allows for the strongest G-Max Volcalith possible, which is the primary reason to run Coalossal thanks to its significant 1/6 damage to the targeted foe between turns.</p> </li> <li> <p>Solar Beam via Max Overgrowth offers Coalossal a way through problematic Rock- and Water-types such as Regirock and Tapu Fini, as well as setting Grassy Terrain, lowering the power of incoming Earthquakes. Earth Power is responsible for beating threats such as opposing Coalossal and Nihilego while also boosting Coalossal's Special Defense with Max Quake.</p> </li> <li> <p>180 Speed EVs allow Coalossal to outspeed maximum Speed Venusaur in sun while at +6.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 501951, "username": "zeefable"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 294287, "username": "Raineko"}]}
  },
  "Hatterene": {
    "sets": [
      {
        "name": "Offensive Trick Room",
        "description": "<ul> <li> <p>Being one of the slowest Pokemon in the current metagame with great Special Attack and a good offensive typing, Hatterene establishes itself as a good offensive Trick Room setter. Hatterene makes an ideal Dynamax candidate thanks to its G-Max Smite, which confuses both Pokemon on the enemy team, potentially making them waste a turn or more. Magic Bounce is very useful, as it bounces back status moves like Spore, Sleep Powder, Taunt, and Thunder Wave that would otherwise prevent Hatterene from setting up Trick Room.</p> </li> <li> <p>Expanding Force is Hatterene's Psychic STAB move of choice, consistently dealing heavy damage to its foes when in Psychic Terrain. This makes Indeedee-F an ideal partner, as it sets Psychic Terrain and provides good support for Hatterene to set Trick Room up.</p> </li> <li> <p>Dazzling Gleam gives Hatterene a strong option to hit Dark-types such as Urshifu-S, Incineroar and Grimmsnarl that are immune to Expanding Force. It also provides the base for G-Max Smite.</p> </li> <li> <p>Mystical Fire allows Hatterene to overcome Steel-type threats that would otherwise check it, such as Metagross and Celesteela. It also provides a secondary effect of a Special Attack drop, which can be useful in reducing the damage of strong special attackers such as Spectrier and Regieleki.</p> </li> <li> <p>Trick Room is an essential move on Hatterene, allowing it to take advantage of its base 29 Speed to underspeed notable base 30 Speed Pokemon, such as Amoonguss and Glastrier, other common Trick Room threats.</p> </li> <li> <p>Magic Bounce is the optimal ability for Hatterene, as it prevents status moves that would deny it setting up Trick Room, such as Amoonguss's Spore and Taunt from Incineroar and Grimmsnarl. However, Magic Bounce presents an interesting interaction with Incineroars Parting Shot, which forces Hatterene to switch and prevents Incineroars pivoting.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 294287, "username": "Raineko"}]}, {"name": "Grammar checked by", "members": [{"user_id": 301217, "username": "Bandkrook"}]}], "writtenBy": [{"user_id": 547596, "username": "Helios of Sun"}]}
  },
  "Grimmsnarl": {
    "sets": [
      {
        "name": "Screens Support",
        "description": "<ul> <li> <p>Thanks to the combination of Prankster, workable natural bulk, and decent defensive typing, Grimmsnarl shines as a reliable dual screens setter that works well on balance teams. Its Dark / Fairy typing also makes it one of the best checks to Dragapult, in addition to letting it soft check Urshifu-S and Urshifu-R.</p> </li> <li> <p>Spirit Break lets Grimmsnarl OHKO Urshifu-S and cripple special attackers like Spectrier, Porygon2, and Zapdos.</p> </li> <li> <p>Both Reflect and Light Screen serve as fast and reliable damage reduction against powerful Dynamaxed attackers like Landorus-T and Regieleki. Reflect, in particular, is useful for holding strong against physical attackers that are immune to Intimidate, such as Metagross, Entei, and Mamoswine.</p> </li> <li> <p>Fake Tears makes up for Grimmsnarl's relatively low offensive presence by powering up special attacking allies like Zapdos, Heatran, and Rotom-W. Thunder Wave and Scary Face let Grimmsnarl act as a means of speed control; Thunder Wave has the advantage of immobilizing foes, while Scary Face works on Electric- and Ground-type Pokemon as well as having perfect accuracy. Taunt is useful for shutting down other supportive Pokemon including Amoonguss, Porygon2, and Dusclops.</p> </li> <li> <p>212 EVs in both HP and Special Defense, along with a Careful nature, let Grimmsnarl survive Life Orb and Helping Hand boosted Spectrier Max Strike.</p> </li> </ul> "
      },
      {
        "name": "Trick + Lagging Tail",
        "description": "<ul> <li> <p>Spirit Break hits Fighting- and Dragon-type Pokemon like Urshifu-S, Dragapult, and Garchomp. The Special Attack drop is also useful for weakening the likes of Rotom-W, Spectrier, and Regieleki, as Spirit Break is Grimmsnarl's only means of damage reduction.</p> </li> <li> <p>Fake Out can be used to grab early-game momentum alongside potent Dynamax partners like Zapdos and Spectrier. It is excellent to use against Pokemon that do not Dynamax often, such as Urshifu-S, Urshifu-R, and Whimsicott, as well as forcing certain Pokemon like Venusaur to Dynamax to avoid the flinch.</p> </li> <li> <p>Trick combined with Lagging Tail is excellent for crippling opposing Pokemon under Dynamax, and it can steal useful items such as Weakness Policy and Life Orb. Grimmsnarl can repeatedly use Trick to further disrupt the opponent's item placement.</p> </li> <li> <p>Fake Tears pairs well with special attackers like Celesteela and Regieleki, which can capitalize on the Special Defense drops. Taunt is nice for stopping Trick Room users such as Porygon2 and Dusclops.</p> </li> <li> <p>The EV spread allows Grimmsnarl to always survive a Max Quake from Life Orb Landorus-T. The remaining Special Defense investment lets it safely survive a Max Ooze from unboosted Venusaur under Gigantamax.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 294287, "username": "Raineko"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 501951, "username": "zeefable"}]}
  },
  "Indeedee-F": {
    "overview": "<p>Indeedee-F stands out as the primary redirector of the current format with its access to Follow Me and other supportive options such as Helping Hand and Mystical Fire. Additionally, its automatic Psychic Terrain enables partner setup by preventing Fake Out. Indeedee-F's exclusively supportive role does make it dependent on its partner for offensive output, though, making big threats such as Spectrier and Rotom-H ideal next to it. Equally important, its Dark weakness is a liability due to threats such as Galarian Moltres and Urshifu-S being so common.</p> ",
    "sets": [
      {
        "name": "Utility",
        "description": "<ul> <li> <p>Expanding Force allows Indeedee-F to take advantage of its own Psychic Terrain with a fairly strong STAB spread move.</p> </li> <li> <p>Follow Me is fantastic to allow partners like Porygon2 and Dusclops to consistently set up Trick Room or to support common setup sweepers such as Nasty Plot Spectrier and Swords Dance Landorus-T.</p> </li> <li> <p>Helping Hand allows Indeedee-F to increase its partner's damage output, which compensates for its more supportive role.</p> </li> <li> <p>Protect serves as Indeedee-F's primary form of longevity; however, Mystical Fire provides a nice coverage option for Fire weak Pokemon such as Kartana that also reduces the output of specially attacking threats such as Rotom-H and Tapu Fini.</p> </li> <li> <p>Focus Sash is the preferred item for Indeedee-F to soak up one more hit while using Follow Me. Safety Goggles allows Indeedee-F to redirect disruptive powder moves such as Amoonguss's Spore and Venusaur's Sleep Powder. Colbur Berry can be opted for to both free up Focus Sash for a partner and survive moves such as Urshifu-S's Wicked Blow and Galarian Moltres's Max Darkness.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 501951, "username": "zeefable"}, {"user_id": 493619, "username": "Dragonpiley007"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 294287, "username": "Raineko"}]}
  },
  "Dracovish": {
    "sets": [
      {
        "name": "Choiced Attacker",
        "description": "<ul> <li> <p>Fishious Rend is the reason to use Dracovish. It is one of the strongest attacks in the metagame, easily OHKOing the likes of Incineroar, Nihilego, and Dynamaxed Landorus-T at doubled power.</p> </li> <li> <p>Psychic Fangs is useful for hitting Amoonguss, which can redirect Fishious Rend. It can also shatter screens from Grimmsnarl or Gigantamax Lapras, which can be extremely useful for it and offensive partners like Zapdos and Cinderace.</p> </li> <li> <p>Ice Fang lets Dracovish hit Water-resistant Pokemon like Rillaboom and Dragapult, though Crunch can be used for more damage on the latter.</p> </li> <li> <p>Rock Slide allows Dracovish to fish for flinches in desperate situations, as it often moves first. Dragon Rush is Dracovish's best way to hit Dragon-types like opposing Dracovish and Kingdra, though its accuracy means it isn't extremely reliable.</p> </li> <li> <p>Strong Jaw lets Dracovish get the most damage out of Fishious Rend, and typically it can afford to run Choice Scarf to outspeed Cinderace, Landorus-T, and Spectrier without relying on other means of speed control. Sand Rush sets are effective when paired with Tyranitar for an extremely useful Speed boost, as it can outspeed Pokemon like Dragapult and +1 Landorus-T, which Choice Scarf cannot do; however, Choice Band is the recommended item to make up for the lack of a Strong Jaw boost. It is worth noting that maximum invested Jolly Dracovish outspeeds Regieleki in sand, which Adamant fails to do.</p> </li> </ul> "
      },
      {"name": "Substitute", "description": "<ul> <li> <p>Fishious Rend is what makes Dracovish threatening. At full power, it is capable of OHKOing numerous Dynamaxed threats like Landorus-T and Charizard.</p> </li> <li> <p>Ice Fang is the best complementary move to Fishious Rend, hitting common Water-resistant Pokemon like Dragapult, Venusaur, and Rillaboom for super effective damage.</p> </li> <li> <p>Substitute is useful for keeping Dracovish safe from Intimidate and Fake Out, which are common methods used to check it.</p> </li> <li> <p>Strong Jaw and Mystic Water are both important for ensuring Fishious Rend's damage output stays high, while 252 Speed EVs and a Jolly nature let it outspeed Modest Heatran.</p> </li> </ul> "}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 294287, "username": "Raineko"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Estronic"}]}], "writtenBy": [{"user_id": 501951, "username": "zeefable"}]}
  },
  "Dragapult": {
    "sets": [
      {
        "name": "Offensive",
        "description": "<ul> <li> <p>Dragon Darts is a reliable spread move that can quickly transform into a powerful Max Wyrmwind, which is useful for dropping the Attack of prominent physical attackers like Glastrier, Kartana, and Landorus-T. Its smart targeting mechanic also means it is much harder to avoid by just using Protect or switching to a Fairy-type to absorb the hit.</p> </li> <li> <p>Phantom Force is a strong Ghost-type STAB move that's nice for dodging opposing Max Moves thanks to its turn of invulnerability. Max Phantasm is excellent for stacking Defense drops, which partners like Kartana and Urshifu-S can take advantage of.</p> </li> <li> <p>Fly is used for Max Airstream, which is Dragapult's most reliable method for handling fast threats. At +1 Speed, it can outspeed many common Pokemon such as Venusaur in sun.</p> </li> <li> <p>Dragon Dance can turn Dragapult into an even more threatening sweeper, but it can be hard to pull off at times.</p> </li> <li> <p>A Jolly nature allows Dragapult to outrun Spectrier and Tapu Koko. An Adamant nature can be used to drastically increase its damage output while still outspeeding Regieleki and Venusaur in sun after a Max Airstream.</p> </li> <li> <p>Life Orb can be used for an immediate damage boost, but Weakness Policy drastically increases Dragapult's offensive prowess if it is activated.</p> </li> </ul> "
      },
      {
        "name": "Support",
        "description": "<ul> <li> <p>Supportive Dragapult is primarily used to activate Coalossal's Weakness Policy and Steam Engine with Surf. It can do this very effectively thanks to its high Speed, immunity to Fake Out, and excellent utility moves.</p> </li> <li> <p>Breaking Swipe lowers both foes Attack stats, keeping Dragapult's partner safer from strong physical attackers like Landorus-T and Garchomp.</p> </li> <li> <p>Surf is mandatory for being paired with Coalossal; specifically, it can circumvent redirection and is the weakest Water-type move Dragapult can use. It is important to keep in mind that Surf will do about 25% of Coalossal's health.</p> </li> <li> <p>Light Screen lets Coalossal survive powerful Max Moves moves like Tapu Fini's Max Geyser and Heatran's Max Quake.</p> </li> <li> <p>Ally Switch allows Dragapult to further support Coalossal by taking its place and stomaching hard-hitting Max Moves or potential double targets. Will-O-Wisp has the benefit of crippling physical attackers without triggering Defiant and Competitive users like Thundurus and Milotic.</p> </li> <li> <p>Safety Goggles allows Dragapult to negate Venusaur's Sleep Powder so that it can get its Surf off. Focus Sash is useful for surviving strong hits like Spectrier's Max Phantasm; however, Colbur Berry can be used to survive a double target from Urshifu-S and another priority user like Rillaboom.</p> </li> <li> <p>252 Speed EVs and Jolly nature allow Dragapult to get its Surf off as fast as possible, notably outspeeding Spectrier. Additionally, a Jolly nature, combined with 0 Special Attack IVs, gives Dragapult the weakest possible Surf so that it does not significantly damage Coalossal.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 294287, "username": "Raineko"}, {"user_id": 300598, "username": "Netherious"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 501951, "username": "zeefable"}]}
  },
  "Urshifu": {
    "overview": "<p>Urshifu-S is blessed with an amazing combination of STAB moves, a great Attack stat, and a good Speed tier that outspeeds many important Pokemon such as Landorus-T, Tapu Lele, and Rotom-W. Additionally, its Dark typing and access to Sucker Punch allow it to answer Dragapult and Spectrier effectively. Unseen Fist makes Urshifu very hard to check defensively by allowing it to hit through Protect, forcing the opponent to deal with it offensively. This allows it to thrive late-game when the opponent has already used up their Dynamax. However, Urshifu-S is held back by its low Special Defense and weaknesses to Flying- and Fairy-type attacks from the likes of Tapu Fini and Zapdos. It also suffers from a lack of flexibility, making it quite predictable; notably, it generally does not want to Dynamax, as it loses out on Wicked Blow's critical hits and Close Combat's Base Power.</p> ",
    "comments": "<h1>Other Options</h1> <p>Iron Head is an option over Poison Jab to have a better Max Move. However, it fails to hit Tapu Fini and, as mentioned above, Urshifu usually does not want to Dynamax anyway. A Choice Scarf allows Urshifu to outspeed faster Pokemon such as Dragapult and +1 Speed Landorus-T, but this set is weak and very susceptible to being KOed quickly. Black Glasses is an option for boosting the power of Wicked Blow without the restrictions of Choice Band. U-turn can be used on the Choice Band set for pivoting, but it is generally not worth using over Sucker Punch or Poison Jab.</p> ",
    "sets": [
      {
        "name": "Offensive",
        "description": "<ul> <li> <p>Wicked Blow's ability to bypass screens, Intimidate, and Defense boosts from Max Steelspike make Urshifu-S very hard to slow down. It is also a great tool against Pokemon such as Metagross and Dragapult.</p> </li> <li> <p>Close Combat hits Dark- and Fighting-types such as Incineroar and Hitmontop that resist Wicked Blow, while also being great for hitting Porygon2.</p> </li> <li> <p>Sucker Punch is excellent for removing faster threats, most notably Spectrier.</p> </li> <li> <p>If Choice Band is not being used, Detect is preferred as the last move for protecting Urshifu-S from damage and conserving momentum, and it is run over Protect to bypass Imprison users such as Indeedee-M. With Choice Band, Poison Jab is used in order to deal heavy damage to the aforementioned Fairy-types.</p> </li> <li> <p>Focus Sash is the most common item, mitigating Urshifu-S's poor bulk. However, Choice Band is worth considering because it makes Wicked Blow absurdly powerful, easily OHKOing Metagross and Porygon2. Black Glasses is an option for boosting the power of Wicked Blow without the restrictions of Choice Band.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 501951, "username": "zeefable"}, {"user_id": 300598, "username": "Netherious"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 493619, "username": "Dragonpiley007"}]}
  },
  "Urshifu-Rapid-Strike": {
    "sets": [{"name": "Offensive", "description": "<ul> <li> <p>Urshifu-R is a great offensive threat that can take advantage of its ability Unseen Fist, combined with its signature move Surging Strikes, to deal massive damage to foes. Urshifu-R's ability to break through Protect makes it great at maintaining offensive pressure. Urshifu-R is also an ideal partner to Coalossal, as its Aqua Jet can ensure you activate both Coalossal's Steam Engine and Weakness Policy.</p> </li> <li> <p>Surging Strikes is a three-hit STAB move that can break bulky Pokemon through Defense boosts and Intimidate due to the guaranteed critical hit.</p> </li> <li> <p>Aqua Jet can finish off weakened Pokemon running a Focus Sash such as Whimsicott, Raichu, and Regieleki.</p> </li> <li> <p>Urshifu-R usually runs Focus Sash due to its poor Special Defense.</p> </li> </ul> "}],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 527416, "username": "Bananners7"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Estronic"}]}], "writtenBy": [{"user_id": 517038, "username": "Giokio"}]}
  },
  "Regieleki": {
    "overview": "<p>With a ridiculous Speed stat, an incredible ability, and unmatched versatility, Regieleki has solidified itself as one of the most dominant forces in the metagame. Its wide range of possible sets allow it to fulfill a variety of roles, making it unpredictable at Team Preview. Regieleki's Max Lightning is also the strongest in the format, and is easily capable of zapping the likes of Celesteela, Galarian Moltres and Lapras. Unfortunately, Regieleki's lack of coverage makes it hard to hit common Ground-type Pokemon such as Landorus-T and Garchomp effectively. In addition, its poor defenses leave it vulnerable to any faster attacks, either from priority users such as Rillaboom or strong Pokemon in Tailwind such as Cinderace and Spectrier.</p> ",
    "comments": "<h1>Other Options</h1> <p>Thunder works well when Regieleki is paired with Politoed thanks to it being 100% accurate in rain; on the other hand, Electro Ball can punish slow Trick Room setters such as Porygon2, Dusclops and Stakataka. However, it often means giving up Protect. Screech allows physically attacking partners such as Regirock and Metagross to hit for more damage. Regieleki can also choose to use a Choice Scarf to outspeed threats such as Venusaur in Sun, or Choice Specs to further improve its great offensive output.</p> ",
    "sets": [
      {"name": "Special", "description": "<ul> <li> <p>Electroweb provides speed control against fast threats such as Spectrier and Cinderace as well as giving Regieleki a somewhat strong spread move.</p> </li> <li> <p>Volt Switch can deal decent damage while also serving as a fast and reliable pivoting option. Hyper Beam allows for Regieleki to hit Ground-types like Landorus-T and Garchomp with Max Strike, which also acts as speed control.</p> </li> <li> <p>Magnet and Life Orb allow Regieleki to OHKO the likes of Galarian Moltres and Tapu Fini. Magnet is generally preferred unless Hyper Beam is run. Focus Sash can be used instead to increase Regieleki's survivability without running a dedicated support set.</p> </li> </ul> "},
      {
        "name": "Physical",
        "description": "<ul> <li> <p>Physical Regieleki aims to take advantage of the element of surprise, as most Regieleki are specially oriented. Regieleki's Transistor-boosted Wild Charge also preys on Pokemon that both are Electric-weak and have lower Defense than Special Defense,such as Tapu Fini and Galarian Moltres. This set is also much more willing to be Dynamaxed due to its better range of coverage.</p> </li> <li> <p>Bounce is used for Max Airstream, and it serves to tackle common Flying-weak Pokemon such as Urshifu-S, Rillaboom, and Venusaur.</p> </li> <li> <p>Assurance is a good coverage move that can hit Pokemon such as Spectrier and Dragapult for good damage. It also gives access to Max Darkness, dropping the opposing Pokemon's Special Defense for special attackers such as Galarian Moltres and Spectrier. Explosion is an option that provides a high Base Power option, and lowers the foe's Speed in Dynamax, and allows Regieleki to get one last powerful spread hit in before it goes down.</p> </li> <li> <p>Electroweb is another option that offers a consistent form of speed control outside of Dynamax while also dealing substantially more damage to Pokemon with lower Special Defense, such as Torkoal, as Max Lightning than Wild Charge does.</p> </li> <li> <p>Magnet is an alternate item option that is generally more potent when using Electroweb and Wild Charge on the same set. Focus Sash provides Regieleki some extra durability, allowing it to fire off more attacks when Dynamaxed rather than wasting its potential.</p> </li> <li> <p>A Jolly nature is preferred when Regieleki is exclusively using physical moves; however, a Hasty nature is valid when using Electroweb, notably giving Regieleki a 50% chance to KO Torkoal with its special Max Lightning in Electric Terrain.</p> </li> </ul> "
      },
      {"name": "Screens Support", "description": "<ul> <li> <p>Electroweb grants speed control needed to maintain momentum against threats like Spectrier and Cinderace.</p> </li> <li> <p>Thunderbolt hits for solid damage even without a boosting item thanks to Transistor. Volt Switch can help maintain momentum by safely pivoting into an ally with screens support.</p> </li> <li> <p>Light Screen and Reflect help against Pokemon that otherwise threaten Regieleki such as Landorus-T, Rillaboom, and Garchomp while also providing security for its teammates.</p> </li> <li> <p>Regieleki maximizes its Speed to ensure it can effectively set up screens. This EV spread allows Regieleki to survive strong hits such as Kartana's Max Overgrowth and Heatran's Max Quake through dual screens.</p> </li> </ul> "}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 501951, "username": "zeefable"}, {"user_id": 294287, "username": "Raineko"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 408293, "username": "AustinXX555"}]}
  },
  "Regidrago": {
    "sets": [
      {
        "name": "Offensive",
        "description": "<ul> <li> <p>With its Dragon-type moves only resisted by Steel and Fairy-types, Regidrago fills an interesting niche in the current metagame through sheer power. While it has a limited movepool, its Dragon's Maw-boosted Dragon-type moves let it break holes in opponents, with coverage moves like Ancient Power and Fire Fang being noticeably weaker in comparison.</p> </li> <li> <p>Dragon Energy is the strongest Dragon-type move in Series 9 when Regidrago is at full HP. Even against Steel-types that would otherwise take little damage from like Metagross and Celesteela Dragon Energy cuts their HP by one third, typically more than a super effective coverage move would have. However, Dragon Energy decreases in power as Regidrago loses HP, so it is most reliable to use when it can move before the opponent. Additionally, when Dynamaxed, Dragon Energy's Base Power is fixed at its maximum.</p> </li> <li> <p>Draco Meteor serves as a powerful secondary STAB move for Regidrago. While only hitting one opponent, Draco Meteor's Base Power does not decrease as Regidrago's HP falls, providing an alternative option to Dragon Energy.</p> </li> <li> <p>Dragon Pulse gives Regidrago a STAB move with no drawback. With a naturally high HP stat and resistances to Fire, Water, Grass, and Electric, Regidrago can stay on the field and take a few hits, letting it take advantage of its relative longevity and keep up the offensive pressure.</p> </li> <li> <p>Hyper Beam hits opposing Fairy-types such as Tapu Fini and Grimmsnarl, allowing Regidrago to break through them. Regidrago would prefer that its teammates handle Fairy-types, but in a pinch, Hyper Beam lets it deal with those threats along with providing speed control through a powerful Max Strike. Protect shields Regidrago from incoming damage, allowing its Dragon Energy to stay as powerful as possible.</p> </li> <li> <p>Choice Scarf lets Regidrago outrun a lot of the metagame, letting it unleash Dragon Energy at full power before its HP decreases. With forms of speed control such as Tailwind and Electroweb, Dragon Fang boosts Regidrago's Dragon-type moves even further and lets it switch attacks, which is useful when Dragon Energy becomes weaker than Dragon Pulse.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 294287, "username": "Raineko"}]}, {"name": "Grammar checked by", "members": [{"user_id": 301217, "username": "Bandkrook"}]}], "writtenBy": [{"user_id": 514175, "username": "ttr"}]}
  },
  "Glastrier": {
    "sets": [
      {
        "name": "Offensive",
        "description": "<ul> <li> <p>Icicle Crash is preferred as it has a chance to land a timely flinch, though Icicle Spear has the notable advantages of perfect accuracy and the ability to break through a Focus Sash. It is worth noting that both attacks have the same Base Power for Max Hailstorm.</p> </li> <li> <p>High Horsepower pairs perfectly with Glastrier's STAB move allowing it to hit Incineroar, Entei, and Heatran for solid damage. Max Quake is excellent for boosting its Special Defense and allowing it to match up better against Tapu Fini and Spectrier.</p> </li> <li> <p>Close Combat gives a higher damage output option for Incineroar and Porygon2 while also letting Glastrier boost its Attack with Max Knuckle.</p> </li> <li> <p>Heavy Slam can be used to hit Fairy-types such as Grimmsnarl and Clefairy while also boosting Glastrier's Defense with Max Steelspike, letting it stand up to Urshifu-S and Urshifu-R much more easily.</p> </li> <li> <p>Life Orb can be used for an immediate boost to its damage output, but this makes it more susceptible to Intimidate and compromises its bulk. Lum Berry lets Glastrier set up Swords Dance in the face of Amoonguss and attack through Venusaur's Sleep Powder. Assault Vest Glastrier is an amazing option for walling strong special attackers including Spectrier and Regieleki.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 294287, "username": "Raineko"}, {"user_id": 300598, "username": "Netherious"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 501951, "username": "zeefable"}]}
  },
  "Spectrier": {
    "overview": "<p>Sporting a spectacular base 145 Special Attack and impressive base 130 Speed, Spectrier offers a blend of utility and offense that has proven its worth in the current metagame on a variety of team compositions. Spectrier also has a wondrous signature ability in Grim Neigh, which boosts its Special Attack by one stage for each KO it gets, allowing it to become increasingly volatile the longer it is in play. However, Spectrier does lack strong coverage options outside of Ghost-type attacks. While the metagame does host a series of strong Dark-type Pokemon capable of dispatching or outright walling Spectrier, it is still a force to be reckoned with.</p> ",
    "comments": "<h1>Other Options</h1> <p>Dark Pulse can be used to hit Indeedee-F and lower foes' Special Defense with Max Darkness. Haze is an option for fighting teams that spam stat reduction.</p> ",
    "sets": [
      {"name": "Offensive", "description": "<ul> <li> <p>Hyper Beam provide Spectrier with speed control when Dynamaxed through Max Strike while also allowing it to hit Dark-type Pokemon such as Incineroar, Galarian Moltres, and Urshifu-S.</p> </li> <li> <p>Mud Shot offers Spectrier a way to boost its Special Defense with Max Quake and also has the added benefit of doing increased damage to Steel- and Fire-type Pokemon like Heatran and Incineroar.</p> </li> <li> <p>Nasty Plot is an option for teams that have strong forms of redirection, which enables Spectrier to safely boost its Special Attack.</p> </li> </ul> "},
      {
        "name": "Support",
        "description": "<ul> <li> <p>Will-O-Wisp lets Spectrier cripple physical attackers such as Garchomp, Landorus-T, and Thundurus that a partner such as Metagross may struggle to deal with effectively.</p> </li> <li> <p>Bulldoze is an amazing option for Weakness Policy users such as Metagross and Regirock while also providing speed control. Snarl gives Spectrier strong utility for weakening foes while also being a strong option to boost its own damage output with Max Darkness.</p> </li> <li> <p>Taunt allows Spectrier to prevent Trick Room strategies and cripple the likes of Amoonguss and Porygon2.</p> </li> <li> <p>Safety Goggles is an amazing item that lets Spectrier safely lead into status-inducing leads and teams that rely on Rage Powder for redirection. Colbur Berry can give Spectrier the ability to tank a Wicked Blow from Urshifu-S outside of Dynamax or even Max Darkness from Galarian Moltres.</p> </li> <li> <p>252 HP EVs paired with 44 Defense EVs are enough for Spectrier to survive a Choice Band Rillaboom's Grassy Glide. The Special Defense investment lets Spectrier tank +2 Max Geyser from Rotom-W. 156 Speed EVs with a Timid nature allow Spectrier to outspeed maximum Speed Regieleki when its Speed is reduced by one stage.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 501951, "username": "zeefable"}, {"user_id": 493619, "username": "Dragonpiley007"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Estronic"}]}], "writtenBy": [{"user_id": 300598, "username": "Netherious"}]}
  }
}