{
  "Cloyster": {"sets": [{"name": "Spikes Lead"}]},
  "Chansey": {
    "comments": "<h1>Other Options</h1> <p>Chansey can run a wide array of moves due to its large support movepool. Chansey's phenomenal HP makes Wish in the first or third moveslot very effective. However, forgoing Aromatherapy sacrifices its role as a cleric, and not using Toxic or Seismic Toss leaves Chansey with absolutely no way to damage foes. Stealth Rock can also be used, as it can allow teammates like Necrozma-DM to run otherwise unfeasible sets like defensive Dragon Dance. If Chansey’s teammates can reliably keep Xerneas at bay, Teleport can be used over Confide; this allows it to pivot, putting the user in an advantageous position against switch-ins. However, it is usually not worth it because Chansey all but loses its niche as a strong Xerneas check, as it can't stop Geomancy from eventually overpowering it. Thunder Wave is a fringe option over Toxic, as it affects Chansey’s most prominent switch-ins in Necrozma-DM and Eternatus, but forgoing Toxic prevents Chansey from making any meaningful progress. An alternative EV spread of 252 HP / 4 Def / 252 SpD can be used on non-Stealth Rock variants; this allows Chansey to switch into Choice Specs Kyogre if it is healthy. However, this forces Chansey to switch out of any physical or mixed attacker, making it much more difficult to use Aromatherapy or heal.</p> <h1>Checks and Counters</h1> <p><strong>Physical Damage: Chansey should avoid Pokemon that can target its pitiful physical bulk. This includes a few special and mixed attackers, such as Psyshock Calyrex-S and offensive Yveltal if Dynamax. However, in an emergency scenario Chansey may stay in against an unboosted Psyshock user.</p> <p><strong>Poison- and Steel-types: Poison- and Steel-types such as Eternatus, Necrozma-DM, and Zacian-C aren’t affected by Toxic; Eternatus can annoy Chansey with Pressure, Necrozma-DM can remove its Eviolite with Knock Off, and Zacian-C can OHKO with Close Combat.</p> <p><strong>Gothitelle: Gothitelle can trap and remove even Seismic Toss Chansey with its faster Taunt and Rest. While occasional Teleport sets can lure Gothitelle out, Chansey can’t safely stay in as Gothitelle can beat it with rare Trick sets. However, Chansey has an easier time against Gothitelle if it has both Seismic Toss and Teleport.</p> <p><strong>Knock Off</strong>: Eviolite is instrumental to Chansey’s walling, and losing it may make Chansey unable to handle some stronger special attackers, such as Geomancy Xerneas and Kyogre. Some Necrozma-DM and Yveltal use Knock Off; it’s important to scout for the move before keeping Chansey in against these Pokemon.</p> <p><strong>Taunt</strong>: As Chansey is extremely passive, Taunt will force it to switch, use Seismic Toss if it has it, or use Struggle. Chansey with Seismic Toss will also often switch, as common Taunt users usually either don’t care about the chip from Seismic Toss, can easily heal from it, or are immune to the move.</p> <p><strong>Entry Hazards</strong>: Although Chansey has reliable healing, stall teams that fail to keep entry hazards away can leave it whittled down, forcing it to heal much more often and therefore preventing it from coming in as much. Some hazard setters to watch out for are Necrozma-DM, Groudon, and Ferrothorn, with the last one being especially annoying due to it recovering a significant portion of its HP against Chansey with Leech Seed.</p> ",
    "sets": [
      {
        "name": "Wall Cleric",
        "description": "<p>With only one weakness and high Eviolite-boosted special bulk, Chansey is a staple on stall teams, capable of checking the likes of Xerneas, non-Choice Specs Kyogre, and offensive Eternatus. Its amazing ability in Natural Cure also allows it to act as a status absorber for its team. Aromatherapy allows Chansey to act as a cleric, and its bulk gives it many chances to use this move in longer games. Toxic or Seismic Toss is used to inflict damage; Toxic cripples Yveltal and annoys Kyogre lacking Rest, while Seismic Toss can chip Zacian-C switch-ins, break Geomancy Xerneas’s Substitute, and let Chansey stay in against Taunt Yveltal. Confide is used to check Calm Mind Kyogre and Xerneas. Investment in Special Defense helps Chansey stomach hits from Xerneas and Kyogre, and Defense investment is imperative for Aromatherapy, giving Chansey far more chances to use it on weaker physical Pokemon like Ho-Oh and Zygarde-C.</p> <p>Chansey is best used on stall and bulky balance teams, as it is extremely passive but can reliably counter opposing Xerneas, offensive Eternatus, and non-Choice Specs Kyogre. Having solid defensive partners helps to scout opposing Pokemon’s movesets, especially for Knock Off, allowing it to come in more safely. In stall teams, Chansey should be paired with physically bulky Pokemon, such as Quagsire and Giratina; Quagsire greatly appreciates Aromatherapy and can switch into most physical setup sweepers, as well as Zacian-C, and Giratina is especially useful as a partner due to Pressure stifling entry hazard setters such as Ferrothorn. On balance teams, Necrozma-DM is an excellent partner due to being an easy to fit check to most physical attackers; Chansey, in return, checks most special attackers. Rest users, such as Zygarde-C and bulky Kyogre, greatly benefit from Aromatherapy. As Chansey switches often, it gets chipped by hazards, which, with time, can hinder its ability to aid its teammates and heal; Defoggers such as Ho-Oh and Giratina are greatly appreciated.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 511624, "username": "Fc"}, {"user_id": 464176, "username": "Icemaster"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 515077, "username": "Mbouchon"}]}
  },
  "Lapras": {
    "comments": "<h1>Other Options</h1> <p>Lapras has no other viable options.</p> <h1>Checks and Counters</h1> <p><strong>Zacian-C</strong>: Zacian-C poses a huge threat since Lapras occasionally may give free switches to it, and it forces out Lapras every time. If played smartly, Zacian-C can use these chances to break through its checks.</p> <p><strong>Fighting-types</strong>: Marshadow and Urshifu-S threaten to OHKO Lapras and break through or weaken its teammates.</p> <p><strong>Coverage Moves: Uncommon coverage moves such as Thunder on Kyogre and Meteor Beam on Lunala and Eternatus can surprise Lapras, weaken it greatly, and render it useless for the rest of the game.</p> <p><strong>Strong Wallbreakers and Setup Sweepers: Offensive variants of Xerneas, Zekrom, Zygarde-C, Groudon, and Yveltal are huge threats for Lapras.</p> <p><strong>OHKO-Immune Pokemon: Skarmory is a rare pick in AG, but thanks to Sturdy and immunity to Toxic, it completely counters Lapras. Shedinja, another rare pick, can completely wall Lapras if it doesn't carry Toxic, and gets a free turn to Baton Pass to its offensive teammates. Shuckle is more common and uses Lapras as an opportunity to set up Sticky Web and Stealth Rock.</p> ",
    "sets": [
      {
        "name": "Defensive",
        "description": "<p>Lapras is a potent user of OHKO moves in AG, setting itself apart from Kyurem-W with Horn Drill and Water Absorb. Its natural bulk, ability, and immunity to Sheer Cold allow it to check common special attackers such as Kyogre lacking Thunder, Kyurem-W, Eternatus lacking Meteor Beam, Dracovish locked into Fishous Rend, and defensive Lunala. A combination of Sheer Cold and Horn Drill hits almost every viable pokemon in AG, giving Lapras little to no reliable switch-ins. Rest is mandatory to ensure its health and remove the status inflicted by Ho-Oh, Lunala, Eternatus, and other passive Pokemon such as Blissey. Freeze-Dry is used to directly damage foes such as Kyogre, Yveltal, Zygarde, and Eternatus. Sleep Talk can be used so that offensive Pokemon such as Calyrex-S, Zacian-C, and Groudon think twice before setting up on a sleeping Lapras. Alternatively, Toxic wears down Kyogre, Kyurem-W, and other special attackers much more reliably. The EVs spread maximizes special bulk so that Lapras can comfortably switch into the special attackers it checks. Gigantamaxing Lapras is useful to set up Aurora Veil alongside dealing Ice-type damage with G-Max Resonance.</p> <p>Lapras is used on balance teams as a Kyogre and Kyurem-W check as well as a Sheer Cold user and absorber. Necrozma-DM is a near mandatory teammate for Lapras, as it checks the likes of Zacian-C and Xerneas, which otherwise easily break through it. Physical walls such as Zygarde-C, Groudon, and Lunala can comfortably wall offensive variants of Zerkom, Zygarde, and Groudon. They are greatly appreciated due to Lapras's poor Defense. Since Lapras fails to check Thunder Kyogre, teammates such as Eternatus, Blissey, and Ferrothorn can be used as secondary checks to Kyogre. Eternatus additionally checks Ho-Oh, Necrozma-DM, and Yveltal, and it is a solid status absorber. Ho-Oh can check Necrozma-DM and switch into a plethora of attackers to scout for their moves or sets. In return, it greatly appreciates Lapras's ability to check most Kyogre reliably. Offensive teammates such as Swords Dance Groudon, Choice Specs Kyogre, and Dragon Dance Necrozma-DM benefit from having a solid Kyogre and Kyurem-W check in Lapras.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 511624, "username": "Fc"}, {"user_id": 491896, "username": "Rotten"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 374620, "username": "pichus"}]}
  },
  "Ditto": {
    "comments": "<h1>Other Options</h1> <p>As Transform is Ditto's only move, it has no viable other options.</p> <h1>Checks and Counters</h1> <p><strong>Substitute Users</strong>: Substitute nullifies Imposter, so unless the Substitute is removed by the time an ally has fainted, Ditto can not come in and revenge kill. Some Substitute users to watch out for are Xerneas, Dragon Dance Zygarde, and Zekrom.</p> <p><strong>Imposter-proof Pokemon: Teams may have a sweeper unable to break through a specific Pokemon also on the team in the event that a Ditto transforms into the first Pokemon. For example, a team may have a Choice Specs Kyogre but also a Blissey or Ferrothorn to prevent an opposing Ditto from reverse sweeping. Another example is Life Orb Eternatus, Imposter-proofed by Ho-Oh and Zacian-C.</p> <p><strong>Priority Users: While not very common in the metagame, Pokemon with priority moves such as Shadow Sneak Marshadow and Extreme Speed Rayquaza may be able to OHKO or heavily damage Ditto before getting revenge killed.</p> ",
    "sets": [
      {
        "name": "Revenge Killer",
        "description": "<p>Albeit hard to fit onto a team, Ditto is one of the best revenge killers in the metagame, being able to reliably revenge kill sweepers such as a chipped Xerneas, Calyrex-S, and Zacian-C. Unless it has Substitute, Zacian-C is especially vulnerable to Ditto, as a +2 Ditto can break through Zacian-C's common check in Necrozma-DM with Close Combat. Similarly, Calyrex-S fears Ditto, as it punishes Calyrex-S heavily for coming in by threatening a reverse sweep in conjunction with As One. Ditto is an amazing user of Dynamax; after copying a boosted sweeper like Calyrex-S, Groudon, or Xerneas, it can Dynamax to break the Choice lock, usually allowing it to break through a check that switches into Ditto. However, this is only recommended when Dynamax is necessary to KO a foe, when checks are weakened enough to wrap up the game, or if Ditto needs to survive a predicted priority move. It is possible for Ditto to face an opposing Ditto one-on-one, and the EVs and IVs have been chosen with this in mind. 248 HP EVs ensure that Ditto will be able to use Struggle four times before fainting, and 252 Defense EVs minimize Struggle damage from an opposing Ditto. The minimum possible Speed allows Imposter to not activate first and therefore allow Ditto to have more Transform PP.</p> <p>Ditto works best on balance and stall teams that appreciate its ability to deter opposing setup attempts. Necrozma-DM and Tyranitar work well with Ditto, as they can weaken a boosted Xerneas and Life Orb Yveltal respectively before Ditto comes in and revenge kills. Xerneas and Yveltal have noticeably higher bulk than a Ditto transformed into either, so it is important for the aforementioned two checks to pressure them to Dynamax, removing their ability to reliably win against a Ditto that can Dynamax one-on-one. Moreover, Tyranitar also doubles as a mandatory check to Calyrex-S. Checks to the ever-dangerous Dragon Dance Zygarde-C, such as Lunala, and Calm Mind Kyogre, such as Blissey, Eternatus, and Ferrothorn, are essential, as Ditto is incapable of revenge killing them. Gothitelle is a rather niche option that helps to deal with passive Pokemon lacking Shed Shell, particularly non-Teleport Blissey and Eternatus. Ditto enjoys being at full or near full HP so it can survive potential priority moves and take on a healthy Xerneas, so Defoggers such as Yveltal, Ho-Oh, and Giratina are invaluable teammates for it.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 426798, "username": "Geysers"}, {"user_id": 360582, "username": "Guard"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}]}], "writtenBy": [{"user_id": 515077, "username": "Mbouchon"}]}
  },
  "Mewtwo": {"sets": [{"name": "Nasty Plot"}]},
  "Quagsire": {
    "comments": "<h1>Other Options</h1> <p>Curse is useful in some situations, but Quagsire's standard moves are hard to forgo, and the omnipresence of Toxic in AG makes this set very unreliable.</p> <h1>Checks and Counters</h1> <p><strong>Special Attackers</strong>: Common special attackers like Kyogre, Eternatus, Calyrex-S, Xerneas, Yveltal, and Kyurem-W can threaten Quagsire and force it to switch out.</p> <p><strong>Strong Wallbreakers: Due to Quagsire's mediocre natural bulk, it fails to beat strong wallbreakers such as Life Orb Groudon, Marshadow, and Urshifu-S.</p> <p><strong>Toxic: Toxic is common in AG and seen on both passive walls and offensive Pokemon. If Quagsire is badly poisoned, it struggles to check Zacian-C.</p> ",
    "sets": [
      {
        "name": "Physically Defensive",
        "description": "<p>Quagsire is a mediocre physical wall in AG that fits on stall and bulky balance builds. It is outclassed by physical walls such as defensive Zygarde-C, Groudon, Necrozma-DM, and Lunala due to its average defense stats and passive nature. However, Quagsire holds a niche as the only Zacian-C counter in AG. Additionally, it also checks Coil and Dragon Dance variants of Glare Zygarde and Dragon Dance Necrozma-DM. Earthquake allows Quagsire to directly damage Zacian-C and chip other switch-ins such as Eternatus, Kyogre, and Necrozma-DM. Scald can be used to fish for burns against Toxic-immune Pokemon such as Eternatus, Necrozma-DM, and Ferrothorn. Haze is an alternative that allows Quagsire to act as an emergency check to setup sweepers such as Geomancy Xerneas, Dragon Dance Zekrom, and Swords Dance Groudon. Recover provides longevity throughout the game. Toxic threatens and prevents strong breakers such as Kyogre, Calyrex-S, Xerneas, and Yveltal from switching in for free. Heavy-Duty Boots prevents Quagsire from being chipped down by entry hazards and lets it remain fully healthy to switch into Zacian-C, while Rocky Helmet can be used on teams with strong entry hazard control to wear down and pressure Zacian-C and prevent Quagsire from being too passive.</p> <p>Quagsire needs a lot of support and is vulnerable to almost every special attacker. Thus, it must be paired with solid specially defensive walls such as Eternatus, Ferrothorn, Blissey, and Kyurem-W. Due to Quagsire's poor natural bulk, checks to naturally strong physical wallbreakers such as Marshadow, Groudon, and Zekrom are also appreciated, so teammates like Lunala, Eternatus, and Zygarde-C are solid options. Offensive Pokemon like Xerneas, Kyogre, and other setup sweepers can take advantage of Quagsire's passive nature and set up on it; Ditto is an excellent teammate to punish the aforementioned Pokemon.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 511624, "username": "Fc"}, {"user_id": 426798, "username": "Geysers"}]}, {"name": "Grammar checked by", "members": [{"user_id": 449990, "username": "DC"}]}], "writtenBy": [{"user_id": 374620, "username": "pichus"}]}
  },
  "Shuckle": {
    "comments": "<h1>Other Options</h1> <p>Rock Tomb is an option to lower the Speed of offensive Flying-types such as Rayquaza and Yveltal as well as other foes like Zacian-C attempting to stay in and KO Shuckle. Knock Off gets rid of items like Heavy-Duty Boots from Pokemon like Ho-Oh, Necrozma-DM, and Yveltal, making Shuckle's entry hazards more effective. However, both of these options are hard to justify over other good utility moves such as Final Gambit and Infestation due to their limited use cases.</p> <h1>Checks and Counters</h1> <p><strong>Gothitelle: Shuckle is prohibited from switching out against Gothitelle due to Shadow Tag, making it especially susceptible to Taunt and potentially allowing the opponent to remove entry hazards freely. Gothitelle can also shrug off Shuckle's Toxic with Rest and prevent entry hazards from being set entirely if it's not running Mental Herb.</p> <p><strong>Setup Sweepers</strong>: Devastating setup sweepers such as Dragon Dance Zygarde-C, Xerneas, and Zekrom can set up in front of Shuckle once Encore has been used and proceed to Dynamax and sweep without being locked into a move. Red Card also cannot phaze out Pokemon under Dynamax, making the aforementioned setup sweepers tougher to deal with.</p> <p><strong>Entry Hazard Removers: Because Shuckle is passive, it relies on Toxic or Infestation to wear down Defog users like Ho-Oh and Yveltal that can remove Sticky Web and Stealth Rock with ease. Giratina can shrug Toxic off with Rest and is immune to trapping, and Excadrill can use Rapid Spin against Shuckle and keep its Stealth Rock up. However, Encore in conjunction with offensive pressure from teammates can negate this.</p> ",
    "sets": [
      {
        "name": "Sticky Web",
        "description": "<p>Shuckle's access to Sticky Web and solid bulk sets itself apart from other entry hazard leads in AG, allowing it to effectively utilize its plethora of other great utility options such as Stealth Rock, Encore, Toxic, and Knock Off. However, Shuckle faces competition from Slurpuff as a Sticky Web setter, as it can block Defog or Rapid Spin attempts with Misty Explosion and deter opposing entry hazard leads and Taunt users with Magic Coat. Sticky Web is useful for slowing down grounded offensive foes such as Calyrex-S, Choice Scarf Kyogre, and Zacian-C for teammates. Stealth Rock also aids teammates by chipping down foes and can target certain Pokemon unaffected by Sticky Web such as Life Orb Yveltal. Encore is useful for preventing setup sweepers such as Xerneas, Nasty Plot Calyrex-S, Zekrom, and Groudon from using Shuckle as complete setup fodder, forcing them to switch out or Dynamax, while also enabling teammates to switch in freely. Final Gambit generates momentum for Shuckle's teammates by KOing itself once entry hazards have potentially been set up. Alternatively, Infestation traps and slowly damages foes like Necrozma-DM, Ferrothorn, and defensive Xerneas during the match, forcing chip damage on them as well as working with Encore to give Shuckle's teammates free switch-ins. Toxic can also be used to put a timer on Defoggers such as Ho-Oh and Yveltal. Sturdy allows Shuckle to survive attacks from powerful attackers like Kyogre, enabling it to use Mental Herb for Taunt users such as Yveltal and Grimmsnarl, guaranteeing it gets to set an entry hazard. Alternatively, Red Card forces out an abundance of threats like Zacian-C and Kyogre as well as boosted Zygarde-C and Zekrom.</p> <p>Shuckle should only be used on hyper offense teams that can make full use of Sticky Web. Slower setup sweepers and wallbreakers such as Choice Specs Kyogre, Zekrom, and Groudon can all take advantage of Sticky Web while threatening common Defoggers including Ho-Oh and Yveltal. Ghost-types such as Calyrex-S and Marshadow can effectively spinblock against opposing Excadrill, preventing Shuckle's Sticky Web and Stealth Rock from being removed. Due to the importance of Sticky Web and Stealth Rock, Shuckle should generally be led with in order to immediately slow down offensive grounded threats with Sticky Web and weaken foes with Stealth Rock.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 367227, "username": "baconeatinassassin"}, {"user_id": 426798, "username": "Geysers"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}]}], "writtenBy": [{"user_id": 491896, "username": "Rotten"}]}
  },
  "Skarmory": {"sets": [{"name": "Physically Defensive"}]},
  "Porygon2": {
    "comments": "<h1>Other Options</h1> <p>Thunder Wave can be used to punish foes such as Eternatus, Zacian-C, and Xerneas for switching in, while Toxic puts walls like Ho-Oh and Yveltal on a timer. Eerie Impulse is an option to remove Calyrex-S's Nasty Plot boosts and deter special attackers like Xerneas and offensive Eternatus; however, these moves are hard to use over Ice Beam and Teleport, which are important to Porygon2.</p> <h1>Checks and Counters</h1> <p><strong>Super Effective Coverage: Pokemon that carry super effective coverage against Porygon2, such as Zacian-C, Marshadow, and Urshifu-S, pose huge threats to it. However, they should avoid consistently switching into Porygon2, as they will take a decent amount of damage from Foul Play or Ice Beam.</p> <p><strong>Powerful Wallbreakers: Despite Porygon2's good bulk, many powerful wallbreakers such as Choice Specs Kyogre, Life Orb Yveltal, Xerneas, and Dracovish have little to no problem taking it down.</p> <p><strong>Walls: Walls such as Ho-Oh, Eternatus, and specially defensive Yveltal can shrug off Porygon2's attacks. Ho-Oh can badly poison Porygon2 with Toxic and threaten to burn it with Sacred Fire, Eternatus can tank an Ice Beam and cripple Porygon2 with Toxic, and Yveltal can cripple it with Knock Off.</p> <p><strong>Knock Off</strong>: Knock Off users such as defensive Necrozma-DM, Ferrothorn, and specially defensive Yveltal can cripple Porygon2 by removing its Eviolite, making it more susceptible to strong attacks.</p> <p><strong>Trick: Choice-item Calyrex-S can lure in and heavily cripple Porygon2 by removing its Eviolite and making it unable to freely switch up its moves, making it far easier to deal with.</p> ",
    "sets": [
      {
        "name": "Physically Defensive",
        "description": "<p>Porygon2 carves out a unique niche in AG as a physically defensive wall thanks to its good Eviolite-boosted bulk and typing, making it a good check to Calyrex-S. Additionally, it is capable of dealing with other threats like Zygarde-C and Lunala thanks to its useful coverage. Foul Play is most notably used to punish Calyrex-S while deterring physical setup sweepers such as Dragon Dance Necrozma-DM and Reshiram as well as Pokemon like Zacian-C from switching in repeatedly. Ice Beam is used to nail the likes of Zygarde-C, Groudon, and Zekrom. Teleport allows Porygon2 to safely pivot out of potential switch-ins like Ho-Oh and Ferrothorn. Analytic lets Porygon2 hit most foes harder due to its low Speed. Maximum HP and Defense investment with a Bold nature lets Porygon2 take on Psyshock Calyrex-S more reliably and deal with other foes like Necrozma-DM, Groudon, and Zygarde-C more easily. Porygon2 should be wary of switching into Knock Off or Trick users like Yveltal, defensive Necrozma-DM, and Choice-item Calyrex-S, since losing its Eviolite will make it significantly less bulky.</p> <p>Porygon2 fits best on balance and bulky offense teams that appreciate having a reliable check to Calyrex-S, one of the most dangerous threats in the tier, as well as other foes like Zygarde-C and Dragon Dance Necrozma-DM. Porygon2 is easily forced out by foes that carry super effective coverage against it or are generally very powerful such as Zacian-C, Marshadow, and Kyogre. Thus, teammates that can deal with them such as Necrozma-DM and Eternatus are crucial. Necrozma-DM can also deal with Xerneas, which is particularly very threatening to Porygon2 as well. Porygon2 struggles to get through troublesome walls like Ferrothorn, Eternatus, and Ho-Oh, so wallbreakers that can deal with them like Calyrex-S and offensive Kyogre are appreciated. They also benefit from Porygon2 safely pivoting them in with Teleport. Gothitelle can trap walls like Ferrothorn, Necrozma-DM, and non-Dragon Tail Eternatus, making it a good partner on balance teams. Porygon2 strongly dislikes Knock Off users like defensive Necrozma-DM and Yveltal getting rid of its Eviolite, so teammates like Zygarde-C and Zacian-C are useful. Zygarde-C can check threats like Marshadow lacking Ice Punch, Urshifu-S, Ho-Oh, and Groudon, the latter of which is especially helpful because Porygon2 is OHKOed by +2 Precipice Blades. Porygon2 fails to reliably check +2 Dynamax Calyrex-S, so a speed control option such as Ditto or Choice Scarf Calyrex-S is useful alongside it.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 511624, "username": "Fc"}, {"user_id": 464176, "username": "Icemaster"}]}, {"name": "Grammar checked by", "members": [{"user_id": 302985, "username": "lotiasite"}]}], "writtenBy": [{"user_id": 491896, "username": "Rotten"}]}
  },
  "Blissey": {
    "comments": "<h1>Other Options</h1> <p>Thunder Wave can be used over Toxic to cripple otherwise great switch-ins to Blissey such as Marshadow and Zacian-C. Shadow Ball can be used in Blissey's last moveslot to damage Calyrex-S; however, it barely 2HKOes 4 HP variants and is very hard to fit, severely limiting its usefulness.</p> <h1>Checks and Counters</h1> <p><strong>Physical Wallbreakers: Even with Defense investment, a strong hit from Zacian-C or Groudon will deal huge damage to Blissey, if not outright OHKO it. Blissey's minimal offensive presence also provides opportunities for these Pokemon to set up, as Seismic Toss typically doesn't put out enough damage due to the high HP of many common physical attackers. Dragon Dance Zygarde-C particularly enjoys setting up on Blissey, as its Substitute is not broken by Seismic Toss.</p> <p><strong>Entry Hazards: Blissey is vulnerable to entry hazard damage over the course of the game, and if it is forced out before it can use Soft-Boiled, its HP can get too low to safely switch into Choice Specs Kyogre or boosted Xerneas.</p> <p><strong>Trick Users: If a Pokemon like Calyrex-S gives a Choice item to Blissey, it will typically become almost useless for the remainder of the battle. It cannot make full use of its moveset to check Pokemon and can be used as setup fodder by a considerable portion of the meta if locked into Soft-Boiled.</p> <p><strong>Taunt Users</strong>: Taunt limits Blissey to only its Seismic Toss, meaning it is not able to effectively perform its role of a special wall. As such, Blissey can struggle greatly against Yveltal and Gothitelle.</p> ",
    "sets": [
      {
        "name": "Special Wall",
        "description": "<p>Blissey is a good special wall in AG, most notably acting as a counter to offensive Kyogre thanks to its huge special bulk, reliable recovery, and Utility Umbrella. In addition, it can wall many of the other prevalent special attackers in the metagame such as Eternatus and Xerneas and is especially great at wasting their Dynamax turns. Toxic can be used to cripple threats like Yveltal and Dragon Dance Zygarde, whereas Seismic Toss gives Blissey more immediate offensive presence and breaks Xerneas's Substitute. Aromatherapy can be used to keep statused teammates useful for the duration of the match, notably benefitting offensive teammates like Calyrex-S and Zacian-C. Teleport turns Blissey into a defensive pivot, as it often baits in Pokemon like Zacian-C, allowing it to safely switch to counterplay. Confide halts special setup sweepers like Geomancy Xerneas and Calm Mind Kyogre. The EV spread is used to maximize Blissey's overall bulk.</p> <p>Owing to its extreme passivity, Blissey is typically more suited for balanced teams looking to check special threats. Physically defensive Ho-Oh forms a strong defensive backbone with Blissey, as it is able to check some of Ho-Oh's threats in Kyogre and Xerneas, and Ho-Oh can check Steel-types such as Zacian-C, Ferrothorn, and defensive Necrozma-DM. Necrozma-DM itself is also an excellent Pokemon to pair with Blissey for its high Defense and Prism Armor allowing it to take on Zacian-C. Pokemon that are revenge killed by Choice Scarf Kyogre, specifically Zacian-C and Groudon, will appreciate Blissey's ability to switch in and immediately force it out; with Teleport, Blissey can maintain momentum. Blissey also pairs well with Pokemon that struggle against Eternatus such as Zygarde-C, Kyogre, and Yveltal, as it can sponge its attacks and Toxic with Natural Cure while potentially burning through Recover PP with Seismic Toss. Blissey struggles against the likes of Marshadow and Zygarde-C, so a strong Fairy-type partner in Xerneas or Zacian-C is quite useful.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 426798, "username": "Geysers"}, {"user_id": 491896, "username": "Rotten"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "martha"}, {"user_id": 331519, "username": "CryoGyro"}]}], "writtenBy": [{"user_id": 501951, "username": "zee"}]}
  },
  "Tyranitar": {
    "comments": "<h1>Other Options</h1> <p>Roar is a decent option in place of Foul Play or Thunder Wave, as it wears down foes due to Stealth Rock and sand while providing amazing support against Baton Pass Calyrex-S teams, a strategy with very limited counterplay. Not having a Dark-type STAB move or Thunder Wave does, however, let Zacian-C, Choice Scarf Kyogre, and other wallbreakers switch in far more freely. Crunch can also be used over Foul Play to pressure Eternatus with more damage and potential Defense drops, but it doesn't have the same utility as many other options Tyranitar has access to.</p> <h1>Checks and Counters</h1> <p><strong>Super Effective STAB Attacks: Tyranitar's typing leaves it with multiple weaknesses, so STAB attacks from multiple common Pokemon such as Marshadow, Necrozma-DM, and Xerneas can easily break through its bulk, and they don't take much damage from Tyranitar's attacks back.</p> <p><strong>Ground-types: Groudon and Zygarde's high natural Defense, Rock resistance, and immunity to Thunder Wave make them stone walls for Tyranitar. Groudon can switch in multiple times and use it to set up Stealth Rock or a more dangerous Swords Dance, and Zygarde-C can likewise freely set up with Dragon Dance or Coil, although Foul Play deters Swords Dance and Dragon Dance.</p> <p><strong>Water-types: All the major Water-types in the metagame can threaten Tyranitar, as none of them are largely bothered by the attacks it can throw out. Kyogre changes the weather and threatens an OHKO with its offensive sets, and defensive sets can set up on it with Calm Mind and use Rest to negate Thunder Wave, the only potentially troubling attack to Kyogre. Palkia and Dracovish hit it for massive damage if not an OHKO, and Tyranitar has no meaningful way to threaten Gastrodon or Quagsire. Offensive Kyogre, Palkia, and Dracovish must, however, switch in safely due to Thunder Wave.</p> <p><strong>Zacian-C: Zacian-C has multiple ways to OHKO Tyranitar, and it easily takes advantage of the turns spent clicking Rest or Stealth Rock by forcing Tyranitar out and potentially getting setup turns. It doesn't appreciate being worn down by Foul Play or being paralyzed by Thunder Wave, however, limiting its switch-in opportunities.</p> ",
    "sets": [
      {
        "name": "Specially Defensive",
        "description": "<p>While facing stiff competition from Yveltal, Tyranitar is able to hold its own due to its fantastic sand-boosted special bulk and typing, which let it switch reliably into Calyrex-S, Yveltal lacking Focus Blast, Ho-Oh, Eternatus, and Lunala, while being a valuable entry hazard setter with Stealth Rock. Rock Blast is chosen over other Rock-type STAB moves to beat SubSeed Calyrex-S while still forcing Yveltal out. Foul Play deters some physical attackers such as Zacian-C, Marshadow, and Groudon from switching in or setting up on Tyranitar. Thunder Wave is similarly useful, but it trades the ability to deter Zygarde or Groudon from setting up for the ability to cripple Kyogre and Xerneas. Tyranitar lacks reliable recovery, so it has to use Rest to heal from the continuous attacks it will likely be taking, but this does let it absorb status from the likes of Toxic Ho-Oh, Toxic Eternatus, and Giratina. Leftovers makes Tyranitar need to use Rest less often, but Heavy-Duty Boots is another solid option to increase its longevity. Maximum Special Defense and HP investment gives it the best chances of beating Calyrex-S over a longer game, which is generally its most important role, and is overall helpful for most special attackers that can't immediately threaten it such as Eternatus and specially offensive Yveltal.</p> <p>Tyranitar's best fit is on balance teams that appreciate its ability to check Calyrex-S, Yveltal, and Eternatus while also providing Stealth Rock support. This Stealth Rock support also gives teammates the moveset freedom to exert more pressure, like Necrozma-DM running more offensive Dragon Dance sets. Tyranitar can be overwhelmed by a number of offensive Pokemon in the metagame such as Zacian-C, Kyogre, Xerneas, and Groudon. Teammates that can deal with these threats such as Necrozma-DM, Eternatus, Ferrothorn, and Lunala, respectively, are all useful. Eternatus can additionally outspeed threats like Marshadow and Zygarde-C and deal with them with Dynamax Cannon while limiting opposing Necrozma-DM due to its good bulk and Pressure. Ferrothorn also switches into Kyogre reliably. Zacian-C can pressure Xerneas and revenge kill offensive Pokemon like weakened Groudon. It also appreciates sand weakening Necrozma-DM's recovery and Stealth Rock powering up Assurance, which makes Necrozma-DM lacking Heavy-Duty Boots struggles to switch into Zacian-C. Quagsire is a more reliable of way of dealing with Zacian-C than Necrozma-DM when paired with Tyranitar, as its recovery is not hindered by sand, but it can only find a place on bulky balance and stall teams. Offensive Excadrill requires Tyranitar as a teammate to work reliably, although Tyranitar does not require it.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 491896, "username": "Rotten"}, {"user_id": 426798, "username": "Geysers"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 511624, "username": "Fc"}]}
  },
  "Ho-Oh": {
    "comments": "<h1>Other Options</h1> <p>Recover can be used in the fourth slot but at a significant opportunity cost, since Ho-Oh already has a reliable form of recovery in Regenerator. The only benefit of using Recover is that Ho-Oh can stay in on Pokemon that can inflict minor chip damage, like some Yveltal sets, for longer periods of time than it might otherwise be able to. Flare Blitz is an alternative strong Fire-type STAB move with more PP than Sacred Fire, but it sacrifices Sacred Fire's high burn chance and reduces Ho-Oh's longevity through recoil. Additionally, Thunder Wave can be used over Toxic to provide support to allow slower teammates like Choice Specs Kyogre to sweep more effectively.</p> <h1>Checks and Counters</h1> <p><strong>Bulky Dragon-types: Bulky Dragon-types such as defensive Zygarde, Giratina, Eternatus, and Palkia can all switch freely into any of Ho-Oh's moves with impunity, threaten to punish it with Toxic or Glare, and eventually force it out while disregarding any status inflicted by Ho-Oh. In addition, some Eternatus sets can carry Meteor Beam, which can remove Ho-Oh. Additionally, Zekrom can use Ho-Oh as setup fodder, forcing it out with the threat of a super effective Bolt Strike and using the turn to set up a Substitute or Dragon Dance.</p> <p><strong>Knock Off: Ho-Oh desperately needs its Heavy-Duty Boots in order to avoid Stealth Rock damage and come in safely, so if a Pokemon such as Necrozma-DM or Yveltal removes its item, Ho-Oh will likely be crippled without a secondary Defog user.</p> <p><strong>Kyogre: Kyogre, especially Rest sets, can seriously threaten Ho-Oh, thanks to its ability to safely absorb status while threatening to OHKO Ho-Oh if it stays in.</p> <p><strong>Rock-type Moves</strong>: Before attempting to pivot into foes such as Groudon, Marshadow, Necrozma-DM, and Eternatus, ensure that you scout for Rock-type coverage, like Stone Edge, Rock Tomb, and Meteor Beam.</p> ",
    "sets": [
      {
        "name": "Defensive Pivot",
        "description": "<p>Ho-Oh is one of the most consistent pivots in AG thanks to its solid natural bulk coupled with an expansive utility movepool, strong defensive typing, and amazing ability. Ho-Oh can switch into a plethora of common threats, including Yveltal, Zacian-C, and Eternatus, allowing for movepool scouting and wasting Dynamax turns from threats such as Yveltal and Zygarde-C. Sacred Fire is Ho-Oh's primary means of damage output, notably allowing it to deal heavy damage to opposing Necrozma-DM and Zacian-C while threatening to burn potential switch-ins such as Eternatus and Zekrom, which could otherwise take advantage of it. Great care must be taken, however, to ensure that one's Sacred Fire PP does not get wasted over the course of a battle, especially if the opponent has a Pressure user such as Eternatus, Palkia, or Giratina. Toxic allows Ho-Oh to reliably cripple a significant portion of the metagame, notably putting Yveltal, Palkia lacking Rest, Calyrex-S, and numerous other threats on timers, while also helping to deter potential switch-ins, particularly preventing Kyogre from switching in freely on Ho-Oh. Defog lets Ho-Oh provide invaluable utility to its team, helping to keep the field clear of Spikes and Stealth Rock. It also notably protects Necrozma-DM from Assurance Zacian-C, which is particularly beneficial, as Ho-Oh has a good matchup versus common entry hazard users such as Necrozma-DM and Ferrothorn. Whirlwind is chosen to enable Ho-Oh to deter Pokemon like Xerneas and Dragon Dance Zygarde-C from setting up while also enabling it to be a last-ditch defense against potential runaway sweepers like +1 Calyrex-S. Alternatively, Protect can be used to allow Ho-Oh to more reliably check Yveltal, waste multiple turns of Yveltal's or Xerneas's Dynamax, and scout what move Choice-item users lock into. Brave Bird can also be used to let Ho-Oh chip Eternatus and to potentially boost its Speed under Dynamax. Regenerator gives Ho-Oh a source of reliable recovery throughout the match, allowing it to pivot into attacks from a wide variety of potentially threatening attackers with ease. The given EVs with an Impish nature allow Ho-Oh to survive a +2 Thunder from Geomancy Xerneas from full health while also maximizing physical bulk and minimizing Stealth Rock damage if Heavy-Duty Boots is Knocked Off.</p> <p>Ho-Oh can fit on all manner of balance, bulky offense, and stall teams thanks to its ability to pivot into a significant portion of the metagame's attackers, enabling teammates safer switches. Ho-Oh can also provide invaluable utility as a status absorber, protecting its teammates from potentially crippling status. An especially good teammate for Ho-Oh is the nigh mandatory Necrozma-DM, which greatly appreciates the presence of a secondary Xerneas and Zacian-C check. Ho-Oh should be used with caution around opposing Knock Off Ferrothorn and Necrozma-DM, since the loss of Heavy-Duty Boots severely reduces Ho-Oh's survivability. Additionally, teammates such as Ferrothorn, Blissey, and Eternatus can all pair well with Ho-Oh, since they reliably check Kyogre, which would otherwise threaten Ho-Oh. Notably, Ferrothorn and Eternatus can provide hazard support, which pairs well with Ho-Oh's ability to force switches through Whirlwind. Ho-Oh should not be a team's only check to Yveltal, so teammates such as specially defensive Eternatus and Tyranitar can be useful to have.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 367227, "username": "baconeatinassassin"}, {"user_id": 464176, "username": "Icemaster"}]}, {"name": "Grammar checked by", "members": [{"user_id": 302985, "username": "lotiasite"}]}], "writtenBy": [{"user_id": 426798, "username": "Geysers"}]}
  },
  "Shedinja": {
    "comments": "<h1>Other Options</h1> <p>Another option for Shedinja is Poltergeist over Shadow Sneak. Poltergeist has lower PP than Shadow Sneak, but it doesn't make contact, allowing Shedinja to attack without risking a Rocky Helmet Necrozma-DM or Iron Barbs Ferrothorn switching in. Additionally, Poltergeist deals better damage to other possible switch-ins such as Ho-Oh and Eternatus.</p> <h1>Checks and Counters</h1> <p><strong>Tyranitar: Tyranitar's Sand Stream forces Shedinja lacking Safety Goggles to remain off the field until the sand has ended or been removed by one of Shedinja's teammates. Sand blocking Shedinja's entry is a heavy constraint on its utility that can allow threatening sweepers to safely set up.</p> <p><strong>Super Effective Attacks</strong>: Any Pokemon that can hit Shedinja super effectively will KO it, including Yveltal, Eternatus, Ho-Oh, Groudon, Calyrex-S, and Marshadow, although the latter two have to watch out for Shadow Sneak.</p> <p><strong>Status Moves: Toxic and Will-O-Wisp fatally cripple Shedinja, KOing it whenever it ends the turn on the field. The threat of fatal status allows the vast majority of the defensive metagame to force Shedinja out. If Shedinja is paralyzed by either Thunder Wave or Glare, it can safely stay in on Pokemon carrying Toxic or Will-O-Wisp that cannot touch it otherwise but loses some reliability.</p> <p><strong>Contact Damage</strong>: If Shedinja hits a Rocky Helmet Pokemon, Iron Barbs Pokemon, or another source of contact damage with Shadow Sneak, it will be instantly removed from the game.</p> ",
    "sets": [
      {
        "name": "Defensive Pivot",
        "description": "<p>Shedinja's unique ability Wonder Guard lets it wall any Pokemon lacking status moves or coverage to beat it; this notably includes Kyogre, Xerneas, Dragon Dance Zygarde, and Zacian-C or Dracovish lacking a Dark-type move. Toxic allows Shedinja to cripple Kyogre, Xerneas, and Zygarde as well as potential switch-ins like Yveltal and Ho-Oh. Will-O-Wisp cripples Zacian-C and Dracovish along with possible switch-ins like Necrozma-DM, Eternatus, Groudon, and Ferrothorn. Alternatively, Protect can be run to scout for potential coverage or status moves that can beat Shedinja. Baton Pass lets Shedinja generate momentum if the opponent switches, which is especially useful because Shedinja can force out numerous common offensive Pokemon, and saves Heavy-Duty Boots variants from getting KOed by sand set by Tyranitar. Shadow Sneak allows Shedinja to pick off Pokemon like weakened Calyrex-S and other foes that have been heavily chipped, including Zacian-C and Xerneas. Heavy-Duty Boots is the preferred item for Shedinja, since entry hazards are very common, but Safety Goggles protects Shedinja from opposing Tyranitar and lingering sand or hail from Max Moves, allowing Shedinja to be used with Tyranitar on the same team. Shedinja's EVs maximize its Shadow Sneak damage while also outspeeding Chansey and Tyranitar, letting Shedinja pivot into a teammate that can take advantage of them, as well as outspeeding Necrozma-DM if Jolly.</p> <p>Shedinja fits best on bulky and balance teams that appreciate its ability to reliably wall most Xerneas, Zygarde, and Kyogre while potentially luring in and crippling defensive Pokemon like Necrozma-DM, Ho-Oh, Eternatus, Ferrothorn, and Tyranitar. Offensive Pokemon like Groudon, Dragon Dance Zygarde-C, Zekrom, and Kyogre are good teammates, since they appreciate safe entry onto the field from Baton Pass and heavily pressure the aforementioned defensive Pokemon. Groudon and Kyogre can prove especially useful because they remove Tyranitar's sand, allowing Shedinja to switch back in safely. Shedinja also makes Imposter-proofing teams with setup sweepers like Swords Dance Zacian-C and Xerneas a lot more manageable. If Safely Goggles is run, very reliable entry hazard removal from multiple Pokemon such as Ho-Oh and Giratina is nigh mandatory given Shedinja's extreme susceptibility to entry hazards, limiting Safety Goggles variants to stall teams.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 426798, "username": "Geysers"}, {"user_id": 367227, "username": "baconeatinassassin"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}]}], "writtenBy": [{"user_id": 525140, "username": "Thebestneverrest"}]}
  },
  "Kyogre": {
    "comments": "<h1>Other Options</h1> <p>Thunder Wave is usable in the third moveslot on Calm Mind Kyogre, enabling it to still punish Eternatus while crippling any offensive Pokemon such as Zacian-C or Choice item Calyrex-S that may switch in attempting to force Kyogre out. Sheer Cold is another option in the third slot, giving Kyogre a chance of breaking through Ferrothorn and Blissey much more easily while enabling it to wield an Ice-type Max Move. Roar enables Kyogre to take advantage of any entry hazards that may be on the opponent's field while foiling any opposing Calm Mind Kyogre and Geomancy Xerneas that may try set up adjacently. Block lets Kyogre lure in and trap Eternatus, allowing Kyogre to use it as setup bait. A Modest nature can be used on Choice Specs Kyogre to have a better chance of KOing foes, notably offensive Eternatus and Kyurem-W after some chip damage, but is generally worse than Timid because it keeps Kyogre from outspeeding foes like unboosted Xerneas and Rash or Modest Yveltal. Even on Sticky Web teams, Timid Kyogre can always outspeed Jolly Zacian-C and non-Choice Scarf Calyrex-S. Sheer Cold is an option to pressure switch-ins such as Eternatus and Palkia, but it is generally not worthwhile due to its very low accuracy and it being hard to justify forgoing a coverage move for. Surf and Scald can be used on Choice Scarf Kyogre as more accurate alternatives to Origin Pulse. Scald can be useful for burning Pokemon like Zacian-C and Ferrothorn in a pinch, which can be threatening to Kyogre without Water Spout. However, Surf and Scald lack in power, more often failing to deal enough damage.</p> <h1>Checks and Counters</h1> <p><strong>Ferrothorn: Ferrothorn carrying a Grass-type attack uses Kyogre as an opportunity to set up Spikes while completely walling it unless Ferrothorn has been burned and Kyogre has a Substitute set up. However, it cannot reliably switch into Choice Specs-boosted Water Spout.</p> <p><strong>Phazers</strong>: Phazers such as Dragon Tail Eternatus, Dragon Tail Kyurem-W, and Roar Palkia can thwart Calm Mind Kyogre's setup attempts. Kyurem-W lacking Dragon Tail can still damage Kyogre heavily with Freeze-Dry or even threaten to OHKO Kyogre after accumulating multiple Calm Mind boosts with Sheer Cold.</p> <p><strong>Blissey</strong>: Blissey's monstrous special bulk paired with a Utility Umbrella allows it to threaten Kyogre. It can wear Kyogre down with Seismic Toss, cripple it with Toxic, weaken it with Confide, or slow pivot out to a teammate with Teleport.</p> <p><strong>Revenge Killers</strong>: Despite Kyogre's high bulk, revenge killers such as Calyrex-S, Marshadow, Sucker Punch Yveltal, and Zacian-C can all outspeed Kyogre due to its average Speed stat. However, Sticky Web support from Shuckle allows Choice Specs Kyogre to outspeed most of these threats. Ditto can also revenge kill Choice Specs or Choice Scarf Kyogre by using Thunder, but Kyogre's teammates are able to take advantage of Ditto being locked into a single non-STAB move, especially if Ditto's team has already used its Dynamax. Kyogre can also circumvent the aforementioned revenge killers easily through Dynamax's HP boost. Offensive lead variants are able to OHKO Kyogre, while utility ones can also set dual screens to make Kyogre's revenge killing more difficult.</p> <p><strong>Bulky Dragon-types: Bulky Dragon-types such as Eternatus, Palkia, and Kyurem-W can reliably check Kyogre due to their bulk and useful typing against it. Offensive Dragon-types such as Life Orb Eternatus, Rayquaza, Palkia, and Kyurem-W can outspeed and force out or KO Kyogre with their STAB moves.</p> ",
    "sets": [
      {"name": "Thunder Wave + Substitute"},
      {
        "name": "Calm Mind",
        "description": "<p>Calm Mind Kyogre's great typing and relatively high natural bulk enable it to freely set up on a wide variety of defensive Pokemon such as Necrozma-DM, Zygarde-C, Ho-Oh, Lunala, and notably Kyurem-W and Eternatus lacking Dragon Tail, which otherwise check non-Calm Mind Kyogre sets. Scald is preferred as the main attack due to its higher PP and accuracy, and it notably can punish Ferrothorn and Eternatus with a burn. However, Origin Pulse has much higher initial power—OHKOing defensive Necrozma-DM and Ho-Oh after a single Calm Mind, helping Kyogre to avoid status. Ice Beam enables Kyogre to cleanly KO Eternatus once set up while also allowing it to serve as a reliable Zygarde-C check. Otherwise, Substitute can be chosen in order to set up on Ferrothorn lacking a Grass-type attack, avoid being phazed by Dragon Tail Eternatus and Kyurem-W, negate status, stall out Sheer Cold from Kyurem-W lacking Freeze-Dry and opposing Kyogre, and be less easily revenge killed by Zacian-C and Zekrom. If using Substitute, Scald is more strongly preferred over Origin Pulse as, after a burn and factoring in miss chances, Ferrothorn's Power Whip only has a 53% chance of breaking Kyogre's Substitute, while Bullet Seed variants fail to do so. Rest enables Kyogre to easily recover from status, making it unable to be harmed easily by common defensive Pokemon such as Ho-Oh, Necrozma-DM, and Eternatus, while Leftovers reduces its reliance on Rest. The given EV spread maximizes physical bulk, helping shrug off hits from Groudon and Zygarde-C, while enabling Kyogre to outspeed paralyzed Calyrex-S. Under Dynamax, Kyogre becomes incredibly hard to revenge kill, as its bulk reaches colossal levels—easily withstanding a Max Lightning from Zekrom.</p> <p>Calm Mind Kyogre fits on a variety of balance teams, as it absorbs status and checks Zygarde-C, and it threatens to easily sweep teams without Dragon Tail Eternatus, Blissey, Kyurem-W, or Ferrothorn. As such, teammates that are able to punish these foes, such as Zacian-C and Groudon, are appreciated. In return, Kyogre summons rain, weakening Necrozma-DM's recovery so Zacian-C can break through it far more easily, while easily punishing Zygarde-C for Groudon. Dracovish is another powerful teammate, easily capable of overwhelming shared checks, especially if Kyogre runs Thunder Wave in the third moveslot. Additionally, Ferrothorn and Yveltal can use Knock Off to cripple Eternatus and opposing Ferrothorn, making opposing Ferrothorn far easier for Kyogre to defeat when coupled with Scald burns. Yveltal can also switch into Calyrex-S in order to absorb Trick. Gothitelle is a valuable partner, capable of trapping and removing Ferrothorn, Blissey, and non-Dragon Tail Eternatus. Thunder Wave Ho-Oh lures in and cripples Eternatus while preventing opposing Ferrothorn from placing entry hazards. While Kyogre isn't easily revenge killed, once Dynamax has ended, it can be severely damaged by opposing Zekrom and Zacian-C, and so counterplay such as Groudon, Lunala, and Necrozma-DM or revenge killers such as Calyrex-S and Ditto are appreciated. Kyurem-W is capable of sponging Sheer Cold from opposing Kyurem-W and Kyogre.</p> "
      },
      {
        "name": "Choice Specs",
        "description": "<p>Choice Specs Kyogre is one of the most threatening wallbreakers in AG due to its solid Special Attack stat, outstanding movepool, and Drizzle, allowing it to dismantle weakened teams or teams lacking a sturdy Water-resistant Pokemon. Water Spout is Kyogre's most spammable move at full health and can even 2HKO otherwise-reliable checks such as Ferrothorn, Giratina, and Chansey. However, Kyogre should only attempt to 2HKO Ferrothorn on a switch, since it will risk being worn down by Leech Seed or getting heavily damaged by Power Whip. Origin Pulse is run for when Kyogre is weakened but still hits very hard, although it misses out on the aforementioned 2HKOs. Ice Beam hits Giratina, Zekrom, and Rayquaza and OHKOes offensive Eternatus after Stealth Rock damage on the switch. Thunder nails opposing Kyogre, 2HKOes Lapras and offensive Palkia, and forces Ditto to lock into it, while also being consistent under Kyogre's rain. A Timid nature with maximum Speed investment allows Kyogre to outspeed unboosted Xerneas and Rash or Modest Yveltal, outspeed Calyrex-S and Jolly Zacian-C with Sticky Web support, and Speed tie with offensive Groudon. Kyogre is best used as an early-game wallbreaker due to its ability to force out foes like Necrozma-DM, Ho-Oh, Tyranitar, and Zygarde-C while weakening traditional checks like Blissey and Ferrothorn for its teammates. It's often vital to keep Kyogre as healthy as possible so it can maximize Water Spout's power and spam it against the opposing team.</p> <p>Kyogre's best fit is on hyper offense teams, but it can also find a spot on bulky offense teams. On hyper offense teams, Kyogre greatly appreciates Sticky Web from Shuckle, which allows it to outspeed more threats such as Calyrex-S and Zacian-C. It also likes Excadrill setting Stealth Rock as well as clearing entry hazards with Rapid Spin so Kyogre can stay as healthy as possible. Teammates that can deal with Water-resistant Pokemon like Eternatus, Palkia, Ferrothorn, and Giratina, such as Zacian-C, Xerneas, and Eternatus, are appreciated. Zacian-C and Xerneas benefit from Kyogre's rain, as it weakens Necrozma-DM's Morning Sun, making it a less effective check against the two. Pokemon like Life Orb Yveltal, Calyrex-S, and Groudon appreciate Kyogre pressuring their checks like Tyranitar, Yveltal, and Zygarde-C, respectively. In return, they are able to defeat the aforementioned checks to Kyogre. On bulky offense teams without Sticky Web, Kyogre's teammates must be able to check fast threats. For example, Yveltal can check Calyrex-S, and Necrozma-DM can check Zacian-C. Kyogre also greatly appreciates paralysis support from teammates like Thunder Wave Necrozma-DM, Ho-Oh, and Glare Zygarde-C allowing it to outspeed more threats.</p> "
      },
      {
        "name": "Choice Scarf",
        "description": "<p>With its good Special Attack stat and Drizzle on its side, Choice Scarf Kyogre can find many opportunities to revenge kill foes such as Calyrex-S, Dragon Dance Zygarde-C, Necrozma-DM, and Zacian-C. Water Spout allows Kyogre to OHKO foes such as Zacian-C, Calyrex-S, and unboosted Xerneas when at full health. Origin Pulse provides a good STAB move once Kyogre is too weakened for Water Spout, 2HKOing key foes such as Necrozma-DM, Zacian-C, and specially defensive Yveltal. Ice Beam forces out Dragon-types such as weakened defensive Eternatus, Zekrom, and Zygarde-C. Thunder deals heavy damage to other Kyogre and transformed Ditto, and is Kyogre's best move against Palkia.</p> <p>Choice Scarf Kyogre fits best on balance and bulky offense teams, as it can force out offensive leads like Zacian-C and Calyrex-S as well as defensive leads like Necrozma-DM and specially defensive Yveltal. Teammates like Zacian-C and Calyrex-S pressure Kyogre's counters such as Blissey, Ferrothorn, Kyurem-W, and Eternatus, with Nasty Plot Calyrex-S in particular being able to pass Special Attack boosts to Kyogre. In return, Kyogre can pressure their checks in Necrozma-DM or Yveltal, notably limiting Necrozma-DM's source of recovery with Drizzle. Defoggers such as Ho-Oh and specially defensive Yveltal help Kyogre remain at full health, with Ho-Oh in particular limiting Ferrothorn like no other. Pokemon such as Necrozma-DM, Groudon, and Ferrothorn can set up entry hazards, allowing Kyogre to pressure Eternatus, Kyurem-W, and Ferrothorn a lot better and OHKO Focus Sash Calyrex-S. Kyogre is incapable of reliably checking boosted Xerneas, Zygarde-C behind a Substitute, Groudon after a few Max Airstream boosts, and boosted Zekrom. Necrozma-DM and Zacian-C can prove to be useful for patching up the Xerneas matchup, while bulky Lunala can effectively limit all of Zygarde-C, Groudon, and Zekrom.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 426798, "username": "Geysers"}, {"user_id": 360582, "username": "Guard"}, {"user_id": 491896, "username": "Rotten"}, {"user_id": 367227, "username": "baconeatinassassin"}]}, {"name": "Grammar checked by", "members": [{"user_id": 302985, "username": "lotiasite"}, {"user_id": 517429, "username": "Finland"}, {"user_id": 240732, "username": "Astra"}, {"user_id": 331519, "username": "CryoGyro"}]}], "writtenBy": [{"user_id": 491896, "username": "Rotten"}, {"user_id": 464176, "username": "Icemaster"}, {"user_id": 532881, "username": "Frozoid"}]}
  },
  "Groudon": {
    "comments": "<h1>Other Options</h1> <p>Lum Berry can be used over Life Orb to give Groudon an extra setup opportunity against foes like Lunala and Giratina. However, the extra damage output from Life Orb is usually more preferred.</p> <h1>Checks and Counters</h1> <p><strong>Physically Defensive Walls: Physically defensive walls that aren't weak to any of Groudon's moves, such as defensive Zygarde-C and Lunala, can take hits from unboosted Groudon. Zygarde-C can paralyze it with Glare, remove its stat boosts with Haze, and phaze a non-Dynamaxed Groudon with Dragon Tail. However, Zygarde can get OHKOed by a boosted Max Quake, and it must transform into its Complete forme to consistently check Groudon throughout the match. Lunala can cripple Groudon with Will-O-Wisp or Toxic, but gets overwhelmed after Shadow Shield has been broken. Giratina is a shakier check to Groudon, but can survive a +2 Precipice Blades and can also cripple it with Will-O-Wisp or Toxic.</p> <p><strong>Revenge Killers: Life Orb can wear down Groudon, making it susceptible to revenge killers such as Ditto, Choice Scarf Calyrex-S, and Sucker Punch Yveltal, especially if one's Dynamax has been wasted. Groudon can also struggle to clean if it fails to rack up a Speed boost, in which case Pokemon such as Eternatus, Choice Scarf Kyogre, and Zacian-C can revenge kill it. Eternatus and Zacian-C also ignore the HP boost from Dynamax with Dynamax Cannon and Behemoth Blade, respectively. Choice Scarf Zacian and Choice Scarf Galarian Darmanitan are particularly huge threats, as they can threaten and outspeed Groudon even after a Max Airstream boost. However, Sticky Web support from Shuckle or offensive pressure from teammates can allow Groudon to deal with these faster threats.</p> ",
    "sets": [
      {
        "name": "Dynamax Sweeper",
        "description": "<p>Groudon is one of the most threatening Dynamax sweepers in AG. With its good Attack stat and solid movepool, Groudon can find many opportunities to force out foes such as Necrozma-DM, Tyranitar, Zekrom, and Ho-Oh and set up for a potential sweep. Swords Dance turns Groudon into a deadly wallbreaker, allowing it to 2HKO Zygarde-C and Giratina as well as and OHKO Lunala and Zygarde after minor chip damage. Stone Edge allows Groudon to hit Flying-types such as Ho-Oh and Yveltal that would otherwise be a nuisance for it. Under Dynamax, Stone Edge turns into Max Rockfall, setting sand that breaks Lunala's Shadow Shield. Aerial Ace turns into Max Airstream, allowing Groudon to outspeed almost the entire metagame after a Speed boost. Maximum Speed investment with a Jolly nature allows Groudon to outpace Calyrex-S after Max Airstream has been used, while Life Orb guarantees several key OHKOs and 2HKOes after a Swords Dance boost.</p> <p>Groudon's best fit is on hyper offense teams, although it can also fit well on balance and bulky offense teams. On hyper offense, teammates such as Shuckle and Excadrill are able to provide immense support for it through entry hazards such as Sticky Web and Stealth Rock, respectively, enabling it to better break through its extremely limited checks. Groudon can force out common entry hazard setters such as Necrozma-DM, Tyranitar, and Ferrothorn, which is valuable because Shuckle cannot remove opposing entry hazards and Excadrill's Rapid Spin can be blocked by Ghost-types such as Marshadow and Calyrex-S. Zacian-C in particular is a good wallbreaker that can lure in Necrozma-DM and weaken Zygarde-C, and Yveltal can pressure Ghost-types like Lunala, Calyrex-S, and Giratina for Groudon and Excadrill. Teammates like Ho-Oh and Necrozma-DM can Imposter-proof Groudon, stalling out Ditto's Dynamax turns to somewhat reliably check it. Ferrothorn can check Choice Scarf Kyogre and provide Spikes support for Groudon on bulky offense teams. Other setup sweepers such as Xerneas, Nasty Plot Calyrex-S, and Dragon Dance Necrozma-DM appreciate Groudon KOing walls such as Necrozma-DM, Tyranitar, and Ferrothorn for them. In return, they can pressure walls such as Zygarde-C and full health Lunala that Groudon struggles with. To maximize Groudon's sweeping potential, the foe's Dynamax should be wasted by powerful teammates such as Xerneas, Zacian-C, and Kyogre. Groudon should generally be used mid- or late-game once its biggest checks in Zygarde-C and Lunala have been weakened from teammates' offensive pressure.</p> "
      },
      {"name": "Offensive Stealth Rock"},
      {"name": "Defensive Stealth Rock"}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 360582, "username": "Guard"}, {"user_id": 426798, "username": "Geysers"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 491896, "username": "Rotten"}]}
  },
  "Rayquaza": {
    "comments": "<h1>Other Options</h1> <p>Earthquake is most notably used to hit Tyranitar and Zekrom, at the cost of dealing less damage against Necrozma-DM and Ferrothorn. Heavy-Duty Boots negates Rayquaza's weakness to Stealth Rock, which puts less pressure on teammates like Excadrill to remove entry hazards for it. The loss of damage output with Life Orb is noticeable, however, as it struggles to OHKO Ho-Oh and defensive Kyogre from full health after a Swords Dance boost.</p> <h1>Checks and Counters</h1> <p><strong>Physically Defensive Walls: Bulky walls such as Lunala can take any unboosted hit from Rayquaza thanks to Shadow Shield and retaliate with Ice Beam or cripple it with status. Healthy Zygarde-C can tank almost any hit from Rayquaza and either paralyze it with Glare or phaze it out with Dragon Tail. Outrage can OHKO Zygarde if it's not Dynamaxed, but Rayquaza still must be careful of its immense bulk once Power Construct has been activated. Giratina can weaken Rayquaza with Will-O-Wisp and stall out its low PP moves with Pressure, but it must be wary of Outrage breaking through it.</p> <p><strong>Revenge Killers: Rayquaza's unimpressive Speed stat leaves it outsped by dedicated revenge killers like Choice Scarf Calyrex-S, Ditto, and Marshadow, which can take it out if it gets weakened. However, Ditto's reliance on Extreme Speed make it vulnerable to potential teammates such as Dragon Dance Necrozma-DM, Marshadow, and Calyrex-S. Zacian-C and Eternatus are capable of outright OHKOing an unboosted Rayquaza, while ignoring the effects of Dynamax with Behemoth Blade and Dynamax Cannon, respectively.</p> ",
    "sets": [
      {
        "name": "Dynamax Sweeper",
        "description": "<p>Rayquaza is a fearsome Dynamax sweeper in AG thanks to its generally good Attack stat and amazing movepool, which allow it to threaten a large portion of the metagame. However, Rayquaza's mediocre bulk and defensive typing give it little setup opportunities, making it generally outclassed by other Dynamax sweepers like Groudon and Xerneas. Swords Dance turns Rayquaza into a deadly wallbreaker capable of OHKOing Ho-Oh, Eternatus, and defensive Xerneas after Stealth Rock damage as well as defensive Kyogre. Dragon Dance can be used instead to be consistently faster without using Max Airstream, especially if another teammate has already used Dynamax. Dragon Ascent turns into Max Airstream during Dynamax, making Rayquaza difficult to revenge kill by raising its Speed by one stage each turn, tearing apart offensive teams. V-Create deals heavy damage to Steel-types like Ferrothorn, Necrozma-DM, and Zacian-C. Extreme Speed is useful for revenge killing weakened threats such as boosted Xerneas, Sucker Punch Yveltal, and opposing Rayquaza. Alternatively, Outrage nails Zygarde-C; being able to outspeed key faster threats is invaluable, though. Life Orb allows Rayquaza to OHKO Ho-Oh and defensive Kyogre from full health after a Swords Dance boost.</p> <p>Rayquaza fits excellently on hyper offensive teams because entry hazard leads such as Excadrill and Shuckle are able to provide Stealth Rock and Sticky Web, respectively. Other setup sweepers such as Calyrex-S, Zacian-C, and Xerneas are able to overwhelm walls such as Tyranitar and Lunala, giving Rayquaza a safer route to sweep. Rayquaza has a hindering weakness to Stealth Rock, so Rapid Spin Excadrill plays a big role in removing it, while Yveltal deals with most spinblockers. Ghost-types like Marshadow and Calyrex-S are immune to Extreme Speed, which helps against non-Dynamaxed Ditto if it has copied Rayquaza. Rayquaza should usually be used mid- to late-game once all of its checks are removed. It's also recommended to waste the opponent's Dynamax with dangerous wallbreakers like Zacian-C and Calyrex-S before attempting to sweep, since it becomes much harder for foes to take hits from Rayquaza.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 360582, "username": "Guard"}, {"user_id": 426798, "username": "Geysers"}]}, {"name": "Grammar checked by", "members": [{"user_id": 331519, "username": "CryoGyro"}]}], "writtenBy": [{"user_id": 491896, "username": "Rotten"}]}
  },
  "Gastrodon": {"sets": [{"name": "Specially Defensive"}]},
  "Dialga": {"sets": [{"name": "Support"}]},
  "Palkia": {
    "comments": "<h1>Other Options</h1> <p>Draco Meteor is an option that enables Palkia to OHKO bulky Eternatus on the offensive set. However, it causes Palkia to be forced out more easily. Defensive sets can run more Special Attack investment, such as a Modest nature and 80 Special Attack EVs, in order to always OHKO Eternatus and 2HKO Necrozma-DM, but this diminishes its ability to check Kyogre.</p> <h1>Checks and Counters</h1> <p><strong>Specially Defensive Pokemon: Gastrodon, Blissey, Chansey, Lunala, and bulky Yveltal can shrug off most attacks, although Yveltal fears Thunder and Chansey and Blissey fear Focus Punch.</p> <p><strong>Faster Pokemon: Offensive Eternatus, Calyrex-S, and Zacian-C can all outspeed and KO Palkia. However, none of these can safely switch in.</p> <p><strong>Offensive Dynamaxers: Zygarde, Yveltal, and Groudon can all unexpectedly Dynamax and OHKO Palkia, and Palkia should hence be used with caution when they're out on the field.</p> ",
    "sets": [
      {
        "name": "Wallbreaker",
        "description": "<p>The combination of Palkia's respectable speed, gigantic Special Attack, and wide coverage makes it a truly devastating wallbreaker capable of ripping through common walls such as Ho-Oh, Eternatus, Zygarde-C, and Necrozma-DM. Spacial Rend is relatively safe to click in most situations due to its high Base Power and accuracy, giving Palkia the means to break through bulky Eternatus and Zygarde-C. Thunder is used to nail Kyogre, which Palkia is able to check thanks to its useful typing and natural bulk. It also does hefty damage to Yveltal. Hydro Pump offers more power than Spacial Rend and can hit neutral targets such as Necrozma-DM and Zacian-C hard and Ho-Oh and Groudon super effectively. Fire Blast is preferred in the last slot to KO Ferrothorn, as well as to threaten Zacian-C and Necrozma-DM. Alternatively, Focus Punch can be used with Life Orb to KO Blissey and 2HKO Chansey on the switch while still threatening Ferrothorn. However, be wary of the opponent scouting for it by baiting it and switching out. A Timid nature is used to outspeed Pokemon such as bulky Eternatus, Groudon, Yveltal, and Kyogre. If Focus Punch is used over Fire Blast, use a Hasty nature to avoid lowering damage output. Leftovers provides passive recovery, preventing Palkia from getting worn down too quickly by Kyogre. Lustrous Orb provides a boost to Palkia's STAB moves without incurring recoil. Life Orb provides a notable boost to all of Palkia's moves but will cause Palkia to lose health quickly.</p> <p>Palkia fits best on balanced and bulky offensive teams as a proactive means of handling Kyogre. Palkia appreciates Pokemon that can take on faster Pokemon such as Calyrex-S, Zacian-C, Life Orb Eternatus, and Marshadow. Yveltal, Necrozma-DM, Tyranitar, and bulky Zygarde-C, respectively, all provide a way to deal with these threats. Pokemon that can pressure Chansey, Gastrodon, and Blissey are heavily recommended, as they can take on most Palkia variants. Notable examples are Toxic Spikes Eternatus, Marshadow, Zacian-C, and other various physical wallbreakers such as Dragon Dance Zygarde-C and Swords Dance Groudon. Palkia prefers to keep its HP high, so only bring it into play on resisted hits such as Necrozma-DM's Sunsteel Strike, Ho-Oh's Sacred Fire, and Kyogre's Water Spout. Kyogre itself is a good partner for Palkia as it provides rain, boosting Hydro Pump even further and granting Thunder perfect accuracy. In return, Palkia can help break down shared checks such as Blissey if Palkia has Focus Punch.</p> "
      },
      {
        "name": "Defensive",
        "description": "<p>While Palkia is a potent wallbreaker, it can utilize its unique typing, good natural bulk, and high innate Special Attack to take on threatening offensive Pokemon, mainly Kyogre. Draco Meteor is very strong, even uninvested, and can be used to pick up potential KOs on various Pokemon such as Eternatus after some chip damage. Surf is a consistent STAB move that pressures Ho-Oh. Rest is Palkia's only method of recovery aside from Leftovers and also enables it to shrug off status from Ho-Oh, Zygarde-C, and Necrozma-DM. Toxic allows Palkia to cripple Kyogre, Groudon, and Dragon Dance Zygarde-C, as well as defensive walls such as Ho-Oh, Yveltal, Gastrodon, and Lunala. Roar can be used to phaze Pokemon that usually use setup moves such as Groudon and rack up entry hazard damage. It also enables Palkia to beat Calm Mind Kyogre. Lustrous Orb gives Palkia the ability to pressure the likes of Ho-Oh and Eternatus more effectively. Alternatively, Leftovers significantly boosts Palkia's longevity, letting it stick around for longer without having to use the exploitable Rest as often.</p> <p>Palkia's defensive utility is very much appreciated for teams that lack a sturdy check to Kyogre. Pokemon such as Necrozma-DM and Ho-Oh that can take on Xerneas pair well with Palkia, as it forces Palkia out with ease and threatens to set up with Geomancy. Necrozma-DM also deals with Zacian-C, whereas Ho-Oh can neutralize Dynamaxed Yveltal and limit any progress Ferrothorn may seek to make with Spikes. If Palkia chooses to forego Roar, a Pokemon that can deal with Calm Mind Kyogre such as Ferrothorn, Teleport Chansey or Blissey, or offensive checks such as Zacian-C are appreciated. Blissey and Chansey are particularly notable for their ability to wall Life Orb Eternatus as well.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 464176, "username": "Icemaster"}, {"user_id": 360582, "username": "Guard"}]}, {"name": "Grammar checked by", "members": [{"user_id": 302985, "username": "lotiasite"}]}], "writtenBy": [{"user_id": 512812, "username": "WolfishOne"}]}
  },
  "Giratina": {
    "comments": "<h1>Other Options</h1> <p>Roar can be used to phaze Pokemon for chip damage or stop setup sweepers such as Coil Zygarde-C and Zekrom that might try to set up on it. However, this means dropping either Will-O-Wisp or Toxic, which limits the pool of Pokemon Giratina can hinder.</p> <h1>Checks and Counters</h1> <p><strong>Super Effective Attacks: Pokemon like Zacian-C, Calyrex-S, Reshiram, and Life Orb Yveltal can outpace and heavily dent or OHKO Giratina with their super effective attacks.</p> <p><strong>Eternatus: Eternatus will often be the largest roadblock to Giratina's ability to make progress in the long run. Not only does Eternatus threaten Giratina out with Dynamax Cannon, it counter-stalls Giratina's Defog PP with its own Pressure, absorbs Toxic, and doesn't particularly mind Will-O-Wisp.</p> <p><strong>Substitute Setup Sweepers</strong>: Substitute setup sweepers such as Zekrom, Zygarde-C, and Xerneas can set up on Giratina with Substitute to avoid Will-O-Wisp or Toxic from it.</p> ",
    "sets": [
      {
        "name": "Defensive",
        "description": "<p>Giratina is a usable if niche support Pokemon due to its great bulk, solid utility movepool, and strong ability in Pressure. However, it is really passive: it allows Eternatus to come in and use Toxic freely and allows Pokemon like Calyrex-S, Yveltal, and Xerneas to come in, threaten Giratina out, and set up. Giratina's passivity also makes it fairly susceptible to Toxic Spikes, which is exacerbated by its reliance on Rest for recovery. Defog can also work well with Pressure, effectively stalling entry hazards out of PP in more drawn-out games. Toxic is used to put Pokemon such as Ho-Oh and Yveltal on a timer while also limiting potential switch-ins like Calyrex-S and Xerneas. Will-O-Wisp is used to hinder physical attackers such as Necrozma-DM, Zacian-C, Groudon, and switch-ins like Zekrom. It also deters strong physical attackers from using Giratina as setup fodder. Rest allows Giratina to stay healthy throughout the match; however, it needs time using Rest because this will make it free setup bait for Calyrex-S, Xerneas, Zacian-C, Zygarde-C, and Zekrom. Using 40 Special Defense EVs avoids the 2HKO from Modest Choice Scarf Kyogre's Ice Beam after Stealth Rock damage. The rest of the EVs with a Relaxed nature allow it to tank attacks from Zacian-C and Excadrill, as well as +1 Dragon Ascent from Rayquaza, and cripple them with Will-O-Wisp. 0 Speed IVs allow Giratina to use Defog after Necrozma-DM uses Stealth Rock, avoiding Stealth Rock going up in a situation where Giratina is badly poisoned and is better off being sacked.</p> <p>Giratina best fits on bulky balance or stall teams. It appreciates Steel-types like Ferrothorn and Necrozma-DM due to them taking care of Xerneas, and Necrozma-DM can come in on Zacian-C's attacks and wear it down. Giratina struggles with Ghost- and Dark-types such as Lunala, Yveltal, and Calyrex-S, so Tyranitar and bulky Yveltal make good partners to come in on their attacks and potentially threaten them. Lunala is a crucial teammate, taking care of various Substitute sweepers such as Zekrom and Zygarde-C, which otherwise use Giratina as setup fodder. Lunala is also the best check available to Groudon, a threat Giratina loses to with the slightest chip damage. Eternatus, Kyurem-W, and Blissey can take pressure off of Giratina by checking Kyogre. Moreover, Eternatus can act as a check to Marshadow and a valuable status and Toxic Spikes absorber, Kyurem-W provides bulky teams with a powerful wincon by virtue of Sheer Cold, and Blissey can use Aromatherapy to get rid of Giratina's sleep from using Rest. Quagsire is an excellent check to Zacian-C and Zygarde-C, as it can use Haze to get rid of boosts and tank boosted attacks because of Unaware. However, using Quagsire means forgoing Necrozma-DM, and thus forgoing a key component of checking Xerneas. If using Quagsire, Chansey is a nigh mandatory teammate to patch this up. Lastly, Ditto can be a great asset on any stall or bulky balance team, acting as a clutch revenge killer against a myriad of threats in Calyrex-S, Xerneas, Zacian-C, chipped Groudon, and Marshadow.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 426798, "username": "Geysers"}, {"user_id": 360582, "username": "Guard"}]}, {"name": "Grammar checked by", "members": [{"user_id": 302985, "username": "lotiasite"}, {"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 393488, "username": "Yami"}]}
  },
  "Excadrill": {
    "comments": "<h1>Other Options</h1> <p>Steel Beam can be used on the suicide lead set to maintain momentum and stop Defog users slower than it, but is difficult to fit.</p> <h1>Checks and Counters</h1> <p><strong>Ghost-types</strong>: Excadrill relies on its teammates to pressure troublesome Ghost-types such as Lunala, Calyrex-S, and Marshadow, as they can prevent Rapid Spin from being used. Giratina can completely shut down Excadrill by removing Stealth Rock with Defog, absorbing Toxic with Rest, crippling it with Will-O-Wisp, and tanking any hit from it with ease.</p> <p><strong>Entry Hazard Removal: Excadrill's ability to set Stealth Rock becomes completely diminished once Pokemon carrying Defog such as Ho-Oh and Yveltal can KO it off the field and attempt to remove it. However, offensive teammates such as Kyogre, Calyrex-S, and Yveltal can take advantage of the turn used for Defog and force them out or set up on them.</p> ",
    "sets": [
      {"name": "Swords Dance"},
      {
        "name": "Entry Hazard Lead",
        "description": "<p>Excadrill provides good utility to hyper offense teams in AG as a lead due to the potent combination of Stealth Rock and Rapid Spin. Stealth Rock deals residual damage to most foes attempting to switch in, and Rapid Spin prevents opposing entry hazard setters such as Necrozma-DM, Ferrothorn, Eternatus, and Tyranitar from keeping entry hazards up against Excadrill. Additionally, Rapid Spin is occasionally useful for gaining a Speed boost after being used, deterring naturally faster Pokemon such as Calyrex-S and Zacian-C from attempting to switch in. Rock Tomb is great for 2HKOing Ho-Oh, which is able to switch into Stealth Rock with Heavy-Duty Boots and remove it with Defog, while also lowering the foe's Speed so a teammate is able to outspeed it, preventing sweepers such as Geomancy Xerneas and Dragon Dance Zygarde-C from gaining Speed boosts on Excadrill. Wallbreakers such as Kyogre and Yveltal also appreciate being able to take advantage of slower Pokemon on the field. Earthquake can OHKO Zacian-C after a Defense drop from Close Combat or chip damage from Rapid Spin or Rock Tomb while preventing Substitute users like Zygarde-C and Zekrom from using Excadrill as complete setup fodder. Toxic punishes Yveltal, which can use Defog against Excadrill. Focus Sash allows Excadrill to withstand powerful attacks such as Kyogre's Water Spout and Marshadow's Close Combat and almost always guarantees it gets to set Stealth Rock.</p> <p>Excadrill should only be used on hyper offense, where Pokemon such as Xerneas, Zacian-C, Calyrex-S, Rayquaza, and Groudon appreciate its ability to both set and remove entry hazards. Excadrill generally struggles against Ghost-types such as Lunala, Giratina, and Calyrex-S as they are able to block Rapid Spin, so Yveltal is a great partner for it. Excadrill dislikes using Rapid Spin against Rocky Helmet Necrozma-DM, so Kyogre, Calyrex-S, Yveltal, and Groudon can pressure it extremely well. Excadrill should be led with in most matches so it can immediately set Stealth Rock, deter opposing entry hazards, and maximize its teammates' offensive potential.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 426798, "username": "Geysers"}, {"user_id": 367227, "username": "baconeatinassassin"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}]}], "writtenBy": [{"user_id": 491896, "username": "Rotten"}]}
  },
  "Darmanitan-Galar": {
    "comments": "<h1>Other Options</h1> <p>Galarian Darmanitan can also use a devastatingly strong Choice Band set, limiting its switch-ins to an extremely small handful of Pokemon, but the loss in Speed is very noticeable. Superpower is a decent coverage option to hit Ferrothorn hard without the recoil as well as giving the option of Max Knuckle, but the drops in Attack and Defense make it more committal and less consistent than other options.</p> <h1>Checks and Counters</h1> <p><strong>Kyogre: Defensive Kyogre resists both Icicle Crash and Flare Blitz while not taking much damage from any other coverage move. Repeated U-turns can easily chip it down, and healing damage with Rest leaves it vulnerable, but it is still one of the sturdiest walls to Galarian Darmanitan.</p> <p><strong>Necrozma-DM</strong>: While it doesn't appreciate Flare Blitz, Necrozma-DM can shrug off any other hit and even has a chance to live two Choice Scarf Flare Blitzes. It also accumulates chip damage by switching in with Rocky Helmet.</p> <p><strong>Chip Damage</strong>: Rocky Helmet on Necrozma-DM and Skarmory, Stealth Rock, other hazards, and Flare Blitz recoil can very easily wear down Galarian Darmanitan, especially because it can't stick around for long without switching.</p> <p><strong>Revenge Killers: Choice Scarf Calyrex-S as well as Geomancy-boosted Xerneas can outspeed and OHKO Galarian Darmanitan, while priority from Pokemon such as Marshadow and Yveltal exploit its low defensive stats to threaten it.</p> ",
    "sets": [
      {
        "name": "Choice Scarf",
        "description": "<p>Choice Scarf Galarian Darmanitan is a solidly fast and incredibly strong revenge killer in AG. Icicle Crash can take out neutral Pokemon such as Marshadow and Calyrex-S when chipped while also threatening Eternatus, Zygarde, and Yveltal. U-turn is an easy to spam pivoting option that lets Galarian Darmanitan chip down walls that resist its main coverage, like Kyogre and Necrozma-DM, while creating a more favorable position for its team. Flare Blitz OHKOes Zacian-C, a prime target, while also dealing solid damage to Ferrothorn, Necrozma-DM, and Skarmory. Rock Slide OHKOes defensive Ho-Oh, which can pivot into Galarian Darmanitan and scout what it's locked into otherwise. Earthquake nails Pokemon like Necrozma-DM, Zacian-C, and Eternatus in one move while also hitting Steel-types without the recoil drawback of Flare Blitz. A Jolly nature with maximum Speed and its Choice Scarf allow Galarian Darmanitan to outrun and revenge kill Pokemon such as Zacian-C, +1 Zekrom and Reshiram, and Calyrex-S.</p> <p>With Galarian Darmanitan's ability to bait in and pressure Necrozma-DM, force out Ground- and Dragon-types, and pivot with U-turn, it is an excellent offensive partner for Zacian-C. Similarly, Zacian-C helps Galarian Darmanitan by pressuring checks to it such as defensive Kyogre and Toxapex with Wild Charge. Zekrom also threatens defensive Water-types and can take advantage of U-turn switch-ins to set up a Dragon Dance. Since Galarian Darmanitan also lacks any kind of defensive utility, common walls such as specially defensive Yveltal, Eternatus, and Zygarde-C also help by switching into wallbreakers it can't OHKO. Specially defensive Yveltal can also safely bring in Galarian Darmanitan with U-turn and provide Defog support, mitigating its weakness to entry hazards. Defensive Necrozma-DM is able to switch into and threaten out Xerneas and Zacian-C, Pokemon that Galarian Darmanitan can't switch into and can only pressure when locked into the right move.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 491896, "username": "Rotten"}, {"user_id": 426798, "username": "Geysers"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 511624, "username": "Fc"}]}
  },
  "Gothitelle": {
    "comments": "<h1>Other Options</h1> <p>Confide can be used over Cosmic Power to bring in sweepers such as Xerneas, Groudon, and Zekrom more easily alongside Charm. Gothitelle can run Choice Scarf with Trick to cripple defensive Pokemon, potentially locking them into a status move or weak attack, which lets it set up Cosmic Power. Trick can also hamper Pokemon that normally are risky to trap such as Calm Mind Kyogre and defensive Yveltal, but it makes trapping Necrozma-DM and Eternatus more risky.</p> <h1>Checks and Counters</h1> <p><strong>Offensive Pokemon: Gothitelle can not deal with most offensive Pokemon like Calyrex-S, Marshadow, and Zacian. Staying in to sacrifice Gothitelle is also risky because foes can use it as setup fodder.</p> <p><strong>Phazing Moves: Dragon Tail, Roar, and Whirlwind all force Gothitelle out, thus allowing their users to switch out. Ho-Oh and Lugia almost always have Whirlwind, while Eternatus and Zygarde occasionally run Dragon Tail. Taunt does prevent Whirlwind and Roar; however, it can wear off during Rest turns. Gothitelle can successfully eliminate Ho-Oh and Lugia, after a PP stall. It can also carry Substitute for Dragon Tail Eternatus and Zygarde.</p> <p><strong>Shed Shell: Shed Shell prevents trapping, which makes Gothitelle effectively useless. However, Shed Shell comes at the cost of a more consistently useful item, making it an unpopular choice. Pokemon that sometimes run Shed Shell are Blissey, Eternatus, and Necrozma-DM.</p> ",
    "sets": [
      {
        "name": "Trapper",
        "description": "<p>Thanks to Shadow Tag, Gothitelle is capable of reliably trapping and eliminating many walls such as Necrozma-DM, Zygarde, Blissey, and Eternatus. Charm weakens physical attackers, and Cosmic Power bolsters it against special attackers while also giving insurance against physical attackers. Taunt helps Gothitelle PP stall, forcing the foe to eventually use Struggle. Rest is Gothitelle’s best form of longevity and removes status conditions; it also helps it to PP stall by not using up PP on Rest turns. The given EV spread allows Gothitelle to outspeed defensive Necrozma-DM while maximizing physical bulk. Alternatively, a spread of 244 HP / 60 Def / 204 Spe with a Bold nature sees use to more effectively trap defensive Ho-Oh, Zygarde-C, and Groudon. Special Defense investment is also an option to trap bulky Eternatus more easily at the cost of reducing its ability to trap Necrozma-DM and Ho-Oh. Substitute can be used over either Charm or Cosmic Power to block Dragon Tail from Pokemon like Eternatus and Zygarde-C and Leech Seed from Ferrothorn, but this sacrifices either its dependability against Necrozma-DM and Ho-Oh or the ability to trap defensive Eternatus that carries Dynamax Cannon.</p> <p>Gothitelle fits best on balance and occasionally stall teams, and teammates that appreciate it removing their defensive answers do great with it. Zacian-C in particular is an excellent partner, since most teams rely on Necrozma-DM or Quagsire to beat it, which Gothitelle can trap. Kyogre struggles with Eternatus and appreciates Gothitelle's ability to trap and remove it, along with Blissey. Chansey, and Ferrothorn. Stall teams appreciate it removing Ferrothorn, since Ferrothorn can beat most common Defoggers one-on-one, as well as certain Pressure and Regenerator users like Eternatus and Ho-Oh that can often PP stall them. Gothitelle is offensively threatened by a lot and provides little to no defensive utility against hyper offense teams, so it requires a revenge killer and a proper defensive backbone. Zacian-C is a massive threat to Gothitelle; counters to it such as Necrozma-DM and Quagsire are especially appreciated. Calyrex-S is another massive threat to Gothitelle, so defensive answers to it such as Yveltal and Tyranitar are needed. Good checks to other threats such as Marshadow, Yveltal, and Xerneas are Zacian-C, specially defensive Eternatus, Necrozma-DM, Choice Scarf Calyrex-S, Ditto, and Zacian, which are also effective at stopping many offensive threats like Groudon, Reshiram, and Zekrom from sweeping.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 491896, "username": "Rotten"}, {"user_id": 367227, "username": "bactoneatingassasin"}]}, {"name": "Grammar checked by", "members": [{"user_id": 512479, "username": "Finland"}]}], "writtenBy": [{"user_id": 437400, "username": "ArcticBreeze"}]}
  },
  "Galvantula": {"sets": [{"name": "Sticky Web Lead"}]},
  "Ferrothorn": {
    "comments": "<h1>Other Options</h1> <p>Thunder Wave is an option in the last slot on Ferrothorn, as it's able to spread paralysis on fast foes like Zacian-C, Eternatus, and Marshadow, enabling offensive teammates such as Choice Specs Kyogre and Life Orb Yveltal to excel even more against the opponent's team. However, dropping Protect, Knock Off, or Toxic can make Ferrothorn less reliable as a check to Xerneas or even more passive, respectively. Gyro Ball is another option in the last slot that has no accuracy drawback, allowing Ferrothorn to deal with Xerneas more reliably; it serves little to no use outside of that, however. Bullet Seed can be used over Power Whip to prevent Ferrothorn from being trapped by Gothitelle due to the move's high PP, although it's generally inferior to Power Whip due to the unreliability of it.</p> <h1>Checks and Counters</h1> <p><strong>Ho-Oh: Ho-Oh can consistently switch into Ferrothorn due to Regenerator, force it out with the threat of a powerful Sacred Fire, and remove its Spikes with Defog. However, Ho-Oh fears losing its Heavy-Duty Boots to a Knock Off, since it will become much easier to wear down if Stealth Rock is on the opponent's side of the field. Ho-Oh doesn't appreciate Toxic either; being badly poisoned takes away from its ability to come out on top against Stealth Rock Necrozma-DM.</p> <p><strong>Eternatus: A well-played Eternatus is the second largest obstacle for Ferrothorn. Not only does Eternatus force Ferrothorn out with Flamethrower or Mystical Fire, it's also capable of gradually PP stalling Ferrothorn out of Spikes and Leech Seed in more drawn-out games, not being bothered by anything Ferrothorn can dish out other than Knock Off.</p> <p><strong>Super Effective Coverage</strong>: Foes like Zacian-C, Palkia, and Marshadow easily force Ferrothorn out, as they often carry super effective coverage to break Ferrothorn.</p> <p><strong>Strong Wallbreakers: Ferrothorn's bulk is nothing to brag about in the context of the metagame. As a result, generally strong wallbreakers such as Calyrex-S and Groudon are more than capable of heavily damaging Ferrothorn or forcing it out.</p> <p><strong>Substitute Users: Ferrothorn's passivity makes it setup fodder against foes under a Substitute such as Zekrom, Reshiram, and Zygarde-C.</p> <p><strong>Gothitelle: Ferrothorn is unable to switch out against Gothitelle due to Shadow Tag, making it entirely susceptible to Taunt while being weakened by Charm. Gothitelle can also heal off Ferrothorn's weak attacks with Rest. However, Ferrothorn will still be able to greatly annoy Gothitelle in the process by removing Leftovers and chipping away at its health with Leech Seed. Moreover, Gothitelle is incapable of trapping Ferrothorn if the latter opts to run Bullet Seed.</p> ",
    "sets": [
      {"name": "Physically Defensive"},
      {
        "name": "Specially Defensive",
        "description": "<p>Ferrothorn is a good defensive presence in AG thanks to its respectable bulk, useful defensive typing, and access to Spikes, allowing it to act as a great check to Kyogre and Xerneas while being a valuable entry hazard setter. Leech Seed is Ferrothorn's most reliable form of recovery and a great tool of disruption against switch-ins such as Zacian-C. Power Whip deals immediate damage to Kyogre, notably forcing out bulky Calm Mind variants, and Xerneas. Protect is useful to scout for the foe's moves, gain Leftovers and Leech Seed recovery, and stall out Dynamax turns from the likes of Xerneas, Groudon, and Kyogre. Knock Off is an alternative to cripple foes like Ho-Oh, Yveltal, and Eternatus. Toxic is another good option, crippling all of the metagame's Defoggers in Yveltal, Ho-Oh, and Lunala. A specially defensive spread with a Careful nature is required in order for Ferrothorn to check Kyogre and Xerneas reliably. Ferrothorn should preserve its health with Leech Seed so it can stay healthy throughout the game while whittling down foes.</p> <p>Ferrothorn fits on all sorts of balance and bulky offense teams that appreciate having a check to Kyogre and Xerneas as well as Spikes support. Teammates like Zygarde-C, Zekrom, and Kyogre are notable for pressuring Ho-Oh, which is a huge threat to Ferrothorn. Ferrothorn significantly struggles against threats like Marshadow, Dragon Dance Zygarde-C and Zekrom, Groudon, Zacian-C, Eternatus, and Calyrex-S due to their super effective or powerful moves against it and their tendency to use Ferrothorn as setup bait. Therefore, good partners that can check these threats such as Zacian-C, Lunala, Necrozma-DM, Calyrex-S, and Yveltal are useful. Zygarde-C really appreciates Spikes support from Ferrothorn, as it synergizes fantastically with its Dragon Tail, while Ferrothorn is able to check Xerneas and disrupt Lunala for Zygarde-C. Groudon pairs excellently with Ferrothorn; Groudon is able to force out Ho-Oh and set up with Swords Dance while forcing it out, and it heavily benefits from Ferrothorn's Spikes chipping its checks and Ferrothorn's ability to check Kyogre. The likes of Zacian-C, Xerneas, Kyogre, and Marshadow are some other good teammates, benefitting hugely from Spikes wearing down their main checks in Necrozma-DM and Eternatus. Ferrothorn struggles to reliably check Choice Specs Kyogre, so a secondary Kyogre check like Eternatus is appreciated.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 426798, "username": "Geysers"}, {"user_id": 360582, "username": "Guard"}]}, {"name": "Grammar checked by", "members": [{"user_id": 302985, "username": "lotiasite"}]}], "writtenBy": [{"user_id": 491896, "username": "Rotten"}]}
  },
  "Reshiram": {
    "comments": "<h1>Other Options</h1> <p>Heavy-Duty Boots can be used to prevent Reshiram from being worn down from entry hazards, especially Stealth Rock. However, Reshiram generally prefers Life Orb to 2HKO Necrozma-DM and OHKO Groudon and Xerneas after a Dragon Dance. Substitute can be run over Roost with Leftovers to prevent Ditto from copying Reshiram's boosts from Dragon Dance; however, without Roost to keep itself healthy, such a set will find itself whittled down very quickly.</p> <h1>Checks and Counters</h1> <p><strong>Ditto: Ditto can revenge kill Reshiram, as it can copy its Dragon Dance boosts and OHKO it with Outrage. It can also use Dynamax to reverse sweep once it is no longer locked into Outrage.</p> <p><strong>Fairy-types</strong>: Both Zacian-C and Xerneas will take out Reshiram if it has locked itself into Outrage.</p> <p><strong>Faster Pokemon: Faster Pokemon such as Marshadow, Palkia, Calyrex-S, and Choice Scarf Kyogre can make an unboosted Reshiram switch out, by threatening heavy damage or an OHKO.</p> <p><strong>Entry Hazards: Entry hazards, especially Stealth Rock, can hinder Reshiram from repeatedly coming in and make it easy to take care of.</p> <p><strong>Toxic</strong>: Lunala, and if Reshiram lacks Stone Edge, Ho-Oh, can put Reshiram on a timer with Toxic, as they all can tank a boosted attack from it and then cripple it for the rest of the game.</p> ",
    "sets": [
      {
        "name": "Dragon Dance",
        "description": "<p>Reshiram is a dangerous Dragon Dance sweeper due to its strong offensive typing, good Attack, and decent Speed, which together allow it to threaten most of the metagame. However, Reshiram can often struggle to sweep due to its awkward STAB moves in Flare Blitz and Outrage coupled with its Stealth Rock weakness, which allow it to be easily chipped. Dragon Dance can be used against Pokemon it forces out such as Ferrothorn, Blissey, and Necrozma-DM. Flare Blitz and Outrage offer nearly unresisted coverage, with Flare Blitz scaring out staples such as Necrozma-DM, Ferrothorn, and Zacian-C, and Outrage taking care of the likes of Zygarde-C, Eternatus, Kyogre, and Ho-Oh. Both moves heavily benefit from Dynamax removing their drawbacks, especially Outrage. On top of that, Max Flare summons sun, powering Reshiram up considerably, and Max Wyrmwind dropping the foe's Attack allows Reshiram to come out on top against Groudon. Roost offsets damage inflicted by entry hazards, Life Orb, and Flare Blitz recoil. Stone Edge may be run on faster-paced teams, allowing Reshiram to OHKO Ho-Oh without needing to lock itself into Outrage or Dynamax. A Jolly nature is preferred to outpace Zacian-C after one Dragon Dance.</p> <p>Reshiram fits well on hyper offense or bulky offense teams. Shuckle can provide Stealth Rock and Sticky Web, which lets Reshiram outpace Pokemon like Zacian-C, Calyrex-S, and Eternatus without a Dragon Dance, allowing it to force them out and potentially get setup turns. If not running Reshiram on hyper offense, it needs Defog support from Yveltal or Ho-Oh, as entry hazards will greatly hinder it from coming in repeatedly. Calyrex-S is great to heavily pressure Lunala, which can put Reshiram's sweep on a timer with Toxic. Xerneas is also a great partner, as it can take care of Pokemon that can be troublesome for unboosted Reshiram, like Palkia and Zekrom, and can serve as a check for Ditto, since Ditto copying Reshiram needs to either Dynamax and risk the Speed tie or become setup fodder for Xerneas by locking itself into Outrage. Xerneas also appreciates Reshiram's ability to pressure Steel-types like Ferrothorn, Zacian-C, and Necrozma-DM. Zacian-C is a good partner for Reshiram, as it can take care of faster Dragon-types such as Palkia and other faster attackers like Marshadow. It can also check Ditto like Xerneas can and take care of Ho-Oh If Reshiram is lacking Stone Edge. Marshadow is also great with Reshiram due to its Ghost-typing allowing it to threaten Lunala and Calyrex-S. Rayquaza can take care of Marshadow and Calyrex-S under Sticky Web and Ho-Oh and Zacian-C after a Dragon Dance. Reshiram also loves Ferrothorn on bulkier teams because it provides Reshiram a Kyogre check, some recovery with Leech Seed, and Spikes to facilitate a sweep. Necrozma-DM is great for checking Zacian-C, as unboosted Reshiram has problems with it. Lunala can help Reshiram by checking defensive Zygarde-C and other setup sweepers, like Zekrom and Groudon, that can take care of a unboosted Reshiram.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 360582, "username": "Guard"}, {"user_id": 426798, "username": "Geysers"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 393488, "username": "Yami"}]}
  },
  "Zekrom": {
    "comments": "<h1>Other Options</h1> <p>Life Orb can be used over Leftovers to increase damage output, notably allowing Zekrom to OHKO Xerneas and defensive Zygarde-C after a Dragon Dance. However, it synergizes terribly with Substitute. Roost is an option over Substitute to help take Life Orb recoil better or keep Zekrom healthy; however, this leads to Zekrom getting statused by Ho-Oh and Toxic Necrozma-DM and Ditto copying Zekrom's boosts.</p> <h1>Checks and Counters</h1> <p><strong>Lunala: Bulky Lunala is one of the very few Pokemon capable of tanking Zekrom's boosted hits, as Teravolt cannot bypass Shadow Shield. Lunala can both cripple Zekrom with Will-O-Wisp and damage it with Ice Beam. However, it must play cautiously around Dynamax, since Roost is outdamaged by a Max Lightning backed up by a Dragon Dance boost and Electric Terrain, preventing it from regaining Shadow Shield.</p> <p><strong>Groudon</strong>: Bulky Groudon can easily come in on a boosted Zekrom, tank the attack, and OHKO it with Precipice Blades. However, it cannot stand up to a Zekrom under Dynamax without Dynamaxing itself, especially as its Attack will be lowered by Max Wyrmwind.</p> <p><strong>Revenge Killers</strong>: Fast Pokemon such as Sand Rush Excadrill, Choice Scarf Calyrex-S, Ditto, and Sucker Punch Yveltal can revenge kill Zekrom. However, Zekrom can use Substitute to bypass any revenge killing attempts.</p> ",
    "sets": [
      {
        "name": "Dragon Dance",
        "description": "<p>Due to its great Attack, sufficient Speed, Dragon Dance, and potent STAB moves, Zekrom is one of the most fearsome setup sweepers in AG, lacking solid counterplay outside of bulky Lunala. Dragon Dance allows Zekrom to outspeed and OHKO common revenge killers such as Zacian-C, Eternatus, and Calyrex-S. Bolt Strike is its main attack, capable of OHKOing Ho-Oh, Yveltal, and Kyogre and 2HKOing Dragon-immune Pokemon such as Xerneas and Zacian-C unboosted. Bolt Strike becomes Max Lightning under Dynamax, summoning Electric Terrain, which notably allows Zekrom to break through even Lunala. Dragon Claw hits targets that Bolt Strike fails to, such as Giratina, Zygarde-C, and Groudon; while under Dynamax, it reduces Groudon and Zygarde-C's Attack to prevent them from defeating Zekrom. Alternatively, Outrage is a handy option on hyper offense to greatly limit Ditto when coupled with a Fairy-type teammate. Ditto will be forced to lock itself into Outrage if it wants to revenge kill Zekrom, which said Fairy-types can deter by either hard-switching into Ditto or taking it out after it has revenge killed Zekrom. Substitute is used to stop Ditto from copying Zekrom's boosts, scout switches from Pokemon Zekrom forces out, use defensive Pokemon like Ferrothorn, Ho-Oh, and Necrozma-DM as setup bait, and avoid status from foes such as Lunala and Giratina. Leftovers is used to give Zekrom passive recovery and more chances to use Substitute. A Jolly nature with maximum Speed EVs is used to outpace Pokemon such as Modest Xerneas, Yveltal, and Kyogre.</p> <p>Zekrom best fits on hyper offense and bulky offense. It appreciates Shuckle providing it with Sticky Web support that allows it to outpace Zacian-C, Eternatus, and Calyrex-S as well as Stealth Rock support to KO Xerneas after one Dragon Dance. Additionally, Zekrom appreciates partners such as Kyogre and Yveltal that can take care of Ground-types like Zygarde-C and Groudon. Yveltal, as well as Calyrex-S, can also massively threaten Zekrom's best check in Lunala. On bulkier teams, Lunala can also help with Zygarde-C and Groudon. Moreover, Lunala fully Imposter-proofs Zekrom against Ditto. Specially defensive Yveltal is an important partner for Zekrom, as it can come in on Calyrex-S for it and use Defog to get rid of entry hazards. Necrozma-DM can come in on Fairy-type attacks from Zacian-C and Xerneas while also providing Thunder Wave support to slow the opposing team down. Zacian-C can help Zekrom whittle down their shared checks in Groudon, Lunala, and Zygarde-C while also luring in Necrozma-DM, enabling Zekrom to easily set up. Both Zacian-C and Xerneas can also hard switch into Ditto looking to lock itself into Dragon Claw or Outrage.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 464176, "username": "Icemaster"}, {"user_id": 360582, "username": "Guard"}]}, {"name": "Grammar checked by", "members": [{"user_id": 302985, "username": "lotiasite"}]}], "writtenBy": [{"user_id": 393488, "username": "Yami"}]}
  },
  "Landorus-Therian": {
    "sets": [
      {"name": "Stealth Rock Lead"},
      {"name": "Physically Defensive"},
      {
        "name": "Swords Dance",
        "description": "<p>Landorus-T is a solid Dynamax user in AG. With its good Attack, Speed, and Intimidate, it poses a huge threat to almost every Pokemon in the metagame while using physical attackers such as Necrozma-DM, Zekrom, and Groudon as setup bait. Swords Dance further boosts its good Attack, allowing many OHKOs on bulky walls such as Zygarde-C, Giratina, and Calm Mind Kyogre. Under Dynamax, Earthquake turns into a powerful Max Quake, which also gives it a Special Defense boost. Fly turns into Max Airstream, which allows Landorus-T to outspeed many key Pokemon such as Zacian-C, Calyrex-S, and Choice Scarf Kyogre. It also doesn't allow Ditto to revenge kill Landorus-T unless it Dynamaxes and then wins a Speed tie. Stone Edge allows it to deal heavy damage to Flying-types such as Ho-Oh and Yveltal. Additionally, turning into Max Rockfall lets it summon sand, breaking Lunala's Shadow Shield. Life Orb allows Landorus-T to OHKO Pokemon such as bulky Eternatus without any boosts. Maximum Speed investment with a Jolly nature ensures that it outspeeds many Pokemon after a Max Airstream boost such as Calyrex-S, Choice Scarf Kyogre, and Jolly Zacian-C.</p> <p>Landorus-T best fits as a Dynamax sweeper on hyper offense and balance teams. Due to its mediocre bulk, Landorus-T is unable to take hits very well, meaning that it needs significant team support. Pokemon such as Ferrothorn and Eternatus help it by checking its common answer in Kyogre, and the former can set Spikes and possibly lure in Defoggers such as Ho-Oh and Yveltal, which are severely damaged by its Stone Edge. Teammates such as Xerneas and Yveltal pressure defensive Zygarde-C and Lunala, respectively, which can check Landorus-T. In return, Landorus-T threatens Necrozma-DM, Ferrothorn, and even Zacian-C, which are common checks for Xerneas. On hyper offense, Shuckle's Sticky Web and Stealth Rock can allow Landorus-T to comfortably set up and outspeed fast foes like Zacian-C, Choice Scarf Kyogre, and offensive Eternatus without relying on Max Airstream.</p> <h1>Other Options</h1> <p>Lum Berry can be used to get rid of status from the likes of Giratina, defensive Zygarde-C, and Toxic Necrozma-DM, which can possibly stop Landorus-T from sweeping. An Adamant nature allows Landorus-T to deal more damage, but it is then unable to outspeed Pokemon such as Timid Calyrex-S, Jolly Zacian-C, and Choice Scarf Kyogre at +1 Speed, allowing them to revenge kill it reliably.</p> <h1>Checks and Counters</h1> <p><strong>Physically Defensive Walls: Physically defensive walls such as Zygarde-C and Lunala are often able to take hits from Landorus-T and cripple it in return. Zygarde-C is able to remove boosts using Haze and paralyze it with Glare, while Lunala can burn it with Will-O-Wisp and also force it out using Ice Beam.</p> <p><strong>Revenge Killers</strong>: Revenge killers such as Ditto, Calyrex-S, and Sucker Punch Yveltal are a huge threat to Landorus-T, as it can be rapidly worn due to its Life Orb, lack of recovery, and mediocre bulk. Zacian-C and Calyrex-S outspeed it unboosted and can OHKO it with their STAB moves. Kyurem-W is able to take hits from unboosted Landorus-T and OHKO it with its super effective Ice-type moves.</p> <p><strong>Kyogre: Kyogre is able to OHKO Landorus-T without any problem with Ice Beam or any special STAB move. Choice Scarf Kyogre can outspeed Landorus-T without any boosts and OHKO it. However, all variants of Kyogre can be OHKOed by a +2 Life Orb-boosted Max Quake from Landorus-T, somewhat reducing its effectiveness as a check.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 491896, "username": "Rotten"}, {"user_id": 426798, "username": "Geysers"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 532881, "username": "Frozoid"}]}
  },
  "Kyurem-Black": {
    "comments": "<h1>Other Options</h1> <p>A Substitute set with Leftovers may be run, as this helps Kyurem-B stall out opposing Dynamax and helps it set up against more passive Pokemon, such as Toxapex and Ferrothorn lacking Gyro Ball and Body Press. Substitute also provides an additional perk in blocking Ditto's Imposter after Kyurem-B has set up.</p> <h1>Checks and Counters</h1> <p><strong>Necrozma-DM: If Kyurem-B doesn’t have access to Dynamax, it has a difficult time breaking through defensive Necrozma-DM, even with Shadow Claw. Necrozma-DM can also win one-on-one against a Dynamaxed Kyurem-B by Dynamaxing itself, 2HKOing it with Max Steelspike while gaining Defense boosts.</p> <p><strong>Zacian-C</strong>: As Zacian-C resists Kyurem-B’s Icicle Spear, isn’t weak to any other options, and is respectably bulky, it can switch into unboosted Kyurem-B and OHKO it with Behemoth Blade. However, Zacian-C takes a ton from a boosted Fusion Bolt and +1 Max Lightning has a chance to OHKO offensive sets.</p> <p><strong>Physically Defensive Ferrothorn</strong>: Ferrothorn can annoy non-Substitute Kyurem-B with Leech Seed and wall it using Iron Defense; after using the latter, it can threaten an OHKO with Body Press. However, if Kyurem-B has access to Dynamax, Ferrothorn will have difficulty safely switching in and setting up.</p> <p><strong>Ditto</strong>: After Dynamax ends, boosted Kyurem-B is vulnerable to getting OHKOed by the opposing Ditto’s Max Hailstorm or a lucky Icicle Spear, unless it’s running a rare Substitute set. As Kyurem-B has trouble staying near full HP with Life Orb as it KOes a target, Ditto will often be able to reliably revenge kill. However, if Kyurem-B has access to Dynamax, Ditto likely loses one-on-one thanks to Kyurem-B's higher HP. If Kyurem-B is unboosted and both Pokemon Dynamax, it will win one-on-one if it wins the second Speed tie; if only Kyurem-B Dynamaxes, it will beat Ditto unless it is severely chipped.</p> <p><strong>Revenge Killers</strong>: Choice Scarf Zacian can outspeed and OHKO Kyurem-B after it has used Dragon Dance once; Choice Scarf Calyrex-S can outspeed it at +2. If Kyurem-B is unboosted, faster Pokemon that hit it super effectively, such as Marshadow, Zacian-C, and Xerneas, will threaten it.</p> <p><strong>Residual Damage: Entry hazards, particularly Stealth Rock, and Life Orb recoil can wear Kyurem-B down, unless it runs Heavy-Duty Boots.</p> ",
    "sets": [
      {
        "name": "Dragon Dance",
        "description": "<p>With an impressive Attack stat, amazing BoltBeam coverage, and Water and Electric resistances, Kyurem-B has a niche as a Dragon Dance user able to somewhat reliably check Kyogre and be a Sheer Cold absorber. Icicle Spear is its main attacking move, hitting most Dragon-types, Ground-types, and Yveltal super effectively, as well as hitting neutral Pokemon for heavy damage. It can also break Focus Sash, which helps against suicide leads such as Slurpuff and Excadrill. Fusion Bolt OHKOes non-bulky Kyogre unboosted, threatens an OHKO against Ho-Oh, and is the best option against Zacian-C. Shadow Claw is specifically to hit Lunala on Life Orb sets, and OHKOes it if Kyurem-B Dynamaxes at +1 or if Lunala is slightly chipped; Life Orb Max Phantasm also 2HKOes Necrozma-DM. Roost is an option on Heavy-Duty Boots sets, as Kyurem-B can heal when it forces a switch. A Jolly nature is used to outspeed non-Choice Scarf Calyrex-S after one Dragon Dance. Life Orb increases its already stellar offensive power, giving it a 50% chance of OHKOing uninvested Zacian-C with Max Lightning; alternatively, Heavy-Duty Boots can be used to switch into Stealth Rock at the cost of not OHKOing Kyogre.</p> <p>Kyurem-B is best used on balance teams that appreciate its ability to pressure Yveltal lacking Foul Play and Kyogre, although a secondary check to the latter is needed, as Kyurem-B is easily whittled down. Its typing makes it vulnerable to Steel-types and faster Dragon-types, so it’s best not to fight the likes of Necrozma-DM and Eternatus one-on-one without having used Dragon Dance. Groudon is a useful partner to pressure these Pokemon with Precipice Blades. Gothitelle is an excellent partner as well, as it can trap defensive Necrozma-DM and Ferrothorn and remove them before Kyurem-B tries sweeping. Kyurem-B lacking Shadow Claw may find it difficult to take on a healthy Lunala without a lucky Icicle Spear, as it can get burnt with Will-O-Wisp; Yveltal, Calyrex-S, and Marshadow can help it in this case. After boosting, if the opponent can still Dynamax, Ditto is a threat, as it can OHKO Kyurem-B with Max Hailstorm; Necrozma-DM, Zacian-C, and physically defensive Ferrothorn can be used to Imposter-proof it. Zacian-C in particular doubles as an offensive powerhouse that can pressure Necrozma-DM alongside Kyurem-B, each helping the other to make progress against the opposing team. A weakened Kyurem-B can also be revenge killed by faster Pokemon, such as Choice Scarf Zacian and Choice Scarf Calyrex-S, if it isn’t at +3 Speed or above. Teammates like Necrozma-DM and Yveltal, respectively, are valuable as a result, as they can switch into and wall these threats. As Life Orb Kyurem-B is vulnerable to Stealth Rock, Defoggers like Ho-Oh and Yveltal are vital partners.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 511624, "username": "Fc"}, {"user_id": 491896, "username": "Rotten"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 515077, "username": "Mbouchon"}]}
  },
  "Kyurem-White": {
    "comments": "<h1>Other Options</h1> <p>Stone Edge is an option to weaken Ho-Oh, 2HKOing it. However, it can be difficult to justify using over a generally more useful move. An offensive set with Life Orb or Choice Specs can be considered for its good damage output, but this forgoes Kyurem-W's utility as a Kyogre check.</p> <h1>Checks and Counters</h1> <p><strong>Powerful Attackers: Kyurem-W lacks the necessary bulk to hold its own against the likes of Eternatus, Zacian-C, Calyrex-S, and Marshadow, which reliably force it out. None of them can switch in without risking a Sheer Cold hit, and Eternatus and Marshadow are heavily chipped by Freeze-Dry, while Zacian-C takes considerable damage from Fusion Flare.</p> <p><strong>Kyurem-W: Kyurem-W is one of its own best checks thanks to its immunity to Sheer Cold and lack of weaknesses to Kyurem-W’s common attacks, outside of Draco Meteor. While opposing Kyurem-W struggle to damage Kyurem-W significantly in return, they waste Sheer Cold PP every time they switch in.</p> <p><strong>Lapras</strong>: Lapras counters Kyurem-W reliably, switching into any of its attacks freely and forcing it out with the threat of Horn Drill.  Lapras can take advantage of this free turn to apply considerable pressure to Kyurem-W's team, so it must be played around with extreme caution.</p> ",
    "sets": [
      {
        "name": "Sheer Cold",
        "description": "<p>Kyurem-W is a solid Kyogre check in AG thanks to its Sheer Cold immunity, solid Speed tier, passable bulk, reliable recovery, and strong movepool. Kyurem-W is able to generate many chances to use Sheer Cold, as it forces Kyogre out, threatens defensive switch-ins with Sheer Cold elimination, and heavily damages offensive checks with its other coverage. Freeze-Dry can punish Kyogre for staying in while also threatening specially defensive Yveltal and Zygarde-C. Fusion Flare punishes Necrozma-DM and other Steel-types like Ferrothorn and Zacian-C for switching in more reliably than Sheer Cold can. Draco Meteor is also an option to punish opposing Kyurem-W for trying to block Sheer Cold, while also hitting Eternatus much harder than Freeze-Dry. Roost provides Kyurem-W with an invaluable source of recovery, letting it heal Kyogre’s hits and potentially PP stall Water Spout while also mitigating Stealth Rock damage. Heavy-Duty Boots is the preferred option to mitigate Stealth Rock damage and improve the matchup against opposing Sticky Web teams, but Utility Umbrella can be opted for in order to handle Choice Specs Kyogre better. The given EVs with a Timid nature let Kyurem-W outspeed Kyogre, Groudon, bulky Yveltal, and Zygarde while also avoiding a 2HKO from Choice Scarf Kyogre’s Water Spout.</p> <p>As a reliable Kyogre check and respectable wallbreaker, Kyurem-W fits best on balance and bulky offense teams. Mandatory alongside Kyurem-W are balance staples like Necrozma-DM and specially defensive Yveltal to check the otherwise threatening Zacian-C and Xerneas for the former and Calyrex-S for the latter. In addition, reliable Eternatus checks like Tyranitar and Calyrex-S work well alongside Kyurem-W. Reliable Defog support from the likes of Yveltal and Ho-Oh is also crucial to allow Kyurem-W to come in on Kyogre without taking Stealth Rock damage, drastically increasing its longevity. Zacian-C and Xerneas are teammates that appreciate Kyurem-W’s ability to potentially eliminate switch-ins with Sheer Cold, notably including Necrozma-DM.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 491896, "username": "Rotten"}, {"user_id": 464176, "username": "Icemaster"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}, {"user_id": 331519, "username": "CryoGyro"}]}], "writtenBy": [{"user_id": 426798, "username": "Geysers"}]}
  },
  "Slurpuff": {
    "comments": "<h1>Other Options</h1> <p>Slurpuff has no viable other options.</p> <h1>Checks and Counters</h1> <p><strong>Excadrill</strong>: Thanks to Excadrill's unique combination of Rapid Spin and Stealth Rock, it will always be able to deny Slurpuff from getting Sticky Web up while potentially setting Stealth Rock against it.</p> <p><strong>Priority</strong>: Pokemon like Marshadow and Sucker Punch Yveltal can block Slurpuff from gaining momentum through Misty Explosion by picking it off with priority moves after it sets Sticky Web, reducing its advantages over other Sticky Web leads such as Shuckle or and Galvantula.</p> <p><strong>Multi-hit Moves: Multi-hit moves, most notably from Pheromosa and physical Yveltal, can bypass Slurpuff's Focus Sash and potentially OHKO it while denying Sticky Web. Slurpuff is totally unable to handle them, so a different lead is recommended if the opponent has a Pheromosa or a suspected physical Yveltal.</p> <p><strong>Defoggers: While not threatening Slurpuff specifically, Defoggers like Ho-Oh and Yveltal pose significant long-term threats to Slurpuff teams thanks to their ability to remove Sticky Web. The only reliable way to mitigate their threat is through teammates that can block Defog, such as Landorus-T and Yveltal.</p> ",
    "sets": [
      {
        "name": "Sticky Web Lead",
        "description": "<p>Slurpuff is an extremely reliable Sticky Web lead in AG and a solid enabler for hyper offense thanks to its unique movepool and powerful ability in Unburden. Magic Coat allows it to force 50/50s against opposing leads that might threaten Taunt, such as Yveltal and Grimmsnarl, while also deterring Stealth Rock setters and leads like Necrozma-DM and Landorus-T. Misty Explosion is extremely useful, enabling Slurpuff to block Defog or Rapid Spin attempts from slower Pokemon like Yveltal and Excadrill after its Focus Sash has been activated, as well as potentially bringing a teammate in safely. Yawn prevents Pokemon like Necrozma-DM and Calyrex-S from setting up freely on Slurpuff, and it can give teammates free setup turns if a foe KOes Slurpuff while drowsy. Endeavor can also be used to deter setup attempts and generally cripple opposing leads, working together with Focus Sash and Unburden to allow Slurpuff to threaten Pokemon like Necrozma-DM and Xerneas, which could otherwise cleanly 2HKO it. Focus Sash is vital to set Sticky Web against faster Pokemon while also synergizing nicely with Unburden to let Slurpuff outspeed the entire unboosted metagame, allowing for a Yawn or Endeavor before it's KOed. The given EVs and IVs with a Naive nature minimize Slurpuff's bulk to help it activate Focus Sash, notably ensuring that Life Orb Yveltal's Oblivion Wing does so.</p> <p>Slurpuff fits only on hyper offense teams where its Sticky Web support can enable threatening wallbreakers and sweepers. Teammates that work especially well alongside Slurpuff include Choice Specs Kyogre and Dragon Dance Necrozma-DM, which greatly appreciate outspeeding Eternatus and outspeeding Calyrex-S after a boost, respectively. Calyrex-S can also be a solid teammate thanks to its ability to block Rapid Spin from Excadrill. Since Slurpuff can't set Stealth Rock outside of using Magic Coat, a secondary lead like Landorus-T often works great alongside it, with Landorus-T additionally being able to block entry hazard removal through Explosion, gaining considerable momentum. Teammates that can use Taunt to block opposing Defog attempts later in the game are also tremendously useful, with Yveltal being the best example. Similarly, it's important to have teammates that can reliably pressure Defoggers, such as Zekrom, Xerneas, and Zacian-C, all of which can threaten Yveltal and Ho-Oh. Slurpuff should almost always be used as the lead, unless the opponent has a counter like Excadrill or a multi-hit attacker like Pheromosa.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 511624, "username": "Fc"}, {"user_id": 491896, "username": "Rotten"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 426798, "username": "Geysers"}]}
  },
  "Xerneas": {
    "comments": "<h1>Other Options</h1> <p>Offensive Xerneas is an extremely linear Pokemon with limited moveset options. Focus Blast can be used over Substitute in order to beat Ferrothorn, but it ensures that Xerneas will lose to Necrozma-DM. Additionally, an EV spread of 4 Def / 252 SpA / 252 Spe can be used to outspeed the rare Choice Scarf Marshadow, but this comes at a substantial cost to Xerneas' bulk.</p> <h1>Checks and Counters</h1> <p><strong>Necrozma-DM: Necrozma-DM is a somewhat reliable check to Xerneas, but it must expend its own Dynamax in order to stop Xerneas. However, if Necrozma-DM Dynamaxes too early, Xerneas can use Substitute twice followed by Max Guard to stall out its Dynamax and break through it.</p> <p><strong>Zacian-C</strong>: Bulky Zacian-C is by far the most reliable check to a boosted Xerneas, tanking Max Lightning quite easily and proceeding to take Xerneas out with Behemoth Blade. However, it must be cautious before deciding to switch in, since Xerneas can easily elect to chip it down with Moonblast or Thunder prior to actually setting up.</p> <p><strong>Ferrothorn</strong>: Ferrothorn checks Xerneas reliably unless Xerneas has Focus Blast, since Power Whip can break Xerneas’s Substitutes, and Ferrothorn resists both of Xerneas’s attacks.</p> <p><strong>Ho-Oh</strong>: Ho-Oh, especially specially defensive variants, can quite easily outlast Xerneas's Dynamax with its own Dynamax with the sequence of Max Guard, Max Flare, and Max Guard. However, it comes down to a 50-50 after this; Ho-Oh either gets taken out by Thunder, which has a 50% chance to hit due to Max Flare setting Sun, or Xerneas gets taken out by a sun-boosted Sacred Fire.</p> ",
    "sets": [
      {
        "name": "Geomancy Sweeper",
        "description": "<p>Xerneas is one of the most threatening setup sweepers in AG thanks to Geomancy boosting its Special Attack and Speed to absurd levels in a single turn, strong firepower backed by a boosting ability, and extreme potency under Dynamax. Moonblast is a highly spammable STAB move, capable of blasting through almost the entire defensive metagame barring Steel-types and Ho-Oh after Geomancy. Thunder is the only coverage move Xerneas needs, OHKOing Ho-Oh from full under Dynamax, removing Zacian-C after some chip damage, and heavily damaging Necrozma-DM with a chance to 2HKO even if Necrozma-DM has Dynamaxed. Additionally, Thunder allows Xerneas to fish for paralysis on Necrozma-DM, Zacian-C, and Ho-Oh on the switch. Substitute allows Xerneas to scout, potentially waste the opponent's Dynamax if they Dynamax Necrozma-DM too early in reaction to Xerneas' Dynamax, and potentially use non-Power Whip Ferrothorn as setup fodder. Power Herb is vital to allow Xerneas to set up in a single turn, while the given EV spread allows Xerneas to outspeed Slurpuff without boosts and create 101-HP Substitutes.</p> <p>Xerneas fits best on balanced, bulky offensive, and hyper offensive teams that can pressure its extremely limited number of checks. Zacian-C is an especially good teammate, since it threatens Necrozma-DM, Ferrothorn, and Ho-Oh heavily with Assurance, Close Combat, and Wild Charge, respectively. Gothitelle can also pair very well with Xerneas, since it can trap and remove both Necrozma-DM and Ferrothorn, clearing the way for Xerneas to sweep. Choice Specs Kyogre can set rain, which impedes Necrozma-DM's healing abilities, while also heavily threatening Ho-Oh and luring in and cleanly 2HKOing Ferrothorn. Both Zacian-C and Kyogre, as well as the likes of Calyrex-S and Dragon Dance Zekrom, are capable of forcing the opponent's Dynamax, thereby removing Xerneas's best form of counterplay in a Dynamaxed Necrozma-DM. Defensive Necrozma-DM is a mandatory partner in order to check and weaken Zacian-C, as Xerneas fails to OHKO the latter with Max Lightning.</p> "
      },
      {"name": "Defensive"}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 464176, "username": "Icemaster"}, {"user_id": 360582, "username": "Guard"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 426798, "username": "Geysers"}]}
  },
  "Yveltal": {
    "comments": "<h1>Other Options</h1> <p>On specially defensive Yveltal, Snarl is an option to counter SubSeed Calyrex-S and check some specially offensive Pokemon such as Eternatus and Life Orb Yveltal. However, Yveltal has to sacrifice its second or third moveslot for it, and Snarl doesn't alleviate its poor matchup against Calm Mind Kyogre. Sucker Punch can be used on a three attacks set with U-turn in order to potentially KO boosted Calyrex-S, which would otherwise overwhelm Yveltal with Max Starfall, as well as pick off or weaken foes like Marshadow and Dragon Dance Necrozma-DM. However, it can be scouted with Substitute Calyrex-S and is easily exploitable once the opponent is aware of it. Toxic can cripple opposing specially defensive Yveltal and Ho-Oh better but is not recommended due to it possibly making Yveltal too passive. Knock Off is an option in the last moveslot of Life Orb Yveltal to severely damage Blissey and remove Heavy-Duty Boots from Ho-Oh, making it a much less consistent check to Yveltal. However, Dynamax Sucker Punch can already pressure Blissey, while Max Darkness overwhelms Ho-Oh. Rock Slide can be used to OHKO Ho-Oh as Max Rockfall; however, Yveltal's other coverage options are generally more useful and Rock Slide weakens Ditto matchups.</p> <h1>Checks and Counters</h1> <p><strong>Specially Defensive Walls: Tyranitar is an outstanding check to Yveltal due to its sand-boosted bulk and resistance to Dark and Flying. It can force Yveltal out using Rock Tomb, Stone Edge, or Thunder Wave. However, Tyranitar relies on Rest in order to recover, which Yveltal's team can take advantage of. Specially defensive Eternatus can avoid being 2HKOed by Dark Pulse, proceeding to wear it down with Dynamax Cannon while PP stalling it with Pressure and Recover. Eternatus must be wary if Yveltal is Dynamaxed, though, as Max Darkness can easily weaken it or force it out. Ho-Oh is a great way to deal with offensive Yveltal, as it can tank its Dark Pulse, cripple it with Sacred Fire or Toxic, and eliminate any chip damage with Regenerator. Additionally, Protect Ho-Oh is a very useful way to stall out Yveltal's Dynamax turns. However, it must be careful of Yveltal's Max Darkness forcing it out. Specially defensive Yveltal can stall out Yveltal's Dynamax, remove its Life Orb with Knock Off, or disrupt it using Snarl, but is quite passive and can be shut down by Taunt as a result.</p> <p><strong>Fairy-types: Xerneas can also capitalize on specially defensive Yveltal's passivity with Geomancy and pose a large sweeping threat. Xerneas should be careful switching into its Knock Off, though, as it will risk losing Power Herb. Zacian-C poses a fearsome threat to Yveltal, as it resists Dark Pulse and Oblivion Wing, OHKOing it regardless of Dynamax with Behemoth Blade. However, Zacian-C can easily drop to Heat Wave Yveltal. Even in cases where Yveltal lacks Heat Wave, Zacian-C will need some bulk investment to manually switch into Max Airstream. Choice Scarf Zacian can outspeed Yveltal even after a few Max Airstream boosts and threaten it with Play Rough; however, Zacian is easily overwhelmed by Max Airstream, while Play Rough fails to OHKO a healthy Dynamaxed Yveltal.</p> <p><strong>Ditto: Ditto is a useful revenge killer against Yveltal, as it can deal large amounts of damage and, if it has Dynamaxed, easily 2HKO Yveltal by using Max Airstream. However, a healthy Dynamaxed Yveltal can easily beat Ditto by withstanding Oblivion Wing or Max Airstream and retaliating with its more powerful Max Airstream.</p> <p><strong>Physically Offensive Pokemon</strong>: Physically offensive Pokemon such as Zacian-C, Groudon, setup Zygarde-C, and Zekrom force Yveltal out and can potentially use non-Foul Play variants as setup fodder.</p> <p><strong>Knock Off: Yveltal has to watch out for Knock Off from opposing Yveltal, Necrozma-DM, and Ferrothorn, as it becomes a lot easier to wear down with Stealth Rock , which is amplified by it very often being the only Defogger on teams. Losing Heavy-Duty Boots also makes it significantly more susceptible to Calyrex-S and entry hazard stacking cores.</p> <p><strong>Status: Walls such as Ho-Oh, Eternatus, Zygarde-C, and Toxic Ferrothorn can pressure Yveltal with the status moves they carry. Ho-Oh in particular can still cripple Taunt Yveltal with Sacred Fire, while Ferrothorn can stack up entry hazards, compelling Yveltal to come in more often and get worn down more quickly. However, both must be wary of getting their items removed by Knock Off.</p> <p><strong>Special Wallbreakers</strong>: Pokemon such as Kyogre and Eternatus can heavily damage Yveltal and force it to switch out. Choice Specs Kyogre and Meteor Beam Eternatus have the potential to greatly harm or OHKO Yveltal, while bulky Calm Mind Kyogre can set up on it and Life Orb Eternatus can force it to repeatedly use Roost while fishing for poison with Sludge Bomb.</p> ",
    "sets": [
      {
        "name": "Specially Defensive",
        "description": "<p>Specially defensive Yveltal is one of the most useful Pokemon in the metagame due to it checking Calyrex-S, one of the biggest threats in the tier, like no other. Foul Play deals heavy damage to physically offensive Pokemon such as Zacian-C, Marshadow, and Groudon, while Knock Off cripples Ho-Oh, Yveltal, Ferrothorn, and Eternatus. U-turn allows Yveltal to maintain momentum, providing opportunities for teammates to come in safely. Taunt can be used to prevent recovery, status, setup, and entry hazards from other defensive Pokemon like Yveltal, Ferrothorn, Zygarde-C, and Necrozma-DM – it works particularly well alongside a faster spread. Knock Off and Foul Play can also be used together to threaten physical sweepers while still being able to make progress against Eternatus and Yveltal. Heavy-Duty Boots prevents Yveltal from getting worn down by Stealth Rock. 72 Defense EVs ensure that Yveltal always survives Poltergeist into Close Combat from Adamant Life Orb Marshadow. The remaining EVs are put into HP and Special Defense with a Careful nature to ensure that Yveltal can take attacks from Life Orb Calyrex-S and specially offensive Yveltal as well as possible. Maximum Special Defense investment is an option as well if Marshadow is not a concern. A fast spread of 248 HP / 8 Def / 60 SpD / 192 Spe along with a Jolly Nature allows Yveltal to switch into Life Orb Groudon and Landorus-T as they use Swords Dance and use Foul Play before they can attack, threatening to OHKO them unless they Dynamax.</p> <p>Yveltal best fits on balance teams, and its defensive presence is appreciated by Pokemon vulnerable to Calyrex-S such as Necrozma-DM and Eternatus. Necrozma-DM, in return, checks Zacian-C and Xerneas, which are common threats to Yveltal, while Eternatus is able to check Kyogre and relieve some pressure on checking special Yveltal. Blissey is able to check threats to Yveltal such as Kyogre, Meteor Beam Eternatus, and Xerneas. Ferrothorn also limits Kyogre and Xerneas, while Yveltal can support Ferrothorn's entry hazards by removing Heavy-Duty Boots with Knock Off and preventing Defog if carrying Taunt. Physically defensive walls such as Lunala and Zygarde-C can check physically offensive Pokemon such as Groudon and Zekrom, which pose a huge threat to non-Foul Play Yveltal. Ho-Oh can be useful to pressure opposing Ferrothorn and Yveltal, pivot into Zacian-C, and absorb status, and it has the option to use a more offensive set with Yveltal fulfilling the Defogger role. Wallbreakers such as Calyrex-S, Zacian-C, Choice Specs Kyogre, and Marshadow take advantage of Yveltal's U-turn. Calyrex-S in particular appreciates Yveltal Imposter-proofing its team and pressuring opposing Yveltal with Knock Off or Taunt. In return, Calyrex-S forces out Zacian-C and Eternatus, can use Aromatherapy, and checks many boosted threats with its Choice Scarf set. A revenge killer like Ditto or the aforementioned Choice Scarf Calyrex-S are useful teammates, preventing Calyrex-S from completely sweeping the team if Yveltal is removed from a match.</p> "
      },
      {
        "name": "Special Life Orb",
        "description": "<p>Specially offensive Yveltal is one of the dominant offensive threats in AG due to its solid Special Attack stat, great STAB move combination boosted by Dynamax, Dark Aura, Life Orb, and coverage options letting it break through just about any of its checks. Its typing also allows it to soft check Calyrex-S, which can otherwise tear apart teams easily. Dark Pulse can be difficult to withstand due to Dark Aura, while Max Darkness overwhelms walls such as Eternatus and Ho-Oh by lowering their Special Defense. Oblivion Wing turns into Max Airstream, letting Yveltal outspeed much of the metagame while hitting foes that resist Dark Pulse such as Xerneas and offensive Yveltal for massive damage. Oblivion Wing also gives Yveltal a useful source of recovery, which lets it outlast Calyrex-S and offset Stealth Rock damage. Sucker Punch is used to play mind games with Calyrex-S, KO weakened threats like Marshadow and Groudon, and wreck Blissey as physical Max Darkness. Taunt shuts down specially defensive Yveltal, Blissey, and entry hazard leads such as Shuckle. In addition, it's useful on hyper offense teams to prevent Defog from the likes of Ho-Oh and specially defensive Yveltal, and it can provide safe setup opportunities for teammates by stopping status moves. Roost is an alternative to keep Yveltal consistently healthy in the face of Life Orb and Stealth Rock damage, preventing it from being in KO range of Calyrex-S. Heat Wave is another viable option to KO Zacian-C as Max Flare or after summoning sun with it. Life Orb enhances Dynamax Yveltal's power to unbearable levels, while a Mild nature bolsters its STAB moves without compromising any power on Sucker Punch against Calyrex-S; Sticky Webs teams will need to use Taunt and a Hasty nature in order to prevent Defog from opposing Yveltal. A 188 SpA / 68 SpD / 252 Spe EV spread should be run with Roost in order to avoid a 2HKO from Choice Specs Calyrex-S's Astral Barrage. Heavy-Duty Boots is another option for balance teams that aim to use Yveltal as a Baton Pass recipient.</p> <p>Specially offensive Yveltal fits best on hyper offense and bulky offense teams as a threatening Dynamax sweeper and soft check to Calyrex-S, which is otherwise extremely difficult to handle. Yveltal is most notably checked by bulky Eternatus, Ho-Oh, specially defensive Yveltal, and Tyranitar. Teammates that can limit these threats such as Calyrex-S, Kyogre, Zacian-C, and Groudon, respectively, are beneficial. In return, Yveltal can shut down most of their checks such as bulky Yveltal, bulky Eternatus, Necrozma-DM, and Lunala, respectively. Calyrex-S is notable for its potential to pass Nasty Plot boosts to Yveltal, helping it break through checks such as specially defensive Eternatus and Ho-Oh. Necrozma-DM is a useful partner to deal with Xerneas and Zacian-C, which is a good answer to Yveltal if it isn't running Heat Wave. Yveltal is crippled by Stealth Rock, so teammates that can get rid of it such as Ho-Oh on bulky offense teams, which is integral due to this set replacing bulky Yveltal, and Excadrill and Regieleki on hyper offense teams are appreciated. Ho-Oh is an especially important partner on bulky offense teams as a second line of defense against Calyrex-S. Shuckle provides Sticky Web support, which lets Yveltal outspeed threats like Zacian-C, Marshadow, Calyrex-S, and Groudon without relying on Max Airstream. Yveltal can struggle against Ditto once it has Dynamaxed, so countermeasures to it such as Regieleki, Ho-Oh, and Zacian-C if Yveltal decides to forego Heat Wave are required.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 360582, "username": "Guard"}, {"user_id": 367227, "username": "baconeatinassassin"}, {"user_id": 491896, "username": "Rotten"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}, {"user_id": 331519, "username": "CryoGyro"}]}], "writtenBy": [{"user_id": 491896, "username": "Rotten"}, {"user_id": 532881, "username": "Frozoid"}]}
  },
  "Zygarde": {
    "comments": "<h1>Other Options</h1> <p>Toxic is usable in the defensive set's last moveslot in order to cripple Zygarde-C's checks like Lunala and the uncommon Lugia and Shedinja. Substitute can be used over Rest on the defensive set with Glare in order to set up on some passive targets and serve as a win condition, but this sacrifices utility against a few Pokemon Zygarde-C otherwise checks, such as Ho-Oh. The Dragon Dance set can run Rest instead of Substitute in order to remove status, but it is not recommended due to it leaving Zygarde-C vulnerable. However, running Rest with Thousand Waves over Dragon Tail or Toxic lets Zygarde-C lure Pokemon such as Necrozma-DM and Ferrothorn into a false sense of security after revealing the lack of Substitute. After trapping these targets, Zygarde-C can proceed to boost up all the way to +6 and clean up. However, this strategy is not very reliable on the whole. Outrage or Stone Edge instead of Dragon Tail or Toxic makes Dragon Dance Zygarde-C more directly threatening, but both options are inferior in more drawn-out games, which Zygarde-C thrives in, and locking into Outrage makes it more vulnerable to Xerneas and Zacian-C.</p> <h1>Checks and Counters</h1> <p><strong>Super Effective Coverage: Pokemon that carry super effective moves against Zygarde-C such as Xerneas, Play Rough Zacian-C, Kyogre, and Ice Punch Marshadow all threaten it. Dragon-types like Eternatus, Zekrom, and Kyurem-W can also revenge kill Zygarde-C with their threatening STAB moves. Eternatus can particularly threaten Zygarde-C by ignoring the effects of Dynamax with Dynamax Cannon. However, they must be careful of Dragon Tail or Max Wyrmwind dealing heavy damage to them. Dragon Dance Zygarde-C can also outspeed and threaten them after a few Dragon Dance boosts.</p> <p><strong>Physically Defensive Walls: Physically defensive walls such as Lunala and bulky Kyogre can pose as huge threats to Zygarde-C. Lunala can nail it with Ice Beam and force it to use Rest with Will-O-Wisp or Toxic, while Calm Mind Kyogre can set up on it and wear it down with Scald. However, Toxic wears down Lunala and forces bulky Kyogre to use Rest. Defensive Zygarde-C is very threatening to Dragon Dance Zygarde-C, as it can use Haze to remove its stat boosts and Rest to regain health.</p> <p><strong>Special Wallbreakers</strong>: While Zygarde-C's bulk is impressive, its special bulk its noticeably lower than its physical bulk; this leaves it vulnerable to generally powerful special wallbreakers like Calyrex-S and Life Orb Yveltal, which can wear it down or outright KO it with their STAB moves, especially before Power Construct activates.</p> ",
    "sets": [
      {"name": "Life Orb + Dragon Dance"},
      {
        "name": "Defensive",
        "description": "<p>Defensive Zygarde-C is one of AG's premier physically defensive walls due to its decent typing, great utility moves, and gigantic bulk letting it check a ton of offensive and defensive Pokemon such as Groudon, Marshadow lacking Ice Punch, Necrozma-DM, Zacian-C lacking Play Rough, and Ho-Oh. Thousand Arrows ignores Ground immunities from Pokemon like Ho-Oh and Yveltal, offering nearly unresisted coverage. Rest is Zygarde-C's only recovery move and circumvents Toxic and Will-O-Wisp from the likes of Lunala, Ho-Oh, Giratina, and Necrozma-DM, allowing it to serve as a reliable status absorber. Coil turns Zygarde-C into a threatening bulky sweeper, letting it take advantage of defensive Pokemon like Ferrothorn, Ho-Oh, and Necrozma-DM and go toe to toe with offensive Pokemon like Groudon, Dragon Dance Necrozma-DM, and Swords Dance Zacian-C. Alternatively, Haze can be run over Coil to remove boosts from threatening setup sweepers like offensive Groudon, Dragon Dance Zygarde-C, Swords Dance Zacian-C, and Bulk Up Marshadow, although it makes Zygarde-C almost entirely passive. Glare provides amazing support, paralyzing faster foes like Calyrex-S, Xerneas, and Marshadow for Zygarde-C and its teammates. Dragon Tail is also an option over Glare to phaze bulky walls that can handle Zygarde-C like Lunala and Gothitelle, which is otherwise able to trap and PP stall it, and counteract Ho-Oh's Whirlwind. It also becomes Max Wyrmwind under Dynamax, letting Zygarde-C check Groudon better. Scale Shot is a noteworthy mention, as it enables Zygarde-C to outspeed foes like bulky Eternatus, offensive Yveltal, and unboosted Zekrom, making it an even more threatening bulky sweeper paired with Coil. Thousand Waves alongside Scale Shot gives Zygarde-C plenty of room to boost up to nigh-invincible levels after trapping a passive foe such as Ferrothorn or Necrozma-DM. However, Glare and Dragon Tail are generally more useful because they offer better utility to teams, and the Defense drop from Scale Shot disrupts Coil's Defense increases, making it useless without Thousand Waves. 56 Speed EVs let Zygarde-C outspeed some Gothitelle spreads, paralyzed Zacian-C, and paralyzed Calyrex-S, while the remaining EVs and the Impish nature make Zygarde-C more effective against physical attackers such as Groudon, Zacian-C, and Marshadow. If forgoing Glare, Zygarde-C can run an alternative spread of 252 HP / 252 Def / 4 SpD.</p> <p>Zygarde-C fits best on balance teams, since it can check threats like Groudon, Necrozma-DM, and Ho-Oh while providing invaluable support with Glare. However, it can be exploited by a bunch of top-tier threats in AG such as Xerneas, Eternatus, Calyrex-S, and Kyogre. Teammates that check these threats such as Necrozma-DM, Calyrex-S, Yveltal, and Eternatus or Kyurem-W, respectively, are thus useful. Necrozma-DM can also deal with Play Rough Zacian-C, which is particularly threatening to Zygarde-C, while also providing Stealth Rock support, which Zygarde-C can take advantage of using Dragon Tail. Partners that can deal with Lunala like Yveltal, Marshadow, and Calyrex-S are also appreciated. Ferrothorn synergizes fantastically with Zygarde-C, as it provides Spikes support, which lets Zygarde-C chip down grounded foes using Dragon Tail, while also checking Xerneas and Kyogre for it. In return, Zygarde-C checks Pokemon that threaten Ferrothorn like Ho-Oh, Groudon, and Marshadow lacking Ice Punch. Offensive teammates like Zacian-C and Marshadow benefit a lot from Zygarde-C's Glare support, as it enables them to outspeed fast foes like Calyrex-S and Zacian-C, respectively. Despite Zygarde-C checking Groudon and Marshadow, Zygarde can be OHKOed by Precipice Blades after a Swords Dance boost before Power Construct activates, and Marshadow can carry Ice Punch to beat Zygarde-C. As a result, revenge killers or secondary checks to them like Ditto, Xerneas, and Eternatus are useful.</p> "
      },
      {
        "name": "Dragon Dance",
        "description": "<p>Dragon Dance Zygarde-C is a threatening setup sweeper, wincon, and Dynamax user in AG because it uses passive Pokemon like Necrozma-DM, Ferrothorn, and Ho-Oh as setup bait, giving it a good matchup against defensive teams. Substitute protects Zygarde-C against moves such as Toxic, Knock Off, Leech Seed, and Sacred Fire from Necrozma-DM, Ferrothorn, and Ho-Oh while giving it safe opportunities to set Dragon Dance up to take on faster foes. Thousand Arrows heavily damages prominent Pokemon such as Zacian-C, Eternatus, and Necrozma-DM after a boost while hitting the vast majority of the metagame for at least neutral damage. Dragon Tail allows Zygarde-C to get rid of threats such as Ho-Oh and Lugia before they phaze it with Whirlwind. Alternatively, Toxic may be used to severely cripple both Lunala and Lugia and defeat the niche Shedinja. Under Dynamax, Thousand Arrows turns into Max Quake, which boosts Zygarde-C's Special Defense, allowing it to tank even super effective attacks such as Ice Beam from Lunala and Moonblast from Xerneas. Dragon Tail turns into Max Wyrmwind under Dynamax, allowing Zygarde-C to hit Flying- and Dragon-types such as Yveltal and opposing Zygarde-C without negative priority. 16 HP EVs increase Zygarde-C's Leftovers recovery, and, with an Impish nature and 36 Defense EVs, prevent moves such as Ferrothorn's Power Whip, defensive Necrozma-DM's Sunsteel Strike, and Ho-Oh's Brave Bird from breaking its Substitute in its Complete forme. 232 EVs invested in Speed allow Zygarde-C to outspeed everything up to Adamant Zacian-C and Eternatus at +1 Speed. The remaining EVs are allocated into Attack in order to maximize firepower. An alternative 16 HP / 100 Atk / 148 Def / 244 Spe EV spread with a Jolly nature may be run instead in order to outspeed Calyrex-S at +1 without losing bulk. It comes at the cost of some power, however.</p> <p>Zygarde-C best fits on balance teams. A way to pressure Lunala and Lugia is crucial if Zygarde-C forgoes Toxic, as both can easily check it for a long period of time. The likes of Tyranitar, Calyrex-S, Ho-Oh, and Yveltal can work well in this regard, but the latter three must be wary of either Moongeist Beam or Meteor Beam from Power Herb Lunala. Ferrothorn and bulky Eternatus can check Zygarde-C's next largest roadblock in Kyogre, which threatens Zygarde-C with Ice Beam, while setting up Spikes and Toxic Spikes, respectively, making Dragon Tail more threatening for the opponent. Teammates such as Zacian-C and Necrozma-DM can check another common threat to Zygarde-C in Xerneas. Necrozma-DM can check Play Rough Zacian-C, which can OHKO an unboosted Zygarde-C. Fairy-types such as Xerneas and Zacian-C can pressure Haze Zygarde-C variants, which may trouble Dragon Dance Zygarde-C by preventing it from setting up. On top of that, Zygarde-C hugely benefits from Xerneas and Zacian-C's ability to lure in Necrozma-DM and Ho-Oh, which creates setup opportunities for Zygarde-C.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 360582, "username": "Guard"}, {"user_id": 426798, "username": "Geysers"}, {"user_id": 491896, "username": "Rotten"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 491896, "username": "Rotten"}, {"user_id": 532881, "username": "Frozoid"}]}
  },
  "Lycanroc": {"sets": [{"name": "Lead"}]},
  "Toxapex": {
    "comments": "<h1>Other Options</h1> <p>Black Sludge can be used to increase Toxapex's longevity further, and Sitrus Berry lets it counter Poltergeist from Marshadow, but Rocky Helmet and Shed Shell are usually better.</p> <h1>Checks and Counters</h1> <p><strong>Strong Special Attackers: Choice Specs Kyogre, Calyrex-S, Kyurem-W, and most other special wallbreakers can force out Toxapex, although they need to be careful of Toxic or Knock Off if switching in.</p> <p><strong>Ground- and Electric-types: Groudon, Zygarde-C, and Zekrom can pressure Toxapex with their incredibly strong and super effective STAB moves, and Rest variants of the former two don't even fear burns from Scald too much.</p> <p><strong>Ditto: Combined with other pivots, Ditto can PP stall Toxapex incredibly effectively, as it refreshes its PP every time it switches into Toxapex. Regenerator lets it heal off any damage dealt, and taking Knock Off lets it stall even longer with the ability to switch moves, using Recover and trying for Scald burns of its own.</p> <p><strong>Gothitelle</strong>: Gothitelle can eliminate Rocky Helmet variants of Toxapex and threatens even ones with Shed Shell, as Toxapex commonly has to switch into Knock Off from Yveltal or Necrozma-DM, leaving it vulnerable.</p> ",
    "sets": [
      {
        "name": "Defensive Pivot",
        "description": "<p>Toxapex has a niche in the AG metagame as a defensive pivot, with Regenerator giving it incredible longevity to soft check and pivot around many offensive threats. Knock Off and its ability to spread status make it a nuisance to a lot of Pokemon, chipping down teams slowly and taking advantage of passive Pokemon that can't damage it heavily like Thunder Wave Necrozma-DM, defensive Eternatus, and Ho-Oh. It can check all of Marshadow, defensive Yveltal, and Calm Mind Kyogre, and it can chip Zacian-C heavily with Rocky Helmet and Wild Charge recoil if it tries taking Toxapex down. Scald is required to make Toxapex less passive, threatening burns on Pokemon that otherwise set up freely such as Zacian-C and Necrozma-DM. Even with it, though, Haze is mandatory to prevent setup sweepers such as Bulk Up Marshadow and Calm Mind Kyogre from turning Toxapex into a liability for a team. Knock Off provides item displacement and a strong way to hit Calyrex-S trying to set up on Toxapex, which is very valuable to reduce passivity and make that matchup less detrimental. Toxic and Toxic Spikes chip down the opposing team more quickly than Scald, but the heavy presence of Eternatus make these options rarely reach their full potential. Rocky Helmet can wear down Pokemon like Zacian-C, Urshifu-S, and U-turn pivots in Pheromosa and Galarian Darmanitan, while Shed Shell prevents Toxapex from being trapped by Gothitelle, otherwise being essentially a guaranteed KO for it.</p> <p>Necrozma-DM appreciates Toxapex scouting for Assurance on Zacian-C and chipping it more with Rocky Helmet. Toxapex can also remove Heavy-Duty Boots from Ho-Oh and Yveltal, the most common Defog users, making them easier to wear down. Toxapex also checks Marshadow and most Dark-types, which threaten Necrozma-DM, unless they Dynamax. Offensive wallbreakers like Kyogre and Yveltal checked by Eternatus enjoy Toxapex pressuring it with Knock Off and Scald burns. Yveltal also helps by being immune to Ground and switching into Calyrex-S, covering for two of Toxapex's greatest weaknesses. Lunala is a good wall for Zekrom, Groudon, and Zygarde, which can all threaten Toxapex with strong super effective STAB moves, and Toxapex in return can pivot into Marshadow, Urshifu-S, and Yveltal, which pressure Lunala. Blissey is the sturdiest special sponge in the metagame, walling special attackers that can muscle past Toxapex like Life Orb Eternatus, Geomancy-boosted Xerneas, and Choice Specs Kyogre. Ho-Oh and Toxapex can form a Regenerator core that shuts down most defensive teams with infinite passive healing and spreading status.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 464176, "username": "Icemaster"}, {"user_id": 367227, "username": "baconeatinassassin"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 511624, "username": "Fc"}]}
  },
  "Solgaleo": {"sets": [{"name": "Defensive"}]},
  "Lunala": {"sets": [{"name": "Defensive"}, {"name": "Meteor Beam"}]},
  "Pheromosa": {"sets": [{"name": "Offensive Pivot"}]},
  "Necrozma-Dusk-Mane": {
    "comments": "<h1>Other Options</h1> <p>Leftovers is an alternative item on defensive Necrozma-DM; however, it's hard to justify using over the generally better Rocky Helmet and Heavy-Duty Boots. Utility Umbrella is a helpful item to stop Kyogre's rain from making Morning Sun less effective. Shed Shell can specifically be used for Gothitelle, which traps Necrozma-DM and PP stalls it with Charm, Taunt, and Rest. Toxic is also a solid option on defensive Necrozma-DM's third moveslot to cripple common switch-ins to it like Ho-Oh, Yveltal, and Dragon Dance Zygarde-C. Running Toxic does, however, make the matchup against Swords Dance Zacian-C particularly tricky to handle. Knock Off is an option over Stone Edge on the Dragon Dance set to severely damage Lunala; however, losing the ability to OHKO Ho-Oh can be suboptimal.</p> <h1>Checks and Counters</h1> <p><strong>Super Effective Attackers: Powerful wallbreakers that carry super effective STAB moves such as Calyrex-S, Yveltal, Marshadow, and Groudon are to able to greatly pressure Necrozma-DM by forcing it out and getting a chance to set up, which can be threatening for Necrozma-DM's team to deal with. However, due to Necrozma-DM's humongous natural bulk, it is capable of beating them all with a surprise Dynamax.</p> <p><strong>Ho-Oh: Ho-Oh is among the most consistent answers to Necrozma-DM, pressuring it with a powerful Sacred Fire, removing its Stealth Rock using Defog, and nullifying any chip damage by switching out due to Regenerator. However, Ho-Oh doesn't appreciate taking a Knock Off from Necrozma-DM, since the removal of its Heavy-Duty Boots will significantly limit its ability to switch in and remove Stealth Rock. It also has to be wary of Dragon Dance Necrozma-DM KOing it with Stone Edge.</p> <p><strong>Weather</strong>: Since weather conditions like rain and hail from Kyogre and Max Moves will weaken the effect of Morning Sun, Necrozma-DM has a difficult time consistently checking Zacian-C and Xerneas when they are present.</p> <p><strong>Gothitelle: Gothitelle is able to pose a huge threat to Necrozma-DM by trapping it due to Shadow Tag and PP stalling it until it KOes itself with Struggle, but running Shed Shell invalidates Gothitelle as a trapper.</p> <p><strong>Physically Defensive Walls</strong>: Physically defensive walls such as Giratina, Zygarde-C, and Lunala are bulky enough to discourage Necrozma-DM from setting up if it's running Dragon Dance. Giratina can burn Necrozma-DM with Will-O-Wisp, Zygarde-C can clear away its Dragon Dance boosts with Haze and wear it down with Thousand Arrows, and Lunala can buffer itself against even Sunsteel Strike with Shadow Shield and burn Necrozma-DM with Will-O-Wisp.</p> ",
    "sets": [
      {
        "name": "Defensive",
        "description": "<p>Necrozma-DM is one of the most useful defensive Pokemon in AG due to its overall good bulk coupled with Prism Armor, wide support movepool, and typing making it the most reliable check to two dangerous threats in Zacian-C and Xerneas, which makes it mandatory on almost any team. Dragon Dance can be used if a team already has a Stealth Rock setter, allowing Necrozma-DM to potentially set up on foes like Zacian-C and opposing Necrozma-DM before devastating and outspeeding foes like defensive Eternatus and Marshadow after a couple of boosts. Sunsteel Strike gives Necrozma-DM the means to KO Xerneas while chipping down Zacian-C. However, if opting for Thunder Wave, Necrozma-DM should run Iron Head in order to paraflinch foes like Yveltal and Eternatus while having more PP. Earthquake consistently deals good damage to Zekrom, opposing Necrozma-DM, and Zacian-C while 2HKOing offensive Eternatus. Earthquake is particularly good alongside Dragon Dance as well, as few resist both it and Sunsteel Strike, and it turns Necrozma-DM into an obnoxiously sturdy Dynamax user between Max Steelspike boosting Defense and Max Quake boosting Special Defense. Thunder Wave is an option over Earthquake to cripple fast foes like Zacian-C, Calyrex-S, and Eternatus, but it makes Necrozma-DM setup fodder against Groudon due to its immunity to Thunder Wave. Alternatively, Knock Off cripples switch-ins to Necrozma-DM such as Groudon, Ho-Oh, Yveltal, and Eternatus for its teammates. Morning Sun is essential in order to keep Necrozma-DM healthy and check the likes of Zacian-C and Xerneas without being heavily chipped. However, use Morning Sun with caution, as it has very low PP. Rocky Helmet deals residual damage to foes like Zacian-C and Zekrom. Heavy-Duty Boots is an option over Rocky Helmet to reliably switch into Zacian-C's Assurance if Stealth Rock or Spikes is on the field. Weakness Policy pairs well with Dragon Dance, as Necrozma-DM can tank super effective hits like Ho-Oh's Sacred Fire, Eternatus's Mystical Fire, and Marshadow's Shadow Sneak due to its good bulk and Prism Armor while getting a +2 Attack boost. Maximum Defense investment with an Impish nature ensures Zacian-C's Close Combat won't 2HKO Necrozma-DM at full health. An alternative spread of 252 HP / 224 Def / 32 Spe enables Necrozma-DM to outspeed Adamant Zacian-C if it's paralyzed or if Necrozma-DM has used Dragon Dance twice.</p> <p>Necrozma-DM is a staple on all balance and bulky offense teams due to its ability to check Zacian-C and Xerneas while having fantastic utility moves like Stealth Rock, Knock Off, and Thunder Wave. Unfortunately, Necrozma-DM is easily forced out and set up on by many other top-tier wallbreakers in AG such as Calyrex-S, Life Orb Yveltal, Marshadow, and Groudon. Therefore, partners that can check these threats such as Yveltal, Eternatus, Zacian-C, and Lunala, respectively, are useful. Teammates that are especially weak to Zacian-C and Xerneas like Yveltal, Zygarde-C, and Eternatus appreciate Necrozma-DM checking the two. Ferrothorn is able to act as a secondary check to Xerneas, which is useful because Xerneas can 2HKO Necrozma-DM with Thunder at +2 and force it to Dynamax, and Ferrothorn also deals with Kyogre while providing Spikes support. Defoggers like Yveltal and Ho-Oh serve a unique purpose for Necrozma-DM, as they stop Stealth Rock and Spikes from strengthening Zacian-C's Assurance on the switch. Revenge killers like Ditto and Choice Scarf Calyrex-S are useful partners, dealing with Zacian-C if it has potentially KOed Necrozma-DM.</p> "
      },
      {
        "name": "Dragon Dance",
        "description": "<p>Dragon Dance Necrozma-DM is a respectable wallbreaker thanks to its good bulk coupled with Prism Armor giving it many opportunities to set up, amazing coverage, and a typing letting it soft check the likes of Zacian-C and Xerneas. Earthquake covers Eternatus, Ferrothorn, and opposing Necrozma-DM, while Stone Edge is able to hit Ho-Oh, an otherwise excellent check to it. Life Orb increases Necrozma-DM's damage output, notably OHKOing defensive Eternatus after a Dragon Dance boost. Alternatively, Weakness Policy synergizes amazingly well with Necrozma-DM's good bulk and Prism Armor, letting it tank super effective moves from foes like Zygarde-C and Eternatus while getting a significant Attack boost. An Adamant nature ensures that Necrozma-DM hits harder against important bulky foes such as Eternatus, defensive Necrozma-DM, and Ferrothorn. The Speed EVs allow Necrozma-DM to outspeed Adamant Marshadow after a Dragon Dance boost.</p> <p>Dragon Dance Necrozma-DM is a great fit on hyper offense teams, as it can not only take advantage of certain walls like defensive Eternatus, Ferrothorn, Ho-Oh, and opposing Necrozma-DM but also check Zacian-C and Xerneas, which are particularly huge threats to offensive teams. Necrozma-DM appreciates Sticky Web support from Shuckle, which allows it to outspeed more key threats like Calyrex-S, Zacian-C, and Choice Scarf Kyogre at +1. Other setup sweepers and wallbreakers like Nasty Plot Calyrex-S, Life Orb Yveltal, and Choice Specs Kyogre can force the opponent to expend their Dynamax, allowing Necrozma-DM to beat Ditto by Dynamaxing, tanking a boosted Earthquake, and KOing it back with a boosted Max Quake. The aforementioned setup sweepers and wallbreakers are also able to weaken physically defensive walls that Necrozma-DM can struggle to get through such as Zygarde-C, Giratina, and Lunala. Ditto is quite hard to fit with Necrozma-DM but can revenge kill setup sweepers that take advantage of it like Calyrex-S, Groudon, and Reshiram, potentially reverse sweeping the opposing team.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 360582, "username": "Guard"}, {"user_id": 426798, "username": "Geysers"}]}, {"name": "Grammar checked by", "members": [{"user_id": 302985, "username": "lotiasite"}, {"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 491896, "username": "Rotten"}]}
  },
  "Marshadow": {
    "comments": "<h1>Other Options</h1> <p>A Choice Scarf set can revenge kill almost the entire metagame, checking boosted sweepers such as Dragon Dance Zygarde, Zekrom, and Groudon, but is very weak and relies on its surprise factor.</p> <h1>Checks and Counters</h1> <p><strong>Zygarde: Zygarde walls Marshadow lacking Ice Punch, using its gigantic bulk to shrug off Marshadow's attacks with ease and either crippling it with Glare or boosting with Coil if Marshadow lacks Spectral Thief.</p> <p><strong>Faster Pokemon</strong>: Pokemon such as Life Orb Eternatus, Choice Scarf users, and Zacian-C all can manage to comfortably outspeed Marshadow and KO it, but they must be wary of Shadow Sneak if they are weakened. Calyrex-S can revenge kill Choice Band Marshadow locked into a move other than Shadow Sneak.</p> <p><strong>Flying-types: Although they must be wary of Marshadow's coverage, Ho-Oh and Yveltal can pivot in and scout Marshadow's item and moves somewhat safely.</p> <p><strong>Fairy-types: Xerneas can threaten to KO Marshadow if healthy. It can comfortably set up on Choice Band Marshadow locked into a move that isn't Ghost-type and threaten to sweep.</p> ",
    "sets": [
      {
        "name": "Life Orb",
        "description": "<p>Marshadow's respectable ability in Technician, good Speed tier, and great movepool allow it to threaten the majority of the metagame, including Necrozma-DM, Ho-Oh, and specially defensive Yveltal. Powerful STAB moves in Poltergeist and Close Combat give Marshadow neutral coverage against the entire metagame. Shadow Sneak revenge kills various faster Pokemon and boosted threats that have been weakened such as Calyrex-S, Swords Dance Rayquaza, and even Zacian-C. Ice Punch is used to heavily damage Zygarde-C, which can otherwise comfortably switch into Marshadow. Alternatively, Bulk Up transforms Marshadow into a formidable sweeper; Bulk Up Marshadow significantly damages walls such as Ho-Oh and specially defensive Eternatus and sets up on forced switches or certain walls, such as Necrozma-DM. Spectral Thief allows Marshadow to check certain setup Pokemon such as Calm Mind Kyogre and Coil Zygarde while also targeting foes behind Substitutes. It can also be used over Poltergeist at the cost of power; it should be noted that opting for Spectral Thief allows the team to use Knock Off more freely. Rock Tomb can also be used to OHKO Ho-Oh and lowers the foe's Speed.</p> <p>This set is able to fit on a variety of teams, since it does not fear being locked into a move. Zacian-C and Xerneas pair well with each other and appreciate a teammate like Marshadow that can defeat Necrozma-DM. This set is worn down very quickly, so bringing it in carefully, especially with slow pivoting or double switches, is vital. Hazard support such as Stealth Rock or even Toxic Spikes allows Marshadow to meet benchmarks such as KOing untransformed defensive Zygarde at +2. Wallbreakers such as Calyrex-S and Groudon can weaken Marshadow's checks to help it sweep late-game. Bulk Up Marshadow can effectively utilize Dynamax to break through targets that it couldn't otherwise, such as Zygarde-C and Eternatus. As such, offensive partners that don't rely on Dynamax maximize the team's offensive potential. The aforementioned Zacian-C pairs well due to the ability to heavily pressure each other's checks. Eternatus also fits well, as it can remove Zygarde-C, which otherwise walls Marshadow.</p> "
      },
      {
        "name": "Choice Band",
        "description": "<p>Close Combat threatens the Dark-type and Normal-type Pokemon that resist or are immune to Poltergeist, 2HKOing Yveltal and OHKOing Tyranitar and Blissey. Shadow Sneak, boosted by Technician, lets Marshadow revenge kill faster or boosted Pokemon such as Calyrex-S, Mewtwo, weakened Zacian-C, Xerneas, and Zekrom. Ice Punch allows Marshadow to heavily dent Zygarde-C, which would otherwise wall it, and also eases prediction by providing a coverage move that can hit both Yveltal and Eternatus. Alternatively, Spectral Thief can be used to check slower sweepers such as Calm Mind Kyogre and is more reliable than Poltergeist. Technician-boosted Rock Tomb can also be useful to OHKO Ho-Oh and does hefty damage to defensive Yveltal while also having utility in lowering the foe's Speed. A Jolly nature is preferred to outpace Modest Eternatus and Speed tie with opposing Marshadow but an Adamant nature can be used to increase damage output.</p> <p>This set can be paired with Pokemon that appreciate its ability to break through walls like Necrozma-DM, Ho-Oh, and Lunala and revenge kill Pokemon such as unboosted Calyrex-S, Yveltal, Kyogre, and Palkia. Zacian-C pairs very well with this set, as it can pivot into Eternatus, Sucker Punch Yveltal, and Xerneas, and Play Rough variants can lure defensive Zygarde-C for Marshadow lacking Ice Punch. In return, Marshadow can force out and take advantage of Calyrex-S and Necrozma-DM, two of Zacian-C's common checks, and Ice Punch variants can weaken defensive Zygarde-C for Zacian-C lacking Play Rough. Xerneas can also severely punish Dark-types seeking to switch into Marshadow's Ghost-type STAB moves, using them as setup bait and threatening to sweep with Geomancy. Meanwhile, Marshadow receives opportunities to wallbreak by double switching into common Xerneas answers like Necrozma-DM, Chansey, and Ferrothorn while potentially weakening or removing Ho-Oh for Xerneas. Marshadow is rather frail and should avoid switching directly into attacks such as Necrozma-DM's Sunsteel Strike and Yveltal's or Tyranitar's Foul Play, so try to get it in via double switches and slow pivoting. Stealth Rock support allows Marshadow to achieve KOs on Kyogre and offensive Yveltal, although it has to be wary of Sucker Punch from the latter, while Defog prevents entry hazards from wearing down Marshadow as it repeatedly switches in and out over the course of a match. Imposter-proofing Marshadow is fairly straightforward and can be done with Ho-Oh, defensive Yveltal, Zygarde, Groudon, and defensive Xerneas.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 367227, "username": "baconeatinassassin"}, {"user_id": 464176, "username": "Icemaster"}]}, {"name": "Grammar checked by", "members": [{"user_id": 302985, "username": "lotiasite"}]}], "writtenBy": [{"user_id": 512812, "username": "WolfishOne"}]}
  },
  "Grimmsnarl": {
    "comments": "<h1>Other Options</h1> <p>Thunder Wave is usable in the third moveslot in order to punish Dragon Dance Necrozma-DM, Geomancy Xerneas, and Swords Dance Zacian-C, which may try set up on Grimmsnarl, while acting as a blanket form of speed control for foes such as Calyrex-S. However, it is not recommended, as without Play Rough, Grimmsnarl is completely unable to punish Defog support Yveltal.</p> <h1>Checks and Counters</h1> <p><strong>Ho-Oh: A Sacred Fire burn from Ho-Oh particularly troubles Grimmsnarl, letting Yveltal safely use Defog on it, as Play Rough no longer comes close to outdamaging Roost, while wearing Grimmsnarl down.</p> <p><strong>Xerneas</strong>: Xerneas can force a difficult 50/50 between Geomancy and Moonblast, which require Taunt or Light Screen respectively. Defensive Xerneas sets, however, can threaten Defog or Moonblast, so they are particularly difficult for Grimmsnarl to handle.</p> <p><strong>Zacian-C and Necrozma-DM</strong>: Both can massively damage even Grimmsnarl behind Reflect with their STAB moves, while also threatening to set up in front of it, causing a 50/50 between Taunt and Reflect.</p> ",
    "sets": [
      {
        "name": "Dual Screens",
        "description": "<p>Due to Prankster, Taunt, and a resistance to Calyrex-S's Astral Barrage, Grimmsnarl carves out a niche in the AG metagame as the most reliable dual screens setter, enabling dangerous offensive threats to set up easily. Play Rough outdamages Roost from the Taunt-immune support Yveltal, preventing it from Defogging Grimmsnarl's screens away, while damaging Calyrex-S and Zygarde. Taunt prevents Defog from Ho-Oh and entry hazards—especially Sticky Web and Toxic Spikes, which offensive teams can otherwise struggle with—while also preventing setup from sweepers such as Necrozma-DM, Groudon, and Zygarde-C. The given EV spread enables Grimmsnarl to survive Zacian-C's Behemoth Blade behind Reflect.</p> <p>Grimmsnarl fits best on offensive teams where dangerous sweepers like Zacian-C and Xerneas can take advantage of its screens support, which helps them set up easily and avoid being revenge killed by Choice Scarf Calyrex-S or Ditto. In turn, Grimmsnarl appreciates teammates that prevent easy Defogs such as Groudon, Stone Edge Necrozma-DM, and Zekrom, which can also setup and appreciate the protection from revenge killing. Furthermore, Grimmsnarl requires bulky teammates that can switch into Xerneas, Zacian-C, and Dragon Dance Necrozma-DM; it cannot safely use Taunt to block their setup as they OHKO Grimmsnarl without the relevant screen. As such, Zacian-C, Necrozma-DM, and Zekrom are recommended teammates. They can take attacks quite well, allowing Grimmsnarl to easily swap out to come back in later for a second round of screens.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 491896, "username": "Rotten"}, {"user_id": 426798, "username": "Geysers"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 464176, "username": "Icemaster"}]}
  },
  "Dracovish": {
    "comments": "<h1>Other Options</h1> <p>Choice Scarf is a valid option, making Dracovish far more effective agaunst offensive threats including Adamant Zacian-C, Yveltal, and unboosted Xerneas. However, a Choice Scarf set is far more reliant on rain to do any meaningful damage. Sand Rush + Choice Band can be used if paired with Tyranitar, as this enables Dracovish to outspeed even Calyrex-S, but it too is ineffective due to an overreliance on sand. Outrage can be used over Dragon Rush for its perfect accuracy. However, Outrage's locking effect results in Dracovish being revenge killed easily by Zacian-C and Xerneas.</p> <h1>Checks and Counters</h1> <p><strong>Faster Pokemon: Due to Dracovish's low Speed, a large number of threats can outspeed it, such as Calyrex-S, Xerneas, Zacian-C, and Eternatus, weakening Fishious Rend's power or outright OHKOing Dracovish before it moves.</p> <p><strong>Bulky Dragon-types: Outside of rain, Dragon-types like Eternatus, Palkia, Giratina, and Kyurem-W can relatively safely switch into Dracovish. They fear Dragon Rush, however.</p> <p><strong>Lugia and Lunala: Outside of rain, Lunala is only threatened by Crunch while outspeeding Dracovish and threatening to cripple it with Will-O-Wisp. Lugia outspeeds Dracovish, walls it with Multiscale and Roost and cripples it with Toxic.</p> ",
    "sets": [
      {
        "name": "Choice Band",
        "description": "<p>Thanks to its ability and Fishious Rend, Choice Band Dracovish has jaw-dropping power capable of rending many common defensive pokemon to pieces, including Ho-Oh, Necrozma-DM, specially defensive Yveltal, Groudon, and Tyranitar. This power also makes it difficult for almost anything to switch into it, giving Dracovish a niche over faster wallbreakers such as Zacian-C and Marshadow. Notably, rain-boosted Fishious Rend is capable of OHKOing a slightly chipped defensive Eternatus or Lunala on the switch while also OHKOing defensive Zygarde-C and Ferrothorn. While Fishious Rend is generally the safe option to spam, Dragon Rush targets Dragon-types that resist Fishious Rend, OHKOing Eternatus, Kyurem-W, and Palkia after little to no chip damage. Crunch severely damages Lunala and hits Shedinja, and it can be used in an emergency to Dynamax and KO Calyrex-S. Psychic Fangs heavily damages Eternatus and has perfect accuracy, unlike Dragon Rush. Any of the aforementioned coverage moves 2HKO Gastrodon, preventing it from safely switching in.</p> <p>Dracovish performs best in rain, as this boosts Fishious Rend to the strongest possible levels. As such, it should almost always be paired with Kyogre. Calm Mind bulky Kyogre particularly complements Dracovish, as it easily switches into Eternatus and Lunala, while Thunder Wave variants can cripple Dracovish switch-ins and let it outspeed many faster foes. In return, Dracovish can punch holes in the opposing team, OHKOing Blissey, Ferrothorn, and Eternatus with a well-timed Fishious Rend, enabling Kyogre to then break through the opposing team much more easily. However, Dracovish cannot handle faster threats such as Calyrex-S, Xerneas, Zacian-C, and Zekrom. As such, teammates such as Yveltal, Necrozma-DM, Ho-Oh, and Lunala are appreciated. Dracovish is a powerful but slow wallbreaker, so fast pokemon such as Calyrex-S, Zacian-C, and Ditto are appreciated teammates too.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 491896, "username": "Rotten"}, {"user_id": 360582, "username": "Guard"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 464176, "username": "Icemaster"}]}
  },
  "Zacian": {
    "sets": [
      {
        "name": "Choice Scarf",
        "description": "<p>Zacian is a good revenge killer in AG due to its good Speed and Attack stat, which are further boosted by Choice Scarf and its ability Intrepid Sword. Its good bulk allows it to revenge kill Yveltal and deal with Dragon Dance Zygarde-C. Play Rough allows Zacian to OHKO many prominent Pokemon such as Yveltal, Zekrom, and Marshadow, while Close Combat hits Steel-types such as Zacian-C and Ferrothorn. Crunch allows Zacian to dispatch weakened Necrozma-DM while also ensuring that it can revenge kill a healthy Calyrex-S and is not completely walled by Lunala. Wild Charge heavily damages Ho-Oh, which otherwise walls Zacian very well and threatens to burn it with Sacred Fire. Wild Charge also gives Zacian a functional super effective option for Kyogre. Solar Blade takes advantage of Drought and heavily damages Groudon while also OHKOing Quagsire, which otherwise walls Zacian easily. Maximum Speed investment with a Jolly nature and Choice Scarf allows Zacian to outspeed almost the entire metagame, even Pokemon such as Zekrom and Groudon at +2 Speed, making it easy to revenge kill foes.</p> <p>Zacian best fits as a revenge killer on bulky offense and balance teams. Pokemon such as Zygarde-C, Ferrothorn, and Eternatus provide great support by switching into its counters in Necrozma-DM and Quagsire and forcing them out. Ferrothorn can set Spikes, allowing Zacian to KO chipped foes, while also checking Kyogre and Xerneas. Groudon provides sun for Solar Blade variants of Zacian. In return, Zacian can deal heavy damage to Pokemon such as Xerneas, Zekrom, and Kyogre that threaten these teammates. Necrozma-DM can switch into Zacian-C, which can OHKO Zacian, and chip it down so Zacian can revenge kill it with Close Combat or Crunch. In return, Zacian pressures Yveltal and Zygarde-C, forcing them to switch out. However, it must be wary of Knock Off and Glare while switching in. On balance teams, Gothitelle can trap Necrozma-DM and Quagsire, allowing Zacian to put huge dents in the opponent's team.</p> <h1>Other Options</h1> <p>Fire Fang can be used with Groudon to 2HKO a chipped Necrozma-DM, but locking into it puts Zacian at a disadvantage against Pokemon such as Zygarde-C, Zekrom, and Eternatus.</p> <h1>Checks and Counters</h1> <p><strong>Necrozma-DM: Necrozma-DM is the most reliable check for Zacian, since it can take whatever Zacian can dish out while being able to recover health. It can also heavily damage Zacian using Sunsteel Strike in return. Rocky Helmet variants can chip Zacian, allowing priority users such as Marshadow to revenge kill it, and make Zacian's moves less spammable.</p> <p><strong>Quagsire</strong>: Quagsire is a good check to Zacian due to its typing and Unaware ignoring Intrepid Sword's boost. Quagsire can also cripple it using Toxic or Scald. However, it must beware Solar Blade variants, since they can easily OHKO it.</p> <p><strong>Eternatus</strong>: Eternatus's great bulk allows it to soft check Zacian by switching into its moves and stalling it out while consistently recovering its health. Eternatus can also threaten Zacian with Sludge Bomb. However, a specially defensive Eternatus needs to be at full health to switch into Play Rough.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 511624, "username": "Fc"}, {"user_id": 491896, "username": "Rotten"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 532881, "username": "Frozoid"}]}
  },
  "Zacian-Crowned": {
    "comments": "<h1>Other Options</h1> <p>Fire Fang can be used if Zacian-C is specifically paired with Groudon to 2HKO Necrozma-DM under sun. However, it is hard to justify using over another coverage move, especially because Assurance can already 2HKO Necrozma-DM on the switch if Stealth Rock or Spikes is up. If running Fire Fang, use Play Rough instead of Close Combat. Substitute is an option over Assurance to block Ditto from transforming into Zacian-C. However, replacing Assurance or Swords Dance means that Zacian-C has almost no way to deal with Necrozma-DM. A Jolly nature allows Zacian-C to outspeed Jolly Marshadow and Adamant Zacian-C, but it loses significant damage output. Crunch is an option on Zacian-C to pressure Necrozma-DM without relying on Stealth Rock or Spikes. It is also more reliable than Close Combat at pressuring Necrozma-DM, as it doesn't lower Zacian-C's defenses.</p> <h1>Checks and Counters</h1> <p><strong>Necrozma-DM: Necrozma-DM is by far the most reliable check to Zacian-C, being able to tank most of its attacks thanks to its great bulk and threaten it back with Sunsteel Strike or chip damage from Rocky Helmet. However, Necrozma-DM without Heavy-Duty Boots cannot reliably switch into Zacian-C if Stealth Rock or Spikes is on its side of the field, as it risks being crippled by Assurance, putting it into OHKO range for Close Combat. It also has to recover with Morning Sun if it switches in on Close Combat, which teams can take advantage of due to its very low PP. Non-Earthquake Necrozma-DM cannot handle Swords Dance Zacian-C without Dynamax.</p> <p><strong>Faster Revenge Killers</strong>: Faster revenge killers such as Calyrex-S, Choice Scarf Kyogre, and offensive Eternatus can outspeed and KO Zacian-C with their STAB or coverage moves, easily forcing it out.</p> <p><strong>Quagsire: Although Quagsire can only fit on stall teams, it's a very strong check to Zacian-C due to its resistance to Behemoth Blade, Unaware ignoring Intrepid Sword and Swords Dance boosts, and sufficient bulk. However, Quagsire struggles to switch in on Zacian-C's Close Combat or Play Rough if it is severely weakened.</p> ",
    "sets": [
      {
        "name": "Wallbreaker",
        "description": "<p>Zacian-C is a centralizing force in AG that threatens offense and balance alike with its Intrepid Sword-boosted Attack, excellent STAB combination, great coverage, and fantastic Speed. Its good bulk and typing allow it to deal with Xerneas, Eternatus, and Yveltal, offering valuable defensive utility. Behemoth Blade is preferred over Play Rough for preventing Pokemon such as Yveltal and Groudon from effectively using Dynamax defensively against Zacian-C while also reliably OHKOing Xerneas. Wild Charge OHKOes specially defensive Yveltal after minimal chip damage, deals with Ho-Oh, and devastates Kyogre. Close Combat provides good coverage for Ferrothorn and 2HKOes a weakened Necrozma-DM. Assurance deals great damage to Zacian-C's most reliable check in Necrozma-DM if it switches in while Stealth Rock or Spikes is on the field and prevents Lunala from reliably checking it. Zacian-C can alternatively run Swords Dance, boosting its already terrific Attack to break through physically defensive walls such as Zygarde-C, Giratina, and Necrozma-DM. However, this makes Zacian-C and its team more vulnerable to Ditto. Play Rough is also a decent pick, letting Zacian-C defeat Zygarde-C, Zekrom, and Giratina. An Adamant nature enhances Zacian-C's damage output while leaving it fast enough to outspeed much of the metagame. 72 Speed EVs allow Zacian-C to outspeed Adamant Marshadow, while the rest are put into HP to increase its overall bulk. A spread of 252 Atk / 4 SpD / 252 Spe may be run on hyper offense teams instead with an Adamant or a Jolly nature, as bulk is not as useful.</p> <p>Zacian-C is an excellent fit on bulky offense and balance teams due to its great wallbreaking potential, amazing Speed tier, bulk, and typing, which make it a decent check to Xerneas, Eternatus, and Yveltal. However, Zacian-C can be revenge killed by the likes of Calyrex-S, Choice Scarf Kyogre, and offensive Eternatus. Therefore, teammates that can deal with these threats such as Yveltal, Eternatus, and Calyrex-S, respectively, are appreciated. Necrozma-DM and Ferrothorn can provide Stealth Rock or Spikes support for Zacian-C, invalidating Necrozma-DM as a switch-in to Assurance Zacian-C if it lacks Heavy-Duty Boots. Kyogre's Drizzle is useful for Zacian-C, as it restricts Necrozma-DM's ability to consistently heal with Morning Sun. Partners like Necrozma-DM and Ho-Oh should be used in order to check Ditto once it has copied Zacian-C. Offensive teammates such as Calyrex-S, Life Orb Yveltal, and Xerneas can pressure physically defensive checks to Zacian-C such as Necrozma-DM, Zygarde-C, and Giratina. Xerneas also forms a great offensive core with Zacian-C; Xerneas is able to stall out Dynamax turns from Necrozma-DM with Substitute and 2HKO it with Thunder at +2, leaving it weakened so Zacian-C can KO it. In return, Zacian-C can take care of Ferrothorn. Gothitelle is another noteworthy pick on balance teams, as Zacian-C can lure in Necrozma-DM so Gothitelle can trap it and PP stall it.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 360582, "username": "Guard"}, {"user_id": 426798, "username": "Geysers"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}, {"user_id": 331519, "username": "CryoGyro"}]}], "writtenBy": [{"user_id": 491896, "username": "Rotten"}]}
  },
  "Eternatus": {
    "comments": "<h1>Other Options</h1> <p>Shadow Ball is an option on the support set to punish Calyrex-S sets that try to set up on Eternatus, but is difficult to fit. Light Screen is a good option that allows Eternatus to wall Kyogre much more reliably, as the latter is capable of breaking through Eternatus with a Life Orb set. It also proves useful in handling opposing Eternatus and other miscellaneous special attackers. An Expert Belt set with Draco Meteor, Sludge Bomb, and Special Attack investment can lure opposing Eternatus and also break through Necrozma-DM for partners like Xerneas and Zacian-C, but has a mediocre matchup against Calm Mind Kyogre.</p> <h1>Checks and Counters</h1> <p><strong>Zacian-C: Zacian-C is immune to Eternatus's STAB combination and deals massive damage back. It must be wary of Flamethrower or Mystical Fire though, and cannot outspeed offensive Eternatus with a bulky set.</p> <p><strong>Calyrex-S</strong>: Calyrex-S is one of the most potent Eternatus checks, being faster and able to OHKO with Psyshock or, if Eternatus is very weakened, Astral Barrage.</p> <p><strong>Ho-Oh and Other Specially Bulky Pokemon</strong>: Yveltal and Ho-Oh have the Special Defense to switch into Eternatus and use Knock Off or Whirlwind relatively safely. However, they must be cautious of Meteor Beam and are crippled easily by Toxic or Sludge Bomb poison. Blissey can wall Eternatus but must use Confide for Meteor Beam variants.</p> ",
    "sets": [
      {
        "name": "Specially Defensive",
        "description": "<p>Specially defensive Eternatus is one of the most useful blanket checks in the metagame for handling threatening Pokemon such as Kyogre, Necrozma-DM, and Marshadow. Dynamax Cannon provides valuable coverage against the likes of Palkia, Adamant Marshadow, Zekrom, and Zygarde-C and hits most neutral targets for good damage. Additionally, it effectively bypasses the effects of Dynamax, threatening foes such as Groudon, Zekrom, and Reshiram. Alternatively, Sludge Bomb has higher PP, can poison foes, and punishes Xerneas for switching in. It sacrifices Dynamax Cannon's coverage and ability to threaten Groudon. Dragon Tail can be used to phaze and deter Gothitelle, as well as setup sweepers such as Zekrom and Calm Mind Kyogre, but is fairly weak. Flamethrower nails Steel-types such as Necrozma-DM, Zacian-C, and Ferrothorn. Mystical Fire is a slightly weaker alternative that limits Calm Mind Kyogre for a good while alongside Toxic, heavily annoys Geomancy Xerneas seeking to set up, and generally weakens special attackers such as opposing Eternatus and offensive Yveltal. Toxic is most useful when running Dynamax Cannon, crippling Ho-Oh, bulky Yveltal, and Lunala, while also forcing Calm Mind Kyogre to use Rest. Toxic Spikes can situationally be devastating, especially against hyper offensive teams, as it puts sweepers like Calyrex-S, Xerneas, Zekrom, and Groudon on timers. It works best alongside Sludge Bomb so Eternatus can still poison Ho-Oh, Yveltal, and Lunala. However, Eternatus's own popularity spells doom for the overall effectiveness of Toxic Spikes, and common Pokemon in Zacian-C, Yveltal, Necrozma-DM, and Ferrothorn are naturally immune to the move. Recover with Pressure lets Eternatus outlast every passive Pokemon in the metagame, including staples such as defensive Yveltal, Necrozma-DM, and Ho-Oh. Heavy-Duty Boots lets Eternatus mitigate entry hazards such as Sticky Web and Stealth Rock, giving it a better matchup against Kyogre. Alternatively, Black Sludge can be used for passive recovery. Sitrus Berry is another alternative and is useful against Marshadow, making Poltergeist unable to deal damage once the item is activated. The given EV spread maximizes Eternatus's special bulk while outpacing Adamant Marshadow.</p> <p>Eternatus is close to mandatory on most balance teams, as it's by far the best status absorber and the most reliable long-term check to Kyogre and Necrozma-DM. Pokemon that are weak to Kyogre such as Necrozma-DM, Ho-Oh, and Zygarde-C generally make for good teammates. Yveltal is a required teammate, being the only decent check to the hugely threatening Calyrex-S. Necrozma-DM can take on Zacian-C, a big threat to Eternatus. It also forms an entry hazard stacking core with Toxic Spikes Eternatus. Lunala is capable of taking on boosted Zekrom, Zygarde-C, and the extremely dangerous Groudon. In return, Eternatus can serve as a status absorber against the likes of Ho-Oh and opposing Eternatus. As Eternatus is easily capable of switching into defensive Pokemon such as Necrozma-DM, bulky Yveltal, and Ferrothorn in the long run, Pokemon checked by them such as Zacian-C, Calyrex-S, and Kyogre make for great teammates.</p> "
      },
      {
        "name": "Wallbreaker",
        "description": "<p>Eternatus is a brutal wallbreaker that can become very awkward to check later in the game between its enormous offensive and defensive prowess, Life Orb, and reliable recovery. Flamethrower hits the Steel-types that resist Dynamax Cannon in Necrozma-DM, Ferrothorn, and Zacian-C. Sludge Bomb provides perfectly neutral coverage and notably OHKOes Xerneas. Alternatively, Meteor Beam punishes Ho-Oh and Yveltal for switching in and boosts Eternatus's Special Attack, letting it beat Tyranitar and Blissey lacking Confide and potentially sweep. Toxic is another option that cripples Ho-Oh and Yveltal without incurring Life Orb recoil like Sludge Bomb or requiring Power Herb like Meteor Beam. Recover heals Life Orb damage and utilizes Eternatus's gigantic bulk to stall out passive Pokemon like Necrozma-DM and Tyranitar. Life Orb provides a consistent power boost and makes Flamethrower 2HKO Necrozma-DM. A Modest nature is used for extra firepower, but a Timid nature may be used to outpace Jolly Marshadow and opposing Modest Eternatus.</p> <p>Eternatus fits well on balance and bulky offensive teams. Eternatus should not be a team's sole check to Kyogre because its lack of bulk investment means it cannot switch into Ice Beam. As such, the likes of Ferrothorn and Palkia make for good teammates, and Ferrothorn can also provide entry hazard support with Spikes. Eternatus is easily forced out by Calyrex-S and fast Zacian-C variants, which can be handled with Yveltal and Necrozma-DM. Both Calyrex-S and Zacian-C form a formidable wallbreaking core with Eternatus that pressures each other's checks, with Calyrex-S in particular appreciating the fact that Meteor Beam Eternatus can lure Yveltal.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 360582, "username": "Guard"}, {"user_id": 491896, "username": "Rotten"}]}, {"name": "Grammar checked by", "members": [{"user_id": 331519, "username": "CryoGyro"}]}], "writtenBy": [{"user_id": 512812, "username": "WolfishOne"}]}
  },
  "Urshifu": {
    "comments": "<h1>Other Options</h1> <p>Iron Head is a solid coverage option over Sucker Punch to prevent Xerneas from switching in freely; however, dropping Sucker Punch makes Urshifu-S much more vulnerable to threats like Calyrex-S and Marshadow.</p> <h1>Checks and Counters</h1> <p><strong>Fairy-types: Fairy-types like Xerneas and Zacian resist both of Urshifu-S's STAB moves, meaning that they can switch in freely, barring the rare Iron Head. Xerneas deserves a special mention, as it can freely set up Geomancy on Urshifu and threaten to sweep the entire team afterwards.</p> <p><strong>Ho-Oh: Ho-Oh is able to scout Urshifu-S, enabling the opponent to then choose the appropriate switch-in, preventing Urshifu from making any progress.</p> <p><strong>Faster Pokemon</strong>: Due to Urshifu-S's unimpressive Speed stat, it is easily revenge killed by faster Pokemon like Zacian-C, Marshadow, and Eternatus.</p> ",
    "sets": [
      {
        "name": "Choice Band",
        "description": "<p>Choice Band Urshifu-S is a decent threat due to its potent STAB combination hitting almost everything in the tier for at least neutral damage. It's also very hard to scout, as Unseen Fist lets it hit Pokemon using Protect. Wicked Blow is incredibly threatening, as it allows Urshifu to bypass Defense boosts. Close Combat hits Dark-resistant foes like Yveltal, Zacian-C on the switch, and Tyranitar. U-turn lets Urshifu-S keep up the momentum, and Sucker Punch lets Urshifu-S revenge kill faster Pokemon like Calyrex-S, Marshadow, and Eternatus. Jolly is the preferred nature, as it lets Urshifu-S outspeed common Pokemon like Kyogre, Groudon, Kyurem-W, and neutral-natured Yveltal; however, if more power is desired. Urshifu-S can run an Adamant nature, but this leaves it outsped by a lot of key targets.</p> <p>Due to Urshifu-S's overbearing weakness to Fairy-types like Xerneas and Zacian-C, Pokemon such as Necrozma-DM, Ho-Oh, and Zacian-C that can deal with these Fairy-types both defensively and offensively make for good teammates. Urshifu-S can struggle to break through defensive Zygarde-C due to its gigantic bulk, so it should be paired up with Pokemon to deal with it such as Ferrothorn, Kyurem-W, Lunala, and Yveltal. As Urshifu-S has trouble switching in, pivots such as U-turn Yveltal, Blissey, and Landorus-T that can safely bring it in are incredibly potent teammates. The former makes an excellent pair with Urshifu-S as a primary counter to Calyrex-S. Other physical attackers like Marshadow, Zacian-C, Groudon, Zygarde, and Zekrom appreciate having Urshifu-S around to break the opposing team's physically defensive Pokemon. Ho-Oh is a big threat to Urshifu, as it is able to scout its attacks without getting punished, which is a big deal in longer games due to its limited PP.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 491896, "username": "Rotten"}, {"user_id": 464176, "username": "Icemaster"}]}, {"name": "Grammar checked by", "members": [{"user_id": 302985, "username": "lotiasite"}]}], "writtenBy": [{"user_id": 5178921, "username": "pannuracotta"}]}
  },
  "Regieleki": {
    "comments": "<h1>Other Options</h1> <p>Regieleki can run a dual screens set with Light Clay, providing extremely valuable turns to let offensive teammates set up with more ease. It can also use Explosion once it has set them up, bringing in an aforementioned teammate without any risk. However, it faces stiff competiton from Grimmsnarl as a dual screens lead, which has Prankster for a nearly guaranteed Reflect or Light Screen while providing other useful support with Taunt and Thunder Wave.</p> <h1>Checks and Counters</h1> <p><strong>Ground-types: Regieleki is heavily pressured by Ground-types such as Groudon and Zygarde-C, as it tends to rely on Wild Charge for damage, letting them set up with Swords Dance or Dragon Dance, respectively. However, Explosion can weaken these foes and safely bring in a desired teammate, gaining momentum.</p> <p><strong>Dragon-types: Dragon-types such as Eternatus, Zekrom, and Reshiram are huge threats to Regieleki, resisting Wild Charge and threatening it back with their STAB moves. Zekrom and Reshiram can also set up on Regieleki using Dragon Dance, but they risk taking quite a lot of damage from Explosion. Giratina is an especially big threat to Regieleki, as it takes mediocre damage from Assurance due to its great bulk, spinblocks it, and cripples it with Toxic or Will-O-Wisp.</p> <p><strong>Ferrothorn: Ferrothorn can completely shut down Regieleki, as its typing makes it resistant to Wild Charge, Rapid Spin, and Explosion, meaning Regieleki struggles to do any meaningful damage to it. This good matchup can also let it keep Stealth Rock on the field, as Regieleki gets worn down from Iron Barbs, Leech Seed, and its Life Orb recoil.</p> <p><strong>Defensive Necrozma-DM</strong>: Defensive Necrozma-DM is able to withstand Regieleki's Wild Charge due to its good bulk, tank an Assurance due to Prism Armor, and resist Explosion and Rapid Spin, while its Rocky Helmet can indirectly wear Regieleki down during a match. This good matchup can let it safely keep Stealth Rock on the field, which hinders Regieleki's effectiveness.</p> <p><strong>Priority Moves</strong>: Regieleki's overall mediocre bulk makes it very prone to priority attacks from notable Pokemon like Sucker Punch Yveltal and Shadow Sneak Marshadow.</p> <p><strong>Lunala: Defensive Lunala is a particularly big threat to Regieleki, as it blocks Rapid Spin, tanks Wild Charge and Assurance with ease due to Shadow Shield and its solid bulk, and cripples it with Will-O-Wisp or Toxic. However, it must be careful of switching in on an Assurance, since its Shadow Shield will be broken, letting Assurance KO it the next turn.</p> ",
    "sets": [
      {
        "name": "Rapid Spin",
        "description": "<p>Regieleki's phenomenal Speed tier and access to Rapid Spin allow it to act as a valuable entry hazard remover for offensive teams in AG. In addition, it can outspeed notable fast threats such as Choice Scarf Kyogre, Calyrex-S, and Zacian-C, enabling it to act as a revenge killer on such teams. Wild Charge deals immediate damage to bulky Flying-types such as Ho-Oh and Yveltal, as well as Kyogre, while hitting decently hard generally in conjunction with Transistor, allowing Regieleki to heavily damage Zacian-C. Explosion lets Regieleki KO itself once it has successfully removed entry hazards with Rapid Spin, generating momentum for its offensive teammates to enter safely and set up, while also potentially blocking opposing Defoggers from removing hazards set by Regieleki's teammates. Additionally, it KOes Eternatus and prevents Regieleki from being complete setup bait against the likes of Groudon, Zekrom, and Zygarde-C, bringing in teammates that can set up on these foes besides dealing damage. Assurance OHKOes Calyrex-S, even without prior hazard damage, and nails other Ghost-types like Lunala that spinblock Regieleki. Life Orb with an Adamant nature maximizes Regieleki's damage output, making it a better revenge killer and increasing damage against bulky walls such as Eternatus.</p> <p>Regieleki primarily fits on hyper offense teams, as they greatly appreciate its Rapid Spin support, and its fantastic Speed tier prevents fast threats such as Choice Scarf Kyogre, Zacian-C, and Calyrex-S from wrecking the team. Regieleki particularly struggles against entry hazard setters like Necrozma-DM and Ferrothorn, as their Rocky Helmet and Iron Barbs, respectively, can wear it down, while Wild Charge cannot deal too much damage against them. Its mediocre bulk leaves it very susceptible to their moves in return. Teammates that can pressure these foes such as Life Orb Yveltal, Calyrex-S, and Groudon are thus appreciated. Regieleki struggles against Electric-resistant Pokemon such as Groudon, Zekrom, and Zygarde-C, only having Explosion to meaningfully hit them. Teammates that can enter after Explosion and deal with them such as Xerneas, Calyrex-S, and Life Orb Yveltal are beneficial.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 464176, "username": "Icemaster"}, {"user_id": 426798, "username": "Geysers"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 491896, "username": "Rotten"}]}
  },
  "Calyrex-Ice": {
    "comments": "<h1>Other Options</h1> <p>High Horsepower can be used over Swords Dance to attain perfect coverage and is useful against threats like Necrozma-DM and Zacian-C. However, forgoing Swords Dance makes fighting Necrozma-DM more awkward, as Calyrex-I will be forced to take Rocky Helmet damage when attempting to wear it down. A bulkier version of a Substitute set can be run with Iron Defense, Body Press, and Glacial Lance alongside a 252 HP / 4 Atk / 252 Spe EV spread. This set has the benefit of being a sturdier check to Zygarde-C and Zekrom, though it struggles to overcome Necrozma-DM that can Dynamax. Heavy-Duty Boots can be used to remove chip from Stealth Rock, allowing Calyrex-I to switch in more easily, although Leftovers synergizes well with Substitute.</p> <h1>Checks and Counters</h1> <p><strong>Revenge Killers: Several Pokemon are able to revenge-kill Calyrex-I, such as Zacian-C, Marshadow, Calyrex-S, and offensive Yveltal. A healthy Zacian-C can take on Calyrex-I unless it’s boosted and behind a Substitute; Spectral Thief Marshadow can threaten it regardless of Attack boosts and Substitute. Calyrex-S and Yveltal should only be used to revenge kill if Calyrex-I isn’t behind a Substitute. Most of these Pokemon appreciate having the opposing Dynamax already used to minimize the risk of getting KOed instead.</p> <p><strong>Kyogre: Given its Ice resistance and neutrality to High Horsepower, Kyogre can usually switch in safely and damage Calyrex-I greatly with its STAB moves. With Scald, Kyogre can pressure Calyrex-I by threatening to burn it, negating recovery from Leftovers and drastically reducing its offensive power. Rest lets Kyogre heal when Calyrex-I chips it enough to threaten a KO. Even bulky Kyogre usually outspeed Calyrex-I, forcing it out unless it is behind a Substitute.</p> <p><strong>Entry Hazards</strong>: Calyrex-I taking 25% from Stealth Rock means that it struggles when it’s repeatedly forced out. While Stealth Rock is the most dangerous hazard for Calyrex-I, Spikes and Toxic Spikes are also to be watched out for, as extra chip and getting poisoned can force Calyrex-I to rely on Leech Seed more often.</p> ",
    "sets": [
      {
        "name": "SubSeed",
        "description": "<p>While Calyrex-I is negatively affected by not being able to be used with Calyrex-S on the same team, it is an effective wallbreaker with Substitute + Leech Seed due to its good bulk, great Attack, and very powerful STAB move in Glacial Lance, which can quickly dent Necrozma-DM. Having a strong move for Dragon- and Ground-types is integral for forcing out Pokemon such as Zygarde-C, Eternatus, and Groudon. Substitute can be used on forced switches for easier setup aided by Calyrex-I's bulk. Leech Seed allows Calyrex-I behind Substitute to overwhelm Necrozma-DM over time. Calyrex-I's comparatively low uninvested HP increases Leech Seed's healing, helping it offset Substitute damage. Swords Dance boosts Calyrex-I's Attack to ludicrous levels when it is given the chance, which is often given the amount of switches it forces. As One can make it progressively harder to deal with Calyrex-I, although its Speed hinders its ability to outright sweep. A Jolly nature allows it to outspeed paralyzed Zacian-C and uninvested Pokemon with base 90 Speed such as Ho-Oh and defensive Groudon.</p> <p>Calyrex-I is best used on bulky balance teams that appreciate its ability to lure in and overwhelm Necrozma-DM and check dangerous wallbreakers in Zygarde-C and Zekrom in a pinch. Zacian-C and Xerneas are by far the best offensive partners, benefitting massively from Calyrex-I's ability to pressure Necrozma-DM. In return, both can threaten Yveltal and Marshadow. Calyrex-I appreciates partners that can slow foes down and check switch-ins. Zygarde-C is an excellent partner with Glare, allowing Calyrex-I to usually outspeed and gain free turns to set up with Swords Dance. It also deals with Marshadow lacking Ice Punch. As bulky Kyogre is Calyrex-I’s most effective wall, checks to it such as Eternatus and Kyurem-W are valuable, with the former sapping Scald PP with Pressure and the latter pressuring Kyogre with Freeze-Dry. Ferrothorn frustrates Kyogre with Spikes and Knock Off. Necrozma-DM is a useful partner as well, being a Thunder Wave user and a Zacian-C check. Calyrex-I benefits Necrozma-DM by using Leech Seed on Zacian-C switching in and offensively checking Zygarde-C. Defoggers such as Ho-Oh and Yveltal are vital, as entry hazards heavily chip Calyrex-I every time it switches in.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 360582, "username": "Guard"}, {"user_id": 511624, "username": "Fc"}]}, {"name": "Grammar checked by", "members": [{"user_id": 331519, "username": "CryoGyro"}]}], "writtenBy": [{"user_id": 515077, "username": "Mbouchon"}]}
  },
  "Calyrex-Shadow": {
    "comments": "<h1>Other Options</h1> <p>Draining Kiss and Leaf Storm can both be used over Aromatherapy, allowing Calyrex-S to break through Yveltal and Tyranitar more directly. However, Draining Kiss is very weak, Leaf Storm weakens Calyrex-S, and neither offers much over Trick. Baton Pass is another niche option, allowing Calyrex-S to effectively bait in Yveltal and Tyranitar for the likes of Zacian-C and Xerneas. Colbur Berry is potentially worthwhile when Dynamaxed to survive attacks from Yveltal as well as Necrozma-DM's Knock Off, hitting them back with +2 Max Starfall or Astral Barrage. Leaf Storm can KO Tyranitar after a Nasty Plot boost, but it has no other use and its Special Attack drop can be unfavorable. On Choice Scarf, Nasty Plot can be used over Aromatherapy for potentially sweeping after using Trick, which can be particularly effective as a Choice-locked Yveltal, Tyranitar or Blissey is far less effective at countering Calyrex-S. However requiring Trick to be used first makes this strategy quite unreliable.</p> <h1>Checks and Counters</h1> <p><strong>Dark-types: Yveltal, especially if specially defensive, completely shuts down Calyrex-S and can switch into any of its moves with near impunity bar Trick. Tyranitar can switch freely into all of Calyrex-S's attacks except the rare Leaf Storm and then force it out by threatening an OHKO with Foul Play. Tyranitar can then take advantage of the forced switch by setting up Stealth Rock or crippling a switch-in with Thunder Wave. Tyranitar is also vulnerable to Trick but continues to reliably switch into and force out Calyrex-S even after Trick. Yveltal and Tyranitar should also be wary of +2 Max Starfall, as it can OHKO them. Urshifu-S can force out Calyrex-S with Sucker Punch, but it cannot reliably switch into Astral Barrage, Leaf Storm, or Draining Kiss. While SubSeed Calyrex-S is built to take on some Yveltal sets, the threat of certain coverage moves is still great. Snarl OHKOes Calyrex-S through Substitute, rendering this set almost useless against Yveltal carrying it. Tyranitar normally carries Rock Blast or Roar, letting it simultaneously break Substitutes and deal damage or phaze Calyrex-S while it tries to set up.</p> <p><strong>Bulky Normal-types: Porygon2 can tank many of Calyrex-S's attacks due to its good bulk, heavily damage it with Foul Play, and pivot into another teammate with Teleport if Calyrex-S switches out. However, Porygon2 dislikes being crippled by Trick, limiting its ability to use its moves with ease while losing its Eviolite. Blissey, Chansey, and Porygon2 comfortably switch into Nasty Plot Calyrex-S if it's lacking Psyshock. However, Blissey gets OHKOed by boosted Psyshock, Chansey gets OHKOed by boosted Psyshock after minor chip damage, and Porygon2 has to watch out for +2 Max Mindstorm. With Astral Barrage as the only attack on the SubSeed set Normal-types are almost guaranteed to wall the set completely. With Taunt and Leech Seed damage, it can potentially wear down Blissey, Chansey, and Porygon2, but this is a very slow process and doesn't allow Calyrex-S to run Nasty Plot, leaving it weaker against other walls like Ho-Oh paired with Normal-types.</p> <p><strong>Revenge Killers: Calyrex-S can be revenge killed by a few Pokemon. Ditto can come in after Calyrex-S gets a KO and threaten to reverse sweep. Choice Scarf users such as Kyogre, Galarian Darmanitan, Zacian, and opposing Calyrex-S can force Calyrex-S out. Marshadow can pick off Calyrex-S with Shadow Sneak. Sand Rush Excadrill under sand can also revenge kill Calyrex-S, and it can set up after forcing Calyrex-S out. Priority moves such as Yveltal's Sucker Punch and Marshadow's Shadow Sneak OHKO Calyrex-S, forcing it out every time they come in. However, not all Yveltal have Sucker Punch, so it is important to scout for it. Nasty Plot Calyrex-S can also situationally beat all of these revenge killers if it's running Focus Sash and is at full health, although this is not a reliable form of counterplay, and the rare Substitute handles Ditto. SubSeed Calyrex-S can block revenge killing attempts behind a Substitute, but faster Pokemon like Pheromosa, Choice Scarf Calyrex-S, and Shadow Sneak Marshadow still pressure it.</p> <p><strong>Ho-Oh: Ho-Oh can safely switch into any attack, though is crippled by Trick. Cores featuring Ho-Oh and a Dark-type such as Tyranitar or Yveltal are incredibly hard for Calyrex-S to make progress against, as it can only cripple one foe with Trick. Ho-Oh's phazing ability and bulk to take even boosted hits lets it be a sturdy check to SubSeed Calyrex-S.</p> ",
    "sets": [
      {
        "name": "Choice Specs",
        "description": "<p>Calyrex-S is one of the strongest wallbreakers in AG, capable of shredding most common defensive Pokemon with ease thanks to its impressive firepower, highly spammable Astral Barrage, and Speed tier. Additionally, thanks to As One and the ability to Dynamax, Calyrex-S has tremendous snowballing potential. Psyshock lets Calyrex-S damage Blissey and Chansey while also hitting bulky Eternatus harder than Astral Barrage. Trick notably cripples Yveltal — the loss of Heavy-Duty Boots greatly impacts its ability to switch into Calyrex-S — while also crippling Blissey, Chansey, Porygon2, and Tyranitar so Calyrex-S's teammates can exploit them. Aromatherapy allows Calyrex-S to take advantage of the numerous switches that it forces by providing useful team support as a cleric. Alternatively, Nasty Plot gives Calyrex-S a way to boost its damage output after Trick removes its Choice Specs. Choice Specs maximizes Calyrex-S's damage output, notably allowing it to OHKO fast Zacian-C after Stealth Rock damage.</p> <p>Calyrex-S fits best on balance teams that appreciate its tremendous firepower and ability to revenge kill Zacian-C and can cover up its weakness to Yveltal. Tyranitar and specially defensive Yveltal make great teammates, soft checking most offensive Yveltal and helping Imposter-proof Calyrex-S. Xerneas and Zacian-C are also great teammates because they heavily pressure both Yveltal and Tyranitar. In return, Calyrex-S heavily threatens their most common check in Necrozma-DM. Offensive Yveltal is also a strong teammate, as it and Calyrex-S share checks in Tyranitar and opposing bulky Yveltal. Thus, each can weaken the other’s checks, allowing either one to sweep late-game. After Calyrex-S uses Trick, Substitute sweepers such as Zekrom and Zygarde-C can set up on a Choice-locked wall. Calyrex-S greatly appreciates Knock Off support from Pokemon like Yveltal, Ferrothorn, and Necrozma-DM in order to force bulky Yveltal to take Stealth Rock damage, putting it in range of a 2HKO from Astral Barrage. Knock Off also reduces the longevity of opposing Tyranitar, Porygon2, and Ho-Oh. Additionally, Stealth Rock support is invaluable, forcing Yveltal lacking Heavy-Duty Boots to take chip damage every time it comes in.</p> "
      },
      {
        "name": "Nasty Plot",
        "description": "<p>Nasty Plot Calyrex-S is one of the most lethal setup sweepers in AG due to its amazing Special Attack and Speed tier, powerful STAB move in Astral Barrage, and strong ability in As One. It can use Nasty Plot on forced switches from Pokemon such as Necrozma-DM, Zacian-C, and Lunala, giving it better firepower to break through bulky walls such as Yveltal, Ho-Oh, and specially defensive Eternatus if lacking Psyshock. Draining Kiss turns into Max Starfall during Dynamax, letting +2 Calyrex-S OHKO specially defensive Yveltal and OHKO Tyranitar after some chip damage. Baton Pass lets Calyrex-S take advantage of switch-ins such as Yveltal and Tyranitar by pivoting out and passing its Nasty Plot boosts to other special wallbreakers such as Life Orb Yveltal, Xerneas, and Life Orb Eternatus. Substitute stalls out Yveltal's Dynamax turns, blocks Sucker Punch from offensive Yveltal, and potentially stops Ditto from taking advantage of it. Psyshock is an option over Baton Pass, Substitute, or Draining Kiss to nail Blissey and Chansey and more immediately threaten specially defensive Eternatus. Life Orb significantly increases Calyrex-S's damage output, guaranteeing an OHKO on specially defensive Yveltal with +2 Max Starfall and dealing extra damage to bulky walls such as Ho-Oh, Eternatus, and Zygarde-C and offensive threats like Zacian-C and Groudon. Focus Sash is an alternative item to withstand an attack from threats like Ditto, Sucker Punch Yveltal, and Marshadow. However, Calyrex-S then has to be wary of Stealth Rock or Spikes breaking Focus Sash. Heavy-Duty Boots makes Calyrex-S immune to Sticky Web and tougher to wear down compared to Life Orb. It also pairs excellently with Baton Pass. Maximum Speed investment with a Timid nature allows Calyrex-S to outspeed Jolly Zacian-C and Speed tie with opposing Calyrex-S.</p> <p>Nasty Plot Calyrex-S's best fit is on bulky offense and hyper offense teams, where it can find the right support to weaken its extremely few checks. Special wallbreakers such as Life Orb Yveltal, Xerneas, and Life Orb Eternatus can benefit from Calyrex-S's Nasty Plot boosts if it's running Baton Pass. Sucker Punch Yveltal is an especially strong partner, as it can prevent Ditto from completely destroying a team once it has copied Calyrex-S, while specially defensive sets can take boosted Astral Barrage and Imposter-proof any sets without Draining Kiss relatively easily. Teammates that can pressure Yveltal and Tyranitar for Calyrex-S such as Zacian-C, Xerneas, Marshadow, and Kyogre are appreciated. On hyper offense teams, Shuckle can provide Sticky Web for Calyrex-S, which allows it to outspeed Choice Scarf Kyogre and other Calyrex-S, while Excadrill is a lead that removes damaging entry hazards and Sticky Web with Rapid Spin, which is especially helpful for Focus Sash Calyrex-S. Regieleki is a useful spinner as well, since it can force out threats like Yveltal and opposing Calyrex-S thanks to its STAB moves and unmatched Speed tier.</p> "
      },
      {
        "name": "Choice Scarf",
        "description": "<p>Choice Scarf Calyrex-S is able to outspeed virtually every boosted threat in Anything Goes, including Geomancy Xerneas, and boasts a spammable STAB move in Astral Barrage, As One, and beneficial utility moves, making it one of AG's most potent revenge killers. Astral Barrage OHKOes offensive Necrozma-DM and opposing Calyrex-S while heavily damaging Groudon, Zekrom and Zacian-C. Psyshock targets boosted Geomancy Xerneas, defeating it after significant chip, while enabling Calyrex-S to damage key defensive Pokemon such as Blissey and Eternatus. Trick enables Calyrex-S to cripple its best switch-ins such as Yveltal, Ho-Oh, and Tyranitar while thwarting major threats such as Dragon Dance Zygarde and Calm Mind Kyogre. Aromatherapy is useful because status is abundant in AG and Calyrex-S easily generates free turns to use it as it forces out Pokemon like Necrozma-DM.</p> <p>Choice Scarf Calyrex-S is one of the best countermeasures to offensive teams, especially Sticky Web teams. As such, it fits on a large variety of balance teams. In particular, teams weak to Geomancy Xerneas, Max Airstream Groudon, Dragon Dance Necrozma-DM, and opposing Calyrex-S appreciate its presence. However, Choice Scarf variants of Calyrex-S find it even more difficult to break through the Pokemon's two main switch-ins, Yveltal and Tyranitar, so offensive teammates which can deal with them, such as Zacian-C, Groudon, and Xerneas, are appreciated. In return, Calyrex-S can threaten Necrozma DM for Zacian and Xerneas while crippling pivots such as Ho-Oh and Blissey with Trick for Xerneas. Ferrothorn, Calm Mind Kyogre, and Zygarde are appreciated too for switching into and taking advantage of Yveltal and Tyranitar. In return, Calyrex-S, can clear their status ailments, which can be especially beneficial for offensive Zygarde. Marshadow forces Calyrex-S out, so counterplay such as defensive Zygarde, Eternatus, and pivots such as Ho-Oh is appreciated. Yveltal can Imposter-proof Calyrex-S, preventing Speed ties.</p> "
      },
      {
        "name": "SubSeed",
        "description": "<p>SubSeed Calyrex-S trades in the immediate power behind other offensive sets for a slower-paced wallbreaking set. Calyrex-S is able to very easily sweep unprepared teams with this set, but its lack of coverage and slow pace make it a higher-risk set than most due to its high vulnerability to certain threats such as Yveltal with Snarl and Tyranitar. Its main goal is to use the combination of Substitute + Leech Seed to force normal checks such as Yveltal to use healing moves, in which case it can either use Taunt to prevent them from recovering and continue chipping them down with Astral Barrage or set up with Nasty Plot to aim for a sweep from behind the Substitute. Astral Barrage should only be used against weakened foes or after boosting with Nasty Plot multiple times to conserve Astral Barrage's low PP, and Nasty Plot allows it to break through walls like Eternatus and Ho-Oh after they've been chipped. Leftovers helps to get as much HP back in combination with Leech Seed as possible so it can put up the highest number of Substitutes, and with 52 Defense EVs, its Substitute always survives an uninvested U-turn from Yveltal. Maximum Speed investment ensures that Calyrex-S can outrun Pokemon like Zacian-C naturally.</p> <p>Calyrex-S's natural offensive presence with just Astral Barrage is enough to support a lot of common Pokemon, and if it is successfully able to beat certain checks like Yveltal, it can easily sweep through teams or be very beneficial to its teammates weak to those checks. Zacian-C dislikes cores of Necrozma-DM, Zygarde-C, Lunala, and other physically defensive walls that can chip it down, which Calyrex-S can use to set up fairly well and break through them. Zacian-C also provides a good way of breaking Yveltal, Blissey, and a weakened Ho-Oh, which Calyrex-S greatly appreciates, especially if the opposing Yveltal has coverage to break this set. Many other physical wallbreakers like Swords Dance Groudon and Marshadow can bait in Yveltal wanting to hit them with Foul Play and use their Dynamax to break through Yveltal and other checks, opening up Calyrex-S a lot offensively for a sweep. Calyrex-S can potentially do the same for those Pokemon against Yveltal without ways to break past this set. Yveltal is also a near-required teammate given that this set is fairly susceptible to Ditto if not behind a Substitute, and Yveltal can also provide hazard control and has U-turn to get Calyrex-S in safely.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 360582, "username": "Guard"}, {"user_id": 464176, "username": "Icemaster"}, {"user_id": 426798, "username": "Geysers"}, {"user_id": 367227, "username": "baconeatinassassin"}, {"user_id": 491896, "username": "Rotten"}]}, {"name": "Grammar checked by", "members": [{"user_id": 302985, "username": "lotiasite"}, {"user_id": 517429, "username": "Finland"}, {"user_id": 331519, "username": "CryoGyro"}]}], "writtenBy": [{"user_id": 426798, "username": "Geysers"}, {"user_id": 491896, "username": "Rotten"}, {"user_id": 464176, "username": "Icemaster"}, {"user_id": 511624, "username": "Fc"}]}
  }
}