{
  "Arcanine": {
    "comments": "<h1>Other Options</h1> <p>Arcanine can use Close Combat for super effective damage on Steel-types like Heatran and Flash Fire Ferrothorn, but most Steel-types are already hit very hard by Flare Blitz. Morning Sun can be used for recovery; however, Arcanine is already difficult to chip down and losing coverage or priority is often not worth it. Toxic is an option to wear down Dauntless Shield users like Hippowdon and Mew.</p> <h1>Checks and Counters</h1> <p><strong>Ground-types: Ground-types faster than Arcanine, such as Garchomp and Zygarde-10%, are often able to threaten a KO on it immediately. Defensively, Swampert can take any hit from Arcanine and threaten it with its STAB moves.</p> <p><strong>Dauntless Shield Users: Dauntless Shield users such as Mew and Hippowdon are capable of surviving hits from Arcanine and pivoting into an offensive check or threatening a KO, but these Pokemon are threatened by Toxic.</p> <p><strong>Primordial Sea Users</strong>: Primordial Sea users such as Zapdos and Barraskewda are able to safely switch into Arcanine's Flare Blitz and threaten it out; however, they cannot switch in safely for fear of Arcanine's coverage moves.</p> ",
    "sets": [
      {
        "name": "Magic Guard Attacker",
        "description": "<p>Arcanine is a strong Fire-type attacker that is able to take advantage of Magic Guard to negate recoil from Flare Blitz and Wild Charge. Magic Guard allows it to ignore passive damage from entry hazards, recoil, and Life Orb, making it difficult to chip; this gives it great longevity for an offensive Pokemon. Arcanine's Fire-typing and decent bulk enables it to serve as an offensive check to common priority users, such as Zarude and Tapu Lele, and Genesect. Flare Blitz is Arcanine's primary STAB attack, letting it threaten common defensive Pokemon like Ferrothorn and Jirachi, as well as offensive Pokemon like Tapu Bulu and Dhelmise. Wild Charge is another recoil attack that benefits from Magic Guard and allows Arcanine to force out Pokemon like Flash Fire Corviknight and Tapu Fini. Play Rough is hits Dragon-types like Garchomp that resist Arcanine's other attacks. Extreme Speed is a great tool, allowing it to KO weakened offensive Pokemon like Tapu Koko, Barraskewda, and Zygarde-10%.</p> <p>Arcanine best fits on bulky offense teams that appreciate its offensive capabilities, but can also offer a strong defensive backbone to support it. Arcanine's solid coverage and high Base Power attacks make it a strong partner for other offensive Pokemon, such as Tapu Lele and Garchomp, as Arcanine is able to deal heavy damage or KO common Steel- and Flying-types like Jirachi and Corviknight that often serve as walls. Primordial Sea users like Barraskewda and Zapdos serve as strong offensive checks to Arcanine. As a result, Pokemon such as Zarude and Terrakion make strong teammates because of their ability to force out those checks reliably, while defensive Pokemon like Blissey and Tapu Fini are also appreciated for their ability to consistently switch into them. Arcanine is often forced out by fast Ground-types that can threaten an immediate KO, such as Garchomp and Zygarde-10%. Pokemon like Dauntless Shield Mew that can reliably switch into these threats make strong defensive partners. Arcanine also struggles with bulky walls that are not weak to its coverage moves, such as Mew and Dauntless Shield Hippowdon, so teammates that can poison or overload these threats like Terrakion are appreciated. Entry hazard setters such as Swampert and Ferrothorn make it easier for Arcanine to break past its checks.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 524664, "username": "Osake"}, {"user_id": 523866, "username": "UT"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 539897, "username": "iapt"}]}
  },
  "Alakazam": {"sets": [{"name": "Psychic Surge"}]},
  "Slowbro": {"sets": [{"name": "Defensive"}]},
  "Chansey": {"sets": [{"name": "Defensive"}]},
  "Zapdos": {
    "comments": "<h1>Other Options</h1> <p>Zapdos does not have any other viable coverage moves other than Weather Ball. Volt Switch can be used over Thunder, as it allows Zapdos to run Weather Ball. Zapdos's EVs can vary significantly, mostly depending on what it wants to outspeed. As mentioned above, 72 Speed EVs allows Zapdos to outspeed Modest maximum Speed investment Heatran, allowing Zapdos to either pivot out via U-turn or deal a large amount damage with Weather Ball, while 56 Speed EVs allow Zapdos to outspeed Adamant Tapu Bulu and then KO it with Hurricane. Maximum Speed investment can also be run on Zapdos to help its team's matchup against Tapu Lele, Genesect, and Adamant Zarude. Additionally, Zapdos can opt to run a more defensive spread to better fit into its role as a check to physical attackers such as Talonflame. Defog can also be run on Zapdos, but it is usually not a good option, as Zapdos already struggles with fitting all of the moves it wants.</p> <h1>Checks and Counters</h1> <p><strong>Blissey: Blissey, one of the tier's most common special walls, is very problematic for Zapdos, as it takes very little damage from both Hurricane and Thunder. This means that without an extreme amount of luck, Zapdos is never able to break it.</p> <p><strong>Desolate Land Users</strong>: Many Desolate Land users are able to comfortably switch in on Zapdos, taking its rain away and reducing the accuracy of its STAB attacks to 50% while also changing Weather Ball from a super effective hit to a resisted one.</p> <p><strong>RegenVest</strong>: Pokemon holding Assault Vest are difficult for Zapdos to break, as they take very little damage from Zapdos's attacks and can heal themselves easily thanks to Regenerator. Most of them, such as Silvally-Dragon, Swampert, and Jirachi, resist or are immune to either Thunder or Hurricane, allowing them to slowly pivot out against Zapdos and bring in a powerful breaker that threatens Zapdos.</p> <p><strong>Offensive Rock- and Ice-types: While Zapdos is bulky enough to take neutral hits without much investment, it is still weak to powerful breakers with super effective STAB moves such as Terrakion and Mamoswine that usually outspeed and OHKO it.</p> <p><strong>Volt Absorb Corviknight: Zapdos has a very hard time breaking Volt Absorb Corviknight, as it either resists or is immune to both of its STAB moves and can slowly pivot against Zapdos with U-turn to bring in a breaker that threatens Zapdos out.</p> ",
    "sets": [
      {
        "name": "Primordial Sea",
        "description": "<p>Zapdos fills the role of a bulky Flying-type capable of both offensively and defensively checking many Pokemon in the AAA metagame, such as Talonflame, Desolate Land Heatran, Volcarona, and Moltres, as well as most Fighting-types including Galarian Zapdos. Zapdos's STAB moves allow it to hit almost every relevant Pokemon for at least neutral damage while also having a 30% chance to cripple something with paralysis or confusion. Weather Ball is another attacking option, most notably hitting Desolate Land Heatran for significant damage. U-turn allows Zapdos to pivot out on a predicted switch to a counter, which is a great trait to have in a momentum-reliant tier like AAA and allows it to still make progress against teams with reliable answers to it. Roost gives Zapdos significant longevity and allows it to absorb hits over the course of a longer battle. Zapdos's EVs are very customizable and can be changed depending on what a team needs it to do. The given spread maximizes Zapdos's bulk and power while still outspeeding Modest Heatran.</p> <p>Zapdos can fit on many different team archetypes because of its ability to take neutral hits while threatening powerful attacks back. If Zapdos is not running Weather Ball, it is very weak to Desolate Land users such as Heatran, as it resists Hurricane and takes neutral damage from Thunder, as well as lowering the accuracy of both of those moves to 50% due to the harsh sun. Thus, Zapdos appreciates Pokemon such as Assault Vest Silvally-Dragon that can switch in on the Fire-types safely and then pivot out. Zapdos pairs very well with Pokemon that can threaten specially defensive Pokemon such as Blissey and Assault Vest Swampert that take neutral damage from its STAB attacks. Good partners for this include Zarude and Terrakion. These attackers pair very well with U-turn, as they are able to take advantage of the momentum Zapdos creates. In return, Zapdos can threaten their walls such as Corviknight.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523886, "username": "UT"}, {"user_id": 524664, "username": "Osake"}]}, {"name": "Grammar checked by", "members": [{"user_id": 241023, "username": "Kris"}]}], "writtenBy": [{"user_id": 525446, "username": "Ducky"}]}
  },
  "Zapdos-Galar": {
    "comments": "<h1>Other Options</h1> <p>Tinted Lens, Tough Claws, and Adaptability are all decent options, but they are usually outclassed by Terrakion, and Galarian Zapdos can be quickly worn down by Brave Bird's recoil. Bulk Up can be used to overwhelm defensive cores, but it lacks general utility since it cannot afford to run U-turn.</p> <h1>Checks and Counters</h1> <p><strong>Zapdos: Ironically, Galarian Zapdos's cousin in Kanto is one its best answers, resisting both STAB moves and U-turn and threatening it with Hurricane and Thunder.</p> <p><strong>Tapu Koko</strong>: Tapu Koko resists both Galarian Zapdos's STAB moves, outspeeds it, and can threaten it with its own STAB moves or steal momentum with U-turn, while healing any damage with Roost.</p> <p><strong>Triage Fairy-types</strong>: Triage Tapu Lele and Togekiss can use their powerful Draining Kiss to KO Galarian Zapdos before it can attack.</p> <p><strong>Dauntless Shield Mew: Despite fearing Taunt, Dauntless Shield Mew can comfortably tank Galarian Zapdos's attacks and threaten it back with Ice Beam.</p> <p><strong>Wandering Spirit</strong>: While rare, Wandering Spirit users such as Corviknight and Landorus-T are annoying for Galarian Zapdos, as they force it to take recoil or steal Regenerator and prevent it from healing.</p> ",
    "sets": [
      {
        "name": "Magic Guard Life Orb",
        "description": "<p>Thanks to its great Attack and powerful STAB moves, Galarian Zapdos is a powerful wallbreaker in AAA. Magic Guard avoids every form of chip damage, including Stealth Rock, Rocky Helmet, Toxic, Life Orb, and Brave Bird recoil, allowing it to fire off powerful attacks with low risk. Brave Bird is a strong Flying-type STAB move that has good neutral coverage and 2HKOes common defensive staples such as Tapu Fini, Swampert, and Mandibuzz. Thunderous Kick works particularly well in conjunction with Brave Bird, hitting Steel-types such as Heatran and Corviknight that resist Brave Bird; it also drops the foe's Defense, easing predictions, and lets Galarian Zapdos KO physically defensive Tapu Fini after Stealth Rock by following up Thunderous Kick with Brave Bird. Thunderous Kick is also good at wearing down Dauntless Shield users that can't reliably threaten Galarian Zapdos such as Hippowdon and Skarmory lacking Brave Bird. U-turn allows Galarian Zapdos to keep momentum even against its checks such as Zapdos and Dauntless Shield Mew, while chipping them a bit. It also severely damages Mew after a Defense drop, forcing it to recover health. Taunt is a neat option to shut down Pokemon such as Corviknight and Mew that would try to heal or burn Galarian Zapdos with Will-O-Wisp, allowing it to wear them down through the course of a game; however, Taunt is risky because the opponent might use Brave Bird or Ice Beam instead. Close Combat is another option to pass through Flash Fire Corviknight easily, as well as OHKOing some threats such as Ferrothorn or physically defensive Heatran that Thunderous Kick doesn't KO. Jolly nature is usually preferred to at worst tie with max Speed Kantonian Zapdos, allowing Galarian Zapdos to Taunt it or kill it if it's weakened, but an Adamant nature can be used to maximize damage while still outspeeding defensive Zapdos.</p> <p>Galarian Zapdos fits best on balance teams that can bring it in several times in order to wallbreak efficiently. It likes partners like Barraskewda, Zygarde-10%, and Lucario that share checks with it in order to overwhelm them, especially in conjunction with Taunt. Entry hazard support from Pokemon like Ferrothorn, Skarmory, and Heatran is greatly appreciated in order to wear down Galarian Zapdos's checks. Pokemon that can take advantage of Zapdos and Mew such as Desolate Land Heatran, Inteleon, and Tapu Lele are also good teammates. Galarian Zapdos appreciates strong answers to Pokemon that threaten it out such as Tapu Lele, Talonflame, and Azelf, so partners like Jirachi and Flash Fire Corviknight are good teammates. It also requires a check to Zapdos, which is its most consistent check, so specially defensive Pokemon like Blissey or RegenVest Swampert are mandatory. Lastly, fast revenge killers such as Tapu Koko and Azelf are appreciated to alleviate Galarian Zapdos's middling Speed.</p> "
      },
      {
        "name": "Scarf Regenerator",
        "description": "<p>Thanks to its good defensive typing and physical bulk, Galarian Zapdos is a good check to common physical attackers and a solid revenge killer. With Choice Scarf equipped, it can switch into threats like Choice Band Zygarde-10%, Zarude, and Terrakion, threaten them with its STAB moves, while remaining healthy thanks to Regenerator. It can also revenge kill special attackers such as Inteleon and Latios, but it is not able to switch into them. U-turn allows Galarian Zapdos to pivot out on foes it forces out and activate Regenerator. Brave Bird and Close Combat are its main STAB moves and threaten foes like Zarude, Terrakion, and Heatran. In the last moveslot, Stomping Tantrum is an option to revenge kill Tapu Koko if it is weakened, while Counter can be used to punish physical attackers, particularly Barraskewda's Flip Turn. 148 Speed EVs, along with Choice Scarf, allows Galarian Zapdos to outspeed Barraskewda, while the EVs in HP and Defense, in conjunction with an Impish nature, guarantee that it is never OHKOed by Terrakion's Stone Edge after Stealth Rock. The remaining EVs are invested in Attack in order to maximize its damage, in particular against Barraskewda.</p> <p>Scarf Regenerator Galarian Zapdos fits best on bulky offense teams that appreciate having a revenge killer that is also an offensive check to Terrakion and Zarude. Partners that are forced out by Zarude and Terrakion such as Tapu Koko, Ferrothorn, and Heatran, appreciate Galarian Zapdos checking them. Due to Galarian Zapdos's relatively low offensive power, many bulky Pokemon such as Tapu Fini and Corviknight can freely switch into it; as such, partners that can take advantage of them such as Tapu Koko and Tapu Lele are appreciated. Strong answers to Zapdos, Azelf, Tapu Koko, and Tapu Lele, are mandatory as they can threaten Galarian Zapdos with their powerful STAB moves, so teammates like Jirachi, Bulletproof Ferrothorn, and Blissey are recommended. Galarian Zapdos can't reliably check several physical attackers such as Talonflame and opposing Galarian Zapdos, so secondary checks to those, such as Toxapex and Dauntless Shield Mew, are appreciated.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523886, "username": "UT"}, {"user_id": 375662, "username": "Isaiah"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523886, "username": "UT"}]}], "writtenBy": [{"user_id": 524664, "username": "Osake"}]}
  },
  "Moltres": {"sets": [{"name": "Magic Guard"}, {"name": "Desolate Land"}]},
  "Mew": {
    "comments": "<h1>Other Options</h1> <p>Mew is one of the few viable Spikes users in the tier. Thanks to Foul Play, Mew can also function as an Unaware wall, although Mandibuzz is usually better for this role. Mew has a variety of other support moves—Taunt, Defog, Toxic Spikes, Stealth Rock, Whirlwind, Heal Bell—that can satisfy particular teams' needs, but in many cases there are better users. Mew can also pull off a wide range of offensive sets—No Guard + Zap Cannon, Dragon Dance + Guts + Facade, Weakness Policy + Unburden—that are all generally outclassed by other users, but can have a nice surprise factor on Mew. Mew is also one of the better weather or Terrain setters, but these teams are generally inconsistent.</p> <h1>Checks and Counters</h1> <p><strong>Fire-types: Defensive Mew sets are heavily reliant on Will-O-Wisp to check physical attackers, making it a poor check to Cinderace, Talonflame, and Entei.</p> <p><strong>Zarude and Dhelmise: Zarude and Dhelmise are powerful physical attackers that can threaten Mew with their super effective STAB options. Additionally, Zarude also ignores Dauntless Shield and Cosmic Power boosts thanks to Darkest Lariat.</p> <p><strong>Pivoting Attackers</strong>: Genesect, Galarian Zapdos, and Barraskewda are hard for Mew to check, as they do respectable damage to it while pivoting, wearing it down.</p> ",
    "sets": [
      {
        "name": "Dauntless Shield",
        "description": "<p>Dauntless Shield Mew is one of the sturdiest physical walls in the game. With its good natural bulk and Dauntless Shield, it can reliably switch into dangerous physical wallbreakers like Terrakion and Zygarde-10% and threaten them with a burn. Ice Beam allows Mew to hit Garchomp, Zygarde-10%, and Landorus-T hard, while Body Press deals more consistent damage and nails targets like Ferrothorn and Terrakion. Will-O-Wisp allows it to force out most physical attackers. The last moveslot is usually a pivoting move; Teleport allows it to bring in a teammate safely without being blocked by Ground-types, while Volt Switch deals chip damage and is not shut down by Taunt. U-turn is also an other option to avoid Taunt.</p> <p>Mew is a solid choice for any playstyle that is looking to patch up a weakness to strong physical wallbreakers. Frail attackers that have a hard time getting in like Barraskewda, Azelf, and Tapu Lele appreciate Mew getting them in safely with a slow pivot. Strong Defoggers like Corviknight and Tapu Fini are recommended to ease Mew's pivoting. Mew is also worse at checking Fire-types due to their immunity to Will-O-Wisp; Primordial Sea Zapdos makes a great partner to cover that weakness. Mew is also unable to check strong Dark- and Ghost-types like Zarude and Dhelmise, so partners like Corviknight that can switch into those are helpful.</p> "
      },
      {
        "name": "Choice Scarf Regenerator",
        "description": "<p>Thanks to its high natural bulk, Choice Scarf Regenerator Mew is a fantastic pivot and utility check to a wide range of threats like Terrakion, Zygarde-10%, and Tapu Lele. Mew can be switched in aggressively and rely on pivoting and Regenerator to stay healthy, preserving momentum for its team. For its pivoting move, U-turn has no immunities, but Flip Turn can pressure some key threats like Terrakion more if they try to stay in. Will-O-Wisp cripples physical attackers, and Trick frustrates a bulky foe by giving them its Choice Scarf. Psychic allows it to actually do damage when needed, especially cleaning up weakened fast threats late-game, while Gunk Shot threatens Fairy-types like Tapu Lele and Tapu Koko. Mew's Speed investment allows it to outspeed Barraskewda while still having as much physical bulk as possible.</p> <p>Mew is useful on offensive teams to check a wide range of physical threats while maintaining momentum. It is especially potent against Choice Band users, as it is rarely OHKOed by any move, and it can then pivot to a proper check that resists the attack while recovering HP with Regenerator. Since Mew is efficient at pivoting, it pairs well with powerful wallbreakers like Tapu Lele and Terrakion, which enjoy the free turns it generates. Mew does struggle to check Fire-types, as they are immune to Will-O-Wisp and are often immune to Flip Turn with Desolate Land, so strong answers to them like Primordial Sea Zapdos make great partners. Mew can also be overwhelmed by repeated strong attacks, since it is reliant on Regenerator to recover, so other bulky switch-ins like Tapu Fini, Genesect, and Jirachi make good partners as well.</p> "
      },
      {
        "name": "Cosmic Power",
        "description": "<p>Cosmic Power Mew is a bulky wincon with Roost that can be extremely difficult to KO, allowing it to set up multiple times. Magic Guard provides a complete immunity to Toxic damage, such as from Toxic Spikes and Silvally's Poison Fang, and allows it to run Life Orb without a drawback, while Magic Bounce also protects against Taunt, Thunder Wave, and Roar and Whirlwind. Magic Bounce also can provide mid-game utility by bouncing back entry hazards. Cosmic Power boots its considerable bulk while powering up Stored Power and Body Press. Psychic is an other option with Magic Guard and Life Orb to beat Prankster Toxapex, which otherwise walls Mew. Maximum physical bulk makes setup easier while also powering up Body Press.</p> <p>Cosmic Power Mew is commonly found on hyper offense teams, or as the wincon on bulky teams. Most of the support Mew needs is removing specific hard counters, after which it sweeps relatively reliably. Unaware users and Prankster Toxapex—if Mew lacks Psychic—stop it, so lures like Psychic Volcarona make great partners. Zarude ignores Defense boosts with Darkest Lariat, with Pokemon like Corviknight  providing adequate counterplay. Tapu Fini can answer Dragon Tail users like defensive Garchomp.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 524664, "username": "Osake"}, {"user_id": 375662, "username": "Isaiah"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 523866, "username": "UT"}]}
  },
  "Heracross": {
    "comments": "<h1>Other Options</h1> <p>Heracross can run Choice Scarf in order to alleviate its mediocre Speed, though then it lacks breaking power. A Swords Dance set with both STAB moves and Knock Off can be considered in order to pass through bulky walls such as Hippowdon, but Heracross's poor bulk and Speed make it difficult to use, and this set is usually outclassed by Terrakion.</p> <h1>Checks and Counters</h1> <p><strong>Faster threats: Heracross's main weakness lies in its mediocre Speed and bulk, which means that almost everything faster than it such as Talonflame, Zapdos, and Azelf can KO it before it attacks.</p> <p><strong>Ghost-types: While rare, Ghost-types such as Dhelmise and Palossand can be a pain for Heracross as they stop it from freely using Close Combat and force it to rely on Megahorn and Knock Off to properly wallbreak the opposing team.</p> <p><strong>Dauntless Shield/Intimidate Walls: Without the boost from an ability like Adaptability, Heracross struggles to break through the sturdiest bulky walls such as Dauntless Shield Hippowdon and Skarmory.</p> ",
    "sets": [
      {
        "name": "Choice Band Tinted Lens",
        "description": "<p>Thanks to its high Attack and strong STAB moves, Heracross is an extremely powerful wallbreaker in AAA. Tinted Lens is particularly helpful on Heracross, as it can 2HKO Pokemon like Tapu Fini, Landorus-T, and Toxapex that resist its STAB moves. Close Combat is Heracross's primary attack and capitalizes on the lack of Ghost-types in the AAA metagame. Megahorn is a powerful tool to beat Dauntless Shield Mew, a feat most other physical breakers fail to accomplish, and other Psychic-types like Slowbro and Latias. Knock Off removes items from switch-ins such as Dauntless Shield Hippowdon and Intimidate Corviknight, making them easier to chip with entry hazard damage. The last moveslot is very situational, as Heracross usually just fires off powerful Close Combats. Spikes is an option to punish switches to a reliable check such as Dauntless Shield Hippowdon; alternatively, Focus Punch 2HKOes Corviknight on the switch and forces a lose-lose situation: Roost risks being OHKOed by a second Focus Punch, while Brave Bird or switching out leaves Corviknight at low health and unable to check physical attackers. The given EV spread maximizes Heracross's power and Speed, and an Adamant nature allows better rolls to 2HKO and OHKO the likes of Landorus-T and Genesect, respectively.</p> <p>Heracross fits best on balance teams that can bring it on the field often to wallbreak. It appreciates fast pivots like Azelf, Tapu Koko, and Genesect that can bring it in on special walls such as Blissey and Jirachi that it can threaten. Tapu Koko is a notable partner, as it can freely switch in on Corviknight and Skarmory, the most common checks to Heracross, and threaten them with a powerful Thunderbolt. Heracross requires Stealth Rock and Spikes support from partners like Ferrothorn, Skarmory, and Heatran to wear down its checks, especially since Knock Off removes their passive recovery. It also appreciates Toxic Spikes from Toxapex and Nidoqueen in order to wear down grounded Pokemon such as Dauntless Shield Hippowdon and Palossand. Heracross's defensive utility is almost nonexistent and strong answers to Psychic-, Fire-, and Flying-types are needed, such as Ferrothorn, Toxapex, and Heatran. Lastly, Heracross appreciates entry hazard removal from Defoggers like Mandibuzz and Corviknight or Rapid Spin from RegenVest Blastoise to maximize its switch-in opportunities.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523883, "username": "UT"}, {"user_id": 375662, "username": "Isaiah"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523883, "username": "UT"}]}], "writtenBy": [{"user_id": 524664, "username": "Osake"}]}
  },
  "Skarmory": {
    "comments": "<h1>Other Options</h1> <p>Intimidate allows Skarmory to check Galarian Zapdos and Tough Claws Zarude better, but is otherwise not as useful as Dauntless Shield.</p> <h1>Checks and Counters</h1> <p><strong>Specially Offensive Pokemon: Skarmory has a middling Special Defense stat, so even neutral special attacks and even some resisted ones from strong offensive threats can 2HKO it. Examples include Sheer Force Tapu Lele and Latios. Tapu Koko and Zapdos deserve a special mention thanks to their Electric STAB attacks.</p> <p><strong>Fire-type Pokemon: If Skarmory doesn't have Flash Fire, Fire-type attacks from Heatran and Choice Band Cinderace can OHKO it.</p> <p><strong>Strong Physical Wallbreakers: If opting out of Dauntless Shield, strong physical wallbreakers like Barraskewda and Terrakion can 2HKO Skarmory on the switch.</p> <p><strong>Magic Bounce: If Skarmory doesn't have Mold Breaker, Magic Bounce turns Skarmory's Spikes against it and also blocks Whirlwind and Toxic. Bulky Magic Bounce users with recovery that can handle its attacks like Mew can then proceed to set up or pivot to gain momentum.</p> ",
    "sets": [
      {
        "name": "Physically Defensive",
        "description": "<p>Skarmory sets itself apart from Corviknight thanks to its access to utility moves like Whirlwind, Toxic and especially Spikes. Body Press takes advantage of its high Defense stat, which is notably higher than Corviknight's, and can 2HKO Heatran and Zarude as well as OHKO Terrakion. Brave Bird is an alternative that hits foes such as Dhelmise, Tapu Bulu, and Galarian Zapdos harder. Skarmory usually finds ample opportunities to set multiple layers of Spikes throughout a game to wear down the opposing team. Roost helps Skarmory stay healthy to continuously check threats like Zarude and Garchomp. Whirlwind prevents setup sweepers from exploiting Skarmory's passivity and also synergizes well with Spikes. Iron Defense is an option on Body Press sets that still checks setup sweepers and also makes Skarmory less passive. Another option is Toxic, which helps wear down both passive foes like Mandibuzz and setup sweepers like Dhelmise. Leftovers gives Skarmory extra recovery, while Rocky Helmet is an option that punishes contact moves. Skarmory can run several different abilities. Dauntless Shield maximizes Skarmory's defensive capabilities and Body Press damage. Wandering Spirit, especially combined with Rocky Helmet, deters U-turn and Flip Turn from Regenerator pivots such as Swampert and Landorus-T, and also lets Skarmory serve as an emergency check to sweepers that heavily rely on their ability such Magic Guard Talonflame and Triage Tapu Lele. Flash Fire negates one of its weakness and allows it to surprise dangerous Fire-type such as Volcarona and Desolate Land Heatran with Brave Bird and Body Press, respectively. It also allows Skarmory to check the plethora of physical Fire-types like Talonflame and Cinderace that can be hard to account for otherwise.</p> <p>Skarmory's ability to set Spikes make it a better fit on stall teams compared to Corviknight, in particular entry hazard stack teams. Powerful offensive threats like Tapu Lele and Terrakion appreciate Spikes to nab more KOs. Offensive threats with a pivot move like Tapu Koko and Barraskewda can also rack up Spikes damage while still keeping offensive momentum by forcing additional switches. Heatran can set entry hazards alongside Skarmory, threaten to eliminate entry hazard removers with Magma Storm and Taunt, and also check Genesect. In return, Skarmory can cover for Heatran's weakness to Ground, and Dauntless Shield variants can also handle dangerous Fighting-types like Terrakion. Many Ground-type Pokemon also make for good partners, as they can take on Electric attacks and set Stealth Rock. Swampert and Garchomp are notable partners thanks to their resistance to Fire. Special walls are needed, as Skarmory invites many special attackers in when it set Spikes. Blissey forms the famous SkarmBliss core, taking on dangerous special threats like Zapdos and Sheer Force Tapu Lele while regaining momentum with Teleport while Skarmory handles strong physical attacks that Blissey struggles against. Pixilate Tapu Koko is one of the most dangerous physical threats that Skarmory can't properly handle regardless of its ability choice, so it's vital to have a teammate that answers it such as Ferrothorn or Nidoqueen. Without Dauntless Shield, strong physical wallbreakers like Terrakion can 2HKO Skarmory, which partners like Mew and Palossand can deal with. Physical Fire-types such as Cinderace and Talonflame also pose a threat should it forgo Flash Fire, making Zapdos and the aforementioned Swampert great teammates.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 524664, "username": "Osake"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 500884, "username": "longhiep341"}]}
  },
  "Blissey": {
    "comments": "<h1>Other Options</h1> <p>Blissey can run four status moves, using Heal Bell, Stealth Rock, or another status move over Seismic Toss. Shed Shell can be used to easily switch out of Heatran, especially Taunt variants. Magic Guard is an option for Blissey that allows it to ignore passive damage and check Pokemon that frequently utilize it such as Heatran. Unaware used in conjunction with Counter can eliminate unsuspecting physical attackers.</p> <h1>Checks and Counters</h1> <p><strong>Special Pivots: Special attackers that utilize pivot moves such as Azelf, Zapdos, and Tapu Koko can be hard for Blissey to handle. These are especially difficult for the Magic Bounce set as it loses the chance to recover.</p> <p><strong>Setup Sweepers: Pokemon such as Tapu Koko and Volcarona that use Magic Guard with setup are able to take advantage of Blissey's natural passivity, making them much more difficult to deal with.</p> <p><strong>Heatran: With the combination of Magma Storm and Taunt, Heatran can trap Blissey on the switch and KO it. The Mold Breaker sets can even do this to Magic Bounce Blissey.</p> ",
    "sets": [
      {
        "name": "Defensive Pivot",
        "description": "<p>Blissey is able to check virtually every special attacker while also gaining momentum by pivoting with Teleport. Blissey can utilize Regenerator to function as a long-lasting special wall and offset its natural passivity with frequent pivoting or opt for Magic Bounce to block entry hazards and status moves such as Toxic and Taunt. Seismic Toss is Blissey's only attacking option and allows it to avoid being completely crippled by Taunt. Soft-Boiled provides Blissey with instant recovery and can help stall out opponents, although the Regenerator set usually prefers to recover health by pivoting. Teleport allows Blissey to slow pivot to bring in other team members that can deal with the present threat and has excellent synergy with Regenerator, allowing it to survive late into matches and spend fewer turns recovering. Blissey's 4th move slot is flexible and can be filled according to team needs. Toxic is useful to chip down switch-ins, while Thunder Wave cripples attackers such as Tapu Lele and Genesect. Heal Bell provides cleric support to bulkier teams; however, this leads to Blissey being even more passive. Maximum HP and Defense EVs allow Blissey to improve its poor physical bulk, while a Calm nature improves the damage rolls from prominent special attackers such as Primordial Sea Inteleon and Primarina.</p> <p>Blissey fits well on balance and bulky offense teams that benefit from its ability to check special attackers and pivot with slow Teleports. Frail offensive Pokemon such as Terrakion, Barraskewda, and Cinderace enjoy having Blissey as a teammate due to its ability to switch into special revenge killers including Triage Tapu Lele, as well as special Primordial Weather users such as Heatran and Zapdos. Blissey is very vulnerable to strong physical attackers such as Terrakion, Zarude, and Barraskewda; Corviknight and Tapu Fini are able to sponge physical attacks aimed at Blissey. It also struggles to properly deal with special pivots like Zapdos, Azelf, and Tapu Koko that are able to repeatedly bring in these powerful physical attackers. Blissey struggles to deal with Mold Breaker Heatran despite its role as a special wall because of Heatran's access to Taunt, (comma) which cripples Blissey; Blissey likes having secondary switch-ins such as Swampert on its teams to handle these threats. Blissey rarely beats Pokemon itself and can struggle with setup sweepers, so it appreciates having priority users such as Zarude and Tapu Lele on its team to pivot into.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 524664, "username": "Osake"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 539897, "username": "iapt"}]}
  },
  "Entei": {
    "comments": "<h1>Other Options</h1> <p>Entei can run a Desolate Land set with Eruption, Weather Ball, and Solar Beam, as it can beat common switch-ins like Swampert. Entei can also choose to run abilities such as Refrigerate, Galvanize, and Pixilate, to increase Extreme Speed’s damage and threaten Corviknight and Garchomp. Entei can also run Tinted Lens in order to break through checks like Swampert. Entei can also use Curse to better pressure opposing teams. Magic Guard is generally preferred, however, to avoid getting worn down quickly. Sacred Fire can also be run over Flare Blitz in order to burn targets, but its low PP and lower Base Power means Flare Blitz is almost always preferred on Magic Guard Sets.</p> <h1>Checks and Counters</h1> <p><strong>Physically Defensive Fire-resistant Pokemon: Swampert, Garchomp, and Toxapex take very little damage from Entei's primary move and can usually force it out.</p> <p><strong>Dauntless Shield Users: Dauntless Shield Mew and Hippowdon are able to avoid major damage from Entei, and they can pivot out or set up Stealth Rock on it. However, they all fear being poisoned by Toxic and can be worn down over the course of a game.</p> <p><strong>Primordial Sea Barraskewda and Zapdos: Primordial Sea Barraskewda and Zapdos can switch in on a predicted Fire-type move, force Entei out, and pivot on switch-ins.</p> <p><strong>Flash Fire Corviknight</strong>: Flash Fire Corviknight can switch into all of Entei’s attacks and slow pivot to a teammate that threatens it.</p> <p><strong>Faster Offensive Pokemon</strong>: Entei can be forced out by many fast offensive Pokemon like Talonflame, Tapu Koko, and Azelf, which threaten to OHKO or majorly damage Entei.</p> ",
    "sets": [
      {
        "name": "Magic Guard Life Orb",
        "description": "<p>Entei is a hard hitting Fire-type with access to priority. Entei’s decent natural bulk and Magic Guard, which prevents entry hazard damage and Life Orb recoil, makes it hard to chip it down. Recoil free Flare Blitz lets Entei force out common defensive Pokemon such as Corviknight and Jirachi, as well as common Grass-type Pokemon such as Zarude and Dhelmise. Entei’s Fire typing allows it to offensively check common Triage Pokemon such as Togekiss and Tapu Bulu, as it resists Draining Kiss and Horn Leech. Stomping Tantrum allows Entei to threaten Electric- and Fire-type Pokemon such as Primordial Sea Tapu Koko and opposing Entei. Extreme Speed allows Entei to KO weakened fast offensive threats such as Barraskewda and Zygarde-10%. Toxic is used to chip down defensive Pokemon such as Swampert and Tapu Fini, who otherwise take little damage from Entei’s attacks. Toxic has extra synergy with Stomping Tantrum, as if Toxic fails, Stomping Tantrum is doubled in power next turn, which is particularly valuable against Toxapex. Stone Edge can be run over Stomping Tantrum to hit Zapdos and Talonflame. An Adamant nature is used to take advantage of Entei’s high Attack stat while still outspeeding most defensive threats. If using Stone Edge, a Jolly nature can be run in order to Speed tie Zapdos.</p> <p>Entei can fit on most teams, but works best on balance and bulky offense teams. Entei appreciates Pokemon such as Zapdos and Tapu Koko that can force out checks like Toxapex. Entei pairs well with Terrakion and Zarude, as it can threaten out Corviknight for them, and in return they pressure Swampert, one of Entei’s most reliable checks. Primordial Sea users like Zapdos and Barraskewda threaten Entei tremendously, so reliable revenge killers and switch-ins like Genesect and Tapu Fini make great teammates. Entei pairs well with Pokemon who can provide entry hazard support such as Swampert, helping Entei wear down its checks faster. Entei also appreciates Electric-type Pokemon such as Tapu Koko who can force out bulky Water-types and Flash Fire Corviknight who commonly switch in on Entei. Since Entei has no form of recovery, it appreciates teammates that can bring it in safely with a slow pivot like Swampert and Mew.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 524664, "username": "Osake"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 525446, "username": "Ducky"}]}
  },
  "Swampert": {
    "sets": [
      {
        "name": "Physically Defensive",
        "description": "<p>Swampert's great natural bulk and excellent typing make it one of the best defensive pivots in the metagame. It soft checks numerous threats such as Genesect, Talonflame, and Tapu Koko as well as providing Stealth Rock, which lets it fit on a wide variety of balance and offense teams. Flip Turn is Swampert's main attack, letting it keep momentum, especially against Defoggers, and regain health with Regenerator. Earth Power is an option over Earthquake to be less crippled by burn, or if the team has a Grassy Terrain setter. Toxic punishes sweepers that would like to use Swampert as setup fodder, as well as a major Defogger in Tapu Fini. Roar is an option over Toxic to phaze foes, especially Magic Guard Pokemon, which don't fear Toxic. Regenerator keeps Swampert healthy throughout the game, and Rocky Helmet chips opposing pivots while punishing physical threats. Lastly, the 0 Speed IVs and Relaxed nature allow it to slow pivot on Corviknight.</p> <p>Swampert's capacity to sponge physical moves makes Pokemon such as Blissey or users of Assault Vest good partners. Coupled with Corviknight, Swampert can check almost all physical threats in the tier and, if you add Blissey, create a strong defensive core. Offensively, strong wallbreakers such as Terrakion and Sheer Force Tapu Lele appreciate Swampert bringing them safely against Pokemon that they can threaten, such as Zapdos or Corviknight, respectively. Solid answers to Grass-types like Zarude and Dhelmise are required when using Swampert, like Corviknight, as they can come in relatively freely on an expected Earthquake or Stealth Rock and threaten it. In addition, Swampert appreciates secondary switch-ins to Fire-types such as Volcarona, Talonflame, and Desolate Land Heatran, as it cannot reliably check most of them, so physically defensive Water-types such as Tapu Fini or specially defensive Pokemon like Blissey and RegenVest Silvally-Dragon are appreciated.</p> "
      },
      {
        "name": "RegenVest",
        "description": "<p>With Assault Vest equipped, Swampert becomes a solid special wall against various threats such as Zapdos and Azelf. Flip Turn keeps the momentum and lets Swampert recover health while doing decent damage due to its respectable Attack. Beyond Flip Turn, this set's moveset is quite flexible. Its secondary STAB move can be either Earthquake, for greater damage overall, or Earth Power, as Swampert is prone to being burned and sometimes pairs with Grassy Terrain setters. Thanks to its insane special bulk, RegenVest Swampert can use Mirror Coat to punish special threats that it cannot hit hard such as Zapdos or Tapu Fini; however, Counter is a neat option to punish U-turn from Genesect or Flip Turn from Barraskewda, which it handles thanks to its great overall bulk. Counter can also punish opposing Swampert's Flip Turn if you don't want to risk the Speed tie. Stone Edge is a great option to hit Primordial Sea Zapdos, as well as punishing Volcarona and Talonflame, but Scald can be used instead to burn defensive Pokemon such as Corviknight or opposing Swampert, and it also prevents physical threats such as Zarude from coming in freely. 0 Speed IVs and a Sassy nature allow Swampert to slow pivot on Corviknight.</p> <p>Swampert and Corviknight cover each other's typing weaknesses quite well, combine to handle both special and physical threats, and form a pivoting core. Tapu Fini is also a good teammate, providing Defog support and soft checking many of the physical threats of the tier, while Swampert checks most of the special threats. Offensively, all the Pokemon that greatly appreciate safe entry from slow pivoting make good partners, like Terrakion, Barraskewda, and Heatran. This set's main weakness is its dependence on Assault Vest to check special threats, which makes it particularly vulnerable to Knock Off. Pokemon that can absorb Knock Off such as Zamazenta-C make great partners, and both usefully resist Grass for Swampert as well.</p> <h1>Other Options</h1> <p>Utility Umbrella can be used over Rocky Helmet to check Primordial Sea Barraskewda, but it's a niche option and should be used only if your team is really weak to Barraskewda, as losing Rocky Helmet makes Swampert really passive. Several other move options are possible on the RegenVest set, depending on what you want to cover. Whirlpool allows Swampert to wear down or eliminate passive threats such as Tapu Fini and Skarmory that think they are safe against it—especially when they know it’s running Assault Vest. Ice Beam and Ice Punch hit Garchomp to prevent it from setting up in front of Swampert. Lastly, in offensive teams, Eject Button can be used to grab some huge momentum and immediately bring a powerful wallbreaker onto the field, but it too is a niche option.</p> <h1>Checks and Counters</h1> <p><strong>Grass-types and Grass-type Coverage: With Swampert's 4x weakness Grass, any Grass-type move will usually KO it. Zarude, Solar Beam Heatran, and Energy Ball Tapu Lele are all huge threats for Swampert.</p> <p><strong>Knock Off: Without its Assault Vest, RegenVest Swampert's special bulk is significantly decreased and it's much harder to answer special attackers such as Zapdos, so Knock Off from Pokemon like Tapu Fini or Incineroar cripples it.</p> <p><strong>Magic Bounce: Magic Bounce users such as Garchomp and Blissey can prevent Swampert from setting Stealth Rock. However, Swampert can freely chip them with Flip Turn and keep the momentum.</p> <p><strong>Desolate Land: Desolate Land blocks Swampert's Flip Turn, resulting in a loss of momentum. However, Swampert can threaten most Desolate Land users like Heatran with its other moves.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 375662, "username": "Think"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 524664, "username": "Osake"}]}
  },
  "Milotic": {"sets": [{"name": "Assault Vest"}]},
  "Latios": {
    "comments": "<h1>Other Options</h1> <p>Choice Specs with Trick fulfills Latios's role as a hit-and-run wallbreaker, but is easier to play around due to the lack of setup options and inability to soften up foes with Psyshock before using Draco Meteor. Adaptability is a good alternative that hits neutral targets like Blissey much harder at the cost of having a harder time against Steel-types. Dragon's Maw and Magic Guard are also viable options, the former boosting Draco Meteor's power and the latter improving longevity, but their inability to break Steel-types is very undesirable; to compensate for that, Mystical Fire can be used to hit Steel-types, or Thunder can be used to specifically hit Corviknight. Choice Scarf is also an option to serve as a revenge killer, though it does not reliably beat many key threats.</p> <h1>Checks and Counters</h1> <p><strong>Jirachi: Jirachi is single-handedly the biggest roadblock to Latios, as it 4x resists Psyshock and loses barely over one-third of its health from Draco Meteor. It is free to set up Doom Desire or Future Sight, or simply bring in a faster Pokemon using U-turn.</p> <p><strong>Physical Moves</strong>: Latios suffers from being weak to common physical moves like U-turn and Knock Off, which are found on common Pokemon like Corviknight, Azelf, and Ferrothorn. Moreover, its mediocre Defense means even resisted moves like Zarude's Grassy Glide and Barraskewda's Liquidation will deal half of its health to Latios.</p> <p><strong>Faster Pokemon: Latios is very susceptible to revenge killers, as all faster Pokemon, such as Tapu Koko, Talonflame, and Choice Scarf Genesect, are able to KO Latios after some chip damage, which is very easy to obtain.</p> ",
    "sets": [
      {
        "name": "Calm Mind",
        "description": "<p>Latios is a formidable wallbreaker that is able to power through Steel-types like Corviknight and Heatran thanks to Tinted Lens. Draco Meteor is Latios's strongest move and is able to OHKO physically defensive Swampert, Corviknight, and Zarude after one Calm Mind boost. Psyshock is a more consistent STAB move that also conveniently hits special walls like Blissey and Assault Vest Swampert on their weaker Defense stat, as well as hitting Fairy-types such as Tapu Fini; additionally, it OHKOes Tapu Lele after one boost. Because Latios has a good Speed tier and Psyshock does not lower Special Attack, Latios is able to finish off weakened teams with Calm Mind and Psyshock. Roost provides much-needed recovery to offset damage from entry hazards and U-turn, which Latios will often be hit by while setting up on defensive Pokemon like Corviknight. Soul Dew boosts Latios's STAB moves without any negative effects. A Timid nature allows it to outspeed key offensive threats like Terrakion, Garchomp, and Genesect.</p> <p>Latios fits on balance teams that enjoy its ability to severely weaken defensive behemoths like Heatran and Mew. As such, it can work with wallbreakers like Genesect and Tapu Koko to overwhelm these defensive Pokemon. Fast revenge killers like Choice Scarf Landorus-T and Barraskewda are also good teammates, as they can revenge kill foes like Cinderace and Tapu Koko that threaten Latios. The Special Attack drop from Draco Meteor means Latios will often be forced out, so it requires a strong defensive backbone to absorb attacks after it uses Draco Meteor. This is compounded by its low Defense, meaning partners like Corviknight and Tapu Fini are required to switch into physical attackers like Zarude and Cinderace. Latios greatly struggles with the common RegenVest Jirachi, so teammates carrying Knock Off, such as Ferrothorn and Azelf, are useful to remove Jirachi's Assault Vest. Wandering Spirit users, notably Corviknight, are also helpful, as they can take away Jirachi's Regenerator while chipping it with Rocky Helmet. Physical attackers like Cinderace and Zarude are also helpful to threaten Jirachi and other soft checks to Latios like Blissey and Ferrothorn. Teammates that can set entry hazards are very useful, as Latios needs very minor chip damage to secure the OHKO on foes like Mew and Heatran after one boost. On the other hand, Defoggers are also good teammates, as Latios's hit-and-run nature means taking a lot of entry hazard damage if they are not removed. Lastly, teammates that can safely bring in Latios, such as Blissey and Corviknight, are helpful partners, so that Latios can minimize damage taken while switching in.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 524664, "username": "Osake"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 476520, "username": "avyrie"}]}
  },
  "Jirachi": {
    "comments": "<h1>Other Options</h1> <p>Jirachi can run Energy Ball to threaten Swampert by 2HKOing physically defensive sets. Thunder is also an option to threaten Corviknight while paralyzing foes. Jirachi can run Fire Punch to beat Genesect, who is otherwise able to switch in and set up without much fear. However, Jirachi typically prefers its listed coverage options. Jirachi can also opt to hold a Choice Scarf and use Trick to cripple a defensive Pokemon such as Blissey or Corviknight. A more offensive set with Magic Guard and Steel Beam can also be run, but it struggles to make progress against many special walls such as Blissey.</p> <h1>Checks and Counters</h1> <p><strong>Knock Off: Losing Assault Vest heavily lowers Jirachi's special bulk, so Knock Off from Pokemon like Ferrothorn, Azelf, and Toxapex limits its ability to switch into special attackers.</p> <p><strong>Wandering Spirit: Like many Regenerator users, Jirachi’s only form of recovery is its ability. This, coupled with the fact that Jirachi’s most used move is U-turn, makes Wandering Spirit very problematic as it invalidates Regenerator. Common Wandering Spirit users such as Landorus-T and Corviknight can switch in on a Jirachi U-turn and steal its Regenerator.</p> <p><strong>Primal Weather: Jirachi is unable to check common Desolate Land and Primordial Sea users, such as Heatran and Inteleon, due to its inability to switch into Fire- and Water-type attacks.</p> <p><strong>Strong Physical Wallbreakers: Many fast physical wallbreakers including Barraskewda, Cinderace, Zygarde-10%, and Talonflame threaten OHKOs or major damage on Jirachi, and many can pivot on a predicted switch. These Pokemon can be brought in against Jirachi with pivoting from common special attackers such as Tapu Koko, who Jirachi can switch in on.</p> ",
    "sets": [
      {
        "name": "RegenVest",
        "description": "<p>Jirachi’s typing and above average special bulk, augmented with Assault Vest, make it a great defensive pivot. Most significantly, it is one of the few consistent switch-ins to Tapu Lele since Jirachi resists both STAB attacks and is not weak to any coverage move. Jirachi can also check other common attackers such as Tapu Koko, Zapdos, and Latios. Regenerator, in conjunction with U-turn, allows Jirachi to recover health while slow pivoting to a teammate. Iron Head hits Fairy-types such as Tapu Lele, and Future Sight or Doom Desire allows Jirachi to pressure the opposing team and help wallbreakers break past their switch-ins. Icy Wind deters setup sweepers such as Genesect, as well as slows down opposing Pokemon for its teammates. A Calm nature and 30 Speed IVs allow Jirachi to underspeed neutral 100 Speed Pokemon while remaining faster than most Togekiss sets, who can otherwise be problematic.</p> <p>Jirachi works well on balance and bulky offense teams, as strong wallbreakers such as Zarude, Terrakion, and Zygarde-10% appreciate being brought in safely, especially with added pressure created by Future Sight or Doom Desire. They also appreciate that Jirachi offers a reliable switch-in to Triage Tapu Lele. Jirachi appreciates physically defensive Pokemon such as Swampert, Mew, and Corviknight, who match up well against the physical wallbreakers Jirachi cannot check. In return, it can check special wallbreakers for them. Offensive wallbreakers such as Barraskewda and Terrakion can force out the Fire-, Ground-, and Dark-types that threaten Jirachi. It appreciates consistent entry hazard removal, as the extra chip damage from entry hazards threaten its longevity. Jirachi is a poor switch-in to Primal Weather users such as Heatran and Inteleon, so it needs to be paired with a secondary switch in to Fire- and Water-type attacks.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 524664, "username": "Osake"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 525446, "username": "Ducky"}]}
  },
  "Garchomp": {
    "comments": "<h1>Other Options</h1> <p>Garchomp's large movepool and well-rounded stats give it several other options it can use either defensively or offensively. Skill Link turns Scale Shot into a consistent 125 Base Power attack that also boosts Speed, making Garchomp a dangerous sweeper. Magic Guard allows it to freely run Life Orb without taking recoil as well as avoid damage from Toxic. However, both of these options give up the longevity that Regenerator provides. Dazzling can be used with Scale Shot on more offensive teams to avoid priority attacks from Tapu Lele, Togekiss, and Zarude. Defensively, Garchomp can run Flamethrower to wear down Ferrothorn and Corviknight. RegenVest Garchomp is also an option to better check threats like Volcarona, Zapdos, and Tapu Koko, but it is generally outclassed by other RegenVest users because it lacks a pivoting move.</p> <h1>Checks and Counters</h1> <p><strong>Fairy- and Dragon-types: Fairy-types can threaten Garchomp with their powerful Moonblast, and Triage Tapu Lele can revenge kill it with Draining Kiss even after a Speed boost from Scale Shot. Faster Dragon-types such as Latios can threaten Garchomp with their powerful Dragon-type STAB moves.</p> <p><strong>Dauntless Shield Corviknight and Mew: With their Defense boosted, Corviknight and Mew take little damage from Garchomp's STAB moves. Corviknight can pivot out to a revenge killer or set up with Bulk Up, while Mew can burn Garchomp with Will-O-Wisp or 2HKO it with Ice Beam.</p> <p><strong>Strong neutral attacks</strong>: Despite being bulky, Garchomp relies a lot on its resistances to handle foes and doesn't take strong STAB moves well from foes like Terrakion, Galarian Zapdos, and Zarude.</p> ",
    "sets": [
      {
        "name": "Defensive Regenerator",
        "description": "<p>Thanks to its great bulk and good typing, Garchomp can act as a blanket check to many common special attackers in AAA. With Regenerator, it is able to consistently switch into various Pokemon, such as Zapdos, Heatran, and Volcarona, and threaten them with its powerful attacks. Earthquake OHKOes Heatran and Tapu Koko and also deals consistent damage to defensive Pokemon, such as Jirachi and Blissey. Stone Edge allows Garchomp to OHKO Volcarona and threaten Flying-types, such as Zapdos, Mandibuzz, and Talonflame, that are immune to Earthquake. Swords Dance pressures bulkier teams, as Garchomp can set up on the switches it forces and, at +2, can beat defensive stalwarts like Ferrothorn and Tapu Fini that would otherwise check it. Stealth Rock is usually used in the last moveslot since common Defoggers, such as Corviknight and Tapu Fini, cannot OHKO Garchomp. Toxic is another option to punish would-be answers such as Unaware Mandibuzz and Dauntless Shield Hippowdon or just to wear down soft checks, such as Tapu Fini and Swampert. Lastly, Substitute can be used to capitalize on Garchomp's excellent bulk and freely set up on passive foes, such as Swampert and Corviknight, that would like to pivot out or to avoid status from various defensive Pokemon, such as Dauntless Shield Mew, Swampert, and Tapu Fini. The given Speed EVs allow Garchomp to outspeed Xurkitree and Modest Tapu Lele while maximizing its special bulk in order to reliably come in on Zapdos and Volcarona.</p> <p>Garchomp fits best on balance teams that appreciate its ability to soft check various special attackers with its numerous resistances, notably Heatran, Volcarona, and Zapdos. Particularly, Pokemon that are threatened by Zapdos and Heatran, such as Corviknight and Jirachi, are good partners. In return, they can check Fairy- and Dragon-types, such as Tapu Lele and Latios, that threaten Garchomp. Despite being a soft check to numerous threats, Garchomp is limited by its lack of reliable recovery outside of Regenerator, so secondary switch-ins to threats like Zapdos and Cinderace are useful. As such, it appreciates teammates like Jirachi and Primordial Sea users, such as Zapdos and Barraskewda, to help deal with powerful Fire- and Electric-type attacks. Garchomp also appreciates entry hazard removers, such as Corviknight, in order to maintain Regenerator's utility. Lastly, Garchomp appreciates partners that can wear down or threaten Intimidate Corviknight and Dauntless Shield Mew, so partners like Terrakion and Talonflame are appreciated.</p> "
      },
      {
        "name": "Offensive Regenerator",
        "description": "<p>Offensive Garchomp utilizes Regenerator to come in multiple times per game to wallbreak while not being bothered by Life Orb recoil. With Life Orb, Garchomp's attacks are extremely powerful and able to 2HKO defensive staples of the metagame, such as Tapu Fini, Swampert, and Ferrothorn, after entry hazard damage; Garchomp's wallbreaking ability is only further augmented by Swords Dance. Scale Shot is a good Dragon-type STAB move that can break through Flying-types, such as Landorus-T and Zapdos, while boosting Garchomp's Speed, making it very hard to revenge kill without priority moves. Stone Edge is another option to hit Tapu Bulu and Flying-types without lowering its Defense. Stealth Rock capitalizes on the switches Garchomp forces as well as its ability to heavily damage most Defoggers with its coverage. Fire Fang and Stone Edge are also viable options to hit Corviknight and Tapu Bulu better, especially in conjunction with Swords Dance. An Adamant nature is preferred to maximize damage rolls on Tapu Fini and Swampert, but a Jolly nature can be used to outspeed Pokemon with base 100 Speed, such as Zapdos. A bulkier spread with 156 EVs in Speed and the rest in HP or Special Defense can also be used to allow Garchomp to take hits from threats like Heatran and Zapdos better while still outspeeding Timid Heatran.</p> <p>Offensive Regenerator Garchomp fits best on bulky offense teams that appreciate its wallbreaking power and ability to switch in several times throughout a game. Pokemon that appreciate its ability to threaten Heatran and Tapu Fini, such as Tapu Koko and Barraskewda, are good partners. Fast, specially offensive pivots, such as Tapu Koko, Azelf, and Genesect, can bring Garchomp in on special walls, such as Blissey or RegenVest Jirachi. If Garchomp is not carrying Stealth Rock, entry hazards setters, such as Swampert and Ferrothorn, are good partners to wear down Garchomp's answers. It also appreciates entry hazards removers, such as Tapu Fini, to maximize the health given by Regenerator. Pokemon that can wear down Corviknight and Dauntless Shield Mew, such as Barraskewda, Zarude, and physical Genesect, are also good teammates. However, you need to be careful when pairing Garchomp with Zarude, as Grassy Terrain reduces Earthquake's power. Due to Garchomp's weakness to Fairy- and Dragon-types, Steel-types are often good teammates in order to check the likes of Tapu Lele, Togekiss, and Latios; accordingly, RegenVest Jirachi and Heatran make good partners. Since Garchomp is not particularly fast without Scale Shot's Speed boost, fast pivots, such as Scarf Azelf and Barraskewda, are appreciated to pressure faster foes.</p> "
      },
      {
        "name": "Defensive Magic Bounce",
        "description": "<p>With its great bulk and defensive typing, Garchomp is one of the best Magic Bounce users in AAA. Its ability to reliably switch into common Stealth Rock setters, such as Swampert and Heatran, allows it to keep entry hazards off its side of the field throughout the course of a game. It can also check special threats, such as Volcarona and Zapdos, thanks to its good special bulk. Garchomp recovers HP and removes status with Rest, and Sleep Talk keeps it from being too passive in front of Pokemon that would try to setup on it, such as Volcarona. Earthquake is Garchomp's main STAB move, forcing out key threats like Heatran as well as doing good neutral damage to foes like Blissey and Ferrothorn. In the last moveslot, Rock Slide OHKOes Volcarona and Talonflame and hits other Flying-types such as Zapdos, while Dragon Tail prevents set up from various threats, such as Shift Gear Genesect and Cosmic Power Mew. The given EV spread maximizes Garchomp's special bulk while allowing it to outspeed Modest Heatran.</p> <p>Magic Bounce Garchomp fits best on balance teams that appreciate its ability to reliably keep hazards off the field without being passive. Pokemon that are weak to entry hazards, such as Choice Band Cinderace and Choice Specs Volcanion, appreciate this support. Pokemon like Jirachi and Zarude that are forced out by strong Fire-types, such as Volcarona and Cinderace, appreciate Garchomp switching into them. Even with Magic Bounce, Garchomp can be overwhelmed by offensive Stealth Rock setters, such as Mamoswine and opposing Garchomp. As such, strong answers to them, such as Corviknight, are good partners, and Corviknight can also provide a situational Defog if needed. Regenerator Blissey and Genesect are examples of necessary switch-ins to Fairy-types, such as Tapu Fini and Tapu Lele, as they force out Garchomp. Garchomp is also unable to deny Stealth Rock from some setters such as Mold Breaker Heatran. As such, answers to them, such as Toxapex, are appreciated. Garchomp also likes Heal Bell and Wish support from partners like Vaporeon in order to not rely too much on Rest, although it is not mandatory.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523886, "username": "UT"}, {"user_id": 375662, "username": "Isaiah"}]}, {"name": "Grammar checked by", "members": [{"user_id": 277988, "username": "dex"}]}], "writtenBy": [{"user_id": 524664, "username": "Osake"}]}
  },
  "Lucario": {"sets": [{"name": "Magic Guard"}]},
  "Hippowdon": {
    "comments": "<h1>Other Options</h1> <p>Hippowdown can run a Wandering Spirit set to disrupt the opposing team, especially their Regenerator pivots, but this is generally better left to Corviknight due to its better typing. Unaware is a viable option to check setup sweepers without Whirlwind. Curse is also an option to make Hippowdon less passive and power up both Earthquake and Body Press, but it comes at the expense of a utility option.</p> <h1>Checks and Counters</h1> <p><strong>Grass-type Attackers: Zarude, Dhelmise, and Tapu Bulu are all able to hit Hippowdon with their STAB attacks and overwhelm it; they also resist Earthquake, and all but Zarude resist or are immune to Body Press as well.</p> <p><strong>Special Attackers: With the exception of Tapu Koko, most special attackers are able to easily overwhelm Hippowdon's lower Special Defense and 2HKO it.</p> <p><strong>Water-types: Barraskewda, Swampert, and Primarina are all able to threaten Hippowdon with their STAB attacks; even worse, they can force it out with Flip Turn to generate momentum.</p> ",
    "sets": [
      {
        "name": "Physical Wall",
        "description": "<p>Hippowdon is a sturdy physical wall that can check some of the metagame's premier physical attackers like Terrakion, Zygarde-10%, and Garchomp. Its bulk and Dauntless Shield allow it to tank powerful attacks, like Terrakion's Close Combat and Garchomp's Earthquake, while Slack Off allows it to stay healthy throughout the match to repeatedly check these dangerous attackers. It can also deter setup thanks to Whirlwind and Toxic, which can force out an opposing setup sweeper or put them on a timer. Earthquake is often Hippowdon's only attacking move and notably allows it to beat Tapu Koko. Body Press is another attacking option that provides solid coverage alongside Earthquake, notably hitting Zarude and Ferrothorn, which may try and switch in, but it usually comes at the expense of Toxic. For another option, Hippowdon is a serviceable Stealth Rock setter, but it does not threaten any of the common Defoggers and generally prefers its other utility moves. Leftovers is the preferred item to provide passive recovery and help reduce the chances of a 2HKO from Terrakion and Tapu Koko, but Rocky Helmet is an option to punish opposing attackers, especially U-turn pivots. The given EV spread allows Hippowdon to avoid the 2HKO from both Terrakion's Close Combat and Tapu Koko's Dazzling Gleam after Stealth Rock.</p> <p>Hippowdon fits well on balance and bulky teams that want solid answers to Terrakion, Zygarde-10%, and Calm Mind Tapu Koko; it pairs well with teammates that are forced out by these threats, like Tapu Lele, Zapdos, and Heatran. It pairs well a special wall like Blissey or Assault Vest Jirachi, as each can cover for the other's lower defensive stat; Blissey and Jirachi especially appreciate Hippowdon's ability to shut down Calm Mind Tapu Koko for them, as it is able to set up on both of them. Hippowdon is unable to check Grass-type attackers, namely Zarude, Tapu Bulu, and Dhelmise, so Corviknight and Mandibuzz make excellent teammates. Hippowdon also struggles with Water-type attackers, most commonly Barraskewda, so a Desolate Land teammate like Heatran or bulky switch-in like Tapu Fini makes a great partner. Hippowdon is often unable to damage Talonflame, requiring a reliable switch-in such as Primordial Sea Zapdos. While Hippowdon does not particularly fear Stealth Rock, Spikes or Toxic Spikes can turn several key 3HKOs into 2HKOs, so a reliable Defogger like Corviknight is advised.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 524664, "username": "Osake"}, {"user_id": 475804, "username": "The Number Man"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 523866, "username": "UT"}]}
  },
  "Togekiss": {
    "comments": "<h1>Other Options</h1> <p>Aura Sphere can replace Psyshock or Flamethrower to give Togekiss more effective counterplay towards Heatran and Flash Fire Steel types like Ferrothorn. Three-attack Togekiss can drop the Roost slot and defensive utility to run both Psyshock and Fire Blast, allowing for a sweep versus a wider variety of teams in the late game. However, because it needs to rely on Draining Kiss for recovery instead of Roost, this set doesn't have as much longevity as the standard two attack set. Heavy Duty Boots can be run on Togekiss if it's put on a team without adequate entry hazard control, which helps keep its health topped off throughout the game, at the cost of significantly lower damage output.</p> <h1>Checks and Counters</h1> <p><strong>Offensive Fairy-resistant Pokemon: Fire- and Steel-type Pokemon like Volcarona, Heatran and Genesect resist Togekiss's main attacking option in Draining Kiss, outspeed it and threaten a KO. However, most of them don't have reliable recovery and can't come in on one of Togekiss's coverage moves.</p> <p><strong>Anti-setup Pokemon: Walls such as Prankster Toxapex and Unaware Chansey and Blissey act as full stops to the standard Togekiss sets. In general, Toxic users can easily stop Togekiss from sweeping and let it get KOed from Toxic + Life Orb recoil.</p> <p><strong>Specially Defensive Pivots: Regenerator pivots such as Assault Vest Swampert can switch into Togekiss and pivot into adequate revenge killers.</p> <p><strong>Priority Blockers: Fast Pokemon with priority-blocking abilities such as Azelf are immune to Togekiss's Triage-boosted Draining Kiss, preventing Togekiss from safely sweeping until they are removed from the match.</p> ",
    "sets": [
      {
        "name": "Triage",
        "description": "<p>Togekiss acts as a late-game sweeper capable of outspeeding every non-Triage Pokemon with its +3 priority-boosted recovery moves. Draining Kiss acts as Togekiss's main STAB move, and despite its Base Power, its damage output can be increased greatly with Life Orb and Nasty Plot. Togekiss is able to effectively outspeed the entire metagame, meaning Pokemon that can effectively revenge kill it are few and far between, being limited to Fairy resistant Pokemon and Dazzling or Psychic Surge Pokemon. This gives Togekiss a uniquely good matchup versus pivot-heavy bulky offense teams that do not carry an offensive Fire- or Steel- type. Togekiss is also able to set up on and brute-force its way through passive switch-ins such as Corviknight and non-Toxic Blissey. In the late game, Togekiss especially shines as a setup sweeper and wincon when the opponent's team is sufficiently weakened. Because Roost is also a healing move, it benefits from the +3 priority boost provided from Triage as well, allowing Togekiss to sponge some attacks with its above-average bulk and excellent typing and allowing it to act as a check to key threats such as Zarude and Garchomp. Due to Togekiss's narrow niche and need for heavy chip damage on Pokemon that resist its moves to execute a successful sweep, it should be considered as a specialist, only being brought in when a KO can be guaranteed or to pressure exceptionally weak foes out. For coverage moves, Togekiss mainly chooses between Flamethrower and Psyshock. Flamethrower allows it to pressure and beat Steel-types more effectively, while Psyshock allows Togekiss to put a dent into special walls like Blissey and Poison-types like Toxapex. A Modest nature with maximum Special Attack investment aim to maximize Togekiss's offensive capabilities; since it is priority-reliant, Speed and HP investment can be customized, but the current spread allows it to outpace defensive Heatran.</p> <p>Because of its fast Fairy-type attacks, Togekiss acts as an excellent teammate for those that struggle to outpace Dragon-, Fighting-, and Dark-types like Garchomp, Galarian Zapdos, and Zarude. Bulky pivots like Regenerator Swampert and Blissey are both able to weaken those fast threats while switching into Togekiss to clean up with Draining Kiss. Togekiss also pairs nicely with offensive powerhouses like Tinted Lens Latios and Primordial Sea Barraskewda, which can put easily exploitable dents into an opponent's team composition, giving Togekiss a greater opportunity to overwhelm the opponent in the endgame. Because Fire-types are going to be some of Togekiss's first switch-ins, Fire resist-resistant teammates to tank attacks from Fire-types like Volcarona and Heatran are essential teammates. Regenerator Garchomp and Swampert are good teammates to tank attacks while also setting up Stealth Rock. On a similar note, setup sweepers that share the same offensive checks also make great teammates for Togekiss—Sheer Force Genesect and Triage Tapu Bulu can help clear the way for Togekiss by threatening to sweep unless a Fire-type is brought in to revenge kill them, in which case they can chip it low enough that Togekiss can clean up in the lategame, or vice versa. Pokemon that are able to set up hazards and pivot out slowly are also essential teammates for Togekiss, as their hazards weaken Togekiss's offensive switch-ins and allow for more wiggle room for Togekiss to set up Nasty Plot and execute a sweep. Finally, physically offensive Ground-types like Landorus-T or Garchomp are able to threaten Togekiss's common Steel-type counters such as Assault Vest Jirachi, as well as harming specially defensive walls like Blissey, enabling Togekiss's late-game cleanup.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 475804, "username": "The Number Man"}, {"user_id": 375662, "username": "Isaiah"}, {"user_id": 524664, "username": "Osake"}]}, {"name": "Grammar checked by", "members": [{"user_id": 241023, "username": "Kris"}]}], "writtenBy": [{"user_id": 226455, "username": "berry"}, {"user_id": 523866, "username": "UT"}]}
  },
  "Mamoswine": {
    "comments": "<h1>Other Options</h1> <p>Substitute is an option over Toxic in the last moveslot to ease prediction, but the lack of significant bulk forces Mamoswine to run Leftovers, for more longevity and a Jolly nature to outspeed Mew and Tapu Fini. Water Absorb can also be paired with this to take advantage of Substitute against Barraskewda and Swampert, but otherwise reduces damage output even further. Mamoswine can use High Horsepower when paired with a Grassy Surge user like Dhelmise, although this increases the likelihood of residual chip. A Sheer Force Life Orb set allows Mamoswine to use Freeze Dry, Ice Beam, and Earth Power to beat its normal checks like Swampert, Corviknight, and Dauntless Shield Mew, but is generally weaker against neutral targets.</p> <h1>Checks and Counters</h1> <p><strong>Bulky Physical Walls: Bulky Physical walls like Dauntless Shield Mew and Intimidate Corviknight can reliably switch into Mamoswine and recover any lost health.</p> <p><strong>Residual Damage</strong>: Stealth Rock and other entry hazards can severely limit how many attacks Mamoswine can get off, especially Life Orb variants. Mamoswine also fears poison and burn as they severely limit its longevity.</p> <p><strong>Bulky Water-Types</strong>: Bulky Water-types like Swampert and Tapu Fini can switch into Mamoswine's Ice-type attacks with relative ease before pivoting out and healing with Regenerator or even threaten a KO with their own attacks. However, Earthquake can 2HKO them, but this requires correct prediction to avoid excessive residual chip.</p> <p><strong>Revenge Killers</strong>: Revenge killers like Azelf and Terrakion OHKO Mamoswine and force it out. Azelf is particularly troublesome as it stops Mamoswine from using Ice Shard thanks to Psychic Surge.</p> <p><strong>Zarude and Tapu Bulu: Grassy Glide in Grassy Terrain from Zarude outpaces Mamoswine and can immediately OHKO. Tapu Bulu also OHKOes Mamoswine when outside of Psychic Terrain with Triage Horn Leech.</p> ",
    "sets": [
      {
        "name": "Adaptability Wallbreaker",
        "description": "<p>Mamoswine is a good wallbreaker thanks to its high Attack and functionally unresisted STAB move combination. It can 2HKO almost every Pokemon without Intimidate or Dauntless Shield, such as Tapu Fini, Swampert, and Ferrothorn. Earthquake is the main STAB attack, allowing it to hit Steel- and Poison-types like Heatran and Toxapex for super effective damage, while Icicle Crash hits Ground-, Dragon- and Flying-types such as Landorus-T and Zapdos. Ice Shard is a useful Ice-type priority attack that allows it to revenge kill a plethora of Pokemon like Zygarde-10% and Landorus-T, as well as weakened faster threats like Tapu Koko and Talonflame. Toxic poisons Dauntless Shield Mew and bulky Water-types like Swampert and Tapu Fini to wear them down over the course of the game, while Knock Off removes important items from its checks, notably Leftovers and Heavy-Duty Boots, to weaken them more easily. Stealth Rock is an alternative as Mamoswine can reliably keep them up against Defoggers it can 2HKO like Tapu Fini and Moltres. Choice Band is the preferred option due to its lack of recoil and ability to guarantee the 2HKO on Tapu Fini, but it requires Mamoswine to rely on predictions, while Life Orb allows more flexibility at the cost of struggling to break bulkier walls without extensive team support. An Adamant nature allows Mamoswine to hit as hard as possible while still allowing it to outspeed fast defensive Pokemon like Tapu Fini and Mew.</p> <p>Mamoswine can break through special walls like Blissey and Jirachi with ease for special attackers such as Azelf and Zapdos. It can also break down Water-and Dragon-types like Tapu Fini and Silvally-Dragon for Cinderace, Talonflame, and other Fire-types; in return, these Fire-types can deal with Intimidate Corviknight, which would otherwise prevent Mamoswine from making progress. Dauntless Shield Mew is also another common check, so physical pivots like Cinderace and Barraskewda can help Mamoswine beat it. Special attackers such as Azelf and Volcarona force out Mamoswine, so Zapdos and Assault Vest Swampert are appreciated to tank their attacks. Revenge killers such as Cinderace and Terrakion threaten Mamoswine, so answers like Swampert, Zapdos, and Dauntless Shield Mew are all greatly appreciated. Zarude and Tapu Bulu also force out Mamoswine, so checks like Dauntless Shield Mandibuzz and Corviknight help in these matchups. Due to its mediocre bulk, Mamoswine likes coming in via pivots; as such, it appreciates partners like Corviknight and Mew that can slow pivot for it. Tapu Koko is also a great partner as it can outspeed and pivot on special walls that Mamoswine forces out like Blissey and Jirachi, along with being able to lure in Swampert and KO it with Grass Knot.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 524664, "username": "Osake"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 511130, "username": "PandaDoux"}, {"user_id": 545372, "username": "Clasmia"}]}
  },
  "Azelf": {
    "comments": "<h1>Other Options</h1> <p>Psyshock can be used to deal more damage to Assault Vest Swampert, Chansey, and Blissey. Nasty Plot sets, with Life Orb or expert Belt, are also usable to take advantage of the switches Azelf forces and to threaten Pokemon such as Ferrothorn and Blissey that would like to switch in; however, it severely cripples Azelf's immediate utility of Speed and power.</p> <h1>Checks and Counters</h1> <p><strong>Chansey and Blissey: Azelf, like many other Pokemon, has trouble breaking Chansey and Blissey, as Expanding Force is a 4HKO on both of them. Psyshock can be used to improve this matchup, but it still doesn't 2HKO. This means that Azelf has to rely on Knock Off or Trick to remove their items and pivoting via U-turn to slowly weaken the two.</p> <p><strong>Zarude</strong>: Zarude is one of the most common Dark-types in the tier, meaning that it can switch in on a Expanding Force and then get a free turn. However, it fears U-turn, which creates a coinflip situation on whether your opponent will switch to it every time you bring out Azelf. Further, non-Specs Fire Blast doesn't OHKO it, and it can OHKO in return with priority Grassy Glide.</p> <p><strong>Steel-types</strong>: Common Steel-types such as Genesect, Heatran, and Jirachi take Azelf's Expanding Force well, and can take advantage of it to freely gain momentum or to setup Stealth Rock. However, some of them fear Azelf's coverage moves such as Knock Off and Fire Blast.</p> <p><strong>RegenVest: RegenVest users such as Jirachi and Swampert can take confomrtably Azelf's attacks. None of them appreciate taking a Knock Off though, but it forces Azelf to outplay.</p> ",
    "sets": [
      {
        "name": "Psychic Surge",
        "description": "<p>Azelf has a unique role in AAA as a fast Expanding Force user with both pivoting in U-turn and utility moves such as Trick and Knock Off, which help punish defensive switch-ins like Corviknight and Blissey. Azelf is one of the fastest Pokemon in the tier, which, paired with the probability it pivots with U-turn, is very dangerous in a momentum-reliant tier like AAA. Equipped with a Choice Scarf, Azelf is able to outspeed naturally fast Pokemon such as Tapu Koko, Talonflame, and Barraskewda. This makes it a very reliable revenge killer, but Choice Specs is another option make Azelf a fast special wallbreaker. Psychic Surge makes it a blanket check to many Triage and standard priority users, particularly Togekiss and Tapu Bulu. Expanding Force is Azelf's main STAB move, 2HKOing almost everything that doesn't resist it thanks to the Psychic Terrain boost. Trick allows Azelf to cripple defenive Pokemon such as Blissey and Cosmic Power Mew, as well as offering an emergency check to setup sweepers such as Quiver Dance Volcarona. Fire Blast targets Steel-types that resist Expanding Force such as Ferrothorn and Corviknight, while Knock Off removes items from the likes of Blissey, Swampert, and Jirachi. A Hasty nature takes advantage of Azelf's great Speed tier without sacrificing damage from U-turn or Knock Off.</p> <p>Azelf can fit on most teams because of its ability to check Triage and standard priority users while still being an offensive threat. Its less-than-ideal bulk means it appreciates slow pivots from a Pokemon like Swampert or Corviknight to get in safely. Azelf is vulnerable to entry hazards and being slowly worn down, as it lacks recovery as well. It's also weak to Pokemon that can double switch into Expanding Force and force a switch by threatening a KO back, such as Heatran. This, coupled with its tendency to force in special walls, means it pairs very well with Fighting-types such as Terrakion, which can threaten the Steel- and Dark-types Azelf struggles to break through.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 375662, "username": "Isaiah"}, {"user_id": 523866, "username": "UT"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 525446, "username": "Ducky"}]}
  },
  "Heatran": {
    "comments": "<h1>Other Options</h1> <p>Regenerator can be used to increase Heatran's already significant longevity; however, Heatran loses some of its formidable offensive presence. Bulletproof can also be utilized as a check to Tapu Lele as well as powerful Weather Ball users such as Primordial Sea Primarina and Zapdos; however, Bulletproof sets can eventually be chipped down or hit with a powerful non-ballistic move. Heatran can use the combination of Iron Defense and Body Press to reliably beat Blissey without the use of Taunt, as well as making it very difficult to KO from the physical side. Desolate Land Heatran can opt to use either Choice Scarf or Choice Specs in conjunction with Eruption. The former allows Heatran to outspeed most of the unboosted metagame and catch many opposing Pokemon off-guard with an incredibly powerful Fire-type attack. Choice Specs allows Heatran to deal large chunks of damage to the tier's premier special walls, such as Blissey and Assault Vest Swampert. However, these items are less consistent because these sets are often prone to chip damage and can be played around once revealed.</p> <h1>Checks and Counters</h1> <p><strong>Fire-immune Pokemon: Primordial Sea users can greatly diminish Heatran's presence on the field, and often threaten a KO, Barraskewda and Zapdos being two of the most prominent examples. In the case of Desolate Land Heatran, Flash Fire Steel-types are able to almost completely wall Heatran.</p> <p><strong>Blissey: Blissey is capable of comfortably switching into Heatran's attacks, barring Taunt, and can pivot into a strong breaker that can force Heatran out. However, non-Magic Bounce Blissey can be trapped and crippled via Taunt by Heatran, and even those will be trapped and eliminated by Mold Breaker variants.</p> <p><strong>RegenVest Users</strong>: RegenVest Pokemon that resist Magma Storm, such as Garchomp and Silvally-Dragon, are capable of comfortably taking Heatran's attacks and either threatening it immediately or switching to a Pokemon that can.</p> <p><strong>Ground-types: Ground-types such as Garchomp and specially defensive Landorus-T can switch into Heatran's attacks and threaten it out with a powerful Earthquake.</p> <p><strong>Terrakion: Although Terrakion cannot always reliably switch into Heatran, it can take advantage of slow pivots to come in and threaten Heatran with its powerful attacks.</p> ",
    "sets": [
      {
        "name": "Desolate Land",
        "description": "<p>Desolate Land Heatran serves as a powerful weather attacker capable of dealing heavy damage, even to Pokemon that resist its moves. Desolate Land allows Heatran to switch in and override the opposing weather, allowing it to check opposing Primordial Sea users like Zapdos, as well as turning Heatran's Water weakness into an immunity. In addition to Desolate Land Heatran's offensive presence, its natural bulk and typing allow it to switch into and act as a soft check to various attackers such as Tapu Koko, Togekiss, and Genesect. Magma Storm is a powerful STAB move that enables Heatran to trap and eliminate Pokemon that would otherwise be able to switch into its Fire-type attacks comfortably, such as Tapu Fini and Assault Vest Swampert. Heatran is one of the most reliable Stealth Rock setters in the AAA metagame, as it pressures common Defoggers such as Corviknight and Tapu Fini. Toxic is useful for chipping down key Pokemon on the other team that may resist or be immune to Heatran's attacking moves, such as Primordial Sea Zapdos, while Taunt is useful to trap and eliminate non-Magic Bounce Blissey, a common roadblock for Heatran. Maximum Special Attack and Speed EVs with a Modest nature allow Heatran to hit as hard as possible, while a Timid nature allows Heatran to outspeed Pokemon that may try to outspeed Modest Heatran, such as Primordial Sea Zapdos. However, Heatran can opt for more defensive EVs and less Speed EVs if desired.</p> <p>Desolate Land Heatran is typically found on balance and bulky offense teams that appreciate its ability to reliably keep Stealth Rock up and pressure common defensive Pokemon. Grass-type attackers such as Zarude and Tapu Bulu enjoy Heatran handling Steel-types that they would otherwise have a difficult time breaking through, such as Corviknight and Ferrothorn. In addition, Fairy-type attackers such as Tapu Koko often have trouble with the Steel-types that Heatran deals with handily. Desolate Land Heatran can also deal with Pokemon such as Tapu Fini and Swampert, which many of the tier's attackers greatly appreciate. Heatran benefits from having teammates that can utilize Grassy Surge to weaken Earthquake from foes such as Garchomp, as well as increasing the passive recovery Heatran accumulates through Leftovers. Heatran enjoys having a teammate with a Ground immunity on its team, such as Corviknight, to switch into powerful Earthquakes. Corviknight and other Defoggers make good partners for Heatran to help it avoid chip damage from entry hazards. Heatran also has trouble with opposing users of Primordial Sea, such as Zapdos, Barraskewda, and Primarina, and appreciates Pokemon such as Blissey and Tapu Fini to switch into those threats.</p> "
      },
      {
        "name": "Mold Breaker Utility",
        "description": "<p>Mold Breaker Heatran is a versatile and powerful utility Pokemon. Mold Breaker enables it to set up Stealth Rock even against foes that utilize Magic Bounce, such as Blissey, and eliminate Steel-type Flash Fire users, such as Ferrothorn and Corviknight. Mold Breaker Heatran, while fulfilling its role as a reliable entry hazard setter, also functions as a check to many attackers in the tier, namely Togekiss, Tapu Koko, Latios, Azelf, and Genesect, due to its typing letting it resist or take neutral damage from their STAB attacks and common coverage options. Magma Storm serves as Heatran's only attack, but it comes with a trapping effect that allows Heatran to rack up passive damage, especially in conjunction with either Protect or Toxic. Stealth Rock, when combined with Mold Breaker, makes Heatran one of the most reliable hazard setters in the metagame. Toxic is used to add more residual damage to the opposing team and can be used to deter even resistances and immunities, such as Tapu Fini and Primordial Sea Zapdos, from switching into Heatran. Protect is a very useful move for Heatran, allowing it to accumulate recovery from Leftovers, increasing its longevity, as well as scouting commonly Choice-locked attackers and stalling out low-PP attacks, such as Terrakion's Close Combat; Protect also allows Heatran to rack up chip damage from Magma Storm and Toxic on the foe. Taunt can be used to trap and heavily damage or eliminate common Heatran switch-ins such as Blissey and Mew that are utilizing Teleport. Heatran's EV spread enables it to outspeed 0 Speed Tapu Fini, which allows Heatran to prevent Defog with Taunt while also maximizing its special bulk; however, the spread is adaptable to the needs of the team.</p> <p>Mold Breaker Heatran excels at setting up Stealth Rock, which makes it a great partner for Pokemon like Terrakion that achieve much more favorable rolls on common switch-ins with Stealth Rock active. Mold Breaker Heatran's presence benefits various attackers that typically have trouble breaking through Steel-types such as Ferrothorn, Corviknight, and even the less common Skarmory. These attackers can include Pokemon like Tapu Lele, Tapu Koko, and Grassy Surge Zarude. If utilizing Taunt, Heatran is able to trap and eliminate Blissey, which various special attackers such as Primarina and Tapu Lele love. Zarude forms a powerful duo with Mold Breaker Heatran, as Heatran greatly appreciates Zarude's Grassy Terrain to increase its passive recovery and weaken opposing Earthquakes, as well as appreciating Zarude's powerful priority to eliminate threats to Heatran such as Barraskewda and Primarina. Heatran appreciates other specially bulky Pokemon and their ability to serve as switch-ins to special attackers like Primordial Sea Zapdos and Primarina, and it appreciates Ground-immune Pokemon such as Landorus-T and Corviknight for their ability to switch into Earthquake.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 524664, "username": "Osake"}]}, {"name": "Grammar checked by", "members": [{"user_id": 241023, "username": "Kris"}]}], "writtenBy": [{"user_id": 539897, "username": "iapt"}]}
  },
  "Excadrill": {"sets": [{"name": "Water Absorb"}]},
  "Conkeldurr": {"sets": [{"name": "Triage"}, {"name": "Choice Band"}]},
  "Ferrothorn": {
    "comments": "<h1>Other Options</h1> <p>Ferrothorn's wide movepool allows it to run many different move combinations to suit its team needs. Toxic can be run over Thunder Wave if it wants to specifically target Zapdos. Ferrothorn can also run Stealth Rock, however in general there are better Stealth Rock users and it becomes too passive if it runs both entry hazards.</p> <h1>Checks and Counters</h1> <p><strong>Fighting-type Pokemon and Coverage: Strong Fighting-type moves such as Close Combat from Terrakion and Barraskewda or High Jump Kick from Cinderace can heavily damage Ferrothorn. However, they need to watch out for Chople Berry, especially Close Combat users since Ferrothorn can take advantage of the Defense drop and KO them back in return. They also don't want to switch in directly as they rely on their items and fear Thunder Wave.</p> <p><strong>Fire-type Pokemon and Coverage: If Ferrothorn doesn't have a Fire immunity, Fire-type moves like Fire Blast from Azelf and Flare Blitz from Talonflame threaten to OHKO it. Pokemon with Desolate Land such as Volcanion and Heatran can override Ferrothorn's Primordial Sea as they switch in, and Heatran in particular can also negate Flash Fire variants if it runs Mold Breaker.</p> <p><strong>Magic Bounce and Taunt: Magic Bounce and Taunt greatly limit Ferrothorn's usefulness by denying status, entry hazards, and also setup in the case of Taunt. Users can then proceed to set hazards, boost on their own, or simply chip Ferrothorn down. Examples of Magic Bounce and Taunt users include Tapu Koko and Mandibuzz.</p> ",
    "sets": [
      {
        "name": "Defensive Regenerator",
        "description": "<p>Thanks to its excellent utility movepool and useful defensive typing, Regenerator Ferrothorn is an excellent support Pokemon. Knock Off is its most consistent attack, remove important items such as Leftovers and Rocky Helmet from foes. Spikes supports its teammates by providing chip damage, and combined with Knock Off can help chip Pokemon even if they carry Heavy-Duty Boots. Power Whip is a powerful STAB option that deals significant damage to Water-type Pokemon, notably Tapu Fini to prevent it from clearing Spikes with Defog, and also 2HKOes Tapu Koko. Body Press can be used instead to target Heatran and opposing Ferrothorn. Thunder Wave further cripples switch-ins, slowing them and potentially denying their entry hazard removal. If Ferrothorn runs Body Press, Iron Defense is an alternative that allows it to beat Magic Bounce Blissey and Corviknight one-on-one, which otherwise prevent it from setting Spikes. It can also beat some Fighting-type Pokemon like Terrakion and Mienshao if they switch in on the turn Ferrothorn boosts its Defense. Rocky Helmet helps it punish contact moves, usually U-turn and Flip Turn from the likes of Landorus-T and Barraskewda. Chople Berry allows Ferrothorn to survive a Close Combat from Terrakion and Barraskewda and OHKO back with Power Whip. The given EV spread allows it to avoid the 2HKO from Primarina's Weather Ball, as well as check Tapu Koko more reliably.</p> <p>Regenerator Ferrothorn finds its place on almost all team styles. Primordial Sea Zapdos is a great partner for Ferrothorn, as it can take on Fire-types like Heatran that force Ferrothorn out, while Ferrothorn can handle Rock- and Water-type moves that threaten Zapdos. Zapdos also complements Ferrothorn's Spikes by threatening all common Defoggers and spinners such as Mandibuzz and Corviknight and pivoting with either U-turn or Volt Switch to rack up Spikes damage. Heatran can form a hazard stack core together with Ferrothorn and also deny Defog with Taunt. Together with Tapu Fini, they form a solid defensive Fire / Water / Grass core with a lot of useful utility options. Offensive threats appreciate Ferrothorn's Spikes to help them pick up more key KOs, especially those that can pivot to wear down their checks and counters such as Galarian Zapdos and Primordial Sea Barraskewda. The former also deters Fire-type moves aimed at Ferrothorn, while the latter can repeatedly switch into Fighting-type moves if it has Regenerator. Even with Chople Berry, Ferrothorn can't switch in directly against strong Close Combat, so bulky Pokemon that resist Fighting make for great partners, such as Mew and the aforementioned Tapu Fini.</p> "
      },
      {
        "name": "Specially Defensive",
        "description": "<p>Specially defensive Ferrothorn is a solid answer to dangerous specially offensive threats such as Tapu Koko and Primarina. Leech Seed is mandatory because of its lack of a reliable recovery move, allowing it to chip switch ins such as Corviknight while restoring HP. Knock Off removes items from them, discouraging Pokemon that heavily rely on their item such as Zapdos from switching in. Body Press is another option which targets foes that don't mind losing their item such as Magic Bounce Blissey and opposing Ferrothorn, as well as hits Heatran. Power Whip lets Ferrothorn pressure Water-types such as Tapu Fini and Swampert; however, Gyro Ball is a good alternative that hits foes like Tapu Lele and Togekiss harder. Spikes is a great last option to support its teammates, as Ferrothorn forces many switches. Protect instead lets it scout moves from Choice item Pokemon such as Terrakion and get more health back from Leftovers and Leech Seed. If Ferrothorn runs Body Press and Gyro Ball, Curse can also be considered, potentially sweeping against unprepared opponents. Bulletproof allows Ferrothorn to comfortably wall Sheer Force Tapu Lele, and should be paired with Gyro Ball to OHKO it in return. Flash Fire and Primordial Sea negate Ferrothorn's Fire weakness, allowing it to check dangerous attackers such as Heatran and Entei, with Flash Fire being more vulnerable to Mold Breaker Heatran while Primordial Sea risks getting overridden by a Desolate Land switch-in and doesn't stop Will-O-Wisp. Leftovers helps Ferrothorn make up for its lack of reliable recovery. 252 HP EVs maximizes Leftovers recovery; if Gyro Ball is used, Ferrothorn should run 0 Speed and a Sassy nature to make it hit as hard as possible.</p> <p>Specially defensive Ferrothorn finds its place in teams that need an utility special wall that can also handle either Tapu Lele or Fire-type Pokemon. Fighting-types such as Terrakion threaten Ferrothorn, therefore teammates that can handle it are appreciated. For example, Intimidate Corviknight can form an entry hazard control duo with Ferrothorn and check Terrakion, while Ferrothorn takes on Heatran and Volcanion for Corviknight. Similarly, Tapu Fini can cover for Ferrothorn's weaknesses, provide a midground switch in case a Desolate Land Pokemon overrides Ferrothorn's Primordial Sea, and cripple defensive threats with Trick. Offensive threats with pivot like Galarian Zapdos and Talonflame utilize Ferrothorn's Spikes well. Tapu Koko, in particular, can take on Galarian Zapdos and pressure common entry hazard removers. Genesect struggles against Desolate Land Pokemon, most importantly Heatran, which Ferrothorn can switch in against. Garchomp can stack entry hazards alongside Ferrothorn with Stealth Rock and also set up Swords Dance to punish hazard removal attempts.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 524664, "username": "Osake"}, {"user_id": 523866, "username": "UT"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 500884, "username": "longhiep341"}]}
  },
  "Chandelure": {
    "comments": "<h1>Other Options</h1> <p>Energy Ball OHKOes Swampert and hits Tapu Fini hard, and Psychic hits Toxapex, but generally Substitute and Pain Split offer more utility. Fire Blast is also an option over Flamethrower to increase Chandelure's damage, notably dealing more damage than Calm Blissey heals with Regenerator. Chandelure has a lot of utility moves such as Taunt and Toxic, that can be used to beat specific checks - notably Blissey - but at the cost of losing immediate power and coverage. Adaptability is also an option to power up Shadow Ball on Choice Specs sets, but at the cost of weaker Fire moves and no longer having an immunity to Water.</p> <h1>Checks and Counters</h1> <p><strong>RegenVest Swampert: RegenVest Swampert is able to safely live all of Chandelure's moves except Energy Ball and Solar Beam and can OHKO Chandelure back with Flip Turn or Earthquake.</p> <p><strong>Chansey and Blissey</strong>: Both Chansey and Blissey are able to switch in on Chandelure's attacks and can either threaten it with either Toxic or Thunder Wave, or can pivot out to a teammate that threatens Chandelure.</p> <p><strong>Faster Offensive Pokemon</strong>: Chandelure is able to be forced out by many fast offensive Pokemon. Examples are Barraskewda, Terrakion, and Azelf, which threaten OHKOs or major damage.</p> <p><strong>Garchomp: Garchomp is never OHKOed by Chandelure, and can always OHKO it with Earthquake, allowing it to freely switch in and force Chandelure out. Will-O-Wisp severely cripples it, however.</p> ",
    "sets": [
      {
        "name": "Sheer Force Attacker",
        "description": "<p>Chandelure is a powerful wallbreaker thanks to its great Special Attack and strong STAB moves with almost unresisted coverage. Sheer Force and Life Orb boost its already high power without taking recoil. Shadow Ball is a powerful STAB move with few resistances that threatens common Pokemon such as Mew, Zapdos, and Tapu Fini. Flamethrower provides coverage against Normal- and Dark-type Pokemon that can stomach a Shadow Ball such as Blissey, Chansey, and Mandibuzz, as well as Steel-types such as Ferrothorn and Corviknight. Together, these two moves 2HKO almost every common Pokemon, with the exception of RegenVest Swampert, Chansey, and Blissey. Substitute helps Chandelure beat Blissey, who often can not threaten Chandelure with moves other than status, and eases predictions against pivots. Pain Split is used to recover HP against Chansey and Blissey, as Chandelure can be worn down due to its weakness to Stealth Rock and by Substitute, and beat them one-on-one. Calm Mind is a more aggressive option that allows Chandelure to boost up and overwhelm its checks.</p> <p>Chandelure fits best on balance and bulky offense teams, as its high Special Attack and powerful STAB moves are great at forcing switches, but it needs help getting in safely. It appreciates defensive pivots such as Blissey and Corviknight bringing it in safely, as Chandelure is weak to entry hazards and is relatively frail. Pokemon that can set entry hazards such as Landorus-T and Swampert also make good teammates, as they help Chandelure wear down its checks, such as almost guaranteeing 2HKO against Assault Vest Landorus-T with Stealth Rock up. Water-type switch-ins such as Tapu Fini and Toxapex are also great teammates, as Chandelure is weak to faster Water-types such as Barraskewda and Inteleon. Fighting-types such as Galarian Zapdos and Terrakion pair well with Chandelure, as they are able to threaten Chansey and Blissey, two of Chandelure's best checks. Sweepers such as Tapu Koko, Genesect, and Tapu Lele appreciate Chandelure breaking through common special walls like RegenVest Jirachi for them to sweep. Consistent entry hazard removal, such as Corviknight or Tapu Fini, (comma) is also necessary in order to mitigate Chandelure’s weakness to Stealth Rock.</p> "
      },
      {
        "name": "Desolate Land Breaker",
        "description": "<p>Desolate Land Chandelure is a terrifying wallbreaker, with its powerful Fire-type moves hitting common specially defensive walls such as Jirachi and Ferrothorn, and Shadow Ball hitting Pokemon such as Garchomp and Toxapex who do not fear Chandelure's sun-boosted moves. Solar Beam KOes Water-type Pokemon such as Assault Vest Swampert, who otherwise can switch in safely and force Chandelure out. Trick cripples defensive Pokemon like Chansey, Blissey, and Flash Fire Mandibuzz, some of Chandelure's most consistent checks. Alternatively, Chandelure can also use Will-O-Wisp and Hex to hit switch-ins such as Garchomp and Toxapex harder, at the cost of immediate damage and the coverage of Solar Beam.</p> <p>Desolate Land Chandelure is best suited to balance and bulky offense teams, as it has high damage output, but requires team support that more offensive teams cannot fit. Strong offensive and defensive pivots such as Barraskewda, Zarude, Swampert, and Blissey are great partners, as Chandelure excels at capitalizing on the momentum these pivots create. Good Defoggers are a must-have for Chandelure, as it can easily be worn down by entry hazards over the course of a longer game, so Pokemon like Corviknight and Tapu Fini are good teammates. Pokemon that can set entry hazards, such as Landorus-T and Heatran, are also good partners, as Stealth Rock support helps Chandelure wear down the opposing team faster. Powerful Fighting-types such as Terrakion pair well with Chandelure, as Chandelure threatens Intimidate Corviknight and Terrakion, in turn, threatens Chansey and Blissey, two of Chandelure's best checks. Strong Fairy-types like Tapu Lele and Tapu Koko also love Chandelure's ability to break through common Steel-type Pokemon such as Jirachi and Ferrothorn.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 524664, "username": "Osake"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 525446, "username": "Ducky"}]}
  },
  "Mienshao": {
    "comments": "<h1>Other Options</h1> <p>A Swords Dance set stands out from similar sweepers thanks to Mienshao's wide variety of coverage options and powerful STAB move; however, this set lacks immediate power and is forced out by the same Pokemon that the Choice Band set is forced out by, such as Terrakion.</p> <h1>Checks and Counters</h1> <p><strong>Physically Defensive Pokemon: Physical walls like Prankster Toxapex and Dauntless Shield Skarmory stonewall Mienshao with their reliable recovery, and they force it out in various ways. They also often run Rocky Helmet, which forces Mienshao to use Knock Off first or else risk chip damage racking up.</p> <p><strong>Ghost-type Pokemon: Pokemon like Dhelmise and Chandelure can exploit Mienshao being locked into Close Combat to set up a Swords Dance or a Substitute, respectively. However, neither of them can come in safely.</p> <p><strong>Faster Pokemon: Choice Band Mienshao is pressured by a myriad of Pokemon, including Terrakion, Tapu Koko, Azelf, Cinderace, and Zygarde-10%. Choice Scarf sets also fail to outspeed Choice Scarf Azelf, Choice Scarf Latios, and +2 Genesect.</p> <p><strong>Priority: Mienshao is frail and will falter to most forms on priority. against most priority moves. Triage users such as Tapu Lele can cleanly OHKO Mienshao, while Grassy Surge users like Zarude can do the same with Grassy Glide.</p> ",
    "sets": [
      {
        "name": "Tinted Lens Pivot",
        "description": "<p>Mienshao's niche lies in its solid Speed tier, powerful STAB option in Close Combat, and useful utility options like Knock Off and U-turn. Knock Off removes items from switch-ins like Toxapex and Intimidate Corviknight, notably ensuring that Mienshao doesn't take additional Rocky Helmet chip damage. U-turn pivots Mienshao out of counters it cannot wear down by itself, like Dauntless Shield Hippodown, into a partner that can take advantage of them, which distinguishes it from other powerful wallbreakers like Terrakion and Heracross. High Jump Kick supplements Close Combat's meager eight PP, but it's risky to use when opponents have Ghost-types like Dhelmise. Poison Jab lets Mienshao fish for poison on Pokemon like Hippodown, as well as revenge killing non-Triage Tapu Lele consistently. A Choice Band is recommended to make Mienshao a decently flexible wallbreaker, with Close Combat becoming hard to switch into, specifically 2HKOing all Tapu Fini and Zapdos. However, Mienshao can use a Choice Scarf to revenge kill important and fast threats like Tapu Koko and Barraskewda.</p> <p>Mienshao often struggles with physically defensive Pokemon like Toxapex and Mew, so it appreciates partners that can take advantage of them like Tapu Koko and Chandelure; in return, Mienshao forces out special walls like Blissey and Silvally-Dragon, or it removes their items with Knock Off and makes it easier for its partners to break through them. Choice Band Mienshao is flexible and can fit on offensive cores featuring Pokemon like Cinderace and Tapu Lele, which can wear down Mienshao's checks like Hippodown. For Cinderace, Hippowdon is a shared check, so it and Mienshao can rack up damage together, while Tapu Lele can outright break past Hippowdon. Choice Scarf Mienshao hits a very important Speed tier that's hard to beat, and balance teams heavily appreciate it forcing out fast threats like Talonflame and Choice Scarf Genesect. Mienshao often wants both entry hazard setters and removers. Ferrothorn and Chansey are solid setters and switch into foes that force out Mienshao, like Azelf and Inteleon. Good Defoggers like Mandibuzz and Corviknight can additionally form a pivot core with Mienshao.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 524664, "username": "Osake"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 414072, "username": "Heracross2.0"}]}
  },
  "Bisharp": {"sets": [{"name": "Swords Dance"}]},
  "Mandibuzz": {
    "comments": "<h1>Other Options</h1> <p>Mandibuzz can run Knock Off or Taunt to frustrate common switch-ins, but it generally prefers the moves listed on the main set. Mandibuzz can run an immunity ability like Flash Fire, which patches up its weakness to Cinderace, Desolate Land Heatran, and Volcarona, but these, and other alternate abilities, come at the expense of checking setup sweepers. Magic Bounce is also an option to block status and entry hazards. Dauntless Shield is an option to improve its matchup versus wallbreakers like Garchomp.</p> <h1>Checks and Counters</h1> <p><strong>Toxic: Since Mandibuzz needs to stay on the field to wall setup sweepers, Toxic from common walls like Toxapex and opposing Mandibuzz severely hampers its ability to do its job.</p> <p><strong>U-turn: Since Mandibuzz is reliant on Roost to stay healthy, pivots like U-turn Zarude and Talonflame can wear it down over time by immediately pivoting to a check, forcing it out before it can recover.</p> <p><strong>Item Removal: Stealth Rock damage limits Mandibuzz’s longevity, so it fears any form of item removal, including Switcheroo Dhelmise.</p> <p><strong>Choice Item Wallbreakers: Due to its reliance on Unaware, Mandibuzz is vulnerable to being overwhelmed by both Choice Band users, like Terrakion and Galarian Zapdos, and Choice Specs users, like Latios and Inteleon.</p> ",
    "sets": [
      {
        "name": "Unaware Wall",
        "description": "<p>Thanks to its great bulk, reliable recovery, good defensive typing, and STAB Foul Play, Mandibuzz is the primer Unaware user in AAA. Mandibuzz can check a wide range of physical attackers including Zarude and Talonflame; even the setup variants cannot overwhelm it thanks to Unaware. It is also one of the few reliable checks to Dhelmise, one of the hardest wallbreakers to account for defensively. Foul Play lets the weak Mandibuzz deal significant damage, especially if foes attempt to set up. Roost keeps Mandibuzz healthy throughout the match, and U-turn lets it function as a slow pivot and generate momentum against foes it forces out. Mandibuzz is a solid Defogger as well, which gives it solid utility even when it's not needed to check a setup sweeper. Brave Bird is another option if a teammate is already providing entry hazard removal, and it hits targets like Zarude and Volcarona harder than Foul Play does, while Toxic punishes opposing walls and beats Togekiss without Life Orb. Heavy-Duty Boots is the preferred item to negate Stealth Rock damage, especially if Mandibuzz is the Defogger. Mandibuzz strongly dislikes Toxic and Knock Off, as they severely cut into its longevity, so it must be careful switching into defensive Pokemon like Ferrothorn and Toxapex that often carry them. Lastly, due to how ubiquitous Mandibuzz is as a physical setup check, lure sets like Galvanize Landorus-T are sometimes run to eliminate it; Mandibuzz should be careful about switching into attackers with unrevealed abilities, especially since Unaware allows it to safely come in even after the standard sets have set up.</p> <p>Unaware Mandibuzz fits best on balance and bulky offense teams due to its fantastic role compression; in a single teamslot it provides physical bulk, setup deterrence, entry hazard removal, and slow pivoting. Mandibuzz is a great teammate to frail-but-dangerous wallbreakers such as Terrakion, Tapu Lele, and Azelf; Mandibuzz can bring them onto the field safely with a slow U-turn and switch into physical attackers that could revenge kill them. Mandibuzz struggles to check physical attackers that can hit it hard without needing to set up, like Terrakion and Cinderace, so strong checks to those like Dauntless Shield Mew make great partners. Mandibuzz is also usually unable to check special setup sweepers like Tapu Lele, so specially bulky teammates like RegenVest Jirachi are recommended.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 524664, "username": "Osake"}, {"user_id": 475804, "username": "The Number Man"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 523866, "username": "UT"}]}
  },
  "Hydreigon": {
    "comments": "<h1>Other Options</h1> <p>Sheer Force can also be used to boost the power of Dark Pulse and Flash Cannon, but Dragon's Maw gives Hydreigon a more unique niche of obscene power with Draco Meteor. Mega Launcher is another option, boosting Dragon Pulse and Dark Pulse. Hydreigon can use a set with Hyper Voice and Galvanize, baiting in Pokemon such as Corviknight and Tapu Fini that usually can switch in safely. Choice Specs can also be used, but its Choice lock tends to be exploited. A set with Queenly Majesty and a Choice Scarf makes Hydreigon very hard to revenge kill and turns the tables on Fairy-types with Triage.</p> <h1>Checks and Counters</h1> <p><strong>Specially Defensive Steel-types: Specially defensive Steel-types, such as Assault Vest Jirachi or Ferrothorn, resist Draco Meteor and take little damage from Dark Pulse or Flash Cannon, making them difficult for Hydreigon to break through without team support.</p> <p><strong>Faster Offensive Pokemon: Fast offensive Pokemon such as Cinderace, Terrakion, and Tapu Koko outspeed and can OHKO Hydreigon.</p> <p><strong>Fairy-types: Fairy-type Pokemon resist both of Hydreigon's STAB moves. Common Fairy-type Pokemon such as Togekiss and Tapu Lele also often use Triage, allowing them to easily revenge kill it. Tapu Fini's Water type leaves it neutral to Flash Cannon, Hydreigon's main way of damaging Fairy-types, and it can OHKO Hydreigon with Moonblast.</p> ",
    "sets": [
      {
        "name": "Dragon's Maw Wallbreaker",
        "description": "<p>Hydreigon is a powerful wallbreaker that can overpower common special walls such as Blissey, Assault Vest Swampert, and Jirachi. Nasty Plot and Dragon's Maw provide Hydreigon with obscene power; it has a chance to OHKO Blissey with Draco Meteor after one boost, as well as an garunteed OHKO on Swampert, Corviknight, and Toxapex. Hydreigon's third move is flexible based on team needs. Flash Cannon hits Fairy-types such as Togekiss, Tapu Lele, and Tapu Bulu, Dark Pulse hits Assault Vest Jirachi—which otherwise can survive Hydreigon's attacks comfortably, and Shock Wave can OHKO Tapu Fini after minor chip damage. Roost allows Hydreigon to stay healthy over the course of a game to wallbreak multiple times, while running three attacks instead lets Hydreigon pressure more Pokemon. Life Orb maximizes its wallbreaking potential and is necessary for getting KOs against Blissey and Tapu Fini. A Timid nature allows it to outspeed common Pokemon such as Adamant Zarude, but a Modest nature still lets it outspeed many of the same foes.</p> <p>Hydreigon fits on balance teams and provides high damage while breaking through common special walls for them. Due to its middling Speed, it pairs well with teammates such as Zapdos and No Guard Genesect that can spread paralysis, enabling Hydreigon to outspeed and threaten even more Pokemon. Similarly, it also appreciates fast partners such as Barraskewda, Choice Scarf Azelf, and Choice Scarf Landorus-T, which threaten other fast Pokemon such as Tapu Koko and Terrakion. If lacking Flash Cannon, Hydreigon has trouble hitting Fairy-type Pokemon, thus appreciating strong teammates like Tapu Bulu that pressure the common Fairy-types. Assault Vest Jirachi is a problem if Hydreigon is not running Dark Pulse, so Knock Off users such as Azelf and Tapu Fini, which can remove Jirachi's Assault Vest, or Wandering Spirit users like Corviknight, which can remove Regenerator, are good partners. Defensive pivots that can safely bring in Hydreigon, such as Blissey and Swampert, are helpful partners. Hydreigon also appreciates entry hazard support from Pokemon such as Swampert and Heatran to secure important KOs, like against Blissey.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 524664, "username": "Osake"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 525446, "username": "Ducky"}]}
  },
  "Volcarona": {
    "comments": "<h1>Other Options</h1> <p>Volcarona can forgo some survivability and use a Sheer Force Life Orb set, increasing its damage output significantly. However, this set lacks the utility of Magic Guard and Desolate Land, and it usually requires a lot of support to work. Bug Buzz is also usable with Desolate Land to hit Psychic- and Dark-types for super effective damage. Both sets can be used in either a defensive or an offensive way with appropriate EV spreads, depending of the needs of your team. Offensive Desolate Land can opt for Solar Beam to threaten more bulky Water-types such as Tapu Fini and Swampert. Lastly, Toxic can be used on the bulkier sets to weaken switch-ins such as Garchomp thoughout the game.</p> <h1>Checks and Counters</h1> <p><strong>RegenVest Pokemon: RegenVest users such as Garchomp and Silvally-Dragon are able to withstand Volcarona's attacks and threaten a KO back.</p> <p><strong>Primordial Sea Users: Pokemon such as Zapdos and Barraskewda threaten Volcarona with super effective moves and an immunity to Fire. Barraskewda often carries Aqua Jet and is able to revenge kill. Zapdos resists Volcarona's common attacks and can threaten it with Hurricane or Weather Ball.</p> <p><strong>Flash Fire Steel-types: Flash Fire users such as Ferrothorn and Corviknight can give Volcarona serious trouble, not allowing it to make progress.</p> <p><strong>Blissey: Blissey can seriously cripple Volcarona through the use of Toxic or Thunder Wave, either putting it on a timer or making it easier to revenge kill and less reliable. It is also able to tank many of Volcarona's moves even after several uses of Quiver Dance.</p> ",
    "sets": [
      {
        "name": "Desolate Land",
        "description": "<p>Volcarona is a strong setup sweeper with good defensive utility. It utilizes Desolate Land to stop common Flip Turn users such as Barraskewda and Swampert. Roost allows Volcarona to recover HP and set up multiple Quiver Dances, boosting past special walls and revenge killers. Flamethrower is a STAB and weather-boosted option, allowing it to deal good damage even without any boosts. Giga Drain is a useful move for hitting Pokemon such as Swampert and Barraskewda super effectively, as well as being a secondary way to recover HP. Alternatively, Solar Beam's higher power makes up for the minimal Special Attack investment, notably being able to OHKO physically defensive Swampert without a boost; however, Solar Beam significantly worsens Volcarona'a match up against Primordial Sea users like Zapdos and Barraskewda. The EV spread allows Volcarona to avoid a 2HKO from Sheer Force Tapu Lele's Thunderbolt while outspeeding it; the remaining EVs are put into Special Attack to maximize damage output.</p> <p>Volcarona is often found on bulky offense teams with more than one Fire-type, so that they are able to break past each others' checks. Desolate Land blocks Flip Turn users from freely pivoting, which other common Fire-types such as Heatran and Cinderace greatly appreciate. Volcarona can have trouble getting through specially bulky Fire-resistant Pokemon such as RegenVest Silvally-Dragon and Garchomp. Therefore, it likes to have powerful physical teammates such as Terrakion as well as Pokemon that can chip these Pokemon, such as Mold Breaker Heatran through its use of Toxic, Magma Storm, and Protect. Volcarona can struggle to beat Primordial Sea Pokemon like Zapdos and appreciates teammates that can threaten Zapdos or switch into it, such as Blissey or specially defensive Garchomp. Finally, it appreciates having entry hazards to chip RegenVest users like Garchomp.</p> "
      },
      {
        "name": "Magic Guard",
        "description": "<p>Magic Guard Volcarona is a powerful and difficult-to-stop setup sweeper. Magic Guard, besides fixing its Stealth Rock weakness, allows Volcarona to use recoil-free Life Orb and avoid passive damage like Toxic. Quiver Dance, beyond just letting Volcarona sweep, gives it the capacity to beat premier special walls. Giga Drain is chosen to hit targets like Swampert, Barraskewda, and Tapu Fini for super effective damage and as a method of recovering HP. Psychic nails Pokemon like Toxapex, which would otherwise be a roadblock for Volcarona, as well as being its best option to hit Primordial Sea Zapdos. Bug Buzz is another option to beat soft checks such as Latias and to hit RegenVest Garchomp harder.</p> <p>Volcarona fits best on offensive teams with powerful wallbreakers such as Terrakion, Primarina, and Tapu Lele, using the holes they open to sweep. Volcarona can struggle to get past Flash Fire Steel-types such as Corviknight and Ferrothorn, and these wallbreakers can break them down in return. Volcarona is vulnerable to Barraskewda, as it always fears Aqua Jet, but a teammate like Tapu Fini can help this weakness. It also cannot directly switch into battle given its frailty and appreciates pivots such as Blissey to let it come in safely. Volcarona can have trouble KOing specially bulky Pokemon such as Blissey or RegenVest Silvally-Dragon and Garchomp, which threaten it with paralysis or heavy chip in return, respectively. Due to this weakness, powerful physical attackers such as Terrakion, Cinderace, and Garchomp make good teammates. It can have difficulties getting past Primordial Sea users such as Zapdos, so it enjoys having Pokemon that can threaten or switch into Zapdos such as specially defensive Garchomp or Blissey. Lastly, Volcarona appreciates having entry hazards to accumulate extra chip damage on RegenVest Pokemon, making them easier to KO.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 524664, "username": "Osake"}, {"user_id": 523866, "username": "UT"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 539897, "username": "iapt"}]}
  },
  "Cobalion": {
    "comments": "<h1>Other Options</h1> <p>Cobalion is capable of running physically offensive sets with Swords Dance / Iron Head / Close Combat / Stone Edge, but aside from the surprise factor, it has little to offer over Terrakion or Lucario. Roar and Thunder Wave are options on the Utility Pivot set for teams that appreciate them more, but Toxic and Taunt are more useful in most situations. Iron Head and 152 Speed EVs form an option to safely revenge kill Tapu Lele, but Cobalion is still a poor switch-in to it.</p> <h1>Checks and Counters</h1> <p><strong>Ground-types: Cobalion relies on Volt Switch to gain momentum for its team, and Ground Types like Garchomp, Landorus-T, and Swampert can block a Volt Switch and force Cobalion out with their super effective STAB moves.</p> <p><strong>Faster Special Attackers: Pokemon like Tapu Koko and Azelf outspeed Cobalion and prey on its weaker Special Defense, forcing it out.</p> <p><strong>Zapdos: Zapdos takes little damage from Close Combat or Steel Beam, and it can both force Cobalion out with its STAB moves and remove its Stealth Rock. Defensive Zapdos sets are also slower than Cobalion, allowing them to gain momentum on a pivoting Cobalion via U-turn or Volt Switch.</p> ",
    "sets": [
      {
        "name": "Utility Pivot",
        "description": "<p>Cobalion is a useful utility pivot, and its excellent movepool gives it a solid niche on many teams. An excellent typing and high Defense make it one of the better checks to Zarude, as well as a great switch-in to the ever-present Knock Off. Cobalion's also an effective Stealth Rock setter, pivoting checks to Defoggers in with Volt Switch or even shutting them down via Taunt. Close Combat damages Pokemon like Barraskewda and Zarude that would otherwise stay in on Cobalion, and it can also deter Magic Bounce Blissey. Toxic damages Pokemon like Zapdos and Swampert, which would otherwise use Defog or damage and status Cobalion with their STAB moves, while Taunt instead stops Defog or status moves from Pokemon like Corviknight and Ferrothorn. 112 Speed EVs are used to outspeed Timid Heatran as well as neutral Lucario. Rocky Helmet significantly damages many physical attackers and punishes pivot moves from Pokemon like Swampert and Corviknight. Chople Berry allows Cobalion to survive a single powerful Fighting-type attack, including a Close Combat from Terrakion or Zarude, for a surprise KO back.</p> <p>As a pivot and entry hazard setter, Cobalion is easy to fit on most AAA teams, which highly value both qualities, espeically in one package. It forms a great defensive pivoting core with RegenVest Swampert, which is a great blanket check to many of the special attackers that would take advantage of Cobalion's weaker Special Defense. Because Cobalion's only form of recovery is Regenerator, it synergizes well with physical walls, which can switch into Pokemon that overwhelm and force Cobalion out. Mew, Zapdos, and Tapu Fini all perform this job well, and they appreciate Cobalion switching into Knock Off for them. Zapdos deserves special mention, as Primordial Sea Zapdos is immune to or resists all of Cobalion's weaknesses (and vice versa) while providing Defog and status support as well. Like AAA's other pivots, Cobalion pairs well with offensive Pokemon that struggle to switch in, such as Talonflame, Tapu Koko, and Genesect. Ground-types like Swampert will often switch into Cobalion as it attempts to pivot with Volt Switch, blocking the pivot and forcing a manual switch. Teammates like Zarude and Dhelmise can handle them. Magic Bounce users like Mew stop Cobalion from setting Stealth Rock, forcing it to switch to a teammate like Corviknight that can deal with them. Lastly, there are several physical attackers like Terrakion and Talonflame that exploit Cobalion's weaknesses, so additional physically defensive partners like Tapu Fini are appreciated.</p> "
      },
      {
        "name": "Magic Guard",
        "description": "<p>Magic Guard Cobalion trades longevity and bulk for Speed and power, acting as an excellent offensive pivot. Cobalion's average offenses are shored up by a recoil-free Life Orb boost and strong STAB moves in Steel Beam and Close Combat, giving it a surprisingly high damage output. Steel Beam hits incredibly hard, even more so with Calm Mind, and can OHKO offensive threats like Landorus-T after Stealth Rock and Tapu Koko outright. It also heavily damages defensive Pokemon like Tapu Fini and Mew. Close Combat reliably nails Steel Beam switch-ins like Heatran and Blissey. Volt Switch deals decent damage to Water- and Flying-types while also gaining momentum for the team. The last moveslot is flexible; Magic Guard and Cobalion's high Speed make it an effective user of Taunt and Stealth Rock, especially since it can threaten common Magic Bounce users like Blissey, while Calm Mind and Rock Polish wincon. A Naive nature and maximum Speed investment are used to outspeed offensive Pokemon like Zarude and Garchomp while not weakening Close Combat. While it's still a usable Knock Off switch-in, Magic Guard Cobalion relies on its Life Orb to nab crucial OHKOs and 2HKOs on Pokemon like Landorus-T and Mew, and it would prefer not to lose it.</p> <p>As always, Cobalion forms a solid pivoting core with Primordial Sea Zapdos and RegenVest Swampert, both of which resist Cobalion's weaknesses and appreciate its wallbreaking power, utility, and Speed. Cobalion also forms great offensive VoltTurn cores with Pokemon like Cinderace, Azelf, and Zarude, all of which deal with common Cobalion switch-ins and appreciate the support it can provide. If running Calm Mind or Rock Polish, entry hazard support is vital to chip checks like Zapdos and Swampert into 2HKO range; Landorus-T and Mew are excellent entry hazard setters that pair well with Cobalion. While Cobalion still has a good defensive typing and bulk, it cannot consistently check attackers like Zarude due to its lack of recovery. Defensive partners like Corviknight are thus useful.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 450411, "username": "atha"}, {"user_id": 524664, "username": "Osake"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 517099, "username": "Eggs"}, {"user_id": 523866, "username": "UT"}]}
  },
  "Terrakion": {
    "comments": "<h1>Other Options</h1> <p>Terrakion can run a Swords Dance set with either Tough Claws—with Megahorn to beat Mew—or Adaptability on more offensive teams to take advantage of the free turns it generates, but the Life Orb chip damage and increased risk of taking stray hits makes it less reliable on longer games against bulkier teams. A Sniper set with Laser Focus allows Terrakion to beat every common defensive switch in, but once the set is revealed the foe can stay in and attack to deny the Laser Focus turn. Download is another option on bulky teams using fast breakers such as Tapu Koko that can bring Terrakion against Jirachi and Blissey to boost its Attack, allowing it to 2HKO Intimidate Corviknight with the Choice Band boost. However, it's dependent of the Download's boost to make great damages.</p> <h1>Checks and Counters</h1> <p><strong>Dauntless Shield Users: Dauntless Shield Mew and Hippowdon are two of the few reliable switch ins to Adaptability Terrakion, as they are not 2HKOed by any move even with Stealth Rock up and can heal reliably, counter back with strong super effective attacks, or inflict Terrakion with status. However, they both must watch out for Toxic while switching in.</p> <p><strong>Nidoqueen, Palossand, and Doublade: While Terrakion threatens every common wall in the meta, it should be noted that dedicated walls for it do exist. Namely, Nidoqueen, Palossand, and Doublade can reasonably check Terrakion over the course of a longer game.</p> <p><strong>Physically Defensive Choice Scarf Users</strong>: Choice Scarf Mew, Tapu Fini, and Galarian Zapdos are all able to take one hit from Terrakion and force it out or pivot in on it. With Regenerator, they are often able to do this multiple times per battle but can be overwhelmed if not kept at high HP.</p> <p><strong>Protect Users: Terrakion has a difficult matchup against defensive Pokemon that run Protect, notably Heatran, as Protect both reveals which move Terrakion is locked into, enabling the opponent to pick the correct switch-in, and drains precious PP. Both of Terrakion's STAB moves have only 8 PP and are prone to being stalled out over the course of longer games, and Protect accelerates that. However, it can be risky to click Protect without sufficiently scouting if it's being used against setup Terrakion.</p> ",
    "sets": [
      {
        "name": "Choice Band Adaptability",
        "description": "<p>Terrakion is one of the most threatening physical breakers in AAA and is capable of battering through many defensive cores on its own. Rock- and Fighting-type STAB moves have near-perfect coverage by themselves, making Adaptability a fantastic damage amplifying ability for it. With a Choice Band equipped, very few defensive walls can safely switch into Terrakion. Dauntless Shield Mew is one of the most reliable answers as it is never 2HKOed by any of Terrakion's common moves without a critical hit, but even Dauntless Shield Corviknight fails to check Terrakion reliably as Stealth Rock damage is enough to let it get 2HKOed by Close Combat. Terrakion's base 108 Speed is enough to outpace all common defensive Pokemon and a number of common breakers, including Zapdos and Garchomp, giving it plenty of Pokemon to force out if brought in via a slow pivot or after a KO. While Terrakion will almost always be using its STAB moves, Earthquake is a 100% accurate option to hit Toxapex and Doublade without getting PP stalled, Megahorn lets Terrakion 2HKO Dauntless Shield Mew and Slowbro after Stealth Rock, and Toxic is a nice option to cripple walls that Terrakion cannot 2HKO like Dauntless Shield Mew and Hippowdon. Stealth Rock is also an option to let Terrakion get entry hazards up on a predicted switch if the opponent has a reliable answer to it. Terrakion runs maximum Speed and Attack investment with a Jolly nature to take advantage of its Speed tier and maximize the number of Pokemon it beats one-on-one.</p> <p>Terrakion fits well on bulky offense teams that can provide it with many opportunities to switch in and fire off strong attacks. While almost nothing can safely switch into Terrakion, it is also true that Terrakion does not want to switch in on many Pokemon either. Therefore, slow pivots like Corviknight, Swampert, and Blissey provide the safe switch in that Terrakion needs and make excellent teammates. Defensive pivots also make good teammates as Terrakion is often forced out after it gets a KO due to its mediocre bulk and only slightly above-average Speed. Good offensive teammates include fast physical attackers that like to take advantage of the weakened or broken defensive cores that Terrakion creates such as Barraskewda, Zarude, and Genesect. Other good offensive teammates include Azelf and Tapu Koko, as they can draw out and pivot on RegenVest Pokemon and Blissey that Terrakion can beat easily; Azelf can also set up Psychic Terrain to protect Terrakion from Triage. Lastly, Terrakion appreciates entry hazard support, as many of its checks can only check it from high health, and hazards help whittle them down until they can no longer switch in.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 231750, "username": "motherlove"}, {"user_id": 524664, "username": "Osake"}]}, {"name": "Grammar checked by", "members": [{"user_id": 241023, "username": "Kris"}]}], "writtenBy": [{"user_id": 523866, "username": "UT"}]}
  },
  "Thundurus": {
    "comments": "<h1>Other Options</h1> <p>Thundurus can opt to run Psychic in its last moveslot to heavily damage Volt Absorb Toxapex, but it isn't generally as useful as U-turn and Knock Off. Sludge Bomb is another option that targets Tapu Bulu and poisons foes, but it's otherwise outclassed by existing options. A Primordial Sea or Sheer Force set featuring Nasty Plot and Focus Blast is possible; however, it's outclassed by Zapdos and Thundurus-T, respectively.</p> <h1>Checks and Counters</h1> <p><strong>Faster Offensive Pokemon: Due to Thundurus's frailty, all faster offensive threats can threaten to 2HKO it at worst. Examples include Tapu Koko, Barraskewda, and Azelf. Tapu Koko also takes little damage from everything Thundurus normally throws at it and can use Roost to stay healthy, making it a reliable counter. However, most of those threats can't switch into Thundurus's attacks, and even Tapu Koko has to watch out for Sludge Bomb.</p> <p><strong>Non-Grass-weak Ground-type Pokemon: Thundurus relies on Grass Knot to deal damage to Ground-type Pokemon, so Garchomp and Landorus, especially their specially defensive Regenerator variants, prevent it from breaking efficiently.</p> <p><strong>Volt Absorb Users: Volt Absorb users like Corviknight and Toxapex can wall Thundurus, although the latter has to fear the rare Psychic.</p> <p><strong>Tapu Bulu: Tapu Bulu doesn't fear most attacks Thundurus can run except for Sludge Bomb and can set up against it.</p> ",
    "sets": [
      {
        "name": "Magic Guard Life Orb",
        "description": "<p>Thundurus sports good mixed attacking stats and a wide movepool to tear defensive cores apart. Magic Guard removes its Stealth Rock weakness and Life Orb recoil, allowing it to pivot multiple times throughout a game. Thunderbolt threatens common Water- and Flying-type defensive Pokemon such as Tapu Fini and Corviknight. Grass Knot deals heavy damage to Ground-type Pokemon that would otherwise wall it like Swampert and Hippowdon. Superpower targets specially defensive foes such as Blissey and Heatran, as well as Pokemon that resist its other moves, mainly Ferrothorn. U-turn allows Thundurus to grab momentum by switching out of unfavorable matchups and also chips down foes it struggles to face one-on-one like Volt Absorb Corviknight. Knock Off is another option over U-turn that provides utility by removing key items from foes, helping its teammates to make progress more easily. The EV spread in tandem with a Hasty nature helps it outpace everything up to 110 Speed, notably Latios and Terrakion, without reducing its damage output. Hasty is preferred over Naive to take less damage from Draining Kiss.</p> <p>Thundurus's subpar bulk and poor defensive utility compared to Zapdos means it can only fit on more offensive builds. Cleaners such as Azelf and Togekiss pair well with Thundurus as they enjoy opposing walls being weakened. Thundurus appreciates entry hazards from its teammates like Swampert and Ferrothorn to wear down its checks and counters. Desolate Land Heatran is a notable partner because not only does it provide Stealth Rock, it also checks several faster Pokemon that force Thundurus out like Azelf, Tapu Koko, and Barraskewda. In return, Thundurus discourages opponents from using Ground-type moves and helps Heatran come in safely to break walls that gives Thundurus trouble. Answers to faster offensive threats like Cinderace and Zygarde-10% are necessary, so Swampert and Tapu Bulu make for great partners. Powerful but slow wallbreakers, such as Mamoswine and Primarina, appreciate Thundurus's ability to bring them in safely with U-turn. Teammates that can form a pivot core with Thundurus such as Barraskewda are also valuable, and Genesect, in particular, resists common priority attacks like Draining Kiss and Grassy Glide that can revenge kill Thundurus.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 524664, "username": "Osake"}, {"user_id": 523866, "username": "UT"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 500884, "username": "longhiep341"}]}
  },
  "Landorus-Therian": {
    "comments": "<h1>Other Options</h1> <p>Regenerator Landorus-T can run a specially defensive Assault Vest set to serve as a defensive pivot instead, switching into strong special attackers like Tapu Koko better, though this set cannot actually revenge kill these attackers; furthermore, it struggles with both Desolate Land and Primordial Sea users such as Cinderace, Volcanion, and Inteleon, which is unideal for a slow Regenerator user. Another option is to run maximum Defense investment and Rocky Helmet to serve as a defensive Stealth Rock setter, but this set is still 2HKOed by the likes of Pixilate Tapu Koko and Cinderace, limiting its use as a physical wall. Choice Scarf sets can utilize Aerilate, Body Slam, and Explosion to threaten foes with both paralysis and heavy chip damage, as well as providing better coverage to hit foes like Dhelmise. Wandering Spirit is also a niche option to be an emergency check to dangerous sweepers like Triage Tapu Bulu, as well as denying recovery from Regenerator users like Jirachi. However, Landorus-T generally favors Regenerator so it can repeatedly check offensive threats. Lastly, Galvanize can be used over Aerilate on suicide lead sets, as Body Slam can 2HKO Tapu Fini and Corviknight, allowing Landorus-T to eliminate opposing Defog users without having to sacrifice itself.</p> <h1>Checks and Counters</h1> <p><strong>Flying-types: Flying-types like Corviknight and Zapdos are resilient to almost any move Landorus-T uses, and they can use a slow U-turn or a Volt Switch as it switches out, respectively, to bring in a teammate safely. Corviknight can also run Wandering Spirit to deny Landorus-T recovering health from Regenerator. Additionally, Zapdos, while weak to Stone Edge, threatens to OHKO Landorus-T with Weather Ball. Nevertheless, Landorus-T can punish both Pokemon via Knock Off.</p> <p><strong>Water- and Ice-type Coverage: Landorus-T is heavily damaged by any Water- or Ice-type attacks, such as ones by Barraskewda, Zapdos, Genesect, and Swampert, though Choice Scarf sets can pick these Pokemon off if they are sufficiently weakened.</p> <p><strong>Grassy Surge: Grassy Surge users, namely Dhelmise and Zarude, threaten to 2HKO Landorus-T with Grassy Glide, and their Grassy Terrain halves the damage of Earthquake, Landorus-T's main attacking move. However, these Pokemon have to be aware of Knock Off and U-turn, respectively.</p> <p><strong>Strong Neutral Wallbreakers: As Landorus-T cannot OHKO wallbreakers that are not weak to Ground, it is often forced to trade damage against the likes of Swords Dance Garchomp and Zygarde-10%. While Landorus-T threatens a 2HKO on them, it will take heavy damage in the process, which outpaces Regenerator healing and wears it down quickly.</p> ",
    "sets": [
      {
        "name": "Choice Scarf",
        "description": "<p>Landorus-T is one of the best Choice Scarf users in the tier due to its combination of bulk, power, coverage, and access to U-turn. Earthquake OHKOes many premier attackers, such as Tapu Koko, Terrakion, and Cinderace. It also forces out common defensive Pokemon like Heatran, Jirachi, and Blissey. U-turn takes advantage of the switches Landorus-T forces, allowing it to safely bring in a teammate like Tapu Koko. Knock Off offers useful utility in removing items from switch-ins, such as Corviknight and Ferrothorn, and is its best option against Dhelmise. Stone Edge keeps Talonflame, Zapdos, and unboosted Volcarona in check, but do note that Zapdos survives a hit from full health and can threaten an OHKO in return. Because of Stone Edge's limited use otherwise, Defog can be utilized instead as an emergency entry hazard removal option, and it takes advantage of Landorus-T's positive matchup against Heatran, one of the best Stealth Rock setters. Regenerator keeps Landorus-T healthy throughout a game to repeatedly pivot into threats like Tapu Koko and Talonflame, fulfilling its role as an offensive pivot. The given Speed investment in conjunction with a Choice Scarf allows Landorus-T to outspeed Barraskewda; the remaining EVs are put into HP and Defense to maximize bulk, which notably allows Landorus-T to survive a Stone Edge from Terrakion.</p> <p>Landorus-T fits on balance teams in need of a check to dangerous attackers like Tapu Koko, Terrakion, and Talonflame. It pairs well with defensive Pokemon like Corviknight, Jirachi, and Blissey, as they can invite the aforementioned wallbreakers in and then pivot into Landorus-T. At the same time, Landorus-T complements special attackers greatly by threatening special walls such as Heatran, Jirachi, and Blissey, further forming a VoltTurn core with the likes of Tapu Koko, Azelf, and Genesect. Zapdos forms a particularly stellar offensive core with Landorus-T, as it can come in on Corviknight, Tapu Fini, and Garchomp, among other foes that attempt to check Landorus-T; in return, Landorus-T outspeeds and checks revenge killers like Terrakion. Landorus-T is also weak to common Water- and Ice-type attacks from the likes of Genesect, Zapdos, and Swampert, so teammates like Tapu Fini and Desolate Land Heatran are essential to help cover them. Additionally, Blissey can switch into Zapdos and chip it via Seismic Toss, greatly helping Landorus-T in revenge killing Zapdos. Entry hazards from setters like Heatran let Landorus-T win the pivoting battle long-term.</p> "
      },
      {
        "name": "Aerilate Lead",
        "description": "<p>Landorus-T is a stellar Stealth Rock lead given its good matchup against Magic Bounce users like Latias and Blissey, as well as its extremely strong Explosion. With a boost and STAB from Aerilate, Explosion can OHKO most foes that do not resist it, such as Tapu Fini, and severely dent resistant Pokemon like Corviknight and Zapdos. In addition, it provides teammates a free switch in while denying any Defog or Rapid Spin attempts, mainly by Corviknight. Earthquake hits Steel-types and Electric-types like Heatran, Tapu Koko, and Jirachi that resist Explosion. Swords Dance boosts Explosion damage to monstrous levels, notably giving a chance to OHKO Corviknight. Alternatively, Body Slam allows Landorus-T to threaten foes with paralysis before using Explosion, which is useful against more offensive teams. Focus Sash is preferred to give Landorus-T an extra turn to work with and guarantee it can set up Stealth Rock. Life Orb is suboptimal for a dedicated lead, but it instead provides extra wallbreaking power for Corviknight and Zapdos. A Jolly Nature is used to outspeed the likes of Genesect and Tapu Lele with a neutral nature.</p> <p>Landorus-T finds its home on hyper offense teams, where dangerous sweepers like Tinted Lens Genesect and Bulk Up Cinderace can take full advantage of a free switch in, as well as Stealth Rock support. Cinderace, alongside other Fire-types like Volcarona, is especially useful to immediately force out a Corviknight that took Landorus-T's Explosion, denying it any chance to use using Defog or Roost. Consequently, strong physical attackers like Terrakion, Zarude, and Garchomp fit well with the pairing, as they greatly benefit from Corviknight being weakened. Focus Sash variants do not require much support, as their main goal is to set up Stealth Rock and use Explosion, but Life Orb variants, being less of suicide leads, appreciate Desolate Land users like Volcarona to take on Water-types like Swampert and Barraskewda. Life Orb Landorus-T especially enjoys teammates like Terrakion and Garchomp, as they burden walls like Corviknight and Tapu Fini to check both them and Landorus-T; this pressure on the walls lessens the need for Landorus-T to heavily chip them but sacrifice itself via Explosion.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 524664, "username": "Osake"}, {"user_id": 523866, "username": "UT"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 476520, "username": "avyrie"}]}
  },
  "Genesect": {
    "comments": "<h1>Other Options</h1> <p>Since Genesect is one of the most versatile Pokemon in the metagame, numerous niche sets can be used to surprise your opponent or pass through specific Pokemon for teammates. A Tinted Lens set can use Choice Band for a super powerful U-turn or Shift Gear to break through Corviknight and virutally guarantee a KO with boosted Explosion. In order to beat Heatran, its biggest check, Genesect can opt for Flash Fire and a fully physical set, but this set lacks damage overall to beat other checks and still loses against Mold Breaker Heatran. Extreme Speed sets with Refrigerate, Galvanize, or Tough Claws can be considered, but they are often outclassed by other Genesect sets and other Extreme Speed users such as Lucario. A set using Serene Grace and Iron Head can muscle through would-be checks, but this set is very luck reliant, needing incredible luck to beat Heatran. Lastly, a physical sweeper set with Guts, Flame Orb, and Facade can be considered to pass through walls with more ease, but this set usually shares the same counters as the others and ends up a very niche pick.</p> <h1>Checks and Counters</h1> <p><strong>Fire-types and Fire-type Coverage: Genesect struggles against Fire-types since they resist its STAB combination and are not weak to any of its coverage moves. Heatran especially takes almost nothing from Genesect and can take advantage of it.</p> <p><strong>Walls</strong>: Once Genesect has revealed its set, it becomes easier to deal with, as each set loses to one or more walls like Swampert and Blissey.</p> ",
    "sets": [
      {
        "name": "Shift Gear",
        "description": "<p>Already one of the tier's strongest wallbreakers and most versatile Pokemon, Genesect is also a terrifying sweeper thanks to Shift Gear, which lets it outspeed virtually the entire metagame, including Choice Scarf users, after a boost. After one setup turn, it can sweep or clean with its BoltBeam coverage and recover HP with Leech Life. No Guard is the most powerful ability, as it allows Genesect to run higher Base Power moves like Zap Cannon and Blizzard. Additionally, the paralysis from Zap Cannon allows Genesect to beat its checks more easily and help other teammates sweep as well. Alternatively, Sheer Force with Ice Beam and Thunderbolt gives Genesect surprise factor, as those moves aren't exclusive to Shift Gear sets. A Mild nature coupled with 32 Attack EVs allows Genesect to 2HKO Blissey with Leech Life after a Shift Gear, while the Speed EVs outspeed Modest Lele before boosting.</p> <p>Pokemon that can take advantage of Genesect paralyzing Heatran, Ferrothorn, and Blissey are very good partners. Primarina is a good example that can beat almost all of Genesect's checks, overwhelming Ferrothorn and threatening Heatran and Volcarona. Genesect appreciates being brought in safely to preserve HP for setting up, so fast pivots such as Choice Scarf Azelf and Landorus-T are good partners. Entry hazard support is also useful to weaken switch-ins, such as Ferrothorn, and put them in range of Genesect’s attacks.</p> "
      },
      {
        "name": "Choice Scarf",
        "description": "<p>Thanks to its great typing and respectable bulk, Genesect can soft check many threats while also serving as a solid revenge killer with Choice Scarf. Its Steel type allows it to come in on Psychic- and Dragon-types such as Tapu Lele and Latios, and its decent bulk lets it come switch into weak neutral attacks, such as Tapu Koko's Thunderbolt. With Choice Scarf, Genesect is only outsped faster Choice Scarf users such as Azelf; this allows it to frequently pivot safely and maximize Regenerator's recovery. Thanks to its great movepool, Genesect can threaten almost the entire metagame; Iron Head hits Fairy-types such as Tapu Lele, Ice Beam threatens Dragon-, Ground-, and Flying-types such as Zapdos and Garchomp, and Flamethrower hits Steel-types that don't mind the other attacks, such as Genesect and Ferrothorn. Full Special Attack investment ensures Flamethrower and Ice Beam get key KOs such as Ferrothorn and Garchomp. The EV spread is highly customizable based on team needs; 104 Attack EVs secures the OHKO on Tapu Lele with Iron Head, while maximum HP investment can allow Genesect to switch into stronger attacks like Tapu Lele's Focus Blast. Genesect is shiny to not reveal that it's lacking Shift Gear.</p> <p>Genesect's coverage regularly forces offensive Pokemon to switch out; Tapu Fini and Blissey are common answers to this set, making wallbreakers that exploit them like Terrakion, Tapu Koko, and Zarude good partners. The last two are particularly good with Genesect, as they too can pivot quite easily to maintain pressure on the opposite team. Defensively, Pokemon such as Toxapex appreciate its ability to come on Tapu Lele, Tapu Koko, and Latios, especially with bulk investment, and in return they check Fire- and Fighting-types that threaten Genesect.</p> "
      },
      {
        "name": "Magic Guard",
        "description": "<p>Magic Guard Genesect is able to use the powerful STAB Steel Beam and Life Orb without recoil. Because Steel-resistant Pokemon rarely switch into Genesect due to its wide coverage, this set reduces predictions and secures massive damage on neutral targets. Thanks to Magic Guard, Genesect is also immune to entry hazards, which allows it to easily come on the field and use U-turn to keep the momentum. Genesect's coverage moves lack any damage amplification from an ability, but they're generally strong enough to power through Pokemon that resist Steel Beam such as Toxapex and Swampert. Genesect is shiny to not reveal that it's lacking Shift Gear. Genesect's coverage moves hit Pokemon that resist Steel Beam; Flamethrower notably OHKOes Ferrothorn, Thunderbolt targets Toxapex, and Energy Ball is its best option to hit Swampert. A mixed Steel Beam + Magic Guard set with Shift Gear could be considered, but is generally inferior to No Guard or Sheer Force sets.</p> <p>Genesect appreciates being brought in on Pokemon it can threaten such as Tapu Lele, Corviknight, and Swampert with pivots such as Zarude and Tapu Koko. Powerful wallbreakers such as Primarina and Terrakion use Genesect's U-turn to freely come in on and threaten foes like Blissey and Heatran. Entry hazard support from Pokemon like Swampert and Garchomp helps chip answers while pivoting, which is the main point of running Genesect over other Magic Guard users such as Volcarona. Defensively, Genesect needs a solid switch-in to Fire-types, especially Heatran due to its 4x resistance to Steel Beam, so partners like Primordial Sea Zapdos are appreciated.</p> "
      },
      {
        "name": "All-out Attacker",
        "description": "<p>Due to Genesect's immense movepool with a multitude of Sheer Force boosted attacks, it is an extremely powerful wallbreaker able to hit many Pokemon super effectively, even if it struggles with four-moveslot syndrome. BoltBeam with Sheer Force and a very good Special Attack allows Genesect to threaten many of the metagame's ubiquitous defensive Pokemon, such as Tapu Fini and Corviknight. The variety of options available on the two last moveslots makes Genesect very difficult to check until all of its attacks have been revealed. Flamethrower allows it to defeat Steel-types such as Ferrothorn, Energy Ball OHKOes Swampert, and Iron Head can pass through the sturdiest special walls such as Blissey. Genesect can theoretically defeat almost the entire metagame with these three moves, but it can't run them all at once. With Iron Head, investing EVs in Attack is an option for better odds to 2HKO Blissey. Genesect is shiny to not reveal that it's lacking Shift Gear.</p> <p>Genesect has very few switch-ins, and it's in competition with Tapu Lele as the best Sheer Force wallbreaker. Even though Genesect has decent bulk and a solid defensive typing, safe entry from Pokemon like Zarude, Tapu Koko, Blissey, and Corviknight is excellent for any wallbreaker. This set's unpredictability means opponents might end up sacking an important Pokemon to it, which strong teammates like Terrakion can take advantage of. However, the main weakness of this set is its difficulty in defeating Fire-types, such as Volcarona and Heatran. Thus, solid answers to those Pokemon such as Primordial Sea Zapdos are necessary.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523886, "username": "UT"}, {"user_id": 375662, "username": "Isaiah"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}, {"user_id": 523886, "username": "UT"}]}], "writtenBy": [{"user_id": 524664, "username": "Osake"}]}
  },
  "Talonflame": {
    "comments": "<h1>Other Options</h1> <p>Talonflame's movepool is shallow, but there are a few other options. U-turn can be run over Swords Dance, or more rarely Flare Blitz, to generate momentum even against teams that have solid answers to it, which is always valuable. Talonflame can also conceivably drop Flare Blitz for Will-O-Wisp and Toxic to cripple some of its switch-ins like Swampert and Unaware Mandibuzz, respectively, but the increased coverage is usually preferred.</p> <h1>Checks and Counters</h1> <p><strong>Primordial Sea Electric-types: Primordial Sea Zapdos and Tapu Koko both have the bulk and typing to switch into Talonflame and force it out with their Electric-type attacks. They also have pivoting and reliable recovery to consistently annoy Talonflame over the course of the match.</p> <p><strong>Flash Fire Corviknight: Talonflame can't hit Corviknight neutrally, and Corviknight can do more than 50% to Talonflame with Brave Bird or use U-turn to bring in a faster threat safely.</p> <p><strong>Unaware</strong>: Unaware Mandibuzz and Mew comfortably avoid being 2HKOed and ignore Swords Dance boosts. However, in a longer game, Talonflame can feasibly stall them out of recovery PP, especially if they lack the ability to punish Talonflame themselves with Foul Play or Thunder Wave.</p> <p><strong>Prankster Toxapex: Similarly to the Unaware checks above, Toxapex can prevent Talonflame from sweeping as long as it has PP for Recover; additionally, it can remove Talonflame’s Life Orb with Knock Off, which reduces its power considerably. It can also be stalled out of recovery in a longer game, however.</p> ",
    "sets": [
      {
        "name": "Magic Guard Attacker",
        "description": "<p>Talonflame has found a welcoming home in Generation 8 Almost Any Ability, being an attacker with good power and coverage that is hard to wear down. In a metagame that has few viable Rock-types, Talonflame's STAB moves provide fantastic coverage, with the only common resistant foes being Primordial Sea Zapdos or Tapu Koko and Flash Fire Corviknight. Thanks to its high Base Power moves and Life Orb, which have their recoil negated by Magic Guard, Talonflame hits surprisingly hard despite having a low Attack stat. For reference, fully physically defensive Swampert cannot safely switch into Talonflame if it is below 80% health, as it risks getting 2HKOed by Brave Bird. Talonflame possesses a great Speed tier for AAA, leaving it only outspeed by Barraskewda, Tapu Koko, and the rare Zamazenta-C. Additionally, it resists every common Triage move and Grassy Glide, making it difficult to revenge kill with priority. Swords Dance amplifies Talonflame's offensive presence, and it can often find time to set up safely against either offensive threats it forces out, like Volcarona and Zarude, or defensive stalwarts that are unable to KO it back like Corviknight and most Mew. Its power, access to setup, and longevity make it particularly effective at breaking down bulkier teams. Talonflame does really need to run maximum Attack and Speed with Jolly to maximize its offensive capabilities.</p> <p>Talonflame fits well on bulky offense or balance teams that want offensive pressure without having to provide much support. Since it is immune to all entry hazards, Talonflame doesn't require hazard control, and Magic Guard means it can't be worn down by stray Toxics or Rocky Helmets (although it does fear paralysis). Since its bulk is not fantastic, it does appreciate slow pivots like Swampert and Corviknight to bring it in safely; in exchange, it forces out foes like Cinderace or Volcarona that may have tried to come in on them. There are some common switch-ins that frustrate Talonflame, however; Primordial Sea Zapdos in particular can't be hit neutrally and forces it out, so teammates that can handle Zapdos like RegenVest Swampert, Blissey, and Silvally-Dragon are always appreciated. Additionally, while Talonflame is fast, most Choice Scarf users and a few faster threats—Tapu Koko and Barraskewda—can revenge kill it reliably. Good revenge killers or solid switch-ins to those are strongly advised; Choice Scarf Azelf is especially notable as a great revenge killer that lets Talonflame in often with U-turn.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 375662, "username": "Isaiah"}, {"user_id": 450411, "username": "Atha"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 523866, "username": "UT"}]}
  },
  "Zygarde-10%": {
    "comments": "<h1>Other Options</h1> <p>Zygarde-10% can utilize Iron Tail to hit Tapu Bulu for super effective damage. Zygarde-10% is able to take advantage of Power Construct to transform into Zygarde-C, which lets it set up using Dragon Dance or Coil and Substitute. This set, however, can be inconsistent and difficult to utilize properly. It can also choose to utilize Dragon Dance without opting for Power Construct, but its poor bulk makes it difficult to set up.</p> <h1>Checks and Counters</h1> <p><strong>Priority Users: Tapu Lele, Zarude, and Tapu Bulu all pose a threat to Zygarde-10% due to its poor bulk, as each of them can OHKO it with their priority moves.</p> <p><strong>Physically Defensive Walls: Pokemon that are able to switch into Zygarde-10% and threaten a KO, such as Dauntless Shield Mew and Choice Scarf Tapu Fini, check Zygarde-10%.</p> <p><strong>Grass-types: Grass-type Pokemon such as Zarude, Dhelmise, and Tapu Bulu are all able to switch into Zygarde-10%'s Thousand Arrows and immediately threaten a KO back with powerful priority attacks.</p> ",
    "sets": [
      {
        "name": "Choice Band Adaptability",
        "description": "<p>Zygarde-10% is a fast and powerful wallbreaker thanks to Adaptability amplifying the damage of Thousand Arrows in conjunction with Choice Band, boosting a previously low Attack stat. Thousand Arrows hits Flying-types such as Corviknight and Skarmory, easing predictions significantly. It can make progress in most cases by using Thousand Arrows, which hits a significant amount of the metagame for neutral damage and has no immunities. Toxic is used to cripple common switch-ins to Zygarde-10%, such as Dauntless Shield Mew and Hippowdon, wearing them down throughout the game. Glare can be used to spread paralysis to help slower teammates beat their checks and to thwart recovery chance from its own checks. Outrage hits most Ground-resistant Pokemon for strong damage, but it is unreliable, as it locks you into it. Extreme Speed is useful priority to finish off weakened Pokemon that are faster than Zygarde-10%, such as Tapu Koko and Barraskewda. This EV spread maximizes Zygarde-10%'s offensive prowess while utilizing its high Speed tier to pressure threats like Terrakion.</p> <p>Zygarde-10% is a good addition to teams that want to remove Steel- and Fire-type foes for its teammates. Its ability to hit common defensive Pokemon such as Corviknight is greatly appreciated by offensive partners such as Zarude. It is also able to beat Fire-types like Heatran that would give common offensive Pokemon such as Tapu Lele and Tapu Koko trouble. Zygarde-10% has poor bulk and is easy to revenge kill with common priority moves from Pokemon such as Zarude and Triage Tapu Lele, so it needs a strong defensive backbone that can switch into these threats, such as Corviknight, Blissey, and Jirachi. Pokemon that can pivot to bring Zygarde-10% onto the field safely, such as Corviknight, Tapu Koko, and Mew, also make strong teammates. Pokemon such as Tapu Lele can assist in breaking down common switch-ins to Zygarde-10% such as Dauntless Shield Mew and Tapu Fini. Stealth Rock users such as Mold Breaker Heatran also help Zygarde-10% by chipping down its common switch-ins over the course of the game. Zygarde-10% also enjoys having reliable entry hazard removal from Pokemon such as Corviknight or and Tapu Fini to prevent it from accumulating chip damage throughout the game.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 524664, "username": "Osake"}]}, {"name": "Grammar checked by", "members": [{"user_id": 297659, "username": "deetah"}]}], "writtenBy": [{"user_id": 539897, "username": "iapt"}]}
  },
  "Volcanion": {"sets": [{"name": "Choice Specs"}]},
  "Incineroar": {"sets": [{"name": "Assault Vest"}]},
  "Primarina": {
    "comments": "<h1>Other Options</h1> <p>Primarina can run a Triage and Calm Mind set to set up and break through teams, but it lacks the immediate power of Primordial Sea and is often outclassed by Tapu Lele. RegenVest is another option to provide slow pivoting to the team, but Swampert's Electric immunity is often better for this role. Psychic is an option to hit Toxapex super effectively, while Scald can be used to burn switch-ins.</p> <h1>Checks and Counters</h1> <p><strong>Blissey and Chansey: Blissey has a very low chance to be 2HKOed by Hydro Pump, and Chansey is never 2HKOed, and they can stall out Primarina's moves or pivot to a teammate.</p> <p><strong>Water-resistant and Immune Pokemon</strong> Since Water is Primarina's primary STAB type, bulky resistant Pokemon such as Vaporeon and Ferrothorn can scout Primarina and switch out. Pokemon that are outright Water-immune through Water Absorb, like Landorus-T, or Desolate Land, like Volcanion or Moltres, serve as strong checks, but Desolate Land users must take Fire-type Weather Ball fairly well.</p> <p><strong>Grass-types: Grassy Surge and Grassy Glide users such as Zarude and Dhelmise can switch into a rain-boosted Water-type move once and threaten to OHKO with their priority; other offensive Grass-types like Tapu Bulu can also threaten an OHKO, while defensive ones like Ferrothorn can wall Primarina.</p> ",
    "sets": [
      {
        "name": "Choice Specs Wallbreaker",
        "description": "<p>Primarina is a powerful special wallbreaker capable of 2HKOing almost every Pokemon in the tier with its rain-boosted STAB moves. Weather Ball is the primary attack and can still damage Desolate Land users, especially Heatran and Cinderace, which may switch into Primarina. Hydro Pump is a slightly stronger, but less accurate, option that can notably 2HKO Blissey after Stealth Rock. Moonblast nails common Dragon-types like Silvally-Dragon and Garchomp while also dealing strong neutral damage to Water-resistant Pokemon like Tapu Bulu and Tapu Fini. Flip Turn pivots out of switch-ins like Blissey into teammates that can take advantage of them such as Terrakion. Maximum Special Attack and Speed EVs help Primarina secure 2HKOs against Pokemon like RegenVest Swampert and outspeed most defensive Pokemon.</p> <p>Physical attackers such as Zarude and Cinderace can exploit common Primarina switch-ins like Blissey and Ferrothorn, as well as forcing out Pokemon that threaten it like Tapu Koko and Tapu Bulu; additionally, they can form a pivot core to better wear down their shared checks. Its Primarina's mediocre Speed tier lets common threats like Zapdos and Zarude revenge kill it, and it appreciates sturdy defensive Pokemon such as Blissey, Ferrothorn, and Corviknight to patch up this weakness. Corviknight provides Defog to prevent entry hazards from chipping Primarina down as it pivots throughout a game; it also acts as a slow pivot to bring Primarina in safely, as do Blissey and Swampert.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 524664, "username": "Osake"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 539897, "username": "iapt"}]}
  },
  "Toxapex": {
    "comments": "<h1>Other Options</h1> <p>Toxapex can run Regenerator to better handle opposing pivots, but this set is worse at checking setup sweepers. A specially defensive Volt Absorb set is an option on more defensive teams to counter Tapu Koko, Zapdos, and Genesect.</p> <h1>Checks and Counters</h1> <p><strong>Ground-type Setup: Swords Dance Garchomp and Bulk Up Landorus-T are able to reliably 2HKO Toxapex with their STAB moves, preventing it from safely removing their boosts.</p> <p><strong>Electric- and Psychic-type Attackers: Toxapex is vulnerable to common offensive attackers in Azelf, Tapu Koko, and Zapdos, as they exploit its uninvested Special Defense with their powerful STAB moves.</p> <p><strong>Offensive Pivots: Pivots like Zarude and Barraskewda, especially when used in conjunction with entry hazard support, can wear down Toxapex and prevent it from recovering by pivoting to a teammate that forces it out.</p> <p><strong>Magic Guard: Toxapex relies almost exclusively on passive damage to threaten foes and its Recover can get PP stalled by Magic Guard Attackers like Talonflame. However, they dislike having their Life Orb removed.</p> ",
    "sets": [
      {
        "name": "Prankster Wall",
        "description": "<p>Thanks to its fantastic defensive typing and bulk, in conjunction with priority recovery and stat clearing with Haze, Prankster Toxapex is a great physical wall and setup deterrent. Its typing provides important resistances to Fire-, Fighting-, and Water-types, checking dangerous physical attackers like Cinderace, Terrakion, and Barraskewda. Toxapex is also one of the few reliable switch-ins to physical Genesect, but it must watch out for special variants. Toxapex's most significant role lies in deterring setup with Prankster Haze, which stops dangerous threats like Cosmic Power Mew and Quiver Dance Volcarona from making progress. It can also serve as an emergency check to threats it does not outright beat like Dragon Dance Power Construct Zygarde-10% and Swords Dance Garchomp by sacrificing itself to remove their boosts. Recover also benefits from Prankster, allowing Toxapex to switch in, sponge a hit, and heal off the damage before taking a second one. Knock Off provides utility by removing items, which can be especially useful against Choice Band users and defensive Pokemon that rely on utility items. The last move slot is more flexible; Scald threatens physical attackers that might consider staying in with a burn, Toxic Spikes help wear down offensive teams, and Toxic weakens potential sweepers. Black Sludge is the preferred item to provide extra recovery, while Rocky Helmet is an option to punish physical attackers, especially if Toxapex is the main Barraskewda switch-in. Maximum HP and Defense investment is necessary to repeatedly switch into dangerous physical attackers, while zero Speed IVs allow Toxapex to outspeed opponents in Trick Room; this is especially important to remove Marowak-Alola's Thick Club with Knock Off.</p> <p>Toxapex is best utilized on balance and bulky offense teams that want to counter a wide range of opposing setup sweepers without devoting space to an elaborate defensive core. Toxapex is a great backstop when an attacker gets forced out; Prankster Haze removes the threat of the opponent using the free turn to set up, and Prankster Recover, plus Toxapex's great bulk, makes it difficult to KO. As such, Toxapex makes a great partner to Choice item wallbreakers such as Terrakion and Azelf. These wallbreakers also appreciate Toxapex's Knock Off and Toxic Spikes, as they wear down the opposing team even faster. Toxapex can also cover for other passive defensive partners like Blissey by denying sweepers that can set up on Blissey. Due to its Ground weakness, Toxapex is unable to check Garchomp, Landorus-T, or Zygarde-10%, so a secondary physically defensive switch-in like Intimidate Corviknight or Dauntless Shield Mew is appreciated. Toxapex is also a poor switch-in to Psychic- and Electric-type attacks, but these tend to be specially-oriented and should be handled by a special wall like Jirachi instead. Since Toxapex is heavily reliant on using Recover to stay healthy, it is vulnerable to entry hazards and opposing pivots. Reliable Defog support from Corviknight and the ability to punish pivots with entry hazard support&amp;mdashwhich includes its own Toxic Spikes&amp;mdash is strongly advised. Since Toxapex does not have access to a pivot move and can often be a momentum drain, it pairs well with other defensive pivots, such as Corvikinght and RegenVest Jirachi, which can generate momentum.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 524664, "username": "Osake"}, {"user_id": 375662, "username": "Isaiah"}]}, {"name": "Grammar checked by", "members": [{"user_id": 277988, "username": "dex"}]}], "writtenBy": [{"user_id": 523866, "username": "UT"}]}
  },
  "Golisopod": {"sets": [{"name": "Triage"}]},
  "Palossand": {
    "comments": "<h1>Other Options</h1> <p>Klutz alongside Assault Vest and Trick allows Palossand to cripple a Defogger that doesn't fear it such as Tapu Fini or Corviknight. Palossand can run some other abilities such as Unaware to better handle Swords Dance Garchomp or Wandering Spirit to punish U-turn, but they generally aren't as useful as the aforementioned abilities.</p> <h1>Checks and Counters</h1> <p><strong>Grass-type Pokemon: Zarude, Dhelmise, and Tapu Bulu all threaten to deal heavy damage to Palossand with their Grass-type STAB attacks. However, they don't want to switch in directly as they fear burn except for Zarude if it runs Jungle Healing.</p> <p><strong>Specially Offensive Pokemon: Strong special attackers like Zapdos and Tapu Lele target Palossand's lower Special Defense stat and can all easily 2HKO it at worst.</p> <p><strong>Water-type Pokemon: If Palossand doesn't run Water Absorb, Barraskewda forces it out, and even defensive Water-types like Toxapex and Swampert threaten Palossand with Scald.</p> ",
    "sets": [
      {
        "name": "Physically Defensive",
        "description": "<p>Palossand is one of the best answers to Terrakion and has several useful utility options. Shore Up allows it to stay healthy throughout a match to consistently check physical attackers. Scorching Sands is preferred over Earth Power thanks to its high burn chance, which deters physical attackers from switching in, especially Zarude. Shadow Ball hits Flying-type Pokemon and works well with Scorching Sands by threatening those with Roost like Talonflame and Corviknight. Toxic can be used instead to punish common switch-ins like Zapdos and Mandibuzz. Palossand has several ability options. Water Absorb allows it to wall Barraskewda, as well as block Flip Turn and Scald from defensive stalwarts like Swampert and Toxapex. It can also provide an emergency switch in to Choice Specs Primordial Sea Pokemon like Inteleon, although it risks getting KOed by a coverage move. Magic Bounce blocks opposing entry hazards and status inducing moves, rendering passive foes such as non-Mold Breaker Skarmory and Hippowdon helpless, as well as blocking Terrakion's Toxic. Dauntless Shield is another option that gives Palossand better odds against dangerous physical attackers like Adaptability Zygarde-10%, Galarian Zapdos, and Pixilate Tapu Koko. Rocky Helmet is its item of choice to punish U-turn from offensive threats, while Leftovers helps it gain extra recovery. 2 Speed IVs helps Palossand deal with Stakataka better while still outspeeding Ferrothorn.</p> <p>Palossand fits best on bulkier builds that need a Terrakion counter. Flying-type Pokemon such as Corviknight and Mandibuzz make for good partners for Palossand, as they can deal with physical Grass-types like Zarude and Dhelmise, while Palossand can check Barraskewda and Terrakion for them. Additionally, Dauntless Shield Palossand can handle Zygarde-10% for its Flying-type teammates, while they can provide entry hazard removal with Defog. Offensive Pokemon like Tapu Koko and Talonflame that struggle against Barraskewda appreciate Water Absorb Palossand handling it and setting Stealth Rock to chip their checks. Special walls are required to cover for Palossand. In particular, Blissey can handle Zapdos, Chandelure, and Hydreigon, while Magic Bounce Palossand prevents defensive foes from using Blissey to set entry hazards. Jirachi takes on Psychic-type special wallbreakers such as Latios, Tapu Lele, and Azelf that give Palossand problems. If Palossand doesn't run Water Absorb, teammates that can repeatedly switch into Flip Turn are appreciated. Examples include Tapu Fini and Desolate Land Moltres. It's also fairly passive and thus requires bulky teammates with a pivot option to regain momentum, notably the aforementioned Mandibuzz and Blissey.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 524664, "username": "Osake"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 500884, "username": "longhiep341"}]}
  },
  "Silvally-Dragon": {
    "comments": "<h1>Other Options</h1> <p>Grass Pledge allows for immediate damage on Swampert, always 2HKOing physically defensive sets. However, this means Silvally-Dragon has to forgo coverage for Steel-types or its ability to threaten Volcarona with Rock Slide. Draco Meteor provides Silvally-Dragon with a strong STAB move that deters greedy Dragon-types like Garchomp from setting up, but this leaves it walled by Steel-types.</p> <h1>Checks and Counters</h1> <p><strong>Fairy-types: Fairy-types like Tapu Koko, Primarina, and Tapu Lele all force out Silvally-Dragon due to their powerful STAB moves. While only a Pixilate Facade from Tapu Koko can OHKO Silvally-Dragon, all of them severely dent it. However, apart from Magic Guard Tapu Koko, all of them cannot switch into Silvally-Dragon for fear of getting crippled by Poison Fang, and even Magic Guard Tapu Koko can be pivoted on.</p> <p><strong>Wandering Spirit: Like many Regenerator users, Silvally-Dragon dislikes having its ability removed. This is especially troublesome considering the move it uses the most, U-turn, makes contact, meaning that Wandering Spirit will invalidate Regenerator.</p> <p><strong>Knock Off</strong>: Assault Vest heavily augments Silvally-Dragon's special bulk. Therefore, Knock Off from Pokemon like Ferrothorn, Azelf, and Toxapex limits Silvally-Dragon's ability to switch into what it wants to.</p> <p><strong>Residual Damage: Silvally-Dragon's only form of recovery is Regenerator, so forms of residual damage such as entry hazards, status, and random chip damage can quickly rack up if Silvally-Dragon is not managed properly.</p> ",
    "sets": [
      {
        "name": "RegenVest",
        "description": "<p>Silvally-Dragon's set of resistances, wide movepool, and great special bulk makes it a solid defensive pivot, most notably switching into Desolate Land and Primordial Sea users such as Heatran, Volcarona, Zapdos, and Volcanion. It is also netural to Psychic, allowing to safely scout Choice-locked Psychic Surge users like Azelf and Alakazam and pivot out. U-turn is the most important move on the set, allowing Silvally-Dragon to switch into an attacker and then pivot to an attacker or favorable matchup. Rock Slide hits Fire-types like Volcarona, which Silvally-Dragon can easily come in on. Poison Fang threatens Pokemon like Tapu Fini, Blissey, and Swampert with a high chance of Toxic poison if they switch in. Flamethrower threatens Steel-types like non-Flash Fire Ferrothorn and Genesect. Assault Vest and Regenerator keep Silvally-Dragon bulky and healthy in conjunction with U-turn; it does not require a Dragon Memory or RKS System to maintain its Dragon typing. A Sassy nature and 0 Speed IVs ensure that Silvally-Dragon has the slowest U-turn possible to get teammates in safely, underspeeding Pokemon like Jirachi and Mew.</p> <p>Silvally-Dragon generally fits on balance and bulky offense builds, as powerful wallbreakers such as Tapu Lele, Terrakion, and Zarude appreciate coming in freely, while defensive support can take some pressure off. Since Steel covers all of Dragon's weaknesses, Steel-types like Jirachi and Corviknight are solid partners to pivot into threats like Tapu Lele, Garchomp, and Genesect with an Ice-type move. In return, Corviknight can remove entry hazards to support Silvally-Dragon's pivoting. Regenerator Genesect is also a solid partner, capable of checking Pokemon that force out Silvally-Dragon like Tapu Fini. They can form a powerful pivoting core that is highly resistant to chip damage. Offensive partners that can scare out the Fairy- and Dragon-types Sivally-Dragon dislikes, such as Zamazenta-C and Tapu Koko, are also good choices.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 375662, "username": "Isaiah"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 414072, "username": "Heracross2.0"}]}
  },
  "Dhelmise": {
    "comments": "<h1>Other Options</h1> <p>Dhelmise can run Adaptability to strengthen Poltergeist, but it then is reliant on a teammate to set Grassy Terrain for it. Dhelmise can also run Heavy-Duty Boots and Rapid Spin to focus more on removing entry hazards, but due to its mediocre bulk, it is generally outclassed here by Corviknight or Tapu Fini. Synthesis is also an option to provide more longevity, but Dhelmise has good recovery through Grassy Terrain and normally should be firing off attacks.</p> <h1>Checks and Counters</h1> <p><strong>Unaware Mandibuzz: Mandibuzz resists all of Dhelmise's attacks, has reliable recovery, and can OHKO it back with Foul Play.Unaware also ignores Swords Dance boosts. It does not appreciate taking Switcheroo, but Dhelmise cannot break past it on its own.</p> <p><strong>Intimidate Corviknight</strong>: Intimidate Corviknight can switch into any of Dhelmise's attacks from full health and threaten to KO back with Brave Bird. It can be overwhelmed with sufficient chip damage, however.</p> <p><strong>Fast Grass-resistant Pokemon</strong>: Talonflame, Zapdos, and Zarude all outspeed Dhelmise, resist Grassy Glide, and can OHKO it back.</p> <p><strong>Itemless Grass-resistant Pokemon: While rare, itemless Grass-resistant Pokemon like Dauntless Shield Galarian Slowking can wall Dhelmise. Switcheroo can make them susceptible to Poltergeist, however.</p> ",
    "sets": [
      {
        "name": "Swords Dance",
        "description": "<p>Swords Dance Dhelmise is a powerful priority user and wallbreaker with good longevity. With its Grassy Terrain, Grassy Glide becomes a powerful priority move that revenge kills offensive threats like Barraskewda and Terrakion. Grassy Terrain recovery also mostly offsets its Life Orb recoil. Poltergeist threatens most of the tier's Grass-resistant Pokemon including Heatran, Zapdos, and Talonflame, which may switch in on a predicted Grassy Glide. After a Swords Dance, Dhelmise can break through tougher defensive Pokemon like Intimidate Corviknight or clean up weakened teams with Grassy Glide. Power Whip is Dhelmise's strongest available attack, securing the unboosted OHKO on Blissey and 2HKO on Toxapex, while Rapid Spin lets it boost its Speed and remove entry hazards; Dhelmise is still not a reliable entry hazard remover due to its vulnerability to all entry hazards, but it can be a useful secondary option due to the free turns it generates. While Dhelmise's bulk is not amazing, its Fighting immunity and Ground resistance can frustrate common wallbreakers such as Terrakion and Zygarde-10%, providing defensive utility. 40 Speed EVs outspeed minimum Speed Corviknight.</p> <p>Dhelmise fits well on balance and offensive teams as a priority user and wallbreaker. Grassy Terrain is fantastic for defensive partners that lack recovery of their own such as Heatran, which especially appreciates Grassy Terrain lessening its Earthquake weakness and Dhelmise switching into Ground- and Fighting-type attacks aimed at it. Since common physical walls such as Corviknight take heavy damage trying to check Chelmise, teammates like Terrakion can power through after. Dhelmise also pairs well with slow pivots like Blissey and Swampert, which can get it in safely to fire off Grassy Glide or Poltergeist. Dhelmise has poor synergy with Knock Off users, as they render foes immune to Poltergeist. Dhelmise is unable to beat Mandibuzz, so Tapu Koko and Zapdos make good teammates to switch into it reliably. They can also bring Dhelmise in on specially defensive walls they dislike such as Blissey.</p> "
      },
      {
        "name": "Choice Band",
        "description": "<p>Choice Band Dhelmise offers immediate wallbreaking and revenge killing prowess in one teamslot. Grassy Glide OHKOes dangerous offensive threats like Tapu Koko, Barraskewda, and Terrakion, and it can threaten others like Garchomp with chip damage. Poltergeist is a powerful STAB attack with excellent neutral coverage that can 2HKO defensive stalwarts like Ferrothorn. Switcheroo cripples the few reliable defensive answers to Dhelmise like Mandibuzz and Intimidate Corviknight. Switcheroo also beats rare itemless walls like Galarian Slowking, which could otherwise check Dhelmise. Swords Dance is an option in the last moveslot to boost its power after using Switcheroo, while Power Whip is an option to secure the OHKO on Blissey and 2HKO on Toxapex. Despite its mediocre bulk, Dhelmise still provides good defensive utility with a Fighting immunity, Ground resistance, and supportive Grassy Terrain.. Maximum Speed EVs allow Dhelmise to outspeed Corviknight.</p> <p>Choice Band Dhelmise fits well on offensive and balance teams that want priority and wallbreaking in the same teamslot. Due to its relatively poor bulk, Dhelmise pairs well with offensive pivots like Tapu Koko and Azelf, which bring it in safely on special walls like Blissey and Jirachi. It also pairs well with attackers that lack their own recovery and appreciate Grassy Terrain like Desolate Land Heatran. Due to its reliance on Poltergeist and Grassy Surge, Dhelmise is a poor partner for Pokemon that rely on Knock Off or Earthquake like Landorus-T and Garchomp. Dhelmise has a hard time breaking through Intimidate Corviknight and Unaware Mandibuzz, so teammates that threaten them like Zapdos and Tapu Koko are appreciated. Dhelmise can also struggle against faster offensive threats that resist Grass like Talonflame and Zarude, so revenge killers like Choice Scarf Azelf make good teammates.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 524664, "username": "Osake"}, {"user_id": 375662, "username": "Isaiah"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 523866, "username": "UT"}]}
  },
  "Tapu Koko": {
    "comments": "<h1>Other Options</h1> <p>Calm Mind is a great alternative over U-turn, changing Tapu Koko's role from an offensive pivot to a formidable setup sweeper. It can also run Grass Knot to 2HKO specially defensive Swampert, or OHKO physically defensive variants, though forgoing one of its STAB moves limits its power. It can run a physical Magic Guard set with Wild Charge, Brave Bird, U-turn, and Roost or Toxic; this set can beat special walls like Heatran, but is otherwise outclassed by the listed sets. Primordial Sea has a good niche in checking Fire-types, mainly Talonflame, and a perfectly accurate Thunder, while still offering decent power and revenge killing ability; however, it is unable to check other key Fire-types like Cinderace and Entei and is largely outclassed by Zapdos, which offers better bulk, higher power, and amazing coverage. Levitate is a decent alternative on Calm Mind sets, as it beats Tapu Koko's biggest check in Landorus-T, and turns other Ground-types into setup fodder. Refrigerate Hyper Voice is another niche to beat Ground-types that is able to swiftly eliminate the likes of Landorus-T and Garchomp, though Ice-type coverage sees limited use otherwise. Additionally, both lets forgo Magic Guard, making them more susceptible to being worn down.</p> <h1>Checks and Counters</h1> <p><strong>Ground-types: Common Ground-types such as Landorus-T can switch into any move other than Facade and force out Tapu Koko with a Ground-type move. Specially defensive Garchomp can tank a Dazzling Gleam and KO back.</p> <p><strong>Volt Absorb</strong>: Volt Absorb users like Corviknight and Toxapex can also switch into any attack, but have to watch out for Taunt denying their recovery.</p> <p><strong>Revenge Killers: Tapu Koko crumbles to any faster Pokemon, such as Azelf, Barraskewda, Choice Scarf Landorus-T, and Choice Scarf Genesect, given its middling bulk. The latter two can also switch into Electric- and Fairy-type attacks, respectively. Priority users, namely Zarude and Dhelmise, threaten to OHKO Tapu Koko with Grassy Glide.</p> <p><strong>Specially Defensive Steel-types: Ferrothorn resists Tapu Koko's dual STAB move combination and threatens to 2HKO or set up Spikes. RegenVest Jirachi can soak up any attack and bring in a revenge killer via U-turn; Heatran take little from any of Tapu Koko's attacks and threatens to trap it using Magma Storm; however, non-Regenerator Heatran has to be careful not to take too much chip as its only source of recovery is Leftovers.</p> ",
    "sets": [
      {
        "name": "Offensive Pivot",
        "description": "<p>With blazing speed, strong STAB move combination, access to Roost, and a useful set of resistances, Tapu Koko is one of the best offensive pivots in the tier. Its Speed tier allows it to revenge kill key threats such as Talonflame, Terrakion, and Latios. Dazzling Gleam is a good secondary STAB move that reliably hits Pokemon that resist Thunderbolt such as Landorus-T, Garchomp, and Zarude. Magic Guard and Roost give Tapu Koko decent longevity to offensively check threats like Talonflame and Zapdos throughout a game. Life Orb also pairs well with Magic Guard and gives Tapu Koko a free boost to make up for its mediocre attacking stats. U-turn allows it to pivot out of bad matchups such as the aforementioned Ground-types, as well as Heatran and Blissey.</p> <p>Tapu Koko easily fits on bulky offense and balance teams in need of a revenge killer or a pivot. Wallbreakers like Terrakion and Dhelmise are great offensive partners: the former capitalizes on the special walls Tapu Koko forces in, such as Heatran, and is extremely difficult to switch into; the latter covers Tapu Koko's weakness against Ground-types and turns them into setup fodder while also providing Grassy Terrain support. In return, Tapu Koko threatens their checks like Tapu Fini and Corviknight. Heatran also deserves special mention, as it is one of the best Stealth Rock setters in the tier and is able to chip down special walls like Landorus-T and Blissey. Furthermore, it lures in and poisons Zapdos, which lets Tapu Koko beat non-Weather Ball variants more reliably. Tapu Koko struggles with Ground-types in general, especially Choice Scarf Landorus-T, so it is necessary to pair it with Flying-types like your own Landorus-T and Corviknight. Wandering Spirit variants are especially helpful, as they can remove Regenerator from Swampert's and Landorus-T, eventually chipping them into KO range of Dazzling Gleam. Both Landorus-T and Corviknight also form potent VoltTurn cores with Tapu Koko and can switch into faster threats like Choice Scarf Azelf and Zarude.</p> "
      },
      {
        "name": "Pixilate",
        "description": "<p>With very few physically defensive walls that resist Fairy-type in the tier, and many of the relevant ones being weak to Electric, Pixilate Facade Tapu Koko excels in putting tremendous pressure onto defensive builds. Facade, when boosted by Flame Orb and Pixilate, is very strong and can 2HKO many neutral foes like Landorus-T, Zapdos, and Swampert. Volt Switch allows Tapu Koko to pivot out of unfavorable matchups like Heatran while hitting Corviknight and Toxapex super effectively; Thunderbolt allows it to actually beat the aforementioned Corviknight and Toxapex, as they can otherwise use a recovery move as Tapu Koko uses Volt Switch. Roost is mandatory to offset burn and entry hazard damage. Taunt prevents its switch-ins like Volt Absorb Corviknight from healing and pairs very well with Volt Switch to weaken foes. Work Up is usable to boost both of Tapu Koko's attacking stats, allowing it to function as a cleaner, though Facade is already strong enough to pick off weakened foes, and boosted Thunderbolt is still weak. A Jolly nature is preferred to preserve bulk; Hasty nature is also an option on Work Up variants, notably being able to 2HKO Toxapex.</p> <p>Tapu Koko fits on most balance and offense teams thanks to its top-notch Speed tier and its ability to keep opposing walls at low health. As such, it pairs well with entry hazards setters like Swampert and Heatran to chip down foes. Tapu Koko pairs well with strong attackers in general, as it is able to either wallbreak early-game or clean up late-game. Zygarde-10% is a prime partner to form a core with Tapu Koko where they both can either wallbreak or clean up; Tapu Koko can Taunt shared checks like Dauntless Shield Mew and keep them at low health, while using Volt Switch against checks like Heatran and Jirachi to bring in Zygarde-10%. Tapu Koko is frail, especially considering burn damage, so it appreciates a defensive pivot to safely bring it in. Vaporeon is remarkably a good partner as it can use Wish + Flip Turn to reliably heal Tapu Koko. A Flying-type like Landorus-T or Zapdos is also essential to alleviate Tapu Koko's glaring weakness to Ground-types; they are also helpful in checking Heatran, which is the single largest roadblock to Tapu Koko given its 4x Fairy resistance.</p> "
      },
      {
        "name": "Dual Screens",
        "description": "<p>Tapu Koko is one of the best screens setters in the tier thanks to a great Speed tier and access to Taunt, which is able to prevent Defoggers like Corviknight from removing its screens and setup sweepers like Genesect and Volcarona from boosting. U-turn brings in teammates while preserving Tapu Koko to set up screens later in the game. Magic Bounce prevents entry hazards which is particularly useful for hyper offense teams; with Taunt, it is also able to shut down Mold Breaker leads like Heatran and Shuckle. Light Clay allows dual screens to last for an extra 3 turns, giving additional protection for its teammates. Maximum HP and Speed investment allow Tapu Koko to be as bulky as possible while outspeeding every Pokemon up to Talonflame to set up screens before the opponent attacks. 248 Speed EVs is also an option to move after opposing Tapu Koko, allowing it to bring in teammates safely.</p> <p>Tapu Koko is a great asset on hyper offensive teams, as dangerous sweepers like Tapu Lele, Genesect, and Togekiss can take full advantage of dual screens to set up Belly Drum, Shift Gear, and Nasty Plot, respectively, and become much harder to revenge kill. However, Tapu Koko might not be able to get both screens up against common Ground-type leads like Swampert, so switch-ins like Dhelmise are necessary to prevent the opponent from freely using Earthquake. Dhelmise also provides useful priority and good wallbreaking potential. Teammates that can pressure Corviknight and Tapu Fini, like Cinderace, are essential to prevent the opponent from bringing in their Defogger once Tapu Koko is switched out.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 524664, "username": "Osake"}, {"user_id": 523866, "username": "UT"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 476520, "username": "avyrie"}]}
  },
  "Tapu Lele": {
    "comments": "<h1>Other Options</h1> <p>Tapu Lele can utilize Tinted Lens to threaten its common switch-ins, such as Heatran, with its powerful STAB moves, but it loses significant power versus neutral targets. Sheer Force Tapu Lele can also run Psyshock to beat Pokemon like Blissey that would otherwise be difficult for it to deal with, or opt for Psychic to to beat some of its more reliable checks such as Volt Absorb Toxapex and defensive Volcarona.</p> <h1>Checks and Counters</h1> <p><strong>Faster Fire- and Steel-types: Cinderace and Genesect outspeed Tapu Lele, cannot be OHKOed by +1 Draining Kiss, and reliably OHKO back.</p> <p><strong>Regenerator Steel-types: RegenVest Jirachi and Choice Scarf Regenerator Genesect are capable of switching into Tapu Lele's attacks and threatening it out with super effective STAB attacks or pivoting into a revenge killer.</p> <p><strong>Blissey and Chansey: Blissey and Chansey are capable of surviving any single hit from Tapu Lele and are able to cripple it with status or pivot into a revenge killer.</p> <p><strong>Priority Immunity</strong>: Psychic Surge Azelf frustrate Triage Tapu Lele by shutting down its priority.</p> <p><strong>Bulletproof Heatran: Bulletproof Heatran is not 2HKOed by any of Tapu Lele's moves and can OHKO back with a Steel-type move.</p> ",
    "sets": [
      {
        "name": "Triage",
        "description": "<p>Tapu Lele is a strong setup sweeper. Triage gives Draining Kiss +3 priority, providing Tapu Lele with a powerful priority move that also consistently recovers health and helps offset Life Orb recoil. Draining Kiss also revenge kills strong sweepers such as Terrakion. Psyshock deals heavy damage to specially defensive Pokemon like Blissey and RegenVest Swampert. Calm Mind helps Tapu Lele set up and break through sturdy special walls such as Heatran; since Tapu Lele relies heavily on Draining Kiss, it often needs a boost to do enough damage to sweep. Focus Blast heavily damages Steel-types like Heatran and Ferrothorn that resist Tapu Lele's other moves. Thunderbolt is another option to hit Pokemon like Corviknight and Tapu Fini for super effective damage while being perfectly accurate; however, they are still hit hard by Tapu Lele's other coverage moves. 112 Speed EVs outspeed Modest Heatran.</p> <p>Powerful wallbreakers such as Terrakion, Cinderace, and Dhelmise enjoy Tapu Lele's ability to clean once they have weakened the defensive core. Tapu Lele often struggles to break through specially defensive pivots like RegenVest Jirachi and Regenerator Genesect, so Terrakion, Heatran, and Cinderace make good teammates to deal with them. Tapu Lele appreciates reliable entry hazard setters such as Mold Breaker Heatran to wear down its switch-ins. Tapu Lele has a hard time against faster Pokemon that resist Draining Kiss such as Talonflame, Cinderace, and Genesect, as well as other priority users that can take a hit and OHKO back like Triage Tapu Bulu and Grassy Surge Dhelmise. Bulky defensive teammates such as Tapu Fini and Dauntless Shield Mew can reliably switch into these threats. Due to its relative frailty, Tapu Lele enjoys having slow pivots such as Corviknight and Blissey to bring it safely onto the field. Tapu Lele also struggles against Psychic Surge users, the most common being Azelf, and enjoys having teammates that can override Psychic Terrain such as Grassy Surge Zarude.</p> "
      },
      {
        "name": "Sheer Force",
        "description": "<p>Sheer Force Tapu Lele is a powerful special wallbreaker that breaks through many of the common specially defensive switch-ins, including Blissey, RegenVest Swampert, and RegenVest Silvally-Dragon. Sheer Force and Life Orb boost its already high power without taking recoil. Tapu Lele does not have many reliable switch-ins and can often attack without predicting, as the switch-in will still be KOed by the appropriate coverage move on the next turn. Moonblast is its only STAB move and deals significant damage to neutral targets like Mew and Zapdos. Focus Blast hits Steel-types like Heatran and Ferrothorn for super effective damage and 2HKOes Blissey. Thunderbolt provides coverage against Corviknight, Tapu Fini, and Toxapex, while Energy Ball OHKOes Assault Vest Swampert. A Modest nature is necessary to secure key KOs like Heatran and Tapu Fini after Stealth Rock.</p> <p>Tapu Lele enjoys having strong physical attackers such as Terrakion to help it break through dedicated special switch-ins like Assault Vest Jirachi. In return, Terrakion enjoys Tapu Lele bringing in specially defensive Pokemon that it can threaten such as Blissey. Tapu Lele has no way of recovering HP and is prone to chip damage from entry hazards, so it appreciates reliable Defoggers such as Corviknight. Due to its mediocre Speed, Pokemon that can outspeed Tapu Lele and threaten an immediate KO such as Barraskewda and Terrakion and are potent revenge killers. Because of this weakness, Tapu Lele enjoys having sturdy defensive Pokemon on its team such as Corviknight, Tapu Fini, and Blissey, as well as teammates with high Speed or strong priority moves such as Barraskewda, Scarf Tapu Fini, and Grassy Surge Zarude.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 524664, "username": "Osake"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 539897, "username": "iapt"}]}
  },
  "Tapu Bulu": {
    "comments": "<h1>Other Options</h1> <p>Synthesis provides instant recovery to Tapu Bulu, but extra coverage is generally preferred. Bulk Up is an option to boost Defense as well as Attack, but the more immediately threatening nature of Swords Dance is usually better. Magic Bounce Tapu Bulu walls Swampert and Zygarde-10% while also providing entry hazard control, but the increased bulk requirements and need to run Synthesis cut significantly into its power. High Horsepower is also an option to hit Heatran harder that does not lower defenses, but Close Combat and Stone Edge are usually preferred.</p> <h1>Checks and Counters</h1> <p><strong>Intimidate / Dauntless Shield physical walls: Intimidate or Dauntless Shield users, such as Corviknight and Mew, are solid checks to Tapu Bulu. They can, however, be overwhelmed by Swords Dance; this is especially the case for Mew if Tapu Bulu is running Darkest Lariat, but it can usually, at worst, force a trade.</p> <p><strong>Fast Grass-resistant Pokemon: Faster Flying-, Fire-, and Steel-types such as Talonflame, Zapdos, and Genesect all outspeed Tapu Bulu, resist Horn Leech, and OHKO it back. However, they have a hard time directly switching in for fear of Stone Edge.</p> <p><strong>Psychic Surge Users: Psychic Surge users such as Azelf block Horn Leech, outspeed Tapu Bulu, and can KO it with their boosted STABs.</p> <p><strong>Wandering Spirit: Wandering Spirit Landorus-T and Corviknight frustrate Tapu Bulu by removing Triage and forcing it out. They are often only one-time checks, but that can be enough to deny a sweep.</p> ",
    "sets": [
      {
        "name": "Triage",
        "description": "<p>Thanks to Triage and its powerful Horn Leech, Tapu Bulu is a strong cleaner with great power in AAA. +3 priority Horn Leech makes up for Tapu Bulu's poor Speed and most forms of speed control, allowing it to clean up weakened teams in addition to wallbreaking for teammates. Due to its decent bulk and useful set of resistances, plus the threat of Horn Leech, Tapu Bulu is able to set up with Swords Dance on many prominent attackers including Tapu Koko, Barraskewda, and Zarude. Thanks to Horn Leech's significant recovery, Tapu Bulu is able to utilize Life Orb and even take damage while setting up and still power through opposing teams. Close Combat provides strong coverage, OHKOing Heatran after Stealth Rock and doing significant damage to Corviknight when boosted. The last moveslot is flexible; Stone Edge hits common Grass-resistant Pokemon like Zapdos, Mandibuzz, Talonflame, and Volcarona, while Darkest Lariat beats Dauntless Shield Mew and defense boosters like Bulk Up Corviknight. 132 Speed EVs outspeeds defensive Heatran and Moltres while still maintaining extra bulk to help with setup. A faster spread of 72 HP / 252 Atk / 184 Spe with a Jolly nature is another option to outspeed Modest Heatran.</p> <p>Tapu Bulu is a great choice for balance and offense teams that want a cleaner that can also serve as a wallbreaker. Due to its ability to lure in and weaken common physical walls like Intimidate Corviknight, it pairs well with other strong physical attackers like Terrakion and Barraskewda. Tapu Bulu struggles to beat fast Fire- and Flying-types such as Entei, Cinderace, Talonflame, and Zapdos, as they resist Horn Leech and can OHKO it back. Strong answers to these, like Primordial Sea Zapdos, Flash Fire Corviknight, and Blissey make good partners. Tapu Bulu enjoys coming in on special walls that it can threaten out, giving it a free turn to attack or set up; Tapu Koko is a great option to lure in and pivot out on Blissey and Assault Vest Jirachi. Partners that can set and keep Stealth Rock up like Mold Breaker Heatran help Tapu Bulu clean by chipping foes over time. Mandibuzz and Choice Scarf Regenerator Genesect are both strong checks to Tapu Bulu, so solid switch-ins to these like Corviknight and Heatran can help check these threats. Psychic Surge Azelf is difficult for Tapu Bulu to handle due to it blocking Horn Leech, making partners like Jirachi solid choices.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 524664, "username": "Osake"}, {"user_id": 375662, "username": "Isaiah"}]}, {"name": "Grammar checked by", "members": [{"user_id": 277988, "username": "dex"}]}], "writtenBy": [{"user_id": 523866, "username": "UT"}]}
  },
  "Tapu Fini": {
    "comments": "<h1>Other Options</h1> <p>Dauntless Shield is an option instead of Regenerator in order to add to Tapu Fini's bulk, but it comes at the cost of lacking reliable recovery outside of Leftovers. Ice Beam can be slotted in over any of the slashed moves, but outside of dealing high damage to Landorus-T and Garchomp it has limited usefulness.Toxic is another option to hit Tapu Fini, non Magic-Bounce Blissey, and Desolate Land Pokemon such as Moltres and Cinderace.</p> <h1>Checks and Counters</h1> <p><strong>Desolate Land Fire-types: Desolate Land users such as Moltres and Heatran are immune to Scald and can carry Solar Beam to easily 2HKO Tapu Fini. Heatran gets a special mention because it doesn't mind its item being removed by Tapu Fini in exchange for being able to trap and KO with Magma Storm. Volcarona can use Quiver Dance repeatedly in the face of Tapu Fini, and offensive variants can 2HKO even with unboosted Solar Beam or Giga Drain.</p> <p><strong>Grass-types: Zarude, Dhelmise, and Tapu Bulu, can all threaten an OHKO on Tapu Fini.</p> ",
    "sets": [
      {
        "name": "Regenerator Pivot",
        "description": "<p>Tapu Fini's access to utility moves such as Defog, Haze, and Knock Off allows it to excel as a defensive pivot to a wide array of attackers. The combination of Moonblast and Knock Off in particular enables Tapu Fini to cripple Heavy Duty Boots and Assault Vest users while retaining a strong Fairy-type STAB move. Tapu Fini's typing and bulk allow it to serve as a blanket check to prominent physical attackers like Garchomp, Barraskewda, and Terrakion; the use of Rocky Helmet serves as a means for Tapu Fini to switch in and passively limit the amount of times they can attack successfully. Leftovers allows Tapu Fini to slightly increase its passive recovery so that it doesn't have to switch immediately versus opposing attackers. Tapu Fini also serves as one of the most effective counters to Barraskewda, as it can easily restore chip damage from Flip Turn with Regenerator while punishing Barrskewda with Rocky Helmet. Because common Stealth Rock users such as Swampert and Garchomp don't tend to carry moves that are immediately threatening to Tapu Fini, it's able to Defog Stealth Rock away consistently with the option of also removing potential Swords Dance boosts or threatening to burn with Scald. Tapu Fini also retains the ability to check setup sweepers in general: Quiver Dance Volcarona for example can be dealt with to an extent by resetting its stat changes with Haze, but Tapu Fini is not the most reliable long-term answer to them. Knock Off can also be used to potentially remove useful items like Leftovers and Rocky Helmet from Pokemon that rely on them, making Tapu Fini a very versatile utility user.</p> <p>Tapu Fini fits onto virtually any type of team; it can work on balance, offense, and even stall. Magic Bounce Blissey gets a special mention because it pairs with Tapu Fini notably well by preventing entry hazards and checking special attackers that would otherwise give Tapu Fini trouble like Tapu Koko and Heatran. Ground-types such as Swampert and Garchomp enjoy having Tapu Fini as a teammate because they cover for its weakness to Electric-type attacks and can make progress by going for Stealth Rock. Tapu Fini also largely benefits from teammates like Mandibuzz, Zapdos, and Moltres that can patch up its weakness to Grass-type attacks from common users such Volcarona, Tapu Bulu, and Zarude. It's also worth noting that despite being a Water-type, Tapu Fini struggles versus especially powerful Fire-type attacks from Pokemon like Choice Specs Volcanion and offensive Heatran, so Flash Fire and Primordial Sea users like Corviknight and Zapdos can alleviate the pressure for it.</p> "
      },
      {"name": "Choice Scarf"}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 475804, "username": "The Number Man"}, {"user_id": 523866, "username": "UT"}]}, {"name": "Grammar checked by", "members": [{"user_id": 241023, "username": "Kris"}]}], "writtenBy": [{"user_id": 375662, "username": "Isaiah"}]}
  },
  "Nihilego": {"sets": [{"name": "Regenerator"}, {"name": "Unburden Sweeper"}]},
  "Xurkitree": {
    "comments": "<h1>Other Options</h1> <p>Xurkitree can use Surge Surfer and Choice Specs on teams with a dedicated Electric Surge setter, allowing it to be a fast, powerful sweeper. Transistor is also an option on Electric Terrain teams, giving Xurkitree a chance to OHKO Blissey from full. Calm Mind can be used on sets without Choice items to further boost its damage output, but it is frail and difficult to set up. No Guard is another option, allowing Xurkitree to use Zap Cannon with perfect accuracy, spreading paralysis and making up for its poor Speed.</p> <h1>Checks and Counters</h1> <p><strong>Ground-types and Volt Absorb: Specially defensive Ground-types such as Garchomp, Nidoqueen, and Assault Vest Landorus-T can safely switch into Xurkitree's STAB moves, and are not OHKOed by Energy Ball or Dazzling Gleam. Pokemon such as Corviknight also can run Volt Absorb, making them effective Xurkitree counters.</p> <p><strong>Bulky Grass- and Dragon-types: Pokemon such as Ferrothorn and Silvally-Dragon can safely switch in on Choice Scarf Xurkitree's moves without fear and either set up entry hazards or pivot out to a teammate who threatens Xurkitree. It is important to note, however, that these can be overwhelmed by Choice Specs and Transistor sets.</p> <p><strong>Choice Scarf and Priority Users: Choice Scarf users such as Azelf and priority users such as Zarude are able to move before Xurkitree and threaten it with an OHKO.</p> <p><strong>Terrain Surge Users: Users of Grassy or Psychic Surge such as Zarude and Azelf are problems for Xurkitree, as taking away its Electric Terrain significantly decreases Xurkitree's damage output.</p> ",
    "sets": [
      {
        "name": "Electric Surge",
        "description": "<p>Xurkitree is the strongest user of Rising Voltage, making it an excellent candidate for Electric Surge. Rising Voltage is Xurkitree's main form of damage, threatening OHKOs against common Pokemon such as Tapu Fini, Terrakion, Corviknight, and Azelf. Volt Switch allows Xurkitree to generate momentum by pivoting on switch-ins such as Blissey and Zarude. Dazzling Gleam hits Pokemon like Zarude, Garchomp, and Zygarde-10%, who either resist or are immune to its Electric moves. Energy Ball is Xurkitree's main way of damaging Ground-type switch-ins like Swampert, Hippowdon, and Palossand. Choice Scarf lets Xurkitree outspeed many common offensive Pokemon such as Talonflame and Barraskewda, while Choice Specs can be used to increase Xurkitree's damage, securing a 2HKO against Chansey and Calm Blissey and an OHKO against RegenVest Swampert after minimal chip; Magnet is also an option to increase Xurkitree's power and still allow it the freedom to switch moves.</p> <p>Xurkitree fits well on balance and bulky offense teams, as Xurkitree appreciates other offensive teammates to help wear down its checks. Fighting-type Pokemon such as Terrakion and Galarian Zapdos make good teammates, as they can pressure many of Xurkitree's checks like Blissey and specially defensive Garchomp. Offensive pivots like Barraskewda and defensive pivots like Swampert and Corviknight make good teammates, as they help Xurkitree switch into favorable matchups like Tapu Fini and Corviknight safely. Entry hazard setters such as Swampert and Landorus-T are also good partners, as they help Xurkitree wear down its checks faster. Xurkitree also appreciates offensive Water-types such as Barraskewda and Inteleon, as they can pressure Ground-type Pokemon that are able to switch in on Xurkitree. Since Xurkitree is heavily reliant on both Choice Scarf and coverage moves to beat its checks, it will often be forced out after a KO and appreciates strong defensive partners like Corviknight and Blissey to switch out safely.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 524664, "username": "Osake"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 525446, "username": "Ducky"}]}
  },
  "Stakataka": {
    "comments": "<h1>Other Options</h1> <p>Stakataka can set up Trick Room itself; however, without Choice Band it fails to 2HKO most physical walls. Stealth Rock is an option to still make progress even against a hard counter like Slowbro. Stakataka can be run without dedicated Trick Room support, however its weaknesses to common offensive types and low Speed mean it usually struggles to find opportunities to switch in safely.</p> <h1>Checks and Counters</h1> <p><strong>Slowbro and Swampert: Slowbro and physically defensive Swampert walls Stakataka comfortably regardless of its ability and can simply heal any damage dealt with either Slack Off or Regenerator while threatening it with a Scald burn.</p> <p><strong>Slow and Bulky Pokemon</strong>: Especially slow Pokemon like Ferrothorn and Palossand can negate a lot of Gyro Ball damage if they opt to run minimum Speed, avoiding the 2HKO and forcing it to use its coverage moves.</p> <p><strong>Substitute Users: Stakataka needs a pivot from teammate to get in safely, so Pokemon that run Substitute, especially those with a move that can threaten it like Earthquake, can either stall out Trick Room turns or OHKO it. Examples include Mamoswine and Garchomp.</p> <p><strong>Protect Users: Protect wastes Trick Room turns, Gyro Ball PP, and reveals what move Stakataka locks itself into. Ferrothorn and Vaporeon are some of the most prominent Protect users.</p> ",
    "sets": [
      {
        "name": "Trick Room Attacker",
        "description": "<p>Stakataka is a terrifying Trick Room attacker, outspeeding all relevant Pokemon in Trick Room thanks to its abysmal Speed stat. Gyro Ball is its main attack, dealing heavy damage with a boost from its ability and easily OHKOing even relatively bulky foes such as Zapdos and Jirachi. Heat Crash punches holes in Steel-type foes that can handle Gyro Ball such as non-Flash Fire Ferrothorn and Intimidate Corviknight. Earthquake allows Stakataka to 2HKO Toxapex, which otherwise can stall out Gyro Ball PP and precious Trick Room turns with Prankster Recover. Superpower rounds out its coverage by hitting Flash Fire Ferrothorn hard. Stone Edge, on the other hand, gives it a secondary STAB option that provides good neutral coverage on Steelworker variants; however, the coverage from Superpower is usually preferred. Steelworker maximizes Gyro Ball damage against neutral targets such as Hippowdon, while Tinted Lens helps Stakataka net important 2HKOs on foes such as offensive Heatran and specially defensive Swampert. Minimum Speed makes Gyro Ball hit as hard as possible while also making Stakataka as fast as possible in Trick Room.</p> <p>Stakataka requires Trick Room to function, so multiple Trick Room partners are strongly recommended. Slowbro makes for a great partner as it has Trick Room and Teleport. In addition, it also resists common Water- and Fighting-type moves that threaten Stakataka outside of Trick Room. Similarly, Cresselia not only provides Trick Room, but also Lunar Dance to restore Stakataka's health and Gyro Ball's PP, which is helpful against priority attacks and bulkier teams. Conkeldurr and Stakataka have many shared checks, allowing one of them to break down the checks for the other to sweep. Vikavolt can break physically defensive Pokemon that wall Stakataka like Swampert, Palossand, and Slowbro and also pivot with Volt Switch. Alolan Marowak is another Trick Room wallbreaker that can break the aforementioned walls, which gives it good synergy with Stakataka.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 524664, "username": "Osake"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 500884, "username": "longhiep341"}]}
  },
  "Cinderace": {
    "comments": "<h1>Other Options</h1> <p>Cinderace does not have many other viable coverage moves, other than the moves listed, but it can run Tinted Lens over Desolate Land in order to break through checks such as Swampert. It can also run Taunt and Super Fang to frustrate defensive checks it normally does not beat like Flash Fire Corviknight and Dauntless Shield Mew. Cinderace can sometimes run a Bulk Up set on more offensive teams to aid itself and its teammates in sweeping through checks. Zen Headbutt can be used on Choice Band sets to break through Toxapex, but it is otherwise a weak move.</p> <h1>Checks and Counters</h1> <p><strong>Physically Defensive Fire-resistant Pokemon: Physically defensive Fire-resistant Pokemon such as Swampert, Garchomp, and Toxapex take very little damage from Cinderace's primary move and can usually force it out.</p> <p><strong>Primordial Sea Barraskewda and Zapdos: Primordial Sea Barraskewda and Zapdos can switch in on a predicted Fire-type move, force Cinderace out, and pivot on switch-ins.</p> <p><strong>Flash Fire Corviknight</strong>: Flash Fire Corviknight can switch into all of Cinderace's attacks and slow pivot to a teammate that threatens it.</p> <p><strong>Dauntless Shield Users</strong>: Dauntless Shield users such as Mew and Hippowdon are able to avoid major damage from Cinderace's attacks, and they can pivot out or set up Stealth Rock on it. However, they all fear Gunk Shot, as it can poison them and wear them down throughout the game.</p> <p><strong>Faster Offensive Pokemon: While Cinderace has a very good Speed tier, there are still faster offensive Pokemon that are able to force it out. Examples are Talonflame, Tapu Koko, and Choice Scarf Azelf, which threaten OHKOs or major damage.</p> ",
    "sets": [
      {
        "name": "Magic Guard Pivot",
        "description": "<p>Cinderace finds a niche in the AAA metagame as one of its naturally fastest U-turn users, which lets it make the most of forcing out common Pokemon such as Corviknight and Heatran with its good coverage. Life Orb and Magic Guard allow Cinderace to hit hard while avoiding recoil, entry hazards, and Rocky Helmet damage. Cinderace's Fire typing allows it to offensively check Triage Pokemon, as it resists Draining Kiss and Grass-type moves, and the common Genesect. Its recoil-free Flare Blitz can pressure common defensive Pokemon such as Corviknight. Gunk Shot mainly threatens Tapu Fini, but is also useful to spread poisons onto switch-ins like Zapdos. Court Change is a useful tool to turn opposing entry hazards on their head. Alternatively, High Jump Kick threatens Terrakion and Flash Fire Steel-types like Ferrothorn, while hitting Garchomp and Blissey for better damage.</p> <p>Cinderace's momentum generation makes it a good fit on many teams. It appreciates Pokemon such as Zapdos and Tapu Koko forcing out checks like Toxapex. For Zarude and Terrakion, Cinderace is able to deal with Corviknight, while they can break through Swampert. Cinderace also appreciates Pokemon like Choice Specs Azelf and Sheer Force Genesect to threaten Primordial Sea Zapdos. A strong answer to Barrawskewda such as Tapu Fini is also needed, as it can switch into Flare Blitz and threaten a KO. Cinderace works well on teams with reliable defensive pivots, such as Corviknight and Swampert, as it needs the aid of slow pivots to switch in safely.</p> "
      },
      {
        "name": "Desolate Land Pivot",
        "description": "<p>Desolate Land Cinderace is an effective fast pivot, which is great in a momentum-dependent format such as AAA. Desolate Land Pyro Ball heavily damages even resistant foes like Tapu Fini and Swampert. Desolate Land also gives Cinderace a Water immunity and can help its team soft check Primordial Sea users. Cinderace is also able to offensively check many Triage users and Genesect due to its Fire typing. Gunk Shot heavily damages Tapu Fini and can fish for poison on switch-ins such as Dauntless Shield Mew. Court Change provides team support, while High Jump Kick damages Pokemon such as Flash Fire Corviknight and Ferrothorn, which are difficult for Cinderace to break through. Sucker Punch can be run to KO weakened faster threats such as Barraskewda. Heavy-Duty Boots is the preferred item to augment Cinderace's role as a fast pivot, but lacks Choice Band's high damage output, and may sometimes miss out on KOs. Cinderace can also opt for Choice Scarf to outspeed and OHKO common Pokemon such as Choice Scarf Azelf and Tapu Koko.</p> <p>Desolate Land Cinderace appreciates Electric-type Pokemon such as Zapdos and Tapu Koko to force out bulky Water-types like Tapu Fini and Flash Fire users like Corviknight. Cinderace pairs well with other Water-weak Pokemon, which appreciate its ability to switch into Water-type moves, especially Barraskewda's Flip Turn. Cinderace also pairs well with Pokemon such as Terrakion and Zarude, which struggle with Corviknight. Special walls like Assault Vest Swampert and Blissey are good teammates as they can switch in on Primordial Sea users such as Zapdos, which can force out Cinderace, especially if it is Choice-locked into Pyro Ball. Choice Band sets require good entry hazard removal and other strong pivots to enter the field safely, as they're susceptible to chip damage through hazards and pivoting moves from defensive Pokemon. In contrast, Heavy-Duty Boots sets may lack the damage to break through defensive checks and require offensive support.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 524664, "username": "Osake"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}, {"user_id": 331519, "username": "CryoGyro"}]}], "writtenBy": [{"user_id": 525446, "username": "Ducky"}]}
  },
  "Inteleon": {
    "comments": "<h1>Other Options</h1> <p>Inteleon has no other viable options.</p> <h1>Checks and Counters</h1> <p><strong>Toxapex</strong>: Toxapex resists all of Inteleon's moves and can use free turns to lay Toxic Spikes, burn a switch-in with Scald, or remove an item with Knock Off. Inteleon can U-turn on it, but must beware of Rocky Helmet chip damage stacking up.</p> <p><strong>Special walls</strong>: At full health, Blissey avoids the 2HKO from any of Inteleon's moves and can cripple it with Thunder Wave or Toxic. RegenVest users like Silvally-Dragon can switch in, tank two hits, and pivot out into either a better counter or an offensive check.</p> <p><strong>Faster Pokemon: Tapu Koko and Barraskewda are two common Pokemon that are naturally faster than Inteleon and can always OHKO it after Stealth Rock. Choice Scarf users like Genesect, Landorus-Therian, and Azelf can do the same. However, none of these Pokemon can properly switch into Inteleon, as its STAB moves will OHKO all of them.</p> <p><strong>Priority users: With Grassy Surge and Grassy Glide, Zarude and Dhelmise can come in on a STAB move at least once and threaten it out with super effective priority, with Synthesis Dhelmise being able to do this multiple times. Triage users like Tapu Bulu, Tapu Lele, and Togekiss can also revenge kill Inteleon, but the latter two require some previous chip before Draining Kiss can OHKO Inteleon.</p> ",
    "sets": [
      {
        "name": "Primordial Sea",
        "description": "<p>Inteleon possesses a great Speed tier and powerful, rain-boosted STAB moves including Weather Ball. With Primordial Sea, its Water-type moves are devastating to switch into, 2HKOing special walls like Blissey and RegenVest Jirachi with minimal chip damage. Weather Ball bypasses Desolate Land swtich-ins like Heatran and hits them hard. Hydro Pump is a slightly more powerful, but less accurate, move that is useful for wearing down switch-ins such as Chansey. Ice Beam nails Grass-types like Dhelmise and Tapu Bulu on a predicted switch in, while U-turn pivots out of hard counters like Water Absorb Skarmory. Choice Specs provides Inteleon with the necessary power to break through opposing walls, and a Timid nature lets it outpace fast Pokemon like Cinderace and Latios.</p> <p>Despite its good Speed tier, Inteleon is forced out by common Pokemon like Tapu Koko, Barraskewda, and Choice Scarf Genesect. Due to this, partners that can switch into these Pokemon, such as Ferrothorn and Volt Absorb Corviknight, are greatly appreciated. In addition, Ferrothorn provides entry hazard support and item removal with Knock Off to wear down Inteleon's switch-ins. Corviknight can bring Inteleon in safely with a slow pivot and remove entry hazards, which can otherwise wear Inteleon down quickly. Other slow pivots such as Silvally-Dragon and Blissey can also bring Inteleon in safely, which is useful considering its poor defensive utility. Physically offensive partners like Choice Scarf Landorus-T and Choice Band Zarude can revenge kill and threaten out Inteleon's checks; additionally, Inteleon and these partners can pivot into each other's switch-ins, like Corviknight and Chansey, respectively, to weaken or remove them. Sweepers like Tinted Lens Genesect can often setup on Inteleon's switch-ins, like RegenVest Swampert and Chansey, and make good partners.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 375662, "username": "Isaiah"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 414072, "username": "Heracross2.0"}]}
  },
  "Corviknight": {
    "comments": "<h1>Other Options</h1> <p>Corviknight has a wide range of other possible abilities. Dauntless Shield, especially in conjunction with Body Press, is another option for defensive sets. It does slightly better in some match ups, like not letting Heatran in for free, but it does not provide the same amount of support as Intimidate and it is much worse at checking Zarude. Mummy is another option over Wandering Spirit, but this does not let Corviknight steal Regenerator for itself. Regenerator makes it a more effective pivot, but it comes at the cost of being unable to directly switch into the strongest physical attackers. Magic Bounce allows it to deny entry hazards and status moves, and Unaware lets it block set up attempts more reliably. Primordial Sea is an option over Flash Fire to still check Mold Breaker Heatran, but this comes at the cost of taking increased damage from Water moves and letting Desolate Land Heatran effectively switch into it.</p> <h1>Checks and Counters</h1> <p><strong>Heatran and other Fire-types: Heatran heavily pressures Corviknight, especially by being able to set up Stealth Rock against it. Even Flash Fire Corviknight still fears Mold Breaker Heatran. Other Fire-types like Talonflame and Cinderace can beat non-Flash Fire Corviknight.</p> <p><strong>Electric-types: Tapu Koko and Zapdos do not fear any move from Corviknight and can switch into it to steal momentum back on a predicted Roost or Defog.</p> <p><strong>Setup Attackers: Corviknight is able to barely hang on against several strong physical threats and relies heavily on Intimidate to weaken them. Swords Dance users that Corviknight cannot OHKO like Terrakion are able to pressure it massively and overwhelm it.</p> <p><strong>Substitute: Substitute users like Landorus-T can take advantage of Corviknight's weak U-turn to set up a free Substitute and safely attack or set up on the teammate that comes in after.</p> ",
    "sets": [
      {
        "name": "Intimidate Pivot",
        "description": "<p>Intimidate Corviknight is one of the most consistent checks to physical attackers in AAA. With its already high natural bulk, fantastic defensive typing, and access to reliable recovery and Intimidate, it is difficult to break through physically without strong super effective hits. Choice Band Terrakion, Zarude, and Garchomp are all dangerous physical attackers that have a difficult time breaking through Corviknight. Additionally, thanks to Intimidate, Corviknight can soft-check threats even when weakened by handing off a now-minus-one attacker to a teammate to check more easily. Corviknight is a fantastic role compressor, as it also offers entry hazard removal and slow pivoting with U-turn. It is very common for Corviknight to come in, eat a weak or resisted hit, and use U-turn as their opponent switches. Brave Bird is the obligatory STAB move and does decent damage to attackers like Zarude and Dhelmise, if required. It also prevents dangerous set-up sweepers like Volcarona from setting up for free. Maximum Defense investment is required to ensure Corviknight avoids several key 2HKOs, most notably from Terrakion, and minimum Speed with no IVs allows Corviknight's U-turn to usually go last, bringing in a teammate for free.</p> <p>Corviknight fits well on a wide variety of teams due to its role compression and great defensive attributes, but it especially excels on balance and bulky offense teams that can take advantage of its slow U-turn. Dangerous-but-frail breakers like Terrakion, Tapu Lele, and Barraskewda appreciate Corviknight getting them onto the field safely. While Corviknight can check a wide range of physical attackers, there are a few that it struggles with such as Talonflame and Cinderace. Partners like Primordial Sea Zapdos and Swampert are appreciated as ways to handle these threats. Additionally, even though Corviknight is an excellent Defogger, it struggles heavily to Defog against Heatran, and so it greatly appreciates teammates who reliably force it out like Primordial Sea Barraskewda and Zapdos. Tapu Koko and Zapdos are common switch-ins to Corviknight; therefore, partners like Blissey, which make a fantastic core with it that covers each others weaknesses, are good teammates. Lastly, a second physically defensive partner like Tapu Fini or Dauntless Shield Mew makes a great partner to handle the few physical attackers Corviknight cannot, such as Cinderace and Talonflame.</p> "
      },
      {
        "name": "Wandering Spirit Pivot",
        "description": "<p>Wandering Spirit Corviknight aims to punish opposing Pokemon that rely on their ability, especially Regenerator pivots like Swampert. For example, if Swampert uses Flip Turn on Corviknight, instead of recovering a third of its HP, it loses 16.7%, a massive difference that cripples Swampert's longevity. This also gives Corviknight Regenerator, allowing it to save a turn by not having to heal with Roost. Wandering Spirit is also great at denying Unburden users their speed boost and Triage users their priority; this makes Corviknight a great emergency check to several popular sweepers like Triage Tapu Lele. It is also effective against Magic Guard users, as it can unexpectedly force them to take Rocky Helmet chip and Life Orb recoil, and users of damage-amplification abilities like Tough Claws and Adaptability. The moveset aims to provide as much utility as possible while abusing Wandering Spirit: Roost gives recovery, Defog removes entry hazards, U-turn provides slow pivoting, and Brave Bird lets Corviknight avoid total passivity. Be careful when attacking with Corviknight, however, as it may give your opponent their ability back if they have already activated Wandering Spirit. It is also worth noting that Wandering Spirit only works on contact moves, so moves like Stone Edge will not trigger it. Maximum defensive EVs ensure it can check as many things as possible, while minimum speed IVs allow for a slow U-turn.</p> <p>Corviknight's biggest asset is frustrating and denying recovery to RegenVest pivots like Swampert, Jirachi, and Silvally-Dragon. Special Attackers such as Zapdos and Tapu Lele make fantastic partners, as they can often blow through opposing teams when their RegenVest checks are at low health. Because this set lacks Leftovers and Intimidate, it is much easier to overwhelm with powerful attacks, so it is important to either back it up with a strong defensive teammate like Dauntless Shield Mew, or play aggressively enough to deny opposing breakers the chance to get in. In particular Corviknight struggles with attackers that don't mind having their ability removed temporarily like Grassy Surge Zarude or Primordial Sea Barraskewda, or are powerful enough to beat it without an ability like Choice Band Terrakion. Strong answers to these Pokemon, like Dauntless Shield Mew, are highly recommended.</p> "
      },
      {
        "name": "Specially Defensive Bulk Up",
        "description": "<p>Corviknight, when coupled with an immunity ability, can check a wide range of dangerous special attackers in AAA, and, furthermore, use them as set-up fodder. With Volt Absorb, Corviknight becomes a fantastic switch-in to Tapu Koko and Zapdos, while Flash Fire makes it a great check to Desolate Land Heatran and Volcarona while even checking physical attackers like Cinderace and Talonflame. With access to Bulk Up and Roost, Corviknight is able to function as a fantastic late-game bulky wincon by taking advantage of the free turns it gets. U-turn still provides utility in the early-game and lets it function as a pivot before its checks are removed. The choice of Brave Bird or Iron Head generally comes down to power or sustainability; both STAB moves have no immunities, and while Flying generally has better coverage in AAA, Iron Head's consistency due to its lack of recoil is appreciated. Maximum Special Defense allows Corviknight to check special attackers as well as possible; since this Corviknight can often sweep, it does not run minimum speed, as it can sometimes get a Bulk Up off against slow breakers like Dhelmise.</p> <p>Specially defensive Corviknight is a great option for teams looking to patch up weaknesses to Tapu Koko, Zapdos, or Desolate Land Heatran. It is often found on balanced and bulkier teams as a great defensive pivot and late-game sweeper. Depending on its ability, it either needs teammates to help it beat Tapu Koko and Zapdos, like Assault Vest Swampert, or beat Fire-types, like Tapu Fini. Additionally, even if it is Flash Fire, Corviknight cannot beat Mold Breaker Heatran, so it needs teammates like Zapdos to either beat it outright or wear it down and beat it over the course of the game. This set also does not check physical attackers well nor utilize Defog, so additional team support like Tapu Fini is required to fill these roles.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 524664, "username": "Osake"}, {"user_id": 375662, "username": "Isaiah"}]}, {"name": "Grammar checked by", "members": [{"user_id": 277988, "username": "dex"}]}], "writtenBy": [{"user_id": 523866, "username": "UT"}]}
  },
  "Barraskewda": {
    "comments": "<h1>Other Options</h1> <p>Choice Scarf can be used to make Adamant Barraskewda faster than the entire unboosted metagame. However, using Choice Scarf instead of Choice Band severely limits Barraskewda's potential to KO, as it already outspeeds a majority of the format.</p> <p>Psychic Fangs is another coverage option, but its uses are limited to only hitting Toxapex. However, it only has a small chance to 2HKO, and Prankster Recover immediately heals any significant damage.</p> <p>Poison Jab can also be used to 2HKO Tapu Fini and can spread poison onto foes, but is generally outclassed by Close Combat.</p> <p>Ice Fang allows Barraskewda to OHKO Garchomp and Water Absorb Landorus-T, with the latter one completely blocking it otherwise.</p> <p>Magic Guard + Life Orb sets, while significantly weaker, help solve Barraskewda's biggest issue of longevity by bypassing hazards and Rocky Helmet. It offers much less breaking power, but better sustainability if that is what your team needs.</p> <h1>Checks and Counters</h1> <p><strong>Toxapex: Toxapex is Barraskewda's worst nightmare, sporting sky-high physical bulk and a resistance to Water moves. Its chance to burn with Scald and access to Prankster healing and status-inducing moves mean it will usually come out on top.</p> <p><strong>Water-immune Pokemon</strong>: Desolate Land users such as Moltres and Water Absorb Pokemon such as Palossand are able to completely sap Barraskewda's momentum.</p> <p><strong>Bulky Water-type Checks: Pokemon that resist Water and aren't weak to Barraskewda's coverage options, such as Tapu Fini, are almost always free to switch in and heal the damage done.</p> <p><strong>Rocky Helmet Users</strong>: One of Barraskewda's largest weaknesses is residual damage, and Rocky Helmet users such as Mew, Tapu Fini, Swampert, and Corviknight are able to punish Barraskewda for using Flip Turn. This damage racks up over the course of the game, making Barraskewda less of a threat.</p> ",
    "sets": [
      {
        "name": "Choice Band",
        "description": "<p>Barraskewda is a strong offensive pivot, revenge killer, and late-game cleaner with powerful rain-boosted STAB moves and an incredible Speed tier. Flip Turn is an especially deadly move as Barraskewda can pivot out while massively damaging non-Water-immune checks like Swampert. Liquidation is Barraskewda's main STAB move, guaranteeing the OHKO on Tapu Koko and allowing Barraskewda to stay on the field while doing great damages. Aqua Jet offers revenge killing against boosted foes such as Volcarona and Garchomp. Barraskewda's coverage moves are mostly used as insurance against Water Absorb users like Excadrill and Desolate Land users such as Heatran. Close Combat is the best coverage option due to its high Base Power and ability to hit Heatran and Ferrothorn hard.</p> <p>Barraskewda is often paired with special powerhouses like Sheer Force Tapu Lele, Psychic Surge Azelf, and specially offensive Genesect, which succeed versus Pokemon that check Barraskewda like Tapu Fini and Corviknight. The combination of their special prowess and Barraskewda's pivoting leads to deadly offensive cores. Barraskewda commonly finds itself on VoltTurn cores, synergizing well with Genesect, Landorus-T, and offensive Zapdos. Barraskewda also benefits from teammates that check Fire-types and cover its Desolate Land weakness like Terrakion and Garchomp, which can punish them by setting entry hazards. Since Barraskewda's main job as a pivot and revenge killer involves a lot of switching, it benefits from entry hazard removers and slow pivots. Defensive pivots such as Swampert and Landorus-T are able to preserve momentum and set up entry hazards, softening up foes. Other defensive Pokemon like Dauntless Shield Mew, Intimidate Corviknight, and Tapu Fini are also great partners because of their access to Defog and reliable recovery. Additionally, Magic Bounce users such as Blissey and Mew act as entry hazard deterrents with the option to run slow pivot moves such as Teleport, U-turn, and Volt Switch.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 375662, "username": "Isaiah"}, {"user_id": 475804, "username": "The Number Man"}]}, {"name": "Grammar checked by", "members": [{"user_id": 331519, "username": "CryoGyro"}, {"user_id": 241023, "username": "Kris"}]}], "writtenBy": [{"user_id": 226455, "username": "berry"}, {"user_id": 523866, "username": "UT"}]}
  },
  "Zarude": {
    "comments": "<h1>Other Options</h1> <p>Adamant Tough Claws is rarely run, as Zarude loses priority on Grassy Glide, leaving it unable to revenge kill any attacker, as well as losing passive recovery and Terrain control. On the other hand, however, it provides a decent power boost on all other moves and makes Darkest Lariat very spammable: it now 2HKOes non-Intimidate Corviknight, Zapdos, and Heatran, easing prediction and pivoting. Similarly, Choice Scarf Tough Claws is usable to surprise fast breakers such as Tapu Koko and Barraskewda while doing great damage, but Grassy Glide is usually preferred. Choice Band Tinted Lens is another option in conjunction with a Grassy Terrain setter such as Tapu Fini in order to easily pass through Grass-resists such as Zapdos, Latios, and Cinderace, with either Power Whip or Grassy Glide.</p> <h1>Checks and Counters</h1> <p><strong>Steel-types: Corviknight, especially Intimidate variants, takes minimal damage from Zarude. Other Steel-types like Ferrothorn require significant chip damage for to break through them without Close Combat.</p> <p><strong>Flying-types: Resisting Grassy Glide, common Flying-types like Zapdos, Togekiss, and Mandibuzz can either outspeed and force out Zarude or completely wall it.</p> <p><strong>Faster Pokemon: Zarude often finds itself unable to threaten common fast pivots with Grassy Glide, such as Choice Scarf Genesect and Talonflame. Both carry super effective moves to hit Zarude in return. Additionally, Zarude is forced out by U-turn users given its glaring 4x Bug weakness, especially Azelf, which replaces its Grassy Terrain with Psychic Terrain: this often gives free momentum to offensive pivots, as they can freely use U-turn without taking Grassy Glide.</p> ",
    "sets": [
      {
        "name": "Offensive Pivot",
        "description": "<p>Zarude is a formidable offensive pivot and doubles as one of the strongest priority users in the metagame. With Choice Band and a Terrain-boosted Grassy Glide, Zarude can force out the majority of relevant wallbreakers, such as Tapu Koko and Azelf, as they risk getting OHKOed. U-turn capitalizes on the switches Zarude forces, bringing in offensive partners like Heatran. Power Whip is the strongest STAB move available, OHKOing or 2HKOing common defensive pivots like Swampert, Tapu Fini, Zapdos, and Toxapex. Darkest Lariat is a spammable STAB move that also bypasses Dauntless Shield boosts, scoring 2HKOs on Heatran, Mew, and Moltres. However, Close Combat is a strong alternative over either Power Whip or Darkest Lariat, allowing it to break through specific checks like Ferrothorn and Incineroar. An Adamant nature is preferred to augment the power of Zarude's attacks, notably having a better chance to OHKO Tapu Koko with Grassy Glide; however, Jolly is an option to outspeed Zapdos.</p> <p>Zarude provides valuable utility including priority, Terrain control, and passive recovery, making it a great fit on balance and bulky offense teams. As Zarude cannot switch into most attackers, a strong defensive core often helps bring it in safely. Zarude also handily beats Swampert and Tapu Fini, making it a great partner for a multitude of wallbreakers, such as Heatran, Zapdos, and Tapu Koko. In return, Zarude gives them good switch-in opportunities by using U-turn on the Flying-types it invites in, mainly Corviknight and Mandibuzz. Zarude appreciates any teammates that can set entry hazards, chipping down foes like Ferrothorn and Corviknight into OHKO or 2HKO range. Teammates carrying Rocky Helmet such as Corviknight and Swampert also provide chip damage, and they can notably punish offensive pivots such as Landorus-T and Cinderace freely clicking U-turn on Zarude. Lastly, teammates running Knock Off such as Tapu Fini and Toxapex are useful to remove opposing Rocky Helmet and Heavy-Duty Boots, respectively allowing Zarude to attack more freely and better chip walls—especially Flying-types—in combination with hazards.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 375662, "username": "Isaiah"}, {"user_id": 523866, "username": "UT"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 476520, "username": "avyrie"}]}
  }
}