{
  "Ivysaur": {
    "comments": "<h1>Other Options</h1> <p>Giga Drain is an alternative Grass-type STAB move that can be used when sun isn't up. It also provides recovery, making Ivysaur harder to revenge kill with the likes of Sawk and Rotom. However, Ivysaur shouldn't be used when sun isn't up and the lack of power is pretty significant, missing some crucial OHKOs after a Growth such as Kangaskhan and Silvally. Sleep Powder can take advantage of a check, but standard Ivysaur can't fit it. Ivysaur can also run an utility set with a 252 HP / 160 Def / 96 Spe EV spread and a Bold nature, which can check common threats including Rhydon, Sawk, and Tangela.</p> <h1>Checks and Counters</h1> <p><strong>Fire-types: Fire-types like defensive Rapidash and Ninetales avoid the OHKO from +2 Sludge Bomb and can OHKO Ivysaur back with their powerful STAB moves.</p> <p><strong>Faster Choice Scarf and Priority Users: Even with Chlorophyll, Ivysaur gets outsped by common Choice Scarf users like Manectric, which can revenge kill it with Overheat. Powerful priority users likes Kangaskhan and Shiftry can take out a weakened Ivysaur.</p> ",
    "sets": [
      {
        "name": "Sun Sweeper",
        "description": "<p>Ivysaur is a very threatening sweeper and wallbreaker in sun. Thanks to its great Eviolite-boosted bulk, Toxic immunity, and resistances for common attackers such as Thwackey and Sawk, it can easily find opportunities to set up with Growth in sun. The listed attacks perfectly cover the whole metagame, with Weather Ball hitting Pokemon the likes of Klinklang, Skuntank, and Frosmoth that can take on Ivysaur's STAB moves. Chlorophyll with a Timid nature lets Ivysaur outspeed prominent Choice Scarf users like Rotom, Sawk, and Silvally in sun.</p> <p>Ivysaur only fits on dedicated sun teams, so staples of this archetype make for great partners. For example Uxie and Liepard are two amazing sun setters. Other Chlorophyll users such as Shiftry, Leafeon, and Exeggutor appreciate Ivysaur weakening their common checks like Fire-types and Altaria, as well as beating Poison-types like Skuntank and Silvally-Poison thanks to Weather Ball, in order for them to clean late-game. Fire-types like Ninetales and Rapidash also enjoy sun support and help Ivysaur and the other Chlorophyll users with opposing Fire-types.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 435539, "username": "BloodAce"}, {"user_id": 226429, "username": "Jett"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 369076, "username": "Tuthur"}]}
  },
  "Butterfree": {
    "comments": "<h1>Other Options</h1> <p>Tinted Lens makes Butterfree very threatening but also much less reliable. If running Tinted Lens, Bug Buzz is far better than Hurricane, as Hurricane is likely to miss without Compound Eyes. Giga Drain provides Butterfree with recovery and lets it hit Rock-types, but it doesn't deal much damage and is less useful than Hurricane and Bug Buzz.</p> <h1>Checks and Counters</h1> <p><strong>Priority</strong>: Butterfree's low Defense stat makes it very vulnerable to being heavily damaged by incoming priority moves like Shiftry's Sucker Punch and Kangaskhan's Fake Out.</p> <p><strong>Steel- and Rock-types: Steel-types like Klinklang, Perrserker, and Galarian Stunfisk and Rock-types such as Coalossal and Rhydon wall Butterfree's Hurricane and OHKO it. However, they struggle against Leftovers sets setting up multiple times with the combination of Substitute + Sleep Powder and being put to sleep in general.</p> <p><strong>Electric-types: Choice Scarf Electric-types like Rotom formes easily revenge kill Butterfree at +1, putting an end to its sweeping attempt. Bulkier Electric-types like Rotom-S can take care of Butterfree in a pinch, easily living a boosted hit.</p> <p><strong>Choice Scarf Users: Choice Scarf users like Sawk, Rotom, and Silvally exploit Butterfree's mediocre Speed and revenge kill it.</p> ",
    "sets": [
      {
        "name": "Quiver Dance",
        "description": "<p>Compound Eyes Butterfree's accurate Sleep Powder complements Quiver Dance, making it quite the offensive threat. Although its average Speed and mediocre Special Attack makes Frosmoth seem like a better option in comparison, Butterfree does have a few tricks up its sleeve. Compound Eyes makes Sleep Powder and Hurricane far more threatening with very low chances of missing. Substitute takes advantage of Sleep Powder to provide Butterfree with an extra layer of protection, allowing it to safely use Quiver Dance multiple times. While its 4x weakness to Stealth Rock makes Heavy-Duty Boots seem better, Leftovers makes Butterfree much more consistent if your team has reliable entry hazard removal and prevention.</p> <p>Butterfree is most effective late-game when a lot of the opposing team is weakened, and it can come in and set up with Quiver Dance to win. However, it is also tremendously threatening in the early-game, especially with Leftovers before Stealth Rock is up. It can set up on and beat common leads such as Rhydon and Galarian Stunfisk and open the way for teammates such as Rotom and Frosmoth. Using Butterfree early-game lets it cripple walls with Sleep Powder. Slow wallbreakers like Flapple, Perrserker, and Alcremie appreciate Butterfree's Sleep Powder, allowing them to safely switch in. In return, Butterfree appreciates their damage making it much easier to KO bulky Pokemon such as Clefairy, Wishiwashi, and Miltank. Butterfree is very frail, and it struggles with Choice Scarf users such as Rotom, Silvally, and Sawk without a Substitute set up. It appreciates bulky teammates like Tangela, Gurdurr, and Uxie, which can come in on opposing attacks, primarily priority attacks that Butterfree is very weak to. When using Leftovers, entry hazard removers like Altaria, Coalossal, and Articuno are needed in order to make sure Butterfree can get onto the field. Entry hazards set by Pokemon like Rhydon, Qwilfish, and Miltank wear down opposing Pokemon for Butterfree, making it easier to sweep.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 231074, "username": "S1nn0hC0nfirm3d"}, {"user_id": 240237, "username": "kay"}]}, {"name": "Grammar checked by", "members": [{"user_id": 449990, "username": "DC"}]}], "writtenBy": [{"user_id": 524359, "username": "RexTheNoName"}, {"user_id": 369076, "username": "Tuthur"}]}
  },
  "Raichu": {"sets": [{"name": "Nasty Plot"}]},
  "Clefairy": {
    "comments": "<h1>Other Options</h1> <p>Aromatherapy allows Clefairy to function as a cleric. Encore can be used to lock opposing setup sweepers such as Frosmoth and Ninetales into an unfavorable move, but Clefairy generally has trouble fitting the move. Thunder Wave is an alternative to Toxic that cripple Poison- and Steel-types like Qwilfish and Perrserker. Teleport allows Clefairy to pivot and retain momentum, but it is incompatible with Soft-Boiled and forces Clefairy to rely on Wish or Moonlight. Clefairy can also opt for a fully physically defensive spread to better check foes like Sawk and Silvally-Dark. A set with Calm Mind is also an option, although Clefairy is outclassed by Alcremie in this role.</p> <h1>Checks and Counters</h1> <p><strong>Poison-types: Poison-types like Silvally-Poison, Skuntank, and Qwilfish force out Clefairy with their Poison-type STAB attacks and use that opportunity to set entry hazards or set up.</p> <p><strong>Steel-types: Although they dislike Knock Off, Steel-types like Klinklang and Perrserker are able to take advantage of Clefairy.</p> <p><strong>Fire-types: Fire-types like Ninetales and Rapidash resist Moonblast and can overwhelm Clefairy. However, they heavily dislike Knock Off removing their Heavy-Duty Boots and are susceptible to Toxic.</p> <p><strong>Strong Physical Attackers: Physical attackers like Kangaskhan, Cinccino, and Thwackey exploit Clefairy's mediocre Defense and threaten to KO it.</p> <p><strong>Knock Off: Although Clefairy resists Knock Off, it is reliant on Eviolite to maintain its bulk; otherwise, it risks being overwhelmed by threats it is supposed to check, like Choice Specs Basculin and Thievul.</p> ",
    "sets": [
      {
        "name": "Specially Defensive",
        "description": "<p>Clefairy is a notable special wall in ZU, capable of checking foes like Thievul and Rotom and absorbing status from the likes of Wishiwashi and Altaria thanks to Magic Guard. Moonblast targets Dark- and Fighting-types like Alolan Persian, Liepard, and Sawk. Alternatively, Seismic Toss provides consistent damage output against foes that resist Moonblast, such as Qwilfish and Rapidash, while also breaking Substitute from threats like Frosmoth and Articuno. Knock Off cripples switch-ins like Qwilfish, Perrserker, and Rapidash. Toxic wears down problematic foes that can take advantage of Clefairy, like Rapidash and Alcremie, and it synergizes with Seismic Toss, allowing Clefairy to take down most walls.</p> <p>Clefairy fits best on balance and stall teams as a specially defensive wall. Ground-types like Rhydon, Piloswine, and Alolan Dugtrio can threaten Poison-, Steel-, and Fire-types that Clefairy has a hard time against. In return, it is able to take on foes like Articuno and Wishiwashi and absorb Toxic and burns from Scald. Physical walls such as Tangela and Cramorant are great partners for Clefairy, helping cover for its mediocre Defense and checking powerful wallbreakers such as Perrserker and Kangaskhan. Knock Off absorbers like Alolan Persian and Qwilfish can help Clefairy preserve its Eviolite, which is crucial to keep checking special attackers. Wallbreakers such as Silvally formes, Cinccino, and Kangaskhan benefit from Clefairy's ability to whittle down defensive cores with Knock Off and Toxic.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 369076, "username": "Tuthur"}, {"user_id": 231074, "username": "S1nn0hC0nfirm3d"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 449990, "username": "DC"}]}
  },
  "Ninetales": {
    "comments": "<h1>Other Options</h1> <p>Flamethrower is an alternative to Fire Blast that provides more accuracy and consistency, but it is significantly weaker. Substitute can be used to avoid status from foes like Pyukumku and Altaria, while Agility helps Ninetales clean better late-game; however, Ninetales generally prefers retaining Scorching Sands.</p> <h1>Checks and Counters</h1> <p><strong>Water-types: Water-types like Wishiwashi, Poliwrath, and Cramorant can take Energy Ball and retaliate with a powerful Water-type STAB attack. However, they have difficulty checking Ninetales after Nasty Plot. Pyukumuku is notable, as it ignores Nasty Plot with Unaware and can stall Ninetales with Toxic + Recover.</p> <p><strong>Ground-types: Ground-types like Piloswine and Rhydon can threaten Ninetales with their STAB moves, but they should be wary of Energy Ball.</p> <p><strong>Revenge Killers: Foes such as Manectric, Cinccino, and Choice Scarf Sawk can outspeed and revenge kill Ninetales. It is also susceptible to priority from Kangaskhan, Gurdurr, and Shiftry if it is weakened.</p> <p><strong>Status: Ninetales is vulnerable to being worn down by Toxic from foes like Pyukumuku and Miltank, while Thunder Wave from Qwilfish cripples its Speed and makes it much easier to revenge kill.</p> <p><strong>Dragon-types: Altaria and Appletun resist or are immune to Ninetales's moves and can threaten it with a strong attack or status.</p> ",
    "sets": [
      {
        "name": "Nasty Plot",
        "description": "<p>Ninetales is a notable sweeper thanks to its access to Nasty Plot, excellent coverage options, and good Speed tier. Nasty Plot lets Ninetales break through bulky walls such as Clefairy with its powerful Fire Blast and clean weakened teams. Energy Ball targets Water-types like Wishiwashi and Poliwrath and Ground-types like Rhydon, Piloswine, and Stunfisk. Scorching Sands is Ninetales's best move against Qwilfish and opposing Fire-types like Rapidash and Coalossal.</p> <p>Ninetales fits on balance and offense teams as a mid- and late-game wallbreaker and revenge killer. Wallbreaking partners such as Rotom and Cinccino complement Ninetales; Rotom is able to threaten Water-types and safely bring in Ninetales with Volt Switch, while Cinccino is able to handle specially defensive walls like Pyukumuku and Miltank that wall Ninetales. In return, they benefit from its ability to handle Tangela and Eldegoss. Grass-types like Tangela and Eldegoss are also good partners, handling problematic foes like Stunfisk and Piloswine. Knock Off absorbers such as Uxie, Cofagrigus, and Qwilfish are necessary to preserve Heavy-Duty Boots and prevent Ninetales from being worn down by entry hazards; Uxie and Cofagrigus can also take on revenge killers such as Kangaskhan and Choice Scarf Sawk, while Qwilfish can provide entry hazard support to wear down foes like Piloswine and Poliwrath. Cleaners such as Frosmoth and Calm Mind Alcremie can take advantage of Ninetales's wallbreaking to set up and clean late-game.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 369076, "username": "Tuthur"}, {"user_id": 231074, "username": "S1nn0hC0nfirm3d"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 449990, "username": "DC"}]}
  },
  "Golbat": {"sets": [{"name": "Stallbreaker"}]},
  "Dugtrio-Alola": {"sets": [{"name": "SubToxic"}, {"name": "Offensive Stealth Rock"}]},
  "Persian-Alola": {
    "comments": "<h1>Other Options</h1> <p>A Nasty Plot set can be used, but Alolan Persian lacks power even at +2 and has mediocre coverage.</p> <h1>Checks and Counters</h1> <p><strong>Fighting-types</strong>: While they dislike Knock Off and Toxic, Fighting-types such as Poliwrath and Gurdurr easily force Alolan Persian out. Choice Scarf Sawk outspeeds Alolan Persian and prevents it from pivoting.</p> <p><strong>Fairy-types: Fairy-types easily come into Alolan Persian's Dark-type STAB attacks and force it out. Due to Sweet Veil, Alcremie can turn non-Toxic Alolan Persian into setup fodder; Rest Alcremie is even able to turn Toxic Alolan Persian into setup fodder. While Clefairy hates Knock Off, Alolan Persian cannot meaningfully damage it in any way and fears heavy damage from its Moonblast.</p> <p><strong>Residual Damage: Alolan Persian's lack of recovery makes it extremely susceptible to residual damage, especially after losing its Heavy-Duty Boots to Knock Off.</p> <p><strong>Special Attackers</strong>: Special attackers such as Skunktank and Ninetales easily exploit Alolan Persian's low special bulk.</p> ",
    "sets": [
      {
        "name": "Bulky Pivot",
        "description": "<p>Parting Shot in combination with Alolan Persian's fantastic Speed and good Fur Coat-boosted bulk allows it to function as an effective bulky pivot. Foul Play threatens physical attackers, notably setup sweepers such as Rapidash and Silvally-Poison. Toxic wears down Pokemon that don't fear Alolan Persian's attacks such as Alcremie and Tangela, but Taunt can be used to prevent entry hazards from setters such as Qwilfish and Uxie and distrupt recovery attempts from walls such as Miltank and Articuno. Knock Off cripples almost every switch-in, notably strong counters such as Clefairy and Gurdurr.</p> <p>Alolan Persian fits best on offensive teams as a way to generate momentum and setup opportunities, although defensive teams can also make use of its pivoting capabilities. Wallbreakers and setup sweepers such as Kangaskhan and Frosmoth make good partners due to their ability to muscle through walls Alolan Persian struggles with such as Clefairy and Altaria; in turn it provides them with safe entry. In particular, Rotom is an especially good partner due to the duo's type synergy and effective pivoting. Entry hazard setters such as Piloswine and Qwilfish also greatly appreciate Alolan Persian's ability to safely get them on the field. Other walls such as Altaria and Tangela benefit from Alolan Persian crippling targets such as Gurdurr and Sawk, which makes checking them easier, and bringing pivot support with Parting Shot, which also weakens opposing attackers. In return, these walls make up for Alolan Persian's lack of reliable recovery and mediocre bulk.</p> "
      },
      {"name": "Choice Scarf"}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 231074, "username": "Ho3nConfirm3d"}, {"user_id": 226429, "username": "Jett"}]}, {"name": "Grammar checked by", "members": [{"user_id": 449990, "username": "DC"}]}], "writtenBy": [{"user_id": 535530, "username": "SSJRobbieRotten"}]}
  },
  "Poliwrath": {"sets": [{"name": "Choice Specs"}, {"name": "RestTalk"}]},
  "Rapidash": {
    "comments": "<h1>Other Options</h1> <p>Solar Blade is an option on sun teams to surprise opposing Water- and Ground-types in one moveslot, but it is generally niche and requires dedicated support. Flame Charge allows Rapidash to boost its Speed and prevents it from being revenge killed by Choice Scarf users like Sawk and Rotom.</p> <h1>Checks and Counters</h1> <p><strong>Water-types: Although they dislike status and Wild Charge, Water-types like Wishiwashi, Qwilfish, and Poliwrath are able to handle Rapidash with their Water-type STAB attacks.</p> <p><strong>Rock- and Ground-types: Rock- and Ground-types like Coalossal and Rhydon threaten Rapidash and force it out. However, they must be wary of High Horsepower and a potential Will-O-Wisp if they are not immune to it.</p> <p><strong>Dragon-types: Dragon-types like Altaria and Appletun resist or are immune to Rapidash's Flare Blitz and coverage options. Although Appletun dislikes Toxic, Altaria can shrug off status thanks to Natural Cure.</p> <p><strong>Residual Damage: Toxic and Knock Off from Pokemon that Rapidash is supposed to check, like Articuno, Tangela, and Thwackey, can hinder its utility and effectiveness.</p> ",
    "sets": [
      {
        "name": "Utility",
        "description": "<p>Utility Rapidash is a solid check to prominent threats in ZU such as Frosmoth, Thwackey, and Articuno. High Horsepower targets Rock-types like Rhydon and Coalossal as well as Pokemon like Ninetales and Qwilfish. Toxic places checks such as Wishiwashi and Pyukumuku on a timer, while Will-O-Wisp cripples physical attackers like Kangaskhan, Piloswine, and Silvally formes. Morning Sun allows Rapidash to remain healthy throughout a match to continually soft check foes. Flash Fire provides an immunity to Fire-type moves, which allows Rapidash to handle Ninetales.</p> <p>Utility Rapidash fits on bulky offense and balance teams as a check to many of ZU's prominent offensive threats. Tangela is an amazing partner, as it covers problematic Water- and Ground-types like Wishiwashi and Rhydon. In return, Rapidash is able to take on opposing Fire- and Ice-types and Eldegoss, which give Tangela trouble. This core is often paired with special walls like Clefairy and Wishiwashi to handle foes like special Basculin and Rotom. Ice-types like Frosmoth and Articuno can threaten the aforementioned Ground-types while also dealing with the problematic Altaria. Knock Off absorbers like Uxie and Qwilfish are necessary to preserve Rapidash's Heavy-Duty Boots, which is crucial to letting it consistently switch in.</p> "
      },
      {
        "name": "Swords Dance",
        "description": "<p>Swords Dance Rapidash is a wallbreaker and cleaner that faces competition with Ninetales as a Fire-type setup sweeper. High Horsepower targets foes like Rhydon, Coalossal, and Qwilfish. Morning Sun provides Rapidash with reliable recovery, mitigating some of the recoil from Flare Blitz and letting it consistently switch into foes like Frosmoth and Ninetales. Wild Charge handles opposing Water-types like Wishiwashi, Poliwrath, and Cramorant.</p> <p>Swords Dance Rapidash functions best as a mid-game wallbreaker that can also double as a late-game cleaner. Grass-types like Tangela and Thwackey can help weaken Water-, Rock-, and Ground-types like Wishiwashi, Rhydon, and Piloswine; in return, they appreciate Rapidash forcing out Skuntank and Silvally-Poison and handling Tangela. Ice-types like Frosmoth, Articuno, and Jynx threaten Dragon- and Water-types like Altaria, Appletun, and Poliwrath. Entry hazard support from Rhydon and Qwilfish is valuable, wearing down physically bulky foes like Wishiwashi and Gurdurr into KO range. Likewise, special wallbreakers like Rotom, Basculin, and Skuntank can also pressure the aforementioned physical walls.</p> "
      },
      {"name": "Sun Wallbreaker"}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 369076, "username": "Tuthur"}, {"user_id": 296755, "username": "5gen"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 449990, "username": "DC"}]}
  },
  "Rapidash-Galar": {"sets": [{"name": "Swords Dance"}, {"name": "Bulky Calm Mind"}]},
  "Exeggutor": {"sets": [{"name": "Choice Specs"}, {"name": "Future Sight Pivot"}, {"name": "Sunny Day"}]},
  "Rhydon": {
    "comments": "<h1>Other Options</h1> <p>Life Orb and Adamant can be used on the offensive set to break past physically defensive Tangela, as Megahorn boosted by Swords Dance has an 81.3% chance to OHKO; however, the loss of bulk causes Rhydon to fare worse against most other matchups, and Life Orb sets alone are outclassed by Lycanroc-M due to Rhydon's lack of speed. Physically defensive sets are also a viable option if a team is in desperate need of a physical wall. However, opting for Special Defense investment tends to be preferable so that Rhydon can take on neutral special attacks decently well. High Horsepower should be used over Earthquake if Rhydon is paired with Thwackey.</p> <h1>Checks and Counters</h1> <p><strong>Grass-types: Grass-types such as Tangela, Gourgeist-S, and Thwackey threaten Rhydon out, although they dislike switching into Toxic, and Tangela must be wary of offensive sets if it loses its Eviolite. Thwackey's Grassy Glide can always revenge kill Rhydon even after it has used Rock Polish.</p> <p><strong>Water-types: Wishiwashi and Poliwrath can all reliably switch into Rhydon and threaten it out with their STAB moves. Other Water-types like Basculin and Cramorant easily outspeed and can OHKO Rhydon, but cannot risk switching into Rhydon's attacks. All of these Pokemon must also be wary of Toxic.</p> <p><strong>Faster Special Attackers: Due to Rhydon's common weaknesses and naturally low Special Defense, Pokemon with a high Special Attack stat such as Ninetales, Frosmoth, and Jynx can all reliably revenge kill Rhydon, although they require a free turn to safely switch in.</p> <p><strong>Passive Damage: Residual damage from status and entry hazards punishes Rhydon heavily due to its lack of recovery. Burns in particular are problematic, as they make it nearly impossible for offensive sets to wallbreak, while defensive sets cannot reliably threaten out hazard removal.</p> <p><strong>Fighting-types</strong>: Throh and Gurdurr have no issues switching into Rhydon's attacks, and Sawk can easily revenge kill Rhydon.</p> ",
    "sets": [
      {
        "name": "Stealth Rock",
        "description": "<p>Rhydon is one of the premier Stealth Rock users, as its solid typing allows it to easily threaten out most common hazard control foes such as Altaria, Rotom-S, and Coalossal. Rhydon can also opt for Rock Blast over Stone Edge for a move with better accuracy and the ability to break past Substitutes of Rotom, Articuno, and Uxie. Swords Dance lets Rhydon set up on passive walls and force out Altaria more reliably as it would attempt to Roost stall Rhydon after landing a Toxic. Alternatively, Roar synergizes well with Stealth Rock and phazes foes like Alcremie and Uxie, thereby preventing Rhydon from becoming setup fodder. Toxic cripples physical walls such as Tangela and Gourgeist-S that often switch into Rhydon. 84 Speed allows Rhydon to outspeed Pokemon with base 50 Speed, such as Piloswine. 16 Attack EVs and an Adamant nature greatly increase Rhydon's power while also allowing for enough Special Defense investment to reliably check Rotom and Skuntank.</p> <p>Rhydon's 4x weakness to Water- and Grass-type attacks means it must rely on teammates such as Tangela, Thwackey, and Altaria to switch in to such attacks. Qwilfish can form great hazard stacking cores with Rhydon, Qwilfish also having access to Taunt to shut down Defoggers. Gourgeist also serves as a good partner for Rhydon, as it can cover for Rhydon's Fighting-type weakness, while Rhydon can switch into Fire-type attacks. Fire-types like Ninetales and Rapidash appreciate Rhydon's abilities to lure in Grass-types and to counter Altaria.</p> "
      },
      {
        "name": "Swords Dance",
        "description": "<p>With a monstrous base 130 Attack stat and access to Swords Dance, Rhydon makes for a solid wallbreaker. The combination of Earthquake and Stone Edge covers the majority of ZU for at least neutral damage. Stealth Rock is a solid option if your team is in need of a Stealth Rock setter, while Rock Polish boosts Rhydon's Speed and turns it into a late-game win condition as well. Megahorn can also be used, as it allows Rhydon to hit Tangela, one of its most common switch-ins, for super effective damage, even threatening to OHKO Tangela after a Swords Dance boost. Megahorn also threatens the likes of Uxie, Lurantis, and Eldegoss.</p> <p>Rhydon pairs very well with physical attackers that have access to Knock Off such as Sawk and Thwackey, as they can lure in Tangela and remove its Eviolite, so that Rhydon can threaten it with Stone Edge or Megahorn. Qwilfish makes for good partners, as it forms a solid hazard core with Rhydon, which also aids its wallbreaking attempts. Rhydon should be paired with pivots such as Rotom, Wishiwashi, and Uxie to provide safe setup opportunities. Rhydon will require teammates that can handle its 4x weakness to Grass- and Water-type attacks; some good options for this role include Altaria, Articuno, and Tangela.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 369076, "username": "Tuthur"}, {"user_id": 231074, "username": "S1nn0hC0nfirm3d"}]}, {"name": "Grammar checked by", "members": [{"user_id": 229690, "username": "queez"}]}], "writtenBy": [{"user_id": 226429, "username": "Jett"}]}
  },
  "Tangela": {
    "comments": "<h1>Other Options</h1> <p>Tangela can run an offensive spread with a Modest nature, which makes it less passive while still being able to check most physical attackers. However, Tangela's coverage is narrow and can be easily walled; it's also forced to use Synthesis more often to maintain its HP. Stun Spore is an alternative over Sleep Powder or Toxic to paralyze foes, but crippling a foe with sleep or poison is usually preferred.</p> <h1>Checks and Counters</h1> <p><strong>Special Attackers</strong>: Tangela has an abysmal special bulk and can be 2HKOed by almost any unresisted special attack. In particular, special attackers like Rotom-S and Skuntank have a great matchup against Tangela and can easily OHKO it. Strong special wallbreakers like Basculin are even able to break through Tangela with resisted attacks.</p> <p><strong>Item Removal: Without its Eviolite, Tangela is unable to reliably counter some physical attackers like Sawk. This is troublesome, as Tangela is often the preferred switch-in for common Knock Off users such as Sawk, Shiftry, and Cinccino.</p> <p><strong>Fire-types: Fire-types such as Rapidash and Ninetales can break through Tangela's huge physical bulk with their super effective STAB moves. However, they dislike losing their Heavy-Duty Boots to Knock Off.</p> <p><strong>Ice-types: Articuno and Jynx threaten Tangela with their super effective STAB moves, while Frosmoth can use Tangela as setup fodder. They have to be wary of getting their item removed by Knock Off, though.</p> ",
    "sets": [
      {
        "name": "Physical Wall",
        "description": "<p>Tangela is an amazing physical wall thanks to its immense Eviolite-boosted physical bulk backed by Regenerator. This combination allows it to consistently absorb the hits of physical attackers such as Rhydon, Sawk, and Kangaskhan and regain the lost health by switching out. Giga Drain is the preferred STAB move for its additional recovery. Leaf Storm can be used instead for a powerful nuke, especially against Knock Off users like Sawk and Alolan Persian; the Special Attack drop isn't that crippling, as Tangela enjoys pivoting to regain HP with Regenerator. Knock Off lets Tangela cripple its checks such as Rapidash, Rotom-S, and Articuno. Sludge Bomb lets Tangela threaten Grass-types such as Shiftry and Flapple, which take little from Tangela's other moves and are immune to Sleep Powder and Leech Seed. Synthesis is Tangela's most reliable recovery move, letting it more comfortably check Choice Band Sawk and Kangaskhan, but Leech Seed can be used as an alternative, providing recovery to Tangela and chipping down its checks. Sleep Powder lets Tangela neutralize a foe to make pivoting easier, whereas Toxic puts walls that can otherwise take advantage of Tangela, such as Miltank and Uxie, on a timer.</p> <p>Tangela is a great choice for many teams, ranging from stall to bulky offense, and it appreciates being paired with special walls such as Galarian Stunfisk, Wishiwashi, and Clefairy. Partners such as Qwilfish, Cramorant, and Altaria can handle Fire-types like Rapidash and Ninetales for Tangela, while it can take on the likes of Kangaskhan and Rhydon for them. Knock Off absorbers such as Silvally-Poison and Miltank are appreciated to preserve Tangela's Eviolite. Entry hazard supports from the likes of Uxie, Piloswine, and Clefairy is appreciated by Tangela, as it can remove Heavy-Duty Boots from checks like Altaria, Frosmoth, and Rotom-S, which are pressured by Stealth Rock without their item. Wallbreakers such as Thievul, Sawk, and Basculin value Tangela's ability to sponge hits for them when they are forced out.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 231074, "username": "S1nn0hC0nfirm3d"}, {"user_id": 435539, "username": "BloodAce"}]}, {"name": "Grammar checked by", "members": [{"user_id": 449990, "username": "DC"}]}], "writtenBy": [{"user_id": 369076, "username": "Tuthur"}]}
  },
  "Kangaskhan": {
    "comments": "<h1>Other Options</h1> <p>Body Slam is considerably weaker than Double-Edge, but Kangaskhan can use it instead for the paralysis chance and lack of recoil. Choice Band offers more immediate power and coverage, although the lack of reliable priority limits this set's potential. Substitute is an option to takes advantage of the switches Kangaskhan forces, and Power-Up Punch is another option for Kangaskhan to become a situational setup sweeper.</p> <h1>Checks and Counters</h1> <p><strong>Physical Walls</strong>: Poliwrath, Tangela, and Alolan Persian are able to take hits from Kangaskhan and threaten back with Fighting-type coverage, status, or pivoting. Tanks like Rhydon and Gurdurr also pose a threat to Kangaskhan.</p> <p><strong>Residual Damage: Kangaskhan's Fake Out is often punished by Rocky Helmet users like Miltank and Qwilfish. Furthermore, Kangaskhan's entry hazard vulnerability and induced recoil from Double-Edge causes it to lose valuable chunks of HP and limits its turns on the field.</p> <p><strong>Revenge Killers: Faster attackers, especially ones able to take a Sucker Punch like Basculin, Silvally-Dark, and Choice Scarf Sawk are able to force out Kangaskhan. If Kangaskhan has an Adamant nature, more attackers like Rotom-S and Cramorant may also outspeed and deal with it.</p> ",
    "sets": [
      {
        "name": "Priority Attacker",
        "description": "<p>Kangaskhan is a dangerous priority attacker with wallbreaking potential when chaining together its STAB Fake Out and Double-Edge. It is thus equally prepared to check faster attackers like Basculin and Rotom and break special walls like Articuno and Clefairy. Sucker Punch combines with Fake Out for additional priority damage, and it is especially warranted to check setup sweepers like Silvally formes. Earthquake hits Steel- and Rock-types like Galarian Stunfisk, Coalossal, and Rhydon, and it avoids adverse contact effects from Rocky Helmet Qwilfish. Scrappy is essential to prevent frail Ghost-types from switching in and blocking Qwilfish's Intimidate. Silk Scarf improves Kangaskhan's main attacks. Heavy-Duty Boots instead combats Kangaskhan's residual damage vulnerability on teams with unreliable entry hazard control. A Jolly nature allows Kangaskhan to revenge kill Rotom-S and Choice Band Sawk more reliably, while Adamant picks up more KOs, like against Clefairy.</p> <p>Entry hazards from Qwilfish, Coalossal, and Rhydon are invaluable to Kangaskhan, as it relies on the additional chip damage to stack with Fake Out and pressure more threats; Toxic Spikes from the first two is particularly potent. Another way to facilitate Fake Out is using defensive pivots such as Uxie, Alolan Persian, and Wishiwashi; these teammates are also valuable switch-ins when Kangaskhan is targeted by Sawk, Silvally formes, and Basculin. In return, these pivots rely on Kangaskhan to break walls that they are outstalled by and to punish threats like Frosmoth. Special wallbreakers like Choice Specs Basculin, Nasty Plot Skuntank, and Rotom break walls like Tangela and Rhydon that Kangaskhan struggles with. Fake Out and Sucker Punch won't deal with every faster threat, so a Choice Scarf user like Sawk or Rotom should clean and revenge kill alongside Kangaskhan. Knock Off support from Clefairy, Gurdurr, and Shiftry removes Heavy-Duty Boots, Eviolite, and Leftovers from walls, making Kangaskhan more effective at wallbreaking Altaria, Tangela, and Wishiwashi.</p> "
      },
      {"name": "Trapper"}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 240237, "username": "kay"}, {"user_id": 369076, "username": "Tuthur"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 231074, "username": "S1nn0hC0nfirm3d"}]}
  },
  "Jynx": {
    "comments": "<h1>Other Options</h1> <p>Substitute with Nasty Plot over Lovely Kiss is an option to avoid possible misses or status moves from passive Pokemon. However, it's not as powerful as putting an opposing Pokemon to sleep, and it still leaves Jynx vulnerable to Klinklang's Gear Grind and Cinccino's Tail Slap. Choice Scarf can be run over Choice Specs to get surprise KOs on faster Pokemon like Morpeko and Alolan Persian, however the difference in power is noticeable, and Jynx's entry hazard weakness gives it limited opportunities to revenge kill.</p> <h1>Checks and Counters</h1> <p><strong>Specially Bulky Pokemon: Articuno, Wishiwashi, and Uxie can survive hits from Jynx and threaten it with Knock Off or U-turn. However, they need to be careful of Psyshock and Trick or they can eventually get in range of a KO during the course of a game if they lack reliable recovery.</p> <p><strong>Priority Users: Kangaskhan, Thwackey, Shiftry, and Gurdurr can exploit Jynx's physical frailty to KO or heavily damage it.</p> <p><strong>Steel-types: Klinklang and Perrserker can switch into Jynx safely if it locks itself into either of its STAB attacks, but they must be wary of Focus Blast.</p> <p><strong>Faster Pokemon: Alolan Persian, Rapidash, and Morpeko outspeed Jynx and OHKO it; they can also switch in against it on a good prediction. Cinccino and Manectric can always revenge kill Jynx, but they can never switch into it. Choice Scarf users like Sawk and Rotom can always revenge kill Jynx, although Rotom can't KO it from full HP.</p> ",
    "sets": [
      {
        "name": "Choice Specs",
        "description": "<p>Jynx's good Speed tier and phenomenal STAB combination make it one of the most powerful special attackers in ZU. Choice Specs enables Jynx to OHKO common metagame picks like Tangela, Qwilfish, and Rotom and 2HKO Skuntank and physically defensive Alcremie. Psyshock can be used over Psychic to help against specially defensive foes such as Articuno and Wishiwashi. Focus Blast can OHKO Steel-types like Klinklang and Perrserker while also threatening Ice-resistant foes like Piloswine and Miltank. Trick cripples special walls like Clefairy and Articuno and make them ineffective. Dry Skin gives Jynx switch-in opportunities against Water-types such as Basculin and Qwilfish, although it must be wary of switching into the occasional Poison Jab from the latter.</p> <p>Jynx appreciates teammates such as Thwackey and Silvally-Poison, which can bring it in safely and lure foes like Qwilfish, Altaria, and Tangela for it to take advantage of. Slow bulky pivots like Clefairy and Wishiwashi also allow it to switch in safely. Entry hazard control is key to Jynx's longevity, so Altaria, Articuno, Rotom, Morpeko, and Kabutops are good partners; most of the aforementioned Pokemon can also use a pivot move to bring Jynx in. Jynx's abysmal physical bulk and common weaknesses mean it requires bulky teammates, especially Knock Off and U-turn absorbers such as Alcremie, Clefairy, Silvally-Poison, and Tangela, to sponge physical hits.</p> "
      },
      {
        "name": "Lovely Kiss",
        "description": "<p>Lovely Kiss and a good Speed tier allow Jynx to put an opposing Pokemon to sleep, possibly a defensive wall like Clefairy or Articuno that is expecting Choice Specs Jynx, in the early-game. Once its counter has been put to sleep, Jynx can threaten the rest of the team with its very good coverage. Moreover, Heavy-Duty Boots improves its longevity, allowing it to keep threatening KOs or put a foe to sleep. Nasty Plot is an option to improve Jynx's damage output, exploiting the free turns gained by putting a foe to sleep; however, it is not easy for Jynx to sweep the opposing team even with Nasty Plot, especially considering that Pokemon like Rapidash, Morpeko, and Alolan Persian can switch in on a predicted Nasty Plot and force it out.</p> <p>Pivots like Thwackey, Silvally-Poison, Alolan Persian, and Basculin allow Jynx to safely get on the field in a favorable position and give it opportunities to use Lovely Kiss or to fire off a strong STAB move. The same applies to bulky pivots like Clefairy and Wishiwashi. Jynx's sleep support is beneficial for teammates like Klinklang, Perrserker, and Rapidash, which can take advantage of the free turns and force out common sleep fodder like Clefairy or Articuno. Jynx needs teammates that cover its weaknesses and can switch into fast Dark-types, so Alcremie and Gurdurr are good partners. Defensive Pokemon like Tangela and Qwilfish stop many priority users and fast physical attackers like Kangaskhan, Thwackey, and Cinccino.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 369076, "username": "Tuthur"}, {"user_id": 226429, "username": "Jett"}]}, {"name": "Grammar checked by", "members": [{"user_id": 449990, "username": "DC"}]}], "writtenBy": [{"user_id": 490348, "username": "Albi"}]}
  },
  "Lapras": {"sets": [{"name": "Choice Specs"}]},
  "Kabutops": {"sets": [{"name": "Choice Scarf"}]},
  "Articuno": {
    "comments": "<h1>Other Options</h1> <p>Articuno can opt for a physically offensive set with options like Triple Axel, Brave Bird, and Ice Shard, but physical walls are more common, which makes special Articuno more effective at breaking through defensive cores.</p> <h1>Checks and Counters</h1> <p><strong>Rock-type Pokemon and Coverage</strong>: Due to its 4x weakness to Rock, any Rock-type move will at least 2HKO Articuno. This makes Rock-types like Rhydon and Coalossal extremely annoying for Articuno, as they can easily set up entry hazards against it.</p> <p><strong>Item Removal: Retaining Heavy-Duty Boots is key to maintaining Articuno's defensive capabilities, and it should avoid switching into Knock Off and Trick users like Shiftry, Gurdurr, Thwackey, and Rotom. However, if Articuno is the team's entry hazard remover and is able to consistently use Defog against the opposing Stealth Rock setter, it can afford to lose its item.</p> <p><strong>Fire-types: Fire-types such as Ninetales and Rapidash force out Articuno with their super effective STAB move. However, they take great damage from Articuno's Flying-type STAB moves, and they dislike being crippled by Toxic.</p> <p><strong>Electric-types: Morpeko, Manectric, and Rotom formes threaten Articuno with their super effective STAB moves and generate momentum with Volt Switch. However, weaker Electric-types like Choice Scarf Rotom and defensive Rotom-S can't break through specially defensive Articuno.</p> <p><strong>Steel-types: Steel-types such as Perrserker and Klinklang are immune to Toxic, resist Articuno's STAB moves, and take on Articuno with their super effective STAB moves.</p> ",
    "sets": [
      {
        "name": "Specially Defensive",
        "description": "<p>Articuno is an amazing special wall and one of the best form of entry hazard control in ZU thanks to Pressure + Defog keeping entry hazards off the field against numerous setters such as Qwilfish, Uxie, and Clefairy, its amazing bulk, and reliable recovery in Roost. Freeze-Dry lets Articuno threaten entry hazard setters like Qwilfish and Stunfisk, as well as Pokemon that can freely switch into its other moves like Tangela and Altaria. Alternatively, Brave Bird is the preferred STAB move to check Frosmoth. Toxic wears down opposing walls such as Cramorant and entry hazard setters such as Coalossal and Rhydon, which forces Articuno out, while U-turn turns Articuno into a pivot. Articuno can also run Haze to stop Stored Power users like Alcremie and Uxie or Heal Bell to act as a cleric. The given EV spread lets Articuno outspeed Adamant Trevenant. Alternatively, Articuno can run 136 Speed EVs with a Jolly nature to outspeed Flapple and Adamant Shiftry.</p> <p>Specially defensive Articuno fits on almost any kind of team, ranging from stall to bulky offense. On offensive teams, it forms a VoltTurn core with partners like Silvally formes, Uxie, and Alolan Persian. Frail attackers such as Basculin, Cinccino, and Shiftry enjoy safely coming on the field through these VoltTurn cores and benefit from slower pivots like Articuno sponging attacks for them. Knock Off absorbers like Qwilfish, Pyukumuku, and Silvally formes are great partners that can preserve Articuno's Heavy-Duty Boots and sponge physical hits, while it handles special attackers for them. Ground-types like Rhydon and Stunfisk make for excellent partners for their ability to handle Articuno's weaknesses, while they appreciate Articuno checking Frosmoth and specially offensive Basculin.</p> "
      },
      {
        "name": "SubRoost",
        "description": "<p>The combination of Substitute, Roost, and Pressure lets Articuno stall out moves with low PP such as Ninetales's Fire Blast, Kabutop's Stone Edge, and Gourgeist-S's Poltergeist. Thanks to its great Speed and bulk, Articuno is able to easily set up a Substitute against passive Pokemon such as Tangela, Eldegoss, and Qwilfish. Toxic works well with the combination of Roost + Substitute, racking up damage on foes like Coalossal, Uxie, and Kangaskhan. Freeze-Dry is the preferred STAB move to cover Qwilfish, Wishiwashi, and Altaria, which can sponge Toxic.</p> <p>SubRoost Articuno fits well on balance and bulky offense teams looking for a Pokemon that does well against balance teams. Knock Off absorbers like Silvally formes, Qwilfish, and Alolan Persian are appreciated to preserve Articuno's Heavy-Duty Boots. VoltTurn users like Basculin, Manectric, and Uxie safely bring Articuno onto the field, letting it avoid Knock Off from the likes of Tangela and Uxie. Ground-types such as Alolan Dugtrio, Rhydon, and Stunfisk make for great partners, checking Steel-, Fire-, Rock-, and Ground-types such as Perrserker, Coalossal, and Rhydon. In return, Articuno checks Water- and Grass-types such as Qwilfish, Appletun, and Flapple for them. Checks to Steel-types like Sawk, Rapidash, and Manectric are especially important, since Steel-types like Klinklang and Perrserker completely shut down SubRoost Articuno.</p> "
      },
      {
        "name": "Roost + 3 Attacks",
        "description": "<p>Articuno is a great offensive pivot that is able to dish out powerful Hurricanes and Freeze-Drys. The given EV investment in conjunction with its coverage allows Articuno to outspeed and nail threats such as Thwackey, Poliwrath, and Gurdurr. Thanks to U-turn, Articuno is able to pivot from bad matchups and safely bring in partners.</p> <p>Roost + 3 Attacks Articuno fits on offensive teams with VoltTurn cores, which makes Uxie, Rotom, and Wishiwashi great partners. Articuno also excels on entry hazard stacking teams, since it preys on common Defoggers such as Cramorant and Altaria and is able to generate momentum with U-turn. Physical wallbreakers such as Kangaskhan, Cinccino, and Silvally formes can take advantage of Articuno inviting in and pivoting against special walls such as Coalossal, Clefairy, and Miltank. In return, Articuno can threaten physical walls such as Qwilfish, Wishiwashi, and Tangela for them. Ground-types like Alolan Dugtrio and Rhydon are great partners, checking Rock-, Fire-, Steel-, and Electric-types such as Coalossal, Klinklang, and Stunfisk. Knock Off absorbers like Uxie, Alolan Persian, and Qwilfish let Articuno keep its Heavy-Duty Boots.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 231074, "username": "S1nn0hC0nfirm3d"}, {"user_id": 296755, "username": "5gen"}]}, {"name": "Grammar checked by", "members": [{"user_id": 449990, "username": "DC"}]}], "writtenBy": [{"user_id": 369076, "username": "Tuthur"}]}
  },
  "Qwilfish": {
    "comments": "<h1>Other Options</h1> <p>A Swords Dance set can act as a terrifying stallbreaker with Qwilfish's Toxic immunity and access to Taunt. However, it lacks bulk and power, even when boosted. Qwilfish can run max Speed on its defensive set to outspeed attackers like Skuntank and Adamant Kangaskhan; however, that jeopardizes its ability to handle physical attackers. Such sets can run Destiny Bond to get an unexpected KO, but Qwilfish usually doesn't have the room for it and is required to run an inferior max Speed spread. Although weaker than Liquidation, Waterfall is an option on both sets for its flinch chance and synergy with Thunder Wave. Poison Jab is also an alternative to the STAB moves on defensive sets for its ability to damage Water-resistant attackers like Exeggutor, Basculin, and Shiftry and spread poison. However, Thunder Wave and Scald already spread status and cripple those Pokemon.</p> <h1>Checks and Counters</h1> <p><strong>Uxie: Thanks to Levitate, Uxie isn't affected by Qwilfish's entry hazards and can heavily damage it with Psychic, while Qwilfish hardly hurts Uxie with its moves. Uxie's Future Sight is also a huge threat to Qwilfish, as it prevents Qwilfish from switching into threats it is supposed to counter, such as Rapidash and Gurdurr.</p> <p><strong>Ground-immune Entry Hazard Removers: Entry hazard removers such as Rotom, Rotom-S, Altaria, and Cryogonal aren't affected by Spikes and threaten Qwilfish with their powerful special attacks. They can easily force Qwilfish out and use that opportunity to remove its entry hazards.</p> <p><strong>Special Attackers: Qwilfish's special bulk is underwhelming, meaning that special attackers such as Thievul, Rotom, and Articuno can easily OHKO it.</p> <p><strong>Ground-types: Qwilfish is weak to Ground-types and cannot handle crucial physical attackers such as Rhydon and Piloswine, even if they are 2HKOed by Qwilfish's Water-type STAB moves. Qwilfish also takes heavy damage from common Ground-type coverage from wallbreakers like Rapidash and Sawk; the latter is noteworthy due to Inner Focus ignoring Intimidate.</p> <p><strong>Strong Physical Wallbreakers: Even with Intimidate, Qwilfish's bulk isn't amazing and, without any reliable recovery moves, it is quickly put in range of powerful wallbreakers like Kangaskhan, Choice Band Cinccino, and Swords Dance Silvally formes.</p> ",
    "sets": [
      {
        "name": "Defensive Spikes",
        "description": "<p>Qwilfish is a premier physical wall that is able to set Spikes or Toxic Spikes and counter powerful physical attackers such as Basculin and Sawk. Its typing also lets it absorb Toxic Spikes from opposing Qwilfish. Thanks to Taunt, Qwilfish can prevent slower Pokémon such as Pyukumuku and Gurdurr from setting up, recovering HP, and setting entry hazards. Thunder Wave cripples faster attackers such as Skuntank, specially offensive Basculin, and Articuno, which can otherwise freely switch into Qwilfish. Liquidation is the preferred STAB move for its ability to OHKO Rapidash and Ninetales after minimal residual damage. Scald is another option that, while significantly weaker, can cripple switch-ins with a burn. Pain Split improves Qwilfish's longevity versus bulkier teams. Rocky Helmet lets Qwilfish wear down physical attackers, punishing resisted moves like Gurdurr's Mach Punch, Sawk's Close Combat, and Basculin's Flip Turn. Alternatively, Black Sludge makes Qwilfish less reliant on Pain Split. The given EV spread lets Qwilfish outspeed Timid Exeggutor and maximize its physical bulk.</p> <p>Qwilfish fits well on bulky offense and balance teams that appreciate its defensive utility and ability to set entry hazards. Special walls like Articuno, Stunfisk, and Clefairy make for great partners, as they are able to handle special attackers like Frosmoth, Rotom, and Manectric; in return, Qwilfish handles physical attackers such as Sawk and Rapidash. Ground-immune and -resistant Pokemon such as Rotom-S, Uxie, and Tangela cover Qwilfish's Ground weakness. VoltTurn cores pair well with Spikes, as they force a lot of switches. Therefore, Pokemon such as Rotom, Silvally-Dark, and Cinccino make for great partners. Spikes are appreciated by wallbreakers like Rapidash and Sawk; Kangaskhan is a noteworthy example, as it can force switches thanks to Fake Out. Knock Off users such as Shiftry, Thwackey, and Gurdurr can remove opposing Heavy-Duty Boots, bolstering the effectiveness of Qwilfish's entry hazards.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 231074, "username": "S1nn0hC0nfirm3d"}, {"user_id": 445642, "username": "Apagogie"}]}, {"name": "Grammar checked by", "members": [{"user_id": 449990, "username": "DC"}]}], "writtenBy": [{"user_id": 369076, "username": "Tuthur"}]}
  },
  "Shuckle": {"sets": [{"name": "Sticky Web"}]},
  "Piloswine": {
    "comments": "<h1>Other Options</h1> <p>Toxic allows Piloswine to wear down foes like Tangela, Poliwrath, Pyukumuku, and Wishiwashi. Rock Slide provides coverage against Frosmoth and Articuno.</p> <h1>Checks and Counters</h1> <p><strong>Water-types: Bulky Water-types like Poliwrath, Wishiwashi, Pyukumuku, and Cramorant are able to switch into Piloswine and force it out, with Cramorant also removing Stealth Rock. Although they cannot directly switch into Piloswine, offensive Water-types like Basculin and Ludicolo can threaten to KO it.</p> <p><strong>Fighting-types and Fighting-type Coverage: Fighting-types like Sawk, Gurdurr, and Poliwrath pressure Piloswine immensely.</p> <p><strong>Grass-types: Even though they cannot switch into Piloswine and fear being revenge killed by Ice Shard if weakened, Shiftry and Tangela are able to threaten Piloswine. Tangela is able to tank hits from Piloswine and cripple it with Toxic and Knock Off or KO it with Leaf Storm or Giga Drain.</p> <p><strong>Residual Damage: Given Piloswine's lack of recovery, residual damage from entry hazards and status can wear it down over the course of the battle.</p> ",
    "sets": [
      {
        "name": "Stealth Rock",
        "description": "<p>Piloswine's typing, huge bulk, and Thick Fat let it serve as a Stealth Rock setter that has good matchups against some Stealth Rock setters such as Rhydon and Galarian Stunfisk. Earthquake and Icicle Crash form a formidable STAB combination, hitting relevant targets such as Skuntank, Silvally formes, and Rotom-S. Ice Shard allows Piloswine to revenge kill weakened foes such as Shiftry and Rotom. Thick Fat lets Piloswine switch into the likes of Rapidash.</p> <p>Piloswine fits best on bulky offensive teams that appreciate its ability to take hits and consistently set Stealth Rock. Water-types such as Wishiwashi, Poliwrath, and Cramorant are problematic for Piloswine; checks to them such as Eldegoss and Cramorant are appreciated. Fighting-types like Sawk, Gurdurr, and the aforementioned Poliwrath greatly pressure Piloswine. Partners such as Rotom-S and Qwilfish can alleviate this weakness; the former can provide VoltTurn support, while the latter can wear down problematic foes such as Tangela and Miltank with Spikes and Toxic Spikes.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 435539, "username": "BloodAce"}, {"user_id": 369076, "username": "Tuthur"}]}, {"name": "Grammar checked by", "members": [{"user_id": 331519, "username": "CryoGyro"}]}], "writtenBy": [{"user_id": 449990, "username": "DC"}]}
  },
  "Miltank": {
    "comments": "<h1>Other Options</h1> <p>With its great Speed tier, useable Attack stat, and decent coverage, Miltank can also run offensive sets, while keeping defensive utilities with its abilities. However, it faces heavy competition from other Normal-type wallbreakers like Cinccino, Silvally, and Kangaskhan, and it heavily struggles due to its inability to threaten Rotom.</p> <h1>Checks and Counters</h1> <p><strong>Fighting-type Pokemon and Coverage: Thanks to their super effective STAB moves, the likes of Sawk, Poliwrath, and Throh can easily defeat Miltank. Pokemon like Perrserker and Jynx also carry Fighting-type coverage, allowing them to break through Miltank.</p> <p><strong>Toxic: Toxic heavily cripples Miltank, tremendously limiting its ability to handle most threats in the long run. However, it can combat this weakness with Heal Bell.</p> <p><strong>Toxic Counterplay</strong>: Miltank mostly relies on Toxic to deal damage. However, Pokemon like Substitute + Nasty Plot Rotom, Nasty Plot Skuntank, and Rest Alcremie can set up on Miltank without fearing Toxic much, proceeding to break through its team. Altaria and Clefairy aren't much bothered by Toxic, reliably heal off Seismic Toss damage, and take advantage of Miltank with their own status moves. Rest users like Throh and Wishiwashi can also absorb Toxic and avoid the 3HKO from Seismic Toss, threatening Miltank with their powerful moves.</p> <p><strong>Trick: Rotom, Manectric, and Jynx can cripple Miltank and limit its walling capabilities with Trick. However, the latter may struggle to switch directly in against Body Slam variants.</p> ",
    "sets": [
      {
        "name": "Special Wall",
        "description": "<p>Specially defensive Miltank can take advantage of most special attackers like Articuno, Tangela, and Alcremie. Seismic Toss is its most consistent attack, ignoring stat boosts and bothering even defensive behemoths like Tangela and Articuno. While often weaker, Body Slam is alternative that can spread paralysis. Toxic allows Miltank to cripple foes like Stunfisk and Eldegoss, forcing certain walls such as Wishiwashi and Altaria to use Rest or switch out to activate Natural Cure, respectively. If Miltank's team already has a Stealth Rock user, Miltank can run Heal Bell to help teammates like Silvally formes and Thwackey, which can end up crippled by the likes of paralysis or a Scald burn. Thick Fat allows Miltank to take on threatening special wallbreakers like Ninetales and Frosmoth. The given EV spread lets Miltank outspeed Timid Frosmoth while maximizing its special bulk.</p> <p>Specially defensive Miltank is a great pick for balance teams. It has great synergy with Grass-types like Eldegoss, Tangela, and Gourgeist formes, being able to handle most of their checks, while they help with physical attackers like Thwackey and Sawk. Offensive Ground-types such as Alolan Dugtrio, Rhydon, and Piloswine help Miltank take on special attackers like Skuntank and prevent Electric-types such as Manectric and Rotom from freely pivoting. Gourgeist formes, Alcremie, and Altaria are also appreciated to answer Fighting-types like Sawk and Gurdurr, and in exchange they appreciate Miltank's Ice resistance and ability to handle special attackers. Due to Miltank's susceptibility to status, status absorbers like physically defensive Wishiwashi and Altaria make for great partners.</p> "
      },
      {
        "name": "Mixed Wall",
        "description": "<p>With a mixed defensive EV spread, Miltank can take on most unboosted attackers in the tier, whether special or even physical like Rhydon lacking Swords Dance, Alolan Dugtrio, and Liepard. Seismic Toss's fixed damage is very reliable, while Body Slam, if often weaker, can spread paralysis while keeping enough power for frail attackers. Toxic lets Miltank put foes with recovery like Eldegoss, Tangela, and Articuno on a timer, allowing it to win one-on-one. Toxic can also force Pokemon like Wishiwashi, Throh, and Alcremie to use Rest later on. Heal Bell is an option for teams that already have a Stealth Rock user, helping its team against bulkier teams using a lot of status moves. Heavy-Duty Boots maximizes Miltank's longevity, giving it more switch-in opportunities; however, Rocky Helmet is an option to punish physical attackers, especially U-turn users like Cinccino, Thwackey, and Silvally formes. Thick Fat is the preferred ability, letting Miltank handle Rapidash and Frosmoth. The given spread allows Miltank to outspeed Timid Frosmoth and avoid the 2HKO from Nasty Plot-boosted Ninetales, as well as checking physical attackers like Swords Dance Thwackey, Kangaskhan, and Silvally-Dark.</p> <p>This set fits well in balance teams looking for a blanket wall. It pairs especially well with Fighting-type checks such as Alcremie, Altaria, Cramorant, and Gourgeist-S able to answer Poliwrath and Sawk. Specially defensive Ground-types such as Rhydon and Stunfisk are great to answer Rotom and Skuntank for Miltank, while Miltank takes care of Ice-types like Jynx and Frosmoth. Status absorbers like Throh and specially defensive Wishiwashi can take on Toxic users like Altaria, Alolan Persian, and Stunfisk for Miltank.</p> "
      },
      {
        "name": "Nascar Cow",
        "description": "<p>With its great bulk, even with only HP investment, and excellent Speed, outpacing major threats like Silvally formes, Sawk, and Thievul, Miltank can double up as a wall and revenge killer for bulkier teams. Seismic Toss is the prefered offensive move thanks to its fixed damage; Body Slam's paralysis chance is not very valuable due to Miltank already outspeeding most foes. Toxic puts threats with reliable recovery like Alcremie, Articuno, and Cramorant on a timer. This set can notably hit Rotom with Toxic before it sets up a Substitute. If Miltank doesn't need to set up Stealth Rock, Heal Bell turns it into a cleric. Rocky Helmet is the preferred item, as, paired with Miltank's fast Seismic Toss and Toxic damage, it enables huge damage on physical attackers. Sap Sipper turns Miltank into one of the most reliable Grass-type checks in the tier, absorbing Sleep Powder from Eldegoss and Tangela, not carrying that much about losing its item from Thwackey's and Tangela's Knock Off, and being immune to both of Gourgeist-S's STAB moves. Thick Fat is another option, but due to this set's lack of Special Defense investment, it can't reliably switch into the likes of Frosmoth, Jynx, and Ninetales.</p> <p>This fast Miltank set fits extremely well in bulkier teams with few other fast Pokemon. Its partner in crime is Stunfisk, as it can handle special attackers, especially Rotom and Skuntank, for Miltank. In return, Miltank provides Heal Bell support, helping Stunfisk combat Defoggers like Altaria, Rotom, and Articuno. It also hard walls Grass-types, which are the main counters to Stunfisk. Fighting-type checks such as Alcremie and Cramorant are also much appreciated to handle the likes of Poliwrath, Sawk, and Gurdurr. Even with Heal Bell, Miltank struggles in the long term versus Toxic, so Toxic absorbers like Klinklang, Wishiwashi, and Throh make for good partners. Wishiwashi is noteworthy, as are other Grass-weak Pokemon such as Rhydon and Basculin, because Miltank hard walls their main answers.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 226429, "username": "Jett"}, {"user_id": 484079, "username": "Corthius"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 369076, "username": "Tuthur"}]}
  },
  "Ludicolo": {"sets": [{"name": "Rain Sweeper"}]},
  "Shiftry": {
    "comments": "<h1>Other Options</h1> <p>Swords Dance variants can run Leaf Blade over Leaf Storm to have a more consistent Grass STAB move to clean, better dealing with walls such as Poliwrath and Carbink. However, Leaf Blade is worse at wallbreaking in the early- and mid-game because it lacks raw power and relies on Swords Dance.</p> <h1>Checks and Counters</h1> <p><strong>Colbur Berry: Thanks to Colbur Berry, Uxie and Cofagrigus can stomach a boosted Knock Off from Shiftry and OHKO it back with U-turn and Body Press respectively.</p> <p><strong>Dark-resistant Pokemon: Dark-resistant foes such as Silvally-Dark, Gurdurr, and Alcremie can comfortably take Shiftry's Knock Off and OHKO Shiftry with their super effective moves. However, most of these Pokemon have to watch out for Shiftry's less spammable Leaf Storm, which can heavily damage them, and are obliterated by a boosted Solar Blade.</p> <p><strong>U-turn: Shiftry's 4x weakness to Bug makes it extremely susceptible to common U-turn users such as Silvally-Dark, Liepard, and Cinccino.</p> <p><strong>Faster Attackers: While Shiftry's Sucker Punch is very powerful and able to easily clean teams after a single Swords Dance, it is not strong enough to threaten faster Pokemon when unboosted. Therefore, faster attackers such as Silvally-Poison, Articuno, and Rotom-S can force Shiftry out.</p> <p><strong>Priority Moves: While Shiftry resists Thwackey's Grassy Glide and opposing Shiftry's Sucker Punch, it takes heavy damage from other priority moves such as Kangaskhan's Fake Out, which can pick off a very weakened Shiftry in sun. Piloswine's Ice Shard and Gurdurr's Mach Punch are noteworthy, as they need significantly less chip damage to take out Shiftry.</p> ",
    "sets": [
      {
        "name": "Mixed Attacker",
        "description": "<p>Shiftry is a powerful mixed attacker and stallbreaker thanks to its amazing offensive typing letting it threaten common walls such as Uxie, Wishiwashi, and Cofagrigus. Sucker Punch lets Shiftry pick off faster attackers that have been weakened, such as Rotom, Cinccino, and Basculin. Leaf Storm acts as a powerful special nuke, heavily damaging physical walls such as Qwilfish, Gurdurr, and Cofagrigus. Swords Dance lets Shiftry act as a late-game cleaner by empowering its Sucker Punch and also lets it wallbreak more easily with Knock Off, OHKOing Altaria that have been weakened after a Swords Dance. Defog is an alternative if the team lacks a Defogger and takes advantage of Shiftry's good matchup against common entry hazard setters such as Rhydon and Uxie.</p> <p>Shiftry is a good pick for any offensive team looking for a strong wallbreaker with a great stall matchup. Qwilfish is an amazing partners that punishes U-turn with Rocky Helmet; in return, Shiftry improves the effectiveness of its Spikes by removing Heavy-Duty Boots from Pokemon like Rapidash with Knock Off. Other physical wallbreakers such as Silvally formes, Sawk, and Cinccino appreciate Shiftry weakening physical walls such as Tangela with the combination of Knock Off and Leaf Storm. Shiftry also appreciate VoltTurn support from users such as Basculin, Uxie, and Rotom, which can safely bring it onto the field. Faster threats that resist Sucker Punch, like Sawk and Alolan Persian, are able to consistently force out Shiftry; therefore, checks to them like Rotom-S and Poliwrath are appreciated.</p> "
      },
      {
        "name": "Sun Sweeper",
        "description": "<p>Shiftry is a powerhouse in sun, outspeeding the whole unboosted metagame and most Choice Scarf users. Shiftry's deadly STAB combination lets it OHKO most Pokemon it outspeeds, and it can easily break through defensive teams after a Swords Dance or Growth. Sucker Punch lets Shiftry revenge kill faster attackers when sun is not up. Sun-boosted Heat Wave lets Shiftry OHKO strong physical walls that can take its other moves, such as Shiinotic and Tangela, as well as OHKO Abomasnow.</p> <p>Shiftry is a staple on sun teams due to it raw power and lack of offensive and defensive checks under sun. Sun setters such as Uxie, Liepard, and Exeggutor make for great partners that enables Shiftry to wallbreak or sweep. The former two can even safely bring Shiftry onto the field with U-turn. Other Chlorophyll users such as Exeggutor can also take advantage of sun and form a Grass spam core with Shiftry, weakening each other's checks. Fire-types like Ninetales and Rapidash can also utilize sun to boost their STAB moves and weaken Shiftry's checks like opposing Fire-types, Piloswine, and Gurdurr.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 296755, "username": "5gen"}, {"user_id": 435539, "username": "BloodAce"}]}, {"name": "Grammar checked by", "members": [{"user_id": 449990, "username": "DC"}]}], "writtenBy": [{"user_id": 369076, "username": "Tuthur"}]}
  },
  "Sableye": {"sets": [{"name": "Physical Wall"}]},
  "Manectric": {
    "comments": "<h1>Other Options</h1> <p>Toxic is an option to cripple counters like Rhydon, Piloswine, and Appletun without getting rid of its Choice item with Switcheroo. However, Switcheroo is more consistent, as being locked on Toxic can invite threats in. Manectric can run a Heavy-Duty Boots set with Toxic over Switcheroo; however, it lacks the power of Choice Specs and Speed of Choice Scarf, making it hard to justify.</p> <h1>Checks and Counters</h1> <p><strong>Ground-types: Ground-types like Stunfisk, Rhydon, and Piloswine are immune to Manectric's STAB moves and OHKO it. However, Galarian Stunfisk have to watch out for Choice Specs-boosted Fire-type coverage, while Rhydon and Piloswine dislike getting their Eviolite removed by Switcheroo.</p> <p><strong>Special Walls: Special walls like Eldegoss and Clefairy are able to sponge Manectric's hits, and the former two can even nullify the chip damage from Volt Switch with Regenerator. Appletun, in particular, resists every move from Manectric and mitigates damage with Recover. However, they dislike losing their items to Switcheroo.</p> <p><strong>Priority Users: Due to Manectric's lackluster bulk, it gets easily removed by priority users such as Choice Band Thwackey, Kangaskhan, and Shiftry after chip damage.</p> ",
    "sets": [
      {
        "name": "Choice Scarf",
        "description": "<p>Manectric is a potent Choice Scarf user thanks to its high Speed letting it outspeed sweepers like +1 Silvally formes and Choice Scarf Sawk, great Electric + Fire coverage, and Volt Switch. Additionally, it brings a valuable Electric immunity thanks to Lightning Rod letting it absorb Volt Switch from Rotom formes. Overheat provides coverage for Electric-resistant foes like Eldegoss, Galarian Stunfisk, and Tangela. If Manectric's high Speed tier isn't needed anymore, it can use Switcheroo to cripple special walls such as Stunfisk, Clefairy, and Rhydon.</p> <p>Manectric is a great choice for VoltTurn teams looking for a revenge killer and Electric immunity. Additional VoltTurn users such as Uxie, Articuno, Wishiwashi, and Alolan Persian are appreciated. The aforementioned ones are especially great, as they can sponge hits for Manectric, making up for its lackluster bulk, and wear down Ground-types such as Rhydon, Stunfisk, and Piloswine. Physical wallbreakers like Basculin, Kangaskhan, and Sawk can take advantage of special walls that Manectric forces in and pivots against with Volt Switch. Entry hazard support from partners like Rhydon, Coalossal, and Qwilfish benefits Manectric by letting it take more advantage of Volt Switch and guaranteeing OHKOs against Tangela.</p> "
      },
      {
        "name": "Choice Specs",
        "description": "<p>Manectric is a powerful Choice Specs user thanks to its great offensive stats and Electric + Fire coverage, which let it threaten common defensive cores like Articuno + Qwilfish + Galarian Stunfisk. Choice Specs-boosted Volt Switch whittles down special walls like Clefairy, Throh, and Appletun while retaining momentum. Overheat allows Manectric to OHKO threats like Flapple and Rotom and break down Ground-types such as Galarian Stunfisk. Flamethrower is an alternative that doesn't drop Manectric's Special Attack, which makes it more spammable, but it does not break down Volt Switch switch-ins as effectively as Overheat. Switcheroo lets Manectric cripple checks like Eldegoss, Piloswine, and Rhydon, which it is unable to break through, at the cost giving up Choice Specs.</p> <p>Manectric fits at best on VoltTurn cores with partners like Basculin, Articuno, and Uxie, chipping down the opposing team through constant pivoting. Spikes support from Qwilfish or Coalossal helps this process by further weakening the foes, putting foes like Sawk and Flapple into OHKO range. Physical wallbreakers like Sawk, Thwackey, and Shiftry can take advantange of special walls and Ground-types that Manectric forces in and benefit from its ability to safely bring them in. Special cleaners like Choice Scarf Basculin, Nasty Plot Liepard, and Frosmoth enjoy Manectric weakening special walls, making it easier for them to clean late-game.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 296755, "username": "5gen"}, {"user_id": 231074, "username": "S1nn0hC0nfirm3d"}]}, {"name": "Grammar checked by", "members": [{"user_id": 449990, "username": "DC"}]}], "writtenBy": [{"user_id": 369076, "username": "Tuthur"}]}
  },
  "Altaria": {
    "comments": "<h1>Other Options</h1> <p>The combination of Fire Spin and Perish Song lets Altaria trap and take out walls such as Musharna and Pyukumuku; however, this set lacks the utility of Defog and only traps a limited number of Pokemon. Draco Meteor is Altaria's strongest move, but it is less consistent than Hurricane and Dual Wingbeat due to the Special Attack drop. Heal Bell can be used on stall teams lacking a cleric.</p> <h1>Checks and Counters</h1> <p><strong>Ice-types and Ice-type Coverage: Altaria's 4x weakness to Ice makes it extremely vulnerable to any Ice-type attacks. Altaria is threatened by Ice-types such as Abomasnow, Frosmoth, and Jynx, but it also has to watch out for Ice coverage from attackers such as Basculin and Poliwrath.</p> <p><strong>Rock-types: Rock-types such as Kabutops and Rhydon threaten Altaria with Stone Edge and can safely set up Stealth Rock versus Altaria.</p> <p><strong>Dragon-types: Due to its weakness to Dragon, powerful Dragon-type wallbreakers like Flapple and Appletun can break through Altaria with their STAB moves, even if they can't switch into Altaria's Hurricane.</p> <p><strong>Fairy-types: Fairy-types such as Clefairy and Alcremie pressure Altaria with their super effective STAB move, and they aren't pressured by Toxic thanks to Magic Guard and Aromatherapy, respectively. They can even take advantage of Altaria to set up with Calm Mind.</p> <p><strong>Setup Sweepers: While Altaria's bulk is great, it gets easily overwhelmed by strong attackers that can set up such as Silvally-Dark, Rotom-S, and Shiftry.</p> ",
    "sets": [
      {
        "name": "Physical Wall",
        "description": "<p>Altaria is a premier wall in ZU thanks to its ability to reliably answer powerful physical and special attackers such as Thwackey, Ninetales, Tangela, and Sawk. Toxic allows Altaria to put foes on a timer, letting it comfortably use Defog against entry hazard setters such as Piloswine and Miltank. Hurricane is Altaria's strongest STAB move, letting it threaten foes such as Qwilfish, Gurdurr, and Thwackey. Earthquake is an alternative that targets Toxic-immune foes such as Skuntank and Perrserker, while allowing Altaria to take on Fire-types more easily. The given EV spread allows Altaria to outspeed Adamant Perrserker and avoid the 2HKO from Choice Specs Thievul while maximizing its physical bulk.</p> <p>Altaria is an excellent pick for balance and stall teams looking for a Defogger and a check to Fire-types. Offensive Fire-types like Rapidash and Ninetales can take advantage of Altaria's checks such as Clefairy, Rhydon, and Frosmoth while benefitting from Altaria walling opposing Fire- and Water-types. These two are also checks to Ice-types, and additional checks such as Piloswine, Poliwrath, and Miltank make for great partners, handling Altaria's biggest weakness. Other walls such as Pyukumuku, Rhydon, and Wishiwashi appreciate Altaria's ability to absorb status for them; in return, they can handle threats that Altaria struggles with such as Jynx and Flapple. Choice Scarf users such as Sawk and Rotom can revenge kill the threats that can muscle through Altaria.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 445642, "username": "Apagogie"}, {"user_id": 231074, "username": "S1nn0hC0nfirm3d"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "Lumari"}]}], "writtenBy": [{"user_id": 369076, "username": "Tuthur"}]}
  },
  "Lunatone": {"sets": [{"name": "Meteor Beam"}]},
  "Cradily": {"sets": [{"name": "Swords Dance"}, {"name": "Physical Wall"}]},
  "Drifblim": {"sets": [{"name": "Terrain Sweeper"}]},
  "Skuntank": {
    "comments": "<h1>Other Options</h1> <p>Life Orb provides additional damage output, but the recoil damage limits Skuntank's longevity and makes it prone to entry hazards. Defog and Heavy-Duty Boots turn Skuntank into an offensive entry hazard remover, but this makes it inconsistent in its stallbreaking role.</p> <h1>Checks and Counters</h1> <p><strong>Ground-types</strong>: Ground-types such as Rhydon, Stunfisk, and Piloswine are able to take a boosted hit from Skuntank and OHKO it back with their STAB moves.</p> <p><strong>Faster Offensive Threats: Skuntank's mediocre Speed leaves it susceptible to faster attackers such as Rapidash, Kangskhan, and Cinccino. Special wallbreakers and pivots like Rotom and Basculin can also threaten to revenge kill Skuntank, preventing it from consistently performing its role. However, physical attackers should be wary of residual damage from Aftermath.</p> <p><strong>Special Walls: Although they do not appreciate Taunt and being poisoned by Sludge Bomb, special walls such as Wishiwashi and Type: Null are able to take boosted hits from Skuntank and pivot with U-turn, safely bringing in revenge killers to threaten it. Galarian Stunfisk is able to wear down Skuntank if it lacks Fire Blast.</p> ",
    "sets": [
      {
        "name": "Stallbreaker",
        "description": "<p>Skuntank is a great stallbreaker in ZU; its Poison / Dark typing gives it various opportunities to set up against foes such as Uxie and Tangela. While initially weak, Skuntank can pummel passive walls like Clefairy and Cofagrigus with Nasty Plot and its STAB coverage. Taunt can be used to prevent foes like Miltank and Pyukumuku from recovering HP and setup sweepers like Quiver Dance Frosmoth from setting up. Alternatively, Fire Blast helps Skuntank better break through Frosmoth and 2HKOes Galarian Stunfisk after a Nasty Plot boost.</p> <p>Skuntank fits best on offense and balance teams that appreciate its Toxic and Psychic immunities, stallbreaking, and ability to pressure Ghost-, Psychic-, and Fairy-types like Cofagrigus, Uxie, and Clefairy. Ground-types such as Rhydon, Stunfisk, and Piloswine are able to heavily pressure Skuntank; checks to them such as Basculin and Cramorant are appreciated. The aforementioned Water-types can also lure in Grass-types like Eldegoss and Tangela for Skuntank to take advantage of. Partners like Sawk and Swords Dance Silvally formes benefit from Skuntank weakening foes such as Tangela, Qwilfish, and Alcremie to clean late-game.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 231074, "username": "S1nn0hC0nfirm3d"}, {"user_id": 296755, "username": "5gen"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 499990, "username": "DC"}]}
  },
  "Spiritomb": {
    "comments": "<h1>Other Options</h1> <p>Spiritomb can run a physical wallbreaker set with Choice Band thanks to powerful moves in Poltergeist and Sucker Punch. Choice Band also pairs well with Trick, as it lets Spiritomb cripple the few Pokemon that can safely switch into Poltergeist such as Miltank and Tangela. However, Spiritomb is too slow to be a real offensive threat and being Choice-locked into Sucker Punch makes it very exploitable.</p> <h1>Checks and Counters</h1> <p><strong>Dark-types: Dark-types such as Shiftry, Skuntank, and Silvally-Dark resist Spiritomb's Dark Pulse and use it as setup fodder or, in Alolan Persian's case, beat it with the combination of Taunt + Toxic.</p> <p><strong>Wallbreakers: With no way of boosting its average physical bulk and Rest as its only form of recovery, Spiritomb gets overpowered by strong physical wallbreakers such as Flapple, Basculin, and Silvally formes. Spiritomb's special bulk is also lackluster before setting up a Calm Mind, and it can be forced out by special wallbreakers like Choice Specs Rotom and Basculin.</p> <p><strong>Alcremie: Alcremie is able to use Spiritomb as setup fodder for its Calm Mind sets and defeat it with Dazzling Gleam, while it is unable to do much in return. It should, however, be noted that mono-attacking variants of Alcremie running Stored Power get PP stalled by Spiritomb.</p> ",
    "sets": [
      {
        "name": "Calm Mind",
        "description": "<p>Spiritomb is a fearsome defensive Calm Mind sweeper that is able to find setup opportunities against some threats like Sawk locked into Close Combat, Swoobat, and Cofagrigus. Dark Pulse is the preferred STAB move, as, unlike Shadow Ball, it has no immunities. Rest is Spiritomb's most reliable recovery move and lets it get rid of status. Sleep Talk prevents Spritomb from being completely passive during Rest. Pressure lets Spiritomb PP stall defensive walls like Throh and Clefairy.</p> <p>Spiritomb fits best on stall teams where its initial passivity isn't as crippling, and its unique defensive utility and PP stalling capabilities are appreciated. On these teams, Spiritomb's teammates whittle down and remove its counters over the course of a match, so it can be used as a late-game wincon. Physical walls like Pyukumuku, Tangela, and Altaria handle powerful wallbreakers such as Basculin and Silvally formes. Special walls like Clefairy and Eldegoss are necessary to handle special wallbreakers such as Ninetales and Basculin, which can force out an unboosted Spiritomb. Some of them even provide Heal Bell support to wake up Spiritomb after it uses Rest. Checks to Dark-types like Alcremie, Mawile, and Throh are appreciated for their ability to take on foes such as Skuntank and Shiftry, which use Spiritomb as setup fodder. Checks to Alcremie such as Pyukumuku and Haze Articuno are also necessary, as it is a major threat to stall teams and can freely come in on Spiritomb.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 435539, "username": "BloodAce"}, {"user_id": 445642, "username": "Apagogie"}]}, {"name": "Grammar checked by", "members": [{"user_id": 449990, "username": "DC"}]}], "writtenBy": [{"user_id": 369076, "username": "Tuthur"}]}
  },
  "Abomasnow": {"sets": [{"name": "Choice Specs"}, {"name": "Swords Dance"}, {"name": "Aurora Veil"}]},
  "Leafeon": {
    "comments": "<h1>Other Options</h1> <p>Weather Ball targets physically defensive Grass-types like Tangela, Thwackey, and Gourgeist-S, but they already do not appreciate taking a Knock Off or Double-Edge. Synthesis provides Leafeon with sun-boosted recovery and counteracts the residual damage from Life Orb.</p> <h1>Checks and Counters</h1> <p><strong>Grass-resistant Pokemon: Pokemon such as Altaria, Gourgeist-XL, and Tangela resist Solar Blade and are able to pressure Leafeon with status. However, they dislike being crippled by Knock Off and weakened by Double-Edge.</p> <p><strong>Poison-types: Although they do not appreciate Knock Off or Double-Edge, Poison-types such as Silvally-Poison and Skuntank are able to take unboosted hits from Leafeon and retaliate with their STAB moves.</p> <p><strong>Fire-types: Fire-types such as Ninetales and Rapidash threaten Leafeon, although they must be wary of Knock Off and Double-Edge.</p> <p><strong>Residual Damage and Priority: Recoil from Life Orb and Double-Edge, as well as residual damage from entry hazards, limits Leafeon's survivability and makes it susceptible to being revenge killed by foes such as Kangaskhan and Piloswine.</p> ",
    "sets": [
      {
        "name": "Sun Sweeper",
        "description": "<p>Leafeon finds a niche on sun teams as a physical sweeper, utilizing its bulk to set up with Swords Dance and threaten foes with a Life Orb-boosted Solar Blade. Leaf Blade is a notable alternative over Solar Blade that, despite its lower damage output, provides a reliable STAB attack when sun is not up. Knock Off allows Leafeon to weaken Grass-resistant foes such as Ninetales, Tangela, and Silvally-Poison. Double-Edge gives Leafeon coverage against problematic foes like Skuntank, Altaria, and the aforementioned Ninetales and Silvally-Poison.</p> <p>Sun setters such as Uxie, Liepard, and Exeggutor are mandatory, as they enable Leafeon to outspeed the entire unboosted metagame and let it utilize Solar Blade. Leafeon can form an attacking core with other sun sweepers such as Shiftry and Ivysaur, with all weakening each other's shared checks in Pokemon such as Skuntank. Fire-types such as Ninetales and Rapidash can also take advantage of sun to boost their STAB moves and threaten foes such as Eldegoss and Tangela. Ground-types such as Piloswine and Rhydon can take advantage of Poison- and Fire-types that Leafeon invites in and use that opportunity to fire off a strong hit or set Stealth Rock; in return, they appreciate Leafeon threatening opposing Water-types like Wishiwashi and Basculin.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 435539, "username": "BloodAce"}, {"user_id": 231074, "username": "S1nn0hC0nfirm3d"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 449990, "username": "DC"}]}
  },
  "Rotom": {
    "comments": "<h1>Other Options</h1> <p>Toxic can be used over Will-O-Wisp to better cripple defensive walls like Eldegoss and Coalossal at the expense of not punishing physical attackers as hard. Discharge is an alternative to Thunderbolt on sets with Hex. Rotom can forgo Special Attack investment and run a more bulky set with maximum HP investment to better check physical Ground- and Fighting-types like Piloswine and Sawk.</p> <h1>Checks and Counters</h1> <p><strong>Dark-types: Silvally-Dark and Alolan Persian are faster than non-Choice Scarf Rotom and can revenge kill it easily. Skuntank can use Rotom as setup fodder if it has locked itself into Shadow Ball. Shiftry and Morpeko resist Rotom's STAB attacks but must be wary of switching into Will-O-Wisp or being pivoted upon, as they are quite frail.</p> <p><strong>Electric-immune Pokemon: Rhydon, Piloswine, Stunfisk, and Manectric can safely switch into Rotom's Electric-type attacks, especially if it has a Choice item. However, Rhydon and Piloswine dislike Will-O-Wisp and Trick, and all of the aforementioned Pokemon do not enjoy switching into Choice Specs Shadow Ball.</p> <p><strong>Specially Bulky Pokemon: Despite Rotom having a decent Special Attack stat, it struggles to break past Pokemon with solid special bulk, as they can take a hit and retaliate. Frosmoth can set up relatively freely on Rotom as long as it avoids Trick, while Throh can threaten Rotom immediately with Knock Off. Specially defensive walls such as Clefairy, Appletun, and Malamar are great long-term checks, as they have reliable recovery; Clefairy can also pivot into a revenge killer, while the latter two threaten Rotom immediately.</p> <p><strong>Faster Threats: Non-Choice Scarf Rotom is very susceptible to being revenge killed by Choice Scarf users such as Sawk and Basculin. Faster Pokemon such as Rapidash, Cinccino, and Gourgeist-S threaten Rotom. Pokemon with priority moves such as Thwackey and Kangaskhan can also threaten to revenge kill Rotom after some prior chip damage.</p> ",
    "sets": [
      {
        "name": "Choice Scarf",
        "description": "<p>Choice Scarf improves Rotom's revenge killing capabilities at the cost of some wallbreaking power; it outpaces foes like Cinccino, Silvally-Poison, and Choice Scarf Sawk. Volt Switch can be used to pick off weakened foes while also keeping momentum against potential switch-ins. Trick can be used once there isn't a need for Rotom's revenge killing purposes and punishes passive walls like Galarian Stunfisk and Articuno. Thunderbolt makes for a great cleaning move, as it is a stronger Electric-type STAB move that doesn't force Rotom out. Alternatively, Will-O-Wisp cripples opposing targets, namely physical Ground-types like Rhydon, Piloswine, and Galarian Stunfisk, while Defog is useful on teams that cannot fit entry hazard removal elsewhere.</p> <p>Rotom enjoys the luxury of being able to use Volt Switch as often as possible, so having a entry hazard remover such as Articuno, Altaria, or Coalossal is a good idea. Pairing Rotom with Pokemon that can deal with Ground-types like Poliwrath and Gourgeist-S is also recommended to achieve this goal. Rotom also benefits greatly from entry hazard support, as it wants to use Volt Switch often to force out common Pokemon like Qwilfish and Articuno and wear down common switch-ins such as Throh and Audino. Good examples of entry hazard setters include Miltank, Qwilfish, and Rhydon. Physically offensive threats such as Sawk, Rapidash, and Silvally-Dark benefit from Rotom's ability to bring them in safely after forcing out their checks. Rotom is great on VoltTurn cores and works well with other pivots such as Articuno, Wishiwashi, and Thwackey.</p> "
      },
      {
        "name": "Utility",
        "description": "<p>With great status moves and Volt Switch, Rotom is a great offensive pivot that offers solid utility. Defog is great on teams that need entry hazard control, while Pain Split provides Rotom with a form of recovery. Will-O-Wisp cripples physical attackers and Ground-types such as Rhydon, Kangaskhan, Thwackey, and Piloswine, and it also boosts the power of Hex. Colbur Berry prevents Rotom from being KOed by Sawk's Knock Off, which gives Rotom a chance to cripple it with a burn, while Heavy-Duty Boots allows Rotom to avoid taking Stealth Rock damage when pivoting. Sitrus Berry can be used for more general increased longevity and is preferred over Leftovers due to the constant pivoting.</p> <p>Rotom is best used on bulky offense and balance teams that benefit from its ability to disrupt opposing teams and offer support with Defog. Pokemon such as Kangaskhan, Thwackey, and Sawk that appreciate Rotom's ability to bring them in safely; and in return, they can make up for Rotom's lack of immediate power, as it is reliant on spreading burns in order to maximize its power. Offensive threats such as Rapidash, Ninetales, and Skuntank appreciate Rotom's ability to lure in Ground-types and cripple them with burns. Rapidash and Ninetales also benefit from Defog and Rotom forcing out Water-types like Wishiwashi and Cramorant. Skuntank helps Rotom by checking faster Ghost-types such as Gourgeist-S and Choice Scarf Rotom and Dark-types like Shiftry and Thievul. Other status inducers like Thunder Wave Qwilfish and Toxic Rapidash pair well with Hex.</p> "
      },
      {
        "name": "Choice Specs",
        "description": "<p>Rotom is one of the most threatening special attackers in ZU due to the lack of Pokemon that resist its STAB combination. Choice Specs further facilitates Rotom's wallbreaking power by letting it nab 2HKOs on most walls, while its solid Speed allows it to revenge kill a weakened Skuntank or Rotom-S. Volt Switch lets Rotom gain momentum on Water- and Flying-types and get out of bad matchups against threats such as Eldegoss and Appletun. Trick can be used not only to immediately cripple the aforementioned specially defensive walls but also to punish Ground-types that may attempt to block its Volt Switch attempts, such as Stunfisk and Piloswine.</p> <p>Rotom is susceptible to being revenge killed by faster Dark-types like Alolan Persian and Silvally-Dark if it is locked into Shadow Ball; therefore, it is imperative that you pair Rotom with Fighting- or Fairy-types such as Sawk, Gurdurr, Alcremie, and Clefairy. The aforementioned Fighting-types also benefit from Rotom's ability to break past physical walls such as Tangela and Uxie and can deal with Normal-types like Kangaskhan and Miltank so Rotom can use Shadow Ball more freely. Pivots such as Wishiwashi and Silvally formes make for great partners, as they can bring Rotom in safely and form a solid VoltTurn core. Tangela and Appletun can switch into Ground-types like Stunfisk and Rhydon should Rotom lock into an Electric-type move.</p> "
      },
      {
        "name": "Nasty Plot",
        "description": "<p>Nasty Plot Rotom is a great wallbreaker on offensive teams. With a single boost, Rotom OHKOes physical walls such as Tangela and Poliwrath and has a chance to 2HKO specially defensive walls such as Wishiwashi and Articuno. Substitute lets Rotom block status attempts from Altaria and Miltank and set up on them freely.</p> <p>Thwackey can lure in Flying-types and bring in Rotom safely so it can freely set up with Nasty Plot. In return, Rotom can break past physical walls such as Tangela, Poliwrath, and Altaria, which Thwackey struggles with. Late-game cleaners such Alcremie and Quiver Dance Frosmoth benefit greatly from Rotom's ability to weaken special walls such as Galarian Stunfisk and Articuno. Teleport Clefairy and physically defensive Wishiwashi are great defensive pivots that can absorb Dark-type attacks from revenge killers like Silvally-Dark and Choice Scarf Sawk. Rotom also appreciates having Knock Off users like Shiftry and Alolan Persian to weaken special walls such as Throh and Clefairy.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 369076, "username": "Tuthur"}, {"user_id": 231074, "username": "S1nn0hC0nfirm3d"}]}, {"name": "Grammar checked by", "members": [{"user_id": 449990, "username": "DC"}]}], "writtenBy": [{"user_id": 226429, "username": "Jett"}]}
  },
  "Rotom-Fan": {
    "comments": "<h1>Other Options</h1> <p>Thunder Wave and Toxic are valid replacements for Will-O-Wisp, but the former is punished by switching into Ground-types, which already don’t fear Rotom-S's other moves, and the latter allows switch-ins such as Galarian Stunfisk to come in more easily. Discharge can used as Rotom-S's Electric-type STAB move to paralyze offensive switch-ins but leaves it worse off versus bulkier Pokemon. Rotom-S can be a team's Choice Scarf user, but its weakness to Stealth Rock, vulnerability to common priority moves such as Ice Shard, and direct competition with Rotom make it suboptimal for that role.</p> <h1>Checks and Counters</h1> <p><strong>Bulky Ground-types: Ground-types such as Piloswine, Galarian Stunfisk, and Rhydon block Rotom-S's Volt Switch and Thunderbolt and take little from Air Slash. All of them, however, don’t appreciate taking a Will-O-Wisp on the switch.</p> <p><strong>Revenge Killers: Faster attackers with moves to hit Rotom-S hard such as Cinccino and Silvally formes are able to pressure it out with ease.</p> <p><strong>Toxic: Taking Toxic from users such as Altaria, Alolan Persian, and Miltank cripples Rotom-S due to its unreliable recovery.</p> <p><strong>Knock Off: Knock Off users like Sawk, Thwackey, and Gurdurr are difficult for Rotom-S to consistently switch into. Entry hazard setters with access to Knock Off such as Uxie and Clefairy also make it hard for Rotom-S to consistently remove entry hazards throughout a game.</p> ",
    "sets": [
      {
        "name": "Defog",
        "description": "<p>Rotom-S is one of the premier entry hazard removers in the metagame due to its ability to pivot with Volt Switch and excellent defensive typing that lets it wall and threaten common Pokemon such as Qwilfish and Sawk. Will-O-Wisp allows Rotom-S to cripple physical attackers such as Kangaskhan, Silvally formes, and Rhydon on the switch, while Pain Split gives greater but unreliable longevity. 252 Speed EVs let Rotom-S outspeed relevant Pokemon such as Cramorant, Qwilfish, and Choice Band Sawk. Investing in Special Attack over HP to pressure common walls like Altaria, Cofagrigus, and Piloswine is also viable.</p> <p>Rotom-S fits on balance and offense teams as an entry hazard remover and pivot. Common VoltTurn teammates like Silvally-Dark, Wishiwashi, and Uxie can form a pivot core with Rotom-S to safely bring in wallbreakers such as Frosmoth and Shiftry. Toxic cripples Rotom-S, so Toxic-immune partners such as Qwilfish and Clefairy are greatly appreciated; Rotom-S in turn provides them with a switch-in to Ground-type attacks. Knock Off hinders Rotom-S's ability to remove entry hazards, so Knock Off absorbers such as Silvally formes, Qwilfish, and Skuntank help immensely. Rotom-S is unable to deal with hard-hitting wallbreakers such as Kangaskhan, Silvally formes, and Rapidash, so strong revenge killers such as Cinccino, Alolan Persian, and Choice Scarf Sawk are all great teammates.</p> "
      },
      {
        "name": "Nasty Plot",
        "description": "<p>Rotom-S's decent Speed along with an excellent offensive typing give it a niche as a stallbreaker and cleaner with Nasty Plot. Substitute allows Rotom-S to avoid crippling status from passive Pokemon such as Clefairy and Altaria, which, in conjunction with its STAB Thunderbolt, lets it beat the only Unaware user in the tier in Pyukumuku. Pain Split, on the other hand, gives Rotom-S more longevity against weak attackers without status such as Cofagrigus, Galarian Stunfisk, and Uxie.</p> <p>Rotom-S is fits on offensive teams for its stallbreaking and cleaning capabilities. Teammates such as Silvally formes, Kangaskhan, and Basculin appreciate Rotom-S dealing with bulky Pokemon such as Pyukumuku, Tangela, and Altaria. Faster offensive Pokemon such as Kangaskhan, Rapidash, and Silvally formes are able to threaten Rotom-S, so switch-ins such as Cofagrigus, Piloswine, and Galarian Stunfisk and fast attackers like Alolan Persian, Basculin, and Choice Scarf Sawk are vital for it. Ground-type Pokemon such as Piloswine and Rhydon are able to stomach an unboosted attack from Rotom-S, so switch-ins such as Wishiwashi, Tangela, and Miltank are appreciated.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 231074, "username": "S1nn0hC0nfirm3d"}, {"user_id": 369076, "username": "Tuthur"}]}, {"name": "Grammar checked by", "members": [{"user_id": 449990, "username": "DC"}, {"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 494585, "username": "JonAmon 25"}]}
  },
  "Uxie": {
    "comments": "<h1>Other Options</h1> <p>Uxie can run a specially defensive spread on its defensive set to better handle special attackers such as Ninetales and Manectric at the expense of switching into Sawk, Rhydon, and Gurdurr. Leftovers is an alternative to Colbur Berry on Uxie's defensive set, providing reliable recovery and improving its longevity. However, this makes Uxie vulnerable to Knock Off. Thunder Wave is a viable alternative to Knock Off that cripples faster attackers such as Thievul, Cinccino, and Silvally formes, letting Uxie's teammates take them on more easily. Defensive Uxie can also run Choice Scarf with Trick and 64 Speed EVs, letting it outspeed up to Cinccino and Alolan Persian and cripple a potential entry hazard remover like Articuno or Coalossal. However, Uxie can get a crippling item like Skuntank's Black Sludge or Rotom's Choice Specs, or even become setup fodder for Silvally formes due to their Trick immunity. Memento is an alternative for the defensive pivot set, blocking Defog and bringing in a teammate more safely than U-turn, but Uxie often can't fit it. Encore can be used to punish Pokemon that otherwise freely set up on Uxie like Galarian Rapidash and Ninetales.</p> <h1>Checks and Counters</h1> <p><strong>Ghost-types: Uxie is threatened by attackers such as Rotom and Gourgeist-S. However, most of them take great damage from Knock Off and STAB moves, meaning Uxie can pressure them on the switch.</p> <p><strong>Dark-types: Dark-types such as Thievul, Silvally-Dark, and Skuntank threaten Uxie with their super effective STAB moves, block Future Sight, and can sponge boosted Draining Kiss. However, most take heavy damage from U-turn, and Colbur Berry Uxie can afford to take a hit.</p> <p><strong>Bulky Setup Sweepers: Defensive sweepers such as Alcremie and Spiritomb easily set up on the weak Uxie. This also includes Substitute users such as Frosmoth. Most of them can also beat Uxie in a setup war.</p> <p><strong>Wallbreakers and Stallbreakers: Wallbreakers such as Thwackey and Basculin can use Uxie's passivity to threaten its whole team with their powerful moves. However, they dislike losing Choice Band or Choice Specs to Knock Off. Faster Taunt users such as Alolan Persian can shut down Uxie's utility and take advantage of it with Toxic.</p> <p><strong>Steel-types: Setup Uxie sets have a very hard time breaking through Steel-types such as Perrserker and Klinklang due to its low damage output. They can easily break Uxie's Substitute and remove Uxie before it is boosted enough.</p> <p><strong>Haze Articuno and Pyukumuku: Haze Articuno and Unaware Pyukumuku can wall most setup Uxie. However, Pyukumuku has to be wary of Stored Power's increased Base Power.</p> ",
    "sets": [
      {
        "name": "Nasty Plot",
        "description": "<p>Uxie can act as a terrifying late-game cleaner with its Nasty Plot set. Substitute lets it avoid status such as Toxic from Articuno and Altaria, dodge Knock Off from Tangela and Clefairy, and sponge hits from weak attackers like Eldegoss, Clefairy lacking Seismic Toss, and Stunfisk. Psyshock is preferred over Psychic as a STAB move to get around special walls like Articuno and Clefairy more easily. Draining Kiss lets Uxie break through Dark-types like Thievul and Morpeko after a boost and provides coveted recovery.</p> <p>Uxie is a great late-game cleaner for bulkier teams that can weaken its checks over time. Therefore, entry hazard support, especially Spikes from setters such as Coalossal and Qwilfish, is invaluable. Knock Off support is similarly valuable for removing Heavy-Duty Boots and Leftovers, the latter being the only form of recovery of Steel-types that check Uxie like Klinklang and Perrserker. Toxic users such as Altaria and Rapidash cripple the likes of Haze Articuno, Alcremie, and Musharna to help Uxie break through them. Uxie can also fit well with other defensive sweepers like Spiritomb and Alcremie, weakening each other’s checks and forcing Trick uses to ensure one of them can sweep.</p> "
      },
      {
        "name": "Defensive Pivot",
        "description": "<p>Uxie is a premier defensive pivot in VoltTurn teams due to its incredible role compression as the only viable Pokemon with both U-turn and Stealth Rock. Additionally, Uxie's incredible bulk lets it reliably check threats like Sawk and Silvally-Poison. Levitate also helps in that regard, avoiding chip damage from Spikes and giving it switch-in opportunities on Rhydon and Piloswine. Yawn allows Uxie to avoid being setup fodder and force out entry hazard removers like Altaria, Articuno, and Coalossal and therefore keep Stealth Rock up. Knock Off lets Uxie remove important items like Heavy-Duty Boots from Articuno, Cramorant, and Altaria and Eviolite from Piloswine, Rhydon, and Tangela. Future Sight lets Uxie's partners threaten their checks with the extra, delayed damage. Colbur Berry allows Uxie to counter Fighting-types such as Sawk and Gurdurr by weakening their Knock Off; it also lets Uxie take a hit from strong Dark-type wallbreakers such as Thievul, Silvally-Dark, and Shiftry and pivot out with a super effective U-turn.</p> <p>Uxie can form a VoltTurn core with other pivots such as Alolan Persian, Rotom, and Wishiwashi. Such cores are beneficial to wallbreakers that prefer safe switches like Silvally formes, Thievul, and Sawk. Dark-types like Silvally-Dark and Skuntank value Uxie's ability to wall Fighting-types like Sawk and can, in return, threaten Ghost-types like Gourgeist-S and Rotom. Physical wallbreakers like Kangaskhan and Silvally formes appreciate Future Sight threatening physical walls such as Miltank, Qwilfish, and Tangela. Uxie lacks recovery and gets quickly worn down by Toxic; other walls like Clefairy, Wishiwashi, and Qwilfish can absorb status and take attacks that Uxie can't afford to take. Clefairy also has Aromatherapy to cure Uxie of any status. Pokemon like Poliwrath and Jynx pressure hazard removers like Coalossal, Articuno, and Altaria, helping keep up Uxie's Stealth Rock.</p> "
      },
      {"name": "Calm Mind", "description": "<p>Uxie finds a spot in Electric Terrain teams as a Calm Mind sweeper. Stored Power has insane power after Calm Mind and Electric Seed, letting Uxie break through bulkier foes like Articuno and Pyukumuku. Draining Kiss lets Uxie threaten Dark-types like Thievul and Silvally-Dark. Rest is Uxie's best form of recovery, also letting it deal with status from special walls like Articuno lacking Haze and Clefairy. The given spread allows Uxie to outspeed Timid Exeggutor.</p> <p>Pincurchin is a necessary partner for Electric Surge. Other Electric Seed sweepers like Musharna, Swoobat, Drifblim, and Galarian Rapidash can weaken shared checks, forming a Calm Mind spam core. Electric-types like Raichu and Manectric also appreciate Electric Terrain and can break through special walls, making it easier for Uxie and the other Calm Mind users. In return, Uxie can set up on Ground-types that wall Raichu and Manectric thanks to Levitate.</p> "},
      {"name": "Offense Lead", "description": "<p>Uxie's great Speed and amazing bulk make it a great supporter for offensive teams, being able to set Stealth Rock and then cripple the opposing Pokemon with Memento, Encore, or Yawn, giving switching and setup opportunities to teammates. Since this set isn't running any offensive move, Mental Herb is the preferred item to not get completely invalidated by Taunt users like Skuntank, Golbat, and Alolan Persian.</p> <p>Setup spam offense teams really enjoy Uxie's role compression, creating setup opportunities and providing Stealth Rock. Therefore, offensive setup users like Crustle, Frosmoth, and Silvally formes make for great partners. Pokemon that can advantage of Taunt users that Uxie invites in, such as Alcremie, Double Dance Rhydon, and Rotom-S, are appreciated. Gourgeist-S can prevent Rapid Spin attempts, while Taunt users like Skuntank and Qwilfish deny Defog.</p> "},
      {"name": "Sun Setter", "description": "<p>Thanks to its great bulk and higher Speed than common Taunt users such as Skuntank, Qwilfish, and Sawk, Uxie is capable of reliably setting sun and Stealth Rock several times. U-turn brings sun attackers safely onto the field. Yawn forces out foes that would attempt to set up on Uxie such as Skuntank and Ninetales, which works well with Uxie's fast U-turn. Memento can alternatively be used to provide similar opportunities to Yawn and U-turn in one turn at the cost of sacrificing Uxie.</p> <p>Sun sweepers such as Shiftry, Leafeon, Ivysaur, and Rapidash love Uxie's ability to reliably set sun. Prankster Liepard is a reliable secondary weather setter to support the team. An offensive sun setter such as Exeggutor creates more opportunities to set it up.</p> "},
      {"name": "Trick Room Lead"}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 226429, "username": "Jett"}, {"user_id": 231074, "username": "Ho3nConfirm3d"}]}, {"name": "Grammar checked by", "members": [{"user_id": 331519, "username": "CryoGyro"}]}], "writtenBy": [{"user_id": 369076, "username": "Tuthur"}]}
  },
  "Liepard": {
    "comments": "<h1>Other Options</h1> <p>Liepard has other useful support options like Taunt and Thunder Wave; however, it lacks room for them.</p> <h1>Checks and Counters</h1> <p><strong>Fighting- and Fairy-types</strong>: Sawk, Poliwrath, and Alcremie take little from Liepard's moves and OHKO it back with their STAB moves. Gurdurr easily tanks Dark Pulse and OHKOes Liepard after slight chip damage.</p> <p><strong>Special Walls: Nasty Plot sets need several boosts to break through special walls such as Articuno and Wishiwashi, which can stall Liepard with Toxic or outright 2HKO it with their attacks.</p> <p><strong>Dark-types: Dark-types like Shiftry, Silvally-Dark, and Skuntank are immune to Prankster, resist Liepard's STAB moves, and defeat it with their secondary STAB or coverage moves. However, they have to watch out for U-turn.</p> <p><strong>Strong Attackers: Because of its poor bulk, Liepard gets OHKOed by strong attackers like Kangaskhan, Silvally formes, and Basculin. Liepard is forced out by them unless it manages to lock them into unfavorable moves with Encore.</p> ",
    "sets": [
      {"name": "Sun Setter", "description": "<p>The combination of Prankster and Sunny Day lets Liepard act as an excellent mid-game sun setter. U-turn lets it pivot into a teammate that benefits from sun, such as Shiftry and Ivysaur. Knock Off helps Liepard further support its teammates by removing Heavy-Duty Boots from Articuno and Altaria. Encore locks foes such as Silvally-Poison and Uxie into unfavorable moves like Work Up and Stealth Rock, giving Liepard free turns to set up sun and pivot with U-turn. Heat Rock is necessary to provide as many sun turns as possible to Liepard's partners.</p> <p>Liepard is a must-have on sun teams and is appreciated by sun sweepers such as Shiftry, Ivysaur, and Rapidash. Uxie's sun setter set also fits well on sun teams for its capacity to reliably set Stealth Rock and sun for its team. Furthermore, a third sun setter such as Exeggutor provides more possibilities to set up sun.</p> "},
      {
        "name": "Nasty Plot",
        "description": "<p>Thanks to its high Speed tier and access to Nasty Plot and a pseudo-priority move in Prankster Copycat, Liepard separates itself from other Nasty Plot sweepers such as Skuntank and Alolan Persian. Copycat is mainly used to call Dark Pulse and prevent faster foes like Cinccino, Choice Scarf Rotom, and Basculin from revenge killing a Nasty Plot-boosted Liepard. Encore provides Liepard setup opportunities by locking foes such as Piloswine and Articuno into undesirable moves. Heavy-Duty Boots are preferred on VoltTurn teams to help Liepard avoid entry hazards and potentially pivot. Black Glasses are an alternative that makes up for Liepard's average Special Attack, making it require less chip damage to clean.</p> <p>VoltTurn support from pivots such as Uxie, Articuno, and Rotom helps Liepard come on the field in spite of its lackluster bulk. Special wallbreakers such as Ninetales, Rotom, and Basculin can soften opposing special walls in order to let Liepard clean late game. Checks to Fighting-types such as Uxie, Qwilfish, and Rotom-S take on Sawk and Gurdurr, which force Liepard out. Likewise, checks to Fairy-types like Klinklang, Silvally-Poison, and Rapidash are great partners that handle Alcremie and Clefairy. Checks to Dark-types such as Alcremie, Gurdurr, and Sawk are also appreciated, as Silvally-Dark and Skuntank can take on Liepard. Kangaskhan is a threat because of Fake Out outprioritizing Copycat, letting it easily revenge kill a weakened Liepard; therefore, checks like Uxie, Tangela, and Cofagrigus are appreciated.</p> "
      },
      {"name": "Physical Attacker"}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 296755, "username": "5gen"}, {"user_id": 435539, "username": "BloodAce"}]}, {"name": "Grammar checked by", "members": [{"user_id": 449990, "username": "DC"}]}], "writtenBy": [{"user_id": 369076, "username": "Tuthur"}]}
  },
  "Musharna": {"sets": [{"name": "Physical Wall"}, {"name": "Calm Mind"}]},
  "Unfezant": {
    "comments": "<h1>Other Options</h1> <p>A utility set with Heavy-Duty Boots, Roost, and Defog is feasible, as this set gives Unfezant reliable recovery and allows it to be an offensive entry hazard remover. However, the listed sets more naturally play to Unfezant's strengths, and this set struggles even more against hazard setters like Coalossal, Rhydon, and Qwilfish due to its reliance on Heavy-Duty Boots.</p> <h1>Checks and Counters</h1> <p><strong>Rock- and Steel-types: Rhydon, Coalossal, Perrserker, and Klinklang resist Unfezant's STAB moves, fear none of its coverage, and threaten OHKOs or significant damage with their STAB moves. Rhydon and Coalossal can also set or remove entry hazards, and Coalossal's Flame Body deters Unfezant from pivoting or attacking. However, Perrserker and Klinklang can be worn down by the Choice Band set and fail to reliably switch in later on.</p> <p><strong>Stealth Rock: Unfezant’s weakness to Stealth Rock and recoil from Brave Bird quickly wear it down, causing it to faint rather quickly.</p> <p><strong>Electric-types</strong>: Electric-types like Rotom formes and Stunfisk can stomach a hit from both Unfezant sets and threaten to OHKO in return with their super effective STAB moves. Stunfisk also has Static to discourage Unfezant from pivoting with U-turn. However, Rotom must be aware of Night Slash from the Choice Band set.</p> <p><strong>Faster Offensive Threats: While none of them can safely switch in, Pokemon like Jynx, Rapidash, and Choice Scarf Sawk and Rotom can KO Choice Band Unfezant with minimal to no prior chip damage due to its mediocre bulk. However, they must also be aware of Choice Scarf sets, which they can't check.</p> ",
    "sets": [
      {
        "name": "Choice Band",
        "description": "<p>Unfezant is a powerful wallbreaker, able to devastate teams without sturdy Flying-resistant Pokemon such as Rhydon or Coalossal with Choice Band-boosted STAB Brave Bird. U-turn enables Unfezant to pivot out against Stunfisk, Piloswine, and Klinklang, keeping momentum and chipping them. Quick Attack finishes off weakened faster foes like Cinccino and Basculin. Night Slash lets Unfezant OHKO Rotom. Facade instead becomes a very powerful STAB move if Unfezant gets statused. Super Luck gives it better chances to break through Double Dance Alcremie if the latter has gained a Defense boost prior.</p> <p>Unfezant fits well in offensive teams due to its great power, good Speed tier, and mediocre bulk. It struggles to break past sturdy Flying-resistant Pokemon like Klinklang and Coalossal and could potentially lose momentum against them. Water- and Electric-types pair particularly well, as Pokemon like Wishiwashi, Basculin, and Raichu can force them out with their STAB or coverage moves and bring Unfezant in safely with their pivot moves. In return, Unfezant can form a VoltTurn core with them and force out Grass-types such as Eldegoss, Tangela, and Gourgeist-S, which pressure them. Spikes users, such as Qwilfish and Coalossal, wear down its checks, many of which lack reliable recovery. Entry hazard control from the likes of Eldegoss, Rotom, and Hattrem can ameliorate its Stealth Rock weakness. Hattrem in particular synergizes well, as it can threaten Rhydon and Stunfisk with Giga Drain. Special wallbreakers like Rotom, Basculin, and Jynx can overwhelm physical walls like Rhydon, Pyukumuku, and Miltank that Unfezant has difficulty breaking through. Other Flying-type wallbreakers, like Silvally-Flying and Rotom-S, can overwhelm their checks with repeated STAB Flying-type moves and coverage options.</p> "
      },
      {"name": "Choice Scarf"}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 369076, "username": "Tuthur"}, {"user_id": 226429, "username": "Jett"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 543866, "username": "5Dots"}]}
  },
  "Swoobat": {"sets": [{"name": "Terrain Sweeper"}]},
  "Gurdurr": {
    "comments": "<h1>Other Options</h1> <p>Defog is an option to turn Gurdurr into an entry hazard remover that poses good matchups against common entry hazard setters like Piloswine and Rhydon, but it generally has difficulty fitting the move. Stone Edge targets foes like Frosmoth, Rotom-S, and Articuno.</p> <h1>Checks and Counters</h1> <p><strong>Flying-types: Although they do not appreciate Knock Off removing their Heavy-Duty Boots, Flying-types such as Rotom-S, Altaria, and Cramorant can threaten to KO Gurdurr.</p> <p><strong>Physical Walls: Physical walls such as Altaria and Tangela are able to take hits from Gurdurr and pressure it with their STAB attacks. However, they should be wary of Knock Off. Alcremie is a notable foe that is able to take Gurdurr's STAB options and Knock Off and pressure it with its Fairy-type moves.</p> <p><strong>Chip Damage and Knock Off: It is easy to cripple and wear down Gurdurr, as it is reliant on Drain Punch recovery and Eviolite to check its foes.</p> ",
    "sets": [
      {
        "name": "Bulk Up",
        "description": "<p>Gurdurr is a notable tank in ZU thanks to its good bulk and access to decent recovery through Drain Punch. This recovery lets Gurdurr more consistently set up, letting it accumulate multiple boosts. Gurdurr can utilize Bulk Up mid- or late-game against passive foes like Stunfisk and Eldegoss. Knock Off cripples switch-ins such as Tangela, Altaria, and Rotom-S. Mach Punch allows Gurdurr to revenge kill foes such as Shiftry and Cinccino. 252 HP and 60 Defense EVs ensure that Gurdurr will only be 3HKOed by Kangaskhan's Double-Edge, while 252 HP and 60 Special Defense EVs allow it to live Choice Specs Hydro Pump from Basculin after Stealth Rock damage. Guts lets Gurdurr absorb Will-O-Wisp from Rapidash and Toxic from Pyukumuku to empower its attacks.</p> <p>Gurdurr fits on both bulky offense and balance teams due to its solid bulk and ability to generate pressure with both Bulk Up and Mach Punch. Gurdurr appreciates strong offensive support from its teammates to keep initiative throughout the battle, as it is otherwise prone to being worn down by common VoltTurn cores. Wallbreakers such as Rapidash, Silvally formes, and Thievul can threaten physical walls such as Tangela, Gourgeist-XL, and Qwilfish, enabling Gurdurr to better threaten them late-game. Pokemon such as Rotom and Frosmoth benefit from Gurdurr revenge killing foes such as Silvally-Dark and Shiftry with Mach Punch; in return, they can threaten Flying-types such as Rotom-S and Cramorant that trouble it.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 369076, "username": "Tuthur"}, {"user_id": 240237, "username": "kay"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 449990, "username": "DC"}]}
  },
  "Throh": {
    "comments": "<h1>Other Options</h1> <p>Throh can run a wallbreaker set with Flame Orb and Facade; however, it lacks a spammable powerful STAB move, since it is limited to Superpower and Storm Throw. Additionally, Sawk and Silvally-Fighting are usually preferred for their higher Speed tiers and better wallbreaking capabilities. Throh can also attempt to use a Bulk Up set with either Mold Breaker or Guts, with the former giving it the ability to ignore Pyukumuku's Unaware; however, Gurdurr is better at this role due to having Drain Punch for recovery and Mach Punch for priority. A physically defensive set is more effective at checking the likes of Silvally formes, Sawk, and Kangaskhan, but Throh struggles to absorb status without a specially defensive spread.</p> <h1>Checks and Counters</h1> <p><strong>Ghost-types: Pokemon like Spiritomb, Rotom, and Gourgeist-XL are immune to Throh's STAB moves and can sponge Knock Off. Spiritomb can set up on Throh, while Rotom and Gourgeist-XL annoy it with status. However, Rotom should be careful switching into Knock Off.</p> <p><strong>Flying-types: Flying-types like Altaria, Rotom-S, and Cramorant resist Throh's STAB moves and can retaliate back with their super effective STAB moves. However, they despise losing their valuable Heavy-Duty Boots to Knock Off.</p> <p><strong>Fairy-types: Fairy-types like Alcremie, Galarian Rapidash, and Shiinotic resist Throh's moves and can threaten it with their super effective STAB moves. Although Clefairy cannot break through Throh, it can cripple Throh with Knock Off or pivot with Teleport into a check.</p> <p><strong>Physical Wallbreakers: Even if Throh's physical bulk is far from lacking, its reliance on Rest lets it often get overwhelmed by physical wallbreakers like Cinccino, Silvally formes, and Sawk.</p> <p><strong>Psychic-types: Psychic-types like Uxie, Swoobat, and Musharna resist Throh's STAB moves, don't take much from Knock Off, and threaten it with their STAB moves or Future Sight. Jynx can also break past Throh, but it cannot safely switch into Throh's attacks.</p> ",
    "sets": [
      {
        "name": "Special Wall",
        "description": "<p>Throh is a very bulky special wall that works especially well on Spikes-stacking teams. Circle Throw lets it phaze switch-ins, which pairs well with entry hazard support. Knock Off cripples checks like Altaria, Alcremie, and Tangela, hits Ghost-types like Rotom and Gourgeist-S, and removes Heavy-Duty Boots, which is appreciated on entry hazard-stacking teams. Rest is Throh's only form of recovery; thanks to Sleep Talk and Guts, Throh acts as a status absorber and lacks passivity while asleep. The given EV spread ets Throh outspeed uninvested base 50 Speed Pokemon such as Piloswine.</p> <p>Throh appreciates entry hazard support a lot, especially Spikes from setters such as Qwilfish and Coalossal. Spinblockers like Rotom and Gourgeist formes and fast Taunt users like Alolan Persian, Golbat, and Qwilfish can keep up these entry hazards. Rapid Spin users such as Eldegoss and Alolan Sandslash also make for great partners. Additionally, most of them help handle physical attackers Throh struggles to beat such as Sawk and Silvally-Poison. Despite being a good special wall, Throh appreciates being paired with Pokemon that can handle Volt Switch like Eldegoss, Stunfisk, and Manectric; they prevent it from getting chipped by Electric-types like Rotom, Manectric, and Raichu and losing momentum.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 231074, "username": "S1nn0hC0nfirm3d"}, {"user_id": 226429, "username": "Jett"}]}, {"name": "Grammar checked by", "members": [{"user_id": 449990, "username": "DC"}]}], "writtenBy": [{"user_id": 369076, "username": "Tuthur"}]}
  },
  "Sawk": {
    "comments": "<h1>Other Options</h1> <p>Poison Jab lets Sawk 2HKO Alcremie and Clefairy, but this requires giving up one of its other coverage moves, which generally isn't preferred because they target more Pokemon.</p> <h1>Checks and Counters</h1> <p><strong>Ghost-types: Spiritomb, Gourgeist-Super, and Sableye can switch into any of Sawk's attacks with ease. The former can also set up on Sawk with Calm Mind.</p> <p><strong>Physical Walls: Tangela, Uxie, and Altaria can switch into Sawk and either cripple it with their status moves or deal significant damage with their STAB moves. Tangela and Altaria must be careful of switching into Knock Off and Stone Edge, respectively, as Choice Band Sawk can 2HKO Tangela if it has lost its Eviolite and can KO Altaria with some prior chip damage. While Qwilfish must be wary of switching into Earthquake, it can easily switch into Close Combat and wear Sawk down with Rocky Helmet.</p> <p><strong>Faster Threats: Faster attackers such as Rotom, Basculin, and Cinccino can revenge kill Sawk if it has been slightly worn down. However, none of them can afford to risk directly switching into one of Sawk's attacks.</p> ",
    "sets": [
      {
        "name": "Choice Scarf",
        "description": "<p>With a solid Speed tier and its incredibly high attacking power, Sawk makes for an excellent revenge killer that fits well on offense and balance teams. Choice Scarf allows Sawk to threaten foes such as Alolan Persian, Kangaskhan, and non-Choice Scarf Cinccino. Knock Off targets Ghost- and Psychic-types such as Rotom, Gourgeist-S, and Uxie while also crippling common switch-ins such as Alcremie, Clefairy, and Tangela. Earthquake hits Poison-types such as Silvally-Poison, Qwilfish, and Skuntank. Stone Edge lets Sawk deal with Flying-types such as Rotom-S, Altaria, and Golbat. Mold Breaker allows Sawk to hit Levitate users such as Uxie and Rotom with Earthquake. Alternatively, Inner Focus allows Sawk to beat Qwilfish with Earthquake, as Inner Focus nullifies its Intimidate, and not flinch from Kangaskhan's Fake Out. However, don't expect to get free turns from Kangaskhan trying to flinch you, as the opponent should notice the absent Mold Breaker activation message.</p> <p>While Sawk has super effective coverage for Pokemon that resist or are immune to Close Combat, it still needs physical walls such as Uxie, Tangela, and Altaria to be weakened in order to KO them and successfully clean. Therefore, special attackers such as Skuntank, Rotom, and Basculin that can deal with them make for great partners. Entry hazard setters such as Rhydon, Piloswine, and Qwilfish help to wear down Sawk's common switch-ins, as most do not have access to reliable recovery. Pivots such as Uxie, Rotom-S, and Wishiwashi circumvent Sawk's mediocre bulk by safely bringing it onto the field, with the former also having access to Future Sight, which dissuades Poison-types from switching in.</p> "
      },
      {
        "name": "Choice Band",
        "description": "<p>Choice Band Sawk forgoes Choice Scarf's increase in Speed for more wallbreaking power, letting Close Combat net 2HKOs on neutral physical walls like Pyukumuku and Gurdurr. Knock Off pressures Ghost- and Psychic-types like Rotom and Uxie while also crippling common switch-ins such as Tangela; Close Combat threatens a 2HKO on Tangela once its Eviolite has been removed. Earthquake punishes Poison-types like Qwilfish and Silvally-Poison, while Stone Edge nails Flying-types such as Rotom-S and Altaria.</p> <p>Choice Band Sawk is vulnerable to being revenge killed by faster Flying- and Psychic-types such as Rotom-S and Jynx, so switch-ins such as Rhydon and Articuno are appreciated. These Pokemon also have the added benefit of providing entry hazards to help wear down its switch-ins. Special setup sweepers such as Frosmoth and Alcremie benefit greatly from Sawk's ability to break past specially defensive walls such as Coalossal. Sawk also appreciates the removal of Ghost-types, so pairing it with Dark-types like Skuntank, Shiftry, and Alolan Persian is a good idea. Future Sight Uxie is a great partner, as it punishes the physical walls such as Tangela and Altaria that switch in on Sawk and can also pivot Sawk in safely with U-turn. Sawk can also weaken the aforementioned walls into the KO range of physical cleaners like Rapidash and Swords Dance Silvally formes.</p> "
      },
      {"name": "All-Out Attacker"}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 435539, "username": "BloodAce"}, {"user_id": 369076, "username": "Tuthur"}]}, {"name": "Grammar checked by", "members": [{"user_id": 449990, "username": "DC"}, {"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 226429, "username": "Jett"}]}
  },
  "Lilligant": {"sets": [{"name": "Choice Specs"}]},
  "Basculin": {
    "comments": "<h1>Other Options</h1> <p>Surf is more accurate than Hydro Pump, but its lower power makes it less favorable than Hydro Pump. Mystic Water bluffs a Choice item and lures in foes like Ninetales and Altaria, allowing Basculin to potentially revenge kill them with Aqua Jet or Ice Beam. However, the extra power or Speed from Choice items are more beneficial. A physical Choice Scarf seems reasonable, but Hydro Pump's power makes special Choice Scarf sets better.</p> <h1>Checks and Counters</h1> <p><strong>Water-types: Water-types like Wishiwashi, Cramorant, and Poliwrath easily handle Basculin's STAB moves. However, they must be wary of Toxic. Qwilfish does a great job at tanking Basculin's physical attacks, but it cannot deal with Choice Specs sets.</p> <p><strong>Grass-types: Grass-types such as Tangela, Appletun, and Eldegoss can switch into Basculin's Water type attacks, but they must be careful of Ice Beam.</p> <p><strong>Faster Attackers: Faster foes like Cinccino and Manectric are able to revenge kill Basculin, but they have to watch out for Choice Scarf Basculin or Aqua Jet.</p> <p><strong>Priority Users: Priority users such as Thwackey and Kangaskhan easily remove Basculin due to its poor bulk.</p> <p><strong>Special Walls: Articuno and Clefairy handle Choice Specs Basculin well, but all of these Pokemon have to watch out for Choice Band Basculin.</p> <p><strong>Altaria: Altaria can endure physical attacks, take most special attacks, and can switch out to remove Toxic. However, it has to watch out for Ice Beam from special sets.</p> ",
    "sets": [
      {
        "name": "Choice Specs",
        "description": "<p>As a result of deadly Adaptability-boosted STAB moves, great Speed tier, and unpredictability between special and physical sets, Basculin is a premier special wallbreaker. However, it's incredibly frail, so it has to be cautious of revenge killers like Kangaskhan, Cinccino, and Gourgeist-S. Flip Turn allows Basculin to chip switch-ins and checks like Cramorant and Wishiwashi while keeping momentum. Ice Beam deals with some Water-resistant foes like Tangela and Altaria. Toxic cripples foes like Cramorant and Wishiwashi.</p> <p>Basculin typically fits on offensive and balance teams looking for an immediate special wallbreaker with a solid Speed tier. Choice Specs Basculin provides great support for physical wallbreakers like Kangaskhan and Sawk that have trouble with physical walls. In return, they can deal with special walls like Wishiwashi and Clefairy, which Basculin struggles to break through. Defensive pivots such as Uxie and Articuno can take hits for Basculin and bring it safely on the field with U-turn, while Basculin helps them with its pivoting. This works very well in tandem with entry hazard support from the likes of Coalossal and Rhydon, as it allows Basculin to OHKO targets like Gurdurr. Partners like Ninetales and Frosmoth cover Grass-types like Tangela, while teammates like Thwackey and Rotom handle Water-types like Wishiwashi and Cramorant.</p> "
      },
      {
        "name": "Choice Band",
        "description": "<p>Choice Band Basculin takes advantage of its respectable Speed tier and Adaptability to tear through Pokemon that normally absorb its special attacks, like Clefairy and Articuno. Flip Turn chips checks such as Altaria and Cramorant while keeping momentum. Aqua Jet helps Basculin revenge kill weakened, faster foes such as Cinccino and Ninetales. Psychic Fangs can be used to provide coverage against Qwilfish and Poliwrath, which can similarly handle the rest of Basculin's attacks well.</p> <p>Basculin pairs well with special attackers such as Alcremie, Frosmoth, Ninetales, and Rotom, as it can take down special walls like Articuno and Clefairy that its teammates struggle with and also lure in physical walls and use Flip Turn. Defensive pivots like Uxie, Alolan Persian, and Articuno let Basculin safely enter the field and can take hits for it. Offensive pivots such as Rotom and Cinccino similarly allow Basculin to safely enter the field by threatening or KOing foes. Basculin pairs nicely with Pokemon that can threaten Water-types such as Rotom, Thwackey, and Manectric. Frosmoth, Rapidash, and Ninetales take care of Grass-types, with Frosmoth notably also checking one of the biggest threats to Basculin in Altaria.</p> "
      },
      {
        "name": "Choice Scarf",
        "description": "<p>Choice Scarf Basculin is a great choice for teams that want a very hard hitting revenge killer and pivot. Flip Turn chips switch-ins such as Cramorant and Clefairy while providing momentum. Ice Beam is great coverage against Pokemon like Altaria and Tangela, which can normally switch into its Water-type attacks. Toxic cripples checks like Cramorant and Wishiwashi.</p> <p>Choice Scarf Basculin is usually found on offense and balance teams looking for a revenge killer. VoltTurn cores love having Basculin on their team, as it enables these cores with Flip Turn while bulkier pivots like Alolan Persian and Uxie can help Basculin switch in easily. Teammates such as Articuno and Skuntank serve as answers to bulky Grass-types like Tangela and Appletun. Thwackey and Rotom check Water-types that sponge Basculin's attacks and are additional offensive pivots that keep momentum. Lastly, entry hazard removers like Altaria and Rotom-S clear entry hazards that wear down Basculin as it pivots.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 369076, "username": "Turthur"}, {"user_id": 231074, "username": "S1nn0hC0nfirm3d"}]}, {"name": "Grammar checked by", "members": [{"user_id": 449990, "username": "DC"}]}], "writtenBy": [{"user_id": 528055, "username": "hiss"}]}
  },
  "Crustle": {"sets": [{"name": "Shell Smash"}]},
  "Cinccino": {
    "comments": "<h1>Other Options</h1> <p>Heavy-Duty Boots prevents Cinccino from being worn down by entry hazards. Protective Pads can prevent Cinccino from being worn down from residual damage such as Rocky Helmet and Iron Barbs. However, forgoing Choice Band for one of the aforementioned items results in a noticeable loss of power.</p> <h1>Checks and Counters</h1> <p><strong>Fighting-types</strong>: Fighting-types such as Sawk and Gurdurr are problematic for Cinccino. Choice Scarf Sawk outspeeds and can OHKO it, while Gurdurr can revenge kill Cinccino with Mach Punch.</p> <p><strong>Ghost-types: Although they do not appreciate Knock Off, Ghost-types such as Cofagrigus and Rotom check Cinccino by switching into Tail Slap. Both Gourgeist-Small and Rotom can cripple Cinccino with Will-O-Wisp.</p> <p><strong>Residual Damage: Residual damage from Iron Barbs and Rocky Helmet can severely weaken Cinccino, as each Tail Slap hit connecting results in it being damaged five times. Entry hazards prevent Cinccino from repeatedly switching into battle and can put it in range of a potential revenge killer.</p> <p><strong>Steel-types</strong>: Steel-types such as Klinklang and Perrserker are able to handle Tail Slap. However, they should be wary of being weakened by Knock Off and U-turn.</p> <p><strong>Revenge Killers: Although Cinccino is relatively fast, its mediocre bulk means that Pokemon like Alolan Persian and Choice Scarf users like Basculin and Poliwrath can revenge kill it easily. Similarly, strong priority users like Kangaskhan and Shiftry can also threaten Cinccino.</p> ",
    "sets": [
      {
        "name": "Physical Wallbreaker",
        "description": "<p>The combination of Skill Link + Tail Slap makes Cinccino a notable offensive threat that is able to revenge kill a majority of the ZU metagame. Bullet Seed provides coverage against Rock-types such as Kabutops and Rhydon that resist Tail Slap. Knock Off weakens Ghost-types such as Gourgeist-Small, Rotom, and Sableye, and cripples Eviolite-reliant Pokemon such as Rhydon and Tangela. U-turn is useful for establishing and retaining momentum against the aforementioned Rock-, Steel-, and Ghost-types, while Rock Blast can be used to OHKO Coalossal and Rapidash without activating Flame Body.</p> <p>Fighting-types such as Sawk and Gurdurr complement Cinccino by pressuring problematic Steel- and Rock-types such as Klinklang and Rhydon, easing Cinccino's ability to break through them. Ghost-type checks such as Rotom and Silvally-Dark are also appreciated, handling foes such as opposing Rotom and Gourgeist-Small; in return, Cinccino can form a VoltTurn core with them and safely pivot them into battle. Special wallbreakers such as Choice Specs Basculin and Thievul also appreciate U-turn support, and they can threaten physical walls that switch into Cinccino. Entry hazard removal from the likes of Cramorant and the aforementioned Rotom can alleviate Cinccino's susceptibility to entry hazards from its frequent pivoting.</p> "
      },
      {"name": "Offensive Pivot"}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 369076, "username": "Tuthur"}, {"user_id": 231074, "username": "S1nn0hC0nfirm3d"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 449990, "username": "DC"}]}
  },
  "Klinklang": {"sets": [{"name": "Shift Gear"}, {"name": "Choice Band"}, {"name": "Choice Specs"}]},
  "Beheeyem": {
    "comments": "<h1>Other Options</h1> <p>A bulky Nasty Plot set with Recover allows Beheeyem to wallbreak outside of Trick Room and better wield Analytic, though Beheeyem becomes even easier to revenge kill because it lacks a way to circumvent its low Speed.</p> <h1>Checks and Counters</h1> <p><strong>Dark-types</strong>: Dark-types like Silvally-Dark, Thievul, Choice Band Spiritomb, and Shiftry can switch into Psychic and OHKO Beheeyem with minimal to no prior chip damage, especially if Beheeyem has used its Power Herb. The latter two in particular can OHKO Beheeyem with Sucker Punch, forcing it out most of the time even under Trick Room.</p> <p><strong>Steel-types: Steel-types like Klinklang and Perrserker have enough bulk to stomach at least one hit from Beheeyem and deal massive damage in return. However, they cannot switch in safely.</p> <p><strong>Special Walls: Special walls like Clefairy and Wishiwashi can take a hit from Beheeyem and stall out Trick Room turns with their terrific bulk. Wishiwashi is able to underspeed Beheeyem even under Trick Room with minimum Speed and heavily chip it with U-turn, while Clefairy can recover damage off with Soft-Boiled and fish for Special Attack drops with Moonblast.</p> <p><strong>Kangaskhan: Although it cannot switch in, Kangaskhan can repeatedly use Fake Out and waste Trick Room turns, additionally whittling Beheeyem down. After Beheeyem has been weakened enough, Kangaskhan can use Sucker Punch and defeat it.</p> <p><strong>Faster Wallbreakers</strong>: Without Trick Room, Beheeyem's merely passable bulk and poor defensive typing leave it very vulnerable to strong Pokemon that can outspeed it, such as Rotom, Basculin, Jynx, and Perrserker.</p> ",
    "sets": [
      {
        "name": "Trick Room",
        "description": "<p>Thanks to Beheeyem's sky-high Special Attack stat, terrible Speed stat, and access to Trick Room, it is a staple on said archetype. Meteor Beam OHKOes Pokemon that can switch into Psychic like Alolan Persian, Skuntank, and Thievul, OHKOes specially defensive Pokemon like Articuno and Coalossal, and boosts its Special Attack stat without wasting a Trick Room turn on setup when used with Power Herb. Thunderbolt OHKOes Cramorant and 2HKOes Wishiwashi while 2HKOing Articuno at +1. It is also Beheeyem's strongest spammable option against Dark- and Steel-types. Analytic takes advantage of how well Beheeyem forces switches, and it exploits Beeheeyem's very low Speed in the rare instances it attacks outside of Trick Room.</p> <p>Due to Beheeyem's awful Speed, poor defensive typing, and merely decent bulk, it should mainly be used on dedicated Trick Room teams, as otherwise other Psychic-types and special wallbreakers outclass it. Pivots like Uxie and Perrserker can also lure in physical walls like Qwilfish and Tangela and use U-turn to make Beheeyem's wallbreaking easier. Other Trick Room setters, like Gourgeist-XL, Uxie, and Trevenant, can provide more chances for Beheeyem to attack without needing to set up Trick Room first, and teammates that lack Trick Room especially appreciate these chances. These teammates include Bouffalant, Flame Orb Throh, and Rhydon, which benefit from Beheeyem's wallbreaking and Trick Room, enabling them to more easily break holes against the opposition or clean late-game.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 369076, "username": "Tuthur"}, {"user_id": 226429, "username": "Jett"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 543866, "username": "5Dots"}]}
  },
  "Cryogonal": {
    "comments": "<h1>Other Options</h1> <p>Rapid Spin can be used over Defog on entry hazard stacking teams to avoid removing Cryogonal's own entry hazards. Haze is also useful against special setup sweepers such as Frosmoth and Rotom-F. A dual screens set with Reflect, Light Screen, and Explosion has a niche on hyper offense teams.</p> <h1>Checks and Counters</h1> <p><strong>Physical Attackers: Physical attackers such as Kangaskhan, Rhydon, and Silvally formes threaten Cryogonal due to its low physical bulk.</p> <p><strong>Fighting-types: Fighting-types such as Gurdurr and Sawk can threaten to OHKO Cryogonal. Specifically, Choice Scarf Sawk outspeeds Cryogonal and OHKOes it, while Gurdurr easily tanks Freeze-Dry and threatens Cryogonal with Drain Punch.</p> <p><strong>Fire-types: Fire-types such as Ninetales and Rapidash resist Freeze-Dry and force Cryogonal out.</p> <p><strong>Steel-types: Klinklang and Perrserker tank Freeze-Dry and can retaliate with their STAB attacks. However, they do not appreciate taking a Knock Off.</p> <p><strong>Item Removal: Knock Off users such as Uxie, Clefairy, Alolan Persian, and Audino and Trick users like Rotom can threaten to cripple Cryogonal by removing its Heavy-Duty Boots, which makes it vulnerable to Stealth Rock and lowers its ability to switch in.</p> ",
    "sets": [
      {
        "name": "Special Wall",
        "description": "<p>Cryogonal is a fast, niche Defogger in the metagame that has great special bulk and can offensively pressure Qwilfish. Cryogonal also performs well as a specially defensive wall, checking prevalent special attackers such as Articuno, Rotom formes, and Frosmoth. It has access to reliable recovery in Recover and great utility with the combination of Toxic and Knock Off.</p> <p>Nonetheless, Cryogonal's low Defense stat and poor defensive typing make it vulnerable to a majority of physical attackers. Altaria can help Cryogonal check both Fire- and Fighting-type moves. Tangela can also check physical attackers such as Sawk, Cinccino, and Gurdurr, which force out Cryogonal. In return, Cryogonal counters special attackers such as Choice Specs Basculin and Frosmoth. On balance builds, Fire-types like Ninetales and Rapidash is a great partner for Cryogonal, handling Steel-types such as Perrserker and Klinklang; in return, Cryogonal is able to pressure its checks such as Altaria and bulky Water-types like Wishiwashi. Water-types like Qwilfish, Poliwrath, and Wishiwashi help check Fire-types such as Rapidash and Ninetales, which annoy Cryogonal. Bulky Fighting-types such as Gurdurr and Throh also pair well with Cryogonal, threatening Steel-types.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 435539, "username": "BloodAce"}, {"user_id": 231074, "username": "S1nn0hC0nfirm3d"}]}, {"name": "Grammar checked by", "members": [{"user_id": 449990, "username": "DC"}]}], "writtenBy": [{"user_id": 451786, "username": "Mirbro"}]}
  },
  "Accelgor": {"sets": [{"name": "Suicide Lead"}, {"name": "Choice Specs"}]},
  "Stunfisk": {
    "comments": "<h1>Other Options</h1> <p>Rest provides Stunfisk with recovery and lets it remove status, but it makes Stunfisk even more passive. Stone Edge or Rock Slide is an option to directly threaten Articuno and Frosmoth. Thunder Wave provides a more reliable method of slowing foes like Sawk and Silvally formes, while Protect synergizes with Toxic and Leftovers, wearing down foes and providing Stunfisk with more recovery. However, Stunfisk often has difficulty fitting either move.</p> <h1>Checks and Counters</h1> <p><strong>Grass-types: Grass-types like Tangela, Thwackey, and Eldegoss threaten Stunfisk with their attacks or status and force it out. However, they do not appreciate Toxic.</p> <p><strong>Water-types: Although they cannot directly switch into Discharge or Toxic, Water-types like Basculin, Poliwrath, and Wishiwashi can effectively handle Stunfisk.</p> <p><strong>Ice-types: Despite its great special bulk, Stunfisk is vulnerable to powerful Ice-types like Frosmoth, Abomasnow, and Jynx.</p> <p><strong>Ground-types: Ground-types like Rhydon and Piloswine target Stunfisk's lack of reliable recovery and heavily damage or KO it with their strong attacks.</p> <p><strong>Strong Physical Attackers: Strong physical attackers like Cinccino, Kangaskhan, and Sawk heavily pressure Stunfisk with their attacks, although they dislike Static.</p> <p><strong>Residual Damage: Stunfisk's lack of reliable recovery leaves it vulnerable to Spikes and Toxic from foes such as Qwilfish, Rapidash, and Clefairy.</p> ",
    "sets": [
      {
        "name": "Specially Defensive",
        "description": "<p>Stunfisk is a notable specially defensive wall and Stealth Rock setter in ZU that has good matchups against common threats like Rotom, Skuntank, and Manectric. Toxic wears down switch-ins like Tangela, Rhydon, and Piloswine and Defoggers like Articuno and Rotom formes. Earth Power prevents Stunfisk from being passive against prominent special attackers like Manectric, Skuntank, and Ninetales. Discharge allows Stunfisk to spread paralysis and deal with most Defoggers, while Foul Play lets it handle Substitute + Nasty Plot Rotom and physical setup sweepers like Thwackey, which may try to take advantage of Stunfisk to safely set up. Static punishes physical attackers like Kangaskhan, Cinccino, and Alolan Persian, and it can also give Stunfisk a chance to cripple checks like physical Basculin and Thwackey in an emergency situation.</p> <p>Stunfisk fits primarily on balance and bulky offense teams and provides valuable role compression. Grass-types like Tangela, Thwackey, and Gourgeist-S handle Water- and Ground-types like Wishiwashi and Rhydon; in return, Stunfisk can take on Poison-types like Silvally-Poison and Skuntank for them. Fire-types like Rapidash and Ninetales pressure the aforementioned Grass-types, as well as Ice-types like Articuno and Frosmoth, for Stunfisk. As Stunfisk has a poor matchup against other Stealth Rock setters like Rhydon and Piloswine, it is adviseable to pair it with Water-types like Poliwrath, Basculin, and Cramorant; Cramorant is a notable partner that can provide Defog and check powerful foes like Sawk while benefitting greatly from Stunfisk dealing with Electric-types. Toxic absorbers like Altaria and Qwilfish prevent Stunfisk from getting worn down; a Toxic Spikes absorber like Silvally-Poison or Qwilfish is likewise helpful. Cleric support from partners like Clefairy and Alcremie helps Stunfisk remain healthy, especially on bulkier teams.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 435539, "username": "BloodAce"}, {"user_id": 369076, "username": "Tuthur"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 449990, "username": "DC"}]}
  },
  "Stunfisk-Galar": {
    "comments": "<h1>Other Options</h1> <p>Snap Trap traps and chips down targets while synergizing with Yawn to inflict foes with sleep. However, having one of these moves reduces Galarian Stunfisk's coverage and utility in other areas and leaves it unable to deal with Substitute + Nasty Plot Rotom formes; they should only been used in specific situations. Thunder Wave cripples and forces out faster foes like Kangaskhan and Silvally formes; however, it leaves Stunfisk Galarian unable to punish Ground-types. Protect allows Galarian Stunfisk to gain more recovery from Leftovers and lets it scout Choice item users such as Sawk and Rotom. Rest is also used as a recovery option, but it is considerably niche and only fits on select teams. Rest is best used when paired with Heal Bell support from Articuno, Clefairy, or Altaria on stall teams.</p> <h1>Checks and Counters</h1> <p><strong>Water-types: Water-types such as Basculin, Cramorant, and Wishiwashi handle Galarian Stunfisk with their super effective STAB moves.</p> <p><strong>Ground-types: Ground-types such as Rhydon, Piloswine, and Silvally-Gound force out Galarian Stunfisk out, with the former two using that opportunity to set up Stealth Rock and the latter setting up with Swords Dance.</p> <p><strong>Fighting-type Pokemon and Coverage: Fighting-types such as Sawk and Gurdurr threaten Galarian Stunfisk with their super effective STAB moves, while Cofagrigus can set up with Iron Defense and KO it with Body Press.</p> <p><strong>Fire-types: Fire-types such as Ninetales and Rapidash threaten Galarian Stunfisk, although they cannot safely switch in due to Galarian Stunfisk's Rock / Ground coverage.</p> <p><strong>Strong Wallbreakers: While Galarian Stunfisk does have great bulk, it can easily get overwhelmed by strong setup sweepers such as Swords Dance Shiftry, Nasty Plot Rotom, and Iron Defense Cofagrigus.</p> <p><strong>Item Removal: Pokemon such as Knock Off Uxie and Trick Rotom can remove Galarian Stunfisk's main form of recovery in Leftovers, limiting its effectiveness as a special wall.</p> <p><strong>Spikes: Spikes chips down Galarian Stunfisk over time, limiting its switch-ins and effectiveness as a special wall.</p> ",
    "sets": [
      {
        "name": "Special Wall",
        "description": "<p>Galarian Stunfisk is a niche Stealth Rock setter in the metagame thanks to its great defensive stats and great defensive typing that lets it wall threats such as Rotom formes and Frosmoth. Rock Slide hits Pokemon such as Cramorant, Articuno, Frosmoth, and the aforementioned Rotom formes; Rock Slide is more consistent than Stone Edge and preferred due to its higher accuracy and PP. Curse turns Galarian Stunfisk into a threatening late-game cleaner while also making up for its passivity. Yawn forces switches from Pokemon that wall Galarian Stunfisk, such as Uxie and Tangela. Foul Play deals significant damage to Swords Dance users such as Silvally formes.</p> <p>Galarian Stunfisk is a decent pick on balance and stall teams thanks to it compressing the role of an Electric immunity, Stealth Rock setter, and special wall. Bulky Water-types such as Cramorant and Wishiwashi are great partners to Galarian Stunfisk, as they can take on Water-types such as Basculin and Poliwrath, which threaten Galarian Stunfisk, while also benefitting from Galarian Stunfisk's Electric immunity. Grass-types are also great partners to cover Galarian Stunfisk's weaknesses, with Appletun covering its weaknesses to Ground, Water, and Fire, while Gourgeist-S and Trevenant cover its weaknesses to Ground, Water, and Fighting. Uxie can also work as a partner, as it is resistant to Fighting and immune to Ground. Spikes stacking teams also appreciate Galarian Stunfisk's ability to force switches with Yawn, with a Spikes setter such as Qwilfish also covering Galarian Stunfisk's weakness to Fighting.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 369076, "username": "Tuthur"}, {"user_id": 296755, "username": "5gen"}]}, {"name": "Grammar checked by", "members": [{"user_id": 449990, "username": "DC"}]}], "writtenBy": [{"user_id": 485135, "username": "Toto"}, {"user_id": 369076, "username": "Tuthur"}]}
  },
  "Bouffalant": {
    "comments": "<h1>Other Options</h1> <p>A Choice Band set provides Bouffalant with immediate wallbreaking power and also has the element of surprise. Reckless is used to further increase the power of Head Charge. However, this loses the niche of Grass immunity and faces heavy competition from weaker yet more versatile Normal-types in Kangaskhan, Silvally, and Cinccino.</p> <h1>Checks and Counters</h1> <p><strong>Fighting-types: Fighting-type Pokemon such as Sawk, Silvally-Fighting, and Poliwrath all threaten to OHKO Bouffalant with their powerful STAB attacks.</p> <p><strong>Physical Walls: Miltank and Qwilfish can wear down Bouffalant with Rocky Helmet damage, which adds to Head Charge recoil. Alolan Persian can survive a few hits and prevent setup thanks to Foul Play.</p> <p><strong>Strong Faster Pokemon: Strong, faster Pokemon such as Perrserker, Silvally-Dark, and Basculin can hit Boufflant hard, preventing it from setting up.</p> <p><strong>Ghost-types: Sableye and Gourgeist-XL can sponge Bouffalant's attacks and prevent setup with Foul Play and Will-O-Wisp. Rotom can also threaten Bouffalant with Will-O-Wisp but doesn't take Throat Chop very well.</p> ",
    "sets": [
      {
        "name": "Sap Sipper Wallbreaker",
        "description": "<p>Bouffalant finds its niche in ZU as a bulky wallbreaker with a great ability in Sap Sipper. Sap Sipper allows Bouffalant to prey on ZU's Grass-types, such as the common blanket physical walls Tangela and Eldegoss, using them as setup fodder with Substitute and Swords Dance. In addition, Bouffalant checks offensive Grass-type threats in Thwackey and Gourgeist-S. Head Charge is Bouffalant's standard STAB move thanks to its high power. Facade is sometimes used over Substitute and takes advantage of status. This then frees up Close Combat as a coverage option, which hits Pokemon that resist Bouffalant's STAB move such as Rhydon, Klingklang, and Coalossal. Throat Chop is used to hit Ghost-types like Rotom, Gourgeist formes, and Trevenant. The EV spread allows Bouffalant to outspeed uninvested Tangela, Eldegoss, and Alcremie whilst increasing bulk.</p> <p>Bouffalant fits well on balance and bulky offense teams, helping break down defensive teams that rely on passive Pokemon to deal damage. Thwackey is a great partner for Bouffalant, as it can lure in Tangela and Eldegoss before pivoting out with U-turn, bring in Bouffalant safely, and provide additional passive recovery on top of Leftovers. Kabutops and Morpeko are other pivots that can force Grass-types in. Strong special attackers such as Basculin, Thievul, and Appletun can help break through other physically bulky Pokemon such as Rhydon, Qwilfish, and Miltank. Uxie and Qwillfish can compress the roles of entry hazard setter and switch-in to Fighting-type attacks that threaten Bouffalant. Dark-type Pokemon such as Silvally-Dark and Skuntank can help pressure Ghost-types like Rotom and Sableye, which are immune to Bouffalant's STAB moves. Lastly, late-game cleaners such as Choice Scarf Sawk, Thwackey, and Cinccino can benefit from Bouffalant's wallbreaking abilities.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 369076, "username": "Tuthur"}, {"user_id": 226429, "username": "Jett"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 485135, "username": "Toto"}]}
  },
  "Malamar": {
    "comments": "<h1>Other Options</h1> <p>An EV spread of 252 HP / 184 SpD / 72 Spe allows Malamar to outspeed Perrserker, Piloswine, and Jolly Rhydon, at the cost of no longer avoiding a 3HKO from Jynx and Ninetales. A physically defensive spread with an Impish nature enables Malamar to better take on Sawk, Kangaskhan, and Rapidash, but it makes Malamar worse against special attackers like Rotom and Jynx. Psycho Cut grants Malamar a more reliable way to break down Fighting-types like Throh and Gurdurr, as well as opposing Poison-types like Qwilfish and Silvally-Poison. It also serves as Malamar's best way to damage Alcremie after boosts, but Knock Off offers too much utility to forego except on an offensive set with three attacks + Substitute or Taunt. A Choice Scarf set with Switcheroo over Sleep Talk can cripple checks like Alcremie and Pyukumuku, although this set makes Malamar more passive due to lacking Leftovers and renders it more susceptible to strong attackers like Thwackey and Rapidash.</p> <h1>Checks and Counters</h1> <p><strong>U-turn: Pokemon such as Wishiwashi and Silvally-Poison can switch into Malamar and force it out with U-turn. More offensive Pokemon like Flapple, Perrserker, Thwackey, and Cinccino can also scare it out, although they are unable to switch in safely and dislike losing their items to Knock Off.</p> <p><strong>Strong Wallbreakers: While most can't directly switch into it, Malamar's initial bulk and mediocre Speed tier allow dangerous wallbreakers like Kangaskhan, Basculin, Choice Band Morpeko, and Swords Dance Silvally-Poison to heavily damage it.</p> <p><strong>Fairy-types: Alcremie can either 3HKO Malamar or use it as setup fodder; however, mono-attacking Stored Power variants of Alcremie are unable to beat Malamar. Clefairy can beat it comfortably in a one-on-one, although a +1 Malamar can beat a Clefairy that switches in. Both Fairy-types also dislike losing their items.</p> <p><strong>Pyukumuku: Unaware ignores Malamar's stat boosts and causes it to deal little damage to Pyukumuku. Pyukumuku can then trap Malamar with Block and proceed to stall it out.</p> <p><strong>Bulky Ghost-types</strong>: Sableye and Gourgeist-XL can stop Malamar from using Superpower and allow themselves to be hit with a weak Knock Off, preventing it from gaining boosts. Spiritomb dislikes losing its item, but it can use its neutrality to Knock Off to turn Malamar into setup fodder or attack it.</p> ",
    "sets": [
      {
        "name": "Contrary Stallbreaker",
        "description": "<p>Malamar serves as a disruptive stallbreaker thanks to its Contrary-boosted Superpower, STAB Knock Off, and decent bulk. Its ability Contrary allows Malamar to take advantage of teams relying on Defog to clear hazards, Intimidate and Parting Shot to deal with physical attackers, and stat drops from moves like Shadow Ball and Grav Apple. Superpower allows Malamar to simultaneously boost and break past walls like Tangela, Stunfisk, and Articuno. Knock Off OHKOes non-Colbur Berry Rotom and weakens switch-ins like Alcremie, Clefairy, and Thwackey. The combination of Rest and Sleep Talk enables Malamar to either continue boosting with Superpower or removing items via Knock Off while also enabling it to outstall foes like Alolan Persian, Cramorant, and Altaria. A specially defensive spread alongside Leftovers lets Malamar avoid the 3HKO from Pokemon such as Ninetales, Cramorant, and Choice Scarf Jynx, although it must be wary of switching into the latter's Trick.</p> <p>Malamar appreciates entry hazard support from teammates like Qwilfish and Rhydon to wear down threats like Silvally-Poison and Sawk. In return, it can switch into Defoggers like Articuno and Cramorant and deter them while also reliably breaking down common defensive walls like Tangela and Stunfisk. Malamar's teammates appreciate it breaking down, or at least weakening, special attackers such as Ninetales and Skuntank. This enables offensive teammates like Silvally-Poison and Thwackey to clean late-game. As a result of its massive weakness to U-turn, Pokemon such as Rocky Helmet Miltank and Qwilfish, and Flame Body Rapidash are helpful to deter pivots like Cinccino and Thwackey.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 231074, "username": "S1nn0hC0nfirm3d"}, {"user_id": 226429, "username": "Jett"}]}, {"name": "Grammar checked by", "members": [{"user_id": 449990, "username": "DC"}]}], "writtenBy": [{"user_id": 543866, "username": "5Dots"}]}
  },
  "Trevenant": {"sets": [{"name": "Choice Band"}]},
  "Gourgeist-Small": {"sets": [{"name": "Choice Scarf"}, {"name": "Choice Band"}, {"name": "All-Out Attacker"}, {"name": "Nasty Plot"}]},
  "Gourgeist-Super": {"sets": [{"name": "Physical Wall"}, {"name": "Tank"}]},
  "Lycanroc-Midnight": {"sets": [{"name": "Swords Dance"}, {"name": "Choice Band"}]},
  "Wishiwashi": {
    "comments": "<h1>Other Options</h1> <p>Wishiwashi can opt for a physically defensive spread of 252 HP / 252 Def / 4 SpD with a Bold or Impish nature to better handle physical attackers such as Rhydon and Rapidash at the cost of losing the ability to reliably check special attackers such as Ninetales.</p> <h1>Checks and Counters</h1> <p><strong>Grass-types: Offensive Grass-types such as Flapple and Gourgeist-S are able to OHKO Wishiwashi, while Thwackey and Shiftry can KO Wishiwashi with a bit of prior chip. However, these Pokemon, particularly Shiftry, must be careful of switching into U-turn. Defensive Grass-types such as Appletun and Tangela can deal with Wishiwashi and do not take much from its attacks, but they must be wary of Toxic.</p> <p><strong>Electric-types: The Rotom formes and Manectric threaten Wishiwashi out with their STAB attacks, with the former also being able to cripple it with Trick.</p> <p><strong>Residual Damage: Entry hazards limit the number of times Wishiwashi can safely switch in and wear it down to Solo Form much faster. Altaria, Articuno, and Clefairy can also cripple non-RestTalk Wishiwashi variants with Toxic.</p> <p><strong>Knock Off: Wishiwashi is reliant on Leftovers as its means of recovery, so Knock Off users such as Gurdurr, Alolan Persian, and Clefairy can reduce Wishiwashi's longevity.</p> ",
    "sets": [
      {
        "name": "Defensive Pivot",
        "description": "<p>With access to a slow U-turn and naturally high defenses, Wishiwashi makes for an excellent slow pivot and mixed wall, checking the likes of Rapidash and Basculin. Scald can burn physical attackers such as Gourgeist-S and Flapple that attempt to switch in, while Liquidation is a guaranteed OHKO on Fire-types such as Ninetales. Wishiwashi can opt for Rest for some much needed instant recovery. Sleep Talk should be used in conjunction with Rest in order to avoid being overly passive when asleep. Rest Wishiwashi is also a great status absorber, making it a more reliable pivot against stall teams. Alternatively, Toxic cripples bulkier foes like Appletun and Tangela, as well as dissuading setup sweepers like Frosmoth and Swoobat from switching in. Protect synergizes well with Toxic and lets Wishiwashi scout attacks from Choiced-locked Pokemon such as Rotom, Cinccino, and Sawk. Additionally, Protect lets Wishiwashi acquire more Leftovers recovery, which is essential for staying above Schooling's deactivation threshold.</p> <p>The best use of Wishiwashi's slow U-turn is to pair it with offensive threats such as Sawk, Kangaskhan, and Shiftry that typically struggle to switch into attacks. Pivots such as the Rotom formes and Uxie make for great Wishiwashi partners, as they can form a VoltTurn core to keep momentum while wearing down foes. Wishiwashi's lack of reliable recovery means it is very vulnerable to being worn down by entry hazards; Defog users such as Rotom-S and Articuno help to alleviate this issue. Ground-types like Rhydon and Piloswine appreciate Wishiwashi's slow U-turn, and in return, they can deal with Electric-types such as Rotom, Rotom-S, and Morepeko. Grass-resistant Pokemon such as Ninetales and Skuntank are good Pokemon to pair with Wishiwashi, as they can switch into Pokemon like Shiftry, Thwackey, and Gourgeist-S that threaten Wishiwashi out.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 369076, "username": "Tuthur"}, {"user_id": 435539, "username": "BloodAce"}]}, {"name": "Grammar checked by", "members": [{"user_id": 262594, "username": "Milak"}]}], "writtenBy": [{"user_id": 226429, "username": "Jett"}]}
  },
  "Lurantis": {"sets": [{"name": "Physical Wall"}]},
  "Shiinotic": {"sets": [{"name": "Physical Wall"}]},
  "Pyukumuku": {
    "comments": "<h1>Other Options</h1> <p>Pyukumuku can sometimes forgo Block to run Rest with both Spite and Toxic. Soak lets Pyukumuku inflict Toxic poison on Steel- and Poison-types Klinklang and Silvally-Poison and helps it better take on Pokemon such as Kangaskhan, Klinklang, and other Silvally formes by making them lose their STAB bonus.</p> <h1>Checks and Counters</h1> <p><strong>Taunt: Pyukumuku is forced to use Struggle if it gets afflicted by Taunt. Taunt users like Skuntank, Alolan Persian, and Qwilfish beat Pyukumuku, but some of them should be wary of being inflicted by Toxic poison on the switch.</p> <p><strong>Substitute: Substitute users such as Rotom, Klinklang, and Articuno are major threats to Pyukumuku due to them being immune to Block and Toxic; however, PP stalling with Spite and Rest can help against them.</p> <p><strong>Electric- and Grass-types: Since Pyukumuku is weak to Grass- and Electric-type moves, Pokemon such as Rotom formes, Shiftry, and Flapple are big threats to it.</p> <p><strong>Strong Wallbreakers: Strong wallbreakers such as Choice Band Sawk and Cinccino 2HKO Pyukumuku.</p> <p><strong>Stored Power Users: After several Calm Minds, Alcremie, Musharna, Uxie, and Swoobat can overcome Pyukumuku's Unaware with Stored Power. They also have Substitute or Rest to combat Toxic.</p> ",
    "sets": [
      {
        "name": "Unaware Wall",
        "description": "<p>Pyukumuku is the sole viable user of Unaware in ZU, making it a cornerstone on stall teams. Unaware allows Pyukumuku to take on setup sweepers such as Swords Dance Rhydon, non-Stored Power Alcremie, and Silvally formes. Block prevents the foe from switching and allows Pyukumuku to remove them with Toxic or PP stall with Spite. Rest removes status and helps to PP stall foes that cannot 3HKO Pyukumuku, such as Choice Scarf Sawk. Leftovers is normally preferred when entry hazard removal is prevalent on the team, while Heavy-Duty Boots may be used to help against entry hazard stacking matchups.</p> <p>Pyukumuku's passive nature limits it to fitting exclusively on stall teams. Specially defensive clerics such as Clefairy and Articuno form a good core with Pyukumuku. Physically defensive Pokemon such as Altaria, Tangela, and Golbat, which can take on offensive Grass-types, make for good partners with Pyukumuku. Pokemon that can beat Electric-types such as Rotom-S and block Volt Switch such as Stunfisk are also great partners. If not running Heavy-Duty Boots, or if the item gets removed, Pyukumuku can take big damage from entry hazards and have a harder time checking Silvally-Dark and Rapidash. To avoid this, entry hazard removers such as Altaria, Articuno, and Eldegoss are essential on stall teams.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 369076, "username": "Tuthur"}, {"user_id": 231074, "username": "S1nn0hC0nfirm3d"}]}, {"name": "Grammar checked by", "members": [{"user_id": "C", "username": "D"}, {}]}], "writtenBy": [{"user_id": 451786, "username": "Mirbro"}]}
  },
  "Type: Null": {
    "comments": "<h1>Other Options</h1> <p>A set with Iron Defense / Swords Dance / Crush Claw / Rest and an EV spread of 248 HP / 8 Def / 252 SpD is sometimes used to turn Type: Null into an unbreakable and powerful sweeper. However, this set is not consistent due to it only having Normal-type coverage and is walled by the common Ghost-types in the tier; in addition, it is passive thanks to the lack of Sleep Talk. This set also lacks the utility of the pivot set, and Type: Null also needs multiple boosts to become threatening due to its low Attack stat.</p> <h1>Checks and Counters</h1> <p><strong>Fighting-type Pokemon</strong>: Type: Null is weak to Fighting, so it should be careful of Pokemon like Sawk, Gurdurr, and Poliwrath.</p> <p><strong>Strong Physical Wallbreakers: Strong physical wallbreakers such as Sawk and Swords Dance Silvally formes can muscle their way through Type: Null.</p> <p><strong>Knock Off: Any Pokemon with Knock Off is a threat, as losing Eviolite significantly decreases Type: Null's bulk.</p> <p><strong>Taunt</strong>: Taunt users such as Skuntank and Qwilfish stop Type: Null from recovering and spreading status, forcing it to pivot.</p> <p><strong>Setup Sweepers that Bypass Toxic: Setup sweepers with Substitute such as Rotom formes can freely set up in front of Type: Null. Poison- and Steel-types such as Skuntank and Klinklang, as well as Pokemon that can cure status like Spiritomb and Aromatherapy Alcremie, can also set up for free.</p> <p><strong>Entry Hazards: Although Type: Null is not weak to Stealth Rock, its lack of passive recovery and constant pivoting cause it to get easily chipped down, limiting the amount of times it can switch in and lowering its usefulness as a wall.</p> ",
    "sets": [
      {
        "name": "Defensive Pivot",
        "description": "<p>Type: Null acts as a niche defensive pivot in the metagame thanks to its sizable bulk with Eviolite and access to U-turn. This bulk allows it to check top-tier special wallbreakers such as Basculin, Ninetales, and Thievul. Type: Null's slow U-turn allows it to pivot and safely bring in a teammate. Toxic cripples foes and prevents Pokemon such as Rhydon, Rapidash, and Silvally formes from freely setting up in front of it. RestTalk is Type: Null's only form of recovery and lets it consistently pivot. A Sassy nature and 0 Speed IVs minimize Type: Null's Speed, allowing for the slowest U-turns.</p> <p>Type: Null is a great pick for teams looking for a pivot, special wall, and status absorber condensed into one Pokemon. It pairs well with other pivots, forming a VoltTurn core. Uxie is an excellent pivot to pair with Type: Null, as it benefits from Type: Null's immunity to Ghost and ability to sponge strong special hits; in return, Uxie is able to switch into strong Fighting-types such as Sawk and Gurdurr that trouble Type: Null. Wallbreakers such as Thievul, Basculin, and Perrserker appreciate Type: Null's slow U-turn safely bringing them in. Although Type: Null can sponge special wallbreakers, it cannot do much damage back and is heavily dependent on pivoting into revenge killers to adequately check special sweepers. Thus, priority users like Kangaskhan and Gurdurr are necessary when dealing with foes such as Shiftry and Frosmoth. Finally, Knock Off absorbers such as Qwilfish and Silvally formes work as partners, as they prevent Type: Null from losing its Eviolite.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 369076, "username": "Tuthur"}, {"user_id": 231074, "username": "Ho3nConfirm3d"}]}, {"name": "Grammar checked by", "members": [{"user_id": 449990, "username": "DC"}, {"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 485135, "username": "Toto"}, {"user_id": 369076, "username": "Tuthur"}]}
  },
  "Silvally": {"sets": [{"name": "Choice Scarf"}, {"name": "Choice Band"}, {"name": "Mixed Attacker"}]},
  "Silvally-Dark": {
    "comments": "<h1>Other Options</h1> <p>X-Scissor is an option over U-turn for a stronger move to threaten opposing Dark-types. Toxic can be used to cripple physical walls such as Tangela and Pyukumuku, but it makes Silvally-Dark less effective at wallbreaking. Defog provides role compression, and it is a niche option on certain teams.</p> <h1>Checks and Counters</h1> <p><strong>Dark-types: Although they do not appreciate U-turn, Dark-types such as Alolan Persian and Skuntank can take Multi-Attack from Silvally-Dark and threaten it back with status or a powerful hit.</p> <p><strong>Fighting-types: Fighting-types such as Sawk, Poliwrath, and Gurdurr are able to take Multi-Attack and pressure back with their STAB moves. Gurdurr can also revenge kill Silvally-Dark with Mach Punch, even after it has set up; Choice Scarf Sawk can similarly revenge kill it due to outspeeding it. However, all Fighting-types should be wary of +2 Psychic Fangs.</p> <p><strong>Fairy-types: Fairy-types such as Alcremie, Clefairy, and Shiinotic can threaten Silvally-Dark with their STAB options, but they have to watch out for Iron Head variants.</p> <p><strong>Revenge Killers: Faster attackers such as Basculin, Rapidash, and Cinccino can outspeed and threaten Silvally-Dark. Pokemon with priority moves such as Kangaskhan and Thwackey can similarly KO it once it has been weakened.</p> ",
    "sets": [
      {
        "name": "Swords Dance Sweeper",
        "description": "<p>Silvally-Dark finds a niche in ZU as a powerful setup sweeper, capable of setting up with Swords Dance and utilizing its Multi-Attack to threaten prominent Pokemon such as Uxie, Spiritomb, and Rotom. However, it faces competition from other Silvally formes. U-turn allows Silvally-Dark to function as an early-game pivot and lets it weaken Dark-types such as Alolan Persian and Skuntank, while Flame Charge allows it to outspeed revenge killers such as Choice Scarf Sawk and Basculin. Psychic Fangs can be used to threaten Fighting-types such as Poliwrath and Sawk, while Iron Head weakens Fairy-types such as Alcremie and Clefairy.</p> <p>Silvally-Dark fits best on offensive teams as an early-game pivot that can wallbreak with its powerful Multi-Attack. If running Flame Charge, Silvally-Dark should be preserved for late-game, when it can set up with both Swords Dance and Flame Charge and sweep. Silvally-Dark has trouble with Dark-types such as Alolan Persian and Skuntank, so checks to them such as Alcremie and Piloswine, respectively, are appreciated. Checks to Fighting-types such as Rotom-S, Qwilfish, and the aforementioned Alcremie are also appreciated, with Rotom-S forming a VoltTurn core with Silvally-Dark and Qwilfish providing Spikes support, weakening foes such as Qwilfish into the range of +2 Multi-Attack. As Silvally-Dark lacks recovery, entry hazard removal from the likes of Rotom-S and Cramorant is necessary to keep Silvally-Dark healthy to keep pivoting with U-turn. Memento support from Uxie can help Silvally-Dark more easily set up with both Swords Dance and Flame Charge.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 435539, "username": "BloodAce"}, {"user_id": 231074, "username": "S1nn0hC0nfirm3d"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 449990, "username": "DC"}]}
  },
  "Silvally-Electric": {"sets": [{"name": "Mixed Wallbreaker"}]},
  "Silvally-Fighting": {
    "comments": "<h1>Other Options</h1> <p>A fully physical Swords Dance set alongside Flame Charge and either Iron Head or Psychic Fangs makes Silvally-Fighting a late-game sweeper. At +2, a healthy Silvally-Fighting can lure in and defeat Alcremie with Iron Head, something other Fighting-types like Sawk cannot do, though this set can't beat defensive Pokemon like Qwilfish, Tangela, and Altaria. This set also faces tough competition from other Silvally formes due to their better offensive or defensive typings.</p> <h1>Checks and Counters</h1> <p><strong>Fairy-types: Alcremie and Clefairy do not take much damage from any of Silvally-Fighting's attacks and can freely set up on it, forcing it to switch.</p> <p><strong>Bulky Pokemon: Articuno, Eldegoss, Stunfisk, and Uxie don't take much damage from even Silvally-Fighting's super effective coverage attacks. Articuno and Eldegoss can heal damage off with Roost and Regenerator, respectively, though Stunfisk and Uxie lack reliable recovery.</p> <p><strong>Ghost-types: Spiritomb can switch into any of Silvally-Fighting's attacks with impunity and use it as setup fodder. More offensive Ghost-types, like Rotom and Gourgeist-S, are immune to its STAB move and can revenge kill it with prior damage, though they can't repeatedly switch into Silvally-Fighting's coverage.</p> <p><strong>Faster Pokemon: With some chip damage, faster Pokemon like Cinccino, Ninetales, and Basculin can revenge kill Silvally-Fighting, though they do not want to directly switch into any of its attacks.</p> ",
    "sets": [
      {
        "name": "BoltBeam Pivot",
        "description": "<p>Silvally-Fighting is an excellent mixed wallbreaker and pivot thanks to its typing and movepool beating common Silvally checks, Defoggers, and entry hazard setters like Rhydon, Altaria, and Qwilfish in one teamslot. U-turn maintains momentum and chips bulkier checks like Alcremie, Eldegoss, and Articuno. Thunderbolt 2HKOes Qwilfish and 3HKOes Poliwrath and Wishiwashi, while Ice Beam targets Tangela, Altaria, and Gourgeist-S. These coverage moves allow Silvally-Fighting to beat common Fighting-type checks that would otherwise switch in safely.</p> <p>Silvally-Fighting fits well on VoltTurn teams thanks to its good Speed tier, bulk, and coverage against defensive staples like Cramorant, Qwilfish, and Alolan Persian. Fast and slow pivots like Rotom formes, Cinccino, Wishiwashi, and Uxie chip down checks like Articuno, Stunfisk, and Rotom. Silvally-Fighting heavily struggles to break through Fairy-types and generally bulky Pokemon like Eldegoss or Stunfisk without support, so partners that can take these Pokemon on, like Alolan Dugtrio, Perrserker, and Piloswine, can help it pivot more easily. In return, Silvally-Fighting can take on bulky staples weak to its coverage, like Tangela and Poliwrath, which the aforementioned Steel-types struggle against. Checks to Rotom and Gourgeist-S, such as Stunfisk, Eldegoss, and Sap Sipper Miltank, are appreciated. Stunfisk and Miltank can use Toxic to wear down checks to Silvally-Fighting, like Articuno and opposing Stunfisk. Eldegoss and Miltank can provide cleric support to alleviate Silvally-Fighting's vulnerability to residual damage.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 369076, "username": "Tuthur"}, {"user_id": 226429, "username": "Jett"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 543866, "username": "5Dots"}]}
  },
  "Silvally-Flying": {"sets": [{"name": "Mixed Wallbreaker"}]},
  "Silvally-Poison": {
    "comments": "<h1>Other Options</h1> <p>Ice Beam is an option over Surf for mixed sets, allowing Silvally-Poison to OHKO Altaria while keeping neutral coverage on the whole tier bar Piloswine when paired with Thunderbolt. However, this leaves Silvally-Poison far less consistent versus Ground- and Rock-types such as Rhydon, Stunfisk, and Coalossal. Parting Shot can be used over U-turn on Defog sets, but U-turn's damage is often preferred and Klinklang's Clear Body would prevent Silvally-Poison from freely pivoting. Surf and Thunderbolt are options over U-turn and Flame Charge on Swords Dance Silvally-Poison, giving it better coverage. Grass Pledge is a coverage move hitting Ground-types like Rhydon and Stunfisk while still hitting Water-types like Kabutops and Qwilfish, but it is signficantly weaker than Surf + Thunderbolt.</p> <h1>Checks and Counters</h1> <p><strong>Ground-types: Even if carrying Surf, Silvally-Poison needs to heavily weaken Ground-types like Rhydon, Piloswine, and Stunfisk before sweeping.</p> <p><strong>Rotom</strong>: Rotom resists Silvally-Poison's STAB Multi-Attack and can threaten it back with its STAB moves or a burn with Will-O-Wisp. However, sets without Choice Scarf get outspeed by Silvally-Poison and are quickly put in range of a +1 Surf.</p> <p><strong>Qwilfish</strong>: If Silvally-Poison isn't running Thunderbolt, it gets hard walled by Qwilfish, which can cripple it with paralysis and chip it down with Rocky Helmet damage.</p> <p><strong>Rock-types</strong>: If Silvally-Poison doesn't carry Surf, it can't significantly damage Coalossal and risks a Flame Body burn with its contact moves. On the other hand, if it does not have Thunderbolt, it struggles with Kabutops, which can hit it hard.</p> <p><strong>Mixed Walls</strong>: Very bulky Pokemon like Altaria, Miltank, and Uxie can stomach Silvally-Poison's hits and heavily damage it with their repeated attacks, even if Silvally-Poison can break through them after several boosts.</p> <p><strong>Steel-types: If Silvally-Poison isn't using Flamethrower, it can't really deal damage to Perrserker and Klinklang, and they can significantly weaken it with their powerful STAB moves.</p> <p><strong>Faster Attackers: Pokemon like Cinccino, Alolan Persian, and Rapidash outspeed Silvally-Poison and can 2HKO it while avoiding an OHKO from it.</p> ",
    "sets": [
      {
        "name": "Work Up",
        "description": "<p>Work Up Silvally-Poison is a powerful mixed attacker thanks to its great bulk and coveted Poison typing, which let it take advantage of common threats like Eldegoss, Alcremie, and Thwackey. Flamethrower lets Silvally-Poison 2HKO Tangela and OHKO Steel-types like Perrserker and Klinklang after a boost. Thunderbolt is an alternative for massive damage to Qwilfish, Kabutops, and Cramorant, the former resisting every other move Silvally-Poison commonly runs. Surf removes Ground- and Rock-types like Piloswine, Rhydon, and Coalossal after chip damage, as well as beating Rapidash without risking a burn from Flame Body.</p> <p>Since Silvally-Poison misses a lot of OHKOs after a Work Up, it works better as a mid- or late-game wallbreaker, so it appreciates early-game wallbreakers like Black Belt Sawk and Thwackey weakening walls and removing their items with Knock Off. Rotom formes make for great partners, weakening Ground-types with Will-O-Wisp and their secondary STAB moves so Silvally-Poison can OHKO them later with Surf. Furthermore, most Electric-types like Rotom, Stunfisk, and Manectric can force in Grass-types like Thwackey, Eldegoss, and Tangela for Silvally-Poison to take advantage of. That said, Eldegoss and Tangela can put it to sleep with Sleep Powder on the switch, so Silvally-Poison should be careful setting up versus them. These Electric-types also take care of Steel-types for Silvally-Poison. Defensive pivots like Wishiwashi, Clefairy, and Tangela are appreciated to switch into revenge killers like Cinccino and Choice Scarf Sawk or defensive checks like Stunfisk and Miltank, in addition to providing it switch-in opportunities.</p> "
      },
      {
        "name": "Defog",
        "description": "<p>Silvally-Poison makes a good pivot with its great bulk and useful set of resistances letting it check attackers like Sawk and Thwackey. It is also one of the few Pokemon packing both a pivoting move and entry hazard removal, bringing great role compression. Surf lets it threaten common hazard setters such as Rhydon, Piloswine, and Coalossal, while Thunderbolt hits Qwilfish, another premier Spikes setter.</p> <p>Silvally-Poison's key defensive utility, along with its pivoting, makes it a premier choice for VoltTurn teams. As a result, other staples of this archetype like Wishiwashi, Rotom, and Basculin make for great partners to consistently chip the opposing team. Thwackey is a particularly noticeable partner, forcing in Grass-types such as Eldegoss and Tangela, which Silvally-Poison takes advantage of, and providing Grassy Terrain support, negating Silvally-Poison's weakness to Earthquake and providing it passive recovery. Wallbreakers such as Thievul, Arctovish, and Jynx love getting safe switch-in opportunities from pivoting moves, and Silvally-Poison can switch into their checks like Sawk and Thwackey.</p> "
      },
      {
        "name": "Swords Dance",
        "description": "<p>Swords Dance Silvally-Poison doubles up as an offensive pivot and late-game cleaner. U-turn allows it to generate momentum and chip its checks like Rhydon and Alolan Persian early-game. Flame Charge lets it outspeed common Choice Scarf users like Sawk and Rotom, and it also provides coverage for Steel-types like Perrserker and Klinklang.</p> <p>This set fits better on offensive teams due to how immediately threatening it is. It appreciates Pokemon able to take advantage of Rock-, Ground-, and Steel-types such as Thwackey, Basculin, and Sawk, which help it sweep late-game, while they enjoy Silvally-Poison forcing these checks in. Offensive pivots like Rotom, Articuno, and Cinccino make for great partners, forming VoltTurn cores with Silvally-Poison. Thievul is a noticeable partner that can heavily weaken physically bulky foes like Rhydon and Miltank, opening the way for a Silvally-Poison sweep, while in return Silvally-Poison can take advantage of the Fighting- and Fairy-types such as Sawk and Alcremie that Thievul forces in.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 226429, "username": "Jett"}, {"user_id": 231074, "username": "Ho3nConfirm3d"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 369076, "username": "Tuthur"}]}
  },
  "Silvally-Psychic": {"sets": [{"name": "Swords Dance"}]},
  "Silvally-Water": {"sets": [{"name": "Special Attacker"}]},
  "Thwackey": {
    "comments": "<h1>Other Options</h1> <p>Drain Punch is an option on Swords Dance sets,super effectively hitting Steel-types like Perrserker and Klinklang as well as Sap Sipper Bouffalant and Miltank. However, due to its low Base Power and the importance of Knock Off and U-turn for Thwackey's offensive pivot role, it is often not worth using. Terrain Extender is an option if paired with other Grassy Glide users like Flapple, Trevenant, and Gourgeist-S. However, teams built around Grassy Terrain are quite bad due to having few other ways to maximize the Terrain.</p> <h1>Checks and Counters</h1> <p><strong>Poison-types: The likes of Silvally-Poison, Skuntank, and Golbat resist Thwackey's STAB moves and U-turn and can take it out with their super effective STAB moves. However, the last one dislikes losing its Eviolite to Knock Off.</p> <p><strong>Fire-types: Fire-types like Rapidash and Ninetales outspeed and OHKO Thwackey with their super effective STAB moves. They also resist Thwackey's STAB moves and U-turn, even if they dislike switching into Knock Off. Due to Rapidash and Coalossal's ability in Flame Body, Thwackey is deterred from coming in and using U-turn, even if Coalossal doesn't resist its STAB moves.</p> <p><strong>Defensive Grass-types: Bulky Grass-types like Tangela, Eldegoss, and Appletun can take Thwackey's STAB moves. However, U-turn hits them quite hard. Additionally, Tangela dislikes losing its Eviolite to Knock Off, as this jeopardizes its ability to handle other physical attackers like Sawk and Silvally-Dark. Some bulky Grass-types like Gourgeist formes and Shiinotic don't mind U-turn as much but are less common, and Gourgeist-S must watch out for Knock Off instead.</p> <p><strong>Flying-types: Pokemon such as Articuno, Rotom-S, and Altaria can sponge Thwackey's STAB moves, resist U-turn, and retaliate with their super effective STAB moves, take advantage of it with Defog, or use their own pivoting moves.</p> <p><strong>Steel-types: Perrserker and Klinklang resist Thwackey's STAB moves and U-turn while sporting decent physical bulk, meaning they can comfortably switch into Thwackey and threaten it with their powerful STAB moves.</p> <p><strong>Sap Sipper</strong>: While quite scarce in the current metagame, Sap Sipper Bouffalant and Miltank are immune to Thwackey's STAB moves, making it very hard for it to clean late-game with Grassy Glide.</p> ",
    "sets": [
      {
        "name": "Choice Band",
        "description": "<p>Choice Band Thwackey is a versatile physical attacker, able to wallbreak, clean, and bring utility. Thanks to its Grassy Terrain, Grassy Glide is an amazing priority move that can OHKO faster offensive threats like Cinccino and Choice Scarf Rotom, as well as cleaning weakened teams. Grassy Terrain also makes Wood Hammer extremely hard to switch into, 2HKOing defensive behemoths like Uxie and Thick Fat Miltank, as well as common Grass-resistant Pokemon like Skuntank and Frosmoth. U-turn lets Thwackey weaken its checks like Skuntank, Eldegoss, and Rotom-S while keeping momentum. Knock Off removes Thwackey's checks' items, like Eviolite from Tangela and Golbat and Heavy-Duty Boots from Articuno, Altaria, and Rapidash, jeopardizing their ability to come on Thwackey's STAB moves. Additionally, it provides reliable coverage for Gourgeist formes, notably always OHKOing standard Gourgeist-S after Stealth Rock.</p> <p>This set pairs well in offensive teams with other VoltTurn users, from offensive ones like Perrserker, Morpeko, Rotom, and Silvally-Poison to defensive ones like Uxie, Rotom-S, and Wishiwashi. The resulting cores appreciate entry hazard support to further weaken teams and make up for Grassy Terrain's passive recovery, especially since Thwackey removes Heavy-Duty Boots from common users with Knock Off. Therefore, the likes of Qwilfish and Coalossal make for great partners, also handling some Thwackey checks like Unfezant and appreciating the Earthquake damage reduction from Grassy Terrain. Special wallbreakers like Thievul, Jynx, and Skuntank enjoy Thwackey creating switch-in opportunities with U-turn on the likes of Tangela, Altaria, and Gourgeist formes. Alternatively, Thwackey works well in physical spam teams with the likes of Sawk, Silvally formes, and Kangaskhan, since it can heavily cripple and damage physical behemoths like Tangela, Uxie, and Miltank.</p> "
      },
      {
        "name": "Swords Dance",
        "description": "<p>Wielding an Eviolite, Thwackey has the bulk to perform several roles during the game. Swords Dance enables it to clean late-game with its STAB priority Grassy Glide, which is also quite useful mid-game to revenge kill weakened foes like Silvally formes, Sawk, and Rotom. Knock Off and U-turn let Thwackey be an early-game pivot, crippling checks like Tangela, Articuno, and Rapidash and keeping momentum with U-turn. However, the latter can punish Thwackey thanks to Flame Body. U-turn + Swords Dance allows Thwackey to take advantage of bulky Regenerator Grass-types in Tangela and Eldegoss, consistently threatening and weakening them.</p> <p>Swords Dance Thwackey fits well in balance and bulky offense teams looking for an a secondary revenge killer, late-game cleaner, and check to Rhydon and Rotom. Entry hazard setters including Coalossal, Rhydon, and Qwilfish appreciate the passive recovery from Grassy Terrain and it weakening Earthquake from Kangaskhan and Sawk. In return, they can check some of Thwackey's checks such as Altaria, Rapidash, and Skuntank. Other pivots like Wishiwashi, Rotom, and Silvally formes are also great to form VoltTurn cores with Thwackey, pivoting on each others' checks. Special wallbreakers such as Thievul, Jynx, and Skuntank enjoy Thwackey bringing them safely on the field versus physical walls such as Altaria and Tangela. Other physical wallbreakers such as Swords Dance Silvally formes, especially Poison, appreciate Thwackey removing Tangela's Eviolite, and in return they can weaken physical walls, opening the way for a Thwackey sweep.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 226429, "username": "Jett"}, {"user_id": 240237, "username": "kay"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 369076, "username": "Tuthur"}]}
  },
  "Thievul": {
    "comments": "<h1>Other Options</h1> <p>Thievul can be ran on Electric Terrain teams with Electric Seed, although the archetype isn't very effective. Thievul can use the combination of Throat Spray + Snarl or Sitrus Berry + Substitute to activate Unburden; however, these sets need several turns to set up and are often not worth using. Hyper Beam is Thievul's strongest move and an option on both sets to nuke Dark- and Fairy-types such as Silvally-Dark and Alcremie, but it is exploitable and gives the foe a free turn, and Thievul can outspeed and 2HKO most of these threats with its other moves. A Timid nature can be used on the Choice Specs set to give Thievul a better matchup against more offensive teams; however, a Modest nature lets Thievul break through special walls like Throh, Eviolite-less Clefairy, and Wishiwashi with a boost from Stakeout.</p> <h1>Checks and Counters</h1> <p><strong>Fairy-types: Thanks to their great special bulk and resistance to Thievul's STAB moves, Fairy-types such as Carbink, Alcremie, and Clefairy easily wall Thievul, even if non-specially defensive variants of them have to watch out for Stakeout-boosted Psychic.</p> <p><strong>Dark-types: Dark-types such as Skuntank, Silvally-Dark, and Shiftry tank Dark Pulse and Psychic and threaten Thievul. However, they aren't extremely reliable, as they still take heavy damage from Stakeout-boosted moves and Nasty Plot-boosted Burning Jealousy.</p> <p><strong>Fighting-types: Without a Stakeout or Nasty Plot boost, Thievul fails to OHKO Fighting-types such as Poliwrath, Gurdurr, and Throh, which can take it out.</p> <p><strong>Faster Attackers: Due to its mediocre bulk, Choice Specs Thievul is forced out by faster attackers such as Silvally formes, Sawk, and Kangaskhan.</p> <p><strong>Specially Defensive Walls: Without a Stakeout or Nasty Plot boost, specially defensive walls such as Articuno and Wishiwashi can easily wall Thievul. However, Thievul can 2HKO them with its Stakeout- or Nasty Plot-boosted moves, so they have to be played carefully.</p> ",
    "sets": [
      {
        "name": "Choice Specs",
        "description": "<p>Thievul is a deadly wallbreaker thanks to the combination of Choice Specs and Stakeout. Psychic OHKOes Fighting-types such as Sawk, Gurdurr, and Poliwrath with a Stakeout boost and serves as its strongest move for Fairy-types such as Alcremie and Clefairy. Despite its low base power, Burning Jealousy is Thievul's strongest option for Dark-types such as Skuntank, Shiftry, and Alolan Persian and lets Thievul force out Frosmoth. Knock Off is an alternative that cripples Eviolite-reliant walls such as Clefairy and Type: Null, letting Thievul beat them later with its other moves.</p> <p>Thievul works best on offensive teams looking for a very powerful special wallbreaker. Physical wallbreakers such as Basculin, Rapidash, and Silvally formes can force in physical walls such as Qwilfish, Tangela, and Uxie, giving Thievul an opportunity to switch in. These partners can also break through specially defensive Pokemon that give Thievul a hard time, such as Clefairy, Articuno, and Alcremie. Since Fairy-, Dark-, and Fighting-types such as Clefairy, Silvally-Dark, and Sawk threaten Thievul, checks to these types, such as Rapidash, Gurdurr, and Rotom-S, are appreciated. VoltTurn users such as Wishiwashi, Uxie, and Rotom-S create opportunities for Thievul to activate Stakeout. Due to Thievul's average Speed tier, it struggles versus more offensive teams; therefore, fast Pokemon such as Cinccino and Choice Scarf Sawk make for great partners.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 435539, "username": "BloodAce"}, {"user_id": 231074, "username": "S1nn0hC0nfirm3d"}]}, {"name": "Grammar checked by", "members": [{"user_id": 449990, "username": "DC"}]}], "writtenBy": [{"user_id": 369076, "username": "Tuthur"}]}
  },
  "Eldegoss": {
    "comments": "<h1>Other Options</h1> <p>A specially defensive spread lets Eldegoss answer Rotom and special Basculin sets better; however, it comes at the cost of easily switching into Rhydon and Thwackey. Eject Button is an alternative item for more offensive teams that pairs well with Regenerator, providing Eldegoss with a one-time free switch to a teammate while making it Poltergeist-proof. Likewise, Eject Pack paired with Leaf Storm is an alternative; however, it usually doesn't work as well as Eject Button and forces Eldegoss to forgo a standard moveslot for Leaf Storm. Even without an Eject Pack, Leaf Storm is a stronger alternative to Giga Drain; however, Eldegoss's fire power is still mediocre, and the missing added recovery from Giga Drain often jeopardizes Eldegoss's sustainability.</p> <h1>Checks and Counters</h1> <p><strong>Fire-, Flying-, and Poison-types: Fire-, Flying-, and Poison-type Pokemon resist Eldegoss's STAB moves and Pollen Puff, while being able to nail Eldegoss with their super effective STAB moves. This makes the likes of Rapidash, Rotom-S, and Silvally-Poison huge threats to it, even if most of them want to avoid being put to sleep by Sleep Powder.</p> <p><strong>Steel-types: Eldegoss is unable to deal significant damage to Steel-types that can easily break through Eldegoss, such as Perrserker and Klinklang even if they have to be wary of Sleep Powder. However, they can use it as setup fodder if Sleep Powder has already been used.</p> <p><strong>Ice-types: The likes of Abomasnow, Jynx, and Frosmoth can shred off Eldegoss with their powerful super effective STAB moves, even if most of them can't switch into Eldegoss's moves.</p> <p><strong>Strong Attackers: Despite its solid bulk, Eldegoss is 2HKOed by powerful attackers like Choice Band Gourgeist, and Swords Dance Sivally formes. However, Eldegoss can shut most them down with Sleep Powder.</p> <p><strong>Special Walls: Due to Eldegoss's lack of raw power and lack of access to Toxic, special walls like Throh, Articuno, and Clefairy can easily switch into it, even if they dislike getting put to sleep.</p> ",
    "sets": [
      {
        "name": "Mixed Wall",
        "description": "<p>Eldegoss is a premier Rapid Spinner in the ZU metagame, being able to force out common entry hazard setters like Qwilfish lacking Poison Jab, Rhydon, and Stunfisk. Pollen Puff allows Eldegoss to threaten Grass-types that resist Giga Drain such as Tangela, Thwackey, and Appletun. Sleep Powder lets Eldegoss cripple checks like Rapidash, Skuntank, and Articuno that attempt to switch into it. Aromatherapy provides clerical support to Eldagoss's team and also helps Eldegoss handle Will-O-Wisp Rotom. Synthesis is an alternative that lets Eldegoss rely less on Giga Drain and Regenerator to heal but doesn't let Eldegoss beat anything that it doesn't already beat. The combination of Heavy-Duty Boots and Regenerator makes Eldegoss hard to wear down, letting it act as an effective hazard remover the whole game. The Speed investment allows Eldegoss to outspeed Adamant Rhydon, and the rest of the EVs are put into physical bulk to let Eldegoss better take on physical attackers like Morpeko and Alolan Dugtrio.</p> <p>Rapid Spin lets Eldegoss make up from other bulky Grass-types like Tangela and Gourgeist formes, making it better on entry hazard-stacking teams. Due to its average bulk, Eldegoss appreciates being paired with other walls in balance defensive cores; for instance, physical walls like Miltank and Qwilfish and special walls like Throh and Stunfisk that also appreciate Eldegoss's ability to remove entry hazards from the user's side only. Due to its many weaknesses, solid checks to diverse types are required—the aforementioned Qwilfish helps with Steel- and Fire-types, Miltank helps with Fire- and Ice-types, and Stunfisk deals with Poison- and Steel-types. Rapid Spin is valuable for hazard-weak attackers such as Jynx and Unfezant, and in return, they make up for Eldegoss's passivity. Physical wallbreakers such as Perrserker, Silvally formes, and Cinccino also make for great partners, as they are able to force out special walls like Clefairy and Articuno.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 226429, "username": "Jett"}, {"user_id": 231074, "username": "S1nn0hC0nfirm3d"}]}, {"name": "Grammar checked by", "members": [{"user_id": 241023, "username": "Kris"}]}], "writtenBy": [{"user_id": 369076, "username": "Tuthur"}]}
  },
  "Boltund": {"sets": [{"name": "All-Out Attacker"}]},
  "Coalossal": {
    "comments": "<h1>Other Options</h1> <p>Will-O-Wisp allows Coalossal to consistently cripple opposing physical attackers, but it generally has difficulty fitting the move. Overheat is an alternative over Flamethrower, but its low PP and Special Attack drop make it less desirable than Flamethrower. Heat Crash is also a notable alternative, but Coalossal has trouble breaking Tangela with it. Similarly, Stone Edge can be used over Rock Blast, but its low PP and inaccuracy can be exploited by foes like Articuno.</p> <h1>Checks and Counters</h1> <p><strong>Water-types: Coalossal's 4x weakness to Water causes it to be threatened by the plethora of Water-types in ZU, such as Basculin, Qwilfish, and Wishiwashi. However, physical Water-types should be wary of being burned by Flame Body.</p> <p><strong>Ground-type Pokemon and Coverage: Ground-types such as Piloswine, Rhydon, and Galarian Stunfisk are able to exploit Coalossal's 4x weakness to Ground and threaten it with Earthquake, which avoids Flame Body, or set up entry hazards. Physical attackers such as Kangaskhan and Sawk can OHKO Coalossal with Earthquake and not activate Flame Body. Opposing Fire-types like Ninetales and Rapidash often carry Ground-type coverage moves to threaten Coalossal.</p> <p><strong>Fighting-types: Fighting-types like Sawk, Gurdurr, and Poliwrath can threaten Coalossal with their STAB options, although they dislike being burned.</p> <p><strong>Knock Off: Coalossal heavily relies on Heavy-Duty Boots to consistently switch in and remove entry hazards. Losing it, combined with its lack of recovery, allows it to get easily worn down.</p> ",
    "sets": [
      {
        "name": "Specially Defensive",
        "description": "<p>Coalossal finds a distinct niche in ZU as a Spikes setter that provides good defensive utility against common foes such as Frosmoth, Articuno, and Rotom. It can force the aforementioned foes out to set up Spikes or remove entry hazards with Rapid Spin. Stealth Rock can be used if Coalossal is not paired with a Stealth Rock setter or if there is already a Rapid Spin user on the team. Rock Blast allows Coalossal to threaten Substitute users such as Frosmoth and Articuno and entry hazard removers such as Rotom-S and Altaria. Flamethrower lets Coalossal force out Tangela and Perrserker, giving it the opportunity to reliably use Rapid Spin. Flame Body deters physical attackers like Cinccino and Silvally from spamming their STAB moves, and it can potentially cripple threats such as Sawk and physical Basculin in an emergency situation.</p> <p>Coalossal can provide both entry hazard setting and removal for certain bulky offense teams. As Coalossal has 4x weaknesses to both Water and Ground, it is recommended to pair Coalossal with Grass-types such as Tangela and Thwackey. Tangela is also able to tank hits from Fighting-types such as Sawk and Poliwrath, while Thwackey is able to provide passive recovery and reduce damage from Earthquake. Knock Off absorbers such as Uxie and Alolan Persian can preserve Coalossal's Heavy-Duty Boots, letting it consistently pivot in to remove entry hazards; Uxie can also threaten the aforementioned Fighting-types.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 369076, "username": "Tuthur"}, {"user_id": 231074, "username": "S1nn0hC0nfirm3d"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 449990, "username": "DC"}]}
  },
  "Flapple": {
    "comments": "<h1>Other Options</h1> <p>An Adamant nature gives Flapple additional breaking power but leaves it outpaced by the likes of Frosmoth. A Choice Scarf set with a Jolly nature outpaces threats like Cinccino and Basculin, but it is still notably outpaced by Accelgor, faster Choice Scarf users like Sawk, and setup sweepers like +1 Silvally formes.</p> <h1>Checks and Counters</h1> <p><strong>Faster Pokemon: While they can't switch-in directly, faster Pokemon like Rotom-S, Accelgor, and Skuntank are able to outspeed and OHKO Flapple due to its poor bulk and defensive typing.</p> <p><strong>Ice-type Moves: Flapple's 4x weakness to Ice leaves it easily disposed of by faster Ice-types such as Articuno and Cryogonal, while Piloswine is able to OHKO Flapple with its priority Ice Shard. This weakness also leaves it susceptible to Ice-type coverage such as Basculin's Ice Beam.</p> <p><strong>Steel-types: Steel-types such as Klinklang and Perrserker resist both of Flapple's STAB moves.</p> <p><strong>Fairy-types: While Fairy-types such as Alcremie and Clefairy are unable to switch into Grav Apple, they can take advantage of Flapple if it locks itself into Outrage or Sucker Punch.</p> ",
    "sets": [
      {
        "name": "Wallbreaker",
        "description": "<p>Flapple is a devastating wallbreaker thanks to its solid offensive typing in tandem with its Hustle-boosted attacks, allowing it to dismantle defensive cores consisting of Pokemon like Pyukumuku, and Altaria. Grav Apple is Flapple's primary STAB move, with its Defense drop punishing switch-ins, reducing Flapple's reliance on prediction. A mixed Life Orb set with Draco Meteor allows Flapple to bypass Grass-resistant Pokemon and physical walls such as Altaria, Qwilfish, and Tangela. On the the other hand, a Choice Band set with Outrage handles specially bulky Grass-resistant Pokemon like Articuno and Frosmoth. Sucker Punch OHKOes faster offensive threats such as Choice Scarf Rotom as well as picking off Accelgor and Cinccino after some chip damage. Alternatively, Grassy Glide can be used on Grassy Terrain teams, threatening all faster Pokemon that do not resist Grass. Hustle does allow Flapple to 2HKO just about any Pokemon in the metagame, but its accuracy drop, combined with Flapple relying on a drawback-laden Draco Meteor or Outrage to dispatch Grass-resistant Pokemon such as Altaria, makes Flapple somewhat unreliable.</p> <p>Flapple's poor bulk and defensive typing give it few direct switch-in opportunities, so it pairs well with bulky pivots that are able to bring it in safely such as Uxie, Wishiwashi, and Rotom-S. Coalossal and Qwilfish provide Flapple entry hazard support as well as pressuring Fairy-types like Alcremie and Clefairy. Special attackers such as Cramorant and Rotom appreciate Flapple's ability to pressure special walls like Wishiwashi and Stunfisk. In return, Cramorant provides entry hazard removal, while Rotom forms an effective VoltTurn core with Flapple. Ninetales and Rapidash easily handle Ice- and Steel-types like Articuno, Klinklang, and Perrserker that Flapple struggles with, while Flapple can break down their checks such as Altaria and Wishiwashi. Late-game cleaners such as Choice Scarf Sawk and Silvally formes appreciate Flapple's ability to break walls such as Wishiwashi and Pyukumuku. Flapple works well on Grassy Terrain teams, supporting its teammates by threatening conventional Grass-type checks like Altaria.</p> "
      },
      {"name": "Dragon Dance"}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 369076, "username": "Tuthur"}, {"user_id": 296755, "username": "5gen"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}, {"user_id": 240732, "username": "Astra"}]}], "writtenBy": [{"user_id": 435539, "username": "BloodAce"}]}
  },
  "Appletun": {"sets": [{"name": "Substitute Stallbreaker"}, {"name": "Specially Defensive"}]},
  "Cramorant": {
    "comments": "<h1>Other Options</h1> <p>Hurricane is an alternative to Brave Bird that is weaker against Frosmoth, but stronger against physically bulky Pokemon such as Poliwrath and Qwilfish. Substitute synergizes well with Gulp Missile, helping Cramorant reach the range for its Gorging forme; however, it is generally less effective than Cramorant's other moves. An offensive spread of 4 Def / 252 SpA / 252 Spe can be utilized with Hurricane to better offensively pressure foes such as Tangela and Gurdurr.</p> <h1>Checks and Counters</h1> <p><strong>Electric-types: Electric-types like Rotom and Rotom-S can OHKO Cramorant.</p> <p><strong>Strong Attackers: Although they dislike taking damage and a potential paralysis from Gulp Missile, strong attackers such as Silvally-Dark and Kangaskhan are capable of easily KOing Cramorant.</p> <p><strong>Toxic: Toxic from foes like Wishiwashi and Miltank, as residual damage does not activate Gulp Missile.</p> ",
    "sets": [
      {
        "name": "Defog",
        "description": "<p>Cramorant finds a niche in ZU as a Defogger, threatening common entry hazard setters such as Rhydon and Piloswine. Roost is necessary to improve Cramorant's longevity and lets it consistently switch into the likes of Accelgor and Poliwrath. Surf activates Gulp Missile, allowing Cramorant to punish attackers, and can potentially paralyze them if Gulp Missile is activated when it has no more than 50% HP. Brave Bird complements Surf by weakening foes such as Qwilifish and Wishiwashi while ignoring Ice Scales from Frosmoth, letting Cramorant OHKO it; Brave Bird also benefits from Gulp Missile lowering the foe's Defense stat when Cramorant is above 50% HP.</p> <p>Although Cramorant is an effective Defogger, its 4x weakness to Electric makes it susceptible to Rotom formes. Checks to them such as Rhydon and Piloswine are appreciated; Rhydon can also check Kangaskhan. Knock Off absorbers like Silvally formes and Alolan Persian can improve Cramorant's longevity and let it consistently clear entry hazards by keeping Heavy-Duty Boots intact; in return, the former two appreciate Cramorant checking Frosmoth and the latter values it threatening opposing Ground-types. Cramorant's ability to inflict paralysis with Gulp Missile at low HP complements slow wallbreakers like Perrserker and Skuntank and aids them against fast attackers like Cinccino and Sawk. Powerful attackers such as Silk Scarf Kangaskhan, Silvally formes, and Cinccino appreciate Cramorant's Defog letting them consistently switch into battle.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 369076, "username": "Tuthur"}, {"user_id": 296755, "username": "5gen"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 449990, "username": "DC"}]}
  },
  "Hattrem": {
    "comments": "<h1>Other Options</h1> <p>Hattrem has a very wide movepool with options like Aromatherapy, and Calm Mind. However, getting rid off one of the standard moves comes with a lot of opportunity cost and is not advisable.</p> <h1>Checks and Counters</h1> <p><strong>Item Removal</strong>: Hattrem relies on its Eviolite to reliably wall entry hazard setters such as defensive Rhydon and Piloswine and should avoid getting crippled by Knock Off users such as Gurdurr and Sawk.</p> <p><strong>Offensive Entry Hazard Setters: Foes such as Accelgor and offensive Rhydon easily muscle through Hattrem and can set up entry hazards against it, though Rhydon must be aware of Giga Drain.</p> <p><strong>Dark-, Ghost-, and Bug-type Pokemon and Coverage: Pokemon such as Shiftry, Rotom, and Accelgor easily defeat Hattrem with their super effective STAB moves.</p> ",
    "sets": [
      {"name": "Offense Support"},
      {
        "name": "Stall Support",
        "description": "<p>Hattrem is the best user of Magic Bounce in ZU, carving it a niche as a unique form of entry hazard control. Psychic threatens most entry hazard setters, especially Qwilfish. Mystical Fire provides coverage for Rhydon and Piloswine while providing some recovery. Rest is Hattrem's best form of recovery and lets it PP stall entry hazard setters it struggles to defeat with its offensive moves, like Galarian Stunfisk. Sleep Talk prevents Hattrem from being completely passive after using Rest. A physically defensive spread is preferred, as most entry hazard setters are physical attackers.</p> <p>Hattrem fits best on defensive teams that heavily dislike entry hazards. Pokemon that are very susceptible to entry hazards like Alcremie, Cofagrigus, and Golbat enjoy Hattrem consistently keeping entry hazards off the field. A secondary remover such as Articuno, Altaria, or Cramorant is required to handle entry hazard setters like Accelgor and Rhydon, which can break through Hattrem. Solid physical and special walls such as Tangela, Pyukumuku and  Stunfisk are needed, as Hattrem tends to invite in wallbreakers such as Silvally formes, Shiftry, and Rotom due to its average bulk and mediocre offensive presence.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 445642, "username": "Apagogie"}, {"user_id": 231074, "username": "S1nn0hC0nfirm3d"}]}, {"name": "Grammar checked by", "members": [{"user_id": 449990, "username": "DC"}]}], "writtenBy": [{"user_id": 369076, "username": "Tuthur"}]}
  },
  "Perrserker": {
    "comments": "<h1>Other Options</h1> <p>An Assault Vest set capitalizes on Perrserker's resistances and checks Pokemon like Alcremie, Frosmoth, and Appletun more reliably, though Perrserker will miss out on a lot of power.</p> <h1>Checks and Counters</h1> <p><strong>Water-types: Water-types like Poliwrath, Wishiwashi, and Qwilfish don't take much damage from Iron Head and U-turn and can safely switch into Perrserker. The former two can deal massive damage to it with their STAB moves, while the latter can freely set up Spikes or paralyze it with Thunder Wave. However, Poliwrath and Wishiwashi need to be careful of switching into a Choice Band-boosted Close Combat or Seed Bomb, while Qwilfish should be wary of switching into Lash Out.</p> <p><strong>Electric-types: Electric-types like Stunfisk, Rotom formes, Manectric, and Raichu can take advantage of Perrserker's low Speed and special bulk while resisting its STAB move. Stunfisk also deters its pivoting with Static, and the Rotom formes can pivot against it with Volt Switch or burn it with Will-O-Wisp. However, only Stunfisk can reliably switch in repeatedly.</p> <p><strong>Fire-types: Rapidash and Ninetales outspeed and OHKO Perrserker with their Fire-type STAB moves while resisting Perrserker's STAB move. Rapidash also deters it with Flame Body, which can cripple its offensive capabilities. However, both of them can get OHKOed by Choice Band-boosted Close Combat.</p> <p><strong>Fighting-types: A healthy Gurdurr is bulky enough to stomach a Choice-Band boosted Iron Head; it can then retaliate with its STAB moves. While Sawk and Silvally-Fighting cannot directly switch into Perrserker, they outpace and can OHKO it with their STAB moves.</p> <p><strong>Faster Wallbreakers: Pokemon like Alolan Dugtrio, Basculin, and some Silvally formes can outspeed and KO Perrserker with some prior chip damage, though none of them want to directly switch into any of its attacks.</p> ",
    "sets": [
      {
        "name": "Choice Band",
        "description": "<p>Perrserker is a threatening wallbreaker thanks to its powerful Choice Band-boosted Iron Head. Close Combat OHKOes Coalossal and targets Steel-type Pokemon resistant to Iron Head like Klinklang, Galarian Stunfisk, and opposing Perrserker. It also offers strong neutral coverage. U-turn pivots out of Pokemon Perrserker has difficulty breaking through, such as Poliwrath and Gurdurr, while simultaneously chipping them. Lash Out is the preferred last move since it nails Rotom and incoming Qwilfish, which would otherwise wall it completely. Alternatively, Seed Bomb is Perrserker's best option against Poliwrath, Wishiwashi, and Stunfisk, and it avoids the latter from paralyzing it with Static. Tough Claws strengthens all listed moves besides Seed Bomb, making Close Combat a pseudo-secondary STAB move that hits Steel-resistant Pokemon harder, while Steely Spirit boosts Iron Head's power to frightening levels.</p> <p>Perrserker's low Speed and high Attack make it a great slow wallbreaker for VoltTurn teams. Pivots such as Rotom formes, Alolan Persian, Wishiwashi, and Uxie can help it get on the field safely. In return, Perrserker can threaten passive Pokemon like Miltank, Clefairy, and Articuno. Perrserker also gets revenge killed easily by Fire- and Fighting-types like Rapidash, Ninetales, and Sawk, so Pokemon like Wishiwashi, Poliwrath, and Tangela are appreciated to handle them. Clerics such as Miltank and Alcremie can allow Perrserker to pivot more freely against Flame Body and Static Pokemon, like Rapidash, Coalossal, and Stunfisk.</p> "
      },
      {
        "name": "Swords Dance + Substitute",
        "description": "<p>Leftovers Perrserker forgoes Choice Band's immediate power to get more longevity as a wallbreaker. The combination of Substitute and Swords Dance exploits foes that rely on status or utility moves to damage it, such as Tangela, Articuno, and Uxie. Close Combat provides coverage against Steel-types, such as Klinklang, opposing Perrserker, and Galarian Stunfisk. The EV spread allows it to outspeed standard Alcremie while preventing Tangela, Uxie, and non-Flamethrower Altaria from breaking its Substitute.</p> <p>Perrserker should enter the field against Pokemon that cannot affect it much, such as Altaria, Klinklang, and Eldegoss, though it should scout for coverage moves. It should come in through a teammate that has fainted or by pivoting through VoltTurn cores. Examples of such pivots are Wishiwashi, Clefairy, and Rotom formes. Clerics like Altaria and Alcremie allow Perrserker to wallbreak more should it get statused; Altaria is especially notable for covering Perrserker's defensive weaknesses. Physical cleaners, like Sawk and Gourgeist-S, take advantage of Perrserker weakening walls like Clefairy and Altaria to sweep late-game more easily.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 369076, "username": "Tuthur"}, {"user_id": 226429, "username": "Jett"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 543866, "username": "5Dots"}]}
  },
  "Alcremie": {
    "comments": "<h1>Other Options</h1> <p>Alcremie can run a specially defensive set, making good use of its insane special bulk, access to Aromatherapy, and immunity to Taunt; however, this set is usually outclassed by Clefairy, which has Magic Guard and a superior support movepool. Draining Kiss, while far weaker than Dazzling Gleam, makes Alcremie less reliant on Recover. Flame Orb can be used to avoid Toxic without resorting to Rest or Aromatherapy, but the constant chip damage jeopardizes Alcremie's bulk and limits its setup opportunities.</p> <h1>Checks and Counters</h1> <p><strong>Poison-types: Unless Alcremie is carrying a Psychic move, Poison-types like Poison Jab Qwilfish and Silvally-Poison can take on its attacks and retaliate back with their super effective STAB moves. However, passive ones like defensive Qwilfish lacking Poison Jab and Golbat lacking Toxic are usually unable to beat Alcremie, especially Double Dance sets. Skuntank is noteworthy, as its Psychic immunity allows it to handle every Alcremie variant.</p> <p><strong>Steel-types: Steel-types like Perrserker and Klinklang can take an unboosted Mystical Fire from Alcremie and OHKO back with their super effective STAB moves. They can even break through Acid Armor Alcremie by setting up.</p> <p><strong>Fire-types: Fire-types such as Ninetales and Rapidash resist Dazzling Gleam and Mystical Fire. They easily break through Alcremie with their STAB moves or use it as setup fodder.</p> <p><strong>Physical Wallbreakers: Even with maximum Defense investment, Alcremie is unable to take on powerful physical wallbreakers such as Silvally formes, Thwackey, and Cinccino. However, it can easily wall most of them after Acid Armor.</p> <p><strong>Dark-types: Even though Dark-types such as Silvally-Dark and Shiftry are obliterated by Dazzling Gleam, they completely wall Alcremie's Double Dance set thanks to their immunity to Stored Power. They can take advantage of it to set up.</p> ",
    "sets": [
      {
        "name": "Defensive Calm Mind + Recover",
        "description": "<p>Calm Mind Alcremie serves as a physical wall that is able to check foes like Sawk, Shiftry, and Gurdurr thanks to its typing while doubling as a threatening setup sweeper. Mystical Fire threatens Steel-types like Klinklang and Perrserker, which take little damage from Dazzling Gleam, while also heavily damaging Frosmoth. Alternatively, Aromatherapy allows Alcremie to sponge status and break through walls like Toxic Clefairy while also supporting partners that dislike getting statused, such as Miltank, Tangela, and Coalossal. However, without Mystical Fire, Alcremie is unable to beat Steel-types. Aroma Veil provides a Taunt immunity, allowing Alcremie to set up against foes such as Golbat and Qwilfish lacking Poison Jab. Sweet Veil is an option, giving Alcremie an immunity to sleep-inducing moves used by Tangela, Eldegoss, and Jynx.</p> <p>Alcremie fits well on balance and bulky offense teams that appreciate its sweeping potential and defensive utility as a Fairy-type. Ground-types like Piloswine, Rhydon, and Stunfisk threaten Poison-types such as Silvally-Poison and Skuntank. Partners such as Cramorant and Altaria deal with Fire-types such as Rapidash and Ninetales, which can break through Alcremie. Teammates such as Rapidash, Qwilfish, and Manectric, which can check Steel-types, also make for great partners. Strong special wallbreakers such as Basculin, Thievul, and Frosmoth can heavily weaken special walls, putting them in range of Alcremie's attacks. This can be very important if Alcremie is not running Aromatherapy to disregard Toxic from threats such as Clefairy and Wishiwashi.</p> "
      },
      {
        "name": "Double Dance",
        "description": "<p>Double Dance Alcremie is great against stall and balance teams and has the potential to muscle through most teams once Dark-types have been removed. The combination of Calm Mind and Acid Armor bolsters Alcremie's bulk and Stored Power's base power to incredible levels. Stored Power is preferred for its ability to bypass Unaware Pyukumuku. Rest is used over Recover in order to play around Toxic and other status moves. Leftovers provides passive recovery, which is extremely valuable when Alcremie is asleep for two turns. However, Chesto Berry is an alternative that lets Alcremie fully heal once without drawback.</p> <p>Because of Alcremie's inability to hit Dark-types, this set appreciates teammates weakening them. Attackers such as Thievul, Gourgeist-Small, and Shiftry can weaken Dark-types, especially with entry hazard support from setters such as Qwilfish, Piloswine, and Stunfisk. Toxic Spikes from Runerigus and Qwilfish put Dark-types on a timer, although Skuntank is immune to them and some Dark-types like Morpeko run Heavy-Duty Boots. Fighting-types such as Gurdurr, Poliwrath, and Sawk check Dark- and Steel-types for Alcremie. Leftovers variants of Alcremie value having a sturdy defensive core to counteract its passivity and benefits from partners like Tangela and Altaria. Offensive Steel-types, mainly Perrserker and Klinklang, need to removed before Alcremie can sweep; therefore, teammates such as Rapidash and Sawk are appreciated.</p> "
      },
      {
        "name": "Offensive",
        "description": "<p>Offensive Alcremie is the best choice for an offensive Fairy-type. Mystical Fire nails Steel-types like Perrserker and Klinklang and 2HKOes Frosmoth. Psychic destroys Poison-types like Silvally-Poison, Qwilfish, and Golbat, while Calm Mind lets Alcremie break through special walls like Articuno and Clefairy. Heavy-Duty Boots makes it easier for Alcremie to utilize its great defensive typing and switch in against foes like Thievul, Sawk, and Gurdurr, while Life Orb makes Alcremie a better wallbreaker.</p> <p>Dark-types such as Shiftry, Silvally-Dark, and Morpeko enjoy Alcremie's ability to take on Fighting- and Dark-types such as Gurdurr and Alolan Persian. Physical wallbreakers such as Cinccino and Choice Band Basculin can force in physical walls and pivot, providing Alcremie with wallbreaking opportunities, while also threatening special walls such as Clefairy, which can handle Alcremie. Ground-types such as Rhydon, Stunfisk, and Piloswine check Fire- and Poison-types such as Rapidash and Silvally-Poison. Partners such as Qwilfish, Rapidash, and Appletun can also wall problematic Fire-types for Alcremie.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 296755, "username": "5gen"}, {"user_id": 435539, "username": "BloodAce"}]}, {"name": "Grammar checked by", "members": [{"user_id": 449990, "username": "DC"}]}], "writtenBy": [{"user_id": 369076, "username": "Tuthur"}]}
  },
  "Falinks": {"sets": [{"name": "Choice Band"}]},
  "Pincurchin": {"sets": [{"name": "Electric Terrain Setter"}]},
  "Frosmoth": {
    "comments": "<h1>Other Options</h1> <p>Bug Buzz can be used as a secondary STAB move to better damage foes like Uxie, but it is usually not needed; Frosmoth's other coverage moves are better, and having both STAB attacks is less effective due to overlapping resistances. Weather Ball is a good option on weather teams, giving Frosmoth coverage it usually doesn't have access to.</p> <h1>Checks and Counters</h1> <p><strong>Fire-types: Fire-types like Ninetales and Rapidash are the best offensive answer against Frosmoth, easily OHKOing it due to its 4x weakness. Frosmoth will also have to watch out for Pokemon with Fire-type coverage such as Fire Blast Skuntank and Mystical Fire Alcremie.</p> <p><strong>Steel-types: Steel-types like Perrserker and Klinklang can take on most of Frosmoth's attacks and threaten it back with their Steel-type moves.</p> <p><strong>Knock Off: Removing Frosmoth's Heavy-Duty Boots will heavily hinder its ability to sweep, as it will be susceptible to all type of entry hazards, especially Stealth Rock. Passive Pokemon like Clefairy and Tangela may bait in Frosmoth and remove its item.</p> <p><strong>Revenge Killers: Frosmoth's mediocre Speed and lackluster physical bulk make it easy to revenge kill, even at +1, by Choice Scarf users such as Sawk and Gourgeist-S. Priority users like Kangaskhan, Shiftry, and Aqua Jet Basculin are able to revenge kill Frosmoth with minimal chip damage, although none of them can switch into Frosmoth's attacks with ease.</p> ",
    "sets": [
      {
        "name": "Quiver Dance",
        "description": "<p>Frosmoth is a great setup sweeper and offensive presence in the metagame thanks to its strong Special Attack, decent coverage, and access to Quiver Dance. Giga Drain threatens Water-types like Poliwrath and Wishiwashi, doing significant damage after a single boost. Substitute allows Frosmoth to set up on passive Pokemon that relies on status it to wear it down like Clefairy, Uxie, and Pyukumuku. Substitute also makes Frosmoth an excellent stallbreaker. Hurricane is an alternative to deal great damage to Fire-types such as Ninetales and Rapidash. However, without Substitute, Frosmoth has significantly less opportunities to set up and is easier to revenge kill.</p> <p>Frosmoth fits on balance and bulky offense teams that want a setup sweeper and soft check to special attackers such as Rotom. Switch-ins to Fire-types are great partners; Pokemon like Qwilfish and Thick Fat Appletun can switch into Ninetales and Rapidash, respectively. Fighting-types like Gurdurr and Poliwrath can switch into Rock- and Steel-types like Rhydon and Klinklang, while Frosmoth in return can set up on foes like Uxie and Tangela that switch into them. Secondary sweepers like Alcremie and Silvally formes can pressure foes and weaken them for Frosmoth to sweep late-game; they also pressure Frosmoth's checks such as Choice Scarf Sawk and Galarian Stunfisk. Qwilfish can absorb and scout for Knock Off users while setting entry hazards for Frosmoth to sweep.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 296755, "username": "5gen"}, {"user_id": 231074, "username": "S1nn0hc0nfirm3d"}]}, {"name": "Grammar checked by", "members": [{"user_id": 449990, "username": "DC"}, {"user_id": 240732, "username": "Astra"}]}], "writtenBy": [{"user_id": 515439, "username": "AstilCodex"}]}
  },
  "Morpeko": {
    "comments": "<h1>Other Options</h1> <p>Taunt prevents Pokemon such as Uxie and Miltank from setting entry hazards and foes such as Altaria and Rotom-S from recovering health or using Defog. Life Orb grants Morpeko the freedom to switch between its moves, but the recoil can bring it in range of priority moves such as Basculin's Aqua Jet. Also, the decrease in damage output compared to Choice Band leaves Morpeko unable to reliably 2HKO Pokemon such as Altaria.</p> <h1>Checks and Counters</h1> <p><strong>Ground-types: Bulky Ground-types such as Piloswine, Rhydon, and Stunfisk are able to take most of Morpeko's attacks and force it out. However, they need to be healthy enough to tank a hit from Aura Wheel in Hangry Mode.</p> <p><strong>Grass-types: Defensive Grass-types such as Tangela, Eldegoss, and Appletun are able to take a hit from Morpeko and either cripple it with status or force it out.</p> <p><strong>Physically Defensive Walls: While they are unable to switch into Choice Band Aura Wheel, Morpeko struggles to break through physical walls such as Miltank and Altaria. Other physically bulky Pokemon such as Colbur Berry Cofagrigus and physically defensive Alcremie are able to withstand an attack and OHKO Morpeko.</p> <p><strong>Revenge Killers: Morpeko is susceptible to revenge killers, especially priority users, due to its poor bulk. Priority users such as Kangaskan, Gurdurr, and Basculin are to pick it off after it is weakened, while certain Choice Scarf users such as Sawk and Silvally are able to revenge kill Morpeko if it lacks a Speed boost.</p> ",
    "sets": [
      {
        "name": "Choice Band",
        "description": "<p>Choice Band Morpeko is a unique offensive threat thanks to its signature move Aura Wheel and typing giving it a resistance to common revenge killers like Choice Scarf Rotom and Sucker Punch Shiftry. Aura Wheel gives Morpeko +1 Speed after each use, allowing it to outpace offensive threats like Rapidash and Cinccino to clean weakened teams late-game. Crunch provides Morpeko with a reliable Dark-type STAB move, hitting foes such as Gourgeist formes and Rotom. Seed Bomb is Morpeko's best coverage against opposing Ground-types, granting it a 2HKO against Piloswine and Rhydon after Stealth Rock damage.</p> <p>Ground-types are able to play around Aura Wheel and must be eliminated before Morpeko can effectively clean. Water-types such Poliwrath, Qwilfish, and Wishiwashi pair well with Morpeko, as they weaken Ground-types and benefit from Morpeko's ability to pressure Pokemon like Rotom and Articuno. Special attackers like Jynx and Choice Specs Basculin are also able to handle the aforementioned Ground-types and eliminate physically defensive walls such as Acid Armor Alcremie and Tangela. These special attackers also appreciate Morpeko weakening bulky Water-types such as Poliwrath, Pyukumuku, and Wishiwashi.</p> "
      },
      {
        "name": "Offensive Utility",
        "description": "<p>Morpeko holds a niche as a Rapid Spin user on offensive teams, handling some common entry hazard setters such as Uxie and Qwilfish. It also threatens Ghost-types such as Cofagrigus, Rotom, and Gourgeist formes, which other Rapid Spin users such as Coalossal and Eldegross do not do as effectively. However, Morpeko has a poor matchup against other entry hazard setters, especially Ground-types such as Piloswine, Rhydon, and Stunfisk, which limit its effectiveness. Aura Wheel serves as Morpeko's strongest STAB move, hitting foes like Qwilfish, Cramorant, and Articuno in Full Belly Mode and Uxie and Rotom in Hangry Mode. Protect allows Morpeko to safely switch between its Full Belly and Hangry formes while also allowing it to scout moves from Pokemon such as Choice Scarf Sawk. Parting Shot pairs well with the Speed boost provided by Aura Wheel and allows Morpeko to pivot from unfavorable matchups.</p> <p>Morpeko works best on offensive entry hazard stacking teams that appreciate its Rapid Spin and pivot support. Entry hazard setters such as Qwilfish, Coalossal, and Rhydon synergize well with Morpeko, the former checking Fighting-types such as Sawk and Fairy-types such as Clefairy; in return, Morpeko is able to handle foes like Rotom and Cramorant. Piloswine is able to wear down opposing Ground-types like Rhydon and set Stealth Rock. Wallbreakers like Jynx and Flapple appreciate Morpeko luring walls like Tangela and Altaria and bringing them in with Parting Shot. Attackers such as Kangaskan and setup sweepers such as Silvally-Poison enjoy Morpeko's Rapid Spin support.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 231074, "username": "S1nn0hC0nfirm3d"}, {"user_id": 296755, "username": "5gen"}, {"user_id": 369076, "username": "Tuthur"}]}, {"name": "Grammar checked by", "members": [{"user_id": 449990, "username": "DC"}]}], "writtenBy": [{"user_id": 435539, "username": "BloodAce"}]}
  }
}