{
  "Charmander": {"sets": [{"name": "Choice Scarf"}]},
  "Vulpix": {
    "overview": "<p>Thanks to Drought, Vulpix has incredibly strong Fire-type attacks that make it a rather potent offensive pick, threatening several Pokemon such as Ferroseed and Grookey. At 17 Speed, Vulpix is just fast enough to threaten the likes of Vullaby without a Choice Scarf while being rather easy to revenge kill with unboosted Speed. There is an appeal to doubling up on Fire-type attackers with the support of Drought for dedicated wallbreakers, though a shallow movepool leaves Vulpix unable to do much to overcome its own checks and counters. Vulpix is consigned to being a one dimensional wallbreaker, but very few Pokemon can tank hits from the Fire- and Grass-type coverage that it brings to a team.</p> ",
    "comments": "<h1>Other Options</h1> <p>Flame Charge is a nice option on non-Choice item sets for boosting Vulpix's Speed to outspeed the unboosted tier. Eject Pack allows Vulpix to use Overheat and immediately switch out to bring in Diglett to trap the likely Fire-resistant Pokemon on the field. Heat Rock gives additional turns of Sun, turning Vulpix into a niche support Pokemon for unorthodox picks such as Solar Blade Ponyta and Choice Scarf Charmander. This is not generally recommended, though, as these teams end up with large defensive gaps and heavily rely on being able to win with these fast Fire-types. Heavy-Duty Boots allows Vulpix to avoid taking entry hazard damage, but the benefits of Heat Rock often outweigh the advantages of it. Memento can be used in conjunction with a setup sweeper, such as Woobat or Shellder.</p> <h1>Checks and Counters</h1> <p><strong>Bulky Water-types: As Water-types with Recover, Staryu, Mareanie, Shellos, and Frillish are all rather sturdy answers to Vulpix's sun-boosted attacks. Mareanie is particularly resilient owing to its ability Regenerator. Staryu does need to beware Choice Scarf Vulpix hitting it with Energy Ball on the switch, but this is not too troublesome.</p> <p><strong>Ponyta: As the main other Fire-resistant Pokemon in the tier with recovery, Ponyta is a major issue for Vulpix. Drought powers up Ponyta, making it more difficult to switch into while also causing Morning Sun to heal Ponyta for another quarter of its health. Ponyta may run Flash Fire to absorb Fire-type attacks and completely wall Vulpix, though Ponyta is still a sufficient check without it.</p> <p><strong>Priority and Entry Hazards</strong>: Vulpix is frail enough that taking a quarter of its health upon switching in greatly limits its potential. Onix is a common Stealth Rock setter and is able to switch into Vulpix's Fire-type attacks somewhat well. Chip damage in general is how more offensive teams will overcome Vulpix generally, as Fake Out or Sucker Punch with entry hazards up is enough to keep Vulpix from cleaning up teams throughout the game.</p> ",
    "sets": [
      {
        "name": "Choice Item",
        "description": "<h1>Moves</h1> <p>Weather Ball is Vulpix's strongest accurate STAB move when sun is up, but it requires sun to actually be useful. Overheat is incredibly strong and can be used to break through several Pokemon, such as scoring the OHKO on Vullaby. Energy Ball is chiefly for Onix and Staryu and the only coverage option worth running. Hypnosis allows for Vulpix to try to put a Pokemon to sleep on a forced switch, which can be valuable when facing teams with Mareanie or Ponyta. Fire Blast is a powerful attack, but it should be used in situations where you do not want to be locked into Overheat or Weather Ball, such as sun disappearing or having the need to switch out. That being said, running three Fire-type attacks can be cumbersome.</p> <h1>Set Details</h1> <p>The EV spread simply makes Vulpix as fast and powerful as possible. With a Timid nature, Vulpix reaches 17 Speed, outspeeding Vullaby and Speed tying with Mienfoo. The remaining EVs go into HP in order to give Vulpix one more switch into Stealth Rock. With Choice Scarf, Vulpix becomes one of the better revenge killers in the tier, outspeeding Dragon Dance Scraggy and Choice Scarf Pawniard. Choice Scarf also allows Vulpix to assume the role of a late-game cleaner. Choice Specs instead doubles down on Vulpix's threatening Fire-type attacks in order to make it a ferocious wallbreaker.</p> <h1>Usage Tips</h1> <p>Vulpix is too frail to switchin on any neutral attack and is weak to entry hazards, which consequently means that getting it into play is a challenge. Intelligent double switches or pivoting moves such as U-turn are key components to getting Vulpix in. From there, it is often as straightforward as using the appropriate Fire-type attack while occasionally using Energy Ball to catch Staryu or Onix on the switch. Vulpix can also catch common switch-ins, such as Ponyta and Mareanie, and cripple them severely with Hypnosis. Do be mindful of Drought turns, as Vulpix without sun in play is no threat at all. Vulpix is easily threatened by all faster Pokemon and priority attacks and therefore should usually be switching out of these matchups.</p> <h1>Team Options</h1> <p>Vulpix's success is determinant on coming in safely, making bulky Mienfoo one of the best partners for it available in the tier, as it can cripple Mareanie with Knock Off and force Onix out. Due to its ability to trap and remove all of the hard stops to Vulpix available in the tier, such as Ponyta and Mareanie, Diglett is often a very important teammate. Hazard removal is absolutely necessary, leading Vullaby and Staryu to be highly recommended teammates. As Vulpix will struggle with opposing Water-types and make great use of Stealth Rock, Ferroseed is highly recommended. Pawniard assists with Stealth Rock and Knock Off support as a more offensive option. Ponyta and Choice Scarf Charmander pair with Vulpix well, as they both are capable attackers with sun support. Choice Specs Vulpix specifically does well with Thunder Wave support, making Slowpoke and Porygon worthy teammates as well.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 32350, "username": "KSG"}, {"user_id": 255030, "username": "San Tomas"}, {"user_id": 449990, "username": "DC"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Estronic"}]}], "writtenBy": [{"user_id": 208173, "username": "Fiend"}, {"user_id": 150971, "username": "Coconut"}]}
  },
  "Oddish": {"sets": [{"name": "Defensive"}]},
  "Diglett": {
    "overview": "<p>Diglett is one of the most important forces in the metagame because it reliably revenge kills key threats with Arena Trap and has an LC-best Speed tier. Diglett has excellent synergy with the tier's premier U-turn users, Mienfoo and Vullaby, and can pick apart teams with the help of their pivoting. It checks strong, speedy offensive threats like Ponyta and Abra as well as defensive cornerstones like Onix, Pawniard, and Mareanie. In spite of its somewhat low stats and limited movepool, Diglett is quite versatile and can be tailored in response to what foes its team needs trapped. However, Diglett is only moderately powerful, and it can sometimes struggle to make an impact against the staples of bulky teams like Ferroseed, Foongus, and Timburr. It is also extremely frail and has limited opportunities to reach the battlefield intact, requiring clever pivoting and switching to reach its full potential.</p> ",
    "comments": "<h1>Other Options</h1> <p>Choice Scarf Diglett is an option that can revenge kill extremely fast threats like Choice Scarf users, Speed-boosted Ponyta and Staryu, and opposing Diglett. Air Balloon is a niche item to beat Sticky Web teams and opposing Arena Trap users while having some utility against Onix as well. Focus Sash is an option to make Diglett a dedicated lead on hyper offense teams and set Stealth Rock, but it is unreliable because of the variability of lead matchups and the prevalence of entry hazards. Protect is an option to block Mienfoo's Fake Out and High Jump Kick, and it is especially useful on Air Balloon sets seeking to preserve their item.</p> <h1>Checks and Counters</h1> <p><strong>Arena Trap Users: Opposing Diglett and Trapinch are often the most effective counters to Diglett, as they each trap and KO it. Trapinch can either pick off a weakened Diglett with First Impression or survive most hits and OHKO even Eviolite Diglett with Earthquake, while opposing Choice Scarf and Air Balloon Diglett can revenge kill Diglett without worrying about losing a Speed tie and being KOed by Earthquake. Trace Porygon is an unorthodox Arena Trap user that can tank hits from Diglett with its great bulk and KO it in return. However, all of these trappers cannot stop Air Balloon Diglett from switching out from them.</p> <p><strong>Grookey: Grookey's Grassy Terrain weakens Earthquake, making it difficult for Diglett to deal damage and successfully trap targets like Mareanie and Pawniard that are at full health, and Grookey can easily KO Diglett with priority Grassy Glide. Grookey also resists Earthquake and can set up with Swords Dance or generate momentum with Knock Off and U-turn. Diglett can circumvent Grassy Terrain by running Earth Power.</p> <p><strong>Setup Sweepers: Setup sweepers like Scraggy, Agility Porygon, and Nasty Plot Vullaby can take advantage of Diglett's relative inability to threaten them to boost and sweep. Diglett can weaken these threats by slowing them down with Rock Tomb or sacrificing itself with Final Gambit to put them in the range of priority attacks.</p> ",
    "sets": [
      {
        "name": "Eviolite",
        "description": "<h1>Moves</h1> <p>Earthquake is Diglett's strongest move and deals major damage to its main trapping targets like Ponyta, Pawniard, and Mareanie. Final Gambit allows you to effectively trade Diglett for an opposing threat like Staryu or Nasty Plot Vullaby or get major chip damage on a defensive anchor like Ferroseed. Beat Up reliably KOes Focus Sash Abra with five hits and also hits Natu and Galarian Ponyta hard. Earth Power allows Diglett to bypass Onix's Weak Armor to safely 2HKO it and function while Grookey's Grassy Terrain is up. Earth Power also lets Diglett safely 2HKO Mareanie without fearing a Scald burn. Sucker Punch is fairly weak but can be run on teams that need priority. Stealth Rock is an option on hyper offense teams that cannot afford to run a traditional entry hazard setter. Rock Tomb is a niche option that can prevent Scraggy from setting up effectively.</p> <h1>Set Details</h1> <p>The given HP investment allows Diglett to OHKO offensive Staryu from full health with Final Gambit. Maximum Speed investment and a Jolly nature allow Diglett to hit 20 Speed and outpace the entire unboosted metagame. The remaining EVs are placed in Attack to boost Diglett's damage output. Eviolite bolsters Diglett's meager bulk enough to survive one hit from certain Pokemon it likes to trap such as Onix and Mareanie, allowing it to safely 2HKO them or switch into them while at full health and revenge kill them. Eviolite also allows Diglett to switch into and survive Focus Sash Abra's Psychic and to almost always survive Analytic Magnemite's Flash Cannon after Stealth Rock.</p> <h1>Usage Tips</h1> <p>Diglett should be used to trap and KO key Pokemon for its teammates. Eviolite Diglett is most useful when its health is tactically preserved so that it remains able to deal with its main targets, as it lacks the power to OHKO many of them. Due to its modest bulk, it can afford to switch into a Mareanie or Onix that has had its Eviolite removed with Knock Off and then KO it. Final Gambit should be used to heavily damage bulky Pokemon lacking reliable recovery like Ferroseed when Diglett no longer has targets to trap, and it can also be deployed to weaken Nasty Plot Vullaby, which may try to set up on Diglett. Be wary of KOing a foe with Diglett when you still need it, especially if your opponent has a Trapinch or Diglett of their own, as each can trap and revenge kill Diglett before its role is fulfilled.</p> <h1>Team Options</h1> <p>Eviolite Diglett works best on teams that need it to deal with Mareanie or need its combination of high Speed and the ability to trap Weak Armor Onix. Mienfoo is an exceptional partner because it can lure in Mareanie and pivot into Diglett with U-turn. Timburr and Ponyta also appreciate Diglett trapping Mareanie, while Vullaby and Ponyta benefit from it trapping Onix. Nasty Plot Vullaby especially appreciates Diglett's ability to deter and trap would-be checks like Onix and Magnemite. Abra and Galarian Ponyta enjoy Diglett trapping Pawniard. Fighting-types and setup sweepers appreciate Diglett trapping Focus Sash Abra.</p> "
      },
      {
        "name": "Life Orb",
        "description": "<h1>Moves</h1> <p>Earthquake is Diglett's most powerful move, dealing heavy damage to neutral targets and Onix and almost always OHKOing standard Pawniard, Mareanie, and Ponyta. Substitute allows Diglett to elude Sucker Punch from Pawniard and safely KO it, as Adamant Pawniard would otherwise OHKO it. Beat Up is the most reliable option to trap Abra, KOing Focus Sash variants with four hits, and it also deals heavy damage to Galarian Ponyta. Rock Slide threatens Vullaby, often OHKOing it after Stealth Rock. Sucker Punch can be useful for revenge killing Choice Scarf users like Vulpix and Porygon while providing the team with a moderately strong priority move. Memento can be run to create an opportunity for a setup sweeper, like Nasty Plot Vullaby, especially if Diglett has no obvious targets to trap in a match.</p> <h1>Set Details</h1> <p>Maximum Attack investment is crucial for Diglett to reliably KO Pawniard, Mareanie, and Ponyta with their Eviolites intact, while maximum Speed investment and a Jolly nature allow it to outspeed the entire unboosted metagame and revenge kill speedy threats like Ponyta, Abra, and Staryu. Life Orb enables Diglett to get crucial KOs and makes its middling Attack stat respectable.</p> <h1>Usage Tips</h1> <p>Diglett should be used to trap and KO Pokemon that its teammates cannot easily deal with. This set's power can let Diglett trap unusually bulky targets after they have been weakened or lost their Eviolites, such as Mienfoo and Foongus. Life Orb Diglett is extremely frail and must be deployed carefully to eliminate its required targets before being KOed. Diglett benefits from pivoting that lets it switch into targets unscathed. Additionally, it rewards aggressive double switches and predictions made after its targets are brought in to deal with other threats, which generates major offensive pressure. You should be careful not to leave Diglett exposed to being trapped by Trapinch or opposing Diglett before it has removed its main target.</p> <h1>Team Options</h1> <p>Life Orb Diglett works best on teams that need its offensive presence and ability to trap and OHKO its frequent targets. Diglett has excellent synergy with pivots that can bait in targets like Onix, Pawniard, and Mareanie and give it a free switch, like Mienfoo and Vullaby. Vullaby in turn appreciates Diglett trapping and KOing Flying-resistant Pokemon like Pawniard and Onix, and Mienfoo appreciates it removing Mareanie. Other Fighting-types like Timburr and Fire-types like Ponyta similarly take advantage of Mareanie's removal. Mareanie can take hits from priority users that try to revenge kill Diglett like Timburr and Corphish while benefiting from Diglett's ability to trap Abra and Magnemite. Abra and Wingull appreciate Diglett trapping Pawniard.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 420389, "username": "Stoward"}, {"user_id": 195129, "username": "Nineage"}, {"user_id": 449990, "username": "DC"}]}, {"name": "Grammar checked by", "members": [{"user_id": 449990, "username": "DC"}, {"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 32350, "username": "KSG"}]}
  },
  "Meowth": {"sets": [{"name": "All out Attacker"}]},
  "Abra": {"sets": [{"name": "Focus Sash"}, {"name": "Life Orb"}]},
  "Tentacool": {"sets": [{"name": "Defensive Utility"}]},
  "Ponyta": {
    "overview": "<p>Ponyta is a great offensive Pokemon thanks to its versatility, bulk, and high Speed stat allowing it to outpace most of the unboosted metagame and dent most teams. It also has great coverage options in High Horsepower and Wild Charge, can use Flame Charge to outpace Diglett and most Choice Scarf users, and has utility options like Will-O-Wisp and Morning Sun. Furthermore, its ability Flame Body gives a chance to cripple physical attackers like Mienfoo, Vullaby, and Pawniard. However, Ponyta's weakness to entry hazards, especially Stealth Rock, makes it easier to wear down. Ponyta suffers from trappers such as Diglett and Trapinch, as Diglett traps, outpaces, and revenge kills non-Flame Charge Ponyta while Trapinch can take care of Ponyta at the cost of most of its health.</p> ",
    "comments": "<h1>Other Options</h1> <p>Sunny Day + Solar Blade can be used in order to lure in and take out Water-types such as Staryu and Ground-types such as Onix; however, the turn needed to set up Sunny Day makes this unreliable. Sunny Day can be run on a Sticky Web team over Will-O-Wisp to make Ponyta a more dangerous sweeper with Flare Blitz; however, when not on Sticky Web teams, it is very hard to justify using. Ponyta can run Flash Fire for Vulpix, but this lets Trace Porygon beat it.</p> <h1>Checks and Counters</h1> <p><strong>Water-types: Pokemon like Staryu, Wingull, and Mareanie take care of Ponyta with Scald.</p> <p><strong>Earthquake: Onix, Archen, Tyrunt, and Mudbray can give Ponyta trouble due to Earthquake OHKOing it. Weak Armor Onix can outpace Ponyta after coming in on Flare Blitz and take care of it with Earthquake.</p> <p><strong>Trappers: Diglett revenge kills Ponyta. Trapinch can also trap Ponyta and take care of it with Earthquake, but only at the cost of much of its health.</p> <p><strong>Porygon: Porygon gives Ponyta trouble due to its high bulk withstanding Ponyta's attacks and Tri Attack or Thunder Wave doing major damage to Ponyta or slowing it down.</p> ",
    "sets": [
      {
        "name": "Eviolite",
        "description": "<h1>Moves</h1> <p>Flare Blitz does decent damage to any Pokemon that does not resist it and takes care of Steel- and Grass-types such as Pawniard, Ferroseed, and Foongus. High Horsepower is able to hit common switch-ins to Ponyta super effectively, like Mareanie and Onix. Flame Charge can be run over High Horsepower or Will-O-Wisp to avoid being trapped by Diglett after a KOing a Pokemon. Alternatively, Wild Charge gives Ponyta a way to hit Water-types such as Wingull, Staryu, and Mareanie. Will-O-Wisp cripples physical attackers such as Pawniard, Trapinch, Mienfoo, and Onix. Morning Sun allows Ponyta to keep itself healthy and outlast a burned Trapinch's Earthquake. Though not as useful as the listed moves, Toxic can be used to cripple bulky walls like Porygon and Spritzee.</p> <h1>Set Details</h1> <p>Ponyta runs 196 Speed EVs to outpace Onix and Mienfoo and Speed tie Wingull, Staryu, and Abra. 76 Attack EVs make Ponyta's attacks a bit stronger. 156 Defense EVs with Eviolite make Ponyta able to take physical attacks from Mienfoo, Pawniard, Vullaby, and a burned Onix. Flame Body gives Ponyta a chance to burn physical attackers such as Mienfoo and Vullaby when they use contact moves.</p> <h1>Usage Tips</h1> <p>Be wary about leaving Ponyta in or double switching to it if the opponent has a Diglett, because it can trap Ponyta and take care of it. Use Ponyta early-game to status Pokemon and cripple physical foes like Mienfoo and Trapinch with Will-O-Wisp. However, be wary about using Will-O-Wisp on Timburr, as Guts variants can use the Attack boost to KO Ponyta. Switch Ponyta into contact moves like Pawniard's Iron Head and Mienfoo's Fake Out to try to get a burn from Flame Body. Ponyta can also switch into predicted attacks from Spritzee, Ferroseed, and Foongus, as their attacks do not do much to it, and it can use the opportunity to do major damage to these with Flare Blitz or predict a switch and use High Horsepower or Will-O-Wisp. Make sure that entry hazards are not on the field before Ponyta tries to switch in, as they will cripple it. Use High Horsepower on a predicted switch to Onix or Mareanie. If running Flame Charge, use it on a predicted switch or on a weakened Pokemon to avoid Diglett coming in, trapping Ponyta, and taking care of it with Earthquake.</p> <h1>Team Options</h1> <p>Grass-types such as Foongus, Grookey, and Ferroseed are good to pair with Ponyta because they check Ground- and Water-types like Onix, Mudbray, and Staryu. Foongus can also use Spore to force switches and sponges attacks from Mienfoo, while Grookey provides passive recovery with Grassy Terrain. Ferroseed can use Thunder Wave to cripple Vullaby and opposing Ponyta that switch into Ponyta or use Knock Off to make it easier for Ponyta to KO them. Stealth Rock and Spikes setters like Onix and Ferroseed help Ponyta sweep late-game. Onix's Rock / Ground typing is especially useful to check Vullaby and opposing Ponyta; Ferroseed is able to come in on Water-type attacks from Staryu. Defog and Rapid Spin users such as Timburr, Vullaby, and Staryu remove Stealth Rock, which greatly hinders Ponyta from freely switching in; Vullaby and Timburr can also use Knock Off to soften Pokemon like Mareanie and Mienfoo, and Vullaby can also threaten Timburr and Mienfoo with its Flying STAB moves. Staryu can also take care of Mudbray and Onix with its Water STAB moves and has Thunderbolt to help with opposing Water-types like Mareanie and opposing Staryu. Trapinch traps Pokemon that usually check Ponyta, like Onix and Diglett, while Trace Porygon is a great option to counter-trap Trapinch and Diglett, making it easier for Ponyta to drop Flame Charge in favor of one of its coverage moves.</p> "
      },
      {
        "name": "Berry Juice",
        "description": "<h1>Moves</h1> <p>Flare Blitz is the main way to do damage and can take care of Pawniard, Foongus, and Ferroseed. Flame Charge allows Ponyta to outspeed and beat Diglett that try to trap it. High Horsepower hits Mareanie and Onix. Wild Charge is used to let Ponyta better take on Water-types like Staryu, Dewpider, and Wingull. Will-O-Wisp can be used over Wild Charge to cripple physical attackers like Mienfoo, Pawniard, and Trapinch.</p> <h1>Set Details</h1> <p>236 Attack EVs allow Ponyta to wallbreak better. 196 Speed EVs with a Jolly nature make Ponyta outpace Onix and Mienfoo while Speed tying Wingull, Staryu, and Abra. Berry Juice makes Ponyta recover more easily from recoil and Stealth Rock damage, going particularly well with Wild Charge.</p> <h1>Usage Tips</h1> <p>Do not switch Ponyta in on strong attacks like Abra's Psychic and Mienfoo's High Jump Kick, as it cannot take these attacks well. Switch Ponyta into predicted attacks from Ferroseed and Spritzee, as it takes their attacks well. Use Flame Charge on forced switches to allow Ponyta to outpace all of the unboosted metagame and most Choice Scarf users; this also stops Diglett from trapping it. Use Flare Blitz to do decent damage to most Pokemon, especially when Pokemon that resist it are KOed or have low HP. Use High Horsepower on predicted switches to Onix and Mareanie, and, if running Wild Charge, use it to OHKO Wingull and do major damage to Staryu. Be wary about switching into Knock Off users such as Vullaby and Pawniard, as Ponyta will lose its only way to recover HP, becoming easier to take care of. Ponyta can be kept until late-game to clean up weakened teams once trappers such as Trapinch and Diglett and Water-types like Wingull and Staryu are gone. Be careful about attacking with Ponyta when Diglett or Trapinch is present, as both can trap Ponyta and take care of it with Earthquake. Only switch Ponyta into Stealth Rock when it is in range of Berry Juice to restore itself.</p> <h1>Team Options</h1> <p>Counter-trappers like Trace Porygon and trappers like Trapinch are good to pair with Ponyta to get rid of Diglett. Fighting-types such as Timburr and Mienfoo go well with Ponyta because they can use Knock Off to get rid of items and make it easier to sweep. Dewpider is great to get down Sticky Web to let Ponyta outpace Pokemon like Abra, Staryu, and Diglett without needing to use Flame Charge. Defog and Rapid Spin users like Vullaby, Timburr, and Staryu are needed in order to prevent Ponyta from taking extra damage or being slowed down from Sticky Web. Timburr can also help against Onix, while Staryu can help with Ground-types like Mudbray and Drilbur. Onix, Mudbray, and Ferroseed help Ponyta sweep by setting entry hazards to wear down opposing Pokemon. Onix is also a great switch-in to Knock Off from Vullaby to keep Ponyta from losing its Berry Juice. Ferroseed can also help with Water-types like Staryu, while Mudbray can come in on opposing Onix's attacks. Mareanie sets down Toxic Spikes, comes in on Fighting- and Water-type attacks from Mienfoo and Wingull, and can use Iron Defense to help with facing common Knock Off users like Pawniard, Mienfoo, and Vullaby.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 208173, "username": "Fiend"}, {"user_id": 449990, "username": "Dreamcatcher"}, {"user_id": 255030, "username": "San Tomas"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}, {"user_id": 232216, "username": "The Dutch Plumberjack"}]}], "writtenBy": [{"user_id": 393488, "username": "Yami"}]}
  },
  "Ponyta-Galar": {
    "overview": "<p>Galarian Ponyta is a good special attacker because of its Psychic typing and good coverage options such as Mystical Fire and Dazzling Gleam, allowing it to threaten Mareanie, Ferroseed, and Vullaby, and a good Speed stat allows it to outspeed Galarian Farfetch'd and Speed tie with Wingull. It can also use Calm Mind to boost its Special Attack stat and turn into a dangerous sweeper, while a set with Life Orb and three attacks makes it a threatening special attacker right off the bat that takes care of common threats to it such as Vullaby after Stealth Rock damage. However, Galarian Ponyta struggles with taking physical attacks because of its low Defense stat and is weak to Knock Off users that can take an attack from it, such as Corphish, Krabby, and Vullaby. Galarian Ponyta has additional problems with Diglett and Trapinch trapping and OHKOing it due to its low Defense stat. It also struggles with Pawniard, as Sucker Punch OHKOes it.</p> ",
    "comments": "<h1>Other Options</h1> <p>A mixed set with Double Kick, Psychic, Mystical Fire / Dazzling Gleam, and Protect allows Galarian Ponyta to OHKO Pawniard and put a major dent in Munchlax with Double Kick; however, Galarian Ponyta will have to give up either the ability to hit Steel-types or Vullaby super effectively. A physical set with Play Rough, Wild Charge / Protect / Morning Sun, Low Kick, and Zen Headbutt can be used to do major damage to Munchlax and hit Water-types such as Krabby and Corphish super effectively. However, Galarian Ponyta attacks would hit less hard, and Play Rough would activate Vullaby's Weak Armor, which forces Galarian Ponyta out.</p> <h1>Checks and Counters</h1> <p><strong>Dark-types: Pawniard and Vullaby are able to threaten Galarian Ponyta with Sucker Punch or Knock Off and outspeed it if they're using a Choice Scarf. However, Pawniard and Vullaby will have to scout what moves it is running, as Mystical Fire and Dazzling Gleam can take care of them.</p> <p><strong>Ghost-types</strong>: Frillish gives Galarian Ponyta a problem because of its bulk, allowing it to take attacks from Galarian Ponyta and use Will-O-Wisp + Hex to take care of it.</p> <p><strong>Arena Trap: Arena Trap users like Diglett and Trapinch give Galarian Ponyta trouble, as they can take care of it with Sucker Punch, Earthquake, or First Impression.</p> <p><strong>Munchlax: Munchlax is able to tank any of Galarian Ponyta's attacks and take care of it with Double-Edge.</p> ",
    "sets": [
      {
        "name": "Special Attacker",
        "description": "<h1>Moves</h1> <p>Calm Mind allows Galarian Ponyta to be a fearsome mid- to late-game sweeper once its checks like Diglett and Pawniard are gone. Dazzling Gleam enables Galarian Ponyta to hit its checks such as Vullaby super effectively. Morning Sun allows Galarian Ponyta to keep itself healthy while setting up with Calm Mind. Protect is mainly used to avoid getting OHKOed by Trapinch's First Impression, but it can also serve as a way to play mind games with Sucker Punch users such as Pawniard. Psychic allows Galarian Ponyta to do major damage to Mareanie and Galarian Farfetch'd. Mystical Fire makes Galarian Ponyta able to OHKO Steel-types such as Ferroseed as well as 2HKO Pawniard, though it will raise Pawniard's Attack stat if it survives the attack.</p> <h1>Set Details</h1> <p>Pastel Veil is used to avoid getting poisoned by Toxic Spikes and Sludge Bomb from Oddish and Mareanie. Running 196 Speed EVs and a Timid nature allows Galarian Ponyta to Speed tie with Wingull and outspeed Pokemon such as Onix and Galarian Farfetch'd. Life Orb can be used over Eviolite to net OHKOs on Vullaby and Trapinch after Stealth Rock damage; however, Eviolite is the preferred item so Galarian Ponyta can set up with Calm Mind more easily and take an attack from Wingull, which it could not do with Life Orb.</p> <h1>Usage Tips</h1> <p>Make sure that Diglett and Trapinch are KOed before trying to sweep, as these two can trap Galarian Ponyta and OHKO it with Earthquake or, in the latter's case, First Impression if Galarian Ponyta is not running Protect. Use Protect to avoid being OHKOed by Trapinch's First Impression and play mind games with Pawniard's Sucker Punch. Galarian Ponyta should try to set up mid- to late-game to sweep once threats such as Pawniard, Frillish, and Vullaby are gone. It can also set up on Pokemon that do not threaten it like Mareanie and Oddish. Be careful around priority users such as Pawniard and Corphish, as these will either heavily chip or OHKO Galarian Ponyta. Avoid taking physical attacks from Pokemon such as Onix due to Galarian Ponyta's poor Defense stat.</p> <h1>Team Options</h1> <p>Galarian Ponyta struggles with Munchlax, which is able to tank its attacks while taking care of it with Double-Edge, so Fighting-types like Timburr and Galarian Farfetch'd are good partners. Stealth Rock and Spikes setters like Onix and Ferroseed can set down entry hazards for Galarian Ponyta to make it easier to sweep late-game. Galarian Ponyta also appreciates having Stealth Rock up to help wear down Vullaby. Mudbray can also be used for its ability to take care of Pawniard and Onix while also setting up Stealth Rock. Galarian Ponyta struggles against Pawniard and Vullaby, so Pokemon such as Trapinch and Spritzee make great partners, as Trapinch can take care of Pawniard, while Spritzee can take care of Vullaby. Galarian Ponyta also struggles against Frillish, so having a Dark-type such as Pawniard is great to take care of it. Finally, Galarian Ponyta loves Sticky Web support from Dewpider to make it easier to set up and outpace Pokemon that it usually cannot such as Diglett.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 213064, "username": "Merritt"}, {"user_id": 32350, "username": "KSG"}, {"user_id": 240933, "username": "tazz"}, {"user_id": 195129, "username": "Nineage"}, {"user_id": 420389, "username": "Stoward"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Estronic"}, {"user_id": 232216, "username": "The Dutch Plumberjack"}]}], "writtenBy": [{"user_id": 393488, "username": "Yami"}]}
  },
  "Slowpoke": {
    "overview": "<p>Slowpoke's typing and bulk allow it to act as a blanket check to many Pokemon, such as Onix and Staryu, as well as check Psychic- and Fire-types effectively. Moreover, Slowpoke sports a handful of great utility moves. These include Teleport, which synergizes well with Regenerator and allows a teammate to be brought in safely, and Slack Off, which gives it reliable healing, as well as Scald, Thunder Wave, and Fire Blast. However, Slowpoke is very slow, and its typing leaves it with weaknesses to STAB attacks from common presences such as Vullaby, Pawniard, Grookey, and Magnemite as well as common coverage from Pokemon Slowpoke tends to soft check throughout a match, such as Staryu's Thunderbolt, Timburr's and Mienfoo's Knock Off, and U-turn from a number of threats.</p> ",
    "comments": "<h1>Other Options</h1> <p>Thunder Wave can be used to cripple opposing Pokemon, which a slower teammate can take advantage of. Fire Blast threatens Ferroseed and Pawniard, and it eases prediction against teams carrying both Foongus and Pawniard. Zap Cannon super effectively hits the likes of Flying- and Water-types, but its inconsistent accuracy often makes it a poor choice.</p> <h1>Checks and Counters</h1> <p><strong>Knock Off and U-turn: Knock Off and U-turn are widespread moves that hit Slowpoke super effectively. Knock Off hinders Slowpoke in the long run and can be used quite easily on Slowpoke, since it is slow. Pokemon Slowpoke soft checks such as Mienfoo, Timburr, and Mareanie can pack Knock Off. U-turn makes gaining momentum against Slowpoke by forcing it out a breeze, which can prove detrimental to teams needing the momentum Slowpoke could offer.</p> <p><strong>Dark-types: Vullaby, Pawniard, and Scraggy are immune to Slowpoke's Psychic-type moves and can take advantage of it being on the field. Pawniard can freely set Stealth Rock, and Nasty Plot Vullaby and Scraggy can set up on Slowpoke. Furthermore, Dark-types tend to pack a dreaded STAB Knock Off, threatening Slowpoke with an OHKO, and Vullaby can pack U-turn. However, these Dark-types dislike Scald burns and Thunder Wave, and Pawniard must beware of Fire Blast.</p> <p><strong>Grass-types: Ferroseed can take the free turns Slowpoke gives it to stack entry hazards, remove items with Knock Off, or spread paralysis. Grookey threatens Slowpoke with Grassy Glide and Wood Hammer, and it can set a Swords Dance up upon forcing Slowpoke out, which makes it an even bigger threat. Foongus can 2HKO Slowpoke with Giga Drain, but it struggles against Slowpoke's Psychic. Slowpoke's Grass-type switch-ins must, however, be wary of the rare Fire Blast, and Grookey and Ferroseed also dislike Scald burns.</p> <p><strong>Electric-types: Magnemite can come in and use Volt Switch on Slowpoke very freely, although it dislikes being burned by Scald. It must also account for Fire Blast. Chinchou isn't bothered by these but dislikes switching in repeatedly, especially on Psychic-type moves.</p> ",
    "sets": [
      {
        "name": "Bulky Pivot",
        "description": "<h1>Moves</h1> <p>Scald threatens common switch-ins such as Pawniard, Vullaby, and Ferroseed with a burn. Future Sight is Slowpoke's main way of applying offensive pressure to foes, taking advantage of Slowpoke forcing Pokemon such as Foongus, Koffing, Mareanie, and Ponyta out and Psychic-resistant Pokemon in, which can be taken advantage of by teammates. Psychic is an alternative to Future Sight that allows it to hit foes directly. Teleport synergizes with Future Sight and Regenerator and can allow a threatening teammate to get on the field safely.</p> <h1>Set Details</h1> <p>Regenerator allows Slowpoke to repeatedly switch into the likes of Abra, Vulpix, and Ponyta and check them throughout the game. 116 HP EVs give Slowpoke 27 HP, which means it will recover 9 HP with Regenerator. Both defenses reach even numbers to get the most out of Eviolite's boosts. The maximized Special Defense patches up Slowpoke's low natural special bulk. The EVs dumped into Special Attack ensure it can 2HKO Foongus with Psychic or deal decent damage to most targets with Future Sight. A spread more focused on physical bulk of 116 HP / 236 Def / 116 SpA / 36 SpD can be used, which allows Slowpoke to check Mudbray and Onix better at the cost of compromising special bulk. Slowpoke's Eviolite is very important to maintain its bulk in order to check threats throughout the game.</p> <h1>Usage Tips</h1> <p>Slowpoke should be switched in against Pokemon it checks or soft checks when it is healthy. It should focus on finding room to launch Future Sight if running this attack and making good use of Teleport, taking advantage of forced switches to bring in threatening Pokemon safely. When its health is low, Slowpoke should be switched out to recover HP thanks to Regenerator. It can also use Slack Off when up against Pokemon it checks to keep itself healthy. Slowpoke should be wary of Knock Off, since it can reduce its effectiveness for the remainder of the game. As such, switching it in on Pokemon that oftentimes carry Knock Off such as Timburr and Mienfoo isn't a wise decision, even if Slowpoke resists their STAB moves and could otherwise freely switch in to be eligible for Regenerator. Scald should be used to threaten its usual switch-ins in Pawniard, Vullaby, and Ferroseed and when firing off a Future Sight isn't needed.</p> <h1>Team Options</h1> <p>As Slowpoke is very weak to Knock Off, Knock Off absorbers such as Mienfoo, Timburr, and Spritzee are great teammates. They like Slowpoke's ability to handle Psychic-, Fire-, and Poison-types and can handle the Dark-types Slowpoke tends to invite in. Fighting-types like Mienfoo and Timburr also provide Knock Off support and can handle the Steel-types that Slowpoke often invites in well. Mienfoo and Slowpoke form a fairly good Regenerator core due to their pivoting moves, whereas Timburr can provide hazard removal to a team. Poison-types such as Foongus and Koffing handle Grookey and can remove Toxic Spikes from the field, which Slowpoke greatly appreciates. In turn, Slowpoke can handle threatening Psychic- and Fire-types for them. Ponyta can also check Grookey for Slowpoke and likes Slowpoke soft checking Water-types. Pokemon such as Grookey, Magnemite, and Vullaby form a VoltTurn core with Slowpoke and can cover some of its weaknesses. Strong attackers such as Choice item Mienfoo and Vulpix like Teleport support and Future Sight preventing common checks from stomaching an attack. Lastly, trappers such as Diglett and Trapinch can remove troublesome foes for Slowpoke, such as Magnemite and Pawniard, and like Teleport support.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 410251, "username": "zizalith"}, {"user_id": 449990, "username": "DC"}, {"user_id": 255030, "username": "San Tomas"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}, {"user_id": 240732, "username": "Estronic"}]}], "writtenBy": [{"user_id": 438243, "username": "PyProd"}]}
  },
  "Magnemite": {"sets": [{"name": "SturdyJuice"}, {"name": "Choice Scarf"}]},
  "Farfetch’d-Galar": {
    "overview": "<p>Galarian Farfetch'd is a very threatening wallbreaker in LC thanks to its decent Attack stat and Speed tier. Powerful attacks in Close Combat and Brave Bird combined with its ability Scrappy also provide it with perfect neutral coverage. It also has impressive coverage options in Knock Off and Poison Jab; the former allows it to remove items, and the latter allows it to effectively pressure Spritzee. Its Speed tier also allows it to outspeed a good portion of the unboosted metagame and act as an effective Choice Scarf user, as it's able to most notably outspeed Choice Scarf Vullaby and +1 Corphish. However, Galarian Farfetch'd is greatly threatened by Pokemon that naturally outspeed it such as Ponyta, Galarian Ponyta, and Wingull, which can all either dish out heavy damage to it or cripple it with burns from Will-O-Wisp or Scald. Furthermore, Galarian Farfetch'd faces competition from Timburr, which offers better role compression and a semi-reliable recovery with Drain Punch, while Galarian Farfetch'd boasts access to Swords Dance and a better Speed tier.</p> ",
    "comments": "<h1>Other Options</h1> <p>Galarian Farfetch'd tends to have few other viable options available due to the brilliant coverage that the combination of Close Combat, Brave Bird, and Knock Off offers. A set running Life Orb and Substitute can be run, typically on Sticky Web offense teams to fully utilize Galarian Farfetch'd's Speed tier and allow it to always get a free attack in thanks to Substitute. Berry Juice can be used in place of Eviolite, giving Galarian Farfetch'd a form of passive recovery in exchange for extra bulk. An all-out attacking set can be used, forgoing Swords Dance for Poison Jab or Quick Attack, making Farfetch'd more of a standard wallbreaker rather than a sweeper. Quick Attack is a viable option on the Swords Dance set, allowing it to pick off faster, weakened foes; especially at +2; such as Ponyta, Galarian Ponyta, and Diglett. Defog could be used in place of Swords Dance or in place of Poison Jab on the Choice Scarf set if the role compression requires it. However, Timburr heavily outclasses Galarian Farfetch'd as a Fighting-type Defogger due to it having better bulk and recovery in Drain Punch. Eject Pack can be used as a way to use Close Combat on Mareanie or Spritzee and then trap them with Diglett or Trapinch.</p> <h1>Checks and Counters</h1> <p><strong>Spritzee: Spritzee takes minimal damage from an unboosted Brave Bird and can recover it off with Wish and Protect while dishing out heavy damage with Moonblast. It does, however, have to be wary of Knock Off and Poison Jab.</p> <p><strong>Faster Wallbreakers</strong>: While it doesn't enjoy switching in on Knock Off, Galarian Ponyta naturally outspeeds Galarian Farfetch'd. Life Orb sets are able to OHKO Galarian Farfetch'd with Psychic, while Eviolite sets do a minimum of 81%. Wingull also KOes Galarian Farfetch'd with Hurricane or can cripple it with burns from Scald. None of them appreciate switching into Knock Off, though.</p> <p><strong>Vullaby: Vullaby is able to survive any unboosted attack, gain a +2 Speed boost thanks to Weak Armor, and OHKO Galarian Farfetch'd in return with Brave Bird.</p> <p><strong>Mareanie</strong>: Mareanie can shrug off any attack from Galarian Farfetch'd and recover off the damage. While it doesn't appreciate a boosted Brave Bird, it can set up with Iron Defense, leaving it unfazed by the boosts, as well as potentially burn it with Scald.</p> <p><strong>Koffing</strong>: Koffing has enough natural bulk to take little damage from Brave Bird and is able to cripple Galarian Farfetch'd with Will-O-Wisp.</p> ",
    "sets": [
      {
        "name": "Swords Dance",
        "description": "<h1>Moves</h1> <p>Swords Dance turns Galarian Farfetch'd into a powerful sweeper. Close Combat is Galarian Farfetch'd's main attacking move, dishing out heavy damage to neutral targets, while Brave Bird hits common Fighting-resistant Pokemon such as Oddish as well as Fighting-types like Timburr and opposing Galarian Farfetch'd for super effective damage. Knock Off is used to remove items from opposing Pokemon, making it easier to break through them.</p> <h1>Set Details</h1> <p>Maximum Attack and Speed EVs alongside a Jolly nature ensure that that Galarian Farfetch'd Speed ties threats such as Vullaby and Pawniard and hits them as hard as possible. The remaining EVs are placed in HP alongside an Eviolite to provide Galarian Farfetch'd with extra bulk and give it more opportunities to use Swords Dance. Scrappy enables Galarian Farfetch'd to hit Ghosts-types such as Frillish with Close Combat, allowing it to use the move with little drawback.</p> <h1>Usage Tips</h1> <p>While there are a large number of foes that Galarian Farfetch'd is able to beat one-on-one, it doesn't really appreciate switching in on most of the foes that beat it, as they can remove its Eviolite with Knock Off or cripple it with status from Body Slam or Thunder Wave. Bringing it in after a teammate has been KOed, through U-turn from Vullaby, or on a well-predicted double switch is recommended to avoid having Galarian Farfetch'd be in undesirable situations. Galarian Farfetch'd is better off attacking foes early-game, as using a single attack to break through teams can also bluff Choice Scarf sets. Early-game, Knock Off should be used to remove items from opposing Pokemon to make it easier for Galarian Farfetch'd to sweep. Once everything is in range of Galarian Farfetch'd's boosted attacks, it should try to look for an opportunity to set up on a Pokemon that matches up poorly against it, such as Munchlax, Ferroseed, or Pawniard, and proceed to sweep through the opposing team.</p> <h1>Team Options</h1> <p>Swords Dance Farfetch'd does well on a variety of teams due to most of its checks and counters generally having a difficult time actively switching into it. Sticky Web support from Dewpider is fantastic for Galarian Farfetch'd, as it allows it to outspeed the entire unboosted tier, making it incredibly difficult to switch into. Ferroseed is an especially useful partner, as it's able to potentially offer Spikes support while also being one of the most consistent checks to Spritzee and potentially immobilizing faster threats such as Ponyta and Galarian Ponyta with Thunder Wave. Pawniard's and Onix's resistance to Flying-type attacks is also incredibly appreciated by Galarian Farfetch'd, as they provide the team with a much-needed switch-in to Vullaby. VoltTurn support from Chinchou and Vullaby is very useful to make it easier for Galarian Farfetch'd to enter the battlefield. Trapping support from Diglett is also greatly appreciated by Galarian Farfetch'd, as they can both assist each other in removing Mareanie, and Diglett is also able to utilize its Speed tier to trap and remove faster threats such as Ponyta and Galarian Ponyta, making Galarian Farfetch'd harder to revenge kill.</p> "
      },
      {
        "name": "Choice Scarf",
        "description": "<h1>Moves</h1> <p>Poison Jab allows Farfetch'd to dish out heavy damage to Spritzee. Final Gambit can be used as a suicide option, allowing Galarian Farfetch'd to trade with an opposing Pokemon. Defog is also a viable option over Poison Jab, allowing Galarian Farfetch'd to act as an entry hazard remover.</p> <h1>Set Details</h1> <p>Maximum Attack and Speed EVs alongside a Jolly nature ensure that Galarian Farfetch'd outspeeds the entire unboosted tier with a Choice Scarf, as well as neutral-natured Choice Scarf Vullaby, while hitting as hard as possible. The remaining EVs are placed in HP to provide Galarian Farfetch'd with extra bulk. Scrappy is the ability of choice, giving Galarian Farfetch'd perfect neutral coverage with Close Combat and Brave Bird.</p> <h1>Usage Tips</h1> <p>Choice Scarf Galarian Farfetch'd is used primarily as a revenge killer. It is important that Galarian Farfetch'd avoids switching in directly on attacks and is instead brought in once its teammates are KOed or with VoltTurn support from Chinchou or Vullaby. It's especially important to consider what moves Choice Scarf Galarian Farfetch'd is locking itself into, as Close Combat has low PP, and Galarian Farfetch'd is quite vulnerable to being KOed in return if it fails to land a KO with Close Combat due to the drops in Defense and Special Defense, while the recoil damage from Brave Bird can result in Galarian Farfetch'd being worn down rather quickly. Poison Jab should only really be used against Spritzee, as being locked into the move can result in Galarian Farfetch'd giving away free opportunities for Steel-types such as Ferroseed and Pawniard to set entry hazards while also providing Pawniard with the opportunity to set up with Swords Dance freely.</p> <h1>Team Options</h1> <p>Vullaby and Chinchou are useful partners for Galarian Farfetch'd, as their VoltTurn support makes it easier for it to switch into the battlefield, while both partners can appreciate Galarian Farfetch'd's ability to remove Ferroseed and Pawniard as well as Onix after some chip damage. Vullaby is an especially noteworthy partner, as its Knock Off makes Galarian Farfetch'd's job easier by removing additional bulk from Mareanie, Koffing, and Spritzee. Ferroseed is especially useful as well, as it's able to potentially offer Spikes support while also being one of the most consistent checks to Spritzee. Furthermore, it provides the team with a more reliable answer to Oddish and additional Knock Off support, which makes it easier for Galarian Farfetch'd to break through teams. Wallbreakers such as Corphish and Timburr are valuable partners, as they provide teams with more offensive presence while also having access to priority moves, assisting Galarian Farfetch'd with revenge killing faster foes, which can be especially useful for dealing with Dragon Dance Onix, which outspeeds Galarian Farfetch'd at +1 and is able to KO it with Earthquake.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 208173, "username": "Fiend"}, {"user_id": 32350, "username": "KSG"}, {"user_id": 150971, "username": "Coconut"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Estronic"}, {"user_id": 232216, "username": "The Dutch Plumberjack"}]}], "writtenBy": [{"user_id": 420389, "username": "Stoward"}]}
  },
  "Shellder": {
    "overview": "<p>Shellder can transform into a fearsome sweeper with its access to Shell Smash and Skill Link backed up by a good Attack stat and Speed tier. Skill Link-assisted multi-hit moves are what separates Shellder from other sweepers in the tier, as LC's damage mechanics make multi-hit moves very powerful, and they can break through Substitute and Focus Sash with ease, which other sweepers have trouble against. Shellder can also find ample opportunities to set up and stay on the field thanks to its great Defense stat and good defensive typing. However, Shellder's poor Special Defense leaves it vulnerable to even weaker special attackers like Mareanie and Spritzee. Shellder is also quite reliant on Shell Smash boosts to be a threat, and with the set's lack of utility, it can be hard to fit on teams not built around it.</p> ",
    "comments": "<h1>Other Options</h1> <p>Rapid Spin lets Shellder perform the role of an entry hazard remover, which can be useful for preserving the longevity of many entry hazard-vulnerable teammates. Life Orb allows Shellder to OHKO a wider variety of bulky Pokemon after a Shell Smash; however, the lack of bulk and the HP reduction for every attack means more intensive support is required for Shellder to set up and tank priority moves. Choice Scarf's immediate Speed jump means Shellder can revenge kill faster Pokemon such as Wingull and Diglett, but Shellder will be outsped by faster Choice Scarf users, will not have the immediate power to clean like those other Choice Scarf users, and will struggle dealing against bulkier Pokemon.</p> <h1>Checks and Counters</h1> <p><strong>Bulky Pokemon: Ferroseed is bulky enough to survive a +2 Icicle Spear and can often KO Shellder with Bullet Seed in return or paralyze it with Thunder Wave if a teammate can more reliably take care of Shellder. Munchlax is resistant to Icicle Spear thanks to Thick Fat and can tank Rock Blast to then KO with Double-Edge if Shellder has sustained chip damage. Spritzee is also just inherently bulky, being able to tank Icicle Spear well and KO with Moonblast after chip damage. Water-types like Mareanie and Frillish are resistant to Icicle Spear, with the latter also being immune to Water, can tank a +2 Rock Blast at full health, and can KO Shellder with their STAB moves; Frillish can even inflict a burn with Will-O-Wisp or reduce Shellder's Attack and heal itself with Strength Sap.</p> <p><strong>Revenge Killers: Shell Smash's Defense drops make Shellder more susceptible to being picked off by priority users like Timburr, Pawniard, and Trapinch. Timburr can also tank a +2 Icicle Spear at full health and retaliate with Drain Punch followed up by Mach Punch. Pawniard poses a huge threat, as it resists both of Shellder's multi-hit moves, can survive a +2 Liquidation at full, and can dent Shellder with Knock Off before finishing it off with Sucker Punch. Croagunk is immune to Water and can target Shellder's far lower Special Defense with Vacuum Wave. Diglett can pose a threat, as it carries Sucker Punch; furthermore, Choice Scarf variants are able to outspeed +2 Speed Shellder and revenge kill it either way. Choice Scarf Wingull, although rare, outspeeds non-Jolly variants and can revenge kill with Hurricane; meanwhile, the seldom-used Sand Rush Drilbur outspeeds Shellder under sand and can KO it with Earthquake.</p> ",
    "sets": [
      {
        "name": "Shell Smash",
        "description": "<h1>Moves</h1> <p>Shell Smash is what turns Shellder into a dangerous sweeper, doubling both offense and Speed stats at the cost of lowering defenses. Icicle Spear and Rock Blast are both multi-hit moves, which are quite unique in LC because each hit is deceptively strong on its own due to the lower level of Pokemon, and the fact that each hit has its own damage roll means there is a greater chance that one of those hits will be a high damage roll. This causes the multi-hit moves to do more damage than Shellder's STAB Liquidation against most threats. Icicle Spear is the go-to move against most Pokemon, as it has perfect accuracy, taking care of Vullaby, Onix, and Trapinch with ease and OHKOing neutral targets like Wingull and Galarian Farfetch'd after Shell Smash. Rock Blast is used to target foes that resist Ice such as Thick Fat Munchlax, Ponyta, and Water-types like Corphish and Mareanie. For the last slot, STAB Liquidation rounds out Shellder's coverage, as it is the best way to hit Pawniard and Mudbray and is the most reliable way to not activate Berry Juice on users such as Munchlax. Ice Shard is useful to avoid being revenge killed by fast Choice Scarf users like Diglett and to set up against and beat both Onix and Vullaby after a Weak Armor boost. Protect is also an option to primarily block First Impression from Trapinch as well as Fake Out from Meowth and can be used to stall out the sun or poisoned Pokemon if necessary.</p> <h1>Set Details</h1> <p>Eviolite gives Shellder extra bulk, so it has an easier time setting up. The EV spread maximizes Shellder's offenses stats, allowing it to outspeed +1 Speed Onix and Drilbur after Shell Smash, with the remaining EVs going into HP and Defense for more survivability. With a Jolly nature, Shellder can outspeed Adamant Corphish before Shell Smash, and after a Shell Smash, Shellder can outspeed the entire unboosted metagame under Sticky Web and up to 19 Speed Choice Scarf users normally. An Impish nature makes it easier to set up on physical Pokemon like Onix and to tank priority moves after setting up such as Mach Punch from Timburr or Sucker Punch from Diglett. Lastly, an Adamant nature is an option that gives Shellder an easier time to get past Berry Juice Onix and 15 Defense Eviolite users like Timburr.</p> <h1>Usage Tips</h1> <p>When attempting a sweep, it is best to remove or weaken any Pokemon Shellder has a hard time beating, such as Ferroseed and Mareanie, and also to remove threatening Pokemon such as Chinchou. Pokemon with access to priority moves like Timburr and Pawniard should also be removed as to not risk ending a sweep prematurely. If it is necessary to set up before these checks are removed, be mindful of the damage you take, as every extra bit of damage taken means Shellder will have a harder time setting up or tanking priority moves. Although it should not switch into them directly, physically inclined Pokemon, most notably Onix and Vullaby, are prime setup fodder for Shellder, as its high Defense stat allows it to tank their hits well. It also helps if the Pokemon Shellder sets up on is initially faster as to not take extra damage due to Shell Smash dropping defenses. Shellder could also be sent in early- or mid-game if it wants to weaken any checks, as they still take a great deal from its multi-hit moves; however, it should try to avoid any damage, as that can give it difficulties setting up later on.</p> <h1>Team Options</h1> <p>Pokemon with Knock Off make for great teammates, as they can soften up walls like Mareanie, Spritzee, and Ferroseed by removing their Eviolite and Berry Juice. Vullaby is a great teammate because it has Knock Off, can lure in threats like Onix that Shellder can set up on and pivot it in safely thanks to U-turn, and can remove troublesome entry hazards with Defog. Galarian Farfetch'd and Timburr too carry Knock Off and Defog, and they can deal with Ferroseed and Munchlax easily while functioning as good wallbreakers. Entry hazard support from Onix, Ferroseed, and Pawniard is great at chipping away the opponent's Pokemon, which can aid Shellder tremendously with achieving KOs it would otherwise narrowly miss out on, with Ferroseed and Pawniard also able to carry Knock Off. Trappers like Trapinch and Diglett can remove troublesome Pokemon like Mareanie, Pawniard, and Chinchou, with Diglett being able to provide Memento support to greatly help Shellder upon setting up. Since Shellder is vulnerable to all entry hazards, Pokemon that can remove them such as the aforementioned Vullaby and Galarian Farfetch'd as well as Drilbur are well appreciated to give Shellder more longevity when attempting to sweep.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 32350, "username": "KSG"}, {"user_id": 55063, "username": "Corporal Levi"}, {"user_id": 195129, "username": "Nineage"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "The Dutch Plumberjack"}, {"user_id": 384270, "username": "martha"}]}], "writtenBy": [{"user_id": 264307, "username": "crusty"}]}
  },
  "Onix": {
    "overview": "<p>Onix is an LC staple thanks to its diverse set of abilities, key resistances, and role as a Stealth Rock setter. Its part Rock typing and high natural Speed and Defense make it a solid check to major threats like Vullaby and Ponyta. Its suite of abilities lets it wear many hats; with Weak Armor, it can be a potent revenge killer and force fast threats like Ponyta out, and with Rock Head alongside Dragon Dance, it can harness the power of Head Smash and become a devastating sweeper. Additionally, Sturdy and Berry Juice can make Onix a blanket check to threats in the metagame due to its durability. Despite these many great qualities, though, the metagame is rife with Onix checks, and Onix must beware the ever-present Arena Trap users, Trapinch and Diglett, as well as common Fighting-, Water-, Grass-, and Ground-types. Onix can also be a difficult team fit as an entry hazard setter that does not deal well with the tier's special attackers while struggling with the ubiquitous Mienfoo.</p> ",
    "comments": "<h1>Other Options</h1> <p>Stone Edge is an option on Weak Armor and Sturdy Onix to more reliably OHKO standard Vullaby, though it falls short against Eviolite variants. Life Orb allows Rock Head Onix to hit hard enough to surprise and overwhelm would-be checks, though it greatly sacrifices durability.</p> <h1>Checks and Counters</h1> <p><strong>Fighting-types: Mienfoo's exceptional physical bulk and Regenerator allow it to come into Onix repeatedly and threaten it out with High Jump Kick or make progress with Knock Off or U-turn. Timburr resists Rock Blast and Head Smash, can KO Onix with Drain Punch while keeping itself healthy, and can remove Stealth Rock with Defog. Mach Punch also threatens weakened Dragon Dance and Weak Armor Onix. Timburr can be worn down by repeatedly switching into Earthquake, though, and Onix can both KO a weakened Timburr and deny Defog with Explosion. Scraggy can set up on Onix with Dragon Dance, though it must be wary of Body Press.</p> <p><strong>Arena Trap Users: Diglett and especially Trapinch can trap and KO Onix. Onix must beware switching into Vullaby's U-turn if either Arena Trap user is on the opposing team, although Weak Armor can prevent Diglett from KOing Onix. Trapinch switches into any attack from Onix with relative ease and can both keep itself healthy and KO Onix with Giga Drain.</p> <p><strong>Grookey: Grookey weaks Onix's Earthquake with Grassy Terrain while threatening a OHKO with Grassy Glide. It can also force Onix out and set up for a sweep with Swords Dance. However, Grookey is frail and cannot switch into Onix's Rock-type moves well.</p> <p><strong>Bulky Grass-, Water-, and Ground-types</strong>: A variety of bulky Pokemon take hits from Onix well while threatening to KO it with their own STAB moves, including Foongus, Ferroseed, Staryu, Frillish, and Mudbray. Each of these Pokemon, however, can be overwhelmed through switching into Onix repeatedly, having their Eviolites removed, and Dragon Dance boosts. Staryu can remove Onix's entry hazards and outspeed and KO it with ease.</p> ",
    "sets": [
      {
        "name": "Weak Armor",
        "description": "<h1>Moves</h1> <p>Earthquake is Onix's most reliable move, threatening common Ground-weak Pokemon like Pawniard, Ponyta, and Mareanie while dealing decent damage to neutral foes. High Horsepower should be run on teams with Grookey as its damage is not reduced by Grassy Terrain, though it is slightly less reliable. Rock Blast is the best Rock-type move thanks to the way the damage of multi-hit moves is calculated in LC, and it deals heavy damage to Vullaby and breaks Focus Sash and Sturdy on Pokemon like Abra and Dwebble. Stealth Rock provides crucial entry hazard support. Explosion doles out a massive hit and maintains offensive momentum in situations after Stealth Rock has been set when Onix is likely to be KOed, such as against Eviolite Diglett and Trapinch. Taunt is a niche option that can prevent sweepers like Scraggy and Nasty Plot Vullaby from setting up.</p> <h1>Set Details</h1> <p>Weak Armor paired with Eviolite allows Onix to take a physical hit and threaten back with its boosted Speed. This Speed boost even allows it to beat some Choice Scarf and Shell Smash users, outspeed Ponyta after switching into a hit, and prevent Diglett trapping Onix following an opposing Vullaby's U-turn. Maximum Speed and Attack investment with a Jolly nature bolsters Onix's otherwise lackluster offensive presence while allowing it to always outspeed Vullaby and Pawniard and Speed tie with 17 Speed Pokemon like Mienfoo, Grookey, and Natu.</p> <h1>Usage Tips</h1> <p>Weak Armor Onix should be used to set Stealth Rock while being strategically deployed to check faster physical threats with Weak Armor boosts. This set is among the most effective offensive checks to Ponyta and physically offensive Vullaby, as it outspeeds Ponyta after taking an attack and Diglett after an opposing Vullaby U-turn; however, beware Ponyta's Will-O-Wisp.</p> <h1>Team Options</h1> <p>Weak Armor Onix fits well on many teams thanks to its ability to reliably check threats like Vullaby and Ponyta while providing revenge killing utility and entry hazard support. It partners well with Foongus and Ferroseed, as they switch into Water- and Ground-types well while Onix checks Vullaby and Ponyta for them. Mareanie, Koffing, and Spritzee check Fighting-types like Mienfoo, Timburr, and Scraggy. Finally, Vullaby can switch into bulky Ground-types like Mudbray and Grass-types like Foongus. Grookey's Grassy Terrain can lessen Diglett's ability to trap Onix.</p> "
      },
      {
        "name": "Sturdy",
        "description": "<h1>Moves</h1> <p>Earthquake reliably damages Ponyta, Pawniard, and other Ground-weak Pokemon while hitting neutral foes for decent damage. High Horsepower is the alternative STAB of choice for teams with Grookey. Rock Blast takes advantage of the power of multi-hit moves in LC, hits Vullaby hard, and breaks Focus Sash and Sturdy on Pokemon like Abra and Dwebble. Stealth Rock supports offensive teams by pressuring and wearing down the opposing team's switch-ins. Explosion allows Onix to generate momentum after its Berry Juice has been used and heavily damages checks like Trapinch and Timburr while preventing them from healing. Against Mienfoo, Onix can use Explosion to prevent it from pivoting with U-turn and facilitate a Diglett trap. Dragon Dance is an option in tandem with Sturdy, as the ability makes Onix difficult to KO while it sets up, though it is limited by need to run Rock Blast over Head Smash. Endure is an option that lets Onix survive a hit and consume its Berry Juice, bringing it back to full health and reactivating Sturdy, which can be useful for revenge killing sweepers and stalling out sun turns. Taunt is an option to prevent foes from setting entry hazards or setting up.</p> <h1>Set Details</h1> <p>The combination of Sturdy and Berry Juice grants Onix multiple guaranteed turns of survivability to set Stealth Rock and potentially check offensive threats late-game. Maximum Attack and Speed investment with a Jolly nature allows Onix to hit as hard as possible and outpace Vullaby and Pawniard, and the remaining investment in HP allows Onix to heal the maximum amount from Berry Juice.</p> <h1>Usage Tips</h1> <p>Sturdy Onix should be deployed early-game when opposing entry hazards are not set to best maintain its durability. This set can set guaranteed Stealth Rock against most opposing leads apart from hazard removers and should do so early and aggressively. Strong entry hazard control of your own can be used to preserve Onix as a check against opposing sweepers that may struggle to break though the combination of Berry Juice and Sturdy while Onix wears them down with its own attacks.</p> <h1>Team Options</h1> <p>Sturdy Onix fits best on team archetypes that need guaranteed Stealth Rock support such as offensive Sticky Web, sun, dual screens. Due to its weakness to Knock Off, Onix appreciates teammates like Foongus and Mareanie that can switch into common Knock Off users like Mienfoo and Timburr. Staryu removes opposing hazards and allows Onix to preserve its Sturdy while also leaving your own entry hazards up. This set is especially vulnerable to Vullaby's U-turn paired with an Arena Trap user, so it pairs well with another Flying-resistant Pokemon like Pawniard, although a second Fighting-weak Pokemon may strain your defensive core.</p> "
      },
      {
        "name": "Rock Head",
        "description": "<h1>Moves</h1> <p>Head Smash is an incredibly powerful move that can obliterate frail neutral foes and OHKO most Vullaby. Earthquake is a reliable STAB move that hits Pawniard and Mareanie hard. Stealth Rock provides crucial entry hazard support and punishes foes for switching. Dragon Dance turns Onix into a threatening sweeper, taking advantage of the power of its STAB moves to beat teams without hefty checks. Explosion can be used to maintain offensive momentum in situations after Stealth Rock is set where Onix is likely to be KOed, such as against Eviolite and Air Balloon Diglett and Trapinch, and in tandem with Dragon Dance can be used to break physically defensive checks like Timburr and Mudbray for another sweeper. Body Press hits Porygon and Ferroseed, and it can limit Ferroseed's ability to check Onix when running Dragon Dance.</p> <h1>Set Details</h1> <p>Rock Head allows Onix to use the incredibly powerful Head Smash without taking recoil damage, making it a stout check to Vullaby and a potent setup sweeper with Dragon Dance. Full investment in Attack and Speed maximizes Onix's offensive presence, and a Jolly nature ensures that Onix will always outspeed Pawniard and Vullaby.</p> <h1>Usage Tips</h1> <p>Rock Head Onix can check a variety of physically offensive threats and set Stealth Rock if running it, but it must be wary of switching into Ponyta, as High Horsepower will 2HKO it. This set should be used to aggressively check Nasty Plot Vullaby, as it can switch into any move and OHKO it with Head Smash. When running Dragon Dance, you should generally avoid setting up too early while checks like Trapinch, Grookey, and Timburr are healthy; instead, Onix can use Earthquake to wear down Timburr as it switches in to make a later sweep easier. Onix can set up with Dragon Dance well on Pokemon it forces out or that do not threaten it like Vullaby. Onix can use Explosion to damage Trapinch when trapped, but it must be wary of Protect.</p> <h1>Team Options</h1> <p>Rock Head Onix fits best on teams that need a hard Vullaby check or that enable it to sweep with Dragon Dance. Dragon Dance variants appreciate teammates that will pressure and wear down checks like Mudbray, Timburr, and Trapinch; Pawniard can draw in these Pokemon and remove their item with Knock Off. Mienfoo can remove items from bulky Pokemon like Foongus and Spritzee that Onix otherwise struggles to break through. Foongus and Ferroseed switch well into Ground-types, Staryu, and Grookey, which threaten Onix. Removing Grookey and Timburr is critical for Onix to sweep, as they will otherwise revenge kill it with Super Effective priority. Trapinch can trap and KO Grookey with First Impression.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 208173, "username": "Fiend"}, {"user_id": 420389, "username": "Stoward"}, {"user_id": 195129, "username": "Nineage"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Estronic"}, {"user_id": 232216, "username": "The Dutch Plumberjack"}]}], "writtenBy": [{"user_id": 32350, "username": "KSG"}]}
  },
  "Krabby": {
    "overview": "<p>Krabby carves a niche for itself in LC as a good wallbreaker, boasting a high Attack stat, good coverage, and an acceptable Speed tier. The combination of its ability Sheer Force and Life Orb provides Krabby the additional power necessary to tear through many of LC's premier threats. However, it is hindered by its mediocre bulk, leaving it susceptible to opposing threats that are able to take advantage of its poor HP and Special Defense stat. Furthermore, Krabby faces competition from Corphish, a fellow wallbreaker that has access to priority.</p> ",
    "comments": "<h1>Other Options</h1> <p>A set with Swords Dance and Eviolite trades the immediate power of Life Orb for additional physical bulk, allowing Krabby to set up on opposing physical attackers such as Onix and Corphish and further increase its wallbreaking capabilities. Krabby can also opt for a Choice Scarf set, trading damage for Speed in order to outspeed otherwise dangerous threats such as Galarian Ponyta and Chinchou.</p> <h1>Checks and Counters</h1> <p><strong>Bulky Water-resistant Pokemon: Oddish and Mareanie both resist Krabby's STAB attacks. Fast variants of Mareanie are able to outspeed and beat Krabby by poisoning it with Sludge Bomb or setting up Iron Defense, while Oddish is able to pressure Krabby with both Giga Drain and Strength Sap.</p> <p><strong>Faster Special Attackers: Fast special attackers like Galarian Ponyta and Chinchou are able to outspeed Krabby and exploit its weak Special Defense.</p> <p><strong>Croagunk</strong>: Croagunk is immune to Krabby's STAB moves thanks to Dry Skin and capable of OHKOing it due to its low special bulk.</p> ",
    "sets": [
      {
        "name": "Wallbreaker",
        "description": "<h1>Moves</h1> <p>Sheer Force-boosted Liquidation is preferred as the main STAB move on Krabby because it is able to OHKO opposing Ground-types, Vullaby, and Ponyta while 2HKOing bulky Pokemon such as Timburr and Spritzee. Knock Off is able to cripple switch-ins to Krabby such as Mareanie, Oddish, and Frillish. Superpower serves as coverage for Ferroseed while also OHKOing Pawniard and Munchlax. Body Slam is Krabby's best neutral move to hit Mareanie, Oddish, Chinchou, and Croagunk, ensuring KOs on the former two after a successful Knock Off. Agility provides an alternative to Body Slam that gives Krabby the potential to function as a late-game sweeper.</p> <h1>Set Details</h1> <p>The EVs maximize Attack and Speed to help Krabby's wallbreaking potential. Having 19 HP ensures that Krabby will only take 1 HP of Life Orb recoil instead of 2 when using Superpower or Knock Off. An Adamant nature is preferred over Jolly to provide crucial damage rolls, ensuring that Liquidation will always OHKO Vullaby and that Knock Off into Body Slam will KO Oddish and Mareanie. Life Orb synergizes well with Sheer Force, providing additional power and not inflicting recoil damage when using a Sheer Force-boosted move.</p> <h1>Usage Tips</h1> <p>Krabby's wallbreaking abilities should be utilized early- to mid-game, crippling opposing walls that switch into it with Knock Off or threatening KOs on Vullaby and opposing Stealth Rock users such as Onix, Mudbray, and Drilbur with Liquidation. Krabby should be removing key walls on the opposing team to allow sweepers on its team to eventually clean late-game. If Krabby is running Agility over Body Slam, its health should be preserved until late-game, where it is able to set up and clear through opposing foes. Krabby should not switch into battle directly due to its mediocre bulk and should be wary of status, especially burns, that may reduce its offensive capabilities.</p> <h1>Team Options</h1> <p>Krabby forms an amazing wallbreaking core with Corphish, pressuring Water-resistant Pokemon like Mareanie and Oddish together. In addition, Krabby's breaking capabilities support Corphish's ability to function as a late-game cleaner thanks to the latter's strong STAB moves and priority. Galarian Ponyta and Diglett can support Krabby by taking advantage of common Water-resistant and -immune Pokemon such as Oddish, Mareanie, and Croagunk that have a secondary Poison typing. Vullaby is able to provide Knock Off support against opposing walls while serving as a secondary check to Oddish. In return, Krabby is able to help Vullaby deal with opposing Ground-types. Steel-types like Ferroseed and Pawniard are able to neutralize Oddish due to their typing and provide utility with Knock Off and Thunder Wave to assist Krabby. Late-game sweepers like Shellder and Dwebble benefit from Krabby's ability to weaken walls. Lastly, entry hazard support from Ferroseed and Dwebble allows Krabby to better break down defensive Pokemon.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 32350, "username": "KSG"}, {"user_id": 420389, "username": "Stoward"}, {"user_id": 110102, "username": "jake"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Estronic"}, {"user_id": 228482, "username": "kt3"}]}], "writtenBy": [{"user_id": 449990, "username": "Dreamcatcher"}]}
  },
  "Lickitung": {"sets": [{"name": "Defensive"}]},
  "Koffing": {
    "overview": "<p>Koffing is a naturally bulky defensive Pokemon that checks common Pokemon such as Mienfoo, Grookey, and Foongus. In fact, many physical attackers have a difficult time switching into Koffing, as opponents may be wary of a potential Will-O-Wisp. Neutralizing Gas prevents Koffing from being trapped by Arena Trap users such as Diglett and Trapinch and also negates Regenerator from Pokemon like Mienfoo and Foongus, making it an even better defensive Pokemon. On the offensive side, Koffing has useful coverage moves in Fire Blast, Thunderbolt, and Sludge Bomb that let it threaten common bulky cores like Spritzee, Mareanie, and Ferroseed.</p> <p>However, Koffing's poor base Special Defense makes it very susceptible to special attackers and means it often gets OHKOed by a STAB Psychic-type attack from the likes of Abra. This weakness is exacerbated by its lackluster Speed tier. Koffing also doesn't have a consistent way to recover HP, which limits its role as a defensive check.</p> ",
    "comments": "<h1>Other Options</h1> <p>Koffing can run a plethora of other moves. Thief can be used to steal back an item, since Koffing is a common Knock Off target. This can be used in tandem with Berry Juice, which is a great way to heal but opens Koffing up to a stronger Knock Off. Koffing can also use Pain Split as a form of recovery, but it isn't very consistent. Clear Smog is a good way to check setup sweepers, while Toxic Spikes can wear down bulky walls such as Spritzee and Shellos. Levitate can be used so Earthquake from Onix, Trapinch, and Diglett doesn't OHKO Koffing, preventing Arena Trap, and being unaffected by Spikes and Sticky Web. However, it makes it a far less effective Mienfoo check, as it will lose the long term game without recovery. Finally, Koffing can run a purely defensive set with a spread of 36 HP / 236 Def / 236 SpD so it can take even more hits from strong physical attackers such as Corphish, but the set completely takes out Koffing's offensive capabilities, making it a very passive Pokemon.</p> <h1>Checks and Counters</h1> <p><strong>Psychic-types / Psychic-type coverage: Psychic-types such as Galarian Ponyta and Abra have a really easy time KOing Koffing with their super effective STAB special attacks. Even non-STAB Psychic from the likes of Spritzee can deal more than 50% damage. However, even though neither Galarian Ponyta nor Natu is scared of being poisoned, they wouldn't like taking a Sludge Bomb.</p> <p><strong>Ponyta: Even though Ponyta doesn't like switching into a Sludge Bomb, it can switch into a Fire Blast or a Will-O-Wisp and get a Flash Fire boost, which makes Flare Blitz even more powerful.</p> <p><strong>Mudbray and Onix</strong>: Even though these two Pokemon are checked by Koffing, Koffing doesn't have any coverage moves to deal significant damage to them. That being said, neither likes taking a Will-O-Wisp.</p> ",
    "sets": [
      {
        "name": "Offensive",
        "description": "<h1>Moves</h1> <p>Sludge Bomb is Koffing's preferred STAB move, as it does good damage against neutral targets and threatens Pokemon like Spritzee and Mienfoo. Fire Blast complements Sludge Bomb, hitting targets that tank the latter such as Pawniard, Foongus, and Ferroseed. Will-O-Wisp neuters physical attackers such as Timburr and wears down Pokemon such as Mudbray and Onix that Koffing doesn't have coverage moves against. Thunderbolt pressures Flying and Water-types such as Wingull and Mareanie and prevents Koffing from being setup fodder to the likes of Nasty Plot Vullaby.</p> <h1>Set Details</h1> <p>Maximum Speed EVs and a Timid nature allow Koffing to outspeed and apply greater pressure to Pokemon such as slow Mienfoo, Dewpider, Timburr, and most Mudbray. Maximum Special Attack EVs are invested to get comfortable 2HKOs on Pokemon such as Pawniard, Mareanie, and Spritzee. Finally, the HP EVs enable Koffing to take advantage of its solid bulk and avoid being 2HKOed by a Flare Blitz from Ponyta. Eviolite allows Koffing to be even more tanky and helps absorbs Knock Offs from the likes of Mienfoo and Pawniard. Neutralizing Gas significantly lowers Mienfoo's longevity and prevents Koffing from being trapped by Diglett, Trapinch, or Wynaut.</p> <h1>Usage Tips</h1> <p>Koffing can easily switch in to many common unboosted attackers such as Pawniard, Foongus, and Timburr and can cripple them with Will-O-Wisp. Koffing should stay away from counters like Galarian Ponyta and Onix, and they should be removed from the game as soon as possible. Koffing's amazing coverage moves allows it to deal serious damage to very common walls in the tier such as Ferroseed, Spritzee, and Mareanie.</p> <h1>Team Options</h1> <p>Koffing is best used as a soft answer to many Pokemon and is valuable on a team that needs to check many Pokemon with one slot. Its coverage also works a lot better with Knock Off support from teammates. Teammates such as Vullaby and Pawniard appreciates Koffing because it checks Fighting-type Pokemon, Spritzee, and Grookey, and can burn Onix on the switch; Vullaby and Pawniard also deal with Psychic-type threats for Koffing. On the offensive side, Koffing's amazing coverage moves are able to put pressure on checks to common wallbreakers and setup sweepers such as Corphish and Shellder. Furthermore, Koffing appreciates an entry hazard setter as a single layer of Spikes will let Koffing OHKO Pawniard and Ferroseed. That being said, as opposing hazards also deal a ton of damage to Koffing especially with the constant switching that it has to do and its lack of a consistent form of recovery, having hazard removal is also appreciated.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 110102, "username": "jake"}, {"user_id": 32350, "username": "KSG"}, {"user_id": 255030, "username": "Berks"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "The Dutch Plumberjack"}, {"user_id": 91628, "username": "GatoDelFuego"}]}], "writtenBy": [{"user_id": 205691, "username": "ForgottenOnes"}]}
  },
  "Staryu": {"sets": [{"name": "Offensive"}, {"name": "Defensive"}, {"name": "Life Orb"}]},
  "Porygon": {
    "overview": "<p>Porygon is a threatening bulky attacker because of its boosted Tri Attack being difficult to switch into, great coverage options such as Psychic and Ice Beam, and ability to threaten prominent Pokemon like Timburr, Vullaby, and Onix. It can also run a defensive set that allows it to counter trappers like Diglett, Trapinch, and Wynaut with Trace and gain momentum with Teleport or spread paralysis with Thunder Wave. However, Porygon struggles with Fighting-type Pokemon such as Choice Scarf Mienfoo and Timburr due to these two outpacing and KOing it, while slower Mienfoo can tank a Psychic and OHKO with High Jump Kick. Additionally, Porygon cannot take on Steel-types like Ferroseed, Magnemite, and Pawniard because they can tank any of Porygon's attacks and cripple it with Thunder Wave or Knock Off. Porygon also struggles to take Knock Off as well, as losing Eviolite makes it unable to sponge attacks from Focus Sash Abra, Onix, and Ponyta, leaving it vulnerable to being KOed.</p> ",
    "comments": "<h1>Other Options</h1> <p>Thunderbolt can be used over Psychic to more effectively hit Pawniard while retaining coverage for Mareanie, but it is generally worse against Fighting-types. Recover can be used on Download sets to allow Porygon to stay healthy throughout the match; however, it would have to drop a coverage move or Agility. Running Thunderbolt over Thunder Wave or Tri Attack alongside Ice Beam gives it the best possible neutral coverage. A Choice Scarf Porygon set with Download can be used in order to revenge kill Mienfoo and can use Trick to hinder walls like Ferroseed.</p> <h1>Checks and Counters</h1> <p><strong>Fighting-types: Fighting-types like Mienfoo and Timburr are able to take care of Porygon using their Fighting-type STAB attacks, but they should be careful about switching into Tri Attack or being heavily damaged by Psychic.</p> <p><strong>Steel-types: Steel-types like Ferroseed, Pawniard, and Magnemite can take any attack from Porygon because of their resistance to its attacks. Pawniard and Ferroseed can also use Knock Off to make Porygon easier to take care of. Ferroseed can also use Thunder Wave to cripple Porygon so it can't outpace Timburr.</p> <p><strong>Knock Off: Knock Off users like Vullaby, Pawniard, and Ferroseed hinder Porygon through removing its Eviolite, making it unable to tank attacks from Ponyta and Abra.</p> <p><strong>Priority Attacks: Priority attacks like Mienfoo's Fake Out, Pawniard's Sucker Punch, and Grookey's Grassy Glide can revenge kill Agility Porygon because of its lack of recovery.</p> ",
    "sets": [
      {
        "name": "Download",
        "description": "<h1>Moves</h1> <p>Tri Attack hits targets that don't resist it hard after a Special Attack boost from Download. Psychic allows Porygon to take care of Mienfoo, Foongus, and Mareanie. Ice Beam is able to OHKO Onix, Archen, and Vullaby and is Porygon's best move against Ferroseed, as it resists Psychic and Tri Attack. Agility makes Porygon a good mid- or late-game sweeper when most of its checks are significantly weakened, allowing it to outspeed Choice Scarf users like Mienfoo and Vullaby.</p> <h1>Set Details</h1> <p>Maximum Special Attack and Speed investment with a Modest nature allows Porygon to hit as hard as possible and outpace Timburr, while the remaining EVs go into Defense to help it take physical attacks.</p> <h1>Usage Tips</h1> <p>Porygon should be saved for mid- or late-game once most of its threats are weakened or KOed so it can set up with Agility and sweep. Porygon should come in on a predicted switch, Stealth Rock from Onix, or after a teammate is knocked out to keep it healthy, but it should avoid setting up on Vulpix, Dewpider, or Abra, as coming in on them will give Porygon an Attack boost from Download instead of a Special Attack boost. Porygon can also be used on slower threats to soften them up for mid- or late-game, but be careful about switching it into a powerful attack, as, if it takes too much damage, it will be unable to set up with Agility and sweep. Make sure that Steel-types are weakened or KOed; once they are, Porygon can freely use its attacks. Do not allow Porygon to be chipped by entry hazards, as this makes it easier to take care of. Be sure to not leave Porygon in against Knock Off users such as Pawniard, Vullaby, and Ferroseed, as losing its Eviolite makes it less bulky and unable to tank attacks from Spritzee, Ponyta, and Grookey.</p> <h1>Team Options</h1> <p>Porygon appreciates entry hazard support from Onix, Ferroseed, Pawniard, and Mareanie because it makes it easier for Porygon to sweep; it especially goes well with Ferroseed for its Spikes support to wear down Pokemon like opposing Ferroseed, Pawniard, and Mienfoo. Pawniard also threatens Abra, which could otherwise hinder Porygon, with Sucker Punch. Pokemon that can get rid of entry hazards such as Staryu and Vullaby are great to avoid Porygon being poisoned from Toxic Spikes and worn down from Stealth Rock and Spikes. Vullaby can also tank priority attacks from Mienfoo and Grookey. Mienfoo, Diglett, and Ponyta are also good to pair with Porygon in order to help with taking down Steel-types like Ferroseed, Pawniard, and Magnemite that resist Porygon's attacks. Pokemon like Mienfoo, Pawniard, and Ferroseed can soften up Pokemon with Knock Off to make it easier for Porygon to sweep. Mareanie and Foongus are great to pair with Porygon due to them being able to switch into Fighting-type attacks from Mienfoo and Timburr.</p> "
      },
      {
        "name": "Trace",
        "description": "<h1>Moves</h1> <p>Tri Attack is a good STAB move to use against any Pokemon that does not resist it, such as Staryu and Spritzee, with the added benefit of a small chance to inflict status. Ice Beam is used to OHKO Diglett and 2HKO Onix, Mudbray, and Vullaby. Psychic can be used for Mareanie and on a predicted switch to Mienfoo or Timburr. Recover allows Porygon to keep itself healthy throughout the game. Thunder Wave is used to hinder switch-ins like Mienfoo, Pawniard, and Vullaby. Teleport can be used over Thunder Wave to keep momentum for the team and be less passive than Mareanie, Spritzee, and Foongus, as Porygon can lure its checks such as Mienfoo, Onix, and Ferroseed and pivot into a Pokemon that can take care of them.</p> <h1>Set Details</h1> <p>Running 236 HP EVs with 76 Special Defense EVs with a Calm nature allows Porygon to take hits from special attackers like Spritzee, Wingull, and Focus Sash Abra. Using 236 HP EVs with 196 Defense EVs allows Porygon to tank physical attacks from Onix and Diglett. Trace allows Porygon to copy Regenerator from Foongus and Mienfoo, the rare Flash Fire from Ponyta, and Volt Absorb from Chinchou to block Volt Switch, as well as to counter trappers like Trapinch and Diglett.</p> <h1>Usage Tips</h1> <p>Porygon can be used early-game to use Thunder Wave against Pokemon like Mienfoo or Teleport on predicted switches into checks like Pawniard and Mienfoo to safely get in a teammate to take care of them. Teleport can also be used to allow Porygon to take an attack and bring in frail Pokemon like Abra and Carvanha safely. However, Porygon should be careful about staying in against Knock Off users like Ferroseed, Vullaby, and Mienfoo, as losing Eviolite will make it unable to withstand attacks from Ponyta, Staryu, and Abra. It should switch in on a passive attack from Mareanie or Spritzee, a predicted switch, or an attack from Ponyta or Onix. It should use Tri Attack early-game to get off decent damage against most Pokemon that do not resist it with a small chance of statusing Pokemon like Pawniard and Mienfoo that will try to switch into Porygon's attacks. Ice Beam should be used on predicted switches into Vullaby and Onix, as it will deal major damage to them; additionally, if Porygon is running Psychic, try to use it on predicted switches into Mienfoo and Mareanie, as it will do a lot of damage to them.</p> <h1>Team Options</h1> <p>Stealth Rock setters such as Pawniard and Onix are great to pair with Porygon; Pawniard is able to come in on Knock Off from Ferroseed, while Onix can safely switch into Vullaby to take Knock Off and threaten it to switch out. Bulky Pokemon like Mareanie and Foongus can come in on Fighting-type attacks from Mienfoo and Timburr. Offensive Pokemon like Abra and Wingull are also good to pair with Porygon to check the aforementioned Fighting-types. Defog and Rapid Spin users like Vullaby and Staryu are good to get rid of entry hazards that allow Pokemon like Abra, Wingull, and Grookey to beat Porygon before it can use Recover. Vullaby and Staryu are also helpful by checking Fighting-types that threaten Porygon such as Timburr and Mienfoo, and Staryu is especially helpful against Corphish and Onix. Spritzee is another great Fighting-type check that can pass Wish to Porygon to keep it healthy and also absorb Knock Off from Pokemon like Vullaby, Timburr, and Mienfoo. Fighting-types like Mienfoo and Timburr can force out Steel-types like Pawniard and Ferroseed; in return, Porygon can wall special attackers such as Wingull, Abra, and Mareanie. Setup sweepers and wallbreakers such as Tyrunt, Scraggy, and Grookey appreciate Porygon's Teleport getting them in safely.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 449990, "username": "DC"}, {"user_id": 410251, "username": "zizalith"}, {"user_id": 255030, "username": "San Tomas"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Estronic"}, {"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 393488, "username": "Yami"}]}
  },
  "Omanyte": {"sets": [{"name": "Shell Smash"}, {"name": "Support"}]},
  "Kabuto": {"sets": [{"name": "Support"}]},
  "Chinchou": {"sets": [{"name": "Offensive Pivot"}]},
  "Natu": {"sets": [{"name": "Screens"}, {"name": "Offensive"}]},
  "Elekid": {"sets": [{"name": "Offensive"}]},
  "Magby": {"sets": [{"name": "Belly Drum"}]},
  "Treecko": {"sets": [{"name": "Sweeper"}]},
  "Zigzagoon": {
    "overview": "<p>Zigzagoon's unique access to the combination of Belly Drum and Extreme Speed makes it one of the deadliest setup sweepers in Little Cup. After a boost, Extreme Speed rips through most Pokemon that do not resist it; even the bulkiest of Mienfoo risk being OHKOed. However, Belly Drum's 50% recoil means that Zigzagoon typically only gets one chance to set up, and its poor bulk makes finding a setup turn difficult. Zigzagoon also struggles to break through common Rock- and Steel-types like Onix and Pawniard, which can survive a boosted Extreme Speed and retaliate with significant damage.</p> ",
    "comments": "<h1>Other Options</h1> <p>Zigzagoon's movepool is extremely shallow, and it has few good alternatives to the listed moves. Double-Edge is incredibly powerful and can OHKO slower Pokemon like Spritzee and Timburr after a Belly Drum. However, its massive recoil and lack of priority make it very situational. Substitute can allow for a free Belly Drum on a predicted status move, like Thunder Wave from Ferroseed or Porygon, but Zigzagoon's Substitutes are too frail to survive all but the weakest of hits even with Memento support. Lastly, Rock Smash can pick up a surprise OHKO on Pawniard, but Sticky Web or paralysis support is required, and Zigzagoon must remain wary of Sucker Punch.</p> <h1>Checks and Counters</h1> <p><strong>Rock- and Steel-types: Rock- and Steel-types such as Onix, Pawniard, and Magnemite can handle boosted Extreme Speed and hit Zigzagoon hard with their STAB attacks. Even though none of them can OHKO Zigzagoon, it is rarely at full health after setting up. Sturdy Onix deserves a special mention for its ability to survive and heal back to full health after taking a Seed Bomb, making it especially difficult for Zigzagoon to break through. Ferroseed can switch in on a predicted Extreme Speed and chip away at Zigzagoon with Iron Barbs, although standard sets fear a 2HKO from Thief.</p> <p><strong>Physically Defensive Pokemon: Physically bulkier Pokemon like Spritzee and Koffing can tank a boosted Extreme Speed if healthy and knock out a weakened Zigzagoon, although Thief can be annoying if Zigzagoon is healthy enough to survive a hit after stealing an Eviolite. Mienfoo and Timburr can fulfill a similar role with maximum Defense investment.</p> <p><strong>Abra: Focus Sash Abra can reliably survive a single hit thanks to its access to Magic Guard and fire back with Psychic or Counter.</p> <p><strong>Fake Out</strong>: Fake Out users like Mienfoo and Meowth can chip down Zigzagoon in conjunction with sacrifices or clever switches as long as it does not carry Protect.</p> ",
    "sets": [
      {
        "name": "Belly Drum",
        "description": "<h1>Moves</h1> <p>The combination of Belly Drum and Extreme Speed offers Zigzagoon nearly unrivaled sweeping potential. Apart from Rock-, Steel-, and Ghost-types, only the most physically defensive Pokemon in Little Cup, such as Spritzee and Timburr, can avoid being OHKOed by a boosted Extreme Speed. Zigzagoon's other moves work around targets that aren't threatened by Extreme Speed. Seed Bomb OHKOes Onix and the rare Frillish after a boost, while Thief can be useful against bulkier foes like Spritzee and Ferroseed; the former is OHKOed by Extreme Speed after losing its Eviolite, while the latter is 2HKOed by Thief a majority of the time. Protect allows Zigzagoon to avoid Fake Out, which out-prioritizes Extreme Speed and can chip it down.</p> <h1>Set Details</h1> <p>Berry Juice gives Zigzagoon its best opportunity to successfully use Belly Drum. Against a faster target, it can heal Zigzagoon to full health after it takes a hit so that Belly Drum can succeed; against a slower target, it negates Belly Drum's recoil and maximizes Zigzagoon's chances of surviving the turn. Maximum Attack investment lets Zigzagoon hit as hard as possible after Belly Drum. Speed is less important on Zigzagoon than on most sweepers due to Extreme Speed's priority, so the remaining EVs maximize Zigzagoon's defenses to assist in setting up. 132 HP EVs give Zigzagoon an even 22 HP, which allows it to trigger Berry Juice after using Belly Drum at full health. Quick Feet can be useful if Zigzagoon gets inflicted by status, as it allows Zigzagoon to outspeed Onix and hit it with Seed Bomb. Pickup can also be used to take a foe's consumed Berry Juice, although such situations are rare.</p> <h1>Usage Tips</h1> <p>Zigzagoon is best used to clean up weakened teams after its counters have been weakened or eliminated. Focus on pressuring Rock- and Steel- types like Onix and Pawniard; Arena Trap users like Diglett and Trapinch can be especially useful in this role. Knock Off support allows Zigzagoon to OHKO bulkier foes like Spritzee and Timburr and can chip frailer Pokemon that resist Extreme Speed like Pawniard into range. Once a sweep is possible, finding a successful Belly Drum is the next challenge. Support from Memento or dual screens allows Zigzagoon to set up on a wider array of Pokemon. Otherwise, try to find a turn to use Belly Drum against a passive foe like Spritzee or Mareanie that can't OHKO Zigzagoon.</p> <h1>Team Options</h1> <p>Diglett and Trapinch are fantastic partners for Zigzagoon; Diglett has the bonus of providing Memento support, while Trapinch can more reliably remove Pawniard and Onix due to its superior bulk and access to Giga Drain. Vullaby can help as well by luring in Rock- and Steel-types and pivoting to a trapper via U-turn. Like most sweepers, Zigzagoon benefits from entry hazard support from the likes of Dwebble and Pawniard; for example, Stealth Rock guarantees an OHKO on standard bulky Mienfoo and Mareanie. Sticky Web support, primarily provided by Dewpider, can neutralize Onix by allowing Zigzagoon to outspeed and hit it with Seed Bomb. Dual screens support provide an alternative to Memento, but few good users exist; Natu and Amaura are passable options.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 32350, "username": "KSG"}, {"user_id": 449990, "username": "Dreamcatcher"}, {"user_id": 208173, "username": "Fiend"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Estronic"}, {"user_id": 302985, "username": "lotiasite"}]}], "writtenBy": [{"user_id": 34723, "username": "iss"}]}
  },
  "Wingull": {
    "overview": "<p>Wingull is one of the fastest Pokemon in LC, and its STAB combination of Water and Flying has almost perfect coverage. It is able to weaken bulky Pokemon in the beginning of the game with U-turn, Knock Off, and Scald and can use its excellent Speed tier and powerful attacks to tear through weakened teams later in the game. Defensive Pokemon such as Mareanie, Ferroseed, and Spritzee cannot comfortably switch into Wingull's attacks, especially if they have lost their Eviolite to Knock Off from Wingull or a teammate. U-turn lets Wingull pivot into a trapper like Trapinch or Diglett to eliminate Ground-weak checks like Chinchou and Mareanie or build momentum. Wingull has some glaring flaws, however. Its awful bulk makes it crippled if it switches into any non-Ground-type attack, and it is quickly weakened by Life Orb recoil and Stealth Rock. Additionally, its primary attack, Hurricane, has only 70% accuracy, meaning Wingull will often fail to get important KOs.</p> ",
    "sets": [
      {
        "name": "Life Orb",
        "description": "<h1>Moves</h1> <p>Hurricane is Wingull's most powerful attack. Despite its shaky accuracy, the extra power is essential for important KOs like OHKOing Eviolite Oddish. Scald complements Hurricane as Wingull's other STAB attack; many Pokemon that resist Hurricane, like Onix and Pawniard, are KOed or severely damaged by Scald and do not appreciate its 30% chance to burn. Substitute lets Wingull take advantage of the many switches it forces; if Wingull uses Substitute as the opponent sends in a weakened Pokemon as KO fodder, it cannot easily be revenge killed, giving it the chance to freely launch attacks and decimate the opponent's team. Substitute also lets Wingull evade Pawniard's Sucker Punch. Air Slash gives Wingull a more reliable Flying-type STAB attack to consistently KO weakened Pokemon such as Mareanie and Corphish. This is particularly helpful due to Wingull's fragility; if Wingull misses Hurricane, the opposing Pokemon can typically KO Wingull back. Alternatively, U-turn lets Wingull build momentum. After weakening opposing Pokemon with its powerful STAB attacks, it can switch out to a teammate to trap or otherwise take advantage of its switch-ins. Knock Off is an additional option that can cripple walls; after they lose their Berry Juice or Eviolite, they become much worse at switching into Wingull and its teammates. However, Knock Off's low damage output means that if the foe stays in on Knock Off, they will lose their item but almost always withstand it to KO Wingull back. Knock Off can be effective if Wingull forces a switch, but the other moves are generally more consistent. Life Orb significantly boosts Wingull's power, letting it use its good STAB combination and Speed tier to tear through the opponent's team every time it comes in. However, Berry Juice can be used to give Wingull more opportunities to switch in.</p> <h1>Set Details</h1> <p>A Timid nature and 236 Speed EVs let Wingull reach 19 Speed, which lets it Speed tie with Jolly Ponyta and Timid Galarian Ponyta and leaves Diglett as the only unboosted Pokemon faster than it. Although Wingull may use some physical attacks, those attacks are used for their utility rather than their power, so a Timid nature is used to avoid reducing Wingull's bulk. The remaining 36 EVs are invested in Defense to help Wingull better survive physical priority attacks such as Timburr's Mach Punch and Pawniard's Sucker Punch. 0 HP IVs drop Wingull's HP to 19, which increases its longevity by making it only lose 1HP from Life Orb recoil. If using Berry Juice, however, Wingull should run the usual 31 HP IVs.</p> <h1>Usage Tips</h1> <p>Due to Wingull's poor bulk, it should avoid switching into attacks directly. It is better to bring it in once a teammate has been KOed or through U-turn support from teammates such as Vullaby. Wingull also does not like to take Stealth Rock damage, so keeping entry hazards off the field is very helpful for Wingull. If the opponent does not have any good switch-ins to Wingull, Wingull can use its powerful STAB attacks right away. If there are specially bulky Pokemon that are able to switch into Wingull, however, Wingull should spend the beginning of the game using Knock Off to remove their items or U-turn to gain momentum or pivot into a teammate to trap them. Mid- to late-game, once its switch-ins have been weakened, Wingull should be brought in safely and then spam its powerful STAB attacks to KO anything that switches in.</p> <h1>Team Options</h1> <p>Due to Wingull's fragility and Life Orb recoil, entry hazard removal is necessary for Wingull to safely switch in multiple times during a match. Thus, Wingull appreciates the hazard control provided by Rapid Spin Drilbur or a Defog user such as Vullaby or Timburr. Wingull's U-turn works excellently alongside trappers such as Diglett and Trapinch, since Wingull can lure in defensive Pokemon such as Chinchou and Mareanie and pivot to a trapper to eliminate them. Wingull also appreciates teammates such as Vullaby, which can use U-turn to help Wingull switch in without taking damage. Since Wingull is often revenge killed by Choice Scarf users, it benefits from bulky teammates that are able to switch into their attacks, such as Onix and Spritzee. Other Water-types, such as Corphish and Krabby, appreciate Wingull's ability to weaken Water-type switch-ins such as Ferroseed, Oddish, and Mareanie with Hurricane and Knock Off.</p> <h1>Other Options</h1> <p>Rain Dance guarantees that Wingull's Hurricane will hit and powers up its Water-type attacks. Wingull would typically prefer to spend a turn attacking than setting up Rain Dance, but the additional power and accuracy can be very useful. Protect lets Wingull scout Choice item users and avoid being revenge killed by Trapinch's First Impression, although Substitute is typically more effective at dealing with these tactics. Roost gives Wingull a solution to its durability problem; however, Wingull already struggles to choose its four moves and would rather spend a turn attacking than healing, so Berry Juice is more effective at keeping it healthy.</p> <h1>Checks and Counters</h1> <p><strong>Stealth Rock: Wingull is extremely susceptible to chip damage. The combination of Stealth Rock and Life Orb recoil can prevent Wingull from being effective beyond KOing one Pokemon, as a weakened Wingull loses to any form of priority. Even resisted attacks such as Timburr's Mach Punch deal 30%, which may KO if Wingull has switched into Stealth Rock and attacked twice.</p> <p><strong>Specially Defensive Walls</strong>: Although bulky Pokemon such as Mareanie, Spritzee, and Ferroseed take a significant amount of damage from Life Orb Hurricane and do not appreciate having their Eviolite removed, they are able to take any one attack from Wingull even without Eviolite and do enough damage to KO Wingull or prevent it from switching in again.</p> <p><strong>Choice Scarf Users</strong>: Choice Scarf users such as Vullaby and Galarian Farfetch'd are able to outspeed and OHKO Wingull, although they cannot switch in to Knock Off or Wingull's STAB attacks.</p> <p><strong>Priority: Wingull's Speed advantage is neutralized by priority attacks such as Pawniard's Sucker Punch, which can KO it before it can attack. Wingull can often be revenge killed by weak priority attacks because it is easily worn down.</p> <p><strong>Chinchou</strong>: Chinchou is the only Pokemon in LC with a typing that resists both of Wingull's STAB attacks, and its typing and impressive bulk let it reliably switch into Wingull multiple times in a match. Wingull can cripple Chinchou with Knock Off or pivot to a teammate to trap it, but it is unable to defeat Chinchou by itself.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 420389, "username": "Stoward"}, {"user_id": 208173, "username": "Fiend"}, {"user_id": 110102, "username": "jake"}]}, {"name": "Grammar checked by", "members": [{"user_id": 331519, "username": "CryoGyro"}, {"user_id": 240732, "username": "Estronic"}]}], "writtenBy": [{"user_id": 202058, "username": "Expulso"}]}
  },
  "Carvanha": {"sets": [{"name": "Cleaner"}, {"name": "Special Attacker"}]},
  "Trapinch": {
    "overview": "<p>Trapinch's rather good bulk and access to Arena Trap allow it to switch into, trap, and KO specific Pokemon. Notably, Trapinch is guaranteed to remove Onix and has great odds to remove Pawniard thanks to its ability to switch into these Pokemon, something Diglett cannot do. However, due to its slow Speed, Trapinch fears Scald burns and Iron Head flinches far more than Diglett does. First Impression gives Trapinch some extra utility against many faster Pokemon, though many of the move's targets often run Protect for this specific reason. Trapinch will often be at low HP after it has trapped its target, and due to its low Speed, it will likely only attack again with a priority move.</p> ",
    "comments": "<h1>Other Options</h1> <p>Toxic can be useful to status Spritzee and Porygon, which Trapinch does not threaten otherwise, but the move can be hard to fit over other options. An alternative EV spread of 156 HP / 36 Atk / 76 Def / 196 Spe with a Jolly nature is useful, albeit only on Sticky Web teams. The additional Speed alongside Sticky Web enables Trapinch to trap several more Pokemon such as Mareanie and some variants of Chinchou. Rock Slide can threaten Flying-types and prevent Trapinch from giving free turns to some of the more threatening Pokemon in the tier.</p> <h1>Checks and Counters</h1> <p>It should be noted that Trapinch cannot be countered directly, as its ability Arena Trap prevents switching out if the Pokemon is grounded. With the ability to pick its matchups, Trapinch often needs to be dealt with after it has picked up a KO. Fortunately, Trapinch will frequently take significant damage in the process, which can leave it vulnerable to almost any strong attacker in the tier.</p> <p><strong>Water-types: Staryu and Wingull can punish Trapinch with relatively few downsides. Both are rather difficult to switch into outside of specific counters, which often forces Trapinch to stay in and be KOed. Mareanie is threatened by a healthy Trapinch, but it can often burn Trapinch with Scald, allowing it to stall out Earthquake with Recover.</p> <p><strong>Grass-types: With the exception of Ferroseed, Grass-types fear little from Trapinch after its first turn. Grookey and Foongus are solid examples of capable revenge killers, though Grookey does need to be mindful of First Impression.</p> <p><strong>Woobat: Trapinch gives Woobat free turns, which can can end the game immediately. Very few Pokemon in LC can survive a +4 Heat Wave or Stored Power, and Woobat can be hard to revenge kill.</p> <p><strong>Porygon</strong>: Porygon is incredibly bulky and can Trace Arena Trap, locking Trapinch on the field. If Porygon is unable to KO Trapinch immediately, it can stall out Superpower with Recover. Alternatively, Download Porygon can often KO Trapinch reliably and make use of this relatively free turn.</p> ",
    "sets": [
      {
        "name": "Trapper",
        "description": "<h1>Moves</h1> <p>Earthquake is mandatory in order for Trapinch to threaten the likes of Ponyta and Pawniard. Giga Drain is primarily for Onix, though it also allows Trapinch to remain healthy enough to potentially trap another Pokemon if needed. First Impression offers some marginal utility to Trapinch once its primary targets have been KOed; it is potentially useful against a foe like Galarian Ponyta or a low health Vullaby after a Defense drop from Weak Armor. Superpower allows Trapinch to greatly damage Ferroseed and OHKO Pawniard. Feint can be used instead for substantially weaker priority that is nonetheless useful for picking off a low health Pokemon; it can be particularly useful against Abra, which will often use Protect to avoid First Impression. Alternatively, Protect is useful to scout for Onix's Explosion, especially when Trapinch needs to remain healthy throughout the match.</p> <h1>Set Details</h1> <p>The Speed EVs let Trapinch hit 9 Speed to outspeed Ferroseed. The remaining EVs are tailored to trap and remove Onix as efficiently as possible, with Eviolite bolstering Trapinch's ability to handle Dragon Dance Onix and other powerful physical attackers. A Careful nature is desirable to give Trapinch a better chance to survive a Scald from Mareanie in a pinch, and it will not drop Trapinch's Special Attack.</p> <h1>Usage Tips</h1> <p>It is most important to prioritize Trapinch's targets in any given game, and such targets will vary depending on your team's structure regardless of team archetype, with the biggest priorities tending to be Onix and Diglett. Trapinch is a support Pokemon and thus will seek to trap the counters of its teammates. Typically, Trapinch is able to switch directly into what it is meant to remove and can use the appropriate move without issue. In some cases, preserving Trapinch to nail a revenge killer like Abra or Grookey with First Impression later in the game can be particularly useful.</p> <h1>Team Options</h1> <p>Vullaby and Ponyta love Trapinch's ability to switch into and remove two of their best checks in Pawniard and Onix, and Ponyta also appreciates Trapinch counter trapping Diglett. Spritzee forms a great defensive pairing with Trapinch, as the two can take care of each other's checks. Ferroseed also shares good type synergy with Trapinch, as it acts as a solid answer to Staryu and Grass-types, which prove to be troublesome for teams built around Trapinch. Offensive Porygon appreciates the removal of Steel-types and is a useful teammate due to its good bulk.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 420389, "username": "Stoward"}, {"user_id": 449990, "username": "Dreamcatcher"}, {"user_id": 255030, "username": "San Tomas"}]}, {"name": "Grammar checked by", "members": [{"user_id": 175616, "username": "Empress"}, {"user_id": 240732, "username": "Estronic"}]}], "writtenBy": [{"user_id": 208173, "username": "Fiend"}]}
  },
  "Corphish": {
    "overview": "<p>Corphish is one of the best wallbreakers in LC thanks to its ability Adaptability and its Water typing, allowing it to take care of Pokemon like Onix and Ponyta. It also has access to priority with Aqua Jet, letting it take down faster Pokemon such as Vullaby after a Swords Dance and Stealth Rock damage, and coverage moves such as Knock Off and Superpower that allow it to threaten Frillish and Ferroseed. Crabhammer is one of its best neutral moves, as it can get off decent damage on most Pokemon and become even more threatening after a Swords Dance or Dragon Dance. However, Corphish struggles with Grass-types like Oddish, Electric-types like Chinchou, and especially Croagunk because of its ability Dry Skin, rendering Corphish's Water-type attacks useless, and resistances to with Superpower and Knock Off. Corphish also has trouble with special attackers like Wingull, Spritzee, and Galarian Ponyta due to its subpar Special Defense stat.</p> ",
    "comments": "<h1>Other Options</h1> <p>Life Orb can be used to enable Corphish to OHKO Galarian Ponyta with Aqua Jet and 2HKO most of the metagame, but it is not worth the drop in bulk and recoil. A Choice Scarf or Choice Band set can look appealing thanks to Corphish's strong STAB moves and ability to cripple walls with Switcheroo, but the Choice lock and the drop in bulk make it not worthwhile.</p> <h1>Checks and Counters</h1> <p><strong>Grass-types: Oddish gives Corphish trouble, as it can use its STAB attacks or Strength Sap to take care of it. If Corphish is not running Superpower, Ferroseed can also wall it, as it can take a boosted Knock Off and greatly weaken Corphish with its Grass-type STAB attacks.</p> <p><strong>Croagunk: Corphish falls short against Croagunk thanks to its typing and its ability Dry Skin, allowing it to absorb Corphish's STAB attacks.</p> <p><strong>Chinchou</strong>: Chinchou can use its Electric-type attacks to OHKO Corphish.</p> <p><strong>Mareanie</strong>: Mareanie is able to wall Corphish thanks to its resistance to Crabhammer and ability to tank any attack from it after using Iron Defense.</p> <p><strong>Timburr and Spritzee</strong>: Pokemon like Timburr and Spritzee are both able to take a Crabhammer from Corphish and severely damage it back with Drain Punch or Moonblast, respectively.</p> <p><strong>Special Attackers</strong>: Corphish is more vulnerable to special attacks because of its low Special Defense stat, so Galarian Ponyta and Spritzee can check Corphish because of their ability to either outpace or take a hit from Corphish.</p> <p><strong>Status</strong>: Will-O-Wisp users like Frillish can cripple Corphish for the rest of the game. Thunder Wave will cripple it and leave it unable to outpace most Pokemon. Poison from Toxic Spikes will also put Corphish on a timer and eventually take care of it.</p> ",
    "sets": [
      {
        "name": "Wallbreaker",
        "description": "<h1>Moves</h1> <p>Crabhammer is Corphish's main way to do major damage to Spritzee, Timburr, and Galarian Farfetch'd while also OHKOing Vullaby after Stealth Rock damage, Ground-types such as Onix, and Fire-types such as Ponyta. Swords Dance-boosted Aqua Jet lets Corphish net KOs on faster Pokemon like Vullaby after Stealth Rock damage. Knock Off is great for getting rid of Eviolite on switch-ins such as Spritzee and Ferroseed. Swords Dance lets Corphish become a fearsome wallbreaker to take care of walls such as Mareanie and Spritzee. Alternatively, Dragon Dance allows it to outpace Pokemon it could not unboosted, such as Galarian Ponyta, Galarian Farfetch'd, and Vullaby. Superpower can be used over Knock Off in order to OHKO Ferroseed after a Swords Dance.</p> <h1>Set Details</h1> <p>Adaptability boosts Corphish's STAB attacks, which makes it a powerful attacker right off the bat. An Adamant nature with maximum Attack EVs further helps its wallbreaking abilities. 236 Speed EVs allow it to outpace Pokemon such as Timburr and Frillish.</p> <h1>Usage Tips</h1> <p>Corphish can force out Onix and Vullaby, so use Knock Off on incoming foes to remove their items. Use Swords Dance or Dragon Dance on Pokemon it can force out such as Ponyta and Drilbur. Use Corphish mid-game once its checks are weakened to use Swords Dance or Dragon Dance to sweep. Corphish can also be used early-game to remove items with Knock Off from the opposing team, assisting it and its teammates throughout the game. Be careful around special attackers such as Spritzee, Mareanie, and Galarian Ponyta, as Corphish cannot take their attacks well, and Will-O-Wisp users like Frillish and Ponyta, because Corphish cannot OHKO these without setting up with Swords Dance or Dragon Dance and can be crippled for the rest of the game.</p> <h1>Team Options</h1> <p>Onix and Mudbray are able to support Corphish with Stealth Rock to chip Pokemon on the switch and take care of Mareanie and Croagunk. Spikes users such as Ferroseed are great to use to wear down Pokemon and threaten Chinchou. Dewpider is useful for setting up Sticky Web, allowing Corphish to outpace Pokemon it could not before, and also greatly chip down Pokemon like Timburr with a Water Bubble-boosted Scald. Krabby goes well with Corphish to form a wallbreaking duo, as both can help take care of each other's threats. Timburr and Galarian Farfetch'd are great teammates due to their ability to take on Ferroseed and take Knock Off from Pawniard and Ferroseed well. Galarian Farfetch'd appreciates Corphish for being able to check Dragon Dance Onix and cripple Oddish and Mareanie with Knock Off, making it easier for Galarian Farfetch'd to take care of them. Ponyta is a great partner for Corphish, as it is able to take down Grass-types such as Oddish and Ferroseed. Corphish also appreciates Ponyta due to Will-O-Wisp crippling physical attackers such as Galarian Farfetch'd and Vullaby. Vullaby is a great partner to take care of Grass-types that Corphish struggles with such as Oddish and Ferroseed. Diglett is helpful for trapping and OHKOing Chinchou and Croagunk with Earthquake. Pawniard helps Corphish by pressuring Pokemon such as Spritzee as well as Shellder and Galarian Ponyta with Sucker Punch. Spritzee can deal with troubling Fighting-types that threaten an unboosted Corphish such as Timburr and Galarian Farfetch'd, making it easier for Corphish to set up.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 420389, "username": "Stoward"}, {"user_id": 110102, "username": "jake"}, {"user_id": 208173, "username": "Fiend"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Estronic"}, {"user_id": 232216, "username": "The Dutch Plumberjack"}]}], "writtenBy": [{"user_id": 393488, "username": "Yami"}]}
  },
  "Wynaut": {
    "overview": "<p>As the only Pokemon with the ability Shadow Tag in LC, Wynaut is able to trap all non-Ghost type Pokemon. An impressive base HP stat of 95 lets Wynaut absorb a hit and almost always KO the trapped attacker with Counter or Mirror Coat. However, Wynaut suffers from a shallow movepool that lacks any offensive moves, making it a reactive trapper that relies on good predictions. Its mediocre Speed and lack of recovery outside Berry Juice jeopardize its longevity and ability to trap consistently. Additionally, Wynaut faces competition from other trappers such as Diglett and Trapinch that offer more reliable, flexible, and proactive trapping.</p> ",
    "comments": "<h1>Other Options</h1> <p>Safeguard can be used over Destiny Bond to protect Wynaut from status moves such as Shellos's Toxic and Foongus's Spore, helping Wynaut better trap them. Tickle can also be used over Destiny Bond to make trapping easier or weaken targets enough for an incoming sweeper. A bulkier EV spread of 236 HP / 52 Def / 52 SpD can be utilized to improve Wynaut's bulk but lets it be outsped by Timburr and Shellos, making it unable to use Encore first. Eviolite can be utilized instead of Berry Juice to bolster Wynaut's defenses to let it handle more hits, but it makes Wynaut lose out on its only reliable source of recovery.</p> <h1>Checks and Counters</h1> <p><strong>Dark-types: Dark-types such as Pawniard, Vullaby, and Scraggy are able to outspeed and KO Wynaut with Knock Off. Furthermore, they serve as a switch-in from Volt Switch users since they are immune to Mirror Coat.</p> <p><strong>Ghost-types: Ghost-types such as Frillish are not affected by Shadow Tag and pressure Wynaut with their STAB moves. Also, they can function as switch-ins from U-turn users due to their immunity to Counter.</p> <p><strong>Knock Off Users: Knock Off users such as Pawniard, Vullaby, and Mienfoo can limit Wynaut's effectiveness by KOing it or removing its only source of recovery in Berry Juice.</p> <p><strong>Taunt Users: Taunt users such as Onix and Mienfoo outspeed Wynaut and force it to only use Counter or Mirror Coat. In the case of Onix, it is able to create prediction battles between Stealth Rock and Rock Blast that favor it because Counter only doubles the damage of the last hit of Rock Blast.</p> <p><strong>VoltTurn Users: U-turn and Volt Switch users such as Vullaby, Mienfoo, and Chinchou are able to avoid getting trapped by Wynaut and switch into a Ghost- or Dark-type that is immune to Counter or Mirror Coat.</p> <p><strong>Spritzee: Spritzee is able to ignore Encore due to its ability in Aroma Veil. Furthermore, its Nasty Plot set is able to boost on Wynaut, leading to prediction battles between Destiny Bond and Mirror Coat.</p> ",
    "sets": [
      {
        "name": "Trapper",
        "description": "<h1>Moves</h1> <p>Counter and Mirror Coat allow Wynaut to OHKO most attackers after taking a hit. Encore guarantees that you will choose correctly between Counter or Mirror Coat, depending on the type of move, or can switch to a Pokemon that is able to better exploit the move to preserve Wynaut for later usage. Destiny Bond gives Wynaut one last opportunity to KO an unsuspecting revenge killer or pivot.</p> <h1>Set Details</h1> <p>76 HP EVs, along with 52 Defense and 52 Special Defense EVs, help Wynaut reach 27 HP / 12 Def / 12 SpD, helping it tank both physical and special hits. 252 EVs in Speed with a Jolly nature allow Wynaut to reach 13 Speed, outspeeding defensive trapping targets such as Shellos, Timburr, Ferroseed, and Foongus. Berry Juice is the preferred item, as it provides Wynaut with a source of recovery to help it better absorb damage.</p> <h1>Usage Tips</h1> <p>When using Wynaut to trap certain defensive targets, it should not be sent into strong attacking moves, especially Knock Off, to preserve Berry Juice. Instead, Wynaut should enter the battle after a switch from an offensive pivot or as a revenge killer against slow, passive, and bulky walls. It is able to switch in on resisted attacks like Timburr's Drain Punch or on weak offensive moves like Shellos's Scald and use Encore for a more reliable KO with Counter or Mirror Coat. Wynaut can also utilize Encore to lock foes into a setup or non-damaging move in order to safely bring in a check or counter. Likewise, Wynaut can freely revenge kill Choice Scarf users such as Galarian Farfetch'd when they are locked into resisted attacks such as Close Combat.</p> <h1>Team Options</h1> <p>Wynaut appreciates the removal of Pawniard and Vullaby, as both Dark-types threaten Wynaut's effectiveness and ability to switch in. Timburr, Ponyta, and Onix serve as key checks to them. Wynaut is able to complement these checks by removing bulky Water-types like Shellos and Mareanie. Entry hazard setters such as Pawniard, Onix, and Ferroseed benefit from Wynaut's ability to trap Timburr. Setup sweepers such as Nasty Plot Vullaby, Agility Porygon, and Shellder relish an opportunity to boost and sweep after the removal of certain walls or by exploiting an Encore-locked foe. Lastly, offensive pivots such as Vullaby and Mienfoo assist Wynaut by providing more scenarios for it to come into play and trap foes.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 110102, "username": "jake"}, {"user_id": 420389, "username": "Stoward"}, {"user_id": 208173, "username": "Fiend"}]}, {"name": "Grammar checked by", "members": [{"user_id": 331519, "username": "CryoGyro"}, {"user_id": 240732, "username": "Estronic"}]}], "writtenBy": [{"user_id": 449990, "username": "Dreamcatcher"}]}
  },
  "Shellos": {
    "overview": "<p>Shellos is one of the bulkiest Pokemon in LC thanks to its high HP, reliable recovery, and Sticky Hold ability, which prevents its Eviolite from being removed. Its physical bulk and lack of weaknesses means it can often stonewall physical attackers and sweepers, and even special sweepers struggle to break Shellos before it removes their boosts with Clear Smog. It can sometimes function as a wincon, owing to the rarity of strong Grass- and Electric-type moves and its ability to outlast most foes. However, Shellos is also relatively passive and can be smothered by a prepared team, especially ones that spread poison or carry Taunt, and it struggles mightily against the common bulky Grass-types, Foongus and Ferroseed. Shellos's lack of resistances can also lead to it being worn down by the tier's most powerful breakers, like Grookey, Abra, and Reckless Mienfoo. Nonetheless, it is a sturdy Pokemon that can find a home in many defensive cores.</p> ",
    "comments": "<h1>Other Options</h1> <p>Ice Beam is an option over Clear Smog or Toxic to hit Foongus, but dropping either move sacrifices some defensive capability. Earth Power is an option to hit Mareanie. Mirror Coat lets Shellos surprise and KO special attackers like Porygon, and Counter does the same to physical attackers like Timburr, both owing to Shellos's tremendous bulk and HP and the difficulty of OHKOing it. Shellos can run a variety of boosting moves to more directly serve as a wincon, including a set of Curse, Amnesia, Facade, and Rest; this set needs extensive team support, though, and is unable to beat Taunt users and Ghost-types. An investment of 68 HP / 132 Def / 20 SpD / 244 Spe with a Bold nature can be run with Amnesia and Acid Armor as a wincon that sets up on physical attackers.</p> <h1>Checks and Counters</h1> <p><strong>Grass-types: Grookey can break Shellos with its extremely powerful Grassy Glide and Wood Hammer. Foongus can outlast Shellos by healing while hitting it with Giga Drain, in addition to resisting Scald and being immune to Toxic. Foongus also can generate momentum by using Spore. Ferroseed walls Shellos while threatening it with Giga Drain or Bullet Seed, but must be wary of Shellos stalling out Giga Drain PP with Recover. Foongus must be wary of the rare Ice Beam.</p> <p><strong>Electric-types: Magnemite can KO Shellos with its powerful Thunderbolt or pivot with Volt Switch, though it cannot switch into Scald well.</p> <p><strong>Poison: Poison, especially Toxic, can invalidate Shellos's ability to wall threats. Running Toxic on unusual Pokemon that Shellos likes to come in against, such as Ponyta, Timburr, and Diglett, can surprise and inhibit it. Shellos also must fear being forced onto the field when Toxic Spikes are up. Shellos often appreciates its own burn to prevent being poisoned.</p> ",
    "sets": [
      {
        "name": "Defensive",
        "description": "<h1>Moves</h1> <p>Scald deals reliable damage to neutral foes while spreading invaluable burns to render physical attackers useless. Recover keeps Shellos healthy enough to deal with multiple foes or outstall Pokemon that cannot break it like physical Vullaby. Clear Smog helps to check Pokemon that would otherwise try to set up on Shellos, like Nasty Plot Vullaby, and can prevent a sweep in motion if Shellos is healthy enough to survive a hit. Toxic lets Shellos outlast most foes and threaten bulky walls like Spritzee and Porygon, spreading chip damage so that a bulkier team can win a longer game.</p> <h1>Set Details</h1> <p>Eviolite, in tandem with Sticky Hold, makes Shellos incredibly bulky and one of the few Pokemon not threatened by Knock Off. A Bold nature and the given defensive investment give Shellos even Defense and Special Defense to take advantage of Eviolite. Maximum HP investment gives Shellos a sky-high 27 HP and reduces the threat from Final Gambit users like Diglett. The remaining investment in Speed lets Shellos Speed tie with standard Timburr and outspeed standard Spritzee.</p> <h1>Usage Tips</h1> <p>Shellos functions as a wet blanket to smother offensive momentum and checks potent threats like Ponyta, Timburr, physical Vullaby, and Dragon Dance Onix. You should prioritize using Recover and keeping Shellos's health high so that it can repeatedly take heavy hits. Against setup sweepers like Nasty Plot Vullaby, maintaining enough health to survive a hit and then use Clear Smog is crucial. Shellos should generally not stay in against Pokemon that can poison it, such as Mareanie. Beware Mold Breaker Pancham, which is the only Pokemon able to remove Shellos's Eviolite with Knock Off.</p> <h1>Team Options</h1> <p>Shellos fits well on teams that need a blanket answer to physical attackers, especially Ponyta and Ground-types like Onix and Mudbray. In turn, it appreciates Pokemon that can switch into Foongus, Grookey, and Ferroseed, and it partners well with its own Ferroseed. Teammates that can set up on Foongus make for great partners, such as Ferroseed with Spikes. Diglett can trap and remove Magnemite, and Trapinch can trap Grookey. Shellos appreciates a Poison-type teammate that can absorb Toxic Spikes, like Foongus and Mareanie; it can also take advantage of its own Toxic Spikes set by Mareanie and Koffing.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 208173, "username": "Fiend"}, {"user_id": 420389, "username": "Stoward"}, {"user_id": 150971, "username": "Coconut"}]}, {"name": "Grammar checked by", "members": [{"user_id": 216033, "username": "Winry"}, {"user_id": 240732, "username": "Estronic"}]}], "writtenBy": [{"user_id": 32350, "username": "KSG"}]}
  },
  "Croagunk": {"sets": [{"name": "Nasty Plot"}]},
  "Drilbur": {
    "overview": "<p>Drilbur's decent Speed tier combined with its access to fantastic coverage in Earthquake and Rock Slide and boosting moves in Swords Dance and Rapid Spin allows it to be a niche sweeper in LC. Furthermore, Drilbur is one of the only viable spinners and makes for a decent support Pokemon, being able to set up entry hazards while also removing opposing entry hazards. However, Drilbur finds it hard to break through teams without Swords Dance, and if it did, it would find it hard to set up due to its low bulk. Furthermore, it is easily beaten by common threats such as Mienfoo, Grookey, and Staryu.</p> ",
    "sets": [
      {
        "name": "Offensive Rapid Spin",
        "description": "<h1>Set Description</h1> <p>Rapid Spin allows Drilbur to remove entry hazards and gives it a +1 Speed boost, allowing it to outpace threats that would outspeed or Speed tie with Drilbur otherwise, such as Abra, Mienfoo, and Staryu. Earthquake is Drilbur's best STAB move, allowing it to deal decent damage to every Pokemon that doesn't resist it. Rock Slide gives Drilbur perfect neutral coverage, hitting Pokemon that are immune to Earthquake such as Vullaby and Wingull. Swords Dance can be used to increase Drilbur's Attack and pairs well with Rapid Spin, making Drilbur a threatening setup sweeper. Alternatively, Stealth Rock allows Drilbur to deal chip damage to opposing Pokemon switching in.</p> <h1>Set Details</h1> <p>Maximum Speed investment in addition to a Jolly nature makes Drilbur as fast as possible, allowing it to outspeed Pawniard and Vullaby. 76 EVs in Attack allow Drilbur to 2HKO most Vullaby sets after Stealth Rock. The rest of the EVs are placed into Defense and Special Defense to allow Drilbur to take hits from Diglett, Vullaby, and Mudbray. Berry Juice is the preferred item in order for Drilbur to have access to recovery, but Eviolite allows Drilbur to tank hits non-Eviolite sets would not be able to take, such as +2 Dark Pulse from Vullaby, High Jump Kick from Mienfoo, and Psychic from Abra. Mold Breaker is used to help surpass abilities like Sturdy from Onix and Levitate from Koffing.</p> <h1>Usage Tips</h1> <p>Drilbur's access to a powerful Earthquake can force Pokemon such as Pawniard and Onix to switch out. This gives Drilbur the opportunity to remove entry hazards with Rapid Spin, set Stealth Rock to support its teammates, or boost its Attack with Swords Dance. Pokemon that are faster or capable of revenge killing Drilbur, such as Staryu, Wingull, and Grookey, should be removed from the game early to help Drilbur either get a Rapid Spin off for other Pokemon to sweep or act as a late-game sweeper itself. When you know a Flying-type is going to potentially switch into Earthquake, use Rock Slide to catch them off guard.</p> <h1>Team Options</h1> <p>Flying-types such as Vullaby and Wingull make for good partners for Drilbur, since they can threaten Grass-types like Foongus and Grookey as well as Fighting-types like Timburr and Mienfoo. Vulpix and Ponyta in particular make for good teammates because they can break through Ferroseed, and in return, Drilbur can remove entry hazards and weaken Mareanie. Finally, checks to Water-types are appreciated by Drilbur, making Grass-types like Ferroseed, Foongus, and Grookey good partners.</p> <h1>Other Options</h1> <p>Sand Rush is an alternative over Mold Breaker to outspeed foes in sand, but it requires additional support from Hippopotas and Drilbur will lose out on Mold Breaker being able to bypass Levitate. Life Orb can be used over Berry Juice to hit bulky Pokemon like Spritzee and Ferroseed harder, but it is not worth getting rid of the recovery Berry Juice provides. A set with Stealth Rock, Swords Dance, Rapid Spin, and Earthquake can be used, but keep in mind that this will omit Drilbur's ability to cover Flying-types.</p> <h1>Checks and Counters</h1> <p><strong>Water-types: Offensive Water-types such as Staryu and Wingull can outspeed and easily OHKO Drilbur with their STAB moves. Bulky Water-types like Frillish and Shellos render Drilbur useless and force it out, with Frillish also functioning as a spinblocker.</p> <p><strong>Grass-types: Grookey can OHKO Drilbur with Grassy Glide. Ferroseed and Foongus shrug off Drilbur's attacks pretty easily and can dish a lot of damage with Giga Drain and Bullet Seed.</p> <p><strong>Fighting-types</strong>: Both Timburr and offensive Mienfoo can tank an Earthquake from Drilbur. Timburr can then beat Drilbur with a combination of Drain Punch and Mach Punch, while Mienfoo can OHKO it with High Jump Kick.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 195129, "username": "Nineage"}, {"user_id": 420389, "username": "Stoward"}, {"user_id": 449990, "username": "DC"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Estronic"}, {"user_id": 297659, "username": "deetah"}]}], "writtenBy": [{"user_id": 323515, "username": "seo."}, {"user_id": 506687, "username": "ImperialGamer517"}]}
  },
  "Timburr": {
    "overview": "<p>Timburr's strong offensive typing, high Attack stat, and decent bulk make it a terrific glue Pokemon on a variety of team styles. It has an excellent movepool, including a strong STAB priority move in Mach Punch, semi-reliable recovery with Drain Punch, and a variety of coverage options including Knock Off, Fire Punch, Thunder Punch and Poison Jab. Furthermore, Defog makes Timburr one of the best entry hazard removers in the tier, especially since it resists Stealth Rock and can check common hazard setters such as Ferroseed and Onix. Timburr has two excellent abilities, allowing it to perform different roles on a team. Iron Fist increases immediate wallbreaking potential, while Guts allows Timburr to act as a status absorber. However, its typing leaves it weak to the common Flying-types in the tier, notably Vullaby and Wingull, and it is commonly walled by Poison- and Fairy-types such as Oddish and Spritzee. It is also limited by a mediocre Speed stat and has to run significant investment to attempt to outspeed its checks at the cost of offensive power or bulk.</p> ",
    "comments": "<h1>Other Options</h1> <p>Poison Jab is an alternative coverage move that allows Timburr to hit Spritzee hard, but the lack of coverage elsewhere means it should only be used on teams that struggle with Spritzee. Timburr can run multiple elemental punch moves to act as a lure for checks. Toxic is an option to reduce the longevity of bulky foes with reliable recovery such as Shellos, Spritzee, and Roost Vullaby.</p> <h1>Checks and Counters</h1> <p><strong>Fairy-types: Spritzee and Cottonee switch into Timburr and can KO it with their STAB Fairy-type attacks. Nasty Plot Spritzee is particularly threatening, as it can start setting up on Timburr. Both should be wary of Poison Jab, however.</p> <p><strong>Poison-types: Oddish, Mareanie, Croagunk, and Koffing are all able to switch into Timburr. Oddish can recover its health with Strength Sap, but it should be wary of switching into Ice Punch. Mareanie can set up Iron Defense against Timburr if it lacks Thunder Punch. Koffing completely walls Timburr regardless of coverage, while Croagunk can set up Nasty Plot against it. However, most of these Pokemon struggle to do significant damage to Timburr.</p> <p><strong>Flying-types: Vullaby and Wingull threaten Timburr with their strong STAB attacks, although they should be wary when switching in, since Timburr threatens them with Thunder Punch. Additionally, Vullaby is hit hard by Drain Punch, and Wingull is heavily damaged by Knock Off.</p> <p><strong>Psychic-types: Psychic-types such as Galarian Ponyta are particularly threatening because they can switch into Timburr and threaten to KO it with their STAB attacks. However, they should be wary of switching into Knock Off.</p> ",
    "sets": [
      {
        "name": "Bulky Attacker",
        "description": "<h1>Moves</h1> <p>Drain Punch's recovery is important for keeping Timburr healthy and allowing it to face foes such as Onix and Ferroseed one-on-one. Mach Punch revenge kills faster threats such as Vullaby, Dragon Dance Scraggy, and Dragon Dance Onix. Knock Off allows Timburr to weaken all foes by removing their items while also hitting Psychic- and Ghost-types super effectively. Defog is used to remove all entry hazards on the field, helping teammates to switch in more easily. Thunder Punch hits Mareanie, Vullaby, and Dewpider which can otherwise switch into Timburr. Fire Punch hits Oddish and Croagunk hard and is more powerful in sun. Ice Punch can also be run to hit Oddish, Vullaby, and Mudbray super effectively.</p> <h1>Set Details</h1> <p>The EV spread gives Timburr the ability to 2HKO key threats such as Mareanie and Oddish with the appropriate coverage move while maintaining significant bulk. Alternative EV spreads can be run to customize which foes Timburr will perform better against. For example, a spread of 76 HP / 196 Atk / 236 Def with an Adamant nature can be used so that Timburr isn't OHKOed by Adamant Vullaby's Brave Bird; this spread is also the best against opposing Timburr and other physical attackers such as Onix. It is worth noting that Timburr's Speed is also somewhat customizable. Running 156 Speed EVs allows it to outspeed anything up to 17 Speed after Sticky Web, and 76 Speed EVs outspeed standard defensive Oddish sets. Iron Fist is typically used on this set to improve the damage output of Drain Punch, Mach Punch, and coverage punches. Guts is an alternative option that allows Timburr to fare better against potential burns from Ponyta, Koffing, and other status users.</p> <h1>Usage Tips</h1> <p>Timburr is an excellent switch-in to Ferroseed, Onix, and Pawniard and can generate offensive momentum by forcing them to switch out. It is good to keep the opponent guessing Timburr's moveset, since a Knock Off into a suitable coverage move can help make huge progress in a game. Early-game, Timburr should attempt to punish expected switches by using Knock Off. This can soften the opponent's team up for teammates to take advantage of late-game. Alternatively, it should use Defog on expected switches to remove entry hazards, particularly Sticky Web. Timburr can be used to counter common physical setup sweepers such as Onix and Shellder. If the team is weak to such sweepers, Timburr should be preserved to prevent a late-game sweep and should avoid having its item removed by Knock Off. If Guts is being used, Timburr can switch into expected Will-O-Wisp from Ponyta or Frillish to gain an Attack boost.</p> <h1>Team Options</h1> <p>Flying-types such as Vullaby appreciate Timburr's ability to remove Stealth Rock and switch into Steel- and Rock-types such as Pawniard and Onix. Other Fighting-types, particularly Galarian Farfetch'd, can work with Timburr to break through their shared checks. This works particularly well because Timburr and Galarian Farfetch'd can distribute coverage moves between them, allowing them to break through any Fighting-type check. Setup sweepers such as Shellder and Dragon Dance Onix benefit greatly from Timburr wearing down their checks with Knock Off and chip damage. Fairy-types are a threat to Timburr, so Poison-types such as Mareanie and Oddish help it. The prevalence of Flying-types means that Timburr appreciates switch-ins such as Onix and Pawniard. Pawniard is a particularly good teammate because it can threaten Fairy-, Flying-, and Psychic-types such as Spritzee, Vullaby, and Galarian-Ponyta.</p> "
      },
      {
        "name": "Bulk Up",
        "description": "<h1>Moves</h1> <p>Bulk Up turns Timburr into a powerful sweeper that many teams will struggle to deal with. Drain Punch is the primary attack for this set, recovering health and boosting longevity. Mach Punch provides revenge killing utility, regardless of whether Timburr is boosted or not. Knock Off allows Timburr to weaken all foes by removing their items while also hitting Psychic- and Ghost-types super effectively. It also hits Poison-types like Mareanie and Koffing neutrally, making them more susceptible to Drain Punch. Thunder Punch can be used to hit Mareanie and Vullaby very hard, with Mareanie being particularly threatening because it can set up with Iron Defense. Fire Punch and Poison Jab are alternative coverage options in case the team has trouble with Oddish and Spritzee, respectively, but forgoing Thunder Punch will leave Timburr walled by Mareanie.</p> <h1>Set Details</h1> <p>236 Special Defense EVs with a Careful nature and Eviolite prevent Timburr from being easily worn down by special attackers. For example, it significantly reduces the damage from Modest Vullaby's Air Slash, allowing Timburr to take the hit and recover most of the damage with Drain Punch. Guts is the preferred ability, since the boost from burns allows Timburr to take Mareanie one-on-one if it lacks Iron Defense. The EV spread can be customized to help Timburr set up on different foes. For example, it can forgo Special Defense investment in favor of Attack or Speed investment if the team otherwise handles special attackers very well.</p> <h1>Usage Tips</h1> <p>This set is best used as a late-game sweeper when its checks have been sufficiently weakened. Try to weaken and pressure Timburr's checks, primarily Spritzee and Oddish, by removing their items and keeping them at low health. Timburr can use Knock Off early-game to make a late-game sweep easier. It can also still act as a check to Rock- and Steel-types, primarily Onix and Pawniard. However, it should be used sparingly against them so that it can retain its item and stay close to full health to help a late-game sweep. It is worth noting that Timburr cannot 2HKO Eviolite Onix with Drain Punch or OHKO Pawniard with Mach Punch, but it can use them as setup opportunities. It is best to use Bulk Up on expected switches and foes that struggle to deal significant damage to Timburr, such as Ferroseed. The uncommonness of the Bulk Up set means that Timburr can bluff a standard bulky attacker set and catch the opponent off guard by setting up later in the game.</p> <h1>Team Options</h1> <p>Flying-types like Vullaby can help by switching into and threatening Oddish, which walls Timburr with Strength Sap. Knock Off users such as Vullaby and Pawniard can help weaken Timburr's checks to make a late-game sweep easier. Timburr in turn helps Vullaby by switching into Rock-types like Onix, and Timburr can work with Pawniard to break through defensive cores. Pawniard is a particularly good partner because it punishes Oddish's Strength Sap with Defiant and puts Spritzee under pressure with Knock Off and Iron Head. Switch-ins to Fairy-types such as Ferroseed and Mareanie also help, since they can help pressure Spritzee. Mareanie is particularly useful, as it can remove Toxic Spikes and set Toxic Spikes itself to help wear down Spritzee. Flying-type checks such as Onix and Pawniard are able to switch into threats such as Vullaby. Entry hazard setters such as Ferroseed, Dwebble, and Onix help Timburr by damaging its checks, potentially putting them in KO range. Hazard removal from the likes of Drilbur and Vullaby is also appreciated, since Spikes and Toxic Spikes in particular wear Timburr down.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 32350, "username": "KSG"}, {"user_id": 420389, "username": "Stoward"}, {"user_id": 195129, "username": "Nineage"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Estronic"}, {"user_id": 331519, "username": "CryoGyro"}]}], "writtenBy": [{"user_id": 381336, "username": "EnzoLapras"}]}
  },
  "Darumaka-Galar": {
    "sets": [
      {
        "name": "Choice Scarf",
        "description": "<p>With one of the highest Attack stats in LC combined with Hustle, Galarian Darumaka can make a potent Choice Scarf wallbreaker, although Hustle's inaccuracy can make it a double-edged blade. This set capitalizes on its good movepool; Ice Punch is its main STAB move, hitting Flying-types like Vullaby. Superpower OHKOes Munchlax, while Zen Headbutt 2HKOes Mareanie after Stealth Rock. U-turn can put pressure on the opponent and helps maintain momentum. This EV spread allows Galarian Darumaka to hit its maximum Attack; combined with a Choice Scarf, this allows Darumaka to put on pressure right away. Teams that struggle with defensive walls like Ferroseed and Munchlax benefit from Galarian Darumaka's presence, as its power and speed with a Choice Scarf allow it to punch through and pressure defensive teams. However, it takes a hefty amount from Timburr's Mach Punch and can't outspeed Choice Scarf Galarian Farfetch'd. Because of this, teammates that can deal with Fighting-types are useful, like Spritzee and Oddish. Since Darumaka is weak to Stealth Rock, it also appreciates entry hazard control from Pokemon like Vullaby and Drilbur.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 110102, "username": "jake"}, {"user_id": 255030, "username": "Berks"}]}, {"name": "Grammar checked by", "members": [{"user_id": 297659, "username": "deetah"}]}], "writtenBy": [{"user_id": 202097, "username": "Gummy"}]}
  },
  "Dwebble": {
    "overview": "<p>With access to Stealth Rock and Spikes, along with the ability to beat the tier's most common Defogger, Dwebble is one of the leading entry hazard stackers in the tier. Shell Smash coupled with a decent Attack stat also allows it to become a dangerous sweeper; these two sets require significantly different counterplay, which can trip an unprepared opponent up. Sturdy gives Dwebble opportunities to set entry hazards or use Shell Smash. However, its mediocre defensive typing gives it very few resistances, and its reliance on its item leaves it susceptible to Knock Off. Additionally, it faces competition from Ferroseed, which can also set the same entry hazards while offering more defensive utility, although it lacks the offensive presence that Dwebble's Shell Smash set provides. It also faces competition from Onix, which is faster and has a better offensive typing. Onix can run Sturdy sets too, though it tends not to, leaving Dwebble as the tier's best Sturdy user.</p> ",
    "comments": "<h1>Other Options</h1> <p>A Weak Armor set can be run with a spread of 36 HP / 156 Atk / 76 Def / 236 Spe alongside a Jolly nature and Eviolite. This functions similarly to the suicide lead set, but it finds it easier to set hazards against Knock Off users while being able to check Vullaby. Dwebble can choose to run a Bug-type STAB move; this offers no meaningful coverage, however. The Shell Smash set can run Aerial Ace to hit Timburr and Mienfoo, but this still doesn't KO them at +2 and generally isn’t worthwhile.</p> <h1>Checks and Counters</h1> <p><strong>Fighting-types: While Timburr and Mienfoo don't like getting hit by Knock Off, they can counter all Dwebble sets - Eviolite sets survive any move from Dwebble even at +2. Timburr is particularly threatening, as it can heal back up with Drain Punch, remove entry hazards with Defog, and KO Dwebble with priority Mach Punch. Mienfoo can break its Sturdy with Fake Out and then KO Dwebble with High Jump Kick.</p> <p><strong>Water-types</strong>: Staryu is able to remove Dwebble's entry hazards with Rapid Spin, gaining a Speed boost while doing so, while taking any hit from the Shell Smash set and OHKO it in return. Corphish has access to Knock Off and Aqua Jet, allowing it to easily beat Dwebble one-on-one.</p> <p><strong>Multi-hit moves: Multi-hit moves hinder all Dwebble sets, as they can break through Sturdy and potentially OHKO it. Onix with Rock Blast is particularly threatening, as it outspeeds Dwebble and hits it super effectively.</p> <p><strong>Ground-types: Ground-types are threatening, since Dwebble lacks the coverage to hit them super effectively. Mudbray is particularly threatening because it gains Defense boosts from each hit.</p> <p><strong>Ferroseed: Ferroseed can take any hit from the Shell Smash set, even at +2, and use Knock Off and Thunder Wave to hinder both Dwebble sets.</p> <p><strong>Grookey</strong>: While it is unable to switch directly into Dwebble, Grookey can revenge kill Dwebble with Grassy Glide.</p> ",
    "sets": [
      {
        "name": "Suicide Lead",
        "description": "<h1>Moves</h1> <p>Stealth Rock damages and wears down every Pokemon in the metagame. Spikes is useful to damage all grounded foes. Knock Off allows Dwebble to remove the foe's item to help its teammates. Counter can be used to OHKO a physical foe such as Timburr if it chooses to attack. Rock Blast is a terrifying multi-hit STAB attack, threatening to OHKO foes like Berry Juice Vullaby and frail threats like Abra and Dewpider that have a Focus Sash. Alternatively, Earthquake can be used to deal more damage to Rock-resistant foes.</p> <h1>Set Details</h1> <p>Maximum EVs and a Speed-boosting nature are used to get out as many entry hazards as possible before being KOed. Maximum Attack is used because Dwebble relies on Sturdy and Berry Juice for longevity, meaning it has no need for defensive investment. There are enough remaining EVs to increase its HP stat, but this is avoided so that Berry Juice is guaranteed to fully restore its health and reactivate Sturdy. Sturdy guarantees that Dwebble can take a hit from full HP, giving it an extra turn to set entry hazards. Another option is to run a Hasty nature with 0 Defense IVs, which allows Dwebble to OHKO Timburr and offensive Mienfoo with Counter if they use Knock Off.</p> <h1>Usage Tips</h1> <p>As the name of this set indicates, Dwebble is used as a lead. The main objective of this set is to put up multiple entry hazards before being KOed. However, preserving Dwebble can be advantageous in some situations where it can be sacrificed later in the game to provide offensive momentum. Typically, Dwebble will rarely be using its offensive moves, since the utility of stacking entry hazards is preferable to the utility of Knock Off or other offensive moves.</p> <h1>Team Options</h1> <p>Offensive teams benefit most from Dwebble, as they can pressure the opponent and make it difficult for them to find an opportunity to remove entry hazards. Setup sweepers like Dragon Dance Scraggy and Nasty Plot Vullaby appreciate entry hazards breaking Sturdy on their foes and wearing down their checks. Pawniard can punish Defog with Defiant and therefore makes for a good partner. Frillish is immune to Rapid Spin and is able to switch in against the most prominent user of the move, Staryu, making it a good pick on entry hazard-stacking teams. Having a Rapid Spin user on the team is useful for removing entry hazards from your side of the field. Offensive threats such as Grookey, Abra, and Choice Scarf Mienfoo appreciate hazard support, as it helps to put their checks in range of an OHKO.</p> "
      },
      {
        "name": "Shell Smash Sweeper",
        "description": "<h1>Moves</h1> <p>Shell Smash raises Dwebble's Attack and Speed by 2 stages, drastically increasing its power and allowing it to outspeed the entire unboosted metagame. Rock Blast is generally the preferred STAB move, as it is the most accurate Rock-type move with good power and will often hit at least as hard as Rock Slide due to Little Cup's low HP totals. It also breaks through Focus Sash and Sturdy users. Alternatively, Stone Edge can be chosen for more consistent damage, if it hits, and to bypass Berry Juice on foes like Weak Armor Vullaby. Earthquake is Dwebble's best coverage move, hitting the Rock-resistant Pawniard and Onix super effectively, and it gets a neutral hit against other foes like Timburr and Mudbray. Knock Off provides good neutral coverage, with the utility of removing the foe's Eviolite and weakening them. Counter and Stealth Rock are niche alternative moves.</p> <h1>Set Details</h1> <p>Maximum Attack EVs and an Attack-boosting nature are used to optimize Dwebble's sweeping power. Maximum Speed EVs allow Dwebble to outspeed the entire metagame after a Shell Smash boost, only tying with the rare Choice Scarf Diglett. There is no HP investment to ensure that Berry Juice reactivates Sturdy. Sturdy guarantees that Dwebbles survives one hit when at full health, allowing it to take a hit while setting up. Berry Juice restores its HP to full, which reduces Dwebble’s susceptibility to being picked off by weak priority moves.</p> <h1>Usage Tips</h1> <p>Try to avoid switching Dwebble into entry hazards at all costs, since this will stop Sturdy from activating and will prevent a safe setup with Shell Smash. Avoid being hit by Knock Off as well, since Dwebble's item is important to give it setup opportunities. Dwebble should be used as a late-game sweeper, setting up when its checks are sufficiently weakened. Try to bring Dwebble in on a free switch, such as after a Pokemon has fainted or via a slow U-turn, so it doesn't lose its Berry Juice early by switching into an attack. Weaken or remove bulky Pokemon like Mudbray, Spritzee, and Timburr before attempting to sweep with Dwebble, because they can take even a boosted hit and retaliate for lots of damage. Try to remove priority move users, as they can easily pick off Dwebble after its defenses are lowered by Shell Smash. With Sturdy intact, Dwebble can also act as a countermeasure for opposing sweepers that don't have multi-hit moves.</p> <h1>Team Options</h1> <p>Entry hazards from Pokemon like Ferroseed and Pawniard wear down opposing Pokemon, allowing Dwebble to KO more foes. A teammate that provides entry hazard removal such as Staryu, Defog Timburr, or Vullaby, is essential for helping to preserve Dwebble's Sturdy. Pokemon that can bring Dwebble in safely like U-turn Mienfoo and Vullaby are good partners. Pokemon like Giga Drain Ferroseed and Staryu that deal with bulky Ground-types are helpful. Mareanie and Spritzee are good team choices as well because they can deal with Timburr. Trappers such as Diglett and Wynaut help Dwebble by removing or weakening its defensive checks. Knock Off support from Pokemon like Timburr and Mareanie is appreciated, since very few Pokemon will be able to take Dwebble's boosted moves without an Eviolite.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 195129, "username": "Nineage"}, {"user_id": 150971, "username": "Coconut"}, {"user_id": 32350, "username": "KSG"}]}, {"name": "Grammar checked by", "members": [{"user_id": 168392, "username": "P Squared"}, {"user_id": 262594, "username": "Milak"}]}], "writtenBy": [{"user_id": 315003, "username": "Kipkluif"}, {"user_id": 381336, "username": "EnzoLapras"}]}
  },
  "Scraggy": {
    "overview": "<p>With a diverse movepool, a decent stat spread, and a great offensive typing, Scraggy is a strong offensive threat in LC. Its unique typing gives it access to STAB on strong moves such as High Jump Kick, Knock Off, and Drain Punch. Its access to Knock Off also allows it to support other teammates by removing items from opposing Pokemon and helps it sweep with powerful moves such as High Jump Kick, while coverage moves help it break through its checks. Its solid bulk gives it opportunities to set up with Dragon Dance and be a potent sweeper. Scraggy also has the option of two abilities to help it sweep: Moxie allows it to become stronger every time it KOes a foe, while Shed Skin allows it to set up on status inducers. Unfortunately, Scraggy's typing leaves it very weak to Fairy-types and common Flying- and Fighting-types. Additionally, Scraggy must pick between its potential coverage moves, leaving it walled by one of its checks. Lastly, Scraggy lacks immediate power and needs support to break through its checks despite its coverage options.</p> ",
    "comments": "<h1>Other Options</h1> <p>A Choice Scarf set can be run with Moxie to form a potent sweeper, but it struggles to break through its checks due to its lack of immediate damage. Poison Jab can be used to hit Morelull and Cottonee harder, but the flinches from Iron Head are generally more useful. An Intimidate support set can be run to set up on physical attackers, particularly Onix, but it misses out on the sweeping potential that Scraggy has. Alternatively, Bulk Up can be run in tandem with Dragon Dance and Drain Punch to form a bulky sweeper with decent recovery.</p> <h1>Checks and Counters</h1> <p><strong>Fairy-types: Spritzee resists both of Scraggy's STAB moves and OHKOes it in return. Nasty Plot Spritzee sets can be broken through more easily, however. It should also be wary of Iron Head and Poison Jab.</p> <p><strong>Poison-types: Oddish and Mareanie resist Scraggy's Fighting STAB attacks and do not take much damage from Knock Off. Oddish uses Strength Sap to prevent Scraggy setting up, and Mareanie can cripple it with Scald burns. Both should be wary of Zen Headbutt.</p> <p><strong>Fighting-types: Croagunk, Timburr, and Galarian Farfetch'd can take an attack from Scraggy and OHKO in return with a Fighting-type STAB move. Croagunk and Timburr also have strong priority in Vacuum Wave and Mach Punch, respectively.</p> <p><strong>Faster Choice Scarf Users: Faster Choice Scarf users such as Galarian Farfetch'd outspeed and KO Scraggy.</p> ",
    "sets": [
      {
        "name": "Dragon Dance Sweeper",
        "description": "<h1>Moves</h1> <p>Dragon Dance allows Scraggy to outspeed the entire unboosted metagame, reaching 21 Speed, and break through foes it wouldn't be able to otherwise. High Jump Kick is a powerful STAB attack used for breaking through neutral targets. For example, +1 High Jump Kick OHKOes most Berry Juice Vullaby sets after Stealth Rock damage. However, Drain Punch can be used for its recovery and to avoid taking damage from misses. Knock Off hits Ghost- and Psychic-types that resist Scraggy's Fighting STAB attack, with the extra utility of removing the target's item. Iron Head is used for hitting Fairy-types like Spritzee, while Zen Headbutt is an option for hitting Fighting- and Poison-types such as Croagunk, Oddish, and Mareanie.</p> <h1>Set Details</h1> <p>This set has Speed and Attack maximized to help its sweeping ability, with an Adamant ability to improve the damage rolls on defensive foes such as Eviolite Spritzee. Berry Juice helps Scraggy set up on defensive Pokemon that lack the ability to OHKO it, such as Mareanie and Ferroseed. Alternatively, Eviolite can be used so that Scraggy can set up on more offensive foes such as Pawniard and Onix. If you're running Berry Juice, the remaining EVs should be invested in HP for extra mixed bulk; they should be invested in Defense or Special Defense if using Eviolite so that the benefit of Eviolite can be maximized. Moxie is preferred as the ability for its greater sweeping potential, with the drawback being that it gives Scraggy a harder time setting up compared to Shed Skin. Alternatively, Shed Skin allows Scraggy to absorb status ailments, most notably burns, giving it a good chance of shaking the status off while setting up on Pokemon such as Mareanie and Ponyta.</p> <h1>Usage Tips</h1> <p>Scraggy is best used as a late-game sweeper and should set up when its checks are suitably weakened. It should try to set up on Dark-types such as Pawniard, Rock-types such as Onix, or Steel-types such as Ferroseed. These are all threatened by Scraggy's Fighting STAB moves and struggle to OHKO it even without Eviolite. If Shed Skin is being used, set up on status users such as Mareanie and Ferroseed. Try to use Knock Off early- and mid-game on Scraggy's checks to make a late-game sweep easier to achieve. Avoid letting Scraggy accrue too much damage prior to setting up so that it is less vulnerable to priority moves. Scraggy will struggle to sweep if its checks are insufficiently worn down. Spritzee and Timburr are particularly threatening, since Scraggy struggles to break through the former even with Iron Head, while the latter threatens it with Mach Punch.</p> <h1>Team Options</h1> <p>Knock Off users such as Vullaby make good partners by making opposing Pokemon easier for Scraggy to break when set up. Dual screens users like Natu can give Scraggy multiple setup opportunities in the same match and also leave it less susceptible to priority moves. Scraggy can be used in a core stacking Fighting-types with Timburr or Galarian Farfetch'd, since they have access to Knock Off and useful coverage moves for wearing down their shared checks. Pivots such as Vullaby and Chinchou provide good support by safely bringing Scraggy in, either by slow pivoting or by using their pivot move on a predicted switch. Entry hazard removers such as Timburr and Vullaby are useful, since Scraggy struggles to sweep with Sticky Web present, and removing layers of Spikes helps keep Scraggy out of range of priority attacks. Diglett can use Memento to give Scraggy a good setup opportunity while also being able to trap key threats. Pokemon that can pressure Spritzee and Timburr, such as Mareanie and Oddish, also make great teammates.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 32350, "username": "KSG"}, {"user_id": 150971, "username": "Coconut"}, {"user_id": 420389, "username": "Stoward"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "The Dutch Plumberjack"}, {"user_id": 336073, "username": "Rabia"}]}], "writtenBy": [{"user_id": 381336, "username": "EnzoLapras"}]}
  },
  "Tirtouga": {"sets": [{"name": "Defensive"}, {"name": "Shell Smash"}]},
  "Archen": {"sets": [{"name": "Offensive"}]},
  "Foongus": {
    "overview": "<p>Foongus's good defensive typing, bulk, and access to Regenerator make it one of the best defensive Pokemon in LC. Its access to Regenerator helps with longevity, allowing it to repeatedly switch into opposing threats. It can check common Fighting-, Water-, and Fairy-types such as Mienfoo, Mareanie, and Spritzee. It is one of the few Pokemon in LC with access to Spore, making it one of the best status users in the tier. However, its typing leaves it weak to common Flying-types such as Vullaby, as well as Fire- and Psychic-types like Ponyta and Abra. It also struggles to make progress in games against Ferroseed and has difficulty with Pawniard if another foe has been put to sleep.</p> ",
    "comments": "<h1>Other Options</h1> <p>It is worth noting that outside of the four moves listed above, Foongus's movepool is very limited. Therefore, alternative moves should only be used in specific matchups. Stun Spore can be used to paralyze multiple foes. Clear Smog can be used to prevent setup sweepers from setting up. An alternative EV spread of 124 HP / 236 Def / 76 SpD with a Bold nature can be used to make Foongus a better Fighting-type check at the cost of not being able to check special attackers like Staryu.</p> <h1>Checks and Counters</h1> <p><strong>Steel-types: Steel-types such as Ferroseed and Pawniard resist both of Foongus's STAB attacks. While Pawniard does not appreciate Spore, Ferroseed is particularly problematic because it can switch into Foongus and safely set entry hazards, while Foongus can barely do anything to it.</p> <p><strong>Vullaby: Vullaby is able to switch into any of Foongus's attacks and has Overcoat, which gives it an immunity to Spore. Furthermore, it can then threaten Foongus with Brave Bird or set up with Nasty Plot. It is worth noting that less bulky variants take significant damage from Sludge Bomb and do not appreciate being poisoned.</p> <p><strong>Flying-types</strong>: Flying-types such as Wingull and Woobat are able to threaten Foongus offensively. They can switch in on the turn Foongus uses Synthesis, but they should be wary of Spore.</p> <p><strong>Psychic-types: Psychic-types such as Abra and Galarian Ponyta are able to threaten Foongus offensively with their STAB attacks. Galarian Ponyta is particularly threatening, as the Eviolite set can switch into Foongus's attacks.</p> <p><strong>Fire-types: Fire-types such as Vulpix and Ponyta threaten Foongus offensively with their powerful STAB attacks. However, neither of them wants to be put to sleep with Spore.</p> ",
    "sets": [
      {
        "name": "Defensive Pivot",
        "description": "<h1>Moves</h1> <p>Spore temporarily disables a foe, potentially creating a 6v5 scenario. Giga Drain is a STAB attack that increases Foongus's longevity. Sludge Bomb is a more powerful STAB attack that allows Foongus to hit Grass-resistant foes that switch into it and potentially poison them. Synthesis gives Foongus recovery and increases its longevity.</p> <h1>Set Details</h1> <p>The given EV spread gives Foongus good mixed bulk. With Eviolite, It hits 25 HP and 21 in Defense and Special Defense. This allows it to avoid the 2HKO from Reckless non-Choice Band Mienfoo's High Jump Kick, take on Eviolite Staryu in a one-on-one situation, and even survive a Psychic from Focus Sash Abra at full HP. Regenerator allows it to switch in and out freely, recovering a significant amount of health each time it does so.</p> <h1>Usage Tips</h1> <p>Foongus can be brought in on common Fighting- and Water-types such as Mienfoo and Mareanie, as well as against the less common Grass- and Fairy-types such as Grookey and Spritzee. Try to keep its health high with Regenerator and Synthesis so that it can continue to pivot in on offensive threats throughout the match. Be careful when using Spore, since certain foes may be switched in to absorb it once their role in the match has been fulfilled. Foongus's ability to shut down opposing threats decreases greatly when a foe has been put to sleep. Aggressive plays are recommended if the foe has a healthy Ferroseed, such as double switching into a Fighting- or Fire-type teammate.</p> <h1>Team Options</h1> <p>Onix and Foongus have good synergy because Foongus can check Grass-, Water-, and Fighting-types that threaten Onix, while Onix can check Flying- and Fire-types that threaten Foongus. Pawniard appreciates Foongus being able to check Fighting-types, while Pawniard helps by switching into Abra and Flying-types that threaten Foongus. Mienfoo and Mareanie can form a Regenerator core with Foongus that can be difficult to deal with if their checks have been removed. Grounded teammates appreciate Foongus's ability to switch into and remove Toxic Spikes. Fire-types such as Ponyta and Vulpix can pressure Steel-types that can wall Foongus. Fighting-types such as Timburr and Mienfoo make good teammates, as they can switch into and threaten Ferroseed and Pawniard.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 449990, "username": "Dreamcatcher"}, {"user_id": 32350, "username": "KSG"}, {"user_id": 208173, "username": "Fiend"}]}, {"name": "Grammar checked by", "members": [{"user_id": 262594, "username": "Milak"}, {"user_id": 240732, "username": "Estronic"}]}], "writtenBy": [{"user_id": 381336, "username": "EnzoLapras"}]}
  },
  "Frillish": {
    "overview": "<p>Frillish is a strong defensive wall with reliable recovery and useful utility moves, allowing it to stop a variety of strong offensive threats such as Ponyta, Drilbur, and Galarian Ponyta. Will-O-Wisp and Hex form a deadly combination, dealing significant damage and crippling physical threats such as Galarian Farfetch'd. Its Ghost typing also allows it to spinblock effectively while threatening common Rapid Spin users such as Drilbur. However, its effectiveness is limited by the prevalence of Knock Off, meaning Dark-types can easily force it out. Additionally, this can create setup opportunities for Dark-types such as Vullaby and Scraggy.</p> ",
    "comments": "<h1>Other Options</h1> <p>A Choice Scarf set can be run with Water Spout and Trick to form a dangerous surprise set, but it struggles to break through Frillish's checks due to its mediocre Special Attack. Shadow Ball can be run instead of Hex for more consistent damage output. However, there isn't a huge difference in damage output between unboosted Hex and Shadow Ball. Psychic can be used to OHKO Croagunk, which can otherwise switch freely into Scald. Ice Beam is a useful coverage option for Grass-type switch-ins such as Oddish. Energy Ball or Giga Drain can be used to hit other Water-types for more damage, such as other Frillish and Corphish. Strength Sap is an alternative recovery move that also cripples the target but reduces Frillish's longevity against the common Pawniard. Water Absorb can be used over Cursed Body, but it is considered worse because Frillish takes little damage from Water-type attacks anyway.</p> <h1>Checks and Counters</h1> <p><strong>Dark-types: Vullaby and Scraggy are able to set up on Frillish and threaten it with Knock Off. Vullaby is particularly threatening because its Nasty Plot set isn't affected by Will-O-Wisp burns, which other Dark-types tend to fear.</p> <p><strong>Electric-types: Chinchou and Magnemite can be threatening with their strong STAB attacks. However, Chinchou cannot OHKO Frillish with Eviolite intact, giving Frillish opportunities to scout its set, while Magnemite struggles to switch into Frillish's attacks.</p> <p><strong>Grass-types: Oddish, Bulbasaur, and Ferroseed can all switch into Frillish and typically force it out. However, they are all forced out if Giga Drain is disabled by Cursed Body. Bulbasaur is particularly threatening, as it can set up Growth against Frillish.</p> <p><strong>Status Conditions: Poisoning Frillish through Toxic Spikes or Toxic massively reduce its longevity. If paralyzed, Frillish is unable to wait for Cursed Body to activate and is forced out.</p> ",
    "sets": [
      {
        "name": "Special Tank",
        "description": "<h1>Moves</h1> <p>Hex is used to deal significant damage to a target with a status condition. Will-O-Wisp burns the target, reducing damage from physical attacks while boosting the power of Hex. Recover is used for reliable recovery, increasing Frillish's longevity. Scald allows Frillish to reliably check important threats such as Ponyta and Onix and also has the chance to power up Hex if a Pokemon that resists Water gets burned. It can also help to chip and potentially burn common switch-ins to Frillish, such as Vullaby and Pawniard. Taunt can be used to prevent recovery on defensive Pokemon such as Shellos and Mareanie or prevent slow Pokemon such as Dewpider and Ferroseed from setting up entry hazards.</p> <h1>Set Details</h1> <p>The HP and Defense investment enables Frillish to take two Earthquakes from Drilbur and Onix. The Speed investment allows it to outspeed Zigzagoon, Adamant Corphish, defensive Mudbray, and other physical threats. It can also take the opportunity to burn opposing Pokemon with Will-O-Wisp before taking damage. Eviolite is used as the item to further increase bulk, allowing Frillish to reach 21 Defense and 22 Special Defense. Cursed Body is the preferred ability and can potentially disable a super effective attack. Although it's unreliable due to its activation chance, most foes only run one super effective move against Frillish, meaning it can keep using Recover until Cursed Body activates in tight situations. An alternative spread of 236 HP / 116 Def / 76 SpA / 36 Spe with a Bold nature can be run for increased bulk while outspeeding bulky Timburr.</p> <h1>Usage Tips</h1> <p>Frillish should be brought in on weak defensive Pokemon and special attackers such as Mareanie and Shellos. It is able to counter Normal-, Water-, Fire-, and Ground-types, notably Ponyta and Onix. Frillish can come in on such Pokemon, take minimal damage, and deal heavy damage back with its STAB attacks. Be careful when facing Pokemon with access to Knock Off, such as Timburr and Vullaby, as Frillish should try to keep its item. However, most offensive threats rely on a single move such as Knock Off to hit Frillish, allowing Frillish to keep using Recover until Cursed Body activates. Be wary of Guts Timburr, since burning it with Will-O-Wisp or Scald will give it a free Attack boost. It is important to balance spreading burns with keeping Frillish healthy so that it can continue to switch into Pokemon throughout the game.</p> <h1>Team Options</h1> <p>Ferroseed and Oddish make good teammates because they counter both Electric- and Grass-types well. Oddish makes a particularly good partner by removing Toxic Spikes when switching in, as do other Poison-types such as Mareanie. A good Knock Off absorber such as Spritzee makes a good partner for Frillish because of Frillish's susceptibility to the move. Timburr and Spritzee make good teammates because they are able to check Dark-types. Entry hazard setters such as Dewpider, Dwebble and Ferroseed benefit from Frillish's ability to spinblock effectively. Toxic Spikes users such as Mareanie enable Frillish to do more damage with Hex when opposing Pokemon are poisoned. Ponyta can check Dark-types by burning them and is able to force out Grass-types. Entry hazard removers such as Timburr and Vullaby are appreciated because Frillish struggles to avoid a lot of 2HKOs if Stealth Rock is present.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 420389, "username": "Stoward"}, {"user_id": 208173, "username": "Fiend"}, {"user_id": 55063, "username": "Corporal Levi"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "The Dutch Plumberjack"}, {"user_id": 240732, "username": "Estronic"}]}], "writtenBy": [{"user_id": 381336, "username": "EnzoLapras"}]}
  },
  "Ferroseed": {
    "overview": "<p>Ferroseed is one of the greatest and most versatile defensive Pokemon, as its great typing allows it to take care of Pokemon like Foongus and Staryu and take both physical attacks from Onix and special attacks from Spritzee, Porygon, and Abra. Ferroseed is also a great entry hazard settler with access to both Spikes and Stealth Rock, as well as utility options such as Knock Off and Thunder Wave to help cripple opposing Pokemon. However, even with its great typing, Ferroseed has problems with Fire- and Fighting-type attacks. It also is easy for Pokemon like Nasty Plot Vullaby and Dragon Dance Scraggy to set up on due to its low Attack and Speed stats, which leave it unable to do a lot of damage and outpaced by most Pokemon. Ferroseed also has no reliable way to recover HP, making it easy to wear down over time from switching into hazards and weak resisted attacks. It also has trouble with Knock Off users like Pawniard and Vullaby, as losing Eviolite makes it easier to take care of.</p> ",
    "comments": "<h1>Other Options</h1> <p>Iron Head can be used over Knock Off or Thunder Wave to hit Spritzee super effectively; however, it has no use outside of this. Protect can be used to cause crash damage from Mienfoo using High Jump Kick on Ferroseed; however, it does not do much else. Stealth Rock can be used over Thunder Wave in order for Ferroseed to run both Spikes and Stealth Rock, but the drawback to this would be that Ferroseed can no longer slow down threats such as Ponyta. A fast physical set with Bullet Seed and Explosion can be used on offensive teams to get momentum. Revenge can be used to lure in Pawniard and OHKO it; however, it does not have much use outside of this.</p> <h1>Checks and Counters</h1> <p><strong>Fire-types and Fire-type coverage: Fire-types such as Ponyta and Vulpix can easily OHKO Ferroseed with their STAB attacks. Similarly, Pokemon that can run Fire-type coverage like Galarian Ponyta and Vullaby can OHKO Ferroseed with Mystical Fire and Heat Wave, respectively.</p> <p><strong>Fighting-types: Fighting-types like Mienfoo, Scraggy, and Timburr give Ferroseed trouble, as they can switch into its attacks and 2HKO it with their STAB attacks.</p> <p><strong>Knock Off Users: Pokemon that run Knock Off like Pawniard, Timburr, Mareanie, and Vullaby can cripple Ferroseed's bulk and make it easier to take care of it.</p> ",
    "sets": [
      {
        "name": "Defensive Support",
        "description": "<h1>Moves</h1> <p>Spikes can be used in order to form a entry hazard stacking core with Pokemon such as Onix to greatly chip down Pokemon on the switch and make it easier for teammates to sweep. Stealth Rock can be used over Spikes if the team lacks a Stealth Rock user, which helps out with crippling threats to Ferroseed, namely Vullaby and Ponyta. Giga Drain gives Ferroseed passive recovery and enables it to take care of Water- and Ground-types such as Staryu and Onix. Bullet Seed is a stronger option that allows Ferroseed to take care of Focus Sash Abra and Sturdy Onix but cannot take out Mudbray. Knock Off allows Ferroseed to remove items from bulky Pokemon such as Foongus, Porygon, and Spritzee as it threatens out a foe, which can greatly help out its teammates with taking out the Pokemon later in the game. Thunder Wave is a useful move to slow down its usual checks such as Ponyta, Vullaby, and Mienfoo.</p> <h1>Set Details</h1> <p>Eviolite, with the given defensive EVs and a Defense-boosting nature, allows Ferroseed to effectively take physical and special attacks. A Bold nature is preferred to avoid reducing Giga Drain damage, but Ferroseed should use an Impish nature if using Bullet Seed. Iron Barbs makes Ferroseed able to wear down physical attackers.</p> <h1>Usage Tips</h1> <p>Use Ferroseed early-game to set down Stealth Rock or Spikes or soften up its checks by getting rid of Eviolite with Knock Off. It can also use Thunder Wave on a predicted switch to help slow down threats such as Ponyta, Mienfoo, and Vullaby. Switch Ferroseed in on Spritzee, Mareanie, and Foongus, as these Pokemon cannot do much to it. Use Knock Off or set entry hazards when Ferroseed switches into these to help its soften up Pokemon for its teammates to take care of. Try to scout Vullaby, Abra, and Galarian Ponyta before trying to use a move because they can potentially bypass Ferroseed with Fire-type coverage. Ferroseed should be preserved to check setup sweepers such as Dragon Dance Onix and Agility Porygon or threats like Foongus, Mudbray, and Staryu if the team lacks a way to deal with them.</p> <h1>Team Options</h1> <p>Spritzee and Mareanie are great partners for Ferroseed because their typing allows them to come in on Fighting-types such as Timburr and Mienfoo. Spritzee also is good for absorbing Knock Off for Ferroseed and keeping it healthy with Wish, while Mareanie can put down Toxic Spikes to cripple switch-ins and in return likes Ferroseed's ability to put up entry hazards, take care of Ground-types such as Onix if it's lacking Iron Defense, and come in on Foongus. Stealth Rock setters like Onix and Mudbray are great to pair with Ferroseed if it is running Spikes to form an entry hazard stacking duo and make it easier to pressure switch-ins and wear down Pokemon. Onix is useful to take care of Vullaby, while Mudbray is more useful in taking down Timburr and threatening Fire-types such as Ponyta and Vulpix. Trappers like Diglett and Trapinch are good to pair with Ferroseed to trap Ponyta and Pawniard and take care of them. Staryu is a great Water-type partner because of it checking Fire-types like Ponyta and Vulpix and appreciating Ferroseed's ability to switch in on Foongus's attacks. Staryu can also use Thunderbolt to take care of Wingull and dent Vullaby while also using Rapid Spin to get rid of hazards that wear Ferroseed down. Setup sweepers such as Onix, Shellder, and Nasty Plot Vullaby can sweep mid- to late-game thanks to Ferroseed's ability to soften up threats with Knock Off and cripple faster Pokemon like Mienfoo, Galarian Ponyta, Wingull, and Ponyta with Thunder Wave.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 420389, "username": "Stoward"}, {"user_id": 195129, "username": "Nineage"}, {"user_id": 150971, "username": "Coconut"}, {"user_id": 208173, "username": "Fiend"}, {"user_id": 449990, "username": "DC"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "The Dutch Plumerjack"}, {"user_id": 240732, "username": "Estronic"}]}], "writtenBy": [{"user_id": 393488, "username": "Yami"}]}
  },
  "Mienfoo": {
    "overview": "<p>Mienfoo is one of LC's defining presences and the tier's most versatile Fighting-type, capable of serving as a reliable defensive pivot or a devastating offensive threat. Regenerator lets it take hits, force Pokemon out, and generate momentum with U-turn. Its other great ability, Reckless, boosts High Jump Kick's power to extreme levels and makes it one of the best wallbreakers in the tier. It provides great utility through moves like Knock Off, U-turn, and Fake Out, which can wear down defensive cores, generate momentum, and revenge kill sweepers. Mienfoo's Fighting typing is indispensable in Little Cup, as almost every team requires a reliable switch-in to Onix and Pawniard and a way to break through Ferroseed. While Mienfoo has many great qualities, it can be exploited. Mienfoo's prevalence means that almost every team will carry a dedicated check for Fighting-types like Koffing, Foongus, or Mareanie. High Jump Kick is somewhat unreliable, leading to Mienfoo often taking major recoil damage, and Protect on unexpected foes can spell its demise. Mienfoo's propensity for taking chip damage and switching into Knock Off can lead to it being trapped by Diglett, and Mienfoo is generally not that bulky after having its Eviolite removed. Its lack of reliable priority can be exploited by fast threats like Abra and Galarian Ponyta.</p> ",
    "comments": "<h1>Other Options</h1> <p>Choice Band is an option over Choice Scarf to make Mienfoo absurdly powerful and unexpectedly OHKO opposing Vullaby and Mienfoo, although the set's relative slowness and frailty necessitate more cautious use and team support. Mienfoo can run a Swords Dance set with Berry Juice and Acrobatics on Sticky Web offense teams to serve as a powerful sweeper, but Scraggy generally outclasses it. Acrobatics is an option on non-Berry Juice sets to hit Foongus, but it will typically be useless unless Mienfoo takes Knock Off. Feint is an option to help beat Focus Sash Abra but lacks Fake Out's benefit of free damage against other foes. Swords Dance is an option on pivot sets to boost and OHKO Vullaby that attempt to switch in. Regenerator can be run on Choice Scarf sets to give Mienfoo added durability against priority moves, but the major decrease in power makes this inadvisable.</p> <h1>Checks and Counters</h1> <p><strong>Koffing: Koffing's hefty physical bulk and Poison typing allow it to reliably pivot into Mienfoo and threaten it out with a burn or its powerful Sludge Bomb. Koffing's Neutralizing Gas also can harm Mienfoo's staying power by preventing recovery from Regenerator. However, Koffing lacks reliable recovery and is vulnerable to entry hazards, meaning it can only switch into Mienfoo a few times.</p> <p><strong>Mareanie</strong>: Thanks to its resistance to Fighting and Regenerator, Mareanie is the one of the sturdiest Mienfoo checks in the tier. Mareanie must be wary of switching into U-turn, though, as Mienfoo may pivot to Diglett or a powerful special attacker. Mareanie also takes significant damage from Choice Band High Jump Kick without its Eviolite.</p> <p><strong>Foongus: Foongus resists High Jump Kick, can stay healthy with Regenerator and reliable recovery, and punish Mienfoo with Spore. Foongus struggles mightily when Mienfoo is paired with Ferroseed, as Ferroseed fears none of Foongus's options and U-turn prevents Foongus from double switching to punish Ferroseed. Foongus without its Eviolite also cannot reliably switch into Reckless Mienfoo, as it is 2HKOed by High Jump Kick after Stealth Rock.</p> <p><strong>Spritzee: Spritzee fears Mienfoo little and cannot reliably be trapped by Diglett, and it threatens back with Moonblast. Spritzee can take advantage of Mienfoo to pass Wish and heal teammates like Ferroseed. Protect prevents Mienfoo from powering through with High Jump Kick. However, Spritzee often struggles to make progress against Mienfoo thanks to Mienfoo pivoting with U-turn to bulky Pokemon like Mareanie and Ferroseed.</p> <p><strong>Fast Special Attackers</strong>: Mienfoo without Choice Scarf can be threatened by speedy threats like Abra and Galarian Ponyta. Abra often runs Protect to preserve its Focus Sash against Fake Out and can punish Mienfoo with Psychic. However, Mienfoo can survive non-Life Orb Abra's Psychic with maximum Special Defense investment and Eviolite.</p> ",
    "sets": [
      {
        "name": "Bulky Pivot",
        "description": "<h1>Moves</h1> <p>High Jump Kick is an extremely powerful STAB move, even without Attack investment, although its misses can be costly and it can be punished with Protect. Knock Off lets Mienfoo make progress against its switch-ins like Mareanie, Foongus, and Koffing. U-turn works in excellent tandem with Regenerator, allowing Mienfoo to pivot away while healing itself. Fake Out wears down faster offensive threats such as Speed-boosted Nasty Plot Vullaby and Choice Scarf users, and it can stall out turns of sun, dual screens, and Grassy Terrain. Beware that some fast threats, especially Abra, run Protect to avoid Fake Out. Taunt is a niche option that helps against Foongus, especially when you do not have your own Foongus or Ferroseed to absorb Spore, and prevents Foongus and Mareanie from recovering HP, letting Mienfoo break through them sometimes. Taunt can also prevent slower sweepers like Nasty Plot Vullaby from setting up.</p> <h1>Set Details</h1> <p>Pivot Mienfoo's versatility is defined by its ability to run multiple EV spreads to fit different roles. The given EV spread balances Mienfoo's ability to threaten much of the tier with its Speed while also providing ample physical bulk. Hitting 17 Speed Speed ties with Onix, Natu, and opposing Mienfoo and lets it always outspeed Pawniard and non-Choice Scarf Vullaby. The given EV investment also hits 14 Defense and provides Mienfoo with enough bulk to comfortably switch into Pawniard, Onix, and other Fighting-types. An alternate spread of 76 HP / 196 Def / 196 SpD with an Impish nature gives Mienfoo impressive bulk at the expense of Speed, letting it always survive Download Porygon's Psychic and almost always survive non-Life Orb Abra's Psychic from full HP. This spread also lets Mienfoo defeat Weak Armor Vullaby with Fake Out. You can forgo defensive investment almost entirely and run a spread of 236 Atk / 36 Def / 236 Spe to surprise opponents with its offensive presence, almost always OHKOing standard Vullaby after Stealth Rock. Eviolite provides Mienfoo the bulk to survive most attacks from full health. Regenerator keeps Mienfoo healthy and enables it to continually pivot into threats.</p> <h1>Usage Tips</h1> <p>Mienfoo is one of the most consistent lead options in the tier thanks to Fake Out, Knock Off, and U-turn. This set is a great sponge for chip damage thanks to its bulk and ability to heal when switching out. Mienfoo should use its bulk and resistances to come in on Pokemon like Ferroseed, Pawniard, and Onix and make progress with Knock Off and U-turn. U-turn should be used aggressively, and Mienfoo generally should be preserved often, as multiple switches can restore its HP. Mienfoo can often force Fighting-resistant foes to switch in and pivot into frail offensive threats like Diglett and Abra to exploit them. While its chip damage and priority can be valuable, Fake Out should be used strategically, as it can also allow free switches from Weak Armor Vullaby and checks to Mienfoo.</p> <h1>Team Options</h1> <p>Mienfoo pairs excellently with Diglett, as it can weaken foes with Knock Off and get Diglett free switches with U-turn; in return, Diglett can trap and KO Mareanie and Abra. Mienfoo supports Vullaby well by switching into Pawniard and Onix and forcing them out or KOing them, and the two can pivot between each other with U-turn and create offensive pressure. Vullaby can also deter Abra from using Psychic. Pawniard supports Mienfoo by switching into dangerous special attackers like Abra and Galarian Ponyta as well as Vullaby's Brave Bird, but it can easily be worn down in this role. Ferroseed is an even more reliable answer to Abra, and Mienfoo's U-turn gets it free turns against Foongus.</p> "
      },
      {
        "name": "Choice Scarf",
        "description": "<h1>Moves</h1> <p>Reckless High Jump Kick does major damage to a majority of the tier. U-turn takes advantage of High Jump Kick forcing switches and lets Mienfoo pivot. Knock Off lets Mienfoo punish Fighting-resistant foes and especially Ghost-types like Frillish. The last move slot goes to a 100% accurate STAB move; Close Combat is generally the best option thanks to its power, while Brick Break provides an emergency check to dual screens offense.</p> <h1>Set Details</h1> <p>Maximum Attack and Speed investment with a Jolly nature ensure that Choice Scarf Mienfoo hits as hard as possible while outspeeding most of the tier, including common Choice Scarf users like Porygon and Vullaby. Choice Scarf allows Mienfoo to force out or KO potent threats like Abra, Galarian Ponyta, and Staryu.</p> <h1>Usage Tips</h1> <p>Choice Scarf Mienfoo wants to use High Jump Kick as frequently as possible and will impose immense pressure every time it does; thus, generating free switches through tools like Vullaby's U-turn should be your priority. Mienfoo can strategically use Knock Off early-game to soften Fighting-resistant switch-ins, as High Jump Kick severely threatens most of them without Eviolite. This set relies on the gradual chipping down of these Fighting-resistant foes to serve as a wincon late-game.</p> <h1>Team Options</h1> <p>Timburr supports this set well, as it can function as a defensive Fighting-type and overwhelm Fighting-resistant foes, especially Foongus and Koffing, with Knock Off and Ice Punch. Knock Off support from other users like Vullaby, Pawniard, and Mareanie is also invaluable for whittling down bulky foes that might otherwise survive High Jump Kick. Ferroseed switches well into Fighting-resistant foes that force out Mienfoo and can set Spikes to facillitate a sweep. Diglett can capitalize on U-turn to trap and KO Mareanie and Focus Sash Abra.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 420389, "username": "Stoward"}, {"user_id": 449990, "username": "DC"}, {"user_id": 423793, "username": "LilyAC"}]}, {"name": "Grammar checked by", "members": [{"user_id": 449990, "username": "DC"}, {"user_id": 331519, "username": "CryoGyro"}]}], "writtenBy": [{"user_id": 32350, "username": "KSG"}]}
  },
  "Pawniard": {
    "overview": "<p>Pawniard's powerful STAB Knock Off allows it to be a defining force in the LC metagame. Having access to a strong Knock Off is valued, as it removes items for its teammates and can help break through bulky threats. Its fantastic offensive typing allows it to check a multitude of Pokemon such as Vullaby, Spritzee, Shellder, and Oddish. Sucker Punch allows Pawniard to threaten offensive teams and revenge kill faster threats. A downside to Pawniard is that it is heavily threatened and forced out by common threats such as Timburr, Galarian Farfetch'd, Onix, and Mudbray and can also find itself getting trapped by Trapinch and Diglett.</p> ",
    "comments": "<h1>Other Options</h1> <p>Thief in conjunction with Berry Juice allows Pawniard to steal the opposing Pokemon's item after it consumed its Berry Juice. This option, however, is inferior to the utility and power Knock Off provides. Thunder Wave can be used to cripple any potential switch-ins to Pawniard. Choice Scarf Pawniard can catch opponents off guard and therefore outpace and OHKO Pokemon such as Wingull, and Diglett.</p> <h1>Checks and Counters</h1> <p><strong>Timburr: Timburr is the biggest threat to Pawniard, as it is able to switch into Pawniard fairly easily and OHKO it. Timburr is also able to use Defog on Pawniard very easily despite Defiant.</p> <p><strong>Other Fighting-types</strong>: Other Fighting-types such as Galarian Farfetch'd and Croagunk all resist Pawniard's Dark-type attacks and can OHKO it in return. Croagunk also has access to STAB priority in Vacuum Wave, which can OHKO Pawniard.</p> <p><strong>Ground-types: Ground-types such as Diglett, Trapinch, Onix, Mudbray, and Drilbur are all able to OHKO Pawniard with Ground-type moves. Trapinch and Diglett specifically are able to trap and KO Pawniard with Earthquake after a free switch from Vullaby's U-turn. Mudbray can constantly switch into Pawniard's moves due to its high bulk backed by its ability in Stamina and threaten it out with Earthquake.</p> <p><strong>Status: Status problems, especially burns from Ponyta's, Koffing's, and Frillish's Will-O-Wisp, can cripple Pawniard and should be avoided at all costs. Pawniard should also be wary of switching into potential Scald burns from Mareanie, Shellos, and Wingull.</p> ",
    "sets": [
      {
        "name": "Bulky Attacker",
        "description": "<h1>Moves</h1> <p>Knock Off is Pawniard's strongest and most useful STAB move and provides it utility in item removal, which is invaluable team support. Iron Head allows Pawniard to threaten Fairy-types such as Spritzee. Sucker Punch allows Pawniard to pick off weakened threats and revenge kill faster foes such as Galarian Ponyta and Wingull. Sucker Punch can also force a mind game when Diglett traps Pawniard. Pawniard is also a great Stealth Rock user, as it matches up well with the tier's most common Defogger in Vullaby. If a Stealth Rock user is already on the team, Pawniard can opt for Swords Dance to turn itself into a threatening wallbreaker. Brick Break can also be used if the team is particularly weak to opposing Pawniard and Ferroseed.</p> <h1>Set Description</h1> <p>Maximum Speed investment alongside a Jolly nature allows Pawniard to reach a benchmark of 16 Speed, allowing it to Speed tie with Vullaby that are not holding a Choice Scarf as well as outpace Mareanie and Mudbray. 36 Defense and 156 Special Defense EVs allow Pawniard to maximize its bulk in conjunction with Eviolite to better take attacks. This EV distribution also allows Pawniard to avoid the 2HKO from non-Modest Spritzee's Moonblast. The rest of the EVs are invested in Attack to maximize Pawniard's damage output. Defiant is Pawniard's most useful ability, allowing it to pressure Defoggers such as Vullaby and making it a threat versus Sticky Web teams.</p> <h1>Usage Tips</h1> <p>Pawniard should be utilizing Knock Off often throughout the match, punishing switch-ins such as Timburr, Mudbray, Mareanie, and Ferroseed by removing their Eviolite. Pawniard also should be used early- to mid-game to set up Stealth Rock and can do so on a multitude of occasions when switching in on Pokemon such as Oddish, Vullaby, and Ferroseed. Pawniard can also set up Stealth Rock on Pokemon that it forces out, such as Spritzee. Sucker Punch should be used to revenge kill faster and weakened threats. Pawniard should be preserved as a check to Flying-types against teams with Vullaby and can even punish Vullaby for Defogging. Pawniard's HP should also be preserved if the opponent possesses late-game setup sweepers such as Shellder and Zigzagoon. When running Swords Dance, Pawniard can be opted for a late-game sweep when checks and counters such as Timburr are weakened or eliminated.</p> <h1>Team Options</h1> <p>Fighting-type checks such as Spritzee, Koffing, Oddish, and Vullaby are fantastic partners for Pawniard. Pokemon such as Corphish and Nasty Plot Vullaby are able to punish Diglett and Trapinch for revenge killing Pawniard by setting up. Trappers such as Trapinch and Diglett can successfully remove Pokemon such as Onix, Mareanie, and Ponyta. Water-types such as Corphish, Wingull, and Frillish can also threaten Ground-types. Sticky Web setters are great for Pawniard, as they allow Pawniard to outspeed and 2HKO common switch-ins, such as Drilbur, Onix and Ponyta. In addition, Sticky Web is also challenging to remove due to Pawniard's Defiant. Fighting-types such as Timburr and Galarian Farfetch'd appreciate Pawniard's ability to check Fairy-types such as Spritzee. Timburr also appreciates Pawniard switching in easily to Flying-type Pokemon such as Ruflett and Vullaby as well punishing Oddish for using Strength Sap. Setup sweepers such as Nasty Plot Vullaby appreciate Eviolite being removed from their checks via Knock Off. Dual screens and Memento users such as Diglett allow Swords Dance Pawniard to set up more easily.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 420389, "username": "Stoward"}, {"user_id": 150971, "username": "Coconut"}, {"user_id": 32350, "username": "Ksg"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Estronic"}, {"user_id": 232216, "username": "The Dutch Plumberjack"}]}], "writtenBy": [{"user_id": 437289, "username": "Splash"}]}
  },
  "Vullaby": {
    "overview": "<p>Vullaby is one of the most versatile Pokemon in LC; thanks to its rich toolset and well-rounded stats, it can provide any team with invaluable role compression, being able to function as a potent pivot, an entry hazard remover, and a wallbreaker. Its STAB coverage hits every relevant Pokemon in the tier other than Pawniard for neutral damage, making Vullaby quite difficult to switch into, especially with the added threat of item removal from Knock Off. Defog allows Vullaby to serve as one of the tier's two most reliable hazard removers, owing to its immunity to Sticky Web, Spikes, and Toxic Spikes. Vullaby also brings two valuable abilities to the table in Weak Armor and Overcoat; the former allows it to punish teams for hitting it by enabling it to outrun the entire metagame, while the latter protects it from Foongus's Spore. However, despite Vullaby's overall versatility, it is often a jack of all trades and a master of none and can find itself overwhelmed by strong, fast threats.</p> ",
    "comments": "<h1>Other Options</h1> <p>Vullaby can use a Choice Scarf to serve as a revenge killer and outspeed most of the metagame, although such a set sacrifices its ability to wallbreak with Knock Off followed by Brave Bird, and it is worn down quickly by a lack of healing. Vullaby can run a bulkier set with Overcoat and Eviolite to more reliably Defog and check Pokemon like Abra, Mienfoo, and Timburr, but it loses the advantages it gets from Weak Armor and is forced to play much more passively due to its reduced damage output and its frequent need to Roost. Vullaby can also take an alternative approach to a Nasty Plot sweep by running Overcoat together with Iron Defense and Roost, letting tank hits from Pokemon like Pawniard, Ponyta, and opposing Vullaby rather than outspeed them. However, this set requires more team support to sweep due to having difficulty breaking through Pokemon that resist Air Slash like Onix. Tailwind and Endure are niche options for Berry Juice Vullaby; the former provides team support by boosting its Speed, and the latter lets Vullaby survive a physical hit from Pokemon like boosted Scraggy and proceed to revenge kill them after a Weak Armor Speed boost.</p> <h1>Checks and Counters</h1> <p><strong>Onix: Onix takes little damage from any of Vullaby's moves other than boosted Dark Pulse and can KO it in return with Rock Blast or Head Smash; moreover, Weak Armor Onix variants can even outspeed Weak Armor-boosted Vullaby after taking a hit. Onix is an extremely sturdy Vullaby switch-in and often gains a free opportunity to set Stealth Rock or setup with Dragon Dance when forcing it out. It must be wary, however, of the threat of switching into a U-turn and being trapped by Trapinch or Diglett; Onix is also worn down by repeated switch-ins and Knock Off.</p> <p><strong>Pawniard: Pawniard is not threatened by any of Vullaby's STAB moves and can punish it for using Defog through a Defiant boost. Pawniard must beware, however, of Heat Wave in general and Nasty Plot variants in particular, as they can use it as setup fodder. Pawniard is also threatened by U-turn when Vullaby is paired with a trapper, and Knock Off can compromise Pawniard's ability to check other threats like Porygon and Abra.</p> <p><strong>Spritzee: Spritzee's Fairy-type and tremendous bulk allows it to take any of Vullaby's moves with ease and KO it in return with Moonblast; however, it must be wary of flinches from a boosted Air Slash and becoming overwhelmed by taking too many hits, especially after its Eviolite has been removed due to Knock Off, as Brave Bird can then 2HKO it. Nasty Plot variants of Spritzee are frailer and accordingly less reliable as checks but can use Vullaby as setup bait.</p> <p><strong>Fast Attackers</strong>: Vullaby's above-average bulk is often not enough to take attacks from the tier's heavy hitters, especially after Stealth Rock, and its average Speed means it risks being overwhelmed by offensive pressure. Abra, Choice Scarf Porygon, and offensive Mienfoo are particularly threatening.</p> ",
    "sets": [
      {
        "name": "Berry Juice Pivot",
        "description": "<h1>Moves</h1> <p>Brave Bird deals hefty damage to any Pokemon that doesn't resist it, including bulky defenders like Mienfoo, Timburr, and Foongus. Knock Off allows Vullaby to provide tremendous utility for its team, softening opposing teams by removing Eviolites and Berry Juices from its foes while also being a powerful STAB move. U-turn lets Vullaby take advantage of forced switches by allowing it to generate momentum while wearing down checks like Pawniard. Defog provides invaluable entry hazard removal. Heat Wave is an option that threatens Ferroseed and Pawniard and can force an opponent to make difficult decisions when switching into Vullaby.</p> <h1>Set Details</h1> <p>Vullaby's EV spread and nature can be altered to fill a highly diverse set of roles, depending its team's needs. A Jolly nature allows Vullaby to Speed tie with opposing positive-natured Vullaby and Pawniard; this Speed is invaluable for teams without Onix. The given EV spread maximizes Vullaby's damage output and, with an Adamant nature, gives it a high chance of OHKOing standard Mienfoo. Other viable investments include 116 HP / 156 Def, which allows Vullaby to survive Timburr's Ice Punch or offensive Regenrator Mienfoo's High Jump Kick after Stealth Rock damage as well as Adamant Vullaby's Brave Bird after a Weak Armor Defense drop and Berry Juice recovery. If you're running Heat Wave, a spread of 156 Atk / 76 Def / 76 SpA / 196 Spe with a Serious nature is optimal; the same spread can alternatively be run with a Jolly nature at the expense of being able to 2HKO Pawniard without relying on Stealth Rock damage. A spread with 116 HP / 156 SpD allows Vullaby to almost always survive Focus Sash Abra's Dazzling Gleam after Stealth Rock. Weak Armor and Berry Juice have tremendous synergy, allowing Vullaby to boost its Speed and proceed to outspeed the majority of the metagame while simultaneously recovering damage taken from certain physical hits like Timburr's Mach Punch or Grookey's Grassy Glide. Weak Armor can occasionally present a hindrance, though, by making it easier for these strong priority to revenge kill Vullaby. Overcoat is an option for teams that need a switch-in to Foongus's Spore at the expense of Weak Armor's broader utility. Berry Juice aids Vullaby by passively healing off Stealth Rock damage, thereby helping it remove entry hazards repeatedly.</p> <h1>Usage Tips</h1> <p>Vullaby's EV spread of choice determines the role it fills best on a team; more offensive variants function better as attackers and wallbreakers, while bulkier variants switch into attacks and remove entry hazards more reliably. The momentum generated by U-turn can be leveraged to restrict how foes switch around, especially when Vullaby is paired with a trapper; common Flying-resistant Pokemon such as Pawniard and Onix are often doomed if they switch into a U-turn and and proceed to get trapped by Trapinch and Diglett. Weak Armor can help Vullaby keep faster foes in check on teams that lack Choice Scarf users or lack Speed otherwise. Knock Off should be used to pressure bulkier teams, softening walls like Mareanie, Ferroseed, and Pawniard for other threats to later break through. Defog should be used to remove hazards, especially Sticky Web, whenever possible in order to reduce opposing offensive pressure.</p> <h1>Team Options</h1> <p>Vullaby's ability to run a variety of different EV spreads and natures to accomplish different goals make an extremely versatile Pokemon that can be molded to support different types of teams. Vullaby pairs well with trappers like Diglett and Trapinch that can remove Onix and Pawniard, two Flying-resistant Pokemon that Vullaby can U-turn out of. Cleaners like offensive Porygon and Galarian Ponyta appreciate Vullaby's tendency to wear down Pawniard. Ponyta appreciates the removal of entry hazards that would slow it down or limit its ability to switch in. Timburr works well with Vullaby, as it can switch into Pawniard and Onix. Defensive Staryu can switch into Onix and provide hazard removal for non-Defog variants.</p> "
      },
      {
        "name": "Nasty Plot",
        "description": "<h1>Moves</h1> <p>Air Slash deals considerable damage to the majority of the metagame after a Nasty Plot boost and can occasionally break through Vullaby's checks with its 30% flinch chance. Heat Wave is Vullaby's best coverage move, KOing Ferroseed and heavily damaging Pawniard. Dark Pulse lets Vullaby threaten Onix and Frillish, which it otherwise struggles against, as well as Frillish. Roost is an option over Dark Pulse, especially paired with Eviolite, to prevent weaker Pokemon like Mareanie from averting a sweep simply by wearing Vullaby down. Endure is an option, especially for Berry Juice sets, which allows Vullaby to better handle opposing Vullaby, survive hits to activate Berry Juice or Weak Armor, and survive Fake Out from 1 HP.</p> <h1>Set Details</h1> <p>Eviolite provides Vullaby with opportunities to set up on harder hits such as Vullaby's Brave Bird after a Knock Off and lets it better take hits from Knock Off in general. Alternatively, Berry Juice gives Vullaby more staying power against would-be priority revenge killers like Timburr and Grookey by allowing it to heal while taking hits and setting up. A Modest nature and maximum Special Attack investment are necessary due to Vullaby's middling power, maximum Speed investment lets Vullaby outspeed nearly the entire metagame after boosting with Weak Armor, and the remainder of EVs are placed in Defense to help Vullaby better take physical hits. A Timid nature serves the niche purpose of helping Vullaby better take on opposing Nasty Plot Vullaby.</p> <h1>Usage Tips</h1> <p>This set sacrifices Vullaby's role compression for late-game sweeping potential. Few Pokemon in the tier can OHKO Vullaby with a physical move, meaning that it is invaluable to keep its health high and force your opponent to hit it with physical moves that will trigger Weak Armor, especially with the likes of Pawniard. Vullaby is typically only afforded one chance to sweep, and unless it carries Knock Off for general team support, it should never be deployed early so long as its checks are healthy and especially if it is the only wincon on its team.</p> <h1>Team Options</h1> <p>Vullaby appreciates Knock Off support from Pokemon like Pawniard and Timburr to soften opposing teams, since it cannot OHKO many bulky Pokemon, such as Eviolite Onix and Mareanie, even when at +2. Trapinch and Diglett can trap and remove Onix, which can switch into unboosted Vullaby and OHKO it with Head Smash. Dewpider can provide Sticky Web support, which prevents Onix and Abra from forcing Vullaby out before a Weak Armor boost. Ponyta and Koffing can spread status to physical attackers with Will-O-Wisp, turning them into ideal setup fodder for Vullaby. Staryu can check Onix, provides hazard removal to keep Vullaby healthy, and is indispensable on Nasty Plot Vullaby teams.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 208173, "username": "Fiend"}, {"user_id": 420389, "username": "Stoward"}, {"user_id": 423793, "username": "LilyAC"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Estronic"}, {"user_id": 232216, "username": "The Dutch Plumberjack"}]}], "writtenBy": [{"user_id": 32350, "username": "KSG"}]}
  },
  "Larvesta": {"sets": [{"name": "Pivot"}]},
  "Bunnelby": {"sets": [{"name": "Wallbreaker"}]},
  "Spritzee": {
    "overview": "<p>Spritzee has decent boosting moves in Nasty Plot and Calm Mind, which lets it explore offensive options. It also has solid bulk and typing, which makes it a good defensive option on many teams, as it's able to check many common Pokemon such as Vullaby, Mienfoo, and Timburr and absorb Knock Off. In fact, Spritzee is one of the best checks to Mienfoo because Diglett cannot reliably trap and KO it. Spritzee has fantastic utility moves such as Wish, which not only gives it longevity but also allows it to heal its teammates. Spritzee's shortcomings are its low Speed, passivity, and weakness to common Poison-types such as Mareanie and Foongus and Steel-types such as Pawniard and Ferroseed.</p> ",
    "comments": "<h1>Other Options</h1> <p>Spritzee can use Encore to stop setup attackers such as Nasty Plot Vullaby. On the defensive set, Calm Mind synergizes with Wish, allows Spritzee to become even bulkier, and lets it function as a wincon late-game. That being said, Spritzee wouldn't be able to weaken opposing walls with Covet or hit Poison-types with Psychic. Finally, Spritzee can also run a speedy Nasty Plot set maximizing Speed and running Draining Kiss for longevity; this set would work especially well with a Sticky Web user.</p> <h1>Checks and Counters</h1> <p><strong>Ferroseed: Ferroseed hard walls Spritzee and can use those free turns to status foes with Thunder Wave, set entry hazards such as Stealth Rock and Spikes, and use Knock Off to remove foes' items.</p> <p><strong>Pawniard</strong>: Pawniard threatens Spritzee with Iron Head. Spritzee's Moonblast may also trigger Pawniard's Defiant if its Special Attack drop activates. Spritzee will typically switch out against Pawniard, which lets it freely use Knock Off.</p> <p><strong>Poison-types</strong>: Spritzee is threatened by Poison-types such as Foongus, Mareanie, and Koffing. They take little damage from Moonblast but should be wary of switching into Psychic.</p> <p><strong>Fire-types: Fire-types such as Ponyta and Vulpix resist Spritzee's Moonblast and are able to overpower it.</p> ",
    "sets": [
      {
        "name": "Nasty Plot",
        "description": "<h1>Moves</h1> <p>Trick Room and Nasty Plot work together to allow Spritzee to become a powerful sweeper, as Trick Room reverses Spritzee's poor Speed and lets it be a countermeasure to Sticky Web. Moonblast does a good amount of damage to neutral foes, even when unboosted. Psychic is Spritzee's coverage move for Poison-types such as Mareanie, Foongus, and Koffing that check it, and it also neutrally hits Ponyta.</p> <h1>Set Details</h1> <p>The HP, Defense, and Special Defense EV investment is to ensure that Spritzee is bulky enough to take an attack or two so it can use Nasty Plot. Offensively, the maximum Special Attack investment and Modest nature make Spritzee hit as hard as possible. Berry Juice is used to heal Spritzee up if it gets hit a couple times, though Eviolite can be used so it can take more hits. Aroma Veil is the ability of choice to ensure Taunt and Encore users don't prevent Spritzee from setting up.</p> <h1>Usage Tips</h1> <p>Spritzee's goal is to set up Nasty Plot and have Trick Room active so it can sweep, so switch Spritzee in on a Pokemon that can't do much damage to it like Timburr or Mienfoo. Avoid Knock Off, as Spritzee's item is very important to its ability to set up. Also, be careful of setting up Trick Room if the foe is slower than Spritzee. In that case, simply setting up with Nasty Plot and attacking is better. If you have two or more free turns, make sure to set up Nasty Plot first, as you want Trick Room to last as long as possible. Late-game, if the opposing Pokemon are weakened, Spritzee can sweep just by setting up Trick Room without Nasty Plot. Finally, you can try bluffing a defensive set by constantly switching in and out to soak up resisted attacks from the likes of Timburr and Mienfoo, and, when late-game comes, you can start setting up and surprise your opponent.</p> <h1>Team Options</h1> <p>Spritzee appreciates entry hazard setters such as Ferroseed and Pawniard so it can sweep more effectively. Furthermore, it appreciates Knock Off support from the likes of Mienfoo and Vullaby, which is necessary so that it can reliably KO Pokemon such as Foongus and Mareanie. Unfortunately, Spritzee cannot do much damage to Ferroseed, so teammates like Ponyta, Mienfoo, and Timburr are appreciated. Diglett is also a great option, as it can wear Ferroseed down or use Final Gambit against it. And, although Mudbray isn't the best Spritzee check, Spritzee still appreciates teammates such as Staryu and Wingull to deal with it.</p> "
      },
      {
        "name": "Defensive",
        "description": "<h1>Moves</h1> <p>Moonblast threatens Dark- and Fighting-types such as Vullaby, Mienfoo, and Timburr. Wish, one of the moves that gives defensive Spritzee its niche, provides Spritzee and its teammates recovery. Protect complements Wish, ensuring that Spritzee gets healed. Furthermore, Protect lets Spritzee scout for moves on Choice-locked Pokemon such as Choice Scarf Mienfoo. Covet is a good utility move in the Knock Off-heavy LC tier. It allows Spritzee to steal the foe's item, typically Berry Juice or Eviolite, and can be useful to maintain its bulk after taking Knock Off while weakening a foe. Spritzee can use it against the likes of Ferroseed, Mareanie, and Foongus. Psychic can be used instead of Covet to deal good damage to Poison-types such as Foonguss, Mareanie, and Koffing.</p> <h1>Set Details</h1> <p>The Eviolite, Bold nature, HP EVs, and Defense EVs allow Spritzee to switch into as many physical attackers, such as Onix, Mienfoo, Timburr, and Vullaby, as it can. The HP EVs also maximize Wish recovery for both itself and its teammates. The leftover EVs are used to increase Spritzee's other stats. Aroma Veil is the preferred ability so Spritzee can ignore Encore and Taunt, letting it employ its many utility moves.</p> <h1>Usage Tips</h1> <p>Spritzee is very bulky, so it can switch into common physical attackers in the tier and isn't afraid to take a Knock Off, especially as it can regain an item by using Covet. Since Spritzee is a cleric, make sure it survives for as long as possible to ensure your entire team, especially walls like Ferroseed, stays healthy through Wish passing. To not lose momentum and get good matchups against Poison- and Steel-types that check Spritzee, switch in Spritzee strategically and then double switch to a teammate. Be careful of letting foes take advantage of Spritzee's lackluster offensive capabilities to set up or set entry hazards on it.</p> <h1>Team Options</h1> <p>Ferroseed appreciates Spritzee because it checks common threats such as Timburr, Vullaby, and Mienfoo, and Ferroseed checks Mareanie and Foongus for it. Ferroseed also appreciates Wish as a way to counteract opposing teams chipping it down. On the flip side, Spritzee appreciates teammates such as Timburr, Mienfoo, and Ponyta, which can KO its checks such as Pawniard and Ferroseed. Galarian Ponyta, Abra, and Diglett can KO Spritzee's counters. Also, since Spritzee is constantly switching in and out to ensure the best matchups, entry hazards can wear it down; therefore, Defog users such as Vullaby and Timburr and Rapid Spin users such as Staryu are appreciated. Finally, Spritzee appreciates entry hazard setters such as Ferroseed, Onix, and Pawniard, as it can often force Pokemon such as Timburr to switch out.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 32350, "username": "KSG"}, {"user_id": 449990, "username": "Dreamcatcher"}, {"user_id": 195129, "username": "Nineage"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}, {"user_id": 240732, "username": "Estronic"}]}], "writtenBy": [{"user_id": 205691, "username": "ForgottenOnes"}]}
  },
  "Skrelp": {"sets": [{"name": "Special Attacker"}]},
  "Tyrunt": {"sets": [{"name": "Dragon Dance"}]},
  "Amaura": {"sets": [{"name": "Choice Scarf"}, {"name": "Screens Setter"}]},
  "Mareanie": {
    "sets": [
      {
        "name": "Wall",
        "description": "<p>Mareanie has great bulk, recovery, and a good typing in Poison / Water that allow it to come into Fighting- and Fairy-types such as Timburr and Spritzee repeatedly. Sludge Bomb makes it able to take care of Fairy-types such as Spritzee and Cottonee. Toxic Spikes is great to help cripple Pokemon that do not have any form of recovery for the rest of the game. Using Iron Defense allows Mareanie to become a great physical wall to take on Swords Dance users such as Pawniard and Galarian Farfetch'd and trappers such as Trapinch and Diglett. The EV spread allows Mareanie to take on Spritzee's Psychic and an unboosted Munchlax's Earthquake. An alternative EV spread of 116 HP / 180 Def / 12 SpA / 180 SpD enables Mareanie to be able to take physical attacks from Galarian Farfetch'd and Corphish a bit better at the cost of not recovering as much from Regenerator.</p> <p>Pokemon that are weak to Fighting- and Fairy-type attacks such as Pawniard, Munchlax, and Timburr appreciate the fact that Mareanie can repeatedly come in on these attacks. All of its teammates love the pressure that Toxic Spikes put on grounded Pokemon, as Pokemon without recovery will be crippled for the rest of the game. However, Mareanie struggles with Ground-types such as Mudbray and Trapinch, so partners like Vullaby and Wingull make great partners, as they are immune to Earthquake. Mareanie also likes to be paired with trappers such as Trapinch and Diglett in order to take care of Poison-types to make Toxic Spikes more threatening. Mareanie also struggles with Galarian Ponyta, so Pawniard and Munchlax are good to pair with Mareanie to take care of it.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 240933, "username": "tazz"}, {"user_id": 213064, "username": "Merritt"}]}, {"name": "Grammar checked by", "members": [{"user_id": 297659, "username": "deetah"}]}], "writtenBy": [{"user_id": 393488, "username": "Yami"}]}
  },
  "Mudbray": {
    "overview": "<p>Mudbray is the one of the only viable Stealth Rock setters that isn't weak to Fighting, and its combination of bulk and power makes it an effective one. Its ability, Stamina, is great against U-turn users such as Vullaby and Fake Out users such as Mienfoo. Because of Mudbray's bulk, it walls many of the tier's premier attackers such as Timburr, physical Vullaby, and Pawniard while soft checking many other threats. It also has one of the best Attack stats in the tier and good coverage moves such as Heavy Slam, Close Combat, and Rock Slide. However, even with its good bulk and Attack, it lacks Speed and resistances. Mudbray's lacking defensive role compression means there are better Stealth Rock setters, such as Onix and Pawniard, and it is often taken advantage of by common Water- and Grass-types such as Staryu and Foongus.</p> ",
    "comments": "<h1>Other Options</h1> <p>Offensively, Mudbray can use High Horsepower to do more damage during Grassy Terrain, but it loses out on power when not in it. Defensively, Mudbray is a great tank and can use Toxic to wear down common checks or switch-ins. It can also use Substitute to soak up incoming damage, especially against physical attackers when it has racked up enough Stamina boosts. Substitute can also soak up status from moves such as Will-O-Wisp from the likes of Koffing. Finally, Roar allows Mudbray to check setup attackers such as Dragon Dance Onix.</p> <h1>Checks and Counters</h1> <p><strong>Grass-types: Grass-types such as Foongus and Ferroseed are able to 2HKO Mudbray with Giga Drain, while Mudbray is only able to 3HKO them after Giga Drain recovery. Foongus can also use Spore and put Mudbray to sleep; however, both Foongus and Ferroseed need to be wary of switching in on Earthquake. Grookey is an offensive Pokemon that Mudbray needs to be careful of, especially in Grassy Terrain if Mudbray lacks High Horsepower.</p> <p><strong>Water-types: Water-types such as Frillish, Shellos, Wingull, and Staryu are all able to deal massive damage to Mudbray with their super effective attacks, but most of them aren't able to switch in against Earthquake, except for Wingull. That being said, Mudbray is able to OHKO Wingull with Rock Slide, but is only able to 2HKO the others at best.</p> <p><strong>Koffing: Koffing gets 3HKOed by Mudbray but can reduce it to a passive wall with Will-O-Wisp.</p> <p><strong>Vullaby</strong>: Vullaby is immune to Earthquake, but it has to be wary of Mudbray's coverage moves.</p> ",
    "sets": [
      {
        "name": "Stealth Rock",
        "description": "<h1>Moves</h1> <p>Earthquake deals good damage, especially to Pokemon such as Pawniard and Mareanie. Heavy Slam hits at 120 BP against most Pokemon, provides good coverage alongside Earthquake, and hits Spritzee very hard. Furthermore, Heavy Slam is also a good midground to hit Vullaby hard. On the other hand, Rock Slide can be used over Heavy Slam to hit Vullaby harder and OHKO Wingull, but this would require more prediction. Close Combat is for Ferroseed and Porygon and can 2HKO both. Finally, Counter is a surprise option against Timburr, Mienfoo, and Vullaby that try to deal chip damage and works well with Berry Juice, as Mudbray will be taking hits.</p> <h1>Set Details</h1> <p>An Adamant nature and 196 Attack EVs let Mudbray hit as hard as possible. 116 HP EVs and 36 Defense EVs with Eviolite give Mudbray the bulk it needs to survive as long as possible and rack up as many Stamina Defense boosts as possible, while the Speed investment is so it can outspeed uninvested Mareanie and Timburr. Stamina is the ability of choice because it turns Mudbray into an ever-bulkier physically defensive wall. Finally, Berry Juice can be used instead of Eviolite as a way to recover HP, but the extra bulk that comes with Eviolite is almost impossible to give up.</p> <h1>Usage Tips</h1> <p>Mudbray can be used to offensively pressure teams off of switches thanks to its power and coverage. You can also switch Mudbray in against all kinds of resisted attacks, including from Onix, and U-turn to get a Defense boost from Stamina. This means that Mudbray is a great soft check to many common physical Pokemon such as Timburr, Vullaby, and Scraggy. Against these Pokemon and on free turns, Mudbray should use Stealth Rock to rack up as much damage as possible. Also, play around Mudbray's offensive checks such as Corphish and Staryu disliking switching into an attack. To ensure Mudbray's survivability, avoid getting hit by special attackers such as Porygon, which can easily take Mudbray's attacks.</p> <h1>Team Options</h1> <p>This Mudbray set works really well on bulky offense teams that need a broad check to threats and a Stealth Rock setter. However, it has trouble against Grass- and Water-types, so Pokemon that check foes such as Ferroseed are appreciated. Teammates such as Vullaby that appreciate an Onix check appreciate Mudbray. Also, U-turn users such as Mienfoo and Vullaby can pivot into Mudbray to apply pressure.</p> "
      },
      {
        "name": "Choice Scarf",
        "description": "<h1>Moves</h1> <p>Earthquake hits hard, especially against popular Pokemon such as Pawniard and Mareanie. Close Combat can 2HKO checks such as Ferroseed, which is able to tank Mudbray's other attacks. It can also hit Porygon hard and hit Vullaby decently as well. Heavy Slam hits harder than Rock Slide against neutral targets and does a good amount of damage to Flying-types that switch in. However, if you're confident in your predictions, Rock Slide hits Flying-types like Vullaby hard and OHKOes Wingull. High Horsepower can be used as a STAB attack for when Grassy Terrain is active.</p> <h1>Set Details</h1> <p>The Choice Scarf and Speed EVs allow Mudbray to outspeed the entire unboosted metagame. An Adamant nature and 196 Attack EVs guarantee 2HKOs on Trapinch and Vullaby and allow Mudbray to deal as much damage as possible. Stamina lets Mudbray take priority moves such as Mach Punch from Timburr in a pinch.</p> <h1>Usage Tips</h1> <p>Mudbray should be used in high-leverage situations where Heavy Slam and Close Combat can be used to pressure Vullaby or other Pokemon immune to Earthquake switching in. Then, Mudbray can sweep a weakened team with Earthquake late-game. This particular set is less bulky than the others, so Mudbray needs to be wary of what it switches into, but it is unusually bulky for a Choice Scarf user, so it can risk taking some weak physical hits such as U-turn from Vullaby. Mudbray isn't typically a Choice Scarf user, so this set can surprise many players by, for example, outspeeding and KOing a Staryu at 60%.</p> <h1>Team Options</h1> <p>Mudbray has trouble dealing with a number of Pokemon, such as Koffing and Foongus, so it appreciates teammates such as Ponyta that counter these Pokemon. Mudbray also appreciate Pokemon that can set entry hazards, such as Onix and Pawniard, to do chip damage and break Focus Sash and Sturdy so Mudbray can sweep easily. Entry hazards also pressure Flying-types that are immune to Earthquake such as Vullaby. On the same page, Mudbray appreciates Knock Off users such as Mienfoo and Pawniard, as they soften up foes and remove their Eviolites; Mienfoo could also play the role of a general pivot, while Pawniard can be a great Stealth Rock user. Finally, since Mudbray will be switching in and out so much, it'll appreciate teammates that can soak up damage, specifically from Grass- and Water-types such as Ferroseed and Pokemon such as Koffing, Porygon, Pawniard, Ponyta, Vullaby, and Spritzee.</p> "
      },
      {
        "name": "RestTalk",
        "description": "<h1>Moves</h1> <p>Rest works very well with Stamina and Sleep Talk, as Mudbray can capitalize on all the Defense boosts it gets by recovering health and avoid staying idle during sleep turns. On the offensive side, Earthquake is Mudbray's consistent attack that deals especially good damage to Pokemon such as Pawniard and Mareanie. Heavy Slam is a great coverage move, as it has 120BP against most relevant targets and specifically hits Spritzee hard. Finally, Rock Slide can be used to hit Vullaby hard and OHKO Wingull.</p> <h1>Set Details</h1> <p>Stamina turns Mudbray into an ever-bulkier physically defensive wall. A Careful nature, Eviolite, 236 Special Defense EVs, and 116 HP EVs prevent neutral special attackers like Abra from 2HKOing Mudbray. On the offensive side, the 116 Attack EVs ensure a 2HKO on Mareanie and even possibly an OHKO.</p> <h1>Usage Tips</h1> <p>Switch Mudbray in against resisted physical attacks so it can boost its Defense with Stamina, but be careful as to not receive too much chip damage to force it to use Rest, as Sleep Talk is inconsistent. If the opponent is only left with physical attackers, Mudbray may be able to wall all of them and win you the game. This possibility may force your opponent to play more carefully with their special attackers—use this to your advantage. That being said, try to ensure Mudbray doesn't take special hits, as they do a good amount of damage.</p> <h1>Team Options</h1> <p>Mudbray fits well on bulky offensive teams, as it's able to deal good damage due to its high base Attack stat while also being a great wall. Other Pokemon that fit this archetype include Spritzee, Pawniard, and Timburr. However, Mudbray is very weak to Water- and Grass-types such as Staryu and Foongus, which are able to 2HKO it, so Pokemon such as Ferroseed and Ponyta that can deal with them are appreciated. Galarian Ponyta and Abra are also great teammates, as they appreciate Mudbray checking threats such as physical Vullaby and Pawniard, and they can deal a lot of damage to Mudbray's checks such as Foongus.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 195129, "username": "Nineage"}, {"user_id": 208173, "username": "Fiend"}, {"user_id": 32350, "username": "KSG"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}, {"user_id": 240732, "username": "Estronic"}]}], "writtenBy": [{"user_id": 205691, "username": "ForgottenOnes"}]}
  },
  "Dewpider": {
    "overview": "<p>Dewpider stands out as LC's premier Sticky Web setter due to its ability Water Bubble and decent bulk. These traits, in tandem with its typing, allow Dewpider to pressure prominent threats such as Ponyta, Mienfoo, and Timburr, limiting the latter's ability to successfully utilize Defog. However, Dewpider's typing and lackluster Speed stat give it a weakness to Stealth Rock and leave it vulnerable to common threats such as Onix, Vullaby, and Wingull. Furthermore, Dewpider suffers from a mediocre Special Attack stat, resulting in low damage output from attacks not boosted by Water Bubble.</p> ",
    "comments": "<h1>Other Options</h1> <p>Substitute can be used in tandem with Berry Juice to set up on Timburr and Ponyta and provide more opportunities to attack. Magic Coat allows Dewpider to bounce back entry hazards and status moves from Ferroseed and Toxic Spikes Mareanie and retain momentum. Mirror Coat lets Dewpider threaten unsuspecting Mareanie and Foongus that carelessly fire off Sludge Bomb.</p> <h1>Checks and Counters</h1> <p><strong>Water-resistant Pokemon: Mareanie, Foongus, and Ferroseed resist Dewpider's STAB moves. The former two can punish Dewpider with a strong Sludge Bomb, while the latter can cripple it with Thunder Wave or Knock Off. Staryu critically damages Dewpider with Thunderbolt and can utilize Rapid Spin to remove Sticky Web.</p> <p><strong>Grookey: Grookey can OHKO Dewpider with Wood Hammer and revenge kill a weakened one with Grassy Glide.</p> <p><strong>Flying-types</strong>: Flying-types such as Vullaby and Wingull outspeed Dewpider and can KO it with Brave Bird and Hurricane, respectively. Vullaby's superb bulk, complemented by its immunity to Sticky Web, allows it to serve as the best Sticky Web remover.</p> <p><strong>Rock-types: Onix, Archen, and Tyrunt outspeed Dewpider and threaten it with a powerful Head Smash or Rock Blast. Sturdy + Berry Juice Onix can survive a Surf and recover back to full health, potentially letting it attack or set Stealth Rock, while Archen is immune to Sticky Web and can KO Dewpider through its Focus Sash with Dual Wingbeat or Rock Blast.</p> <p><strong>Croagunk: Croagunk is immune to Surf thanks to Dry Skin and does not take much damage from Dewpider's other moves. It can utilize Nasty Plot to set up on Dewpider and become a formidable offensive threat.</p> ",
    "sets": [
      {
        "name": "Sticky Web",
        "description": "<h1>Moves</h1> <p>Sticky Web provides crucial speed control for Dewpider's teammates. Boosted by Water Bubble, Surf is an immensely powerful move that threatens common foes such as Ponyta and Mienfoo. Icy Wind allows Dewpider to slow down faster threats such as Vullaby and Wingull that switch into it and KO them afterwards with Surf, while Giga Drain serves as coverage against opposing Water-types like Staryu.</p> <h1>Set Details</h1> <p>Water Bubble doubles the power of Dewpider's Surf, halves the damage of Fire-type moves, and gives it an immunity to burns, letting it check non-Wild Charge variants of Ponyta. The EV spread maximizes Special Attack and Speed, allowing Dewpider to Speed tie with fast Timburr and outspeed Onix and Vullaby after a Speed drop from Sticky Web or Icy Wind, respectively. Focus Sash is the preferred item, allowing Dewpider to always set up Sticky Web against non-multi-hit moves at full health, although Berry Juice can be utilized to provide recovery.</p> <h1>Usage Tips</h1> <p>Dewpider is capable of functioning as a lead, setting Sticky Web early and using Icy Wind to provide speed control that can be taken advantage of by its teammates. Furthermore, it is able to punish opposing Defoggers such as Timburr and Vullaby when they switch in by severely damaging them with a powerful Water Bubble-boosted Surf or, in the case of Vullaby, hitting it with Icy Wind. Dewpider can also switch in on Pokemon such as Mienfoo, Timburr, and Ponyta and force them out to set Sticky Web. However, it should not lead or stay in to set Sticky Web against faster threats such as Vullaby and Onix that can KO it easily.</p> <h1>Team Options</h1> <p>Wallbreakers and sweepers such as Grookey, Dragon Dance Scraggy, Nasty Plot Vullaby, and Woobat appreciate the valuable speed control provided by Sticky Web to outspeed foes. Pawniard can take advantage of Dewpider setting Sticky Web to gain a Defiant boost; checks to it such as Timburr, Mienfoo, and Mudbray are valuable teammates. Since Flying-types like Vullaby and Wingull ignore Sticky Web and can OHKO Dewpider, checks to them like Onix, Magnemite, and Chinchou are helpful, although Chinchou is mediocre outside of this role. Finally, trapping support from Diglett and Trapinch can be helpful, removing Pokemon like Onix and Mareanie that threaten Dewpider.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 32350, "username": "KSG"}, {"user_id": 208173, "username": "Fiend"}, {"user_id": 255030, "username": "San Tomas"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Estronic"}, {"user_id": 336073, "username": "Rabia"}]}], "writtenBy": [{"user_id": 449990, "username": "DC"}]}
  },
  "Grookey": {
    "overview": "<p>Grookey cements itself as a powerful offensive presence in LC, capable of tearing through opposing teams with Grassy Terrain-boosted Wood Hammer and Grassy Glide and pressuring common foes like Staryu, Diglett, and Onix. Furthermore, Grookey's access to Swords Dance, along with coverage moves like Drain Punch and Acrobatics, makes it difficult to properly check, as even checks like Foongus and Pawniard can fall to its sheer power. Grookey can also function as a blanket check to many setup sweepers, as they fear being revenge killed by Grassy Glide. Grassy Terrain also provides great utility for Grookey's teammates, enabling setup sweepers and making Grookey a Pokemon that can fit on many teams. However, Grookey is unable to fit all of its coverage moves, meaning that it can be checked by common walls such as Foongus and Koffing when properly scouted.</p> ",
    "comments": "<h1>Other Options</h1> <p>Grookey can run Berry Juice or Eviolite over Life Orb, trading damage for recovery or bulk to help it function as an offensive pivot. Acrobatics, in combination with consumable items like Berry Juice and Grassy Seed or with no item at all, can be utilized to lure in and heavily damage Foongus. Mega Kick is an option to hit all both Koffing and Foongus in one moveslot, but its inaccuracy makes it unreliable. Taunt prevents foes such as Foongus and Ferroseed from crippling Grookey's teammates with status. On some teams, Grookey can drop Wood Hammer in favor of utility options such as Knock Off and U-turn.</p> <h1>Checks and Counters</h1> <p><strong>Foongus: Foongus resists Grookey's STAB moves and Drain Punch and can repeatedly switch into Grookey thanks to Regenerator. It can also force out Grookey with Sludge Bomb and use that opportunity to potentially cripple one of Grookey's teammates with Spore. However, Foongus should be wary of a potential Acrobatics.</p> <p><strong>Koffing</strong>: Thanks to its typing, Koffing takes minimal damage from Grookey's STAB moves and Drain Punch. It can KO Grookey with a strong Sludge Bomb or burn it with Will-O-Wisp. However, Koffing lacks recovery and can be worn down after repeatedly switching in.</p> <p><strong>Steel-types</strong>: Steel-types such as Pawniard, Magnemite, and Ferroseed resist both Wood Hammer and Grassy Glide. Pawniard and Magnemite can retaliate with a strong attack, while Ferroseed can cripple Grookey with Thunder Wave and limit its effectiveness. However, all three Steel-types should be wary of Drain Punch.</p> <p><strong>Trapinch: Trapinch's First Impression outprioritzes Grassy Glide and OHKOes Grookey. However, Protect renders Trapinch useless.</p> ",
    "sets": [
      {
        "name": "Offensive",
        "description": "<h1>Moves</h1> <p>Grassy Glide turns into a priority move under Grassy Terrain and lets Grookey revenge kill weakened foes and faster threats such as Wingull, Abra, and Staryu. Wood Hammer is Grookey's strongest move and allows it to break through bulky foes such as Mienfoo and Pawniard. Drain Punch provides Grookey with coverage against Steel-types like Ferroseed, Pawniard, and Magnemite. Knock Off is an option to weaken checks such as Koffing, Foongus, and Ferroseed. Swords Dance further improves Grookey's offensive capabilities, allowing Wood Hammer to OHKO standard Berry Juice Vullaby after Stealth Rock damage. Protect is an option to block priority like Fake Out from Mienfoo and First Impression from Trapinch, invalidating the latter as a check. U-turn can be used to pivot away from checks such as Foongus and Koffing. Fake Out is a notable mention that improves Grookey's revenge killing capabilities and lets it weaken and beat problematic foes such as Vulpix.</p> <h1>Set Details</h1> <p>Grassy Surge sets up Grassy Terrain, which empowers Wood Hammer and Grassy Glide, turns Grassy Glide into a priority move, and provides residual healing for Grookey and its teammates. Maximum Attack and Speed investment with a Jolly nature allows Grookey to reach 17 Speed, outspeeding Pawniard while Speed tying with fast Mienfoo. If running Fake Out, Grookey should opt for an Adamant nature. Life Orb provides an additional damage boost, allowing Grookey to potentially KO Berry Juice Vullaby with Wood Hammer into Grassy Glide.</p> <h1>Usage Tips</h1> <p>Grookey is best utilized as a revenge killer and sweeper, taking advantage of a teammate safely pivoting into it or entering on a double switch to pressure foes with a strong Wood Hammer or Grassy Glide. It is capable of forcing foes like Staryu, Onix, and Wingull out to potentially set up with Swords Dance and sweep past the opposing team. Often, it is pivotal to preserve Grookey for as long as possible, since Grassy Glide is able to revenge kill boosted setup sweepers like Scraggy and Tyrunt and clean late-game. Grassy Terrain from Grookey can also be utilized as a support tool, aiding teammates like Scraggy and Tyrunt in setting up. Be wary of Trapinch, as Grookey without Protect can be trapped and OHKOed by First Impression.</p> <h1>Team Options</h1> <p>Sticky Web support from Dewpider enables Grookey to outspeed faster foes like Galarian Ponyta and Choice Scarf Magnemite to threaten them with a powerful attack. Knock Off users like Mienfoo, Scraggy, and Pawniard can weaken problematic foes like Koffing and Foongus, as well as Ferroseed and opposing Mienfoo and Pawniard. Psychic-types such as Abra and Galarian Ponyta help threaten checks like Koffing and Foongus. Partners like Dragon Dance Onix and Tyrunt, which can take advantage of Vullaby, are also good teammates, benefitting from Grookey threatening Mudbray and opposing Onix to successfully set up. On a set with U-turn, Koffing is good to pressure common foes that switch into U-turn like Foongus and Ferroseed.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 410251, "username": "zizalith"}, {"user_id": 255030, "username": "San Tomas"}, {"user_id": 208173, "username": "Fiend"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 449990, "username": "DC"}]}
  },
  "Scorbunny": {
    "sets": [
      {
        "name": "All-out Attacker",
        "description": "<p>This set seeks to take advantage of Scorbunny's ability to single-handedly take down one of LC's most prominent defensive cores in Ferroseed + Spritzee while also maintaining the ability to pivot out of common switch-ins, such as Mareanie, and give Scorbunny's teammates more opportunities for advantageous matchups. Bring Scorbunny in on Grass- and Steel-types and use the pressure of its super effective STAB moves due to Libero to use U-Turn to pivot out of the opponent's switch-in to control momentum and keep exerting pressure on the opponent. High Jump Kick gives Scorbunny the ability to hit incoming Rock-types, though it does not possess the raw power to OHKO them in most cases. As a result, it's generally better to hold off on using High Jump Kick until the foe takes enough chip damage via U-turn and hazard damage. Sucker Punch is also an option if your team already has sufficient Rock-type answers elsewhere to provide Scorbunny with a way of getting off some damage against faster Pokemon such as Diglett and Galarian Ponyta. Berry Juice is the preferred item for Scorbunny, as it provides greater longevity by allowing Scorbunny to combat being worn down by hazards as it pivots in and out of the fight.</p> <p>Pokemon who appreciate Scorbunny's ability to deal with Ferroseed and Spritzee, such as Shellder or Onix synergize quite well with Scorbunny. Additionally, Pokemon that can capitalize off of the free switch in opportunities that Scorbunny provides, such as Corphish or Mudbray, are quite appealing teammates. Trappers like Diglett and Trapinch are often able to easily remove common answers to Scorbunny, such as Mareanie. Other pivots like Vullaby and Chinchou are also great options to form a nice VoltTurn core. Chinchou, in particular, can pile the pressure on Frillish and other Water-type Scorbunny switch-ins that aren't opposing Chinchou. Ferroseed and other hazard setters are great teammates, as the chip damage provided via their hazards can be crucial in wearing down and ultimately busting through opposing teams. Lastly, hazard removal from the likes of Vullaby or Staryu, for example, will allow Scorbunny to not be worn down as easily and remain a threat, thus being able to apply pressure throughout a match.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 213064, "username": "Merritt"}, {"user_id": 410251, "username": "zizalith"}]}, {"name": "Grammar checked by", "members": [{"user_id": 241023, "username": "Kris"}]}], "writtenBy": [{"user_id": 242047, "username": "Joltage"}]}
  },
  "Sobble": {
    "sets": [
      {
        "name": "Dual Screens",
        "description": "<p>This set takes advantage of Sobble's access to both Reflect and Light Screen combined with its decent Speed stat to support its team. Light Clay is the preferred item due to extending the duration of dual screens, though Eviolite can be used as well to make setting them a little easier. U-turn allows Sobble to bring in a teammate, ideally a sweeper after setting dual screens, while Surf works as a decently strong STAB move in a pinch. The EVs are used to boost Sobble's Speed and bulk to give it an easier time to set dual screens. Keep in mind that Sobble isn't particularly bulky, so avoid switching it into powerful attacks, and that relying on dual screens tactics is somewhat unreliable and matchup-dependent, which makes Sobble a mediocre pick.</p> <p>Setup sweepers that can take advantage of dual screens support such as Scraggy, Corphish, and Nasty Plot Vullaby are ideal teammates for Sobble. Sobble struggles against Grass- and Electric-type Pokemon such as Oddish and Chinchou, which makes Ferroseed a useful teammate, as it can handle such threats. Using Natu over Sobble as a dual screens setter should be considered as it has a useful ability in Magic Bounce. Also, note that Memento users like Diglett and Cottonee can be more consistent in supporting setup sweepers.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 213064, "username": "Merritt"}, {"user_id": 410251, "username": "zizalith"}]}, {"name": "Grammar checked by", "members": [{"user_id": 297659, "username": "deetah"}]}], "writtenBy": [{"user_id": 456766, "username": "Muksu"}]}
  },
  "Arrokuda": {
    "sets": [
      {
        "name": "All-out Attacker",
        "description": "<p>Arrokuda is primarily a revenge killer, using its vast movepool and coverage options to check a variety of threats. Close Combat is able to 2HKO Ferroseed and Cufant as well as OHKO Pawniard. Aqua Jet lets Arrokuda deal with more offensive teams by picking off their faster weakened Pokemon. Psychic Fangs destroys Croagunk and 2HKOes Mareanie, while Drill Run can also be run to deal super effective damage to Chinchou at the cost of only 2HKOing Croagunk. Lastly, Poison Jab is also an option to check and OHKO Cottonee and Morelull. This simple EV spread paired with a Jolly nature maximizes Arrokuda's Speed and offensive potential, while the 17 HP IVs ensure that Arrokuda only takes 1 HP of Life Orb recoil every attack by being at maximum 19 HP. However, if Berry Juice is opted for instead, make sure to have perfect IVs and add the remaining 28 EVs into HP for a little bit more longevity.</p> <p>Entry hazard setters such as Ferroseed, Onix, and Pawniard benefit Arrokuda's ability to score more KOs thanks to the chip damage dealt to the foes by entry hazards throughout the game; with one layer of Spikes up, Mareanie often drops to Psychic Fangs after a Liquidation, while Ferroseed usually drops to Close Combat after a Liquidation. VoltTurn users like Vullaby and Chinchou allow for Arrokuda to switch in safely due to its poor bulk, while Arrokuda benefits these three users in particular by checking Onix and other Rock- or Ground-types to more easily spam a singular move.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 213064, "username": "Merritt"}, {"user_id": 195129, "username": "Nineage"}]}, {"name": "Grammar checked by", "members": [{"user_id": 297659, "username": "deetah"}]}], "writtenBy": [{"user_id": 264307, "username": "crusty"}]}
  },
  "Cufant": {
    "sets": [
      {
        "name": "Bulky Attacker",
        "description": "<p>Cufant's role in the metagame is as a bulky attacker, mainly used to check Fairy-types. Sheer Force-boosted attacks like Iron Head coming off a respectable base 80 Attack make it a decent threat, and with a good defensive typing in Steel, Cufant can switch into common Pokemon like Spritzee and Ferroseed. This EV spread lets Cufant hit 18 Attack and maintain a good 24/14/12 bulk. Cufant's additional moves can provide extra coverage or set up entry hazards to support its teammates; Power Whip can hit Water-types and Onix, Play Rough hits Fighting-types, and so on. However, Cufant is very slow, so it should be used with Pokemon that can take care of its checks; for example, Vullaby and Wingull can beat Fighting-types, and Chinchou can beat Fire-types as well as provide a slow VoltTurn to pivot Cufant in. A Wish passer like Spritzee can keep Cufant's health up since it lacks reliable recovery itself. Pokemon that struggle with Fairy-types, like Scraggy and Galarian Farfetch'd, benefit from Cufant's presence on the team.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 150971, "username": "Coconut"}, {"user_id": 213064, "username": "Merritt"}]}, {"name": "Grammar checked by", "members": [{"user_id": 122460, "username": "Mafeking"}]}], "writtenBy": [{"user_id": 202097, "username": "Gummy"}]}
  }
}