{
  "Clefable": {"sets": [{"name": "Utility"}, {"name": "Calm Mind"}, {"name": "Offensive"}]},
  "Alakazam": {"sets": [{"name": "Life Orb"}, {"name": "Focus Sash"}]},
  "Slowbro": {"sets": [{"name": "Choice Specs"}, {"name": "Defensive Pivot"}]},
  "Marowak-Alola": {"sets": [{"name": "Offensive Wallbreaker"}]},
  "Chansey": {"sets": [{"name": "Transform"}]},
  "Gyarados": {"sets": [{"name": "Setup Sweeper"}]},
  "Ditto": {
    "sets": [
      {
        "name": "Choice Scarf",
        "description": "<p>Ditto is one of the best revenge killers in the tier and excellent at taking advantage of setup sweepers like Gyarados, Excadrill, and Terrakion that would be difficult to adequately cover defensively otherwise. It's a fairly straightforward Pokemon to use, as it transforms into any Pokemon you send it out against, bar a few situations, most commonly if the opposing Pokemon has a Substitute up. Due to its ability to check so many top-tier threats, Ditto can fit on all kinds of teams from offense to stall, but most commonly it finds its place on bulkier balance teams. Ditto doesn't need much support due to its nature, but it does appreciate U-turn and Volt Switch users like Corviknight, Urshifu, and Rotom-H to safely pivot it into frightening threats that it can't directly switch into otherwise, such as Keldeo and Excadrill. Ditto's ability to capitalize on setup Pokemon greatly discourages opposing teams from using setup, which gives teams with Ditto a huge advantage. Ditto is key in gaining momentum against fast and frail Pokemon without Choice Scarf, as it can force them out easily. This works for most strong wallbreakers provided you have a way to safely bring Ditto in. Additionally, Ditto can scout for coverage from opposing Pokemon such as Zeraora, Sylveon, and Rotom-H, which can be important in checking these threats.</p> <p>Ditto has a few moveset options, and though it rarely gets to utilize these tools, they can be useful in a pinch. Rapid Spin or Court Change can be used to control entry hazards on the field; Rapid Spin is arguably better due to damaging the target, while Court Change can impact the entire field by shifting hazards over to the opposing team's side. Whirlwind is an especially useful tool for Ditto that can phaze Substitute users. Recover gives Ditto increased longevity in lengthy battles. Heal Bell is solid utility that can heal your team of status conditions in a pinch, while Super Fang is the best offensive option Ditto has. Perish Song, Encore, or Wish have marginal utility, but each have their own merits for teams to use. 252 Defense EVs and 0 Speed IVs with a Relaxed nature minimize damage taken from an opposing Ditto's Struggle and lower Ditto's Speed so it hopefully moves after opposing Ditto to avoid being the first to KO itself with Struggle damage.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 305826, "username": "drampa's grandpa"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "The Dutch Plumberjack"}]}], "writtenBy": [{"user_id": 324242, "username": "In The Hills"}]}
  },
  "Dragonite": {"sets": [{"name": "Dragon Dance"}]},
  "Azumarill": {"sets": [{"name": "Swords Dance"}, {"name": "Defensive"}]},
  "Slowking": {"sets": [{"name": "Assault Vest"}]},
  "Blissey": {"sets": [{"name": "Bulky Pivot"}]},
  "Tyranitar": {"sets": [{"name": "Defensive"}]},
  "Celebi": {"sets": [{"name": "Offensive"}]},
  "Hippowdon": {"sets": [{"name": "Support"}]},
  "Tangrowth": {"sets": [{"name": "Rocky Helmet"}, {"name": "Assault Vest"}]},
  "Rotom-Heat": {
    "sets": [
      {
        "name": "Defensive",
        "description": "<p>This set is designed to check important threats in the metagame, namely Zeraora, Ferrothorn, and Sylveon. The Speed EVs allow for Rotom-H to outpace maximum Speed neutral natured Aegislash, while maintaining as much special bulk as possible. The rest of the EVs maximize Rotom-H's special bulk to better check Sylveon. Lava Plume is Rotom-H's main STAB attack, and the 30% chance to burn targets can come in handy; Blue Flare can be used for extra damage output, but generally Lava Plume’s extra PP and higher chance to burn is more desirable. Volt Switch is an important tool for Rotom-H that allows it to pivot and scout for switches. Roost is Rotom-H's main recovery move and increases its longevity immensely. Toxic allows Rotom-H to beat defensive Sylveon properly and allows for it to hinder other switch-ins as well. Defog is a great tool to remove entry hazards and dual screens, while Freeze-Dry's increased coverage is great for would-be switch-ins such as Seismitoad and Rotom-Wash.  Will-O-Wisp, Nuzzle, and Aromatherapy are all worth considering as support options, as well as many other niche options. Due to Rotom-H's weakness to Stealth Rock, Heavy-Duty-Boots is the preferred item on this set to eliminate this weakness, but Leftovers is an acceptable choice as well.</p> <p>Rotom-H's best partners are typically Pokemon that appreciate its slow pivoting. In particular, Obstagoon can use Rotom-H’s pivoting to activate its Guts with Flame Orb safely, while Rotom-H can solidly check some of Obstagoon's checks in Corviknight Ferrothorn, Magearna, and Hippowdon. Kyurem is a good partner, as Rotom-H is one of the best switch-ins in the metagame to one of Kyurem's most prevalent checks, Sylveon, given Rotom-H has Toxic. Sylveon can possibly hinder Rotom-H as well if it has Toxic as well, however, so be careful. Some of Rotom-H's most common switchins are Water-type Pokemon such as Seismitoad and Rotom-W if it is not running Freeze-Dry, so a partner such as Seismitoad or Ferrothorn that can switch into Water-type Pokemon relatively safely is great, and both of the aforementioned partners can form a core that compresses both entry hazard roles with Rotom-H. Some of the strongest checks in the metagame to Rotom-H are Dragon-type Pokemon such as Kommo-o and Hydreigon, which take minimal damage from Freeze-Dry and do a ton of damage back. Rotom-H is a great partner for Water-type Pokemon such as Keldeo, Azumarill and Gyarados, which can struggle to get past Ferrothorn and other physically bulky Pokemon.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 305826, "username": "drampa's grandpa"}]}], "writtenBy": [{"user_id": 324242, "username": "In The Hills"}]}
  },
  "Rotom-Wash": {
    "sets": [
      {
        "name": "Defensive",
        "description": "<p>This set is designed to act as a pivot and bulky check to many Pokemon both defensive and offensive, including Cinderace, Corviknight, Sand Rush Excadrill, and Toxapex. The Speed EVs allow Rotom-W to outpace Jolly Choice Band Cinderace after a V-create, and Rotom-W can either OHKO back with Scald, while the rest of the spread maximizes physical bulk. Scald is the primary STAB attack of choice, allowing Rotom-W to burn the foe while also damaging it, and Volt Switch allows Rotom-W to act as a pivot and scout for switches, which Rotom-W does very effectively thanks to its ability to force out most Ground-types due to its Water typing. Roost is Rotom-W's primary form of recovery, and is a reliable way of keeping Rotom-W healthy. Strength Sap is another option that greatly improves Rotom-W's matchup versus physical threats, as it lowers the foe's Attack stat by one stage; however, it can fail to be effective against many special attackers and Substitute users such as all Rotom formes, Sylveon, and Kyurem.</p> <p>Pokemon that benefit from Rotom-W's pivoting make for good partners. Cinderace appreciates the free switch ins, as it can nuke many of Rotom-W's would-be answers such as Ferrothorn and non-Choice Scarf Hydreigon with super effective Fire- and Fighting-type moves, respectively. Obstagoon also appreciates Rotom-W's pivoting ability, as it can allow Obstagoon to activate its Guts with Flame Orb safely, and Rotom-W can check Pokemon such as Hippowdon and Corviknight for Obstagoon. Rotom-W's last moveslot is versatile and can be a plethora of moves depending on your team's structure and playstyle. Rotom-W heavily pressures defensive cores thanks to its extremely large movepool, making it an effective lure for many Pokemon. Examples of this includes running Blue Flare to OHKO Ferrothorn to support Gyarados and running Freeze-Dry to hit Seismitoad and Gastrodon alongside Dragon- and occasional Grass-types such as Kommo-o and Rillaboom to support various Water-type teammates such as Keldeo. Apple Acid can be used as well to hit Gastrodon and Seismitoad while simultaneously forcing switches through Special Defense drops, but it loses the Grass- and Dragon-type targets that Freeze-Dry hits. Aromatherapy, Nuzzle, and Will-O-Wisp are all worth considering as support options, alongside many other niche options too numerous to list here.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 238307, "username": "Fissure"}, {"user_id": 255984, "username": "Funbot28"}]}, {"name": "Grammar checked by", "members": [{"user_id": 241023, "username": "Kris"}]}], "writtenBy": [{"user_id": 305826, "username": "drampa's grandpa"}]}
  },
  "Heatran": {"sets": [{"name": "Support"}]},
  "Excadrill": {"sets": [{"name": "Sand Sweeper"}, {"name": "Setup Sweeper"}]},
  "Seismitoad": {"sets": [{"name": "Physical Wall"}]},
  "Ferrothorn": {"sets": [{"name": "Physically Defensive"}]},
  "Volcarona": {"sets": [{"name": "Offensive Quiver Dance"}]},
  "Terrakion": {"sets": [{"name": "Choice Band"}, {"name": "Setup Sweeper"}]},
  "Kyurem": {"sets": [{"name": "Wallbreaker"}]},
  "Keldeo": {"sets": [{"name": "Choice Specs"}, {"name": "Choice Scarf"}]},
  "Aegislash": {"sets": [{"name": "All-out Attacker"}]},
  "Sylveon": {"sets": [{"name": "Physically Defensive"}, {"name": "Choice Specs"}]},
  "Incineroar": {"sets": [{"name": "Bulky Pivot"}]},
  "Toxapex": {"sets": [{"name": "Physically Defensive"}]},
  "Mimikyu": {"sets": [{"name": "Swords Dance"}]},
  "Kommo-o": {"sets": [{"name": "Body Press"}, {"name": "Offensive"}]},
  "Tapu Lele": {"sets": [{"name": "Psychic Surge Wallbreaker"}]},
  "Celesteela": {"sets": [{"name": "Defensive"}]},
  "Magearna": {"sets": [{"name": "Double Dance"}, {"name": "Specially Defensive"}]},
  "Zeraora": {"sets": [{"name": "All-out Attacker"}]},
  "Melmetal": {"sets": [{"name": "Choice Band"}]},
  "Rillaboom": {"sets": [{"name": "Choice Band"}, {"name": "Swords Dance"}]},
  "Cinderace": {"sets": [{"name": "Choice Band"}, {"name": "All-Out Attacker"}]},
  "Corviknight": {"sets": [{"name": "Defensive Pivot"}]},
  "Centiskorch": {"sets": [{"name": "Sticky Web"}]},
  "Obstagoon": {
    "sets": [
      {
        "name": "Guts",
        "description": "<p>Obstagoon's niche in the metagame comes from its incredible typing and powerful STAB moves, allowing it to be an enormous threat to many of the Pokemon in the metagame such as Zeraora, Toxapex, and Alolan Marowak. Other than the Ghost- and Psychic-types that are threatened by Obstagoon's immensely powerful Dark-type STAB moves, Obstagoon OHKOes a good portion of the metagame with its Facade as well, while easily finding opportunities to set up Swords Dance on weakened foes. In addition, Obstagoon is capable of OHKOing a plethora of offensive threats with its Sucker Punch after a Swords Dance boost. Close Combat can be used over Swords Dance in order to OHKO Tyranitar, Urshifu and Terrakion, but this compromises Obstagoon's ability to sweep. Obstagoon's respectable bulk means that it'll be able to take most hits, too. A Jolly nature is used to outpace threats such as Excadrill and Kommo-o, as well as Speed tie with Indeedee and opposing Obstagoon. An Adamant nature can be used to hit walls such as Ferrothorn, Corviknight, and defensive Hippowdon harder while OHKOing Sylveon, but a Jolly nature is otherwise preferred to limit offensive counterplay.</p> <p>However, Obstagoon is not without its flaws. It requires teammates to deal with Fighting-types such as Urshifu, Terrakion and Keldeo, as once they are in, they can easily live a Sucker Punch from Obstagoon and revenge kill it, and they can outspeed it as well. Switch-ins to these Pokemon include Aegislash, Toxapex, and Hippowdon, although a lot of these are very shaky checks to Terrakion. Obstagoon can struggle to break bulkier Steel-types such as Magearna, Ferrothorn, and Corviknight, so Fire-types like Rotom-H, Marowak-Alola and Cinderace make good partners. Obstagoon also appreciates entry hazard support from Pokemon like Ferrothorn, Hippowdon, and Toxapex. Entry hazard control is very appreciated from Pokemon such as Corviknight, Azumarill and Sylveon, as Obstagoon is very susceptible to being worn down otherwise due to the combination of damage from entry hazards as well as burn.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 324242, "username": "In The Hills"}]}], "writtenBy": [{"user_id": 330455, "username": "GL Volkner"}]}
  },
  "Indeedee": {"sets": [{"name": "Choice Specs"}, {"name": "Choice Scarf"}]},
  "Dracozolt": {"sets": [{"name": "Setup Sweeper"}]},
  "Urshifu-Rapid-Strike": {"sets": [{"name": "Choice Band"}]}
}