{
  "Slowking": {
    "comments": "<h1>Other Options</h1> <p>Colbur Berry allows Slowking to pivot out of Dark-types while also patching up its vulnerability to Pursuit and Knock Off, but it is very matchup reliant overall, and letting hazards undermine its pivoting capabilities is generally not a worthwhile trade-off. Toxic can be used to cripple other support Pokemon and walls like Rotom-W and Assault Vest Reuniclus, but it is hard to fit due to the importance of Slowking's other moves.</p> <h1>Checks and Counters</h1> <p><strong>Dark-types: Zarude resists Scald, easily OHKOes Slowking with Power Whip, and can even heal off status with Jungle Healing. Galarian Moltres can set up on non-Thunder Wave Slowking and rip through it with +2 Fiery Wrath. Bisharp and Krookodile can even Pursuit trap Slowking in addition to threatening it with STAB Knock Off, although both should be wary of a potential Scald burn.</p> <p><strong>Grass-types: Grass-types like Amoonguss, Tangrowth and Roserade can often come in on Slowking to make progress because Slowking can't directly threaten them with anything, barring Thunder Wave on Roserade. Most notably, these Grass-types scare it with the possibility of landing Sleep moves on it, poisoning it with Sludge Bomb, or using Knock Off in Tangrowth's case. Roserade can also freely set up Spikes or 2HKO Slowking with Life Orb Giga Drain. However, none of these Pokemon barring Assault Vest Tangrowth should be taking Future Sight.</p> <p><strong>Electric-types: Electric-types such as Zeraora and Mega Manectric threaten Slowking with their respective STAB moves or break it down with pivoting moves. However, both fear Scald burns when switching into it.</p> <p><strong>Bug-types: While they must be careful around Scald, Bug-types such as Scizor, Buzzwole and Mega Beedrill can threaten to OHKO Slowking with their STAB moves if given the opportunity. Scizor and Mega Beedrill running U-turn even allows them to pivot out as Slowking switches to preserve momentum, while their access to Pursuit means that they can also land significant damage as it switches.</p> <p><strong>Physical Wallbreakers: Pokemon like Dragon Dance Mega Altaria and Salamence can take advantage of Slowking's mediocre Defense stat to overpower it with boosted attacks, while others such as offensive Scizor, Bisharp and Tapu Bulu, can even do so without needing to set up. However, none of these Pokemon appreciate a burn from Scald or paralysis from Thunder Wave.</p> <p><strong>Aegislash: Aegislash is easily able to threaten Slowking with Ghost-type STAB moves or use it as setup fodder, with Scald unable to break a Substitute from Substitute + Toxic sets. The more offensive variants of Aegislash such as Spell Tag and Swords Dance need to watch out for a burn or Thunder Wave while trying to take advantage of Slowking, however.</p> <p><strong>Passive Damage</strong>: Even with Regenerator, Toxic forces Slowking to use Slack Off more and is also common on Pokemon that it checks or tries to gain momentum on, like Hippowdon and defensive Moltres. Knock Off users like Nihilego, Tangrowth and Deoxys-D can limit the number of Pokemon Slowking can switch into regularly with hazards up.</p> ",
    "sets": [
      {
        "name": "Defensive Pivot",
        "description": "<p>Thanks to its great special bulk, good defensive typing, and access to Regenerator, Slowking can consistently pivot into and check several dangerous special attackers such as Choice Specs Primarina, offensive Moltres, and Defog Salamence. This is very useful for easing the burden on its team to play around these threats throughout the game. Scald, besides being a STAB attack, has a burn chance to stop Dark-types such as Bisharp and Krookodile from getting too comfortable in attempting to Pursuit trap Slowking. It also potentially cripples other Pokemon like Scizor and Aegislash, which may try to exploit its passivity. Thunder Wave expands its defensive versatility against Pokemon like Alakazam and Galarian Moltres, which may try to set up on it. Crippling them saves Slowking from constantly relying on bringing another teammate in against them, which requires Teleport to do safely; and thus risking a foe attack. Future Sight can be used in conjunction with Teleport to build up momentum for its offensive teammates like Melmetal and Zeraora, and create advantageous scenarios for them by pressuring their usual checks such as physically defensive Tangrowth and Buzzwole. Heavy-Duty Boots lets it pivot without damage from entry hazards. The given EV spread allows Slowking to survive a Knock Off from non-Choice Band Krookodile while maximizing its special bulk and HP gained from Regenerator. A Sassy nature and 0 Speed IVs maximize the odds of Teleport going last in mirror matches. A physically defensive spread can be used to help Slowking's team pivot around Melmetal and Urshifu-R more effectively, but Slowking's weakness to Pursuit and common coverage moves from these Pokemon, like Thunder Punch and U-Turn, prevent it from doing this consistently.</p> <p>Slowking easily bringing in strong wallbreakers and scouting the Pokemon it can switch into is highly important to various forms of offense and bulky offense. Wallbreakers such as Melmetal, Urshifu-R, and Bisharp enjoy the free entry from Teleport making up for their defensive shortcomings, in addition to Future Sight dissuading checks like Amoonguss and Buzzwole from switching in. Similarly grateful are the late-game cleaners commonly supporting these Pokemon like Dragon Dance Mega Altaria, Swords Dance Scizor, and Bulk Up Zeraora. Slowking is very weak to Dark- and Bug-type attackers in Scizor, Zarude and Krookodile, so Pokemon that can cover them like Skarmory, Buzzwole, and Galarian Weezing make for good choices, and they appreciate Slowking's ability to switch into Fire-, Flying-, and Psychic-type attacks respectively. Skarmory is especially notable, as its Spikes and phazing combine with Slowking's Future Sight to rack up chip damage on Pokemon that need to stay healthy, like Melmetal and Swampert. Amoonguss and Tangrowth can form nice Regenerator cores with Slowking and provide coverage against Electric- and Grass-types such as Zeraora, Mega Manectric, and Tapu Bulu. Fire-types like Moltres and Rotom-H can threaten Grass-types while appreciating Slowking switching into Water-types like Primarina and Keldeo. Finally, Slowking's initial passivity may leave it susceptible to getting overwhelmed by some of the Pokemon it is supposed to check, so a backup defensive teammate like Rotom-H that can take advantage of the moves Slowking forces Pokemon to lock into, such as Hurricane from Moltres or Moonblast from Primarina, can help.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 282732, "username": "Niadev"}, {"user_id": 535121, "username": "Pubo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 546157, "username": "Arishem"}]}
  },
  "Skarmory": {
    "comments": "<h1>Other Options</h1> <p>Skarmory has access to a variety of utility moves. Iron Defense + Body Press can let it be a bulky wincon and better handle Melmetal, Bisharp, and Scizor, but it's very vulnerable to special attackers and gives Aegislash a free switch in. If the team lacks a user, Stealth Rock can be used alongside Spikes, compressing both entry hazards in one Pokemon. Safety Goggles can be used to block powder moves like Spore from Amoonguss and Sleep Powder from Roserade to easily set Spikes against them.</p> <h1>Checks and Counters</h1> <p><strong>Fire-type Pokemon and Coverage: Moltres and Rotom-H can easily switch in and KO Skarmory with their Fire-type STAB moves. However, said Pokemon don't appreciate Toxic. Fire-type coverage from Pokemon that Skarmory is supposed to check like Mega Altaria and Salamence also threatens it greatly due to its low Special Defense.</p> <p><strong>Electric-types: Rotom-W, Rotom-H, Zeraora, and Mega Manectric can force out Skarmory with their STAB moves or generate momentum with Volt Switch. The former two can even remove Skarmory's Spikes with Defog or cripple it with Will-O-Wisp, negating its Sturdy.</p> <p><strong>Special Attackers: Due to Skarmory's low Special Defense, powerful special attackers like Primarina, Aegislash, and Volcanion can force it out or even KO it with ease.</p> <p><strong>Taunt and Magic Bounce Users: Taunt users such as Deoxys-D and Krookodile and Magic Bounce Hatterene completely deny Skarmory's Spikes. The former two can even set their own entry hazards, while Hatterene can use it as setup fodder. However, Krookodile should be aware of Body Press and Deoxys-D hates getting poisoned. Protective Pads Urshifu-R can use also use Taunt to prevent Skarmory from using Roost, potentially securing a win late-game.</p> ",
    "sets": [
      {
        "name": "Defensive",
        "description": "<p>Skarmory's great Defense stat, reliable recovery in Roost, and amazing defensive typing let it consistently check physical attackers like Scizor, Melmetal, and Mega Altaria. Since Skarmory forces out a lot of common threats, it can easily use those turns to set Spikes to wear down defensive Pokemon such as Aegislash, Scizor, Amoonguss, and Tangrowth, paving the way for a late-game sweeper like Mega Altaria. Whirlwind forces out setup sweepers like Mega Altaria, Scizor, and Bulk Up Zarude. It also synergizes well with Spikes by forcing chip damage on switch-ins like Mega Manectric and Aegislash. Toxic is a solid alternative to Whirlwind, reducing the amount of times Defoggers such as Rotom-W, Moltres, and Salamence can safely use Defog. Body Press makes use of Skarmory's excellent Defense by threatening Melmetal, Zarude, and Bisharp. Alternatively, Brave Bird is an option to immediately threaten Pokemon like Amoonguss and Urshifu-R. Rocky Helmet punishes U-turn attempts from Urshifu-R lacking Protective Pads, Scizor, and Zarude, being especially useful at deterring the former's Surging Strikes.</p> <p>Skarmory fits best on balance and bulky offense teams as a solid check to physical attackers and a Spiker with Whirlwind to help Pokemon such as Urshifu-R wallbreak. Hippowdon is an amazing partner, as its Stealth Rock lets them form a great entry hazard-stacking core, especially since Hippowdon can consistently deal with and wear down Defoggers that threaten Skarmory like Rotom-H and Moltres with sand and Toxic. Hippowdon can also check Electric-types such as Mega Manectric for Skarmory, while the latter can easily check Grass-types like Zarude and Tapu Bulu. On more offensive structures, Swampert can perform a similar role by setting Stealth Rock and checking Fire-types, and Flip Turn also lets it safely bring Skarmory into Grass-types. However, Swampert lacks reliable recovery and gets easily worn down by status and hazards, making Hippowdon the superior choice in most cases. Grass-types like Amoonguss and Tangrowth can deal with problematic Water- and Electric-types like Primarina, Rotom-W, and Zeraora. Slowking, Rotom-W, and Moltres can deal with Fire-types that force Skarmory out like Volcanion and opposing Moltres. Melmetal can cripple Skarmory with Thunder Wave and proceed to flinch it down with Double Iron Bash, so additional checks to it like Rotom-W, Gligar, and Rotom-H make for solid partners. Since Skarmory has a poor matchup against common Defoggers such as Rotom-W and Rotom-H, Pokemon that can lure in and cripple them like Melmetal and Zeraora are appreciated. Melmetal can poison them with Toxic, while Zeraora can use Knock Off to remove Leftovers from Rotom-W and Heavy-Duty Boots from Rotom-H. Stallbreakers like Deoxys-D and Hatterene completely shut down Skarmory, denying its Spikes, so Dark-types that can pressure them like Bisharp are appreciated. Finally, late-game sweepers and strong wallbreakers like Urshifu-R, Primarina, and Zeraora enjoy Skarmory's Spikes constantly weakening defensive answers like Swampert, Scizor, Tangrowth, and Amoonguss, putting them in range of their attacks late-game.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 282732, "username": "Niadev"}, {"user_id": 546157, "username": "Arishem"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 535121, "username": "Pubo"}]}
  },
  "Aegislash": {"sets": [{"name": "Specially Defensive"}, {"name": "Swords Dance"}, {"name": "Substitute + Toxic"}]},
  "Zeraora": {"sets": [{"name": "Pivot"}]},
  "Melmetal": {"sets": [{"name": "Protective Pads"}, {"name": "Choice Band"}]},
  "Grimmsnarl": {
    "comments": "<h1>Other Options</h1> <p>Thunder Wave may be used over Spirit Break to cripple faster Pokemon such as Choice Scarf Mienshao, Azelf, and Nihilego. Hyper offense staples such as Celesteela and Galarian Moltres can use this to paraflinch Nihilego. However, Thunder Wave makes Grimmsnarl more passive, allowing Pokemon such as Rotom-H to use it as setup fodder.</p> <h1>Checks and Counters</h1> <p><strong>Strong Wallbreakers: Although Grimmsnarl's dual screens can protect it somewhat, strong wallbreakers such as Melmetal, Mega Altaria, Scizor, and Aegislash are still extremely threatening to it.</p> <p><strong>Knock Off: Knock Off from Pokemon such as Krookodile, Scizor, Tangrowth, and Azumarill can remove Grimmsnarl's Light Clay, which makes future screens less effective.</p> <p><strong>Taunt: Taunt from Pokemon such as Krookodile disables most of Grimmsnarl's moves, but Krookodile isn't a safe switch-in, as Spirit Break can easily 2HKO it.</p> <p><strong>Steel-types</strong>: Steel-types such as Melmetal, Scizor, and Bisharp all threaten to KO Grimmsnarl with their Steel-type attacks. Bisharp is especially excellent because of how Spirit Break's Special Attack drop activates Defiant.</p> ",
    "sets": [
      {
        "name": "Dual Screens",
        "description": "<p>Grimmsnarl's access to Prankster, Taunt, and good defensive typing make it the metagame's most consistent user of dual screens, which greatly helps hyper offense teams. Prankster helps it set both screens before getting KOed. Taunt stops many popular Defoggers such as Rotom-W, Rotom-H, and Moltres from removing dual screens, as well as preventing Rotom-H and others from freely setting up. Taunt also denies Stealth Rock attempts from Swampert, Nihilego, and Hippowdon, benefiting Rock-weak setup sweepers such as Life Orb Salamence and Flyinium Z Galarian Moltres. Despite Taunt, Grimmsnarl is somewhat passive, letting certain Pokemon like Celesteela, Mega Altaria, and Melmetal take advantage of it. Spirit Break allows Grimmsnarl to hit Dark-types immune to Taunt, such as Krookodile, Galarian Moltres, and Zarude. 132 Defense EVs allow it to survive Adamant Life Orb Scizor's Bullet Punch and Melmetal's Double Iron Bash with Reflect active.</p> <p>Grimmsnarl only fits on hyper offense teams, as they can take full advantage of its turns of dual screens. Many setup sweepers appreciate said dual screens, such as Mega Altaria, Azumarill, Celesteela, Galarian Moltres, and Rotom-H. Mega Altaria and Azumarill are especially important because they can also check Urshifu-R, a problematic Pokemon for hyper offense. Entry hazard setters such as Deoxys-D, Azelf, and Krookodile appreciate Grimmsnarl preventing Defog through Taunt, ensuring that their hazards stay active. Bisharp is also a good partner, as Defiant further discourages Defog attempts, helping Grimmsnarl to keep its dual screens up.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 535121, "username": "Pubo"}, {"user_id": 546157, "username": "Arishem"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 508532, "username": "TheShowdownHoedown"}]}
  },
  "Dracozolt": {"sets": [{"name": "Sand Rush"}, {"name": "Substitute Z-Move"}]},
  "Urshifu-Rapid-Strike": {"sets": [{"name": "Bulk Up"}, {"name": "Choice Band"}]},
  "Regieleki": {
    "comments": "<h1>Other Options</h1> <p>Regieleki has no other viable options.</p> <h1>Checks and Counters</h1> <p><strong>Ground-types</strong>: Regieleki is unable to do significant damage to Ground-type Pokemon such as Swampert, Hippowdon, Krookodile, Rhyperior, and Gligar.</p> <p><strong>Ghost-types: Ghost-type Pokemon such as Aegislash, Chandelure, and Jellicent are immune to both Rapid Spin and Explosion, allowing their teams to keep entry hazards on Regieleki's side of the field.</p> <p><strong>Knock Off: Knock Off from Pokemon such as Krookodile, Scizor, Tangrowth, and Azumarill removes Regieleki's Light Clay, shortening the duration of its dual screens.</p> ",
    "sets": [
      {
        "name": "Dual Screens",
        "description": "<p>Regieleki's uncontested Speed tier and utility options in Rapid Spin and Explosion make it an adequate dual screens user, as its Speed allows it to guarantee at least one of Light Screen and Reflect. Nevertheless, Grimmsnarl is major competition for Regieleki due to Prankster, which allows its Taunt to prevent entry hazards and Defog from foes outright. Grimmsnarl also has a better defensive profile, soft checking Pokemon such as Galarian Moltres and being able to set dual screens multiple times through the game. Explosion, though, is Regieleki's main selling point over Grimmsnarl. It indirectly blocks Defog, echoing Grimmsnarl's Taunt, but it also blocks Rapid Spin and gives free momentum, a massive boon for hyper offense teams.</p> <p>Regieleki fits exclusively on hyper offense teams, as many setup sweepers such as Mega Altaria, Azumarill, Nihilego, Rotom-H, and Celesteela value its dual screens support. Mega Altaria and Azumarill in particular help against Urshifu-R, a problematic Pokemon for hyper offense teams to deal with. These many setup sweepers also appreciate Explosion providing them with free momentum for more setup opportunities. Entry hazard leads such as Deoxys-D, Krookodile, and Azelf appreciate Explosion blocking opposing Rapid Spin and Defog, keeping their entry hazards up for teammates to exploit. Stealth Rock-weak setup sweepers such as Mega Altaria before Mega Evolution, Life Orb Salamence, and Flyinium Z Galarian Moltres enjoy Rapid Spin.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 535121, "username": "Pubo"}, {"user_id": 546157, "username": "Arishem"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 508532, "username": "TheShowdownHoedown"}]}
  }
}