{
  "Clefable": {
    "comments": "<h1>Other Options</h1> <p>Clefable can run Unaware over Magic Guard to counter a variety of setup sweepers such as Necturna, Dragonite, Garchomp, Weavile, and Cawmodore. However, it is usually outclassed by Arghonaut, which has phazing and better physical bulk, in this regard. Additionally, the Toxic and entry hazards immunity that Magic Guard provides is usually worth more than running Unaware. Clefable can run Calm Mind on its utility set if its team needs both Stealth Rock and a secondary win condition, but this set compromises on both sweeping power and utility. Also on its utility set, Clefable can run Sticky Barb along with Trick to cripple Heatran, Toxapex, Equilibra, and Corviknight. However, Trick lacks the consistency of Knock Off and can sometimes neuter Clefable if it receives an unwanted item, such as an Assault Vest from Galarian Slowking. Encore can be run on the utility set to reduce Clefable's tendency of being setup fodder while allowing it to essentially win against any opposing Calm Mind Clefable.</p> <h1>Checks and Counters</h1> <p><strong>Steel-types: Steel-types such as Melmetal, Scizor, Equilibra, and Ferrothorn are all good answers to Clefable, as they take little to no damage from Moonblast and force Clefable out with strong Steel-type STAB moves. Kartana does the same, but takes far more from Moonblast. None of these Pokemon enjoy switching into Flamethrower, however.</p> <p><strong>Fire-types: Fire-types such as Heatran, Astrolotl, Volcanion, Victini, and Volcarona all can come in on Clefable's Moonblast and force it out. Heatran can trap, taunt, and KO Clefable before it gets the chance to setup; Astrolotl can spam Fire Lash until Clefable is forced to switch and is very difficult to wear down; Victini and Volcanion force Clefable out with their nuclear STAB options; and Volcarona can setup alongside Clefable and beat it one-on-one. However, all of these Pokemon must beware Knock Off.</p> <p><strong>Strong Wallbreakers: Urshifu-R, Weavile, Tapu Lele, and Rillaboom can overwhelm Clefable and not allow it to switch in due to their immense offensive strength. Rillaboom in particular is a threat, forcing Clefable out with a roll to OHKO with Wood Hammer.</p> <p><strong>Poison-types: Poison-types such as Toxapex, Venomicon, Venomicon-E, and Galarian Slowking take little from any of Clefable's options and can force it out. It should be noted that Galarian Slowking and Venomicon must be wary of Knock Off, and Galarian Slowking cannot beat Calm Mind Clefable in a one-on-one. Moreover, the former three must be careful of getting hit by Thunder from Calm Mind sets.</p> ",
    "sets": [
      {
        "name": "Utility",
        "description": "<p>Clefable excels at providing a myriad of utility options to teams while acting as a solid defensive Pokemon due to its typing and bulk. Clefable is a great user of Stealth Rock, as it can take advantage of free turns versus passive Pokemon like Blissey, Toxapex, and Ferrothorn. Knock Off is the best option for the final slot to cripple Moonblast switch-ins such as Venomicon and Heatran, but Thunder Wave is an alternative choice to paralyze Pokemon less bothered by Knock Off like Venomicon-E, Toxapex, and Ferrothorn. The given EV spread allows Clefable to survive a +2 Earthquake from Garchomp, with the rest invested in Special Defense to better answer Dragapult. Alternatively, if Dragapult is already checked on a team, Clefable can run maximum investment in HP and Defense in order to check threats like Weavile and Pajantom better.</p> <p>Corviknight and Toxapex are excellent teammates for Clefable, as they can switch in on the physical wallbreakers that Clefable cannot handle such as Weavile, Melmetal, and Urshifu-R. Along those lines, Astrolotl, Venomicon, and Earthquake Galarian Slowking make great teammates, as they can consistently switch in on defensive Heatran and force it out, though Astrolotl must be wary of Toxic. Pokemon such as Equilibra and Venomicon-E can take advantage of Clefable's passivity, so teammates like Slowbro and Zapdos are appreciated for being able to check these Pokemon. Ground-types such as Landorus-T, Equilibra, and Garchomp are helpful for threatening Heatran, weakening opposing Equilibra, and for pressuring defensive Poison-types such as Toxapex and Galarian Slowking; moreover, the former two Ground-types form reliable hazard cores with Clefable by providing Defog and Rapid Spin, respectively. Finally, if Clefable is running Thunder Wave, Hex Dragapult is an excellent teammate, capable of punishing the special walls that otherwise answer Clefable such as Toxapex and Heatran.</p> "
      },
      {
        "name": "Calm Mind",
        "description": "<p>Due to Clefable's excellent defensive typing and good natural bulk, Clefable's Calm Mind set can quickly turn into an issue for the enemy team, with very little being able to meaningfully pressure it once it starts setting up. The final moveslot depends on the team. Flamethrower is used for hitting Equilibra, Melmetal, and Ferrothorn super effectively, while Thunder is mainly for Toxapex, which can otherwise use Haze, and Heatran. Knock Off can be run over a coverage move to cripple Pokemon like Heatran, Equilibra, and Galarian Slowking for itself and its teammates, though this decreases Clefable's sweeping potential. Similarly, Trick in conjunction with Sticky Barb can be used to further maim one of Clefable's checks, though this lacks the consistency of Knock Off. Life Orb is the preferred item, as it enables Clefable to be a strong late-game sweeper, but Leftovers is an option that allows Clefable to be a more effective wall before it sets up. 60 Speed EVs let Clefable outspeed uninvested Corviknight and slower Pokemon like Venomicon and Equilibra, however, one can put those EVs into Defense instead to be a sturdier defensive pivot.</p> <p>Clefable appreciates teammates such as Astrolotl and Garchomp that can take care of Heatran, which otherwise hard walls sets running Flamethrower. It additionally needs teammates that can switch in on Venomicon-E's Gunk Shot and Melmetal's Double Iron Bash, which Ferrothorn and Zapdos do well. Clefable pairs nicely with Heatran, Equilibra, and Corviknight, which can come in on opposing Equilibra's Doom Desire. In return, Clefable is a solid answer to Zeraora. Heatran deserves special mention for being able to trap and KO Toxapex, which otherwise can Haze stall Clefable if it lacks Thunder. Furthermore, Heatran pairs well with Knock Off Clefable, as it will be able to remove Toxapex's Shed Shell. Finally, Clefable should be paired with a special wall like Assault Vest Tornadus-T or Colossoil to take on special attackers such as Tapu Lele and Blacephalon that threaten it before it sets up.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 251944, "username": "spoo"}, {"user_id": 297859, "username": "quziel"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}]}], "writtenBy": [{"user_id": 277988, "username": "dex"}]}
  },
  "Zapdos": {
    "comments": "<h1>Checks and Counters</h1> <p><strong>Knock Off</strong>: Many of the threats Zapdos wants to switch into such as Venomicon-E, Zeraora, Landorus-T, Tornadus-T, and Kartana are also capable of crippling it with Knock Off. Without its Heavy-Duty Boots, Zapdos becomes far less reliable in dealing with these threats in the long term and is much more prone to being offensively overwhelmed.</p> <p><strong>Ground-types: While some Ground-types like Landorus-T and Garchomp struggle against strong Hurricanes from offensive Zapdos sets, they have little to fear from defensive variants lacking Toxic and can still effectively stop Zapdos from pivoting when played aggressively. Colossoil does much the same, but performs even better into defensive sets because Toxic activates its Guts boost. Other Ground-types like specially defensive Hippowdon and Gastrodon are strong counters to any Zapdos set, though they don't enjoy Toxic either.</p> <p><strong>Specially Defensive Walls: Special walls such as Galarian Slowking, Blissey, Heatran, and specially defensive Clefable can usually pivot into Zapdos with ease. Galarian Slowking is especially effective due to Regenerator providing free health with every interaction.</p> <p><strong>Ice-types: Syclant, Arctozolt, and Weavile are massively threatening to Zapdos and can easily force it out; however, they can't safely switch in due to Heat Wave, and Syclant can even become inflicted with paralysis if it uses U-turn on Zapdos carelessly.</p> <p><strong>Rock-types: Nihilego, Tyranitar, and Stratagem can switch into Zapdos's Flying- and Fire-type moves freely and force it out with their STAB options, while the former two have the bulk to withstand Zapdos's Electric-type STAB. However, the latter two must respect the threat of Toxic on defensive sets, and all three don't want to be paralyzed by Discharge.</p> <p><strong>Toxic: Common Toxic users like Landorus-T, Colossoil, Hippowdon, and occasionally Zeraora and Melmetal can permanently limit Zapdos's defensive value by inflicting it with status.</p> ",
    "sets": [
      {
        "name": "Pivot",
        "description": "<h1>Set Details</h1> <p>Zapdos's ability to combine numerous critical offensive and defensive traits into one teamslot situates it to be an effective option among the tier's many pivots. Discharge is preferred for consistently answering Venomicon and Venomicon-E, but Volt Switch is still a powerful option on Zapdos because it's incredibly hard to block; Zapdos's strong Hurricane acts as a spammable STAB option and punishes Ground-types like Garchomp and Landorus-T that attempt to stop it from pivoting, while Heat Wave allows it to actively counter other Ground-types like Equilibra. Heat Wave is also necessary to prevent opposing Cawmodore from successfully sweeping. The given EV spread allows Zapdos to always tank +6 Cawmodore's Acrobatics, outspeeds Timid Volcanion, and puts the remainder in Special Attack to hit as hard as possible.</p> <p>Zapdos is best paired with strong wallbreakers that appreciate being brought in for free via Volt Switch. Pokemon like Heatran, Galarian Slowking, and Tyranitar will often attempt sponging Zapdos's Volt Switch, so attackers such as Landorus-T, Colossoil, and Urshifu-R that can force these Pokemon out are good partners. Zapdos can still struggle against other special walls like specially defensive Clefable and even Slowking, which makes wallbreakers like Rillaboom powerful teammates; Rillaboom, Landorus-T, and Urshifu-R are also capable of forming potent VoltTurn cores with Zapdos. Zapdos is effective at weakening common Ground-types like Landorus-T, so Pokemon who appreciate this like Swords Dance Garchomp, Heatran, and Victini are strong partners as well. Because Zapdos can easily paralyze Pokemon like Rillaboom and Landorus-T that carelessly pivot with U-turn on it, partners like Hex Dragapult and Protective Pads Melmetal that can take advantage of this are useful to have on Zapdos's team.</p> "
      },
      {
        "name": "Utility",
        "description": "<h1>Set Details</h1> <p>Defensive Zapdos acts as a more durable check to physical attackers like Venomicon-E and Steel-types such as Melmetal and Kartana. Discharge is necessary for reliably answering Flying-type like Venomicon, Venomicon-E, and Tornadus-T while enabling Zapdos to spread paralysis multiple times per game in conjunction with Static, although Volt Switch can be chosen instead if one values its ability to regularly grab momentum. Hurricane is an option that lets Zapdos pressure common Ground-types like Landorus-T and Garchomp better at the cost of being unable to significantly threaten Heatran and bulky Water-types. Heat Wave is vital to answer Steel-type like Equilibra, Kartana, Melmetal, and Cawmodore; however, if Cawmodore invests 24 EVs into Special Defense and uses Drain Punch at +6 Attack then Zapdos can still lose. Toxic is a strong option for Zapdos against foes like Astrolotl, Tapu Koko, and Landorus-T; however, Defog provides valuable role compression for many teams, although Zapdos still tends to be crippled by Knock Off and Toxic from common Stealth Rock setters like Landorus-T in the process. 20 Speed EVs allow Zapdos to outspeed Modest Volcanion and Adamant Bisharp, while the rest of its EVs maximize its physical bulk for attackers like Kartana and Urshifu-R.</p> <p>Zapdos's ability to spread paralysis with Discharge and Static is heavily appreciated by its teammates, especially slower wallbreakers like Melmetal, Volcanion, and Tapu Lele that may be easily revenge killed otherwise. Because Zapdos is a good answer to Kartana, Rillaboom, and Tornadus-T, Urshifu-R and common Ground-types like Landorus-T are effective teammates. Ferrothorn is another good partner that can ease Zapdos's burden in checking offensive Grass-types, with Ferrothorn also acting as a servicable answer to Ice-types like Weavile and Arctozolt that would trouble Zapdos. It's incredibly common for Zapdos to be hit with Knock Off by a Pokemon like Zeraora, Landorus-T, Kartana, or Tornadus-T early in the game, so having a Knock Off absorber or secondary answer to some of these Pokemon like Clefable is advisable. Defog Zapdos also has a particularly difficult time against defensive Ground-types, so teammates that easily pressure them like Weavile, Venomicon, and Tapu Fini are good to have around.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 227784, "username": "snake_rattler"}, {"user_id": 297859, "username": "quziel"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}]}], "writtenBy": [{"user_id": 251944, "username": "spoo"}]}
  },
  "Slowking": {
    "comments": "<h1>Checks and Counters</h1> <p><strong>Dark-types</strong>: Hydreigon and Chromera can consistently switch into Slowking, given they don't mind Scald too much, and freely set up against it. Other Dark-types like Bisharp, Weavile, and Colossoil are much riskier to directly switch into Slowking, but they threaten massive damage and can even block Future Sight if played aggressively.</p> <p><strong>Bug-types: Miasmaw can wholly prevent Slowking from recovering health thanks to Neutralizing Gas and Taunt, and it can even OHKO Slowking with First Impression. Other Bug-types like Scizor and Syclant are problematic too, since they force Slowking out and then generate momentum with U-turn. All of these Pokemon are heavily punished by Scald burns, though, and thus must be very cautious against Slowking.</p> <p><strong>Ghost-types: Pajantom can't be burned by Scald and easily removes Slowking with Choice Band Spirit Shackle, while Dragapult and Choice Specs Aegislash aren't bothered too much by burns and can also deal with Slowking with ease.</p> <p><strong>Grass-types: Rillaboom and Kartana easily OHKO Slowking but must be cautious of Scald burns. Jumbao can use Trace to copy Slowking's Regenerator for free recovery, and Life Orb variants easily OHKO it with Leaf Storm. Geomancy Necturna can very easily set up against Slowking due to its typing and great special bulk.</p> ",
    "sets": [
      {
        "name": "Pivot",
        "description": "<h1>Set Details</h1> <p>Slowking defines the usage of delay moves in CAP's metagame. Thanks to Teleport, it can almost always safely bring in a devastating wallbreaker to take advantage of Future Sight. Additionally, Slowking is one of the most consistent answers to common special attackers like Heatran, Equilibra, and Tomohawk, and its impressive special bulk even lets it scout hits from strong Choice item attackers like Jumbao, Dragapult, and Kyurem that can hit it super effectively.</p> <p>Always pair Slowking with wallbreakers like Garchomp, Rillaboom, and Urshifu-R; they all benefit from Slowking's Future Sight preventing physical walls like Landorus-T, Zapdos, and Tomohawk from reliably answering them and appreciate Teleport giving them safe entry onto the field. Fairy-types are also great teammates to have to help with Dark-types like Hydreigon, Chromera, and Colossoil that can block Future Sight and don't mind switching into Scald. Slowking is prone to ceding momentum to Bug-types like Scizor and Syclant and really struggles with Miasmaw denying it recovery, so Steel- and Flying-types like Corviknight and Tornadus-T are good teammates.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 297859, "username": "quziel"}, {"user_id": 251944, "username": "spoo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 33374, "username": "Muk"}]}], "writtenBy": [{"user_id": 336073, "username": "Rabia"}]}
  },
  "Slowking-Galar": {
    "comments": "<h1>Other Options</h1> <p>An alternative set utilizing Calm Mind, Psyshock, Focus Blast or Scald, and Slack Off, alongside more Defense investment allows Galarian Slowking to turn into a very bulky sweeper; however, this set requires more team support and is generally not worth the large sacrifice in special bulk. Whirlpool is an option to trap and KO Toxapex and Clefable staying in on Galarian Slowking to use Knock Off, but it is generally not worth running over Scald.</p> <h1>Checks and Counters</h1> <p><strong>Dark-types: Dark-types such as Weavile, Hydreigon, and Colossoil all threaten Galarian Slowking with their super effective Dark-type STAB moves and are immune to Future Sight. Colossoil is particularly threatening, as its access to Guts, high special bulk, and resistance to Poison causes Sludge Bomb and Scald to not be safe moves for Galarian Slowking to use.</p> <p><strong>Ground-types: Ground-types like Landorus-T, Garchomp, and Hippowdon force Galarian Slowking out with the threat of Earthquake; however, all three are crippled by a Scald burn, and the former two despise switching into Ice Beam.</p> <p><strong>Ghost-types: Revenankh and Pajantom can blast through Galarian Slowking with their physical Ghost-type STAB moves, with Pajantom additionally being immune to any secondary status effects from Galarian Slowking's moves due to Comatose. Choice Specs Blacephalon and Dragapult can 2HKO Galarian Slowking with Shadow Ball, though the latter requires Stealth Rock damage in order to reach this benchmark.</p> <p><strong>Knock Off: Pokemon like Clefable, Tapu Fini, Toxapex, and Tornadus-T are usually capable of removing Galarian Slowking's Assault Vest with Knock Off, greatly reducing its ability to check special attackers like Tapu Koko and Tapu Fini.</p> <p><strong>Strong Physical Attackers: Due to Galarian Slowking's low physical bulk, strong physical attackers like Melmetal, Urshifu-R, and Kartana can KO Galarian Slowking with a small amount of prior chip. Melmetal in particular is notable, as it has the special bulk to tank any of Galarian Slowking's coverage moves and threatens an OHKO with Double Iron Bash. However, these Pokemon generally require a pivot to bring them in safely due to the threat of Galarian Slowking's coverage options and their secondary effects.</p> <p><strong>Specially Defensive Walls: Blissey can switch into Galarian Slowking, tank its Future Sight, and safely pivot into a physical attacker with Teleport, all while healing off any status it gets hit with through Natural Cure. Heatran can trap Galarian Slowking with Magma Storm and KO it if it lacks Earthquake, though it will be heavily weakened in the process. Corviknight avoids the 2HKO from Galarian Slowking's Flamethrower and can utilize Pressure to stall it. Slowking can use Galarian Slowking to set up Future Sight and use Teleport to safely bring in a wallbreaker to take advantage of Galarian Slowking.</p> ",
    "sets": [
      {
        "name": "Assault Vest",
        "description": "<p>Galarian Slowking's insane special bulk, access to Regenerator, expansive coverage, and excellent typing allow it act as an amazing check to many of the tier's special attackers such as Jumbao and Tapu Koko. Future Sight is the preferred option for the first moveslot, as it enables Galarian Slowking to support any of its more offensively inclined teammates; however, Psychic is another option that gives Galarian Slowking a more immediate offensive presence against Toxapex, Urshifu-R, and Venomicon. Flamethrower is used to hit Steel-types that resist Galarian Slowking's STAB moves like Melmetal, Equilibra, and Ferrothorn super effectively while also pressuring Weavile. The last moveslot is usually taken up by Scald, which is used to punish physical attackers that like to switch into Galarian Slowking like Zeraora, Landorus-T, and Garchomp; however, Ice Beam can be run to hit the latter two harder alongside hitting Dragapult super effectively. Earthquake can also be run in the last slot alongside a Sassy nature to turn Galarian Slowking into a situational Heatran check; however, Galarian Slowking sorely misses the ability to hit Ground-types super effectively. The given EV spread with a Calm or Sassy nature and an Assault Vest allows Galarian Slowking to avoid the 2HKO from Choice Specs Dragapult's Shadow Ball and survive one Surging Strikes from Choice Band Urshifu-R. If the Dragapult benchmark is not necessary, however, a Modest nature can be run to increase Galarian Slowking's damage output.</p> <p>Offensive Dragon-types like Dragapult and Garchomp appreciate Galarian Slowking's ability to counter Fairy-types like Clefable and Jumbao. In return, these Pokemon can chip the bulky Steel-types that often give Galarian Slowking trouble. Physically bulky Pokemon like Melmetal, Corviknight, and Buzzwole make for excellent partners, as they can switch into the many physical attackers that threaten Galarian Slowking like Melmetal and Weavile. The latter two in particular are valuable teammates for their ability to absorb Knock Off and answer problematic Ground-types like Landorus-T, with Corviknight being especially useful for slowly pivoting Galarian Slowking onto the field. Teammates like Landorus-T and Clefable also provide entry hazard support or removal, which is helpful for getting Future Sight to more easily break through walls or preserving Galarian Slowking's health. Weavile and Urshifu-R take great advantage of Galarian Slowking's Future Sight, which allows them to break through physically defensive walls like Toxapex more easily.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 273339, "username": "Lasen"}, {"user_id": 251944, "username": "spoo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}]}], "writtenBy": [{"user_id": 277988, "username": "dex"}]}
  },
  "Garchomp": {
    "comments": "<h1>Checks and Counters</h1> <p><strong>Fairy-types</strong>: Jumbao, Clefable, and Tapu Fini can all switch in on Garchomp and take a hit while threatening it out with Moonblast, but they still have to be careful of Life Orb Swords Dance sets. They also block Scale Shot and the Speed boost it provides so Garchomp can be more easily revenge killed. Kerfluffle has the option of switching in and threatening to OHKO, but it takes heavy damage from Earthquake.</p> <p><strong>Physically Bulky Pokemon: Tomohawk, Hippowdon, Slowbro, and Arghonaut all can take Garchomp's physical hits and force it out by either phazing it, threatening it with status, or straight up winning against it. None of them appreciate the defensive set's Toxic, though.</p> <p><strong>Ice-type moves: Syclant and Weavile both can outspeed and force out Garchomp, and they can even revenge kill it after Scale Shot with STAB Ice Shard. Ice Beam from various special attackers such as Krilowatt and Gastrodon will similarly end with Garchomp being KOed.</p> <p><strong>Rillaboom: Not only can Rillaboom revenge kill Swords Dance sets thanks to Grassy Glide and Scale Shot lowering Garchomp's Defense, but its Grassy Terrain lowers Earthquake's power. Defensive Garchomp will almost trade with it through recoil, however, so it has to be careful.</p> ",
    "sets": [
      {
        "name": "Swords Dance",
        "description": "<h1>Set Details</h1> <p>Garchomp is CAP's premier wallbreaker, being able to sweep teams with its great STAB combination, above average Speed, and Swords Dance to boost its already stellar Attack. Scale Shot makes it nearly impossible to revenge kill, especially thanks to its good natural bulk, while also doubling up as a decently strong STAB move. Fire Fang allows Garchomp to break past the few Pokemon that resist its STAB combination, namely Corviknight, Equilibra, and Jumbao, while also being an effective tool to handle Ferrothorn. Stone Edge is an option to immediately dispose of Flying-types such as Mandibuzz and Zapdos. Leftovers provides more longevity, while a Life Orb boosts Garchomp's firepower and lets it blow past Clefable and Equilibra.</p> <p>Garchomp is a very self-sufficient Pokemon, helping its teammates moreso than getting help from them. Regardless, Future Sight support from Slowking or Slowbro is appreciated to prevent physical walls such as Tomohawk and Arghonaut from immediately switching in. Jumbao is another good partner, breaking past physical walls with its strong special attacks and potentially providing Drought for a stronger Fire Fang or Healing Wish support. Stealth Rock setters like Heatran and Tyranitar can take Ice-type moves to cover one of Garchomp's core weaknesses. Heatran also covers the Fairy-type matchup and can use Taunt on walls such as Tomohawk and Zapdos to prevent them from recovering their HP. Because Rillaboom can revenge kill -1 Defense Garchomp, Zapdos and Corviknight are good to resist its Grassy Glide, and they can also provide Defog. In return, Garchomp offensively checks Heatran, which threatens both of them. In hyper offense builds, Volcarona and Cawmodore both form good wallbreaking cores with Garchomp, with Volcarona disposing of Garchomp's checks in Jumbao and Tomohawk while Garchomp breaks through Heatran and Blissey. Cawmodore and Garchomp overwhelm their shared checks through repeated hits.</p> "
      },
      {
        "name": "Defensive Stealth Rock",
        "description": "<h1>Set Details</h1> <p>Defensive Garchomp has a great defensive typing, great natural bulk, and good Speed, allowing it to set up Stealth Rock quite comfortably despite not having reliable recovery. Rough Skin and Rocky Helmet hurt contact-reliant physical attackers such as Zeraora and Rillaboom as well as U-turn and Knock Off users like Tornadus-T. Toxic allows Garchomp to cripple common entry hazard removers such as Tomohawk, Mandibuzz, Zapdos, and Tornadus-T, which are immune to Earthquake, and the bulky Water- and Ground-types that want to switch into it. Endure works extremely well with the poison and contact damage that Garchomp deals. Another option is Rest, which gives Garchomp longevity while also turning it into a pseudo-status absorber against various foes it switches into, such as Heatran and Toxapex. Alternatively, Dragon Tail phazes foes and forces them to take damage from Stealth Rock. Fire-type coverage can be run to hit Steel-types such as Equilibra and Corviknight, which are otherwise immune to Garchomp's moveset and can remove Stealth Rock for free as it switches out. 120 Speed EVs with an Impish nature allow Garchomp to outspeed Adamant Rillaboom, while a Jolly nature allows it to outspeed Jolly Rillaboom, Timid Heatran, and Zapdos.</p> <p>Defensive Garchomp appreciates Knock Off support to get the most mileage out of its Stealth Rock by removing foes' Heavy-Duty Boots and Leftovers. Ferrothorn and Arghonaut both have Knock Off and appreciate Garchomp pressuring Defog users so they can set up their own hazards. Garchomp struggles against Fairy-types, so partners like Heatran, Corviknight, and Scizor are appreciated. Blissey is a great partner that can provide cleric support and sponge the commonly special Ice- and Dragon-type attacks Garchomp fears. In exchange, Garchomp can take on the physical attackers that threaten Blissey and most likely chip them as they make contact with it. Bulky Water-types like Slowking and Arghonaut and Flying-types like Tornadus-T all appreciate Garchomp checking Electric-type pivots such as Zeraora and Zapdos extremely well.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 251944, "username": "spoo"}, {"user_id": 227784, "username": "snake_rattler"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 273339, "username": "Lasen"}]}
  },
  "Weavile": {
    "comments": "<h1>Other Options</h1> <p>A Life Orb can be utilized on hyper offense builds to boost Swords Dance Weavile's damage output to astounding levels, being able to break past typical checks, such as Corviknight, Ferrothorn, and Toxapex, with even the smallest chip damage. However, a weakness to hazards coupled with Life Orb recoil means that it often lacks the longevity that is necessary on more balanced or bulky teams. Wide Lens sets can mitigate the unpredictability of Triple Axel, giving it near-perfect accuracy. Unfortunately, its lack of longevity and boosting power to the crippling level which Life Orb does pose more issues.</p> <h1>Checks and Counters</h1> <p><strong>Fighting-types: Due to its defensive typing, willingness to absorb Knock Off, access to reliable recovery, and its ability in Unaware, Arghonaut is the perfect check to Weavile, being able to easily take any hit it throws out and OHKOing it with Circle Throw or taking the opportunity to set Spikes. Buzzwole is a more offensive check that, if kept healthy, is very valuable versus Weavile. Urshifu-R can take a hit from Weavile and OHKO it back.</p> <p><strong>Bulky Water-types: Tapu Fini's bulk and defensive typing lets it heavily threaten Weavile, with Choice Scarf variants in particular being especially valuable, as they can outspeed and OHKO Weavile while still having ample opportunities to switch in to. However, it must be wary of having its item removed via Knock Off, and its lack of reliable recovery makes it a poor check for the long term. Physically defensive Toxapex, especially one that has had its item removed, is a good check to Weavile, being able to remove its Swords Dance boosts with Haze and pressure it with the threat of a Scald burn. Colbur Berry Slowbro with Body Press is a niche but viable option.</p> <p><strong>Bulky Steel-types: Corviknight, Ferrothorn, and Skarmory all do not outright get KOed by Weavile and are able to OHKO it back with Body Press should they carry it, but they are prone to being chipped down through entry hazards and must be carefully preserved. These Pokemon can also punish Weavile's Triple Axel with either Rocky Helmet or Iron Barbs in the case of Ferrothorn. Heatran can survive any move at +2 but cannot safely switch directly in, (RC) and must rely on the unreliable Magma Storm to force Weavile out. Physically defensive Magnezone can take any hit from +2 Weavile and OHKO back with Body Press, making it a last-ditch check if it's required.</p> <p><strong>Revenge Killers: Weavile's poor bulk allows it to be revenged killed by Pokemon such as Choice Scarf Tapu Lele, Tapu Koko, (AC) and Zeraora, which cannot switch in on it but if given a free switch in can pick off Weavile. The latter two Pokemon need to be wary of taking too much chip damage, however, as Weavile's +2 Ice Shard does sizable damage on its own. Revenankh deserves a special mention, as its Triage Drain Punch outspeeds any attack of Weavile's and easily OHKOes it.</p> ",
    "sets": [
      {
        "name": "Swords Dance",
        "description": "<h1>Set Details</h1> <p>Weavile's stellar offensive typing, exceptional Speed tier, and high-powered STAB moves make it a capable wallbreaker, revenge killer, and late-game cleaner. Very few Pokemon check it for the long term, as they often only need their item removed by Knock Off and minimal chip damage for Weavile to muscle past them. Weavile's biggest shortcoming is the unreliability of Triple Axel, as it has a large chance to do negligible damage, or even none at all. A Jolly nature is preferred to outspeed Tornadus-T, Astrolotl, and Kerfluffle; however, if your team has adequate counterplay to these Pokemon, then an Adamant nature can be utilized to boost Weavile's damage output even further, giving it better chances at +2 to OHKO Clefable with Triple Axel and Dragapult and Choice Scarf Jumbao after Stealth Rock with Ice Shard.</p> <p>Due to Weavile's subpar bulk, it appreciates Pokemon which can pivot into it to allow it opportunities to set up or deal damage, such as Landorus-T and Corviknight. While it can wear down most of its common checks like Buzzwole and Corviknight in the long term, a teammate which can force progress versus these checks such as Tapu Koko or Magnezone is valued. The latter in particular is an excellent teammate for Weavile, as it can trap and eliminate Steel-types Weavile struggles against while providing a slow Volt Switch to give Weavile more opportunities to come in. Pokemon that can provide entry hazard support like Ferrothorn and Heatran are great teammates for Weavile, giving it the ability to soften its checks faster and apply more pressure. At the same time, these Pokemon are able to check potential revenge killers for Weavile.</p> "
      },
      {
        "name": "Choice Band",
        "description": "<h1>Set Details</h1> <p>A Choice Band set provides the advantages of immediate breaking power, being able to do large damage without the need to set up. On the other hand, its inability to change moves and susceptibility to entry hazards give the opponent clear options for counterplay. Triple Axel has the possibility to do devastating damage provided it hits, whereas Icicle Crash is a more reliable option that does not make contact and has a handy flinch chance. Low Kick is useful to hit the likes of Ferrothorn, Heatran, and Melmetal, whereas Poison Jab allows Weavile to easily break past Tapu Fini.</p> <p>Because of its weakness to entry hazards, Choice Band Weavile appreciates hazard control; Pokemon like Corviknight, Zapdos, and Tornadus-T provide hazard removal while also being able to pivot into Weavile, which is normally unable to switch into attacks due to its poor bulk. Partners that can provide Future Sight support like Slowbro, Tapu Lele, and Victini are also greatly appreciated, as they help Weavile break through more consistent checks like Arghonaut and Tapu Fini. Pokemon that can set Spikes like Ferrothorn, Astrolotl, and Arghonaut are valuable to help break through the aforementioned bulky Water-types.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 251944, "username": "spoo"}, {"user_id": 277988, "username": "dex"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}]}], "writtenBy": [{"user_id": 515115, "username": "Earthflax"}]}
  },
  "Magnezone": {
    "comments": "<h1>Other Options</h1> <p>Magnezone can run a more offensive set with Expert Belt to guarantee an OHKO on Corviknight; however, this set fails in checking Weavile, an important task often asked of Magnezone. An Assault Vest alongside Mirror Coat can be run to lure and KO Heatran; however, this has little to no use outside of that matchup. Toxic can be dropped for Magnet Rise alongside using an Air Balloon to trap and KO Equilibra and not give Landorus-T a free switch-in, but both Toxic and Flash Cannon more consistently punish Landorus-T, as Magnezone is still forced out by numerous other offensive threats, and Equilibra can use Rapid Spin on an attempted Magnezone switch to ruin this strategy. A Choice Specs set can be run to do massive damage with Electric Terrain-boosted Rising Voltage; however, this set mandates Tapu Koko as a partner and is very reliant on prediction due to the omnipresence of Electric-immune Pokemon in the tier.</p> <h1>Checks and Counters</h1> <p><strong>Ground-types: Landorus-T, Garchomp, and Colossoil all can come in on Thunderbolt and Flash Cannon and force Magnezone out with Earthquake. The former two do not appreciate getting hit with Toxic, however, and Colossoil fears Body Press. Equilibra can switch into both of Magnezone's STAB moves and Toxic; however, it does take quite a bit of damage from boosted Body Press.</p> <p><strong>Specially Bulky Pokemon: Galarian Slowking completely walls Magnezone and can hit it super effectively with Flamethrower or set up Future Sight on it. Pajantom can freely switch into Magnezone lacking Flash Cannon and force it out with Earthquake. Heatran can switch into Thunderbolt and Toxic quite easily and force Magnezone out with Earth Power; however, it does not appreciate tanking multiple Body Presses. Astrolotl can switch into any of Magnezone's attacks and force it out with Stomping Tantrum, but it does not like getting hit with Toxic.</p> <p><strong>Revenge Killers: Due to Magnezone's low Speed, it is easily revenge killed by a host of threats, including Dragapult, Blacephalon, Dragonite, Volcanion, and Volcarona. These Pokemon don't particularly enjoy switching into Magnezone for fear of getting hit with Toxic or its STAB attacks, however. Pyroak can switch into any of Magnezone's moves and use it to boost with Contrary Overheat; it can even heal off Toxic with Aromatherapy.</p> <p><strong>Shed Shell: Ferrothorn and Corviknight can both run Shed Shell to escape Magnezone's Magnet Pull, rendering its niche null and void. However, other Steel-types like Melmetal cannot afford to run Shed Shell, and this strategy can be thwarted with Knock Off.</p> ",
    "sets": [
      {
        "name": "Iron Defense",
        "description": "<p>Magnezone's main role on any team is to trap and subsequently KO Steel-types, most notably Ferrothorn. The combination of Iron Defense and Body Press does this, allowing Magnezone to quickly set up on and dispatch of Ferrothorn and Melmetal lacking Earthquake. Thunderbolt is used to severely damage Corviknight while pressuring bulky Water-types like Slowbro, Toxapex, and Arghonaut. Toxic is used to punish Landorus-T, Astrolotl, and Garchomp switching in, while Flash Cannon is preferable on more offensive teams to pressure Fairy-types like Clefable and Tapu Lele while still doing decent chip damage to Landorus-T and Garchomp. Leftovers is the preferred item to give Magnezone better longevity and defensive utility throughout the match; however, Rocky Helmet is an option to punish Venomicon-E, Knock Off from Weavile, Double Iron Bash from Melmetal, and U-turn from Corviknight. The given EVs allow Magnezone to outspeed Arghonaut while doing as much damage as possible with Body Press.</p> <p>Weavile is the most notable teammate for Magnezone, as it very much appreciates Ferrothorn being removed from battle. Weavile also enjoys Magnezone forcing damage onto Corviknight and pressuring Tapu Fini with Thunderbolt. Other Pokemon that struggle with Ferrothorn like Tapu Lele, Pajantom, Tapu Fini, Tapu Koko, and Nihilego appreciate Magnezone as a teammate. Due to Tapu Lele's strength, it is particularly good at baiting in Steel-type foes for Magnezone to trap. Magnezone often invites in Landorus-T, so Pokemon like Galarian Zapdos and Urshifu-R that take advantage of this are excellent choices. Landorus-T can bait in Ferrothorn and Corviknight and pivot into Magnezone with U-turn on them; Landorus-T additionally enjoys Magnezone checking Weavile and Venomicon-E. Because Magnezone is often asked to switch into Weavile and Venomicon-E multiple times throughout a match, entry hazard removal from Pokemon like Tornadus-T and Colossoil is appreciated.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 273339, "username": "Lasen"}, {"user_id": 251944, "username": "spoo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}]}], "writtenBy": [{"user_id": 277988, "username": "dex"}]}
  },
  "Heatran": {
    "comments": "<h1>Other Options</h1> <p>Heatran has a variety of other options at its disposal. It can run Heavy Slam on both its offensive and defensive set to more reliably KO certain Fairy-type foes it has trapped, such as Clefable and Tapu Lele. Heavy Slam also more reliably defeats Pokemon like Weavile, Blissey, and Galarian Slowking, but its other options are better in more scenarios. Heatran can also run Protect on its defensive set to scout Choice item users, gain a turn of Leftovers recovery, and rack up status damage, but dropping Toxic means it will be unable to status foes itself. Although more niche, Will-O-Wisp cripples Landorus-T and Garchomp on the switch. Flame Body over Flash Fire invalidates Jumbao as a counter, as it relies on Trace, while also potentially punishing U-turn users in Dragapult, Tapu Koko, and Corviknight, but dropping Flash Fire means that Heatran cannot reliably check Volcarona.</p> <h1>Checks and Counters</h1> <p><strong>Specially Bulky Pokemon: Specially bulky Pokemon such as Venomicon and Galarian Slowking can switch into Heatran while taking minimal damage and proceed to threaten it with Earth Power and Earthquake, respectively. Venomicon can be easily chipped, however, while Galarian Slowking's Earthquake is only strong enough to 2HKO Heatran. Jumbao uses Trace and its Ground resistance to wall Flash Fire Heatran, but rare Flame Body sets heavily damage it with Fire-type moves, and Toxic cripples it.</p> <p><strong>Ground-types: Landorus-T, Garchomp, and Hippowdon can all come in on Heatran and threaten to OHKO it with Earthquake, thereby immediately forcing it out. The latter is especially notable for having reliable recovery in Slack Off. However, none of these Pokemon appreciate getting hit with Toxic. Colossoil deserves special mention here for receiving a power boost if hit with Toxic on the switch, thanks to Guts.</p> <p><strong>Bulky Water-types: Arghonaut, Slowbro, Tapu Fini, Swampert, and Shed Shell Toxapex can all easily switch into Heatran and damage it with super effective moves. The former two dislike being poisoned and have to be careful of getting worn down too quickly, though. While Gastrodon is more niche, it deserves special mention here for having access to Recover and immediately forcing Heatran out with Earthquake.</p> <p><strong>Bulky Dragon-types: Dragonite and Pajantom are both amazing answers to Heatran. The former takes little to nothing from Magma Storm, is immune to Earth Power, can heal off Toxic with Heal Bell, and has Roost to recover any lost HP. The latter is immune to Toxic thanks to Comatose and threatens an OHKO on Heatran with Earthquake. Astrolotl can switch into non-Air Balloon Heatran and threaten it with Stomping Tantrum.</p> <p><strong>Offensive Fighting-types: Galarian Zapdos and Urshifu-R cannot consistently switch into Heatran, but they force it out with strong, super effective STAB moves.</p> ",
    "sets": [
      {
        "name": "Specially Defensive",
        "description": "<p>With its combination of great natural bulk, uncontested utility options, and a useful ability in Flash Fire, Heatran cements itself as an exemplary stallbreaker and blanket check of the CAP metagame. Courtesy of its high Special Defense, Heatran is able to check prominent special attackers such as Dragapult, Zapdos, and Tapu Lele; furthermore, due to its typing and ability, it completely walls Pokemon like Clefable and Volcarona. Magma Storm allows Heatran to trap and chip bulky Water-types such as Slowbro and Toxapex, as well as specially defensive titans like Blissey and Galarian Slowking. Taunt prevents these walls from recovering their health or, in Slowbro and Blissey's cases, from using Teleport, ensuring that Heatran effectively wears them down over time and eventually KOs them. Earth Power super-effectively damages opposing Heatran, as well as Astrolotl and Krilowatt, relatively common switch-ins to it. Toxic and Stealth Rock are interchangeable in the last moveslot, though the former is usually preferred to wear down particularly sturdy answers to Heatran in Gastrodon and Swampert. However, Heatran is still an effective Stealth Rock setter, forcing out a common Defogger in Corviknight.</p> <p>Heatran relies on Leftovers for recovery; therefore, Knock Off absorbers like Clefable and Corviknight make for excellent teammates. The latter is especially notable for switching in on common Ground-types like Landorus-T and Hippowdon with impunity. Landorus-T itself is also an effective Heatran partner, switching into Garchomp and freeing it up to run Toxic. It is essential to pair Heatran with defensive Water-types such as Toxapex and Slowbro, as they wall Galarian Zapdos, Venomicon-E, and Urshifu-R, which easily OHKO Heatran. Toxapex in particular also matches up very well against Buzzwole. Additionally, offensive Grass-types like Jumbao and Rillaboom make for amazing partners; Jumbao and Heatran each resist every type the other is weak to, while Rillaboom's Grassy Terrain not only significantly weakens Earthquake, but also provides Heatran with an additional source of much-needed recovery. Weavile comes in on and immediately threatens the aforementioned Ground-type checks, as well as Dragon-types that Heatran struggles against such as Dragonite and Pajantom. Lastly, Dragapult and Blacephalon greatly appreciate Heatran chipping Landorus-T and Colossoil.</p> "
      },
      {
        "name": "Balloon Frog",
        "description": "<p>With this set, Heatran sacrifices its bulk to heavily damage some of its typical switch-ins, scoring a 2HKO on specially defensive Landorus-T with Eruption when at full health, and nearly on uninvested Slowbro too. Air Balloon dissuades Landorus-T from switching into Heatran even more, as well as shutting down Astrolotl and opposing Heatran while intact. While Leftovers could also be run, Air Balloon is almost always superior here for its exclusive ability to practically invalidate checks and enable more offensive progress than usual. Magma Storm lets Heatran trap and chip its switch-ins, in addition to providing a strong attack even when Heatran is at low HP, which drastically reduces Eruption's power. Earth Power helps wear down switch-ins like Tapu Fini, Toxapex, and Garchomp more quickly and provides coverage against opposing Fire-types. A Timid nature can be considered for outspeeding Adamant Swords Dance Rillaboom, but it is generally useless outside of this benchmark.</p> <p>Heatran loses out on added bulk when running this set; as a result, it becomes more vulnerable to special attackers like Dragapult and Tapu Koko. Therefore, Equilibra and Landorus-T make for great partners, walling the latter and matching up well into the former, especially if they choose to run more Special Defense investment. A Bulky Water-type, especially physically defensive Toxapex or standard Slowbro, makes for an invaluable, mandatory Heatran teammate, effectively checking massive threats to it in Galarian Zapdos and Urshifu-R. Offensive Electric- and Grass-types like Tapu Koko, Zeraora, Kartana, and Rillaboom switch into and force out Pokemon Heatran struggles against, such as Toxapex, Tapu Fini, and Slowking. It is also a good idea to pair Heatran with Dragapult or Blacephalon, as they form a potent special wallbreaking core together, greatly pressuring their shared checks in Toxapex and Tapu Fini. Choice Specs Blacephalon in particular can swiftly dispose of certain bulky Water-types that Heatran cannot, especially Arghonaut and Slowbro. Lastly, a defensive Grass-type in Ferrothorn provides extra security against Water-types in general.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 277988, "username": "dex"}, {"user_id": 273339, "username": "Lasen"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 533447, "username": "CallMeDrippyT"}]}
  },
  "Ferrothorn": {
    "comments": "<h1>Other Options</h1> <p>Thunder Wave can cripple fast foes such as Tornadus-T and Dragapult, but Ferrothorn's other options are better in more scenarios. Gyro Ball with a Relaxed nature lets Ferrothorn beat Venomicon-E and Tornadus-T in most scenarios, but it provides worse offensive coverage than Power Whip. Protect can be used to scout a foe's move and get extra Leech Seed recovery, but it makes Ferrothorn too passive. Rocky Helmet is an option over Leftovers to double down on the chip against contact moves, but the passive recovery Leftovers provides is usually better. Chople Berry is an option on rain teams to cover Ferrothorn's Fighting weakness.</p> <h1>Checks and Counters</h1> <p><strong>Fire-type Attacks: Fire-types such as Heatran, Blacephalon, Volcanion, Astrolotl, and Volcarona threaten to OHKO Ferrothorn with their STAB moves, but none of them appreciate switching into Knock Off. Fire-type coverage on Dragapult, Clefable, Tornadus-T, and Venomicon can also threaten to KO Ferrothorn, so it must be careful when switching into them.</p> <p><strong>Fighting-type Attacks: Choice Band Urshifu-R, Galarian Zapdos, and Buzzwole can pressure Ferrothorn, but the former two can't switch in safely for fear of Knock Off or, in Urshifu-R's case, Power Whip. Tapu Lele, Kartana, and Melmetal can all carry Fighting-type coverage to catch Ferrothorn and 2HKO it.</p> <p>*<strong>Strong Wallbreakers: Swords Dance Garchomp and Nasty Plot Galarian Moltres can set up on Ferrothorn to pressure it. Ferrothorn is also susceptible to being overwhelmed by the Pokemon its supposed to check such as Choice Band Weavile and Venomicon-E, especially so if it loses its Leftovers.</p> ",
    "sets": [
      {
        "name": "Utility",
        "description": "<h1>Set Details</h1> <p>Ferrothorn is invaluable support with a great defensive typing and strong support movepool, making it a staple in the metagame. Stealth Rock can be run instead of Spikes on teams that can't fit it elsewhere, but its broader distribution makes Ferrothorn running Spikes preferred. Body Press takes advantage of this set investing in Defense and hits Magnezone on the switch, threatens Equilibra and Kartana, and helps against opposing Ferrothorn. Gyro Ball allows Ferrothorn to hit Tornadus-T and Venomicon-E. Knock Off is an option to pressure entry hazard removers such as Zapdos, Tornadus-T, and Astrolotl by removing their Heavy-Duty Boots. They all are common switch-ins to Ferrothorn, though, as they carry Fire-type coverage. Power Whip is a powerful STAB option that helps Ferrothorn beat Water-types such as Urshifu-R and Arghonaut and Ground-types like Swords Dance Landorus-T and Garchomp. A Relaxed nature with 0 Speed IVs should be run alongside Gyro Ball, while Impish is preferred if Knock Off or Power Whip is run.</p> <p>Ferrothorn is quite an effective glue for bulky offense and balance teams, checking common threats such as Weavile, Melmetal, Tapu Koko, and Tapu Lele. Wallbreakers such as Swords Dance Garchomp, both Venomicon formes, and Dragonite all appreciate Spikes support from Ferrothorn as well as it checking their revenge killers in Weavile and Tapu Lele. Stealth Rock setters such as Garchomp and Heatran help stack passive damage on foes, and both can take Fire-type attacks thrown Ferrothorn's way. Tapu Fini is an excellent partner, checking Fire-types like Heatran and Astrolotl as well as Choice Band Urshifu-R and forcing all of them out. Offensive Zapdos can pressure Defoggers such as Corviknight and Tornadus-T and help Ferrothorn against Fighting-types such as Galarian Zapdos, Urshifu-R, and Revenankh, while Ferrothorn alleviates some pressure off of Zapdos by being a decent Knock Off absorber and check to offensive Ice-types.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 277988, "username": "dex"}, {"user_id": 336073, "username": "Rabia"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}]}], "writtenBy": [{"user_id": 273339, "username": "Lasen"}]}
  },
  "Tornadus-Therian": {
    "comments": "<h1>Other Options</h1> <p>Tornadus-T can run Toxic on its utility pivot set to cripple Pokemon like Zapdos and Astrolotl; however, it is usually not worth dropping any of the other utility options on the set for it, and Knock Off already punishes these Pokemon for switching in. Tornadus-T is capable of running a Nasty Plot sweeper set with Hurricane + Heat Wave and one of Weather Ball or Focus Blast, depending on if it is on a weather team or not. Sludge Bomb is an option to hit Fairy-types like Jumbao and Tapu Fini more consistently and potentially poison Zapdos switching in; however, it is generally useless outside of these matchups and results in awkward four-move coverage.</p> <h1>Checks and Counters</h1> <p><strong>Electric-types: Zeraora, Arctozolt under hail, Tapu Koko, and Zapdos all threaten Tornadus-T with their super effective Electric-type STAB moves. None of these Pokemon appreciate switching into Knock Off, however. Rotom-W can switch into any of Tornadus-T's moves with ease and threaten it with status and a slow Volt Switch.</p> <p><strong>Knock Off: Tornadus-T relies on its items to make full use of Regenerator. Pokemon like Landorus-T, Kartana, Ferrothorn, and Tapu Fini can bait Tornadus-T in and remove its item with Knock Off.</p> <p><strong>Rock-type Coverage: Landorus-T and Garchomp can sometimes carry Stone Edge, which threatens to KO Tornadus-T.</p> <p><strong>Faster Offensive Threats: Weavile outspeeds Tornadus-T and threatens it with Triple Axel. Dragapult, Choice Scarf Kartana, and Choice Scarf Tapu Lele can all overwhelm or revenge kill Tornadus-T depending on its set. None of them can directly switch into Tornadus-T, however, due to their low bulk.</p> <p><strong>Specially Bulky Pokemon: Clefable, Blissey, and Toxapex can outlast Tornadus-T and threaten it with status. Specially defensive Heatran can easily switch into Hurricane and Heat Wave and threaten Tornadus-T with Toxic; however, it despises losing its Leftovers to Knock Off.</p> ",
    "sets": [
      {
        "name": "Utility Pivot",
        "description": "<p>Tornadus-T has access to a ridiculous number of utility options that make it a premier utility choice on many balance and bulky offense teams. Knock Off cripples common Tornadus-T switch-ins like Tapu Koko, Zapdos, and Galarian Slowking. U-turn allows Tornadus-T to recover with Regenerator while generating momentum. Heat Wave hits Steel-types like Ferrothorn, Melmetal, Cawmodore, and Corviknight super effectively. Taunt prevents Pokemon like Landorus-T and Heatran from using Toxic and Stealth Rock while also letting Tornadus-T beat walls like Corviknight, Toxapex, and Clefable that rely on recovery moves. Tornadus-T is an apt Defogger, as it is quite easy to get onto the field while retaining momentum due to Regenerator and U-turn.</p> <p>Many teams enjoy the utility and pivoting that Tornadus-T provides. Wallbreakers like Dragapult, Melmetal, Blacephalon, and Venomicon-E appreciate Tornadus-T pivoting them in safely with U-turn and removing entry hazards with Defog. Electric-types like Zapdos and Tapu Koko force Tornadus-T out, so Pokemon like Landorus-T and Equilibra are excellent choices for teammates. Equilibra and Colossoil provide Rapid Spin support, effectively allowing Tornadus-T to run Taunt over Defog. Other Regenerator users like Toxapex, Slowbro, and Astrolotl make for great defensive cores that sport excellent longevity. Both Toxapex and Astrolotl appreciate Tornadus-T's ability to switch into Ground-type attacks from Colossoil and Garchomp. Toxapex additionally absorbs Knock Off and Toxic from Pokemon like Clefable and Landorus-T. Other defensive pivots like Landorus-T pair well with Tornadus-T, as together they can safely switch into and pivot out on most of the tier's offensive threats.</p> "
      },
      {
        "name": "Assault Vest",
        "description": "<p>Assault Vest Tornadus-T leverages its access to U-turn and Regenerator and its high Speed to become an incredibly safe switch-in to strong special attackers like Dragapult and Tapu Lele. Heat Wave is used to hit Steel-types like Ferrothorn, Melmetal, and Cawmodore super effectively. Knock Off punishes common Tornadus-T switch-ins like Tapu Koko, Heatran, and Landorus-T and hits Dragapult super effectively. The given EV spread allows Tornadus-T to survive two Choice Specs Dragapult Draco Meteors after Stealth Rock while outspeeding Cawmodore. If the team already has a Cawmodore check, a spread of 252 HP / 88 SpD / 168 Spe can be run, which still outspeeds Kartana and Adamant Weavile.</p> <p>Assault Vest Tornadus-T is an excellent glue for most balance teams due to its ability to provide pivoting and Knock Off support. Entry hazard removal from Astrolotl, Landorus-T, or Colossoil is a must for any team with Assault Vest Tornadus-T. Astrolotl deserves special mention for forming a solid defensive Regenerator core with Tornadus-T, capable of effectively scouting most Choice item users. Offensive Pokemon like Dragapult, Tapu Lele, and Melmetal appreciate Tornadus-T's ability to pivot them in safely with U-turn. In return, they threaten the offensive Pokemon that are capable of overwhelming Tornadus-T like Venomicon-E, Weavile, and Calm Mind Tapu Koko. Because Tornadus-T struggles to check Dragapult and Tapu Lele by itself, pairing it with a Dark-type like Weavile or Colossoil is a good idea. Tornadus-T relies heavily on its Assault Vest to answer special wallbreakers; thus, Knock Off absorbers like Clefable, Arghonaut, and Toxapex are valuable teammates.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 273339, "username": "Lasen"}, {"user_id": 251944, "username": "spoo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}]}], "writtenBy": [{"user_id": 277988, "username": "dex"}]}
  },
  "Landorus-Therian": {
    "comments": "<h1>Other Options</h1> <p>A Swords Dance sweeper set is an offensive option Landorus-T can run, but it struggles to break through common defensive walls like Corviknight and Slowbro before it gets KOed. Landorus-T can use a Choice Scarf to score surprise KOs on foes and act as a strong, fast pivot; however, it struggles from a lack of immediate power outside of Earthquake. It can also use a Substitute + Bulk Up set alongside Smack Down to dispatch of traditional Landorus-T switch-ins like Corviknight and Skarmory, but this set generally requires too much setup to be worth using. The defensive pivot set can opt to invest in Defense to better check Pokemon like Garchomp and Venomicon-E; however, Corviknight generally does this job better, as it is not forced out by Weavile and Urshifu-R. Imprison is an option on the defensive pivot set to prevent foes from setting Stealth Rock, freeing up teammates to run items outside of Heavy-Duty Boots, but giving up a moveslot for it is generally not worth the loss in utility.</p> <h1>Checks and Counters</h1> <p><strong>Water-types: Water-types such Tapu-Fini and Urshifu-R both force Landorus-T out with super effective Water-type attacks. Tapu Fini is immune to Landorus-T's Toxic thanks to Misty Terrain, and Urshifu-R ignores Intimidate thanks to Surging Strikes. Slowbro and Arghonaut can easily tank whatever Landorus-T throws at them; however, they dislike Toxic.</p> <p><strong>Defensive Flying-types: Defensive Flying-types such as Corviknight, Venomicon, Zapdos, Tornadus-T, and the niche Tomohawk can all come in on Earthquake and force Landorus-T to switch. Corviknight and Venomicon in particular are notable for their immunity to Toxic, though Venomicon is annoyed by Knock Off. Venomicon-E performs similarly and doesn't mind Knock Off, but is much more frail. Tomohawk, Zapdos, and Tornadus-T, meanwhile, discourage Landorus-T from using U-turn due to Rocky Helmet, Static, and Knock Off, respectively. However, Zapdos and Tornadus-T do not appreciate coming in on Toxic or Knock Off, and Toxic especially neuters Tomohawk.</p> <p><strong>Chip Damage: Toxic users such as opposing Landorus-T, Heatran, Zeraora, and Colossoil can inflict Toxic on Landorus-T, neutering its ability to act as a pivot in longer games. The latter two can also remove Landorus-T's Leftovers with Knock Off and hurt its longevity, especially if Stealth Rock is on the field.</p> <p><strong>Ice-types and Ice-type Coverage: Weavile, Arctozolt, and Syclant outspeed Landorus-T and easily OHKO with their super effective Ice-type STAB moves. Weavile in particular can break through Landorus-T's Focus Sash with Triple Axel. Other Pokemon such as Krilowatt carry Ice Beam, which OHKOes Landorus-T after Stealth Rock.</p> <p><strong>Cawmodore: Cawmodore can easily use Landorus-T to set up with Belly Drum and sweep.</p> ",
    "sets": [
      {
        "name": "Defensive Pivot",
        "description": "<h1>Set Details</h1> <p>Landorus-T makes a triumphant return to the CAP metagame as a premier defensive pivot. It is stellar at entry hazard control and can run either Stealth Rock or Defog depending on the needs of the team. Defog is generally preferred as Stealth Rock is easier to fit on different teammates, but it is a totally viable Stealth Rock user in its own right as it threatens Tornadus-T with Toxic or Knock Off and beats any Astrolotl lacking Will-O-Wisp. The last moveslot is generally taken up by Toxic, which punishes Flying-types outside of Corviknight, Venomicon, and Venomicon-E from coming in on Landorus-T, cripples defensive pivots like Arghonaut, Slowbro, Buzzwole, and opposing Landorus-T, and threatens setup sweepers like Revenankh, Garchomp, and Volcarona; still, Knock Off is an option for removing Heavy-Duty Boots or Leftovers from the aforementioned defensive Pokemon while also hitting Dragapult super effectively. Stone Edge is a final option to punish Venomicon-E from switching in, also offering more immediate pressure than Toxic against other Flying-types. The given EV spread maximises special bulk to enable Landorus-T to switch into special attacks from Pokemon like Heatran and Tapu Koko more frequently. Slower spreads can also be run in order to give Landorus-T as slow of a U-turn as possible.</p> <p>Many Pokemon enjoy Landorus-T's ability to pivot and sponge damage. Corviknight is a notable partner, as it forms a sturdy defensive pivot core with Landorus-T and appreciates its ability to check Tapu Koko. In return, Corviknight can switch into Pokemon attempting to Toxic Landorus-T and it can come in on Weavile and force it out with Body Press. Pokemon such as Tapu Koko and Kartana that like being brought in via a slow U-turn make for good offensive partners to Landorus-T. Both matchup well into Water-types that threaten Landorus-T. Heatran complements Landorus-T well as a specially-defensive partner that can act as a soft Weavile check or as a powerful wallbreaker that enjoys Landorus-T's U-turn with its Air Balloon set, also forming a strong hazard core with its ability to set Stealth Rock. In return, Landorus-T can check Pokemon that bother it such as Garchomp and Encore Astrolotl.</p> "
      },
      {
        "name": "Suicide Lead",
        "description": "<h1>Set Details</h1> <p>Landorus-T can act as an effective suicide lead, using Stealth Rock + Explosion to keep Stealth Rock on the field in the face of entry hazard removers. Swords Dance is used to punish the opponent for not immediately dealing with Landorus-T, as its monstrous Attack stat enables it to KO most Pokemon at +2. Explosion is used as a way to preserve momentum.</p> <p>Suicide lead Landorus-T should be used exclusively on hyper offense teams. As such, a dual screens setter such as Tapu Koko or Regieleki is helpful, as both can keep Landorus-T's Stealth Rock on the field with Taunt or Explosion, respectively. Most setup sweepers enjoy Landorus-T dealing heavy damage after it sets Stealth Rock. Cawmodore deserves a special mention as a powerful sweeper that needs Stealth Rock on the field to secure an OHKO on Dragapult with Bullet Punch. Other sweepers such as Rillaboom and Hawlucha appreciate Landorus-T potentially baiting Corviknight into tanking an Explosion. Galarian Moltres and Dragonite appreciate the momentum Landorus-T gains with Explosion by providing them with a free switch-in.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 273339, "username": "Lasen"}, {"user_id": 336073, "username": "Rabia"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}]}], "writtenBy": [{"user_id": 277988, "username": "dex"}]}
  },
  "Toxapex": {
    "comments": "<h1>Other Options</h1> <p>Poison Jab can be run in place of either Scald or Knock Off to deal with Calm Mind Tapu Fini; if used over Scald, Toxapex can run an Impish nature as well. Shed Shell lets Toxapex switch into Heatran and Whirlpool Tapu Fini much more comfortably. Toxic Spikes over Scald pressures grounded Pokemon that don't run Heavy-Duty Boots, like Dragapult, Tapu Fini, and Tapu Lele. Baneful Bunker can be used over Knock Off to catch physical attackers like Weavile and U-turn users such as Dragapult by surprise, though it is often inconsistent and loses out on Knock Off's great general utility. Finally, the combination of Block + Spite can be used over Scald + Haze to trap and PP stall foes like Clefable and opposing Toxapex to enable Toxapex's own teammates; however, this set forgoes much of Toxapex's general utility and is inconsistent and niche.</p> <h1>Checks and Counters</h1> <p><strong>Electric-types: Electric-types like Zeraora, Tapu Koko, Zapdos, Rotom-W, Krilowatt, Magnezone, and Arctozolt are some of the most common and effective methods of threatening Toxapex. However, Zeraora and Arctozolt despise being burned, and most of these Pokemon don't enjoy losing their item to Knock Off and aren't safe switch-ins.</p> <p><strong>Ground-types: Landorus-T, Garchomp, Colossoil, and Equilibra threaten Toxapex. However, none of them are safe switch-ins, as Toxapex can survive any one hit from them and threaten back with Scald or Knock Off; Landorus-T and Garchomp especially despite this interaction.</p> <p><strong>Strong Wallbreakers: Pokemon like Tapu Lele, Nidoking, and Air Balloon Heatran can immediately force Toxapex out, but these three cannot safely switch in, fearing losing their item or accruing undesirable chip damage. Venomicon can switch in on Toxapex and set up on it, though Venomicon may lose its Heavy-Duty Boots in the process. Swords Dance Kartana is one of the few physical attackers capable of threatening Toxapex, as +2 Leaf Blade has a chance to OHKO; however, it can never directly switch in and must set up first.</p> <p><strong>Taunt: Taunt users like Calm Mind Tapu Fini, Cosmic Power Mew, Taunt + Magma Storm Heatran, and certain Tornadus-T variants are highly effective options at dealing with Toxapex; Taunt prevents Toxapex from using Recover and removing boosts from the former two with Haze.</p> <p><strong>Future Sight: Future Sight users like Slowbro, Slowking, Galarian Slowking, and occasionally Tapu Lele enable teammates normally walled by Toxapex such as Urshifu-R and Weavile to break past it. The former two Pokemon also do not particularly mind losing their item or being burned, making them decent switch-ins.</p> ",
    "sets": [
      {
        "name": "The Pex",
        "description": "<p>Toxapex is the premier defensive Water-type in the metagame. Its massive physical bulk allows Toxapex to switch into some of the tier's most threatening physical attackers such as Urshifu-R, Venomicon-E, Weavile, and Melmetal and force them out with the threat of burn from Scald and Knock Off. Beyond checking strong wallbreakers, Scald and Knock Off also allow Toxapex to not be passive and make important progress over the course of a game. Haze is necessary to check prominent setup sweepers like Weavile, Dragonite, Volcarona, and Galarian Moltres. A set with maximum Defense and Rocky Helmet is best for punishing physical attackers such as the aforementioned Weavile, Venomicon-E, and Urshifu-R; however, Black Sludge can also be run for valuable passive recovery. An EV spread of 252 HP / 124 Def / 132 SpD with a Sassy nature prevents Toxapex from being 2HKOed by Weavile's Knock Off, as well as helping it against special attackers like Dragapult by letting it survive two Shadow Balls after Stealth Rock and two Draco Meteors without entry hazards.</p> <p>Toxapex is most commonly ran on balance and certain bulky offense teams. Landorus-T is a great teammate that forms a sturdy defensive backbone with Toxapex, checking Electric-types such as Zeraora; in return, it appreciates Toxapex's good matchup against Water-types and Ice-types. Bulky Steel-types like Ferrothorn and Heatran are strong partners, checking Psychic-types like Tapu Lele while benefiting from Toxapex dealing with Fire-types. Clefable forms a defensive core with Toxapex that is highly difficult to wear down with status, hazards, or other residual damage. Pokemon with Regenerator like Astrolotl and Tornadus-T are potent teammates that are useful for scouting opposing attackers. Kartana, especially its Choice Scarf set, is a good partner; Toxapex can often remove Heavy-Duty Boots from Kartana's Flying-type checks like Tornadus-T and Zapdos and benefit from its ability to threaten checks like Tapu Lele and Arctozolt. Finally, many offensive Pokemon such Garchomp and Venomicon-E appreciate Toxapex's ability to check Weavile, while Dragapult, Dragonite, and other Dragon-types benefit from Toxapex's good matchup into Fairy-types.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 277988, "username": "dex"}, {"user_id": 273339, "username": "Lasen"}]}, {"name": "Grammar checked by", "members": [{"user_id": 449990, "username": "DC"}]}], "writtenBy": [{"user_id": 251944, "username": "spoo"}]}
  },
  "Tapu Koko": {
    "comments": "<h1>Other Options</h1> <p>Tapu Koko is capable of running Choice Specs alongside Volt Switch in order to deal respectable damage while pivoting. This does, however, cause it to get chipped very quickly by entry hazards, and not being able to pivot on Ground-types is generally not worth the extra power. Toxic is an option on the pivot set to cripple defensive Ground-types, but it is generally not worth giving up Dazzling Gleam for. Grass Knot is another option on the pivot set to hit Hippowdon and Swampert super effectively, but it does not OHKO either.</p> <h1>Checks and Counters</h1> <p><strong>Ground-types: Equilibra, Landorus-T, Hippowdon, Excadrill, and Swampert can all come in on any of Tapu Koko's STAB moves and KO it.</p> <p><strong>Choice Scarf Users: Choice Scarf users like Jumbao, Tapu Lele, and Crucibelle all can revenge kill Tapu Koko. Crucibelle deserves special mention for being able to situationally switch into Tapu Koko and heal off the damage it takes with Regenerator.</p> <p><strong>Bulky Grass-types: Bulky Grass-types such as Ferrothorn, Tapu Bulu, and Amoonguss can freely switch into Tapu Koko. Ferrothorn is notable for resisting both of Tapu Koko's STAB moves and damaging it with Iron Barbs if it tries to pivot out with U-turn. It should be noted that Amoonguss cannot use Spore if it switches in, as Electric Terrain makes the move fail on grounded foes.</p> <p><strong>Specially Bulky Pokemon: Blissey and Galarian Slowking can easily switch into Tapu Koko and force it out with Toxic or Sludge Bomb, respectively.</p> <p><strong>Cawmodore: Cawmodore can use Tapu Koko as setup fodder.</p> ",
    "sets": [
      {
        "name": "Pivot",
        "description": "<h1>Set Details</h1> <p>Tapu Koko utilizes its high Speed and access to U-turn to act as a strong offensive pivot. Its Electric Terrain-backed Thunderbolt can quickly wear down opposing teams. Heavy-Duty Boots is the best item choice due to it keeping Tapu Koko healthy in the face of entry hazards, allowing it to come in more frequently and pivot. Its access to Roost, which lets it consistently check Arghonaut and Tornadus-T, as well as its ability to pivot on Ground-types with U-turn both set it apart from Zeraora as an offensive Electric-type.</p> <p>Tapu Koko is best used on teams that appreciate its ability to keep momentum against Corviknight and Arghonaut. Strong wallbreakers like Kyurem, Dragapult, and Kartana all appreciate being brought in by Tapu Koko. Heatran is a great teammate for its ability to trap Galarian Slowking as well as bait in Ground-types and inflict Toxic on them. Jumbao appreciates Tapu Koko being able to pressure Corviknight and in return threatens Ground-types with Leaf Storm. Landorus-T and Corviknight are good options as consistent switch-ins to Ground-types. Galarian Slowking itself can be a good teammate, as Tapu Koko can take advantage of Future Sight against teams relying on Corviknight as their Psychic resistance. Entry hazard support from Arghonaut, Astrolotl, Ferrothorn, and Skarmory is valuable for chipping Galarian Slowking, making it less consistent as a counter.</p> "
      },
      {
        "name": "Calm Mind",
        "description": "<h1>Set Details</h1> <p>Calm Mind turns Tapu Koko into a strong late-game wincon due to its blazing Speed. The Special Defense boosts given by Calm Mind allow Tapu Koko to be less bothered by faster Pokemon like Choice Scarf Jumbao and Dragapult. Heavy-Duty Boots is the preferred item to ensure that Tapu Koko is fully healthy when it gets sent out to attempt its sweep. Leftovers is an option to increase Tapu Koko's longevity and allow it to more easily boost through Galarian Slowking's poison from Sludge Bomb, though Leftovers should be paired with consistent entry hazard removal. Magnet is another option to OHKO specially defensive Toxapex at +1 in Electric Terrain; however, the lack of longevity when using Magnet is noticeable.</p> <p>Heavy Slam Heatran is a notable partner for Calm Mind Tapu Koko in that it can trap and KO Galarian Slowking. Tapu Koko also enjoys having Pokemon like Corviknight, Landorus-T, and Tornadus-T as teammates, as they can help mitigate Tapu Koko's inability to break through Ground-types. Strong wallbreakers like Urshifu-R and Dragapult are good choices for teammates, as they can weaken the enemy team to the point where Tapu Koko can sweep. Tapu Koko appreciates Spikes support from Arghonaut or Astrolotl for chipping Hippowdon and Galarian Slowking into range of its boosted attacks.</p> "
      },
      {"name": "Dual Screens", "description": "<h1>Set Details</h1> <p>Tapu Koko is a great addition to hyper offense teams as a dual screens setter. U-turn is used to pivot out to a sweeper once screens are up. Taunt is run in order to disallow Defoggers like Tornadus-T and Corviknight from removing screens.</p> <p>Hawlucha is hands down the best teammate for Tapu Koko, as it utilizes Tapu Koko's Electric Terrain to activate Unburden and sweep with boosted Acrobatics. Other setup sweepers like Galarian Moltres, Cawmodore, Volcarona, and Bulk Up Zeraora appreciate Tapu Koko's dual screens support. Zeraora in particular enjoys Electric Terrain temporarily boosting Plasma Fists. Tapu Koko should be paired with a dedicated entry hazard lead like Landorus-T or Mew, since Taunt allows it to keep hazards up in the face of Defoggers.</p> "}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 273339, "username": "Lasen"}, {"user_id": 251944, "username": "spoo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}]}], "writtenBy": [{"user_id": 277988, "username": "dex"}]}
  },
  "Tapu Lele": {
    "comments": "<h1>Other Options</h1> <p>Future Sight is an option on Choice Scarf Tapu Lele over Psychic to support teammates if the opponent has a consistent Tapu Lele switch-in; however, locking into the move is highly punishable. Aromatherapy can be run instead of Psychic to support Tapu Lele's teammates, but it is similarly easy to punish. A Calm Mind set with Leftovers or Life Orb featuring Psyshock, Moonblast, and Thunderbolt can be run to sweep unsuspecting opponents; however, though it is a powerful option, it can be hard to justify over the immediate strength Choice Scarf and Choice Specs provide.</p> <h1>Checks and Counters</h1> <p><strong>Bulky Steel-types</strong>: Heatran, Ferrothorn, Equilibra, and Corviknight can switch into Tapu Lele's Fairy- and Psychic-type moves and force it out. All must be wary of Tapu Lele's coverage options, however, and all but the latter can be worn down over time. Melmetal can switch into Tapu Lele once or twice depending on what set it is running, but it, more than the others, is very easily chipped.</p> <p><strong>Specially Bulky Pokemon: Slowking, Blissey, Assault Vest Tornadus-T, and Galarian Slowking can switch into Tapu Lele consistently and punish it with a myriad of options. All but Slowking are threatened by Psyshock, however.</p> <p><strong>Revenge Killers: Weavile, Venomicon-E, Kartana, Blacephalon, Pajantom, Urshifu-R, and Dragapult can revenge kill Tapu Lele's Choice Specs set. Weavile can further pressure the Choice Scarf set if Tapu Lele locks into a Psychic-type move, while Venomicon-E can do the same if it locks into Moonblast. Furthermore, Kartana and Blacephalon can run a Choice Scarf to always force Tapu Lele out.</p> ",
    "sets": [
      {
        "name": "Choice Scarf",
        "description": "<p>Choice Scarf Tapu Lele is an absolute offensive demon, capable of sweeping unprepared teams with its powerful STAB moves while doing quite a bit of damage throughout a match. Psyshock nails specially bulky Pokemon like Assault Vest Tornadus-T, Galarian Slowking, and Blissey. Focus Blast provides important coverage for Steel-types like Ferrothorn and Heatran. A Modest nature is preferred over Timid to do as much damage as possible; however, a Timid nature can be run to outpace +2 Necturna, +2 Galarian Moltres, Arctozolt under hail, and +1 Colossoil and at worst Speed tie opposing Tapu Lele.</p> <p>Offensive pivots like Dragapult, Urshifu-R, and Victini are great teammates, as they can safely pivot Tapu Lele in with U-turn while appreciating the holes it punches in opposing walls. They also all pressure the bulky Steel-types Tapu Lele struggles with, letting it more freely fire off its powerful Psychic-type STAB moves. Victini additionally enjoys Tapu Lele's Psychic Surge powering up Expanding Force. On a similar note, defensive pivots like Slowbro, Tornadus-T, and Landorus-T can safely get Tapu Lele in to start wallbreaking or sweeping. Entry hazard support from Astrolotl, Ferrothorn, Heatran, and Garchomp helps Tapu Lele break through bulky foes like Heatran and Galarian Slowking. Astrolotl and Garchomp notably can switch into Heatran, while Ferrothorn can take care of Weavile seeking to revenge kill Tapu Lele. Corviknight and Colossoil can remove opposing entry hazards, which hurt Tapu Lele's longevity. Corviknight is a particularly notable teammate, as it can pivot Tapu Lele in with U-turn on both Venomicon formes.</p> "
      },
      {
        "name": "Choice Specs",
        "description": "<p>When equipped with Choice Specs, Tapu Lele becomes an incredibly threatening juggernaut that is capable of heavily denting, if not outright OHKOing, most foes. Psyshock is useful for pressuring Blissey and Galarian Slowking; however, it can be dropped for Thunder to hit Corviknight and Slowking harder. Focus Blast is required coverage for hitting Steel-types like Ferrothorn and Heatran. A Modest nature lets Tapu Lele hit as hard as possible; however, a Timid nature lets Tapu Lele outspeed Colossoil and Adamant Pajantom.</p> <p>Many teammates appreciate the raw power Choice Specs Tapu Lele provides. Dragapult, Kartana, and Victini are excellent offensive teammates that can take advantage of Tapu Lele putting a dent in bulky Steel-types like Ferrothorn and Heatran. Victini, in particular, is notable, as Tapu Lele allows it to run Expanding Force to hit Toxapex, while Dragapult can pivot Tapu Lele in with U-turn. Defensive pivots like Landorus-T and Tornadus-T can provide Tapu Lele with a free switch, making up for its lackluster bulk. Entry hazards make Tapu Lele's task of breaking through Heatran and Ferrothorn much easier; accordingly, Spikes setters like Astrolotl and Ferrothorn and Stealth Rock users like Heatran and Garchomp are great additions. Astrolotl, in particular, is notable, as it can switch into defensive Heatran and pressure Ferrothorn with Fire Lash, while Ferrothorn consistently switches into any Weavile seeking to revenge kill Tapu Lele. Entry hazard removal from Pokemon like Corviknight or Colossoil is equally important, as Tapu Lele can be chipped over time by the Spikes Ferrothorn sets on it. Colossoil notably can switch into Heatran as well as Dragapult's Shadow Ball.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 273339, "username": "Lasen"}, {"user_id": 251944, "username": "spoo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}]}], "writtenBy": [{"user_id": 277988, "username": "dex"}]}
  },
  "Tapu Fini": {
    "comments": "<h1>Other Options</h1> <p>Protect can be used on a Defog set over Taunt to mitigate Tapu Fini's lack of reliable recovery by giving it another turn of Leftovers, but it also gives the opponent a free turn. The Whirlpool set can run Knock Off over Moonblast to remove Toxapex's Shed Shell, Galarian Slowking's Assault Vest, and other walls Leftovers, but it makes Tapu Fini too passive otherwise. A bulkier EV spread of 248 HP / 44 SpD / 216 Spe can be used on the Choice Scarf set if there is another teammate who can check Cawmodore.</p> <h1>Checks and Counters</h1> <p><strong>Galarian Slowking: Assault Vest Galarian Slowking can take any of Tapu Fini's attacks and threaten it out with Sludge Bomb and Future Sight. Losing Assault Vest to Trick or Knock Off makes it much easier to deal with, however, as it dislikes being Choice-locked .</p> <p><strong>Ferrothorn</strong>: Ferrothorn can take Tapu Fini's attacks and either set entry hazards, recover its health back with Leech Seed, or threaten Tapu Fini with Power Whip. It does not appreciate receiving a Choice Scarf through Trick, however.</p> <p><strong>Electric-types</strong>: Zeraora, Tapu Koko, and Krilowatt can all outspeed non-Choice Scarf sets and threaten to 2HKO Tapu Fini with their attacks while always surviving any hit from Choice Scarf sets and KOing back.</p> <p><strong>Grass-types: Kartana, Rillaboom, and Jumbao can all force Tapu Fini out with their Grass-type attacks and can stomach any of its attacks. Rillaboom has to be careful of being burned by Scald, though.</p> ",
    "sets": [
      {
        "name": "Choice Scarf",
        "description": "<h1>Set Details</h1> <p>Hydro Pump allows Tapu Fini to OHKO Cawmodore after it has used Belly Drum. Trick allows Tapu Fini to cripple walls such as Slowking, Ferrothorn, and Blissey as well as slower setup sweepers such as Dragon Dance Dragonite and Geomancy Necturna, locking them into their setup move. Taunt stops Clefable and opposing Tapu Fini from setting up after it has already removed its Choice Scarf with Trick. Defog is an option over Taunt on teams that desperately need entry hazard control. 224 Speed EVs with a Timid nature and Choice Scarf allow Tapu Fini to outspeed Jolly Dragonite and Blaziken at +1 as well as Modest +2 Necturna. Maximum Special Attack EVs allow Tapu Fini to OHKO Dragapult with Moonblast, with the rest of the EVs put into Defense to survive +6 Cawmodore's Bullet Punch after switching into Stealth Rock twice.</p> <p>This set role compresses a revenge killer and check to wallbreakers such as Weavile, Urshifu-R, and Garchomp. Teammates that appreciate Tapu Fini luring in and crippling walls such as Galarian Slowking, Blissey, and Ferrothorn such as Jumbao and Nasty Plot Tornadus-T make for excellent partners, with both of them acting as good checks to Rillaboom. Krilowatt and Tapu Koko can pressure Water-types such as Slowking for Tapu Fini and pivot into it to deal with Blissey. Ground-types such as Colossoil, Landorus-T, and Garchomp can take on Electric-type attacks for Tapu Fini and appreciate it checking Weavile, Urshifu-R, and Arghonaut.</p> "
      },
      {
        "name": "Utility",
        "description": "<h1>Set Details</h1> <p>The combination of Whirlpool, Nature's Madness, and Taunt allows Tapu Fini to trap opposing walls such as Toxapex, Slowking, and Blissey. Moonblast is a mandatory move to check Urshifu-R and Weavile while effectively threatening out Dragon-types. Nature's Madness can deal hefty damage against the aforementioned bulky foes and punishes switch-ins such as Galarian Slowking, Assault Vest Melmetal, and Ferrothorn. Taunt shuts down Toxapex, Slowking, and Blissey from recovering their HP or pivoting out with Teleport. If trapping foes is not a priority, Defog in conjunction with Scald can be run over Whirlpool and Nature's Madness, respectively; this allows Tapu Fini to act as a serviceable entry hazard remover for its team, gives it a more reliable Water-type STAB option, and lets it threaten to burn foes unaffected by Misty Terrain such as Zapdos, Corviknight, and Tornadus-T. Knock Off can be run over Defog to displace foes' items. These EVs allow Tapu Fini to avoid being 3HKOed by Choice Band Urshifu-R's Close Combat and Choice Specs Dragapult's Shadow Ball after switching into Stealth Rock.</p> <p>Teammates that appreciate Toxapex and Slowbro being removed such as Weavile and Urshifu-R pair up nicely with this set. Similarly, Jumbao and Dragapult greatly appreciate Blissey being gone. Ground-types such as Colossoil and Landorus-T can take Electric-type attacks thrown Tapu Fini's way and force Galarian Slowking out, while Tornadus-T and Corviknight help deal with Rillaboom and Jumbao and can bring Tapu Fini in safely with U-turn. Scizor also has great defensive synergy with Tapu Fini, taking on Ferrothorn, Melmetal, and Kartana, while Tapu Fini deals with Astrolotl and Heatran nicely.</p> "
      },
      {
        "name": "Calm Mind",
        "description": "<h1>Set Details</h1> <p>Taunt allows Tapu Fini to shut down passive foes such as Blissey and Toxapex and set up in front of them. It additionally prevents foes like Slowking, Slowbro, and Blissey from safely pivoting into a revenge killer with Teleport. Scald is weaker than Hydro Pump but punishes switch-ins such as Landorus-T, Rillaboom, and Zapdos by threatening to burn them. Draining Kiss keeps Tapu Fini healthy, but Moonblast can be considered for its higher damage output. 140 Speed EVs allow Tapu Fini to outspeed Timid Magnezone and defensive Landorus-T. Investment in Defense is preferred, as Tapu Fini boosts its Special Defense with Calm Mind.</p> <p>Magnezone can trap and remove Ferrothorn, Calm Mind Tapu Fini's greatest counter. Ground-types like Landorus-T, Hippowdon, and Colossoil can deal with Electric-types as well as Galarian Slowking. In return, Tapu Fini can switch into Urshifu-R and Weavile for them. Tornadus-T can help deal with offensive Grass-types such as Kartana and Rillaboom, threaten Ferrothorn with Heat Wave, and remove Galarian Slowking's Assault Vest with Knock Off, making it a fantastic partner.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 277988, "username": "dex"}, {"user_id": 251944, "username": "spoo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}]}], "writtenBy": [{"user_id": 273339, "username": "Lasen"}]}
  },
  "Zeraora": {
    "sets": [
      {
        "name": "Offensive Pivot",
        "description": "<h1>Set Details</h1> <p>Zeraora brings many unique qualities to the table as a pivot: an uncontested Speed tier, a rare strong physical Electric-type STAB move, and outstanding coverage in Knock Off and Close Combat, allowing it to force progress on the enemy team. Knock Off punishes common Ground-type switch-ins to Zeraora, such as Landorus-T, Garchomp, and Hippowdon. Removing Leftovers from these Ground-types makes them much easier to wear down over the course of a game, allowing Zeraora more opportunities to pivot. Additionally, Knock Off notably hits Dragapult super effectively. Close Combat is the preferred option for the final moveslot, as it hits Pokemon such as Equilibra and Hydreigon super effectively, reaching a 2HKO on both. Toxic is another option that further punishes Landorus-T, Garchomp, and Jumbao for switching in on Zeraora.</p> <p>Due to Zeraora's frailty, it can find difficulty switching in. This makes it an excellent choice to add to any VoltTurn core with Pokemon like Kerfluffle, Dragapult, and Rillaboom. Rillaboom in particular helps Zeraora deal with the Ground-types that counter it, while Zeraora pressures Flying-types such as Tornadus-T and Corviknight. Zeraora also appreciates the passive recovery from Rillaboom's Grassy Terrain. Scizor and Tornadus-T form a pivot core with Zeraora while also checking opposing Rillaboom. Defensive pivots such as Corviknight and Slowking help immensely in getting Zeraora in on stronger, frailer targets such as Weavile and Blacephalon. Slowking has the added benefit of Future Sight support, allowing Zeraora to pressure Pokemon immune to Volt Switch. Kyurem is another great choice, greatly threatening the Ground- and Grass-types that like to come in on Zeraora with STAB Ice-type moves. In return, Zeraora can revenge kill Dragapult, Kerfluffle, and Urshifu-R.</p> "
      },
      {
        "name": "Bulk Up",
        "description": "<h1>Set Details</h1> <p>Bulk Up turns Zeraora into a dangerous wincon given its Speed tier and coverage. Furthermore, Bulk Up allows it to tank priority moves from common revenge killers, notably avoiding an OHKO from Rillaboom's Grassy Glide. Zeraora gets ample setup chances, forcing out common defensive Pokemon such as Tomohawk, Slowking, and Corviknight. Close Combat hits Heatran, Kyurem, and Equilibra super effectively, while Knock Off mainly hits Dragapult and Galarian Slowking. Blaze Kick is excellent as coverage for Jumbao but does not hit anything else meaningfully. Longevity from Leftovers allows Zeraora to sweep more easily. Heavy-Duty Boots is an option on more offensive teams, as negating entry hazard chip damage ensures one bulk up puts Zeraora out of range of Rillaboom's Grassy Glide.</p> <p>Bulk Up Zeraora fits best on hyper offense teams. Dual screens support from Tapu Koko and Regieleki lets Zeraora set up more easily and be much harder to revenge kill. Tapu Koko comes with the added benefit of powering up Plasma Fists with Electric Terrain. Rillaboom is an excellent teammate, as Zeraora appreciates Rillaboom countering Ground-types, while Rillaboom values Zeraora's ability to pressure Corviknight and Tornadus-T. Cawmodore is an excellent pairing with Bulk Up Zeraora on hyper offense teams, as it appreciates Zeraora hitting Dragapult and Tornadus-T super effectively. Bulk Up Zeraora can also operate as a wincon on more balanced offensive teams, where it appreciates teammates like Garchomp and Clefable, which excel at chipping foes into range of a Zeraora sweep.</p> <h1>Checks and Counters</h1> <p><strong>Ground-types: Ground-type Pokemon such as Landorus-T, Garchomp, and Hippowdon all wall Zeraora, block its Volt Switch, and force it out. These Pokemon also commonly run items such as Rocky Helmet, which forces chip damage on Zeraora, leaving it more vulnerable to being revenge killed. All of these Pokemon loathe getting hit with Toxic, however.</p> <p><strong>Contact Effects: Chip damage from Rocky Helmet users such as defensive Clefable or Iron Barbs from Ferrothorn can put Zeraora in range of being revenge killed and overall decrease its ability to pivot.</p> <p><strong>Revenge Killers: Pokemon with strong priority such as Rillaboom, Miasmaw, Weavile, and Urshifu-R all can force out Zeraora, not allowing it to pivot. Rillaboom and Miasmaw in particular are notable, as they have a chance to OHKO it, while Weavile and Urshifu-R require prior chip damage to properly pressure Zeraora. Choice Scarf users such as Landorus-T, Kartana, and Victini fulfill a similar role.</p> <p><strong>Bulky Grass-types: Bulky Grass-types such as Jumbao, Tapu Bulu, and Amoonguss resist Zeraora's Plasma Fists and Volt Switch, and they are hard for it to wear down thanks to consistent recovery. Because of Jumbao's Trace and Fairy typing, it either resists or is immune to all of Zeraora's attacking options bar Blaze Kick, including a very useful Volt Switch immunity, making it a particularly excellent check.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 227784, "username": "snake_rattler"}, {"user_id": 336073, "username": "Rabia"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 277988, "username": "dex"}]}
  },
  "Corviknight": {
    "comments": "<h1>Other Options</h1> <p>Iron Defense can be used over U-turn to patch up a team's weakness to setup sweepers like Garchomp, Kartana, and Scizor, but this is usually accomplished better by Skarmory. Bulk Up similarly helps Corviknight check physical setup sweepers while also giving it a stronger offensive presence; however, Corviknight sorely misses its ability to pivot. Iron Head can be run over U-turn to hit Fairy-types like Clefable harder. However, it is noticeably weaker than Brave Bird in most scenarios, and again, Corviknight sorely misses the ability to pivot. Taunt is an option that shuts down Ferrothorn and Melmetal seeking to use Leech Seed and Thunder Wave, respectively. 200 Speed EVs can be used to outspeed Modest Magnezone to avoid being trapped; however, the loss of bulk is quite noticeable. Shed Shell is an option on stall teams that prevents Corviknight from being trapped by Magnezone.</p> <h1>Checks and Counters</h1> <p><strong>Electric-types: Tapu Koko and Zapdos can freely switch into Corviknight and force it out with their strong Electric-type STAB moves. Zapdos in particular is an excellent check, as Corviknight cannot safely U-turn on it due to Static. Krilowatt and Zeraora are excellent checks but may find themselves worn down after repeatedly switching in. Arctozolt is highly effective against most teams relying on Corviknight as their bulky Steel-type; however, its weakness to Body Press means it can't safely switch in more than once. Magnezone, on the other hand, stands above all other options for its ability to trap Corviknight with Magnet Pull and either KO or significantly weaken it.</p> <p><strong>Fire-types: Heatran, Blacephalon, Volcanion, Victini, and Astrolotl all threaten Corviknight out. The former four Pokemon offensively pressure Corviknight, while Astrolotl can use a combination of Fire Lash and Regenerator to quickly chip Corviknight's health and is one of the few entry hazard setters that Corviknight does not beat. Heatran must be wary of switching into multiple Body Presses, however.</p> <p><strong>Chip Damage: Corviknight relies on being mostly healthy in order to operate as a defensive pivot; therefore, chip damage in the form of Knock Off or Stealth Rock from Rillaboom or Landorus-T can lead to Corviknight being overwhelmed by strong attackers like Tapu Lele, Dragapult, and Kartana.</p> ",
    "sets": [
      {
        "name": "Defog",
        "description": "<h1>Set Details</h1> <p>Corviknight's outstanding bulk, defensive typing, and lack of reliance on its item allows it to be the premier Defogger in the tier. Body Press deters Heatran from switching in, hits Ferrothorn, Melmetal, and Equilibra super effectively, and importantly OHKOes Weavile. U-turn is the preferred move for the third slot, as Corviknight can leverage its impressive bulk and low Speed to safely pivot in a more frail teammate. Brave Bird is an option to hit Rillaboom, Revenankh, Volcarona, Arghonaut, and Urshifu-R. Corviknight's access to Pressure lets it permanently keep entry hazards off the field against Stealth Rock setters like Landorus-T and Clefable in the long run, as well as stall powerful attackers such as Revenankh and Melmetal. Leftovers allows Corviknight to withstand Stealth Rock chip damage and switch into wallbreakers like Tapu Lele more easily; however, Rocky Helmet can be run in order to punish Weavile, Urshifu-R, and U-turn users like Landorus-T and Dragapult. The listed EV spread allows Corviknight to avoid the 2HKO from Choice Specs Tapu Lele's Psychic after Stealth Rock and the 2HKO from Choice Specs Dragapult's Shadow Ball from full HP. A Relaxed nature can be run in order to underspeed Scizor and opposing Corviknight in order to pivot slower.</p> <p>Corviknight has great flexibility when it comes to teammates. Defensive teams appreciate its bulk and access to Pressure, while offensive teams can take advantage of its access to U-turn. Ground-types like Landorus-T, Garchomp, and Colossoil are excellent choices for teammates, as they can switch into Electric-types and Heatran. In return, Corviknight deals with Weavile. Toxapex, Slowking, and Heatran are valuable teammates as well, as they can switch into the Fire-types that threaten Corviknight. Heatran in particular enjoys Corviknight keeping entry hazards off the field. Blissey, Scizor, and Clefable can help Corviknight deal with stronger special attackers like Kyurem and Dragapult. Strong wallbreakers like Tapu Lele, Dragapult, and Urshifu-R all appreciate Corviknight's ability to safely pivot them in and sponge attacks that force them out.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 273339, "username": "Lasen"}, {"user_id": 251944, "username": "spoo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}]}], "writtenBy": [{"user_id": 277988, "username": "dex"}]}
  },
  "Dragapult": {
    "comments": "<h1>Other Options</h1> <p>Dragapult can use a set of Draco Meteor / Hex / U-turn / Will-O-Wisp or Thunder Wave with Heavy-Duty Boots to better support its team, although such a set is much worse at wallbreaking and requires more team support to successfully clean late-game. Dragon Dance sets are usable on dual screens teams and let Dragapult make use of its higher Attack stat, but they struggle to break Fairy-types like Clefable and Tapu Fini. An EV spread of 28 HP / 68 Def / 252 SpA / 160 Spe can be run to take a Bullet Punch from Cawmodore after Stealth Rock damage while outrunning Tapu Koko and maximizing overall bulk.</p> <h1>Checks and Counters</h1> <p><strong>Fairy-types: Clefable and Tapu Fini can avoid a 2HKO from Dragapult's Shadow Ball and defeat it with Moonblast. Choice Scarf Jumbao has the bulk to take any one hit from Dragapult, outspeeds it, and OHKOes it with Moonblast. Other Fairy-types like Tapu Koko can switch into Draco Meteor but must be more mindful of Shadow Ball.</p> <p><strong>Dark-types: Offensive Dark-types like Weavile, Hydreigon, and Bisharp take advantage of Dragapult locking into Shadow Ball and easily OHKO it in return. Bulkier Dark-types like Tyranitar and Colossoil are even better Shadow Ball switch-ins, but Colossoil faces heavy pressure from Draco Meteor and neither enjoy taking repeated U-turns.</p> <p><strong>Special Walls: Toxapex, Heatran, Assault Vest Tornadus-T, Venomicon, and Tyranitar are effective at taking multiple attacks from Dragapult and threatening it in return. Blissey is the closest thing to a hard counter to Dragapult but is generally a large momentum sap.</p> <p><strong>Revenge Killers: Dragapult's poor bulk and typing leaves it vulnerable to priority from the likes of Weavile and Revenankh as well as faster attackers such as Zeraora and Choice Scarf users like Tapu Fini, Tapu Lele, and Kartana.</p> ",
    "sets": [
      {
        "name": "Choice Specs",
        "description": "<h1>Set Details</h1> <p>Dragapult is one of the most devastating offensive options in the CAP metagame. Its blistering Speed gives it the jump on every unboosted Pokemon bar Zeraora, making it an effective revenge killer and great late-game cleaner once its checks are in range of Shadow Ball. Furthermore, its combination of U-turn and great overall coverage can make it difficult to safely play reactively against. Hydro Pump targets Heatran and bulky Ground-types like Colossoil, Landorus-T, and Equilibra, whereas Flamethrower helps immensely versus other Steel-types like Corviknight and Ferrothorn. Dragapult can even utilize Hex to break past sturdier walls like specially defensive Clefable and Toxapex, although this mandates having teammates to spread status.</p> <p>Dragapult excels at wearing down specially defensive Steel-types like Heatran, Corviknight, and Equilibra; setup sweepers like Nihilego and Calm Mind Clefable benefit greatly from this giving them a much easier time sweeping late-game. Ghost-type teammates like Pajantom and Blacephelon can wallbreak in combination with Dragapult to easily overwhelm foes such as Heatran, Clefable, and Toxapex. Dark-types like Weavile, Colossoil, and Tyranitar can take advantage of Dragapult locking into Shadow Ball and easily revenge kill it, so Steel- and Fairy-types like Corviknight, Tapu Fini, and Clefable are great partners. If you run Hex, make sure to pair Dragapult with status spreaders like Clefable, Toxapex, and Heatran.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 273339, "username": "Lasen"}, {"user_id": 251944, "username": "spoo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 336073, "username": "Rabia"}]}
  },
  "Urshifu-Rapid-Strike": {
    "comments": "<h1>Other Options</h1> <p>Protective Pads can be used to avoid common contact-punishing Pokemon such as Ferrothorn, Zapdos, and Rocky Helmet Tomohawk, Skarmory, and Buzzwole. A Choice Scarf variant can also be run, as it turns Urshifu-R into a fast revenge killer and tool against hyper offense teams, being able to easily revenge kill the likes of Cawmodore, Arctozolt, and Weavile. However, the power loss of not running Choice Band will make Urshifu-R unable to break through Tapu Fini, Arghonaut, and Buzzwole.</p> <h1>Checks and Counters</h1> <p><strong>Physically Defensive Walls: Dragonite, Tomohawk, and Buzzwole are able to switch into Urshifu-R's attacks with relative ease and force it out with their STAB options or punish it with Rocky Helmet in the case of the latter two.</p> <p><strong>Bulky Water-types: Toxapex, Tapu Fini, and Slowbro can safely switch into both of Urshifu-R's STAB moves and force it to switch out; however, Tapu Fini gets worn down relatively quickly if Urshifu-R is running Thunder Punch. Arghonaut resist Urshifu's Surging Strikes and narrowly avoids the 2HKO from Thunder Punch, but it cannot safely switch into Close Combat.</p> <p><strong>Grass-types: Bulky Grass-types such as Tangrowth, Amoonguss, and Ferrothorn are able to switch into Urshifu's Water-type attacks, though the latter is risky as it is OHKOed by Close Combat. Meanwhile, offensive Grass-types such as Rillaboom, Kartana, and Jumbao are able to easily threaten Urshifu-R out with their powerful STAB attacks, though the former two cannot switch directly into it.</p> <p><strong>Faster Pokemon and Priority: Faster Pokemon such as Zeraora, Tornadus-T, Dragapult, and Tapu Koko are able to revenge kill Urshifu-R due to their higher Speed and their super effective moves or strong special attacks.</p> ",
    "sets": [
      {
        "name": "Choice Band",
        "description": "<h1>Set Details</h1> <p>Urshifu-R is a threatening wallbreaker; its high base power STAB moves and stellar Attack stat in tandem with Choice Band make it incredibly hard to safely switch into. U-turn allows for Urshifu-R to keep momentum as well as chip Slowking and Jumbao. Aqua Jet allows Urshifu-R to revenge kill Volcarona and weakened Cawmodore, Weavile, and Garchomp. Thunder Punch is an option that allows Urshifu-R to work around its usual bulky Water-type checks such as Slowking, Toxapex, and Tapu Fini. An Adamant nature can be used if more power is desired, but this leaves Urshifu-R outsped by the likes of Kyurem, Tapu Lele, and Jumbao.</p> <p>Urshifu-R appreciates being paired up with Weavile, Dragapult, and Kartana, as they are able to clean through opposing teams after it has weakened down walls like Toxapex and Ferrothorn. These Pokemon also appreciate being brought in for free via U-turn. Pokemon such as Landorus-T and Corviknight make for a stellar combination with Urshifu-R, as they are able to pivot it in safely and can deal with the Electric- and Fairy-types that threaten it out, respectively. Slowking and Galarian Slowking are able to help Urshifu-R break through the likes of Toxapex, Arghonaut, and Buzzwole thanks to Future Sight. Urshifu-R's weakness to Grass-types such as Kartana, Rillaboom, and Jumbao make pairing it up with Grass-resistant Pokemon like Astrolotl and Corviknight pivotal, while other Steel-types like Heatran, Ferrothorn, and Equilibra can help ward off threatening Psychic- and Fairy-types like Tapu Lele and Tapu Koko.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 273339, "username": "Lasen"}, {"user_id": 251944, "username": "spoo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}]}], "writtenBy": [{"user_id": 517892, "username": "pannuracotta"}]}
  },
  "Syclant": {
    "comments": "<h1>Checks and Counters</h1> <p><strong>Bulky Water-types</strong>: Toxapex, Tapu Fini, and Arghonaut all resist Syclant's STAB coverage and can retaliate back with moves like Scald and Knock Off or take the opportunity to use their various respective utility options, like Toxic or Spikes. Other bulky Water-types like Slowbro, Slowking, and Swampert have a much harder time checking Syclant due to their weakness to U-turn or their inclination to run specially defensive sets, though.</p> <p><strong>Steel-types: Bulky Steel-types like Melmetal and Heatran can switch into Syclant's STAB moves with ease, however, they both fear the threat of Earthquake. Equilibra, Ferrothorn, and Corviknight take more damage from Icicle Crash but can still force Syclant out unless they've been significantly weakened; Equilibra and Corviknight especially are strong answers because of their immunity to Earthquake and their ability to recover health with Pain Split and Roost, respectively.</p> <p><strong>Faster Pokemon: Pokemon that outrun Syclant like Dragapult and Zeraora can easily dispatch it; Choice Scarf users like Jumbao, Landorus-T, and Kartana are capable of this as well. However, the Pokemon that are weak to Ice-type moves like Dragapult and Landorus-T must respect the threat of Ice Shard.</p> <p><strong>Contact Punishments: Rocky Helmets on physical walls like Tomohawk, Iron Barbs from Ferrothorn, and Static or Flame Body from Zapdos or Moltres can all punish Syclant for repeatedly using U-turn, or potentially Triple Axel; thus, if these Pokemon are still on the field, then Syclant is forced to be used more conservatively.</p> ",
    "sets": [
      {
        "name": "Choice Band",
        "description": "<h1>Set Details</h1> <p>Syclant is difficult to justify on most teams because of its frail defenses, lack of switch-in opportunities, and the plethora of sturdy Pokemon that resist U-turn in the metagame; however, with proper support, Syclant's fast and powerful U-turn, great Ice / Ground coverage, and access to priority are invaluable assets to its team. Its ability in Mountaineer prevents Stealth Rock damage, so you can forgo Heavy-Duty Boots and dedicate your item slot to a damage boosting option like Choice Band. Earthquake is absolutely necessary for dealing with Pokemon like Toxapex, Melmetal, and Heatran that would otherwise stonewall Syclant. Ice Shard is valuable for picking off weakened Tornadus-T without risking a Speed tie and revenge killing faster threats like Dragapult, +1 Garchomp, and weakened Unburden-boosted Hawlucha, though one can opt to run Spikes instead to capitalize on the switches that Syclant forces. Triple Axel is an alternative option over Icicle Crash that offers a significant boost in damage; however, its inconsistency and its susceptibility to contact punishments like Rocky Helmet and Static mean that the tradeoff usually isn't worth it. Syclant can also choose to run Superpower over Earthquake to hit Equilibra and Ferrothorn super effectively, although Earthquake's coverage is still superior in most cases.</p> <p>Because Syclant is extremely frail and held back by many common bulky Water- and Steel-types, it relies immensely on its teammates to shore up its shortcomings as a wallbreaker. Strong physical attackers like Rillaboom and Kartana are good partners to apply pressure to some of Syclant's best switch-ins like Arghonaut and Equilibra. Having teammates like Krilowatt and Nidoking that can take advantage of Toxapex and other bulky Water-types like Tapu Fini is also appreciated. Krilowatt is especially useful because it forms a strong VoltTurn core with Syclant, bringing it in on Pokemon like Blissey and Astrolotl, which are then easily forced out. Combining Spikes support from teammates like Astrolotl and Ferrothorn with these VoltTurn cores helps Syclant break past its grounded checks like Toxapex and Melmetal. Other common bulky Steel-types like Heatran can also give Syclant trouble if it's locked into an Ice-type move, so having partners like Slowking and Equilibra that can reliably answer them is greatly appreciated. Finally, Syclant benefits from having reliable pivots on its team because it can struggle to enter the game safely; Slowking, Landorus-T, and Zeraora are all good options that can also apply pressure to common Steel-types that are difficult for Syclant to break past by itself. Syclant in turn heavily pressures Pokemon like Miasmaw that can pose a large threat to some of these pivots.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 227784, "username": "snake_rattler"}, {"user_id": 73006, "username": "-Voltage-"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 251944, "username": "spoo"}]}
  },
  "Revenankh": {
    "comments": "<h1>Checks and Counters</h1> <p><strong>Bulky Flying-types</strong>: Venomicon, Zapdos, and Tornadus-T can all survive any hit from Revenankh and threaten it with Hurricane.</p> <p><strong>Venomicon-E: Venomicon-E outspeeds Revenankh and can OHKO it with Brave Bird. It cannot switch into Poltergeist, however.</p> <p><strong>Bulky Water-types</strong>: Toxapex can utilize Haze to remove Revenankh's boosts while stomaching even boosted Poltergeist, while Arghonaut's Unaware makes it an excellent answer to it regardless of boosts. Tapu Fini can outspeed and 2HKO with Moonblast.</p> <p><strong>Fairy-types: Clefable can take on unboosted Revenankh and 2HKO with Moonblast, while offensive Fairy-types like Jumbao and Choice Specs Tapu Lele can revenge kill it, but they must be wary of switching into Poltergeist.</p> <p><strong>Status: Toxic from defensive Landorus-T and Will-O-Wisp from Astrolotl can cripple Revenankh and limit its sweeping potential.</p> ",
    "sets": [
      {
        "name": "Bulk Up",
        "description": "<h1>Set Details</h1> <p>Revenankh has the potential to be a really strong wallbreaker and potent late-game cleaner, sporting an unresisted STAB combination and dual STAB priority. Its Speed, unfortunately, is quite poor, and its typing leaves it susceptible to the offensive moves of common defensive Pokemon such as Venomicon and Tapu Fini. Triage Drain Punch is an extremely useful tool, allowing it to revenge kill Weavile, Zeraora, and Kartana. Poltergeist helps Revenankh break through many of its checks such as Tapu Lele, Tornadus-T and Zapdos, dealing a hefty amount of damage to all of them, especially after a Bulk Up. Shadow Sneak is a good way for Revenankh to pick off weakened Dragapult and Blacephalon. These EVs ensure that Revenankh is never 2HKOed by Clefable's Moonblast, cannot be OHKOed by Choice Scarf Timid Tapu Lele after a Bulk Up, and guarantee that Spell Tag-boosted Poltergeist into Shadow Sneak will KO pivot Zapdos after using Bulk Up. It also guarantees a 2HKO on Corviknight after a boost. 20 Speed EVs allow Revenankh to outspeed neutral nature Corviknight.</p> <p>As Revenankh is checked by most physical walls, it requires heavy support. Kartana and Melmetal can help overwhelm checks such as Zapdos and Arghonaut while also immediately threatening Tapu Fini. Healing Wish Jumbao, Heal Bell Astrolotl, and Tapu Fini are all fantastic partners, being able to protect Revenankh against status. Zapdos is a great partner that can deal with both Venomicon formes. Pivoting is essential, as Revenankh can't come in on too many threats. Dragapult can provide that support for Revenankh, pivoting into and dealing with Heatran and Colossoil for it. Krilowatt and Zeraora can both immediately threaten Toxapex, Tornadus-T, and Arghonaut and use Volt Switch to bring Revenankh in safely. Choice item users like Tapu Fini and Blacephalon provide an alternative method of item disruption, seeing as Knock Off support is counterproductive.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 251944, "username": "spoo"}, {"user_id": 277988, "username": "dex"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}]}], "writtenBy": [{"user_id": 273339, "username": "Lasen"}]}
  },
  "Pyroak": {"sets": [{"name": "Contrary Tank"}]},
  "Fidgit": {
    "comments": "<h1>Checks and Counters</h1> <p><strong>Strong Attackers</strong>: Fidgit is most threatened by strong wallbreakers like Choice Specs Tapu Lele, Choice Band Urshifu-R, and Life Orb Garchomp when outside of Trick Room. Fidgit will not be able to set up Trick Room before being OHKOed, and if it tries to switch, its teammates might not be able to tank two consecutive attacks. This situation not only jeopardizes Fidgit itself but also its entire team. At best, the Trick Room team could lose a couple team members; at worst, the Trick Room team simply won't get Trick Room up again and loses.</p> <p><strong>Trapping Moves: Trapping Moves from Heatran, Tapu Fini, and Pajantom force Self-Destruct Fidgit to use the move early, or else Fidgit will waste its own Trick Room turns. This stops Fidgit from setting up Persistent-lengthened Trick Room more than once.</p> ",
    "sets": [
      {
        "name": "Trick Room Setter",
        "description": "<h1>Set Details</h1> <p>Fidgit's signature ability Persistent extends Trick Room by two turns, which makes Trick Room teams much more consistent. Fidgit is even bulky enough to set it twice sometimes if its HP is managed well! Having both Stealth Rock and Rapid Spin is great role compression for Trick Room teams, even if Fidgit won't be able to use them in every battle. Self-Destruct provides one of Fidgit's teammates a free switch in while also chipping down the foe appreciably, giving its teammate an excellent platform to start sweeping. It also blocks opposing Rapid Spin and Defog from clearing entry hazards and conserves Trick Room turns against trappers like Pajantom, Whirlpool Tapu Fini, and Heatran. U-turn is an option over Self-Destruct, as Fidgit can pivot into one of its teammates and escape trapping without sacrificing itself. However, U-turn can either leave Fidgit with so little HP that it's useless late game or force a sweeper to take heavy damage on the switch, which means U-turn is sometimes hard to use.</p> <p>252 HP EVs and 72 Defense EVs allow Fidgit to survive a Triple Axel from unboosted Weavile, Psyshock from Choice Scarf Tapu Lele, and unboosted Earthquake from Garchomp or Landorus-T. The remaining EVs in Special Defense give Fidgit the best chance to tank two of Choice Specs Dragapult's Draco Meteors and guarantee surviving its Hydro Pump. Mental Herb is the preferred item to set Trick Room against Taunt users such as Tornadus-T, Heatran, and Tapu Fini. On the other hand, Air Balloon allows Fidgit to set up Trick Room against Ground-types, which typically have a good matchup against most Trick Room sweepers.</p> <p>Generally, Fidgit operates best alongside two other Trick Room setters. Hatterene's access to Magic Bounce, Healing Wish, and Misty Explosion make it an excellent choice, preventing entry hazards from being set up in the first place. Cresselia's immense bulk allows it to set up Trick Room against Choice Band Urshifu-R and Choice Specs Tapu Lele, which can both OHKO Fidgit. Cresselia also provides a Ground-type immunity and Lunar Dance utility. Porygon2 has a much better matchup against Ghost-types like Dragapult and Pajantom, which otherwise give Trick Room teams problems when Trick Room expires, and can safely pivot into a sweeper with Teleport. The remaining three teamslots should be dedicated to Trick Room sweepers. Venomicon is an excellent choice with Nasty Plot and Life Orb, as it's one of the few special-attacking Trick Room sweepers and also matches up extremely well against Ground-types. Melmetal runs a brutal all-out attacker set with Life Orb or Choice Band that few Pokemon can stomach, and it provides excellent defensive utility with its bulk and typing. Tapu Bulu has great synergy with Melmetal, wearing down or eliminating Zapdos, Ferrothorn, Rotom-W, and Venomicon, providing passive recovery, and reducing damage from opposing Earthquakes. Alolan Marowak and Pyroak greatly enjoy Fidgit's extended Trick Room and appreciate Fidgit clearing Stealth Rock for them. Dhelmise is an alternative to Alolan Marowak that fares much better against Slowbro and Arghonaut and isn't nearly as crippled by Ferrothorn's Knock Off, but it is slightly less powerful and must use the more unreliable Power Whip. Slowking is an alternative bulky Nasty Plot Trick Room sweeper to Venomicon that can set up against Heatran, which commonly harasses Trick Room teams. Finally, Crawdaunt and Glastrier are decent options for Trick Room teams, but they are walled by Arghonaut, which can use them to halt the team's momentum.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 251944, "username": "spoo"}, {"user_id": 273339, "username": "Lasen"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 227784, "username": "snake_rattler"}]}
  },
  "Stratagem": {
    "comments": "<h1>Other Options</h1> <p>Energy Ball can be used over Earth Power to hit some bulky Water- and Ground-types for more damage; however, it's usually not worth worsening your matchup against Toxapex and Galarian Slowking. Stratagem can also drop Earth Power for Stealth Rock and be a dedicated lead on offensive teams, but its value as a fast cleaner and mid-game breaker is difficult to pass up.</p> <h1>Checks and Counters</h1> <p><strong>Specially Bulky Pokemon: Specially bulky Pokemon such as Blissey, Slowking, Hippowdon, and Gastrodon can easily switch into Stratagem and force it out due to its lack of recovery, regardless of whether Stratagem has boosted its Special Attack or not. Galarian Slowking can switch into any move and do significant damage with Scald, but cannot beat Stratagem without prior chip damage.</p> <p><strong>Faster Pokemon: Zeraora can switch in safely on any move except Meteor Beam, outspeed, and threaten to OHKO with Close Combat. Dragapult can threaten to OHKO with a Choice Specs Draco Meteor or Hydro Pump. Choice Scarfers such as Tapu Fini, Jumbao, Kartana, or Tapu Lele cannot switch in safely, but consistently threaten Stratagem, forcing it to switch out.</p> <p><strong>Priority Moves: Rillaboom prominently threatens to OHKO Stratagem with its strong STAB priority move, while Scizor, Syclant, and Weavile can pick-off a weakened Stratagem, but they must all be wary when switching in.</p> ",
    "sets": [
      {
        "name": "Meteor Beam",
        "description": "<h1>Set Details</h1> <p>Stratagem plays the role of a fast, frail wallbreaker, with a STAB Meteor Beam. The move's Special Attack boost is much appreciated, as Stratagem often falls short of getting crucial OHKOs and 2HKOs without it. Once Meteor Beam is used, you must try to get as much mileage out of Stratagem as possible, as it loses significant wallbreaking power if it's forced to switch out and lose its boost. Paleo Wave is the STAB move of choice after Meteor Beam is used. Fire Blast hits Steel-types like Equilibra and Ferrothorn that want to switch in on a predicted Rock-type move. Earth Power is a more accurate but weaker way to handle certain Steel-types like Melmetal and importantly hits Toxapex and Galarian Slowking super effectively.</p> <p>Because Stratagem can only boost once in most games, it works best on offensive teams punching holes for its teammates or as a late-game cleaner. Teammates like Volcarona and Zeraora are great at overwhelming opposing bulky Ground-types in tandem with Stratagem. Nihilego and Necrozma form powerul Meteor Beam cores with Stratagem and enjoy its ability to weaken Steel-types and special walls, while Dragonite, Revenankh, Rillaboom, and Kartana benefit from Stratagem's good matchup into Flying-types like Zapdos. Rillaboom and Kartana also provide Knock Off utility to remove Leftovers and Heavy-Duty Boots from the opponent's Pokemon, both of which Stratagem greatly appreciates. On less offensive teams, Stratagem relies much more on pivots to enter safely due to its low defensive stats and weakness to common types. Pivots such as Landorus-T and Dragapult can get Stratagem in on advantageous matchups so it can pave the way for them to clean up later. Finally, Spikes setters like Astrolotl and Ferrothorn dissuade the opponent from switching around Stratagem and also help it break down walls more easily.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 297859, "username": "quziel"}, {"user_id": 336073, "username": "Rabia"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 273339, "username": "Lasen"}]}
  },
  "Arghonaut": {
    "comments": "<h1>Checks and Counters</h1> <p><strong>Flying-types</strong>: Venomicon and Venomicon-E are some of the strongest checks to Arghonaut, with Venomicon-E being especially potent as Knock Off cannot remove its item. Tornadus-T and Corviknight can each remove Arghonaut's Spikes, and will deal great damage with their Flying-type STAB; however, Tornadus-T does not enjoy losing its item. Corviknight is additionally capable of stalling out the PP of Arghonaut's Spikes and even Circle Throw. Galarian Zapdos and Galarian Moltres are two strong Flying-type wallbreakers that can easily force Arghonaut out, though they don't want to switch into Knock Off.</p> <p><strong>Future Sight: The prevalence of Slowbro and Galarian Slowking means that Future Sight is very common, which can threaten Arghonaut when it would switch in to sponge a physical hit, but they do not appreciate getting their item Knocked Off.</p> <p><strong>Strong Electric-types: Electric-types such as Zapdos, Tapu Koko, Krilowatt, Zeraora, and Rotom-W can threaten Arghonaut with their strong STAB moves with little to no fear, especially if they are running Volt Switch, but most of them do not appreciate a well-timed Knock Off.</p> <p><strong>Grass-types: Kartana, Jumbao, Rillaboom, and Tapu Bulu can all scare out Arghonaut, even if their item gets removed by Knock Off. Ferrothorn takes very little from Circle Throw and it can set up its own hazards, use Leech Seed, or deal great amounts of damage with Power Whip.</p> <p><strong>Fairy-types: Tapu Lele can OHKO Arghonaut with any of its STAB options. Clefable can beat Arghonaut with its Moonblast, while Tapu Fini and some Tapu Koko sets can shut it down further with Taunt, regardless of whether they're running any sort of Fairy-type move.</p> ",
    "sets": [
      {
        "name": "Physical Wall",
        "description": "<h1>Set Details</h1> <p>Water / Fighting typing and Unaware let Arghonaut wall some of the tier's strongest attackers such as Weavile, Garchomp, Heatran, weather sweepers like Barraskewda and Excadrill, and other setup sweepers like Cawmodore and Pyroak. Unfortunately, Arghonaut's secondary typing makes it susceptible to Future Sight and leaves it taken advantage of by Venomicon and Venomicon-E incredibly easily, often forcing its teammates to pick up extra slack in those matchups. Moreover, Arghonaut's Water typing puts it into competition with other bulky Water-types such as Tapu Fini, Slowbro, and Toxapex, which have superior defensive typings and more broadly useful abilities. Arghonaut also provides a team Spikes support and can use Circle Throw to both force Spikes damage and disrupt opponents. Knock Off severely inconveniences almost any Pokemon it hits, removing the common Heavy-Duty Boots, further enhancing Spikes's damage output, while at the same time making Ghost- and Flying-types think twice before they come in to take a Circle Throw. A physically defensive EV spread is preferred to reliably answer powerful set-up sweepers such as Garchomp and Cawmodore and wallbreakers like Urshifu-R.</p> <p>Arghonaut enjoys being paired with Steel-types such as Corviknight and Melmetal, since they resist Flying-, Fairy-, and Psychic-type attacks that it is weak to, while Arghonaut takes on the various Fire-types that threaten them. In addition to these Steel-types, others like Magnezone and Ferrothorn can shore up Arghonaut's vulnerability to Venomicon-E. Heatran is a great partner, as it can set up Stealth Rock and use Toxic on Slowbro, which Arghonaut appreciates. Ground-types such as Landorus-T, Equilibra, and Garchomp dissuade Electric-types in exchange for Arghonaut checking Weavile. Flying-types like Tornadus-T and Zapdos also pair nicely, being able to deal with Kartana and other Grass-types, while Arghonaut handles Ice-type moves. VoltTurn users such as Dragapult and Tapu Koko appreciate the extra residual damage Spikes provides, and Arghonaut can remove the Heavy-Duty Boots of various walls with Knock Off.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 227784, "username": "snake_rattler"}, {"user_id": 297859, "username": "quziel"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 273339, "username": "Lasen"}]}
  },
  "Kitsunoh": {"sets": [{"name": "Choice Scarf"}]},
  "Cyclohm": {
    "comments": "<h1>Other Options</h1> <p>Cyclohm can opt for Heal Bell instead of Draco Meteor to provide more team support, but this leaves it very vulnerable to opposing Dragon-types.</p> <h1>Checks and Counters</h1> <p><strong>Special Walls</strong>: Pokemon like Blissey, Galarian Slowking, and Heatran can switch into Cyclohm with impunity because of their good special bulk. Cyclohm is relegated to pivoting out with Volt Switch.</p> <p><strong>Fairy-types: Clefable doesn't fear any of Cyclohm's attacks; the worst that can happen to it is being paralyzed by Discharge. Offensive Fairy-types like Tapu Lele, Jumbao, and Tapu Koko can easily dispatch Cyclohm but are not consistent switch-ins to it.</p> <p><strong>Dragon-types: Dragon-types like Dragapult and Hydreigon can resist any attack bar Draco Meteor and threaten to OHKO Cyclohm with Draco Meteor.</p> <p><strong>Ground-types: Pokemon like Landorus-T, Garchomp, and Colossoil all fear varying attacks from Cyclohm, but they outspeed it and threaten it with Ground-type attacks. Equilibra is generally capable of defensively answering Cyclohm but must respect the threat of Flamethrower.</p> ",
    "sets": [
      {
        "name": "Physically Defensive",
        "description": "<h1>Set Details</h1> <p>Cyclohm is a reliable physical wall thanks to its great bulk, solid defensive typing, and access to Slack Off. It can consistently switch into threats like Venomicon-E, Galarian Zapdos, Urshifu-R, and Kartana and make use of its impressive coverage to punish almost any possible switch-in. Unfortunately, it can be very hard to justify using Cyclohm over a different Electric-type like Zapdos, Tapu Koko, and Rotom-W. Volt Switch is great at helping Cyclohm capitalize on its ability to force switches and lets it keep up momentum against foes like Blissey, Galarian Slowking, and Heatran that it struggles to threaten, but Discharge helps it more directly deal with Water-types like Slowking and Toxapex, which can easily take a Volt Switch and heal back up with Slack Off and Recover, respectively, as well as Venomicon and Venomicon-E. Ice Beam can be run over Draco Meteor to hit Zapdos, Landorus-T, and opposing Dragon-types in one slot, though the drop in power is noticeable. Heavy-Duty Boots lets Cyclohm safely pivot even with several entry hazards on the field, but Rocky Helmet synergizes very well with Cyclohm's Static to punish U-turn users like Tornadus-T and Urshifu-R.</p> <p>Cyclohm is a great check to Fire-types, so Steel-types like Ferrothorn, Equilibra, and Melmetal partner well with it; in return, these Steel-types help handle Fairy-types for Cyclohm. Cyclohm commonly draws in special walls like Galarian Slowking, Landorus-T, and Blissey, which it can easily pivot out versus with Volt Switch; physical wallbreakers such as Weavile and Melmetal appreciate being freely brought in against such foes. Ground-types such as Garchomp and Landorus-T can cause issues for Cyclohm by outspeeding and threatening to revenge kill it; having teammates like Venomicon, Tornadus-T, and Slowbro helps circumvent this.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 227784, "username": "snake_rattler"}, {"user_id": 251944, "username": "spoo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 336073, "username": "Rabia"}]}
  },
  "Colossoil": {
    "comments": "<h1>Checks and Counters</h1> <p><strong>Flying-types</strong>: Corviknight takes little damage from Knock Off, is immune to Toxic, and can use a slower U-turn to gain momentum against Colossoil. Venomicon and Venomicon-E are immune to Toxic and the latter cannot have its item removed. Skarmory can be annoyed at losing its item, but it otherwise freely sets Spikes against Colossoil. Landorus-T is also effective, but Knock Off and Toxic are annoying because it lacks reliable recovery. Other Offensive Flying-types like Tornadus-T and Zapdos can chip down Colossoil in the long run but aren't particularly good checks on their own.</p> <p><strong>Physical Walls: Buzzwole and Arghonaut are crippled by Toxic, but are otherwise excellent answers to Colossoil. Ferrothorn is immune to Toxic, can tank Colossoil's STABs quite well, and punishes Knock Off with Iron Barbs, but has less longevity due to its lack of reliable recovery.</p> <p><strong>Fairy-types: Clefable takes little damage from Earthquake, can absorb Toxic very easily, and is only slightly hampered at the loss of Leftovers. Jumbao destroys Colossoil easily with either of its STAB moves. Tapu Fini hates losing its Leftovers, but it can set up against Colossoil while remaining very healthy with Draining Kiss. Finally, Tapu Lele doesn't want to tank an Earthquake or lose its item but otherwise has a winning matchup against Colossoil if it's Timid.</p> <p><strong>Strong Physical Attackers: Urshifu-R's common attacks either OHKO or 2HKO Colossoil, while Weavile's Triple Axel can OHKO Colossoil with three hits. Kartana can't safely switch in, but easily forces Coilossoil out with Leaf Blade. Tapu Bulu resists both of Colossoil's STAB moves and trivially forces it out. Rillaboom can destroy Colossoil with its STAB moves, but it will take a lot of recoil from Wood Hammer due to Colossoil's high HP stat.</p> <p><strong>Levitate Users: Equilibra and the rare Hydreigon don't fear Earthquake, but they're annoyed by Knock Off removing their items. Because Colossoil lacks recovery, their moves can chip it down into KO range from other Pokemon.</p> ",
    "sets": [
      {
        "name": "Utility",
        "description": "<h1>Set Details</h1> <p>Colossoil compresses many roles in one teamslot, as no other viable Pokemon has access to all of Knock Off, Toxic, and Rapid Spin. Its typing allows it to absorb Volt Switch, Future Sight, and Dragapult's Choice Specs-boosted Shadow Ball, while Guts means that Zapdos's Static and Heatran's Toxic are much less scary to deal with. Because even uninvested Earthquake is so strong, Flying-type Pokemon like Landorus-T, Zapdos, and Corviknight and other physical walls like Arghonaut, Clefable, and Equilibra tend to switch into Colossoil, which means Colossoil can rather easily use Knock Off or Toxic against them. U-turn is an option to keep up momentum against Pokemon like Clefable, Corviknight, Venomicon, and Venomicon-E. Protect can also be used to rack up Leftovers recovery and Toxic damage, as well as scout Choice users like Dragapult, Tapu Lele, and Kartana. The given EV spread outspeeds Modest Tapu Lele and increases Colossoil's special bulk to better tank hits from Dragapult, Zapdos, and Heatran.</p> <p>Pokemon that need bulky Flying-types like Tornadus-T, Zapdos, and Landorus-T worn down appreciate Colossoil's presence the most, so Kartana, Rillaboom, and Venomicon-E make for great teammates. Rillaboom's Grassy Surge means that Colossoil can recover off weaker hits very quickly, especially with Protect, but also means that it must run High Horsepower instead of Earthquake. Because Colossoil can clear entry hazards, many good teammates can run other moves instead of Defog or Rapid Spin. For example, Zapdos can freely run three attacks and Roost or defensive sets with Toxic, Tornadus-T can run Taunt or Assault Vest, and Astrolotl can run Spikes. In return, these Pokemon can take on powerful Grass-types for Colossoil. Colossoil's Knock Off means that hazard-setting teammates like Heatran, Ferrothorn, and Arghonaut are good partners.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 297859, "username": "quziel"}, {"user_id": 336073, "username": "Rabia"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 227784, "username": "snake_rattler"}]}
  },
  "Krilowatt": {
    "comments": "<h1>Checks and Counters</h1> <p><strong>Ferrothorn</strong>: Ferrothorn is Krilowatt's most notable counter because it resists both of its STAB types, threatens it with Knock Off and Power Whip, and can set Spikes on it.</p> <p><strong>Knock Off</strong>: Krilowatt relies immensely on its Life Orb to deal meaningful damage; accordingly, Knock Off users like Clefable, Tornadus-T, and Ferrothorn force it out. Assault Vest Tornadus deserves special mention as a check, as it can easily switch into Surf or Ice Beam and keep itself healthy with Regenerator.</p> <p><strong>Specially Bulky Pokemon: Galarian Slowking and Astrolotl can easily switch into any of Krilowatt's attacks and initiate Future Sight or deal notable damage with Stomping Tantrum. Blissey can shrug off any of Krilowatt's attacks and either set up Stealth Rock on it or slow pivot with Teleport.</p> <p><strong>Offensive Grass-types: Rillaboom and Choice Scarf Jumbao force Krilowatt out with their super effective Grass-type moves. While they both can effectively switch into Thunderbolt and Surf, neither appreciates taking more than one Ice Beam. Kartana also forces Krilowatt out, but it cannot switch into Krilowatt's special attacks safely.</p> <p><strong>Gastrodon: Though niche, Gastrodon hard counters Krilowatt, as it is immune to both of Krilowatt's STAB types due to its Ground typing and Storm Drain.</p> ",
    "sets": [
      {
        "name": "Offensive Pivot",
        "description": "<p>Krilowatt's strength lies in forcing damage onto foes with its Life Orb-boosted STAB pivot moves. Its good natural bulk and immunity to entry hazard damage let it tank at least one strong hit a game while firing back with its attack of choice. The combination of Volt Switch and Flip Turn lets Krilowatt pivot on essentially every Pokemon in the tier, dealing notable damage to defensive Pokemon like Landorus-T and Toxapex in the process. Flip Turn can be dropped for Surf if hitting Heatran and Equilibra harder is desired; however, due to Krilowatt's inability to OHKO either, it is usually better to just use Flip Turn. Ice Beam hits Ground- and Grass-types like Garchomp and Jumbao super effectively. Ice Beam also importantly targets Zapdos, which can switch into Krilowatt's STAB options.</p> <p>Krilowatt is incredibly dependent on its Life Orb in order to function properly, so pairing it with a Knock Off absorber like Clefable or Corviknight is imperative. Clefable can support Krilowatt by providing Stealth Rock, further chipping the Pokemon that switch into its pivoting moves, while Corviknight can slowly pivot Krilowatt onto the field, preserving its HP. Tapu Koko is an excellent offensive partner that appreciates Krilowatt consistently chipping and KOing Ground-types with Flip Turn and Ice Beam. Tapu Koko also provides Krilowatt with Electric Terrain, notably powering up its Thunderbolt. Other offensive pivots like Dragapult, Victini, and Galarian Zapdos form strong VoltTurn cores with Krilowatt while all threatening one of Krilowatt's most consistent switch-ins: Ferrothorn. Astrolotl is another Pokemon that Krilowatt struggles to break through; accordingly, Pokemon like Air Balloon Heatran and Pajantom are excellent teammates to switch into Astrolotl and force it out.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 251944, "username": "spoo"}, {"user_id": 273339, "username": "Lasen"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 277988, "username": "dex"}]}
  },
  "Voodoom": {"sets": [{"name": "Nasty Plot"}]},
  "Tomohawk": {
    "comments": "<h1>Other Options</h1> <p>Toxic can be run on Tomohawk's Intimidate set to punish Zapdos and Tornadus-T; however, it is incredibly difficult to justify using it over Aura Sphere or Stealth Rock. Tomohawk can run a dedicated Stealth Rock lead set on hyper offense teams with Prankster using Healing Wish, Taunt, and Rapid Spin, ensuring that Stealth Rock stays up while denying the opponent from both setting and removing entry hazards; however, this set is generally seen as gimmicky and is usually accomplished better by Landorus-T.</p> <h1>Checks and Counters</h1> <p><strong>Flying-types: Zapdos, Corviknight, and Tornadus-T can easily switch into Tomohawk, remove Stealth Rock with Defog, and force it out with Hurricane or Brave Bird. Galarian Zapdos cleanly OHKOes Tomohawk and can gain a Defiant boost from Intimidate on a predicted switch, though it cannot safely switch in. Both Venomicon formes threaten Tomohawk, though Venomicon-E is easily chipped.</p> <p><strong>Fairy-types: Tapu Fini, Clefable, Jumbao, and Tapu Lele all force Tomohawk out with Moonblast. The latter two do not enjoy switching into Hurricane, however.</p> <p><strong>Electric-types: Zeraora, Tapu Koko, Magnezone, and Krilowatt all threaten Tomohawk with their super effective Electric-type STAB moves. Tapu Koko, in particular, resists both of Tomohawk's STAB options and can heal off its weak attacks with Roost.</p> <p><strong>Ice-types: Weavile is one of the most notable physical attackers that Tomohawk cannot check. It must be wary about repeatedly activating Tomohawk's Rocky Helmet, however. Hail teams often render Tomohawk incapable of checking anything due to how well Alolan Ninetales and Arctozolt match up against it.</p> <p><strong>Special Wallbreakers: Strong special attackers like Dragapult and Blacephalon can break through Tomohawk with little to no support.</p> <p><strong>Special Walls: Special walls like Galarian Slowking, Toxapex, and Blissey take little to no damage from Tomohawk and force it out with the threat of Future Sight and status.</p> <p><strong>Toxic: Tomohawk is easily worn down by Toxic. Melmetal, Colossoil, Landorus-T, and Garchomp can all bait Tomohawk in and cripple it with the move.</p> ",
    "sets": [
      {
        "name": "IntimHawk",
        "description": "<p>Tomohawk's role compression, excellent bulk, and Intimidate allow it to check a myriad of physical attackers such as Rillaboom, Kartana, and Revenankh. Despite these attributes, Tomohawk struggles due to how common Flying-types are in the tier and its inability to switch into some of the metagame's most common physical attackers, such as Zeraora, Venomicon-E, and Weavile. It has excellent neutral coverage with Hurricane and Aura Sphere, and these moves hit the aforementioned physical attackers it checks, along with others like Urshifu-R and Melmetal, super effectively. Tomohawk is an adequate Stealth Rock setter, though common Defoggers like Zapdos and Tornadus-T force it out. Similarly, it can utilize Rapid Spin, though entry hazard setters like Clefable and Astrolotl fear little from it, and others like Landorus-T and Heatran can cripple it with Toxic.</p> <p>While Tomohawk is a passable wall, it is incapable of checking some of the more prevalent physical attackers in the tier, such as Zeraora, Weavile, and Venomicon-E. Therefore, alternative defensive options like Toxapex, Ferrothorn, and Zapdos are must-haves alongside it. Equilibra and Heatran are intriguing partners that can switch into the strong Fairy- and Psychic-type attacks that plague Tomohawk; they also form nice defensive entry hazard setting and removing cores. Ground-types such as Landorus-T, Garchomp, and Colossoil are helpful as checks to Electric-types like Tapu Koko, Zeraora, and Zapdos, with Garchomp and Landorus-T taking some of the burden off of Tomohawk to check physical threats and Colossoil taking on special attackers like Dragapult and Heatran that pressure it. Tomohawk must be paired with a check to Flying-types, as it often invites in Zapdos and Tornadus-T; accordingly, Zapdos, Zeraora, Tapu Koko, and Weavile all make for good partners.</p> "
      },
      {
        "name": "HazeHawk",
        "description": "<p>This set makes use of a unique trait that Tomohawk possesses: Prankster Haze. This lets Tomohawk act as a backstop against setup sweepers like Kartana, Garchomp, and Cawmodore. Prankster also gives Roost priority, allowing Tomohawk to check Urshifu-R by racking up Rocky Helmet chip damage and lessen the damage it takes from Zeraora's Electric-type moves. However, due to it lacking Intimidate, this set performs much worse in the face of strong physical wallbreakers like Melmetal. Haze also leaves Tomohawk with only one available moveslot to choose between Stealth Rock, Rapid Spin, and Aura Sphere, leaving it deficient in either its coverage or utility. Tomohawk can set and remove entry hazards on physical attackers like Kartana and Rillaboom; however, it is forced out by common Defoggers like Zapdos and Tornadus-T and Stealth Rock setters like Landorus-T and Heatran. Alternatively, Aura Sphere can be run to not be useless against Steel-types like Heatran and Melmetal; however, this takes away from the role compression that justifies Tomohawk's use in the first place.</p> <p>HazeHawk is best used on teams that are weak to a particular setup sweeper. Ground-types like Landorus-T and Equilibra can switch into Electric-types like Zeraora and Tapu Koko for Tomohawk and appreciate it checking Cawmodore. Additionally, Landorus-T and Equilibra provide Stealth Rock and Rapid Spin, respectively, freeing Tomohawk to run Aura Sphere. Tapu Fini enjoys Tomohawk's ability to check Swords Dance Kartana and Ferrothorn, and in return it deals with Weavile. Specially defensive Pokemon like Blissey, Slowking, and Toxapex are excellent teammates, as they can deal with the many special attackers that threaten Tomohawk like Dragapult, Tapu Lele, and Tornadus-T. Furthermore, this Tomohawk set is walled by Heatran if it's not running Aura Sphere, making consistent switch-ins to it like Astrolotl and Colossoil mandatory.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 273339, "username": "Lasen"}, {"user_id": 251944, "username": "spoo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 277988, "username": "dex"}]}
  },
  "Necturna": {
    "comments": "<h1>Checks and Counters</h1> <p><strong>Specially Bulky Pokemon</strong>: Specially bulky Pokemon such as Melmetal and Kyurem can switch in freely on Necturna's setup turn and force it out without being afraid of its attacks.</p> <p><strong>Revenge Killers: Even after Geomancy's boost, Necturna is only moderately fast, and thus Choice Scarf holders like Landorus-T, Victini, and Crucibelle are able to significantly weaken or revenge kill it.</p> <p><strong>Dark-types: Hydreigon, Tyranitar, and Mandibuzz can all take Necturna's STAB moves and threaten it with their own. Weavile and Bisharp can pick off a weakened Necturna with their STAB priority moves in Ice Shard and Sucker Punch, and they can both take a boosted Giga Drain to fire off a stronger physical attack if needed.</p> <p><strong>Flying-types: Corviknight can take any hit from Necturna and OHKO with Brave Bird, while special attackers such as Zapdos, Tornadus-T, and Tomohawk can take an attack and hit it back, but all are within 2HKO range. Tomohawk also has the option of running Prankster Haze to remove Necturna's boosts.</p> <p><strong>Fire-types: Bulky Fire-types like Astrolotl and Heatran have enough bulk to take Necturna's hits and deal heavy damage or status it, with Heatran also having Roar. Moltres can tank a hit and lower Necturna's Special Attack with Mystical Fire.</p> <p><strong>Haze and Phazing: Since Power Herb makes Geomancy pretty much single-use, Haze Toxapex and Tomohawk can effectively neuter Necturna, and both can take any boosted hit. Toxapex has to be wary of the rare Psychic set, though.</p> ",
    "sets": [
      {
        "name": "Geomancy",
        "description": "<h1>Set Details</h1> <p>Necturna is a potent wallbreaker that fits on hyper offense teams, serving both as a spinblocker and setup sweeper. Geomancy opportunities aren't abundant due to Necturna's low Speed, but its good bulk lets it set up on weak non-super effective attacks and against common Choice item users like Landorus-T and Jumbao locked into their STAB moves. Giga Drain lets Necturna stay healthy thanks in part to its low base HP, making it harder to revenge kill through chip damage. Substitute is a good way to block Toxic or Thunder Wave from walls such as Blissey and Ferrothorn and safely set up if the opponent switches into something that threatens it. A Modest nature is used to maximize Necturna's otherwise weak damage output while still outspeeding Zeraora after boosting, but this leaves it slower than Choice Scarf Landorus-T and Colossoil. Psychic is an option over Substitute to OHKO Tomohawk at +2 and break past Haze Toxapex; however, this compromise leaves Necturna far easier to dispatch of in the majority of situations.</p> <p>Necturna needs to be part of a very offensive team to function best. Dual screens support from Regieleki or Tapu Koko ensures it can get an opportunity to set up. Necturna is also heavily threatened by Fire-types like Heatran and Astrolotl, so Ground-types like Garchomp are a perfect match, being able to deal with them and Toxapex alike, while Necturna can overwhelm common physical walls like Tomohawk and Clefable. Volcarona and Necturna form a good core, overwhelming their common checks in Heatran and Tyranitar with very powerful attacks, and Volcarona also appreciates Necturna using Blissey as setup fodder. Choice Scarf Aurumoth can sacrifice itself with Final Gambit to remove one of the special walls it invites in, which conveniently also block Necturna's path.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 227784, "username": "snake_rattler"}, {"user_id": 251944, "username": "spoo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 273339, "username": "Lasen"}]}
  },
  "Mollux": {
    "sets": [
      {
        "name": "Calm Mind",
        "description": "<p>The main strength of Mollux lies in its ability to safely switch in and pressure Fairy-types such as Clefable and Jumbao. Its good bulk alongside a wide range of resistances allows it to check many special threats such as Dragapult, Tapu Fini, and Volcarona. Its immunity to Water-type attacks provided by Dry Skin allows Mollux to also check threats like Urshifu-R and Barraskewda. However, the downside to Dry Skin is that Mollux will take residual damage every turn under sun, so it won't be able to check Fire-type attackers. While serving as a wall, Mollux can also be very threatening because very few Pokemon can resist its two STAB moves and it can spread status easily thanks to Sludge Bomb and Lava Plume. Calm Mind allows Mollux to make the most of this asset, making it all the more threatening and allowing it to check Calm Mind Clefable. 8 Speed EVs allow Mollux to allways outspeed Adamant Conkeldurr.</p> <p>Mollux's key weakness to Stealth Rock forces it to run Heavy-Duty Boots, making it prone to Knock Off. Therefore, it will be forced out against common Knock Off users like Toxapex and Arghonaut.</p> <p>Mollux is a good partner for Corviknight and Equilibra, as their typings defensively complement each other perfectly; both are immune to Ground-type attacks that Mollux is weak to, while Mollux acts as a Fire- and Water-type switch-in. They can also provide hazard removal to clear Stealth Rock away in case Mollux loses Heavy-Duty Boots. Tomohawk and Arghonaut prevent physical attackers like Landorus-T and Colossoil from taking advantage of Mollux. Pokemon that struggle against Clefable like Hydreigon, Kyurem, Dragapult, and Mandibuzz pair well with Mollux, as Mollux counters it. Kyurem and Hydreigon are also good to punish Ground-types like Landorus-T and Hippowdon that annoy Mollux. Grass Knot Zeraora and Toxic Smokomodo are also good options to pressure Ground-types and can help Mollux to sweep. Finally, Dragapult appreciates particularly the status Mollux spreads, potentially allowing it to sweep with Hex late-game.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 208105, "username": "Jho"}, {"user_id": 297859, "username": "quziel"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}]}], "writtenBy": [{"user_id": 450411, "username": "Atha"}]}
  },
  "Aurumoth": {
    "comments": "<h1>Checks and Counters</h1> <p><strong>Bulky Flying-types</strong>: Tornadus-T, Dragonite, Galarian Moltres, and Zapdos can take any unboosted hit from Nasty Plot Aurumoth and threaten to OHKO with their STAB moves. Landorus-T can live a +2 Psyshock and cripple Aurumoth with Toxic, KO it with Stone Edge, or do respectable damage with U-turn.</p> <p><strong>Bulky Steel-types: Heatran, Scizor, Corviknight, and Assault Vest Melmetal can all take a hit from Aurumoth and threaten back with their strong attacks.</p> <p><strong>Faster Pokemon: Dragapult, Weavile, Urshifu-R, and Venomicon-E can all outspeed and threaten to OHKO. None of them can switch in safely, however, nor can they beat Aurumoth if Weak Armor has boosted its Speed.</p> <p><strong>Entry Hazards: Aurumoth is susceptible to all entry hazards and is weak to Stealth Rock, limiting the chances it gets to sweep.</p> <p><strong>Unaware Pokemon</strong>: Unaware Clefable can take any of Aurumoth's attacks and slowly beat it with Moonblast and its recovery options. Unaware Arghonaut can phaze Aurumoth if needed, but it takes respectable damage from Psyshock.</p> ",
    "sets": [
      {
        "name": "Final Gambit",
        "description": "<h1>Set Details</h1> <p>This Aurumoth set is exclusively seen on hyper offense builds for removing one of the opponent's walls so that its teammates can set up and sweep more reliably. Final Gambit allows Aurumoth to sacrifice itself to deal damage equal to its HP value, and very few Pokemon in the metagame can stomach it without getting OHKOed. Trick is useful in potentially crippling one of the opponent's walls if Aurumoth's HP is not enough to net a KO. Healing Wish allows Aurumoth to completely heal a teammate at low HP so that it can attempt to sweep once more. Blizzard is the sole attack, 2HKOing the two most relevant Ghost-types in Dragapult and Pajantom. Choice Scarf is necessary to outspeed as much of the metagame as possible. Maximizing HP is also important, as it allows Aurumoth to KO Arghonaut, Buzzwole, and do the most damage to Melmetal with Final Gambit.</p> <p>Strong setup sweepers such as Cawmodore, Weavile, and Volcarona are good partners, with Aurumoth paving the way for them to sweep after using Final Gambit. Victini can also run a Choice Scarf Final Gambit set to double down on the self-sacrifice route, with Swords Dance Explosion Landorus-T playing a very similar role. Dual screens setters such as Regieleki and Tapu Koko are also good teammates for the teams that Aurumoth slots into, while Alolan Ninetales does much the same as well. Galarian Moltres and Weavile can take advantage of the Ghost-types that are immune to Final Gambit, resisting their STAB attacks and using them as opportunities to use their boosting moves.</p> "
      },
      {
        "name": "Nasty Plot",
        "description": "<h1>Set Details</h1> <p>Nasty Plot can turn Aurumoth into a decent setup sweeper, threatening common walls such as Toxapex and Slowbro but relying heavily on proper prediction to do so. When backed up by Weakness Policy and Weak Armor, Aurumoth can use its multiple weaknesses to common physical moves such as Knock Off and U-turn to instantly become a terrifying sweeper. Psyshock allows Aurumoth to hit Blissey and Galarian Slowking harder than Psychic would. Thunder OHKOes Tornadus-T and Corviknight after a boost while also dealing with bulky Water-types like Tapu Fini and Slowbro. Focus Blast is necessary for breaking past Steel-types like Heatran, Ferrothorn, Equilibra, and Melmetal. A Timid nature is chosen over Modest so that unboosted Aurumoth can outspeed standard Colossoil as well as Modest Tapu Lele. It also allows Aurumoth to outspeed Excadrill in sand after a Weak Armor activation.</p> <p>Aurumoth requires extensive support to be able to sweep. Dual screens or Aurora Veil support from Tapu Koko or Alolan Ninetales, respectively, gives it more opportunities to set up without being afraid of being OHKOed. With Aurumoth inviting in various Flying-types such as Tornadus-T and Zapdos, Bulk Up Zeraora can easily threaten or dispose of them. Mew can set up Spikes and Stealth Rock to weaken Aurumoth's checks, putting Galarian Slowking in OHKO range after taking damage from both entry hazards. Cawmodore and Hawlucha can help overwhelm many of Aurumoth's answers like Arghonaut and Zapdos if they are able to set up.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 251944, "username": "spoo"}, {"user_id": 336073, "username": "Rabia"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}]}], "writtenBy": [{"user_id": 273339, "username": "Lasen"}]}
  },
  "Malaconda": {"sets": [{"name": "Sun Setter"}]},
  "Cawmodore": {
    "comments": "<h1>Checks and Counters</h1> <p><strong>Faster Offensive Threats</strong>: Pokemon like Dragapult, Choice Scarf Astrolotl, Choice Scarf Blacephalon, and Tornadus-T are faster than Cawmodore, can take a Bullet Punch at full health, and can OHKO back with their Fire-type moves.</p> <p><strong>Bulky Electric-Types: Cyclohm is easily one of the best Cawmodore checks, as it can take every attack that Cawmodore can use and OHKO back with Fire Blast. Zapdos does much the same, though it must be running moderate SpA investment to always OHKO with Heat Wave. Both Pokemon are also able to heal back the damage taken with their recovery moves.</p> <p><strong>Setup Prevention: Faster Taunt users like Tapu Koko can prevent Cawmodore from setting up with Belly Drum, while Haze from Prankster Tomohawk can remove the boosts from Belly Drum. Toxapex can also use Haze to remove Cawmodore's boosts if its Attack has been lowered by a teammate with Intimidate like Landorus-T.</p> <p><strong>Unaware Users: Bulky Unaware users like Clefable take relatively little damage from Cawmodore's attacks and can stall it out. Thanks to Unaware, Arghonaut can survive Acrobatics from full HP, phaze Cawmodore with Circle Throw, and heal with Recover.</p> ",
    "sets": [
      {
        "name": "Belly Drum Sweeper",
        "description": "<h1>Set Details</h1> <p>Cawmodore is a very simple Pokemon with a very simple strategy: set up with Belly Drum and sweep. Its high Speed tier, access to priority, and huge Attack stat after a Belly Drum mean that a +6 Cawmodore acts as an amazing late-game sweeper with very few checks and even fewer counters. All of the above characteristics make it a strong option on CAP hyper-offense teams. Drain Punch is the preferred coverage option, as it allows Cawmodore to beat Pokemon like Ferrothorn and Heatran and increases its overall longevity. However, Knock Off is an option that allows Cawmodore to beat some of its potential checks like Rotom-W and offensive Zapdos. 4 EVs in HP allow Cawmodore to activate Sitrus Berry after a Belly Drum, while 24 EVs in SpD allow Cawmodore to always live an univested Heat Wave from Zapdos at full health, letting Cawmodore have a better chance at beating it using the HP recovery from Drain Punch and Acrobatics.</p> <p>Cawmodore heavily dislikes taking damage on the switch and wants to be as healthy as possible before using Belly Drum, so Pokemon that can set dual screens or Aurora Veil for it like Tapu Koko or Alolan Ninetales, respectively, are good teammates. Taunt Tapu Koko's ability to deny entry hazards is very much appreciated as well, as Cawmodore should ideally be at full health before setting up. Furthermore, Taunt Tapu Koko can shut down and beat some of the major Defoggers in the metagame like Corviknight and Tornadus-T. Setup sweepers like Garchomp and Weavile are solid teammates for Cawmodore on hyper offense teams, as they can punch holes in opposing walls and make it easier for it to clean late-game and vice versa. Finally, other Flying-types like Galarian Moltres, Hawlucha, and Venomicon-E are some of Cawmodore's best teammates, as they are extremely effective at overwhelming an opponent's Flying-type checks when used in tandem.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 73006, "username": "Voltage"}, {"user_id": 336073, "username": "Rabia"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}]}], "writtenBy": [{"user_id": 455611, "username": "Zephyri"}]}
  },
  "Volkraken": {
    "comments": "<h1>Checks and Counters</h1> <p><strong>Bulky Water-types</strong>: Because Water-types resist both of Volkraken's STAB options, Pokemon like Slowking, Gastrodon, and Toxapex are some of the best answers available to Volkraken. Tapu Fini can also work here, but its lack of consistent recovery can make it easily worn down by Analytic-boosted attacks.</p> <p><strong>Fast Electric-types: Fast Electric-types can take advantage of Volkraken's middling Speed to force it out. Zeraora, Tapu Koko, and Krilowatt are all good options in this regard, though it should be known that Thunderbolt from Tapu Koko and Krilowatt is not a guaranteed KO from full on Volkraken, while Scorching Sands threatens an OHKO on both.</p> <p><strong>Stealth Rock: Since Volkraken foregoes Heavy-Duty Boots in favor of Choice Specs, opponents can exploit its weakness to Stealth Rock. Some of the best users of this move are Swampert and Tomohawk.</p> <p><strong>Specially Bulky Pokemon: Though Volkraken hits quite hard, it cannot break certain specially bulky walls outside of rain. This is compounded by its reliance on moves that have imperfect accuracy. Therefore, Pokemon like Blissey and Galarian Slowking are viable checks to Volkraken.</p> ",
    "sets": [
      {
        "name": "Choice Specs",
        "description": "<h1>Set Details</h1> <p>Volkraken's place in the CAP metagame is tenuous to say the least. While at first glance Volkraken's monstrous 135 Special Attack stat and respectable 100/80/100 bulk seem quite good, it is easily revenge killed, often chipped by entry hazards and pivots, and walled by one of the best Pokemon in the tier: Slowking. That being said, given the right team support, Volkraken can turn into a relatively strong special breaker with the somewhat unique ability to pressure all three of Tomohawk, Equilibra, and Heatran at once. Furthermore, Volkraken's access to Analytic can make switching into it quite terrifying. Fire Blast and Hydro Pump is a near-unique STAB combination in the CAP metagame that can prove to be difficult for some teams to deal with, picking up 2HKOs on the common Tomohawk + Equilibra core. Scorching Sands is by far the best option for the third slot, as it 2HKOes Toxapex and is a roll to OHKO Krilowatt. U-turn is used over Flip Turn to avoid losing momentum against Storm Drain Gastrodon. U-turn additionally chunks Slowking more than Flip Turn. Another option for Volkraken is to run Choice Scarf, which can give it an easier time fitting on teams, though the drop in power is quite noticeable.</p> <p>Volkraken appreciates anything that can help it get in against a foe that is forced to switch out so as to activate Analytic. Accordingly, it enjoys pivots like Kerfluffle, Tapu Koko, and Rillaboom, which appreciate Volkraken's raw breaking power and ability to pivot itself. Rillaboom deserves special mention for consistently beating Volkraken's two biggest counters: Slowking and Gastrodon. Dragapult is another notable pivot that can break through Slowking and appreciates Volkraken pressuring Clefable. Volkraken's ability to wallbreak is further amplified under rain, with nothing in the metagame other than Slowking being able to tank two Hydro Pumps in rain. Therefore, Pelipper and Barraskewda make excellent teammates for Volkraken. Entry hazard removal is key for Volkraken to operate well as it foregoes Heavy-Duty Boots for the power of Choice Specs, so Pokemon such as Equilibra and pivot Tornadus-T are important. Pokemon such as Landorus-T, Zeraora, and Melmetal that need the Tomohawk + Equilibra core to be pressured appreciate Volkraken's ability to dish out heavy damage to teams using this defensive backbone. Miasmaw, particularly the Taunt set, deserves a special mention as a teammate for its unique ability to deny Slowking and Toxapex Regenerator recovery. Finally, setup sweepers like Garchomp and Kartana that require chip damage on Pokemon such as Toxapex and Equilibra to win appreciate Volkraken's ability to force heavy damage on the opponent's team.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 22784, "username": "snake_rattler"}, {"user_id": 297859, "username": "quziel"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 277988, "username": "dex"}]}
  },
  "Plasmanta": {"sets": [{"name": "Magnet Rise"}]},
  "Naviathan": {
    "comments": "<h1>Checks and Counters</h1> <p><strong>Bulky Water-types</strong>: Arghonaut can take any hit from Naviathan and phaze it with Circle Throw. Toxapex can remove Naviathan's boosts with Haze and use Recover to regain all of its HP while Naviathan's HP gets whittled away by burn. Tapu Fini can come in on Naviathan and deny it its Guts boost with Misty Surge and bring it in range of revenge killers with Nature's Madness. Slowbro shrugs off any hit and can use Body Press to pressure Naviathan.</p> <p><strong>Ferrothorn: Ferrothorn can take on most of Naviathan's hits and use either Leech Seed to recover its HP or Body Press, which 2HKOes it.</p> <p><strong>Strong Revenge Killers</strong>: Rillaboom and Revenankh can pick off Naviathan if it's been sufficiently chipped with their strong priority moves. Neither one wants to take a hit from it, though. If Naviathan hasn't boosted itself with Dragon Dance, Zeraora, Urshifu-R, and Garchomp can all threaten to OHKO. Dragapult resists Waterfall and is unaffected by Facade, so it can threaten it with Shadow Ball, but it must be careful of sets utilizing a coverage move such as Icicle Crash.</p> <p><strong>Knock Off: If Naviathan's Guts isn't active, Tornadus-T, Clefable, and Toxapex can all use Knock Off to remove its Flame Orb, effectively neutering it.</p> ",
    "sets": [
      {
        "name": "Dragon Dance",
        "description": "<h1>Set Details</h1> <p>Naviathan is a decent setup sweeper able to break through common walls such as Clefable, Heatran, and Slowking thanks to its combination of Dragon Dance and Guts. However, its lack of good coverage options and middling Speed leave it outclassed by Garchomp and Weavile. Also, the combination of chip from Rocky Helmet users and burn damage from Flame Orb means it quickly gets worn down despite access to Slack Off. Facade provides some much needed coverage against defensive Water-types. After a Dragon Dance, it can OHKO Slowking and 2HKO Tapu Fini and non-Haze Toxapex. Slack Off keeps Naviathan healthy so that it can get more opportunities to set up, allowing it to take advantage of mostly passive balance teams and remain healthy. Icicle Crash is an option to hit Ferrothorn, 2HKO Zapdos, and OHKO Dragapult, but it leaves Naviathan more susceptible to being revenge killed. A Jolly nature is used to outspeed Choice Scarf Jumbao and Arctozolt in hail after a Dragon Dance.</p> <p>Naviathan needs its Flame Orb to activate to effectively wallbreak, so teammates that give it safe switch-ins and can deter Knock Off are appreciated. Dragapult can pivot with U-turn to bring Naviathan in on Clefable, Heatran, and Tornadus-T. It also can help deal with Arghonaut and Ferrothorn, which otherwise completely wall Naviathan. Magnezone can trap Ferrothorn and Corviknight and remove them altogether. Rillaboom helps mitigate Naviathan's weakness to Earthquake and picks off weakened targets that Naviathan couldn't KO. It also helps deal with Tapu Fini. Stealth Rock setters like Landorus-T and Heatran and Spikes setters like Astrolotl can help rack up damage to help Naviathan get KOs. Heatran can also act as a Dragapult switch-in that can also force Ferrothorn out.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 336073, "username": "Rabia"}, {"user_id": 277988, "username": "dex"}]}, {"name": "Grammar checked by", "members": [{"user_id": 24732, "username": "Estronic"}]}], "writtenBy": [{"user_id": 273339, "username": "Lasen"}]}
  },
  "Crucibelle": {
    "comments": "<h1>Other Options</h1> <p>Using Black Sludge over Choice Scarf further cripples defensive Steel-types while giving Crucibelle a better matchup against Zapdos; however, this severely worsens the Astrolotl and Volcarona matchups for Crucibelle, as Stomping Tantrum and +1 Psychic, respectively, will almost always OHKO it.</p> <h1>Checks and Counters</h1> <p><strong>Ground-types: Pokemon such as Landorus-T, Garchomp, Equilibra, and Hippowdon all make for good Crucibelle counters. Landorus-T and Garchomp deserve special mention as they don't mind receiving a Choice Scarf as much as the other two, though they also find themselves worn down much more easily.</p> <p><strong>Steel-types: Melmetal, Ferrothorn, Corviknight, Magnezone, and Skarmory all can sponge any of Crucibelle's attacks while forcing it out. However, none of these Pokemon appreciate receiving a Choice Scarf.</p> <p><strong>Physically Defensive Pivots: Slowbro, Buzzwole, Arghonaut, and Toxapex can easily take any hit Crucibelle throws at them and force it out. The former three do need to be wary of Gunk Shot's poison chance, however.</p> <p><strong>Faster Pokemon and Priority: Choice Scarf Kartana and Astrolotl will always outspeed Crucibelle, while other fast threats like Dragapult, Zeraora, and Choice Scarf Tapu Lele hassle Crucibelle after it uses Trick. Users of strong priority such as Rillaboom, Scizor, and Urshifu-R force Crucibelle out without allowing it to safely bring in a check via U-turn.</p> ",
    "sets": [
      {
        "name": "Choice Scarf",
        "description": "<h1>Set Details</h1> <p>Crucibelle has a difficult time finding a place in the metagame. Its STAB combination is walled by the tier's multiple defensive Steel-types and it often lacks the power to make significant progress against a team. However, it has a niche as a Trick + Choice Scarf user that can bait in bulky Steel-types like Corviknight and Equilibra and cripple them, as well as being able to revenge kill Volcarona at +1 Speed. Stone Edge takes up the first moveslot, allowing Crucibelle to act as a solid check to Volcarona and Flying-types like Tornadus-T, Venomicon-E, and Zapdos. Trick is the main attraction of this set, used to bait in and cripple Toxapex and Steel-types like Ferrothorn, Equilibra, and Corviknight. U-turn is used to keep momentum and regain health through Regenerator. Gunk Shot hits the multitude of Fairy-types in the tier, reaching OHKOs on Tapu Lele, Tapu Koko, offensive Tapu Fini, forcing out Calm Mind Clefable, and spreading Poison to foes like Landorus-T. If checking Fairy-types is not needed, Stealth Rock or Toxic Spikes can be run depending on the team's needs.</p> <p>Pokemon such as Kartana and Melmetal that appreciate Crucibelle checking Volcarona and Flying-types make great partners. Crucibelle's ability to cripple Toxapex and Ferrothorn with Trick makes Dragonite, Tapu Fini, and Urshifu-R solid teammates. Crucibelle makes for a solid addition to most pivot cores, so Pokemon like Zeraora, Krilowatt, Zapdos, and Slowbro all make for excellent choices. Slowbro deserves special mention for getting Crucibelle in safely via Teleport while also providing Future Sight support. Pokemon such as Dragapult and Weavile appreciate Crucibelle pivoting them in and forcing out Fairy-types.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 297859, "username": "quziel"}, {"user_id": 251944, "username": "spoo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 277988, "username": "dex"}]}
  },
  "Kerfluffle": {
    "comments": "<h1>Checks and Counters</h1> <p><strong>Poison-types</strong>: Toxapex, Galarian Slowking, and Venomicon are three of the most reliable counters to Kerfluffle. They are able to freely come in on resisted Fairy- and Fighting-type moves, threaten to cripple or outright KO Kerfluffle, and the former two can heal off any damage as they switch out. Venomicon-E does much the same, though it suffers from issues of frailty and vulernability to Stealth Rock. While less viable, other bulky Poison-types such as Amoonguss and Mollux are good checks as well.</p> <p><strong>Other Pokemon with Regenerator: Assault Vest Tornadus-T in particular is a great switch-in, taking little from any of Kerfluffle's moves and threatening to outspeed and KO. Slowking also doesn't fear any of Kerfluffle's moves, able to easily switch in and get a valuable opportunity to use Future Sight or Teleport. Astrolotl can switch in and scout Choice Specs Kerfluffle and then pivot to an appropriate answer, but it must be at high health to do so.</p> <p><strong>Bulky Steel-types: Corviknight and Scizor can both reliably switch into Kerfluffle due to their great special bulk, Fighting-type neutrality, and access to reliable recovery. Aegislash fears little from any of Kerfluffle's moves, though it's still prone to getting worn down over time. Other Steel-types like Heatran and Ferrothorn are excellent sponges for Kerfluffle's Moonblast after it has been scouted by another teammate.</p> <p><strong>Faster Offensive Threats: Choice Scarf users that are and capable of KOing Kerfluffle such as Tapu Lele, Tapu Fini, Jumbao, and Kartana are all potent offensive checks. Even Pokemon like Dragapult, Tapu Koko, and Zeraora can threaten to KO Kerfluffle with prior chip damage.</p> ",
    "sets": [
      {
        "name": "Choice Specs",
        "description": "<h1>Set Details</h1> <p>Kerfluffle's strong STAB combination of Fairy and Fighting along with its great offensive stats and access to Parting Shot is a compelling combination on paper; however, Kerfluffle's lacking Speed and poor perfomance against many of the tier's top walls make it an inconsistent option in practice. Moonblast is Kerfluffle's most reliable and spammable STAB move, and when paired with Focus Blast and Aura Sphere, Kerfluffle can easily bypass opposing bulky Steel-types like Equilibra and Heatran and pose a huge threat to teams that rely on these Pokemon to check Fairy-types. Despite its low-Base Power, Aura Sphere is often convenient in situations where you don't want to risk missing a Focus Blast, though Sludge Bomb can still be useful against certain Fairy-types like Clefable, Jumbao, and Tapu Fini. Parting Shot is great at grabbing momentum and safely bringing in teammates, and it also lowers the power of Future Sight from an incoming Galarian Slowking.</p> <p>Despite Kerfluffle's strengths, it ultimately struggles to break past many common Poison-types and finds itself easily revenge killed due its relative lack of OHKO power and being Choice locked into moves. Ground-types like Landorus-T, Colossoil, Equilibra, and Garchomp are generally effective partners for these reasons, as they can threaten many of the Pokemon that wall Kerfluffle's STABs. All three of these Pokemon can also remove hazards to keep Kerfluffle healthy, while Equilibra can set Doom Desire to deny Pokemon like Tornadus-T and Clefable from safely switching into Kerfluffle's Fighting-type moves. Slowbro and Slowking offer similar support with FuturePort, a strategy that has incredible synergy with Kerfluffle and is the only consistent way it can break past Toxapex and Venomicon. Another great Future Sight setter is Galarian Slowking, though it unfortunately can't use Teleport to safely bring Kerfluffle in. Spikes support from teammates like Astrolotl and Ferrothorn is great for Kerfluffle, as it can struggle to OHKO opposing Pokemon but is still good at repeatedly forcing switches; Spikes additionally help Kerfluffle break past its checks in the long run by forcing damage on Pokemon like Galarian Slowking and Toxapex, which would otherwise be able to recover their HP through Regenerator. Slower wallbreakers that appreciate being brought in for free with Parting Shot such as Melmetal also tend to have great synergy with Kerfluffle.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 227784, "username": "snake_rattler"}, {"user_id": 73006, "username": "-Voltage-"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}]}], "writtenBy": [{"user_id": 251944, "username": "spoo"}]}
  },
  "Pajantom": {
    "comments": "<h1>Checks and Counters</h1> <p><strong>Physical Walls</strong>: Tomohawk and Buzzwole are two of the best switch-ins to Choice Band sets unless it has been previously afflicted with poison. Other physically bulky Pokemon such as Clefable, Corviknight, Toxapex, Landorus-T, and Ferrothorn can switch into Pajantom and threaten it out if they're at full health, but they may find themselves easily worn down into 2HKO range of Choice Band Spirit Shackle. Skarmory can freely switch into Pajantom and use the opportunity to set Spikes.</p> <p><strong>Knock Off: Pokemon like Zeraora, Tornadus-T, Rillaboom, and Toxapex are all good users of Knock Off, with even the weakest among them still being able to deal significant damage. Pajantom isn't strong enough to reliably trap and eliminate opposing targets if it loses its item, so any Knock Off user is capable of effectively neutering it for the rest of the game.</p> <p><strong>Bulky Attackers: Anything that's capable of taking a hit from Pajantom and OHKOing in return can easily force it out. Melmetal, Landorus-T, Jumbao, and Tyranitar can all survive most of Pajantom's attacks from full health and threaten back with an immediate KO or an OHKO after minimal chip damage. However, these Pokemon don't have the bulk to switch directly into it and may still find themselves worn down over the course of a game.</p> <p><strong>Faster Pokemon: Pokemon that outspeed Pajantom and can KO it like Weavile, Dragapult, Kerfluffle, and Zeraora make for good offensive checks. Choice Scarf users like Jumbao, Tapu Lele, Tapu Fini, and Landorus-T are capable of this as well. However, these Pokemon can't always safely switch into Pajantom, so they're relegated to revenge killing or coming in on a hard read.</p> ",
    "sets": [
      {
        "name": "Choice Band",
        "description": "<h1>Set Details</h1> <p>Pajantom's greatest strength comes from trapping and eliminating common defensive roadblocks like Clefable and Tapu Fini for teammates with Spirit Shackle, which can also punish mispredictions. Additionally, it can switch into foes like Slowking, Galarian Slowking, Heatran, and Zapdos to find chances to safely wallbreak and trap foes, which makes its awkward Speed tier and need to use Choice Band less significant. Pajantom can also leverage its powerful Spirit Shackle, immunity to status, and great coverage to become a dangerously self-sufficient wallbreaker. Outrage powers through many common Ghost-type checks like Mandibuzz and Hydreigon, although locking into it leaves Pajantom extremely vulnerable to Fairy-types like Clefable and Jumbao. Earthquake is vital coverage for Pajantom, as it can score a 2HKO on certain switch-ins like Toxapex and Melmetal. Toxic can enable Pajantom to beat certain checks like Tomohawk and Buzzwole in the long run, but Ice Punch is still a good option to hit foes such as Landorus-T and Hydreigon without having to lock into Outrage. Jolly is generally the preferred nature to outspeed Pokemon like non-Choice Scarf Jumbao, Hydreigon, and Landorus-T, although one might opt for Adamant to 2HKO physically defensive Clefable far more consistently.</p> <p>Pajantom is most appreciated on teams where it can significantly weaken or outright remove opposing Pokemon like Tomohawk, Landorus-T, and Clefable that would otherwise be in the way of its teammates. Zeraora and Landorus-T pair excellently with Pajantom, as they both struggle against all three of the aforementioned Pokemon, while other options like Melmetal and Tapu Koko also appreciate Pajantom's ability to weaken or eliminate their checks. If Pajantom isn't running Toxic itself, then teammates with the move such as Heatran, Hippowdon, and Toxapex are greatly appreciated for their ability to cripple Pajantom's checks. Equilibra is a great partner because it's walled by Pokemon like Slowking and Zapdos, which Pajantom easily takes advantage of; in return, Equilibra can remove entry hazards to keep Pajantom healthy and set Doom Desires to help it muscle past checks like Tomohawk, Buzzwole, and Clefable. Future Sight support from Slowking or Galarian Slowking is also useful to let Pajantom break past Buzzwole and Toxapex, with these teammates additionally being able to switch into many of Pajantom's checks if it's ever forced out by them. Lastly, Pajantom loves having Spikes and Stealth Rock on the field, as it's highly effective at forcing switches, and the repeated chip damage on foes like Heatran and Ferrothorn helps it remove them more reliably, so teammates that can keep up entry hazards like Landorus-T, Heatran, and Ferrothorn are great partners.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 297859, "username": "quziel"}, {"user_id": 336073, "username": "Rabia"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}]}], "writtenBy": [{"user_id": 251944, "username": "spoo"}]}
  },
  "Jumbao": {
    "comments": "<h1>Checks and Counters</h1> <p><strong>Poison-types</strong>: Jumbao is incapable of threatening Galarian Slowking, which lets it easily switch in and use Future Sight or throw out one of its coverage attacks. Toxapex, notably specially defensive sets, are strong checks to Choice Scarf Jumbao and greatly help pivoting around its Life Orb set. Venomicon and Venomicon-E can almost always switch in for free on Jumbao and proceed to setup with Nasty Plot or Coil, respectively.</p> <p><strong>Steel-types: Corviknight and Scizor can safely switch into any of Jumbao's attacks and freely pivot afterwards with U-turn. Heatran, Melmetal, and Ferrothorn must watch for Focus Blast but otherwise are solid switch-ins. Equilibra can easily take Moonblasts but risks being overwhelmed by Leaf Storm.</p> <p><strong>Assault Vest Tornadus-T: Assault Vest Tornadus-T is unbothered by any of Jumbao's moves and can threaten back with Hurricane, though it may be overwhelmed if Stealth Rock is on the field.</p> <p><strong>Fire-types</strong>: Volcarona doesn't care about any of Jumbao's attacks and can heal up with Roost if it ever gets low; Victini is similar, although it must watch its health more carefully. Astrolotl's Regenerator lets it scout what move Jumbao will lock into, but it risks being 2HKOed by Moonblast if it takes any prior damage.</p> ",
    "sets": [
      {
        "name": "Choice Scarf",
        "description": "<h1>Set Details</h1> <p>Jumbao derives much of its value from being able to support early-game wallbreakers that have late-game cleaning potential with Healing Wish. It also has a good matchup against most weather teams thanks to Trace, letting it copy Speed-boosting abilities from the likes of Barraskewda, Excadrill, and Arctozolt and potentially revenge kill these foes, in addition to copying Regenerator from foes like Slowking and Slowbro. Jumbao can run Drought with Solar Beam to support teammates like Heatran, but the opportunity cost of not copying useful abilities like Slowbro's Regenerator and Heatran's Flash Fire is usually not worth it.</p> <p>Jumbao is straight walled by Galarian Slowking, so Ground-types like Colossoil, Landorus-T, and Garchomp help to deal with it. Garchomp in particular is fantastic because Healing Wish lets it break down its checks early-game so it can sweep late-game more easily. Similarly, Flying-types like Assault Vest Tornadus, Venomicon, and Venomicon-E are problematic, so Electric-type answers such as Zapdos and Zeraora are helpful to have. Fire-types like Heatran and Astrolotl can cause issues as well, so Water-types such as Slowking, Toxapex, and Tapu Fini are strong teammates. Slowbro can also safely bring Jumbao in against Fighting-types like Urshifu-R with Teleport and provide it Future Sight support, making it harder to defensively answer. Wallbreakers like Dragapult and Melmetal appreciate Jumbao's Healing Wish, as it lets them play more aggressively early-game.</p> "
      },
      {
        "name": "Life Orb",
        "description": "<h1>Set Details</h1> <p>Life Orb Jumbao is an incredibly powerful special attacker, using metagame staples like Slowbro and Zeraora as entry points to fire off its strong STAB attacks and coverage. Trace allows Jumbao to copy Slowbros Regenerator so it can stay healthy and constantly threaten Slowbro throughout a game. Trace also allows Jumbao to absorb Zeraora's STAB attacks and switch into most Heatran sets, both of which are useful to balance teams. Leaf Storm and Moonblast pair excellently, as the sheer power of Leaf Storm dissuades Moonblast switch-ins like Toxapex and Equilibra from coming in. Focus Blast is important coverage for Steel-types such as Corviknight, Heatran, Ferrothorn, and Melmetal. Shore Up helps Jumbao stay healthy, as it is otherwise prone to entry hazard and Life Orb chip damage. A Modest nature allows Leaf Storm to guarantee a 2HKO on physically defensive Toxapex as it switches in, as well as letting Focus Blast 2HKO Corviknight after Stealth Rock. Timid may occasionally be preferred to outspeed the likes of Tapu Lele.</p> <p>Jumbao pairs well with Steel- and Water-types, which cover its weaknesses to the likes of Melmetal, Venomicon-E, and Volcarona. It pairs incredibly well with Heatran, each resisting every type the other is weak to. Additionally, Heatran can pressure Jumbao's Steel-type checks like Corviknight and Scizor and use Magma Storm to trap and remove some of Jumbao's checks such as Toxapex and Galarian-Slowking. Jumbao also pairs well with Slowbro, which has similar type synergy and can pivot Jumbao in safely with Teleport while additionally setting Future Sight, which makes Pokemon like Toxapex and Tornadus-T unable to switch into Jumbaos attacks. Toxapex covers Jumbaos weaknesses to Scizor, Astrolotl, and Weavile and benefits from Jumbao taking advantage of Slowbro and Zeraora. Tornadus-T greatly appreciates Jumbao's ability to stave off Zeraora and Heatran, and in return Tornadus-T can often weaken Jumbao's answers like Blissey and Galarian Slowking with Knock Off.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 227784, "username": "snake_rattler"}, {"user_id": 297859, "username": "quziel"}, {"user_id": 251944, "username": "spoo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}, {"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 336073, "username": "Rabia"}, {"user_id": 482912, "username": "D2TheW"}]}
  },
  "Caribolt": {"sets": [{"name": "Swords Dance"}]},
  "Smokomodo": {"sets": [{"name": "Balance Breaker"}]},
  "Snaelstrom": {"sets": [{"name": "Defensive"}]},
  "Equilibra": {
    "comments": "<h1>Checks and Counters</h1> <p><strong>Zapdos</strong>: Zapdos does not fear any move Equilibra can use against it and can force it out with Heat Wave. Zapdos is even able to punish careless uses of Rapid Spin with its ability, Static.</p> <p><strong>Bulky Water-types</strong>: The tier's many bulky Water-types, especially Slowking, can consistently switch into Equilibra and threaten it out. Even Water-types that are more vulnerable to Earth Power like Slowbro and Toxapex can still pose a threat with Scald or Knock Off.</p> <p><strong>Knock Off: It is difficult to overstate Equilibra's reliance on Leftovers, as it has no other recovery aside from the occasional Pain Split; Pokemon like Landorus-T, Clefable, and Tornadus-T can catch Equilibra with a Knock Off as it switches in and severely limit its longevity throughout a match.</p> <p><strong>Specially Defensive Pokemon: Pokemon with high special bulk like Blissey, Scizor, and Corviknight can generally switch into Equilibra without being punished. Even Galarian Slowking can stomach a few hits while accruing chip damage and come out of the interaction positive because of Regenerator.</p> ",
    "sets": [
      {
        "name": "Pivot",
        "description": "<h1>Set Details</h1> <p>Much of Equilibra's strength as a team support option in the CAP metagame comes from its powerful Doom Desire and ability to compress multiple crucial roles into a single team slot, such as being a sturdy Ground immunity, Volt Switch blocker, and reliable form of hazard control. Doom Desire can force predictable and exploitable choices upon an opponent, and when used in tandem with wallbreakers like Dragapult and Rillaboom, it can often mean getting a guaranteed KO. Equilibra is also a stellar hazard remover with Rapid Spin due to its winning matchup against common Stealth Rock setters such as Landorus-T and Clefable. Flash Cannon is preferred for Equilibra's final moveslot as a means to beat Calm Mind Clefable, force out strong wallbreakers like Tapu Lele and Kyurem, and immediately pressure Flying-types like Landorus-T and Tornadus-T. Alternatively, Pain Split lets it recover against common switch-ins such as Slowking and Blissey to better check strong wallbreakers like Dragapult and Tapu Lele in the long term. Aura Sphere is also an option for beating opposing Equilibra, forcing Corviknight and Skarmory to use Roost more often, and avoiding being trapped by Magnet Rise Magnezone as easily. Equilibra's EV spread is designed to outspeed Tyranitar, survive three Heat Waves from defensive Zapdos, and tank one Fire Fang from +2 Life Orb Garchomp, with the remaining EVs invested into Special Attack for stronger Doom Desires.</p> <p>Equilibra's plethora of valuable resistances and immunities combined with its ability to consistently remove entry hazards makes it very easy to find partners that appreciate its presence; Tomohawk in particular has exceptional defensive synergy as a physical wall that benefits from having Electric- and Fairy-types checked, while Equilibra enjoys Tomohawk's ability to deal with Fighting-types and strong physical wallbreakers like Rillaboom. Clefable is also relevant because it can soak up common Fighting-type coverage moves that bother Equilibra, while Equilibra in turn deals with the Poison- and Steel-types that threaten it such as Melmetal and Nidoking. Strong wallbreakers like Dragapult and Rillaboom as well as other offensive Pokemon like Zeraora appreciate Doom Desire's ability to invalidate many of their respective defensive answers. Pokemon weak to hazards such as Choice Specs Kyurem and Choice Band Weavile also enjoy Equilibra's consistency in spinning away Stealth Rock. Teams that rely on hazard stacking benefit from Equilibra's Rapid Spin not resetting their progress. Finally, it's advisable to have a reliable answer to many of the bulky Water-types that hold Equilibra back, especially Slowking; Rillaboom, Zapdos, and Jumbao are a few options that can keep the pressure up against many of these Pokemon.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 227784, "username": "snake_rattler"}, {"user_id": 297859, "username": "quziel"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}]}], "writtenBy": [{"user_id": 251944, "username": "spoo"}]}
  },
  "Astrolotl": {
    "comments": "<h1>Checks and Counters</h1> <p><strong>Bulky Water-types</strong>: Slowbro can either punish Astrolotl with Rocky Helmet or ignore its Spikes with Heavy Duty Boots and ultimately use it as bait to use Future Sight. Toxapex and Arghonaut are capable of removing Astrolotl's item and are only bothered by Stomping Tantrum after multiple Defense drops or somewhat by Will-O-Wisp in the latter's case. Tapu Fini has worse longevity overall but is still notable for preventing Astrolotl from burning it, being able to remove its Spikes with Defog and potentially crippling utility sets with Trick. Rotom-W and Swampert are also nice answers, being able to stay healthy with Pain Split and Rest, respectively.</p> <p><strong>Dragon-types: Pajantom and Dragapult, as well as the rarer Cyclohm and Hydreigon, are all unbothered by Astrolotl's utility options. The most Astrolotl can do is hope to overwhelm them with chip damage in the long run, but it will still be forced out in any normal situation. However, Choice Scarf Astrolotl turns the tables and can revenge kill the above Dragon-types, though it can still be taken advantage of if locked into an undesirable move.</p> <p><strong>Knock Off and Toxic: Because Astrolotl often wants to stay in for multiple turns at once, Toxic damage can quickly add up and prevent it from accomplishing what it wants to do. Knock Off is also helpful in either mitigating the effectiveness of Regenerator on utility sets, or in the case of Choice Scarf sets, removing its ability to revenge kill a faster teammate. Though effective individually, Toxic and Knock Off combined can easily suffocate Astrolotl and prevent it from making any meaningful progress. Heatran and Magnezone are two Pokemon that can inflict Astrolotl with Toxic as it switches in, while Clefable, Toxapex, and Arghonaut can typically remove its item.</p> <p><strong>Tomohawk: While a much more niche pick, Tomohawk remains a sturdy check to any Astrolotl set. Bolstered by Intimidate, Tomohawk's physical bulk prevents Astrolotl from easily breaking through it, punishing Astrolotl's hits with Rocky Helmet in the process. Moreover, Tomohawk can remove Astrolotl's Spikes with Rapid Spin.</p> ",
    "sets": [
      {
        "name": "Offensive Utility",
        "description": "<h1>Set Details</h1> <p>Astrolotl's unique offensive profile combined with an attractive set of utility moves lets it perform as one of CAP's defining utility options. Regenerator not only enables Astrolotl to be a great scout against Pokemon like Tapu Fini and Magnezone, but it also lets it stay in and accrue chip damage on foes like Tapu Fini and Krilowatt before switching out scot-free, trivially healing off whatever health it lost. The combination of Fire Lash, Will-O-Wisp, and Spikes is perfect for the job; Astrolotl can repeatedly force foes out with the threat of Will-O-Wisp or after enough Defense drops from Fire Lash, further capitalizing on any forced switches with Spikes. Stomping Tantrum is required for Heatran and bulky Poison-types like Galarian Slowking and Toxapex, while Will-O-Wisp is useful for denying would-be checks like Landorus-T and Garchomp from freely staying or switching in. Alternatively, Encore can be used over Will-O-Wisp to disrupt setup sweepers like Tapu Fini and Venomicon. Astrolotl is a great Spikes setter for its positive matchup against common Defog users like Corviknight, simultaneously denying entry to Defog Landorus-T due to Will-O-Wisp. However, Astrolotl is just as good at using Defog itself; it can easily switch into Pokemon like Ferrothorn and Clefable and remove their hazards, while Ground-type Stealth Rock users can never switch in without being prepared to accept a burn. The given Speed investment allows Astrolotl to outspeed Kartana and Alolan Ninetales, with the remaining EVs maximizing special bulk to withstand weak special hits like Tapu Fini's Moonblast or Heatran's Earth Power.</p> <p>Wallbreakers like Urshifu-R, Venomicon-E, and Weavile greatly appreciate Astrolotl's Spikes wearing down opposing bulky Water-types such as Toxapex and Steel-types like Ferrothorn. Additionally, Astrolotl is a nice soft check to faster Electric-types like Tapu Koko and Zeraora that bother these Pokemon. Electric-types of your own are great partners as well, as Astrolotl can often burn the opponent's Ground-type and pave the way for a teammate like Bulk Up Zeraora or Calm Mind Tapu Koko to win. These teammates can also keep pressure up against opposing bulky Water-types for Astrolotl in return. Bulkier, slower Pokemon like Venomicon and Calm Mind Tapu Fini are massive benefactors of Astrolotl's Spikes support and its ability to often draw out longer games. Landorus-T is a particularly good partner, providing a Ground immunity, inflicting Toxic on some of Astrolotl's checks like Slowbro and Arghonaut, giving complementary support with either Stealth Rock or Defog, and being able to easily pivot Astrolotl into foes like Corviknight. Lastly, other Spikes setters like Ferrothorn and Skarmory can enable Astrolotl to more comfortably run Defog or even Encore or Thunder Wave in its last moveslot.</p> "
      },
      {
        "name": "Choice Scarf",
        "description": "<h1>Set Details</h1> <p>With the added Speed from Choice Scarf, Astrolotl can utilize its strong STAB combination to become a formidable fast option and offensive check to the likes of Weavile, Dragapult, Tapu Koko, and Cawmodore. Flare Blitz is preferred over Fire Lash for more immediate pressure against foes like Landorus-T and the ability to always revenge kill Cawmodore from full health. Regenerator additionally mitigates recoil damage, making it a strong low-risk attacking option. Draco Meteor is crucial for OHKOing Dragapult, with additional use against Garchomp and opposing Astrolotl; alternatively, Outrage with a Jolly nature offers slightly increased damage with the tradeoff of being much easier to take advantage of. Stomping Tantrum denies Heatran from free entry and is useful as a recoil-free option against Electric-types, Toxapex, and Galarian Slowking. Finally, a fast Healing Wish is a major draw of this set, letting Astrolotl give setup sweepers like Revenankh or wallbreakers like Galarian Zapdos and Venomicon-E a second chance at finishing off a game. If Healing Wish is not needed, though, other utility moves like Defog can be run. The given EVs let Astrolotl survive one Earth Power from Heatran after Stealth Rock damage while maximizing its Speed.</p> <p>Due to Astrolotl often getting its item removed or sacrificing itself with Healing Wish, supplementary fast options like Tapu Koko and Weavile are good teammates. Astrolotl can even help weaken their defensive checks, such as opposing Landorus-T and Tapu Fini, respectively. Setup sweepers like Revenankh, Weavile, Garchomp, and Kartana that are prone to getting worn down or inflicted with status are good partners; Healing Wish allows you to play more aggressively with these sweepers early-game and attempt to clean again late-game. Strong wallbreakers that tend to get worn down by chip damage like Melmetal, Urshifu-R, and Galarian Zapdos are effective teammates for the same reason. While Regenerator helps prevent Stealth Rock damage from overwhelming Astrolotl, good entry hazard removal options like Landorus-T, Tornadus-T, Corviknight, and Colossoil are nonetheless helpful partners, with Astrolotl being particularly strong on teams with double hazard removal.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 277988, "username": "dex"}, {"user_id": 336073, "username": "Rabia"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}]}], "writtenBy": [{"user_id": 251944, "username": "spoo"}]}
  },
  "Miasmaw": {
    "comments": "<h1>Checks and Counters</h1> <p><strong>Fairy-types</strong>: Fairy-types like Clefable, Jumbao, Kerfluffle, and Tapu Fini resist or are immune to one or both of Miasmaw's STAB moves and can often switch in on a predicted First Impression or Dragon Hammer and force Miasmaw out. They do need to be wary of Choice Band-boosted Poison Jab, however.</p> <p><strong>Flying-types: Flying-types such as Tornadus-T and Tomohawk resist First Impression and force Miasmaw out with Hurricane. Additionally, Tornadus-T is faster than Miasmaw, whereas Tomohawk can consistently force chip damage onto it with Rocky Helmet. However, both need to be wary of Choice Band-boosted Dragon Hammer, as Neutralizing Gas denies both of these Flying-types their defensive abilities.</p> <p><strong>Physically Defensive Water-types: Because of Miasmaw's physical leaning, Pokemon like Slowbro and Toxapex can easily chip it with Rocky Helmet and pressure it out with a Scald burn. Both Pokemon need to be wary of Miasmaw's coverage, however, because Miasmaw will deny their recovery.</p> <p><strong>Stealth Rock: Miasmaw often forgoes Heavy-Duty Boots in favor of Choice Band, leaving it susceptible to Stealth Rock damage. Good users of the move include Tomohawk, Clefable, Landorus-T, and Hippowdon.</p> <p><strong>Faster Pokemon: Faster Pokemon such as Krilowatt, Garchomp, and Dragapult can keep up offensive pressure on a team, not giving Miasmaw the chances it wants to come in and wallbreak with Dragon Hammer.</p> ",
    "sets": [
      {
        "name": "Choice Band",
        "description": "<h1>Set Details</h1> <p>Miasmaw's niche in CAP lies in its access to Neutralizing Gas and its monstrous Attack stat, allowing it to deny Pokemon such as Toxapex, Galarian Slowking, and Slowking their Regenerator recovery while breaking open other pivots such as Tomohawk and Landorus-T. First Impression also lets it act as a good revenge killer, especially against Pokemon susceptible to chip damage such as non-Heavy-Duty Boots Dragapult, Jumbao, Garchomp, and Rillaboom. Poison Jab is used to pressure opposing Fairy-types, and it can secure 2HKOs on Clefable and Tapu Fini while OHKOing Jumbao. Furthermore, Neutralizing Gas shuts down Magic Guard and Misty Surge, which would typically make Clefable and Tapu Fini immune to a potential poison. Close Combat is generally preferred to Earthquake, as it hits Corviknight neutrally while still hitting Equilibra and Ferrothorn super effectively. Earthquake can be run if hitting Toxapex and Aegislash harder is desired, though.</p> <p>A Jolly nature is usually used to outspeed Jolly Landorus-T and force it out with Dragon Hammer, though a case can be made to use Adamant to hit even harder with First Impression and Earthquake. Most notably, Adamant gives Miasmaw a chance to OHKO Slowbro and applies significantly more pressure to Tangrowth and Toxapex. Adamant Miasmaw does, however, fail to outspeed some Pokemon that would otherwise not force Miasmaw out, such as Excadrill and Nidoking.</p> <p>Due to Miasmaw's physical frailty, it appreciates being brought in by a pivot. Kerfluffle, Tapu Koko, Tornadus-T, and Krilowatt are all good options in this regard. Kerfluffle deserves special mention, as it greatly appreciates Slowking and Galarian Slowking being denied Regenerator recovery. Steel-types such as Equilibra and Melmetal make for great teammates, as they can take on the Fairy- and Flying- types that Miasmaw struggles against. Finally, because of Miasmaw's Stealth Rock weakness, entry hazard removal from the likes of Equilibra, Tornadus-T, and Zapdos can be quite helpful in order to keep it healthy.</p> "
      },
      {
        "name": "Taunt Stallbreaker",
        "description": "<h1>Set Details</h1> <p>This set aims to take advantage of passive defensive pivots that would otherwise be solid answers to it. Taunt in conjunction with Neutralizing Gas prevents Pokemon such as Tomohawk, Slowbro, and Toxapex from recovering. Earthquake is used as coverage for Equilibra, Galarian Slowking, and Toxapex. Finally, First Impression gives Miasmaw the ability to pressure faster, more frail Pokemon like Zeraora and Hydreigon while also hitting Slowbro and Slowking super effectively.</p> <p>Pokemon like Rillaboom and Kartana that appreciate recovery being denied on common physically defensive Pokemon make great teammates for Miasmaw. Miasmaw hates having its item removed, so Pokemon such as Tomohawk and Clefable that can switch into common Knock Off users work well on Miasmaw teams. Special wallbreakers and sweepers such as Kerfluffle, Volkraken, and Tapu Fini that appreciate Slowking and Galarian Slowking being denied Regenerator recovery make good teammates as well. Steel-types such as Equilibra, Melmetal, and Heatran help Miasmaw by taking on the multitude of Fairy-types in the tier. Finally, Miasmaw appreciates being brought in by a slow pivot due to its low bulk. Swampert, Slowking, and Mandibuzz all fulfill this role quite well.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 227784, "username": "snake_rattler"}, {"user_id": 336073, "username": "Rabia"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}]}], "writtenBy": [{"user_id": 277988, "username": "dex"}]}
  },
  "Chromera": {
    "comments": "<h1>Other Options</h1> <p>Substitute can be run over a coverage move to give Chromera more setup opportunities and preserve its typing, but this seriously hinders its overall sweeping potential, and Suicune can usually accomplish this type of sweep better. An EV spread of 248 HP / 124 Def / 136 Spe with a Bold nature alongside Taunt allows Chromera to avoid Toxic from Heatran and Blissey, but this leaves it completely walled by Ghost-types. Knock Off is another option that can be used to punish Dragapult and Heatran, but its damage output is pitiful. A Shuca Berry can be used to more easily tank and heal through strong Ground-type attacks, though the item is less conducive towards sweeping. A Lum Berry can be used to give Chromera more leeway with setup opportunities and Blizzard misses.</p> <h1>Checks and Counters</h1> <p><strong>Specially Bulky Pokemon: Pokemon such as Heatran, Blissey, Gastrodon, and Toxapex all can take advantage of Chromera's lack of initial power to change its type and cripple it with Toxic. It should be noted that Toxapex requires Scald in order to change Chromera's type, as Knock Off will not remove Chromera's Poison type.</p> <p><strong>Pivots: Pivots such as Urshifu-R, Syclant, and Krilowatt can all change Chromera's type while pivoting to a teammate that can take advantage of it.</p> <p><strong>Ghost-types: Ghost-types such as Pajantom, Aegislash, and Dragapult can take advantage of Color Change by changing Chromera's type to Ghost and subsequently hitting it super effectively.</p> <p><strong>Bulky Ground-types: Bulky Ground-types like Colossoil, Garchomp, specially defensive Landorus-T, and Hippowdon all can tank Chromera's weak Scalds, change its type with a super effective Earthquake, and hit it with Toxic. The latter three options do not appreciate getting burned by Chromera's Scald, however, and if Chromera is running Blizzard, Landorus-T and Garchomp do not check it.</p> ",
    "sets": [
      {
        "name": "Calm Mind",
        "description": "<h1>Set Details</h1> <p>Chromera's outstanding bulk and access to Calm Mind let it be a passable check to physical attackers and a dangerous late-game wincon, being extremely difficult to dispatch if allowed to set up. Color Change is a double-edged sword for Chromera; while it does let Chromera check Choice-locked Pokemon like Kyurem and Kartana that attack with self-resisting types, it also makes Chromera vulnerable to Dragon- and Ghost-types and Toxic despite its typing. Boomburst is used as a pseudo-STAB move, its high Base Power making up for Chromera lacking control of its own typing. Blizzard can be used instead in order to hit Landorus-T and Dragapult. Scald is the preferred option for the third moveslot, as it hits Heatran and Equilibra super effectively while providing some nice utility versus physical attackers. If using Blizzard, Thunderbolt should be run over Scald in order to hit Toxapex and Arghonaut. Silk Scarf is the preferred item, as it raises Chromera's peak damage by boosting Boomburst. Leftovers is an option that gives Chromera better longevity, and it should be run if Boomburst is dropped for Blizzard. Maximum Speed and a Timid nature are run in order to outpace Urshifu-R and Kyurem.</p> <p>Chromera struggles to break through certain specially defensive walls such as Heatran and Toxapex, so support from Ground-types such as Landorus-T and Colossoil is appreciated. Even if Chromera is running Blizzard, Dragapult can easily overwhelm it before it gets the chance to set up; Clefable and Blissey are consistent Dragapult switch-ins. Clefable also helps Chromera beat Pajantom, another Ghost-type that gives it issues. Rocky Helmet users such as Garchomp and Corviknight punish U-Turn users, which would otherwise take advantage of Chromera's ability. Pokemon that can pressure Ground-types such as Weavile and Urshifu-R help cover Chromera's only initial weakness. Lastly, Ground-immune Pokemon such as Zapdos and Tornadus-T help as useful switch-ins to Colossoil, Landorus-T, and defensive Garchomp, all of which can hit Chromera with a super effective Earthquake and then cripple it with Toxic.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 273339, "username": "Lasen"}, {"user_id": 297859, "username": "quziel"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 277988, "username": "dex"}]}
  },
  "Venomicon": {"sets": [{"name": "Bulky Set-up Sweeper"}]},
  "Venomicon-Epilogue": {"sets": [{"name": "Wallbreaker"}]}
}