{
  "Cresselia": {"sets": [{"name": "Choice Scarf"}, {"name": "Kee Berry"}]},
  "Venusaur": {"sets": [{"name": "Substitute + Leech Seed"}, {"name": "Custap Berry"}]},
  "Blastoise": {"sets": [{"name": "Life Orb"}, {"name": "Wacan Berry"}]},
  "Nidoking": {"sets": [{"name": "Life Orb"}, {"name": "Choice Scarf"}]},
  "Clefable": {"sets": [{"name": "Unaware"}]},
  "Ninetales": {"sets": [{"name": "Life Orb"}, {"name": "Choice Specs"}]},
  "Ninetales-Alola": {"sets": [{"name": "Encore + Disable"}, {"name": "Life Orb"}]},
  "Arcanine": {"sets": [{"name": "Assault Vest"}, {"name": "Sitrus Berry"}, {"name": "Choice Band"}, {"name": "Choice Scarf"}], "credits": {"teams": [{"name": "Previous version written by", "members": [{"user_id": 451287, "username": "Krytocon"}, {"user_id": 239997, "username": "Rosa"}]}, {"name": "Previous version quality checked by", "members": [{"user_id": 480297, "username": "zioziotrip"}, {"user_id": 276708, "username": "Alakazam"}, {"user_id": 317056, "username": "dogknees"}]}, {"name": "Previous version grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}, {"user_id": 297659, "username": "deetah"}]}], "writtenBy": []}},
  "Tentacruel": {"sets": [{"name": "Assault Vest"}]},
  "Slowbro-Galar": {"sets": [{"name": "Weakness Policy"}]},
  "Gengar": {"sets": [{"name": "Life Orb"}, {"name": "Choice Specs"}]},
  "Marowak-Alola": {"sets": [{"name": "Lightning Rod"}]},
  "Chansey": {
    "sets": [
      {
        "name": "Stall",
        "description": "<p>Chansey is one of the bulkier walls by virtue of high HP and Eviolite, walling many prominent special attackers such as Primarina, Magnezone, and Volcarona. Toxic helps dispatch threats that can heal up on Chansey such as defensive Arcanine, Roost Kyurem, and non-Rest Slowbro. Soft-Boiled helps in matchups where the foe also has recovery to maintain health while Toxic whittles them down, which is particularly useful against Quiver Dance Volcarona, although Chansey will have to play around Substitute if Volcarona is running that. While Chansey's physical bulk is not nearly as good as its special bulk, the given EV investment allows for its to be as physically bulky as possible, letting it survive a hit from Choice item Haxorus, offensive Rillaboom, and Jolly Choice Scarf Galarian Darmanitan to OHKO them with Counter. Charm is an option over Counter to handle physical attackers that would like to set up on Chansey such as Shell Smash Crustle, Swords Dance Rhyperior, and Bulk Up Zeraora. Charm should be used to PP stall and negate boosts from the foe's setup moves to a point where any combination of Chansey's moves will win.</p> <p>Chansey is taken advantage of by Choice item attackers with Trick such as Rotom-H, Porygon-Z, and Gengar. Toxic can assist in dealing certain anti-stall measures such as Aromatisse and Fake Tears Sylveon; Chansey should use it before they are able to overly debilitate it with support moves like Encore + Disable and Fake Tears. Good teammates for Chansey are attackers that don't care about Trick and are able to retaliate, such as Choice Specs Magnezone and Choice Band Snorlax. Chansey also doesn't appreciate faster Taunt users such as Grassy Seed Rillaboom and Skarmory, as they PP stall Chansey and slowly chip it down. Good partners that alleviate this weakness include Substitute + Disable Dragapult and stall Arcanine.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 317056, "username": "dogknees"}, {"user_id": 276708, "username": "Alakazam"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}]}], "writtenBy": [{"user_id": 480297, "username": "zioziotrip"}]}
  },
  "Gyarados": {"sets": [{"name": "Choice Band"}, {"name": "Dragon Dance"}]},
  "Zapdos": {"sets": [{"name": "Maranga Berry + Agility"}, {"name": "Maranga Berry + Eerie Impulse"}, {"name": "Offensive Life Orb"}, {"name": "Eerie Impulse + Life Orb"}, {"name": "PP Stall"}, {"name": "Choice Specs"}], "credits": {"teams": [{"name": "Previous version was written by", "members": [{"user_id": 526135, "username": "doc1203"}]}, {"name": "Previous version was quality checked by", "members": [{"user_id": 430787, "username": "PA"}, {"user_id": 501918, "username": "Here Comes Team Charm!"}]}, {"name": "Previous version was grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}], "writtenBy": []}},
  "Zapdos-Galar": {"sets": [{"name": "Custap Berry"}, {"name": "Weakness Policy"}, {"name": "Choice Band"}, {"name": "Assault Vest"}]},
  "Moltres": {"sets": [{"name": "Maranga Berry Stall"}]},
  "Moltres-Galar": {
    "comments": "<h1>Other Options</h1> <p>Galarian Moltres can run an anti-Custap Berry Weakness Policy set with Sucker Punch over Endure. Without the Custap Berry, it is much more susceptible to being OHKOed but can get some​​​​​​​​ surprise KOs if it is hit with a super effective move that would normally 2HKO, such as a Dazzling Gleam from Choice Scarf Togekiss.</p> ",
    "sets": [
      {
        "name": "Custap Berry",
        "description": "<h1>Set Description</h1> <p>Galarian Moltres is a bulky attacker that stacks boosts from Berserk and Nasty Plot to rip through foes. Endure + Custap Berry allows it to take a hit from frail offensive Pokemon, such as Choice item Galarian Darmanitan and Pheromosa, and OHKO back the next turn with +1 Special Attack thanks to Berserk. Although Air Slash has better accuracy, Hurricane is preferred because it has better odds versus Assault Vest Urshifu-S Nasty Plot allows Galarian Moltres to outboost Pokemon such as non-Toxic Zygarde and non-Choice Specs Volcanion.</p> <h1>EVs</h1> <p>The EVs put into HP, Defense, and Special Defense allow Galarian Moltres to survive a Choice Specs-boosted Thunderbolt from Rotom formes and an Choice Band-boosted Outrage from Jolly Haxorus. The remaining EVs are put into Special Attack for maximum damage output, as Galarian Moltres does not get much benefit from extra Speed due to Custap Berry.</p> <h1>Usage Tips</h1> <p>Against Pokemon that cannot threaten to KO Galarian Moltres back, such as Assault Vest Urshifu-S, Necrozma, and Rillaboom, you should just attack Turn 1. One notable exception to this is against Sitrus Berry Celesteela, where Galarian Moltres must Nasty Plot twice. Against a foe that threatens to OHKO Galarian Moltres, such as Galarian Darmanitan, Endure allows it to take the hit and OHKO back. Sometimes, against Pokemon that have the option of OHKOing Galarian Moltres or not, like Choice Specs Porygon-Z with Trick, Galarian Moltres has two options: use Endure against a move that would otherwise OHKO,  or use an attacking move to save Endure for the next turn, predicting that the foe will play around it. This leads to many of Galarian Moltres's matchups being coinflips, such as Volcarona. Despite the type advantage, Galarian Moltres's matchup against Volcarona is highly variant, relying on predicting when  Volcarona will use Quiver Dance to set up with Nasty Plot, predicting Substitutes with Fiery Wrath, and hitting Hurricane.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 520168, "username": "Murman"}, {"user_id": 430787, "username": "PA"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}]}], "writtenBy": [{"user_id": 518399, "username": "Itchy"}]}
  },
  "Bellossom": {"sets": [{"name": "Mental Herb"}]},
  "Azumarill": {"sets": [{"name": "Belly Drum"}, {"name": "Stall"}, {"name": "Choice Band"}, {"name": "Assault Vest"}], "credits": {"teams": [{"name": "Previous verision was written by", "members": [{"user_id": 430787, "username": "PA"}]}, {"name": "Previous version was quality checked by", "members": [{"user_id": 317056, "username": "dogknees"}, {"user_id": 480297, "username": "zioziotrip"}]}, {"name": "Previous version was grammar checked by", "members": [{"user_id": 297659, "username": "deetah"}]}], "writtenBy": []}},
  "Quagsire": {"sets": [{"name": "Chilan Berry"}]},
  "Slowking-Galar": {"sets": [{"name": "Choice Specs"}]},
  "Steelix": {"sets": [{"name": "Choice Band"}, {"name": "Iron Defense + Body Press"}]},
  "Scizor": {"sets": [{"name": "Choice Band"}]},
  "Corsola-Galar": {"sets": [{"name": "Stall"}], "credits": {"teams": [{"name": "Previous version written by", "members": [{"user_id": 276708, "username": "Alakazam"}]}, {"name": "Previous version quality checked by", "members": [{"user_id": 425798, "username": "pqs"}, {"user_id": 475993, "username": "Boat"}]}, {"name": "Previous version grammar checked by", "members": [{"user_id": 388157, "username": "A Cake Wearing A Hat"}]}], "writtenBy": []}},
  "Skarmory": {"sets": [{"name": "Stall"}]},
  "Porygon2": {"sets": [{"name": "Eerie Impulse"}]},
  "Blissey": {"sets": [{"name": "Choice Specs"}, {"name": "Assault Vest"}], "credits": {"teams": [{"name": "Previous version was written by", "members": [{"user_id": 501918, "username": "Here Comes Team Charm!"}]}, {"name": "Previous version was quality checked by", "members": [{"user_id": 480297, "username": "zioziotrip"}, {"user_id": 317056, "username": "dogknees"}]}, {"name": "Previous version was grammar checked by", "members": [{"user_id": 297659, "username": "deetah"}]}], "writtenBy": []}},
  "Raikou": {"sets": [{"name": "Pressure Stall"}]},
  "Entei": {
    "comments": "<h1>Other Options</h1> <p>Assault Vest Entei can use Pressure over Inner Focus to bluff stall, but generally Inner Focus is better to maintain consistency versus Togekiss, Arcanine, and random moves with flinch chances like Galarian Moltres's Fiery Wrath.</p> <p>Entei can run a Life Orb set with Inner Focus, EVs of 184 HP / 92 Atk / 16 Def / 216 Spe, and an Adamant nature for a more reliable matchup against Togekiss, Avalugg, Steelix, and Zapdos, using a moveset of Sacred Fire / Extreme Speed / Will-O-Wisp / Eruption; Bulldoze can be slotted in over Will-O-Wisp to beat Heatran. Life Orb Entei sees far less usage due to its few upsides and lower consistency in practice than Assault Vest.</p> ",
    "sets": [
      {
        "name": "Pressure Stall",
        "description": "<h1>Set Description</h1> <p>Pressure stall Entei can easily beat many slower attackers, such as Choice Specs Volcanion, Venusaur, Dracozolt, and Assault Vest Goodra, while also dealing with some faster attackers like Zarude, Pheromosa, and Kartana well. Leftovers is mandatory to create more Substitutes. Protect and Substitute stall out opposing attacks easily, such as Urshifu-S's Wicked Blow and Volcanion's Steam Eruption, and Protect adds Leftovers healing to make more Substitutes. Sacred Fire can turn tough matchups versus Pokemon like Zeraora into winning ones with a single burn; on the other hand, Flare Blitz can be used for a more reliable Galarian Darmanitan matchup and more PP, which can help versus some opposing stall Pokemon like Galarian Corsola. Toxic is standard on Pressure stall Pokemon like Entei to take advantage of foes that require setup to OHKO them, such as Volcarona and opposing stall Pokemon like Chansey. Laser Focus is a potential option to defeat Registeel, since critical hits ignore Registeel's Defense boosts through Iron Defense.</p> <h1>EVs</h1> <p>252 Defense EVs give the best possible odds to beat Adamant Choice Scarf Galarian Darmanitan. 252 Speed EVs with a Jolly nature Speed tie Zapdos, Galarian Zapdos, and opposing Entei, and they outspeed all base 95s, most notably Galarian Darmanitan and Tapu Lele.</p> <h1>Usage Tips</h1> <p>Against a vast majority of Pokemon, the win path is usually stalling out their super effective moves via Pressure's doubled PP consumption, Substitute, and Protect. Toxic assists in this task versus Pokemon that don't rely on direct attacks to win, such as Chansey and stall Cresselia, or Pokemon that are too weak to OHKO Entei, like Zapdos. Versus Registeel, if you run Laser Focus, use Laser Focus turn 1 and then alternate between your Fire-type attack and it, or use Substitute turn 2 instead if Counter is revealed.</p> "
      },
      {
        "name": "Assault Vest",
        "description": "<h1>Set Description</h1> <p>Assault Vest Entei chooses to tank hits and outdamage its targets. Inner Focus is used to defeat Choice Scarf Togekiss and non-Choice Band Arcanine. Sacred Fire can be used for the 50% burn chance, but Flare Blitz is generally better for its higher damage and PP, defeating Venusaur and Aromatisse far more reliably. Bulldoze is mandatory to deal with Pokemon such as Heatran, Assault Vest Arcanine, and Spectrier. Eruption deals incredible damage to Pokemon with low Special Defense, such as Steelix, Registeel, and Avalugg, while making the Aromatisse matchup more consistent. Stone Edge, however, can be used instead to deal with Kee Berry Volcarona and Rotom-H. Extreme Speed is an excellent, high-damage move that deals with Custap Berry users and Air Balloon Heatran.</p> <h1>EVs</h1> <p>The Special Defense and HP investment lets Entei tank two Earth Powers from Modest Heatran. With a Jolly nature, 216 Speed EVs outspeed Adamant Choice Band Galarian Darmanitan, and Entei still defeats Venusaur if using Flare Blitz. An Adamant nature can be used instead to make the Aromatisse matchup more consistent, but this loses out on the Galarian Darmanitan matchup.</p> <p>An alternative EV spread of 8 HP / 76 Atk / 208 Def / 216 Spe with a Jolly nature gives a more reliable Galarian Darmanitan matchup, tanking Jolly Choice Scarf Darmanitan's Earthquake.</p> <h1>Usage Tips</h1> <p>Use Extreme Speed on Air Balloon Pokemon like Heatran. Sacred Fire is used on targets that instantaneously lose when burned, such as Zeraora. Use Eruption versus Aromatisse if you think it is physically defensive, and Flare Blitz or Sacred Fire otherwise. Eruption is also used for Steelix and Avalugg. Entei is fairly straightforward outside of these scenarios; the most effective move usually wins.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 526135, "username": "doc1203"}, {"user_id": 518399, "username": "Itchy"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}], "writtenBy": [{"user_id": 249890, "username": "zo"}]}
  },
  "Suicune": {"sets": [{"name": "PP Stall"}, {"name": "Assault Vest"}]},
  "Tyranitar": {"sets": [{"name": "Assault Vest"}, {"name": "Custap Berry"}, {"name": "Choice Band"}, {"name": "Weakness Policy"}, {"name": "Chople Berry"}]},
  "Celebi": {"sets": [{"name": "Choice Scarf"}, {"name": "Leech Seed Stall"}]},
  "Blaziken": {"sets": [{"name": "Weakness Policy"}]},
  "Swampert": {"sets": [{"name": "Assault Vest"}, {"name": "Petaya Berry"}, {"name": "Chilan Berry"}]},
  "Gardevoir": {"sets": [{"name": "Choice Scarf"}, {"name": "Encore + Disable"}], "credits": {"teams": [{"name": "Previous version was written by", "members": [{"user_id": 475087, "username": "Inkreativ"}]}, {"name": "Previous version was quality checked by", "members": [{"user_id": 425798, "username": "pqs"}, {"user_id": 475993, "username": "Boat"}]}, {"name": "Previous version was grammar checked by", "members": [{"user_id": 302985, "username": "lotiasite"}]}], "writtenBy": []}},
  "Shedinja": {"sets": [{"name": "Protective Pads"}]},
  "Aggron": {"sets": [{"name": "Choice Band"}, {"name": "Choice Scarf"}, {"name": "Custap Berry"}]},
  "Torkoal": {"sets": [{"name": "Stall"}]},
  "Salamence": {"sets": [{"name": "Choice Scarf"}]},
  "Metagross": {"sets": [{"name": "Assault Vest"}, {"name": "Weakness Policy"}, {"name": "Choice Band"}, {"name": "Fast Choice Scarf"}, {"name": "Defensive Choice Scarf"}, {"name": "Air Balloon"}, {"name": "Occa Berry"}]},
  "Regirock": {"sets": [{"name": "Choice Band"}]},
  "Regice": {"sets": [{"name": "Charge Beam"}, {"name": "Counter"}]},
  "Registeel": {"sets": [{"name": "Iron Defense + Amnesia"}, {"name": "Counter + Amnesia"}, {"name": "Assault Vest"}]},
  "Latias": {"sets": [{"name": "Haban Berry"}]},
  "Latios": {"sets": [{"name": "Choice Specs"}, {"name": "Choice Scarf"}]},
  "Roserade": {"sets": [{"name": "Substitute + Leech Seed"}, {"name": "Life Orb"}]},
  "Gastrodon": {"sets": [{"name": "Counter"}]},
  "Garchomp": {"sets": [{"name": "Choice Band"}, {"name": "Custap Berry"}, {"name": "Life Orb"}, {"name": "Choice Scarf"}, {"name": "Haban Berry"}]},
  "Weavile": {"sets": [{"name": "Life Orb"}, {"name": "Liechi Berry + Pickpocket"}]},
  "Magnezone": {"sets": [{"name": "Custap Berry"}, {"name": "Choice Specs"}, {"name": "Weakness Policy"}], "credits": {"teams": [{"name": "Previous version was written by", "members": [{"user_id": 501316, "username": "zxgzxg"}, {"user_id": 276708, "username": "Alakazam"}]}, {"name": "Previous version was quality checked by", "members": [{"user_id": 276708, "username": "Alakazam"}, {"user_id": 317056, "username": "dogknees"}, {"user_id": 425798, "username": "pqs"}]}, {"name": "Previous version was grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}]}], "writtenBy": []}},
  "Rhyperior": {"sets": [{"name": "Choice Band"}, {"name": "Anti Darmanitan-Galar"}, {"name": "Anti Magnezone"}], "credits": {"teams": [{"name": "Previous version was quality checked by", "members": [{"user_id": 480297, "username": "zioziotrip"}, {"user_id": 317056, "username": "dogknees"}]}, {"name": "Previous version was grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}]}], "writtenBy": []}},
  "Togekiss": {
    "comments": "<h1>Other Options</h1> <p>Mental Herb instead of Maranga Berry sacrfices certain matchups like Volcanion for the ability to beat Taunt and Encore users such as Spectrier and Gardevoir. Additionally a Charm + Kee Berry set allows Togekiss to answer slower physical threats such as Metagross, Aggron, Rhyperior, and Glastrier by reducing their attack and healing with Roost, slowly chipping them down with Counter or Air Slash. A Choice Specs set sacrifices some of Togekiss's Speed for more power, being able to break down bulky Pokemon like Volcanion quickly and reliably because you don't need as many flinches. This set can also run Grass Knot as a niche move to catch Pokemon like Rhyperior and Swampert. Nasty Plot is another option that can be used over Encore on Thunder Wave variants. Nasty Plot can help against stall users like Kyurem and Leftovers Gastrodon, if running Encore. Resist Berry sets usually are paired with Counter. Babiri Berry, for example, can lure Pokemon like Metagross or Kartana by surviving a hit and using Counter. It can also run other Berries such as Wacan Berry, Charti Berry, and even Yache Berry for threats such as Choice Band Zeraora, Choice Band Landorus-T, and Galarian Darmanitan respectively. However, Togekiss often has to sacrifice a lot of matchups to run these sets due to it needing to dedicate nearly all of its resources to run them. This makes these sets relatively niche and often saved for tournament play.</p> ",
    "sets": [
      {
        "name": "Maranga Berry + Thunder Wave",
        "description": "<h1>Set Description</h1> <p>Togekiss makes use of tactical RNG manipulation through Serene Grace, Air Slash, and paralysis to immobilize and break down foes. Maranga Berry allows it to more reliably wall many special attackers such as Primarina, Sylveon, and Volcanion. Thunder Wave is useful for speed control in addition to making immobilizing foes more reliable. Roost paired with paralysis allows Togekiss to fish for paralysis turns while recovering, which increases reliability even more. Encore is useful for locking stall Pokemon such as stall Cresselia and Corsola-G into their setup moves, as well as bulky offensive setup Pokemon like Galarian Moltres, Primarina, and Fake Tears Sylveon by locking them into their status moves.</p> <h1>EVs</h1> <p>The EVs allow Togekiss to survive Choice Specs Pixilate Sylveon's Hyper Beam and outspeed Choice Scarf Tapu Fini and Adamant Choice Scarf Haxorus after Thunder Wave. 52 Defense EVs maximize reliability against Assault Vest Arcanine and certain Dracovish sets.</p> <p>An alternative spread of 96 HP / 140 SpA / 20 SpD / 252 Spe with a Timid nature allows Togekiss to defeat Magnezone with Mystical Fire. The EV spread allows Togekiss to defeat Choice Specs Volcarona and outspeeds bulky Tapu Fini variants as well as other Maranga Togekiss.</p> <h1>Usage Tips</h1> <p>Most matchups with Maranga Berry Togekiss begin with Togekiss using Thunder Wave Turn 1. However, against certain Trick users such as Cresselia and Choice Scarf Tapu Fini, it is safest to use Encore Turn 1. This locks you into Encore again but nets you a free move Turn 3 to use Air Slash, which locks you into Air Slash for the final turn of Encore on Turn 4, resetting the cycle. If the foe uses an attacking move Turn 1 and deals less than half of Togekiss's health, it is generally safe to spam Roost and fish for paralysis turns before going for flinches with Air Slash. This keeps Togekiss from dropping to a stray critical hit as well as not risking being caught by priority or some other gimmick such as a surprise Custap Berry user. If the foe uses a setup or status move such as Calm Mind, Swords Dance, or Substitute, Togekiss should usually use Encore to lock them into their move so they can safely break them down without needing to deal with flinch and paralysis chances as long as Togekiss outspeeds. Where Togekiss shouldn't use Encore is against Pokemon like Aromatisse. Instead, Togekiss should spam Air Slash in hopes of getting lucky and flinching Aromatisse down without being locked into Struggle by Encore and Disable.</p> "
      },
      {
        "name": "Choice Scarf",
        "description": "<h1>Set Description</h1> <p>Choice Scarf allows Togekiss to outspeed Pokemon such as Dragapult, Kartana, and non-Choice Scarf Tapu Fini. This pairs nicely Trick, which works to beat stall Pokemon such as non-AV Registeel while also locking Pokemon like stall Azumarill into a move. For coverage moves, Dazzling Gleam reliably takes out threats like Haxorus and Dracozolt, while Fire Blast can be used for Ferrothorn and Kartana.</p> <h1>EVs</h1> <p>Maximum Special Attack and Speed EVs allow Togekiss to do as much damage as possible and outspeed as many Pokemon as possible.</p> <p>Alternatively, 16 HP / 236 SpA / 12 SpD / 244 Spe can be used to outspeed Dragapult and survive a Flash Cannon from Aegislash.</p> <h1>Usage Tips</h1> <p>Generally, this set is pretty simple to use. Use Air Slash when Togekiss needs to flinch a Pokemon like Naganadel or Volcanion that would KO it otherwise. Use Dazzling Gleam or Fire Blast when either of them more reliably wins the matchup such as against Garchomp or Ferrothorn, respectively. Trick is for opposing setup Pokemon as well as Pokemon like Tapu Fini, Dragapult, and Primarina that can't reliably 2HKO Togekiss. This allows Togekiss to outheal with Roost and makes the matchup more reliable in the long run.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Updated by", "members": [{"user_id": 518399, "username": "Itchy"}, {"user_id": 509647, "username": "Mishlef"}]}, {"name": "Quality checked by", "members": [{"user_id": 430787, "username": "PA"}, {"user_id": 501918, "username": "Here Comes Team Charm!"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}]}], "writtenBy": [{"user_id": 503725, "username": "smely socks"}]}
  },
  "Mamoswine": {"sets": [{"name": "Choice Band"}, {"name": "Assault Vest"}]},
  "Porygon-Z": {
    "comments": "<h1>Other Options</h1> <p>Porygon-Z can utilize a set with Chople Berry for Zeraora and Fighting-types like both Urshifu formes. This set runs an EV spread of 88 Def / 252 SpA / 168 Spe with a Modest nature and the moves Hyper Beam, Uproar, Agility, and Nasty Plot or Icy Wind. 88 Defense EVs allow Porygon-Z to survive a Plasma Fists from Choice Band Zeraora and use Agility turn 1 to outspeed and OHKO with Hyper Beam. Icy Wind can help out versus Sawk to break Sturdy and then KO with Hyper Beam.</p> ",
    "sets": [
      {
        "name": "Choice Specs",
        "description": "<h1>Set Description</h1> <p>Choice Specs-boosted Hyper Beam is able to OHKO many top-tier Pokemon like Aromatisse, Cresselia, and Assault Vest Arcanine. Uproar can be beneficial against Whimsicott and Pressure Entei, which try to stall Porygon-Z out with Substitute. Thunderbolt beats Corviknight, and Ice Beam hits Garchomp and Dragapult. Trick + Recover + Nasty Plot allows Porygon-Z to shut down stall Pokemon like Chansey. Dark Pulse helps beat non-Assault Vest Metagross and is an option to hit Spectrier.</p> <h1>EVs</h1> <p>252 Speed EVs are used to outspeed Tapu Fini, Dracovish, Kommo-o, and some other Porygon-Z. An alternate EV spread of 68 Def / 184 SpA / 252 Spe reliably beats Garchomp with Ice Beam, as the 68 Defense EVs prevent the KO from Custap Berry Garchomp's Outrage.</p> <h1>Usage Tips</h1> <p>Hyper Beam is usually the best choice versus a neutral target like Azumarill or Cresselia, as it will do more damage than super effective coverage moves thanks to Adaptability. If Entei's Pressure is not revealed on turn 1, Porygon-Z should click Hyper Beam over Uproar, since Entei is using Inner Focus with Assault Vest instead of Substitute.</p> <p>For coverage moves like Thunderbolt, Ice Beam, and Dark Pulse, it's best to use them on Pokemon like Celesteela and Spectrier, as they either resist or are immune to Hyper Beam. Nasty Plot Porygon-Z can use Trick and set up until Hyper Beam OHKOes Chansey.</p> "
      },
      {
        "name": "Custap Berry",
        "description": "<h1>Set Description</h1> <p>This Porygon-Z set aims to surprise Pokemon like Galarian Darmanitan, Naganadel, and opposing Porygon-Z by using Endure + Custap Berry. Hyper Beam deals an extreme amount of damage to Pokemon like Rillaboom, Tapu Fini, and Volcanion. Nasty Plot enables Porygon-Z to set up against stall Pokemon like Chansey and better damage foes like Sylveon and Primarina. Uproar helps versus Substitute users like Whimsicott and stall Entei, while Thunderbolt is helpful against Corviknight and Celesteela. Ice Beam hits Garchomp and Naganadel.</p> <h1>EVs</h1> <p>The defensive investment allows Porygon-Z to survive a Fake Out into Grassy Glide from Life Orb Rillaboom. The HP in specific lets it reliably beat Timid Choice Specs Tapu Fini. 216 Speed EVs are for base 85 Speed Pokemon without a boosting nature, such as Rillaboom, Cresselia, and Tapu Fini.</p> <h1>Usage Tips</h1> <p>Endure is the best move on turn 1 versus threats that can OHKO Porygon-Z like Galarian Darmanitan, Choice item Urshifu-S and Urshifu-R, and also Naganadel. Then, while in Custap Berry range, it can OHKO back with Hyper Beam or Ice Beam. If running Uproar, it should be used against Pokemon like Whimsicott turn 1 to bypass their Substitute and KO them before they can stall.</p> "
      },
      {
        "name": "Choice Scarf",
        "description": "<h1>Set Description</h1> <p>Choice Scarf Porygon-Z outspeeds fast threats like Zeraora and also other, slower Choice Scarf users in Dracozolt and Togekiss, OHKOing them with Hyper Beam. Trick + Recover effectively shuts down the likes of Chansey and Galarian Corsola. Dark Pulse hits Ghost-types like Spectrier and Galarian Corsola, while Ice Beam can be beneficial for Landorus-T especially with Assault Vest, and Garchomp.</p> <h1>EVs</h1> <p>This set runs maximum Speed investment to outspeed Zeraora and base 80 Speed or less Choice Scarf users like Togekiss, Dracozolt, and Dracovish. Maximum Special Attack allows it to get better KO odds  versus Volcanion and stall Zapdos. A Modest nature improves its chances versus Maranga Berry Zapdos; however, it will not outspeed Choice Scarf Togekiss and Zeraora.</p> <h1>Usage Tips</h1> <p>Dark Pulse hits Ghost-types like Spectrier and Galarian Corsola for supereffective damage and Ice Beam helps versus Ground-types like Garchomp and Landorus. Using Trick + Recover and repeatedly clicking Hyper Beam wins versus Chansey.</p> "
      },
      {
        "name": "Life Orb",
        "description": "<h1>Set Description</h1> <p>This set has most of the same monstrous wallbreaking power that Porygon-Z is known for, but with the freedom to switch between its STAB attacks and utility options. Nasty Plot allows it to counter Mirror Coat users like Gastrodon and Assault Vest Swampert. Uproar secures the win versus Pressure stall Pokemon like Substitute + Protect Zapdos, Entei, Corviknight, and SubSeed users like Whimsicott. Substitute overwhelms hard stall Pokemon like Unaware Pyukumuku. Recover can increase Porygon-Z's longevity versus Pokemon like Seismic Toss Chansey, and Dark Pulse lets it hit Spectrier.</p> <h1>EVs</h1> <p>92 Special Defense EVs allow Porygon-Z to survive an Overheat from Choice Scarf Volcanion and OHKO back. With 176 Speed EVs, it outspeeds neutral-natured base 80 Speed Pokemon like Regidrago and Togekiss.</p> <h1>Usage Tips</h1> <p>Substitute should be used turn 1 versus Gastrodon to avoid moves like Mirror Coat and Clear Smog, then Nasty Plot on turn 2 lets Porygon-Z OHKO with Hyper Beam. However, if Gastrodon uses Amnesia turn 1, then Nasty Plot should be repeated until Porygon-Z reaches +6 and then Uproar is an OHKO or 2HKO, even after Chilan Berry. This same strategy should be used for Corviknight, as Nasty Plot boosted Hyper Beam OHKOes. However, if they use Substitute too, Nasty Plot should be used twice so that Uproar will at worst 2HKO.Substitute is the best move on turn 1 versus Pyukumuku to stop Mirror Coat then Uproar can be used for a 2HKO. Recover helps versus stall Pokemon like Seismic Toss Chansey, as Porygon-Z can boost up with Nasty Plot and heal off the damage to KO with Hyper Beam.</p> "
      },
      {
        "name": "Rocky Helmet",
        "description": "<h1>Set Description</h1> <p>This set punishes slower physical attackers that normally check Porygon-Z like Aggron, Rhyperior, and Metagross through Reflect + Rocky Helmet, chipping down their health until they are in Hyper Beam KO range. Nasty Plot can help versus some stall Pokemon or just bolster Hyper Beam's damage even more, while Recover helps Porygon-Z outlast its foes.</p> <h1>EVs</h1> <p>64 Defense EVs are so that Porygon-Z can survive three Choice Band Aggron Heavy Slams after Reflect, and the 188 Speed EVs allow it to outspeed Metagross. Maximum Special Attack is for the best Hyper Beam damage versus the aforementioned Pokemon.</p> <h1>Usage Tips</h1> <p>Reflect versus slower physical threats, like Aggron and Metagross, allows Porygon-Z to tank their hits and then use Recover until they are chipped down from Rocky Helmet. Hyper Beam should be used when it will OHKO the foe. Nasty Plot can reduce the turns needed to stall out foes like Aggron while also lowering the chances that Porygon-Z falls to a critical hit. It can also help Hyper Beam eventually OHKO versus stall Pokemon like Chansey, with Recover helping Porygon-Z set up.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 558869, "username": "Nick"}, {"user_id": 518399, "username": "Itchy"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}, {"name": "Previous versions written by", "members": [{"user_id": 430787, "username": "PA"}, {"user_id": 418753, "username": "pazza"}]}, {"name": "Previous versions quality checked by", "members": [{"user_id": 480297, "username": "zio"}, {"user_id": 317056, "username": "dogknees"}, {"user_id": 276708, "username": "Alakazam"}]}, {"name": "Previous versions grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}, {"user_id": 384270, "username": "martha"}]}], "writtenBy": [{"user_id": 525135, "username": "doc1203"}]}
  },
  "Rotom-Heat": {"sets": [{"name": "Choice Specs"}, {"name": "Choice Scarf"}, {"name": "Stall"}], "credits": {"teams": [{"name": "Previous version was quality checked by", "members": [{"user_id": 425798, "username": "pqs"}, {"user_id": 480297, "username": "zioziotrip"}]}, {"name": "Previous version was grammar checked by", "members": [{"user_id": 388157, "username": "A Cake Wearing A Hat"}]}], "writtenBy": []}},
  "Rotom-Wash": {"sets": [{"name": "Choice Specs"}, {"name": "Kee Berry"}, {"name": "Life Orb"}], "credits": {"teams": [{"name": "Previous version was written by", "members": [{"user_id": 205691, "username": "ForgottenOnes"}, {"user_id": 501316, "username": "zxgzxg"}]}, {"name": "Previous version was quality checked by", "members": [{"user_id": 480297, "username": "zioziotrip"}, {"user_id": 317056, "username": "dogknees"}, {"user_id": 276708, "username": "Alakazam"}]}, {"name": "Previous version was grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}, {"user_id": 302985, "username": "lotiasite"}]}], "writtenBy": []}},
  "Heatran": {"sets": [{"name": "Air Balloon Offensive"}, {"name": "Choice Scarf"}, {"name": "Air Balloon Defensive"}, {"name": "Custap Berry"}]},
  "Excadrill": {"sets": [{"name": "Life Orb"}]},
  "Conkeldurr": {"sets": [{"name": "Life Orb"}], "credits": {"teams": [{"name": "Previous version written by", "members": [{"user_id": 457210, "username": "Morgan"}]}, {"name": "Previous version quality checked by", "members": [{"user_id": 276708, "username": "Alakazam"}, {"user_id": 425798, "username": "pqs"}]}, {"name": "Previous version grammar checked by", "members": [{"user_id": 232216, "username": "Lumari"}]}], "writtenBy": []}},
  "Seismitoad": {"sets": [{"name": "Choice Band"}]},
  "Sawk": {"sets": [{"name": "Custap Berry"}, {"name": "Choice Band"}, {"name": "Choice Scarf"}], "credits": {"teams": [{"name": "Previous version was written by", "members": [{"user_id": 457210, "username": "Morgan"}, {"user_id": 316445, "username": "lost heros"}, {"user_id": 276708, "username": "Alakazam"}]}, {"name": "Previous version was quality checked by", "members": [{"user_id": 475993, "username": "Boat"}, {"user_id": 425798, "username": "pqs"}, {"user_id": 276708, "username": "Alakazam"}]}, {"name": "Previous version was grammar checked by", "members": [{"user_id": 241023, "username": "Kris"}, {"user_id": 232216, "username": "Lumari"}]}], "writtenBy": []}},
  "Whimsicott": {"sets": [{"name": "Babiri Berry"}, {"name": "Occa Berry"}, {"name": "Kebia Berry"}], "credits": {"teams": [{"name": "Previous version was written by", "members": [{"user_id": 442711, "username": "Mubs"}]}, {"name": "Previous version was quality checked by", "members": [{"user_id": 474883, "username": "Waylaid"}, {"user_id": 317056, "username": "dogknees"}]}, {"name": "Previous version was grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}]}], "writtenBy": []}},
  "Krookodile": {"sets": [{"name": "Anti-Haxorus"}, {"name": "Assault Vest"}]},
  "Darmanitan": {"sets": [{"name": "Choice Scarf"}, {"name": "Choice Band"}], "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 474883, "username": "Waylaid"}, {"user_id": 317056, "username": "dogknees"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}]}], "writtenBy": [{"user_id": 481177, "username": "maki"}]}},
  "Darmanitan-Galar": {
    "sets": [
      {
        "name": "Choice Band",
        "description": "<h1>Set Description</h1> <p>Galarian Darmanitan uses its great Attack, decent Speed tier, Gorilla Tactics, and Choice Band to OHKO as many opponents as possible before they can move. Either Icicle Crash or Ice Punch can be used; Ice Punch has perfect accuracy, but Icicle Crash has more power, notably securing matchups against Bulk Up Zarude, Rocky Helmet Aromatisse, and physically bulky Tapu Lele. Icicle Crash also has a 30% flinch chance, allowing Galarian Darmanitan to potentially beat Sturdy users and bulkier threats like Crustle and Aromatisse. Giga Impact OHKOes many bulkier Pokemon such as Sylveon and Primarina and even has a chance to OHKO physically defensive Tapu Fini. Flare Blitz does massive damage to Steel-types, notably OHKOing Registeel and non-Occa Berry Celesteela, and also helps Galarian Darmanitan defeat slower Volcarona sets. The last move is usually one of Superpower, Earthquake, or Iron Head. Superpower helps against Tyranitar, Air Balloon Heatran, bulky Kyurem and Chansey, Earthquake beats some Arcanine and Sitrus Berry Volcanion more reliably, and Iron Head reliably beats Aromatisse.</p> <h1>EVs</h1> <p>Adamant is usually preferred, as it performs better versus bulkier Pokemon, like Tapu Fini and Aromatisse. The 4 Special Defense EVs block Pokemon with the ability Download, most notably Porygon2, from getting +1 Special Attack.</p> <p>On bulkier spreads, Giga Impact is less valuable, since it lacks the necessary Attack investment to OHKO Tapu Fini. However, it is still valuable versus Sylveon and Primarina.</p> <p>An alternative spread of 88 Atk / 244 Def / 176 Spe outspeeds Rillaboom and survives Celesteela's uninvested Heavy Slam and Life Orb Rillaboom's Fake Out + Grassy Glide.</p> <p>An alternative spread of 8 HP / 116 Atk / 132 SpD / 252 Spe survives Choice Scarf Togekiss's Fire Blast and Choice Specs Tapu Fini's Hydro Pump so that it can KO them with Icicle Crash and two Earthquakes, respectively.</p> <h1>Usage Tips</h1> <p>If Galarian Darmanitan does not have Iron Head, it should use Icicle Crash or Ice Punch against Aromatisse, rather than Giga Impact. Even though Giga Impact has a chance to OHKO, it has better odds to 2HKO with Ice Punch or Icicle Crash + Struggle. Galarian Darmanitan is 2HKOed by Moonblast and Rocky Helmet damage from Aromatisse, which means that if Aromatisse dodges or survives Giga Impact turn 1 and uses Trick Room, it can use Moonblast, disable Giga Impact as it recharges, and use Moonblast again to KO Galarian Darmanitan.</p> <p>With the defensive spread, use Icicle Crash or Ice Punch versus Celesteela instead of Flare Blitz. This ensures that Celesteela will not KO Galarian Darmanitan afterwards, and the Ice-type moves 2HKO most Celesteela.</p> "
      },
      {
        "name": "Choice Scarf",
        "description": "<h1>Set Description</h1> <p>Icicle Crash is Galarian Darmanitan's strongest STAB option. Superpower beats non-Chople variants of Porygon-Z, Urshifu-S, and Kyurem. Earthquake is for Nihilego, Entei, and Zeraora. The last move is more variable, depending on the needs of the team; Flare Blitz for a better Celesteela and Metagross matchup, Thrash for Choice Scarf Tapu Fini, Rock Slide for Volcarona, or Lash Out for Spectrier.</p> <h1>EVs</h1> <p>Galarian Darmanitan runs maximum Speed and a Speed-boosting nature to outspeed Choice Scarf Porygon-Z and Pheromosa. The leftover 4 EVs are put into Special Defense so Download users like Porygon2 get an Attack boost instead of a Special Attack boost.</p> <p>An Adamant nature instead of a Jolly nature helps versus Heatran, but loses out on Timid Choice Scarf Kyurem and Porygon-Z, as well as other Galarian Darmanitan.</p> <p>An alternative spread of 160 Atk / 112 Def / 236 Spe and an Adamant nature allows Galarian Darmanitan to survive Jolly Garchomp's Stone Edge and Adamant Garchomp's Outrage, so this spread is fairly reliable versus Choice Scarf and Custap Berry Garchomp.</p> <p>If using Thrash, consider an EV spread of 4 HP / 144 Atk / 104 SpD / 252 Spe to survive Choice Specs Tapu Fini's Hydro Pump.</p> <h1>Usage Tips</h1> <p>In nearly every matchup, use the move that does the most damage to come out on top.</p> "
      },
      {
        "name": "Zen Mode",
        "description": "<h1>Set Description</h1> <p>Icicle Crash and, after activating Zen Mode, Flare Blitz are Galarian Darmanitan's strongest STAB options. In most matchups, Zen Mode is triggered when Galarian Darmanitan uses Endure on an attack that would otherwise OHKO it, activating both Zen Mode and the Salac Berry. To round out this set, Galarian Darmanitan-Z can use Encore to lock opponents into non-damaging moves, such as Endure. Reversal is another option, which can defeat Kyurem and Heatran.</p> <h1>EVs</h1> <p>Adamant is the preferred nature, as base 135 Speed and at +1 Speed outspeeds all relevant threats.</p> <h1>Usage Tips</h1> <p>When Galarian Darmanitan-Z can outspeed and OHKO an opponent, such as Venusaur and Ferrothorn, Galarian Darmanitan should just attack turn 1. Other matchups, where Darmanitan is outsped and OHKOed, like versus Pheromosa and Kartana, Galarian Darmanitan should use Endure, activate the Salac Berry, and OHKO the next turn.</p> <p>Note that Galarian Darmanitan-Z is much weaker without Gorilla Tactics, so it does not KO bulkier Pokemon that it normally expects to like Regidrago.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 501918, "username": "Here Comes Team Charm!"}, {"user_id": 509647, "username": "Mishlef"}, {"user_id": 474883, "username": "Waylaid"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}, {"name": "Previous version written by", "members": [{"user_id": 393488, "username": "Scholar"}, {"user_id": 485303, "username": "Notater"}]}, {"name": "Previous version quality checked by", "members": [{"user_id": 457210, "username": "Morgan"}, {"user_id": 425798, "username": "pqs"}, {"user_id": 276708, "username": "Alakazam"}]}, {"name": "Previous version grammar checked by", "members": [{"user_id": 232216, "username": "Lumari"}, {"user_id": 302985, "username": "lotiasite"}]}], "writtenBy": [{"user_id": 518399, "username": "Itchy"}]}
  },
  "Crustle": {
    "comments": "<h1>Other Options</h1> <p>Another item option for Shell Smash Crustle is White Herb to safely set up against Breaking Swipe Regidrago, physically defensive Landorus-T, and fast Rock Tomb Dracovish. Make sure you are slower than Regidrago to have White Herb go into effect on Breaking Swipe's Attack drop and not on the Defense and Special Defense drops of Shell Smash. Solar Blade can be used on the Choice Band set to lure Pokemon such as Swampert, Gastrodon, and Quagsire.</p> ",
    "sets": [
      {
        "name": "Shell Smash",
        "description": "<h1>Set Description</h1> <p>The combination of Sturdy and Mental Herb allows Crustle to safely set up against nearly any Pokemon without the threat of Taunt, Encore, or being OHKOed. Sturdy allows Crustle to live at least one hit from Pokemon such as Celesteela, Galarian Darmanitan, Volcanion, Volcarona, Kyurem, and non-Mold Breaker Haxorus, and due to the immense power of Rock Wrecker, they will be OHKOed after a Shell Smash boost. Mental Herb allows Crustle to safely Shell Smash against Encore Aromatisse and Taunt users such as Whimsicott. Rock Blast is used to break past Substitute users such as Entei, Zapdos, or Whimsicott to avoid Rock Wrecker's recharge turn. For the fourth moveslot, Counter is often used to beat Choice item Dracovish, non-Mold Breaker Haxorus, and some Zeraora sets. X-Scissor is occasionally used over Counter to beat Trick Cresselia and Zarude consistently. Lum Berry can be used to consistently beat Yawn Sylveon and can help in the Will-O-Wisp Volcanion matchup.</p> <h1>EVs</h1> <p>Maximum Speed investment allows Crustle to outspeed most of the metagame after a Shell Smash, while maximum Attack gives it the best rolls to OHKO a non-Defense invested Porygon-Z. Mental Herb Crustle can also use a Jolly Nature with the same EVs to outspeed Electric Seed Tapu Koko after a Shell Smash and KO it with Rock Wrecker.</p> <h1>Usage Tips</h1> <p>Crustle's main strategy is to utilize the combination of Sturdy and Shell Smash to set up without being OHKOed, and OHKO back with Rock Wrecker. Crustle can also use the combination of Shell Smash and Rock Blast to break past Substitute Pokemon like Zapdos or Entei. Against Pokemon such as Primarina or Sylveon, which can potentially run Custap Berry, you may want to Shell Smash twice to avoid clicking Rock Wrecker on Endure. It is important to note that due to Crustle's low Speed tier, it will not be able to outspeed Zeraora or Dragapult at +2 Speed.</p> "
      },
      {
        "name": "Choice Band",
        "description": "<h1>Set Description</h1> <p>With Choice Band, Crustle is able to OHKO Pokemon such as Porygon-Z without Reflect, Primarina, and offensive Azumarill. Rock Blast is used to break through Substitute Pokemon like Zapdos, Entei, and Volcarona, while Earthquake secures the Zeraora and Aegislash matchups. Choice Band Crustle has several options for the last move: Heavy Slam consistently beats Aromatisse and Sylveon, X-Scissor is used to beat Zarude and Trick Cresselia, and Counter beats Choice item attackers such as Dracovish, Urshifu-S, and Garchomp.</p> <h1>EVs</h1> <p>232 HP and 24 Def EVs allow Crustle to survive Choice Band Haxorus's Outrage. 29 Speed IVs allow Crustle to underspeed Aegislash and OHKO its Blade Forme.</p> <h1>Usage Tips</h1> <p>Choice Band Crustle is very straightforward; in nearly every matchup you should use the strongest move, whether it is Rock Wrecker, Heavy Slam, or Earthquake. The one exception to this is against Substitute Pokemon, where Rock Blast is better.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 518399, "username": "Itchy"}, {"user_id": 474883, "username": "Waylaid"}]}, {"name": "Grammar checked by", "members": [{"user_id": 277988, "username": "dex"}]}, {"name": "Previous version written by", "members": [{"user_id": 276708, "username": "Alakazam"}, {"user_id": 425798, "username": "pqs"}]}, {"name": "Previous version quality checked by", "members": [{"user_id": 457210, "username": "Morgan"}, {"user_id": 425798, "username": "pqs"}, {"user_id": 317056, "username": "dogknees"}, {"user_id": 474883, "username": "Waylaid"}]}, {"name": "Previous version grammar checked by", "members": [{"user_id": 241023, "username": "Kris"}, {"user_id": 297659, "username": "deetah"}]}], "writtenBy": [{"user_id": 558869, "username": "Nick"}]}
  },
  "Carracosta": {"sets": [{"name": "Power Herb"}]},
  "Archeops": {"sets": [{"name": "Life Orb"}, {"name": "Choice Band"}, {"name": "Choice Scarf"}]},
  "Reuniclus": {"sets": [{"name": "Stored Power"}]},
  "Escavalier": {"sets": [{"name": "Assault Vest"}, {"name": "Sitrus Berry"}]},
  "Jellicent": {"sets": [{"name": "Maranga Berry"}, {"name": "Choice Scarf"}]},
  "Ferrothorn": {
    "sets": [
      {
        "name": "Iron Defense + Chople Berry",
        "description": "<h1>Set Description</h1> <p>Thanks to its incredible mixed bulk, Ferrothorn can handle many top-tier threats such as Primarina, Tapu Fini, and Magnezone. Holding a Chople Berry allows it to beat Fighting-types such as Pheromosa, non-Fire Punch Sawk, and Urshifu-R.</p> <p>Gyro Ball is typically Ferrothorn's strongest move and helps it deal with Fairy-types such as Sylveon, Tapu Lele and, Diancie. Iron Defense + Body Press allows Ferrothorn to deal with threats such as Zeraora without Blaze Kick and Chansey, increasing both its physical bulk and Body Press's power.</p> <p>For its final moveslot, it can either run Leech Seed or Power Whip. Leech Seed lets you beat Assault Vest and Haban Berry Regidrago, Assault Vest Landorus-T, and Iron Defense Registeel. Power Whip allows Ferrothorn to hit Water-types like Tapu Fini and Primarina.</p> <h1>EVs</h1> <p>248 HP and 52 Defense EVs with a Relaxed nature allow Ferrothorn to survive a Choice Band-boosted Close Combat from Jolly Choice Band Haxorus; 28 Attack EVs ensure that Ferrothorn OHKOes Haxorus after Iron Barbs damage and the Defense drop. The Special Defense EVs are for Custap Berry and Rocky Helmet Porygon-Z,  as well as Gardevoir if Ferrothorn has Leech Seed. 0 Speed IVs is used to maximize the damage of Gyro Ball.</p> <p>Another EV spread is 248 HP / 160 Def / 100 SpD. This bulks a Hyper Beam from Choice Specs Porygon-Z and 2HKOes with Body Press.</p> <h1>Usage Tips</h1> <p>Pokemon such as Tapu Fini and Metagross can use Trick to give Ferrothorn a Choice item. To handle this, Ferrothorn should use a damaging move against these Pokemon (removed E accent) turn 1. Against Encore + Disable Alolan Ninetales, Ferrothorn should use Gyro Ball turn one, and it should use either Power Whip or Leech Seed next turn to avoid wasting a turn due to Disable. This guarantees a win against both Encore + Disable and Life Orb variants of Alolan Ninetales. Against Zeraora, Ferrothorn should use Iron Defense on the first turn, which lets it survive the second turn and then KO with Body Press due to Close Combat Defense drops. If you believe your opponent is running a defensive Urshifu-R, use Iron Defense on the first turn to not get KOed by Body Press. However, if you suspect Urshifu-R is offensive, use Power Whip on the first turn instead to OHKO it after Close Combat. Be mindful that some Pokemon may run Fire-type coverage for Ferrothorn's 4x weakness to deal with it, such as Zeraora, Urshifu-R, Dragapult, and Dracozolt.</p> "
      },
      {
        "name": "Custap Berry",
        "description": "<h1>Set Description</h1> <p>The combination of Endure + Custap Berry allows Ferrothorn to survive a hit that would KO and move first the next turn. Gyro Ball, which is often Ferrothorn's strongest move, helps beat Pokemon such as Galarian Darmanitan, Togekiss, and Sylveon. Payback helps Ferrothorn beat Pokemon like non-Choice Specs Magnezone, Metagross, and Trick + Choice Scarf Cresselia. Revenge helps the Magnezone matchup and helps Ferrothorn beat Aggron. Leech Seed solidifies the Aromatisse and Regidrago matchups by allowing Ferrothorn to survive longer and set up further Swords Dances.</p> <h1>EVs</h1> <p>240 HP EVs, 52 Defense EVs, and a Relaxed nature allow Ferrothorn to survive Fire Fang from Choice Band Garchomp.</p> <h1>Usage Tips</h1> <p>If a Pokemon's attack will bring Ferrothorn to 25% or less health, it can set up a Swords Dance on the first turn and use its Custap Berry to move first on the next turn. This strategy can be used against Zeraora, Landorus without Protect, and Rillaboom. Against potential Encore users, Ferrothorn should use a damaging move to avoid being locked into Swords Dance or Endure. Against Choice Scarf Togekiss, usually use Endure the first turn to predict their Fire-type coverage and then Gyro Ball on the second turn. However, Togekiss can also use Trick or Encore on the first turn. To avoid this, Ferrothorn can use Gyro Ball on the first turn. Against Alolan Ninetales, Ferrothorn should use Gyro Ball into Power Whip to prevent Disable and Encore from forcing it to use Struggle. Against Aromatisse, Ferrothorn should use Leech Seed on the first turn due to Gyro Ball’s low damage output; due to its HP investment, it can beat Aromatisse even after Aromatisse locks it into Leech Seed or makes it use Struggle. Custap Berry Ferrothorn can beat Choice Band Garchomp by clicking Swords Dance into Gyro Ball, and it beats Regidrago by using Gyro Ball first to avoid being OHKOed by a combination of Dragon Energy and Draco Meteor.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 415626, "username": "LeCehlou"}, {"user_id": 474883, "username": "Waylaid"}, {"user_id": 430787, "username": "PA"}, {"user_id": 518399, "username": "Itchy"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}], "writtenBy": [{"user_id": 489963, "username": "SwordIsBored"}]}
  },
  "Chandelure": {"sets": [{"name": "Custap Berry"}], "credits": {"teams": [{"name": "Previous version was written by", "members": [{"user_id": 393488, "username": "Scholar"}]}, {"name": "Previous version was quality checked by", "members": [{"user_id": 457210, "username": "Morgan"}, {"user_id": 425798, "username": "pqs"}]}, {"name": "Previous version was grammar checked by", "members": [{"user_id": 232216, "username": "Lumari"}]}], "writtenBy": []}},
  "Haxorus": {"sets": [{"name": "Choice Scarf"}, {"name": "Choice Band"}, {"name": "Custap Berry"}, {"name": "Life Orb"}], "credits": {"teams": [{"name": "Previous version written by", "members": [{"user_id": 430787, "username": "PA"}, {"user_id": 393488, "username": "Scholar"}]}, {"name": "Previous version quality checked by", "members": [{"user_id": 457210, "username": "Morgan"}, {"user_id": 276708, "username": "Alakazam"}, {"user_id": 425798, "username": "pqs"}, {"user_id": 474883, "username": "Waylaid"}, {"user_id": 457703, "username": "Synonimous"}]}, {"name": "Previous version grammar checked by", "members": [{"user_id": 241023, "username": "Kris"}, {"user_id": 388157, "username": "A Cake Wearing A Hat"}]}], "writtenBy": []}},
  "Durant": {"sets": [{"name": "Life Orb"}, {"name": "Entrainment"}], "credits": {"teams": [{"name": "Previous version was written by", "members": [{"user_id": 442711, "username": "Mubs"}, {"user_id": 444257, "username": "XinosXinos"}]}, {"name": "Previous version was quality checked by", "members": [{"user_id": 457210, "username": "Morgan"}, {"user_id": 425798, "username": "pqs"}, {"user_id": 276708, "username": "Alakazam"}]}, {"name": "Previous version was grammar checked by", "members": [{"user_id": 241023, "username": "Kris"}]}], "writtenBy": []}},
  "Hydreigon": {"sets": [{"name": "Choice Specs"}, {"name": "Choice Scarf"}, {"name": "Haban Berry"}], "credits": {"teams": [{"name": "Previous version was written by", "members": [{"user_id": 393488, "username": "Scholar"}]}, {"name": "Previous version was quality checked by", "members": [{"user_id": 457210, "username": "Morgan"}, {"user_id": 425798, "username": "pqs"}, {"user_id": 276708, "username": "Alakazam"}, {"user_id": 317056, "username": "dogknees"}]}, {"name": "Previous version was grammar checked by", "members": [{"user_id": 232216, "username": "Lumari"}, {"user_id": 240732, "username": "Astra"}]}], "writtenBy": []}},
  "Volcarona": {"sets": [{"name": "Kee Berry"}, {"name": "Life Orb"}, {"name": "Custap Berry"}, {"name": "Choice Specs"}]},
  "Terrakion": {"sets": [{"name": "Weakness Policy"}]},
  "Thundurus-Therian": {"sets": [{"name": "Choice Specs"}, {"name": "Assault Vest"}]},
  "Landorus": {"sets": [{"name": "Fast Life Orb"}, {"name": "Bulky Life Orb"}, {"name": "Choice Specs"}, {"name": "Choice Band"}]},
  "Landorus-Therian": {"sets": [{"name": "Fast Choice Band"}, {"name": "Bulky Choice Band"}, {"name": "Assault Vest"}, {"name": "Life Orb"}, {"name": "Lum Berry"}]},
  "Kyurem": {"sets": [{"name": "Choice Specs"}, {"name": "Haban Berry Stall"}, {"name": "Haban Berry Offensive"}, {"name": "Assault Vest"}, {"name": "Chople Berry"}, {"name": "Choice Scarf"}, {"name": "Roseli Berry"}, {"name": "Weakness Policy"}]},
  "Keldeo": {"sets": [{"name": "Sitrus Berry"}]},
  "Diggersby": {"sets": [{"name": "Life Orb"}], "credits": {"teams": [{"name": "Previous version written by", "members": [{"user_id": 425798, "username": "pqs"}]}, {"name": "Previous version quality checked by", "members": [{"user_id": 457210, "username": "Morgan"}, {"user_id": 276708, "username": "Alakazam"}, {"user_id": 474883, "username": "Waylaid"}, {"user_id": 506856, "username": "Potatochan"}]}, {"name": "Previous version grammar checked by", "members": [{"user_id": 302985, "username": "lotiasite"}, {"user_id": 241023, "username": "Kris"}]}], "writtenBy": []}},
  "Talonflame": {"sets": [{"name": "Kee Berry"}]},
  "Aegislash": {"sets": [{"name": "Life Orb"}, {"name": "Weakness Policy"}], "credits": {"teams": [{"name": "Previous version written by", "members": [{"user_id": 425798, "username": "pqs"}]}, {"name": "Previous version quality checked by", "members": [{"user_id": 457210, "username": "Morgan"}, {"user_id": 276708, "username": "Alakazam"}]}, {"name": "Previous version grammar checked by", "members": [{"user_id": 241023, "username": "Kris"}]}], "writtenBy": []}},
  "Aromatisse": {"sets": [{"name": "Defensive Rocky Helmet"}, {"name": "Bulky Rocky Helmet"}, {"name": "Bulky Wiki Berry"}], "credits": {"teams": [{"name": "Previous version was written by", "members": [{"user_id": 481177, "username": "maki"}]}, {"name": "Previous version was quality checked by", "members": [{"user_id": 457210, "username": "Morgan"}, {"user_id": 276708, "username": "Alakazam"}]}, {"name": "Previous version was grammar checked by", "members": [{"user_id": 168392, "username": "P Squared"}]}], "writtenBy": []}},
  "Slurpuff": {"sets": [{"name": "Cotton Guard + Belly Drum"}]},
  "Sylveon": {"sets": [{"name": "Choice Specs"}, {"name": "Custap Berry"}, {"name": "Yawn"}], "credits": {"teams": [{"name": "Previous version was written by", "members": [{"user_id": 501918, "username": "Here Comes Team Charm"}]}, {"name": "Previous version was quality checked by", "members": [{"user_id": 430787, "username": "PA"}, {"user_id": 520168, "username": "Murman"}]}, {"name": "Previous version was grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}]}], "writtenBy": []}},
  "Goodra": {"sets": [{"name": "Sap Sipper"}, {"name": "Gooey"}]},
  "Avalugg": {"sets": [{"name": "Stall"}, {"name": "Bulky Band"}, {"name": "Fast Band"}], "credits": {"teams": [{"name": "Previous version was written by", "members": [{"user_id": 425798, "username": "pqs"}]}, {"name": "Previous version was quality checked by", "members": [{"user_id": 276708, "username": "Alakazam"}, {"user_id": 480297, "username": "zioziotrip"}]}, {"name": "Previous version was grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}]}], "writtenBy": []}},
  "Diancie": {"sets": [{"name": "Weakness Policy"}, {"name": "Choice Specs"}]},
  "Volcanion": {"sets": [{"name": "Choice Specs"}, {"name": "Sitrus Berry"}, {"name": "Choice Scarf"}, {"name": "Custap Berry"}]},
  "Incineroar": {"sets": [{"name": "Weakness Policy"}, {"name": "Assault Vest"}, {"name": "Chople Berry"}]},
  "Primarina": {"sets": [{"name": "Custap Berry"}, {"name": "Sitrus Berry"}, {"name": "Choice Specs"}, {"name": "Wacan Berry"}], "credits": {"teams": [{"name": "Previous version written by", "members": [{"user_id": 451287, "username": "Krytocon"}, {"user_id": 425798, "username": "pqs"}]}, {"name": "Previous version quality checked by", "members": [{"user_id": 276708, "username": "Alakazam"}, {"user_id": 480297, "username": "zioziotrip"}, {"user_id": 317056, "username": "dogknees"}, {"user_id": 425798, "username": "pqs"}]}, {"name": "Previous version grammar checked by", "members": [{"user_id": 297659, "username": "deetah"}, {"user_id": 388157, "username": "A Cake Wearing A Hat"}]}], "writtenBy": []}},
  "Toxapex": {"sets": [{"name": "Stall"}]},
  "Golisopod": {"sets": [{"name": "Assault Vest"}]},
  "Pyukumuku": {"sets": [{"name": "Counter + Mirror Coat"}]},
  "Type: Null": {"sets": [{"name": "Stall"}]},
  "Silvally-Fairy": {"sets": [{"name": "Mixed Attacker"}]},
  "Silvally-Grass": {"sets": [{"name": "Mixed Defensive"}]},
  "Silvally-Poison": {"sets": [{"name": "Substitute + Reversal"}]},
  "Silvally-Water": {"sets": [{"name": "Iron Defense"}]},
  "Kommo-o": {"sets": [{"name": "Sitrus Berry"}, {"name": "Haban Berry"}, {"name": "Yache Berry"}], "credits": {"teams": [{"name": "Previous version was quality checked by", "members": [{"user_id": 480297, "username": "pqs"}, {"user_id": 317056, "username": "dogknees"}, {"user_id": 480297, "username": "zioziotrip"}]}, {"name": "Previous version was grammar checked by", "members": [{"user_id": 216033, "username": "Winry"}]}], "writtenBy": []}},
  "Tapu Koko": {"sets": [{"name": "Electric Seed Stall"}, {"name": "Charge + Wild Charge"}, {"name": "Life Orb"}, {"name": "Thief"}, {"name": "Electric Seed Offensive"}], "credits": {"teams": [{"name": "Previous version was written by", "members": [{"user_id": 518399, "username": "Itchy"}]}, {"name": "Previous version was quality checked by", "members": [{"user_id": 501918, "username": "Here Comes Team Charm!"}, {"user_id": 520168, "username": "Murman"}]}, {"name": "Previous version was grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}], "writtenBy": []}},
  "Tapu Lele": {"sets": [{"name": "Psychic Seed"}, {"name": "Custap Berry"}, {"name": "Choice Specs"}, {"name": "Weakness Policy"}, {"name": "Choice Scarf"}, {"name": "Anti-Magnezone"}]},
  "Tapu Bulu": {"sets": [{"name": "Defensive Grassy Seed"}, {"name": "Fast Grassy Seed"}]},
  "Tapu Fini": {"sets": [{"name": "Sitrus Berry"}, {"name": "Leftovers"}, {"name": "Choice Scarf"}, {"name": "Choice Specs"}, {"name": "Weakness Policy"}]},
  "Nihilego": {"sets": [{"name": "Fast Power Herb"}, {"name": "Defensive Power Herb"}, {"name": "Choice Specs"}]},
  "Buzzwole": {"sets": [{"name": "Occa Berry"}, {"name": "Choice Band"}]},
  "Pheromosa": {"sets": [{"name": "Choice Band"}, {"name": "Choice Specs"}]},
  "Celesteela": {"sets": [{"name": "Sitrus Berry"}, {"name": "Custap Berry"}, {"name": "Leech Seed Stall"}, {"name": "Choice Band"}, {"name": "Choice Specs"}, {"name": "Anti-Metagross"}, {"name": "Life Orb"}]},
  "Kartana": {"sets": [{"name": "Life Orb"}, {"name": "Choice Band"}, {"name": "Choice Scarf"}]},
  "Naganadel": {"sets": [{"name": "Life Orb"}, {"name": "Choice Specs"}, {"name": "Choice Scarf"}]},
  "Blacephalon": {"sets": [{"name": "Choice Specs"}, {"name": "Choice Scarf"}, {"name": "Petaya Berry + Encore"}]},
  "Zeraora": {"sets": [{"name": "Life Orb"}, {"name": "Assault Vest"}, {"name": "Choice Band"}, {"name": "Weakness Policy"}, {"name": "Special Attacker"}], "credits": {"teams": [{"name": "Previous version was written by", "members": [{"user_id": 470842, "username": "Eriey"}]}, {"name": "Previous version was quality checked by", "members": [{"user_id": 475993, "username": "Boat"}, {"user_id": 276708, "username": "Alakazam"}]}, {"name": "Previous version was grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}]}], "writtenBy": []}},
  "Rillaboom": {"sets": [{"name": "Life Orb"}, {"name": "Grassy Seed"}, {"name": "Assault Vest"}, {"name": "SubSeed"}, {"name": "Weakness Policy"}]},
  "Raboot": {"sets": [{"name": "Bulky Offense"}]},
  "Corviknight": {"sets": [{"name": "Iron Defense Stall"}, {"name": "Substitute Stall"}], "credits": {"teams": [{"name": "Previous version written by", "members": [{"user_id": 430787, "username": "PA"}]}, {"name": "Previous version quality checked by", "members": [{"user_id": 457210, "username": "Morgan"}, {"user_id": 302951, "username": "Nalei"}]}, {"name": "Previous version grammar checked by", "members": [{"user_id": 241023, "username": "Kris"}]}], "writtenBy": []}},
  "Toxtricity": {"sets": [{"name": "Life Orb"}]},
  "Grimmsnarl": {"sets": [{"name": "Choice Band"}, {"name": "Bulk Up"}]},
  "Dracozolt": {"sets": [{"name": "Choice Scarf"}, {"name": "Life Orb"}, {"name": "Custap Berry"}], "credits": {"teams": [{"name": "Previous version was written by", "members": [{"user_id": 465905, "username": "Cantius"}]}, {"name": "Previous version was quality checked by", "members": [{"user_id": 457210, "username": "Morgan"}, {"user_id": 302951, "username": "Nalei"}]}, {"name": "Previous version was grammar checked by", "members": [{"user_id": 241023, "username": "Kris"}]}], "writtenBy": []}},
  "Dracovish": {"sets": [{"name": "Life Orb"}, {"name": "Custap Berry"}, {"name": "Choice Scarf"}], "credits": {"teams": [{"name": "Previous version written by", "members": [{"user_id": 276708, "username": "Alakazam"}, {"user_id": 501316, "username": "zxgzxg"}]}, {"name": "Previous version quality checked by", "members": [{"user_id": 457210, "username": "Morgan"}, {"user_id": 475993, "username": "Boat"}, {"user_id": 425798, "username": "pqs"}, {"user_id": 457703, "username": "Synonimous"}]}, {"name": "Previous version grammar checked by", "members": [{"user_id": 241023, "username": "Kris"}]}], "writtenBy": []}},
  "Dragapult": {"sets": [{"name": "Choice Band"}, {"name": "Curse"}, {"name": "Hex"}, {"name": "Choice Specs"}], "credits": {"teams": [{"name": "Previous version was written by", "members": [{"user_id": 302951, "username": "Nalei"}]}, {"name": "Previous version was quality checked by", "members": [{"user_id": 457703, "username": "Synonimous"}, {"user_id": 457210, "username": "Morgan"}]}, {"name": "Previous version was grammar checked by", "members": [{"user_id": 241023, "username": "Kris"}]}], "writtenBy": []}},
  "Urshifu": {"sets": [{"name": "Bulky Chople Berry"}, {"name": "Fast Chople Berry"}, {"name": "Choice Band"}, {"name": "Assault Vest"}, {"name": "Custap Berry"}, {"name": "Life Orb"}, {"name": "Choice Scarf"}]},
  "Urshifu-Rapid-Strike": {"sets": [{"name": "Iron Defense + Body Press"}, {"name": "Life Orb"}, {"name": "Choice Band"}, {"name": "Assault Vest"}, {"name": "Wacan Berry"}]},
  "Zarude": {"sets": [{"name": "Weakness Policy + Encore"}, {"name": "Weakness Policy + Snarl"}, {"name": "Assault Vest"}, {"name": "Choice Scarf"}]},
  "Regieleki": {
    "comments": "<h1>Other Options</h1> <p>Running Thunderbolt over Electro Ball is an option, giving Regieleki a reliable Electric-type STAB move that cannot miss. However, this comes at the cost of several significant matchups, like Aromatisse and Registeel, which is generally not worth the slight increase in accuracy in those few matchups where it matters.</p> <p>Regieleki can run a fast specially defensive stall set with a Maranga Berry, Substitute, Eerie Impulse, Rest, and Thunder Cage. This allows it to lure some would-be counters like Sylveon, Nihilego, Goodra, and Mirror Coat Avalugg while retaining solid matchups against most other special attackers. However, this set loses to many physical attackers, and the bulk requirements mean that several Choice Scarf users can now outspeed Regieleki.</p> ",
    "sets": [
      {
        "name": "Choice Specs",
        "description": "<h1>Set Description</h1> <p>Regieleki's amazing Speed stat and powerful Electric-type moves give it an unique niche in the metagame. Thunder Cage is its main STAB move, dealing solid damage and beating Endure users like Primarina, Blaziken, and Porygon-Z. Thunder deals more damage, which matters against Pokemon like Spectrier and non-specially defensive Necrozma. Hyper Beam deals with some frail Pokemon that resist Electric, like Naganadel, Haxorus, and opposing Regieleki. Electro Ball covers for a few slow Pokemon like Registeel and specially defensive Aromatisse.</p> <h1>EVs</h1> <p>252 Special Attack EVs allow Regieleki to OHKO physically bulky Necrozma, and 252 Speed EVs let it tie opposing Regieleki and maximize Electro Ball damage. The remaining EVs are put in Defense, as most priority moves and the few Choice Scarf users that outspeed Regieleki skew physically.</p> <h1>Usage Tips</h1> <p>Regieleki's matchups are simple: figure out what move can OHKO and use it. Against potential Endure users like Primarina and Galarian Moltres, Regieleki should use Thunder Cage to KO them with trapping damage if they use Endure. In situations where Thunder Cage deals sufficient damage to KO, it should be used over Thunder, as it has a smaller risk to miss.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 442711, "username": "Mubs"}, {"user_id": 520168, "username": "Murman"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}]}], "writtenBy": [{"user_id": 501918, "username": "Here Comes Team Charm!"}]}
  },
  "Regidrago": {
    "comments": "<h1>Other Options</h1> <p>Regidrago can run a Weakness Policy set for slow Ice-types like Glastrier and Avalugg, which other Regidrago sets cannot reliably defeat. This set runs an EV spread of 12 HP / 132 Atk / 204 Def / 48 SpD / 112 Spe with the Impish nature and the moves Breaking Swipe, Outrage, Draco Meteor, and Dragon Dance or Scale Shot. The physical bulk allows Regidrago to survive a Choice Band Avalugg's Avalanche and KO it back with Draco Meteor. This set also beats non-Choice Band Glastrier by using Breaking Swipe, surviving any follow-up attack, then finishing it off with a +2 Outrage. The Special Defense and Speed EVs allow Regidrago to survive Nihilego's Meteor Beam and outspeed it at +1. With these EVs, Regidrago also outspeeds other Pokemon like Entei and Zapdos after Scale Shot. Running Dragon Dance on this set helps with the Chansey matchup, but Scale Shot helps more versus a greater variety of Pokemon.</p> ",
    "sets": [
      {
        "name": "Haban Berry",
        "description": "<h1>Set Description</h1> <p>Scale Shot is used to outspeed foes and then deal immense damage to them the following turn with Outrage or Drago Meteor. It also breaks potential Substitutes and gives a +1 Speed boost, letting Regidrago outspeed Pokemon like Entei, Zapdos, and Volcarona. Outrage OHKOes many Dragon-types such as Naganadel and Dragapult after surviving their attacks with Haban Berry. Breaking Swipe + Draco Meteor improves the Avalugg matchup, as at -1 Attack, Regidrago survives an Icicle Spear and has favorable odds to tank an Avalanche. Then, Regidrago KOes back with Draco Meteor due to Avalugg's bad Special Defense.</p> <h1>EVs</h1> <p>With 96 Speed EVs and a Speed boost from Scale Shot, Regidrago outspeeds base 100 Speed Pokemon like Entei and the Zapdos formes. The Defense investment alongside Haban Berry allows Regidrago to tank a Dragon Darts from Choice Band Dragapult, and the Special Defense investment allows Regidrago to survive Draco Meteor from Modest Choice Specs Naganadel.</p> <p>An alternative EV spread of 88 HP / 252 Def / 24 SpA / 144 SpD with a Bold nature can be run to beat Choice Band Zeraora. It does not have the Speed investment that the main spread has, though, so it won't outspeed base 100 Speed Pokemon after Scale Shot. This set should run Dragon Energy over Draco Meteor to deal more consistent damage to Rhyperior, Volcanion, and Swampert while also retaining some stallbreaking capabilities.</p> <h1>Usage Tips</h1> <p>Scale Shot should be used turn 1 versus faster stall Pokemon, especially Entei and Zapdos, since +1 Regidrago outspeeds and 2HKOes them with Outrage.</p> <p>Breaking Swipe should be used to reduce Avalugg's or Crustle's Attack and break their Sturdy ability; Regidrago survives their attacks at -1 and KOes either with Draco Meteor afterwards.</p> "
      },
      {
        "name": "Assault Vest",
        "description": "<h1>Set Description</h1> <p>Draco Meteor is usually used on turn 1, followed by Outrage on turn 2, since it does more damage than a -2 Draco Meteor. Dragon Energy deals more damage to targets like Volcanion and Rhyperior. Scale Shot helps Regidrago outspeed foes like SubSeed Rillaboom, breaking potential Substitutes as well. Assault Vest helps Regidrago secure matchups that it would lose otherwise, including Choice Specs Porygon-Z and Choice Specs Kyurem.</p> <h1>EVs</h1> <p>8 Speed EVs allow Regidrago to outspeed base 85 Speed Pokemon such as Cresselia and Rillaboom after a Scale Shot. With the bulk investment, Regidrago survives two Wicked Blows from maximum Attack Urshifu-S without an Attack-boosting nature and a Hyper Beam from Choice Specs Porygon-Z.</p> <p>An alternate EV spread of 12 HP / 204 Def / 8 SpA / 248 SpD / 36 Spe with a Bold nature and Breaking Swipe over Outrage secures the Choice Band Avalugg matchup. The Speed is for outspeeding Porygon-Z after a Scale Shot, and the Special Defense allows Regidrago to survive Nihilego's Acid Spray into Meteor Beam.</p> <h1>Usage Tips</h1> <p>Against Substitute users and base 85 Speed Pokemon, use Scale Shot first and follow up with one of your stronger STAB attacks.</p> <p>When versus Porygon-Z, use Draco Meteor on turn 1 because it almost always KOes. If Porygon-Z survives, then Outrage can be used on turn 2 while Porygon-Z recharges after Hyper Beam. If using the alternate spread, Scale Shot should be used turn 1 versus Porygon-Z because it has less Special Attack investment, though this is a losing sequence if Porygon-Z uses Trick because Scale Shot does not reliably 2HKO.</p> <p>Another matchup where Regidrago should use Draco Meteor on turn 1 is Urshifu-S; it should OHKO all variants except for Assault Vest, which can be dealt with by using Outrage on turn 2.</p> "
      },
      {
        "name": "Custap Berry",
        "description": "<h1>Set Description</h1> <p>Regidrago aims to gain surprise wins versus Pokemon such as Galarian Darmanitan that would otherwise KO it using Endure and a Custap Berry. Draco Meteor deals consistent damage to most targets like Zeraora, Galarian Darmanitan, and Dragapult after Regidrago is in Custap Berry range. Scale Shot is used to shut down some stall Pokemon like SubSeed Rillaboom, Breaking Swipe helps in the Zeraora matchup, and Outrage helps versus most Tyranitar and non-Kee Berry Volcarona. Dragon Energy hits slower foes like Volcanion and Rhyperior for heavy damage.</p> <h1>EVs</h1> <p>The Defense investment lets Regidrago survive an Avalanche from Choice Band Aggron and gives it good chances to avoid the 2HKO from Urshifu-S's unboosted Wicked Blow, while the Special Attack investment alongside a Modest nature allows Regidrago to always 2HKO most Assault Vest Urshifu sets with Draco Meteor.</p> <h1>Usage Tips</h1> <p>Use Endure versus Pokemon that threaten to OHKO Regidrago, such as Galarian Darmanitan, Naganadel, Dragapult, and Haxorus. Some of these threats have some counterplay; Dragapult can run Substitute, Life Orb Naganadel can run Protect, and Haxorus can nullify Regidrago's Custap Berry with Unnerve.</p> <p>If running Breaking Swipe, it should be used against Zeraora turn 1 to reduce its Attack. Use Outrage against Tyranitar because it does more damage than Regidrago's other moves. When low on HP, Draco Meteor or Outrage should always be used over Dragon Energy.</p> "
      },
      {
        "name": "Choice Band",
        "description": "<h1>Set Description</h1> <p>This set aims to lure Steel-types that normally beat Regidrago while retaining many of its core matchups. Outrage deals heavy neutral or super effective damage to foes. Scale Shot bypasses Substitutes and lets Regidrago outspeed base 100 Speed Pokemon like Zapdos. Regidrago uses Fire Fang to OHKO Kartana and 2HKO Ferrothorn and Magnezone and Crunch to 2HKO Metagross.</p> <h1>EVs</h1> <p>The Defense and HP investment allows Regidrago to survive two unboosted Meteor Mashes from Metagross so it can use Crunch to 2HKO. 96 Speed EVs allow Regidrago to outspeed neutral-natured Magnezone and 2HKO with Fire Fang, while the Special Defense investment allows Regidrago to survive two Flash Cannons from it. The remaining EVs go into Attack for maximizing damage output into various targets, most notably Celesteela.</p> <h1>Usage Tips</h1> <p>Using this Regidrago set is rather straightforward, as Outrage will usually be used or the respective coverage move for Steel-type Pokemon.</p> <p>However, Regidrago should use Scale Shot to outspeed certain base 100 Speed Pokemon and below, like Entei and SubSeed Rillaboom, breaking their Substitute while dealing damage.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 518399, "username": "Itchy"}, {"user_id": 430787, "username": "PA"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}]}], "writtenBy": [{"user_id": 526135, "username": "doc1203"}]}
  },
  "Glastrier": {"sets": [{"name": "Assault Vest"}, {"name": "Custap Berry"}, {"name": "Choice Band"}]},
  "Spectrier": {"sets": [{"name": "Taunt"}, {"name": "Disable"}, {"name": "Choice Specs"}, {"name": "Weakness Policy"}], "credits": {"teams": [{"name": "Previous version was written by", "members": [{"user_id": 464398, "username": "LBDC"}]}, {"name": "Previous version was quality checked by", "members": [{"user_id": 430787, "username": "PA"}, {"user_id": 520168, "username": "Murman"}]}, {"name": "Previous version was grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}]}], "writtenBy": []}}
}