{
  "Venusaur": {
    "overview": "<p>Venusaur's Ability in Chlorophyll, great coverage, and access to powerful residual damage with G-Max Vine Lash make it a top non-Restricted Pokemon in the VGC 2022 metagame. Venusaur also has access to fast Sleep Powder which can shut down much of the metagame. Groudon is commonly its partner in crime as its Drought sets sun activating Venusaur's Chlorophyll. Groudon also patches up Venusaur's Fire-type weakness against Pokemon such as Incineroar and Rotom-H, and Venusaur, in turn, checks Water-types such as Kyogre and Tapu Fini. However, Groudon and Venusaur share common weaknesses to Pokemon such as Kyurem-W and Calyrex-I, so Zacian-C is a good partner to check these Pokemon better.</p> ",
    "sets": [
      {
        "name": "Chlorophyll Attacker",
        "description": "<ul> <li> <p>Leaf Storm OHKOes Pokemon such as Groudon and Gastrodon and heavily dents Kyogre. When Dynamaxed, it becomes G-Max Vine Lash, which puts on even bigger pressure with its residual damage, able to finish off weakened opponents or Pokemon that rely on Focus Sash. Frenzy Plant provides a stronger G-Max Vine Lash with the downside of being less flexible outside of Dynamax.</p> </li> <li> <p>Weather Ball is used in conjunction with Groudon or Torkoal's Drought, becoming a powerful coverage move against opposing Steel-types. It turns into Max Flare under Dynamax, allowing Venusaur to OHKO Zacian-C with Life Orb and hit opposing Venusaur extremely hard.</p> </li> <li> <p>Earth Power is used to hit Incineroar and Zacian-C super effectively without relying on Weather Ball for the latter. It turns into Max Quake under Dynamax and boosts Venusaur's and its ally's Special Defense, letting it better take on strong special attackers such as Dialga and Palkia. Sludge Bomb hits Grimmsnarl and boosts Venusaur's Special Attack under Dynamax via Max Ooze.</p> </li> <li> <p>Sleep Powder is used to nullify threats and can potentially give Venusaur the upper hand in unfavorable matchups.</p> </li> <li> <p>A Modest nature is preferred because Venusaur does not need to outpace Regieleki under sun; however, a Timid nature can be used to grant it this luxury.</p> </li> <li> <p>With Life Orb, Venusaur can severely dent opposing teams with G-Max Vine Lash. The boost also allows it to OHKO Zacian-C with Max Flare and 2HKO Assault Vest Incineroar with Max Quake. Coba Berry protects Venusaur from the metagame's various Max Airstream users such as Landorus-T and Yveltal. Focus Sash allows Venusaur to survive one hit from Pokemon like Calyrex-S and Kyurem-W, letting it support teammates such as Groudon and Charizard with Sleep Powder when it doesn't want to Dynamax.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 517038, "username": "Giokio"}, {"user_id": 541847, "username": "Yourwelcomethanku"}]}, {"name": "Grammar checked by", "members": [{"user_id": 277988, "username": "dex"}]}], "writtenBy": [{"user_id": 518634, "username": "Sole Survivor"}]}
  },
  "Charizard": {
    "sets": [
      {
        "name": "Gigantamax",
        "description": "<p>Charizard is one of the strongest Pokemon in VGC 2022; under Groudon's sun, it obliterates nearly everything. It also easily snowballs with Max Airstream, and has good matchups into many common Pokemon like Zacian-C, Rillaboom, and Amoonguss. G-Max Wildfire's incredible residual damage sets up teammates like Groudon, Zacian-C, and Regieleki to sweep. Blast Burn and Hurricane give Charizard the strongest possible G-Max Wildfire and Max Airstream. Charizard's Max Airstream is a very potent snowballing tool and supports its team with Speed boosts. Heat Wave grants Charizard a great spread attack for when it's not Gigantamaxed, as Hurricane is inaccurate and Blast Burn has a recharge turn. Ancient Power allows Charizard to OHKO opposing non-Charti Berry Charizard via Max Rockfall. Solar Beam is used to OHKO the common Gastrodon with Max Overgrowth, and with Life Orb, it can even KO a chipped Kyogre. Life Orb makes Charizard nuclear, achieving feats like OHKOing physically defensive Incineroar, Dynamaxed Zapdos, and Assault Vest Yveltal. Charti Berry lets Charizard survive Rock-type moves such as Max Rockfall from Groudon, Landorus-T, and opposing Charizard. Lum Berry protects Charizard against status moves like Venusaur's Sleep Powder and Grimmsnarl's Thunder Wave.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 29010, "username": "Theorymon"}]}, {"name": "Grammar checked by", "members": [{"user_id": 277988, "username": "dex"}]}], "writtenBy": [{"user_id": 541847, "username": "Yourwelcomethanku"}]}
  },
  "Kyogre": {
    "overview": "<p>Kyogre is one of the most devastating Restricted Pokemon available in VGC 2022 thanks to its high Special Attack, supported by Drizzle boosting its Water-type moves, superb natural bulk, and access to two powerful spread moves in Water Spout and Origin Pulse. It has naturally strong matchups into the majority of the metagame, with standouts including Incineroar, Zacian-C, Landorus-T, and Groudon. Its base 90 Speed also leaves it in a wonderful spot, as Kyogre can operate under almost any speed control, with faster sets working well under Tailwind and Max Airstream support from Tornadus, Thundurus, and Zapdos, while slower, bulkier sets thrive under Trick Room from Calyrex-I, Mimikyu, and Porygon2. Not all goes swimmingly for Kyogre, however; VGC 2022's abundance of viable Electric-types in Regieleki, Thundurus, and Zapdos and Kyogre's centralizing nature means it has a large target on its back at all times. Grass-types like Venusaur, Amoonguss, Rillaboom, and Ferrothorn can also sponge its Water- and Electric-type attacks and threaten it back.</p> <p>For Kyogre users looking to avoid these pitfalls, pair it with Grass- and Ground- types like Amoonguss, Landorus-T, and Venusaur, which works well even when not used alongside Groudon, to help check the Electric-types. Teammates like Incineroar, Zapdos, and Tornadus can help put pressure on Grass-type foes. Kyogre's damage output is severely limited by damage reduction like Light Screen and Snarl, as well as ways to override rain like Groudon's Drought or Calyrex-I's Max Hailstorm. Kyogre can reverse these overrides with Max Geyser to reset its rain, however. Pokemon like Palkia, Lapras, and Gastrodon can completely wall Kyogre; to muscle past these, Kyogre should look to teammates like Play Rough Zacian-C, Regieleki, or Energy Ball Amoonguss.</p> ",
    "sets": [
      {
        "name": "Offensive",
        "description": "<ul> <li> <p>When Kyogre is at full HP, it should be using Water Spout in almost all cases, as the devastatingly strong and perfectly accurate attack is capable of OHKOing Zacian-C and Calyrex-S with ease at full power. Water Spout also serves as the base for Kyogre's Max Geyser, a powerful single target attack not reliant on its HP. Origin Pulse makes for a suitable alternate Water attack, as it also offers strong spread damage, though its shaky accuracy can be worrying.</p> </li> <li> <p>Thunder lets Kyogre hit opposing Water-types like Lapras, Blastoise, and other Kyogre for super effective damage. It can also use Max Lightning, which sets Electric Terrain, powering up subsequent Electric attacks and keeping it safe from Amoonguss's Spore. Ice Beam allows it to hit Grass-types for super effective damage as well as Palkia, Dialga, and Kyurem-W neutrally, though Max Hailstorm's effect of replacing rain with hail isn't nearly as useful in most cases.</p> </li> <li> <p>Mystic Water is Kyogre's best boosting item, since, unlike Choice Specs, it allows Kyogre to change moves and, unlike Life Orb, it doesn't drain any of its HP, crucial for keeping its Water Spout consistently strong. However, Life Orb makes Kyogre a monumental threat when Dynamaxed, giving it the strongest possible Max Geyser and boosting its other moves as well.</p> </li> </ul> "
      },
      {
        "name": "Choice Scarf",
        "description": "<ul> <li> <p>Water Spout is Kyogre's go-to move at full health, easily OHKOing Incineroar, Regieleki, and Calyrex-S. Should Kyogre need to Dynamax, it also provides the strongest possible Max Geyser.</p> </li> <li> <p>Origin Pulse is Kyogre's best backup Water move thanks to its high power and spread damage, becoming stronger than Water Spout once Kyogre is at 72% HP or less.</p> </li> <li> <p>Thunder and Ice Beam provide Kyogre with excellent coverage, with Thunder hitting Pokemon resistant to Water such as Lapras and opposing Kyogre, while Ice Beam can hit Grass-types like Amoonguss and Venusaur, as well as Gastrodon, which is immune to its other attacks.</p> </li> <li> <p>Choice Scarf allows Kyogre to outspeed Zacian-C and Calyrex-S without the need for any additional speed control, though a Timid nature is required to do this. Do note that Kyogre cannot outspeed Regieleki even with a Choice Scarf, so it will still need support to check it.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 426995, "username": "Namuko Pro"}, {"user_id": 517038, "username": "Giokio"}]}, {"name": "Grammar checked by", "members": [{"user_id": 277988, "username": "dex"}]}], "writtenBy": [{"user_id": 510951, "username": "zee"}]}
  },
  "Groudon": {
    "overview": "<p>VGC 22 is overrun by Zacian-C, Incineroar, and Regieleki, which all have one thing in common: a key weakness to Ground. Additionally, Kyogre's rain-boosted Water Spout makes it one of the most threatening Restricted Pokemon options available. Thankfully, we have Groudon, an offensive behemoth with a vital defensive niche thanks to the combination of Drought, excellent natural bulk, and Ground-typing, making it a great answer to all of the aforementioned Pokemon and more Groudon functions well with or without Dynamax, having the option to fire off spread Precipice Blades and gradually chip down opponents or launch single-targeted Max Quakes, boosting its Special Defense and packing a massive punch. Its wide range of coverage moves, including Fire Punch, Shadow Claw, and Rock Tomb, make it very customizable and allow for a variety of sets. Groudon is not without its faults, however, such as it relies on the shaky 85% accuracy of Precipice Blades and is at a disadvantage trying to win the weather against Kyogre. It also often has to give up Dynamaxing in favor of teammates like Charizard, Venusaur, and Thundurus, which significantly cuts into its offensive pressure.</p> ",
    "sets": [
      {
        "name": "Assault Vest",
        "description": "<ul> <li> <p>Precipice Blades, despite the accuracy concerns, is still Groudon's most effective way to deal damage. When Dynamaxed, Groudon can use Max Quake to boost its Special Defense, which is hugely effective in tandem with Assault Vest.</p> </li> <li> <p>Stone Edge is a strong option for hitting Pokemon immune to Ground like Thundurus, Charizard, and Yveltal, but Rock Tomb can be used to support Groudon's teammates by slowing down foes. Stone Edge also has the stronger Max Rockfall at 130 BP compared to Rock Tomb's 110.</p> </li> <li> <p>Fire Punch lets Groudon deal consistent Fire-type damage, as Heat Crash will fail against a Dynamaxed foe and does less damage to Zacian-C. Heat Crash, however, does more damage against most other non-Dynamaxed foes thanks to Groudon's weight stat, including getting the OHKO on Amoonguss.</p> </li> <li> <p>Shadow Claw lets Groudon OHKO Calyrex-S and do big damage to Lunala. Heavy Slam hits Grimmsnarl and provides Max Steelspike, giving it access to both defense-boosting Max Moves. Giga Impact is used for Max Strike, slowing down foes and keeping them in check for partners like Charizard, Zacian-C, and Calyrex-S.</p> </li> <li> <p>Assault Vest is massive for giving Groudon a leg up against special attackers; Kyogre, Calyrex-S, and Charizard all have a much harder time breaking through Groudon with additional Special Defense.</p> </li> </ul> "
      },
      {
        "name": "Attack Booster",
        "description": "<ul> <li> <p>Precipice Blades is Groudon's best Ground-type move and deals spread damage without threatening its partner. Max Quake can help Groudon by giving it Special Defense boosts to better matchup against Calyrex-S and Kyogre.</p> </li> <li> <p>Rock Slide hits many common Pokemon immune to Ground like Charizard and Thundurus, and can deal significant damage when Groudon has boosted Attack. Rock Tomb, while significantly less threatening offensively, can be a great help for its partners like Yveltal and Lunala, allowing them to outspeed the faster Pokemon like Thundurus, Zacian-C, and Calyrex-S.</p> </li> <li> <p>Swords Dance is Groudon's best way at counteracting Intimidate from Incineroar and Landorus-T. Bulk Up is slower to boost its Attack, but the Defense boost can help against physical attackers, such as making Zacian-C's +1 Behemoth Blade a guaranteed 3HKO and instantly garnering an advantage in Groudon wars. At +1 Attack, it can OHKO 252 HP / 4 Defense Zacian-C.</p> </li> <li> <p>Sitrus Berry and Leftovers provide Groudon with slight HP recovery which goes a long way to improve its longevity, but White Herb helps cancel out Intimidate drops as well as some annoying drops from Max Moves like opposing Max Wyrmwind, Max Phantasm, and Max Darkness.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 29010, "username": "Theorymon"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 501951, "username": "zee"}]}
  },
  "Gastrodon": {
    "sets": [
      {
        "name": "Defensive",
        "description": "<p>Gastrodon is the best check to Kyogre in the metagame; since Storm Drain and its Ground typing leave it immune to any Water- and Electric-type attacks, Kyogre can virtually only hit it with Ice Beam, Hyper Beam, and these moves' Max Moves. Gastrodon's solid bulk also means it matches up strongly against many other common Pokemon, like Zacian-C (especially ones without Play Rough), Incineroar, and Regieleki. It opts not to use a Water-type move, as Earth Power and Ice Beam already cover every Pokemon it would need to hit such as Incineroar, Landorus-T, Rillaboom, and Amoonguss. Gastrodon can also make a good situational Dynamax user in matches where it isn't scared of Grass-type moves, firing off Max Quakes to bolster its already respectable Special Defense. Yawn helps check opposing Dynamax users because, when timed correctly, they'll be forced to switch out or fall asleep without making full use of their Dynamax turns. Protect complements Yawn, stalling out the second turn necessary for the foe to fall asleep, and can temporarily keep Gastrodon safe from Grass-type moves and other powerful attacks. The EV spread allows Gastrodon to survive two Play Roughs from +1 Zacian-C, after a Protect in between, thanks to Leftovers recovery. Using 8 Speed IVs allows Gastrodon to underspeed Calyrex-I, which is vital to checking it under Trick Room.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 541847, "username": "yourwelcomethanku"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 501951, "username": "zee"}]}
  },
  "Whimsicott": {
    "overview": "<p>Whimsicott's Prankster Tailwind and lightning-fast playstyle make it a perfect choice for hyper offense teams, particularly those featuring Calyrex-S as a Restricted Pokemon. Due to the combination of Prankster and its high base Speed of 116, Whimsicott is the most reliable Tailwind setter in the metagame, making it a crucial pick for those that rely on moving first. It also comes armed with a bevy of support moves which allow it to fill all kinds of niches that very specific teams or cores may require, like fast Taunt, Sunny Day, or even the dreaded Switcheroo + Eject Button combo to disrupt opposing Dynamax users. Its Fairy-type attacks also pressure Dark-types like Yveltal and Grimmsnarl that are often used to counter Calyrex-S. However, Whimsicott does have glaring flaws; first and foremost, fast Tailwind is utterly ruined if the opponent is able to set up Trick Room. It also has to worry about being stopped in its tracks by Fake Out. Whimsicott's offensive presence is generally middling, so it relies on the power of partners like Calyrex-S, Kyogre, Kartana, and Regieleki to deal damage, often supported by its Helping Hand. This is a double-edged sword, however, as if its partner goes down during the turn, both it and its partner's efforts are effectively wasted.</p> ",
    "sets": [{"name": "Prankster Support", "description": "<ul> <li> <p>Moonblast is Whimsicott's best option for single-target damage, but spread Dazzling Gleam allows Whimsicott to put more damage on the board as a whole. Energy Ball can be used on Kyogre teams as a means to hit Gastrodon.</p> </li> <li> <p>Prankster Tailwind is nearly guaranteed to go up, making Whimsicott a vital component of hyper offense teams where speed is everything.</p> </li> <li> <p>Helping Hand is a universally beneficial way for Whimsicott to boost its ally's offensive pressure instead of relying on its relatively weak Fairy coverage.</p> </li> <li> <p>Taunt can disrupt the opponent's attempts to counter Whimsicott such as Trick Room and opposing Tailwind.</p> </li> <li> <p>Focus Sash preserves Whimsicott for a future Tailwind or Helping Hand support, as its middling defenses leave it OHKOed by the majority of the metagame's attacks otherwise.</p> </li> </ul> "}],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 541847, "username": "Yourwelcomethanku"}, {"user_id": 294287, "username": "yuki"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 501951, "username": "zee"}]}
  },
  "Tornadus": {
    "sets": [
      {
        "name": "Prankster Tailwind",
        "description": "<p>Tornadus is a very simple Pokemon with a clear objective: it clicks Prankster Tailwind. This is most popularly used to enable Pokemon like Kyogre and Calyrex-S, allowing them to hit hard and fast with their strong spread moves like Water Spout and Astral Barrage. When it comes to supporting Kyogre, it and Whimsicott are effectively as good as each other, but there are a few reasons why one would use Tornadus for this role over Whimsicott, the first being its stronger offensive presence. Tornadus's Hurricane is perfectly accurate when paired with Kyogre's rain, and it's able to pressure Grass-types like Rillaboom, Venusaur, and Kartana, which Whimsicott fails to do. Tornadus can also act as a Dynamax user in desperate situations and fire off powerful Max Airstreams to continue boosting its Speed. Icy Wind is another vital tool in the Speed race; it can slow down foes and potentially allow Tornadus to delay using Tailwind by a turn, which can make all the difference in fast-paced Tailwindversus Tailwind matchups. Protect and Focus Sash are both chosen to help Tornadus's longevity, as the more moves it can use to gain a Speed advantage for its team, the better. Mental Herb can be useful against opposing Tailwind structures, however, to circumvent a Taunt or Encore from opposing Whimsicott.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 541847, "username": "yourwelcomethanku"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 501951, "username": "zee"}]}
  },
  "Landorus-Therian": {
    "overview": "<p>Landorus-T stands out as VGC 2022's best non-Restricted Ground-type attacker, an important role in a metagame dominated by Incineroar, Zacian-C, Regieleki, and many more Pokemon weak to Ground. Intimidate and Fly, for Max Airstream, are both great for its utility. These tools make it a popular check to Groudon and Venusaur cores, as it can hit Venusaur hard and stand up well to almost anything Groudon can throw at it. If it can successfully set up a Swords Dance, it can also sweep entire teams with a well-timed Dynamax. However, Landorus-T is very, very reliant on Dynamax to get much accomplished, as Fly is nearly useless on its own, and Earthquake and Rock Slide are relatively weak without several Attack boosts, so plan accordingly and be careful when bringing Landorus-T with another Pokemon reliant on Dynamax. Landorus-T also struggles against the metagame's numerous Water- and Ice-types like Kyogre, Kyurem-W, Calyrex-I, and Lapras, which can OHKO it even while it's Dynamaxed. Therefore, partners like Zacian-C and Regieleki are vital to ensuring it can sweep effectively.</p> ",
    "sets": [
      {
        "name": "Swords Dance",
        "description": "<ul> <li> <p>While Earthquake might seem appealing as Landorus-T's strongest Ground move, its main appeal is in the form of Earthquake's main appeal isn't as a standalone STAB move but as a base for a powerful Max Quake, dealing which deals massive damage to even neutral targets like Kyogre, easily OHKOing OHKOes Pokemon weak to Ground like Zacian-C and Regieleki, and boosting its boosts Landorus-T's Special Defense, furthering its longevity.</p> </li> <li> <p>Fly is used to grant grants Landorus-T access to Max Airstream, vital for boosting its and its partner's Speed, as well as pressuring Grass-types like Venusaur, Rillaboom, and Amoonguss.</p> </li> <li> <p>Rock Slide is Landorus-T's best coverage option, notably hitting Flying-types like Zapdos, Thundurus, and Yveltal, but also enabling weather control with Max Rockfall if necessary.</p> </li> <li> <p>Swords Dance is vital for allowing Landorus-T to sweep and counteract Intimidate from Incineroar and opposing Landorus-T.</p> </li> <li> <p>White Herb allows Landorus-T to instantly counteract an Attack drop, commonly from Intimidate, Parting Shot from Incineroar, or Max Wyrmwind from Dragon-type Restricted Pokemon. Life Orb grants Landorus-T high immediate power; however, the damage output can drastically suffer when playing against double Intimidate cores. Lum Berry acts as a powerful safety net against Spore from Amoonguss, Sleep Powder from Venusaur, and Burning Jealousy from Incineroar and Torkoal, but it is weaker versus Intimidate and doesn't offer a power boost.</p> </li> <li> <p>Landorus-T needs a Jolly nature to outrun Calyrex-S and Zacian-C after a Max Airstream boost.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 541847, "username": "Yourwelcomethanku"}, {"user_id": 426995, "username": "Namuko Pro"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517423, "username": "Finland"}]}], "writtenBy": [{"user_id": 501951, "username": "zee"}]}
  },
  "Incineroar": {
    "overview": "<p>Incineroar is the metagame's best support Pokemon with invaluable utility moves like Fake Out and Parting Shot, as well as its defensive typing and Intimidate, which let it check many common Pokemon like Zacian-C, Calyrex-S, and Calyrex-I. Incineroar is especially valuable around Restricted Pokemon and Dynamax and Gigantamax users, as not only does it check the former, but it also supports them and other extremely powerful Pokemon like Gigantamax Charizard. Fake Out pins down foes for them, while Parting Shot pivots them in safely. Incineroar's good qualities are so valuable that it can fit on nigh any team and perform well.</p> ",
    "sets": [
      {
        "name": "Bulky Utility",
        "description": "<ul> <li> <p>Flare Blitz is necessary to slam Steel- and Grass-types like Zacian-C and Amoonguss.</p> </li> <li> <p>Fake Out allows Incineroar to prevent a foe from moving, giving its teammates safer opportunities to set up or attack.</p> </li> <li> <p>Parting Shot weakens a foe and lets Incineroar pivot its teammates in safely, the latter especially thanks to Incineroar's low Speed.</p> </li> <li> <p>Throat Chop enormously damages Calyrex-S to the point of activating its Focus Sash, and it can block Parting Shot from opposing Incineroar.</p> </li> <li> <p>Taunt shuts down status moves like Amoonguss's powder moves, Thundurus's and Grimmsnarl's Prankster-supported moves, and Calyrex-I's and Porygon2's Trick Room.</p> </li> <li> <p>Burning Jealousy can severely punish Max Moves like Thundurus's Max Airstream, Groudon's Max Quake, and Solgaleo's Max Quake, and it is especially useful with Shuca Berry to better withstand Max Quake.</p> </li> <li> <p>Shuca Berry is useful to withstand the metagame's bountiful Ground-type attacks from the likes of Landorus-T and Groudon. Sitrus Berry simply improves Incineroar's longevity. Safety Goggles gives Incineroar immunity to Amoonguss's and Venusaur's powder moves.</p> </li> <li> <p>Defense investment helps with the metagame's powerful physical attackers like Zacian-C and Calyrex-I; 156 Defense EVs allow Incineroar to very consistently survive Zacian-C's +1 Sacred Sword. Maximum Speed investment is viable on teams with Tailwind to outpace Calyrex-S and Zacian-C. A specially defensive EV spread like 252 HP / 124 Def / 132 SpD with a Careful nature survives Life Orb Regieleki's Max Lightning and Calyrex-S's Max Quake.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 517038, "username": "Giokio"}, {"user_id": 29010, "username": "Theorymon"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 541847, "username": "Yourwelcomethanku"}]}
  },
  "Kartana": {
    "sets": [
      {
        "name": "Dynamax Attacker",
        "description": "<p>Kartana's high Attack stat and access to great Max Moves make it an excellent addition to Kyogre teams, where it can remove Gastrodon from play and boost Kyogre's Speed with Max Airstream. Kartana works best as a late-game sweeper, KOing a weakened foe and gaining enough momentum withBeast Boost for it and its partner to sweep through the game. Kartana really needs all four of its coverage moves, as Smart Strike does the most damage to Zacian-C and Calyrex-I, Sacred Sword is necessary to hit Incineroar, and Aerial Ace—via Max Airstream—is essential for winning Speed wars against other common Dynamax users on opposing Kyogre teams like Thundurus, Tornadus, Landorus-T, and opposing Kartana. Max Knuckle from Sacred Sword also helps Kartana snowball through teams quickly, particularly if Zacian-C is in with Kartana to also gain the Attack boosts. White Herb and Life Orb help Kartana maximize its damage output, with the former cancelling out Intimidate and the latter giving it the strongest possible attacks while. Dynamaxed. Assault Vest is an option to patch Kartana's laughable Special Defense, though note that Assault Vest Kartana should use 244 Special Defense EVs to further weather special attacks.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 29010, "username": "Theorymon"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 501951, "username": "zee"}]}
  }
}