{
  "Clefable": {"sets": [{"name": "Calm Mind"}, {"name": "Utility"}]},
  "Slowbro": {"sets": [{"name": "Defensive Pivot"}]},
  "Gengar": {"sets": [{"name": "Choice Specs"}, {"name": "Nasty Plot"}]},
  "Gyarados": {"sets": [{"name": "Dragon Dance"}]},
  "Aerodactyl": {"sets": [{"name": "Choice Band"}]},
  "Slowking": {"sets": [{"name": "RegenVest"}]},
  "Tyranitar": {"sets": [{"name": "Offensive"}, {"name": "Choice Band"}]},
  "Salamence": {"sets": [{"name": "Dragon Dance"}]},
  "Hippowdon": {"sets": [{"name": "Defensive"}]},
  "Weavile": {"sets": [{"name": "Swords Dance"}, {"name": "Choice Band"}]},
  "Rotom-Heat": {"sets": [{"name": "Defensive Pivot"}]},
  "Rotom-Wash": {"sets": [{"name": "Defensive Pivot"}]},
  "Heatran": {"sets": [{"name": "Offensive"}, {"name": "Defensive"}]},
  "Excadrill": {"sets": [{"name": "Offensive"}]},
  "Seismitoad": {"sets": [{"name": "Defensive Pivot"}]},
  "Ferrothorn": {
    "sets": [
      {
        "name": "Utility",
        "description": "<p>Ferrothorn's excellent defensive typing, great stat spread, and wide utility movepool make it a premier entry hazard setter in STABmons. Grav Apple is the primary STAB move, offering consistent damage, allowing Ferrothorn to break through defensive Pokemon like Clefable and Sylveon with repeated Defense drops, and breaking Gyarados's Substitute. Anchor Shot can be used to trap foes like Hippowdon and Zeraora, with stat drops from Grav Apple and Strength Sap heavily helping Ferrothorn remove these targets from play. Knock Off is an alternative utility option that can be used to remove Leftovers and Heavy-Duty Boots from the likes of Heatran, Tornadus-T, and Rotom-H, cutting into their longevity and making them more vulnerable to Ferrothorn's hazards. Other viable utility options include Toxic, which further cripples switch-ins like Rotom-H but in return leaves Ferrothorn helpless against Steel-types like Corviknight and the aforementioned Heatran, and Aromatherapy, which is useful on defensive teams that benefit from Ferrothorn taking a cleric role. Ferrothorn fits best on balance teams, with defensive Water-types like Toxapex and Slowking offering fantastic type synergy, soaking up strong Fire- and Fighting-type attacks from Cinderace and Keldeo. Ferrothorn deals with threats like Zeraora and Rillaboom in return. Stealth Rock users like Tyranitar and Clefable form a strong hazard core with Ferrothorn, with the former heavily pressuring Rotom-H and also greatly appreciating the chip damage that Spikes provides, while the latter can reliably remove hazards and handle Fighting-types like Buzzwole, which Ferrothorn has trouble with. Wallbreakers like Thundurus-T, Reuniclus, and Aerodactyl make for good partners, profiting off Ferrothorn's hazards and ability to check faster revenge killers like Weavile and Zeraora.</p> "
      },
      {
        "name": "Cotton Guard",
        "description": "<p>Cotton Guard turns Ferrothorn into a formidable wall, checking many of the tier's strongest setup sweepers including Excadrill, Dracozolt, and Gyarados. It also makes for a solid wincon thanks to Cotton Guard increasing the damage output of Body Press. Spikes synergizes excellently with this strategy, as Ferrothorn can use the threat of boosted Body Press to force out common entry hazard removers like Corviknight and Tornadus-T. Strength Sap allows Ferrothorn to further challenge physical attackers that may otherwise muscle through Cotton Guard boosts. Alternatively, Anchor Shot can be used instead of Spikes, trapping Pokemon like Hippowdon, Clefable, and opposing Ferrothorn that may otherwise exploit an unboosted Ferrothorn to set up hazards. Ferrothorn makes great use of Leftovers's passive recovery, notably using it to avoid a 2HKO from Aerodactyl's Brave Bird. Chople Berry can be run to let Ferrothorn lure in Fighting-types like Urshifu-R, Buzzwole, and Terrakion. Ferrothorn fits best on balance and offense teams that require a blanket check to physical attackers, and their offensive cores can make full use of Spikes chip damage and weaken foes into range of Body Press. VoltTurn Pokemon like Rotom-H and Thundurus-T are therefore great options, as are strong wallbreakers that can remove Heavy-Duty Boots, like Tyranitar and Weavile. Rapid Spin users are also appreciated for removing opposing hazards without removing Ferrothorn's Spikes, with Sylveon and Calm Mind Clefable being two particularly notable examples that also offer a Fighting resistance.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 517892, "username": "pannuracotta"}, {"user_id": 324242, "username": "in the hills"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 407249, "username": "Greybaum"}]}
  },
  "Tornadus-Therian": {"sets": [{"name": "Offensive Pivot"}, {"name": "RegenVest"}, {"name": "Defog"}]},
  "Thundurus-Therian": {"sets": [{"name": "Offensive"}, {"name": "Stallbreaker"}]},
  "Toxapex": {"sets": [{"name": "Defensive"}]},
  "Buzzwole": {"sets": [{"name": "Offensive"}, {"name": "Choice Scarf"}, {"name": "Defensive"}]},
  "Zeraora": {
    "sets": [
      {
        "name": "Bulk Up",
        "description": "<p>With a blisteringly fast Speed tier and strong Electric typing, Zeraora reliably pressures many offensive and defensive threats alike, generating Bulk Up opportunities on Pokemon such as Urshifu-R, Tornadus-T, Slowbro, and Corviknight. Close Combat is Zeraora's primary coverage move and strongest option for hitting Electric-resistant Pokemon, notably hitting Ferrothorn and Excadrill for super effective damage. Knock Off removes Heavy-Duty Boots from offensive Thundurus-T and physically defensive walls like Seismitoad and Buzzwole, giving Zeraora a better chance of breaking through them. Leftovers is a viable option over Heavy-Duty Boots, allowing Zeraora to gain passive recovery while setting up, but Heavy-Duty Boots is typically preferred, as Zeraora is often forced into a hit-and-run role until the opposing team is sufficiently weakened.</p> <p>Zeraora is best paired with Spikes support, with Skarmory in particular walling Grass- and Ground-types like Tangrowth and Mudsdale that give it trouble. Seismitoad is also excellent for this role, forming a VoltTurn core with Zeraora and benefiting from its ability to pressure Defog users like Corviknight and Tornadus-T. Rillaboom and Buzzwole are also very strong pivots that pair well with Zeraora, pressuring Ground-types like Gastrodon and Seismitoad while luring in Flying-types that Zeraora can accumulate boosts against. Lastly, Victini can be a great partner, with dual screens giving Zeraora an easier time using Bulk Up while Zeraora offers a safety net against fast breakers like Aerodactyl.</p> "
      },
      {
        "name": "Offensive Pivot",
        "description": "<p>Zeraora uses its mixed offenses and uncontested Speed tier to pose as a threatening offensive pivot, forcing out other fast threats like Aerodactyl and Terrakion with its strong physical coverage and utilizing Volt Switch to gain momentum on switch-ins like Rotom-H and Buzzwole. Close Combat and Grass Knot are Zeraora's most reliable coverage moves, doing significant damage to many of the tier's Electric-resistant Pokemon, particularly Ground-types like Excadrill, Seismitoad, and Mudsdale. Its ability to force these opponents out allows Zeraora to use Volt Switch with much more ease. Alternatively, Knock Off can be used to remove longevity increasing items like Heavy-Duty Boots and Leftovers from Pokemon like Thundurus-T and Nidoqueen, respectively, as well as minimizing the residual damage taken from Rocky Helmet users such as Buzzwole and Ferrothorn. Knock Off also synergizes well with Volt Switch, with the moves working in tandem to quickly put foes in range of Zeraora's stronger attacks. Toxic is an alternative option that can hit all of the above targets bar Nidoqueen, but the prevalence of Shore Up among Zeraora's switch-ins makes it difficult to maintain chip damage, resulting in Zeraora being much more reliant on its teammates to make progress.</p> <p>Grass Knot still fails to significantly damage Gastrodon in addition to aforementioned Electric-resistant Pokemon like Rotom-H and Thundurus-T, so wallbreakers like Tyranitar, Kyurem, and Latios are fantastic teammates, with Tyranitar in particular greatly appreciating Zeraora's ability to lure and remove physically defensive Ground-types. Keldeo is another strong example, pressuring the above Pokemon and forming a VoltTurn core with Flip Turn and greatly appreciating Zeraora's ability to pressure Water-types like Slowking and Seismitoad. If using Knock Off, reliable entry hazard setters are vital for weakening switch-ins; Skarmory and Ferrothorn fill this role well and provide an answer to Sand Rush Excadrill, one of the few Pokemon in the tier that can reliably outpace Zeraora, while also switching into Ground-types like the aforementioned Seismitoad. Similarly, Tornadus-T can form an excellent VoltTurn core with Zeraora, weakening shared answers like Rotom-H and maintaining damage on physically defensive walls like Clefable and Seismitoad with Taunt.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 464398, "username": "LBDC"}, {"user_id": 511624, "username": "fc"}]}, {"name": "Grammar checked by", "members": [{"user_id": 226455, "username": "berry"}, {"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 407249, "username": "Greybaum"}]}
  },
  "Cinderace": {
    "sets": [
      {
        "name": "Pivot",
        "description": "<p>Cinderace is an effective wallbreaker and pivot thanks to its access to Fire Lash and a STAB-boosted U-turn via Libero, chipping away at even bulky walls as their Defense gets dropped. High Jump Kick pressures Heatran and does the most damage to Seismitoad and Tyranitar, which can't hit a Fighting-type Cinderace super effectively. Zen Headbutt can deal with Toxapex after a Fire Lash, while Court Change is very useful as a means of entry hazard control, especially against offense teams. Offensive Water-types like Keldeo and Urshifu-R heavily benefit from Cinderace slowly wearing the aforementioned Pokemon down with U-turn and its coverage, allowing them to wallbreak far more effectively. Cinderace can't effectively break Hippowdon, especially if it holds Rocky Helmet, so a strong entry hazard-stacking core with Ferrothorn and Seismitoad is appreciated. Seismitoad can also serve as a slow pivot with Flip Turn to bring Cinderace in more easily. Faster Pokemon like Zeraora and Weavile, Choice Scarf users like Urshifu-R, and Accelerock users like Terrakion and Tyranitar also help Cinderace against faster but frail targets such as Tornadus-T, Aerodactyl, and Alakazam.</p> "
      },
      {
        "name": "Choice Band",
        "description": "<p>Choice Band Cinderace is a powerful force in the metagame, applying heavy pressure to defensive cores with its raw power. Sacred Fire threatens switch-ins with a burn, heavily limiting the natural longevity of walls like Seismitoad. U-turn is good long term for pivoting and dealing small bits of damage, while High Jump Kick and Zen Headbutt hit the entire tier for at least neutral damage. Heatran and Toxapex are the primary targets of those moves, respectively, but both are more risky due to their miss chance and the existence of Ghost-types like Runerigus able to punish the use of High Jump Kick. Choice Band makes Cinderace quite prediction reliant, meaning bulky cores made of Pokemon like Toxapex and Hippowdon can give it some trouble. Future Sight users such as Slowbro and Slowking assist Cinderace greatly, as Pokemon that could switch into Sacred Fire like the aforementioned Toxapex and Hippowdon would then be 2HKOed after taking a Future Sight. Strong wallbreakers like Dragon Energy Latios, Nidoking, and Kyurem can also very easily punch holes in the opposing team after a physically defensive wall like Slowbro is forced to take a U-turn from Cinderace. Without Heavy-Duty Boots, Choice Band Cinderace is very susceptible to opposing entry hazards, especially if a wall like Hippowdon switches in to check it and set them, so entry hazard control from the likes of Corviknight and Clefable also helps greatly.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 324242, "username": "in the hills"}, {"user_id": 464398, "username": "LBDC"}]}, {"name": "Grammar checked by", "members": [{"user_id": 297659, "username": "deetah"}]}], "writtenBy": [{"user_id": 511624, "username": "Fc"}]}
  },
  "Corviknight": {"sets": [{"name": "Defensive Pivot"}]},
  "Dracozolt": {"sets": [{"name": "Dragon Dance"}, {"name": "Substitute"}]},
  "Urshifu-Rapid-Strike": {"sets": [{"name": "Choice Scarf"}, {"name": "No Retreat"}]}
}